{
    "Molecular Biology & Genetics": {
        "for-loop": [
            "Mitochondria Sonication Experiment:Repeat sonication of mitochondria in a Branson 450 sonicator using aconitase buffer (50 mM Tris, 30 mM sodium citrate, 0.5 mM MnCl2, 0.2 mM NADP, pH 7.3) four times, each for 15 seconds.Monitor the citrate to alpha-ketoglutarate conversion at 340 nm at 25°C, utilizing 2 units/ml of isocitrate dehydrogenase in 50 mM Tris, 1 mM cysteine, 1 mM sodium citrate, 0.5 mM MnCl2 at pH 7.4. Reactivate aconitase with 2 mM dithiothreitol and 0.2 mM ferrous ammonium sulfate for 5 minutes, then repeat the enzymatic activity assay once.",        
            "Gene Amplification (PCR) Experiment: 1. Prepare the experiment: prepare the PCR reaction mixture including template DNA, primers, dNTPs, buffer, DNA polymerase. 2. Set up the PCR program: repeat 30 times(a fixed number of cycles), each cycle consists of three main steps: denaturation (94-98°C to separate the DNA double strands), annealing (50-65°C, primers bind to the template DNA), and extension (72°C, DNA polymerase synthesizes new DNA strands). 3. Perform PCR: place the PCR mixture into the PCR instrument and start the preset cycling program.4. Analyze results: Analyze PCR products using methods such as gel electrophoresis to confirm that the target DNA fragments have been successfully amplified."
        ],
        "while-loop": [
            "Cell culture: 1. Prepare medium: prepare appropriate medium according to cell type. 2. Inoculate cells: Add cell suspension to culture flasks containing culture medium. 3. Continuous monitoring: Observe the cell growth status and density periodically. Repeat the culture as long as the cells have not reached the harvested density. 4. Harvest cells: When the cells reach the expected density, harvest the cells for the next experiment or for passaging culture.",
            "NMR Sample Preparation and Data Collection: Treat sample with deuterium exchange, freeze-drying, and reconstitution in D2O with t-BuOH as an internal reference. Repeat this process until the sample is fully prepared for NMR analysis. Adjust sample concentration to the minimum necessary for reproducible 2D NMR. If contamination is suspected, convert the sample to its sodium salt form and dialyze against water before freeze-drying and repeating the deuterium exchange. Collect spectra at 30 °C on a Bruker Avance III 500. Adjust data acquisition parameters as needed and employ solvent-suppression techniques. Repeat spectra collection with adjustments until optimal data quality is achieved, ensuring reproducibility and clarity of NMR signals."
        ],
        "if-branch": [
            "Brown Adipocyte Respiration Protocol: Prepare cells as described in the first two steps of the intact brown adipocyte respiration protocol. On the day of the experiment, thaw 1x MAS and pre-made substrate solutions. Prepare 10x solutions of inhibitors in 1x MAS. If using fatty acid substrates, prepare them freshly as described. Soak the cartridge for at least 3 hours before loading. Load specified volumes into ports A-D and calibrate the cartridge. Prepare 7.5 nM PMP in 1x MAS, gently wash cells with 1x MAS once, completely evacuate the wash, and add 450 µl 1x MAS with 7.5 nM PMP. Perform the Seahorse assay with 2-3 measurements per condition, ensuring not to exceed 1 hour before injecting Antimycin A to maintain mitochondrial integrity.",
            "tFIRE Protocol: If you are confident in your TF/DNA complex 3D structure, use tFIRE's default function trained on all available TF/DNA structures in the PDB database. Alternatively, you can construct your own energy function with tFIRE using several non-homology structures. Use the PISCES server to get a subset of your input structure list with little homology. If you are not confident in your TF/DNA structure, train tFIRE with a single structure to subsequently predict PWMs."
        ],
        "allocate-statement": [
            "Bile Processing Protocol: Collect bile in sterile bottles from patients with biliary tubes. Centrifuge at 3000g for 10 minutes at 4°C to remove sediment and debris. Aliquot the clear bile into 1 ml volumes in microcentrifuge tubes. Store the aliquots at -20°C for future use. ",
            "Bacterial Culture Freezing Protocol: Inoculate 5 ml LB medium containing 100 µg/ml ampicillin with bacteria. Incubate overnight on a roller to ensure growth. Mix 800 µl of the culture with 200 µl of sterile 100% w/v glycerol in a sterile screw-cap freezer tube. After mixing by inversion, freeze solid in dry ice. Store the frozen cultures at -80°C."
        ],
        "deallocate-statement": [
            "Differential Scanning Calorimetry (DSC) Protocol: Load 0.7 ml buffer into both reference and sample cells. Heat from 0 to 120 °C at a rate of 1 degree/min. Refresh the reference cell with 0.7 ml of fresh buffer and the sample cell with 0.7 ml of protein solution. Heat again from 0 to 120 °C at 1 degree/min, ensuring the system is reset for accurate measurement.",
            "Hydroxyapatite Crystal Synthesis Protocol: Heat orthophosphate in a PTFE beaker at 210°C for two weeks to prepare polyphosphate. In a high-pressure PTFE reactor, mix 0.5g polyphosphate with 0.6-0.7g calcium oxide and 12-14ml water. Seal and heat the mixture at 200-240°C for 5-7 days. Deallocate by cooling down the reactor, concluding the synthesis phase and allowing for the collection of hydroxyapatite crystals."
        ],
        "function-procedure-call": [
            "Adapter Pair Preparation and Restriction/Ligation Protocol: Mix adapter oligonucleotides to 250 ng/µl, incubate at 95 °C for 5 min, then room temperature for 10 min for adapter preparation. For restriction/ligation, combine ligase buffer, NaCl, adapter pair, T4 ligase, Mse I enzyme, genomic DNA, and water to 10 µl total volume. Incubate at 37 °C for 2-3 hours. Dilute the reaction 1:10 with water, store at -20 °C. Perform pre-selective amplification using Taq DNA polymerase buffer, MgCl2, dNTPs, Taq DNA polymerase, adapter-specific and transposon-specific primers, product from restriction/ligation, and PCR amplify with a specific thermal cycling program. Analyze the PCR products via 454-pyrosequencing for selected size ranges (150-550 bp).",
            "RCA Assay and One-Step Hybridization Protocol: Prepare ligation solution, add circular DNA and target DNA/RNA, incubate at room temperature, then deactivate the enzyme. Store the padlock DNA. Prepare the RCA reaction mixture, add padlock DNA, incubate, then inactivate. This produces RCA amplicons. For hybridization, mix capture probe-conjugated magnetic beads, reporter probe, and RCA amplicons. Incubate, separate phases with a magnet, wash, and resuspend for electrochemical detection. Perform differential pulse voltammetry on the electrode with the hybridization reaction for detection."
        ],
        "function-procedure-declaration": [
            "Isolation of G4 Deletion Alleles in C. elegans: Clone out dog-1 animals onto plates, optionally freeze half as backup. Rinse worms in M9, transfer to PCR plates, add lysis buffer, and proceed with lysis and proteinase K inactivation. Perform nested PCR on lysis mix to identify positive populations for germline mutations. Analyze PCR products on agarose gel. For positive populations, chunk corresponding plate, grow to starvation, and repeat the process to confirm deletions. Perform nested PCR on progeny to confirm homozygosity of deletion alleles. Sequence PCR product for deletion characterization. Backcross new strain to N2 to clean genetic background.",
            "Rolling Circle Amplification (RCA) and One-Step Hybridization: Prepare ligation solution with DNA ligase buffer, T4 DNA ligase, and water. Add circular DNA and target DNA/RNA, incubate at room temperature, then deactivate the enzyme. For RCA, mix dNTPs, phi29 polymerase buffer, phi29 DNA polymerase with Padlock DNA. Incubate and perform heat inactivation to obtain RCA amplicons. Conduct one-step hybridization by mixing RCA amplicons with capture and reporter probes. After incubation, apply a magnet to separate phases, wash, and resuspend for electrochemical detection."
        ],
        "add-arithmetic-operator": [
            "Sodium Hypobromite Preparation for Hypochlorous Acid Analysis: Prepare dilute sodium hypobromite by mixing equal volumes of lab bleach and 4% NaOH, then adding 1.03g NaBr in 100ml 4% NaOH. To the analysis sample and standards, add 500µl dilute hypobromite to each in distilled water, then add 250µl 6N HCl and 500µl 5% p.dimethylaminobenzaldehyde in n.propanol. Mix and heat at 70°C for 15 minutes, cool, and measure absorbance at 560 nm. Construct a standard curve to calculate sample values.",
            "Oligofection Protocol for Cell Culture: Prepare poly-D-lysine coverslips. Plate 15-20x10^3 cells per coverslip 2 days before oligofection. Mix 175µl Optimem with 1-10µl siRNA oligos (200 nM) per coverslip. Combine 11µl Optimem with 4µl Oligofectamine per coverslip and wait for 7 minutes. Combine solutions from steps 2 and 3 and wait for 15 minutes. During incubation, change medium to 800µl Optimem per coverslip. Add mixture from step 4 to the cells in Optimem. Incubate cells for at least 4 hours. Without removing Optimem, add 1ml of antibiotic-free culture medium with 20% FCS/FBS."
        ],
        "minus-arithmetic-operator": [
            "Plasmid DNA Injection in Mice: Dilute plasmid DNA in sterile PBS to achieve the desired concentration for injection. Load 2mL of the DNA solution into a 3mL syringe equipped with a 27-gauge needle, ensuring no air bubbles. Warm the mouse under a heat lamp for 1-2 minutes, then secure it in a Mouse Tail Illuminator. Inject the DNA solution into the tail vein within 5-7 seconds and return the mouse to its cage, noting that it may be less active temporarily but should recover within 10 minutes.",
            "Ultracentrifugation for Serum or Plasma Protocol: Start with 500µL of serum or plasma, then add PBS to reach a total volume of 2.3-2.5mL in an ultracentrifuge tube. Centrifuge at 100,000 x g for 70 minutes at 4°C, discard the supernatant, and resuspend the pellet in PBS to the original volume. Repeat centrifugation under the same conditions, discard the supernatant, and resuspend the pellet in 50µL PBS for storage at -80°C or proceed with RNA isolation by adding 700µL Qiazol."
        ],
        "multi-arithmetic-operator": [
            "Bacterial Culture Preservation: Inoculate 5ml LB medium containing 100µg/ml ampicillin with cells and grow overnight on a roller. Mix 800µl of the culture with 200µl of 100% w/v glycerol in a sterile screw cap freezer tube. Invert the tube several times for thorough mixing. Freeze the tube in dry ice until solid. Store the frozen culture at -80°C for long-term preservation.",
            "Trypsinization of Islets: Add 300µl trypsin to the islet pellet and incubate for 5 minutes at 37°C in a water bath. Pipette the islets up and down 10 times using a 1ml pipette to disperse the cells. To stop trypsin activity, add 3-5ml complete CMRL medium. Centrifuge at 305 x g for 5 minutes, discard the supernatant, and resuspend cells in 1ml complete CMRL. Incubate trypsinized cells at 37°C in a 5% CO2 incubator for 1-2 hours for recovery before further experiments."
        ],
        "devid-arithmetic-operator": [
            "Cell Culture and Supernatant Collection Protocol: Plate human embryonic stem cells (hESCs), neonatal rat ventricular myocytes (NRVMs), and KMBC cholangiocarcinoma cells at 1 million cells/mL. After 24 hours, switch to serum-free or extracellular vesicle (EV)-cleared media. Collect supernatant after 24 hours for hESCs and 48 hours for NRVMs or KMBCs. Perform a two-step centrifugation: first at 500 x g for 10 minutes, then transfer the supernatant and centrifuge at 2,000 x g for another 10 minutes. Store the final cell-free supernatant at -80°C.",
            "Hamster Clindamycin Treatment and C. difficile Infection: Weigh each hamster and administer 100µL of clindamycin via gavage, calculating the dose as 30 mg/kg body weight. Adjust the clindamycin concentration with DMEM for correct dosing. After 5 days, gavage 100µL of C. difficile spores, with the spore concentration adjusted to achieve an infectious dose of about 100 spores. Monitor for signs of infection, such as wet tail, poor fur coat, lethargy, or loss of 15% body weight, typically appearing 2-4 days post-infection. Humanely euthanize moribund animals following approved IACUC protocols and record the time to reach moribund state."
        ],
        "and-arithmetic-operator": [
            "Serum or Plasma Ultracentrifugation and RNA Isolation Protocol: Begin with 1 ml of serum or plasma per replicate. Adjust the volume with PBS to fill an ultracentrifuge tube. Centrifuge at 100,000 x g for 90 minutes at 4°C, discard the supernatant, and resuspend the pellet in PBS. Repeat centrifugation at 100,000 x g for 70 minutes at 4°C, remove the supernatant. For RNA isolation, resuspend the pellet in 1 ml Qiazol.",
            "Differential Scanning Calorimetry Protocol: Load 0.7 ml of buffer into both reference and sample cells. Heat from 0 to 120 °C at a rate of 1 degree/min. Refresh the reference cell with 0.7 ml of new buffer and the sample cell with 0.7 ml of protein solution. Again, heat from 0 to 120 °C at 1 degree/min, ensuring precise thermal analysis of the protein."
        ],
        "or-arithmetic-operator": [
            "S2 Cell Culture and Stimulation Protocol: Seed S2 cells at 1 x 10^6 cells/ml in conditioned medium in tissue culture plates. Incubate at 28°C and split cells at a 1:2 to 1:5 dilution based on cell density. For LPS or PGN stimulation, optionally pretreat cells with 1 µM 20-hydroxy-ecdysone for 24 hours before stimulation.",
            "Lysis Buffer Preparation and Blood Sample Analysis: Prepare lysis buffer by diluting the fixative solution 1:200 under a chemical hood. In a tube, mix 500 µl lysis buffer and 10 µl conjugate panel with 2-50 µl of blood (venous or capillary), incubate for 15 minutes in the dark at room temperature. Acquire data using a 3-laser cytometer, then dispose of waste according to biohazard protocols."
        ],
        "not-arithmetic-operator": [
            "Exosome Precipitation from Serum: Transfer 200µL of serum into a microfuge tube. Add 50µL of ExoQuick Exosome Precipitation Solution, then incubate for 30 minutes at 4°C. Centrifuge the mixture at 1,500 x g for 30 minutes at room temperature, then remove the supernatant. Perform a brief centrifuge at 1,500 x g for 5 minutes to collect any residual solution and carefully remove all remaining fluid. Resuspend the exosome pellet in 20µL of sterile PBS. ",
            "Exosome RNA Isolation from Serum: Transfer 500µL of serum into a microfuge tube. Mix with 125µL of ExoQuick Solution and incubate for 30 minutes at 4°C. Centrifuge at 1,500 x g for 30 minutes, aspirate the supernatant carefully. Spin down any residual solution at 1,500 x g for 5 minutes, then fully remove all liquid. Resuspend the pellet in 50µL PBS and proceed with RNA isolation using the SeraMir Exosome RNA Purification Column Kit.",
            "Zebrafish Sample Preparation for Downstream Analysis: Place 10-300mg of zebrafish tissue in microcentrifuge tubes without dechorionation for unhatched fish. Add double the mass of zirconium oxide beads to each sample mass. Add twice the buffer volume relative to the fish mass (e.g., 200µL buffer for 100mg fish). Blend the samples in a Bullet Blender™ at speed 8 for 3 minutes. Proceed immediately with downstream applications."
        ],
        "assignment-expression": [
            "Luminescence Detection in Cell Culture: Culture cells in a 96-well plate, arranging by time point. Allow the plate to reach room temperature for 30 minutes. Set aside control wells with medium only to determine background luminescence. Add luciferin solution to each well in a 1:1 ratio with the cell culture medium. Gently shake the plate for 5 seconds to mix. Immediately measure luminescence using a plate reader, choosing a measurement time between 1 to 10 seconds based on equipment sensitivity.",
            "Urokinase Activity Assay: Prepare a urokinase standard solution at 400 units/ml in water and make serial dilutions in Tris buffer to obtain concentrations of 300, 200, 100, and 50 units. Add 200µl Tris buffer to each assay well and incubate at 37°C for 5 minutes. Add 25µl of each standard or sample to the wells and incubate for 1-2 minutes. Introduce 25µl of substrate to each well, incubate at 37°C for 5 minutes, then stop the reaction with 25µl of 20% acetic acid. Measure absorbance at 405 nm and calculate urokinase activity using the formula U/l = Absorbance x 229."
        ],
        "raise-statement": [
            "Molecular Dynamics (MD) Simulation for Protein Analysis: Choose proteins like lysozyme, proteinase K, and thaumatin crystallized by various methods for the study. Place all selected proteins in a simulation box and solvate. Perform system minimization to eliminate high-energy configurations. Equilibrate the system for 10 ns at both 300K and 500K to observe protein stability and conformational changes at different temperatures. Analyze protein behavior by examining the radius of gyration and RMSD, normalizing these measurements for comparison.",
            "RNA Editing Analysis Using RNAEditingIndexer: Remove duplicate reads and align them to the reference genome, retaining only uniquely mapped reads. Run RNAEditingIndexer with BAM files and the reference genome as inputs, adjusting for Alu repeats in humans or B1 and B2 repeats in mice. Ensure the preparation of necessary regions, annotations, and SNPs files if not automatically supported. Monitor logs and screen outputs for errors, as some may not halt the program."
        ],
        "interger-type-declaration": [
            "Differential Scanning Calorimetry (DSC) Procedure: Load 0.7 ml of buffer into both reference and sample cells. Heat the system from 0°C to 120°C at a rate of 1 degree per minute. Refill the reference cell with 0.7 ml of fresh buffer and the sample cell with 0.7 ml of protein solution. Again, heat from 0°C to 120°C at 1 degree per minute to analyze protein stability.",
            "Bile Sample Preparation for Analysis: Collect bile from patients into sterile bottles. Centrifuge at 3000g for 10 minutes at 4°C to sediment cellular debris. Aliquot the supernatant into 1 ml volumes in microcentrifuge tubes. Store aliquots at -20°C for future analysis."
        ],
        "floatingpoint-type-declaration": [
            "Differential Scanning Calorimetry for Protein Analysis: Load 0.7 ml of buffer into both reference and sample cells. Heat from 0°C to 120°C at a rate of 1 degree per minute. Refill the reference cell with 0.7 ml of fresh buffer and the sample cell with 0.7 ml of protein solution. Repeat the heating cycle from 0°C to 120°C at 1 degree per minute to analyze the protein's thermal stability.",
            "Serum or Plasma Preparation for RNA Isolation: Start with 500µl of serum or plasma. Increase the volume to 2.3-2.5ml with PBS for ultracentrifugation. After centrifuging at 100,000 x g for 70 minutes at 4°C, discard the supernatant. Resuspend the pellet in 50µl PBS for storage at -80°C, or add 700µl Qiazol for RNA isolation."
        ],
        "boolean-type-declaration": [
            "Fmoc Determination Protocol: Collect the piperidine solution used for deprotection in a flask. Dilute the collected solution with 20% piperidine in DMF for analysis. Zero the spectrophotometer with 20% piperidine in DMF at λ=301 nm. Measure absorbance of the diluted solution to calculate the loading of Fmoc. A constant or slightly decreasing loading across measurements indicates successful synthesis. Perform a microcleavage test if irregular or significant decreases in loading are observed.",
            "Genetic Analysis with Exemplar Modules: Utilize the Genetic Algorithm Module for SNP association studies. Apply the Association Study Module for extensive statistical analysis. Use the Chromosome Alteration module for Loss Of Heterozygosity analysis. Perform multiple analyses to narrow down significant SNPs, applying biological knowledge for candidate gene selection."
        ],
        "string-type-declaration": [
            "3' Terminal Nucleosides Determination in RNA: Dissolve yeast tRNA<sup>Phe</sup> or mouse piRNAs in Milli-Q water. Add ammonium acetate buffer and RNase T<sub>2</sub>, then incubate. After RNA hydrolysis, analyze the hydrolysate using an LC/MS system.",
            "MitPred Protein Prediction: Visit http://www.imtech.res.in/raghava/mitpred/ and click the Submission Form in the left menu. Submit sequences in FASTA format. Choose the predictive model you wish to use. Provide your email address for results if using the HMM model."
        ],
        "vector-type-declaration": [
            "Vector Construction for Yeast Shuttle: Create the pDRf1-GW vector by integrating a GATEWAY™ cloning cassette into the pDR196 vector using SpeI-SalI sites for multi-cloning. PCR amplify a 500bp DNA segment with the f1 replication origin, using primers with HindIII sites, and insert it into the pDRf1 vector upstream of the PMA1 promoter. Further amplify the GATEWAY™ fragment with EcoRV-site primers and incorporate it into pDRf1 to finalize the pDRf1-GW vector. ",
            "cDNA Generation and PCR Amplification: Extract DNA and RNA using specific kits, treat RNA with DNase, and quantify. Synthesize cDNAs using reverse transcriptase from RNA samples, dilute, and perform PCR to amplify the target region. Purify the PCR product, clone into the pJET vector, and sequence to identify putative editing regions."
        ],
        "set-type-declaration": [
            "Zebrafish Sample Preparation: Collect zebrafish samples (10-300mg) and place them into tubes with zirconium oxide beads and buffer in a 1:2 ratio based on the fish mass. Process the samples in a Bullet Blender at SPEED 8 for 3 minutes for homogenization. Proceed with downstream analyses using the prepared samples.",
            "Transcriptomic Analysis and Classification: Extract RNA from HuTU cell cultures and profile using Affymetrix Microarrays. Process signals with robust multi-array average (RMA) and compare against TCGA primary GBMs using the ClaNC classifier based on a unique set of 1016 genes. Perform supervised clustering to categorize HuTU samples with TCGA subtypes, ensuring each gene in the analysis represents a distinct element in the gene set used for classification."
        ],
        "temporal-type-declaration": [
            "Bile Sample Preparation: Collect bile into a sterile bottle. Centrifuge at 3000g for 10 minutes at 4°C to clear sediments. Aliquot 1 ml into tubes. Store aliquots at -20°C. ",
            "Ultracentrifugation for RNA Isolation: Start with 1 ml serum/plasma. Adjust volume with PBS for ultracentrifugation. First centrifugation: 90 minutes at 100,000 x g, 4°C. Discard supernatant, resuspend in PBS. Second centrifugation: 70 minutes at 100,000 x g, 4°C. Discard supernatant, add 1 mL Qiazol for RNA isolation."
        ],
        "reg-type-declaration": [
            "Thermal Stability Assay for Proteins: Load both reference and sample cells with 0.7 ml buffer. Heat from 0°C to 120°C at a rate of 1°C per minute. Replace buffer in the reference cell with fresh 0.7 ml. Add 0.7 ml of protein solution to the sample cell. Repeat the heating process for both cells. ",
            "Glycerol Stock Preparation for Bacterial Culture: Inoculate 5ml of LB medium containing 100ug/ml ampicillin with the bacterial culture. Incubate overnight with agitation. Mix the culture with glycerol in a 4:1 ratio and store in aliquots. Freeze the aliquots using dry ice. Store frozen aliquots at -80°C for long-term preservation."
        ],
        "device-type-declaration": [
            "Differential Scanning Calorimetry (DSC): Load both reference and sample cells with 0.7 ml buffer in a Differential Scanning Calorimeter. Increase temperature from 0°C to 120°C at a rate of 1°C/min. Refresh buffer in reference cell and add protein sample to sample cell. Repeat the temperature ramp for analysis. ",
            "Bile Collection and Storage: Collect bile from patients into a sterile bottle. Use a centrifuge to spin down the sample at 3000g for 10 minutes at 4°C. Aliquot the clear supernatant into 1 ml volumes in microcentrifuge tubes. Freeze aliquots at -20°C for storage."
        ],
        "container-type-declaration": [
            "Bile Collection and Centrifugation: Collect bile into a sterile collection bottle. Use a centrifuge tube to spin at 3000g for 10 minutes at 4°C. Aliquot the clarified supernatant into microcentrifuge tubes, 1 ml each. Freeze aliquots in microcentrifuge tubes at -20°C for storage.",
            "Bacterial Culture and Glycerol Stock Preparation: Inoculate LB medium with antibiotics in a culture tube. After growth, mix culture with glycerol in a screw cap freezer tube. Freeze the glycerol culture mix in screw cap freezer tubes using dry ice. Store the tubes in a -80°C freezer."
        ],
        "scientific-type-declaration": [
            "Biliary Fluid Processing for Analysis: Collect biliary fluid into sterile containers directly from patients' drainage systems. Centrifuge at 3000g for 10 minutes at 4°C to precipitate cellular debris. Aliquot the clarified supernatant into 1 ml volumes in microcentrifuge tubes, a common practice for sample preparation in biological research. Store aliquots at -20°C for future biochemical or molecular analysis.",
            "Thermal Stability Testing of Protein Solutions: Load 0.7 ml of buffer into reference and sample cells within a thermal cycler or controlled heating device. Incrementally increase the temperature from 0 to 120°C at a rate of 1°C per minute, measuring protein stability or denaturation rates. Compare the thermal response of protein solutions against buffer controls to assess protein stability under heat stress."
        ],
        "class-type": [
            "MD (Molecular Dynamics) for Proteomics: Classify proteins (lysozyme, proteinase K, thaumatin) by their crystallization methods before initiating MD simulations. Place classified proteins in a simulated environment, perform minimization, and then equilibrate the system under different temperatures to study protein stability and conformational changes. Analyze and classify protein stability indicators like radius of gyration and RMSD, applying specific normalization techniques for comparison.",
            "Synthetic Mucus Preparation: Start with a classified volume of distilled water, adding classified ingredients (mucin, DNA, DTPA, salts, Tris base, amino acids except tryptophan) under constant stirring to ensure complete dissolution. Adjust pH to a classified stable value, sterilize the medium, and then add classified components (tryptophan, egg yolk emulsion) post-sterilization. Store the prepared medium under classified conditions (refrigerated) for extended periods, indicating its long-term stability class."
        ],
        "parallel-for": [
            "Thermal Cycling for Sample and Reference Cells: Load 0.7 ml of buffer into both reference and sample cells. Simultaneously run thermal cycles from 0 to 120 °C at a rate of 1 degree/min for both cells. Parallel processing: Perform thermal cycling for both reference (with fresh buffer) and sample (with protein solution) cells, highlighting the simultaneous execution of identical tasks under controlled conditions.",
            "Centrifugation and RNA Isolation from Serum or Plasma: Start with 1 ml of serum or plasma for each replicate. First centrifugation: Bring volume up with PBS and centrifuge all samples at once for 90 min at 100,000 x g. Second centrifugation: After discarding supernatant and resuspending pellets, centrifuge again for 70 min at 100,000 x g. Parallel processing: Process multiple samples through two rounds of centrifugation and subsequent RNA isolation, highlighting batch processing of samples."
        ],
        "event-statement": [
            "Cell Thawing, Splitting, and Transfection: Thaw cells, spin down, and plate in growth media. Event trigger: Split cells at 80% confluency to avoid differentiation. For transfection, seed at low density and change media post-transfection for differentiation or growth.",
            "S2 Cell Culture and Stimulation: Seed S2 cells at 1 x 10^6 cells/ml in conditioned medium. Incubate at 28°C until cell density reaches 6 to 20 x 10^6 cells/ml, then split cells. Event trigger: Prior to LPS or PGN stimulation, pretreat cells with 1 µM 20-hydroxy-ecdysone for 24 hours. "
        ],
        "response-statement": [
            "Bone Marrow-Derived Macrophage Culturing Detailed Response: Flush, centrifuge, and culture mouse bone marrow cells in conditioned medium. Upon reaching confluence, split cells for further culturing.  Response to confluence: Ready for use when CD11b+ cells exceed 90%, indicating successful differentiation.",
            "Cell Growth and Transfection Response: Thaw and culture cells until 80% confluency. Response to 80% confluency: Split cells for further growth or prepare for freezing. Transfect cells at low density, then change media based on purpose (growth or differentiation). Response to transfection: Monitor for complete differentiation, adjusting care based on confluency or media type."
        ]
    },
    "Biomedical & Clinical Research": {
        "for-loop": [
            "Muscle Elasticity Therapy Study: For 4 weeks, repeat 5 sessions per week: Group A performs MET, Group B performs static stretching and motor control exercise.",
            "OVA-induced Asthma Model in Mice: Repeat OVA aerosol challenge on days 27 and 28 after initial priming with 8 intraperitoneal injections every 2 days."
        ],
        "while-loop": [
            "Fluorescence Assay for Enzyme Activity: Repeat the addition of substrates and enzyme to the cuvette, and record fluorescence intensity. Keep repeating these additions and measurements until no further change in fluorescence intensity is detected, indicating equilibrium."
        ],
        "if-branch": [
            "Collect cells, wash, and resuspend in RPMI 1640 media at approximately 1-2 x 10^6 cells/ml. If cells are to be treated with PTX, divide them into two groups: one receives 100 ng/ml PTX, and the other PBS. Rotate tubes at 37 °C for 3-4 hours for PTX-treated cells. If cells are not treated with PTX, rotate for 1 hour at 37 °C. Following rotation, wash cells twice with assay buffer containing 2.5 mM probenecid. Resuspend cells in loading buffer (assay buffer with probenecid, 2.28 µg/ml Fluo-4, and 0.91 µg/ml Fura-red) at approximately 4 x 10^6 cells/ml. Protect tubes from light and rotate for 30 minutes at 37 °C. Wash cells once and resuspend in assay buffer with probenecid at about 5 x 10^6 cells/ml. For calcium flux analysis using SDF, aliquot 450 µl of cells into a FACS tube and record the basal FITC/PerCP-Cy5.5 ratio. At 1 minute, stimulate with 50 µl of 10 µg/ml SDF-1 (approximately 125 nM final concentration) and record responses for 3 more minutes. Finally, stimulate cells with 50 µl of 20 µM ionomycin. Note: If using chemokines other than SDF-1, determine the optimal dose beforehand."
        ],
        "allocate-statement": [
            "Validate the efficacy of a gene-specific sgRNA in vitro for your target gene. Generate large-scale lentivirus for each construct in a T225 flask, resuspend in 30-50 µl of sterile 1x DPBS. Titer the lentiviruses and adjust sgRNA virus concentrations with sterile DPBS to equalize titers across all sgRNAs used. Administer a combined dose of sgRNA and dCas9-VPR construct into the target brain area at 0.25 µl/min, using a total of 1.5 µl (0.5 µl sgRNA and 1.0 µl dCas9-VPR). Confirm expression of the transgenes in subjects, such as rats, two weeks post-infusion."
        ],
        "deallocate-statement": [
            "Larvae Experiment Protocol: Preparation: Place larvae in a pre-filled 1m³ box with dirt. Feeding: Administer specific food 3-4 times daily at 2-3 hour intervals for optimal growth. Monitoring: Continue feeding until larvae transition to pupals, increasing food supply at this stage. Environmental Change: Upon reaching adulthood, introduce water to the dirt environment for mating. Larvae Collection: Post-mating, collect new larvae."
        ],
        "function-procedure-call": [
            "Mouse Euthanasia and VAT Removal Protocol: Euthanasia: Euthanize the mouse with O2/CO2 intoxication followed by CO2 asphyxiation, ensuring compliance with ethical guidelines. Preparation: Position the euthanized mouse on its back, securing limbs, and sterilize the abdomen. Incision and Exposure: Perform a midline incision, retract skin, and open the muscular wall to access the VAT. VAT Removal: Identify and carefully extract the VAT without harming adjacent organs. Processing: Chop VAT into small pieces for enzymatic digestion with Collagenase D, followed by incubation, centrifugation, and isolation of specific cell fractions."
        ],
        "function-procedure-declaration": [
            "Spinal Cord Isolation Protocol: Preparation: Euthanize the mouse with CO2 and disinfect with ethanol. Expose the heart by opening the chest wall. Perfusion: Inject ice-cold PBS through the left ventricle after cutting the right atrium, ensuring clear effluent. Spinal Cord Isolation: Decapitate, expose the spinal column, and flush out the spinal cord using PBS. Tissue Dissociation: Chop spinal cords, homogenize, and centrifuge with Percoll to isolate cells. Cell Preparation: Wash cells and prepare for further analysis or culture."
        ],
        "add-arithmetic-operator": [
            "Endotracheal Intubation Protocol Select the endotracheal tube (ETT) size based on the patient's age using the formula: ETT size = (age in years / 4) + 4. For backup, choose a one-size-smaller uncuffed tube for nasal insertion. Before intubation, measure the distance from the nose to the mid thyroid cartilage to estimate the insertion depth. If initial oral intubation fails after anesthesia, lubricate and insert the smaller-sized ETT nasally to just above the vocal cords. Ensure a proper seal of the mouth and nose, connect the anesthesia circuit to the ETT, and confirm adequate ventilation by observing the ETCO2 waveform, chest rise, and satisfactory oxygen saturation on the pulse oximeter."
        ],
        "minus-arithmetic-operator": [
            "Acclimate the monkey to the primate chair and train it daily on motor tasks to assess manual dexterity for 30-60 minutes. Over a period of 2 months, establish pre-lesion behavioral scores before performing a cervical hemi-section at C7. Following the lesion, install an osmotic pump to deliver antibodies for 4 weeks and immediately begin daily post-lesion motor performance tests to establish behavioral scores for another 2-3 months. Inject BDA into the contralesional motor cortex and allow a survival time of 60-70 days before humanely sacrificing the animal. Conduct histology by preparing 50-micron thick sections of the brain and spinal cord for histochemical analysis."
        ],
        "multi-arithmetic-operator": [
            "Collect 4 ml of human venous blood into heparinised vials and ensure thorough mixing by gently inverting the tube several times. In a 15 ml centrifuge tube, take 4 ml of Ficoll Histopaque and carefully layer the blood over Ficoll Histopaque using a 1 ml auto pipette, ensuring the two layers remain distinct. Immediately centrifuge for 30 minutes at 100 x g at 4°C, using a swing-out bucket for optimal separation; fixed angle rotors are an alternative but require careful handling to avoid disturbing the layers. After centrifugation, aspirate the whitish buffy coat, which contains peripheral blood mononuclear cells (PBMCs), being careful to do so promptly to prevent the cells from settling if left standing for over 10 minutes. Wash the PBMCs twice by centrifuging at 100 x g for 10 minutes with 10 ml of sterile PBS or Dulbecco's modified eagle medium. The yield of cells from 4 ml of blood typically ranges from 10^7 to 10^8 cells."
        ],
        "devid-arithmetic-operator": [
            "Inject each mouse subcutaneously with 1 µl/g body weight of 0.5 mg/ml atropine sulfate to prevent salivary secretions. Anesthetize the mouse with 1 µl/g body weight of a solution containing 100 mg/ml ketamine and 20 mg/ml xylazine via intra-peritoneal injection. Secure the mouse in a ventral position on a custom-made platform, with maxillary incisors locked on a metal wire and mandibular incisors hooked on an elastic string to keep the mouth open. Using an insulin syringe with a 29-gauge needle attached to a 0.58 mm diameter polyethylene tube, insert the tube 3-5 mm into the Wharton's duct, located beneath the tongue, while keeping the needle outside the duct. Inject 50 µl of 0.4% trypan blue stain solution into the submandibular gland through the duct, maintaining positive pressure to prevent backflow. After injection, euthanize the mouse for dissection to inspect the infusion's retention in the gland."
        ],
        "and-arithmetic-operator": [
            "Habituate the monkey to the primate chair and train it on various motor tasks daily to assess manual dexterity, with each session lasting 30-60 minutes. Over two months, establish the pre-lesion behavioral scores. Perform a cervical hemi-section at C7 and install an osmotic pump to deliver the antibody for four weeks. Immediately after the lesion, begin daily testing of motor performance to determine post-lesion behavioral scores for 2-3 months. Inject BDA into multiple sites in the contralesional motor cortex and allow a survival time of 60-70 days before sacrificing the animal. Finally, conduct histological analysis with 50-micron thick sections of the brain and spinal cord using histochemistry."
        ],
        "or-arithmetic-operator": [
            "Label peripheral blood-derived neutrophils (10^6 cells/mL) with fluo-4 AM (0.9 µM) in assay buffer and incubate for 45 minutes at 37°C. After incubation, wash and resuspend the cells to a concentration of 2×10^6 cells/mL and maintain at 37°C. Introduce a stimulus to the cells and use the BD FACSAria System to directly record the change in mean fluorescent intensity (MFI) for 120 seconds, indicating cytosolic Ca^2+ concentration changes. The chemokine, determined optimal by a chemotaxis assay, serves as the stimulus. For desensitization assessment, add a second stimulus at 130 seconds and record MFI for another 120 seconds. Analyze the results using FlowJo Software."
        ],
        "not-arithmetic-operator": [
            "For in vivo experiments using ViroMag, the volume of virus injected depends on the viral preparation, injection route, target tissue, and preliminary in vitro results. Keep In vivo ViroMag and saline at room temperature. Use 10 to 20 µL of In vivo ViroMag for each 1x10^6 infectious viral particles, avoiding exceeding recommended injection volumes."
        ],
        "assignment-expression": [
            "Prepare stock solutions in 10 mM NH4OAc, pH 6.0: 500 µM cucurbituril, 25 µM dapoxyl, 1 mM lysine, and 800 µg/ml lysine decarboxylase. In a cuvette, mix 100 µl of 25 µM Dapoxyl and 780 µl buffer, then place the cuvette in a fluorometer set to kinetic mode (excitation at 336 nm, emission at 380 nm). Add 20 µl of 500 µM cucurbituril and wait about 2 minutes for fluorescence intensity to stabilize. Following this, add 50 µl of 1 mM lysine and then 50 µl of 800 µg/ml lysine decarboxylase to start the reaction. Continue recording fluorescence until no further changes in intensity are observed. The total volume of the assay is 1 ml, yielding final concentrations of 2.5 µM Dapoxyl, 10 µM cucurbituril, 50 µM lysine, and 40 µg/ml lysine decarboxylase. Repeat steps with variations in enzyme, substrate, or cucurbituril concentrations as needed."
        ],
        "raise-statement": [
            "Cultivate C. elegans to adulthood under well-fed conditions, placing two adult nematodes (P0) on NGM in 60-mm diameter plates. Incubate these plates at designated experimental temperatures for 8-12 hours until about 100 eggs are laid, then remove all P0 adults to synchronize nematode stages. Allow progeny to develop to adulthood at their respective temperatures: 144-150 hours at 15°C, 85-90 hours at 20°C, or 60-65 hours at 25°C. Subsequently, subject mature but not old adults to a 20-minute ice shock, ensuring plates are half-sealed with Parafilm to contact the ice. Transfer plates to a refrigerator at 2°C for 48 hours, then store at 15°C overnight before counting live and dead adults to calculate survival rates. Perform at least nine assays per strain, adjusting for mutant growth rates or dauer formation traits as necessary. In a variant temperature-shift assay, develop nematodes from eggs to young adults or L4 larvae at one temperature, then expose them to a second temperature for hours before ice shock, following the same subsequent steps to assess cold tolerance. Repeat the assay three times per strain to determine mean survival rates and SEM from multiple assays."
        ],
        "interger-type-declaration": [
            "Culture cells in a 96-well plate for designated time points, then equilibrate the plate to room temperature for 30 minutes. Set up control wells with medium only to measure background. Add luciferin solution to each well in a 1:1 volume ratio with the cell culture medium. Gently shake the plate for 5 seconds to mix, then immediately measure luminescence using a luminescent plate reader for 1 to 10 seconds, adjusting the time based on the sensitivity of your equipment."
        ],
        "floatingpoint-type-declaration": [
            "Genomic DNA was prepared from lysing mouse spleen cells (1-4 x 10^4) or ES-derived hematopoietic cells (3-5 x 10^5) in 75 µl elution solution. PCR reactions of 20 µl included 5.5 µl template DNA (82.5 ng or less), with a mix containing 10 mM Tris-HCl, 50 mM KCl, 2.0 mM MgCl2, 1 µM primers (25 mers), 200 µM dNTPs, and 1 U Taq DNA polymerase. The PCR program involved initial denaturation at 94°C for 2 minutes, followed by 35 cycles of denaturation at 94°C for 1 minute, annealing at 60°C for 1 minute, extension at 72°C for 1.75 minutes, and a final extension at 72°C for 10 minutes. Half of the PCR products were run on 1% agarose gels, stained with ethidium bromide to evaluate the amounts. DH-JH recombination was identified by amplified fragments of 1,033 bp, 716 bp, and 333 bp using primers DHL(5’) and J3(3’), while germline alleles were detected as a 1,259 bp fragment with primers Mu0(5’) and J3(3’)."
        ],
        "boolean-type-declaration": [
            "The animal study, conducted with approval from the Institute Animal Ethics Committee, utilized New Zealand white rabbits (2.5-5.5 kg) for creating venous pouch arterial bifurcation aneurysms. Preoperative preparation included administering ketamine (30 mg/kg) and xylazine (6 mg/kg) for anesthesia, followed by intubation and monitoring with gas anesthesia (2% isoflurane), checking anesthesia depth every 15 minutes. The surgical area, from the jaw angle to the thorax, was shaved and disinfected with alternating chlorhexidine or povidone-iodine scrub and alcohol. Surgically, the left external jugular vein was dissected to harvest a 2-3 cm segment, treated with papaverine to prevent vasospasm, and stored in heparinized saline. Common carotid arteries (CCAs) were prepared, with the right CCA ligated and cut, and the left CCA arteriotomized for anastomosis with the venous pouch, considering the contralateral artery diameter for size determination. Anastomosis involved suturing the right CCA stump to the left CCA and venous pouch, followed by sealing leaks with subcutaneous fat and fibrin glue, and wound closure. Postoperatively, acetylsalicylic acid for analgesia and low molecular heparin for anticoagulation were administered, with pain management overseen by a veterinarian."
        ],
        "string-type-declaration": [
            "Genomic DNA was extracted from mouse spleen cells (1-4 x 10^4) or ES-derived hematopoietic cells (3-5 x 10^5) using 75 µl elution solution, as detailed in the manufacturer's protocol available at [http://www.5prime.com/media/3415/perfectpure_dna_cultured_cell_manual_5prime_1064553_122010.pdf](http://www.5prime.com/media/3415/perfectpure_dna_cultured_cell_manual_5prime_1064553_122010.pdf). The PCR setup included 20 µl reactions with 5.5 µl template DNA (82.5 ng or less), 10 mM Tris-HCl, 50 mM KCl, 2.0 mM MgCl2, 1 µM primers (25 mers), 200 µM dNTPs, and 1 U Taq DNA polymerase. PCR cycling conditions were: 94°C for 2 min, followed by 35 cycles of 94°C for 1 min, 60°C for 1 min, 72°C for 1.75 min, and a final extension at 72°C for 10 min. PCR products were resolved on 1% agarose gels and visualized with ethidium bromide staining. DH-JH recombination was identified with primers DHL(5’) and J3(3’), yielding fragments of 1,033 bp, 716 bp, and 333 bp, and germline alleles were detected with primers Mu0(5’) and J3(3’), producing a 1,259 bp fragment."
        ],
        "vector-type-declaration": [
            "Prepare Jurkat T cells for 4 samples by counting cells at 1 x 10^6 per assay, washing once with pre-warmed RPMI media at 200 x g for 5 minutes, and placing 1 x 10^6 cells in 250 µl of fresh RPMI media into a 5 ml FACS tube. Prepare 1x enhancing solution by mixing 200 µl of 10x enhancing solution with 1.8 ml of assay buffer and keep it at room temperature. Equilibrate a vial of indicator at room temperature for 5 minutes, add 100 µl of 100% DMSO, mix well, and let it stabilize at room temperature for 10 minutes; store any unused indicator at -20°C. Create 1x loading dye by combining 2 ml of the 1x enhancing solution with 2 µl of the prepared indicator. Add 250 µl of this loading dye to each cell-containing tube and incubate for 1 hour at 37°C in a CO2 incubator, then cool at room temperature for 20 minutes before FACS analysis. For FACS analysis, use FACS DIVA software to draw a dot plot with time on the X-axis and FITC on the Y-axis, record the basal level of signal for 1 minute, then stop and immediately add 1 µl of stimulator (PMA at 50 ng/ml and ionomycin at 1 µg/ml), vortex briefly, and return the tube to the FACS for an additional 3 minutes of recording. Append this data to the basal signal, stop acquiring to finish the assay, and analyze data in FlowJo software in kinetic mode. Compare control and sample signals to illustrate differences in intracellular Ca^2+ influx, as shown in the provided figure, representing intracellular Ca^2+ influx in IKKγ/NEMO-deficient Jurkat T cells complemented with various IKKγ/NEMO mutations upon PMA and ionomycin treatment, with Vec indicating vector control."
        ],
        "set-type-declaration": [
            "Pre-condition mice in biosafety level 2 (BSL2) conditions by adapting them to feed for 3-7 days, then randomly divide them into groups to be housed under different humidity conditions of either 20% or 50% RH at 20°C, with 5 mice per group, for 5-7 days. For influenza infection via aerosol exposure under BSL2 conditions, prepare a solution of hvPR8 virus at 2 x 10^5 pfu/ml in PBS, using 4 ml of this solution for the aerosol delivery, ensuring to adjust the virus concentration to the lethal dose 50 (LD50) for specific experimental conditions as necessary. Place up to 12 mice in a pie cage and use a nebulizer with 3 ml of the virus solution for a 15-minute exposure. After exposure, return the mice to their respective environmental conditions and monitor their weight and survival for two weeks, euthanizing according to institutional guidelines. This protocol aligns with the policies of the Yale Animal Care and Use Committee (protocol #10365), ensuring ethical compliance in handling and experimentation."
        ],
        "temporal-type-declaration": [
            "Culture cells in a 96-well plate, designated by specific time points. Allow the plate to reach room temperature over 30 minutes before adding luciferin solution in a 1:1 volume ratio with the cell culture medium to each well. Include control wells filled only with medium to serve as background. After gently shaking the plate for 5 seconds to mix, measure luminescence immediately using a luminescent plate reader, with a suitable detection time ranging from 1 to 10 seconds based on the sensitivity of the equipment."
        ],
        "reg-type-declaration": [
            "Place the larvae in a 1m^3 box filled with dirt. Feed them the specified food 3-4 times daily at 2-3 hour intervals for optimal growth. Continue feeding until the larvae turn into pupae, at which point increase the food quantity. Once pupae become adults, modify their environment by adding water to facilitate mating. After mating, collect the resulting larvae."
        ],
        "device-type-declaration": [
            "Prepare lysis buffer with standard Personal Protective Equipment (PPE). Under a chemical hood, dilute the fixative solution 1:200 into the lysis solution and mix. For the lysis-staining process, combine 500 µl of lysis buffer and 10 µl of conjugate panel in a tube. Add 2-50 µl of blood (venous or capillary) to the mixture, mix well, and incubate for 15 minutes in the dark at room temperature (18-25°C). Analyze the sample using a 3-laser cytometer and ensure proper disposal of waste in biohazard containers."
        ],
        "container-type-declaration": [
            "Collect 4 ml of human venous blood in heparinized vials and mix by gently inverting the tube several times. In a 15 ml centrifuge tube, add 4 ml of Ficoll Histopaque. Carefully layer the blood over Ficoll Histopaque using a 1 ml pipette, ensuring they remain as distinct layers. Centrifuge immediately for 30 minutes at 100 x g at 4°C using a swing-out bucket centrifuge (fixed angle rotors are an alternative, with caution). Aspirate the whitish buffy coat layer (approximately 1 ml) containing peripheral blood mononuclear cells (PBMCs). Do this step promptly to avoid cell settling if left for over 10 minutes. Wash the PBMCs twice by centrifuging at 100 x g for 10 minutes with 10 ml of sterile PBS or Dulbecco's modified eagle medium, noting the cell yield from 4 ml of blood typically ranges between 10^7 to 10^8 cells."
        ],
        "scientific-type-declaration": [
            "Recruit 70 patients, screen for inclusion and exclusion criteria, and obtain informed consent. Perform a baseline assessment before allocating patients into two groups: Group A with 35 patients undergoing 4 weeks of aerobic training three times a week, and Group B with 35 patients partaking in 4 weeks of Nordic walking three times a week. After the training period, conduct post-training assessments followed by statistical analysis to evaluate outcomes."
        ],
        "class-type": [
            "Load 1-10 mg of purified antigen protein into an SDS-PAGE gel using a wide comb to accommodate as much protein as possible, noting that high protein amounts are crucial for high purity and yield antibody retrieval. Purify insoluble proteins under denaturing conditions and consider eluting even soluble proteins directly from purification beads with SDS loading buffer for higher yields. If the protein is tagged (e.g., GST, MBP, NusA), preclear the antibody with these tags before proceeding. Transfer the protein to a PVDF or Nitrocellulose membrane, selecting 0.2 µm pore size for smaller proteins. Stain with Ponceau S, trim the membrane around the antigen, pre-elute with 100 mM glycine (pH 2.5), block with 5% non-fat milk in TBST, and then incubate with antiserum overnight at 4°C. Wash, then elute the antibody by incubating the membrane with glycine solution, quickly neutralizing with Tris-HCl (pH 8.5). Repeat the elution process three times, dialyze against PBS, and determine the antibody concentration. Test the antibody in western blot, immunoprecipitation, and immunofluorescence assays."
        ],
        "parallel-for": [
            "Flush mouse tibiae and femurs with ice-cold PBS using a 70 µm cell strainer. Centrifuge the collected cells for 5 minutes at 450 x g and then resuspend the pellet in conditioned medium enriched with 30% M-CSF-containing supernatant from L929 cells. Seed 7 x 10^6 cells in 100 x 20 mm culture plates with 10 ml of the conditioned medium and incubate at 37°C with 5% CO2. Once cells reach confluence (around 6 days), either proceed with experiments or reseed by splitting the cells to 5 x 10^6 cells per plate in fresh conditioned medium. Confirm the readiness of bone marrow-derived macrophages (BMMFs) for experimental use by verifying that over 90% of the cells express CD11b via FACS analysis."
        ],
        "event-statement": [
            "Euthanize the mouse ensuring the trachea remains intact. Place the mouse on its back and apply 70% ethanol. Make a midline incision, retract the skin to expose the trachea, and then make a small incision across it without fully severing. Attach an 18 G catheter to a syringe filled with 1 ml PBS, insert into the trachea for about 10 mm, and flush the lungs. Withdraw the fluid back into the syringe and transfer it to a 15 ml tube. If the lavage fluid is blood-contaminated, centrifuge at 1,400 rpm for 2 minutes, discard the supernatant, lyse remaining red blood cells with 3 ml water, and count the larvae, identifiable by dark-brown pigment in their gut. Repeat the lavage twice more using fresh PBS each time. Examine the larvae under a stereo microscope in a 60 x 15 mm dish."
        ],
        "response-statement": [
            "To address a capsulorhexis radial tear during cataract surgery, immediately halt the procedure and assess. Reinflate the anterior chamber with an ophthalmic viscosurgical device (OVD) using a cystotome attached to a syringe with OVD for quick action. Leave the capsulorhexis flap unfolded on the lens. Tilt the cystotome horizontally to engage the flap near the tear's leading edge without cutting it. Gently adjust the tear's leading edge in the opposite direction of the tear to make a 'U-Turn' back to the intended path, maintaining tension until corrected. This method allows for an immediate response to a radial tear without needing to switch instruments, reducing the risk of further tear and minimizing corneal wound distortion and anterior chamber collapse."
        ]
    },
    "Ecology & Environmental Biology": {
        "for-loop": [
            "Thaw frozen samples to room temperature. For homogenization, sterilize a metal spatula, transfer ~50g of sample into an Erlenmeyer flask, add 2 ml of sterilized tap water, and homogenize. Next, place ~20g of homogenized sample into a tissue culture flask, add 20 ml of MDV medium, and gently shake. Autoclave the samples in Erlenmeyer flasks for 15 minutes at 121°C. Repeat the process of adding sterilized sample and MDV medium to the culture flask, gently shaking for even distribution. Repeat these steps (2.2-2.5) for all samples, including positive controls."
        ],
        "while-loop": [
            "To measure sensitivity to RID, conduct 140 trials under conditions with and without stereoscopic cues. Use the Method of Constant Stimuli to offer equal numbers of trials for each RID value, comparing against a constant RID reference. Randomize the presentation order of reference and test stimuli. Participants take breaks after blocks of trials, with 20 repetitions at 7 different RID angles. After trials, analyze data to plot the proportion of times each RID angle was chosen as greater than the reference, fitting these results with a Cumulative Gaussian function to assess RID discrimination precision. Compare slopes from stereo and nonstereo conditions to evaluate the impact of stereoscopic cues on RID detection. Repeat this process, ensuring each step is clearly understood and correctly implemented for reliable results."
        ],
        "if-branch": [
            "For habituation, mice were placed at the ladder's start and encouraged to move forward using air puffs, repeating until they were accustomed to walking on the rungs. Motor performance was assessed by recording the time and number of foot slips as mice crossed the ladder, with trials repeated 4-5 times daily after a 15-minute interval for 3-4 days to evaluate motor learning. Data analysis involved calculating daily averages of time and foot slips and comparing these between groups. If a mouse failed to place its paws correctly or slipped, this was noted for further analysis, and if video recording was possible, missteps were reviewed afterward."
        ],
        "allocate-statement": [
            "Collect fibers from twenty random cotton seeds and weigh them (W1) using a XS105 DualRange scale. Randomly select six bundles of fibers, each approximately 1-2 mg, tease them by hand, and then weigh each bundle (W2). Detach the ring and cap from a 0.2 ml micro-centrifuge tube, fix a fiber bundle by securing the cap to the ring, and treat it in boiling water for 10 minutes before cooling to room temperature; store briefly in 45% acetic acid if needed. Dry the bundle, cut it into three segments (1-2 mm each), and disperse the snippets in six 20 µl drops of 45% acetic acid. Observe and photograph the snippets under a stereo-microscope, count the snippets in each drop using Image-Pro® Plus software, and calculate the total fiber number per bundle. Determine the mature fiber number per seed using the formula: N1 = (W1/20) / (W2/N2), where N2 is the average snippet number from the three segments."
        ],
        "deallocate-statement": [
            "After drying the specimen, pack it in a transparent plastic bag by first sealing the bag's base again and adding 10-20 grams of silica gel. Seal the bag, leaving about 1 cm open at the edge. Place the specimen directly inside the bag or wrap it in tissue paper or plastic wrap to avoid direct contact with silica gel. Draw out the air gently before sealing. Include a fungarium submission data sheet with details such as the scientific name, collection data, and collector's name inside the bag before sealing it completely. Prepare the specimen for fungarium deposition, record its details in a computer for easy access, and organize the specimens by genus, family, or collection site in an airtight container, which can hold 2-10 specimens depending on their size. Avoid compressing them too tightly, label the specimens inside the container for visibility, add some silica gel to the container before sealing it tightly, and store the containers in a dehumidified place for long-term preservation."
        ],
        "function-procedure-call": [
            "The study, approved by the University of Unipampa's Research Ethics Committee, ensured participant anonymity and adhered to ethical standards for human research. A questionnaire was designed to explore breakfast habits among schoolchildren and their sociodemographic correlations, incorporating a transcultural adaptation of the PERSEO program's abridged questionnaire validated for the Spanish population. The draft was created using word editing software, covering variables like gender, age, family situation, parent’s occupation, and breakfast habits based on recommendations by the Spanish Society of Community Nutrition and WHO. This draft was reviewed by external experts for item comprehension, leading to a final version submitted to the university's scientific and ethical committee. A reliability analysis was conducted by applying the questionnaire twice to a pilot group to check consistency. A cross-sectional descriptive study was then carried out, with questionnaires administered in silence by teachers in classrooms, instructing students to answer honestly within fifteen minutes. Sampling involved random selection from urban public schools, requiring informed consent from parents. Data were analyzed using statistical software (e.g., SPSS), with responses transferred to a database for analysis. Reliability and reproducibility were assessed using Kappa indexes for dichotomic items and the summatory value of scores for polychotomic items, considering values ≥0.40 as acceptable. Descriptive analyses calculated frequency distributions and central tendency measures, while hypothesis testing was conducted via Chi-square and Student’s t-tests, setting statistical significance at p < 0.05."
        ],
        "function-procedure-declaration": [
            "All procedures have received approval from the Research Ethics Committee of ETH Zürich under proposal EK 2015-N-37. The experiment begins by recruiting participants who fit specific criteria, such as age and educational background, through a recruitment system. Invitations are sent by email, and participants register online, with a slight overbooking to account for potential no-shows. A confirmation email is automatically sent to those registered. For session preparation, the lab environment is arranged, necessary equipment and software are set up, including a server and lights in the control room and organizing the testing rooms. The experiment program, based on the Unity game engine, is prepared for client-server communication over a local network. Computers are configured for the experiment using PowerShell commands to ensure connectivity and proper setup. Participants are welcomed and verified against registration lists before being assigned seating. After consenting, they are briefed on the experiment's rules and proceed through a training phase to familiarize themselves with the virtual environment. The main experiment is then conducted, monitoring participants' behavior and intervening minimally.The experiment concludes by shutting down the software, debriefing participants, distributing payments based on performance, and collecting any materials left in the cubicles. Data is saved for future analysis"
        ],
        "add-arithmetic-operator": [
            "For the chlorophyll assay, begin by collecting 300 mg of fresh leaves from 4-week old seedlings, dehydrating them if necessary in 95% ethanol. Grind the leaves with liquid nitrogen in a mortar, then mix the powder with 80% acetone in a Falcon tube, keeping it in the dark to avoid degradation. After centrifugation, transfer the supernatant to a new tube, repeating if needed to consolidate the extract. Measure the chlorophyll content via spectrophotometry using specific formulas for chlorophyll a, b, and total chlorophyll, with calculations based on the extract's volume and the weight of the leaves.For the starch and sugar assays, freeze 500 mg of leaves in liquid nitrogen, grind to a powder, and mix with 80% ethanol in a centrifuge tube, heating and rotating it. After centrifugation, separate the supernatant, repeat the extraction to collect soluble carbohydrates, and dry the pellet for starch measurement. Dissolve the pellet for starch content analysis with amyloglucosidase, and combine supernatants for sugar content measurement, adding water and chloroform to separate pigments. Centrifuge to obtain the aqueous phase, reduce its volume via vacuum, and measure sugar concentration enzymatically with specific kits."
        ],
        "minus-arithmetic-operator": [
            "After drying the specimen, pack it in a transparent plastic bag by double sealing the base, adding 10-20 grams of blue silica gel, and leaving about 1 cm open at the edge. Place the specimen directly inside the bag or on tissue paper, and for delicate specimens, use plastic wrap to avoid direct contact with silica gel, which could cause issues during microscopic examination. Gently remove the air from the bag before sealing. Insert a fungarium submission data sheet with details like scientific name, family, accession code, and collection information, then seal the bag. The voucher specimen is then ready for fungarium deposition. Record the specimen details in a computer for easy access and organize them by genus, family, or collection site in an airtight container, which can hold 2-10 specimens depending on their size, avoiding compression. Label the container with names and accession numbers for visibility and add some silica gel before sealing tightly for long-term preservation in a dehumidified location."
        ],
        "multi-arithmetic-operator": [
            "Harvest 500mg to 1g of plant tissue under experimental conditions and immediately freeze in liquid nitrogen. Freeze-dry the tissues and store at -80°C or proceed to extraction. For organic extraction, add 300-500mg of freeze-dried tissue to a glass vial, introduce 10μl of internal standard (5α-cholest-7en-3β-ol at 1mg/ml), and mix with 3.75ml of CHCl3:methanol (1:2), 1.25ml of CHCl3, and 1.25ml of dH2O, vortexing between each addition. Separate the organic phase and evaporate the solvent at 35°C. For alkaline hydrolysis, add 500μl of 6% methanolic KOH, heat at 85°C for 30-60 minutes, dilute with 250μl dH2O, add 750μl n-heptane, vortex, and separate the upper phase, repeating the extraction. Evaporate the heptane over 16-24 hours. Derivatize the dried residue with 100μl of derivatization reagent (80μl BFSTA+20μl TMCS) at 65°C for 1 hour before GC-MS analysis. Inject 1μl of the sample into the GC-MS in split mode, using a Rtx5MS-30m column. The analysis involves an initial 1-minute isothermal heating at 100°C, then ramping to 300°C over 20 minutes. Record mass spectra from 40 to 850 m/z and quantify components using the internal standard for normalization."
        ],
        "devid-arithmetic-operator": [
            "Approved by the McMaster University Animal Care Committee and following Canadian guidelines, this protocol involves habituating mice to a 12-hour light/dark cycle, marking for identification, daily handling for acclimation, and monitoring for health issues using rectal temperature, body weight, and food/water intake. Neurological deficits are assessed through sensorimotor tests to identify potential confounds in activity and performance. Apparatus used in experiments are cleaned to prevent contamination across control and experimental groups. The Integrated Behavioral Station setup includes providing mice with 20 mg chow pellets and water, with additional preference testing options. Bottle consumption is tracked by weighing. The setup is complemented with shelters and lickometers, ensuring no interference with sensors. Ethovision XT 8.5 software is used to define experimental conditions, including group assignments and detailed arena setups with specific zones of interest for behavioral analysis. Calibration ensures accuracy of arena dimensions. Trial controls include specified durations and start/stop conditions, with detection settings adjusted for consistent tracking, considering variations in mouse coloration. Data acquisition involves careful placement of mice in assigned arenas, synchronization of video and event tracking, and minimal disturbance during recording. Post-trial, mice are returned to their home cages, with data, including bottle weights and digital recordings, meticulously saved for subsequent behavior scoring."
        ],
        "and-arithmetic-operator": [
            "Collect fibers from twenty random cotton seeds and weigh (W1) using XS105 DualRange (METTLER). Randomly pick six bundles of fibers (each around 1~2 mg), tease each bundle by hand, and weigh (W2). Modify a micro-centrifuge tube (0.2 ml) by separating the ring and cap with a knife, and fix a weighed fiber bundle by attaching the cap to the ring. Boil the bundle for 10 minutes, then cool to room temperature, and store in 45% (v/v) acetic acid if needed for 2-3 days. Dry the bundle, cut into three segments (1~2 mm each), and disperse snippets from each segment into six drops of 45% (v/v) acetic acid. Observe and photograph snippets under a stereo-microscope (MVX-10, OLYMPUS), count snippet numbers in each drop using Image-Pro® Plus software. Calculate the number of fibers per bundle (N2) by dividing the total snippet count by three. Determine mature fibers per seed (N1) using the formula: N1=(W1/20)/(W2/N2)."
        ],
        "or-arithmetic-operator": [
            "Arabidopsis seeds were sterilized using 70% ethanol for 1 minute, followed by 1% sodium hypochlorite with SDS for 9 minutes, and rinsed six times with sterilized water. Seeds were sown on half-strength Murashige and Skoog (MS) plates with 0.8% agar and 1% sucrose, then stratified in the dark at 4°C for 2 days. Plates were sealed with Micropore tape and placed vertically in a growth chamber under a 16/8 hour light/dark cycle at 22°C, 120 mmol photons m^-2 sec^-1 light intensity, and 70% humidity for 5 days, using seedlings with 1.5-cm-long roots for experiments. Seedlings were transferred to TPG (transparent Petri dishes with half-strength MS, 0.8% agar, 1% sucrose) or IPG (black Petri dishes with half-strength MS, 0.8% agar, no sucrose) with roots grown in light or dark (using black tape to block light) respectively. Plates were again sealed and grown vertically for 10 days at 22°C. Results showed no significant difference in shoot growth between TPG and IPG, but root lengths were longer in TPG, with increased lateral root number, density, and root hair density in IPG. Root meristem size was similar in both conditions, but root elongation zone was significantly larger in IPG, attributed to auxin-induced acidification in Arabidopsis root apoplast."
        ],
        "not-arithmetic-operator": [
            "A fragment of PFD at least 1-cm-long is sampled directly into the skull during an anthropological or archeological survey. The sample undergoes cleaning and decontamination with non-contaminating plastic tools and air vaporization, without gold covering to allow for surface elemental analysis. It is then examined under a Philips XL30 CP SEM with X-ray microanalysis, storing images at standard resolution. For optical microscope preparation, the sample is finely fragmented, rehydrated, and fixed in 20% diluted acetic acid for 48 hours for slow decalcification. The sample is separated into a liquid phase of PFD suspension and a solid phase, analyzed separately. The liquid phase is centrifuged to produce slides for Papanicolaou and May-Grünwald-Giemsa staining. The solid phase, after centrifugation, is fixed in AFA, processed through dehydration, paraffin embedding, sectioning, and stained with various dyes including periodic acid Schiff and Hematoxylin, Eosin, Saffron (HES), without loss of information due to the microscopic scale of analysis."
        ],
        "assignment-expression": [
            "Use 12-week-old Kunming mice, housing them under standard conditions with access to food and water, and maintain them on a normal salt diet. For blood sample collection, equip with a vacuum tube, butterfly needle, and other necessary items. Restrain a mouse, warm and sanitize its tail, then choose a vein for sampling. Blood is collected using either the experimental method we developed, involving an eyeglass magnifier for precise vein puncture and blood collection into a vacuum tube, or a conventional method using a syringe. Adjust the needle if flow stops and limit to three puncture attempts per session, collecting approximately 175 µL of blood each time, with collections spaced two weeks apart. Use EDTA tubes for plasma and non-anticoagulant tubes for serum, centrifuge samples to separate, and perform statistical analysis on the data, defining success as obtaining the necessary volume per collection and ensuring ethical compliance in blood volume removal."
        ],
        "raise-statement": [
            "Prepare individual fly tubes with food at one end and cotton at the other, ensuring the food end is sealed to prevent drying. Melt fly food and distribute it among the tubes, allowing it to solidify before sealing the food end with wax and the other end with cotton to allow air flow but keep the fly contained. Introduce a single fly into each tube and place these in the Drosophila Activity Monitor (DAM) within an incubator set to constant environmental conditions and specific light/dark cycles, avoiding the use of initial adjustment days in the analysis. Collect data over at least four days for analysis. For data analysis, split the monitor's output into individual files for each fly's activity, and analyze these using a Matlab function, adjusting parameters for sampling rate, bin interval, and baseline trends. Use the program to identify circadian rhythms by selecting specific data points in the activity plot for model fitting, ultimately determining the fly's activity patterns. The results, including model parameters and fit error, are saved for further analysis, with the process requiring careful data handling and interpretation to raise understanding of circadian behavior in Drosophila."
        ],
        "interger-type-declaration": [
            "Collect fibers from twenty random cottonseeds and weigh them (W1). Randomly select six fiber bundles, each weighing around 1~2 mg, and weigh again (W2). Remove the ring and cap from a 0.2 ml micro-centrifuge tube, secure fibers in the cap, and boil the bundle for 10 minutes before cooling. Store in 45% acetic acid if needed for 2-3 days. Dry the bundle, cut it into three segments of about 1~2 mm each, and place snippets into six drops of 45% acetic acid. Observe and photograph each drop using a stereo-microscope. Count snippets in each drop using Image-Pro® Plus software to determine the number of fibers per bundle (N2) by averaging the total snippet count across 18 drops from the three segments. Calculate the number of mature fibers per seed (N1) using the formula: N1=(W1/20)/(W2/N2)."
        ],
        "floatingpoint-type-declaration": [
            "Premoisten 3 swabs with 1.5 mL of buffer solution (Phosphate Buffered Saline with 0.02% Tween 80, PBST) in a 15 mL falcon tube. Press out excess solution inside the tube, swab target surfaces three times using 3 swabs together, ensuring consistent pressure and speed, and rotate swabs for each sampling. Break the swab at its breakpoint and return it to the falcon tube. Collect two negative field controls, one at the start and one at the end of sampling, and prepare two unopened tubes of PBST as negative media controls. Store all samples in a cooler with ice for up to 12 hours during collection. Proceed with swab extraction, sample aggregation, and subsequent cultivation as per the experimental setup."
        ],
        "boolean-type-declaration": [
            "In this simplified experiment, set up the Rubber Hand Illusion (RHI) using a box, artificial hand, gown, and soft brushes, and synchronize brush strokes with a metronome or software. For the crossmodal congruency task, employ tactors for tactile stimuli and LEDs for visual stimuli, controlling them via computer outputs or TTL pulses, and block any extraneous sounds with white noise. Record participant responses using a response box or computer interface. Ensure ethical compliance and obtain informed consent from participants, excluding those with sensory deficits. Position participants to see the rubber hand but not their own and introduce them to the task with training blocks, using both congruent and incongruent tactile and visual stimuli in randomized trials, including no-go trials to confirm attention. Use synchronous brush strokes to induce the RHI and asynchronous strokes as a control, assessing the illusion with both objective and subjective measures. For data analysis, discard responses that are too fast or slow, analyze false alarms in no-go trials, and calculate performance measures for each condition, using statistical tests to evaluate differences, ensuring boolean variables are clearly defined as true or false conditions throughout the setup and analysis to maintain the integrity of boolean-type declaration characteristics."
        ],
        "string-type-declaration": [
            "Prepare for Auditory Brainstem Response (ABR) testing by turning on the computer and launching the Giant ABR recording software. Anesthetize four mice using Avertin (300 mg/kg body weight), ensuring deep anesthesia. Dress in personal protection equipment, including a lab coat, gloves, and face mask. Place the mice on a heating pad within a soundproof chamber, maintaining their body temperature between 36.5°C and 38.0°C. Prevent cornea drying by applying artificial tears. Attach ABR electrodes to the vertex (active), ipsilateral ear (reference), and hindlimb (ground), ensuring electrode impedance is below 5 kΩ. Start the ABR recording system and close the chamber. Use the Shenzhen Giant software for loudspeaker control and ABR data management. Begin with click stimuli, delivering 512 clicks, decreasing from 90 dB SPL to 10 dB SPL in 10-dB steps. Follow with tone burst stimuli across 4–48 kHz, adjusting SPL in 10-dB steps to find auditory thresholds. Continue until waves I through IV are indiscernible, then fine-tune using 5-dB SPL steps. Record responses to each stimulus, averaging over 512 measurements. If testing exceeds 45 minutes or a second ear needs assessing, administer additional Avertin. Post-recording, remove electrodes, allowing mice to recover in a warm cage. Clean electrodes with povidone iodine and 75% ethanol, storing them in a sterile container. Avoid A.C. electronics in the chamber during ABR recording.(see also troubleshooting[href=https://www.wicell.org#troubleshooting]), maintain the animals' body temperature at 36.5°C–38.0°C (see also troubleshooting[href=https://www.wicell.org#troubleshooting]).\nCritical: Throughout the experiment, check the rectal thermometer from time to time to make sure the body temperatures are in the normal range.\nCritical: To prevent the drying of the cornea, add a drop of artificial tear to each eye.\nPlace the ABR electrodes to the vertex (active), the ipsilateral ear (reference), and the ipsilateral hindlimb (ground) (Figure 2[href=https://www.wicell.org#fig2]).\nCritical: Make sure that the electrode wires are tension-free. It is ideal that the needle electrode impedance should be less than 5 kΩ, and that the impedances of the electrodes are comparable.\nTurn on the ABR recording system. Close the soundproof chamber (see also troubleshooting[href=https://www.wicell.org#troubleshooting]).\nUse the Shenzhen Giant software provided with the ABR system to coordinate loudspeaker control as well as ABR acquisition, processing, averaging and data management. Sound signals are generated by a generator unit controlled by the software. Open the acquisition program and start data collection.Start the click stimulation procedure. Recording auditory brainstem responses to 512 click stimuli. Standardize the click stimulus at 100 μsec duration, 20/s, with a decreasing level from 90 dB SPL to 10 dB SPL in 10-dB SPL steps.\nOnce the click recording is completed, start the tone burst (20 ms duration with 1 ms rise and fall time, as well as 47 ms interval) stimulation protocol within the range of interest (e.g., 4–48 kHz).\nIdentify auditory thresholds for each stimulus by decreasing the SPL in 10-dB steps.\nContinue recording ABR until waves I, II, III and IV cannot be discerned.\nAdjust the sound pressure level up and down in 5-dB steps to identify the lowest level.\nRecord the response to each stimulus and obtain the mean response value over 512 measurements.\nNote: If it takes more than 45 min to carry out the ABR, or, after testing the first ear, the other ear needs to be assessed, temporarily suspend the test and inject an extra amount of Avertin (1/3 of the initial dose) to maintain a proper level of anesthesia in mice (see also troubleshooting[href=https://www.wicell.org#troubleshooting]).\nOnce the recording is completed, carefully remove the needle electrodes from the mice. Place the animals in a warm cage until they are fully recovered.\nWhen all tests are finished, soak the needle electrodes in a povidone iodine solution for 1 h. The electrodes were then rinsed with 75% ethanol, and kept in a sterile container.\nCritical: No electronics using A.C. should be utilized in the soundproof chamber when recording ABR."
        ],
        "vector-type-declaration": [
            "Prepare HEK-293FT cells to 90% confluence and change the medium to serum-free DMEM with 1 mM glutamine and 50 mg/ml penicillin-streptomycin before co-transfecting with a pLKO.1-Puro vector, plasmids for delta R8.2, VSV-G, and the miRNA of interest using polyethylenimine. Collect the lentiviruses at 24 and 48 hours post-transfection, filter, and concentrate via ultracentrifugation, then store at -70°C. Determine virus titer on HEK-293T cells with diluted virus preparations, aiming for at least ~1x10^9 infectious particles per ml, based on puromycin selection and GFP expression. For animal preparation, wear surgical attire and anesthetize mice with a Ketamine/Xylazine mix, providing pain relief with Rimadyl and maintaining body temperature. Shave and sanitize the surgical area between the ears. For skull exposure and drilling, position the animal in a stereotax, make an incision, identify bregma and lambda, and drill at specified coordinates for hippocampal CA1 injections. Inject the lentivirus slowly to prevent backflow, waiting five minutes post-infusion for absorption. Seal the wound with histoacryl, hydrate the animal with saline, and monitor during recovery, performing euthanasia if necessary. Assess navigation memory in the Morris Water Maze after 4-6 weeks, following a specific training and testing protocol, and analyze data accordingly."
        ],
        "set-type-declaration": [
            "Before testing, ensure each participant has given written informed consent and verify they have normal or corrected-to-normal vision and adequate stereo acuity using a handheld test. Seat participants comfortably at a mirror stereoscope in a dim room to adapt to the light for at least 3 minutes. They must adjust the stereoscope until a single cross is visible, ensuring proper binocular fusion. Instruct participants to judge which of two curves presented has a greater rotation-in-depth (RID) and respond using mouse buttons, emphasizing it's a forced-choice task requiring a decision for each trial. Evaluate sensitivity to RID changes by comparing performances in stereo (different RID angles to each eye) and nonstereo (same RID angle to both eyes) conditions. Conduct 140 trials using the Method of Constant Stimuli to present various RID angles, both less and greater than 45°, randomly across trials with the reference curve fixed at 45° RID. Allow breaks between blocks of trials and analyze responses to determine the precision of RID discrimination using a Cumulative Gaussian function, comparing slopes for stereo versus nonstereo conditions to assess the impact of stereoscopic cues on RID detection."
        ],
        "temporal-type-declaration": [
            "Grind leaves with 600 µl CTAB buffer and incubate the mixture in an eppendorf tube for 30 minutes at 65°C, adding PVP and mercaptoethanol for occasional mixing. After incubation, let the tube cool at room temperature. Mix the contents with an equal volume of chloroform: isoamyl alcohol (24:1) by inversion for 15 minutes, then centrifuge at 4000 rpm for 20 minutes and transfer the aqueous phase to a new tube. Repeat the extraction with an equal volume of phenol: chloroform (1:1), centrifuge, and transfer the aqueous phase again. Add 1/3 volume of ice-cold isopropanol and 3M Sodium acetate, mix by inversion, and centrifuge to pellet the DNA. Discard the supernatant, wash the pellet with 70% alcohol, air dry, then dissolve the DNA in 100-200 µl of 1X TE (pH 8.0) and store at 4°C, ensuring temporal steps like incubation, mixing, and centrifugation durations are accurately followed."
        ],
        "reg-type-declaration": [
            "Always ensure containers are not tightly sealed to prevent pressure buildup and heed warnings about ensuring adequate ventilation to avoid oxygen deficiency from inert gas displacement. Protect yourself against liquid nitrogen (LN2) splatter. Label cryogenic tubes with sample name, date frozen, and initials before aliquoting 1 mL samples. Fill an insulated pan with LN2 to about 2 cm depth and place a CoolRack in it to cool to -150°C in approximately 15 minutes; pre-chilling the CoolRack in a -80°C freezer can save LN2 and time. Place cryogenic tubes in the CoolRack on dry ice for snap freezing, leaving them for 1 minute before transferring to a freezer box with forceps, then store in a -80°C freezer. For warming, thaw tubes at 4°C."
        ],
        "device-type-declaration": [
            "All procedures have received ethical approval. To control eating rate and food intake with visual feedback, first download and open the specific application on your smartphone. Activate the scale by pressing the red button, and connect it to your phone by selecting it within the app. Choose the type of meal session you want: without visual feedback (Control) or with visual feedback (Training). Place your plate on the scale and add food as indicated by the app. Follow the app's instructions to start eating, aiming to match your eating rate with the app's dashed blue reference curve. Throughout the meal, the app will prompt you to rate your fullness level, guiding you to adjust it according to a purple reference curve. If you're eating too quickly, the app will advise you to slow down. Once finished, confirm on the app, review the meal duration displayed, and then close the session."
        ],
        "container-type-declaration": [
            "Arabidopsis seeds were sterilized using 70% ethanol for 1 minute, then treated with 1% sodium hypochlorite solution plus SDS for 9 minutes, and rinsed six times with autoclaved water. The seeds were sown on half-strength Murashige and Skoog (MS) plates with 0.8% agar and 1% sucrose, kept in the dark at 4°C for 2 days for stratification, then grown in a chamber under a 16/8 hour light/dark cycle at 22°C, with specific light intensity and humidity for 5 days. Seedlings were then transferred to either transparent Petri dishes with the same nutrient mixture (TPG) for growth under light and sucrose conditions, or to black Petri dishes without sucrose (IPG) with the top part exposed to light. After 10 days in these conditions, analysis showed no significant difference in shoot growth between TPG and IPG setups, but root length, lateral root number, density, and hair density were notably higher in IPG. Root meristem size was similar in both conditions, but the elongation zone of primary roots expanded more in IPG, with growth influenced by auxin-induced acidification of the root apoplast."
        ],
        "scientific-type-declaration": [
            "After drying the specimen, double seal the base of a transparent plastic bag and add 10-20 grams of silica gel for moisture control. Seal the bag leaving about 1 cm open at the edge for air removal. Place the specimen directly inside or use tissue paper for support; for delicate specimens, use plastic wrap to avoid direct contact with silica gel. Gently remove air from the bag before sealing. Insert a fungarium submission data sheet with details such as scientific name, family, accession code, and collection information, then seal the bag. Prepare the specimen for fungarium deposition, recording its details in a computer database for easy reference. Organize specimens by genus, family, or collection site in an airtight container, ensuring they are not compressed too tightly and label each with names and accession numbers for visibility. Add extra silica gel to the container before sealing it tightly for storage in a dehumidified environment for long-term preservation, maintaining scientific integrity through methodical preparation and data documentation."
        ],
        "class-type": [
            "The NMT-OO system's setup involves imFLUX software controlling power supply, digital camera imaging, and optrode management. A LED powers a blue LED light focused by a microscope objective through an optical fiber and blue filter onto a MicroTip-Fiber Optic Oxygen Sensor. Fluorescence emission is directed and split, with red fluorescence converted to electrical signals by a PMT, analyzed by a Lock-in-Amplifier and imFLUX software. Procedures include optrode calibration with varying oxygen concentrations, Arabidopsis seedling equilibration in measuring buffer, and immobilization of plant material using filter paper to avoid movement during oxygen flux measurement. The optrode, adjusted by a stepper motor, oscillates between positions to measure oxygen flux without stirring. Initial measurements establish a baseline away from the sample, followed by measurements near the root's periphery to assess oxygen flux. Adjustments in probe positioning and oscillation angle enable mapping of oxygen flux around the root apical region and analysis of hydrogen peroxide effects, embodying a class-type structured approach in plant physiological research."
        ],
        "parallel-for": [
            "Premoisten 3 swabs with 1.5 mL of PBST solution and press out excess against the tube's wall. In parallel, for each sampling location, swab target surfaces three times using the 3 swabs together, rotating and switching order each time to ensure consistent application. Return swabs to the tube after breaking at the breakpoint. Collect two negative field controls, one at the start and end of the session, and prepare two unopened PBST tubes as negative media controls. Store all samples in a cooler with ice for up to 12 hours. This method emphasizes parallel actions in swabbing and sample preparation, aligning with a parallel-for execution model in experimental procedures."
        ],
        "event-statement": [
            "Obtain Institutional Review Board approval for work with human subjects. Schedule the infant's EEG during their regular nap time, ensuring the room is dark and quiet. Prepare by feeding and diapering the infant. Minimize head impedance and place electrodes at specified locations including CZ and around the face. Present pairs of broad-spectrum stimuli (clicks) with a 500 msec interval, 10 sec apart, and record during 15 minutes of active sleep, noting the infant's status throughout. For data analysis, identify a 15-minute period of active sleep characterized by specific sleep markers, filter out noise and low-frequency drift, and average the epochs triggered by the first sound in each pair. Using a bandpass filter, identify P50 wave amplitude in response to stimuli and calculate the P50 sensory gating ratio. This method emphasizes the sequence of events crucial for collecting and analyzing EEG data in infants to study sensory gating."
        ],
        "response-statement": [
            "Select individuals with normal or corrected-to-normal vision, ensuring they are not color-blind. Seat the participant in a quiet room, providing vision correction if needed. Instruct them to study a mountain landscape picture and identify the same landscape among four others under different viewpoints and conditions. Emphasize focusing on the scene's layout and arrangement. Complete three practice items with verbal feedback, clarifying any doubts and reinforcing instructions. Proceed to the main test, informing them of the number of questions and response time. Present test items, timing each for a total of 30 seconds, including an 8-second view of the sample image, transitions, and up to 20 seconds for choosing an answer. Record the participant's choice without providing correctness feedback. After the session, score the total correct responses. This method highlights the response-statement characteristics by focusing on participant instructions, feedback, and response recording throughout the test."
        ]
    },
    "Bioengineering & Technology": {
        "for-loop": [
            "Glycochips with 577 carbohydrate structures were first incubated for 15 minutes at 25°C with PBS and 0.1% Tween-20, then dried using Whatman® filter paper. αGal-KO mouse serum, diluted 1:15 in PBS with 1% BSA and 1% Tween-20, was applied to the glycochips and incubated with agitation at 37°C for 1.5 hours. Repeat washing steps with PBS plus Tween-20 and distilled water, followed by mild centrifugation. Glycochips were then incubated with biotin-conjugated goat anti-mouse IgG+IgM for 1 hour at 37°C with agitation, followed by washing steps to remove unbound antibodies. Repeat incubation in darkness at 25°C for 45 minutes with Cy5 dye-labeled streptavidin, diluted 1:500. After a final round of washing, glycochips were air-dried in darkness and scanned with a ScanArray GX Plus scanner. Data analysis and interactive exploration, including heat mapping and clustering analysis, were performed using the ScanArray® Express system and the Hierarchical Clustering Explorer application."
        ],
        "while-loop": [
            "Prepare stock solutions in 10 mM NH4OAc, pH 6.0: 500 µM cucurbituril, 25 µM dapoxyl, 1 mM lysine, and 800 µg/ml lysine decarboxylase. Mix 100 µl Dapoxyl stock and 780 µl buffer in a cuvette, place in a fluorometer, and start kinetic recording (excitation at 336 nm, emission at 380 nm). Add 20 µl cucurbituril stock, wait about 2 minutes for fluorescence to equilibrate, then add 50 µl lysine stock. Initiate the reaction by adding 50 µl lysine decarboxylase, recording fluorescence until no change in intensity is observed. The final assay volume is 1 ml, with final concentrations of 2.5 µM Dapoxyl, 10 µM cucurbituril, 50 µM lysine, and 40 µg/ml lysine decarboxylase. Repeat steps with different enzyme, substrate, or cucurbituril concentrations, monitoring the reaction and recording data until no further change in fluorescence signals."
        ],
        "if-branch": [
            "Prepare a single cell suspension by flushing the femur with ice-cold bone marrow harvesting medium, filtering the cells through a 70um strainer while keeping them on ice, counting their concentration, centrifuging at 1500rpm for 5-10 minutes, and resuspending in HBSS+ staining buffer to about 2x10^7 cells/mL if possible. Stain cells by aliquoting 100ul of the suspension for staining, preparing control samples including unstained and single color fluorescence antibody-stained samples for FACS compensation, adding 2uL CD45 antibody and other antibodies to the 100uL cells and rocking slowly at 4°C for 15 minutes, spinning down at 1500rpm for 7 minutes, resuspending in 200ul ice-cold HBSS+, and adding 5-7ul 7-AAD to exclude dead cells during FACS analysis. Perform FACS analysis by adjusting the voltage, running compensation, processing samples to collect data, and analyzing the FACS data on CD45-SSC plots."
        ],
        "allocate-statement": [
            "For each replicate, begin with 1 ml of serum or plasma, add PBS to fill the ultracentrifuge tube, and centrifuge for 90 minutes at 100,000 x g at 4°C. Discard the supernatant and resuspend the pellet in PBS to refill the tube, then centrifuge again for 70 minutes at 100,000 x g at 4°C. Discard the supernatant and add 1 mL Qiazol to the pellet to proceed with miRNeasy RNA isolation."
        ],
        "deallocate-statement": [
            "Start with 500 µL serum or plasma, adjust volume with PBS to fill the ultracentrifuge tube (2.3-2.5 mL), and centrifuge for 70 minutes at 100,000 x g at 4°C. Remove the supernatant and resuspend the pellet in PBS to refill the tube, followed by another centrifugation for 70 minutes at 100,000 x g at 4°C. After discarding the supernatant, resuspend the pellet in 50 µL PBS for storage at -80°C, or proceed to miRNeasy RNA isolation by adding 700 µL Qiazol to the pellet."
        ],
        "function-procedure-call": [
            "Set up the Doppler phantom by connecting the peristaltic pump, blood mimicking fluid reservoir, pulse dampener, and Doppler flow phantom with plastic tubes, selecting a 4 mm diameter canal, and programming the pump to mimic cardiac systole and diastole phases by ejecting fluid at specific rates and durations. Shake the setup to remove air bubbles, ensuring ultrasound sequences can capture the fastest flow velocities with potential adjustments in canal diameter and pump rate. For the ultrafast ultrasound scanner, connect it to a host computer, switch the transducer adapter to match the probe, and activate the scanner license in Matlab. Design ultrasound sequences in Matlab, including a conventional focused B-Mode for probe positioning and an ultrafast sequence with specific parameters like imaging depth, focal depth, tilted plane-waves, pulse repetition frequency, and waveform cycles. Position the probe on the phantom, run sequences to acquire data, and proceed to image reconstruction, saving raw RF data and using default software for reconstruction to form the IQ data matrix. Perform clutter filtering by reshaping the IQ matrix, applying singular value decomposition, computing a Spatial Similarity Matrix, and filtering the data based on identified blood subspace boundaries. For flow visualization and velocity measurements, compute a power Doppler map, adjust the dynamic range, define an ROI, average IQf signal over ROI pixels, compute and display the Doppler spectrogram with specific settings for the STFT, and use the Doppler formula to convert frequencies into blood axial velocities."
        ],
        "function-procedure-declaration": [
            "Human gingival tissues, discarded from extractions and compliant with ethics guidelines, are collected in PBS with penicillin/streptomycin and kept at 4°C. Reagents include a 3% penicillin/streptomycin washing solution, growth-factor-containing medium with DMEM/F12, B27, EGF, FGF2, and fungizone, and enzyme digestion solutions of dispase and collagenase in DMEM. For direct explant culture, gingival tissues are washed, cut into 1 mm^3 pieces, placed in culture dishes with growth medium, and incubated at 37°C in 5% CO2, monitoring growth and changing medium regularly. The enzymatic method involves similar pretreatment, cutting tissue into tiny pieces, digesting with dispase and collagenase, terminating digestion, filtering, centrifuging, and culturing cells with growth medium and Y-27632, changing medium and observing cells periodically. Cell passaging involves trypsinizing, stopping digestion, centrifuging, resuspending in growth medium, counting cells, seeding new cultures with specific cell numbers, and renewing medium and Y-27632, with regular observation."
        ],
        "add-arithmetic-operator": [
            "Harvest mouse spleens, embed in OCT, and freeze in liquid nitrogen. Cut 7 µm sections, mount on Superfrost Plus slides, incubate in humidified chambers at 4°C overnight, dry, fix in acetone at 4°C for 10 minutes, and block with PBS + 5% fetal calf serum at 25°C for 1 hour. Stain sections at 4°C overnight with anti-CD3-phycoerythrin, anti-B220-FITC, and peanut-agglutinin-biotin diluted in blocking buffer (dilution 1:200 – 1:1000). Wash slides 3x with PBS + 0.05% Tween 20, stain with streptavidin-cyanin 5.5 (dilution 1:100) at 25°C for 1 hour, wash again 3x, dry, mount with Gelmount, and capture images at x10 magnification with a Zeiss Axioplan microscope."
        ],
        "minus-arithmetic-operator": [
            "Dilute plasmid DNA in sterile PBS to achieve the required concentration per mouse just before injection. Load 2 ml of this solution into a 3 ml syringe fitted with a 27-gauge needle, ensuring there are no air bubbles. Warm the mouse under a heat lamp for 1-2 minutes, then secure it in a Mouse Tail Illuminator. Inject the DNA solution into the tail vein over 5-7 seconds and return the mouse to its cage. The mouse may show temporary reduced activity but should recover within 10 minutes."
        ],
        "multi-arithmetic-operator": [
            "Seed 3 x 10^6 cells (BMDCs or BMMφs) in 60 x 15 mm cell culture dishes at 10^6 cells/ml concentration in the appropriate medium and incubate overnight at 37°C with 5% CO2. Wash cells three times with 3 ml pre-warmed PBS to remove residual extracellular esterases. Add 1 ml of 2 µM ratiometric probe indo-1 in PBS, incubate for 20 minutes at 37°C with 5% CO2 in the dark, then wash three times with 3 ml pre-warmed PBS to remove free probe. Add 1.8 ml pre-warmed PBS, begin real-time imaging acquisition, and superfuse with the appropriate stimulus in 200 µl PBS."
        ],
        "devid-arithmetic-operator": [
            "Prepare sphere media by adding 20 ng/ml EGF, 20 ng/ml bFGF, and 1X B27 supplement to serum-free, phenol red-free DMEM. For 100 ml of media, mix 2000 ng EGF, 2000 ng bFGF, and 2 ml of 50X B27 supplement, or alternatively, add 1% FBS to DMEM without EGF, bFGF, or B27. Wash cancer cells in 1X PBS, trypsinize, centrifuge at 300 x g for 10 minutes, resuspend in sphere media, filter for single-cell suspension, isolate specific cells if needed, and test cell viability with 0.4% Trypan Blue. Seed cells at 1 cell per well in a 96-well ultra-low attachment plate, use non-tumorigenic cells as a control, and incubate at 37°C with 5% CO2. Check daily for sphere formation for up to 10 days or more, calculating efficiency as (# of spheres / # of wells seeded) x 100%. For serial passaging, dissociate spheres, centrifuge, prepare in sphere media, seed at 1 cell per well in a new plate, and reassess sphere-forming efficiency using the same formula."
        ],
        "and-arithmetic-operator": [
            "Recruit 7 mandibular models and apply radio opaque markers. Record 10 predetermined linear measurements, perform CBCT scanning of each model, and convert DICOM files into STL format. Use SLS and FFF printers for 3D printing the models. Record the same 10 linear measurements on the printed models and compare these values against the reference models and each other."
        ],
        "or-arithmetic-operator": [
            "Tissue samples for RNA analysis were obtained from hypothalamic nuclei or by capturing either 50 GFP-positive or -negative cells onto a single CapSure HS LCM Cap using laser capture microdissection with parameters: spot size of 7.5 µm, power between 50-80 mW, and pulse duration of 50-1,000 ms. Total RNAs were then isolated using the PicoPure RNA Isolation Kit and treated with DNase I."
        ],
        "not-arithmetic-operator": [
            "Place 10-300mg of zebrafish into microcentrifuge tubes; unhatched fish do not require dechorionation. For each mass of fish, add double the mass in zirconium oxide grinding beads. Add twice the volume of buffer to the fish mass (e.g., for 100mg fish, use 200ml buffer), selecting the buffer based on the downstream application. Securely close the tubes and place them in a Bullet Blender™ without needing to balance them. Set the blender to SPEED 8 and TIME for 3 minutes, then start. After blending, proceed with the chosen downstream application."
        ],
        "assignment-expression": [
            "Keep all reagents and microcentrifuge tubes on ice and pre-cool the centrifuge to 4°C. Label microcentrifuge tubes and prepare the polyamine binding mix in them as per Table A & B. Gently mix and incubate on ice for 60 min. Place the filtration device in a pre-cooled 1.5 ml collection tube. After incubation, transfer 100 µL of the mix to the labeled filtration devices and spin at 2500xg for 5 min at 4°C to filter free polyamines. Prepare microcentrifuge tubes with 1 mL scintillation liquid at room temperature, two for each filter device used. Transfer 10 µL of retentate and filtrate into their respective tubes labeled retentate and filtrate. Vortex for 10s and perform scintillation counting. Calculate the percentage of protein-bound polyamines using the formula: Percentage polyamine Binding = {(CPMretentate - CPMfiltrate) / CPMretentate} x 100."
        ],
        "raise-statement": [
            "To prepare DNA from mouse ear or tail clips for PCR, add 0.5 ml Lysis buffer to a 1.5 ml tube with the sample and incubate at 55°C with shaking at 200 rpm for at least 3 hours to overnight. Post-lysis, vortex, and centrifuge at 20,000 g for 10 minutes. Transfer the supernatant to a new tube containing 500 µl isopropanol, mix, and incubate at room temperature for 5 minutes or store at -20°C. Centrifuge again at 20,000 g for 10 minutes, discard the supernatant, wash the DNA pellet with 0.5 ml of 70% ethanol, and centrifuge for 5 minutes at 20,000 g. Air-dry the pellet, remove residual ethanol, and resuspend the DNA in 500 µl of 10 mM Tris, pH 8.0, shaking at 200 rpm at 55°C for 20 minutes to overnight for resuspension. For PCR, vortex thawed reagents, keep everything on ice, prepare the reaction mixture on ice, and have a thermal cycler preset. Prepare a Master Mix of PCR reagents without the DNA template, allowing for extra reactions for errors or controls. Add reagents as specified, mix gently, dispense 9.5 µl into PCR tubes, add 0.5 µl of DNA to each, mix, and run in the thermal cycler as per the program. For gel electrophoresis, prepare a 0.8% agarose gel in TAE buffer, add loading dye to each reaction, electrophorese with EtBr, run at 100 volts for 30 to 45 minutes to resolve specific DNA bands, document gel images for genotype interpretation, and use a marker standard for length determination."
        ],
        "interger-type-declaration": [
            "Grow yeast cells transformed with GFP-fusion on solid media, then transfer them to a microscope slide and cover with a coverslip. Acquire Z-sections using a spinning disk confocal microscope as described."
        ],
        "floatingpoint-type-declaration": [
            "Thaw samples on ice, transfer 0.5 mL of urine into an ultracentrifuge tube, and fill up to 3 mL with PBS. Centrifuge at 100,000 x g for 70 minutes, discard 3 mL supernatant, add 3 mL fresh PBS, and centrifuge again under the same conditions. Remove and discard 3.3 mL of supernatant, resuspend the remaining solution (about 200 µL), freeze at -80°C until needed, and isolate RNA using the miRNeasy Micro kit."
        ],
        "boolean-type-declaration": [
            "Sterilize the TEER probe and pre-soak it in cell culture medium. For 24 mm inserts, add 1 mL of medium to the apical side, and 500 µL for 12 mm inserts. To take TEER readings, connect the electrode to the meter, set to Ohms, turn the power on, and ensure the EVOM2 is disconnected from the charger. Measure blank resistance by placing the electrode in a blank insert with cell media in the basal and PBS in the apical compartment, ensuring correct placement of the probe. Take three readings per insert and subtract the blank resistance from experimental measurements to obtain true tissue resistance. Clean the electrode post-use with distilled water, soak in 1% Tergazyme solution according to usage frequency, rinse well, and air dry. Maintain the probe by occasionally resurfacing with 600-grit sandpaper."
        ],
        "string-type-declaration": [
            "Access the server at http://crdd.osdd.net/raghava/kidoq using a web browser. On the KiDoQ server home page, click the Submit button, then fill out the submission form. You can either draw the chemical structure using the JME editor or paste/browse the structure file in mol/mol2 format. If pasting or browsing a structure file, select the file format type. Finally, click the Run button to obtain the results."
        ],
        "vector-type-declaration": [
            "Transfect retroviral constructs (pMX-IRES-rCD2) into Phoenix cells using FuGene-6. After 48 hours, collect and concentrate the retrovirus-containing supernatant 10-fold by centrifugation (8000 g, 12 hours, 4°C), then filter through a 0.22µm PVDF membrane. Store the filtrated supernatant at 4°C for up to a week. Isolate bone marrow cells from mice, culture them in RPMI 1640 medium with supplements and mouse IL-3 for 9 days, changing the medium every 3 days. Enrich BM-derived basophils by depleting c-kit+ cells. Treat 12-well plates with RetroNectin, then with BSA. Incubate plates with virus supernatant, add enriched basophils, and culture for 2 days. Wash infected cells with RPMI 1640 containing 2% FBS. For IL-3 stimulation, 'starve' the infected basophils in media without IL-3 for 12-18 hours before enrichment."
        ],
        "set-type-declaration": [
            "The authenticity of shrunken heads is verified through a procedure comprising morphological analysis for 14 specific criteria, with optional hair microscopic examination and skin DNA analysis. The criteria include: darkened skin color from charcoal dust, wooden pegs or fibers in the lips or corresponding holes if removed, a loop of vine or fiber in the neck or suturing/sawing traces, thick and leathery neck opening edge, oval neck shape or lateral head compression, fiber stitches connecting neck and head tissues, preserved ear anatomical details possibly with a hole, eyes tightly closed with smooth surrounding skin, hairs in nostrils, long dark hairs possibly cut post-shrinkage, a long suspension cord or hole on the head top, absence of facial painting or scars, no remaining skull fragments, and head cavities filled with sand/charcoals, identifiable by CT-scan."
        ],
        "temporal-type-declaration": [
            "Select suppressor mutants from the 31019b yeast strain with pDR-AtAMT1;1Thr460Ala plasmid by growing them at 28°C on YNB medium with 3% glucose and 2 mM ammonium chloride for 8 days. Pick suppressors and amplify in liquid YNB medium with the same supplements. Isolate the plasmid from yeast using CTAB extraction for E. coli transformation. Amplify plasmids in E. coli, isolate, and sequence."
        ],
        "reg-type-declaration": [
            "Culture cells in a 96-well plate, allocating wells for each time point. Allow the plate to reach room temperature for 30 minutes. Set up control wells with medium only for background measurement. Add luciferin solution to the wells in a 1:1 ratio with the cell culture medium. Gently shake the plate for 5 seconds to mix, then immediately measure luminescence using a plate reader, with a detection time between 1 to 10 seconds based on the equipment's specifications."
        ],
        "device-type-declaration": [
            "Grow yeast cells with GFP-fusion on solid media, transfer to a microscope slide covered with a coverslip, and acquire Z-sections using a spinning disk confocal microscope."
        ],
        "container-type-declaration": [
            "Start with 500 µL serum or plasma in an ultracentrifuge tube, adjust volume to 2.3-2.5 mL with PBS, and centrifuge at 100,000 x g at 4°C for 70 minutes. Discard the supernatant, resuspend the pellet in PBS to refill the tube, and centrifuge again under the same conditions. Discard the supernatant, resuspend the pellet in 50 µL PBS for storage at -80°C, or add 700 µL Qiazol for miRNeasy RNA isolation."
        ],
        "scientific-type-declaration": [
            "Prior to the onset of directed differentiation, pluripotent stem cells are cultured in maintenance medium with 1% or 2% DMSO for 24-48h. Proceed with desired differentiation protocol after this treatment."
        ],
        "class-type": [
            "Inoculate 10 ml YPAD medium with Y190 colony, incubate at 30°C overnight, then culture 55 ml YPAD to OD600 of 0.3. Incubate until OD600 reaches 0.7. Harvest cells, wash in sterile water, and resuspend in 0.1 M LiAc. Boil ssDNA, mix with yeast suspension, and aliquot into tubes. Add PEG 3350, LiAc, ssDNA, and plasmid DNA to each tube, vortex, and heat shock at 42°C for 15 min. Resuspend in sterile water for plating. Plate on SC minus plates, grow for 3-5 days, then streak on SC minus plates with 3AT and X-gal, observing growth and color change after 3-5 days."
        ],
        "parallel-for": [
            "Transfer 200 µl of serum into a 1.5 ml microfuge tube, add 50 µl ExoQuick Exosome Precipitation Solution, and incubate at 4°C for 30 min. Centrifuge the mixture at 1,500 x g for 30 minutes at room temperature, then aspirate the supernatant. Spin down any residual ExoQuick solution at 1,500 x g for 5 minutes at room temperature. Carefully aspirate all fluid without disturbing the pellet, and finally resuspend the pellet in 20 µl sterile PBS."
        ],
        "event-statement": [
            "Dialyze KIF1A solution against buffer A using a Slide-A-Lyzer dialysis cassette for over an hour, then concentrate it to 40-80 mg/ml with an Amicon Ultra centrifugal filter. Add 2-, 4-, or 10-fold excess apyrase, incubate on ice for 30 minutes, and centrifuge at 20,000 g to remove aggregates. Mix apyrase-treated KIF1A with reservoir buffer and set up hanging drops over well solutions containing reservoir buffer. Monitor and harvest crystals with a cryoloop every 24 hours from appearance (around day 3) until disappearance (around day 7), and immediately flash-freeze in cold nitrogen at -175°C."
        ],
        "response-statement": [
            "Place larvae in a 1m^3 box filled with dirt, feed them the specified food 3-4 times a day at 2-3 hour intervals for optimal growth. Continue until larvae become pupae, at which point increase food quantity. Once pupae develop into adults, introduce water to the environment for mating. After mating, collect the new larvae."
        ]
    },
    "Bioinformatics & Computational Biology": {
        "for-loop": [
            "Study design: Timing: 3 days for protocol development. IRB/ethics review and revision can take 4-8 weeks. Repeat with number from 1 to 11:1. Define the crisis situation.2. Select existing algorithms for study.3. Define hypothetical triage algorithms for study.4. Select primary and secondary clinical endpoints.5. Determine the clinical data needed.6. Select the patient cohort for study.7. Assess availability of necessary clinical data.8. Adapt the triage algorithm scoring scheme.9. Submit the proposed study to the IRB or ethics panel. Calculating priority scores: Timing: 3 weeks to 3 months. Repeat with number from 1 to 8:1. Create a case report form.2. Select a data management system.3. Select the method of data entry. 4. Perform pilot data acquisition. 5. Complete the case report form for all patients.6. Apply the triage algorithms and calculate priority scores. Testing algorithm accuracy Timing: 1 day.1. Determine the accuracy of the priority scores Simulation of clinical decision-making: Selection from a smaller group Timing: 1 day. Repeat with number from 1 to 4:1. Format input files.2. Run CSC script.3. Assess bootstrap analysis output. Sensitivity analyses: Timing: 1 week. Repeat with number from 1 to 4:1. Test the effect of data processing methods.2. Test the effect of patient characteristics. 3. Test the effect of triage algorithm components."
        ],
        "while-loop": [
            "To prepare and test antimicrobial solutions, begin by mixing the stock solutions to achieve the desired concentrations, ensuring usage on the same day to maintain stability and avoid degradation through freeze-thaw cycles. Repeat the process of dispensing 50μL of these solutions into micro-dilution trays in triplicate, following a descending order to ensure proper dilution. Include positive and negative controls by using Mueller-Hinton broth (MHB) with and without inoculum, respectively. Mix 50μL of bacterial inoculum with 50μL of each antimicrobial solution in the wells to reach a final density of 5×10^5 CFU/mL. Seal the trays to prevent desiccation and incubate at 35±1°C for 18±2 hours, avoiding stacking more than four trays to ensure even heating. Use a different plate for each microorganism to prevent cross-contamination. Store unused trays at ≤-60°C if not used immediately, ensuring they are sealed properly. After incubation, perform a viable cell count by taking a sample from a positive control well, diluting, and spreading on an MHA plate to check for acceptable growth. Record data after 18 hours by measuring the optical density to determine the minimum inhibitory concentration (MIC) where there is no visible growth. Analyze the data according to specific breakpoints for susceptibility and resistance. Finally, import and analyze the experimental data using the DANAMIC software, ensuring proper export and formatting of the data for accurate analysis. Repeat this analysis process, with no specified number, to validate the results and ensure consistency across different batches and strains."
        ],
        "if-branch": [
            "To analyze protein-DNA binding from sequencing data, initiate by running a Snakemake pipeline for visualization of binding states within your region of interest. If using a demo dataset, this process is quick, but with full raw data, expect initial preparation to take approximately 10-15 hours, with subsequent visualizations under 5 minutes. The protocol includes adapter trimming and alignment to your reference genome using Trim Galore and Bismark for bisulfite sequence alignment. Next, refine methylation calls to only consider CpG and GpC contexts, suppressing other contexts. Extract aligned paired-end reads to form DNA molecules for mapping binding states. Define footprints on these molecules, considering the saturation of CpG and GpC dinucleotides by methyltransferases. A footprint is identified between two methylated cytosines if unmethylated cytosines are present, merging close footprints to define larger ones. Special attention is given to DNA molecules with all unmethylated cytosines in relevant contexts, assigning the entire molecule length as a footprint. Assign binding states on individual molecules at single and pairs of binding sites based on footprint presence and size, considering the specific characteristics of naked-DNA, TF-bound, and nucleosomal DNA. For pairs of binding sites, co-binding states are determined based on the proximity and size of footprints across the sites. This analysis requires specific file formats and runs conditions that prioritize accurate binding state assignment, reflecting the intricacies of protein-DNA interactions and the effects of chromatin structure."
        ],
        "allocate-statement": [
            "To visualize protein-DNA binding states from sequencing data, run a single command using Snakemake with a specified snakefile and config file. This command, tailored for either demo or full raw sequencing data, initiates a process that includes adapter trimming and alignment, methylation suppression in non-CpG/GpC contexts, and extraction of adjacent or overlapping bisulfite reads to form longer DNA molecules for analysis. Footprints are defined on these molecules based on methylation patterns, with special consideration for complete occlusion scenarios. Binding states at single and pairs of binding sites are then determined, allocating naked-DNA, TF-bound, or nucleosomal states based on footprint characteristics. For co-binding analysis at paired sites, a bedpe formatted file is prepared to denote the centers of binding sites, and specific commands are run to assign co-binding states. This streamlined protocol encapsulates critical steps for accurate visualization and analysis of protein-DNA interactions, preserving the allocation statement characteristic by specifically assigning states based on predetermined conditions."
        ],
        "deallocate-statement": [
            "To analyze fecal samples for microbiota and metabolites, begin by collecting samples and storing them at -80°C after flash-freezing in liquid nitrogen. For dual analysis of microbiota and metabolites, split samples into two tubes. Extract DNA from samples using a stool DNA kit for PCR amplification of the 16S rRNA gene V3V4 region, preparing a master mix with modified primers to enhance efficiency. After amplification, clean up PCR products with AMPure XP Beads to remove primers and verify amplicon size on an agarose gel. Proceed with 16S rRNA gene amplicon sequencing using a NovaSeq 6000 System, ensuring equal pooling of amplicons for sequencing. For metabolomics, extract metabolites from fecal samples using a methanol and acetonitrile solution, then freeze-dry and reconstitute in acetonitrile. Analyze the samples using LC-MS, maintaining specific conditions for chromatographic separation and detection in both positive and negative ion modes. Ensure the accuracy of the LC-MS system by calibrating every 20 samples and analyzing a pooled quality control sample every 10 samples to monitor system stability. This streamlined protocol encompasses critical steps from sample collection through DNA sequencing and metabolite analysis, preserving the deallocate statement characteristic by specifying the removal of unneeded components and verifying the integrity and quality of data throughout the process."
        ],
        "function-procedure-call": [
            "To construct and analyze co-expression networks, first, calculate pairwise gene correlations using Python's pandas and networkx for network construction. Employ pandas to generate an adjacency matrix from a gene expression matrix, selecting significant correlations (|r| > 0.85, p-value < 0.05) to define network edges. Save these edges in a CSV file as an adjacency list. For a consensus network, downsample both normal and cancer datasets to 100 samples each, creating networks for each subset. Combine links from all subsets, assigning frequencies to each interaction. Use these to define final networks for normal and cancer datasets, saving as dataframes. Analyze network structures by comparing connectivity and similarity, identifying hub nodes as the top 2% most connected nodes. For differential co-expression analysis, categorize network nodes as lost, conserved, or acquired in cancer compared to normal. Use Python's gseapy for gene enrichment analysis of these node categories, focusing on biological processes. This approach encapsulates function and procedure calls for network analysis, emphasizing the systematic use of Python functions for data processing and analysis within a biological research context."
        ],
        "function-procedure-declaration": [
            "To analyze protein-DNA binding states from raw sequencing data, start with a single Snakemake command incorporating a specific analysis pipeline. Preprocess NGS data for adapter trimming and alignment, emphasizing suppression of cytosine methylation outside CpG or GpC contexts. Extract adjacent or overlapping bisulfite reads to form longer DNA sequences, mapping binding states onto these sequences. Define footprints based on methylation patterns, considering complete occlusion scenarios as a single large footprint. Assign binding states at specific regions of interest (ROIs) and across pairs of binding sites, utilizing bedpe files for co-binding analysis. This streamlined approach focuses on extracting and analyzing DNA molecules for transcription factor and nucleosomal binding, employing critical thresholds for footprint identification and state assignment. The process encapsulates the declaration of functional procedures for data preprocessing, analysis, and visualization, tailored to elucidate complex protein-DNA interactions within genomic research."
        ],
        "add-arithmetic-operator": [
            "To conduct an optogenetic assay using a copulation-triggered photostimulation system, start by setting up crosses between piezo-GAL4 males and UAS-GtACR1 virgin females to prepare GtACR1-expressing male flies. Transfer parental flies to new vials every 5 days and collect the F1 males. Feed the experimental male flies with all-trans-retinal (ATR) by adding 2μL of ATR to the fly food, and use ethanol (EtOH) for the control group. Place the males in the dark for 24-36 hours before the experiment. For the optogenetic assay, position a fixed female in the center of a courtship chamber and adjust a green laser to target the male genitalia during copulation. Introduce a male fly into the chamber and cover it with glass. Use a custom Bonsai script to record the event with cameras, using calibration LEDs to synchronize the start timing of the recordings. The laser is activated upon detection of copulation, inhibiting neural activity in the male's piezo-expressing neurons. The experiment runs for about an hour or until copulation concludes, ensuring the precise application and analysis of optogenetic control during mating behaviors, highlighted by the addition of ATR and EtOH to the diet."
        ],
        "minus-arithmetic-operator": [
            "To conduct a comprehensive study involving fecal sample collection, DNA extraction for 16S rRNA gene sequencing, and untargeted metabolomics via LC-MS, follow these streamlined steps: Collect fecal samples, flash-freeze them, and store at -80°C. For DNA extraction, use an Omega E.Z.N.A.® Stool DNA Kit, prepare a Master Mix for PCR amplification of the 16S rRNA gene V3V4 region, and perform PCR. Clean up PCR products with AMPure XP Beads, verifying the amplicons' size on a 2% agarose gel. Sequence the PCR amplicons on a NovaSeq 6000 System. For metabolomics, extract metabolites from fecal samples using a methanol and acetonitrile solution, freeze-dry the supernatant, and reconstitute in acetonitrile. Analyze samples with LC-MS, using a Vanquish Flex UHPLC System and a TripleTOF 5600 plus for detection. Maintain samples at 35°C during separation, and operate the Q-TOF in both positive and negative ion modes. Calibration of the instrument is required every 20 samples to ensure accuracy, with a QC sample analyzed every 10 samples for system stability. This method encapsulates critical steps, including the subtraction of solvents and reagents for purification and analysis, providing a clear path from sample collection to biomarker discovery."
        ],
        "multi-arithmetic-operator": [
            "To prepare SARS-CoV-2 sequencing libraries, start by combining cDNA from two sources into a TAG plate, then tagment and amplify the DNA. Prepare Tagmentation Mastermix and add it to the TAG plate, followed by thermal cycling. Post-tagmentation, add ST2 HT to each well for clean-up and wash the beads with TWB HT. For amplification, prepare Enhanced PCR Mix, discard the supernatant from the TAG plate, add the PCR mix and index adapters, then thermal cycle again. Pool the libraries from each well into an 8-tube strip, then into a microcentrifuge tube, adding ITB to purify the library. Quantify the library pool using Qubit, calculate the molarity, and dilute to 4nM. Sequence the libraries on a MiSeq platform, preparing PhiX control and diluting both PhiX and the COVIDSeq library for loading onto the flow cell. Perform denaturation steps for both libraries, aiming for a 6pM final loading concentration with a 1% PhiX spike-in. Sequence and anticipate an output of 3.3-3.8 Gb using a MiSeq v3 2x75 cycles kit. This process involves multiple arithmetic operations, including volume calculations and dilutions, ensuring precise library preparation and sequencing."
        ],
        "devid-arithmetic-operator": [
            "To predict intrinsically disordered regions (IDRs) and multivalent domains in proteins such as RPB1 and CTCF, retrieve their amino acid sequences from UniProt. Use IUPred2A for IDR analysis, identifying regions with scores over 0.5 as IDRs. For experimental validation, clone the IDR and multivalent domains into suitable vectors and express in E. coli, ensuring soluble expression through tag fusion. Validate constructs via Sanger sequencing, express in Transetta (DE3) cells, and check protein expression. For protein purification, follow standard protocols, verify purity with SDS-PAGE, and quantify using NanoDrop and BCA methods. Calculate molar concentration using the protein's mass concentration divided by its molecular weight, aliquot, and store at -80°C. To assay droplet formation of Pol II CTD and CTCF DBD proteins, thaw proteins, dilute as needed, and mix with crowding molecules or dilution buffer for CTCF DBD. Incubate at room temperature, avoiding light, and analyze droplet formation using confocal microscopy. Adjust protein and salt concentrations to optimize droplet formation, capturing images under standardized conditions. This method involves division calculations for dilutions and concentration adjustments, key for preparing proteins and assessing phase separation potential."
        ],
        "and-arithmetic-operator": [
            "To analyze GWAS datasets for associated biomarkers, use the streamlined pipeline encapsulated from Climente-González et al. (2021). This involves multiple subsampling of the GWAS data, performing chi-squared tests for SNP-phenotype associations with PLINK, and calculating gene-level association scores using VEGAS2. Five algorithms, including dmGWAS, heinz, LEAN, SConES, and SigMod, are utilized to identify significant genes within biological networks, leveraging both SNP and gene-level information. Aggregate these findings from various subsamples to compile a consensus of biomarkers. Execute this analysis using the `stable_network_gwas.nf` script in a Docker environment, specifying the GWAS file location with the `--bfile` flag for input in PLINK format. Additional parameters can adjust for gene-gene interaction networks and linkage disequilibrium reference panels. This approach integrates multiplication and division operations in calculating scores and aggregating results, providing a comprehensive analysis of GWAS data to pinpoint relevant biomarkers efficiently."
        ],
        "or-arithmetic-operator": [
            "To visualize protein-DNA binding states from sequencing data, start by using Snakemake with a cooperative_binding_analysis.smk script and a config file. This process involves preprocessing NGS data for alignment, suppressing non-CpG/GpC methylation, extracting overlapping bisulfite reads to create longer DNA molecules for mapping binding states, and defining footprints based on methylation patterns. DNA molecules are analyzed for transcription factor and nucleosomal binding, with binding states assigned based on predefined conditions. Co-binding states across pairs of TF binding sites are determined using a bedpe formatted file. This simplified procedure retains the or-arithmetic-operator feature by incorporating conditions that assign a footprint as naked-DNA, TF, or nucleosomal based on the length and position of footprints relative to regions of interest, facilitating the comprehensive analysis of protein-DNA interactions within genomic sequences."
        ],
        "not-arithmetic-operator": [
            "To perform a colocalization analysis using PAD2, begin by selecting transcription factors (TFs) and histone marks from the database for analysis within specified genomic regions. Access PAD2 online, choose signals of interest, and optionally upload your own signal files. After selection, specify a functional genomic region for analysis, with colocalization assessed via Pearson’s correlation of ChIP-seq profiles. Investigate correlations within these regions through a heatmap, offering insights into protein colocalization based on functional roles. For detailed examination, hover over the heatmap for correlation values and download correlation matrices as needed. This streamlined approach retains the not-arithmetic-operator feature by focusing on the selection and analysis steps without performing direct mathematical operations on the data, allowing for efficient identification of protein interactions within specific genomic contexts."
        ],
        "assignment-expression": [
            "To perform a comprehensive analysis on a GWAS dataset, encapsulated into a single command from Climente-González et al. (2021), this pipeline involves multiple steps for subsampling the input dataset, computing chi-squared tests of association between SNPs and the phenotype, calculating gene-level association scores, and identifying important genes in a biological network through five different algorithms. Each subsample is analyzed independently, with the final results aggregated to highlight consistent findings across subsamples. Run the pipeline using Docker with the command `stable_network_gwas.nf`, specifying the base name of the GWAS files. Customize the pipeline with additional flags for gene-gene interaction networks or linkage disequilibrium reference panels. This process, from initialization to execution, is designed to uncover associated biomarkers efficiently, integrating complex computational steps into a user-friendly command."
        ],
        "raise-statement": [
            "To perform fiber-photometry recording using the Ocean QE-Pro spectrometer, first ensure operations in a dark environment to minimize ambient light interference. Measure the 488 nm laser power at the patch cable tip, adjusting it to achieve a photon count over 1000 for both GCaMP6f and tdTomato, typically setting it around 50 μW without exceeding 100 μW. Subtract background noise by pointing the patch cable's end to an optical beam trap and clicking the light bulb button before connecting to the implanted fiber probe. Begin recording after connection. For detailed spectral analysis and emission adjustments, refer to Ocean Insight's manual and consider interleaved recording for multiplexed studies using different excitation lasers. Optional procedures include intravenous injection of Rhodamine B for cerebrovascular blood volume (CBV) signals and data preprocessing with MATLAB for spectral analysis. Ensure to subtract background noise and adjust for hemodynamic changes. Troubleshooting tips include addressing unbalanced spectral peaks, noisy data, and frame loss during recording. This simplified procedure maintains the raise-statement characteristic by providing critical steps and cautionary advice to ensure accurate and reliable fiber-photometry recordings."
        ],
        "interger-type-declaration": [
            "To conduct an optogenetic assay using a copulation-triggered photostimulation system, first prepare GtACR1-expressing male flies by setting up crosses between 4-5 piezo-GAL4 males and UAS-GtACR1 virgin females in fly media vials, transferring F0 flies to fresh vials every 5 days to collect F1 males with the desired genotype. Before the experiment, feed male flies of the experimental group with food containing all-trans-retinal (ATR) by adding 2 µL of ATR (25 mg/mL dissolved in 99.5% ethanol) on the food surface, while control males are fed food with 2 µL of 99.5% ethanol. Transfer males to these prepared tubes 24-36 hours before the experiment and keep them in the dark to ensure they are ready for the optogenetic assay. Perform the assay by placing a fixed female at the center of a courtship chamber and introducing a GtACR1-expressing male without anesthesia, then cover them with a glass slide. The green laser, adjusted to target the male genitalia during copulation, activates upon detecting a copulation event after a predetermined delay of 5 minutes to suppress male neuron activity, with the session being recorded using a custom Bonsai script that operates cameras. Calibration LEDs help align movie timestamps. This streamlined process encapsulates the preparation, feeding, and execution phases of the optogenetic assay within a single, concise paragraph, emphasizing the integer-type declarations for timing and dosage measurements without the need for segmented details."
        ],
        "floatingpoint-type-declaration": [
            "To characterize RNF43 variants using RNA-seq data, first, perform quality control on your RNA-seq reads and run Kallisto with default parameters to quantify gene expression, creating an output directory for each sample. Prepare input files including a signature information file to detail sample replicates and conditions, a reference file for WT to mutant comparisons, and a control file listing experiment controls. Optionally, for eVIP2 pathway analysis, provide a gene set file in .gmt format, and a .gtf file for transcript to gene count conversion. Clone the eVIP2 GitHub repository and pull the Docker image from Docker Hub to set up the eVIP2 environment. Inside the Docker container, navigate to the eVIP2 directory and execute the eVIP2 command with pathway analysis, specifying the input directory of Kallisto outputs, output directory, signature information, control group, comparison file, gene set, and .gtf file, along with the number of replicates and the use of combined p-values. This method also supports running eVIP2 with a gene expression table or a JuncBASE table as input, allowing for analysis of alternative splicing events. Floating-point type declarations are highlighted in parameters such as the minimum recommendation of 20 million reads per replicate and laser power settings in subsequent experimental setups."
        ],
        "boolean-type-declaration": [
            "To evaluate CSC triage algorithms, review clinical data and existing algorithms, define the crisis, select and devise algorithms, define clinical endpoints, and select patient cohorts. Obtain IRB approval, create a case report form, choose a secure data management system, determine data entry method, conduct pilot data acquisition, complete data acquisition, apply triage algorithms, and calculate priority scores. Test algorithm accuracy using AUROC, simulate clinical decision-making in small patient groups using a bootstrap method, format input files with patient outcomes and priority scores, run simulations, and analyze decision-making efficacy."
        ],
        "string-type-declaration": [
            "Install STNMF by downloading from GitHub (https://github.com/jiankliu/STNMF-SNN) and adding to MATLAB path. Preprocess data by generating effective spike-triggered stimulus images from stimulus array and spike trains, using Singular Value Decomposition for spatial and temporal filters, and forming an N×P matrix STE. Decompose STE with STNMF to obtain weight matrix W and module matrix M, preset subunits number, reshape M for stimulus frame size. Analyze M and W to infer subunits' temporal filter, nonlinearity, and synaptic connection weights by calculating spatial filter and temporal filter convolution, creating generator signal, and visualizing nonlinearity. Obtain synaptic connection weights and spike trains by averaging W matrix columns, determining ON-OFF attribute, and classifying spikes into corresponding modules."
        ],
        "vector-type-declaration": [
            "Load inputs into R for HybridFinder analysis by setting the path to your data folder and importing de novo sequencing and database search results. Create an object for the proteome file path. Use the RHybridFinder package to access demonstration datasets, including de novo sequencing and database search results from the HLA Ligand Atlas. Run HybridFinder to analyze peptide sequences against a proteome database, enabling parallel computing for faster processing. The results, including hybrid peptides and their splice types, are stored in an object and can be exported. Perform a database search in PEAKS using the hybrid proteome. Load and prepare inputs for checknetMHCpan analysis, including specifying HLA-I alleles for binding affinity predictions. Run checknetMHCpan to categorize hybrid peptides and compute peptide-MHC class I binding predictions, exporting the results. This process integrates data preparation, hybrid peptide analysis, and MHC I binding prediction into a comprehensive workflow for studying hybrid peptides."
        ],
        "set-type-declaration": [
            "Access PAD2 for TF colocalization analysis by selecting signal files from the database for targeted analysis within specific genomic regions identified by ChromHMM. Open PAD2 website, navigate to select signals, and choose TFs or histone marks of interest. Optionally, upload personal signal files for analysis. After selection, specify the genomic region of interest for colocalization assessment through Pearson’s correlation of ChIP-seq profiles. Investigate signal correlation within these regions by viewing and downloading heatmap and ranked correlation plots. This streamlined approach involves selecting signal files, determining genomic regions for analysis, and utilizing correlation data to understand protein colocalization, all performed through the PAD2 platform."
        ],
        "temporal-type-declaration": [
            "Perform an optogenetic assay using a copulation-triggered photostimulation system over several days. Start by preparing GtACR1-expressing male flies, mating them with wild-type females, and setting up crosses in vials. Monitor and transfer flies to fresh vials every 5 days until F1 males are collected. Before the optogenetic assay, feed male flies with ATR-enriched food in dark conditions for 24-36 hours. The assay detects copulation events in real-time, activating a green laser to inhibit specific neural circuits in males during copulation. Utilize a custom Bonsai script to record the assay, ensuring the camera and lasers are correctly calibrated to capture the event. Critical steps include maintaining flies in darkness during ATR feeding and ensuring proper calibration for accurate temporal data capture during the experiment."
        ],
        "reg-type-declaration": [
            "Visualize protein-DNA binding states using Snakemake from raw sequencing data in a single command, accommodating both individual and co-binding site analyses. Start by trimming adapters and aligning sequencing data to the reference genome, focusing on CpG and GpC dinucleotides to refine methylation calls. Extract aligned reads to form DNA molecules for binding state mapping. Define footprints where unmethylated cytosines are flanked by methylated ones, identifying naked-DNA, TF-bound, or nucleosomal DNA. Assign binding states to DNA molecules at single and paired binding sites, using bed and bedpe files for site coordinates. Run the pipeline with Snakemake, generating plots for each analysis type. Critical steps include adapter trimming, methylation context consideration, and footprint definition, with the process designed to highlight DNA-protein interactions across selected regions."
        ],
        "device-type-declaration": [
            "To perform IQR analyses using R, source convenience functions from the GitHub repository at https://github.com/LaBargeLab/IQR_test. First, install the devtools package if it's not already installed, then source the IQR functions using source_url from the specified GitHub link. Prepare your input data in a long format with columns for gene name, sample name, expression value, and grouping variable, with any expression units acceptable. An example dataset can be downloaded from the GitHub page. Import the expression matrix using read.csv from the provided URL. Execute the stoichiometry function with this data to calculate the IQR for each sample by conditions, producing a data frame with results. Ensure the function's input includes vectors for gene symbols, expression values, condition information, sample IDs, and a character vector of interested genes. Finally, visualize the results using the stoi_plot function with the output from the stoichiometry function."
        ],
        "container-type-declaration": [
            "To induce POI-BirA* expression in Flp-In T-REx cells, seed cells in a 15 cm dish with DMEM and 10% TET-free FBS, allow to adhere overnight, treat with fresh media containing FBS, tetracycline, and biotin when 75-80% confluent. For harvesting, rinse with ice-cold PBS, scrape, collect, centrifuge at 500g, wash with PBS, and either proceed or freeze pellets. For affinity capture, lyse cells in RIPA with inhibitors, sonicate, centrifuge, wash streptavidin Sepharose® beads, incubate with lysate, rotate at 4°C for 3 hours, wash, and prepare for digestion. Digest biotinylated proteins by adding trypsin, incubate overnight at 37°C, add fresh trypsin, incubate further, then recover peptides by centrifuging beads, transferring supernatant, rinsing beads with water, acidifying with formic acid, centrifuging, and drying in SpeedVac. For MS analysis, inject samples into LC-MS/MS, using a gradient and settings appropriate for your system to ensure sensitivity without saturation, and analyze the peptides with specific focus on biotinylated proteins to study proximity interactions facilitated by BirA* biotinylation."
        ],
        "scientific-type-declaration": [
            "Download and install STNMF from GitHub, link: https://github.com/jiankliu/STNMF-SNN. Process data by generating effective spike-triggered stimulus images (STE) from neuron spike trains and stimulus array, applying Singular Value Decomposition (SVD) for spatial and temporal filters. Use STNMF on STE to infer subunits' spatial receptive field, obtaining weight matrix W and module matrix M. Analyze M and W to infer temporal filters, nonlinearity, and synaptic weights of subunits. For detailed computational analysis, apply algorithms to calculate temporal filter, nonlinearity, and classify spikes into modules based on synaptic connection weights, aiming to reveal complex neuronal network dynamics."
        ],
        "class-type": [
            "Prepare herbal raw material powder samples and extract active ingredients through ultrasonication with 80% alcohol, followed by centrifugation and evaporation of ethanol. Redissolve the concentrate in a specified eluent mixture and filter through a 0.22 µm membrane for mass spectrometry analysis. Utilize liquid chromatography quadrupole time-of-flight mass spectrometry (LC-QqTOF/MS) for detection, ensuring samples are placed in auto sampler trays at controlled temperature. Program the injection system for sequential operation, interspersing quality control samples to maintain accuracy. Post-run, set the system to standby and proceed with raw data acquisition. Analyze the mass spectrometry data using Qualitative Mass Hunter software against an in-house database to identify compounds, extracting ion chromatograms and MS/MS spectra for precise compound characterization. Confirm compound structures directly from the MS/MS library or through detailed fragment analysis."
        ],
        "parallel-for": [
            "Utilize eVIP2 for characterizing RNF43 variants by analyzing RNA-seq data through Kallisto for pathway analysis, supported by a Docker container with necessary files and scripts available on GitHub. Perform quality control, ensuring at least 20 million reads per replicate, and process RNA-seq fastq files using Kallisto to generate output directories per sample. Prepare essential input files, including signal information, reference, and control files, specifying comparisons and controls. Run eVIP2 with commands provided, analyzing data through three applications: Kallisto outputs, a gene expression table, and a JuncBASE table for alternative splicing events. This parallel-for approach enables comprehensive analysis across multiple data inputs, leveraging the efficiency of eVIP2 for detailed variant impact assessment on gene expression and splicing profiles."
        ],
        "event-statement": [
            "To format phosphoproteomic data for CausalPath analysis, first ensure the data is in the required format, potentially using R for reformatting. Adjust parameters in parameters.txt to match your analysis needs, including specifying input files and analysis options. Execute the CausalPath algorithm via command line with the necessary files in the same directory, producing results in various formats for detailed network analysis. Visualization of the phosphoproteomic network can be done through the CausalPath website or alternative tools like Newt or ChiBE, providing insights into causal relationships and network dynamics. This process involves critical steps such as data preparation, parameter adjustment, algorithm execution, and result visualization, each contributing to the comprehensive analysis of phosphoproteomic data."
        ],
        "response-statement": [
            "To perform colocalization analysis using PAD2, initially select transcription factors (TFs) and histone marks from PAD2's database for analysis within specific genomic regions. Access PAD2 online, select signals of interest, and if desired, upload your own signal files. Specify a functional genomic region for analysis and submit your choices. Investigate signal colocalization through generated heatmaps, assessing Pearson's correlation among chosen proteins within the selected genomic region. Optionally, explore ranked correlations of proteins to a specific anchor protein. Throughout the process, you can refine your analysis by selecting different genomic regions or signal sets and downloading heatmap or ranked correlation plots for further examination. This streamlined approach allows for focused analysis of protein-DNA interactions in designated genomic contexts, leveraging PAD2's computational tools for detailed genomic studies."
        ]
    }
}