{
  "id": 2667,
  "origin_website": "Cell",
  "title": "TARGET-Seq: A Protocol for High-Sensitivity Single-Cell Mutational Analysis and Parallel RNA Sequencing",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nSample Preparation and Single Cell Sorting\nTiming: 5–8 h\nThis step describes the procedures for sample processing, lysis buffer preparation and sorting of single cells into plates.\nThe protocol below specifies the conditions used for single-cell sorting of hematopoietic stem and progenitor cells (HSPCs) from human bone marrow or peripheral blood.\nNote: Different tissues and cell types might require variations of this protocol that should be optimized in advance by the user. Lysis buffer preparation steps are the same for different tissues.\nNote: The day before the sort, prepare media required for sample thawing, staining and sorting (FACS Media, Thaw Media), as well as any antibodies required for sample staining. Do not add the DNase I to the FACS Media and Thaw Media until the day of the sort.\nCritical: Make sure you have prediluted all reagents required for lysis buffer preparation to the correct concentration: barcoded oligodT primers, 0.43% Triton X-100 and ERCC (E4 or E5 dilution).\nNote: The amount of ERCC added to the lysis buffer varies depending on the total mRNA content of each cell type as outlined below. Cell lines usually have mRNA contents ranging from 2 to 8 pg, and therefore we recommend using a 1:8,000,000 dilution ERCC in 2 μL of RT buffer for cell lines (or 0.1 μL from a 1:400,000 E5 stock for cell lines such as K562, Jurkat, NALM6, SET2, or HL60). Primary hematopoietic stem and progenitor cells have less than 0.5 pg of mRNA per cell. Therefore, we use a 1:40,000,000 ERCC dilution in 2 μL of lysis buffer, or 0.02 μL per cell from a 1:400,000 E5 stock. ERCC stocks and aliquots should be stored at −80°C.\ntable:files/protocols_protocol_216_5.csv\nSample Preparation\nTiming: 2 h",
    "Note: Points 1–3 detail the procedures to follow when using cryopreserved peripheral blood or bone marrow samples. If you are using fresh samples, proceed to point 4. If using other tissues, please refer to relevant literature on how to dissociate each tissue to generate good-quality single cell suspensions (Slyper et al., 2020[href=https://www.wicell.org#bib8]).\nTurn on water bath (set at 37°C) and a centrifuge (4°C). Prepare a box of ice and another one of dry ice. Prepare a laminar flow cabinet for sterile work as well as P20, P200, and P1000 filtered tips.\nPrepare FACS Buffer and Thaw Media (See Materials and Equipment[href=https://www.wicell.org#materials-and-equipment]). If they have been prepared in advance, add DNaseI to them.\nTransfer samples from liquid nitrogen storage in dry ice and thaw each sample in the water bath at 37°C.\nNote: thaw 2–3 samples at a time to avoid keeping the samples in freezing media for too long (freezing media will usually contain DMSO, which is toxic to the cells).\nAdd 1 mL of FCS to each sample dropwise using a P1000 and gently transfer it to a 15 mL Falcon tube. Wash the vial with 1 mL of Thaw Media and add 7 mL of Thaw Media to the 15 mL Falcon Tube.\nCentrifuge at 350 × g for 10 min. Remove the supernatant, gently resuspend in 5 mL of FACS Buffer and count the cells using an hematocytometer.\nCentrifuge at 350 × g for 10 min. Remove supernatant and resuspend in 105 μL of FACS Buffer (for samples containing less than 25 million cells) or 210 μL (for samples containing more than 25 million cells). At this point, transfer the samples to 1.5 mL microfuge tubes.",
    "Note: One of the samples should be used for single staining and FMO (Fluorescence Minus One) controls, which should be run in every experiment. To prepare single staining and FMO controls, use at least 300,000 cells per condition.\nAdd Human Fc-block (1:200; BD, Cat# 564220) and incubate for 5 min at 4°C.\nAdd antibodies to each sample as well as to single staining and FMO controls, and incubate for 30 min at 4°C. You can find examples of antibody staining to isolate hematopoietic stem and progenitor cells in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_216_6.csv\nWash samples with 1 mL of FACS Buffer and spin down at 400 × g during 5 min.\nAdd viability dye (except in the FMO corresponding to such viability dye) and run single staining controls and FMO controls on a cell sorter.\nUse the single staining and FMO controls to set the right voltages for each fluorochrome and sorting gates. Perform an enrichment sort of your target population and check sorting purity. Purity should be >95% for optimal results.\nLysis Buffer Preparation\nTiming: 1 h\nLysis buffer plates containing barcoded oligodT primers should be prepared on the same day in which single cell sorting will be performed. To reduce risk of cross-contamination and inconsistencies, this step has been automated on a MANTIS Liquid Handling Platform (FORMULATRIX) and a VIAFLO 96/384 (INTEGRA Biosciences). However, users may opt to adapt this part of the protocol for other liquid handling platforms such as Mosquito HTS (TTP Labtech).",
    "First, prepare a 384 well plate containing lysis buffer mix as outlined in the table below. You should prepare enough lysis for the number of cells desired + 13.5% dead volume. For example, to prepare enough lysis buffer for 3,840 cells (10 times 384-well plates), aliquot 17 μL of lysis buffer mix in each well of a 384 well plate (1.5 μL ∗ 3,840 cells = 5,760 μL + 777.6 μL dead volume; 6,537.6 μL divided 384 wells ≈ 17 μL per well).\ntable:files/protocols_protocol_216_7.csv\nOnce the required amount of lysis buffer has been prepared in microfuge tubes (split in as many tubes as necessary), switch on the MANTIS liquid handling platform. Open the MANTIS software, open the program file “MethodS1.txt” (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). This program will dispense 17 μL of lysis per well into 384 wells of a 384 well plate. This step requires a high volume (HV) chip (FORMULATRIX, Cat# MCHVSMR6), which should be exclusively used for the lysis step.\nThen, initialize the MANTIS. Clean the chip holder and plastic surfaces with 70% ethanol. Then, prime the chip by placing it into the chip holder and inserting a 1 mL non-filter tip (Biosphere Quality Tips 100 Cat #70.762.200; Figure 6[href=https://www.wicell.org#fig6]A and Methods Video S1[href=https://www.wicell.org#mmc5]) containing 500 μL of nuclease-free water. Select the reagent name (“lysis buffer”) from the drop down menu, ensure that the correct chip volume next to reagent input is selected (“HV”) and click in the appropriate chip position number (Figure 6[href=https://www.wicell.org#fig6]B). Hold the icon “Manually Priming Input on MANTIS Arms” (Figure 6[href=https://www.wicell.org#fig6]C) until the water has gone through the chip. Finally, click the chip position number again to return the chip holder to its position.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig6.jpg\nFigure 6. Usage of MANTIS Liquid Handling Platform for Lysis Buffer Aliquoting",
    "(A) Insert a 1 mL non-filter tip into the high volume chip in the chip holder.\n(B) Icon to click to move the chip position number on the software to the MANTIS arms.\n(C) Icon to click to manually prime the chip.\n(D) Green icon to start the program for dispensing.\nPlace a 384-well cold rack (Cool Rack XT PCR 384, Biocision, Cat# BCS-538) onto the MANTIS holder and place a PCR-clean 384 well plate (FrameStar 384 Well Skirted PCR Plate, 4titude, Cat# 4ti-0384/C) into the cold rack (Methods Video S2[href=https://www.wicell.org#mmc6]). Then, dispense the lysis buffer into a new 1 mL non-filter tip (Biosphere Quality Tips 100 Cat #70.762.200) and insert into the lysis HV chip. Click the green icon (Figure 6[href=https://www.wicell.org#fig6]D) to start dispensing.\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. MANTIS Initialization Procedure (Point 14 of the Protocol), Related to Step 1.2 Point 14\nOnce dispensing is complete, cover the 384-well plate with a PCR film and spin down briefly at 1,000 × g during 15 s. Click “Recover All Inputs” (Figure 7[href=https://www.wicell.org#fig7]A) and replace the non-filter tip used for lysis dispensing with an empty tip for washing. Click “Wash All Available Inputs” (Figure 7[href=https://www.wicell.org#fig7]B) to proceed with a 2-step wash, in which the chip will be flushed with ethanol and water. Place the chip away in a clean RNA/DNA-free 50 mL Falcon tube (Corning, Cat#10291433) and switch off the MANTIS liquid handling platform.\n    Your browser does not support HTML5 video.\n  \nMethods Video S2. 384-Well Dispensing of Lysis Buffer Using a MANTIS Liquid Handling Platform (Point 15 of the Protocol), Related to Step 1.2 Point 15\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig7.jpg\nFigure 7. Cleaning Chips in the MANTIS Liquid Handling Platform\n(A) Icon to click to recover remaining liquid in chip.",
    "(B) Icon to click to wash the chip with ethanol followed by nuclease-free water.\nNext, aliquot each barcoded oligodT-ISPCR primer (prediluted to 10 μM; Table S1[href=https://www.wicell.org#mmc2]) into each well of the 384 well plate containing lysis buffer mix from points 12–16. The barcodes in Table S1[href=https://www.wicell.org#mmc2] (n=384) provide increased multiplexing capacity as compared to our previously described 96-plex strategy (Rodriguez-Meira et al., 2019[href=https://www.wicell.org#bib7]). Add the equivalent to 0.5 μL per cell in each well + 13.5% dead volume, as indicated in the table below. For example, to prepare lysis buffer mix + barcoded oligodT stock for 3,840 cells (point 12), add 5.67 μL of each barcoded oligodT-ISPCR primer per well. This step has been automated in a VIAFLO 96/384 INTEGRA electronic pipette (INTEGRA Biosciences) equipped with a 384 pipetting head. This liquid handling platform dispenses 96 or 384 liquids from a source plate into a 384 well plate (one quadrant or full plate, respectively).\ntable:files/protocols_protocol_216_8.csv\nSwitch on the VIAFLO (Figure 8[href=https://www.wicell.org#fig8], position 10) and press RUN (Figure 8[href=https://www.wicell.org#fig8], position 17) to home the instrument. Press the RUN key a second time to home the pipetting unit.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig8.jpg\nFigure 8. Numbered Description of VIAFLO 96/384 Device and Control Unit\nTo load the tips, ensure the plate holder is at the center position, place a tip box (12.5 μL GRIPTIP, Sterile, Filter, Catalog Number #6455, INTEGRA Biosciences) in the place holder (Figure 8[href=https://www.wicell.org#fig8], position 8A or 8B), hold the control unit (Figure 8[href=https://www.wicell.org#fig8], position 5) and lower the pipetting head onto the tip box until the “Tip load button” (Figure 8[href=https://www.wicell.org#fig8], position 4) flashes. The display will then prompt to push the “Tip load button” while at the same time gently push down the control unit (Figure 8[href=https://www.wicell.org#fig8], position 5).",
    "Place two 384-well cold racks (Cool Rack XT PCR 384, Biocision, Cat# BCS-538) into the plate holders (Figure 8[href=https://www.wicell.org#fig8], position 8A and 8B). Use the touch wheel (Figure 8[href=https://www.wicell.org#fig8], position 13) to scroll clockwise down the menu list and create a new program to transfer each barcode from the stock plate to a new empty 384-well plate.\nPlace a 384-well plate containing barcoded oligodT-ISPCR primer stock on the top of the cold rack in the source plate position (Figure 8[href=https://www.wicell.org#fig8], position 8A) and the 384-well lysis buffer stock plate (from points 12–17; containing c per well) onto the cold rack in the destination plate position (Figure 8[href=https://www.wicell.org#fig8], position 8B). To run the program, press the OK button.\nOnce the lysis buffer mix + barcoded oligodT stock plate is aliquoted, cover the plate with a PCR film and briefly spin down at 1,000 × g during 15 s.",
    "Next, create a new program to aliquot 2 μL of lysis buffer + barcoded oligodT mix stock plate (point 22) into individual 384-well plates using the VIAFLO 96/384 INTEGRA pipetting robot step. Ensure 384-well cold racks (Cool Rack XT PCR 384, Biocision, Cat# BCS-538) are placed into the plate holders (Figure 8[href=https://www.wicell.org#fig8], position 8A and 8B). The lysis buffer + barcoded oligodT mix stock plate should be placed into the source plate holder (Figure 8[href=https://www.wicell.org#fig8], position 8A) and an empty sterile 384-well plate should be placed into the destination plate holder (Figure 8[href=https://www.wicell.org#fig8], position 8B). Both plates should be place on the top of 384-well cold racks (Cool Rack XT PCR 384, Biocision, Cat# BCS-538). Click OK to run the program. Once dispensing is complete, remove the plate with 2 μL of lysis buffer + barcoded oligodT and replace with another empty sterile 384-well plate and click OK to run the method again (with the same tips). This step can be repeated 10 times with the same tips.\nOnce dispensing is complete, cover the 384-well target plate with a clear PCR film and spin down at 1,000 × g for 15 s. Repeat for further empty 384-well plates until desired number dispensed (the examples volumes for these steps should be sufficient stock for 10∗384-well plates). Keep these plates on ice until the sorting step.\nSingle Cell Sorting\nTiming: 2–5 h",
    "You should now prepare the sorter for single cell sorting. It is essential to choose the right purify mode and singlet gates to ensure that only one single cell is sorted per well. We recommend using a purity mode in which the 50% of the previous and next droplet to the target one are empty, and the target event is within the 75% central part of the target droplet (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig9.jpg\nFigure 9. Schematic Representation of the Sorting Purity Settings\nYou should keep the event rate low (less than 1,000 events per second) to try to maximize cell recovery.\nPerform an alignment test sort using a 384 well tissue culture plate (Corning® 384 well microplate, CLS3702-100EA) and fluorescent beads (Cat. No). Sort one fluorescent bead per well and check under the microscope that there is only one bead in each well of the 384 well plate.\nNote: This can be performed only once when setting up the sorter for single cell sorting for the first time. If previously set up, proceed to point 26.\nPerform an alignment test sort using a 384 well plate (FrameStar, 4titude, 4ti-0384/C; or the same model in which lysis buffer was aliquoted) covered with a PCR film and sort 50 droplets in the corners of the plate (position 1A, 1P, 24A, 24P). If the plate is correctly aligned (Figure 10[href=https://www.wicell.org#fig10]A), the droplets should fall perfectly in the center of those well; if not (Figure 10[href=https://www.wicell.org#fig10]B), re-calibrate the alignment accordingly. If correct, proceed to point 27.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig10.jpg\nFigure 10. Representative Examples of 384-Well Plate Sorter Alignment\n(A) Drop correctly aligned on center of the well covered with film.\n(B) Drop incorrectly aligned at the edge of the well covered with film.\n(C) Drop correctly aligned at the center of the bottom of the well.",
    "(D) Drop incorrectly aligned to the side of the well.\nTake the PCR film off the plate and sort 20 droplets in the same wells are in step 17 (positions 1A, 1P, 24A, 24P). Check that the drops are been deposited on the bottom of each well (Figure 10[href=https://www.wicell.org#fig10]C) and there is no liquid splashing on the sides of the wells (Figure 10[href=https://www.wicell.org#fig10]D). If correct, alignment checks are complete. Clean the surfaces around the sorter with RNase away (Thermofisher, Cat# 10328-011).\nProceed to single cell sorting of your target populations in plates containing lysis buffer and barcoded oligodT-ISPCR from point 24. Lysis and protease digestion will occur immediately once each cell is sorted into each well. Sort the cells at room temperature (to increase lysis efficiency) for a maximum of 20 min; if your target population if very rare and filling up a plate would take longer than 20 min, you should enrich your target population before sorting into plates to avoid RNA degradation. To obtain cell-surface proteomics data from each single cell, you should record the fluorescence intensity of each cell-surface marker using the “record index sorting” option available in most FACS instruments.\nOnce finished, cover the plates with an aluminum sealing film (StarLab, Cat# E2796-0792), spin down the plate at 1,000 × g for 15 s and snap freeze the plates in dry ice.\nPause Point: Store in −80°C for up to 3 months.\nNote: processing plates after 3 months of −80°C storage is associated with higher rates of RNA degradation.\nCritical: When freezing plates, it is essential that you use Aluminum Sealing Films (StarLab, Cat# E2796-0792), as plastic films are likely to come off in −80°C freezers.\nHeat Inactivation, Retrotranscription, and PCR\nTiming: 6.5 h; 75 min hands-on time",
    "This step describes the procedures for retrotranscription and PCR amplification of cDNAs and targeted amplicons from single cells.\nThis is the most critical step of the method, where most users usually experience difficulties. mRNA degradation can occur easily when handling plates, so you should be extremely careful to keep sterile and PCR-free conditions when performing all of the steps outlined below.\nCritical: This step should be performed within 3 months from the start of STEP1.3 (single cell sorting).\nCritical: Make sure you have all reagents required for retrotranscription and PCR steps, including pre-made TSO-LNA single-use aliquots and any mRNA, cDNA, and gDNA primers required. It is recommended that you prepare mRNA, cDNA, and gDNA primers mixtures to be used for each patient in advance.\nNote: Sorted plates from step 1.3 must be stored at −80°C and kept in dry ice until heat inactivation step. Once the retrotranscription is finished, it is essential that you proceed immediately to PCR.\nNote: You should perform heat inactivation, retrotranscription and addition of PCR master mix in a dedicated PCR-free area or clean room, under a laminar flow cabinet free of any amplified material. Once the PCR master mix has been added, the PCR should be performed in a post-PCR area, where all of the steps involving amplified material will be carried out. It is also essential that you use different sets of pipettes for each workspace, to avoid contamination.\nHeat Inactivation and Retrotranscription\nTiming: 3 h; 30 min hands-on time\nTake the sorted plate(s) (point 29) from −80°C storage and keep on dry ice until the start of heat inactivation step.\nThaw the 5X Buffer (Clontech, Cat#639537), RNase-free PCR Grade Water (Life Technologies, Cat#AM9935) and any mRNA primers that you might add to the reaction. These can be thawed at room temperature.",
    "The retrotranscription (RT) step has been automated on the MANTIS Liquid Handling Platform (FORMULATRIX). Initialize the MANTIS as indicated in point 14; cool down a CoolRack® XT PCR384 (Biocision, Cat# BCS-538) to 4°C and clean with RNase away (Thermofisher, Cat# 10328-011).\nAliquot the buffer 5X, water and any mRNA primers added to the mix into an RNase-free microfuge tube (Invitrogen, Cat# AM12400) to prepare a master mix for the RT step as indicated in the table below. RNase inhibitor, TSO-LNA, and SMARTScribe enzyme will be added to the mix during heat inactivation step. You should always prepare 15% extra RT mix to account for dead volumes.\ntable:files/protocols_protocol_216_9.csv\nPerform heat inactivation of the protease by incubating the plate for 15 min at 72°C in a thermocycler. This step will inactivate the protease within the lysis buffer, so that it does not interfere with any subsequent enzymatic steps.\nDuring the heat inactivation step, add the RNase inhibitor, TSO-LNA, and finally, the retrotranscriptase (SMARTScribe) to the retrotranscription mix in that order:\ntable:files/protocols_protocol_216_10.csv\nNote: Make sure you have finished adding all components to the retrotranscription mix by the time the heat inactivation is finished. It is essential that once heat inactivation is complete, the retrotranscription mix is immediately added to the plate. Otherwise, you might see signs of mRNA degradation.\nCritical: The following step must be performed immediately after the heat inactivation is finished.",
    "Spin down the plate at 1,000 × g for 15 s, place it on a cold rack (Cool Rack XT PCR 384, Biocision, Cat# BCS-538) and add 3 μL of the retrotranscription mix per well using a MANTIS Liquid Handling Platform or an alternative automated liquid handler such as Mosquito HTS (TTP Labtech). If using a MANTIS, click the Load Dispense list button and open the program file “MethodS2.txt” (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). This step requires a HV chip (FORMULATRIX, catalog # MCHVSMR6), which should be exclusively used for the RT step. Place the HV chip into the chip holder, insert a 1 mL tip (Biosphere Quality Tips 100 Cat #70.762.200) and dispense the RT master mix into the 1 mL tip. Place the plate and cold rack on the MANTIS holder. Click the green “Run Dispense” button (Figure 6[href=https://www.wicell.org#fig6]D) to start the “MethodS2.txt” program (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]).\nOnce the program has finished dispensing the RT mix, carefully seal the plate with 2 PCR films (MicroAMp Clear Adhesive Film, Thermo Fisher Scientific, Cat# 4306311), spin down the plate at 1,000 × g during 15 s, immediately place in the thermocycler and run the RT program:\ntable:files/protocols_protocol_216_11.csv\nNote: We recommend using two films during this step to facilitate PCR film removal after incubation in the thermocycler, which has proven to be difficult using only one PCR film and is essential to avoid sample cross-contamination.\nFinally, follow the wash and shut down procedure of the MANTIS outlined in point 16. The RT chip should be placed in a RNA/DNA-free 50 mL Falcon dedicated for the RT chip only.",
    "Note: This is the step where most likely mRNA degradation will occur. Therefore, make sure you are extremely careful in keeping sterile conditions while pipetting reagents and handling plates. After heat inactivation is finished, the plate should be kept at 4°C in a cold rack until the retrotranscription master mix is added and it is placed in the thermocycler. This step should take no longer than 5–6 min; otherwise mRNA degradation will occur!\nPCR\nTiming: 3 h; 30 min hands-on time\nThis step has been automated on a MANTIS Liquid Handling Platform (FORMULATRIX), but can be adapted to other liquid handling platforms.\n15–20 min before the retrotranscription program has finished, start thawing the reagents required for the PCR step. PCR Grade Water (Cat# AM9935) and primer mixes can be thawed at room temperature; the rest of the reagents must be thawed on a cold rack or ice.\nOpen the MANTIS software and open the program file “MethodS3.txt” (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). This step requires a high volume (HV) chip (FORMULATRIX, Cat# MCHVSMR6), which should be exclusively used for the PCR step. Initialize the MANTIS as per point 14 using a HV chip dedicated for PCR only; cool down a CoolRack® XT PCR384 (Biocision, Cat# BCS-538) to 4°C and clean with RNase away (Thermofisher, Cat# 10328-011).\nPrepare the PCR master mix in a RNase free microfuge tube as indicated in the table below. Add the reagents in the following order: first water, then primers, and lastly, PCR enzyme. Wait until the retrotranscription step has finished to add the PCR enzyme. Prepare 10% additional PCR master mix to account for dead volumes.\ntable:files/protocols_protocol_216_12.csv",
    "Place the high volume chip into the chip holder, then insert a 1 mL tip (Biosphere Quality Tips 100 Cat #70.762.200) and aliquot the PCR master mix into it. Add a maximum volume of 1.5 mL into the tip; if dispensing larger volumes, stop the program by pressing “Pause,” add extra PCR master mix into the 1 mL tip and continue the program by pressing “Run” .\nPlace a CoolRack® XT PCR384 cold block at 4°C on the MANTIS holder, place the 384 well plate from point 37 on the top of the holder, prime the MANTIS PCR chip and start the “TARGET-seq 384-well PCR step” program.\nOnce dispensing is finished, carefully seal the plate with two MicroAMp Clear Adhesive Films (Thermo Fisher Scientific, Cat# 4306311), spin down the plate at 1,000 × g for 15 s, place the plate on ice and transfer to a dedicated post-PCR area. Then, place the plate on a thermocycler and run the PCR program:\ntable:files/protocols_protocol_216_13.csv\nNote: We recommend using two films during this step to facilitate PCR film removal after incubation in the thermocycler, which has proven to be difficult using only one PCR film and is essential to avoid sample cross-contamination.\nFinally, follow the wash and shut down procedure of the MANTIS outlined in step 16. The PCR chip should be placed in a RNA/DNA-free 50 mL Falcon dedicated for the PCR chip only.\nPause Point: When the PCR finishes, spin down the plate at 1,000 × g for 30 s at room temperature and snap freeze in dry ice. Once the liquid is completely frozen, transfer the plate to −20°C storage for up to 6 months.\nPooling, cDNA+Amplicon Mix Dilution\nTiming: 30 min; 15 min hands-on time",
    "During this step, the cDNA+amplicon mix will be first diluted 1:1 with water, to use as input material in the subsequent single-cell genotyping preparation step, and at the same time, pooled for subsequent bead purification and whole transcriptome library preparation (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig11.jpg\nFigure 11. Schematic Representation of the Pooling, cDNA+Amplicon Mix Dilution and Bead Clean-Up Steps\nThis step has been automated in a Biomek FxP Liquid Handling Platform (Beckman Coulter), and the procedures below detail the steps to follow when using this platform (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). However, users might adapt this part of protocol to other liquid handling platforms such as INTEGRA VIAFLO or Mosquito HTS (TTP Labtech).\nBefore you start, initialize the Biomek FxP Liquid Handling Platform.\nThaw the PCR plate containing the cDNA+amplicon mix and spin it down at 3,000 × g during 1 min at room temperature. When removing the PCR cover, make sure there are no droplets in the PCR film; this might give rise to cross-contamination in between wells.\nPrepare all the material needed to perform this step:\ntable:files/protocols_protocol_216_14.csv\nOpen the program “MethodS4.bmf” (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). Click Instrument Setup to visualize the method layout and put all required components (plates, tip boxes…) in the right position on the deck (Figure 12[href=https://www.wicell.org#fig12]). The method can be used with half or entire 384-well plates.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig12.jpg\nFigure 12. Schematic Representation of Beckman FxP Deck Layout for Program 01-Dilution-and-Pooling, Using an Entire 384 Well cDNA+Amplicon Mix Plate",
    "Click Run, introduce the variable volumes as outlined in the table below (which will be prompted into the screen), and click OK. The program will aliquot 6.25 μL of water and 6.25 μL of cDNA+amplicon mix for each quadrant into a new genotyping_stock plate, which is a 1:1 dilution of the initial cDNA+amplicon mix. This Genotyping_stock plate will be used as the input material for single-cell genotyping PCR1 (step 3). After this, it will pool 1.3 μL from each well of the cDNA+amplicon mix plate into each column of a 96-well plates, which can be subsequently pooled manually in an Eppendorf tube for bead clean-up.\ntable:files/protocols_protocol_216_15.csv\nPause Point: You might now proceed with bead clean-up of the pooled cDNA+amplicon mix libraries or freeze them and perform bead clean-up later (step 4). You can also store the Genotyping_stock plates until you are ready to proceed with genotyping-PCR1 (step 3).\nCritical: The Biomek FxP Liquid Handling Platform has been calibrated to be used with the plasticware specified in this protocol. Any changes to the plasticware might result in suboptimal performance of the method or parts of the robot crashing due to different labware dimensions.\nCritical: When freezing plates, it is essential that you use Aluminum Sealing Films (StarLab, Cat# E2796-0792), as plastic films are likely to come off in −20°C freezers. Moreover, it is essential that you spin down and snap freeze the plates in dry ice prior to −20°C freezer storage: this will avoid any liquid freezing in the sides of the wells or cover, which might give rise to cross-contamination in between wells.\nStep 3: Single-Cell Genotyping Library Preparation\nTiming: 5 h; 2.5 h hands-on time\nThis step describes the procedures for single cell genotyping targeted library preparation and sequencing.",
    "During single-cell genotyping library preparation step, two PCR steps will be performed for each single cell to generate Illumina-compatible libraries ready for sequencing (Figure 13[href=https://www.wicell.org#fig13]). During the first PCR step (genotyping-PCR1), target-specific primers containing CS1 (forward primer) or CS2 (reverse primer) adaptor sequences will amplify specific gDNA and cDNA targets, which have been pre-amplified in the previous RT and PCR step (step 2). At the same time, plate-specific barcode sequences (identifying a set of 96 cells originating from the same plate) will be added (Figure 13[href=https://www.wicell.org#fig13]). This will increase the multiplexing capacity of the targeted sequencing strategy (Figure 13[href=https://www.wicell.org#fig13]). Examples on how to design target-specific primers and barcodes for genotyping PCR1 are provided in Table S2[href=https://www.wicell.org#mmc3]. This is an improved higher-multiplexing barcoding strategy as compared to our previously described method (Rodriguez-Meira et al., 2019[href=https://www.wicell.org#bib7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig13.jpg\nFigure 13. Schematic Representation of the Targeted Library Preparation Strategy for Single Cell Genotyping\nDuring the subsequent PCR step (genotyping-PCR2), Illumina-compatible adaptors containing a cell-specific barcode are attached to the genotyping-PCR1 products through the CS1 and CS2 adaptor regions. After that, Illumina-compatible libraries are purified using Ampure XP beads and quantified for sequencing (Figure 13[href=https://www.wicell.org#fig13]).\nThe steps to perform single-cell genotyping library preparation described here have been automated in a Biomek FxP Liquid Handling Platform (Beckman Coulter). However, users might adapt this protocol to other liquid handling platforms compatible with the method such as Mosquito HTS (TTP Labtech) or VIAFLO (INTEGRA Biosciences).\nGenotyping PCR1\nTiming: 1.5 h; 30 min hands-on time",
    "Genotyping-PCR1 is performed individually per each quadrant of a 384-well plate, and up to four different PCR1 reactions are performed per single cell, each reaction containing different primer mixes. The reason behind this is the different amount of input molecules for different gDNA and cDNA amplicons (for example, highly expressed genes will be easily amplified during genotyping PCR1, but lowly expressed ones will be more difficult to amplify). Moreover, different amplification efficiencies of your PCR1 primers will also result in disparate amplification of target regions. Thirdly, some primers targeting gDNA and cDNA from the same target region may not be compatible with parallel amplification in the same reaction. Therefore, compatibility and amplification efficiencies of primers should be established beforehand (see “Optimization and pilot experiments”). Once this has been determined, proceed with Genotyping-PCR1.\nNote: The protocol outlined below includes the use of four genotyping PCR1 master mixes per cell, which will be dispensed in the four different quadrants of a 384-well plate (Figure 14[href=https://www.wicell.org#fig14]); however, the number of mixes required might be reduced depending on the number of targets amplified. Usually, no more than 4 master mixes per cell are required.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig14.jpg\nFigure 14. Schematic Representation of Genotyping PCR1 Program\nThaw the 384-well plate containing the diluted cDNA+amplicon from “Step 2.3: cDNA+amplicon mix dilution” (genotyping_stock plate). Spin down at 3,000 × g during 1 min at room temperature.\nCritical: Make sure the centrifuge is set at room temperature when spinning down the plate; spinning the plate at 4°C will cause condensation on the PCR film covering the plate and as a consequence, potentially cross-contamination in between wells. When removing the PCR cover, make sure there are no droplets on it, as this might also give rise to cross-contamination.",
    "Thaw any target-specific genotyping-PCR1 primers to be used in this step and KAPA 2G Ready Mix Enzyme (Roche, Cat# KK5702). Primers might be thawed at room temperature; KAPA enzyme should be thawed and kept on ice or a cold rack at all times.\nPrepare master mixes containing each primer combination and KAPA 2G enzyme as indicated in the table below. Up to 4 different master mixes might be used per plate.\ntable:files/protocols_protocol_216_16.csv\nAliquot each master mix in a column of a 96-well skirted PCR plate (FrameStar, 4titude, Cat# 4ti-0960/C) as indicated in Figure 15[href=https://www.wicell.org#fig15].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig15.jpg\nFigure 15. Schematic Representation of Mastermix Plate Layout\nOpen the program “MethodS5.bmf” (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). Click Instrument Setup to visualize the method layout. Place the tip boxes, a clean 384-well plate, the genotyping stock plate (step 2.3) and the 96-well skirted plate containing enzyme+primer master mixes (Mastermix plate; Figure 16[href=https://www.wicell.org#fig16]). The Mastermix plate should be placed on the top of a pre-chilled cold rack.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig16.jpg\nFigure 16. Schematic Representation of Deck Layout Used for 02-Genotyping-PCR1 Program in a Biomek FxP Liquid Handling Platform\ntable:files/protocols_protocol_216_17.csv\nCritical: The Biomek FxP Liquid Handling Platform has been calibrated to be used with the plasticware specified in this protocol. Any changes to the plasticware might results in suboptimal performance of the method or parts of the robot crashing due to different labware dimensions.\nClick Run to start the program and introduce the user-defined variables:\ntable:files/protocols_protocol_216_18.csv",
    "The program will aliquot first 4.75 μL of each Mastermix in each quadrant of the empty 384-well plate (PCR1) and after that, it will aliquot 1.5 μL of prediluted cDNA+amplicon mix from the genotyping stock plate in each quadrant of the same 384-well plate. The entire program will take 10 min to prepare each plate. Once the program is finished, immediately cover the plate with a PCR film, spin it down at 1,000 × g during 15 s and run the following program on a thermocycler:\ntable:files/protocols_protocol_216_19.csv\nOptional: While the robot is aliquoting the first plate, you can start preparing the master mixes for a second plate.\nPause Point: You might now proceed with the second single-cell genotyping PCR (genotyping-PCR2) or spin down the plates, snap freeze them in dry ice and transfer to −20°C storage.\nCritical: When spinning down the plates, make sure the centrifuge is set at room temperature; if set at 4°C, the PCR product will condensate on the top of the PCR film and potentially cause contamination between wells (Remember: this PCR does not contain cell-specific barcodes yet!).\nGenotyping PCR2\nTiming: 1.5 h; 30 min hands-on time\nDuring PCR2 step, Illumina-compatible adaptors containing cell-specific barcodes will be added to the PCR1 products from the previous step (Figure 13[href=https://www.wicell.org#fig13]). Firstly, Illumina-compatible adaptors with cell-specific barcodes will be aliquoted into each well of a 384-well plate using a Biomek FxP Liquid Handling Platform. These plates can be used immediately after or stored at −20°C for several months. After that, a Mastermix containing PCR enzyme and PCR1 products will be aliquoted in the same plate.",
    "Thaw Illumina-compatible adaptors with cell-specific barcodes plates (four 96-well plates in total; Access Array™ Barcode Library for Illumina® Sequencers-384, Single Direction; Fluidigm, Cat# 100-4876) and spin them down at 3,000 × g for 1 min at room temperature.\nOpen the program “MethodS6.bmf” (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]). Click Instrument Setup to visualize the method layout (Figure 18[href=https://www.wicell.org#fig18]). Place the tip boxes (1 P50 box per plate), clean 384-well plates, and the Fluidigm Single-Direction Barcodes plates in the deck, as summarized below:\ntable:files/protocols_protocol_216_20.csv\nClick Run, introduce the values of the variables, which will be prompted on the screen, and click OK to start the program. The program will aliquot 2 μL of each barcode four times (if number_of_quadrants=4) in each 384-well plate (Dest1-4). Once finished, seal the plates with a PCR film for further storage or proceed to PCR2 genotyping.\ntable:files/protocols_protocol_216_21.csv\nPause Point:\nYou might now proceed with the second single-cell genotyping PCR (genotyping-PCR2) or spin down the plates containing cell-specific barcodes, snap freeze them in dry ice and transfer to −20°C storage.\nPrepare the genotyping-PCR2 master mix in a 5 mL or two 1.5 mL microfuge tubes as per the table below, which is enough for one 384-well plate and takes into account dead volumes of the method (15%).\ntable:files/protocols_protocol_216_22.csv\nPlace the Mastermix, prealiquoted barcode plate (from point 59) and PCR1 genotyping plate (point 56) in the deck as outlined in Figure 19[href=https://www.wicell.org#fig19] and in the table below:\ntable:files/protocols_protocol_216_23.csv\nNote: It is recommended to run several 384-well plates each time to reduce the amount of master mix needed due to dead volumes. If running the method several times, the volume of the genotyping-PCR2 Mastermix plate can be dropped to 400 reactions each time (4% dead volume), rather than 430 reactions (12% dead volume) required for the first run.",
    "Start “MethodS7.bmf” program (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]) and introduce the user-defined variables (Number of Quads: [1-4], indicating the number of quadrants to aliquot PCR1 product and PCR2 master mix into). Once finished, seal the plate with a PCR film, spin down for 15 s at 1,000 × g and incubate in a thermocycler using the parameters specified in the table below:\ntable:files/protocols_protocol_216_24.csv\nOptional: While the robot is aliquoting the first plate, you can start preparing the master mixes for a second plate. It is recommended to process several plates to reduce dead volumes in the reaction.\nPause Point: You might now proceed with pooling and bead clean-up of the Illumina-compatible single-cell genotyping libraries or freeze the plates at −20°C.\nPooling, Bead Clean-Up, and Library Quantification\nTiming: 2 h; 1.5 h hands-on time\nPool 96 libraries from each genotyping-PCR2 plate quadrant (corresponding to each different primer mix; Figures 14[href=https://www.wicell.org#fig14] and 17[href=https://www.wicell.org#fig17]), using a Biomek FxP Liquid Handling Platform. Start “MethodS8.bmf” program (https://doi.org/10.17632/k92cnf2fph.1[href=https://doi.org/10.17632/k92cnf2fph.1]), position the material on the deck (Figure 20[href=https://www.wicell.org#fig20]) and introduce the user-defined variables outlined below. This program will pool 1.5 μL of genotyping-PCR2 reaction from each quadrant. This step can also be easily automated in other liquid handling platforms such as Mosquito HTS (TTP Labtech).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig17.jpg\nFigure 17. Schematic Representation of Barcode Aliquoting and Genotyping-PCR2 Steps\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig18.jpg\nFigure 18. Schematic Representation of Deck Layout Used for 03-Barcode-Aliquoting-PCR2 Program in a Biomek FxP Liquid Handling Platform\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig19.jpg\nFigure 19. Schematic Representation of Deck Layout Used for 04-Genotyping-PCR2 Program in a Biomek FxP Liquid Handling Platform\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig20.jpg\nFigure 20. Schematic Representation of Deck Layout Used for 05-Genotyping-Pooling Program in a Biomek FxP Liquid Handling Platform\ntable:files/protocols_protocol_216_25.csv\nIntroduce the user-defined variables and run 05-genotyping-pooling program.\ntable:files/protocols_protocol_216_26.csv",
    "Pool the genotyping-PCR2 material from each column of the 96-well plate (“Pool,” Figure 20[href=https://www.wicell.org#fig20]) into a single 1.5 mL microfuge tube using a P200 tip, as outlined and proceed to bead purification.\nAliquot 40 μL of Ampure XP beads (Beckman Coulter; Cat# A63881) into a V-shaped 96 well plate (Axygen, Cat# P-96-450V-C). Add 50 μL of pooled genotyping-PCR2 product from step 49 to the beads (0.8:1 beads to cDNA ratio) and incubate for 5 min at room temperature.\nIncubate the mixture in a 96-well magnetic stand for 2 min or until the liquid is clear of beads. Remove the liquid and wash the beads twice with 100 μL 80% ethanol, trying not to disturb the bead pellet. Remove any remaining ethanol with P20 tips and let the beads air-dry for 2 min.\nResuspend the pellet in 25 μL of EB buffer and check library size distributions and specific target amplification on a microcapillary array (Figure 21[href=https://www.wicell.org#fig21]), such as Agilent Bioanalyzer (High Sensitivity DNA Kit, Agilent, Cat# 5067-4626), TapeStation (High Sensitivity D1000 ScreenTape and Reagents, Agilent, Cat# 5067-5583 and Cat# 5067-5584) or Fragment Analyzer (High Sensitivity Small Fragment Kit (1–1,500 bp), Advanced Analytical, Cat# DNF-477-0500).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig21.jpg\nFigure 21. Representative Traces of Genotyping-PCR2 Pooled Products\nNote: The library sizes would be much shorter than cDNA libraries, so the size range of the microcapillary array should be taken into account in this case.\nNote: the barcodes and adaptors add 115 extra bp to the expected amplicon size.\nQuantify the libraries using Qubit dsDNA HS Assay Kit (Invitrogen, Cat# Q32854).\nCalculate the molarity of each pool and dilute to 10 nM. Pool each amplicon mix in equimolar concentrations, quantify the final library, and dilute to 4 nM.",
    "Sequence the libraries on a MiSeq platform using custom sequencing primers CS1, CS2 (read 1 and read 2; targeted to the CS1/CS2 adaptor sequences added during PCR1) and CS1rc, CS2rc (index read) or in a NextSeq platform using custom sequencing primers LCS1 (read 1), CS2 (read 2) and CS2rc (index read).\nIf using the MiSeq sequencing platform (Illumina), use 7 μL of 50 μM CS1 and CS2 primers resuspended in 700 μL of HT1 buffer (500 nM final concentration), and 7 μL of 50 μM of CS1rc and CS2rc in a total volume of 700 μL of HT1 buffer (500 nM final concentration). If using the NextSeq platform, use 15 μL of 50 μM LCS1 primer diluted in 2,485 μL of HT1 buffer for read 1 (300 nM final concentration), 15 μL of 50 μM CS2 primer diluted in 2,485 μL of HT1 buffer for read 2 (300 nM final concentration) and 15 μL of 50 μM CS2rc primer diluted in 2,485 μL of HT1 buffer for index read (300 nM final concentration).\ntable:files/protocols_protocol_216_27.csv\nPrimer sequences can be found in the Key Resources Table[href=https://www.wicell.org#key-resources-table]. Use the following sequencing configuration: 151 cycles (read1) + 10 cycles (index read) + 151 cycles (read2).\nNote: CS1/CS2 and CS1rc/CS2rc sequencing primers contain LNA modifications as compared to CS1/CS2 tags used for PCR1 target-specific primers. Primers should be aliquoted and stored in single-use aliquots. Primer stocks should be stored at −80°C.\nWhole Transcriptome Library Preparation\nTiming: 3.5 h; 2.5 h hands-on time\nThis step describes the procedures for whole transcriptome library preparation from pooled cDNA material using a tagmentation-based approach specifically tailored to TARGET-seq libraries (Rodriguez-Meira et al., 2019[href=https://www.wicell.org#bib7])",
    "Whole transcriptome library preparation consists of three steps: first, the pooled cDNA libraries from step 2.3 are bead-purified; secondly, the libraries are tagmented using a commercial Tn5 enzyme (Illumina). Thirdly, the tagmented libraries will be amplified and indexed using a custom P5 primer binding to the ISPCR and 3′-handle adaptor sequence (introduced during the RT and PCR steps, which will allow specific amplification of the 3′-ends), as well as a P7 primer containing a sample-specific index. In this way, only the tagmented fragments corresponding to the 3′-end of each cDNA molecule will be amplified. Lastly, tagmented and amplified libraries are purified using Ampure XP beads, quantified and sequenced.\nCritical: Pre-warm an aliquot of Ampure XP beads (Beckman Coulter; Cat# A63881) at room temperature for 30 min.\nPool the cDNA material from the 96-well plate (step 2.3, point 49) into a single 1.5 mL microfuge tube using a P200 tip and proceed to cDNA purification.\nAliquot 66 μL of Ampure XP beads (Beckman Coulter; Cat# A63881) into a V-shaped 96 well plate (Axygen, Cat# P-96-450V-C). Add 110 μL of pooled cDNA+amplicon mix from step 2.3 to the beads (0.6:1 beads to cDNA ratio) and incubate for 5 min at room temperature.\nIncubate the mixture in a 96-well magnetic stand for 2 min or until the liquid is clear of beads. Remove the liquid and wash the beads twice with 100 μL 80% ethanol, trying not to disturb the bead pellet. Remove any remaining ethanol with P20 tips and let the beads air-dry for 2 min.",
    "Resuspend the beads in 110 μL of EB buffer (Qiagen Cat# 19086) and repeat the bead purification step. Add 66 μL of Ampure XP beads to the 110 μL of pre-purified cDNA mix, incubate 5 min at room temperature, then incubate the mixture for 2 min in the 96-well magnetic stand. Once clear of beads, remove the liquid and what twice with 100 μL 80% ethanol, trying not to disrupt the beads. Remove any remaining ethanol using P20 tips.\nResuspend the pellet in 25 μL of EB buffer and check cDNA traces on a microcapillary array, such as Agilent Bioanalyzer (High Sensitivity DNA Kit, Agilent, Cat# 5067-4626), TapeStation (High Sensitivity D5000 ScreenTape and Reagents, Agilent, Cat# 5067-5592 and Cat# 5067-5593) or Fragment Analyzer (High Sensitivity NGS Fragment Analysis Kit (1–6,000 bp), Advanced Analytical, Cat# DNF-474-1000). An example of good-quality libraries can be found in Figure 3[href=https://www.wicell.org#fig3].\nQuantify the libraries using Qubit dsDNA HS Assay Kit (Invitrogen, Cat# Q32854).\nPrepare one PCR tube (StarLab; Cat# I1402-2908) per each pool of libraries from point 71 and add 10 μL of Tagmentation Buffer (Nextera XT Kit, Illumina, Cat# FC-131-1096) into each tube.\nAdd 1 ng of purified cDNA from each pool from point 71, up to a total volume of 5 μL, and add 5 μL of Amplicon Tagmentation Mix (Nextera XT Kit) on ice as per the table below.\nNote: keep the Amplicon Tagment Mix on ice at all times.\ntable:files/protocols_protocol_216_28.csv\nBriefly vortex the mix, spin down and incubate at 55°C for 6 min.\nImmediately after, add 5 μLof Neutralization Buffer (Nextera XT Kit, Illumina); pipet up and down to mix the liquid.",
    "Prepare PCR master mix as per the table below. i7 index primers can be obtained commercially (Illumina) or as custom HPLC purified oligonucleotides (Table S3[href=https://www.wicell.org#mmc4]). P5_index is a custom primer binding to the ISPCR and 3′-handle sequence (Table S3[href=https://www.wicell.org#mmc4]) as outlined in Figure 22[href=https://www.wicell.org#fig22].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig22.jpg\nFigure 22. Schematic Representation of the Tagmentation-Based Library Preparation Strategy for 3′-Biased Whole Transcriptome Sequencing\ntable:files/protocols_protocol_216_29.csv\nIncubate in a thermocycler with the following program:\ntable:files/protocols_protocol_216_30.csv\nPurify the tagmented and amplified libraries using Ampure XP beads. Add 35 μL of beads to 50 μL (0,7:1 beads to cDNA ratio) of tagmented library in a V-shaped 96 well plate (Cat. No. P-96-450V-C, Axygen) and incubate for 5 min at room temperature.\nIncubate in a 96-well magnetic stand for 2 min or until the liquid is clear of beads. Remove the liquid and wash twice with 100 μL of 80% ethanol. Remove any remaining ethanol with a P20 tip and resuspend in 35 μL of EB buffer.\nRepeat this step by adding 24.5 μL of beads to the 35 μL of tagmented library and incubate for 5 min at room temperature. Remove the liquid, wash twice with ethanol, and air-dry the pellet for at least 5 min. Resuspend in 20 μL of EB buffer.\nCritical: It is essential that the beads are clear of ethanol at this point before resuspending in EB buffer; these libraries are now ready to sequence and any remaining traces of ethanol might affect sequencer performance.\nPause Point: You might now proceed with quantification and sequencing or store the bead-purified tagmented and indexed libraries at −20°C.",
    "Check tagmented library size distributions (Figure 23[href=https://www.wicell.org#fig23]) on a microcapillary array such as Agilent Bioanalyzer (High Sensitivity DNA Kit, Agilent, Cat# 5067-4626), TapeStation (High Sensitivity D5000 ScreenTape and Reagents, Agilent, Cat# 5067-5592 and Cat# 5067-5593) or Fragment Analyzer (High Sensitivity NGS Fragment Analysis Kit (1–6,000 bp), Advanced Analytical, Cat# DNF-474-1000). The average size of this library should be between 500 and 750 bp (range 300–1000 bp); if there are traces of primer dimers (<200 bp fragments), repeat bead purification and re-check fragment size distributions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig23.jpg\nFigure 23. Representative Traces of a Tagmented and Purified 3′-TARGET-seq Whole Transcriptome Library (Average Size = 600 bp)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/216-Fig24.jpg\nFigure 24. Schematic Representation of the Analytical Workflow\nQuantify the libraries using Qubit and calculate library molarity.\nDilute libraries to 4 nM and pool equimolar concentrations of each library in a microfuge tube. Libraries are now ready for sequencing!\nSequence the libraries on an Illumina platform (NextSeq, HiSeq or NovaSeq platforms) using a custom primer for read1 (P5_SEQ; Key Resources Table[href=https://www.wicell.org#key-resources-table]). If using the NextSeq platform, load a 3 pM library diluted in 1.3 mL of HT1 Buffer (Illumina) and 900 nM of P5_SEQ primer in a total volume of 3 mL of HT1 buffer. Use the following sequencing configuration: 15 cycles (read1) + 8 cycles (index read) + 65 cycles (or more, read2)."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Sequencing",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}