{
  "id": 8573,
  "origin_website": "Jove",
  "title": "Investigating Alterations in Caecum Microbiota After Traumatic Brain Injury in Mice",
  "procedures": [
    "All procedures performed were approved by the Experimental Animal Ethics Committee of Zhejiang University. All instruments and materials used in surgery are sterile. The TBI proceudre takes about 20 minutes.\n1. Animal care\nUse 5- to 6-week-old male C57BL/6J mice (20-25 g of weight) in this experiment.\nMaintain mice on a 12 h/12 h light/dark cycle, and make sure they receive food and water ad libitum. Provide the same amounts of food and water to both the sham and TBI groups throughout the study.\nMake all efforts to minimize the animal pain and discomfort.\n2. Induction of traumatic brain injury\nInject Ketamine (80-100 mg/kg)/Xylazine (10 mg/kg) IP for anesthesia. Test the depth of anesthesia using an eye reflex or pain reflex. Use artificial tears or lubricant eye ointment to keep the eyes from drying.\nAfter anesthesia, put the mouse in prone position. Use a temperature-controlled heating pad to maintain the temperature at 37 °C during the surgery and for 30 min after TBI.\nShave the hair of the incision area.\nDisinfect the scalp with 70% ethanol using three alternating scrubs, then incise the scalp in a sagittal plane.\nUse forceps to retract the incision on both sides and separate the periosteum slightly.\nUse a marker to draw a circle (3 mm diameter) on the right parietal area of the skull, 2 mm away from the midline.\nDrill the skull with an electric drill. Ensure that this step is operated carefully to protect the dura from being damaged.\nRemove the bone flap and expose a small bone window (3 mm in diameter).\nPlace a plastic injury cannula (internal diameter = 2.5 mm, length = 8 mm) over the craniotomy and cement the cannula to the skull using a dental acrylic.",
    "Fill the cannula with sterile 0.9% NaCl (normal saline) using a syringe (5 mL) to ensure that there are no bubbles in the cannula.\nTurn on the oscilloscope and amplifier and ensure that the high-pressure tube of the lateral fluid percussion injury (LFPI) device is free of air bubbles. Test the device by delivering about 10 pulses until it gives a steady signal. Adjust the angle of the pendulum starting position to reach a pulse intensity of about 2.0 atm.\nConnect the injury cannula to the LFPI device. Induce brain injury by pulling the trigger and releasing the pendulum. Then, obtain a pulse and transmit it to the dura through the entire closed fluid-filled tubing system.\nOperate the mice in the sham group with the same surgical procedure. Do not perform the LFPI.\n3. Post-surgery treatment\nAfter inducing the brain injury, remove the plastic cannula and suture the incision. During surgery administer buprenorphine (2mg/kg) SQ or IP and thereafter every 6-12 h for three days.\nLay the mouse on a heating pad until it is ambulatory. Set the temperature of the heating pad to 37 °C to accelerate anesthetic resuscitation.\nPut the mouse back in the cage and administer food and water ad libitum.\n4. Laparotomy and sample collection from the caecum\nEuthanize the mice by CO2 followed by cervical dislocation at the corresponding time points.\n\tNOTE: In this experiment, the chosen time points were 1 h, 6 h, 1 d, 3 d, and 7 d post-traumatic brain injury to analyze the dynamic evolution of gut microbiota.\nRemove the hair from the surface of the abdomen. Disinfect the abdomen with 70% ethanol.\nPlace a sterile drape over the mouse. Make an incision from the lower abdomen midline, just above the prepuce in the male mice.",
    "After the intestines are exposed, locate the cecum and gently separated it from other intestinal tracts. Avoid grasping the cecum with toothed or sharp forceps. Use atraumatic forceps, such as Adson forceps with serrations.\nCut the caecum with sharp scissors.\nExtract the caecum contents manually onto sterile dressing and store the contents in 1.5 mL microcentrifuge tubes.\nStore the caecum contents at -80 °C until microbiome analysis.\n5. DNA extraction and 16S-rDNA sequencing and data analysis\nIsolation of DNA from feces\n\tNOTE: A commercially available DNA isolation kit (Table of Materials) was used for this experiment.\n\t\nUse a scalpel to scrape 300 mg of feces in a 2 mL microcentrifuge tube and place the tube on ice.\nAdd 1 mL of inhibit buffer to each sample. Vortex continuously for 1 min or until the feces sample is thoroughly homogenized.\nCentrifuge the sample at the maximum speed for 1 min to pellet the feces particles.\nPipette 2 µL of proteinase K into a new 2 mL microcentrifuge tube. Pipet 600 µL of the supernatant from step 5.1.3 into the 2 mL microcentrifuge tube containing proteinase K. Then, add 600 µL of Buffer 1 and vortex for 15 s.\nIncubate the sample at 70 °C for 10 min.\nAdd 600 µL of 100% ethanol to the lysate (1:1 ratio) and mix by vortexing. Centrifuge at the maximum speed briefly to remove drops from the inside of the tube lid.\nApply 600 µL of the lysate to the spin column. Centrifuge at the maximum speed for 1 min. Discard the flow-through. Repeat this step one more time. Then, transfer the column into a new 2 mL collection tube.",
    "Open the spin column and add 500 µL of Buffer 2. Centrifuge at the maximum speed for 1 min. Remove the column and place it in a new 2 mL collection tube.\nAdd 500 µL of Buffer 3 into the column. Centrifuge at the maximum speed for 3 min. Discard the flow-through. Repeat the centrifugation process once to ensure the Buffer 3 is completely eluted.\nPlace the spin column into a new tube 2 mL collection tube and pipette 200 µL of Buffer 4 directly onto the membrane. Incubate for 1 min at room temperature (RT), then centrifuge at the maximum speed for 1 min to elute DNA.\n16S-rDNA sequencing and data analysis\nUse 20-30 ng of DNA to generate amplicons.\nUse commercially available primers designed for the relatively conserved regions bordering the V3 and V4 hypervariable regions of bacteria 16S rDNA. The forward primers containing the sequence \"CCTACGGRRBGCASCAGKVRVGAAT\" and reverse primers containing the sequence \"GGACTACNVGGGTWTCTAATCC\" were used in the present study.\nMake the PCR reactions mixture by adding 2.5 µL of Buffer 1, 2 µL of dNTPs, 1 µL of each primer, 0.5 µL of DNA polymerase, and 20 ng of template DNA in a tube. Use ddH2O to adjust the reaction system to 25 µL.\nSet the PCR reaction parameters as follows: perform the pre-denaturation at 94 °C for 3 min once. Perform denaturation at 94 °C for 5 s, anneal at 57 °C for 90 s, extend at 72°C for 10 s, and repeat this 24x.\nPerform PE250/300 paired-end sequencing according to the manufacturer's instruction and use QIIME data analysis package for 16S rRNA data analysis.\n\t\tNOTE: In this experiment, the DNA sequencing and data analysis were primarily done by a professional sequencing company.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}