{
  "id": 3743,
  "origin_website": "Cell",
  "title": "Monitoring daytime differences in moderate intensity exercise capacity using treadmill test and muscle dissection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHere we detail a protocol that applies a constant running speed at a moderate intensity, which is often referred to as “endurance running.” Endurance running, or long-distance running, is a type of exercise that involves aerobic metabolism. The running intensity is defined by the speed and slope that corresponds to the “aerobic power” needed. A moderate intensity run is often considered as 45%–75% of the maximal running capacity (Hawley et al., 2014[href=https://www.wicell.org#bib23]). To determine the maximum power, you need to perform a treadmill test together with gas analyzer equipment and obtain the VO2max/VO2peak (Hoydal et al., 2007[href=https://www.wicell.org#bib24]; Petrosino et al., 2016[href=https://www.wicell.org#bib37]). A simpler, yet less accurate, alternative is to do an incremental speed test until mice cannot run anymore and obtain the maximum velocity (Vmax), which correlates with VO2max/VO2peak (Jordan et al., 2017[href=https://www.wicell.org#bib25]; Picoli et al., 2018[href=https://www.wicell.org#bib38]) . In this protocol we use a speed of 22–25 cm/s which is considered as moderate intensity (within ∼60% of their maximal velocity), as untrained C57BL/6J mice reach a Vmax on average at 40 cm/s (Ezagouri et al., 2019[href=https://www.wicell.org#bib16]). The moderate intensity running session lasts a few hours, depending on the time of the day, until animals reach fatigue (see below).\nNote: the duration of this protocol is different than an acceleration speed protocol that lasts a few minutes, until mice are unable to maintain the elevated running speed and increased workload, which is accompanied by elevated blood lactate levels, and often referred to as “run to exhaustion.”\nCritical: As oxygen and energy needs differ relative to body size and composition, make sure you record the bodyweights in your study and preferably use weight-matched animals.\nHabituate mice to run on the treadmill\nTiming: 30 min × number of days needed",
    "Habituation period is needed for mice to get familiar with the treadmill and the running protocol. During this period, mice learn to avoid the shock grid. It was previously reported that for C57BL/6 mice, one to two short (5–10 min) sessions at low speed (15–17 cm/s) are enough to minimize their contact with the grid (Dougherty et al., 2016[href=https://www.wicell.org#bib11]; Marcaletti et al., 2011[href=https://www.wicell.org#bib31]). We, therefore, use a single habituation session the day before the test when working with C57BL/6J mice. However, additional familiarization sessions might be required for other mouse strains and depend as well on their age, and health status (see: Troubleshooting: Problem 1[href=https://www.wicell.org#sec5.1]). When the purpose is to evaluate running capacity in sedentary non-exercised mice, it is also recommended to minimize as much as possible any training effects on performance. This can be achieved by using relatively lower speed. In case more habituation sessions are needed, scheduling these sessions every other day over a week may be considered (Castro and Kuang, 2017[href=https://www.wicell.org#bib6]; Fan et al., 2017[href=https://www.wicell.org#bib17]).\nA day before the test, mice are acclimatized to the treadmill at the same ZT of the running test.\nNote: Exercise bouts were shown to affect the muscle molecular clock depending on the time of day (Wolff and Esser, 2019[href=https://www.wicell.org#bib43]; Wolff and Esser, 2012[href=https://www.wicell.org#bib44]). Therefore, performing the habituation sessions and the running tests at the same ZT are likely to reduce related confounding effects.\nCritical: If you perform the experiment within the dark phase work under red light. If necessary, use black cloth to cover the cages while transferring the animals to the treadmill.\nGently pick up the mice by the tail and individually place them in separate lanes.\nAllow them to freely explore it for 5 min (speed 0 cm/s; shocks on)",
    "Turn on the treadmill belt and increase the speed to 12 cm/s.\nIncrease the speed by 1 cm/s every minute until reaching 22 cm/s.\nContinue running mice at 22 cm/s for 5 min.\nWhen you are done, return the mice to their cages.\nNote: you might find it easier to pick up mice by the tail from the treadmill while the belt is still running.\nRun mice at a moderate intensity to evaluate running capacity\nTiming: variable; few hours",
    "To reliably determine running capacity, the endpoint as well as inclusion and exclusion criteria should be well defined. The challenge is to decide on when the mice reach fatigue, and as discussed below (see limitation section) one can find different protocols in the literature. Based on early studies from the Evan’s lab (Fan et al., 2017[href=https://www.wicell.org#bib17]; Narkar et al., 2008[href=https://www.wicell.org#bib35]) and our experience, we defined two criteria for fatigue, and observing either of them is an indication to stop the run and return the animal to its cage. At the beginning of the test, sedentary C57BL/6J usually cope well with the speed and run toward the front of the belt. After few hours, they spend more time at the rear of the treadmill belt and blood glucose levels progressively decline (Methods Video S1[href=https://www.wicell.org#mmc1]). Hence, the first criterion is reaching blood glucose levels of ≤70 mg/dL. We did notice, however, that in the case of some mutant mouse models (e.g., Per1/2 null mice (Ezagouri et al., 2019[href=https://www.wicell.org#bib16])), after running a certain distance, the animals are reluctant to run and spend a considerable time in contact with the gird, while their blood glucose levels remain above 70 mg/dL. We, therefore, included a second criterion, namely spending more than 5 accumulative seconds in contact with the grid within a 30 min window after at least 1 h run.\nNote: In the case of C57BL/6J, if mice spend more than 5 accumulative seconds in contact with the grid within a 30 min window already within the first hour of the run, they are excluded from the experiment. (Troubleshooting: Problem 1[href=https://www.wicell.org#sec5.1])\nIf you perform the experiment in the active (dark) phase work under red light. If necessary, use black cloth to cover the cages while transferring them to the treadmill location.",
    "Measure the initial blood glucose levels by using glucometer:\nGet supplies ready for use:\nPrepare sharp and clean scissors\nMoisten a small piece of paper towel or gauze with water or 70% ethanol\nPlace glucose strip into the glucometer\nGently remove the mouse from the cage and record its weight.\nPick up the mouse by the tail and place it on the wire lid or on your coat to allow it to get a grip.\nKeep holding the mouse with your non-dominant hand and cut 1–2 mm from the tail tip.\nNote: If prior tail biopsies have been performed (e.g., for genotyping purpose) lateral tail vein incision will suffice.\nGently massage the tail from the center of the tail to the tip to allow for blood flow.\nPlace the blood sample on the glucometer strip and record the results (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/463-Fig3.jpg\nFigure 3. An example of glucose monitoring from a mouse tail tip\nApply gentle pressure with dry paper towel or gauze for approximately 10 s to stop the bleeding.\nPlace the mouse in the lane.\nRepeat for all mice that are expected to start the run.\nWhen you are done start the free exploration session (5 min; speed 0 cm/s; shocks on)\nTurn on the treadmill belt and increase the speed to 12 cm/s, then increase the speed by 1 cm/s every minute until reaching 25 cm/s.\nContinue running mice at 25 cm/s until they reach fatigue according to the criteria describe above.\nTake mice for blood glucose measurements every 30 min to monitor fatigue status. Usually, a rise in blood glucose levels appears during the first 30 min, but overall glucose levels are expected to gradually decline throughout the test (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/463-Fig4.jpg",
    "Figure 4. Expected blood glucose levels during moderate intensity (25 cm/s) running test performed at two different ZTs during the active phase\nData are presented as the mean ± SEM of n = 3. p < 0.05, p < 0.01, p < 0.001 repeated measures two-way ANOVA for the interaction, ZT effect, and running duration effect, respectively.\nTake one mouse at a time gently and quickly pick it up by the tail.\nCritical: Keep the treadmill belt running while picking up a mouse. It is faster and easier to grab the mouse while it is still running. This way you do not disturb the running of the other mice while you take the necessary measurement.\nPlace the mouse on a wire lid or on your coat to allow it to get a grip. Use wet paper towel or gauze and gently remove the scab.\nCritical: Removing the scab and allowing fresh blood flow by massaging (“milking”) the tail is important to get reliable glucose reads.\nPlace the blood sample on the glucometer strip and record the results (Figure 3[href=https://www.wicell.org#fig3]).\nOnce you are done place the mouse back in its lane.\nOptional: The protocol can be modified depending on your experimental question:\nTo induce training effect, use the protocol for shorter durations (e.g., 30–60 min) several days a week for a few weeks (Ferreira et al., 2007[href=https://www.wicell.org#bib18]; Jordan et al., 2017[href=https://www.wicell.org#bib25]; Massett and Berk, 2005[href=https://www.wicell.org#bib33]; Narkar et al., 2008[href=https://www.wicell.org#bib35]).\nFor tissues harvesting for further processing and analysis, stop the protocol at a pre-defined time and sacrifice the mice. (Troubleshooting: Problems 1[href=https://www.wicell.org#sec5.1]2[href=https://www.wicell.org#sec5.3]3[href=https://www.wicell.org#sec5.5]4[href=https://www.wicell.org#sec5.7])\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. A video of mice running on treadmill, related to step 14",
    "Compare left and right lane: on the right lane a mouse that can sustain the intensity of the run, and on the left lane a mouse that shows fatigue signs.\nDissecting soleus, gastrocnemius plantaris, and quadriceps muscles for further analyses\nTiming: 10–30 min\nHere we describe how to dissect different types of skeletal muscle for further analysis, comparing running versus sedentary conditions. This is valuable if you wish to study molecular changes occurring in skeletal muscles during the running session, once animals reach fatigue, or even later on upon recovery.\nNote: It is recommended to recognize the structure of the muscles and get familiar with the relevant anatomy. Briefly, muscles are connected to bones through tendons, and to the body by connective tissue, therefore make sure you dissect a muscle that is clean of irrelevant tissues as much as possible.",
    "Critical: There are two valid options for selecting the sedentary control group. Given that the run can last for several hours, and that this time duration by itself might lead to some metabolic/physiologic changes this should be taken into consideration. Hence, you can either sacrifice the control group at the time that corresponds to the start or the end of the run. For example, in the case of a mouse that started the running protocol at ZT14 and run for 3 h. One option is to have a similar end point for the sedentary control group, i.e., ZT17. In this case, the sedentary control group are placed near the treadmill in individual cages without food and water, which is as close as possible to the running conditions. You can also sacrifice the control group at a separate day after keeping the mice in the treadmill’s lanes without turning on the running belt for the same duration as the running group. Another option is to sacrifice the control group at ZT14 to get a picture of the condition before the run. It is recommended, therefore, to take this into consideration when designing the experiment and interpreting the results.\nSacrifice the mouse at the desirable time after running.\nNote: We found that cervical dislocation without anesthesia is the preferable technique as it is relatively rapid and enables sacrificing several animals within a short time. Nevertheless, cervical dislocation can damage blood vessels, resulting in internal hemorrhaging. Therefore, this technique is not recommended if a large volume of blood is needed for future analysis, and alternative techniques should be considered.",
    "Immediately after the mouse is sacrificed, lay it on the dissection board in a prone position. Stabilize its feet with needles / tapes, and spray ethanol on the lower body until the fur becomes wet (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/463-Fig5.jpg\nFigure 5. Dissection of mouse soleus (Sol), gastrocnemius plantaris (Gas), and quadriceps (Quad) muscles\nNote: At this stage you can freely work under light.\nUse the forceps to lift the skin around the distal part of the spine (In the middle of the transverse line between the two points where the hind limbs are connected with the body) and make an incision using a pair of scissors (Figure 5[href=https://www.wicell.org#fig5]C).\nUse the forceps to lift the skin around the incision side that is closest to the hind limb. Insert the scissors between the uplifted skin and the body and make an opening move with the blunt side of the scissors touching the internal side of the skin to enlarge the incision toward the posterior side of the hind limb (over the hamstring and the gastrocnemius muscles). Cut the skin gently with the scissors each time the incision is large enough until the Achilles tendon is exposed (Figure 5[href=https://www.wicell.org#fig5]D).\nAfter the Achilles tendon is exposed, gently hold the skin of the anterior part of the distal hind limb with your fingers then peel the skin of the mouse hind limb until it is completely visible (Figure 5[href=https://www.wicell.org#fig5]E).",
    "Use the forceps to pick up the distal part of the Achilles tendon, and hold it firmly. Using the second hand, stick the point of the scissors between the spot where the Achilles tendon is connected to the gastrocnemius muscle (the proximal end part of the Achilles tendon) and the tibia / fibula bones. The scissors should stick to the bones to create a space between the muscle and the bones. Keeping the scissors closed, slide them along the bones and toward the knee until you reach the patella. If performed correctly the gastrocnemius plantaris and soleus are now separated from the bones (Figure 5[href=https://www.wicell.org#fig5]G, Methods Video S2[href=https://www.wicell.org#mmc2]).\nUsing the forceps, hold the proximal edge of the Achilles tendon, then cut distal to it. Make sure you cut the tendon in its distal end in order to avoid the cutting of the distal part of the soleus (Figure 5[href=https://www.wicell.org#fig5]H, Methods Video S2[href=https://www.wicell.org#mmc2]).\nKeep holding the hind limb muscles by the tendon (Figure 5[href=https://www.wicell.org#fig5]I, Methods Video S2[href=https://www.wicell.org#mmc2]).\nLocate the soleus muscle, and use scissors to cut the proximal end of the soleus tendon. If performed correctly, the soleus will pop up (Figure 5[href=https://www.wicell.org#fig5]J, Methods Video S2[href=https://www.wicell.org#mmc2]).\nUse the forceps to hold the proximal part of the soleus (the detached part), gently pull it up so the whole muscle can be clearly observed. Cut the distal tendon to completely isolate it. Put the dissected muscle inside a tube and immediately freeze in liquid nitrogen (Figure 5[href=https://www.wicell.org#fig5]K, Methods Video S2[href=https://www.wicell.org#mmc2]).",
    "Use the forceps to hold the Achilles leftovers (on the distal part of the gastrocnemius plantaris) in parallel to the bones, using the scissors in the second hand cut the non-muscle tissue around the proximal part of the gastrocnemius plantaris, along the bones until the muscle is fully detached. Use the scissors to clear the muscle of any non-muscle tissues. Put the gastrocnemius plantaris inside a tube and immediately freeze in liquid nitrogen (Figures 5[href=https://www.wicell.org#fig5]L and 5M).\nNote: The plantaris muscle is synergist to soleus and gastrocnemius, but more similar to gastrocnemius in terms of fiber type composition and metabolic profile (Sawano et al., 2016[href=https://www.wicell.org#bib42]). The plantaris is enmeshed within the medial and lateral heads of the gastrocnemius muscle, and separating the two can be challenging. Due to its similarities to gastrocnemius and its significantly smaller mass we collect them together.\nCross the leg to the other side of the body (Figure 5[href=https://www.wicell.org#fig5]N), and stabilize it to the dissection board using a needle so a 90 degrees angle of the knee joint is formed.\nUse the forceps to pick up the quadriceps so a space is created between the muscle and the femur. Use the scissors to make a cut between the muscle and the femur, as close as possible to the bone. Then cut along the bone toward its proximal end until the muscle detaches (Figure 5[href=https://www.wicell.org#fig5]O). Using the forceps, hold the distal part of the detached quadriceps, and with the scissors in the other hand, make a cut toward the proximal end of the muscle and along the bone until the muscle is linked to the body only by connective tissue (Figure 5[href=https://www.wicell.org#fig5]P). Using the scissors, clear the muscle of any non-muscle tissue. Put the muscle inside a tube and freeze instantly in liquid nitrogen. (Troubleshoot: Problem 5[href=https://www.wicell.org#sec5.9])",
    "Your browser does not support HTML5 video.\n  \nMethods Video S2. A video showing dissection of the soleus muscle, related to steps 21–25"
  ],
  "subjectAreas": [
    "Metabolism",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}