{
  "id": 9373,
  "origin_website": "Jove",
  "title": "Methods for the Modulation and Analysis of NF-κB-dependent Adult Neurogenesis",
  "procedures": [
    "Ethics statement\nThis study was carried out in strict accordance with the regulations of the governmental animal and care use committee, LANUV of the state North Rhine-Westphalia, (Düsseldorf, Germany). All animal experiments were approved by LANUV, Düsseldorf under the license number 8.87–51.04.20.09.317 (LANUV, NRW). All efforts were made to minimize distress and the number of animals required for the study.\n1. Animal Care and Housing\nAll animals used in the protocols described herein should be kept under specific pathogen-free conditions, as defined by the Federation European Laboratory Animal Science Association (FELASA).\nMice should be kept in standard cages in a temperature- and humidity- controlled (22 °C) room under diurnal conditions (12 hr light/dark cycle) with HEPA filtered air.\nStandardized food and water should be provided ad libitum.\nIf IκB/tTA and IκB /- control mice are used, PCR-based genotyping should be performed for each animal, as described in7,18.\nMale animals with an age difference of less than four days should to be used to reduce individual variability.\n(OPTIONAL): For NF-κB reactivation experiments, doxycycline must be administered in drinking water (2 mg/ml with 2.5% sucrose) for at least 14 days.\n2. Spatial Pattern Separation-Barnes Maze (SPS-BM)\nAll behavioral testing should be carried out according to international and local guidelines.\nIMPORTANT! Use only male mice with an age of six months or older. The age difference between the animals of one test series should be less than four days. The testing must be performed by the same operator for each series. The mice should receive a standard diet prior to the testing to further increase the motivation partially driven by a sweet food reward.",
    "Set up a white circular plate made from hard plastic (diameter 120 cm, see Figure 5A) in a humidity- and temperature- controlled room (22 °C), illuminated with at least 4 x 80 W and 3 x 215 W neon fluorescent lamps. IMPORTANT! Ensure the correct illumination is used, as the motivation of the mice to enter the food houses is partially driven by their aversion to bright, exposed places.\nSet up the video-tracking system. The camera should be placed 115 cm above the center of the plate (see Figure 5A).\nAttach multicolored extra-maze cues (EMC) to a white-colored cloth in positions easily visible for the animals, approximately 100 cm from the border of the plate (see Figure 5A).\nCarefully clean the plate with a rapid disinfectant that can remove any odor from the experimental set-up.\nPlace seven identical yellow food houses (12 cm x 7 cm x 8 cm, see Figure 5A) on the white plate. The positions should be unequivocally marked (see Figure 5A).\nPlace sweet food pellet rewards (a quarter of a Kellogs`s Froot Loop/food house) inside all food houses on defined positions (see Figure 5A) with only one defined food house being freely accessible to the animal (location F, see Figure 5A). Close the nontarget food houses with transparent foil.\nPrior to the test, perform habituation (one day before starting the task).Make all food houses freely accessible and allow the mice to explore the maze freely and to retrieve a food pellet reward (10 min/animal).\nSwitch the computer and the camera on and start the video-tracking system software.\nStart the recording.\nPlace the animal at the defined start point on the circular plate (Figure 5A, S: start position) and allow the mice to search for the target food house for 10 min.\nStop the video-tracking.",
    "IMPORTANT! Clean the circular plate and the food houses after each trial with rapid disinfectant.\nRepeat the test daily for seven consecutive days (for each animal).\nAnalyze the results (latency, distance covered and errors) using appropriate statistics software. Define errors as approaching the wrong food house and / or contact with the proper box without entering and retrieving the food pellet reward. For grouped analysis use two-way ANOVA with Bonferroni post-hoc test.\n(OPTIONAL) Sacrifice the mice and analyze the hippocampi as described below.\n3. BrdU Labeling\nInject intraperitoneally 50 mg/kg i.p. BrdU once daily for 3 days (analysis of differentiation and integration) or 200 mg/kg i.p. for a single injection (analysis of proliferation).\nSacrifice the animals, dissect the hippocampus and prepare 40 µm sections as described below.\nDenaturate the sections with 2 M HCl for 10 min and incubate in 0.1 M borate buffer for 10 min.\nLabel a one-in-twelve series of 40 μm sections (240 μm apart) from each animal immunohistochemically, as described below using antibodies directed against BrdU.\nQuantify the labeled cells by confocal microscopy analysis throughout the rostrocaudal extent of the granule cell layer and subgranular zone. Multiply the resulting numbers by 12 to obtain the estimated total number of BrdU-labeled cells per hippocampus and divide by two to obtain the total number of labeled cells per DG.\n4. Removal of the Brains and Preparation of Cryosections from Nonperfused Animals\nObserve locally approved procedures for euthanizing animals. Mice may be directly euthanized by cervical dislocation.\n(OPTIONAL) Animals can be anesthetized before euthanization according to local and international guidelines, e.g. by intraperitoneal injection of 0.8 ml Avertin for a 33 g mouse (freshly made by mixing 150 ml stock solution made of 2.2 mg 2,2,2-tribromoethanol in 1 ml isoamyl ethanol with 1.85 ml of saline or physiological buffer).",
    "Sterilize the head with Betadine (10% povidone-iodine)-soaked gauze and swab subsequently with gauze soaked in 70% ethanol.\nDecapitate the animal using appropriate surgical scissors and pull the skin aside.\n(OPTIONAL) Fixators can be applied to avoid folding back of the retarded skin.\nMake a midline incision in the skull and carefully pull the skull fragments aside.\nCarefully remove the whole brain using an appropriate surgical instrument (e.g. Moria Spoon).\nPrecool 25 ml of 2-methylbutane in a 50 ml beaker (e.g. Schott Duran) to -30 to -40 °C on dry ice.\n\tNote: For free-floating staining of \"thick\" sections which are ideally suited for confocal laser scanning microscopy, remove brain, wash 3 times in buffer and store at 4 °C in phosphate buffered 30 % sucrose solution in 50 ml tube until brain has sunk down to bottom (typically overnight).\nCarefully place brain on a piece of Nescofilm (Parafilm) and cover with ample amount of TissueTek OCT compound, freeze on Nescofilm in 2-methylbutane, store at -80 °C until use.\n\tNote: For long-time storage at -20 °C store in 9% sucrose, 7 mM MgCl2, 50 mM phosphate buffer, 44% glycerol.\nCut the brain into 10-12 μm thick sections on appropriate cryomicrotome.\n\tNote: For thick, free-floating sections, freeze brain on cryotome stage of appropriate cryotome (e.g. Reichert Jung, Frigomobil) and cut 40 μm horizontal sections at -20° to - 25 °C. Collect sections from knife with fine brush and collect in buffer or keep in storage solution ( step 4.9) at -20 °C for long-time storage.\nCarefully mount two slices on single microscope slides. The use of Superfrost UltraPlus slides is highly recommended to maximize adhesion of the sections.\nDry the slides for 5 min at room temperature. Slides can be stored at -80 °C until use.\n5. Preparation of Sections from Perfused Animals",
    "Anesthetize the animals as described above (step 4.2).\nCarefully perfuse the animal transcardially with phosphate buffered saline (PBS) containing heparin (0.025 g/100 ml PBS) and procaine (0.5 g/100 ml PBS) for 2-4 min, followed by 4% paraformaldehyde in PBS for 10-15 min. Perfusion is optimally performed by perfusing via the left ventricle and opening of the right atrium using a hydrostatic pressure of approximately 1.2-1.4 m or utilizing a peristaltic pump set to approximately 15 ml/min. Optimal perfusion results in a pale white brain with no red blood vessels being visible.\nDissect and post-fix the brains in 4% paraformaldehyde at 4 °C for 24 hr.\nCryoprotect the brains in 30% sucrose in PBS at 4 °C for at least 24 hr.\nFreeze the brains on the cryotome stage.\nPrepare 40 µm horizontal sections from entire forebrains using an appropriate cryotome.\nThe slides can be stored in cryoprotectant solution (0.1 M phosphate buffer, 50% glycerol, 0.14% MgCl2, 8.6% sucrose) at -20 °C until use.\n6. Immunohistochemistry of Brain Sections of Nonperfused Animals\nPost-fix the cryosections, prepared as described above, using -20 °C cold methanol for 10 min.\nBlock with 5% normal serum containing 0.3% Triton-X (from the species which was used for raising the secondary antibody) overnight at 4 °C.\nRinse 3x with 1x PBS and incubate with primary antibodies overnight at 4 °C.\nRinse 3x with 1x PBS and incubate with secondary antibodies at room temperature for one hour.\nRinse 3x with 1x PBS\nCounterstain the section for DNA using SYTOX green, or DAPI (or an alternative DNA dye).\nRinse 3x with 1x PBS\nEmbed the sections in an aqueous embedding medium.\nLet the embedding medium polymerize for at least 48 hr.\n7. Immunohistochemistry of Brain Sections of Perfused Animals",
    "Block as described in step 6.2 and subsequently incubate the fixed brain sections in primary antibody solution diluted in PBS containing 0.3% Triton-X (free-floating) overnight at 4 °C.\nRinse three times with 1x PBS and incubate in secondary antibody solution diluted in PBS containing 0.3% Triton-X (free-floating) at room temperature for 3 hr.\nRinse 3x with 1x PBS\nCounterstain the section for DNA using SYTOX green or DAPI (or an alternative DNA dye).\nRinse three times with 1x PBS\nEmbed the sections in an aqueous embedding medium.\nLet the embedding medium polymerize for at least 48 hr.\n8. Investigation of Mossy Fiber Projections\nSacrifice the animals, prepare 40 µm coronal sections as described above and stain the hippocampal section using antibody for neurofilament M.\nScan the sections at the appropriate wavelength using a confocal laser scanning microscope to visualize mossy fibers and nuclei. Start the scanning at low magnification.\nUse the low magnification images for orientation and target the hippocampus with mossy fiber projections.\nScan the sections (z-sectioning) at high resolution and high magnification.\nAnalyze the morphological appearance and connectivity of the mossy fibers visualized via staining for NF-M.\n(OPTIONAL) Analyze the size and volume of hippocampal blades. Use the DNA signal for the measurements.\n9. Fluoro-Jade C Assay (Neuronal Cell Death)\nSacrifice the animals, dissect the hippocampus, and prepare 12 µm sections as described above.\nLet the sections dry for 30 min at room temperature.\nFix the sections in 4% PFA for 40 min at room temperature.\nBriefly wash the sections 3x with ddH2O.\nIncubate the sections with 0.06 % potassium permanganate (KMnO4) for 10 min under continuous, gentle shaking.\nWash the sections 3x with ddH2O.\nIncubate the sections with 0.002% Fluoro-Jade C solution for 20 min at room temperature.",
    "(OPTIONAL) For simultaneous nuclear stainings, 0.002% Fluoro-Jade C solution can be supplemented with 10 µg/ml DAPI.\nBriefly wash the sections 3x with ddH2O.\nLet the sections dry for 30 min at room temperature.\nIncubate the sections with Xylene (1 min)\nMount the sections using a Xylene-based mounting medium (D.P.X.).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}