{
  "id": 14443,
  "origin_website": "Jove",
  "title": "Investigating Migraine-Like Behavior Using Light Aversion in Mice",
  "procedures": [
    "Animal procedures were approved by the University of Iowa Animal Care and Use Committee and performed in compliance with the standards set by the National Institutes of Health.\n1. Light/dark assay\nLight/dark chamber apparatus (see Table of Materials) setup. All the equipment in this section is commercially available.\n\t\nOn a shelf, place the sound-attenuating cubicle (interior: 59.7 x 38 x 35.6 cm in W x H x D) containing a pull-out drawer for easy access to the chamber and dark insert.\nConnect the DC power supply and a DC-regulated power supply to the sound-attenuating cubicle.\nPlace the transparent seamless open field chamber (27.31 x 27.31 x 20.32 cm in L x W x H) on the pull-out drawer of the cubicle.\nPlace the black, infrared (IR)-transparent plastic dark insert (28.7 X 15 X 20.6 cm in L x W x H) in the open field chamber. Ensure that the chamber is divided into two zones of an equal size: a dark zone and a light zone.\nConnect three sets of 16-beam IR arrays on the X, Y and Z axes of the open field chamber to the IR USB controller via cables.\nConnect the IR USB controller to a computer.\nInstall the tracking software on the computer which can record and collect mouse location and activity.\nFor the light panel setup, first remove the light-emitting diode (LED) light panel (27.70 x 27.70 cm in L x W; 360 LEDs, daylight-balanced color, 5600K, 60° flood beam spread) from its original housing.\nAssemble the light panel with the LED driver, the heat sink, and the power supply. Multiple LED light panels can be connected to one power supply, heat sink, and LED driver to achieve uniform light panel control.",
    "Construct a customized acrylic platform (29.77 x 27.70 x 8.10 cm in L x W x H) comprising of 7 identical shelves at 0.53 cm intervals (Figure 1B). Permanently affix the customized acrylic shelf to the ceiling inside the cubicle above the chamber.\nInsert the LED light panel into the slot between the bottom two shelves. Adjust the light panel to different heights (Figure 1B,C), if necessary (e.g., if using optogenetic mice. Details are discussed in Section 3).\nTurn on the heat sink, LED driver, and power supply. Confirm that the LED driver can dictate the LED light intensity by measuring the light intensity on the chamber floor and confirm that the floor is lit evenly.\nBehavioral test procedure\n\tNOTE: Mice are housed on a 12 h light cycle. All behavioral experiments are performed during the light cycle. Mice, including both males and females, aged 10-20 weeks old, are used. In this protocol, naïve wildtype CD1 and C57BL/6J mice experience two pre-exposures to the light/dark chamber followed by exposure with treatment and a post-treatment exposure. There is a three-day interval between each exposure to allow mice to recover (Day 1, 4, 7 and 10 as described below and Figure 1A). However, CD1 mice do not require the 2nd pre-exposure and can be tested in dim light.\n\t\nOn day 1 (pretreatment 1), turn the light/dark assay apparatus on and set the light intensity to 27,000 lux.\nOpen the tracking software and set up a new protocol. In the New Protocol setting, set the Duration to 30 min. In the New Analysis setting, set Data Bins by Duration to 300 s.\nIn the New Zone setting, choose Pre-Defined Zones. Choose 2 and then Horizontal. Check if the chamber is divided into two equal-size zones horizontally for recording.",
    "Habituate mice to the testing room for 1 h prior to the testing. During habituation, keep the room light on to not disrupt the mouse's circadian rhythm. Make sure all the equipment for the light/dark assay is turned on, allowing the mice to fully acclimate to the testing room environment.\nSelect Acquire Data. Enter mouse IDs. Start the protocol.\nPull the drawer outside of the sound-attenuating cubicle to access the light/dark chamber and the dark insert. Gently pick up the mouse by the base of the tail, place it in the light zone of the chamber, and push the drawer inside of the cubicle. Ensure that the software detects the mouse immediately and begins to record activity.\nWait for the recording to automatically stop after 30 min. Return the mouse to its home cage.\nClean the chamber and dark insert using alcohol-odor germicidal disposable wipes containing 55.0% isopropyl alcohol, 0.25% alkyl C12-18 dimethyl ethylbenzyl ammonium, and 0.25% alkyl C12-18 dimethyl benzyl ammonium chloride as anti-microbial active ingredients to eradicate any olfactory cues left by the previous mouse.\nOn day 4 (pretreatment 2), repeat steps 1.2.1 to 1.2.8.\nOn day 7 (the treatment day), repeat step 1.2.1 and 1.2.4. After the habituation, administer CGRP (0.1 mg/kg, 10 µl/g based on mouse body weight, intraperitoneal injection (i.p.)), tilting the mouse’s head forward and injecting in the lower right quadrant. Return the mouse to the home cage.\nAfter 30 min, start the protocol and run the mouse in the light/dark chamber as mentioned in steps 1.2.5 to 1.2.7. The recovery time in home cages after injections can be shortened or lengthened depending on the treatment21.\nClean the chamber and dark insert as described in step 1.2.8.",
    "On day 10 (post-treatment day), repeat steps 1.2.1 to 1.2.8. The experiment can be paused at step 1.2.13 before starting the open field assay.\n2. Open field assay\nThe apparatus setup\n\t\nOpen field chamber setup: Use the same sound-attenuating cubicle and open field chamber used in the light/dark assay, without using the dark insert.\nLight panel setup: Use the same setup used in the light/dark assay. Ensure that the light intensity is the same as used in the light/dark assay.\nBehavioral test procedure\n\t\nTurn the apparatus on. Set the light intensity to 27,000 lux.\nOpen the tracking software.\nSet up a new protocol, the same as is used in the light/dark assay except for the New Zone settings. Choose 1 followed by the Center in the New Zone settings. Set the periphery as 3.97 cm from the perimeter and the center as 19.05 × 19.05 cm.\nHabituate mice to the testing room as described in step 1.2.4.\nAdminister CGRP (0.1 mg/kg, 10 µl/g based on mouse body weight, i.p.), tilting the mouse’s head forward and injecting in the lower right quadrant. Return the mouse to the home cage.\nAfter 30 min, start the protocol. Pull the pull-out drawer outside of the sound-attenuating cubicle and gently place the mouse in the middle of the open field chamber. Push the drawer inside of the cubicle.\nTrack behavior for 30 min. Then return mice to their home cages.\nClean the apparatus as described in step 1.2.8.\n3. Modified light/dark assay for optogenetic mice\nThe apparatus setup\n\t\nMake two modifications to the dark insert.\n\t\t\nModify the opening of the dark insert to 5.08 x 5.08 cm (W x H) with a small slit 0.95 x 10.16 cm (W X H) between the top and the opening of the dark insert (Figure 1D top left).",
    "NOTE: This modification allows a mouse to go to the dark zone without difficulty when the fiber-optic cannula on the mouse head is attached to the patch cord.\nExtend the top of the dark insert over the light area as a triangular porch (H=6.5 cm) (Figure 1D top right and bottom left). Cut a circular hole (D=1.7 cm) out of the porch and insert a holder into the hole to place and stabilize the rotary joint, which connects the laser and the fiber-optic patch cords (Figure 1D top left and bottom left).\n\t\t\tNOTE: The modifications result in small change in the light intensity reaching the floor of the dark zone (17 lux with modifications vs 14 lux without modifications, measured on the back-right corner of the dark zone under 27,000 lux).\nInsert the rotary joint into the holder on the dark insert.\nConnect the 30.5 cm fiber-optic patch cord to the rotary joint. Confirm that the rotary joint can rotate smoothly so that the patch cord can rotate without difficulty as the mouse traverses the chamber.\nFor the rest of the setup, use the same apparatus setup as used in section 1 (light/dark assay).\nBehavioral test procedure\n\tNOTE: Unlike the wildtype mice, the optogenetic mice do not receive pre-exposures (pretreatment 1 and 2).\n\t\nOn the test day, insert the LED light panel into the second lowest slot (28.23 cm from the floor of the camber) to allow space for connecting the patch cord. Turn the light/dark assay apparatus on and set the light intensity to 55 lux.\nUse the same protocol setup as that in 1.2.2 and 1.2.3 except that Data Bins By Duration is set to 60 s in the New Analysis setting to be congruent with the laser stimulation protocol in Step 3.2.3.",
    "Turn the laser power button on. Set the laser pulse controller to stimulate for 1 min followed by 1 min without stimulation over 30 min.\nHabituate mice to the testing room with the light on for 1 h prior to the testing.\nStart the protocol. Pull the pull-out drawer outside of the sound-attenuating cubicle to access the light/dark chamber and the dark insert.\nGently restrain the mouse and couple the optic-fiber cannula on the mouse head to the fiber-optic patch cord via a mating sleeve (Figure 1D bottom right). Place the mouse gently in the light zone and push the drawer inside of the cubicle. Make sure that the protocol will begin to record mouse behavior automatically.\nAt 1 min, switch on the pulse controller and then turn the failsafe key to ON. Make sure laser stimulation of the targeted brain region is occurring every other minute.\nAfter 30 min when the protocol stops automatically, turn the failsafe key to OFF. Then turn the pulse controller off.\nUncouple the mouse and the fiber-optic patch cord. Return the mouse to the home cage.\nClean the chamber and dark insert as described in step 1.2.8.\n4. Modified open field assay for optogenetic mice\nThe apparatus setup\n\t\nStabilize the rotary joint above the chamber using a stand and a clamp (Figure 1E).\nConnect the fiber-optic patch cord with a length of 50 cm to the rotary joint. Check if the rotary joint can rotate smoothly.\nSet the rotary joint to the appropriate height on the stand: ensure that the fiber-optic patch cord can only just reach every corner of the chamber, which will help avoid any interference with mouse movement.\nFor the rest of the setup, use the same apparatus setup as used in section 1 (light/dark assay), but without the dark insert.",
    "Behavioral test procedure\n\t\nTurn the light/dark assay apparatus on and set the light intensity to 55 lux.\nUse the same protocol setup as that in the modified light/dark assay (section 3) except for the New Zone settings. Choose 1 following by Center in New Zone settings. Set the periphery as 3.97 cm from the perimeter and the center as 19.05 × 19.05 cm.\nTurn the laser power button on. Set laser pulse controller to stimulate for 1 min followed by 1 min without stimulation over 30 min.\nPerform habituation and the rest of the test as described in steps 3.2.4 to 3.2.10 except for two changes to step 3.2.6: place the mouse gently in the middle of the chamber instead of the light zone; keep the pull-out drawer outside of the cubicle due to the patch cord connecting to the mouse's head.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}