{
  "id": 18178,
  "origin_website": "Jove",
  "title": "Microscopy Based Methods for the Assessment of Epithelial Cell Migration During  In Vitro Wound Healing",
  "procedures": [
    "1. Artificial Wound Scratch Assay for Quantitative Studies\nCell monolayer preparation\nWorking under sterile conditions, seed and grow Mv1Lu or HaCaT epithelial cells in culture flasks using serum-supplemented medium. Refresh medium once every 24-48 h. After cells reach 80% confluence, detach cells using an appropriate method, i.e., trypsinization9.\n\t\tNOTE: Mv1Lu and HaCaT epithelial cell lines are cultured using EMEM and DEMEM culture medium, respectively, supplemented with 2 mM L-Glutamine, and incubated at 37 °C with a controlled atmosphere of 5% CO2. Every cell line must be assayed thoroughly to determine cell concentration and timing required to reach full confluency. Typically for Mv1Lu or HaCaT cells, 2-4 x 104 or 4-6 x 104 cells/well, respectively, are seeded in a 175 cm2 culture flask, and at 80% confluence yields up to 35 x 106 Mv1Lu or 1 x 107 HaCaT cells.\nIn either a 12-well or 24-well culture plate, seed in each well 2 mL of cells. Refresh medium once every 24-48 h. Ensure cell numbers are high enough to reach 100% confluence after 2 or 3 days.\nAfter the cells reach confluence, remove the serum-supplemented medium and wash twice with fresh serum-free medium. Keep cells in serum-free medium for 24 h before the scratching.\n\t\tNOTE: Mv1Lu or HaCaT cells do not have special substrate requirements; however, for cell lines susceptible to detaching spontaneously in serum-free conditions, pre-coating of the culture plate surface using a poly-L-lysine solution should be considered10.\nMonolayer scratching\nWorking in a sterile environment, scratch the culture monolayer by firmly dragging the narrow end of a 20 µL or 200 µL sterile micropipette tip, depending on the desired scratch width. Keep the tip perpendicular to the culture surface to maximize gap homogeneity.",
    "Place the culture plates over a dark surface to clearly monitor the cell monolayer. If needed, perform two perpendicular scratches (cross-shaped) on each well to study up to 4 migration areas.\nWash detached cells by gently removing culture medium and gently adding fresh serum-free medium. Repeat two times, or until most unattached cells have been removed.\nExperimental procedure and data collection\nTake up to 4 pre-treatment reference images centered on the scratch gap from each well using an inverted phase-contrast microscope incorporating a CCD camera. Select interest areas by aligning the edge of microscope field to the adjacent intersection of scratches.\n\t\tNOTE: Typically, images are acquired using a 10x magnification and a 1,280 x 1,024 pixel image size. Selecting interest areas as described above helps for easy localization and validation of up to 4 measurements per well.\nOnce all the images are acquired, designate treatment wells; exchange the medium in the wells with fresh medium that contains selected treatments.\n\t\tNOTE: Alternatively, for chemicals or compounds that do not disturb culture medium homogeneity, treatments can be inoculated directly into the culture medium.\nIncubate the scratched plate (37 °C with a controlled atmosphere containing 5% CO2) until the conditions under observation reach 90% scratch gap closure. Avoid full closure.\n\t\tNOTE: Total gap closure nullifies post-treatment picture collection as reference areas are not detectable and the time reference for gap closing cannot be established. In the case of Mv1Lu or HaCaT cells, 16-19 h are required to reach 90% confluence.\nStop cell migration by fixing the cells; gently replace the experimental culture medium with 1 mL of 4% formalin in PBS. Incubate for 15 min at RT.\nWash the cells to remove excess formalin; gently replace the solution in the wells with fresh PBS. Repeat at least two times.",
    "NOTE: At this stage, after sealing, plates can be stored at 4 °C indefinitely.\nTake post-treatment reference images of each well from the original reference areas captured after scratching. Use the same equipment (inverted optical phase-contrast microscope incorporating a CCD camera) and matching picture settings (magnification and digital resolution/density).\n\t\tNOTE: For cells that migrate individually and fill the gap independently of the formation of a coherent front (e.g., MDA-MB-231 breast cancer human cells), the time-course images may allow the calculation of individual cell migration speeds.\nImage analysis and quantification of migration\nUsing image processing software (e.g., ImageJ), define scratch gap limits and determine the gap surface for up to four measurements in pre-treatment pictures. Record the data as \"pre-treatment gap surface\" (PREGAP). Repeat the same procedure for post-treatment pictures. Record the data as \"post-treatment gap surface\" (POSTGAP).\n\t\t\nOpen the recorded image using ImageJ. In the \"image\" menu, set image type to 8 bit. In the \"process\" menu, go to \"filters\" submenu and apply \"variance\" filtering.\nIn the \"image\" menu, enter \"adjust\" submenu and set threshold to black and white (B&W), make sure \"Dark background\" is not selected. In the \"process\" menu, go to \"binary\" submenu,  and select \"fill holes\".\nIn the \"analyze\" menu, select \"set measurements\" and activate \"area\". Then draw the measurable area following the migrating edge contour thus delimiting the gap.\nIn the \"analyze\" menu, select \"analyze particles\" and record \"total area\" values for the drawn area surface.\nIntroduce PREGAP and POSTGAP total area values in a spreadsheet to quantify absolute migration for each set of individual samples as the difference of gap surface measurements: PREGAP − POSTGAP [Arbitrary units]. Additionally, normalize absolute migration data of each condition to control samples: (SAMPLE / CONTROL) * 100 [%].",
    "NOTE: For cells that migrate individually and fill the gap independently of the formation of a coherent front, (e.g., MDA-MB-231 breast cancer human cells), the absolute migration can be calculated by counting cells invading a central strip either in the control or the treated samples.\nPlot quantification outputs (see Figure 1). Perform statistical analysis if necessary. Consider Student's t-test when comparing two conditions or Analysis of Variance test for greater number of conditions.\n2. Artificial Migration Front Assay for Topographical Studies\nCell monolayer preparation\nWorking in sterile conditions, place one layer of sterilized round coverslips in empty culture plates until the plate's surface is completely covered.\n\t\tNOTE: Up to 12 and 33 coverslips fit on 5 cm and 10 cm diameter plates, respectively.\nOn the culture plate, gently seed an adequate volume of cells at a concentration that allows 100% confluence after 2 or 3 days. Make sure no coverslip overlaps neighboring coverslips and prevent coverslips from floating by applying gentle pressure with a sterile micropipette tip. Refresh the medium every 24-48 h.\n\t\tNOTE: Every cell line must be assayed thoroughly to determine cell concentration and timing required to reach full confluency. Typically for Mv1Lu or HaCaT cells, 2-3 x 106 or 2.5-4 x 106 cells/10 cm-diameter plate, respectively, are seeded. For smaller plates, cell numbers must be scaled down.\nAfter the cells reach confluence, remove the serum-supplemented medium and replace with fresh serum-free medium. Keep the cells in serum-free medium for 24 h before the artificial wound is performed.\n\t\tNOTE: Mv1Lu or HaCaT cells do not have special substrate requirements; however, for cell lines susceptible of detaching spontaneously in serum-free conditions, pre-coating of the culture surface using a poly-L-lysine solution should be considered10.\nMonolayer wounding",
    "Using sterile tweezers, gently move a coverslip to a clean 10 cm plate containing fresh serum-free medium. Avoid damaging the monolayer by holding the coverslip at the periphery with tweezers. Avoid excessive pressure that could result in coverslip breakage.\nCreate artificial wounds by dragging a sterilized razor blade in a transverse line over the center of the coverslips. Drag 3-4 mm back-and-forth, in order to completely remove the central monolayer strip. Make sure no cell debris remains attached to the wounded edges.\n\t\tNOTE: On a 12-mm diameter round coverslip, the incision is made at the mid of the coverslip. Make sure to leave a streak of cells opposite the main front large enough (at least 2 mm wide) to avoid tilting of the coverslip in the following steps.\nTransfer wounded coverslips with cells facing up, to a clean 6-well plate containing at least 2 mL fresh serum-free medium. Fit up to 4 wounded coverslips/well.\nGently wash two times using fresh serum-free medium to remove detached cells.\nExperimental procedure and sampling\nGently exchange the medium in the wells with fresh medium that contains selected treatments.\n\t\tNOTE: Alternatively, for chemicals or compounds that do not disturb culture medium homogeneity, treatments can be inoculated directly into the culture medium. Proceed with caution to avoid any potential cell detachment.\nKeep the plate inside a cell incubator (37 °C, 5% CO2) for the desired experimental timing.\nStop cell migration by fixing the cells; gently replace the experimental culture medium with 1 mL of 4% formalin in PBS. Incubate for 15 min at RT.\n\t\tNOTE: For time course experiments, remove the samples from the culture plate and fix them in a separate plate to avoid formalin fumes affecting the other, ongoing experimental conditions.",
    "Wash the cells to remove excess formalin; gently replace the solution in the wells with fresh PBS. Repeat at least two times.\n\t\tNOTE: At this stage, after sealing, plates can be stored at 4 °C indefinitely.\nImmunofluorescence (IF) and topological analysis\nPerform IF staining and imaging on individual coverslips as described elsewhere3,4,11.\n\t\t\nPermeabilize for 10 min by immersing coverslips in a 0.3% Triton X-100 solution in PBS.\nBlock for 30 min using the following blocking solution: 0.3% Bovine Serum Albumin; 10% Fetal Bovine Serum; 5% skim milk; 0.3% Triton X-100 solution in PBS.\n\t\t\tNOTE: Blocking solution without milk can be prepared in advance and stored at -20 °C.\nIncubate for 1 h at room temperature inside a moist chamber, with primary antibody diluted in milk-free blocking solution. Place the coverslips upside-down in the 15 µL antibody solution to ensure proper distribution.\n\t\t\tNOTE: The antibody working dilution is variable and will depend on the antibody in use. For example, the Rabbit anti-c-Jun antibody requires a 1/100 dilution.\nWash three times by dipping the coverslips in a in 0.1% Triton X-100 solution in PBS.\nIncubate the coverslips in secondary antibody diluted in milk-free blocking buffer for 30 min.\n\t\t\tNOTE: The antibody working dilution is variable and will depend on the antibody in use. For example, the Goat-anti-Rabbit (488) requires a 1/400 dilution for optimal resolution. Other labeling reagents such as phalloidin and Hoechst-33258 can be added to the incubation buffer at this stage.\nWash three times by dipping the coverslips in 0.1% Triton X-100 solution in PBS.\nMount the coverslips upside-down in a 10 µL mounting media drop (e.g., Vectashield) placed on a microscope slide. Leave the slides in the dark at room temperature overnight for the mounting medium hardening. Afterwards, store at 4 °C in the dark indefinitely.",
    "Obtain either epifluorescence or confocal microscopy images of structural changes occurring at the migrating front edge.\n\t\tNOTE: Topological studies can be performed by tiling pictures from the migrating front to the inner monolayer. Semi-quantitative studies are possible by software based analysis on local fluorescence intensities.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}