{
  "id": 10823,
  "origin_website": "Jove",
  "title": "Fully Automated Centrifugal Microfluidic Device for Ultrasensitive Protein Detection from Whole Blood",
  "procedures": [
    "NOTE: Blood was drawn from healthy individuals and was collected in a blood collection tube. Written informed consent was obtained from all volunteers.\n1. Fabrication of TiO2 NF Mat\nPreparation of precursor solution22\nDissolve 1.5 g of titanium tetraisopropoxide (TTIP) in a mixture of ethanol (99.9%, 3 ml) and glacial acetic acid (3 ml) and mix the solution at RT (25 °C) for 30 min on a magnetic stirrer.\nDissolve 11 wt% of polyvinyl pyrrolidone (PVP) in 3.64 g of ethanol (99.9%) and stir the solution at 65 °C for 1 hr using a hot-plate magnetic stirrer.\nCombine and stir the two solutions at 65 °C for 4 hr on a hot-plate magnetic stirrer.\nElectrospinning\nLoad the prepared solution into a syringe connected to a stainless steel needle of 200 μm inner diameter. Pour the solution directly into the syringe after removing the plunger.\nIntroduce the solution constantly at a flow rate of 0.3 ml/hr for 10 min onto a Si wafer (2 cm x 2 cm) placed on a grounded substrate at a high DC voltage (15 kV). During the electrospinning, set the distance between the needle and the grounded substrate to 10 cm.\nCalcination of the NF mat\nPlace the NF mat in a furnace and increase the temperature up to 500 °C with a ramping rate of 3 °C/min under high-vacuum condition (5 x 10-5 torr).\nMaintain the temperature at 500 °C for 3 hr. Cool down the temperature of the samples to the RT (25 °C) in the furnace.\n2. Integration of TiO2 NF Mat into a Centrifugal Microfluidic Disc\nFabrication of a disc",
    "Use the 3D designing software (e.g., SolidWorks or similar) to depict chambers, channels, or valves of each layer of disc. Convert the design files to computer numerical control (CNC) code using code generating software (e.g., Edgecam or similar). Use the softwares according to the instruction manual.23,24 Note: The typical channel dimensions used in this device are 1.0 mm x 0.3 mm (width x depth).\nOpen the operating software of CNC milling machine (e.g., DeskCNC or similar) and load CNC code to the operating software and click the following in order: \"AUTO\" -> \"G CODE OPEN\" -> Select the generated CNC code.\nAttach the PC plate on the CNC milling machine: use 1 mm PC plates for the top layer and 5 mm PC plates for the disc layer. Run the CNC milling machine to cut each layer of the disc by clicking the \"START\" button.\nTransfer of TiO2  NF mat onto the disc\nPlace a silicon substrate and a small petri dish containing 40 µL of (tridecafluoro-1,1,2,2-tetrahydrooctyl)-1-trichlorosilane in a vacuum chamber under vacuum for 30 min. The fluorosilane vaporizes and gets coated on the substrate.\nMix polydimethylsiloxane (PDMS) pre-polymer with a curing agent in a 10:1 ratio and degas in a vacuum chamber. Spin-coat the PDMS onto a silicon substrate at 650 rpm for 60 sec.\nCure the PDMS coated on silicon substrate in an oven at 65 °C for 10 min to achieve an adherent state.\n\t\tNOTE: Curing time can be varied depending on environmental conditions, and adhesion force can be tested by a tack test using a rheometer.",
    "Transfer the TiO2 NF mat prepared by electrospinning and calcination onto the PDMS-coated silicon using a tweezer. Then, manually apply a conformal pressure on the transferred TiO2 NF mat with a flat object (e.g., glass slide) and remove the object. Put this sample in the oven at 65 °C for 4 hr or at 80 °C for 1 hr to cure the PDMS layer completely.\nCoat binding reaction chambers in the disc with 20 µl the PDMS/curing agent mixture (10:1), which acts as an adhesive layer to attach TiO2 NF mat onto the disc.\nDispense 50 µl of ethanol (99.9%) on the TiO2 NF mat on the PDMS layer, cut the NF mat with a punch hole of 6 mm diameter, and transfer the cut TiO2 NF mat to the binding reaction chambers coated with 20 µl of the PDMS in the previous step.\n\t\tNOTE: In this step, ethanol will be helpful to detach the cut TiO2 NF mat from the Si substrate.\nIncubate the TiO2 NF mat integrated disc in the oven at 65 °C for 4 hr or at 80 °C for 1 hr to cure the PDMS completely.\nSurface modification of the TiO2  NF mat on the disc \nPrepare 1% v/v solution of (3-glycidoxypropyl)methyldiethoxy silane (GPDES) in ethanol (99.9%).\nTreat the TiO2 NF mat integrated disc with oxygen plasma at 140 W, 50 sccm oxygen flow for 180 sec. Dispense 100 μl of GPDES solution on each nanofiber mat and incubate at RT (25 °C) for 2 hr.",
    "Wash the substrates briefly by dispensing ethanol (99.9%) using a wash bottle, then remove the ethanol completely by inverting the disc and blotting it against a clean wipe. Cure at 80 °C for 1 hr. Wash twice with ethanol (99.9%) in the same manner as stated above, to remove the physically adsorbed and unbound GPDES molecules.\nBlow dry with a nitrogen stream, dry under vacuum.\n\t\tNOTE: The disc can be stored in a sealed container at RT (25 °C) until use.\nImmobilization of antibodies on the surface\nMake a solution of 200 μg/ml of capture antibodies (monoclonal mouse antihuman hsCRP or monoclonal mouse anti-cTnI) by diluting the antibodies with a phosphate buffered saline (PBS) buffer (pH 7.4). Dispense 5 μl of the solution onto each NF mat in a disc using a micropipette. See materials list for more information about the antibodies.\nKeep the discs in a humidified chamber and incubate at 37 °C for 4 hr. Wash the antibodies coated NF mat with 0.1% BSA-PBS buffer. Fill the chamber with 100 μl of wash buffer using a micropipette, remove the buffer by aspirating or decanting. Finally, invert the disc and blot it against a clean wipe, and then assemble the disc.\nDisc assembly\nDraw the design of the disc on double-side adhesive tape using a CAD program (e.g., AutoCAD or similar). Load the CAD design to the cutting plotter.\nCut the double-side adhesive tape using the cutting plotter. Peel off one protection layer of double adhesive tape and attach it on top of the disc layer. Peel off the other protection layer and attach the top layer on the disc layer.",
    "Load the preliminarily assembled disc in the pressing machine and precisely align top/adhesive/disc layers using align marks in each layer to connect each valve, channel, and chambers. Apply conformal pressure using the pressing machine.\n3. Immunoassay\nFill the chambers with 1% BSA-PBS buffer using a micropipette and incubate the disc at 37 °C for 1 hr. Remove the buffer by aspiration using a micropipette. Perform this step to block the un-reacted sites and to reduce non-specific adsorption of protein in a disc.\nWash twice with 0.1% BSA-PBS by filling and aspirating the chambers using a micropipette.\n\tNOTE: At this stage the disc can be stored at 4 °C until use.\nLoad 10 μl of antigen-spiked whole blood or CRP-free serum for CRP detection on the disc using a micropipette. For making the calibration graphs, use concentrations of CRP from 1 pg/ml to 100 ng/ml; and cTnI from 10 pg/ml to 100 ng/ml.\n\tNOTE: Due to the higher levels of CRP in whole blood, which is usually in µM range, CRP-free serum was used to demonstrate the low detection limit of the device.\nSpin the disc at 3,600 rpm (391 x g) for 60 sec to separate the red blood cells.\nOpen valve #1 by laser irradiation, and transfer 4 μl of the supernatant plasma to the chamber containing 8 μl of detecting antibodies conjugated with HRP by spinning the disc at 2,400 rpm for 3 sec.\n\tNOTE: The general processes for valve actuation and visualization of disc operation are described in detail in a previous report.21\nApply a mixing mode (15 Hz s-1, 15°) for 5 sec for binding of the protein and detection antibodies.",
    "Open valve #2, and transfer the mixture prepared in step 6 to the binding reaction chamber (2,400 rpm, 3 sec). Then, apply a mixing mode (60 Hz s-1, 2°) for 20 min to achieve an immunoreaction between the mixture and the binding antibodies on the TiO2 NFs. After the reaction, open valve #3 and transfer the residual mixture to the waste chamber (2,400 rpm, 10 sec).\nTransfer the washing buffer (600 µl) to the binding reaction chamber by opening valve #4 and spinning the disc (2,400 rpm, 4 sec). Then apply a mixing mode (30 Hz s-1, 30°) for 120 sec to wash the TiO2 NFs in the chamber.\nWash the TiO2 NFs twice more by following same condition of step 3.8, and remove the residual washing buffer completely by spinning the disc at 2,400 rpm for 20 sec. Then, close the valve #5.\nFor the chemiluminescent reaction, apply a mixing mode (30 Hz s-1, 2°) for 1 min after transferring the chemiluminescent substrate solution to the binding reaction chamber by opening valve #6 and spinning the disc at 2,400 rpm for 10 sec subsequently.\nTransfer the reacted substrate solution to the detection chambers by opening valve #7 and spinning the disc at 2,400 rpm for 10 sec.\nMeasure chemiluminescence signals from the reacted substrate solution using a photomultiplier tube (PMT) module equipped detection system.",
    "NOTE: The detection system is a custom-built machine using the following parts: step motor, optomechanical components, translation stages, and commercially available PMT. The optomechanical parts and step motor are assembled to hold the device, and the motor can rotate the disc. The detection is performed by PMT fixed on the optomechanical parts, and it is located above the detection chambers of the device. By manipulating the step motor, the detection chambers are aligned right below the detection zone of PMT.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}