{
  "id": 11285,
  "origin_website": "Jove",
  "title": "Increasing cDNA Yields from Single-cell Quantities of mRNA in Standard Laboratory Reverse Transcriptase Reactions using Acoustic Microstreaming",
  "procedures": [
    "1. Micromixing an RT Reaction\nBefore performing an RT reaction with micromixing, equilibrate the micromixer to the desired temperature of the RT reaction.\n\t\t\nPlace the micromixer inside a 37°C (or the temperature recommended by \tthe RT supplier) incubator for at least 1 hour prior to the onset of the RT \treaction.\nSet up the RT mix according to the reverse transcriptase supplier's (e.g. MMTV-RT from Promega, Omniscript from Qiagen) instructions, except use single-cell amounts of input total RNA (e.g. 0.1-1pg/μl), instead of the ng-μg amounts recommended by suppliers.\n\t\t\nWe use standard sterile, nuclease-free 200μL thin-walled PCR tubes.\nPosition RT tubes securely into the micromixer as soon as they are ready for mixing.  The micromixer should remain inside the 37°C incubator for the duration of the RT reaction.\nSelect the appropriate frequency and amplitude of micromixing.  In this example we use 150Hz. \nSwitch the micromixer on and leave it on for the entire duration of the RT reaction (60 minutes).\nSwitch the micromixer off and take the RT tubes out once the RT reaction is complete. \nPlace the RT tubes on ice and proceed as normal with further applications such as quantitative Polymerase Chain Reaction (qPCR or real-time PCR).\n2. Representative Results:",
    "The benefit of micromixing in the context of RT reactions is an increase in cDNA yield relative to when other mixing methods (e.g. shaking, vortexing or trituration) are used.  This can be seen, for example, upon subsequent analysis of the cDNA using quantitative Polymerase Chain Reaction (qPCR or real-time PCR).  Figure 2A illustrates the effects of micromixing for the first 5 minutes (blue, \"micromixed5\") or the entire 60 minutes (red, \"micromixed60\") compared with trituration of the RT reaction immediately prior to the RT incubation (black, \"trituration\").  In this case the volume of the preceding RT reaction was 25μL and it contained 2.5pg of total RNA.  qPCR traces using primers designed to detect cDNA representing Nurr-1 mRNA are shown above, and the means ±SEMs of the number of cycles to reach 50% maximum fluorescence in 3 repeats of this same experiment are plotted below.  The asterisk denotes a statistically significant difference (one-way ANOVA with Tukey multiple comparisons).  Note that micromixing for the first 5 minutes of the preceding RT reaction produced a non-significant improvement over trituration whereas micromixing for the entire 60 minutes of the preceding RT reaction produced a significant improvement over trituration, the magnitude of which was equivalent to approximately 15 qPCR cycles, on average.",
    "The benefit of micromixing can also be seen in melting curve analysis of the subsequent qPCR products obtained.  In the experiment illustrated in Figure 2B, micromixing for the entire 60 minutes of the preceding RT reaction resulted in a consistent qPCR signal in duplicate samples (Figure 2Ba, 2 red traces), whereas micromixing for the first 5 minutes or trituration only produced inconsistent qPCR traces (Figure 2Ba, 2 blue traces and 2 black traces, respectively). The grey traces are negative controls (\"neg.\") in which cDNA was left out of the qPCR reaction.  When the qPCR products from this experiment were denatured by ramping their temperature (i.e. melting curve analysis) it was apparent that appropriate PCR products (i.e. an amplicon that was identical to that obtained when much higher concentrations of mRNA were reverse transcribed and amplified by qPCR, data not shown) were present only following RT reactions that had been micromixed for 60 minutes (Figure 2Bb, 2 red traces).  All the others (i.e. micromixed5, trituration and negative controls) generated alternative amplicon products (e.g. primer dimers).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3144/3144fig1.jpgFigure 1. Flow diagram of the protocol for applying micromixing to standard laboratory RT reactions.  More detailed descriptions of the physical principle involved, the micromixer and how to build an in-house micromixer are provided in references 13,14",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/3144/3144fig2.jpgFigure 2.Representative qPCR data illustrating the benefits of micromixing applied to preceding RT reactions comprising single-cell quantities of mRNA in otherwise standard laboratory RT reactions.  A  Example qPCR traces detecting cDNA representing mRNA encoding the Nurr-1 gene.  The preceding RT reactions contained 2.5pg of total RNA in a volume of 25μL and were performed in an incubator at 37°C for 60 minutes.  RT reactions were mixed by trituration of the RT mix prior to incubation (black traces, \"trituration\"), micromixed during the first 5 minutes of the RT reaction (blue traces, \"micromixed5\") or micromixed for the entire 60 minutes of the RT reaction (red traces, \"micromixed60\").  Means ± SEMs of the number of qPCR cycles required to reach 50% maximum fluorescence are plotted below for n=3 repeats of this experiment.  Asterisk indicates a significant difference (one-way ANOVA with Tukey multiple comparisons).  B  Another qPCR experiment examining Nurr-1 cDNA product, this time following RT reactions containing 25pg of total RNA in a volume of 25μL.  qPCR traces (a) as well as melting curve analysis of the qPCR products obtained (b) are shown for the different mixing conditions.  Negative controls in which no cDNA was included in the preceding RT reaction are also included (gray traces, \"neg.\").  RT reactions with much higher concentrations of mRNA were also performed and produced melting curve peaks (data not shown) identical to those in (b) for micromixed60 (red traces) samples.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}