{
  "id": 17521,
  "origin_website": "Jove",
  "title": "Fluorescent Leakage Assay to Investigate Membrane Destabilization by Cell-Penetrating Peptide",
  "procedures": [
    "1. Preparation of Large Unilamellar Vesicles (LUVs)\nPrepare LUVs for their use as cell membrane mimics for fluorescence leakage assay.\nMix with a Hamilton glass syringe phosphatidylcholine (DOPC, 786.11 g/mol), sphingomyelin (SM, 760.22 g/mol) and Cholesterol (Chol, 386.65 g/mol) at the molar ratio 4:4:2. The lipid solution is obtained from a stock solution of each lipid solubilized in a methanol/chloroform (3/1; volume/volume) solvent at 25 mg/mL in a 25 mL glass round-bottom flask. Based on 4 µmol of DOPC, 4 µmol of SM, and 2 µmol of Chol, the lipid solution is obtained from stock solution by mixing 126 µL, 117 µL, and 31 µL, respectively.\n\tCAUTION: Methanol is a toxic and inflammable solvent and chloroform is toxic and carcinogenic. Both should be handled with the appropriate protection under a hood.\nEvaporate methanol/chloroform using a rotary evaporator under vacuum during 45-60 min at 60 °C until formation of a dried lipid film.\nPrepare two stock HEPES buffer solutions. Prepare HEPES buffer 1 by mixing 20 mM HEPES (238.3 g/mol) and 75 mM NaCl (58.44 g/mol) and adjust pH to 7.4. Prepare HEPES buffer 2 by mixing 20 mM HEPES and 145 mM NaCl and adjust pH to 7.4. HEPES buffers can be stored at 4 °C for 1 month.\n\tNOTE: It is recommended to check the osmolarity of the buffers using an osmometer.\nPrepare lipid hydration solution by dissolving membrane impermeable fluorescent dye-quencher couple, 8-aminonaphthalene-1, 3, 6-trisulfonic acid, disodium salt at 12.5 mM (ANTS, 427.33 g/mol) and p-xylene-bispyridinium bromide at 45 mM (DPX, 422.16 g/mol) in HEPES buffer solution. Mixing ANTS with DPX leads to a yellow-colored solution. To achieve the concentrations of 12.5 mM of ANTS and 45 mM of DPX, dissolve 21.4 mg and 76 mg, respectively in 4 mL of HEPES buffer 1.",
    "NOTE: Lipid hydration solution can be stored for 2 weeks at 4 °C by wrapping the tube with aluminum foil.\nReconstitute multilamellar vesicles (MLV) by resuspending the dried lipid film with 1 mL of the lipid hydration solution and by vortexing until dissolution of the dried lipid film. Ensure that the solution is completely solubilized as small lipid aggregates will negatively impact the preceding steps. Also, check the wall of the glass round-bottom flask to ensure that there is no remaining lipid film.\n\tNOTE: The solution will appear opalescent and light yellow after the solubilization.\nSubject the vesicles to five freeze/thaw cycles to obtain unilamellar vesicles. Perform each cycle by putting the glass round-bottom flask for 30 s in liquid nitrogen for freezing step, then leaving it in a water bath for 2 min for thawing step.\n\tNOTE: The temperature of the bath water should be 5-10°C higher than the melting temperature of the lipids.\nPrepare lipid extruder by inserting two filter supports preliminary humidified with HEPES buffer in each polytetrafluoroethylene (PTFE) extruder piece placed in the metal extruder canister.\nPut a HEPES humidified polycarbonate membrane (0.1 µm pore size, 25 mm diameter) on the top of one filter support.\nAssemble the two metal extruder canisters and screw them.\nPlace the assembled extruder in the holder and introduce a 1 mL syringe in the appropriate hole at the extremity of each polytetrafluoroethylene extruder piece. Extrusion corresponds to the passage of the liquid tested from one syringe to the other through the polycarbonate membrane.\nTest the extruder with 1 mL of HEPES buffer loaded in one of the 1 mL syringe to ensure that there are no leaks or problems.\nReplace the 1 mL HEPES buffer with the MLV sample.",
    "Perform extrusion by passaging the MLV sample from one syringe to the other through the polycarbonate membrane at least 21 times to obtain uniform LUVs of same size.\n\t​NOTE: Extrusion should be performed at a temperature higher than the melting temperature of the lipid mixture.\n2. Purification of LUVs\nPrepare a column purification to remove non-encapsulated ANTS and DPX excess.\nIntroduce cross-linked dextran gel (G-50) resuspended in aqueous medium with 0.01% NaN3 (65 g/mol) in a liquid chromatography column (Luer Lock, Non-jacketed, 1.0 cm x 20 cm, bed volume 16 mL) up to 1 cm below the top of the colorless part of the column.\nOpen the tap and let the liquid flow to settle the cross-linked dextran gel.\nWash the column by eluting with 20 mL of HEPES buffer 2 and discard the output flow of the column.\nClose the tap once the dead volume of solvent above the column is minimized (<100 µL) but sufficient to avoid any drying of the cross-linked dextran gel.\nPlace the freshly extruded LUVs (yellow) on the column and let them enter into the cross-linked dextran gel.\nContinuously add HEPES buffer 2 to the column to perform the LUV purification.\nElute approximately 2 mL of HEPES buffer 2 (do not forget to regularly fill the top of the column to avoid drying the cross-linked dextran gel): the free yellow ANTS and DPX solution migrates slower than the liposomes.\nStart collecting purified LUVs in tubes (1.5 mL).\nObserve the drops of eluent from the column and when they become opalescent, they contain liposomes. Change the tube to recover the LUV-containing fraction.\nElute until the drops are no longer opalescent (~1 mL). Afterwards, elute another 0.5 mL in a separate fraction and then stop eluting.",
    "NOTE: Standards are now available in a wide range of molecular weights, as kits or individual molecular weights to calibrate the elution volume of the LUVs.\nWrap the tubes with the LUVs in aluminum foil to avoid bleaching of the fluorescence dye.\nWash the column with 20 mL HEPES buffer 2.\nThe LUVs can then be stored for a week at 4 °C.\n\t​NOTE: As LUV stability might depend on LUV concentration and composition, as well as on ionic strength, the size of the LUVs should be controlled using a dynamic light scattering (DLS) instrument (see section 4. Characterization of LUV Size and Homogeneity) before each test.\n3. Quantifying the concentration of LUVs\nEstimate LUV concentration by a phospholipid quantification kit, which enables the evaluation of choline concentration19. This assay might be applied when phospholipids with choline containing polar head is substantial (>50% of the LUVs).\nPrepare the color reagent by dissolving 18 mg of chromogen substrate in 3 mL of buffer provided.\nLoad a polystyrene cuvette, 10 x 10 x 45 mm, with 3 mL of color reagent.\nUse the pure color reagent as blank condition (Blank). Add 20 µL of LUV sample (Test) or 20 µL of standard solution of known choline concentration (Standard).\nMix well and incubate for 5 min at 37 °C all conditions (Blank, Test, and Standard).\nMeasure the absorbance (optical density, OD) of the test sample and standard solution with the blank solution as the control at 600 nm with a spectrophotometer.\nCheck the OD values which enable to estimate the lipid concentration of the LUVs, C[LUV], in choline equivalent compared to the standard of known concentration.\nPerform the calculation using the following equation:\n\tC[LUV] (mol / l) = (OD Sample / OD Standard) x C[Standard] (mol / l)",
    "​NOTE: The phospholipid quantification kit provided a Choline Chloride (139.6 mg/l) standard solution at 54 mg/dL corresponding to molar concentration of C[Standard] = 3.87 mmol/L. OD Sample and OD Standard are the absorbances measured at 600 nm for the LUV and Choline solutions, respectively.\n4. Characterization of LUV size and homogeneity\nPerform a measurement using a DLS instrument in order to determine the LUV size (in nm) and polydispersity index (PdI).\nProgram the appropriated \"standard operation procedure\" (SOP) by indicating the viscosity of the solvent/buffer and the used cuvette.\nPlace 500 µL of the LUV solution in a polystyrene semi-micro cuvette.\nInsert the polystyrene semi-micro cuvette in a DLS instrument.\nAt room temperature, measure the size distribution in terms of mean size (Z-average) of the particle distribution and of homogeneity (polydispersity index, PdI).\nAll the results are obtained from two independent measurements performed each in three repetitive cycles.\n\t​NOTE: Standard values for LUVs will be a mean size of 137 ± 7 nm with a PdI of 0.149 ± 0.041.\n5. Preparing peptide solutions\nPrepare a stock solution of the peptide, which should be analyzed for the leakage assay.\nDissolve peptide powder (>95% purity) in pure water (e.g., 1 mg peptide in 500 µL pure water).\n\tNOTE: It is recommended to dilute peptides in pure water and to avoid dimethyl sulfoxide (DMSO) solubilization, which could induce artifacts (e.g., membrane permeabilization20).\nVortex the peptide solution for 5 s.\nSonicate the peptide solution in a water sonication bath for 5 min and then centrifuge for 5 min at 12,225 x g. Collect the supernatant for concentration determination.\nMeasure the absorbance at 280 nm of three independent peptide dilutions and then calculate peptide concentration using its molar extinction coefficient ε (depending on tryptophan and tyrosine content in the peptide sequence) and Beer-Lambert rule.",
    "NOTE: If the peptide contains tryptophan and tyrosine, the molar extinction coefficient ε is computed on the basis of Tryptophan ε = 5,690 M-1cm-1 and Tyrosine ε = 1,280 M-1cm-1. If the peptide sequence contains no tryptophan or tyrosine, other colorimetric assay could be performed to measure the concentration (e.g., BCA or Bradford).\nDilute the peptide solution in pure water to a final solution of 100 µM and store at 4 °C.\n\t​NOTE: In pure water, no peptide degradation occurs during the 4 °C storage. However, peptide concentration should be measured every 2 weeks to ensure that no water evaporation occurs.\n6. Fluorescence leakage assay\nFluorescence leakage assay is measured on a spectrofluorometer at room temperature. Excitation and emission wavelength are fixed at Ex = 360 nm ± 3 nm and Em = 530 nm ± 5 nm, respectively.\nDilute LUVs in 1 mL HEPES buffer 2 to a final concentration of 100 µM in a quartz fluorescence cuvette. Add a magnetic stirrer to homogenize the solution during experiment.\nMeasure the LUVs alone during the first 100 s, between t = 0 s and t = 99 s in order to access the background fluorescence.\n\tNOTE: LUVs alone could also be measured during the whole experiment (15 min) in order to access background fluorescence and potential leaks.\nThereafter, measure leakage as an increase in fluorescence intensity upon addition of aliquots of peptide solution for the next 900 s (15 min). This protocol is carried out for each concentration of peptide tested from 0.1 µM to 2.5 µM.\nFinally, 100% fluorescence was achieved by solubilizing the LUVs by addition of 1 µL of Triton X-100 (0.1%, v/v), resulting in the completely unquenched probe between t = 1,000 s and t = 1,100 s.\n7. Quantification of the leakage",
    "Suppress values obtained after t = 1,090 s in order to keep the same number of points for each tested condition.\nCalculate the minimal fluorescence, Fmin, by making the average of 50 points between t = 0 s and t = 49 s (LUVs alone).\nCalculate the maximal fluorescence, Fmax, by making the average of 50 points between t = 1,041 s and t = 1,090 s (LUVs with Triton X-100).\nCalculate the leakage percentage (%Leak) at each time point (t = x), according to the following equation:\n\t%Leak(t=x) = (F(t=x) - Fmin) / (Fmax - Fmin) x 100\nCalculate the average and standard deviation for values obtained with different LUV preparation (n ≥ 2) for the same condition.\nPlot the leakage percentage, %Leak(t=x), in function of time (s).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}