{
  "id": 17294,
  "origin_website": "Jove",
  "title": "Dynamic Continuous Blood Extraction from Rat Heart via Noninvasive Microdialysis Technique",
  "procedures": [
    "The animal protocol has been approved by the Administrative Committee of Chengdu University of Traditional Chinese Medicine (Record number: 2021-11). Specified pathogen-free male Sprague Dawley (SD) rats (8-10 weeks, 260-300 g) were raised in independent ventilation cages, maintaining the laboratory environment at 22 °C and 65% relative humidity, and were used for the present study. The animals were obtained from a commercial source (see Table of Materials). All rats were habituated to adaptive feeding for 1 week with free water and diet during the period.\n1. Experimental preparation\nAssemble the equipment involved in microdialysis of blood sampling (see Table of Materials), as shown in Figure 1.\nPrepare anti-coagulant citrate dextrose solution (ACDs), containing 3.50 mmol/L of citrate, 7.50 mmol/L of sodium citrate, and 13.60 mmol/L of glucose, as the perfusion fluid for microdialysis blood collection (see Table of Materials).\nBefore use, filter the ACDs with a 0.22 µm membrane filtration unit and remove bubbles ultrasonically. Keep ACDs at 37 °C to reduce the stimulation for SD rats.\n2. Patency inspection of microdialysis piping system\nAttach the inlet of the probe of the dialysis unit with the syringe needle, the tubing adapter, and the fep tubing (see Table of Materials).\n\tNOTE: The blue end of the microdialysis probe is for the fluid influx, and the transparent end is for the fluid outflow.\nCheck the patency of the microdialysis piping system by perfusing ACDs18 into the piping system at a speed of 2 µL/min.\n\t​NOTE: If ACDs flow from the sample collection site, the unimpeded microdialysis system can be used for further cardiac blood collection. If not, the blood probe must be checked for broken leaks or whether the pipe-pipe joint was sealed.\n3. Microdialysis probe implantation",
    "Anesthetize the rats with 2% isoflurane in an air-oxygen mixture of 0.6 L/min, fasten the thoroughly unconscious rats on the operating table, and maintain the body temperature at 37 °C using an animal temperature maintainer (see Table of Materials).\nRemove the fur from the neck with an electric shaver and disinfect the surgical site with three alternating rounds of betadine and 70% alcohol. Inject bupivacaine (1.5 mg/kg) into the rat. Expose the right jugular vein by blunt dissection of soft tissue and perivascular fascia through a 1.5 cm incision along the midline of the neck.\n\tNOTE: All surgical instruments and tools used in the experiment should be sterilized in advance by autoclaving. Use sterile gloves and surgical drapes. The whole experimental operation should be carried out in a sterile environment. Follow local animal use guidelines for anesthesia and analgesia regimen.\nMake a detachable slipknot using a 4-0 surgical suture in the right jugular vein at the distal end of the heart to temporarily block blood flow, and make a 1.5 cm incision in the right jugular vein near the heart.\nInsert a needle-shaped catheter stylet (length 25 mm, diameter 0.7 mm, see Table of Materials) into the right jugular vein toward the proximal end of the rat heart, insert the blood microdialysis probe (total probe length 24 mm, membrane length 10 mm) in a catheter, and implant the probe with ophthalmic forceps along the oblique incision of the catheter stylet19.\nRemove the guided catheter stylet and fully immerse the semi-permeable membrane of the probe (membrane length 10 mm, membrane diameter 0.5 mm) in the right jugular vein. Unravel the detachable slipknot at the distal end of the heart to restore blood flow in the right jugular vein.",
    "Ligature the probe with the right jugular vein using 4-0 surgical sutures and subcutaneously thread the probe tail tube through the back of the neck. See Figure 2 for specific probe implantation steps.\n\t​NOTE: The molecular cut-off by the blood microdialysis probe used in this study is >20 kD. The collected blood samples contain substances with a molecular weight of less than 20 kD.\n4. Microdialysis sampling\nA week after the microdialysis probe implantation, rats recovering from surgical trauma undergo microdialysis sampling. Place the awake rat in a free-moving tank (see Table of Materials) and connect the probe to the microdialysis system. Equilibrate the probe dialysis membrane by irrigating ACDs with a rate of 2 µL/min for 1 h.\nCollect microdialysis blood samples at a flow rate of 2 µL/min and temporarily keep them in a 4 °C fractional container.\n\t​NOTE: The obtained blood samples could be tested directly by centrifuging at 20,000 x g for 10 min at room temperature. Or it could be stored at -80 °C for the following testing. When collecting samples, it is important always to observe whether the probe prolapse and/or leak out.\n5. Post-sampling operation\nAnesthetize the SD rats with 2% isoflurane in an air-oxygen mixture at 0.6 L/min.\nDissect to re-confirm that the probe is in the right jugular vein. Remove the microdialysis probe from the right jugular vein and put it into ultrapure water.\nFinally, euthanize the rats by inhalation of 5% isoflurane.\nConnect the probe to the pipeline and rinse overnight at a rate of 2 µL/min with ultrapure water to completely wash out the residual salt in the pipe and probe.\nRemove the probe and soak it in ultrapure water. Store at 4 °C to prevent the probe dialysis membrane from contracting.",
    "NOTE: If the volume of dialysis fluid is inconsistent with the volume of perfusion fluid, the probe may be blocked by coagulated blood. The probe can be placed in the pancreatic protein solution until the visible substance flakes off from the tip of the probe membrane.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}