{
  "id": 3503,
  "origin_website": "Cell",
  "title": "Prospective isolation of neural stem and progenitor cells from the developing human brain",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStep 1: Tissue dissociation\nTiming: 5 h\nIn this step, fetal human brain tissue is dissociated into a single-cell suspension using a combination of mechanical and enzymatic digestion. Red blood cells are depleted using a density gradient (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3076-Fig1.jpg\nFigure 1. Dissociation of fetal human brain tissue\n(A) Outline of tissue dissociation workflow.\n(B) Left: typical appearance of non-intact fetal human brain tissue as received. Right: appearance of tissue after mincing.\n(C) Left: Ficoll layering prior to centrifugation: upper layer contains cell suspension, and bottom layer contains Ficoll. Right: Ficoll layering after centrifugation: cells of interest are at the interface, and red blood cells have been pelleted to the bottom.\n(D) Histograms of cell size distribution before and after Ficoll, on two separate donors.\nOptional: If the tissue is intact, perform any dissection of specific brain regions. Our protocol was optimized on gestational week (GW) 16–20 cortical tissue but is applicable to any brain region.\nNote: Fetal human brain tissue can be kept overnight on ice with no significant impact on viability or cell type makeup. Our tissue is generally shipped overnight in Hibernate-A medium.\nTransfer tissue to a 50 mL tube. Spin down the sample at 300 × g for 3 min. Remove supernatant. Note the packed volume of the tissue.\nNote: In our experience, every 10 mL packed tissue volume typically yields ∼2×108 cells. We have used this protocol successfully for as little as 1 cm3 and as much as 25 cm3 of tissue.\nMechanical dissociation.\nTransfer the tissue into a sterile petri dish with 5 mL cold Mincing Buffer. Chop the sample with sterile razor blades, aiming for 1–2 mm sized chunks (Figure 1[href=https://www.wicell.org#fig1]B).",
    "Note: Do not mince the tissue too finely at this stage, as it may adversely affect cell survival.\nTransfer the minced sample into 50 mL tubes, washing the petri dish with additional Mincing Buffer as needed.\nNote: In our experience, one tube per 5 mL packed tissue volume works well.\nSpin down the minced tissue at 300 × g for 3 min. Remove supernatant.\nEnzymatic dissociation in Liberase.\nResuspend the minced tissue in pre-warmed Liberase Enzyme Solution, 30 mL per tube.\nShake the tubes on a thermomixer at 37°C and 750 RPM for 30 min.\nSpin down the cell suspension at 300 × g for 3 min. Remove 20 mL supernatant per tube, leaving behind 10 mL volume for trituration.\nTriturate (i.e., pipette up and down) the cell suspension with progressively smaller-aperture pipettes as detailed below.\nPipette the cell suspension up and down with a 10 mL serological pipette until it goes through smoothly (typically 10–15 strokes).\nNote: If there are still large chunks that have a hard time passing through the pipette, consider shaking in Liberase Enzyme Solution for another 15 minutes.\nAttach a P1000 pipette tip (no filter) to the end of a 10 mL serological pipette, and cut the end off with a sterile razor blade (∼5 mm). Pipette the cell suspension up and down until it goes through smoothly (typically 10–15 strokes).\nAttach a P1000 pipette tip to the end of a 10 mL serological pipette, without cutting off the tip. Pipette the cell suspension up and down until it goes through smoothly (typically 10–15 strokes).\nFill the tube with Wash Buffer, spin down the cell suspension at 300 × g for 3 min, and remove the supernatant.\nEnzymatic dissociation in Accutase.\nResuspend the cell pellet in Accutase Enzyme Solution, 25 mL per tube.",
    "Note: Accutase quickly loses its activity at high temperatures, so avoid prewarming it too early in advance. Do not forget to add DNase to the enzyme solution, as it helps significantly with cell viability.\nShake the tubes on a Thermomixer at 25°C and 750 RPM for 30 min.\nSpin down the cell suspension at 300 × g for 3 min, and remove the supernatant.\nWash the cells with 10 mL Wash Buffer. Spin down the cell suspension at 300 × g for 3 min, and remove the supernatant.\nResuspend the cell pellet in 9 mL Wash Buffer per tube.\nRed blood cell depletion using Ficoll (Figure 1[href=https://www.wicell.org#fig1]C).\nNote: RBC depletion is optional but recommended as it speeds up cell sorting (for some samples, we have observed up to 30% of cells to be RBCs at this step, though this varies widely) (Figure 1[href=https://www.wicell.org#fig1]D). Our Ficoll step will not decrease the yield of neural cells. Alternative RBC depletion methods such as ACK lysis or MACS depletion are feasible, but their effects on cell viability and function have not been tested.\nPrepare one FACS tube per 3 mL of cell suspension.\nNote: We find that skinnier tubes (such as FACS tubes or 15 mL tubes) make it easier to recover cells following Ficoll density centrifugation. Other tube formats will also work.\nAdd 1 mL Ficoll to each tube.\nGently layer 3 mL cell suspension on top of Ficoll for each tube.\nSpin the tubes at 400 × g for 30 min at 25°C. Set the acceleration of the centrifuge to 4 out of 10, and turn the brakes off.\nCritical: For successful separation, is important for the centrifuge to be at room temperature, and for the brakes to be off.",
    "After centrifugation, the red blood cells will have pelleted to the bottom, and the remainder of the cells will be found in a buffy coat at the interface of the two layers (Figure 1[href=https://www.wicell.org#fig1]C).\nCarefully pipette the upper layer and buffy coat and transfer into a new 50 mL tube.\nNote: Be liberal in taking cells from the buffy coat. It is better to recover more cells at the cost of some Ficoll contamination, which will be washed away in the next step anyways.\nFill the tube with Wash Buffer and spin down at 400 × g for 3 min. Remove the supernatant and resuspend in 10 mL Wash Buffer.\nDetermine the cell concentration and viability on a hemocytometer or other automated cell counting machine.\nNote: In our experience, every 10 mL packed tissue volume yields around ∼2×108 cells, though this varies. We reliably obtain 85%–95% cell viability with this protocol.\nStep 2: Fluorescence-activated cell sorting (FACS)\nTiming: 5–8 h\nIn this step, the single cell suspension will be stained with a cocktail of fluorescently-labeled antibodies. Cells will then be analyzed on a flow cytometer, and specific cell types will be gated and sorted.\nStain the cell suspension with fluorescently-labeled antibodies.\nSet aside a small number of cells for an unstained control (1% of total cells).\nOptional: For new markers or initial troubleshooting, it is helpful to include fluorescence-minus-one (FMO) controls, in which a small number of cells is stained for all but one marker, in order to determine the cutoff for positive staining. The gating scheme described here, however, can be drawn based on contours alone.\nNote: We perform staining in FACS tubes, though this is not critical.\nStain the cell suspension by resuspending it in Primary Staining Solution.",
    "We have achieved good results with as much as 2×108 cells/mL Primary Staining Solution. For example, 108 cells should be resuspended in 500 μL Primary Staining Solution.\nNote: While the exact fluorophores can be switched around to accommodate different cell sorters (see troubleshooting 1[href=https://www.wicell.org#sec6.1]), we highly recommend using the same clone of antibodies. For example, we found that the 16A1 but not the αR1 clone of the PDGFRA antibody shows staining.\nIncubate the cells on ice for 20 min. Protect from light.\nWash the cells with 2 mL Wash Buffer. Spin down at 300 × g for 3 min. Remove supernatant.\nResuspend the cell pellet in Secondary Staining Solution.\nIncubate the cells on ice for 20 min. Protect from light.\nWash the cells with 2 mL Wash Buffer. Spin down at 300 × g for 3 min. Remove supernatant. Perform this step twice prior to analysis.\nPropidium iodide is added to the cells immediately prior to analysis.\nPrepare compensation controls.\nPrepare one FACS tube for each fluorophore on the panel, as well as a negative control.\nFor the specific panel described here, this would entail 7 tubes: unstained control, APC, FITC, PE/Cy7, APC/Cy7, BUV395, and PE.\nIn the unstained control tube, add one drop of negative control compensation particles.\nIn each stained tube, add one drop each of (1) Anti-Rat/Anti-Hamster Ig, κ compensation particles, and (2) Anti-Mouse Ig, κ compensation particles.\nIn each stained tube, add 1 μL of any antibody conjugated to the corresponding fluorophore.\nAdd 300 μL Wash Buffer to each tube.\nPause point: If FACS machines are not immediately available, stained cells may be kept on ice for several hours.\nSet up the cell sorting instrument.",
    "Note: The instructions here apply for BD FACSAria II/III/Fusion instruments, and most BD instruments running FACSDiva software. The equivalent steps should be taken for other cell sorting instruments and software.\nRun Cytometer Setup and Tracking (CST) to set voltages.\nSelect all fluorophores used in the staining panel, in addition to PI, forward scatter, and side scatter. Forward and side scatter should be recorded on a linear scale and all other channels on a log scale. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nRun compensation controls and apply the compensation matrix.\nCritical: Proper compensation is essential for high-dimensional flow experiments. This setup should be carefully optimized for the investigator’s specific flow cytometer and optical configuration.\nSet the Drop Delay using Auto Delay.\nAim each of the four streams to ensure they hit the bottom of the collection tube.\nDraw gates.\nNote: When initially learning how to draw gates, we find it helpful to set the plot display type to “Contour” with outliers instead of “Pseudocolor,” as it allows for better visualization of the cutoffs.\nLoad the stained cells and record 105 events for gating.\nDraw the following gates as depicted in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3076-Fig2.jpg\nFigure 2. FACS gating strategy for human NSPCs\n(A) Plot of side scatter area (SSC-A) against forward scatter area (FSC-A), gated on all events.\n(B) Plot of forward scatter height (FSC-H) against forward scatter width (FSC-W), gated on “Cells.”\n(C) Plot of side scatter height (SSC-H) against side scatter width (SSC-W), gated on “Singlets (FSC).”\n(D) Plot of Lineage-PE against Viability-PI, gated on “Singlets (SSC).” Lineage channel consists of CD31, CD34, CD45, CD105, and CD235a.\n(E) Plot of CD24-APC against THY1-FITC, gated on “Live Lineage−.”\n(F) Plot of CXCR4-APC/Cy7 against EGFR-PE/Cy7, gated on “CD24−THY1−/lo.”\n(G) Plot of PDGFRA-BUV395 against EGFR-PE/Cy7, gated on “THY1hi.”\n(H) Plot of CXCR4-APC/Cy7 against EGFR-PE/Cy7, gated on “CD24+THY1−/lo.”",
    "(I) List of numbered gate names, along with the enriched cell type for that gate.\n(J) Graphical summary of purified neural stem and progenitor cell types, their immunophenotypes, and simplified hierarchical organization. Adapted from Liu et al., 2023.1[href=https://www.wicell.org#bib1]\nFrom All Events, plot FSC-A against SSC-A. Gate for Cells (Figure 2[href=https://www.wicell.org#fig2]A).\nFrom Cells, plot FSC-H against FSC-W. Gate for Singlets (FSC) (Figure 2[href=https://www.wicell.org#fig2]B).\nFrom Singlets (FSC), plot SSC-H against SSC-W. Gate for Singlets (SSC) (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: We use a stringent two-step doublet discrimination strategy. Other methods (such as gating FSC-A against FSC-H) will also work.\nFrom Singlets (SSC), plot Lineage-PE against PI. Gate for Live Lineage− (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: The “Lineage” channel includes markers against all vascular (CD31, CD34, CD105) and hematopoietic (CD45, CD235a) lineages. It is used together with PI to select all live cells of neuroectodermal origin.\nFrom Live Lineage−, plot CD24-APC against THY1-FITC. Gate for the following (Figure 2[href=https://www.wicell.org#fig2]E):\nCD24−THY1−/lo, enriched for radial glia and astrocytes.\nCD24+THY1−/lo, enriched for neuron precursors.\nTHY1hi, enriched for oligodendrocyte lineages.\nFrom CD24−THY1−/lo, plot CXCR4-APC/Cy7 against EGFR-PE/Cy7. Gate for the following (Figure 2[href=https://www.wicell.org#fig2]F):\nEGFR+CXCR4−, enriched for ventricular radial glia (vRG).\nEGFR−CXCR4−, enriched for outer radial glia (oRG).\nEGFR+CXCR4+, enriched for astrocytes (AC).\nFrom THY1hi, plot PDGFRA-BUV395 against EGFR-PE/Cy7. Gate for the following (Figure 2[href=https://www.wicell.org#fig2]G):\nEGFRhiPDGFRA−, enriched for glial progenitor cells (GPCs).\nEGFR+PDGFRA+, enriched for pre-oligodendrocyte precursor cells (pre-OPCs).\nEGFR−PDGFRA+, enriched for oligodendrocyte precursor cells (OPCs).\nEGFR−PDGFRA−, enriched for oligodendrocytes (OL).\nFrom CD24+THY1−/lo, plot CXCR4-APC/Cy7 against EGFR-PE/Cy7. Gate for the following (Figure 2[href=https://www.wicell.org#fig2]H):\nEGFR+CXCR4−, enriched for early excitatory neurons (ExN).\nEGFR−CXCR4−, enriched for late excitatory neurons.\nEGFR−CXCR4+, enriched for inhibitory neurons (InN).\nSort cells.\nChoose which cell populations to sort.",
    "Note: FACS machines can generally only sort four populations in parallel. Strategies for sorting more than four populations can be found in troubleshooting 2[href=https://www.wicell.org#sec6.3]\nLoad collection tubes with 0.5 mL Wash Buffer added. Vortex prior to loading.\nSort cells on four-way purity (for bulk sorts) or single-cell purity (for clonal assays) until the desired number of cells is obtained.\nStep 3: Functional assays\nTiming: 3–4 weeks (neurosphere initiation), 1 week (in vitro differentiation), and 3–6 months (in vivo transplantation)\nFollowing purification of NSPCs, various downstream functional assays can be performed. A few examples are listed here.\nNeurosphere initiation assay.\nPrepare 96 well plates filled with 100 μL Fetal Growth Media.\nAntibiotic/antimycotic should be added to the media for freshly isolated cells. It is no longer needed in subsequent media changes.\nNote: Even with proper humidification, we find that wells on the edge of the plate tend to dry up over the several weeks needed for clonal outgrowth. We recommend only using the non-edge wells, and filling the edge wells with 200 μL PBS.\nDuring sorting, set purity to “single-cell” mode.\nSort limiting dilutions of cells into each row of the plate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3076-Fig3.jpg\nFigure 3. In vitro assays for human NSPCs\n(A) Typical sort layout for limiting dilution assays to measure neurosphere initiation frequency.\n(B) Representative images of neurospheres, indicative of a positive well. Scale bar 100 μm.\n(C) Immunofluorescence (IF) images of CD24−THY1−/lo populations differentiated in vitro for 5 days, then stained for GFAP (red), DCX (green), O4 (magenta), or DAPI (blue).\n(D) IF images of THY1hi populations differentiated in vitro for 5 days, then stained for GFAP (red), O4 (green), or DAPI (blue). Abbreviations: E, EGFR; P, PDGFRA.",
    "(E) IF images of CD24+THY1−/lo populations differentiated in vitro for 5 days, then stained for DCX (green) or MAP2 (red). Scale bar 50 μm. Adapted from Liu et al., 2023.1[href=https://www.wicell.org#bib1]\ntable:files/protocols_protocol_3076_9.csv\nValues are approximate.\nNote: For example, one could sort 10 wells with 100 cells, 10 wells with 30 cells, 20 wells with 10 cells, and 20 wells with 3 cells (Figure 3[href=https://www.wicell.org#fig3]A). The number of cells can be increased for populations with low clonogenicity, or decreased for populations with high clonogenicity (see Table 1[href=https://www.wicell.org#tbl1]).1[href=https://www.wicell.org#bib1],3[href=https://www.wicell.org#bib3]\nEvery week, replace half the volume of each well with fresh Fetal Growth Media.\nNote: We maintain our neurosphere cultures in hypoxic conditions (5% O2), as it improves neurosphere initiation. This is not strictly required, but culture conditions should be clearly reported to ensure cross-study comparability.\nAfter 3 weeks, score the wells for the presence of neurospheres (i.e., a well with at least one neurosphere is scored as positive). Examples of neurospheres can be found in Figure 3[href=https://www.wicell.org#fig3]B.\nCalculate the neurosphere initiation frequency using extreme limiting dilution analysis (ELDA) software.2[href=https://www.wicell.org#bib2]\nThe expected neurosphere initiation frequency for each of the populations reported in this protocol is listed in Table 1[href=https://www.wicell.org#tbl1].\nIn vitro differentiation.\nCoat 96 well plates with polyornithine and laminin.\nAdd 50 μL polyornithine solution (20 μg/mL) to each well. Incubate at 37°C for at least 1 h.\nAspirate the polyornithine solution.\nAdd 50 μL laminin solution (50 μg/mL) to each well. Incubate at 37°C for at least 1 h.\nAspirate the laminin solution.\nBulk sort the cell population of interest as described above.\nSpin down the sorted cells at 300 × g for 3 min. Resuspend in Differentiation Media at a concentration of 5×104 cells/mL.",
    "Note: The given seeding density works well for the NSPC types described here, but may have to be optimized for new populations.\nAdd 100 μL of the cell suspension per 96 well, which gives 5×103 cells per well.\nAfter 5 days, fix the cells by adding 100 μL 4% PFA on top of the media. Fix for 15 min at 4°C.\nRemove the PFA and wash three times with 200 μL PBS.\nPerform immunofluorescent staining for lineage markers of interest.\nNote: We have provided some representative images of purified cell populations stained with markers for astrocytes (GFAP), oligodendrocytes (O4), and neurons (DCX, MAP2) in Figures 3[href=https://www.wicell.org#fig3]C–3E, though the specific markers used will depend on the goals of the experiment.\nImage stained cells on a fluorescent microscope.\nIn vivo transplantation.\nBulk sort the cell population of interest as described above.\nPause point: At this point it will have typically been 16+ h since the beginning of tissue processing. It is okay to keep the sorted cells at 4°C overnight in a 50/50 mix of Wash Buffer and Fetal Growth Media, and transplant the cells the following day.\nSpin down the sorted cells at 300 × g for 3 min. Resuspend in Fast Green dye at a concentration of 105 cells/μL.\nNote: Our standard is to inject 2×105 neural stem cells per mouse (105 cells into each lateral ventricle). It is perfectly fine, however, to inject fewer cells, especially for rare populations where it is not even possible to sort so many cells. We have observed engraftment with as few as 2×104 transplanted cells. We do, however, recommend injecting as many cells as possible below 2×105, as there is a direct correlation between the number of transplanted cells and the level of subsequent engraftment.",
    "Anesthetize neonatal NSG pups by wrapping them in a tissue and covering them with ice for 2 min.\nCritical: It is required to use an immunocompromised mouse strain for xenotransplantation. It is always a logistical challenge to procure neonatal pups on the same day that brain samples arrive, but we have achieved good engraftment on pups anywhere from P1-P4 in age.\nNote: Alternative methods for anesthesia, such as isoflurane, would also be suitable.\nOnce the pup is anesthetized, place them on a stereotaxic device fitted with a mouse neonate adaptor. Secure the pup’s head in place using the adaptor.\nNote: Keep the platform of the stereotaxic device cold so that the pup remains anesthetized. This can be accomplished by laying a tissue over the pup’s body and covering with ice.\nLoad the cell suspension into a Hamilton syringe with a 33-gauge needle.\nLoad the syringe onto a microsyringe pump controller.\nMake a burr hole at the injection site using a 30-gauge needle.\nFor injection into the lateral ventricles, use the following coordinates: anteroposterior from midline (A), lateral from midline (L), ventral from surface of brain (V). Lateral ventricles (A, L, V) = (0.8, ±1.5, 2.0) mm with reference to lambda\nMove the syringe into position, and inject the cells at a rate of 1 μL/min, with 1 μL injected per side (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3076-Fig4.jpg\nFigure 4. In vivo assays for human NSPCs\n(A) Positioning of pup on stereotaxic device and positioning of needle for intracerebroventricular injection (left), and visualization of successful ventricular injection by fast green dye (right).\n(B) Pup before and after injection of tattoo ink back right (BR) foot (left), and appearance of back right foot tattoo after 2 months.",
    "(C–E) Confocal immunofluorescence (IF) images of mouse brains engrafted with CD24−THY1−/lo human fetal radial glia. 40 μm thick sections were stained with anti-human GFAP (C) or human cytoplasmic antigen-specific STEM121 antibody (D, E), in addition to species cross-reactive antibodies against SOX2, OLIG2, or NeuN and MAP2 (C, D, E, respectively). Abbreviations: SVZ, subventricular zone. Scale bar 25 μm. Adapted from Liu et al., 2023.1[href=https://www.wicell.org#bib1]\nNote: Successful injection into the lateral ventricle can be visually confirmed owing to the Fast Green dye (Figure 4[href=https://www.wicell.org#fig4]A).\nRetract the needle and release the pup from the mouse neonate adaptor.\nOptional: If transplanting several different populations, it will be necessary to distinguish pups. This can be done by injecting India ink into the foot pads of the mouse (Figure 4[href=https://www.wicell.org#fig4]B). Record which tattoo patterns correspond to which transplanted population. We do not recommend tattooing more than 2 of the foot pads per mouse.\nWarm the pup on a 37°C heating pad or in your palm until movement is observed.\nReintroduce the pup to its mother. Ensure the mother accepts the pup.\nNote: We recommend placing the pup in the opposite corner of the cage as its littermates. Wait for the mother to pick up the pup and return it to its littermates.\nWait between 3–6 months for the mouse to mature.\nNote: Transplanted human neural stem cells will engraft in the mouse subventricular zone and give rise to interneurons that migrate through the rostral migratory stream into the olfactory bulb. We find that 6 months of maturation is required for human interneurons to migrate to the olfactory bulb. For other cell types, a shorter engraftment period would be acceptable.\nSacrifice mouse.\nAnesthetize the mouse using isoflurane.\nOpen the thoracic cavity to expose the heart.\nCut the right atrium.",
    "Inject 20 mL PBS with 5 mM EDTA into the left ventricle to perfuse the mouse.\nNote: Successful perfusion can be visually observed by the liver lightening in color. If the entire brain is to be fixed, then perfusion with 4% PFA is recommended instead.\nDecapitate the mouse and dissect out the brain.\nBrains can either be fixed in 4% PFA for histology, or dissociated to recover engrafted human cells.\nNote: For histology, we recommend staining with a human-specific antigen (e.g., STEM101 for human nuclear antigen, STEM121 for human cytoplasmic antigen, STEM123 for human-specific GFAP), along with lineage-specific markers (e.g., SOX2, OLIG2, NeuN). We have provided representative images of engrafted human astrocytes, oligodendrocytes, and neurons in Figures 4[href=https://www.wicell.org#fig4]C–4E."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Culture",
    "Cell-Based Assays",
    "Neuroscience",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}