{
  "id": 1668,
  "origin_website": "Cell",
  "title": "Protocol for Barcoding T Cells Combined with Timed Stimulation",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nHarvest and Plate Mouse CD4+ T Cells\nTiming: 2 h bench time, 2.5 days incubation time\nT cells are harvested, purified, and then activated to allow proliferation for 48 h via α-CD3/ α-CD28 stimulation.\nNote: We use four mice in this protocol, which could represent replicates and/or different genotypes. This sample size can be adjusted, keeping in mind that the total barcoding pool is optimized for 24 samples, which includes six time points of stimulation for each of these four mice (6 × 4 = 24).\nEuthanize four mice with CO2 according to animal facility guidelines.\nIsolate and pool cervical, brachial, axillary, and inguinal lymph nodes (LN) in one well per mouse (Figure 1[href=https://www.wicell.org#fig1]A).\nAdd LN to a 70 μm filter in a tissue culture-treated 6-well plate, with 6 mL sterile MACS Buffer (Figure 1[href=https://www.wicell.org#fig1]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/113-Fig1.jpg\nFigure 1. Isolating T Cells from Mouse Lymph Nodes\n(A) Anatomical location of cervical, axillary, brachial, and inguinal lymph nodes.\n(B) 70 μm filter within a 6-well plate on ice to pool and mash lymph nodes.\n(C) MACS separation magnet with a beaker of ice for cold collection.\nNote: Keep reagents and samples on ice as much as possible.\nNote: Mice can be dissected outside of sterility, but all future steps should be performed in a laminar flow hood with aseptic technique.\nUse the plunger from a 1 mL syringe to mash LN through each 70 μm filter per mouse.\nCollect buffer in separate 15 mL falcon tubes per mouse and centrifuge for 5 min at 500 × g.\nNote: Centrifugation at 4°C is ideal, however spins at 25°C are sufficient.\nResuspend pellets in 5 mL MACS Buffer and count cells.\nAdd 1 mL first with p1000 pipette to break up the pellet before adding additional 4 mL.",
    "Use p20 pipette to remove any fatty clumps in suspension before counting cells.\nOptional: Reserve a small aliquot of cells before MACS purification for a purity check of the T cell isolation. Keep on ice.\nNote: The following protocol is adapted from the Miltenyi Biotec MACS Naive CD4+ T Cell Isolation Kit mouse protocol, with few modifications. Cell numbers are adjustable, with a maximum of 2 × 109 cells per column.\nSpin down suspension for 5 min at 500 × g.\nResuspend cell pellet in 40 μL MACS Buffer per 107 total cells.\nAdd 10 μL Biotin-Antibody Cocktail per 107 total cells.\nMix well by pipetting or flicking tube and incubate for 5 min in a 4°C refrigerator.\nNote: Increased incubation times may lead to nonspecific binding and working on ice may increase incubation times.\nAdd 30 μL MACS Buffer per 107 total cells.\nAdd 20 μL α-Biotin Microbeads per 107 total cells.\nMix well by pipetting or flicking tube and incubate for 10 min in a 4°C refrigerator.\nDuring final 10-min incubation, prepare the LS columns by placing on the magnet and adding 3 mL MACS Buffer (Figure 1[href=https://www.wicell.org#fig1]C).\nDiscard the flow through.\nNote: Minimum volume for magnetic separation is 500 μL, so bring up the cell suspension volume with MACS Buffer, if necessary.\nApply the cell suspension to the column and let it flow by gravity.\nCollect the flow-through in 15 mL falcon tubes and keep on ice (Figure 1[href=https://www.wicell.org#fig1]C).\nThis contains the unlabeled CD4+ T cells.\nWash the column by applying 3 mL of MACS Buffer and collecting the flow-through in the same collection tube.\nCount the CD4+ T cell flow-through.\nAdd up to 15 mL of cold T cell media and wash enriched cells by centrifuging for 5 min at 500 × g.",
    "Optional: Take a small aliquot of cells after MACS purification for a purity check of the T cell isolation. Stain these cells along with the aliquot of cells from the pre-purification with fluorophore-conjugated CD4, CD11b, CD25, CD44, CD62L, and B220 antibodies. Acquire these samples on the flow cytometer to ensure a high purity of naive CD4+ T cells post-T cell enrichment.\nResuspend cells at 4 × 106 cells/mL.\nAdd soluble α-CD28 antibody at a concentration of 5 μg/mL to the CD4+ T cells.\nUsing the pre-coated 24-well plate from BEFORE YOU BEGIN steps 1 and 2, wash once with PBS.\nNote: Vacuum out liquid from coated plate and add PBS to the walls of the wells to wash. Vacuum out PBS again, right before adding cells, without allowing the wells to dry.\nTransfer 500 μL of cells to each pre-coated well (2 × 106 cells/well).\nNote: Use multiple wells per mouse as number of T cells recovered per mouse should exceed 2 × 106.\nLet cells activate and proliferate for 48 h in cell incubator (37°C, 5% CO2).\n48 h post-stimulation collect cells from wells with p1000 pipette in 15 mL falcon tubes and wash cells with T cell media to remove leftover antibodies.\nAdd 10 mL T cell media to cells and centrifuge for 5 min at 500 × g to wash.\nNote: Cells will attach to plate. Pipet up and down for maximal cell recovery.\nNote: Can pool wells from the same mouse that were previously split in step 21.\nResuspend cells at 1 × 106 cells/mL and add mIL-2 (100 U/mL).\nResuspend a maximum of 5 × 106 cells in 5 mL of media in a well of a tissue culture-treated 6-well plate.\nIncubate cells at 37°C for 12–16 h in T cell media supplemented with mIL-2.",
    "Timed T Cell Receptor Stimulations\nTiming: 2 h\nExpanded CD4+ T cells are rested in plain RPMI, then their T cell receptor (TCR) is stimulated with an α-CD3 antibody and crosslinked with an IgG antibody for varying amounts of time before the reaction is stopped and the cells are fixed with paraformaldehyde (PFA) and cell membranes are permeabilized with methanol.\nPre-warm plain RPMI to 37°C for use during this section of the protocol.\nCollect cells from plate and wash by adding up to 15 mL plain RPMI and centrifuging at 25°C for 5 min at 500 × g.\nRepeat wash two times.\nCritical: Use plain RPMI throughout this section, without FBS and without supplements, to allow the cells to fully rest at their basal state.\nDetermine the time points for stimulation, i.e. −12 min (12 min), 10 min, 7 min, 5 min, 2 min, and 0 min (no stimulation).\nNote: The number of time points that can be used depends on the number of mice chosen previously. As this protocol is optimized for 24 samples, the number of time points (6) is replicated for each mouse (4) and has to be at or below 24.\nResuspend cells in plain RPMI at 107 cells/mL.\nPlate cells in a tissue culture-treated 96-well round-bottom plate by adding 100 μL per well (106 cells/well) for each of the six stimulation time points (Figure 2[href=https://www.wicell.org#fig2]).\nPlate the cells across a row (1–6) to allow for the use of a multichannel pipette.\nPlate the cells from each mouse one right below the other (Rows A, B, C, and D for Mouse 1, 2, 3, and 4, respectively).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/113-Fig2.jpg\nFigure 2. Plate Set-up for T Cell Stimulation",
    "Example layout for acute TCR crosslinking of 24 test samples in a 96-well plate. Locations of the test samples and single stain controls used for flow cytometry setup are outlined. Additional wells are reserved for the stimulatory (a-CD3) and crosslinking (IgG) antibodies, which are added to the test-sample wells during the procedure.\nPlate ten extra wells for use as single stain dye controls.\nOptional: In the case of low cellularity, it is sufficient to make just two single stain control wells for the strongest dilutions of the dyes.\nNote: These single stain control wells will be unstimulated and will receive the same treatment as the 0-min timepoint wells in step 43.\nIncubate the cells in the plate at 37°C for 1 h to allow them to rest in plain RPMI and return to basal signaling.\nWhile cells are resting, prepare 20 μL of murine α-CD3 antibody per well (480 μL total) for stimulation at a final concentration of 10 μg/mL.\nThe working concentration for the murine α-CD3 antibody on the cells is 10 μg/mL, so make a 6× stock solution of α-CD3 at 60 μg/mL.\nPrepare 20 μL of the crosslinking IgG antibody per well (480 μL total) for stimulation at a final concentration of 50 μg/mL.\nThe working concentration for the crosslinking IgG antibody on the cells is 50 μg/mL, so make a 7× stock solution of IgG at 350 μg/mL.\nNote: Each well will receive 20 μL of each antibody, except the 0 min timepoint (no stimulation=no antibody, so the extra well preparation will account for any evaporation or pipetting error).\nPlate the α-CD3 antibody in preparation for the stimulation, in wells separate from the cells (Figure 2[href=https://www.wicell.org#fig2]).",
    "Plate 120 μL of the antibody in each of four wells down a column to match the number of mice replicates present.\nPlate the IgG antibody in wells directly next to the α-CD3.\nPlate 120 μL of the antibody in each of four wells down a column to match the number of mice replicates present.\nNote: Antibodies can be plated on the same 96-well plate as the resting cells, to reduce waste of an additional plate. Be sure to leave empty columns between the resting cells and the antibodies to prevent splash into timepoint wells.\nAfter the cells have rested for 1 h at 37°C, remove from incubator and set-up a timer to count down, starting at the longest timepoint: 12-min stimulation.\nSet the timer to 12 min 30 s.\nNote: Because of the secondary crosslinking antibody (IgG), the stimulation will be performed by first adding the α-CD3 antibody and 30 s later, adding the IgG.\nUsing a multichannel pipette, add 20 μL of the primary α-CD3 antibody to the column of 12-min timepoints for each of the four mice (Column 6).\nPipet up and down twice to mix.\nStart the 12 min 30 s countdown timer.\nWhen the timer reaches 12 min (30 s after the addition of the α-CD3 antibody), add 20 μL of the IgG to the same column of 12-min timepoints.\nPipet up and down twice to mix.\nRepeat steps 38–40 to continue with timepoints 10-min to 2-min, adding the primary α-CD3 antibody to the wells 30 s before the actual timepoint is reached.\nNote: It is important to add all antibodies to the same column at the same time and mix consistently to reduce variations in the stimulation.",
    "Note: Place the stimulation plate back in the 37°C incubator during wait times to maintain cells at physiological temperature as much as possible.\nAfter the countdown reaches 0, immediately add 50 μL of 8% PFA to wells column-wise which have been stimulated to stop the reactions, taking care to add the PFA to all the wells of a single column at the same time.\nAlways stop the shorter timepoints first to avoid larger variations – so 2-min time point first (Column 2), then 5 min, 7 min, 10 min, and lastly, the 12-min timepoint (Column 6).\nPipet up and down twice to mix.\nNote: 8% PFA stock should not be placed in the 96-well plate with the cells. Use a multichannel pipet basin to hold the PFA immediately before stopping the reactions.\nFinally, add 40 μL of plain RPMI to the 0-min timepoint (Column 1) and then immediately 50 μL of 8% PFA.\nNote: The 0-min time point receives no stimulation, so add cell media in place of antibody, and then immediately add 8% PFA.\nNote: Address the 0 min column last (Column 1), after the addition of PFA into the wells that had been stimulated, as the timing is not critical for these wells given that they did not receive stimulation.\nRepeat step 43 for the ten single stain control wells.\nIncubate plate at 25°C for 20 min.\nCentrifuge the plate at 1,100 × g for 2 min and discard the supernatant by quickly dumping it upside down, flicking the liquid into a waste container, and blotting the plate once on a paper towel to dry out the edges and avoid spillover between wells.",
    "Note: Step 46 requires the proper disposal of PFA into a designated hazardous waste container. If needed, supernatant can be aspirated out for the proper disposal of the PFA.\nAdd 200 μL of PBS to all the wells for two washes, referring to step 46.\nGently tap on the sides of the plate to loosen the pellets.\nAdd 200 μL of ice-cold 90% methanol drop-wise to each well.\nNote: Do not pipet methanol up and down, as this will shear the cell membranes.\nStore plate at −20°C for 12–16 h, until barcoding the following day.\nPause Point: Plate can be stored at −20°C for a week before barcoding.\nPreparing Barcoding Dyes and Color Combinations\nTiming: 30 min\nFollow Table 1[href=https://www.wicell.org#tbl1] to make 50× dilutions of two staining dyes (AlexaFluor488 and Pacific Blue) to create ten different dye dilutions which will be used to make 24 distinct two-color combinations for the respective number of samples.\ntable:files/protocols_protocol_113_4.csv\nTable detailing the set-up and serial dilutions of the Alexa Fluor488 and Pacific Blue stock dyes.\nOptional: Different combinations and concentrations of various dyes can also be used, with empirically designed titrations.\nOptional: Make the 50× dyes in PCR tube strips, as it makes it possible to use a multichannel pipette in the later steps.\nBegin by adding the appropriate volume of dimethyl sulfoxide (DMSO) into each of 10 PCR tubes, according to Table 1[href=https://www.wicell.org#tbl1] “DMSO Volume”.\nLabel the tubes based on the different dyes used as well as the concentrations of each dye.\nThe labeling strategy here is A1, A2, …, A6 and P1, P2, P3, P4 representing the six Alexa Fluor488 (AF488) tubes and the four Pacific Blue (PacBlue) tubes, respectively.",
    "To prepare A1, add 75.2 μL of the commercially available AF488 to 24.8 μL of DMSO into the first PCR tube (A1) as a 1.33 times dilution (Figure 3[href=https://www.wicell.org#fig3]A).\nPipet up and down twice to mix.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/113-Fig3.jpg\nFigure 3. Creating Barcoding Dilutions and Combinations\n(A) Cartoon of serial dilutions to prepare six and four stock concentrations of Alexa Fluor488 and Pacific Blue, respectively.\n(B) Well set-up to prepare the 24 unique dye combinations for barcoding samples. MeOH: Methanol\nTo prepare A2, take 26.8 μL from A1, and add it to A2, with the 53.2 μL of DMSO as a 3 times dilution from the previous tube (A1).\nPipet up and down twice to mix.\nContinue with these serial dilutions according to Table 1[href=https://www.wicell.org#tbl1] for a total of six tubes.\nTo prepare P1, add 80 μL of the commercially available PacBlue to 20 μL DMSO into the first PacBlue PCR tube (P1) as a 1.25 times dilution.\nPipet up and down twice to mix.\nSimilar to the AF488 dilutions, follow Table 1[href=https://www.wicell.org#tbl1] and Figure 3[href=https://www.wicell.org#fig3]A to finish the PacBlue dilutions.\nTo prepare the dye combinations, set up 24 PCR tubes with six tubes across and four tubes down, referring to Figure 3[href=https://www.wicell.org#fig3]B.\nAdd 88 μL of cold 90% methanol to all tubes.\nNote: Methanol will evaporate, so perform these steps right before staining the cells.\nAssign each dye combination to a specific sample from the experiment.\nOptional: Assign dye combination based on Table 2[href=https://www.wicell.org#tbl2]. From the first mouse in the timed stimulation, the 0-min timepoint (Mouse 1, 0 min) will be assigned the strongest dye combination (A1 with P1) and this will represent Staining Tube 1.\ntable:files/protocols_protocol_113_5.csv\nTable assigning each of the unique dye combinations to individual samples to be analyzed.",
    "Arrange the AF488 dilutions (A1-A6) in a row, six across (Figure 3[href=https://www.wicell.org#fig3]B).\nArrange the PacBlue dilutions (P1-P4) in a column, four down.\nUsing a multichannel pipette, take 6 μL from each of the six stock AF488 tubes (A1-A6) and add them to the first row horizontally of the 24 PCR tubes with methanol (Methods Video S1[href=https://www.wicell.org#mmc1]).\nContinue by adding 6 μL of the stock AF488 dilutions to the second, third, and fourth rows of the 24 PCR tubes.\nAdd 6 μL of the four PacBlue stock dilutions (P1-P4) to the first column vertically of the 24 PCR tubes with methanol.\nContinue by adding 6 μL of the stock PacBlue dilutions to the second through sixth columns of the 24 PCR tubes.\nNote: This will create the barcoding Staining Tubes 1–24, as well as dilute the stocks from a 50× to a 3× solution for addition to the cells.\nNote: It is important when creating these barcoding dyes to pay attention to the dyes added horizontally versus vertically, as well as accurate labeling of the tubes, as this is needed to deconvolve the samples during analysis after flow cytometry.\nOptional: If there are less than 24 samples, only create the number of dye combinations appropriate for the number of samples present, starting with the strongest dilutions first.\nCreate 10 single stain controls by adding 6 μL of each of the stock dilutions (A1-A6 and P1-P4) into separate PCR tubes in 94 μL of 90% methanol.\nOptional: In case of low cellularity, it is sufficient to make just barcoding dye two single stain controls for flow cytometry compensation, with the strongest dilution of each dye (A1 and P1).\nNote: In further steps, there will be two additional controls for flow cytometry compensation: unstained control and the phospho- control.",
    "Your browser does not support HTML5 video.\n      \nMethods Video S1. How to Create the 24 Color Combinations with a Multichannel Pipette (Associated with Steps 63 and 64)\nBarcoding the Samples\nTiming: 2.5 h\nPermeabilized cells are labeled with the 24 distinct dye combinations and the samples are pooled for labeling of intracellular markers of interest and then prepared for flow cytometry.\nRetrieve cells stored at −20°C after permeabilization in methanol.\nAdd 50 μL of the corresponding Staining Tubes to each of the 24 wells of permeabilized cells, referring to Table 2[href=https://www.wicell.org#tbl2] for sample assignment.\nNote: Add the dyes drop-wise to cells to mix to avoid shearing cells (Methods Video S2[href=https://www.wicell.org#mmc2]). DO NOT pipet to mix.\nNote: Cells are in 100 μL methanol, and do not require a wash step, as 50 μL of the barcoding dyes prepared as a 3× stock in methanol will be diluted appropriately to 1× when added to the existing 100 μL of cells.\nAdd 50 μL of the appropriate single stain controls (A1-A6 and P1-P4) to the unstimulated single stain control wells.\nIncubate the cells with dyes for 15 min at 25°C and protected from light.\nCentrifuge the plate at 1,100 × g for 2 min and discard the supernatant by quickly dumping it upside down and blotting the plate once on a paper towel to dry out the edges and avoid spilling between wells.\nTap on the sides of the plate to loosen the pellets.\nAdd 200 μL of FACS buffer to all the wells for two washes, without pipetting up and down, referring to steps 70 and 71.\nAfter final wash, add 200 μL of FACS buffer to the first well only.\nPipet up and down twice to mix and transfer the whole 200 μL to the next well to pool the cells.",
    "Pipet up and down twice to mix.\nContinue this process in step 74 to pool all 24 test wells (Methods Video S3[href=https://www.wicell.org#mmc3]).\n        Your browser does not support HTML5 video.\n      \nMethods Video S2. How to Add Dyes to Cells, Dropwise (Associated with Step 67)\nFor the single stain controls, pool each color individually by first adding 200 μL of FACS buffer only to the AF488 first single stain control well (A1).\nPipet up and down twice to mix and transfer the whole 200 μL to the next well (A2) to pool the cells.\nPipet up and down twice to mix.\nContinue this process in step 77 to pool all six AF488 single stain controls.\nRepeat steps 76–78 to pool the four PacBlue single stain controls.\nNote: There should be two separate pools for the single stain controls. One containing the six AF488 stains and the other containing the four PacBlue stains. These wells will not receive any additional staining and should be left in 200 μL FACS buffer at 25°C and protected from light until flow cytometry.\nDivide the pooled sample containing the 24 barcoded wells into two new wells, one for an intracellular phospho-ERK stain and the other well as a secondary-only antibody control.\nStain the test well with p-ERK primary antibody by diluting 1 μL of the antibody in 100 μL of FACS buffer and then adding it to an equivalent volume in the test well for a final antibody dilution of 1:200.\nAdd 100 μL of FACS buffer to the secondary-only antibody control well.\nIncubate wells for 1 h at 25°C, protected from light.",
    "Centrifuge the plate at 1,100 × g for 2 min and discard the supernatant by quickly dumping it upside down and blotting the plate once on a paper towel to dry out the edges and avoid spilling between wells.\nTap on the sides of the plate to loosen the pellets.\nAdd 200 μL of FACS buffer to the wells for two washes, according to steps 84 and 85.\nAfter the final wash, discard the supernatant and tap on the sides of the plate to loosen pellets.\nStain both wells with APC-conjugated donkey α-rabbit secondary antibody by diluting 2 μL of the antibody (at 0.5 mg/mL) in 400 μL of FACS buffer and then adding 200 μL of this stain to each well for a 1:200 antibody dilution.\nIncubate wells for 30 min at 25°C, protected from light.\nOptional: Direct APC-conjugated intracellular phospho-ERK antibody can be used in lieu of primary and secondary antibody staining. With this, an isotype control antibody conjugated to the same fluorophore should be used as a negative control for staining and added to the cells at the same concentration as the p-ERK antibody.\nOptional: Other fluorescent antibodies can be used instead of APC as long they do not interfere with the barcoding dyes.\nCentrifuge the plate at 1,100 × g for 2 min and discard the supernatant by quickly dumping it upside down and blotting the plate once on a paper towel to dry out the edges and avoid spilling between wells.\nTap on the sides of the plate to loosen the pellets.\nAdd 200 μL of FACS buffer to the wells for two final washes, according to steps 90 and 91.",
    "After final wash, resuspend both wells in 300 μL FACS buffer and transfer to FACS tubes, along with the two wells of single stain controls.\nAcquire samples on flow cytometer.\nAcquire the single stain controls to enable compensation and define parameters for the barcoded cells, post-acquisition (Figure 4[href=https://www.wicell.org#fig4]).\nBe sure to acquire the APC secondary antibody only control well to account for nonspecific antibody binding.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/113-Fig4.jpg\nFigure 4. Example Flow Plots of Single Stain Controls\n(A) Representative flow cytometry plot of the six Alexa Fluor488 and (B) four Pacific Blue single stain controls optimally spaced for distinguishing between populations.\n        Your browser does not support HTML5 video.\n      \nMethods Video S3. How to Pool Test Wells after Barcoding (Associated with Steps 73–75)"
  ],
  "subjectAreas": [
    "Immunology",
    "Single Cell",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}