{
  "id": 6134,
  "origin_website": "Bio",
  "title": "Isolation of Microvascular Endothelial Cells",
  "procedures": [
    "Note: For the EC purification described, tissue from no more than one to two animals is required (see Figure 1 for diagram).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180615/20180615002139_1795.jpgFigure 1. Isolation of endothelial cells (ECs) from tissues by immunomagnetic separation. Tissues consist of diverse cell types and matrix components, and in general, the endothelial content constitutes 1-2% of the total tissue mass. Tissues are mechanically disrupted and enzymatically digested to create a single-cell suspension. Endothelial-speciﬁc Abs are added to the single-cell suspension to label the EC. ECs are separated from the other components by using magnetic beads, resulting in highly pure population of ECs.Euthanize mice according to your local animal regulations. We use an overdose of isoflurane, which leads to breathing arrest within one minute.Working as sterilely as possible remove murine organs such as heart, lung, and liver using autoclaved instruments and rinse in PBS to remove blood. In a Petri dish, using sterile crossed scalpels, dissect tissue into 2-mm3 blocks.Wash twice in PBS by low-speed centrifugation (210 x g, 1 min).Incubate diced tissue in a solution of collagenase (0.5 mg/ml) for 1 h at 37 °C in a humid incubator.Note: We use Gibco® Collagenase Type II because compared to other collagenase preparations it has a higher clostripain activity and is well-suited for the digestion of heart, bone, thyroid, cartilage, and liver tissues. N.B. it is isolated from Clostridium histolyticum and packaged as a lyophilized, non-sterile powder for research use in cell or tissue dissociation and organ perfusions. Gibco® Collagenase Type II activity is guaranteed to be greater than 125 units/mg. Subsequently, add 75 µl DNase I solution per 10 ml cell suspension and incubate for another 30 min in a 37 °C water bath with continuous agitation.Pass digested tissue through a cell strainer to remove undigested blocks.",
    "Rinse the cell strainer twice with PBS supplemented with 2.5% FCS to collect any remaining cell.Incubate for a further 10 min in 0.25% trypsin (1 ml of trypsin for every 100 mg of tissue) to obtain single cell suspension.Wash once in 500 µl PBS supplemented with 2.5% FCS.Incubate for 30 min at 4 °C with murine immunoglobulins to block Fc receptors. Note: Mouse BD Fc Block is a purified rat IgG2b anti-mouse CD16/CD32 monoclonal antibody.Wash twice in cold PBS supplemented with 2.5% FCS.Incubate for 45 min at 4 °C with rat anti-mouse CD31, rat anti-mouse CD105 and biotinylated isolectin B4.Wash twice in cold 500 µl PBS supplemented with 0.5% FCS and count cells.Resuspend pellet and incubate with PBS 0.5% FCS (200 μl/L, 2.5 x 107 cells), rat anti-mouse Ig (25 μl/L, 2.5 x 107 cells)- and streptavidin-conjugated microbeads (25 μl/L, 2.5 x 107 cells) for 15 min at 4 °C (total volume 250 μl). Meanwhile, load columns onto the separation unit (use one column every 1-2.5 x 107 cells) and wash each column with 500 μl PBS 0.5% FCS as per manufacturer’s instructions.Load each column with 250 μl cell suspension. The magnetically labeled cells are retained in the column(s) while non-labeled cells pass through. After the cell suspension has flowed through the column, wash the column twice with 500 μl PBS 0.5% FCS. For detailed procedure, please refer to the video[href=https://www.miltenyibiotec.com/GB-en/products/macs-cell-separation/cell-separation-reagents/microbeads-and-isolation-kits.html] on the manufacturer's website. Unload the column(s) from the magnet and elute the magnetically retained cells with PBS 0.5% FCS using the plunger provided.Wash the eluted cells and centrifuge at 200 x g for 5 min. Resuspend in EC medium (105 cells/ml) and plate out in dishes/plates (Table 1) pre-coating with gelatin.",
    "The phenotype and morphology of these cultures remain stable over 10-15 passages in culture, and no overgrowth of contaminating cells of non-endothelial origin is observed at any stage. You can get about 80% of yield.Note: Coat P100 dishes with gelatin, let sit in an incubator(37 °C) for at least 30 min, wash in PBS and leave to dry.Table 1. Passaging Seeding Density and Volumeimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180615/20180615003002_3328.jpgAfter overnight culture on 5% CO2, remove non-adherent cells and replace medium with 75 μg/ml EC growth supplement.At confluence, detach EC with either trypsin-EDTA or cell dissociation solution and characterize.Note: To preserve the features of EC physiology and gene expression, the tissue specimen should preferably be processed immediately after resection. It is advisable to have ready-to-use aliquots of the work solutions in storage."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}