{
  "id": 5273,
  "origin_website": "Bio",
  "title": "Mouse Model of Dengue Virus Infection with Serotypes 1 and 2 Clinical Isolates",
  "procedures": [
    "Generation of DENV stocksNote: A high virus titer of clinical DENV strains is required to induce severe diseases in AG129 mice. The virus titer obtained from C6/36 cells differs among virus strains. Thus, optimization of culture condition such as multiplicity of infection (MOI) of virus inoculum or timing of virus collection is needed to obtain enough virus titer for each virus strain.Maintain C6/36 cells in RPMI 1640 medium supplemented with 10% FBS, 2 mM L-glutamine, 100 U/ml penicillin and streptomycin and 25 mM HEPES. Incubate cells at 28 °C under non CO2 atmosphere condition. Note: Growth media supplemented with 20% FBS improves cell growth if C6/36 cells do not proliferate desirably. Grow C6/36 cells in a 175 cm2 flask in culture medium until ~90% confluency (see Figure 1). Thaw virus stock and dilute with serum-free RPMI 1640 medium. Discard medium from culture flask and add 5 ml of virus inoculum at MOI of 0.1 (for EDEN1 or S221) or 1 (for EDEN2) into 175 cm2 flask.Note: At confluency, there are approximately 3 x 107 cells in a T175 flask, hence for an MOI 0.1-1, 3 x 106-3 x 107 pfu are needed (refer to Procedure B on how to determine virus titers).Incubate for 1 h at 28 °C under non CO2 atmosphere condition.Remove virus inoculum and add 25 ml RPMI 1640 medium (2% FBS) to the 175 cm2 flask.Incubate for 4-7 days at 28 °C under non CO2 atmosphere condition. Note: Cytopathic effect is observed depending on virus strain (seen in EDEN2 infection but not in EDEN1 or S221 infection). Check virus titer in the supernatant at different time point to determine the optimal day to obtain high virus titer (refer to Procedure B on how to determine virus titers).",
    "Incubation periods are 5 days for EDEN2 and S221, and 7 days for EDEN1.Scrape cells and transfer into a centrifuge tube, then spin down the cells at 1,800 x g for 10 min at 4 °C.Collect supernatant and transfer into a fresh tube through a 0.45 μm membrane filter.Aliquot virus into cryotubes and store in a -80 °C freezer or liquid nitrogen until use.Note: It is recommended to store virus stock in liquid nitrogen for long-term storage.Determination of viral titer by plaque assayMaintain BHK-21 cells in RPMI 1640 supplemented with 10% FBS, 2 mM L-glutamine and 100 U/ml penicillin and streptomycin in a humidified incubator with 5% CO2 atmosphere at 37 °C.Seed cells at 2 x 105 cells per well in 500 μl into 24-well plate. Incubate cells overnight at 37 °C in 5% CO2 incubator to allow cells to adhere.Note: Cells become confluent on the following day. Two days incubation after seeding of 7 x 104 cells is also viable.Prepare 10-fold serial dilutions of virus in serum-free RPMI 1640.Remove culture supernatant of BHK-21 cells and add 200 μl of diluted virus into each well.Note: Virus should be added immediately after removing culture supernatant to avoid cells drying out.Incubate the plate for exactly 1 h at 37 °C in 5% CO2 incubator.Remove virus and add 500 μl of 0.8% methyl-cellulose medium supplemented with 2% FBS.Incubate plate for 4-5 days at 37 °C in 5% CO2 incubator.Note: The plaque size is affected by virus replication rate. Check the plaque size visually before fixation to obtain clear plaque morphology. Plates of EDEN1 infection are normally incubated until day 4 post-infection, whereas plates of EDEN2 or S221 are usually incubated until day 5 post-infection.Overlay 1 ml of 3.7% formaldehyde onto the cells and fix for 20 min at room temperature.",
    "Note: Alternatively, the plates can be put into a hermetic container containing 5 L of 3.7% formaldehyde and fixed for 20 min without removing methyl-cellulose medium. The formaldehyde solution can be kept for 3-4 months, however, longer time fixation times may be required if the 3.7% formaldehyde is not fresh. Once the solution turns brown and turbid, replace it.Rinse the plate with copious volume of water in a container. Shake the plate robustly to remove methyl-cellulose medium completely. Add 1-3 drops of 1% crystal violet into each well and stain for 2 min.Rinse the plate with copious volume of water in a container and shake the plate to remove excess water.Dry the plate out and count the number of plaques to determine virus titer.Caluculation of plaque forming units (pfu):Virus titer (pfu/ml) = average number of plaques/200 μl inoculum x 1,000 μl x dilution factorPreparation of α-DENV E protein antibodies (4G2) from hybridoma cellsCulture 4G2 hybridoma cells in 50 ml of PFHM-II (Protein-Free hybridoma medium) in 175 cm2 flasks in humidified incubator with 5% CO2 atmosphere at 37 °C.Note: It is recommended to culture the cells in RPMI 1640 (10%) during the initial period of several days after thawing cells. Once the cells grow well, replace the media gradually by increasing the proportion of PFHM-II media in RPMI 1640 from 10% (vol/vol) to finally 100% PFHM-II media (example: 10%, 25%, 50%, 75% and 100%).Collect cell suspension into a centrifugal tube when the cells become confluent (the color of culture media turns to orange or yellow). Centrifuge cells at 900 x g for 5 min at room temperature.Collect the supernatant and stored at 4 °C without filtration until enough amount of supernatant is obtained.Continue culturing the cells and repeat steps C2-C4 if a large amount of the supernatant is required.",
    "Filter the supernatant through a 0.2 μm membrane filter unit.Load the 4G2 supernatant onto a 5 ml Protein G column pre-equilibrated in pH 7.2 PBS.Note: 4G2 antibody is purified using the AKTApurifier. Refer to the manufacturer’s instruction guides regarding sample loading specifications.Wash the column with PBS using 5x the column volume (i.e., 25 ml).Prepare a 96-well block containing 60 μl 1 M Tris-HCl.Note: The standard ratio of Tris-HCl to glycine (100:6) for neutralization is subjected to change depending on the concentration of buffers prepared. Volume of Tris-HCl to be added required for neutralization (pH 7) can be adjusted by pH paper testing.Elute antibodies using 100% 0.1 M glycine and collect 1 ml fractions into the wells of the block.Note: Check the purity of the antibody by running a SDS-PAGE.Select fractions of high purity and collect into a dialysis membrane, and then dialyse against PBS overnight.Quantitate the concentration of the purified antibody using NanoDrop.DENV infection in AG129 mice and measurement of viremiaNote: Infectivity of DENV in AG129 mice differs among virus strains. DENV2 clinical strains are generally more infectious than DENV1 clinical strains in the mice (our unpublished observation). Infection in the presence of DENV-specific antibodies (ADE condition) can enhance the infection level and make it possible to induce mortality. Here we describe the methods for two successful mouse models of clinical isolates of DENV1 (EDEN1 strain) and DENV2 (EDEN2 strain) (Watanabe et al., 2016) together with the pioneering mouse model using mouse-adapted DENV2 (S221 strain) (Zellweger et al., 2010). Prepare AG129 mice aged 7-11 weeks.Note: AG129 mice were purchased from B&K Universal (UK) and the breeding pairs were maintained under specific pathogen-free (SPF) conditions in the animal facility. One female AG129 mouse bears approximately 4 pups per month, therefore, maintainance of 10-breeding pairs produce about 40 mice per month.",
    "Dilute purified 4G2 with PBS to concentrations of 50 μg/100 μl for EDEN1 or EDEN2 infection and 10 μg/100 μl for S221 infection. Administer 100 μl of diluted 4G2 into AG129 mice intraperitoneally using a 30 G insulin syringe one day prior to virus infection.Dilute virus stock with PBS to concentrations of 7 x 107 pfu/200 μl for EDEN1, 1 x 108 pfu/200 μl for EDEN2 and 2 x 104 pfu/200 μl for S221. Keep the diluted virus on ice.Note: Inoculation of these virus titer induces lethal infection in the presence of 4G2 antibodies (ADE condition) but not in the absence of 4G2.Hold a mouse steadily in a mouse restrainer. Inoculate 200 μl of virus inoculum intravenously into mice through the tail vein using 30 G insulin syringe.Note:Up to 1 ml of virus can be inoculated intravenouslly into mice. Thus, as far as the titer of virus stock exceeds 1 x 108 pfu/ml, enough virus can be delivered into the mice for lethal infection.Observe mouse disease status and survival rate until day 10 post-infection.Note: Mice usually succumb to infection by day 5 post-infection accompanied with a severe form of human DHF/DSS-like diseases (Zellweger et al., 2010; Watanabe et al., 2016). Add 10 μl of 1% (wt/vol) EDTA (in PBS) into each 1.5 ml Eppendorf tube for blood collection. Hold the mouse vertically with the head tilted back and collect approximately 100 μl of blood from facial vein using a 27 G needle (final 0.1% EDTA).Note: It is possible to collect 100 μl of blood from each mouse on 10 consecutive days.Centrifuge the blood samples at 13,500 x g for 3 min.Collect serum and store at -80 °C until use.Collect 20 μl of each serum sample and mix with 120 μl PBS.",
    "Extract RNA from serum using QIAamp Viral RNA Mini Kit according to the manufacturer’s instruction.Make 20 μl reaction mixture (4 μl RNA plus 16 μl PCR reagent mixture) using the qScript One-Step qRT-PCR Kit. Prepare standard curves with plasmid DNA ranging from 107 to 101 copies/4 µl. Perform quantitative RT-PCR reactions in duplicate in Bio-Rad Real-time thermal cycler CFX96 according to the manufacturer’s instruction.Run the qPCR using the following programimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161129/20161129223814_7804.jpg"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}