{
  "id": 19384,
  "origin_website": "Jove",
  "title": "Histological Examination of Mitochondrial Morphology in a Parkinson's Disease Model",
  "procedures": [
    "All procedures described in this section have been performed according to the ethical framework provided by the University of the Basque Country Reference M20/2022/212, the Government of the Basque Country, the Spanish Government, and the European Union.\n1. Mitochondrial morphology analysis in SNCA-overexpressing SH-SY5Y cells\nNOTE: Here, a brief description of the generation of the in vitro material for the study, which will serve as a comparison for the in situ obtained results, is provided. It is recommended that this type of analysis is performed before launching an in vivo experiment for mitochondrial morphology, as it will ensure that all appropriate imaging and analysis setups are in place.\nTo increase cellular attachment and facilitate cellular adhesion on flat optical bottom 96-well plates, add 25 µL/well of coating matrix 1:1000 in DMEM F12 by pipetting (see Table of Materials). Incubate the plates for 1 h at 37 °C and 5% CO2.\nCount SH-SY5Y using Neubauer chamber. Remove the coating matrix by pipetting, and seed 10.000 cells/well on the coated 96-well plate in 50 µL/well of DMEM F-12 supplemented with 10% FBS, 2 mM glutamine, and penicillin/streptomycin (see Table of Materials).\nIncubate the cells at 37 °C and 5% CO2for 24 h.\nPrepare a mixture of 250 ng of pcDNA3.1 carrying human wild-type SNCA, 0.250 µL of the transfection reagent, 0.250 L of transfection adjuvant, and transfection medium up to 50 µL for each well (see Table of Materials). Prepare a master solution considering the total number of wells in the experiment.\nRemove the culture medium by manual pipetting and add 50 µL/well of the solution prepared in step 1.4 by pipetting. Incubate at 37 °C, 5% CO2.\nh after transfection, remove the transfection medium by pipetting and add 25 µL/well of 4% paraformaldehyde (PFA) in PBS.",
    "CAUTION: Paraformaldehyde is a toxic fixative; use appropriate PPE.\nIncubate for 5 min at room temperature (R.T). Remove the fixing solution by pipetting and wash once by adding 50 µL/well of PBS. Remove PBS by pipetting.\nPipette 25 µL/well of TBS with 0.05% Tween (TBS-T) and 10% normal donkey serum (NDS, see Table of Materials). Incubate for 1 h at R.T. to block any unspecific signal.\nPrepare a solution of Rabbit-anti-α-synuclein antibody MJFR1 1:1000 together with Mouse-anti-TOMM20 antibody 1:100 in TBS-T (see Table of Materials) according to the number of wells to analyze.\nRemove the blocking solution from step 1.8 by pipetting and add 25 µL/well of the mixture of primary antibodies prepared in step 1.9. Incubate overnight at 4 °C.\nRemove the primary antibody solution and wash three times by adding and removing 50 µL/well of TBS-T by pipetting.\nPrepare a solution of green secondary antibody anti-Mouse 1:1000 together with red secondary antibody anti-Rabbit 1:1000 in TBS-T (see Table of Materials) according to the number of wells to analyze.\nAfter aspirating the PBS from the last wash described in step 1.11, add 25 µL/well of the secondary antibody mixture using a pipette and incubate the plate for 1 h at R.T.\nRemove the secondary antibody solution by pipetting and add 25 µL/well of 2 g/mL DAPI in TBS-T. Incubate the plate for 5 min at R.T.\nRemove the DAPI solution using a pipette and wash three times by adding and removing 50 µL/well of TBS-T with a pipette.\nPipette 80 µL/well of PBS with 0.02% sodium azide and store the plate at 4 °C.\n\tCAUTION: Sodium azide is toxic; use appropriate PPE.\nCapture images using a high-content automated fluorescence microscope or equivalent confocal imaging system equipped with a 60x objective (see Table of Materials).",
    "Perform analysis of the TOMM20 signal of single cells using Fiji following steps 3.15-3.21. Avoid any cells undergoing apoptosis, necrosis, or mitosis.\n\t​NOTE: To do so, we exclude from the analysis the cells showing those morphological features of apoptosis, necrosis, or mitosis that are visible under the microscope, such as cell shrinkage, membrane blebbing, cell detachment, nuclear condensation, DNA fragmentation, and condensed nuclear chromatin organized into thick strands aligned in a single plane.\n2. The generation of PFFs and PFF intracranial injections in mice\nNOTE: The generation of injection material and the intracranial injection process are presented here. This protocol is adapted from Luk et al.25.\nTo obtain PFFs, place a tube/flask containing 0.5 mL of α-Syn (5 mg/mL; Peptide, see Table of Materials) on a shaker at 37 °C and 250 r.p.m. for 7 days to induce aggregation of α-synuclein.\nSonicate the aggregated α-synuclein at 20% amplitude and 0.25 cycle duty until optimal fragmentation was achieved and observed by negative staining of the samples with transmission electron microscopy.\nTo prepare male and female wild-type C57Bl/6 mice (3 months old) for striatal PFF injections, administer Meloxicam/Metacam (5 mg/kg) in saline solution subcutaneously. Also administer 1 mL of the sterile saline solution via two 0.5 mL subcutaneous injections per animal. These treatments prevent dehydration, inflammation, and pain.\nInduce anesthesia with 4% isoflurane and 0.7 L/min O2 in an induction chamber. Check the depth of anesthesia by the lack of pedal response.\nShave the upper part of the mouse head and gently insert the animal into the frame of the stereotactic apparatus on a heat mat.\nMaintain the anesthetic plane by providing animal inhalation anesthesia (1%-2% Isoflurane in 0.7 L/min O2) through a face mask during the whole injection process.",
    "Place the animal on the stereotactic frame. Disinfect the operating area with three rounds of alternating chlorhexidine scrub and 70% ethanol. Apply Marcaine/Bupivacaine locally (around 100 µL) as a subcutaneous infiltration of 0.25%.\nPerform a 0.5 cm incision of the skin to expose the skull and drill a 1 mm diameter hole into the skull to expose the brain surface, in the following coordinates from Bregma: - 0.5 mm anteroposterior, +/− 2.5 mm mediolateral.\nInject 1.5 L of PFFs obtained in step 2.2 by stereotactic delivery to the coordinates indicated in step 2.8 from Bregma and -2.7 mm dorsoventral (from the top brain) at a flow rate of 100 nl/min with a 32-G Hamilton syringe. Withdraw the syringe 5 min post-injection.\nSuture (size: 4-0, 45 cm, see Table of Materials) the wound with three to five stitches as required, and bond each of them with 2 double knots and then a single knot. Stop anesthetic inhalation and remove the mouse from the frame.\nLeave the mouse to recover in an appropriate recovery cage before returning it to its home cage.\nDuring the following week, perform daily postoperative checks. Any animal's pain, distress, or discomfort should be dosed with Meloxicam/Metacam as indicated in step 2.3 every 24 h.\nThree months later, inject 300 µL of 200 mg/mL sodium pentobarbital in saline solution via an intraperitoneal injection. Once the pain reflex is lost, make an incision (2-3 cm) on the chest and lift the ribs to expose the heart.\nTranscardially perfuse with 10 mL of PBS and 35 mL of 4% paraformaldehyde in PBS one after the other at 5 mL/min using a 50 mL syringe connected to a 23 G butterfly needle.",
    "Remove the brain and postfix in 4% PFA for an additional 24 h at 4 °C. Store it in 70% ethanol at 4 °C after PFA treatment.\nPut the brain into appropriate plastic embedding boxes (see Table of Materials) and incubate in 95% ethanol for 1 h at R.T. Repeat the step in fresh 95% ethanol and incubate again for 1 h.\nTransfer brains to 100% ethanol for 1 h at R.T. Repeat the step in fresh 100% ethanol and incubate again for 1 h.\nTransfer brains into xylene or xylene substitute for 1 h at R.T. Repeat in fresh solution and incubate again for 1 h.\nRemove the xylene or xylene substitute and incubate the sample in warm paraffin for 1 h. Replace the paraffin and incubate for an additional hour.\nMount the brain on the embedding boxes with warm paraffin and let it dry overnight. Prepare 5 µm sections using a microtome (see Table of Materials) and mount them on glass slides.\n3. Mitochondrial morphology analysis by immunohistochemistry on paraffin-embedded brain slices from PFF-injected mice\nDewax the slides by dipping in xylene substitute ten times. Incubate the slides for 2 min in xylene substitute. Dip again ten times in xylene substitute.\n\tNOTE: This step is necessary to remove the paraffin and enable the rehydration of the samples.\nRehydration: repeat the procedure described in step 3.1 with the following solutions: 100% EtOH, 95% EtOH, 70% EtOH, and twice with ddH2O in order.\nPerform antigen retrieval and immunostaining following the steps below.\n\t\nStart by transferring the samples to a microwavable container with ddH2O.",
    "Warm-up 100x citrate buffer pH 6 (see Table of Materials) stored at 4 °C (detergents may have precipitated) and prepare 350 mL of fresh 1x citrate buffer. Then pour the citrate buffer into a convenient plastic container with a lid.\nPut the slides into the citrate buffer container (CRITICAL: check that the slides are beneath the level of the buffer) and put the lid on.\n\t\tCAUTION: Ensure the lid is NOT completely closed, otherwise the container may burst in the microwave.\nMicrowave at 700 W: 4 min + 5 min rest, 1.5 min + 5 min rest. Top-up citrate buffer and microwave again 1.5 min + 5 min rest, 1.5 min + 5 min rest, 1.5 min + 5 min rest.\nCool down the samples in citrate buffer on ice for 20 min. Wash the sample with ddH2O.\n\t\tNOTE: Antigen retrieval may vary according to specific antibody requirements.\nDry the sample slides with paper towel without touching the tissue. Draw rectangles with a pap pen (see Table of Materials) around the pieces of tissue.\nTransfer all slides to a slide immune-staining box and wash a couple of times gently with TBS + 0.05 % TWEEN (TBS-T). Check TBS-T drops stay inside the pap-pen rectangles.\nRemove TBS-T from the samples by tapping on paper towel. Add 50 µL of a blocking solution (10% NDS in TBS-T) into each rectangle (without touching the tissue) and incubate for 1 h at RT.\n\tNOTE: Volumes may vary according to the size of the tissue; try to ensure that: (1) the pap-penned area is similar across samples, and (2) the area is fully covered by the chosen buffer volume.",
    "Remove the blocking solution from the samples by tapping a paper towel. Gently pipette 50 µL/rectangle of the following primary antibody mixture in TBS-T: anti-Tyrosine Hydroxylase 1:250 together with anti-VDAC1 1:100 and anti-pSer129 α-synuclein EP1536Y 1:2000 (see Table of Materials).\nIncubate overnight at 4 °C.\nWash by pipetting TBS-T on the slides and remove it by tapping on paper towel. Repeat three times.\nAdd by pipetting 50 µL/rectangle of secondary antibody mixture: green secondary anti-Chicken, red secondary anti-Mouse, and far red secondary anti-Rabbit 1:1000 in TBS-T (see Table of Materials). Incubate at 37 °C for 1 h in the dark.\nWash three times with TBS-T as described in step 3.13.\nIncubate with DAPI 2 µg/mL in TBS-T for 1 min. Remove the DAPI solution by tapping on paper towel. Wash three times with TBS-T as described in step 3.13.\nMount a glass coverslip on the samples using 2 drops/slide of mounting reagent (see Table of Materials). Press the coverslip gently to eliminate bubbles and let the samples dry for 1 h at R.T. Afterwards, store at 4 °C in the dark.\nImage at least 50 cells in different fields using structured illumination fluorescence imaging system equipped with 60x oil objective or confocal technology.\nPerform analysis of the VDAC1 signal of single cells using Fiji as indicated in the following steps.\n\t\nFirst, select and isolate the region of interest (ROI) by drawing a contour around the positive or negative cell (as appropriate) and using the \"Crop\" function. In order to avoid bias in ROI selection, choose it by considering the fluorescence signal of a marker unrelated to the analysis (i.e., not a mitochondrial marker).\nOptional: if the image is excessively pixelated, use the \"smooth\" function to obtain a higher edge definition.",
    "NOTE: Should the smooth function be applied to an image, please apply it to all subsequent images.\nOptional: use the \"Convolve\" function (Kernel mode, in Process > Filters) to reduce the background.\n\tNOTE: This is optional and usually not necessary when using 5 m sections due to the thinner nature of the sections.\nActivate the shape descriptors and limit to threshold options on the \"Set measurement\" function (ensure these are activated through the analysis).\nIn the \"Adjust\" menu, select the threshold function and adjust the threshold level. The threshold settings must be maintained for all cells of the same sample.\n\t\nTry to ensure adequate visualization of the mitochondrial network, as shown in the representative images of this article, while discarding background pixels.\nUse the Analyze particles tool on Analyze tab. Set an appropriate size to capture the mitochondria. In this example, size: 25-Infinity, activate: Pixel units, and select: Show: Masks commands were used to visualize the result. Fiji will calculate and display the counts, Aspect Ratio (AR), and other shape parameters in a new panel.\nPerform statistical analysis of the data as appropriate. In this experiment, the t-test was used to analyze the difference in average Aspect Ratio (AR) and Counts calculated by Fiji between the experimental groups after normality testing with the D'Agostino and Pearson normality tests."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}