{
  "id": 7134,
  "origin_website": "Bio",
  "title": "Chromatographic Analysis for Targeted Metabolomics of Antioxidant and Flavor-Related Metabolites in Tomato",
  "procedures": [
    "Extraction of MetabolitesCollect 10 ripe tomato fruits (average fresh weight was 65 g), bulk and dice. Take 100 g sample and lyophilize for two days (make sure they are completely dry). Grind the dried samples with a knife grinder and obtain a fine powder.Weigh 1 g of dried sample and add 5 ml of extraction solvent 1 (see Recipes) to extract the apolar metabolites. Extract the metabolites by shaking on an orbital shaker at 400 rpm at 18 °C overnight.Centrifuge the samples at 3,724 × g at 4 °C for 20 min. Save the supernatant and do a second overnight extraction with the pellet using the same solvent.Centrifuge the samples again and combine the extracts. Aliquot the extracts (1 ml) and store at -80 °C until the analysis.To extract the polar metabolites, use the pellet obtained in Step A4 and follow the same steps 1-4 using extraction solvent 2 (see Recipes). Aliquot the extracts (1 ml) and store at -80 °C until the analysis.See Note 1.HPLC Analysis of MetabolitesCarotenoids Two different methods were used for the analysis of carotenoids: method 1 for the analysis of lycopene and β-carotene; method 2 for the analysis of lutein and zeaxanthin.Method 1:Prepare standard solutions of lycopene in methanol:acetone (1:1, v:v) at 1, 5, 10, 25, 50 and 100 ppm concentrations, and β-carotene in dichloromethane at 1, 5, 10, 25, 50, 100 ppm concentrations.Add 0.05% trimethylamine to ethyl acetate and acetonitrile. Filter methanol, ethyl acetate and acetonitrile through membrane filter using vacuum filtration.Use methanol:ethyl acetate:acetonitrile at 50:40:10 (v:v:v) ratio as the mobile phase for isocratic elution.Use RP column and set the column temperature at 30 °C. Set the flow rate as 1.5 ml/min.Filter the sample and the standard solutions through syringe filter. Inject 20 µl of the sample or the standard solution.",
    "Detect lycopene and β-carotene at 469 nm.See Notes 2 and 3.A chromatogram for 100 ppm standard molecules (Figure 1), standard curves (Figure 2) and the sample chromatogram for tomato (Figure 3) are shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015437_6463.jpgFigure 1. Chromatogram of lycopene and β-carotene standards imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013012_6810.jpgFigure 2. Standard curves of the carotenoids imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013036_8224.jpgFigure 3. Sample chromatogram for tomato sample showing lycopene and β-carotene peaks Method 2:Prepare standard solutions of lutein and zeaxanthin in dichloromethane containing 0.01% BHT at 0.5, 1, 5, 12.5, 50, 100, 200 and 300 ppm concentrationsAdd 0.05% trimethylamine to acetonitrile. Filter methanol and acetonitrile through membrane filter using vacuum filtration.Use methanol:acetonitrile at 90:10 (v:v) ratio as the mobile phase for isocratic elution.Use a RP column and set the column temperature at 30 °C. Set the flow rate as 1 ml/min.Filter the sample and the standard solutions through syringe filter. Inject 20 µl of the sample or the standard solution. Detect lutein and zeaxanthin at 469 nm.See Notes 2 and 3.Chromatogram for 50 ppm standard molecules (Figure 4), standard curves (Figure 5) and the sample chromatogram for tomato (Figure 6) are shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013052_2808.jpgFigure 4. Chromatogram of lutein and zeaxanthin standards imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013110_9946.jpgFigure 5. Standard curves of the carotenoids imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013124_9285.jpgFigure 6. Sample chromatogram for tomato with lutein and zeaxanthin peaks Vitamin C Prepare standard solutions of vitamin C in ultrapure water at 10, 50, 100, 150, 200 and 250 ppm concentrations.Filter methanol and phosphate buffer through membrane filter using vacuum filtration.Use methanol: KH2PO4 10:90 (v:v) ratio as the mobile phase for isocratic elution.Use RP column and set the column temperature at 40 °C. Set the flow rate as 1 ml/min.Filter the sample and the standard solutions through syringe filter. Inject 20 µl of the sample or the standard solution. Detect vitamin C at 265 nm.See Note 2.",
    "Chromatogram for 100 ppm standard molecule (Figure 7), standard curve (Figure 8) and the sample chromatogram for tomato (Figure 9) are shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013151_4630.jpgFigure 7. Chromatogram of vitamin C standard imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013207_5676.jpgFigure 8. Standard curve for vitamin C imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013220_6013.jpgFigure 9. Sample chromatogram for tomato with vitamin C peak Vitamin E Prepare standard solutions of vitamin E in acetonitrile:methanol (80:20, v:v) at 10, 50, 100, 150, 200, 250, 300 and 500 ppm concentrations.Filter methanol and acetonitrile through membrane filter using vacuum filtration.Use methanol:acetonitrile 25:75 (v:v) ratio as the mobile phase for isocratic elution.Use RP column and set the column temperature at 40 °C. Set the flow rate as 1.5 ml/min.Filter the sample and the standard solutions through a syringe filter. Inject 20 µl of the sample or the standard solution. Detect vitamin E with the fluorescence detector at 300 nm excitation and 360 nm emission.See Note 2.Chromatogram for 500 ppm standard molecule (Figure 10), standard curve (Figure 11) and the sample chromatogram for tomato (Figure 12) are shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013235_2330.jpgFigure 10. Chromatogram of vitamin E standard imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013940_3889.jpgFigure 11. Standard curve of vitamin E imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303013956_1817.jpgFigure 12. Sample chromatogram for tomato with vitamin E peak Phenolic acids Prepare standard solutions of phenolic acids in methanol at 1, 5, 10, 20, 30, 40, and 50 ppm concentrations.Filter NH4H2PO4, acetonitrile and H3PO4 through membrane filter using vacuum filtration.Use NH4H2PO4 (Mobile phase A), acetonitrile (Mobile phase B), and H3PO4 (Mobile phase C) as the mobile phases for gradient elution. See Table 1 for gradient elution parameters.Table 1. Gradient elution parameters table:",
    "﻿0,1,2,3,4\nTime (min),Flow rate (ml/dk),Mobile Phase A %,Mobile Phase B %,Mobile Phase C %\n0,1,100,0,0\n2,1,100,0,0\n5,1,92,8,0\n17,1,0,14,86\n22,1,0,18,82\n29.5,1,0,21,70\n55,1,0,33,67\n70,1,0,50,50\n75,1,0,50,50\n78,1,20,80,0\n81,1,20,80,0\n86,1,100,0,0",
    "Use RP column and set the column temperature at 35 °C. Set the flow rate as 1 ml/min.Filter the sample and the standard solutions through a syringe filter. Inject 20 µl of the sample or the standard solution. Detect phenolic acids with PDA detector at different wavelengths. Epigallocatechin, epicatechin and chrysin are detected at 204 nm. Hydroxybenzoic acid, vanillic acid, myricetin and quercetin are detected at 254 nm. Gallic acid, catechin, syringic acid and cinnamic acid are detected at 280 nm. Chlorogenic acid, caffeic acid, coumaric acid, ferulic acid, sinapic acid, resveratrol, apigenin and pterostilben are detected at 320 nm. Luteolin is detected at 360 nm, while cyaniding, pelargonidin and peonidin are detected at 520 nm.See Note 2.Chromatogram for 50 ppm standard molecules (Figure 13), standard curves (Figure 14) and the sample chromatogram for tomato (Figure 15) are shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303014015_6631.jpgFigure 13. Chromatograms of standard molecules imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303014558_8618.jpgFigure 14. Standard curves of phenolic acids imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303014924_1557.jpgFigure 15. Sample chromatogram for tomato showing peaks for phenolic acids Glutathione Prepare standard solutions of phenolic acids in methanol at 10, 50, 100, 150, 200, 250 ppm concentrations.Filter trifluoroacetic acid and methanol through membrane filter using vacuum filtration.Use trifluoroacetic acid:methanol (97:3, v:v) as the mobile phase for isocratic elution.Use RP column and set the column temperature at 35 °C. Set the flow rate as 0.2 ml/min.Filter the sample and the standard solutions through a syringe filter. Inject 20 µl of the sample or the standard solution. Detect oxidized and reduced form of glutathione with PDA detector at 208 nm.See Note 2.Chromatogram for 50 ppm standard molecules (Figure 16), standard curves (Figure 17) and the sample chromatogram for tomato (Figure 18) are given below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303014942_2457.jpgFigure 16. Chromatogram of reduced and oxidized glutathione standards imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015020_5568.jpgFigure 17. Standard curves reduced and oxidized glutathione imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015036_3567.jpgFigure 18.",
    "Sample chromatogram for tomato with glutathione results Sugars Prepare standard solutions of sugars (glucose, fructose and sucrose) in ultrapure water at 100, 150, 200, 250, 300, 500, 750, 1,000, 1,500, 2,000, 2,500 ppm concentrations.Filter trifluoroacetic acid and methanol through membrane filter using vacuum filtration.Use acetonitrile: water (90:10, v:v) as the mobile phase for isocratic elution.Use RP column and set the column temperature at 40 °C. Set the flow rate as 1 ml/min.Filter the sample and the standard solutions through a syringe filter. Inject 20 µl of the sample or the standard solution. Detect sugars with RI detector using positive mode.See Notes 2 and 4.Chromatogram for 50 ppm standard molecules (Figure 19), standard curves (Figure 20) and the sample chromatogram for tomato (Figure 21) are given below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015053_0368.jpgFigure 19. Chromatogram of glucose, fructose and sucrose standards imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015117_7907.jpgFigure 20. Standard curves of sugars imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015136_1424.jpgFigure 21. Sample chromatogram for tomato showing peaks for sugars. Sucrose was not detected in fully ripe fruit.GC Analysis of MetabolitesOrganic acids Weigh standard molecules and dissolve them in methoxamine hydrochloride (40 µl, 20 mg/ml in pyridine) at 0.25, 0.5, 1, 2.5, 5, 7.5, 10 mg/ml concentrations.Take 100 µl of the sample. Evaporate the organic solvent of the sample using a vacuum evaporator at 30 °C until completely dry.Dissolve the tomato sample in methoxamine hydrochloride (40 µl, 20 mg/ml in pyridine) in an ultrasonic bath for 5 min.Derivatize both the samples and standard molecules at 37 °C for 90 min.Perform the second derivatization with MSTFA. Add 60 µl MSTFA to the samples and the standard molecules, and incubate at 37 °C for 30 min.Centrifuge the samples at 25,830 × g, 5 min.Inject the supernatant into GC-FID.Analyze the organic acids on an Rtx 5DA column with a thermogradient program.",
    "Set the column temperature from 100 °C (1 min hold) to 150 °C at a rate of 5 °C min-1, from 150 °C (1 min hold) to 280 °C at a rate of 5 °C min-1, 2 min hold at the final temperature.Hold the injection port temperature at 250 °C, and detector temperature at 300 °C. Use nitrogen as the carrier gas, and adjust the split ratio 1/25.See Notes 5 and 6.Chromatogram for 1 mg/ml standard molecules (Figure 22), standard curves (Figure 23) and the sample chromatogram for tomato (Figure 24) are given below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015150_2057.jpgFigure 22. Chromatogram of organic acid standards imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015205_8537.jpgFigure 23. Standard curves of organic acids imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210303/20210303015218_5507.jpgFigure 24. Sample chromatogram for tomato showing peaks for organic acids"
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}