{
  "id": 6338,
  "origin_website": "Bio",
  "title": "Integrin Dependent RhoB Activation Assay Using Leukocytes",
  "procedures": [
    "Coating of coverslipsClean 6 coverslips (diameter 32 mm) by incubating them in 70% ethanol for 5 min and rinse with distilled water. Let the coverslips air dry before use.Note: We use 6 coverslips for ICAM-1Fc to get roughly the same amount of protein as in 1 ml soluble T cells (2 x 107 ~2 mg of total protein).  To coat the coverslips, place the 32 mm coverslips in a 6-well dish and add 500 μl of 5 μg/ml ICAM-1 Fc in PBS. Add a second coverslip on top. This sandwich reduces the amount of ICAM-1 Fc required for coating.Note: We are using in-house made ICAM-1Fc 5 μg/ml, but there is commercially available ICAM-1Fc as well. Incubate overnight at 4 °C.Separate the two coverslips by removing the top one with forceps and turn over the coverslip, so that the coated side faces upwards and place the coverslip in an empty well. Block unspecific binding by adding 2 ml of 2.5% BSA in PBS and incubate for 1 h at room temperature (RT).Wash twice with 1 ml PBS and once with 1 ml HBSS.Add 1 ml HBSS wash buffer (Recipe 1) to keep the coverslips wet before adding cells. Remove this liquid before adding cells.Adhesion of human primary T lymphocytes on ICAM-1 Wash 8 x 107 T lymphocytes (see Notes) in HBSS wash buffer and centrifuge at 300 x g for 10 min at 4°C.Resuspend cells into 2 x 107/ml in migration buffer (Recipe 2).Transfer 1 ml cells into a microfuge tube for an unstimulated control and then 1 ml on top of each of the ICAM-1 coated coverslips in the 6-well plate for the LFA-1 activation samples. Incubate all samples at 37 °C for 20 min.Centrifuge the microfuge tube at 300 x g for 10 min at 4 °C.",
    "Wash twice with ice cold PBS.Remove and discard the suspension carefully from the wells and the supernatant from the microfuge tube. Important: Keep both the plate and microfuge tube on ice all the time. Resuspend the cell pellet in the microfuge tube in 500 μl lysis buffer containing protease inhibitors and incubate on ice for 20 min. Add 500 μl lysis buffer containing protease inhibitors into the first well with an ICAM-1 Fc coated coverslip and pipette up and down to lyse the adhered cells, then transfer the suspension into the adjacent well until all adhered cells have been lysed. Transfer the lysate into a new microfuge tube and incubate on ice for 20 min.Note: Prepare fresh lysis buffer from the 5x Lysis buffer included in the kit and add protease inhibitors (1 tablet/10 ml lysis buffer). Clear the lysates by centrifugation at 14,000 x g for 10 min at 4 °C.Transfer the supernatant to a new microfuge tube and keep on ice.Measuring protein content using Bradford assayTake 2 μl from each sample and add 58 μl ddH2O (1:30 dilution).Mix and add duplicates to a 96-well plate (10 μl/well).Add also undiluted BSA standard (Bio-Rad, quick start) in duplicates.Dilute Bradford solution 1:5 in ddH2O.Add 200 μl of diluted Bradford solution per well.Incubate at RT for 10 min, keep dark.Measure absorbance with a plate reader at 595 nm wavelength.Calculate protein concentration from the standard curve obtained.Dilute the samples in lysis buffer to the exactly same concentration and remove 50 μl from each sample for total cell lysate (TCL). RhoB activationNote: When setting up the assay, include the positive (GTPγS) and negative controls (GDPγS) and follow the manufacturer’s protocol and use additional number of cells in solution for this step.",
    "Add equal amounts of lysates to microcentrifuge tubes and adjust the volume of each sample to 1 ml with lysis buffer.Thoroughly resuspend the Rhotekin RBD agarose bead slurry included in the kit by vortexing or triturating.Quickly add 40 μl of resuspended bead slurry to each tube.Incubate the tubes at 4 °C for 1 h with gentle agitation.Pellet the beads by centrifugation at 14,000 x g for 10 s.Aspirate and discard the supernatant.Wash the beads 3 x with 0.5 ml of lysis buffer each.Carefully remove the supernatant and resuspend the pellets in 40 μl 2x SDS-PAGE sample buffer.Boil each sample at 97 °C for 5 min.Centrifuge each sample at 14,000 x g for 10 s.Note: We prefer to run our samples fresh and in our hands this works best for RhoB antibodies. Otherwise, you can freeze your samples at -80 °C until you proceed to next step.Western blottingRun on an 8% polyacrylamide gel and do not forget the TCL for the total amount of proteins.Note: We load the pulldown of active RhoB and TCL on separate gels. It is always good to also include the RhoB immunoblot positive control since the RhoB antibodies are tricky to work with. We load 20 μl in each well. Transfer at 90 V for 110 min.Note: We used PVDF membrane and PBS for all our antibodies. If you use the RhoB antibody provided in the kit, use PVDF and TBS. PVDF membrane needs to be activated in 100% methanol prior to transfer. Rinse in PBS/0.1% Tween 20.Block the membrane in 5% milk powder in PBS/0.1% Tween 20 for 2 h at RT.Rinse in PBS/0.1% Tween-20.Incubation with primary antibodies:Membranes with pulldown active RhoB samples are stained with RhoB (1:500) and LFA-1 (1:1,000).",
    "Membranes containing TCL samples are stained with Actin (1:2,000), RhoB (1:500) and LFA-1 (1:1,000) overnight at RT. Notes:We used the RhoB polyclonal antibody clone sc-180 (batch specific) from Santa Cruz Biotechnology and not the one included in the kit since clone sc-180 works better for the primary T lymphoblasts we use.  To be able to detect the interaction of LFA-1 with active RhoB we stained with total LFA-1 (clone m38) on the membrane run with pulldown samples. We used in-house produced m38 antibody. However, the same clone is commercially available. We always stain the TCL with actin for loading control as well as RhoB and LFA-1 to see the total amount of these proteins. Wash 3 x 5 min in PBS/0.1% Tween 20.Secondary antibody incubation: anti-rabbit-HRP (1:2,000)/anti-mouse-HRP (1:10,000) for 1 h at RT.Wash 3 x 10 min in PBS/0.1% Tween 20.ECL detection."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}