{
  "id": 18924,
  "origin_website": "Jove",
  "title": "Quantitative Multispectral Analysis Following Fluorescent Tissue Transplant for Visualization of Cell Origins, Types, and Interactions",
  "procedures": [
    "Syngeneic Murine Bone Marrow Transplantation (BMT) as approved by institutional IACUC protocols (Note: Success of this protocol requires utilization of any labeled cell type(s) as the target for multispectral analysis, and to facilitate the downstream analysis, one can exploit any genetic or stable cellular labeling. We suggest that any cell, tissue, or organ-to-be can be applied to a transplant model and that the transplant can contain as many unique labeled populations as the research deems useful. Additionally, multi-labeled cellular systems, such as those found in transgenic mice containing multiple lineage restricted-fluorescently labeled populations -can be designed to eliminate transplant complications for the study of certain pathological states.\nLethally irradiate BMT recipient mice with a single dose of 9.5 Gy four hours before reconstitution with donor bone marrow. (BMT GFP recipients should be 6-10 weeks of age).\nWet the mouse pelt with 70% ethanol before clipping and peeling it back to expose the hind limbs with sterile surgical scissors. Remove the entire leg including the iliac crest at the sacroiliac joint. Discard the foot by cutting just above the ankle and then thoroughly remove all muscle, ligaments and excess tissue from bone. Flush marrow from the tibia, fibia and iliac crest with a 23 G needle using 2% sterile FBS in PBS (PBS-2). (BMT RFP donors should be sacrificed according to institutional standards.)\nSlice and gently crush the remaining bone into fragments using a scalpel and forceps and then place into 50 ml conical tube with 3 μg/ml collagenase I for 1 hr at 37 °C at 300 rpm.\nTop off the tube with PBS-2 and collect supernatant into a fresh tube and combine with flushed cells. Spin down at 250rpm for 5 min at 4 °C.",
    "Resuspend cells in PBS-2 and filter through 40 nm cell filter. At this point, the cells can be labeled for fluorescent activated cell sorting (FACS) if one wants to manipulate specific populations for the BMT.\nResuspend 2 x 106 cells per 100 μl PBS, per mouse. Use 29 G needle to systemically inject into irradiated GFP recipient mice by tail or retro-orbital vein-bevel-side-up. Inject one mouse with 100 μl PBS only as engraftment control. Use a heat lamp to dilate vessels prior to injection and use a tail vein injection restraint upon injection. Have sterile gauze available to apply light pressure to the tail post injection.\nThree weeks post BMT, collect blood retro-orbitally and analyze by flow cytometry to confirm the presence of GFP circulating cells and the absence of RFP circulating cells. The control mouse will have died at this point.\n2. Tumor Engraftment According to Institutional IACUC Guidelines\nGrow ID8 ovarian murine tumor cells in vitro prior to in vivo injection (1 x 106 cells per mouse). Day of injection, trypsinize cells, wash with PBS and resuspend in PBS at 1 x 106 cells per 100 μl.\nInject tumor cells into intaperitoneal cavity of the mouse, needle should be bevel-side-up. Sterilize injection sight with 70% ethanol. Inject into the lower left or lower right quadrant of the abdomen (cranial and slightly medial to the inferior set of abdominal nipples of female mouse), avoid hitting the organs. Restrain mouse by grabbing by the scruff and holding the tail with the pinky or ring finger. Mice can be anesthetized with isoflurane for this procedure.\nSacrifice the mice when signs of tumor engraftment, such as slight abdominal bloating, are apparent. This will occur over 4-12 weeks.",
    "Excise tumors from IP cavity. Tumors within the cavity will look like white nodules on and around the surface of the organs. With a scalpel, remove the tumors and place in a tube/jar of 10% formalin for 24 hr fixation. Histological preparation can be out-sourced to pathology/histology core if reagents and materials are not readily available for paraffin embedding and slide preparation. Section tissue into 5-8 μm slices on glass slides for subsequent staining procedures.\n3. Multi-parameter Immunofluorescent Staining\nPrepare Single color control slides for every fluorescent probe utilized in the experiment. In this scenario, four colors are used. Therefore, four slides for each individual color as well as one slide for background noise control and finally one slide for the full combination staining. (Total slides = 6) All slides will be processed side by side in an identical fashion to minimize experimental variation.\nBake paraffin sections at 56 °C for 1 hr.\nWash slides 3x 10 min in xylene.\nWash 2x 5 min 100% ethanol.\nWash 1x 3 min 95%ethanol\nWash 1x 2 min90%ethanol.\nWash 1x 2 min70%ethanol.\nWash 1x 2 min in water. Slowly immerse the staining rack in and out of the water 10x.\nDuring the last wash series, pre-boil sodium citrate buffer for 2 min (microwave on high). (Can replace with tris-EDTA buffer depending on the antibodies in use)\nBoil the slides for 20 min in sodium citrate buffer (microwave on 10% power or in a pressure cooker). If buffer boils, turn off microwave and let sit.\nRemove from heat source and let the slides rest for 30 min in the sodium citrate buffer to cool down.\nRinse the slides in water for 5 min.",
    "Mark around tumor sections with Pap Pen and put 2% BSA/1% FBS maleic acid blocking buffer for 1 hr. Prepare the slides individually as to not let them dry out during this step.\nPrepare primary antibodies at optimal dilution in blocking buffer. (If the antibodies in use are all of different species (or IgG chain variation-ex: IgG1 vs IgG2a of same species) they may be used in combination during a single incubation period. If antibody species overlap, then incubations must be carried out sequentially to minimize antibody cross-reaction.)\nAt this point, leave two slides with blocking buffer only. These two slides will serve as unstained control and nuclear stain control. The other single color controls will be incubated with individual primary antibodies. Only the analysis slide will have a combination of primary antibodies.\nIncubate slides with primary antibody in a moisture chamber box on slow-rotating shaker at 4 ° overnight (~16-20 hr) (Note: when working with 4+ fluorophores, sequential staining or direct conjugation may be necessary to minimize antibody cross-reaction. Under these circumstances repeat steps 1.16-1.21 until all antibodies are applied to the slides.)\nWash slides for 10 min in PBST (2x) gently on shaker\nWhile wash is going, prepare Alexafluor 488, 594 and 647 secondary antibodies for a final dilution of 1:1,000 in blocking buffer. (Make sure these antibodies and dilutions are kept at 4 °C and in the dark at all times to preserve fluorescence across batches and over time.)\nOn the single color control slides, place single Alexafluor dilutions matching the species of the primary antibody used. All secondary antibodies will be placed on the analysis slide. The unstained and the nuclear stained control slides will remain with blocking buffer throughout this step.",
    "Incubate in a moisture chamber box (covered with aluminum foil to avoid light exposure) on slow rotating shaker at RT for 2 hr.\nWash slides for 5 min in PBST (2x) gently on shaker. Cover with aluminum foil to protect from light.\nAdd DAPI (1:10,000) for 1 min to the DAPI-only slide and the analysis slide. Cover with aluminum foil to protect from light. The other slides may be left covered in the wash containers.\nWash the two DAPI-incubated slides in a separate container for the first 5 min wash as to not contaminate the other slides with DAPI stain. For the second 5 min wash, the slides can be combined in PBST (all washes should be conducted on a shaker). Cover with aluminum foil to protect from light.\nBriefly dip slides in water before cover-slipping (1.5 thickness with aqueous mounting media to preserve fluorescence)\nLet dry 3 hr in dark at RT.\nSeal the edges of the cover slip with nail hardener. (Do not use nail polish as the acetone may quench the fluorescent signal).\nAnalyze slides immediately or store at 4 °C for future analysis.\n4. Multispectral Imaging\nCollect multispectral Images utilizing a Nuance EX camera (containing a liquid crystal tunable filter) on an Olympus X-63 upright microscope with Nuance software for data collection.\nCollect images using an oil objective to increase the resolution.\nInitial set-up includes setting the spectral range for each fluorophore in use.\n\t\nFor 4 color:\n\t\t\nDAPI: 420-480nm\nAF488: 490-580nm\nAF594: 590-640nm\nAF647: 650-720nm\nTake an initial image of the analysis slide to obtain the proper exposure times for each of the spectral ranges.",
    "Create \"spectral library\" that the software will use to identify and separate the signal-to-noise ratio of the fluorophores from each other and background signal. (Note: Each fluorochrome must have its own single color control slide in order to assemble a spectral library with appropriate wavelength curves to ensure proper analysis of the data set. Example: 3 fluorophores = 4 control slides; 5 fluorophores = 6 control slides).\n\t\nImage the unstained slide first. This slide will be designated within the spectral library as background.>\nImage the DAPI-only slide second. This slide will be used to designate the DAPI-stained nuclei with the \"draw\" tool and will be saved within the spectral library as DAPI.>\nImage the AF488-only slide third. This slide will be used to designate the AF488-stained regions with the \"draw\" tool and will be saved within the spectral library as AF488.>\nImage the AF594-only slide fourth. This slide will be used to designate the AF594-stained regions with the \"draw\" tool and will be saved within the spectral library as AF594.>\nImage the AF647-only slide fifth. This slide will be used to designate the AF647-stained regions with the \"draw\" tool and will be saved within the spectral library as AF647.>\nFollowing the collection of each individual spectral component, save the spectral library and the protocol.>\nOnce the spectral library is complete, find regions of interest on the analysis slide on the microscope and collect/save images.>\n5. Quantitative Analysis of Multispectral Images\nImport a representative assortment of acquired Nuance images using InForm Software.\nOpen the saved spectral library as directed by the program\nIdentify tissue regions of interest to be analyzed. (e.g. Tumor tissue versus adipose tissue).\nIdentify individual cells based on DAPI-stain. Cytoplasm will be defined automatically based on the shape of the nucleus.",
    "Pick the fluorescent intensity read-out of choice for each fluorescent parameter (e.g. mean, standard deviation)\nBatch the acquired images and let the software process using the proposed algorithm.\nWhen the image processing is finished, merge the result files.\nOpen the results in Excel (or any other analytical software package) and plot two fluorescent intensities against each other on XY axis. Each fluorescent intensity is given per cell. The double positive cells will appear in the upper right quadrant. User must define the baseline fluorescent intensities.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}