{
  "id": 10790,
  "origin_website": "Jove",
  "title": "Fabrication of a Dipole-assisted Solid Phase Extraction Microchip for Trace Metal Analysis in Water Samples",
  "procedures": [
    "Caution! Several chemicals (e.g., acrylamide, 1,1'-dichloroethene) used in these procedures are acutely toxic and carcinogenic. Consult all relevant material safety data sheets (MSDS) prior to use. Follow appropriate safety practices when performing the experiments.\nNote: Unless otherwise stated, carry out all procedures at ambient temperature in a class 100 laminar flow hood.\n1. Fabrication of the Dipole-assisted SPE Microchip\nPreparation of the PMMA Microchip\nNote: The fabrication protocol of the chip was similar to that described elsewhere.8\nDraw the network pattern of the chip (Figure 1(a)) using computer aided design (CAD) software according to the manufacturer's protocol.\nMount a PMMA sheet (350 mm (L) x 20 mm (W) x 2 mm (H)) on the working table of the laser micromachining system and then focus the laser source on the surface of the PMMA sheet.\nSelect the Print in the CAD software and then set the Power, Speed, and Pen Mode as 45% (4.5 W), 13% (99.06 mm sec−1), and VECT through the control panel of the micromachining system.\nNote: Parameters such as Power, Speed and Pen Mode affecting the channel features were investigated in advance. The evaluation method was similar to that proposed by Yuan and Dasa.17 The parameters selected in this study were used to machine an appropriate channel for adaption to conduits without complicated academic purposes. People can select another condition for laser machining in accordance with their need.\nPrint the drawn pattern and then machine the PMMA sheet by the laser micromachining system according to the manufacturer's protocol. Figure 1(b) displays the layout of the fabricated microchip. Figure 1(c) displays the photograph of the cross-section of the machined plate.",
    "Caution! Wear goggles when using the laser system to avoid severe eye damage due to exposure to the laser radiation. An appropriate exhaust system is recommended because of the production of fumes/smoke during laser machining.\nDrill three 1/16-inch diameter access holes for a sample inlet, a buffer inlet, and an eluent inlet on the bottom plate and one for a confluent outlet on the cover plate Figure 1(b).\nCaution! Avoid body contact with the drill bit during the machining procedures to prevent physical injury. Wearing gloves is prohibited when drilling.\nImmerse the machined plates into 1 L of 0.1% (w/v) sodium dodecyl sulfate (SDS) solution in 1-L beaker with agitation via an ultrasonic oscillator for 10 min.\nReplace the SDS solution with deionized water and agitate via an ultrasonic oscillator for 10 min.\nReplace the residual D. I. H2O with fresh one and then immerse the machined plates in 1 L of D. I. H2O with agitation via an ultrasonic oscillator for 10 min. Afterward, dry each cleaned plate with a gentle stream of nitrogen for 2 min.\nAlign the two machined plates with the naked eye and then sandwich the two plates between two glass boards by using binder clips.\nBond the two plates under compression at 105 °C for 30 min.\nCool the sandwich to ambient temperature and then remove the binder clips and glass boards.\nInsert 1/16-inch outer diameter poly(etheretherketone) (PEEK) tubes into the access holes and then secure the conduits with a two-component epoxy-based adhesive.\nDry the adhesive at ambient temperature for 12 hr.\nModification of the Channel Interior of the PMMA Microchip\nNote: The following partially refers to published procedures with slight modifications.8,18,19",
    "Deliver a saturated sodium hydroxide (NaOH) solution at a flow rate of 100 µl min-1 via a peristaltic pump into the microchip for 12 hr (72 ml total delivered volume).\nRemove the residual solution and then rinse the channel interior with D. I. H2O at a flow rate of 100 µl min-1 via a peristaltic pump for 30 min (3 ml total delivered volume).\nRemove the residual D. I. H2O and then deliver a 0.5% (v/v) nitric acid (HNO3) solution into the microchip at a flow rate of 100 µl min-1 via peristaltic pump for 30 min (3 ml total delivered volume).\nRemove the residual solution and then deliver a 50% (w/v) acrylamide solution into the microchip in the dark at a flow rate of 100 µl min-1 via peristaltic pump for 8 hr (48 ml total delivered volume).\nRemove the residual solution and then rinse the channel interior with D. I. H2O at a flow rate of 100 µl min-1 via a peristaltic pump for 30 min (3 ml total delivered volume).\nPump air to remove the residual D. I. H2O with a peristaltic pump and then cover the microchip with an in-house-built photomask allowing the desired region of the extraction channel to be exposed to light.\nNote: The in-house-built photomask was made of a black paper (114 mm (L) x 22 mm (W)) that contained an open window (94 mm (L) x 2 mm (W)) allowing the desired region of the extraction channel to be exposed to light.\nPreparation of the Cl-Containing SPE Formation Solution\n\t\t\nFlush the inhibitor removal SPE cartridge with ethanol amounting to at least three cartridge-volumes.\nFlush the cartridge with 1,1'-dichloroethene amounting to at least three cartridge-volumes prior to use.",
    "Pass 1 ml of 1,1'-dichloroethene through the treated cartridge and then collect the fraction in a sample vial (20 ml) wrapped in aluminum foil.\nAdd 491 μl 1,1'-dichloroethene into the solution containing 12 mg 2,2'-azobisisobutyronitrile (AIBN), 3.18 ml ethanol, and 1.65 ml hexanes in 100-ml glass bottle.\nFill the chip channel with the Cl-containing SPE formation solution (approximately 200 μl) by syringe injection and then expose the microchip to ultraviolet (UV365) irradiation with a maximum emission wavelength of 365 nm for 10 min (light intensity ~2.65 mW cm-2).\nCaution! An appropriate exhaust system is recommended, because of the production of ozone during UV irradiation.\nReplace the residual solution with a fresh Cl-containing SPE formation solution (approximately 200 μl) by syringe injection and then expose the microchip to UV365 irradiation for 10 min again (light intensity ~2.65 mW cm-2).\nRepeat Step 1.2.9 18 times.\nRinse the channel interior with ethanol at flow rate of 100 µl min-1 via peristaltic pump for 30 min (3 ml total delivered volume). After removing the residual solution with peristaltic pump, store the fabricated microchip in a zippered bag for the subsequent use.\n2. Surface Verification of PMMA Modification\nContact Angle Analysis\nCut a PMMA sheet (350 mm (L) x 20 mm (W) x 2 mm (H)) into PMMA substrates (50 mm (L) x 20 mm (W) x 2 mm (H)) by the laser micromachining system.\nImmerse the PMMA substrates in 40 ml saturated NaOH solution in 50-ml conical tube and then agitate the resulting mixtures via a rocking shaker for 12 hr.\nRemove the residual solution and then rinse the PMMA substrates with 40 ml D. I. H2O.\nImmerse the PMMA substrates in 40 ml D. I. H2O and then agitate the resulting mixtures via a rocking shaker for 30 min.",
    "Remove the residual D. I. H2O. Immerse the PMMA substrates in a 40 ml of 0.5% (v/v) HNO3 solution and then agitate the resulting mixtures via a rocking shaker for 30 min.\nRemove the residual solution. Immerse the PMMA substrates in 40 ml of 50% (w/v) acrylamide solution and then agitate the resulting mixtures via a rocking shaker in the dark for 8 hr.\nRemove the residual solution and then rinse the PMMA substrates with 40 ml D. I. H2O.\nImmerse the PMMA substrates in 40 ml of D. I. H2O and then agitate the resulting mixtures via a rocking shaker for 30 min.\nRemove the residual D. I. H2O and then dry each PMMA substrate with a gentle stream of nitrogen for 2 min.\nPreparation of the Cl-Containing SPE Formation Solution\n\t\t\nFlush the inhibitor removal SPE cartridge with ethanol amounting to at least three cartridge-volumes.\nFlush the cartridge with 1,1'-dichloroethene amounting to at least three cartridge-volumes prior to use.\nPass 6 ml of 1,1'-dichloroethene through the treated cartridge and then collect the fraction in a sample vial (20 ml) wrapped in aluminum foil.\nAdd 4.91 ml 1,1'-dichloroethene into the solution containing 120 mg AIBN, 31.8 ml ethanol, and 16.5 ml hexanes in 100-ml glass bottle.\nApply 2 ml of the Cl-containing SPE formation solution onto the surfaces of the PMMA substrates and then expose the substrates to UV365 irradiation for 10 min (light intensity ~2.65 mW cm-2).\nCaution! An appropriate exhaust system is recommended, because of the production of ozone during UV irradiation.\nReplace the residual solution with 2 ml of fresh Cl-containing SPE formation solution and then expose the substrates to UV365 irradiation for 10 min again (light intensity ~2.65 mW cm-2).\nRepeat Step 2.1.12 18 times.",
    "Remove the residual solution and then rinse the PMMA substrates with 40 ml ethanol in a 50-ml conical tube.\nRemove the residual solution and then rinse the PMMA substrates with 40 ml D. I. H2O.\nRemove the residual D. I. H2O and then dry each PMMA substrate with a gentle stream of nitrogen for 2 min.\nDrop 5 μl D. I. H2O onto the PMMA substrates and determine the contact angle by a contact angle meter according to manufacturer's protocol.\nNote: Use the average of three repeated measurements to determine the reported contact angles in each case.\nLaser Ablation (LA)-Inductively Coupled Plasma-Mass Spectrometry (ICP-MS) Analysis\nGrind 8 g of PMMA beads into PMMA powders via a mortar and a pestle.\nImmerse the PMMA powders in 40 ml saturated NaOH solution in a 50-ml conical tube and then agitate the resulting mixtures via a rocking shaker for 12 hr.\nRemove the residual solution by a digital pipette with 5-ml tips and then rinse the PMMA powders with 40 ml D. I. H2O.\nImmerse the PMMA powders in 40 ml D. I. H2O and then agitate the resulting mixtures via a rocking shaker for 30 min.\nRemove the residual D. I. H2O. Immerse the PMMA powders in 40 ml of 0.5% (v/v) HNO3 solution and then agitate the resulting mixtures via a rocking shaker for 30 min.\nRemove the residual solution. Immerse the PMMA powders in 40 ml of 50% (w/v) acrylamide solution and then agitate the resulting mixtures via a rocking shaker in the dark for 8 hr.\nRemove the residual solution and then rinse the PMMA powders with 40 ml of D. I. H2O.\nImmerse the PMMA powders in 40 ml of D. I. H2O and then agitate the resulting mixtures via a rocking shaker for 30 min.",
    "Remove the residual D. I. H2O and then bake the PMMA powders at 60 °C for 8 hr.\nPreparation of the Cl-Containing SPE Formation Solution\n\t\t\nFlush the inhibitor removal SPE cartridge with ethanol amounting to at least three cartridge-volumes.\nFlush the cartridge with 1,1'-dichloroethene amounting to at least three cartridge-volumes prior to use.\nPass 16 ml 1,1'-dichloroethene through the treated cartridge and then collect the fraction in a sample vial (20 ml) wrapped in aluminum foil.\nAdd 14.73 ml 1,1'-dichloroethene into the solution containing 360 mg AIBN, 95.4 ml ethanol, and 49.5 ml hexanes in a 250-ml glass bottle.\nMix the PMMA powders with 6 ml of Cl-containing SPE formation solution in a 50-ml conical tube, and equally transfer 1 ml of the mixture from conical tube into six wells of a 24-well tissue culture plate.\nCover the tissue culture plate with a PMMA board and then expose the tissue culture plate to UV365 irradiation for 10 min (light intensity ~2.65 mW cm-2).\nCaution! An appropriate exhaust system is recommended, because of the production of ozone during UV irradiation.\nReplace the residual solution with 1 ml of fresh Cl-containing SPE formation solution of each well and then expose the tissue culture plate to UV365 irradiation for 10 min again (light intensity ~2.65 mW cm-2).\nRepeat Step 2.2.13 18 times.\nRemove the residual solution and then rinse the PMMA powders in each well with 1 ml ethanol.\nRemove the residual solution and then rinse the PMMA powders in each well with 1 ml D. I. H2O.\nRemove the residual D. I. H2O and then bake the PMMA powders at 60 °C for 8 hr.\nCompress the dried powders (1 g) to a pellet via a hydraulic press machine and then measure the signal for Cl by a LA-ICP-MS system.",
    "Note: The signal for Cl at m/z 35 was selected as an indicator for the implanted C-Cl moieties.\n\t\tA 193-nm laser was used as the ablation source. The Energy, Fluence, Spot Size, and Repetition Rate were set as 75%, 8.85 J cm-2, 100 µm, and 5 Hz. At least 7 repeated measurements for each result were required. The LA-ICP-MS analytical procedures refer to published procedures elsewhere.20\nRaman Spectroscopic Analysis\nPerform the protocol from Step 2.2.1 to Step 2.2.17.\nCompress the dried powders (1 g) to a pellet via a hydraulic press machine and then take the spectra by a Raman spectrometer.\nNote: Use a 780-nm laser line with maximum laser power of 100 mW as the photoexcitation source. Use the region of the Raman spectrum ranging from 550 to 900 cm-1 to investigate the attachment of the C-Cl moieties to the PMMA.\n3. Characterization of the Dipole-assisted SPE Reaction\nPerform the protocol from Step 2.2.1 to Step 2.2.17.\nImmerse 0.5 g PMMA powders in 5 ml of 20% (w/v) manganese nitrate tetrahydrate (Mn(NO3)24H2O) solution and then equally mix the resulting mixtures with 5 ml of 40 mM maleate buffer solution.\nAdjust the pH of the resulting mixtures to 8 by using a pure HNO3 solution and then agitate the mixtures via a rocking shaker for 1 hr.\nRemove the residual solution and then bake the PMMA powders at 60 °C for 8 hr. Store the powders in 15-ml conical tube wrapped in aluminum foil for the X-ray absorption near-edge structure (XANES) analysis.",
    "Note: The Mn K-edge XANES spectra were collected by using 07A and 17C1 beamlines of the National Synchrotron Radiation Research Center (NSRRC, Hsinchu, Taiwan). The electron storage ring was operated with energy of 1.5 GeV and a current of 100-200 mA. A Si(111) double crystal monochromator was used for providing highly monochromatized photon beams with energy of 1 to 15 keV and resolving power (E/ΔE) of up to 5,000.The photon energy was calibrated by Mn standards using the known Mn K-edge absorption inflection point at 6539.0 eV. The Mn K-edge XANES spectra in the region between 6,530 and 6,570 eV were used to investigate the dipole-ion interactions for characterization of the proposed SPE reaction."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}