{
  "id": 20035,
  "origin_website": "Wiley",
  "title": "Preparation of Primary Rat Hepatocyte Spheroids Utilizing the Liquid-Overlay Technique",
  "procedures": [
    "This protocol describes the necessary procedure for the preparation of agarose-coated ULA plates required for PRH spheroid culture. The underlying principle for the production of spheroids using this methodology is that monodispersed cells are capable of reforming a 3D configuration via self-reaggregation if adhesion to the substrate in which they are being cultured is prevented (Kelm et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-bib-0009]). Furthermore, the prevalent theory of self-assembly also suggests that, in the absence of external influences, cells will self-organize into a spherical conformation (Napolitano, Chai, Dean, & Morgan, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-bib-0017]).\nMaterials\nAgarose (high gelling temperature; Merck-Sigma A7174)\nWilliams’ Medium E (basal medium; Merck-Sigma W1878)\nDigital scale, calibrated\n25-ml pipette (Thermo Fisher Scientific Sterilin 10693961) and pipette controller\n250-ml Pyrex glass medium bottle\nAutoclave tape\nSterile reservoirs (STARLAB E2310-1010)\n8-channel multichannel pipettor\n200-µl filter pipette tips (Elkay AER-REF-S96)\n96-well flat-bottom sterile cell culture plate (Thermo Fisher Scientific 10212811)\nZip-lock bags\nProduction of liquid-overlay plates\n1. Weigh out 3 g of agarose using a calibrated digital scale.\n2. Using a pipette controller and 25-ml pipette, transfer 200 ml of basal Williams’ Medium E into a 250-ml Pyrex medium bottle and add the agarose. Mix the solution by inverting the bottle. Note that the agarose will not dissolve until it is heated in the autoclave.\n3. Loosely screw the lid onto the Pyrex medium bottle and secure the lid using autoclave tape. Autoclave this solution.\n3 g of agarose and 200 ml of basal medium will make enough agarose to coat approximately 16 plates.\n4. After autoclaving has finished, ensure that the agarose is completely molten by microwaving prior to coating culture plates.\nNote that solution will be extremely hot, and care must be taken in handling.",
    "5. In the sterile tissue culture hood, pour the autoclaved solution into sterile reservoirs and pipette 100 µl agarose solution (ensure that there are no air bubbles) into the inner 60 wells of a 96-well flat bottom sterile cell culture plate using an 8-channel pipettor.\nNote that the outer wells will not be used to culture spheroids due to a boundary evaporation effect. See Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-fig-0001] for culture plate layout.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7a0f21cc-1786-48ee-9e9e-b192bc96bed5/cptx87-fig-0001-m.jpg</p>\nFigure 1\nSpheroid culture plate layout. Red crosses indicate the wells that are not used for spheroid culture. All other wells are used to seed PRH for spheroid generation.\n6. Allow agarose to set in the tissue culture hood for at least 30 min with the lids left off the 96-well plates.\n7. Replace the lids of the 96-well plates and seal in plastic ziplock bags. Date the bags and ensure that the plates are stored inverted at 4°C.\nPlates can be stored for up to 4 weeks.\n8. Leave culture plates at 4°C for at least 2 weeks to allow for appropriate hydration prior to cell seeding.\nUsing plates within this 2-week period can result in malformation of spheroids.\nIf cost is not a limiting factor, premade ULA plates (Corning 96-well Ultra Low Attachment; Corning Life Sciences; ThermoFisher Scientific 10023683) can be purchased and substituted for the agarose-coated plates for PRH spheroid generation.",
    "This procedure describes the principal methodology for the isolation of hepatocytes from the whole liver of a young adult male Wistar rat, weighing between 175 and 200 g, and the subsequent purification steps for these parenchymal cells. This protocol is a modified version of the two-step collagenase perfusion technique described originally by Seglen (1976[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-bib-0018]). The procedure need not be conducted in an aseptic environment, as the culture of the PRHs is considered relatively “short-term.” In order to achieve the highest number of healthy and viable hepatocytes during the isolation, well-prepared, planned dissection and isolation are essential. This is dependent upon the use of fresh materials and solutions, usually prepared on the morning of the isolation procedure or the night before (e.g., for a Monday isolation, buffers may be prepared on the preceding Friday and stored at 4°C). Additionally, minimization of the time between anesthesia and the purification of isolated hepatocytes is vital. A single liver from a rat typically provides approximately 300 million hepatocytes (Cho, Berthiaume, Tilles, & Yarmush, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-bib-0004]). A single rat liver isolation would, therefore, provide hepatocytes for numerous rounds of spheroid production and hundreds of potential cultures. As such, we suggest the implementation of tissue-sharing schemes as endorsed by the NC3Rs; alternatively, cell suspensions may be cryopreserved and used for other studies at a later date (Stevenson, Morgan, McLellan, & Helen Grant, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-bib-0020]).\nMaterials\nWash buffer for hepatocyte isolation (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0008]), prewarmed to 47°C for a minimum of 30 min\nDigestion buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0003]), prewarmed to 47°C for a minimum of 30 min\nCentrifugation buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0001]), prewarmed to 47°C for a minimum of 30 min\nComplete Williams’ Medium E (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0002])\nCollagenase A (from Clostridium histolyticum; Roche 11088793001)\nDNase I (Merck-Sigma D5025)\nTrypsin inhibitor (type 1-S from soybean; Merck-Sigma 10109886001)\n70% ethanol",
    "Male Wistar rat (175-200 g)\nSagatal (anesthetic; Rhone Merieux Ltd., Harlow, U.K.)\n0.4% (w/v) trypan blue (Thermo Fisher Scientific 15250061)\n5-ml bijou bottles\n50-ml conical tubes (e.g., Corning Falcon)\nBlue roll\nDissection tray\nTape\nCotton tie\nCotton swabs\nPetri dish\nDissection tools including:\n               \nSurgeon's scissors\nCross-action forceps\nIris scissors\nBlunt forceps\n125-µm nylon gauze\n250-ml glass beaker\n25-G needle (VWR 613-0902)\n1-ml syringe (Appleton Woods BD572)\n18-G inflow cannula (portal vein)\nZiplock bags\nPerfusion apparatus including:\n               \nPeristaltic pump\nTubing\nGlass vial for bubble trap\nHeated water bath at 37°C\n0.5-ml microcentrifuge tubes\nHemacytometer and coverslip\nInverted microscope\nPreparation for hepatocyte isolation and culture\nPrepare wash buffer (for hepatocyte isolation), digestion buffer, and centrifugation buffer on the day before the isolation procedure.\nPre-surgery setup (morning of rat hepatocyte isolation)\n1. Pre-warm the wash buffer for hepatocyte isolation, digestion buffer, and centrifugation buffer at 47°C for a minimum of 30 min.\n2. Pre-warm the culture medium (complete Williams’ Medium E) at 37°C.\n3. Pre-cool the centrifuge at 4°C.\n4. Weigh out into three separate 5-ml bijou bottles:\n         \n50 mg collagenase\n6.8 mg trypsin inhibitor\n20 mg DNase I.\nStore bijous on ice along with two 50-ml conical tubes.\n5. Set up culture hood for cell washing—spray hood down with 70% ethanol and put in necessary equipment.\n6. Set up surgical tray for isolation, cotton swabs, blue roll, tape, cotton, petri dish, and dissection tools.\n7. Cut nylon gauze squares ready for isolation (approximately 12 × 12 cm).\n8. Clean 250-ml beaker with distilled water, spray with 70% ethanol, and rinse again with distilled water.\n9. Place 25-G needle, 1-ml syringe, and 18-G cannula next to the dissection tray.\n10. Prepare an additional ziplock bag.\nSet up for surgery",
    "11. Prime the perfusion apparatus with the pre-warmed wash buffer for hepatocyte isolation (∼50 ml; remove as much air as possible). Ensure that the bubble trap contains only buffer and no air bubbles. Ensure that the wash buffer is eluting from the syringe, and begin the procedure.\n12. Secure the bubble trap in the clamp and arrange tubing through the pump teeth so that tubing is able to reach the water bath and easily reach the bubble trap and surgical area.\n13. Adjust the perfusion flow rate to approximately 20 ml/min. Transfer the tubing to wash buffer for hepatocyte isolation.\nIt is vital to adjust the flow rate here appropriately, as a too-low flow rate can lead to incomplete perfusion and low hepatocyte yield, while a too-high flow rate can compromise hepatocyte viability. For higher flow rates, a cotton tie is used to facilitate the retention of the cannula in the portal vein under flow.\nPrepare rat for surgery\n14. Using a 25-G needle fixed on a 1-ml syringe, a dose of Sagatal (1 µl/g) is used to anaesthetize the rat. The fur at the site of perfusion is wiped with 70% ethanol to minimize any contamination of the hepatocytes.\n15. After the rat is immobilized and the eyes stop blinking, the animal is transferred to the surgical tray which has been pre-lined with blue roll, and the animal's limbs are secured to the tray with tape, ventral side up.\n16. Ensure that the animal is insensate before proceeding by pinching firmly on the rear foot pads and watching for a reflex response. Wait for cessation of reflex responses before initiating surgical procedure.\nIn general, this should take between 5 and 10 min.\nPerform surgery",
    "17. A V-shape incision is made through both the skin and muscle from the center of the lower abdomen to the rib cage. The guts are moved to the right to reveal the hepatic portal vein, and a cotton tie is placed around the vein.\n18. The diaphragm is opened and the ribs are cut at either side and pinned back above each forepaw to reveal the thoracic cavity.\n19. The hepatic portal vein is then cannulated with an 18-G cannula, the inner needle is removed to leave the cannula in the vein, and the cotton tie is then tightened. At this point, the heart is removed to allow free flow of perfusion buffers.\n20. Perfuse the liver with the wash buffer and start the timer for 9 min.\nSuccessful cannulation will be followed by a rapid blanching of the tissue, which will become a cream/yellow color.\nDetailed visual instructions on rat hepatocyte isolation can be found in Shen, Hillebrand, Wang, & Liu (2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-bib-0019]).\nDigestion of the liver tissue\n21. When the liver has been perfused for 7 min with wash buffer, add the collagenase A (see step 4; stored on ice) and trypsin inhibitor (see step 4; stored on ice) to the pre-warmed digestion buffer (see step 1) and mix gently. Following perfusion with wash buffer, stop pump and transfer tube to perfuse with digestion buffer.\n22. Perfuse with digestion buffer until the liver is clearly digested under the capsule (approximately 2 min).\n23. While the liver is digesting, prepare the centrifugation buffer (for the release of the cells into the petri dish). Add 20 mg DNase I (see step 4; stored on ice) to 200 ml wash buffer for hepatocyte isolation.\nIsolation and purification of hepatocytes",
    "24. At the end of the digestion, stop the perfusion and transfer the digested tissue to a plastic petri dish containing some of the centrifugation buffer made above in step 23 (wash buffer + DNase I).\n25. Anchor the tissue and break the capsule with cross-action forceps. Disturb the tissue gently with the forceps to release the cells into the centrifugation buffer.\n26. Remove the residual tissue and filter the cell suspension through a 125-µm nylon gauze, which has been pre-wetted with the centrifugation buffer, into the sterile beaker (see step 8). Repeat until few cells are appearing in the buffer.\n27. Split the filtered cell suspension into the two 50-ml pre-cooled conical tubes (see step 4) and allow cells to settle for approximately 10 min on ice.\n28. Remove the supernatant and gently resuspend the cells in the centrifugation buffer. Spin tubes for 2 min at 50 × g, 4°C.\n29. Remove the supernatant and resuspend in complete Williams’ Medium E (25 ml; see step 2).\n30. Centrifuge tubes 2 min at 50 × g, 4°C.\n31. Remove the supernatant and resuspend each pellet in complete Williams’ Medium E (25 ml).\n32. Spin tubes 2 min at 50 × g, 4°C.\n33. Remove the supernatant and pool cells and resuspend pellet in 40 to 50 ml of complete Williams’ Medium E.\nCell counting and viability measurements\n34. To a 0.5-ml microcentrifuge tube, add 90 µl trypan blue and 10 µl of the cell suspension. Mix well.\n35. Put 10 µl of the resulting suspension onto a hemacytometer. Count total cells and blue cells in four quadrants (Q).\n36. Calculate the number of viable cells in the preparation:\nFor each Q, calculate the number of viable cells:\n         imgsrc:/cms/asset/d97350f9-6f5f-4eff-9bcb-ce6ddf47a0fd/cptx87-math-0001.png\nThen calculate the number of viable cells isolated:\n         imgsrc:/cms/asset/c1453765-149d-41ec-81af-a7ac0a8e8eff/cptx87-math-0002.png",
    "imgsrc:/cms/asset/8455aaf4-ca0d-4688-9354-f4f851a47f94/cptx87-math-0003.pngwhere dilution factor = 10\n         imgsrc:/cms/asset/d52913da-8a4a-4c77-ac22-cb1681e5e470/cptx87-math-0004.png\n37. Viability must be ≥85% in order for cell culture to proceed successfully",
    "This protocol has been designed to generate homogenous 3D spheroids from freshly isolated PRHs. It provides instructions as to the spheroid culture conditions required for freshly isolated PRHs. To obtain the cells for 3D spheroids, rat hepatocytes are isolated from young male Wistar rats (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-prot-0002]). Using LOT or ULA plates, PRH spheroids are generated from a specified initial cell seeding density, resulting in spheroids with a uniform size and reproducible phenotypic characteristics. This protocol is initiated directly after the isolation procedure as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-prot-0002].\nMaterials\nFreshly isolated PRHs (stored on ice)\nComplete Williams’ Medium E (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0002])\nPre-prepared agarose-coated 96-well plates (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-prot-0001]; minimum of2 weeks at 4°C for appropriate plate hydration)\nSterile reservoirs (STARLAB E2310-1010)\n200-µl filter tips (Elkay AER-REF-S96)\nMultichannel pipettor\nSterile phosphate-buffered saline (PBS), pH 7.2 (Thermo Fisher Scientific 20012019)\nCentrifuge with rotor adapter for 96-well plates\n1. Agarose-coated 96-well plates are pre-warmed in an incubator at 37°C for 30 min prior to cell seeding.\n2. Agarose-coated 96-well plates are then left to air dry in laminar flow cabinet in order to remove condensation from plate lids.\nIMPORTANT NOTE: This is a vital step in the procedure, as condensation remaining in the lids considerably affects the ability to form spheroids.\n3. Determine how many cells are required for each spheroid and dilute the cell solution to the correct concentration (note that each spheroid is cultured in 100 µl complete Williams’ Medium E). For example, for 2000 cells/spheroid, we require 2000 cells/well in 100 µl, i.e., a cell density of 20,000 cells/ml. Use the C1V1 = C2V2 rule to dilute the cells to the appropriate concentration, taking into account that we require 60 spheroids per plate:\n         \nC1 = Cell density calculated above\nC2 = Cell density required (e.g., 20,000 cells/ml)",
    "V2 = Volume required (e.g., 6 ml per plate. Always make in excess—we suggest 7 ml per plate)\nV1 = Calculate the volume of cell suspension to add to volume required.\nThe number of cells required for each spheroid is dependent on the individual experiment. However, past a certain size, a necrotic core will form. For further details, please refer to Kyfinn et al. (2019).\n4. Add 100 µl of cell suspension to each of the inner 60 wells of the 96-well agarose-coated plate, using a sterile reservoir, multichannel pipettor, and 200-µl filter tips.\n5. Fill the outer 36 wells of the plate with sterile PBS.\n6. After all plates have been seeded with cells, the plates are briefly pulse-centrifuged—90 sec at 100 × g.\nThis is required to ensure that all cells seeded go to the the bottom and center of the well. This will bring cells into close contact and increase the likelihood of spheroid formation.\n7. Incubate for 72 hr undisturbed at 37°C with 5% CO2 until compact spherical structures are visible (ensure that the incubator is not opened and closed within the first 72 hr, as this will disturb the formation of the spheroids).\n8. Change the medium twice weekly by removing 50 µl old medium and adding 50 µl new complete medium.",
    "For PRHs isolated on a Monday, medium changes are required on Thursday (day 3) and the following Monday (day 7). Cell seeding between 2000 and 5000 cells results in the formation of spheroids of approximately 200 to 500 µm in diameter, which are visible by eye. See Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-fig-0002] for examples of a properly formed PRH spheroid typified by a regular and smooth encapsulating membrane around a single spheroid (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-fig-0002]A). Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-fig-0002]B exemplifies the failed formation of spheroids, where the cells have collected in the center of the well but have not resulted in the formation of a single 3D spheroid.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a5a40b46-7d46-4169-8521-ea814691963f/cptx87-fig-0002-m.jpg</p>\nFigure 2\nMorphology of spheroids produced using the liquid-overlay technique (LOT). (A) A phase-contrast image of a properly formed spheroid produced using 4000 PRH at day 3. (B) An example where a spheroid has failed to form correctly. Scale bar = 100 µm.",
    "In our complex spheroid model, the analysis of cellular morphology and location of substructures is facilitated via the implementation of immunofluorescent staining. Immunofluorescence uses a primary antibody against cell-specific markers and a secondary antibody linked to a fluorophore, a fluorescent compound that can emit a detectable light signal upon excitation with specific wavelengths of light. We implemented this protocol to analyze and visualize the formation of secondary structures such as bile-canaliculi-like structures that form throughout the PRH spheroid model, and to ensure that in vivo-like cellular polarization of hepatocytes is achieved.\nMaterials\nSpheroids in 96-well culture plate (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-prot-0003])\nPhosphate-buffered saline (PBS), pH 7.2 (Thermo Fisher Scientific 20012019)\n4% paraformaldehyde pH 7.2 (Merck-Sigma P6148)\nPermeabilization buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0005])\nBlock buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0004])\nAnti-P-gp primary antibody [EPR10364-57] (Abcam ab170904)\nAlexa Fluor 568 donkey anti-mouse secondary antibody (Abcam ab175472)\nImmunofluorescence wash buffer I and II (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-rec-0006])\nHoechst 33342 stain (Abcam ab228551)\nPhalloidin 680 stain (Thermo Fisher Scientific A22286)\nProlong Gold Antifade Mountant (Thermo Fisher Scientific P36934)\nClear nail polish\n96-well microplate (Thermo Fisher Scientific 10212811)\n20-µl filter tips (Elkay AER-OREF-S96)\n200-µl filter tips (Elkay AER-REF-S96)\n1000-µl filter tips (Elkay AER-STE1-A18)\nP20 Gilson repeat pipettor\nP200 Gilson repeat pipettor\nP1000 Gilson repeat pipettor\nAluminum foil\nMicroscope slide, Superfrost, 76 mm × 26 mm (Thermo Fisher Scientific 10149870)\nCover slips 22 mm × 50 mm (Fisher Scientific 12373128)\nKimwipes\nFluorescence microscope\nDay 1: Fixation and permeabilization of spheroids\n1. In the class II biological safety cabinet, spheroids to be stained for immunofluorescence are transferred from the cell culture plate into a fresh 96-well microplate (not agarose-coated) using a P200 repeat pipettor with a 200-µl tip.\nThese PRH spheroids produce high levels of extracellular matrix structures throughout the microtissue, and therefore transferring spheroids from one plate to another does not disrupt the structure.",
    "2. Remove the new plate containing the spheroids from the hood for staining.\nThese are going to be fixed, and therefore no longer require aseptic handling.\n3. Remove medium using a 200-µl repeat pipettor and 200-µl filter tips. Wash the spheroids three times, each time by adding 100 µl PBS and then removing the PBS.\n100-µl volume is used per well for all subsequent steps including antibody incubations.\n4. Fix spheroids with 4% paraformaldehyde for 1 hr at 4°C.\n5. Remove the paraformaldehyde using a 200-µl repeat pipettor and a 200-µl filter tip and discard in a chemical waste bin. Wash the spheroids by adding 100 µl of immunofluorescence wash buffer I and then removing it with a 200-µl repeat pipettor and a 200-µl filter tip. Repeat this three times.\nAfter this step, spheroids can be resuspended in PBS, pH 7.2, and left for ∼2 weeks at 4°C in a sealed plate.\nCells are then permeabilized to allow the penetration of antibodies inside the cell.\n6. 100 µl of permeabilization buffer is added to each well and the spheroids kept at 4°C overnight.\nDay 2: Blocking and incubation with primary antibody\nNonspecific binding is blocked by the addition of bovine serum albumin (BSA). In this study, we monitor hepatocellular polarization and the presence of bile canalicular by the fluorescent localization of P-gp, which is present at the bile canalicular membrane.\n7. Remove permeabilization buffer and add 100 µl block buffer for 2 hr at room temperature.\n8. Dilute Anti-P-gp primary antibody 1:50 in block buffer.\n9. Remove the block buffer and add 100 µl of the primary antibody dilution from step 8. Cover the plate with foil and incubate spheroids overnight at 4°C.\nAs a negative control, incubate additional spheroids without the primary antibody.\nDay 3: Secondary antibody and stains",
    "In order to detect immunofluorescence, secondary antibodies are conjugated with fluorescent tags that are excited at specific wavelengths.\n10. Spheroids are washed with immunofluorescence wash buffer II three times, each time for 1 hr at room temperature.\n11. Dilute Alexa Fluor 488 donkey anti–mouse secondary antibody (1:1000), Hoechst 33342 stain (1:5000), and phalloidin 680 (1:250) together in block buffer.\n12. Remove wash buffer and add 100 µl/well of the secondary antibody/stain mixture prepared in step 11. Note that secondary antibodies are light sensitive and, at this stage, exposure to light should be minimized. Cover the plate with foil and incubate the spheroids overnight at 4°C (without rocking).\nDay 4: Mount cells for visualization\nIn order to maintain cells for immunofluorescent visualization, the spheroids are mounted and maintained in Prolong Gold fixative. Throughout this stage of the protocol, exposure to light should be minimized.\n13. Spheroids are washed with 100 µl wash buffer I for 1 hr at room temperature in the dark.\n14. Transfer spheroid in a small amount of buffer to a Superfrost microscope slide using a P1000 repeat pipettor and 1000-µl filter tip (this ensures that spheroids remain undamaged). Remove excess liquid from the slide using a pipette and Kimwipe.\n15. Add approximately 10 µl of Prolong Gold Antifade Mountant using a P20 repeat pipettor and 20-µl filter tip to cover the spheroid, and gently place coverslip on top.\nBe careful to avoid creating bubbles in the mountant, as this will interfere with imaging analysis. Try to avoid applying too much pressure with the coverslip, as this will distort the spheroid.\n16. Use nail polish to seal the coverslip on the slide and let it dry in the dark for approximately 30 min.",
    "17. Image analysis can be carried out as soon as slides have dried, or slides can be stored in a slide box at 4°C.\nCells will maintain fluorescent signals over a few months (see Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cptx.87#cptx87-fig-0003] for an example of P-gp-stained PRH spheroid and the type of results that should be expected from the immunofluorescent analysis described in this protocol).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1918afb8-b839-4fb7-bbd5-a0d7449b5d28/cptx87-fig-0003-m.jpg</p>\nFigure 3\nP-gp staining of bile canalicular formation throughout spheroids. 3000-cell spheroids were cultured on liquid-overlay plates for 3 days, fixed, and stained with P-gp (green). A maximum intensity projection image was taken at 40× magnification. Scale bar = 20 µm."
  ],
  "subjectAreas": [
    "Toxicology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}