{
  "id": 5380,
  "origin_website": "Bio",
  "title": "Endophytic Microbial Community DNA Extraction from the Plant Phyllosphere",
  "procedures": [
    "Leaves taken from Espeletia sp. plants (50 to 100 g) are transported to the laboratory inside sterile craft paper and Ziploc bags on dry ice. One set of leaves from each plant is then used for endophyte DNA extraction. Whole, intact leaves are first washed with sterile dH2O to remove dirt; this wash is performed by first submerging the leaves in sterile dH2O, sufficient to cover the entire leaf (about 500 ml in a 1 L beaker), and then rinsing with clean dH2O using a 100-1,000 µl micropipette. The intact leaves are placed in NAP buffer (500 ml) in a 1 L sterile beaker and vortexed for 1 min to dislodge epiphytic microbes residing on the plant surface. The fine short hairs, or surface pubescence, present on Espeletia plant leaves are removed by shaving using sterile razors since this facilitates the subsequent sterilization process. After shaving, leaves are rinsed by pipetting three times with sterile H2O (for large leaves this is approximately 100 ml) and then submerged in:500 ml of 90% ethanol for 60 sec in a 1,000 ml beaker.Note: This depends on the size of the leaves; the beaker and the volume of ethanol can be smaller.5.25% sodium hypochlorite solution in a similar beaker for 6 min.70% ethanol for 30 sec. During this sterilization process it is important to completely submerge the leaf samples in each solution, solutions should be sterile and everything should be conducted preferably in a hood to avoid possible contamination from air. Leaf samples are transferred from one solution to another using sterile tweezers.The intact leaf samples are finally rinsed with sterile distilled H2O using the 1,000 µl micropipette. The sterilization is checked by making an imprint of each leaf on a plate of solid malt extract medium using sterile tweezers.",
    "Plates are incubated at 25 °C for up to three weeks, and checked daily for growth. Incubation is done at 25 °C because environmental isolates tend to prefer temperatures below 37 °C. The sterilization process can also be done with liquid medium. The leaf is cut into small pieces using the sterile razor and one gram is weighed out. These 1 g leaf fragments are further cut into 0.1 to 0.5 mm sections using sterile razors and placed in a 1.5 ml Eppendorf tube containing 1 g of sterile 0.1 mm diameter glass beads and 1 ml TE buffer. Alternatively, leaves can also be cut first into 0.1 to 0.5 mm sections, mixed and then weighed to obtain one gram of sample material. The plant material is processed immediately for extraction of DNA, but only those samples that proved to be sterile upon prolonged incubation on solid or in liquid media (step 7) are used for analysis of microbial communities. The plant material is then homogenized at room temperature (20-25 °C) in a Mini-Bead Beater for 5 min at 36 oscillations/sec. The DNA is extracted using the Power Soil DNA Isolation Kit, according to the manufacturer’s instructions, adding the recommended volume of the solution for a single extraction. Note: In some cases more than one individual extraction can be performed for a single sample.Extracted DNA is quantified using a Qubit® 2.0 fluorometer, following the manufacturer’s instructions. It is also possible to visualize the quality of the DNA by gel electrophoresis, but this depends on the amount of DNA obtained, which is usually low."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}