{
  "id": 3682,
  "origin_website": "Cell",
  "title": "Flow cytometry-based ex vivo murine NK cell cytotoxicity assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nActivate NK cells\nTiming: 18–24 h before killing assay, after obtaining pre-poly(I:C) blood samples (optional); 30 min\nThis step uses poly(I:C) to activate NK cells in vivo.\nFor each mouse prepare 300 μg poly(I:C) in DPBS, 200 μL total volume\nInject poly(I:C) intraperitoneally, using an insulin syringe, into each mouse\nEnrich NK cells from splenocytes\nTiming: 1.5 h\nThe enrichment step not only serves to increase the percentage of NK cells in the resulting enriched sample but also normalize the NK cell percentages in experimental groups that could have started with different NK cell numbers. In our experience, the purity after enrichment is similar between groups in each experiment even if they had different NK cell percentages to start as we did in Wagner et al. (2020)[href=https://www.wicell.org#bib3].\nNote: All of the following steps should be performed in a tissue culture hood to ensure sterility\nSacrifice mice and isolate splenocytes\nIsolate spleen from mice, pooling spleens from every 2–3 mice to ensure sufficient NK cell numbers for the killing assay\nNote: We recommend placing the isolated spleens in 1.5 mL cRPMI media and on ice while waiting to be processed.\nNote: We recommend performing steps (b)–(f) one group of pooled spleen at a time. Then proceed to step (g) once all the spleens are ready.\nPlace spleens onto a 70 μm cell filter placed into a petri dish (Figure 1[href=https://www.wicell.org#fig1])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/369-Fig1.jpg\nFigure 1. Dissociation of spleens through filter using a 3-mL syringe plunger\nAdd 2 mL of 1X ACK lysis buffer directly onto the spleens on the filter (Figure 1[href=https://www.wicell.org#fig1])\nUsing a 3-mL syringe plunger, crush spleens through the filter (Figure 1[href=https://www.wicell.org#fig1])\nTransfer all volume into a 15-mL conical\nRinse petri dish with 13 mL DPBS and transfer into the same 15-mL conical",
    "Centrifuge cells at 400 × g, 4 min, 20°C–25°C, aspirate supernatant\nResuspend cells in 500 μL sterile FACS buffer\nNote: To make sterile FACS buffer, filter FACS buffer through a 0.22 μm filter. Keep at 4°C and open only in sterile tissue culture hoods.\nCount live cells with AOPI on the cellometer\nEnrich for NK cells using the STEM CELL TECHNOLOGIES NK EasySep purification kit\nNote: this is a slightly modified version of the official manufacturer’s protocol (https://cdn.stemcell.com/media/files/pis/28043-PIS_1_0_4.pdf?_ga=2.67415057.1840857299.1607959444-1584491980.1604954550[href=https://cdn.stemcell.com/media/files/pis/28043-PIS_1_0_4.pdf?_ga=2.67415057.1840857299.1607959444-1584491980.1604954550]). Here we perform the isolation cocktail and RapidSpheres incubation steps in the same 15-mL conicals that the cells were resuspended in step 3h to minimize cell loss and to incubate all cells from the same sample in the same tube. We transfer the sample to 5-mL tubes after these incubation steps while the manufacturer’s protocol recommends this to be done in 5-mL tubes from the start.\nUsing cell counts from 3i, bring cells to the concentration of 1 × 108 cells/mL in the 15-mL conical in sterile FACS buffer\nNote: If the cell count indicates the concentration is less than 1 × 108 cells/mL, proceed with the 500 μL of samples as that is the recommended minimum volume for the kit.\nAdd 50 μL of Isolation Cocktail (from kit) per mL of sample, pipette up and down to mix\nIncubate at 20°C–25°C for 10 min\nVortex RapidSpheres for 30 s to disperse the particles thoroughly\nAdd 100 μL of RapidSpheres per mL of sample. Pipette up and down to mix\nIncubate at 20°C–25°C for 5 min\nIf the sample volume is greater than 2 mL at this point, divide into 2 tubes, so that each tube has not more than 2 mL of samples\nQ.S. to 2.5 mL with sterile FACS buffer",
    "Mix by gently pipetting then carefully transfer the whole 2.5 mL into a 5-mL polypropylene tube\nPlate the tube without lid into the magnet, and incubate at 20°C–25°C for 5 min\nCarefully pick up the magnet with the tube inside it, then invert the magnet, and tube to decant the enriched cells into a new 15-mL conical tube\nRemove the 5-mL polypropylene tube from the magnet, q.s. to 2.5 mL with sterile FACS buffer and mix\nPlate the tube back into the magnet again, and incubate at 20°C–25°C for 5 min\nCarefully pick up the magnet with the tube sitting inside it, then invert the magnet and tube to decant the enriched cells into the same 15-mL conical as step (k). Immediately proceed to “Set Up Killing Assay” step.\nNote: NK cell purity post-enrichment ranges from ∼50%–80% and will be assessed in the Granzyme B activation panel (“Assess NK cell Activation” step).\nAlternatives: NK enrichment can be omitted so that the killing assay is performed with unenriched splenocytes as effectors, though the effector:target ratios for the killing assay would have to be adjusted as noted in step 6d (Berrien-Elliott et al. 2019[href=https://www.wicell.org#bib1]). If using unenriched splenocytes for effectors, after step 3g, proceed to step 6b.\nSet up killing assay\nTiming: 1 h setup; 4–6 h incubation; variable flow time\nThis step describes the preparation and plating of effector and target cells for the killing assay and the assessment of killing on the flow cytometer after a 4–6 h incubation.\nPrepare complete NK media:\ntable:files/protocols_protocol_369_6.csv\nCritical: This media should be prepared fresh every time.\nPrepare enriched NK cells\nCentrifuge enriched cells at 400 × g, 4 min at 20°C–25°C\nResuspend in 300–500 μL complete NK media\nCount live cells and bring concentration to 2 × 106 cells/mL",
    "Note: This assay as written would require around 4 × 105 cells total, which includes some extra to assess purity and activation in “Assess NK Cell Activation” step. If not enough cells, this assay can be scaled down accordingly. We have had great success with half the number of effectors and target cells scaled down accordingly. In such cases where we scaled down the numbers of cell, we kept the volume of each well the same as described here.\nLabel a V-bottom 96-well plate for assay (Figure 2[href=https://www.wicell.org#fig2] for example)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/369-Fig2.jpg\nFigure 2. Example killing assay plating scheme\nT only, target cells only.\nPlate appropriate number of enriched NK cells for each effector to target ratio and bring volume of each well up to 100 μL:\nFor 5:1 wells (5 enriched NK: 1 Target) → 100 μL of enriched NK cells (2 × 105 enriched NK cells)\nFor 2:1 wells → 40 μL enriched NK cells (8 × 104 enriched NK cells) + 60 μL complete NK media\nFor 1:1 wells → 20 μL enriched NKcells (4 × 104 enriched NK cells) + 80 μL complete NK media\nFor 0.5:1 wells → 10 μL enriched NK cells (2 × 104 enriched NK cells) + 90 μL complete NK media\nNote: Make sure to include a well with Target Cells only and single-color control wells.\nAlternatives: If using unenriched splenocytes as effectors, the effector to target ratios commonly used are 100:1, 50:1, 25:1, and 12.5:1 (Berrien-Elliott et al. 2019[href=https://www.wicell.org#bib1]). The concentration to resuspend the effector cells prior to plating (step 6c) would have to be adjusted accordingly.\nPlace plate into 37°C incubator until target cells are prepared\nReserve and keep left over NK cells on ice for staining in “Assess NK Cell Activation” step to assess NK cell activation and purity",
    "Prepare Target Cells\nRemove some RMA-S from culture flask and count live cells\nTransfer 5 × 106 cells into a 15-mL conical and q.s. to 15 mL with DPBS\nCentrifuge cells at 400 × g, 4 min at 20°C–25°C, and aspirate supernatant\nWash cells once more with 5 mL DPBS; centrifuge cells at 400 × g, 4 min at 20°C–25°C, and aspirate supernatant\nMake up 10 μM CellTrace Violet(CTV) working solution:\nReconstitute stock CTV in 20 μL DMSO per manufacturer instructions (5 mM after reconstitution)\n10 μM CellTrace Violet: 2 μL of 5 mM CTV stock in 1 mL DPBS total\nResuspend target cell pellet in 1 mL DPBS and then add 1 mL of 10 μM CTV, pipet up and down to mix\nIncubate for 15 min in 37°C incubator\nAfter incubation add 10 mL warm cRPMI media into the tube then incubate 5 more minutes in 37°C incubator\nCentrifuge at 400 × g, 4 min at 20°C–25°C\nResuspend cells in 1 mL complete NK media\nCount live cells and dilute cells to 4 × 105 cells /mL\nPlate 100 μL target cells into each well (40,000 target cells per well)\nAt this point, each well should have 200 μL total volume\nGather cells at the bottom of the well by letting centrifuge to get up to ∼200 × g, then stopping the centrifuge\nIncubate for 4 h (up to 6 h) in 37°C incubator\nAt the end of the incubation, make up 7-AAD master mix:\ntable:files/protocols_protocol_369_7.csv\nAdd 10 μL of 7-AAD master mix into each well, mix by pipetting, and transfer into flow tubes\nIncubate at 20°C–25°C for 5 min, and analyze on flow cytometer immediately",
    "Note: It is best to flow 7-AAD stained samples within an hour. If working with large number of wells that will take longer than an hour to finish analyzing the whole plate on the flow cytometer, divide samples into groups, and add 7-AAD to each group immediately before analyzing on the flow cytometry; keep the other groups at 4°C until ready for 7-AAD to be added.\nNote: When setting up voltages on the flow cytometer, use the CTV single color control to make sure the voltage for the CTV channel is set appropriately so that the CTV+ cells are clearly visible.\nNote: The flow cytometry approach of this protocol allows for the inclusion of markers like Annexin V to further identify early apoptotic cells from dead cells. If that is of interest, we suggest spinning down the assay plate after the incubation and perform 7-AAD/Annexin V staining in a buffer suitable for Annexin V staining instead of the FACS buffer.\nAssess NK cell activation\nTiming: 2 h plus flow time; this staining can be performed during the 4 h killing assay incubation\nThis step assesses whether the NK cells have been activated and NK-enriched samples’ purity. This will provide a context in which the data from the killing assay will be interpreted.\nTo ensure NK cells are incubated with target cells as soon as possible after they have been harvested from the mice, we perform this step after the killing assay is set up.\nStain enriched NK cells for activation and purity\nPlate left over enriched NK cells in to a 96-well staining plate, no more than 1–2 × 106 cells per well; 30,000 cells minimum if possible\nCentrifuge plate at 400 × g, 4 min at 20°C–25°C, tap out supernatant\nPrepare surface stain master mix:\ntable:files/protocols_protocol_369_8.csv",
    "Add 100 μL surface stain master mix to each well, mix\nIncubate for 15 min at 4 degrees in the dark\nAfter the incubation, centrifuge at 400 × g, 4 min at 20°C–25°C, tap out supernatant\nWash the plate twice with 200 μL FACS buffer\nAdd FACS buffer, mix, and centrifuge at 400 × g, 4 min at 20–25°C. Tap out supernatant, repeat once more.\nResuspend each well in 200 μL eBioScience Fix/Perm Solution, mix\nAlternatives: We have also performed fix/perm and Granzyme B staining using the BD fix/perm kit (Cat#554714) with success. Please follow the BD kit instructions from step 8h onwards if using it instead of the eBioScience kit described here.\nIncubate at 4°C for 30 min up to 18 h\nCentrifuge plate at 750 × g, 4 min at 4°C, tap out supernatant\nPrepare 1× Permeabilization Buffer by diluting 10× Permeabilization buffer in water\nAdd 200 μL 1× Permeabilization to each well, mix\nCentrifuge plate at 750 × g, 4 min at 4°C, tap out supernatant\nMake up Granzyme B master mix:\ntable:files/protocols_protocol_369_9.csv\nAdd 100 μL of Granzyme B master mix to each well, mix\nIncubate for 30 min at 4°C in the dark\nWash plate twice with 1× Permeabilization Buffer\nAdd 1× Permeabilization Buffer, centrifuge at 750 × g, 4 min at 4°C. Tap out supernatant. Repeat once more.\nResuspend in 200 μL FACS buffer and analyze on the flow cytometer"
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Culture",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}