{
  "id": 11056,
  "origin_website": "Jove",
  "title": "Drug-induced Sensitization of Adenylyl Cyclase: Assay Streamlining and Miniaturization for Small Molecule and siRNA Screening Applications",
  "procedures": [
    "1. Expansion and Cryopreservation of Assay Ready Cells\nCulture CHO-K1-DRD2L (CHO-D2L) cells on a 15 cm2 cell culture dish in Ham's F12 media supplemented with 1.0 μM L-glutamine, 800 μg/μl G418, 300 μg/μl hygromycin, 100 u/μl penicillin, 100 μg/μl streptomycin, and 10% fetal bovine serum (FBS).\nIncubate the cells at 37 °C in a humidified incubator with 5% CO2 until the cells are 90-95% confluent. Wash the cells with 10 μl Phosphate Buffered Saline (PBS), and harvest the cells by adding 3 μl of cell dissociation buffer for 5 min at 37 °C. Resuspend the cells using 12 μl of the culture media and count cells using trypan blue exclusion.\nCentrifuge the cell suspension at 500 x g for 5 min at room temperature. Aspirate the supernatant and resuspend the cell pellet in 5 μl of freezing media (10% dimethyl sulfoxide, 90% FBS). Dilute the cell suspension to achieve the desired cell concentration (e.g. 1-20 x 106 cells/μl).\nAliquot 1.0 μl of cell solution to each cryovial. Incubate the cryovials in a cell freezing container at -80 °C overnight. Transfer the cryovials to a liquid N2 tank for long term storage.\n2. Plating Assay Ready Cells (and Reverse Transfection Option)\nRapidly thaw a frozen cryovial of cells in a 37 °C water bath. Once cells are thawed, transfer the cells to a 15 μl conical tube containing 9 μl of Opti-MEM, and mix by inverting the tube 3-5x.\nCentrifuge the cells at 500 x g for 5 min  at room temperature. Aspirate the supernatant and resuspend the cells in 1 μl Opti-MEM.",
    "Count the cells using trypan blue exclusion to determine cell viability and dilute the viable cells as necessary (e.g. 3 x 105 cells/μl concentration) in Opti-MEM. Plate 10 μl/well of cells in a tissue culture treated 384-well plate using a multichannel pipette.\nMake serial dilutions of cAMP in Opti-MEM to generate a standard curve for estimating cAMP production by the cells (according to the manufactures recommendations - see Section 7). Add 10 μl/well of the cAMP standards to the plate. Note: a single standard curve can be prepared on a separate plate or blank wells on one of the assay plates.\nCentrifuge the plate at 100 x g for 15 sec  at room temperature, and incubate at 37 °C in a humidified incubator with 5% CO2 for 1 hr.\n3. Reverse siRNA Transfection Option*\nThis section is optional and relevant to Figure 3.\nPrepare a solution of siRNA in RNase-free ddH2O (e.g. 0.4 pmol/μl). Add 5 μl to individual wells of 384-well plate, and centrifuge the plate at 100 x g for 15 sec at room temperature.\nDilute Lipofectamine 2000 in Opti-MEM by a factor of 0.006 (e.g. add 6 μl of Lipofectamine 2000 to 1,000 μl of Opti-MEM), and mix by pipetting up and down.\nIncubate the Lipofectamine 2000/Opti-MEM solution for 5 min at room temperature. Add 5 μl of the diluted Lipofectamine 2000/Opti-MEM solution to individual wells of 384-well plate that already contains siRNA. Centrifuge the plate at 100 x g for 15 sec at room temperature.\nIncubate the plate for 30 min at room temperature.\nPlate assay ready cells as described above (Section 2). Centrifuge the plate at 100 x g for 15 sec at room temperature.",
    "Return assay plate to humidified incubator at 37 °C (5% CO2) for 48-96 hr as determined for targeted gene knock down (see discussion).\n4. Small Molecule Screening\nDilute the drug of interest (e.g. small molecule inhibitors) in Opti-MEM to 6x the desired final concentrations. Serial dilutions can be completed using hand-held pipettes or a liquid handling station.\nAdd 2.5 μl/well of the test compound or buffer containing vehicle (e.g. DMSO) to the side of the wells using a multichannel pipette.\nCentrifuge the plate at 100 x g for 15 sec at room temperature (incubation is optional).\n5. Persistent Agonist Treatment\nPrepare a 600 nM (i.e. 6 times the desired final concentration of 100 nM) solution of quinpirole in Opti-MEM.\nAdd 2.5 μl/well of the 600 nM quinpirole solution to the side of the wells using a multichannel pipette.\nCentrifuge the plate at 100 x g for 15 sec at room temperature, and incubate at 37 °C in a humidified incubator with 5% CO2 for 2 hr.\n6. Stimulation of cAMP Accumulation\nDuring the 2 hr incubation, prepare the stimulation solution in Opti-MEM. The stimulation solution is comprised of 40 μM forskolin, 2 μM 3-isobutyl-1-methyxanthine (IBMX), and 4 μM spiperone (all concentrations in step 6 are 4x the desired final concentration).\nAdd 5 μl/well of the stimulation solution to the side of the wells using a multichannel pipette.\nCentrifuge the plate at 100 x g for 15 sec at room temperature, and incubate at room temperature for 1 hr.\n7. Quenching and Estimation of cAMP Accumulation\nProduction of cAMP by the cells is measured using the cAMP dynamic 2 kit according to manufacturer’s instructions. Briefly, reconstitute anti-cAMP-cryptate and cAMP-d2 in distilled water. Freeze aliquots at -20 °C for short term storage.",
    "Dilute one aliquot of anti-cAMP-cryptate and one aliquot of cAMP-d2 separately in the lysis buffer according to the manufacturer’s instructions to make working solutions.\nAdd 10 μl/well of the anti-cAMP-cryptate working solution and 10 μl/well of the cAMP-d2 working solution to the 384-well plate using a multichannel pipette.\nCentrifuge the plate at 100 x g for 15 sec at room temperature, and incubate at room temperature for 1 hr.\nRead the plate in a fluorescence plate reader (auto scale setting for sensitivity) using an excitation of 337 nm, and measure the emissions at 620 nm and 665 nm per manufactures instructions.\nApply ratiometric analysis to assess cAMP standard curve per manufactures instructions. Using the resulting values, extrapolate the estimated cAMP accumulation in the test wells using data analysis software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}