{
  "id": 10048,
  "origin_website": "Jove",
  "title": "Human Liver Spheroids from Peripheral Blood for Liver Disease Studies",
  "procedures": [
    "Ethical approval was obtained (ACA CELL Biotech GmbH/25b-5482.2-64-1) for performing these experiments and informed consent was signed by all donors before blood extraction in compliance with institutional guidelines.\n1. Preparation of mononuclear cells (MNCs) from human peripheral blood (PB)\nExtract 30 mL of blood from healthy donors with the help of trained medical personnel according to the standard protocol.\nIsolate PBMNCs using density gradient media according to the protocol published by Becker-Kojić et al.13. Isolate, by pipetting, the interphase layer between plasma and density gradient media and use sterile phosphate buffer saline (PBS) to wash the isolated cells.\nUse a counting chamber and count the number of cells using standard methods.\n2. Dedifferentiation of MNCs upon activation with human GPI-anchored glycoprotein\nPlace 6 x 106 mononuclear cells in PBS/1% bovine serum albumin (BSA) in a polystyrene tube (15 mL) and incubate with the specific antibody for 30 min at 37 °C according to Becker-Kojić et al.13.\nCentrifuge the cells at 300 x g at room temperature and replace PBS/BSA with Iscove's modified Dulbecco's medium supplemented with 10% fetal bovine serum (FBS).\nGrow the cells in 15 mL polystyrene tubes in a 5% CO2 incubator at 37 °C for 8-10 days as described in Becker-Kojić et al.13. On day 5 (D5), add 1-2 mL of Iscove's medium supplemented with 10% FBS to each 15 mL tube.\n3. Sorting of newly generated dedifferentiated cells\nCentrifuge cultured cell suspension at room temperature for 10 min at 300 x g and aspirate with a sterile pipette the resulting supernatant according to Becker-Kojić et al.13.\nResuspend pellet obtained by centrifugation in 90 µL of cold PBS buffer (PBS pH 7.2, 0.5 % BSA, and 2 mM EDTA) and add 10 µL of CD45 positive nano-sized magnetic beads and incubate on ice for 15 min.",
    "Wash the cell suspension with 2 mL of PBS buffer, centrifuge it at 300 x g for 10 min at room temperature and add 500 µL of PBS buffer to the cells and resuspend thoroughly.\nPipette 500 µL of pre-cooled PBS buffer into the column to wash and place it in the magnetic field using a magnetic stand.\nWash the cells placed on the column, twice with 500 µL of PBS buffer and collect flow-through containing CD45 negative cells in Iscove's medium supplemented with 10% FBS.\nUse a counting chamber to determine the number of reprogrammed cells.\n4. Preparation of glass coverslips for the generation of human hepatocytes\nSeparate glass coverslips (14 mm) and incubate them in nonionic detergent for 10 min. Wash glass coverslips in deionized water till no bubbles remain and incubate them in 1M HCl for 30 min (adapted from Marchenko et al.14).\nWash glass coverslips with deionized water at least 3x and dry them overnight at room temperature. Autoclave dried glass coverslips in a suitable container.\n5. Coating cell culture plates with biolaminin for 2D hepatic differentiation of BD-PSCs\nPlace autoclaved glass coverslips with a sterile pair of tweezers in 4 well plates and turn UV lights on for 30 min to ensure sterile conditions.\nThaw aliquots of biolaminin and add 120 µL of 5 µg/mL biolaminin to each glass cover slip. Leave the coated glass coverslips overnight at 4 °C.\nRemove the excess of biolaminin and add 200 µL of hepatocyte differentiation medium as described below.\n6. Preparation of hepatocyte differentiation media\nMake 500 mL of hepatoblast knockout serum replacement (KSR)/dimethyl sulfoxide (DMSO) medium consisting of 76.4% knockout DMEM (KO-DMEM), 20% KSR, 0.5% L-glutamine, 1% non-essential amino acids (NEAA), 0.1% β-mercaptoethanol, 1% DMSO, and 1% penicillin-streptomycin (Pen/Strep).",
    "Prepare 500 mL of hepatocyte maturation medium containing 1% L-glutamine, 10 µM hydrocortisone 21-hemisuccinate sodium salt (HCC), and 1% Pen/Strep.\nAliquot medium from the stock and add fresh hepatocyte growth factor (HGF) and oncostatin M (OSM) at final concentrations of 10 ng/mL and/or 20 ng/mL for each medium change.\n\t​NOTE: Oncostatin M is a cytokine belonging to the interleukin 6 group of cytokines, important for hematopoiesis as well as for liver development.\n7. Culturing hepatic cells differentiated from BD-PSCs\nPut 3 x 105 BD-PSCS cells into each well of a 4-well plate coated with biolaminin.\nPlace the 4-well plates in the incubator at 37 °C and 5% CO2. Culture the cells for 5 days in KSR/DMSO hepatoblast medium that supports endodermal differentiation and change the medium every second day.\nSwitch to hepatocyte maturation medium on day 5 and culture the cells for an additional 7-10 days in the incubator at 37 °C and 5% CO2. Change the medium every 48 h.\n8. 3D spheroid hepatic differentiation\nCount cells using a counting chamber.\nCentrifuge BD-dedifferentiated cell suspension at 300 x g for 10 min at room temperature. Remove supernatant and resuspend BD-dedifferentiated cells in KSR/DMSO medium at 2 x 106 cells/mL.\nPass the cells through a 40 µm cell strainer to ensure a single-cell suspension and to remove any additional debris.\nCount cells using a counting chamber and prepare a sufficient volume for each cell seeding density in order to dispense the required volume per well. Prepare a gradient with top seeding of 1 x 106 cells to a low seeding density of 4000 cells.\nDispense 100 µL of KSR/DMSO medium in 96 well-low attachment plates and add 100 µL of cell seeding dilution.",
    "Place low attachment plate in the incubator at 37 °C and 5% CO2 and culture them for 5 days.\nChange 50% of the medium from days 3-4 after seeding when the spheroids are sufficiently compact.\nOn day 5, change the medium to hepatocyte maturation medium and culture the cells for an additional 7-10 days for further maturation. Change the medium every second day.\n9. Immunofluorescence analysis of newly generated 2D liver cell cultures\nCulture the cells according to the differentiation method described above for 4, 8, 15, and 24 days and remove media.\nIncubate cells with pre-warmed fixative consisting of 4% paraformaldehyde in PBS for 10 min. Discard the fixative and wash the cells 2x with PBS for 5 min each. Immediately add 0.1% triton X-100 solution and permeabilize the cells for 5 min. Wash 2x with PBS.\nAdd blocking solution made of PBS and 5% BSA and place on rocker plate for 1 h at room temperature.\nDilute primary antibodies in dilution buffer 1% BSA/PBS as follows: albumin (ALB) 1:50, alpha-1 fetoprotein (AFP) 1:250, cytokeratin 18 (CK18) 1:50, hepatocyte nuclear factor 4 alpha (HNF4α) 1:1000 and transthyretin (TTR) 1:50. Use 50 µL of antibody dilution per well.\nIncubate the cells for 1 h at room temperature. Then discard the antibody solution, wash the cells for 5 min, and repeat the wash step 3x.\nPrepare the following secondary antibodies in dilution buffer: rabbit anti-chicken IgG (Texas red) 1:1000, goat anti-mouse IgG (488) 1:1000, and goat anti-rabbit (488) 1:500. Use 50 µL of antibody dilution per well and incubate the cells for 30 min at room temperature.\nWash the cells 3x with PBS for 5 min each and mount the coverslips with mounting media containing DAPI for microscopic analysis.\n10. Live staining of newly formed liver spheroids",
    "Carefully discard culture media while not touching the spheroids, add freshly made PBS with 0.1% triton X-100 solution, and incubate for 5 min to permeabilize the cells.\nWash the spheroids with the medium by slowly pipetting for 5 min, repeat 2x.\nIncubate the spheroids with the primary antibodies ALB (1:50), AFP (1:250), CK18 (1:50), CYP2E1 (1:200), and CYP3A4 (1:200) prepared in PBS with 1% BSA for 1 h in 5% CO2 incubator at 37 °C. Use 50 µL of antibody dilution per well.\nCarefully remove the excess antibody solution and wash the spheroids with medium 3x.\nPrepare the corresponding secondary antibodies goat anti-mouse IgG (Cy3), goat anti-mouse IgG (488), and rabbit anti-chicken IgG (Texas red) at a dilution of 1:1000 and 1:500 for goat anti-rabbit (488) in PBS in 1% BSA. Use 50 µL of antibody dilution per well and incubate for 20 min in the incubator at 37 °C and 5% CO2.\nCarefully wash 3x with medium and leave the plate for 30 min in the incubator at 37 °C and 5% CO2 before performing fluorescence microscopy.\n11. Examination of spheroids using a fluorescence microscope\nSwitch on the fluorescence light source 10 min before use, turn on the computer and open the imaging software.\nUse an objective with 4x magnification, click on button 4x in the toolbar to have the correct scale bar selected, then place the 96-well plate on the stage center plate.\nTurn the LED light source on, use the brightfield filter, and position the plate to the well of interest using the x-y-axis stage adjustment knob.\nChange to camera light path, click the button Live in imaging software to visualize the image on the screen, and ensure the spheroid is centered using the x-y-axis knobs and focus using the coarse/fine focus knob.",
    "NOTE: The shape of the spheroids remains constant after applying live staining.\nChoose the Brightfield Observation method in the toolbar, put exposure settings to automatic, and click the button Snapshot in the camera control panel to take a picture. Then save the picture as .vsi file using the appropriate name in the folder of interest.\nPlace ambient light shielding plate to turn off LED light, change to filter for B-excitation, choose 488 Observation method in the toolbar, open shutter, take a picture by clicking button Snapshot, close shutter, then save file as described above.\nRepeat this with a filter for G-excitation using the appropriate observation method (Texas red or CY3). Then reiterate the whole procedure for each well of interest.\nReturn the plate to the 5% CO2 incubator at 37 °C and culture it as described above.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}