{
  "id": 10422,
  "origin_website": "Jove",
  "title": "Home-Based Monitor for Gait and Activity Analysis",
  "procedures": [
    "Any use of the device must be carried out in accordance with the rules established by the reference protocol, validated by the ethics committee and the national regulatory agencies of the country. The use of the device and the various elements attached to it must be done within the intended use described in the patient's manual.\nNOTE: To be eligible to use of the WMIS, patient must be over 5 years old, be able to understand and follow the usage rules, provide informed consent, be affiliate or beneficiary of a social security scheme, and be able to comply with all protocol requirements. There are no specific exclusion criteria.\n1. Preparing for the participant’s visit at the clinical center\nCheck the suitcase contents: (1) the docking station to plug the sensors during the night for data uploading onto a USB key and recharging of batteries, (2) the power cord divided into two pieces to connect the docking station to a power supply, (3) the Ethernet cable to permit interface with a router, (4) the two sensors to permit daily activity recording, (5) bands for attachment of the sensors depending on the chosen configuration and ambulatory status of the participant (ankle-ankle: two ankle armbands with two stickers to distinguish the wearing side; ankle-wrist: one ankle armband and one bracelet; wrist-wheelchair: one bracelet and one wheelchair pocket), (6) one participant manual and one investigator manual, (7) one task reminder, (8) a screwdriver to enable replacement of the USB key, and (9) two blank USB keys.\n\tNOTE: If an internet connection is available data transfer occurs automatically\nPrint and prepare the assignment form to record the assignment of a device to a participant. This will enable data reconciliation with the subject ID.\n2. Training of the subject during the first visit",
    "Positioning of this WMIS\n\t\nBased on the data that the researchers are seeking as well as the patient’s ambulatory status, use different configurations for the placement of the sensors.\n\t\t\nFor ambulant patients, fix the two sensors either on a wrist and an ankle for upper and lower limb activity recording or on both ankles for only lower limbs activity.\nFor non-ambulant patients, fix one sensor on the wrist and the other one on the wheelchair.\nExplain positioning of the sensors to the participant.\n\t\nFor ambulant participants, fix the two sensors either on a wrist and an ankle or on both ankles.\n\t\t\nFor the wrist-ankle configuration, place one sensor on the wrist of the dominant hand using the provided bracelet so that the waves are pointing toward the fingers. Place the second sensor on the ankle, on the same side as the wrist sensor, above the external malleolus with the waves pointing in the forward direction.\n\t\t\tNOTE: The sensor must be placed on top of the wrist.\nFor the ankle-ankle configuration, place a sensor on each ankle, above the external malleolus with the waves pointing in the forward direction.\n\t\t\tNOTE: Stickers should be placed on the sensors to indicate the wearing side.\nFor non-ambulant participants, fix one sensor on the wrist and the other one on the wheelchair.\n\t\t\nFor the wrist-wheelchair configuration, place one sensor on the wrist of the participant’s dominant hand using the provided bracelet so that the waves are pointing toward the fingers. Place the second sensor in the bag provided. Attach it on a safe place to the wheelchair.\n\t\t\tNOTE: Independently of the used configuration, do not switch sensors around. The sensors should fit snuggly, but not too tightly to the wrist and/or ankle to prevent them from spinning around.",
    "Explain daily routine for sensors’ use to the participant.\n\t\nEvening routine\n\t\t\nPlug the docking station into the power supply. Attach the docking station to the router if an internet connection is available. Insert the sensors into the docking station.\nLocalize the two light-emitting diodes (LEDs) on the docking station which indicate the status of the sensors. Once plugged into a power source, be sure the station beeps and the diodes become orange to indicate that the sensor batteries are charging, and that data is being downloaded from the sensors to the USB drive.\n\t\t\tNOTE: If the LEDS are still blinking after 5 min, restart the procedure from beginning. If the issue persists, contact the clinical site team.\nMorning routine\n\t\t\nVerify that the LEDs are green, indicating that the sensors batteries are fully charged, and that data has been cleared from the sensors’ memory. Remove the sensors from the docking station. Wear the sensors in the configuration demonstrated by the evaluator.\n\t\t\tNOTE: If LED on one or both sensors is orange after two consecutive days, contact the clinical center.\nDaytime routine\n\t\t\nWear the sensors the entire day and place the sensors back on the docking station at the end of the day.\n\t\t\tNOTE: Remove the sensors during activities involving water, special medical examinations (e.g., magnetic resonance imaging [MRI], CT-scan, X-ray) or any activity that could damage them, and keep them in a safe place on a firm surface. Resume wearing the sensors after the activity.\nAt the end of the recording period, tidy up all the device items in the suitcase and bring back the device to the clinical center.\n\t\tNOTE: Encourage the participant to engage in normal daily activities wearing as much as possible the sensors.\nComplete a dedicated assignment form.\n3. Data collection and analysis\nData collection",
    "NOTE: The sensors record signals continuously for up to 16 h and store the information in an internal memory (Movie 1). The docking station enables the downloading of data stored in the sensors at the end of each day and charging of the batteries during the night. Data downloaded to the docking station is stored on a USB drive that can only be accessed by the evaluators.\n\t\nA standard 64 GB USB drive can hold up to 3 months of daily recording information (approximately 16 h/day). Provide higher or lower capacity USB drives to adjust as closely as possible to the constraints of the protocols.\nIf the docking station is not connected to internet, have the evaluator remove the USB drive from the docking station (with the specific screwdriver contained in the suitcase) and replace it with a blank one at the end of the recording period. The USB drive should be sent to the support team for analysis.\n\t\tNOTE: If the docking station is connected to the internet, data are uploaded to cloud storage. Thus, there is no need to change the USB drive, as all data are automatically deleted from the USB drive once the files are uploaded into the cloud.\nData analysis\n\t\nAt selected time points during the study, extract data from the cloud storage and analyze data using a dedicated algorithm. Adjust the analysis periods and the monitoring reports based on the clinical study.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}