{
  "id": 4070,
  "origin_website": "Cell",
  "title": "Bioluminescent optogenetic (BL-OG) activation of neurons during mouse postnatal brain development",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNeural stimulation during early postnatal mouse brain development\nTiming: 5–15 days\nThis step describes the preparation of luciferin solution and injection into mouse pups. Depending on the research question and experimental design, injections will be once per day or more often, over as many days as postnatal neural stimulation is desired. It is recommended to inject all pups of a litter with either CTZ or vehicle.\nPrepare CTZ or vehicle solutions.\nTake out a vial of water-soluble CTZ or vehicle from the −80°C freezer and let warm to 21°C. Keep protected from light.\nPer 500 μg vial add 500 μL sterile water, using either a syringe or by opening the vial and adding water with a pipette, then putting the rubber stopper back on the glass vial.\nIncubate reconstituted glass vial in 55°C waterbath for a few minutes to completely dissolve powder. Dissolving occurs without formation of bubbles (compared to dissolving by vortexing).\nTransfer solution into black microcentrifuge tube. Rinse walls of the glass vial to retrieve all CTZ. Remove amount of solution needed for the day with 0.5 mL Insulin syringe. Store leftover at 4°C for use the next day. Loss of activity is <10% after 24 h at 21oC. Discard after 24 h. Do not freeze!\nInject postnatal pups.\nPull up CTZ or vehicle solution into 0.5 mL Insulin syringe with a 31 gauge needle as needed for injecting a litter; remove any bubbles. Take black tube with CTZ to animal facility or keep syringe containing CTZ covered in aluminum foil when transporting to animal facility. The dose (CTZ) or volume equivalent (vehicle) is 10 μg/g or 10 μL/g body weight (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig1.jpg\nFigure 1. Intraperitoneal injection of CTZ",
    "(A) CTZ solution is pulled up into a 0.5 mL Insulin syringe and desired volume (here: 4 units = 40 μL, red arrow) is expelled ip.\n(B) Postnatal day 5 pup injected ip with CTZ. Spread of expelled CTZ solution can be observed through the skin (red arrow).\n(C) Postnatal day 11 pup injected ip with CTZ.\nPups at postnatal days 4 and 5 receive 30 μL (3 units). Day of birth is postnatal day 1.\nPups at postnatal days 6 to 14 receive 40 μL (4 units).\nInject pups intraperitoneally (ip) with volumes specified in step 2a. Use separate syringes if more than one litter is being injected.\nPups aged postnatal days 1 to 5 are injected in a lower quadrant (Figure 1[href=https://www.wicell.org#fig1]B). The needle can usually be visualized through the skin. Care needs to be taken to avoid piercing inner organs, including the stomach.\nPups aged postnatal days 6 and above are injected in a lower quadrant (Figure 1[href=https://www.wicell.org#fig1]C). As due to skin coloration and fur growth the needle can no longer be visualized when injecting, draw plunger back a little before expelling the desired volume into the body cavity.\nCritical: It is best to take out the entire litter, inject all pups, and then return the injected neonates as a group (entire litter) to minimize disturbing the dam.\nValidate neural stimulation by bioluminescence imaging in developing mice\nTiming: 1 h\nThis step describes one of three ways for validating that CTZ injections lead to bioluminescent light emission in targeted circuits in the brain. The protocol describes bioluminescent imaging using the IVIS (Perkin Elmer In Vivo Imaging System). If this system is not available, alternative approaches for live imaging are described.",
    "Prepare CTZ or vehicle solution and inject pups immediately before imaging as described in steps 1 and 2 above.\nFor imaging using IVIS follow manufacturer’s protocols, using the Living Image Software. Images are taken in 5-min bins over a 20- to 30-min period, either by setting up an imaging sequence or by taking serial individual images. Bioluminescence emission is expected within 10–15 min after CTZ injection and will decline over the following hour. Bioluminescence emission is expected in LMO expressing, but not in non-expressing, pups injected with CTZ, and in neither group when injected with vehicle.\nNeonates up to 5 days of age are anesthetized by hypothermia during imaging.\nInject CTZ ip, then place pups on crushed ice in a dish. Pups should be kept on ice no longer than 30 min after induction of anesthesia.\nAs soon as pups stop moving, transfer dish with pups into IVIS chamber and start imaging. Depending on how long the imaging lasts, pups may have to be transferred to a fresh dish with ice.\nOnce imaging is completed, pups are kept on a heating pad until pink and moving.\nNeonates older than 5 days of age are imaged under isoflurane anesthesia (oxygen 2 L/min; isoflurane 1–2%), using the nose cones inside the IVIS chamber.\nInject CTZ ip, then place pups in induction chamber.\nCollect images in 5-min bins.\nTroubleshooting 1[href=https://www.wicell.org#sec6.1]",
    "Alternatives: If an IVIS system is not available, other options are imaging systems equipped with a cooled CCD camera or a sCMOS camera. Image documenting systems for Western blots, for example, are designed for chemiluminescence, such as Fuji Film LAS-3000 or Li-Cor Odyssey Fc (Figure 2[href=https://www.wicell.org#fig2]B). Depending on the anatomical location, distribution, and level of expression of the LMO bioluminescence can be captured with a cell phone camera or through a stereomicroscope (Figure 2[href=https://www.wicell.org#fig2]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig2.jpg\nFigure 2. Bioluminescence imaging of pups\n(A) IVIS imaging of a litter of Emx1-Cre × LSL-LMO3 heterozygotes on postnatal day 4. Mice were injected ip with CTZ, anesthetized on ice, and imaged. One pup was Emx1-LMO3 and showed bioluminescence (see red marked inset).\n(B) Different displays of image taken after CTZ administration to an adult mouse injected bilaterally into the motor cortex with AAV-hSyn-LMO3. Images taken on a Licor Odyssey FC (designated gel and Western blot imager).\n(C) Bioluminescence images of a P14 Emx1-LMO3 pup. (i) Raw picture taken with an iPhone. Urethane-anesthetized pup is placed under stereomicroscope. (ii) Pseudocolored image of bioluminescence emission of same pup as in (i) taken through a stereomicroscope (Leica MZ10F) with an Infinity 3S-1UR camera. (iii) Overlay of brightfield and EYFP fluorescence image taken through stereomicroscope from littermate of pup shown in (i) and (ii). EYFP is strongly visible over the entire cortex.\nValidate neural stimulation by patch clamp recordings in slices\nTiming: 4 h\nThis step describes the use of patch clamp recordings from brain slices for simultaneous assessment of light emission and neural stimulation in the presence of CTZ. The protocol describes critical modifications to standard electrophysiology rigs, details the procedures for preparation and application of the luciferin, and specifies procedures for validation of bioluminescence-elicited neural activation.\nMake the patch rig light tight.",
    "Create a light tight compartment around the recording rig (Figure 3[href=https://www.wicell.org#fig3]) using black drapes (e.g., THOR LABS). Access is provided by keeping the flexible black drape in the front rolled-up (Figure 3[href=https://www.wicell.org#fig3]A). The front drape is dropped at the time of CTZ treatment and bioluminescence imaging while recording from the patched cell (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig3.jpg\nFigure 3. Making the patch rig light-tight\n(A) Set-up showing the patch rig covered by the flexible black drape with the front side open and rolled up.\n(B) Same set-up as in A, now with the front black drape rolled down to be used for bioluminescence imaging.\n(C) Example of a source of light present inside the covered patch rig, such as the LED indicator on the camera (red square, i), zoomed in showing the green LED indicator (yellow arrow, ii), which is covered with a black tape (white arrow, iii).\nCover all light sources (e.g., LED indicators on the camera) present inside the light tight compartment (Figure 3[href=https://www.wicell.org#fig3]C).\nPrepare CTZ stocks.\nFor ex-vivo applications there is no need to use the more expensive water-soluble in vivo preparation of CTZ (#3031). Prepare 50 mM stocks by dissolving 500 μg lyophilized CTZ (#303) in 25 μL of NanoFuel Solvent. Make sure to dissolve all CTZ along the walls of the vial by pipetting or vortexing. Protect vial from direct light.\nPrepare 5 μL aliquots in 0.5 mL black microcentrifuge tubes and store at −80°C for future use. CTZ dissolved in NanoFuel Solvent does not freeze at −80°C. Aliquots can be removed from and returned to the freezer several times for making working solutions as long as exposure to light and 21°C is kept to a minimum.\nPrepare brain slices from neonatal pups.",
    "Anaesthetize the mouse pup via isoflurane inhalation and remove the head with sharp scissors. Isolate the brain immediately and place it in ice-cold PRC buffer bubbled with carbogen gas. Total time taken for the brain isolation and transfer to the PRC buffer should not exceed 60 s.\nPrepare 300 μm thick slices (coronal/horizontal/sagittal, based on the experimental design) from the desired brain region using a Vibratome (e.g., VT1000 s, Leica) and ice-cold PRC buffer continuously bubbled with Carbogen (gas mixture of 95% O2 and 5% CO2). Up to 2 pup brains can be glued on the Vibratome platform for simultaneous sectioning (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig4.jpg\nFigure 4. Preparation of brain slices from neonatal pups and mounting the slice into the recording chamber\n(A) Vibratome platform with the glue to accommodate up to 2 pup brains (i & ii) for simultaneous slicing using the Vibratome (iii).\n(B) Patch recording chamber connected with the inlet and outlet tubing for ACSF circulation containing a slice, weighed down by a ‘C’ shaped meshed harp (see close-up in inset on top left).\nStore the slices in PRH buffer at 25°C for 1 h recovery before transferring to recording chamber.\nPerform patch clamp recordings from LMO expressing cells.\nTransfer a brain slice to the recording chamber perfused with carbogenated ACSF (perfusion rate: 3 mL/min). The heater temperature for the buffer inlet is set at 39°C to keep the buffer temperature in the recording chamber around 35°C. Place a C-shaped mesh harp over the slice to fix its position in the desired orientation (Figure 4[href=https://www.wicell.org#fig4]B).\nUnder 480 nm excitation light identify a fluorescent (EYFP from LMO3) cell and patch using an established set-up (e.g., Multiclamp 700b amplifier and Digidata 1440 digitizer together with the pClamp recording software (Molecular Devices)) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig5.jpg\nFigure 5. Patching LMO-expressing neurons",
    "(A) Brightfield image of patched pyramidal neuron in medial prefrontal cortex layer 5. Filled arrow points at patched neuron, open arrow indicates patch pipette.\n(B) Fluorescent image of the same field as in (A) under 480 nm excitation wavelength.\n(C) Merged image of (A) and (B).\nStimulate the patched LMO expressing cell with light of the appropriate wavelength from a physical source by delivering light through the objective or from a separate LED source. The opsin in LMO3, VChR1, can be activated at either 480 or 540 nm light illumination (30 mW/cm2, 1 s). Depending on the age of the pups and the specific cells expressing the LMO neurons may be functionally immature, in which case light stimulation may only generate subthreshold depolarizations.\nRecord from the patched LMO expressing cell in the presence of CTZ (Segev et al., 2016[href=https://www.wicell.org#bib6]). Maintain membrane potential at −70 mV by continuously injecting negative DC current, <100 pA, in current clamp mode while delivering periodic square current injections to evoke firing (e.g., 0.1 Hz, 300 pA, 50 ms). Bath application of CTZ is expected to depolarize the membrane potential and increases the firing response to current stimulation.\nA peristaltic pump continuously circulates carbogenated ACSF from a beaker into the recording chamber and from there back into the beaker. Transfer 250 μL of carbogenated ACSF from this beaker into a 1.5 mL microcentrifuge tube (Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig6.jpg\nFigure 6. CTZ treatment during patch recording of LMO expressing neuron\n(A) Peristaltic pump circulating the carbogenated ACSF present in the glass beaker. Inlet and outlet tubing labeled with green tapes; red arrow points at gas tubing from the Carbogen tank.\n(B) Using a P1000 pipetman carbogenated ACSF is pipetted out from the beaker (i) and transferred to an Eppendorf tube (ii).",
    "(C) CTZ (50 mM stock) is pipetted out from the black stock vial (originally stored at −80°C) (i) and mixed well with the fresh ACSF in the Eppendorf tube (CTZ-ACSF) (ii).\n(D) The inlet tubing is removed from the ACSF beaker (i) and is quickly dipped into the CTZ-ACSF solution in the Eppendorf tube, as in C (ii). The inlet tube is quickly transferred back to the ACSF beaker once the Eppendorf tube is empty.\nAdd 5 μL of 50 mM CTZ to the ACSF and mix well (Figure 6[href=https://www.wicell.org#fig6]C). This 1 mM concentrated CTZ-ACSF will be diluted to ∼300 μM final concentration in the recording chamber. The volume and concentration of CTZ can be scaled up or down based on the experimental set-up.\nWhile keeping the pump running at the chosen flow rate, take out the inlet tube of the pump from the ACSF beaker and quickly immerse it in the CTZ solution (Figure 6[href=https://www.wicell.org#fig6]Di), keeping the transition time as short as possible to avoid any air void in the tubing. The time it takes for the CTZ to reach the patched neuron depends on the flow rate and length of the tubing and has to be determined for the specific recording set-up. As an example, for the depicted set-up (Figure 5[href=https://www.wicell.org#fig5]) with a flow rate of 1.5 mL/min it takes 2.5 min (+/- 5 s) from the CTZ-ACSF being taken up by the inlet tube to producing bioluminescence from the slice in the recording chamber (see also Note below). The perfusion flow rate is kept constant throughout the entire experiment.",
    "Remove the outlet tubing of the pump from the ACSF beaker and place it in a separate 50 mL tube to collect the ACSF with the used reagent. Dip the outlet tubing back into the ACSF beaker after the reagent has exited (Figure 6[href=https://www.wicell.org#fig6]A).\nTurn off all lights in the room and observe the bioluminescence in the recording chamber upon entry of CTZ (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig7.jpg\nFigure 7. Bioluminescence emission from the LMO expressing neurons in the slice upon CTZ treatment\n(A) CTZ-induced bioluminescence from the LMO slice (inside red square) upon its entry into the recording chamber (shown as dashed white boundaries) (i), with further zoomed-in view (ii). Pictures were taken with a cell phone.\n(B) Set-up for bioluminescence imaging: all the lights in the room are turned off and the front black drape is rolled all the way down and tucked well to make the patch rig completely light-tight (e.g., the light from computer screen on the left cannot enter the light-tight rig).\nRoll down the front black drape to make the rig completely light tight if measurement of photon counts is desired (bioluminescence imaging) (Figure 7[href=https://www.wicell.org#fig7]B). Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nThe vehicle treatment control is conducted in the same way as described above for CTZ. However, there will not be any generation of bioluminescence, and no increase in firing response to current stimulation is expected. Troubleshooting 3[href=https://www.wicell.org#sec6.5]\nCritical: Keep the ACSF bubbled with Carbogen at all times to preserve cell viability.\nAlternatives: Other materials can be used to make the patch rig light-tight, such as thick black plastic sheets.",
    "Note: Timing for entrance and exit of CTZ in and out of the chamber will depend on the tubing size, chamber volume and pump flow rate. These temporal parameters can be determined by a mock experiment adding food coloring dye instead of CTZ to the 250 μL of carbogenated ACSF. The time needed for eliciting an increase in firing can be tested by adding Bicuculline or Picrotoxin to, or increasing the KCl concentration of, the 250 μL ACSF inlet solution while recoding from a patched neuron.\nValidate neural stimulation by acute extracellular in vivo recordings in postnatal mice\nTiming: 6 h\nThis step describes the use of multisite acute extracellular recordings in vivo from postnatal pups for the assessment of neural stimulation with intraperitoneal (IP) CTZ application. The protocol details how to anesthetize pups, head-mount them into a stereotaxic frame, and record the effect of IP CTZ application.\nAhead of time, construct a re-usable head mount for the neonatal skull to be fixed to the stereotaxic frame. The molded “crown” creates a customized structural interface between the skull and the stereotaxic apparatus that serves to stabilize the soft skull of the pup and allows to fix it in a stereotaxic frame through attached ear bars.\nCreate a custom molding with ‘Gorilla Epoxy Putty Stick’ (Figure 8[href=https://www.wicell.org#fig8]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig8.jpg\nFigure 8. Customized EPOXY and METABOND postnatal mouse skull stereotaxic holder\n(A) Two example variations of customized stereotaxic holders (i and ii).\n(B) Skull of a P12 mouse after removal of skin allowing visualization of skull landmark structures and the underlying brain before (i) and after (ii) applying METABOND to the bone surface. The METABOND layer continues onto the stereotaxic holder shown in (A).",
    "(C) Overview picture (i) with stippled lines indicating midline (straight line), lambda (lower half circle) and bregma (upper half circle); star indicates convergence of bregma and midline. Zoomed-in pictures show a craniotomy over the left medial prefrontal cortex beginning with a drill hole only through the METABOND layer (ii), then through the skull providing access to the brain surface (iii – center opening inside the drill hole).\nFollow the manufacturer’s protocol to get pliable putty.\nUse mouse heads from different developmental stages to construct molds that reflect the specific age, allow for clear visualization of the skull surface, and ensure a tight fit between the mold and the skull of the pup.\nTrim the hardened rough mold with a Dremel, using sanding, carving, and cutting accessories.\nSuper glue the head mount to flat metal washers, one on each side.\nOn the day of recording, prepare the ephys rig.\nAssemble and check all components needed (drill with small drill bit, electrode, LED optical cable and source, saline).\nTurn on the warming pad (maintained at 37°C until the end of the recording session).\nAnesthetize the pup.\nTransfer the pup from the parent cage to a holding box (for example, a small Styrofoam box padded with soft tissue). Cover the pup with some gauze to keep it warm.\nPrepare fresh Urethane. Weigh the pup and calculate the amount of Urethane stock to be injected (1.0 g/kg weight of the animal). If the calculated volume of Urethane stock for I.P. injection is less than 100 μL, dilute it 1:2 with saline and then inject I.P. (Example: a pup weighing 7 g will need 52.24 μL of the Urethane stock, or 104.5 μL when 1:2 diluted).\nInject the Urethane into the abdomen (intraperitoneally) avoiding any organs.",
    "Note the time of this primary Urethane injection and return the pup to the warm and darkened holding box until it is anesthetized (i.e., does not respond to a toe pinch). Time intervals for complete anesthesia can vary between 30 min to 1.5 h.\nIf pup does not move for a while but still responds to a toe pinch, boost anesthesia by acute application of Isoflurane.\nPlace a small gauze pad into a 10 mL plastic tube with a screw cap.\nAdd 1–2 drops of Isoflurane to gauze and close lid.\nJust before making an incision, open the lid of the tube and hold the opening of the tube close to the snout of the pup for 3 s.\nFix the head mount to the pup’s head.\nQuickly remove the skin from the head using scissors to expose the skull (Figure 8[href=https://www.wicell.org#fig8]Bi).\nDry the surface with Q- tips and apply Vet bond to glue the skin to the skull. This provides a stable base for the head mount fixation.\nFix the pre-constructed head mount to the prepared skull using C&B METABOND.\nTake out the pre-chilled porcelain tray from −20°C freezer.\nMix the METABOND components quickly, following manufacturer’s instructions.\nAlign the head mount over the skull, so that the marked Bregma is visible in the center and the window of the molded mount allows for clear visualization of skull landmarks.\nApply the METABOND mixture along the circumference of the head mount and across the skull, thereby fixing the skull to the head mount (Figure 8[href=https://www.wicell.org#fig8]Bii). The goal is to create a stable interface between the skull and the mount.\nAllow the METABOND to solidify while gently holding the pup, making sure that the pup is not weighed down by the head mount. This takes about 2–3 min.",
    "Attach the head-mounted pup to ear bars.\nTurn the mouse with attached head mount belly side up.\nSuper glue ear bars to the two metal washers of the head mount.\nAllow the glue to bond for at least the recommended time for the specific brand of glue used (1–2 min).\nPlace the pup into the stereotaxic frame via the ear bars. Cover the pup (from neck to tail) with a soft cloth or gauze to keep it warm.\nCraniotomy of the pup (use surgical stereomicroscope).\nDeliver a booster dose of Urethane (20% of the original dose) to the pup.\nConnect the optrode to the Omnetics holder and bring it right on top of the Bregma mark (Figure 8[href=https://www.wicell.org#fig8]Ci). Reset the digital stereotaxic apparatus for the anterior/posterior (AP) and medial/lateral (ML) values. Move the electrode to the desired AP and ML coordinates and mark the point (with a thin sharpie) for drilling the hole for the optrode.\nLift up the optrode holder and move it all the way to the back to protect the electrode while performing the craniotomy.\nUsing a hand-held, battery operated drill, gently drill into the delicate skull, avoiding any bleeding (Figure 8[href=https://www.wicell.org#fig8]C). Drip some saline on the hole in the skull to avoid any drying and for clear sight of the brain surface.\nBe aware that the dried METABOND on the skull surface needs to be completely drilled through first (Figure 8[href=https://www.wicell.org#fig8]Cii) in addition to the mouse skull (Figure 8[href=https://www.wicell.org#fig8]Ciii).\nConfirm successful craniotomy visually and by gently touching the surface with fine blunt forceps.\nDrill a second hole over the cerebellum (no specific coordinates necessary).",
    "Using the X/Y/Z axis micromanipulators of the stereotaxic instrument bring back the optrode to the front and carefully align it over the craniotomy of the target area. Insert, by hand, the silver wire connected to the optrode’s ground and reference ports through the second craniotomy into the cerebellum.\nMove the optrode down until the tip of the optrode touches the brain surface. At this point reset the dorsal/ventral (DV) values on the digital stereotaxic apparatus.\nRecord from the desired brain region of the pup.\nTurn on the ephys set-up and software.\nSlowly, turning the micromanipulator in 10 micron steps, move the optrode tip dorso-ventrally.\nFollow progression of the probe into the brain according to the channel map for the optrode used (Figure 9[href=https://www.wicell.org#fig9]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/780-Fig9.jpg\nFigure 9. Assessment of dorso-ventral placement of the optrode in the pup brain for ephys recording\n(A) Example channel map for a single shank, 32-channel silicon laminar probe (A1×32 Poly2-5mm-50s-177-OA32LP, NeuroNexus Technologies). Color code for DV arrangement of electrodes is maintained throughout figure: bottom (red), middle (yellow), and top (blue). Fiber optic is located 50 μm above the highest recording site.\n(B) Order of appearance of all 32 channels shown as a table (2 × 16) (as visible on the software screen, Blackrock Microsystems) starting from before inserting until fully inserted (i-iv, left side) and illustrations depicting the respective depths of the optrode in the pup brain (i-iv, right side).\n(C) Example of a recording screenshot showing activity in most channels when the probe is fully inserted in the pup cortex.",
    "(D) Example recording from medial prefrontal cortex of P14 Emx1-LMO3 pup. Representative trace of the average firing rate from putative regular spiking units (pyramidal neurons) after pup received an IP injection of CTZ (red dotted line). The average firing rate returns to baseline around 3000 s or 48mins following CTZ administration.\nWatch the panel of optrode channels on the computer screen for neural activity while going down slowly (Figure 9[href=https://www.wicell.org#fig9]B). As the optrode moves more ventral, more channels will start showing activity. Once this includes the top channels, the entire probe has been inserted into the brain.\nWhen consistent neural activity is observed in most of the channels (Figure 9[href=https://www.wicell.org#fig9]C) at the desired DV position, let the neurons recover for about 30 min.\nDuring the recovery phase, prepare the water-soluble CTZ/vehicle solution (as described in steps 1 and 2 above). Once the recovery phase is over, start the recording with a baseline of about 20 min (before CTZ/vehicle injection).\nDeliver a pulse of blue light via the optrode to check that LMO-expressing neurons are being recorded.\nFor CTZ/vehicle application, lift the pup gently by its tail (without disturbing the upper body) and deliver the CTZ/vehicle intraperitoneally with an insulin syringe. Bring the tail down to place the pup back to its original position. Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nRecord the activity for the desired period of time (Figure 9[href=https://www.wicell.org#fig9]D). Troubleshooting 5[href=https://www.wicell.org#sec6.9]\nAfter the recording, carefully take out the optrode from the brain and dip-clean it with destilled water immediately to avoid any drying of debris. Clean further with Tergazyme or any other suitable electrode cleaning reagent.\nRemove the pup from the rig and the head mount, and surgically remove its brain. Put the brain in fixative (4% PFA) to do histology later if desired.",
    "Critical: Step 12: Care needs to be taken to NOT get any Vetbond, Metabond, glue, or any other solutions into the pup’s nostrils while mounting the headstage.\nCritical: Throughout the surgery the breathing pattern of the pup needs to be monitored at all times when preparing pups for recordings. If any shallow breathing is being noticed, perform “CPR” by gently rubbing fingers on the chest of the pup for 2–3 minutes, until the breathing rate returns to normal.\nAlternatives: Different bonding reagents and glues can be used. The ones listed here are one example of what works.\nDifferent head stages can be used (see for example Bitzenhofer et al., 2017[href=https://www.wicell.org#bib3], 2020[href=https://www.wicell.org#bib4]). The protocol presented above outlines how to perform acute extracellular recordings in developing anesthetized pups using a standard stereotaxic set-up and customized headstage assembled from materials available in any hardware store. A major consideration when creating a molding for the custom headstage is that the headstage interfaces well with the fragile skull of the mouse through the Metabond. Accordingly, a different molded headstage will be necessary when recording from postnatal pups of different ages.\nFor the initial anesthesia alternatives to urethane can be used (Avertin, Ketamine/Xylazine). The recordings can be done under continuous isoflurane anesthesia.\nNote: Always store the Urethane powder in a desiccator and prepare fresh Urethane for the day.\nNote: We dilute the Urethane solution 1:2 to make the injectable volume =< 100 μL, ensuring Urethane to be distributed and absorbed more efficiently after IP injection.",
    "Note: In our experience, every pup responds differently to Urethane. Even pups from the same litter with similar weights showed variations in their responses towards Urethane. Generally, one booster dose (20% of the original) is sufficient to keep the pup anesthetized throughout the entire recording, but occasionally, two booster doses (20% of the original), delivered 20–30 minutes apart, are needed."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Microscopy",
    "Neuroscience",
    "Developmental Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}