{
  "id": 15067,
  "origin_website": "Jove",
  "title": "Introducing Point Mutations into Human Pluripotent Stem Cells Using Seamless Genome Editing",
  "procedures": [
    "1. Designing and constructing CRISPR/Cas9n-sgRNA expression plasmids\nSearch for 20-bp guide sequences directly upstream of any 5'-NGG near the site to be modified. A pair of single-guide RNAs (sgRNAs) is needed when the Cas9 nickase (Cas9n) from Streptococcus pyogenes is used. The pair of sgRNAs must be able to generate 5' overhangs upon nicking with a -4 to 20 bp offset6.\nOrder necessary oligos and pSpCas9n-2A-puro vector.\nClone sgRNA into the pSpCas9n vector for co-expression with Cas9n following the published protocol12.\n2. Designing and constructing a piggyBac-based targeting vector\nDownload the target gene sequence and search for a TTAA site near the site to be modified.\n\tNOTE: The distance between the TTAA site and the to-be-modified site should be as small as possible. If within coding sequence and no TTAA site is present within 100-bp distance, it is necessary to introduce one by making synonymous nucleotide substitutions.\nDesign homology arms (HAs) and incorporate desired point mutations in the HAs. The optimal length of HAs should be around 500 - 1200 bp.\n\tNOTE: It is recommended to introduce synonymous nucleotide substitutions to mutate the PAM sequence in order to avoid potential Cas9n re-cleavage.\nConstruct the final targeting vector following an established protocol10.\n\tNOTE: In the targeting vector used here, a PGK promoter driven puro-deltaTK selection cassette is flanked by transposon inverted repeats.\n3. Genetic editing of human pluripotent stem cells\nMaintain human pluripotent stem cells (hPSCs) in a humidified incubator at 37 °C and 5% CO2 on recombinant laminin 521-coated surfaces (5 µg/mL) in mTeSR1 medium13. The cells should reach 70-85% confluency after 72 hours following a 1:3 split ratio.\n\tNOTE: If present, remove spontaneously differentiated cells before daily medium change by gently aspirating them away.",
    "On the day of transfection, coat enough wells of a 24-well plate with 300 µL of the laminin 521 solution (5 µg/mL) at 37 °C for at least 2 h.\nRemove the coating solution gently and add 300 µL of fresh mTeSR1 medium supplemented with 10 µM ROCK inhibitor to each well, and then put the plate back to the incubator to receive cells.\n\tNOTE: Do not allow the plates to dry at any point when the laminin coating solution is removed.\nMove the stock hPSCs from the incubator, remove spent medium, and then wash the cells once using 1 mL of sterile 1x DPBS.\nAdd 1 mL of gentle cell dissociation reagent to each well of a 6-well plate and incubate at 37 °C for 6-8 min to dissociate the cells.\n\tNOTE: Gently tap the plate and check whether the cells can detach easily to decide whether the digestion is long enough.\nGently pipette up and down using a P1000 tip to lift off all the hPSCs.\nTerminate the dissociation by adding 2 mL of fresh mTeSR1 medium supplemented with 10 µM ROCK inhibitor (Y-27632) to the cell suspension.\nMix well and transfer the single-cell suspension to a 50 mL tube, and centrifuge at 200 x g for 3 min at room temperature.\nRemove the supernatant, and resuspend the cells well in 2 mL fresh mTeSR1 medium supplemented with 10 µM ROCK inhibitor.\nCount the viable cells using a hemocytometer. Use Trypan Blue to stain and exclude dead cells.\nTransfer 8 x 105 to 1 x 106 live cells to a 1.5 mL tube for each nucleofection reaction and centrifuge at 200 x g for 3 min. Then carefully aspirate the supernatant.",
    "Mix 3 µg of the paired Cas9n-sgRNA expression plasmids and 5 µg of targeting vector plasmid in 100 µL of mixed nucleofection solution/supplement from the human stem cell nucleofection kit. Use the GFP control plasmid from the kit and prepare a GFP control plasmid mix as well.\n\tNOTE: It is important to make a maxi-prep of all plasmids to reduce endotoxin contamination before nucleofection. The concentration of the plasmids should be approximately 1 µg/µL.\nUse the DNA mix (volume ~111 µL) to resuspend the prepared cells and transfer it to an electroporation cuvette (provided with the nucleofection kit), avoiding any bubbles.\nElectroporate the cells using the nucleofection device by selecting the optimized conditions for human pluripotent stem cells.\n\tNOTE: If using the nucleofection kit for human pluripotent stem cells for the first time, it is necessary to test the electroporation program and choose the most efficient one.\nImmediately add 500 µL of fresh and warm to 37 °C mTeSR1 medium supplemented with 10 µM ROCK inhibitor to the electroporated cells. Transfer the mix to 2 wells of a 24-well plate prepared from steps 3.2 and 3.3.\nQuickly put the plate back to the 37 °C/5% CO2 incubator and allow the cells to recover.\n12-16 h later, change cell maintenance medium. If the cells established cell-cell contact, withdraw the ROCK inhibitor, if not, continue supplementing the medium with the inhibitor.\nBetween 24-48 h, check the nucleofection efficiency by examining GFP expression in the control cells. GFP positive cells should be at least 30 percent.\n48 h after nucleofection, start selecting cells by supplementing the mTeSR1 medium with 1 µg/mL puromycin.\n72 h after nucleofection, supplement the mTeSR1 medium with 0.5 µg/mL puromycin. If the cell confluency is lower than 30%, also supplement the medium with 10 µM ROCK inhibitor.",
    "4-6 days post-nucleofection, passage the puromycin-resistant cells to 10-15 x 96-well plates at the concentration of 0.8 cells/well.\n\tNOTE: It is essential to supplement the medium with 10 µM ROCK inhibitor and 0.5 µg/mL puromycin.\nMaintain those cells at 37 °C/10% CO2 for 10-12 days to form single cell-derived colonies. Top up medium once 7 days after seeding.\n\tNOTE: Increased CO2 level helps single hPSCs to form colonies from our experience.\nMark wells containing a single colony and replace the medium with fresh mTeSR1 medium containing 0.5 µg/mL puromycin but no ROCK inhibitor.\n\tNOTE: From this point on, the cells will be grown under 37 °C/5% CO2.\nTwo days later, change medium for wells containing undifferentiated colonies. Supplement the medium with 10 µM ROCK inhibitor and 0.5 µg/mL puromycin.\n\tNOTE: In some wells, the cells might have differentiated and need to be discarded.\nUse P2 pipette tips to scrape off the colonies gently. Transfer the cell suspension derived from one colony into 2 new wells on separate 96-well plates, and use one for genotyping and one for maintaining.\n\tNOTE: It is important to carefully maintain the colonies and keep the spontaneous differentiation level to the minimum.\nTake the plate containing cells for genotyping out once the confluency in most wells reached 50% or above. Dump the spent medium and then wash the cells once with DPBS.\nLyse the cells in well using Bradley lysis buffer and isolate genomic DNA from each well in the plate following associated protocol (https://mcmanuslab.ucsf.edu/protocol/dna-isolation-es-cells-96-well-plate).\nUse a three-primer junction PCR method to genotype both left and right homology arms independently10.\n\tNOTE: A scheme showing the PCR method is presented in Figure 2.\nSend the junction PCR products for both homology arms from 4-5 colonies for Sanger sequencing and get the sequences.",
    "NOTE: The sequencing result of 2 established colonies is shown in Figure 3A.\nKeep colonies with the correct genotype and discard the rest.\nExpand the correct colonies under continuous puromycin selection and freeze them at the earliest possible passage.\n4. Removing transposon from targeted human pluripotent stem cells\nMaintain one colony with correct genotype under 0.5 µg/mL puromycin selection.\nNucleofect 8 x 105 to 1 x 106 cells with 5 µg hyperactive transposase (pCMV-hyPBase) as described above (Section 3, steps 3.4-3.18). Perform a GFP control nucleofection in parallel.\n\tNOTE: Puromycin should be removed from the mTeSR1 medium immediately after nucleofecting these cells.\nGrow and screen for cells with the puro-deltaTK selection cassette removed following published procedures10.\n\tNOTE: It is important to follow the original procedures carefully. FIAU, or 1-(2-deoxy-2-fluoro-β-d-arabinofuranosyl)-5-iodouracil), was used as a thymidine analog for Herpes simplex virus-derived thymidine kinase (HSV-tk)-based negative selection.\nSequence the modified region to confirm the removal of the transposon.\n\tNOTE: The sequencing result of 3 established colonies is shown in Figure 3B.\nKeep colonies with the correct genotype and expand for further usage.\nPerform characterization of pluripotency markers in the chosen colonies before using them for further analysis.\n\tNOTE: The characterization of two established colonies is shown in Figure 4."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}