{
  "id": 5516,
  "origin_website": "Bio",
  "title": "Electroshock Induced Seizures in Adult <em>C. elegans</em>",
  "procedures": [
    "Set up the microscope camera to the TV and digital video recorder as per the camera instructions (Figures 1 and 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170428/20170428010701_3173.jpgFigure 1. The experimental setup. The experimental setup includes a stereoscope (A), oscilloscope (B), timer output stimulator (S44) (C), stimulator (SD9) (D), and the recording equipment (E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170428/20170428010732_7042.jpgFigure 2. A simplified schematic of the experimental setup and analysis. A. The stereoscope (center), the recording equipment (left), and a stimulator (right) represent a simplified schematic of a basic experimental setup. To control duration, our setup includes an additional stimulator (S44); however, timing can be controlled by many different methods. B. A close up schematic of the experimental tube plugged on either end with copper wires; C. This schematic represents the normal, sinusoidal body position (arrow) of a worm before the shock. During and after the shock, the worms generally exhibit convulsions and paralysis, and then typically resume normal sinusoidal locomotion. This figure was adapted from Risley et al., 2016.Connect the output on the S44 stimulator via a cable with a banana plug splitter and connect it to the ground and mod banana plug inputs on the SD9 stimulator. The goal here is to connect the S44 to the SD9 stimulator so that the S44 can be used to modulate duration.Note: Be sure the polarity of the banana plugs is consistent.Set the S44 to at least 5 V and desired stimulus duration; we use 3 sec. Clip one of the alligator clips onto the positive (+) output on the SD9 and the other onto the negative (-) output. These alligator clip wires will connect the SD9 stimulator to the experimental tube (Figures 3 and 2B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170428/20170428010827_9811.jpgFigure 3. Close-up image of the experimental tube. The tube is plugged on either end with the insulated copper wires that are attached to the stimulator.",
    "The distance between the copper wire should be exactly 10 mm.Next clip each of the copper wires to the open end of each alligator clip. The open end of each copper wire will later be plugged directly into experimental tube when the experiment is ready to begin. Set up the microscope camera to the TV as per the camera instructions (Figures 1 and 2A). Note: It is very important to set up the experimental tubes consistently to obtain a consistent. 1-day old adult Caenorhabditis elegans are used for the experiments. 24-h before experimentation, approximately 30 L4 stage worms per genotype are transferred to fresh NGM plates seeded with OP50 E. coli. The worms are placed in a 20 °C incubator overnight; and will mature into 1-day old adults in approximately 18 h. During experimentation the following day, the worm plates are left on the lab bench at room temperature (23 °C).Typically, the drug solutions are prepared on the morning of experimentation. The drugs are dissolved directly into a vial of M9 solution with a total volume of 3-5 ml, depending on the number of experimental trials. Sham controls are also prepared at this time. The prepared reagents can be stored, at 4 °C or based on the specifications of the drug, for experiments performed on consecutive days.Note: Water-soluble drugs were dissolved directly into M9 (Risley et al., 2016); however, a DMSO concentration curve was conducted in Risley et al. (2016) and it was reported that DMSO concentrations up to 0.5% had no significant effect on wild-type locomotor recovery after electric shock.   Next, load a blank DVD+R into the HDD/DVD recorder and turn on the TV screen. Also, verify that the settings are correct on the timer output stimulator and stimulator using the oscilloscope.",
    "We typically set the electroshock parameters to 47 V, 3 sec duration. This voltage was selected based off a voltage-response curve. The maximum voltage in which wild-type worms recovered was about 60 V and they recovered, on average, in 85 sec. 47 V was selected as worms recover in approximately one half the time of maximum limit for recovery (Figure 4). Note: The timer output stimulator (S44) is used only as a trigger for the SD9 stimulator, which sends current to the worms. The duration, typically 3 sec, is set on the S44 and used as a trigger to regulate the duration. There are many other ways to control for the duration including using a digital trigger via a computer or an Arduino. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170428/20170428011021_7380.jpgFigure 4. A voltage response curve demonstrates locomotor recovery times in wild-type worms. Wild-type worms did not recover at voltages ≥ 70 V. The maximum tested limit for recovery was 60 V where worms recovered in approximately 80 seconds. 47 V was the voltage in which recovery time was 50% of the maximum limit. This figure was adapted from Risley et al., 2016.Load approximately 20 µl of control solution or drug solution. Immediately following, load 6-8 worms into the tube using a platinum pick and set a timer for 30 min. 30 sec before the timer expires, gently place the tube under the microscope/camera setup with the light base turned on, and plug each copper wire into the two ends of the tube; the wires should be 10 mm apart (Figures 3 and 2B). Verify the distance between the copper wires is precise (a ruler will suffice) and initiate the electroshock. Allow the experiment to record for 10 min. After the 10 min recording, the tube and its contents are discarded.",
    "Note: Generally, a tube is loaded every 10 min. Each tube is shocked and recorded for 10 min before it is discarded and another tube is immediately prepared. Also, OP50 transferred from the platinum pick to the tube should be minimized as it could impede the view of the worms."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}