{
  "id": 13767,
  "origin_website": "Jove",
  "title": "Immunostaining to Visualize Murine Enteric Nervous System Development",
  "procedures": [
    "The University of Wisconsin Animal Care and Use Committee approved all procedures.\n1. Preparation of Solutions\nUse 1x phosphate buffered saline (PBS) as dissection buffer and rinsing solution.\nPrepare 30% sucrose by weighing 30 g of sucrose and place into a bottle. Add 99 ml of 1x PBS and add 1 ml 10% sodium azide. Mix thoroughly until all of the sucrose is dissolved. Store at 4 °C until required.\nPrepare Blocking solution by mixing 1x PBS, 3% bovine serum albumin (BSA) and 0.1% Triton-X-100. Mix thoroughly and store in the fridge until needed.\nPrepare 8% paraformaldehyde (PFA) solution in 1x PBS by weighing the appropriate amount of PFA into 1x PBS and then incubate at 65 °C until it is completely dissolved. Store in 25 ml aliquots in the -20 °C freezer until needed. Dilute to 4% PFA in 1x PBS on the day of use.\n2. Embryo and Gut Dissection\nIn accordance with Institutional Animal Care and Use Committee approved protocols, euthanize timed pregnant mouse and transfer the uterus into a 60 mm Petri dish containing ice cold 1x PBS.\nUnder a dissection microscope using sharp scissors, cut the uterine wall open to expose the embryos. Remove the embryos from the uterus and place into a clean 60 mm Petri dish containing ice cold 1x PBS.\nEuthanize each embryo by decapitation in ice-cold 1x PBS. If you are using transgenic mice containing fluorescent proteins, under fluorescence illumination, identify the positive transgenic embryos.",
    "Dissect the GI tract from each embryo using a dissection microscope. Using fine forceps, orient the embryo such that the left side is facing upwards and the right side is against the bottom of the Petri dish. Remove the upper body wall from the embryo to expose the internal organs. Insert fine forceps between the dorsal body wall and the internal organs. Cross the forceps against each other in a scissor-like cutting action to remove the internal organs from the embryo.\nFurther sub-dissect the GI tract away from the surrounding organs and then place each GI tract into a 1.5 ml microcentrifuge tube containing ice-cold 1x PBS.\n3. Fixation of GI Tracts\nRinse each GI tract 3 times with ice-cold 1x PBS and then replace with 4% PFA. Fix the GI tracts in the 1.5 ml microcentrifuge tubes on a rocking platform at RT for 1.5 hr. Rinse the GI tracts 3 times for 5 min at RT and then for 1 hr on the rocking platform. At this stage, store the GI tracts at 4 °C in 30% sucrose in 1x PBS containing 0.1% sodium azide until needed.\n\tNOTE: Alternatively, store the embryos in 30% sucrose for up to one year without any effect on the integrity of the tissues. Storage of the samples in 30% sucrose allows later processing of the samples either for immunostaining or into OCT for cryo-sectioning. Alternatively, proceed with the immunostaining protocol detailed below.\n4. Immunostaining Protocol\nIf samples have been stored in 30% sucrose, rinse them 3 times for 20 min in 1x PBS on a rocking platform.\nPlace the GI tracts into blocking solution on a rocking platform for 1h at RT.",
    "Remove the blocking solution and incubate the GI tracts with the appropriate amount of primary antibodies diluted in blocking solution for either 4 hr at RT or O/N at 4 °C on a rocking platform. Use 1:1,000 dilution of human anti-Hu antibody (serum obtained from patient), 1:1,000 dilution of chicken anti-green fluorescent protein (GFP) antibody and 1:100 dilution of goat anti-ChAT antibody.\n\tNOTE: We utilize a human anti-Hu antibody that was obtained locally from a patient, however, anti-Hu antibodies are commercially available, for example, mouse anti-Hu, (use at 1:500 dilution).\nRinse the GI tracts in 1x PBS 3 times for 5 min and then for 1 hr at RT on a rocking platform.\nReplace the 1x PBS with secondary antibodies diluted 1:500 in blocking solution on a rocking platform for either 4 hr at RT or O/N at 4 °C. Use donkey anti-human amine-reactive dye such as Dylight, donkey anti-chicken Cy2 and donkey anti-goat Cy5. If using the mouse anti-Hu antibody then use a 1:500 dilution of donkey anti-mouse amine-reactive dye 405.\n\tNOTE: The intensity of the endogenous GFP and tdTomato expression and the clarity of immunostaining increase with developmental age. We typically immunostain embryonic guts individually in 0.2 ml tubes with 150 μl of staining solution in order to reduce the volume of antibody used and also to ensure efficient staining of the tissue.\nRinse the GI tracts in 1x PBS 3 times for 5 min and then for 1 hr at RT on a rocking platform.\nPlace a few drops of fluorescence mounting medium with DAPI onto a glass slide. Immerse the GI tract into the fluorescence mounting medium and add a cover glass directly on top of the tissue. The fluorescence mounting medium -G is a water-soluble compound that provides a semi-permanent seal.",
    "NOTE: Use fluorescence mounting medium such as Vectashield which is a glycerol based mounting medium that prevents fading and photobleaching of antibodies. Both of these products enable tissues to be stored for long periods of time at 4 °C.\nCapture images of each of fluorophore using a confocal microscope. Use excitation wavelengths for fluorophores and filters employed presented in Table 3.\nPerform computer-aided image analysis using appropriate software depending on the type of confocal used to capture images.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}