{
  "id": 9034,
  "origin_website": "Jove",
  "title": "Measuring Progressive Neurological Disability in a Mouse Model of Multiple Sclerosis",
  "procedures": [
    "All animal work utilizes protocols reviewed and approved by the Institutional Animal Care and Use Committee (IACUC) at Geisel School of Medicine at Dartmouth.\n1. The Mouse Model\nInduction of TMEV-Induced Demyelinating Disease\nMove the cages containing 4- to 6-week-old female SJL/JHan mice from the rack to a comfortable working space. Mark the mice (e.g., with an ear tag or ear punch) to allow for individual evaluation of clinical and histological disease.\nDraw 30 μl of TMEV infecting stock (2 x 106 plaque forming units; PFU) in PBS into a 29-gauge insulin syringe and needle.\nPrepare the anesthesia gas machine: check the system to ensure the presence of adequate amounts of oxygen and isoflurane for the duration of the procedure.\nTurn on the flow meter to 1 L/min. Place the animal into the induction chamber and seal the top. Turn on the vaporizer to 3.5% and monitor the animal until recumbent.\nRemove the animal from the chamber and test the mouse by pinching the footpad to ensure adequate anesthesia. Lack of response to a strong pinch indicates adequate anesthesia.\nClean the injection site with 70% isopropyl alcohol.\nInject the 30 μl of TMEV infecting stock into the right cerebral hemisphere by freehand injection (Figure 1). The site of injection is approximately halfway between the eye and ear line and just off the midline.\nReturn the mouse to its holding cage once fully alert and mobile (usually 3 - 5 min).\nEuthanize mice by exsanguination or cardiac perfusion 3 to 6 months after TMEV infection, depending on the rapidity of development of the disease.\n2. Rotarod Analysis\nThe Rotarod Apparatus\nTest mice prior to TMEV infection to familiarize them with the machine and to assess their normal baseline balance coordination and motor control.",
    "Start the adaptation protocol on -5 days post infection (dpi; i.e., 5 days before TMEV infection).\nAllow the mice to acclimate to the testing room for at least 30 min prior to Rotarod testing, in order to allow them to adjust to the environment.\nMake sure that both the Rotarod unit and the computer are plugged in and connected to each other (Figure 2).\nPre-set the Rotarod with the -5 dpi training protocol parameters, as described in Table 1.\nSave the work file with the date and identification information.\nMove the cage containing the squad to be tested from the rack to a table adjacent to the Rotarod. Mice are usually tested in squads of 4.\nPick up a mouse by the tail and place it on the rod, facing away from the operator. Repeat for the second through the fourth mouse. If a mouse falls or jumps, place it back in its lane on the Rotarod until all mice are in position. Ignore if any mice turn around to face the operator.\nAfter loading all the mice, press the \"Enter\" button to start the experiment. Observe the timers start automatically and the rotations per min (rpm) on display for each lane.\n\t\t\nAs each animal falls from the rod, record the speed of the rod at the time of the fall, as well as the duration of time the animal remained on the rod. The rod will continue to rotate until the last animal has fallen from the rod assembly.\nAfter all the mice have fallen, use a tissue to remove any fecal boli and urine from the rod. The presence of urine and fecal material may affect the ability of mice to grip the rod.",
    "After a 3-min rest, give the mice a second and then a third trial. The maximum time per single trial is 240 sec. Administer a total of 3 trials during each testing day.\nReturn the mice to their home cage and return them back to the rack. At the end of the experimental session, clean the Rotarod with soap and water to remove all fecal matter off the machine.\nWipe clean the baseplate with ethanol 70%. Spray down the whole machine with chlorine dioxide to disinfect.\nOn days - 4, - 3, - 2, and - 1 pi, pre-set the Rotarod with the appropriate training protocol parameters, as described in Table 1, and repeat steps 2.1.2 to 2.1.12.\nAfter obtaining the baseline measures, infect the mice with TMEV. Allow a 6-day pi recovery period.\ntable:\n﻿0,1,2,3,4,5,6,7\nProtocol,Testing Day,Frequency,Starting speed (rpm),Max Speed (rpm),Acceleration,Trials,ITI\nProtocol,Testing Day,Frequency,Starting speed (rpm),Max Speed (rpm),(rpm/sec),(N x sec),(min)\nTraining,- 5 d.p.i,1/day,1,12,01/03,3x240 sec,3\nTraining,- 4 d.p.i,1/day,1,13,01/03,3x240 sec,3\nTraining,- 3 d.p.i,1/day,1,14,01/03,3x240 sec,3\nTraining,- 2; - 1 d.p.i,1/day,5,40,01/03,3x240 sec,3\nExperimental,From +7 to +50 d.p.i,2/week,5,40,05/30,3x240 sec,3\nExperimental,From +51 to +150 d.p.i,1/week,5,40,05/30,3x240 sec,3\nTable 1: Rotarod Parameters in Training and Experimental Protocols.\nThe Rotarod Experimental Protocol\nOn +7 dpi, pre-set the Rotarod with the appropriate experimental protocol parameters, as described in Table 1. Repeat steps 2.1.2 to 2.1.10.\nAt the end of trial #3, weigh each mouse and make a note of the body weight on the data sheet. Clean and disinfect the Rotarod as per steps 2.1.11 and 2.1.12.",
    "Test the mice twice a week for the following 6 weeks, as described above. After 6 weeks (in which the mice have likely reached a plateau phase)8,9, test the mice once a week with the same experimental protocol. The actual testing protocol lasts an average of 150 days, depending on the specific disease course.\nNeurological Functional Index\nExport the raw data into a spreadsheet file and analyze the results.\nExpress data as running time (Figure 3A): this is the normal running time plus the passive rotation time minus the rotation delay time (Table 2)10. Calculate the mean running time of the three trials per day.\nExpress the data as a neurological functional index (NFI; Figure 3B).\n\t\t\nCalculate the baseline performance threshold of each individual mouse. The baseline performance threshold is determined as the mean of all running times from day + 15 to + 45 pi6,7.\nCalculate the NFI as the mean of the three most recent average running times divided by the baseline performance threshold of that specific mouse6,7.\n\t\t\tNOTE: If the tested running times for a mouse on day + 72, + 76, and + 79 pi are 55 sec, 45 sec, and 50 sec, and the baseline time for the same mouse was 135 sec, the NFI for that mouse on +79 dpi will be [(45+50+55)/3]/135 or 0.37.\nExpress the data as an adjusted NFI (adjNFI; Figure 3C): adjust the NFI data by a population value for the single experiment.\n\t\t\nCalculate the adjNFI by dividing the NFI value by the average NFI obtained by the sham-treated group on that specific day.\ntable:\n﻿0,1\nTerm,Definition\nNormal running time,\"The total time the mouse spends actively running on the rotating rod, i.e., latency to fall.\"",
    "Passive rotation time,The amount of time the mouse has remained on the rod in the passive rotation mode.\nRotation delay time,The amount of time the mouse remains on the rod during the passive rotation mode\nPassive rotation mode,When the mouse grabs the rod and rotates without having to ambulate.\nTotal session time,Total amount of time the mouse remains on the rotating rod during the session.\nBaseline performance,Pre-damage motor performance assessed to determine the minimum performance threshold.\nNeurological function index (NFI),\"Clinical index, which compares each mouse motor performance, i.e., running time, at any time to its peak performance.\"\nAdjusted neurological function index (adjNFI),When a normalization process is applied to adjust NFI data by a population value for the single experiment.\nPopulation value,Average NFI value obtained by the sham-treated group at a specific day.\nTable 2: Definitions of Rotarod Parameters Adopted to Quantify Neurological Impairment.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}