{
  "id": 6856,
  "origin_website": "Bio",
  "title": "Isolating Multiple Extracellular Vesicles Subsets, Including Exosomes and Membrane Vesicles, from Bovine Milk Using Sodium Citrate and Differential Ultracentrifugation",
  "procedures": [
    "Note: All procedure should be performed at 4 °C. Start ultracentrifuge and set device temperature at 4 °C.Mix 125 ml of skimmed milk and 2% sodium citrate 1:1 in a sterile glass or plastic bottle.Note: Pour sodium citrate first then milk to accelerate casein micelles breaking. Keep on a rocker for 15 min at 4 °C. Make sure milk is gently mixing (1/4th max speed).Note: This can be done in cold room or by putting ice on the rocker and milk on the ice. After 15 min, milk should clarify (get translucid with an aspect comparable to blood plasma) and ready for loading into ultracentrifugation tubes (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233016_3162.jpgFigure 1. Mixing skimmed milk with 2% sodium citrate 1:1 leads to milk clarification after 15 min incubation on a rocker at 4 °CNotes: Adding calcium carbonate reverses the clarification confirming the involvement of calcium chelation in the process. If the milk you use is not clarified, you can increase sodium citrate concentration to 3% or 4%. Fill the ultra-clear centrifuge tubes (Figure 2) completely with milk-sodium citrate mix.Note: Make sure the tubes are filled completely or they might break upon centrifugation. Put tubes in rotor tube holders and use sterile pipet to equilibrate mass between opposed tubes (Figure 2) by transferring milk-sodium-citrate mix between the opposed tubes (keeping comparable added mass of the tube, milk-citrate solution, tube holder and cap).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233103_0135.jpgFigure 2. Ultraclear thick ultracentrifugation tubes should be loaded into the tube holder before mass equilibration for ultracentrifugationClose caps and place them in the socket they are meant for (indicated by the number on the tube holder and the rotor, Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233129_4938.jpgFigure 3. Ensure loading SureSpin tubes in the right socket to avoid equilibrium troublesSpin EVs are the desired speed.",
    "In our protocol we isolated low-speed sedimenting EVs at 35,000 x g (35K) for 2 h, at 4 °C. We used Sorvall WX TL-100 ultracentrifuge’s automated calculations of the K factors and set acceleration at A = 9 and break at D = 9.Note: If working with another ultracentrifuge, make sure to translate the g-force speed into the proper rotation per minute (RPM) considering rotor angle and k factor. If wishing to use different speeds, refer to the rotor and centrifuge manufacturer recommendations[href=https://assets.thermofisher.com/TFS-Assets/LED/Specification-Sheets/Thermo-Scientific-SureSpin-630-(36mL)-Rotor.pdf]. If you work with raw milk, you can decellularize the liquid with two centrifugations at 1,000 x g for 10 min and 4,500 x g for 30 min, at 4 °C. Afterwards, you can proceed as described above. After 2 h, EVs should have sedimented forming a translucid gelatinous pellet on the bottom of the tube (Figure 4C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233222_2506.jpgFigure 4. Non-diluted and PBS-diluted milk led to the formation of casein jelly after 35,000 x g ultracentrifugation. Dilution with sodium citrate leads to small EV-rich pellet with very little casein contamination. A. 35,000 x g pellet from non-treated milk. B. 35,000 x g pellet from diluted milk 1:1 in PBS. C. 35,000 x g pellet from diluted milk 1:1 in 2% sodium citrate contains very little contaminating casein.Note: The pellet on the right contains P35K EVs. It might not be visible prior to discarding the supernatant and suspension. It is well fixed to the bottom of the tube so there is little risk to lose it in the next steps.Transfer the supernatant into new clean/sterile ultracentrifugation tubes.Note: This can be done using a serological pipet and pipetting device or directly by pouring the supernatant into a new tube, this depending on the desired sterility levels.",
    "Equilibrate the supernatant tubes and centrifuge at 70,000 x g (70K) for 1 h, at 4 °C following the same procedure as previously.During the 70K ultracentrifugation, revert the remaining liquid free 35K pellet-containing tubes on a tube holder with sterile gauze/paper on the bottom of it, with the opening of the tubes touching the gauze/paper to allow remaining liquid to be discarded by capillarity within the gauze/paper (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233250_6648.jpgFigure 5. Reverting tubes over a paper sheet allows remaining liquid to be discarded by capilarityNote: This is important to avoid contamination with proteins from the supernatant and to keep precise suspension volumes. You can use pipet and tips to discard any remaining liquid or sterile gauze/paper inside the tube.Suspend all the pellets (6 tubes) in the same 1 ml sterile filtered PBS solution.Notes: The pellet is gelatinous and not easy to suspend. Avoid breaking it with the tips. Use pipet and 1 ml filtered tip to drop PBS on it and use PBS to gently “erode” the pellet starting from its sides and getting gently to the center. Try to be quick and efficient to avoid drying of the pellets but avoid rough mixing or you will end up with a foam limiting pellet suspension. You can also pour 100 μl PBS on the tubes you are not suspending while using 500 μl PBS to suspend the first tube. Transfer the 500 μl to the second tube having thus 600 μl for the second pellet, and so on. Depending on your application, you can include 0.5% EDTA to the PBS to help with the suspension with caution if planning on doing qPCR or for functional studies. Transfer suspended P35K EVs into a 1.",
    "7 ml Eppendorf tube and put on a rotating mixer at 4 °C at least for 24 h to allow full suspension of P35K EVs. EVs can then be stored at -80 °C for few days. However, this might lead to a certain level of degradation and EVs are thus better to be used on the day of preparation. EVs can also be filtered through 0.22 µm membrane microfilters to ensure their sterility, and to break down EV aggregates, before using them for any application.After P70K ultracentrifugation, proceed as previously for P35K EVs, transfer the supernatant in new ultracentrifugation tubes and subject these tubes to a 100,000 x g ultracentrifugation (100K) at 4 °C for at least 1 h (the longer, the higher yield of exosomes will be reached) (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233321_6289.jpgFigure 6. Non-diluted and PBS-diluted milk led to the formation of casein jelly after 70,000 x g ultracentrifugation. Dilution with sodium citrate leads to small EV-rich pellet with very little casein contamination. A. 70,000 x g pellet from non-treated milk. B. 70,000 x g pellet from diluted milk 1:1 in PBS. C. 70,000 x g pellet from diluted milk 1:1 in 2% sodium citrate.Note: Discard 70K pellet or keep it if interested by its content (Figure 6C). If so, proceed to its suspension as for P35K EVs.After P100K ultracentrifugation, transfer the 100K supernatant to new ultracentrifugation tubes and subject to 100,000 x g ultracentrifugation for 18 h at 4 °C if you wish to obtain an EV-free supernatant to use as a control.Suspend 100K pellet (Figure 7C) the same way as for previous pellets and store EVs the same way.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200602/20200602233345_6516.jpgFigure 7. Non-diluted and PBS-diluted milk led to the formation of casein jelly after 100,000 x g ultracentrifugation.",
    "Dilution with sodium citrate leads to small EV-rich pellet with very little casein contamination. A. 100,000 x g pellet from non-treated milk. B. 100,000 x g pellet from diluted milk 1:1 in PBS. C. 100,000 x g pellet from diluted milk 1:1 in 2% sodium citrate."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}