{
  "id": 17170,
  "origin_website": "Jove",
  "title": "3D Printing Model of a Patient's Specific Lumbar Vertebra",
  "procedures": [
    "All data come from the clinical patient, whose SDR operation was carried out at BJ Dongzhimen Hospital. The protocol follows the guidelines of and was approved by the Dongzhimen Hospital research ethics committee.\nNOTE: The whole map of the model reconstruction protocol is shown in Figure 1. The high-resolution computed tomography (HRCT) data and Dixon data are raw materials for modeling; then, the 3D model creation consists of image registration and fusion. The final 3D digital model is printed by PolyJet technology which is a high-precision 3D printing process that produces smooth and accurate parts using a wide range of materials. In order to describe the spatial relationship between the vertebra and spinal nerve exactly, HRCT data and Dixon image series are used. The Dixon scanning can identify water and fat separation images, in which the Dixon water phase image series can be used to extract the structure of the spinal nerves, and the Dixon-in phase image series can be used to check the registration of the bone structure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65093/65093fig01.jpg\nFigure 1: The whole map of the protocol. The research methodology of this study involves the fusion of CT and magnetic resonance Dixon sequences. Specifically, the CT vertebrae structure is registered with the identical vertebrae structure contained in the Dixon-in sequence, followed by fusion with the Dixon-w sequence for the spinal nerve. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65093/65093fig01large.jpg]\n1. Data collection and preparation\nHigh-resolution CT for vertebrae\n\tNOTE: The parameter difference is not sensitive to the research method.\n\t\nSet the data resources from the CT machine station.\n\t\tNOTE: Here, the SIEMENS-CTAWP73396 CT machine is used.",
    "Open the Syngo CT 2012B software to receive data from the scanning protocol SpineRoutine_1. Select the Pixel Size and Slice Thickness (ST) of the dataset to adapt to the size of the vertebrae intended to be represented in the 3D digital model.\nUse an ST of 1 mm with a matrix size of 512 pixels x 512 pixels, in which the pixel spacing is 0.3320 mm. The actual size of the 3D volume achieved is 512 x 512 x 204 voxels.\nDixon sequence for spinal nerve\n\t​NOTE: A 1.5 T MRI machine is used in this study.\n\t\nSet the Dixon image Resolution as 290 pixels x 320 pixels, Pixel Spacing as 0.9375 mm, and Slice Thickness as 3 mm to obtain accurate data.\nSet the Repetition Time as 5,160 ms and the Echo Time as 94 ms.\nEnsure every scanned layer consists of four-phase images, which are Dixon-in, Dixon-opp, Dixon-F, and Dixon-w.\nPrepare data-storing files for model reconstruction.\n\tNOTE: A well-defined data-storing structure is more convenient for follow-up work.\n\t\nMake a project folder to contain all the data belonging to the patient.\nPrepare different file paths for HRCT and MRI-Dixon data by making different folders for the digital imaging and communications in medicine (DICOM) data.\nMake a separate folder under the project for all analysis results.\n2. The 3D digital vertebrae model\nNOTE: All subprocess functions come from software tools, whose property belongs to Beijing Intelligent Entropy Science & Technology Co Ltd.\nCall the Dicom2Mat subprocess in the MATLAB workplace to obtain the 3D volume from the DICOM files stored in the HRCT data folder.\nAfter undergoing the Dicom2Mat subprocess, view each slice within the 3D volume through the graphical user interface (GUI), as depicted in Figure 2.",
    "Then, visualize the intensity distribution of the vertebrae HRCT data by the hist function (Figure 3).\nCall the NoiseClean subprocess to delete signal noise formed by the device under the HRCT data file paths.\nUse the Vertebrae function subprocess under the same path to gain the vertebrae model, which is also a 3D volume but only with the bone structure (Figure 4). The high-pass filter parameters, the intensity ranging from 190 to 1,656.\n3. The 3D digital spinal nerve model\nNOTE: Dixon-in contains bone structure, while Dixon-w describes neural structure.\nUse the Dicom2Mat subprocess in both paths of the Dixon-in and Dixon-w sequences and get their 3D volume.\nFurthermore, visualize each individual slice that constitutes a 3D volume using the GUI presented in Figure 5. Access this visualization once the Dicom2Mat subprocess has been completed.\nUse the Spinal_Nerve function to reconstruct the spinal nerve model with high-pass filter parameters, the intensity ranging from 180 to 643. Because the signals of the nerve in the Dixon-w sequence are very high, extract the spinal nerve 3D volume by filtering out points with low intensity.\nWhen the Spinal_Nerve subprocess is finished, check the model generated in the GUI shown in Figure 6.\n4. Registration and fusion\nNOTE: The key insight is that bone architecture is present in both HRCT and Dixon-in imaging sequence.\nCopy the three 3D volumes obtained so far to the file path of the project made in step 3.1. The models from HRCT and Dixon-in include the same vertebrae structure, and the models from Dixon-in and Dixon-w have the same coordinates.\nThen, put the three models' filenames into the vertebra_fusion subprocess as an input to generate the fusion model. This can be visualized in Figure 7.",
    "The fusion is usually well done. If fine-tuning is necessary from the doctor's perspective, add coordinate parameters in all directions to the same function to correct the fusion model. If slight errors are observed in fusion from a clinical perspective, use the vertebra_fusion function to fine-tune the fusion coordinates. This process involves parameter adjustments to the six dimensions of coordinate direction (XYZ coordinates and their rotation).\nMake a separate folder in the project directory for outputting the result of the fusion model.\n5. Digital model files for 3D printing\nNOTE: A fully-developed 3D printing apparatus is utilized for the manufacturing of the aforementioned digital model, with the implementation of Delaunay triangulations. Here, the Stratasys J55 Prime 3D printer was used.\nExport the fusion models to be used for 3D printing in the DICOM format sequences under the file path of the fusion directory. Utilize the Mat2Dicom algorithm to execute the export operation by inputting the fusion model.\nOpen the DICOM file sequence exported previously using Materialise Mimics V20. To perform the export operation, navigate to the Export menu under the File tab and select the VRML format. The file path for the export can be freely customized according to the user's requirements.\nAs transparent colorful 3D printing is a professional service, compress and pack the VRML files and send them to the service provider. The 3D printing result is shown in Figure 8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}