{
  "id": 8161,
  "origin_website": "Bio",
  "title": "Western Blot Analysis of Chloroplast HSP70B in <em>Chlorella</em> Species ",
  "procedures": [
    "Cells lysisAdd 100 μl Lisys Solution (LS) to the pellet (Chankova et al., 2013b) transfer to a chilled mortar, add two spatulas of silica sand, grind in the mortar for 3 min, add 200 μl LS in the mortar to wash and transfer the material into an Eppendorf tube of 2 ml. Centrifuge material from step 1 for 10 min at 14,500 x g.Separate the supernatant and heat the supernatant for 5 min at t = 90 °С. Centrifuge for 5 min at 14,500 x g.Split the supernatant in 2 samples: The first one use for the determination of protein concentration; the second one keep at t = -20 °С. Determination of protein concentration (Bradford)Add 30 μl 20% TCA to 30 μl supernatant. Centrifuge for 5 min at 14,500 x g.Add 60 μl 0.1 N NaOH to the pellet and mix thoroughly. To obtain best result add twice 30 μl of 0.1 N NaOH. Take 14 μl, add 86 μl 0.15 М NaCl and 3 ml reagent of Bradford. Use calibration curve for quantity of protein (Table 1).For calibration curve: Stock solution – 0.5 mg/ml BSAUse Table 1 to determine every point of standard curve add 3 ml reagent of Bradford. Table 1. Calibration curve for quantity of proteintable:\n﻿0,1,2,3\nN,BSA (μg),BSA (0.5 mg/ml) vol (μl),NaCl (0.15 M) vol (μl)\n1,0,0,100\n2,5,10,90\n3,10,20,80\n4,15,30,70\n5,20,40,60\n6,25,50,50\n7,30,60,40\n8,35,70,30\n9,40,80,20\n10,45,90,10\n11,50,100,0",
    "Protein electrophoresisPut about 100 ml of the 1x Laemmli buffer into cuvettes of electrophoresis module. Remove the comb and rinse the wells with buffer of SDS-PAGE gel. Pipet 10 μg protein into every well: adjust volumes so equal amount of protein is loaded (example: 10 μg protein are contained in 10 μl sample).Put the rest buffer in a bath of electrophoresis chamber (the volume must be always above minimum.).Run electrophoresis using the following parameters: 120 V and 16 mA for 3.5 h.When the electrophoresis is completed, remove the gel carefully. Note: The order of the dropping of the samples. Concentrated gel should be released. Transfer of proteins on the NCMSoak the gel for 15 min in buffer.Soak sponge and filter paper for sandwich in transfer buffer.Cut NCM. The size should be such as the size of the gel. Put NCM for 5 min in transfer buffer.Note: Mark the order of samples on the membrane! Label the membrane with a pencil. Make a sandwich.The stack is assembled on the black cathode side (see Figure 1):Center a packing sponge on the black cathode side.Center a packing sponge on the black catode (a).Lay one piece of wet filter paper on the sponge (b).Position the equilibrate gels on the filter paper(c).Lay the membrane on the gel (d).Lay one piece of wet filter paper on the membrane (e).Lay two packing sponges on the filter paper (f).A second transfer stack if added, is placed between these two sponges.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130730/20130730035707_0257.jpgFigure 1. Assembling a transfer stack (this is an original figure taken from the Technical Guide available at www. hoeferinc.com)Different parts of the sandwich press very well, to avoid bubbles. Different parts of the sandwich should be well moistened. You can \"roll\" them with a tube.Close the apparatus. Put in a chamber transfer buffer.",
    "Run blotting with the following parameters: 35 V and 250 mA for 2 h.Western blotAfter the transfer of proteins, place the membrane in blocking buffer at t = 4 °C. Incubate on a rocker platform for 1 h (following this step we have obtained the best results).Place gels in staining solution for 4-5 h.Wash for 3-4 h the gel with washing solution. Dilute primary antibody in blocking buffer (1:10,000) and incubate according to manufacturer’s instructions. Incubate on a rocker platform at t = 4 °C overnight.Wash the membrane in TBS-T buffer on a rocker platform in a following way: twice for 2 min (2 х 2 min), after that twice for 10 min (2 x 10 min).Prepare secondary antibody in blocking buffer (1:20,000) and incubate according to manufacturer’s instructions. Incubate on a rocker platform at RT for 2 h.Wash the membrane in TBS-T buffer on a rocker platform in a following way: Twice for 2 min (2 х 2 min), after that three times for 5 min (3 x 5 min).Visualize using HRP Color Development Solution, 4CN according manufacturer’s instructions. Scan the membrane. Calculate protein amount using Image J program."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}