{
  "id": 11982,
  "origin_website": "Jove",
  "title": "Testing Targeted Therapies in Cancer using Structural DNA Alteration Analysis and Patient-Derived Xenografts",
  "procedures": [
    "Fresh tissues from consenting patients with ovarian cancer were collected at the time of debulking surgery according to a protocol approved by Mayo Clinic Institutional Review Board (IRB). All animal procedures and treatments used in this protocol were approved by Mayo Clinic Institutional Animal Care and Use Committee (IACUC) and followed animal care guidelines.\n1. Mate pair sequencing and analyses\nNOTE: Either fresh or flash frozen tissue must be used for mate pair (MPseq) sequencing. Paraffin embedded material is not suitable because it contains fragmented DNA.\nIsolate DNA from frozen tumor tissue. Use original human specimen obtained from surgical material or biopsy36.\nUse 1000 ng of DNA to make MPseq libraries and sequence as 2 samples per lane on the next generation sequencer (see Table of Materials)36.\nAnalyze data using a set of algorithms to detect large chromosomal aberrations (deletions, insertions, amplifications, inversions and translocations) as described earlier36,37.\n2. Selection of therapeutic targets\nUse the open access Panda tool (Pathway and Annotation) or an analogous tool to identify targetable alterations (http://bioinformaticstools.mayo.edu/Panda).\n\t\nMake a list of genes that are identified by MSeq as altered, as a simple tab-delimited file, using standard accepted gene symbols.\n\t\tNOTE: The included example features analysis of amplifications and gains.\nAdd a “#” sign to the header line of the list to ensure that the table header is transferred to the pathway level view of the software.\nUpload the file by clicking the Upload Annotation Set navigation tab.\nAssign a single icon from the menu to represent the underlying data by clicking on the icon of choice and then clicking the Finalize tab.\nAfter the annotation files are uploaded, identify a column that displays the number of annotated genes per pathway. This is the last column on the right.",
    "Use Pathway Filter on the upper left of the main window to show pathways containing genes of interest.\nIdentify pathways that have more annotated genes than is expected by chance. Use the function located under the Enrichment tab.\nSelect a database to display potentially druggable genes from Preset Annotation by checking an appropriate icon on the left of the main window (e.g., DGIdb, PharmGKB).\nSelect pathway for visualization by clicking on its name displayed in the Pathway Viewer page.\n\t\tNOTE: Icons representing each annotation set are shown next to the associated gene. Click on the gene of interest to open the corresponding GeneCards webpage.\nSelect the pathways that showed the annotated genes of interest (i.e., altered in a given tumor) and “hits” for potential drugs for further analysis.\nUse a database containing drugs approved for clinical application (https://clinicaltrials.gov/) to cross-reference the identified targets.\nPrioritize targetable alterations for further testing in PDX models by performing a literature review (e.g., PubMed) to confirm relevance to the biology of a particular type of tumor.\n3. Validation of genomic rearrangements by PCR and Sanger sequencing\nDesign primers using sequencing reads obtained from MPseq data.\n\t\nSelect a junction of interest for the validation (i.e., potential therapeutic target) based on MPseq analyses.\nDesign primers directionally such that the amplicon contains the junction. Design 2 primers on each side of the junction, for a total of 4, to increase the chances of amplifying the junction.\n\t\tNOTE: Name primers according to the case and chromosome location.\nUse standard PCR parameters for the primer design and a software of choice. Select melting temperature (60-62 ˚C) and the GC content (40-60%). Make sure that the primer sequence does not form primer dimers, palindromes or hairpin loops.",
    "Confirm that the primer sequence lacks homology to other areas of the human genome by checking it using BLAT (http://genome.ucsc.edu/cgi-bin/hgBlat?command=start).\nRun a PCR to amplify the junction of interest.\n\t\nDilute primers with water to 10 mM and combine 10 mL of each primer so that each forward primer is paired with each reverse primer into a primer mix.\n\t\tNOTE: Sequences for the primers for the selected example are shown in Table 1.\nLabel 0.2 mL strip tubes as: C1, T1, C2, T2, C3, T3, C4 and T4 where C=control human genomic DNA (commercial), T=Tumor DNA, isolated from patient or PDX tumor, and the number indicates the primer mix.\nAdd 1 mL of each primer mix into its labeled tubes.\nPrepare the Taq mastermix by combining reagents listed in Table 2, leaving the enzyme in the freezer until needed, adding it to the mix at the very end.\nMake 2 master mixes, one for each template DNA, control human DNA and tumor DNA. Add 24 mL of each Taq master mix to its respective strip tube. The total reaction volume is 25 mL. Vortex very briefly and then spin the strip tube down.\nRun a PCR in a thermocycler. Use the parameters shown in Table 3. Adjust the annealing temperature so that it is at least 1 °C colder than the melting temperature of the primers.\nStore the completed PCR product at -20 °C (long term) or refrigerated at 4 °C (short term) until needed.\nPerform electrophoresis at 1-5 V/cm to visualize PCR product using a 1.5% agarose gel. Leave 2 mL aliquot of the product to be used for Sanger sequencing.\nPerform Sanger sequencing to confirm the junction and identify the exact breakpoint38.",
    "Use the PCR product if the PCR generated a single product (band). Alternatively, cut the band out of gel, purify and submit for Sanger sequencing along with the primer used for amplification.\n\t\tNOTE: The tumors for which genomic analyses were performed then are used for implantation in mice.\n4. Tumor engraftment and maintenance\nSet up preparations to engraft tumors into PDX mouse models. Select for engraftment tumors for which genomic analyses will be or has been performed.\n\t\nMake sure that a supportive infrastructure is in place at the time of the start of the development of any PDX models, including dedicated laboratory and animal facilities, skilled technical staff and detailed standard operating procedures.\nEnsure the quick transportation and processing of specimens as speed is crucial for cell viability and successful engraftment.\nUse a sterile environment to reduce bacterial and fungal contamination for processing and engrafting specimens.\nHandle human specimens with caution, in accordance with institutional policies regarding potentially biohazardous materials, as they may harbor blood-borne pathogens.\nPrepare the tissue (0.5-0.7 cm3 in size) for engraftment by putting the surgical specimen into a pre-chilled 50 mL tube with 20 mL of tissue culture media.\n\t\tNOTE: The tumor tissue can be fresh or recovered from previously cryopreserved material5.\nConfirm the tumor content in the specimen by consulting a pathologist.\nPlace the tumor tissue in a dish containing 10-15 mL of cold PBS, or tissue culture media such as RPMI 1640 or DMEM containing antibiotics (1% penicillin and streptomycin).\nIdentify and isolate viable tumor material from adjacent normal and necrotic tissue with the help from a pathologist. Use sterile forceps and scalpel to remove necrotic material pointed out by a pathologist.",
    "NOTE: The tumor can be implanted either intraperitoneally or subcutaneously into the mice. Follow step 4.2 to perform an intraperitoneal implantation or skip to step 4.3 to perform a subcutaneous engraftment. In this study, targeted therapies selected based on genomic analyses were tested in a series of PDX models for high grade serous ovarian cancer with intraperitoneal implantation.\nPrepare the tissue for intraperitoneal (IP) implantation mincing the tissue with sterile forceps and a scalpel on ice to make pieces approximately 1-1.5 mm3 in size and mixing with cold culture medium. Inject 0.3–0.5 mL of tumor slurry using a 16-17 gauge needle.\n\tNOTE: All surgical procedures are performed by using aseptic techniques. Sterile gloves, sterile instruments, supplies, and implanted materials were used to reduce the likelihood of infection.\n\t\nMix the pieces 1:1 with ice-cold culture medium and inject 100 mL intraperitoneally in at least three female SCID mice.\nCut the tumor tissue for subcutaneous engraftment using sterile forceps, scalpel, or surgical scissors into small fragments, roughly 2 x 2 x 2 mm in size, and transfer the fragmented tissues to a pre-chilled Petri dish on ice.\n\t\nAdd the cold basement membrane matrix into the dish with the fragmented tissue (approximately 200 mL per 10 pieces of tissue), mix well, and let the tissue fragments soak in the cold basement membrane matrix for 10 min.\nAnesthetize 5 female NOD/SCID mice to prepare them for engraftment.\nInject each mouse intraperitoneally with ketamine (150 mg/kg) and xylazine (10 mg/kg) combination.\nConfirm that mouse is properly anesthetized by pinching the tail tip with atraumatic forceps.\nRemove gently fully anesthetized mouse from the chamber and put on the mouse a nose cone which has input from vaporizer and output from waste gas scavenging system.",
    "Put vet ointment on mouse eyes to prevent dryness while under anesthesia. Prepare the area where the surgery will be performed. Use aseptic technique to perform the surgery.\nEnsure that the surface on which the surgery is going to take is non-porous, sealed and is disinfected prior to surgery.\nStart surgery with sterile (by autoclave, gas or chemical sterilization) instruments.\nUse gloves to handle instruments and maintain the sterility of the instrument tips throughout the procedure by submerging them in ethanol between surgery steps.\nSterilize the surgical site by applying 3 alternating scrubs of iodine and alcohol. Use sterile surgical scissors and forceps to make a 5-10 mm vertical skin incision on both flanks of a mouse.\n\t\nInsert straight forceps gently into the subcutaneous space to create a pocket large enough for a tumor fragment to be placed under the fat pad.\nUse the sterile straight forceps to insert tumor fragments into previously prepared pocket in each of 5 mice.\n\t\tNOTE: Place 3-4 pieces of tumor tissue in one pocket.\nClose the skin incisions using tissue glue.\nIntraperitoneally inject each mouse with 100 mL of Rituximab after implantation to inhibit lymphocyte proliferation.\nPlace the mouse into a cage under a heat lamp for approximately 20 min until recovered from anesthesia. Monitor the mouse vital signs and ensure its sufficient hydration.\nReturn the mouse to the company of other mice after it recovered from anesthesia and started to have food and water. Provide postoperative care and monitoring according to institutional guidelines. Check for signs of pain and distress daily for 3 consecutive days after surgery.\n\tNOTE: Criteria for pain or distress include necrosis or ulceration, weight loss/body condition scoring, behavioral signs such as activity level, motor function and posture.",
    "Routinely check the mice for tumor formation bi-weekly until the tumors reach the size of 0.5 cm in diameter as measured by a caliper.\nAssess the health score of each mouse as derived from appearance, behavior, and body condition39. Use scores of ≤6 as criteria for moribund mice to be sacrificed by carbon dioxide inhalation.\n5. Testing responses to genomically identified targets in PDX models\nStart the selected targeted treatments when the tumors are palpable and reach 0.5 cm3 as measured by an ultrasound scan.\n\t\nPrior to performing an ultrasound scan of the abdomen remove the mouse abdominal fur and apply sterile jelly lubricant.\nUse an ultrasound machine with a transducer to obtain images with the tumor positioned in cross-section. Make 3 measurements per session for each animal and average the value for a more accurate assessment of tumor size.\nAnalyze the images using available software40.\nAdminister chemotherapy consisting of a mixture of carboplatin at 51 mg/kg and paclitaxel at 15 mg/kg intraperitoneally (IP) once a week for a total treatment duration of 4-6 weeks. Make sure that total volume for injection does not exceed 0.2 mL.\nMake a MK-220641 stock solution in 30% cyclodextrin (e.g., Captisol) and deliver via oral gavage at 120 mg/kg daily for 4 consecutive weeks.\nPrepare the mouse for oral gavage by hold it by pinching the skin of the back and pinning it back, so that the head and limbs of the mouse are immobilized.\n\t\nInsert the gavage probe down the back of the throat of the mouse until the probe reaches the esophagus. Make sure that the probe is not inserted too far, as the lungs of the mouse may perforate, causing death.",
    "Make a MK-866942 stock solution in ethanol at 25 mg/mL. Dilute it in a vehicle containing 5.2% Tween 80, 5.2% PEG400 in sterile water for IP injections at 10 mg/kg for 5 days every other week, with a total duration of the treatment of 4 weeks.\n\tNOTE: Volume injected into mice should be 50-120 mL, depending on animal’s weight.\nUse 7-8 mice per treatment group to have enough statistical power to detect differences43,44.\nAssess body weight and general condition of the mice in therapy daily. Withhold drugs if an animal’s weight drops 20% or more from their initial weight.\nAssess the tumor size weekly by using ultrasound scanning. Make sure that the individual performing the monitoring of the tumor growth is blinded to the treatment to ensure the unbiased scoring of responses.\n\tNOTE: Smaller laboratories may employ 2 different people to administer treatment and ultrasound monitoring.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}