{
  "id": 4176,
  "origin_website": "Cell",
  "title": "Optimization of mito-roGFP protocol to measure mitochondrial oxidative status in human coronary artery endothelial cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe entire protocol requires three days. We have presented the methods in three subsections below starting from day one through day three. We suggest performing a trial run to optimize or troubleshoot any issues prior to your actual experiment.\nDay one: Splitting the HCAECs\nTiming: 1.5 h\nThis initial step consists of splitting the cells and plating them into dishes that will serve for imaging in step 3.\nPlate 30,000 cells per 35 mm μ-Dish\nCoat each 35 mm μ-Dish with 1 mL of 0.1% gelatin, and incubate for 30 min to 1 h in the incubator. Gelatin will still be liquid after incubation with a thin, invisible coating formed at the bottom. Remove the excess gelatin from the plate and then proceed to the next step.\nNote: We recommend preparing at least 3–4 dishes per experimental group (please consider that live imaging can take up to an hour per dish).\nNote: If gelatin does not dry or over-dries, then the cells will not attach properly resulting in potential loss of culture.\nWash the cells with DPBS (10 mL), trypsinize (2 mL/10 cm plate, incubate for 2 min, then visualize that cells have detached), inactivate trypsin (6 mL of TNS/ 10 cm plate), centrifuge (800 × g, 5 min), resuspend in 3 mL of growth media and estimate the cell density using the hemocytometer or an automated cell counter.\nRemove excess gelatin from the μ-dishes, add 1 mL of growth media containing a volume of cell suspension equivalent to 30,000 cells.\nPause point: Incubate cells in a cell culture incubator (37°C degree, 5% CO2, 85%–95% humidity) for 16 hours.",
    "Note: We recommend continuing subculturing the HCAECs. For that, plate 1 mL of cell suspension in addition to 9 mL of growth media into a 10 cm plate.\nDay two: Mito-roGFP transduction\nTiming: 45 min\nThis step describes the transduction of cells with Mito-roGFP replication-deficient adenovirus.\nTo transduce the cells with replication-deficient adenovirus, replace the media with fresh media containing 5 μL of mito-roGFP suspension per mL; add 1 mL to each dish.\nPause point: Incubate cells in a cell culture incubator (37°C degree, 5% CO2, 85%–95% humidity) for 16 hours.\nNote: Always work in a biosafety level II cabinet while handling Mito-roGFP. Discard all tips containing Mito-roGFP in a waste container with 10% bleach solution. In addition, please follow all requirements of your institution’s biosafety committee.\nNote: The amount of Mito-roGFP may need to be optimized based on the concentration of adenovirus obtained with amplification and according to how the cells will respond. For this reason, we recommend to either test the dose of 5 plaque-forming units per cell, as suggested by Waypa et al (Waypa et al., 2010[href=https://www.wicell.org#bib23]) or perform a titration to find a dose at which the cells will express enough mito-roGFP. This can be done by visualizing the fluorescence emission of the cells. Choose the dose that results in a high number of fluorescent ECs (for further information, please refer to problem 1 under the heading “Troubleshooting[href=https://www.wicell.org#troubleshooting]”).\nDay three: live-cell imaging of HCAEC transduced with Mito-roGFP\nTiming: 8–10 h\nThis major step consists of live imaging of the HCAEC and production of data for analysis. Please review the key resources table[href=https://www.wicell.org#key-resources-table] for information about the inverted microscope, objective lens, camera and NIS Elements software used in this step.",
    "Change the media prior to starting the imaging procedure with fresh media. This step is required to remove any adenovirus that has not entered a cell and avoid any accidental exposure of the investigator to mito-roGFP, which is a biohazard level 2 adenovirus, during imaging procedure, and also to provide a more adequate cellular environment for imaging. Discard all tips and media containing Mito-roGFP in a waste container with 10% bleach solution.\nOptional: You may add pre-treatments to the cells. Please see the third table under materials and equipment[href=https://www.wicell.org#materials-and-equipment] for reference treatments based on published literature.\nNote: Unlike HCAEC, mouse ECs may need a total of 48–72 hours under culture to achieve a good fluorescence level of Mito-roGFP prior to starting the assay. In this case, change the media again on the next day (for further information, please refer to problem 1 under the heading “Troubleshooting[href=https://www.wicell.org#troubleshooting]”).\nPrepare solutions for the assay\nPrepare 100 mM DTT stock solution as described in materials and equipment[href=https://www.wicell.org#materials-and-equipment] section; 400 μL per sample is needed.\nAliquot 3% H2O2; 47.5 μL per sample is needed.\nLabel 3 tubes per sample:\n1 (pipet 515 μL of HBSS)\n2 (pipet 100 μL of HBSS)\n3 (pipet 52.5 μL of HBSS)\nKeep HBSS tubes in 37°C water bath until ready to use. Keep DTT and H2O2 aliquots in the microscope room.\nTurn ON microscope and all its accessories (fluorescence light, camera) at least 20 min before imaging. The following experiment setup is described based on our experience with NIS Elements Imaging software, but it can be adapted to other programs that accept the same settings (provided below).\nSetup experimental conditions in NIS Elements",
    "Open the imaging program. Click on the live multichannel button, as indicated by yellow arrow in Figure 1[href=https://www.wicell.org#fig1]A, or follow steps shown in Figure 1[href=https://www.wicell.org#fig1]B. Next, follow the steps shown in Figure 1[href=https://www.wicell.org#fig1]C. A new window named “ND Acquisition” will open. Select 40× at the nosepiece window (Figure 2[href=https://www.wicell.org#fig2]A, step 1). At the ND Acquisition panel, click “Load” and select “Load from XML file…”, as shown in Figure 2[href=https://www.wicell.org#fig2]A, steps 2 and 3. Select the file named as “Mito-roGFP TEMPLATE.xml” (available for download in the Mendeley dataset). After loading the template, check all settings as described below to confirm that the data was successfully loaded.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/938-Fig1.jpg\nFigure 1. Defining channels, exposure, and time schedule for imaging\nScreenshots of step 7a in NIS elements (A) (B) (C). Note that panel (A) is a shortcut method to capture a multichannel image displayed in panel (B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/938-Fig2.jpg\nFigure 2. Defining ratio properties for acquisition\nScreenshots of step 7a to load mito-roGFP template file (A) or to manually input settings as described in steps 7a-c (B), 7d (C), and 7e (D) in NIS elements\nNote: If you do not wish to use the provided template or there is an issue to load it, simply follow all consecutive steps described below and save your own template at the end of the experiment, as described in step 10.",
    "Start by selecting the mito-roGFP (405 nm) channel (Figure 2[href=https://www.wicell.org#fig2]A, step 4). Then, input all data exactly as shown in the yellow square of Figure 2[href=https://www.wicell.org#fig2]A, step 5. Next, select FITC (488 nm) channel (Figure 2[href=https://www.wicell.org#fig2]B, step 1). Input settings exactly as indicated in yellow square (Figure 2[href=https://www.wicell.org#fig2]A, step 2). If setting the experiment for HCAEC, change the exposure value to 1 s, and to 200 milliseconds for Mito-roGFP and FITC channels, respectively. Note that exposure and gain may need to be later optimized for both 488 and 405 channels, according to your experimental conditions.\nConfirm intervals and time for measurement (15 s interval, first loop 35 min, second loop 35 min). Check boxes and edit all fields exactly as indicated in the yellow box in Figure 2[href=https://www.wicell.org#fig2]B, step 3.\nNext, click on the “Define ratio…” button (Figure 2[href=https://www.wicell.org#fig2]B, step 4). A new, small window will open (Figure 2[href=https://www.wicell.org#fig2]C). Change the numerator to 405 nm and the denominator to 488 nm as indicated in square 1 of Figure 2[href=https://www.wicell.org#fig2]C. Next, check the box “keep color scale in view”, as shown in square 2 of Figure 2[href=https://www.wicell.org#fig2]C. Then, apply changes and close the ratio properties window (Figure 2[href=https://www.wicell.org#fig2]C, 3-4).\nAt the ND Acquisition window, click on the subfield named as “Lambda” (Figure 2[href=https://www.wicell.org#fig2]D, 1). Confirm that only FITC and Mito-roGFP channels are selected, as indicated in Figure 2[href=https://www.wicell.org#fig2]D, 2. Check the “close active shutter during filter change” box, as indicated in Figure 2[href=https://www.wicell.org#fig2]D, 3. At the OC Panel window, check that the right filters are selected in the filter block for both 488 and 405 nm channels (Figures 3[href=https://www.wicell.org#fig3]A and 3B). At the main window, click on “measure” and then on “Time measurement” (Figure 3[href=https://www.wicell.org#fig3]C, 1-2). A new window will open; keep aside until noted otherwise.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/938-Fig3.jpg",
    "Figure 3. Setting up time measurement\nScreenshots of steps 7e (A) (B) (C) and 7g (D) in NIS elements.\nBring a control sample to the microscope, replace the media by 500 μL HBSS from tube 1, and put 2-3 cells in focus. Check FITC and mito-roGFP channels and adjust exposure and gain, if necessary. We suggest a gain of 1.0–3.5, and exposure range of 100–300 ms for 488nm filter (FITC) and of 500–900 ms for 405 filter (mito-roGFP). Note that the visualized fluorescence intensity should be similar in both channels to result in a baseline fluorescence ratio close to 1.\nAt the main window, click on “measure” and then on “Simple ROI (Region Of Interest) Editor” (Figure 3[href=https://www.wicell.org#fig3]D, 1-2). A small toolbox will popup (as shown by the yellow box in Figure 4[href=https://www.wicell.org#fig4]A). Select the “Bezier” tool to draw each ROI (Figure 4[href=https://www.wicell.org#fig4]A, 1). To draw your background ROI, select a region with no cells (Figure 4[href=https://www.wicell.org#fig4]A, 2). After drawing, use the right click button function of your mousepad on top of the ROI and select “use as background ROI”, as shown in Figure 4[href=https://www.wicell.org#fig4]B. Next, use the Bezier tool to draw each test ROI (Figure 4[href=https://www.wicell.org#fig4]A, 3-5). We recommend drawing around 20 test ROIs, always in the regions near the nuclei, given that EC extremities move considerably in response to DTT and H2O2, which may result in unusable ROIs. When done, click the “finish” button in the toolbox (Figure 4[href=https://www.wicell.org#fig4]A, 6).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/938-Fig4.jpg\nFigure 4. Defining the regions of interest (ROIs)\nScreenshots of steps 7g (A) (B), 7h and 7i (C) (D) in NIS elements. Scale bar represents 50 μm.",
    "At the time measurement window, click the button “ROIs” (Figure 4[href=https://www.wicell.org#fig4]C, 1). The selected ROIs will appear at the left side, as shown by the yellow square in Figure 4[href=https://www.wicell.org#fig4]C. All ROIs selected should be highlighted in blue (Figure 4[href=https://www.wicell.org#fig4]C, yellow square). At this point, the ND Acquisition window should show the number of ROIs selected for measurement (Figure 4[href=https://www.wicell.org#fig4]D, yellow square). This number should equal the total number of ROIs selected, including background ROI.\nOrganize all open windows so they are clearly seen without overlapping. At the time measurement window, select: “Graph display” as “No split” and “<min – max>”, as indicated by arrows 2 and 3 in Figure 4[href=https://www.wicell.org#fig4]C. At the ND Acquisition window, click on the “Run now” button (Figure 4[href=https://www.wicell.org#fig4]D, arrow 1). A new window will pop up (Figure 5[href=https://www.wicell.org#fig5]A) and ratiometric measurements will start at the time measurement window. At the time measurement window, select: “Left” as “ratio 405/488” (Figure 5[href=https://www.wicell.org#fig5] B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/938-Fig5.jpg\nFigure 5. Evaluating the ratio and color of ROIs\nScreenshots of steps 7a (A) (B) and 7b (B) (C) (D) in NIS elements. Scale bar represents 50 μm.\nCheck if the ratio of all ROIs is, on average, close to 1 (in addition, cells at the main window should present with a green color close to that shown in the reference color bar (around the value 1) of 405/488 ratio channel, as seen in Figure 5[href=https://www.wicell.org#fig5]C). If yes, write down the exposure and gain used for FITC and Mito-roGFP and proceed to the next step. If not, abort recording, adjust exposure and gain of FITC and Mito-roGFP channels, and repeat step 6, i-j. You may wish to save the experimental setup as a template, for that, please follow steps as shown in Figure 5[href=https://www.wicell.org#fig5]D.",
    "Pause point: record cells for a minimum of three minutes before proceeding to step 7.\nOptional: You may add treatments to the cells prior to step 7. Please see the third table under materials and equipment[href=https://www.wicell.org#materials-and-equipment] for treatment suggestions based on available literature.\nPrepare to pipette DTT solution.\nAdd 400 μL of DTT stock solution to the tube named as “2”. After 3 min of baseline recording, use the filter change interval (15 s) to transfer all volume (500 μL) from the tube to the sample. This has to be done by slowly spreading the DTT into the plate but without touching the plate. Note that even the slightest move of the plate may displace your ROIs. The ratiometric values in the time measurement window should immediately go down and cells will appear in purple color at the main window. If cells do not show a purple or darker blue color or move away, the DTT concentration will need to be optimized.\nPause point: Watch the cells for the next 15 minutes, annotating any ROIs that have been displaced due to cell movement. These ROIs will acquire unreliable results and should be excluded from analysis (please refer to item 1 under the heading “limitations[href=https://www.wicell.org#limitations]” for further information). Simultaneously, prepare for the next step.\nPrepare to pipette H2O2 solution.\nAdd 47.5 μL of 3% H2O2 to the tube named as “3”. Fifteen minutes after adding DTT, transfer all volume (100 μL) from the tube to the sample, without touching the plate.",
    "Pause point: Usually, the ratiometric values as well as the cell color will slowly change over the course of the next 10 minutes. Continue recording until the cells consistently present with red color. This time may vary for test samples based on the different pre-treatments applied as part of your experiments (please refer to item 2 under the heading “limitations[href=https://www.wicell.org#limitations]” for further information).\nAfter seeing predominance of the red color throughout the entire cell (please refer to Figure 7[href=https://www.wicell.org#fig7] for example of acceptable visualization of maximum oxidation) for at least 5 frames, you may stop recording.\nSave and export all data in an ND2 format for later review, properly identifying your sample. In addition, export an experimental report to excel, as shown in Figure 6[href=https://www.wicell.org#fig6], arrows 1-3. Save the spreadsheet, properly identifying your sample.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/938-Fig6.jpg\nFigure 6. Exporting the experimental report\nScreenshot for step 10 in NIS elements.\nSubsequently, close the main window used for acquisition and proceed to the next sample; focus the cells under the microscope and start again from step 6, sub step g of this protocol. Alternatively, we have provided a simple procedure, easy to follow protocol, available in the provided Mendeley dataset. If there are no additional samples, proceed to quantification and statistical analysis."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Metabolism",
    "Microscopy",
    "Cell-Based Assays",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}