{
  "id": 2999,
  "origin_website": "Cell",
  "title": "Three-dimensional co-culture platform of human induced pluripotent stem cell-derived oligodendrocyte lineage cells and neurons for studying myelination",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBelow, we provide protocols that enable a controlled co-culture setup of hiPSC-derived cortical neurons and oligodendrocyte lineage cells on 3D nanofibers. We describe the adaptation of the existing protocols that are used for the generation of cortical neurons2[href=https://www.wicell.org#bib2] and oligodendrocyte lineage cells3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4] from hiPSCs for culturing on 3D nanofiber networks. In addition, we introduce protocols for the detachment and isolation of oligodendrocyte lineage cells from 3D nanofibers. Following this, the isolated oligodendrocyte lineage cells can be co-cultured with hiPSC-derived cortical neurons and/or further processed for downstream analysis (e.g., RNA-sequencing).\nDifferentiation of hiPSCs into cortical neurons on 3D nanofibers\nTiming: 55+ days\nTiming: 3 days (for step 1)\nTiming: 1 h (for steps 1a to 1l)\nTiming: 12 days (for step 2)\nTiming: 30 min (for step 2a to 2e)\nTiming: 26 days (for step 3)\nTiming: 1 h (for steps 3a i to xii)\nTiming: 1.5 – 2 h (for steps 3b i to xv)\nTiming: 1 h (for steps 3c i to xii)\nTiming: 2–3 h (for step 4)\nTiming: 17 + days (for step 5)\nThe differentiation of hiPSCs into a mixed culture of cortical neurons is based on the protocol of Shi et al.2[href=https://www.wicell.org#bib2] with modifications regarding the coating of the wells, media composition and the adaptation of the final maturation phase on 3D nanofibers. In general, after a culturing period of 55 days, a mixed culture of mature cortical neurons is present. The culturing period can be extended on 3D nanofibers (tested until day 108) (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2540-Fig2.jpg\nFigure 2. Schematic overview of the differentiation of hiPSCs into a mixed culture of cortical neurons",
    "The generation of cortical neurons from hiPSCs is driven by different combinations of small molecules. The initial generation of neural progenitor cells is performed in a 2D culture system (DIV0 – DIV38), whereas the final differentiation into cortical neurons is performed in a 3D culture system on nanofibers (DIV38 – DIV55+). Red triangles indicate passaging and selection timepoints. A culturing period of 55 days results in a generation of mixed cortical neurons. This can be extended until day 108 on 3D nanofibers as tested in this protocol DIV: Days in vitro, hiPSCs: human induced pluripotent stem cells, NPCs: Neural progenitor cells, NIM-1: Neural induction medium 1 (DIV0 – DIV12), NMM: Neural maintenance medium (DIV13 – DIV25), FMM: Final maturation medium (DIV26 – DIV108).\nPlating hiPSCs for neuronal differentiation (DIV -3).\nNote: When hiPSCs reach about 70%–80% of confluency, they can be plated for differentiation.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nCoat 12-well tissue culture plate with Matrigel in DMEM/F12.\nPrepare hiPSC medium containing 10 μM ROCK inhibitor (Y-27632).\nWarm up hiPSC medium and DMEM/F12 to 37°C, and Accutase to RT (20°C–25°C).\nAspirate the spent hiPSC medium and wash cells once with 1× DPBS without calcium and magnesium (1 mL/well).\nAdd Accutase (0.5 mL/well) and incubate for 5 min in the incubator at 37°C and 5% CO2.\nAdd DMEM/F12 onto the Accutase-containing wells (1 mL/well).\nDetach the cells mechanically with a P1000 and transfer them into a 15 mL conical tube.\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cells with hiPSC medium (5 mL).\nPlate 800,000 cells per well on a Matrigel-coated 12-well tissue culture plate.\nIncubate cells in an incubator at 37°C and 5% CO2.",
    "The next medium change needs to be performed after 24 h with hiPSC medium.\nNeural induction (DIV0 – DIV12).\nNote: Neural induction is performed by dual SMAD inhibition resulting in the differentiation of hiPSCs into early neuroectoderm.5[href=https://www.wicell.org#bib5]\nNote: Three days after the plating of hiPSCs for differentiation, neural induction will start by changing the medium from hiPSC medium to neural induction medium 1 (NIM-1).\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nPrepare and warm up culture medium (NIM-1) for neural induction.\nAspirate the spent hiPSC medium.\nAdd fresh neural induction medium 1 (NIM-1) (1.5 mL/well).\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 24 h with NIM-1.\nNote: The daily replacement of the medium with fresh neural induction medium 1 (NIM-1) needs to be performed for the following 12 days.\nCritical: The replacement of the medium needs to be performed very gently due to the cells growing compact and dense, and tendency to detach.\nDifferentiation of neural stem cells (NSCs) into neural progenitor cells (NPCs) (DIV12 – DIV38).\nNote: This phase (DIV12 – DIV38 of the neuronal differentiation protocol) will generate NPCs and early neurons from NSCs.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nNote: Cells of the same cell line collected from different wells can be combined during the passaging on DIV12, DIV18, DIV25, DIV32 to reach to the desired cell number.\nOn DIV12 of the neuronal differentiation protocol, cells need to be passaged for the first time.\nCoat 12-well tissue culture plate with Matrigel in DMEM/F12.\nPrepare culture medium (NIM-1) containing 10 μM ROCK inhibitor (Y-27632).\nWarm up culture medium and DMEM/F12 to 37°C, and Accutase to RT (20°C–25°C).",
    "Aspirate the spent culture medium and wash cells once with 1× DPBS without calcium and magnesium (1 mL/well).\nAdd Accutase (0.5 mL/well) and incubate for 5 min in the incubator at 37°C and 5% CO2.\nAdd DMEM/F12 onto the Accutase-containing wells (1 mL/well).\nDetach the cells mechanically with a P1000 and transfer them into a 15 mL conical tube.\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cells with culture medium (e.g., 5 mL).\nPlate 1.1 million cells per well on a Matrigel-coated 12-well tissue culture plate.\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 24 h with neural maintenance medium (NMM).\nCritical: On DIV13 of the protocol, the medium needs to be changed from neural induction medium 1 (NIM-1) to neural maintenance medium (NMM).\nOn DIV18, DIV25 and DIV32 of the differentiation protocol, cells need to be passaged.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2540-Fig3.jpg\nFigure 3. Selective detachment of hiPSC-derived neural progenitor cells (NPCs)",
    "(A–D) Representative images of cells before, during and after the selection process performed on DIV25 of the neuronal differentiation protocol. For each representative image (A1, B1, C1, D1) there is a corresponding magnified region which are indicated by the black dashed rectangles (A2, B2, C2, D2). (A1, A2) Cells before the selective detachment (B1, B2) Cells after 1 h of incubation with the enzyme-free selective detachment reagent showing white margins around the NPCs and indicating that the cells are ready to be selectively detached (C1, C2) Directly after the selective detachment of NPCs, cells remained on the plate can be observed, in this example astroglial cells (D1, D2) Replated NPCs imaged on DIV26 (1 day after the selective detachment) showing a mixed population of NPCs and early neurons. Image acquisition with EVOS™ XL Core inverted microscope. Scale bar: 100 μm.\nNote: During this phase of the neuronal differentiation protocol, neural intermediate progenitor cells are generated. In addition to neuronal lineage, these cells also have the potential to differentiate into cells of the astroglial lineage. To obtain a highly pure population of NPCs, an enzyme-free reagent can be used for selective detachment of hiPSC-derived NPCs (Figure 3[href=https://www.wicell.org#fig3]).\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nCoat 12-well tissue culture plate with Matrigel in DMEM/F12.\nPrepare culture medium (DIV18 and DIV25: NMM; DIV32: FMM) containing 10 μM ROCK inhibitor (Y-27632).\nPrepare DMEM/F12 containing 10 μM ROCK inhibitor (Y-27632) (15 mL/sample).\nWarm up culture medium and DMEM/F12 to 37°C.\nAspirate the spent culture medium and wash the cells once with DMEM/F12 (1 mL/well).\nAdd STEMdiff™ Neural Rosette Selection Reagent (0.5 mL/well) and incubate for 1 h in the incubator at 37°C and 5% CO2.",
    "Critical: Monitor the cells under the optical microscope after 1 h of incubation. If the cells show white margins, they are ready to be selectively detached. If they do not show white margins after 1 h, place the culture plate back in the incubator at 37°C and 5% CO2 and wait longer, without exceeding a total incubation time of 1.5 h.\nAspirate the Neural Rosette Selection Reagent.\nAdd DMEM/F12 containing 10 μM ROCK inhibitor (Y-27632) (1 mL/well) and detach the cells mechanically with a P1000.\nNote: The STEMdiff™ Neural Rosette Selection Reagent might result in partial detachment of the cells since the selective detachment is specific to NPCs.\nRepeat step (3.b.viii.) two more times and collect the detached cells in a 15 mL conical tube.\nNote: Cells of the same hiPSC line from different wells can be combined to reach to the desired cell number.\nFill up the 15 mL conical tube to its maximum of 15 mL.\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cells with culture medium (e.g., 5 mL).\nNote: On DIV18, DIV25 and DIV32, an estimate of about 1–3 million cells can be obtained from one well of a 12-well tissue culture plate using the selective detachment method. These cell numbers are an average value and can depend on the cell line and its differentiation potential.\nPlate 200,000 cells per well on Matrigel-coated 12-well tissue culture plate.\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 24 h (NMM) or 48 h (FMM).\nOptional: If no selective detachment of NPCs is required, Accutase can be used to passage the cells.\nCoat 12-well tissue culture plate with Matrigel in DMEM/F12.",
    "Prepare culture medium (for DIV18 and DIV25: NMM; for DIV32: FMM) containing 10 μM ROCK inhibitor (Y-27632).\nWarm up culture medium and DMEM/F12 to 37°C, and Accutase to RT (20°C–25°C).\nAspirate the spent culture medium and wash cells once with 1× DPBS without calcium and magnesium (1 mL/well).\nAdd Accutase (0.5 mL/well) and incubate for 5 min in the incubator at 37°C and 5% CO2.\nAdd DMEM/F12 onto the Accutase-containing wells (1 mL/well).\nDetach the cells mechanically with a P1000 and transfer them into a 15 mL conical tube.\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cells with culture medium (e.g., 5 mL).\nPlate 200,000 cells per well on Matrigel-coated 12-well tissue culture plate.\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 24 h (NMM) or 48 h (FMM).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2540-Fig4.jpg\nFigure 4. Characterization of neural progenitor cells (NPCs) and neurons throughout the differentiation\nRepresentative immunofluorescence images (maximum intensity projections) of hiPSC-derived NPCs and neurons.\n(A) NESTIN+ NPCs at DIV22.\n(B) VIMENTIN+ NPCs at DIV22.\n(C) MAP2+ and TUJ1+ neurons at DIV45 on 3D nanofibers.\n(D) CTIP2+ (deep layer) and BRN2+ (upper layer) cortical neurons at DIV67 on 3D nanofibers.\n(E) GABA+/TAU12+ neurons at DIV102 on 3D nanofibers.",
    "(F) TH+/TAU12+ neurons at DIV102 on 3D nanofibers. Nuclei were stained with Hoechst 33342. (A), (B) and (C): Image acquisition with Nikon Eclipse Ti2 microscope. (D), (E) and (F): Image acquisition with Nikon A1R confocal microscope. MAP2: Microtubule-associated protein 2, TUBB3: Neuron-specific class III beta-tubulin, CTIP2: marker of deeper layer (V-VI) cortical neurons, BRN2: Brain-Specific Homeobox/POU Domain Protein 2 (marker of upper layer (II-III) cortical neurons), GABA: Gamma-Aminobutyric Acid (marker of GABAergic neurons), TAU12: Microtubule-associated protein Tau, TH: Tyrosine Hydroxylase (marker of dopaminergic neurons). Scale bar: 100 μm.\nOptional: To examine if the cells are in the neural progenitor stage, a test for the expression of neural progenitor markers (e.g., NESTIN and VIMENTIN) with immunofluorescence staining can be performed (Figures 4[href=https://www.wicell.org#fig4]A and 4B). NPCs on DIV18 can be plated to glass bottom plates during the passaging and cultured for 3–4 more days (DIV21 – DIV22). Afterwards, cells can be fixed with cold 4% Paraformaldehyde (PFA) for 15 min at RT (20°C–25°C) to perform immunocytochemistry.\nCritical: On DIV26 of the protocol, the medium needs to be changed from neural maintenance medium (NMM) to final maturation medium (FMM). From this day on, the medium needs to be changed every other day.\nPause point: NPCs can be frozen between DIV18 and DIV30 and stored in liquid nitrogen. It is recommended to freeze the cells during one of the passaging timepoints within this period (DIV18 and DIV25). During the passaging procedure of NPCs (selective detachment or Accutase treatment), after the centrifugation step, cells can be resuspended with cold NPC freezing medium (∼ 800 μL per cryovial). Afterwards, cryovials can be placed in freezing containers and stored in a – 80°C freezer for ideal cryopreservation (−1°C/minute). After 24 h, cryovials can be transferred to liquid nitrogen for long-time storage.",
    "Final plating of hiPSC-derived neural progenitor cells (NPCs) on 3D nanofibers (DIV38).\nNote: The final plating of NPCs on 3D nanofibers should be performed on DIV38 of the neuronal differentiation protocol.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nCritical: In this step, it is important that the 3D nanofibers are properly pretreated and coated with Matrigel in DMEM/F12.\nNote: To obtain a highly pure population of NPCs, an enzyme-free reagent can be used for selective detachment of hiPSC-derived NPCs. The selective detachment, or alternatively the detachment of cells with Accutase, can be performed in the same way that was described above (for DIV18, DIV25 and DIV32 of the differentiation protocol). The difference here is the plating of cells on the 3D nanofibers. It is recommended to plate about 200.000 cells per well of a 24-well 3D nanomatrix plate.\nNote: Using the selective detachment of NPCs on DIV38 of the protocol, an estimate of about 1–2 million cells can be obtained from one well of a 12-well tissue culture plate. And using the Accutase detachment of NPCs on DIV38 of the protocol, an estimate of 2–4 million cells can be obtained from one well of a 12-well tissue culture plate. These cell numbers are an average value and can depend on the cell line and its differentiation potential.\nCritical: Further passaging of NPCs and/or final plating of cells later than DIV38 could result in a low survival rate.\nMaintenance and final maturation of NPCs into cortical neurons on 3D nanofibers (DIV38 – DIV55+).\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nNote: Perform a partial medium change (∼ 1.5 ml/well) every other day with FMM.",
    "Critical: From DIV60 onwards, perform the medium change gently with a P1000 to ensure that the cells do not detach.\nOptional: Throughout the final maturation phase of the neuronal differentiation, cells can be fixed at favored timepoints and examined for the expression of specific neuronal markers (Figures 4[href=https://www.wicell.org#fig4]C–4F). Therefore, single inserts of the 24-well 3D nanomatrix plate can be taken out by using forceps and spatula and transferred into a 12-well tissue culture plate. After that, cells can be fixed with cold 4% PFA for 20 min at RT (20°C–25°C). For the immunocytochemistry protocol follow the instructions described in the section ‘Analysis of co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells on 3D nanofibers’.\nDifferentiation of hiPSCs into oligodendrocyte lineage cells on 3D nanofibers\nTiming: 75+ days (for all steps in this section)\nTiming: 3 days (for step 6)\nTiming: 1 h (for step 6a to 6l)\nTiming: 12 days (for step 7)\nTiming: 30 min (for step 7a to 7e)\nTiming: 18 days (for step 8)\nTiming: 3–6 h (for step 9)\nTiming: 2 days (for all steps under Detachment and isolation of hiPSC-derived oligodendrocyte lineage cells from 3D nanofibers)\nTiming: 1–2 h (for step 11)\nTiming: 5–6 h (for step 12)\nTiming: 22 days (for all steps under Co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells)\nTiming: 15–30 min (for step 13)\nTiming: 1 h (for step 14)\nTiming: up to 21 days (for step 15)",
    "The differentiation of hiPSCs into oligodendrocyte lineage cells is based on the protocol of Douvaras and Fossati3[href=https://www.wicell.org#bib3] with modifications regarding the coating of the wells, small molecules and the adaptation of the final maturation phase of the cells on 3D nanofibers. In addition, temporal and partial GLI1 inhibition was included in the differentiation protocol following the protocol of Namchaiw et al.4[href=https://www.wicell.org#bib4] In general, after a culturing period of 75 days, a mixed culture of neurons, astrocytes and oligodendrocyte lineage cells are present. The culturing period can be extended on 3D nanofibers (tested until day 96) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2540-Fig5.jpg\nFigure 5. Schematic overview of the differentiation of hiPSCs into oligodendrocyte lineage cells\nThe generation of oligodendrocyte lineage cells from hiPSCs is driven by different combinations of small molecules. The neural induction phase (DIV0 – DIV12) is performed in an adherent 2D culture. During this time, cells should differentiate into PAX6+ cells (DIV8) and OLIG2+ cells after SAG addition to the medium (DIV12). OLIG2-enriched spheres are generated in a suspension phase (DIV12 – DIV30). After plating the spheres on DIV30, the final maturation phase and generation of oligodendrocyte lineage cells is performed on 3D nanofibers (DIV30 – DIV75+) resulting in O4+ cells (DIV55) and MBP+ cells (DIV75). The culturing period of cells can be extended until day 96 on 3D nanofibers as tested with this protocol. DIV: Days in vitro, PAX6: Paired box 6, OLIG2: Oligodendrocyte transcription factor 2, MBP: Myelin basic protein, NIM-2: Neural induction medium 2 (DIV0 – DIV7), N2: N2 medium (DIV8 – DIV11), N2B27: N2B27 medium (DIV12 – DIV19), PDGF: PDGF medium (DIV20 – DIV29), Glial medium (DIV30 – DIV96).\nPlating hiPSCs for oligodendrocyte lineage cell differentiation (DIV -3).\nNote: When hiPSCs reach about 70%–80% of confluency, they can be plated for differentiation.",
    "Note: All steps should be performed under sterile conditions in a laminar flow cabinet.\nCoat 6-well tissue culture plate with Matrigel in DMEM/F12.\nPrepare hiPSC medium containing 10 μM ROCK inhibitor (Y-27632).\nWarm up hiPSC medium and DMEM/F12 to 37°C, and Accutase to RT (20°C–25°C).\nAspirate the spent hiPSC medium and wash cells once with 1× DPBS without calcium and magnesium (1 mL/well).\nAdd Accutase (0.5 mL/well) and incubate for 5 min in the incubator at 37°C and 5% CO2.\nAdd DMEM/F12 onto the Accutase-containing wells (1 mL/well).\nDetach the cells mechanically with a P1000 and transfer them into a 15 mL conical tube.\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cells with hiPSC medium (e.g., 5 mL).\nPlate 200,000 cells per well on a Matrigel-coated 6-well tissue culture plate.\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 24 h with hiPSC medium.\nGeneration of OLIG2+ progenitor cells (DIV0 – DIV12).",
    "Note: Modifications at the neural induction phase. Neural induction is performed by dual SMAD inhibition resulting in the differentiation of hiPSCs into early neuroectoderm.5[href=https://www.wicell.org#bib5] Following the protocol of Douvaras and Fossati,3[href=https://www.wicell.org#bib3] the factors retinoic acid (RA) and smoothened agonist (SAG) are needed in the early induction phase to generate the highest yield of OLIG2+ progenitor cells. Different from the Douvaras and Fossati3[href=https://www.wicell.org#bib3] protocol, instead of 1 μM, 500 nM SAG was used due to the observed cell death (data not shown). In addition, a small molecule inhibitor, GANT61, was added for the first 5 days of the differentiation protocol. Following the protocol of Namchaiw et al.,4[href=https://www.wicell.org#bib4] the temporal and partial GLI1 inhibition by GANT61 in early stages of neural stem cell formation followed by the activation of the sonic hedgehog (SHH) pathway results in more migratory oligodendrocyte precursor cells and an earlier maturation of oligodendrocytes in vitro. For the neural induction phase, a combination of these two protocols was used.\nNote: Three days after the plating of hiPSCs for differentiation, the generation of OLIG2+ progenitor cells will start by changing the medium from hiPSC medium to neural induction medium 2 (NIM-2).\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nPrepare and warm up culture medium (NIM-2) for neural induction.\nAspirate the spent hiPSC medium.\nAdd fresh neural induction medium (NIM-2) (1.5 mL/well).\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 24 h with NIM-2.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2540-Fig6.jpg\nFigure 6. Representative immunofluorescence (maximum intensity projections) and brightfield images of hiPSC-derived cells throughout the oligodendrocyte lineage cell differentiation\n(A) PAX6+ progenitor cells at DIV8.\n(B) OLIG2+ progenitor cells at DIV12.\n(C) OLIG2-enriched spheres at DIV26.\n(D) MAP2+ neurons within the sphere.\n(E) GFAP+ astrocytes within the sphere.",
    "(F) GFAP+ astrocytes start migrating out of the sphere.\n(G) O4+ oligodendrocyte lineage cells within the sphere.\n(H and I) O4+ and MBP+ oligodendrocyte lineage cells start migrating out of the sphere at DIV55.\n(J) MAP2+ neurons and GFAP+ astrocytes are spread around the sphere at DIV75.\n(K) O4+ oligodendrocyte lineage cells are distributed around the sphere at DIV75.\n(L) MBP+ and OLIG2+ oligodendrocytes are generated at DIV75. Nuclei were stained with Hoechst 33342. (A), (B), (D), (E), (H), (I) and (J): Image acquisition with Nikon Eclipse Ti2 microscope. Scale bar: 100 μm. (C): Image acquisition with EVOS™ XL Core inverted microscope. (F) and (G): Image acquisition with Zeiss Axio Observer D1 microscope. Scale bar: 50 μm. (K) and (L): Image acquisition with Nikon A1R confocal microscope. Scale bar: 100 μm. PAX6: Paired Box 6, OLIG2: Oligodendrocyte transcription factor 2, MAP2: Microtubule-associated protein 2, GFAP: Glial fibrillary acidic protein, MBP: Myelin basic protein.\nNote: The daily replacement of the medium with fresh neural induction medium 2 (NIM-2) needs to be performed until DIV8.\nCritical: GANT61 should be added only for the first 5 days of the neural induction phase.\nCritical: On DIV8 of the oligodendrocyte lineage cell differentiation protocol, the medium should be changed from neural induction medium 2 (NIM-2) to N2 medium. The daily replacement of the medium with fresh N2 medium should be performed until DIV12.\nOptional: To examine if the cells are in a progenitor stage, fix the cells with cold 4% PFA for 15 min at RT (20°C–25°C) and test for the expression of progenitor markers (e.g., PAX6 and OLIG2) with immunofluorescence staining (Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nGeneration of OLIG2-enriched spheres (DIV12 – DIV30).\nNote: On DIV12 of the protocol, cells should be passaged to the suspension phase, resulting in the generation of OLIG2-enriched spheres.",
    "Critical: On DIV12 of the protocol, the medium should be changed from N2 medium to N2B27 medium. From this day on, the medium should be replaced with N2B27 medium every other day until DIV20.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nPrepare culture medium (N2B27) containing 10 μM ROCK inhibitor (Y-27632).\nWarm up culture medium and DMEM/F12 to 37°C, and Accutase to RT (20°C–25°C).\nAspirate the spent culture medium and wash cells once with 1× DPBS without calcium and magnesium (1 mL/well).\nAdd Accutase (0.5 mL/well) and incubate for 5 min in the incubator at 37°C and 5% CO2.\nAdd DMEM/F12 onto the Accutase-containing wells (1 mL/well).\nDetach the cells mechanically with a P1000 and transfer them into a 15 mL conical tube.\nCentrifuge: 200 × g, 4 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cells with culture medium (1 mL).\nPlate cells (0.5 mL/well) on 6-well ultra-low attachment plates and fill up the well with N2B27 medium to a total of 3 mL/well.\nNote: One well of the 6-well plate (adherent phase) should be split in two wells of the 6-well ultra-low attachment plates.\nIncubate cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 48 h with N2B27 medium.\nEvery other day (DIV14 to DIV18), replace with fresh N2B27 medium:\nTransfer the OLIG2-enriched spheres and the medium into a 15 mL conical tube.\nCentrifuge: 100 × g, 2 min, RT (20°C–25°C).\nAspirate 2/3 of the medium and add fresh N2B27 medium (2 mL/well).\nPut OLIG2-enriched spheres back to the same 6-well ultra-low attachment plate using a pipette and distribute them equally.\nIncubate cells in an incubator at 37°C and 5% CO2.",
    "Critical: On DIV20 of the protocol, the medium needs to be changed from N2B27 medium to PDGF medium. The medium needs to be replaced with PDGF medium every other day until DIV30.\nEvery other day (DIV20 to DIV28), replace the medium with fresh PDGF medium:\nTransfer the OLIG2-enriched spheres and the medium into a 15 mL conical tube.\nWait for the OLIG2-enriched spheres to sink down to the bottom of the conical tube (∼ 3 min).\nAspirate 2/3 of the medium and add fresh PDGF medium (2 mL/well).\nPut OLIG2-enriched spheres back to the same 6-well ultra-low attachment plate using a pipette and distribute them equally.\nIncubate cells in an incubator at 37°C and 5% CO2.\nFinal plating of hiPSC-derived OLIG2-enriched spheres on 3D nanofibers (DIV30).\nNote: From DIV30 onwards, the protocol is adapted for the final maturation phase of the cells on 3D nanofibers.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet. The selection process requires an optical microscope under sterile conditions.\nCritical: In this step, it is important that the 3D nanofibers are properly pretreated and coated with Matrigel in DMEM/F12 before plating the OLIG2-enriched spheres.\nCritical: On DIV30 of the protocol, the medium should be changed from PDGF medium to Glial medium. The medium should be replaced with Glial medium every other day until the end of the differentiation or the start of the co-culture.\nNote: The selection of OLIG2-enriched spheres follows the instructions that are described in the protocol by Douvaras and Fossati.3[href=https://www.wicell.org#bib3] The difference is the plating of OLIG2-enriched spheres on the 3D nanofibers. It is recommended to plate about 4–6 OLIG2-enriched spheres per well of a 24-well 3D nanomatrix plate.",
    "Critical: Select OLIG2-enriched spheres with an optical microscope under sterile conditions. Select OLIG2-enriched spheres that have a round, homogenous shape with a clear margin and a golden-brown center (diameter: ∼ 300–800 μm) (Figure 6[href=https://www.wicell.org#fig6]C).\nPretreat and coat 24-well 3D nanomatrix plate inserts containing the 3D nanofibers with Matrigel in DMEM/F12.\nPrepare culture medium (Glial medium) containing 10 μM ROCK inhibitor (Y-27632).\nWarm up culture medium to 37°C.\nPrepare 24-well 3D nanomatrix plates by adding Glial medium (1.5 mL/well).\nSelect the appropriate OLIG2-enriched spheres with a P200 and plate them on the 3D nanofiber network.\nNote: Distribute the OLIG2-enriched spheres within the well so that they are separate from each other and do not form clumps. OLIG2-enriched spheres will attach fast to the Matrigel-coated 3D nanofibers.\nMaintenance and differentiation of oligodendrocyte lineage cells on 3D nanofibers (DIV30 – DIV75).\nNote: The final adherent phase of the protocol will generate a mixed culture of neurons, astrocytes and oligodendrocyte lineage cells (Figures 6[href=https://www.wicell.org#fig6]D–6L).\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nNote: Perform a partial medium change with 2/3 fresh culture medium (Glial medium) every other day.\nCritical: From DIV32 onwards, perform the medium change gently with a P1000 to ensure that the cells do not detach.",
    "Optional: Throughout the final maturation phase of the oligodendrocyte lineage cell differentiation, cells can be fixed at favored timepoints and examined for the expression of specific markers (Figure 6[href=https://www.wicell.org#fig6]). Therefore, single inserts of the 24-well 3D nanomatrix plate can be taken out by using forceps and spatula and transferred to a 12-well tissue culture plate. After that, cells can be fixed with cold 4% PFA for 20 min at RT (20°C–25°C). For the immunocytochemistry protocol follow the instructions described in the section ‘Analysis of co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells on 3D nanofibers’\nDetachment and isolation of hiPSC-derived oligodendrocyte lineage cells from 3D nanofibers\nThis section provides instructions for the detachment of cells from 3D nanofibers and the isolation of oligodendrocyte lineage cells (oligodendrocyte progenitor cells (OPCs) and non-myelinating oligodendrocytes) using magnetic activated cell sorting (MACS). This enables the setup of a controlled, direct co-culture system of hiPSC-derived cortical neurons and oligodendrocyte lineage cells on 3D nanofibers.\nNote: This experiment can be performed from day 75 of the oligodendrocyte lineage cell differentiation protocol on. Earlier timepoints might result in a lower number of oligodendrocyte lineage cells.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nPreparation of hiPSC-derived neurons and oligodendrocyte lineage cells for co-culture.\nNote: One day before the start of the co-culture of hiPSC-derived cortical neurons and oligodendrocyte lineage cells, the cells should be adapted to the new culture medium. Therefore, a medium change to the co-culture medium is recommended to reduce cell stress.\nChange culture medium of neurons (FMM) to co-culture medium (1.5–2 mL/well).\nChange culture medium of oligodendrocytes (Glial medium) to co-culture medium (1.5 mL/well).\nPrepare MACS buffer and store at 4°C.\nMagnetic cell separation of hiPSC-derived oligodendrocyte lineage cells for co-culture with hiPSC-derived neurons.",
    "Note: The following day, the co-culture of hiPSC-derived cortical neurons and oligodendrocyte lineage cells can be set up:\nPrepare MACS buffer with FcR blocker: 77 μL MACS buffer + 10 μL FcR (per sample) and store at 4°C.\nPrepare MACS microbeads mixture: 10 μL anti-O4 microbeads + 3 μL anti-AN2 microbeads (per sample) and store at 4°C.\nPrepare enzyme activation buffer (for Papain).\nPrepare Papain and Ovomucoid.\nPrepare co-culture medium containing 10 μM ROCK inhibitor (Y-27632).\nWarm up co-culture medium containing 10 μM ROCK inhibitor (Y-27632) and DMEM/F12 to 37°C, warm up enzyme activation buffer to RT (20°C–25°C).\nActivation of Papain:\nAdd Papain to the enzyme activation buffer (enzyme activity: 20 units/mL).\nPlace enzyme activation buffer containing Papain at 37°C for 30 min.\nRemove the ring inside the well carefully with forceps.\nWash cells once with DMEM/F12.\nAdd activated Papain to the cells (0.5 mL/well) and place the plate for 15 min in an incubator at 37°C and 5% CO2.\nTake out the plate from the incubator, add DMEM/F12 (1 mL/well) to the Papain-containing well, detach the cells mechanically with a P1000 and transfer cells into a 15 mL conical tube.\nNote: Cells of the same hiPSC line from different wells can be combined to reach to desired cell number.\nNote: It might be difficult to detach the cells from the 3D nanofibers. Apply pressure with a P1000 to detach the cells without harming the cells.\nAdd Ovomucoid (ratio 1:1 Papain:Ovomucoid), mix gently by pipetting up and down a few times (P1000) and incubate for 1 min at RT (20°C–25°C).\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend the cell pellet with co-culture medium containing 10 μM ROCK inhibitor (Y-27632) (1.5 mL).",
    "Note: If you have low number of cells, you might not see a pellet.\nFilter cells through a 70 μm cell strainer.\nPre-wet the strainer with co-culture medium containing 10 μM ROCK inhibitor (Y-27632) (0.5 mL).\nFilter cells through the 70 μm cell strainer over a 15 mL conical tube.\nOptional: If needed for future analysis (e.g., RT-qPCR), count cells and collect an aliquot of the “pre-MACSorting” condition: Take appropriate number of cells (e.g., 50.000–200.000 cells) and transfer them to a new conical tube, centrifuge (400 × g, 5 min, RT (20°C–25°C)), discard the supernatant (as much as possible) and e.g., freeze cell pellet or lyse cell pellet for future analysis.\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nResuspend cells with MACS buffer/FcR blocker mixture (total volume per sample: 87 μL) and incubate for 10 min at 4°C.\nAdd anti-O4/anti-AN2 microbeads mixture (total volume per sample: 13 μL), mix gently (do not vortex) and incubate for 30 min at 4°C.\nWash by adding MACS buffer (1 mL/sample) to the mixture and mix gently by pipetting up and down a few times (P1000).\nCentrifuge: 300 × g, 5 min.\nAspirate the supernatant (as much as possible) and resuspend the pellet with MACS buffer (0.5 mL/sample).\nNote: During the MACS protocol, before proceeding with the next step, wait until the column reservoir is empty.\nNote: Keep the MACS buffer cold (4°C).\nPrepare the MACS system.\nPlace the MACS separator in a laminar flow cabinet.\nPlace MS column in the magnetic field of the MACS separator.\nPrewet MS column by adding MACS buffer (0.5 mL).\nPlace 15 mL conical tube underneath the MS column to collect the unlabeled O4-/AN2- cells (negative fraction) in the next step.\nMagnetic separation – MACS for O4+/AN2+ cells: Collection of O4-/AN2- cells (negative fraction: neurons and astrocytes).",
    "Apply cell suspension onto the MS column (0.5 mL).\nAs soon as the cell suspension passed through the column and the reservoir is empty, wash the column 2 times by adding MACS buffer (1 mL) onto the MS column.\nOptional: If needed for future analysis, collect an aliquot of the O4-/AN2- cells (same procedure as described above, between steps 12.o. and 12.p. “Optional”).\nMagnetic separation – MACS for O4+/AN2+ cells: Collection of O4+/AN2+ cells (positive fraction: oligodendrocyte lineage cells).\nAs soon as the column reservoir is empty, take the column out of the magnetic field of the MACS separator and place the column onto a 15 mL conical tube.\nAdd MACS buffer (1 mL) onto the MS column and immediately flush out the O4+/AN2+ cells by pushing the plunger into the column.\nRepeat step (12.x.ii).\nOptional: If needed for future analysis, collect an aliquot of the O4+/AN2+ cells (same procedure as described above, between steps 12.o. and 12.p. “Optional”).\nNote: Following the detachment and isolation of oligodendrocyte lineage cells, the co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells can be started immediately. Alternatively, isolated oligodendrocyte lineage cells can be frozen and stored in liquid nitrogen for a later start of the co-culture experiment.\nPause point: Isolated oligodendrocyte lineage cells (O4+/AN2+ cells) can be frozen and stored in liquid nitrogen. After the final step of the MACS, cells can be centrifuged (400 × g, 5 min, RT (20°C–25°C)) and resuspended with oligodendrocyte lineage cell freezing medium (∼ 800 μL per cryovial). Afterwards, cryovials can be placed in freezing containers and stored in a – 80°C freezer for ideal cryopreservation (−1°C/minute). After 24 h, cryovials can be transferred to liquid nitrogen for long-time storage.\nCo-culture of hiPSC-derived neurons and oligodendrocyte lineage cells",
    "This section describes the setup of a controlled, direct co-culture system of hiPSC-derived cortical neurons and oligodendrocyte lineage cells on 3D nanofibers. This direct co-culture system can be used to study the interaction of neurons and oligodendrocyte lineage cells as well as the potential of mature oligodendrocytes to myelinate neuronal axons.\nNote: This experiment can be performed directly after the detachment and isolation of oligodendrocyte lineage cells by using the positive fraction (O4+/AN2+ cells) after MACS for the co-culture with neurons (described in the following 13. Option A). Alternatively, frozen O4+/AN2+ cells can be thawed for the co-culture with neurons (described in the following 14. Option B).\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nOption A: Co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells directly after detachment and isolation of oligodendrocyte lineage cells (O4+/AN2+ cells).\nChange co-culture medium of neurons which are already cultured in the 3D nanomatrix plates to co-culture medium containing 10 μM ROCK inhibitor (Y-27632) (1.5–2 mL/well).\nTake the MACSorted O4+/AN2+ cells (positive fraction: oligodendrocyte lineage cells).\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cell pellet with co-culture medium containing 10 μM ROCK inhibitor (Y-27632).\nNote: Cells can be stained with Trypan blue dye to determine the number of viable cells in the cell suspension.\nPlate O4+/AN2+ cells on top of neurons which were cultured already in the 3D nanomatrix plates.\nNote: The number of O4+/AN2+ cells to be seeded on top of neurons can vary depending on the favored readout experiment. In this experiment 5,000 cells per well were seeded. However, this number should be increased for experiments using electron microscopy in order to increase the chance of detection of myelinated axons in a culture, where oligodendrocytes are randomly distributed in the well.",
    "Store cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 48 h with co-culture medium.\nOption B: Co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells after thawing of oligodendrocyte lineage cells (O4+/AN2+ cells).\nPrepare co-culture medium containing 10 μM ROCK inhibitor (Y-27632).\nWarm up co-culture medium and DMEM/F12 to 37°C.\nChange co-culture medium of neurons which were already cultured on the 3D nanofibers to co-culture medium containing 10 μM ROCK inhibitor (Y-27632) (1.5–2 mL/well).\nTake out the frozen cryovial containing the oligodendrocyte lineage cells (O4+/AN2+ cells) from the liquid nitrogen tank.\nTransfer the cryovials under the laminar flow cabinet, let them adapt to the temperature for 2 min and then keep the cryovial in hand to thaw the vial content.\nTake up the vial content (oligodendrocyte lineage cells (O4+/AN2+ cells) in freezing medium) and transfer with a P1000 into a 15 mL conical tube.\nAdd DMEM/F12 very slowly (drop by drop) to the cryovial content (oligodendrocyte lineage cells (O4+/AN2+ cells in freezing medium) in the 15 mL conical tube and swirl the conical tube while adding the DMEM/F12 (5 mL).\nCentrifuge: 400 × g, 5 min, RT (20°C–25°C).\nAspirate the supernatant and resuspend cell pellet with co-culture medium containing 10 μM ROCK inhibitor (Y-27632).\nNote: Cells can be stained with Trypan blue dye to determine the number of viable cells in the cell suspension.\nPlate O4+/AN2+ cells on top of neurons which were cultured already on the 3D nanomatrix plates.",
    "Note: The number of O4+/AN2+ cells to be seeded on top of neurons can vary depending on the favored readout experiment. In this experiment 5,000 cells per well were seeded. However, this number should be increased for experiments using electron microscopy in order to increase the chance of detection of myelinated axons in a culture, where oligodendrocytes are randomly distributed in the well.\nStore cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 48 h with co-culture medium.\nMaintenance of co-cultured hiPSC-derived neurons and oligodendrocyte lineage cells on 3D nanofibers.\nNote: All steps should be performed under sterile conditions in a laminar flow cabinet.\nNote: Perform a partial medium change (∼ 1.5 mL/well) every other day until the end of the co-culture (up to 21 days was tested in this protocol).\nCritical: Perform the medium change gently with a P1000 to ensure that the cells do not detach.\nPrepare and warm up co-culture medium to 37°C.\nTake out the spent co-culture medium (∼ 1.5 mL/well) gently with a P1000.\nAdd fresh co-culture medium (∼ 1.5 mL/well) gently with a P1000.\nStore cells in an incubator at 37°C and 5% CO2.\nThe next medium change needs to be performed after 48 h with co-culture medium.\nAnalysis of co-culture of hiPSC-derived neurons and oligodendrocyte lineage cells on 3D nanofibers\nTiming: 7 days (for all steps in this section)\nTiming: 2 days (for step 16)\nTiming: 7 days (for step 17)\nOn the final day of the co-culture, cells can be processed for downstream analysis. Here, we describe two possible approaches and how to process the cells on the 3D nanofibers for immunocytochemistry and transmission electron microscopy (TEM).\nImmunocytochemistry of co-culture of hiPSC-derived cortical neurons and oligodendrocytes on 3D nanofibers.",
    "Note: This step describes an approach to analyze co-culture of neurons and oligodendrocytes by fluorescence microscopy. Here, we describe the immunocytochemistry protocol that is used for cells grown on the 3D nanofiber inserts.\nNote: The immunocytochemistry protocol is performed with “free-floating” inserts in 12-well tissue culture plates. The inserts should be transferred into a new well of the 12-well tissue culture plate for each step. The working volume for each step is 600 μL per well.\nTake out the insert from the 24-well 3D nanomatrix plate by using forceps and spatula and transfer it to a 12-well tissue culture plate.\nFix cells in cold 4% PFA for 20 min at RT (20°C–25°C) (1 mL/well).\nWash 2 times with 1× DPBS without calcium and magnesium (1 mL/well).\nBlock and permeabilize with 5% BSA and 0.1% Triton X-100 in 1× DPBS for 2 h at RT (20°C–25°C) with gentle agitation.\nPrepare primary antibodies in 2.5% BSA and 0.1% Triton X-100 in 1× DPBS and incubate at 4°C with gentle agitation overnight (18–20 h).\nWash 3 times with 1× DPBS for 10 min at RT (20°C–25°C) with gentle agitation.\nPrepare secondary antibodies in 2.5% BSA in 1× DPBS and incubate for 1 h at RT (20°C–25°C) with gentle agitation in the dark.\nWash 3 times with 1× DPBS for 10 min at RT (20°C–25°C) with gentle agitation in the dark.\nStain nuclei with Hoechst 33342 (2 μM) in 1× DPBS for 5 min at RT (20°C–25°C) with gentle agitation in the dark.\nWash 2 times with 1× DPBS for 10 min at RT (20°C–25°C) with gentle agitation in the dark.\nMount insert with VectaShield (∼100 μL/well) in a 24-well glass bottom plate that is suitable for imaging.\nCritical: Turn the insert upside down for imaging.",
    "Transmission electron microscopy (TEM) of the co-culture of hiPSC-derived cortical neurons and oligodendrocytes on 3D nanofibers.\nNote: This step describes an approach to analyze the interaction of neurons and oligodendrocytes, in particular myelination, by transmission electron microscopy (TEM). The ultrastructural analysis enables the investigation of characteristics of the myelin sheath which cannot be observed by fluorescence microscopy. These characteristics include, for example, the thickness of the myelin sheath, the number of myelin sheath wraps around an axon of a neuron and the ratio between the inner and outer diameter of the myelin sheath (g-ratio). Here, we describe the protocol to perform ultrastructural analysis of hiPSC-derived neurons and oligodendrocytes on 3D nanofibers.\nFix the 24-well 3D nanomatrix plate insert containing the cells (neurons and oligodendrocyte lineage cells) on the 3D nanofiber network in 2.5% glutaraldehyde in 100 mM cacodylate buffer (pH 7.2) for 30 min at RT (20°C–25°C) (0.5 mL/well).\nMonitor the direction of the nanofibers and cells at an optical microscope.\nCritical: This step is very important for the ultrastructural analysis of myelination. The cells are mainly growing along the nanofibers which are spanned in an aligned fiber orientation. To ensure a cross-section of myelinated axons, it is important to monitor the direction of the nanofibers and cut the sample accordingly in the next step.\nCut out a small piece (rectangle, 1 cm × 0.5 cm) of the 24-well 3D nanomatrix plate insert with the region of interest with surgical scissors to fit the mold for embedding (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2540-Fig7.jpg\nFigure 7. Sample preparation for transmission electron microscopy\n(A) Image of Cellevate 24-well 3D nanomatrix plate insert, diameter: 1.5 cm.",
    "(B) Instructions for cutting the region of interest to fit the mold for embedding (1 cm × 0.5 cm) and to ensure a cross-section of myelinated axons. Mark one corner (blue arrow) of the cut out to keep track of the orientation of the nanofibers and cells.\nNote: It is important to keep track of the orientation and the direction of the nanofibers and cells to ensure a cross-section. Therefore, it is recommended to mark one corner of the rectangle by removing a tiny piece of the corner with surgical scissors.\nLeave the sample in 2.5% glutaraldehyde in 100 mM cacodylate buffer (pH 7.2) at 4°C overnight (18–20 h).\nRinse the sample 3 times in 100 mM cacodylate buffer.\nFix the sample in 1% osmium in 100 mM cacodylate buffer for 30 min on ice.\nWash the sample with water 3 times for 5 min.\nIncubate the sample in 1% uranyl acetate in water at 4°C overnight (18–20 h).\nDehydrate in 5-min steps in an ethanol gradient of 50%, 70%, 90%, 95% and 2 times 100%.\nInfiltrate stepwise with embedding medium (Spurr resin): 50% for 1 h, 75% for 1 h, 100% for 1 h and 100% overnight (18–20 h) and polymerize at 50°C for 48 h.\nCritical: Nanofibers are sensitive to heat, temperatures above 50°C can deform the nanofibers.\nSection the block in 70 nm thin sections using a diamond knife (Diatome, Nidau, Switzerland) and a Leica UC7 ultramicrotome (Leica Microsystems, Vienna, Austria) in the direction to cross section the nanofibers and cells.\nCollect the sections on pioloform-coated slot grids.\nPost-stain with 3% uranyl acetate in 70% methanol for 5 min and lead citrate for 3 min. Prepare lead citrate with 1.3 M trisodium citrate, 1 M lead nitrate and 1 M NaOH in distilled water.",
    "Image the sections on an JEOL JEM-1400 electron microscope (JEOL, Tokyo, Japan) operating at 80 kV and equipped with a 4K TemCam F416 (Tietz Video and Image Processing Systems GmBH, Gautig, Germany)."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Neuroscience",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}