{
  "id": 15296,
  "origin_website": "Jove",
  "title": "Simultaneous Video-EEG-ECG Monitoring to Identify Neurocardiac Dysfunction in Mouse Models of Epilepsy",
  "procedures": [
    "All experimental procedures should be carried out in accordance with the guidelines of the National Institutes of Health (NIH), as approved by your institution's Institutional Animal Care and Use Committee (IACUC). The main surgical tools needed for this protocol are shown in Figure 1.\n1. Preparing Electrode for Implantation\nPlace the 10-socket female nanoconnector (i.e, the electrode; Figure 2A) into a tabletop vise with the 10 wires facing up and the black wire in the front. Using fine forceps, fold down the first (black) wire to the right and the second (tan) wire to the left. Next fold down the red, orange, blue, and purple wires alternating right and left (Figure 2B). Cut off the yellow, green, white, and gray wires at the base of their attachment.\nTo prepare the ECG wires, use a permanent marker to make marks on the purple wire at ~3.2 cm and ~3.5 cm from the base of the electrode and on the blue wire at ~2.2 cm and ~2.5 cm (Figure 2C). Remove the electrode from the vise and expose the silver filaments between the marked areas by stripping the insulation on one side of the wire with a scalpel blade (Figure 2D).\n\tNOTE: Scraping the wires should be done under the microscope. Caution should be used to ensure the silver filaments are not damaged as the insulation is scraped away.\nPlace the electrode back in the vise. Affix a piece of double-sided mounting tape, precut to the length and width of the electrode, to the top of the wires using a thin layer of superglue.\n\tNOTE: Before adhering the tape, be sure that the wires are lying flat, sticking straight out to the sides, and not twisted over one another.",
    "Trim the wires to be used for EEG at a slightly V-shaped angle to a length of approximately 7-9 mm, with the tan and black wires cut the shortest. Do not cut the wires to be used for ECG (Figure 2E).\nPackage and sterilize the electrode for later use.\n2. Preparing the Mouse for Surgery\nWeigh the mouse. Inject a 5 mg/kg dose of Carprofen subcutaneously (s.c.). Anesthetize the animal with an intraperitoneal (i.p.) injection of Mouse Anesthetic Cocktail containing Ketamine (80 mg/kg), Xylazine (10 mg/kg), and Acepromazine (1 mg/kg).\nOnce the mouse becomes anesthetized, apply a thin line of veterinary ophthalmic ointment to each eye. Using an electric trimmer, shave two small areas (~2 cm2) on both sides of the trunk of the mouse, corresponding to where the ECG wires will be implanted (Figure 3A).\n\tNOTE: The shaved area on the right side should be located in an approximately dorsolateral position just behind the right \"armpit\" of the animal. On the left side, the shaved area should be located in a more ventrolateral orientation along the side of the animal, but about 1 cm more posterior than the shaved area on the right side (Figure 3A).\nRemove the clipped hair and clean both shaved areas with a chlorhexidine solution.\n3. Attaching the Electrode to the Skull\nPlace the mouse in the prone position on the stage of the dissecting microscope and confirm the adequate depth of anesthesia by the absence of the toe-pinch reflex.\n\tNOTE: Steps 3.2 to 5.6 should be done with the aid of a microscope.\nHolding the head steady between the thumb and forefinger, part the fur down the center of the head from between the ears to just behind the eyes with a cotton swab soaked in alcohol (Figure 3B).",
    "NOTE: Although this surgery should be done with aseptic technique, it is not a sterile procedure since the scalp cannot be shaved and the mouse must be manipulated during the surgery.\nUsing a scalpel, make a ~1-cm midline incision through the scalp between the parted fur from just in front of the ears to just between the eyes (Figure 3C, D).\n\t\nUsing either the side of the scalpel or a cotton-tipped applicator, gently scrape the mucus membrane on top of the skull until the bone appears dry.\nPluck the fur around the perimeter of the incision forming a thin border of bald skin. Carefully remove any fur that may have fallen into the surgical field with a pair of forceps. Dry the surface of the skull with a sterile cotton-tipped applicator, applying gentle pressure for several seconds if needed.\nMake four marks on the skull with a sterilized permanent marker at the sites where the burr holes will be drilled (Figure 3E). Place two marks, one on each side of the sagittal suture anterior to bregma, approximately 4 mm anterior and 5 mm lateral to bregma (above frontal cortex), for the reference and ground wires. Place another two marks, one on each side of the sagittal suture posterior to bregma, approximately 2 mm posterior and 7 mm lateral to bregma (above parietotemporal cortex), for the two EEG recording wires.\n\tNOTE: This is not a stereotactic surgery and the distances given are approximations which will vary depending on the size of the mouse. Ensure that the holes are placed far enough laterally to easily accommodate the base of the electrode implant which will be affixed to the midline along the sagittal suture (Figure 3F).",
    "Using a sterile micro drill, make small burr holes at each mark with a 0.8-mm diameter drill bit.\n\t\nApply gentle pressure while drilling to create small recesses at each marked spot. Drill through the skull by pulsing the drill bit as the hole nears completion, being sure not to apply too much pressure, which could lead to penetrating and damaging the underlying brain tissue.\nAfter all holes are drilled, wipe the area clean with a cotton-tipped applicator.\nTo adhere the electrode to the top of the skull, remove the paper backing from the double-sided mounting tape on the electrode. Apply a thin layer of superglue to the tape. Using a pair of forceps, remove the electrode from the vise. Orient it such that, when positioned along the sagittal suture, the shorter EEG wires are rostral and the longer ECG wires are caudal.\n\t\nAdhere the electrode to the skull over the sagittal suture between the holes (Figure 3F).\n\t\tNOTE: The skull must be completely dry for the glue on the electrode to stick. Be sure not to occlude the burr holes in the skull with the electrode or glue.\nBriefly, hold the electrode in place to ensure adhesion to the skull and then allow the glue to dry for 5-10 min.\n4. Implanting the Wires for ECG\nRotate the mouse slightly onto its right side while keeping the head upright. Take the long ECG wire on the left side and extend it down the side of the mouse to the shaved area on the left side. Visualize where the exposed wire will be positioned once it is tunneled beneath the skin.\n\tNOTE: For reference, a small mark can be made on the skin with a permanent marker.",
    "Using a scalpel, make a ~1-cm incision in the skin at the location where the exposed wire will be positioned. While holding the incision open with Adson forceps, use Dumont forceps to loosen the skin around the incision from the underlying connective tissue to form a pocket for the wire. Beginning at the incision site on the side of the animal, tunnel subcutaneously with a piece of sterile polyethylene tubing (that has been prepared by cutting it to ~6 cm in length with the leading edge beveled) until the beveled edge exits the incision made on the head (Figure 4A, B).\nFeed the ECG wire through the tubing using Dumont forceps (Figure 4C). While removing the tubing, grasp the electrode wire with Adson forceps as it exits the lateral incision. Pull the wire taut (Figure 4D).\nFix the ECG wire in place by suturing it to the tissue under the skin with 6-0 Nylon (Figure 4E). Using forceps and Olsen-Hegar needle holders, apply one suture over the exposed filaments and another suture either before or after the exposed portion.\nCut the electrode wire about 2-3 mm past the last suture and tuck the end into the pocket of skin formed previously. Pull the two sides of the incision together and close with a wound clip applied using Crile-Wood needle holders (Figure 4F).\nTurn the mouse so that the nose is pointing in the opposite direction. With the head still in the upright prone position, rotate the mouse slightly onto its left side.\nRepeat the above steps to place the contralateral ECG wire.\n\tNOTE: To approximate a lead II ECG recording configuration, the right ECG wire should be placed slightly more dorsal and anterior than the left ECG wire, which should be slightly more ventral and posterior.",
    "5. Implanting the Wires for EEG\nTo implant the wires for EEG, place the mouse flat in the prone position and hold the scalp incision open with the thumb and forefinger of the non-dominant hand.\nWith forceps, remove any fur that may have been pulled under the skin by the tubing. If necessary, dry the skull again with a cotton-tipped applicator. Using Dumont forceps, carefully scoop out and remove any debris or blood clots that may have collected in the burr holes.\nStarting with the most anterior hole on one side, bend the wire that is closest to that hole so that it is positioned directly over the hole but not yet inserted. Grasp the lower end of the wire and feed it as horizontally as possible into the hole until ~2-3 mm of the wire is under the skull (Figure 5A).\n\tNOTE: The wires should lie horizontally between the skull and the surface of the brain. The wires should not impale the brain.\nWith the end of the wire secure in the hole, gently fold down the remaining portion of the wire so that it lies flat against the skull.\nContinue in the same manner with the posterior wire on the same side. Repeat for the anterior and posterior wires on the other side (Figure 5B).\n\tNOTE: The wire configuration is summarized in Figure 5C.\n6. Closing the Head Incision with Dental Cement\nMix two scoops of polycarboxylate powder with ~5 drops of polycarboxylate liquid. Stir the mixture with a toothpick to make a paste with the desired viscosity.\n\tNOTE: Subsequent steps 6.2 to 6.4 must be performed quickly since the dental cement dries within 1 min after mixing.",
    "Pick up a large drop of cement paste with the toothpick and apply it around the base of the electrode beginning caudally (Figure 6A). Continue around the electrode allowing the cement to drip over the wires forming a cap around the implant (Figure 6B).\nUsing Dumont forceps, pull the fur at the edges of the incision up over the cement cap and press together, being careful not to disturb the wires implanted beneath. Press the fur up into the cement to help with closure.\nSeal the incision between the eyes by bonding the fur with the dental cement (Figure 6C).\n7. Aiding Post-Surgical Recovery\nPlace the mouse in an empty cage on a circulating heat pad. Monitor the mouse until it regains consciousness and can maintain sternal recumbency.\nPost-surgically, house the mouse individually in a cage with food pellets and hydrating gel placed on the floor of the cage. Top the cage with a micro-isolator lid.\nAt 24 h post-surgery, inject (s.c.) the mouse with 5 mg/kg Carprofen.\nAllow ≥ 48 h of post-surgical recovery before recording.\n8. Recording EEG-ECG Signals from a Tethered Mouse\nFollowing recovery, transfer the implanted mouse to a recording chamber with transparent walls to facilitate video monitoring.To tether (i.e., \"plug in\") the mouse (Figure 7A), gently but firmly hold the mouse in one hand while using the other hand to insert the 10-pin (male) nanoconnector with guide post into the sockets of the EEG-ECG electrode implant (female) on the mouse's head.\nSecure the wiring above the chamber using a support rod, ensure there is enough slack in the wire to permit the mouse to move freely but not so much that the wiring drags the floor of the chamber.",
    "Connect the wiring from the 10-pin nanoconnector to a computer-connected signal acquisition interface unit with synchronized video recording as depicted in Figure 7B.\nSet the sampling rates for the recording to be ≥ 2 KHz for ECG and ≥ 500 Hz for EEG (i.e., at least twice the frequency that one is interested in studying).\nFor optimal viewing of the signal traces, apply the following filters as done previously18: a 60-Hz notch filter for all data, a 75-Hz low- and 0.3-Hz high-pass band filter for EEG, and a 3-Hz high-pass filter for ECG.\nRecord simultaneous video and EEG-ECG (Figure 7C) and save the digitized data for offline analyses with signal processing software.\nOnce the recordings are complete, carefully unhook the mouse and return it to its home cage.\n9. Analyzing EEG Recordings\nPerform seizure quantification analysis.\n\t\nVisually inspect the entire EEG recording to manually identify seizure episodes, defined in this model as high-amplitude (at least two times the baseline), rhythmic electrographic discharges lasting greater than 5 s (Figure 8A). Examine the video that corresponds to the electrographic seizures to identify seizure-associated behaviors.\nTo calculate seizure frequency (seizures/h), divide the number of seizures by the total number of recording hours.\nTo calculate seizure duration, measure the elapsed time from the onset of electrographic seizure until the cessation of spiking (Figure 8A).\nTo calculate seizure burden, defined as the time spent seizing per hour, sum the seizure durations and divide by the total recording hours.\nPerform spectral power analysis of pre- and post-ictal EEG.\n\t\nSelect a 30-min (or any other desired time duration) segment of peri-ictal EEG data centered around the seizure episode to be examined. Export the raw data (with filter settings removed) as an ASCII data file or some other file type compatible with power spectrum software.",
    "Convert the ASCII file to a text file using a simple text editor application.\nOpen the resulting text file of the EEG segment in power spectrum software and specify the following settings: \"ignore non- numeric lines\"; \"comma as data delimiter\"; and 1000 Hz default sampling rate.\nOnce the EEG signal appears in the power spectrum software in its respective channel, click on the channel drop-down menu and select \"digital filter.\" Apply digital band-pass filters corresponding to the desired frequency range to be analyzed.\nOpen \"Spectrum View\" from the menu panel, select the appropriate EEG display channel to be analyzed, and then click \"settings.\" Under \"settings,\" specify the following parameters for the spectrogram and click \"Close\" to generate the spectrogram (Figure 8C): FFT Size: 8192, Data window: Welch, Window overlap: 93.75%, Display Mode: power density, Spectrogram colors: rainbow, No. of colors: 64, PSD averaging: 1, Remove zero frequency component: checked as \"on\".\nAdjust the colorimetric scale as needed for optimal visualization of the spectrogram.\nOpen \"Analysis Manager\" from the menu panel. Click on \"+ new analysis\" to create two analyses (Analysis 1 and Analysis 2), which will correspond to the pre- and post-ictal EEG segments to be analyzed. Specify the desired pre- and post-ictal segments on the spectrogram and associate them with Analysis 1 and Analysis 2, respectively.\n\t\tNOTE: Only EEG data without noise and artifacts should be considered and periods of the EEG recordings with significant artifacts should be removed from the analysis.\nOnce the analysis segments are created, open \"Data Pad View\" from the menu panel. Click on the appropriate EEG channel to open the \"Data Pad Column Setup\" menu for that channel.\nIn \"Data Pad Column Setup,\" select the option for \"Spectrum\" and then select \"Percentage Total Power.\"",
    "In the \"Data Pad Column Setup,\" click on \"options\" and specify the frequency range to be examined. Click \"OK\" in the \"Spectrum Data Pad Options\" and in the \"Data Pad Column Setup,\" and the percentage (%) power for the specified frequency band will appear in the Data Pad View for the selected analysis segment (i.e., Analysis 1 or Analysis 2) as specified in the \"Analysis Manager.\"\n\t\tNOTE: The % power, or relative power, of each band is expressed as the percentage of total spectral power within the specified frequency range.\nRepeat the previous step for each frequency band to be analyzed.\n\t\tNOTE: Frequently used ranges for the five main EEG frequency bands include18: δ-band = 0.5-3 Hz, -band = 3.5-7 Hz, α-band = 8-12 Hz, β-band = 13-20 Hz, and γ-band = 21-50 Hz.\n10. Analyzing ECG Recordings\nQuantify skipped heart beats.\n\t\nVisually inspect the entire ECG recording to manually identify skipped heart beats, defined as a prolongation of the RR interval equaling ≥ 1.5 times the previous R-R interval, which is often associated with a non-conducted P-wave indicative of atrioventricular conduction block (Figure 9A).\nTo calculate the frequency of skipped heart beats per hour, divide the total number of skipped beats during the recording session by the total duration of recording hours.\nPerform heart rate variability (HRV) analysis.\n\t\nIn the data acquisition software, change the logging settings to 1 epoch for the ECG channel. Generate parser segments for the ECG recordings: one 5-min ECG segment every 3 hrs during the 12-hour light-phase period, for a total of 4 segments.\n\t\tNOTE: The ECG recordings selected for analysis should be during times when the animal is stationary and the data is free of movement artifacts.",
    "Generate a spreadsheet of the R-R interval values from the selected parsed ECG segments by clicking \"save parsed derived data.\" Review the spreadsheet for any missing data or bad data and remove all other numerical values except R-R interval data. Save this modified spreadsheet as a text file selecting the option for \"tab delimited.\"\nOpen the text file as a custom ASCII file in the HRV software, specifying the following options:Number of header lines: 0, Column Separator: Tab/ Space, Data type: RR, Data Column: 1, Data units: ms, and Time index column: none.\nIn the preferences section of the menu, set the options as detailed below.\n\t\t\nSet Analysis options as mentioned. R-R interval detrending, detrending method: smoothn priors,smoothing parameter: 500, HRV frequency bands19,Very low frequency: 0-0.15 Hz, Low frequency: 0.15-1.5 Hz and High frequency: 1.5-5 Hz\nSet Advanced settings as mentioned. Spectrum estimation options, Interpolation of RR series: 20Hz, Points in frequency domain: 500 points/Hz, FFT spectrum using Welchs periodogram methods, Window width: 32s, and Window overlap: 50%\nRun the HRV analysis to generate time domain analysis values for Mean RR, STD RR (i.e., SDNN), RMSSD and frequency domain analysis values for HF power, LF power, and the ratio of LF/HF power. If desired, save the results as a PDF file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}