{
  "id": 2775,
  "origin_website": "Cell",
  "title": "Pseudomonas-specific 16S rRNA insect gut-microbiome profiling using next-generation sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample collection\nInsect populations.\nCollect insect populations to be screened for the presence of Pseudomonas from different geographical regions and climatic zones.\nOptional: A lab-reared population maintained under suitable growth conditions (i.e., unexposed to stress) can be used as a control.\nPreserve all collected insects in absolute ethanol (99.9%) and store at −20°C till further use.\nPlant samples.\nIn the case of phytophagous insects, dissect regions representing the feeding site, from both infested and uninfested plants grown in sterile vermiculite, to determine the influence of the host plant on the insect’s gut microbiome.\nPreserve the dissected tissues in absolute ethanol (99.9%) and store at −20°C till further processing.\nTotal DNA extraction from rice and BPH and quality check\nTiming: 5–6 h (for step 3)\nThis step describes the protocol for extracting the genomic DNA from insects and plant tissues, for Pseudomonas-specific microbiome profiling.\nIsolate the total DNA from individual insects (∼3 mg dry weight) of each population using the GF-1 tissue DNA extraction kit (Vivantis, Malaysia) following the steps mentioned below:\nNote: It is advisable to isolate DNA from not more than 20 individuals at a time to avoid time lag and subsequent DNA degradation.\nTake out the insects (stored at −20°C in absolute alcohol) on a fresh Petri plate, de-wing using a sterile blade, and transfer to a fresh 1.5 mL Eppendorf tube.\nGrind the insect in liquid nitrogen and homogenize in 250 μL of Tissue lysis (TL) buffer (provided in the kit) using a sterile micro pestle.\nNote: This should be performed quickly to avoid DNA degradation.\nBriefly vortex the tubes and add 3 μL of RNase A (10 mg/mL, provided in the kit), seal with Parafilm, and incubate at 37°C for 30 min in a water bath.",
    "After RNase treatment, add 20 μL of proteinase K (20 mg/mL) and 12 μL of lysis enhancer to the tubes, invert gently for thorough mixing of solutions, and incubate at 65°C for 2–3 h until the tissue is completely dissolved.\nAdd two volumes (∼600 μL) of Tissue binding (TB) buffer (provided with the kit). Mix thoroughly and incubate at 65°C for 10 min.\nAdd 200 μL of absolute ethanol. Mix immediately and thoroughly by quick vortexing to obtain a homogenous solution.\nTransfer ∼600 μL of sample into the column assembled in a clean collection tube.\nCentrifuge at 7000 g for 1 min. Discard the flow through.\nRepeat the above steps (steps g, h) for the remaining samples.\nWash the column with 600 μL of wash buffer and centrifuge at 7000 g for 1 min.\nDiscard the flow through.\nSubject the column to a short dry spin to remove all traces of ethanol. Discard the flow through.\nNext, place the column on a fresh 1.5 mL Eppendorf tube, and add 36 μL of pre-warmed elution buffer (EB; provided with the kit) to the center of the column. Let it stand for 5 min at room temperature (28°C–37°C).\nSpin the tubes at 19,000 g for 1 min.\nThe eluate contains purified DNA.\nDNA integrity, purity and concentration were checked using gel electrophoresis6[href=https://www.wicell.org#bib6] and by measuring absorbance on NanoDrop spectrophotometer (Thermo Scientific, USA). The absorbance ratio 260/280 when ≥1.8, is indicative of a pure DNA sample. And the absorbance ratio 260/230, when <1.8, indicates contamination by organic compounds and/or chaotropic agents.\nNote: The approximate amount of DNA obtained from a single adult BPH usually ranges from 1.5 - 2 μg. Extracted DNA is to be kept on ice and stored at −20°C till further use.",
    "Isolate the total DNA from plant samples using the GeneJET Plant Genomic DNA Purification mini kit (Thermo Scientific, USA) as per the protocol mentioned below:\nAlternatives: Any plant genomic DNA isolation kit can be used here to extract the DNA.\nGrind the plant tissue (100 mg) in liquid nitrogen.\nImmediately transfer the tissue powder to 1.5 mL Eppendorf tube containing 350 μL of lysis buffer A (supplied with the kit).\nNote: This should be performed quickly to avoid DNA degradation.\nVortex for 15 s and mix thoroughly.\nAdd 50 μL of lysis buffer B and RNase A (provided with the kit).\nIncubate the sample for 10 min at 65°C (preferable in a water bath) with occasional vortexing.\nAdd 130 μL of precipitation solution and mix by inverting the tube 1–3 times.\nIncubate on ice for 5 min.\nCentrifuge at 22,000 g for 5 min.\nCollect the supernatant and transfer it to a clean Eppendorf tube.\nAdd 400 μL of Plant gDNA Binding solution and 400 μL of 96% ethanol. Mix well.\nTransfer half of the prepared mixture to the spin column (provided with the kit) and centrifuge at 7000 g for 1 min.\nDiscard the flow through and apply the remaining mixture onto the same column.\nCentrifuge for 1 min at 7000 g.\nAdd 500 μL of Wash Buffer I (reconstituted in absolute ethanol) to the column and centrifuge for 1 min at 11,500 g.\nDiscard the flow-through and place the column back into the collection tube.\nAdd 500 μL of Wash Buffer II to the column and centrifuge for 3 min at 22,000 g.\nDiscard the flow-through and place the column back into the collection tube.\nPerform dry centrifugation at full speed for 1 min to remove the traces of residual ethanol.",
    "For elution, use 100 μL of pre-warmed EB applied at the center of the column and incubate for 5 min at room temperature (28°C–37°C). Place the column on a fresh Eppendorf tube.\nNote: Using pre-warmed elution buffer at the DNA elution step results in higher yields.\nCentrifuge for 1 min at 11,200 g.\nThe eluate contains purified DNA.\nNote: Extracted DNA is to be kept on ice and stored at −20°C till further use.\nQuantify the extracted genomic DNA (from insect and plant tissues) on the Qubit 4.0 fluorometer (Invitrogen, USA) as per the instructions mentioned below.\nSet up the required number of Qubit tubes for samples.\nLabel the tube lids.\nCritical: Do not label the side of the tube as this could interfere with the sample reading.\nPrepare the Qubit working solution by diluting the Reagent in a 1:200 ratio in Buffer.\nAdd 198 μL of working solution to each sample tube.\nAdd 2 μL of each sample to the appropriate tube, then mix by vortexing. The final volume should be 200 μL.\nIncubate all the tubes at room temperature (28°C–37°C) for 2 min.\nProceed to quantifying samples on Qubit fluorometer.\nOn the home screen of the Qubit, press dsDNA, then select dsDNA: High Sensitivity or dsDNA: Broad Range depending on the kit being used.\nNote: We used dsDNA: Broad Range kit for quantification.\nPress Read Samples to proceed.\nIn the Sample Volume screen, select the volume of sample added to the tube and the output concentration units (i.e., ng/μL).\nInsert the first sample tube into the sample chamber, close the lid, and then press Read Tube.",
    "The software displays the results of the sample. The top value (in large font) is the concentration of the original sample. The bottom value is the dilution concentration. Record the concentration of the original sample, remove the tube, and repeat readings and results recording for each additional sample.\nAssess the quality of the DNA by gel electrophoresis (Figure 1[href=https://www.wicell.org#fig1], using 0.8% TBE agarose gel6[href=https://www.wicell.org#bib6]). The concentration of DNA typically ranges from 20–60 ng/μL and 50–150 ng/μL for insect and plant samples, respectively. However, these values may change depending on the amount of starting material.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2285-Fig1.jpg\nFigure 1. Representative 0.8% agarose gel electrophoresis image of the extracted genomic DNAs\n(A). Insect samples (Lanes 1–7: DNA isolated from different BPH individuals; Lane 8: 1 Kb DNA ladder).\n(B) Plant samples (Lanes 1–2: DNA isolated from different rice seedlings; Lane 3: Blank; Lane 4: 1 Kb DNA ladder).\nScreening insect populations for the presence of Pseudomonas\nThe Pseudomonas-specific V3-V4 hypervariable region of 16S rRNA (for species-level identification) is to be PCR amplified using insect DNA as a template, and primer pair Pseudo-S2-F 5′-GACGGGTGAGTAATGCCTA-3′ and Pseudo-S2-R 5′-CACTGGTGTTCCTTCCTATA-3'.\ntable:files/protocols_protocol_2285_2.csv\ntable:files/protocols_protocol_2285_3.csv\nThe PCR amplified products should be separated on 0.8% TBE agarose gel (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2285-Fig2.jpg\nFigure 2. 0.8% agarose gel showing PCR amplified 617 bp fragment corresponding to the Pseudomonas-specific 16S rRNA\nLanes 1–5: BPH samples, Lanes 6–7: Blank, Lane 8: 1Kb DNA ladder. Arrows on the right indicate the molecular weights of the corresponding fragments of the 1Kb ladder.\nPurification of PCR-amplified 16S rRNA fragments\nTiming: 1–2 h (for step 9)\nThis step describes the protocol for purifying PCR-amplified fragments for sequencing.\nPurify the PCR-amplified fragments (618 bp; obtained from the insect populations harboring Pseudomonas) using GF-1 AmbiClean (Gel & PCR) kit (Vivantis, Malaysia).",
    "Note: Any DNA elution kit can be used here to purify and extract PCR amplified fragments from the agarose gel.\nVisualize and identify the appropriate PCR-amplified fragment on the gel under a UV transilluminator. Using a sterile blade, excise the band of interest (618 bp).\nCritical: Exposure of gel containing the PCR amplified product to UV should be kept to a minimum.\nTransfer the gel piece to a pre-weighed Eppendorf tube.\nDetermine the net weight of gel slice, and add equivalent (1 vol) volume of DB buffer (i.e., 100 μL DB buffer should be added per 0.1 g gel).\nIncubate the tubes at 50°C with occasional mixing until the gel slice completely dissolves.\nAdd 1 vol absolute ethanol and quickly vortex for 5 s.\nLoad the mixture onto the DNA binding column provided with the kit and centrifuge at 13,500 g for 1 min.\nDiscard the flow through.\nAdd 650 μL of wash buffer and centrifuge at 13,500 g for 1 min.\nDiscard the flow through.\nSubject the column to a short dry spin to eliminate all the traces of ethanol.\nDiscard the flow through.\nPlace the column on a fresh Eppendorf tube, and add 36 μL of elution buffer (EB) to the center of the column. Let it stand for 5 min at room temperature (28°C–37°C).\nSpin the tube at 13,500 g for 1 min. The eluate contains the purified PCR DNA.\nQuantify the eluted product using the Qubit dsDNA Assay BR kit on Qubit 4.0 fluorometer (Invitrogen, USA). The expected concentration of the purified PCR product ranges from 10–15 ng/μL. Usually, DNA recovery, using the above-mentioned protocol, is >80%. Sequence the isolated fragments using the Oxford Nanopore Technology[href=https://nanoporetech.com/applications/dna-nanopore-sequencing] (ONT, UK).",
    "Note: Nanopore sequencing technology enables direct, real-time analysis of long DNA fragments. Hence, we prefer Nanopore sequencing over conventionally used Illumina sequencing platform. Alternatively, PacBio sequencing platform can also be used.\nConstruction of Pseudomonas-specific 16S rRNA library and sequencing\nTiming: 1–2 days (for step 10)\nLibrary preparation is a critical step towards obtaining good quality sequencing reads, hence must be carried out carefully following the manufacturer’s instructions[href=https://international.neb.com/protocols/2015/08/13/protocol-for-use-with-nebnext-ultra-ii-end-repair-da-tailing-module-e7546].\nNEBNext End Prep.\nFor library preparation, approximately 300 ng of the eluted PCR product, representing each amplicon, must be end-repaired using the NEBnext ultra II end repair kit[href=https://international.neb.com/protocols/2015/08/13/protocol-for-use-with-nebnext-ultra-ii-end-repair-da-tailing-module-e7546] (New England Biolabs, MA, USA). Clean up the reaction using with 1× AmPure beads (Beckmann Coulter, USA).\nBarcoding Adapter ligation.\nPerform the barcoding adapter ligation (BCA) using the NEB blunt/TA ligase[href=https://international.neb.com/protocols/2012/08/27/transfer-master-mix-to-ice-prior-to-reaction-set-up-mix-tube-by-finger-flicking-before-use-combin] (New England Biolabs, MA, USA) following manufacturer’s instructions[href=https://international.neb.com/protocols/2012/08/27/transfer-master-mix-to-ice-prior-to-reaction-set-up-mix-tube-by-finger-flicking-before-use-combin] and clean the reaction with 1× AmPure beads. Quantify the barcoding adapter-ligated DNA using a Qubit 4.0 fluorometer (Invitrogen, USA).\nPCR Barcoding.\nAttach barcodes to the adapter-ligated amplicons through PCR using the corresponding barcode primers and LongAmp Taq polymerase (LongAmp Taq 2×[href=https://international.neb.com/protocols/2012/09/05/protocol-for-longamp-taq-2x-master-mix-m0287], New England Biolabs, MA, USA) as per the manufacturer’s instructions[href=https://international.neb.com/protocols/2012/09/05/protocol-for-longamp-taq-2x-master-mix-m0287]. Clean-up the reaction mixture with 1.6× AmPure beads (Beckmann-Coulter, USA).\nPooling.\nPool the purified barcoded amplicons in equal proportions from all the barcoded samples.\nEnd repairing of pooled DNA.\nCarry out the end-repairing step with the pooled sample using the NEBnext ultra II end repair kit[href=https://international.neb.com/protocols/2015/08/13/protocol-for-use-with-nebnext-ultra-ii-end-repair-da-tailing-module-e7546] and clean up with 1× AmPure beads.\nAdapter ligation and sequencing.\nPerform 1D adapter a ligation for the end-repaired amplicons using NEB blunt/TA ligase[href=https://international.neb.com/protocols/2012/08/27/transfer-master-mix-to-ice-prior-to-reaction-set-up-mix-tube-by-finger-flicking-before-use-combin] (New England Biolabs, MA, USA) and clean up using 0.4× Ampure beads (Beckmann Coulter, USA). Elute the library in 16 μL of elution buffer for nanopore sequencing.",
    "Note: We used EXP-PBC096 and SQK-LSK108 kits procured from ONT (Oxford Nanopore Technology, UK) for barcoding and library preparation. Sequencing was performed on GridION X5 (Oxford Nanopore Technologies, Oxford, UK) using the SpotON flow cell (R9.4) in a 48 h sequencing protocol on MinKNOW 2.1 v18.05.5.\nAlternatives: Commercially available sequencing services can be availed for library construction and sequencing.\nGeneration of raw data, base-calling, and de-multiplexing\nNanopore generates raw sequencing reads in the fast5 format, which are then subjected to base calling and de-multiplexing using Albacore v2.3.1 (ONT, UK).\nNote: Base calling converts the data to fastq format which is the preferred format for downstream processing.\nTaxonomic assignment and species identification\nTiming: 30 min (for step 17)\nThe following describes the steps required for the identification and classification of Pseudomonas species present across insect populations.\nUpload the base-called read files to the EPI2ME platform via EPI2ME Agent software (ONT, UK).\nPerform the quality assessment and microbial classification to identify different Pseudomonas species present across samples using the Fastq 16S workflow.\nFirst, filter the reads by the quality and then subject to adapter trimming and barcode detection.\nCarry out the taxonomy assignment using BLAST in conjunction with the NCBI database while keeping minimum horizontal coverage of 30% and a minimum accuracy of 77% (ONT, UK).\nNote: Pre-configured alignment parameters such as identity and coverage of sequences should be used for analysis.\nCritical: Same parameters must be used to analyse all the samples included in the study.\nDiversity estimation\nTiming: 2–3 h (for step 19)\nDownload the taxonomic assignment results as .csv files for each sample for performing downstream analyses such as diversity and taxonomic differential abundance estimation.\nDetermination of taxonomic composition.",
    "Perform the rarefaction curve analysis using the modified function ‘ggrare’ (ranacapa R package4[href=https://www.wicell.org#bib4]) to determine whether sequencing depth was sufficient to discover all the Pseudomonas species present in the samples.\nTo identify and remove taxa that are unlikely to be of further use while modeling the data, filter out the species having very few counts based on their abundance level (minimum counts) across samples (prevalence). The purpose of the data filtering is to identify and remove features that are unlikely to be of use when modeling the data.\nPost filtration, scale and normalize the data for all the samples to get rid of uneven sequencing depths using the MicrobiomeAnalyst software with default parameters (https://www.microbiomeanalyst.ca/[href=https://www.microbiomeanalyst.ca/]). By default, features having zero counts across all the samples or those that appear only in one sample are removed from further analysis. Subsequently, data rarefaction is performed, followed by total sum normalization based on the total sum scaling method.\nThe community’s taxonomic composition and relative abundance can be visualized across samples using a stacked bar plot generated by MicrobiomeAnalyst (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2285-Fig3.jpg\nFigure 3. A representative stacked bar plot depicting the variation in Pseudomonas species composition, their relative abundance and diversity between samples\nNote: The top 10 taxa present in each sample can be plotted while the ones with very low read counts can be merged for better visualization of significant taxonomic patterns.\nDiversity estimation. Perform the diversity estimation using the ‘phyloseq’ package (R package5[href=https://www.wicell.org#bib5] version 1.19).\nDetermine the alpha-diversity to assess the species richness and diversity present within samples based on Chao1, Shannon and Simpson indices.7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8],9[href=https://www.wicell.org#bib9]\nCalculate beta-diversity index using the Jenson-Shannon divergence index followed by the Principal Coordinate Analysis (PCoA).",
    "Based on beta-diversity indices compare the taxonomic diversity across samples. This can be visualized as a 3D plot, with each point representing the entire microbiome of a single sample.\nNote: Samples with similar microbiome composition will be clustered together.\nIdentification of core microbiome.\nIdentify the Pseudomonas species that remain unchanged in their composition across samples based on their prevalence and relative abundance in insect populations using the ‘core’ function in R package ‘microbiome’.\nGenerate the heat map using MicrobiomeAnalyst software.\nPerform the hierarchical clustering analysis for insect populations based on the overall variation in species composition and abundance, using the ‘hclust’ function in R package ‘stat’.\nNote: For this, use the Jaccard index to measure the distance between samples, and Ward’s linkage algorithm for clustering.\nGenerate dendrogram for better visualization of the results obtained upon clustering analysis in MicrobiomeAnalyst.\nSemi-quantitative PCR (qPCR) for pesticide-exposed and -unexposed insects\nEstimate the LD50/LC50 (i.e., lethal dose/concentration that kills 50% of the test population) imidacloprid (Confidor 17.80% SL; Bayer AG, Germany) for the control insect populations (unexposed to stress) to ascertain their pesticide resistance/tolerance status.\nLD50 estimation.\nAnesthetize the control insects (adults) on ice for 3–4 min.\nApply the pesticide solution (0.5 μL/insect) onto anesthetized individuals using a micropipette and allow it to dry for 10–15 min.\nTest different concentrations of imidacloprid (active ingredient (a.i.) 0.5 ng–4.0 ng).\nRelease the imidacloprid treated insects onto susceptible host plants.\nCount the live insects 24 and 48 h after treatment.\nLC50 estimation.\nSpray the susceptible host plant with different concentrations of pesticide (imidacloprid) solution (ranging from 0.02%–0.5% a.i.) and let it dry for ∼30 min.\nRelease the control insects onto the imidacloprid-treated plants.\nCount the live insects 24 and 48 h after release.\nPerform probit analysis for LD50/LC50 data using SPSS Statistics v. 22.0.",
    "Note: Both LD50/LC50 experiments must be carried out in triplicates with at least 10 insects per replicate and for each concentration.\nGenerate a pesticide-resistant insect population in the laboratory.\nA pesticide-resistant BPH population can be generated in the laboratory by periodically exposing the control insect population (∼50; adults) to imidacloprid.\nInitially, for the first two generations, the control insects (∼50; adults) must be exposed to LC40 imidacloprid solution, and the concentration can be gradually increased to LC60 imidacloprid.\nSpray the pesticide solution twice a week, using a spray bottle.\nCollect the imidacloprid-exposed individuals at different time points (generations).\nNote: Although we have analysed the influence of imidacloprid on Pseudomonas titers in BPH, this protocol can be successfully implemented to estimate the impact of other pesticides on insect populations belonging to other taxa.\nExtract the total genomic DNA following the above-mentioned protocol from individual insects (adults) reared under imidacloprid stress.\nNote: Insects of different generations can be screened for pesticide-induced alteration in the Pseudomonas titers, while keeping lab-cultured insects as the experimental control.\nEstimate Pseudomonas titers in insect populations, post-exposure to the pesticide, using semi-qPCR.\nCompare the titers of Pseudomonas in the pesticide-exposed and -unexposed individuals.\nPseudomonas-specific primers Pseudo S2-F and Pseudo S2-R were used to amplify Pseudomonas (sequence details as mentioned before).\nUse the primers synthesized against the reference gene for normalization.\nNote: We have used the BPH Actin gene (Accession Number: KU196668.1) as the internal control for normalization. The primer pair used for Actin was ACT-mod F 5′-TGCGTGACATCAAGGAGAAGCTG-3 and ACT-mod R ‘5’-GTACCACCGGACAGGACAGT-3 and PCR conditions were as follows:\ntable:files/protocols_protocol_2285_4.csv\ntable:files/protocols_protocol_2285_5.csv\nCritical: Lesser number of cycles ensures that measurements of PCR products are made at the exponential phase of the PCR amplifications.",
    "Run the PCR products on 1% agarose gel and photograph using a gel documentation system (Alpha Imager, Cell Biosciences, UK).\nQuantify PCR yields based on the intensity of the band obtained for Pseudomonas, and normalize the reaction using the intensity of the PCR amplification of the reference (Actin) gene product from each sample.\nMeasure the relative intensities for each fragment using the Image Lab software 6.0.1 (Bio-Rad Laboratories, USA).\nNote: Annealing temperature will depend on the primers designed against the reference gene. We recommend using a Tm calculator provided by the primer vendor or the thermal cycler’s gradient feature to find the suitable annealing temperature for the primer pair being used."
  ],
  "subjectAreas": [
    "Genomics",
    "Immunology",
    "Microbiology",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}