{
  "id": 7423,
  "origin_website": "Bio",
  "title": "Imaging of Lipid Uptake in <em>Arabidopsis</em> Seedlings Utilizing Fluorescent Lipids and Confocal Microscopy",
  "procedures": [
    "Prepare plant growth mediumPrepare ½ MS media plates (see Recipes) considering that one plate will be needed for every 20-25 seeds. For each lipid, uptake should be quantified for at least five seedlings per experiment. Allow some extra seeds to account for possible damaged seedlings along the procedure.Note: Plates can be made in advance and kept at 4°C for about a month in a sterile bag. Seed sterilization and plant growth conditionsWe sterilize our seeds using chlorine vapor inside a desiccator, but the protocol can be used with any other sterilization procedure.Transfer seeds to 2-ml microcentrifuge tubes (maximum of 50 seeds/tube) marked with a pencil or chlorine-resistant pen and place in a circular rack.Place the rack with the seed-containing tubes (with lids open) and a 50-ml beaker with 25 ml of 14% hypochlorite solution into a desiccator jar placed in a fume hood (Figure 1A and 1B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4228/bioprotoc-11-22-4228-g001.jpgFigure 1. Processing of plant samples in lipid uptake assays. Seeds are placed into open 2-ml round bottom tubes (A) and taken to a desiccator jar together with 25 ml of sodium hypochlorite solution in a 50-ml glass beaker (B). Sterilization by chlorine gas is triggered by addition of 37% hydrochloric acid. (C) Sterile seeds are plated on square ½ MS plates and sealed with micropore 3M tape. (D) After stratification, plates are placed vertically in a growth chamber under a long-day regime. (E) Seedlings are ready for lipid uptake assays after five days of growth. (F) Seedlings are transferred to small glass jars containing ½ MS media and placed at 25°C. Lipid uptake assays start with addition of the desired NBD-lipid. (G-H) After washing, roots (G) or aerial parts (H) are transferred to microscope slides for visualization.",
    "Scale bars: A, F, and H, 1 cm; B and D, 5 cm; C and E, 2.5 cm.Carefully add 1 ml of 37% hydrochloric acid solution to the hypochlorite solution and immediately close the desiccator jar.Allow sterilization by chlorine fumes to proceed for a period of approximately 3 to 4 h before opening the container and immediately closing the tube lids as fast as possible to preserve sterility.Note: Sterilization periods longer than 4 h reduce seed viability. Take the tubes with seeds to a sterile bench and plate on square ½ MS plates (see Recipes), trying to cover the whole surface so that seedlings do not touch each other as they grow (Figure 1C).Close the plates with micropore tape and stratify for 2 to 4 days at 4°C before placing them vertically in a plant growth chamber at 22°C under a 16 h light/8 h dark light regime for 5 days (Figure 1D-1E).Note: Lipid uptake seems to be poor in plants coming directly from the dark period. Allow the seedlings to stand in the light for at least 90-120 min before starting the experiment. NBD-lipid uptake assayFor each lipid and plant line, prepare a glass jar with 250 µl of liquid ½ MS medium and incubate at 25°C for 5-15 min in a shallow water bath (Figure 2).Using precision tweezers, transfer 2-4 seedlings to each glass jar and shake gently. Avoid touching the part of the seedling that will be visualized later (Figure 1F and Figure 2).Start labeling by adding 1 µl of 10 mM C6-NBD-lipid (see Recipes) to each jar (40 µM final concentration in the medium) without touching the seedlings. Shake gently and incubate at 25°C for the desired time.",
    "Note: Incubation time depends on the permeability of the cell wall to the specific lipid, which depends on both fatty acid tail length and head group charge. For C6-NBD-sphingomyelin, 15 min are sufficient, while lipids like C6-NBD-phosphatidylethanolamine and C6-NBD-phosphatidylserine are first detectable after 3 h.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4228/bioprotoc-11-22-4228-g002.jpgFigure 2. Lipid uptake assays in plants. Using precision tweezers, 5-day old seedlings are transferred to small glass jars containing pre-warmed ½ MS liquid medium without touching the part of the seedling that will be visualized later. After addition of the desired NBD-lipid, seedlings are incubated for different time periods. Subsequently, seedlings are washed once with detergent-containing ½ MS medium and twice with medium without detergent, before transfer to microscopic slides. Roots are immobilized using a low-concentration agarose solution, while aerial parts are simply placed in water. Plant material that will not be visualized is removed with the help of a scalpel before the sample is covered with an objective glass and visualized using confocal microscopy.Remove the supernatant, being careful not to touch the seedlings, and add 400 µl of ½ MS liquid medium with 1% tergitol solution at 25°C. Shake gently and incubate for 2-3 min at 25°C.Repeat the wash step twice with 400 µl of ½ MS liquid medium without detergent at 25 °C, and keep the plants in ½ MS liquid medium at room temperature until visualization (not longer than 1 h). Note: At this point, plants can be tested for metabolic conversion of the fluorescent lipid analogs using lipid extraction and thin layer chromatography analysis, as previously described (Poulsen et al., 2015).  Microscopic visualizationVisualization of rootsTaking care not to touch the areas to be visualized, place a seedling with the root inside a 6-mm well on a microscopic slide and add a 3-µl drop of 0.",
    "5% agarose solution on top (Figures 1G and Figure 2).Use a scalpel to remove the aerial parts, and cover with an objective glass.Mount the slide on the microscope and adjust the focus on the area of interest using bright field mode with a 63× objective.Note: Exposure to laser light will cause bleaching. Therefore, it is recommended to adjust the focus in bright field mode before switching to fluorescent mode and immediately acquire an image. Switch to confocal acquisition with excitation at 488 nm and emission recording at 490-508 nm. Pinhole diameter should be below two airy discs (about 100 μm).Note: These settings are for lipids carrying an NBD group and will need to be adapted when using other fluorophores. Set imaging parameters (laser power, detector gain, or exposure time) to get a bright signal without overexposure. We typically use 20-40% laser power and a 4-time line average scanning to prevent sample bleaching and compensate for the low signal intensity by increasing the detector gain and lowering the offset. Under these settings, the signal is stable for 25-45 s before significant bleaching occurs.Acquire images without changing any of the set parameters and in a similar area and confocal plane for all plants (for an example, see Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4228/bioprotoc-11-22-4228-g003.jpgFigure 3. Examples of lipid uptake imaging in roots and aerial plant tissues. Seedlings (5-day old) were incubated with NBD-lipids for the indicated times and visualized by confocal microscopy after removal of excess lipid. (A) Time-course of a lipid uptake assay in roots and guard cells. Scale bars: roots, 25 μm; guard cells, 10 μm. (B) Examples of damaged roots. White polygons mark damaged areas. Scale bars: 20 μm.",
    "Visualization of leavesDrop 40-50 µl of water on a plain microscopy slide and use tweezers to place a seedling with the aerial parts inside the water (adaxial side up). Take care not to touch the areas to be visualized (Figure 1H and Figure 2).Remove the root using a scalpel and cover with an objective glass.Mount the slide on the microscope and locate cells using bright field mode with a 63× objective.Note: Exposure to laser light will cause bleaching. Therefore, we recommend adjusting the focus in bright field mode before switching to fluorescent mode and acquiring an image immediately. Switch to confocal acquisition with excitation at 488 nm and emission recording at 490-508 nm. Pinhole diameter should be below two airy discs (about 100 μm).Note: These settings are for lipids carrying an NBD group and will need to be adapted when using other fluorophores. Set imaging parameters (laser power, detector gain, or exposure time) to get a bright signal without overexposure. We typically use 20-40% laser power and 4-time line average scanning to prevent sample bleaching, and compensate for the low signal intensity by increasing the detector gain and lowering the offset. Under these settings, the signal is stable for 25-45 s before significant bleaching occurs.Acquire images without changing any of the set parameters and in a similar area and confocal plane for all plants (for an example, see Figure 3)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}