{
  "id": 17365,
  "origin_website": "Jove",
  "title": "Removal and Replacement of Endogenous Ligands from Lipid-Bound Proteins and Allergens",
  "procedures": [
    "1. Bla g 1 cloning\nObtain gene for cockroach allergen Bla g 1.0101 (residues 34-216), representing a single repeat of the MA domain. For the sake of simplicity, Bla g 1 will be used throughout the work to represent this single repeat, rather than the entire Bla g 1.0101 transcript.\nSubclone the Bla g 1 gene into the desired vector. In this study, the gene containing an N-terminal glutathione S-transferase (GST) tag coupled to a tobacco etch virus (TEV) protease cleavage site was inserted into a pGEX vector for expression as described previously11.\nTransform the Bla g 1 pGEX vector into BL21 DE3 E. coli cells.\n\t\nPrepare a 10 ng/µL stock of the desired vector.\nCombine 1 µL of 10 ng/µL DNA stock with 50 µL of BL21 DE3 cells as provided by the manufacturer.\nIncubate BL21 DE3-DNA mixture for 30 min on ice. Transfer to a 42 ˚C water bath for 1 min, then immediately transfer back on ice for an additional 1 min incubation.\nAdd 200 µL of LB media to the cells and incubate for an additional 1 h at 37 ˚C.\nPlate the transformed cells on LB-Agar plates containing 100 mg/L ampicillin and grow at 37 ˚C overnight.\n2. Initial expression and purification\nInoculate 1 L of LB media containing 100 mg/L ampicillin with a single colony of BL21 DE3 cells transformed with the Bla g 1 vector as described in 1.3. Grow at 37 ˚C overnight.\nOn the next day, harvest cells (OD600 ~1.5) via centrifugation at 6,000 x g for 10 min and resuspend in 2 L of 2x YT media containing 100 mg/L ampicillin. Allow cells to grow for an additional 1 h at 37 ˚C to an OD600 > 0.6.",
    "Induce protein expression through the addition of 0.5 mM IPTG. Transfer cells to 18 ˚C and incubate overnight.\nOn the next day, harvest cells as described in 2.2. The resulting cell pellet can be frozen and stored at -20 ˚C.\nResuspend pellet obtained from 1 L of culture in 50 mL of lysis buffer (50 mM Tris-HCl pH 8.5, 100 mM NaCl) containing 1 protease inhibitor tablet (or equivalent) and 1 µL of benzonase nuclease.\nLyse cells using a probe sonicator (500 W, 20 kHz) set to 30–50% power for 4 min with a 50% duty cycle. Keep the lysate in an ice bath during sonication\nCentrifuge lysate at 45,000 x g for 20 min. Discard insoluble fraction (pellet).\n\t\nRemove 28 µL of soluble protein. Combine with 7 µL of 5x SDS-PAGE buffer and store for SDS-PAGE analysis. Repeat this step for the GST column flow-through, wash, and elution fractions before and after incubation with TEV.\nApply soluble proteins (supernatant) to a glutathione resin column (~10 mL total bed volume) equilibrated in PBS pH 7.4.\nWash out any unbound proteins using 50 mL of PBS.\nElute GST-Bla g 1 using 50 mL of PBS containing 10 mM reduced glutathione.\nIncubate eluted protein with 0.2 kU TEV protease overnight at 4 ˚C, or room temperature for 6 h to remove GST tag.\n3. Endogenous lipid removal via reverse-phase HPLC\nCollect the cleaved Bla g 1 and concentrate it to ~2 mL using a centrifugal filter unit with a <10 kDa molecular weight cut-off.\n\t\nAdd <12 mL sample to the top of concentrator and spin at 5,000 x g for 10–15 min in a swing-bucket rotor.\n\t\tNOTE: Sample volume and spin speed will vary based on the specific filter and the type of rotor employed. Consult manufacturer documentation prior to use.",
    "Load the concentrate onto a 250 x 10 mm HPLC system equipped with a C18 reverse-phase chromatography column equilibrated with 97% buffer A (water, 0.1% trifluoroacetic acid) and 3% buffer B (acetonitrile, 0.1% trifluoroacetic acid).\n\tNOTE: Smaller columns may be used, but protein may have to be loaded and eluted using multiple cycles to accommodate the reduced binding capacity. When selecting a column ensure that the resin beads have a particle size of < 5 μm and pore size of >200 Å to permit effective separation of protein-sized molecules\n\tCAUTION: Trifluoroacetic acid is highly corrosive and should be dispensed within a fume hood using appropriate PPE (i.e., nitrile gloves, lab coat and goggles). Acetonitrile is both moderately toxic, volatile, and highly flammable, should be used and dispensed within a fume hood using appropriate PPE (i.e., nitrile gloves, lab coat and goggles).\nElute Bla g 1 using the protocol shown in Table 1 at a flow rate of 1.5–4.0 mL/min. Monitor the elution process using the fluorescence absorbance at 280 nm.\n\t\nCollect and pool Bla g 1 fractions. Bla g 1 normally elutes at >74% buffer B, or ~34–40 min.\n\t\tNOTE: Elution time will vary slightly depending on the flow rate or column size. Collect fractions based on A280 for best results.\ntable:\n﻿0,1,2\nTime (Min),Buffer A (%),Buffer B (%)\n0,97,3\n10,97,3\n25,35,65\n55,5,95\n65,5,95\n70,97,3\nTable 1: Elution protocol for Bla g 1. Table illustrating the elution gradient employed in the isolation of Bla g 1 using a C18 HPLC column.\nAliquot the sample into glass test tubes, filling no test tube more than halfway (~4 mL). Cover tubes with paraffin film and perforate the covering with two holes to allow venting.\n\t\nPrepare a separate 1 mL aliquot (test aliquot). This will be used to determine the expected yield.",
    "Freeze the samples and test aliquot by placing them in a -80 ˚C freezer for 1 h, or immersion in liquid nitrogen. In the case of the later, the tube must be rotated continuously to avoid test tube breakage due to expansion of the liquid phase upon freezing.\nDry the resulting delipidated protein samples using a lyophilizer. Dried protein may be stored at 4 ˚C for several months in a sealed container.\n4. Reconstitution of Apo- and cargo-loaded Bla g 1\nDetermine the anticipated Bla g 1 yield.\n\t\nResuspend lyophilized, delipidated (post-HPLC) test aliquot in 5 mL of refolding buffer, (50 mM HEPES pH 7.4, 100 mM NaCl, 2% DMSO).\nHeat the mixture in a water bath (500 mL beaker with 250 mL water and stir bar over a hot plate) to 95 ˚C. Vortex solutions intermittently and incubate at 95 ˚C for 0.5–1 h.\nRemove heat and slowly let the water bath equilibrate to room temperature (~1 h). Annealed protein can be stored in this form overnight at 4 ˚C if needed.\nPass annealed Bla g 1-lipid mixture through a 0.22 µM syringe filter to remove particulate matter.\nBuffer exchange the filtered protein 3x into PBS pH 7.4 using a centrifugal filter with 10 kDa cutoff as discussed in 3.1 to remove residual free fatty acids and organic solvent.\nAssess protein concentration using BCA assay or other preferred method such as UV absorbance. Use this to determine the anticipated yield for the remaining Bla g 1 aliquots.\nReconstitute Apo-  or cargo-loaded Bla g 1\n\t\nResuspend Bla g 1 aliquots in refolding buffer as described in 4.1.1.\nTo produce Apo-Bla g 1, repeat steps 4.1.2–4.1.6 to obtain desired yield.",
    "To load Bla g 1 with fatty acids, prepare 20 mM stock solutions of the desired fatty acid cargo in methanol or DMSO.  Then, skip to step 4.2.5.\nTo load Bla g 1 with phospholipids, prepare a 10 mg/mL stock of the desired cargo in chloroform inside a glass test tube.\n\t\t\nEvaporate the chloroform to produce a lipid film. Add PBS to the test tube to produce a final phospholipid concentration of 20 mM.\n\t\t\tCAUTION: Chloroform is harmful if inhaled or swallowed. Use in a chemical fume hood or employ respirator if inadequate ventilation is available. Employ nitrile gloves, lab coat and goggles when handling. Consult MSDS prior to use.\nRehydrate the lipid film by heating it above the phase transition temperature of the lipid cargo and vortexing until the solution turns cloudy. Note that sonication may be required to fully resuspend and rehydrate some cargoes.\nIf sonication is required, place the test tube in bath sonicator (100 W, 42 kHz) and sonicate at maximum power until cargo is resuspended. Alternatively, a probe sonicator (described in 2.6) may be used an 10–20% power with a 50% duty cycle.\n\t\t\tCAUTION: Sonication employs high frequency sound waves which may damage hearing. Employ noise-suppressing PPE (earplugs or mufflers). If possible, place sonicator inside sound-dampening cabinet or chamber.\nAdd the desired fatty acid or phospholipid cargo to produce a 20x molar excess of ligands relative to Bla g 1 based on the anticipated yield determined in 4.1. The total volume of organic solvent added in this step should not exceed 2%. Vortex to mix.\n\t\tNOTE: 1 L of Bl 21 DE3 cells typically yields ~0.25–0.4 nmol protein, corresponding to ~400 µM ligand per tube.\nAnneal the protein as described in 4.1.\n5. Confirming phospholipid cargo removal/loading via 31P-NMR",
    "Concentrate samples of Apo- or cargo-loaded Bla g 1 to >100 µM using a centrifugal filter unit as described in 3.1.\nRehydrate reference phospholipid in PBS buffer to final concentrations of 2, 1.5, 1, 0.5, and 0.25 mM.\nDilute samples 1:1 with cholate buffer (100 mM Tris pH 8.0, 100 mM NaCl, 10% w/v cholate) to a total volume of ~600 µL.\n\tNOTE: Cholate is employed in this step to fully extract and solubilize lipids from the Bla g 1 hydrophobic cavity. This ensures that the chemical environment surrounding the phospholipid headgroups is consistent between different samples, allowing for its quantitative assessment using 31P-NMR. The use of cholate can be substituted for  chloroform/methanol as described previously15.\nAcquire 1D 31P-NMR spectra of the cholate-solubilized Bla g 1 samples and reference phospholipid standards using a broadband probe.\n\tNOTE: The 31P-NMR spectra presented in this work were obtained using a 600 MHz spectrometer. However, previous studies employing similar techniques suggests that acceptable sensitivity can be achieved at fields strengths as low as 150-200 MHz15.\nProcess the resulting data using appropriate software16.\nObtain peak intensities using preferred NMR viewing software17.\nCompare the Bla g 1 31P-NMR spectra to those obtained for the phospholipid reference samples to confirm removal of endogenously bound ligands and/or binding of desired ligands based on the chemical shifts of the visible peaks (or lack thereof).\n\t\nConfirm full binding stoichiometry by comparing the peak intensity of the Bla g 1 spectrum to that of the phospholipid reference standards.\n6. Confirming Bla g 1 folding\nPrepare 0.5 µM samples of Bla g 1 in CD buffer (100 mM KH2PO4, buffer pH 7.5). Load 2 mL of the sample into a 10 mm CD cuvette with magnetic stir bar.",
    "Measure CD spectrum of Bla g 1 to confirm reconstitution of secondary structure. Ensure that Photomultiplier (PMT) voltage does not exceed manufacturer recommendations (generally 1 kV).\n\t\nMeasure CD signal from 260–200 nm at 25 ˚C with a data pitch of 0.2 nm and a scan rate of 20 nm/s with a data integration time of 1 s.\nIncrease the temperature in the CD cell from 25 ˚C–95 ˚C at a rate of 0.5 ˚C/min. Activate magnetic stir bar to ensure temperature is uniform across the sample.\nMonitor CD at 222 nm, taking readings every 2 ˚C.\nFit resulting data to a 2-state Boltzman curve to determine the melting temperature. Due to the high stability of Bla g 1, the melting temperature (MT25) was defined as the temperature at which the protein has lost 25% of its initial CD at 222 nm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}