{
  "id": 10712,
  "origin_website": "Jove",
  "title": "Methods for the Self-integration of Megamolecular Biopolymers on the Drying Air-LC Interface",
  "procedures": [
    "1. Instruments\nPolarization device\nTo construct a polarization device, provide a light source with a halogen lamp, a light guide, polarizers, a sample stage, an optical rail, rod stands, and a digital single-lens reflex camera (see Figure 1C and Materials List for the polarization device parts).\n2. Preparation of the Biopolymer Solution\nPolysaccharide solutions\nDissolve sacran7 (0.5 g) in pure water (100 mL) by stirring at ~80 °C for more than 12 h. During the dissolution, cover the container with plastic wrap to prevent evaporation. Prepare an aqueous solution of xanthan gum in the same manner.\nCool the solutions at ~25 °C to obtain 0.5 wt% aqueous solutions.\nCentrifuge the sacran solution to remove impurities (48,400 x g, 4 °C, 1 h, 3 times).\nMT solution\nPrepare a 0.5 wt% tubulin solution (1 mL) in a Britton-Robinson buffer (80 mM piperazine-N,N′-bis(2-ethanesulfonic acid) (PIPES); 1 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid (EGTA); and 5 mM MgCl2, pH 6.8) on ice8.\nUse 0.5 wt% tubulin solution (50 µL) and guanosine-5'-[(α,β)-methyleno]triphosphate (GpCpp) (5 µL) to prepare a GpCpp-containing tubulin solution (50 µL). Incubate at 37 °C for 3 h to obtain a stable MT nucleus.\n\t\tNOTE: The role of GpCpp is to support MT formation and to completely suppress the depolymerization of MT to tubulin.\nMix the 0.5 wt% tubulin solution (950 µL) and the GpCpp-containing tubulin solution (50 µL) at ~25 °C for 1 day to obtain a stable 0.5 wt% MT solution.\nDNA solution\nPrepare a 0.5 wt% DNA solution (1 mL) in Tris-EDTA buffer solution (10 mM Tris, pH 8.0, with 1 mM EDTA).\nKeep the 0.5 wt% biopolymer sample solutions at 25 °C for the drying experiment.\n3. Drying Experiments and Observation under Cross-polarized Light\nSolutions in a one-side-open cell (Figure 1A)",
    "Cut a silicon sheet (see Materials List) into an appropriate shape with a thickness of 1 mm (inner dimension of 5-15 mm, 1 mm, and ~20 mm; Figure 1A).\n\t\t\nAssemble a one-side-open cell composed of a silicon spacer with inner dimension of 5-15 mm, 1 mm, and ~20 mm and two non-modified glass slides (76 mm × 1 mm × 26 mm). Fix both sides of the cell with double clips in advance to keep the sample solution from leaking out.\nSlowly add each of the 0.5 wt% biopolymer solution (100-300 µL) using a ~1-mm pore-size pipette tip to each cell at ~25 °C. Remove air bubbles from the cells using a syringe needle.\nPlace the cells in an oven with an air circulator at 60 °C under atmospheric pressure for evaporation; the evaporation direction is opposite to that of gravity.\nObservations under cross-polarized light (Figure 1B-1C)\nProvide straight visible light via a 100 W halogen lamp with a flat-surface light source over a wide area (80 mm x 80 mm). Adjust the polarizers to 45° and 135° using the holders (Figure 1C).\nFix the positions of the light source, polarizers, sample stage, and camera using an optical rail and rod stands (Figure 1C). Place the sample stage between the two polarizers (the distance between the polarizers should be ~5 cm). Place the camera ~20 cm from the sample stage to allow focusing.\nAt given times, place the samples from step 3.1.3 between the polarizers on the stage parallel to the XZ-plane and cover the device with a black curtain; the actual device is shown in Figure 1C.",
    "Photograph the samples through linear crossed polarizers using a digital single-lens reflex camera with a standard zoom lens (see Materials List). Control the camera settings, such as focal distance, using computer software (see Materials List).\nSpatio-temporal analysis of the transmitted light intensity (Figure 1C)\nTo evaluate the change of the orientational order parameter in the drying process, collect photographs hourly for 24 h.\nMeasure the transmitted light intensity along the centerline in the Z-direction as a gray value using an image processing program (e.g., ImageJ).\nPlot a graph of the gray value as a function of the distance from the upper open side.\nMicroscopic observations under cross-polarized light (Figure 1D)\nTo check the methods, make microscopic observations with a polarization microscope equipped with a CCD camera9. Keep a first-order retardation plate in the light path. Control the conditions for the photos using a PC software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}