{
  "id": 18085,
  "origin_website": "Jove",
  "title": "Whole-brain Segmentation and Change-point Analysis of Anatomical Brain MRI—Application in Premanifest Huntington's Disease",
  "procedures": [
    "1. Atlas-based Whole Brain Segmentation\nData preparation\nConvert three-dimensional (3D) T1-weighted images, typically acquired with MPRAGE (magnetization-prepared rapid gradient-echo) sequence, from vendor-specific DICOM (Digital Imaging and Communication) format to Analyzed format. Note that the cloud computation requires users' data to be transferred to remote clusters. According to the Health Insurance Portability and Accountability Act (HIPPA), remove the patients' personal identification information from the image files.\n\t\tNOTE: MRICloud offers a DICOM-to-Analyze converter (https://braingps.mricloud.org/t1prep) for the file format conversion as well as the de-identification of personal health information.\n\t\t\nDouble-click to open Dcm2Analyze.exe. A popup window will open (Figure 1A).\nSpecify the input DICOM data directory path as input and Analyzed image path and file name as output.\nClick \"Go\" to complete the conversion.\n\t\t\tNOTE: The conversion needs to be performed for each individual patient, and it would be beneficial to output all converted images in one study folder for batch processing (1.2.2.1).\nMulti-atlas based T1 image segmentation using MRICloud19.\nLog-in \"Brain GPS\" (register for first-time users) from https://mricloud.org. Select \"Segmentation\" tool from the main menu (Figure 1B). There are two application programming interface (API) options under \"Segmentation\": \"T1-MultiAtlas\" for single T1 image segmentation, and \"T1-MultiAtlas Batch\" for batch processing. The change-point analysis requires large population data, and thereby, batch processing is often the choice.\nSubmit jobs on \"T1-MultiAtlas Batch\" API.\n\t\t\nCompress multiple Analyzed image files into a zip file. Click \"+.zip\" in Figure 1B to upload the zip file.\n\t\t\tNOTE: The current cloud portal limits the number of images to 30 in each zip folder. Large datasets can be separated into multiple zip folders to be processed. Special request can be made to accommodate more images per zip file. In the future, we may potentially increase the limited number or even remove the limit when more remote computational resources become available.",
    "Fill in the required fields in Figure 1B.\n\t\t\t\nProcessing server: Choose \"Computational Anatomy Science Gateway\".\nSlice Type: Choose from \"Sagittal\", \"Axial\", or \"Sagittal converted to Axial\".\n\t\t\t\tNOTE: \"Sagittal\" refers to images acquired with sagittal orientation with in-plane view in Anterior-Posterior and Head-Foot directions. \"Axial\" refers to images acquired axial orientation with in-plane view in Left-Right and Anterior-Posterior directions. \"Sagittal converted to Axial\" refers to images that were originally acquired in axial orientation but later converted to sagittal images (those are typically \"Axial\" images with long neck area).\nMulti-atlas library: Choose the atlas library with closest age range to the user data to optimize the segmentation accuracy. We provide prebuilt multi-atlas datasets18 with different age ranges, e.g., \"Pediatric 4-8yr\", \"Pediatric 8-12yr\", \"Adult 22-50\", and \"Adult 50-90\", as well as different atlas versions. Information about atlas versions can be found in https://braingps.mricloud.org/atlasrepo.\nCheck the job status through \"My job status\" (Figure 1C). Once the jobs are finished, a \"Download Results\" button will appear that allows users to download the segmentation results as a .zip file.\nVisualize the results. For single subject, the volumes obtained from the segmentation result can be visualized online (not feasible for batch processing results).\n\t\t\nClick \"View result\" button in Figure 1C. The webpage will turn to the visualization interface (Figure 1D). The axial, sagittal, and coronal views of the segmentation map are overlapped on the T1-weighted anatomical image. 3D rendering of the segmented brain structures are shown in the upper left window. Color of the overlaying segmentation map indicates the z-score of the structural volumes.\nAdjust the visualization options, including overlay ON/OFF, opacity of the overlay, zoom in and out, and slice positions from the upper right panel in Figure 1D.",
    "Group finest segmentation parcels into different granularity. In our atlases, we defined five levels of granularity with two types ontology relations18,30. A tree-view of the hierarchical multi-level anatomical definitions is shown in the lower left panel (Figure 1D). Click the level numbers to expand the structures at the corresponding ontology level. The segmentation maps will simultaneously switch to the corresponding ontology level.\n\t\t\tNOTE: Bi-monthly MRICloud workshops are help at Johns Hopkins University School of Medicine to offer hands-on tutorials of the online operations described above. Workshop Information can be found from https://braingps.mricloud.org/workshops.\nDownload the segmentation results for subsequent analysis. Unzip the results to a user study directory, e.g., put together the segmentation results from all the subjects in one study directory, each in their individual subject folders.\n\t\tNOTE: The results include\nexample.img: original T1 image in axial orientation.\nexample_MNI.img: T1 image in MNI space following the Talairach coordinates.\nexample_7Labels.img and example_7Labels_MNI.img: Coarse segmentation with 7 parcels (gray matter, white matter, cerebrospinal fluid, lateral ventricle, skull, and background) in native and MNI space, respectively.\nexample_283Labels_M2.img and example_283Labels_M2_MNI.img: fine segmentation with 283 parcels (atlas version V9B) in native and MNI space, respectively. The exact number of labels depends on the atlas version.\nexample_corrected_MNI_stats.txt and example_MNI_stats.txt: statistics of volumes of each brain parcels in native and MNI space.\nmultilevel_lookup_table.txt: Multilevel ontology definition of the brain parcels.\nPerform batch processing to obtain brain volumes in a population. Use an in-house Matlab (www.mathworks.com) batch processing script to extract brain volumes from individual result folders and combine the volumetric data of all subjects at all granularity levels to a spreadsheet. A graphic user interface (GUI) is used to specify the input and output.\nOpen Matlab.exe, run Main.fig, and a GUI will pop out (Figure 2A).",
    "In the \"T1 Volume extraction from MRICloud\" panel (upper panel in Figure 2A), specify the inputs, including the study directory where the downloaded the segmentation results are saved (see 1.2.5); and the multi-level lookup table file path and file name.\nSpecify the output spreadsheet file path and file name where the volume data will be write to.\nClick \"Extract volume\" button to run the analysis. Results can be checked in the user-defined spreadsheet.\n\t\tNOTE: In addition, an R package is developed to process the MRICloud outputs and perform further statistical analysis, provided by Dr. Brian Caffo31. The package can be downloaded from https://github.com/bcaffo/MRIcloudT1volumetrics.\n2. Change-point Analysis of Volumetric Data\nNOTE: Please refer the theory and mathematical details of the change-point model to our previous publications21,24,23. Briefly, for HD data, a regression model is established to define a critical change-point (in terms of CAP score), starting from which, the linear regression between CAP and volume becomes statistical significant, while correcting for the effects of patient's age, gender, and intracranial volume. In-house Matlab scripts, along with a GUI (Figure 2A, lower panel), was developed to compute the change-points for individual structures and perform statistical analysis. The scripts are available to users upon request.\nCalculate change-points for individual brain structures.\nIn the \"Change-point analysis\" panel in Figure 2A, specify the file path and name of the multilevel volume spreadsheet, which is generated according to 1.3.\nSpecify the file path and name of the output text file, which the change-point results will be written to.\nChoose the level of granularity and type of ontology definition in the drop-down box (Level 1 - 5), at which the change-point analysis will be performed.",
    "Click \"Calculate change-point\" button to perform the change-point analysis, as described in reference23, and the resultant change-points will be saved in the output text file.\nStatistical evaluations of the change-points.\nIn the Matlab GUI (Figure 2A, lower panel), specify parameters for statistical tests, including the number of permutation (default 10,000), number of bootstrap (default 10,000), and p-value threshold (after the FDR correction, default 0.05).\nClick \"Statistical test\" button to run the tests. After this step, the p-value (by permutation test), before and after false-discovery rate (FDR) correction, as well as the standard deviation and the 95% confidence interval (by bootstrap) of the change-points will be written to the output text file as extra columns. See details of statistical test procedures in23,24.\nGenerate change-point maps (optional). In the Matlab GUI (Figure 2A, lower panel), click \"Map change-point\" button to generate change-point maps. Statistically significant change-point values will be mapped onto the MNI-space anatomical image to visualize the spatial pattern. This mapping can be done at different granularity levels, depending on the anatomical level specified in 2.1. The change-point maps can be overlaid on T1-weighted images using MRIcro (Figure 2B) (http://www.cabi.gatech.edu/mricro/mricro/).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}