{
  "id": 4067,
  "origin_website": "Cell",
  "title": "Protocols for assessing neurodegenerative phenotypes in Alzheimer’s mouse models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nParaffinization of the brain tissue\nTiming: 1 day\nParaffinization of fixed tissues depends on the tissue and species. The following protocol is optimized for the mouse brain.\nPlace the fixed brain in a large size plastic paraffin cassette (FisherScientific, Cat #; 15-182-706).\nSet the cassette to the tissue processor.\nProcessing method is as shown below in the case of the adult mouse brains.\ntable:files/protocols_protocol_778_3.csv\nTransfer the plastic cassette to the embedding center and immerse in paraffin pool (Lecia, Cat #; 39602004).\nTake out the brain samples from the cassette and place them in the metal base molds for embedding.\nUse 38 × 25 × 12 mm (Electron Microscope Science, Cat #; 62528-38). This mold can fit 4–5 brains on one block.\nPut a small amount (∼1/3) of paraffin in the molds beforehand.\nPlace multiple paraffinized brains in the mold (Figure 1[href=https://www.wicell.org#fig1]B).\nGently move the mold onto the cold plate for 5–10 s to form a thin layer at the bottom of the mold to anchor the brain in position. Pour more paraffin to the top of the mold.\nPut the lid of the plastic cassette on the mold and fill with paraffin until the cassette’s surface is completely covered.\nCool on the cold plate or ice for at least 30 min.\nCut extra paraffin attached on the side and gently peel off the paraffin block from the mold.\nConfirm an absence of cracks in the paraffin block. Troubleshooting 1\nStore the paraffin blocks at ambient temperature until use.\nCritical: When you embed multiple brains in one block, you should include both controls and experimental groups in the same block. Do not embed multiple brains of the same genotype in the same block.\nSectioning of the brain\nTiming: 3–5 h per brain block",
    "Set the paraffin block in a microtome (Lecia, Cat #; RM2235) at an appropriate cutting angle (5 degree) and in a parallel position to the blade.\nWe cut sagittal sections in 10 μm thickness and coronal sections in 16 μm thickness.\nSection with right handle; course tune with the left handle.\nWhen not sectioning, secure the blade cover and lock the handle to avoid injuries.\nFill deionized water in the flotation workstation water bath (Fischer Scientific, Cat #; 22-047-234), and set the temperature depending on the block condition and thickness of sections. We use 42°C for 10 μm sections and 44°C for 16 μm sections.\nPrepare the paraffin block for sectioning.\nSection the paraffin block (usually 20–30 sagittal sections for the cerebral cortex) until you can see the entire brain structure of at least one sample on the section, which will be labeled as section #1.\nSection slowly and pick up each section at a time using a small brush in the left hand. Bring the section to the water bath by putting the section on the curved forceps and gently float the section on the water surface. Troubleshooting 2\nLet the section extend for a few seconds.\nDo not let it float in water for an extended period as paraffin may melt completely.\nPick the section on the slide and leave it vertically against the wall for a minute to drain residual water off the slide.\nPause point: Sectioning can be paused for up to 1 h if needed. Do not move or take out the paraffin block from a microtome, and cover the paraffin block with a piece of Saran wrap to prevent it from drying up. When you resume sectioning, the block should be wetted with a piece of wet Kimwipes.",
    "Collect all sections from the block (for sagittal section blocks, we usually cut at least 300 sections at 10 μm; for coronal section blocks we usually collect 320 sections at 16 μm).\nAfter drying completely > 12 h at room temperature (22°C–25°C), store the slides in plastic slide cases (e.g., BOX F/100 slides lab craft band, Fisher, Cat #; 03–446) until use.\nCritical: When you prepare the slides, do not include detailed information (e.g., genotype, mouse ID, or age) on each slide. Label the slides with serial section numbers only. Make an index slide with all information in every 50th or 100th slide. This step will allow experiments to be done in a genotype blind manner.\nSample coding method for genotype blind experiments and data analysis\nTiming: 10 min\nTo avoid experimenter bias, we recommend performing experiments in a genotype blind manner. Following is a practical method to code and decode slides for histological experiments (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/778-Fig2.jpg\nFigure 2. A practical method of sample coding for genotype blind analysis\nSelect the slides for histological analysis by Experimenter 1. Usually 6–9 sections from 1 block (every 30–40th sections, 300–400 μm apart from each other). Do not mark any genotype or set the group on the slides. Mark only section number.\nProvide information about the slides (e.g., mouse ID, genotype, age, type of staining) to Experimenter 2.\nCode slides by Experimenter 2.\nCode should omit all pertinent information of the sample.\nMark only code and type of experiment/immunostaining on the slide. Following is a coding example.\ntable:files/protocols_protocol_778_4.csv\nPerform all histological analysis and quantification by Experimenter 1.\nAfter finishing the experiment and data analysis, Experimenter 1 provides raw data file to Experimenter 2 via email.",
    "Experimenter 2 then releases all coding information, such as block number, age, mouse ID, genotypes, etc. For the record, we strongly recommend keeping all unprocessed raw data file.\nAlternatively, Experimenter 1 performs all histological experiments, and Experimenter 2 performs counting/analysis in a genotype blind manner. After finishing all experiments and data analysis, coding information can be released.\nAlternatively, samples can be coded in early stages. For example, brain samples can be coded when mice are sacrificed, when brains are embedded in the paraffin or frozen block, or when brain sections are generated.\nCritical: All data/code should be transmitted using electrical methods, e.g., email, eLab archive. It is highly recommended to include the PI or an independent 3rd person in the email chain.\nNissl staining of brain sections\nTiming: 2–3 h\nCresyl violet is an organic compound that can stain the nucleoli and the rough endoplasmic reticulum of neurons. Nissl staining followed by stereological quantification can be used to measure the area or calculate volume of the region of interest in the brain, e.g., the cerebral cortex for AD neuropathology (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/778-Fig3.jpg\nFigure 3. A Nissl-stained sagittal mouse brain section showing the area of the neocortex outlined by a blue line and the area of the hippocampus outlined by a red line\nScale bar: 1 mm.\nPick 6–7 slides of sagittal brain sections (every 40th, 400 μm apart) from each block, and bake the slides for 1 h at 55°C–60°C to remove extra paraffin from sections.",
    "Deparaffinize and rehydrate the sections by sequential immersion in the following reagents. We usually use 200 mL of each solution in glass staining dishes (Electron Microscope Science, Cat #; 71420-25). Completely immerse the sections for 4 min each, and gently lift and submerge the sections every 1 min in each solution. All procedure should be performed under the fume hood.\nHistoclear (or Xylene) twice\n50% Histoclear/50% Ethanol\n100% Ethanol twice\n95% Ethanol in distilled water\n70% Ethanol in distilled water\n50% Ethanol in distilled water\nDistilled water (2 min, only soak)\nPause point: Sections can be stored in distilled water for up to 30 min, before staining.\nImmerse the rehydrated sections in 0.5% cresyl violet acetate (8 min, soak under the fume hood).\nRinse in distilled water.\nPause point: Sections can be stored in distilled water for up to 30 min, before dehydration steps.\nRinse sequentially in 50% EtOH, 75% EtOH, 90% EtOH, 100% EtOH twice, and 50% Histo-clear/50% EtOH. Troubleshooting 3\nDehydrate the sections on Histoclear for 2 min, twice.\nMounting with Permount mounting solution (Fisher Scientific Permount Mounting Medium, Cat#; SP15-500).\nDrop off Histoclear as much as possible and wipe out Histoclear solution using Kimtex wipers without touching brain specimens.\nApply 4–5 drops of Permount mounting solution on the slide.\nPut cover glass (Fisher Scientific, Cat #; 12-548-5M) on the slide.\nPush off bubbles and remove extra Mounting Medium.\nDry the mounted slide glass under the hood for > 16 h.\nNote: If you are using a new batch of cresyl violet acetate solution, prepare 1–2 extra slides and optimize staining time for desired staining intensity. To avoid dye stains on glass slides, you could also use a 50-mL tube to rinse after cresyl violet staining.\nImmunohistochemical analysis of for NeuN, GFAP, and Iba1\nTiming: 2 days",
    "Immunohistological analysis followed by stereological quantification is critical for evaluating the degree of pathological neurodegenerative changes and associated gliosis in the mouse brain. For quantitative analysis, immunostaining with good quality antibodies is critical to obtain conclusive results. We use an anti-NeuN antibody to stain the nucleus of neurons in the brain. Anti-GFAP antibody, an astrocyte-specific marker, can be used to quantify astrogliosis in the brain. In the case of progressive astrogliosis, upregulated GFAP-immunoreactivity is shown in an intracellular intermediate filament of astrocytes, and its expression is upregulated in several disease conditions. Iba1, a microglia-specific marker, can be used to detect and evaluate progressive microgliosis in the brain. Since antibodies for NeuN, GFAP, and Iba1 are very specific and expression levels of NeuN, GFAP, and Iba1 are relatively high in the brain, no antigen retrieval step is necessary.\nPick 6–7 slides of sagittal brain sections (every 40th, 400 μm apart) from each block, and bake the slides for 1 h at 55°C–60°C to remove extra paraffin from sections.\nDeparaffinize and rehydrate the sections as described above (Step 27).\nPause point: Sections can be stored in TBS for up to 30 min, before permeabilization.\nPermeabilize the tissue on TBSTx (TBS in 0.1% TritonX-100) for 15 min with gentle shaking (50 rpm).\nRinse the slides with distilled water twice and then TBS once, for 2 min each.\nQuench endogenous peroxidase activity with 0.3% H2O2 in Methanol (use a fresh batch) at room temperature for 20 min with gentle shaking (50 rpm).\nRinse the slides in distilled water (X2) and TBS for 5 min each.\nPlace the slides on Immuno Stain Moisture Chamber (Electron Microscope Science, Cat #; 62010-37).\nPut pieces of paper towel and soak it with distilled water to humidify the chamber.",
    "Isolate brain sections on the slide with PAP Pen (Electron Microscope Science, Cat #; 71310) to save antibody solutions in the following steps.\nApply ∼300 μL blocking solution (e.g., 5% normal goat serum in TBS) on sections at room temperature for 1 h.\nRemove the blocking solution and apply primary antibody (200–250 μL to cover 4 sagittal section brains in one slide). Incubate the slides at 4°C for 16 h.\nWe use 1/400 dilution for NeuN antibody (Millipore, Cat #; MAB377), 1/500 dilution for GFAP (Sigma-Aldrich, Cat #; G6171), and 1/500 dilution for Iba1 (Wako, Cat #; 019–19741) in TBSTx solution.\nRinse the slides in TBS at room temperature for 5 min, 3 times.\nApply 1/400 diluted biotinylated secondary antibody in 1% normal goat serum/TBS on the brain sections (250 μL per slide) and incubate at room temperature for 1.5 h.\nAfter 1 h (at least 30 min before finishing secondary antibody application), prepare ABC solution (Avidin/Biotin-HPR Kit, Vector Laboratories, Cat #; PK-6100): Reagent A two drops + Reagent B two drops in TBS 5 mL (300–400 μL per slide).\nRinse the slide in TBS for 5 min, 3 times.\nApply ABC solution (300–400 μL per slide) and incubate the slide at room temperature for 1 h.\nRinse the slide in TBS for 5 min, 3 times.\nPrepare DAB/Peroxidase solution (Vector Laboratories, Cat #; SK-4100) just before use. 400–500 μL of DAB solution is needed per slide.\nAdd 2 drops of Buffer Stock solution in 5 mL distilled water and mix well.\nAdd 4 drops of DAB and 2 drops of H2O2.\n(Option) add 2 drops of Nickel Solution for black colorization for the positive signal.\nIncubate slides in DAB solution, at room temperature for 3–10 min.",
    "Critical: To evaluate progressive astrogliosis in multiple samples, such as different age and genotype groups, using the same amount of time for color development is essential to reduce variation among different batches or different age and genotype groups.\nRinse the slide in distilled water, briefly twice.\n(Option) Counterstaining with hematoxylin (Fisher Scientific, Cat #; SH26-500D) for GFAP or Iba1 staining for 5 s, and rinse in distilled water, twice.\nPause point: Sections can be stored in distilled water for up to 30 min, before staining.\nDehydrate the sections as described above (2 min each; the opposite direction of step #27).\nMounting with Permount mounting solution as we described above (Step 32).\nDry the mounted slide glass under the hood (usually for 16 h).\nImmunostaining of active caspase-3\nTiming: 2 days\nExamination of apoptosis in the brain is a critical step to determine whether there is ongoing programmed cell death. Active Caspase-3 immunoreactivity labels the cleaved form of Caspase-3, which is the main executioner of apoptosis (Riedl and Shi, 2004[href=https://www.wicell.org#bib11]). The active Caspase-3 staining requires antigen retrieval, which is necessary to achieve good quality immunostaining for stereological quantification.\nPick 7–9 slides (every 30th section, 300 μm apart) from each block, and bake the slides for 1 h at 55°C–60°C to remove extra paraffin from sections.\nDeparaffinize and rehydrate the sections as described above (Step 27).\nPause point: Sections can be stored in PBS for up to 30 min, before staining.\nPermeabilize the tissue on PBSTx (PBS in 0.1% TritonX-100) with 0.1% Sodium citrate for 15 min with gentle shaking (50 rpm).\nRinse the slide with distilled water twice and PBS, for 2 min each.\nAntigen retrieval procedure\nPour 10 mM citric acid antigen retrieval buffer into a plastic jar.",
    "Put the slides in the jar, and boil in the microwave for seconds.\nAdd fresh antigen retrieval buffer on the top (to prevent the section from drying up).\nBoil in a microwave with 60% power (∼600W) for 3 min.\nBoil in a microwave with 20% power (∼200W) for 2 min.\nBoil in a microwave with 10% power (∼100W) for 10 min.\nCool down slide at room temperature for 20–30 min.\nCritical: Brain sections should be submerged under the antigen retrieval solution the entire time during all boiling procedures. Keep watching the level of solutions and add more antigen retrieval solution if needed.\nFollow the remaining steps for immunostaining as described above. We use anti-active Caspase-3 primary antibody (Cell Signaling, Cat #; 9661S) in 1/250 dilution.\nTUNEL (terminal deoxynucleotidyl transferase dUTP nick end labeling) assay\nTiming: 5 h\nTUNEL assay, a method to detect DNA fragmentation in the late stage apoptotic cells (Gavrieli et al., 1992[href=https://www.wicell.org#bib4]), is performed in addition to active Caspase-3 immunostaining to confirm apoptotic cell death. Immunostaining can be used following the TUNEL assay to identify specific cell types of apoptotic cells. It is highly recommended to include positive controls (e.g., brain sections of model mouse showing robust neurodegeneration or DNaseI treated brain sections).\nPick 7–9 slides (every 30th section, 300 μm apart) from each block, and bake the slides for 1 h at 55°C–60°C.\nDeparaffinize and rehydrate the sections as described above (Step 27).\nPause point: Sections can be stored in PBS for up to 30 min, before staining.\nPermeabilize the tissue on PBSTx (PBS in 0.1% TritonX-100) with 0.1% sodium citrate for 15 min with gentle shaking (50 rpm).\nRinse the slides with distilled water (X2) and PBS, for 2 min each.",
    "Optional: If you are going to perform immunostaining after the TUNEL assay, you could perform an antigen retrieval step here, if needed.\nPlace the slides on Immuno Stain Moisture Chamber (Electron Microscope Science, Cat #; 62010-37) or a similar incubation chamber with aluminum foil to avoid light exposure during the following procedures.\nPut pieces of paper towels and sock them with distilled water to humidify the chamber.\nIsolate sections on the slide using a PAP Pen (Electron Microscope Science, Cat #; 71310) to save the TUNEL reaction solution in the following steps.\nApply ∼300 μL blocking solution (e.g., 5% normal goat serum in TBS) on sections at room temperature for 1 h.\nPrepare TUNEL reaction mixture (In Situ Cell Death Detection Kit, Roche, Cat #; 11684795910):\nMix 5 μL of TdT enzyme solution with 45 μL of Label solution. 50 μL of TUNEL reaction mixture is needed for each slide. Troubleshooting 4\nFor negative reaction control, prepare 50 μL of Label solution only.\nApply 50 μL of TUNEL reaction mixture on the brain section.\nCritical: To prevent sections from drying up, gently cover the entire brain section with a piece of parafilm. From this point on, avoid light exposure until analysis is completed.\nIncubate the section at 37°C for 1 h.\nRinse the slide with PBS twice, for 2 min each.\nOptional: If you are going to perform immunostaining after the TUNEL assay, start from here and follow the standard or specific immunostaining protocol for each primary antibody.\nApply 300 μL of DAPI staining solution and incubate at room temperature for 10 min.\nRinse the slide with PBS twice, for 2 min each.\nMount with VECTASHIELD mounting media (Vector Laboratories, Cat #; H-1000-10) or any compatible antifade mounting medium and keep in the dark at 4°C until analysis.",
    "Making cryo-preserved blocks for frozen brain sections\nTiming: 2 days\nCompared to paraffin brain sections, immunoreactivity or immunosensitivity is higher in frozen brain sections, so it is more likely to succeed in immunofluorescent double-labeling, which allows visualization of two different target antigens using different fluorophore combinations. We recommend using this protocol to achieve high quality fluorescent double labeling. Images can be analyzed on confocal or fluorescent microscopes. However, compared with colorimetric IHC on paraffin sections, fluorescent signals usually bleach out quickly, so long-term storage is not feasible with this method. It is recommended to perform the experiment using a small number of sections in order to achieve high quality, consistent results.\nAfter perfusion, dissection, and post-fixation step as described above, replace fixative solution with 15% sucrose/PBS at 4°C, 3–6 h.\nExchange solution to 30% sucrose/PBS at 4°C. It usually takes the brain more than one night to sink to the bottom (completely cryo-preserved).\nAt least 30 min before embedding, prechill ethanol or isopentane on dry ice.\nWash the brain tissues briefly with PBS and OCT compound.\nPlace brains in the disposable plastic base mold (Electron Microscope Science, Cat #; 62352-37).\nKeep the mold on ice.\nUsually, 4 brains in the same mold.\nFill up OCT compound in the mold.\nQuickly freeze it in Dry ice/EtOH or Dry ice/isopentane freezing medium, and store at −80°C until further use.\nCryosectioning of mouse brains\nTiming: 3–5 h per one block\nSet the blade in the cryostat (Lecia, Cat #; CM1860) at an appropriate angle and plane.\nTemperature setting is around -18°C–20°C.\nThe cutting angle should be around 5 degrees.\nSection thickness is usually 12–16 μm.\nBlade safeguard should be placed, and the handle should be locked until sectioning for your safety.\nAvoid opening the chamber shield for an extended period.",
    "Prepare slide warmer and set the temperature at ∼40°C.\nPrepare dry ice and place a slide box on top of it.\nPlace the cryo-preserved block int the cryostat 1 h prior to sectioning.\nCut the section slowly and pick up the sections one at a time using a small brush in the left hand. Troubleshooting 5\nPick the section on a slide and store it in a pre-chilled slide box.\nCollect all sections from the block.\nStore slide in a slide box at −80°C until use.\nCritical: When you prepare the slides, do not include pertinent information (e.g., genotype, mouse ID, or age) on the slide. Label the slide with serial section number only. Make an index slide with all information in every 50th or 100th slide. This step will allow experiments to be done in a genotype blind manner.\nImmunofluorescent staining of frozen brain sections\nTiming: 2 days\nPick 6–7 slides (every 40th, 400 μm apart) from each block, and leave on the bench (room temperature) for 5 min.\nRinse in PBS wash at room temperature for 5–10 min to remove extra OCT compounds.\n(Option) Antigen retrieval\nPour 10 mM Sodium citrate in plastic jar (∼300 mL).\nPut the slides in the jar, and boil in microwave for 5 min. Occasionally add fresh citric acid on top to prevent the sections from drying up.\nCool to room temperature (usually takes 15–20 min).\nDip in PBS.\nPlace slides in Immuno Stain Moisture Chamber (Electron Microscope Science, Cat #; 62010-37).\nApply ∼300 μL blocking solution (e.g., 5% normal goat serum/1% BSA/0.1% Triton-X 100 in PBS) and incubate at room temperature for 1 h.",
    "Remove the blocking solution and apply primary antibody with proper dilution depending on the antibody (200–250 μL to cover 4 sagittal section brains on one slide). Incubate the slide at 4°C for 16 h.\nRinse the slide in PBS at room temperature for 5 min, 3 times.\nApply 1/300 diluted Alexa Fluor-labeled secondary antibody in 3% normal goat serum/PBS on the brain sections (300 μL per slide) and incubate at room temperature for 1.5 h.\nRinse the slide in PBS at room temperature for 5 min, 3 times.\n(optional) Apply 300 μL of DAPI staining solution (1/1000 dilution in PBS from 300 mM DAPI stock solution) and incubate at room temperature for 10 min.\nRinse the slide in PBS at room temperature for 5 min, 3 times.\n(Optional) To remove autofluorescence, apply 500 μL Sudan Black solution for 10 min. This step is not required for embryonic brain immunostaining. After that, rinse the slides in PBS at room temperature for 5 min, 3 times.\nMounting with VECTASHIELD mounting media (Vector Laboratories, Cat #; H-1000-10) or any compatible antifade mounting medium and keep in the dark at 4°C until analysis.\nQuantitative analysis of cortical volume using stereological methods\nTiming: 10 min per section",
    "Age-dependent volumetric changes in the cerebral cortex are a key neuropathological feature of AD. We use Nissl-stained serial sections to measure the area of the neocortex or the hippocampus of each brain section using the BioQuant Lifesciences software, and then calculate the entire neocortical or hippocampal volume (Figure 3[href=https://www.wicell.org#fig3]). Alternative methods include ImageJ or other software that measures the brain subregion of interest. The measurement of other brain subregions can be done by specific immunostaining, e.g., DARPP-32 staining to label medium spiny neurons in the striatum, Calbindin staining to label Purkinje cells in the cerebellum, TH staining to label dopaminergic neurons in the substantia nigra.\nStart “BIOQUANT Lifesciences” application.\nPlace the slide of Nissl stained brain sections under the 4× Objective lens with a live camera, and move to the first brain section.\nOpen ‘Stereology Tools’ and make a new file on an optical fractionator project.\nOn the ‘Measure’ menu, select manual measurements, and set up the ‘Parameters’.\nCheck ‘Save TOPO’ option.\nSelect TOPO Array, D1.\nSet Magnification as 4×.\nSet the A1 (sampling Area) option by double clicking on ‘Select Arrays’ menu.\nOn ‘Stereology Tools’ windows, click ‘1st’ icon to load Stereology defaults and ‘∗’ to set a landmark.\nClick the ‘Manually Trace Area’ icon and draw the area of neocortex (e.g., blue lines in Figure 3[href=https://www.wicell.org#fig3]), hippocampus (e.g., red lines in Figure 3[href=https://www.wicell.org#fig3]) or region of interest. If you need two screens to complete the drawings, first click “W” and move the stage, followed by clicking “R”. Then you can restart the drawings. Click “SPACE” key if you almost finished in order to engulf the drawing.\nArea will be displayed on the data panel window.\nVolume of the neocortex is calculated as follows.",
    "Average volume of the neocortex per section = [average area of the neocortex in the section] × [thickness of the section]. For example, if the section is 10 μm in thickness, we would multiple 10 with the average area of the neocortex per section, which is obtained by averaging the area of the neocortex quantified in all sections (typically 7 sections).\nVolume of the neocortex = [average volume of the neocortex per section] × [number of sections containing the neocortex]. We typically collect ∼300 sections from wild-type mice, and we quantify the area of the neocortex in every 40th section (total 7 sections).\nThen convert to mm3 as unit.\nMultiply 2 to convert to the volume of the neocortex representing both hemispheres.\nQuantitative analysis of cortical neuron number using stereological methods\nTiming: 20–25 min per section per cortex (one hemisphere)\nNeurons can be differentiated from other cell types by the presence of neuron-specific proteins such as MAP2 and NeuN, but immunostaining using an antibody against a nucleus protein (NeuN) makes it easier to count accurate cell number compared to an antibody against neurite proteins (MAP2). We use an anti-NeuN antibody to count the number of cortical neurons. This methodology can be broadened to other subtypes of neurons when you choose an appropriate antibody against a specific protein (e.g., GAD67 for inhibitory neurons, Tbr1 for deep layer cortical neurons, or TH for dopaminergic neurons). We use the Bioquant Lifesciences software for the stereological quantification.\nStart “BIOQUANT Lifesciences” application.\nPlace the slide of NeuN-immunostained brain sections under the 4× Objective lens with a live camera, and move to the first brain section.\nFind and set a suitable landmark point (a reference place for the measurement).",
    "Delineate the region of interest (e.g., neocortical area for cortical neuron, and hippocampal CA1 region) and measure an area of the delineated region as indicated in the previous section (Figures 4[href=https://www.wicell.org#fig4]A and 4C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/778-Fig4.jpg\nFigure 4. Stereological counting of NeuN-immunoreactive neurons in the cerebral cortex\n(A) Representative image of the neocortex (marked with a blue outline) overlaid with 500 × 500 μm sampling distance.\n(B) Representative image of one dissector (100 × 100 μm) containing NeuN+ neurons that were counted (marked by yellow X).\n(C) Representative image of hippocampal CA1 area (marked with a blue outline) overlaid with 100 × 100 μm sampling distance.\n(D) Representative image of one dissector (50 × 50 μm) containing NeuN+ neurons that were counted (marked by yellow X).\nScale bar: 100 μm.\nSelect the size of the grid, and place the grid randomly in the entire specified region. (Figures 4[href=https://www.wicell.org#fig4]A and 4C)\nWe use 500 × 500 μm for cortical neuron or 100 × 100 μm for small brain subregions, such as hippocampal CA1 region.\nThe grid size can be changed depending on the size of region of interest and distribution of target cell type.\nApproximately 40 and 15 optical dissectors were used for the entire neocortex area and hippocampal CA1 region, respectively.\nChange to the 40× objective lens for neuron counting.\nSelect the size of the dissectors. We use 100 × 100 μm (20% of area) for cortical neurons or 50 × 50 μm (25% of area) for hippocampal CA1 region (Figures 4[href=https://www.wicell.org#fig4]B and 4D).",
    "Count the NeuN-positive cells in the clear focus according to user’s own rules. For example, if the nucleus of the neuron is outside of the left and bottom Red line, do not count it. If the nucleus of the neuron is within the top and right Green Line, count it.\nGo to the next counting frames on the same section, and count the cells in the same way.\nRepeat these steps for the rest of dissectors. Write down the number for the current array and get the total number for this section.\nThe total number of neurons is calculated as follows.\nQ × t/h × 1/asf × 1/ssf Q = the total number of cells actually counted in the counting dissectors of all the sections analyzed h = the height of the dissector t = the mean thickness of the sections asf = the area sampling fraction (the ratio of the counting frame area to the sampling grid area) ssf = the section sampling fraction (the ratio of the number of sections analyzed to the total number of sections in the entire structure).\nThe coefficient of error should be < 0.10.\nQuantification of apoptotic cells\nTiming: 10 min per section per cortex (one hemisphere)",
    "In contrast to reductions of cortical neurons and cortical volume, which accumulate over time, identification of increases of apoptosis is a quicker way to reveal earlier signs of neuronal loss in the brain due to the low basal apoptosis in the adult brain. For example, the cortical neuron number and the cortical volume are unaltered in the cerebral cortex of excitatory neuron-specific Presenilin conditional double knockout (EX-PS cDKO) mice at 2 months of age (Saura et al., 2004[href=https://www.wicell.org#bib12]). However, we detected 8-fold increases of apoptotic cells in the cerebral cortex of EX-PS cDKO mice at 2 months of age relative to controls, though the apoptotic cells represent only 0.1% of neurons in the cerebral cortex (Saura et al., 2004[href=https://www.wicell.org#bib12], Wines-Samuelson et al., 2010[href=https://www.wicell.org#bib17]).\nWe typically find 0–2 and 3–10 active Caspase-3-immunoreactive cells (Figure 5[href=https://www.wicell.org#fig5]A) or TUNEL-positive (Figure 5[href=https://www.wicell.org#fig5]B) apoptotic cells per brain section in the cerebral cortex of controls and AD mouse models, respectively. Thus, it is feasible and more accurate to count all active Caspase-3-immunoreactive cells or TUNEL-positive cells in the cerebral cortex rather than sampling areas using a dissector.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/778-Fig5.jpg\nFigure 5. Apoptotic cells labeled by active Caspase-3 immunoreactivity and the TUNEL assay\n(A) Representative image of active Caspase-3-immunoreactive cells in the neocortex.\n(B) Representative image of TUNEL+ cells in the neocortex.\nScale bar: 100 μm.\nPlace the slide on the stereomicroscope (e.g., Olympus BX-51) with a CCD camera for active Caspase-3-stained brain sections or in the fluorescence microscope (e.g., Olympus IX-51) with a CCD camera for TUNEL assay.\nUnder the 10× objective lens of the microscope, scan the brain region from anterior to posterior and dorsal to ventral. And count all active Caspase-3 immunoreactive or TUNEL+ cells per section.\nThe total number of apoptotic cells is calculated as follows.",
    "[Average of number of apoptotic cells per section] × [number of entire brain section of region of interest]\nQuantification of astrogliosis\nTiming: 5–10 min per section per cortex (one hemisphere)\nAstrocytes are a major glial cell type in the mammalian brain. The number of astrocytes is estimated at approximately 25 billion in the adult human brain (Pelvig et al., 2008[href=https://www.wicell.org#bib10]). Astrocytes are activated under disease conditions because of neuroinflammatory responses, and we previously found astrogliosis accompanying neurodegeneration in the brains of Alzheimer's and Parkinson's mouse models (Saura et al., 2004[href=https://www.wicell.org#bib12], Beglopoulos et al., 2004[href=https://www.wicell.org#bib3], Wines-Samuelson et al., 2010[href=https://www.wicell.org#bib17], Watanabe et al., 2012[href=https://www.wicell.org#bib15], Watanabe et al., 2014[href=https://www.wicell.org#bib16], Xia et al., 2015[href=https://www.wicell.org#bib18], Giaime et al., 2017[href=https://www.wicell.org#bib5], Lee et al., 2020[href=https://www.wicell.org#bib8], Kang and Shen, 2020[href=https://www.wicell.org#bib7]). GFAP is an intracellular intermediate filament, and its expression is upregulated during neurodegeneration and astrogliosis. Thus, astrogliosis can be assessed by measuring GFAP-immunoreactive areas in the cerebral cortex. (Figure 6[href=https://www.wicell.org#fig6])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/778-Fig6.jpg\nFigure 6. Quantification of GFAP-immunoreactive areas in the cerebral cortex\n(A and A′) Representative images of GFAP immunoreactivity in the neocortex. The neocortex is outlined by a red line (A). The red marked areas in (A′) indicate the GFAP-immunoreactive area in the neocortex.\n(B and B′) Higher power views of GFAP immunoreactivity in the neocortex. Highlighted magenta areas in (B′) indicate the GFAP-immunoreactive area.\n(C and C′) Representative images of GFAP immunoreactivity in the hippocampus. The hippocampus is outlined by a red line (C). The red marked areas in (C′) indicate the GFAP-immunoreactive area in the hippocampus.\n(D and D′) Higher power views of GFAP immunoreactivity in the hippocampus. Highlighted magenta areas in (D′) indicate the GFAP-immunoreactive area.\nScale bar: 100 μm.\nPlace the slide of GFAP-immunostained brain sections on the microscope with a CCD camera.",
    "We usually use 4× objective lens of the microscope for cerebral cortex.\nUsing any quantitative image analysis software (e.g., in our laboratory, BioQuant Lifesciences software), measure the area of the neocortex or the hippocampus and GFAP+ area within the specified brain subregion.\nWe usually measure 6–7 sections, 400 μm apart, per brain.\nThe area of the region of interest can be measured as we described above in the ‘Quantitative analysis of cortical volume using stereological methods’ section.\nSet the threshold value to detect all GFAP-immunoreactive areas (Figures 6[href=https://www.wicell.org#fig6]A’–6D′).\nApply the threshold value to measure GFAP+ area within the area of the brain subregion of interest. GFAP+ area will be automatically quantified and displayed on the data panel window.\nPercentage of GFAP+ area is calculated as follows.\nPercentage of GFAP+ in the brain subregion per section = [GFAP+ area in the brain subregion of each section] / [total area of the brain subregion of each section]\nThen, calculate average percentage of GFAP+ area in all sections (typically 7 sections for neocortex and 6 sections for hippocampus) for each brain.\nQuantification of microgliosis\nTiming: 10–15 min per section per cortex (one hemisphere)\nIn addition to astrogliosis, microgliosis also accompanies neurodegeneration. Microgliosis is an early non-specific proliferation and migration of macrophage-like microglia cells in the central nervous system as the first response to brain damage or pathogenesis of the neurodegenerative disease. Activated microglia enhance expression of microglia-specific genes, such as Iba1, which can be detected easily by immunostaining with an anti-Iba1 antibody. Counting the number of Iba1-immunoreactive microglia in the entire cerebral cortex can assess the degree of microgliosis (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/778-Fig7.jpg\nFigure 7. Quantification of Iba1-immunopositive cells in the cerebral cortex\n(A) Representative image of Iba1 immunostaining in the neocortex.",
    "(A′) Higher power view of Iba1+ cells in the neocortex showing one dissector (100 × 100 μm) under the 40× objective lens.\n(B) Representative image of Iba1 immunostaining in the hippocampus.\n(B′) Higher power view of Iba1+ cells in the hippocampus showing one dissector (250 × 250 μm) under the 10× objective lens.\nScale bar: 100 μm.\nPlace the slide of Iba1-stained sections on the microscope with a CCD camera.\nWe usually use a 4× objective lens of the microscope for area measurement, and a 40× and 10× objective lens for the Iba1+ cell counting in the neocortex and hippocampus, respectively.\nUsing the BioQuant Lifesciences software, measure the area of the neocortex or hippocampus and count the number of Iba1+ cells within each brain subregion.\nWe usually count 6–7 sections, 400 μm apart, per brain.\nMeasure area of the region of interest as we described above in the ‘Quantitative analysis of cortical volume using stereological methods’ section.\nThe number of Iba1+ cells can be counted as we described above in the ‘Quantitative analysis of cortical neuron number using stereological methods’ section. The grid size is usually set at 500 × 500 μm for neocortical area and the dissector size is usually set at 100 × 100 μm. For the hippocampal area, the grid size is set at 500 × 500 μm and the dissector size is set at 250 × 250 μm.\nIba1+ signals in the specific brain subregion is calculated as follows.\nIba1+ cells per mm2 per section = [number of Iba1+ cells in the brain subregion of each section] / [total area of the brain subregion of each section]\nThen, calculate average number of Iba1+ cells in all sections (typically 7 sections for neocortex and 6 sections for hippocampus) for each brain.",
    "Alternatively, total Iba1+ cell number in the cerebral cortex from one hemisphere can be calculated as described above in the section of ‘Quantitative analysis of cortical neuron number using stereological methods’. As an example, we typically find ∼3 × 105 Iba1+ cells in the neocortex of one hemisphere of control mice."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Neuroscience",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}