{
  "id": 14989,
  "origin_website": "Jove",
  "title": "Investigating the Pathogenesis of MYH7 Mutation Gly823Glu in Familial Hypertrophic Cardiomyopathy using a Mouse Model",
  "procedures": [
    "The histories of the families were obtained by interviewing the family members. The study was approved by the Ethics Committee of the Guangdong Provincial Hospital of Chinese Medicine (No. 2019074). Informed written consent was obtained from all the family members. All the animals are treated in accordance with the ethical guidelines of the Guangdong Provincial Hospital of Chinese Medicine (Guangzhou, China).\n1. Study subjects\nNOTE: The proband III-3 sought medical advice in the Department of Cardiovascular Surgery of the Guangdong Provincial Hospital of Chinese Medicine in July 2019.\nObtain detailed family medical history of the proband. Notify and call all the family members of the proband. All the family members have undergone meticulous physical examinations.\n\t\nPerform a systematic review of all clinical data, including medical records, ECGs, echocardiograms, and cardiac catheterization reports.\nReconfirm cardiac phenotypes in all the patients during intervention or surgery.\nSelect a total of 174 population-based healthy controls from the local database. Collect approximately 4.0 mL of peripheral venous blood from each patient.\n2. DNA extraction\nNOTE: DNA is extracted with a commercial blood kit according to the manufacturer's instructions.\nLyse blood cells with an anionic detergent in the presence of a DNA stabilizer following the manufacturer's protocol.\nAdd 10 µL of RNase A solution to the cell lysate and mix by inverting the tube 25 times. Incubate at 37 °C for 15 min to 1 h.\nRemove proteins by salt precipitation. Use protein precipitation solution (0.25 mg of bovine serum albumin dissolved in 25 mL of distilled water) and 100% isopropanol to precipitate proteins. Then, use 200 µL of 70% ethanol and perform centrifugation at 12,000 x g/min at 4 °C for 15 min to wash the DNA pellet.",
    "Recover the genomic DNA by precipitation with 500 µL of 70% ethanol. Centrifuge at 12,000 x g for 30 s. Aspirate and then dissolve the pellet in hydration solution (1 mM EDTA, 10 mM Tris·Cl, pH 7.5).\nUse a spectrophotometer (e.g., NanoDrop 2000) to determine purity. Purified DNA typically has an A260/A280 ratio between 1.7 and 1.9 and is up to 200 kb in size.\nStore the DNA for a long term at 2-8, -20, or -80 °C.\n3. Whole exome sequencing and variant analysis\nNOTE: To systematically search for disease-causing gene mutations, exome sequencing in affected individuals (II-5, II-7, III-3, III-7, III-8, III-9, and IV-3) and unaffected individuals (III-2, III-5, IV-4) was performed.\nUse exome probe according to the manufacturer's instructions to perform the exome capture.\nApply the qualified libraries to 2 × 150 bp paired-end sequencing on the HiSeq X-ten platform. Please see Supplemental File 1.\nAlign FASTQ files to the human reference genome (hg19/GRCh37) with BWA v0.7.1318,19. Sort the aligned files (sam/bam format files) with samtools, and then flag duplicates using Picard. Please see Supplemental File 1.\nUse GATK, realign reads locally and recalibrate base qualities. Please see Supplemental File 1.\nGenerate mapping statistics that include coverage and depth from recalibrated files by BEDTools and in-house perl/python scripts.\nGenotype variants (SNVs and indels) from recalibrated BAM files using the multi-sample processing mode of the HaplotypeCaller tool from GATK.\nUse VQSR (variant quality score recalibration) to reduce false positives of variant calling.\nAnnotate SNVs and indels using ANNOVAR software21 against multiple databases, including the Exome Aggregation Consortium (ExAC) (http://exac.broadinstitute.org), the Exome Sequencing Project (ESP) (https://esp.gs.washington.edu), and 1,000 G (http://www.1000genomes.org). Interpret the pathogenicity of the sequence variants according to the ACMG guidelines.\n4. Sanger sequencing",
    "Perform Sanger sequencing to confirm potential causative variants and determine variant segregation in the family using an ABI 3500 sequencer23.\nDesign primer sequences for the variant in the MYH7 gene (NM_000257) as follows: 5'-TTCAAACACAGAGACCTGCAGG-3' and 5'- CGGACTTCTCTAGCGCCTCTT -3'.\nConfirm a variant, screen all the available family members to determine variant segregation within the family23.\n5. Generation of C57BL/6N-MYH7em1(G823E) knockin mice\nUse the CRISPR/Cas9 system to generate C57BL/6N-Myh7em1(G823E) knockin mice. The mouse Myh7 gene (GenBank accession number: NM_001361607.1; Ensembl: ENSMUSG00000053093) is located on mouse chromosome 14 and has 41 exons. The ATG start codon in exon 4 and TAG stop codon in exon 41, and the G823E is located on exon 23. Select exon 23 as the target site.\nDesign the sequence of gRNA targeting vector and donor oligo (with targeting sequence, flanked by 134 bp homologous sequences combined on both sides).\n\t\nLog in to the NCBI website and click on the BLAST online primer design function on the right.\nClick on the Primer-BLAST function at the bottom of the page to design primers.\nPaste the MYH7 NCBI reference sequence number NM_000257.4 into the PCR template box.\nAmplify the target fragment (MYH7 cDNA exon 23 and its adjacent exons) so design the upstream primer on exon 21 (2392-2528) and the downstream primer on exon 25 (3205-3350). Enter the exon number of the upstream and downstream primers into the right range box.\nClick on the Get Primers button at the bottom to automatically generate multiple pairs of primers.\nInput the MYH7 gene into ZFIN database, introduce the p.g823e (GGG to GAG) mutation site in the donor oligonucleotide and the silent mutation p.r819 (AGG to CGA) into exon 23. The silent mutation prevents the binding and re-cutting of the sequence by gRNA after homology-directed repair.",
    "Design gRNA according to the general sequence, the sequences at both ends are TAATACGACTCACTATA- and -GTTTTAGAGCTA. The middle of the sequence is the target site mentioned above.\nCo-inject Cas9 mRNA, gRNA generated by in vitro transcription and donor oligo into fertilized eggs for KI mouse production.\n\t\nUse the Cas9/gRNA target efficiency detection kit to transcribe the designed gRNA target into gRNA in vitro and detect the activity of the transcript (see the VK007 kit instructions for specific detection methods) according to manufacturer's protocol.\nThaw the T7 ARCA mRNA kit components, mix, and pulse-spin in a microfuge to collect solutions to the bottoms of the tubes. Assemble the reaction at room temperature in the following order: 2x ARCA/NTP mix to 10 µL, 1 µg of template DNA, 2 µL of T7 RNA polymerase mix, and nuclease-free water to 20 µL.\nMix thoroughly and pulse-spin in a microfuge. Incubate at 37 °C for 30 min.\nRemove the template DNA by adding 2 µL of DNase I, mix well, and incubate at 37 °C for 15 min to obtain mRNA.\nPerform intraperitoneal injection of serum gonadotropin and human chorionic gonadotropin into pre-prepared C57BL/6 female mice at about 4 weeks old with a 0.5 mL syringe at a dose of approximately 5 U per mouse with an interval between the two injections of 48 h.\nEighteen hours after dosing, sacrifice C57BL/6 female mice and one 8-12-week-old C57BL/6 male mouse by cervical dislocation after hormone injection. Collect the eggs and sperm separately.\nThe sperm is capacitated in the capacitation fluid. Take and drop the sperm at the edge of the fluid into the short-lived egg cells for in vitro fertilization for 3-4 h.",
    "Dilute the successfully transcribed gRNA and Cas9 mRNA in vitro with RNase-free water to 25 ng/µL and 50 ng/µL. Introduce into the cytoplasm of mouse fertilized eggs by microinjection. Transplant fertilized eggs in good condition into the enlarged oviduct of the female mice. Co-cage with ligated male mice.\nGenotype the pups by PCR. Use the following PCR conditions: 94 °C for 3 min, 35 cycles of 94 °C for 30 s, 60 °C for 35 s, and 72 °C for 35 s; 72 °C for 5 min. Follow with sequence analysis.\n\t\nCut the tails of 4-month-old mice with scissors and place them into 1.5 mL EP tube. Add 180 µL of Buffer GL, 20 µL of Proteinase K, and 10 µL of RNase A per tail piece (2-5 mm) in a microcentrifuge tube. Be careful not to cut too much tail.\nIncubate the tube at 56 °C overnight.\nSpin in a microcentrifuge tube at 1,000 x g for 2 min to remove impurities.\nAdd 200 µL of Buffer GB and 200 µL of absolute ethyl alcohol with sufficient mixing.\nPlace the spin column in a collection tube. Apply the sample to the spin and centrifuge at 1,000 x g for 2 min. Discard the flow-through.\nAdd 500 µL of Buffer WA to the spin column and centrifuge at 1,000 x g for 1 min. Discard the flow-through.\nAdd 700 µL of Buffer WB to the spin column and centrifuge at 1,000 x g for 1 min. Discard the flow-through.\n\t\tNOTE: Make sure the Buffer WB has been premixed with 100% ethanol. When adding Buffer WB, add to the tube wall to wash off the residual salt.\nRepeat step 5.5.7.\nPlace the spin column in a collection tube and centrifuge at 1,000 x g for 2 min.",
    "Place the spin column in a new 1.5 mL tube. Add 50-200 µL of sterilized water or elution buffer to the center of the column membrane and let the column stand for 5 min.\n\t\tNOTE: Heating sterilized water or elution buffer up to 65 °C can increase the yield of elution.\nTo elute DNA, centrifuge the column at 1,000 x g for 2 min. To increase the yield of DNA, add the flow-through and/or 50-200 µL of sterilized water or elution buffer to the center of the spin column membrane and let the column stand for 5 min. Centrifuge at 1,000 x g for 2 min.\nQuantify the eluted genomic DNA by electrophoresis.\n6. Evaluation of the cardiac morphology and function\nNOTE: Apply M-mode echocardiography to assess heart morphology and function of C57BL/6N-Myh7em1(G823E) knockin mice.\nPut the knockin mice into a closed acrylic box connected to the anesthesia machine and adjust the three-way interface to allow isoflurane (concentration: 3%) to flow into the acrylic box. After the knockin mice cease to move autonomously, remove the knockin mice.\nPlace the knockin mice flat on the life monitoring platform of the small animal anesthesia machine, and continuous inhalation anesthesia mixed with oxygen (flow: 0.8 L/min) and isoflurane (concentration: 3%). Apply eye lubricant to the anesthetized mice to prevent drying of the cornea.\nFix the knockin mice horizontally on the platform. Tilt the platform 30° caudal to the knockin mouse. Remove hair on the anterior chest wall of the knocking mouse using a depilatory cream.\nPosition the probe vertically with the bump facing the animal's head. Then, rotate the probe counterclockwise, approximately 45°.\nIn the parasternal long-axis view, rotate the probe 90° clockwise to observe the parasternal short-axis view. After rotating the probe 90°, adjust the y-axis displacement to get the correct slice.",
    "Observe the long-axis image of the heart (Figure 1C), and then select M-mode measurement data.\nAcquire ultrasound data from parasternal long-axis views of mice (Figure 1). Heart rate (HR), left ventricular ejection fraction (LVEF), cardiac output (CO), Left ventricular end-diastolic dimension (LVDd), LVDs left ventricular end-systolic dimension (LVSd), interventricular septum (IVS), and left ventricular posterior wall (LVPW) are measured.\nAfter the measurement, provide the mice with oxygen, and place them back into their respective cages when they regain autonomous activity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}