{
  "id": 10796,
  "origin_website": "Jove",
  "title": "Delivery of Therapeutic siRNA to the CNS Using Cationic and Anionic Liposomes",
  "procedures": [
    "All mice were bred and maintained at Lab Animal Resources, accredited by the Association for Assessment and Accreditation of Lab Animal Care International, in accordance with protocols approved by the Institutional Animal Care and Use Committee at Colorado State University.\n1. Preparation of LSPCs\nUse a 1:1 DOTAP (1,2-dioleoyl-3-trimethylammonium-propane):cholesterol ratio for LSPCs. For a 4 nmole liposome preparation, mix 2 nmoles of DOTAP and 2 nmoles of cholesterol into 10 ml of a 1:1 chloroform:methanol solution in a flask.\nEvaporate 9 ml of the chloroform:methanol solution using N2 gas in a fume hood. Evaporate the last 1 ml of solvent in a fume hood overnight without gas. Observe a thin lipid film on the bottom of the flask.\nHeat 10 ml of a 10% sucrose solution to 55 °C.\nPour the heated 10% sucrose solution onto the thin lipid film slowly, i.e. 1 ml/min, while gently swirling the flask. Maintain the 10% sucrose and flask with lipids at 55 °C so that the lipid molecules remain in the gel-liquid phase. Rehydration results in multilamellar vesicle (MLV) formation.\nAllow lipids to rehydrate at 55 °C for at least one hr before sizing the liposomes.\nAssemble an extruder per manufacturer's instructions with 1.0 µm filters or use 1.0 µm syringe filters for sizing.\nAdd 1 ml of the heated liposome suspension to one of the syringes on the extruder, and pass the suspension between the two syringes 11 times. Make sure that the suspension is in the opposite syringe than the starting syringe after the 11 passes.\nSize the liposomes again through 0.45 µm then 0.2 µm filters to generate large unilamellar vesicles (LUVs). Keep the liposome suspension heated for easier sizing.",
    "Incubate 20 µl of the 4 nmole liposome suspension (200 µM) with 200 µl of a 20 µM (4 nmole total) stock siRNA solution for 10 min at room temperature.\nIncubate 80 µl of a 500 µM (40 nmole total) stock RVG-9r solution with the siRNA/liposome solution for 10 min at RT. LSPCs should be used as soon as possible but can be used up to several hours after preparation. Store LSPCs at 4 °C for several hr after preparation.\n2. Preparation of PALETS\nUse a 55:40:5 molar ratio of either DSPE (1,2-distearoyl-sn-glycero-3-phosphoethanolamine):cholesterol:DSPE-PEG or DOTAP:cholesterol:DSPE-PEG for PALETS. For a 4 nmole liposome preparation, mix 2.2 nmoles of either DSPE or DOTAP, 1.6 nmoles of cholesterol, and 0.2 nmoles of DSPE-PEG into 10 ml of a 2:1 chloroform:methanol solution in a flask.\nPrepare liposome suspension exactly as described in Step 1.1 and 1.2 above. Rehydrate DSPE liposomes in 10 ml of 1x PBS heated to 75 °C, adding 1 ml/min. Allow lipids to rehydrate at 75 °C for at least 1 hr before sizing.\nSize the liposome suspension exactly as described in Step 1.6-1.8.\nPipet 20 µl of each of the 4 nmole (200 µM) liposome suspensions into single use aliquots after DOTAP and DSPE liposomes have been sized, and lyophilize for 30 min using a benchtop freeze dryer (Figure 2).\nIncubate 200 µl of a 20 µM (4 nmole total) stock siRNA solution with 1.4 µl of a 26.6 µM solution of protamine sulfate for 10 min at RT for siRNA that is to be encapsulated into DSPE PALETS liposomes.\nRehydrate the DOTAP PALETS liposomes with 200 µl of a 4 nmole stock solution of siRNA or rehydrate DSPE PALETS liposomes with 201.4 µl of the siRNA/protamine solution. Incubate liposome/siRNA solution for 10 min at RT.",
    "Add 10 µl of a 60 mM 1-ethyl-3-(3-dimethylaminopropyl)carbodiimide hydrochloride (EDC) solution to the liposome/siRNA solution for both DOTAP and DSPE PALETS.\nAdd 10 µl of a 150 mM N-hydroxysulfosuccinimide (sulfo-NHS) solution to the liposome/siRNA solution for both DOTAP and DSPE PALETS.\nIncubate the EDC and sulfo-NHS with the siRNA/liposome suspension for 2 hr at RT.\nIncubate 80 µl of a 500 µM (40 nmole total) stock RVG-9r solution with the siRNA/liposome crosslinking solution for 10 min at RT.\n\tNOTE: The EDC/sulfo-NHS allows the RVG-9r to covalently bond to the PEG lipids. Use PALETS within several hr after preparation. Store PALETS at 4 °C for several hr after preparation.\nTo determine siRNA encapsulation efficiency of PALETS:\n\t\nMeasure the concentration of siRNA before and after the addition of protamine and liposomes using a spectrophotometer set at 260 nm.\nFilter the unencapsulated siRNA from the liposome/encapsulated siRNA suspension using 50 kDa centrifugal filters. Centrifuge at 1,000 x g for 20 min.\nMeasure the concentration of unencapsulated siRNA in the filtrate and the concentration of encapsulated siRNA in the retentate using a spectrophotometer at 260 nm.\n3. Injecting Mice with LSPCs or PALETS\nExpose mice for 5-10 min to a heat lamp to dilate vasculature.\nAnesthetize mouse with a 2-3% isofluorane/oxygen flow 5-10 min before injection, and during injection. Confirm anesthetization when animal is no longer ambulant and respirations have slowed by doing a toe pinch. Place the mouse on its back or side to access the tail vein. Use vet ointment on mouse's eyes to prevent drying while under anesthesia.\nWipe/spray the tail with 70% EtOH and inject 300 µl of LSPCs or PALETS onto the tail vein of the mouse using a 26 G insulin syringe. Start injecting distally into the tail vein and move proximally if the vein collapses or ruptures.",
    "Place mouse in a clean cage until it maintains sternal recumbency. Do not place mouse with other cage mates until it has fully recovered. Mice should recover in 5 to 15 min.  They can be placed on a heating pad or under a heat lamp to maintain body temperature if recovery takes longer.  Mice should be monitored closely to safeguard against over-heating.\nMonitor the animal several hours after injection to ensure anesthesia wears off, and there are no ill effects of the treatment. Allow the LSPCs or PALETS to circulate for at least 24 hr.\n4. Analysis of Protein Expression via Flow Cytometry\nEuthanize mice with a 20% CO2 flow rate for 15 min.\nDissect out half a hemisphere of brain by cutting away the skin and skull of the mouse using scissors. Peel away half a hemisphere of brain away from the skull using tongs or the end of a pair of scissors.\nPress half a hemisphere of brain from each mouse through a 40 µm mesh cell strainer using 2.5 ml of FACS buffer (1x PBS, 1% fetal bovine serum, 10 mM EDTA) in a Petri dish with the plunger of a syringe.\nRinse the cell strainer and Petri dish with an additional 2.5 ml of FACS buffer. Put the single cell suspension in a 15 ml conical tube on ice.\nPipet 100 µl of the 5 ml single cell suspension into a 1.5 ml microcentrifuge tube and centrifuge for 5 min at 350 x g. Discard the supernatant and resuspend cell pellet in 1 ml of FACS buffer. Spin at 350 x g for 5 min. Repeat with another 1 ml of FACS buffer. Keep the cell suspension on ice.",
    "Incubate the cells in 100 µl of 1:100 dilution of a 0.5 mg/ml rat anti-mouse Fc block in FACS buffer for 30-60 min on ice. Pellet and wash the cells as in step 4.5. Keep the cell suspension on ice.\nIncubate the cells in 100 µl of a 20 µg/ml fluorescent antibody against mouse PrPC in 7% mouse serum in FACS buffer on ice for 30-60 min. Pellet and wash the cells as in step 4.5. Keep the cell suspension on ice.\nPellet and re-suspend the cells in 1 ml of RBC lysis buffer (1x PBS, 155 mM NH4Cl, 12 mM NaHCO3, 0.1 mM EDTA) for 1 min. Pellet as in step 4.5 and resuspend the cells in 1 ml of FACS buffer. Keep the cell suspension on ice.\nAnalyze PrPC expression using a flow cytometer as described previously10. Gate live cells from total cell population. Gate PrPC + cells from live cell population to determine MFI (median fluorescent intensity).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}