{
  "id": 11299,
  "origin_website": "Jove",
  "title": "A Simple Hanging Drop Cell Culture Protocol for Generation of 3D Spheroids",
  "procedures": [
    "1.  Preparation of a Single Cell Suspension\nAdherent cell cultures should be grown to 90% confluence, whereupon monolayers should be rinsed twice with PBS. After draining well, add 2 mls (for 100 mm plates) of 0.05% trypsin-1 mM EDTA, and incubate at 37°C until cells detach. Stop trypsinization by adding 2 mls of complete medium and gently use a 5 ml pipette to triturate the mixture until cells are in suspension. Transfer cells to a 15 ml conical tube.\nAdd 40 μl of a 10 mg/ml DNAse stock and incubate for 5 minutes at RT. Vortex briefly and centrifuge at 200 XG for 5 minutes.\nDiscard supernatant and wash pellet with 1 ml complete tissue culture medium. Repeat, then resuspend cells in 2 mls of complete tissue culture medium.\nCount the cells using a hemacytometer, or automated cell counter and adjust concentration to 2.5 x 106 cells/ml. For this demonstration a BioRad TC10 automated cell counter was used.\n2.  Formation of Hanging Drops.\nRemove the lid from a 60 mm tissue culture dish and place 5 mls of PBS in the bottom of the dish. This will act as a hydration chamber.\nInvert the lid and use a 20 μl pipettor to deposit 10 μl drops onto the bottom of the lid. Make sure that drops are placed sufficiently apart so as to not touch. It is possible to place at least 20 drops per dish.\nInvert the lid onto the PBS-filled bottom chamber and incubate at 37°C/5% CO2/95% humidity, monitor the drops daily and incubate until either cell sheets or aggregates have formed. A stereo microscope can be used to assess aggregate formation.",
    "Once sheets form, they can be transferred to round-bottom glass shaker flasks containing 3 mls of complete medium and incubated in a shaking water bath at 37°C and 5% CO2 until spheroids form.\n3.  Notes\nDepending on cell size, concentration may need to be adjusted up- or down.\nCells can be stained with membrane intercalating fluorescent dyes prior to hanging drop formation.\nTwo different cell types can be differentially stained and mixed in a 1:1 (or other) ratio prior to formation of hanging drops. These can be cancer and stromal cells, embryonic tissues, or cells genetically engineered to have specific adhesive signatures.\nCells can be detached from tissue culture dishes using 0.05% trypsin/2 mM calcium to preserve cadherin function.\nDepending on the experiment, sheet sizes can either be measured, or aggregates can be used for mechanical testing or for biochemical or molecular analysis.\n4.  Representative Results:",
    "Sheet or spheroid formation typically occurs within 24 hours but may take longer depending on cell type. Figure 1 represents images captured after 18 hours of incubation of untreated prostate cancer MAT-LyLu (MLL) cells in hanging drop culture (Figure 1A) or cells treated with 25 μm MEK inhibitor PD98059. Note that MEKi treatment results in a marked compaction of the cell sheet. Compaction can be quantified by measuring the size of 10-20 (or more) hanging drops and comparing average size between treatment groups. We typically analyze images using ImageJ software by thresholding each image then converting images to Binary Mode, whereupon we apply particle analysis to reveal the total image area in pixels. This can then be easily converted to square microns. Figure 2 represents a size comparison for untreated and MEKi-treated MLL cells. As noted, MEKi treatment significantly reduces sheet size as compared by Student's t-test (P<0.0001). For this comparison, 10 aggregates for each of untreated and treated cells were measured. Figure 3 represents a chick embryonic liver spheroid formed after 24 hours in hanging drop culture and 2 days in a shaker bath.",
    "The hanging drop assay can also be modified to include more than one cell type to reveal the spatial positioning adopted. For example, chick embryonic liver cells can be isolated, stained with a fluorescent membrane-intercalating dye and mixed with chick embryonic heart cells that have been stained with a different fluorescent marker. Figure 4A shows that rather than remaining intermixed, liver and heart cells tend to \"sort-out\" from one-another and adopt a sphere-within-a-sphere configuration in which heart cells are enveloped by liver cells. This configuration can be explained by differences in intercellular adhesion between liver and heart cells. This concept is codified in the Differential Adhesion Hypothesis which has been used to explain cell sorting behavior between embryonic germ layer tissue for amphibian3and teleost 4embryos, for pancreatic islet cell organization 5and for cell sorting between two cell populations identical in every respect other than for the expression levels of the same type of cadherin (6and Figure 4B). This result is particularly important for demonstrating how engineering a simple difference in adhesion between cell populations may result in the generation of organ structure, for example, a pancreatic islet 5.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2720/2720fig1.jpg\nFigure 1. Images of cells incubated in hanging drop culture for 18 hours either in the absence (A) or presence (B) of 25 μm of the MEK inhibitor PD98059. Images were captured using a Nikon Eclipse TE 300 epifluorescence microscope and a Photometrics CoolSnap ES digital camera.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2720/2720fig2.jpg",
    "Figure 2. Quantification of MEKi-induced compaction of rat prostate cancer MLL cells. Hanging drop cultures of untreated and MEKi-treated MLL cells were incubated for 18 hours whereupon aggregate size was determined as described above. Statistical analysis of aggregate size was by Student's t-test. The asterisk represents a statistically significant difference in aggregate size (P<0.0001) between untreated and MEKi-treated cells and suggests that MEKi-treatment results in significantly smaller and more compact aggregates.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2720/2720fig3.jpg\nFigure 3. A spheroid formed by incubating chick embryonic liver cells in hanging drop culture for 18 hours then in an incubator/shaking bath for 48 hours. This image was captured using a Nikon SMZ800 stereo microscope and a Sony Black CCD camera.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2720/2720fig4.jpg",
    "Figure 4. Hanging drop culture reveals sorting-out behavior between different cell types. In panel A, chick embryonic liver cells were stained with PKH-2 membrane intercalating dye and mixed in equal proportions with PKH-26 stained chick embryonic heart cells. In panel B, two N-cadherin-transfected L cell clones (LN4 and LN2a), expressing N-cad at their surfaces in the ratio of 2.4:1, were also stained with the fluorescent membrane intercalating dyes PKH-2 and PKH-26, (Sigma-Aldrich), mixed in equal proportions and cultured as hanging drops7. After 18 hours in culture, cell sheets were transferred to shaking flasks and incubated for another 48 hours. Aggregates were fixed in 2% paraformaldehyde in phosphate-buffered saline and viewed with a BioRad MRC600 scanning laser confocal microscope system attached to a Nikon Optiphot-2 microscope. Optical sections from both green and red channels were collected and a Silicon Graphix Crimson VGX workstation equipped with Vital Images Voxel View Ultra imaging software was used to assign false color to both channels and to merge the images, revealing the anatomical configurations generated.(A) Confocal optical section through an aggregate demonstrating envelopment of heart cells (here in a pseudo-color yellow) by liver cells in pseudocolor blue (from 8). (B) Confocal optical section through an aggregate demonstrating envelopment of high N-cadherin expressing cells (green) by those expressing lower levels of N-cadherin (red) (from 6).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}