{
  "id": 5936,
  "origin_website": "Bio",
  "title": "Mouse Satellite Cell Isolation and Transplantation",
  "procedures": [
    "Note: All the procedures have been approved by the Institutional Animal Care and Use Committee at the University of Piemonte Orientale (Italy). Day -1: Damage induction in recipient muscles (Video 1) <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Preparation of the recipient muscle. After removing the hairs from the front of the limb, cardiotoxin (CTX) is injected in the mid-belly region of the tibialis anterior (TA) muscle of the anesthetized mouse using a Hamilton repeating dispenser.Under sterile conditions, prepare 10 µM CTX from 50 µM stock solution in physiological solution (0.9% NaCl) and store on ice (see Recipes).Anesthetize the recipient mouse through isofluorane inhalation.Shave the hindlimbs by tearing off the hair with a pair of scissors to expose the tibialis anterior (TA) muscle (injection site) and clean the shaved skin with 70% ethanol (Video 1).Fill the Hamilton repeating dispenser (see Equipment for details) with CTX and inject it in 10 different sites (3 µl each) in the tibialis anterior mid-belly region (total volume injected: 30 µl) as shown in Video 1. The optimal positioning of injection sites is shown in Figure 2. After each CTX injection, leave the needle inside the muscle for at least 5 sec to avoid any leakage from the injection site. Special care should be taken when injecting in TA to avoid injecting beyond the thickness of the muscle.Clean again the shaved skin with 70% ethanol. Place back the mouse in its cage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116013739_6115.jpgFigure 2. Optimal positioning of the 10 CTX injection sites (white dots) in the TA muscleDay 0: Satellite cell isolation and transplantation (Videos 2 and 3)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Collection of muscles for SC isolation. After skin removal, hindlimb muscles and diaphragm are harvested from the GFP donor mouse and collected in pre-warmed serum-free DMEM.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 3. Processing of muscles for SC isolation.",
    "An example of tendon removal (Achilles tendon removal from the gastrocnemius) and muscle processing for an optimal yield of SC isolation.                                                      The following steps describe the procedure to isolate SCs from a single donor mouse. The number of SCs obtained from a single donor is approximately 600,000 and is sufficient to transplant 5-6 mice.Pre-warm 10 ml serum-free DMEM and 10 ml PBS (see Recipes).Freshly prepare 3 ml 0.1% pronase solution in serum-free DMEM (see Recipes); under a biological hood, filter the pronase solution with a 0.2 µm microfilter in a 15 ml conical tube. For multiple preparations (i.e., SC isolation from multiple animals), use a separate tube for each animal to allow an optimal dissociation.Anesthetize a 10-week-old male GFP mouse through isofluorane inhalation and sacrifice by cervical dislocation.Soak the mouse for 2 min in 70% ethanol. Note: Perform the next steps under a biological hood.Fix the mouse to a support (e.g., with needles to a polystyrene box lid) and, with sterile surgical instruments (forceps and scissors), harvest the following muscles from both hindlimbs: tibialis anterior, extensor digitorum longus, quadriceps, gastrocnemius, soleus, and diaphragm (see Video 2 for details). Place the harvested muscles immediately in a 100 mm dish containing 10 ml of pre-warmed serum-free DMEM. Pre-wash the diaphragm in sterile PBS to remove the excess of blood and clots before adding it to the DMEM-containing dish. Note: During this step, it is required to remove the deep fascia (connective tissue that surrounds the muscles, shown in Figure 3) from each muscle to reduce fibroblast content during satellite cell isolation. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116014555_8827.jpgFigure 3. Removal of the deep fascia. The arrows indicate the sheet of connective tissue surrounding the muscle.",
    "Place the muscles in a dish-cover (without medium) and remove tendons by using a sterile surgical blade (in Video 3, removal of gastrocnemius tendon in detail). Cut the processed muscles with a new sterile surgical blade into small pieces (about 1 mm3). During this step, add some drops of serum-free DMEM to prevent muscle from drying. Transfer the pieces of muscle into the tube containing the filtered 0.1% pronase solution. Place the tube on an orbital shaker at 37 °C for 60 min at 60 rpm. Centrifuge at 400 x g for 5 min at RT to collect and discard the supernatant without disturbing the pellet.Perform two cycles of mechanical trituration, which allows satellite cell release from the bulk in solution, as follows:Add 5 ml of pre-warmed 10% HS DMEM and disrupt the bulk by passing it several times (20-25) through a 10 ml serological pipette; leave the biggest fragments to settle on the bottom (for about 30 sec) and then carefully transfer the supernatant, containing the released cells, into a new 50 ml conical tube.Resuspend the remaining bulk of point (a) in 5 ml 10% HS DMEM and repeat the previous procedure in (Step B10a) by using a 5 ml (instead of 10 ml) serological pipette. Transfer the supernatant, containing the released cells, into the same 50 ml conical tube of point (Step B10a).Filter the pooled supernatant (10 ml) through a 40 µm cell-strainer into a new 50 ml conical tube. Add additional 5 ml of 10% HS DMEM to increase the yield of isolated cells. Centrifuge the cell suspension at 400 x g for 10 min at RT. Discard the supernatant and resuspend the pellet (isolated cells) with 10 ml of 20% FBS DMEM.",
    "Plate the resuspended cells in a 100 mm Petri dish and leave it undisturbed in the incubator (5% CO2, 37 °C) for 90 min. This pre-plating step allows fibroblast removal and satellite cell enrichment (fibroblasts will adhere to the Petri dish, while satellite cells will float in the medium).Collect the supernatant in a 15 ml conical tube and centrifuge it at 400 x g for 10 min at RT.Discard the supernatant without disturbing the pellet and resuspend the cells in 1 ml of 20% FBS DMEM, then transfer the cell suspension into a sterile 1.5 ml microcentrifuge tube.Count the round-shaped cells with a hemocytometer chamber or similar, excluding erythrocytes and debris. Centrifuge at 400 x g for 5 min at RT the 1.5 ml tube in a microcentrifuge, then discard the supernatant and carefully resuspend the cells in serum-free DMEM to a concentration of 4 x 106 cells/ml (i.e., 100,000 cells/25 µl) (Notes 1 and 2). Anesthetize recipient mice (as in Steps A2) and clean the region to be injected with 70% ethanol.Thoroughly mix the cell suspension and load the Hamilton repeating dispenser by removing any air bubble. Inject a total number of 100,000 cells (25 µl) in 5 different sites (5 µl each) in the mid-belly region of the pre-injured TA. The optimal positioning of injection sites is shown in Figure 4. Injections are performed as described in Video 1. After each injection of 5 µl cell suspension, leave the needle inside the muscle at the injection site for at least 5 sec. Clean the injected site with 70% ethanol. Place back the mouse in its cage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116014923_8139.jpgFigure 4. Optimal positioning of injection sites for GFP-SCs. Yellow dots indicate the 5 injection sites in pre-injured TA muscle.",
    "Day 30: Muscle harvesting and histological analysisFor each muscle, prepare 500 µl 4% paraformaldehyde solution in a 1.5 ml microcentrifuge tube.Anesthetize the recipient mouse through isofluorane inhalation and sacrifice it by cervical dislocation.Fix the mouse (e.g., with needles to a polystyrene box lid) and harvest the transplanted TA muscle. Immerse the harvested muscle in 4% paraformaldehyde solution and leave it at 4 °C for 120 min to fix it. Note: This step is essential to avoid the solubilization (and loss) of GFP during the optional immunofluorescence procedure.Transfer the fixed muscle into a new 1.5 ml microcentrifuge tube containing 500 µl of 15% sucrose solution. Leave overnight at 4 °C to dehydrate the tissue.Continue muscle dehydration by transferring the muscle into a new 1.5 ml microcentrifuge tube containing 500 µl of 30% sucrose solution. Leave for 48 h at 4 °C.Carefully remove the muscle from the 30% sucrose solution, gently dab it on blotting paper, freeze it in liquid nitrogen-cooled isopentane, and store at -80 °C.Cut with a cryostat the frozen muscle in the mid-belly region (transplantation site) to obtain 7 µm-thick slices and assess the GFP-positive myofiber content through extemporaneous analysis under the fluorescent microscope.Note: To increase the GFP signal, or if needed to co-investigate the expression of other proteins, proceed with the following immunofluorescence procedure. ImmunofluorescencePost-fix the slices with 300 μl 4% paraformaldehyde on ice for 10 min. Wash 2 x 2 min with 300 μl PBS at RT.Permeabilize 1 x 5 min and 1 x 15 min with 300 μl 1% BSA-0.2% Triton X-100.Block with 300 μl 4% BSA for 30 min.Incubate for 2 h at RT (or overnight at 4 °C) with anti-GFP primary antibody diluted 1:500 in 100 μl 4% BSA.Wash 2 x 5 min and 2 x 15 min with 300 μl 1% BSA-0.",
    "2% Triton X-100.Incubate for 45 min with anti-rabbit secondary antibody diluted 1:400 in 100 μl 4% BSA.Wash 2 x 5 min and 2 x 15 min with 300 μl 0.2% Triton X-100.If identification of nuclei is needed, incubate for 5 min with 0.2 µg/ml DAPI in 300 μl PBS.Wash 2 x with 300 μl PBS for 2 min at RT.Mount the slices with a drop (~10 μl) of glycerol-based mounting medium. Acquire the images for the analysis (Figure 5). The whole muscle slice should be acquired, for example by using an instrument such as the Pannoramic Midi II (3DHISTECH).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116015513_4680.jpgFigure 5. Representative image of GFP+ fibers derived from transplanted GFP+ SCs. Image obtained with the Leica SP2 confocal microscope of a tibialis anterior transversal section of a recipient mouse 30 days after transplantation of SCs from a GFP donor mouse. The slice has been stained with the anti-GFP primary and 488-conjugated secondary antibodies to amplify the GFP signal, following Procedure D.The evaluation of transplantation efficacy among different experimental conditions (such as the comparative analysis between wild-type and transgenic or knockout recipient mice) requires a quantification of the number of the GFP-positive myofibers in the whole muscle slice. A myofiber is scored as ‘GFP-positive’ when the fluorescent intensity significantly differs from the background. A considerable variability in GFP intensity is expected, depending on the number of GFP-positive SCs fused to the fiber. For an unbiased quantification and to increase data reproducibility, use an image processing software such as ImageJ (https://imagej.net/[href=https://imagej.net/]) as follows:Open ImageJ software;Open the image to be analyzed (File > Open);Set the background completely under the threshold (Image > Adjust > Threshold; Figure 6)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116015628_1607.jpgFigure 6. GFP-positive fibers quantification with ImageJ.",
    "The original fluorescence image (upper panel) is processed by setting a threshold limit, clearly defining a black background and the GFP-positive myofibers displayed in red (lower panel).Apply the same setting for all the images in the different experimental groups and quantify the number of GFP-positive myofibers (i.e., myofibers with a fluorescence intensity higher than the threshold).In Figures 1F and 1G of the original paper (Reano et al., 2017), the results refer to the SC transplantation from 3 GFP donor mice in 11 C57BL/6J wild-type recipient mice (Mean number of GFP-positive myofibers = 39.45; standard deviation = 22.15; standard error = 7.00)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}