{
  "id": 8635,
  "origin_website": "Jove",
  "title": "An Oligonucleotide-based Tandem RNA Isolation Procedure to Recover Eukaryotic mRNA-Protein Complexes",
  "procedures": [
    "1. Design Antisense Oligonucleotides (ASOs)\nAnalyze the secondary structure of the mRNA or a fragment thereof using available online tools38. Therefore, enter the nucleotide (nt) sequence in the empty box. In the basic options box, select Minimum free energy (MFE) and partition function and Avoid isolated base pairs. In the output options box, select Interactive RNA secondary structure plot and finally click the Proceed button. A new window will pop-up that displays the secondary structure of the mRNA of interest.\nSelect at least three different 21 - 24 nts long sequences within the mRNA of interest, preferentially in regions lacking detectable secondary structures (e.g., in unstructured loops) and in 3’ untranslated regions (UTR).\n\tNote: It has been observed that ASOs annealing to sequences in the 3’ untranslated regions (UTR) performed best. One possibility is that ribosomes bound to the coding sequence (CDS) may occasionally obstruct the annealing of ASOs. ASOs annealing to 5’UTRs were not tested.\n\t\nSelect the regions with a guanidine/cytosine ratio close to 50% and lacking nucleotide tandem repeats to avoid potential formation of hairpins or self-annealing.\nManually design 2’-methoxy modified RNA oligonucleotides bearing a biotin moiety at the 3’, fully complementary to the selected regions (step 1.2) within the desired target mRNA.\n\tNote: 2’-methoxy modifications render the RNA resistant to cellular RNases and increases the duplex melting temperature, which allows for stringent washing. The biotin moiety is required for capturing ASOs with streptavidin.\n\t\nAdjust the melting temperature of the RNA hybrids to ~60-65 °C and ensure that it has a high linguistic sequence complexity (>60%) as determined with suitable online tools39.",
    "Use the Basic Local Alignment Search Tool40 to search for potential ASO cross-hybridization with other mRNAs in the transcriptome. Select Nucleotide BLAST, insert the sequences in the empty box and select the organism of interest. Keep the remaining parameters as default and click BLAST.\n\t\tNote: Even partial continuous alignment of 8-10 nts can lead to cross-hybridization and recovery of this mRNA.\n2. Cell Culture, UV Irradiation and Cell Lysis\nNote: In the following, the procedure is described for budding yeast S. cerevisiae, nematodes C. elegans, and human embryonic kidney cells (HEK293). Nevertheless, it can be adapted to other organisms as well, although it was not explicitly tested yet.\nS. cerevisiae\nGrow yeast cells (e.g., strain BY4743 derivate; MATa/α his3Δ1/his3Δ1 leu2Δ0/leu2Δ0 LYS2/lys2Δ0 met15Δ0/MET15 ura3Δ0/ura3Δ0 PFK2:TAP/PFK2) in 500 mL of YPD media (1% yeast extract, 2% peptone, 2% D-glucose) at 30 °C with constant shaking at 220 rpm.\nCollect the cells at mid-log phase (optical density at 600 nm (OD)600 ~ 0.6) by filtration using 0.45 µm nylon filters or by centrifugation at 3,000 × g for 2 min at room temperature (RT). Discard the flow-through or the supernatant, respectively.\nWash the cells three times with 25 mL of phosphate-buffered-saline (PBS) using the 0.45 µm nylon filter or collect by centrifugation at 3,000 × g for 2 min at RT and discard the supernatant. Collect the cells as quickly as possible as the imposed stress could have an impact on RNA-protein interactions.\nResuspend the cells in 25 mL of PBS and then pour the suspension in a 15 cm Petri dish. Place the dish on ice, remove the lid, and expose the cells three times with 400 mJ cm-2 of 254 nm UV light in a UV-crosslinker with 2-min breaks on ice between each exposure cycle with gentle mixing.",
    "Transfer the cells to a 50 mL tube and collect the cells by centrifugation at 3,000 × g for 3 min at 4 °C. Discard the supernatant and keep the pellet.\n\t\tNote: Cells can be snap frozen in liquid nitrogen and stored at -80 °C.\nResuspend the cells in 4 mL of chilled lysis buffer A (LB-A; 100 mM Tris-HCl, pH 7.5, 500 mM LiCl, 10 mM EDTA, 1% Triton X-100, 5 mM DTT, 20 U ml-1 DNase I, 100 U ml-1 RNasin, complete EDTA-free protease-inhibitor cocktail).\nTransfer the cells into two 2 mL tubes. Add max. ⅔ volumes of chilled glass beads and disrupt the cells in a tissue lyser at 30 Hz for 10 min at 4 °C.\nPunch a hole in the bottom of the tube with a hot needle and transfer the lysate to a fresh 1.5 mL tube by centrifugation at 600 × g for 30 s.\nClear the lysate by three sequential centrifugations at 4 °C at 3,000 × g for 3 min, then 5,000 × g and 10,000 × g for 5 min each.\n\t\tNote: Extracts can be snap-frozen in liquid nitrogen and stored at -80 °C.\nC. elegans\nCulture Bristol N2 worms at 20 °C on Nematode Growth Medium (NGM) plates (0.3% NaCl, 1.7% agar, 0.25% peptone, 1 mM CaCl2, 5 µg/mL cholesterol, 1 mM MgSO4, 25 mM KPO4 buffer, pH 6.0) seeded with the OP50 Escherichia coli strain41.",
    "Add 5 mL of M9 buffer41 (0.3% KH2PO4, 0.6% Na2HPO4, 0.5% NaCl, 1 mM MgSO4) to each plate, shake the plate to resuspend the worms and transfer the worms to a 15 mL tube. Place 2 µL of the suspension in a slide and count the worms in the suspension with a microscope. Then apply the factor to calculate the number of worms per plate.\nCollect ~ 120,000 worms by centrifugation at room temperature (400 × g, 2 min, RT) and discard the supernatant.\nWash the worms three times. Therefore, add 10 mL of M9 buffer, mix by inversion and collect the worms by centrifugation at 400 × g for 2 min at RT.\nAdd 15 mL of M9 buffer to the worms and place on a rotatory wheel for 15 min at RT.\nTransfer the worms to NGM plates (~4,000 worms per plate) and expose to UV-light (254 nm) at 300 mJ cm-2 in a UV-crosslinker.\nAdd 5 mL of M9 buffer directly to the plate and shake the plate to resuspend the worms in the buffer. Transfer the suspension with a pipette to a 15 mL tube and collect the worms by centrifugation at 400 × g for 2 min at RT.\nResuspend the worms in 2 mL of lysis buffer B (LB-B; 100 mM Tris-HCl, pH 8.0, 150 mM NaCl, 1 mM EDTA, 0.75% IGEPAL, 1 mM DTT, 20 U mL-1 DNase I, 100 U mL-1 RNasin, complete EDTA-free protease-inhibitor cocktail).\nGrind the worms in a mortar filled with liquid nitrogen. Collect the powder in a 50 mL tube and thaw at RT.\n\t\tNote: Liquid nitrogen must be handled according to safety procedures (e.g., fume hood and safety gloves)",
    "Clear the lysate including the fat layer by centrifugation at 14,000 × g for 10 min and subsequently pass the clarified lysate through a 0.45 μm filter with a syringe.\nHuman cultured cells \n\tNote: The following description is based on transient transfection of HEK293 cells with pGL3-CDKN1B-3’UTR reporter plasmid that expresses the 3′UTR of CDKN1B/27 downstream of the firefly luciferase gene42.\n\t\nCulture HEK293 cells in Dulbecco’s Modified Eagle’s Medium (DMEM) containing 25 mM glucose and 1 mM sodium pyruvate, supplemented with 100 U mL-1 penicillin, 100 µg mL-1 streptomycin and 10% fetal bovine serum (FBS), and incubate at 37 °C in a humidified chamber (incubator) containing 5% CO2.\nSeed ~3×106 HEK293 cells in a standard 10 cm tissue culture dish the day before the transfection. Count the cells with a hemocytometer.\nMix 2 µg of the reporter gene (e.g., pGL3-p27-3’UTR) with 20 µL of transfection reagent and transfect the cells at 70% confluency (~7×106 cells).\nPlace the cells in an incubator at 37 °C for further 48 h before harvesting.\nRemove the medium with a serological pipette and quickly wash the cells twice with 10 mL of PBS pre-warmed at 37 °C. Remove PBS with a serological pipette.\nAdd 6 mL of PBS to the dish, place on ice and then expose the cells to UV light (254 nm) at 100 mJ cm-2 in an UV-crosslinker.\n\t\tNote: The plate must be kept on ice during UV-light exposure.\nScrape off the cells (in total ~107 cells) in PBS and transfer to a 15 mL tube.\nSpin down the cells at 250 × g for 10 min at 4 °C and then remove the supernatant with a pipette.\n\t\tNote: The cell pellet can be snap-frozen in liquid nitrogen and stored at -80 °C until use.",
    "Resuspend the cells in 2 mL of pre-chilled lysis buffer (LB-A) by pipetting up and down for 5-6 times, while keeping the tube on ice.\nTransfer the lysate with a pipette to a 5 mL tube placed on ice.\nSubject the lysate to three rounds of sonication consisting of 20 s bursts at 10 μm amplitude with 30 s of cooling periods on ice.\n\t\tNote: Sonication is recommended as it completes lysis of cells and fragments the DNA.\nTransfer the lysate to 2 mL tubes and centrifuge at 15,000 × g for 10 min at 4 °C. Collect the supernatant (=extract) and transfer to a new tube. Remove an analytical sample (5-10%) for further protein and RNA analysis.\n\t\tNote: This step is critical to remove any remaining cell debris and can be repeated.\n3. First Step: Poly(A) RNA Isolation\nEquilibrate 1 mg of oligo(dT)25-coupled magnetic beads in 500 µL of the respective lysis buffer.\nCombine 5 mg, 10 mg or 4 mg (protein) of S. cerevisiae, C. elegans or HEK293 extracts, respectively, with 1 mg of oligo(dT)25 -coupled magnetic beads. Mix the samples vigorously for 10 min at 25 °C in a mixer.\n\tNote: Protein concentrations of extracts can be determined with Bradford assay using bovine serum albumin (BSA) as a reference standard. Vigorous shaking of samples prevents sedimentation of beads. To evaluate the specificity of mRNA isolation, a control experiment can be performed in parallel by adding an excess (20 µg) of polyadenylic acids (pA).\nPlace the tubes on a magnetic stand for 10 s and remove the supernatant. Keep the supernatant on ice for subsequent rounds of recovery (step 3.7).",
    "Add 500 µL of wash buffer A (10 mM Tris-HCl, pH 7.5, 600 mM LiCl, 1 mM EDTA, 0.1% Triton X-100) to the beads and vortex for 5 s.\n\tNote: The concentration of LiCl in the wash buffers can vary. 600 mM LiCl is recommended but lower concentrations were also tested (500 mM for C. elegans, 300 mM for HEK293).\nCollect the beads with a magnet and then wash the beads twice with 500 µL of wash buffer B (WB; 10 mM Tris-HCl, pH 7.5, 600 mM LiCl, 1 mM EDTA).\nElute the RNA in 30 µL of 10 mM Tris-HCl, pH 7.5 at 80 °C for 2 min with continuous shaking (1,000 rpm) in a mixer. Immediately place the tube in the magnetic stand and collect the eluate after 10 s. Save the beads for additional rounds of purification.\n\tNote: Collect the eluate as quickly as possible to prevent potential rebinding of mRNAs to the beads at lower temperatures.\nAdd the beads from previous step to the supernatant collected at step 3.3, and repeat the capture, washing and elution of mRNAs twice (steps 3.3-3.6). The eluates from repeated rounds are then combined and can be stored at -80 °C.\n4. Second step: Capturing of Specific mRNAs with 3’-Biotinylated 2’-Methoxy Modified Antisense RNA Oligonucleotides\nNote: To test the suitability of ASOs, the following procedure can be performed with total RNAs isolated from cells.\nEquilibrate 30 µL of streptavidin-coupled magnetic beads in 1 mL of binding and wash buffer (B&W buffer; 10 mM Tris-HCl, pH 7.5, 150 mM NaCl, 0.5 mM EDTA, pH 8.0) containing 0.1 mg mL-1 Escherichia coli transfer RNA (tRNA) on a rotator for 1 h at RT.\n\t\nWash the beads three times with 750 µL of B&W buffer.",
    "Resuspend the beads in 30 µL of B&W buffer and keep on ice until use.\nDilute ~35 µg of total protein from the previous poly(A) isolation (see 3) in 100 µL of B&W buffer in a 1.5 mL tube.\n\tNote: To test the specificity of ASOs with total RNA, add 600 ng of purified total RNA to 100 µL of B&W buffer.\nAdd 200 pmol of the respective ASO and incubate at 70 °C for 5 min.\n\tNote: The elevated temperature resolves secondary structures in the RNA facilitating the annealing of the ASO.\nRemove the entire heat-block from the device and place it at RT for 10 min to cool down slowly.\nAdd 30 µL of equilibrated streptavidin-coupled magnetic beads from step 4.1 to the sample.\nIncubate the mixture for 30 min at 25 °C with constant shaking at 950 rpm in a mixer.\n\tNote: It is recommended to flick the tubes every 10 min to prevent sedimentation of beads.\nPlace the tubes on the magnetic stand, remove the supernatant and wash the beads three times with 750 µL of pre-warmed B&W buffer at 55 °C.\n\tNote: The optimal wash temperature may slightly differ/vary between different ASOs. It is recommended to adjust this condition with non-crosslinked total RNA prior performing the experiment with cell extracts.\nElute the RNA in 20 µL of 10 mM Tris-HCl, pH 7.5 at 90 °C for 10 min with constant shaking at 950 rpm in a mixer. Place the tubes in the magnetic stand and immediately collect the eluate.\n\tNote: For protein analysis, add 20 µL of 1× Laemmli buffer to the beads and incubate at 95 °C for 5 min. Proteins are monitored by immunoblot analysis following standard laboratory protocols."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}