{
  "id": 7531,
  "origin_website": "Bio",
  "title": "Laser Microirradiation and Real-time Recruitment Assays Using an Engineered Biosensor",
  "procedures": [
    "Cell preparationFor this protocol, we used U-2 OS cells stably expressing the H2AK13/15Ub sensor Reader1.0-EGFP under the control of a doxycycline (Dox)-inducible promoter (dos Santos Passos et al., 2021). Stable cell lines and plasmids encoding Reader1.0-EGFP for transient or stable expression in mammalian cells are available from the corresponding author (T.Y.; tingting.yao@colostate.edu) and will be deposited with Addgene.org.Procedure for 35 mm glass bottom dish:Day 1 – Seed cells for transfection:Seed 3 × 105 cells per dish in 2 mL of growth medium to obtain approximately 70% confluency the next day.Incubate for 16-24 h at 37°C in a 5% CO2 incubator.Day 2 – Transfect cells with mCherry-BP1-2 pLPC-Puro (mCherry-53BP1-FFR):Prepare the DNA-Lipofectamine 3000 complex as follows: dilute 0.5 µg plasmid DNA in 125 µL of Opti-MEM I, then add 1 µL of P3000 reagent B and mix well (Tube A). In a separate tube, add 1 µL of Lipofectamine 3000 reagent A in 125 µL of Opti-MEM I and mix well (Tube B). Add the diluted DNA from Tube A to the diluted Lipofectamine 3000 reagent in Tube B, mix gently, and incubate at room temperature for 15 min.Add DNA-Lipofectamine 3000 complex to cells in a dropwise fashion.Incubate for 16–20 h at 37°C in a 5% CO2 incubator.Day 3 – Induce Reader1.0-EGFP expression with 0.1 µg/mL Dox:Aspirate to remove the medium and rinse with 2 mL of PBS.Add 2 mL of live-cell medium supplemented with 0.1 µg/mL Dox.Incubate for 4 h at 37°C in a 5% CO2 incubator.Perform laser microirradiation and real-time recruitment as in ‘B’.Laser microirradation and real-time recruitmentNote 1: Experiments require a confocal laser scanning microscope equipped with 405, 488, and 561 laser lines for fluorescence excitation and a stage incubator to maintain 37°C and a humidified 5% CO2 atmosphere.",
    "The experiments described here were conducted using a Zeiss LSM 880 inverted microscope. Note 2: Previous experience with confocal laser scanning microscopy is required to execute this protocol. Note 3: The LSM 880 microscope is a laser hazard class 3B instrument. Users must take care to not expose themselves to the radiation and, in particular, never look into the laser beam. Only personnel instructed on laser safety should be allowed to operate the system. Turn on the microscope and set the temperature of the stage incubator to 37°C and the CO2 concentration to 5%.Wait for the temperature and CO2 concentration to stabilize (approximately 15 min) and then transfer the 35 mm glass-bottom culture dish to the stage incubator of the microscope.Acquire pre-microirradiation images of cells co-expressing mCherry-53BP1-FFR and Reader1.0-EGFP according to the parameters below and save the images as .czi files:mCherry-53BP1-FFR was excited at 561 nm and the fluorescence emission was collected using the 488/543/633 main dichroic beam splitter (MBS) and the Gallium Arsenide Phosphide (GaAsP) photomultiplier (PMT) detector (Figure 1).Reader1.0-EGFP was excited at 488 nm and the fluorescence emission was collected using the 488/543/633 MBS and the GaAsP PMT detector (Figure 2).Note: The 405 MBS for invisible light should be selected considering that the 405 nm diode laser will be used to microirradiate the cells to generate local DNA damage. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4337/bioprotoc-12-05-4337-g001.jpgFigure 1. Zen Black software setting for mCherry-53BP1-FFR imaging. Note: The ‘Imaging Setup’, ‘Acquisition Mode’, and ‘Channels’ tabs will automatically open when Zen Black is started. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4337/bioprotoc-12-05-4337-g002.jpgFigure 2. Zen Black software setting for Reader1.0-EGFP imaging. Configure the microscope for the microirradiation experiment:In the ‘Acquisition’ tab, check the boxes ‘Time Series’, ‘Bleaching’, and ‘Regions’ (Figure 3A).Expand the ‘Bleaching’ tool tab and set up the conditions for laser microirradiation according to Figure 3B.",
    "Note: It may be necessary to test different laser intensities in ‘Excitation of Bleach’ in order to efficiently induce DNA damage. Expand the ‘Time Series’ tool tab and define the number ‘Cycles’ (number of frames to be acquired) and the time ‘Interval’ between cycles (Figure 3C).Expand the ‘Regions’ tool tab to define the Region of Interest (ROI) in the nucleus that will be microirradiated with the 405 nm laser (Figure 3D).Note: In this example, the ROI for laser microirradiation was a rectangle 300 × 5 pixels (L × W). Considering that the scanner is configured to move along the y-axis, to generate a uniform amount of damage, only the width (W = 5 pixels) of the irradiated ROI needs to be kept constant. The length (L) of the rectangle may be adjusted within the confines of the area of the nucleus. After verifying the settings, go to the ‘Acquisition’ tab and hit the ‘Start Experiment’ button (Figure 3A).Note: Make sure to select both the 488 nm and the 561 nm tracks for image acquisition. The real-time recruitment of mCherry-53BP1-FFR and Reader1.0-EGFP to the irradiated tracks can be monitored in the ‘Mean ROI’ view tab in Zen Black (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4337/bioprotoc-12-05-4337-g003.jpgFigure 3. Zen Black software settings for laser microirradiation and real-time recruitment. (A) ‘Acquisition’ tab. (B) ‘Bleaching’ tool tab. (C) ‘Time Series’ tool tab. (D) ‘Regions’ tool tab and example depicting the Region of Interest (ROI) that will be microirradiated.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4337/bioprotoc-12-05-4337-g004.jpgFigure 4. Laser microirradiation and real-time recruitment of mCherry-53BP1-FFR and Reader1.0-EGFP to DSBs. (A) U-2 OS cells co-expressing mCherry-53BP1-FFR and Reader1.0-EGFP were microirradiated using the 405 nm laser and fluorescence redistribution to the laser-induced DSBs were extracted from background-corrected individual frames (ROI 1: DSB track; ROI 2: background). (B) Representative images of the irradiated cell at the indicated time points. (C) Reader1.",
    "0-eGFP and mCherry-53BP1-FFR showed similar rates of recruitment to DNA lesions (n = 12)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}