{
  "id": 2132,
  "origin_website": "Cell",
  "title": "Single-sister labeling in the C. elegans germline using the nucleotide analog EdU",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEdU incorporation in C. elegans\nTiming: 1.5 h\nThis brief pulse of EdU is sufficient to achieve single-sister incorporation of EdU in germline nuclei. Figure 1[href=https://www.wicell.org#fig1] illustrates key steps.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1613-Fig1.jpg\nFigure 1. EdU incorporation into C. elegans\n(A) Pipetting M9/Triton X onto a plate of L4 worms.\n(B) Aspirating M9/Triton X with L4 worms.\n(C) Transferring M9/Triton X and L4 worms to a fresh 1.5 mL tube.\n(D) Spinning down worms.\n(E) Washing once with M9/Triton X.\n(F) Aspirating 40 μL of M9/Triton containing the worms into a fresh 1.5 mL tube.\n(G) Adding 60 μL of 10 mM EdU.\n(H) Vortexing gently to mix worms and EdU.\n(I) Placing worms and EdU onto a nutator.\nCollect 50–100 age matched L4 or young adult (12–24 h post-L4) C. elegans hermaphrodites for EdU incorporation.\nNote: Chase times vary depending on the animals’ age when EdU incorporation occurs and on the temperature at which the chase is conducted. The slowdown of nuclei movement in the gonad with aging means that chase times for worms incorporating EdU as L4s will be shorter than those that incorporate EdU as young adults (∼24 h post L4). Since the rate nuclei move through the gonad slows dramatically as the animal ages (Tolkin and Hubbard, 2021[href=https://www.wicell.org#bib19]), an age-matched population facilitates consistent and repeatable results for the chase. Animals could be synchronized by picking L4 animals onto a new seeded plate and incubating for 12–24 h, or by bleaching gravid adults to obtain eggs (Porta-de-la-Riva et al., 2012[href=https://www.wicell.org#bib16]). Further synchronization could be achieved by starving embryos to obtained synchronized L1s (Hibshman et al., 2021[href=https://www.wicell.org#bib8]); however, we have found this additional step is not necessary to achieve sufficient synchronization for this protocol.",
    "Note: In the examples shown here we incorporated EdU into N2 and him-8 worms at the L4 stage and at 24 h post L4 (young adult), and chased them for 24, 27 and 30 h to obtain single-sister labeling at diakinesis (See expected outcome[href=https://www.wicell.org#expected-outcomes]).\nTransfer population of worms to a tube for EdU labeling.\nAdd 1 mL M9/Triton X solution to the plate (Figure 1[href=https://www.wicell.org#fig1]A), swirl gently 3–5 times and aspirate the liquid with the worms into a clean 1.5 mL tube (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nNote: The small concentration of Triton X prevents worms sticking to plastic surfaces on the tube and the pipette tip with minimal effects on the worms (Peter Boag, personal communication).\nSpin down worms using a tabletop centrifuge for 30 s at 2,500 g (Figure 1[href=https://www.wicell.org#fig1]D). Aspirate as much of the supernatant as possible without disturbing the loose worm pellet and wash an additional time with 1 mL M9/Triton X to remove excess bacteria (Figure 1[href=https://www.wicell.org#fig1]E; it is not necessary to completely remove bacteria).\nTransfer the bottom 60 μL of M9/Triton X which contains the age-matched worms to a clean 1.5 mL tube (Figure 1[href=https://www.wicell.org#fig1]F).\nNote: This ensures precise volume of liquid.\nAdd 40 μL of 10 mM EdU in water to the worms (final concentration: 4 mM EdU in 100 μL total volume; Figure 1[href=https://www.wicell.org#fig1]G).\nVortex gently (Figure 1[href=https://www.wicell.org#fig1]H), and then transfer tube with worms to a nutator for 40 min at 20°C–25°C at 80 RPM (Figure 1[href=https://www.wicell.org#fig1]I).\nAfter 40 min, wash worms 2× with 1 mL M9/Triton X (as in step 2b above).\nSpin down as above, and aspirate all but ∼50–100 μL of solution without disturbing the loose worm pellet.",
    "Transfer the ∼50–100 μL of the solution containing the worms to a fresh NGM plate and let dry for 10–30 min or until all liquid has been absorbed. Plates can be left open in a chemical hood to facilitate drying.\nTransfer plates to an incubator set to the desired temperature and note time as the beginning of the chase. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nCritical: Chase times throughout this protocol begin AFTER EdU incorporation is complete (i.e., if worms incorporate EdU for 40 min starting at 10:00 AM, then the chase time starts at 10:40 AM).\nChase times are highly dependent on age and rearing temperature. Visualization of labeled single sister at diakinesis is generally possible with ∼27 h chase for wild type (N2) worms that incorporate EdU as L4s and chased at 20°C. Longer chase time are required when EdU is incorporated to adults compared to L4s, and when worms are grown at 15°C compared to 20°C. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nDissection, fixation, and immunofluorescence of C. elegans gonads\nTiming: 5–6 h\nAdapted from (Phillips et al., 2009[href=https://www.wicell.org#bib15]). Consult the protocol for additional explanations and usage notes.\nMake EBT, Fix and Roche Blocking solutions fresh.\nCritical: Formaldehyde is a crosslinking agent. Prepare Fix solution using gloves in a well-ventilated area or a fume hood.\nPlace a Coplin jar with methanol in a −20°C freezer and place a metal block on dry ice. Prepare a humid chamber (see step 20 below).\nCritical: Methanol is a crosslinking agent. Use gloves when handling methanol.\nNote: Label all HistoBond slides with pencil, as methanol will dissolve ink-based marks.\nDissect age-matched adults.\nPlace a coverslip on top of a glass slide under a dissection microscope (Figure 2[href=https://www.wicell.org#fig2]A). Fit a scalpel blade into a scalpel holder (Figure 2[href=https://www.wicell.org#fig2]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1613-Fig2.jpg\nFigure 2. Dissection and Fixation of C. elegans gonads",
    "(A) Placing a 22 × 22 mm coverslip onto a transparent glass slide on a dissecting stereo microscope.\n(B) Attaching a fresh blade to a scalpel handle (Caution - blades are very sharp!).\n(C) Adding EBT solution to the center of the coverslip.\n(D) Transferring worms by picking into the EBT solution.\n(E) Dissecting C. elegans gonads by using the scalpel to remove the head or tail of the animal.\n(F) Adding fix solution to the worms in EBT.\n(G) Aspirating as much liquid as possible (∼45 μL), being careful not to aspirate the worms.\n(H) Gently touching the bonded side of the slide to the coverslip - the coverslip and worms should stick to the Histobond slide.\n(I) Transferring the slide, coverslip facing up, onto an ice block cooled on dry ice.\n(J) Using a razor blade, flicking off the coverslip by inserting the blade under a corner and gently prying.\n(K) Transferring the slide into 100% methanol cooled to −20°C.\n(L) Transferring slides to a fresh Coplin jar of PBST.\nCritical: Scalpel blades are very sharp and should be handled with caution.\nPipette 30 μL of EBT onto the coverslip (Figure 2[href=https://www.wicell.org#fig2]C). Pick 10–30 worms into the drop of EBT (Figure 2[href=https://www.wicell.org#fig2]D) and allow 30–60 s for worms to anesthetize.\nCut the heads and/or tails off the worms to extrude the gonads (Figure 2[href=https://www.wicell.org#fig2]E).\nAfter all animals are dissected, pipette 30 μL of Fix solution into the drop of dissected worms (Figure 2[href=https://www.wicell.org#fig2]F).\nPipette up and down 3–5 times to mix the solutions and help release more gonads.\nLeave the Fix solution on for 1 min.\nAspirate excess liquid, leaving as little as possible remaining (∼15 μL) while trying to keep the worm carcasses separated from one another (Figure 2[href=https://www.wicell.org#fig2]G).",
    "Pick up the drop by lightly touching a HistoBond (75 × 25 × 1 mm) microscope slide on top of it (Figure 2[href=https://www.wicell.org#fig2]H).\nNote: Try to get as many worm carcasses as possible in the middle of the slide, avoiding the edges.\nFreeze the sample by placing it on the ice block for >1 min (Figure 2[href=https://www.wicell.org#fig2]I). Ice crystals will form between the slide and the coverslip. Slides can be kept on ice until all samples are dissected (∼30–60 min).\nRepeat steps 8–11 until all samples are dissected.\nFreeze-crack: Carefully flick off the cover slip by inserting a razor blade under the edge of the coverslip (Figure 2[href=https://www.wicell.org#fig2]J).\nCritical: Coverslips can shatter during freeze crack. Glass shards are very sharp and should be handled with care. Collect all broken coverslips, and carefully place in the glass waste.\nPlace the slide immediately in −20°C methanol (Figure 2[href=https://www.wicell.org#fig2]K), incubate for one minute, and then transfer the slides to a fresh Coplin jar of PBST at 20°C–25°C using forceps (Figure 2[href=https://www.wicell.org#fig2]L).\nRepeat steps 12–13 until all samples are in PBST.\nNote: Multiple slides could be placed in a single Coplin jar. However, if the slides touch each other, the worm carcasses might be washed off. Make sure each slide uses separate railings in the Coplin jar.\nWash slides three times in PBST (5–10-min per wash; Figure 2[href=https://www.wicell.org#fig2]L).\nBlock slides in 1× Roche Block in a Coplin jar for 30 min to 2 h at 20°C–25°C, or 12–16 h at 4°C. Save 100 μL/slide for the 1° antibody solution buffer (e.g., 3 slides = 300 μL; Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1613-Fig3.jpg\nFigure 3. Antibody staining of C. elegans gonads\n(A) Blocking slides in 1× Roche Block.\n(B) Adding 100 μL of primary antibody solution to a parafilm square (one square per slide).",
    "(C) Removing slide from PBST and gently drying the back of the slide, taking care not to disturb the worms stuck to the front of the slide.\n(D) Preparing the humid chamber by wetting a paper towel and placing it on the bottom of a perforated chamber with a lid.\n(E) Gently touching the slide (worms down) to the primary antibody. The parafilm should stick to the slide.\n(F) Incubating the slides, parafilm side up, in a humid chamber with the lid closed.\n(G) Transferring slides to a fresh, fully filled Coplin jar of PBST, allowing the parafilm squares to float to the top. Steps depicted in panels (B–G) are repeated for the secondary antibody labeling and click chemistry steps.\nAlternatives: Blocking can also be done in Normal Goat Serum (NGS 1:10 in PBST) or BSA (0.5% in PBST); however, these solutions should be assessed for compatibility with each antibody.\nPrimary Antibody (1°): Prepare antibody solution in Roche block (from step 15).\nMix by flicking the tube or by gently pipetting up and down. DO NOT VORTEX.\nNote: For the examples shown here, we have used a guinea pig antibody against HTP-3 at 1:500 concentration. For conventional applications, up to two different antibodies could be used, with one channel used for EdU labeling (in the examples shown here, 488), and 405 for DAPI.\nPrepare parafilm squares slightly thinner than the width of the slides. Apply 100 μL of 1° antibody solution to the parafilm; avoid forming bubbles (Figure 3[href=https://www.wicell.org#fig3]B).\nCarefully wipe the slides (avoid touching the worm carcasses; Figure 3[href=https://www.wicell.org#fig3]C). Make sure the area containing the carcasses never gets dry.\nTouch the slide face down to the parafilm slip with antibody, ensuring all carcasses are immersed in liquid (Figure 3[href=https://www.wicell.org#fig3]E).",
    "Incubate in a humid chamber for 2 h at 20°C–25°C, or 12–16 h at 4°C (Figure 3[href=https://www.wicell.org#fig3]D and 3F).\nRemove the parafilm squares by carefully dipping each slide in a Coplin jar of PBST and letting the parafilm square float off (Figure 3[href=https://www.wicell.org#fig3]G). Pick the parafilm squares with forceps and discard.\nNote: Do not drag the parafilm squares on the railings while you place the slide in the Coplin jar. This might release the gonads from the slide.\nWash slides three times (10 min/wash) by moving slides to fresh Coplin jars of PBST.\nSecondary Antibody (2°): Prepare secondary antibody solution in PBST.\nNote: For the images shown here, we used a Cy3 anti-guinea pig secondary at 1:500 in PBST. For conventional applications, two antibodies could be used, with the EdU occupying one channel (in our case, 488), and the DAPI utilizing the 405 channel. Mix by gently flicking the tube or pipetting up and down. DO NOT VORTEX.\nRepeat steps 17–19 with secondary antibody in PBST.\nRemove the parafilm by floating, and wash in a fresh Coplin jar of PBST for 10 min at 20°C–25°C.\nNote: It is typical for some worm carcasses to be washed off during wash steps. To reduce the number of worms lost, be sure to aspirate as much liquid as possible between dissection and freezing (step 9). This can help the worms stick better to the slides. In addition, make sure the slides do not rub against each other or against the sides of the Coplin jar, and that the parafilm does not drag on the rails of the Coplin jar (steps 21 and 24). Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nFluorescent labeling of EdU via click chemistry\nTiming: 1–2 h",
    "Reaction with an azide-containing fluorophore and CuSO4 allows for rapid and specific labeling of DNA strands containing EdU by covalently linking the fluorophore to the DNA. A crucial advantage compared to using 5-bromo-2′-deoxyuridine (BrdU) is that access to the alkene group on EdU does not require denaturing of the DNA.\nCritical: Always perform click reaction after primary and secondary antibody labeling. Reaction with CuSO4 has the potential to damage epitopes and inhibit antibody labeling. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nTransfer slides to a fresh Coplin jar of PBS with 1% Triton X (v/v) for 30 min at 20°C–25°C.\nNote: We found that this permeabilization step helps with the click reaction, likely by facilitating the entry of the click chemistry reagents into the dissected gonad.\nPrepare the Click-iT™ reagents fresh for each experiment according to the kit’s specifications.\nApply 100 μL of Click-iT™ solution onto fresh parafilm squares and gently touch the slides to the liquid as shown in Figure 3[href=https://www.wicell.org#fig3]E. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nPlace in humid chamber for 30 min at 20°C–25°C.\nFloat parafilm squares off and then wash slides twice for 5 min in PBST.\nDNA labeling with DAPI. Add DAPI (Stock: 5 mg/mL in H2O; 1:10,000 dilution for 0.5 μg/mL final concentration) to a Coplin jar of PBST and mix gently.\nPlace slides in the DAPI-containing Coplin jar and incubate for 20 min at 20°C–25°C.\nWash slides for 5 min in PBST.\nMount slides using either NPG-glycerol (see Solutions, above) or Prolong Glass Antifade Mounting Media.\nIf using NPG-glycerol:\nPipette ∼11 μL of NPG-glycerol (you may have to cut the pipette tip - the NPG-glycerol is viscous) onto a high-Performance coverslip (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1613-Fig4.jpg\nFigure 4. Mounting and sealing\n(A) Adding 1 drop (∼12 μL) of Prolong Glass or NPG-Glycerol to a fresh coverslip.",
    "(B) Gently touching the samples to the mounting media on the coverslip.\n(C) If using NPG-Glycerol, aspirating excess mounting media using a pipette tip connected to a vacuum trap.\n(D) Sealing the slides with nail polish.\n(E) Storing slides covered at 4°C or −20°C before imaging.\nDry the slide as much as possible using a paper towel to aspirate liquid around the worms (do not touch the worm carcasses!), and then gently touch the slide to the mounting media (Figure 4[href=https://www.wicell.org#fig4]B).\nRemove excess mounting media using a pipette tip connected to a vacuum trap (Figure 4[href=https://www.wicell.org#fig4]C).\nSeal with nail polish (Figure 4[href=https://www.wicell.org#fig4]D).\nIf using Prolong Glass:\nPlace a small drop of mounting media onto a high-Performance coverslip (Figure 4[href=https://www.wicell.org#fig4]A).\nDry the slide as much as possible using a paper towel to aspirate liquid around the worms (do not touch the worm carcasses!), and then gently touch the slide to the mounting media (Figure 4[href=https://www.wicell.org#fig4]B).\nCure for 24 h at 20°C–25°C by placing in a dark box or drawer before sealing with nail polish (Figure 4[href=https://www.wicell.org#fig4]E).\nStore slides in a covered container at 4°C or −20°C (Figure 4[href=https://www.wicell.org#fig4]E).\nPause point: Generally, slides can be stored in PBST at any point during the IF or click reaction for up to 48 h (essentially extending any of the PBST washes, e.g., steps 14, 22, 24 or 27B). After mounting and sealing, slides can typically be stored covered for 60 days at 4°C or −20°C with minimal loss of signal.\nVisualization of labeled C. elegans gonads\nTiming: 1–2 h\nImaging was done using a Zeiss LSM880 confocal microscope equipped with AiryScan and running ZEN Black 2.3, as described below. However, various other microscopes or imaging modalities such as widefield microscopes are also compatible with this protocol.",
    "Using a standard dissection microscope, place the slide coverslip down by propping it on two slides. Locate the gonads (since the gonads are transparent, tilting the oblique illumination will help) and mark each gonad with a dot or a circle using a black pen.\nNote: This will help locating the sparse gonads when placed under a high-magnification objective on the confocal microscope (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1613-Fig5.jpg\nFigure 5. Imaging C. elegans gonads stained for EdU\n(A) Placing slide coverslip down onto a dissecting scope, between two clear slides with tape.\n(B) Locating the worm carcasses (black arrows) and marking them with a nearby dot.\n(C) Mounting slide coverslip down onto your imaging platform. Use the black dots to help locate the sample and image.\nMount slides on the microscope and locate samples using the black dots. Locate the diakinesis stage, which is located on the proximal end of the gonad. In the DAPI channel, this region of the gonad is occupied by large oocytes that appear as mostly dark ovals with a few bright bodies clustered together (see expected outcome[href=https://www.wicell.org#expected-outcomes]; Figure 8[href=https://www.wicell.org#fig8]).\nNote: It is useful to also check the EdU channel by eye to ensure that your samples are correctly labeled (Figure 5[href=https://www.wicell.org#fig5]C).\nImage the diakinesis nuclei by creating a z-stack, covering a volume of about 6–7 μm in depth.\nNote: Diffraction-limited microscopy will be required to observe single sister chromatids. We have used a confocal microscope, Zeiss LSM880 in an AiryScan mode. However, similar results could be obtained with other confocal or widefield microscopes capable of capturing diffraction-limited images. Troubleshooting 6[href=https://www.wicell.org#troubleshooting].\nNote: For images taken with the LSM880 in AiryScan mode, typical acquisition parameters are:\nPixel size = 0.04 μm.\nPixel dwell = 0.75–1.00 μs.\nZ-spacing = 0.159 μm.\nRepeat steps 31–33 until all gonads are imaged.",
    "Process the images per the recommended practices.\nOn the LSM880 this includes ‘Airy Processing’ with default parameters.\nFor widefield microscopy processing will likely involve deconvolution."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}