{
  "id": 19030,
  "origin_website": "Jove",
  "title": "A Low Mortality Rat Model to Assess Delayed Cerebral Vasospasm After Experimental Subarachnoid Hemorrhage",
  "procedures": [
    "1.\tRat Surgery for SAH Subject Injected With 0.15 ml Autologous Arterial Blood\nThe rat is anesthetized using 0.1 mg/kg of Ketamine/Xylazine rodent cocktail and allowed to sit for 5 min.\nAdequate anesthesia is confirmed by reduction in hind limb reflex. \nUsing an electronic shaver a neck to nose area of hair around the sub-occipital region is shaved. \nThe animal is placed supine on the surgery table and the tail is swabbed with betadine to ensure a sterile incision. \nA straight 1 cm midline incision is taken on the ventral aspect of the tail\nThe dissection is extended until the tail artery is identified and isolated. \nUsing a sterile 26-gauge catheter, the tail artery is cannulated and 0.15 ml of arterial blood is withdrawn into a syringe.\nA sterile gauze is wrapped around the incision to ensure hemostasis before application of the vetbond to seal the incision. \nThe rat is turned prone on the table and the shaved area over the sub-occipital region is swabbed with betadine.\nUsing a vertical midline incision access is gained to the cisterna magna. \nOnce identified a 25 gauge needle is inserted into the cisterna magna and 0.15 ml of CSF is withdrawn into a syringe to avoid increased intracranial pressures with injection of autologous blood volume. \nNow, the 0.15 ml of blood extracted from the tail artery is injected slowly into the cisterna magna. \nThe needle is left in place for 30 sec to ensure clotting in the subarachnoid space and then carefully withdrawn. \nHemostasis is ensured and the incision is closed using a stapling device.\nThe animal is now placed prone on a warming surface with a 20 ° head down position for 20 min to allow blood to congeal in the cisterns around the basilar artery.",
    "Steps 1.1 to 1.15 are repeated during the second surgery 48 hr apart. \n2.\tRat Surgery for SAH Subject Injected with 0.15 ml Saline\nThe rat is anesthetized using 0.1 mg/kg of Ketamine/Xylazine rodent cocktail and allowed to sit for 5 min.    \nAdequate anesthesia is confirmed by reduction in hind limb reflex. \nUsing an electronic shaver a neck to nose area of hair around the sub-occipital region is shaved. \nThe animal is placed supine on the surgery table and the tail is swabbed with betadine to ensure a sterile incision. \nA straight 1 cm midline incision is taken on the ventral aspect of the tail \nThe dissection is extended until the tail artery is identified and isolated. \nUsing a sterile 26-gauge catheter, the tail artery is cannulated and 0.15 ml of arterial blood is withdrawn into a syringe. \nA sterile gauze is wrapped around the incision to ensure hemostasis before application of the vetbond to seal the incision. \nThe rat is turned prone on the table and the shaved area over the sub-occipital region is painted with betadine. \nUsing a vertical midline incision access is gained to the cisterna magna.\nOnce identified a 25 gauge needle is inserted into the cisterna magna and 0.15 ml of CSF is withdrawn into a syringe and the sample is stored. \nNow, the 0.15 ml of normal saline (37 °C) is injected slowly into the cisterna magna. \nThe needle is left in place for 30 sec and carefully withdrawn. \nHemostasis is ensured and the incision is closed using a stapling device. \nThe animal is now placed prone on a warming surface with a 20 ° head down position for 20 min. \nSteps 2.1 to 2.15 are repeated during the second surgery 48 hr apart. \n3.   Rat Sacrifice",
    "On day 5 after the second surgery, the rats are sacrificed by cardiac perfusion.    \nThe rat is given a fatal dose (0.2 ml/kg) of Fatal Plus (VORTECH PHARMACEUTICALS LTD., DEARBORN, MI) \nWith a vertical midline incision, the abdominal cavity is approached and the peritoneum is opened. \nAn anterior thoracotomy is performed and the heart is exposed.\nUsing a 26-gauge catheter connected to a phosphate buffer solution (PBS pH 7.4 and at 37 °) the animal is drained of blood and is then perfused with 4% paraformaldehyde.\nAfter ensuring adequate perfusion, the perfusion is stopped and the rat is brought over to the decapitation table. \nAfter decapitation, a bone rongeur is used to remove the cranium for brain removal. \nThe brain and brainstem are carefully extracted from the cranial vault and placed into a 4% paraformaldehyde solution and stored at 4 °C for 48 hr. \n4.\tCreating Sections to Assess Vasospasm\nThe rat brain that has now been submerged in 30% sucrose for 4 days is brought to the cryostat for sectioning.    \nOnce cryoprotected, 12 μM sections are created using the cryostat, with the Anterior Inferior Cerebellar artery (AICA) as the starting point to ensure inter-subject consistency. \n20 sections are created for each animal, ending at the Superior Cerebellar artery (SCA). \nThe sections are placed onto a glass slide and assessed for vasospasm using histological methodology\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}