{
  "id": 10109,
  "origin_website": "Jove",
  "title": "Procurement and Decellularization of Rat Hindlimbs Using an Ex Vivo Perfusion-Based Bioreactor for Vascularized Composite Allotransplantation",
  "procedures": [
    "Cadaveric male Lewis rats (300-430 g) obtained from the Toronto General Hospital Research Institute were used for all experiments. For all surgical procedures, sterile instruments and supplies were used to maintain aseptic technique (see the Table of Materials). All procedures were performed in compliance with guidelines from the Animal Care Committee at Toronto General Hospital Research Institute, University Health Network (Toronto, ON, Canada). A total of four hindlimbs were decellularized.\n1. Presurgical preparation\nPrepare 50 mL of 5% heparinized saline. From a 50 mL saline bag, take out 2.5 mL of saline solution using a 5 mL syringe and discard. Using a 5 mL syringe, add 2.5 mL of heparin to the saline bag. Invert the saline bag to mix its contents.\nPlace a cadaveric rat in a supine position under a blue pad. Shave the hindlimb and groin area circumferentially using an electric shaver and remove hair.\nBring the rat to the surgical station and apply Povidone iodine scrub solution using a gauze to the hindlimb and groin area. Subsequently, apply 70% isopropyl alcohol to wipe off the scrub solution using gauze.\nDiscard the blue pad from step 1.2 and change into new, sterile gloves.\n2. Procurement of rat hindlimb\nMake a skin incision using a #10 surgical blade and a #3 blade runner along the inguinal ligament level, moving from a lateral to a medial direction (Figure 1A). Use Adson forceps to hold the surrounding skin to ensure a smooth incision.\nWhen the underlying fat is exposed, use blunt dissection to carefully dissect through the fat. Locate the superior epigastric vessels.\nUse microscissors to dissect proximally and expose the underlying femoral nerve, artery, and vein at the inguinal ligament level.",
    "Under a dissection microscope, identify the femoral vessels and dissect the artery and vein proximally using fine forceps to obtain sufficient length from the bifurcation points of the arterial network (Figure 1B).\nLigate the femoral artery and vein separately using 6-0 sutures.\nConduct circumferential dissection around the remainder of the hindlimb without disrupting the ligated femoral vessels.\nTransect the femoral bone mid-length using a bone cutter.\nTo fully isolate the hindlimb, transect the ligated femoral vessels below the ligatures using microscissors.\nCannulate the femoral artery using a 24 G angiocatheter under the dissection microscope. Use fine forceps to insert the cannula carefully. Flush with heparinized saline until clear outflow is observed from the femoral vein.\nSecure the cannula by tying one suture around the cannulated vessel and another suture distally around the cannula itself. Ensure the cannula is placed proximally to prevent blocking the bifurcation points.\nSubmerge the procured hindlimbs in phosphate-buffered saline (PBS) until decellularization.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64069/64069fig01.jpg\nFigure 1: Procurement of rat hindlimb. (A) Marking of skin incision at the inguinal ligament level from lateral to medial. (B) View of the femoral vein and the femoral artery, which have been dissected proximally toward the inguinal ligament, indicated by the dotted line. Abbreviations: L = lateral; M = medial; FV = femoral vein; FA = femoral artery. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64069/64069fig01large.jpg]\n3. Preparation of solutions\nIn a 6 L glass flask, prepare a 5 L detergent reservoir of 0.25% sodium dodecyl sulfate (SDS) by dissolving 12.5 g of SDS powder in 5 L of ultrapure distilled water. Cover the opening of the flask with parafilm to seal it.",
    "In a 1 L glass jar, prepare 1 L of 0.25% SDS solution separately by dissolving 2.5 g of SDS in 1 L of ultrapure distilled water. Add a stir bar to mix the solution on a magnetic stirrer until all the SDS is dissolved.\nPrepare 1 L of 1x PBS wash solution with 1% Antibiotic-Antimycotic (AA) solution. In a 1 L flask, add 990 mL of 1x PBS solution and 10 mL of AA.\nSeparately, in a 500 mL glass jar, prepare 1x PBS + 1% AA solution again using 495 mL of 1x PBS solution and 5 mL of AA.\nPrepare 200 mL of 1% peracetic acid (PAA)/4% ethanol (EtOH) solution. Prepare this solution under a fume hood.\n4. Bioreactor and perfusion circuit construction\nNOTE: Refer to Figure 2 for the configuration of the bioreactor and perfusion circuit throughout the listed steps.\nIn a 500 mL chamber (plastic container), drill three holes (1/4 in) at the labeled locations in Figure 2: Port A is the inlet line, Port B is the replenishing line, and Port C is the outlet line. Remove and discard excess plastic. Spray and wipe the chamber with 70% ethanol.\nCut three 5 cm long silicone tubes and insert one halfway into each port of the chamber. Connect a male Luer connector on the opening of Port A facing the inside of the chamber and a female Luer connector on the other end of the tube outside of the chamber.\nConnect a female Luer connector at Port B and Port C on the ends of the tubes facing out of the chamber.\nIn an air-tight lid for the plastic container, drill one hole on the surface of the lid.",
    "Cut a 3 cm silicone tube and insert it into the hole of the lid. Ensure approximately 2 cm of the tube is located out of the lid, as shown in Figure 2.\nSterilize both the chamber and the lid with the tubing.\nCut two 30 cm silicone tubes using scissors. Connect a 1/16 in to a 1/8 in connector on one end of each tube.\nSeparately, cut two 12 cm silicone tubes using scissors. Connect a 1/16 in to a 1/8 in connector on one end of both tubes. Connect a male Luer connector on the other end of one tube and a female Luer connector to the other tube.\nSterilize all the tubing material from step 4.7 and step 4.8. Include two 3-stop pump tubings (1.85 mm) in the sterilization.\nPrepare three 3-way stopcocks, one syringe filter, two 1 mL serological pipettes, and one 10 mL syringe for the decellularization setup. Remove the filter from the 1 mL serological pipettes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64069/64069fig02.jpg\nFigure 2: Preparation of bioreactor and perfusion circuit construction. Apparatus shown of the perfusion circuit including (A) peristaltic pump and (B) corresponding cassettes for both inlet and outlet lines. (C, D) Silicone tubings of 12 cm and 30 cm are also shown with respective connectors. (E) Tubing for peristaltic pump (1.85 mm). Bioreactor chamber with labeled ports for (F) inflow, (G) replenishing port, and (H) outflow. (I) Bioreactor lid shown with ventilation port. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64069/64069fig02large.jpg]\n5. Decellularization of rat hindlimbs\nPlace the sterilized chamber and screw on three single-use 3-way stopcocks at the inlet, outlet, and replenishing lines. Ensure the stopcock for the replenishing port is capped at its remaining two ports to prevent leakage.",
    "Attach the tubes made in step 4.8 to the stopcocks at the inlet and outlet lines.\nConnect peristaltic tubing to the tubes in the step above. Secure the cassette on the peristaltic tubing and place it on the peristaltic pump. Do not secure the cassettes with tubing in place yet.\nConnect one tube from step 4.7 to the end of the peristaltic tubing of the outlet line from the step above. Connect a 1 mL serological pipette on the other end. Suspend the end attached with a serological pipette in the waste reservoir flask.\nRepeat step 4.7 for the inlet line. Suspend the end of the tube attached to the serological pipette into the detergent reservoir. Seal the opening of the detergent reservoir flask with parafilm immediately. See Figure 3A,B for an overview of the decellularization circuit.\nAdd 0.25% SDS from the 1 L glass jar (step 3.2) into the bioreactor chamber at the halfway level.\nTake the procured hindlimb using Adson forceps and suspend it into the bioreactor chamber carefully.\nUse two pairs of Adson forceps to guide the cannulated portion of the hindlimb to the inlet line. While holding the cannula with one pair of forceps, use the other pair of forceps to twist and secure the inlet line to the cannula. Ensure the cannula is not pulled or twisted to prevent decannulation.\nOnce secured, add more 0.25% SDS from the 1 L glass jar to fully submerge the limb, as needed. Ensure the outlet port is also submerged in the bioreactor reservoir to ensure that consistent outflow is maintained (Figure 3C).\nAttach a single-use syringe filter to the ventilation port on the lid of the bioreactor chamber, referring to step 4.4 and step 4.5.",
    "Secure the lid on the bioreactor and ensure the chamber is sealed from all sides (Figure 3B).\nTo remove air from tubing and prime the perfusion circuit, use a new, single-use 10 mL syringe to draw detergent from the detergent reservoir using the 3-way stopcock at the inlet line.\nOnce drawn, use the same fluid to insert into the 3-way stopcock at the outlet line. Ensure that there is detergent present throughout the tubing at both the inlet and outlet lines.\nPress down and secure the cassettes with the tubing into the peristaltic pump. Turn the peristaltic pump on using the power button.\n\t\nOn the peristaltic pump screen, proceed to the second tab using the arrow key to set the perfusion rate for the first channel. Input flow rate as the mode of delivery and set the perfusion rate at 1 mL/min. Ensure the direction of flow is correct according to apparatus set-up. Repeat for the second channel.\nCalibrate the peristaltic pump to ensure the amount of fluid delivered through the inlet line and/or taken from the outlet line is flowing at a consistent rate between the two. Ensure that the tubing ID is set to 1.85 mm.\nBegin decellularization via machine perfusion at 1 mL/min for both the inlet and outlet lines by pressing the power button on the keypad. Monitor and ensure that the flow is consistent and ongoing at both the inlet and outlet lines.\nContinue decellularization and monitor daily. Use the 1 L of 0.25% SDS (step 3.2) to replenish the bioreactor reservoir through the replenishing port, as needed. Look for a white, translucent appearance of the tissue, which will appear by day 5, indicating decellularization of the rat hindlimbs.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64069/64069fig03.jpg",
    "Figure 3: Overview of perfusion decellularization bioreactor circuit of rat hindlimb. (A) Schematic representation of bioreactor perfusion circuit. Blue arrows indicate the direction of detergent and waste flow. (B) Overview of the decellularization circuit with bioreactor containing rat hindlimb. The SDS reservoir (left flask) leads into the peristaltic pump and into the inlet tubing of the bioreactor. The outflow is connected to the waste reservoir (right flask) through the peristaltic pump. (C) (I) Bioreactor containing rat hindlimb with inlet tubing connected to the cannulated femoral artery. (II) Replenishing port located in the corner for perfusing detergent. (III) Outflow tubing suspended in suspension reservoir. Abbreviation: SDS = sodium dodecyl sulfate. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64069/64069fig03large.jpg]\n6. Post-decellularization washing and sterilization\nFollowing the confirmation of decellularization, replace the detergent reservoir with the 1x PBS + 1% AA reservoir. Seal the opening of the flask with parafilm. Begin 1x PBS + 1% AA perfusion at 1 mL/min and continue for 2 days.\nReplace the 1x PBS + 1% AA reservoir with 200 mL of 0.1% PAA/4% EtOH reservoir and begin perfusion at 1 mL/min for 2 h.\nDisconnect the hindlimb from the inlet line using two pairs of sterile Adson forceps, with one pair of forceps to twist the inlet line and the other holding the cannula. Ensure that the cannula is not pulled to prevent decannulation.\nStore the limb in a 500 mL glass jar containing 1x PBS + 1% AA at 4 °C until further use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}