{
  "id": 10432,
  "origin_website": "Jove",
  "title": "High-resolution Imaging of Nuclear Dynamics in Live Cells under Uniaxial Tensile Strain",
  "procedures": [
    "1. Design of the single-well polydimethylsiloxane mold for high-resolution imaging\nNOTE: The mold for manufacturing polydimethylsiloxane plates is designed with the following features to enable imaging with a 100x oil immersion lens and a correct fit in the custom-build strain device (Figure 1A,B).\nKeep the overall plate dimensions such that it fits in the clamps of the strain device.\n\tNOTE: Here, they are 60 mm x 73 mm.\nMake a cell compartment or well that is significantly smaller than the whole plate’s lateral dimensions, to avoid arcing (out-of-plane bending) effects that happen at the unclamped edges of the polydimethylsiloxane plate during applied strain.\n\tNOTE: Here, the compartment was designed as a 23 mm x 23 mm square.\nKeep the depth of the cell compartment as minimal as possible (not more than 80 µm), to enable focusing with the 100x oil immersion lens through the cover glass placed on top of the compartment, but make it sufficient enough to contain media and to avoid contacting or squeezing the cells.\nRaise the cell compartment on a square with a height of 3 mm, to bring the cells closer to the lens in the inverted microscope setup to enable easy focusing.\n\tNOTE: Molds with the above features can be manufactured by many techniques including, for example, milled aluminum. Alternatively, master molds can also be assembled by using acrylic sheets cut with a laser cutter, cover glass #0 for the cell compartment, and super glue. This master mold is used to make a polydimethylsiloxane imprint, which is then used to make working molds using a casting resin.\n2. Fabrication of single-well polydimethylsiloxane plates and square compartments",
    "Mix polydimethylsiloxane base and curing agent in a ratio of 20:1 (by weight) in a disposable cup. Weigh a total of 20 g of polydimethylsiloxane per mold (for making one polydimethylsiloxane plate) and 150 g of polydimethylsiloxane per 150 mm-in-diameter plastic dish (for making one batch of square compartments).\nLeave the polydimethylsiloxane mix in a vacuum degasser at -0.8 bar for 30 min (or until all bubbles are removed).\nPour the polydimethylsiloxane mix into the molds (for plates) or into 150 mm plastic dishes (for square compartments).\nRemove any additional bubbles at this stage, either by blowing air (by mouth) or degassing the polydimethylsiloxane-filled molds/dishes again at -0.8 bar vacuum for 30 min.\nLeave the molds/dishes in an 80 °C oven on a leveling table for 2 h.\nCarefully remove the molds/dishes from the oven and let them cool down to room temperature. Gently peel out the cured polydimethylsiloxane after carefully cutting the edges with a blade (Figure 1C).\nOn the 150 mm-diameter polydimethylsiloxane, draw a 2 cm x 2 cm grid with a marker. Within each square, draw a 1 cm x 1 cm square, leaving a margin of 0.5 cm on all sides. Using a blade, carefully cut along the lines to obtain square compartments (Figure 2A).\nClean the polydimethylsiloxane plates/square compartments by incubating them in 100% acetone for 4 h, followed by 100% ethanol for 4 h, followed by autoclaved water for 4 h.\nPlace the plates/square compartments on paraffin film backing paper (not the paraffin film but the paper) inside a 150 mm diameter plastic dish (Figure 2C).\nLeave the polydimethylsiloxane plate in the 80 °C oven to dry for 4 h.\nSeal the 150 mm-diameter dishes containing polydimethylsiloxane plates and container squares with paraffin film, and store them in a cold room until further use.",
    "3. Functionalization of polydimethylsiloxane plates\nRemove the paraffin film, remove the cover of the plastic dish, and place the polydimethylsiloxane plates and square compartments under ultraviolet light for 30 min.\nPlasma-treat (at 150 W for 5 min) the polydimethylsiloxane plates (with the cell compartment facing up) without the square compartments, to make the culture surface hydrophilic.\nImmediately place the square compartments onto the plasma-treated surface (Figure 2B) and press manually to temporarily stick the two together.\n\tNOTE: Do not plasma-treat the square compartments, or else they will stick strongly to the polydimethylsiloxane plate and will not come off easily when they must be peeled off during imaging.\nAdd 200 µL of 100 mM (3-aminopropyl)triethoxysilane to the well for 2 h to introduce –NH2 groups to the polydimethylsiloxane surface. To make a 100 mM solution, dissolve 234 µL of pure (3-aminopropyl)triethoxysilane in 10 mL of water. After a 2 h incubation, wash the wells 3x with deionized water.\nWeigh 2 mg of the molecular crosslinker bissulfosuccinimidyl suberate and dissolve it in 700 µL of 1 M (4-(2-hydroxyethyl)-1-piperazineethane sulfonic acid buffer (pH 8.0) and 2.8 mL of water.\n\tNOTE: This will give a 1 mM bissulfosuccinimidyl suberate solution in 200 mM (4-(2-hydroxyethyl)-1-piperazineethane sulfonic acid buffer. Note that a 50 mM concentration buffer also works well.\n\t\nAdd 135 µL of this solution and 15 µL of 1 mg/mL fibronectin to the well in each polydimethylsiloxane plate for 4 h at room temperature.\nWash 3x with phosphate-buffered saline solution. Add 500 µL of phosphate-buffered saline solution to the well. Cover the 150 mm-diameter dish containing the polydimethylsiloxane with paraffin film and store it in a cold room, until further use.\n4. Functionalization of plastic dishes and flasks",
    "Incubate plastic dishes and flasks with a 5 µg/mL solution of poly-D-lysine (PDL, in sterile water) for 1 h. Add 1.5 mL of this solution (ligand) per 35 mm-diameter dish, 3 mL of it per 60 mm-diameter dish, and 10 mL per 75 cm2 culture flask.\nWash the dishes and flasks 2x with sterile water.\nLeave them to dry in the biosafety cabinet for 1 h (or until dry) and store them in the cold room at 4 °C until further use.\n5. Proliferation and differentiation medium for murine oligodendrocyte progenitor cells\nPrepare 50 mL of 100x solutions of the proliferation and differentiation medium, make aliquots of 2.5 mL, and store them at -80 °C.\n\tNOTE: The composition of proliferation medium is 0.1 mg/mL bovine serum albumin, 62 ng/mL progesterone, 16 µg/mL putrescine, 5 µg/mL insulin, 50 µg/mL holo-transferrin, 5 ng/mL sodium selenite, 1x penicillin-streptomycin, 10 ng/mL platelet-derived growth factor, and 10 ng/mL fibroblast growth factor in Dulbecco’s modified Eagle’s medium (DMEM) with high glucose and pyruvate. While bovine serum albumin, progesterone, putrescine, and sodium selenite can be constituted and stored at 100x, insulin, holo-transferrin, and penicillin-streptomycin must be added fresh while preparing the 1x solution. The growth factors must be constituted at 10 µg/mL and must be added fresh to the cells every day (1 µL/mL of medium). The composition of the differentiation medium is 0.1 mg/mL bovine serum albumin, 62 ng/mL progesterone, 16 µg/mL putrescine, 5 µg/mL insulin, 50 µg/mL holo-transferrin, 5 ng/mL sodium selenite, 1x penicillin-streptomycin, 400 ng/mL triiodothyronine, 400 ng/mL L-thyroxine, and 0.5% fetal bovine serum in DMEM with high glucose and pyruvate. Triiodothyronine and L-thyroxine can be constituted with other reagents and stored at 100x. Insulin, holo-transferrin, and penicillin-streptomycin must be added fresh while preparing the 1x solution.",
    "For preparing 50 mL of 100x proliferation medium, dissolve 510 mg of bovine serum albumin in 17 mL of Dulbecco’s medium, 310 µg of progesterone in 31 µL of ethanol, 80 mg of putrescine in 500 µL of Dulbecco’s medium, 25 µg of sodium selenite in 10 µL of Dulbecco’s medium, and full DMEM up to 50 mL\nFor preparing 50 mL of 100x solution of differentiation medium, additionally dissolve 2 mg of triiodothyronine in 40 µL of sodium hydroxide and 2 mg of L-thyroxine in 40 µL of sodium hydroxide, then fill up the solution to 50 mL with Dulbecco’s medium. Filter the solution through a sterile disposable filter unit, aliquot, and store the aliquots at -80 °C.\nFor preparing 250 mL of 1x proliferation/differentiation medium, mix 2.5 mL of 100x solution of proliferation/differentiation medium with 12.5 mg of holo-transferrin, 125 µL of 10 mg/mL insulin, and 2.5 mL of 100x penicillin-streptomycin. Fill up the solution to 250 mL with Dulbecco’s medium and filter it through a sterile disposable filter unit.\n\tNOTE: The growth factors must be added fresh and directly to the cell culture, not to the whole batch of reconstituted medium.\n6. Cell culture\nStart with oligodendrocyte progenitor cells suspended in proliferation medium. Seed these cells at a density of 35,000 cells/cm2 onto PDL-coated plastic surfaces (dishes or flasks, see section 4). Adjust the volume of the proliferation medium to 3 mL per 10 cm2 of surface area of plastic substratum; a lower volume of medium may lead to cell clumping arising from surface tension forces, while a higher volume of medium in the dishes may cause spillage.\nAdd growth factors (platelet-derived growth factor and fibronectin growth factor) every day, maintaining their concentration at 10 ng/mL and change half of the proliferation medium on alternate days.",
    "On the third day, detach the cells from the plastic surface using a gentle cell detachment solution (e.g., accutase): remove the medium, wash 1x with phosphate-buffered saline solution, add 1 mL of detachment solution per 20 cm2 area, leave the dish/flask in an incubator at 37 °C for 10 min, and gently tap it until all cells have detached (look under a microscope).\nPipette using a 200 µL tip to break clumps into single cells, transfer them to a 50 mL tube, dilute them in proliferation medium, spin at 0.2 x g for 10 min, discard the supernatant, and resuspend the pellet in proliferation medium to make a total volume of 1 mL. Count the cells using a cytometer.\nWash the fibronectin-functionalized polydimethylsiloxane plates 2x, 15 min per wash, with proliferation medium.\nSeed 35,000 cells per polydimethylsiloxane plate in 700 µL of proliferation medium.\nAdd a plasmid construct of H2B-GFP for labeling histone H2B with green fluorescent protein.\n\tNOTE: Here, 1.4 µL of CellLight H2B-GFP BacMam2 transfection mix was added to each plate (2 µL per 50,000 cells).\nAfter 24 h, mount the polydimethylsiloxane samples with cells to be stretched on the uniaxial strain device (as shown in Figure 2D). Change the medium in all samples to differentiation medium.\nTo strain the samples, measure the unstrained cell compartment length (Figure 3A) and turn the stage micrometer screw to increase the cell compartment length by the desired amount (e.g., 10%, see Figure 3B). Leave the stretched and unstretched polydimethylsiloxane samples in the incubator at 37 °C until imaging.\n7. Imaging\nTurn on the microscope. Set the microscope incubator temperature to 37 °C.",
    "Bring the objective to be used (100x oil immersion) to the central position as the objective turret will not be accessible later. Unscrew the objective and screw it back together with an objective ring (Figure 4A) so that the objective can be brought closer to the cells. If an oil objective is being used here, add a drop of oil at this step.\nSynthesize beforehand (via 3D printing or machining) a plastic or metal holder that has two important features—an angled window and a step (Figure 4B).\n\tNOTE: The window supports a thickness #0 glass coverslip that will hold the medium while the strain device is in an inverted state. The angled cut at the window edges (Figure 4D) allows the objective to come closer to the glass coverslip. The step in the holder allows us to bring the stretched polydimethylsiloxane further down, closer to the objective.\nPlace a glass coverslip (thickness #0, with dimensions of 25 mm x 25 mm or 35 mm in diameter) onto the top surface of the holder by spreading vacuum grease at the periphery of the window (Figure 4C), and tape the plastic window onto the microscope stage (Figure 4D and Figure 5A).\nScrew a z-translation stage onto the microscope stage and move it to the topmost z-position (Figure 5A).\nRemove 500 µL of the medium from the stretched polydimethylsiloxane plate to be imaged and add this medium onto the glass coverslip in the white plastic window.\nCarefully detach the square compartment from the polydimethylsiloxane plate with sterile tweezers.\nHold the strain device in an upright position (cells facing up) above the white plastic window and carefully invert the strain device so as to let any extra medium drop directly in the middle of the glass coverslip (Figure 5B) (cells facing down).",
    "Place the bottom part of the strain device onto the z-translation stage with the double-sided tape (Figure 5C,D).\nWhile looking through the eyepiece under brightfield, slowly bring the strain device down (Figure 5E) (by lowering the z-translation stage) and move the objective up to focus on the cells.\n\t\nPerform this step extremely slowly, step by step. If the strain device presses too much onto the coverslip, the cells can get compressed (causing them to die) and if the objective presses too much onto the coverslip, the coverslip can break (causing medium to leak and spill onto the objective).\nScan the polydimethylsiloxane plate in x- and y-directions to find a cell that has a fluorescent nucleus (under epifluorescence with 488 nm of wavelength excitation) and appropriate cell morphology (under brightfield).\nIf the lateral displacement of the microscope stage does not affect the vertical focusing too much, select multiple regions of interests using a multipoint feature on the software. Sometimes, the focusing is very sensitive to any lateral displacement of the stage. In such cases, image one cell at a time. Mark the x-, y-, and z-positions for each cell of interest.\nRecord wide-field (or open-pinhole) images of the nucleus with 488 nm of wavelength excitation and of the cell with brightfield excitation at intervals of 30 s per frame for a total duration of at least 30 min.\n8. Data analysis\nNuclear fluctuations\nOpen the sequence of nucleus images (Figure 6A) in an image analysis software and threshold the nucleus time-lapse images (for example, use the Threshold command in ImageJ or the Graythresh command in the software MATLAB).",
    "Get the nucleus area (in pixels) as a function of time, plot it in a data plotting software (Figure 6B), and fit a third order polynomial to the data (Figure 6C) (for example, use the Analysis | Fitting | Polynomial Fit command in Origin or the Polyfit command in the software MATLAB).\nSubtract the value of the fitted polynomial from the actual area (in pixels) for each time point. This corrected area is known as the residual area.\n\t\tNOTE: This process removes any increasing or decreasing trend in the data coming from instrumental errors and is called detrending.\n\t\t\nCalculate the percentage of residual area by dividing the residual area at each time point with the value of the fitted polynomial at that time point (Figure 6D).\nCalculate the standard deviation of the residual area time series. This standard deviation denotes the amplitude of nuclear fluctuations.\nData plotting and statistical analysis\nCalculate the amplitude of nuclear fluctuations as a mean of at least 20 nuclei per condition.\nConduct a one-way analysis-of-variance statistical test with Bonferroni correction to determine whether there is a significant difference in the amplitude of fluctuations as a function of conditions of interest (for example, with and without applied strain).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}