{
  "id": 5477,
  "origin_website": "Bio",
  "title": "Expression and Purification of Mini G Proteins from <em>Escherichia coli</em>",
  "procedures": [
    "Expression of mini-Gs in E. coliMini-Gs393 was cloned into the pET15b plasmid to allow expression in E. coli. The construct contained an N-terminal histidine tag to facilitate purification of mini-Gs and a TEV protease cleavage site to allow removal of the histidine tag (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170414/20170414235944_3383.jpgFigure 1. Mini-Gs393 E. coli expression construct. Mini-Gs was cloned into the plasmid pET15b (the sequence and map of this vector are available from the EMD Millipore website) using NcoI and XhoI restriction sites (underlined). The Mini-Gs393 construct contains an N-terminal 6x histidine tag (highlighted in red) followed by a TEV protease cleavage site (highlighted in green). Start and stop codons are shown in bold. Transform E. coli strain BL21-CodonPlus(DE3)-RIL with the plasmid pET15b-mini-Gs393, plate on a TYE agar plate (containing 100 μg/ml ampicillin and 34 μg/ml chloramphenicol) and incubate overnight at 37 °C. (see Note 1)Pick a single colony and inoculate 5 ml of LB media (supplemented with 0.2% glucose, 100 μg/ml ampicillin and 34 μg/ml chloramphenicol), incubate for 6-8 h at 37 °C, shaking at 220 rpm.Inoculate 150 ml of LB media (supplemented with 0.2% glucose, 100 μg/ml ampicillin and 34 μg/ml chloramphenicol) with 5 ml of the starter culture, incubate for 16-20 h at 30 °C, shaking at 220 rpm.Measure the OD600 nm of the overnight culture and inoculate 4 x 500 ml of TB media (supplemented with 0.2% glucose, 100 μg/ml ampicillin, 34 μg/ml chloramphenicol and 5 mM MgSO4) in 2 L Erlenmeyer flasks to give an OD600 nm of 0.15Incubate at 30 °C, shaking at 220 rpm, until the OD600 nm reaches 0.6-0.8 (this should take 2-3 h). Induce expression of mini-Gs by addition of IPTG to give a final concentration of 50 μM, incubate at 25 °C, shaking at 220 rpm for 16-20 h.",
    "Harvest the cells by centrifugation at 5,000 x g for 10 min at 4 °C. Flash freeze the pellet in liquid nitrogen and store at -80 °C.Purification of mini-GsMini-Gs393 is purified by Ni2+ affinity chromatography, followed by cleavage of the histidine tag using TEV protease and negative purification on Ni2+-NTA to remove the TEV and undigested mini-Gs. A final gel filtration step is performed to remove aggregated protein. This protocol yields approximately 100 mg of pure mini-Gs393 from 2 L of E. coli culture.Resuspend the pellet from 2 L of E. coli culture in buffer A to give a final volume of 200 ml.Add 4 protease inhibitor tablets, and PMSF (1 mM), Pepstatin-A (2.5 μM), Leupeptin (10 μM), DNase I (50 μg/ml), lysozyme (50 μg/ml) and DTT (100 μM) to give the final concentrations indicated.Stir the cell suspension at medium speed using a magnetic stirring bar at 4 °C for 30 min.Lyse the cells by sonication for 10 min, with pulses of 2 sec on and 4 sec off, at an amplitude of 70%, keeping the sample in an ice bath to prevent heating.Transfer the lysate to a 250 ml centrifuge bottle and centrifuge at 38,000 x g for 45 min at 4 °C.Remove the supernatant and filter through a 0.22 μm Steritop filter unit. (see Note 2)Load the supernatant onto a 10 ml HisTrap Fast Flow column (2 x 5 ml columns connected in series), pre-equilibrated with buffer A, at a flow rate of 5 ml/min at 4 °C, using a peristaltic pump.Wash the column with 100 ml of buffer B at a flow rate of 5 ml/min at 4 °C.Elute the column with 30 ml of buffer C at a flow rate of 5 ml/min at 4 °C, collecting a single 30 ml fraction.",
    "Determine the concentration of mini-Gs by measuring the A280 nm using a NanoDrop 2000 spectrophotometer. An absorbance of 1.0 unit equates to a protein concentration of 1.0 mg/ml for mini-Gs393 (extinction coefficient: 27,310 M-1 cm-1).A maximum of 200 mg of protein can be processed from this point onwards, if more mini-Gs is present it can be split into two batches and processed in parallel. (see Note 3)Add DTT to give a final concentration of 1 mM and TEV protease to give a TEV:mini-Gs ratio of 1:20 w/w. (see Note 4)Dialyse the protein against 1 L of buffer D for 2-3 h at 4 °C, discard the external buffer and dialyse against 1 L of fresh buffer D overnight at 4 °C.Transfer the protein to a 50 ml tube, add imidazole to give a final concentration of 20 mM and 4 ml of Ni2+-NTA agarose resin (pre-equilibrated with buffer D), mix on a roller mixer for 30 min at 4 °C. (see Note 5)Pour the suspension onto 1 ml of Ni2+-NTA agarose resin (pre-equilibrated with buffer D) packed into a disposable plastic column and let it run through by gravity.Collect the flow through and wash the column with 5 ml of buffer D.Pool the wash with the flow through and concentrate to 1.5 ml using an Amicon Ultra-15 concentrator (10 kDa cut-off) in a refrigerated benchtop centrifuge at 4 °C (this may take up to 2 h).Centrifuge the concentrated protein at > 15,000 x g for 10 min in a refrigerated microcentrifuge at 4 °C to remove aggregates.Load the supernatant onto a HiLoad 26/600 Superdex 200 gel filtration column (pre-equilibrated with buffer E) at a flow rate of 2.6 ml/min at 4 °C, collecting 2 ml fractions.",
    "(see Note 6)Pool peak fractions (typically 22-26 ml) based on the gel filtration chromatogram (Figure 2).Concentrate the pooled fractions to 100 mg/ml, using an Amicon Ultra-15 concentrator (10 kDa cut-off) in a refrigerated benchtop centrifuge at 4 °C (this may take up to 2 h). Determine the concentration of mini-Gs by measuring the A280 nm using a NanoDrop 2000 spectrophotometer. To ensure an accurate reading, dilute a sample of the protein 1:10 in buffer E before measuring the absorbance.Centrifuge the concentrated protein at > 15,000 x g for 10 min in a refrigerated microcentrifuge at 4 °C to remove aggregates.Transfer the supernatant to a fresh tube and discard the pellet.Aliquot 20 μl of the supernatant (2 mg of mini-Gs) into 0.5 ml tubes, flash freeze in liquid nitrogen, store at -80 °C. Mini-Gs is stable under these conditions for over 1 year.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170415/20170415001501_0490.jpgFigure 2. SDS-PAGE and gel filtration analysis of the mini-Gs393 purification. A. SDS-PAGE analysis of the mini-Gs393 purification. Lane: (M) molecular weight markers; (1) HisTrap column loading material (1:10 dilution); (2) HisTrap column flow through (1:10 dilution); (3) HisTrap column wash; (4) HisTrap column eluate; (5) sample after TEV digestion; (6) Ni2+-NTA negative purification flow through; (7) Ni2+-NTA negative purification eluate; (8) gel filtration pool. TEV protease is indicated by an asterisk. Note that it is not necessary to boil the samples before loading on the gel. B. Preparative gel filtration chromatogram for mini-Gs393. Pooled fractions are indicated by dashed lines, fractions at the leading edge of the peak should be omitted to ensure that aggregates are completely removed. Note that the UV detector saturates at absorbance readings above 2,700 mAu, which gives the chromatogram a truncated absorbance profile. C. Analytical gel filtration analysis of purified mini-Gs on a Superdex 200 GL 10/300 column.",
    "The chromatogram demonstrates that purified mini-Gs is monomeric (calculated molecular weight of 23 kDa compared to the theoretical value of 27 kDa) and free from aggregates."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}