{
  "id": 9573,
  "origin_website": "Jove",
  "title": "Behavioral Determination of Stimulus Pair Discrimination of Auditory Acoustic and Electrical Stimuli Using a Classical Conditioning and Heart-rate Approach",
  "procedures": [
    "1. Electrocardiogram Telemetry Device Implantation\nOne hour prior to implantation surgery commencement, administer Carprofen (4 mg/kg s.c.) to provide post-operative analgesia.\nInject Ketamine/Xylazine (Ke: 70 mg/kg, Xy: 10 mg/kg, i.p.) for anaesthesia to allow initial animal preparation including shaving and inserting ear bars before switching to Isoflurane anaesthesia which is more stable during surgery allowing better regulation of depth and shortens post-surgery recovery from anaesthesia.\nAt anaesthesia onset, apply eye lubricant to the animal's eyes and then shave the abdomen thorax, and throat. Wipe the exposed skin using surgical scrub, followed by alcoholic skin preparation, followed by antiseptic solution. Place the home cage on an heat blanket to warm.\nPlace the animal in the supine position on a homeothermic plate. Insert wadding underneath the neck to elevate and expose the throat.\nPlace the nose-cone (delivering 1-3% vol/vol Isoflurane in oxygen, 2 L per min) over the nose of the animal and fix the cone in place.\nFix the fore-limbs in a semi-extended position to generate skin tension over the thorax and throat, and to prevent the nose slipping free of the nose-cone.\nInsert the probe of the homeothermic blanket into the rectum of the animal.\nMake a midline incision in the skin extending from the xiphoid process 20 mm caudally to expose the muscle layer. Make a matching incision along the linea alba, and then the peritoneal cavity.\nInsert the ECG telemetry device into the peritoneal cavity with leads extending from the rostral end of the opening, and suture the caudal 15 mm of the opening in the peritoneum.\nMake a midline incision in throat overlying the trachea, exposing the sternohyoid muscle.",
    "Insert alligator ear forceps into the subcutaneous space of the rostral incision facing caudally, and use these to form a subcutaneous tunnel from the rostral to caudal incision. Grip the positive (red) lead in the forceps and retract the lead through the tunnel.\nLift the sternohyoid muscle using forceps and insert the tip of the positive lead dorsally toward the right anterior mediastinum, leaving approximately a 1 mm loop of cable rostral to insertion. Suture the lead where it extends from the thoracic cavity and at the top of the loop to the underlying muscle.\nExpose the dorsal wall of the xiphoid, and suture the tip of the negative lead the exposed surface.\nCheck the implanted device signal to ensure an adequate ECG can be obtained.\nFeed excess cable into the peritoneal cavity. Suture closed the peritoneal wall, the linea alba, and the abdominal skin.\nSuture closed the skin of the throat.\nCease delivery of Isoflurane, and continue to deliver oxygen until spontaneous movement is observed.\nWhen movement is observed, release the forelimbs and return the animal to its home cage. Move the home cage so that approximately half the cage is on the heat pad. This will allow the animal, when mobile, to move between warmer and cooler areas of the cage. Monitor the animal until ambulatory, and leave the home cage on the heat blanket for 24 hours.\nAdminister Carprofen (4 mg/kg s.c.) every 24 hours for 3-5 days.\n2. Brain Electrode Implant\nOne hour prior to implantation commencement, administer Carprofen (4 mg/kg s.c.) for post-operative analgesia.\nInject Ketamine/Xylazine (Ke: 70 mg/kg, Xy: 10 mg/kg, i.p.) for anesthesia.\nAt anaesthesia onset, apply eye ointment to protect the eyes, then shave the head of the animal. Wipe the exposed skin using betadine scrub, followed by alcohol, followed by betadine.",
    "Place the animal in the prone position on a homeothermic plate.\nPosition one hollow ear bar in approximately the expected final position, and lift and position the animal so that the ear bar is located in the external acoustic meatus.\nSlide the second hollow ear bar into the contralateral external acoustic meatus.\nUsing rat-tooth forceps, open the animal's jaw and hook the upper incisors over the tooth holder.\nSlide the nose-cone over the nose, and commence delivery of Isoflurane (1-3% vol/vol in oxygen). Animals are now maintained throughout surgery with this anaesthetic.\nMake an incision in the skin of the head, approximately 1 mm left of the midline and extending from 3-4 mm rostral to 2-3 mm caudal of lambda.\nRetract the skin and muscle laterally from the incision, exposing the parietal bone and the interparietal bone. Scrub the surface of the exposed bone using 20% hydrogen peroxide solution and a gauze pad.\nDrill a small hole in the left and right parietal bones, and screw a surgical steel screw into each hole leaving a small (0.5 mm) space between the head of each screw and the skill. Connect these screws to the ground and reference electrode points of the high-impedence headstage.\nDrill a hole approximately 2 mm square in the lateral-most extent of the interpariental bone. Flush the hole using sterile saline to remove any bone dust or bone fragments which may damage the electrode.\nAttach the coupling speaker to the left hollow ear bar.\nUsing the tip of a needle, make an incision in the dura on the sagittal plane.",
    "Bring the electrode manipulator into place above the opening, with a caudorostral angle of 10 °. Insert the electrode manually approximately 2 mm into the surface of the brain. Ensure the amplifier is turned on, then seal the recording chamber.\nCommence cyclical delivery of low (2-8 kHz), mid-range (16-24 kHz) and high (32 kHz-44kHz) frequency band-pass filtered noise. The maximum rate at which bursts should be delivered is one burst every 200 ms. Monitor neural activity at each channel to detect responses to noise presentation.\nContinue insertion of the electrode until either total inserted distance is approaching 8 mm. If the 8 mm limit is reached without neural responses being detected, withdraw and reposition the electrode for another insertion. If the cochlear nucleus (CN) has been reached, sites at the tip of the electrode should be showing responses primarily to high-frequency stimuli. If electrodes are located in the ventral cochlear nucleus (VCN), responses to acoustic stimulus should have a strong onset component (1-5 ms), followed by a rapid decrease in activity.\nContinue to insert the electrode until the tips of the electrode detect responses to low-frequency stimuli, or auditory-driven activity ceases to occur (in which case, the electrode may have passed entirely through the CN and it may be necessary to revise the electrode placement).\nConstruct a frequency-amplitude response map of the neurons at electrode sites. This is achieved by presented sound across the desired frequency range (typically 1-44 kHz or 1-80 kHz) at amplitudes 1-70 dB, with 10 repetitions of each stimulus. One stimulus may be delivered every 300 ms when mapping the CN. If the map is inadequate, consider revising the placement of the electrode.",
    "Apply a thin layer of silicon elastomer slightly above the exposed electrode shanks, such that the elastomer will flow down the shanks and coat both the shanks and the exposed surface of the brain.\nApply a first layer of denture cement polymer around the electrode. The cement should be minimally viscous, to reduce the risk of the electrode being moved in the process of application. Ensure that the polymer does not cover the screws in the parietal bones or the attached cables. Wait for the acrylic to harden, which typically takes 5-10 minutes.\nDetach the ground and reference wires of the headstage from the screws in the parietal bones. Using forceps, gently wind the ground wire of the electrode around the screw in the left parietal bone.\nApply a second layer of denture cement polymer. This second layer should encapsulate both screws, and flow into the space between the head of the screw and the skull. In doing so, the screws will hold the acrylic and electrode to the skull. Wait for the acrylic to harden.\nRemove the headstage from the electrode connector.\nUsing rat tooth forceps, lift the skin lateral to the polymer over the polymer, and use a purse-string suture to close the skin around the exposed electrode connector.\nRemove the ear bars, releasing the head.\nEnd delivery of Isoflurane, and continue to deliver oxygen through the nose cone until spontaneous movement is observed.\nReturn the animal to the home cage. Move the home cage so that approximately half the cage is on the heat pad. This will allow the animal, when mobile, to move between warmer and cooler areas of the cage.\nMonitor the animal until ambulatory. Leave the home cage on the heat pad for 24 hours.",
    "Administer Carprofen (4 mg/kg s.c.) every 24 hours for 3-5 days.\n3. Conditioning\nPlace the animal in the test chamber.\nActivate the ECG telemetry device.\nAllow the animal to acclimatise to the test chamber for five minutes prior to commencing conditioning. This will permit heart rate to return to a baseline, as handling leads to heart rate elevation.\nPerform the conditioning procedure:\n\t\nDeliver one randomly selected member of the acoustic stimulus pair repeatedly in 250 ms bursts separated by 250 ms of silence for 80-170 s. Each stimulus presentation must have a rise and fall time of 10 ms to avoid a 'click' being perceived, which perceptually covers a range of sound frequencies.\nCommence alternating the second member of the acoustic stimulus pair with the first, presenting each tone for 250 ms followed by a 250 ms of silence.\nAfter 9.5 s of the 10 s period of alternating tone presentation, administer a 0.5 ms foot-shock (0.7 mA).\nCease tone presentations for 30 s to allow the heart rate to stabilise.\nRecommence tone pair delivery (from 3.4.1). Tone pairs should optimally be presented in a random sequence, and at least 12 tone pairs should be used to ensure that conditioning generalises to all frequency pairs and is not specific to the tone frequencies used. Continue this process until 48 cycles of the procedure (trials) have been completed.\nDeactivate the ECG device, and return the animal to the home cage.\n4. Testing\nAnesthetise the animal using Isoflurane (1-3% vol/vol in oxygen).\nAttach the neural stimulation cable to the exposed electrode connector.\nPlace the animal in the test chamber.\nActivate the ECG telemetry device.",
    "Allow the animal to recover from the Isoflurane anaesthesia and acclimatise to the test chamber for ten minutes prior to commencing testing. This will permit heart rate to return to a baseline and recovery from the brief anaesthetic effect.\nPerform the testing procedure.\n\t\nDeliver one randomly selected member of an acoustic stimulus pair repeatedly in 250 ms bursts separated by 250 ms of silence for 80-170s. Each stimulus presentation must have a rise and fall time of 10 ms to avoid a 'click' being perceived, which perceptually covers a range of sound frequencies.\nCommence alternating the second member of the acoustic stimulus pair with the first, presenting each tone for 250 ms followed by 250 ms of silence.\nAfter 9.5 s of the 10 s period of alternating tone presentation, administer a 0.5 ms foot-shock.\nCease tone presentations for 30 s to allow the heart rate to stabilise.\nCommence delivery of one randomly selected member of an electrical brain stimulation pair repeatedly, using 250 ms periods of stimulation separated by 250 ms of non-stimulation for 80-170 s.\nCommence alternating the second member of the stimulus pair with the first, presenting each stimulus for 250 ms followed by a 250 ms non-stimulation period. Continue alternating stimulation for 10 s.\nCease stimulus presentations for 30 s to allow the heart rate to stabilise.\nRecommence stimulus pair delivery (from 4.6.5 or 4.6.1). Stimulus pairs should be presented in a random sequence, and at least 20 trials of each stimulus pair should be delivered to ensure sufficient heart-rate data is collected to provide a clear average result and minimise variability. Distributing trials using acoustic stimuli throughout the testing session reduces the likelihood that extinction will occur during the procedure.\nDetach the stimulation cable from the animal.\nDeactivate the ECG device.",
    "Return the animal to the home cage.\n5. Representative Results\nAn sample ECG recording taken using the implanted telemetry device one week after implantation is shown in Figure 1. Such a recording can typically be obtained from the implanted devices, and the devices continue to function adequately for recording for in excess of six months, even if soluble suture is used to affix cables to muscle. The ECG recording shown in Figure 2 was obtained from an animal over eight months post-implantation.\nFigures 3 shows the location of a successful implantation. The electrode placement has many electrode sites in the posteroventral cochlear nucleus (PVCN), providing stimulation and recording access to much of the dorsoventral aspect. The frequency-responses of each electrode site for this implantation are presented in Figure 4. The long area of the PVCN in which electrodes are distributed leads to cell populations accessible for recording and stimulation 'tuned' to a wide range of frequencies. Furthermore, the populations themselves are narrowly tuned - they respond only to a narrow band of sound frequencies (See Figure 5).\nIn contrast, a poor placement is shown in Figure 6. In this instance, the electrode was placed too medially, and not inserted sufficiently deeply to penetrate the PVCN. As a consequence, only electrode sites near the tip show responses to sound as shown in Figure 7. In addition, the range of frequencies to which the accessible cell populations are tuned is very constrained. The tuning of the populations themselves is narrow (see Figure 8), but the clustered distribution of the central frequencies of the cell populations makes stimulating distinct frequency regions impossible.",
    "Baseline heart rate data varied between conditioned acoustic stimulus presentations. To account for this variability, raw heart rate (HR) data was normalised as a proportion of HR observed when stimulus alternation commenced (time 0). Figure 9 shows data in various forms collected during the first conditioning session. An example of the HR results obtained in another animal during the latter part of the initial conditioning sessions is presented in Figure 10. The conditioning process to acoustic stimuli is rapid, and strong changes in HR can be observed with few trials; 7 in the case of Figures 9 and 10. The change in HR observed immediately after the commencement of stimulus alternation (refer to 3.4.1 and 3.4.2) provides evidence that the animal is able to discriminate between the initial repeated stimulus and the second stimulus subsequently added.\nAfter commencing test sessions, in which electrical neural stimuli rather than acoustic stimuli are typically delivered, the inclusion of acoustic stimulus presentations allows confirmation that conditioning effects are still present. A general change in HR in response to commencement of acoustic stimulus presentation confirms that a conditioned effect to acoustic stimuli remains present, as shown in Figure 11. Similarly, Figure 12 presents the mean HR proportional change around the commencement of acoustic tone alternation in the first test session. As with Figure 9 and 10, the relatively steady HR prior to introduction of the second stimulus in contrast with the rapid change in HR after the introduction of the second stimulus provides evidence that discrimination between the two tones has occurred.",
    "In contrast, the absence of detection may be seen in Figure 13 in which electrical stimulation is commencing. The mean proportional HR change across 10 trials shows no indication of the consistent rapid drop observed when detection occurs, as in Figure 11. Similarly, the absence of a consistent and rapid change in heart rate in Figure 14 suggests that the two electrical stimuli being delivered are not sufficiently different for discrimination to occur. Both prior to the commencement of the alternating period (before time 0) and after alternation commences, the mean proportional change in HR remains close to the line of no change.\nA pattern more characteristic of discrimination between the two members of a neural stimulus pair is shown in Figure 15. A decrease in heart rate occurs rapidly after the commencement of stimulus alternation, followed by a substantial increase in heart rate. The particular stimulation strategy used in this case was successful in producing a behaviourally relevant response.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig1.jpg\nFigure 1.  An ECG recording obtained using the implanted telemetry device one week post-implantation. The signal seen in this recording is largely typical of the recordings obtained using these devices.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig2.jpg\nFigure 2.  An ECG recording obtained using the implanted telemetry device six months after implantation. There is negligible degradation of the signal being recorded over that time period, and this signal is certainly adequate for calculation of the animal heart rate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig3.jpg\nFigure 3.  A 3D reconstruction of a successful electrode placement, using combined X-ray computed tomography and histological sections. Both electrode shanks penetrated the posteroventral cochlear nucleus with electrodes oriented to face the structure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig4.jpg",
    "Figure 4.  The map of electrophysiological responses recorded with the electrode placement of Figure 3. Each histogram shows data for activity at one electrode site in response to presentation of one acoustic frequency; each column represents a 25 ms time period. On both shanks of the electrode array, responses are detected at each individual electrode site only in response to a quite narrow band of frequencies, but these narrow bands are distributed across a broad range of frequencies. Such a distribution is ideal, as many distinct frequency-associated regions of the brain can be stimulated independently.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig5.jpg\nFigure 5.  The electrophysiological response at channel 10 from the implant presented in Figures 3 & 4. Ideally, electrode placements should lead to neural responses to acoustic stimulus being detected on several channels with sound amplitude as low as 10 dB, as appears in this example.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig6.jpg\nFigure 6.  A 3D reconstruction of a poor electrode placement. While the caudorostral angle of the electrode was correct, it was too medial. Furthermore, the electrode was not inserted sufficiently deep, resulting the in sites nearest the tip of the electrode being located within the dorsal cochlear nucleus.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig7.jpg\nFigure 7.  The map of electrophysiological responses recorded with the electrode placement as shown in Figure 6. Activity is occurring at the tips of each shank of the electrode array, but there is little variation in the acoustic stimulus frequency that elicits activity at each electrode site. Such an implantation does not enable stimulation of distinct frequency layer for discrimination testing.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig8.jpg",
    "Figure 8.  The electrophysiological response at channel 28 on the electrode placement shown in Figures 6 & 7. Acoustic stimulus produce strong bursts of activity, similar in spike frequency to that seen in the very successful implantation (Figure 3). Threshold is also quite low, with responses being detected in response to tones at 20 dB. If there were greater variation in the frequencies to which the strongest responses occurred across other channels of the array this channel would certainly be adequate for stimulation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig9.jpg\nFigure 9.  Comparison of raw heart rate (A) verses mean proportional (B) data collected during the first conditioning session in one animal. Responses from 7 presentations are shown. Because of the variation in starting heart rate prior to commencement of the tone alteration, mean raw heart rate (±95% confidence intervals) does not adequately show the degree of change of an initial drop in heart rate followed by rise as indicated in individual raw traces (A, bottom). Mean proportional change in heart rate data in which the heart rate is divided by the heart rate at time of conditioned acoustic stimulus presentation for each trace is presented in (B). This shows a statistically significant drop following conditioned stimulus presentation with a late significant rise reflected using 95% confidence intervals. Individual proportional heart rate traces are shown (B, bottom).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig10.jpg\nFigure 10.  Mean proportional heart rate change from 8 s prior to 8 s after the commencement of alternating acoustic stimulus presentation, combining data from the second and third conditioning sessions. The presented data includes seven trials presented over the two conditioning sessions, four in the first conditioning session and three in the second. In response to alternating stimulus presentation, a large initial drop in heart rate occurred followed by a late increase in heart rate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig11.jpg",
    "Figure 11.  Mean proportional heart rate change from 10 s prior to 10 s after the commencement of acoustic stimulus presentation after a 30 s silence period. Trial data was taken from the first testing session and includes six acoustic stimulus presentations. A clear early drop in heart rate provides evidence of discrimination between the acoustic stimuli presented.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig12.jpg\nFigure 12.  Mean proportional heart rate change from 8 s prior to 8 s after the commencement of alternating acoustic stimulus presentation, taken from the first testing session and including five acoustic stimulus presentations. A clear early drop in heart rate provides evidence of discrimination between the acoustic stimuli presented.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig13.jpg\nFigure 13.  Mean proportional heart rate change from 10 s prior to 10 s after the commencement of electrical brain stimulation after a 30 s silence period. Trial data was taken from the first and second testing sessions and includes 18 electrical stimulation presentations, all using the same stimulation settings. The absence of any particular drop in heart rate, particularly proximal to time 0 at which stimulation commences, suggests that the animal is unable to detect the stimulus.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig14.jpg\nFigure 14.  Mean proportional heart rate change from 8 s prior to 8 s after the commencement of alternating electrical stimulus presentation (refer 4.6.5 and 4.6.6), taken from the first testing session and including 33 electrical stimulus presentations. No consistent pattern of change in heart rate occurs near time 0, which suggests that the alternating stimuli are insufficiently different for discrimination to occur.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3598/3598fig15.jpg",
    "Figure 15.  Representative examples of individual traces (A) and mean proportional heart rate data (B,C) from 8 s prior to 8 s after the commencement of alternating electrical stimulus presentation, taken from the seventh testing session of a second animal, and including 12 electrical stimulus presentations. A significant decrease in HR occurs rapidly after introduction of the second neural stimulus followed by a significant rise in heart rate reflected suggesting the difference between the first and second stimulus has been detected by the animal. The degree of error and variance of the response can be seen in the proportional mean ± standard error (SE) plot shown in (B). The significance of the dip and rise following the second stimulus presentation can be verified using 95% confidence intervals applied to the data shown in (C). The response seen in (C) is similar to the response see in Figure 9 B."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}