{
  "id": 2976,
  "origin_website": "Cell",
  "title": "Protocol to differentiate monolayer human induced pluripotent stem cells into inflammatory responsive astrocytes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDifferentiation of human iPSCs into neural precursor cells (NPCs)\nTiming: 12–15 days\nThis section describes the differentiation protocols’ first stage towards NPCs. The well-established dual inhibition of SMAD signaling6[href=https://www.wicell.org#bib6] procedure was applied to obtain NPCs from hiPSCs using SB431542 together with Noggin to block TGFβ and BMP signaling.3[href=https://www.wicell.org#bib3]\nOn day 0, clean mechanically hiPSCs removing differentiated clones that may be eventually present in the starting culture (usually 1 or 2 90% confluent wells of a 6 MW are enough to get the number of cells required to start the differentiation).\nNote: Mechanical cleaning of hiPSC clones can be performed with a microstereoscope in a laminar flow hood. Unregular clones can be scraped away from the well with a needle or a p200 micropipette tip.\nWash cells 2×PBS 1 mL/well.\nIncubate with accutase ∼30 min (enough volume in order to cover the entire surface) at 37°C.\nNote: accutase incubation is meant to disrupt clones into single cells. Shorter incubation could enhance cell viability but reduce the number of cells collected upon filtration (where cluster will be lost).\nAdd equal volume of hESC medium and suspend the cells.\nFilter cells with a 0,45 μM filter to remove cell clusters.\nWash cells 2× with 5 mL hESC medium in a 15 mL falcon tube.\nResuspend cells in 2 mL hESC Medium + 10 μM Rock inhibitor and plate on a gelatin coated 6 MW plate, incubate ∼20–30 min at 37°C to remove MEF from the cell suspension.\nCollect ∼1,5 mL of the supernatant without touching the bottom of the well and wash the cell suspension 1× with 5 mLhESC in a 15 mL falcon tube. Centrifuge 400 g 5 min at ∼25°C.\nSuspend cells pellet with hESC + Rock inhibitor and count the cells.",
    "Plate 20.000 cell/cm2 on a matrigel coated 6 MW plate in hESC + 10 μM Rock inhibitor.\nNote: collect the leftover cells as starting point reference (day 0) for differentiation analysis.\nOn day 1, change medium with MEF conditioned medium supplemented with 10 ng/mL bFGF and 10 μM Rock inhibitor.\nOn day 2, change medium with MEF conditioned medium supplemented with 10 ng/mL bFGF. Keep on changing the medium until cells reach 90% confluence.\nOn day 3 (if the confluence is 90%), change medium with Neural induction medium supplemented with 10 mM SB431542 and 200 ng/mL Noggin.\nOn day 4 and 5, change medium with Neural induction medium.\nOn day 6, change medium with a mix of 75% Neural induction medium + 25% Neural expansion medium supplemented with 10 mM SB431542 and 200 ng/mL Noggin in the final volume.\nOn day 8, change medium with a mix of 50% Neural induction medium + 50% Neural expansion medium supplemented with 10 mM SB431542 and 200 ng/mL Noggin in the final volume.\nOn day 10, change medium with a mix of 25% Neural induction medium + 75% Neural expansion medium supplemented with 10 mM SB431542 and 200 ng/mL Noggin in the final volume.\nNote: Cells will change morphology during these steps becoming smaller with a more radial conformation, however since the confluency at this stage is high it is not always easy to appreciate.\nOn day 12, split cells with PBS + 0,05 mM EDTA:\nWash cells 1× with 1 mL PBS.\nAdd PBS-EDTA (enough volume in order to cover the entire surface, usually 1 mL/10cm2), incubate 5 min at 37°C.\nCollect and centrifuge cells 400 g 5 min at ∼25°C in a 15 mL falcon tube with 2 mL Neural expansion medium supplemented with 20 ng/mL bFGF and 20 ng/mL EGF.",
    "Suspend cells in Neural expansion medium supplemented with 20 ng/mL bFGF, 20 ng/mL EGF and 10 μM Rock inhibitor and plate with a surface ratio 1:1.\nExpand NPCs by changing Neural expansion Medium supplemented with 20 ng/mL bFGF and 20 ng/mL EGF every other day and split cells (usually in a 1:2 ratio) with PBS+ 0,05 mM EDTA when confluence reach 100% (usually every 3–4 days).\nNote: At this stage NPCs proliferate for a limited number of passages (up to 6–7 in our hands). We usually freeze a batch of cells at early passage in Neural freezing medium to use them later. To freeze a vial of NPCs:\nWash cells 1× with 1 mL PBS.\nAdd PBS+ 0,05 mM EDTA (enough volume in order to cover the entire surface), incubate 5 min at 37°C.\nCollect and centrifuge cells 400 g 5 min at ∼25°C in a 15 mL falcon tube with 2 mL Neural expansion medium.\nSuspend cells in Neural freezing medium + Rock inhibitor and store in liquid nitrogen.\nCritical: Confluence on step 12 (day 2) is a critical point, lower than 90% will lead to a mixed neuroectoderm/ neural crest population or to cell death.\nCritical: Not adding Rock inhibitor at step 18 (day 12 of differentiation) will result in cell death.\nDifferentiation of neural precursor cells (NPCs) into inflammatory responsive astrocytes\nTiming: 40–45 days\nThis section describes the differentiation protocol second stage towards inflammatory responsive astrocytes. NPCs were firstly incubated with a glial differentiation medium3[href=https://www.wicell.org#bib3] and then further differentiated with an astrocyte differentiation medium.7[href=https://www.wicell.org#bib7]\nDetach a fully confluent well of a 6 MW of NPCs with accutase:\nWash cells 2× with 1 mL PBS.\nAdd accutase (enough volume in order to cover the entire surface), incubate 5 min at 37°C.",
    "Add 2 times the volume of Accutase of neural expansion medium and centrifuge 400 g 5 min at ∼25°C.\nResuspend cells in neural expansion medium supplemented with 20 ng/mL bFGF, 20 ng/mL EGF and 10 μM Rock inhibitor and count the cells.\nPlate 20.000 cells/cm2 on matrigel coated plates (Day 0):\nRemove matrigel (no wash needed).\nAdd neural expansion medium supplemented supplemented with 20 ng/mL bFGF, 20 ng/mL EGF and 10 μM Rock inhibitor.\nPlate the required volume of cells.\nNote: collect the leftover cells as starting point reference for differentiation analysis (day 0).\nOptional: cells can be plated in excess in both wells or coverslips to be collected all along the differentiation, to evaluate differentiation efficiency checking neuronal markers expression by immunofluorescence or qPCR.\nOn day 1 change medium with neural expansion medium supplemented with 20 ng/mL bFGF, 20 ng/mL EGF and 10 μM Rock inhibitor.\nOn day 2, gradually start switching medium to glial differentiation medium (75% neural expansion medium supplemented with 20 ng/mL bFGF and 20 ng/mL EGF + 25% glial differentiation medium).\nOn day 3 change medium with 50% neural expansion medium supplemented with 20 ng/mL bFGF and 20 ng/mL EGF + 50% glial differentiation medium.\nOn day 4 change medium with 25% neural expansion medium supplemented with 20 ng/mL bFGF and 20 ng/mL EGF + 75% glial differentiation medium.\nOn day 5 change medium with 100% glial differentiation medium.\nFrom day 6 to day to day 15 change glial differentiation medium every other day.\nOn day 16 switch to astrocyte induction medium.\nFrom day 17 to day 36 change astrocyte induction medium every other day.",
    "On day 36 detach cells with accutase (as described above) and re-plate them in a freshly coated matrigel plate in a 1:1 ratio with astrocyte induction medium, this will be Passage 0 (P0) of inflammatory responsive astrocytes.\nIn about 4–5 days Astrocytes should be confluent and ready to be split in a 1:2 ratio with accutase (as described above) in a freshly coated matrigel, passage 1 (P1). Cells were split when confluent (every 4–5 days) for maximum 4 passages.\nEndpoint analysis of iPSCs derived inflammatory responsive astrocytes by immunostaining\nRemove the media from the cells and gently wash the cells with PBS once.\nFix the cells in 4% paraformaldehyde (PFA) in PBS by adding enough volume to cover the slide (e.g., 400 μL for a well of a 48 MW) for 10 min. Then gently wash the cells with PBS twice.\nCritical: Differentiated cells may detach easily from glass coverslip, perform washes and staining gently. Prefer manual micropipettes over vacuum aspiration.\nNote: Fixed coverslips can be sealed and stored at 4°C up to 10–12 weeks.\nBlock the samples by adding enough volume to cover the slide of IF blocking solution (PBS 0,1%-Triton X-100- 10% NGS).\nIncubate the coverslip ∼ 16 h at 4°C with primary antibodies diluted in IF blocking solution.\nGently remove the antibody and wash the cells three times for 5 min/wash with PBS.\nIncubate the cells with the corresponding species-specific fluorophore-conjugated secondary antibodies diluted in PBS-1% NGS for 1 h at ∼25°C in the dark.\nGently wash the cells three times 5 min each with PBS.\nGently remove the antibody and wash the cells three times with PBS.\nStain the nuclei with DAPI for 10 min and visualize using a fluorescent microscope.\nGently wash the cells once with PBS.",
    "Mount coverslip on glass slides using Fluorsave. Let them dry at ∼25°C at least 2–3 h in the dark.\nStore slides at 4°C in the dark until analysis.\nNote: Stained slides can be stored in the dark at 4°C for 4–5 months.\nEndpoint analysis of iPSCs derived inflammatory responsive astrocytes by RT-qPCR\nRemove the media from the cells and gently wash the cells with PBS once.\nDetach cells with Accutase as described above and after centrifugation remove all the media.\nNote: Dry pellet can be quickly frozen at −80°C and stored for few months.\nThe pellet was then processed to extract RNA with the Quiagen RNAeasy plus kit accordingly to manufacturer instructions https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/rna-purification/total-rna/rneasy-kits[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/rna-purification/total-rna/rneasy-kits].\nNote: any other RNA extraction method should work as well.\nRNA was then retro-transcribed with VILO according to manufacturer instructions (SuperScript™ IV VILO™ Master Mix (thermofisher.com[href=https://www.thermofisher.com/order/catalog/product/11756050])) and the cDNA was then analyzed by qPCR with Taqman reagents.\nNote: RNA was also used for bulk RNA Sequencing analysis.\nEndpoint analysis of iPSCs derived inflammatory responsive astrocytes by Western blotting\nRemove the media from the cells and gently wash the cells with PBS once.\nDetach cells with Accutase as described above and after centrifugation remove all the media.\nNote: Dry pellet can be quickly frozen at −80°C and stored for few months.\nResuspend the pellet in RIPA buffer and incubated for 15 min on ice.\nCentrifuge the cell lysate at max speed 10 min and collect the cleared supernatant.\nQuantify proteins with Bradford.\n40 μg of proteins were loaded on a 4%–12% precast gel and transfer with precast blotting system accordingly to manufacturer instructions (https://www.thermofisher.com/order/catalog/product/IB401031?SID=srch-hj-IB401031[href=https://www.thermofisher.com/order/catalog/product/IB401031?SID=srch-hj-IB401031]).\nBlock the membrane with WB blocking solution (PBS + 5% BSA) for 1 h at ∼25°C.\nIncubate the membrane ∼ 16 h at 4°C with primary antibody diluted in WB blocking solution.",
    "Wash the membrane 3 times 15 min each with PBS-Tween 0,1%.\nAdd Secondary antibody diluted in PBS + 1% BSA 1 h at ∼25°C.\nWash the membrane 3 times 20 min each with PBS-Tween 0,1%.\nAdd TMB-Blottin solution and developed signal was acquired with a ChemiDoc imaging system.\nEndpoint analysis of iPSCs derived inflammatory responsive astrocytes by functional terms analysis\nAs an additional validation of the functional qualities of the inflammatory responsive astrocytes generated herein, it is possible to compare their genome-wide transcriptional profiles to publicly available profiles of similar iPSC-derived or primary astrocytes. Here, we compared of the transcriptional profiles of WT astrocytes samples from the RNAseq data of Giordano et al. (GEO: GSE193714) with the WT primary and iPSC-derived astrocytes from Santos et al. (GEO: GSE97619).\nRaw counts from both datasets were normalized and characterized by gene set variation analysis (GSVA) against the Hallmark gene set collection from the Molecular Signatures Database (MSigDB) using the GSVA implementation from the R/Bioconductor package GSVA (version 1.46.0).4[href=https://www.wicell.org#bib4]\nNote: GSVA is a particular type of gene set enrichment method that works on single samples and enables pathway-centric analyses of molecular data by performing functional analysis from genes to gene sets to detect subtle pathway activity changes over a sample population.\nThe resulting enrichment scores were used for clustering the samples in a pathway-centric manner by k-means clustering using the R/Bioconductor package ComplexHeatmap.5[href=https://www.wicell.org#bib5]"
  ],
  "subjectAreas": [
    "Immunology",
    "Stem Cells",
    "Cell Biology",
    "Neuroscience",
    "Cell Differentiation",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}