{
  "id": 5508,
  "origin_website": "Bio",
  "title": "Measuring Cyanobacterial Metabolism in Biofilms with NanoSIMS Isotope Imaging and Scanning Electron Microscopy (SEM)",
  "procedures": [
    "Rare isotope substrate generation, biofilm incubations, fixation and preparation on Si wafersGenerate rare isotope enriched extracellular organic matter (EOM) Note: Substrate for isotope labeling will depend on hypotheses being tested that are specific to the experiments conducted. Here, we describe generation of a polymeric rare isotope labeled substrate, EOM, but substrates may also be simple defined compounds (e.g., 13C-amino acids, glucose, bicarbonate, or 15N nitrate, ammonium). Substrate used will be dependent on hypotheses being tested.Inoculate and grow a biofilm (or pure culture) in sealed flasks (with no headspace) to late exponential phase, with fresh media of similar composition to experimental conditions but where the growth substrate of interest is replaced by a rare isotope analog (e.g., ASN with 3 mM 13C sodium bicarbonate and 1.76 mM K15NO3). Notes: Biofilms are cultured without headspace in order to avoid CO2 (without 13C label) to equilibrate from the air into the medium, however, the 13C sodium bicarbonate will become depleted and will need to be refreshed over time. Frequency of addition of 13C sodium bicarbonate will depend on C-fixation rates of the biofilm. Our additions were made every 48 h.Maintaining biofilms in conditions to which they have been previously acclimated is recommended. In this case, biofilms were cultured with a 12:12 light:dark cycle at 23 °C and 20 μmol m-2 sec-1 light.Transfer the biofilm(s) an additional three times into the rare-isotope media at 1:50 dilution.Note: The target biomass of late exponential biofilm for these cultures is 50-100 mg dry weight (in this case, 50 ml cultures, 3 weeks of growth).Inoculate this rare-isotope-labeled culture into a larger volume fresh rare isotope media and grow to late exponential phase, at the volume(s) needed to generate approximately 1-5 g dry weight.",
    "Inoculum can be split into multiple flasks at this stage, ensuring equal inoculation of each culture. For our biofilms, this was achieved with four 500 ml flasks of cultures grown for 3 weeks.Harvest biofilm(s) and separate EOM (adapted from Jiao et al., 2010; Stuart et al., 2016b). Note: Methods described here are specific to hypersaline filamentous cyanobacterium, ESFC-1, and will need to be tested and modified for different species. Decant and discard media overlaying biofilm and transfer biofilm to sterile Dounce homogenizer. If biofilm is adherent, use sterile cell scraper.Add 1-2 ml sterile solution. Note: For our hypersaline biofilms, 10% NaCl was used, and salt concentration chosen based on that of defined medium, (e.g., ASN).Homogenize biofilm. Note: This will require microscopic examination initially to ensure minimal cell lysis during homogenization.Incubate homogenate for 15 min at 40 °C. Note: This is to loosen the exopolysaccharides from the cells. This will require initial tests, such as microscopic examination, to ensure minimal cell lysis is occurring during this step.Centrifuge homogenate at 15,000 x g at 4 °C for 20 min. Separate supernatant from cell pellet and filter through 0.2 µm syringe filter. Filtered supernatant is EOM. Store at -80 °C until use.Note: Polyethersulfone membranes are recommended since they have low protein and polysaccharide binding.Determine the bulk isotope ratio of cell pellet and EOM by isotope-ratio mass spectrometry (e.g., ANCA-IRMS, PDZE Europa Limited, Crewe, England).Inoculate cells into replicate preferred cultivation chambers, cultivate for biofilm development, measuring growth over time, a detailed description of growth conditions for our cyanobacterial biofilms can be found in Stuart et al., 2016b. Notes: Minimize volume of biofilm cultures as much as possible, while maintaining relevant conditions, to conserve use of stable isotope substrate (EOM, in this case), generated in step A1.",
    "To obtain quantitative measurements of elemental uptake (µg C or N fixed), biomass measurements for all biofilm community members are necessary. Microscopy of a subportion of the fixed biofilm may be used to generate biovolume measurements (Stuart et al., 2016b).A fully defined medium (e.g., ASN [Stuart et al., 2016a]) is recommended, in which all C and N sources are known, so that biofilm C and N budgets can be estimated. Add stable isotope labeled substrate(s) to naïve biofilm cultureAdd isotopically rare growth substrate (step A1) to unlabeled biofilm cultures (step A2). Control treatments should include (at minimum):Killed controls–fix biofilms with 4% PFA (see Recipes below) for 1 h prior to experiment start, rinse off fixative, then treat similarly to other live samples.Controls with no stable isotope added.Optional: other controls to address hypotheses regarding specific metabolisms (for example, in presence of specific inhibitors).At chosen time points, remove spent media from biofilm cultures.Note: Time points are dependent on metabolic rates being targeted, and growth rates of test organisms. Our time points ranged from 1 h to 24 h, based on the growth rate of our organism (approximately 0.1 day-1) and bulk rates of C-fixation based on 13C-bicarbonate incorporation (IRMS measurements).Optionally: Save spent media for further analysis–filter through 0.2 µm polyethersulfone syringe filters and freeze the filtrate at -80 °C.Fix tissues to preserve ultrastructureAdd 4% PFA to biofilm tissues and incubate either 1 h at room temperature or overnight at 4 °C. Note: Glutaraldehyde or ethanol are acceptable alternative fixatives.Remove 4% PFA and rinse biofilms carefully a minimum of 3 times with sterile H2O. Note: It is important to thoroughly remove salt and fixatives, as these interfere with NanoSIMS measurements.Store biofilms in 50% EtOH, in enough volume to cover the biofilms, at -20 °C.",
    "Note: Fixed biofilms can be stored under these conditions for up to a few years.Prepare fixed biofilm samples for microanalysis and imagingUsing a pipet tip, transfer a piece of fixed biofilm into a sterile tissue grinder containing 1 ml of sterile H2O.Grind gently to break up biofilm and transfer to a 1.7 ml microcentrifuge tube.Centrifuge at 10,000 x g for 1 min, remove supernatant and add 1 ml of sterile H2O. Repeat rinse process, remove supernatant and then resuspend in 10 µl of 50% EtOH. These steps help to remove excess extracellular organic matter that adheres to cell surfaces. This organic matter can interfere with NanoSIMS analysis of cellular uptake.For mixed species biofilms (i.e., non-axenic mixtures of bacteria and cyanobacteria), the centrifugation speed must be high enough or long enough to collect bacterial cells in addition to filaments (e.g., 15,000 x g, and/or more than 20 min).Under a dissecting microscope, gently score silicon wafers with a diamond scribe to create a ~2 x 2 mm spaced grid (see Figure 1A). Pipet 1-2 µl of sample onto one square of the grid, let dry and examine under the microscope–aim for approximately 30 filaments per spot, if there are too many or too few, wash off sample and concentrate/dilute sample in tube as necessary. In the ideal preparation, cells should form a monolayer, with minimal overlap or clumping. Replicate samples and treatments may be pipetted into additional grid squares; they should be close together, without risking overlap. Dry samples overnight or longer at room temperature, protected from dust and humidity.Optional: image with an epifluorescence microscope to assess cell density and configuration. Be aware that fluorescence imaging may not be performed after metal coating.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427025510_1957.jpgFigure 1. Representative image of samples and analysis. A. Silicon wafer with 5 samples spotted on grid.",
    "Scale bar is 1 mm. Red box and arrow indicate location of SEM image. B. SEM image. Red box indicates a representative NanoSIMS analysis area, NanoSIMS output of this area is shown in C-E. C. NanoSIMS 12C14N ion image, showing cumulative counts in a 30 x 30 µm area, with a 2562 pixels beam spot size, over a duration of 30 cycles. D. 13C/12C ratio image; E. 15N/14N ratio image. Numbered white circles in (C-E) indicate representative regions of interest (ROIs) for analysis. ROIs 1-3 values are in Table 1. Scale bars for (B-E) are 10 µm.Use sputter coater to coat samples with a highly conductive metal surfaceA gold or iridium coat is typical; aim for a 5 to 10 nm coating; thicker for larger cells or preparations with increased topographic relief. Carbon coating may be used, but will interfere with carbon isotope measurements.Metal coating is not necessary for low-relief samples (< 1 μm), but it improves SEM imaging and initial imaging of the sample in the NanoSIMS.Place Si wafers in a holderIf the SEM chamber is large enough, samples may be placed in a NanoSIMS holder; otherwise, SEM image samples prior to loading in a NanoSIMS holder.SEM imagingSEM imaging is very useful for selecting analysis targets and ensuring they are clear of interfering debris or non-target cells. Analysis locations selected in the SEM may be relocated in the NanoSIMS if SEM images of the target location are collected at three scales (100x, 500x, and 3,000x). SEM stage coordinates can also be used to relocate targets that are too small or indistinct to identify in the NanoSIMS light imaging system (CCD camera); this is not necessary for most cell dispersions on Si wafers.Place holder with samples into the SEM.",
    "Adjust spot size and kV as needed for the instrument; low voltage imaging can reduce charging if the sample has not been metal coated. Select analysis targets and image at low, medium and high magnification (100x, 500x, 3,000x). Choose locations where multiple filaments are adjacent or overlap, but are still clearly distinguishable (see Figure 1B). Note: Overlapping filaments will allow for analysis of 2-3 filaments in one analysis window, maximizing NanoSIMS analysis time, however, if they are not clearly distinguishable this will compromise the analysis.If heterotropic bacterial cells are of interest, collect high magnification images (> 3,000x) in order to clearly visualize them (Figure 1B). Collect enough SEM images for analysis of at least 20 filaments per sample.NanoSIMS analysisLoad sample into NanoSIMS Samples may require 1-12 h to come to the necessary vacuum, depending on the sample type, dryness and density of cell material.Analysis for C and N isotopes is performed using a Cs+ analysis beam. Negative secondary ions are extracted in this mode. Tune the instrument and set up masses for the desired analysis. To measure 13C or 15N enrichment in cells, ion masses of 24, 25, 26, 27 (12C2-, 13C12C-, 12C14N-, and 12C15N- respectively) should be collected. Previous work indicates the C dimer (e.g., 12C2-) has superior yield to the 12C monomer and better coincidence with the secondary mass spectrometer settings for CN-(Pett-Ridge and Weber, 2012). Mass resolving power (ΔM/M) > 6,800 is necessary to resolve isobaric interferences.Reference materials should be analyzed to ensure correct instrument performance. This can simply be unlabeled controls, though a consistently run sample can provide higher confidence in the results (Pett-Ridge and Weber, 2012).",
    "Choose analysis beam currentTypically, analysis speed is the primary factor considered in the choice of beam current, because CN- is a high yield species, and the maximum sustainable count rate for the NanoSIMS detectors is ~250,000 counts per second, which is easily achieved from cells with 1 to 2 pA Cs+. These settings will typically yield ~150 nm diameter analysis beam. This diameter sets the ultimate spatial resolution of the analysis.If higher spatial resolution is desired, lens and aperture settings that reduce the diameter of the analysis beam and reduce the beam current should be used.Choose and save locations to analyzeGeneral locations are first recorded based on points located in the CCD camera (light imaging). If desired targets cannot be visualized in the CCD camera, other land marks must be located, and measurements determined from an SEM image or a coordinate transformation can be used to locate the targets in SIMS mode. SIMS real-time imaging is necessary to ensure that targets selected in CCD imaging are centered in the imaged field.Set up analysis parameters to use on each mapped location and analyze. This includes:Size of analysis raster, which will depend on the size of the cells being analyzed. Usually between 10 x 10 µm and 25 x 25 µm.Pixel number, which is typically based on the analysis beam spot size (linear pixel number) ~2 x (raster size)/(spot size). For a typical 150 nm diameter analysis beam, 1282 pixels would be reasonable for a 10 x 10 µm raster, and 2562 pixels for a 25 x 25 µm raster. Pre-analysis sputtering: typically, a high-current Cs+ beam is rastered over the sample before data collection to enhance and stabilize the secondary ion count rate from the sample.",
    "The sample is sputtered to approximately twice the depth of Cs+ implantation, which is on the order of 60 nm. One can estimate the necessary duration of sputtering based on the sputter rate (ξ), primary ion beam current (I), sputtering time (t), raster area (A) and sputtered depth (d):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427195028_7613.jpgFor biological materials, the sputter rate may be estimated as 2.5 nm µm2 pA-1 sec-1 (Ghosal et al., 2008). Longer pre-analysis sputtering may be necessary to remove residual materials from cell surfaces. The optimal duration of sputtering can be determined empirically by monitoring count rates and isotopic ratios with depth.Analysis duration, which should be timed according to the number of counts needed from the smallest target to achieve sufficient analysis precision; 10,000 counts of the minor isotope will result in ~1% analysis precision.Notes:Determining consistent data collection parameters will likely be an iterative process, especially for a new sample, where enrichment levels, residual material on the cell surfaces, and within-sample variability, is unknown. Samples may need to be analyzed and examined, after which conditions may be altered slightly to ensure appropriate data collection.It is critical that unlabeled and killed controls be run. These results are used for the enrichment calculations below."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}