{
  "id": 17506,
  "origin_website": "Jove",
  "title": "Nerve Ultrasound Protocol to Detect Dysimmune Neuropathies",
  "procedures": [
    "All examinations for this work were performed in compliance with institutional guidelines of the Ruhr-University Bochum, Germany.\n1. Experimental preparations\nPatient preparation\n\t\nCheck the patient inclusion criteria: examine adult patients diagnosed with polyneuropathy, suspicious of inflammatory origin.\nCheck the patient exclusion criteria: do not examine patients with open wounds or infections in the regions to be examined.\nInstrumental checkpoints\n\t\nCheck the integrity of the ultrasound machine and all the materials used (see Table of Materials).\nEnter patient name and details in the ultrasound machine before starting the ultrasound examination (depending on the machine).\nChoose an appropriate ultrasound probe (preferred 14-18 MHz) (see Table of Materials) and preset for the neuromuscular ultrasound.\nDuring the whole examination, adjust the depth and focus on obtaining optimal image quality.\nWhenever possible, examine the complete course of each nerve in a cross-sectional view.\n\t\tNOTE: The nerves recommended for examination are: median, ulnar, radial nerve, cervical roots, brachial plexus, and vagal nerve, as well as tibial, fibular, and sural nerve (Figure 3). The examination of each of these nerves is shown in the next section and the video. The entire ultrasound examination according to the following protocol will take ~30-45 min.\n2. Ultrasound examination\nStart examining the arm nerves with the patient sitting in a neutral position with the arm resting supinated on a surface, e.g., the leg.\nPlace some ultrasound gel over the transducer probe, the wrist, the forearm, the elbow, and the upper arm.\nFor examination of the median nerve, start by performing a transverse scan at the wrist level.\nMove proximally to follow the anatomical course of the median nerve to the upper arm.",
    "Measure the CSA of the median nerve at the following sites: at the entrance to the carpal tunnel (retinaculum flexorum); at the forearm (10-15 cm proximal to retinaculum flexorum; at the elbow (crook of the elbow); at the upper arm next to the brachial artery (at the middle of the distance between the medial epicondyle and axillary fossa).\nFor examination of the ulnar nerve, start by performing a transverse scan at the level of the wrist ulnar to the median nerve.\nMove proximally to follow the anatomical course of the ulnar nerve along the sulcus to the upper arm.\n\tNOTE: Moving toward the upper arm, let the patient raise the arm bent at the elbow to examine the sulcus and upper arm.\nMeasure the CSA of the ulnar nerve at the following sites: at the entrance to Guyon's canal; at the forearm (10-15 cm proximal to Guyon's canal); at the elbow (between the medial epicondyle and olecranon); at the upper arm (at the middle of the distance between the medial epicondyle and axillary fossa).\nTo examine the radial nerve, let the patient hold the arm in front of the stomach bent in the elbow and scan the radial nerve directly next to the humerus.\nUse color duplex mode to avoid confusion with the accompanying artery and vein.\n\tNOTE: Color duplex mode shows blood flow in arteria profunda brachii, and might show low flow in the corresponding vein, while no flow occurs in the radial nerve. Additionally, the vein can be compressed by exerting external pressure, and the nerve cannot.\nMeasure the CSA of the radial nerve at the following site: radial nerve in the spiral groove.\nCarry on with the examination of the vagal nerve, cervical nerve roots, and the brachial plexus.",
    "Place ultrasound gel at the middle of the neck.\nTo examine the vagal nerve, perform a transverse scan at the middle of the neck and find the carotid artery.\n\tNOTE: The vagal nerve can be found directly next to the carotid artery and jugular vein.\nMeasure the CSA of the vagal nerve at the following site: at carotid sheath at the level of the carotid bifurcation.\nFor the examination of cervical nerve roots, C5, C6, C7 move the probe dorsal and a little up and down.\n\tNOTE: The cervical nerve roots appear between the anterior and posterior tubercle of the transverse process. C7 can be recognized by the absence of the anterior tubercle from its transverse process, while both anterior and posterior tubercles are found with the other cervical nerve roots.\nMeasure either the CSA or the diameter of the cervical nerve roots at the most proximal location possible, where the nerve root exits over the transverse process: C5; C6; C7.\nTo examine the brachial plexus, follow the anatomical course of the cervical nerve roots distally and find them perform trunks and cords.\nMeasure the CSA of the plexus at the following sites: Intrascalene space (between anterior and medial scalene muscle); Supraclavicular space (next to A. subclavia).\nCarry on with the examination of the leg nerves.\nLet the patient lie down to one side with the legs slightly bent. Place some ultrasound gel over the transducer probe, the popliteal fossa, the fibula, the malleolus, and the lower leg.\nFor examination of the fibular nerve, feel the fibular head, place the transducer directly behind it, and then follow the course of the nerve to the popliteal fossa.\nMeasure the CSA of the fibular nerve at the following sites: just proximal to the ﬁbular head; in the popliteal fossa.",
    "To examine the tibial nerve in the popliteal fossa, find the fibular nerve and the popliteal artery in the popliteal fossa.\n\tNOTE: The tibial nerve can be found just above the popliteal artery in most cases.\nMeasure the CSA of the tibial nerve at the following site: in the popliteal fossa.\nFor examination of the tibial nerve at the ankle, place the probe directly behind the medial malleolus.\n\tNOTE: The tibial nerve can be found just next to the posterior tibial artery in most cases.\nMeasure the CSA of the tibial nerve at the following site: at the level of the medial ankle.\nFor examination of the sural nerve, place the probe at the lateral ankle.\n\tNOTE: The sural nerve can be found next to a superficial vein in most cases.\nFollow the anatomical course of the sural nerve proximally to the lower leg.\nMeasure the CSA of the sural nerve at the following site: between the lateral and medial head of the gastrocnemius muscle.\nPerform all measurements on both sides.\nSave the results of all the measurements (depending on the ultrasound machine) and end the examination.\n\tNOTE: Figure 3 gives an overview of all measuring sites for CSA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}