{
  "id": 3333,
  "origin_website": "Cell",
  "title": "Generation of Casp8FL122/123GG Mice Using CRISPR-Cas9 Technology",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nGeneration of Cas9 mRNA Transcript\nTiming: 1 day\nThis section describes the steps used for the generation of SpCas9 mRNA transcript. This transcript is produced from a modified version of the codon optimized SpCas9 plasmid (Mali et al., 2013[href=https://www.wicell.org#bib4]) (Plasmid 41815: hCas9, Addgene) in which the T7 promoter was inserted upstream of the SpCas9 cDNA (Pelletier et al., 2015[href=https://www.wicell.org#bib6]). The transcript is synthesized in vitro using the mMESSAGE mMACHINE T7 Ultra Kit (Invitrogen, AM1345). The insertion of the T7 promoter allows for the rapid preparation of large quantities of Cas9 transcript directly from the linearized plasmid. RNA transcripts are subsequently enriched using the MEGAclear Kit from Invitrogen (AM1908M) and analyzed using the 2100 Bioanalyzer from Agilent Technologies (Fig. 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/292-Fig2.jpg\nFigure 2. SpCas9 mRNA Transcript Synthesis\n(A) Schematic representation of pcDNA3.3TOPO-T7-hCas9 used for the generation of the human codon optimized Cas9 (hCas9) mRNA transcript. pcDNA3.3TOPO-hCas9 (Plasmid 41815: hCas9, Addgene) was modified to insert the T7 promoter upstream of the hCas9 cDNA.\n(B) Generation of ARCA-capped polyadenylated (pA) hCas9 transcripts. pcDNA3.3TOPO-T7-hCas9 is linearized using PmeI restriction enzyme and purified using the QIAquick PCR purification kit. The linearized DNA is then used as template for the in vitro transcription assay using the mMESSAGE mMACHINE T7 Ultra Kit and purified using the MEGAclear Kit from Invitrogen. mRNA transcripts are then analyzed using a bioanalyzer (Agilent Technologies, Inc.).",
    "(C) Migration of hCas9 mRNA transcripts using the 2100 Bioanalyzer from Agilent Technologies. The retention time of polyadenylated Cas9 mRNA transcript (Cas9 + pA) is typically between 50 and 55 s (lane 3) whereas the retention time of non-polyadenylated Cas9 mRNA transcript is between 40 and 50 s (lane 2). RNA ladder sizes from top to bottom are 6,000, 4,000, 2,000, 1,000, 500, 200, and 25 nucleotides. The control RNA was obtained from an adult mouse spleen.\nThis figure was adapted from Pelletier et al. (2015)[href=https://www.wicell.org#bib6].\nGeneration of SpCas9 DNA template\nLinearize pCDNA3.3TOPO-T7-hCas9 by setting up the following restriction digest:\npcDNA3.3TOPO-T7-hCas9 plasmid: 10 μg\nPmeI (R0560S 10,000 units/mL): 2 μL\nNEBuffer Cutsmart: 5 μL\nAdd ddH2O up to 50 μL\nIncubate at 37°C for 2–4 h\nRun a few microliters of the digested and undigested plasmid on 1% agarose gel\nImage gel and save the image for your records\nPurify the remaining of the reaction using QIAquick gel extraction kit (QIAGEN, 28704)\nSetup the RNA transcription assay using mMESSAGE mMACHINE T7 Ultra Kit as described by the manufacturer (Invitrogen, AM1345). Cap and polyadenylate the transcript.\nPurify RNA using MEGAclear Kit according to manufacturer’s instruction.\nMeasure RNA concentration with Nanodrop Spectrophotometer (Thermo Fisher Scientific, 13-400-519).\nAliquot 8 μg of RNA transcript in 1.5 mL microfuge tubes. Label and store −80°C.\nSave 2–3 μL to run on 2100 Bioanalyzer (1 μL is enough per run).\nAssess the quality of RNA on bioanalyzer according to manufacturer’s recommendations.\nGeneration of the sgRNA Transcript\nTiming: 1 day",
    "sgRNA transcripts for zygote injection are produced in vitro from double stranded DNA templates. DNA templates are generated by annealing two ssDNA oligonucleotides, fill-in of protruding ends, and the amplification of the full-length template by PCR. The following describes the step-by-step procedure for the generation of the dsDNA template and the single guide RNA transcript (Fig. 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/292-Fig3.jpg\nFigure 3. sgRNA transcript Synthesis\n(A) Schematic representation of the dsDNA template used for sgRNA generation. Gray arrow, T7 promoter; red line; crRNA which is specific to the genomic target sequence; blue arrow, sgRNA scaffold.\n(B) Primers used for the generation of target-specific sgRNAs. T7-19, sgRNA-R, sgRNA common primer, sgRNA specific primer. sgRNA common primer and sgRNA specific primers have overlapping complementary sequences pairing the two oligonucleotides together.\n(C) Flowchart detailing the steps of sgRNA generation. The first step in the generation of sgRNAs consists of generating a dsDNA template (A) that will subsequently be used in an in vitro transcription assay for short RNA transcripts. The dsDNA template is generated by annealing a target-specific oligonucleotide called sgRNA specific primer together with the sgRNA common primer. Following the annealing reaction, a fill-in reaction produces the dsDNA that will subsequently be amplified by PCR using the T7-19 and sgRNA-R primers. The PCR product is then purified using the QIAquick PCR purification kit (QIAGENQIAGEN) and used in in vitro transcription assays using the MEGAshortscript T7 Kit from Invitrogen. The transcript is then enriched using the MEGAclear Kit from Invitrogen and analyzed using the 2100 Bioanalyzer from Agilent Technologies, Inc.\n(D) Migration of sgRNAs using the 2100 Bioanalyzer from Agilent Technologies. Retention times of sgRNAs transcripts are typically between 25 and 30 s (black arrow). RNA ladder sizes from top to bottom are 6,000, 4,000, 2,000, 1,000, 500, 200, and 25 nucleotides.",
    "This figure is adapted from Pelletier et al. (2015)[href=https://www.wicell.org#bib6].\nGeneration of the sgRNA DNA template\nRe-hydrate all oligonucleotides to a concentration of 100 μM using ddH2O\nSetup PCR reactions on ice as follows:\ntable:files/protocols_protocol_292_5.csv\nNote: Reactions 2, 3, and 4 are control reactions.\nUse the following cycling conditions:\ntable:files/protocols_protocol_292_6.csv\nLoad 5 μL of annealing reaction on a 2% agarose gel/in 1× TAE buffer and run at 120 V for 30–60 min\nImage gel and keep for your records\nDilute PCR reaction 1:200 in ddH2O\nSetup PCR reactions on ice as follows:\ntable:files/protocols_protocol_292_7.csv\nUse the following cycling conditions:\ntable:files/protocols_protocol_292_8.csv\nLoad 5 μL of PCR products on 2% agarose gel in 1× TAE buffer and run at 120 V for 30–60 min\nImage gel and keep for your reference\nClean DNA fragment, 45 μL of PCR product, from steps a-h, using QIAquick PCR purification kit, using the centrifugation method\nMeasure DNA concentration and store at −20°C\nSynthesize the sgRNA using MEGAshortscript T7 kit as described by the manufacturer (Invitrogen, AM1354).\nQuantify DNA using a nanodrop spectrophotometer.\nSave 2–3 μL to run on 2100 Bioanalyzer (1 μL is enough per run).\nAssess the quality of RNA on bioanalyzer according to manufacturer’s recommendations.\nStore the remaining sgRNA transcript at −80°C.\nAlternative Strategies\nRecombinant Cas9 Protein and Synthetic sgRNAs\nAs an alternative to in vitro transcription for the generation of sgRNAs and Cas9 mRNA, synthetic sgRNAs can be used in combination with SpCas9 protein for microinjection. These can be purchased from various commercial sources including New England Biolabs, IDT, Invitrogen, Sigma-Aldrich, and others.\nsgRNA Quality Control",
    "In addition to, or as an alternative strategy, to assess the quality of in vitro transcribed sgRNAs, a functional in vitro Cas9 assay can be performed by combining recombinant Cas9 protein, the in vitro transcribed sgRNA and their substrate, a double stranded DNA fragment containing the sgRNA target sequence. This DNA fragment can be obtained by PCR amplification of the target site as described under “PCR optimization.” The following steps describes this procedure.\nFor each sgRNA, setup set up the following in vitro Cas9 assay reactions. The first reaction contains all components of the reactions whereas the other three reactions serve as negative controls where either recombinant Cas9 protein, the sgRNA or the on-target PCR product (see PCR optimization for the generation of on-target PCR fragments) is omitted.\ntable:files/protocols_protocol_292_9.csv\nIncubate reactions at 37°C for 30 min.\nAdd 1 μL of Proteinase K (500 μg/mL) to each sample and incubate at 55°C for 10 min, to inactivate Cas9.\nLoad 10 μL of each reaction on a 1%–2% agarose gel supplemented with GelRed 1× at 120 V for approximately 40 min.\nImage gel.\nDNA fragments of 310 and 120 bp, corresponding to the cleaved PCR product should be observed in the reaction 1. Full-length PCR products (430 bp) should be observed in reaction 2 and reaction 3, and no DNA should be found in reaction 4.\nPreparation of Microinjection Mixes and Injections\nTiming: 15 min\nThis step-by-step procedure describes the preparation of Cas9 mRNA, sgRNA, and HDR template mix used for mouse zygote microinjections.\nPrepare the Cas9 mRNA transcript, sgRNA and HDR template as follows:\nCas9 mRNA transcript, 100 ng/μL. Use 1 aliquot (8 μg) previously frozen\nsgRNA, 50 ng/μL (Total of 4 μg)\nHDR oligonucleotides, 1.2 pmol/μL (~1 μL of a 100 μM)\nRNase free ddH2O, up to 80 μM",
    "Make 20 μL aliquots and keep frozen until ready for microinjection.\nMicroinjection of Pronuclear Stage Zygotes\nTiming: several weeks\nMicroinjection of pronuclear stage zygotes is typically done by transgenic core facilities. For detailed procedures, we recommend the following manual: Manipulating the Mouse Embryo; A Laboratory Manual, Fourth Edition (Behringer, 2014[href=https://www.wicell.org#bib2]).\nPCR Optimization\nTiming: 1 day\nThis step describes the procedure to optimize PCR reactions for the characterization of mice obtained from zygote injections using QIAGEN Taq Polymerase (QIAGEN, 201205). One approach to assay optimization is to determine the optimal annealing temperature of the primers by testing identical reactions containing fixed primer concentrations, across a range of annealing temperatures. This procedure also tests for the optimal concentration of MgCl2 to be used for amplification. This procedure should be performed prior to obtaining mice from zygote injection so that when mice are obtained from the transgenic facility, genotyping can be performed quickly.\nPrepare PCR mix with low MgCl2 concentration as indicated below:\ntable:files/protocols_protocol_292_10.csv\nPrepare PCR mix with high MgCl2 concentration as indicated below:\ntable:files/protocols_protocol_292_11.csv\nDistribute master mix in 8 wells of a 96 well plate so that each well has a different annealing temperature.\nUse the following cycling conditions:\ntable:files/protocols_protocol_292_12.csv\nLoad 10 μL of PCR product on a 1%–2% agarose gel supplemented with GelRed 1× at 120 V for approximately 40 min.\nImage gel and save picture for your records.\nSelect the best PCR condition.\nOn-Target PCR Genotyping\nTiming: 1 week\nThis step-by-step procedure describes the characterization at the genomic level of mice obtained from zygote injection. To analyze on-target gene editing, the guide target region is PCR amplified and each amplicon is analyzed by restriction enzyme digestion, gel electrophoresis, and Sanger sequencing (Fig. 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/292-Fig4.jpg\nFigure 4. Representative PCR Genotyping Results",
    "(A) Mouse genotypes were routinely determined by PCR on tail genomic DNA extracts. By using the Casp8_FL-GG_F01 and Casp8_LG-GG_R02 primers, a single amplicon of 430 bp is generated for both alleles (lanes 3, 4, and 5). Only PCR amplicons generated from Casp8FL122/123GG allele (Casp8FL-GG) are sensitive to DraI digest (lanes 8 and 9). Note the complete digestion of the PCR amplicon generated from Casp8FL-GG/FL-GG mice by DraI (lane 9).\n(B) Representative Sanger sequencing chromatogram obtained for the PCR amplicons generated from Casp8 and Casp8+/FL-GG mice. Note the double peaks where the nucleotide substitutions occurred. GTTCCT to AGGTGG.\nAfter receiving toe biopsies from your transgenic facility, extract genomic DNA by incubating each tail biopsy in tail lysis buffer (KCl, 500 mM; Tris pH8.3, 100 mM; Gelatin, 0.1 mg/mL; NP40, 1% (v/v); Tween 20, 1% (v/v); Proteinase K, 500 μg/mL), 16 h at 55°C.\nThe next day, heat inactivate the Proteinase K by incubating digested biopsies at 95°C for 10 min.\nFor each DNA sample, setup PCR reactions on ice using previously established PCR conditions. Also include:\nNegative Control (no genomic DNA)\nPositive Control (Wild-type DNA used for optimizing PCR conditions)\nFollowing amplification, save:\n10 μL to run on agarose gel (1%–2%)\n10 μL to digest with appropriate restriction enzyme and run on agarose gel\n25 μL for ExoSAP-IT (Invitrogen, 78201) and sequencing reactions\n10 μL of each “exoSAP”ed sample for sequencing with target-specific forward primer\n10 μL of each “exoSAP”ed for sequencing with target-specific reverse primer\nSet up restriction digest as follows:\nSetup restriction enzyme digests for each PCR reactions as follows:\ntable:files/protocols_protocol_292_13.csv\nIncubate 2–18 h at 37°C\nRun both digested and undigested PCR products for each sample on 1%–2% agarose gel. Load samples as follows:\nDNA Ladder\nSample 1\nSample 2\nSample 3\nS…\nPositive control\nNegative control\nEmpty Space",
    "DNA Ladder\nSample 1 digested\nSample 2 digested\nSample 3 digested …\nPositive control digested\nNegative control digested\nImage gel and keep for your records.\nSet up ExoSAP-IT reactions as follows:\nMix 25 μL of a post-PCR reaction product with 1 μL of ExoSAP-IT reagent (Affymetrix, 78200) in a well of a 96-well plate or 200 μL microfuge tube\nIncubate at 37°C for 30 min to degrade remaining primers and nucleotides.\nIncubate at 80°C for 15 min to inactivate ExoSAP-IT reagent. The PCR product is now ready for use in DNA sequencing.\nSetup sequencing reactions as follows:\n11 μL “exoSAPped” PCR product + 0.5 μL of 10 μM forward primer\n11 μL “exoSAPped” PCR product + 0.5 μL of 10 μM forward primer\nSubmit for sequencing\nAnalyze sequencing data using SnapGene as follows:\nOpen Ab1 files using SnapGene\nAnalyze the chromatogram and look for insertion or deletion of genetic materials, and insertion of the desired mutations\nOff-Target PCR Genotyping\nTiming: 1 week\nAlthough off-target cleavage is infrequent when generating mice via microinjection of SpCas9 mRNA transcript, off-target cleavage may occur. To identify off-target cleavage in mice harboring the desired mutation, off-target loci are PCR amplified and each amplicon sequenced. For off-targets, PCR optimization steps are not required unless no amplification is observed. For sequencing reactions, only forward sequencing data are needed unless no information can be obtained. Only the top five potential off-targets should be screened. If no off-target activity is detected, we consider the mouse line acceptable.\nSetup PCR reactions using off-target primer pairs as described below. Analyze genomic DNA from each potential founder. Also include:\nNegative Control (water only)\nPositive Control (DNA from same species)\ntable:files/protocols_protocol_292_14.csv\nUse the following cycling conditions:\ntable:files/protocols_protocol_292_15.csv\nUse 10 μL to run on agarose gel.\nImage gel and keep for your records.",
    "Set up ExoSAP-IT reactions as follows:\nMix 25 μL of a post-PCR reaction product with 1 μL of ExoSAP-IT reagent (Affymetrix, 78200) in a well of a 96-well plate or 200 μL microfuge tube.\nIncubate at 37°C for 30 min to degrade remaining primers and nucleotides.\nIncubate at 80°C for 15 min to inactivate ExoSAP-IT reagent. The PCR product is now ready for use in DNA sequencing.\nSetup sequencing reactions as follows:\n11 μL “exoSAPped” PCR product + 0.5 μL of 10 μM forward primer\n11 μL “exoSAPped” PCR product + 0.5 μL of 10 μM forward primer\nSubmit for sequencing\nAnalyze sequencing data using SnapGene as follows:\nOpen Ab1 files using SnapGene\nAnalyze the chromatogram and look for insertion or deletion of genetic materials, and insertion of the desired mutations"
  ],
  "subjectAreas": [
    "Model Organisms",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}