{
  "id": 5087,
  "origin_website": "Bio",
  "title": "Subchromoplast Fractionation Protocol for Different Solanaceae Fruit Species",
  "procedures": [
    "Rapid homogenisation and isolation of the crude chromoplast fractionDay 0:Harvest 90 to 150 g of tomatoes at the ripening stage of breaker + 3 to + 5 days per condition (for instance, wild type and transgenic tomatoes). The fruits need to be firm. Ensure an equal weight is used for both conditions (WT and transgenic tomatoes). For pepper fruits, harvest 30 to 120 g of fruit depending on the type of pepper and the colour of the fruit. This step varies enormously depending on the fruit, whether they contain high pigment (carotenoids) levels or not. Care must be taken at this step to avoid the use of too much fruit, as this will result in overloaded sucrose gradients and consequently, a clear separation will not be achieved. On the contrary, if there is not enough fruit, no enriched material within the gradient will be observed. It is advisable to perform several trials to optimise the correct amount of fruit needed for your experiment and laboratory conditions. Note: Red bell peppers contain higher levels of pigments compared to orange or yellow bell peppers. So, we recommend to use 30 g of red bell peppers and 120 g of orange or yellow bell peppers. We also use 30 g for red chili peppers. However, if you are studying a high pigment or low pigment line, these weights might need to be optimised. It is only by doing the fractionation that you will see if your gradient is overloaded (same colour throughout, no clear separation). If it is the case, you will have to use less fruits. On the contrary, if you don’t see a lot of colour or no crystal, that may indicate that you did not use enough fruits to start with and you need to increase the initial fruit weight.",
    "Wash the fruit with tap water or distilled water, deseed them.Cut the pericarp into pieces (± 1 cm2) (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701225015_7892.jpgFigure 1. Examples of Bell and Chilli pepper material prepared ready for homogenisation. A, B, C, and 1, 2, and 3 indicate the different accessions of pepper studied.Place them in a plastic tray, covered with foil, overnight at 4 °C (in order to reduce the amount of starch in the fruit). This is particularly important when carrying out the procedure with green chloroplast containing fruit. It is also important to note that some mutants have altered ripening and thus carbohydrate levels and texture will vary. Prepare the extraction buffer (2 L) and the gradient buffers (without the DTT) and place them overnight in the cold room.In the -20 °C room, store the plastic containers (for the ice), eight centrifuge tubes (50 ml), four centrifuge bottles (500 ml), and two glass flasks (5 L). The plastic ware can be pre-washed with distilled water.Place the centrifuge rotors in the fridge overnight.Day 1:Start promptly in the morning (8.00 am), switch on the centrifuges and cool them to 4 °C.Place the rotor GSA-3 in the centrifuge RC-5C. Place the glass flasks and the centrifuge bottles (500 ml) on ice (in the ice containers) and place the experimental materials in the cold room.Note: Work in the cold room in the following steps (steps 4-19 of Day 1), with everything on ice where possible.Place the pieces of fruits in the blender (Clean the blender vessel with distilled water before re-use it for the next condition).Add extraction buffer (do not forget to add the DTT from the stock solution) to cover the fruits (1:3 ratio, the fruit pieces need to be adequately covered) (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701225324_2531.jpgFigure 2.",
    "Pepper pericarp in extraction buffer before homogenisationLeave the buffer to infiltrate into the tissues for 5 min.Use rapid blast for 3 sec (5 sec for pepper fruit) from the Waring blender, repeated twice at high speed. This should break the cell walls but keep the chromoplasts intact, due to the sucrose maintaining a constant osmotic pressure (Figure 3). Note: It is important that the tissues are not over homogenised, as this will result in broken plastids and the formation of gelatinous carbohydrate particulate material.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701225456_1529.jpgFigure 3. The extract produced following rapid homogenisation and prior to filtrationUse a glass flask, a funnel and muslin to filter the slurry through 2 to 4 layers of muslin. Pass the slurry through the muslin by squeezing gently (Figure 4). Note: It is important not to apply too much force to avoid the extrusion of polysaccharide material that will affect the pelleting of the plastid material. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701225631_5938.jpgFigure 4. Representation of the extract being filtered through two to four layers of muslin to create an extract free of debrisDivide the tomato juice (filtered extract) into two centrifuge bottles (500 ml). Add extraction buffer to the suspension until it reaches 2/3 of the bottle. As a result, two 500 ml centrifuge bottles per condition are generated (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701225750_2804.jpgFigure 5. Examples of the extracts ready for centrifugation in suitable centrifuge pots capable of pelleting the crude plastid fraction<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Obtaining the filtered pepper extract (protocol Day 1, step 7 to 9) Balance the centrifuge bottles carefully using a top loading balance. Tare the first one, then the second should be equivalent to ± 1 g.Spin the centrifuge bottles in the centrifuge (RC-5C) with the GSA-3 rotor (purple, pre-cooled) at 5,000 x g for 10 min at 4 °C.",
    "This step is to remove the cell debris (supernatant) (Figure 6).Note: To operate the centrifuge RC-5C, check that the rotor is well attached, and close the lid by first turning the bigger cog and then the smaller one. To open it, first turn the small cog and then the big one.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701225926_5169.jpgFigure 6. Pepper extracts before centrifugationDiscard the supernatant carefully by pouring it from the opposite side of the pellet.Leave some volume (5 ml) of supernatant in the pot in order to resuspend the pellet (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701230219_1624.jpgFigure 7. Pellets representing the crude plastid fractions obtained from the pepper extracts after centrifugationResuspend the pellet by swirling the pots or using a glass rod with a rubber teat attached, alternatively for strong residue aggregates a pipette with a cut end tip can be used.Transfer the content of the centrifuge bottle in two centrifuge tubes (50 ml; this step can vary depending on the thickness and constituency of the pellet. The content of one centrifuge bottle could be transferred in only one centrifuge tube, if needed.) and then add extraction buffer in order to fill up to ¾ of the volume of the tube. At this point there are four centrifuge tubes (50 ml) per condition (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701230352_7314.jpgFigure 8. Pepper pellets resuspended in extraction buffer ready for the second centrifugationBalance the centrifuge tubes carefully.Spin the tubes with the centrifuge RC-5C using the GSA-5 rotor (green) at 9, 000 x g for 10 min at 4 °C to pellet the plastid (Potentially, there can be some nuclear and mitochondrial contamination at this point.).Discard the supernatant carefully by pouring it from the opposite side of the pellet.This time, discard all the supernatant. The pellet should be “silky” packed in a manner that does not allow slippage (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701230608_9976.jpgFigure 9.",
    "Pepper pellet obtained after the second centrifugationBreaking the chromoplastsResuspend the pellet of each tube with 3 ml of the 45% sucrose gradient buffer. The tubes can be vortexed. Pour and pool the chromoplast juice from the 50 ml centrifuge tubes of the same condition into the potter-Elvehjem tissue grinder, which is on ice. Wash the tubes with 0.5 ml (or more if needed) of 45% sucrose buffer and pour it into the potter-Elvehjem as well.Homogenise the chromoplast juice using the potter-Elvehjem (approximately 10 times) to break the chromoplasts (Video 2). Keep it vertical to avoid the glass potter from breaking (Figure 10).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Homegenisation of the pepper chromoplast juice using a potter-Elvehjem tissue grinder imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171026/20171026014956_9492.jpgFigure 10. Homogenisation of the pepper chromoplast juice using a potter-Elvehjem tissue grinder Separating the subchromoplast compartments using a sucrose gradientPour everything (now the subchromoplast compartment suspension) into a labelled Falcon tube (50 ml). Keep on ice. To wash the potter-Elvehjem, use 5 ml of 45% buffer twice and add it into the Falcon tube.Prepare the sucrose gradient in three 38.5 ml Ultra-ClearTM centrifuge tubes per condition (if not enough of the suspension is available, prepare only two tubes per condition).First add 8 ml of the subchromoplast compartment juice (already in the 45% sucrose buffer) to the bottom of the tubeThen 6 ml of 38% sucrose buffer Then 6 ml of 20% sucrose buffer Then 4 ml of 15% sucrose buffer And finally, 8 ml of 5% sucrose buffer to the top of the gradient. Add each layer drop by drop on the inner wall of the tube following a circular movement, a Pasteur pipette or a Gilson pipette can be used to perform this task (Video 3).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Preparation of the discontinuous sucrose gradient imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701231049_1741.jpgFigure 11.",
    "Ultra-ClearTM centrifuge tube containing a tomato subchromoplast compartment suspension in sucrose gradient before centrifugationPlace the 38.5 ml centrifuge tubes in their metal container ready for centrifugation. Balance them (including the lid of the metal tube) using 5% sucrose buffer so they weigh exactly the same amount. Use the Beckman support to transport the centrifuge tubes to the Beckman L7 ultracentrifuge. Place the tubes in the SW28 rotor (tubes are hanging). Check their position by slightly twisting them and pulling them vertically and then towards the exterior of the centrifuge.Spin at 24,000 rpm (100,000 x g) at 4 °C for 19 h. Choose hold “on”, vacuum “on” and press start. If there is a problem with the balance, the centrifuge will stop at around 600 rpm. If there is a problem with the vacuum, the centrifuge will stop at around 2,000 rpm.Day 2:Stop the centrifuge: Press the stop button and when the pressure is low switch off the vacuum. The centrifuge lid can then be opened.Be very careful whilst removing the tubes from the rotor.Put them on ice.Take pictures of the different gradients (Figure 12).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701231808_5801.jpgFigure 12. Separation of the pepper subchromoplast compartments in sucrose gradient for the different accessions of pepper (A, B, C, and 1, 2, 3)Collect the fractions with the Gilson 203B fraction collector & pump system (Figure 13). Set the speed to 24.5 on the pump system (or -22.5 with anticlockwise) in order to collect 1 ml in each 1.5 ml tube. Click on the clock arrow. Keep the needle in the blank (water) for the first minute, then put it in your tube and press start on the fraction collector. Always keep the needle at the surface (just under the meniscus).",
    "Do not collect the pellet, leave some millilitres at the end (the fractions that are mixed with the pellet). When all fractions are collected, remove the needle from the tube and place in the blank (1 ml). Thus, the solution in the tubing can be retrieved. Click on the “stop” button to stop the pump system and click on the “end” button to stop the fraction collector. Collect the last millilitres with a pipette in another 1.5 ml tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160701/20160701232007_6239.pngFigure 13. Chilli pepper gradient collected. Numbers indicate the order of the fractions collected (from the top of the Ultra-ClearTM centrifuge tube).Fractions can now be analysed individually.Keep them at -20 °C or at -80 °C (if enzyme assays are carried out)."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}