{
  "id": 5838,
  "origin_website": "Bio",
  "title": "Organotypic Brain Cultures: A Framework for Studying CNS Infection by  Neurotropic Viruses and Screening Antiviral Drugs",
  "procedures": [
    "Culture plate preparationThe day before slicing the brain explants, prepare 6-well culture plates by adding 1 ml of organotypic culture medium (see Recipes) into each well and place the culture inserts on the top using straight tweezers in order to reverse the hydrophobicity of PTFE and to allow a good feeding of the slices (Table 1). Table 1. Time duration recommended for each stepimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113225159_6499.jpgIncubate the plate overnight at 37 °C in a humidified 5% CO2 atmosphere.Dissection preparationDecontaminate the walls and floor of the biosafety cabinet using 70% ethanol in water and UV irradiate for 15 min if available. Before the dissection procedure, sterilize all equipment, i.e., scissors, tweezers, PTFE plate by autoclaving and put them under the biosafety cabinet. Prepare a beaker half-filled with 70% ethanol in water in order to decontaminate the dissection material during the procedure (Table 1). Clean the tissue chopper, the razor blade and the stereomicroscope with 70% ethanol, ensure that the slicing platform is correctly decontaminated and then let everything dry. Mount the razor blade on the tissue chopper using the screw and nut and place the instruments under the biosafety cabinet and spray again with ethanol (Table 1).Place a sterilized container filled with ice under the biosafety cabinet. Prepare the dissection medium (see Recipes) as described in the ‘Recipes’ section using a sterile 50 ml conical tube. Put 6 ml of medium in the bottom of the 35 mm Petri dishes (1 Petri dish for the hippocampus, 1 Petri dish for the cerebellum) and keep the cover for the dissection. The dissection medium must be kept on ice and the entire dissection procedure must be performed at 4 °C (cold medium) to limit tissue damage and cell degeneration.",
    "Fill a Petri dish cover with 5 ml of dissection medium in order to have cold fresh medium throughout the slicing procedure. Remove the conical extremity of a 5 ml plastic pipette with scalpel blade and insert the top part with the carded cotton into the pipette bulb (defined as 5 ml truncated pipette).Dissection and slicing procedureNotes: Refer to the Table 1 for the duration of each step. Table 2 summarizes the troubleshooting and the proposed solution. Gently spray the neck and the head of the animal with 70% ethanol and proceed rapidly to the following step. We recommend using 6 to 10 days-old animals. Since cervical dislocation is not suitable for suckling animals, proceed with decapitation using scissors. This action must be performed by skilled accredited personnel. At this stage, it is necessary to work as quickly as possible. Notes: When animals give rise to a small number of babies, the suckling animals could be much bigger and the decapitation more difficult. In order to prevent potential pain and allow a more comfortable procedure for the experimenter, an anesthetic can be used. We recommend the use of ketamine at a dose of 150 mg/kg, which is an efficient activation-dependent channel blocker of N-methyl-d-aspartate (NMDA) receptors leading to a reduction of the excitotoxicity and prevent neuronal death. In combination with the kynurenic acid contained in the dissection medium, ketamine provides good neuroprotection against excitotoxicity. Brains from younger animals (between P3 to P6) are more difficult to cut into regular parallel slices because they are softer. In addition, numerous non-fully differentiated cells endowed with migration properties may alter the reproducibility of infection experiments. Brains from older animals (beyond P10 to P12) are poorly suitable because of increased cell death that can add bias to the analyses.",
    "This procedure has to follow the local animal ethics protocols and has to mention the species and strains used. Any change in the species has to be amended and validated on the ethics protocol prior to any experimentation.Hold the head between the thumb and index, and remove as much skin and flesh as possible using ultra-fine scissors.Cut the skull in a rostral way from the cavity where the top part of the spinal cord is visible to the cavity containing the olfactory bulbs using the tip of ultra-fine scissors. Remove the brain from the head by inserting the tip of the Dumont tweezers under the olfactory bulbs and lift gently until detachment from the cranium. Put the brain directly in cold dissecting medium in the 35-mm dish. At this stage, it is necessary to isolate and dissect the brain structure in dissection medium to maintain cell viability. Separate the cerebellum (slicing process–from steps C16 to C20) from the brain using a scalpel blade (Figure 1A) and conserve it in cold dissection medium during the preparation of the hippocampal slices as follows (dissecting and slicing process–from steps C8 to C15). Separate the two hemispheres along the midline (Figure 1B) and remove the midbrains (Figure 1C), holding the half brain with forceps and using the lanceolate tip spatula or alternatively a curved tweezers (with an appropriate training approximately 1 min is needed per brain). At this time, the hippocampus is visible (arrow head–Figure 1D). With a scalpel blade cut and remove the rostral part containing the olfactory bulbs (Figure 1D–about 10 sec per hemisphere). Remove the meninges using the Dumont tweezers #5. The hippocampus and cortex are ready for slicing process.Put the hippocampus face down in rostral orientation on Whatman paper (Figure 1E–about 1 min needed).",
    "Place it onto the slicing platform of the McIlwain tissue chopper (see Figure 1–arrow 2–about 1 min needed). With the 5 ml truncated pipette add one drop of dissection medium to prevent the tissue from sticking to the razor blade. Proceed rapidly to the slicing by turning on the apparatus (Figure 1E–30 sec required to slice two hippocampi). Note: All slicing parameters, i.e., thickness (typically between 200 and 500 µm), blade force (usually maximum force) and blade speed (typically one slice per second) should be established in preliminary tests. Remove the Whatman paper from the slicing platform and abundantly add cold dissection media on the tissue.With the lanceolate tip spatula, remove the tissue from the Whatman paper by gently sliding the tip of the spatula between the tissue and the paper.Place the tissue back in Petri dish containing cold dissection medium during the dissection of the cerebellum.In cold dissection medium and under the stereomicroscope, hold the cerebellum using forceps and gently remove meninges using Dumont tweezers #5, the inferior colliculus and brain stem (Figure 1B’).Place the cerebellum on the PTFE plate following a sagittal plan compared to the razor blade (Figure 1C’). Note: The rostro-caudal plane for the slicing process is not critical and the cerebellum can be sliced with the rostral or the caudal part facing the experimenter when placed on the slicing platform. However, in our experiment the caudal part of the cerebellum, as shown in Figure 1A and 1B’, was always facing the experimenter during the slicing procedure. With a P1000 pipette remove the entire medium in order to improve the cerebellum adhesion to the PTFE plate. Proceed to the slicing as described for the hippocampus (Figure 1D’).Table 2. Troubleshooting tableimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113225908_4375.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113230026_0468.jpgFigure 1. Preparation of OBC from suckling rodent brain between P6 to P10.",
    "Hippocampal slice preparation (A-F, left panel). A. Collect the brain after decapitation and separate the cerebellum with a scalpel blade following the dotted line. B. Separate the two hemispheres using a scalpel blade. C. Remove the midbrain to expose the hippocampus area. D. Remove the rostral part of the brain (containing the olfactory bulbs), in order to visualize the hippocampus (black arrow head). E. Put and orientate the dissected brain in the antero-posterior axis onto the slicing platform (2) of a tissue chopper (1) with perpendicular cut plan to the razor blade (3) and cut following dotted line. F. Dissociate and transfer slices to millicell insert culture systems relying on the OBC medium. Cerebellum slice preparation (A, B’-D’, F, right panel). A. Separate the cerebellum from the rest of the brain. B’. Remove the inferior colliculi (IC) and the brain stem (BS) from the cerebellum. C’. Put cerebellum on a Teflon plate according to the antero-posterior axis, and transfer to the slicing platform of the tissue chopper. D’. Cut sagittally following the dotted line. F. Transfer in a Petri dish containing dissection medium, dissociate carefully the slices from each other and plate them on the insert culture systems.Carefully transfer the tissue into a Petri dish containing cold dissection medium. Under the stereomicroscope, separate carefully the hippocampal and/or cerebellum slices using forceps to hold the tissue and a needle mounted on KOLLE needle holder in cold dissection medium. With a good focus, mainly on the top of the tissue, the spaces between slices are easy to visualize which helps to precisely separate them (the slices separation takes 10 to 15 min for the hippocampus and only 5 min for the cerebellum). Note: Ensure the light source of the stereomicroscope is cold (i.e.",
    ", optic fiber) to avoid cell-stress induced by overwarming of the medium during the slice dissociation.Select slices for the culture under the stereomicroscope. Note: The hippocampus should contain the CA (Cornu Ammonis) region and the dentate gyrus. The cerebellum should contain the deep nucleus and the different cellular layer such as the Purkinje Cell (PC) layer or the molecular layer (ML) should be visible. Refer to a brain Atlas for more details such as the Allen Brain Atlas[href=http://www.brain-map.org/]. Plate a maximum of 4 hippocampal or 5 cerebellum slices per Millipore cell culture insert membrane using the 5 ml truncated pipette mounted on a pipette bulb. To favor the appropriate feeding and oxygenation of slices, remove as much dissection medium as possible around each brain explant after plating on the insert and incubate the slices overnight at 37 °C, 5% CO2 in a humidified atmosphere.Culture procedure Notes: Change the medium the day after the slicing procedure, and then every 2-3 days. Refer to the Table 1 for the duration of each step. Hold the edge of the insert from the 6-well plate with tweezers and remove old medium with a P1000 Pipetman. Put the insert back in place in the 6-well plate and add 1 ml of fresh culture medium pre-warmed at 37 °C in the water bath to avoid any thermal shock. Make sure that no air bubble is trapped between the PTFE membrane and the medium. If so, bend the 6-well plate at an angle of ~45° and gently shake it to allow the air bubbles to reach the edge of the culture insert.",
    "Viability of cultured brain explants: Cellular metabolism/mortality assessment–Alamarblue® and propidium iodide stainingNotes: Prior to infection studies, it is extremely important to ensure that the brain explant is healthy ex vivo and determine the best time window during which the slices can be used. Based on our experience, the viability evolution is reproducible if the OBC preparation is kept identical as described in this protocol and can be assessed once for all using three independent batches of slices, for a total of 15 slices analysis per time point. However, we recommend periodically assessing the viability, at least with one of the two proposed approach, in order to make sure that the procedure is still correctly set up. Detach slices from PTFE membrane by flushing culture medium gently on the edge of the explant. Gently transfer the tissue into a 96-well plate using a truncated 5 ml pipette. Note: After lengthy culture time (4 to 7 days), slices might be too adhesive to be detached without damages. The PTFE membrane of the inserts is suitable for fluorescence microscopy and does not affect the observation of the IP staining, the reading of the Alamarblue assay and the confocal analysis (no autofluoresence), hence we recommend using this type of insert to support the OBC slices.  Propidium iodide staining In a 96-well plate, immerse slices in 200 µl of propidium iodide solution at 5 µg/ml in culture medium and incubate the plate for 45 min at 37 °C, 5% CO2 in a humidified atmosphere. Note: Propidium iodide enters into dying cells leading to a red-fluorescent nuclear staining. The surface density of propidium iodide labeled nuclei over the total tissue surface is used to monitor cell death and provides necessary quantification for statistical analysis (see Data analysis section).",
    "Note that there is no need to wash the slices prior to the staining.Remove the propidium iodide solution and wash slices 3 times with 200 µl of 1x DPBS (37 °C).Transfer slices into a 12-well plate and fix them with 1 ml of 4% paraformaldehyde solution (see Recipes) for 30 min at room temperature. Mount gently slices between a slide and coverslip. Make sure to not crush the tissues, especially on thick slice (300 and 500 µm). Acquire images with a widefield fluorescence microscope, at least 6 randomized fields per slice and 5 slices per time point. Use a 5x objective, to acquire large fields of view.Analyze the images in ImageJ with the provided Macro (i.e., script for ImageJ). Run the Macro (click on Plugins>‘OBC IP mortality’) and follow the instructions: first, choose the image to analyze. It will be opened in ImageJ with an enhanced display (see Figure 2). Click on the areas outside the slice (like the region outlined in yellow in Figure 2). If the region is too small or too large, the tolerance of the wand tool can be adjusted: double-click on the wand tool in the ImageJ menu (in the red frame in Figure 2), and adjust the value of the tolerance (which is 200 by default). When the region is correctly outlined, press the T key to save it in the ROI manager. Repeat for all the regions in the image. At the end, the windows should look like Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113231042_3266.jpgFigure 2. Analysis of the propidium iodide staining in ImageJ with the Macro. The windows can be arranged at the user’s convenience. The original image is on the left, its duplicate with an enhanced display on the right. The instructions are at the bottom.",
    "The tolerance of the wand tool can be adjusted by double-clicking in the red square.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113231128_6936.jpgFigure 3. Second step of the propidium iodide staining analysis. The regions are saved in the ROI manager on the right, in the green frame. The user can click on ‘OK’ in the red frame.Click on ‘OK’ (see the red square in Figure 3). The Macro will do an automatic segmentation of the propidium iodide staining (with the ‘Auto Local Threshold’ plugin https://imagej.net/ Auto_Local_Threshold#Bernsen[href=https://imagej.net/ Auto_Local_Threshold#Bernsen]), and measure the area of this staining, and the area of the slice.When the process is finished, the propidium iodide area is displayed as a red overlay on the image and the slice area is surrounded in yellow to visually check the results of the segmentation (see Figure 4). The red overlay can be activated/deactivated by checking/unchecking the Channel 1 box in the ‘Channels’ window (see Figure 4). The numerical results (the propidium iodide area ‘Area’ and the whole slice area ‘Slice area’ in pixels, and their ratio in %) are displayed in a spread sheet which can be saved (for more details see Data analysis section point 3). Several images can be analyzed in batch and the results saved in the same file: close only the previous image and run again the Macro in the same way from step E8. The results will be added at the bottom of the spread sheet.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113231244_6063.jpgFigure 4. Result of the propidium iodide staining analysis. The area of the staining is displayed in red. The area of the slice is outlined in yellow. On the bottom right, the results table can be saved with its menu File>Save As.Alamarblue® In a 96-well white plate, immerse slices in 200 µl of 1x Alamarblue® solution in culture medium.",
    "Incubate the plate for 2 h at 37 °C, 5% CO2 in a humidified atmosphere. Note: The Alamarblue® reagent becomes red proportionally to the cellular metabolism of the slices reflecting the proportion of active cells and thus the global OBC health state. Read the fluorescence emission at 580-610 nm according to the manufacturer’s protocol using a Tecan Infinite® 200 PRO series microplate reader.To analyze metabolic activity, only the animal and slice (random) factors are evaluated. We applied the Kruskal-Wallis tests since the data showed violation of the assumptions of ANOVA. Variation of mortality (Figures 5A and 5C) and metabolic activity (Figures 5B and 5D) across times (D0, D1, and D7) were analyzed using the Kruskal-Wallis test. For each day, the coefficients of variation (the ratio of standard deviation and mean) were compared between mice and hamsters using the Wilcoxon test (for more details see Data analysis section point 3) (Figure 6).Note: Based on our experience, we would not recommend working with OBC when one of these two parameters exceeds or varies more than 20% during the first two days since it may greatly impact the maintenance of the cell population in the slices and their chemokine response and thus the reproducibility of the results.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113232248_8609.jpgFigure 5. Study of mouse and hamster OBC viability over 14 days of culture. A. Mouse or C. hamster (3 animals/group, at least 4 slices of each substructure/animal) hippocampus and cerebellum slice mortality were evaluated by propidium iodide staining and analyzed with an Axioplan Imager fluorescence microscope. B. Mouse or D. hamster (n = 3), at least 3 slices of each substructure/animal) hippocampus and cerebellum slice metabolism activity were assessed by incubation with Alamarblue reagent kit and analyzed using an Infinite 200 PRO Tecan microplate reader.",
    "The graphics show the evolution of cellular metabolism (reflecting health) over the time of the culture.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113232402_9284.jpgFigure 6. Coefficients of variation analysis. Coefficients of Variation (CV) for mortality and metabolic activity were computed at each day, and globally compared between hamster and mice using the Wilcoxon test. There is no difference statistically significant between mice and hamster (P-value = 0.7987).Immunostaining of brain explantsNote: As preliminary test, we recommend to assess the maintenance of the major cell population (Figure 7) as well as the structure preservation during the culture (Figure 8) by immunostaining before starting infection studies to exclude any variation related to the experimenter. Detach, place the slices in 12-well plates using the 5 ml truncated pipette and fix them with PFA at room temperature as described above.Note: In the case of infected slices, the PFA fixation can be performed directly on the culture insert. The culture medium has to be removed, and 1 ml of PFA is added below and above the culture insert in order to completely cover the slices. Proceed to the blocking and permeabilization of tissue with 1 ml of the blocking and permeabilization solution (BPS) (see Recipes) for at least 45 min at room temperature under gentle agitation. Remove the BPS and add the primary antibody (Ab) (i.e., astrocytic marker GFAP, neuronal marker NeuN or CB-28K–microglia marker Iba1 or oligodendrocyte marker Olig-2–see Figure 7) diluted in BPS and incubate for 2 h at room temperature (also possible ON at 4 °C). Notes:  Ensure that the Ab can bind the epitope in the presence of Triton X-100 present in the BPS. If not, remove the Triton X-100 at this step and wash slices 3 times in a solution of 1x DPBS/4% FBS.",
    "By using a 48-well plate, the volume of the staining solution can be as minimal as 150 µl. For example, to highlight the hippocampal and the cerebellum structures, use respectively the neuronal marker NeuN (Figure 8A) or the Purkinje cells marker CB-28K (Figure 8B). The CB-28K decreased staining is mostly due to the Purkinje cells loss and the reorganization of the neurons into the slice. However, the apparent lower staining of the hamster CB-28K at day 7, is due to the acquisition of this image. Indeed, all the left panels of this figure are a tile reconstitution coupled with 100 µm z. Due to the irregular shape of the tissue and the mounting process, it can be difficult to keep a homogenous staining even if the exposure time is identical, since the density of the cells throughout the slice can be different.Remove the Ab and wash 3 times each for 10 min with 1x DPBS. Dilute the secondary Ab in BPS and incubate slices for at least 2 h at room temperature. Repeat the wash step. Mount the slices between slide and coverslip using fluoprep mounting medium.Note: The slices are still quite thick at this step; thus the immunostainings imaging have to be performed using confocal microscopy.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113232621_3427.jpgFigure 7. The major cell types of the brain are present and easily detectable by immunofluorescence. A. The characteristic Purkinje cells (PC) of the cerebellum (GABAergic neurons), have been detected in mouse cerebellum slice with the Calbindin-28k marker at DIV0. The arrow head shows the soma of the PC; the arrow shows the dendritic tree of the PC and Ax designate the regrouping PC axons. B. The mouse hippocampal neurons have been stained at DIV0 using the specific neuron nuclear marker NeuN to reveal the internal organization of the hippocampus. C.",
    "The mouse hippocampal astrocytes have been stained using the specific Glial Fibrillary Astrocyte Protein (GFAP) marker at DIV0. D. The microglia have been stained at DIV7 using the specific marker Iba1 in mouse hippocampus. E. The oligodendrocytes have been stained at DIV5 using the Olig2 specific nuclear marker in mouse hippocampus. CA1: Cornu Ammonis area 1, CA3: Cornu Ammonis area 3, DG: Dentate Gyrus.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113232737_3117.jpgFigure 8. Study of morphological rearrangements and kinetic of mouse or hamster OBC viability over 7 days of culture. A. Hippocampus slices from mice or hamsters were stained with anti-NeuN antibody (neurons marker) at day 0 and day 7 of culture. Pictures show a conserved general organization of the hippocampus over at least 7 days, including the Ammon’s horn (Cornu Ammonis CA) regions and dentate gyrus (DG), which showed only limited loss of cell density (white arrows) possibly related to neuron death. B. Cerebellum slices from mice or hamsters were stained with Calbindin 28K (CB 28K–Purkinje Cells marker) at day 0 and day 7 of culture. Arrows in the pictures show neuronal loss and arrow heads show an interruption of the Purkinje cells layer. Nuclei were counterstained with DAPI. Images taken at the indicated times of culture with a Leica SP5 confocal microscope show morphological evolution within slices at low (reconstructed tile–on left column for each day) or high magnification on right column for each day (20x objective in left panel of each days and 40x objective in right panel of each days corresponding to the white square) over the culture duration.Infection procedure of brain explantsDilute the virus stock in Opti-MEM medium in order to infect cultured slices (in 6-well plates) with a defined number of plaque forming units (pfu). For example, with measles virus (MeV-EGFP) 104 to 4 x 104 pfu are used.",
    "For the mock control slices, apply the same volume of Opti-MEM as for the infection.Note: The dose necessary for the infection should be determined experimentally for each virus/brain structure/animal model combination. Using a P20 pipette, deposit gently 2 to 10 µl of diluted viral stock on the top of the slices, and make sure that the inoculum is distributed homogeneously. Note: A micro-injector (with adequate equipment) can be used at this step if the study requires a single site of entry for virus dissemination studies (Ehrengruber et al., 2002).Incubate plates at 37 °C, 5% CO2 in humidified atmosphere.In case of EGFP expressing virus, the fluorescence resulting of the viral replication can be monitored using a fluorescence microscope (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171113/20171113232947_9469.jpgFigure 9. OBC infection with a recombinant measles virus expressing the EGFP. Rat cerebellum slices have been infected with 2 x 104 pfu of MeV IC323-EGFP the day of the slice preparation (DIV 0). MeV-EGFP fluorescence was observed after 5 days using an inverted fluorescence microscope (ZEISS) and camera (AxioCam, ZEISS) at low (A) or high magnification (B).Monitoring of cellular or viral gene expression by RT-qPCRUsing curved tweezers, take the slice to be analyzed out of the culture insert and place it in lysis buffer RA1-10% 2-mercaptoethanol according to the manufacturer’s recommendations (RNA extraction kit–Macherey Nagel). Between treating each slice, remove RNase with RNase Away solution.Decontaminate tweezers with absolute ethanol. Rinse with RNase free water. Freeze the lysates at -80 °C and then proceed to the RNA isolation using the RNA extraction kit according to Macherey-Nagel recommendations.Prepare cDNA using iScriptTM cDNA Synthesis Kit using a TPersonal 48 Thermal Cycler. Perform the quantitative PCR on targeted cDNA, i.e., viral or cellular, using Platinum® SYBR® Green qPCR SuperMix-UDG w/ROX Kit according to manufacturer’s recommendations and StepOnePlusTM Real-Time PCR System.",
    "All results should be normalized to mRNA from a housekeeping gene such as GAPDH and analyzed as detailed elsewhere (Welsch et al., 2013)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}