{
  "id": 18061,
  "origin_website": "Jove",
  "title": "Quantitative Micro-CT Analysis of Aortopathy in a Mouse Model of β-aminopropionitrile-induced Aortic Aneurysm and Dissection",
  "procedures": [
    "The protocols for animal handling were approved by the Institutional Animal Care and Use Committee of the University of Maryland, Baltimore (animal protocol number 0116024) and conducted according to AAALAC International standards.\n1. Preparation of Reagents\nHeparin\nDilute 250 µL of 1000 U/mL heparin sulfate in 50 mL of phosphate buffered saline to make a final concentration of 5 U/mL.\nWarm the heparinized (5 U/mL) phosphate buffered saline, which will replace the blood in the vasculature in a water bath set to 37 °C.\nPrepare the pressure-controlled pump by connecting the required tubing and 2 empty 10-mL syringes, 1 for the heparinized-saline buffer and 1 for the contrast agent.\nFill the tubing with the warm heparinized phosphate buffered saline and remove the air bubbles from the tubing of the pressure pump.\nContrast agent\n\tNOTE: Please refer to the Table of Materials for the contrast agent kit constituents.\n\t\nMix a pigmented compound with a diluent to achieve a 1:6 dye to diluent ratio.\nImmediately prior to use (step 2.3.12), add 200 µL of a curing agent to each 5-mL aliquot of the diluted pigmented compound and mix them well (4% by volume).\n\t\tNOTE: The manufacturer reported the working time is 40 min. As the silicone-rubber contrast agent begins to polymerize 20 min after the addition of the curing agent, it is important to prepare the solution immediately prior to its infusion.\nBAPN drinking water\nDissolve β-aminopropionitrile (BAPN) in drinking water to create a final concentration of 3 g/L (adapted from protocols previously described in the literature)9,16,17.\nAdminister the BAPN-containing drinking water to a group of mice once they are 4 weeks of age until the time of perfusion for micro-CT.\n2. Surgical Procedure\nAnimal preparation",
    "Wean the mice at 3 weeks of age, maintain them on a 12 h light/12 h dark cycle, and feed them standard rodent chow. For the BAPN-treated group, administer freshly prepared BAPN drinking water for 16 - 26 weeks ad libitum. Provide the control animals with standard drinking water ad libitum.\nAnesthetic technique\n\tNOTE: 24 h prior to the CT analysis, the following procedure is performed. Surgical procedures are enacted to prepare the specimen for a postmortem intracardiac perfusion.\n\t\nInduce an anesthesia via an induction tank with 100% O2 and 3% isoflurane delivered via a precision vaporizer. After the anesthesia induction, discontinue the isoflurane and flush the chamber with O2. Maintain the anesthesia with 2 - 2.5% isoflurane and 1 L/min of O2 via a nose cone.\nAttach both the induction chamber and the facemask to a charcoal scavenger for waste gas adsorption to protect personnel. Ensure an adequate anesthetic plane by demonstrating that there is no response to noxious stimuli (toe pinch).\nPrepare an operative field consisting of a surgical tray and the necessary surgical instruments.\nTransfer the animal to the surgical field and position it in dorsal recumbency.\nOperative technique\nUsing scissors, make a midline incision through the skin and soft tissue from midway between the pubic symphysis to the sternal notch, extending through the skin and soft tissue overlying the sternum.\nUsing scissors, create a hole in the diaphragm at the xiphoid process to enter the thoracic cavity.\nUse scissors to dissect the diaphragm of the ventral chest wall, bilaterally.\nCut through the costal cartilages to separate the ribs from the sternum at the right sternal border.",
    "Apply a fine hemostatic clamp to the tip of the sternum (near the xiphoid process) and move the hemostat cranially so that it is positioned over the head of the mouse. This will retract the thymus and sternum away from the heart, exposing the heart and great vessels for further manipulation.\nSharply dissect any attachments between the heart and the chest wall.\nConnect the 27-gauge IV catheter needle to a syringe pre-loaded with 10 mL of heparinized phosphate buffered saline (5 U/mL) and fill all tubing with the buffer in order to remove the air bubbles from the tubes of the pressure pump.\nUse care while preparing the fluid as bubbles in the fluid line may impede the filling of smaller vessels. Limit the number of vessels that are damaged during the animal preparation, as this will cause the contrast agent to leak out of the severed vessels, changing the volume required for a complete filling and introducing artifacts to the final imaging.\nPuncture the left ventricle with a 27-gauge needle that is stabilized with a right-angle clamp. Immediately incise the right ventricle or the inferior vena cava to drain the heparin solution and blood.\n\t\tNOTE: Heparin is used as an anticoagulant to prevent the blood from clotting in the vessels after the animal's death.\nPerfuse the animal at a constant rate of 2 mL/minute using a single syringe pump. Note the visible blanching of the organs. Continue the perfusion until the perfusate draining from the venous circulation is free of blood (about 5 - 6 mL). Stop the pump.\nDisconnect the IV catheter tubing from the 10-mL syringe, taking care not to disrupt the needle's position in the left ventricle.",
    "Immediately after the complete exsanguination, separate the contrast agent solution into 5-mL aliquots and add the curing agent at this time (see step 1.2). Mix them well. Draw up 5 mL of the contrast agent mix into a 10-mL syringe and perfuse the animal with it.\nFor a complete filling of the vessels (arteries and veins), continue the infusion past the point when it can be seen exiting the venous solution. Look for signs of a successful perfusion including the visualization of a casting agent in the coronary arteries, pulmonary arteries, intestine, and liver vasculature.\nThe contrast agent will cure after approximately 20 min at room temperature. Upon curing, harvest the individual organs, as needed, and fix them in 10% neutral buffered formalin. Fix whole carcasses if the samples are not used for micro-CT scanning the following day. If the carcasses will be used the subsequent day, position them on a metal tray and place them in a refrigerator at 4 °C to cure overnight.\n3. Micro-CT Scanning and Parameters\nNOTE: The specific image acquisition parameters will be dependent upon the machine in use.\nAcquire X-ray computed tomography images of each mouse the day following the perfusion using a micro-CT scanner using an X-ray tube voltage of 55 kVp, a current of 150 μA, a system magnification factor of 2.19, and a CCD camera pixel binning factor of 2. This yields an effective pixel size of 29 µm.\n\t\nLay the mouse carcass supine on the micro-CT scanner table and obtain a scout X-ray scan.\nFocus the detector field of view of 57.4 mm (axial) x 37.1 mm (transaxial) on the torso to image the full length of the aorta.\nAcquire 180 image projections with a rotation increment of 2 degrees and a time per projection of 2800 ms.",
    "Reconstruct the images using a modified Feldkamp algorithm; the reconstructed voxel size is 29 x 29 x 29 µm3 (slice thickness = 29 µm) using the Multimodal 3D Visualization plug-in for the software used here.\n4. Post-processing and Rendering\nConvert the CT data to a DICOM format using the appropriate software.\nAnalyze the images to identify whether an aneurysm was present. Measure the minor axis diameter at the widest point of the aortic arch, descending thoracic aorta, and abdominal aorta as previously described18 (Figure 1).\n\tNOTE: In our study, images were analyzed by two independent observers (one blinded) utilizing a DICOM viewer to identify whether an aneurysm was present. The minor axis diameter was measured at the widest point of the aortic arch, descending thoracic aorta, and abdominal aorta as previously described19 (Figure 1). Mean non-aneurysmal arterial segments of BAPN-untreated mice established normal vessel diameters serving as the age-matched control values.\nAneurysms are defined as a localized or diffuse dilation of the aortic segments to diameters greater than 50% of the reference diameter. Locate these based on the above measurements.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}