{
  "id": 4196,
  "origin_website": "Cell",
  "title": "Sequential staining of HIV gp140 to capture antigen-specific human B cells via flow cytometry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBead assay of pre-conjugated fluorescently labeled gp140 tetramer probes\nTiming: 1.5 h\nThis protocol provides step-by-step instructions on performing a bead assay with gp140 tetrameric probes in order to validate their integrity, quality, and the magnitude of detecting antigen-positive B cells using flow cytometry. These probes can be used to target and characterize B cells expressing B cell receptors (BCRs) specific for HIV gp140. This protocol makes use of polystyrene anti-mouse Ig κ microparticles typically used to optimize fluorescent compensation settings for flow cytometry assays. These beads will bind to any mouse κ light chain. This protocol uses these beads to first capture mouse anti-human antibody before incubating with human antibodies specific for gp140. These beads can then be used to capture fluorescently labeled gp140.\nIn the biological safety cabinet, add 50 μL of Anti-mouse Ig, κ beads to two FACS tubes, one for the positive control (VRC01) and one for the negative control (irrelevant or no mAb linker).\nOptional: Additional positive control tubes using other mAbs (PGT128, 4E10, etc.) can be included to test the probe’s specific reactivity to antibodies that recognize various epitopes. Alternatively, Ramos cells stably transfected to express VRC01 IgM (positive control) or irrelevant antibodies such as anti-influenza or anti-coronavirus antibodies or no antibody (negative control) can be used in place of beads (Benjamin et al., 1982[href=https://www.wicell.org#bib1]; Lingwood et al., 2012[href=https://www.wicell.org#bib3]).\nAdd 4 mL of R10 media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) to the FACS tubes containing beads.\nVigorously vortex (3 s on setting 8−10) the two FACS tubes in R10 media and centrifuge at 300 × g for 5 min at room temperature (20°C–22°C).\nUsing a P1000 pipettor, aspirate the top 3 mL of R10 media from the FACS tubes.\nVigorously vortex the FACS tubes.",
    "Centrifuge the stock of Purified Mouse Anti-human IgG for 1 min at 1,000 × g.\nAdd 1 μg mouse anti-human IgG to all of the positive and negative control FACS tubes. Incubate for 15 min at room temperature.\nCritical: The anti-human IgG antibody used must be a mouse κ antibody to be captured by the Anti-mouse Ig κ beads.\nAdd 4 mL R10 media to FACS tubes containing beads. Vigorously vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nRepeat steps 8 and 9.\nVigorously vortex then centrifuge the stock of VRC01 for 1 min at 1,000 × g.\nAdd 1 μg of VRC01 mAb to the positive control tube. Incubate for 15 min at room temperature.\nOptional: If available, add 1 μg of an irrelevant human mAb to the negative control tube.\nAdd 4 mL R10 media to FACS tubes containing beads. Vigorously vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nRepeat steps 13 and 14.\nAdd 5 μL of tetramer probe mix to all tubes. Incubate for 15 min at 4°C in the dark.\nFill FACS tube with 4 mL R10 media. Vigorously vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nRepeat steps 17 and 18 four more times.\nStore the test and negative control tubes in the dark at 4°C until the beads can be tested on a flow cytometer.",
    "Compare the negative control to the positive control. If the positive control MFI is distinctly above the negative control MFI (Figure 1[href=https://www.wicell.org#fig1]), these probes can be used to isolate probe-specific B cells as previously described (Morris et al., 2011[href=https://www.wicell.org#bib4]). If the probes do not bind to the positive control beads as a distinct population from the negative control (see troubleshooting[href=https://www.wicell.org#troubleshooting]; problem 1[href=https://www.wicell.org#sec6.1]), epitopes may be occluded from BCR binding. Therefore, test the ability of the antigen to be used in the sequential staining method below. If there are high levels of background, positive samples are negligibly positive, or there are few bead events see troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 2[href=https://www.wicell.org#sec6.3], problem 3[href=https://www.wicell.org#sec6.5], or problem 4[href=https://www.wicell.org#sec6.7], respectively.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/956-Fig1.jpg\nFigure 1. Quality control bead assay using pre-conjugated tetramer staining or sequential staining\n(Top) Example of failed gp140 tetramer binding and (bottom) successful use of sequential staining of gp140 in a bead assay. Components for bead assays are listed in the black box. Anti-mouse κ beads are used to capture mouse anti-human IgG. VRC01 is then captured by the mouse anti-human antibody. Beads are then used to test pre-conjugated gp140 tetramer probes (top panel). If the probes do not bind to VRC01 bound beads (red histogram) as a distinct population from unstained negative control beads (blue histogram), sequential staining should be performed using biotinylated gp140 incubated with VRC01 conjugated beads followed by incubation with SA-PE (bottom panel).\nNote: We recommend collecting 20,000 events for all samples tested to ensure an accurate result.\nBead assay of sequentially stained gp140 probes\nTiming: 2 h",
    "This protocol provides step-by-step instructions on performing a sequential staining bead assay with gp140 probes that do not function well as tetrameric probes in the prior method. This assay will validate the ability to use gp140 in a sequential staining technique to capture B cells expressing antigen-specific BCRs. This step can be skipped if the antigen of interest works well as a tetramer\nIn the biological safety cabinet, add 50 μL of anti-mouse κ beads to two FACS tubes, one for the positive control (VRC01) and one for the negative control (irrelevant or no mAb).\nOptional: Additional positive control tubes using other mAbs (PGT128, 4E10, etc.) can be included to test the probe’s specific reactivity to antibodies that recognize various epitopes. Alternatively, Ramos cells stably transfected to express VRC01 IgM (positive control) or irrelevant antibodies/no antibody (negative control) can be used in place of beads (Benjamin et al., 1982[href=https://www.wicell.org#bib1]; Lingwood et al., 2012[href=https://www.wicell.org#bib3]).\nAdd 4 mL of R10 media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) to the FACS tubes containing beads.\nVigorously vortex (3 s on setting 8–10) the FACS tubes in R10 media. Centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate the top 3 mL of R10 media from the FACS tubes.\nVigorously vortex the FACS tubes.\nCentrifuge the stock of mouse anti-human IgG for 1 min at 1,000 × g.\nAdd 1 μg mouse anti-human IgG to all of the positive and negative control FACS tubes. Incubate for 15 min at room temperature.\nFill FACS tubes containing beads with 4 mL R10 media. Vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nRepeat steps 29 and 30.",
    "Vigorously vortex then centrifuge the stock of VRC01 for 1 min at 1,000 × g.\nAdd 1 μg of VRC01 mAb to the positive control tube. Incubate for 15 min at room temperature.\nOptional: If available, add 1 μg of an irrelevant mAb to the negative control tube.\nFill FACS tubes with 4 mL R10 media. Vigorously vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nRepeat steps 34 and 35.\nAdd 100 ng of biotinylated gp140 to each tube. Incubate for 15 min at 4°C.\nFill FACS tubes with 4 mL R10 media. Vigorously vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nAdd 100 μL of 1:125 SA-PE (stock concentration of 1 μg/μL, see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) to all FACS tubes. Incubate for 15 min at 4°C in the dark.\nOptional: A mixture of 1:125 SA-PE and 1:125 SA-APC can be used to select double positive beads to reduce background.\nFill FACS tube with 4 mL R10 media. Vigorously vortex and centrifuge at 300 × g for 5 min at room temperature.\nUsing a P1000 pipettor, aspirate all but 50–100 μL R10 media.\nRepeat steps 41 and 42 four more times.\nStore the test and negative control tubes in the dark at 4°C until the beads can be tested on a flow cytometer.",
    "Compare the negative control to the positive control. If the MFI of the positive control is distinctly above the negative control MFI (Figure 1[href=https://www.wicell.org#fig1]), this method can be used to isolate probe-specific B cells using the sequential staining method below (Townsley et al., 2021[href=https://www.wicell.org#bib5]). If there are high levels of background, positive samples are negligibly positive, or there are few bead events see troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 2[href=https://www.wicell.org#sec6.3], problem 3[href=https://www.wicell.org#sec6.5], or problem 4[href=https://www.wicell.org#sec6.7], respectively. If there are no positive events, see troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 5[href=https://www.wicell.org#sec6.9].\nNote: We recommend collecting 20,000 events for all samples tested to ensure an accurate result.\nSequential staining protocol to characterize or isolate gp140-specific B cells\nTiming: 2.5 h\nThis protocol provides step-by-step instructions using the sequential stain technique with HIV gp140 probes that do not function well as tetramer probes in a B cell flow cytometry panel. This assay can be used to phenotype and isolate B cells expressing BCRs that bind HIV gp140.\nIn the biological safety cabinet, add 9 mL pre-warmed R10 media (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) to a 15 mL conical tube for each vial of up to 10 million PBMCs.\nOptional: If available, include a normal, healthy donor PBMC sample as a control. If desired, cells can be counted using a cell counter such as the Countess Automated Cell Counter according to the manufacturer’s protocol: https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0019566_Countess_3_Auto_Cell_Counter_UG.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0019566_Countess_3_Auto_Cell_Counter_UG.pdf]\nAdd 500 units of Benzonase to each 15 mL conical tube.\nThaw PBMC in a 37°C water bath before transferring into designated 15 mL conical tube. Centrifuge at 300 × g at room temperature for 5 min.\nCritical: The institute’s standard protocols and guidelines should be followed and personal protective equipment used when PBMC from HIV infected donors are used.\nDiscard supernatant into a 10% bleach solution, flick tube to break up cell pellet.",
    "Add 1 mL of R10 media to cell pellet and move the 1 mL cell suspension into a polystyrene FACS tube. Wash the walls of the 15 mL conical tube with up to 2.5 mL R10 media and transfer to same FACS tube.\nVigorously vortex (3 s on setting 8–10) FACS tubes and centrifuge at 300 × g at room temperature for 5 min. Discard supernatant into a 10% bleach solution, flick tube to break up cell pellet, and add 4 mL 1× PBS.\nRepeat step 51 for two additional washes.\nResuspend cells in 100 μL of 1:500 LIVE/DEAD Fixable Aqua Dead Cell Stain (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Incubate for 2–3 min at room temperature in the dark.\nAdd 4 mL FACS wash buffer (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) to neutralize Aqua. Vigorously vortex and centrifuge at 300 × g at room temperature for 5 min.\nDiscard supernatant into a 10% bleach solution, flick tube to break up cell pellet.\nResuspend cells in 100 μL of Fc block (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Incubate for 10 min at room temperature.\nAdd 4 mL FACS wash buffer. Vigorously vortex and centrifuge at 300 × g at room temperature for 5 min.\nDiscard supernatant into a 10% bleach solution, flick tube to break up cell pellet.\nResuspend cells in 100 μL of Antibody Master Mix containing fluorescently labeled antibodies and biotinylated gp140 monomeric protein (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Incubate for 30 min at 4°C in the dark.\nAdd 4 mL FACS wash buffer. Vigorously vortex and centrifuge at 300 × g at room temperature for 5 min.\nDiscard supernatant into a 10% bleach solution, flick tube to break up cell pellet.\nRepeat steps 60 and 61 for two additional washes.",
    "Resuspend cells in 100 μL of 1:125 SA-PE (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Incubate for 30 min at 4°C in the dark.\nOptional: A mixture of 1:125 SA-PE and 1:125 SA-APC can be used to select double positive cells to reduce background.\nAdd 4 mL FACS wash buffer. Vigorously vortex and centrifuge at 300 × g at room temperature for 5 min.\nDiscard supernatant into a 10% bleach solution, flick tube to break up cell pellet.\nRepeat steps 64 and 65 for two additional washes.\nResuspend cells after final wash in 250 μL cold FACS wash buffer or R10 media. Keep cells at 4°C in the dark until cells can be run on a flow cytometer capable of detecting the fluorescently labeled antibodies and the PE labeled tetramer (often measured with a G575 detector). For these purposes, we used a BD Symphony A5 (Liechti and Roederer, 2019[href=https://www.wicell.org#bib2]).\nCells can be sorted into plates for sequencing and analyzed with FlowJo software using Townsley et. al gating strategy (Townsley et al., 2021[href=https://www.wicell.org#bib5]). If included, use healthy B cells to determine the negative population and set positive gates for gp140-reactive B cells (Figure 2[href=https://www.wicell.org#fig2]). If there are few cell events, see troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 4[href=https://www.wicell.org#sec6.7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/956-Fig2.jpg\nFigure 2. Flow cytometry capture of gp140-specific B cell populations\n(A) Gating of CD19+ IgD- B cells to identify background levels of PE positivity from a sample lacking PE probe staining.\n(B and C) Representative gating of sequentially stained PBMC with biotinylated gp140 followed by SA-PE. (B) Lack of gp140-specific CD19+ IgD- B cells from an uninfected donor prior to infection or (C) presence of gp140-specific CD19+ IgD- B cells from the same donor 1 month after HIV infection are shown. The frequency of gp140-specific B cells (red cells) is noted.",
    "Pause point: The stained cells could be kept for 12–24 hours at 4°C before flow cytometer analysis. We recommend fixing the cells with 100 μL of diluted FoxP3 fixation/permeabilization solution from the Foxp3/Transcription Factor Staining Buffer Set according to the manufacturer’s protocol: https://[href=https://www.thermofisher.com/us/en/home/references/protocols/cell-and-tissue-analysis/protocols/staining-intracellular-antigens-flow-cytometry.html]www.thermofisher.com/us/en/home/references/protocols/cell-and-tissue-analysis/protocols/staining-intracellular-antigens-flow-cytometry.html[href=http://www.thermofisher.com/us/en/home/references/protocols/cell-and-tissue-analysis/protocols/staining-intracellular-antigens-flow-cytometry.html] - fixation. Wash cell suspension with 4 mL of FACS wash buffer, centrifuge at 300 × g at room temperature for 5 minutes, and resuspend in 250 μL FACS wash buffer. Keep at 4°C in the dark for up to 24 hours.\nCritical: Prepare all required controls for flow cytometry analysis and run on flow cytometer the same day as PBMC samples. Controls include compensation controls (one for each fluorophore) for proper compensation calculations on the cytometer or in FlowJo. An antibody conjugated to PE can be used as a compensation control for SA-PE stained gp140.\nCritical: Fixed cells cannot be used for sequencing analysis. Run the fresh, unfixed cells for sequencing analysis. Ensure sufficient separation of all populations by viewing the NxN plots of compensated PBMC samples (Figure 3[href=https://www.wicell.org#fig3]). We recommend running additional Fluorescence Minus One (FMO) controls on the panel to ensure good separation of each fluorophore.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/956-Fig3.jpg\nFigure 3. Flow cytometry panel NxN plots\nNxN plots were generated to visually assess the separation of populations for each marker. Data plotted for evaluation was gated on lymphocytes, singlets, and live subsets. Because LIVE/DEAD Fixable Aqua Dead Cell Stain was used for live stain and falls in the same channel as BV510, cells that were BV510+ for markers CD3, CD14, CD16, CD56, CD4, or CD8 were also excluded.",
    "Note: The number of HIV antigen-specific B cells is dependent on sample size, variability from the patient’s contracted virus, time from initial infection, and antiretroviral therapy treatment. We recommend collecting a minimum of 1 milliion PBMC events to ensure accurate results and simultaneously running a bead assay with the cell staining protocol to ensure antigen probe integrity."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Immunology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}