{
  "id": 2110,
  "origin_website": "Cell",
  "title": "Live imaging of postembryonic developmental processes in C. elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of agarose pad and mounting C. elegans\nTiming: 15 min\n10% (w/v) agarose pad is used to immobilize worms for live-cell imaging. High quality agarose pad with stable humidity is the key step for live-cell imaging of C. elegans.\nPrepare 10% (w/v) agarose solution: Boil 2 g agarose in 20 mL M9 buffer in a 50 mL Erlenmeyer flask. Aliquot 5 mL into a 15 mL centrifuge tube, and place the tube on a thermostatic Dry Bath (80°C) to keep the solution as liquid.\nNote: The aliquoted agarose solution in 15 mL centrifuge tube can be stored at 4°C for up to 2 months. When needed, place the tube in a beaker containing water, unscrew the cap of the tube and place it in a microwave oven to heat. Be careful to minimize boiling over to reduce evaporation. Put the tube in the Dry Bath to keep the agarose in the molten state.\nPrepare two glass slides, and paste a layer of paper tape on both sides. Put the two glass slides on the table in parallel, and place a clean glass slide in the middle (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1594-Fig1.jpg\nFigure 1. Prepare 10% (w/v) agarose pad for live-cell imaging\n(A) Glass slide flanked by two slides with a layer of paper tape. Drop the 10% melted agarose on the middle slide and gently place another glass slide across the three slides to make an agarose pad.\n(B) Vaseline and Paraffin are placed in a thermostatic Dry Bath (80°C) to be melted and mixed at a 1:1 volume ratio.\n(C) The gap between the glass slide and the coverslip is sealed with the mixture of Vaseline and Paraffin.",
    "(D) If the gap is not sealed completely as shown by the red arrow, add more mixture to the unclosed area.\n(E and F) Use another glass slide to slowly scrape the protruding white wax until the thickness becomes uniform.\nAdd a drop (50–100 μL) of 10% molten agarose onto the center of the middle slide and immediately place another slide across the three slides, forming an agarose sandwich (Figure 1[href=https://www.wicell.org#fig1]A).\nWait about 1 min for the solidification of the agarose, then remove the top slide by gently sliding. Place the middle slide with the agarose pad in a humidity chamber.\nNote: Although the agarose pads can be kept in a humidity chamber for 1 h, we recommend a freshly made agarose pad. The agarose pads that have been stored for a long time become wrinkled (Wang et al., 2021[href=https://www.wicell.org#bib15]), which affects the image quality.\nPlace 10–20 synchronized larval C. elegans into the 2.5 mM levamisole solution on the pad with a worm picker. Wait a while until the movement of the larvae is not obvious. Put the coverslip on the pad.\nAlternatives: We recommend washing the worms with M9 buffer in 1.5 mL microcentrifuge tube, spinning the tube in a tabletop centrifuge at 1,000 × g for 15 s. Aspirate to 100 μL and add 100 μL 5 mM levamisole. Use a Pasteur pipet to transfer worms (25–50 μL) to the agarose pad and absorb the excess liquid with filter paper. Wait for 30 s and put the coverslip on the pad.",
    "Note: The stages of worms depend on the developmental time window of the dynamic processes you are interested in. For example, we use late L2 larval worms (about 30 h after egg laying) for the live imaging of PVD dendritic growth and early L1 larvae (12–14 h after egg laying) for imaging Q cell migration.\nNote: Transferring worms with a worm picker is simple and quick, but it is easy to cause damage to the larvae. The method of M9 buffer washing down the worms has little damage to the larvae, but the operation is cumbersome and takes a longer time.\nMake a 1:1 mixture of Paraffin: Vaseline. Put the mixture on the edge of coverslip to seal the gap between the coverslip and the slide (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nCritical: After adding the mixture of Paraffin and Vaseline, check the gap between the cover glass. If there is a hole (Figure 1[href=https://www.wicell.org#fig1]D), make sure to fill it. If the solidified Paraffin: Vaseline mixture is too thick, use another glass slide to slowly flatten it until it is slightly higher than the coverslip (Figures 1[href=https://www.wicell.org#fig1]E and 1F).\nImaging Q neuroblast migration using spinning-disk confocal microscopy\nTiming: 8–10 h\nQ cells are born on the left (QL) and right (QR) lateral sides during late embryogenesis. After hatching, both QL and QR neuroblasts need to undergo 3 rounds of asymmetric cell divisions to yield 2 apoptotic cells and 3 neurons. The QL cell produces PQR, PVM and SDQL, whereas the QR cell produces AQR, AVM and SDQR (Middelkoop and Korswagen, 2014[href=https://www.wicell.org#bib9]).",
    "About 4 h after hatching, Q cells complete the initial migration, in which QL migrates a short distance towards the posterior to a position above the V5 seam cell, and QR migrates forward to a position above the V4 seam cell, then Q cells divide into equal-sized daughter cells Q.a and Q.p (Figure 2[href=https://www.wicell.org#fig2]A) and migrate a long distance along the anteroposterior axis. The daughter cells Q.a divide once and Q.p twice to produce 3 descendants. The descendants of QL migrate toward the tail of the worm, whereas QR descendants migrate anteriorly to the head (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1594-Fig2.jpg\nFigure 2. Q neuroblast undergoes migration and division\n(A) The diagram shows the birthplace and migration of Q neuroblast (dorsal/ventral view). Q neuroblasts are born between V4 and V5 within the two later rows of seam cells (V1-V6). The QR cell is located on the right lateral side and migrates anteriorly, while QL cell on the left side migrates posteriorly. About 4 h after hatching, QR initially migrated to position above V4 seam cell and QL migrated to position above V5 seam cell, and then began to the first cell division.\n(B) Images show Q cells (QR and QL) migration and cell division. The marker rdvIs1 labels the plasma membrane and chromosomes by mCherry fused with myristoylation signal and histone (HIS-24) (Ou et al., 2010[href=https://www.wicell.org#bib11]). The time is shown on the top left. Scale bar, 10 μm. See also Methods video S1[href=https://www.wicell.org#mmc1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1594-Fig3.jpg\nFigure 3. Q neuroblast lineage and their descendant’s migration",
    "(A) The schematic overview of Q neuroblast lineage and their descendant’s migration at L1 larval stage. QR and QL neuroblasts undergo symmetric and asymmetric cell division to yield two apoptotic cells (QR/L. aa and QR/L. pp) and three neurons (A/PQR, A/PVM and SDQR/L). QR descendants migrate anteriorly to the head, whereas QL descendants migrate posteriorly to the tail. Color code in the migration of Q neuroblast descendants is the same as in the Q neuroblast lineage.\n(B) Images of Q descendants’ migration visualized by a fluorescent marker rdvIs1 at indicated time points after the cell first division. The dashed line indicates the position of the worm with arrowheads pointing to A (anterior) and P (posterior). The colors of the text and the arrows corresponds those in (A). Scale bar, 20 μm. See also Methods video S1[href=https://www.wicell.org#mmc1].\nPreparation of Microscopy and photography equipment.\nUse Nikon Spinning Disk confocal microscope with an air lens 10×/ 0.5 N.A objective for finding worms and an oil lens 60×/1.4 N.A objective for high-resolution imaging.\nImage with a spinning disk confocal scanner unit CSU-W1 with NIS-Elements AR 5.20.00 and a Photometrics Prime 95B camera. The parameters of CSU-W1 are as follows: 4,000 rpm disk-spin speed, pinhole 50 μm and 561 nm excitation laser wavelengths. We usually use 10% of the full power of the 561 nm laser with 200 ms exposure time.\nNote: Using minimal laser power and exposure time to minimize phototoxicity. Set the room temperature at 20°C–25°C for imaging.\nLive imaging.\nPlace the slide on the inverted fluorescence microscope stage and find worms under air lens 10×/ 0.5 N.A objective, using the automated stage of acquisition software to mark the location of worms.",
    "Use a higher-magnification 60× objective to select healthy L1 larvae and examine the development stage of Q cells. Q cells are born between V4 and V5 seam cells and start to migrate. We choose the stage before the first division and mark its position.\nTo follow Q cell migration, acquire a stack of mCherry images with 18 planes at 1 μm interval every 10 min and automated stages for multiple position acquisition.\nNote: Try to avoid following worms for imaging. The worms appear straight, shrunken or curled after immobilization with levamisole solution. The straight or shrunken worms die quickly, whereas the curled worms tend to live longer, but too much curling up may affect Q cell division and migration.\nNote: Do not select worms that are close to each other to image, as this will affect the imaging quality.\nCritical: Choose the worm with a little curl and only a single worm in the field to image.\nFinding enough worms to image is important for the efficiency of long-term live imaging. We normally choose no more than 5 worms on one slide to image.\nNote: The more worms to image and the longer exposure time result in more phototoxicity. Too many (>5) marked positions may result in out-of-focus problems during imaging.\nFor imaging acquisition: set up acquisition parameters, including the excitation laser wavelengths at 561 nm, 10% power, 200 ms exposure time, Z stack at 1 μm interval and a frame rate of 10 min. Create a new data folder and set parameters for automatically saving the new live-imaging data.\nNote: A longer frame interval and less Z stacks can reduce photodamage, but they may cause a lot of details to be lost.",
    "Note: To studying asymmetric cell division within 1 h duration, we recommend setting the time interval at 30–60 s.\nNote: To examine the cell migration and apoptosis for more than 3 h duration, we set the time interval at 5–10 min. Tracking the development completion of Q cell lineage takes about 10 h. For physiological activity and high-quality images of worms, we recommend a maximum time of no more than 4 h for live imaging.\nImaging PVD dendritic growth using laser scan confocal microscopy\nTiming: 3–4 h\nPVD is derived from V5 cell lineage and is born post embryonically, located on the posterolateral sides of the body with PVDL on the left and PVDR on the right. In the larval stages, the 1° dendrites grow along the anterior and posterior axis, then 2° dendrites grow perpendicular to the 1° dendrites, reaching the axial boundary of the medial edge of body muscle cells. In this position, each 20 dendrite turns horizontally to project 3° dendrite, and each 3° branch eventually adopts a vertical angle, leaving a gap between adjacent menorahs and giving rise to a 4° dendrite. Finally, PVD dendrites forms well-ordered, repeating candlestick-like units at L4 stage (Figure 4[href=https://www.wicell.org#fig4]A). We use laser scan confocal microscopy to collect a Z-stack image of PVD neuron dendritic branches, especially for the growth process of 2°–4° dendrites.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1594-Fig4.jpg\nFigure 4. The development of PVD neurons dendrites\n(A) The cartoon shows that PVD neurons gradually develop a complete dendritic morphology as the process of development (modified from wormatlas.org[href=http://wormatlas.org]). The pattern diagram of the dendritic branch structure of PVD neurons is shown in the bottom right corner. The numbers and red arrows indicate the 1°, 2°, 3°, and 4° dendrites.",
    "(B) The representative images show the dynamic process of PVD neuron dendritic development. The red arrow indicates the process of dendritic growth. Scale bar, 20 μm. See also Methods video S2[href=https://www.wicell.org#mmc1].\nOpen Nikon Microscope Acquisition Software NIS-Elements AR 4.30.02. Place the prepared slide on the stage of inverted fluorescence microscope and find worms under air lens 10×/ 0.5 N.A objective, marking the location of worms.\nNote: For imaging PVD dendritic growth, we mount 10–15 synchronized L2 C. elegans on the agarose pad. Select healthy L2 larvae with proper straight body and without other worms nearby to interfere with.\nExamine the development stage of the PVD dendritic at 20× objective, then switch to a higher-magnification 60× objective.\nSet up image parameters: laser scan confocal PMT (HV 86), 20.4 μm pinhole size, one way scan direction, 2.288× zoom, laser scan speed at 0.25 fps, laser wavelength at 488 nm, 5% laser Power, Z-stack at 0.5 μm, 10 min time interval for 3.5 h duration.\nNote: To follow dendrite branching and self-avoidance in detail, we recommend setting the time interval to 30 s–60 s within 1 h.\nCritical: To minimize phototoxicity, we use minimal laser power and exposure time. If the PVD dendrites stop growing for more than 30 min, find other worms or make a new slide to start a new imaging."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Model Organisms",
    "Developmental Biology",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}