{
  "id": 11701,
  "origin_website": "Jove",
  "title": "Reinstatement of Drug-seeking in Mice Using the Conditioned Place Preference Paradigm",
  "procedures": [
    "All procedures involving mice and their care complied with national, regional, and local laws and regulations, which are in accordance with Directive 2010/63/EU of the European Parliament and the council of September 22, 2010 on the protection of animals used for scientific purposes. The Animal Use and Care Committee of the University of Valencia approved the present protocol.\n1. Materials and Set-up for Conditioned Place Preference:\nHandle mice 3 days prior to testing for 1 - 2 min each. The base of the tail should be grasped. The body should be supported if possible. This is done to minimize pain and distress when handling an animal and to prevent interfering variables, such as stress.\n\tNOTE: OF 1 male mice 60 days old (young adults) weighing 35 - 40 g were employed in the present experiments. Drug-induced reinstatement can be performed in mice of both sexes. However, regarding stress-induced reinstatement, the social defeat paradigm is designed only for male rodents, as females do no induce an aggressive response in the resident mice.\nFor place conditioning, use identical boxes made with two identical compartments (30.7 cm long × 31.5 cm wide × 34.5 cm high) separated by a smaller central grey area (13.8 long × 31.5 cm wide × 34.5 high).\n\tNOTE: Compartments have different floor textures and wall colors (a smooth floor in the black compartment and a rough floor in the white one). Each compartment of the CPP box contains four infrared light beams and six in the central compartment. This allows the recording of the crossings between compartments and the position of the animal.",
    "Set up the room lights (off or lowered) each day. Use red lights (recommended), as animals do not perceive it and it is attenuated for the experimenter (approximately 40 lux measured at 1 m above floor level).\nSet up the program to register 15 min for Pre- and Post- conditioning test (see the Table of Materials for software) (Figure 2)\nPrepare the cocaine solution required for the whole experiment. Dissolve cocaine hydrochloride in 0.9% NaCl (saline) in a volume of 0.1 mL/10 g body weight. Vortex mixture and store at 4 °C at the end of the day.\n\tNOTE: Cocaine concentrations may vary depending on the study's purpose. If the aim is to evaluate the subthreshold doses of cocaine, a 1 mg/kg concentration could be used, which is ineffective in control animals, as seen in previous studies24,35. If an effective dose is the purpose, a 6 mg/kg concentration can be chosen, which is effective but does not induce reinstatement24, or a 25mg/kg concentration, which is effective and induces reinstatement of the preference19.\nTest the animals during their dark phase and use the same box for each animal across days.\nBring animals every day to the testing room in their home cages and leave them undisturbed for 15 min as a habituation period to all the test-related noises.\n2. Test\nAcquisition\n\tNOTE: The procedure of Place Conditioning, unbiased in terms of initial spontaneous preference, consists of three phases: Pre-Conditioning, Conditioning, and Post-Conditioning (Figure 1).\n\t\nPre-Conditioning (Pre-C) (3 days) (Figure 2, Figure 3, Figure 4)\n\t\tNOTE: Here, the neutral value of the compartments in the CPP box is evaluated. Measure the time spent in each compartment and later compare it with that spent in the same compartment in the Post-Conditioning test.",
    "Bring the animals to the test room and leave them habituated for 15 min.\nCheck that guillotines are removed from the cage.\nSet up the computer and the program. Enter animal IDs and press the \"Trial\" and \"Start\" command (Figure 2).\nPlace the mouse gently into the middle chamber (grey compartment) and leave the testing room with minimum noise.\nBring all the animals back into their home cages and save the data when the trial is finished.\nAllow mice to access both compartments of the apparatus for 15 min (900 s) per day on 3 consecutive days.\nOn day 3, write down the time spent in each compartment over a 900 s period, and save it for the assignment of compartments in the next phase (Figure 3).\nAssign half the animals in each group to receive the drug or vehicle in one compartment (e.g., black), and the other half in the other compartment (e.g., white) (Figure 4).\n\t\t\tNOTE: The final distribution of the animals must ensure that half of the animals are assigned to the initially preferred compartment and the other half to the non-preferred compartment. In addition, half of the animals received the drug in one compartment (for example, the black one) and the other half in the other (in this case, the white one).\nBalance scores in the group within both compartments as well as across groups (test group differences with an analysis of variance (ANOVA)). As approximate guidance, values should be around 360 - 370 s in the Pre-C test (Figure 4). NOTE: no significant differences should be detected between the time spent in the drug-paired and vehicle-paired compartments during the Pre-C test.",
    "Exclude animals that exhibit a strong aversion or preference for any compartment.Consider aversion as spending less time than 33% in the compartment, and consider preference when the animal spent more than 67% of the total time in that compartment.\nConditioning (4 days) (Figure 5)\nWeigh the animals and use these weights for cocaine doses during conditioning.\nPrepare syringes with cocaine or saline based on body weights.\nInject one mouse at a time intraperitoneally (ip) and immediately place it gently into the assigned black or white compartment of their box.\nAfter an interval of 4 h, inject the drug dose immediately before the mouse is confined to the drug-paired compartment for 30 min (Figure 5).\nAlternate this procedure each day, beginning with cocaine on days 1 and 3, and saline on days 2 and 4.\nCheck that confinement is carried out in both cases by closing the guillotine door that separates the two compartments, making the central area inaccessible.\n\t\t\tNOTE: In this phase, there is no need to set up the PC program.\nPost-Conditioning (Post-C) (1 day)\nBring the animals to the test room and leave them habituated for 15 min.\nRemove the guillotine door separating the two compartments.\nSet up the computer and the program. Enter animal IDs and press the \"start\" command.\nRecord the time spent by the untreated mice in each compartment during a 900 s observation period.\nWhen the trial is finished, bring all the animals back into their home cages and save the data.\nConsider that the drug has induced place preference if the time spent in the drug-paired compartment during the Post-C is significantly greater than in the Pre-C test. If the opposite occurs, consider an aversion for the drug-paired compartment.\nExtinction",
    "Conduct a weekly extinction session in all groups/animals that developed a preference for the drug-paired compartment.\nPlace the animal in the apparatus (without guillotines) for 15 min (same as the Pre- and Post-C tests) (Figure 1).\n\t\tNOTE: If the dose employed in the CPP is high (25 mg/kg), perform 1 extinction session per week. If a subthreshold dose is used (1 mg/kg), then perform 2 extinction sessions per week (e.g. Monday and Thursday).\nConsider the preference extinguished when data from the extinction test do not show differences with respect to the Pre-C test, but they do show differences with respect to the Post-C test.\nRepeat the test 24 h later in order to confirm the extinction.\nReinstatement of CPP\nPriming-induced reinstatement\nEvaluate the effects of a priming dose of cocaine 24 h after extinction has been confirmed.\n\t\t\tNOTE: Priming doses are half the previous dose that the animal has received during conditioning. The reinstatement test undergoes the same protocol as in Pre-C and Post-C tests, except that animals receive the dose of cocaine in a non-contingent place 15 min before the test. The efficacy of drug priming in inducing reinstatement can be enhanced after repeated extinction/reinstatement experiences23, although the order of the doses seems not to play a role in the results obtained36.\nBring the animals to a different room from the testing room (non-contingent place) (Figure 6).\nInject them with half the previous dose of cocaine (e.g., if animals were conditioned with 25 mg/kg cocaine, a priming dose would be 12.5 mg/kg).\nBring them back to their vivarium for 15 min.\nTake them into the testing room and place the animals in the apparatus immediately (without the guillotine doors separating the compartments) for 15 min (same as the Pre- and Post-C tests).",
    "Consider the difference in seconds between the time spent in the drug-paired compartment during the last Extinction session and the Reinstatement test as a measure of the degree of reinstatement of the preference induced by the drug.\nRepeat the extinction-reinstatement procedure every time with decreasing doses until it is confirmed to be ineffective.\n\t\t\tNOTE: A saline injection control can be used to control the capacity of cocaine priming (and not of injection itself) to induce reinstatement.\nStress-induced reinstatement\nEvaluate the effects of a stress-induced reinstatement 24 h after extinction has been confirmed\n\t\t\tNOTE: Reinstatement tests are the same as those carried out in Post-C (free ambulation for 15 min), except that animals are tested 15 min after the social defeat in an agonistic encounter (Figure 6)\nTake the animals to a different room from the CPP room.\nPlace the experimental mouse with an aggressive opponent sex matched of equal age and body weight in the plastic cage (Figure 6).",
    "NOTE: The agonistic encounter consists of a 10 min test in a neutral transparent plastic cage (23x13.5x13cm) with a defeat result for the experimental mouse. To prepare the aggressive opponent, first isolate different animals that match in age and body weight as the experimental mice for 3 weeks. Train them to acquire fighting experience and test them to have high levels of aggressive territorial behavior. To obtain aggressive conspecifics, mice must be isolated for at least 3 weeks, and then trained in aggressive and attack behaviors. Animals are trained in a neutral environment, facing them in pairs. We let them bite the opponent 2 or 3 times and get them out of the cage, always ending the training before one of the two mice shows submission, so that the experience of the encounter reinforces aggressive behavior. After suffering aggression (threat and attack from the aggressive conspecific), experimental mice should present avoidance/flee and defensive/submissive behavior. The criterion is to adopt a specific posture of defeat, characterized by an upright submissive position, limp forepaws, upwardly angled head, and retracted ears (Figure 6). According to Burke et al., 2016, we consider that the social encounter is terminated earlier if the intruder displays a submissive supine posture for >8 s or if 13 attack bites occurred. Another option to screen animals without risk of significant injury could be to pace the animal in a mesh enclosure with a hole, not large enough for either animal to pass.  Aggression could be detected without subjecting animals to direct aggressive behavior.  If an animal sustains an injury with a wound 1cm in diameter and/or  direct exposure of muscle, it is excluded from the study and should be euthanized.",
    "After 10 min of agonistic encounter, take the mice into the testing room and place the animals in the CPP apparatus immediately (without the guillotine doors separating the compartments) for 15 min (same as the Pre- and Post-C tests).\n3. Statistical Analysis\nNOTE: Ideal sample size should be a minimum of 15 animals per group.\nAnalyze the mean time spent in the drug-paired compartment of the group by means of a mixed ANOVA with one between variable, treatment, with two levels (Control group, Experimental group, example of two groups is in Figure 7c), and one within variable – Days, with 2 levels (Pre-C and Post-C).\n\tNOTE: In the control group, animals receive the drug but have no environmental manipulations. On the other hand, in the experimental group animals are exposed to different environmental conditions. Compare the time spent in the drug-paired compartment on the Post-C day with respect the Pre-C test to see if there are any significant differences in sensitivity to the drug.\nIn addition, perform Bonferroni post-hoc analyses to check either of the significant scores.\nAnalyze data related to extinction and reinstatement values in the groups that developed preference by means of Student´s t-tests to continue with the extinction-reinstatement procedure during the course of the experiment, but at the final moment, analyze them with an ANOVA with a within variable (Days) with the number of levels depending on each group.",
    "NOTE: When the number of comparisons is increased, the number of those that will be significant by chance also increased. As such, to avoid getting false-positives (Type 1 Errors) we 'correct' the p-value thereby making the test more conservative with the Bonferroni correction for multiple t-tests. However, for the reinstatement test, the comparison should be made between the reinstatement test and the last extinction test. Therefore, there is no need for correction.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}