{
  "id": 3618,
  "origin_website": "Cell",
  "title": "Protocol for generation of humanized HCC mouse model and cancer-driver mutations using CRISPR-Cas9",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\n      Adenovirus (Ad:uPA) amplification, purification and titering (needed for\n      in-house-preparation of Ad:uPA) [steps 1–16]:\n    \nTiming: Hands-on time: 3–9 h over\n      3–6 weeks, depends on the initial Ad:uPA stock virus concentration\n    \n      This section describes how to amplify (from low-titer-stock to\n      middle-titer-stock and to high-titer-stock), purify and titrate the\n      Ad:uPA.\n    \n        Infect HEK293A cells with seed stock Ad:uPA virus for amplification of a\n        working stock with higher titer.\n        \nNote: HEK293T cells do not support\n          amplification of Ad:uPA since HEK293T cells do not have E1A and\n          E1B (which support replication of replication defective Adenovirus\n          that lacking E1A and E1B transgenes). HEK293A cells will\n          complement this gene requirement.\n        \n            Seed a T75 flask with 1.7 × 106 HEK293A cells (stable\n            transformant of Adenovirus E1A and E1B) in 4 mL of DMEM 5% FBS and\n            incubate at 37°C overnight. Infect these HEK293A cells with 2 mL of\n            seed Ad:uPA (low titer stock).\n          \n            Remove 2 mL of medium leaving only 2 mL of remaining culture medium\n            (T25 flask).\n            \nNote: Adsorption time is 1 h with\n              tilting every 5 min.\n            \n            Add an additional 2 mL of complete medium and incubate for\n            5–10 days.\n          \n            (Alternatives) Remove the medium from a 60 mm cell culture plate and\n            add 1 mL of viral dilution per 60 mm plate instead of a T25 flask,\n            adsorb virus by gently tilting the dish 3 times in a cross shape,\n            add 1 mL of DMEM 5% FBS and incubate as above. For virus seed stock\n            of 103–105 pfu/mL, use an M.O.I. of 0.01–1.1.\n          \n        Expand serial virus for high titer working stocks.\n        \n            Observe if infected 293A cells are rounded and detached from culture\n            flasks 4–14 days post-infection.\n          \nCollected/pool both cells and supernatants.\n            Freeze and thaw pellets with supernatants inside of flasks three\n            times,\n          \nCollect all cell materials.\n            Centrifuge as above.",
    "Note: This preparation is\n              considered middle-titer stock.\n            \n            Seed approximately five million 293A cells into a fresh T75 flask\n            and culture overnight to reach 70–80% confluency, assuming 7–9\n            million cells for infection.\n          \n            Infect 5 million cells with middle-titer stock (10 mL volume) in a\n            new 5 × 106 cells/T75 flask to amplify middle-titer stock\n            to increase Ad-uPA titer prior to creating a working stock for\n            hepatocyte infection.\n            \nNote: Infection of 2–3 T75s at an\n              MOI of 1 has yielded 2–3 mL of 109 PFU/mL. Aim for 50%\n              confluency in flasks to give the cells room to grow. Plating of\n              5 × 106 cells/T75 yielded <50% confluency the next\n              day. After infection, cells detach.\n            \n            Calculate amount of virus to add. If planing to infect with an MOI\n            of 1, plate 6 × 106 cells, add 6 × 106 PFU\n            Ad:uPA seed stock (no need to be exact for this).\n          \n        Inoculate a new T150 flask with 10 million 293A cells for further\n        expansion of virus stocks. Infect sufficient middle-titer stock\n        preparation for an expected M.O.I of 0.3–0.7 Titer that does not need to\n        be known at this point, but high-titer stock should have sufficient\n        virus that is sufficient to infect almost all cells in flasks at the\n        time of infection) The high titer stock is isolated from this flask.\n        \n            Use this high-titer virus stock for large scale-infection. Inoculate\n            3 mL of high-titer stock of Ad-uPA per T150 flask, containing 107\n            HEK293A cells. Incubate overnight. We typically use 15–20 × T150\n            culture flasks (initially seeded at 40 million cells per T150\n            flask).\n            \nNote: After 4–6 days post\n              infection, high-titer Ad:uPA virus infection will kill 80–90% of\n              293A cells and cause cells to detach from the T150 flasks.\n            \n                If almost all cells are detached after 4–6 days post infection",
    "without reaching 100% confluency, the virus titer was sufficient\n                to infect most of the 293A cells.\n              \n                If cells do not detach from flasks during Ad:uPA infection after\n                6–7 days post-infection, this indicates empirically the titer is\n                not high enough. If this is the case, return to the prior step\n                to re-amplify for high-titer virus stock.\n                \nPause point: At this\n                  point flasks with cell suspensions can be conveniently frozen\n                  and stored at 80°C for later virus isolation by\n                  ultracentrifugation.\n                \n        Isolate virus by collecting infected cells by centrifugation at 1,600\n        g (3,000 rpm) for 20 min in rotor (Cat#A4-44) of #5804 Eppendorf\n        Centrifuge.\n        \n            Use three freeze-and-thaw-cycles of the pelleted cells to release\n            the intracellular Ad:uPA (freeze with liquid nitrogen or dry\n            ice/ethanol bath).\n          \nRepeat freeze-and-thaw steps.\n            Resuspend and sonicate the cell pellets in 20 mL of non-supplemented\n            culture medium.\n          \n            Use 10 cycles of 30 s sonicator bursts followed by cooling 30 s on\n            ice; avoid heating. Clarify the sonicated virus culture suspension\n            by centrifugation at 22,000 g (15,000 rpm) for 15 min in\n            Rotor Cat#A4-44 of Eppendorf Centrifuge #5804.\n          \n        Purify Ad:uPA by discontinuous CsCl gradient centrifugation using an\n        SW28 swinging bucket rotor.\n        \n            Prepare a discontinuous gradient containing 5 mL of 1.4 g/mL CsCl\n            (53 g + 87 mL of 10 mM Tris-HCl pH 7.9) overlayed with 6 mL of CsCl\n            1.2 g/mL (26.8 g + 92 mL of 10 mM Tris-HCl pH 7.9).\n          \n            Use a 10 mL pipette to gently overlay the CsCl solutions. The final\n            purity of the virus will depend on the quality of the gradient.\n          \n            Gently apply 5–8 mL of sonicated virus solution to each centrifuge\n            tube while in a biological safety cabinet. Purify a total of up to\n            20 mL of viral suspension in a single centrifuge run.",
    "If the virus stock is less than 20 mL, use additional 10 mM Tris-HCl\n            pH 7.9 to fully load the centrifuge tubes. This viral suspension\n            should come from less than 109 infected cells, otherwise\n            the gradients will be overloaded.\n          \nNote: Disruption of the CsCl layers by\n      pipetting too quickly will negatively affect purification. The intention\n      is to avoid making a hard pellet at the centrifuge tube bottom. A poorly\n      formed discontinuous CsCl gradient will result in contamination of the\n      intact virus band with penton fragments and defective virions (Figure 2[href=https://www.wicell.org#fig2]). The presence of the defective particles is undesirable since these can\n      cause hepatotoxicity and inflammatory responses after mouse injection.\n    \n        Ensure that the tubes are well balanced before centrifugation.\n        Centrifuge at 100,000 × g (23,000 rpm in SW 28) for 90 min at\n        4°C; allow to decelerate without braking.\n      \n        Carefully remove the tubes from the rotor in a laminar flow hood, then\n        secure one tube with a three-pronged clamp attached to a ring stand.\n      \n        Aspirate most of the upper solution with impurities from the tube by use\n        of a 10 mL pipette.\n        \n            Apply a piece of adhesive tape on the side of the tube where it is\n            to be punctured. This is to prevent leakage in case the tube cracks\n            upon puncturing.\n          \n            Remove the lowest, virus containing band (appears bluish-white with\n            slight opacity) using a 5 mL syringe with an 18G needle by\n            puncturing the tube from the side.\n          \nNote: The density of the viral band\n      solution is about 1.345 g/mL. The area between the defective and\n      infectious viral particle bands may appear turbid, avoid removing this\n      area of turbidity (Figure 2[href=https://www.wicell.org#fig2]).\n    \n        Disconnect the needle from the syringe and transfer the viral suspension\n        to a sterile 15 mL polypropylene tube. Add at least one volume of 1× TE",
    "before proceeding to the next step. This is essential to reduce the CsCl\n        density of the solution below 1.2 g/mL.\n      \n        Slowly load 8–10 mL of the diluted viral suspension, to the top of the\n        gradient. Centrifuge at 100,000 × g (23,000 rpm with SW 28) at\n        4°C for 16–20 h (deceleration rate = 0) (using the same gradient\n        conditions as earlier). After ultracentrifugation, the continuous\n        gradient appears like the step gradient, except that there is no pellet.\n      \n        Harvest the infectious viral band from a bottom tube puncture using a\n        5 mL syringe + 20 Ga needle. The high buoyancy area contains cell debris\n        and is usually clearer (see Figure 2[href=https://www.wicell.org#fig2]), although most\n        of this debris is eliminated during the first gradient step.\n      \n        Virus Desalting and Concentration:\n        \n            Choose a dialysis buffer based on the end-use of the virus and avoid\n            buffers with glycerol if the virus is to be used in animals since\n            these virus suspensions become difficult to inject.\n          \n            Avoid the use of PBS-5% sucrose buffer as that does not stabilize\n            virus and interferes if the virus needs to be further concentrated\n            to more than 5 × 1011 VP/mL.\n          \nNote: Use 10 mM Tris pH 8.0, 2 mM\n      MgCl2, 4% sucrose buffer to avoid virus precipitation and\n      maintain virion stability for concentration to approximately 1 × 1013\n      VP/mL.6[href=https://www.wicell.org#bib5]\n        Dialyze the viral band at 4°C with a cellulose ester membrane\n        (Spectra/Por, Spectrum Lab, 25,000 MWCO) to remove buffer salts, mainly\n        cesium chloride.\n        \n            Dialyze the virus suspension against 200 volumes of the appropriate\n            buffer for 1 h, with three changes.\n            \nNote: There should be no traces of\n              CsCl remaining after three changes of dialysis buffer.\n            \n            Aliquot dialyzed virus suspension into Eppendorf tubes (100, 250 and\n            500 μL) and keep at -80°C for long-term storage; however, storage at",
    "-20°C for short periods of time is acceptable.\n            \nNote: Repeated freeze/thaw cycles\n              will reduce virus infectivity and should be avoided.\n            \nNote: The purity of Ad:uPA is\n              critical since penton base contamination in the final Ad:uPA\n              solution is hepatotoxic and greatly increases the potential for\n              liver damage andinflammation.\n            \n        Plaque Plaque Assay Method: 293A cells are seeded into 96 well plates\n        and infected with serially diluted virus stock to measure virus titers\n        (it will take at least 10–14 days to determine the virus titer).\n        \n            Dilute the virus stock to be assayed in a 12-well plate. Store the\n            plate at −20°C or −80°C for further use. Initially dilute the\n            low-titer viral stock in 1 mL to minimize the amount of virus\n            needed.\n          \n            Perform additional dilutions in a volume of 3 mL; the use of a\n            larger volume increases reproducibility. The number of serial\n            dilutions is a function of the type of virus stock (purified vs.\n            non-purified).\n          \n            Design the dilutions to allow a count of 10–100 particles per test\n            well. Typically, we end at a final dilution of 10−12.\n          \n            Plate with dilutions of 10−7 to 10−12 for\n            plaque testing.\n          \n            Begin dilutions by adding 100 μL of virus stock to 900 μL of DMEM +\n            5% FBS. Pipet up and down 5 times, discard the tip; this is dilution\n            10−1.\n          \n            Pick up 300 μL of the 10−1 viral dilution using a new tip\n            and add it to 2.7 mL of DMEM 5%, pipet up and down 5 times and\n            discard the tip; this is dilution 10−2.\n          \n            Perform serial dilutions using 300 μL of the previous dilution and\n            2.7 mL of DMEM + 5% FBS.\n          \n            Use the last 4 dilutions to infect QBI-293A (or any 293A) cells,\n            always use a fresh tip for each virus addition.",
    "Incubate for 90 min at 37°C in a cell culture incubator with 5%\n        CO2.\n        \n            Aspirate the medium and cover the cell monolayer with prewarmed\n            1.25% agarose mix for titer determination.\n          \nReturn plate to 37°C incubator.\n            Observe the dishes regularly for plaque formation and for the need\n            to add fresh medium.\n          \n            After 21 days, all plaques should be visible to the naked eye as\n            small white spots.\n          \n        Count the number of plaques in the dilution that gives well-isolated\n        plaques. To calculate the plaque forming units per mL (PFU/mL), multiply\n        the count by the dilution factor.\n      \nNote: The anticipated virus yield ranges\n      from 30–40 mL of 2 × 1011 pfu/mL to 2 × 1012 pfu/mL\n      isolated from 20 × 150 cm3 T150 flasks.\n    \nPrimary adult hepatocyte recovery\nTiming: 3–4 h (for steps 17–26)\n    \n      This section describes how to recover primary hepatocytes from frozen\n      samples. These are adult hepatocytes, so that this section may be referred\n      to from a relevant following section.\n    \n        Place the cryogenic vial into a water bath to thaw, but do not\n        completely submerge the vial to avoid bacterial contamination of the\n        sealing area (Thawing of cells should be rapid (<2 min) to minimize\n        viability loss).\n        \n            Gently shake the vial back and forth to achieve even thawing while\n            continuously monitoring the contents.\n          \n            Remove the vial from the water-bath when only a few small ice\n            crystals remain in the vial; spray the vial with 70% alcohol, wipe\n            dry, and proceed to the cell culture hood.\n          \n            Transfer the vial contents to the Recovery Media tube [ISOM’s medium\n            with 10% FBS (BD Biosciences; Corning Gentest CryoHepatocyte\n            One-Step Purification kit)], rinse the vial with Recovery Media and\n            combine the wash.\n          \n            Wash cryopreserved hepatocytes (1.5 mL) in 34.7 mL ISOM’s medium (BD\n            Biosciences; Corning Gentest CryoHepatocyte One-Step Purification\n            kit) containing 11.8 mL Percoll.",
    "Only use low endotoxin Percoll (e.g., Percoll PLUS) and before use\n            centrifuge at 1,300 × g for 1 h at 4°C to remove potential\n            small crystals.\n          \n        Recover cells by centrifugation at 100 g for 10 min (medium\n        acceleration/low brake).\n      \n        Carefully aspirate and discard the entire supernatant containing dead\n        cells and cell debris without disturbing the pellet (care should be\n        taken when aspirating dead cells after centrifugation to avoid\n        contaminating the live cells).\n        \n            Move pipette tip in a circular motion, just touching the surface of\n            the supernatant; this will assist the purification by avoiding\n            aspiration of live cells while aspirating.\n          \n        Add 2 mL/vial of pre-warmed Plating Media with 10% FBS by pouring along\n        the side of the tube, avoid adding the media directly onto the cell\n        pellet.\n      \n        Resuspend the pellet using a gentle rocking motion. Resuspend the cells\n        carefully (do not pipet up and down) in 10 mL ISOM’s medium and\n        centrifuge at 50 ×g for 5 min.\n      \n        Add 5 mL of FBS to the Plating Media tube, prewarm the Recovery Media\n        (DMEM/F-12 hepatocyte culture medium) to 37°C.\n      \n        Resuspend cells carefully in 1 mL of Recovery Media (DMEM/F-12\n        hepatocyte culture medium) and count the cells with trypan blue for\n        viability.\n      \nNote: Viability should be better than 90%.\n    \n        Use a 2 mL pipette to triturate two to three times gently to obtain a\n        homogeneous cell suspension (do not pipet up and down) in 10 mL ISOM’s\n        medium.\n      \n        Centrifuge at 50 × g for 5 min when necessary.\n        \nRecord cell volume, viability, and recovery.\n        Dilute resuspended hepatocytes to 106 cells/mL with 5–10 mL\n        prewarmed PBS medium.\n        \n            (In case other experiments will be performed using plated\n            hepatocytes, proceed with the following steps) Use a repetitive\n            pipettor or multichannel pipet to dispense cells into BD BioCoatTM",
    "Collagen I coated plate (e.g., 400 μL/well of 24-well plate).\n          \n            Move the plate gently in a star pattern on a level surface to\n            distribute the cells evenly over the bottom of the plate after cell\n            plating is completed.\n          \nPlace plates in a 37°C, 5% CO2 incubator.\n            Remove plates from the incubator and gently rock the plates to\n            redistribute the cells evenly in the wells every 20–30 min during\n            the first 2 h of plating.\n          \n            Gently tap the edge of the plate to redistribute the cells since\n            excessive accumulation of cells in the center of the wells can cause\n            cell death in central regions of wells.\n          \n            Gently aspirate the Plating Media after 2–4 h and gently refeed\n            cells with complete Hepatocyte Culture Media (or\n            customized-preferred hepatocyte culture media).\n          \n            Keep plates in the incubator overnight for further experiments as\n            required.\n          \nDual humanization protocol of breeder FRG mice\nTiming: two months (for steps 27–33)\n    \n      This following section describes the dual humanization protocol of breeder\n      FRG mice.\n    \n        Co-transplant LPC and human hematopoietic stem cells into female and\n        male FRG or FRGN (FRG mice in NOD/Scid background)\n        breeders.7[href=https://www.wicell.org#bib6]\n            Transplant all breeder animals as weanlings (∼ 4–7 weeks of age) by\n            intrahepatic or intra-splenic injection of one million cells from\n            strain-matched immune proficient adult donor animals (C57/BL6\n            or NOD/ShiLtJ, Jackson Laboratories) or nucleated human liver\n            cells of human adult primary hepatocytes to avoid the complications\n            of immune deficiency during breeding.\n            \nNote: All fetal and adult animal\n              procedures should be approved by the local IACUC.\n            \n            The reconstituted immune systems have 35–60% chimerism and are not\n            stably maintained in some mice depending on the quality of adult\n            human primary hepatocytes7[href=https://www.wicell.org#bib6] or mouse\n            primary hepatocytes.\n          \n            Place the transplanted animals into breeding cages at six weeks of\n            age.7[href=https://www.wicell.org#bib6]\nPre-conditioning\nTiming: 2 days (for steps 28–33)",
    "This section describes how to pre-condition the FRG mice prior to stem\n      cell injections to improve stem cell engraftments in these recipient\n      animals. This is done for both breeders and experimental neonates.\n    \n        Day -1: Dilute Ad:uPA7[href=https://www.wicell.org#bib6] to 1.25 × 109\n        pfu/100 μL in sterile 0.9% saline or PBS (-) and filter using an\n        Acrodisc Syringe filter (0.45 μm HT Tuffryn membrane).\n        \nNote: For example, to make a\n          suspension of 5 × 109 pfu/mL from 1.5 × 1011\n          pfu/mL virus stock, we add 50 μL stock to 15 of mL sterile 0.9%\n          saline).\n        \n            Precondition neonates with SPX/TMP antibiotics and plasminogen\n            activator urokinase-expressing adenovirus (Ad:uPA).\n          \n            Inject Ad:uPA (5 × 109 pfu/mouse) via the retro-orbital\n            vein under isoflurane anesthesia.\n          \n            Inject 200 μL (1 × 108 pfu/20 g mouse) of diluted Ad:uPA\n            with a BD Ultra-Fine II Short Needle Insulin Syringe - 31G 3/10cc\n            5/16\" (BD Medical Systems: Cat #328438).\n            Examples of virus dosages used for injection.\n            \n19-g mouse: 190 μL (0.95 × 108 pfu).\n20-g mouse: 200 μL (1 × 108 pfu).\n21-g mouse: 210 μL (1.05 × 108 pfu).\n24-g mouse: 240 μL (1.2 × 108 pfu).\nX-ra irradiate mice with 150 cGy X-ray.\n        At Day 0, intrahepatically inject human hematopoietic stem cells into\n        adult FRG mice (See Humanization of FRG breeders). See step 33 for\n        preparation of human fetal liver tissue prior to transplantation.\n      \n        Maintain mice with NTBC in drinking water for adult FRG breeder female\n        mice surgically transplanted with adult human primary hepatocytes by\n        splenic or intrahepatic injection. House mice in a pathogen-free\n        facility in microisolator cages.\n      \n        Isolate human adult hepatocytes on day of liver cell transplantation.\n        \n            Isolate human adult hepatocytes from an excess donor organ that was\n            used for liver transplantation. The details of the isolation method\n            are described here.5[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8],9[href=https://www.wicell.org#bib9]\n            Transfer the pelleted hepatocytes into cold University of Wisconsin",
    "solution (Viaspan).\n          \n            Co-transplant human hepatocytes purchased from BioreclamationIVT\n            (catalog #F00995) with isolated bone-marrow-derived cells.7[href=https://www.wicell.org#bib6]\n            Use fresh human fetal liver of healthy full-term newborns obtained\n            commercially. After density gradient centrifugation, E-cadherin+\n            LPCs and non-parenchymal cells, including CD34+ cells are injected.\n          \n            Use optimized media and procedures to fully recover cell viability\n            and maximize and metabolic profiles.\n          \n            Thaw Cryopreserved human hepatocytes and remove the cryopreservation\n            solution by centrifugation at 100×g for 5 min at 4°C.\n          \nResuspend cell pellets in HCM media.\n            Re-centrifuge at 100 × g for 5 min at 4°C and resuspended in\n            HCM at 107 cells/mL.\n          \n            Resuspend hepatocytes and dilute at 1:1 ratio in 0.4% trypan blue\n            and the cell number and determine viability using a hemocytometer.\n          \nThaw cryopreserved human bone marrow CD34+ cells.\n            Remove cryopreservation solution by centrifugation at 500 × g\n            for 10 min at 4°C followed by resuspension in HCM.\n          \n            Dilute the resuspended CD34+ HSC at 1:1 ratio in 0.4% trypan blue\n            and the viable cell number determined.\n          \nCentrifuge by density gradient at 2 h post irradiation\n            Resuspend CD34+ cells in sterile 0.9% saline (use 5 × 105\n            in 25–50 μL for transplantation.\n          \n            Determine cell numbers and viability by Trypan blue exclusion in a\n            hemocytometer.\n          \nNote: Immediately transplant immediately\n      the received hepatocytes upon receipt, ideally within 24–48 h after\n      isolation.\n    \n        Inject intrahepatically the adenoviral vector expressing the secreted\n        form of human urokinase (uPA)10[href=https://www.wicell.org#bib10] in adult\n        8–12-week-old FRG mice.\n      \n        Anesthetize the mice for cell injections using isoflurane anethesia. Mix\n        the hepatocytes and CD34+ cell suspensions at a 1:1 volume ratio and\n        inject 500,000 hepatocytes and 200,000 bone marrow CD34+ cells into each\n        mouse.\n        \n            Draw 20 μL containing 500,000 human hepatic progenitor cells and\n            20,000 bone marrow cells into a 1 cc syringe fitted with a 27 G\n            needle.\n            \nNote: The needle should be",
    "inserted a few millimeters inside the liver taking care not back\n              the needle out of the organ. As the liver is a\n            \n            Inject slowly the hepatocytes into the liver to prevent it from\n            bursting. The organ will swell, leave the needle in for a few\n            seconds to equalize the pressure and then slowly remove it. Apply\n            the hemostat absorbable knit to stop the bleeding.\n            \n                Insert the needle a few millimeters inside the liver taking care\n                not back the needle out of the organ.\n              \n                Inject the cells with great care to prevent rupture of the organ\n                as the liver is a delicate organ.\n                \nNote: To achieve this, the\n                  syringe should be of high quality with a smoothly moving\n                  plunger.\n                \n            Gently remove the needle. Apply hemostat absorbale cotton applicater\n            to stop any breeding.\n            \nNote: A small amount of bleeding\n              can occur after the needle is removed and can be blotted with\n              sterile gauze.\n            \nPlace the mouse back in its cage.\n            Check each mouse after 30 min to see if recovery is proceeding after\n            transplantation.\n          \n            Administer NTBC through drinking water for breeding cages, although\n            published accounts report that within 1 month of birth, pups will\n            survive without NTBC.\n            \nNote: For maintenance of humanized\n              mice after one month, NTBC is required for viability.\n            \n            Provide NTBC in drinking water to maintain adult FRG mice receiving\n            human hematopoietic xenografts.\n            \nNote: These mice grow well and are\n              fully fertile if they are continuously maintained on NTBC.\n            \n            House these mice in a specific-pathogen-free facility using\n            microisolator cages.\n          \n            Do not co-house FRG neonates with the father to prevent cannibalism\n            of the neonates after transplantation.\n          \n            House the mother with the neonates after the transplantation\n            procedure.\n            \nNote: If the mother senses that\n              something is wrong with her neonates, the mother may cannibalize",
    "her neonates to provide more time for the neonates to recover.\n            \n                Remove any residual blood droplets in the injection area by\n                careful swabbing with water and dry with sterile gauze to avoid\n                cannibalism.\n              \n            Day 7: Feed mice with irradiated food and maintained on acidified,\n            autoclaved water with or without sulfamethoxazole-trimethoprim\n            (SMX/TMP) (7.8 mL of SMX/TMP per 250 mL of drinking water) on\n            alternate weeks after weaning (typically 3 weeks post-partum) for\n            the duration of the animals' lifetimes and housed ≤5 humanized\n            animals per cage.\n          \n            Decrease NTBC cyclically for the pups after transplantation and\n            completely withdraw NTBC to allow engraftment and growth of human\n            hepatocytes (the schedule of withdrawal of NTBC is outlined in\n            Table 2[href=https://www.wicell.org#tbl2]).\n            table:files/protocols_protocol_3183_7.csv\nNote: FRG mice grow well and are\n              fully fertile if they are continuously provided NTBC in drinking\n              water. Maintain breeding pairs on NTBC drinking water their entire\n              lives. Note that after the first month NTBC dosing is required for\n              newborn survival (See Table 2[href=https://www.wicell.org#tbl2]).4[href=https://www.wicell.org#bib4]\nCritical: Failure to maintain\n              mice under aseptic conditions at all times will result in lower\n              organ reconstitution and/or will increase opportunistic\n              infections.\n            \nNote: As the in utero dose\n              is lower than the actual serum concentration, a higher\n              concentration of NTBC is required for neonate liver reconstitution\n              for both males and females. To avoid nursing failure, humanization\n              of parental FRG mice is critical to avoid liver failure of\n              mothers during the nursing period of neonates between day 0 to\n              three-four weeks of age or before weaning.\n            \nNote: Diet hydrogel is an option\n              for hydration, but without NTBC, dietary tyrosine will result in\n              liver toxicity and damage. Neonatal pups are monitored for\n              vitality, consequently pups that are not thriving may not survive\n              the transplantation procedure and should be euthanized.\n            \n      Breeding humanized FRG mice for neonate production and pre-conditioning",
    "Timing: 21–40 days (for steps 34–35)\n    \n      This following section describes breeding humanized FRG mice for neonate\n      production and pre-conditioning.\n    \n        Crossbreed nursing female FRG mice with humanized\n        FRG males to generate FRG neonates 8–12 weeks post liver\n        cell transplantation.\n      \n        Examine females daily in the early morning after breeding for the\n        presence of a vaginal plug (Plug-check) (preferably before 8:00 am or at\n        the latest 9:00 am accounting for nocturnal rodent behavior).\n      \nNote: Failure to examine early in the day\n      may result in an absent plug due to it falling out. Plug checks are needed\n      to estimate day of conception and to predict the FRG neonate birthdate\n      (normally twenty days after plug formation). The expected birth date is\n      used for experimental planning to prepare reagents and pre-order human\n      fetal livers or the isolated cells.\n    \n      CRISPR/Cas9-medated gene knockout and /or knock-in of human fetal LPCs\n      transplanted into neonate livers\n    \nTiming: 3–5 h (for steps 36–41)\n    \n        Isolate fetal liver-derived hepatocytes (Pre-Electroporation).\n        \nNote: Transfecting unstimulated cells\n          will generally result in lower transfection and editing efficiencies.\n        \n            Remove red blood cells by use of red blood cell lysis buffer to\n            negatively select cells.\n          \n            Prepare 5 × 107 fetal liver-derived hepatocytes\n            (low-speed precipitated cells or E-Cadherin+ cells by use of\n            magnetic beads for anti-E-Cadherin Magnetic MicroBeads: Milteny) and\n            wash in sterile 0.9% saline (alternatively 1× PBS buffer).\n          \nUse cell Isolation Kit as per manufacturer’s protocol.\n        Setup equipment for electroporation\n        \nNote: Wear gloves and use\n          nuclease-free tubes and reagents to avoid RNase contamination.\n        \n            Always maintain aseptic technique and use sterile, filtered pipette\n            tips.\n          \n            Store all Synthego reagents according to the manufacturer’s\n            recommendations.\n          \n            Dissolve synthetic sgRNA in TE buffer and dilute to a working\n            concentration using nuclease-free water. Refer to\n            Synthego.com/resources\n          \n            RNP complexes are stable at 25°C for up to 1 h (may be stored at 4°C",
    "for up to one week, or at −20°C for up to 1 month). Note that RNPs\n            stored at 4°C may become susceptible to contamination from microbial\n            growth after long periods of time.\n            \nNote: Suggested Controls\n            \n                Mock: No Cas9 or sgRNA: Wild type sequence for comparison with\n                experimental and other negative controls. Controls for toxicity\n                from RNP, cell death from electroporation, or possible viability\n                issues associated with editing the specific gene of interest.\n              \n                Negative control: Cas9 complexed with a non-targeting sgRNA\n                (this is the same as scrambled sgRNA) or no sgRNA: This ensures\n                that there are no false positives due to contamination (no\n                effect expected = wild type).\n              \n                Positive control: Use sgRNA that has validated high editing\n                efficiency. This ensures that all reagents, protocol, and\n                equipment are functioning properly.\n              \n        Assemble RNP Complexes (2.5:1 sgRNA to Cas9 ratio).\n        \n            Prepare 50 μM sgRNA in 1× Tris-EDTA and store at −80°C until use.\n            Prepare 20 μM Cas9.\n          \n            Mix RNPs as per the volumes given below for a single reaction (scale\n            up appropriately as needed). Note: a ratio of 1:1 sgRNA: Cas9 may\n            also be used.\n            RNP Components, concentration and volumes.\n            \nsgRNA: 50 μM (pmol/μL): 1 μL (50 pmol).\nCas9: 20 μM (pmol/μL): 1 μlL (20 pmol).\nTotal volume: 2 μL.\nIncubate at 25°C for 10 min.\n        Count cells.\n        \nGently resuspend the cells.\n            Count suspended cells using a hemocytometer or automated cell\n            counter.\n          \n            Alternatively cells can be incubated for 2–24 h after bead removal\n            by use of Milteny Magnetic MicroBead kit protocol, before\n            transfection.\n          \nWash in 1× Neon buffer T (electroporation buffer).\n            Resuspend cells at a concentration of at least 3 × 107\n            cells/mL in Neon Buffer T.\n          \n        Transfect cells.\n        \n            Add 10 μL of cells (3 × 107 cells/mL) in Buffer T to each\n            RNP sample and mix thoroughly.",
    "Electroporate the cell-RNP mixture using Neon® Transfection System\n            at the following settings: 1400 V, 10 ms, 3 pulses. Go to step 63\n            for intrahepatic injection of cells into FRG neonates.\n          \nNote: Work quickly and carefully to avoid\n      leaving cells in Neon Buffer T for longer than 15 min. Avoid bubble\n      formation.\n    \n        Determine editing efficiency from a portion of the electroporated cells\n        for confirmation purposes.\n        \n            Analyze by PCR, Sanger sequencing, and/or inference of CRISPR Edits\n            (ICE) analysis.\n          \n            Visit synthego.com/resources for a Genotyping protocol (primer\n            design, DNA extraction, and PCR) to prepare DNA for Sanger\n            sequencing, and a protocol on how to run and interpret an ICE\n            analysis.\n          \n            Conduct next-Generation Sequencing, FACS, Western blot, or\n            functional assays.\n          \n            Extract DNA from the electroporated cells that have not been used\n            for transplantation (Following protocol step 42 is for validation\n            purposes only.\n          \nNote: These cells should not be used for\n      transplantation into FRG mice because long-term-culturing of fetal liver\n      cells greatly decreases engraftment efficiency).\n    \nMouse humanization with liver and non-parenchymal cells\n[Timing: 2–3 days; Hands-on Time: 3–4 h; steps: 42–45] depending on\n      numbers of animals to transplant, 5–10 min per mouse (4 injections),\n      10–20 min for LPC+ non-parenchymal cell injections, 8–12 weeks for\n      in vivo humanized liver and immune system reconstitution.\n    \n      This section describes humanization of liver and immune systems of\n      FRG neonates.\n    \n(Steps 45–42).\n        Day -1: Inject Adenoviral vector expressing uPA (Ad:uPA) (i.p.: 100μL in\n        PBS) between days 0–5; 24 h before irradiation for FRG mice.\n            Place one pup on the Petri dish with cotton or on the foil in the\n            ice bucket and let the animal cool for about 1 min.\n          \n            Place newborn FRG pups on a gauze pad in a petri dish for\n            irradiation and subsequent injection.\n            \nCritical: This is for light\n              anesthesia.",
    "Place the pups on a 100-mm2 petri dish along with a small\n            amount of bedding material from the breeder cage on a warming pad or\n            under an incandescent lamp for 1–2 min to tranquilize neonates.\n          \n            Prepare an ice bucket wrapped with autoclaved aluminum foil in the\n            cell culture hood.\n            \nCritical: Be careful when\n              handling the foil so that the side the pups are in contact with is\n              not contaminated by unsterilized surfaces.\n            \n            Set up the warming light in the hood and put a cage lid covered with\n            sterile paper towels under a warming pad (Figure 3[href=https://www.wicell.org#fig3], Left).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3183-Fig3.jpg\n                  Figure 3. Neonates are put on ice to reduce mobility and\n                  grabbed by hand to inject fetal liver-derived cells with\n                  CRISPR/Cas9-based gene manipulation by use of Hamilton needles\n                \n                  Hamilton needle is stubbed from left shoulder area into livers\n                  of FRG neonates (1–5 days of age). Gloves are worn. Created\n                  with\n                  www.biorender.com[href=http://www.biorender.com]\n                  (Agreement number: AB258UZ6K5).\n                \nCritical: This is for mouse\n              recovery after cold anesthesia and injection.\n            \n                Rub the bedding in gloved fingers with gloves to erase rubber\n                smell of rubber gloves.\n              \n                Put a clean cage, as well as the cage the pups are in, in the\n                hood; separate the mother from the pups, move the pups to the\n                clean cage and move the mother back to the housing rack.\n              \n                Place one pup on the foil in the ice bucket and let the animal\n                cool for about 1 min.\n                \nCritical: This is for\n                  light anesthesia.\n                \n            Restrain the pup by placing your index finger between its front legs\n            (slightly cranially to where you would expect the collarbone to be)\n            and your thumb between its hind legs and applying gentle pressure\n            down and outward (just enough to pull the skin a little tight\n            without injuring the animal) (Figure 3[href=https://www.wicell.org#fig3], see the\n            second from the far left).",
    "Begin by vertically positioning the needle to the left of the\n                right lobe and angled toward the right lobe.\n              \n                Push the needle in halfway and deposit the cells into the right\n                lobe at the rate of 2 s per injection volume.\n                \nNote: The liver should be\n                  visible as a dark area located cranially to the stomach; it\n                  should be the largest organ in young pups.\n                \n                Identify the stomach by a white color on the animal’s heart\n                side.∖\n              \nRelease the pressure immediately with your fingers.\n                Remove the needle, being careful to avoid contact with your\n                finger (Figure 3[href=https://www.wicell.org#fig3]).\n              \n            Keep neonates warm and quickly finish procedures in order to return\n            neonates to the mother to avoid possible rejections since different\n            temperature and smells of the neonates may cause rejection by their\n            mother.\n          \n            Clean the Hamilton (705SN30/51MM/12″ 25 μL) Syringe with Ethanol and\n            PBS 3 times each before reuse (Figure 3[href=https://www.wicell.org#fig3], Right).\n            \n                First flush engraftment syringe with 70% ethanol three times.\n              \n                Flush PBS three times (Note: Avoid use of bleach solution)\n              \n        Day 0: Place the newborn FRG pups on a gauze pad in a petri dish for\n        irradiation 24 h after injection of adenoviral vector. Tranquilize\n        neonates by laying neonates in Petri dish with gauze placed on ice for\n        5–10 min.\n      \n        Irradiate newborn mice over a 3–4 h-interval with a total dose 150 cGy\n        using a 2 mm filter (field size 10 cm × 10 cm) from an X-ray source at a\n        dose that is titrated to be sub-lethal.\n      \nNote: A total of 150 cGy is used. If FRG\n      neonates in your vivarium facility cannot tolerate a single 150 cGy dose,\n      two separate 75 cGy irradiation fractions can be given (75 cGy in the\n      morning followed by the second 75 cGy dose in the afternoon).",
    "Keep the field size at 10 cm × 10 cm for the irradiation.\n      Liver digestion and intrahepatic injection of human LPC\n      (CRISPR/Cas9-medated gene manipulated) and non-parenchymal cells\n    \nTiming: 4–5 h; Duration: 6–7 h (for\n      steps: 46–48; Hands-on)\n    \n      This section describes liver digestion and CRISP/Cas9-mediated genetic\n      manipulation of hepatocytes.\n    \n        Fresh human fetal cadaverous liver can be sourced commercially from\n        healthy second trimester fetuses (Advanced Bioscience Resources, Inc.)\n        or obtained from your institution.\n      \n        Obtain IRB approval for human fetal liver transplantation if your\n        institution is providing human fetal liver tissues.\n      \n        Collect human fetal livers into 50 mL tubes with 10 mL of Hypothermosol\n        (Stem Cell Technology, INC) to preserve the viability and make better\n        recovery.\n        \nCritical: To mimic stepwise\n          carcinogenesis steps through cancer initiation and promotion phases,\n          genetic manipulations by use of CRISPR/Cas9-mediated knockout of\n          ARID1A and/or constitutively active (c.a.) CTNNB1 are knocked-in LPCs\n          and intrahepatically injected into FRG neonates and humanized livers\n          and immune systems.\n        \n            Place 24- to 48-h post-neonatal pups from a single litter into a\n            100-mm2 petri dish along with a small amount of bedding material\n            from the breeder cage.\n          \n            Place the next neonate on ice during the first pup injection is\n            taken place (the actual injection step takes only several seconds,\n            and the other pup can be cooled down by the time you are finished\n            with the first one).\n          \n            Digest to isolate liver progenitor cells (LPCs) and non-parenchymal\n            cells.\n          \n            Centrifuge the digested cells at 50 × g during 5 min.\n            \nCritical: Don’t keep pups away\n              too long from the mother.\n            \nPick up the bedding often.\nLocte at the milk spot of neonates.\n            Changes gloves before you touch different parent-derived neonates to\n            avoid cannibalism due to smells from different litters or smell of\n            nylon gloves and to avoid attaching different smells from other",
    "group of mother and neonates. Watch if mother accept neonates for\n            breast feeding first few days.\n          \n            Restrain the pup by placing your index finger between its front legs\n            (slightly cranially to where you would expect the collarbone to be)\n            and your thumb between its hind legs and applying gentle pressure\n            down and outward (just enough to pull the skin a little tight\n            without injuring the neonates).\n          \n            Inject non-parenchymal cells, including CD34+ cells (3 × 104 CD34+\n            cells) and CRISPR-Cas9-transfected hepatic progenitor cells (3 × 104\n            E-cadherin+ cells).\n          \n            Return the neonates to respective mothers and observe if mother\n            accept neonates for breast feeding first few days.\n          \n      Digestion of human fetal livers for intrahepatic injection of human LPC,\n      non-parenchymal cells with human hematopoietic stem cells\n    \nTiming: 12 h (for steps 49–61; Hands-on\n      Time: 3–4 h) (Figure 2[href=https://www.wicell.org#fig2])\n    \n      This section describes liver digestion of human fetal livers and\n      intrahepatic injection of human LPC, non-parenchymal cells with human\n      hematopoietic stem cells.\n    \nWarm up the wash buffer in a 37°C water bath.\n        Add 2.5 μL of DNase at 5 mg mL−1 (Roche, cat. no.\n        10104159001) for every 50 mL of liver digestion medium (Gibco, cat. no.\n        17703). Prepare 100 mL per liver to be digested (Catalog number:\n        17703034, Thermofisher Scientific).\n      \n        Freshly prepare the Wash Buffer using complete IMDM with 2.5 μL of DNase\n        (Catalog number: 17703034, Thermo-Fisher Scientific) added per 50 mL.\n      \n        Insert cannula and inject digestion solution into fetal liver tissues.\n        Pour a single 15- to 18-week gestation period human fetal liver into a\n        10-cm dish; use scalpels to separate the connective tissue from the\n        parenchyma.\n      \nCritical: Human tissues and isolated\n      cells are aseptically handled in a biological safety cabinet (class II).\n      Special precautions are required for HBV-associated HCC due to high\n      transmission ability by needle puncture incidences.",
    "Discard the connective tissue and mince the parenchymal tissue into\n        small pieces (1–2 mm3) with scalpels or sterile razor blades.\n      \n        Transfer the minced tissue to a 50-mL tube with a 25-mL pipette; wash\n        the dish with 10 mL of liver digestion solution.\n      \n        Fill the tube with liver digestion solution to a 40 mL total volume and\n        wrap the tube cap with Parafilm to avoid leakages and contamination. If\n        available, use sealed buckets to prevent contamination during\n        centrifugation.\n      \n        Refill tube with liver digestion solution, decant the tubes, tap tubes\n        for 6–8 times, incubate the tube in the 37°C water bath for 30 min and\n        decant the tube several times every 5 min.\n      \n        Allow the larger pieces to settle to the bottom; remove the supernatant\n        portion and filter it through a 70μm filter (Corning, Inc.: 352350:\n        08-771-2) collect filtrate into a new 50-mL tube; place the new tube on\n        ice.\n      \n        Add 35 mL of liver digestion medium (Gibco, cat. no. 17703) to the tube\n        (from step 76) containing the larger pieces of liver tissue and repeat\n        steps 8 and 9.\n      \n        Centrifuge the two tubes with liver cells at 252g for 10 min at\n        4°C.\n      \n        Decant the supernatant, resuspend the cells with 40 mL of wash buffer\n        and combine the tubes into one 50-mL tube.\n      \n        If viability is less than 60%, delay transplantation. Go to step 62 or\n        66 for constitutely active CTNNB1 CRISPR/Cas9 knockin procedures (Step\n        62) and/or ARID1A gRNA (Steps 66-68) electroporation into cells.\n      \nConstitutively active (ca) CTNNB1 knock-in procedures\nTiming: 7-12 days (for step 62)\n    \n      This section describes how to introduce c.a.CTNNB1 in the human\n      stem cell genome by use of CRISP/Cas9-mediated donor DNA insertion\n      techniques.\n    \n      This section describes procedures for constitutively active (ca)\n      CTNNB1 knock-in.\n    \n        Synthesize donor DNA and left gRNA and right gRNA.\n        \nβ-Catenin ssDNA",
    "The reference human CTNNB1 exon 3 amino acid sequence that is\n            frequently mutated to create a stabilized β-CATENIN:\n            >EMBOSS_001_1:\n            DLMELDMAMEPDRKAAVSHWQQQSYLDSGIHSGATTTAPSLSGKGNPEEEDVDTSQVLYEWEQGFS.\n          \n            Human c.a.CTNNB1 Donor DNA sense sequence CTNNB1 exon 3 mRNA\n            nucleotide positions 1–200:\n            CTGATTTGATGGAGTTGGACATGGCCATGGAACCAGACAGAAAAGCGGCTGTTAGTCACTGGCAGCAACAGTCTTACCTGGACGCTGGAATCCATGCTGGTGCCACTGCCACAGCTCCTGCTCTGAGTGGTAAAGGCAATCCTGAGGAAGAGGATGTGGATACCTCCCAAGTCCTGTATGAGTGGGAACAGGGATTTTCT\n            (Note: The underlined Gs are base substitutions to convert\n            artificial mutation sequences that substitute Serine or Threonine\n            residues to Alanine to make the non-phosphorylatable, stable\n            mutant of β-Catenin to stabilize β-CATENIN, which results in\n            constitutively-active β-CATENIN).\n          \n            β-CATENIN AA: 1–90: 1 matqadlmel dmamepdrka avshwqqqsy ldSgihSgat\n            tTapSlsgkg npeeedvdts qvlyeweqgf sqsftqeqva gknidgqyamc.a.CTNNB1 AA:\n            1–90: 1 matqadlmel dmamepdrka avshwqqqsy ldAgihAgat tAapAlsgkg\n            npeeedvdts qvlyeweqgf sqsftqeqva gknidgqyam\n          \nLeft sg-CTNNB1: AATACTGTTTCGTATTTATA\nRight sg-CTNNB1: AGTCCTTCACTCAAGAACAA\n      CRISPR Editing Human fetal LPCs with RNPs using Neon Electroporation\n    \nTiming: 3 h (for steps 63–66)\n    \n      This protocol describes how to deliver by electroporation of stimulated\n      human primary LPCs with ribonucleoprotein (RNP) complexes that consist of\n      purified Cas9 nuclease duplexed with chemically modified synthetic single\n      guide RNA (sgRNA).\n    \n        Mix gRNA and the annealed donor DNA (Human c.a.CTNNB1 Donor DNA\n        sense sequence CTNNB1 exon 3 mRNA nucleotide positions 1-200) with\n        recombinant Cas9 proteins.\n      \n        Incubate solution at 25°C for 15 min to make RNA-Cas9 protein complexes\n        (RNP).\n      \n        Electroplate RNA complexes into target LPCs. Accomplish RNP delivery\n        using the Thermo Fisher Neon™ Transfection System.\n      \n        Incubate the electroplated cells in a 37°C incubator with 20% CO2\n        concentration.\n        \n            Electroporate RNP complexes into these LPCs (Refer to steps 81-step\n            85),\n          \n            Intrahepatically inject these electroporated cells into\n            FRG neonates (1–5 days of age) (Refer to steps 75-83).\n          \n            Keep neonates with nursing mother FRG mice in the same cages.\n            \nNote: In case of extensive cell\n              death after electroporation, Ficoll-pack-based live cell isolation\n              will be performed. To avoid extensive cell deaths, the optimal\n              cell concentration (1 million cells per 200 μL) is required to\n              avoid the extensive cell death.\n            \nNote: If the RNP complex formation",
    "is not properly formed, the knock-in or knockout efficiency will\n              be reduced. To avoid a false positive or unsuccessful knock-in or\n              knockout, after electroporation, a small fraction of cells should\n              be cultured to test the knock-in and/or knockout efficiency. These\n              control follow-up experiments will exclude false-positive\n              electroporation and serve as a good quality control step.\n            \n            Place NTBC-containing water bottles continuously until completely\n            removed after seven days eventual decrease of NTBC concentration.\n          \n            Install NTBC-containing water bottles in mouse cages and use the\n            schedule in Table 2[href=https://www.wicell.org#tbl2] for water and NTBC changes.\n          \n            Add antibiotics to NTBC-containing water bottles for avoidance of\n            bacterial infection in immunocompromised FRG mice.\n            \nCritical: Once human immune\n              systems are reconstituted after 8–12 weeks post electroporation of\n              hematopoietic cell-containing non-parenchymal cells, these FRG\n              mice acquire relatively normal immune systems. Feeding antibiotics\n              to completely humanized FRG mice at this point is optional.\n            \n            Eight weeks after stem cell intrahepatic injection, begin feeding\n            FRG mice with alcohol Western diet for six months to accelerate HCC\n            development by synergistic interactions between cancer driver\n            mutations and environmental factors i.e., alcohol Western diet\n            feeding.\n          \n      ARID1A knockout CRISP/Cas9 by use of sg-RNA electroporation and cell\n      injection into humanized FRG mice\n    \nTiming: 2–4 h (for steps: 67–71)\n    \n      This section describes how to disrupt ARID1A in human liver progenitor\n      cells by use of two gRNAs, donor DNA and recombinant Cas9 proteins via\n      gRNA electroporation and cell injection into humanized FRG mice.\n    \n        Rehydrate the Multi-guide ARID1A sgRNA.\n        \nCritical: Synthego's\n          multi-guide ARID1A sgRNA ships dry at ambient temperature and remains\n          stable for several weeks at 25°C. Dried ARID1A sgRNA may be stored at\n          -20°C for long-term storage (up to 3 years).\n        \nCritical: Be sure to work in an\n          RNase-free environment by use of RNAse-free water (DEPC-treated DW:\n          treat water with 0.1% of diethyl pyrocarbonate at 37°C overnight in",
    "cell culture incubator): DEPC-treated DW is further autodclaved) and\n          frequent use of 70% ethanol to wipe out the surfaces of gloved hands,\n          pipetters and filter tips.\n        \nNote: The quantity of material present\n          is measured by UV absorbance spectroscopy at a wavelength of 260 nm\n          prior to dehydration.\n        \n            Briefly centrifuge the tube containing dried multi-guide sgRNA to\n            ensure the pellet is collected at the bottom.\n          \n            Reconstitute gRNA in diluent. Rehydrate 1.5 nmol multi-guide ARID1A\n            sgRNA (1–3 sgRNAs/tube) in 15 μL nuclease-free buffer (1× TE buffer:\n            10 mM Tris-HCl, 1 mM EDTA, pH 8.0) and pulse vortex for 30 s to\n            ensure complete mixing.\n            \n                The final concentration of the sgRNA is 100 μM (100 pmol/μL).\n                The sgRNA combines crRNA+TracRNA.\n                \nCritical: For\n                  microinjection: It is critical to only hydrate and dilute\n                  sgRNA in a nuclease-free 1× microinjection buffer (e.g., 10 mM\n                  Tris-HCl, 0.1 mM EDTA, pH 8.0).\n                \n            Store rehydrated ARID1A sgRNA at -20°C. Under these conditions, the\n            ARID1A sgRNA is stable for up to 3 years, if not repeatedly thawed.\n          \n        Dilute the Multi-guide ARID1A sgRNA.\n        \n            Depending on the application, use 1 × TE buffer or nuclease-free\n            water to dilute the multi-guide ARID1A sgRNA to a working stock in a\n            sterile microcentrifuge tube.\n            \n                Synthego’s nucleofection protocol requires a concentration of\n                30 μM multi-guide sgRNA (see Example Dilution below).\n              \n                For Synthego’s lipofection protocol, a working concentration of\n                3 μM is needed.\n              \n                The term “sgRNA” is used for crRNA+TracRNA. Conditions to\n                produce sgRNA after annealing crRNA and tracRNA are included by\n                the vendor.\n              \n            Example mixture: Add 6 μL of 100 μM multi-guide ARID1A sgRNA to\n            14 μL of nuclease-free water to make a total volume of 20 μL of\n            30 μM multi-guide sgRNA (30 pmol/μL). The term “sgRNA” is used for\n            crRNA+TracRNA. Conditions to get sgRNA after annealing crRNA and\n            tracRNA is included.",
    "Use the diluted multi-guide ARID1A sgRNA or store at -20°C for up to\n            3 months (or 6 months if not repeatedly thawed).\n          \n        Transfect cells by use of either Synthego’s nucleofection or lipofection\n        reagent with this kit and the Gene Knockout Kit v2. All protocols are\n        available at Synthego.com/resources.\n      \nNote: The positive control multi-guide\n      ARID1A sgRNA provided in this kit is sufficient for about eight\n      transfections when using Synthego's nucleofection protocol and about\n      384 transfections when using Synthego's lipofection protocol.\n    \n        Analyze knockout efficiency to quantitatively assess Synthego’s\n        Inference of CRISPR Edits (ICE) using Sanger sequencing data. The\n        software compares the sequence traces of amplicons generated from\n        genomic DNA isolated from both the edited and unedited pools of cells.\n      \n        Transfect CRISPR/gRNA complexes into cells.\n        \nNote: The efficiency with which\n          mammalian cells are transfected with gRNA varies according to cell\n          viability and human subjects and the transfection reagent used.\n        \n            Use up to 2 μg TrueCut Cas9 Protein v2 and 400 ng gRNA per well in\n            24-well format.\n          \n            Expect the highest editing efficiency with a 1:1 M ratio of gRNA to\n            TrueCut Cas9 Protein v2.\n          \n            Add recombinant Cas9 proteins and mix with gRNA solutions. Incubate\n            at 25°C to make RNA-Cas9 protein complex (RNP).\n          \n            Use 30–70% confluent cell cultures on the day of transfection when\n            using lipid-mediated delivery or 70–90% confluence for\n            electroporation using the Neon Transfection System.\n            \nNote: The highest editing\n              efficiency is expected at a 1:1 molar ratio of gRNA to TrueCut\n              Cas9 Protein v2. We use up to 2 μg TrueCut Cas9 Protein v2 and\n              400 ng gRNA per well in a 24-well format. Add recombinant Cas9\n              proteins and mix with gRNA solutions. Incubate at 25°C to make\n              RNA-Cas9 protein complex (RNP).\n            \nNote: Cells recover two days after\n              electroporation. If electroporation is performed in low cells",
    "concentrations, the potential for cell death becomes more obvious.\n              To avoid excessive cell deaths of electroporated human fetal\n              liver-derived cells, use optimal concentrations of RNA-Cas9\n              protein with high of cell concentration in the electroporation\n              cuvettes. These precautions will ensure good cell viability with\n              optimum cell metabolic activities.\n            \nNote: For an overview of the\n              factors that influence transfection efficiency, refer to the\n              “Transfection Basics” chapter of the Gibco Cell Culture Basic\n              Handbook, available at thermofisher.com/cell culture basics.\n            \n            Use the TrueGuide Positive Controls (for example, human AVVS1, CDK4,\n            HPRT1, or mouse Rosa 26, that are commercially available from\n            Synthego, INC.) and negative control gRNA (non-coding) to determine\n            gRNA amount and transfection conditions that give the optimal gene\n            editing efficiency with highest cell viability.\n          \n            Include the TrueGuide Positive and Negative sgRNA and crRNA Controls\n            that are available separately from Thermo Fisher Scientific. For\n            more information, refer to thermofisher.com/trueguide.\n          \n            The cell number and other recommendations provided in the following\n            procedures are starting point guidelines based on the cell types we\n            have tested.\n          \n            Prepare a master mix of components to minimize pipetting error for\n            multiple wells, then dispense the appropriate volumes into each\n            reaction well.\n          \n            Prepare extra volume to account for any pipetting variations when\n            making a master mix for replicate wells.\n            \nTrueCut Cas9 Protein v2/gRNA (ng/pmoles): 80 ng/pmoles.\n                Number of cells/10-μL reaction (×103):\n                1500×103/10-μL reaction.\n              \n                Neon electroporation conditions: 1200 V/30 ms/1 pulse (#7).\n              \n            Collect up to half of the electroporated/transfected cells to\n            isolate genomic DNA for only confirmation purpose. The remainder of\n            the electroporated cells will be intrahepatically transplanted after\n            4 days post electroporation.\n            \nNote: Cells need at least two days\n              recovery after electroporation. If electroporation is performed at\n              low cell concentration, the potential for cell death increases. To\n              avoid excessive cell deaths of human fetal liver-derived cells,",
    "use the proper concentration of electroporated sgRNA-Cas9 protein,\n              and a higher cell concentration in the electroporation cuvettes.\n            \n      Characterization of edited clones for confirmation purposes\n      in vitro\nTiming: 5–6 h (for steps: 72–74)\n    \n      The transduced cells used for characterization are not used for neonate\n      injection since extended culturing decreases engraftment efficiency due to\n      the possibility of differentiation effects\n    \n      This section describes characterization of edited clones for confirmation\n      purposes in an in vitro system.\n    \n        Analyze single cell clones for purity and for desired genotypes\n        (homozygous or heterozygous alleles). Methods that can be used include\n        genotyping PCR, qPCR, next-generation sequencing, or western blotting.\n        Grow single clones in complete media and incubate for 6–10 days before\n        splitting into two plates (one for DNA isolation, followed by\n        exome-Sequencing to determine the knockout efficiency of ARID1A targeted\n        loci).\n      \n        Verify the gene editing efficiency of the control target and select the\n        condition that shows the highest level of editing efficiency for future\n        screening experiments before proceeding with downstream applications.\n        \n            Use the GeneArt Genomic Cleavage Detection Kit or perform Ion\n            Torrent next generation sequencing or a Sanger sequencing–based\n            analysis.\n          \n            Electroporate RNP complexes into cells by Neon electroporation\n            systems and incubate in cell culture incubator at 37°C.\n          \n            Design and order target-specific primer sets for the GCD assay\n            through SYNTHEGO’s GeneArt CRISPR Search and Design tool, available\n            at thermofisher.com/crisprdesign.\n          \n            To perform the GCD assay for the positive control, design the\n            primers for target specific primer sets for the GCD assay by use of\n            Invitrogen Custom DNA Value or Standard Oligos, available from\n            Thermofisher.com/oligos.\n          \n            Use primers listed in\n            key resources table[href=https://www.wicell.org#key-resources-table] (KRT).\n          \n            Set up the GCD assay in a 96-well plate format and analyze multiple\n            gRNA-treated samples in parallel on a 2% E-Gel 48 agarose gel\n            (48-well).\n          \n            Pick the clones that show the highest cleavage efficiency to use in",
    "your experiments. Note that the clone that shows the highest\n            cleavage efficiency may not always be the clone with the highest\n            expression.\n          \n            See the GeneArt Genomic Cleavage Detection Kit User Guide for more\n            information and detailed protocols.\n          \n            Estimate the CRISPR-Cas9-mediated editing efficiency in a pooled\n            cell population.\n          \nNote: While the genomic cleavage detection\n      (GCD) assay provides a rapid method for evaluating the efficiency of indel\n      formation following an editing experiment, next-generation sequencing\n      (NGS) of the amplicons from the edited population or Sanger sequencing of\n      amplicons cloned into plasmids give a more accurate estimate of the\n      percent editing efficiency and indel types.\n    \n        Analyze sequence by use of one of three options (a) Sanger sequencing,\n        (b) bar-coded next-generation sequencing (NGS), or (c) deep sequencing\n        of CRISPR modified ARID1A loci.\n        \n            For Sanger sequencing-based editing efficiency analysis, refer to\n            Thermofisher’s application note referenced at\n            thermofisher.com/sangercrispr.\n            \n                Perform PCR amplification of targeted CTNNB1 genetic loci\n                to amplify exon 3 region of CTNNB1 to examine whether\n                c.a.CTNNB1 exon 3 sequences are knocked in by\n                plasmid-based sequencing (Figure 4[href=https://www.wicell.org#fig4]).\n                \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3183-Fig4.jpg\n                      Figure 4. Constitutively active (ca)\n                      CTNNB1 knock-in strategy\n                    \nCTNNB1 genomic coding loci and donor DNA, Left and\n                      Right sg-CTNNB1 binding sites are shown in the\n                      designated genomic loci.\n                    \n                      Human fetal LPCs are co-injected with two modified pX330\n                      plasmids carrying sgRNAs targeting CTNNB1 (termed\n                      sg-CTNNB1) and a 200-nucleotide ssDNA\n                      oligonucleotide containing four\n                      hot-spot-non-synonymous-mutations (Ser33, Ser37, Thr41,\n                      Ser45) in HCC patients that harbors serine/threonine\n                      substitution to alanine (Bottom) that abolish\n                      phosphorylation and to stabilize β-CATENIN.\n                    \n                Perform limited dilution to obtain single cell clones in 96 well\n                plates to isolate single cell clones.\n              \n                Incubate cells at 37°C for 6–10 days to allow single cell growth\n                before splitting cells into duplicate plates (one is for DNA\n                isolation and DNA sequencing and the other is for expansion and",
    "storage or used for experiments. Flanking regions of CRISPR/Cas9\n                targeted loci are designed for sequencing primer designs.\n              \n                Amplify these flanking region-bound primers for\n                ARID1A CRISPR/Cas9 targeted genetic loci to validate the\n                gene mutagenesis. In alternative methods, the isolated genomic\n                DNA is subjected to exome-sequencing to determine the proporion\n                of CRISPR/Cas9-targeted ARID1A loci.\n              \n                Compare gene sequence between wild type mock-transfected cells\n                vs. gene knock-in clones after sequence results are determined.\n              \n                Expand the positive colonies for in vitro experimental\n                purpose into three to four T75 culture flasks for cryogenic\n                storage in cell storage media (final concentration of 10% DMSO,\n                40% of FBS mixed with 50% of cell culture suspension). These can\n                be used once knock-in sequences are confirmed\n              \n            Barcoded next-generation sequencing (NGS): Use barcoded\n            target-specific amplicon primers and perform multiplex analysis\n            using several gRNA-treated samples in parallel.\n            \nNote: If you are experienced in\n              next-generation sequencing (NGS) and analysis. Multiplex analysis\n              using NGS is especially useful when using the custom arrayed plate\n              format for TrueGuide Synthetic gRNA transfections. For more\n              information on NGS analysis, refer to Ion Torrent targeted\n              sequencing solutions at thermofisher.com/ionapliseqsolutions.\n            \n            Deep sequencing of CRISPR modified ARID1A loci.\n            \n                PCR amplify the genomic region of ARID1A using Herculase II\n                high-fidelity polymerase and gel purify. Libraries are made from\n                50 ng of the PCR products using the Nextera protocol and\n                sequenced on the Illumina MiSeq (150 bp, paired-end reads) or\n                the HiSeq2500 (100 bp, paired-end reads) instruments.\n              \n                Process data according to standard Illumina sequencing analysis\n                procedures. Briefly, reads are mapped to the PCR amplicons as\n                reference sequences using Burrows–Wheeler Aligner with custom\n                scripts.\n              \n                Map reads to the PCR amplicons as reference sequences using\n                Burrows-Wheeler Aligner with custom scripts.\n                \nNote: Insertions and deletions\n                  are crosschecked against reference using VarScan2. Indel phase\n                  is calculated as the length of insertions or deletions\n                  modulus.",
    "Calculate the rate of β-Catenin donor integration as a donor\n                allele frequency.\n              \n                Insertions and deletions are crosschecked against reference\n                genome using VarScan2. Indel phase is calculated as the length\n                of insertions or deletions modulus.\n                Sequence two to five biological replicates for\n                in vivo liver samples. One DNA sample is sequenced for\n                ARID1A in human hepatic progenitor cells and for ARID1A\n                off-target sites in sg-ARID1A-treated liver.\n              \n                Calculate the indel frequency within 10-nucleotide regions (20\n                nucleotides total) flanking ARID1A target site to compare\n                the editing efficiency at ARID1A off-target sites.\n              \n            Perform plasmid-based sequencing or next-generation sequencing to\n            examine the knockout efficiency for ARID1A knockout.\n          \n            Perform limited dilution of electroporated cells to obtain single\n            cell isolates in 96 well plates for expansion of knockout cell\n            clones.\n          \n            Once several knockout clones are identified, freeze a portion ofof\n            ongoing cultured clones in cryostat tubes for future recovery. The\n            remaining half of cells are used for experiments.\n          \n            Prepare cryogenic storage by 1:1 dilution of cell suspension in\n            complete media: 20% DMSO in 80% of FBS solution (Final concentration\n            of DMSO 10% and 40% of FBS and 50% of cell suspension).\n          \n            Freeze cryogenic tubes at -80°C for 2 h before transfer to and\n            liquidfreezer.\n          \n            Sequence the genomic DNA for ARID1A orβ-catenin mutagenesis to\n            validate CRISPR/Cas9 gene editing.\n          \n            Once several clones have been identified with the expected mutations\n            (e.g., ARID1A), test if ARID1A protein levels were changed as per\n            Western blot analyses of expanded single clones using anti-human\n            ARID1A antibody.\n            \nNote: As human and mouse ARID1A\n              sequences are very similar, extra care is needed to obtain the\n              appropriate antibodies for human ARID1A protein detection. Several\n              anti-ARID1A protein antibodies Human-specific Anti-ARID1A antibody\n              [(EPR13501), ABCAM, cat. No. ab182560] are only human specific,\n              but do not detect mouse ARID1A thus are ideal to distinguish",
    "between humanized ARID1A protein levels vs. endogenous mouse\n              ARID1A protein levels.\n            \n      Transdermal human fetal liver cell intrahepatic transplantation\n    \nTiming: 2 h; steps: 75–83\n    \n      This section describes transdermal human fetal liver cell intrahepatic\n      transplantation.\n    \n        Irradiate 1- to 5-d-old newborn FRG mice in Petri dishes on gauze\n        with a single dose of 150 cGy using an X-ray irradiator. Please refer tp\n        omstructions for intrajepatic injection as described above.\n        \n            Place FRG neonates from a single litter into an X-ray irradiation\n            chamber along with a small amount of bedding material from the\n            breeder cage. Please refer to SOP for intrahepatic injection as\n            above.\n          \n            Place FRG neonate mice on a warming pad or under an incandescent\n            lamp for 1–2 min post-irradiation.\n          \n            Restrain the pups by grabbing mice with hands for intrahepatic\n            injection into a FRG neonates.\n          \n            Place FRG neonates in the X-ray irradiation chamber in a petri dish\n            for irradiation and subsequent injection.\n          \nPlease refer to SOP for intrahepatic injection.\nCritical: Mice less than 1–2 day of\n      age have lower survivability and mice older than 5 days of age are\n      difficult to transplant because it is difficult to see the liver through\n      the skin.\n    \n        Electroporate LPCs with CRISPR/Cas9 RNP complexes and left gRNA, right\n        gRNA with donor DNA for c.a.CTNNB1.\n      \n        Day 1: At 2 h post irradiation, place the pups on a warming pad or under\n        an incandescent lamp for 1–2 min. Anesthetize mice with isoflurane\n        before receiving cell injections.\n      \nTake the digested cells to the vivarium.\n        After irradiation, place post-natal pups from a single litter onto a\n        100-mm2 petri dish along with a small amount of bedding\n        material from the breeder cage (field size 10 cm × 10 cm).\n        \n            Place the neonates on ice to cool them to induce anesthesia prior to\n            intrahepatic injection.\n            \nNote: Since the actual injection",
    "step takes only several seconds, stage neonates sequentially for\n              transplantation to minimize the overall time needed for the\n              procedure.\n            \n            For injection, restrain the pup by placing the index finger between\n            the front legs (slightly cranially to where you would expect the\n            collarbone to be) with the thumb between its hind legs with\n            application of gentle downward pressure in a posterior direction to\n            pull the abdomen skintight for injection. Take care to avoid injury\n            to the neonates. Inject intrahepatically with a 25–50-μL volume of\n            LPCs (3 × 104 E-cadherin+ cells) and non-parenchymal cells\n            (supernatant from low-speed centrifugation).\n          \n            Allow neonates to recover after injections by putting on heat pad\n            and put them back to mother’s cages.\n          \nTake extra care with the NTBC cycling.\n            Weigh frequently the FRG mice (3 times per week) during the first\n            FRG transplantations to prevent animal morbidity.\n            \nNote: If mouse weights drop more\n              than 20% these mice will receive an NTBC treatment in drinking\n              water bottles. The above-described NTBC cycling protocol can be\n              adjusted based on your experience using this weight-based\n              protocol, since experimental conditions may vary between labs\n              including the proliferative capacity of hepatocytes obtained from\n              different donor sources.\n            \n        Remove the first pup and place the next on ice (the actual injection\n        step takes only a few seconds, and the other pup can be cooled down by\n        the time you are finished with the first one). Two to three days of age\n        pups are safe for injection.\n        \n            Clean the Hamilton (705SN30/51MM/12″ 25 μL) Syringe with Ethanol and\n            PBS 3 times each (Figure 3[href=https://www.wicell.org#fig3], Right).\n            \n                First flush engraftment syringe with 70% ethanol three times.\n              \n                Flush PBS three times (Note: Avoid use of bleach solution)\n              \n            Take 25–50 μL of cells (500,000 cells: 0.5 million cells) (better\n            for injection than 50 μL). Make sure no bubble in syringes.",
    "Draw 50 μL containing 500,000 human hepatocytes into a\n            Hamilton (705SN30/51MM/12″ 25 μL) Syringe.\n          \nSpray the hands with 70% ethanol.\nGrab neonates to open up abdomen area nicely and tightly.\n            Rub the abdominal skin surface of the mouse with 70%\n            ethanol-containing cotton.\n          \nPull back arms.\n            Remove bubbles inside syringe. (Needle should be ready before\n            grabbing neonates).\n          \n            Identify two milk spots. The liver is above the milk spots on the\n            left side.\n          \n            Stretch the mouse’s skin and slowly insert the needle through the\n            skin into the liver.\n          \n            Inject very slowly.\n            \nNote: If the liver is perforated,\n              the food coloring is visible in the peritoneal cavity.\n            \n            Insert the needle with bevel up between ribs and skin (Inject needle\n            from above the rim bone: collarbone, the clavicle) in right hand\n            side of neonates).\n            \nInsert subcutaneously needle for 10 mm.\n                If you pass rib cage, bend the needle to inject the edge of\n                needle into liver (to stab the liver) under the lib cage.\n              \nInsert needle.\n                Target the edge of needle just right-hand side of belly button.\n                If you insert needle in belly button area, you will damage\n                intestine.\n              \n                If you insert too deep, you will damage genital tract. (If you\n                inject subcutaneous area, skins will bubble up) (not too fast,\n                not too slow).\n                Slowly inject the complete volume into the liver, wait a\n                  couple of seconds to allow the pressure to equalize and then\n                  slowly remove the needle.\n            Begin by vertically positioning the needle slightly to the left of\n            the right lobe and angled slightly toward the right lobe; push the\n            needle in about halfway, and then deposit the cells into the right\n            lobe at the rate of 2 s per injection volume.\n          \n            Identify the stomach by a white color on the animal’s heart side.\n            \nNote: The liver should be visible",
    "as a dark area located cranially to the stomach; it should be the\n              largest organ in young pups.\n            \n            Release the pressure immediately with your fingers. Thereafter,\n            remove the needle, being careful to avoid contact with your finger.\n          \n            Repeat Steps until the last mouse has been injected; place the pups\n            back in their nest and return them to the mother.\n          \n            Perform similar procedures as stated above on control mice using\n            vehicle (wash buffer without cells; nontransplanted\n            FRG controls).\n          \n            Use commercially available human primary hepatocytes and human HSCs\n            as controls.\n          \n            Rub the hands again and again with bedding from the original cage.\n          \n            Hold the pups on backside smoothly with two fingers so that an\n            animal cannot move.\n          \nCurve the needle 30o up and inject the solution.\n            Rub the mouse abdomen areas with 70% ethanol-containing cotton swabs\n            and place it back into its housing.\n          \n            Repeat Steps a.-u. until the last neonates have been injected; place\n            the pups back in their nest and return them to the mother.\n          \n            Perform similar procedures as stated above on control mice using\n            vehicle (wash buffer without cells; non-transplanted\n            FRG controls).\n          \n        Gradually decrease the concentration of NTBC (1.6 mg/L, day 0–2;\n        0.8 mg/L, day 3–4; 0.4 mg/L, day 5–6) and completely withdraw one week\n        after transplantation.\n      \nNote: After transplantation, the cyclic\n      decrease of NTBC and complete withdrawal regimen allows engraftment and\n      growth of human hepatocytes. FRG mice grow well and are fully\n      fertile if they are continuously provided NTBC in drinking water. Breeding\n      pairs are maintained on NTBC drinking water their entire lives. Note that\n      after the first month NTBC dosing is required for newborn survival (See\n      Table 2[href=https://www.wicell.org#tbl2]).\n    \n        Euthanize these 12 week of age FRG adult mice after 8–12 weeks\n        post-electroporation, followed by intrahepatic injection into\n        FRG neonates.\n      \n        Test for human Albumin immunostaining and test for circulating human",
    "Albumin in serum to demonstrate whether CRISPR/Cas9-genetically\n        manipulated LPCs and non-parenchymal cells are successfully\n        reconstituted and humanized.\n      \nFollow-up and analysis of humanization\nTiming: 3–4 h: steps: 84–87\n    \n      This section describes humanization with KO liver and non-parenchymal\n      cells. (See previous sections for detailed instructions).\n    \n        Draw blood for humanization chimerism analyses by use of FACS: At\n        8 weeks after transplantation, bleed to test human albumin concentration\n        in serum and presence of human CD45 by FACS. Repeat this for the second\n        and third generations of pups from at least two-pairs of breeders.\n        \n            Draw 20 μL blood from a mouse using a 1 cc syringe sporting and a\n            29G needle.\n          \nReturn the mouse back to its cage.\n            Check each mouse after half an hour to see if they recovered well\n            from the transplantation.\n          \n            Resuspend the pellet using a gentle rocking motion. When necessary,\n            use a 2 mL pipette to titrate two to three times very gently to\n            obtain a homogeneous cell suspension.\n          \nMeasure cell volume, viability, and recovery.\nDilute resuspended hepatocytes to 106 cells/mL.\n            Use repeat pipet or multichannel pipet to dispense cells into BD\n            BioCoatTM Collagen I coated plate (e.g., 400 μL/well of 24-well\n            plate).\n          \n            After cell plating is completed, gently move the plate in a star\n            pattern on a level surface to distribute the cells evenly over the\n            bottom of the plate. See illustration below.\n          \nPlace plates in a 37°C, 5% CO2 incubator.\n            Every 20–30 min during the first 2 h plating, remove plates from\n            incubator and gently rock the plates to redistribute the cells\n            evenly in the wells.\n            \nNote: Gently tapping the edge of\n              the plate may also be helpful to redistribute the cells. Excessive\n              accumulation of cells in the center of the wells can cause cell\n              death.\n            \n            After 2–4 h, gently aspirate the Plating Media and gently refeed",
    "cells with complete Hepatocyte Culture Media (or customer preferred\n            hepatocyte culture media).\n          \n            Keep plates in the incubator overnight for further experiments as\n            required.\n          \n        Withdraw NTBC for the FRG mice for 7 days after transplantation.\n        This is followed by 5 days of NTBC treatment (8 mg/L).\n        \nStart a long NTBC cycle.\n            Withdraw period of 21 days followed by 5 days of NTBC treatment.\n          \n            Apply periodical NTBC cycling protocols to rescue the liver failures\n            if any of injected neonates become sick.\n          \n            Maintain the long NTBC cycle until the mice have high Albumin levels\n            and are ready to be used in experiments as illustrated in\n            Table 1[href=https://www.wicell.org#tbl1]A.4[href=https://www.wicell.org#bib4]\n            Repeat this regimen once and is followed by two cycles of another\n            withdrawal of 7 days and a shorter NTBC treatment of 4 days.\n          \n            Withdrawal NTBC by 3 days of treatment the next two rounds of\n            7 days.\n          \n            Decrease the concentration of NTBC gradually (1.6 mg/L, day 0–2;\n            0.8 mg/L, day 3–4; 0.4 mg/L, day 5–6: Details is described in\n            Table 1[href=https://www.wicell.org#tbl1]A) and completely withdraw one week after\n            transplantation.4[href=https://www.wicell.org#bib4]\nCritical: As NTBC withdrawal in FRG\n      mice results in gradual hepatocellular injury and eventual death after\n      4–8 weeks, all animals are maintained with\n      2-(2-nitro-4-trifluoro-methyl-benzoyl)-1,3 cyclohexanedione\n      (NTBC)-containing drinking water at a concentration of 7.5 mg/L. NTBC is\n      administered through drinking water for breeding cages since any\n      literatures demonstrate that within 1 month after birth, pups survive\n      without NTBC. But for more than 1-month-maintenance, NTBC is required.\n      Mice given NTBC laced drinking water will require separate water bottles\n      for their cages.\n    \n        Day 7: Feed animals autoclaved or irradiated food and maintain them on\n        acidified autoclaved water with or without sulfamethoxazole-trimethoprim\n        (SMX/TMP) (7.8 mL of SMX/TMP per 250 mL of drinking water) in water\n        bottles on alternate weeks for the duration of the animals' lives.\n      \nCritical: The purpose of SMX/TMP",
    "special water is for prophylaxis so that FRG mice do not have B, T\n      and NK cells and have defective dendritic cells although human\n      hematopoietic lineage cells are injected as part of the non-parenchymal\n      cell population from human fetal livers (it will take time to fully\n      reconstitute functional human immune systems). These SMX/TMP water must be\n      continued throughout their life spans. The purpose of feeding alcohol\n      western diets is to generate steatosis and liver cancer development in the\n      humanized mouse liver.\n    \n        Initially feed Nitisinone (NTBC) drinking water (16 mg/mL) for the first\n        week and the water is changed bi-weekly.\n        \nNote: Afterwards, the concentration of\n          NTBC is gradually decreased (1.6 mg/L, day 0–2; 0.8 mg/L, day 3–4;\n          0.4 mg/L, day 5–6) and completely withdrawn one week after\n          transplantation. These NTBC drinking water is fed for 0–6 days for\n          humanized pups.\n        \n            After transplantation, withdraw NTBC after three days of treatment\n            the next two rounds of 7 days. Withdraw NTBC from the\n            FRG mice for seven days.\n          \nThis is followed by five days of NTBC treatment (8 mg/L).\n            Repeat this regimen once and is followed by two cycles of another\n            withdrawal of 7 days and a shorter NTBC treatment of four days.\n          \n            Start a long NTBC cycle. This consists of a withdrawal period of\n            21 days followed by five days of NTBC treatment.\n          \n            Maintain the long NTBC cycle until the mice have high albumin levels\n            and are ready to be used in experiments as illustrated in\n            Table 1[href=https://www.wicell.org#tbl1].4[href=https://www.wicell.org#bib4]\nNote: During the first FRG\n              transplantations extra care is taken with the NTBC cycling. To\n              prevent animal morbidity, the FRG mice are weighed frequently (up\n              to three times per week). If mouse weight drops more than 20%\n              these mice will receive an NTBC treatment. The above-described",
    "NTBC cycling protocol is adjusted based on your experiences using\n              a weight-based protocol since experimental conditions between labs\n              and the proliferative capacity of hepatocytes from different\n              donors may vary.\n            \nHumanization analysis and follow-up\nTiming: 4–8 weeks (for steps 88–97)\n    \nTiming: 2 days: (for step 98 for\n      hitology section preparation)\n    \n      This section describes the validation of liver humanization and follow-up.\n    \n        After 8–12 weeks post-intrahepatic injection, feed Alcohol Western diet\n        to humanized mice for six months to generate HCC.\n      \n        Monitor feeding groups of humanized FRG mice for behavior and palpation\n        of abdomen areas to detect any harder objects in liver areas for human\n        HCC development.\n      \n        Four months after alcohol Western diet feeding, scan palpation-based\n        hard object-positive FRG mice exhibiting liver hardening by\n        micro-CT and ultrasound live animal imaging to identify and quantify the\n        volumes of liver tumors and hyperplasias.\n      \n        Once tumors are detected, register these FRG mice for drug\n        treatment to test how these therapeutic drug candidates effectively\n        reduce liver tumor sizes.\n      \n        Use both females and males of humanized FRG mice for comparison\n        of HCC incidence in females and males to avoid biological variables.\n      \nNote: After successful electroporation and\n      gene knockout, approximately 20–40% of cell clones are mutated in targeted\n      ARID1A genetic loci.\n    \n        Isolate genomic DNA from parts of liver tumor, followed by PCR\n        amplification of targeted loci to examine ether liver tumor genomic DNA\n        contain ARID1A mutations or c.a.CTNNB1 mutagenesis to\n        validate whether HCC are developed from ARID1A knockout clones\n        and/or c.a.CTNNB1-knockin hepatic progenitor cells.\n      \nNote: Once gene sequencing is validated,\n      these cancer-driver mutagenesis with alcohol Western diet feeding are\n      ideal tools to accurately access the drug efficacy in each driver\n      mutations groups.\n    \n        Starting at six-to-eight weeks post transplantation, collect two\n        microliters of whole blood via the saphenous vein and immediately\n        diluted into ELISA diluent buffer.",
    "Human albumin ELISA: Analyze plasmas of the transplanted mice for the\n        presence of human albumin following the protocol of the human albumin\n        ELISA quantitation kit, starting six weeks after transplantation.\n        \n            Monitor human albumin levels using the Bethyl Laboratory\n            Quantitative Human Albumin ELISA Kit.\n          \n            To measure human liver reconstitution, perform human albumin ELISA\n            using plasma and the human albumin ELISA kit (Bethyl) according to\n            the manufacturer’s procedures.\n          \n        Determine the kinetics of the appearance of human albumin in the mouse\n        plasma from the quality of the human hepatocytes at the time of\n        transplantation and the engrafted hepatocyte efficiency to integrate\n        into the liver parenchyma.\n        \n            Albumin >\n            2 mg/mL: indication of successful engraftment of human\n              hepatocytes.\n            If levels of human albumin are above 2 mg/mL 14 weeks after\n            transplantation, those mice with human albumin levels are\n            successfully engrafted. Whole blood albumin levels of > 4 mg/mL\n            correlate with repopulation indices > 90%.4[href=https://www.wicell.org#bib4]\n            0.5 mg/mL: The detection limit of human albumin ELISA. If human\n            albumin levels are below the detection limit of 0.5 mg/mL at the\n            first analyses, it does not immediately indicate a failed\n            transplantation. Continue to monitor albumin levels.\n          \n0 mg/mL: Failed transplantation procedures: Low to no human\n            albumin: The transplantation has failed. If low to no human albumin\n            is detected or still below the detection limit by 12–14\n            weeks after transplantation, the transplantation\n            procedure has failed.\n          \nNote: If human albumin levels are below\n      the detection limit of 0.5 mg/mL at the first analyses, it does not\n      immediately indicate a failed transplantation. The kinetics of the\n      appearance of human albumin in the mouse plasma is influenced by the\n      quality of the human hepatocytes at the time of transplantation and their\n      efficiency to integrate into the liver parenchyma. If human albumin levels",
    "are still below the detection limit after 14 weeks, then the procedure has\n      likely failed.\n    \n        Bleed to test human albumin concentration and human CD45 positive cells\n        by FACS at eight to 12 weeks after transplantation. Repeat this for the\n        second and third generations of pups from the two-pairs of breeders.\n      \n        Histology and immunocytochemistry to confirm humanized parenchymal and\n        non-parenchymal cells.\n        This section describes determining the ratio of humanized hepatocytes\n        and non-parenchymal cells by use of immunohistochemistry.\n        \n            Perform FAH immunohistochemistry.11[href=https://www.wicell.org#bib12]\n            Stain sections of humanized mouse liver with Hematoxylin & Eosin\n            (H&E) and examine histology by assistance of board-certified\n            pathologists to distinguish between hyperplasia, low/middle/high\n            grade of HCC with quantification of the degrees of differentiations\n            (i.e., poorly-differentiated vs. well-differentiated HCCs).\n          \n            Use the HepPar antibody (DAKO) according to the manufacturer’s\n            specifications.\n          \n            Plate liver cells on collagen type1-coated 6-well plates for\n            immunocytochemistry of hepatocytes from humanized mouse. Fix the\n            attached cells with 4% paraformaldehyde for 15 min and block with 5%\n            skim milk. Use rabbit anti-FAH (Grompe lab), goat anti-human albumin\n            (Bethyl), goat anti-mouse albumin (Bethyl) as primary antibodies at\n            dilution of 1/200.\n          \n            Use Alexa Fluoro 488 anti-goat IgG (Invitrogen) or Alexa Fluoro 555\n            anti-rabbit IgG (Invitrogen) as secondary antibodies.\n          \n            Capture the images with an Axiovert 200 microscope and a Nikon\n            digital camera.\n          \n      Confirmation analyses of human liver and immune system reconstitution\n    \nTiming: 2–3 months: steps 99–103\n    \n      This section describes methods to determine chimerism between human and\n      mouse of immune systems and hepatocytes.\n    \n        Wean animals at 3–4 weeks of age and house at ≤4–5 humanized animals per\n        cage.\n      \n        Feed animals with autoclaved/irradiated food and maintain mice on\n        acidified autoclaved water with or without SMX/TMP (7.8 mL of SMX/TMP\n        per 250 mL of drinking water). If SMX/TMP is needed include in drinking\n        water on alternate weeks for the duration of their lives.",
    "At 16 weeks after transplantation, warm FRG-hu HSC/Hep and control mice\n        with a heat lamp and bleed them by making a single 5-mm cut (nick) on\n        the tail vein with a sterile scalpel. Collect 100 μL of blood per mouse\n        in 1.5-mL sterile microcentrifuge tubes containing 100 μL of 20 mM\n        PBS-EDTA and place it on ice; samples can be kept on ice for up to 12 h.\n      \n        Spin collected blood–PBS/EDTA solution at 469g for 10 min at 4°C\n        using a centrifuge. The top portion (plasma) can be used to examine\n        human liver reconstitution by ELISA or FACS as described earlier. The\n        pellet [peripheral blood mononuclear cells (PBMCs)] can be used to\n        measure human immune reconstitution.\n      \n        Resuspend the pellet (PBMCs) in red blood cell lysis buffer (1× ACK\n        lysis buffer), incubate for 5 min at 25°C, spin cells at 469g,\n        repeat this procedure and resuspend in 2% (vol/vol) FBS/PBS containing\n        human CD45, mouse CD45 and 7-AAD antibody mixture. Examine the human\n        immune reconstitution (percentage of human CD45+cells/total\n        CD45+ cells) using flow cytometry analysis.\n      \nNote: If the pellet is red, repeat steps\n      138 and 139 until the pellet is yellow or white to ensure removal of red\n      blood cells.\n    \n      Alcohol western diet (AWD) feeding to promote HCC development and\n      therapeutic testing in humanized FRG mice\n    \nTiming: six months (for steps 104–107)\n      (Figure 5[href=https://www.wicell.org#fig5])\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3183-Fig5.jpg\n          Figure 5. Development of HCC and therapeutic tests\n        \n          After humanized livers are confirmed, humanized FRG mice are\n          fed alcohol Western diet for a maximum six months to generate HCCs.\n          After four and five months following alcohol WD feeding (Days 180 and\n          210), micro-CT and/or ultrasound is performed to monitor HCC\n          development. Once HCC is detected, HCC-harboring FRG mice are\n          registered for therapeutic testing and after a 4-week treatment, all\n          mice are euthanized. Created by\n          biorender.com[href=http://biorender.com] (Agreement Number:).",
    "After generation of the cancer-driver mutation containing humanized\n      livers, environmental factors, such as BASH (both ASH and NASH) can be\n      recapitulated by alcohol Western diet feeding for six months to promote\n      the tumor developments.\n    \n        Feed alcohol WD for six months to promote liver cancer development\n        through gene-environmental interactions after confirmation of\n        humanization of livers.\n        \n            Collect blood from facial vein (once) BEFORE alcohol WD feeding\n            (facial vein route is only used for uninfected mice): Required:\n            4–5 mm lancet or 28–30-gauge needle, small blood collecting tube,\n            clean work surface, and mouse.\n          \n            Achieve hemostasis by using a gauze and applying into facial vein to\n            stop the bleeding for 30–60 s.\n          \n            Collect blood from the orbital sinus (One time), one week AFTER\n            alcohol WD feeding:\n          \n            Anesthetize mice by us of isoflurane vaporizer machine (1–4%). Use\n            Isoflurane to anesthetize mice at four months of age (one week after\n            alcohol WD feeding). For the RO blood collection, apply proparacaine\n            to the eye before blood collection for local anesthesia.\n          \n            Use orbital sinus route for blood collection from mice instead of\n            facial vein.\n          \n            Gently insert tip of the pipette below the eye at approximately a\n            45° angle into the space between the globe and the lower-eyelid.\n            Take care not to occlude the trachea with your thumb. Insert the tip\n            of a soft plastic pipette (o.d. of 1.2 mm) into the corner of the\n            eye socket underneath the eyeball, directing the tip at a 45° angle\n            toward the middle of the eye socket.\n          \n            Feel the pipette rest on the orbit, at this point gently twist the\n            pipette between our thumb and forefinger. Rotate the pipette between\n            your fingers during forward passage; do not move it from side to\n            side or front to back. Apply gentle downward pressure and then",
    "release until the vein is broken and blood is visualized entering\n            the pipette.\n            \nNote: Blood flows into the pipette\n              once the sinus/plexus has been ruptured.\n            \n            Withdraw slightly and allow the pipette to fill when a small amount\n            of blood begins filling the pipette.\n            \nNote: Do not let the pipette come\n              out of the eye socket. If the pipette is not withdrawn slightly,\n              it may occlude the vein and blood will not flow freely.\n            \n            Use multiple pipettes as needed to collect the total volume. Cover\n            the open end of the pipette with the tip of finger before removing\n            it from the orbital sinus to prevent blood from spilling out of the\n            tube.\n            \nNote: Bleeding usually stops\n              immediately and completely when the pipette is removed. It may be\n              necessary to apply gentle pressure on the eyeball for a moment by\n              closing the skin above and below the eye using first finger and\n              thumb. It is recommended that sample collection not be repeated on\n              the same eye for at least two weeks. We will place each pipette\n              into an opened collection tube as they fill.\n            \n            Release tension on the animal and gently hold a gauze pad over the\n            eye until the bleeding has stopped.\n          \n            Either tap the pipette on the edge of the tube to empty or place a\n            small pipette tip on the end of a syringe to carefully blow the\n            sample out, it will clot very quickly.\n          \n            Watch the animal carefully until it begins to recover from\n            anesthesia and move about, then you can return it to its cage and\n            move on to the next animal.\n          \n            Apply triple antibiotic ointment post-retroorbital bleed to prevent\n            infection.\n          \n        Feed mice either control liquid diet or alcohol Western diet and\n        acidified sulfamethoxazole-trimethoprim (SMX/TMP) water for 6 months.\n        \n            Feed Alcohol Western diet (DYET#710362) containing 3.5% (v/v)",
    "ethanol or control diet (DYET#180724) by use of Lieber-DeCarli\n            liquid diet glass feeding tubes (Bio-Serv: Catalogue #9019, 50 mL)\n            in tube holders (Bio-Serv Cat #9015, Short, Adjustable) in the FRG\n            model (Figure 6[href=https://www.wicell.org#fig6]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3183-Fig6.jpg\n                  Figure 6. Hamilton needle is stubbed from left shoulder area\n                  into livers of FRG neonates (1–5 days of age)\n                \n            Replace caps (Bio-Serv Cat #9501, Autoclavable Screw Cap, Black) to\n            seal feeding tubes if it is loose to avoid the leakage of liquid\n            diet.\n          \nNote: Alcohol Western diet feeding will\n      increase numbers of human leukocytes (CD45+, CD3+\n      and CD4+, plasmacytoid dendritic cells, macrophages and T\n      regulatory cells) in the liver T cell immune response after mice responded\n      to a challenge infection as previously reported.12[href=https://www.wicell.org#bib14]\nCollect retro-orbital blood one week after alcohol WD feeding.\n        Feed either normal or Alcohol fed diet for four weeks, afterwards\n        initiation of drug treatment.\n      \n      Therapeutic efficacy assessment by use of different cancer-driver mutant\n      HCC FRG mice\n    \nTiming: 4–5 weeks (for steps 108–110)\n      (Figures 5[href=https://www.wicell.org#fig5] and 6[href=https://www.wicell.org#fig6])\n    \n      This section describes the therapeutic treatments for HCC-bearing\n      humanized FRG mice.\n    \nFollow up for one month after four weeks of drug treatment.\nScan by Micro-CT and take ultrasound images.\n        Collect blood by terminal cardiiac puncture (Endpoint approximately Day\n        196): Anesthetized mice (by Ketamine/Xylazine) prior to blood\n        collection. Blood Collection Technique from Facial Vein BEFORE (once)\n        humanization/repopulation. 4–5 mm lancet or 28–30-gauge needle, small\n        blood collecting tube, clean work surface, and mouse. Anesthetics.\n        Hemostasis is achieved by using a gauze and applying it to facial vein\n        to stop the bleeding for 30–60 s.\n      \n      Annealing temperature 60°C is better for the specificity (Figure 7[href=https://www.wicell.org#fig7]).\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3183-Fig7.jpg\n          Figure 7. Targeting of mouse Fah loci and their genotyping using PCR\n          primer binding sites\n        \nAnnealing temperature 60°C is better for primer specificity.\ntable:files/protocols_protocol_3183_8.csv\nNote: Present PCR reactions with the\n      following conditions:\n    \ntable:files/protocols_protocol_3183_9.csv",
    "Genotyping of homemade-Fah−/−; Rag2−/−; IL2Rgc−/− (FRG) mice\n    \nRag2−/− IL2Rgamma−/− mice (Taconic: cat#4111, purchased on Oct.\n        1, 2010)\n      \nFor Rag-2 genotyping.\nRag-2 Tm1Fwa genotyping primers.\nRAG2IL2Rg-Neo-3’: CCAACGCTATGTCCTGATAGCGGT (24 bp)\nRAG2IL2Rg-RG2-1: TTAATTCAACCAGGCTTCTCTCACTT (24 bp)\nRAG2IL2Rg-RG2-3: GCCTGCTTATTGTCTCCTCCTGGTATG (27 bp)\nRag2 WT: 973 bp.\nRag2 KO: 1,107 bp.\ntable:files/protocols_protocol_3183_10.csv\n      Fah Wild Type gene\n      PCR reaction master mix\n    \nNote: Present PCR reactions by use of\n      Advantage DNA polymerase with the following conditions:\n    \ntable:files/protocols_protocol_3183_11.csv\nAmplicon is 500bp.\nCommon gamma chain wild type gene\nTiming: 3–4 h (for step 115c)\n    \nGc Sense (intron 4) CTT TAT TGA TAA CGA TCT ATC CCT CAC CC (29 bp)\nGc Antisense (intron 5) CTC CAC TCT GCA GAG TCT ATG GAA TCC (27 bp)\ntable:files/protocols_protocol_3183_12.csv\nNote: Present PCR reactions with the\n      following conditions:\n    \ntable:files/protocols_protocol_3183_13.csv\nAmplicon is 500bp.\nTiming: Overall  Total time is\n      8-9 months\n    \n      Humanization of adult FRG breeder mice by surgical transplantation (steps\n      1–41).\n    \n            Adenovirus (Ad:uPA) amplification, purification and titer\n            determination (needed for in-house-preparation of Ad:uPA) [steps\n            1–26; 3–7 weeks] (Figure 2[href=https://www.wicell.org#fig2])\n            \nHuman adult hepatocyte purification\nPreparing parental FRG breeder mice and breeding\n            Precondition FRG neonates by Ad:uPA injection and X-ray\n            irradiation [Steps 28-33]\n            \nDigestion and preparation of human fetal liver cells\n            Primary hepatocyte recovery [steps 31]\n            \n                Transplantation and eventual withdrawal of NTBC in drinking\n                water\n              \n            Confirmation analyses of human liver and immune system\n            reconstitution\n          \n      Dual humanization protocol of breeder FRG mice [steps 28-33]\n    \nTiming: 2 months\nTiming: 21–40 days (for step 116)\n    \nTiming: 3–5 h (for step 117)\n    \nTiming: 2–3 days (for step 118)\n    \nTiming: 3 h (for step 118ei)\n    \nTiming: 12 h (for step 118eii)\n    \nTiming: 2–4 h (for step 119)\n    \nTiming: 2–3 months (for step 120)\n    \nTiming: 6 months (for step 121)\n    \nTiming: 4–5 weeks (for step 122)\n    \n      Breeding humanized FRG mice for neonate production and Pre-conditioning\n      [steps 34, 35] (Figure 2[href=https://www.wicell.org#fig2])\n    \ntable:files/protocols_protocol_3183_14.csv",
    "Note: NTBC + water feeding throughout (day\n      0–10).\n    \n      CRISPR/Cas9-medated gene knockout and /or knock-in of human fetal LPCs\n      transplanted into neonate livers [step 36–58]\n    \n      Humanization of liver and non-parenchymal cells [steps: 42–58; Hands-on\n      Time: 3–4 h] depending on numbers of animals to transplant, 5–10 min per\n      mouse (4 injections), 10–20 min for LPC+ Non-parenchymal cell injections,\n      8–12 weeks for in vivo humanized liver and immune system\n      reconstitution\n    \n      Typical Time schedules of the day before transplantation and\n      transplantation date.\n    \n            One day before transplantation (Late afternoon around 7:00 pm on the\n            day before transplantation: Retro-orbital injection of Ad:uPA to\n            pre-condition recipient FRG neonates.\n          \n            7:00 am Start works and wait for tissue delivery and reagent\n            preparation\n          \n8:00 am Start to receive and digest tissues\n            8:50 am Leave to X-ray irradiator (150 cGy for FRG neonates): We may\n            adjust a radiation dose for pups due to a size difference.\n          \n            9:30 am Take them back to vivarium\n            \n                CRISPR Editing Human fetal LPCs with RNPs using Neon\n                Electroporation [steps 50–51;]\n              \n                Liver digestion of human fetal livers and intrahepatic injection\n                of human LPC, non-parenchymal cells with human hematopoietic\n                stem cells. [steps 52–85; Hands-on Time: 3–4 h]\n              \n      ARID1A knockout CRISP/Cas9 by use of sg-RNA electroporation and cell\n      injection into humanized FRG mice. [steps: 63-66] (Figure 6[href=https://www.wicell.org#fig6])\n    \n      Confirmation analyses of human liver and immune system reconstitution:\n      step 72-74 and 84-103:\n    \n      Alcohol Western Diet (AWD) feeding to promote HCC development [step\n      104–107]\n    \n      Therapeutic efficacy assessment by use of different cancer-driver mutant\n      HCC FRG mice [step 108–110]"
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}