{
  "id": 12008,
  "origin_website": "Jove",
  "title": "Studying Triple Negative Breast Cancer Using Orthotopic Breast Cancer Model",
  "procedures": [
    "Analysis of tumor growth was carried out using protocols approved by the Committee for the Ethics of Animal Experiments of the National Cancer Institute and adhered to the recommendations of the United States National Research Council's \"Guide for the Care and Use of Laboratory Animals\", the United States Public Health Service's \"Guide for the Care and Use of Laboratory Animals\", and the \"Policy on Humane Care and Use of Laboratory Animals\".\n1. Preparation of cells for implantation\nNOTE: MDA-MB-231 human breast adenocarcinoma cells (commercially acquired) were stably transfected with the luciferase gene III and enhanced green fluorescent protein (GFP) marker by lentivirus and grown in the presence of the selection antibiotic (puromycin).\nStart the cell culture with 1 x 106 MDA-MB-231-Luc/GFP cells and add 15 mL of prewarmed (37 °C) RPMI 1640 medium with 10% fetal bovine serum (FBS) in a T75 culture flask. Keep the cells growing in a temperature-controlled cell culture incubator at 37 °C with 5% CO2. Replace the complete medium at least 2x a week.\n\tNOTE: Do not disturb the cell growth and keep checking the cell growing conditions daily. The cells need to be subcultured when they reach 85%−90% confluency to maintain the proliferation phase.\nOne week before the cell implantation step, remove the puromycin from the cell culture flask by first removing all the medium in the culture flask, then rinsing 2x with 10 mL of 1x phosphate buffered saline (PBS), and finally replacing the medium with complete medium without the puromycin. During the medium-adding and rinsing steps, do not disturb the cells. Remember not to use the complete medium with the selection antibiotics from now on for all medium replenishment steps.",
    "On the day of preparing the cells for implantation, remove all complete medium before trypsinization to avoid deactivating the trypsin. Add 5 mL of trypsin to the flask to trypsinize the cells. Monitor the cells and check that they detach from the culture flask.\nOnce the majority of the cells detach, add 10 mL of complete medium to neutralize the trypsin activity. Next, transfer the cell suspension to a 50 mL centrifuge tube and centrifuge at ~150 x g to pellet the cells. Remove the supernatant after the centrifugation and then add 10 mL of 1x PBS to resuspend the cells and prepare for cell counting.\nCount the cells with a cell counter and adjust the cell concentration to 20 x 106 cells/mL in cold 1x PBS containing 25% basement membrane matrix. Inject 2 x 106 cells in 0.1 mL 1x PBS with 25% basement membrane matrix into the fourth mammary fat pad of each mouse. Bring extra needles and syringes for the cell implantation and keep the cell-basement-membrane-matrix mix on ice prior to implantation.\n\tNOTE: There is dead space in the syringe and needle. Depending on the choice of needle and syringe length, type, and size, a tuberculin syringe with a 0.5 in 26 G needle can have up to 70 µL dead space10. Prepare 40%−50% more cell implantation mix to compensate for the dead space and any other accidental loss.\n2. Orthotopic breast cancer model and tumor size measurement\nAllow 6-week-old female athymic nude mice to acclimate to the housing facility for at least 1 week before the cell implantation.\n\tNOTE: Using same age mice will reduce data variation.",
    "For each round, anesthetize five mice with isoflurane at 4% with filtered (0.2 µm) air at a flow rate of 1 L/min for 3−4 min. Pay attention to the mouse respiratory rate and pattern change, and use a toe pinch to ensure that the mice are under proper anesthesia. Once they are no longer moving, remove one mouse and place a nose cone over its nose and mouth with the same anesthesia.\nSwab the left 4th mammary gland with alcohol. Using fine rat tooth forceps, lift the 4th mammary gland slightly to insert the 25 G needle. Make sure the needle is bevel up and then slightly pull the plunger to make sure the needle does not hit any blood vessels. If no blood enters the syringe, continue to slowly inject 100 µL of the cell-basement-membrane-matrix mix into the mammary fat pad.\n\tNOTE: A round, raised area will appear underneath the skin.\nWait 10−15 s for the basement membrane matrix to harden, then remove the needle. Repeat the process with the remaining mice in the induction chamber. Place all used needles and syringes in a sharp box.\nUse the same mammary gland injection site for all mice. Keep a close eye on the injection site and note any cell implantation mix leaking out from the injection site.\n\tNOTE: Within a few minutes, the mouse will start to regain consciousness.\nAllow the xenograft to grow freely without any interruption for 7−10 days prior to any tumor size measurement.\nExamine all mice for the xenograft size. Measure the tumor size with a caliper. Determine the tumor volume (mm3) with the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60316/60316eq1.jpg\n\twhere L is the longest dimension and W is the shortest dimension perpendicular to L.",
    "Identify and remove outliers exceeding one standard deviation of the mean. Only use mice with comparable tumor sizes for experiments. Randomly divide the mice into different treatment groups and begin treatments.\nMeasure the tumor size by caliper 2x a week. Keep note of all the physical changes of the xenografts (i.e., necrosis, laceration).\n3. In vivo bioluminescence and ex vivo fluorescence imaging\nNOTE: In this study, both two-dimensional bioluminescence and fluorescence imaging are conducted at the endpoint of the experiment. The bioluminescence imaging (BLI) was performed using a commercial preclinical optical scanner equipped with a 16-bit cooled CCD camera and heated imaging stage.\nBefore imaging, anesthetize up to five tumor-bearing mice in the induction chamber by setting isoflurane at 3% with filtered (0.2 µm) air at a flow rate of 1 L/min for 3−4 min. Determine anesthesia by a toe pinch. Ensure that the induction chamber is kept inside a vented hood to minimize staff exposure to isoflurane.\nAdminister D-luciferin (150 mg/kg) to the anesthetized mice by an intraperitoneal route using a 27 G needle, and transfer an anesthetized mouse to the imaging chamber. At the scanner imaging chamber, maintain the isoflurane at 2%−2.5% with O2 as a carrier with a flow rate of 1 L/min.\n\tNOTE: Maintain the body temperature of the mouse at ~37 °C during the procedure by keeping a heated pad under the anesthesia induction chamber, imaging table (if the stage is not heated), and postprocedure recovery cage.",
    "Before imaging the study mice, obtain luciferin kinetics by imaging three extra tumor bearing mice (animals not assigned to any study groups) at 2 min intervals for a total of 40 min using the following parameters: excitation filter-blocked, emission filter-open, f/stop 1, FOV-D, medium binning (8 x 8), and auto exposure. Use the peak bioluminescence signal measured to define the optimal image acquisition time window for all subsequent time points.\nWhile performing metastasis imaging, shield the high BLI signal from the primary tumor by covering it with a sleeve cut out from a black glove. Acquire the image using the same parameters described in step 3.3 with the ventral side of the mouse facing the camera for lung metastasis imaging and the dorsal side of the mouse facing the camera for the brain metastasis imaging.\n\tNOTE: It is essential to test a few different brands of black gloves to pick the one with minimal auto luminescence.\nUsing a scanner and data analysis software, draw a standard shape region of interest (ROI) over the thoracic cavity or the brain ensuring that the entire organ of interest is covered to evaluate the metastatic burden. Quantify the bioluminescence (BL) output as total flux (photons/second).\nImmediately after BLI, euthanize the mouse via CO2 asphyxiation (as per ACUC guidelines and institution-approved animal protocols) and extract the lung and the brain with dissecting scissors and forceps for ex vivo imaging.\n\tNOTE: The lung extracted for ex vivo imaging and for lung metastasis nodule counting cannot be performed on the same mouse due to incompatible procedures.",
    "Quickly rinse all organs with 1x PBS to remove any superficial bloodstains and place organs on a low-autofluorescence, black plastic plate. Transport organs to a multispectral fluorescence scanner equipped with spectral unmixing capability (solid-state liquid crystal wavelength tuning) with a 12-bit CCD camera for GFP detection.\nAcquire multispectral GFP images (excitation filter = 457 ± 23 nm; emission filter = 490 nm long pass) of the extracted organs and non-tumor bearing control mice by scanning through 500−720 nm at a step size of 10 nm. Use excised organs from non-tumor bearing control mice to correct for autofluorescence.\nAfter multispectral GFP imaging, determine the optimal imaging settings. Perform image acquisition of all target organs and conduct image analysis (i.e., generate a spectral library for autofluorescence and GFP for spectral unmixing procedure) according to the manufacturer's protocol.\n4. Molecular detection of metastatic breast cancer cells\nAfter the ex vivo imaging, snap freeze the whole brain in liquid nitrogen and store at -80 °C in a freezer until ready for the DNA extraction.\nFor DNA extraction, put the whole brain in a 5 mL homogenizing tube with 2 mL of DNA lysis buffer. Use a homogenizer with the power setting at 50 to homogenize the snap-frozen whole brain tissue. Once the brain tissue is totally homogenized, transfer the 1 mL suspension (lysate) to a DNase-free and RNase-free 2 mL microcentrifuge tube and continue to isolate the DNA according to the manufacturer's protocol.\n\tNOTE: To minimize carryover DNA contamination, thoroughly clean the homogenizer after each sample by first rinsing it with 75% ethanol in DNase-free and RNase-free water, then rinsing with 1 M NaOH solution, followed by a rinse with 75% ethanol in DNase-free and RNase-free water to effectively reduce and destroy any DNA residue.",
    "Add 0.5 mL of 100% ethanol of DNA lysis buffer to the lysate. Mix sample by inversion and store at room temperature for 3 min.\n\tNOTE: Do not invert too many times or too vigorously. The DNA will be visible as a wool-like precipitate.\nUse a pipette tip to transfer the DNA to a fresh DNase-free and RNase-free 2 mL microcentrifuge tube. Let the sample air dry for 1 min. Add 1 mL 75% ethanol and invert the microcentrifuge tube 3−6x to wash the DNA sample. Discard the ethanol after each wash by pipetting. Repeat the wash step 2x.\nAir dry the DNA sample for 10 s. Then add 52 µL of 8 mM NaOH to dissolve the DNA sample. Pipet 2 µL of the DNA sample for DNA quantitation, and use the remaining 50 µL for a real-time PCR assay after concentration adjustment.\n\tNOTE: NaOH helps to fully solubilize the DNA sample.\nQuantitate 2 µL of each DNA sample with a spectrophotometer and use an absorbance ratio between A260/280 as a quality check reference. Calculate the DNA concentration with this formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60316/60316eq2.jpg\nAdjust the DNA concentration to 50 ng/µL. For each DNA sample, use 50 ng of DNA as the starting template for a real-time PCR assay. Use 8 mM NaOH solution or DNase-free and RNase-free water to dilute the DNA sample.\nDesign the primer pair specific to the exogenous green fluorescence protein (GFP) sequence in-house using an open source primer design web portal for real-time PCR detection of the GFP tag in the metastatic cells that invaded and colonized distal sites.\n\tNOTE: This study used F: 5'-AGAACGGCATCAAGGTGAAC-3', R: 5'-TGCTCAGGTAGTGGTTGTCG-3'.",
    "Use a fast real-time PCR reagent and a real-time PCR machine that supports a fast real-time PCR protocol. In addition to the regular 30 cycle amplification steps, add a dissociation curve step to the end of the run for the detection of any nonspecific amplification.\n\tNOTE: The following conditions were used for molecular detection: 95 °C 2 min hot start, 40 cycles of 95 °C 5 s, 60 °C 15 s, and lastly a melting curve analysis. The GFP amplicon is 135 bp in size.\nUse a naive mouse brain DNA (not a MDA-MB-231 cell implant) as a negative control. Use DNA extracted from the MDA-MB-231-GFP/Luc cells as a positive control. Add all the PCR reagents without any DNA template as a no template control (NTC).\n\tNOTE: A PCR control is needed for each PCR assay.\n5. Metastatic breast cancer cell detection in lung\nFor the mice subgroup chosen for the metastatic lung nodule counting, anesthetize mice with isoflurane (as in step 2.2) immediately after the ex vivo imaging, perform a cardiac puncture for blood collection, and then euthanize by cervical dislocation.\nOpen the chest cavity with dissecting scissors and cut past the heart and thymus to expose the trachea.\nInsert a 10 mL syringe with a 22 G needle containing Bouin's solution into the trachea. Push the syringe plunger until the collapsed lungs are swollen with ~2 mL of the Bouin's solution. Remove the syringe and needle once the lungs have been inflated.\nPlace the whole lung into a 15 mL tube containing Bouin's solution, gently invert the tube a few times, and allow to soak for 24 h at room temperature.",
    "After 24 h, remove the Bouin's solution from the tube, rinse the lung with water, and then place it back in the tube with 70% ethanol. Count metastasis (white patches or nodules) on the surfaces of the lungs using a dissecting microscope.\n6. Data collection and analysis\nRecord tumor volume data, as well as in vivo and ex vivo imaging data, on an electronic spreadsheet for easy data entry, collection, and management.\nAt the end of the experiment, transfer all data to the electronic spreadsheet and statistical software for data plotting and statistical analyses."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}