{
  "id": 17869,
  "origin_website": "Jove",
  "title": "Isolation and Purification of Murine Cardiac Pericytes",
  "procedures": [
    "All animals were housed and used in an Association for Assessment and Accreditation of Laboratory Animal Care International (AAALAC) accredited facility and all animal work was conducted under appropriate veterinary oversight and under the Institutional Animal Care and Use Committee (IACUC) approved protocol of Amgen Inc.\n1. Preparation of Tools and Culture Media\nAutoclave surgical 9 cm straight tip fine point scissors and 10 cm angled serrated forceps.\nAdd 25 mL of 5% fetal bovine serum (FBS) and 5 mL of 1% penicillin streptomycin (P/S) into a 500 mL bottle of calcium magnesium free Dulbecco's phosphate-buffered saline (CMF-DPBS). Place solution in an ice bath to ensure it will be cold at the time of use. Aliquot 50 mL into a 50 mL conical tube for heart isolation. Add in 250 units/mL of heparin sodium solution into the 50 mL aliquot. This will be referred to as heparinized CMF-DPBS.\nAdd 20% FBS (100 mL) and 1% P/S (5 mL) into a 500 mL bottle of high glucose Dulbecco's modified eagle's medium (DMEM). This will be referred to as the enzyme-free culture media. Aliquot 20 mL of DMEM + 20% FBS + 1% P/S and add in 500 µg/mL of collagenase B. This will be referred to as the enzyme solution. Keep both the enzyme-free culture media and enzyme solution warm at 37 °C in an incubator or water bath.\n2. Preparation of Animal and Procurement of Cardiac Tissue\nIntraperitoneally inject a mouse with 250 units of heparin sodium solution with a 31 G needle syringe. Then wait 10−15 min while the mouse remains active in its home cage.\nNOTE: Representative data in this study were obtained from a 4 month-old male C57BL/6 mouse. However, this protocol can be used on any mouse regardless of strain, age, gender, weight, etc.",
    "Anesthetize the mouse with 5% isoflurane. Check the anesthesia depth of the mouse by pinch reflex.\nPlace the anesthetized mouse in supine position and tape down its forelimbs. Carefully open the chest cavity and cannulate the descending aorta using a 25 G butterfly needle.\nMake a nick in the right atrium and perfuse the heart with at least 20 mL of 250 units/mL heparinized CMF-DPBS at 2 mL/min with a variable-flow peristaltic pump. When the PBS comes out of the right atria clean, perfusion is complete.\nCut the heart out at the aorta and place it into the ice-cold CMF-DPBS.\n3. Dissociation of Heart Tissue\nTransfer the heart into a 15 cm x 15 cm Petri dish. Cut the heart into tiny pieces (1 mm/piece) using spring scissors and fine point forceps with enough enzyme solution to cover the pieces (10−15 mL).\nTransfer the pieces and solution into a 50 mL conical tube, seal with paraffin plastic film, and incubate at 37 °C on an orbital shaker at 120 rpm for 75 min.\nAfter collagenase digestion with the enzyme solution, decant the liquid through a 100 µm cell strainer into a new 50 mL tube but leave enough solution to make sure the pieces do not dry out.\nUsing fine point forceps, take out the tissue from the tube and place a few pieces on a microscope slide. Then grind the tissue between two microscope slides to break up the tissue.Rinse the slides with enzyme free culture media into a new 50 mL conical tube.\nRepeat step 3.4 until all tissue pieces are dissociated.\nCombine the solutions from steps 3.3−3.5 into one tube. Strain the resulting suspension through a 100 µm cell strainer into a new 50 mL conical tube.",
    "Centrifuge at 220 x g, 4 °C, for 5 min. Aspirate off previous solution and gently resuspend cell pellet in fresh enzyme-free culture media.\nCount cells and check viability using a cell counter. Dilute cells to 1 x 106/mL with cold FACS staining buffer containing 500 mL of DPBS and 10−25 mL of 2−5% bovine serum albumin (BSA). The cells are ready to be stained and sorted.\n4. Purification of Pericytes from Crude Cell Mixture Using FACS\nPrepare and label 5 mL FACS tubes for all controls and cell samples. Aliquot out cells (1 mL of cells per tube) for an unstained sample, fluorescence minus one (FMO) controls, and isotype-matched controls. Use the remaining cells for the sort. All controls and samples can be prepared and stained at the same time.\nNOTE: A total of 13 mL at 0.5 x 106 cells/mL were used for the representative sort from one heart. However, the volume depends on how many cells the investigator obtains from their isolation, how many hearts they use, and how well the heart tissue is digested; the size of each heart is also a variable that can alter the volume.\n\t\nUse compensation beads (Table of Materials) to optimize fluorescence compensation controls. Prepare one compensation control for each fluorochrome in the experiment in a labelled 5 mL FACS tube. For this experiment, prepare a total of 9 compensation controls — 2 kinds of unstained beads plus 7 different fluorochromes from the marker panel including NG2-FITC, CD31-APC, CD140b-PE, CD146-BV605, CD34-BV421, CD45-PE-Cy7, and cell viability-APC-Cy7 (Table of Materials).",
    "Add one drop of compensation beads (~ 50 µL) from the squeeze vial to each tube. Then add 1 µL of antibody to the beads. Repeat for each antibody from the marker panel. Mix vigorously by pulse-vortexing. Incubate for 30 min at 4 °C protected from light except for the cell viability beads which can be left at room temperature protected from light.\nNext, add 3 mL of FACS staining buffer to each tube and centrifuge at 300 x g for 5 min at 4 °C. Aspirate off solution and resuspend each bead pellet in 400 µL of FACS staining buffer. The compensation controls are ready to be used. Keep on ice.\nUse FMO controls to optimize background staining due to spectral overlap.\n\t\t\nPrepare FMO controls by using 1 mL of cells that was aliquoted from section 4.1 in a 5 mL FACS tube and adding in all antibodies from the marker panel described in step 4.1.1 at a 1:100 dilution but excluding one antibody. For example, prepare an NG2-AF488 FMO by including antibodies for CD31-APC, CD140b-PE, CD146-BV605, CD34-BV421, CD45-PE-Cy7, cell viability dye but not the NG2-AF488 antibody. Mix gently by pulse-vortexing. Repeat for each antibody for a total of 7 controls. Incubate for 30 min at 4 °C protected from light.\nNext, add 3 mL of FACS staining buffer to each tube and centrifuge at 300 x g for 5 min at 4 °C. Aspirate off solution and resuspend each cell pellet in 400 µL of FACS staining buffer. The FMO controls are ready to be used. Keep on ice.\nUse isotype-matched control antibodies (Table of Materials) for nonspecific staining.",
    "Prepare isotype controls by adding the isotype-matched control antibody (Table of Materials) to 1 mL of cell sample prepared from section 4.1 at a 1:100 dilution each in a 5 mL FACS tube. Mix gently by pulse-vortexing. Incubate for 30 min at 4 °C protected from light.\nNext, add 3 mL of FACS staining buffer to each tube and centrifuge at 300 x g for 5 min at 4 °C. Aspirate off solution and resuspend each cell pellet in 400 µL of FACS staining buffer. The isotype controls are ready to be used. Keep on ice.\nPrepare cells to be sorted by adding antibody cocktail to freshly isolated cells.\n\t\t\nPrepare cell sample from section 4.1 by adding in an antibody cocktail containing anti-mouse NG2-AF488, CD31-APC, CD140b-PE, CD146-BV605, CD34-BV421, CD45-PE-Cy7 at 1:100 dilution each and cell viability dye at 1:1,000 dilution. Gently vortex to mix. Incubate samples at 4 °C for 30 min protected from light.\nAfter staining, wash cells with FACS staining buffer by centrifugation at 300 x g for 5 min 4 °C. Aspirate off solution and resuspend the cell pellet in FACS staining buffer to 0.5 x 106 cells/mL.\nUsing new FACS tubes that have 35 µm filter tops, pipette stained cell samples onto the lids and gravity filtrate to obtain single cell suspensions. Keep on ice.\nUse a cell sorter to purify cells.\nRun the unstained cells on the cell sorter to set voltages and correct for the background signal (for example, set voltages for forward scatter to 490−560 and for side scatter to 180−250).",
    "Run each single-color compensation bead sample one at a time to adjust voltages for each channel and adjust gates for the positive signal. Collect data. Use the software to calculate for spectral overlap by calculating the compensation matrix. All voltages are ready and set.\nRun each isotype control one at a time and this data can be used to adjust gates for nonspecific binding if there are any.\nRun each FMO sample one at time and adjust voltages for each channel to correct for spectral bleed through due to a multi-color panel.\nRun the stained cell samples in the cell sorter and collect cells in 10 mL enzyme-free culture media (DMEM + 20% FBS + 1% P/S) in a 15 mL conical collection tube. Use the following gating strategy: gate for single cells, gate for live cells, gate for CD45 negative cells, gate for CD34 and CD31 negative cells, gate for NG2 positive cells, and finally gate for CD146 and CD140b positive cells.\n5. Culturing of Pericytes\nCoat a 24-well plate with 0.2% gelatin for 5 min and aspirate off gelatin solution. Seed freshly obtained cells from step 4.2.5 in DMEM + 20% FBS + 1% P/S up to 2 x 104 cells/cm2. Culture cells in a cell incubator set at 37 °C, 5% CO2 and 95% O2.\nPassaging of pericytes\nOnce the cells are 95% confluent, wash cells with warm 1x DPBS, and lift cells with 200 µL of 0.1% trypsin in each well at room temperature for 3−5 min.\nGently tap the plate to loosen the cells.\nNeutralize the trypsin with 3.5x the amount of culture media (700 µL DMEM + 20% FBS + 1% P/S) and seed passage two (P2) cells onto an uncoated 6-well plate at to 2 x 104 cells/cm2.",
    "Each well, when confluent, can be moved into a single T-75 flask as P3 cells which then can be split at a 1:6 ratio.\n6. Characterization of Pericytes\nFlow cytometry analysis\nUse the same FACS staining protocol and gating strategy as previously described in section 4.\nRun controls and stained samples on the flow cytometer. Collect data and analyze data using the analysis software (Table of Materials).\nTo collect brightfield images, grow cells in a flask in a cell incubator set at 37 °C, 5% CO2 and 95% O2. Capture images on a microscope after cells attach to the surface.\nImmunocytochemistry\nGrow cells in a 96-well plate until 90% confluent. Wash cells with warm 1x DPBS and fix with 4% paraformaldehyde for 30 min at room temperature.\nWash cells 3x with 1x DPBS and permeabilize with 0.1% detergent for 10 min at room temperature.\nIncubate cells with blocking buffer for 1 h at room temperature. After blocking, add primary antibodies (one antibody per well) diluted 1:100 in blocking buffer and incubate at 4 °C overnight. Primary antibodies are: anti-NG2, anti-CD140b, anti-CD31, anti-vimentin, anti-desmin, and anti-alpha smooth muscle actin.\nNext day, wash cells 3x with wash buffer (Table of Materials). Add secondary antibody diluted 1:1,000 in blocking buffer and incubate for 2 h at room temperature in the dark. Secondary antibody is an anti-rabbit conjugated to FITC.\nWash cells 3x with wash buffer. Add 300 µM nuclear stain diluted at 1:1,000 for 5 min at room temperature.\nWash cells 3x with 1x DPBS and mount with mounting media.\nImage cells with a confocal microscope."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}