{
  "id": 7993,
  "origin_website": "Bio",
  "title": "Protein Level Quantification Across Fluorescence-based Platforms",
  "procedures": [
    "Protein purification and concentration validation by SDS-polyacrylamide gel electrophoresis (PAGE) Purify the protein. You will need a purified version of the protein of interest (POI) that you want to study. It can be either untagged or tagged (see General note 3). Due to the many possibilities in protein purification, we will not include a description of the protein purification that we used, which can be found in the manuscript (Zhang et al., 2022).Analyze the purified protein using SDS-PAGE.Prepare dilutions with known quantities (250, 500, 750, 1,000, 1,500, 2,000 ng) of a reference protein (i.e., BSA) for a final volume of 15 μL in H2O.Estimate the concentration of the purified protein by a colorimetric assay (e.g., PierceTM 660 nm Protein Assay Reagent).Prepare specific quantities of the purified protein using the estimations (400, 600, 800, 1,000 ng) to a final volume of 15 μL in H2O.Mix the dilutions of reference protein with 5 μL of loading buffer 4× to a final concentration 1×, boil them in 95 °C for 5 min, and then keep on ice.Mix the different quantities of purified protein with 5 μL of loading buffer 4× to a final concentration 1×, boil them at 95 °C for 5 min, and then keep on ice.Place a polyacrylamide gel in the electrophoresis chamber and fill it with 1× running buffer.Analyze the samples by polyacrylamide gel electrophoresis with constant 100 V.Incubate the gel in Coomassie staining solution overnight (~16 h).Incubate the gel in destaining solution (2× 10 min) and equilibrate in H2O.Image the gel in the imager (Figure 1A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4834/bioprotoc-13-19-4834-g001.jpgFigure 1. SDS-PAGE stained with Coomassie and analysis to validate the concentration of the purified protein. (A) Example of gel for validation.",
    "Known quantities of bovine serum albumin (BSA) are loaded together with different quantities of purified protein of interest (POI) estimated by colorimetric assay. Modified from Zhang et al. (2022). The white dashed line represents the selection used for quantification in B. (B) Intensity profile obtained in ImageJ using the gel analysis tool. Selections of the width of the band were done for individual bands and the area of the band of interest was calculated as the area under the peak. (C) Calibration curve based on the intensity measures obtained in B. The equation of the regression curve is described within the graph. (D) Calculations to obtain the corrected concentration (conc) of the POI, based on the intensity measurements of the POI bands using the equation of the regression curve from B, allow the determination of the corrected amount of POI from the calculated intensity of the band and the concentration in ng/μL as the average from the values obtained, 1624.6 ± 80.3 ng/μL. The values displayed are the calculation from left (POI 400 ng) to right (POI 1000) in the gel shown in A. The calculation of the error is described in the section data analysis. (E) Measurements and standard deviations for three technical replicates, each of them taking four band intensities to calculate the average as shown in D (which corresponds to left replicate).Validate the concentration of purified protein by image analysis of the gel using ImageJ.Generate a rectangular selection that covers a complete band.Create a region of interest using the function Analyze → Gels → Select First Lane (for the first lane) and Analyze → Gels → Select Next Lane (for the others) (Figure 1A, white dashed line).Get the intensity measurements using the function Analyze → Gels → Plot Lanes (Figure 1B).",
    "Quantify the intensity of the bands as the area under the peak (Figure 1B). To do so: i) draw a horizontal lane in the base of the peak using the tool straight line so the peak is closed; ii) use the tool wand to select the peak; iii) automatically, it will display the area of the region selected.Plot the intensity (area) against the known concentration of the reference protein and generate a regression curve (Figure 1C).The equation of the regression curve is Y = a × X + b, being X the quantity of protein (in ng) and Y the intensity. Therefore, considering X = (Y - b)/a, you can calculate the protein amount based on intensity (Figure 1C). The parameter b corresponds to the background of the specific gel.Use the intensity values obtained from the area under the peaks for each estimated amount of POI to get the actual values (Figure 1D).You can get the concentration of the POI by dividing the amount of POI by the volume from the original solution added in each well (Figure 1D). The concentration of POI is the average of these values.Calculation of protein amounts in cell fractions using fluorescence activated cell sorting and western blot Sample preparation: grow the cells in the specific conditions required for its culture. You will need 106–107 cells in a 10 cm cell culture plate from wildtype (untransfected cells) and transfected cells. This step should be adapted to the specific cell line used. In the case of C2C12 using AMAXA electroporation:Seed 50 cells/cm2 in a 10 cm cell culture plate.Grow overnight in growth media at 37 °C with 5% CO2.Remove media.Wash cells with PBS-EDTA.Add 2 mL of trypsin.Incubate for 5 min at 37 °C.Stop the trypsin with 4 mL of growth media.Seed 0.",
    "5 mL of cells into a new 10 cm cell culture plate with 9 mL of growth media (untransfected sample).Centrifuge 1 mL of cells at 0.3× g for 5 min and discard the supernatant.Mix 2–5 μg of plasmid in 100 μL of room-temperature AMAXA M1 solution.Resuspend the pellet in the AMAXA M1 solution containing the plasmid and collect in a cuvette.Place the cuvette in the AMAXA nucleofector and select the program B-032.Collect the cells and seed them in a new 10 cm cell culture plate with 10 mL of growth media (transfected sample).Incubate the untransfected and transfected samples overnight at 37 °C with 5% CO2.Sample processing; the individual plates are processed individually:Wash cells with PBS.Add 2 mL of trypsin.Incubate for 5 min at 37 °C.Collect the cells in a 15 mL tube.Centrifuge at 0.3× g for 5 min and discard the supernatant.Resuspend the pellet in 2 mL of PBS.Centrifuge at 0.3× g for 5 min and discard the supernatant.Resuspend the pellet in 3 mL of PBS.Fluorescence-activated cell sorting (FACS)Analyze the untransfected cells in analysis mode to determine the GFP intensity vs. the area and save the minimum and maximum intensity values. We recommend a count of approximately 106 cells for reproducibility. If the software of the FACS sorter does not provide the values, these can be inferred from the resulting graphs.Analyze the transfected cells in analysis mode with the same settings as the untransfected cells and save the maximum intensity value. We recommend a count of approximately 106 cells for reproducibility. If the software of the FACS sorter does not provide the values, these can be inferred from the resulting graphs.Use the acquired values for calculation of the gates (Table 1). See General note 4.Table 1. Parameters for gate calculation based on intensities.",
    "*The use of logarithm is for presentation purposes and does not affect the following calculations.table:",
    "﻿Parameter,Description,Formula\nMIN,Minimum value of intensity in the untransfected sample,log(min int untransfected)*\nNEG_MAX,Maximum value of intensity in the untransfected sample,log(max int untransfected)*\nPOS_MAX,Maximum value of intensity in the transfected sample,log(max int transfected)*\nBIN,Reference interval (see General note 4),(POS_MAX-NEG_MAX)/40\nPOS_TH,Threshold to define a positive count,MIN + 11 * BIN\nLOW_MIN,Minimum threshold for the category “low”,MIN + 13 * BIN\nLOW_MAX,Maximum threshold for the category “high”,MIN + 22 * BIN\nHIGH_MIN,Minimum threshold for the category “low”,MIN + 24 * BIN\nHIGH_MAX,Maximum threshold for the category “high”,MIN + 33 * BIN",
    "Sort the transfected cells into “low” and “high” based on the intensity values defined by the gates (Figure 2). Collect the cells and save the cell number count.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4834/bioprotoc-13-19-4834-g002.jpgFigure 2. Example of western blot analysis to quantify the amount of protein of interest (POI) in FACS cell fractions. (A) Example of a gel for validation. Known quantities of purified POI are loaded together with lysates of known quantities of cells. Modified from Zhang et al. (2022). (B) Quantification of the bands of the gel using the gel tool analysis from ImageJ to determine the intensity of the purified POI and generate a calibration curve. (C) Combine the intensity measurements of the bands of lysates with the validation curve to obtain corrected amounts of total protein and, knowing the number of cells, the amount of protein per cell.Extraction of total proteins from cells for western blot.Centrifuge the cells from the sorted fractions at 0.3× g for 5 min and discard the supernatant.Resuspend the pellet in 1 mL of lysis buffer with vigorous pipetting to disrupt the membranes.Quantification of the amount of protein in sorted cells by western blot.Prepare known quantities of purified POI (30, 60, 90, 120, 150, 180, 210, and 240 ng) according to the concentration calculated in A. See General note 5.Mix the standard POI and the samples with a 4× loading buffer to a final concentration of 1× and boil them in 95 °C for 5 min. Clear the cell lysates by centrifugation at 10,000× g for 10 min and keep the supernatant on ice.Analyze the fractions by SDS-PAGE as described before in steps A2e–A2f.Prepare transfer buffer 1× by diluting 3 mL of transfer buffer 10× in 27 mL of H2O.",
    "Cut Whatman papers and nitrocellulose membrane in the size of the gel and soak them in transfer buffer 1× for 15 min.Wash the gel in H2O for 10 min.Equilibrate the gel in transfer buffer 1× for 10 min.Assemble the transfer unit into the transfer chamber (from down to up): 2× Whatman, nitrocellulose membrane, gel, 2× Whatman.Remove the bubbles.Transfer the proteins to a nitrocellulose membrane with constant 25 V for 20–45 min.Incubate the membrane in 5% low-fat milk in PBS for 30–60 min at room temperature in a rotator.Incubate with antibodies against your POI in the appropriate dilution overnight at 4 °C in a rotator.Incubate with secondary antibodies linked to a fluorophore in the appropriate dilution in 3% low-fat milk in PBS for 1 h at room temperature in a rotator.Detect the fluorescent signals using the imager (Figure 2A).Measure the intensity in the bands using ImageJ as described before in steps A3a–A3d (Figure 1B).Plot the intensity against the known concentrations to generate a regression curve.Using the equation from the regression curve, calculate the protein amount for the “low” and “high” fractions of sorted cells. The intensities of the POI should be within the (linear) range of the calibration curve.Divide the protein amount by the number of cells analyzed on the gel to obtain the number of molecules per cell.Calculation of concentration (and use across imaging platforms) Sample preparation. Grow the cells in the condition required in substrates suitable for imaging (i.e., chamber slides or coverslips). Follow the procedure described in step B1. See General note 6. The method is suitable for live or fixed cells. In case of fixed cells:Remove media.Wash the coverslips with PBS twice.Incubate coverslips with formaldehyde solution 1:10 in PBS at room temperature for 10 min.Wash the coverslips with PBS three times.",
    "Add a 15 μL droplet of DAPI solution on parafilm and place the coverslips upside down. Incubate for 15 min at room temperature in darkness.Turn the coverslips upside up.Wash the coverslips with PBS three times.Wash the coverslips once with H2O.Add a 10 μL droplet of mounting media on a glass slide and place the coverslips upside down on it.Let it dry in darkness.Generation of calibration curve. See General note 6.Acquire images of the cells in both negative and transfected cells with the same settings for the channel of the POI. Additionally, one can acquire additional channels to facilitate segmentations. In the examples given, we used a second channel with either DAPI (in fixed cells) or a protein that shows nuclear distribution (in live-cell imaging).Segment the cells (or nuclei, in our case) using ImageJ (Figure 3A). In the example given, cells were segmented using the following ImageJ protocol: i) Process → Filters → Gaussian blur…, applying 2 pixels sigma (radius); ii) Process → Subtract background, applying 15 pixels of Rolling ball radius, and all other options not selected; iii) Image → Adjust → Threshold, using “Li” as threshold method. Images were then revised to find nucleus that were too close together and recognized as one to either discard them (when they overlapped) or separate into two regions of interest (when possible).Calculate the total intensity in the channel of the POI for all cells. This value corresponds to the column “IntDen” in ImageJ result table and can be selected in Analyze → Set measurements…→ Integrated density.Calculate the intensity values of the gates as described in Table 1 (Figure 3B).Plot the frequencies of cells in range of the logarithm of intensity (Figure 3C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4834/bioprotoc-13-19-4834-g003.jpgFigure 3. Generation of a calibration curve for different instruments.",
    "(A) Scheme of the minimal analysis required to generate a calibration curve in a new imaging system. (B) Calculation of the gates based on the values of intensity obtained. Bins are calculated as 1/40 of the difference between the minimal (min) and maximal (max) values observed. (C) Examples of curves for the same POI in different imaging systems: FACS (left panel), widefield (middle-left panel), confocal (right-left panel), and single-molecule microscope (right panel). Increasing the number of cells imaged leads to higher resemblance to the curve used for quantifying the protein of interest (POI) by western blot (FACS). FACS, widefield, and single molecule are modified from Zhang et al. (2022). (D) Depiction of the effects of replicates in the generation of the gates. The error bar corresponding to the three biological replicates (with n > 500 each) used to generate the widefield graph in C, including the standard deviation of the calculation of the gates using the single datasets.Check the quality of the calibration curve: all negative cells should be categorized as negative, and cells categorized as high should have a clear signal in the POI channel. See troubleshooting.Calculation of concentration.Acquire Z-stacks that contain the whole cellular structure where the POI is located, following the Nyquist sampling (i.e., in a confocal microscope), including the channel of the POI.Segment the structure (additional channels can be used) and determine the intensity in the POI channel for the volume. See General note 8. In the example given, 3D segmentation was done in Volocity using the DAPI channel using the following protocol: I) Measure → Finding → Find objects; II) Measure → Processing → Dilate (iteration: 3); III) Measure → Processing → Fill holes in objects; IV) Measure → Processing → Erode (iteration: 3); V) Measure → Filtering → Exclude objects by size.",
    "The volume can be calculated from the Voxel count while the intensity is described in Sum, in the table that describes the ROIs.Using the values for the gates of the calibration curve, classify the cells into low and high. See General note 7.Calculate the average volume of the structure in the different categories.The concentration of the POI for each category corresponds to the amount of protein per cell divided by the average volume of the structure for this category."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}