{
  "id": 1984,
  "origin_website": "Cell",
  "title": "GBS-MeDIP: A protocol for parallel identification of genetic and epigenetic variation in the same reduced fraction of genomes across individuals",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis section lists the major steps and provides step-by-step details and timing for each major step.\nDNA extraction\nTiming: 2–4 h\nDNA samples are extracted with Qiagen DNeasy blood and tissue kit (Cat. No. 69504) or any other high-quality DNA extraction kit according to the manufacturer's protocol[href=https://www.qiagen.com/us/resources/download.aspx?id=68f29296-5a9f-40fa-8b3d-1c148d0b3030&lang=en].\nFollow the protocol of Qiagen Dneasy blood and tissue kit.\nMeasure the DNA concentration of the samples using Qubit fluorimeter and perform the necessary dilutions to obtain a minimum final concentration of 15 ng/μL.\nPause point: isolated DNA can be stored at −20°C for use in subsequent steps.\nNote: Run the DNA samples on 1% agarose gel electrophoresis to verify the integrity of the extracted DNA.\nCritical: It is recommended to use the Qubit™ Fluorometric DNA Quantification system (Thermo Fisher Scientific) to measure the DNA concentration, and nanodrop to check purity (a ratio of absorbance at 260 nm vs 280 nm of ∼1.8 is considered optimal). To prepare the Qubit™ reagents, follow the instruction of its kit. It is recommended to consider the results of Qubit™ measurements as the basis for calculating the amount of DNA. The concentrations measured should allow the addition of 400 ng of each individual DNA to be digested with the PstI enzyme within a reaction volume of 30 μl (see below of the detailed components of the PstI digestion reaction).\nDNA denaturation\nTiming: 15–20 min\nIn order to improve the performance of the PstI enzymatic digestion of human genome samples, we added a DNA denaturation step of 95°C for 10 min followed by immersion in ice for 5 min before proceeding with the RE digestion. This step was not needed when using non-human DNA.",
    "Perform DNA denaturation by incubating the samples for 10 min at 95°C. Transfer the DNA samples to ice and maintain for 5 min.\nNote: we recommend performing denaturation in 1.5 mL tubes\nNote: This step is critical when working with human samples, and optional when working with non-human.\nDNA digestion\nTiming: 4–16 h\nNext generation sequencing methodologies use enzymatically or mechanically sheared DNA. Our protocol, however, uses PstI restriction enzyme (RE) to fragment the DNA samples. Our approach starts with an enzymatic cleavage of the genome to produce fragments with overhangs followed by the ligation of barcodes (for posterior identification of individual samples) and Illumina adapters. Initially, we evaluated different REs, both in silico and in vitro, including PstI, MseI, ApeKI, SbfI, MspI, and EcoRI (Pértille et al., 2016[href=https://www.wicell.org#bib7]). Among these enzymes tested, PstI was the most efficient in enriching regions of genomes of our interest (humans, chicken, pig, mouse) in a suitable length size (ranging from 200 to 500 bps) for sequencing. Importantly, PstI recognizes the 5′CTGCAG 3′ motif and cuts the genome in a methylation insensitive manner, as this motif does not contain CpG sites.\nNote: Prepare the PstI enzyme and its buffer as a pre-mix. The pre-mix volume should be calculated considering a larger number of samples to account for pipetting errors. Use 0.2 mL vials (tubes or plate′s wells) for the digestion reactions.\nPrepare a digestion mix according to the indications below for each sample.\nNote: Use reverse pipetting due to the viscosity of the solution.\ntable:files/protocols_protocol_1466_6.csv\nAfter mixing each DNA sample with the digestion reagents, immediately place the vials in a heating block. The recommended incubation time is 3 h for non-human DNA and 16 h for human DNA at 37°C, followed by 20 min at 85°C.",
    "Note: Overnight incubation (16 h) with the PstI RE is optimal for Human samples. When using a plate, we recommend mixing by pipetting rather than vortexing. Overnight digestion can generate uneven evaporation among samples, therefore we recommend drying the samples and then resuspend them in 30 μL of UP water.\nCritical: The enzyme should be inactivated since there is no further purification step before the ligation of the adapters. The inactivation conditions of the PstI used in this protocol (20 min at 85°C) are described in step 5.\nCritical: Assess the digestion of the samples with gel electrophoresis. A homogeneous smear of fragments (QC) is expected for successful digestions. If incomplete digestion is observed in this step, the reaction needs to be optimized.\nCritical: For long-term storage, keep the plate with the remaining digested DNA at −20°C to −80°C. Troubleshooting[href=https://www.wicell.org#troubleshooting]\nPause point: Digested DNA can be stored at −20°C before being used in the next step.\nAdaptor ligation, sample pooling, and purification\nTiming: 6 h\nAfter the DNA is fully digested by the enzyme, two Illumina adapters are added at the ends of each digested DNA fragment. This is a crucial step for the clustering of the Illumina probe within the sequencing flowcell. One of the adapters is called the ‘common adapter’, which is the same for all the samples. The other is called the ‘barcode adapter’, which allows for the later interindividual identification of the sequences through bioinformatic analyses. After the ligation of the adapters, the purification step is performed on the pools and not in the individual samples.",
    "Note: A stock solution (3 ng/μL) of adapters needs to be prepared. This stock solution is further diluted 1:4 with TE water to obtain a working solution of 0.6 ng/μL. Please, look at “Before start 1–3” section for a detailed description of the adapter preparations.\nNote: Before starting the ligation step, register which sample will be assigned to each barcode. To avoid mistakes, it is recommended to use a multi- channel pipette for adding the adaptors. Before pipetting adaptors, vortex the containing plate with the lowest speed and then spin down the content by centrifuging the plate for 30s at low speed.\nIn a PCR plate, mix 3 μL of adapters with 8 μL of each PstI digested DNA samples (∼100 ng of DNA). Vortex the plate at the lowest speed (while the master mix is prepared for the next step) and spin down at around 21°C–22°C.\nNote: the volume of adapters needs to be optimized according to the study species. The QC for this step can only be observed after step 11. For this, 1.5% agarose gel electrophoresis is performed with 1 μl of the amplified DNA to visualize whether adapter dimers were formed (∼120 bps), which should not occur in a successful amplification. Troubleshooting[href=https://www.wicell.org#troubleshooting]\nPrepare a Ligation Master mix according to the following table, considering a larger number of samples to account for pipetting errors. Vortex the plate and spin down for 30 s at around 21°C–22°C.\nNote: use reverse pipetting due to the viscosity of the solution.\nNote: Consider the volume of DNA and adapters added in the previous step to account for a final volume of 30 ul.\ntable:files/protocols_protocol_1466_7.csv\nIncubate the ligation reaction immediately in a heat block for 2 h at 22°C followed by 30 min at 65°C.",
    "Spin down and collect the whole content (30 μL) of each reaction in the PCR plate to make one pool in a 1.5- or 2-mL tube. The purification is then immediately performed using the Qiagen QIAquick PCR purification kit, as described in Box 1[href=https://www.wicell.org#tbox1].\nCalculate the final pool volume.\nTransfer the pool to one 15 mL falcon tube, then add 5 volumes of PB buffer and mix well using vortex.\nPlace the DNA pool in the provided silica filter column and spin. The pool should be divided considering a maximum volume of 750 μL per column and maximum filtering capacity of 1.5 mL per column.\nCentrifuge for 1 min at 10,000×g at around 21°C–22°C.\n∗ Discard the flow through from the collecting tube and repeat step 4, keeping the filter for the next step.\nAdd 750 μL of PE buffer in the column (centrifuge, discard the flow through, centrifuge again and discard the flow through again to ensure that the PE buffer is completely out of the column).\nCritical: Ensure that ethanol (96%–100%) has been added to the PE Buffer\nAdd 30 μL of EB buffer to the center of each column\nIncubate for 1 min at around 21°C–22°C.\nCentrifuge for 1 min at 10,000×g and at around 21°C–22°C.\nAdd 30 μL of EB buffer again.\nIncubate for 1 min at around 21°C–22°C.\nCentrifuge for 1 min at 10,000×g and at around 21°C–22°C.\nMix the contents of all the tubes into one single tube.\nMeasure the DNA concentration with fluorometer (Qubit™).\nNote: If necessary, concentrate the sample using a speed vacuum instrument at 55°C; the maximum volume of the PCR reaction for the next step should not exceed 25 μL.",
    "Note: In case the number of samples per pool is higher than 50, 30 μl of each reaction can be directly transferred to a 15 mL falcon tube.\nPause point: In this step, the sample may be stored in −20°C until the protocol is resumed.\nCritical: For long-term storage keep the samples at −20°C to −80°C.\nGBS-PCR (DNA/barcode ligation QC)\nTiming: 3 h\nAfter PCR purification of the pooled barcoded and ligated DNA samples, a PCR reaction is performed both to i) confirm the ligation of adaptors and barcodes to DNA fragments, and ii) to produce the genomic library (GBS). A recommended PCR protocol is provided bellow:\nPrepare the PCR reaction on ice according to following reagents and immediately perform the amplification in the thermocycler according to the following conditions:\nNote: Optimized PCR mix reaction using the Thermo Scientific Dream Taq DNA Polymerase (EP0703)\ntable:files/protocols_protocol_1466_8.csv\ntable:files/protocols_protocol_1466_9.csv\nCritical: Keep all reagents and samples on ice before starting the PCR; for long-term storage of the PCR product, keep the samples at −20°C to −80°C.\nNote: The GBS-PCR product is not only a validation step for the ligation step but also generates the genomic library for sequencing after a step of PCR purification. The PCR DNA input used here should be at least 50 ng.\nNote: Verify the amplification of the GBS-PCR by running the PCR product and the non- template control on 1.5% agarose gel electrophoresis. Troubleshooting[href=https://www.wicell.org#troubleshooting]\nGBS-PCR purification by using magnetic beads:\nNote: The purification step of the GBS library can be performed together with the purification of the GBS-MeDIP library in step 16. Before starting, keep the Ampure XP beads at around 21°C–22°C for at least 30 min.",
    "Vortex the PCR product and split the content across the wells (0.2 mL) of a PCR plate by adding 10 μL fractions to each well.\nGently shake the magnetic beads tube (Agencourt AMPure XP, Beckman coulter (A63880)) until a homogeneous solution is observed.\nAdd 18 μL of Agencourt AMPure XP to the samples (10 μL of PCR product) in each well and mix 10 times through pipetting.\nIncubate the PCR plate for 5 min at RT for maximum recovery; the color of the mix should be brown.\nPlace the PCR plate on a magnetic bead separation rack and wait for 5 min (keep the plate and rack together until step j)\nDiscard the supernatant being careful to avoid touching the beads\nTransfer 200 μL of ethanol 70% (vol/vol) to each well and incubate for 1 min at RT.\nDiscard the supernatant being careful to avoid touching the beads.\nRepeat the process of washing (for a total of two washes).\nRemove the plate from the magnetic rack and place it at RT until the ethanol is evaporated.\nDilute the samples in 11 μL of miliq H2O while mixing them through pipetting; the color of the mix should turn brown.\nPool the purified GBS-PCR samples together into one well of the plate and maintain this pool for 2 min at around 21°C–22°C.\nPlace the PCR plate again in the magnetic rack for 2 min in order to separate the beads from the reaction.\nTransfer 20 μL of the supernatant to a sterile tube.\nMeasure the concentration of the sample with Qubit™.\nNote: QC: Verify the quality of the library by running 1 μl of purified DNA on a bioanalyzer device and/or by performing electrophoresis on 1.5 % agarose gel.",
    "Pause point: Store the purified sample at −20°C or −80°C until they are sent for NGS.\nMEDIP from GBS libraries\nTiming: 2 days\nThe remainder GBS genomic pool (from which a fraction was used for the amplification of the GBS-PCR) is now subjected to MeDIP. The MeDIP procedure is performed according to a previously published optimization of the method (Guerrero-Bosagna and Jensen, 2015[href=https://www.wicell.org#bib3]).\nNote: keep extra 400 ng of DNA for the GBS library to be used in case of failures during the GBS PCR or purification procedures.\nDay 1\nTiming: 1 h plus around 16 h\nIncubation with anti-methyl cytosine antibody\nAdd TE buffer to the DNA pool (∼5 μg recommended) from step 9 after purification protocol (Box 1[href=https://www.wicell.org#tbox1]), in a final volume of 400 μL in a 1.5 mL tube. In case the volume exceeds 400 μL, dry the sample using speed vacuum.\nHeat-denature the DNA for 10 min at 95°C and then place it on ice for 5 min.\nAdd 100 μL of 5× IP buffer.\nAdd 5 μL of anti-methyl cytosine antibody (2 μg/μL).\nIncubate for 16 h at 4°C under constant rotation.\nCritical: Make sure the tubes are properly sealed.\nNote: Seal the tube lid tightly with parafilm to avoid leaking.\nDay 2\nTiming: 4 h + 2 h (6 h)\nBinding of agarose beads (Protein A/G PLUS-Agarose, Cat#sc-2003) to DNA\nNote: use low protein binding collection tubes to minimize agarose G-protein loss.\nVortex the tube of agarose beads until the solution is uniform; then quickly, before the beads sink again, add 160 μL of the agarose beads to an empty 1.5 mL tube.\nCentrifuge this tube for 2 min at 4500×g and 4°C; discard the supernatant.\nTransfer 500 μL of DNA mixture sample from step (12) to the tube with the concentrated agarose beads.",
    "Incubate for 2 h under constant rotation at 4°C.\nCritical: Make sure the tubes are properly sealed.\nNote: Seal the tube lid tightly with parafilm to avoid leaking.\nCentrifuge the tube for 2 min at 4500×g and 4°C; discard the supernatant.\nAdd 1 mL of 1× IP buffer.\nIncubate for 5 min under constant rotation at 4°C.\nCritical: Make sure the tubes are properly sealed\nNote: Seal the tube lid tightly with parafilm to avoid leaking.\nCentrifuge for 2 min at 4500×g and 4°C; discard the supernatant.\nRepeat the steps “f, g and h” once (for a total of two washes).\nCritical: The number of washes is critical for a successful procedure.\nAdd 210 μL of digestion buffer to re-suspend the beads.\nNote: Because SDS precipitates when stored at 4°C, it is recommended that the solution is re-solubilized by warming it at 37°C for a few minutes, until the solution appears homogeneous. Avoid shaking the bottle of digestion buffer vigorously. Doing so will produce foam.\nAdd 20 μL of proteinase K (20 mg/mL).\nAdd 23 μL of DTT 0.1 M.\nSeal the tube and incubate for 2 h on a rotating platform at 55°C.\nCritical: Make sure the tubes are properly sealed\nNote: Seal the tube lid tightly with parafilm to avoid leaking.\nPurification of the sample\nTransfer the sample from the last step to a Pierce spin-filtering column (Pierce™ Spin Cups, Cat#69700) placed in a 1.5 mL empty tube and centrifuge at max speed for 30 s.\nDiscard the column and keep the flow through.\nAdd 3 μL glycogen (5 mg/mL) to the tube containing the flow through and vortex.\nAdd 20 μL of 5 M NaCl and 750 μL of absolute ethanol and mix well.\nNote: Use ice cold reagents to improve the efficiency of the reaction.",
    "Precipitate the DNA by maintaining the tube on ice for 30 min.\nCentrifuge for 30 min at maximum speed (∼11,000×g) and 4°C, and remove the supernatant.\nCritical: To prevent the pellet disturbance, carefully discard the supernatant.\nAdd 1.5 mL of ethanol 70% to the pellet.\nIncubate for 5 min on a rotating platform at 4°C.\nCentrifuge for 10–15 min at 11,000×g and 4°C and carefully remove the supernatant.\nAdd 1.5 mL of 70% ethanol.\nIncubate for 5 min on the rotating platform at 4°C.\nCentrifuge for 15 min at 11,000×g and 4°C and carefully discard the supernatant.\nPlace the vial in a heating block at 50°C for 5 min to dry the sample.\nAdd 32 μL of UP H2O and mix well.\nIncubate for 5 min in a heating block at 50°C.\nMeasure the concentration of the DNA sample using Nanodrop.\nNote: After the DNA is denatured, the antibody binds to single stranded methylated DNA fragments. Because now most of the DNA will be single-stranded (Ruike et al., 2010[href=https://www.wicell.org#bib14]), measuring the DNA using Qubit™ DS kit will underestimate the real concentration value.\nPause point: MeDIP samples can be maintained at −20°C until further utilization in the PCR reaction.\nTroubleshooting[href=https://www.wicell.org#troubleshooting]\nGBS-MeDIP-PCR reaction\nTiming: 1.5 h\nThe MeDIP captured genomic fraction, which is enriched for DNA methylation, is then PCR amplified. However, only DNA regions containing both adapters are able to be amplified and subsequently sequenced (Poland and Rife, 2012[href=https://www.wicell.org#bib12]). The GBS-MeDIP-PCR is performed using 50 ng of the barcoded and immuno-precipitated (MeDIP) DNA pool as the template (obtained from step 14).\nPrepare the PCR reaction on ice according to following reagents and immediately perform the amplification in the thermocycler according to the following conditions:\nNote: There is no specific reason for using the polymerase enzyme specified here.\ntable:files/protocols_protocol_1466_10.csv\ntable:files/protocols_protocol_1466_11.csv",
    "Critical: Keep all reagents and samples on ice before starting the PCR; for long-term storage of the PCR product, keep the samples at −20°C to −80°C.\nCritical: Load 1 μL of the PCR products on a 1.5% agarose gel and perform electrophoresis to confirm amplification of the expected smear of fragments containing adaptors. Troubleshooting[href=https://www.wicell.org#troubleshooting]\nPurification of PCR products and fragment length assessment\nTiming: 2 h\nPerform PCR purification with magnetic beads as previously mentioned in step 11 (GBS-PCR purification with magnetic beads).\nCritical: Measure the sample concentration with Qubit. The expected concentration is 3–5 ng/μl.\nPause point: Store the purified sample at −20°C until NGS is performed.\nEvaluation of fragment size distribution (QC)\nTiming: 3 h\nIn this step, the sizes of the library fragments are assessed through a fragment analyzer equipment.\nRun 1 μL of the final purified PCR products from each produced library (GBS and GBS-MeDIP) on a bioanalyzer following the manufacturer′s protocol[href=https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf].\nNote: We use the Bioanalyzer (Agilent Bioanalyzer 2100, Invitrogen) with the Agilent High Sensitivity DNA kit (Catalog numb. 5067-4626).\nNote: Both the GBS and GBS-MeDIP libraries are now ready to be sequenced on different lanes using the Illumina platform.\nNext generation sequencing\nTiming: 1 week\nThe libraries obtained after amplification and purification are quantified and paired-end sequenced (125 cycles) using the Illumina platform.\nHiSeq SBS V4 kit is used in the HiSeq2500 Illumina platform following the fabricant pipelines.\nNote: More recently, we have also successfully sequenced our libraries in the NovaSeq sequencer, also from Illumina. Our sequencing is performed at the SNP&SEQ facilities of SciLifeLab (Sweden).\nData processing and alignment\nTiming: 1 day\nAfter sequence, the facility makes the data available in .fastq format",
    "The bioinformatic pipelines applied to the data obtained from the sequencing facility have been previously reported (Pértille et al., 2017a[href=https://www.wicell.org#bib8]; Pertille et al., 2019[href=https://www.wicell.org#bib6]; Guerrero-Bosagna et al., 2020[href=https://www.wicell.org#bib2]; Pértille et al., 2020[href=https://www.wicell.org#bib10], 2021[href=https://www.wicell.org#bib11]).\nNote: A barcoding system is originally used in the GBS method (Poland and Rife, 2012[href=https://www.wicell.org#bib12]), and also in the GBS-MeDIP, which involves the addition of a barcode adapter (in order to identify each one of the individual samples) and a common adapter (suitable for Illumina sequencing) to the individual genomic fragments produced by the PstI digestion. Because of this, the methylation and genomic signals associated to each individual sample can be distinguished after the sequencing process.\nNote: The time spent in data processing is variable and dependents on computational processing power and operator skills. Basic processing of data can be performed in one day (see the ‘data and code availability[href=https://www.wicell.org#da0010]’ section for a stand-alone pipeline, and bioinformatics method description), while subsequent data analysis depends on the hypotheses to be answered and the contrasts to be compared."
  ],
  "subjectAreas": [
    "Genomics",
    "Cancer",
    "Molecular Biology",
    "Clinical Protocol",
    "Sequencing",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}