{
  "id": 8798,
  "origin_website": "Jove",
  "title": "Isolation and RNA Extraction of Neurons, Macrophages and Microglia from Larval Zebrafish Brains",
  "procedures": [
    "1. Sample and Media Preparation\nPrepare embryo medium (E3) by dissolving 6.4 mM KCl, 0.22 mM NaCl, 0.33 mM CaCl2 2H2O, 0.33 mM MgSO4 7H2O in H2O.\nCollect zebrafish embryos immediately after fertilization (0 dpf).\n\t\nSplit zebrafish embryos into 50 per 90 mm petri dish. Raise embryos at 28.5 °C in 50 mL of embryo medium (E3) treated with 200 µM 1-phenyl 2-thiourea (PTU), from the end of the first day of development (0 dpf) for the duration of the experiment to inhibit pigmentation.\nChange the E3 + PTU medium daily for the duration of the experiment.\nScreen mpeg1:eGFP and NBT:DsRed larvae at 2 dpf using a florescent stereomicroscope for the positive transgene expression, GFP+ macrophages/microglia and DsRed+ Neurons.\nPrepare all media the day before the experiment under a tissue culture hood to avoid contamination, then store them at 4 °C.\n\t\nPrepare media A by dissolving 15 mM Hepes and 25 mM D-Glucose in HBSS 1x.\nPrepare density gradient medium (100%) by mixing 9 volumes of the density gradient medium in 1 volume of HBSS 10x.\nPrepare the density gradient medium (22%) by diluting 22 mL of density gradient medium (100%) in 88 mL of DPBS 1x.\nPrepare DPBS 1x.\nPrepare E3 medium + Tricaine by mixing E3 medium with 450 μM Tricaine.\n2. Homogenization\nNote: All steps are performed 4 °C.\nAdd 1.5 mL Tricaine (15 mM) to 90 mm Petri dishes containing 50 larvae in 50 mL of E3 embryo medium treated with 200 µM PTU to terminally anesthetize them.\n\t\nSuck up 10 anesthetized larvae from the petri dishes with a 3 mL Pasteur plastic bulk pipette.\nTransfer anesthetized larvae 10 by 10 into a 55-mm petri dish filled with ice-cold E3 embryo medium + Tricaine.",
    "Under a stereomicroscope, align 10 larvae in the center of the petri dish. Then transect larval heads above the yolk-sac using surgical micro-scissors (exclude swim bladder to avoid floating heads).\nSuck up heads from the petri dishes with a 3 mL Pasteur plastic bulk pipette. Wait until all heads gather within the pipette tip and then transfer them into a glass homogenizer containing 1 mL ice-cold Media A (transfer in a minimal volume to reduce Media A dilution by E3 + Tricaine). Keep the glass homogenizer on ice. Use one homogenizer per experimental condition.\nReplace each small petri dish containing ice cold E3 + Tricaine with a new one every 30 min to assure that transection is performed in cold E3 + Tricaine medium.\nReplace the ice-cold Media A in the glass homogenizer when the color starts fading.\nNote: Media A dilution can alter the head tissue due to temperature changes.\nOnce all heads have been collected ( 600 heads/condition), remove the maximum volume of Media A from the glass homogenizer and replace it with 1 mL of fresh ice-cold Media A.\nDisrupt the brain tissue with a tight glass homogenizer on ice. Perform 40 rounds of crushing and turns for 3-5 dpf larvae and 50 for 7 and 8 dpf larvae.\nAdd 2 mL of Media A to cell suspension (1 mL Media A / 200 heads), that will dilute cells and reduce their agglomeration with myelin to facilitate their separation during the centrifugation in density gradient medium.\n\t\nTo eliminate cell agglomeration, run the cell suspension through a 40 µm cell strainer placed on top of a cold 50 mL falcon tube maintained on ice. Repeat this operation 3 times.",
    "Transfer 1 mL of cell suspension into cold 1.5 mL tubes and spin them at 300 g for 10 min at 4 °C.\nRemove supernatant using a 10-mL syringe + needle 23G x 1''.\nRe-suspend the cell pellet with 1 mL of ice-cold 22% density gradient medium gently overlaid by 0.5 mL of ice-cold DPBS 1x (do not mix them, an interphase between both solutions will be seen).\n\t\nSpin tubes at 950 g without brake and slow acceleration for 30 min at 4 °C.\nNote: This step separates myelin from other cells by sequestering it at the interphase of DPBS 1x and 22% density gradient medium, whereas cells will pellet at the bottom of the tube. Myelin removal is more efficient when cell concentration is not too high.\nUsing a 10-mL syringe + needle 23G x 1'' discard the maximum of DPBS, density gradient medium and myelin trapped at their interphase.\nWash cells with 0.5 mL of Media A + 2% of normal goat serum (NGS), then spin tubes at 300 g for 10 min at 4 °C.\nDiscard the maximum of the supernatant, then pool all cell pellets from the same experimental condition together in 1 mL of Media A + 2% NGS.\nIf the cells of interest express a fluorescent protein like macrophages/microglia from mpeg1:eGFP or neurons from NBT:DsRed transgenic fish (screening of transgenic fish see 1.1.3), run the cell suspension through a 35 µm cell strainer cap and transfer them into a cold 5 mL FACS tubes on ice, protected from light.\nNote: Alternatively, immuno-staining of microglia can be performed.\n3. Microglia Immuno-staining\nNote: All steps are performed at 4 °C.",
    "Re-suspend the cell pellet with 0.3 mL of Media A + 2% NGS. Split them in 3 x 1.5 mL tubes: one for unstained cells to measure auto-fluorescence from cells of interest, second for the secondary antibody (1/200) to measure the non-specific binding of the secondary antibody to microglia and third as a test (4C4 mouse monoclonal antibody (microglia specific) (1/20) + secondary antibody (1/200)).\n\t\nAdd Low Endotoxin, Azide-Free (LEAF) at 1% to cells (all tubes) to block CD16/CD32 interactions with the Fc domain of immunoglobulins. Incubate cells for 10 min with gentle agitation every 5 min.\nAdd the 4C4 antibody (1/20) to cells (tube 3) and incubate for 30 min with gentle agitation every 10 min.\nSpin tubes at 300 g for 10 min at 4 °C, then discard the supernatant.\nWash once with 0.5 mL of Media A + 2% NGS, then spin tubes at 300 g for 10 min at 4 °C.\nRe-suspend cell pellet with 0.5 ml of Media A + 2% NGS and incubate cells with LEAF at 1% for 10 min with gentle agitation every 5 min.\nAdd secondary antibody (1/200) to cells (tube 2 and 3). Incubate cells for 30 min with gentle agitation every 10 min and light protection.\nSpin tubes at 300 g for 10 min at 4 °C, then discard supernatant.\nWash twice with 0.5 mL of Media A + 2% NGS, then re-suspend cell pellet with 1 mL of Media A + 2% NGS.\nRun cell suspension through a 35 µm cell strainer cap and transfer them into cold 5 mL FACS tubes on ice, protected from light.\n4. Cell Sorting (FACS)\nNote: Perform all steps at 4 °C.\nSort neurons, macrophages/microglia and microglia using a FACS.",
    "Note: This step is usually performed by a staff member of the FACS facility and settings depend on the type of equipment used.\n\t\nAdd DAPI at a concentration of 1 µg/mL in each FACS tube to label dead cells.\nSet up FACS and sort neurons, macrophages/microglia or microglia from all brain cells. Separate cells from debris in function of their size and granularity, then gate single-cells by forward scatter and side scatter. Exclude dead cells by DAPI labelling from live cells. Identify neurons, macrophages/microglia or microglia by their respective positive staining.\nCollect cells in 1.5 mL tubes containing 1 mL of ice-cold Media A + 2% NGS on ice. Use different tubes for each cell type.\n\t\nSpin tubes at 300 g for 10 min at 4 °C and then discard the supernatant.\nWash once with 0.5 mL of Media A then discard the maximum of supernatant.\n5. RNA Extraction\nExtract RNA from the different cell types separated by FACS. For RNA extraction use a specific kit and follow the manufacturer's guidelines. Ensure to work in an RNase free environment by cleaning workspace and pipettes with a RNase decontamination product and use filter tips.\n\t\nFreshly prepare 1 mL of lysis buffer supplemented with 50 µM β-mercaptoethanol.\nNote: Here, β-mercaptoethanol is added to reduce RNA degradation.\nPrepare 70% and 80% ethanol solution using RNase free water.\nLyse cells with 75 µL of lysis buffer supplemented with 50 µM β-mercaptoethanol. Then use a shredder to improve cell disruption.\nContinue RNA extraction according to manufacturer's manual.\nAt the end of the protocol, elute the RNA with 14 µL of RNase free water to obtain a sufficient RNA concentration."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}