{
  "id": 8639,
  "origin_website": "Jove",
  "title": "Conversion of Human Induced Pluripotent Stem Cells (iPSCs) into Functional Spinal and Cranial Motor Neurons Using PiggyBac Vectors",
  "procedures": [
    "1. Maintenance of Human iPSCs\nPreparation of matrix-coated plates\nThaw one 5 mL vial of matrix (see Table of Materials) at 4 °C overnight. The original matrix stocks come at different stock concentrations and aliquots are made according to the dilution factor indicated on the datasheet, specific for the individual lot. It is important to keep the vial and tubes ice cold to prevent premature gelling of the matrix. Dispense matrix into aliquots in pre-chilled cryotubes on ice. Freeze unused aliquots at -20 °C.\nPlace one aliquot on ice for about 2 h to thaw.\nDilute the aliquot of matrix with 20 mL of cold DMEM/F12 in a 50 mL conical tube.\nMix well and dispense 1 mL of diluted matrix into 35 mm dishes (equivalent amounts per surface area of other dishes).\nKeep the dishes containing diluted matrix for 1 h at room temperature to allow coating.\nNOTE: Dishes, sealed with parafilm, can be stored at 4 °C for up to 2 weeks.\nPreparation of the stock solution (20 mL) and 1x working aliquots of the gentle cell dissociation reagent (see Table of Materials).\n\t\nDissolve powder to 10 mg/mL in PBS (Ca2+/Mg2+ free).\nFilter sterilize through a 0.22 μm filter membrane.\nPrepare 20 aliquots (1 mL each) and store at -20 °C.\nBefore use, dilute one aliquot in PBS (Ca2+/Mg2+ free) to 1 mg/mL (1x working aliquots).\nNOTE: 1x working aliquots can be stored at 4 °C for up to 2 weeks.\nPassaging human iPSCs.\nBefore starting: If stored at 4 °C, pre-warm matrix-coated plates in the incubator at 37 °C for 20-30 min. Pre-warm at room temperature the amount of human iPSC medium (see Table of Materials) needed. Pre-warm the DMEM/F12.\nAspirate culture medium.\nRinse iPSCs with PBS (Ca2+/Mg2+ free).",
    "Add 1x gentle dissociation solution (0.5 mL for a 35 mm dish). Incubate at 37 °C until the edges of the colonies begin to detach from the plate, usually 3-5 min.\nAspirate the gentle dissociation solution, being careful not to detach iPSC colonies.\nWash the cells with DMEM/F12 (2 mL for a 35 mm dish) and aspirate being careful not to detach the cells. Repeat this step one more time.\nAdd human iPSC medium (1 mL for a 35 mm dish).\nGently detach the colonies off with a cell lifter and transfer to a 15 mL tube.\nGently break cell clumps by pipetting up and down with a P1000 pipettor 3-4 times.\nAspirate the supernatant from the matrix-coated plate(s).\nSeed the cells in the appropriate culture volume of human iPSC medium. The split ratio can vary from line to line and is about 1:4-1:8. Change the medium daily.\n2. Generation of NIL and NIP Inducible iPSC Lines\nCell transfection.\nRinse the cells with PBS (Ca2+/Mg2+ free).\nAdd cell dissociation reagent (see Table of Materials) (0.35 mL for a 35 mm dish) and incubate at 37 °C until single cells are separated (5-10 min).\nGently complete cell separation by pipetting up and down with a P1000 pipettor 3-4 times.\nCollect in a 15 mL tube and add PBS (Ca2+/Mg2+ free) to 10 mL. Count the cells.\nPellet 106 cells and resuspend in 100 μl of Buffer R (included in the cell electroporation kit, see Table of Materials).\nAdd plasmid DNA for transfection: 4.5 μg of transposable vector (epB-Bsd-TT-NIL or epB-Bsd-TT-NIP12) and 0.5 μg of the piggyBac transposase plasmid13.",
    "Transfect with the cell electroporation system (see Table of Materials) according to manufacturer’s instructions and as previously described3 with the following parameters: 1,200 V voltage, 30 ms width, 1 pulse. Seed the cells in human iPSC medium supplemented with 10 μM Y-27632 (ROCK inhibitor, see Table of Materials) in a 6 mm matrix-coated dish.\nSelection with antibiotics.\nTwo days after transfection, add 5 μg/mL blasticidin to the culture medium.\nMost of the non-transfected cells will die within 48 h of blasticidin selection. Keep the cells in blasticidin for at least 7-10 days to counter-select the cells that have not integrated the transgenes in the genome.\nMaintain stably transfected cells as a mixed population, composed of cells with different number of transgenes and different integration sites, or isolate single clones.\nPrepare an additional dish to check for effective expression of the transgenes, upon 1 μg/mL doxycycline induction, by RT-PCR with transgene-specific primers for Ngn2 (Forward: TATGCACCTCACCTCCCCATAG; Reverse: GAAGGGAGGAGGGCTCGACT), as previously described12.\nAt this stage, freeze stocks of the novel NIL- and NIP-iPSC lines in freezing medium for human iPSCs (see Table of Materials).\n3. Motor Neuron Differentiation\nDissociate the cells with cell dissociation reagent as described (steps 2.1.1.-2.1.3.). Collect dissociated cells in a 15 mL tube and dilute with 5 volumes of DMEM/F12. Pellet the cells and resuspend in human iPSC medium supplemented with 10 μM ROCK inhibitor. Count the cells and seed on matrix-coated dishes at a density of 62,500 cells/cm2.\nThe day after, replace the medium with DMEM/F12, supplemented with 1x stable L-glutamine analogue, 1x non-essential amino acid (NEAA) cell culture supplement and 0.5x penicillin/streptomycin, and containing 1 μg/mL doxycycline. This is considered as day 0 of differentiation. On day 1, refresh the medium and doxycycline.",
    "On day 2, change the medium to Neurobasal/B27 medium (Neurobasal Medium supplemented with 1x B27, 1x stable L-glutamine analogue, 1x NEAA and 0.5x penicillin/streptomycin), containing 5 μM DAPT, 4 μM SU5402 and 1 μg/mL doxycycline (see Table of Materials). Refresh the medium and doxycycline every day until day 5.\nDay 5: Cells dissociation with cell dissociation reagent (see Table of Materials).\n\t\nRinse the cells with PBS (Ca2+/Mg2+ free).\nAdd cell dissociation reagent (0.35 mL for a 35 mm dish) and incubate at 37 °C until the entire cell monolayer separates from the dish. Note that single cells will not be separated during incubation.\nAdd 1 mL of DMEM/F12 and collect the cells in a 15 mL tube.\nGently complete cell separation by pipetting up and down with a P1000 pipettor 10-15 times.\nAdd 4 mL of DMEM/F12 and count the cells.\nAt this stage, freeze motor neuron progenitors in cell freezing medium (see Table of Materials), according to manufacturer instructions.\nPellet the cells and resuspend in Neuronal Medium (Neurobasal/B27 medium supplemented with 20 ng/mL BDNF, 10 ng/mL GDNF and 200 ng/mL L-ascorbic acid, see Table of Materials) supplemented with 10 μM ROCK inhibitor.\nSeed the cells on poly-ornithine/laminin- or alternatively on matrix-coated supports at the density of 100,000 cells/cm2. Use µ-Slide plastic supports with polymer coverslip (see Table of Materials) for immunostaining analysis.\nOn day 6, change the medium with fresh Neuronal Medium devoid of ROCK inhibitor. On the next days, refresh half of the medium every 3 days. Culture medium must be changed very carefully in order to prevent detachment from the surface.\n4. Immunostaining Analysis\nCell fixation. Rinse the cells with PBS (with Ca2+/Mg2+) and incubate for 15 min in 4% paraformaldehyde in PBS (with Ca2+/Mg2+) at room temperature.",
    "CAUTION: Paraformaldehyde is toxic and suspected to cause cancer. Avoid contact with skin and eyes and handle under a chemical fume hood.\nPermeabilize with PBS (with Ca2+/Mg2+) containing 0.1% Triton X-100 for 5 min at room temperature.\nIncubate for 30 min at room temperature in antibody blocking solution (ABS: 3% BSA in PBS with Ca2+/Mg2+).\nIncubate for 1 h at room temperature with primary antibodies in ABS: anti-TUJ1 (1:1000; rabbit) and anti-Oct4 (1:200; mouse) or anti-CHAT (Anti-Choline Acetyltransferase; 1:150; goat). See Table of Materials.\nIncubate for 45 min at room temperature with appropriate donkey secondary antibody pair in ABS: anti-mouse Alexa Fluor 647 (1:250), anti-rabbit Alexa Fluor 594 (1:250) and anti-goat Alexa Fluor 488 (1:250). See Table of Materials.\nIncubate in 0.4 μg/mL DAPI for 5 min at room temperature to label nuclei.\nMount the cells with Mounting Medium (see Table of Materials) for imaging at a fluorescence microscope.\n5. Functional Characterization via Patch-clamp Recordings\nPrepare the HEPES-equilibrated external solution (NES) as following: 140 mM NaCl, 2.8 mM KCl, 2 mM CaCl2, 2 mM MgCl2, 10 mM HEPES, and 10 mM glucose. Set the osmolarity between 290-300 mΩ. Adjust the pH to 7.3 using 1N NaOH and store the solution at 4 °C.\nPrepare the internal solution: 140 mM K-gluconate, 2 mM NaCl, 5 mM BAPTA, 2 mM MgCl2, 10 mM HEPES, 2 mM Mg-ATP, 0.3 mM Na-GTP. Adjust the pH to 7.3 with 1M KOH and check that the osmolarity is set at around 290 mΩ. Freeze the solution at -20 °C in small aliquots.\nBefore running the experiments, pre-warm the NES solution in a water bath to about 28-30 °C.\nPull some borosilicate micropipettes (ID 0.86 mm; OD 1.5 mm) bearing a tip resistance: 5-6 MΩ and fill with the intracellular solution before mounting into the pipette holder.",
    "NOTE: Remember to chloride silver wires of the recording electrode and reference electrode in bleach for at least 30 min in order to form a uniform layer of AgCl on the wire surface.\nTransfer the Petri dish in the recording chamber and let the chamber with the NES solution at 1-2 mL/min. Let the flow passing through an inline heater set at temperature of 30 °C in order to keep the solution warm.\nPlace electrophysiological recording chamber under an upright microscope. Record membrane currents with the patch-clamp amplifier and acquire data with an appropriate software.\nOpen the amplifier control software, and set the signal gain at value 1 and the Bessel filter at 10 kHz. Ensure that the Bessel filter is 2.5 times lower than the sampling frequency.\nSet the experimental protocols for voltage-clamp and current-clamp experiments in the recording software.\nIn the protocol setting, tick episodic stimulation mode and set the sampling frequency at 25 kHz. Then, move to the waveform tab and type the voltage or current step amplitude and length as follow.\nFor the voltage-gated sodium currents, use 15 voltage steps (50 ms duration each) from -100 mV to +40 mV (10 mV increment). Run the protocol after imposing to the patched cell a holding potential of -60 mV through the amplifier. Similarly, the voltage-gated potassium currents are evoked by voltage steps (250 ms duration each) from -30 mV to +50 mV (10 mV increment) holding the recorded cell to -40 mV.\nFor investigating the firing properties of iPSC-derived cranial and spinal MNs, clamp cells, in current-clamp mode, at a membrane potential of -70 mV and use 4 current pulses (1 s duration each) of increasing amplitude (from +20 pA to +80 pA; 20 pA increment).",
    "Acquire for each cell voltage-activated currents, evoked firing activity and three passive properties as whole-cell capacitance (Cm), cell membrane resistance (Rm) and Resting Membrane Potential (RMP).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}