{
  "id": 13610,
  "origin_website": "Jove",
  "title": "Quantifying Learning in Young Infants: Tracking Leg Actions During a Discovery-learning Task",
  "procedures": [
    "The Institutional Review Board at the University of Southern California approved this study.\n1. System Preparation\nSet up the motion capture system. Please note: these steps are different for each motion capture system.\n\t\nAlign the coordinate systems of the two motion capture sensors to that of one sensor by clicking “Perform New Registration” in the motion capture program, entering a collection time of 30 sec, clicking “Register,” and moving the registration object within the capture volume for 30 sec. When registration is successfully completed, observe a root mean square (RMS) registration error on the computer screen.\nAlign the global coordinate system to the testing table using the registration object by clicking “Perform New Alignment” in the motion capture program.\n\t\t\nDefine the origin by placing the registration object on the upper right corner of the testing table and clicking “Digitize” in the motion capture program. Define the Z-axis by placing the registration object on top of a box and clicking “Digitize”; the Z-axis is perpendicular to the table.\nDefine the Z/Y+ plane by moving the registration object on the box along the length of the table and clicking “Digitize”; the Y-axis is parallel to the length of the table and the X-axis is parallel to the width of the table.\nPlug the LEDs into the two strobe ports and enter the number of LEDs per strobe port within the motion capture system program (24 for strobe port 1 and 20 for strobe port 2). Refer to Figure 3 for the number and location of each LED. Select missing data view to provide a strip chart-like display of LEDs being tracked in real time.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/52841/52841fig3.jpgFigure 3. Placement of LEDs. Strobe 1 consists of the rigid bodies (4 LEDs on each rigid body) for the right and left thigh, shank, and foot. Strobe 2 consists of the rigid bodies for the right and left pelvis, the sternum markers, and the individual LEDs.\nSet up the infant mobile computer program.\n\t\nInput the number of minutes for each condition. For Day 1, input 2 for phase 1 (2 min baseline, non-reinforcement condition), 6 for phase 2 (6 min acquisition, reinforcement condition), and 0 for phase 3 (0 min extinction, non-reinforcement condition).\nFor Day 2, input 2 for phase 1 (baseline), 6 for phase 2 (acquisition), 2 for phase 3 (extinction), and check “Use Zmin as Default” so that the threshold computed during baseline of Day1 will be the threshold used for the acquisition condition of Day 2.\nChoose “StreamframesAllFrames” and click “Send” to enable the mobile program to use data from the motion capture system to activate the infant mobile based on specified criteria.\nSet up the video cameras.\n\t\nInitiate the video computer program for the three synchronized videos (right lateral, left lateral, overhead views).\nStart the additional video camera over the infant’s head to record facial expressions and eye gaze.\n2. Infant Preparation\nDescribe the experiment to the parents and inform them to interact as little as possible with their infant.\n\tNOTE: Tell the parents that if the infant does not become fussy throughout the experiment, the parents should sit beside the infant outside of their view, however, if the infant becomes fussy there is a progression of interaction with the infant.\n\t\nFirst, ask the parent to say, “Everything is okay, I’m right here,” in a reassuring tone.\nSecond, ask the parent to stand in the infant’s view while reassuring the infant.",
    "Third, ask the parent to either hold one of the infant’s hands or give the infant a pacifier.\n\t\tNOTE: The least amount of parent interaction necessary to keep the infant calm and alert is given and is ended as quickly as possible.\nUndress the infant, place the infant under the infant mobile, and secure the infant to the table using a Velcro band placed across the trunk.\nAfter the infant is secured to the table, place the sternum markers and pelvic, thigh, shank, and foot rigid bodies on the infant.\n3. Infant Mobile Learning Task\nEach day, initiate the mobile learning task by synchronously starting the motion capture system, mobile computer program, and video cameras.\n\t\nOn both days from min 0 to 2, the baseline condition, observe the infant spontaneously kicking.\nOn Day 1 during the 2 min baseline condition, observe as the infant mobile program continuously computes the threshold for mobile activation based on the z-data from one of the LEDs on the rigid body of each foot. Example, marker 9 on the right foot and marker 21 on the left foot. Marker 9 is the center LED on the right foot rigid body circled in yellow in Figure 1. Marker 21 is the center LED on the left foot rigid body.\nAt the end of the 2 min baseline, the mobile program will set the threshold at a height of one standard deviation (SD) above the average height of both feet during the 2 min baseline condition.\nOn both days from min 2 to 8, the acquisition condition, observe as the infant mobile rotates and plays music when the LED placed on either foot crosses the threshold computed during the 2 min baseline condition of Day 1.",
    "NOTE: Mobile activation will continue for as long as the foot is above the virtual threshold to a maximum of 3 sec. After 3 sec, the mobile will reactivate only if the infant moves the foot below the virtual threshold, and then moves the foot vertically and again crosses the threshold. This “3 sec rule” encourages active leg exploratory movements versus holding the feet above the threshold.\nOn Day 2 from min 8-10, the extinction condition, observe as the infant kicks spontaneously without mobile reinforcement.\nAfter the infant interacts with the mobile, collect a static calibration trial to define a local coordinate system for each leg segment and define a reference configuration for each body segment in space.\n\t\nFix ten individual LEDs bilaterally to the infant’s skin using double-sided EKG collars at the following locations: lateral midline of the trunk below the tenth rib, greater trochanter of the hip, lateral knee joint line, ankle lateral malleolus, and distal end of the 5th metatarsal.\nHold the infant’s lower extremity in an extended, anatomical position for 5 sec. All joint angles in this calibration position are defined as 0°.\nOn Day 2, collect anthropometric data.\n\t\nWeigh each infant on a digital electric scale.\nTake the following measurements: total length of the infant; circumference at mid-segment of thigh, shank, and foot; width of knee (at the knee joint line), ankle (at the malleoli), and foot (at the metatarsal heads); and length of the thigh (greater trochanter to knee joint line), shank (knee joint line to lateral malleolus), and foot (medial malleolus to first metatarsophalangeal joint).\n4. Data Analysis",
    "Analyze performance and learning by computing the %RLA during each 2 min interval of the experiment using a custom computing language program such as Matlab. Compute the duration of time one or both of the LEDs on each foot that activated the mobile were above the threshold. Since the mobile does not activate after an interval of 3 sec, subtract the duration of time in which one or both LEDs were above the threshold for greater than a 3 sec interval.\n\t\nMeasure performance of the group each day by statistically analyzing whether the %RLA during any one of the three, 2 min acquisition intervals significantly exceeds the 2 min baseline interval3,4,7,9,10.\nCategorize individual infants as having performed the task each day if the %RLA during any one 2 min acquisition interval is equal to or greater than 1.5 times the %RLA in the 2 min baseline interval3,4,6,9,10.\nMeasure learning of the group across days by determining statistically whether the %RLA during the entire 6 min acquisition condition Day 2 exceeds the %RLA during the baseline condition Day 13,6.\nCategorize individual infants as Learners if the %RLA during the entire 6 min acquisition condition of Day 2 is equal to or greater than 1.5 times the baseline condition of Day 13,6,11.\nAnalyze arousal and attention by coding videotapes during each 2 min interval of the experiment. The arousal scale is defined as: drowsy = 1, alert and inactive = 2, alert and active = 3, fussy = 4, and crying = 53,8,11. The attention scale is defined as: 0 = not looking at the mobile, 1 = looking at the mobile3,8.\nProcess position data and extract kicks using custom Matlab programs.",
    "Load position data files outputted from the motion capture system into a custom Matlab program to interpolate missing position data (maximum of 20 consecutive frames) using a cubic spline.\nLoad the interpolated files into a custom Matlab program to (a) filter position data using a fourth-order Butterworth with a cut-off frequency of 5 Hz as determined from power spectrum analysis, and (b) compute the following joint angles: hip flexion/extension, hip abduction/adduction, hip external/internal rotation, knee flexion/extension, ankle inversion/eversion, ankle dorsiflexion/plantarflexion as described in 12.\nLoad the angle files into a custom Matlab program to extract kicks. Define the beginning of a kick as the onset of a continuous leg movement in which the hip or knee joint angle change exceeded 11.5° (0.2 radians) into either flexion or extension3,9,13-15. Define the end of the kick as the frame of peak extension following a flexion movement or peak flexion following an extension movement3,9,14.\nFor all kicks, compute kinematic parameters using custom Matlab programs.\n\t\nCompute position variance in the z-direction (vertical, task-specific direction) of the LED on each foot that activated the mobile3.\nCompute hip flexion/extension and knee flexion/extension joint correlations using Pearson correlation coefficients (r) at zero lag between hip and knee joint angle excursions. To compare correlations (r) among infants, convert hip-knee joint angle correlations to Fisher Z scores3,9,15.\nTime-normalize the joint angle data, then compute hip flexion/extension and knee flexion/extension continuous relative phase (CRP) from the angular position/velocity data16,17. Analyze the results of the CRP computation at the following five time points: (a) beginning of kick, (b) peak velocity of the first segment, (c) joint reversal, (d) peak velocity of the second segment, and (e) end of kick3.\nFor all kicks, identify non-contact kicks by viewing the synchronous video data. Compute kinetic parameters for non-contact kicks using custom Matlab programs.",
    "Compute the segmental mass and center-of-mass from equations modified for infants from Hatze’s anthropometric model for adults18. Compute the 3D moments of inertia of the thigh, shank, and foot segments from equations modified for infants from Jensen’s anthropometric model for adults19.\nCalculate the terms in the following equation of motion using the screw theory of spatial manipulations20.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52841/52841equation1.jpg\n\t\tis derived using the Lagrangian approach, where M(θ) is the inertia matrix, imgsrc://cloudfront.jove.com/files/ftp_upload/52841/theta1.jpg the Coriolis and centrifugal torque matrix, N(θ) the gravitational (GRA) torques and T the muscle (MUS) torques.\nCompute joint torques using the 3D kinematic data from the non-contact kicks, body-segment inertial parameters, and the biomechanic equation of motion.\nPartition the net (NET) torque at each joint into motion-dependent (MDT), GRA, and MUS torque contributions21. NET torque is directly proportional to the accelerations at each joint. MDT torque is related to the passive torques associated with mechanical interactions among the moving interconnected segments of the limb. GRA torque is related to the passive force of gravity acting downward on the limb. MUS torque includes forces from active muscle contractions and passive deformations of muscles, tendons, ligaments, and other periarticular tissues.",
    "For the hip and knee separately, compute torque impulse as the magnitude of the contribution of each partitioned torque (MUS, GRA, MDT) to NET torque. Compute the positive or negative torque impulse (torque * time) during intervals in which the knee MUS torque acted in the same or opposite direction compared with the knee NET torque. Perform this same computation with knee GRA and MDT torques and hip MUS, GRA, and MDT torques. For the hip and knee separately, sum all positive and negative impulses for each torque component to yield a measure of the magnitude of the contribution of each partitioned torque impulse (MUS, GRA, MDT) to NET torque impulse.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}