{
  "id": 6497,
  "origin_website": "Bio",
  "title": "Imaging Gene Expression Dynamics in <em>Pseudomonas fluorescens</em> In5 during Interactions with the Fungus <em>Fusarium graminearum</em> PH-1",
  "procedures": [
    "Selection of target gene and construction of reporter strainsThe first step of this protocol is to select a gene of interest (GOI) for gene expression analysis. Once selected, the promoter region located upstream of the GOI is PCR-amplified and cloned in front of a fluorescent protein-encoding gene. The promoter region (400 bp) upstream of the start codon is PCR-amplified using a high-fidelity polymerase and primers introducing overhangs to enable Gibson Assembly® cloning (Gibson et al., 2009) into the target plasmid.PCR to amplify promoter region located upstream of target geneThaw the Phusion kit reagents and thoroughly mix after thawing.Make a 2x Phusion High-Fidelity (HF) DNA Polymerase PCR master mix using the following recipe:20 μl Phusion HF Buffer2 μl 10 mM dNTPs1 μl DMSO2 μl forward primer (10 μM) (5′-CACAGGAGGCCGCCTAGGCCGCGGCCGCGCGAATTCGCCGACCGTTGGTCGGCTTTGTC-3′)2 μl reverse primer (10 μM) (5′-GCTTGCATGCCTGCAGGTCGACTCTAGAGGATCCAAGCCTGCATACCAAAATCGCTG-3′)1 μl Phusion HF Taq Polymerase70 μl Nuclease-free waterDispense 49 μl of 2x Phusion PCR master mix into sterile 0.5 μl PCR tubes and add 1 μl genomic DNA (50 ng μl-1) purified from P. fluorescens In5 as previously described (Dichmann et al., 2018).PCR program:a.98 °C 30 sb.98 °C 10 sc.62 °C 15 sd.72 °C 15 se.Repeat steps b-d, 30xf.72 °C 10 minNote: Recommended running a water blank to ensure amplified bands are not due to contaminants in the PCR reagents. PAUSE POINT: PCR products can be stored at 4 °C or -20 °C.Preparation of reporter plasmid for Gibson assembly® cloningDigest plasmid DNA of the reporter plasmid pSEVA237R (Hennessy et al., 2017a) harboring a gene encoding the red fluorescent marker mCherry using the restriction enzymes BamHI-EcoR1. Once digested, purify the digested plasmid DNA using the Promega Gel extraction kit according to the manufacturer’s instructions.Set up a Gibson assembly® reaction on ice according to the manufacturer’s instructions.",
    "Incubated the Gibson assembly® reaction for 1 h at 50 °C without shaking. Thaw 50 μl of E. coli DH5α chemically competent cells on ice for 30 min and add 5 μl of Gibson assembly® mix and incubate cells for further 30 min on ice. Heat-shock cells using either a water bath for 45 s at 42 °C or a heat block warmed to 42 °C for 90 s. Add 250 μl of SOC outgrowth medium to the heat-shocked cells and incubate shaking 200 x g at 37 °C for 1 h.Plate 100 μl and 200 μl on LBA supplemented with kanamycin (50 μg/ml). Isolate antibiotic resistant colonies into 10 ml LB supplemented with kanamycin (50 μg/ml) and incubate shaking 200 x g overnight at 37 °C.Purify plasmid DNA and digest using BamHI-EcoR1 to identify positive clones.Perform DNA sequencing to confirm the integrity of the DNA. Once the plasmid DNA is confirmed by sequencing, it can be transformed into P. fluorescens In5.Transformation of P. fluorescens In5 with the reporter plasmid pSEVA237R::PGOI Inoculate P. fluorescens In5 in 10 ml LB broth shaking 200 x g overnight at 28 °C.Centrifuge 6 ml of overnight culture at 4,000 x g for 5 min at 20 °C.Wash cells three times each with 4 ml 300 mM sterile filtered sucrose.Resuspend the washed bacterial pellet in 400 μl of 300 mM sterile filtered sucrose.Add 300-500 ng plasmid DNA from each construct: tester plasmid (pSEVA237R::PGOI) and empty vector control (pSEVA237R) to 100 μl competent cells.Transfer mixture to 2 mm gap width electroporation cuvette. Apply a pulse (25 μF, 200 Ω, 2.5 kV) in the electroporation apparatus. Add 1 ml LB at room temperature.Transfer mixture to a 2 ml Eppendorf tube.Shake mixture at 200 x g 2 h at 28 °C.",
    "Isolate antibiotic resistant colonies into 10 ml LB supplemented with kanamycin (50 μg/ml) and incubate shaking 200 x g overnight at 28 °C.Purify plasmid DNA and digest using BamHI-EcoR1 to identify positive clones.Note: Recommend adding no DNA to 100 μl competent cells as a negative control. If a lawn appears on transformed plates but not on the negative control plate, streak cells onto a fresh LBA kanamycin (50 μg/ml) plate and incubate overnight with no shaking at 28 °C to isolate single antibiotic-resistant colonies.Pre-culturing of F. graminearum PH-1 and P. fluorescens In5Using a sterile cork borer, transfer a 6 mm Ø sized plug of F. graminearum PH-1 onto DFM media prepared as previously described (Hennessy et al., 2017b) and incubate for 5 days at 28 °C.Inoculate P. fluorescens In5 harboring either pSEVA237R::PGOI or pSEVA237R in 10 ml LB broth supplemented with 50 μg ml-1 kanamycin (antibiotic selectable marker on pSEVA237R backbone) and incubate shaking 200 x g overnight at 28 °C.Establishment of bacterial-fungal interaction on solid surfaceAdd 35 ml of DFM agar to a sterile NuncTM OmniTrayTM. Place 10 plugs of F. graminearum PH-1 (6 mm Ø) down the center of the plate in a straight line. Using a 10 μl sterile loop streak the bacterial reporter strains 3 cm away from the fungal plugs. Allow bacterial streaks to dry on the surface.Experimental set-upThe bacterial reporter strains and fungus are then co-cultured in the microplate reader, programmed to simultaneously measure red and green fluorescence respectively in addition to cell density (Figures 1 and 2). For step-by-step instructions for defining plates and time-series recording of images using the plate reader software BMG Omega Mars Software see Hennessy et al. (2017b).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190613/20190613194431_5128.jpgFigure 1. Schematic of experimental setup. A.",
    "Plate reader programmed to measure fluorescence and cell density and serves as an incubator to co-cultivate microbes at selected temperatures. B. 96-well microplates exchanged for OmniTray enabling the addition of agar medium providing a solid surface for interactions. C. Bacterial reporter strains are constructed whereby the promoter region located upstream of a gene of interest is cloned in front of a gene encoding a fluorescent protein (e.g., mCherry) to measure gene transcription in living cells. D. Biological interaction is established where fungal plugs are placed down the center of the OmniTray and bacterial reporter strains streaked either side of the fungal plugs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190613/20190613194501_8773.jpgFigure 2. Schematic of scanning function. A script can be written to instruct the plate reader to measure multiple parameters simultaneously (A) and perform a scanning function “imaging” a specific area of the plate measuring gene expression and growth. Bacteria streaked on the left-hand side of the fungal strains is the reporter strain (pSEVA237R::PGOI) and the bacterial streak on the right-hand side of the fungal plugs is the control strain (pSEVA237R). “Well map” is shown using a rainbow (blue-green-yellow-red) representation of intensities of signals for one of the protocols from low to high (B)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}