{
  "id": 7757,
  "origin_website": "Bio",
  "title": "<em>Sclerotinia sclerotiorum Protoplast</em> Preparation and Transformation",
  "procedures": [
    "Culturing and enrichment of  S. sclerotiorum  mycelium  Cut the PDA medium (see Recipes) where  S. sclerotiorum  grew on for three days into mycelium blocks (about 1 mm length × 1 mm width) (Figure 1). Note: The ideal cutting area is preferably at the edge of the fungal colony, where S. sclerotiorum hyphae actively grow.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4581/bioprotoc-13-01-4581-g001.jpg Figure 1. The ideal cutting area  Collect the mycelium blocks into a 250 mL conical flask containing 100 mL of PDB medium, and shake the flask to mix them together. Note: It’s better to add approximately 200 mycelium blocks to 100 mL of PDB medium. This proportion guarantees that S. sclerotiorum uptakes adequate nutrition and produces enough fresh mycelium.  Fasten the conical flask on a shaking table (180  × g, 25 °C) and culture for 14–20 h, until fresh mycelium grows from the mycelium blocks (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4581/bioprotoc-13-01-4581-g002.jpg Figure 2. Fresh mycelium after culturing for 14–20 h.  Scale bar = 1 cm.Using a tweezer, separate fresh mycelium from mycelium blocks, and collect them in a 50 mL centrifuge tube.Resuspend the mycelium with 20 mL of KCl buffer, centrifuge at 1,500 ×  g  and 25 °C for 5 min, and then discard the supernatant.Repeat step A5 once again. Protoplast preparation  Add 20 mL of 0.5% Glucanex [lysing enzyme from  Trichoderma harzianum  (Sigma)] to a 50 mL centrifuge tube containing 1 g of mycelium material. Incubate with gentle shaking (120 ×  g  on the rotator) in the dark at room temperature for 2–3 h.After the enzymatic digestion, filter the digestion mixture using a cell strainer, and collect the filtrate into a 50 mL centrifuge tube (Figure 3A). Note: Place the filtrate on ice and proceed cautiously and gently with the next steps, as protoplasts are fragile and may easily rupture (Figure 3B).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4581/bioprotoc-13-01-4581-g003.jpg Figure 3.",
    "Filter the protoplasts and place the filtrate on ice  Centrifuge the filtrate at 1,200 ×  g  and 4 °C for 10 min, and carefully discard the supernatant.Wash the protoplasts gently with 5 mL of precooled KCl buffer, centrifuge at 5,000  × g  and 4 °C for 2 min, and then discard the supernatant carefully.Repeat step B4 once again. Note: Steps B4 and B5 effectively remove the residual enzyme mixture.  Resuspend the sediment with 1 mL of precooled STC, centrifuge at 5,000  × g  and 4 °C for 2 min, and discard the supernatant by slowly decanting the tube.Resuspend the sediment gently with 800 µL of precooled STC buffer and add 200 µL of precooled SPTC buffer drop by drop with a pipette.Place the protoplast solution on ice and check the status of the protoplasts with a Zeiss Axio Observer (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4581/bioprotoc-13-01-4581-g004.jpg Figure 4. Protoplasts of  S. sclerotiorum. Scale bar = 10 µm. Protoplast transformation  Resuspend the protoplasts to a concentration of 1 × 108  protoplast per milliliter, in four parts of STC and one part of SPTC. Note: Calculate protoplast concentration with a hemocytometer, according to the manufacturer’s instructions.  Add 5 µg of transforming DNA, 5 µL of spermidine (50 mM stock), and 5 µL of heparin (5 mg/mL) to 100 µL of protoplast suspension in a 1.5 mL microfuge tube, and then mix gently. Note: Mix them together by flicking the bottom of the microfuge tube instead of using a pipette.  Incubate the mixture on ice for 30 min, then gently add 1 mL of SPTC solution, and incubate at room temperature for 20 min.Transfer the transformation mixture into a 50 mL centrifuge tube, and add 10–20 mL of Regeneration Medium (RM).Culture the mixture with 100  × g  agitation, at 25 °C overnight.",
    "Gently mix the protoplasts with 200 mL of RMA medium at 43 °C, pour this into Petri dishes (10 mL per dish), and incubate at 25 °C for 24 h. Note: Heat up RMA medium until it melts completely, and cool it down in a water bath set to 43 °C.  After, cover the plates with 10 mL of RMA medium containing 100 µg/mL hygromycin B.Culture at 25 °C for 7–10 days, and transfer the transformants to fresh PDA medium containing 100 µg/mL hygromycin B.Transfer the hyphal tip of hygromycin-resistant transformants to PDA medium containing 100 µg/mL hygromycin B. Repeat the selection at least three times (Figure 5A). Note: Pick the edge hyphae of recovered hygromycin-resistant transformants using a sterile blade for the first selection, and cut the mycelium block for the next two selections.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4581/bioprotoc-13-01-4581-g005.jpg Figure 5. Colony morphology of  S. sclerotiorum  grown on selective RMA medium.  A. Colony morphology denoting successful transformation. The hyphal tips labeled by black arrows can be transferred to PDA medium for selection. B. Negative control plate made by adding no DNA in step C2.Extract total RNA of any colony and reverse transcript into cDNA. Perform PCR to validate positive colony by Phanta Super-Fidelity DNA Polymerase with the following cycles:Pre-denature the cDNA at 95 °C for 30 sDenature the cDNA at 95 °C for 30 s50 °C for 15 s72 °C for 90 sRepeat steps b-d for 25–35 cycles72 °C for 10 min Note: Primers designed to check mutants are as follows:   SsVPS51-GT-5’-F: CTTAGAGACTTGAGGAAGTC   SsVPS51-GT-3’-R: CTACTTCTATTGCTATTC"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}