{
  "id": 4222,
  "origin_website": "Cell",
  "title": "Protocol for Quantifying Zinc Flux in Cultured Cells using Fluorescent Indicators",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nDay 1: Seeding Cells for the Assay\nTiming: 1 h\nThis step describes how to prepare cells on coated plates.\nNote: Here, we describe the use of HeLa cells that stably express human TMEM163 (ZNT11) and mutant variants of the protein (Sanchez et al., 2019[href=https://www.wicell.org#bib6]). We have also had success using HeLa cells with transiently expressed proteins, human primary fibroblast cells, and human embryonic kidney (HEK)-293 cells with RNA interference treatment to quantify cellular zinc flux (Eichelsdoerfer et al., 2010[href=https://www.wicell.org#bib3]; Cuajungco et al., 2014[href=https://www.wicell.org#bib1]).\nWarm PDL-treated plates to ambient temperature.\nBefore use, inspect the coating on the PDL-treated plate to make sure that there are no cracks.\nSeed 25,000 stably transfected HeLa cells per well in the PDL-treated 96-well plate.\nCritical: Seeding 25,000 stably transfected cells resulted in about 90% confluency on Day 2. Seeding less than the recommended cell number will produce low confluency on Day 2, which could result in a very low fluorescence measurement.\nNote: For zinc flux assays, it is ideal to create stable cell lines that express a specific zinc transporter protein to reduce variability caused by issues in transfection efficiency.\nNote: Due to several wash steps in the protocol, we highly recommend using adherent monolayer cell lines that attach strongly on well surface.\nPlate stable cell lines expressing different protein variants in columns (see Figure 7[href=https://www.wicell.org#fig7], plate layout) so that there are eight experimental replicates per protein variants.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/98-Fig7.jpg\nFigure 7. Sample Plate Layout for Cell Seeding\nEach column (1–12) represents specific stable cells that over-express the wild-type and protein variants of TMEM163 (ZNT11) zinc efflux transporter.",
    "Alternatives: We were able to assay zinc flux in HeLa and human embryonic kidney (HEK)-293 cells using transient transfection (Cuajungco et al., 2014[href=https://www.wicell.org#bib1]; Sanchez et al., 2019[href=https://www.wicell.org#bib6]). See Quantification and Statistical Analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section for sample data from transfected cells.\nAlternatives: If you are going to transiently transfect the cells, then plate 10,000 Hela cells per well on Day 1. Transfect the cells on Day 2 using the appropriate expression vectors and transfection reagent. Perform the zinc flux assay on Day 3.\nCritical: The transfection approach may produce cytotoxicity depending on the cell lines, the transfection reagent or method, and the recombinant protein used in the study. The users are advised to optimize the process so that the cells can reach around 90% confluency on Day 3 of the zinc flux assay.\nDay 2: Newport Green Assay\nTiming: 2–3 h\nThis step describes the quantification of intracellular zinc flux.\nAspirate the plate using the automated plate washer. Add 100 μL of 5 μM Newport Green working solution per well. The Newport Green dye is light sensitive, so cover the plate with foil. Place in an incubator for 20 min at 37°C.\nWash twice with Standard Buffer using the plate washer. Bring the volume to 100 μL.\nAlternatives: If an automated plate washer is not available, manual washing is acceptable, but it must be done carefully to safeguard the cells from lifting off the plate surface.\nLeave the plate for 30 min at 20°C to 25°C on the bench to allow for ester cleavage of the dye.\nTwo different treatment groups are mapped on the plate (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/98-Fig8.jpg\nFigure 8. Sample Experimental Plate Layout\nThe first four rows (A-D) represent stable cells exposed to Standard Buffer, while the remaining lower rows (E-H, shaded area) represent stable cells treated with Zinc-Pyrithione complex.",
    "No Zinc: Add 100 μL Standard Buffer to the wells.\nZinc treatment: Add 100 μL of Standard Buffer containing 200 μM ZnCl2 and 20 μM 2-Mercaptopyridine N-oxide.\nPlace the plate in the 37°C incubator for 20 min.\nWash the cells five times with Standard Buffer using the automated plate washer. After aspiration, bring the volume up to 100 μL with the Standard Buffer.\nAlternatives: Manual washing may be done if an automated plate washer is unavailable. Be careful washing the plate to avoid lifting the cells off the surface.\nPlace the plate in the spectrofluorometer instrument. Take the kinetic readings every 1 min for 45 min.\nAlternatives: Depending on the research goals, the users have the option to measure zinc levels using an end-point reading at a specific time point (e.g. read at 20 min post-zinc exposure).\nDay 2 Alternative: Fluozin-3 Assay\nTiming: 1 h\nThis step describes quantification of extracellular zinc flux.\nAspirate the plate using the automated plate washer and replace the wells with treatment and control buffer.\nAlternatives: The plate may be manually washed if an automated plate washer is not available, but exercise care to ensure that the cells do not detach.\nThere are two different treatments for the wells.\nNo Zinc: Add 100 μL Kreb’s Ringer Bicarbonate buffer to the wells.\nZinc treatment: Add 100 μL of a solution of Kreb’s Ringer Bicarbonate buffer containing 200 μM ZnCl2 and 20 μM 2-Mercaptopyridine N-oxide solution.\nIncubate the plate in the 37°C incubator for 10 min.\nWash the plate five times with Standard Buffer. After aspiration, bring the volume up to 100 μL using the Standard Buffer. The plate may be washed by hand if an automated washer is not available.",
    "Place the cells in the plate reader. Perform an initial baseline reading – this reading will be used for background fluorescence normalization. Use the automated injector in the plate reader to add 2 μM cell impermeant Fluozin-3 to get a final concentration of 1 μM.\nAlternatives: Use a multi- channel pipet to add the 2 μM cell impermeant Fluozin-3 to get a final concentration of 1 μM if an injector is not available.\nTake the readings every 1 min for 30 min. Similar to the Newport Green assay, the users may perform an end-point reading at 20 min post-exposure to Fluozin-3 dye."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular/Chemical Probes",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}