{
  "id": 3736,
  "origin_website": "Cell",
  "title": "Biochemical detection of capsid in the nucleus during HIV-1 infection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTo understand the role of HIV-1 capsid in the nucleus, we designed a simple assay to biochemically monitor the amount of HIV-1 capsid in the cytosol and nucleus during infection. To this end, we challenge human cells with HIV-1 (Figure 1[href=https://www.wicell.org#fig1]), and collected cells at different time points post-infection. After collections, cells are separated into total, cytosolic and nuclear fractions (Figure 1[href=https://www.wicell.org#fig1]). The different fractions are analyzed by western blotting using anti-HIV-1-capsid, anti-Nopp140, and anti-GAPDH/α-tubulin antibodies (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/456-Fig1.jpg\nFigure 1. Biochemical detection of capsid in the nucleus during HIV-1 infection\nHuman cells are infected with HIV-1 viruses using an MOI = 2 for different times ranging from 1–48 h in the presence or absence of 10 μM PF74 (steps 1–4). PF74 blocks the entry of the HIV-1 core into the nucleus. Subsequently cells are separated into cytosolic and nuclear fractions (steps 5–8). Total (T), cytosolic (C) and nuclear extracts (N) are analyzed by western blotting using anti-HIV-1 capsid antibodies (anti-p24). To identify the bona fide origin of cellular extracts, cytosolic and nuclear extracts are analyzed by western blotting using antibodies against cytosolic(anti-α-tubulin) and nuclear proteins (anti-Nopp140).\nThis assay has been tested in several different mammalian cell lines: human HT1080, human A549, human U937, human MOLT3, and dog Cf2Th cells.\nIt takes approximately 4 h to collect the cells and separate them into fractions. The timing depends a lot on the amount of points you process. We do not recommend processing more than 8 points at the same time. Depending on the goal of your experiment and time of incubation you want to do, we would suggest the following time frame for the experiment:",
    "Variant A – Seed cells on plates in the morning (step 1), infect in the evening the same day and incubate with the virus for 16 h (step 2), and next morning collect the cells and perform the fractionation (step 3 and all steps after that).\nVariant B – Seed cells on plates in the evening (step 1), infect in the morning next day (step 2), and collect the cells and perform the fractionation during the day at desired time points.\nSeeding cells for infection\nTiming: 30 min and at least 6 h of incubation\nSeed 5 × 106 mammalian cells on two 10 cm2 plates per every point you have in your experiment. For this detach the cells by trypsin treatment, determine the amount of cells you have, resuspend the cells to concentration 2.5 × 106 cells in 10 mL of complete growth media and put 10 mL per each 10 cm plate (you need 2 plates and 5 × 106 cells for point). Incubate cells at 37°C with 5% CO2 for at least 6 h to allow cells to attach.\nInfection of the cells\nTiming: 30 min",
    "Cells are challenged using HIV-1 viruses at a MOI = 2 for the indicated times (1–48 h). Take 15 mL tube per every point you have. Put 1 mL of complete growth media into the tube. Add 10 μL of DMSO or 10 μL of 10 mM PF74 (to achieve the final concentration 10 μM PF74). Gently vortex the tube. Add complete growth media and the virus (final volume should be 10 mL). Mix by pipetting. Remove the old media from the plates with cells. Gently put 5 mL of your viral mixture per plate. Incubate at 37°C with 5% CO2 for desired time. The assay works using replication competent HIV-1NL-4-3, or HIV-1NL-4-3 Δenv pseudotyped with the envelope of vesicular stomatitis virus (VSV-G). Virus challenges have been performed from 1 h to 48 h. Capsid can be detected in the nuclear fraction 1 h post-infection (Selyutina et al., 2020a[href=https://www.wicell.org#bib4]).\nCell harvest\nTiming: 30 min\nHarvest the cells (10–30 min). Aspirate medium from both plates. Add 1 mL of 0.25% Trypsin per plate and incubate 2–3 min at 25°C until cells are completely detached from the plate. You can shake the plates to ensure the complete detachment of the cells. Transfer all the cells to a 50 mL Falcon tube. To achieve this, add to the first plate 7 mL of DMEM medium, collect the cells, transfer the whole mixture into the second plate, collect the cells, and transfer the whole mixture into the 50 mL Falcon on ice. To ensure the complete transfer of cells repeat this 2 more times, so the final volume in the tube would be 23 mL (2 mL of trypsin and 21 mL of DMEM).",
    "Critical: It is crucial to collect ALL the cells from the plate, as it has a great impact on point-to-point variation.\nCritical: It is crucial not to damage the cells during trypsin treatment. For this incubate cells with trypsin minimum time required for cells to detach from the plate.\nWash the cells\nTiming: 30 min to 1 h\nWash the cells (30 min to 1 h). Centrifuge cells at 200 × g for 7 min at 4°C. Discard the supernatant and keep the cell pellet. Whenever the cells are not in the centrifuge you should keep them on ice. Harvested cells are washed twice with 1× cold PBS. For this resuspend cell pellet in 10 mL of ice-cold 1× PBS and add 40 mL of ice-cold PBS. Centrifuge at 200 × g for 7 min at 4°C. Repeat twice. Supernatant is discarded and cell pellet is resuspended in 1 mL of PBS.\nCritical: It is important to completely remove any traces of virus and trypsin from your cell mixture, as failure to do that will influence the result of your experiment.\nPreparation of the total fraction\nTiming: 15 min and 2.5 h to prepare the lysate",
    "Preparation of the total fraction (15 min to collect the cells and 2.5 h to prepare the lysate). 1/10 aliquot of the cell suspension (100 μL) is transferred to 1.5 mL tube and centrifuged (200 × g for 7 min at 4°C), the supernatant is discarded and the cell pellet can be processed immediately or can be frozen and kept at −20°C for 24 h or −80°C for a longer time. To prepare the total fraction resuspend the cell pellet in 38 μL of WCE (50 mM Tris pH=8.0, 280 mM NaCl, 10% glycerol, 0.5% NP-40, 5 mM MgCl2, 250 units/mL Benzonase, 10 μg/mL ethidium bromide, 1× protease inhibitor), incubate for 1 h on ice, centrifuge at 20,000 × g for 1 h at 4°C, then 34.2 μL of the resulting supernatant mix with 10.8 μL of 5× Laemmli buffer and use 40 μL of this mixture to measure the Total amount of capsid by western blotting (see step 8). Ethidium bromide is used to unwind genomic DNA an improve lysis.\nPause Point: after you have collected the cells for total fraction you can freeze it and keep at −20°C for 24 h or −80°C for a longer time.\nPreparation of the cytosolic fraction\nTiming: 10–20 min",
    "Preparation of the cytosolic fraction (10–20 min). The rest of the cell suspension 9/10 (900 μL) is centrifuged (800 × g for 7 min at 4°C), supernatant is discarded and cell pellet is resuspended in 315 μL of lysis buffer (10 mM Tris pH = 6.8, 1 mM DTT, 1 mM MgCl2, 10% sucrose, 100 mM NaCl, 0.5% NP-40, 1× protease inhibitor) and incubated for 5 min on ice. Subsequently, the sample is centrifuged at 664 × g for 2 min at 4°C. The resulting supernatant and pellet correspond to cytosolic and nuclear fractions, respectively. 1/9 aliquot of the cytosolic fraction (35 μL) is mixed with 15 μL of 5× Laemmli buffer and 40 μL of this mixture is used as Cytosolic fraction for detection by western blotting (see step 8).\nCritical: Make sure to that the amount of lysis buffer you use is enough to lyse your cell pellet (see Troubleshooting[href=https://www.wicell.org#troubleshooting]). Incomplete lysis will result in contamination of your nuclear fraction with unlysed cells. We recommend using 5× cell pellet volumes of the lysis buffer. To determine the correct volume of lysis buffer you can make a pilot experiment testing several volumes of lysis buffer and checking by western blot your fractions for nuclear and cytoplasm markers content.\nWash nuclear pellet\nTiming: 10 min\nWash the nuclear pellet (10 min). The nuclear pellet is washed twice using 1 mL of washing buffer (10 mM Tris, pH = 6.8, 1 mM DTT, 1 mM MgCl2, 10% sucrose, 100 mM NaCl, 1× protease inhibitor) by gently inverting the tube 2–3 times. The sample is then centrifuged at 664 × g for 2 min at 4°C, and the supernatant is discarded.\nPreparation of the nuclear fraction\nTiming: 15–30 min",
    "Preparation of the nuclear fraction (15–30 min). The nuclear pellet is resuspended in 315 μL of extraction buffer (10 mM Tris, pH = 6.8, 1 mM DTT, 1 mM MgCl2, 10% sucrose, 400 mM NaCl, 1× protease inhibitor), and incubated on ice for 10 min. Subsequently, the sample is centrifuged at 5,200 × g for 2 min at 4°C. 1/9 aliquot of the supernatant (35 μL) is mixed with 15 μL of 5× Laemmli buffer and 40 μL of this mixture are used as nuclear fraction (see step 8).\nPause Point: Fractions mixed with the Laemmli buffer can be frozen and kept at −20°C for at least 1 month.\nWestern blot\nTiming: 3 days\nBy loading 40 μl in the western blot as specified above approximately 8% of the total, cytosolic, and nuclear fractions are analyzed using anti-p24, anti-Nopp140, anti-α-tubulin, or anti-GAPDH antibodies. Detection of Nopp140 is used as a nuclear marker, but other nuclear markers can be used (including but not limited to Lamin A/C, Lamin B1, Histone H1, Histone H3). α-tubulin and GAPDH are used as a cytosolic markers.",
    "After total, cytosolic, and nuclear fractions are prepared as described (see steps 5, 6, and 8 of this protocol), they are stable at −20°C for at least a month. The day you perform the western blot completely thaw the samples and boil them at 100°C for 3 min. For electrophoresis we use NuPAGE 10% Bis-Tris gels. Load 40 μL of each fraction per well and 2 μL of Protein Standard on a separate well of the same gel. Run the gel in 1× PAGE running buffer at 25 mA per gel for 2–3 h at 25°C or until the bromophenol blue dye riches the end of the gel. Transfer the proteins to a Nitrocellulose membrane in 1× western blot transfer buffer at 100 Volts for 1 h at 4°C or on ice. After the transfer block the membrane in western blot blocking buffer for 0.5–1 h at 25°C or at 4°C for 16 h. Incubate with antibody against p24 (1:1,000 dilution in western blot blocking buffer) for 1 h at 25°C or at 4°C for 16 h. Wash the membrane in western blot wash buffer 3 times for 10 min. Incubate with secondary antibody (Goat anti-Mouse IRDye 680LT, 1:10,000 dilution in western blot blocking buffer) for 20–30 min at 25°C. Wash the membrane in western blot wash buffer 3 times for 10 min. Dry the membrane with a paper towel and scan using the Odyssey Infrared Imager. After that re-hydrate the membrane in western blot wash buffer for at least 30 min at 25°C and incubate with the nuclear marker antibody (anti-Nopp140, 1:5,000 dilution in western blot blocking buffer). As a secondary antibody we use Goat anti-Rabbit IRDye 680LT, 1:10,000 dilution in western blot blocking buffer.",
    "After scanning the membrane, re-hydrate the membrane again and incubate with antibody against α-tubulin (1:8,000 dilution in western blot blocking buffer). As a secondary antibody we use Goat anti-Rabbit IRDye 800CW (1:10,000 dilution in western blot blocking buffer). As alternative anti-GAPDH antibodies can be used (1:5,000 dilution in western blot blocking buffer and Goat anti-Mouse IRDye 800CW 1:10,000 dilution in western blot blocking buffer).",
    "Pause Point: After you detected the signal from your western blot you can keep the membrane dry at 25°C for no longer than 2 weeks before proceeding with the next antibody."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Protein Biochemistry",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}