{
  "id": 7663,
  "origin_website": "Bio",
  "title": "CRISPR/Cas9-mediated Gene Knockout Followed by Negative Selection Leads to a Complete TCR Depletion in <em>ortho</em>CAR19 T Cells",
  "procedures": [
    "A general workflow for the overall experimental procedures can be found in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4485/bioprotoc-12-15-4485-g001.jpgFigure 1. General workflow of the overall experimental procedures. CRISPR/Cas9-mediated gene knockout followed by CD3 negative selection results in a complete depletion of TCR in orthoCAR19 T cells.Preparation of human orthoCAR19 T cellsPrimary human total T cells were purchased from the Immunology Core of University of Pennsylvania.Count cells and adjust to 1 × 106 cells/mL in RPMI 1640 supplemented with 10% FBS, 2 mM L-glutamine, 100-U/mL penicillin, 100-g/mL streptomycin sulfate, and 10-mM HEPES. Assess cell viability using the Trypan Blue solution (0.4%, Thermo Fisher) as a cell stain for the dye exclusion test.Wash the magnetic beads coated with anti-CD3/anti-CD28 three times with PBS, and once with cell culture media.Mix T cells with the washed beads at a ratio of 1:3, for 16–24 h.Transduce activated T cells with viral particles encoding orthoCAR19, as described by our previous work (Zhang et al., 2021). Briefly, both CD19BBz and ortho-hIL-2Rβ sequences were cloned in a p-TRPE lentiviral backbone, in frame with the restriction site XbaI and Sa1I for CD19BBz, ortho-hIL-2Rβ-T2A-mCherry, and CD19-ortho-hIL-2Rβ. Lentivirus was produced by transfecting HEK293T cells with a combination of the above transfer plasmid and three lentiviral package plasmids, pCI VSV-G, pRSV Rev, and pMDL gag/pol.RRE (Addgene).Culture cells with 100 IU/mL human recombinant IL2, and feed them every day for three days, in preparation for CRISPR/Cas9-mediated TCR KO.Preparation of the CRISPR-Cas9 complexTCRα and TCRβ gRNA sequence (TRAC gRNA sequence: TGTGCTAGACATGAGGTCTA; TRBC gRNA sequence: GGAGAATGACGAGTGGACCC) were designed by using CRISPOR, an online program that helps design, evaluate, and clone guide sequences for the CRISPR/Cas9 system.",
    "The main considerations regarding potential gRNA candidates are for finding the gRNAs that (1) efficiently KO the gene close to ATG (translation start site) for maximum loss of function, or at the location of functional domain to disrupt the target function; (2) have no or less off-target genes.The single human genomic sequence used in the TRAC and TRBC gRNA design was CTTCCTTTGTCCCCAATCTGGGCGCGCGCCGGCGCCCCCTGGCGGCCTAAGGACTCGGCGCGCCGGAAGTGGCCAGGGCGGGGGCGACCTCGGCTCACAGCGCGCCCGGCTATTCTCGCAGCTCACCATGGATGATGATATCGCCGCGCTCGTCGTCGACAACGGCTCCGGCATGTGCAAGGCCGGCTTCGCGGGCGACGATGCCCCCCGGGCCGTCTTCCCCTCCATCGTGGGGCGCC, with a protospacer adjacent motif (PAM) sequence of 20bp-NGG-Sp Cas9, SpCas9-HF1, eSpCas9 1.1.Dissolve TCRα and TCRβ gRNAs (Agilent) in 1× TE buffer (IDT) at 10 μg/μL, and mix them together in equimolar concentrations.Combine 1 μL of gRNA mixture, including 5 μg TCR α and 5 μg TCR β, with 2 μL (5 μg/μL) of Cas9 (Invitrogen).Mix the gRNAs-Cas9 complex mixture by gently pipetting up and down twice; avoid creating air bubbles in the tube.Incubate the complex mix at room temperature (RT: 15–25 °C) for 10 min.Preparation of T cell suspension for electroporationFor each electroporation condition (including positive and negative controls), prepare 5 mL of cell expansion medium supplemented with 10% FBS, 2 mM L-glutamine, 100-U/mL penicillin, 100-g/mL streptomycin sulfate, 10-mM HEPES, and 100U IL2.For each condition, add 2 mL of supplemented medium (prepared in Procedure A) to a 12-well plate (for 100-μL tip reactions), and place in a 37°C incubator.Transfer 1.5 × 106 cells (for 100-μL cuvette reactions) from the orthoCAR19 T cells to a 15-mL tube. Centrifuge at 300 × g and RT for 5 min.Electroporation of T cells with gRNA-Cas9 complex using the Lonza 4D systemA demonstration of how to perform electroporation using Lonza 4D system can be found in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4485/bioprotoc-12-15-4485-g002.jpgFigure 2. A demonstration of how to perform electroporation using Lonza 4D system. Aspirate the supernatant from the cell pellet (prepared in Procedure C).",
    "Resuspend cells in 100 μL of P3 buffer from the 4D-Nucleofector X Kit and pipette up and down to mix.Using sterile 200-μL PCR tubes for each condition, combine the gRNA-Cas9 complex mixture (prepared in Procedure B) with cells in P3 buffer.Mix gently by pipetting up and down carefully twice; avoid creating bubbles in the tube.Transfer cells with the gRNA-Cas9 complex mixture into a cuvette from the 4D-Nucleofector X Kit, making sure that there are no air bubbles. Place the cuvette into the electroporation chamber.Electroporate the cell mixture using the “human stim T-cell” preset program and a pulse code of EH-115.Post-knockout cultureImmediately add culture media into the cuvette containing the electroporated cells, and incubate at 37 °C for 15 min.Count cells, and adjust cell density to 0.8 × 106 cells/mL, by adding IL2-supplemented cell culture media.Incubate at 37 °C for 72 h, for genome editing to occur.Harvest cells for assessment of genome editing efficiency. Isolate and amplify the genomic DNA using primers that flank the target region. Sequence the PCR product.PCR kit used: Q5 Hot Start High-Fidelity DNA Polymerase KitHarvest cells and check for TCR protein expression with flow cytometry, using APC human anti-TCRα/β.Isolation of CD3 negative T cellsNegative selection of CD3+ cells is performed using Dynabeads CD3 (Thermo Fisher Scientific).Wash the BeadsResuspend the beads in the vial.Transfer the desired volume of beads to a 5-mL tube.Add the same volume of Isolation Buffer (PBS supplemented 0.1% BSA).Place the tube in a magnet for 1 min, and discard the supernatant.Remove the tube from the magnet and resuspend the washed beads in the same volume of Isolation Buffer as the initial volume of beads.Prepare CellsPrepare TCR KO T cells to 1 × 107 cells/mL in Isolation Buffer.",
    "Transfer 1 mL of cells (1 × 107) to a tube, and add 25 µL of pre-washed and resuspended beads.Incubate with gentle tilting and rotation at 2–8 °C for 30 min (depletion).Place the tube in a DynabeadsTM magnetic rack for 2 min.Transfer the supernatant to a new tube for further use, and discard the beads.Flow cytometryWash the CD3 negative T cells twice with PBS, and stain with APC anti-human TCRα/β antibody (1:50, Biolegend) for 30 min, followed by two washes with PBS.Quantify CD3 negative T cells using a BD LSRFortessa flow cytometer.Perform analysis of T cell CD3 expression, using FlowJo software (Tree Star Inc., version 10.1)."
  ],
  "subjectAreas": [
    "Immunology",
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}