{
  "id": 17676,
  "origin_website": "Jove",
  "title": "Operating Transverse Aortic Constriction with Absorbable Suture to Obtain Transient Myocardial Hypertrophy",
  "procedures": [
    "All procedures were carried out following the guidelines of the Care and Use of Laboratory Animals published by the US National Institutes of Health (NIH Publication No. 85-23, revised in 1996). C57BL/6J male mice (8–10 weeks, 20–25 g) were provided by the Animal Center of South Medical University.\n1. Preoperative preparation\nPinch off the tip of a 25 G needle with a needle holder and blunt it with a hard object like the holder.\nPass a 5–0 absorbable suture through the needle and then curve it to 90° with a holder13.\n\tNOTE: According to different research purposes, investigators could select absorbable lines with different absorption time. In this protocol, we used a 2-week absorbable suture to constrict the aortic arch.\nCurve another 25 G needle to 120° and smoothen the tip with a holder to be used as a spacer in the ligation step.\n\tNOTE: A 25 G needle was used as a spacer for mice having body weight (BW) >25 g. Use a 26 G needle for mice with 19–24 g BW.\nDisinfect the operative site with 75% alcohol.\nAdjust the heating pad temperature to 37 °C.\nPrepare sterilized surgical instruments (including 1 ophthalmic scissors, 1 micro scissors, 2 microsurgical elbow tweezers, 1 needle holder, and 1 micro needle holder).\n2. Induction of anesthesia and shaving\nAnesthetize a mouse by intraperitoneal injection of a mixture of xylazine (5 mg/kg) and ketamine (100 mg/kg) diluted in saline solution (0.9% NaCl). Confirm complete anesthetization with the negative pedal withdrawal reflex.\nKeep the mouse in supine position by fixing the incisors with a suture and fixing the limbs with adhesive tapes.\nApply depilatory cream to remove hair on its neck and xiphoid. Disinfect the area with iodine followed by 75% alcohol.\n3. Surgery",
    "Make an incision over 10 mm at the midline position between supra-sternal notch and chest with a scalpel. Then, separate the skin and the superficial fascia.\nIdentify the first intercostal space by counting the ribs from the sternal angle. Perform the incision in the first intercostal space and as close as possible to the sternum. Bluntly penetrate it with elbow tweezers to open this space.\nGently separate the parenchyma and the thymus until the transverse aortic arch is visible.\n\tNOTE: Do not damage the parietal pleura to avoid pneumothorax.\nPass the 5–0 absorbable suture under the aortic arch between the brachiocephalic artery and the left common carotid artery with a latch needle14. Please make sure that the brachiocephalic artery, the left common carotid artery, and the left subclavian artery are visible in the operation field.\nPlace the spacer, prepared in step 1.3, on the transverse aorta and perform a double knot on the spacer with the suture in step 3.4.\n\tNOTE: The tip of the spacer must be blunt to avoid damaging the transverse aorta while removing it.\nRemove the spacer quickly but gently, and then cut the ends of the suture.\nClose the first intercostal space and the skin using 5–0 nylon sutures. Disinfect the skin again with 75% alcohol.\nPlace the mouse on the heating pad to promote recovery. Inject buprenorphine (0.1 mg/kg, q12h) intraperitoneally for the first 3 days after the surgery.\nReturn the mouse to the cage in a 12 h light/dark cycle room when it recovers consciousness.\nPerform sham surgery identical to all the above steps but without the constriction (step 3.5).\nPerform surgery for the silk suture group, identical to all the above steps but using a 5–0 silk suture in step 1.2.\n4. Echocardiographic assessment of successful ligation and measurements",
    "Perform echocardiographic assessment on the Day (D) 7 after surgery.\nAnesthetize the mouse with 3% isoflurane through inhalation for induction, and 1.5% for maintaining the depth of anesthesia, with a 0.5–1 L/min oxygen flow rate.\nPlace the mouse in supine position on the platform, maintained at 37 °C, and tape its limbs to the electrode.\nRemove the chest hair with a depilatory cream and apply ultrasonic coupling agent to the mouse’s chest.\nAssess transverse aortic constriction with a 30 MHz probe.\n\t\nTilt the platform to the far left. Keep the probe in vertical position and lower it on the chest along the right parasternal line. Then, manipulate X-axis and Y-axis under B-mode until the aortic arch is clearly visible.\nLocate the constriction by B-mode to obtain the aortic arch view11. Use the color Doppler mode and pulsed wave to measure the peak flow velocity and select mice with a velocity of more than 3,000 mm/s as the TAC group (values are based on preliminary experiments).\nCalculate the pressure gradient according to the modified version of Bernoulli's equation11:\n\t\tpressure gradient = 4 x Vmax2.\n\t\tNOTE: The ideal pressure gradient for transverse aortic constriction model ranges from 40–80 mmHg11.\nSave the data and images using Cine Store and Frame Store.\nAssess dimensions and contractility of left ventricular (LV) with a 30 MHz probe.\n\t\nReset the platform to the horizontal position. Keep the probe at 30° counterclockwise relative to the left parasternal line.\nUse B-mode and manipulate X and Y to obtain a clear and full-long axis view of the heart.\nPress M-mode to show the indicator line. Acquire images with Cine Store and Frame Store for later measurement of the LV chamber dimension, fractional shortening, and LV wall thickness.",
    "Once done, stop isoflurane inhalation and allow the mouse to recover from anesthesia. Then, return the animal to its cage in a 12 h light/dark cycle room.\nOn D14 and D28 after surgery, repeat the above steps to measure the cardiac parameters and then harvest the heart for histological studies.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}