{
  "id": 3534,
  "origin_website": "Cell",
  "title": "Protocol for tissue processing and paraffin embedding of mouse brains following ex vivo MRI",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBrain dissection\nTiming: 15 min to 1 h per brain depending on the level of experience\nRemove the brain from the skull (Figures 2[href=https://www.wicell.org#fig2]A‒2E).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3105-Fig2.jpg\nFigure 2. Photos demonstrating the procedure of dissecting the mouse brain\n(A) Example of mouse brain within the skull.\n(B‒D) Removing the brain from the skull.\n(E) Example of brain with the skull removed.\n(F) Mouse brain within the brain matrix.\n(G and H) Using a brain matrix to slice the brain. G and H show positioning for sagittal and coronal slicing respectively.\nExtra care should be taken to avoid damaging the brain with the tweezers or scissors. Doing this process slowly ensures better results.\nNote: A good step-by-step description is presented by Spijker, 2011.10[href=https://www.wicell.org#bib10] However, researchers may prefer to use different approaches to remove the mouse brain from the skull depending on the region of interest for histology and on experience.\nUsing a brain matrix (Figure 2[href=https://www.wicell.org#fig2]F) for adult mouse brains (1 mm between notches), cut the brain with a razor blade at the midline for sagittal sections (Figure 2[href=https://www.wicell.org#fig2]G) or at notches 4 and 12 for coronal sections (Bregma +3 and ‒5; Figure 2[href=https://www.wicell.org#fig2]H).\nNote: The configuration for coronal sections was done to keep the cerebral cortex in one piece and adhere to the optimized processing protocol (which needs to be adjusted for sample size), removing the olfactory bulbs and the cerebellum. The coronal slab was approximately 8 mm thick after cutting.\nNote: While the brain could be divided manually for both coronal and sagittal sections, we recommend using a brain matrix to improve the reproducibility of the cutting plane position and angle.",
    "Note: In case the whole brain is to be assessed with histology in coronal sessions, including olfactory bulbs and cerebellum, we suggest dividing the brain in half and processing the two halves separately. Timing for tissue processing steps may need adjustment depending on the sample size.\nStore the brain in the storage solution at 4°C until required for tissue processing.\nProcessing tissue\nTiming: 20 h\nProcessing tissue involves four major steps: fixation, dehydration, clearing and wax infiltration. Formalin is one of the most common fixatives and forms cross-linkages with proteins while preserving morphology and antigenicity.11[href=https://www.wicell.org#bib11] Dehydration in a series of alcohols is necessary to remove water from the tissue because paraffin wax is immiscible with water. Next, the tissue is cleared by immersing it in a clearing agent, to remove alcohol from the tissue and prepare it for paraffinization. Finally, the tissue is infiltrated with paraffin wax. The advantage of paraffin wax is that it preserves cellular morphology and provides support while sectioning and enables long-term storage.\nSub-optimal processing can result in tissue that is difficult to section12[href=https://www.wicell.org#bib12] and has poor morphology; therefore, it is vital to optimize the processing protocols for the size and type of tissue. Tissue stored in solution for months to years can pose a particular challenge. The protocol presented here is optimized for adult mouse brain tissue that has been stored in PBS, sodium azide and contrast agent solution after fixation and for up to 27 months before processing. Samples were either one adult brain hemisphere for sagittal sections or an 8 mm-thick slab of the mouse brain for coronal sections, where the olfactory bulbs and cerebellum have been removed (step 2).\nRinse the tissue in distilled water twice (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_3105_13.csv",
    "Note: the storage time is based on how long our samples were stored. Distilled water (dH2O), minutes (min), hour (h).\nPlace each sample inside its own tissue embedding cassette. Ensure the cassette is deep enough for the size of the tissue.\nLabel the cassette with the sample identification.\nDehydrate the tissue in a series of alcohols at 18°C–22°C. (Ethanol is diluted in distilled water as necessary). Multiple changes of ethanol are required to displace any water.\n70% Ethanol overnight (11 h).\n80% Ethanol 45 min.\n95% Ethanol 45 min, two times.\n100% Ethanol 15 min, three times.\n100% Ethanol 30 min, three times.\nClear the tissue in a series of Citroclear at 18°C–22°C. Multiple changes are required to displace all the ethanol.\nCitroclear for 30 min.\nCitroclear for 45 min.\nCitroclear for 60 min.\nInfiltrate the tissue with paraffin wax through incubation in a series of molten wax at 60°C. Multiple changes are required to displace all the Citroclear.\nParaffin wax for 30 min.\nParaffin wax for 45 min.\nParaffin wax for 60 min.\nNote: This tissue processing routine described here is shorter than the recommended routines used for recently collected mouse brains (1 hour per step). When a standard routine is used to process mouse brain tissue after prolonged storage, we found that the blocks are exceedingly difficult to slice, impairing the ability to collect serial sections.\nNote: Ethanol, Citroclear and paraffin solutions should be replaced with fresh solutions weekly to maintain quality as cross-contamination may impact the quality of processing.12[href=https://www.wicell.org#bib12]\nAlternatives: Histo-Clear II or Xylene clearing agents can be used instead of Citroclear.\nEmbedding\nTiming: 2 h",
    "After processing, samples are embedded in paraffin wax. It is vital that the specimen is carefully orientated into the desired position (usually an orthogonal plane), as this will affect the plane that is cut. It is possible to embed more than one sample in the same block. However, when embedding blocks that contain multiple samples it is important to ensure all samples are level and that enough paraffin is present around each sample. FFPE (Formalin-fixed paraffin embedded) blocks can be stored long term at room temperature (18°C–22°C) because the tissue is preserved within the paraffin. The protocol here describes the method for embedding both single and multiple mouse brains per block.\nWarm the paraffin wax in the embedder 30 min prior to use.\nRemove the tissue embedding cassettes from the tissue processor and place them inside the cassette bath of the embedder.\nPrepare the blocks. Tissue can either be arranged to have a single brain per block or multiple samples can be embedded within the same block. Troubleshooting 1[href=https://www.wicell.org#sec7.1].\nPrepare single brain blocks.\nPour melted paraffin into a histology mold (e.g., 37 × 24 × 9 mm size mold) until it is partially filled.\nWarm the forceps then remove the specimen from the cassette and transfer it to the histology mold. Orient the specimen into the desired position.\nTransfer the mold onto the cold plate for a few seconds to allow the paraffin to solidify and anchor the brain.\nNote: Use blunt forceps and gentle pressure to avoid damaging the specimen.\nNote: Ensure the histology mold is sufficiently deep for the size of the tissue and will allow at least 1 cm of wax between the sample and edge of the block.\nOptional: Prepare multi brain blocks (Figures 3[href=https://www.wicell.org#fig3]A–3G).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3105-Fig3.jpg\nFigure 3. Photos demonstrating the embedding process for multibrain blocks",
    "(A) A silicone mold is used to ensure the block size will be suitable for standard 25 mm × 75 mm slides.\n(B) A printed guide is inserted into the embedding mold, (C) then a glass coverslip with double tape on the top side is placed on top of the printed guide.\n(D) The guide is used to assist placement of the brains within the molten wax, the coverslip allows to keep all brains on the same plane, and the double tape keeps the brains in place.\n(E) After the wax has set, the silicone mold, printed guide and coverslip with double tape can be easily removed.\n(F) Example of a multibrain block with brains positioned for sagittal sections.\nInsert a silicone mold inside a Supa Mega (60 × 45 × 15 mm) base mold (Figure 3[href=https://www.wicell.org#fig3]A). We made a silicone mold that measures 50 × 23 × 10 mm internally and 60 × 45 × 14 mm externally.\nFill the silicone mold with wax.\nKeep the mold filled with warm wax in an oven or the cassette compartment of the embedding station for 1–6 h.\nAfter allowing the wax to rest, insert a printed guide into the bottom of the mold (Figure 3[href=https://www.wicell.org#fig3]B).\nInsert a coverslip (24 × 50 mm) covered with double tape on top of the printed guide (Figure 3[href=https://www.wicell.org#fig3]C). The double tape will keep each sample in place and at the right orientation.\nTransfer the brains into the mold according to the guide and record the position of each sample (Figure 3[href=https://www.wicell.org#fig3]D).",
    "Note: Allowing the wax to rest reduces the presence of bubbles in the block. Use tweezers or a spatula to scratch surfaces from time to time and release bubbles that may accumulate. The presence of bubbles in the solidified paraffin wax creates challenges when sectioning and reduces the quality of the histological slides. While bubbles are not common in small size paraffin blocks, they are more common in bigger blocks.\nPlace the labeled cassette on top of the mold.\nReturn the mold back to the warm plate and fill with melted paraffin up to the upper edge of the cassette.\nNote: Do not overfill the mold as this can interfere with the alignment of the block. Underfilling the mold can cause unstable clamping of the block.\nTransfer the mold to the cold plate and allow the wax to fully solidify, ideally for up to 30 min. Then separate the mold from the cassette.\nNote: For multi brain blocks, the custom silicone mold, and printed guide can be easily separated from the block after removing it from the mold. Remove the coverslip/double tape carefully.\nAssess the quality of the block and tissue. Troubleshooting 1[href=https://www.wicell.org#sec7.1].\nThe wax should be free from cracks or air bubbles.\nThe sample should be orientated correctly and should not be touching the edge of the block.\nThere should be no smell of Citroclear. If present, this suggests that either the Citroclear was not completely removed during processing, or the tissue may be under-processed. Troubleshooting 2[href=https://www.wicell.org#sec7.3].\nPause point: Blocks can be stored at 18°C–27°C long term until needed for sectioning.\nSectioning\nTiming: 1–3 h per brain block",
    "Sectioning can introduce artefacts that will impact downstream registration and analysis. Therefore, it is vital care is taken to reduce this. We found that soaking the blocks in Mollifex and ice-cold water prior to sectioning and decreasing slice thickness to 4–6 μm improved the quality of the slices.\nFill the water bath with distilled water and heat to 42°C.\nNote: Despite the general recommendation to use water at 5°C–10°C below the melting point of paraffin,13[href=https://www.wicell.org#bib13] we found that it led to overexpansion and breakage of the mouse brain tissue. Using a lower temperature of 37°C–42°C allowed wrinkles to be removed without damaging the tissue due to overexpansion and loss of morphological structure.\nChill the block on the surface of ice for <5 min.\nNote: Do not place the blocks in the freezer as this will damage them.\nCritical: Label the slides with the block ID and serial section number.\nRemove any excess wax from the outside of the cassette before clamping the block.\nSet the paraffin block into the microtome. Ensure the block is parallel to the blade and adjust the angle of the blade. 2–5 degrees is the recommended clearance angle for paraffin blocks.13[href=https://www.wicell.org#bib13] It is important that the tissue is sectioned perpendicularly.\nTrim the block at 10–30 μm until a full faced section is achieved.\nNote: Sections can be viewed under the microscope to view the anatomy and check if the angle of the block requires adjusting. Troubleshooting 3[href=https://www.wicell.org#sec7.5].\nAfter the block is trimmed, place the block in Mollifex reagent for at least 30 min prior to sectioning. This step will help soften hard or brittle tissue (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3105-Fig4.jpg\nFigure 4. Microtome workflow\n(A) Soak the block in Mollifex followed by (B) ice water.\n(C) Cut sections.",
    "(D) The section is floated on a warm water bath until smooth and then (E) placed on a glass slide.\n(F) Sections are allowed to dry upright at 18°C–22°C.\nNote: Mollifex should be used in a fume hood. Users should wear gloves, protective clothing and safety glasses.\nGently wipe away the Mollifex and then chill the block briefly on the surface of melting ice for up to 5 min (Figure 4[href=https://www.wicell.org#fig4]B).\nNote: Avoid prolonged soaking in ice water. This can cause the tissue to swell and may damage the tissue morphology.\nSection the block slowly at 4–6 μm with a uniform rotation (Figure 4[href=https://www.wicell.org#fig4]C). Pick up each section using either a small brush or small tweezers. Troubleshooting 4[href=https://www.wicell.org#sec7.7].\nDiscard the first two sections of a ribbon of consecutive sections. These sections are usually thicker than desired due to expansion of the cold block. We took up to 20 serial sections.\nNote: Gentle warm breath on the section can prevent sections rolling up and reduce static electricity.\nNote: If the tissue shows signs of becoming dry at the edge of the tissue, it is necessary to repeat the chilling step before more sections can be taken.\nCritical: Avoid touching the blade with the brush or tweezers as this may cause nicks in the blade resulting in scoring on the tissue.\nTransfer the section onto the water bath and allow the section to float on the surface until there are no wrinkles (<15 s) (Figure 4[href=https://www.wicell.org#fig4]D). Do not float the section on the water for longer as expansion may distort the tissue.13[href=https://www.wicell.org#bib13] Avoid trapping air bubbles underneath the section on the surface of the water bath.",
    "Collect the section onto a charged glass slide (Figure 4[href=https://www.wicell.org#fig4]E). Be careful to avoid trapping air bubbles underneath the tissue when transferring them onto the glass slide.\nDry in an upright position overnight (>18 h) at room temperature (18°C–22°C) to allow excess water to drain (Figure 4[href=https://www.wicell.org#fig4]F). Then store in a slide box.\nAssess the quality of the sections.\nSections should be free from wrinkles, folds, scratches and artefacts. Troubleshooting 3[href=https://www.wicell.org#sec7.5] and 4[href=https://www.wicell.org#sec7.7].\nThe brain should remain in the anatomically correct position.\nThe brain should not be positioned close to the edge of the glass slide.\nThere should be no air bubbles trapped underneath the section.\nSections should be free from any debris or contamination.\nNote: Minimize handling of slides to avoid contaminating them with squamous cells or oils. Only use clean slides and do not touch glass slides or the water bath without gloves. We suggest using charged slides to avoid adding a coating step.\nPause point: The unstained slides can be stored at in the dark at 18°C–27°C for up to 1 year. Avoid prolonged exposure to direct sunlight. However, the literature has found long term storage of pre-cut sections can result in reduced staining intensity of some markers.14[href=https://www.wicell.org#bib14]\nImmunohistochemistry\nTiming: 5–6 h\nThis section describes a standard immunohistochemistry protocol optimized for the antibodies and tissue used in this study. Immunohistochemistry allows us to detect the location of proteins and antigens in tissue using specific antibodies (Table 3[href=https://www.wicell.org#tbl3]). The main steps are tissue preparation, antigen retrieval, blocking, antigen binding, visualization and counterstaining. This protocol describes the indirect antibody binding method which allows for amplification of the signal. The antigens are visualized using the chromogen HRP-DAB (3, 3-diaminobenzidine). Hematoxylin is a common counterstain, which stains for basophilic structures including cell nuclei, and is used in this protocol.\ntable:files/protocols_protocol_3105_14.csv",
    "Hour (h).\nIn this protocol, we stained for multiple antibodies on neighboring slides for each sample (Figure 5[href=https://www.wicell.org#fig5]). To enable histology-to-histology alignment (registration), it is vital that each slide with a different stain neighbor the next within the region of interest. Ideally, the sections should be consecutive; however, it may be necessary to skip a few sections in order to obtain the best quality section. In this case, the gap should still be small enough to allow proper alignment of different histological slides.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3105-Fig5.jpg\nFigure 5. Example staining strategy\n(A) For a single region of interest, we acquired neighboring sections with different stains, such as PLP, Neurofilament (NF), NeuN, CD68 and Ferritin close to the midline.\n(B) For multiple regions of interest, we acquired three different stains, PLP, NF, Brevican, per region of interest.\nBake the slides for 25 min at 60°C in a warming oven.\nDeparaffinize and rehydrate the sections using sequential immersion. This should be performed under a fume hood or at a table with downdraft ventilation.\n5 min in xylene three times.\n100% Industrial denatured alcohol (IDA) twice. Submerge and lift 10‒20 times.\n90% IDA in distilled water. Submerge and lift 10‒20 times.\n70% IDA in distilled water. Submerge and lift 10‒20 times.\nSoak in tap water for 2 min.\nCritical: Xylene is toxic and flammable. Inhaling xylene vapor can cause respiratory irritation and may damage organs through prolonged exposure. Always use it inside a fume hood or at a ventilated staining table. Wear protective gloves, protective clothing and safety glasses. Alternative reagents that are less toxic are available.\nAlternatives: Histo-Clear II or Citroclear clearing agents can be used as a less toxic alternative instead of Xylene.",
    "Critical: Xylene and alcohol solutions can be reused but should be changed weekly. Cross contamination of solvents, such as water in xylene, may lead to artefacts. Dispose as hazardous waste in accordance with local regulations.\nBlock endogenous peroxidases by submerging the slides in 3% H2O2 in PBS in a plastic dish. Make fresh before use. Place on an orbital shaker at 18°C–22°C for 30 min.\nAfter that, immerse the slides in water to rinse for 1 min.\nNote: It is necessary to block endogenous peroxidases when using HRP conjugated antibodies as non-specific or high background staining may occur due to endogenous peroxidase activity.\nPerform heat-mediated antigen retrieval if required using either a microwave or autoclave. This step is dependent on which antibody is being used (Table 3[href=https://www.wicell.org#tbl3]). Troubleshooting 5[href=https://www.wicell.org#sec7.9].\nMicrowave\nImmerse slides in citrate buffer (pH 6) in a plastic staining dish. Do not seal the dish to allow for evaporation.\nHeat in a microwave for 3 min on high power (800 W).\nAllow it to cool for 5 min at room temperature (18°C–22°C).\nReheat in a microwave for 1 min.\nAllow it to cool for 5 min at room temperature (18°C–22°C).\nReheat in a microwave for 1 min.\nSlowly cool by gently running water into the staining dish until cool. Do not submerge slides straight into cold water.\nNote: Optimal heating time may vary depending upon the wattage of the microwave. Aim to achieve a constant temperature of 95°C for 10–20 minutes.\nCritical: During antigen retrieval the solution may boil over and evaporate. Do not allow the level of the solution to fall below the level of the slides as the tissue may dry out. Add more solution if needed.\nOR Autoclave",
    "Immerse slides in citrate buffer (pH 6) in a plastic staining dish and place these on a metal tray. Do not seal the dish to allow for evaporation.\nRun an antigen retrieval program (121°C, 15 psi, 10 min).\nSlowly cool by gently running water into the staining dish until cool. Do not submerge slides straight into cold water.\nAlternatives: Heat-mediated epitope retrieval can also be performed using either a pressure cooker or steamer.\nNote: Antigen retrieval is often required because formalin fixation creates crosslinks with proteins which may mask the antigen of interest.15[href=https://www.wicell.org#bib15]\nNote: Some antibodies may be temperature sensitive, so it is recommended that the optimal temperature, buffer, pH, duration, and heating device be determined for each individual antibody for heat-mediated heat retrieval. We recommend making gradual changes to temperature, time and pH if the initial set up does not work.\nMount the slides into the staining coverplates (Figure 6[href=https://www.wicell.org#fig6]). These coverplates use capillary action to keep slides hydrated and reduce the amount of antibody required per slide.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3105-Fig6.jpg\nFigure 6. Photos of coverplates and slide rack used during immunohistochemistry\n(A) Coverplate. (B) Immerse the coverplate into water ensuring there are no bubbles on the surface of the coverplate then place the slide on top of the coverplate with the tissue facing the coverplate. Lift the coverplate/slide out of the water while squeezing slightly to prevent water leaking then insert the coverplate with slide into the rack (C).\nMount the glass slide to the coverplates under water.\nRemove the coverplate from the water while gently squeezing it.\nSlot the coverplate with slide into the Shandon Sequenza Rack until it clicks into position.",
    "Note: Do not use any coverplates that have scratches on the surface as this can affect the quality of the staining. Avoid trapping air bubbles between the slide and coverplate because this will cause staining artefacts.\nAlternatives: This protocol uses upright Epredia Shandon Sequenza Staining Coverplates and Racks, but flat staining trays can also be used. If using a flat staining tray, it is important to ensure that the tissue does not dry out. Keep a moist paper towel in the bottom of the tray and cover the tray to create a humid environment. Larger volumes of antibodies and DAB may be required to ensure the tissue is fully covered.\nWash with TBS-T for 5 min twice.\nCritical: During this first wash step it is important to check the speed at which the slides drain. If the coverplate empties immediately, remount the slide to the coverplate or mount it to a new coverplate.\nIncubate the slides with Protein Block solution at 18°C–22°C for 1 h.\nWe used 120 μL per slide.\nDo not wash the blocking solution off after.\nNote: Protein blocking can prevent non-specific binding of antibodies to Fc (fragment crystallizable) receptors or tissue.\nAlternatives: Alternatives such as fetal bovine serum or a serum matching the species of the secondary antibody can be used to block non-specific binding of antibodies to the tissue.\nMake the primary antibody working solution by diluting the primary antibody in antibody diluent reagent. We used the dilutions described in Table 3[href=https://www.wicell.org#tbl3]. The working solution should be made fresh before use and mixed well. When optimizing, a range of dilutions should be tested. The optimal dilution is the one that results in specific staining with low background.15[href=https://www.wicell.org#bib15]\nAlternatives: The primary antibody can also be diluted in either TBS-T or PBS.",
    "Incubate the slides with the primary antibody for 1 h at 18°C–22°C. We advise including both positive (tissue known to contain the target antigen) and negative (no primary antibody) control slides to monitor experimental quality and reproducibility. Troubleshooting 6[href=https://www.wicell.org#sec7.11].\nWe used 120 μL per slide.\nWash with TBS-T for 5 min twice.\nIncubate the slides with the secondary antibody for 1 h at 18°C–22°C. The secondary antibody we used in this protocol does not require dilution as it is ready-to-use.\nWe used 100 μL per slide.\nWash with TBS-T for 5 min twice.\nIncubate slides with DAB working solution for 5 min at 18°C–22°C. It is essential to use the same incubation time for every batch to prevent variation between batches.\nCreate a 1:50 dilution of DAB+ chromogen in substrate buffer (Liquid DAB+ Substrate Chromogen System Kit). Prepare solution just before use.\nAdd 120 μL of solution per slide.\nCritical: Do not store DAB working solution or its components in direct light.\nCritical: DAB is suspected of causing genetic defects and may cause cancer. Wear protective gloves, protective clothing and safety glasses.\nQuench the DAB with TBS-T for 5 min.\nTransfer the slides from the coverplates to a staining rack.\nTransfer the slides underwater to prevent tissue drying.\nCounterstain the slides in hematoxylin for 1–5 min. Filter the hematoxylin before using.\n“Blue” the slides under running water that is weakly alkaline for 3–5 min. This helps to convert the soluble red color of hematoxylin to insoluble blue.\nNote: Sections can be quickly viewed under the microscope after counterstaining to check the level of counterstain is sufficient to visualize cellular anatomy. If the hematoxylin is too pale the sections can be returned to the hematoxylin solution.\nDehydrate and clear the slides in sequential staining troughs.",
    "70% IDA in distilled water. Submerge and lift 10‒20 times.\n90% IDA in distilled water. Submerge and lift 10‒20 times.\n100% IDA twice. Submerge and lift 10‒20 times in each of the two troughs.\nXylene, three times. Submerge and lift 10‒20 times in each of the three troughs.\nCritical: Do not use the same 100% ethanol and xylene that was used to deparaffinize and rehydrate the sections in step 29 instead use separate staining troughs. This step should be performed under a fume hood or at a table with downdraft ventilation.\nMount the slides onto glass coverslips with DPX. This should be performed in a fume hood.\nLay a coverslip down and add 1–3 drops of DPX onto the surface.\nRemove the slide from the xylene and tap off excess xylene from the slide.\nPlace the slide facedown onto the coverslip. Ensure slide and coverslip are well aligned.\nRemove any air bubbles by gently applying pressure to the coverslip.\nCritical: DPX contains xylene and is flammable and toxic. Always use it inside a fume hood or at a ventilated staining table. Wear protective gloves, protective clothing and safety glasses.\nAllow slides to dry in the fume hood overnight (>12 h) at room temperature (18°C–22°C).\nAssess the quality of the stained sections.\nStaining is specific and without high background. Staining should look even. Troubleshooting 6[href=https://www.wicell.org#sec7.11].\nNo artefacts are present. For example, no negative areas caused by air bubbles trapped in the coverplate are observed on the stained slide.\nTissue is not damaged and has not lifted off the slide. Troubleshooting 5[href=https://www.wicell.org#sec7.9].\nPause point: Stained slides can be stored at room temperature (18°C–27°C) until needed for digitization. Slides can be stored for years.\nRegistration\nTiming: 30 min to 1 h",
    "This section describes how to align the histology sections to the corresponding MRI data in the same sample. Each digitized histology slide was registered to 3D T2-weighted structural MRI volumetric data using tensor image registration library16[href=https://www.wicell.org#bib16] (TIRL; v3). The parameters for the T2-weighted data acquisition details are described in (Table 1[href=https://www.wicell.org#tbl1]).\nSlides stained with the rabbit anti-myelin proteolipid protein (PLP) antibody (see key resources table[href=https://www.wicell.org#key-resources-table]) are directly registered to the T2-weighted MRI volume for the same sample. Myelin PLP data allows for good quality MRI-histology registration due to its excellent gray-white matter contrast. This aids the registration algorithm, which relies on edges present in the two images. The myelin PLP slides were chosen as the reference histology data for histology-to-histology registration of the neighboring slides. For example, we register the PLP histology slide to MRI, then we register the neighboring neurofilament slide to the PLP slide (Figure 7[href=https://www.wicell.org#fig7]). Each 2D slide is registered individually. We subsequently extract quantitative histological metrics (stain area fraction maps17[href=https://www.wicell.org#bib18] and structure tensor maps18[href=https://www.wicell.org#bib19]) from our digitized slides (Figure 7[href=https://www.wicell.org#fig7]F).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3105-Fig7.jpg\nFigure 7. MRI-histology registration chain and examples of outcomes\nFramework for histology-MRI registration and extraction of quantitative histology metrics.\n(A) Multi-modal MRI to multi-stain histology registration workflow. Pydpiper is used for the standard-space registration and atlas-based segmentation of the dMRI data. FSL-FLIRT is used to co-register the multi-modal MRI data. TIRL is used for the MRI-histology and histology-histology registration.\n(B) Example MRI-histology (PLP) registration, red contour line represents the white matter boundary.\n(C) Example Multi-modal MRI registration result. R2∗ is registered to T2-weighted MRI, and FA (Fractional anisotropy) is registered to T2-weighted MRI. (Note FA was calculated using the diffusion tensor model).",
    "(D) Example histology-histology registration result. Neurofilament (NF) is registered to the PLP section, and Brevican is registered to the PLP section for the same sample.\n(E) PLP slice (coronal) displayed in 3D MRI space (represented by sagittal slice).\n(F) Quantitative histology metrics obtained from PLP: Structure tensor imaging and Stain Area Fraction map. The color wheel represents the fiber orientation. Red contour represents the white matter tract boundary. The white matter mask was manually segmented in standard diffusion-weighted MRI space with a visual aid from an atlas-based segmentation output16[href=https://www.wicell.org#bib16] and a tract skeleton23[href=https://www.wicell.org#bib17] (G) Example of a failed registration of an overprocessed sample which has shrinkage and folds.\nDigitize the stained slides at 40x using a digital slide scanner (resolution: 0.25 μm/pixel).\nProcess the multi-modal MRI data (Figure 7[href=https://www.wicell.org#fig7]A).\nCorrect the T2-weighted data for 3D Gibbs-ringing.19[href=https://www.wicell.org#bib20],20[href=https://www.wicell.org#bib21]\nExtract the brain (remove the skull) from images. This can be done using an atlas-based segmentation21[href=https://www.wicell.org#bib22] obtained following a non-linear registration to a cohort-specific standard space, using the Pydpiper tool.22[href=https://www.wicell.org#bib23]\nCo-register the multi-modal MRI data (T2-weighted, T2∗-weighted and dMRI) using a rigid registration tool such as FLIRT23[href=https://www.wicell.org#bib17],24[href=https://www.wicell.org#bib24] (FMRIB Linear Image Registration Tool; Figures 7[href=https://www.wicell.org#fig7]A and 7C).\nRun the histology-to-MRI registration pipeline using TIRL. We recommend registering PLP histology to T2-weighted MRI due to their good white and gray matter contrast (Figure 7[href=https://www.wicell.org#fig7]B).\nRun TIRL after inputting the following parameters into the configuration file (slice_to_volume.json):\nThe locations of the MRI and histology files.\nThe locations of the log files.\nThe image resolutions.\nThe slicing plane and direction (coronal, axial or sagittal).\nApproximate location of the slab (center coordinates), as determined from FSLeyes.9[href=https://www.wicell.org#bib9]\nInput and output directories.",
    "Optional: Specify a mask image for either the MRI or histology data. This can be, for example, a brain mask, or a manually segmented mask. The registration can be performed for regions exclusively inside or outside the mask, depending on requirements. For instance, we might only want to conduct the registration for the region inside the brain mask, or we might want to exclude the region inside the manually segmented mask.\nNote: An example configuration file for histology-to-MRI registration can be found here https://git.fmrib.ox.ac.uk/ihuszar/tirl/-/blob/v3/scripts/mouse/slice_to_volume.json?ref_type=heads[href=https://git.fmrib.ox.ac.uk/ihuszar/tirl/-/blob/v3/scripts/mouse/slice_to_volume.json?ref_type=heads].\nNote: Steps i-vi present the default histology-to-MRI registration protocol. Depending on requirements, this can be further optimized. Consult the comments next to each parameter in the configuration file if you need to improve the registration outcome.\nNote: The MRI-histology registration pipeline includes rigid, affine, in-plane and free-form deformations. It can apply linear and non-linear transformations to account for tissue deformations and for variable angle of the slicing plane.\nEvaluate the quality of registration using Fiji8[href=https://www.wicell.org#bib8] (Figure 7[href=https://www.wicell.org#fig7]).\nImages are well aligned and anatomically correct. The edge of the tissue and gray/white matter boundaries match between MRI and histology.\nThe images are not distorted as demonstrated in Figure 7[href=https://www.wicell.org#fig7]G. This faulty registration outcome due to too many folds and breaks present in the sample.\nRegister the neighboring histology slides acquired using different stains to the PLP slide (Figure 7[href=https://www.wicell.org#fig7]D).\nRun TIRL adjusting the following parameters in the configuration file (histology_to_histology.yml):\nThe locations of the histology files.\nThe locations of the log files.\nThe image resolutions.\nOptional: Specify a mask image for either file.\nNote: An example configuration file for histology-to-histology registration can be found here: https://git.fmrib.ox.ac.uk/ihuszar/tirlscripts/-/tree/master/tirlscripts/oxford/mouse/histology_to_histology.yml[href=https://git.fmrib.ox.ac.uk/ihuszar/tirlscripts/-/tree/master/tirlscripts/oxford/mouse/histology_to_histology.yml].\nNote: The histology-to-histology registration includes rigid, followed by affine and non-linear deformations.\nAssess the quality of the histology-to-histology registration outcome. Check that:",
    "Images are well aligned and appear anatomically correct. The edge of the tissue and gray/white matter boundaries match between neighboring slides stained for different histological markers.\nThe images are not distorted.\nNote: If the input file for the histological image is in svs format, it is recommended that a lower resolution image is used for registration to reduce computational time. To do this, you need to edit the “slice”: “pages” parameter in slice_to_volume.json. We use “pages”: [2], which will specify a lower-resolution image from the .svs resolution pyramid. This corresponds to a resolution of 4 μm/pixel.\nQuantitative assessment: SAF maps\nTiming: 2 h\nSAF (stained area fraction) maps allow for quantitative measurement of immunohistochemistry stains by extracting the number of DAB-positive pixels within a given area.17[href=https://www.wicell.org#bib18] SAF maps are extracted using the ihcpy pipeline. Scripts can be found at https://git.fmrib.ox.ac.uk/spet4877/ihcpy/-/tree/main/[href=https://git.fmrib.ox.ac.uk/spet4877/ihcpy/-/tree/main/]. This pipeline allows us to analyze MRI and histology data voxelwise and can be generalized to multiple immunohistochemical stains. The pipeline involves: using color deconvolution to separate DAB and hematoxylin stains, segmenting DAB specific staining from non-specific staining, and calculation of the SAF map.17[href=https://www.wicell.org#bib18] Figure 7[href=https://www.wicell.org#fig7]F shows an example SAF map with the white matter boundary highlighted.\nHere we present the default pipeline. An artefact pipeline is also available for images that show a strong striping effect (produced when scanning the slide) or staining gradient.\nRun the optimization pipeline (iterate_alphas.sh) and adjust the following parameters. The threshold should be optimized for each different stain.\nThe location of the histology image.\nThe output directory.\nThe starting alpha, alpha increments and end alpha for the range of alphas to iterate.\nSegmentation dimension.\nPatch size.\nThe location of logfiles.\nExamine the segmentation images for each threshold to determine the best threshold for that stain.",
    "The best threshold is one without noise that accurately extracts the stain.\nRun the default pipeline (default_pipeline.sh) and adjust the following parameters:\nThe location of the histology image.\nThe output directory.\nWeighting for segmentation (threshold).\nSegmentation dimension.\nPatch size for high and low resolution SAF.\nThe location of logfiles."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}