{
  "id": 19105,
  "origin_website": "Jove",
  "title": "Preparation of Myeloid Derived Suppressor Cells (MDSC) from Naive and Pancreatic Tumor-bearing Mice using Flow Cytometry and Automated Magnetic Activated Cell Sorting (AutoMACS)",
  "procedures": [
    "Prior to starting, prepare the following solutions:\n3% Staining Media (SM):\n-3% Fetal Bovine Serum (FBS) in 1X Phosphate Buffer Saline (PBS)\nMACS Buffer (MB):\n- 0.5% Albumin from Bovine Serum (BSA) in 1XPBS\n1. Harvest Spleens from Mice\nSubcutaneously inject 6-8 week of age C57BL/6 mice (Harlan) with 1.5 x 105 murine Panc02 cells suspended in 100 μl 1x PBS (tumor-bearing; TB). Control mice (Naïve) receive 100 μl 1XPBS.\nApproximately 4 weeks post injection, euthanize mice by carbon dioxide asphyxiation.\nHarvest spleens from mice by blunt dissection using forceps and scissors then weigh using a balance. Place spleens in separate, labeled 50 ml conical tubes containing 1 x PBS.\n2. Generate a Single-cell Suspension of Leukocytes from Spleens\nAll procedures should be performed in a sterile environment under a Biological Safety Hood and cells and antibodies kept on ice.\nAssemble the cell dissociation sieve by inserting the mesh screen into the opening of the cup towards the bottom. Then, insert the retaining ring into the threaded area with the slotted side up and use the ring key to tighten the retaining ring, thus holding the screen in place. Place the assembled sieve in a Petri dish containing 10 ml 1 x PBS.\nPool spleens and use glass pestle to grind spleens against the mesh screen of the cell dissociation sieve and into the Petri dish. Repeat for each treatment group of mice.\nFilter cell suspension into a 50 ml conical tube using a 70 μm cell strainer and a 5 ml serological pipette. Centrifuge at 12,000 rpm (250-300 x g) for 5 min.",
    "Remove supernatant and resuspend pellet in 5 ml 1 x RBC lysis buffer per spleen. Pipet up and down vigorously. Incubate at room temperature for 5 min. Stop the reaction by adding 20 ml of 1 x PBS. Pipet up and down vigorously. Centrifuge at 12,000 rpm (250-300 x g) for 5 min.\nRemove supernatant and resuspend pellet in 20 ml sterile 1 x PBS. Pipet up and down vigorously.\nCount cells using trypan blue and a hemacytometer and resuspend at desired concentration in 3% SM so that 50 μl is equivalent to 5x105-1x106 cells (1x107 cells/ml - 2x107 cells/ml).\n3. Cell-surface Staining /Immunophenotyping of MDSC using Flow Cytometry\nLabel the wells of a 96-well V bottom plate for control and experimental samples and single stains for compensation controls (No Stain, NS; Mac-1-FITC; Gr-1-APC and DAPI).\nAdd 5x105-1x106 cells equivalent to 50 μl/well of splenocytes to their respective wells in the 96-well V-bottom plate. Centrifuge plate at 12,000 rpm (250-300 x g) for 5 min.\nPrepare \"Master Mix\" (MM) of Mouse BD Fc Block (Rat anti-mouse CD16/32 monoclonal antibody) diluted in 3% SM, in a 1.5 ml microcentrifuge tube on ice. As a starting point, use 1 μg Fc Block in 3% SM for a final volume of 50 μl, per well.\nCarefully remove supernatant from each well of the 96-well V-bottom plate by quickly inverting the plate over and back, over a waste container or sink without disruption of the cell pellets.\nVortex, briefly centrifuge Fc Block MM for 5 seconds and add 50 μl to all pellets in the 96-well V-bottom plate. Mix well by gently pipetting up and down, leaving samples in their wells. Incubate plate for 15 min in the dark on ice. Centrifuge plate at 12,000 rpm (250-300 x g) for 5 min.",
    "Prepare \"Master Mix\" (MM) of fluorochrome-conjugated antibodies diluted in 3% SM in a 1.5ml microcentrifuge tube on ice, while samples incubate with Fc Block. Antibodies should be titrated to determine optimal dilutions for staining procedures. As a starting point, combine a 1:25 dilution of Mac-1-FITC and 1:20 dilution of Gr-1-APC in 3% SM for a final volume of 50 μl, per sample well.\nCarefully remove supernatant from each well of the 96-well V -bottom as previously described.\nVortex, briefly centrifuge MM of fluorescent-conjugated staining antibodies for 5 seconds and add 50 μl to control and experimental pellets. Mix well by gently pipetting up and down. For single-stain compensations, add a 1:25 dilution of Mac-1-FITC, 1:20 dilution of Gr-1-APC and 75 ng/ml of DAPI, in 3% SM for a final volume of 50 μl per well to their respective wells. Add 50 μl 3% SM to unstained well (No Stain). Mix well and incubate cells in 96-well V-bottom plate for 30 min in the dark on ice.\nLabel FACS tubes (5 ml, 12 mm x 75 mm polystyrene round bottom tubes) to correspond to each well in the 96-well V-bottom plate. Add 200 μl 3% SM to each FACS tube.\nCentrifuge plate at 12,000 rpm (250-300 x g) for 5 min and remove supernatants. Wash pellets by adding 100 μl 3% SM to each pellet and mix well by gently pipetting up and down. Centrifuge plate at 12,000 rpm (250-300 x g) for 5 min. Repeat wash step once more.\nCarefully remove supernatant from each well of the 96-well V-bottom as previously described. Resuspend each pellet in 100 μl 3% SM and mix well.\nTransfer 100 μl resuspended pellet from each well of the 96-well V-bottom plate to their respectively labeled FACS tube.",
    "Prior to Flow cytometry analysis, add 75 ng/ml DAPI to control and experimental samples and DAPI single stain compensation control.\nPerform flow cytometric data acquisition of MDSC percentages. Perform compensation using the negative (no stain control) and the single positive controls. Set up a dot plot that displays the forward (FSC) versus side scatter (SSC) in log scale so that leukocyte populations of interest can be identified. Draw a large gate on all leukocytes, excluding debris and clumps with lowest forward and side scatter. From this parent gate, create a new dot plot that displays SSC versus DAPI and gate on DAPI- (live) cells. Select this newly gated population and create a dot plot that displays Mac-1 versus Gr-1 and gate on your double positive (Mac-1+ Gr-1+) MDSC.\n4. Magnetic Enrichment of Gr-1+ Leukocytes\nAliquot 1x107 remaining unstained leukocytes into appropriately labeled FACS tubes and centrifuge at 12,000 rpm (250-300 x g) for 5 min.\nPrepare MM of Gr-1-PE antibody in a 1.5 ml microcentrifuge tube. For up to 107 cells, use a 1:10 dilution of Gr-1-PE antibody in 50 μl MB, per sample. For greater cell numbers, scale up volumes accordingly. Briefly centrifuge for 5 seconds, add to leukocytes in FACS tubes and incubate for 15 min at 4 °C in the dark.\nAdd 2 ml of MB to FACS tubes, centrifuge at 12,000 rpm (250-300 x g) for 5 min and discard supernatant.\nPrepare MM of Anti-PE MicroBeads in a 1.5 ml microcentrifuge tube. For up to 107 cells, use a 1:4 dilution of anti-PE MicroBeads in 200 μl MB, per sample. For greater cell numbers, scale up volumes accordingly. Briefly centrifuge for 5 seconds, add to leukocytes in FACS tubes and incubate for 15 min at 4 °C in the dark.",
    "Add 2 ml of MB to FACS tubes, centrifuge at 12,000 rpm (250-300 x g) for 5 min and discard supernatant. Resuspend pellet in 3 ml of SB. Filter through a 70 μm strainer into a new, labeled 50 ml conical tube.\nPrepare and prime Auto MACS Pro Separator. Refill all bottles with the appropriate solutions and empty the waste bottle, if necessary. Turn instrument on and examine status of fluid containers and column(s) after initialization. All symbols should be green. On the menu, select \"Separation\" from the upper menu bar followed by \"Wash Now\" from the lower menu bar. Select \"Rinse\" from the pop-up option followed by \"Run\" to start the priming process. Once the priming process is successfully completed, the instrument will then display that it is \"Ready for Separation\" under the Status menu.\nChoose suitable chilled tube rack for tube sizes and place 50 ml conical tube with magnetically labeled cells in row A, 50 ml conical tube for negative fraction collection in row B and 15 ml conical tube for positive fraction collection in row C.\nChoose \"POSSEL_S\" cell separation program for positive selection of labeled target cells in sensitive mode from samples. Magnetically labeled target cells are retained on the automats column; unlabeled cells are released into the negative fraction collection tube in row B. On automated retraction of the magnet, the labeled target cells will be released into the positive collection tube in row C of the tube rack.\n5. Post-Sort Analysis of Gr-1+ Enriched Leukocytes\nRecount Gr-1+ and Gr-1- fractions using trypan blue and a hemacytometer. Resuspend cells at desired concentration in 3% staining medium so that 50 μl is equivalent to 5x105-1x106 cells (1x107 cells/ml - 2x107 cells/ml) and transfer 50 μl to correspondingly labeled FACS tubes.",
    "Prepare a MM of Mac-1 only, at a 1:25 dilution in 3% SM for a final volume of 50 μl per sample. Stain cells and prepare single stain compensations of Gr-PE, Mac-1 FITC and DAPI for flow cytometry analysis. Add 200 μl 3% SM and DAPI viability dye as previously described.\nPerform flow cytometric data acquisition to determine Gr-1+ and Gr-1- percentages and to also compare MDSC percentages pre- and post-autoMACS enrichment.\n6. Representative Results\nHere we show representative results for autoMACS enrichment of Gr-1+ leukocytes from pooled, naïve spleens for subsequent FACS sorting of MDSC (Figure 1). 1x106 naïve leukocytes were stained with Mac-1-FITC and Gr-1-APC antibodies to identify MDSC percentages using a BD LSRII instrument, prior to autoMACS sorting. 1x107 naïve leukocytes were then stained with anti-Gr-1-PE antibodies and PE-MicroBeads for enrichment of Gr-1+ leukocytes using an autoMACS Pro Separator. Post-autoMACS enrichment, Gr-1 percentages in Gr-1+ and Gr-1- collected fractions were evaluated using flow cytometry. 1x106 Gr-1+ leukocytes were removed and stained with Mac-1-FITC antibody to analyze and compare MDSC percentages of enriched, pooled naïve leukocytes to non-enriched, pooled tumor-bearing leukocytes by flow cytometry.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3875/3875fig1.jpg",
    "Figure 1. AutoMACS enrichment of Naïve Gr-1+ leukocytes for MDSC FACS Sorting. Spleens were harvested from pancreatic tumor-bearing and naïve mice and processed into single-cell suspensions. Flow cytometry analysis of naïve leukocytes surface stained with Mac-1 and Gr-1 fluorescent-conjugated antibodies, prior to autoMACS enrichment (A). Flow cytometry analysis of Gr-1+ (B) and Gr-1- (C) fractions post- autoMACS enrichment of Gr-1+ cells from pooled naïve leuckocytes stained with Gr-1-PE antibodies and anti-PE MicroBeads. Flow cytometry analysis of MDSC and Gr-1+ percentages post-autoMACS enrichment of Gr-1+ cells from pooled naïve leukocytes (D) compared to non-enriched pooled leukocytes from tumor-bearing mice (E) (naïve mice, n=5; tumor-bearing mice, n=3). MDSC and Gr-1 percentages are gated in the representative contour plots and histograms.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}