{
  "id": 9407,
  "origin_website": "Jove",
  "title": "A Computer-assisted Multi-electrode Patch-clamp System",
  "procedures": [
    "1. Equipment Preparation\nControl manipulators from a computer\nConnect each micromanipulator controller box to a computer through serial ports (RS-232).\nImplement the commands for positioning, querying and adjusting settings to be sent via the serial port. Given speed and hardware compatibility issues C/C++ is recommended as the programming language.\nStandardize the reference system of the manipulators so that zero is the closest possible position with respect to the motors and positive movement is directed away from the motors.\nPosition the microscope at its central position 2 mm above the specimen focal plane (coordinates [0, 0, 2000]).\nStore, for each manipulator, the local coordinates that allow the tip of a pipette to be observed in the center of the field of view of the microscope. This is the initial reference point for each electrode.\nVisualize electrode positions. It is very useful to be able to track the position of each electrode during an experiment. A graphical representation is the most intuitive way of accomplishing this. To that end the reference systems of each electrode and that of the microscope must be matched. A simple way to accomplish this is:\n\t\nBring the tip of an electrode to the center of the field of view.\nStore the position on each axis of the manipulator and each axis of the microscope.\nExecute with the x-axis of the manipulator a relatively large movement (1 mm).\nLocate the tip once more moving only the microscope.\nCalculate the difference in the microscope position since it was last measured. These are the projections of the electrode axis movement onto the microscope axes.\nRepeat steps 2.3 - 2.5 for the Y and Z axes of the electrode manipulator. This allows a matrix of projections onto the microscope axes to be determined (Figure 2) also called cosine matrix:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50630/50630eq1.jpg",
    "Invert this matrix to make it possible to calculate the movements, in three dimensions, required by the electrode manipulator to reach a given position in the microscope coordinate system:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50630/50630eq2.jpg\nUsing the initial reference point and the cosine matrix determine the position of each electrode in microscope coordinates.\nDisplay graphically, based on the microscope coordinates, the position of each electrode at regular intervals. We chose to use C/C++ drawing libraries (GDI+) to draw electrode positions every 40 msec.\nRepeat steps 1.2.1 - 1.2.7 every time manipulator angles are changed or if position changes of several millimeters are needed, for example, when the type of electrode is changed.\nEnable storing the positions of relevant features in the tissue, such as cells or anatomical reference points, in microscope coordinates.\nAcquire video and overlay relevant information.\nMechanically align the x-axis of motion of the microscope with the horizontal axis of the microscope camera.\nInstall on the computer a framegrabber with live video and overlay capability and a software development kit (SDK).\nImplement live video display operation with the SDK.\nConvert the microscope coordinate system to the camera reference system by the appropriate translation and scaling.\nDraw the relevant features in camera coordinates and overlay on the live video the resulting image at regular intervals of about 40 msec (Figure 3).\nControl Amplifiers.\nUse the amplifier software to control the amplifier settings from the interface.\nControl oscilloscopes.\nConnect the oscilloscopes to the PC using serial ports.\nDetermine the oscilloscope scale, coupling and temporal resolution for the different steps of the patch-clamp procedure in voltage-clamp (e.g. electrode in bath, seal formation, whole-cell configuration) and current-clamp.\nSend the appropriate oscilloscope setting commands whenever amplifier commands are issued from the interface.\nControl pipette pressure.\nAssemble a pressure control system according to Figure 4.",
    "Use a 12 V/5 V power supply to supply each electronic component appropriately.\nConnect the output of one membrane pump to the positive pressure buffer (a 100 ml container).\nConnect the input of one membrane pump to the negative pressure buffer (a 100 ml container).\nConnect the pipette holder tubing to a pressure sensor in the pressure control system and a pneumatic valve that connects to the main pressure compartment.\nConnect each of the pressure buffers to a valve connected to the main pressure compartment.\nConnect a valve between the main pressure compartment and the atmosphere.\nConnect a pressure sensor to the main pressure compartment.\nConnect a pressure sensor to each buffer.\nConnect the pressure control system to a data acquisition board.\nConnect each pressure sensor to one analog input.\nConnect each valve to a digital output.\nRemove atmospheric pressure offset from all sensors by opening all valves except those connecting to the membrane pumps and subtracting the measured pressure.\nImplement pressure control\n\t\t\nDefine in the interface a control to activate or de-activate positive pressure control for each pipette.\nDefine a minimal positive pressure for the pipettes of about 70 mbar.\nPeriodically (every 0.5 sec) detect whenever pressure in pipettes under active pressure control drops below the set threshold.\nUpon threshold crossing open the positive pressure buffer to the main pressure compartment and this compartment towards the pipette in question during brief periods (20 msec) until pressure in the pipettes is above threshold. Close all other valves.\nDe-activate further pressure control as the final approach towards a cell of interest is initiated.\nApply negative pressure for seal formation",
    "Close all valves and open the negative pressure buffer valve towards the main pressure compartment and this compartment towards the pipette in question for the duration the experimenter requires by keeping a button pressed.\nCentralize commands onto a human interface device.\nConnect a commercially available wireless gamepad to the PC.\nImplement readout of joystick status. For instance, use the DirectX libraries for C/C++ to perform readouts every 5 msec.\nCompare current status with previous status to detect which buttons have been pressed, released or kept pressed since last time step.\nAssign functions to each button in the gamepad. An example of this mapping is shown in Figure 5.\n2. Patch-clamp Procedure\nPrepare the brain slices of the region of interest.\nPlace a brain slice of interest, with the region of interest in the center of the microscope's displacement range.\nCell Selection\nIdentify cells of interest by browsing with the microscope. Store the position of the cells based on the microscope coordinate system with a right mouse-click on the live video display on top of the cell of interest.\nThe graphical interface will display the selected cells as well as the micropipettes for a global overview and software will add a marker on the cell position that will be overlaid on the images. Additionally an image of the cell is captured for future reference in the file 'Cell#.jpg'.\nAttribution of cells to pipettes\nAfter selecting the cells of interest, assign which pipette will record each cell. The graphical interface provides assignment controls that should be set. Visualize a preview of the final configuration by selecting the checkbox 'Show Final Positions'.\nSelect each pipette for which the final position preview is desired or check the 'Select All' checkbox. Disable the current position display for better visualization if needed.\nPrepare the Pipettes",
    "Fill the pipettes (6 - 8 MΩ are usually best if many pipettes are used) with intracellular solution and load them into their holders. Place the headstages in their fixations but do not slide them forward to avoid touching the bath with the pipette tip.\nEnable the positive pressure control and select all pipettes to ensure that the tips will remain clean. Gently slide each headstage in place.\nLocating the pipette tips\nPosition the microscope to a central position with focus 3 mm above the slice by pressing button R2 while holding button 'A'. Use the corresponding position for each manipulator as stored from the previous experiment by pressing button L2 while holding button A.\n\t\tNote: At this point there should be either a distinctive shadow of a pipette in view or a small movement along the pipette's axis should be enough to observe it in most cases. Compensation for the slight differences in pipette shape has to be performed manually.\nBring the pipette tip into focus. Place the tip on the red central dot of the video display without moving the microscope (it should still be at position [0, 0, 2000]).\nInform the software that the pipette is at the center of the display by pressing button Z while holding button C. After each pipette tip is located, send that pipette backwards so that the following one can be located by pressing button L1 while holding button A.\nApproaching the cells",
    "Once all pipette tips have been precisely located and each pipette is attributed to a cell, automatically position the pipettes close to their respective cells. Simply right-click in the center of the group of cells and select the option 'Cluster' on the popup menu. On the cluster options window that will appear, select all the pipettes that you want to position at this time and click on 'Go with all checked pipettes'. Repeat this operation for each cluster of cells of interest.\nPerform the final approach manually. The position of the pipettes relative to the cells can be specified differently but usually is simply 200 µm away from the cell in the axis of the pipette and 200 µm above it in the vertical direction, which is enough to keep the pipette's tip outside the tissue. Wait until the positioning of the pipettes is finished and move the microscope towards a pipette by pressing button R1 while holding button C.\nRecalibrate each pipette position by focusing the microscope on its tip anywhere in the video display and pressing button B while holding button C. A square grid should briefly appear indicating the identified position of the pipette. If the position is not correct, position the tip on the central dot of the video display and press button Z while holding button C.\nEstablish the cell-attached configuration\nConfirm that the cell of interest for the current pipette is correctly marked. Otherwise move the microscope to match the cell of interest with the central red dot. Mark the cell by pressing button Y while holding button C. Press button L2 while holding button C to position the pipette 200 µm away from its assigned cell, the microscope will automatically move to the corresponding position.",
    "Adjust the pipette position so it matches the red dot. Adjust the pipette offset by pressing button R1 while holding button X.\nActivate the test pulse by pressing button L1 while holding button X. Slowly approach the pipette to its attributed cell.\nUpon observing the formation of a dimple on the surface of the cell's membrane apply a brief pulse of negative pressure by pressing button Y while holding button Z to allow the applied pressure to reach the cell. A holding potential of about -65mV should established at this point by pressing the button L2 while holding button X.\nWhole-cell configuration\nOnce a Giga-seal is formed for each cell, start rupturing the membranes by applying negative pressure.\nPerform recordings\nUse the stimulation/acquisition system to perform your recordings. Apply pulses or trains of pulses on one individual cell at a time and observe responses on the remaining cells to map connectivity among the recorded cells.\nRecede pipettes\nOnce recordings are finished, recede pipettes slowly from the tissue by right-clicking on the Table radio-button. Select 'Recede->Pipettes 500 µm' to have the pipettes recede a short distance along their axes. Observe the drift in potential of the cells (clearing the tips by applying some positive pressure may help).\nTo recede pipettes all the way back, set the positioning speed to 'Fast' and repeat the same operation but choose the 'All' option. Remove the used pipettes by gently sliding out the headstages and unscrewing the pipettes from the holders. It is useful to avoid twisting the holders in their sockets since this might greatly interfere with the pipette tip position.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}