{
  "id": 8469,
  "origin_website": "Jove",
  "title": "Detection of Phospholipase C Activity in the Brain Homogenate from the Honeybee",
  "procedures": [
    "1. Capture of Foraging Honeybees\nPurchase honeybee colonies from a local distributor.\nUsing an insect net, catch forager bees which return to the hive with pollen bags on their hind legs. Transfer the bees to a standard 50-mL plastic conical tube and cap the tube (Figure 1). Put the tube on ice to anesthetize the bees.\n\tNOTE: Wear the designated jackets for beekeeping to avoid bee stings. Nursing bees can also be collected depending on the experiment. To catch the nurse bees, observe the bee's behavior on the wax comb and catch nurse bees, which poke their heads into brood cells to feed the larvae, by the wing or thorax using tweezers. Then, place the bees into a 50-mL plastic tube, cap the tube, and put it on ice as mentioned in step 1.2.\nCapture 12 foragers randomly.\n\tNOTE: This protocol uses two bees per lot, resulting in six lots. Multiple bees can be caught in one tube, and the number of the bees in a single tube is not important, as bees in each lot are combined later (see step 3.1.1). Keep the tube cool in the summer, as the high temperature in the tube injures the bees.\n2. Dissection of the Honeybee Brain\nIn the laboratory, place the 50-mL tube on ice for at least 30 min6 to anesthetize the bees.\nTo prepare the dissection stage, fold a piece of dental wax in half (the resulting size is about 3.5 x 7.5 cm) and push it into a plastic dish (60 x 15 mm).\n\tNOTE: The folded wax firmly holds the insect pins.",
    "Under a binocular microscope, separate the bee's head from its body with tweezers and fix it on the dental wax by inserting insect pins at the base of each antenna to hold the anterior of the head in an upward position (Figure 2A).\n\tNOTE: Wash the tweezers before use, using ethanol or sterilized water.\nPour enough saline solution (0.13 mol/L NaCl, 5 mmol/L KCl, and 1 mmol/L CaCl2-2H2O) on the head to cover it. Pierce the head again with the pins if the head floats in the solution. Use an ice-cold saline solution, if necessary.\n\tNOTE: However, this protocol works without the cold saline solution.\nRemove the antennae using tweezers (Figure 2B).\nMake a horizontal cut near the bases of the antennae, and longitudinally at the border of the compound eyes, using a scalpel. Then, make a horizontal cut at the top of the head. Remove the cuticle to open a window over the brain (Figure 2C).\n\tNOTE: If necessary, wash the scalpel with ethanol or sterilized water before use.\nRemove the retinae from the ocelli and the tracheae on the anterior surface of the brain, using tweezers (Figure 2D).\nExpand the cut at the border of the compound eyes dorsally and ventrally, using the scalpel (Figure 2E). Next, remove the connective tissue between the cuticle of the compound eyes and retinae by inserting the tweezers directly under the eye cuticle (Figure 2F).\nDiscard the cuticle of the compound eyes. Pick the dorsal tips of the retinae of the compound eyes with tweezers and move the tweezers in the ventral direction to carefully peel off the retinae (Figure 2G).\nCarefully remove the remaining tracheae on the anterior surface of the brain, using tweezers (Figure 2H).",
    "Cut the connective tissue between the brain and around the tissues, using tweezers, and dissect the brain from the head capsule (Figure 2H).\nPeel off the tracheae on the posterior surface of the brain, using the tweezers (Figure 2I).\nUsing a scalpel, cut the connection between the MBs and other brain regions next to the vertical lobes, which are a part of the MBs (Figure 2J).\nPlace the dissected MBs and remaining brain tissues into 1.5-mL tubes and rapidly freeze them with dry ice or liquid nitrogen (Figure 2K). Store the frozen tissues at -80 °C until use.\n\tNOTE: Handle liquid nitrogen with the designated gloves and ventilation to avoid cold burn and suffocation. Dry ice should also be handled carefully with gloves. The protocol can be paused here. The dissection and storage of the brain tissues should be performed one bee at a time to avoid protein degradation.\n3. Preparation of Brain Homogenates\nAdd 10 µL of homogenization buffer comprising of 50 mmol/L HEPES-KOH (pH 7.2), 70 mmol/L KCl, and 1.0 mmol/L CaCl2 to the frozen brain tissue and homogenize the tissue in the 1.5-mL tube by manually applying pressure with a plastic pestle. Stroke the tissue at least 200x.\n\t​NOTE: Perform the manipulations described in section 3 on ice. Use a pestle fitting right in the tube to sufficiently smash the tissues, which easily float in the homogenization buffer.\n\t\nTransfer the homogenized tissue solution to the next tissue in the lot and homogenize the tissue in the same way.\n\t\tNOTE: The honeybees in each lot are combined at this step. This protocol uses six lots.\nAdd 30 µL of the homogenization buffer.\nCentrifuge the homogenized tissue sample for 10 min at approximately 900 x g27 and 4 °C.",
    "Transfer the supernatant to a new 1.5-mL tube and centrifuge it again for 20 min at approximately 9,500 x g27 and 4 °C.\nPlace the supernatant in a new 1.5-mL tube. Store the homogenate at -20 °C until use.\n\t​NOTE: The protocol can be paused here.\nDetermine the protein concentration using the bicinchoninic acid (BCA) assay.\n\t\nDilute 2.5 µL of the homogenate with 17.5 µL of sterilized water (thus diluting the homogenate eightfold) and use all the diluted homogenate.\n\t\tNOTE: Sampling homogenate using a micropipette must be performed carefully because of its high viscosity.\nPerform the BCA assay using 0, 0.1, 0.2, 0.4, 1.0, and 2.0 mg/mL of bovine serum albumin (BSA) in 20 µL as standards.\n\t\tNOTE: Change the scale of the BCA assay as necessary, based on the volume of the homogenate and standard samples. The protocol can be paused here.\n4. PLC Reaction in Brain Homogenates\nPrepare the stock solution of the fluorogenic substrate WH-1526 dissolved in sterilized water at 50 µmol/L and store it at -80 °C.\n\tNOTE: Cover the solutions containing the substrate with foil to prevent fading.\nPrepare the reaction premixture in the required volume to achieve the following composition in 10 µL of reaction mixture: 50 mmol/L HEPES-KOH (pH 7.2), 70 mmol/L KCl, 1.0 mmol/L CaCl2, 2.0 mmol/L dithiothreitol, 50 mg/L BSA, and 12.5 µmol/L WH-15.\nDilute the homogenate with homogenization buffer, if required.\nMix the reaction premixture and homogenate containing 1.3 µg of proteins in a polymerase chain reaction (PCR) tube to achieve a final volume of 10 µL of reaction mixture.\n\t\nPrepare two types of control mixtures for the statistical analysis: put the homogenate but not WH-15 into mixture (control mixture 1), and vice versa (control mixture 2).",
    "NOTE: Prepare the reaction mixtures and control mixtures on ice to prevent protein degradation and reaction of PLC. Control mixtures 1 and 2 are used to detect fluorescence from the homogenate and free substrate, respectively.\nFlush the tube and incubate it in a thermal cycler for 30 min at 25 °C.\nStop the reaction by adding 2 µL of 25 mmol/L ethylene glycol bis (β-aminoethylether)-N,N,N',N'-tetraacetic acid.\n\tNOTE: Appropriate protein amounts and reaction times vary among experiments. Thus, to optimize the reaction condition, it might be necessary to repeat the procedures described in steps 4.1 - 5.3 in the preliminary experiments by changing the protein amount and incubation time until the fluorescence increases linearly. For reference, when the homogenate derived from the other brain regions is used, the reaction usually works linearly with 1.3 µg or less of proteins within 30 min, but the linearity decreases either with at least 2.7 µg of proteins or with an incubation time of 90 min or longer.\n5. Detection of Fluorescence Resulting from PLC Activity\nCentrifuge the reaction mixture and control mixtures for 5 min at approximately 310 x g28 and transfer 10 µL of the supernatant to different wells on a 384-well microplate applicable for fluorescence detection.\n\tNOTE: To prevent fading and a contamination with dust, cover the plate with foil.\nFlush the microplate using a centrifuge for the microplate.\nSet the plate into a microplate reader and detect fluorescence with a technical triplicate.\n\tNOTE: The excitation and emission wavelengths are 344 nm and 530 nm, respectively. If applicable (depending on the microplate reader), mix the sample mixtures for 5 s before each detection. The protocol can be stopped here.\n6. Test of the Inhibitory Action of Pharmacologic Agents",
    "Prepare stock solutions of edelfosine and neomycin at the appropriate concentrations and store them until use: edelfosine at 5.0 mmol/L and -20 °C; neomycin at 550 mmol/L and 4 °C.\nWhen preparing the reaction premixture as described in step 4.2., add inhibitors to the premixture to achieve the appropriate final concentrations: edelfosine, 1.0 mmol/L; neomycin, 0.55 mmol/L.\nAdd the homogenate to the reaction premixture and appropriate control mixtures as in step 4.4.\n\t\nPrepare three types of control mixtures: put the homogenate and inhibitor, but not the substrate into control mixture 1; add the substrate and inhibitor but not the homogenate into control mixture 2; and put the inhibitor, but not the homogenate or substrate into control mixture 3.\nPerform the PLC reaction and detection of fluorescence as described in steps 4.5 - 5.3.\n7. Statistical Analysis\nFor the detection of PLC activity using the mixtures described in section 4, calculate the fluorescence derived from the reaction between PLC and the substrate by subtracting the fluorescence emitted from the homogenate or free substrate as follows.\n\tFl (PLC activity) = Fl (reaction mix) - {Fl (ctrl 1) + Fl (ctrl 2)}\n\t​\n\tNOTE: Fl (PLC activity), Fl (reaction mix), Fl (ctrl 1), and Fl (ctrl 2) denote bona fide fluorescence derived from PLC activity, fluorescence detected in the reaction mixture, and control mixtures 1 and 2, respectively.\n\t\nAfter the measurement of fluorescence in the mixtures as described in steps 4.1 - 5.3, calculate Fl (PLC activity) according to the equation in step 7.1, and then the mean Fl (PLC activity) of the technical triplicate for each homogenate.",
    "Using the mean Fl (PLC activity) of the technical triplicate obtained in step 7.1.1, calculate again the mean Fl (PLC activity) of biological replicates of the MBs and other brain regions and compare the values between the brain tissues.\nFor the examination of PLC activity in the presence of inhibitors using the mixtures described in section 6, calculate the fluorescence derived from the reaction among the homogenate, substrate, and inhibitor as follows.\n\tFl (PLC activity with inhibitor) = Fl (reaction mix) - {Fl (ctrl 1) + Fl (ctrl 2)} + Fl (ctrl 3)\n\t​NOTE: Here, Fl (PLC activity with inhibitor) is bona fide fluorescence resulting from PLC activity in the presence of the inhibitor. Fl (reaction mix), Fl (ctrl 1), Fl (ctrl 2), and Fl (ctrl 3) are fluorescence signals detected in the reaction mixture, control mixture 1, control mixture 2, and control mixture 3, respectively.\n\t\nAfter the measurement of fluorescence in the mixtures as described in steps 6.1 - 6.4, calculate Fl (PLC activity with inhibitor) according to the equation in step 7.2. Then, obtain the mean Fl (PLC activity with inhibitor) of the technical triplicate for each homogenate.\nUsing the mean value calculated in step 7.2.1, calculate the mean Fl (PLC activity with inhibitor) of biological replicates derived from each brain tissue. Compare the Fl (PLC activity with inhibitor) and the Fl (PLC activity) obtained in step 7.1.2 in each brain tissue.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}