{
  "id": 4473,
  "origin_website": "Bio",
  "title": "Targeted Gene Mutation in Rice Using a CRISPR-Cas9 System",
  "procedures": [
    "Design gRNAs to target the genes of interestChoose targeted sites and design gRNA spacer sequence as illustrated in Figure 1. For eight model plant species, specific gRNA spacers could be readily designed using the CRISPR-PLANT database (Xie et al., 2014) (http://www.genome.arizona.edu/crispr[href=http://www.genome.arizona.edu/crispr]). Following factors may be considered for designing gRNAs.To functionally knock-out the genes of interest, designed gRNAs should introduce DSB close to 5’-end of coding region or located in the essential domains for genes’ function.  Selected gRNA spacers/target sequence should have sufficient specificity (we recommend that gRNA spacers are ranked with class 0.0 and 1.0 specificity in CRISPR-PLANT database) to avoid off-target editing.(Optional) Check gRNA folding, gRNA with three stem-loops as Figure 1 are preferred.(Optional) If possible, design a gRNA which would generate mutations at a restriction nuclease enzyme (RE) site in order to introduce RFLP (restriction fragment length polymorphism) for genotyping.After selection of targeted sites and spacer sequences, DNA oligos are synthesized to construct the gRNAs as described in Figure 3. Appropriate adaptor sequences should be added for cloning. The reverse primer should contain an adaptor of 5’-AAAC-3’ whereas the forward primer should include an adaptor with 5’-GGCA-3’ (see Figure 3 Case 1, gRNA-spacer starts with A) or 5’-GGC-3’ (Figure 3 Case 2, gRNA-spacer starts with G/C/T).Note: The gRNAs designed as cases 1 and 2 in Figure 3 showed comparable efficiency in our experiments.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140831/20140831214532_2608.jpgFigure 3. A simple guide for designing DNA oligos to construct the RGE plasmid (Xie et al., 2014)Construct gRNA-Cas9 plasmidDigest the pRGEB31 vector (see Figure 3 for vector details) by Bsa I.table:\n﻿0,1\npRGEB31,2 µg\n10x NEB Buffer 4,2 µl\n10x BSA,2 µl\nBsa I (NEB),1 µl\nAdd H2O to,20 µl",
    "Incubate at 37 °C for 2-4 h.(Optional) Add 0.5 µl of CIP to dephosphorylate the vector by incubating at 37 °C for 30 min. Purify the the digested vector using the QIAquick PCR purification kit.Prepare DNA oligo-duplex in a PCR tube as following:table:\n﻿0,1\nForward oligo (100 uM),1 µl\nReverse oligo (100 uM),1 µl\n10x T4 DNA ligase Buffer,1 µl\nT4 PNK (NEB),0.5 µl\nH2O,6.5 µl\nNote: T4 PNK is not required if the vector was not treated with CIP in step 5.Incubate the tube in a thermal cycler using the following program.table:\n﻿0,1\n37 °C,60 min\n95 °C,10 min\nCool down to 25 °C at 0.1 °C/sec,\nMake a 1: 200 dilution of oligo-duplex for ligation.Ligate the diluted oligo-duplex into vector:table:\n﻿0,1\nBsa I digested vector,n µl (~50 ng)\nOligo-duplex (diluted),1 µl\n10x T4 DNA ligase Buffer,0.5 µl\nT4 ligase (NEB),1 µl\nAdd H2O to,5 µl",
    "Incubate at room temperature (25 °C) for 2-4 h or at 4 °C overnight.Transform E. coli DH5α competent cells (homemade) using 1 µl of ligation product.Inoculate 2-4 colonies in LB medium with 50 µg/ml kanamycin. Purify plasmids from the transformed DH5α cells using QIAGEN Plasmid Mini kit.Confirm pRGEB31-gRNA plasmid constructs by Sanger sequencing using M13R (-48) primer. Rice transformationIntroduce the pRGEB31-gRNA plasmid into Agrobacterium strain EHA105.Transform rice embryogenic callus using standard Agrobacterium-mediated transformation methodGenotypingNote: The Cas9-gRNA introduced mutation could be examined in hygromycin B selected calli or transgenic plants. To examine Cas9-gRNA introduced mutations, a pair of gene specific primers is required to amplify the targeted region. Because of the high efficiency of Cas9-gRNA system in rice, steps 22 and 23 are optional and the mutation at targeting site could be readily examined by direct Sanger sequencing of PCR product (step 23). Genomic DNA extraction.Ground 10-50 mg of leaves/calli of transgenic rice plants in a 1.5 ml-tube.Add 200 µl of heated (60 °C) CTAB buffer to the tube, mixed immediately and incubate at 60 °C for 10 min with occassional shaking.Add 80 µl of chloroform, vortex and incubate in an end-to-top rocker at room temperature for 20 min.Centrifuge at 14,000 x g for 5 min at room temperature.Transfer upper aqueous phase to a fresh tube, add 1/10 Vol of sodium acetate (3 M, pH 5.3) and 2.5 Vol of 100% ethanol, and incubate on ice for 10 min.Centrifuge at 14,000 x g for 5 min at room temperature.Discard the liquid. Add 0.5 ml of 70% ethanol and centrifuge at 14,000 x g for 5min.Discard the supernatant liquid and dry the pellet in air.Dissolve the genomic DNA in 50-100 µl of H2O. Setup reactions for PCR amplification using genomic DNAs extracted from transgenic rice and wild type plant.table:\n﻿0,1",
    "Rice genomic DNA,100 ng\ndNTP (10 mM),1 µl\nForward primer (10 μM),1 µl\nReverse primer (10 µM),1 µl\n5x Green GoTaq® Reaction Buffer,10 µl\nTaq polymerase (2 U/µl),1 µl\nAdd sterile distilled H2O to,50 µl\nAmplify the targeted region by PCR [annealing temperature (x) and extension time (n) depend on primers].table:\n﻿0,1,2\n95 °C,3 min,1 cycle\n95 °C,15 sec,35 cycles\nx °C,20 sec,\n72 °C,n min,\n72 °C,2 min,1 cycle\n4 °C,Hold,1 cycle\n(Optional) If RFLP is introduced (examples was shown in Figure 4)Add 5 U of appreciate restriction enzyme to 25 µl of PCR product (~200 ng).Incubate at 37 °C for 2-4 h.Analyze the digested DNA fragment by 1% agarose gel electrophoresis.(Optional) If no RFLP was introduced, use T7E1 assay to detect mutations: Note: High fidelity DNA polymerase (Phusion DNA polymerase) should be used in step 19 for T7E1 assay. T7E1 assay could not detect homozygous mutation. Examples (line #1 and #3) were shown in Figure 4. Purify the PCR products using PCR purification column.Set up the T7E1 assay in PCR tubes as following:table:\n﻿0,1\nPCR product,100-200 ng\n10x NEB buffer 2,1 µl\nAdd H2O to,9.5 µl\nDenature and anneal PCR products using the following program:table:\n﻿0,1\n95 °C,10 min\nRamp to 85 °C at 0.1 °C/sec,－\n85 °C,5 min\nRamp to 65 °C at 0.1 °C/sec,\n65 °C,2 min\nRamp to 45 °C at 0.1 °C/sec,\n45 °C,2 min\nRamp to 25 °C at 0.1 °C/sec,\n25 °C,hold",
    "Add 0.5 µl of T7E1 to the annealed PCR product. Incubate the reaction at 37 °C for 1 h.Analyze the digestion by agarose gel electrophoresis.Clone and sequence the PCR product (at least 4 colonies) to confirm the mutation in transgenic plants. Note: T7E1 enzyme is not absolutely mismatch specific; it also nicks dsDNA slowly. Therefore, it is important to control the enzyme amount and reaction time and carefully interpret the results in T7EI assay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140831/20140831214559_2177.jpgFigure 4. Examples of PCR-RFLP assay (A) or T7E1 assay (B) using T0 transgenic plants. In PCR-RFLP assay, mutated DNA is resistant to RE digestion whereas wild type DNA would be cut into pieces. No wild type DNA was detected in transgenic lines #1, #3, and #4 (T0 generation) based on PCR-RFLP results, suggesting highly efficient mutation rate of RGE in rice. Of note, the size of extra band from line #1 and #3 in the PCR-T7E1 assay was different from the expected size in line #4, which was likely resulting from imperfect specificity of T7E1 enzyme. Based on these assays and final sanger sequencing results, lines #1 and #3 were found to contain homozygous, identical mutations at the targeted site whereas line #4 contained heterozygous, different mutations at the targeted site."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}