{
  "id": 10169,
  "origin_website": "Jove",
  "title": "The Muscle Cuff Regenerative Peripheral Nerve Interface for the Amplification of Intact Peripheral Nerve Signals",
  "procedures": [
    "All animal procedures and experiments were carried out with the approval of the University of Michigan's Institutional Care and Use of Animals Committee (IACUC). Male and female Fischer F344 and Lewis rats (~200-300 g) at 3-6 months of age are most frequently utilized in experiments, but any strain can theoretically be utilized. If utilizing donor rats instead of autologous muscle grafts, donor rats must be isogenic to the experimental strain. Rats are allowed free access to food and water both pre- and post-operatively. Following terminal endpoint evaluations, euthanasia is performed under deep anesthesia with intra-cardiac potassium chloride injection followed by a secondary method of bilateral pneumothorax.\n1. Experimental preparation of the rat\nAnesthetize the experimental rat utilizing a solution of 5% isoflurane in oxygen at 0.8-1.0 L/min in an induction chamber. Once adequate anesthesia is achieved and confirmed with the absence of corneal reflex, place the rat on a rebreather nose cone with isoflurane lowered to 1.75%-2.25% for maintenance of anesthesia.\nInject a solution of 0.02-0.03 mL Carprofen (50 mg/mL) in 0.2 mL of sterile saline with 27 G needle in the subcutaneous plane between the shoulder blades for peri- and post-operative analgesia.\nApply sterile eye ointment to both eyes to prevent corneal ulcers while anesthetized.\nUsing an electric razor, shave the lateral portion of the bilateral lower limbs, extending from the hip joint, over the thigh, and to the dorsal surface of the paw.\nSterilize the surgical site by first wiping with an alcohol prep pad, followed by povidone-iodine solution application, ending with a final cleanse with a new alcohol prep pad to remove the residual povidone-iodine solution. Repeat this alternating cleansing process three times to maintain sterility.\n\tNOTE: This can be a dermatological irritant; ensure the majority of the solution is removed.\n2. Preparation of the muscle graft",
    "Place the rat on a heating pad underneath a surgical microscope with an intraoral body temperature probe of choice for body temperature monitoring. Maintain isoflurane at 1.75%-2.25% and oxygen at 0.8-1.0 L/min.\nMake a longitudinal incision along the anterior aspect of the desired donor hindlimb extending from just above the ankle to just below the knee with a #15 scalpel.\nDissect through the underlying subcutaneous tissue using sharp iris scissors to expose the underlying musculature and distal tendons just proximal to the ankle joint. Tibialis anterior (TA) is the largest and most anterior of the muscles; the extensor digitorum longus (EDL) muscle can be found just deep and posterior to this muscle. Isolate the EDL muscle and its distal tendon from the surrounding musculature.\nEnsure isolation of the correct tendon by inserting both tines of a forceps or iris scissor underneath the distal tendon just proximal to the ankle joint. Exert upward pressure on the tendon by opening either the forceps or iris scissors. This motion should produce a simultaneous extension of all of the toes simultaneously. If isolated ankle dorsiflexion, ankle eversion, or single toe dorsiflexion occurs, the wrong tendon has been isolated.\nPerform a distal tenotomy of the EDL muscle at the level of the ankle with sharp iris scissors and dissect the muscle free from surrounding tissues working proximally towards its tendinous origin.\nOnce the proximal tendon is visualized, perform a proximal tenotomy utilizing sharp iris scissors to free the graft.\nTrim both tendinous ends of the muscle graft and cut to the desired length with sharp iris scissors.\n\tNOTE: Grafts measuring 8-13 mm have been utilized with success; however, the most common length utilized is 10 mm.",
    "On one side of the muscle graft, make a longitudinal incision along the entire trimmed length to facilitate placement of the nerve within the muscle graft and provide contact of the nerve with endomysium.\nPlace the prepared muscle graft in a saline-moistened gauze to prevent tissue desiccation.\nClose the skin overlying the donor site with 4-0 chromic suture in a running fashion.\n3. Common peroneal nerve isolation and preparation\nMark the surgical incision, which will extend from a line ~5 mm from the sciatic notch, extending to just inferior to the knee joint. Ensure that this marking is inferior to, and angled away from, the femur that can be palpated below.\nIncise through the skin and subcutaneous tissues along the marked incision line with a #15 blade. Carefully incise through the underlying biceps femoris fascia, taking care not to extend through the entire depth of the muscle as the sciatic nerve lies just below.\nUtilizing blunt-tipped small scissors or a hemostat, dissect carefully through the biceps femoris muscle.\n\tNOTE: The sciatic nerve travels in this space underlying the biceps, oriented in approximately the same direction as the incision marked on the skin. There are three notable sciatic nerve branches: sural (most posterior and smallest of the nerves), tibial (typically most anterior, but this nerve always dives deep to the knee joint), and common peroneal (typically located between tibial and sural, always travels above the knee joint).\nIdentify the common peroneal (CP) nerve and carefully isolate it from the surrounding nerves using a pair of micro-forceps and micro-scissors. Remove any surrounding connective tissue from the middle 2 cm of the nerve. Take care not to crush the CP nerve with forceps in this process, as crush injury can alter endpoint results.",
    "Over the central-most portion of the freed CP nerve, perform an epineurial window by removing 25% of the epineurium along the length of the nerve that matches the desired length of the muscle graft.\nTo perform this hold the proximal epineurium with micro-forceps, cut into the epineurium immediately underlying with micro-dissection scissors, and remove ~25% of the epineurium traveling distally along the nerve. Take care to remove this segment in one piece, as multiple attempts can cause irregular epineurial removal, increasing the risk of nerve injury. \n\tNOTE: The nerve tissue underlying the epineurium will have a goo-like texture; noting this quality of nerve ensures the correct tissue plane has been removed.\n4. MC-RPNI construct fabrication\nRemove the muscle graft from the saline-moistened gauze and place it under the central portion of the CP nerve where the epineurial window was created. Rotate the nerve 180° so the epineurial window section contacts intact muscle and does not underlie the eventual suture line.\nUsing an 8-0 nylon suture, suture the epineurium of the CP nerve both proximally and distally to the muscle graft within the groove created in step 2.8 using simple interrupted sutures to secure epineurium to endomysium.\n\tNOTE: Place these stitches, ensuring the muscle is at normal resting length. Stretching or compressing the muscle too much can impact regeneration and signaling capabilities later on.\nCircumferentially wrap the edges of the muscle graft surrounding the now-secured nerve and suture in place utilizing simple interrupted 8-0 nylon stitches (~4-6 depending on length).\nOnce hemostasis is achieved, close the biceps femoris fascia over the construct with 5-0 chromic suture in running fashion.\nClose the overlying skin in running fashion with a 4-0 chromic suture.\nCleanse the surgical area with an alcohol prep pad and apply antibiotic ointment.",
    "Terminate inhalational anesthetic and place the rat in a clean cage isolated from cage mates and allow to recover with food and water ad lib.\nOnce the rat has suitably recovered, place it back with cage mates in a clean cage.\n\tNOTE: These constructs require maturation of three months at the minimum to produce adequate nerve signal amplification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}