{
  "id": 12002,
  "origin_website": "Jove",
  "title": "Monitoring eIF4F Assembly by Measuring eIF4E-eIF4G Interaction in Live Cells",
  "procedures": [
    "HEK293 cell line was used for the protocol and was cultured in Dulbecco's Modified Eagle Medium supplemented with 10% Fetal Bovine Serum, 2 mM L-glutamine, and 100 U/mL penicillin/streptomycin. Cells were cultured at 37 °C with 5% CO2 in a humidified environment.\n1. Quantitative assessment of eIF4F complex disruption via eIF4E:eIF4G604-646 complementation assay\nCell culture and transient transfection of eIF4E:eIF4G604-646 complementation assay\n\t\nUse freshly thawed cells with less than 20 passages for all experiments. On day 1, determine the cell number using a standard cell counter and count the total viable cells using the Trypan blue exclusion method13.\nSeed 6-well plates with 0.9 - 1.2 x 106 of HEK 293 cells per well in 2 mL of standard growth medium.\n\t\tNOTE: In order to achieve the best transfection efficiency within the cell lines indicated above, ensure that the plated cells are 70-90% confluent the day after seeding.\nOn the morning of day 2, co-transfect cells with SubA-eIF4E and eIF4G604-646-SubB plasmid using a lipid-based transfection reagent (see Table of Materials) as described below.\n\t\t\nDilute 9 µL of liposome-based solution in a tube containing 125 µL of reduced serum medium without phenol red (see Table of Materials) for each transfection and incubate at room temperature for 5 min.\nPrepare master mix of DNA by diluting 3 µg of each plasmid in 125 µL of reduced serum medium for each transfection tube.\nAdd 12 µL of enhancer reagents to the DNA master mix tube, mix well and immediately add the DNA: enhancer master mix to each tube of diluted liposomes in a ratio 1:1. Incubate for 15 min at room temperature.\nAdd the DNA-lipid complex to each well and incubate the cells in a 37 °C incubator with 5% CO2 for 24 h.",
    "On the morning of day 3, rinse each well with 1 mL of PBS.\nRemove the PBS and incubate cells in each well with 0.3 mL of trypsin for 5 min at 37 °C.\nNeutralize trypsin by adding 2 mL of the reduced serum medium without phenol red containing 0% FCS in each well and transfer transfected cells into a 15 mL tube.\n\t\tNOTE: Phenol red can interfere with the luciferase activity; therefore, cells must be handled from this step onward in medium without phenol red.\nSpin down cells for 5 min at 290 x g and aspirate the medium. Resuspend the cells in 2 mL of the reduced serum medium without phenol red containing 0% FCS. Count as described in step 1.1.\nSeed transfected HEK 293 cells in 96 well opaque plates at a density of 30,000 cells per well in 90 µL of medium without phenol red containing 0% FCS. In order to obtain 3 technical replicates within the same experiment for 3 different compounds, seed 60 wells of the plates with cells excluding the wells on the edges.\nImmediately after seeding the transfected cells, add 10 µL of 10% DMSO compound solution (see step 1.2).\nCompound preparation\n\t\nPrepare 1 mM compound stock solutions by dissolving the compound of interest in 100% DMSO (v/v). In order to have 3 replicates for each compound titration, use 8 µL of the 1 mM compound stock solution.\n\t\tNOTE: The volume of 1 mM stock compound used is more than what it is needed. This is done to take into account pipetting errors if any.\nPerform a 2-fold serial dilution of the stock compound solution with 4 µL of the 1 mM stock into 4 µL of 100% DMSO for each titration point.",
    "NOTE: For a complete compound titration, perform 9 serial dilutions from the starting stock in 100% DMSO. If multiple compounds need to be tested, use a 96 well plate and a multichannel pipette to facilitate this step and subsequent dilutions.\nAdd 36 µL of HPLC grade sterile water for each point of the 2-fold serial dilution to prepare a 40 µL of 10x working solutions in 10% DMSO (v/v) (i.e. 100 μM to 0.39 μM 10% DMSO stock series will lead to a final solution of 10 μM to 0.039 μM,in 1% DMSO when added to cells). As for treatment control, also prepare a 10% DMSO only stock solution in HPLC grade sterile water.\nAdd 10 µL of 10x working solutions to the cells in the 96 well opaque plate in order to yield the intended final concentration with a residual DMSO concentration of 1% (v/v) in a total volume of 100 µL and incubate for 3 h at 37 °C with 5% v/v atmospheric CO2.\nLuciferase complementation and viability assay\n\t\nAfter 3 h of drugging, start preparing the luciferase substrate reagent by combining 1 volume of substrate with 19 volumes of the dilution reagent (see manufacturer's instructions).\n\t\tNOTE: The luciferase assay is performed using a commercially available kit (see Table of Materials).\nUse a multichannel pipette to immediately add 25 µL of substrate reagent.\nShake the plate at 350 rpm for 50 min on an orbital shaker at room temperature.\nAssess luminescence using a plate reader. To do so, set the mirror reader on luminescence and the emission filter on 455. Use a measurement height of 6.5 mm with a measurement time of 1 s.",
    "In order to asses cell viability, add 33 µL of viability assay reagent and then re-measure luminescence again after 15 min at room temperature, using the plate reader.\nAssess luminescence with the plate reader by setting the mirror reader on Luminescence and the emission filter on 600 nm. Use a measurement height of 6.5 mm with a measurement time of 1 s.\n\t\tNOTE: Viability is assessed by measuring the intracellular level of ATP upon cell lysis as per manufacturer instructions. Multiplexing is possible in this case since the viability assay uses a different luciferase with a different emission wavelength.\nUse the data to determine the IC50 values of each compound by curve fitting the data to a 4 parameter fitting curve equation:\n\t\tY = ((A-D)/(1+((x/C)^B))) + D\n\t\tThe numerical values D and A must be constrained in the curve fitting process:\n\t\tD = luminescent value on the Y-axis for minimal curve asymptote or minimal theoretical level of response expected from the eIF4E:4G complementation assay.\n\t\tA = luminescent value on the Y-axis for maximal curve asymptote or maximal theoretical level response expected from the eIF4E:4G complementation assay.\n\t\tNOTE: The value for the minimal response is derived from the 1% DMSO (v/v) control treatment and the value for the maximal response is derived from the maximal response of a high affinity mTOR inhibitor that has plateaued with no effect on cell viability.\n2. Correlating eIF4E:eIF4G604-646 assay inhibition with eIF4F complex disruption in cells\nTo confirm that the signal being measured by the assay corresponds to the physical disruption of eIF4E-eIF4G interaction by the compound, seed cells as described in step 1.1.",
    "The day after, replace the medium with 1 mL of reduced serum medium not containing phenol red and incubate for 4 h with the compound of interest. Ensure residual DMSO concentration of 1% (v/v) in a total volume of 1 mL.\n\tNOTE: In order to easily allow a correlation with the result, use compound concentrations at the beginning, midpoint and endpoint of the measured complementation assay titration curve.\nLyse cells and performed m7GTP pull down to isolate eIF4F and eIF4E:4EBP1 complexes. Detailed procedures on how to perform the m7GTP pull down experiment can be found elsewhere14.\nDetect m7GTP bound eIF4G, eIF4E and 4EBP1 protein levels by western blot analysis, and then correlate to eIF4F complex disruption with complementation assay signal inhibition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}