{
  "id": 9861,
  "origin_website": "Jove",
  "title": "Quantitative Static and Dynamic Assessment of Balance Control in Stroke Patients",
  "procedures": [
    "The clinical project was approved by the Medical Ethics Association of the Fifth Affiliated Hospital of Guangzhou Medical University and has been registered at the China Clinical Trial Registration Center (No. ChiCTR1900021291) with the title “The mechanism and effect of Pro-kin system training on static and dynamic balance”.\n1. Participant recruitment\nInclude patients with brain hemorrhage or infarction confirmed by magnetic resonance imaging (MRI) or computerized tomography (CT); more than one month onset of stroke; stable vital signs of life; Mini-mental State Examination (MMSE)18 score of >10 points; able to stand alone for more than 1 min; able to walk 6 m with or without walking aids, that are able to cooperate with the whole assessment protocol.\nExclude any patients with any medical condition that would prevent them from following the protocol.\nObtain written informed consent from each patient before their participation.\nGather demographic information (i.e., date of birth, weight, height, past medical history, and any past or current medications) from all the patients.\n2. Clinical scale assessment\nConduct the lower extremity subscale of the FMA test13. Ask the patient to complete a 7-point subscale (total score of 34 points) for the measurement of motor impairment on reflexes, coordination, and voluntary movements of the paretic leg poststroke. Score the patient. A higher FMA-LE score indicates a better level of motor recovery.\nConduct the Timed Up and Go (TUG) test19. Ask the patient to perform three consecutive TUG trials at a self-selected pace for safety and comfort20.\n\t\nAsk the patient to sit in a chair with their arms resting comfortably on their lap and hips positioned on the back of the seat.",
    "Ask the patient to rise from the chair, walk 3 m, turn around, return to the chair, and sit down. The therapist will time the whole process using a stopwatch.\nAllow the patient to use assistive devices during the TUG test, if needed. The average recorded time of the three tests is the patient’s final score. Score the patient.\nConduct the BBS test12 by asking each patient to perform 14 tasks of a 5-point scale (ranging from 0–4) (total score, 56 points). Some examples of these tasks are provided below.\n\t\nAsk the patient to stand up and try not to use their hands for support.\nAsk the patient to stand for 2 min without holding on to anything.\nAsk the patient to sit with their arms folded for 2 min.\nAsk the patient to sit down.\nAsk the patient to transfer one way towards a seat with armrests and one way towards a seat without armrests.\nAsk the patient to stand still for 10 s with their eyes closed.\nAsk the patient to place their feet together and stand without holding on to anything.\nAsk the patient to lift one arm/two arms to 90˚ , and then stretch out his/her fingers and reach forward as far as he/she can. Measure the distance of forward reach with a ruler.\nAsk the patient to pick up the shoe/slipper that is placed in front of his/her feet.\nAsk the patient to turn and look directly behind over their left shoulder and then their right shoulder.\nAsk the patient to turn completely around in a full circle, and then turn a full circle in the other direction.\nAsk the patient to place each foot alternately on a step/stool four times.\nAsk the patient to place one foot directly in front of the other.",
    "Ask the patient to stand on one leg as long as they can without holding on to anything.\n\t\tNOTE: Items 2.3.2, 2.3.3, 2.3.6, 2.3.7, and 2.3.14 are classified as static items. All other items are classified as dynamic items. Score the patient. Scores of 0-20 indicate a high risk of falling, scores of 21–40 indicate a medium risk of falling, and scores of 41–56 indicate a low fall risk9.\n3. Static and dynamic balance instrument evaluation\nPatient preparation\n\t\nInstruct the patient to take off their shoes and socks and to wear a trunk sensor on the xiphoid. The trunk sensor is a circular signal transmitter used for detecting the inclination of the subject's trunk position (backward forward and mediolateral) and collecting data (Figure 1 imgsrc://cloudfront.jove.com/files/ftp_upload/60884/60884img1.jpg).\nExplain all the procedures to the patient and then ask the patient to stand barefoot on the support surface (Figure 1).\nAsk the patient to stand on the fixed tilting board with one foot and then both feet to get used to the tilting board for 2 min (Figure 1 imgsrc://cloudfront.jove.com/files/ftp_upload/60884/60884img2.jpg).\n\t\tNOTE: During the last three testing modules, the tilting board is used to detect the participant’s COG in real time with four decelerator pistons that can automatically modify the active resistance of the board as needed in dynamic balance measurements. The surface of the tilting board is divided into eight different areas (S1, S2, S3, S4, S5, S6, S7, and S8) with four axes (A1-A5/ Backward – Forward, A2-A6, A3-A7 /Medium – Lateral, and A4-A8) (Figure 1 imgsrc://cloudfront.jove.com/files/ftp_upload/60884/60884img2.jpg), and a built-in computer to accurately calculate swing range of patients during the testing.\nStability assessment\n\tNOTE: The stability assessment is used for assessing the ability to maintain postural stability under static conditions.",
    "Click the Static Stability Assessment button to start the Stability Assessment Module. Then, fix the auxiliary testing equipment onto the tilting board to guarantee that the patient’s foot is always in the same position among the different modules of the tests (Figure 1 and Figure 2B).\nClick the Reset button to reset the tilting board.\nInstruct the patient to place the medial margin of their both feet against the auxiliary testing equipment and the highest points of the foot arches on the A3 and A7 axis, and then to place their hands at the sides of their body in a natural position (Figure 2A,C).\nClick the Reset Trunk button to run the trunk sensor’s automatic calibration program.\nClick the Options button to select the Sequence Opened eyes/Closed eyes (Romberg) to begin the Romberg Test10 for either the open or closed eyes test.\nTurn the computer monitor to the side to keep it out of the patient’s view (Figure 2). Then, instruct the patient to stare at the ‘marker’ in front of them (1.5 m distance between the eyes and the marker) and to stand stable with their feet in a stationary position (Figure 2A).\nClick the Start button and ask the patient to stand stable with their eyes open for 30 s. The program will be terminated automatically.\nClick the Start button and ask the patient to stand stable with their eyes closed for 30 s. The first 5 s phase of the eyes open/eyes closed balance test is for patient adaptation, whereas the next 25 s phase is for the formal testing and data recording. The program will be automatically terminated.\nClick the Results button to obtain the report from the built-in software calculations. For the specific calculation formula refer to the user manual (Figure 2D).\nProprioceptive assessment",
    "NOTE: Proprioceptive assessment is used to evaluate the postural stability and fine coordination function of lower limbs of stroke subjects.\n\t\nClick the Multiaxial Proprioceptive Assessment button to start the Proprioceptive Assessment Module.\nRemove the auxiliary testing equipment from the test tilting board and click the Reset button to reset the tilting board.\nAsk the patient to get ready into position as shown in Figure 3 (i.e., sagittal foot spread with hands on the bilateral armrest) and with the individual foot to be tested on the mobile tilting board (i.e., the second metatarsal and midpoint of heel located on the A1–A5 line, and the highest point of the arch placed on the A3 and A7 axis), and the other foot resting on the support surface parallel to the foot being tested (Figure 3D).\nClick the Options button and click off the Static buttons for both axes (front-behind and left-right) to get the tilting board into a dynamic state for 3 s. Pay attention to the patient’s position in case of falling.\nClick the Soft button to set the force absorbers parameter to 1.\n\t\tNOTE: The available levels of the force absorbers range from 1 (the most unstable) to 40 (almost static).\nClick the Variables to set Limits to “5°-10°”, Rounds (number of circles) to “3”, and Test to “Compared” for the left-right compared model. The left-right compared model indicates the left and right foot tracing will be overlapped in the single graph.\nMove the computer monitor in front of the patient at their eye level so that the patient can get visual feedback.\nClick the Enable Trunk button for the red crosser (COG position) to show up, and then click the Reset Trunk button.",
    "Click the Start button. The pointer of the footboard (blue cross) is shown on the screen and is responsive to the foot’s movement (Figure 3A,E).\nAsk the patient to look at the computer screen to get real-time visual feedback and try to control the blue cross. Instruct the patient to touch the red point first and then follow the blue circle line reference for three circles.\nEnsure that the right foot moves in clockwise circles (Figure 3B) and the left foot in counterclockwise circles (Figure 3C). The motion tracking appears red on the screen.\nClick the Results button. The software will supply different calculations to analyze.\nLimits of stability module\n\tNOTE: This module measures the ability to maintain postural stability under dynamic conditions.\n\t\nClick the Limits of Stability button to start the Limits of Stability Module.\nClick the Reset button to reset the tilting board.\nTurn off the testing tilting board fastener to set the tilting board into stable mode. Then, fix the auxiliary testing equipment on the test tilting board.\nAsk the patient to maintain an upright stance with their arms resting by their sides and their feet in a standardized foot position as required in the Stability Assessment Model (see step 3.2.3) (Figure 2C).\nPosition the computer screen directly in front of the patient at eye level. The patient’s COG position is displayed on the screen as the blue cross that moves in response to the movements of their body’s COG (Figure 4A).",
    "Click the Start button and then ask the patient to move the blue COG cross by leaning the body away from the midline as quickly and closely as possible to randomly appearing flashing squares (spread in eight directions, A1-A8, Figure 3B) at first and then the original midpoint (blue square in the middle). Instruct the patient to reach their maximal lean-out toward each of the eight targets for the entire LOS test setup (Figure 4B).\nClick the Results button. The software will supply different calculations to analyze.\n\t\tNOTE: If the patient lost their balance while leaning (e.g., they took a step, held something, or shifted their foot position during testing), their feet should be repositioned, and the trial should be repeated.\n4. Data analysis\nObtain and record all demographic characteristics and clinical scale assessment data.\nObtain the results of Static and Dynamic Balance Instrumental evaluation using the software associated with the balance system at the end of each test by click the Result button.\n\tNOTE: The most significant data are presented in graphs like those shown in Figure 5, Figure 6, and Figure 7. Based on the manual, the major parameters and their meanings are listed in Table 1.\nTransfer the data to statistical software for analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}