{
  "id": 19864,
  "origin_website": "Wiley",
  "title": "Assays to Study Enzymatic and Non-Enzymatic Protein Lysine Acetylation In Vitro",
  "procedures": [
    "This protocol describes the generation of site-specifically acetylated proteins that can be used as substrates for deacetylases to analyze deacetylation by sirtuin deacetylases and/or classical deacetylases (KDACs). To generate site-specifically lysine-acetylated proteins, the genetic code expansion concept (GCEC) represents a powerful tool. The GCEC is based on a synthetically evolved orthogonal acetyl-lysyl-tRNA-synthetase (AcKRS3)/tRNACUA pair derived from the pyrrolysyl-tRNA-synthetase (PylRS)/tRNACUA (PylT) pair from an archaea of the genus Methanosarcina. Here, as an example, we describe the site-specific lysine acetylation of the small GTP-binding protein Ran at Lys71 (Ran AcK71), applying the GCEC (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0002]), using a one-plasmid system. The application of the GCEC allows the production of site-specifically and quantitatively lysine-acetylated proteins, which are natively folded (Knyphausen et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0033]; Lammers, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0039]). These natively folded proteins can then be used to study sirtuin- (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002]) and KDAC-catalyzed (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0003]) deacetylation.\nMaterials\nCompetent E. coli BL21 (DE3) cells (Novagen®; Sigma-Aldrich, cat. no: 69450)\nPlasmid pRSF-Duet1 (Sigma-Aldrich, cat. no.: 71341) expressing ackRS3/MbpylT/ranUAG71 (see Strategic Planning)\nLysogeny broth (LB) agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0029]) containing 50 µg ml-1 kanamycin\nLysogeny broth (LB) medium (sterilize by autoclaving) (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0028])\nKanamycin sulfate (50 mg ml-1 stock in H2O; Carl Roth, CAS no. 25389-94-0)\n1 M N-(ε)-acetyl-L-lysine (Chem-Impex Int.; CAS no. 692-04-6, cat. no. 05364) in sterile-filtered (0.22-µm filter) deionized water (prepare fresh)\n2 M nicotinamide (Sigma-Aldrich; CAS no. 98-92-0, cat. no. N3376) in sterile-filtered (0.22-µm filter) deionized water (prepare fresh)\nIsopropyl β-D-1-thiogalactopyranoside (IPTG; 1 M stock in H2O; Carl Roth, CAS no. 367-93-1)\nBuffers 1.1, 1.2, 1.3, 1.4, and 1.5 (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0002])\nLiquid nitrogen (CAUTION: handle with care; use protective equipment for extremely low temperatures and provide a well-ventilated environment)\n5× SDS-PAGE sample buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0036])\n12% v/v SDS-PAGE gel (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0033])\nSDS-PAGE running buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0035])\nSDS-PAGE staining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0037])",
    "SDS-PAGE destaining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0034])\n100-ml and 5-L baffled Erlenmeyer flasks (VWR, cat. no. 214-1131 and 214-1137)\nIncubator (e.g., Function Line B20; Heraeus Holding GmbH)\nShaking incubator (e.g., Infors HT Multitron Standard; Infors AG)\nUV/Vis spectrophotometer (e.g., Varian Cary 50 UV-Vis spectrophotometer or NanoDrop ND 1000, VWR International GmbH)\nHeat block (e.g., Mixing Block MB-102, Bioer Technology Co.; and Digital Heatblock, VWR International GmbH)\nRefrigerated microcentrifuge\nCentrifuge (e.g., SORVALL RC 6 with Rotor SLA-1500 and Rotor SS-34, Thermo Fisher GmbH)\n250-ml glass beaker (VWR, cat. no. 213-1121)\nSonicator [e.g., Sonopulse HD 4100 with UW 100, TS133V, SH 100G, and tip TT213 (ᴓ12.7 mm); BANDELIN Electronic GmbH & Co. KG, Berlin, Germany]\n5-ml HisTrapTM FF crude column (Cytiva, cat. no. 17-5286-01)\nAutomated FPLC system and fraction collector (Cytiva, Bio-Rad)\nSterile bottle-top filters, 0.45-μm pore size\nElectrophoresis chamber and power supply (e.g., Bio-Rad Laboratories GmbH)\nAmicon® Ultra-15 centrifugal filter unit (10 kDa MW cut off; Merck, cat. no. UFC901024)\nBlack Corning® 96-well plate with flat bottom\nPreparative size-exclusion column: HiLoad® 26/60 Superdex®75 pg column (Cytiva, cat. no. 28-9893-34)\nMedium-pressure chromatography system (low MPA range) with UV detection (280 nm) (e.g., Äkta Purifier, GE Healthcare) and a fraction collector\nNitrocellulose/PVDF membrane (Carl Roth GmbH & Co. KG)\nSemi-dry Blotter Trans-Blot® TurboTM Transfer System (e.g., Bio-Rad Laboratories GmbH)\nChemiluminescent detection system (e.g., Octoplus QUPLEX, Intas Science Imaging Instruments GmbH)\n1.5-ml microtubes (BRAND, cat. no. 780500)\nAdditional reagents and equipment for SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]) and immunoblotting (Western blotting; Ni, Xu, & Gallagher, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049])\nExpression of His6-Ran AcK71\n1. Transform E. coli (BL21) DE3 cells with pRSFDuet-1/ackRS3/MbpylT/ranUAG71\n2. Plate cells on selective LB agar plates containing 50 µg ml-1 kanamycin and incubate the plates overnight at 37°C.",
    "3. Add 25 ml of LB medium containing 50 µg ml-1 kanamycin to a 100-ml baffled Erlenmeyer flask. Inoculate this pre-culture with four to five single colonies from the LB agar plate from step 2. Incubate the pre-culture overnight (∼16 hr, 37°C, and 160 rpm)\n4. Prepare eight 5-L baffled Erlenmeyer flasks, each with 1.25 L of LB medium supplemented with 50 µg ml-1 kanamycin. Inoculate each of these (main culture) with 12.5 ml of the pre-culture (i.e., prepare a 1:100 dilution) and grow to an OD600 of 0.6 (37°C, 140 rpm).\nIt will take approximately 2-3 hr to reach an OD600 of 0.6.\n5. Supplement each flask with 12.5 ml of 1 M N-(ε)-acetyl-L-lysine (final concentration in culture: 10 mM) and 12.5 ml of 2 M nicotinamide (final concentration in culture: 20 mM). Reduce temperature to 18°-20°C.\nPrepare the N-(ε)-acetyl-L-lysine and nicotinamide solutions fresh before use.\n6. After 30 min, add IPTG to a final concentration of 100 µM to induce the expression of the POI (here: His6-Ran AcK71) and incubate for 12-24 hr (at 18°-20°C, 140 rpm).\n7. Harvest the cells by centrifugation (10,000 × g, 4°C, 20 min).\n8. Resuspend the cell pellet in resuspension buffer (buffer 1.1) and store the pellet at −80°C. Use ∼10-15 ml of resuspension buffer per pellet from 1 L of culture.\nStoring the cell pellet at −80°C ensures that enzymatic activities such as proteases and deacetylases are stopped. Expression conditions should be optimized depending on the POI, and this can be done by varying parameters such as IPTG concentration, expression temperature, duration of induction, expression host, and resuspension buffer components, among others (Riggs, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0055]; Terpe, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0061]).\nThis is a safe stopping point.\nPurification of Ran AcK71 (see Current Protocols article: Wingfield, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0073])",
    "9. Thaw the cell pellet on ice. Transfer the suspension into a glass beaker and lyse cells by sonication on ice (five cycles of 2 min, intensity 60%, pulse 0.5 s/2.0 s).\nTo prevent overheating of the cells, thermal degradation, and precipitation of liberated proteins, wait 2 min between cycles.\nCells might also be lysed using alternative methods such as French press or microfluidizer. Cell lysis can also be improved by addition of lysozyme.\n10. Centrifuge the lysate at 39,000 × g, 4°C, for 45-60 min to remove the insoluble fraction. While waiting for the centrifugation, prepare the Ni2+-NTA metal affinity column (5-ml HisTrapTM FF crude column) by equilibrating it with 5 column volumes (CVs) of buffer 1.1.\n11. Load the cleared supernatant (which contains the POI; here: His6-Ran AcK71) onto the Ni2+-NTA metal affinity column (5 ml HisTrapTM FF crude column) using an automated FPLC system (Cytiva, Bio-Rad) at 4°C.\nTo remove remaining cell debris, the supernatant can be filtered using a 0.45-µm bottle top filter.\n12. Wash the column with >10 CVs washing buffer (buffer 1.2) to remove unspecifically bound proteins and contaminants. Wash with 2 CVs of buffer 1.3.\n13. Elute the POI on an FPLC system, applying a 10-500 mM imidazole gradient using buffer 1.3 and buffer 1.4. Follow the absorption at 280 nm (A280) to monitor elution of the POI and the conductivity to monitor the imidazole gradient over time. Collect the flow-through using automated FPLC system and fraction collector.\n14. Analyze the protein-containing fractions by SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]).\n15. Pool the fractions containing the POI and concentrate via ultrafiltration (4°C, 4000 × g) using an Amicon® Ultra centrifugal filter device with a suitable MWCO, following the manufacturer's instructions.",
    "The MWCO of the ultrafiltration device should be at least twice the molecular weight of the POI, to avoid flow-through of the POI. Keep the flow-through and analyze this for the presence of the protein.\nWhile concentrating the protein, start equilibrating the size-exclusion column to avoid any delay in the purification (step 16).\n16. Equilibrate the SEC column with >2 CVs of SEC equilibration buffer (buffer 1.5).\nTo equilibrate the size-exclusion column (HiLoad® 26/60 Superdex®75 pg), use 400 ml of SEC equilibration buffer. The equilibration and purification should be performed at 4°C. Importantly, the pH value of Tris·HCl-based buffers should be adjusted at 4°C, as the pH value of Tris·HCl is temperature sensitive.\nDepending on the expected molecular weight of the POI and the oligomeric state (here: His6-Ran AcK71: MW:26001.69 Da; monomer), a suitable column should be selected to avoid elution in the columns’ void volume and to obtain good separation from remaining contaminants.\n17. Load the concentrated POI (from step 15) onto the equilibrated SEC column and elute on medium-pressure chromatography system using buffer 1.5. Monitor the elution by following the A280. Collect the eluate using a fraction collector.\nSelect a suitable SEC column depending on the protein amount to be loaded, to obtain good separation from contaminants. If it is known that co-factors/co-substrates are bound to the POI (that absorb at a different wavelength; e.g., His6-Ran AcK71 binds GDP, which absorbs at 254 nm), this can be used to follow the elution if a monochromator is used that allows simultaneous monitoring at several wavelengths.",
    "18. Analyze the protein-containing fractions by SDS-PAGE (Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]) to identify the POI-containing fractions (see Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]). Then, pool the POI-containing fractions, concentrate the POI using an Amicon Ultrafiltration device, and determine the concentration of the POI (by measuring A280). Aliquot the POI-containing solution, snap freeze the solution in liquid nitrogen, and store the POI at −80°C until further use.\nFor His6-Ran AcK71, use a 10-kDa MWCO (MW: 26 kDa). Determine the concentration either by performing a Bradford assay or by applying the Lambert-Beer law using the protein's extinction coefficient. Importantly, for Ran, the extinction of the bound guanine-nucleotide must be included (for His6-Ran AcK71: 18.450 M-1cm-1 + 7.765 M-1cm-1).\nCAUTION: Handle liquid nitrogen with care. Wear protective equipment and use in a well-ventilated environment.\nChoose appropriate protein concentrations and aliquot sizes to avoid several freeze-thaw cycles.\n19. Evaluate the successful incorporation of acetyl-L-lysine by immunoblotting using a specific anti-acetyl-lysine antibody (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0002]) (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002]).\nIn addition, electrospray ionization mass spectrometry (ESI-MS) can be used to show the quantitative acetyl lysine incorporation (acetyl-group: 42 Da) (Lammers, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0039]). Perform tryptic digest and liquid chromatography tandem mass spectrometry (LC-MS/MS) to confirm the correct site of acetyl lysine incorporation (see Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0005]).\nESI-MS is not an accurate method to determine the real stoichiometry of acetyl-L-lysine incorporation, as proteins with differences in their ionizability might affect the quantification. As this is performed on a whole protein instead of on peptides, the differences are marginal if the only difference in the protein is the presence of a single acetyl group. ESI-MS will give valuable information if there is translational termination product or non-acetylated protein in the sample.",
    "This protocol describes how natively folded and site-specifically lysine-acetylated proteins prepared by genetic code expansion (GCEC; Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001]) can be used as substrates for sirtuin-catalyzed deacetylation assays. Sirtuin deacetylases (short: sirtuins; SIRT: silent information regulator) are NAD+-dependent enzymes, which are important regulators of fundamental cellular processes (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0002]). Of the seven mammalian sirtuins known (SIRT1-7), SIRT 1-3 are well-documented to possess robust lysine deacetylase activity, while the others show more complex enzymatic activities. Here, we describe the expression and purification of SIRT2 (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004] and 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]), as well as a deacetylation assay using the site-specifically lysine-acetylated protein His6-Ran AcK71 (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001]) as a substrate (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]). This assay is designed to directly identify deacetylases for individual acetylation sites in proteins. Following the initial expression of the gene encoding for the sirtuin of interest in E. coli (here: His6-SIRT250-356), a two-step purification strategy consisting of Ni2+-NTA affinity chromatography (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]) and size-exclusion chromatography (SEC) (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]) is used to obtain a protein sample of sufficient purity for the deacetylation assay, which uses immunoblotting with a specific anti-acetyl-lysine antibody as a readout (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2535e608-a50a-42ce-9924-e67ff32eac2e/cpz1277-fig-0004-m.jpg</p>\nFigure 4",
    "Expression, purification, and activity assay of SIRT2. (A) Catalytic mechanism exerted by NAD+-dependent sirtuin deacetylases. Sirtuins need NAD+ as a stoichiometric co-substrate for catalysis. The oxygen of the substrate acetyl-group attacks, as a nucleophile, the ribose C-1′ of NAD+. This results in a fast release of nicotinamide. Nicotinamide is a non-competitive inhibitor of sirtuins. After several steps, involving the formation of an α-1′-alkylamidate intermediate (not shown), 2′-O-acetyl-ADP-ribose and the deacetylated substrate lysine are formed. The 2′-O-acetyl-ADP-ribose exists in a non-enzymatic equilibrium with 3′-O-acetyl-ADP-ribose (Modified from Blasl, Schulze et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0008]). (B and C) Purification of His6-SIRT250-356 using a two-step purification strategy consisting of a Ni2+-NTA affinity chromatography (B) and a size-exclusion chromatography (SEC) (C). In panel B, the elution profile of the Ni2+-NTA chromatography shows that proteins are detected by monitoring the A280 in pool 1 (first peak) at lower imidazole concentrations and in pool 2 (second peak) at higher imidazole concentrations. Pool 2 contained the His6-SIRT250-356. In panel C, size-exclusion chromatography of the subsequent SEC, performed on a HiLoad® 16/600 Superdex®75 pg column. Peak A contained small amounts of impurities, while Peak B contains the pure protein. The elution volume suggests that His6-SIRT250-356 elutes as a monomer from this SEC column. (D) His6-SIRT250-356 catalyzed His6-Ran AcK71 deacetylation, as evidenced using immunoblotting as a readout. The immunoblotting using the anti-acetyl-lysine antibody shows that, only in the sample containing NAD+ but lacking nicotinamide (NAM), no Ran-acetylation was detectable, suggesting that this is a sirtuin-catalyzed deacetylation reaction. As a loading control, staining with an anti-His6 antibody was performed, showing a similar loading with His6-SIRT250-356 and His6-Ran AcK71.\nMaterials\nCompetent E. coli (BL21) DE3 cells (Novagen®; Sigma-Aldrich, cat. no: 69450)\nPlasmid pRSF-Duet1 (Sigma-Aldrich, cat. no. 71341) encoding the sirtuin of interest (here, His6-SIRT250-356)",
    "LB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0029]) containing 50 µg L-1 kanamycin (Carl Roth, cat. no: T832.2)\nLysogeny broth (LB) medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0028])\nKanamycin sulfate (50 mg ml-1 stock in H2O; Carl Roth, CAS no. 25389-94-0)\nIsopropyl β-D-1-thiogalactopyranoside (IPTG), 1 M stock, in water (Carl Roth, CAS no. 367-93-1)\nBuffers 2.1 (resuspension buffer), 2.2, 2.3, 2.4, 2.5 (assay buffer), 2.6 (stripping buffer) (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0007])\n5× SDS-PAGE sample buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0036])\nmy-Budget Pre-stained Protein Ladder (Bio-Budget, cat. no. 86-1000-0500)\n4%-12% (v/v) SDS-PAGE gels\nSDS-PAGE running buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0035])\nSDS-PAGE staining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0037])\nLiquid nitrogen (CAUTION: handle with care; use protective equipment for extremely low temperatures and provide a well-ventilated environment)\nAcetylated POIAck (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001] for His6-Ran AcK71)\n200 mM nicotinamide (Sigma-Aldrich, cat. no. N3376) in sterile filtered (0.22 µm filter) deionized water. Prepare fresh\n5 mM NAD+ stock solution (β-nicotinamide adenine dinucleotide sodium salt; Sigma-Aldrich, cat. no.: N0632)\nPonceau S red (VWR, Lot No.: 0447C180) in 10% acetic acid\nPBS-T buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0031])\n5% skimmed milk powder in PBS-T (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0031])\nImmunoblot transfer buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0025])\nMethanol (Carl Roth, CAS no. 67-56-1)\nAnti-acetyl-L-lysine antibody (abcam 21623, anti-rabbit; dilute 1:1000 in 5% w/v skimmed milk/PBS-T)\nGoat HRP-coupled anti-rabbit IgG (ab6271, dilute 1: 10,000 in 5% w/v skimmed milk/PBS-T)\nECL solution (ROTI®Lumin; Carl Roth GmbH & Co- KG, cat. no. P078.2)\nPhosphate-buffered saline (PBS; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0030])\nAnti-His6-tag antibody (ab18184, 1:1000 in 5% w/v skimmed milk/PBS-T)\nRabbit HRP-coupled anti-mouse IgG (ab6728, 1: 10.000 in 5% w/v skimmed milk/PBS-T)\n5-L baffled Erlenmeyer flasks (VWR, cat. no. 214-1137)\nIncubator (e.g., Function Line B20; Heraeus Holding GmbH)\nShaking incubator (e.g., Infors HT Multitron Standard; Infors AG)\nUV/Vis spectrophotometer (e.g., Varian Cary 50 UV-Vis spectrophotometer or NanoDrop ND 1000, VWR International GmbH)\nHeat block at 30°C and 95°C (Mixing Block MB-102, Bioer Technology Co.)",
    "Centrifuge (SORVALL RC 6, ThermoFisher GmbH)\nRefrigerated microcentrifuge\nSonicator (Sonopulse HD 4100, BANDELIN Electronic GmbH & Co. KG, Berlin, Germany)\n1.5-ml microtubes (SARSTEDT AG & Co. KG, REF 72.690.001)\nSterile bottle-top filters, 0.45-μm pore size\n5-ml His-TrapTM High Performance column (Cytiva, cat. no. 17524801, with Ni Sepharose® High Performance)\nAutomated FPLC system and fraction collector (Cytiva, Bio-Rad)\nElectrophoresis chamber and power supply (e.g., Bio-Rad Laboratories GmbH)\nAmicon® Ultra centrifugal filter unit (10 kDa; Merck, cat. no. UFC901024)\nNanoDrop microspectrophotometer (NanoDrop ND 1000, VWR International GmbH)\nPreparative size-exclusion column: HiLoad® 16/600 Superdex®75 pg column (Cytiva, cat. no. 2898933)\nMedium-pressure chromatography system (low MPA range) with UV detection (280 nm) (e.g., Äkta Purifier, GE Healthcare)\n0.2-ml microtubes\nNitrocellulose/PVDF membrane (Carl Roth GmbH & Co. KG)\nSemi-dry Blotter Trans-Blot® TurboTM Transfer System (e.g., Bio-Rad Laboratories GmbH)\nChemiluminescent detection system (e.g., Octoplus QUPLEX, Intas Science Imaging Instruments GmbH)\nAdditional reagents and equipment for SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]) and immunoblotting (Western blotting; Ni, Xu, & Gallagher, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049])\nExpression of His6-SIRT250-356\n1. Transform competent E. coli BL21 (DE3) cells with pRSF-Duet1/his6-sirt250-356.\n2. Plate cells on LB agar plates containing 50 µg L-1 kanamycin.\n3. Incubate overnight at 37°C (16-18 hr).\n4. Prepare eight 5-L baffled flasks, each containing 1 L of LB medium with 50 µg L-1 kanamycin.\n5. Inoculate each flask with 12.5 ml (i.e., 1:100 dilution) of the overnight preculture.\n6. Grow cells under constant shaking (160 rpm) at 37°C.\n7. Measure the optical density OD600 every 30 min until it reaches 0.6.\n8. Adjust the temperature to 18°-20°C (this takes approximately 30 min).\n9. Induce expression of the POI (here: His6-SIRT250-356) by adding IPTG to a final concentration of 100-400 µM.\nFor His6-SIRT250-356, use 250 µM IPTG",
    "10. Allow POI expression by incubating the cells at 18-20°C at 160 rpm overnight (for 12-16 hr).\n11. Harvest the cells by centrifugation (4500 × g, 20 min, 4°C).\n12. Discard the supernatant.\n13. Resuspend the cells in ∼20 ml of resuspension buffer (buffer 2.1) and freeze the suspension at −80°C or proceed with protein purification (step 14).\nThe volume of resuspension buffer depends on the amount of cell pellet (10-15 ml buffer per pellet of 1 L culture volume). This value is an average value.\nThis is a safe stopping point.\nPurification of His6-SIRT250-356\n14. If frozen, thaw the cell suspension from step 13 on ice.\n15. Lyse cells by sonication (two cycles with 5 min, intensity 55%, pulse 0.5 s/1.5 s).\nLet the solution cool on ice for 5 min in between the cycles.\n16. Centrifuge the lysate at 50,000 × g for 45 min.\n17. Transfer the supernatant containing the POI into a fresh 1.5-ml tube and discard the pellet.\n18. Filter the supernatant using a bottle-top filter with a 0.45-µm pore size to remove any remaining cell debris.\n19. Equilibrate the Ni2+-NTA affinity column (5 ml His-TrapTM High Performance column) with ≥3 CVs of buffer 2.2.\n20. Load the supernatant onto the equilibrated Ni2+-NTA column using an automated FPLC system (4°C, flow rate ≤2 ml min-1).\n21. Wash the column with 10 CVs of buffer 2.3 (flow rate 1-2 ml min-1 dependent on the column used). Follow the absorption at 280 nm (A280) and wash the column until A280 reaches a stable minimum.\n22. Wash the column with buffer 2.2 (>2 CVs) to exchange the high-salt buffer 2.3.",
    "23. Elute the SIRT2 by applying a 10-500 mM imidazole gradient from 100% buffer 2.2 to 100% buffer 2.4 over 10 CVs (flow rate 1 ml min-1). Collect the eluate in fractions of 1 ml using an automated FPLC system and a fraction collector (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]). Monitor A280 and the conductivity to follow protein elution and the formation of the imidazole gradient, respectively.\n24. Select possible His6-SIRT250-356-containing fractions based on A280 and prepare SDS-PAGE samples of each fraction (10 μl sample + 2.5 μl 5× sample buffer). Microcentrifuge briefly at room temperature. Heat the mix for 5 min at 95°C. Microcentrifuge briefly at room temperature.\n25. Load 10 μl of each mix and 5 μl of pre-stained ladder on a 4% v/v-12% v/v SDS-PAGE gel. Run the gel in SDS-PAGE running buffer at 180 V until the dye front reaches the bottom of the gel (approximately 50 min).\n26. Pool the fractions containing the POI and concentrate using an Amicon® Ultra centrifugal filter device with suitable molecular weight cutoff (MWCO).\nFor His6-SIRT250-356, we use a 10-kDa MWCO (MW His6-SIRT250-356: 32 kDa).\n27. Measure the concentration based on the extinction coefficient (EC) of the POI by assessing A280 using a NanoDrop microspectrophotometer and applying the Lambert-Beer law.\nThe POI's specific extinction coefficient can be determined by the ExPASy ProtParam tool (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/])\nAt this stage, the determination of the protein concentration by A280 and the protein's extinction coefficient are only possible if the exact imidazole concentration in the pool of the eluted POI is known, as imidazole also absorbs light at 280 nm and, thus, a blank would be needed. If this is not known, a different method for protein concentration determination should be used, such as the Bradford assay.",
    "28. Equilibrate a suitable size-exclusion chromatography (SEC) column (depending on the molecular weight, oligomeric state, and total amount of POI) with ≥1.5 CVs of equilibration buffer 2.5.\nFor His6-SIRT250-356, use a HiLoad® 16/600 Superdex®75 pg size-exclusion column.\n29. Perform size-exclusion chromatography (SEC) with buffer 2.5 using a medium-pressure chromatography system (low MPA range) with UV detection (280 nm) and running specifications according to the selected column.\n30. Select possible POI-containing fractions by monitoring the A280 and subsequent analysis of the protein-containing fractions by SDS-PAGE (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]).\n31. Pool the POI-containing fractions (separated by oligomeric state if necessary).\n32. Concentrate the POI-containing fractions using an Amicon® Ultra centrifugal filter device with a suitable molecular weight cutoff (MWCO).\nFor His6-SIRT250-356, we use a 10-kDa MWCO (MW His6-SIRT250-356: 32 kDa).\n33. Determine the concentration of the POI by measuring A280 using a NanoDrop microspectrophotometer and applying the Lambert-Beer law using the POI's specific extinction coefficient.\nThe POI's specific extinction coefficient can be determined by the ExPASy ProtParam tool (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/]). His6-SIRT250-356 has an extinction coefficient (ε280) of 33,515 M-1 cm-1. ProtParam calculates protein extinction coefficients using the Edelhoch method with the extinction coefficients for Trp and Tyr determined according to Pace and colleagues (Edelhoch, 1967[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0019]; Gasteiger et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0023]; Pace, Vajdos, Fee, Grimsley, & Gray, 1995[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0052]). This allows one to accurately calculate the protein concentration in the folded state (error approximately 2%). If further chromophores or cofactors are bound to the protein that also absorb at 280 nm, this has to be considered.\n34. Flash-freeze the concentrated POI in liquid nitrogen and store in suitable aliquots at −80°C.\nFreeze in aliquot volumes of 10-50 μl to avoid repeated freeze-thaw cycles.\nThis is a safe stopping point.\nSirtuin deacetylation assay",
    "35. Thaw one aliquot of the acetylated POIAck (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001] for His6-Ran AcK71) and one aliquot of the prepared SIRT (here: His6-SIRT250-356; step 34) on ice.\n36. Microcentrifuge (5 min at 13,500 rpm, 4°C) both tubes to remove precipitated proteins and other precipitants.\n37. Transfer the supernatants to separate, fresh, pre-cooled 1.5-ml tubes and store on ice.\n38. Measure the concentration of the POIAck and SIRT by applying the Lambert-Beer law using each protein's specific extinction coefficient and A280 determined using a NanoDrop microspectrophotometer.\n39. Calculate the volume of protein needed for preparing a 20-μl solution containing 5 µM POIAck (volume needed in assay: VA) and 1 µM SIRT (volume needed in assay: VB).\n40. Prepare four tubes, e.g., 0.2-ml tubes, and label them with 1 through 4.\n41. Use the pipetting scheme described in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl-0001] for conducting the SIRT deacetylase assay.\nTable 1.\n                Pipetting Scheme for SIRT Deacetylase Assaya,b,c-a,b,c[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl1-note-0001_cpz1277-tbl1-note-0003_119]\ntable:\n﻿Final concentration,Sample 1 -SIRT/+NAD+,Sample 2 +SIRT/+NAD+,Sample 3 +SIRT/-NAD+,Sample 4 +SIRT/+NAD+/+NAM\n5 µM POIAck,VA,VA,VA,VA\n1 µM sirtuin,-,VB,VB,VB\n0.5 mM NAD+ (5 mM stock),2 µl,2 µl,-,2 µl\n10 mM nicotinamide (200 mM stock),-,-,-,1 µl\nAssay buffer (buffer 2.5) to 20 µl,X µl,X µl,X µl,X µl\na Add the SIRT as last component and immediately start the incubation.\nb Sample 1 corresponds to the non-enzyme control, sample 2 contains the SIRT co-substrate NAD+, sample 3 lacks the co-substrate NAD+ and nicotinamide (NAM), and sample 4 contains NAD+ and NAM in addition to SIRT and POIAcK.\nc Applying this pipetting scheme allows one to confirm an NAD+-dependent SIRT-catalyzed deacetylation of POIAcK. VA, VB: volume of acetylated substrate protein (POIAcK) or sirtuin deacetylase, respectively.\n42. Incubate samples in a heat block, incubator, or PCR cycler at 30°C for 2 hr 30 min.",
    "To avoid evaporation of the liquid, use an incubator or a PCR cycler with a preheated lid.\nThis is only a qualitative assay to assess if a deacetylation occurs or not and to show a SIRT-catalyzed reaction that can be inhibited by nicotinamide and that depends on the presence of the SIRT co-substrate NAD+. With a single time point and one enzyme concentration, it is important to note that this might not be within the linear range of the assay, and it might be necessary to vary both the SIRT concentration and the time for determination of accurate rates.\n43. Add 10 μl of H2O and 12 μl of 5× SDS-PAGE sample buffer to each reaction. Microcentrifuge briefly at room temperature. Heat the samples for 5 min at 95°C. Microcentrifuge briefly at room temperature.\n44. Store samples at −20°C until further use, or proceed to SDS-PAGE and immunoblotting (detection of deacetylation by immunoblotting, step 45).\nDetection of deacetylation by immunoblotting\n45. If frozen, thaw samples from step 44. Load 10 μl of each sample for analysis by SDS-PAGE (step 48) and 5 μl of pre-stained ladder on a 4% v/v-12% v/v SDS-PAGE gel. Run the SDS-PAGE gel in SDS-PAGE running buffer at 180 V until the dye front reaches the bottom of the gel (∼50 min); also see step 24.\n46. Blot on a PVDF or nitrocellulose membrane by semi-dry transfer in immunoblot transfer buffer at 150 mA for 30 min (for additional details, see Niet al., 2016).\nPVDF membranes need to be activated in pure methanol for 1 min.",
    "47. To analyze the efficiency of the transfer of the proteins from the SDS-PAGE gel to the membrane, stain the membrane for 5 min with Ponceau S followed by washing with distilled, deionized H2O (for details, see Ni et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049]).\nNotably, Ponceau S staining is reversible, so that staining can be repeated if destaining was too extensive.\n48. Wash the membrane in PBS-T at least three times, each time for 5 min at room temperature, until Ponceau S red−stained protein bands are no longer visible.\n49. Block the membrane with 5% (w/v) skimmed milk in PBS-T for 1 hr at room temperature.\n50. Incubate the membrane with primary anti-acetyl-L-lysine antibody overnight at 4°C with mild agitation.\nUse abcam 21623, anti-rabbit; dilute 1:1000 in 5% w/v skimmed milk in PBS-T.\n51. Wash the membrane at least three times with PBS-T buffer, each time for 5 min.\n52. Incubate with secondary goat HRP-coupled anti-rabbit IgG for 1 hr at room temperature with mild agitation.\nUse ab6271; dilute 1:10,000 in 5% w/v skimmed milk in PBST.\n53. Wash the membrane at least three times with PBS-T buffer, each time for 5 min.\n54. Detect lysine-acetylated proteins using an enhanced chemiluminescence substrate for HRP (ECL solution) (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0004]) using a suitable documentation system.\n55. Incubate two times for 10 min with fresh stripping buffer (buffer 2.6).\nThe following steps are designed as an additional loading control by detecting the His6-tag of the SIRT and the POIAck\n56. Wash two times for 5 min with PBS-T buffer followed by two times for 5 min with PBS buffer.",
    "57. Continue with step 49 of this protocol but use anti-His6 antibody (ab18184, diluted 1:1000 in 5% w/v skimmed milk/PBS-T) as the primary antibody and HRP-coupled anti mouse IgG (ab6728, 1: 10,000 in 5% w/v skimmed milk/PBST) as the secondary antibody.\nA loading control is important for quantification of the immunoblot to ensure accurate and stable amounts of enzyme and substrate loaded onto the SDS-PAGE gel.\nAlternatively, Ponceau S red staining, amido black staining, or an antibody specific for the POIAcK and the SIRT can be used as loading control. 2,2,2-Trichloroethanol (TCE) can also be used to stain all proteins by addition to the separation gel before polymerization. The TCE crosslinks with tryptophan residues in the proteins, affecting their fluorescence intensity. An advantage of TCE staining is that it stains all proteins loaded on the SDS-PAGE gel, and this staining can be used to monitor the transfer of the proteins to the membrane and the remaining proteins in the SDS-PAGE gel. A disadvantage of TCE staining is the masking of epitopes in the proteins, interfering with antibody detection dependent on the degree of crosslinking (Ladner, Yang, Turner, & Edwards, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0038]).",
    "In this protocol, we describe the use of acetylated proteins to assess deacetylation catalyzed by classical KDACs. The enzymatic activity of purified KDAC can be determined in vitro with acetylated proteins produced via the GCEC method (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001]), using immunoblotting (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002]) and mass spectrometry (Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0005]) as readouts. As classical deacetylases produce acetate as a result of deacetylation, enzyme-coupled assays can be used to determine the amount of released acetate (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0005]). Alternatively, fluorescently labeled peptides can be used to determine the activity of classical KDACs (and of sirtuins). This Fluor-de-Lys® assay uses histone- or p53-derived peptides that carry an acetyl-L-lysine and a coumarin fluorophore at the C-terminus. Upon deacetylation of the lysine in these peptides, the peptide becomes cleavable by a trypsin protease, which then liberates and unquenches the fluorogenic coumarin group, which allows detection by measuring fluorescence intensity. As such, this end-point assay allows one to quantify deacetylase activity and to screen for potential KDAC inhibitors (Wegener, Wirsching, Riester, & Schwienhorst, 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0068]). In this protocol, we use the Bacillus subtilis classical deacetylase AcuC (acu: acetoin utilization) as an example to describe this deacetylation assay. We describe the steps for expression of the test deacetylase in E. coli BL21 (DE3) and its purification, and the procedures for activity determination of classical KDACs (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0005]). For determination of AcuC activity, we describe two assays. We report how the Fluor-de-Lys assay can be used to determine the activity of classical KDACs (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0005]). In addition, we describe the assessment of deacetylation of the AcuC substrate AcsA (acetyl-CoA synthetase) using immunoblotting with a specific anti-acetyl-lysine antibody (anti-AcK antibody) as a readout, as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002] (Fig. 5D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e0319655-71c9-46b3-b7c8-a23658ec7efa/cpz1277-fig-0005-m.jpg</p>\nFigure 5",
    "Purification and activity assay of the classical Zn2+-dependent deacetylase AcuC from Bacillus subtilis. (A) Catalytic mechanisms exerted by classical Zn2+-dependent deacetylases. The acetyl-group is contacted by a catalytic Zn2+-ion, which is coordinated by two Asp, a His, and a Tyr residue. The Zn2+ ion polarizes the carbonyl group of the acetyl group, resulting in an increase in its electrophilicity, which, in turn, can be attacked by an activated nucleophilic water molecule. A tetrahedral intermediate is formed that is resolved, resulting in formation of the deacetylated lysine side chain and acetate (modified from Blasl, Schulze et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0008]). (B) His6-AcuC purification via Zn2+-NTA affinity chromatography (left panel) and subsequent size-exclusion chromatography (SEC) (right panel). Left panel: 5 L of acuC-expressing E. coli BL21 (DE3) cells were harvested and lysed in the KDAC lysis buffer (T: total cell lysate). The cell lysate was centrifuged to remove the insoluble cell debris (P: pellet). The soluble fraction of the cell lysate (S: soluble) was loaded onto a 25-ml Zn2+-charged NTA column. The flowthrough (F) was collected and analyzed by SDS-PAGE to control for binding of His6-AcuC to the column. The resin was washed with 200 ml of KDAC washing buffer. The washing step was analyzed by SDS-PAGE (W: washing step). The elution buffer gradient ranged from 0 to 500 mM imidazole. Samples of the elution fractions were analyzed by SDS-PAGE (lanes 7-14). The collected fractions are highlighted in a gray box in the A280 profile. Right panel: purification of AcuC via size-exclusion chromatography (SEC). Following Zn2+-NTA chromatography, the AcuC-containing fractions were collected and the protein was concentrated before it was applied to a HiLoad 26/600 Superdex 200 pg GE column. Fractions of SEC elution were analyzed by SDS-PAGE (gray box). M: marker. (C) Fluor-de-Lys assay of purified AcuC.",
    "100 μl of the full reaction mixture (AcuC) containing 5 µM AcuC and 20 µM Boc-AcK-AMC substrate were prepared in a black 96-well microtiter plate with flat bottom and incubated for 30 min at 37°C. As a control, a sample without AcuC was analyzed (−). 50 µM SAHA was added to the reaction mix to show that AcuC can be inhibited, supporting the enzymatically catalyzed reaction (AcuC+SAHA). The reaction was stopped by addition of 100 mg/L trypsin, 50 µM SAHA, 50 µM TSA (final concentrations), and incubation for 30 min at room temperature. After that, the fluorescence was recorded (emission: 460 nm; excitation: 390 nm) using a Tecan Infinite 200 PRO plate reader. Shown are the mean values of three biological replicates. The bars represent standard deviations. (D) Deacetylation assay of acetylated AcsA with AcuC. AcsA was acetylated with 10 µM AcuA and 20 µM acetyl-CoA for 1 hr at 37°C. Subsequently, size-exclusion chromatography was carried out to purify the acetylated AcsA and to remove the remaining acetyl-CoA. 10 µM acetylated AcsA was incubated with 5 µM AcuC at 37°C. After 0 (0′), 10 (10′), and 30 min (30′), samples were analyzed by immunoblotting using a rabbit polyclonal anti-acetyl-L-lysine antibody, and subsequently with goat polyclonal secondary antibody to rabbit IgG. AcuC was absent in (−). As loading control, Ponceau S red staining (PoS) was conducted. M: marker.",
    "Materials\nCompetent E. coli BL21 (DE3) cells (Novagen®; Sigma-Aldrich, cat. no. 69450)\npET-45b(+) vector (Novagen, Darmstadt, Germany) with (a) the acuC (N-terminal His6-Tag, UniProtKB entry: P39067), (b) acsA (N-terminal His6-Tag, UniProtKB entry: P39062), and (c) acuA sequence (N-terminal His6-tag, UniProtKB entry: P39065)\nWe used codon-optimized, synthetic genes prepared by BioCat (https://www1.biocat.com/[href=https://www1.biocat.com/]).\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0029]) containing 100 µg ml-1 ampicillin\nAmpicillin sodium salt (100 mg ml-1 stock in H2O; Sigma-Aldrich, CAS no. 69-52-3)\nLysogeny broth (LB) medium (sterilize by autoclaving; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0028])\nTerrific broth (TB; sterilize by autoclaving; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0039])\n200 mM ZnCl2 (Carl Roth, CAS no. 7646-85-7) in water\nIsopropyl β-D-1-thiogalactopyranoside (IPTG) (1 M stock in H2O; Carl Roth, CAS no. 367-93-1)\nBuffer 3.1 (KDAC lysis buffer), 3.2 (KDAC washing buffer), 3.3 (KDAC standard buffer), and 3.4 (KDAC elution buffer) (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0016])\n5× SDS-PAGE sample buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0032])\nLadder: my-Budget Pre-stained Protein Ladder (Bio-Budget, cat. no. 86-1000-0500)\n12% v/v SDS-PAGE gel and SDS-PAGE running buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0033])\nSDS-PAGE staining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0037])\nSDS-PAGE destaining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0034])\nPonceau S red (VWR, Lot No.: 0447C180) in 10% acetic acid\nBradford assay (Carl Roth, cat. no.: K015.1)\nLiquid nitrogen (CAUTION: handle with care; use protective equipment for extremely low temperatures and provide a well-ventilated environment)\nFluorogenic KDAC substrate (Boc-Lys(Ac)-AMC; BACHEM, cat. no. I-1875)\nDMSO (Cayman Chemical, CAS no. 149647-78-9)\nTrypsin (Sigma Aldrich, CAS no. 9002-07-7)\n10 mM stock solution of SAHA (suberoylanilide hydroxamic acid) in DMSO (Cayman Chemical, CAS no. 149647-78-9)\n10 mM stock of Trichostatin A (TSA) in DMSO (Hycultec, cat. no. HY-15144)\n25% (v/v) HCl\n2× Fluor-de-Lys developer solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0024])\n50 mM Tris⋅HCl, pH 8.0\n50 mM KCl\nAcetylated POIAck (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0004] for His6-AcsA)\nPBS-T (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0031])\nImmunoblotting transfer buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0025])\n5% (w/v) skimmed milk powder in PBS-T (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0031])",
    "Antibodies (5% w/v skimmed milk/PBS-T):\n               \nPrimary antibody: 1:1000; anti-acetyl-L-lysine antibody (abcam, cat. no. ab21623)\nSecondary antibody: 1:10,000; goat Anti-Rabbit IgG H&L (HPR) (abcam, cat. no. ab6721)\nECL solution A and B (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0020])\n100-ml and 5-L baffled Erlenmeyer flasks (VWR cat. no. 214-1131 and 214-1137)\nIncubator (e.g., Function Line B20, Heraeus Holding GmbH)\nShaking incubator (e.g., Infors HT Multitron Standard, Infors AG)\nHeat block (e.g., Mixing Block MB-102, Bioer Technology Co. and Digital Heatblock, VWR International GmbH)\nUV/Vis spectrophotometer (e.g., Varian Cary 50 UV-Vis spectrophotometer or NanoDrop ND 1000, VWR International GmbH)\nRefrigerated microcentrifuge\nCentrifuge (e.g., SORVALL RC 6 with Rotor SLA-1500 and Rotor SS-34, Thermo Fisher GmbH)\nSonicator [e.g., Sonopulse HD 4100 with UW 100, TS133V, SH 100G, and tip TT213 (ᴓ12.7 mm); BANDELIN Electronic GmbH & Co. KG, Berlin, Germany]\n5-ml HisTrapTM High Performance column (Cytiva, cat. no. 17524801, packed with Ni Sepharose® High Performance)\nAmicon® Ultracentrifugal filter unit (10 kDa MW cut off; Merck, cat. no. UFC901024)\nElectrophoresis chamber and power Supply (e.g., Bio-Rad Laboratories GmbH)\nPreparative size-exclusion chromatography column: HiLoad® 16/600 Superdex®75 pg column and HiLoad® 16/600 Superdex®200 pg (Cytiva, cat. no. 2898933 and 28989335) or Superose 6 Increase 10/300 GL (Cytiva, cat. no. 29091596)\nMedium pressure chromatography system (low MPA range) with UV detection (280 nm) (e.g., Äkta Purifier, GE Healthcare) and a fraction collector\nBlack Corning 96-well plates with flat bottom\nSealing tape for 96-well plates (Greiner Bio-One International GmbH, cat. no. 676001)\nPlate reader Infinite 200 PRO (Tecan), or similar\n1.5-ml microtubes (SARSTEDT AG & Co. KG, REF 72.690.001)\n0.45-µm syringe filter\nPolyvinylidene fluoride (PVDF) membrane and filter paper (Bio-Rad, cat. no 1620263)\nSemi-dry Blotter Trans-Blot® TurboTM Transfer System (e.g., Bio-Rad Laboratories GmbH)\nShaker/Nutator\nChemiluminescent detection system (e.g., Octoplus QUPLEX, Intas Science Imaging Instruments GmbH)",
    "Additional reagents and equipment for SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]) and immunoblotting (Western blotting; Ni, Xu, & Gallagher, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049])\nExpression of acuC\n1. Transform E. coli BL21 (DE3) cells with the expression plasmid [here: pET-45b(+)] encoding for B. subtilis AcuC. Plate the cells on a LB agar plates containing 100 µg ml-1 ampicillin.\n2. Pick 4-5 single colonies to inoculate a 50-ml preculture in LB medium containing 100 µg ml-1 ampicillin. Grow overnight at 150-160 rpm, 37°C.\nFor inoculation of a culture used for production of a protein, it is recommended to use 4-5 single colonies. This ensures, on the one hand, that no contamination is transferred to the preculture and, on the other hand—by using 4-5 colonies instead of one single colony as typically used for molecular biological work—the probability of picking a colony containing cells that are unfit for expression of the gene of interest is reduced.\n3. The next day, transfer 20 ml of the preculture to 2 L of TB (i.e., do a 1:100 dilution) in a 5-L Erlenmeyer flask and grow the culture to an optical density at 600 nm (OD600) of 0.3 (37°C, 140 rpm).\nThe growth of the culture to OD600 of 0.3 takes approximately 1-2 hr. It is recommended to check the OD600 every 20-30 min.\n4. Lower the temperature to 18°C and add ZnCl2 to the medium to a final concentration of 200 µM.\n5. Grow the cells for an additional 30 min and induce the expression of acuC overnight by adding 400 μl of a 1 M IPTG stock solution (final concentration: 200 µM of IPTG) to the flask containing the 2 L of culture.\n6. The next day, harvest the cells by centrifugation (4000 × g, 10 min, 4°C).",
    "Carry out all of the following steps on ice or at 4°C.\n7. Resuspend the cell pellet in 40 ml of KDAC lysis buffer (buffer 3.1).\n8. Lyse the cells by sonication on ice (cycle 5 min, intensity 55%, pulse 0.5/1.5 s).\nUpon efficient cell lysis, the solution should become slightly more transparent. If the cell lysis is not complete, lyse cells for another 5 min using the same settings.\n9. Centrifuge the lysate (45 min, 40,000 × g, 4°C) and use the supernatant for protein purification. Discard pellet.\nProtein purification of AcuC from B. subtilis (AcuC)\nHave a Zn2+-charged Zn2+-NTA column prepared, as described in Strategic Planning.\n10. Load the supernatant containing all soluble components in KDAC lysis buffer (buffer 3.1) onto an equilibrated zinc-charged NTA column (Zn2+-NTA; HisTrapTM High Performance column).\nWe use a 5-ml HisTrap FF column (GE Healthcare, now: Cytiva).\n11. Wash the column with 10 CVs of KDAC washing buffer (buffer 3.2).\n12. Elute the protein by applying a 0-500 mM imidazole gradient from 100% KDAC standard buffer (buffer 3.3) to 100% KDAC elution buffer 3.4 over 5 CVs.\n13. Analyze the elution fractions by SDS-PAGE (see Current Protocols article: Gallagher, 2016). Collect the fractions containing the POI and concentrate the solution using an Amicon® Ultra centrifugal filter device. Microcentrifuge (4000 × g, 5 min, 4˚C) the concentrated protein solution to remove precipitants. Determine the protein concentration by Bradford assay.\nProtein concentration determination by measuring A280 is difficult at this stage, as the eluate contains imidazole at a concentration that is only approximately known, which does not allow to prepare an accurate blank value.\n14. Equilibrate the size-exclusion chromatography (SEC) column (HiLoad® 26/600 Superdex®200 pg) with the KDAC standard buffer (buffer 3.3). Load the protein and elute it using the same buffer (buffer 3.3).",
    "15. Analyze the elution fractions by SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]). Collect the POI-containing fractions and concentrate the target protein using an Amicon ultrafiltration device.\nFor B. subtilis AcuC, use a 10-kDa MWCO Amicon ultrafiltration device (MW AcuC: 43 kDa).\nAcuC slowly aggregates in the KDAC elution buffer. Therefore, continue with the protocol immediately after eluting the protein from the Zn2+-charged NTA column (see Strategic Planning). Avoid leaving the protein in elution buffer overnight. If aggregation of the KDAC is observed, a purification step on a Superose®6 Increase prior to HiLoad® Superdex®200 pg preparative SEC is recommended.\n16. Flash-freeze the concentrated protein aliquots in liquid nitrogen and store them at –80°C.\nThis is a safe stopping point.\nFluor-de-Lys assay\n17. Prepare a 10 mM stock solution of the fluorogenic KDAC substrate in DMSO. Boc-Lys(Ac)-AMC is highly soluble in DMSO. Protect the fluorogenic substrate solution from prolonged exposure to light, and store at −20°C.\n18. Prepare 2× Fluor-de-Lys developer solution as described in Reagents and Solutions.\nThe developer solution can be stored at –20˚C. To prevent the trypsin from autoproteolysis in long-term storage, acidify the solution with 0.1% v/v of 25% v/v HCl solution and do not prepare the solution with any buffering agent.\n19. Prepare two Fluor-de-Lys reaction mixes, one with and one without KDAC inhibitor (SAHA or TSA). Prepare a mixture containing: \n         \n50 mM Tris·HCl (pH 8.0)\n50 mM KCl\n5 µM KDAC (AcuC from step 16)\n20 µM fluorogenic KDAC substrate\n1% v/v DMSO.\nTo one of the mixes, add 50 µM KDAC inhibitor (SAHA or TSA). To the other, add the corresponding volume of DMSO.",
    "For the reactions with KDAC inhibitor, incubate the mixture with KDAC and inhibitor on ice for 15 min before adding the KDAC substrate to the mixture, and mix in the last step.\n20. Add 100 μl of the Fluor-de-Lys reaction mixtures, containing 5 µM KDAC and the KDAC substrate (here: (Boc-Lys(Ac)-AMC), to wells of a black Corning® 96-well plate with flat bottom.\nThe number of wells needed depends on the number of enzymes analyzed, the number of enzyme concentrations analyzed, the number of substrate concentrations analyzed, and the number of replicates analyzed, etc.\n21. Cover the plate with sealing tape and incubate at room temperature or 37˚C in the dark for 30 min.\n22. Quench the reaction and initiate the cleavage of the deacetylated substrate by trypsin protease by adding 100 μl of the Fluor-de-Lys developer solution from step 18. Incubate at room temperature in the dark for 30 min.\n23. Using a 96-well microtiter plate reader, determine the fluorescence at 460 nm by exciting the fluorophore at the wavelength of 390 nm.\nDeacetylation assay with acetylated protein\n24. Prepare 200 μl of a reaction mixture in 1.5-ml tubes containing: \n         \n10 nM-5 µM KDAC (AcuC from step 16)\n10 µM of acetylated protein (Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0004])\n1% v/v DMSO\n50 mM KCl\n50 mM Tris·HCl (pH 8).\nAfter adding the acetylated protein, incubate the mixture at room temperature or 37°C.",
    "The KDAC concentration and substrate concentration to use are enzyme dependent. For a qualitative assay to compare different enzymes or different mutant versions of one enzyme, it is important to ensure which assay settings (enzyme/substrate concentration, incubation time, incubation temperature, buffer conditions, etc.) are selected which ensure that the reaction is still within the dynamic range, i.e., the substrate is not consumed. If that were to happen, it would not be possible to relatively compare the enzymes/mutants. For quantitative analyses, such as for Michaelis-Menten kinetics, the enzyme concentration should be less than 10-fold below the substrate concentration of the reaction, and the substrate must not be fully consumed during the reaction. Ideally, less than 10%-20% turnover of substrate should occur under the experimental settings used.\n25. At defined time points (0, 5, 10, 20, 30, 45, 60, 90, and 120 min), take 20 μl of the sample and stop the reaction by adding 5 μl of 5× SDS-PAGE sample buffer supplemented with 2.5-50 µM SAHA.",
    "The time points analyzed depend on the enzyme analyzed, the substrate concentration used, and the conditions under which the assay is performed (buffer composition, presence of inhibitors, reaction temperature, etc.). These must be analyzed for the individual case. Here, a kinetic assay is performed to be able to compare different enzymes, mutants, conditions, etc. with each other. However, this does not allow one to determine KM or kcat values in terms of a Michaelis-Menten kinetics. If this is the aim of the experiment, perform the reaction at a constant enzyme concentration (enzyme concentration<<KM) with increasing concentrations of substrate and fit the data using a hyperbolic Michaelis-Menten equation. As stated above, it is important here to work under reaction conditions that ensure that less than 10%-20% turnover of substrate occurs under all substrate concentrations analyzed to avoid too much product being formed, which could interfere with enzyme activity (negative feedback control), or too much substrate being consumed, not allowing the enzyme to work at its maximal activity.\n26. Denature the samples at 95°C for 5 min and analyze by immunoblotting as described below (see Current Protocols article: Ni et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049]).\nImmunoblotting\n27. Run the denatured samples on an SDS-PAGE (Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]).\n28. Transfer the proteins from the SDS-PAGE gel to a PVDF membrane in a blotting device using immunoblot transfer buffer (Ni et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049]). After transfer, rinse the membrane with PBS-T.\n29. Incubate the membrane in Ponceau S red solution (0.25% Ponceau S, 10% acetic acid) for 5 min on a shaker, carefully rinse with distilled water five times, and document the result as loading control.\n30. Incubate the membrane with blocking solution (PBS-T supplemented with 5% w/v skimmed milk powder) for half an hour on a shaker.",
    "31. Incubate the membrane with an appropriate dilution of an anti-acetyl-lysine antibody (here: abcam, cat. no. ab21623, 1:1000 in blocking buffer) overnight at 4°C on a nutator.\n32. Wash the membrane three times with PBS-T, each with shaking on a nutator for 5 min. Incubate the membrane with a secondary antibody solution (use an appropriate dilution of a horseradish peroxidase coupled secondary antibody in the blocking buffer; here: 1:10,000 of abcam, cat. no. ab6721) for 1 hr at room temperature on a nutator.\n33. Wash the membrane three times with PBS-T, each time for 5 min.\n34. Mix 1 ml of ECL solution A (ECL A) and 1 ml of ECL solution B (ECL B), and rinse the membrane with the development solution mix. Document the result using a blot imaging system.\nIf the enzyme assay should be quantitative in the sense of a Michaelis-Menten kinetics, use the acetylated substrate protein at increasing concentrations as described above.",
    "In addition to the site-specific incorporation of acetyl-L-lysine into proteins by the genetic code expansion concept (GCEC; Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001]), proteins can also be enzymatically acetylated at lysines. This protocol describes the steps to do this, using the enzymatic acetylation of K549 of acetyl-coenzyme A synthetase (AcsA) by a lysine acetyltransferase (AcuA) from Bacillus subtilis as an example (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0006]). Enzymatic lysine acetylation first requires the recombinant expression and purification of the substrate enzyme (in this case, AcsA) and the lysine acetyltransferase (in this example, AcuA; Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0006]). Expression is performed in Escherichia coli BL21 (DE3) cells, and purification takes place in two steps: firstly via an Ni-NTA affinity chromatography (IMAC: immobilized metal ion affinity chromatography) by the N-terminal His6-tag and, secondly, via a size-exclusion chromatography (SEC). The respective purification steps are monitored by recording the absorption at 280 nm (A280) and additionally analyzed by SDS-PAGE. After purification, the proteins are concentrated using an Amicon® Ultra ultrafiltration device with a suitable molecular weight cutoff (MWCO) and flash-frozen in small aliquots (∼20 μl) in liquid nitrogen, which are stored at –80°C until use. Subsequently, the substrate protein (AcsA) can be lysine-acetylated by the test lysine acetyltransferase (AcuA) in the presence of acetyl-coenzyme A (acetyl-CoA). The acetylation is then detected by immunoblotting (Fig. 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e47fbf6f-a388-4c19-bbd2-e7d2df0c5203/cpz1277-fig-0006-m.jpg</p>\nFigure 6",
    "Enzymatic lysine acetylation assay exemplified by the lysine acetyltransferase (KAT) AcuC from B. subtilis and the substrate AcsA. (A) Catalytic mechanisms exerted by p300/CBP (upper panel), and GNAT and MYST KATs (lower panel). The p300/CBP KATs uses a Theorell-Chance hit-and-run mechanism including a catalytic tryptophan (Trp) to acetylate substrate proteins. In contrast, the GNAT and MYST KATs apply general base catalysis using a catalytic glutamate to deprotonate the lysine side chain, increasing its nucleophilicity to attack the electrophilic carbonyl group of the acetyl-CoA, resulting in acetylation of the lysine side chain. (B) SEC purification step of the lysine acetyltransferase AcuA using a HiLoad® 16/600 Superdex®75 pg column. The eluted fractions (numbered) were analyzed by SDS-PAGE. The fractions highlighted in gray were combined and concentrated to 10 mg ml-1. (C) In vitro lysine acetylation of B. subtilis acetyl-CoA-synthetase (AcsA) by the KAT AcuA. Lysine acetylation of AcsA was detectable dependent on the presence of AcuA and acetyl-CoA after an incubation time of 0.5 and 2 hr at 37°C (lane 8 and 9). To show that the acetylation of AcsA is dependent on the enzyme AcuA, control samples were prepared with/without acetyl-CoA and incubated for 0.5 hr at 37°C (lane 4-7). As protein ladder (lane 3), pre-stained my-Budget (Bio-Budget) was used. The used negative control was non-acetylated Ran, and the positive control was His6-Ran AcK71 (lanes 1 and 2, respectively).\nMaterials\nCompetent E. coli BL21 (DE3) cells (Novagen®; Sigma-Aldrich, cat. no: 69450)\npET-45b(+) vector with the acsA sequence (N-terminal His6-Tag, UniProtKB entry: P39062) and pET-45b(+) vector with acuA sequence (N-terminal His6-Tag, UniProtKB entry: P39065) ordered as codon-optimized, synthetic DNA construct, from BioCat (https://www1.biocat.com/[href=https://www1.biocat.com/])\nLB agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0029]) containing 100 µg ml-1 ampicillin\nAmpicillin sodium salt (100 mg ml-1 stock in H2O; Sigma-Aldrich, CAS no. 69-52-3)",
    "LB medium (sterilize by autoclaving; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0028])\nTerrific broth medium (TB; sterilize by autoclaving; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0039])\nIsopropyl β-D-1-thiogalactopyranoside (IPTG; 1 M stock in H2O; Carl Roth, CAS no. 367-93-1)\nResuspension buffer: Buffer 4.1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0032]) plus Pefabloc®SC Protease Inhibitor (Carl Roth, CAS no. 30827-99-7)\nBuffer 4.1 (assay buffer), buffer 4.2 (Ni-II buffer), and buffer 4.3 (Ni-III buffer) (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0017])\n5× SDS-PAGE sample buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0032])\nLadder: my-Budget Prestained Protein Ladder (Bio-Budget, cat. no. 86-1000-0500)\n12% v/v SDS-PAGE gel and SDS-PAGE running buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0035])\nSDS-PAGE staining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0037])\nSDS-PAGE destaining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0034])\nBradford assay (Carl Roth, cat. no.: K015.1)\nLiquid nitrogen (CAUTION: handle with care; use protective equipment for extremely low temperatures and provide a well-ventilated environment)\nAcetyl-coenzyme A sodium salt (e.g., Sigma Aldrich, CAS no. 102029-73-2)\nPonceau S red Solution (abcam, cat. no. ab270042)\nBlocking buffer: 5% w/v skimmed milk powder in PBS-T (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0006])\nAntibodies (1: 10,000 in 5% w/v skimmed milk/PBS-T):\n               \nPrimary antibody: anti-acetyl-L-lysine antibody (abcam, cat. no. ab21623)\nSecondary antibody: goat Anti-Rabbit IgG H&L (HPR) (abcam, cat. no. ab6721)\nPBS-T solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0031])\nImmunoblot transfer buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0025])\nPhosphate-buffered saline (PBS; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0030])\nECL solutions A and B (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0021])\n100-ml and 5-L baffled Erlenmeyer flasks (VWR, cat. no. 214-1131 and 214-1137)\nIncubator (e.g., Function Line B20, Heraeus Holding GmbH)\nShaking incubator (e.g., Infors HT Multitron Standard, Infors AG)\nHeat block (e.g., Mixing Block MB-102, Bioer Technology Co. and Digital Heatblock, VWR International GmbH)\nUV/Vis spectrophotometer (e.g., Varian Cary 50 UV-Vis spectrophotometer or NanoDrop ND 1000, VWR International GmbH)\nRefrigerated microcentrifuge\nCentrifuge (e.g., SORVALL RC 6 with Rotor SLA-1500 and Rotor SS-34, Thermo Fisher GmbH)\n100-ml glass beaker\nSonicator (e.g., Sonopulse HD 4100 with UW 100, TS133V, SH 100G, and tip TT213 (ᴓ12.7 mm) (BANDELIN Electronic GmbH & Co. KG, Berlin, Germany)",
    "5-ml HisTrapTM High Performance column (Cytiva, cat. no. 17524801, packed with Ni Sepharose® High Performance) for AcuA\n5-ml HiTrapTM TALON® crude column (Cytiva, cat. no. 28-9537-67)\nAmicon® Ultra Centrifugal filter unit (10 kDa MW cut off; Merck, cat. no. UFC901024)\nPreparative size-exclusion chromatography column: HiLoad® 16/600 Superdex®75 pg column and HiLoad® 16/600 Superdex®200 pg (Cytiva, cat. no. 2898933 and 28989335)\nMedium pressure chromatography system (low MPA range) with UV detection (280 nm) (e.g., Äkta Purifier, GE Healthcare) and a fraction collector\n1.5-ml microtubes (BRAND, cat. no. 780500)\nElectrophoresis chamber and power supply (e.g., Bio-Rad Laboratories GmbH)\n0.45 µm Polyvinylidene fluoride (PVDF) membrane and filter paper (Bio-Rad, cat. no 1620263)\nSemi-dry Blotter Trans-Blot® TurboTM Transfer System (e.g., Bio-Rad Laboratories GmbH)\nChemiluminescent detection system (e.g., Octoplus QUPLEX, Intas Science Imaging Instruments GmbH)\nAdditional reagents and equipment for SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]) and immunoblotting (Western blotting; Ni, Xu, & Gallagher, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049])\nExpression of AcsA and AcuA\n1. Transform two sets of E. coli BL21 (DE3) cells with the pET-45b(+) expression vectors containing the genes acsA and acuA, encoding for the enzymes AcsA or AcuA, respectively.\n2. Plate cells after transformation on separate selective LB agar plates containing 100 µg ml-1 ampicillin and incubate the plates overnight at 37°C.\n3. For each transformation, add 25 ml of LB medium containing 100 µg ml-1 ampicillin to a 100-ml baffled Erlenmeyer flask. Take 4-5 single colonies from each of the plates on step 2 and inoculate the corresponding pre-cultures. Incubate the pre-cultures overnight (37°C, 160 rpm).\nTypically, 10 ml of each pre-culture are needed for setting up a 1 L culture the next day. Here, 25 ml are prepared for setting up two 2 L cultures. Prepare 5 to 10 ml more than you need.",
    "4. Prepare two 5-L baffled Erlenmeyer flasks with 2 L TB medium supplemented with 100 µg ml-1 ampicillin. One will be for inducing expression of acsA and the other, for acuA. Inoculate the corresponding flasks with 20 ml of the appropriate pre-culture, E. coli BL21 (DE3)/pET45b(+)/acsA or E. coli BL21 (DE3)/pET45b(+)/acuA.\nThis corresponds to an optical density at 600 nm (OD600) of ∼0.05 at the beginning of the cultivation.\nThe culture volume and the cultivation flask volume used should be selected to ensure proper aeration of the culture during growth. It is recommended to use baffled flasks and to use a culture volume of <20% of the flask total volume.\n5. Incubate the cultures (37°C, 130 rpm) until the OD600 reaches 0.4. Induce protein expression by adding 400 μl of a 1 M IPTG stock (final IPTG concentration 200 µM). Lower the temperature to 18°C and continue the incubation with shaking for an additional 18 hr.\nTypically, the culture from step 4 grows to an OD600 of 0.4 within 3 hr. Importantly, this protocol describes the expression of acuA and acsA. For other genes, the optimal induction conditions (OD600, IPTG concentration, and expression conditions, such as time, temperature, expression host, etc.) can be different and need to be analyzed in test expression assays prior to performing a preparative culture, as described in Strategic Planning.\n6. Harvest the cells by centrifugation (10,000 × g, 4°C, 20 min). Discard the supernatant and either immediately use the pellet and continue with cell lysis, or store the pellet at –20°C or –80°C until use.\nTypically, 10 g of wet cells are obtained from 1 L culture. This does not need to be weighed; it can be used as a guideline to judge the growth of the culture.\nThis is a safe stopping point.",
    "Purification of AcsA and AcuA\nThe purification process of AcsA is almost identical to that of AcuA. Perform each step at 4°C.\n7. Resuspend the cell pellet on ice in 40 ml of resuspension buffer (20 g wet cell pellet in 40 ml of resuspension buffer) and transfer the suspension into a 100-ml glass beaker. Disrupt the cells by sonication on ice (six cycles with 2 min, intensity 55%, pulse 0.5 s/1.5 s).\nWait 2 min in-between cycles to prevent heating of the cell lysate, which can result in thermal denaturation and, as a consequence, precipitation of the POI.\n8. Centrifuge the cell lysate (39,000 × g, 4°C, 60 min) to remove insoluble cell debris.\nDuring this step, continue to the equilibration of the metal affinity column, in step 9.\n9. Load the supernatant on a 5-ml metal affinity column equilibrated with assay buffer (buffer 4.1) (use for AcsA a HiTrap. TALON® crude metal affinity column and for AcuA a Ni Sepharose® High Performance metal affinity column) using a medium pressure chromatography system (low MPa range) with UV detection (280 nm) at 4°C. Wash the column with 15 column volumes (CVs) of buffer 4.2 to remove unbound proteins. Elute the target protein using an imidazole gradient from 20 mM imidazole (buffer 4.2) to 500 mM imidazole (buffer 4.3).\n10. Pool the fractions containing the POI (here: AcsA and AcuA) based on monitoring the absorption at 280 nm (A280) and the subsequent analysis of the protein containing fractions by SDS-PAGE; determine the concentration by Bradford assay and concentrate to 10-20 g/L protein by ultrafiltration at 4°C with a 10 kDa MW cut off Amicon® Ultra Centrifugal filter unit.",
    "Following the elution of the target protein from the Ni-NTA column, it is recommended to determine the protein concentration using the Bradford assay, and not by using the A280 and the protein-specific extinction coefficient. This is due to the fact that the elution buffer contains imidazole, which also absorbs at 280 nm and interferes with the concentration determination. If eluting with an imidazole gradient and pooling several fractions, it is difficult to prepare an accurate blank, as the exact concentration of imidazole in the elution is unknown.\nDuring this step, start equilibrating the size-exclusion column (step 11) in order to be ready to continue working without delay. The equilibration takes up to 2 hr.\n11. To obtain a high-purity POI sample, perform size-exclusion chromatography (SEC). Equilibrate the size-exclusion column (HiLoad® 26/600 Superdex®200 pg for AcsA; HiLoad® 26/600 Superdex®75 pg for AcuA) at 4°C with 1.5-2 CVs of assay buffer (buffer 4.1).\nDepending on the molecular weight and amount of the target protein, an appropriate column has to be chosen.\n12. Load the concentrated target protein on the equilibrated size-exclusion column at 4°C and elute with 340 ml of assay buffer (buffer 4.1) using a medium pressure chromatography system (low MPa range). Set the flow rate to an appropriate flow rate to keep the pressure limit of the column (0.3 MPa) and collect the eluate in 3-ml fractions.\nThe protein amount loaded onto the SEC column and the settings used during the run depend on the column used. To ensure optimal separation performance of the column, the SEC column should not be overloaded with protein.",
    "13. Pool the pure protein fractions representing a single oligomeric species from the SEC elution following analyses by SDS-PAGE (Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]; an example of SEC results and the subsequent identification of pure fractions by SDS-PAGE for AcuA is shown in Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0006]) and concentrate at 4°C to approximately 10 g L-1 using Amicon Ultra Centrifugal filter unit (10 kDa MW cut off). Afterwards, flash-freeze small aliquots (∼20 μl) in liquid nitrogen and store at −80°C until use.\nProtein concentration can be assessed by the Lambert-Beer law by measurement of the absorption at 280 nm (A280) using a spectrophotometer such as a NanoDrop ND 1000 with an extinction coefficient ε280 of 127.770 M-1 cm-1 for AcsA (65.97 kDa) and ε280 of 46.870 M-1 cm-1 for AcuA (25.21 kDa).\nProtParam calculates protein extinction coefficients using the Edelhoch method, with the extinction coefficients for Trp and Tyr determined by Pace and colleagues (Edelhoch, 1967[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0019]; Gasteiger et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0023]; Pace et al., 1995[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0052]). This allows one to accurately calculate the protein concentration in the folded state. If further chromophores or cofactors are bound to the protein that also absorb at 280 nm, this has to be considered.\nCAUTION: Handle liquid nitrogen with care. Use protective equipment for extremely low temperatures and provide a well-ventilated environment.\nIn vitro lysine acetylation of AcsAK549 by lysine acetyltransferase AcuA\n14. Prepare the following mix in a 1.5-ml microcentrifuge tube and mix gently by pipetting up and down:\n         \n34.4 μl of assay buffer (buffer 4.1)\n1 μl of 10 mg ml−1 AcuA (final concentration 10 µM)\n2.6 μl of 10 mg ml−1 AcsA (final concentration 10 µM)\n2 μl of 1 mM acetyl-coenzyme A (final concentration 50 µM).",
    "Acetyl-CoA is a thioester that is quite unstable in solution. Ideally, prepare a fresh solution right before starting the experiment. Add acetyl-CoA as final component to start the reaction.\n15. Incubate at 37°C (e.g., Mixing Block MB-102) for 30 min.\nTypically, after 30 min, the acetylation signal in the immunoblot is strong. A shorter incubation time of 10 to 20 min is also possible, but may lead to weaker acetylation signals during detection.\nIf the acetylated substrate will be further used in a deacetylation assay, the sample should be split into two halves. One half is stopped with 5× SDS-PAGE sample buffer (see next step), whereas the other half is used for an analytical SEC performed directly after an incubation of 10 min on ice, followed by deacetylation assay (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002]). If the substrate will not be used in deacetylation, proceed with the next step.\n16. After incubation, stop the reaction with 10 μl of 5× SDS-PAGE sample buffer and incubate the sample at 95°C in a heat block for 8 min.\n17. To detect the acetylation signal, load 5 μl of the stopped sample in a 12% (v/v) SDS-PAGE gel (Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]). In addition, load a negative (a non-acetylated protein; here: Ran) and positive control (a lysine-acetylated protein; here: His6-Ran AcK71; see BP1) and a pre-stained protein ladder onto the gel. The controls are important to judge the immunoblotting procedure. After the electrophoresis, transfer the proteins from the SDS-PAGE gel onto a PVDF membrane.\n18. As a loading control, and to assess the efficiency of protein transfer, stain the membrane with Ponceau S red solution for 5 min at room temperature and wash the membrane with Milli-Q water until signals are visible (Fig. 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0006]).",
    "19. Block unspecific antibody binding sites on the membrane with 5% (w/v) skimmed milk powder (blocking buffer) for 2 hr at room temperature.\n20. Incubate the membrane with the primary anti-acetyl-L-lysine antibody (here: abcam, cat. no. ab21623) for 2 hr at room temperature (prepare 10 ml at a dilution 1:5000 in blocking buffer).\n21. Wash the membrane three times with PBS-T for 10 min and incubate with the secondary antibody (here: abcam, cat. no. ab6721) for 2 hr at room temperature (prepare 10 ml at a dilution of 1:5000 in blocking buffer)\n22. Wash the membrane three times with PBS and incubate the membrane with 2 ml of ECL A and 2 ml of ECL B solution for 1 min at room temperature. Detect the ECL signal with a chemiluminescent imager (Fig. 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-fig-0006]).\nIf no chemiluminescence signal is recordable, prepare fresh ECL B solution, as the H2O2 might be consumed (see Troubleshooting).\nStore the ECL A and ECL B solutions at 4°C.",
    "This protocol describes the analysis of non-enzymatic, chemical acetylation of proteins and its detection using immunoblotting and LC-MS/MS. Determining the stoichiometry of a lysine acetylation event is important in order to judge its physiological significance. Under physiological conditions, N-(ε)-amino groups of lysines can be acetylated either enzymatically or non-enzymatically. As discussed above, non-enzymatic acetylation in the cell occurs at high concentrations of either acetyl-coenzyme A (acetyl-CoA; e.g., in the millimolar range in mitochondria of eukaryotic cells) or acetyl-phosphate (AcP; e.g., in the low millimolar range in Escherichia coli) and alkaline pH. This protocol describes the steps to perform non-enzymatic acetylation of N-(ε)-amino groups of lysine side chains of natively folded proteins. The concentration of acetyl-coenzyme A (20-1000 μM) or acetyl-phosphate (1-20 mM), the incubation temperature (25˚C-37˚C) and/or the incubation time (3-18 hr), and the accessibility of the N-(ε)-amino groups of lysine side chains of a protein determine the degree of lysine acetylation. The acetylation of a protein can be qualitatively detected by immunoblotting using an anti-acetyl-L-lysine antibody (anti-AcK antibody) in combination with a secondary antibody that allows detection of the signal (e.g., HRP-coupled or fluorescence-labeled compound). To unravel the specific site of lysine acetylation, liquid chromatography−tandem mass spectrometry (LC-MS/MS) is performed, as described below. We exemplify these protocols by describing non-enzymatic acetylation of a recombinantly expressed and purified protein by treatment with acetyl-CoA or acetyl-phosphate, and the subsequent identification of the acetylation sites applying LC–MS/MS.\nMaterials\nRecombinantly expressed and purified protein of interest (for protein purification protocols, see Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002]-4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0004])\nBradford assay (Carl Roth, cat. no.: K015.1)\n100 mM lithium potassium acetyl-phosphate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0006])\n10 mM acetyl-coenzyme A trilithium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0001])\n5× reaction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0032])\n5× SDS-PAGE sample buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0036])\nLadder: my-Budget Prestained Protein Ladder (Bio-Budget, cat. no. 86-1000-0500)",
    "12% v/v SDS-PAGE gel and SDS-PAGE running buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0035])\nSDS-PAGE staining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0037])\nSDS-PAGE destaining solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0034])\n12% v/v mini-PROTEAN SDS-PAGE gel (Bio-Rad)\nPre-stained marker (Thermofisher scientific, cat. no. 26617)\nPositive control (an lysine-acetylated protein; here: His6-Ran AcK71; see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001])\nNegative control (a non-acetylated protein; here: Ran; see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001])\nECL solution A and B (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0020])\nBlocking buffers: 1%, 3%, and 5% (w/v) skimmed milk powder in PBS-T (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0003])\nRabbit anti-acetyl-L-lysine antibody (abcam, cat. no. ab21623)\nGoat anti-rabbit-HRP antibody (abcam, cat. no. ab6217)\nImmunoblot transfer buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0025])\nPBS-T solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0031])\nMethanol (Carl Roth, CAS no. 67-56-1)\n50 mM triethylammonium bicarbonate (TEAB) buffer, pH 8.5 (Sigma Aldrich, cat. no. T7408)\nRapiGestTM SF (Waters, cat. no. 186001861)\n500 mM TCEP (tris-(2-carboxyethyl) phosphine hydrochloride) buffer (Sigma Aldrich, cat. no. C4706)\n100 mM iodoacetamide (Sigma Aldrich, cat. no. I6125)\nEndopeptidase trypsin solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-rec-0022])\nTrifluoroacetic acid (Sigma Aldrich, cat. no. 74564)\nWetting solution: 0.1% v/v acetic acid (3738.4, Carl Roth) in 70% v/v acetonitrile (7330.1, Carl Roth)\nEquilibration solution (0.1% v/v acetic acid in 3% v/v acetonitrile)\nWashing solution (0.1% v/v acetic acid in water)\nElution solution (0.1% v/v acetic acid in 60% v/v acetonitrile)\nBuffer B (0.1% v/v acetic acid in acetonitrile)\nReproSil-Pur 120 C18-AQ (R13.aq.0003, Dr. Maisch GmbH, Ammerbuch-Entringen, Germany)\nTabletop microcentrifuge (Micro Star 17R, VWR, or equivalent)\n1.5-ml microtubes (BRAND, cat. no. 780500)\nNanoDrop spectrophotometer (DS-11 Series Spectrophotometer, DeNovix, or equivalent) or UV-Vis spectrophotometer (Cary 60 UV-Vis spectrophotometer, or equivalent)\nHeating block (PCR machine) or water bath\nSDS-PAGE system (Mini-PROTEAN Tetra handcast system, Bio-Rad, or equivalent)\nSemi-dry blotting system (Trans-blot turbo transfer system Bio-Rad, or equivalent)\nImmobilon-P membrane, PVDF, 0.45 μm (MERCK, Millipore cat. no. IVPH00010)\nShaker/Nutator\nGel documentation system (Octoplus OPLEX, NHDyeAGNOSTICS, INTAS Science Imaging, or equivalent)",
    "Pierce C18 Tips (Thermo Fisher Scientific, cat. no. 87782)\nConcentrator plus vacuum centrifuge (Eppendorf, cat. no. 5305000703)\nMicro-flow UPLC system (EASY nLC, Thermo Fisher Scientific, or equivalent)\n20-cm length, 100-µm inner diameter column\nMass spectrometer (Q Exactive Plus Orbitrap, Thermo Fisher Scientific, or equivalent)\nMaxQuant, Version 1.6.17.0 (https://maxquant.org/[href=https://maxquant.org/])\nAdditional reagents and equipment for SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]) and immunoblotting (Western blotting; Ni, Xu, & Gallagher, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049])\nNon-enzymatic acetylation of proteins using Ac-CoA or AcP\nHere, we describe the protocol for any protein. Start with one aliquot of purified protein (50-100 μl, 1-10 g/L).\n1. Microcentrifuge the purified protein solution in a 1.5-ml microcentrifuge tube (10 min, 11,000 rpm, 4˚C).\n2. Pipette the supernatant into a fresh 1.5-ml microcentrifuge tube. Avoid transferring any protein precipitation or protein pellet into the tube.\n3. Determine the concentration of the pure protein solution by measuring the absorption at 280 nm (A280) or by performing a Bradford assay [measuring the absorption of the reaction product at 595 nm (A595)] or a similar procedure (e.g., BCA or amido black protein assay) to determine protein concentration with a UV-Vis spectrophotometer.",
    "The protein concentration is determined by measurement of the absorption at 280 nm (A280) using the protein's specific molar extinction coefficient, ε, after the Lambert-Beer law (A = ε·c·d). The A280 can be determined by using a spectrophotometer such as a NanoDrop, which works with small volumes of 1-2 μl. To calculate the molar concentration, c (unit: mol L-1) and the molar extinction coefficient, ε (unit: Μ−1 cm-1), the molecular weight (MW) of the protein and the path length, d (unit: cm) need to be provided. Sometimes, determining protein concentration using A280 and the extinction coefficient is not possible, e.g., if the protein binds to a cofactor that also absorbs UV light in the range of 280 nm. In these cases, the Bradford assay or a similar assay can be performed. For these assays, a standard curve needs to be generated based on a dilution series of known concentrations of a protein (usually BSA). After plotting the absorption at 595 nm (A595) against the protein (BSA) concentration, a linear curve fit within the dynamic range, i.e., linear relation of A595 and protein concentration, is performed, and an equation is derived from this. This equation can then be used to calculate the protein concentration of the target protein solution (for details, see (Olson, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0051])).\n4. Dilute the protein sample with a suitable buffer to a concentration of 20-200 μM.\nThe protein concentration in the assay is usually in the low μM range. To pipette reasonable volumes (1-10 μl), a dilution of a highly concentrated protein solution is recommended. The non-enzymatic acetylation reaction is performed at pH 8. If the protein solution needs to be diluted, it is advisable to dilute it into the reaction buffer (1×), so that pH discrepancies can be minimized.",
    "5. Set up one of the reactions shown in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl-0002] or 3 for the non-enzymatic acetylation. Use either acetyl-phosphate or acetyl-coenzyme A. The tables describe a setup for testing acetylation at three different incubation temperatures (25, 30, and 37°C) and four concentrations of acetyl-phosphate or acetyl-CoA (0, 1, 5, and 20 mM) resulting in 12 conditions.\nThe protein volume is calculated using the protein stock solution concentration, the aimed-at concentration in the assay, and the total volume of the reaction. Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl-0002] describes the protocol for using 10 µM protein. However, this might vary with the individual protein used, and is dependent on several factors, e.g., concentration-dependent formation of oligomers that would shield accessible lysine side chains, and the detection by the anti-acetyl-lysine antibody. We have shown that the anti-acetyl-lysine antibodies are not unbiased concerning the sequence context of the acetyl-lysine, so that it might be that some proteins are better detected than others (de Boor et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0016]). The protein concentration needs to be adjusted accordingly. For example, for a protein stock solution with a concentration of 200 μM, use 1 μl in a 20 μl reaction to obtain a final concentration of 10 µM:\n         formula:\n$$empty$$\nTable 2.\n                Non-Enzymatic Reaction Setup with Lithium/Potassium-Acetyl-Phosphate\ntable:\n﻿Unnamed: 0_level_0,1,2,3,4,5,6,7,8,9,10,11,12\nSample,Incubation temperature 25°C,Incubation temperature 25°C,Incubation temperature 25°C,Incubation temperature 25°C,Incubation temperature 30°C,Incubation temperature 30°C,Incubation temperature 30°C,Incubation temperature 30°C,Incubation temperature 37°C,Incubation temperature 37°C,Incubation temperature 37°C,Incubation temperature 37°C\nVolume of acetyl-phosphate [µl],0,2 (10 mM stock),10 (10 mM stock),4 (100 mM stock),0,2 (10 mM stock),10 (10 mM stock),4 (100 mM stock),0,2 (10 mM stock),10 (10 mM stock),4 (100 mM stock)\nProtein concentration [µM],10,10,10,10,10,10,10,10,10,10,10,10\nReaction buffer (5×) [µl],4,4,4,4,4,4,4,4,4,4,4,4\nFiltered ddH2O [µl],Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y\nTotal assay volume [µl],20,20,20,20,20,20,20,20,20,20,20,20",
    "6. Incubate the reactions in a heat block, e.g., PCR machine or water bath (25˚C, 30˚C/37˚C, 3-18 hr; also see Tables 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl-0002] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl-0003], 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-tbl-0004]).\nAfter incubation, two methods to analyze the samples are conducted: immunoblotting (steps 7-20) to confirm the acetylation of the protein and LC-MS/MS to identify the sites of acetylation (steps 21-41). To this end, the samples should be divided before proceeding to next steps.\nTable 3.\n                Non-Enzymatic Reaction Setup with Acetyl-Coenzyme A\ntable:\n﻿Unnamed: 0_level_0,1,2,3,4,5,6,7,8,9,10,11,12\nSample,Incubation temperature 25°C,Incubation temperature 25°C,Incubation temperature 25°C,Incubation temperature 25°C,Incubation temperature 30°C,Incubation temperature 30°C,Incubation temperature 30°C,Incubation temperature 30°C,Incubation temperature 37°C,Incubation temperature 37°C,Incubation temperature 37°C,Incubation temperature 37°C\nVolume of acetyl-coenzyme A [µl],0,5 (100 μM stock),5 (1 mM stock),2 (10 mM stock),0,5 (100 μM stock),5 (1 mM stock),2 (10 mM stock),0,5 (100 μM stock),5 (1 mM stock),2 (10 mM stock)\nProtein concentration [µM],10,10,10,10,10,10,10,10,10,10,10,10\nReaction buffer (5×) [µl],4,4,4,4,4,4,4,4,4,4,4,4\nFiltered ddH2O [µl],Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y\nTotal assay volume [µl[,20,20,20,20,20,20,20,20,20,20,20,20\nTable 4.\n                Troubleshooting\ntable:\n﻿Problem,Possible Cause,Solution\nBasic Protocol Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001],Basic Protocol Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001],Basic Protocol Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0001]\nHigh amounts of translational termination product,Translational stop at amber stop codon by RF1,Check whether AcK was added and probably increase concentration; use E. coli ΔRF1 for expression.\nESI-MS does not show correct molecular weight of POI and/or immunoblotting for acetyl lysine does not show any signal,CobB might have deacetylated POI during expression. Anti-acetyl-lysine antibody does not recognize the site,\"Check whether nicotinamide was added to the culture and/or increase the concentration; use E. coli ΔCobB for expression Check dilution of the antibody used and amount of protein loaded on the SDS-PAGE gel, and increase accordingly. Prepare a fresh antibody dilution. Check transfer of proteins from the SDS- PAGE to the membrane.\"",
    "High amounts of translational termination product but also of full-length protein,Low acetyl-L-lysine incorporation efficiency,Use C-terminal affinity tag to remove translational termination product; add additional copies of AckRS3 and/or MbPylTCUA encoding genes on compatible vector.\nBasic Protocol Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002],Basic Protocol Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002],Basic Protocol Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0002]\nNo acetylation signal,POIAck is not acetylated or antibody does not detect POIAck,Analyze POIAck by ESI-MS for acetyl-L-lysine incorporation and evaluate using antibody at different concentrations.\nNo deacetylation,POIAck is no substrate,Repeat the assay with different SIRT.\n,Sirtuin is not active,Test activity with known SIRT substrate.\n,Slow substrate turnover,Extend assay incubation time or use a higher SIRT concentration.\nWeak deacetylation,\"Access of SIRT to acetylation site is limited, substrate is not a physiological substrate, or other factors are missing to enhance SIRT-catalyzed deacetylation\",Extend incubation time or use different SIRT constructs.\nDeacetylation with NAM,NAM concentration is too low,Repeat with new solution.\n,NAM was added following addition of the SIRT,\"Always add the SIRT last, particularly if the substrate is efficiently deacetylated by the SIRT.\"\nBasic Protocol Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0003],Basic Protocol Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0003],Basic Protocol Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0003]\nStrong aggregation of KDAC,Protein is denatured/partially unfolded in the KDAC elution buffer,Reduce the time for Zn2+-NTA affinity chromatography and SEC. Include an initial purification step via Superose 6 SEC following Zn2+-NTA chromatography.\n,Protein is insoluble following expression,\"Optimize expression conditions (expression medium, expression time, modify IPTG concentration, expression host, etc.).\"\nGreen/blue protein solution,KDAC binds Ni2+ ions and of Zn2+ ions,Strip the Ni2+-NTA resin with EDTA-containing stripping buffer and charge it with ZnCl2.\nNo deacetylation activity in FdL assay,Acidification affects the fluorescence and enzyme activity,\"Check pH value of assay. If necessary, increase the concentration of buffer agent.\"\n,Deactivation of KDAC in the Zn2+-ion-rich environment,Avoid adding additional Zn2+ to the assay buffer.\nNo cleavage by trypsin,Trypsin is inactive,\"Prepare fresh developer solution, increase trypsin concentration.\"",
    "No acetylation signal in immunoblotting,H2O2 is consumed in ECL solution B,Prepare fresh ECL solution B.\n,Anti-acetyl-lysine antibody does not recognize the acetylation site on the substrate,\"Use alternative approaches (mass spectrometry, acetate detection by coupled-enzymatic assay, etc.) to detect the deacetylation of the substrate.\"\nBasic Protocol Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0004],Basic Protocol Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0004],Basic Protocol Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0004]\nSubstrate protein was not acetylated,Acetyl-coenzyme A is degraded,Use fresh solutions.\n,Acetyltransferase is inactive,Optimize the buffer.\nWeak signal in immunoblot,Weak chemiluminescent signal,Extend exposure time.\n,Insufficient amount of protein was transferred from the SDS-PAGE gel to the membrane,\"Replace ECL solution B, the H2O2 might be consumed. Increase the blotting transfer time.\"\nBasic Protocol Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0005],Basic Protocol Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0005],Basic Protocol Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-prot-0005]\nProtein was not lysine acetylated,The LiK-acetyl-phosphate/acetyl-coenzyme A was degraded,Use fresh solutions.\nNo/poor immunoblot signal,Transfer of protein to the PVDF membrane was insufficient,The PVDF membrane was not activated by methanol.\n,,Increase the transfer time to 30-60 min.\n,,Increase the transfer voltage to 20 V.\n,The PVDF membrane was blocked too much,Reduce the concentration of the milk solution to 1%-3% w/v.\n,,Reduce blocking incubation time.\n,The anti-acetyl-L-lysine antibody did not bind,The anti-acetyl-L-lysine antibody concentration was too low. Increase the concentration to 1:1000.\n,,Increase the incubation time.\n,,Decrease the milk concentration to 1%-3% w/v.\n,,The antibody was degraded. Use a fresh antibody solution.\n,The secondary antibody did not bind,The antibody concentration was too low. Increase the antibody concentration to 1:5000.\n,,Increase incubation time.\n,,Decrease milk concentration to 0-0.5% w/v.\n,,The antibody was degraded. Prepare a fresh antibody solution.\n,The ECL solution was degraded,Use fresh solutions.\nNo peptides detected in the LC-MS/MS,The protein was not denatured properly before digestion,Ensure the correct concentrations of iodoacetamide and TCEP.\n,The endopeptidase trypsin was degraded and/or inactive,Use fresh enzymes.",
    ",The incubation time for trypsin digestion was too short,Increase the incubation time to overnight.\n,The pH for the trypsin digestion was incorrect,Check the pH of the reaction. It should be between 8.3 and 8.5.\n,The Pierce C18 Tip dried out,Always keep the Pierce C18 Tip moist in LC-MS/MS buffer.\nImmunoblotting\n7. Add 5 μl of 5× SDS sample buffer to each sample. Mix by carefully pipetting up and down.\nAvoid creating bubbles when mixing the samples by keeping the pipette tip submerged.\n8. Incubate the samples for 10 min at 95˚C.\n9. Microcentrifuge the samples (1 min, 11,000 rpm, room temperature).\n10. Load the samples (as much volume as possible, depending on the loading capacity in the lanes of the SDS-PAGE gel used), including a pre-stained protein marker (3 μl), a positive control (an lysine-acetylated protein; here: His6-Ran AcK71), and a negative control (a non-acetylated protein; here: Ran) on an SDS-PAGE gel and run the SDS-PAGE (constant volt at 160 V, 1 hr, room temperature for a 12% v/v mini-PROTEAN SDS-PAGE gel) in SDS running buffer until the dye front is just off the bottom of the gel (see Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0022]).",
    "Load the positive control in the outermost lane, in case the signal for the positive control is too strong, or the signal for the acetylated samples is too weak, because either the chemical acetylation was not quantitative or the respective acetyl lysine may not be strongly recognized by the antibody. The lane for the positive control can be temporarily covered during the readout of the immunoblot, so that the exposure time can be extended for the acetylated samples in order to get better signals without detecting the strong overload of the positive control. It is recommended to always have a positive and a negative control on the immunoblot in order to be able to assess the technical performance of the immunoblot.\n11. Transfer the proteins from the SDS-PAGE gel onto a methanol-activated PVDF membrane in immunoblot transfer buffer for 25 min at 15 V and at room temperature (also see Ni et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.277#cpz1277-bib-0049]).\n12. Rinse the PVDF membrane briefly in PBS-T buffer.\n13. Block unspecific binding sites on the PVDF membrane with 3%-5% w/v skimmed milk powder in PBS-T for 1 hr at room temperature on a nutator.\nMake sure to thoroughly dissolve the milk powder in PBS-T and add enough solution to completely cover the membrane.\n14. Wash the membrane three times by incubating it for 15 min each time in PBS-T at room temperature on the nutator.\n15. Incubate the membrane with the primary antibody (e.g., rabbit anti-acetyl-L-lysine, 1:2000) in 3% (w/v) skimmed milk/PBS-T overnight in a cold room at 4˚C on a nutator.\nIncubate the membrane in a closed container to prevent evaporation and make sure to add sufficient solution to completely cover the membrane.",
    "16. Wash the membrane three times by incubating it for 15 min, each time in PBS-T at room temperature on the nutator.\n17. Incubate the membrane with the secondary antibody (e.g., goat anti-rabbit-HRP, 1:10,000) in 1% (w/v) skimmed milk/PBS-T for 1 hr at room temperature on a nutator.\n18. Wash the membrane three times by incubating it for 15 min each time in PBS-T at room temperature on the nutator.\n19. Incubate the membrane with 2 ml of ECL developing solution (1 ml ECL A plus 1 ml ECL B) in the dark for 1 min at room temperature.\n20. Expose the membrane to a digital chemiluminescence reader (e.g., INTAS Science Imaging documentation system).\nLiquid chromatography-tandem mass spectrometry (LC-MS/MS)\n21. Dilute proteins (1-5 g/L) in 50 mM TEAB/ 0.1% RapiGestTM SF\n22. Reduce proteins using TCEP at a final concentration of 5 mM for 45 min at 60°C (stock concentration of TCEP: 500 mM) in a final reaction volume of 50 μl.\nIn this step, the protein completely unfolds so that no secondary structures (α-helix or β-sheet) remain. The RapiGestTM SF denatures the protein and the TCEP acts as a reducing agent to reduce cysteines.\n23. Add 5 μl of a 100 mM iodoacetamide stock solution to reach a final concentration of 10 mM. Vortex the samples and incubate in the dark at room temperature for 15 min.\nIodoacetamide is used to alkylate sulfhydryl groups (-SH) in proteins by formation of carbamidomethyl groups (57.07 Da) to cap and protect them, and thereby prevent formation of disulfide bonds, which would interfere with the following enzymatic digest.\n24. Reconstitute trypsin in the provided trypsin resuspension buffer according to the manufacturer's instructions. Add trypsin at a protease:protein ratio of 1:200 and incubate for 5 hr at 37°C at 900 rpm.",
    "25. Precipitate RapiGestTM SF by adding 1 μl of trifluoroacetic acid, incubate for 45 min at 37°C, and microcentrifuge three times for 10 min at 15,000 rpm at 4°C to remove RapiGestTM SF.\n26. Purify peptide mixture using Pierce C18 Tips (100 μl bed volume)\n27. Wet the C18 material by pipetting 100 μl of wetting solution twice.\n28. Equilibrate the C18 material by pipetting 100 μl of the equilibration solution twice.\n29. Bind peptides by pipetting the peptide solution 10 times up and down; pipet the supernatant back into reaction tube.\n30. Wash bound peptides on C18 material by pipetting 100 μl of washing solution. Repeat this step four times.\n31. Elute peptides from C18 material by pipetting 100 μl of elution solution. Transfer the eluted peptide mixture into glass vial.\n32. Dry down in a vacuum centrifuge and resolve prior to MS analysis in 10 μl of 0.1% v/v acetic acid in water.\nLC-MS/MS analysis and confirmation of site-specific N-(ε)-L-lysine acetylation\n33. Separate peptides by liquid chromatography (e.g., EASY nLC 1200) running a binary linear gradient of 4% (v/v) to 26% (v/v) buffer B and a flow rate of 0.3 μl/min for 20 min on an analytical column (e.g., self-packed of 20 cm length and 100 µm inner diameter; filled with 3 µm ReproSil-Pur 120 C18-AQ. Couple to an Orbitrap mass spectrometer (e.g., QExactive HF).\n34. Acquire mass spectra with an automatic gain control (AGC) target of 3 × 106 at a resolution of 60,000 in a mass range of 300-1650 m/z.\n35. Set the maximum injection time to 100 ms for ion accumulation.",
    "36. Measure the MS/MS events for the 15 most abundant peaks (Top 15 method) in the data-dependent mode of high mass accuracy Orbitrap after HCD (Higher energy C-trap Dissociation) fragmentation in a 200-2000 m/z mass range.\n37. Set the resolution to 15,000, the injection time to 50 ms, and an AGC target of 1 × 105.\n38. Process raw files with a suitable analysis program (e.g., MaxQuant). Perform searches with trypsin specificity allowing two missed cleavages and set carbamidomethyl at cysteine residues as a fixed modification. Set methionine oxidation and acetylation on lysine as variable modifications.\n39. Set the minimal peptide length to 5 and the false discovery rate (FDR) on proteins and peptides to 1% for analysis.\n40. Analyze the obtained MS/MS spectra for peptides containing acetylated N-(ε)-amino groups of lysines (m/z for peptide, peptide score, quality of obtained b- and y-ion series) and identify the exact L-lysine acceptor sites."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}