{
  "id": 2499,
  "origin_website": "Cell",
  "title": "Environmental enrichment and exercise housing protocols for mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAssemble standard cages\nTiming: 5 min\nThis step aims to create standard housing cages, where no additional items are added.\nFill the base of the 34 cm × 16 cm × 16 cm cage with sterilized wood shavings, enough to cover the base to approximately 1 cm of depth and four tissues.\nAdd the lid to the cage.\nAdd the appropriate amount of food to each cage and water bottles in the designated area for mice to have ad libitum access.\nPlace mice into the cage, secure the lid and make sure to attach relevant identification tags or cards to the outside of the cage.\nAssemble environmental enrichment cages\nTiming: 10 min\nThis step aims to create an environmental enrichment cage through the addition of tunneling, climbing, housing and novel objects into the home cage, thus enhancing sensory, motor and cognitive stimulation in comparison to standard housing. At least one tunneling, housing, climbing and somatosensory item needs to be placed into each home cage.\nFill the base of the larger 40 cm × 28 cm × 18 cm cage with sterilized wood shavings, enough to cover the base to approximately 1 cm of depth and four tissues.\nAdd eight enrichment items listed in the materials section above into the cage including:\nOne housing item.\nOne tunneling item.\nOne climbing item.\nOne somatosensory item from each subcategory.",
    "Note: You can use cable ties to attach climbing objects to the wire frame of the cage. Please see troubleshooting 1[href=https://www.wicell.org#troubleshooting] for considerations when choosing enrichment items. We suggest a standard number (eight in this case) of enrichment items per cage, to ensure at least a minimal level of environmental novelty and complexity, however this number can be adjusted according to specific conditions (e.g., cage sizes and enrichment-object sizes).\nAssemble the lid and cage:\nOnce the lid has been assembled with the addition of any climbing object place it on top of the base of the cage.\nAdd the appropriate amount of food to each cage and water bottles in the designated area for mice to have ad libitum access.\nPlace mice into the cage, secure the lid and make sure to attach relevant identification tags or cards to the outside of the cage.\nCritical: Environmental enrichment cages should not contain running wheels, unless your goal is to investigate the cumulative effects of both interventions (environmental enrichment and running exercise). If environmental enrichment does include running wheels, then it should be assumed that rodents will choose to use the running wheels (due to the hedonic, and possibly addictive, effects of such physical exercise) more than most other enrichment objects. It must be ensured that all running wheels have free and unrestricted spinning capacity (under voluntary ad-libitum exercise conditions), and thus enrichment objects (or bedding materials) cannot be allowed to impede the spinning of any running wheels, and this must be checked (along with the animals themselves) daily.\nAssemble exercise cages\nTiming: 5 min\nThis step aims to create an exercise cage through the addition of running wheels to enhance motor stimulation in comparison to standard housing.",
    "Fill the base of the larger 40 cm × 28 cm × 18 cm cage with sterilized wood shavings, enough to cover the base to approximately 1 cm of depth and four tissues.\nAssemble running wheels:\nPlace the running wheel stand into the sides of the running wheel.\nUse oil to lubricate the join between the running wheel and the stand to make sure the wheel moves smoothly and without any noise, making sure to remove any excess lubricant (so that the rodents cannot ingest it).\nAdd running wheels into the cage:\nNote: The number of running wheels will be dependent on the number of mice in the cage, with one running wheel per two mice. Due to the size of the cages used in this protocol we recommend a maximum number of two wheels per cage, noting that two mice can run in parallel on a single wheel (although such behavior may be affected by dominance hierarchies). Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nAdd the lid to the cage.\nAdd the appropriate amount of food to each cage and water bottles in the designated area for mice to have ad libitum access.\nPlace mice into the cage, secure the lid and make sure to attach relevant identification tags or cards to the outside of the cage.",
    "Note: Running trackers can also be added to the running wheels to track physical activity (i.e., total distance run on each wheel per day). Ideally, in group-housed rodents, this would be combined with a technology such as RFID tracking via injectable microchips, to establish which animal is on which wheel at any point in time. However, in the absence of such tracking technology, if all animals within a cage are of the same experimental group (e.g., same genotype), then it is possible to measure the average total distance run per animal, per day (most running will occur during their active dark cycle). Another surrogate measure of exercise is to measure the amount of food consumed (by weighing the chow left in the food hopper daily) and water consumed, and regularly weighing the animals. This provides a rough estimate of energy intake, and energy expenditure, allowing for averaging of food/water intake in group-housed cages.\nAssemble super-enrichment arena\nTiming: 10 min\nThis step is optional and aims to create a super-enrichment playground arena to further enhance sensory, motor and cognitive stimulation in addition to enrichment housing. Due to the larger size of the arena, at least two tunneling, climbing and somatosensory items from each category need to be placed into each arena. This arena can be used to ensure that environmentally enriched mice receive substantial environmental enrichment.\nLocate the previously purchased base of an arena.\nNote: No sterilized wood shavings or tissues are added to the playground arena.\nAdd enrichment items listed above into the arena including a minimum of:\nTwo tunneling items.\nTwo climbing items.\nTwo somatosensory items from each subcategory.",
    "Note: No housing items or food and water are added to the playground arena, to encourage exploration and play rather than nesting. Enrichment items can be stacked on top of one another if they are stable, to encourage climbing and exploration.\nPlace mice into the arena and make sure to attach relevant identification tags or cards to the outside of the arena and add the lid to the arena to ensure mice are contained for the exposure period.\nCritical: Super-enrichment arenas must not contain running wheels, unless your goal is the cumulative effect of both interventions.\nHousing maintenance\nTiming: weekly, timing depends on total number of cages\nOnce a week all cages from all housing conditions should be changed for cleanliness purposes, with replacement of bedding materials including wood chips and tissues, removing accumulated feces and urine from the cage floor. All new houses should be assembled before changing cages so that mice can be moved directly from the old cage into the new one. Do not change cages more than weekly to avoid increased handing as a potential confounder.\nStandard cage weekly maintenance\nFollowing steps 1–4 to assemble a new standard cage.\nRemove the entire old standard cage including the cage, lid, old wood chips and tissues.\nTransfer mice directly into newly sterilized and assembled standard cage with wood chips and tissues.\nEnrichment cage weekly maintenance\nFollowing steps 5–9 to assemble a new environmental enrichment cage.\nRemove the entire old environmental enrichment cage including the cage, lid, old wood chips, tissues and all enrichment items for sterilization.\nTransfer mice directly into newly sterilized and assembled environmental enrichment cage with wood chips and tissues and a specified number (in our case eight) of new enrichment items should be added into the cage in a novel configuration.\nExercise cage weekly maintenance",
    "Following steps 10–15 to assemble a new exercise cage.\nRemove the entire old exercise cage including the cage, lid, old wood chips, tissues, running wheels and stands for sterilization.\nTransfer mice directly into newly sterilized and assembled exercise cage with wood chips and tissues and running wheels on stands.\nSuper-enrichment arena maintenance\nDue to the study aims, mice were placed in the super-enrichment area three times a week for one hour. After each one-hour session, mice are returned to the home cage and the following steps are to be completed:\nRemove all enrichment toys from the super-enrichment arena.\nClean the arena using paper towel and ethanol.\nAdd new enrichment items in novel configuration to ensure maximal environmental novelty, complexity, and exploration for each one-hour session.\nAfter three weekly sessions:\nRemove the entire old super enrichment arena including the cage, lid and all enrichment items for sterilization.\nHousing exposure duration\nTiming: Study dependent\nFor the aims of the Gubert et al. (2021)[href=https://www.wicell.org#bib3], study animals were randomly assigned to either standard housed, environmentally enriched or exercise housing conditions for six weeks of exposure (six weeks of age to 12 weeks of age) due to the neurodegenerative nature of this mouse model of Huntington’s disease (relative to the randomized littermate wild-type control mice) and previous studies (reviewed by Nithianantharajah and Hannan, 2006[href=https://www.wicell.org#bib7]). Enrichment-housed mice were exposed to the super-enrichment playground three times a week for one hour for two weeks (10 weeks of age to 12 weeks of age).",
    "Note: This timing was specific to the aims and mouse model used in our study. Furthermore, all mice were housed in a room with a 12-hour light/dark cycle (lights on at 7.00 am), controlled for temperature (22°C) and humidity (45%). A lux meter should be used to measure luminance in housing rooms (and other laboratory rooms where live animals spend time) and, in housing rooms, cage positions should be randomized (animals in open-top cages on the top row of cage racks may be exposed to more light than those positioned in middle or lower shelves of these racks)."
  ],
  "subjectAreas": [
    "Systems Biology",
    "Health Sciences",
    "Behavior",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}