{
  "id": 13074,
  "origin_website": "Jove",
  "title": "Preparation and Morphological Analysis of Chick Cranial Neural Crest Cell Cultures",
  "procedures": [
    "Any variety of Gallus gallus breeds may be used, including White Leghorn, Golden Sex Link, or Rhode Island Red. The chicken eggs used in the present study were of various breeds and obtained from multiple sources, including local farms and hatcheries.\n1. Preparation of solutions and materials\nPrepare Ringer's solution by mixing 123.3 mM NaCl, 1.53 mM CaCl2, 4.96 mM KCl, 0.809 mM Na2HPO4, and 0.147 mM KH2PO4 (see Table of Materials). Adjust pH to 7.4 and filter sterilize into 100 mL bottles. Store in a clean, dry location. Do not wash bottles with soap (treat as tissue culture glassware).\nPrepare 1 mg/mL stock solution fibronectin (FN) (see Table of Materials) by dissolving FN in sterile Ringer's solution and store in 100 µL aliquots at -80 °C (stable for at least 4 years).\nPrepare complete culture media by supplementing L15 media with 0.8% L-glutamine, 0.08% penicillin/streptomycin, 10% FBS, and 10% chick embryo extract12. Create 3 mL aliquots and store at -20 °C or -80 °C.\n\tNOTE: If cultures are incubated in a CO2 incubator, DMEM/F12 needs to be substituted for L15, which is buffered for air.\nPrepare 4% paraformaldehyde solution in 1x PBS. Adjust pH to 7.4. Create 10 mL aliquots and store them at -20 °C.\n\tCAUTION: Paraformaldehyde must be handled in a fume hood.\nPrepare filter paper support frames (approximately 1 cm x 1.5 cm rectangles of paper with two or three punched holes overlapping on the long axis).\n\t\nPunch holes along the edge of a large piece of filter paper using a standard three-hole punch, cut/trim the punched edge into a strip, and then cut the strip between the holes into rectangles ~ 1.5 cm in length. Autoclave filter papers before use (optional).",
    "Gather dissection tools, including fine forceps (#5), blunt forceps, dissection scissors, spring scissors, and sharpened tungsten needles16.\n2. Embryo incubation\nObtain fertilized eggs from any of the sources mentioned above.\nPlace the fertilized eggs in an upright position (long axis of the egg vertical with the pointed end down/blunt side up) inside a humidified incubator at 38 °C (100 °F).\nIncubate until four to seven somites have formed (stages 8+-9)17, which takes approximately 35 h.\n\tNOTE: Incubation time can vary significantly depending on the strain, age of hens, season, etc., and must be experimentally determined. Programmable outlet timers are useful for initiating incubation during the night to obtain desired timing.\nAfter removing from the incubator, thoroughly spray the eggs with 70% ethanol and let them dry to disinfect the shells.\n\t​NOTE: Embryos can be collected immediately, but letting eggs cool to room temperature decreases the fragility of the yolks and embryo loss during collection.\n3. Preparation of culture dishes\nSelect neural fold culture dishes (see Table of Materials) appropriate for the downstream application.\n\t\nFor cultures that will be fixed and stained, use glass coverslips placed into multi-well tissue culture dishes.\n\t\tNOTE: Coverslips that match the well size will move less with fluid mixing, making explants less likely to shift and more likely to adhere to the coverslip rather than the dish bottom.\nSelect glass-bottom single chamber or divided chamber dishes (see Table of Materials) for live imaging with an inverted microscope.\nFor live imaging on an upright or stereo microscope, use 6-, 12-, or 24-well optically appropriate tissue culture plates.\nSelect plastic tissue culture dishes for the mass collection of migratory neural crest cells for high-throughput analyses.",
    "Add 10 U/mL of penicillin and 10 µg/mL of streptomycin to a 100 mL bottle of sterile Ringer's solution (for example, 100 µL of 10,000 U/mL penicillin and 10,000 µg/mL streptomycin, to make Ringer's P/S). Use Ringer's P/S within 1 week.\nThaw an aliquot of 1 mg/mL of FN on ice. Dilute with Ringer's P/S to a concentration of 10-100 µg/mL of FN.\nPipet enough FN solution to cover the bottom of the well or dish. For example, 100 µL per well in a 24-well plate, 500 µL for a 35 mm dish.\nReplace the lid and incubate dishes or plates with FN solution in a humidified incubator (or a covered tray with distilled water-soaked paper towels) at 38 °C (100 °F) for at least 1 h while dissecting neural folds.\n4. Isolation of chick embryos\nTake care to maintain the orientation of the egg (the embryo floats to the top of the yolk during incubation). Use scissors or blunt forceps to poke a small hole in the shell, about 1/4-1/3 of the way down the length of the egg.\n\t\nCarefully insert the tip of scissors or blunt forceps into the small hole, ensuring not to disrupt the yolk, and cut through the eggshell around the egg, removing the top of the eggshell (Figure 2A).\nPosition the embryo for isolation.\n\tNOTE: If the embryo is not ideally located in the shell cup, use blunt forceps to carefully turn the yolk, so the embryo is on the top. Alternatively, pour the yolk into a gloved, cupped hand, being careful not to break the yolk and allowing the albumin to drain away (Figure 2B). Then, the embryo can be positioned by moving the yolk from hand to hand.",
    "Prepare the embryo by gently using the flat edge of closed blunt forceps to wipe away any excess albumin that remains on the yolk's surface covering the embryo (Figure 2C). Excess albumin can also be removed using gentle pressure with a delicate task wiper.\n\tNOTE: Once albumin is cleared away, the yolk's surface should appear textured instead of smooth. Failure to wipe away sufficient albumin will inhibit the adhesion of the filter paper support in section 4, step 4.\nUse forceps to place a filter paper support frame over the embryo, with the embryo in the frame's window. Gently press down on the filter paper to adhere it onto the yolk.\nCut around the outside of the filter paper frame with dissection scissors (Figure 2D). Use forceps or scissor tips to grasp the edge of the frame and gently lift the embryo away from the yolk (Figure 2E). Lifting away at an angle will help remove the embryo cleanly from the yolk.\nPlace the embryo with the paper frame side down (embryo ventral side up) into a 60 mm or 100 mm Petri dish filled with Ringer's P/S (Figure 2F). Keep the dish of embryos on ice if collecting for an RNA- or protein-sensitive downstream application.\n\t​NOTE: Failure to place embryos ventral side up risks detaching them from their paper frames. Multiple embryos can be collected and stored in Ringer's P/S for up to 1 h before moving to the neural fold dissection steps.\n5. Dissecting neural folds",
    "Transfer an embryo to a clean dish containing Ringer's P/S solution and rinse the embryo by holding the filter paper frame with forceps and gently swishing back and forth to clear away any yolk that obscures the view of the embryo. Exchange the Ringer's P/S or transfer to a fresh dish if it becomes cloudy.\nPosition the embryo dorsal/frame side up under a dissecting microscope. Leaving the embryo on the paper frame to keep it stretched taut and held in place, remove the vitelline membrane using forceps to expose the neural folds.\n\tNOTE: If the embryo falls off the paper frame, it can be laid out flat in the dish or pinned to a sylgard coated dish18 for dissection.\nUsing spring scissors or a sharpened tungsten needle, carefully excise the midbrain neural folds. Include tissue caudal to the expanding optic vesicles and rostral to the hindbrain, where rhombomere constrictions are just beginning to appear (the cardiac crescent is also a useful indicator, Figure 3B,C). Take care to excise the dorsal-most aspect of the neural fold with minimal contaminating neural tube and non-neural ectoderm (Figure 3C).\nTransfer the neural folds to a clean dish containing Ringer's P/S using a P20 pipettor or a sterile, glass Pasteur pipette rinsed with yolky Ringer's P/S (this blocks the plastic or glass to prevent the tissue from sticking). Store collected folds on ice while dissecting additional folds.\n6. Plating neural folds\nThaw an aliquot of complete culture media (section 1, step 3). Add 100 U/mL of penicillin and 100 µg/mL of streptomycin and filter sterilize. Keep prepared media at 37-38 °C while performing other steps.",
    "Remove culture dishes from the incubator (section 3, step 5). Using a pipettor or Pasteur pipette, remove the FN solution from coverslips, dishes, or wells. After rinsing the FN-coated substrate with Ringer's P/S, add an appropriate volume of complete culture media to the dishes or wells (500 µL for wells in a 24-well plate, 2 mL for a 35 mm dish or a six-well plate).\n\tNOTE: Smaller volumes can preserve expensive reagents (e.g., as low as 200 µL for a 24-well plate) but ensure that the dish is sufficiently humidified to avoid evaporation.\nUsing a p20 or p200 pipettor, first, rinse the pipette tip with yolky Ringer's P/S to block the plastic and prevent the tissue from sticking. Then, transfer the isolated neural folds onto the FN coated coverslips, taking care to transfer as little Ringer's P/S as possible. Place the fold(s) toward the center of the FN-coated coverslip.\n\tNOTE: One or a few neural folds can be plated on a 12 mm coverslip in a 19 mm well, up to 50 on a 35 mm plate.\nAfter allowing the explants to settle for 10-15 min, place them into a humidified chamber at 38 °C (100 °F) by slowly and carefully carrying the culture dishes with plated neural folds. This will minimize the shifting of neural folds in the wells, ensuring they remain dispersed and adhere to any coverslips.\n\tNOTE: When using L15 (not DMEM), explant culture dishes can also be incubated in an egg incubator using a covered tray with moistened paper towels.\nIncubate neural fold cultures in the humidified incubator for the duration of active migration (about 16-20 h total, Figure 4).\n7. Fixing and staining of cultured migratory NCCs for morphological analysis",
    "Remove the culture media with a Pasteur pipette and rinse the wells with filter-sterilized 1x PBS.\nAdd 4% paraformaldehyde for 15 min at room temperature.\n\tNOTE: Fixation time may need to be experimentally determined. It is also possible to add paraformaldehyde directly to media for 10 min (50:50), remove, and replace with undiluted 4% paraformaldehyde for 10 min to retain more delicate cellular structures.\nRemove paraformaldehyde and rinse three times with 1x PBS.\nStain fixed NCCs with an appropriate dye for morphological assessment. As an example, staining with Oregon Green conjugated phalloidin is detailed here.\n\tNOTE: Visualizing the actin cytoskeleton with phalloidin19 reveals the structural complexity of migratory NCC with relatively uniform staining intensity; however, phalloidin may not highlight all cell areas. Dyes that label the plasma membrane (e.g., wheat germ agglutinin or DiI) or cytoplasm can also be used, but complicate the imaging of fine protrusions relative to the brightly staining cell body. In addition, immunofluorescence can be performed concurrently to label neural crest cells with HNK-1 or to determine the subcellular localization of a protein of interest7,20.\n\t\nRemove the final PBS rinse and add PBS + 0.5% Triton X-100 (PBST) + 5% serum (FBS or from another animal appropriate for costaining with an antibody) to cover the coverslips and incubate for 10 min on a platform shaker at room temperature.\nPipet 200 nM of Oregon Green conjugated phalloidin (diluted in PBST + 5% serum) onto a smooth surface (such as flexible paraffin sealing film) for each coverslip. For a 12 mm coverslip, pipette a 30 µL volume.\nUsing a pair of forceps, remove the coverslip from the PBST + 5% serum, ensuring to maintain the orientation of the cells facing upward. Briefly touch the edge of the coverslip to a delicate task wiper to wick off excess liquid.",
    "Gently place each coverslip cell side down onto the drop of diluted phalloidin. Incubate for 30 min at room temperature. Keep the coverslips in the dark during staining (cover with an aluminum foil-covered dish or place in a drawer).\nDuring the incubation, add PBST to the wells of the culture dish (750 µL of PBST for each well of a 24-well plate).\nAfter the incubation period, lift coverslips off of the staining solution and place them back into the culture dish, flipping the coverslip over so the cell side is up. Ensure the coverslip is covered with PBST and place on a platform shaker for 10 min, keeping the coverslips covered and in the dark. Remove PBST and repeat this step two times, for a total of three 10 min washes.\nPlace one drop (per coverslip) of mounting media (see Table of Materials) onto a microscope slide. 25 µL volume works well for a 12 mm coverslip.\nAfter the final wash with PBST, touch the edge of the coverslip to a delicate task wiper to remove excess liquid, keeping track of the cell side of the coverslip.\nMount the coverslip cell side down by slowly lowering the coverslip at an angle onto the mounting media to avoid creating bubbles. Allow the media to set before imaging.\n8. Morphological assessment of cultured migratory NCCs\nImage stained cells and export as .tiff files.\n\tNOTE: A 40x objective works well for imaging cultures, but objectives ranging from 10x (to capture a whole field of migratory NCCs) to 100x (single NCCs) can be used to collect images for morphological assessment. Images in the present study were captured using an inverted multimodal imaging platform (see Table of Materials).",
    "Upload the images into an image analysis software (ImageJ21, see Table of Materials). Click on Image > Duplicate to create a second copy of each image to use for analysis, thus leaving the original unedited, as most image processing cannot be reversed.\nClick on Image > Adjust > Brightness/Contrast and use sliding bars to adjust the brightness or contrast of the images.\nConvert the images to grayscale following the steps below.\n\t\nIf images are exported in RGB, they will upload in RGB as a merged channel. To separate the images, click on Image > Color > Split Channels to acquire single-channel grayscale images.\nIf images are already separated, go to Image > Type > 8-bit to convert file to grayscale.\nClick on Image > Adjust > Threshold to convert to a binary image where pixels are identified as cells (foreground; black) or background (white). Use the sliding bar and/or click on Auto to select the Threshold setting that clearly defines cells from the background.\n\t\nIf cells are overlapping or staining is not continuous, it may be necessary to process further using the Watershed or Fill Holes functions22. This will separate cells from one another or fill in gaps within cells to be analyzed. Click on Process > Binary > Make Binary to first convert the image into an 8-bit binary format. Then click on Process > Binary > Watershed or Fill Holes.\n\t\tNOTE: The software will make its best fit for where signals need to be separated or filled in, which can be adjusted further using plug-ins if necessary.\nSelect the measurements to be captured. Click on Analyze > Set Measurements and check the Shape Descriptors boxes for analysis of Circularity (Circ.), Aspect Ratio (AR), Roundness (Round), and Solidity.",
    "NOTE: Other measurements may also be included, like Area and Perimeter, depending on the type of analysis needed.\nClick on Analyze > Analyze Particles, and set the parameters from the \"Analyze Particles\" menu.\n\t\nUnder \"Size\", roughly estimate how large the cells or particles of interest are in pixels, as background signal or smaller cell debris will also be included if the Size parameter remains set at 0-Infinity (for example, set as 500-Infinity in Figure 5).\n\t\tNOTE: Adjusting the Size to a tighter range can exclude smaller or larger particles than the ones needed for analysis.\nUnder \"Circularity\", leave at 0-1.0 to measure all cell shapes in the image.\nUnder \"Show\", select Bare Outlines from the drop-down menu to inspect the cell outlines selected with the \"Analyze Particles\" function. Scan the outlines to ensure that overlapping cells are distinguished, but cells are not divided unnecessarily. Also, check the menu boxes for \"Display Results\", \"Summarize\", and \"Add to Manager\".\nOnce all the parameters have been set, click on Ok.\n\tNOTE: Four separate windows will pop up, showing (1) the bare outlines of the cells identified in the image, (2) the cells counted in the image, (3) the results of each cell's measurements, and (4) a summary of the total number of cells counted and their averaged measurements.\n\t\nIf debris was counted, overlapping cells were counted as one, single cells were counted as multiples, or many cells were omitted from the count, go back to the original, unedited image, make another duplicate, and adjust \"Threshold\" or other parameters.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}