{
  "id": 4743,
  "origin_website": "Bio",
  "title": "A Mouse Model of Preterm Brain Injury after Hypoxia-Ischemia",
  "procedures": [
    "Note: The duration of hypoxia, the chamber temperature, and the age and strain of the mice are all factors that have significant effects on the brain injury outcome. In this model, we use 70 min of hypoxia (Figure 3). However, this hypoxia time might need to be adjusted empirically for each laboratory’s unique conditions. SurgeryPreparation/NotesSet up the surgery area. Work on a ventilated area (Figure 4). Weigh each pup before surgery. Make sure to keep the pups warm all the time using the heating plate before and after surgery. Minimize the time of surgery to avoid cooling of the pups-this is very important for the outcome of the procedure! Apart from this, no additional attention to animal care is needed. If using normal C57bl/6J pups, the surgery should be done under clean, but not necessarily sterile, conditions. However, this might need to be adjusted depending on the strain of mice used.The pups are placed in a small clean paper box that has a thin bottom to allow good contact between the box and the heating plate to be sure that the heat can be conducted to the pups lying at the bottom of the box. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702230812_4279.jpgFigure 4. Ventilated area for surgery (A). Heating plate for keeping pups warm (left, B), nasal mask for anesthesia (center, C) and anesthetic vaporizer (right, D). ProcedureAnesthetize the pup with isoflurane using a nasal mask (5.0% for induction and 1.5% to 3.0% for maintenance). Gently fixate the pup on its back using the micropore surgical tape (Figure 5A). Keep the nasal mask with isoflurane in position. Open the skin with the scissors by making a 0.2 cm–0.3 cm incision in the neck close to the midline (Figure 5B). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702230833_5503.jpgFigure 5. Surgery and artery ligation. A. The fixated pup with nasal mask for anesthesia. B.",
    "The midline is indicated by the solid black line, the incision is indicated by the dashed black line, and the top of the sternum is indicated by the black arrow. C. The artery is indicated by arrow 1 and the vein is indicated by arrow 2. D. The dissected artery is lifted up by hooked forceps. E. The suture under the artery is indicated by arrow 1, and the vein without the suture is indicated by arrow 2. F. The ligated artery. G. The sutured wound. H. The application of Xylocain on the wound.Use fine-tip forceps to carefully push away fat and muscles. Close to the midline there will be a pocket underneath the fat and muscles, and this is where the left common carotid artery will be located. Very close to the common carotid artery will be a vein. Make sure not to confuse the artery and the vein (Figure 5C). The vein is more superficial than the artery, and the artery is more medial (to the left) than the vein.Compared to the vein, the artery is more reddish and will have an obvious pulse.  Use the fine-tip forceps to carefully dissect the artery free from the vein, the vagal nerve, and other surrounding soft tissues. When the artery has been dissected, use a curved fine-tip forceps or hooked forceps to isolate and lift up the artery (Figure 5D). With the other hand, take up the prepared 1 cm-1.5 cm long 7-0 suture using the straight or curved forceps. Grab one end of the suture with the curved or hooked forceps holding up the artery and gently pull the suture under the artery (Figure 5E). Ligate the artery by making two knots with the suture (Figure 5F). Close the wound with the 6-0 suture. Make two knots (Figure 5G).",
    "Infiltrate the wound with local anesthetic by adding one drop of Xylocain onto the wound using the 1 ml syringe (Figure 5H). Put the pup back on the heating plate and allow the pup to recover from anesthesia. Pups have recovered when they have woken up and started to move again. When all pups have gone through surgery, take all pups back to their dam to rest for 1 h.  HypoxiaPreparation/NotesThe temperature in the chamber should be kept strictly at 36 °C. It is important that this temperature does not change because the pups are not able to maintain their body temperature. A 1-2 °C drop in temperature (hypothermia) can result in reduced brain injury, and increased temperature can result in increased brain injury.  To keep the chamber temperature strictly at 36 °C, the air and 10% oxygen must be warmed and humidified before flowing through the chamber.  The airflow and the 10% oxygen flow through the chamber are both 4 L/min.  Under normal situation in our lab, the hypoxia-ischemia treatment causes less than 10% mortality. The experimenter needs to pay attention to increases in mortality that might be indicating problems with the equipment or the procedure.  ProcedureStart the flow of warmed and humidified air through the chamber 5 min prior to putting the pups in the chamber. After the pups have recovered from surgery for 1 h with their dam, put the pups in the chamber and maintain the airflow through the chamber for 10 min. After 10 min of airflow, change the flow from air to 10% oxygen (by mixing air and nitrogen) for 70 min. Check the temperature regularly during the 10% oxygen incubation to make sure that the temperature is stable at 36 °C.",
    "After 70 min in 10% oxygen, change the flow from 10% oxygen to air for 10 min. After 10 min in air, take the pups from the chamber and return them to their dam."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}