{
  "id": 10047,
  "origin_website": "Jove",
  "title": "Setup of Consumer Wearable Devices for Exposure and Health Monitoring in Population Studies",
  "procedures": [
    "Administrative and ethics approvals were obtained from the Cyprus Ministry of Health (YY5.34.01.7.6E) and the Cyprus National Bioethics Committee (ΕΕΒΚ/ΕΠ/2016.01.23). Patients with atrial fibrillation and the guardians of the asthmatic children provided written informed consent prior to participation in the study.\n1. Application lockers and device automation applications\nNOTE: Freely available application lockers and device automation applications (taskers) can be found for both Android devices and IOS devices. The specific applications used in the present study are listed in the Table of Materials.\nUse a smartphone device preferably equipped with the same Android version as the smartwatch.\n\t\nFrom the Play Store, download and install the data collection application, the application locker, and the tasker.\nDownload a freely available application that can extract the Android application package (APK) of the downloaded applications already installed on the smartphone.\n\t\t​NOTE: The application creates a folder named Extracted-Apks in the internal storage of the smartphone and stores the exported APK files. Save the APK files instead of downloading the application locker and the tasker during the setup of every smartwatch device to ensure that the same versions of the applications are used across all the devices.\n2. Development of the automated procedures using the tasker",
    "NOTE: A tasker allows for the step-by-step development of automated processes. These can vary according to the requirements of the project. Previous coding or programming experience is not required. In the following steps, the following terms and definitions are used: trigger (a starting state that, when met, allows the tasker to initiate the process), condition (a condition that, when met, allows the process to continue to the next step), and action (the process outcome). In the provided figures, the parallelogram denotes a trigger, the diamond denotes a condition, and the rectangle denotes an action. Each process may result in more than one action, and these are labeled as actions a, b, c, (...) under each process. A separate process was set up for each individual problem identified during the field implementation of the project. This approach ensured there was no overlap between the conditions set and allowed the smooth operation of the automated process as a whole.\nLaunch the device automation application, and navigate to the interface to build tasks.\n\tNOTE: The interface differs between different device automation applications. The steps described below are based on the tasker used in the study presented here12, but similar steps apply across all applications of this kind. Device automation applications allow for the development of different processes (also called macros). All the macros described in this protocol are provided in Supplementary File 1.\n\t\nTo create a process, select Macros.\nCreate a process that systematically activates the data collection application (Figure 1). Do so by following the steps below.\n\t\nAdd a macro or task by clicking the plus sign. Add a trigger to create a start point for the process. Click on the plus sign on the trigger tab.",
    "Select Date and Time, and select the Regular Interval tab. Do not use a reference time, but set a regular interval.\nSet a fixed time interval to act as a trigger to initiate a procedure. Set the interval at 7.5 min, and click on OK.\n\t\tNOTE: This condition creates a regular trigger that is executed every 7.5 min. The selection of the trigger interval is based on the battery capacity of the device and other conditions that affect the smooth operation of the data collection application.\nTo add an action, click on the plus sign on the action tab. Select the Conditions/loops tab. Select the IF clause.\nAdd a condition by clicking on the plus sign. Select the Date and Time tab. Select Stopwatch. Click on Ok.\nSet a fixed duration to be added as a condition. As part of the procedure, the condition being tested is whether a stopwatch value is either >29 min or <1 s.\n\t\tNOTE: The former reflects the preference to systematically activate the data collection application every 30 min, and the latter represents the preference to activate the data collection application even in cases when the stopwatch is not working or has stopped.\nChange the AND by clicking on the triangle. Select OR.\n\t\tNOTE: Whenever one of the conditions is met, the process can continue.\nTo add an action between the IF statement, click on the End if. Select Add action above.\nNavigate to find the Screen tab. Select the action Screen On, and click on Ok.\n\t\tNOTE: When the conditions are met, the tasker will enable the screen.\nFollowing similar steps, add a second action that reduces the brightness of the screen to the lowest percentage.",
    "Add an additional action that resets and restarts the stopwatch that is used in this automated process. This creates a loop.\nFollow similar steps, and add an action that enables the data collection application. Select Applications.\nSelect Launch Application. Find and select the data collection application. Select Force NEW, and click on OK.\n\t\tNOTE: The process is complete. The trigger, the conditions, and the actions are set. This process systematically enables the data collection application in frequent time intervals to counteract any random application crashing. The action Screen On is designed to prevent the hibernation settings of commercial devices, and the action Brightness to 0% is used to reduce the battery consumption. The action Stopwatch (reset and restart) creates a loop to our overall process. If the condition is met, the following actions are performed by the tasker: (a) launching the data collection application, (b) activating the smartwatch screen, (c) reducing the screen brightness to 0%, and (d) resetting and restarting the stopwatch to create a loop. Action b and action c are designed to counteract the default hibernation settings of commercial devices. Hibernation settings may interfere with the normal operation of smartwatch applications (including the data collection application). Hibernation is resolved by systematically activating the screen (action b), and to reduce the battery consumption, the screen activation is coupled with reducing the screen brightness (action c).\nGive a name to this process, and select Save.\nCreate a process that systematically enables the Wi-Fi of the smartwatch (Figure 2).\n\t\nAdd a trigger to create a start point for the process. Click on the plus sign on the Trigger tab. Select Device Events, and select Screen On/Off. Select Screen On, and click on Ok.",
    "Add an action by clicking on the plus sign on the Action tab. Select the Conditions/loops tab. Select the IF clause. Add a condition by clicking on the plus sign. Select the Connectivity tab. Select Wi-Fi State. Select Wi-Fi disabled, and click on Ok.\nClick on the End if. Select Add action above. Select the Connectivity tab. Click on the Wi-Fi Configure tab. Select Enable Wi-Fi, and click on Ok. This is action a of the process in step 2.3.\n\t\tNOTE: Upon screen activation and if the Wi-Fi is disabled, the tasker will enable the Wi-Fi.\nAdd an additional action between the IF statement that resets and restarts Stopwatch_2. This is action b of the process in step 2.3.\n\t\tNOTE: The stopwatch is important for disabling the Wi-Fi after a few minutes, which is an action carried out by a different process in the protocol (step 2.5). The smartwatch does not need to be constantly connected to the Wi-Fi as this increases the battery consumption.\nGive a name to this process, and select Save.\nCreate a process that systematically optimizes the battery consumption (Figure 3).\n\tNOTE: Smartwatch devices usually have default settings to disable the screen after a period of a few seconds. For the device used in our study, this period was 15 s. The testing is presented in step 2.7.\n\t\nUse the default screen deactivation as a trigger.\nSet a condition that tests the combination of whether the smartwatch is not charging and is not connected to a network. If both apply, the process disables the Wi-Fi connectivity to reduce the battery consumption. This is action a of the process in step 2.4.",
    "NOTE: If the smartwatch is charging, the Wi-Fi must be kept enabled, allowing any data collected during the day to be sent via the Wi-Fi connection to our online server. Usually, charging takes place overnight.\nSet a condition that tests whether Bluetooth is enabled. If it is, the Bluetooth is disabled to reduce the battery consumption. This is action b of the process in step 2.4.\nSet an additional action that is automatically activated following the trigger. This action sets the screen brightness to 50% (action c of the process in step 2.4).\n\t\tNOTE: User interactions may change the brightness levels. Higher levels of screen brightness drain the battery faster, and as a comprise, the screen brightness is set to 50% as the optimal level that allows the user to easily interact with the smartwatch while also conserving the battery.\nCreate a process that systematically logs event information (Figure 4).\n\t\nAdd a trigger to create a start point for the process. Click on the plus sign on the Trigger tab. Select Date and Time. Select the Regular Interval tab. Do not use a reference time.\nSet the regular interval. Set a fixed time interval to act as a trigger to initiate the procedure. Set the interval at 5 min, and click on Ok.\n\t\tNOTE: This creates an infinite trigger that is executed every 5 min; the selection of the interval is based on the battery capacity of the device and other conditions dependent on the requirements of the researcher.\nTo add an action, click on the plus sign on the Action tab. Select Logging. Click on Log Event.\nClick the Ellipsis Points tab. Find and select Wi-Fi SSID (Wi-Fi network name), and select Ok.",
    "By clicking again on the Ellipsis Points tab, and following the exact same steps, further add the Wi-Fi signal strength, device serial number, GPS latitude, GPS longitude, accuracy of the GPS signal, as well as whether the smartwatch is charging or not (action a of the process in step 2.5).\n\t\tNOTE: This action creates a log event with pre-specified variables relevant to the project.\nGive a name to this process, and select Save.\nClick on the Logging tab, and set a condition that tests the combination of whether the smartwatch is not charging, the screen is turned off, and the stopwatch described in point\n\t\t2.3.3 is >4 min and disables the Wi-Fi when all these conditions are met (action b of the process in step 2.5).\nCreate a process that provides user notifications if the GPS signal is disabled (Figure 5)\n\t\nSet the connection to a Wi-Fi network as the trigger.\nSet an action that is automatically activated following the trigger. This action creates a log event point similar to that in step 2.5.2 (action a of the process in step 2.6).\n\t\tNOTE: This additional log event provides the information regarding the exact time the smartwatch was connected to the home Wi-Fi network.\nSet a condition that tests whether the GPS sensor has been disabled, or its accuracy status has been changed, or airplane mode has been enabled. Add an action between the IF statement that displays the notification error \"ERROR!!! Please check settings\" (action b of the process in step 2.6).\nTest each process created.\n\t\nClick on the Process tab.\nClick on the Trigger tab.\nSelect Test trigger.\n\t\tNOTE: Test trigger initiates the actions of the process selected. If the result is the intended one, the process is saved.\n3. Exporting the created processes (steps 2.1-2.6)",
    "Export and save the files of the created processes (steps 2.1-2.6) in mdr format (mdr file) in the same smartphone directory as in step 1.1.3.\n4. Transferring and installing the files created to the smartwatch\nTransfer the files from the smartphone to a laptop/PC.\n\t\nConnect the smartphone to the laptop/PC.\nFind the directory with the extracted APK and mdr files (tasker extension files) created with the device automation application.\nCopy and paste all the files into a directory in the laptop/PC.\nTransfer the files from the laptop/PC to the smartwatch device.\n\tNOTE: In the study, the smartwatch was also equipped with a magnetic charger cable that also allowed the transfer of data/files.\n\t\nConnect the smartwatch with the magnetic charger to the laptop/PC.\nSelect the option to transfer files on the smartwatch notification panel.\nOn the laptop/PC, navigate to the directory with the saved files from step 4.1.2.\nCopy all the files, and paste them into a directory in the smartwatch.\n5. Setting up the smartwatch for field use\nInstall the applications as well as the processes on the smartphone to the smartwatch.\n\t\nNavigate to the destination with the pasted files, and install all the APK files. These include the application locker, the tasker, and the data collection application (see Table of Materials).\nInstall the mdr file that contains the processes created in step 2.\nAccept all the permissions that are needed to operate the processes.\n\t\tNOTE: The permissions may vary depending on the nature of the created processes.\nSet or change the important default settings of the device.\n\tNOTE: Before the smartwatch is given to a participant, several important settings must be modified.\n\t\nSwipe the smartwatch screen to left, and navigate to the smartwatch settings function. Click on Settings.",
    "Select Sound, and disable all sounds by minimizing the volume levels of all the individual sound settings. Swipe the screen to the right to return to the main settings screen.\n\t\tNOTE: Distractions and unnecessary notifications by the smartwatch are not advised because this will create unnecessary hassle for the participants, especially during school and work hours.\nScroll down, and select the Connect function. Scroll down, and select GPS. Click on Mode, and set the GPS settings to High accuracy.\nSwipe the screen to the right to return to the main settings screen.\nScroll down, select the Power saving function, deactivate the Standby intelligence power setting, and check that the battery saver is always turned off. Swipe the screen to the right to return to the main settings screen.\n\t\tNOTE: Although the battery consumption must be taken into account, keeping the standard power saving mode activated may interfere with the smooth operation of the applications and negatively affect the data quality and completeness.\nScroll down, and select the Date and time function. Disable the Automatic time zone tab. Scroll down, click on Select time zone, select the correct time zone, and enable the 24-hour format.\nScroll up, enable the Automatic time zone, and check that the Automatic date and time mode is set to Use network-provided time.\n\t\tNOTE: This is important to ensure that each sensor measurement is accompanied by the correct timestamp.\nSwipe the screen to the right to return to the main settings screen. Scroll down, select More, open the option Background Cleaner, and disable the Battery saver.",
    "NOTE: All the settings that interfere with the smooth operation of applications in the background must be disabled. In this case, such a setting is the background cleaner, and if it remains enabled, these applications will not be able to work in the background, thus affecting the general setup of the smartwatch and interfering with the data collection approach.\nSwipe the screen to the right to return to the More settings screen, scroll down, select the App freeze function, click on Next, scroll down, click on Google Play Store, and select Freeze; the application will be automatically disabled.\n\t\tNOTE: If left activated, the Play Store is likely to perform updates. Such updates may interfere with the processes created. In addition, some updates may take place on different days for the different study participants, and, thus, for a duration of time, the data will not be collected in the same manner from all the participants.\nSwipe the screen to the right to return to the More settings screen, select the Notifications function, select Google, and block all notifications from this application.\n\t\tNOTE: Depending on the device and operating system, other applications may also show notifications.Distractions and unnecessary notifications by the smartwatch are not advised because this will create unnecessary hassle for the participants, especially during school and work hours.\nSwipe the screen to the right to return to the More settings screen, scroll down, select the Data Saver function, and disable the data saver. Swipe the screen to the right to return to the More settings screen.\n\t\tNOTE: Disable any setting or functionality that may affect data uploading or receiving.\nSelect the App Settings function, scroll down, select the Special access function, and click on Battery optimization settings. Click on the Triangle, and select All apps.",
    "Scroll down to find the application locker, select the application locker, select Don't optimize, and click on Done. Find all the relevant applications that are used in the smartwatch setup (application locker, tasker, data collection application), and select Don't optimize.\n\t\tNOTE: The main applications that perform or support data collection must operate without any battery restrictions.\nAfter finishing the setup, perform a check of the settings that were implemented in this step.\n\t\tNOTE: The responsiveness of the touch screen may be lacking, and important modifications to the settings may not have been done correctly, so run a check to make sure that every step was done correctly. Check again that all the sounds and vibrations are minimized, the GPS is in high accuracy mode, and the date and time settings are correct. Furthermore, make sure to disable any settings that interfere with the smooth operation of the applications in the background. Additionally, make sure that any other application that can perform updates is frozen.Disable any settings or functionalities that may affect data uploading or receiving. Make sure that the main applications that perform or support the data collection can operate without any battery restrictions.\nSet up the application locker.\n\t\nFrom the home screen, navigate to find the installed applications.\nSelect App Locker.\nSelect how you want the App Locker to lock the applications (possibilities include the use of a PIN code or pattern code).\nSelect the applications you want to lock. Among others, the camera, voice recording, browser, and gaming applications can be locked. Activate the App Locker.\nConnect the smartwatch to the participant's home Wi-Fi network.\n\t\tNOTE: The setup is complete. The smartwatch is ready to be given to a participant.\nAllow the participant to use the smartwatch.",
    "Instruct the participants to wear the smartwatch daily and charge the device every night during their sleep.\n\t\tNOTE: During the day, the participants were able to use the smartwatch as a normal digital watch and assess their activity levels through the smartwatch pedometer indicator. The participants were not required to carry out any specific tasks for the smartwatch to be able to collect and transmit the data. The configuration of the devices as described in the protocol in combination with the automated processes developed with the tasker minimized the hassle for the participants.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}