{
  "id": 18509,
  "origin_website": "Jove",
  "title": "Interactions with and Membrane Permeabilization of Brain Mitochondria by Amyloid Fibrils",
  "procedures": [
    "All animal experiments were performed in accordance with the Institutional Animal Care and Use Committee (IACUC) of Medical Sciences of Tehran University. Maximal efforts were made to minimize suffering and detrimental effects to the rats by sharpening the guillotine blades and applying resolute and swift movements of the blade.\n1. Brain homogenization and mitochondrial isolation\nNOTE: All reagents for mitochondrial isolation were prepared according to Sims and Anderson14.\nPreparation of buffers for mitochondrial isolation\n\t\nPrepare a 100 mM Tris-HCl solution: weigh 0.605 g of Tris-HCl and dissolve it in approximately 40 mL of deionized water (DW) in a beaker. Transfer the solution to a 50 mL volumetric flask and increase the final volume to 50 mL by adding DW.\nPrepare a 10 mM EDTA solution: weigh 0.202 g of EDTA and dissolve it in approximately 40 mL of DW in a beaker. Transfer the solution to a 50 mL volumetric flask and increase the final volume to 50 mL by adding DW.\n\t\tNOTE: Both solutions can be stored at 4 °C for at least 4 weeks.\nPrepare a Tris-HCl/EDTA/sucrose stock solution: add 30 mL of 100 mM Tris-HCl and 30 mL of 10 mM EDTA in a beaker. Weigh 32.86 g of sucrose and add it to the beaker while stirring with a magnetic stirrer. When the sucrose is dissolved, transfer the solution to a 100 mL volumetric flask and increase the final volume to 100 mL by adding DW.\n\t\tNOTE: This solution can be store at 4 °C for up to 3 days.\nPrepare an isolation buffer (IB): add 100 mL of Tris-HCl/EDTA/sucrose stock to approximately 150 mL of DW. Adjust the pH to 7.4 by adding 0.1 M HCl. Increase the final volume to 300 mL by adding DW.",
    "Prepare 15% (v/v) density gradient medium with IB by adding 1.5 mL of density gradient medium to 8.5 mL of cold IB.\nPrepare 10 mg/mL bovine serum albumin (BSA) solution: weigh 20 mg of fatty acid-free BSA and dissolve it in approximately 1.5 mL DW in a 2 mL vial. Increase the final volume to 2 mL by adding DW and store it on ice until use.\n\t\tNOTE: Freshly prepare the solutions from steps 1.1.4–1.1.6 on the day of mitochondrial isolation and store them on ice until use.\nIsolation of rat brain\n\tNOTE: Decapitation and brain removal of male rats (150–200 g) were performed according to Sims and Anderson14.\n\t\nPut a 30 mL beaker in an ice bucket and add 10 mL of cold IB to the beaker.\nDecapitate the rat with a small animal guillotine and remove the brain from the skull within 1 min of decapitation to limit deterioration of mitochondrial properties.\nRapidly transfer the brain to the beaker containing cold IB.\nBrain homogenization and preparation of mitochondria\n\tNOTE: Mitochondrial fractions were isolated according to the protocol described by Sims and Anderson14, with some modifications as described previously15. It is important to work quickly and keep everything on ice throughout the procedure.\n\t\nWash the tissue 2x with 30 mL of IB, transfer to a beaker containing cold IB, and finely mince the brain with scissors.\nAdd 10 volumes of pre-cooled IB (about 10 mL of IB per rat brain).\nTransfer the tissue suspension to a 20 mL cold Dounce homogenizer.\nHomogenize the tissue pieces using nine up-and-down strokes with a motorized pestle.\n\t\tNOTE: Leave the mixture on ice for approximately 30 s after each set of three homogenization strokes to ensure that the homogenate remains cold.",
    "Transfer the homogenate to a pre-chilled 10 mL centrifuge tube and centrifuge at 1,300x g and 4 °C for 3 min.\nCarefully decant the supernatant and transfer it to a pre-chilled 10 mL centrifuge tube and centrifuge at 21,000x g at 4 °C for 10 min.\nDiscard the supernatant and resuspend the pellet in a cold 15% density gradient medium solution (5 mL for each brain) by gently stirring the mixture with a pipette.\nCentrifuge in a fixed-angle rotor at 30,700x g at 4 °C for 5 min using slow acceleration (45 s from 0 rpm to 500 rpm followed by normal acceleration) and deceleration (no brakes). This should produce two distinct bands of material (Figure 1A, left).\nUsing a Pasteur pipette, remove the sharp band of material accumulated at the top of the gradient, which mostly contains myelin. Then, remove the density gradient medium solution overlying the material (in band 2) as much as possible without losing any of the enriched mitochondrial fraction in band 2.\n\t\tNOTE: The band 2 contains both the synaptic and non-synaptic mitochondria.\nAdd 8 mL of IB to the mitochondrial fraction while gently stirring the mixture with a pipette.\nCentrifuge at 16,700x g at 4 °C for 10 min and carefully remove the supernatant, leaving the bottom loose pellet undisturbed.\nAdd 1 mL of 10 mg/mL fatty acid-free BSA to the centrifuge tube while gently stirring the mixture with the tip of a pipette. Increase the final volume to 5 mL per brain by adding IB.\nCentrifuge at 6,900x g at 4 °C for 10 min, which should produce a firm pellet (Figure 1A, right).\nDecant the supernatant and gently resuspend the mitochondrial pellet in IB, aliquot them into 0.5 mL tubes, and store in liquid nitrogen until use.\n2. Protein concentration determination",
    "NOTE: Protein concentration is measured using the method of Lowry et al.16.\nPreparation of solutions for Lowry assay\n\t\nPrepare solution A: weigh 0.4 g of NaOH and 2 g of Na2CO3 and dissolve in 80 mL of DW, then transfer the solution to a 100 mL volumetric flask and increase the volume to 100 mL by adding DW.\nPrepare solution B: weigh 0.1 g of potassium sodium tartrate and 0.05 g of CuSO4 and dissolve in 8 mL of DW, then transfer the solution to a 10 mL volumetric flask and increase the volume to 10 mL by adding DW.\n\t\tNOTE: Both solutions A and B can remain stable at 4 °C for up to 6 months.\nPrepare solution C: Add 0.5 mL of folin solution to 7.5 mL of DW.\n\t\tNOTE: Prepare solution C fresh and keep away from light until use.\nPrepare BSA standards with final concentrations of 0, 20, 40, 60, 80, 100, and 120 µg/mL by combining 0, 20, 40, 60, 80, 100, and 120 µL of 1 mg/mL BSA, respectively, with enough DW to make 1000 µL of solution.\nProtein concentration measurement\n\tNOTE: For greater accuracy, run this step in triplicate.\n\t\nAdd 50 µL of standard solutions and mitochondrial homogenate to each well of a 96 well plate, followed by the addition of 45 µL of solution A. Then, incubate the plate for 10 min in a warm water bath set at 50 °C.\nAdd 5 µL of solution B and incubate the plate for 10 min in dark at room temperature (RT).\nAdd 150 µL of solution C and incubate the plate for 10 min in a warm water bath set at 50 °C.",
    "Load the plate into a plate reader and record the absorbance values for standards and mitochondrial suspension at 650 nm. Then, using a calibration curve, calculate the protein content of the mitochondria.\n3. Mitochondrial membrane integrity determination\nNOTE: Mitochondrial membrane integrity is confirmed by measuring malate dehydrogenase (MDH) activity in isolated mitochondria before and after membrane disruption by Triton X-100.\nDilute mitochondrial homogenate to 1 mg/mL with cold IB and placed in two 1.5 mL tubes (typically 195 μL of mitochondria per tube).\nAdd 5 µL of 20% (v/v) Triton X-100 (diluted with DW) to one tube (as a positive control for maximum enzyme activity) and 5 µL of DW to another tube (for control) followed by mixing with a stirrer.\nIncubate the tubes for 10 min in a warm water bath set at 30 °C.\nPellet mitochondria by centrifugation of tubes in a fixed-angle rotor at 16,000 x g and 4 °C for 15 min.\nCarefully collect the resulting supernatants for assaying the activity of mitochondrial MDH using a standard spectrophotometric assay described in the following section.\nCalculate the integrity of mitochondrial membrane as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59883/59883equ01v4.jpg\n4. MDH activity determination\nNOTE: MDH activity was measured spectrophotometrically as described by Sottocasa et al.17.\nPreparation of solutions for MDH activity assay\n\t\nPrepare a 50 mM Tris-HCl solution (pH = 7.5): prepare a 7.9 mg/mL solution in DW using Tris-HCl, and adjust the pH to 7.5 at 25 °C with 1.0 M NaOH.\nPrepare a 50 mM oxaloacetate solution: prepare a 6.6 mg/mL solution using oxaloacetate in Tris-HCl.\n\t\tNOTE: This solution is not stable once in solution and should be prepared immediately prior to use.\nPrepare a 10 mM β-NADH solution: prepare a 7.81 mg/mL solution using β-NADH in Tris-HCl.\nMDH activity determination",
    "NOTE: Final assay concentrations in a 1.0 mL reaction mixture are 50 mM Tris-HCl, 5 mM oxaloacetate, and 0.1 mM β-NADH.\n\t\nSet the spectrophotometer to 25 °C and 340 nm. Pipette 890 µL Tris-HCl buffer, 100 µL of oxaloacetate solution, and 10 µL of NADH solution to a blank cuvette and 880 µL Tris-HCl buffer, 100 µL of oxaloacetate solution, and 10 µL of NADH solution into a sample cuvette.\nIncubate cuvettes in the spectrophotometer for 3–4 min and reference against blank.\nThen add 10 µL of mitochondrial homogenate (1 mg/mL) to the sample cuvette, immediately mix by inversion, and record decreases in absorbance due to NADH oxidation at 340 nm for 1 min.\n5. In vitro α-synuclein, bovine insulin, and HEWL fibril formation\nProtein preparation\n\t\nα-synuclein:\n\t\tNOTE: Expression and purification of recombinant α-synuclein is performed as described by Hoyer et al.18 with some modifications, and the purity of α-synuclein is confirmed by SDS-PAGE.\n\t\t\nDialyze purified α-synuclein overnight against phosphate-buffered saline (PBS).\nDetermine the protein concentration using an extinction coefficient of 5600 M-1 cm-1 at 275 nm19.\nAliquots protein in 1.5 mL tubes and store at -80 °C until use.\nBovine insulin and HEWL:\n\t\t\nProvide both bovine insulin and HEWL.\nDissolve each protein in 50 mM glycine buffer (pH = 1.6; adjust the pH with HCl).\nDetermine bovine insulin and HEWL concentration using an extinction coefficient of 1.0 and 2.63 for 1.0 mg/mL at 276 nm and 280 nm, respectively20,21.\nAmyloid fibrillation induction\n\t\nPreparation of solutions for amyloid fibrillation:\n\t\t\nPrepare thioflavin T (ThT) buffer: weigh 0.3 g of NaH2PO4 and dissolve it in 80 mL of DW, adjust the pH to 6.5, and increase the volume to 100 mL by adding DW.",
    "Prepare ThT stock solution (5 mM): weigh 1.6 mg of ThT and dissolve it in 1 mL of ThT buffer, pass through a 0.22 μm filter paper, and keep away from light at 4 °C until use.\n\t\t\tNOTE: This solution can be store at 4 °C for up to 4 weeks.\nPrepare ThT solution (1 mM): add 200 µL of ThT stock solution (5 mM) to 800 µL of ThT buffer.\n\t\t\tNOTE: This solution can be stored at 4 °C for up to 1 week.\nIn vitro α-synuclein amyloid fibril formation:\n\t\t\nAdd aliquots (294 µL) of protein solution (200 μM) and 6 µL of ThT solution (1 mM) to 1.5 mL tubes followed by stirring.\nIncubate the tubes in a thermomixer at 37 °C under constant stirring at 800 rpm for 4 days.\nTake aliquots (10 µL) of incubated samples after regular time intervals and add 490 µL of ThT buffer, mixed thoroughly, and incubate for 5 min at RT.\nSet excitation and emission slit widths as 5 nm and 10 nm, respectively, and measure ThT fluorescence by excitation at 440 nm and emission at 485 nm using a fluorescence spectrophotometer.\nIn vitro bovine insulin amyloid fibril formation:\n\t\t\nAdd 637 µL of protein solution (250 µM) to 1.5 mL tube. Then, add 13 µL of ThT solution (1 mM) followed by stirring.\nAdd aliquots (200 µL) of protein solution (250 µM) containing 20 µM ThT to each well of a clear-bottomed 96 well plate and seal the plate with crystal clear sealing tape.\nLoad the plate into a fluorescence plate reader and incubate at 57 °C without agitation.\nMeasure ThT fluorescence at 30 min intervals, with excitation at 440 nm and emission at 485 nm, for 12 h.\n\t\t\tNOTE: Shake the plate for 5 s before each measurement.",
    "In vitro HEWL amyloid fibril formation:\n\t\t\nAdd aliquots (200 µL) of protein solution )1 mM) containing 20 µM ThT to each well of a clear-bottomed 96 well plate and seal the plate with crystal clear sealing tape.\nLoad the plate into a fluorescence plate reader and incubate at 57 °C without agitation.\nMeasure ThT fluorescence at 2 h intervals, with excitation at 440 nm and emission at 485 nm, for 4 days.\n\t\t\tNOTE: For all three proteins, amyloid fibril formation is confirmed by atomic force microscopy (Figure 2B).\n6. Treatment of mitochondria with amyloid fibrils, MDH release assay, and ROS measurement\nIncubation of isolated mitochondria with amyloid fibrils\n\t\nTurn on centrifuge and warm water bath and set to 4 °C and 30 °C, respectively.\nUsing IF, dilute mitochondrial homogenate to a final concentration of 1 mg/mL.\nPrepare two series of 1.5 mL tubes containing mitochondrial homogenates (one series for MDH release assay and another for mitochondrial ROS measurement).\nAdd aliquots of fresh or amyloid fibrils of α-synuclein, bovine insulin, or HEWL (at final concentrations of 5 µM, 10 µM, 20 µM, and 25 µM; use PBS or glycine buffer as a control) to mitochondrial homogenate (final volume = 200 µL) (see Table 1, Table 2, and Table 3) followed by gently stirring the solution with a pipette.\n\t\tNOTE: For the MDH release assay, use Triton X-100 (at a final concentration of 0.5% [v/v]) as a positive control for maximum enzyme release.\nIncubate tubes containing mitochondrial suspensions for 30 min in warm water bath set to 30 °C.\nMeasure mitochondrial MDH release and ROS content as outlined in sections 6.2 and 6.3.\nMitochondrial MDH release assay",
    "Centrifuge the incubated mitochondrial homogenates at 16,000 x g for 15 min, then carefully collect the resulting supernatants for assaying the activity of mitochondrial MDH as described in section 4.\nCalculate the release of MDH as a fraction of the maximum effect (Triton X-100) as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59883/59883equ02v4.jpg\nMitochondrial ROS measurement\n\tNOTE: Mitochondrial ROS content is determined with the oxidation sensitive fluorogenic precursor dihydrodichlorocarboxyfluorescein diacetate (DCFDA)22.\n\t\nPrepare solutions for mitochondrial ROS measurement. Prepare a 50 µM DCFDA solution by dissolving in methanol (prepare fresh) and a 200 mM succinate solution by dissolving in DW.\nPipette 191 µL of incubated mitochondrial homogenate to each well of a 96 well plate and add 4 µL of 50 µM DCFDA (1 µM final concentration) and 5 µL of 200 mM succinate (5 mM final concentration).\nIncubate the plate for 30 min in a warm water bath set at 30 °C while gently stirring.\nLoad the plate into a fluorescence plate reader and measure fluorescence intensity, with excitation at 485 nm and emission at 530 nm.\n7. Statistical analysis\nPerform all experiments at least 2x or 3x with triplicate assays and conduct appropriate statistical tests. Here, the results are presented as mean ± SD, and a Student's paired t-test was utilized to calculate statistical significance. P-values less than 0.01 and 0.05 were considered statistically significant (*p < 0.05; **p < 0.01).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}