{
  "id": 8666,
  "origin_website": "Jove",
  "title": "Bilateral Assessment of the Corticospinal Pathways of the Ankle Muscles Using Navigated Transcranial Magnetic Stimulation",
  "procedures": [
    "All experimental procedures presented in this protocol have been approved by the local Institutional Review Board and are in accordance with the Declaration of Helsinki.\n1. Consent Process and Safety Questionnaires\nPrior to any experiment, explain to each subject the aim(s) of the study, the main experimental procedures, and any potential risk factors associated with participating in the study. After answering any questions or concerns that subjects may have, ask subjects to acknowledge the consent process and sign the informed consent form.\nAdminister MRI34 and TMS35 safety-screening questionnaires to ensure subjects’ safety and qualification for both MRI and TMS testing. Exclude all subjects who don’t meet all safety criteria from both MRI and TMS assessments.\n2. MRI and Preparation of the Neuronavigation System\nAdminister the MRI assessment prior to TMS assessment32. Have subjects lie in a supine position with a cushion placed under their knees to ensure a comfortable posture. Instruct subjects to keep still in the scanner.\n\t\nProvide ear protection to the subjects to attenuate the loud noise of the scanner. Preferentially use ear plugs over ear muffs due to the use of bilateral supratragic notch for subject-image registration in the neuronavigation system (see 5.2).\nObtain high-resolution T-1 weighted anatomical brain images (minimum requirements: 1 mm slice thickness and full brain and cerebellar coverage), either as NFTI or DICOM files. Ensure that nose is fully included in the images due to the use of subject’s tip of the nose for subject-image registration in the neuronavigation system (see 5.2).\nUpload MRI files into a neuronavigation system. Co-register manually each subject’s MRI to anterior and posterior commissures, so the subject’s MRI can be mapped using the Montreal Neurological Institute atlas.",
    "Reconstruct the skin and full curvilinear brain model by adjusting the bounding box around the skull and brain tissue, respectively. Identify four anatomical landmarks (tip of the nose, nasion - bridge of the nose, and supratragic notch of the right and left ear) using the skin model (see Figure 1A).\nPlace a rectangular grid over leg motor cortical area at each hemisphere using the reconstructed curvilinear brain (see Figure 1B). Position the centered row of the grid at the center and over the gyrus of the leg motor cortical area where the corticospinal tracts that innervate leg motor pools originate36. Position the medial column of the grid parallel and adjacent to the medial wall of the ipsilateral hemisphere.\nUse a cortex-based approach in which error in orientation has a negligible effect on the stimulation site37 instead of using a scalp-based target approach in which any error in orientation can alter the stimulation site. Use this grid to find the hot spot. For motor mapping, use larger grids either by adding more spots and/or increasing the distance between spots (e.g., 10 mm).\n3. Subject Preparation and Placement\nMeasure the electrophysiological responses by single pulse TMS using a total of 4 surface EMG electrodes. For the preparation and placement of the electrodes, use published guidelines38,39 and complete placement while the subject is in a standing position.\n\t\nPrepare the area over which each electrode would be placed by shaving and lightly exfoliating any dead skin cells and oils using alcohol swabs.\n\t\tCAUTION: For subjects on blood thinners (e.g., people post-stroke), use caution during skin preparation due to the potential risk of bleeding.",
    "Attach electrodes bilaterally on TA. While in the standing position, ask subjects to lift their toes upwards and then place the electrode at the upper third of the line between the head of the fibula and medial malleolus (i.e., muscle belly immediately lateral to the tibial crest).\nAttach electrodes bilaterally on SOL. While in the standing position, ask the subject to perform heel raise and then place the electrode at the lower third of the line between the lateral femoral condyle and lateral malleolus.\nAttach the ground reference passive electrode either on the patella or lateral malleolus. Depending on the EMG acquisition unit, place the ground electrodes either bilaterally or unilaterally.\nTest the electrodes’ placement and quality of the signal.\n\t\nTest the electrodes’ placement (e.g., for clear visually detectable EMG bursts) by asking the subject to either dorsiflex or plantarflex the ankle in an upright posture while displaying the raw EMG signal of all muscles tested on a computer screen. In the case of a misplaced electrode, remove and replace it until there is clear visually detectable EMG bursts with minimal background noise. An adequate signal to noise ratio is critical in detecting a motor response (> 50 µV).",
    "Test the quality of the signal (e.g., for baseline noise) by discharging the TMS units for a few times while the TMS coil is held away from the seated subject and with the muscles at rest. Check that the baseline signal for each EMG channel is close to zero (i.e., the peak-to-peak amplitude should be less than 50 µV and there is no baseline noise, such as 50 or 60 Hz power line hum). If baseline noise is present in a channel, remove the corresponding electrode and repeat the skin preparation procedures. If the noise is still present (i.e., peak-to-peak amplitude > 50 µV), adjust the reference electrode’s position and replace the electrolyte gel .\nSecure all electrodes using light foam pre-wrap tape. Periodically throughout the experiment, check to ensure that electrodes are securely attached and that the signal has good quality.\nSeat the subject in a chair. To ensure consistent feet placement across subjects, secure both feet in walking boots (i.e., ankle foot orthosis) that allow the ankle ROM to be adjusted to a specific position and provide resistance during TVA testing. Adjust both hip and knee angles to avoid subject discomfort. Instruct the subject to keep still throughout the experiment. Use a forehead rest attached to the chair to keep subjects still during TMS application, if available.\n4. TVA Testing\nDetermine bilaterally the maximum voluntary isometric contraction (MVIC) of each muscle. For each motion (i.e., dorsiflexion and plantarflexion), instruct subjects to maximally contract the contralateral examined muscle (e.g., right TA) 4 times (~5 s contractions separated by 60 s of rest) while subject is seated in the posture described above.",
    "Calculate the maximum muscle activity value during each MVIC (i.e., the average within a 100 ms window centered around the maximum rectified and smoothed EMG) of the last three trials, the average of the three values, and the 15 ± 5% of each muscle’s average MVIC.\n\tCAUTION: A larger % MVIC can be used, but it may not be feasible in clinical cohorts (e.g., people post-stroke).\n5. Registration in Neuronavigation System\nPlace the subject tracker, either a headband or glasses, with reflective markers on the subject’s head at the opposite side from the stimulated hemisphere so the tracker does not obstruct positioning of the coil during the stimulation of each grid spot.\n\tCAUTION: In the case that a headband is used, ensure that it is snug on subject’s head, yet not overly tight because it may cause a headache after an extended period of time.\nVerify the proper position of the motion capture camera by placing the subject tracker, the pointer, and the coil tracker in its capture volume space. Perform the subject-image registration by placing the tip of the pointer on the 4 anatomical landmaks (see Figure 1A).\nOnce all anatomical landmarks are sampled, verify whether registration occurred accurately by placing the tip of the pointer on several spots over the subject’s skull (i.e., validation stage). If the distance from the tip of the pointer to the reconstructed skin is less than 3 mm, proceed to TMS experiment; otherwise, repeat the subject-image registration until the desired error values are obtained. During the experiment, repeat registration if the subject tracker is accidentaly moved.\n6. TMS\nUse the same methodological parameters during rest and TVA.",
    "Apply single pulse stimuli on the optimal site (i.e., hot spot; see next paragraph for further details) of the examined muscle. Apply each stimulus randomly every 5-10 s to avoid stimulus anticipation and to minimize the carry-over effects of the previous pulse to the subsequent one40.\nIn case that two TMS units are simultaneously used, set the units at either the standard or simultaneous mode41. The standard mode applies a weaker pulse than a single unit, whereas the simultaneous mode applies a stronger pulse than a single unit. The use of either one could be based on the needs of the protocol and the total number of stimuli.\nUse a double cone coil to induce a posteroanterior intracranial current. If necessary, use the neuronavigation system to control the coil manually and correct its position in relation to the desired stimulated spot prior to each stimulus.\nAcross sessions and subjects, randomize the order of the examined muscle and hemisphere. Always administer the TVA condition after the rest condition to avoid any interference with testing at rest (e.g., fatigue of the descending pathways due to TVA testing).\nDetermine bilaterally the hot spot of both muscles.\n\t\nFind the suprathreshold intensity, which will be used during hot spot hunting, by applying a single stimulus over the centered spot next to the interhemispheric fissure (see blue and red squares in Figure 1B). Use this spot because it is located at the locus of the leg motor area36,42.\nStart at low intensity (e.g., 30% maximum stimulator output; MSO) and gradually increase the TMS intensity by 5% increments, until reaching the intensity that elicits a motor evoked potential (MEP) with a peak-to-peak amplitude greater than 50 µV in all contralateral examined muscles for 3 consecutive stimuli.",
    "Determine immediately after each stimulus whether a MEP has been elicited based on both the raw waveforms and peak-to-peak amplitudes (search window: 20-60 ms post-TMS onset) of all examined muscles.\nApply one TMS pulse on each spot of the grid (total 36 stimuli). After the completion of the hot spot protocol, transfer the amplitude and latency values of each spot for all contralateral muscles in a spreadsheet and sort amplitude from high to low and latency from low to high. Identify the hot spot of contralateral TA and SOL as the location in the grid with the largest amplitude and the shortest latency43.\n\t\tCAUTION: If the largest amplitude and shortest latency are not at the same spot, define the hot spot using the largest amplitude.\nDetermine bilaterally each muscle’s resting motor threshold (RMT).\n\t\nSelect the grid spot in the neuronavigation system that corresponds to the examined muscle’s hot spot.\nUse an adaptive threshold-hunting method for RMT determination of the examined muscles44. Set the initial intensity and step size at 45 and 6% MSO, respectively32. Run the RMT hunting twice for each muscle and use the average for the subsequent CMR assessment.\nAssess bilaterally TA and SOL CMR during rest.\n\t\nSelect the grid spot in the neuronavigation system that corresponds to the examined muscle’s hot spot. Apply 10 single TMS pulses at 1.2 RMT of the examined muscle.\nPrior to each stimulus, instruct the subject to stay still and relax the examined muscles bilaterally and monitor the activity of all muscles using a real time visual feedback displaying on a computer screen. In case any muscle is active before or after TMS, discard that trial and apply an additional single pulse. Repeat until 10 waveforms for each contralateral examined muscle at rest have been collected.",
    "Assess bilaterally the TA and SOL CMR during TVA.\n\t\nSelect the grid spot in the neuronavigation system that corresponds to the examined muscle’s hot spot.\nAsk subjects to contract the examined muscle at 15 ± 5% MVIC and apply 10 single TMS pulses at 1.2 RMT. Instruct subjects to keep the smoothed moving line (root mean square amplitude of 0.165 s) of the examined muscle, either TA or SOL, within the two horizontal cursors (MVIC range: 15 ± 5%) and sustain that contraction at that level for few seconds.\nWhen TA is the examined muscle, ask subjects to pull slightly up against the bootstraps on their contralateral leg (i.e., the leg with the examined muscle contralateral to stimulated hemisphere). When SOL is the examined muscle, ask subjects to push slightly down against the boot on the contralateral leg.\nMonitor the muscle activity of the active examined muscle and the remaining resting muscles using a real time visual feedback display on a computer screen. Discard that stimulus and apply an additional single pulse again in case the examined muscle’s activity is either below or above the predetermined range or any other muscle is activated. Collect 10 trials while the examined muscle is activated at the predetermined range.\n7. Data Analysis\nFor all CMR measures except RMT, calculate the value of each measure from each MEP sweep (the total duration should be at least 500 ms with minimum 100 ms pre-stimulus duration) for all muscles and then average these 10 values to get a single value (i.e., mean)32. Amplitude and cortical silent period (CSP) are proxy excitability measures of CMR, whereas latency is a proxy connectivity measure of CMR. For both rest and TVA, normalize latency relative to each subject’s height, as latency is influenced by distance to the examined muscle45.",
    "Calculate MEP amplitude and latency during rest.\n\t\nCalculate amplitude (µV) from the raw EMG as the largest difference between positive and negative peaks (i.e., peak-to-peak) of the MEP. For these two particular muscles, search for peak-to-peak within a time window of 20-60 ms after TMS onset.\n\t\tCAUTION: Though the MEP search window of 20-60 ms may work for neurologically intact subjects and people post-stroke, wider MEP search windows (e.g., 20-75 ms) might be required for other neurological populations (e.g., multiple sclerosis).\nCalculate latency (ms) from the rectified EMG as the time between TMS onset and MEP onset (i.e., the time when a rectified EMG trace first crosses a predetermined threshold - mean plus three standard deviations of the 100 ms pre-stimulus EMG)32,46.\nCalculate MEP amplitude, latency, and CSP during TVA.\n\t\nCalculate amplitude (µV) from the raw EMG as the largest difference between positive and negative peaks (i.e., peak-to-peak) of the MEP. For these two particular muscles, search for peak-to-peak within a time window of 20-60 ms after TMS onset.\nCalculate latency (ms) from the rectified EMG as the time between TMS onset and MEP onset.\n\t\t\nCalculate the MEP onset differently in TVA than in rest. Calculate MEP onset and offset by finding the two time points that the rectified EMG trace crosses the predetermined threshold set to the level of 100 ms pre-stimulus mean EMG. Then, find the peaks that are at least greater than the mean of the pre-stimulus EMG plus three standard deviations and between those two time points. Then, search from the first peak to 50 data points (sampling rate of 5000 Hz) before that peak for the time that the rectified EMG trace first crosses the threshold of the mean pre-stimulus EMG. Define that time as the MEP onset32.",
    "Calculate CSP (ms) from the rectified EMG as the time between the MEP offset and EMG resumption (i.e., absolute CSP: exclusion of MEP duration)47. Search from the last peak to 200 data points (sampling rate of 5000 Hz) after that peak for the time that the rectified EMG trace last crossed the threshold of the mean pre-stimulus EMG; define that time as the MEP offset. Then, calculate the resumption of baseline EMG, which is the time that the rectified EMG trace last crosses 25% of the mean pre-stimulus EMG32.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}