{
  "id": 11784,
  "origin_website": "Jove",
  "title": "Multiplexed Barcoding Image Analysis for Immunoprofiling and Spatial Mapping Characterization in the Single-Cell Analysis of Paraffin Tissue Samples",
  "procedures": [
    "This retrospective study was approved by the Institutional Review Board of the University of Texas MD Anderson Cancer Center. The FFPE tissue samples were collected from patients at MD Anderson as part of routine standard care. No diagnostic or therapeutic interventions were performed. Informed consent was obtained from the patients for using the samples collected for research and publication.\n1. Antibody sources used for the antibody panel design\nCreate an antibody panel for multiplexed imaging after carefully considering the quality of the tissues and proteins of interest. Three sources of antibodies are considered for the antibody panel design: 1) fully commercially validated antibodies, 2) multiplexed imaging technology-screened antibodies, and 3) end user-shared antibodies.\n\tNOTE: Multiplexed imaging technology-screened antibodies have been shown to work and are available from vendors. These screened antibodies can be applied to multiplexed image staining after oligonucleotide conjugation by the user.\nIf a protein of interest cannot be found in the sources mentioned above, employ the antibody clones that are known to work with IHC. In addition, IgG isotypes rather than IgM clones are recommended for this multiplexed imaging technology owing to the higher failure rate with IgM than with IgG clones.\n2. Before antibody conjugation\nWhen identifying antibody clones for conjugation using multiplexed imaging barcodes, consider purchasing carrier-free antibodies in phosphate-buffered saline (PBS) or a similar buffer. Carrier proteins, including BSA, gluten, glycerol, and other protein additives, are known to reduce the conjugation capacity.\nSelect the most suitable antibody clone, and always optimize the staining conditions (i.e., antigen retrieval and titration) before conjugation. Do this by applying an unconjugated antibody clone to positive and negative tissue for this antibody using standard IF or IHC.",
    "​NOTE: If a purified antibody is not commercially available, an antibody purification process must be performed before conjugation. The purification procedure used with antibody purification kits is not discussed herein.\n3. Antibody conjugation\nObtain the antibody conjugation reagents. Commercially available conjugation kits contain a filter-blocking solution, reduction solution 2, conjugation solution, purification solution, antibody storage solution (all stored at 4 °C), and reduction solution 1 (stored at −20 °C).\nConjugation\n\tNOTE: A purified antibody is treated with a reducing agent, allowing the reduced moieties of the antibody to react with the multiplexed imaging barcode used with this technology and, thus, form a covalent bond. This process takes about 4.5 h and results in roughly 120 μL of conjugated antibody, which is viable for 1 year. All the spin-down is conducted at room temperature (RT), and the flow-through is discarded except in the very last step (3.2.9), in which a collection tube contains the conjugated antibody.\n\t\nAspirate and apply 500 μL of the filter-blocking solution using a pipette to the 50 kDa molecular weight cutoff filter columns, and spin down at 12,000 x g for 2 min to block nonspecific antibody binding.\n\t\tNOTE: If residual solution at the top of the column is noticeable, invert the filter in the collection tube, and spin down at 3,000 x g for 2 min.\nPipette 50 μg of the antibody in a 100 μL volume of solution to the filter column, and spin down at 12,000 x g for 8 min.",
    "NOTE: Use a spectrophotometer to measure the concentration of the purified antibody and to calculate the volume of solution corresponding to 50 μg of the antibody. If the volume of the antibody solution is less than 100 μL, adjust the volume to 100 μL by adding 1x PBS. Retain 1 μg of unconjugated antibody for conjugation confirmation (step 4.4).\nPipette 260 μL of reduction master mix (20 μL of reduction solution 1 mixed with 825 μL of reduction solution 2, which is sufficient for three antibody conjugation reactions) to each filter column. Gently vortex the master mix for 2-3 s, or pipette up and down to mix the solution with the antibody. Incubate at RT for 30 min.\nAfter incubation, spin down the filter columns at 12,000 x g for 8 min. Add 450 μL of conjugation solution to the filter columns, and spin down at 12,000 x g for 8 min.\nResuspend the desired barcode in 10 μL of nuclease-free water and 210 μL of conjugation solution.\n\t\tNOTE: Prepare an antibody tag immediately prior to use for the staining. Do not reuse antibody barcode aliquots.\nAfter the completion of the spin-down in step 3.2.4, add the resuspended antibody tag (approximately 220 μL) into each corresponding filter column. Pipette the mixture up and down gently to mix the reagents. Close the filter column lids, and incubate the conjugation reaction at RT for 2 h. After 2 h, spin down the filter columns at 12,000 x g for 8 min.\n\t\tNOTE: Setting aside 5 μL of the conjugated solution in a polymerase chain reaction tube and storing it at 4 °C are recommended for the confirmation protocol (see below).",
    "Pipette 450 μL of the purification solution into each filter column, and spin down at 12,000 x g for 8 min. Repeat three times.\nPipette 100 μL of the storage solution into the filter columns. Gently pipette the mixture up and down more than 10 times, and carefully wash the sides of the filters in the column.\n\t\tNOTE: Dissolve 50 µg of antibody in 100 μL of the storage solution. If the conjugation reaction is started with more than 50 μg of antibody, add more storage solution at this ratio.\nInvert the filter columns in a fresh collection tube. Spin down at 3,000 x g for 2 min at RT. Keep the collected solution. Pipette the conjugated antibody solution into sterile screw-top tubes, and store for up to 1 year at 4 °C.\n\t\tNOTE: A conjugated antibody should be tested with the multiplexed imaging technology after 2 days. Testing prior to this may result in high background nuclear staining.\n4. Conjugation confirmation\nNOTE: Before performing staining experiments with a user-conjugated antibody using the multiplexed imaging technology, the conjugation should be confirmed by using gel electrophoresis with 5 μL of the conjugated antibody (see step 3.2.6) along with 1 μg of an unconjugated antibody (usually in 2 μL of the mixture) as a control. A successful antibody conjugation will be demonstrated by an increase in the molecular weight of the antibody. However, this confirmation protocol only assesses the success of the chemical reaction for conjugation and does not address the antibody validation used for multiplexed imaging.\nPipette 8 μL and 11 μL of nuclease-free water into the reserved conjugated antibody and control unconjugated antibody, respectively, to obtain a final volume of 13 μL.",
    "Pipette 5 μL of LDS (or other sodium dodecyl sulfate-polyacrylamide gel electrophoresis system) sample buffer and 2 μL of sample-reducing agent into each sample of the reserved conjugated antibody, and denature the samples in a 95 °C dry bath for 10 min.\nWhile the samples are denaturing, dilute 40 mL of MOPS SDS running buffer in 760 mL of ultrapure water, place a gel in the tank of an electrophoresis system, and pour the diluted running buffer over the gel.\nOnce the 10 min denaturization period is complete, load one well of the gel with a pre-stained protein standard, one with the unconjugated antibody (from step 3.2.2), and the remaining wells with the conjugated antibody samples. Next, run the gel at 150 V until the protein standard appears at the end of the gel.\n\tNOTE: The gel easily adheres to microwave-safe containers and, thus, may tear, so the gel must be handled with caution in the following steps.\nAfter the run is complete, transfer the gel to a microwave-safe container prefilled with ultrapure water, and heat it in a microwave until the first bubble in the water is visualized.\n\tNOTE: The time for bubbles to form varies greatly depending on the microwave used.\nDrain the water from the container, pour about 250 mL of Coomassie G-250 stain over the gel, and heat the gel in a microwave until the first bubble is visualized. Afterward, remove the container with the gel and the Coomassie G-250 stain from the microwave, and place it on a shaker for 10 min.\nAfter shaking, carefully drain the stain, replace it with about 200 mL of ultrapure water, and then place the container on the shaker to wash the gel.",
    "Drain the ultrapure water, and replace it with new ultrapure water five times or until the remnants of the stain are not apparent in the water bath. Leave the gel to wash overnight on the shaker until bands are visible, if needed, before photographing the gel (Figure 1).\n\tNOTE: The antibodies used in multiplexed imaging should have staining patterns comparable with those of dye-conjugated antibodies. Tissue sections with known antigens positive for conjugated antibodies can be stained with oligonucleotide-conjugated and dye-conjugated antibodies. In this work, in each case, the tissue morphologies for both antibody types were equivalent and harmonized with each other, as well as the anticipated cell distribution, based on the biology of the proteins of interest and the test tissue samples. This result demonstrates the effectiveness of using oligonucleotide-conjugated antibody moieties for tissue staining-based approaches using FFPE tissue.\n5. Oligonucleotide-conjugated antibody staining\nPrepare coverslips for tissue placement.\n\t\nSoak the coverslips in a 0.1% poly-L-lysine solution for 24 h at RT to improve the tissue adherence.\nAfter soaking, drain the poly-L-lysine solution, and wash the coverslips with ultrapure water for 30 s. Repeat the washing four to six times. Remove the coverslips from the ultrapure water used for washing, and place them on a lint-free towel to dry overnight.",
    "NOTE: A histologist must cut the selected tissue into sections that are 5 μm thick, place them on the center of a poly-L-lysine-charged coverslip, and allow them to dry overnight. After drying, the coverslips with the tissue sections must be stored at 4 °C for no longer than 6 months. The staining panel in this protocol contained 26 markers. The tissue used in this protocol was normal human tonsil tissue. The coverslip soak time should not exceed 1 week. Poly-L-lysine-coated coverslips may be stored at RT and must be used within 2 months of preparation.\nThe day before staining, place the coverslip holder in a 60 °C oven overnight.\nThe following day, place the coverslip sample in a preheated coverslip holder in a 60 °C oven. After baking for 30 min, check to ensure that the paraffin has melted away from the tissue.\nQuickly place the coverslip holder/sample in the following solution series: two rounds of dewaxing agent for 6 min each; two rounds of 100% ethanol for 5 min each; one round of 90% ethanol for 5 min; one round of 70% ethanol for 5 min; one round of 50% ethanol for 5 min; one round of 30% ethanol for 5 min; and two rounds of diethyl pyrocarbonate (DEPC)-treated ultrapure water for 5 min each.\n\tNOTE: All the dilutions of ethanol are prepared with DEPC-treated ultrapure water. If xylene is used for dewaxing, it should be used in a hood.\nWhile subjecting the coverslip holder/sample to the solution series, do the following:\n\t\nPrepare a humidity chamber by placing an empty pipette tip box with a water-soaked paper towel at the bottom.\nFill a pressure cooker with enough water to halfway cover a 50 mL beaker.\nPlace 5 mL of methanol per sample in the beaker at 4 °C.",
    "Dilute AR9 buffer with DEPC-treated ultrapure water to 1x; about 50 mL of the diluted buffer is needed per coverslip holder.\nAfter the solution series is complete, fill a 50 mL glass beaker with about 40 mL of 1x AR9 buffer, submerge the coverslip holder/sample in the beaker, and completely cover the beaker/coverslip holder with aluminum foil.\n\t\nPlace the aluminum foil-covered beaker/coverslip holder in the water-filled pressure cooker, and cook at high pressure (about 15 psi) for 20 min.\nAfter cooking, remove the beaker/coverslip holder, carefully unwrap the aluminum foil, and allow the beaker/coverslip holder to cool at RT for about 10 min.\nRemove the coverslip holder/sample from the 1x AR9 buffer, and submerge it in two rounds of DEPC-treated ultrapure water, performing an incubation of the samples in both rounds for 2 min each.\nDuring the incubation, retrieve the hydration buffer, the blocking N, blocking G, blocking J, and blocking S solutions, and the antibody diluent/block from the multiplexed imaging staining kit. For two coverslip samples, label 6-well plates for the solutions using the configurations shown in Figure 2.\nPlace the coverslip sample in two rounds of 5 mL of the hydration buffer for 2 min each.\nAfter both rounds of placement in the hydration buffer, place the coverslip sample in 5 mL of the multiplexed imaging antibody diluent/block, and incubate for 20-30 min at RT (do not exceed 30 min).\nDuring the incubation, prepare an antibody cocktail by making a 200 μL master mix of multiplexed imaging antibody diluent/block, N blocker, G blocker, J blocker, and S blocker solutions.",
    "NOTE: Calculate the total antibody amount based on the number of markers and each marker's validated titration, and subtract the total antibody amount from the master mix. For example, for six markers, each with a 1:200 titration, the equation would be 200 μL of master mix − 6 μL of antibody cocktail = 194 μL of master mix.\nAfter incubation in the multiplexed imaging antibody diluent/block, place the coverslip sample in the humidity chamber prepared in step 5.5.1, pipette 190 μL of the antibody cocktail onto the coverslip sample, and incubate the coverslip sample at RT for 3 h.\n\t\nAfter incubation, wash the coverslip sample in two rounds with 5 mL of the multiplexed imaging antibody diluent/block for 2 min each.\nTo fix the bound antibodies to the tissue on the coverslip, perform steps 5.7.3-5.7.5 in the humidity chamber.\nIncubate the coverslips for 10 min with 16% formaldehyde diluted to 1.6% with storage solution, and then wash the coverslips three times with 1x PBS.\nIncubate the coverslips for 5 min with 4 °C methanol, and then wash the coverslips three times with 1x PBS.\nIncubate the coverslips for 20 min with 5 mL of the fixative reagent diluted with 1x PBS, and then wash the coverslips three times with 1x PBS.\nStore the stained coverslip samples in the storage buffer at 4 °C for up to 2 weeks\n6. Multiplexed imaging reporter plate\nNOTE: A 96-well plate, referred to as a reporter plate, containing barcoded fluorophores in individual wells is prepared according to custom-designed multiplexed imaging experiments and correlates with each stained coverslip sample. The following steps are for the preparation of the reporter plate.",
    "Prepare a reporter master mix by combining 4,880 μL of nuclease-free water, 600 μL of 10x multiplexed imaging buffer, 500 μL of an assay reagent, and 20 μL of nuclear stain solution. This will be enough for 20 cycles of all the wells.\nIn every cycle of the custom-designed multiplexed imaging experiment, fill a well with 245 μL of a solution containing the reporter master mix and the specific barcoded fluorophores for that cycle.\n\tNOTE: See Figure 3 for the reporter plate configuration used in this protocol for a carcinoma panel.\nTo protect the barcoded fluorophores, adhere a foil plate cover over the reporter plate, and place the plate within the multiplexed imaging instrument.\nStore the reporter plate in a dark box at 4 °C for up to 2 weeks.\n7. Calibrating and running the multiplexed imaging machine\nNOTE: The high-resolution imaging fluorescence microscope captures four different fluorescence channels in each multiplexed imaging cycle at 20x, 100% excitation light, and with low photobleaching.\nCalibrate the focus of the imaging using the DAPI channel by placing a sample coverslip on the microscope stage, manually pipetting 700 μL of a 1:1,500 titration of nuclear stain solution onto the tissue.\n\tNOTE: The coverslip is retained on the microscope stage during the sample washing and imaging.\nTo prepare the multiplexed imaging instrument, dilute 10x multiplexed imaging buffer to 1x using DEPC-treated ultrapure water, and fill reagent bottles with appropriate solutions/solvents, including the diluted 1x multiplexed imaging buffer, DEPC-treated ultrapure water, and dimethyl sulfoxide (DMSO).",
    "Once the reagent bottles are filled appropriately, enter the experimental design into the multiplexed imaging instrument manager software; designate the correct cycle, well numbers, z-stack places, marker name, class, and exposure time for each cycle (Figure 4); set all the microscope parameters; and select the regions of interest on the sample coverslip to be imaged.\n\t\nClick on the Experiment button in the control software (Figure 4A). In the Experiment Setup and Management window, click on the New Template button (Figure 4B).\nType the project name into the space next to the Project button (Figure 4C). Type or select the total number of cycles (Figure 4D).\nClick on the Channel Assignment button, type the information for each cycle into the columns (Figure 4E), and click on the Save Template button. Start the experiment by clicking on the Start Experiment button.\n\t\t​NOTE: During a multiplexed imaging experiment, the instrument retrieves the barcoded fluorophores from one well of the reporter plate (maximum of four fluorophores per well, including DAPI), dispenses them directly onto the sample coverslip, and images the regions of interest for each fluorescence channel. Following all the imaging for that cycle, the instrument washes the barcoded fluorophores off and dispenses the next cycle of reporters (from the next well on the reporter plate). Imaging continues until all the cycles using 26 markers have been completed.\n8. Image collection\nNOTE: Multiplexed images can be collected using any adapted inverted fluorescence microscope configured with four fluorescence channels (DAPI, Cy3, Cy5, and Cy7) and equipped with a Plan Fluor 20x lens. Imaging and washing of the coverslip samples are iteratively performed automatically using a specially developed fluidics setup. The images are acquired using Processor software (v1.8.0.7) in QPTIFF format.\nIn the processor window, click on the Input button, and select the experiment name.",
    "In the Processing Options section, select and check Background Subtraction, Deconvolution, Extended Depth of Field, and Shading Correction. Click on the Start button.\n9. Image analysis\nNOTE: The acquired images can be uploaded to a patented automated image analysis software or open-source software program (Figure 5) for downstream analysis.\nClick the QuPath icon on the computer, and open the software. Drag the QPTIFF file to the Viewer window.\nClick on the Brightness & Contrast button, which will open the Brightness & Contrast window. Check or uncheck the marker in the Selected column to show or close the marker signal.\nClick on the Zoom to fit button to zoom in or out of the area of interest.\n\tNOTE: Multiplexed image data visualization provides the user with a deep look into the tissue microenvironment. Individual markers in FFPE samples can be visualized in fluorescence format (Figure 6 and Figure 7) or in pathology view. Several computational platforms can be used to process the composite images and analyze the multiplexed tissue image data. Using this software, spatial phenotyping, as well as rare cell discovery and cell neighborhood computation, can be accomplished with whole-slide images of ultra-high multiplexed tissue generated via the multiplexed imaging technology. See Figure 6 for the 26 antibodies in the carcinoma panel and tonsil sample (Supplementary Figure 1)."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}