{
  "id": 20005,
  "origin_website": "Wiley",
  "title": "Identifying Cell-Type-Specific Metabolic Signatures Using Transcriptome and Proteome Analyses",
  "procedures": [
    "Cell populations at the bottoms of intestinal crypts serve as an ideal model for studying the inherent metabolic features of cells. They share the same nutritional environment while displaying distinct metabolic features (Baulies, Angelis, & Li, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0002]; Urbauer, Rath, & Haller, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0033]; Wang, Odle, & Liu, 2021b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0035]). Three major cell types enriched in the intestinal crypts are self-renewing ISCs, transient amplifying (TA) progenitor cells, and terminally differentiated niche Paneth cells. To enhance the efficiency of purification, crypt isolation is a critical step prior to flow-cytometry-based cell sorting. Using a GFP reporter for Lgr5 (leucine-rich-repeat-containing G-protein-coupled receptor 5, also known as Gpr49), a marker gene exclusively expressed in cycling columnar ISCs (Barker et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0001]), the stem cells and progenitor cells can be distinguished based on GFP intensity. In combination with surface proteins such as c-kit and CD24 that mark secretory Paneth cells, one can purify the three basic crypt cell populations with one FACS panel: Lgr5-GFPhigh ISCs, Lgr5-GFPlow progenitors, and c-kit+CD24+ Paneth cells (Cheng, Yilmaz, & Mihaylova, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0009]).\nMaterials\nMouse (adult, older than 8 weeks)\n70% ethanol in spray bottle\n500 ml phosphate-buffered saline (PBS; PBS Tablets; Gibco, cat. no. 18912014, to be dissolved in 500 ml deionized water; keep on ice)\n0.5 M disodium EDTA (Promega, cat. no. V4231)\nTweezers\nDissecting scissors\nOral gavage needle on 20-ml syringe\nIce bath\nLarge petri dish (at least 22 mm)\n50-ml conical tubes (e.g., Corning Falcon)\n50 ml conical tubes\nLarge beaker\nNutating mixer/rocker\n70-µm mesh\nAdditional reagents and equipment for euthanasia of mice (see Current Protocols article: Donovan & Brown, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0014])\n1. Euthanize mouse by cervical dislocation (see Current Protocols article: Donovan & Brown, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0014]).\n2. Place on large lab towel and spray abdomen of mouse with 70% ethanol.",
    "3. Beginning at the base of the abdomen, cut open peritoneal cavity and locate stomach, usually beneath the liver.\n4. Clip beginning of small intestine adjacent to stomach and remove it from the mouse by pulling until you reach the caecum and colon, readjusting grip every 3-5 cm. Be sure to remove any fat or blood vessels attached to the intestine.\n5. Place small intestine in petri dish containing ice-cold PBS immediately.\n6. Keep ice-cold PBS in a separate 50-ml tube to draw from, and use an oral gavage needle to flush intestine with cold PBS twice into large beaker. First flush from the proximal end (usually lighter in color), then from the distal end.\n7. Open up the intestine (split lengthwise so that it is flat rather than tubular) using the syringe by inserting the gavage needle into the intestine and gently pulling down the intestine perpendicular to the tip of the needle, using the needle to cut the intestine.\n8. Lay the tissue flat in a petri dish filled with PBS to clean. Gently wipe off excess mucus and lumen contents.\n9. Cut the tissue into 3-5 fragments.\n10. Place the tissue into a conical tube with 50 ml cold PBS.\n11. Add 1 ml of 0.5 M disodium EDTA to tube with 50 ml PBS and intestine (10 mM EDTA final).\n12. Incubate in cold room on nutating mixer/rocker for ∼45 min.\n13. Invert tube 3-5 times and wash by pouring out fluid and refilling the tube with ice-cold PBS to 30 ml.\n14. Shake vigorously in an elliptical motion for 3-5 min until crypts detach from the intestine.\n15. To remove villi from solution, filter the 30 ml of collected crypts through 70-µm mesh into another clean 50-ml tube.",
    "This is your crypt fraction number 1. See Figure 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0002] for unfiltered and Figure 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0002] for filtered samples.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ddfeb9a9-1a83-431f-a34a-09338e6eac7c/cpz1245-fig-0002-m.jpg</p>\nFigure 2\nIntestinal crypt isolation for enriching crypt-base cell populations. (A) After EDTA chelation, crypts attached to villi are harvested from mouse small intestine. (B) Crypts are detached by mechanical disruption and enriched by filtration. Dashed line marks a villus. Arrows indicates to crypts. Scale bar: 50 µm.\n16. Add another 30 ml PBS to the tube containing the intestine.\n17. Repeat steps 13 and 15. Collect up to 6 fractions (∼150 ml).\n18. Spin down the collected crypts 5 min at 300 × g, 4°C.\n19. Remove the PBS and re-suspend the pellet (crypts) with reagents for downstream applications.",
    "A fundamental question of stem cell biology is what intrinsic features bestow stem cells with unique properties. Transcriptome analysis, which offers the capability to simultaneously discover new transcripts and to quantify gene expression, has been a significant step toward answering this question. Accompanied by advances in technologies that enable the quantification of gene expression in rare cell populations, new computational analyses have been developed to further grant access to the more holistically described cell states and identities (Morris, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0022]). In this protocol, we will explain how we re-define crypt cell identity with cell-type-specific metabolic gene expression patterns using population RNA-seq and single-cell RNA-seq data generated from murine intestinal crypt cells.\nMaterials\nIntestinal crypt pellets (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0001], step 19)\nTrypLE (Life Technologies 12604021)\nS-MEM (Life Technologies 11380-037)\n0.4% BSA: 200 mg of BSA (Sigma-Aldrich A4161) in 50 ml of PBS\n15-ml centrifuge tubes (e.g., Corning Falcon)\nLow-binding 1.5-ml microcentrifuge tubes\nCentrifuge with temperature control (Eppendorf Microcentrifuge 5430 R)\nFACSAria3 flow sorter: 4-laser, 11-color sorter running BDFACS Diva software on XP\nChromium Single Cell Platform (10X Genomics; Cheng et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0008])\nQlucore Omics Explorer Version 3.7(21)\nR 3.4.0\nDESeq2\nSeurat v3 (Macosko et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0020])\ndittoSeq package\nAdditional reagents and equipment for antibody staining and FACS analysis (Cheng et al. 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0009])\nPrepare for fluorescence-activated cell sorting (FACS) for RNA sequencing\n1. To prepare samples for cell sorting by flow cytometry, resuspend intestinal crypt pellets isolated from step 19 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0001] in 500 μl TrypLE per sample, and transfer to individual 15-ml Falcon centrifuge tubes.\n2. Dissociate crypts by incubating with TrypLE for 1 min at 32°C.\n3. To stop the dissociation, add 10 ml ice-cold S-MEM and invert the tube twice to wash the cell pellets.\n4. Centrifuge 5 min at 300 × g, 4°C.",
    "5. Remove supernatant and process by antibody staining and FACS analysis as previously described (Cheng et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0009]).\n6. Sort cells by FACS.\n         \nUsing the FACSAria3 cell sorter for bulk RNA-seq, sort 25,000 live cells (7AAD−) per population (i.e., Epcam+/CD24-/GFPhigh Lgr5+ ISCs, Epcam+/CD24-/GFPlow progenitor cells, and Epcam+/GFP-/CD24+/c-Kit+/SSChigh Paneth cells) into the assigned collection tubes (low-binding tubes containing 400 μl TRIzol™ Reagent).\nFollowing the completion of each sort, vortex and place the collected sample on ice until 200,000 cells have been sorted for each cell population.\nPerform RNA purification and bulk RNA sequencing as previously described (Cheng et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0009]).\nFor single-cell RNA-seq, sort 50,000 live (7AAD-) epithelial cells (Epcam+) into a 1.5-ml microcentrifuge tube containing 50 μl of 0.4% BSA-PBS and store on ice.\nProceed to the Chromium Single Cell Platform (Cheng et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0008]).\nBriefly, an input of 7,000 cells is added to each channel of a chip with a recovery rate of 1,500-2,500 cells. The cells are then partitioned into Gel Beads in Emulsion (GEMs) in the Chromium instrument, where cell lysis and barcoded reverse transcription of RNA occur, followed by amplification, tagmentation, and 5′ adaptor attachment.\nIdentify cell-type-specific metabolic gene clusters using bulk RNA-seq data\n7. Extract data of 2948 genes encoding mammalian metabolic enzymes using Qlucore Omics Explorer (Birsoy et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0004]; Corcoran, Grady, Pisitkun, Parulekar, & Knepper, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0010]).",
    "8. Filter out lowly expressed genes and genes with small profile variance  to reduce noise. In the current example, we choose to retain genes with the variance (σ/σ max) greater than 9e-7. In addition, perform multi-group comparison of the cell types by applying ANOVA using Qlucore Omics Explorer 3.7 or Likelihood Ratio Test (LRT) using R package DESeq2. Set q-value (i.e., p-value adjusted for multiple testing by means of false discovery rate, FDR) as selection factor, for example, as q < 0.005.\n9. Normalize Z-score (mean = 0, var = 1) and visualize gene-expression levels with heatmap. To highlight the differences between genes, make Z-score by samples (force each sample to have zero mean and standard deviation = 1). Center and normalize Z-scores; it also helps to have an intuitive idea of the relative variation.\n10. Reorder genes with hierarchical clustering. Depicting the data matrix in this way puts genes (rows) with similar expression patterns across cell types (columns) close to each other and helps to find co-varying genes. Three major clusters of genes are identified based on the cell-type-specific expression patterns (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0003]). Also see Readme file in the folder containing files generated using Qlucore Omics Explorer 3.7, available at https://gitlab.leibniz-fli.de/ori-lab/metabolic-signatures-in-stem-cells/[href=https://gitlab.leibniz-fli.de/ori-lab/metabolic-signatures-in-stem-cells/].\nQlucore Omics Explorer is visualization-based software program for omics data analysis. The Qlucore Omics Explorer base module supports many data file formats including Aligned BAM files (RNA-seq), raw count, and normalized data using the import Wizard (*.txt, *.tsv, *.csv) and R data frame.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/af3f1563-cfaf-41cd-8a57-0cdd6e94a9fd/cpz1245-fig-0003-m.jpg</p>\nFigure 3",
    "Identifying cell-type-specific metabolic gene expression patterns. (A) Results of hierarchical clustering analysis visualized by a heatmap, showing metabolic gene clusters enriched for each cell type: (I) Lgr5 high stem cells, (II) Lgr5 low progenitors, and (III) Paneth cells. Blue to yellow, low to high expression (Z-Score, −2 to 2). (B) Verifying the cell identify-to-metabolism association using scRNA-seq profiling of 53,193 individual epithelial cells from the mouse small intestine. Examples of genes identified from the clustering analysis including Hmgcs2 and Cps1 from cluster I, Gpx1 and Iptka from cluster II, and Apt2a3 and Apoc2 from cluster III.\nDelineate the cell metabolism−identity patterning using scRNA-seq\n11. Cluster the cells using R package Seurat v3 (Macosko et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0020]).\n12. Run non-linear dimensional reduction and visualize cell cluster by t-distributed stochastic neighborhood embedding Epical cells clustered (t-SNE) or Uniform Manifold Approximation and Projection (UMAP), using RunTSNE() or RunUAMP() functions, respectively.\n13. Annotate cell identity post hocbased on the expression of literature-curated marker genes. Plot Heatmap shows the relative expression level (row-wise Z scores) of genes (rows) in cell-type-specific signatures across the individual intestinal epithelial cells (column) in the full-length scRNA-seq data. This step can be achieved using R, dittoHeatmap command from dittoSeq package, and the annot.by parameter.\n14. Revisit expression of the targeted genes identified in step 10 (e.g., Hmgcs2, Cps1, Gpx1, ATP2a3, and Apoc2) to examine the cell metabolism−to−cell identity patterning and heterogeneity. Examples shown in Figure 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0003] are generated using the single-cell portal (https://singlecell.broadinstitute.org/single_cell[href=https://singlecell.broadinstitute.org/single_cell]).\nThis step can also be achieved using R package, Seurat function: FeaturePlot(), and StackedVlnPlot(). See Illustrative R code at: https://github.com/adamh-broad/single_cell_intestine[href=https://github.com/adamh-broad/single_cell_intestine].",
    "The homeostasis of the proteome, also known as proteostasis, is pivotal for the maintenance of stem cell function, and its perturbation has been shown to contribute to loss of regenerative capacity in different stem cell compartments, for example during aging (Schuler, Gebert, & Ori, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0028]). Mass spectrometry−based proteomics enables the quantification of thousands of proteins in cells and tissues. However, the analysis of purified stem cells has proven challenging due to the limited number of cells that can be obtained from a single animal. Importantly, direct measurement of enzyme levels makes it possible to take into account both transcriptional and post-transcriptional mechanisms (e.g., changes in protein synthesis or degradation) that determine the amount of available proteins in different cell populations (Liu, Beyer, & Aebersold, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0019]). The workflow of sample preparation presented here allows efficient preparation of peptides from a small number of cells (down to ∼50,000) obtained by FACS. This protocol describes the appropriate collection of ISC populations and preparation as well as analysis of peptides for the acquisition of the proteomics dataset by LC-MS/MS. The same protocol can be adapted to any other cell population obtained by FACS, e.g., muscle stem cells (Schuler et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0029]).\nMaterials\nIntestinal crypts from step 17 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0001]\nCrypt digestion buffer (see recipe; prepare 3 ml/sample)\nPhosphate-buffered saline (PBS; PBS Tablets; Gibco, cat. no. 18912014, to be dissolved in 500 ml deionized water; keep on ice)\nY-27632 dihydrochloride monohydrate (Abcam ab120129)\n2× proteomics lysis buffer (see recipe)\n1 M dithiothreitol (DTT; Roth 6908.3)\n200 mM iodoacetamide (Sigma I1149); prepare fresh directly before use and keep in the dark (cannot be stored)\nAcetone (Biosolve 0001037801BS), ice-cold\nHPLC water (Sigma 270733)\nProtein digestion buffer (see recipe)\nLysC stock solution (see recipe)\nTrypsin stock solution (see recipe)\n10% trifluoroacetic acid (Biosolve 0020234131BS)",
    "Acetonitrile (Biosolve 0001204102BS)\nFormic acid (Roth 4724.3)\nHRM kit peptides (Biognosys AG 42896)\n50-ml conical tubes (e.g., Corning Falcon)\n1.5-ml microcentrifuge tubes (Eppendorf 0030120.086)\n37°C water bath\nCentrifuge with temperature control (Eppendorf 5804R)\n70-μm mesh filters\nBioruptor PlusTM (Diagenode)\nThermomixer (Eppendorf 460-0223E and 460-0220)\npH paper (Roth KEE1.1)\nWaters Oasis® HLB μElution Plate, 30 μm (Waters 186001828BA)\nExtraction Plate Manifold for Oasis 96-Well Plates (Waters 186001831)\nVacuum pump (Gast Manufacturing Inc. DOA P504 PN)\nSpeed vacuum centrifuge (Eppendorf Concentrator Plus)\nPCR tubes (Ratiolab 8610040)\nMS vials (VDS Optilab 93909134)\nnanoAcquity UPLC system (Waters)\nTrapping column (nanoAcquity Symmetry C18, 5 μm, 180 μm × 20 mm; Waters)\nAnalytical column (nanoAcquity BEH C18, 1.7 μm, 75 μm × 250 mm; Waters)\nOrbitrap Fusion Lumos Tribrid Mass Spectrometer (ThermoFisher Scientific)\nThe outlet of the column needs to be coupled directly to the Orbitrap Fusion Lumos (ThermoFisher Scientific) using the Proxeon nanospray source.\nSpectronautTM v.14\nR v3.6.3\nR Studio Server v1.2.5042\nIsolating targeted cell populations for proteome analysis\nIn order to avoid contamination of the sample, nitrile gloves should be used throughout all the protocol steps. Sample tubes should be resistant to centrifugation at high speed (20,800 × g) and acetone at indicated steps.\n1. Isolate crypts according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0001], steps 1-17 (collect 3 fractions, combine fraction 2 and 3, discard fraction 1).\n2. For dissociating cells to single-cell suspensions, resuspend crypt pellet (∼400,000 crypts) in 1 ml crypt digestion buffer.\nDNase I is added to the crypt digestion buffer to digest DNA released from lysed or apoptotic cells prior to FACS purification of ISCs.\n3. Add an additional 2 ml crypt digestion buffer.\n4. Incubate in a water bath at 37°C for 10 min.\n5. Vortex 1 min.\n6. Incubate in a water bath at 37°C for 10 min.",
    "7. Fill up to 50 ml with cold PBS containing 80 μM Y-27632 dihydrochloride monohydrate.\nY-27632 dihydrochloride monohydrate is a Rho kinase inhibitor that prevents apoptosis and thereby increases the number of living cells that can be purified.\n8. Centrifuge 5 min at 1000 × g, 4°C.\n9. Remove the buffer and resuspend cells in 1 ml PBS containing 80 µM Y-27632 dihydrochloride monohydrate.\n10. Filter through a 70-μm mesh directly before sorting.\nDissociated crypts tend to stick back together, so filtration has to be done immediately before putting the sample in the sorter; otherwise, the sorter might get blocked. In case sorting takes too long, filter the sample during the process again to dissociate the clotted cells.\n11. Sort two populations of GFP-positive cells (GFPhigh and GFPlow) cells into 1.5-ml tubes containing 50 μl 2× proteomics lysis buffer:\nIMPORTANT NOTE: Make sure that the sample collector of the sorter is not cooling the samples to temperatures below 20°C. Use tubes for sample collection that are stable enough for sonication in steps 14 and 16. Clean glassware for preparation of buffers for proteomics with methanol before use, to remove soap residues.\n12. After sorting, spin down samples at room temperature and, if necessary, adjust the volume of lysis buffer to the volume of sheath fluid collected from the sorter by adding 2× proteomics lysis buffer.\nAs an example, if after sorting the sample collection tube contains 150 μl from a starting volume of 50 μl 2× proteomics lysis buffer, an additional (150 − 50 μl/2 = 50 μl) of 2×proteomics lysis buffer will need to be added to equalize the volumes of concentrated lysis buffer and collected sheath fluid.",
    "IMPORTANT NOTE: Record the number of sorted cells per sample. This is used to estimate the amount of protein to digest for proteomics analysis. An amount of 50-100,000 cells is necessary for continuing with the protocol. Using the described isolation strategy for the cells, 50,000-100,000 ISCs (GFPhigh) or 100,000-200,000 progenitor cells (GFPlow) can be purified.\n13. After sorting, keep the sample on ice until all samples are sorted and frozen, and store at −80°C until protein digestion and mass spectrometry analysis.\nProtein digestion and peptide purification for proteomics\n14. Thaw ISC lysates and solubilize by sonication in a Bioruptor PlusTM for 10 cycles (1 min on and 30 s off), with high intensity, at 20°C.\n15. Heat lysates for 10 min at 95°C in a Thermomixer.\n16. After heating at 95°C, sonicate lysates again as in step 14.\n17. Clarify lysates by centrifugation for 5 min at 20,800 × g, 4°C, in a centrifuge with temperature control.\n18. Transfer the supernatant containing proteins to a new 1.5-ml tube.\nMake sure to use tubes that are resistant to acetone!\n19. Reduce cysteines by adding 1 M DTT to 10 mM and incubating at 37°C in a Thermomixer.\n20. Alkylate cysteine by addition of 200 mM iodoacetamide to a final concentration of 15 mM and incubate for 30 min in the dark.\nIodoacetamide is not stable and needs to be prepared fresh directly before use and kept in the dark.\n21. Precipitate proteins by adding 8× the sample volume of ice-cold acetone and incubate overnight at -20°C.\n22. Pellet the protein by centrifugation for 1 hr at 20,800 × g, 4°C.\n23. Remove the supernatant.\n24. Wash the pellet twice with ice cold 80% acetone (v/v in HPLC water).\n25. Air-dry the pellets in a fume hood.",
    "26. When dried, dissolve the pellet in protein digestion buffer at a concentration of 0.25-0.5 µg/μl:\n27. To facilitate the resuspension of the protein pellet, subject the samples tothree rounds of sonication (1 min on and 30 s off) with high intensity at 20°C using the Bioruptor PlusTM.\nThe amount of protein can be estimated from the number of cells collected by FACS. For the two populations of ISCs, a protein amount of 5-10 µg per 50,000 cells can be considered for further calculations.\n28. Digest proteins for 4 hr at 37°C using 1:100 (enzyme/protein) LysC.\n29. Dilute samples to 1.5 M urea, 50 mM HEPES (see protein digestion buffer recipe) with HPLC water and digest with 1:100 (enzyme/protein) trypsin for 16 hr at 37°C.\nLysC cleaves the proteins at the C-terminus of lysines. The cleavage sites of trypsin are the C-termini of lysines and arginines. The pre-digestion with LysC allows a more efficient digestion of the proteins compared to digestion with trypsin only. The dilution before adding trypsin is necessary because trypsin does not tolerate high levels of urea.\nIMPORTANT NOTE: For all the steps where pipetting of peptide solutions is necessary, use low-binding tips!\n30. Acidify digested peptide solutions with 10% trifluoroacetic acid. Check the pH using 0.5 μl sample and pH paper. If the pH is higher than 2, add more trifluoroacetic acid.\n31. Desalt the peptides with Waters Oasis® HLB μElution Plate 30 μm:\n         \nPlace a waste collection tray in an Extraction Plate Manifold for Oasis 96-Well Plates.\nCondition the columns by applying 3 × 100 μl solvent B (80% acetonitrile/0.05% formic acid in HPLC water) in presence of a low vacuum of 5 mbar created by a vacuum pump.",
    "Equilibrate the columns by applying 2 × 100 μl solvent A (0.05% formic acid) in the presence of a low vacuum.\nAdd 100 μl of solvent A without vacuum.\nAdd each sample to one well containing solvent A without vacuum.\nLoad the sample on the column by applying a low vacuum.\nWash the samples by adding 3 × 100 μl solvent A in presence of a low vacuum.\nAfter the last wash, dry the columns by applying a strong vacuum (up to 10 mbar).\nRemove the waste collection tray and place PCR tubes for collection of samples.\nPipet 50 μl of solvent B and apply low vacuum until all samples are eluted.\nDry eluates in a speed vacuum centrifuge.\n32. Dissolve the dried peptides in 5% acetonitrile/0.1% formic acid to a peptide concentration of 1 μg/μl.\n33. Transfer 10 μl to an MS vial.\n34. Prior to analysis by LC-MS/MS, spike into each sample 0.5 μl of HRM kit peptides reconstituted according to the manufacturer's instruction and then diluted 1:4 using 5% acetonitrile/0.1% formic acid.\nLabel-free LC-MS analysis using Data Independent Acquisition (DIA)\nFor direct LC-MS analysis using DIA, a volume that contains 1-2 µg of peptides needs to be injected. The separation gradient is nonlinear, according to Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0001], at a constant flow of 0.3 μl/min.\nTable 1.\n                Gradient for Separation of Peptides Prior to MS Analysisa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl1-note-0001_43]\ntable:\n﻿Time,%B\n0.0,0\n1.0,5\n4.0,6\n9.0,7\n18.0,9\n77.0,21\n93.0,24\n101.0,26\n106.0,28\n110.0,29\n113.0,31\n115.0,32\n116.0,33\n117.0,34\n119.0,36\n120.0,40\n121.0,50\n124.0,50\n125.0,85\n129.0,85\n130.0,0\n145.0,0\na Non-linear gradient for the nanoLC during an LC-MS run (step 22). The table shows the runtime (in min) and the corresponding percentage of mobile phase B (%B) on the column.",
    "Buffers for nanoLC during LC-MS runs: mobile phase A is 0.1% (v/v) formic acid in water, mobile phase B is 0.1% (v/v) formic acid in acetonitrile.\nDegas buffers for nanoLC prior to use by sonication for 15 min in a water bath.\n35. DIA data acquisition:\n         \nUse the nanoAcquity UPLC system fitted with a trapping (nanoAcquity Symmetry C18, 5 μm, 180 μm × 20 mm) and an analytical column (nanoAcquity BEH C18, 1.7 μm, 75 μm × 250 mm). The outlet of the column needs to be coupled directly to an Orbitrap Fusion Lumos using the Proxeon nanospray source.\nLoad 1-2 μg of reconstituted peptides.\nSeparate peptides using the gradient described in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0001].\nAcquire MS data using the parameters described in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0002].\nTable 2.\n                Settings for DIA Mass Spectrometry Data Acquisition on Orbitrap Fusion Lumos Tribrid Mass Spectrometer (ThermoFisher Scientific)\ntable:\n﻿Entry,Parameter,Setting\nMS OT (scan experiment 1),Detector Type:,Orbitrap\n0-145 min,Resolution,120000\n,Mass range,Normal\n,Use quadrupole isolation,Yes\n,Scan Range (m/z),350-1650\n,RF lens,30%\n,AGC target,5.0e5\n,Maximum injection Time,20 ms\n,Microscans,1\n,Data Type,Profile\n,Polarity,Positive\ntMS2 OT HCD (scan experiment 2),MSn level,2\n0-145 min,Isolation mode,Quadrupole\n,MS Isolation windows (m/z),See Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0003]\n,Activation type,HCD\n,HCD collision energy (%),30\n,Detector Type,Orbitrap\n,Orbitrap resolution,30000\n,Scan range (m/z),200-2000\n,AGC target,1.0e6\n,Maximum Injection Time,70 ms\n,Microscans,1\n,Data type,Profile\n,Inject ions for All Available Parallelizable Time,Yes\n,Loop control,All\nTable 3.\n                The Inclusion List for 34 Variable Window Segments (z = 2 for all) in DIA\ntable:\n﻿m/z,Isolation window (m/z)\n376.5,53\n412.5,21\n431.0,18\n448.0,18\n464.5,17\n480.5,17\n496.5,17\n512.0,16\n527.0,16\n542.5,17\n558.0,16\n573.5,17\n589.5,17\n605.5,17\n621.5,17\n637.5,17\n654.0,18\n671.0,18\n688.0,18\n706.0,20\n725.0,20\n744.0,20\n764.0,22\n785.5,23\n808.5,25\n833.0,26\n859.0,28\n887.5,31\n919.5,35\n956.0,40\n1000.0,50\n1056.5,65\n1138.5,101\n1419.0,462\nProteomics raw data analysis\n36. Generate a library by searching DIA raw data using the “directDIA” option in SpectronautTM v.14 using default settings.",
    "OPTIONAL: Include additional runs based on a Data Dependent Acquisition (DDA) method (typically a pool of samples for each experimental condition, e.g., 3 pools of both GFPhigh and GFPlow ISC samples) for spectral library generation using the same gradient as for DIA (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0001]); the acquisition settings are described in Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0004]. In our experience, inclusion of 4-6 DDA runs generated from the same or comparable samples as used for DIA analysis increases the number of identifications by 10%-20% at both the peptide precursor and protein group level.\nTable 4.\n                Settings for DDA Mass Spectrometry Data Acquisition on Orbitrap Fusion Lumos Tribrid Mass Spectrometer (ThermoFisher Scientific)\ntable:\n﻿Entry (node in method editor),Parameter,Setting\nMS OT,Detector Type:,Orbitrap\n,Resolution,60000\n,Mass range,Normal\n,Use quadrupole isolation,Yes\n,Scan Range (m/z),350-1650\n,RF lens,40%\n,AGC target,2.0e5\n,Maximum injection Time,50 ms\n,Microscans,1\n,Data Type,Profile\n,Polarity,Positive\nMIPS,Monoisotopic peak determination,Peptide\nIntensity,\"Filter type, Intensity threshold\",5.0e4\nCharge state,Include charge state(s),2-7\nDynamic exclusion,Exclude after n times,1\n,Exclusion duration (s),\"Depends on LC runtime: 15 s for 1 hr run, 60 s for 2.5 hr\"\n,Mass Tolerance,ppm\n,Low,10\n,High,10\n,Exclude isotopes,Yes\nddMS2 IT HCD,Isolation mode,Quadrupole\n,Isolation Window (m/z),1.4\n,Activation type,HCD\n,HCD collision energy (%),30\n,Detector type,Orbitrap\n,Resolution,15000\n,First mass (m/z),120\n,AGC target,2.0e5\n,Maximum Injection Time,22 ms\n,Microscans,1\n,Data type,Profile\nData Dependent Properties,Select: “Cycle time”,3 s\n37. Search DIA raw data against the generated spectral library using default settings.\nIn our experiment, the ISC library contained 59,328 precursors, corresponding to 4814 protein groups, using SpectronautTM protein interference. Typical library recovery was 92.1%.\n38. Perform relative quantification in SpectronautTM for each pairwise comparison using the replicate samples from each condition.\n39. Export the data (candidates table) and protein quantity data reports.",
    "SpectronautTM is a commercial software that is routinely used in our laboratory (Bruderer et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0005]). Alternative software for analysis of DIA data are DIA-NN, OpenSWATH, Skyline, PeaksDIA, and DIA-Umpire (Demichev, Messner, Vernardis, Lilley, & Ralser, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0011]; Pino et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0024]; Rost, Aebersold, & Schubert, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0026]; Tran et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0032]). We refer the reader to the specific publications for the usage instructions of these alternative software.\nProteomics data analysis using R\nDownstream data analyses and visualization can be performed using R v3.6.3 in R Studio Server v1.2.5042 using a similar strategy to the one for population RNA-seq (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c378f802-bb79-4876-83d5-7b82d2f3ab62/cpz1245-fig-0004-m.jpg</p>\nFigure 4\nCross-referencing transcriptome and proteome data for cell-type-dependent differential expression. (A) Schematic representation of proteomics data processing steps. (B) Heatmap indicating fold changes for significant metabolic enzymes identified by Birsoy et al. (2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0004]), q < 0.05 and absolute log2 fold change >0.3, n = 4. (C) Box plots showing RNA and protein abundance for metabolic key enzymes in Lgr5 high stem cell and Lgr5 low progenitor samples.\n40. Perform principal component analysis (PCA) using all the quantified proteins to compare samples.\n         \nExtract protein intensities (“PG.quantity” from Spectronaut report table), log2 transform, perform PCA using the function prcomp, and visualize results using the function fviz_pca_ind, which is part of the package factoextra (https://cran.r-project.org/package=factoextra)[href=https://cran.r-project.org/package=factoextra)].\nSamples from different cell populations should form clearly distinguishable clusters on the PCA space (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0001], proteome analyses). Possible outlier samples can also be identified with this procedure and removed for downstream analysis.\n41. Analyze the abundance of metabolic enzymes quantified.\n         \nExtract protein intensities from the Spectronaut report table for the 2948 genes encoding mammalian metabolic enzymes (Birsoy et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0004]).",
    "Filter for proteins showing differential abundance between cell types according to the Spectronaut candidates table. Here, proteins are retained if q value is smaller than 0.05 and the absolute log2 fold change (“Absolute.AVG.Log2.Ratio”) is greater than 0.3.\nIn our dataset, we quantified 393 metabolic enzymes with q < 0.05 and absolute log2 fold change >0.3.\nNormalize data via Z-score (mean = 0, var = 1) and visualize protein levels with heatmap. To highlight the differences between proteins, make Z-score by sample (force each sample to have zero mean and standard deviation = 1).\nIn general, centering and normalizing Z-scores also help in getting an intuitive idea of the relative variation.\nReorder genes with hierarchical clustering. Depicting the data matrix in this way puts genes (rows) with similar expression patterns across cell types (columns) close to each other and helps to find co-varying proteins. In Figure 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0004], two major clusters of proteins are identified based on the cell-type-specific expression patterns.\nZ-score-based analysis is powerful for identifying robust differences between cell types; however, in order to estimate the effect size of protein abundance differences between samples, complementary approaches should be used. In particular, proteomics data allow one to estimate absolute amounts of proteins and, thereby, to compare directly the abundance of metabolic enzymes in different sample types.",
    "Protein abundance estimates can be derived from the intensities of the peptides identified for each protein. Default settings in Spectronaut utilize a Top3 strategy for peptide summarization, whereby the mean value of the three most confidently identified peptides for each protein is used to derive the protein abundance value. Since this strategy considers the same number of peptides for each protein, it does not require further normalization to take into account differences in protein sizes. Other summarization strategies, i.e., based on summed peptide intensities, require additional normalization steps to derive comparable estimates of protein absolute abundances (see for example iBAQ values; Schwanhausser et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0030]).\nIn order to correctly estimate abundances of related (homologous) proteins, only proteotypic peptides (peptides unique to a given gene product) should be used. In addition, it is recommended to consider only proteins for which at least two proteotypic peptides were identified, as abundance estimates based on single peptides can be less accurate due to different physical/chemical properties of individual peptides.\nIn Figure 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-fig-0004], absolute levels of key rate-limiting metabolic enzymes are compared between GFPhigh and GFPlow ISC samples. Illustrative R code and input files are available at: https://gitlab.leibniz-fli.de/ori-lab/metabolic-signatures-in-stem-cells/[href=https://gitlab.leibniz-fli.de/ori-lab/metabolic-signatures-in-stem-cells/].",
    "In contrast to RNA and proteins, metabolites do not follow a fixed structural template and accordingly have diverse physical properties. As a result, no single analytical tool can measure all metabolites. One advantage of the current framework is that once the cell-type-specific metabolic genes or enzymes are identified, the targeted metabolic pathways can be further investigated in combination with metabolic gene ablation. Here, we use Hmgcs2 and ketogenesis (i.e., ketone body metabolite production), which we identified as ISC-specific metabolic signature, as an example to describe the validation process using HRAM (high-resolution accurate-mass) liquid chromatography–mass spectrometry (LC–MS) (”a” steps below) and NAD+/NADH assay (”b” steps below) for measuring ketone body β-hydroxybutyrate (β-OHB). The former provides overall changes of relative metabolite levels in response to the target gene deletion. The latter is designed specifically for determining levels of the targeted metabolite β-OHB, which is based upon the oxidation of D-3-hydroxybutyrate to acetoacetate by the enzyme 3-hydroxybutyrate dehydrogenase (McMurray, Blanchflower, & Rice, 1984)[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0021].\nMaterials\nLC/MS OPTIMA−grade methanol (Fisher Scientific A4564)\nMetabolomics Amino Acid Mix Standard (Cambridge Isotope Laboratories, Inc. MSK-A2-1.2)\nCIL has since brought out a new Canonical Amino Acid Standard Mix (MSK-CAA-1) which contains all 20 proteogenic amino acids labeled with 13C and 15N; we recommend using this as an internal standard option instead.\nBlood bank saline, 0.85% NaCl (Azer Scientific 16005-092)\nLC/MS OPTIMA−grade water (Fisher Scientific W64)\nLC/MS grade chloroform with ethanol as a stabilizer (Fisher Scientific C606SK1)\nLC/MS OPTIMA grade acetonitrile (Fisher Scientific A9554)\nAmmonium carbonate (Sigma 379999)\nAmmonium hydroxide (Sigma 338818)\n100 mM Tris·HCl, pH 8.5\nβ-Hydoxybutyrate Standard (Sigma H0265)\nβ-Hydoxybutyrate Enzyme Solution (Caymen 700193)\nβ-Hydroxybutyrate Colorimetric Detector (Caymen 700194)\nGlycine (Sigma G7126)\nAspartate (Sigma A7219)\n1.5-ml microcentrifuge tubes (Axygen MCT-150-C)\nCentrifuge with temperature control (Eppendorf 5804R)\nNitrogen evaporator (MultiVap, Organomation)\nPolypropylene autosampler vials with fused insert (ThermoFisher 03340620)",
    "Autosampler caps with PTFE/silicone septa (ThermoFisher 03376481)\nDionex Ultimate 3000 UHPLC (ThermoFisher Scientific)\nQExactive hybrid mass spectrometer equipped with a HESI II probe (ThermoFisher Scientific)\nSeQuant® ZIC-pHILIC analytical column (5 μm, 150 × 2.1 mm) fitted with a SeQuant® ZIC-pHILIC guard column (5 μm, 20 × 2.1 mm)\nMicrosoft Excel\nTraceFinder 4.1 (ThermoFisher Scientific)\n96-well plates for colorimetric assays\nNOTE: If absolute quantification of metabolites is required, we recommend including the labeled metabolite of interest as an internal standard if possible, and running a standard curve alongside the experimental samples. Determining cell number and volume/ tissue weight is also required to calculate absolute concentration.\nPolar metabolite extraction and detection using HRAM LC/MS\nChloroform-methanol extraction\nBefore you begin, prepare methanol containing 500 nM Metabolomics Amino Acid Mix Standard (methanol with internal standards) and chill to −20°C (this can be stored long-term at −20°C). Chill appropriate amount of chloroform to −20°C and LC/MS grade water to 4°C. The following protocol should be performed on ice and as quickly as possible to quench metabolism in the intestinal crypts.\n1a. Harvest intestinal crypts from WT and Hmgcs2-intestinal KO mice as previously described (Cheng et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0009]; also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0001]).\n2a. Wash crypt pellets once with cold 0.85% NaCl.\n3a. Add 600 μl LC/MS-grade methanol with internal standards.\n4a. Add 300 μl LC/MS-grade water.\n5a. Pipette up and down to mix.\n6a. Add 400 μl chloroform to each sample.\n7a. Vortex for 10 min at 4°C\n8a. Spin 10 min at 21,100 × g, 4°C, to initiate phase separation.\n9a. Carefully collect the two layers separately, avoiding the precipitate at the interface of the two layers (top layer is polar; bottom layer is organic/lipids). Evaporate to dryness under a stream of nitrogen.\n10a. Store dried polar and organic extracts at −80°C until analysis.",
    "Organic extracts can be used for lipidomics analysis, the method for which is beyond the scope of this protocol.\nPreparation of samples for LC-MS analysis of polar metabolites\n11a. Resuspend dried polar extracts in 100 μl LC/MS-grade water (on ice)\n12a. Vortex for 10 min at 4°C to ensure complete resuspension and even mixing\n13a. Spin for 10 min at 21,100 × g, 4°C, to remove any remaining debris/precipitate\n14a. Transfer 90 μl to a new 1.5-ml microcentrifuge tube (on ice)\n15a. Combine equal volumes of each sample to create a 1× pooled sample (this will be used for QC).\nThe volume you will need from each sample will depend on the number of samples in the overall experiment.\n16a. Take 3 μl of your pooled sample and add 7 μl LC/MS-grade water. This will be your 0.3× dilution. Transfer to an LC/MS autosampler vial.\n17a. Take 1 μl of your pooled sample and add 9 μl LC/MS-grade water. This will be your 0.1× dilution. Transfer to an LC/MS autosampler vial.\n18a. Transfer at least 40 μl of your 1× pooled sample to an LC/MS autosampler vial.\n19a. Transfer 20 μl of sample to an LC/MS autosampler vial. Store any remaining sample (from the original 90 μl resuspension) at −80°C as a backup in case the initial run fails.\n20a. Transfer LC/MS vials to the autosampler of the LC system\nLC-MS analysis of polar metabolites\nFor LC-MS analysis of polar metabolites inject 2 μl of each sample. Metabolites are separated on a Dionex Ultimate 3000 UHPLC using a linear gradient according to Table 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0005] with a constant flow rate of 0.15 ml/min.\nTable 5.\n                Gradient Separation of Polar Metabolites Prior to MS Analysisa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl5-note-0001_65]\ntable:\n﻿Time,%B\n0.0,80\n20.0,20\n20.5,80\n28.0,80",
    "a Linear gradient for the UHPLC during an LC-MS run (step 21a). The table shows the runtime (in min) and the corresponding percentage of mobile phase B (%B) on the column.\nOther LC systems may be used. However, the technology transfer may need to be determined empirically.\n         \nMobile Phase A: 20 mM ammonium carbonate with 0.1% ammonium hydroxide\nMobile Phase B: acetonitrile\nThe following MS parameters are specific to the QExactive quadrupole-orbitrap hybrid mass spectrometer (ThermoFisher Scientific). While alternative mass spectrometers may be used, their parameters will need to be adjusted according to the specific instrument being utilized.\n21a. Data acquisition:\n         \nUse the Dionex UltiMate 3000 UHPLC system coupled to a QExactive hybrid mass spectrometer equipped with a HESI II probe.\nPrior to analysis, calibrate the mass spectrometer using the standard calibration mix if calibration has not been performed within the last 7 days, or a mass check fails. Perform a custom calibration of the lower end masses by spiking the standard calibration mix with glycine (positive ionization mode) and aspartate (negative ionization mode).\nInject 2 μl sample onto a SeQuant® ZIC-pHILIC analytical column (5 μm, 150 × 2.1 mm) fitted with a SeQuant® ZIC-pHILIC guard column (5 μm, 20 × 2.1 mm).\nNote that injection volume may need to be determined empirically depending on the cell/tissue type. Choose an injection volume that detects metabolites in the linear range (use the linear dilution series to determine the linear range of each metabolite).\nSet the column oven to 25°C and the autosampler tray to 4°C.",
    "Use Excel to randomize the order in which your samples will be injected and inject the pooled QC sample every 8-10 samples, including the 0.3× and 0.1× dilution series at the end of your sequence. As part of this linear dilution series, include a larger 2× QC pool injection. In addition, acquire MS/MS data from the QC pool in both positive and negative ionization mode.\nSeparate metabolites using the gradient described in Table 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0005].\nAcquire MS data using the parameters described in Tables 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0006]-8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl-0008].\nProcessing and analysis of LC-MS data to determine relative quantification of polar metabolites\n22a. Use TraceFinder 4.1 to integrate raw peak areas for metabolites of interest and internal standards by extracting ion chromatograms from the full scan data (or tSIM data in the example of β-OHB)\n         \nFor metabolite identification, match retention time and MS/MS spectra against in-house retention time and MS/MS spectral libraries previously established using identical LC-MS conditions and authentic chemical standards.\nThe in-house retention time library is especially important for the integration of β-hydroxybutyrate due to close-eluting isomers of α-hydroxybutyrate, β-isohydroxybutyrate, and γ-hydroxybutyrate.\nTable 6.\n                Settings for Full-Scan Polarity Switch with tSIM for β-OHB Mass Spectrometry Data Acquisition on QExactive Hybrid Mass Spectrometer (ThermoFisher Scientific)\ntable:\n﻿Entry,Parameter,Setting\nFull MS,Polarity,Positive\n0-16.5 min,Resolution,70000\n,AGC Target,1e6\n,Max IT,20 ms\n,Microscans,1\n,Data Type,Profile\n,Scan Range,70-1000 m/z\nFull MS,Polarity,Negative\n0-16.5 min,Resolution,70000\n,AGC Target,1e6\n,Max IT,20 ms\n,Microscans,1\n,Data Type,Profile\n,Scan Range,70-1000 m/z\ntSIM,Polarity,Negative\n3-7 min,Inclusion list,On: 120.03230 m/z\n,Resolution,70000\n,AGC Target,1e5\n,Max IT,250 ms\n,Isolation Window,1.2 m/z\n,Microscans,1\n,Data Type,Profile\nTable 7.\n                Settings for ddMS2 Positive Mode Mass Spectrometry Data Acquisition on QExactive Hybrid Mass Spectrometer (ThermoFisher Scientific)\ntable:\n﻿Entry,Parameter,Setting\nFull MS,Polarity,Positive\n0-16.5 min,Default charge state,1\n,Exclusion,Ona[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl7-note-0001_69]\n,Resolution,70000\n,AGC Target,1e6\n,Max IT,50 ms\n,Microscans,1\n,Data Type,Profile\n,Scan Range,70-1000 m/z\nddMS2,Resolution,17500\n,AGC Target,2e5\n,Maximum IT,100 ms\n,Loop Count,10\n,TopN,10",
    ",Isolation Window,1.0 m/z\ndd properties,(N)CE/Stepped (N)CE,\"15, 30, 45\"\n,Exclude Isotopes,On\n,Dynamic Exclusion,5.0 s\na Exclusion list for positive mode should be generated prior to experiment using a mock extraction run on identical Full Scan settings. Include the top 100 most abundant ions.\nTable 8.\n                Settings for ddMS2 Negative Mode Mass Spectrometry Data Acquisition on QExactive Hybrid Mass Spectrometer (ThermoFisher Scientific)\ntable:\n﻿Entry,Parameter,Setting\nFull MS,Polarity,Negative\n0-16.5 min,Default charge state,1\n,Exclusion,Ona[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-tbl8-note-0001_70]\n,Resolution,70000\n,AGC Target,1e6\n,Max IT,50 ms\n,Microscans,1\n,Data Type,Profile\n,Scan Range,70-1000 m/z\nddMS2,Resolution,17500\n,AGC Target,2e5\n,Maximum IT,100 ms\n,Loop Count,10\n,TopN,10\n,Isolation Window,1.0 m/z\n,(N)CE/Stepped (N)CE,\"15, 30, 45\"\ndd properties,Exclude Isotopes,On\n,Dynamic Exclusion,5.0 s\na Exclusion list for negative mode should be generated prior to experiment using a mock extraction run on identical Full Scan settings. Include the top 100 most abundant ions.\n23a. Normalize raw peak areas by dividing the raw peak area for each metabolite by the raw peak area of the corresponding internal standard (selected based on similarity of retention time and/or chemical similarity). If performing metabolite profiling to measure a particular metabolite, consider purchasing a stable isotope−labeled version of that metabolite if available.\n24a. Further normalize these values to tissue weight (mg) or cell number, if the extraction volume was not adjusted for biological input prior to analysis by LC-MS.\n25a. Generate QC metrics by calculating the coefficient of variation (CV) for the multiple pooled QC injections. Reject metabolites with a CV >0.25, as these metabolites are not being detected in a reliable fashion.\n26a. Use the pooled dilution series (average of pooled 1× QC injections, 0.3× QC pool injection, and 0.1× QC pool injection) to calculate the linear correlation coefficient for each metabolite. Reject metabolites that have an R value of <0.975, as these metabolites are not being detected in a linear fashion.",
    "27a. Use the normalized values to calculate relative log2 fold change across different conditions and to perform statistical analysis. Many open-source platforms exist that can be used for this purpose, including Metaboanalyst (Xia, Psychogios, Young, & Wishart, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-bib-0036]).\nBecause the levels of metabolites being detected here are relative, comparisons can only be made by comparing relative levels of the same metabolite across different conditions in the same base sample type (i.e., by comparing relative levels of β-hydroxybutyrate across intestinal crypts isolated from wt and KO mice). It is not possible to compare levels of different metabolites within the same sample due to ionization suppression and enhancement, and other matrix effects that can occur during ESI. To compare levels of different metabolites within the same sample, absolute molar quantification is required. Similarly, it would be inappropriate to compare relative levels of the same metabolite across samples of different types (i.e., comparing levels of β-hydroxybutyrate between intestinal crypts isolated from a mouse with whole tissue extracts).\nNAD+/NADH assay for β-OHB determination\n1b. Resuspend the crypt cells from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0001] (step 19) or directly sort cell populations from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.245#cpz1245-prot-0002] (step 6) in 50 μl 100 mM Tris·HCl, pH 8.5.\n2b. Homogenize the cell suspension on ice.\n3b. Centrifuge cell suspension 10 min at 10,000 × g, 4°C.\n4b. Transfer the supernatant to another tube on ice\n5b. Prepare standards by serially diluting β-hydroxybutyrate solution (50 μl each, from 100 to 1 μM) using 100 mM Tris·HCl.\n6b. Load standard duplicates and samples into 96-well microplate for colorimetric assay. Use 100 mM Tris·HCl as the blank for calibration.\n7b. Prepare developer solution by mixing 100 μl of the β-HB Colorimetric Detector to the vial of reconstituted β-HB Enzyme Solution. Store the developer solution on ice.",
    "8b. Add 50 μl developer solution to each well and mix the reagents by pipetting to initiate the enzymatic reaction\n9b. Incubate the plate in dark, at 25°C, up to 2 hr for lysates from crypts or up to 6 hr for lysates from sorted cells.\n10b. Read the absorbance at 445-455 nm.\n11b. Calculate the average absorbance of each standard and sample.\n12b. Subtract the absorbance value of standard A (0 mM) from itself and all other values (both standards and samples).\nThis is the corrected absorbance.\n13b. Calculate the values of the β-HB samples using the equation obtained from the linear regression of the standard curve by substituting the corrected absorbance values for each sample into the equation.\n14b. Normalize to sample volume (measured prior to lysis) or by number of cells."
  ],
  "subjectAreas": [
    "Stem Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}