{
  "id": 9224,
  "origin_website": "Jove",
  "title": "Variations on Negative Stain Electron Microscopy Methods: Tools for Tackling Challenging Systems",
  "procedures": [
    "1. Preparation of EM Grids\nCarbon Sheet Method\nPrepare a freshly cleaved mica sheet.\n\t\t\nGently insert a precision syringe needle or a razor blade at one corner of the mica sheet, a few mm in between the layers. Insert the tool as close to the vertical centre of the sheet as possible to produce two pieces of approximately equal thickness.\nCarefully prise apart the two halves of the mica sheet. Do this can by eye, or under a dissecting microscope.\nCut off one of the corners of each of the newly cleaved mica sheets. In the event that the sheet turns over in the carbon evaporator during vacuum release, the carbon coated side of the sheet can be identified.\nPlace the cleaved mica sheet/s in the chamber of a carbon evaporator, with the freshly-cleaved surface facing up.\nMake sure the carbon evaporator is set-up correctly with a properly prepared carbon electrode.\n\t\tNOTE: The method of preparing the carbon rods will vary depending on the specifications of the carbon evaporator. A protocol for one instrument is as follows until step 1.1.5.\n\t\t\nSharpen a carbon rod with a sharpener to have a sharp tip and then polish it with a paper towel to remove any rough burrs.\nUsing fine sandpaper flatten the end of a second rod and again polish it smooth with a paper towel.\nPlace the two carbon rods into the evaporator according to manufacturer's instructions. Ensure the sharpened end on the first rod makes firm contact with the flattened face of the second rod.\nPlace a small piece of clean, dry filter paper partially under the mica if the carbon thickness is going to be gauged visually. Alternatively, place a white frosted microscope slide with a small dab of vacuum grease alongside the mica to gauge carbon thickness.",
    "Deposit carbon onto the mica according to manufacturer's instructions.\n\t\t\nPump the vacuum down and wait until it is at 10-5 mbar. Set the voltage of the electrode to 4.0 V (up to 5 V may be required depending on the carbon rod source).\nRun multiple short pulses of approximately 3.5 s in duration through the electrode to deposit 1-2 nm thick evaporations of carbon on the mica surface.\n\t\t\tNOTE: As current is applied to the carbon rod it will glow red and then white. Do not stare at the bright light as this could damage your eyes.\nAllow the carbon to deposit on the mica until the desired thickness is reached, as measured by the carbon evaporator's thickness gauge or by visual observation of the carbon deposited on the filter paper or microscope slide. Ensure that the final carbon layer is 5-10 nm thick.\n\t\t\t\nIf the carbon thickness is gauged visually compare the frosted part of the microscope slide coated with vacuum grease to the exposed area, it will become darker as more carbon is deposited.\n\t\t\t\tNOTE: There is no quantitative method to determine carbon thickness when using this method.\nVent the vacuum chamber and remove the carbon-coated mica from the carbon evaporator.\n\t\tNOTE: The carbon-coated mica can be left to settle overnight before proceeding with subsequent steps\nUse one of the two water containers to float the carbon film onto the EM grids: a container with a drain valve at the bottom so water can be drained out and the carbon layer lowered on to the awaiting grids or a lifting rig that the grids can be set on under the water surface, which can subsequently raise the grids up to the carbon film at the water's surface.",
    "Fill the container with ultrapure distilled water so that the surface of the water is approximately 5 mm from the top. Clean the surface of water by dragging a sheet or two of lens tissue over the surface to remove any floating particulates.\nPlace a piece of clean stainless-steel mesh (1 inch by 2.5 inches is an appropriate size) under the surface of the water.\nUsing a pair of fine tweezers, lay clean, dry EM grids face up (according to the manufacturer's description) on the stainless-steel mesh. Pack the grids together as tightly as possible, but do not allow them to overlap.\nOnce the grids are arranged, firmly grip the carbon coated mica sheet in a pair of tweezers or film developing tongs.\nIntroduce the mica sheet into the water. Ensure that this is done at a very shallow angle (~10 degrees).\n\t\tNOTE: The mica should break through the water surface and submerge, whilst the carbon film should separate from the mica and float on the water surface. This step should not be performed directly over the grids, to avoid damage and/or contamination.\n\t\t\nTo minimize the possibility of the carbon film will not separating from the mica sheet, score around the edge of the mica sheet with a razor blade or cut one corner off with small scissors before introducing it into the water.\nOnce the carbon film has detached, remove the mica sheet or let it fall to the bottom of the container.\nUsing fine tipped tweezers, apply very gentle pressure and with slow movements guide the carbon film over the top of the grids.\nBring the carbon sheet in contact with the surface of the grids either by slowly draining the water or raising the lifting ring, depending on the type of apparatus used.",
    "Carefully lift the stainless-steel mesh (now with carbon-coated grids) from the apparatus and wick away some of the excess water using a piece of filter paper. Ensure that this is done by touching the filter paper to the very edge of the steel mesh but not coming in contact with the grids or carbon film.\nPlace the mesh of grids in a petri dish containing a dry piece of filter paper and allow to it dry completely.\n\t\tNOTE: This is best affected by drying overnight at room temperature, but the step can be expedited by placing the grids in an oven at approximately 60 °C.\nFloat and coat (direct carbon deposition). This method has been described in detail previously16\nCompletely fill a clean large glass bowl to the brim with distilled water so a meniscus forms at the top.\nApply a single drop of collodion solution (nitrocellulose in amyl acetate) to the surface of the water using a clean pasteur pipette, allow the droplet to spread out and dry completely. Once dry a thin layer of collodion floating on top of the water surface will be visible.\nGently remove the collodion layer using a toothpick to remove dust or other contamination from the surface of the water.\nApply a second collodion droplet to the water and allow it to spread out and dry for 2-3 minutes.\n\t\tNOTE: Repeat steps 1.2.3-1.2.4 until a flat and wrinkle free sheet of collodion is obtained.\nUsing a pair of fine tweezers place EM grids face down (according to the manufacturer's description) on the floating collodion sheet. Pack the grids together tightly in a hexagonal array, but do not allow them to overlap.",
    "NOTE: If a grid is misplaced or placed upside down it is generally best to leave it in place rather than risk damaging the collodion sheet when trying to move it.\nOnce all of the grids are placed, gently lay a sheet of filter paper over them. Allow the paper to become saturated by capillary action.\n\t\tNOTE: Any size or thickness of filter paper is appropriate if it completely covers the grids.\nUse a toothpick to remove any collodion film that extends beyond the filter paper.\nGrip the filter paper at the edge and peel it from the water surface.\n\t\tNOTE: The grids should stay adhered to the paper.\nPlace the paper flat and collodion-face up in a petri dish and allow it to dry completely.\nPlace the filter paper with the grids in the chamber of a carbon evaporator with a properly prepared carbon electrode as detailed in 1.1.2.\nFollow the carbon evaporation procedure as described for the carbon sheet method in\nAllow several seconds between pulses to avoid overheating and damaging the nitrocellulose sheet.\n\tNOTE: If desired the polymer layer can be removed after the grids have been carbon coated, although this step is rarely necessary. Place the grids carbon side up on a fresh piece of filter paper and put several drops of acetone on the paper near, but not on, the grids. Allow the acetone to spread out under the grids and dissolve and absorb the polymer layer.\n2. Preparation of Negative Staining Reagents\nPreparation of Uranyl Acetate\nBring a small volume of ultrapure water to a boil and allow it to boil for 10 min to thoroughly degas. Allow it to cool slightly, and then use it to dissolve uranyl acetate (UA) at 1-2 % (w/v).",
    "NOTE: Perform this procedure in a fume cupboard and with appropriate personal protective equipment.\nAfter the solution has cooled, filter through a 0.2 µm syringe filter or filter paper.\nStore the UA protected from light and at 4 ˚C. The solution is stable for up to 1 year.\nPreparation of Uranyl Formate from Powder. This Method has been Described in Detail Previously8\nDissolve 20 mg uranyl formate (UF) powder in 2 mL of boiled degassed ultrapure water (as in step 2.1.1) by stirring.\nWhile continuing to stir, add 8 µL of 5 M NaOH, the solution should change to a darker yellow colour, but no precipitate should form.\nFilter the solution through a 0.2 µm syringe filter.\nStore the UF stain protected from light. Discard the stain should if any precipitate or brown discoloration is observed. The solution is only stable for 1-2 days.\nPreparation of Uranyl Formate from Uranyl Acetate\nPrecipitate 1 mL of 1% (w/v) UA stain by adding 100 µL of 1 M NaOH.\nCentrifuge the mixture for 2 min at maximum speed in a benchtop centrifuge.\nDiscard any supernatant and dissolve the precipitate in 100 µL of 5% (v/v) formic acid by vigorous vortexing.\nDilute to a final volume of 1 mL with 900 µL ultrapure water to yield the UF stain in 0.5% (v/v) formic acid.\nStore the UF stain protected from light. Discard the stain if any precipitate or brown discoloration is observed.\nPreparation of Other Staining Reagents\nPreparation of Lanthanide Acetate Stains\nDissolve Samarium Acetate (SmAc), Gadolinium Acetate (GdAc), Thulium Acetate (TmAc), or Erbium Acetate (ErAc) at 1-2% (w/v) in ultrapure water.",
    "NOTE: If samples show positive staining or poor adherence to the grid when using these stains, they can be acidified with up to 0.5% (v/v) formic acid. Positive staining results in the sample appearing as a dark object surrounded by a white halo. Poor adherence to the grid will result in fewer molecules than expected being observed on the grid.\nPreparation of Ammonium Molybdate and Sodium Phosphotungstate\nDissolve the stain at 1-3% (w/v) in ultrapure water. Adjust the pH to 7.0 using 5 M NaOH if desired.\n3. Adsorbing Samples to the Carbon Substrate and Staining\nPreparation of the Grid Surface for Sample Application by Rendering it Hydrophilic\nPlace the grid facing up on a microscope slide in a glow discharge unit.\nTreat the grid for a minimum of 30 s at 10 mA.\n\t\tNOTE: The exact method of glow discharge will depend on the specifications of the particular piece of equipment used.\nAlternatively this may be accomplished by UV irradiation for 10 minutes using a benchtop UV lamp4.\nSide Blotting Method. This Method has been Described in Detail Previously8\nGrip the edge of the grid with a pair of negative pressure tweezers, and apply 3-5 µL of sample to the support surface.\nAllow the sample to adsorb to the grid surface for 10 s to 1 min. Optimize the adsorption time must for individual samples.\nTouch the edge of the grid to a sheet of filter paper and allow capillary action to pull off the liquid.",
    "Optional: Wash the grid. Place 50 µL drops of ultrapure water or appropriate volatile buffer solution on a sheet of laboratory film. Gently touch the carbon surface of the grid to the drop and lift off a small droplet onto the surface of the grid. Touch the edge of the grid to a sheet of filter paper and allow capillary action to pull off the liquid.\nRepeat this wash step as many times as desired.\nPlace two 50 µL drops of staining reagent on a sheet of laboratory film.\nGently touch the carbon surface of the grid to the drop and lift off a small droplet onto the top surface of the grid.\n\t\tNOTE: If the stain migrates to the back of the grid then the grid should be discarded.\nTouch the edge of the grid to a sheet of filter paper and allow capillary action to draw off the liquid. Perform this staining step twice.\nAllow the grid to air dry or dry under an incandescent lamp.\nFlicking Method\nGrip the edge of the grid with a pair of negative pressure tweezers, and apply 3-5 µL of sample to the support surface.\nHolding the tweezers in one hand, so that the grid is angled at approximately 45° facing away, rapidly flick the wrist of that hand to 'flick off' the majority of the droplet that is on top of the grid.\nOptional: Using a glass Pasteur pipette apply a drop of wash solution to the support surface and 'flick off' as in 3.2.2. Repeat as necessary.\nUsing a glass Pasteur pipette apply a drop of staining reagent to the support surface and 'flick off' as in 3.2.2. Repeat 1-3 times dependent on stain depth required for visualization of specimen.",
    "NOTE: This is not the only factor that attributes to final stain depth (see discussion).\nRemove excess stain by touching the torn edge of a piece of filter paper to the edge of the grid.\nAllow the grid to air dry or dry under an incandescent lamp.\nRapid Flushing Method\nDraw 30-70 µL of stain (1 % UA usually used) into the tip of a 200 µL pipette, turn the volume dial to draw up 5 µL of air, then draw up wash/mixing reagent (5-30 µL), if required, followed by another small air gap and then draw up 5 µL of sample.\nGrip the edge of a grid with a pair of negative pressure tweezers, holding the tweezers so that the grid is angled at approximately 45° facing away from the researcher, eject the entire contents of the pipette tip across the face of the carbon-coated EM grid.\nRemove excess stain by touching the torn edge of a piece of filter paper to the edge of the grid.\nAllow the grid to air dry or dry under an incandescent lamp.\n\t\tNOTE: For all methods it is advisable to slide the torn edge of a sheet of filter paper along the forceps until it reaches the grid as this removes solution trapped between the two sides of the forceps, which can pull the dried grid into the jaws of the forceps once they are opened. The grid in the tweezers can also be placed on the edge of a fume hood to dry. The constant airflow can help produce more even staining."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}