{
  "id": 6591,
  "origin_website": "Bio",
  "title": "Isolation of Neutrophil Nuclei for Use in NETosis Assays",
  "procedures": [
    "Kill the mice by cervical dislocation or any other suitable method.Note: Protocols used to euthanize the mouse should be approved by your institution animal ethics committee. Pin the mouse on its back using needles. Pin each leg. Spray the mouse with 70% ethanol. Using the mouse dissection kit, cut the skin along the anterior legs to access the tibia and the femur.Cut the anterior legs just above the hips and the ankles.Using a tissue, gently remove the flesh around the bones. Separate the femur and the tibia. Place the bones for 15 s in 70% ethanol solution in a 6-well plate. Bring the bones (while in ethanol) inside the cell culture hood. Transfer the bones into neutrophil media in a 6-well plate and keep them on ice.Under the hood, cut the extremity of the bones with a pair of scissors and flush the bone with neutrophil media using a 27 G needle.Note: Usually, 10 ml of neutrophil media per mouse is sufficient for flushing. Purify bone-marrow neutrophils using a negative-selection kit EasySep from StemCell Technology. Alternatively, neutrophils can also be purified as described in (Chen et al., 2014). Keep the cells on ice upon elution.Note: Routinely, a 12 weeks-old mouse should give you between 12 and 20 millions of neutrophils. Male mice will yield a higher neutrophil count. Count the viable cells using a hematocytometer by diluting the eluate 1 in 10 with trypan blue.Centrifuge the cells at 400 x g for 5 min at 4 °C. Remove the cell supernatant by aspiration.Using a P1000 micropipette, gently resuspend the neutrophil to a concentration of 50 million neutrophils/ml of hypotonic buffer.Note: Neutrophils are very fragile cells. Treat them gently and avoid vortexing them or resuspending by shaking them. Such treatment can activate neutrophils and will affect the outcome of your experiment.",
    "We usually resuspend cells slowly using a P1000 micropipette. Incubate the cells on ice for 10 min to let them swell.While the cells are lysing, prepare the nitrogen cavitation device (Zhou and Philipp, 2017). Make sure that the lower valve of the vessel is closed. Remove the upper part of the cell disruption vessel and add your cells inside. Keep the vessel on ice.Connect the vessel to the nitrogen tank and gently open the pressure-reducing valve on the tank until the indicator on the vessel indicates 380 psi. Close the upper valve and disconnect the nitrogen tank. Incubate on ice for 5 min.Note: Carefully monitor the pressure. Too high pressure may disrupt neutrophil granules and contaminate your nuclei preparation. Take a 1.5 ml microfuge tube and place it close to the lower valve. Slowly open the valves and let the liquid flow inside the microtube.Note: Be careful when opening the lower valve. Opening the valve too quickly can result in a complete sample loss. Centrifuge the cell extract for 5 min at 500 x g, 4 °C. Gently remove the supernatant.Add 300 μl of hypotonic buffer to the pellet and gently resuspend it. Repeat Step 15 twice.Resuspend gently your pellet in 200 μl of the hypotonic buffer using a P1000 pipette. Using a hematocytometer, count the nuclei and resuspend them according to your need.The nuclei preparation is ready to be used for your assay.Notes: The nuclei preparation should be prepared for immediate use. It is not recommended to freeze if the preparation is meant to be used for NETosis studies. This protocol can be used to purify nuclei from neutrophils isolated from fresh human blood. In that case, experimenter should start the protocol from Step 7.",
    "The EasySep human neutrophil enrichment kit (StemCell Technology) can be used to purify human neutrophils. Final resuspension (step 17) can be performed in other buffers if those are more convenient for the experimenter. Such buffer may not lyse the nucleus and must be tested before used to ensure that the nucleus stays intact (e.g., not permeable to SYTOX staining). See the Data analysis section for further details."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}