{
  "id": 19542,
  "origin_website": "Jove",
  "title": "Large-scale Production of Recombinant RNAs on a Circular Scaffold Using a Viroid-derived System in Escherichia coli",
  "procedures": [
    "1. Plasmid Construction\nAmplify by PCR (or by reverse transcription PCR if starting from an RNA template) the cDNA corresponding to the RNA of interest using primers with 5’ extension to allow assembly into the expression plasmid. To avoid undesired mutations, use a high-fidelity DNA polymerase.\nTo insert the cDNA in the expression plasmid by Gibson assembly20, add the following 5’ extensions to the PCR primers: forward, 5’-tctccccctcccaggtactatccccttXXXXXXXXXXXXXXXXXXXXXX-3’; reverse, 5’-ccctcctagggaacacatccttgaXXXXXXXXXXXXXXXXXXXXXX-3’; X represents nucleotides homologous to the terminal ends of the RNA of interest.\nIncubate for 30 s at 98 °C, followed by 30 cycles of 10 s at 98 °C, 30 s at 55 °C and 30 s at 72 °C, and a final extension of 10 min at 72 °C.\nDigest 100 ng of plasmid pLELVd-BZB with 10 U of the type-IIS restriction enzyme Bpi I for 1 h at 37 °C in a 20 µL reaction in a 0.5 mL tube in buffer G (10 mM Tris-HCl, pH 7.5, 10 mM MgCl2, 50 mM NaCl, 0.1 mg/mL BSA).\nNOTE: All plasmids are available on request to the corresponding author. Bpi I is equivalent to Bbs I.\nSeparate the PCR and digestion products by electrophoresis in a 1% agarose gel in TAE buffer (40 mM Tris, 20 mM acetic acid, 1 mM EDTA, pH 7.2). Stain the gel for 15 min by shaking in 200-mL of 0.5 µg/mL ethidium bromide. Visualize the DNA using a UV transilluminator and cut the bands corresponding to the amplified cDNA and the Bpi I-digested plasmid (2046 bp) using a scalpel blade.\nNOTE: Bpi I digestion of pLELVd-BZB also releases a 528 bp product corresponding to the LacZ blue-white reporter.",
    "Elute the DNAs from the gel fragments using silica gel columns (gel DNA recovery kit in Table of Materials) and quantify the DNA concentration by spectrophotometric analysis.\nSet up a Gibson assembly reaction using the amplified cDNA and the digested plasmid. Use a 3-fold molar excess of insert versus vector20. Incubate for 1 h at 50 °C and purify the reaction products using a silica gel column (DNA clean & concentrator kit in the Table of Materials).\nUse the purified products of the Gibson assembly reaction to electroporate competent E. coli DH5α cells. Using 1-mm electroporation cuvettes, apply the following settings: 1,500 V and 5 ms. Incubate for 1 h at 37 °C in super optimized broth with catabolite repression (SOC; 20 g/L tryptone, 5 g/L yeast extract, 0.5 g/L NaCl, 2.5 mM KCl, 10 mM MgCl2, 20 mM glucose, pH 7.0) liquid medium and then spread onto Luria-Bertani (LB; 10 g/L tryptone, 5 g/L yeast extract, 10 g/L NaCl) agar (1.5%) plates containing 50 µg/mL ampicillin.\nTo screen for colonies corresponding to transformed E. coli clones that likely incorporated the insert, 15 min before plating the electroporated cells, spread 30 µL of 50 mg/mL 5-bromo-4-chloro-3-indolyl-β-D-galactopyranoside (X-gal) in dimethylformamide. Incubate plates overnight at 37 °C.\nPick several white colonies and grow overnight at 37 °C in liquid LB media. Purify plasmids using a miniprep kit (see Table of Materials) and analyze their sizes by electrophoresis in a 1% agarose gel in TAE buffer.\nSelect the most likely recombinant plasmid based on electrophoretic migration compared to the pLELVd-BZB control. Confirm the sequence of the selected plasmid by sequencing using primers 5’-CCTTTTTCAATATTATTGAAGC-3’ and 5’-GATGCTCGTCAGGGGGGCGGAG-3’ that flank the whole expression cassette in pLELVd-BZB.",
    "NOTE: Remember that this plasmid contains a 528 bp polylinker with the LacZ marker that is replaced by the cDNA of interest. Restriction mapping may help to select the right recombinant plasmids.\n2. RNA Expression\nCo-electroporate (see conditions in 1.6) the selected E. coli strain (E. coli BL21 or a BL21 derivative) with the pLELVd-BZB-derivative that contains the cDNA corresponding to the RNA of interest and plasmid p15LtRnlSm to co-express the eggplant tRNA ligase. Use the E. coli HT115(DE3), which lacks RNase III21, to express RNAs with long double-stranded regions.\n\tNote: Both the RNA of interest and the tRNA ligase mRNA are transcribed by the E. coli RNA polymerase. No DE3 lysogen to express T7 RNA polymerase is required in the E. coli strain, although the presence of this lysogen has no deleterious effects.\nAfter 1 h incubation at 37 °C in SOC liquid medium, plate electroporated bacteria in LB solid medium containing 50 µg/mL ampicillin and 34 µg/mL chloramphenicol. Incubate overnight at 37 °C.\nPick a colony and inoculate a 1 L baffled Erlenmeyer flask with 250 mL of liquid Terrific Broth (TB) medium (12 g/L tryptone, 24 g/L yeast extract, 0.4% glycerol, 0.17 M KH2PO4, and 0.72 M K2HPO4), containing 50 µg/mL ampicillin and 34 µg/mL chloramphenicol. Incubate at 37 °C with vigorous shaking at 180 revolutions per minute (rpm). Harvest bacteria between 12 and 16 h after culture inoculation.\n3. RNA Extraction and Purification\nFor analytical purposes, take 2 mL aliquots of the culture at the desired time points and centrifuge at 14,000 x g for 2 min. Discard the supernatant and resuspend the cells in 50 µL of TE buffer (10 mM Tris-HCl, pH 8.0, and 1 mM EDTA) by vortexing.",
    "Add one volume (50 µL) of a 1:1 (v/v) mix of phenol (saturated with water and equilibrated at pH 8.0 with Tris-HCl, pH 8.0) and chloroform. Break the cells by vigorous vortexing and separate the aqueous and organic phases by centrifugation for 5 min at 14,000 x g.\nCarefully recover the aqueous phases (upper) that contains total bacterial RNA.\n\t\tNote: Preparations can be stored at -20 °C for subsequent analysis.\nFor preparative purposes, pour culture into a 250 mL centrifuge bottle and spin down cells at 14,000 x g for 10 min. Discard supernatant. Wash the cells by resuspending in 30 mL of water. Transfer to a centrifuge tube and spin down cells again under the same conditions.\nDiscard the supernatant and resuspend the cells in 10 mL of chromatography buffer (50 mM Tris-HCl, pH 6.5, 150 mM NaCl, 0.2 mM EDTA) by vortexing.\nNOTE: At this time, cells can be frozen at -20 °C to proceed with purification at any other moment.\nUsing a fresh or thawed bacterial preparation, break cells by adding 1 volume (10 mL) of phenol:chloroform (see step 3.2) and vortexing vigorously.\nCentrifuge for 10 min at 12,000 x g, recover the aqueous phase and re-extract with 1 volume (10 mL) of chloroform under the same conditions.\nNOTE: The RNA preparation can be stored at -20 °C at this point.\nFurther purify total bacterial RNA by anion-exchange chromatography. Filter the RNA preparation through a 45 µm syringe filter and load on a 1 mL diethylethanolamine (DEAE) column.\nFor chromatography purification, use a liquid chromatography system at a flow rate of 1 mL/min. Before sample loading, equilibrate the column with 10 mL of chromatography buffer (see step 3.3 for composition).",
    "Load the sample and wash the column with 10 mL of chromatography buffer. Elute RNA with 20 mL of elution buffer (50 mM Tris-HCl, pH 6.5, 1 M NaCl, 0.2 mM EDTA) and collect 1 mL aliquots.\n\t\tNote: RNA quickly elutes in the initial fractions. The column can be re-used for further purifications. For this, wash the column with 10 mL of water and store at 4 °C in 20% ethanol.\nSince a major part of the recombinant RNA accumulates in E. coli in a circular form, this property can be profited for purification to homogeneity12. Separate circular RNAs from the linear counterparts by two-dimensional polyacrylamide gel electrophoresis (2D PAGE) combining non-denaturing and denaturing (8 M urea) conditions12,22.\n4. RNA Analysis\nPrepare a 5% polyacrylamide gel (37.5:1 acrylamyde:N,N’-methylenebisacrylamide, mass ratio) in TBE buffer (89 mM Tris, 89 mM boric acid, 2 mM EDTA) containing 8 M urea.\nMix 20 µL of RNA preparations with 1 volume (20 µL) of loading buffer (98% formamide, 10 mM Tris-HCl, pH 8.0, 1 mM EDTA, 0.0025% bromophenol blue, and 0.0025% xylene cyanol), incubate for 1.5 min at 95 °C in a heating block, and snap cool on ice.\nLoad the samples in the polyacrylamide gel and run the electrophoresis at appropriate conditions depending on the gel dimensions (e.g., run 140 x 130 x 2 mm gels for 2.5 h at 200 V). Stain the gel for 15 min in 0.5 µg/mL ethidium bromide, wash with water, and visualize RNA under UV light.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}