{
  "id": 17838,
  "origin_website": "Jove",
  "title": "Customizing a Cryolite Glass Prosthetic Eye",
  "procedures": [
    "All procedures performed in the following protocol involving human participants were in accordance with the ethical standards of the institutional research committee of the University of Cologne and with the 1964 Helsinki declaration and its later amendments or comparable ethical standards.\n1. Prosthetic eye customization\nSelect one of the \"half-done\" cryolite glass eyes based on the best matching iris color to the healthy fellow eye of the patient (Figure 3).\nExamine the fitting of the current prosthetic eye. To do so, let the patient look straight ahead. Pay special attention to the retention of the prosthesis, the viewing direction, the eye lid contour (ptosis, entropion, and ectropion), as well as to the size and volume (exophthalmos and enophthalmos) of the current prosthesis.\nRemove the current prosthetic eye with help of a contact lens suction cup for hard contact lenses.\nExamine the anophthalmic eye socket without the prosthesis and pay attention to a potential inflammation of conjunctiva, the volume filling of the orbital implant, if the orbital implant is visible through the conjunctiva, and if the fornices and sulci are deep enough for a good fitting prosthesis. If there are any major concerns regarding one of these points, an examination by an ophthalmic surgeon should be performed before manufacturing a new prosthesis.\nTake the selected \"half-done\" cryolite glass eye with the ocularist forceps and in the other hand take a hollow skewer that will be used later as a mouthpiece for blowing the glass prosthesis. Heat both slowly to 600 °C with a Bunsen burner while continuously rotating it, and melt the skewer at the open end of the \"half-done\" cryolite glass eye. Open the forceps and lay it down.",
    "Heat the \"half-done\" cryolite glass eye continuously (Figure 4). Using the healthy fellow eye as a model for the color, shape, and quantity of the conjunctival vessels, draw the vessels on the white sclera with heated glass stems in different colors (mostly red, brown, or yellow) (Figure 5).\nHeat the whole \"half-done\" cryolite glass eye while continuously rotating it so that the drawn vessels merge with the white cryolite glass and to produce a very smooth surface.\nModify the shape and the volume of the of the cryolite glass prosthetic eye by suction and blowing in the mouthpiece. Keep rotating the glass eye in the flame of the Bunsen burner from time to time. Use the old prosthesis as a template for this step, but if necessary, modify the shape and the volume of the new prosthesis based on the findings of the previous examinations.\nHeat a transparent glass stem and melt it at the pupil of the cryolite glass prosthetic eye while continuously rotating the glass eye (Figure 6).\nWhile continuously rotating the \"half-done\" glass prosthetic eye, melt the glass at the rear of the prosthesis (Figure 6 and Figure 7) and reduce the volume of the rear by suction with help of the mouthpiece so that the back side shape is nearly equal to the sample prosthesis or the desired shape.\nMelt the glass stem at the front side away and heat the front side of the prosthesis again to produce a very smooth surface (Figure 8).\nTake the front side of the prosthesis with the forceps again, form the final shape of the back side with help of the skewer (Figure 9), and then melt the skewer away (Figure 10).",
    "Heat the whole prosthesis for fire polishing again, especially at the back side and rotate the prosthesis until the surface is very smooth all over.\nPut the prosthesis in a preheated metal container and let it slowly cool down (Figure 11).\nInsert the prosthesis and check the fitting as described in step 1.2 (Figure 12).\nIf necessary, modify the shape of the prosthesis again (repeat steps 1.8–1.15).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}