{
  "id": 5315,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Ubiquitin Dimer Formation Assay",
  "procedures": [
    "Purify 6x His-tagged Arabidopsis E2 UBC22 (His-UBC22) using QIAGEN Ni-NTA Spin Kit and following the manufacturer’s instructions. Purified protein is then dialyzed in a dialysis buffer for overnight. Prepare the reaction samples in 1.5 ml polypropylene tubes. Different components are added as listed below. To test specific linkage of dimer, wild-type Ub can be substituted by different Ub mutants, each of which has one particular lysine residue mutated (Ub-K11R, Ub-K48R or Ub-K63R). Component                  Amount to add or final concentration10x buffer                    2.0 μl E1                               0.2 μME2                               5.0 μMUb                              62.5 μMMg-ATP solution        1.0 mMddH2O                         make up to 20 μlIncubate the reaction samples at 30 °C either in a water bath or an incubator for 4 h. Add 7 μl 4x SDS non-reducing loading buffer and 1 μl ddH2O into each reaction sample. Treat the samples at 95 °C for 5 min. Bio-Rad Mini PROTEAN® 3 Cell gel apparatus is used for protein electrophoresis. Load half amount of samples on a 15% SDS-PAGE resolving gel with 4% stacking gel and run the gel at 120 V for 130 min to separate the proteins.Transfer the proteins to a piece of PVDF membrane at 120 V for 120 min using Bio-Rad Mini Trans-Blot® Cell. The transfer apparatus is placed into a bucket with ice to reduce heat production during the transfer.Incubate the membrane in 10 ml of 1x PBS containing 5% skimmed milk powder for 0.5 h at room temperature for the blocking treatment.Incubate the membrane with primary antibody (anti-ubiquitin antibody, antibody dilution ratio: 1:40,000) in 10 ml 1x PBST containing 3% skimmed milk powder overnight at 4 °C.Wash the membrane with 1x PBST for three times at room temperature (20 ml, 10 min each).",
    "Incubate the membrane with secondary antibody (goat anti-mouse antibody conjugated to HRP, antibody dilution ratio: 1:7,000) in 1x PBST containing 3% skimmed milk powder for 1 h at room temperature.Wash the membrane with 1x PBST for three times at room temperature (20 ml, 10 min each).Detect signal with the ECL prime Western blotting detection reagent according to the manufacturer’s instructions (Figure 1). Use 1-10 min as the initial range of film exposure time, depending on signal strength.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161228/20161228012316_1190.jpgFigure 1. Ub dimer formation assay by His-UBC22. To determine the activity of Arabidopsis UBC22, various components, as indicated on the top of the figure, were added to the reaction tubes with (lanes 2, 4, 6 and 8) or without His-UBC22 (lanes 1, 3, 5 and 7). The reaction tubes were incubated at 30 °C for 4 h. The samples were then subjected to SDS-PAGE (with 4% stacking and 15% resolving gel).Free Ub and Ub dimers were detected by Western blotting using an anti-Ub antibody. Free Ub (Ub) and Ub dimers (Ub2) are indicated on the right side of the figure. For the K11R mutant, no new Ub dimer formation was observed when His-UBC22 protein was added. Due to slight impurity, there was one weak band in the recombinant K11R protein which is slightly higher than the Ub dimer synthesized from the wild-type Ub and other Ub mutants. Three independent experiments were performed and had similar results (Figure from Wang et al., 2016; Figure 6 in the manuscript: http://jxb.oxfordjournals.org/content/early/2016/04/10/jxb.erw142.full[href=http://jxb.oxfordjournals.org/content/early/2016/04/10/jxb.erw142.full])."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}