{
  "id": 3693,
  "origin_website": "Cell",
  "title": "Protocol for oral transplantation of maternal fecal microbiota to newborn infants born by cesarean section",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nRecruitment of mothers\nTiming: 1–2 days per potential participant\nPotential participants are informed about the study and, if wishing to participate, written consent is collected.\nContact potential participants at least 2 weeks prior to elective cesarean section.\nInformation leaflet is given to all interested at maternity outpatient clinic.\nInterested subjects are contacted by a healthcare professional associated with the study (study nurse or study physician) who provides information about the study and answers potential questions.\nInformed consent from the potential participant.\nThose who are committed to joining are met by a healthcare professional associated with the study (study nurse or study physician).\nIf a study physician is not present and a discussion with a physician is required, this is performed through phone or via a face to face appointment.\nIf study eligibility criteria are met and the mother is willing to participate, written consent is collected.\nCritical: Exclusion criteria include a chronic disease (excluding asthma), known positive GBS status, travel abroad within 3 months of planned delivery or a maternal course of antibiotics within 3 months of planned delivery.\nHealth screening\nTiming: 1–2 weeks\nSubjects are screened for potential pathogens. Besides the screenings suggested here, all screening processes should take into account local fecal transplantation screening guidelines and adjusted to cover pathogens causing neonatal infections locally.\nAfter written consent, the study participants (mothers) are screened in two phases.\nFirst, noninvasive perianal swab samples are gathered either by the study nurse or at a laboratory station for the screening of GBS, ESBL, and MRSA analyzed according to local laboratory protocol.\nSecond, if the study participant is negative for swab-screening she is screened for other pathogens.",
    "A blood sample is collected in a routine laboratory for the screening for human immunodeficiency virus, human T-cell lymphotrophic virus, Treponema pallidum, and hepatitis A, B, C, and E.\nFecal samples are collected at home in test tubes (included in the protocol of the laboratory performing the screening analytics) by the participant and taken by the participant or the study nurse to a routine laboratory in room temperature (15°C–25°C) for the screening for protozoa and helminths, Entamoeba histolytica, Clostridioides difficile, enteric pathogens (Salmonella, Shigella, Campylobacter, Vibrio cholerae, pathogenic Escherichia coli strains EHEC, ETEC, EPEC, EIEC, EAEC), Listeria monocytogenes, Helicobacter pylori, norovirus, Giardia lamblia, Cryptosporidium parvum, MRSA, MDR, and VRE. The protocol was initiated before the SARS-CoV-2 pandemic and should now include screening for SARS-CoV-2.\nAs a part of the fecal sample screening, a part of the fresh sample taken for screening is collected for preparation of the transplant and taken to the research laboratory and prepared at room temperature (15°C–25°C) (see: Preparing the transplant[href=https://www.wicell.org#sec3.3]).\nIf the study participant is positive for any of the screened pathogens she is informed about the specific finding, excluded from the study, and the prepared transplant discarded.\nPreparing the transplant\nTiming: 30 min\nA fresh fecal sample from the mother is processed as soon as possible and within 6 h of donation (at least one week before elective cesarean section), prepared and frozen (“transplant”). The glycerol and NaCl are degassed during autoclavation.\nMix 1.76 mL of 85% pharmaceutical grade sterile glycerol and 13.24 mL of sterile NaCl (9 mg/mL) in a sterile tube in the laminar flow cabinet (see Materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nWeigh the fresh fecal sample.",
    "100 mg of the fresh fecal sample is added to the 15.0 mL NaCl-glycerol mixture with a sterile wooden stick in a hood (anaerobic hood is desired) and mixed thoroughly by vortexing.\nIf any larger fecal particles are present after vortexing they can be left to precipitate. While pipetting the transplant avoid these larger particles.\nAdd 0.5 mL of the mixture to a sterile cryotube and label “transplant” with date and study code of the mother.\nThe transplant (max 3.4 mg of fecal matter) and leftover product are frozen immediately after preparation at −80°C.\nStore both the leftover unprocessed fresh fecal sample (as a safety reference), the rest of the processed fecal sample and the transplant in −80°C until cesarean section and fecal microbiota transplantation (FMT, within one month of sample collection).\nScreening evaluation\nTiming: 15 min\nWhen the routine laboratory results for screening are anticipated, they are checked and if positive for any pathogen, the study participant is excluded, and the transplant and other remaining samples discarded. This is double checked 24 h prior to elective cesarean section.\nStudy physician checks all screening results 24 h prior to elective cesarean section\nIf any pathogen tests positive, the FMT is cancelled and the transplant and other remaining samples are discarded.\nIf any screening test is unanswered, the FMT is cancelled and the transplant and other remaining samples are discarded.\nStudy nurse contacts delivery ward and informs that she (or study physician) will be present at delivery/immediately after delivery to perform the FMT.\nStudy nurse contacts mother to remind her to stimulate lactation by pumping, collecting any milk in a refrigerator and taking it with her (in a cooler) to the delivery the next day (as is customarily in routine protocol of a delivery ward).\nPreparing the FMT\nTiming: 10 min",
    "On the day of the elective cesarean section, the transplant is thawed and mixed with mother’s milk (pasteurized bank milk or mother’s own milk).\nFrozen transplant is collected from the lab and kept frozen while taken to the delivery ward.\nThe study code of the transplant is checked with the identity of the mother coming to cesarean section.\nAfter delivery, as close to first feeding as possible, the transplant (0.5 mL including max 3.4 mg of fecal matter) is thawed immediately by hand-warming before mixing with mother’s milk and administering the milk.\nThe mother’s own milk is used to which, if needed, pasteurized bank milk is added to reach a volume of 5 mL in a separate sterile test tube.\nDraw up 0.5 mL of transplant with syringe and add to 5 mL of milk. Mix thoroughly with syringe.\nPerforming the FMT\nTiming: 30 min\nTransplant is given to the healthy newborn in mother’s milk by an experienced nurse/midwife (study nurse) as a part of the infant’s first feeding within 2 h of delivery.\nBefore performing the transplantation make sure that screening results have all been marked negative by the study physician.\nBefore feeding (typically 1.5 h after delivery), ask for an assessment of the infant’s clinical situation from the midwife treating the infant.\nIf the infant has any abnormal clinical symptoms (e.g., grunting possibly associated with transient tachypnea of the newborn) the FMT is cancelled and the transplant and other remaining samples are discarded.\nMilk including the transplant (5.5 mL) is drawn in sterile syringe and warmed in a water bath to 30°C.\nThe infant is swaddled by the study nurse.\nWhile carried in an upright position, the newborn is fed according to the normal feeding protocol for first feeding.",
    "Ask for the midwife taking care of the infant to make a note of the transplant in the health record of the infant.\nCritical: Screening is a crucial part of the protocol. It is imperative that screening results have been evaluated by the study physician. Transplantation shall not proceed if results are pending or positive.\nFollow-up after FMT\nTiming: 2 days\nThe infant should be observed for two days on the antenatal care ward.\nFever is measured four times a day.\nA blood sample is taken for the laboratory assessment of routine infection markers (WBC, C-reactive protein) at 2 days of age before discharge.\nIf infection markers are within the normal range, regular follow-up according to the hospital protocol is sufficient.\nMicrobiota development and clinical outcomes are followed up according to the study hypotheses and protocol."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Metabolism",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}