{
  "id": 10732,
  "origin_website": "Jove",
  "title": "Magnetic Levitation Coupled with Portable Imaging and Analysis for Disease Diagnostics",
  "procedures": [
    "Ethical Statement: All procedures involving human blood samples were carried out according to the institutional regulations. All protocols were reviewed and approved by the Institutional Review Board. An informed consent was given by all participants.\n1. Sample Preparation for Sickle Cell Disease Diagnosis5,8\nPrepare a 50 mM solution of gadobutrol in Hank's Balanced Salt Solution (HBSS).\nDissolve 10 mM sodium metabisulfite in the gadolinium solution.\n\tNOTE: Sodium metabisulfite is toxic by inhalation and strongly irritates skin and tissue. It is a corrosive acid when mixed with water. It may decompose to emit toxic oxide fumes of sulfur and sodium when heated to high temperature.\nObtain blood sample via either fingerstick or venipuncture.\nDraw blood using a lancing device with a clean, disposable lancet. Apply pressure near the pierced site and wipe the blood droplet formed three to four times before collecting blood using a pipette; take care not to \"milk\" the finger by squeezing the tissue, as this will result in contamination of the sample with tissue fluid.\nAlternatively, draw blood using standard venipuncture procedures14.\n\t\tNOTE: If samples will be stored for more than a few hours, collect the blood into a vacutainer with an anticoagulant such as EDTA.\nAdd less than 1 µL of blood to 100 µl of the gadolinium-sodium metabisulfite solution.\n2. Sample Preparation for WBC Cytometry7\nObtain blood sample via either fingerstick or venipuncture, as in section 1.\nOptional: Lyse RBCs with an RBC lysis buffer. Pipette 5 µL of blood into 500 µL of RBC lysis buffer and incubate at room temperature for 3 - 5 min.",
    "NOTE: this may be done to confirm the levitation range of an isolated population of WBCs. However, it is not necessary to perform this step, as the results presented here demonstrate that RBCs levitate at a distinctly lower position than WBCs.\nDilute whole blood 1:1,000 in 25 mM Gd in HBSS\n\tNOTE: if cell lysis was performed, dilute the lysed sample 9:1 lysed sample:250 mM Gd to obtain a sample containing 25 mM Gd.\n3. Analysis of Samples Using the Magnetic Levitation Platform4,5,6,7,8\nStart the magnetic levitation device:\nFor the self-contained device, plug in the device, allow it to power up, and place on a flat, level surface.\nFor the smartphone-compatible version, launch the smartphone application and swipe left to enter image capture mode, and place on a flat, level surface.\nFor static magnetic levitation:\nLoad the prepared sample into a square glass microcapillary tube by dipping the end into the solution and allowing the sample to fill the capillary via capillary action.\nSeal the end with a tube sealant by slowly pushing one end the capillary into the material.\nInsert the capillary between the magnets of the magnetic levitation device so that only 1 cm of the tube remains visible (please see Figure 3 for an illustration the sample preparation) .\n\t\tNOTE: This step remains the same for both the smartphone-compatible and self-contained device.\nWait 10 min without disturbing the device or the capillary.\nFor flow-assisted magnetic levitation:\nLoad the sample into the sample tube.\nConnect the inlet tubing between the sample container and microcapillary and connect the outlet tubing between the microcapillary and waste container.\nSet the LED intensity and flow parameters.",
    "Ensure that cells are visible in the field of view, then press the capture button to capture an image (button 3 on the self-contained device and the camera button on the bottom of the screen in the smartphone application).\n\tNOTE: If a USB is used to store the images, create a folder called \"images\" and insert the USB prior to turning on the device. If no drive is present, the device will store the images in its internal memory and transferred later.\n\tNOTE: Several images may be captured and analyzed to reduce the risk of anomalies by moving the capillary in or out about ½ cm between image capturing.\n\tNOTE: If the number of cells within the field of view is too high or too low (as detected and reported on the user interface), shift the capillary in or out of the device or prepare another sample.\nRemove the sample and discard the sample according to the institutional or local regulations. Capillaries should be disposed as a sharp.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55012/55012fig3.jpg",
    "Figure 3: Sample Preparation and User Interface. (a) The sample preparation procedure involves lancing the subject's finger, forming a droplet of blood, transferring the blood drop to the sample testing solution, agitating the sample and loading into a capillary tube via capillary action, and inserting the sample into the magnetic levitation device. (b) These sample preparation steps are also displayed on the screen of the device to guide sample preparation. (c) The device includes four buttons: a button to zoom into the sample image in order to properly adjust the focus using the adjustment knob; a button to obtain a single measurement (a 5 s delay is implemented to allow time for the user to insert the sample); a time-lapse measurement (6 images are taken at 5 s intervals); and a button to power off the device after use. Reproduced, with permission, from Yenilmez, et al. 8Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55012/55012fig3large.jpg]\n4. Image Analysis4,5,6,7,8\nRun the image analysis software included on the device for the appropriate sample (cell distribution or cell type separation).\n\tNOTE: For the self-contained device, the analysis is performed automatically and displayed on the graphical user interface. For the smartphone-compatible device, to perform the analysis, go to the gallery and select the desired video file to be analyzed.\nObserve and record the output of the analysis displayed on-screen.\n\tNOTE: For cell distribution analysis (such as sickle cell disease diagnosis), the output will be the width of confinement of the cell population.",
    "NOTE: For cell type separation (such as WBC identification), the output will be an image with the WBC population identified. In order to calculate the number of cells per microliter, multiply the average number of WBCs per image by a factor of 2,000. For example, if 5 WBCs were observed, this would indicate 10,000 WBCs/µL. The normal range is generally considered to be 3,500 - 11,000 WBCs/µL.\nRepeat the analysis by moving the sample tube in or out of the device about ½ cm and capturing another image to be analyzed as described above.\n\tNOTE: It is recommended to repeat the analysis 5 - 6 times per sample to avoid errors.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}