{
  "id": 5637,
  "origin_website": "Bio",
  "title": "Multiplex Gene Editing via CRISPR/Cas9 System in Sheep",
  "procedures": [
    "sgRNA design   Select specific target sites in sheep genome and then design sgRNA-oligo sequence.   After design of sgRNA-oligo sequence, appropriate adaptor sequences should be added for cloning. The upstream primer of both pUC57-T7-gRNA vector and PGL3-U6-gRNA should include 5’-TAGG-3’ adaptor sequence, while the downstream primer for both should contain an adaptor with the sequence of 5’-AAAC-3’.      Construct sgRNA-Cas9 plasmid   Digest the PGL3-U6-gRNA vector and pUC57-T7-gRNA vector by BsaI. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170630/20170630015405_7700.jpg    Incubate at 37 °C for 3-4 h.   Purify the digested vector using DNA Gel Extraction Kit.   Double-strand sequences and prepare double-strand oligo DNA reaction system: table:\n﻿0,1,2\nMSTN:,sgRNA1:,5’ CCAACTGTGGATATATCTGAGAC 3’\n,,5’ GTCTCAGATATATCCACAGTTGG 3’\n,sgRNA2:,5’ GGATTTTGAAGCTTTTGGATGG 3’\n,,5’ CCATCCAAAAGCTTCAAAATCC 3’\nASIP:,sgRNA1:,5’ CCAGAGATGAAAGGAACCTGAAG 3’\n,,5’ CTTCAGGTTCCTTTCATCTCTGG 3’\n,sgRNA2:,5’ CAATTCTTCCATGAACCTGTTGG 3’\n,,5’ CCAACAGGTTCATGGAAGAATTG 3’\nBCO2:,sgRNA1:,5’ CCATGCATTGCACCGCTTCTAAC 3’\n,,5’ GTTAGAAGCGGTGCAATGCATGG 3’\n,sgRNA2:,5’ GGTCGTCTCAGCTCGAGTCCAGG 3’\n,,5’ CCTGGACTCGAGCTGAGACGACC 3’",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170630/20170630020212_9811.jpg    Perform PCR using the following cycling conditions: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170630/20170630020254_3619.jpg    Ligate the diluted double-strand oligo DNA with the PGL3-U6-gRNA vector digested by BsaI: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170630/20170630020432_2636.jpg    Incubate at 16 °C overnight.   Transform 1 µl of ligation product into 50 µl E. coli DH5α competent cells.   Pick up one colony and inoculate in a 15 ml tube containing 5 ml LB medium with 50 µg/ml ampicillin (4 colonies for each transformation). Incubate overnight in a 37 °C shaker.   Extract plasmids from transformed DH5α cells using Endo-Free Plasmid Mini Kit following the manufacturer’s instructions (see Supplement 1[href=https://en-cdn.bio-protocol.org/attached/file/20170627/20170627180736_3573.docx]).   Confirm the positive clones containing PGL3-U6-gRNA and pUC57-T7-gRNA by Sanger sequencing using M13R (-47) primer.      Cas9/sgRNA efficacy test in sheep fibroblast   Sheep fibroblasts were obtained from a 40-day-old fetus and then transported to the laboratory.   The fibroblasts are cultured for five passages in DMEM medium (Gibco) supplemented with 10% FBS (Gibco) and 1% penicillin-streptomycin (Gibco) until 80-90% confluence.   Cell transfection.   The transfection procedure is performed using Lipofectamine3000 reagent (Invitrogen) according to the specification (Table 1).   Table 1. The specification about transfection using Lipofectamine3000 Reagent (Invitrogen) imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182257_2648.jpg    Fibroblasts are separately transfected as followed types: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182341_6035.jpg      Dilute by adding 10 mg/ml of blasticidin S hydrochloride into the medium (1:1,000 dilution) 24 h after transfection.   Then incubate for 24 h at 37 °C.   Genomic DNA is extracted from fibroblasts at 72 h after transfection using a Universal Genomic DNA Kit.   Amplify targeted fragments using KOD polymerase, then purify with a PCR cleanup kit.   Primers used for amplifying Cas9/sgRNA targeted MSTN, ASIP and BCO2 fragment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182444_9283.jpg    Prepare the reaction mixtures as follows:  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182511_3939.jpg    Perform PCR using the following conditions [annealing temperature (T) and extension time (L)]. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182543_8079.jpg      The purified PCR products are denatured and re-annealed in NEBuffer 2 (NEB) using a Bio-Rad thermocycler.",
    "The PCR products are digested with T7EI for 30 min at 37 °C and separated by 2.5% agarose gel electrophoresis.    PCR products of mutations detected by T7EI cleavage assay are sub-cloned into T vector.   For each sample, the colonies are randomly picked and sequenced using an M13F (-47) to confirm the positive colony.      Off-target detection in sheep fibroblasts   Predict the potential off-target sites using SeqMap.   Extract sheep fibroblasts DNA for PCR amplification using specific primers (see Materials and Reagents).   Mix the reaction components according to the follows: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182655_3572.jpg    Perform PCR using the following conditions [annealing temperature (T) and extension time (L)]. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182748_1857.jpg      The PCR products are then subjected to a T7EI cleavage assay as described above and results below (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702182813_9693.jpg Figure 1. Detection of the sgRNA:Cas9-mediated oﬀ-target cleavage of MSTN, ASIP, and BCO2 by using the T7EI cleavage assay. The PCR products of the potential oﬀ-target sites in MSTN, ASIP, and BCO2 sgRNA:Cas9 loci from sheep fibroblasts (A and B). 17 predicted oﬀ-target sites that were most homologous to MSTN, ASIP, and BCO2 sgRNAs were named OT1 to OT17. C and D. Detection of the sgRNA:Cas9-mediated oﬀ-target cleavage of MSTN, ASIP, and BCO2 by using the T7EI cleavage assay. More messages see Wang et al. (2016)[href=http://xueshu.baidu.com/s?wd=paperuri%3A%28dc218e6f24b731720a0a6c3e1f1ec64b%29&filter=sc_long_sign&tn=SE_xueshusource_2kduw22v&sc_vurl=http%3A%2F%2Fwww.nature.com%2Farticles%2Fsrep32271&ie=utf-8&sc_us=8203702618793181538].      Zygote collection Note: Healthy ewes (3-5 years old) were selected to be desired donors for zygote collection which include regular estrus cycles.   Zygote collection and treatment of donors are conducted as earlier described in goats (Wang et al., 2015).    Collect one cell stage zygotes (around 10-16 h after the last insemination) using a surgical way and immediately transfer the collected zygotes into a TCM199 medium.",
    "Efficient detection of sheep zygotes   Microinject the sgRNA & Cas9 mRNA into sheep zygotes using an Olympus micromanipulation system ON3 in a manipulation medium TCM199 on the heated platform. Note: Mix Cas9 mRNA (20 ng/µl) and sgRNAs (5 ng/µl for each sgRNA) targeting MSTN, ASIP and BCO2.   Inject the sgRNA & Cas9 mRNA into the cytoplasm of fertilized oocytes using an Eppendorf FemtoJect system with the following set-up. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702183511_9154.jpg    The embryos are cultured for 168 h at 38.5 °C in Quinn’s Advantage Cleavage Medium and Blastocyst Medium (Sage Biopharma).   Blastocyst embryos are used for efficient detection preserved in PBS.   Genomes of embryos are amplified using REPLI-g Single Cell Kit.   Targeted fragments are amplified as described above including primers, reactions and procedures.   Purification of PCR products, T7EI cleavage assay, and Sanger sequencing are performed according to Wang et al. (2015).      Production of gene-modified sheep Note: Gene-modified sheep and control animals were fed the same diet, and managed at the same conditions throughout the experiment.   Select the surrogate ewes with their natural estrus cycles as gist.    Zygote collection and treatment of donors are conducted as described above.    The zygotes are cultured for 24 h at 37 °C using Quinn’s Advantage Cleavage Medium (Sage Biopharma).   Then culture the zygotes in Quinn’s Advantage Blastocyst Medium (Sage Biopharma) at 37 °C, 5% CO2 and saturated humidity.   About 3-4 divisive embryos are transplanted into the ampullary-isthmic junction of the oviduct of the recipient ewes.   Pregnancy normally takes about 150 days in Tan sheep, and is determined based on the observation of estrus behaviors in every ovulation cycle.",
    "Efficiency detection in Genetic-modified sheep   Jugular venous blood samples and tissues are collected from randomly selected genetic-modified sheep (n = 10) and randomly selected control animals (n = 10) at 240 days of age for blood and tissues chemistry analyses.   Genomic DNA is extracted from blood and tissues using corresponding assay from the University Genomic DNA Kit.   Targeted fragments are amplified as described above in off-target detection in sheep fibroblast (including primers, reactions and procedures) (Procedure D).   T7EI cleavage assay and sequencing are performed as previously described (step C9).   The results may confirm the mutation in gene-modified sheep. (Figure 2)  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702183809_6632.jpg Figure 2. Evaluation of sgRNA:Cas9-mediated genetic modifications in lambs. A. PCR products of the targeted region of the MSTN, ASIP, and BCO2 genes of founder sheep co-microinjected with a mixture of Cas9 mRNA and sgRNAs. D2000 DNA marker was used as a marker reference. B. Detection of sgRNA:Cas9-mediated on-target cleavage of the MSTN, ASIP and BCO2 genes by using a T7EI cleavage assay. All PCR products from (A) were subjected to the T7EI cleavage assay. C. Sequencing results of the modified MSTN, ASIP and BCO2 loci that were detected in the founder animals. Target sequences complementary to sgRNAs of targeted genes are in red text, while the PAM sequences are marked in green. The mutations are marked in blue, dashlines indicates deletions, and lowercase indicates insertions or replacements. Insertions (+), deletions (-), mutations (m) is shown to the right of each allele. The genotypes are shown to the right with the rates of total clones for TA-sequencing. For more information see Wang et al. (2016)[href=http://xueshu.baidu.com/s?wd=paperuri%3A%28dc218e6f24b731720a0a6c3e1f1ec64b%29&filter=sc_long_sign&tn=SE_xueshusource_2kduw22v&sc_vurl=http%3A%2F%2Fwww.nature.com%2Farticles%2Fsrep32271&ie=utf-8&sc_us=8203702618793181538].      Germline transmission detection   Germ cells from the testis of the three founders (#28, #33, and #37) were obtained by using biopsy forceps.   The genomes of germ cells are amplified using REPLI-g Single Cell Kit.",
    "PCR products with mutations are detected using the T7EI cleavage assay, followed by Sanger sequencing."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}