{
  "id": 9387,
  "origin_website": "Jove",
  "title": "Measuring Changes in Tactile Sensitivity in the Hind Paw of Mice Using an Electronic von Frey Apparatus",
  "procedures": [
    "Macalester College's Institutional Animal Care and Use Committee (IACUC) approved all protocols. 8-12 week-old male ND4 Swiss mice were used for these experiments.\n1. Bothrops jararaca Venom Preparation and Injection\nCAUTION: B. jararaca venom is toxic. Wear gloves, mask, and eye protection when handling the powder and preparing solutions.\nAdminister 45 µg/kg B. jararaca venom (regimen determined by earlier dose-response experiments) or 0.9% saline vehicle (10 µl) via intra-plantar injection into both hind paws using 3/10 ml insulin syringes with 29 G x 1/2 in needles. Note: Depending on experimental design, treatment and control solutions can be separately injected into each hind paw respectively to provide internal controls within each subject.\n2. Electronic von Frey Apparatus Setup and Operation\nPlace the electronic von Frey unit onto the probe stand. Ensure that the probe and cable are appropriately connected to the display unit, and turn the instrument on. Set the readout to zero (0.00 g) in the setup mode, and gently place the provided test weight (5.00 g) onto the cone of the von Frey probe.\nRecord the readout in a laboratory notebook, and repeat this procedure upon finishing the testing session. If there is a discrepancy greater than 0.20 g between your test weight readouts before and after the testing session, or if the readout fluctuates once the test weight is applied, recalibration of the apparatus (by the manufacturer) may be necessary.",
    "To assess withdrawal threshold of the mouse hind paw, use the appropriate polypropylene tip from among those supplied with the probe. Tip choice depends on the tissue being probed. Rigid tips work well for the less sensitive, tougher hind paw tissue while semi-flexible tips may be a better choice for a more tender area such as the ano-genital ridge (Chatterjea, unpublished). Gently mount the rigid tip onto the cone of the probe.\nTo record the maximum applied pressure, switch the operating mode from setup to operation such that the maximum applied pressure will be recorded on the display. In this mode, the maximum applied pressure readout will be saved on the display screen when the probe is retracted.\n3. General Considerations for Hind Paw Withdrawal Threshold Assessment\nIdeally, two investigators are needed to measure hind paw withdrawal threshold (mechanical sensitivity) using an EvF apparatus - one to operate the apparatus and carry out the measurements, and another to transcribe the recorded measurements and handle mice.\nIn order to reduce bias, the investigator operating the apparatus should be blinded to treatments and to the recorded withdrawal threshold values. Furthermore, to ensure consistency between measurements, the same individual should assess all baseline and experimental withdrawal thresholds.\nPerform all measurements in a quiet, temperature-controlled room, and at the same time of day14.\nThe experimenter recording measurements should place each mouse into individual chambers of multiunit polymethyl methacrylate (PMMA) housing set on a mesh floor stand. Cover the chambers with perforated PMMA lids, and place a heavy object on top, to prevent mice from escaping. Place absorbent material below the stand to absorb/collect excreted waste. Allow mice to acclimate for 15 min in chambers prior to baseline or experimental withdrawal threshold assessment 6,7,10.",
    "The hind paws of the mice have to be easily accessible through the openings of the mesh floor; therefore, place the mesh floor stand at a comfortable height on a cart with brakes, or on a steady benchtop that is accessible from all sides.\nDuring measurements, mice may have to be distracted with a food pellet15 placed just outside the measurement chamber or a very slight noise produced by tapping or running a pen along the wire mesh of the floor of the chamber before, but not during, the measurement. This induces the mouse to hold still enabling the experimenter to begin taking measurements more easily.\n4. Baseline Hind Paw Withdrawal Threshold Assessment\nThe first set of baseline measurements should be performed 48 hr prior to administering treatment. Zero the probe upon mounting the rigid tip. Using two hands, raise the probe slowly to stimulate the middle (footpad area) of either the left or the right hind paw (if both paws received the same treatment).\nIncrease pressure gradually until defined nociceptive response behaviors such as hind paw retraction, hind paw licking, or four-paw jumping6,10 are observed. Instruct the other investigator to transcribe the pressure that elicited the observed behavior.\nMeasure the withdrawal threshold of the mouse situated in the adjacent chamber. Continue until you have assessed withdrawal thresholds of each mouse once. Repeat another four times, so that each mouse is measured 5x as previously described10.",
    "For each mouse, calculate the median value of the 5 measurements, and then calculate how much each value deviates from the median. Select 3 values that deviate the least, and average them to obtain a baseline withdrawal threshold as previously described10. In this demonstration, measurement has been standardized by using 3 out of 5 values; while the specific numbers of measurements can vary by experimental design, it is important to ensure that all mice are poked an equal number of times to assess baselines.\nRepeat the baseline measurements 24 hr later. Take 5 measurements per mouse, and average the 3 that are closest to the median to obtain a baseline withdrawal threshold.\nTo calculate the average baseline withdrawal threshold of a mouse, average its baseline withdrawal thresholds taken at 48 and 24 hr prior to treatment. If the average baseline withdrawal threshold is below 3.50 g, or if the two baseline thresholds differ by 2.00 g or more, exclude the mouse from the experiment. These criteria ensure that all mice in the experiment have consistent baseline responses, and sufficiently high baseline withdrawal thresholds that allow observing lower thresholds following treatment.\nNote: The exclusion threshold will depend on the tissue being probed, the strain of animals studied, and the type of tip used. For example, we have found 3.5 g to be a useful benchmark for ND4 hind paw tissue but more tender areas such as the ano-genital ridge need a lower exclusion threshold (Chatterjea, unpublished).\nAssign mice into treatment groups so that the average withdrawal baseline of the experimental groups is as similar as possible before treatments are administered.",
    "Note: Baseline measurements can be performed prior to 48 hr before an experiment. However, at least 2 sets of baseline measurements at regular intervals before the start of treatments should be completed.\n5. Experimental Hind Paw Withdrawal Threshold Assessment\nAssess hind paw withdrawal threshold (mechanical sensitivity) following treatment at appropriate time points determined by the design of the experiment. Return mice to their cages with access to food and water promptly after measurements are completed.\nFollow steps outlined above; take 3 instead of 5 measurements to decrease the possibility of over-stimulating the (treated) hind paw tissue especially if sensitivity is to be assessed at multiple time points. If any two measurements out of the taken three differ by more than 2.00 g, take a fourth measurement.\nCalculate the average of 3 measurements to obtain experimental withdrawal threshold for each mouse. For any mice for which 4 measurements were taken, compute the average of three that deviate least from the median, in order to obtain experimental withdrawal threshold.\nTo obtain delta withdrawal threshold for each mouse at a particular time point, subtract the baseline from the experimental withdrawal threshold. Repeat for all mice and all experimental time points9.\nPerform appropriate statistical analysis on collected data. Here we used JMP 9.0 (SAS, Cary, NC) to carry out One-way ANOVA and Tukey HSD post hoc analysis."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}