{
  "id": 10551,
  "origin_website": "Jove",
  "title": "Stiffness Measurement of Soft Silicone Substrates for Mechanobiology Studies Using a Widefield Fluorescence Microscope",
  "procedures": [
    "1. Fabrication of Soft Silicone Substrate\nWeigh out 1.75 g of the A component and 1.75 g of the B component (A:B = 1:1) from the soft silicone elastomer kit using (polystyrene) weighing trays.\nAdd the A component to the B component in the weighing tray and mix them together for 5 min using an appropriate applicator stick.\nAdd the above mixture to a 35 mm Petri dish. Allow the mixture to spread evenly across the Petri dish for a couple of minutes.\n\tNote: The choice of the Petri dish diameter and the amount of soft silicone will determine the soft silicone thickness. Here, the thickness will be around 3.5 mm; more about choosing the elastomer thickness in the Discussion section.\nPlace the Petri dish with the silicone mixture, with the lid off, in a vacuum chamber for 15 min to remove any air bubbles. During this time, pre-heat a hot plate to 70 °C.\nOnce the hot plate reaches 70 °C, place a glass slide on it and then place the Petri dish with the silicone mixture on the glass slide. Let the silicone cure at 70 °C for 30 min. Do not place the polystyrene dish directly on the hot plate, as the Petri dish may melt.\n2. Coupling of Fluorescent Microbeads to the Soft Silicone\nPlace the cured soft silicone (in the uncovered Petri dish) in a deep UV chamber (an enclosure with a deep UV lamp of light wavelengths of 185 and 254 nm). Expose the soft silicone sample (~5 - 10 cm away from the UV lamp) to deep UV light for 5 min.",
    "While the silicone is being exposed to deep UV light, proceed with steps 2.2 - 2.6 below. After the deep UV exposure, degas the deep UV chamber for at least 5 min before retrieving the sample.\nIn the meantime, weigh out 19 mg of 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide (EDC) in a 1.5 mL microcentrifuge tube and add 500 μL of deionized water (DI) water to it. Dissolve the EDC by gently shaking the tube.\nIn a separate 1.5 mL microcentrifuge tube, weigh out 11 mg of N-hydroxysulfosuccinimide (sulfo-NHS), add 500 μL of DI water to it, and dissolve the sulfo-NHS by gently shaking the tube. Then, combine the EDC and sulfo-NHS solutions in a single microcentrifuge tube.\nTo this EDC/sulfo-NHS solution, add 30 μL of 0.44 μm diameter red (or any other fluorescence color based on the filter cubes available in the fluorescence microscope) carboxylate modified fluorescent microbeads (with a 1% w/v stock concentration).\nTo the EDC/sulfo-NHS/bead mixture, add 0.02 mg of collagen I (from a rat tail, stock concentration of 4 mg/mL in 0.02 M acetic acid) to obtain a concentration of about 0.02 mg/mL.\nVortex the EDC/NHS/bead/collagen I mixture briefly to ensure that the beads are evenly dispersed throughout, before coupling.\nPipette 1 mL of the EDC/NHS/bead/collagen I mixture on a piece of parafilm placed on top of another shallow, flat lid (of smaller diameter). Invert the Petri dish with soft silicone on this mixture so that the soft silicone surface contacts the mixture but does not directly touch the surface of the smaller Petri dish lid below. To raise the inverted Petri dish, use one or two glass slides under either side of the inverted Petri dish spacers.\n\tNote: Please refer to Figure 1 to see how step 2.7 is performed.",
    "Cover the sample with aluminum foil and incubate it at room temperature for 30 min.\nRemove the Petri dish with soft silicone and set it upright (silicone-side up).\nWash the soft silicone surface with phosphate-buffered saline (PBS) by adding 2 mL of PBS (pH 7.4) to the dish. Let it sit for a couple of minutes. Aspirate off the PBS and wash the silicone again with 2 mL of PBS. Let the silicone cure further for about a day. For that reason, place the soft silicone sample in PBS at 37 °C overnight.\n3. Measurement of Silicone Stiffness with Sphere Indentation using a Widefield Fluorescence Microscope\nRetrieve the Petri dish with soft silicone and ensure that it contains at least 1 mL of PBS to have the silicone surface several mm below the liquid surface.\nUsing pointed tweezers, drop five 1 mm zirconium sphere indentors on the soft silicone. Immerse the spheres into the liquid medium and drop them, away from the edges of the silicone layer and at least 5 indentor diameters away from the location of the other indentors.\n\tNote: When dropped above the liquid surface, the spheres may fail to enter the liquid medium (float) due to the liquid medium’s surface tension.\nPlace the Petri dish with soft silicone on the microscope stage so that it is possible to image through the Petri dish base.\nUsing phase imaging with a 10X objective (such as a dry 10X objective of NA 0.30), locate and bring a sphere indentor into focus.\nTake a phase image of a part or the whole of the indentor and save this image. Use a tile scan if available. If the indentor has any visible defects, discard and replace it with another indentor.",
    "Under live phase imaging, pan to the left of the indentor’s edge so that the left edge of the frame is at least a distance of ~1.5 R from the indentor center. Ensure that the center of the indentor remains visible on the right side, close to the right edge of the image frame. Take a phase image and save it.\nSwitch the microscope light source to the illumination for the red fluorescent channel. With the x- and y-coordinates unchanged (the x-y position of the indentor center within but near the right edge of the frame), focus down (decrease Z) until the red fluorescent microbeads under the sphere indentor’s center just go out of focus.\nTake a z-stack with an image for every z-increment of 0.5 µm till the microbeads in the top layer of the silicone far from the indentor (near the left edge of the imaging frame) go out of focus.\nRepeat steps 3.4 - 3.8 with the other indentors on the sample.\n4. Calculating the Silicone’s Stiffness (Young’s Modulus)\nOpen the phase image of the indentor using ImageJ, click on the line tool, and measure the indentor’s diameter in pixels. Click and hold on a point on the indentor edge, move the cursor to a diametrically opposite point on the edge and note the length in pixels displayed on the status bar of the ImageJ main window before releasing the cursor.\n\t\nEnsure that the unit of length is set to pixels by clicking Analyze | Set Scale and checking the Unit of length.\nConvert the indentor’s radius in pixels to μm by taking into account the objective magnification and the CCD camera pixel size (R in μm = R in pixels x the CCD camera pixel size in μm / the objective magnification).",
    "Open the red channel z-stack of microbead images (if the microbeads are red fluorescent) in ImageJ by clicking on File | Import | Image Sequence and select any image in the stack and click OK to open the stack.\n\tNote: F1 is the frame number at which the microbeads under the indentor center are in the best possible focus and F2 is the frame number at which the microbeads (at a region of ~1.5 R away from the bead center) near the left edge of the frame are in the best possible focus. The z-difference between the two frames is the indentation depth δ.\n\t\nUsing the line tool in ImageJ, draw a line across a well-defined microbead in the image. Click on Analyze | Plot Profile and click on the Live button to obtain the updated line scan intensity across the bead while selecting different frames. The frame that gives the highest value of the maximum intensity can be chosen as the frame in focus.\nSince the z-increment between the frames in the z-stack is 0.5 μm, calculate the indentation depth in μm as δ = (F2-F1) x 0.5.",
    "Calculate the force exerted on the gel by the indentor due to its weight (minus the opposing buoyant force), that is, the indentation force F, as the volume of the indentor x (the density of the indentor - the density of the liquid medium) x the acceleration due to gravity. Use the equation F = (4/3) x 3.142 x (R3) x (ρindentor­ - ρmedium) x g where R is the radius of the indentor, ρindentor is the density of the indentor, ρmedium is the density of the liquid medium and g is the acceleration due to gravity (9.81 m/s2). Express all quantities on the right-hand side in SI units to obtain F (in N).\nCalculate the Young’s modulus (E) of the silicone using a modified11 Hertz model12 equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57797/57797eq1.jpg\n\tWhere:\n\tc = a correction factor that modifies the Hertz model expression that follows it;\n\tv = Poisson’s ratio of the silicone gel (taken as 0.5 as for incompressible materials7);\n\tF = the indentation force;\n\tR = the indentor radius; and\n\tδ = the indentation depth.\n\tExpress all quantities on the right-hand side in SI units to obtain E in Pa.\n\t\nCalculate the correction factor c as follows3:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57797/57797eq2.jpg\n\t\tWhere:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57797/57797eq3.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/57797/57797eq4.jpg; and\nimgsrc://cloudfront.jove.com/files/ftp_upload/57797/57797eq5.jpg.\n\t\tIt should be noted that this correction factor is specifically to be used only when the soft silicone adheres well to the Petri dish (or stiff silicone) underneath it (which is the case here).",
    "Calculate the height h of the soft silicone layer based on the amount of silicone added and the Petri dish diameter. Alternatively, obtain h directly by determining the z-coordinate of the top and bottom surfaces of the silicone layer by phase imaging (minor impurities come into focus at either surface). Note that for a large h (h2 > Rδ), the correction factor c is close to 1.\nRepeat steps 4.1 - 4.4 for each indentor. Average the Young’s modulus obtained from each indentor to obtain the mean Young’s modulus for the silicone sample.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}