{
  "id": 5645,
  "origin_website": "Bio",
  "title": "[2-<sup>3</sup>H]Mannose-labeling and Analysis of N-linked Oligosaccharides",
  "procedures": [
    "For metabolic labeling of N-linked glycans, include a pulse and chase samples (usually 1 to 3) for each condition analyzed, and a negative pulse control sample, to be immunoprecipitated with a preimmune antibody. Here HEK293 cells grown in a 90 mm dish were used for each sample. Transfections of HEK 293 cells (about 2 x 106) were carried out according to the calcium phosphate method, 24 h before the experiment. Other transfection methods can be used.Remove growth medium from 90 mm dish, scrape the cells with complete DMEM and transfer into a 2 ml Eppendorf tube. Spin the cells (6 sec at 16,000 x g) and rinse with 2 x 1 ml of glucose-free medium. Starve the cells from glucose by incubation in 1 ml of freshly prepared pre-warmed (37 °C) glucose-free medium supplied with 10% dialyzed FBS and 4 mM sodium pyruvate for 30 min in a CO2 incubator at 37 °C (Figure 1). Leave the lid of the tube open during this and subsequent incubations at 37 °C. Labeling in Eppendorf tubes allows the use of small volumes of medium and radioactive precursor in the following steps. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170712/20170712004336_6451.jpgFigure 1. Flow chart of experimental procedureReplace the starvation medium with 1 ml of pre-warmed (37 °C) glucose-free medium containing 10% dialyzed FBS, 4 mM sodium pyruvate and 400 μCi of [2-3H]-labeled mannose (stock concentration 1 μCi/1 μl), and incubate the cells in a CO2 incubator at 37 °C for 1 h (pulse).",
    "Remove the labeling medium from each sample, and add 2 ml of PBS at 4 °C to the samples corresponding to pulse and place them on ice, while the samples corresponding to the chase are rinsed 3 times with 1 ml of pre-warmed (37 °C) normal complete culture medium, and then placed in a CO2 incubator at 37 °C with 1 ml of pre-warmed normal complete culture medium for the desired chase periods (usually 30 min to 8 h, depending on the turnover of the studied protein).Rinse the pulse samples 3 times with 1 ml of ice-cold PBS.Short-spin the cells at 16, 000 x g (6-10 sec), discard the supernatant and proceed with step 7 or freeze the cell pellet at -80 °C (for up to several months).Perform steps 5 and 6 also for the chase samples at the end of the chase time.Remove the cells from the freezer and lyse them by addition of 400 μl of buffer A, vortexing briefly and incubating for 30 min on ice.Centrifuge the lysates at 16,000 x g for 30 min at 4 °C. Transfer the supernatant to a new 1.5 ml Eppendorf tube and discard the pellet.For immunoprecipitation of the H2a glycoprotein shown in Data analysis, add 20 μl/sample of Protein A-Agarose beads 1:1 suspension and 5 μl/sample of rabbit polyclonal anti H2a antibody to the supernatant from step 9.Incubate the samples for 4-16 h at 4 °C, constantly mixing by slow rotation.Spin down the beads at 16,000 x g for 30 sec, and carefully remove the supernatant.Wash the beads by adding 500 μl buffer D and vortexing. Spin as in step 12 and remove the supernatant. Repeat the rinse 3 times.",
    "Add 20 μl denaturing buffer (supplied with the NEB endo-H kit) to the bead pellet and boil the samples for 5 min.Spin down the beads (16,000 x g for 30 sec), and transfer the supernatant into a new Eppendorf tube. Then 0.5 μl of endo-H enzyme is added to each sample along with 2 μl of the reaction buffer (also supplied with the NEB endo-H kit), and the samples are incubated at 37 °C for 3 h.To separate the released glycans from the protein, the sample is diluted 5 times with double distilled water (DDW) and placed on top of a molecular filter (Microcon Ultracel YM30), with a 30 kDa cut-off, then centrifuged at 14, 000 x g for 3 min (the filter must be washed with 0.5 ml DDW and centrifuged for 3.5 min at 14,000 x g prior loading the sample). Apply 100 μl of DDW to Eppendorf tubes containing the endo-H reaction and transfer to the corresponding molecular filter. Repeat centrifugation of the samples. This washout is repeated 1 more time, keeping the flow through (total throughput is about 300 μl).Check 10% in a scintillation counter (30 μl). If you get at least 100 cpm, proceed to next step. Less than this amount will give insufficient cpm for further analysis.Place the tube containing the endo-H reaction flow through (steps 16 and 17) in a SpeedVac concentrator, and dry the samples completely (this can be done up to 45 °C to accelerate this process, usually taking 1-2 h).To prepare the samples for the HPLC, resuspend the dry pellets in 12 μl of the HPLC solvent (acetonitrile:water, 63:37, 2.5% phosphoric acid).",
    "Adjust the HPLC device (connected to the Spherisorb column) to constant flow of the solvent (1 ml/min) and pressure (a value between 1,000 and 2,000 psi), and place a fraction collector to change a tube every 1 min.Load the samples into the HPLC device and start the fraction collector simultaneously.Collect 65 fractions of 1 ml from each sample run and from a run of a standard oligosaccharide mixture. We use a standard mixture prepared by glycoprotein metabolic labeling with [14C] and separation with endo-H (kind gift of Armando Parodi).Transfer 500 μl from each fraction to a scintillation vial, and mix the contents with 3 ml of water-miscible scintillation fluid (Opti-fluor).Load the vials and read in a scintillation counter using settings for [3H].The cpm readout is plotted as a function of fraction number.The cpm values within a peak represent a specific glycan species, identified according to the parallel run of the standard oligosaccharide mixture.The sum of cpm values for the fractions within each peak reflects the absolute amount of a specific glycan species. In order to compensate for the fact that species containing more mannose residues acquire more label, the ‘relative molar amount’ of each glycan species is calculated as follows: the absolute amount in cpm of each glycan species is divided by the number of mannose residues that it contains, resulting in a ‘relative molar amount’. This value is then divided by the sum of the relative molar amounts of all glycan species obtained, to obtain the ‘molar percent of total’ for each specific glycan species (Figure 2). An example of the use of this procedure is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170712/20170712004550_6894.jpgFigure 2. Example of calculation of relative molar amounts"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}