{
  "id": 17408,
  "origin_website": "Jove",
  "title": "Establishment of a Mouse Severe Acute Pancreatitis Model using Retrograde Injection of Sodium Taurocholate into the Biliopancreatic Duct",
  "procedures": [
    "All experiments involving animals were approved by the Animal Ethics Committee of Soochow University. All surgical procedures were performed under full anesthesia. Analgesics were not used to avoid interference with the natural course of the disease according to previous literatures28,29. Approval for the lack of analgesia was also granted by the Animal Ethics Committee of Soochow University.\n1. Preparation\nFast a C57BL/6 wild-type mouse 8-12 h before the surgery.\nPrepare 5% (w/v) TC solution (93 mM) diluted into 0.9% sodium chloride. Filter the solution through a 0.22 µm filter.\nAutoclave the surgical instruments and materials, including forceps, scissors, blade holder, needle holder, hemostatic clip, vascular clamps, and sterile drapes, using a pressure sterilizer at a temperature of 121 °C for 30 min.\nPrepare a homemade microsyringe. To do this, manually install a disposable insulin tip and a prolonged plastic pipette tip onto a 25 µL flat tip Microliter syringe. Sterilize through irradiation.\n2. Anesthesia and preoperative preparation\nWeigh 6- to 8-week-old male C57BL/6 wild-type mice (approximately 21-23 g). Induce general anesthesia with an intraperitoneal injection of 1% pentobarbital sodium solution at a dose of 50 mg/kg.\nFix the mouse in the supine position on anirradiatedfoam flat plate with the tape.\nPrepare the operation region of each animal by removing its fur with a depilation cream from the xiphoid process level down to the connecting line of the bilateral anterior superior iliac spine, with the left and right sides parallel to the front axillary line.\nPrepare a sterile surgical field with particular focus on the surgical area, consisting of the area prepared on the animal and the front of the surgeon.\n\t\nDisinfect the benchtop.",
    "Clean the incision site with multiple applications of surgical scrub solution. Wipe the skin two to three times with 0.5% iodophor and allow it dry for 1-2 min each time.\nCover the mouse with sterile drapes.\n3. Surgical procedure\nNOTE: Figure 1 depicts the anatomy and morphology of the mouse pancreas before and after retrograde injection of TC into the biliopancreatic duct by microinjection.\nMake an approximate 2 to 3 cm long median abdominal incision.\nLocate the duodenum from left to right along the stomach. Gently pull the duodenum out and to the left side using surgical forceps and a disinfectant-soaked cotton swab to expose the pancreas, the biliopancreatic duct, and the duodenal papilla. Take care not to injure the intestinal wall or related vessels.\nUse 8-0 sutures to pass through the connection between the duodenum and pancreas around the papilla, and pull them to the left side of the mouse body to fix the duodenum.\nGently pull the skin and the lower edge of the liver aside. Clamp the common hepatic duct, making sure not to clamp the portal vein or pancreas. Clamp the proximal biliopancreatic duct.\nPierce the microinjector into the distal biliopancreatic duct retrogradely. Fix the needle tip near the duodenal papilla with a clamp. Infuse 10 µL of 5% TC into the pancreatic duct at a rate of 5 µL/min.\nKeep the biliopancreatic duct closed for 5 min to achieve a stable pressure. Then, pull out the microinjector and remove the clamps.\nRestore the duodenum to the original anatomical position and check the bleeding.\nClose the wound with 6-0 sutures and disinfect with 0.5% iodophor.\n4. Recovery and postoperative management",
    "Recover the animals from anesthesia on a 37 °C thermal pad. Do not send the operated animals to the temporal postoperative room until all the animals have woken up.\nAdminister 0.8 mL of 0.9% saline subcutaneously and slowly for fluid supplementation.\nMonitor the animals postoperatively for their general condition and signs of infections or illness.\n5. Serological testing and histology evaluation\nAt 24 h post-operation, anesthetize the mice with pentobarbital sodium using the same dose and injection route.\nCollect all the blood from the abdominal aorta (about 0.8 mL per mouse) and spin at 1,500 x g for 15 min to isolate the serum for further testing.\nCollect the pancreas tissues.\nOpen the thoracic cavity to collect the lung tissues.\nMeasure the biochemistry function indexes from the serum, including amylase, lipase, liver function (alanine transaminase (ALT) and aspartate transaminase (AST)), and kidney function (urea and creatine), using commercial kits according to the manufacturers' instructions.\nHomogenize the lung and pancreas tissues and measure the myeloperoxidase (MPO) level using a commercial kit according to the manufacturer's instructions.\nOpen the thoracic cavity and perfuse with 20 mL of phosphate-buffered saline (PBS) twice, then collect the pancreas. Immerse into 4% paraformaldehyde solution for 24 h. Dehydrate in a series of alcohol concentrations and embed in paraffin.\nUse a microtome to prepare 5 µm thick pancreas tissue sections.\nPerform H&E staining for histological evaluation of the pancreas.\nEvaluate the pathological scores according to the criteria proposed by Schmidt et al.30.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}