{
  "id": 12138,
  "origin_website": "Jove",
  "title": "Development and Angiographic Use of the Rabbit VX2 Model for Liver Cancer",
  "procedures": [
    "The following protocol follows all requirements and guidelines mandated by the University of Illinois - Chicago. It was reviewed and approved by the local Institutional Animal Care and Use Committee prior to execution.\n1. VX2 Hind Limb Tumor Development\nProcure the VX2 tumor cell line from the National Cancer Institute Division of Cancer Treatment Diagnosis and Treatment Tumor/Cell Line Repository.\n\tNote: At this time, the order catalog can be found at the following link: https://dtp.cancer.gov/repositories/.\nTo prepare the cell suspension for injection, place the frozen VX2 sample and methylcellulose medium in lukewarm water until they have thawed.\n\t\nAspirate 0.5‒1 mL of the thawed cell suspension and an equal volume of thawed methylcellulose medium into a 5-mL syringe.\n\t\tNote: It may help to use a 21 or 22 G needle to aspirate the cell suspension and a larger gauge needle to aspirate the methylcellulose medium. Place the syringes on ice.\nPrepare the hind limb tumor donor rabbit for inoculation of cell suspension, starting with sedation using 1 mg/kg acepromazine and 0.02 mg/kg buprenorphine given intramuscularly. Shave the inoculation site (hind limb) with clippers and clean the shaved are with an alcohol- or iodine-based agent.\n\tNote: Meloxicam can be given at a dose of 0.2 mg/kg subcutaneously for analgesia. Rabbit fur is difficult to shave. It is recommended that the researcher perform multiple passes, first focusing on clearing a bulk of the fur and then pressing the clippers against the skin and going against the grain.\nAttach a 16 G needle to the 5-mL syringe containing the cell suspension and inject 1 mL of the suspension into the belly of the hind limb muscle of the donor rabbit, roughly 1 cm deep. Be sure to guard the sciatic nerve running within a palpable groove along the femur.",
    "Note: Fresh VX2 successfully inoculates 88% of subjects while frozen and thawed VX2 is only successful 33% of the time19.\n\tCAUTION: The VX2 tumor will grow quickly. Side effects that may be noted as the tumor progresses are: increased respiratory rate, lethargy, decreased alertness, and/or behavioral changes (e.g., unusual aggressiveness). Consequently, recommendations are to monitor the animals closely and to plan for tumor harvest within two weeks after inoculation.\n2. VX2 Hind Limb Tumor Growth and Harvesting\nNote: Assuming successful inoculation, there should be a palpable (3‒4 cm) tumor nodule at the injection site within 2 weeks. Usually, this nodule will be palpable around 1 week; however, it is better to let the tumor grow to allow for sufficient tissue collection. Typically, this nodule will be firm, indurated, and elevated above the level of the muscle. If\nPalpate the inoculated area at 2 weeks from inoculation. If no tumor growth is detected at 2 weeks, perform step 1 again. See Figure 1.\n\tNote: The presence of tumor can also be assessed via ultrasound. While there have been no studies to assess the difference in tumor growth metrics when propagated from frozen stock as compared to fresh stock, it has been our experience that the frozen stock tumor grows slightly slower and will be detectable after its fresh stock counter-part. Regardless, either method should yield a harvestable tumor by 2 weeks.\nPrepare the hind limb tumor donor for tumor harvest. Anesthetize the rabbit with 45 mg/kg ketamine and 5 mg/kg xylazine. Euthanize with an intravenous (IV) dose of sodium pentobarbital exceeding 390 mg/kg.\nOnce the rabbit has been euthanized, begin harvesting the tumor by removing the cutaneous and subcutaneous tissue overlying the tumor nodule using a scalpel with whichever size blade the researcher sees fit. See Figure 2.",
    "Once the tumor nodule has been identified within the hind limb muscle, remove the tumor en bloc using wide curvilinear margins. For this, cut the tendinous attachment points at the proximal and distal ends of the of the muscle and then trace the scalpel blade along the underlying bone. Bisect the explanted specimen exposing the tumor capsule and necrotic core. See Figure 3.\n\tNote: The VX2 tumor has a highly necrotic core. Be sure to use proper eye protection and other personal protective equipment when harvesting the tumor, since any damage to the tumor capsule can result in high pressure ejection of necrotic debris.\nGently scrape the necrotic core with a blunt object (e.g. forceps, hemostats) to clean the tumor. This should allow for better visualization of the tumor capsule and the transition point between capsule and surrounding muscle. See Figure 4.\nFrom this sample, harvest several pieces of tumor approximately 1‒2 mm3 and immediately store them in a cup containing room temperature sterile saline.\n\tNote: These tumor samples will be used for subsequent intrahepatic implantation.\nPlace the remaining tumor in a sterile Petri dish and bathe it with Dulbecco's Modified Eagle's Medium (DMEM). If this specimen is kept cold on ice, it can be preserved for handling up to 2‒3 h later.\n3. Liver Tumor Implantation via Laparotomy\nPrepare the recipient rabbit for laparotomy. Anesthetize the recipient rabbit using 45 mg/kg ketamine and 5 mg/kg xylazine for induction followed by intubation and maintenance with 1%--3% isoflurane as needed. When the rabbit is anesthetized, shave the surgical site using hair clippers. Clean the incision area using triplicate wash with betadine scrub, 70% ethanol solution, and betadine solution, and drape the abdomen in a sterile surgical fashion.",
    "Using a #15-blade, initiate the laparotomy by making a small downward vertical midline incision through the rabbit’s skin starting from the xiphoid process. This should be easily palpated and tends to be roughly the size of an American penny. See Figure 5.\nReflect the skin and identify the linea alba. This should be a reflective white band of tissue traveling inferiorly in the midline. Use blunt dissection to traverse the linea alba and expose the peritoneum. See Figure 6.\n\tNote: The peritoneum is easily identified since it will be directly overlying the bowel, which can be seen moving with respiration.\n\tCAUTION: The peritoneum tends to be adherent to the underlying bowel due to surface tension. Using blunt trauma to dissect the linea alba helps to dissipate the risk of perforating the underlying bowel.\nOnce the peritoneum is exposed, carefully dissect through it to enter the peritoneal cavity. The liver can now be identified. To better navigate the abdominal space, extend the midline incision 1‒2 cm inferiorly through the skin, muscle, and peritoneum.\n\tNote: Extending the midline incision can be easily and safely done by carefully inserting a curved hemostat into the peritoneal space with the curved tip facing superficially towards the peritoneum. Then open the hemostat slightly and use a blade to cute the tissue between the two arms of the hemostat.\nIdentify the left lobe of the liver in order to select a site for tumor implantation. The left lobe is infero-lateral to the medial lobe which sits in the midline.\nBefore attempting to draw the liver out of the peritoneal space, place a dry piece of gauze at the inferior aspect of the incision.\n\tNote: The gauze will provide an adherent surface to lay the liver on to prevent it from retracting back into the abdomen.",
    "Using either atraumatic forceps or a piece of wet gauze over the fingers, carefully draw the left lobe of the liver out of the abdomen through the incision and lay it down on the dry gauze placed earlier. See Figure 7.\n\tCAUTION: The liver capsule is sensitive and can easily rupture. It is critical to be gentle when handling this organ to prevent capsular bleed, liver bruising, and/or eventual hemoperitoneum.\n\tNote: Usually, the liver will declare itself visually upon entering the peritoneal space; however, if the rabbit’s stomach is distended, the liver can be pushed cranially out of sight. If this is the case, gently lift the abdominal wall using a blunt probe. In this scenario, the liver tends to adhere to the ventral aspect of the diaphragm due to surface tension so carefully separate the liver using a blunt probe and it should detach. Then use atraumatic forceps to draw the liver out.\nAt this point, prepare the tumor tissue for implantation and place a piece of wet gauze over the liver to protect it.\nSelect a 1‒2 mm3 piece of tumor tissue that was generated during step 2.6 for implantation into the liver. See Figure 8.\nUsing a #11-blade, puncture the liver tissue at a 45° angle making a 0.5 cm deep pocket, taking care not to penetrate the dorsal aspect of the liver capsule. Leave the blade in place after making the puncture. See Figure 9.\nGently lift the blade in a ventral direction to create a small pocket in the liver bed. Take the tumor piece using forceps, place the tumor piece in this pocket and then remove the blade.",
    "Note: The blade can be removed prior to inserting the tumor piece, however, the liver will bleed and this can obscure the puncture site making it difficult to identify.\n\tCAUTION: Be sure to minimize contact of the tumor with any other structures to prevent unintentional tumor seeding. This can also be avoided by setting aside any tools used to assist with implantation afterwards.\nAt this point, place a piece of hemostatic agent, such as gel foam, over the tumor pocket to promote hemostasis and to prevent ejection of the tumor piece.\nReturn the liver to the abdomen, once hemostasis is confirmed.\nClose the abdominal wall with 3-0 polydioxanone suture on a taper needle using a simple continuous stitch and close the skin with 4-0 polyglactin 910 sutures on a cutting needle using continuous subcuticular stitch.\n\tCAUTION: When closing the abdominal wall, take care not to damage the omentum or other bowel structures in a suture throw.\n\tNote: While this tumor will take at least 2 weeks to be definitively radiographically identifiable, it reaches a size of 1.5‒2 cm diameter at 3 weeks of growth. Be careful not to allow the hepatic tumor to grow past 3.5‒4 weeks since the tumor will form an exophytic mass and aggressively spread locally.\n4. VX2 Tumor Suspension Preparation\nPlace a 40 µm strainer into the mouth of a 50-mL conical propylene tube. Using the tumor from step 2.7, use a #15-blade to scrape the tumor surface to collect viable tumor and place these scrapings into the strainer.\nWash the viable tumor scrapings through a strainer using DMEM and then centrifuge the propylene tube at 1600 rpm for 8 min.\nAfter the centrifuge is complete, remove the supernatant and discard it. Then add methylcellulose to the remaining cell block at a 1:1 volumetric ratio.",
    "Inject this suspension into a hind limb donor rabbit following steps 1.3‒1.4. Place the remaining suspension into 1 mL aliquots in cryogenic tubes and freeze them in liquid nitrogen for later use.\n5. Angiographic Utilization of the VX2 Liver Tumor\nPrepare the rabbit as described in step 3.1.\nPalpate the femoral groove in the groin. When the groove has been identified, make a 2‒3 cm linear incision along the groove. See Figure 10.\nUsing blunt dissection, locate and isolate the femoral bundle containing the femoral vein, artery, and nerve. See Figure 11.\nAgain, use blunt dissection to separate the femoral artery from the rest of the structures in the bundle and isolate the artery atop a scalpel handle. See Figure 12.\nWith a 3-French introducer kit, utilize the Seldinger technique to gain access with a needle. Insert a guidewire and remove the needle to advance the 3-French sheath into the vessel. See Figure 13.\n\tCAUTION: Avoid using excessive force in advancing the 3-French sheath, as this can result in transection of the femoral artery.\nUnder fluoroscopic guidance and using a catheter, guidewire, and iohexol contrast agent, select for the celiac trunk — typically located at the T12 level — and then advance the catheter into the left hepatic artery via the common hepatic and proper hepatic.\nAt this point, administer the agent of choice through the catheter. Once the agent is administered, remove the catheter.\nUsing 3-0 silk suture, ligate the femoral artery proximally and distally to the insertion point of the sheath. Be sure to tighten the knot proximal to the sheath as it is withdrawn to prevent bleeding.\nClose the groin incision with 4-0 polyglactin 910 sutures on a cutting needle using a subcuticular stitch.",
    "Maintain standard post-operative care and monitor animal recovery. Perform euthanasia and necropsy as needed using standard techniques.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}