{
  "id": 9851,
  "origin_website": "Jove",
  "title": "Functional Mapping with Simultaneous MEG and EEG",
  "procedures": [
    "1. Check system tuning and data quality\nCheck the tuning of the MEG system. Use the tuning and noise measurement software provided with the MEG system to check that all channels are properly tuned and that the average noise level is below 3 fT/cm or 3 fT on planar gradiometer and magnetometer MEG channels, respectively.\nCollect a segment of empty room data. Acquire data with the shielded room void of subject for 5 minutes for quality assurance and noise estimation.\n2. Set up the stimuli and data acquisition parameters.\nSet up the somatosensory, auditory, and visual stimuli using a stimulus computer, projector installed outside the shield room, and a somatosensory electric stimulator (Grass Model S88).\n3. Subject preparation\nBefore an MEG/EEG study, each subject must fill out several forms regarding safety and consent.\nCheck that subject is free of magnetic materials. Bring the subject into the shielded room and start MEG data acquisition to check that the data does not contain signs of magnetic artifacts. If necessary, use a degausser to reduce artifacts from magnetic objects in the body such as dental work.\nPut on EEG cap, inject conducting gel, and check the impedances. The impedances should be below 10 kOhms.\nPut on EOG electrodes and the reference electrode.\nPut on head-position indicator (HPI) coils. Position the four HPI coils so that they will be under the area covered by the MEG sensor array and far away from each other.\nDigitize fiducial landmarks, HPI coils, EEG electrodes, and head shape.\nMove the subject into the scanner.\n4. Data acquisition for each sensory modality",
    "Set up stimulation protocols on the stimulus computer. For the somatosensory median-nerve stimulation, attach the electrodes on the left and right wrists and gradually increase the stimulus intensity so that the stimulus level exceeds the motor threshold. For the auditory stimulation, insert the earphones and check that the stimulus level is appropriate. For the visual stimulation, position the back-projection screen in front of the subject and check that the stimulus is correctly presented.\nStart data acquisition and check data quality. On the raw data display, check that all channels are functioning properly and do not contain any artifacts.\nMeasure the head position. Invoke the head position measurement from the acquisition console and check that the results meet the specifications imposed by the software.\nStart saving of raw data and on-line averaging.\nStart stimulus delivery\nOnce all stimuli have been presented, save raw data and on-line averages.\n5. Data analysis\nIn the data analysis, we will use anatomical MRI data for visualization of the results, for determining the shapes of tissue compartments for forward modeling, and for constraining the lMEG/EEG data to the cortical surface. We use both the current dipole model and a distributed cortically constrained minimum-norm solution in the analysis. The workflow of the distributed source analysis is shown in Figure 1. \nimgsrc://cloudfront.jove.com/files/ftp_upload/1668/1668fig1.jpgFigure 1. Overall workflow for analyzing MEG/EEG using cortically-constrained minimum-norm estimates.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}