{
  "id": 17109,
  "origin_website": "Jove",
  "title": "The Participant-Reported Implementation Update and Score (PRIUS): A Novel Method for Capturing Implementation-Related Data Over Time",
  "procedures": [
    "This study was approved by the Indiana University Institutional Review Board (Protocol #1602800879). With this approval, the reviewing body included a waiver for the need for informed consent, as it was deemed that participation was entirely voluntary, there was minimal risk of harm, and the study involved no procedures for which written consent was normally required outside of the research context.\n1. Participant-Reported Implementation Update and Score (PRIUS)\nAsk participant PRIUS prompt #1.\n\t\nAt a mutually agreed-upon time, meet the participant over a videoconferencing application like Zoom.\nPose the first verbal prompt to the participant: \"What are some things that happened over the past two weeks (or since the last time we spoke) that seem relevant from your perspective to the implementation of this project\"?\nCapture qualitative responses to prompt #1.\n\t\nUsing a spreadsheet template like the one pictured below in Table 1, capture the first implementation-related development that the participant reports in the first row under the first column labeled \"Update.\" It is not necessary to capture each development verbatim; a bullet-style summary is sufficient.\nRepeat as needed for each additional development reported by the participant during the same session.\nTable 1. A blank 4-column PRIUS template. Please click here to download this Table.[href=https://www.jove.com/files/ftp_upload/61738/Table 1_Miech_PRIUS.docx]\nAsk participant PRIUS prompt #2.\n\t\nFor each reported development, pose the second verbal prompt: \"From your perspective, what would you say the impact of that development has had on the implementation of the project? Do you think it has has a strong, moderate or weak impact, and is the direction of that impact positive or negative?\"\nCapture scored responses to prompt #2.",
    "Based on the response from the participant, score each development on the template on a 7-point scale ranging from +3 to -3, with zero as the middle value. Next to each development entered into the spreadsheet in Step 1.2, enter the score in the column labeled \"Score.\" Positive scores indicate positive influence on the implementation process; negative scores indicate negative influence; and zero indicates no discernible influence one way or the other. In terms of magnitude, 3 indicates a strong influence, 2 a moderate influence and 1 a weak influence. For example, a PRIUS update with a \"-2\" score would indicated that that the development was perceived to have a moderate negative impact on implementation of the project.\nAsk participant PRIUS prompt #3.\n\t\nFor each development reported and scored, ask the participant to provide a brief rationale for each score with the third verbal prompt: \"Why do you think it has had that impact?\" (i.e., strong/moderate/weak as well as positive/negative). For example, ask a participant to explain why they thought a particular development had a \"weak negative\" impact (i.e., a \"-1\") on implementation progress.\nCapture qualitative responses to prompt #3.\n\t\nCapture each rationale that the participant reports. Enter it in the third column of the spreadsheet entitled \"Rationale\" for each score captured in Step 1.4. As before, a short text summary is sufficient.\nNote any additional information.\n\t\nCapture any additional information in the optional fourth column of the spreadsheet labeled \"Comments\" as desired. This might include observed nonverbal cues like facial expressions, body language, and tone of voice and/or additional relevant details.\nCheck in with participant on a recurring basis.\n\t\nMeet again with participant every two weeks and repeat steps 1.1 through 1.7."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}