{
  "id": 18961,
  "origin_website": "Jove",
  "title": "A Multiplexed Luciferase-based Screening Platform for Interrogating Cancer-associated Signal Transduction in Cultured Cells",
  "procedures": [
    "Entire protocol takes approximately 4 days.\n1. Preparation of Cells for siRNA and Reporter Transfection\nWe will introduce here a protocol for interrogating siRNA libraries using a small set of siRNAs (384 different siRNA pools array in 96 well format with each pool consisting of 4x siRNAs targeting a single gene) from a genome-wide siRNA library for illustrative purposes. For this particular study, we will exploit HCT116 cells that exhibit deviant Wnt and Kras signaling, and p53 activity. The appropriate cell line in studies aimed at interrogating other cellular processes of interest will have to be identified and evaluated in a similar fashion.\nWash 5 x 10 cm2 plates of 80-90% confluent HCT116 cells with PBS then harvest cells by trypsinization using 1 ml of trypsinization solution/plate followed by neutralization with 10 ml of Dulbecco's modified eagle medium (DMEM) containing 2% fetal bovine serum (FBS) and 1% penicillin/streptomycin/plate.\nTransfer suspended cells to a 50 ml conical tube and centrifugate at ~130 x g for 5 min, remove supernatant, and re-suspend cell pellet in 10 ml of DMEM/ 2%FBS/ 1% penicillin/streptomycin.\nCount the cell number with a cell counter, and then make a cell solution with 105 cells/ml, keep 150 ml cell suspension for the next step. Plate 104 cells (100 μl) in each well of a 96 well cell culture plate using a Multidrop automated liquid dispenser (henceforth Multidrop). The cell suspension should be sufficient in this case for plating 12 x 96 well plates.\nIncubate the plates with cells at 37 °C in an incubator with 5% CO2 while preparing the transfection mixture.\n2. Preparing the Reporter Construct Stock Solution\nIsolate high-quality reporter construct DNA using standard midiprep kits (NucleoBond Xtra Midi produced by Clontech) and dilute the DNA to a final concentration of 1 mg/ml for each reporter.",
    "Prepare 100 μl of reporter construct stock solution by combining 30 μl of p53-FL, 30 μl of 8X TCF-RL, 30 μl of Elk1-Gal4, 6 μl UAS-CL and 4 μl of H2O to achieve a DNA mix with a final 1:1:1:0.2 ratio of the reporters. Final DNA concentration of this DNA mix stock solution is 0.3 mg/ml.\n3. Preparing the siRNA/DNA Transfection Mix\nIn this part of the protocol, we will prepare siRNA/DNA transfection mixes that will be sufficient for transfecting 12 x 96 well plates. For this test library of 4 x 96 well plate of siRNAs, we will transfect each siRNA pool in triplicate. The transfection reagent we will use is called Effectene (Qiagen). In our hands this is the only reagent that works for the simultaneous delivery of siRNA and DNA into cultured cells.\nDilute 80 μl of reporter construct stock solution in 8 ml of EC buffer (Effectene Kit) to achieve a DNA solution with a final concentration of 3 μg/ml. In general, prepare enough DNA solution mix for immediate use.\nPlate 20 μl of this DNA solution to each well of a 96 well/plate. The number of 96 well plates will depend on how many siRNA pools will be tested. For example, in this case we will need 4 x 96 well plates to evaluate 384 different siRNA pools.\nThe siRNAs to be tested should be at a stock concentration of 5 μM. If not, they can be replica plated and diluted to this concentration using the recommended dilution buffer associated with each library.\nTransfer 2 μl of each 5 μM siRNA stock to the corresponding well of the PCR plate containing the diluted DNA stock with a Biomek Automated Liquid Handler. Depending on the scale of the study, a multi-channel pipettor may suffice.",
    "Now, we will add 1 μl of Enhancer solution (Effectene kit) to each well of the DNA/siRNA plate. This again can be accomplished either with an automated liquid handler or multichannel pipettor.\nAllow the Enhancer reaction to occur at RT for 5 min then add 3 μl of Effectene transfection reagent to each well and incubate at RT for an additional 10 min.\nTo stop transfection complex formation, add 10 μl of DMEM/ 2% FBS/ 1% penicillin/streptomycin to each well of the PCR plate.\nTransfer 10 μl of the transfection mix to each well of the 96 well plate containing the cells (retrieved from the cell incubator). As each transfection will be performed in triplicate, the same mix will be applied to two additional 96 well plates containing cells.\nIncubate the cells with transfection mixtures added at 37 °C in a humidified environment with 5% CO2 for 36 hr.\n4. Determine Luciferase Activities from Cell Samples\nAfter 36 hr, luciferase activities are ready for measurement in transfected cells. The endpoint should be determined on a per-experiment basis. In our study, a 36 hr incubation time had previously yielded a sufficiently robust signal for meaning outcome determination. As this study incorporates multiple reporters (one secreted into the culture medium, and two others expressed in the cell cytoplasm), we will obtain measurements from both culture medium as well as a cellular lysate.\nDetection of CL activity in the culture medium:\n\t\n20 μl of culture medium is replica-plated in a white opaque 96 well plate (either using the Biomek Liquid Handler or multichannel pipettor).\nAdd 20 μl of CL assay buffer (Targeting Systems) to each well.",
    "Add 10 μl of Cypridina luciferin substrate (Targeting Systems) to each well and detect CL activity using a luminometer (the Pherastar plate reader produced by BMG for example).\nDetection of FL and RL activity:\n\t\nLyse the cells by first removing the culture medium. This can be accomplished rapidly by turning plate upside down and tossing medium in a sink. Remaining medium can be removed by gently tapping the upside down plate on paper towels. Add 30 μl of 1X Passive Lysis Buffer (Promega) to each well of cells using the Multidrop and place on a platform rocker (Bellco is one company that makes these) set a medium speed for 5 min at the RT.\nAdd 20 μl of the Luciferase Assay Reagent II (part of the Promega Dual Luciferase Kit) using the Multidrop and immediately measure FL activity using the luminometer. Next, add Stop & Glo Reagent (Promega) that will quench the FL activity and allow measurement of RL activity. Note: unless you are using substrate mixes that allow extended signal duration (such as Dual-Glo Luciferase Kits from Promega), the use of flash kits requires rapid measurement upon substrate addition (within 5 min).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}