{
  "id": 9840,
  "origin_website": "Jove",
  "title": "Double Fluorescence in situ Hybridization in Fresh Brain Sections",
  "procedures": [
    "This protocol was developed and refined based on standard radioactive and non-radioactive in-situ hybridization methods, previously developed by us and others to detect one or two transcript species in brain tissue 1-7. The protocol described below has a total length of 2 or 3 days, depending on the number of procedural interruptions chosen by the end user. All steps detailed below are to be conducted at room temperature, with the exception of the riboprobe hybridization step and post-hybridization washes. The solutions and buffers required for all steps involved in this method can be found at the end of this protocol.\n1. Tissue Preparation and Sectioning\nDecapitate and extract subject's brain rapidly, and place it into a plastic mold of adequate size.\nCover brain with Tissue-Tek embedding medium and rapidly place the plastic mold in a dry-ice/alcohol bath for rapid freezing. Frozen tissue can be stored at -80°C until use.\nUsing a cryostat, collect 2 or 3 brain sections per slide onto charged Superfrost Plus slides. Thickness of the sections should be 10-12 μm. Slides can be stored at -80°C until use.\n2. Preparation of Sephadex G50 Columns for Probe Purification\n\"Sephadex columns can be purchased from commercial sources, however, we provide below a low-cost alternative for the generation of columns, which will be required for probe purification.\nHydrate adequate amount of Sephadex G50 powder with RNase-free, DEPC-treated water (for example, 2 g of powder in 100 ml of DEPC-treated water), mix solution briefly and store at room temperature to precipitate excess Sephadex G50.\nRemove supernatant (upper layer of water) following Sephadex G50 precipitation.\nRepeat the process above 3- 5 times.\nAfter the final wash, re-suspend the Sephadex G50 solution in TE buffer (1:1 ratio), and store at 4°C until use.",
    "Place autoclaved glass wool into a sterile 1 ml syringe and compress it with the plunger to make a compact layer at the bottom, and then place the syringe into a 15 ml Falcon tube.\nMix well the solution of Sephadex G50 in TE. Fill the syringe/column with this solution.\nCentrifuge the column for 30 sec at 1000 rpm.\nRepeat this procedure until the column is almost completely filled with Sephadex G50 beads.\nApply 200 μl of column washing buffer to the column and centrifuge it for 2 min at 1000 rpm. Discard flow-through.\nApply 200 μl of column blocking buffer to the column and spin it for 2 min at 1000 rpm. Repeat this step 4-5 times to equilibrate column. Columns can be stored at 4°C until use if sealed with Parafilm.\n3. Labeling and Purification of Riboprobes\nBelow we detail the generation and purification of a single riboprobe. For dFISH, the preparation of each probe will involve the same methodology, except that one of the probes will be labeled with digoxigenin (DIG)-tagged UTP whereas the other with biotin-tagged UTP.\nPrepare a concentrated ( > 150 ng/μl) and purified linearized cDNA solution of interest to generate either sense (control) or antisense riboprobes.\nIn a 1.5 ml microfuge tube, add 0.5-1 μg of purified cDNA template, 2 μl of 5X probe labeling buffer, 1 μl of 10X DIG (or biotin)-labeling mix, 0.5 μl of RNasin and 1 μl of the appropriate RNA polymerase, and bring the final volume of the solution to 10 μl with RNAse-free (DEPC-treated) water.\nIncubate the solution in a water bath at 37°C for 2 hr.\nAdd 1 μl of tRNA (stock; 20 μg/μl), and 39 μl of column blocking buffer to the solution.",
    "Prepare the Sephadex G50 column for probe purification. To this end, add 50 μl blocking buffer to the column and spin it for 10 sec at 1000 rpm.\n          Repeat this step 2-3 times to equilibrate the column (i.e., the full 50 μl applied to the column are recovered after cycle of centrifugation).\nApply the probe solution to the Sephadex G50 column, position a new microfuge tube at the bottom of the column, and spin it for 3 min at 1000 rpm to obtain the purified 50 μl of riboprobe solution.\nAssess quality and yield of labeled riboprobe using either a standard formaldehyde-agarose RNA gel, or a spectrophotometer.\n4. Post-fixation, Acetylation and Hybridization\nRemove sections from the -80°C freezer and allow for a room temperature to equilibrate. Subsequently, incubate sections in a cold, freshly-made 3% paraformaldehyde solution for 5 min.\nBriefly rinse sections in phosphate buffered saline (PBS) twice.\nDehydrate sections through a standard alcohol series (70, 95, and 100%; 2 min each), and let them air-dry.\nIncubate sections in an acetylation solution for 10 min.\nRinse sections 3 times in 2X SSPE.\nDehydrate sections once again through the standard alcohol series described above, and allow them to air-dry.\nPrepare an adequate volume of hybridization solution and add both riboprobes to the solution (probe concentration: 1 ng/μl for each probe). Total volume of the hybridization solution is determined based on the number of sections to be hybridized (16 μl of hybridization solution per section).\nApply adequate volume of the hybridization solution to tissue and coverslip slides ensuring that no air bubbles overlay the tissue.",
    "Place slides in a metal slide holder. Immerse holder in a mineral oil bath set at 65°C overnight. Ensure that coverslips are facing upward (i.e., the lateral aspect of the slide holder should be in contact with the bottom of the mineral oil container).\n5. Post-Hybridization Washes\nThe following day, carefully remove the slide holder from the mineral oil bath and briefly rinse it in chloroform to remove excess oil from the slides.\nPlace slides in a 2X SSPE solution for 5-10 min. Coverslips should detach from slides while in solution.\nTransfer the slides to a new 2X SSPE solution, and keep them for 1 hr at room temperature.\nTransfer sections into a solution containing 2X SSPE plus 50% formamide. The temperature of this solution should match the temperature used in the overnight hybridization procedure. Keep slides in this solution for 1.5 hr.\nTransfer sections to a 0.1X SSPE solution pre-warmed to the same temperature of the hybridization step. Incubate sections in this solution for 30 min. Repeat this step for an additional 30 min.\n6. Detection and Visualization of Riboprobes\nTransfer slides to TNT buffer to which 0.3% hydrogen peroxide has been added, for 10 min.\nWash sections in TNT buffer, 3 times (10 min each).\nUsing a DAKO pen, draw a well around the area containing the brain sections. Importantly, caution should be exercised to ensure that sections do not dry.\nApply 150 μl of TNB buffer to each slide, and incubate sections in this solution for 30 min, in a humid chamber.\nRemove excess TNB solution by tilting slides.\nApply 150 μl of TNB solution containing peroxidase-conjugated anti-DIG antibody, and store slides in a humid chamber for 2 hr. Antibody concentration should be determined individually for each transcript of interest prior to carrying out dFISH.",
    "Wash sections in TNT buffer; 3 times, 10 min each.\nApply 150 μl of Alexa 594-conjugated tyramide working solution to each slide, and store them in a humid chamber for 1 hr. This solution should be prepared according to the manufacturer's directions.\nWash sections in TNT buffer; 3 times, 10 min each.\nIncubate sections in TNT buffer to which 0.3% hydrogen peroxide has been added for 10- 30 min.\nWash sections in TNT buffer; 3 times, 10 min each.\nApply 150 μl of TNB buffer per slide, and keep them in a humid chamber for 30 min.\nRemove excess TNB solution by tilting slides.\nAdd 150 μl of TNB solution containing peroxidase-conjugated anti-biotin antibody, and store slides in a humid chamber for 2 hr.\nWash sections in TNT buffer; 3 times, 10 min each.\nApply 150 μl of an Alexa 488-conjugated tyramide working solution to the slides and incubate sections for 1 hr. This solution should be prepared according to the manufacturer's recommendations.\nWash sections in TNT buffer; 3 times, 10 min each.\nAdd 150 μl of Hoechst solution (1:1000 in TNT buffer) to the sections and keep them in the humid chamber for 2 min.\nWash the sections in TNT buffer; 3 times, 5 min each.\nCoverslip sections with a fluorescence-compatible mounting medium (e.g., Vectashield or ProLong antifade).\n7. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/2102/2102fig1.jpg",
    "Figure 1. We show here representative dFISH results obtained in the zebra finch brain. Shown are photomicrographs obtained from the caudomedial nidopallium (NCM), the songbird analogue of the mammalian auditory cortex. Brain sections were hybridized with a biotinylated riboprobe directed against parvalbumin (A), a marker for a sub-population of inhibitory neurons, and a DIG-labeled riboprobe directed against the activity-dependent gene zenk (B), a reliable marker for song-driven neurons. C) Overlay of (A) and (B) shows a population of inhibitory neurons that are activated by auditory experience. Arrows and arrowheads indicate cells labeled exclusively with each of the two riboprobes, and asterisks show representative neurons co-expressing both transcripts of interest. Scale bar = 25 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}