{
  "id": 2574,
  "origin_website": "Cell",
  "title": "An optimized protocol for assessing changes in mouse whole-brain activity using opto-fMRI",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStereotaxic surgery\nTiming: 1–1.5 h for stereotaxic surgery\nMice are stereotaxically injected with an AAV construct to express the optogenetic actuator ChR2 in the target region and implanted with a low-profile, small-bore MRI-compatible optic cannula.\nPrepare animal for stereotaxic surgery.\nInduce anesthesia for stereotaxic surgery in a dedicated chamber using 4% isoflurane in a 1:4 O2 to air mixture.\nWeigh the animal and prepare anesthesia mixture according to the weight.\nInject anesthesia mixture intramuscularly into the quadriceps femoris muscle.\nGenerously shave hair from the neck up to the front of the eyes.\nApply epilation cream to the shaved head and let sit for 1 min. Remove with a lint-free cloth.\nSecure the animal in the stereotaxic frame, placed on top of a heating pad maintained at ∼36°C.\nCover eyes with an artificial tear ointment to avoid drying of eyes.\nInject lidocaine (20–50 μL) under the scalp to prevent pain.\nCut a large oval section of the scalp to expose the skull using sterile forceps and scissors.\nRemove all tissue covering the skull using sterile cotton buds. Avoid damage to the muscles.\nClamp the surrounding skin with spring scissors to evenly expose anterior, posterior, and parietal areas of the skull.\nApply a thin layer of dental etching gel to the exposed skull while avoiding contact with soft tissue. Let sit for 30 s before removing it with sterile cotton buds.\nCarefully scrape the bone surface of the animal’s skull with a dental scraper in a horizontal, vertical, and diagonal way to create ridges for the dental cement to adhere to (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2076-Fig1.jpg\nFigure 1. Skull surface preparation\nUsing a dental scaler, horizontal, vertical, and diagonal ridges are scraped on the skull surface. The resulting bone debris is removed using saline and lint-free sponge material.",
    "Wash off bone debris with saline and dry the skull using lint-free, medical-grade sponge material. Do not desiccate.\nLocate bregma and lambda positions and correct for tilt and scaling accordingly.\nNavigate to the desired coordinates (AP -0.1; ML -2.6; DV 3.7, relative to bregma).\nCarefully start drilling a small hole using a dental drill (30′000 rpm), without severing the cortical surface.\nRemove any bone debris from the skull using a rubber air puffer.\nCritical: Clean any bloody tissue surrounding the drill hole using saline and lint-free, medical-grade sponge material. Any trapped and clotted blood will result in MR signal loss due to the paramagnetic properties of deoxyhemoglobin. After cleaning, keep any exposed brain tissue submerged in sterile saline.\nPerform viral injection.\nLet the injection needle sit in place for ∼5–10 min (depending on injected volume) to avoid any fluid drawback during needle retraction.\nCritical: Stop any bleeding that may occur during needle retraction with medical-grade sponge material before optical fiber implantation. This will ensure no additional MR artifacts due to clotted blood surrounding the optical fiber. Keep exposed tissue submerged in sterile saline.\nPlace optical fiber in stereotactic holder and lower it toward the cortical surface.\nSlowly (∼1200 μm/min) drive the optical fiber into the brain tissue, making sure no bleeding occurs.\nOnce the optical fiber is in place, dry the skull using a rubber air puffer. Do not desiccate.\nApply a thin layer of bonding agent to the exposed skull and light-cure for 20 s with a dental curing light.\nCritical: Steer clear of the optical implant and drill hole as the reagent has an acidic pH that will damage both the optical fiber and brain tissue, resulting in substantial MR artifacts.",
    "Apply the dental composite Permaplast LH flow and light-cure it for 20 s. Start at the plastic edges of the optical fiber and build up in layers. This will embed the optical implant and contribute to its longevity.\nOnce the optical implant is secure, remove the stereotaxic holder.\nApply the dental composite in layers to the remaining exposed skull and light cure each layer for 20 s.\nCritical: Avoid introducing air bubbles while building the dental composite layers as this will create MR artifacts. This can be easily avoided by handling the dental cement syringe in a gentle manner (i.e., no shaking) and removing any bubbles forming at the tip of the syringe using a tissue. Keep the total dental composite layer to the height of the optical implant.\nApply non-absorbable silk stitches to the anterior and posterior skin flaps as needed.\nSubcutaneously inject the anesthesia antidote and 100 μL of Saline to rehydrate mice. Put them in a heating chamber for recovery.\nOpto-fMRI recording\nTiming: 10–15 min for animal preparation, 1 h for opto-fMRI recordings\nCombined optogenetic stimulation and fMRI recordings in mice capture cell-type specific contributions to changes in brain-wide activity.\nSlide a 4 cm intubation tube with a demarcation at 2.5 cm onto a 25 gauge needle tip and prepare a 4 cm cannulation tube connected to a 30 gauge needle tip. Connect the cannulation tube to a separate, longer tubing attached to a 1 mL insulin syringe filled with sterile saline (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2076-Fig2.jpg\nFigure 2. Endotracheal intubation and tail vein cannulation procedure for opto-fMRI recordings in the anesthetized state\n(A) Cannulation and intubation tubing 4 cm. Insert a 30G needle tip into the cannulation tube.",
    "(B) Connect the cannulation tube to an insulin syringe filled with sterile saline via a longer tube connected to a 30G needle and pre-fill tubings and needles with sterile saline. Slide intubation tube onto a 25G needle tip for guide purposes.\n(C) Place the anesthetized mouse onto a platform facing belly up and secure front incisors with an elastic. Tape the tail to the platform surface for additional stability and position an isoflurane tubing along the buccal tissue inside the mouth to maintain anesthesia.\n(D) Place a light source above the animal’s neck to visualize the trachea. Once located, intubate the mouse using the guided intubation tube.\n(E) Once the mouse is successfully intubated, a faint rhythmic condensation pattern should be visible inside the intubation tube. Cut the tube at the demarcation line creating a bevel.\n(F) Position the intubated mouse on a heating pad, reducing isoflurane anesthesia to 2%. Locate the lateral tail vein and cannulate the animal. Once successfully cannulated, blood should easily be drawn from and re-injected into the tail vein using the insulin syringe connected to the cannulation tubing.\nAnesthetize the mouse in a separate chamber with 4% isoflurane (1:4 O2 to air mixture) for 4 min.\nPosition the animal on an elevated platform facing belly up once the timer has expired.\nSecure upper incisors in an elastic hoop to overextend the neck.\nTape the tail to the platform surface using adhesive tape (Figure 2[href=https://www.wicell.org#fig2]C).\nMaintain anesthesia at 4% isoflurane flow through redirected tubing placed inside the animal’s mouth (Figure 2[href=https://www.wicell.org#fig2]C).\nPut a small heating pad (∼36°C) on top of the tail to maintain a stable core temperature.\nPosition a light source above the animal’s neck to readily locate the trachea (Figure 2[href=https://www.wicell.org#fig2]D).",
    "Perform endotracheal intubation with the dedicated, 4 cm long tube (Figure 2[href=https://www.wicell.org#fig2]D). For an instructive videographic documentation of the intubation process please see (Das et al., 2013[href=https://www.wicell.org#bib4]).\nCut the tube at the demarcation, creating a bevel (Figure 2[href=https://www.wicell.org#fig2]E).\nTransfer the animal to a heating pad and reduce the isoflurane flow to 2%.\nCannulate the lateral tail vein (Figure 2[href=https://www.wicell.org#fig2]F).\nSecure tail vein tubing with a thin adhesive tape without touching the cannulation needle.\nPlace the mouse on a continuously heated MR cradle.\nConnect the endotracheal tube to the MR compatible ventilation system supplying a rhythmic (80 breaths/min) delivery of a 20% O2 to 80% air mixture with an isoflurane flow at 2%.\nSet the ventilation system to a respiration cycle of 25% inhalation, 75% exhalation, and an inspiration volume of 1.8 mL/min.\nCritical: Ensure the breathing rate of the mouse is synchronized to the ventilation rhythm before proceeding.\nConnect the tail vein tubing to the MR-compatible continuous infusion system.\nInject an initial bolus containing a mixture of pancuronium bromide (0.25 mg/kg) and medetomidine (0.05 mg/kg) for muscle relaxation and sedation, respectively.\nReduce isoflurane flow to 1.5% and set a timer to 5 min.\nNote: Following the bolus injection, the breath-related motion should become significantly shallower within 20–30 sec.\nCritical: It is important to measure the systemic physiological parameters under anesthesia in a benchtop experiment that mimics the experimental conditions of the fMRI recordings. This to prevent any negative impact on the Blood Oxygenation Level Dependent (BOLD) fMRI signal that could result from anesthesia-related hyperoxia or hypercapnia. Our approach ensures a steady heart rate (measured in beats per minute, or bpm), pulse distension (measured in μm), and oxygen saturation (measured in %) for at least one hour of anesthesia, as demonstrated in (Zerbi et al., 2019b[href=https://www.wicell.org#bib15]).",
    "Secure the animal’s head within MR-compatible ear bars attached to the cradle (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2076-Fig3.jpg\nFigure 3. Opto-fMRI cradle positioning and setup\nThe intubation tubus of the mouse is connected to the mechanical ventilation machine through a small mouthpiece. Once breathing is confirmed to be synchronized to the ventilation rhythm, secure the mouse’s head within the earbars and connect the fiber patch cable to the optical fiber using a phosphor bronze mating sleeve. Apply an artificial tear gel to both eyes to prevent drying.\nPlace an MR-compatible rectal probe to monitor a constant animal temperature of 36 ± 0.5°C throughout scanning.\nConnect the fiber patch cable to the optical fiber implant using a phosphor bronze mating sleeve.\nNote: Choosing such an opaque, MR-compatible mating sleeve greatly reduces light spill at the fiber contact site compared to generic ceramic sleeves. This step should not re-position the animal’s head within the ear bars.\nApply an artificial tear gel to the animal’s eyes to prevent drying.\nOptional: Place an additional fiber patch cable beneath the animal’s head for continuous illumination at the experimental stimulation wavelength throughout scanning. This measure will control for potential visual artifacts during optogenetic stimulation.\nReduce the isoflurane flow to 0.5% once the timer has expired and start a continuous infusion of medetomidine (0.1 mg/kg/h) and pancuronium bromide (0.4 mg/kg/h).\nInsert the cradle into the MR bore equipped with the cryogenic probe, placing the animal’s head at the center of the magnet.\nOptional: As an additional light control measure, place an MR-compatible LED light source at the back of the MR cradle and switch it on. If installed, turn on the continuous laser emission of the control fiber path cable.\nRun initial MR preparation scans suitable for your experimental design.",
    "Note: This step may include measures to tune and match the frequency of the coil, adjustment for radiofrequency power, and standard adjustments to compensate for MR field inhomogeneities (e.g., MAPSHIM in a Bruker console).\nOptional: Run a structural scan (T1-weighted or T2-weighted images) prior to functional data acquisition to assess correct optical fiber placement above the targeted regions and - if applicable - exclude animals that do not show correct targeting.\nCritical: Before functional data acquisition, ensure the laser system as well as the trigger program/device of choice is correctly set up to deliver precisely timed optogenetic stimuli.\nAlternatives: This protocol uses the COSplay trigger device to precisely define, time, and deliver laser stimulation to the target brain region during fMRI recordings. Any other trigger device (e.g., Arduino) or software that can be coupled with the fMRI sequence can be used as well.\nStart the desired sequence on the 7 Tesla Bruker PharmaScan scanner for functional data acquisition timed with the optogenetic trigger system.\nNote: For BOLD fMRI recordings, we suggest using a gradient echo (GE) - echo planar imaging sequence (EPI) with a repetition time TR = 1000 ms, a slice thickness ST = 0.45 mm, and an in-plane spatial resolution RES = 0.22×0.2 mm2.\nSwitch off the continuous laser illumination and stop the delivery of isoflurane as well as the continuous infusion of the anesthesia mixture after the functional recordings.\nNote: Routinely check on the animal connected to the ventilation machine until the muscle relaxant pancuronium bromide is metabolized. When this occurs, the animal will start counter-breathing, attempt small movements, and try to detach itself from the intubation line.",
    "Critical: Remove the intubation tube from the mouse trachea only when you are confident that the animal can breathe autonomously. Inject up to 1 mL of saline solution subcutaneously to rehydrate the mouse and put it in a heated chamber to fully recover from the anesthesia. Regularly check the breathing of the animal."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms",
    "Bioinformatics",
    "Systems Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}