{
  "id": 14990,
  "origin_website": "Jove",
  "title": "ACT1-CUP1 Assays Determine the Substrate-Specific Sensitivities of Spliceosomal Mutants in Budding Yeast",
  "procedures": [
    "1. Yeast strain construction\nGenerate or obtain an S. cerevisiae strain whose background includes leu2 and cup1Δ. To generate this background, use the well-established yeast method that employs lithium acetate and single-stranded DNA39.\n\tNOTE: Haploid yeast strains may contain one, two, or more copies of CUP16,38. Refer to genomic information for the selected yeast strain when designing knock-out primers to flank the CUP1 gene location(s).\nPerform a yeast transformation to incorporate the QSP either via genomic incorporation or on a plasmid. Use a well-established protocol such as those described in previous research40,41,42.\nPerform a yeast transformation with the resulting strain(s) from step 1.2. to add the desired ACT1-CUP1 reporter plasmid.\n\tNOTE: Cells must be maintained on leucine drop-out (-Leu) plates and media to ensure retention of the ACT1-CUP1 reporter plasmids following this transformation.\nPerform steps 1.2. and 1.3. for each QSP and each ACT1-CUP1 reporter plasmid to be tested, including control strains.\n2. Copper plate preparation\nSelect a copper concentration range that suits the reporters to be tested (see Table 1 for frequently used reporters' lethality).\n\tNOTE: An example of a comprehensive copper concentration range is 30 different copper concentrations of 0 mM, 0.025 mM, 0.05 mM, 0.075 mM, 0.1 mM, 0.15 mM, 0.2 mM, 0.25 mM, 0.3 mM, 0.35 mM, 0.4 mM, 0.45 mM, 0.5 mM, 0.6 mM, 0.7 mM, 0.8 mM, 0.9 mM, 1.0 mM, 1.1 mM, 1.2 mM, 1.3 mM, 1.4 mM, 1.5 mM, 1.6 mM, 1.7 mM, 1.8 mM, 1.9 mM, 2.0 mM, 2.25 mM, and 2.5 mM Cu2+.\nMake a stock solution of 1 M CuSO4 and sterile filter through a 0.22 µm PES (polyethersulfone) sterile filter.\nPer desired copper plate, prepare a 2 mL dilution of the CuSO4 stock in sterile water.",
    "NOTE: As the plate with 0 mM Cu2+ will always be analyzed and imaged as a reference, it is recommended to make two 0 mM Cu2+ plates, one at the beginning and one at the end of the plating step (step 3.4.).\n\t\nCalculate the amount of stock for the final desired copper concentration in 40 mL of the plate volume (Supplemental Table 1).\nAdd the calculated amount of sterile water and 1 M CuSO4 stock to a sterile, 2 mL tube.\nPour plates for the ACT1-CUP1 assay.\n\tNOTE: An alternative to the protocol below is to initially combine the media and agar in a large container and aliquot after autoclaving into smaller containers to achieve different copper concentrations for each plate. Whichever method is taken, it is important to ensure that the media concentration is consistent between all of the plates despite each having a different copper concentration.\n\t\nLabel each empty plate to be poured with the final copper concentration it will contain. Prepare at least one square plate per copper concentration to be tested.\nLabel a 100 mL bottle per copper concentration to be tested.\nTo each bottle, add 790 mg of agar (2% w/v agar) and a stir bar.\nIn a large beaker, combine the -Leu growth media for all the copper plates to be poured. Per plate to be made, dissolve 265 mg of yeast nitrogen base (YNB) and 64 mg of drop-out mix minus leucine (and any other nutrients that may be required to maintain the QSP plasmid in the cells) in 34 mL of deionized water.\nAdd 34 mL of the -Leu growth media solution to each prepared 100 mL bottle and cap with aluminum foil. Label the foil with the intended copper concentration.",
    "Autoclave to sterilize and dissolve the agar using the recommended liquid cycle for the autoclave.\nAs promptly as possible, add 4 mL of 20% w/v glucose (sterile filtered) to each bottle.\nMatch the labels and add the 2 mL dilutions of CuSO4 to its intended bottle.\n\t\tNOTE: As tens of copper plates can be made at the same time, each with a different concentration, labeling all bottles, tubes, and plates clearly with the intended copper concentration will prevent confusion during plate pouring.\nUse a stir plate to mix for ~30 s and pour or pipet 35 mL into the labeled plate, avoiding bubbles. Allow to cool before storing or use.\n\t\t​NOTE: Frequently, the plates are made 1 day or 2 days in advance of the assay and stored at 4 °C until a few hours before use. The plates should be at room temperature (RT) before plating begins (step 3.4.).\n3. ACT1-CUP1 assay\nStreak out the desired strains on -Leu plates.\n\tNOTE: If working from cryo stocks, care should be taken to ensure the cells are sufficiently revived from storage before plating. A recommended procedure for this is to streak from the cryogenic stock and allow it to grow for 3-5 days at 30 °C. Then, restreak a small swatch and allow it to grow for another 2-3 days at 30 °C.\nGrow overnight cultures in 10 mL of media.\n\t\nPrepare -Leu growth media using the same ratios as described in step 2.4.2. Per 10 mL of media, add 66 mg of yeast nitrogen base (YNB) and 16 mg of drop-out mix minus leucine to 9 mL of deionized water. Pass through a 0.22 µm PES sterile filter.",
    "Per yeast strain, add 9 mL of -Leu growth media and 1 mL of 20% w/v glucose (sterile filtered) to a sterile 50 mL conical tube.\nUsing a sterile stick or pipet tip, gather a small (~1 mm round) swatch of yeast and inoculate the media.\nShake all the overnight cultures at 180 rpm and 30 °C.\n\t\tNOTE: If available, rotators can be used instead of a shaker.\nDilute the strains to an OD600 0.5 ± 0.05 in 10% glycerol.\n\t\nPer strain, add 100 µL of culture to a cuvette containing 900 µL of water.\nMeasure the OD600 with a spectrophotometer.\nCalculate the dilution required to be at an OD600 of 0.5 in a final volume of 2 mL.\nDilute each strain to OD600 0.5 in 10% glycerol (sterile).\nRemeasure the OD600 to confirm the cell density is within the desired range of 0.5 ± 0.05.\nPlate the strains on the copper plates.\n\t​NOTE: A variety of methods can be used to plate the strains, including hand pipetting 5-10 µL volumes, using a repeat or multi-channel pipettor, or stamping with a pin replicator. This last method is described below, though most steps will be similar regardless of the method.\n\t\nSet up a sterile working location and a lit Bunsen burner.\nFor a 48-pin replicator, pipet 200 µL of each diluted strain into a separate well of a 96-well plate. Fill the empty spaces in the 6 x 8 grid with 200 µL of 10% glycerol (sterile).\n\t\tNOTE: An example of a plating scheme for nine yeast strains is in Supplemental Table 2.\nDip the replicator in a shallow dish of 95% (v/v) ethanol and flame to sterilize. Let it cool for at least 2 min after the flame extinguishes to avoid heat shocking the cells.",
    "Place four plates near the burner and remove the lids.\nDip the replicator in the 96-well plate and lift it up in one quick motion.\nPlace gently onto the plate and rock lightly back and forth to facilitate a good transfer.\nLift up in one swift motion and place in the exact same orientation in the 96-well plate.\nRepeat for up to three other plates. Repeat the process of dipping the replicator in ethanol, flaming to sterilize, and waiting to cool every four plates.\nAfter a plate has been plated, move with a smooth motion to the side but still within the sterilization umbrella of the flame.\n\t\tNOTE: It is recommended to do the yeast dilutions and plating near a flame. The plates can easily become contaminated while drying.\nLet the plates dry completely before placing the lids on, usually 3-5 min.\nIncubate the plates for 3 days at 30 °C.\n4. Data collection and analysis\nRemove the plates from the incubator and visually inspect them.\nRecord the images of the plates with an available camera or other digital imaging system.\nRecord (or score) for each strain the last copper concentration visible growth is observed.\n\tNOTE: The cells are able to splice and remain viable up until that concentration. For consistency, always use the same method, either by eye or from the plate images, to score the last viable copper concentration. Very small colonies are sometimes visible by the eye but not on the image. The difference between direct visual inspection or recording from images is small, usually a step in the gradient. As images of the colonies are often used in publications, scoring by the images is recommended.\nCombine data from multiple ACT1-CUP1 assays for the same strain to draw conclusions about how the QSP affects splicing.",
    "NOTE: Publication figures customarily show images of the yeast colonies at 0 mM Cu2+ concentration, the last viable copper concentration, and the subsequent concentration where the colony has died. Data can also be displayed as a bar graph with error bars for the standard deviation between replicates. Data do not need to be normalized but can be by setting the viability of the WT splicing factor control to 1 and comparing the effect of the mutation(s) introduced.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}