{
  "id": 2599,
  "origin_website": "Cell",
  "title": "A two-choice assay for noxious light avoidance with temporal distribution analysis in Drosophila melanogaster larvae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTwo-choice light avoidance assay\nTiming: 4 h (starting at Zeitgeber 4–6)\nHere we describe how to prepare the experimental animals and perform and record the light avoidance assay under controlled conditions. We typically record two plates at the same time to increase the throughput of the assay. The videos are the basis for further analysis of light avoidance using the custom scripts.\nPrepare staged larvae for light avoidance assays.\nTake plates with staged animals from the incubator.\nAdd distilled water to a plate containing staged larvae. After 1 min, pour the larvae into a petri dish on a dark surface.\nGently pick up larvae and put them in distilled water in a small container (e.g., Columbia staining jar) or petri dish.\nWash larvae by aspirating the water with a plastic pipette.\nUsing a paintbrush, gently move the larvae on a plain agar plate.\nIncubate the plate for 10 min at 20°C–25°C in a dark chamber (e.g., cardboard box or similar).\nNote: We use larvae at 96 h after egg laying, at which time point they are still foraging and display consistent light avoidance behavior. To minimize variability, e.g., due to circadian rhythm dependent changes, it is also recommended to analyze light avoidance behavior within a constant time window (Zeitgeber (ZT) 4–6), so depending on the light entrainment cycle of your incubator (typically 12 h light/12 h dark) 4–6 h after light onset)).\nTwo-choice light avoidance assay. Preparing the setup and animals for recording and acquiring the behavioral videos.\nPlace fresh agar plates in the light avoidance chamber such that half of the plate is in darkness while the other part of the plate is illuminated from below.\nPlace the LED frame surrounding the agar plates.",
    "Transfer 20 larvae from the plate (in dark chamber) to a staining jar or small petri dish with distilled water, aspirate water.\nPlace 20 larvae per plate in the middle of light-dark border.\nStart the camera recording in the software after all animals have been placed and record the behavior for 16 min.\nStop the recording, remove, and discard the animals and plates.\nAlternatives: The number of assayed plates can be scaled down or up depending on the number of available animals. The size of the chamber and light source used for the assay. Keep in mind that placing the larvae on the plate takes some time and the recording should only be started once all plates are ready to avoid having handling artifacts in the video, which might affect their further processing.\nCritical: Do not reuse agar plates, use fresh plates for each trial (larvae leave trails on plates that affect behavior in subsequent trials). Make sure that the agar plates are horizontally and vertically aligned between the recordings and therefore have the same coordinates in all recordings. Do not move the position of the camera. Consider drawing a reference circle or attach a place holder for the arena to position the agar plates in a highly reproducible way. This ensures homogenous data enabling semiautomatic data analysis, improves the quality of the results and generally saves time. Make sure that the filenames do not contain whitespaces and symbols (!\"#$&'()∗;<=>?[\\]ˆ`{|}∼), as they will likely disrupt the function of the scripts for the following analysis.\nCustomized script for temporal analysis of light avoidance behavior\nTiming: 1–2 h",
    "In this section, we describe how to install all necessary analysis software, preprocess the available recordings by converting them into suitable format, cropping and subtracting the background, and analyze the intensities that represent the distribution of larvae over time on the different parts of the plate (Figure 2[href=https://www.wicell.org#fig2]). The first step in the script reduces the frame number to a reasonable and biologically meaningful number resulting in discrete time points (here, we use every 200th frame equaling time points 8 s apart). Next, all frames are cropped to retain only the region of interest containing the two-choice assay plates. Finally, the videos are saved in the ∗.avi format, which can be handled by Fiji. The cropped and converted ∗.avi files are then processed with a script to remove background and obtain binary image series, with larvae having maximum intensity, while the background is set to 0. Reading out the intensities derived from the larvae on each side of the plate (light and dark) provides a basis to plot relative intensities over time that correlate with the number of animals at any given time point.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2099-Fig2.jpg\nFigure 2. Workflow of the video analysis\nIn the first step, using the ffmpeg software with the reprocess_video.bat script or another equivalent approach, ∗.mp4 format video files are (1) reduced for frame number (e.g., every 200th frame), (2) cropped to remove unnecessary parts of the video, and (3) and converted into the ∗.avi format. In the second step, using Fiji and the reprocess_avi_and_get_means.ijm script, the processed ∗.avi videos are (4) masked to generate binary, black-and-white images, and then (5) analyzed by generating ROIs measuring the intensity of the respective dark and light side of each arena. Generated data tables (∗.csv files) are then used to draw the graphical output of the data.",
    "Preprocess, convert and crop using the reprocess_videos_windows.bat script and ffmpeg converter or alternative video convertor.\nRun the script by typing reprocess_videos_windows.bat directly in the folder or in a command prompt.\nThe script creates three new folders: reduce, crop and avi. The file(s) for the subsequent analysis are located in the avi folder and has ∗.avi extension.\nCritical: If you aligned the plates as described above before the recording (see step 2), settings for cropping can be kept the same for all experiments. Otherwise, adjust the coordinates for each video separately. Correct cropping of videos should be verified before the next step.\nSubtract static background from the recording, apply masking to convert it into binary video (black background and white larvae), and extract intensities for the regions of interest.\nOpen Fiji by running ImageJ-win64.exe (ImageJ_linux.exe).\nGo to Plugins → Macros → Edit and open reprocess_avi_and_get_means.ijm script from the repository.\nIn the script, specify the path where the avi folder is located with the recording to be analyzed (do NOT include the avi folder itself in the path):\npath = \"C:/Users/Public/.../Folder_with_recordings/\"\nSpecify the coordinates (X:Y:width:height) for the regions of interest (by default there are four rectangular regions corresponding to the light/dark part of each plate) in the function action() as\nmakeRectangle(0,0,512,1024);\nroiManager(\"Add\");\nmakeRectangle(512,0,512,1024);\nroiManager(\"Add\");\nmakeRectangle(1024,0,512,1024);\nroiManager(\"Add\");\nmakeRectangle(1536,0,512,1024);\nroiManager(\"Add\");\nPress “Run” button and wait the start of the preprocessing of the ∗.avi video and subsequent extraction of the intensities in the recording.",
    "Critical: If you aligned the plates as described above before the recording (see step 2), settings for cropping can be kept for all experiments. Otherwise, adjust the coordinates for each video separately. The ROI size will also depend on the resolution of your camera and video (here 512 × 1024 px). In any case, correct cropping of videos should be verified before the next step.\nThe Fiji analysis script produces ∗.csv file with intensities corresponding to the larvae present in a given region of interest. As by default four regions of interest are set, the extraction procedure will result in a table with four columns: mean1 (light side plate 1), mean2 (dark side plate 1), mean3 (dark side plate 2) and mean4 (light side plate 2), where every column is related to the corresponding region of interest.\nCalculate the intensity distribution between the light and dark side as a performance index:\n  P e r f o r m a n c e  I n d e x   (  P I  )  =   I n t e n s i t y  (  d a r k  )  − I n t e n s i t y   ( l i g h t )    I n t e n s i t y  (  d a r k  )  + I n t e n s i t y   ( l i g h t )",
    "Optional: The background corrected binary ∗.avi files can be used to visualize the temporal distribution of larvae on the agar plate: using the temporal color code plugin in Fiji (image -> Hyperstacks -> Temporal-Color Code, larval position can be color-coded based on the elapsed time since the beginning of the recording. The current color code plugin provided with Fiji is not functional, but a fixed version (Temporal-Color_Code2.ijm) can be obtained here (https://forum.image.sc/t/temporal-color-code-bug/41323/7[href=https://forum.image.sc/t/temporal-color-code-bug/41323/7]). Place this file in the respective Fiji folder (…/Fiji.app/plugins/Scripts/Image/Hyperstacks) and start Fiji."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}