{
  "id": 15289,
  "origin_website": "Jove",
  "title": "A Simple, Rapid, and Quantitative Assay to Measure Repair of DNA-protein Crosslinks on Plasmids Transfected into Mammalian Cells",
  "procedures": [
    "1. Generation of DPC-containing Plasmid\nCombine 80 pmol of oligonucleotide containing an 8-oxoguanine residue (20 µL) with 10 units of T4 polynucleotide kinase (1 µL) in 10x ligase buffer (5 µL). Add water to reach a total volume of 50 µL and incubate at 37 °C for 30 min in a heated water bath.\n\t\nCombine the phosphorylated oligonucleotide (50 µL), 80 pmol of single-stranded DNA (80 μL), 100 units Taq polymerase (20 µL) in 10x Taq reaction buffer (25 µL), 100 mM ATP (20 µL), 10 mM dNTPs (20 µL), NEB buffer 2 (25 µL), and 8 µg BSA (20 µL) to total 260 µL. Incubate the sample in a thermocycler set at 75 °C for 15 min followed by 37 °C for 5 min. Next, add 60 U of T4 polymerase (20 µL), 8,000 U T4 ligase (20 µL), 100 mM ATP (20 µL), 10 mM dNTPs (20 µL), NEB buffer 2 (15 µL), and 8 µg BSA (20 µL) to total 375 µL. Incubate the reaction overnight at 37 °C (Figure 1A).\nCreate a 50:50 buffer-saturated phenol:chloroform mixture. Add equal volumes of each component, mix, and spin in a table-top centrifuge at 21,130 x g for 5 min. Chloroform drives water out of the buffer-saturated phenol to form two layers: an upper, aqueous layer and a bottom, organic layer. Add 375 µL of the lower, organic layer to the primer extension reaction, mix, and spin in a table-top centrifuge at 21,130 x g for 5 min.\n\tCAUTION: Phenol and chloroform are hazardous substances and precautions should be taken to avoid contact with the eyes or skin.",
    "Following centrifugation, carefully extract the top layer and mix with ammonium acetate added to a final concentration of 0.3 M followed by 2 volumes of 100% ethanol. Store the solution at -20 °C for a minimum of 30 min or overnight.\nSpin the sample in a table-top centrifuge at 15,000 x rpm at 4 °C for 10 min. Remove the supernatant and wash the pellet in 1 mL of 70% ethanol. Spin the sample in a table-top centrifuge at 15,000 x rpm at 4 °C for 5 min. Remove the supernatant and resuspend the pellet in 100 µL of water.\nCombine 50 µL of DNA from the previous step with 16 µL 6x gel-loading dye, and 34 µL water and subject to electrophoresis on a 0.8% low-melt agarose gel containing 0.5 µg/mL ethidium bromide. Run the gel at 2 V/cm on a 10-cm gel for 6 h in 1x TAE buffer. Excise the supercoiled band using a razor blade and weigh the gel slice (Figure 1A). Run a positive control to serve as a marker for where the covalently closed, supercoiled DNA migrates.\n\tCAUTION: Ethidium bromide is a mutagen and precautions should be taken to avoid contact with the skin. Also, it is important to minimize the time that the plasmid sample is exposed to UV in order to reduce the formation of UV photoproducts.\n\t\nDigest the gel slice by adding 10% β-agarase reaction buffer for every mg of gel weight. Incubate at 65 °C for 10 min and cool to 42 °C. Add 10 U of β-agarase and incubate at 42 °C for 1 h.",
    "Following incubation, measure the volume and add ammonium acetate to a final concentration of 0.3 M and chill on ice for 15 min. Centrifuge at 15,000 x g for 15 min at room temperature, collect the supernatant, and add 2 volumes of isopropanol. Chill at -20 °C overnight.\nCentrifuge the purified, supercoiled DNA for 10 min at 15,000 x rpm in a table-top centrifuge at 4 °C and resuspend the pellet in 40 µL of water.\nCrosslink 12 pmol (15 µL) of DNA to 36 pmol of oxoguanine glycosylase (1 µL) in buffer containing 100 mM NaCl (3 µL), 1 mM MgCl2 (3 µL), 20 mM Tris-HCl pH 7.0 (6 µL), and 10 mM sodium cyanoborohydride (2 µL) to reach a final volume of 30 µL at 37 °C for 30 min26. Remove 1 µL of crosslinked sample and dilute in 500 µL of water to serve as a 0 h data point and analyze on PCR in step 3.\n2. KCl/SDS Precipitation\nTo visualize crosslinking efficiency, restriction digest 1 µg of the crosslinked plasmid with 1 μL BspDI in 10x buffer at 37 °C for 1 h to generate two different sized DNA fragments.\n\tNOTE: One fragment will be crosslinked to protein (4.4 kb) and the other will not (2.8 kB) (Figure 1B).\n\t\nDivide the samples in half, add SDS to both to a final concentration of 0.5%, and incubate at 65 °C for 10 min.\nAdd KCl (final concentration 100 mM) to one of the samples and incubate on ice for 5 min.\nCentrifuge both samples at 12,000 x g for 5 min at 4 °C and run the supernatants on an agarose gel to estimate the percent conjugation of protein to DNA12.\n\t\tNOTE: KCl/SDS precipitation is used for quality control, not substrate preparation.",
    "3. Transfection into Mammalian Cells\n1 day prior to transfection, plate 0.5 x 106 cells/well in a 6-well plate. The next day, mix 1.5 µg (30 µL) of the DPC-containing plasmid (from step 1.6) with 300 µL of serum-free culture media. In another tube, mix 12 µL of transfection reagent and 300 µL of serum-free culture media. Combine 300 µL of diluted DNA with 300 µL of diluted transfection reagent and incubate for 5 min at room temperature. Add 250 µL of the complexes to each of two wells and incubate for a minimum of 1 h at 37 °C.\nFollowing incubation, remove media, add 1 mL of 0.6% SDS/0.01 M EDTA, and incubate at room temperature for 10 - 15 min. Scrape the cells using a rubber policeman and transfer to a 1.5 mL microfuge tube. Add 200 µL of 5 M NaCl (final concentration of 1 M), invert gently 5 times, and incubate at 4 °C overnight27.\nCentrifuge the samples at 21,130 x g in a table-top centrifuge at 4 °C for 30 min, collect the supernatant, ethanol precipitate as described above, and resuspend in 50 µL of water.\n4. SSPE-qPCR\nMix together 1 µL of recovered DNA from each time point (including 0 h), 2x SYBR green PCR master mix (30 µL), 27 µL of water, and 1 µL (100 pMol) of primer complementary to the damage strand of the plasmid (Primer R, Figure 2). Perform PCR using the following conditions: Initial pre-melt for 10 min at 90 °C, followed by 8 cycles of: 90 °C, 15 s, 65 °C, 1 min. At the completion of cycle 8 add 1 µL (100 pMol) of the second primer to total 60 µL (Primer L, Figure 2)28 (see Table of Materials for reagent details).",
    "Mix 1 µL of unamplified recovered DNA from each time point (including 0 h), 2x master mix (30 µL), 27 µL of water, and 1 µL of each primer (100 pMol) to total 60 µL.\nLoad a 96-well PCR plate with the samples from steps 4.1 and 4.2 (20 µL/well, in triplicate) and perform qPCR for 30 cycles using the conditions described above.\nAverage the CT values from each set of triplicate samples. Subtract the CT values generated in step 4.1 from those in step 4.2 to obtain the delta CT value for each sample. Subtract the 0 h time point from the delta CT value to remove any background (See Representative Results section for a detailed description).\nConvert the delta CT value into percent repair using the formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57413/57413eq1v2.jpg"
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}