{
  "id": 1627,
  "origin_website": "Cell",
  "title": "Rapid preparation of human blood plasma for bottom-up proteomics analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProtein denaturation and extraction\nTiming: 30–40 min\nBlood plasma is a protein-rich biofluid (60–80 mg/mL for healthy individuals; Anderson and Anderson 2002[href=https://www.wicell.org#bib1]; Leeman et al., 2018[href=https://www.wicell.org#bib12]) that does not require lengthy treatment to release proteins, making it quite amenable to proteomic analysis. However, plasma contains numerous native proteases that, if not denatured effectively, can cleave proteins in the non-specific and unpredictable manner. Rapid thermal denaturation, the 1st step of the procedure, ensures that the plasma proteins are later extracted reproducibly and to completion, and the activity of the native proteases does not interfere with the downstream steps of the sample preparation. Guanidine hydrochloride is selected as a chaotropic agent because of its thermostability, relative chemical inertness at high temperatures, and ability to solubilize proteins across a broad range of the hydrophobicity scale.\nLabel one 1.5 mL conical-bottom Eppendorf tube per plasma sample and transfer a 50 μL aliquot of LBA.\nWhile working in a Biosafety cabinet, gently invert thawed plasma samples 3–5 times, examine their appearance, and make notes on each sample (see problems 1[href=https://www.wicell.org#sec6.1] and 2[href=https://www.wicell.org#sec6.3] in troubleshooting[href=https://www.wicell.org#troubleshooting]).\nWhile working in a Biosafety cabinet, denature plasma samples.\nPipet 5 μL of plasma into the prepared tubes with LBA.\nVortex for 5 s at 2,000–3,200 × g.\nSpin down to ensure all liquid is at the bottom of the tubes.\nPlace the tubes into the heating block (sand bath) at 100°C–110°C for 10 min.\nCritical: Continuous heating of the samples for more than 10 min could cause thermal damage, protein coagulation, and undesirable chemical modifications (see problem 3[href=https://www.wicell.org#sec6.5] in troubleshooting[href=https://www.wicell.org#troubleshooting]).\nNote: Make sure that the tube labels do not peel or wipe off when heated in a sand bath. Mark both tube bodies and caps.",
    "Note: To avoid solidification of plasma components, the optimal ratio of plasma proteins to volume of LBA should be kept under 10:1 of μg plasma protein to μL LLA.\nTake the tubes out and let them cool down to ambient temperature on the benchtop.\nPrecipitate proteins by addition of methanol. After this step the plasma samples are no longer considered infectious and could be handled outside the Biosafety cabinet.\nAdd a 450 μL volume of methanol (up to ∼90% methanol vol/vol) to each tube and vortex for 5 s at 2,000–3,200 × g.\nCentrifuge down for 6 min at 13,000 × g at ambient temperature.\nCaution: Methanol is highly flammable, a suspected fetal toxin, an eye irritant, and considered an acutely and chronically toxic solvent. Appropriate PPE (e.g., a laboratory coat, goggles, and gloves) should be worn when working with this solvent. A chemical fume hood should be used when working with large volumes of this solvent.\nNote: Avoid overspinning and excessively compressing the protein pellet, which could make it difficult to resuspend in the subsequent steps.\nAlternative: The exact timing and speed of centrifugation are not critical. If the high-speed centrifuge is not available, the samples could be spun at lower speed for a longer time (e.g., 20 min at 5,000 × g).\nAt this point slanted white-to-yellow protein pellets should be visible at the bottom of the tubes (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1062-Fig1.jpg\nFigure 1. Photograph of protein pellet formed upon addition of methanol in steps 4 and 5\nDecant supernatant while avoiding disturbing the pellets and air-dry the tubes on the sides for 3–5 min.\nInvert the tubes and tap gently to remove the remaining supernatant.",
    "Note: Do not overdry the pellets; a small amount of residual methanol will not interfere with the following steps of the procedure. Overdrying, however, could make resuspending the pellets challenging.\nResuspend in digestion buffer LBB.\nAdd a 100 μL aliquot of freshly made LBB to each tube.\nVortex at 2,000–3,200 × g to resuspend the pellets (∼5–15 min). If visible pellets persist, sonicate in a temperature-controlled ultrasonic water bath at 4°C–30°C, until they fully resuspend.\nCritical: never heat peptides and proteins in urea-containing buffers to over 60°C, as at high temperatures urea can rapidly react with and covalently modify primary amines, such N-termini of proteins and lysine residues. These modifications change mass of peptides and proteins and interfere with their identification during database searching.\nOptional: when working with plasma of healthy individuals, peptide yields stated in expected outcomes[href=https://www.wicell.org#expected-outcomes] should be readily observed, and the procedure can be carried out exactly as described, without the need for protein concentration determination step. During analysis of plasma of severely ill patients, however, a wider range of protein concentrations could exist (see expected outcomes[href=https://www.wicell.org#expected-outcomes] and problem 6[href=https://www.wicell.org#sec6.11] in troubleshooting[href=https://www.wicell.org#troubleshooting]). To account for that, researchers may choose to perform protein concentration determination using commercial assays, such as Reducing Agent Compatible BCA Protein Assay Kit from Pierce, according to the manufacturer’s instructions.\nProtein digestion\nTiming: 2.5 hrs",
    "Trypsin digestion is a workhorse of bottom-up proteomics (Vandermarliere et al., 2013[href=https://www.wicell.org#bib20]). Pre-digestion with another protease, LysC, is often performed to boost digestion efficiency and to reduce the number of missed cleavages, especially at lysine residues that are preceded by prolines. When sequencing grade enzymes are used, this reaction is generally specific and reproducible and proceeds mostly to completion. Special attention, however, should be paid to pH and ionic strength of the digestion buffers, as trypsin activity is at its peak at pH 6.5–8.5 and concentrations of denaturing agents, such as urea, below 1.5 M (see problem 4[href=https://www.wicell.org#sec6.7] in troubleshooting[href=https://www.wicell.org#troubleshooting]). LysC is not as sensitive to buffer conditions and hence can withstand higher concentrations of urea.\nAdd LysC enzyme for the 1st step of sequential digestion.\nPipet 7 μL LysC solution (∼1:50 enzyme: protein ratio) and gently invert tubes 5 times to mix.\nCentrifuge at <2,000 × g at ambient temperature to collect liquid at the bottom of the tubes.\nPlace the tubes into an incubator at 37°C for 1 h.\nNote: the required mass of enzymes and the reported enzyme-to-protein ratio of 1:50 (LysC in step 8 and trypsin in step 9) is calculated based on the expected average yield of peptides (see expected outcomes[href=https://www.wicell.org#expected-outcomes] for more information). Samples with moderately higher and lower concentrations could be processed without the need for adjustments in volumes of enzymes added, as enzyme-to-protein ratios between 1:25 and 1:100 are equally effective.\nAdd trypsin enzyme for the 2nd step of sequential digest.\nDilute LBB (8 M urea) down to below 1.5 M urea with a 450 μL volume of freshly made 100 mM Tris (pH 8).\nAdd 17.5 μL trypsin (∼1:50 enzyme: protein ratio) and invert 5 times to mix.",
    "Centrifuge at <2,000 × g at ambient temperature to collect liquid at the bottom of the tubes.\nPlace the tubes back into an incubator at 37°C for at least 1 h (see problem 4[href=https://www.wicell.org#sec6.7] in troubleshooting[href=https://www.wicell.org#troubleshooting]).\nTo stop enzymatic activity and to prepare the proteins for latter solid-phase extraction (SPE), acidify the samples.\nAdd a 50 μL volume of 10% TFA (to the final concentration of ∼1% TFA by volume).\nVortex for 5 s at >2,000 × g at ambient temperature.\nConfirm that pH of the samples has decreased below 2 by pipetting 2 μL of the acidified mixture on pH indicator strips.\nPeptide desalting and purification via solid phase extraction\nTiming: 30 min\nSolid phase extraction (SPE) is a popular technique for purification of digested peptides and removal of chemicals and buffer components that may interfere with chromatographic separations, electrospray ionization, and/ or MS analysis (Bladergroen and van der Burgt 2015[href=https://www.wicell.org#bib2]). Numerous products featuring diverse solid phase chemistries are currently available, most of which work through the same basic steps: loading of peptides, washing of interfering compounds, and elution of purified peptides. Strata™-X 33 μm Polymeric Reversed Phase cartridges, suggested for use in this protocol, offer the advantage of speed and ease of implementation but could be substituted with many other SPE products (Sep-Pak from Waters, ZIPTIP® C18 pipette tips from Merck Millipore, among others).\nPrepare the desalting setup (see Figure 2[href=https://www.wicell.org#fig2] for illustrations to steps 11–17).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1062-Fig2.jpg\nFigure 2. Illustration of the desalting set-up using Strata™-X 33 μm Polymeric Reversed Phase cartridges, described in steps 11–17\nUse a needle to pierce through caps of 50 mL conical tubes that will serve to hold waste eluents (up to six SPE cartridges per tube) with at least two holes per cap.",
    "Use the same needle to pierce through the caps of 1.5 mL conical-bottom Eppendorf tubes (one tube per plasma sample) with at least two holes per cap.\nLabel the sides of the 1.5 mL tubes but do not write on the caps. These tubes will serve to collect eluted peptides.\nPlace freshly uncapped needles through the holes of the waste 50 mL tubes and insert Strata™-X 33 μm Polymeric Reverse Phase cartridges 10 mg/ 1 mL onto the needles (see problem 5[href=https://www.wicell.org#sec6.9] in troubleshooting[href=https://www.wicell.org#troubleshooting]).\nPlace freshly uncapped needles through the holes in the caps of 1.5 mL conical-bottom Eppendorf tubes.\nPrime the cartridges by washing with a 1 mL of 100% ACN. Let liquid flow through into a waste container unassisted, with the force of gravity only, until dry.\nOptional: when simultaneously desalting more than 16 samples, the use of Strata™-X 33 μm Polymeric Reversed Phase, 10 mg / well cartridges in the 96-well plate format is recommended. The needles and collection tubes are not required in this case, and purified peptides (step 17) could be collected into a commercial 96-well plate, such as TrueTaper® 96-Well Collection Plate from Analytical.\nNote: avoid using mechanical force, such as plungers, to push liquid through the SPE cartridges and let the liquid drip through unassisted, as much as feasible. If slow drip of liquid is observed though the column prior to loading the sample (step 12), discard the column and use a new one.\nWash cartridges with a 1 mL volume of 0.1% TFA in water and let liquid flow through until dry into waste.\nLoad digested peptides.\nSpin acidified samples down for 5 min at 10,000 × g.\nWhile avoiding pipetting any precipitates, load samples onto the prepared SPE cartridges.\nWait for the liquid to flow through into waste.",
    "Optional: when the protocol is followed closely and the recommended concentration of sample is used, no major issues with clogging of SPE cartridges are expected. However, in rare cases, especially when working with many samples in the 96-well format, extra negative pressure may be needed to draw liquid through the clogged packing bed. In this case, the use of plunges or vacuum manifolds, such as Strata® 96-Well Plate Manifold with Vacuum Gauge, could be considered.\nWash with a 1 mL volume of 0.1% TFA in water and let the drip flow through into waste.\nMove cartridges containing washed peptides to collection tubes with fresh needles, while leaving the used needles in Falcon tubes for future reuse if desired.\nElute peptides by pipetting a 300 μL volume of 80% ACN in 0.1% TFA and collect the flow-through, which contains purified peptides.\nLyophilize or vacuum centrifuge to dry eluted peptides.\nPause point: lyophilized peptides could be frozen at this point and stored dry for prolonged periods of time (days to months) at temperature below −20°C.\nNote: this protocol is designed with label-free quantification in mind, such as MaxLFQ (Cox et al., 2014[href=https://www.wicell.org#bib5]) and parallel reaction monitoring (Peterson et al., 2012[href=https://www.wicell.org#bib19]). However, if other types of peptide quantification are desired, for example multiplexed quantification with isobaric tagging, desalted and dried peptides produced at the end of step 18 can be carried further to perform chemical tagging. Likewise, resultant tryptic peptides could be fractionated or enriched for post-translational modifications (PTMs), such as phosphorylation or glycosylation. Please see problem 5[href=https://www.wicell.org#sec6.9] in troubleshooting[href=https://www.wicell.org#troubleshooting] for more ideas.\nResuspend the samples.\nAdd a 300 μL volume of 0.2% formic acid in LC/MS grade water.\nVortex at 2,000–3,200 × g for 10–15 min.\nCentrifuge for 10 min at 13,000 × g at 4°C.",
    "Obtain peptide concentration measurements of the samples using NanoDrop™ or Pierce™ Quantitative Colorimetric Peptide Assay, according to manufacturer’s instructions.\nTransfer volumes of samples necessary for analysis into autosampler vials compatible with the liquid chromatography system of choice; if upon spinning in step 19 precipitation was observed, avoid disturbing the precipitate and pipet only the supernatant.\nNote: the described protocol is agnostic to the specifics of LC/MS-MS analysis that follows, as long as the method is designed to analyze tryptic peptides. Numerous separation strategies, data acquisition methods, and instrument types could be used. Please access the following references for more details: Gallien et al. (2015)[href=https://www.wicell.org#bib6], Geyer et al. (2016)[href=https://www.wicell.org#bib7], Meier et al. (2018)[href=https://www.wicell.org#bib14], Messner et al. (2020)[href=https://www.wicell.org#bib15], and Overmyer et al. (2020)[href=https://www.wicell.org#bib18]."
  ],
  "subjectAreas": [
    "Proteomics",
    "Mass Spectrometry",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}