{
  "id": 7784,
  "origin_website": "Bio",
  "title": "Assay for Phytaspase-mediated Peptide Precursor Cleavage Using Synthetic Oligopeptide Substrates",
  "procedures": [
    "Transient expression of phytaspases in N. benthamiana leaves Pick single colonies of A. tumefaciens C58C1 containing the phytaspase expression vector or the empty-vector control and resuspend them in 500 µL of LB medium.Streak the resuspended colonies evenly on LB plates with appropriate antibiotics (rifampicin, 100 µg/mL; tetracycline, 25 µg/mL; spectinomycin, 100 µg/mL).Note: The goal is to get a bacterial lawn. Similarly, streak a single colony of agrobacteria carrying the P19 expression construct resuspended in 500 µL of LB on LB plates containing kanamycin (50 µg/mL) instead of spectinomycin.Incubate for 48 h at 28°C.Use 6 mL of infiltration buffer (see Recipes) to wash off the bacteria from the respective plates and transfer the suspensions into 15 mL culture tubes.Collect cells by centrifugation for 10 min at 1,000 × g; discard supernatant.Resuspend cells in 6 mL of infiltration buffer each.Determine optical density (OD) at 600 nm.Mix the two suspensions in a 50 mL culture tube and dilute with infiltration buffer, to obtain 50 mL of infiltration solution with a final OD600 of 0.7 for the phytaspase expression construct and 1:0 for the P19 silencing suppressor.Do the same for the empty-vector control.Use a 1 mL plastic syringe without the needle to inject the suspensions into the abaxial side of leaves of N. benthamiana plants (Figure 1A, Video 1).Note: Support the leaf on the opposite site with your index finger. Use gentle pressure and be careful not to injure the leaves. Infiltrated areas are water-soaked; they become much darker than the remainder of the leaf. Try to infiltrate as much of the leaf area using as few infiltration sites as possible. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Agroinfiltration of N. benthamiana plantsContinue to grow the plants at 25°C and 16:8 h day/night cycle.Harvest the leaves at five days after infiltration.",
    "Note: The optimum time for transient protein expression in N. benthamiana depends on the protein of interest and needs to be determined experimentally. If degradation of the expressed protease or tissue necrosis as a result of protease overexpression are observed, earlier time points may have to be chosen for maximum yield. Use a razor blade or scalpel to remove the central vein.Place the remaining leaf material, upper side down, into a beaker (one for the expression construct and one for the empty-vector control) containing approximately 100 mL of extraction buffer (see Recipes) on ice (Figure 1B).Place the beakers into a desiccator and vacuum infiltrate the extraction buffer at 75 mbar for 2 min; then, slowly release the vacuum.Blot the leaves dry (Figure 1C). Stack them on top of each other, roll them up (Figure 1D), and place them into the barrel of a 100 mL plastic syringe (Figure 1E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4608/bioprotoc-13-03-4608-g001.jpgFigure 1. Transient protein expression in N. benthamiana leaves. A. Infiltration of agrobacterial suspension into the abaxial side of N. benthamiana leaves. B. Harvesting of leaves into extraction buffer. C. Leaves on blotting paper after vacuum infiltration. D, E. Leaves are piled one on top of the other and rolled up (D), in order to place them into the barrel of a 100 mL plastic syringe (E). (F) Diagram of a syringe barrel placed into a centrifuge bottle.Place the syringe barrel into a 250/500 mL centrifuge bottle (Figure 1E, F) and spin at 1,500 × g for 7 min at 4°C, to collect the intercellular fluid (apoplastic wash).Transfer the wash fluid to Oak Ridge centrifuge tubes and clear by centrifugation at 20,000 × g at 4°C.Transfer the supernatant to a new tubeAdd imidazole to a final concentration of 4 mM.",
    "Purification of phytaspases His-tagged phytaspases are purified from apoplastic washes by metal-chelate affinity chromatography on Ni-NTA agarose in a batch procedure, followed (optionally) by size exclusion chromatography on an Enrich SEC 650 10 × 300 gel filtration column. As a control, apoplastic washes from empty-vector-infiltrated plants are subjected to the same purification procedure.Pipette 500 µL of Ni-NTA agarose (50% slurry of agarose beads in storage buffer) into a 15 mL culture tube and spin for 2 min at 500 × g to sediment the matrix. Prepare two tubes, one for the recombinant protease and one for the mock purification from empty-vector-infiltrated plants.To wash the matrix, use a pipette to remove the buffer. Note: Be careful not to aspirate the settled matrix. Add 10 mL of binding buffer (see Recipes), mix gently and spin down, and remove the buffer as before. Repeat two times. Resuspend in 1 mL of binding buffer after the final wash.Add the apoplastic wash from step A19 to the matrix and incubate for 1 h at 4°C on a rotating wheel.Collect the matrix by centrifugation as above and wash three times with 12 mL of binding buffer, as described in step B2.Carefully remove the buffer after the last washing step.Add 600 µL of elution buffer (see Recipes), sediment by centrifugation, and recover the supernatant. Repeat twice.Combine the three 600 µL eluates and reduce the volume to approximately 100 µL by ultrafiltration using a Vivaspin centrifugal concentrator (30 k molecular weight cut-off) according to the manufacturer’s instructions.For buffer exchange, add 500 µL of elution buffer without imidazole. Reduce the volume to 100 µL as before (step B7). Repeat three times.Assess purity by SDS-PAGE and Coomassie-Brilliant Blue staining following standards protocols (Stintzi et al., 2022) (Figure 2A).",
    "Note: Many proteases that are expressed at high levels are sufficiently pure for further characterization at this stage (see for example P69A in Figure 2A). However, for applications that require the highest purity (e.g., the PICS assay for analysis of substrate specificity, as reported in Reichardt et al., 2018), we recommend further purification by gel filtration as detailed in the following steps B10–B14. Apply the sample to an Enrich SEC 650 10 × 300 gel filtration column (or similar), equilibrated in 50 mM sodium phosphate buffer pH 7.0, 300 mM NaCl, at 0.5 mL/min on an NGC Quest (Bio-Rad) chromatography system.Monitor UV absorbance at 280 nm; collect the column eluate in 200 µL fractions. Results are shown for tomato phytaspase 2 (Phyt2) in Figure 2B.For the highest purity, use only the fraction at the peak maximum in further experiments. Alternatively, pool all peak fractions, concentrate by ultrafiltration as above (step B7), add glycerol to 50% final concentration, and store at -20°C.Determine protein concentration using a commercial Bradford assay system (e.g., Bio-Rad Protein Assay kit II) following the manufacturer’s instructions.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230201/20230201221329_7703.jpgFigure 2. Purification of tomato phytaspases from apoplastic extracts of agroinfiltrated N. benthamiana plants. A. SDS-PAGE analysis of phytaspases purified from apoplastic extracts by metal-chelate affinity chromatography on Ni-NTA agarose. Approximately 2 (Phyt4), 5 (Phyt5), or 6 µg (Phyt1, Phyt2, P69A) of protein were loaded onto the gel. A Coomassie-stained 10% gel is shown; the molecular mass of marker proteins is indicated in kDa. B. Further purification of Phyt2 by gel permeation chromatography. The elution volume is shown in milliliters. Protein elution was monitored at 280 nm and is shown as m(illi) A(bsorbance) U(nits) in blue; 200 µL fractions were collected and assayed for Phyt2 activity using a fluorogenic peptide substrate.",
    "Activity is shown in arbitrary units in red, as relative fluorescence increase per minute. Modified from Reichardt et al. (2018), Figures 3a and 4a (Reichardt et al., 2018).In vitro cleavage assay for phytaspase specificity Activity and cleavage specificity of the purified protease of interest is tested with synthetic oligopeptides as substrates. Lyophilized custom-synthesized peptides can be obtained at >90% purity from commercial suppliers. The amino acid sequence has to be chosen to match the substrate requirements of the protease of interest. To analyze the cleavage specificity of tomato phytaspases, we used a decamer peptide comprising the five residues of PSK ([sY]I[sY]TQM; sY = sulfotyrosine) with five additional precursor-derived amino acids at the N-terminus (EAHLD[sY]I[sY]TQM) and a second peptide in which the critical Asp residue at the cleavage site was replaced by Ala (EAHLA[sY]I[sY]TQM).Resuspend the lyophilized peptide in ddH2O; determine the concentration spectrophotometrically at 260 nm, based on the molar extinction coefficient for two sulfotyrosine residues (ϵ260 = 566 M-1 cm-1).Set up the in vitro digest in 100 µL of reaction buffer (see Recipes). Prepare two tubes, one containing 140 nM of the purified phytaspase, and the second an equal volume of the mock-purified fraction.Note: Use high-quality microfuge tubes (e.g., the original Eppendorf tubes) and tips at this and subsequent steps of protocol C. Low quality tubes may leak plasticizer into the sample, which is detrimental to MS/MS analysis. Start the reaction by adding 5 µM substrate peptide and incubate at 30°C.Note: The peptide substrates were used in a 3,000-fold molar excess over the protease. However, this cannot be generalized. The quantity of protease in the assay and the required substrate concentration depend on the properties of the protease under study and have to be adjusted accordingly. Prepare six microfuge tubes, each containing 90 µL of 0.1% trifluoroacetic acid (TFA).",
    "Stop the reaction by taking 10 µL aliquots at 0 min, 10 min, 30 min, 1 h, 5 h, 24 h. Add aliquots to the tubes containing 90 µL of 0.1% TFA.Sample preparation for mass spectrometry Prior to mass spectrometry (nanoLC-ESI-MS/MS) analysis, samples need to be desalted and concentrated on C18 ZIP tips or StageTips (Rappsilber et al., 2003).In order to prepare StageTips, use a hypodermic needle to punch out small disks from PTFE membranes with embedded C18 beads, and place them into 200 µL (yellow) pipet tips. Use two discs per tip. Full details for StageTip preparation are given in Rappsilber et al. (2003).To condition the StageTips, add 50 µL of solvent A (see Recipes) and spin in a microfuge tube at 2,300 × g for 1 min at 4°C.Wash twice by adding 100 µL of solvent B (see Recipes) and spin as above.Apply the sample from step C5 and spin at 800 × g for 1 min at 4°C.Wash twice by adding 150 µL of solvent B and spin at 2,300 × g for 1 min at 4°C.Transfer the StageTips to new microfuge tubes and elute twice by adding 20 µL of solvent C (see Recipes); centrifuge at 800 × g for 1 min at 4°C.Dry samples in a vacuum concentrator and continue with nanoLC-ESI-MS/MS analysis or store at -20°C until further analysis."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}