{
  "id": 8644,
  "origin_website": "Jove",
  "title": "Real-time Video Projection in an MRI for Characterization of Neural Correlates Associated with Mirror Therapy for Phantom Limb Pain",
  "procedures": [
    "1. Preparation of the subject\nPrior to participation, have the participant complete a consent form and an MRI safety screening evaluation, the latter carried out by the neuroimaging technician at the scanning facility, to ensure that the participant does not have any known contraindications to being scanned (e.g., metal in their body, a history of claustrophobia, or pregnancy).\nProvide the participant with detailed instructions with regard to the experimental procedure.\nHave the subject listen to an instructional recorded audio to ensure that they are able to understand and follow the instructions provided during the scanning procedure.\nCarry out a practice run in a mock scanner to facilitate the familiarization of the task instructions within the scanner environment.\n\tNOTE: The mock scanner is similar in every way to the real data-acquiring MRI scanner, but without the active magnet.\nGive clear instructions to the participant to avoid any movements of the residual and phantom limb to avoid any contractions of the stump muscles that can interfere with the brain signal.\n2. Preparation of the experiment\nNOTE: The experimental protocol is similar to what has been previously described for the purposes of investigating the neural correlates associated with the mental imagery of moving the upper limbs. Here, we have adapted the approach to the movement of lower limbs. Specifically, the behavioral tasks consist of the following.\nBefore entering the scanner room, ask the participant to remove their prosthesis and any metal objects.\nHave the MRI technician make sure that the participant has no metal on their body that might put them at risk.\nTransport the participant to the MRI room in an MRI-compatible wheelchair; after that, ask the participant to transfer themselves to the MRI scanner bed.",
    "For the MT, comfortably place a single-piece, MRI-compatible, horizontal mirror (10,000 mm x 255 mm x 3 mm) supported by a triangular stand between the legs of the participant while they are lying supine on the scanner bed. Use sandbags in order to allow stability and a better positioning of the mirror. Attach the mirror stand to an adjustable arm so that it can be positioned in accordance with the subject's height and positioning without contacting any part of the body ( Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/58800/58800fig1.jpg\nFigure 1: Video camera and mirror set up. The mirror is positioned between the legs at an angle of about 45°, depending on the participant's height and amputation level. The goal is to cover the residual limb and make it invisible to the video systems. Sandbags are used to keep the mirror in the correct position. The camera positioning is also adaptable and can be easily changed using the tripod or the adaptable hock (changes the angle of the camera). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58800/58800fig1large.jpg]\nFor the visual feedback, mount an MRI-compatible digital camera on an adjustable tripod stand near the intact leg of the participant ( Figure 1).\n\tNOTE: The camera used is listed in the Table of Materials and costs approximately 217 USD. The camera acquires images in 1,080 pixels image resolution. Since the camera itself was not placed inside of the MRI bore, there is not a need for costlier MRI-compatible systems. The camera is attached to an MRI-safe IV pole via a gooseneck modular hose to enable positioning changes.\nAttach the camera to a tripod, allowing the appropriate adjustment of the viewing angle and field of view.",
    "Place a second mirror on the MRI head coil, allowing the participant to view the image presented on the monitor directly while lying completely inside the scanner bore ( Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/58800/58800fig2.jpg\nFigure 2: Schematic of video camera and image projection in the scanner environment. The real-time video projection of the mirror therapy system consists of three subsystems. 1) Camera and monitor subsystem. The video is transmitted to the monitor, so the subject can watch the leg and mirror leg movements in real-time. 2) The head coil with the mirror attached. The mirror in the head coil allows the participant to watch the monitor without moving their head. The mirror is at a 45° angle at eye level. 3) The mirror and sandbags. The MRI-compatible mirror is carefully placed between the legs and the residual limb in a way that it covers the residual limb and allows for the best image to be shown. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58800/58800fig2large.jpg]\nSet up the real-time video image transmission to be sent through a computer-controlled system and project it onto a monitor placed at the back of the scanner bore (near the head of the participant).\n\tNOTE: There is no perceivable time delay between the projection and the captured actual movement. The actual movement and the visual feedback are separated by less than a second which does not interfere in the real-time feeling, as stated by participants.\n3. Scanning and data collection\nAcquire fMRI data with a 3 T scanner using an 8-channel phased-array head coil.",
    "Obtain imaging sequences that include a high-resolution T1-weighted structural image (TE: 3.1 ms, TR: 6.8 ms, flip angle: 9°, isotropic 1 mm voxel size) (anatomical scan), and blood-oxygen-level-dependent (BOLD) fMRI signal measurements using a protocol based on multislice gradient (fast-field) echo-planar imaging (EPI) and standard parameters (TE: 28 ms, TR: 2 s, flip angle: 90°, isotropic 3 mm voxel size, oriented axially and covering the whole brain).\n\tNOTE: The entire scanning procedure lasts approximately 30 min. This includes an initial 4 min structural (anatomical) scan and four task (functional) acquisitions lasting 6 min each. For each task (functional acquisition), the patient is expected to tap their foot at a speed of 1 tap every second.\nDuring the scans, have the participant wear sound-isolating MRI compliant headphones (e.g., Westone) throughout the scanning session to hear the investigator's auditory commands.\nWhile the patient is lying in the scanner, play the auditory track so that the participant hears a series of auditory cues for performing the given behavioral task.\nUse the following commands: 1) \"leg\" for movement of the amputated leg (see the note after step 3.11); 2) \"mirror\" for movement of the intact leg while viewing a real-time video recording (thus observing the movement of a leg in the position of the amputated leg using the mirror); 3) \"rest\" in which the participant stops any leg movement and lies motionless with their eyes closed. In addition, have the investigator says \"start\" and \"end\" to signify the beginning and the end of the experimental run, respectively ( Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/58800/58800fig3.jpg",
    "Figure 3: Task design. The task design consists of three steps. During the first \"leg\" step, the subject is instructed to move the leg (flexing the foot) at a pace of about one movement every 2 s (10 movements in 20 s), with their eyes closed. For the second \"mirror\" step, the participant has to keep moving the leg (10 movements in 20 s) while looking at the video monitor displaying the online real-time mirror image of the legs. The last step instructs the subject to rest. \nHave the participant perform a movement with the nonamputated lower leg with the eyes closed (i.e., repeated plantar flexion and dorsal flexion of the foot at a pace of approximately one tap per 2-3 s).\nHave the participant perform the same leg movement, but now the participant observes a mirror image of his/her leg moving in the place of the amputated leg using real-time video capture of the movement of the intact leg.\nHave the participant perform a rest condition, in which he/she lays still with no movement of the legs.\n\tNOTE: Each condition lasts for 20 s (i.e., one experimental block = 60 s) for a run length time of 6 min (six repetitions of the experimental run per block).\nCollect data in a single session for each participant.\nInstruct the investigator to take note of any unwanted movements, and, in between the runs, to instruct the participant to keep the correct pace and movements.\nMake sure that, after the procedures are performed, the investigator transfers the data to an encrypted flash drive and stores it in a secure location in the facility.",
    "NOTE: In this protocol, the word \"leg\" is used in place of the word \"foot\". Even though the participants are only making foot movements (due to restraints from the MRI machine), most of them have a bigger part of the lower limb amputated and are referred as leg amputees, not foot.\n4. Analysis\nAnalyze the functional neuroimaging data using standard techniques30,41, using the longitudinal analysis design (baseline and posttreatment) and processing stream in the FMRIB Software Library (FSL) software package42,43.\n\t\nFor each functional scan, perform 3D motion correction using the first volume alignment, high-pass filtering to remove temporal linear trends, and perform a correction for slice time acquisition and spatial smoothing (Gaussian kernel, 5.0 mm full width at half maximum [FWHM]).\n\t\t\nMark volumes with a motion above 0.9 mm in any direction with FSL's motion outlier detection processing stream and mathematically \"scrub\" them from the final analysis44.\n\t\t\tNOTE: If more than 25% of the volumes are designated for removal, the whole acquisition should be excluded from the total dataset.\nCoregister each of the preprocessed functional images to the high-resolution anatomical and, then, bring them into standard Talairach space.\nFit a general linear model (GLM) to a voxel time course where each experimental condition is modeled by a boxcar regressor that should be smoothed with double-gamma hemodynamic response function.\nUse the high-resolution anatomical T1-weighted anatomical volume to construct an inflated cortical surface mesh to see the sulcal activation, and then, project individual subject maps for each contrast of interest onto the subject's reconstructed mesh.\n\t\tNOTE: The projections should show the significant values from the GLM. Set the statistical significance value threshold at the standard criterion of p < 0.001 corrected for multiple comparisons, using a cluster-size threshold adjustment.\nConduct a region of interest (ROI) analysis.",
    "Define the primary ROI broadly with FreeSurfer's Desikan atlas45 of the primary sensorimotor cortex and, then, refine it for each subject by using the subject-specific functional activation during the leg vs. rest condition at the baseline scan.\nReflect the refined primary ROI onto the homologous area of the opposite hemisphere (i.e., ipsilateral primary sensorimotor representation of the intact lower limb).\nUse the standard FreeSurfer anatomical Desikan atlas45 to define the entire (bilateral) occipital visual cortex for the secondary ROI.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}