{
  "id": 18281,
  "origin_website": "Jove",
  "title": "Establishment of a Clinic-based Biorepository",
  "procedures": [
    "All experimentation on human tissue samples was approved by Western IRB (WIRB Protocol #20142461). The single criterion for the collection of tissues for these procedures is a biopsy-proven diagnosis of SCC. No exclusion criteria were outlined in the original IRB protocol, but samples from patients with a known blood-borne communicable disease were not used. Informed consent was obtained prior to the collection of cutaneous tissue, blood, and saliva. Midwestern Institutional Review Board approved the validation work with clinic-based biorepository samples at Midwestern University (AZ#807).\n1. Cutaneous Tumor Tissue Processing\nNOTE: This is to be performed by a Mohs histotechnologist.\nProcessing of Fresh Squamous Cell Carcinoma (SCC) Tissue for RNA and Explant Culture\nAfter the tissue has been excised by the Mohs surgeon, harvest a 10 to 50 mg (≥10 mm3) tissue sample from the center of the apical side of the tissue during relaxation (which is the process of manipulating the tissue to allow it to lie flat on the slide) before additional processing.\n\t\t​NOTE: This is only possible if the tumor is large enough to allow a 10-50 mg-size sample (≥10 mm2) to be removed prior to the histological assessment, which is part of the Mohs procedure. If the tumor is not large enough to allow a minimum of 2 mm3 to be removed, do not proceed with processing for RNA (skip step 5).\nTransfer the viable tissue to a labeled 1.5 mL tube containing culture medium (1:1 mixture of DMEM:Ham's F-12, 25 mM HEPES, 100 IU/mL of penicillin, and 100 µg/mL streptomycin) using tweezers and ensure that the tissue is completely immersed in the medium. Store this tube at 4 °C before additional processing.",
    "Use the tissue for RNA isolation and expression analysis (see step 5) and/or the establishment of an explant culture (see step 6) within 24 h.\nPlace the remainder of the tumor sample that was removed from the patient (step 1.1.1) on a cryostat tissue holder (or \"chuck\"). Embed the tissue in optimal cutting temperature (OCT) compound, freezing the tissue within the holder, to allow for the completion of Mohs histology and for the preparation of additional histological slides for experimental analysis.\nPreparation of Histological Slides\nCut tissue sections 7 µm thick using a cryostat and create two (or more) slides for each tumor sample. Ensure that each slide contains up to three sections of the complete tumor.\n\t\t​NOTE: One of the two slides will be stained using H&E by the Mohs histotechnologist, and the additional slide(s) may be processed with IF, IHC, or FISH analysis.\nPlace the slides in acetone for 1-2 s to fix the tissue. Set these slides aside to dry. Do not H&E stain or coverslip the slide to be used for future immunofluorescence (IF), immunohistochemistry (IHC), or fluorescence in situ hybridization (FISH) analysis, depending on the experimental protocol.\nProcessing of Post-Mohs Tissue\nOnce Mohs processing has been completed (steps 1.1-1.2), work in the cryostat chamber and pry the sample from the cryo-embedding medium and place the tissue into a labeled cryogenic tube.\nPlace the labeled vial in liquid nitrogen before the tissue has thawed. If samples are to be used for protein and/or DNA analysis, they may be transferred to liquid nitrogen or a -80 °C freezer within a few minutes to be stored for future protein expression and DNA mutation analysis (see steps 4-5).",
    "​NOTE: If intact RNA is desired from the post-Mohs sample, it is essential to keep the sample frozen during the removal from the cryo-embedding medium. If extreme care is not exercised at this step, the post-Mohs sample should be reserved for protein and/or DNA analysis.\nProcessing of Fresh ANT\nAt the time of Mohs closure, obtain ANT from the Mohs surgeon.\nRemove an equal or greater amount of ANT as was harvested from the SCC sample (see above) from the apical side of the normal tissue and transfer it to a labeled 1.5 mL tube containing culture medium (1:1 mixture of DMEM:Ham's F-12 supplemented with 25 mM HEPES, 100 IU/mL of penicillin, and 100 µg/mL streptomycin) using tweezers.\nCompletely immerse the tissue in the same culture medium and store at 4 °C until subsequent processing (see steps 4-6).\n2. Blood, Saliva, and Buccal Swab Processing\nObtain approximately 10 mL of blood in EDTA collection tubes via venipuncture.\nTransfer the blood from the collection tubes to a sterile 15- or 50 mL centrifuge tube. Remove approximately 200 µL into a 1.5 mL cryogenic tube, avoiding bubbles; store this whole-blood sample at -80 °C, to be used for future genotyping and tissue matching, if necessary.\nSpin the remaining blood at 1,000 x g for 30 min and follow standard procedures to collect the plasma fraction.\nAliquot the plasma into 1 mL increments in 1.5 mL cryogenic tubes and store at -80 °C for use during future liquid biopsy analyses.\nUse a sterile swab to obtain a buccal swab sample and store the swab in a sterile tube at room temperature.\nIf needed, obtain a saliva sample and store in a sterile tube at room temperature.\n\tNOTE: These samples may be used for future genotyping and tissue matching, if necessary.",
    "3. Recordkeeping of Samples\nTransfer information from the checklist of patient samples to the biorepository database. Include patient information and diagnosis from the patient chart.\nPrint labels with a barcode for each sample and record each in the database to link each collected sample with patient data.\nRecord the distribution of the de-identified samples in the biorepository database prior to transferring the samples to the research lab.\n4. Protein Isolation and Western Blot Analysis\nPlace each tissue sample (SCC and/or ANT) into a vial containing 500 µL of cell lysis buffer containing protease inhibitors per 100 mg of tissue to lyse the tissue.\n\tNOTE: We used a radioimmunoprecipitation assay (RIPA) buffer, composed of 50 mM Tris pH 8.0, 150 mM NaCl, 0.5% sodium deoxycholate, 1.0% NP-40, and 0.1% SDS. Other cell lysis buffers can be used.\nHomogenize the tissues using a tissue homogenizer for 5 min in 20-s intervals at 4 °C. Spin the samples at 21,000 x g and 4 °C for 20 min and collect the supernatant containing protein into a fresh tube. Re-spin the supernatant using the same conditions and collect the final supernatant into a fresh tube.\nElectrophorese 30-50 µg of protein from each sample using a 4-20% SDS-polyacrylamide gradient gel. Stain the gel with Coomassie Blue to visualize protein bands, if desired.\nIf Western blot analysis of expressed proteins is needed, transfer the proteins from the gel to a polyvinylidene difluoride (PVDF) membrane following standard protocols. After transfer, Ponceau stain the PVDF membrane to visualize protein bands, if desired.\nBlock the PVDF membrane and probe to detect proteins of interest following standard protocols. Use primary antibodies specific to the protein(s) of interest, along with corresponding secondary antibodies specific for the primary antibodies, at concentrations recommended by the manufacturer for Western blot analysis.",
    "Expose the probed membrane using a chemiluminescent substrate and image the membrane using an imaging system.\n5. RNA Isolation and Quantitative Polymerase Chain Reaction (qPCR)\nImmediately place fresh tissue samples (SCC and/or ANT) into a 1.5 mL tube containing an RNA stabilization solution and place post-Mohs tissue samples into a 1.5 mL tube containing a frozen tissue transition solution, following the manufacturer's recommendations. Ensure that the tissue is completely immersed. Store these samples at -80 °C until use.\nRemove the RNA samples from -80 °C and thaw on ice. Transfer the tissue to a new 1.5 mL tube containing 1 mL of RNA extraction buffer (phenol/guanidine thiocyanate) per 50-100 mg of tissue.\nLyse the tissues using a tissue homogenizer. Perform six cycles of homogenization, followed by a period of sample cooling; each cycle consists of 20 s of homogenization at 4 °C and a 40 s cooling period. After homogenization, incubate the sample for 5 min at room temperature.\nAdd 0.2 mL of chloroform per 1 mL of RNA extraction buffer and shake the tube vigorously by hand for 15 s. Incubate for 2-3 min at room temperature.\nSpin the samples at 12,000 x g and 4 °C for 15 min. Remove the aqueous phase of the sample and place it into a new 1.5 mL tube.\nAdd 0.5 mL of 100% isopropanol per 1 mL of the RNA extraction buffer used in step 5.2 to the aqueous phase and incubate for 10 min at room temperature.\n\tNOTE: If the RNA yields are anticipated to be low (i.e., the starting tissue volume is less than 10 mg), samples may be precipitated overnight at -80 °C. Additionally, 5 µg of RNase-free glycogen per 500 µL of RNA extraction buffer may be added during the isopropanol precipitation step to improve RNA yields.",
    "Spin the sample at 12,000 x g at 4 °C for 10 min. Remove the supernatant and wash the pellet with 1 mL of 75% ethanol.\nVortex the sample briefly and then spin it at 7,500 x g and 4 °C for 5 min. Discard the wash and air-dry the pellet for 5-10 min.\nResuspend the RNA pellet in 20 µL of RNase-free water.\nIf desired, purify each RNA sample using an RNA cleanup kit following the manufacturer's recommendations.\n\t\tNOTE: Small RNAs will be lost from the sample if this step is performed.\nElectrophorese a 1 µg sample using a 1.2% formaldehyde-MOPS agarose gel to analyze the quality of RNA.\n\tNOTE: As an alternative, analyze samples using a bioanalyzer to obtain an RIN number13.\nReverse-transcribe the RNA to cDNA using a reverse transcription protocol for qPCR analysis of target mRNAs (or miRNAs) of interest.\n6. Tissue Explant Cultures\nSterilize the excised tissue prior to culture by dipping the tissue into 70% ethanol.\nPlace the tissue on a slide or dish and add enough culture medium (1:1 mixture of DMEM:Ham's F-12 supplemented with 10% FBS, 25 mM HEPES, 100 IU/mL of penicillin, and 100 µg/mL streptomycin) to cover the tissue (to prevent the tissue from drying). Carefully cut the tissue into fragments (<1 mm3) using a scalpel blade.\nTransfer the tissue fragments to a 35-mm tissue culture dish and add approximately 20 µL of fetal bovine serum (FBS) on top of each fragment.\nLeave the dish open in a culture hood for 20-30 min, or until almost dry.",
    "Add 1 mL of culture medium (1:1 mixture of DMEM:Ham's F-12 supplemented with 10% FBS, 25 mM HEPES, 100 IU/mL of penicillin, and 100 µg/mL streptomycin) to each dish and incubate at 37 °C in 5% CO2. Subculture or sub-clone the cultures if needed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}