{
  "id": 3179,
  "origin_website": "Cell",
  "title": "Protein expression and purification of bioactive growth factors for use in cell culture and cellular agriculture",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransformation and large-scale protein expression\nTiming: 4 days\nThis step encompasses the transformation of the growth factor expression construct (pMCSG53-FGF2, in this specific case) into the best performing E. coli expression strain as identified in the small-scale expression testing (Figure 3[href=https://www.wicell.org#fig3]). After transformation, cells are grown up as part of a large-scale culture, induced with IPTG to express the growth factor protein of interest and the cells are collected for downstream protein purification.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2752-Fig3.jpg\nFigure 3. Design flowchart for selected growth factor families\nRecommended expression vectors and E. coli strains for each growth factor family, based on our previous results, are colored in magenta.\nTransform expression construct (pMCSG53-FGF2) into BL21-Gold (DE3).\nThaw chemically competent BL21-Gold (DE3) cells on ice.\nThaw pMCSG53-FGF2 plasmid.\nMix 50 ng of pMCSG53-FGF2 plasmid with ∼50 μL of competent cells.\nIncubate at room temperature for 2 min.\nPlate the entire contents onto a pre-warmed LB agar plate containing 100 μg/mL of Ampicillin, spread using sterile glass beads.\nIncubate at 37°C for 12–16 h.\nInoculate and grow the overnight starter culture.\nPick 3–5 colonies from the plate using a sterile pipette tip.\nUse to inoculate 25 mL of LB broth containing 100 μg/mL of ampicillin in a 250 mL Erlenmeyer flask.\nGrow overnight in a shaking incubator at 37°C and ∼220 rpm for 12–16 h.",
    "Note: The size of this overnight starter culture depends on the large-scale culture volume. Using this protocol, we have achieved yields in the mg/L range for all growth factor families tested. Depending on the needs of the end-user, the scope of the large-scale purification could range from 1L to 6L (6 × 1L cultures). We recommend diluting the overnight starter culture 1:100 for large-scale growth. Consequently, the size of the starter culture should be adjusted to ensure a sufficient amount is available for inoculation.\nInoculate the large-scale cultures (2 × 1L) by diluting the overnight starter culture 1:100 (v/v) into 1 L of pre-warmed (to 37°C) LB broth containing 100 μg/mL of ampicillin in a 4L Erlenmeyer flask.\nNote: We typically grow 2 L (2 × 1L) for purification. Using even numbers of flasks allows for easy balance of the shaking incubator and ensures balance during downstream centrifugation steps.\nGrow the cells in a shaking incubator at 37°C at ∼220 rpm until the cultures reach an optical density (OD600) of 0.6–0.8.\nLower the temperature of the shaking incubator to 20°C and allow the cultures to cool.\nInduce the cultures by adding IPTG to a final concentration of 1 mM.\nIncubate cultures in the shaking incubator at 20°C and ∼220 rpm for 16 h (overnight).\nTransfer cultures to 1L centrifuge bottles (Beckman).\nCritical: Centrifuge bottles must be balanced prior to centrifugation or there is a risk of damage/injury. Sterile water can be used to balance at this stage.\nHarvest cells by centrifugation at 5000 × g for 20 min at 4°C.\nCarefully remove the supernatant.\nResuspend cell pellets using 20–25 mL of binding buffer per liter of culture.\nAdd 200–250 μL of 100X PIC.\nPause point: Resuspended cell pellets can be stored at −80°C for up to one month.",
    "Growth factor purification\nTiming: 2–3 days\nThis step outlines purification of the growth factors, removal of the affinity tag/fusion partner, and gel filtration to further improve the purity and to facilitate buffer exchange into the desired storage buffer.\nLyse the resuspended cells using a QSonica Ultrasonicator (or equivalent). Amplitude should be set to ∼65% but depends on the specific power supply.\nThe samples are placed on ice and sonication proceeds in 3-s bursts followed by 6-s rests.\nContinue process for 10–15 min of sonication time. The total time for this step will be ∼30–45 min.\nCritical: Follow the manufacturer’s guidelines with respect to power settings for your specific sonicator probe. Failure to follow these guidelines can result in damage to the probe.\nCritical: The samples should be kept cool throughout the entire sonication process. This will require replenishment of the ice bath.\nCritical: Ensure that the sonicator probe is submerged, but not touching the walls of the vessel. If the probe is too close to the surface of your sample, it will result in foaming which can denature proteins.\nAlternatives: Lysis can also be performed using a homogenizer or with a lysozyme and freeze-thaw approach\nTake a small aliquot of the sonicated sample (10–15 μL) and label it Total Lysate. Store at −20°C until SDS-PAGE analysis.\nCentrifuge the lysate at 20,000 × g and 4°C for 45 min to remove cell debris and insoluble material.\nDuring centrifugation (step 15), equilibrate 0.5–1 mL of Ni-NTA resin per liter of culture in binding buffer using a Bio-Rad gravity flow column.\nCollect supernatant after centrifugation. Take a small aliquot and label it Clarified Lysate. Store at −20°C until SDS-PAGE analysis.\nTo the remaining supernatant, add 0.5–1 mL of Ni-NTA equilibrated in binding buffer in a 50 mL falcon tube.",
    "Add 100X PIC to the sample.\nIncubate the supernatant and Ni-NTA at 4°C under gentle agitation for 1 h for batch binding.\nCentrifuge the samples using a Beckman Coulter Allegra X-14R Centrifuge at 200 × g for 5 min at 4°C.\nCarefully remove supernatant. Be sure not to disturb the Ni-NTA pellet. Users may choose to keep an aliquot of the supernatant for analysis via SDS-PAGE, particularly during the initial purification of a specific growth factor.\nAdd 25 mL of wash buffer.\nInvert tube several times to resuspend Ni-NTA pellet.\nCentrifuge the samples using a Beckman Coulter Allegra X-14R Centrifuge at 200 × g for 5 min at 4°C.\nRepeat steps 22–25 two more times.\nAdd 25 mL of wash buffer and resuspend the Ni-NTA pellet by inverting the tube.\nTransfer resuspension into a Bio-Rad gravity flow column.\nMonitor the protein content in the column flowthrough by mixing 10 μL with 200 μL of Coomassie Plus Bradford Reagent (Thermo Fisher).\nNote: The Bradford reagent will turn blue when protein is present. The speed of color change and intensity of the blue color can be used as visual markers to estimate how much protein is present.\nContinue washing the Ni-NTA bed with wash buffer until no protein is present in the column flowthrough (no or minimal color change when mixed with Bradford reagent).\nStopper the column.\nAdd 10 mL of elution buffer.\nRemove the stopper and collect the flowthrough in a 15 mL falcon tube.\nMonitor the protein content in the column flowthrough by mixing 10 μL with 200 μL of Coomassie Plus Bradford Reagent (Thermo Fisher).\nContinue adding elution buffer until no protein is present in the column flowthrough.\nTake an aliquot of the eluted sample and label it Elution. Store at −20°C until SDS-PAGE analysis.",
    "Using a DeNovix DS-11 microvolume spectrophotometer (or equivalent), measure the absorbance of the sample at 280 nm. Calculate the protein concentration using the Beer-Lambert law.\nFor removal of affinity tag and any fusion partners (e.g., if using pMCSG53-DsbC), add TEV protease to the eluted sample.\nTo determine how much TEV protease to add use the following formula: 45 μg of TEV protease for every mg of protein.\nNote: At this stage, for the purposes of TEV protease calculations, assume that 100% of the protein content present in the eluted sample is the growth factor protein of interest.\nPrepare dialysis tubing and add sample containing TEV protease.\nCut a 10–15 cm length of Snakeskin Dialysis Tubing, 10K mwco (Thermo Fisher).\nClip the bottom shut using 2 Dialysis Tubing Clips (Thermo Fisher) facing opposite directions.\nGently pour the sample into the open end of the dialysis tubing.\nUsing your fingers, flatten the top portion of the dialysis tubing to remove air.\nClose the top of the tube using a single Dialysis Tubing Clip.\nAttach a Slide-A-Lyzer Float Buoy to the top (single) dialysis clip.\nNote: At this stage, if purifying multiple orthologs of a growth factor or multiple growth factors, attach tape to the top of the float buoy to mark samples for identification.\nPlace dialysis tubing into a 1 L glass beaker containing pre-chilled dialysis buffer.\nAdd a magnetic stir bar and place the beaker on a stir plate in a cold room or cold cabinet.\nSet the stir plate to gently stir (∼25% of max settings depending on the specific stir plate used).\nIncubate sample overnight (∼16 h) at 4°C. During this stage TEV protease cleavage and dialysis will proceed concurrently.",
    "Note: Users may choose to replace the dialysis buffer with freshly prepared buffer halfway through incubation but this was not required in our application of this protocol.\nRemove the dialysis tubing from the beaker and carefully remove the float buoy and the top Dialysis Tubing Clip.\nCarefully pour the sample from the tubing into a new 15 mL falcon tube. Be sure to squeeze the tubing with your fingers to ensure all liquid is transferred.\nPour sample over a Ni-NTA bed pre-washed with binding buffer in a stoppered Bio-Rad gravity flow column.\nNote: The Ni-NTA from the previous chromatography step can be re-used for this step. If re-using, it is important to wash it with 20–30 mL of binding buffer before use.\nRemove the stopper and collect the flowthrough.\nNote: Upon TEV protease-mediated removal of the 6His affinity tag, the growth factor protein should no longer bind to the Ni-NTA column. Other impurities, as well as the TEV protease (which is 6His-tagged) should be retained by the Ni-NTA matrix.\nAfter all flowthrough has been collected, re-apply the sample to the stoppered Ni-NTA matrix.\nRemove the stopper and collect the flowthrough.\nRepeat steps 48 and 49 one additional time.\nMonitor the protein content in the last drops of column flowthrough by mixing 10 μL with 200 μL of Coomassie Plus Bradford Reagent (Thermo Fisher).\nIf protein remains in the flowthrough, add 1–2 mL of additional binding buffer and re-check using Bradford Reagent. Continue process until protein is no longer present in the flowthrough.\nLabel sample 2nd Ni-NTA Flowthrough and store on ice.\nAdd 10 mL of wash buffer to the Ni-NTA matrix and collect flowthrough.\nLabel sample 2nd Ni-NTA Wash and store on ice.",
    "Note: In rare cases, some proteins inherently bind to Ni-NTA even in the absence of a 6His tag. Washing the Ni-NTA matrix with wash buffer and collecting will recover most proteins should this scenario arise.\nAdd 10 mL of elution buffer to the Ni-NTA matrix and collect flowthrough.\nLabel sample 2nd Ni-NTA EB and store on ice.\nNote: Washing the Ni-NTA matrix with elution buffer accounts for any potential issues with TEV protease cleavage.\nAnalyze 5 μL of the Total Lysate and Clarified Lysate, and 10 μL of Elution, 2nd Ni-NTA Flowthrough, 2nd Ni-NTA Wash and 2nd Ni-NTA EB via SDS-PAGE using a 15% Tris-Glycine Mini Gel.\nNote: At this point, FGF2 should be present in the 2nd Ni-NTA Flowthrough and the purity is expected to be approximately 90–95%. There should also be a characteristic downward shift when comparing the dominant band present in Elution and the dominant band in the 2nd Ni-NTA Flowthrough sample. This shift indicates successful TEV protease cleavage and removal of the 6His and TEV sequence.\nNote: At this point, the growth factors will be suitable for most downstream applications. The necessity of the remaining steps will depend on the end-user and their specific applications.\nTransfer the purified growth factor sample (i.e., 2nd Ni-NTA Flowthrough) to a 15-mL, 10K MWCO Amicon Ultra Centrifugal Filter.\nNote: The filter pore size selected may differ depending on the growth factor target being purified. For example, EGF is smaller than 10K and should be concentrated using a 3K MWCO filter.\nCentrifuge the samples using a Beckman Coulter Allegra X-14R Centrifuge at 3700 × g for 5 min at 4°C.\nGently mix the liquid remaining in the filter using a P200 pipette. Visually inspect for the presence of white precipitate. If no precipitate is present, continue to next step.",
    "Centrifuge the samples using a Beckman Coulter Allegra X-14R Centrifuge at 3700 × g for 5 min at 4°C.\nContinue performing steps 60–62 until the sample volume is reduced to approximately 0.5 mL or reaches a concentration of 10 mg/mL.\nNote: We have routinely concentrated purified FGF2 orthologs to concentrations exceeding 10 mg/mL. Protein stability at high concentrations varies depending on the specific growth factor family.\nLoad the sample onto a Superdex 75 10/300 GL column pre-equilibrated with 1X PBS (or alternative buffer selected by end-user).\nRun FPLC at a rate of 0.5 mL/min, set fraction volume to 0.5 mL.\nAnalyze 5 μL of fractions corresponding to peaks (as indicated by UV280 measurement) via SDS-PAGE using a 15% Tris-Glycine Mini Gel.\nCombine fractions containing pure FGF2.\nUsing a DeNovix DS-11 microvolume spectrophotometer (or equivalent), measure the absorbance of the sample at 280 nm. Calculate the protein concentration using the Beer-Lambert law.\nAdjust concentration to desired level either by diluting using 1X PBS or concentrating as described above in steps 60–62.\nAliquot samples and flash-freeze using liquid nitrogen.\nStore at −80°C (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2752-Fig4.jpg\nFigure 4. Schematic of the protocol for large-scale growth factor expression and purification\nWestern blotting to validate bioactivity\nTiming: 2–4 days\nThis step outline one possible procedure for validating the bioactivity of purified growth factors. Validation via Western blotting seeks to show that the appropriate downstream pathways are being activated in response to treatment with growth factors. This step can also be used to compare different growth factor orthologs to determine which is most suitable for the desired applications of the end-user.\nCritical: These steps must be conducted in lamellar flow cabinet using proper aseptic technique.\nSeed NIH-3T3 Murine fibroblasts (ATCC CRL-1658) into 6-well tissue culture plates at a density of 100,000 cells/well.",
    "Note: A minimum of two wells is required to test a single growth factor (one for treated, one as a control well). Scale the number of wells accordingly depending on the number of growth factors, orthologs, or replicates desired. If testing for dose-dependency, additional wells will be required.\nAdd 1 mL of DMEM [high glucose, pyruvate] (GIBCO 11995065) containing 10% heat-inactivated fetal bovine serum to each well.\nMove 6-well plate to a VWR Symphony CO2 Incubator.\nIncubate cells at 37°C and 5% CO2 for 24 h to allow for attachment.\nMove 6-well plate to lamellar flow cabinet.\nGently aspirate the media using a pipette, discard.\nWash cells by adding 1 mL of sterile 1X PBS.\nGently aspirate the 1X PBS using a pipette, discard.\nRepeat steps 78 and 79.\nAdd 1 mL of DMEM [high glucose, pyruvate] containing 0.11% heat-inactivated fetal bovine serum to each well.\nMove 6-well plate to a VWR Symphony CO2 Incubator.\nIncubate cells at 37°C and 5% CO2 for 24 h for serum starvation.\nNote: If using a cells/cell line grown in serum free conditions, the equivalent starvation step would be incubation in the absence of any growth factors typically used in growth media.\nMove 6-well plate to lamellar flow cabinet.\nGently aspirate the media using a pipette, discard.\nWash cells by adding 1 mL of sterile 1X PBS.\nGently aspirate the 1X PBS using a pipette, discard.\nRepeat steps 86 and 87.\nAdd 1 mL of DMEM [high glucose, pyruvate] containing 10 ng/mL of purified growth factor.",
    "Note: The optimal concentration of purified growth factor will vary depending on which growth factor family is being tested. It is recommended to test a range of concentrations to determine the most suitable usage levels for the specific cell system of interest. Recommended starting concentrations are listed in the table below:\ntable:files/protocols_protocol_2752_16.csv\nMove 6-well plate to lamellar flow cabinet.\nIncubate cells at 37°C and 5% CO2 for 24 h.\nCritical: The incubation time for step 92 is dependent on the growth factor family being tested. For FGF2, PDGF-BB, and IGF1 we incubate for 24 h. If testing TGF-β1, cells were incubated for 45 min.\nMove 6-well plate to lamellar flow cabinet.\nGently aspirate the media using a pipette.\nWash cells by adding 1 mL of sterile, cold 1X PBS.\nGently aspirate the media using a pipette.\nRepeat steps 94 and 95.\nAdd 200 μL of ice-cold 1X RIPA buffer (Cell Signaling Tech. 9806) to each well.\nIncubate at 4°C for 1 h to allow for cell lysis to occur.\nAspirate the liquid and transfer to a 1.7 mL microcentrifuge tube.\nCentrifuge samples at 18,000 × g for 20 min at 4°C.\nRemove supernatant and transfer to a new 1.7 mL microcentrifuge tube.\nAdd an equal volume of 2X Laemmli sample buffer.\nIncubate at 95°C for 10 min.\nAnalyze 5–10 μL via SDS-PAGE using a 15% Tris-Glycine Mini Gel.\nCritical: Do note stain the Mini Gel prior to transfer to nitrocellulose.\nTransfer to nitrocellulose using a Bio-Rad TransBlot Turbo Transfer System.\nPlace the nitrocellulose membrane in a small container containing blocking buffer [Tris-buffer saline (TBS) with 5% w/v BSA and 0.1% v/v Tween-20] and incubate under gentle agitation for 1 h.\nDecant the blocking buffer into a waste container.",
    "Add 10 mL of TBST [TBS and 0.1% v/v Tween-20] to container containing nitrocellulose membrane and incubate under gentle agitation for 10 min.\nDecant the TBST solution into a waste container.\nRepeat steps 108 and 109 two more times.\nDilute primary antibody 1:1000 in TBST + 5% BSA, add to nitrocellulose membrane.\nNote: The choice of primary antibody will depend on the specific growth factor being tested. FGF2, IGF1 and PDGF-BB activate the MAPK Erk1/2 pathway, TGF-β1 activates SMAD signaling).\nFGF2, IGF1, PDGF-BB: phospho-p44/42 MAPK ERK1/2 rabbit mAB (Cell Signaling Technologies 9101) and p44/42 MAPK ERK1/2 rabbit mAB (Cell Signaling Technologies 4695).\nTGF-β1: phosphor-smad2 rabbit mAB (Cell Signaling Technologies 3108) and smad2 rabbit mAB (Cell Signaling Technologies 5339).\nIncubate at 4°C for 16 h under gentle agitation.\nDecant primary antibody solution.\nAdd 10 mL of TBST to the container and incubate under gentle agitation for 10 min.\nDecant the TBST into a waste container.\nRepeat steps 114 and 115 two more times.\nDilute secondary antibody (anti-rabbit IgG:HRP) 1:2000 in TBST + 5% BSA, add to nitrocellulose membrane.\nIncubate at room temperature for 1 h under gentle agitation.\nDecant secondary antibody solution.\nAdd 10 mL of TBST to container and incubate under gentle agitation for 10 min.\nDecant the TBST into a waste container.\nRepeat steps 120 and 121 two more times.\nTransfer the nitrocellulose membrane to a clean container.\nAdd 7 mL of Bio-Rad Clarity Western ECL substrate solution.\nIncubate at room temperature for 5 min under gentle agitation.\nVisualize using a Bio-Rad Chemidoc XRS+ system (or equivalent) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2752-Fig5.jpg\nFigure 5. Representative results of purification and bioactivity screening",
    "(A) SDS-PAGE of FGF2 purification. E – Elution; +TEV – 2nd Ni-NTA flowthrough collected after TEV protease cleavage. The shift in size of the band is due to the removal of the 6His and TEV recognition sequence.\n(B) Western blot analysis of cell extracts treated with FGF2. C – commercial FGF2; NC – negative control – no FGF2; 1–5 – FGF2 orthologs; PC – positive control – 10% FBS. Panel B was adapted from1[href=https://www.wicell.org#bib1]."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Tissue Engineering",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}