{
  "id": 12131,
  "origin_website": "Jove",
  "title": "Evaluation of the Feasibility, Safety, and Accuracy of an Intraoperative High-intensity Focused Ultrasound Device for Treating Liver Metastases",
  "procedures": [
    "The protocol was reviewed and validated by a national ethics committee according to French and European directives, with written consent from the patients.\n1. Inclusion\nInclude patients with resectable CLM and a good clinical condition (Eastern Cooperative Oncology Group ECOG/World Health Organization WHO performance status 0-1) who are at least 18 years old. Obtain written consent from the patients.\nExclude patients with previous liver, biliary, or major abdominal surgery, pregnancy, or an inability to be followed for the duration of the study.\n2. HIFU Treatment\nPerform the anesthesia of the patient with an induction composed of propofol (2 to 3 mg/kg), sufentanil (0.2 to 0.3 µg/kg), cisatracurium (0.15 mg/kg) and ketamine (0.15 mg/kg).\nMaintain anesthesia with sevoflurane to target a bispectral index between 40 and 60.\nPerform tracheal intubation, with the lungs mechanically ventilated with inspired oxygen fraction of 80%.\nPrepare the HIFU device in the operating room by covering the sterilized HIFU probe with the dedicated sterile envelope containing a sterile ultrasound coupling liquid (Figure 1).\nNOTE: The HIFU probe was sterilized using a low-temperature gas plasma sterilizer.\nPerform laparotomy using a monopolar knife after classic surgical asepsis.\nPlace the retractors under the rib cage and between the edges of the surgical incision.\nConfirm liver resection by exploring the liver using intraoperative diagnostic ultrasound images with a 7.5 MHz T-type transducer and palpation to confirm that no additional metastasis compromising the resection was missed with preoperative imaging22.\nFree the liver from its peritoneal and vascular attachments with scissors.\nPlace a protective abdominal gauze sponge (20 x 20 cm2) with X-ray detectable threads under the targeted area to inhibit ultrasound propagation and unintended HIFU damage to adjacent organs.\nBring the HIFU probe in contact with the liver surface (Figure 2).",
    "Move the HIFU probe on the surface of the liver until the position of the expected HIFU ablation (represented by the white cone superimposed on the sonogram) is at the right location according to the objectives of the different phases (Figure 3a).\nActivate the HIFU exposure by activating each emitter with the same phase for 40 s. Apply an acoustic power of 70 W (free-field acoustic power) for superficial ablations and 90 W (free-field acoustic power) for in-depth lesions.\nUltrasound images were not synchronized with HIFU exposures and, therefore, interferences were visible in sonograms during ablations. Observe that boiling is created in liver tissues treated during HIFU single exposures. Note that a cloud of ebullition appears momentarily for 1 min at the location of the lesion (Figure 3b).\nNOTE: The single lesion appears on the sonogram as a hyperechoic zone at its center and a hypoechoic zone at its boundaries (Figure 4a).\nMark the position of the HIFU probe, mainly the acoustic axis at the surface of the liver, using a surgical marker, to know where to cut the liver for gross examination (Figure 2).\nMeasure the dimensions of the HIFU ablations along two orthogonal planes after each HIFU exposure, using the integrated ultrasound imaging probe.\nMove the HIFU probe on the liver surface to confirm that all eight liver segments can be covered, irrespective of their conformation in the individual patient.\n3. Macroscopical and Histological Evaluation of HIFU Lesions\nPerform the planned liver resection using a Kelly clamp to crush the liver parenchyma and a scissor to cut the liver. Perform hemostasis with titanium clips and/or irrigating bipolar forceps.\nClose the aponeurosis with monofilament, long-lasting absorbable N° 0 or N° 1 suture material.\nClose the skin with uncolored, short-term absorbable N° 3/0 suture material.",
    "Give the patient oral acetaminophen (1 g every 6 h).\nNOTE: Nausea and vomiting were treated with 4 mg of intravenous ondansetron. Oral fluids and feeding were started on the day after surgery. Morphine was given to obtain a pain visual analogic scale under 30/100.\nSeparate the HIFU ablations and areas of CLM with a scalpel.\nCut the ablations along the exposure axis with a scalpel.\nTake pictures of the HIFU ablations.\nMeasure the dimensions of the ablated area macroscopically with a ruler and on a photograph, using appropriate image analysis software.\nSlice each ablation into 5 mm sections to assess macroscopic homogeneity.\nFix the ablated areas in 10% phosphate-buffered formalin (pH = 7), embed them in paraffin, and stain them with hematoxylin and eosin.\nHistologically examine the ablated and surrounding tissues.\n4. Follow-up\nFollow the patients for one month according to the institution’s guidelines for patients resected for CLM.\nSummarize data regarding demographic characteristics, vital signs (baseline and 5 min after HIFU), and safety observations and measurements regarding the HIFU lesions.\nUse Spearman’s rank correlation coefficient to test the association between variables."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}