{
  "id": 6583,
  "origin_website": "Bio",
  "title": "Immunoelectron Microscopy in <em>Chlamydomonas Cells</em>",
  "procedures": [
    "Sample preparation: Spin down the samples of C. reinhardtii culture in 2 ml Eppendorf tubes at 13,000 x g at room temperature for 5 min. The optimal volume of the obtained pellet, which would be sufficient for embedding in 2-3 gelatin capsules, is about 50-75 μl.Fixation:Remove supernatant and add 0.5 ml of fixation solution (4% paraformaldehyde). For proper fixation, the minimum incubation time is 3 h at 4 °C. Note: Duration of fixation can be prolonged up to several days. This fixation solution preserves membranes and most proteins, but it may dislocate starch and proteins after several weeks of storage. Embedding (all steps are carried out at room temperature):Wash the pellet with PBS buffer in the same Eppendorf tube:Remove supernatant with pipette.Add 1 ml of PBS buffer and vortex it gently.Incubate for 5 min.Spin down as described in step 1.Repeat this washing step 3 times. Dehydrate pellet with series of ethanol dilution, twice in each concentration of ethanol:20% (v/v) 15 min + 15 min40% (v/v) 15 min + 15 min50% (v/v) 20 min + 20 min70% (v/v) 20 min + 20 minFor each dehydration step, discard previous solution and add 0.5 ml of the next sequential solution with clean pipette. Incubate for the indicated time. We recommend using freshly prepared solutions pre-chilled at 4 °C. Take care not to touch or disturb the pellet during these steps. Note: It is handy to use a disposable plastic Pasteur pipette with a thin tip to discard the solutions. If the pellet is disturbed, centrifuge the Eppendorf tube as described in step 1. If it is necessary to interrupt the procedure at this step, the samples can be stored in 70% ethanol overnight at 4 °C.",
    "Infiltration: Sequentially replace 70% ethanol with the mixture of 70% ethanol and LR White resin:3:1 70% ethanol: LR White for 1 h1:1 70% ethanol: LR White for 1 h1:3 70% ethanol: LR White for 1 hNext steps require the complete replacement of ethanol with LR White resin: Replace the 1:3 ethanol/resin mixture with LR White resin alone for 1 h.Replace it again with fresh portion of the LR White resin and leave overnight. Next day replace it with new portion of the LR White resin and keep it for embedding.Note: LR White resin should be mixed with catalyst according to manufacturer’s protocol for 24 h before use. With time, a resin-ethanol mixture may stratify into layers. If this happens, mix the layers gently several times with a pipette (care should be taken not to damage the pellet).Embedding: Put gelatin capsules into wells of 96-wells immunology plate.Add one drop of the resin into each gelatin capsule.Put a small piece of the pellet into the capsule – one pellet usually goes into 2-3 capsules.Fill up capsules with resin. Avoid overflow. Close capsules carefully with their caps.Incubate at 37 °C for 1-4 days (or at 45 °C for one day) and then at 55 °C until polymerization is completed (usually 1-3 days).Note: Longer incubation at lower temperature helps to receive softer block, shorter incubation at higher temperature helps to receive firmer block, but more fragile. Completeness of polymerization can be checked with a needle: The resin should be solid but not fragile.Cut the sample into sections with a microtome and place them onto Formvar and carbon-coated nickel grids.Note: Formvar+carbon coating prevents unspecific labeling and improves the quality of sections (without carbon layer sections often get wrinkled).",
    "ImmunocytochemistryCarry out all of the following manipulations with grids on the surface of 50-100 μl drops on a hydrophobic surface (e.g. plastic Petri dish or Teflon plate).A tip: For better interaction of grid surfaces with solution, put the hydrophobic surface with drops and grids on a table that is slightly trembling due to vibration of a vortex. Adjust the intensity of the vibrations so that trembling of the drop surfaces would be noticeable. When overnight incubation of the grids is required, put them into a wet chamber at 4 °C. Do not allow grids to dry out during next steps.Block nonspecific interaction of antibodies on a drop of 20% goat serum in BSA-TBS for 1 h.Note: If nonspecific labeling still happens, increase the proportion of the goat serum up to 50% and BSA up to 5%.Put the grids onto the 100 μl drops with properly diluted primary antibodies raised against the protein of interest. The dilution can be determined only empirically; usually it is in range of 1:16 – 1:128.For negative control, apply rabbit serum or, better, the pre-immune serum instead of primary antibodies to the target protein.Add purified protein of interest to solution of primary antibodies as positive control.Leave grids overnight at 4 °C. You may vary time and temperature to increase or decrease the efficiency of binding and the intensity of labeling.Wash grids on drops with TBS 5 times, leaving them on drops for 5-10 min between changes of TBS solution.Transfer grids onto 100 μl drops of properly diluted (according to the protocol of manufacturer) Anti-Rabbit IgG conjugated with 10 nm colloidal gold particles in BSA-TBS and expose them for 1 h at room temperature.Wash grids on drops with TBS 5 times, then with deionized water.",
    "These washing steps should be done by quick repeated submersion of grids into 3-5 ml of TBS and water during 1 min.Dry grids on filter paper and put them into grid storage box.Optional – sequentially contrast the grids with uranyl acetate and lead citrate. Prepare wet chamber with NaOH crystals and filter paper wetted with 0.2 M NaOH (Figure 1). Put grids onto 100 μl drops of uranyl acetate for 45-60 min. Pour 50 μl drops of lead citrate onto the same plate. Wash grids by quick repeated submersion first into 3-5 ml of 0.2 M NaOH (5-10 times), and then – into 3-5 ml of boiled deionized water (for 1 min). NaOH solution and boiled water are needed to avoid the reaction of CO2 with lead, which results in formation of insoluble crystals. Put grids onto prepared lead citrate drops for 5-7 min. Wash in the same way as performed after uranyl acetate. Dry grids on filter paper and put them into grid storage box. Analysis of sections with electron transmission microscope.Note: Only a few gold particles are allowed to be as a background in negative and positive controls.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130214/20130214200640_8242.jpgFigure 1. Wet chamber with NaOH crystals for the contrast staining"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}