{
  "id": 19413,
  "origin_website": "Jove",
  "title": "Isolating and Culturing Vestibular and Spiral Ganglion Somata from Neonatal Rodents for Patch-Clamp Recordings",
  "procedures": [
    "All animal use described here has been approved by the Institutional Animal Care and Use Committee at the University of Southern California. Animals in this protocol are P3- to P25-aged Long Evans rats of both sexes obtained from Charles River Laboratories, but these methods can be applied to other rodent strains. A laboratory coat and gloves must be worn during all procedures, as well as splash-protective goggles when making solutions.\n1. Preparations\nNOTE: The solutions and tools described in this section can be made well ahead of time to be used on the day of dissection and recording.\nPrepare Liebovitz media supplemented with 10 mM HEPES (L-15 solution). The following steps describe making 1 L of L-15 solution.\n\t\nPour 990 mL of deionized H2O into one beaker. Measure and add 2.386 g (10 mM) of HEPES. Add one bottle of 1 L of L-15 solution powder.\n\t\tNOTE: Powdered L-15 has a longer shelf life and takes up less storage space. Alternatively, purchase L-15 solution and supplement with HEPES. The latter option also has the option of using a phenol-free solution, which is useful for fluorescence imaging.\nStir the solution on a stir plate. Using a pH meter, slowly add 1 N sodium hydroxide (NaOH) to obtain a pH between 7.34 and 7.36.\nAdd deionized H2O until the solution reaches a volume of 1,000 mL. Filter the solution using a 0.22 µm pore size membrane.\n\t\tNOTE: L-15 solution can be stored at 4 °C for around 1-2 weeks. If using L-15 made with phenol-red, the solution will turn pink if too basic (pH > 7.4) or orange if too acidic (pH < 7.34).\nPrepare the culture medium for vestibular ganglion neurons (VGNs) (with modification for SGNs). Follow the steps below to make 50 mL of culture medium:",
    "Add 47.5 mL of GluMAX-I minimum essential medium to a clean glass beaker.\nMeasure and add 0.1194 g (10 mM) of HEPES. This additional buffer resists pH changes while the cells settle, before being moved to the incubator.\nAdd 2.5 mL of fetal bovine serum (FBS). This makes 5% by volume FBS in a total volume of 50 mL of medium. For SGN preparations, 2.5 mL of FBS is substituted with 0.5 mL of N2 and 1 mL of B27 solutions.\nStir the solution on a stir plate. Using a pH meter, slowly add 1 N NaOH to obtain a pH between 7.38 and 7.4.\nAdd 0.5 mL of penicillin-streptomycin. Filter the solution through a 0.22 µm sterile filter. Store the solution at 4 °C.\nAt least 30 min before use, transfer the culture media to a tissue culture flask with a vented cap. Place the flask with culture media in an incubator with 5% CO2 concentration at 37 °C.\nPrepare the perforated-patch internal solution\n\tNOTE: Here, 100 mL of perforated-patch internal solution is used for whole-cell recording (recipe is summarized in Table 1). These solutions can be prepared well in advance and stored at -20 °C. Aliquots can be stored indefinitely at -20 °C if they don't undergo a repeated cycle of freezing and thawing.\n\t\nUp to 6 months ahead of time, make and store stock solutions of the following: 1 M KCl, 0.5 M Mg2Cl (hexahydrate), and 0.5 M CaCl2. Store in airtight bottles for up to 6 months at 4 °C.",
    "NOTE: It is a good idea to check the osmolality of the stock solutions (2,000 mOsm for the 1 M KCl stock solution; 1,500 mOsm for the Mg2Cl and CaCl2 solutions) to make sure the target concentration is reached. Do not use if the solution becomes cloudy or forms precipitates. This can be a possible pause point.\nOn the day of internal solution making, follow the below steps using the stock solutions from step 1.3.\n\t\nMeasure 100 mL of milli-Q (MQ)H2O. Draw out 40 mL from the 100 mL and set aside in a clean beaker.\nAdd the remaining 60 mL of H2O to a clean and sterile 100 mL beaker. Add 2.5 mL of 1 M KCl, 1 mL of 0.5 M Mg2Cl-hexahydrate, and 0.02 mL of 0.5 M CaCl2.\nAdd a stir bar and place the beaker on a stir plate. Stir till completely dissolved. Add 1.307 g of K2SO4. Stir until the K2SO4 dissolves.\nWeigh 0.1192 g of HEPES (target 5 mM in a 100 mL final volume) and add to the solution. Stir until dissolved.\n\t\tNOTE: Ensure that all the components are fully dissolved, as sometimes it takes time for the K2SO4 to dissolve.\nWeigh 0.1902 g of ethylene glycol-bis(β-aminoethyl ether)-N,N,N′,N′-tetraacetic acid (EGTA) (target 5 mM in a 100 mL final volume) and add to the solution. As EGTA does not completely dissolve in an acidic solution, place the beaker on a stir plate and insert the pH probe.\nWhile stirring, slowly titrate 1 M KOH until the EGTA fully dissolves. Expect this to take place when the pH is between 6 and 7. Continue to slowly add KOH until the final pH is 7.35 (approximately 1.2 to 1.3 mL of KOH in total).",
    "Add MQH2O to bring the solution to a final volume of 100 mL and stir. Check the osmolality of the solution (target 270 mOsm/kg for the perforated-patch solution) with an osmometer.\nFilter the perforated-patch internal solution using a 0.22 µm sterile filter. Store in 5 mL aliquots at -20 °C. Use a new aliquot for each new recording session.\n\t\t​NOTE: This can be a possible pause point.\n2. Fabricating trituration pipettes\nNOTE: Trituration pipettes can be reused for multiple experiments. Flush the pipettes with ethanol, water, and L-15 solution before each use and clean them with water and ethanol after each use. Carefully store between uses.\nTo prepare trituration pipettes for cell dissociation, hold a glass Pasteur pipette to the flame of a Bunsen burner. Once the glass tip begins to melt, stretch the glass out to the desired tip diameter. Pull one end of the pipette away from the flame to create a small bend.\nBring the bent pipette near to a microscope. Using a scoring tile, score and break the glass at the desired diameter.\nPass the tip of the pipette over the top of the Bunsen burner flame. This will quickly polish the rough edges near the tip. Check to ensure that the tip is not sealed by the flame.\nRepeat the process until four or five pipettes have been prepared with varying sizes.\n3. Fabricating patch pipettes\nNOTE: Prepare a set of patch pipettes before the recording session, but after ganglion dissection and culture. Although electrodes that are made one at a time during the recording session are optimal in performance, reasonable success has been achieved when these are made as a batch the night before. Store the pipettes in a covered glass container to protect the tips from dust.",
    "Use a vertical electrode puller and 1.5 mm outer diameter/1.17 mm inner diameter filamented borosilicate glass pipettes. Ensure that the glass is always kept free from dust and fingerprints.\nPull 8-10 recording pipettes using a two-step program, as recommended for patch-pipettes by the manufacturer.\nInspect and heat-polish every recording pipette tip with a microforge; heat-polishing promotes better sealing. The target pipette resistance is between 4 and 8 MΩ.\nStore the polished pipettes in a covered container. This can be treated as a pause point in the experiment.\n\tNOTE: Optimizing the pipette diameter to reach the target resistance range requires some trial and error with steps 3.2 and 3.3. Most commercial patch-clamp systems have a built-in membrane test feature for measuring the electrode resistance in the bath solution. The resistance is computed as a ratio of the steady-state output current in response to an applied 5 mV step stimulus. The pull settings in step 3.1 and the polishing in step 3.2 must first be adjusted using trial pipettes, until the resistance of the trial pipettes falls within the 4 to 8 MΩ range.\nOn the day of recording, coat the pipette tips to reduce the pipette capacitance and recording noise. To do so, wrap a small strip of paraffin film on the shaft of the pipette. It is not necessary to wrap all the way to the tip.\n\t​NOTE: An alternate strategy is to coat and heat set a silicone elastomer on the shaft of the pipette12.\n4. Extraction of vestibular ganglion and plating of vestibular neurons\nPreparation for dissection",
    "Prepare an enzyme mixture of L-15 solution with 0.05% collagenase and 0.25% trypsin. For example, add 0.001 g of collagenase and 0.005 g of trypsin to 2 mL of L-15 solution into a beaker, add a small magnetic stirrer, and stir until fully mixed. Set aside at room temperature.\nPrepare a commercially obtained guillotine by placing paper towels to the side and underneath the guillotine to minimize exposure of the benchtop and other surfaces to blood and other biological materials.\nLay out large stainless-steel scissors, large forceps, and large spring scissors. Keep a large spray bottle with 70% ethanol handy for head cleaning.\nFill a 100 mL beaker with L-15 solution and place on ice. Oxygenate the L-15 solution.\nLay out the spring scissors, surgical scissors, forceps, scalpel, and transfer pipette (see Table of Materials).\nPrepare a 60 mm Petri dish (for the gross dissection) and two 35 mm Petri dishes (for the cleaning/fine dissection of the ganglia). Fill the 60 mm dish with oxygenated L-15 solution using a 30 mL syringe with a 0.22 µm filter tip.\nEuthanasia, head-cleaning, and hemisection\n\t\nWeigh the pups to compute the appropriate dosage of fatal-plus dilution to administer intraperitoneally (~0.01 mL per 10 g).\nOnce a deep plane of anesthesia is reached, as assessed by a lack of response to the toe pinch, decapitate using the guillotine.\nRinse the head thoroughly with 70% ethanol and then thoroughly with L-15 solution.\nCompletely remove the skin from the skull. Bisect the head using large spring scissors by starting at the entry point of the spinal cord to the brain and making two cuts, the first cut through the top of the skull and the second through the bottom of the jaw. Finish bisecting the head using surgical scissors.",
    "Place both halves of the head brain side down in a 60 mm Petri dish filled with L-15 solution. Place the fresh tissue not currently being dissected on ice.\nExtracting the superior vestibular ganglion\n\t\nScoop out the brain using closed surgical scissors. Sever and remove the cranial nerve to completely detach the brain from the skull.\n\t\tNOTE: At this point, the otic capsule (shaped like the number 8) should be visible at the back of the head.\nUsing forceps and starting at the back of the head, pull clear membranous material off.\nCut the top of the skull out using surgical scissors. Remove excess tissue from the back of the head and neck to make the dissection area and otic capsule cleaner and easier to access.\n\t\tNOTE: Avoid making the dish too cloudy by discarding excess tissue throughout the procedure.\nTransfer the tissue to a second Petri dish with fresh L-15 solution. Locate the otic capsule and the auditory, superior vestibular, and inferior vestibular nerves. Cut away the auditory nerve and separate the superior and inferior ganglia using small spring scissors.\n\t\tNOTE: Although the somata of the vestibular nerve are found in both the inferior (thinner) and superior (thicker) ganglia, cells extracted from the superior ganglion have better survival.\nUsing a scalpel, gently shave off the bony ridge to weaken the bony area, under which the nerve dives into the bony capsule. Carefully remove debris with fine forceps, exposing the entire swollen portion of the ganglion.\nUse the fine spring scissors to cut and separate the ganglion from the peripheral nerve branch that is diving toward the utricle.\nRemove the superior ganglion using fine forceps, making sure not to pinch too close to the ganglionic tissue. Transfer to a 35 mm Petri dish with fresh L-15 solution.",
    "Before proceeding, pre-heat the enzyme solution: pour the enzyme mixture into a 35 mm Petri dish and place in a 37 °C incubator for 10-15 min.\nClean the ganglion using fine forceps and small spring scissors by removing bone (which appears white and crystallized in structure), excess tissue, nerve fibers, and any other superfluous structures. Take care to minimize the removal of any ganglionic tissue.\nTissue dissociation and plating\n\t\nTransfer cleaned ganglia into the pre-heated enzyme solution and place it back in the incubator for 10 to 40 min. Enzyme treatment is complete once the tissue starts to break apart but remains in one piece. Overtreating the tissue with enzymes will result in complete dissolution of the ganglia before trituration.\n\t\tNOTE: The amount of time that the tissue undergoes enzymatic treatment for depends on the age of the animal. For example, ganglia from P9 rats are treated with enzyme for 25 min, and ganglia from P15 rats are treated with enzyme for 35 min.\nTransfer the ganglia to the 35 mm Petri dish with fresh L-15 solution and incubate for 2-3 min.\nTransfer the ganglia to another 35 mm Petri dish filled with filtered culture media.\nUsing a 200 µL micropipette, pipette a ~150 µL drop of filtered culture media onto a coated glass-bottom dish. Do not add too much solution, as it is important to maintain surface tension to form a bubble of solution that remains over the glass coverslip.\nTransfer the desired number of ganglia (one to four) to the coverslip.",
    "Draw a small amount of culture medium from the culture dish to rinse the trituration pipette with medium to prevent the tissue from sticking to the sides of the glass pipette. Triturate by gently and repeatedly passing the tissue through the pipette until the ganglia are sufficiently dissociated.\n\t\tNOTE: Do not overwork the tissue to attempt single-cell suspensions or allow the cells to crash to the bottom of the dish using excessive positive pressure. Also, avoid forming air bubbles, as this will reduce cell survival. Gentle trituration is the key to achieving successful cell survival.\nLet the cells rest for 5 min. Check under a light microscope to see if the cells have settled on the coverslip.\nCarefully place a culture dish into a 37 °C incubator for 12-24 h. Again, make sure to keep the bubble of solution intact.\n\t\t​NOTE: When culturing for longer than 24 h, refresh the culture media daily. This can be a possible pause point.\nPlating SGNs\n\t\nFollow steps 4.2.1 to 4.2.5 of vestibular ganglion instructions to bisect the head.\nLocate the otic capsule (shaped like the number 8), and extract from the skull by chipping away at the edges using blunt forceps.\nChange the L-15 solution. The spiral portion of the otic capsule houses the cochlea with the organ of Corti. Chip away at the bone overlying the cochlear turns without damaging the underlying tissue, with fine forceps parallel to the curve of the bone.\nOnce enough bone has been removed to reveal the full extent of the cochlear turns, use small spring scissors to sever the modiolus (thick, white, fibrous tissue containing central axons of SGNs) at the base of the cochlea to free it from the rest of the otic capsule.",
    "Remove the stria vascularis by pinching the stria at the base with fine forceps. Unwind around the spiral and up to the apex to peel it free from the organ of Corti.\nCut the organ of Corti into two or three turns using small spring scissors such that it lays flat.\nExcise the modiolus from each turn with small spring scissors.\nRemove the spiral ganglion by cutting at the edge of where SGN fiber tracts project toward the hair cells.\nClean the ganglion using fine forceps by removing bone (which appears white and crystallized in structure), the modiolus (which appears white and fibrous), and any other superfluous structures. Take care to minimize the removal of any ganglionic tissue.\nFollow the same procedure as for enzymatically treating the spiral ganglion as used for the vestibular ganglion in section 4.4. Enzymatic times are typically shorter in the spiral ganglion, which is more elongated than the vestibular ganglion. Use smaller diameter trituration pipettes for the spiral ganglion as compared to the vestibular ganglion.\nTriturate the spiral ganglion in culture medium supplemented with N2 and B27, indicated in the recipe for culture media.\nPlace the culture dish containing the dissociated ganglia in a 37 °C, 5% CO2 incubator for 12-24 h.\n\t\t​NOTE: The protocol can be paused here.\n5. Recording\nNOTE: In this procedure, patch-clamp recordings from the isolated ganglion are typically performed 12-24 h after the plating. Other labs have reported results from neurons after much longer periods in culture10.\nPrepare the recording chamber\n\t\nUse the quick exchange recording chamber (or equivalent) that allows for patch-clamp recordings directly in the culture dish. Set up the chamber on the inverted microscope.\nInsert the glass-bottom culture dishes into the chamber.",
    "Feed the L-15 solution through a perfusion tubing system to the recording chamber. Stabilize the perfusion in-flow and out-flow in the chamber at a rate of 0.5-1 mL per minute.\nPrepare the internal solution for loading electrodes\n\t\nThaw an aliquot of the perforated-patch internal solution. Allocate 2.5 mL of the solution onto a 35 mm culture dish. Replace the lid on the culture dish and label as \"Tip Dip\". Set aside in a dust-free zone, as it is very important to keep this solution as clean as possible.\nWeigh 1 mg of amphotericin-B and add 20 µL of dimethyl sulfoxide (DMSO). Vortex and spin down the solution until all the amphotericin-B is in the solution. Add 10 µL of the DMSO/amphotericin-B solution to the remaining 2 mL of the defrosted perforated-patch internal solution. Withdraw and dispel the solution with a pipette two or three times to ensure that the DMSO/amphotericin-B has uniformly mixed into the internal solution. The solution will have a mild-yellowish tinge.\nDraw the amphotericin-B perforated-patch internal solution into a 3 mL syringe. Add a 34 G tip to the syringe. Wrap the syringe in aluminum foil and keep the syringe on ice.\n\t\tNOTE: This solution must be remade every 2 h to ensure the effectiveness of the amphotericin-B in perforating the cell membrane. Amphotericin-B is light sensitive, and it must be shielded from light using aluminum foil or other methods.\nPatch-clamp recordings\n\t\nVisualize the neurons using a 10x or 20x objective. Adjust the illumination and optimize the optics to see the boundaries and shadows around the cell.",
    "Check the quality of the isolated neurons. Only attempt neurons with smooth and even surfaces that are not too strongly contrasted and have only small, dispersed craters. Also, make sure to avoid pairs of neurons, neurons surrounded by debris, or other cells.\nUnder 100x magnification, identify a neuron or field of neurons to patch and line them up in the center of the field of view.\nFill the tip of the pipette with a clean solution that does not contain amphotericin by dipping the tip (for ~20 s) into the clean solution that was placed in a culture dish. Capillary action will draw a small amount of solution into the tip.\n\t\tNOTE: Perform this step under a stereo dissection microscope, which allows for determining how well the tip holds the Tip Dip solution. If the solution does not hold for ~10-20 s, the shape of the electrode is not ideal. In this case, reconfigure the electrode-pulling program to produce a longer tip.\nNext, fill the back of the pipette with the internal solution containing amphotericin. The filament within the pipette will draw down the solution to meet the clean solution in the tip. Allow the filament to smoothly pull the solution down, and do not attempt to tap out bubbles, as this will force the amphotericin to the tip too fast.\nUse a syringe to draw out solution that may be at the very back of the electrode.\n\t\tNOTE: It is very important to work fast from this point to land and form a high-resistance seal on the desired cell.",
    "Insert the pipette into the pipette holder. Check that the pipette is snug in the holder to prevent pipette drift. If the pipette is not stable, switch out the sealing O-rings in the front and back of the pipette holder to minimize drift and maintain strong suction. Replace the pipette with one that is freshly filled.\nLower the pipette into the bath of the recording chamber.\nLocate the pipette tip in the middle of the field of view. Ensure that the tip is free of air bubbles or other debris.\nApply a voltage step (5 mV) in the membrane test to monitor the pipette resistance. Continue monitoring the input resistance through the entire process of forming a seal on the cell.\nCancel the pipette offset potential, such that the pipette current reads zero in the membrane test mode of pClamp.\nCorrect for the pipette capacitance using the fast capacitance compensation function on the patch-clamp amplifier (Cp fast dials in the Multiclamp Commander soft panel).\nMove the pipette down to the cell.\nOnce the pipette is close enough to the neuron, switch to the higher magnification objective and send the image through a camera to a monitor (use a 40x objective, total 400x magnification). Adjust the pipette and re-center the neuron.\nMove the recording electrode close to the soma. Locate the center of the neuron on the monitor and position the recording electrode above the neuron.\nApproach the neuron from above, such that the electrode will land in the center of the spherical cell. Adjust the pipette offset to zero the constant DC potentials in the system.\nPosition the pipette close to the membrane. Land firmly on the center of the cell.",
    "NOTE: When landing, a small dimpling on the surface of the neuron and a doubling/tripling of the input resistance will occur.\nApply negative pressure (suction) using a syringe or mouth pipette. Turn on the holding potential of -60 mV. The seal resistance should increase until it passes a giga-ohm.\n\t\tNOTE: Work fast to reduce the time between filling an electrode and landing on a cell. There is a limited time before the amphotericin added to the perforated-patch internal solution in step 5.3.5 reaches the electrode tip. Once the tip is contaminated with amphotericin, it is difficult to form high-resistance seals, and the resistance often plateaus to ~200 megaohms.\nOnce a giga-ohm seal forms, release the negative pressure. As soon as the seal forms, apply fast-capacitance compensation to reduce the amplitude of the pipette capacitance transients in membrane test mode as much as possible.\nAs amphotericin begins to work, watch as the input resistance slowly decreases and the current flowing in response to the 5 mV voltage step progressively increases as the amphotericin enters the membrane. A sudden decrease in series resistance instead of gradual stabilization suggests that spontaneous rupture has occurred.\nEstimate the whole-cell capacitance and the series resistance using the amplifier's capacitive transient nulling function. Document and monitor the series resistance at the beginning of, and regularly during, the experiment.\n\t\tNOTE: The series resistance can take anywhere from 5-20 min to stabilize, depending on the size of the electrode and how much clean solution is drawn into the pipette. Voltage-clamp and current-clamp modes can be used once the series resistance has stabilized below 30 megaohms. Swelling or shrinking of the neurons during recording is sometimes observed, but rarely when the osmolarity and pH of the solutions are correctly adjusted.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}