{
  "id": 18919,
  "origin_website": "Jove",
  "title": "A Modified Heterotopic Swine Hind Limb Transplant Model for Translational Vascularized Composite Allotransplantation (VCA) Research",
  "procedures": [
    "In this video publication, all animal procedures were conducted in accordance with an animal protocol approved by the Johns Hopkins University Institutional Animal Care and Use Committee (IACUC).\n1. Preoperative Planning\nWe utilize MHC-defined MGH inbred miniature swine (15-20 kg) in our translational studies for limb allotransplantation wherein one male donor provides limbs for two female recipients (Figure 1). Prior to surgery, donor and recipient animals undergo thorough clinical evaluation by a veterinarian.\nIn order to minimize anesthesia and ischemia time, donor and recipient procedures are conducted simultaneously on three operating tables in one dedicated large animal operating room. Teamwork and coordination among surgical teams as well as the veterinary staff are critical for overall success of this procedure. The surgical plan is discussed with the veterinary team in a formal meeting 1-2 weeks prior to the day of surgery.\nA tunneled central venous catheter (7 Fr double lumen Hickman catheter) is placed in an external or internal jugular vein of each recipient animal prior to transplant for immunosuppressive drug level monitoring and intravenous administration of immunosuppressive and/or immunomodulatory drugs. These catheters are placed under direct vision through a venous cut-down technique and tunneled posterior to exit high on the dorsal neck and secured using monofilament nonabsorbable sutures and adhesive bandage wrap around the neck.\nKeep animals NPO (no solid food but are allowed water ad lib) at least 12 hr before surgery.\nOn the day of surgery, sedate animals with ketamine 20 mg/kg and xylazine 2 mg/kg IM.\nPlace an appropriately sized endotracheal tube and connect it to the anesthesia machine and ventilator (maintained on isoflurane 0.5-3%)\nPlace an intravenous catheter in a marginal ear vein and administer weight based 0.9% saline throughout the procedure.\nAdminister pre-emptive analgesia (buprenorphine 0.02 mg/kg IV).",
    "Administer prophylactic antibiotic (cefazolin 20-25 mg/kg IV) prior to the initial incision to both donor and recipient animals.\nUse sterile technique in all procedures for both recipients and donors. This includes the use of autoclaved or gas sterilized instruments, masks, head caps, sterile surgical gowns and sterile gloves. Shave the area of the incision with a clipper and disinfect with alternating Betadine solution and alcohol.\nIntraoperative Monitoring:\nAfter induction and intubation, maintain anesthesia with an inhalation mixture 0.5-3% isoflurane in oxygen.\nMonitor heart rate, pulse oximetry, ECG, end-tidal CO2 and rectal temperature continuously and record every 15 min.\nPrevent hypothermia with a Bair Hugger warm forced-air blanket.\nOsteomyocutaneous Limb Allograft Harvest from Donor Pig:\nPlace the donor animal in a supine position on the operating table and drape in a sterile manner.\nUse near-infra red laser angiography to identify perforator vessels to the anteromedial skin. Inject indocyanine green at approximately 0.06 mg/kg diluted in 2-5 ml of normal saline through peripheral vascular access. Approximately 10 sec later, perform 30 sec-2 min of near infrared recordings. Use the video from these recordings to identify perforators. Based on perforators, mark an area of skin (approximately 100 cm2) for monitoring.\nUse a scalpel to make a groin skin incision in continuity with markings for the skin paddle (Figure 2).\nIdentify femoral vessels and isolate them distally to the level of the suprageniculate branches and proximally to the level of the inguinal ligament.\nDissect the skin and subcutaneous tissue while preserving the area of the skin paddle. Suture the edges of the skin to underlying muscles to avoid contraction during flap harvest.\nPerform an osteotomy just above the tarsus using a reciprocating saw (Electric Pen Drive, Synthes, West Chester PA).\nDivide the muscles in the proximal thigh using electrocautery.",
    "Divide the femur at mid-shaft leaving an osteomyocutaneous flap on a vascular pedicle. The flap contains the skin paddle, underlying thigh muscles, knee joint, distal femur and proximal tibia which includes intact vascularized bone marrow with its unique immunologic features.\nUse bone wax to achieve hemostasis in the marrow spaces. Smooth bone edges using ronjeurs in preparation for the recipient.\nKeep the graft perfused on its vascular pedicle until the recipient’s femoral vessels are prepared (Figure 3).\nOnce the recipient dissection is complete, ligate the donor femoral vessels as proximal as possible and infuse the graft with histidine-tryptophan-ketoglutarate (HTK, Custodiol, Newtown PA) prior to transplantation.\n\tNOTE: The donor limb is transplanted on the contralateral side of the recipient i.e. the left donor limb for the right side of the recipient and the right donor limb for the left side of the recipient).\nEuthanize the donor pig immediately after harvesting the second hind limb using 100 mg/kg IV sodium pentobarbital. Death is confirmed by the veterinary staff per established protocol.\n4. Recipient Procedure (Hind Limb Allotransplantation)\nStart the recipient induction and intubation immediately after the initial donor incision to allow preparation of recipient vessels while the donor limb is being harvested. This eliminates unnecessary wait time and reduces the total anesthesia time for the donor and recipients.\nPosition the animal supine with a 30° rotation on the operating side to allow exposure of the dorsolateral side.\nMake a groin incision and expose the femoral vessels; isolate them distally to the level of the suprageniculate branches and proximally to the level of the inguinal ligament.\nCreate a subcutaneous pocket from the groin to the dorsolateral abdominal wall for the graft inset (Figure 4).\nLigate the donor vessels and flush the graft with HTK.",
    "Perform the graft inset in an inverted manner: Have the skin paddle facing dorsolateral to allow easy immune monitoring in a standing position and the cut ends of the femoral vessels facing caudally to allow end-to-end vascular anastomoses without any tension on the vessels (Figure 5).\nIf available, use a vascular coupling device (Synovis, St Paul MN) for venous anastomoses (size 2.5-3.5 is suitable for 10-20 kg animals). This significantly reduces ischemia time when compared to conventional methods.\nPerform arterial anastomoses using a conventional suture technique with 9-0 suture (Synovis, St Paul MN)\nAfter vascular patency is confirmed, secure the graft in place with 3-0 PDS sutures (Figure 5). The muscles of the graft are sutured to the abdominal wall muscles. The graft muscles should not be sutured to the recipient thigh muscles since it can be deleterious when the animal moves around the cage.\nExteriorize the skin paddle on the dorsolateral side for immune monitoring (Figure 6) and suture it to the adjacent skin using 3-0 Vicryl subcutaneous sutures and 4-0 monofilament absorbable interrupted skin sutures.\nClose the groin skin in layers using 3-0 Vicryl subcutaneous sutures and 4-0 monofilament absorbable interrupted skin sutures.\nPlace a 50-100 mcg/hr fentanyl patch for post-operative analgesia.\nAfter hind limb allograft transplantation, return the animal to its pen once awake and breathing comfortably on its own.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}