{
  "id": 12290,
  "origin_website": "Jove",
  "title": "Utilizing Functional Genomics Screening to Identify Potentially Novel Drug Targets in Cancer Cell Spheroid Cultures",
  "procedures": [
    "1. Preparation of 96-well siRNA Plates\nNOTE: The outer edges of a 96-well plate are more prone to evaporation compared to other wells, thus limit the amount of siRNAs to 60 per 96-well plate. Fill in outer wells with plain medium or PBS to limit this. In addition, a validation screen of hits is recommended to alleviate plate biases.\nDilute the siRNAs to 250 - 500 ng/μL in reduced serum medium (as per manufacturer's recommendations) and aliquot 10 μL to the appropriate wells of the ultra-low attachment plate. Perform all screens in triplicate.\n\tNOTE: Incorporate appropriate non-targeting (negative) and killing (positive, such as UBB and PLK1) siRNA controls in the plate design to ensure transfection efficiency can be assessed. The use of low-attachment plates for the siRNA work is critical, as cells will be added to the transfection mixture. We cannot rule out that some manufacturers ultra-low attachment plates may have subtle effects on spheroid growth. As such we recommend that these are tested by the end user.\nCover plates with adhesive seals and store at -20 °C.\n2. Reverse Transfection of Cell Line\nOn the day of the screen, defrost the plates at room temperature and spin for 5 min at 1,000 x g using a bench-top centrifuge. Add 10 μL of reduced serum medium containing the optimized-transfection reagent to each well using a multichannel pipette. Leave plates for 15 min for transfection complexes containing siRNA to form.\n\tNOTE: This study utilized the breast cancer cell line BT474 for functional genomic screening (cultured in high glucose DMEM (Dulbecco's Modified Eagle Medium) supplemented with 10% fetal bovine serum (FBS) and antibiotics).",
    "Trypsinize the cells to be screened (0.05% trypsin and 0.53 mM EDTA) until they detach from the flask, neutralize using appropriate volume of cell line specific medium and spin for 5 min at 1,000 x g on a bench-top centrifuge to remove trypsin. Resuspend cells with an appropriate volume of medium and determine accurate cell number using a cell counter.\n\tNOTE: Typically 5,000 cells per well are sufficient for spheroid formation across most cell lines tested. It is important to accurately count the cells as a single cell suspension for accurate size comparisons.\nDilute cells to 5,000 cells per 180 μL in cold medium (4 °C).\n\tNOTE: The addition of reconstituted basement membrane matrix components will negatively impact transfection efficiency and it is recommended that it is not used. Cell line optimization to confirm spheroid forming capacity and knockdown efficacy should be performed prior to the screen.\nTransfer the cell suspension to a reservoir, pipet to mix and add 180 µL to each well of the 96-well ultra-low attachment plate containing the siRNA prepared previously (2.1).\nCentrifuge the plate at 1,000 x g in a precooled 4 °C centrifuge for 10 min and then return to a 37 °C tissue culture incubator.\nNOTE: The cells will appear as a mosaic in the bottom of the wells. Over the next 12 - 24 h the cells will aggregate together to form a single sphere.\nAfter 24 h, observe the cells form a single spheroid in the center of the well. Add 100 µL of complete medium to each well to encourage growth.\nReplenish medium after three days. Gently remove 100 µL of medium from each well and add 100 µL of fresh medium.",
    "On day 7, quantify the automated spheroid size on a plate reader that can quantitatively monitor spheroid growth over time (see Section 3).\nAfterwards, determine cell viability using a luminescent cell viability dye (see Section 4).\n3. Automated Image Acquisition\nScan the plates on a bench-top, micro-well plate imaging cytometer on day 7.\n\t\nOpen the software, select the following: '96-well plate', select the appropriate plate type and enter an experiment name. NOTE: Any additional information can also be added into the software.\nSelect the 'Tumorsphere' application. Alter the focus so that the spheroid is in focus and has optimal contrast.\n\t\tNOTE: We recommend 'image based focus' as significant variations in spheroid sizes are expected.\nSelect the wells that require scanning and 'Start scan'.\nUsing the plate scanner software, ensure that the object mask accurately represents the spheroid size. Do this by adjusting the colony diameter, border dilation, minimum thickness and precision settings, specific to each cell line tested 11,12.\n\t\tNOTE: The spheroid area will then be calculated using the software algorithm. For example, to accurately calculate the area of BT474 spheroids grown for seven days adjust precision to 'high' and set the minimum colony diameter to 200 µM. This should produce an appropriate spheroid mask representative of the spheroid area.\n\t\tNOTE: These data can then be exported from the machine, using the export function, in in the form of an annotated data file. Date is plate median normalized, combined and analyzed either by z-score or strictly standardized mean difference (SSMD) to identify siRNAs that had a statistically significant effect on spheroid area.\n4. Determining Cell Viability\nAfter spheroid area has been calculated, determine the viability using a luminescent viability cell dye. Prepare the reagent as per the manufacturer's instructions.",
    "Carefully remove 100 µL of medium from each well and add 100 µL of viability dye. Incubate plates for 15 min then scan using a luminescent plate reader.\n\tNOTE: These data can then be exported from the machine, using the export function, in in the form of an annotated data file. Date is plate median normalized, combined and analyzed either by z-score or strictly standardized mean difference (SSMD) to identify siRNAs that had a statistically significant effect on spheroid viability."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}