{
  "id": 8609,
  "origin_website": "Jove",
  "title": "Non-Invasive Modulation and Robotic Mapping of Motor Cortex in the Developing Brain",
  "procedures": [
    "All the methods described in this protocol have been approved by Conjoint Health Research Ethics Board, University of Calgary (REB16-2474). The protocol is described in Figure 1.\n1. Non-invasive brain stimulation contraindications\nScreen all participants for contraindications for TMS15 and tDCS1 prior to recruitment.\n2. Transcranial magnetic stimulation motor mapping\nPreparing MRI for navigated TMS\nObtain each participant’s structural MRI (T1). If an MRI is unobtainable, use a template MRI from Montreal Neurological Institute.\nImport the MRI file in DICOM or NIFTI format to the neuronavigation software (see Table of Materials).\nTMS target trajectories\nUse the neuronavigation software to reconstruct Skin and Full Brain Curvilinear using the tabs.\nSelect New, Skin, and Compute Skin. Ensure the nose and top of the head are included.\nSelect New, and Full Brain Curvilinear. Enclose the green selection box outside of the brain but inside of the skull. Select Compute Curvilinear. Adjust the peel depth to 4.0-6.0 mm.\nSelect Configure Landmarks. Place four landmarks at the tip of nose, nasion, and the notches of both ears of the reconstructed skin. Name the landmarks corresponding to their anatomy.\nSelect the Targets tab to view curvilinear brain. Select New, and Rectangular Grid. Place uniform 12 x 12 coordinate grids with 7 mm spacing on the surface of the reconstructed brain over the “handknob” of the motor cortex (precentral gyrus)17.\nUse the Target Positioning Tool on the right to optimize the grid positioning for rotation, tilt, and curvature. Convert the grid-points into trajectories that will guide the robot to position the TMS coil. Adjust the angle of the trajectories so they are 45° to the longitudinal fissure of the brain.\nUse the SNAP tool to extrapolate and optimize the trajectories to curvilinear brain.",
    "Initialize and position the TMS robot arm and seat to Welcome position and calibrate the force plate sensor using Force sensor test.\nPreparing the participant for motor mapping \nHave the participants fill out a safety questionnaire18.\nOnce the participants seated comfortably in the robot chair, adjust the backrest and neckrest. Ensure their feet are supported. Support their arms and hands with pillows to ensure their hands are in a resting position for the duration of the mapping session.\n\t\tNOTE: Children and adolescents will need reminders throughout the session to keep their hands relaxed.\nClean the skin over the muscle of interest. Place Ag/AgCl surface electrodes on both hands and forearms of the participant, targeting four distal forelimb muscles, 1) the belly of the first dorsal interosseous (FDI), 2) abductor pollicis brevis (APB), 3) abductor digiti minimi (ADM), and 4) the wrist extensor (extensor carpi ulnaris).\nConnect the surface electrodes with electromyography (EMG) amplifier and data acquisition system and connect the amplifier to a data collecting computer with a compatible EMG software.\nCo-register the four landmarks on the head of the participant using the landmark pointer. Use the validation tab to ensure the participant’s head is properly registered.\nDetermining motor mapping TMS intensity\nSelect a grid-point closest to the participant’s “handknob”. Select the Align to Target button to align the TMS coil held by the robot to this target location. Select Contact on. Monitor the contact quality using the contact force indicator. Ensure the indicator is green or yellow.\n\t\tNOTE: The red color on the contact indicator means there is too much force on the participant’s head. No color means the TMS coil is not in contact with the participant’s head. In these cases, adjust the force plate sensitivity.",
    "Instruct the participant not to move outside the scope of the robot arm. Ensure the participant’s hand muscles are relaxed and remain still prior to contact.\nSelect Align and Follow so the coil remains centered on the target if the participant moves.\nUse the TMS trigger button on the TMS machine to deliver 5-10 TMS pulses at an intensity between 40-60% maximum stimulator output (MSO). Repeat this step to 5-6 grid-points surrounding the “handknob”.\nDetermine the grid-point that gives the largest and most consistent (hotspot) motor evoked potential (MEP) for the left or right FDI muscle.\nDetermine the Resting Motor Threshold (RMT) as the lowest intensity that produces an MEP of at least 50 µV in the FDI muscle in 5/10 stimulations.\nMotor mapping \nStarting from the grid-point closest to the hotspot, deliver four single-pulse TMS pulses (1 Hz) at an interstimulus of 1 s and TMS intensity of 120% RMT. A responsive grid-point is determined by 2/4 MEPs >50 µV in any of the hand muscles.\nMove to the adjacent grid-point and repeat the above step.\nContinue sequentially in a linear fashion along responsive points until a non-responsive point is reached, which is the first border region of the map.\nContinue mapping to establish the border points in all four directions of the rectangular grid.\nRecord all MEPs from all muscles using the EMG software for offline analysis.\nAfter 3-4 grid points, select Contact off and give the participant a break until they feel ready to continue.\nThroughout the mapping session, continuously check in with the participant to ensure they are comfortable and/or need a break.\nUse a hard copy version of the same grids to tack the simulation order for further analysis.",
    "Complete mapping using a robotic TMS as described here or manually (not described in this manuscript). If using a TMS Robot, it will move to the grid-point selected by the experimenter. The robot will accommodate for child head motion in near real time. This will alleviate any additional movement associated with a technician manually holding the coil on the participant’s head.\n\t\tNOTE: If mapping using a TMS robot, ensure there is an experimenter beside the robot at all times during the session. If the robot is placed on a participant’s head and the participant suddenly moves, the robot will try to follow their head. If the participant must move, sneeze, scratch, or perform an activity involving the movement of their head, the robot arm must be moved to prevent the participant’s head from hitting the robot’s arm or TMS coil.\nMotor map creation \nUsing a custom-made coding script, generate three-dimensional motor maps (Figure 2). Contact the authors for the script.\nCalculate motor map area and volume using responsive trajectory sites. Calculate center of gravity (COG) as weighted average of the motor representations of each coordinate location.\n\t\tNOTE: Map area is calculated as the grid spacing (7 mm)2 multiplied by the total number of responsive sites. Map volume is calculated as the cumulative sum of grid spacing multiplied by the mean MEP amplitude at each responsive site. A user-friendly version of the script is being developed to share with the public as open source. Meanwhile, contact the corresponding author to get access to the script.\n3. Conventional tDCS and HD-tDCS application\nRandomize the participants to one of three intervention groups (sham, conventional tDCS, HD-tDCS).\nHave the participant complete the Purdue Pegboard Test (PPT) three times using their left hand (non-dominant), establishing their baseline score.",
    "Inspect electrode quality to confirm the integrity of the tDCS sponge inserts and rubber electrodes.\nTurn on the conventional tDCS device by flipping the power switch to ON.\n\tNOTE: Ensure the low battery light is not illuminated. If it is illuminated, change the batteries before starting the session.\n\t\nFor participants receiving conventional or sham tDCS, lightly soak two 25 cm2 sponge electrodes with saline. Ensure the entire electrode is covered but not dripping. Insert the rubber electrode into the saline soaked sponge electrodes and connect each electrode to the tDCS device.\nLocate the marked hotspot (Right M1) using the neuronavigation and mark it with a non-toxic marker. At the end of each tDCS, HD-tDCS or sham session, mark the hotspot again so that it is visible the next day.\n\t\nIf randomized to conventional tDCS or sham tDCS, place one 25 cm2 saline-soaked sponge electrode over the participant’s marked hotspot (Right M1), serving as the anode. Place the other 25 cm2 saline-soaked sponge electrode on the contralateral supraorbital region, representing the cathode. Use a light plastic pediatric “headband” to hold electrodes in place.\n\t\tNOTE: Ensure that there is no saline dripping from the electrode as it may shunt the current.\nIn the sham and conventional tDCS group, ensure “optimal” contact quality. If the contact quality is “sub-optimal”, inject a small amount of saline solution under the sponge electrodes, or ensure that there is minimal hair between the scalp and electrode.\n\t\tNOTE: “Optimal” contact quality is achieved when more than half of the quality of contact indicator lights are on. If less than half of the contact indicator lights are on, the contact quality is sub-optimal. Do not start stimulation if only one of two of the indicator lights are on.",
    "In the HD-tDCS group, refer to Villamar, M.F., et al.16 for the appropriate set-up.\nIn the HD-tDCS group, set the device to the Scan setting to check the impedance at each electrode. Ensure the impedance is under 1 “quality unit” and described previously19,20. If contact quality is poor, remove the electrode and check that there is no hair obstructing the contact of the electrode, and that a continuous column of electrode gel is present between the scalp and electrode. If needed, apply more electrode gel.\nSet the tDCS and HD-tDCS device to the anode montage setting, 1 mA current strength, and 20 min duration.\nEnsure the participant is sitting comfortably and they understand the possible sensations they may experience (such as itchy or tingling sensations). Remind the participant to communicate if they feel any discomfort or if they have any questions.\n\t\nIn the conventional tDCS and HD-tDCS groups, make sure the toggle is set to Active.\n\t\tNOTE: For the sham group, the toggle should be set to Sham. This setting should be hidden from the participant.\nPress the device’s Start button to start stimulation. Ensure the duration is set to 20 min, and the intensity to 1 mA.\n\t\tNOTE: In the conventional tDCS and HD-tDCS groups, the current will ramp up over 30 s to 1 mA and continue for 20 min. In the sham tDCS group, current will be ramped up over 30 s to 1 mA and immediately ramped down over 30 s.\nAt 5 min, 10 min, 15 min, and 20 min, have the participant complete the PPT three times using their left hand.\nAfter 20 min, turn the device off after the intensity finishes ramping down to 0 mA.",
    "NOTE: For participants receiving either conventional tDCS or HD-tDCS, the machine will automatically ramp down to 0 mA at 20 min. For participants receiving sham tDCS, the machine will automatically ramp up over 30 s to 1 mA and immediately ramp down to 0 mA over 30 s at 20 min.\nRemove the electrodes from the participant’s head.\nFor sham and conventional tDCS group, remove black electrodes from inside the sponges and rinse the sponge electrode with normal tap water.\n\t\nIn the HD-tDCS group, take off the plastic electrode holder top and remove the electrodes. Remove the electrode cap from participants’ head. Rinse any gel in the electrode holder. Clean the electrode with a slightly damp paper towel. Wipe the electrode with a dry paper towel to remove any remaining gel.\nHave all participants complete the Transcranial Direct-Current Stimulation Side-effects and Tolerability questionnaire after each stimulation session.\nHave the participants complete the PPT three times using their left hand.\n\t\nHave the participants return the following day and for another four consecutive days (five days total) for non-invasive brain stimulation (sham, tDCS, or HD-tDCS) paired with motor learning (PPT). Repeat steps 3.2-3.13 on Day 2-4. On Day 5, have the participants begin with non-invasive brain stimulation (sham, tDCS or HD-tDCS) (steps 3.2-3.13 are repeated). After a break (45 min-~1.5 h since receiving stimulation), start robotic TMS motor mapping (steps 2.3-2.5.8).\n\t\tNOTE: All participants received the same number of minutes for breaks between assessments.\nAfter 6-weeks, invite the participants to return and perform the PPT without receiving any non-invasive brain stimulation (step 3.2 followed by robotic TMS motor mapping (step 2.5.8)).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}