{
  "id": 6982,
  "origin_website": "Bio",
  "title": "Assembly and Imaging Set up of PIE-Scope",
  "procedures": [
    "PIE-scope assemblyThis section is of interest for laboratories that intend to assemble a copy of the current PIE-scope design. The design we propose is to be fitted on the front GIS (gas injection system) flanges of the vacuum chamber of the microscope. The flange used is GIS2, for which the vacuum feedthrough and the mirror support have been designed. Accordingly, if there is a GIS on any of the front ports it should be moved on GIS ports 4 or 5 if possible. If those ports are already in use and one GIS must stay at the front we suggest to use GIS port 3 and leave port 1 free. The presented design requires custom-built components, and all drawings can be downloaded from https://www.demarco-lab.com/resources[href=https://www.demarco-lab.com/resources]. In case the proposed design does not fit a specific microscope configuration (e.g., there are collisions with detectors or manipulators) it is possible to change the position or orientation of the PIE-scope inside the chamber by modifying the design of the custom components.   Further, not all components must be replicated using custom parts: the illumination and excitation arms of the PIE scope can be assembled using 30 mm Thorlabs cages, Thorlabs CERNA components or similar. The early prototypes of the PIE-scope have been realized using Thorlabs cage assemblies, but to increase the alignment stability, and to improve the compactness of the system we decided to opt for a monolithic aluminium body.The assembly consists of 2 major components:•The focus drive assembly•The atmospheric setupThe focus drive assembly consists of a monolithic brace that is fixed on 2 M6 bolts located on the vacuum chamber wall between the front GIS ports and the FIB column. The brace holds a long mirror (Edmund Optics) using spring-loaded pins.",
    "The piezo linear positioner used for focusing (Smaract) is bolted directly on the front of the brace. The objective is mounted on the positioner using a custom adapter, the drawings provided will work with any Olympus objective, and the positioner will be able to operate with any objective weighting less than 150 g.    The electrical feedthrough for the focus drive (LEMO) can be placed on any available flange, we used GIS port 3.   The atmospheric setup starts at the vacuum flange. The vacuum feedthrough of the light path is achieved through a quartz window. For this purpose, we use a high vacuum compatible window flange (Thorlabs). The flange is mounted on an adapter that converts the GIS flange into a CF-40. The adapter also allows mounting the microscope body to the vacuum chamber.The microscope body consists of 2 main components:•A sturdy bracket to steer the beam path such that the sum of the reflection angles from the back focal plane of the objective to the light source and detectors is a multiple of 90 deg.•The main body, which consists of an excitation arm and an emission arm. This component also hosts the dichroic mirror, the fibre adapter, the tube lens and the detector.The mirror located on the bracket is mounted on an adjustable mirror mount to steer across 2 angles and therefore compensate for the mechanical tolerances (which the assembly of this component are close to 1 mm). A dichroic mirror (Chroma) and a 90/10 Beam splitter (Thorlabs) are mounted, through a custom adapter, on a motorized linear positioner (Smaract). Switching between the beamsplitter and the dichroic provides the choice between reflected light and fluorescence imaging.    The tube lens is directly mounted on the main body and its position cannot be adjusted.",
    "At the extremities of the two arms of the microscope body, there are the detector and the optical fibre. The decision to design the emission arm with a 90 deg kink was made to make the overall assembly more compact and accordingly less prone to vibrations. In principle, this arm can be made straight, especially if the components used for the body are based on Thorlabs Cerna or similar, but one must be aware that the arm will be protruding beyond the current footprint of the instrument at the front, and might result on the way when loading samples through the main door of the DualBeam.   The laser source is a Toptica iCLE-50, which ensures 50mW of laser power across four channels (405, 488, 561, 640 nm). In our experience, a lower power will be suitable, and we calculated that 10mW is sufficient for this microscope. The detector currently is a Basler acA1920-155 um USB 3.0. This is a cost-effective solution that has also the advantage to be extremely light and compact if higher sensitivity is required we sustain suggest to use a Hamamatsu flash 4 V2 or V3 camera. The current design of the PIE-scope body has been done taking into account the weight and size of this camera.   All positioners are from Smaract, accordingly, it is possible to control them from a single motor drive. There are multiple options, some come with USB interface and some with Ethernet, depending on the choice of the drive one will have to choose the PIE-scope GUI. The USB drive is only compatible with the Labview interface, while the Ethernet version allows its use with both. Accordingly, we suggest purchasing the ethernet version.",
    "The PIE-scope is controlled through a computer connected to the same local network of the microscope PC of the FIB/SEM. The support PC that is always sold with the FIB/SEM is already suitable for the task, but from experience, it is easier to have a dedicated computer so that extra ethernet and USB 3.0 ports can be added. We currently use an HPz4 workstation with an extra Ethernet card to ensure enough ports are available. The PC has 1 connection to the general network to transfer the data and 1 connected to the local microscope network to communicate with the microscope PC. A third connection is required to connect the Smaract MCS motor drive. Lasers and camera are connected via USB 3.0. The Basler camera is a heated CMOS camera which requires 2A of current from the USB port, it must be noted that not all ports fulfil the specification and we suggest purchasing a dedicated USB 3.0 expansion card. Further, to enable live processing and image segmentation, we suggest at least 32 Gb of memory and a dedicated GPU.   To control the PIE-scope, we provide 2 options: one completely python-based, where all functions are integrated; and one which is Labview based where live camera view is not integrated due to restrictions of the Basler SDK. Both versions of the software contain all required controls to enable imaging with the FIB, the SEM and the light microscope. All images are stored in a single directory and the naming is unequivocally unique (using timestamps) and always contain the imaging modality. This makes it easy to reconstruct the sequence of events during future image analyses.",
    "Image correlation is currently only 2D, but it is possible (in the python UI) to define the position of milling patterns directly from the correlated image, therefore it is possible to use the fluorescence signal to directly define the location of the lamellae.An example of the workflow is shown in Figure 3 and Video 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200923/20200923103036_9892.pngFigure 3. Suggested sample workflow when using the PIE-scope<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. S1 PIEscope CorrVideo Using the PIE-scopeThe first step, after the LM has been mounted and aligned, is to measure the exact position of the optical axis relative to the coincidence point of the FIB/SEM. This step requires a fiducial that can be recognized in all modalities. The calibration consists in estimating the shift between the coincident point and the expected position and adjusted by centring the fiducial. Write down the absolute coordinates the shift values are then inserted in the control software to automatically perform direct movements between imaging modalities.   In the software, we assumed 2 positions (see Figure 1 and Video 1), which can be customized: (i) LM imaging, where the sample orientation is normal to the optical axis of the LM; (ii) FIB imaging, where the sample orientation is normal to the optical axis of the FIB. Once the imaging positions have been defined it is possible to perform pre-computed relative movements (shifts, tilt, and compucentric rotations) to image the same ROI under different modalities. The control software interface allows direct control of the FIB/SEM, a visual comparison between the FIB/SEM and LM images and saving the data in organized sub-directories.    In PIE-scope we implemented a basic correlation procedure (Figures 4-5), which leads the user to identify the location of the region of interest in the FIB or SEM image.",
    "Although using the proposed procedure is optional and specific use-cases might benefit from custom-designed image processing, we find that the availability of a general method already present and embedded in the software greatly enhances the usability. The PIE-scope correlation is performed through custom made python scripts that allow selecting multiple points on the LM and FIB/SEM images to calculate the appropriate transformation. 2D correlation is performed simply by applying an affine transformation that includes anisotropic scaling to match the pixel spacing resulting from imaging a sample from different tilts. This procedure is best suited for 2D correlation and, according to previous reports (Kukulski et al., 2011; Schorb and Briggs, 2014), it can lead to correlation precisions which are better than 100 nm.   Once completed, the correlated image can be used to directly select the locations of the milling patterns for the FIB (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200923/20200923103110_7498.pngFigure 4. Overview of the GUI. In blu the control panel which includes the focusing options, the correlation commands and the setup for multi-channel and volume imaging using the fluorescence microscope. The red box identifies the light microscopy panel, while the green box shows the FIB/SEM imaging panelimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200923/20200923103130_7013.pngFigure 5. The correlation panel allows for manually selecting matching features in light and focused ion beam microscopy. This part of the suite is available offline to allow the preparation of correlated images.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200923/20200923103148_7324.pngFigure 6. The milling parameter selection. Once the correlated image is generated it is possible to define milling boxes or patterns directly from the overlay. This increases the efficiency in the selection of the locations to mill."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biophysics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}