{
  "id": 13618,
  "origin_website": "Jove",
  "title": "Building Finite Element Models to Investigate Zebrafish Jaw Biomechanics",
  "procedures": [
    "All steps within the protocol follow the University of Bristol's animal care and welfare guidelines and those of the U.K. Home Office.\n1. Visualization of Musculoskeletal Anatomy\nNOTE: To visualize the shape of the skeletal elements, to quantify muscle and to identify the exact placement of the muscle attachments, immunostain (section 1.1) fish at the appropriate age for skeletal myosin (which reveals muscle) and type II collagen (to visualize cartilage). Alternatively, visualize the musculoskeletal anatomy using transgenic fluorescent reporter lines such as the collagen a1 reporter col2a1:mCherry 13,14 to visualize cartilage and the slow myosin heavy chain reporter smyhc:GFP 15 to visualize the position of muscle attachments (Section 1.2).\nAlternative lines that mark cartilage and muscle could work equally well.\nFluorescent Immunostaining\nFix larva in excess 4% paraformaldehyde (PFA) in phosphate-buffered saline (PBS) for 1 hr. Wash in PBS with 0.1% Tween 20 (PBT) and dehydrate in 50% methanol (MeOH) in PBT and 100% MeOH for 5 min respectively.\n\t\tCaution: PFA is toxic and should be handled in accordance with the material safety sheet.\n\t\tNOTE: Larva can be stored in 100% MeOH until required.\nRehydrate larva in 50% MeOH in PBT for 5 min. Wash in PBT for 5 min.\nPermeabilize larva in 0.25% trypsin in PBT on ice for 5-6 min. Wash in 4x PBT for 5 min each.\nBlock for 2-3 hr in 5% serum in PBT.\nIncubate larva in the recommended dilution of rabbit anti-type 2 collagen and mouse anti-myosin antibodies in 5% serum in PBT for 1 hr at room temp or overnight at 4 °C.\n\t\tNOTE: The recommended dilution range is normally on the antibody data sheet. Choose antibodies that are raised against different species to one another and that are also different to the tissue.\nWash larva 6x for 15 mins in PBT.",
    "Block for 1-2 hr in 5% serum in PBT.\nIncubate in secondary antibodies in the dark. Use fluorescently labelled anti-mouse (550) and anti-rabbit (488) secondary antibodies at an appropriate dilution in 5% serum and PBT for the specific antibody.\nWash 6X for 10 minutes each in PBT and image on a 10X confocal microscope as soon as possible.\nImaging Musculoskeletal Geometry\nMount the larvae ventrally on a coverslip in tepid 0.3-0.5% low melting point (LMP) agarose in Danieau's solution 16.\n\t\tNOTE: Transgenic fish will need to be sedated in 0.02% MS222 (Tricaine methanesulfonate, pH 7) before mounting and during imaging.\nTake a confocal image stack of the region of interest using the 10X objective lens and the approximately 2.5X digital zoom. Prepare images of the green and red channel using the 488 nm and 561 nm lasers respectively. Image at a 512 x 512 pixel resolution with an interval between z planes of 1.3 µm and 3 line averages. The resulting stack will comprise of approximately 100 z slices.\nExport the data as a tiff series. Maximum projections of the muscle and cartilage elements from a 5dpf zebrafish larva are shown in Figure 1.\n2. Generating a 3D Surface\nChoose a representative dataset for each time point at 3, 4 and 5 dpf (choose after visualization of multiple samples).\nOpen 3-dimensional tiff stack and select all channels in analysis software. Right click on the cartilage channel and select image filter and smoothing:Gaussian (Figure 2B).\nIn project view right click on filtered image and select 'image segmentation' and then 'edit new label'. Create a new label for each material, i.e., cartilage and joint. Select the cartilage region of the image (Figure 2C, white signal, purple outline) using the magic wand tool. Use the brush tool to remove noise from the outlines.",
    "NOTE: If using magic wand tool, click 'All slices'.\nSelect the joint region with the brush tool and assign to a joint component (Figure 2C, blue outline)\nSmooth multiple slices at once by selecting segmentation in the top menu and smooth labels. Right click on the image and select generate surface to produce a 3D surface render of the component (Figure 2D).\nClick on the surface and save data as a hmascii file for import into meshing software.\n3. Calculating the Muscle Forces to Be Used in the FE Model\nCount the number of muscle fibers from confocal images of smyhc:GFP transgenic zebrafish (Figure 1A, arrowhead, 1C) and measure the diameter of the fibers to calculate their cross sectional area (πr2).\nIdentify suitable force per muscle unit area from the literature. The maximal muscle force generated per unit area for larval zebrafish skeletal muscles (40 nN/µm2) were used 17.\nCalculate the forces for each anatomical muscle group by multiplying the number of fibers and their area by the force per unit area. See Table 1.\n4. Generating a Mesh\nImport the 3D model generated in section 2 (above) into a software package capable of generating a finite element mesh.\nGenerate a2D mesh of the cartilage and joint surfaces by using the shrink wrap tool under the 2D menu. Choose an appropriate element size.\n\tNote: Use an element size between 1.5-2.5. If necessary, generate a range of differently sized 2D surface meshes to carry out 3D mesh optimization (Section 4.4).\nCarry out mesh quality checks found under the '2D>Tools>Check elements' panel to check for duplicated elements, insertions and penetrations in the mesh. Fix dihedral angles by using the utility tab in model tree.\nGenerate a 3D mesh from the 2D surface meshes of differing element size using the 3D>Tetramesh subpanel.",
    "NOTE: Compare the results of different mesh sizes and select the FE model with the lowest mesh size that converges after further simulations and does not compromise feature definition. The example in Figure 3 contains 1.5 million tetrahedral elements for the lower jaw cartilages and had a 2D element size of 2.0.\nTransform the mesh so jaw model is to scale as per confocal stack using the Geometry>Distance subpanel.\n\tNOTE: Ensure the cartilage and joint components are connected in the model by exporting a merged model or by using ties.\n5. Finite Element Model Construction\nUsing commercial finite element (FE) software, create a FE model. Using the 3D muscle and cartilage labeled confocal stacks generated in section 1 as a guide, assign nodes that correspond to muscle attachment points. Create a vector between two nodes representing the origin and insertion of each muscle (Figure 3).\nCreate a load collector of type 'history' to apply a 'C load' for each muscle. Specify the magnitude in Newtons (calculated in step 3.3) and assign the associated vector. Figure 3 shows the attachment points for the adductor mandibulae (AM), protractor hyoideus (PH) and intermandibularis (IM).\n\tNOTE: For these jaw muscles, maximum contractile force is distributed between the origin and insertion so that only 50% of each load is applied at each site.\nAssign appropriate elastic isotropic material properties as determined by the literature. Young's modulus for cartilage and the interzone in this model were 1.1 MPa and 0.25 MPa respectively and Poisson's ratio was 0.25 for both 18,19.",
    "Create a load collector of type 'boundary' to apply initial constraints on the model. Go to the tab Analysis>Constraints and in the create subpanel, pick the nodes on the model you wish to constrain. Select the degrees of freedom (DOF) that limit movement of the model to the best approximation of its natural range of motion.\n\tNOTE: The model in Figure 3 was constrained in all axes of motion (DOF: 1, 2, 3 represent x, y and z, respectively) at the ceratohyal to anchor it in space at a mid-point in the model and in the y and z axis at the point where the palatoquadrate connects to the rest of the zebrafish skull (Figure 3, Table 1). The model must be constrained in all three DOF in a least one node.\nCreate a 'Load step', for each type of movement you wish to simulate (i.e., opening, closing), under the analysis menu and select all the relevant loads (made in Section 5.2) and constraints (made in Section 5.4) to simulate this movement. Select 'Static' from the drop down menu when it appears.\nExport model including the mesh, loads, constraints and material properties in an appropriate file format, in this case \".inp\" format.\nLoad model into FE analysis software. Create and execute a job for the model using the Job module.\nAnalyze output for stress, strain, displacement, etc. found in the results tab and visualization menu (Figure 4 and 5).\n6. Validation of Jaw Deformation/Displacement Distances\nSelect 3-6 Tg(Col2a1aBAC:mcherry) transgenic zebrafish.\nLightly anaesthetize the larvae with 0.02% MS222 until they cease to respond to touch but their hearts are still beating.\nMount the larvae laterally (while anaesthetized) on coverslips in tepid 1% LMP agarose (made up in Danieau's solution).\nRemove the agarose from around the head and jaw with forceps.",
    "Flush fresh Danieau's solution (with no MS222) over the head of the larva to remove anesthesia using a Pasteur pipette until normal mouth movements resume.\nUse movie capture software to take bright-field high-speed videos of mouth movements. Take movies of around a minute duration at the highest frame rate, or sufficient to record multiple cycles of jaw opening.\nChoose frames that show the jaw open to its maximum displacement. Measure the distance between the anterior tip of the Meckel's cartilage and the upper jaw (tip of ethmoid plate) in µm.\nCalculate the average displacement from multiple fish larvae.\nExtract displacement data from the model. Use the average displacement calculated in 6.8 to verify model displacement behavior (Figure 4). If the model deviates from expected, run sensitivity analysis by sequentially altering material properties and muscle loads."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}