{
  "id": 12410,
  "origin_website": "Jove",
  "title": "Using Wavelet Entropy to Demonstrate how Mindfulness Practice Increases Coordination between Irregular Cerebral and Cardiac Activities",
  "procedures": [
    "This research study was approved by The University of Hong Kong Institutional Review Board. All participants provided their written informed consent prior to participating in this study.\n1. Experimental Design\nimgsrc://cloudfront.jove.com/files/ftp_upload/55455/table01.jpg\nTable 1. MBSR Course Overview. The 8-week MBSR training course taken by the participants.\nRecruit participants.\n\tNOTE: Eleven healthy adults (five females) from a local MBSR course participated in this EEG study and were 28 - 52-year-old. Participant with depression based on the Beck Depression Inventory were excluded from the study. The course followed standard MBSR training (Table 1), and participants had to commit to the training structure.\nEEG recording system.\n\t\nConduct EEG recording in a quiet room using a 128-channel EEG system consisting of an EEG cap, amplifier, headbox, and desktop computer.\n2. EEG and ECG Data Acquisition\nNOTE: EEG data collection followed a standard procedure similar to the method described previously14. Ask each participant to wash his/her hair and scalp clean before coming to the experimental site. Inform the participant about the experimental procedures, mainly that he/she will rest normally for 10 min and do mindful breathing for another 10 min while being recorded with EEG and ECG devices.\nClean the face area and mastoid of the participant with alcohol swabs.\nUsing a measuring tape, measure the participant's head circumference and then choose an appropriately sized cap. Take one measurement from the nasion to the inion and another measurement across the top of the ears and over the scalp. Mark the vertex (the point at mid-distance between the nasion and inion and mid-distance between the two ears) with a soft marker pen.",
    "Set the electrode positions according to the 10-5 electrode systems15. Position the cap in such a way that the Cz electrode is above the vertex, the Nz electrode is at the nasion, the Lz electrode is at the inion, the RM electrode is at the right mastoid, and the LM electrode is at the left mastoid.\n\t\nPlace the ECG electrodes at both the left and right infraclavicular fossae.\nFill the electrode holders with gel using a blunt-point syringe.\nKeep the impedance under 20 kΩ for each electrode. Reduce the impedance by adjusting the electrode placement to increase contact with the scalp; add more gel if necessary.\nTighten the chinstrap and ask the participant to remain still.\nSet the sampling rate of the EEG device to 1,000 Hz. Use the left mastoid as the original reference point.\nRecord EEG data (step 1.2.1) at the beginning of the MBSR course (within 2 weeks).\n\t\nHave the participant perform a brief body scan to relax the whole body. Have the participant pay attention to his/her breath while breathing in and breathing out. Have each participant perform 10 min of MBSR mindful breathing (MBSR mindfulness condition) and 10 min of normal rest (control condition) during EEG data collection. This generates a pre-MBSR training dataset with two conditions.\n\t\tNOTE: Counterbalance the sequence of mindful breathing and normal rest among the participants.\nRecord EEG data again about 1 month after the participants complete the MBSR course.\n\t\nAsk each participant to perform 10 min of mindful breathing and 10 min of normal rest during EEG data collection. This generates a post-MBSR training dataset with two conditions.\n3. EEG and ECG Data Analysis",
    "NOTE: The first four steps are for data preprocessing, and the remaining steps are for wavelet entropy computation and correlation analysis. Here, an open-source software named EEGLAB16 was used for EEG analysis, but the operations should be similar across different software. In the following, the operations that are based on EEGLAB will be provided as an example. Refer to the EEGLAB manual for details (https://sccn.ucsd.edu/wiki/EEGLAB_Wiki#EEGLAB_Tutorial).\nUse the EEG software to resample the data at 250 Hz by selecting Tools > Change sampling rate. Use the Finite Impulse Response (FIR) filter for band-pass filtering with a 0.5 - 100 Hz passband by selecting Tools > Filter the data > Basic FIR filter.\n\t\nTo reduce noise due to the mains alternating current that is country-specific, use the short, nonlinear, Infinite Impulse Response (IIR) filter for notch filtering with a 47 - 53 Hz stopband by selecting Tools > Filter the data > Short non-linear IIR filter. This covers all relevant frequencies in the spectrum analysis while removing unnecessary noise.\nUse the EEG software to visually scroll through and inspect the EEG signal by selecting Plot > Channel data (scroll).\n\t\nIdentify and delete EEG segments that contain obvious muscle noise and any other strange events. Left-click and drag the mouse over bad segments to highlight them and then \"delete\" or \"reject\" the segments using the EEG software.\n\t\tNOTE: Muscle activities such as swallowing or facial expression often generate discontinuous and irregular signals. Strange events are usually caused by head or body movements, which often lead to significant shifts (at low frequencies) of the EEG signal.\nDetermine if there is any bad channel. Reconstruct each bad channel using the spherical interpolation method by selecting Tools > Interpolate channel.",
    "Use the EEG software to perform Independent Component Analysis17 (ICA) on the data by selecting Tools > Run ICA. Have an experienced EEG operator visually identify and discard components of eye movement and blinking, muscle movements, and components of other possible noise by selecting Tools > Reject data using ICA > Reject components by map; Tools > Remove components. The EEG software will reconstruct the data automatically using the retained components.\nUse the EEG software to rereference the data to the average of all channels before further analysis by selecting Tools > Re-reference.\nSpectrum analysis.\n\t\nUse the EEG software command line function \"spectopo\" to compute the spectra of EEG using Welch's power spectral density estimation18 and obtain the log powers (dB) of delta (1 - 4 Hz), theta (4 - 8 Hz), alpha (8 - 12 Hz), beta (12 - 30 Hz), and gamma (30 - 80 Hz) waves.\nCalculate the relative power of each type of wave18 (i.e. the proportion of power in the respective frequency band relative to the total spectrum power).\nPerform EEG source analysis using the Statistical Parametric Mapping (SPM) approach.\n\t\nUse minimum norm estimation19 to transform the EEG signals of the scalp electrodes into 3D brain source signals.\n\t\tNOTE: Here, the original channel number was 122, and it was transformed to 8,196 channels distributed in the three-dimensional brain model. The significance level was set at p = 0.01. Please refer to the source analysis in the SPM manual (www.fil.ion.ucl.ac.uk/spm/doc/spm8_manual.pdf).\nCalculate the wavelet entropy for each EEG channel (as well as for the estimated three-dimensional brain source signal) using the following procedure:\n\t\nGiven a signal imgsrc://cloudfront.jove.com/files/ftp_upload/55455/55455eq1.jpg, calculate the wavelet coefficients as imgsrc://cloudfront.jove.com/files/ftp_upload/55455/image002.jpg, where imgsrc://cloudfront.jove.com/files/ftp_upload/55455/image003.jpg is an orthonormal basis of the Haar wavelet family and imgsrc://cloudfront.jove.com/files/ftp_upload/55455/image004.jpg represents the decomposition levels (N = 10 in this study).",
    "Define the relative energy as imgsrc://cloudfront.jove.com/files/ftp_upload/55455/image005.jpg, with imgsrc://cloudfront.jove.com/files/ftp_upload/55455/image006.jpg.\nCalculate the wavelet entropy as imgsrc://cloudfront.jove.com/files/ftp_upload/55455/image007.jpg. Average the wavelet entropy for all channels to obtain the EEG wavelet entropy for each participant.\nUse the software package to perform a peak analysis on the ECG data to obtain the heartbeat signal, which consists of the number of ECG wave peaks and the interval between the peaks.\n\tNOTE: Assuming a normal heartrate of 60-100 beats/min in both the normal rest and mindful breathing states, the number of heartbeat instances N for a 10 min duration should be relatively small, satisfying 600 < N < 1,000.\n\t\nTo obtain reliable wavelet entropy from the heartbeat signal, use a sliding window of 500 points and a step increment of 10 points to compute a series of wavelet entropies using the same procedure as for EEG, elaborated in section 3.7. Use the mean value as the final wavelet entropy.\nAnalyze the brain and heart correlation across subjects between the wavelet entropy of ECG and that of EEG at every channel of the scalp using any statistical software that has a Pearson correlation function.\n\t\nUse the EEG software command line function \"topoplot\" to construct a statistical scalp map for the correlation. Plot a linear correlation graph with the heart rate entropy and the average EEG entropy of only those channels that are significantly correlated with heartrate entropy (see the Representative Results section)."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}