{
  "id": 3440,
  "origin_website": "Cell",
  "title": "Assessing the effects of antiretroviral therapy-latency-reversing agent combination therapy on eradicating replication-competent HIV provirus in a Jurkat cell culture model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEstablishment of latent cells (HIV-infected non-producing cells)\nTiming: 4 weeks (for all steps in this section)\nTiming: 3 days (for steps 1 to 2)\nTiming: 1 h (for step 3)\nTiming: 30 days (for steps 4 to 5)\nTiming: 2 h (for step 6)\nFor this protocol, we will describe the establishment of HIV-1 latently infected cells that harbor widely infected clones similar to that observed in vivo.\nPreparation of cells.\nObtain a human T cell-derived cell line, Jurkat cells to establish cell populations chronically infected with HIV-1.\nMaintain in RPMI 1640 medium (Sigma-Aldrich) supplemented with 10% fetal calf serum (Sigma-Aldrich), 50 U/mL penicillin and 50 μg/mL streptomycin, in 25 cm2 flask.\nCulture in a 5% CO2 humidified incubator at 37°C.\nWhen cells become 70%–80% confluent (maximum cell numbers 2 × 106 cells/mL), split to 1/10 and passage.\nVirus preparation and determination of virus titer.\nObtain a human embryonic kidney cell line, HEK293T cells and maintain in DMEM medium (Sigma-Aldrich) supplemented with 10% fetal calf serum, 50 U/mL penicillin and 50 μg/mL streptomycin, in 10 cm dish.\nTransfect the proviral plasmid HIV-1NL4-3 or HIV-1JR-FL to HEK293T cells to produce virus.\nCollect the culture supernatant and determine the p24 concentration using a p24 antigen ELISA kit (ZeptoMetrix Corp., Buffalo, NY) and store at 80°C until use.\nHIV-1 infection.\nInfect 1 × 106 Jurkat cells with the HIV-1 wild type (HIV-1NL4-3 or HIV-1JRFL) at 50 ng of p24/mL in a 10 mL culture condition in a 25 cm2 flask. The cell density should not exceed 5 × 106 cells/mL.\nCulture without wash until cells are confluent.\nMaintain HIV-1 infected cells.",
    "Culture the infected cells in 10 mL of RPMI 1640 medium supplemented with 10% fetal calf serum, 50 U/mL penicillin and 50 μg/mL streptomycin, in 25 cm2 flask.\nPassage weekly in 1/10 splits at confluence (so that cell numbers are less than 5 × 106 cells/mL).\nWeekly monitoring of p24 level in the supernatant.\nMeasure HIV-1 p24 levels in the cell culture supernatant using commercially available p24 ELISA kit or Lumipulse system (FUJIREBIO).\nNote: When using the Lumipulse system, the infected supernatant should be diluted 10- to 100-fold with lysis buffer and require inactivation treatment prior to measurement.\nMonitor the number of intracellular p24+ cells on day 30 after HIV-1 infection by flow cytometry.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3017-Fig1.jpg\nFigure 1. Culture protocol of intracellular p24-positive cells and selection of antiviral agents for WIPE assay\n(A) HIV-infected cells with different proportions of intracellular p24-positive cells at the initial culture period. Note the different proportion of intracellular p24-positive cells (from 2.5% to 15%) representing a mixture of HIV-infected and uninfected Jurkat cells (see Graphical Abstract for the meaning of the numbers in different quadrants of the graphs).\n(B) Changes in supernatant p24 levels in the absence (line) and presence of 50 nM EFdA (dotted line). EFdA treatment was terminated on week 13, but analysis continued for additional 4 weeks. EFdA affected the rate of virus reduction during the long-term culture and rebound rate after drug discontinuation.\n(C) Comparison of the effects of different NRTIs and their combinations with an LRA, 5nM PEP005, on supernatant p24 levels. Drug treatment was terminated on week 9, but analysis continued for additional 23 weeks.\nNote: Use our latest flow cytometric method of intracellular staining described by our group11[href=https://www.wicell.org#bib11], which is a modification of our previously published method.",
    "Critical: The proportion of intracellular p24-positive cells in the cell cultures should be around 2.5%–5% of the total number of cells. THIS STEP CAN CRITICALLY AFFECT THE RESULTS. Indeed, cultures of Jurkat cells containing intracellular p24+ cells of 2.5% or 15% (mixtures of HIV-infected and -uninfected Jurkat cells), showed differences in the rate of virus elimination after long-term culture as well differences in rebound after treatment cessation (Figures 1[href=https://www.wicell.org#fig1]A and 1B). We recommend determination of the percentage of reactivation-competent HIV-latently-infected cells by HIV flow cytometry. This allowed us to determine the percentage of latent cells that can be reactivated by TNF-alpha (see12[href=https://www.wicell.org#bib12] for details).\nDetermination of antiviral activity of LRAs and conventional anti-HIV-1 agents in HIV-infected Jurkat cells (WIPE assay)\nTiming: 4 months (for all steps in this section)\nTiming: 2 h (for steps 7a to 7b)\nTiming: 9 weeks (for steps 7c to 7g)\nTiming: 8 weeks (for step 8)\nTiming: 2 days (for step 9)\nNext, we evaluated the efficacy of the combinations of ART and LRAs against HIV-1-latently infected Jurkat cells using an in vitro culture system. The aim of this assay is to identify the most efficacious ART-LRA combination therapy. We reported recently that the combination of nucleoside reverse transcriptase inhibitors (NRTIs), islatravir (EFdA, MK-8591), plus a PKC activator, PEP005, potently eradicated HIV-1 latently infected cells in vitro.\nPrepare HIV-infected Jurkat cell cultures:\nSeed 5.0 × 104 cells/mL of HIV-infected Jurkat onto 12-well plate (2 mL each well).\nAdd a single ART (e.g., NRTI, integrase inhibitor, or protease inhibitor), a single LRA (e.g., PKC activator, HDAC inhibitor, BET inhibitor) or a combination of the two types of agents.\nPassage weekly to maintain cell numbers <5 × 106 cells/mL when confluent.\nUse different doses of the test drugs.\nMonitor the supernatant p24 level once every week.",
    "Measure HIV-1 p24 levels in the cell culture supernatant as described in Step5a.\nMonitor intracellular HIV DNA copies.\nMeasure proviral DNA copies by quantitative PCR (qPCR) analysis.\nMonitor reactivation-competent HIV-latently infected cells.\nCollect the cells, wash twice with PBS, and seed into 24-well plates at 5.0 × 105 cells/mL.\nTreat the cells with 10 ng/mL TNF-alpha for 24 h.\nDetect intracellular p24-double positive cells (see HIV Flow methods: Pardons et al.12[href=https://www.wicell.org#bib12]). Subtract the percentage of unstimulated p24-positive cells from p24-positive cells after TNF-alpha stimulation to calculate the percentage of reactivation-competent HIV latently infected cells.\nNote: Use our latest qPCR method described by our previously published method.1[href=https://www.wicell.org#bib1] For more detail, please see the Note below.\nNote: Quantitative PCR (qPCR) analysis (step 7f)\nqPCR for intracellular HIV-1 DNA levels should be conduct using Premix Ex Taq (Probe qPCR) Rox plus (Takara Bio). The oligonucleotides HIV-1 LTR and β2-microgloblin (β2m) are used for HIV-1 DNA quantitation and cell number determination, respectively (see key resources table[href=https://www.wicell.org#key-resources-table]). We recommend calculating the HIV proviral DNA copy and cell numbers based on a standard curve generated using a serially diluted HIV-1 pNL4-3 plasmid and DNA extracted from Jurkat cells, respectively.\nCessation of treatment:\nApproximately 9 weeks of treatment with a single agent or combination of agents should reduce the viral load in the supernatant. Then, stop the drug treatment.\nMaintain cultivation for another 8 weeks without drug treatment.\nMonitor the p24 level in the supernatant and measure intracellular HIV DNA level weekly during cell culture.\nStimulation:\nAt the end of the treatment-cessation period (8 weeks), stimulate the previously drug-treated cells with 10 ng/mL TNF alpha and determine viral recurrence as described Step7 g.\nConfirm the rise in HIV-1 mRNA expression by qPCR or intracellular p24 staining.",
    "Critical: It is desirable to keep the viral load in the supernatant below the detection limit upon cessation of drug treatment. Since it is preferable for the viral load in the culture supernatant to fall below the detection limit during the drug treatment period before the treatment cessation step, the treatment period can be further extended from 9 weeks if the viral load does not fall below the detection limit. Generally, the viral load is reduced to near the detection limit with ART alone, but it may rebound during the treatment period due to drug resistance mutations or other problems. On the other hand, when ART is combined with a drug that activates directly on latently infected cells, such as LRA, the amount of virus in the culture supernatant often declines below the detection limit within the 9-week treatment period.\nNear-full-length single HIV-1 genome PCR\nTiming: 2–3 days (for all steps in this section)\nTiming: 1–2 h (for step 10)\nTiming: 4–5 h (for step 11)\nTiming: 1 day (for steps 12 to 14)\nWe next performed near-full length HIV-1 genome PCR to determine whether the combination of ART and LRAs eradicated intact or replication-competent HIV provirus. The PCR protocol used in this step was described previously7[href=https://www.wicell.org#bib7] with some modifications (see key resources table[href=https://www.wicell.org#key-resources-table] and Table 1[href=https://www.wicell.org#tbl1] for primers and PCR conditions, respectively).\ntable:files/protocols_protocol_3017_4.csv\nDNA extraction.\nExtract DNA from the cells using QIAamp DNA Blood Mini Kit (QIAGEN) following the instructions provided by the manufacturer.\nResuspend the DNA in 100 μL nuclease-free water.\nExecute digital droplet PCR (ddPCR).\nPrepare ddPCR reaction mix with the following composition provided in Table 1[href=https://www.wicell.org#tbl1].\nGenerate droplets using the QX200 droplet generator (Bio-Rad) following manufacturer’s instructions (QX200™ Droplet generator Instruction manual, catalog#186–4002).",
    "Once droplet generation is completed, transfer the droplets into a 96-well PCR plate and seal with a preheated PX1 PCR plate sealer (Bio-Rad).\nIncubate in a thermal cycler under the conditions summarized in Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_3017_5.csv\nAfter PCR reaction, place the plate in the QX200 droplet reader (Bio-Rad) and quantify both the positive and negative droplets based on fluorescence.\nDetermine the threshold value based on the highest value of droplet fluorescence in the no template control to provide an objective cut-off value (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3017-Fig2.jpg\nFigure 2. Representative results of ddPCR and LM-PCR\n(A) Representative ddPCR result for gag gene. Columns (i) – (iii) are tested samples while column (P) is a positive control (in this case, DNA from Jurkat cells spiked with ACH-2 cells). The threshold line (purple) is determined based on the highest droplet fluorescence in the NTC (no template control) column.\n(B) Representative gel image of post-sonication DNA. Note the smear from 100 – 1000 bp.\n(C) Representative gel image of LM-PCR library after the 2nd nested PCR. Note the smear from 100 – 500 bp.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3017-Fig3.jpg\nFigure 3. Effects of different drugs on viral persistence by the WIPE assay\n(A) Changes in supernatant p24 levels cultured in the absence of drugs, in the presence of 5 nM PEP005 or 50nM EFdA, or with the combination of 50 nM EFdA plus 5 nM PEP005 (n = 11, 9, 11, and 11, respectively). Drug treatment was terminated on week 9, but analysis continued for additional 8 weeks.",
    "(B) Changes in cell population during the early phase of treatment. The percentage of HIV-1-double positive (DP) cells was determined. Cell samples from the WIPE assays (weeks 0, 2 and 4) and those after 24-h TNF-α stimulation was examined after p24-double staining by flow cytometry. Panels form this figure are reused with permission from all authors from our previously published paper.1[href=https://www.wicell.org#bib1]\nCalculate the copy number of target genes (alb and gag) using QuantaSoft v1.7.4 (Bio-Rad).\nCalculate the proviral load as follows: Proviral load (per cell) = (gag copy number) / [(alb copy number) / 2]\nSingle genome PCR (first-round PCR).\nAmplify the single genome with 1 copy/tube of DNAs using Takara Ex Taq hot start version (TaKaRa Bio, Shiga, Japan). Calculate the input DNA amount (ng) using the following formula.:\nR\ne\nq\nu\ni\nr\ne\nd\na\nm\no\nu\nn\nt\no\nf\nD\nN\nA\n(\nn\ng\n)\n=\nI\nn\np\nu\nt\nD\nN\nA\na\nm\no\nu\nn\nt\n(\nn\ng\n)\ni\nn\nd\nd\nP\nC\nR\ng\na\ng\nc\no\np\ny\nn\nu\nm\nb\ne\nr\ni\nn\ng\ne\nn\ne\nr\na\nt\ne\nd\nd\nr\no\np\nl\ne\nt\ns\n    Detail PCR mixture is given in Table 3[href=https://www.wicell.org#tbl3].\ntable:files/protocols_protocol_3017_6.csv\nRefer to the table below for PCR conditions (Table 4[href=https://www.wicell.org#tbl4]).\ntable:files/protocols_protocol_3017_7.csv\nSingle genome PCR (second-round PCR).\nDilute the first-round PCR products 1:50 in PCR-grade water and use 5 μL of the diluted mixture for second-round amplification. Detail 2nd PCR mixture information is given in Table 5[href=https://www.wicell.org#tbl5].\ntable:files/protocols_protocol_3017_8.csv\nRefer to the table below for PCR conditions (Table 6[href=https://www.wicell.org#tbl6]).\ntable:files/protocols_protocol_3017_9.csv\nElectrophoresis to confirm single genome.\nPrepare 1% agarose gel and perform electrophoresis.",
    "Based on Poisson distribution, samples with ≤30% positive reactions are considered to contain a single HIV-1 genome and are selected for sequencing.\nNGS analysis of near-full length HIV-1 genome\nTiming: 2–3 days (for all steps in this section)\nTiming: 2–3 h (for step 15)\nTiming: 1–2 days (for step 16)\nWe next performed next-generation sequencing (NGS) analysis of the near-full length HIV-1 genome.\nDNA purification and fragmentation for NGS.\nPurify the amplified PCR products of the selected samples using the QIAquick PCR Purification Kit (Qiagen) and follow the protocol recommended by the manufacturer.\nDetermine the concentration of PCR purified products using Qubit Fluorometer.\nTake 2 μg PCR purified DNA and add TE buffer to make up the volume up to 100 μL.\nNote: To achieve an average fragment size of 300–400 bp, begin with 2 μg of PCR purified DNA and supplement it with TE buffer to reach a final volume of 100 μL.\nNote: Employ a Picoruptor device from Diagenode (Liege, Belgium) for sonication, utilizing the following program at a temperature of 4°C: 30 s of sonication followed by 90 s of rest, repeated for a total of 6 cycles.\nPreparation of libraries for NGS.\nPrepare the libraries using the NEBNext Ultra II DNA Library Prep Kit for Illumina (New England Biolabs) according to the instructions supplied by manufacturer.\nLigation-mediated PCR\nTiming: 2–3 days (for all steps in this section)\nTiming: 1–2 h (for step 17a)\nTiming: 1–2 days (for steps 17b to 21)\nTiming: 1–2 days (for step 22)\nThe next step included ligation-mediated PCR to determine the sites of integration of HIV-1 provirus DNA using the protocol described previously8[href=https://www.wicell.org#bib8] with minor modifications (see key resources table[href=https://www.wicell.org#key-resources-table] and Table 9[href=https://www.wicell.org#tbl9]; Table 11[href=https://www.wicell.org#tbl11] for PCR primers and conditions, respectively).\nDNA fragmentation.",
    "Prepare up to 2 μg DNA in Tris-EDTA buffer (total volume up to 100 μL).\nShear the DNA by sonication using a Picoruptor device (Diagenode, Liege, Belgium) to obtain fragments with an average size of 300–400 bp utilizing the following program at a temperature of 4°C: 30 s of sonication followed by 90 s of rest, repeated for a total of 6 cycles.\nLoad with run 5 μL of sonication product on 2% agarose gel to confirm obtaining the appropriate fragment sizes (Figure 2[href=https://www.wicell.org#fig2]B).\nEnd-repair and adapter ligation:\nUse 50 μL of the sonication product for end-repair using the NEB Next Ultra II End Repair/dA-tailing Module and follow the protocol provided by the manufacturer.\nOnce reaction is completed, proceed immediately to adapter ligation using the NEB Next Ultra II Ligation module, as described in the protocol provided by the manufacturer.\nRefer to the Table below for incubation conditions (Table 7[href=https://www.wicell.org#tbl7]).\ntable:files/protocols_protocol_3017_10.csv\nPurify the post-adapter ligated DNA using the QIAquick PCR Purification Kit (Qiagen) according to the instructions supplied by the manufacturer and elute the DNA in 50 μL ddH2O.\nSize selection.\nPerform size selection using 0.8× volume (40 μL) of AMPure XP Beads based on the instructions provided by the manufacturer.\nFor the final step, elute with 65 μL ddH2O and transfer the supernatant to a new, clean tube.\nFirst external PCR.\nAmplify the post-size selection product using the Q5 Hot Start High Fidelity DNA Polymerase and the primer pairs B3 and B4. Refer to the table below for PCR mixture recipe (Table 8[href=https://www.wicell.org#tbl8]).\ntable:files/protocols_protocol_3017_11.csv\nRefer to the table below for thermocycling conditions (Table 9[href=https://www.wicell.org#tbl9]).\ntable:files/protocols_protocol_3017_12.csv\nPurify the amplified PCR products using the QIAquick PCR Purification Kit (Qiagen), following the instructions recommended by the manufacturer and elute in 35 μL ddH2O.\nSecond nested PCR.",
    "Perform second round amplification using the Q5 Hot Start High Fidelity DNA Polymerase and the primer pairs P5B5 and P7. Refer to the table below for PCR mixture recipe (Table 10[href=https://www.wicell.org#tbl10]).\ntable:files/protocols_protocol_3017_13.csv\nRefer to the table below for thermocycling conditions (Table 11[href=https://www.wicell.org#tbl11]).\ntable:files/protocols_protocol_3017_14.csv\nPurify the amplified PCR products using the QIAquick PCR Purification Kit (Qiagen) according to the instructions provided by the manufacturer and elute in 35 μL ddH2O.\nRun 2 μL purified PCR product on a 2% agarose gel (Figure 2[href=https://www.wicell.org#fig2]C).\nLM-PCR library sequencing:\nPrepare the LM-PCR library according to Denature and Dilute Library Guide for MiSeq system by Illumina-MiSeq (Document # 15039740v10) and load the samples in the designated sample lading well of “Paired-End Reagent Plate”.\nBefore initiating the sequencing process, add the primers into the specified wells of the “Paired-End Reagent Plate” based on the information provided in Table 12[href=https://www.wicell.org#tbl12]. Mix the primers slowly 3 to 5 times using long tips.\ntable:files/protocols_protocol_3017_15.csv\nPerform the sequencing run in paired-end mode with a minimum read length of 50 cycles for each read."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}