{
  "id": 12899,
  "origin_website": "Jove",
  "title": "Implantation and Recording of Wireless Electroretinogram and Visual Evoked Potential in Conscious Rats",
  "procedures": [
    "Ethics statement: Animal experiments were conducted in accordance with the Australian Code for the Care and Use of Animals for Scientific Purposes (2013). Animal ethics approval was obtained from the Animal Ethics Committee, University of Melbourne. The materials herein are for laboratory experiments only, and not intended for medical or veterinary use.\n1. Preparing Electrodes\nNote: A three channel transmitter is used for surgical implantation which enables 2 ERG and 1 VEP recording to be conducted simultaneously. The three active and three inactive electrodes need to be pre-fashioned into a ring shape before implantation in order to attach to the eye. For identification purposes, the manufacturer has enclosed active electrodes in half white, half colored plastic sheaths while inactive electrodes are covered in full colored sheaths. The ground electrode (clear plastic sheath) is left unaltered. For all active and inactive electrodes conduct steps 1.1, 1.2, 1.3 and 1.7.\nUntwist the double stranded stainless steel electrode with two fine tipped pliers.\nTrim one of the stainless steel strands (approximately 1 cm from the tip), leaving a single longer straight strand remaining to shape the ring electrode.\nFold the single stainless steel strand back onto itself and twist, forming a smooth ring at the tip of the electrode.\nFor the ERG active electrodes fashion this loop ~ 0.2 - 0.5 mm in diameter by twisting the base of the loop (for the purpose described here, shape two active electrodes in this way to record ERG from both eyes), and for the ERG inactive and VEP electrodes make the loop diameter ~ 0.8 mm diameter (in this example, do this for one active VEP electrode and all three inactive electrodes).",
    "Hook the circular VEP active electrode around a stainless steel screw (diameter 0.7 mm, length 3 mm) so the electrode rests against the screw head.\nHook the 3 inactive electrodes (2 ERG, 1 VEP) around a second stainless steel screw (diameter 0.7 mm, length 3 mm).\nPull the plastic sleeve forward over the sharp ends of the two stainless steel strand to reduce irritation.\nSterilize the telemetry transmitters by soaking in 2% glutaraldehyde for more than 10 hr at approximately 25 °C. Then rinse the transmitter with sterile saline 3 times.\n2. Transmitter Implantation\nAnimal Preparation\nDisinfect the surgical area prior to experimentation by cleaning with 70% ethanol. Autoclave all surgical equipment before use and maintain equipment in chlorhexidine when not in use during surgery. Cover the animal with a surgical drape during surgery to maintain a sterile environment. Ensure all experimenters wear surgical masks, sterile gloves and gowns.\nInduce anesthesia with 1.5 - 2% isoflurane, at a flow rate of 3 L/min and maintained at 1.5 - 2 % at 2 L/min throughout the surgery. Confirm sufficient depth of anesthesia by absence of a pedal reflex upon pinching the muscle between the toes.\nShave a 40 mm x 30 mm area over the abdomen from above the groin to the sternum.\nShave a 30 mm x 20 mm area over the forehead, posterior to the eyes and anterior to the ears.\nDisinfect the two shaved areas. For the forehead area disinfect with 10% povidone-iodine three times (avoid the use of alcohol-based antiseptics for area near the eye, being consistent with the Standard of Practice set out by the Association of Surgical Technologists). Over the abdomen disinfect with 10% povidone iodine and 70% ethanol.\nApply 1 drop of proxymetacaine to the cornea for additional topical anesthesia.",
    "Apply 1 drop of carboxymethylcellulose sodium to the cornea to prevent drying of the eyes.\nSurgical implantation\nMake a 10 mm incision on the head along the vertical midline between the ears with a surgical scalpel.\nMake a 5 mm incision on the abdomen through the skin layer along the midline below the sternum.\nTunnel a 5 mm diameter cannula subcutaneously from the abdomen incision to the head incision.\nFeed the electrode wires (3 active and 3 inactive) of the transmitter through the cannula from the abdomen to the head.\nLeave the reference electrode with the transmitter base and cover the electrode tip with aseptic gauze.\nCover the electrode tips (3 active and 3 inactive) with aseptic gauze.\nSecure the rat's head to a stereotaxic platform.\nExtend the forehead incision to 30mm in length with surgical scissors.\nExpose surgical area by retracting loose skin with 2 sutures (3 - 0) at ~ 3 and 9 o'clock.\nScrape off the periosteum overlying the skull using sterilized gauze to expose bregma, lambda and midline sutures.\nDrill two holes through the skull at the VEP active (7 mm ventral to bregma 3 mm lateral to midline) and inactive (5 mm rostral to bregma on the midline) stereotaxic co-ordinates.\nAttach VEP active and inactive electrodes with pre-attached stainless steel screws (diameter 0.7 mm, length 3 mm) to the skull with a small screw-driver to ~ 1 mm in depth into the premade holes. This anchors the screw to the bone without damaging the underlying cortical tissue.\nTo implant the ERG active electrodes use an 8 - 0 suture to temporarily retract the upper eyelid.\nInsert a 16 to 21 G cannula subcutaneously from behind the eye through to the superior conjunctival fornix.\nRemove the guiding needle.",
    "Feed the active electrode through the shortened plastic catheter from the forehead towards the eye. Then remove the plastic catheter.\nUse a temporary suture (8 - 0), which is threaded through the electrode loop, to prevent the electrode from retracting back into the tunnel.\nMake a 0.5 mm incision on the superior conjunctiva at 12 o'clock, 1 mm behind limbus. Use blunt dissection to expose the underlying sclera.\nImplant an 8 - 0 or 9 - 0 suture immediately behind the limbus at half scleral thickness.\nRemove temporary suture from ERG active electrode.\nAnchor the ERG active electrode to the half scleral thickness suture by tying 3 consecutive knots ensuring the tip of the electrode is situated close to the limbus.\nClose the conjunctival flap using 1 to 2 interrupted sutures (8 - 0 to 9 - 0). Ensure that the conjunctiva completely covers the ERG electrode to improve comfort.\nRemove the eyelid retracting suture.\nRepeat the procedure for the contralateral eye.\nApply cyanoacrylate gel over the skull to secure all stainless screws and electrode wires. Ensure the ERG active electrodes are not pulled too tight before securing to enable eye movements.\nClose the head wound using a non-absorbable 3 - 0 suture.\nRotate rodent to expose abdominal area. Lengthen the abdominal dermal incision to 40 mm along the linea alba with surgical scissors.\nMake a 35 mm incision through the inner muscle wall to expose the inner abdominal cavity.\nUsing two sutures (3 - 0) attach the transmitter body to the animal's right hand side inner abdominal wall. Avoid contacting the liver.\nLoop the ground electrode and secure in this shape with a suture (3 - 0). Place it free-floating in the abdominal cavity.\nClose the peritoneum using a continuous suture (3 - 0).",
    "Close the skin incision using interrupted sutures (3 - 0).\nPost-operative care\nMonitor the animal until it has regained sufficient consciousness to maintain sternal recumbency. House the animal singly following the surgery.\nAdminister carprofen subcutaneously for analgesia (5 mg/kg) once a day for 4 days.\nAdd prophylactic oral antibiotics (Enrofloxin, 5 mg/kg) to the drinking water for 7 days post-surgery.\nApply an anti-inflammatory ointment to skin incision sites to reduce irritation for the first 7 days post-surgery.\n3. Conduct ERG and VEP Recordings in Conscious Rats \nDark adapt animal for 12 hr prior to ERG and VEP recordings\nConduct all experimental manipulations under dim red illumination (17.4 cd.m-2, λmax = 600 nm)\nApply topical anesthesia (0.5% proxymetacaine) and dilating (0.5% tropicamide) drops to the cornea.\nGuide the conscious rodent into a custom made, clear restrainer.\n\tNote: The length of this plastic tube can be adjusted to accommodate different sized rats with the overall diameter fixed at 60 mm. The front end of the device is tapered to minimize head movement and contains perforations to enable normal breathing. This tapered front allows alignment and stabilization of the rat's head and eyes to the opening of the Ganzfeld sphere. Note that the rodent has been acclimatized to the restrainer (3 to 5 occasions) prior to surgery.\nPlace the rodent in front of the Ganzfeld bowl with the eyes aligned with the opening of the bowl.\nTurn on indwelling transmitter by passing a magnet within ~ 5 cm of the transmitter. Verify that the transmitter is on by checking the LED status light on the receiver base.",
    "Collect signals over a range of luminous energies (i.e., -5.6 to 1.52 log cd.s.m-2) as described previously21. Briefly, average more signals at the dimmer light levels (~ 80 repeats) and less at the brighter luminous energies (~ 1 repeat). Gradually lengthen the interstimulus interval from 1 to 180 seconds from dimmest to the brightest light level.\nTo isolate the ERG rod and cone responses utilize a twin-flash paradigm8. For example, initiate two flashes at 1.52 log cd.s.m-2 with a 500 msec inter-stimulus interval in-between.\nTo record VEP signals, average 20 repeats at the brighter luminous energies (i.e., 1.52 log cd.s.m-2, 5 sec inter-stimulus interval).\nTo evaluate implant stability, which is assessed by signal variability over time, conduct ERG and VEP recordings 7, 10, 14, 21 and 28 days post-surgery.\nFollowing experimental period, euthanize rats via intracardial injection of pentobarbiturate (1.5 ml/kg) after ketamine:xylazine anesthesia (12:1 mg/kg).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}