{
  "id": 6347,
  "origin_website": "Bio",
  "title": "Visualization and Quantification of Cell-to-cell Movement of Proteins in <em>Nicotiana benthamiana</em>",
  "procedures": [
    "Construct generationLinearize the pZK538 vector (Addgene #118012) using inversion PCR with Phusion polymerase and primer set FP7939 (GGC TAT CGT TCG TAA ATG GTG) and FP7940 (GGA TCC ATG GTG AGC AAG GGC GAG GAG CTG TTC ACC GGG GTG GT). Note: Add 3% DMSO to the standard Phusion PCR mix, use a total volume of 20 μl. Use the following PCR program:98 °C 30 s98 °C 10 s57 °C 30 s72 °C 15 minRepeat steps b-d 30 times72 °C 10 minNote: After 15 cycles add extra 0.1 μl of Phusion to the reaction. Digest linearized PCR product with DpnI restriction enzyme to remove original template.Clean up the digested PCR product with GeneJet PCR purification kit.Electrophorese 1 μl of linearized pZK538 vector on a 1% agarose gel for size and concentration estimation.Design primers to amplify your gene of interest [HiFi DNA assembly cloning protocol (NEB)]:Fw primer: CACCATTTACGAACGATAGCCATGCCTGTGGAAGATGCCGATTCRv primer: ACCACCCCGGTGAACAGCTCCTCGCCCTTGCTCACCATGGATCCATCCTCTGAGATAGTAAGATAGTAGNote: Replace the underlined section with gene of interest specific sequence. Remove the stop codon for your reverse primer, since GFP will be fused C-terminally. Amplify your MP and non-MP of interest using PCR with Phusion polymerase (standard Phusion PCR mix, with a total volume of 20 μl).Separate the PCR products on a 1% agarose gel and isolate the fragment using a GeneJet gel extraction kit. Estimate the DNA concentration by loading 1 μl on a 1% agarose gel.Clone your gene of interest into the linearized cell-to-cell movement vector pZK538, according to HiFi DNA assembly cloning protocol (NEB). Use the following reaction mix (vector:insert ratio 1:2):100 ng of linearized pZK538 vector (14 kb)7 ng of MP/non-MP insert (500 bp)10 μl NEBuilder HiFi DNA Assembly Master MixFill up to 20 μl with MilliQ water Note: Adjust the amount of insert DNA according to its size in base pairs (bp).",
    "Incubate the reaction mix at 50 °C in a heat block for 45 min.Transform 2 μl of reaction mix to E. coli (DH5α) (Green and Sambrook, 2012).Check your final construct by sequencing the insert (FP7939: CACCATTTACGAACGATAGCCATGCCTGTGGAAGATGCCGATTC).Note: Replace the underlined section with gene of interest specific sequence. If correct, proceed to transform 25 ng of your final construct to Agrobacterium (GV3101) using electroporation (1.25 kV, 25 μF, 400 Ω) (Mersereau et al., 1990).Nicotiana benthamiana plant growth and agroinfiltration Grow plants according to the protocol described by Ma et al., 2012. Note: Growing plants in a growth chamber instead of a greenhouse provides better quality protoplasts. In short: Germinate 10-15 seeds in a growth chamber (22.0 °C, 70% humidity, short day: 13 h dark; 11 h light) and transfer the seedlings seven days after sowing to separate 10 cm pots. Proceed with agroinfiltration when plants are five-week-old, this stage is optimal for agroinfiltration (Ma et al., 2012) and also gives sizable leaves for later protoplast isolation.Note: Counting from the top of the plant, use leaves number two, three and four for infiltration (see Figure 4 from Ma et al., 2012).  Use the protocol for agroinfiltration as described by Ma et al., 2012 (but use different OD600 bacterial titers, see below). Incubate the agrobacteria in MMAi medium (see Recipes) for at least two hours prior to agroinfiltration.Try a range of different bacterial titers (e.g., OD600 of 0.5, 0.1, 0.05 etc.) to determine the optimal concentration for a mosaic-like transformation pattern for your MP and non-MP of interest. As a control (non-MP) Avr2-GFP can be used. In our hands, a final OD600 of 0.05 is best used for Avr2-GFP (Figure 3). Six5 and GUS can be infiltrated at OD600 of 0.5.",
    "Note: If a low intensity of your GFP signal is encountered, the silencing suppressor p19 (see Addgene #68214 for similar construct) can be co-infiltrated (mix cultures before infiltration) using an OD600 of 0.5.  Infiltrate one leaf half (up to the main vein), with your MP-GFP and non-MP-GFP in the other half, mark the infiltrated sectors with an Edding 400 permanent marker (1 mm).Analyze leaf disks of the transformed areas 72 h after infiltration with a confocal microscope (see Procedure C).Note: Timing could differ based on the expression level of the protein of interest. In our set-up imaging 72 h after infiltration resulted in the highest fluorescence levels. Imaging cell-to-cell movement with confocal microscopyPunch leaf disks of the infiltrated areas with a 5 mm leaf puncher and place with bottom side up on microscope slide. Place a cover slide (24 x 60 mm) on top of your samples. Prevent dehydration of the sample by adding MilliQ water around the leaf disks. Set up the confocal microscope LSM 510: For GFP excitation use an Ar-ion laser to excite at 488 nm and record emission at 505-550 nm. For mCherry excitation use an Argon-2 laser to excite at 568 nm and record emission at 585-615 nm. For both GFP and mCherry use a laser strength of 14% and a pinhole of 1 airy unit.Select the pallete tab and use the range indicator to fine-tune the fluorescent image settings. Adjust the maximum and minimum intensity of both your GFP and mCherry signal, by changing the detector gain and amplifier offset. If proper GFP and mCherry fluorescent signals are observed, proceed to look for “gaps” (2 to 3 untransformed non-fluorescent cells) in the mCherry channel that are surrounded by 4 to 5 mCherry fluorescent cells.",
    "If cell-to-cell movement is occurring in non-fluorescent areas in the mCherry channel, it will display a GFP signal in the GFP channel (Figure 3. bottom panels). This mobile GFP signal can be relatively weak compared to surrounding transformed cells, but can be distinguished from aspecific background signals by its clean and specific localization to nuclei and cytosol (Figure 3. bottom panels).Note: Ideally, most cells will be transformed resulting in occasional gaps in a confluent fluorescent surrounding. Increasing the number of gaps in our hands led to a decreased signal intensity. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181213/20181213222219_9504.jpgFigure 3. Mosaic-like transformation pattern showing cell-to-cell movement of Avr2-GFP. Co-agroinfiltration of Agrobacterium strains carrying a pZK538 vector encompassing genes encoding mCherry-HDEL and Avr2-GFP with either an Agrobacterium strain carrying a SIX5 or GUS-containing binary into N. benthamiana leaves. Transformed cells show both a red ER-localized signal and a green Avr2-GFP signal localized to cytoplasm and nucleus (indicated by an asterisk). The ER-localized mCherry is unable to move to neighboring untransformed cells and serves as a transformation marker. In the absence of Six5 (non-mobile Avr2-GFP), no red or green fluorescence was observed in untransformed cells adjacent to transformed cells (top panels). In the presence of Six5 (mobile Avr2-GFP), untransformed cells that flank a transformed cell show green fluorescence in cytoplasm and occasionally in the nucleus, indicating cell-to-cell translocation of Avr2-GFP (indicated by arrows, bottom panels). The above figure is adapted from Cao et al. (2018). Scale bars = 35 μm.Protoplast isolationOur protoplast isolation protocol is based on the method described by Faraco et al. (2011), with minor modifications (Figure 4).Collect the infiltrated leaves and include an un-infiltrated mock control (second, third or fourth leaf of one of the plants used for infiltration). Note: Harvest one leaf at a time to prevent wilting of the other leaves during sample preparation.",
    "Note: Perform all following steps in a flow hood. TEX buffer can be easily contaminated, leading to dead protoplasts.Prepare five beakers, one with 250 ml 70% ethanol, one with 100 ml 1% hypochlorite solution (a 5-fold dilution of commercial bleach showed to be equivalent) and three with 250 ml sterile MilliQ water. Also prepare leaf digestion solution by adding 45 ml TEX buffer to 5 ml leaf digestion solution aliquot (10x) (previously prepared, see Recipes). Note: One leaf digestion solution aliquot is good for five samples, 10 ml per sample. Thaw the appropriate number of aliquots for your experiment during the aforementioned preparations. Sterilize leaves (one at a time) by dipping each of them in 70% ethanol for a few seconds and immersion in 1% hypochlorite solution for 30 s. Next, rinse the leaves three times by immersion in sterile H2O. Note: Hold the leaf with sterile forceps by the stem to avoid tearing of the leaf. Place the sterilized leaf in a sterile square Petri dish and use a sterilized scalpel to cut the infiltrated leaf area along the markings.Place the leaf half in a sterile round Petri dish containing 2 ml leaf digestion solution (1x). Use a sharp scalpel to slice the leaf into 2-5 mm strips. Note: Use sterile forceps to gently hold the leaf in place and replace your scalpel blade regularly.  Add 8 ml of leaf digestion solution to the leaf strips and make sure to submerge each strip well by gently pushing them under.Close the Petri dish and wrap in aluminum foil.Incubate the plates overnight (approximately 15 h) at room temperature without shaking.Next morning, unpack the plates in a flow hood. Note: Properly digested leaf strips will look almost transparent. Green protoplasts should be floating in the medium.",
    "Use sterilized forceps to remove all leaf strips and gently move them up and down in the solution to release remaining protoplasts. Create a V-shaped opening in the Petri dish by heating your scalpel blade in a gas burner for a few seconds and use it to make a small incision at the side of the Petri dish. While cutting slightly turn the blade to one side to create a V-shape. This opening can be used to pour your protoplast suspension.Place the autoclaved steel mesh 80 (177 μm) over a clean sterile Petri dish and wet the mesh with a little TEX buffer. Gently pour the protoplast solution, using the V-shaped opening, through the mesh. Add approximately 5 ml TEX buffer to the original Petri dish to collect remaining protoplasts and also pour them through the mesh into the new Petri dish. Create another V-shaped opening in this new Petri dish.Decant the protoplast solution, via the V-shaped opening, in 50 ml Greiner tubes and adjust the volume to 25 ml with TEX buffer. Note: Hold the 50 ml Greiner tube at a 45° angle to allow a gentle flow preventing shearing forces to the protoplasts. Spin for 10 min using a Rotina 420R Centrifuge at 100 x g at room temperature, with acceleration 2 and deceleration 0. Note: Be careful when retrieving samples, living protoplasts will form a ring at the top and are fragile! Use long sterilized Pasteur pipettes connected to a Pipetus pipetting pump to remove the buffer and as much debris as possible. Note: Slow down the speed of the pump when removing the debris and when the liquid reaches the bottom to avoid losing the floating protoplast cells. Resuspend the protoplast suspension in 25 ml TEX buffer.",
    "Note: Hold the 50 ml Greiner tube at a 45° angle, to avoid shearing.  Repeat the washing steps (D15-D16) once more.After the second spin, resuspend the protoplast suspension in approximately 3-4 ml TEX buffer.Determine the quality (intact; round cells) and concentration of the protoplasts by counting the cells with bright field microscopy, using a hemocytometer. A concentration of ca. 3 x 107 cells/ml is sufficient. Proceed with flow cytometry analysis of the protoplast samples. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181213/20181213222243_2809.jpgFigure 4. Protoplast isolation method. A flow scheme for protoplast isolation is shown. A N. benthamiana leaf is infiltrated with MP-GFP and Non-MP-GFP construct containing Agrobacterium strains 72 h prior to protoplast isolation (light blue). Infiltrated leaf sectors are cut into leaf strips, digested overnight in leaf digestion solution and filtered over a mesh (blue, top panels). Isolated protoplasts are centrifuged (100 x g) to pellet the debris. The protoplasts are then washed by removing the debris, along with most of the buffer and resuspended in fresh TEX buffer. Following centrifugation and removing the buffer, the protoplasts are concentrated in the few milliliters remaining (blue, bottom panels). Quality (intact; round cells) and fluorescence of the protoplasts is checked using brightfield- or fluorescence- microscopy. Subsequently, concentration of the protoplast suspension is estimated by counting cells using a hemocytometer (yellow).Flow cytometryMix 500 μl protoplast suspension and 500 μl TEX buffer and pipette them over a 50 μm filter into 5 ml Polypropylene round bottom tubes.Place the tube into a FACSAria III (BD Biosciences, US) loading chamber and have the sampled loaded by the machine.Record the red and green channel, using the following laser settings: excitation of GFP at 488 nm and emission capture at 530/30 nm. mCherry excitation at 561 nm and emission capture at 610/20 nm.",
    "Adjust the voltage of the red and green channel to spread the population on scale.Count 50,000 cells per sample, with a Neutral density filter 2.0 to keep forward scatter (FSC) protoplasts on scale."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}