{
  "id": 9212,
  "origin_website": "Jove",
  "title": "Non-invasive Parenchymal, Vascular and Metabolic High-frequency Ultrasound and Photoacoustic Rat Deep Brain Imaging",
  "procedures": [
    "Necessary experiments to develop the protocol were performed according to national regulations and were approved by the local ethical science committee (Comitato di Bioetica di Ateneo), operating within the institution of University of Turin, Turin, Italy.\n1. Preparation\nAnesthesia\n\t\nPlace the animal inside the appropriate isoflurane chamber to anesthetize it.\nFill the chamber with mixed O2 and isoflurane gas for veterinary use at a concentration of 2.5% in a 2 L gas chamber and wait for about 3 min for the rat to fall asleep. Check for the effect of anesthesia by a toe pinch.\nOnce the anesthesia takes effect, remove the rat and weigh it.\nSpread a thin layer of water soluble ophthalmic gel on the animal’s eyes to protect them and to maintain the ocular physiological hydration.\nLay the rat down on a ultrasound and photoacoustic imaging station worktop. In order to maintain the anesthesia effect, quickly position the nose inside the appropriate mask providing a constant anesthesia flow (isoflurane 2%-2.5% in oxygen 1 L/min).\nShaving the animal\n\t\nSpread a consistent layer of hair-removing cream on the head surface, with attention to cover areas surrounding ears and neck. Allow the cream to act for several minutes and gently take it out with a spatula. Softly remove all cream remnants with a wet sponge to accurately clean the skin.\n\t\tNOTE: The animal fur entraps air that negatively affects ultrasound based imaging acquisition, thus it has to be necessarily removed as much as possible.\nPositioning the animal\n\t\nArrange the animal in a spread-eagle position. Monitor the vital signs, by means of appropriate vital parameter sensors on the worktop (if they are present). Lean the paws on the sensors after applying some drops of electrode cream for professional use.",
    "NOTE: During anesthesia, ensure that vital parameters have values as follows: rat body temperature ≈ 37.5 °C, cardiac beats per minutes (BPM) varies between 250 and 350 and the respiratory rate is comprised in the range of 40-80 breaths per minute.\nFinally fasten the limbs with hypoallergenic artificial silk patch. If necessary, spread again a thin layer of water soluble ophthalmic gel to protect animal’s eyes.\n2. Image Acquisition from Temporal Point of View\nPositioning the animal\n\t\nKeeping the animal in a prone position, rotate its body slightly on the side, with a tilt angle of about 45° with respect to the sagittal body axis. Use small cotton gauze rolls as stands to correctly arrange the disposal (Figure 2a).\nRaise the animal head and rotate it slightly on one side (Figure 2a). Use a cotton roll as stand keeping the snout well inserted into the anesthesia mask.\nIncline the worktop at an angle of about 30° with respect to the horizontal plane.\nTurn the imaging transducer at an angle of about 30° with respect to the vertical plane.\nUltrasonic and photoacoustic anatomic and vascular image acquisition\n\t\nTurn the imaging scan on, enter the B Mode image acquisition and properly set all image acquisition parameters to respect possible given requirements of the experiment (Figure 3a).\n\t\tNOTE: Set the transmit center frequency as low as possible (16 MHz, Figure 3b), in order to have the maximum penetration depth possible for the transducer.\nDispose a consistent layer (about 1 cm thick) of hypoallergenic water soluble ultrasound transmission gel on the animal’s head (Figure 2b). Cover the transducer head with a thin layer of the same gel and put it into contact with the layer on the rat. Use warm gel to minimize localized hypothermia.",
    "Start image acquisition in B Mode and adjust the transducer positioning in real time, by identifying anatomical references and by centering the region of interest to the monitor middle point. Make sure to eliminate air bubbles at any level entrapped into the gel layer, because they negatively affect the acquisition.\nPlace the transducer to align it to the virtual axis connecting the ear to the eye (Figure 4a) to obtain an optimal beam focalization. Acquire different views of the internal brain volume, by clockwise or counterclockwise rotation (Figure 4b and c).\nEventually fasten the transducer on a mechanical stand to stably secure the position and to tune the orientation in a fine way.\nEnsure that the cerebral region of interest localizes at 10 mm of depth with respect to the US-LASER transducer source in order to receive an optimal photoacoustic response signal (Figure 5). Then place the indicator of US wave focalization exactly in the center of the analyzed area.\n\t\tNOTE: During research of areas of interest, avoid activation of the respiration gate option, in order to accelerate the positioning procedure.\nEnter Color Doppler Mode to visualize internal brain blood vessels in a high sensitive way.\nOnce the positioning has been set in an appropriate way to visualize the wanted regions, activate the respiration gate option to avoid undesired effects related to the movement (Figure 6a).\nChoose the wanted acquisition parameter set in Color Doppler Mode (Figure 6b) and acquire images in this modality to distinguish blood stream velocities and directions, until several millimeters of penetration depth.\nEnter Pulsed Wave Doppler Mode and acquire images to detect artery blood pulsation and to differentiate between arteries and veins.",
    "Enter Power Doppler Mode and set acquisition parameters (Figure 7) to perform a signal quantification on the basis of the number of scattering events caused by the flux movement, and therefore to evaluated differences in flow rates.\nEnter Photoacoustic Mode and properly refine acquisition parameters (Figure 8a) to collect data about blood total hemoglobin content or oxygenation degree in a given area. By producing laser excitation on an entire wavelength spectrum (from 680 nm to 970 nm, Figure 8b), the absorption of total hemoglobin present in different chemical states inside a tissue can be quantified. By performing signal collection on single specific wavelengths (Figure 8c), it is possible to isolate the distinct signal contributions due to the absorption of oxy and de-oxy pure species.\n3. Imaging from the Occipital Point of View\nPositioning the animal\n\t\nKeeping the animal in a prone position, lower the animal head and use small cotton gauze rolls as lateral stands to correctly arrange the disposal.\nTurn the imaging transducer parallel to the transverse plane of the animal head (Figure 9).\n\t\tNOTE: In this way, the acquisition will be centered through the occipital foramen at the basis of the skull. By varying the tilting angle of the probe orientation (Figure 9), it will be possible to acquire internal vessel images in different views depending on the setting inclination.\nUltrasonic and photoacoustic anatomic and vascular image acquisition\n\t\nEnter the B Mode image acquisition, set all image acquisition parameters as previously reported (Figure 3) and spread the necessary ultrasound gel layers on the probe and on the animal nape.\nArrange the transducer to stay almost horizontal, in order to be directed along the anatomical posterior-to-anterior axis of the body. Point it toward the frontal side of the snout and tilt it slightly forward.",
    "Start image acquisition in B Mode and Color Doppler Mode (Figures 3 and 6). Accurately adjust the transducer position and remove air bubbles from the gel coat as previously described. If possible, fasten the transducer on a firm stand to control the orientation in a fine way and choose the best tilting angle to acquire images of the desired anatomical regions.\nVisualize internal brain blood vessels in Power Doppler Mode, by properly setting acquisition parameters (Figure 7).\nLocalize intensely pulsated arteries by Pulsed Wave Doppler Mode. Distinguish them from veins, which conversely are characterized by low levels of blood flow pulsation.\nCollect blood stream velocities data and directions in Color Doppler Mode, by adequately adapting acquisition parameters (Figure 6).\nComplete deep brain hemodynamic characterization data set, by adding chemical blood information obtained through the photoacoustic acquisition (Figure 8). Perform this by assessing in particular the amount of hematic parameters such as the O2 saturation percentage and the total Hemoglobin content (HbT), that are generally measured by setting the laser excitation wavelength at 750 and 850 nm (Figure 8c).\n4. End of Acquisition and Animal Removal\nNOTE: Properly consider the whole time dedicated to the image acquisition process (from step 1 to step 3), which is subjected to main restrictions related to anesthetic dose applied to the animal.\nSave all acquired data, turn the laser pulsing off by exiting the Photoacoustic acquisition mode and distance the transducer.\nWhile maintaining the animal under the anesthesia effect, start to clean it by gently removing the protective gel from the eyes with a wet cotton swab. Use a spatula and several paper towels to completely remove the ultrasound gel from the head and the snout, then clean them with a wet sponge. Be careful not to damage the delicate shaved skin.",
    "Take out the adhesive patch used to fasten the limbs and disconnect them from the sensors that monitor the physiologic parameters. Rapidly transfer the animal from the acquisition worktop to a different cage.\nHost the animal in a small cage for recovery from anesthesia. Ensure that the animals should not share the cage during this phase in order to prevent aggressions\nPlace the recovery cage under an infrared light to keep the animal warm. Wait until it has regained sufficient consciousness to maintain sternal recumbency. Check the animals’ general health conditions, before moving it to the animal breeding room."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}