{
  "id": 2166,
  "origin_website": "Cell",
  "title": "A MACS protocol for purification of untouched germinal center B cells from unimmunized or germinal center-induced mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: This protocol is optimized for isolating GC B cells from 2.5 × 107 splenocytes (approximate ½ splenocytes of a naive mouse or ¼ splenocytes of an immunized mouse). The timing is calculated based on the simultaneous processing of two samples. To enhance cell survival, all buffers and reagents should be kept on ice, and all centrifugations and beads incubations should be carried out at 4°C.\nHarvesting splenocytes and removing red blood cells\nTiming: 15–20 min\nThis step includes spleen removal from euthanized mice, splenocyte isolation and RBC lysis.\nHarvest mouse spleens as reported (Cato et al., 2011[href=https://www.wicell.org#bib1]; Ramezani-Rad and Rickert, 2021[href=https://www.wicell.org#bib5]).\nScissor the spleen into 4–5 small segments in a 60 mm culture dish containing 1 mL of PBS.\nNote: Using FBS supplemented cell culture media may enhance cell survival.\nUsing minimal pressure, gently disassociate splenic tissues between the frosted ends of two glass slides to release splenocytes.\nCritical: Gentle release of splenocytes from fragmented splenic tissues is essential for reducing cell injury and assuring the high purity and yield of isolated GC B cells.\nMake single-cell suspension by gently pipetting up and down >10 times with a 1 mL pipette.\nFilter the cells through a 70 μm cell straining and transfer approximate 2.5 × 107 splenocytes (Equivalent to ¼ of splenocytes harvested from an immunized mouse or ½ of splenocytes harvested from a naive mouse) to an Eppendorf tube.",
    "Note: Using < 2 × 107 splenocytes may reduce the yield and purity of isolated GC B cell. However, if using ≥ 4 × 107 splenocytes, we recommend splitting the cells into halves and isolating in two 1.5 mL tubes to avoid the decrease of the yield and purity. Alternatively, the protocol may be scaled up to isolate GC B cells from up to 3 × 108 splenocytes by using 15 mL conical tubes with proportionally increased amounts of antibodies and beads. We also suggest that a new user of this protocol should not handle more than 2 samples simultaneously.\nPellet cells by centrifugation at 300 × g for 3 min and remove supernatant.\nResuspend the pellet in 300 μL 1× RBC Lysis Buffer (eBioscience) and incubate on ice for 60–90 s to remove erythrocytes.\nCritical: Incubation with RBC lysis buffer for over 3 min may increase cell death of lymphocytes.\nStop the lysis reaction by washing the splenocytes twice in 1 mL PBS with centrifugation at 300 × g for 3 min. At the same time, wash CD43 Dynabeads (5 min).\nTransfer 100 μL beads per sample into an Eppendorf tube.\nAdd 1 mL of PBS and resuspend.\nPlace the tube on the magnet for 1 min as shown in Figure 3[href=https://www.wicell.org#fig3]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1644-Fig3.jpg\nFigure 3. Placement of the Eppendorf tube on the magnet and the rotator for cell sorting\n(A) When place the Eppendorf on the magnet, ensure that the tube is closely contacted with the magnet wall. The tube can be kept open for convenience. Keep the tube on the magnet when collecting beads free supernatant.",
    "(B) When place the Eppendorf tube on the rotator for beads incubation, the tube should be positioned with an approximate 30-degree angle to the axis of the rotator to allow smooth and constant movement of the beads in the tube.\nDiscard the supernatant.\nRepeat wash steps b–d.\nResuspend in 200 μL CD43 Beads Buffer.\nResuspend the pellet in 600 μL of CD43 Beads Buffer.\nCritical: Without addition of DNase or MgCl2 in the beads buffer, B cells may clump/have nonspecific binding to beads due to genomic DNA present from cell injury, resulting in the loss of cells.\nB cell purification by negative selection of CD43+ cells\nTiming: 30–35 min\nThis step details the enrichment of the B cell population by removal of CD43+ cells.\nAdd 160 μL of pre-washed CD43 beads to the cell suspension and gently mix.\nPlace the tube on the rotator as shown in Figure 3[href=https://www.wicell.org#fig3]B, rotate and tilt the tube at 4°C for 20 min.\nRemove the tube and resuspend the bead-bound cells by pipetting 10 times to limit trapping of unbound B cells.\nPlace the tube on the magnet for 2 min as shown in Figure 3[href=https://www.wicell.org#fig3]A.\nTransfer the supernatant containing the unbound B cells to a new tube.\nPellet cells by centrifugation at 300 × g for 3 min and resuspend in 50 μL CD43 Beads Buffer containing 3% FBS.\n1st round GC B cell purification by negative selection of IgD+ cells and CD43+ cells\nTiming: 75–80 min\nThis step details the first round of enrichment of the GC B cell population by removal of IgD+ cells and additional removal step of CD43+ cells.\nAdd 2 μL biotinylated anti-IgD antibody, mix and incubate on ice for 20 min. At the same time, prepare Biotin Binder beads (5 min).",
    "Transfer 150 μL beads into an Eppendorf tube.\nAdd 1 mL of PBS and resuspend.\nPlace tube on magnet for 1 min.\nRemove supernatant.\nRepeat wash steps b–d.\nResuspend the beads in 150 μL CD43 Beads Buffer.\nWash cells twice in 600 μL PBS by centrifugation at 300 × g for 3 min and resuspend cells in 600 μL CD43 Beads Buffer.\nAdd 150 μL pre-washed Biotin Binder beads and 40 μL pre-washed CD43 beads, gently mix.\nPlace the tube on the rotator as shown in Figure 3[href=https://www.wicell.org#fig3]B, rotate and tilt the tube at 4°C for 20 min.\nRemove the tube and resuspend the bead-bound cells by pipetting 10 times to limit trapping of unbound GC B cells.\nPlace the tube on magnet for 2 min as shown in Figure 3[href=https://www.wicell.org#fig3]A.\nTransfer the supernatant containing unbound GC B cells to a new tube.\nNote: Wash steps after this point in the protocol are performed at 350 × g for 5 min to minimize cell loss, as the pellet size is now significantly reduced as shown in Figure 4[href=https://www.wicell.org#fig4].\nPellet cells at 350 × g for 5 min and resuspend in 50 μL CD43 Beads Buffer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1644-Fig4.jpg\nFigure 4. Changes of cell pellet during GC B cell purification\nRepresentative cell pellets at each step of the isolation of GC B cells from 1/4 spleen of SRBC-challenged mice. Cell pellets are indicated by white arrows. Please note that when purifying GC B cells from 1/2 spleen of a naive mouse, cell pellets may become invisible at the stages of GC B cell isolation.\n2nd round GC B cell purification by negative selection of IgD+, CD11c+, CD38+ cells\nTiming: 90–100 min\nThis step details the second round of GC B cell purification by negative selection of IgD+, CD11c+, CD38+, and Annexin V+ cells.",
    "Add 1 μL each of biotinylated IgD, CD11c, and CD38 antibodies, mix and incubate on ice for 15–20 min.\nOptional: 0.8 μL of Ter119 and Gr1 antibodies may be added at this step to remove additional non-B cells and enhance purity further.\nNote: Skipping the following steps 25 and 26 of Annexin V incubation and proceed to step 27 may dramatically increase yield of isolated GC B cells without decreasing the cell purity but may increase Annexin V+ GC B cells (Figure 2[href=https://www.wicell.org#fig2]). This approach can be used if a higher yield is desired, and when the cells undergoing apoptosis do not significantly affect the downstream experiments.\nWash with 600 μL PBS by centrifugation at 350 × g for 5 min and resuspend in 50 μL Annexin V Beads Buffer.\nCritical: All following steps should be conducted in Annexin V Beads Buffer or Annexin V Buffer to ensure optimal binding of biotinylated Annexin V with cells undergoing apoptosis.\nAdd 1 μL biotinylated Annexin V, mix and incubate on ice for 15 min.\nCritical: Incubation with biotinylated Annexin V for an extended period (beyond 15 min) may result in a lower yield of GC B cells.\nNote: If skipping the Annexin V incubation, use CD43 Beads Buffer and PBS to replace Annexin V Beads Buffer and Annexin V Buffer respectively in the following steps.\nAt the same time, prepare Biotin Binder beads (5 min):\nTransfer 100 μL beads into an Eppendorf tube.\nAdd 1 mL of PBS and resuspend.\nPlace the tube on magnet for 1 min.\nRemove supernatant.\nRepeat wash steps b–d.\nResuspend in 100 μL Annexin V Beads Buffer (Use CD43 Beads Buffer instead if skipping Annexin V incubation).",
    "Wash cells twice with 600 μL 1× Annexin V Buffer (Use PBS instead if skipping Annexin V incubation) by centrifugation at 350 × g for 5 min and resuspend in 600 μL Annexin V Beads Buffer (Use CD43 Beads Buffer instead if skipping Annexin V incubation).\nAdd 100 μL pre-washed Biotin Binder beads, gently mix.\nPlace the tube on the rotator, rotate and tilt the tube at 4°C for 20 min.\nRemove the tube and resuspend the bead-bound cells by pipetting 10 times to limit trapping of unbound GC B cells.\nPlace the tube on magnet for 2 min and transfer unbound GC B cells to a new tube.\nNote: Purified GC B cells are now ready for downstream applications including flow cytometry."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cell Biology",
    "Cell Isolation",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}