{
  "id": 17797,
  "origin_website": "Jove",
  "title": "Coronary Progenitor Cells and Soluble Biomarkers in Cardiovascular Prognosis after Coronary Angioplasty",
  "procedures": [
    "This protocol meets the institutional guidelines from the human research Ethics Committee.\n1. Coronary Angiography, Ultrasound, and Blood Sampling\nRequest baseline clinical and demographic information before coronary intervention. Collect the individual's data: age, sex, current smoking status, body mass index (BMI), high blood pressure, dyslipidemia, diabetes mellitus, medications, and the indication for current coronary angiography.\nPerform coronary angiography through heart catheterization using a radial approach. This procedure should be performed under a fluoroscopy guide in the hemodynamics room by expert cardiologists.\n\tNOTE: Identify evaluable vessels. For the present study, evaluable vessels were defined as arteries with sections larger than 1.5 mm and lumen stenosis of more than 50%.\nAdvance the intravascular ultrasound catheter to the region of interest and record images. Use the appropriate software to locate and measure the smallest luminal area.\nUse a coronary catheter to collect 10 mL of blood from the closest location to the plaque.\nAfter patient discharge, schedule periodical medical evaluations to follow up study endpoints. If telephone contact is not possible or a physician visit is delayed for longer than 2 months, request an authorized person (previously designed) to verify the study endpoints.\n\tNOTE: Consider any of the following a MACE: 1) cardiovascular death, 2) new myocardial infarction, 3) unstable angina prompting an unscheduled medical visit within 24 h, 4) stent restenosis as demonstrated by coronary angiography, 5) episodes of decompensated heart failure requiring clinical attention.\n2. Determination of Circulating MPCs (Figure 2)\nProcess the blood within 1 h from collection. Transfer 6 mL of the collected blood to a 15 mL conical tube and dilute 1:1 (v/v) with 1x phosphate buffered saline (PBS), pH = 7.4.",
    "Add 2 mL of density gradient medium to three test tubes. Carefully transfer three equal volume aliquots of diluted blood into each test tube containing the density gradient medium.\n\tNOTE: The total volume of density gradient medium and diluted blood should not exceed three-fourths of the test tube maximal capacity.\nCentrifuge at 1,800 x g, 4 °C for 30 min. Transfer the band at the interface between the layers into a new tube. Add 2 mL of PBS and centrifuge at 1,800 x g, 4 °C for 6 min. The pellet will contain the MPCs.\nWash the pellet several times. Aspirate off the previous solution and gently resuspend the cell pellet in fresh PBS. For subsequent washes, centrifuge at 1,800 x g, 4 °C for 2 min. Repeat the process 6x.\nResuspend the cell pellet in 1 mL of PBS. Mix 20 µL of the cell suspension with 0.4% trypan blue, diluted 1:1 (v/v). Apply a drop to a hemocytometer and count the unstained cells under a light microscope.\nProceed to MPCs determination. Label 5 mL flow cytometry tubes and aliquot out 1 x 106 cells per tube. Prepare the corresponding isotype-matched control antibodies. Centrifuge at 1,800 x g, 4 °C for 6 min and discard the supernatant.\nAdd the primary antibody diluted in 100 µL of an antibody incubation solution consisting of 1x PBS (pH = 7.4), 2 mM ethylenediaminetetraacetic acid (EDTA), and 0.05% bovine serum albumin (BSA). Resuspend for 10 s and incubate for 20 min at 4 °C, light-protected. The protocol may be paused at this step by fixing the lymphocytes in 4% paraformaldehyde in PBS and storing samples up to 24 h at 4 °C.",
    "NOTE: The final concentrations of the primary antibodies used in the present protocol were CD45 1:50, CD34 1:20, KDR 1:50, CD184 1:20, CD133 1:50.\nCentrifuge at 1,800 x g, 4 °C for 2 min and discard the supernatant. Resuspend in 500 µL of 1x PBS (pH = 7.4), 2 mM EDTA.\nPerform flow cytometry analysis. Use isotype-matched control antibodies to set up the background staining. Then, select lymphocytes spread at the FSC/SSC plot, trying to exclude residual granulocytes, cellular debris, and other particles, which are usually located in the lower, left-distributed in the plot. Such distribution is considered as 100%.\nUse a gate containing a high number of cells with common immunophenotype CD45+ and CD34+. For double positive immunophenotypes, use a gate previously identifying CD45+, CD34+, with the addition of either KDR (VEGFR-2)+, CD133+, or CD184+. Identify the MPC subpopulations by their specific cell surface markers. Report as the percentage of gated events.\nIdentify the main subpopulations of MPCs. In the present study the main immunophenotypes were CD45+CD34+CD133+, CD45+CD34+CD184+, CD45+CD34+CD133+CD184+, CD45+CD34+KDR+, CD45+CD34+KDR+CD133+, and CD45+CD34+KDR+CD184.\n\tNOTE: The cell surface markers used were CD45 (lymphocytes), CD34 (endothelial and/or vascular cells), KDR (VEGFR-2, membrane marker of endothelial cells), CD133 (endothelial progenitor cells), and CD184 (hematopoietic stem cells and endothelial cells).\n3. Determination of Plasma Soluble Biomarkers\nUse an enzyme-linked immunosorbent assay (ELISA) to determine the concentration of SICAM-1 and MMP-9 (Figure 3, upper row).\n\t\nCentrifuge the blood samples at 3,000 x g, room temperature for 5 min and collect the plasma.\nLabel the standards, sample tubes, and control tubes. Equilibrate the pre-coated wells in the assay plate by washing 2x with the washing buffer provided in the ELISA kit.\nTransfer the standards, samples, and controls to the wells. Seal and incubate at 37 °C for 90 min.",
    "NOTE: Do not let the wells dry completely.\nDiscard the contents and add the biotin-detection antibody. Seal and incubate at 37 °C for 60 min.\nDiscard the contents and wash 3x. Seal the plaque and incubate sequentially with streptavidine working solution followed by tetramethylbenzidine substrate at 37 °C for 30 min, light-protected. Wash 3x between incubations. When the color develops, add the stop solution, and read the optical density absorbance in a microplate ELISA reader.\nUse an immuno-magnetic multiplexing assay to determine the concentration of tumor necrosis factor alpha (TNFα) and interleukin 1 beta (IL-1β) (Figure 3, lower row).\n\t\nLabel the standards, sample tubes, and control tubes.\nVortex the magnetic beads vials for 30 s. Transfer the bead suspension to appropriately sized tubes, and then to the wells in the multiplexing assay plate. Periodic vortexing avoids precipitation of the beads.\nSecurely insert the hand-held magnetic plate washer. Wait 2 min for the beads to accumulate on the bottom of each well and quickly invert both the hand-held magnetic plate washer and plate assembly, over a sink or waste container. Remember to use the hand-held magnetic plate washer to maintain the beads inside the wells.\nAdd 150 µL of wash buffer into each well and wait 30 s to allow the beads to accumulate on the bottom. Discard the contents as in step 3.2.3. Then, add 25 µL of universal assay buffer (provided in the kit) followed by 25 µL of prepared standards, samples, and controls.\nSeal the plate and incubate for least 60 min at room temperature, light-protected, with constant shaking at 500 rpm. Alternatively, incubate overnight at 4 °C, light-protected, with constant shaking at 500 rpm if possible.",
    "Wash 2x by adding 150 µL of wash buffer and wait 30 s. Discard the contents by inserting the hand-held magnetic plate washer. Wait 2 min and invert over a sink or waste container.\nIncubate sequentially with 25 µL of detection antibody mixture followed by 25 µL of streptavidin-PE solution at room temperature for 30 min, sealed and light-protected, with constant shaking at 500 rpm. Wash 2x between incubations, as described in step 3.2.6.\nObtain the readings. Add 120 µL of reading buffer. Seal the plate and incubate 5 min at room temperature, light-protected, with constant shaking at 500 rpm. Run the reading on a multiplexing assay reader. Adjust the reading parameters according to each analyte.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}