{
  "id": 4296,
  "origin_website": "Bio",
  "title": "Isolation of Mammary Epithelial Cells and Fibroblasts From Mouse Tumor",
  "procedures": [
    "Euthanize mouse when tumor reaches around 1 cm3, sterilize the area around the tumor.Remove the tumor using autoclaved instruments and place in 100 mm sterile dish.Rinse the tumor several times with 5 ml wash buffer until media is clear of blood. Finely mince the tumor with sterile single edged razor blade and sterile scissors.Again rinse the tumor pieces several times with wash buffer until media is clear of blood. Note: Be careful not to aspirate the tissue.Isolate the cells as described previously (Yee et al., 2009). Transfer the tumor pieces into a small autoclaved 10 ml beaker with a small sterile stir bar. Add 5 ml of collagenase solution made fresh at room temperature. Cover the beaker with sterile foil. Incubate for 20 min at 37 °C while stirring. Do not stir too fast.Remove the 1st 20 min collagenase solution (label as first collagenase). The best way to do this is pour through a cell strainer fitted on the top of a 50 ml conical tube. Once all the liquid with single cells passed through, put the tissue pieces back in the same beaker. If you want fibroblast, keep this solution and continue with step 8. However, if you only want to culture mammary tumor epithelial cells, then discard this solution and only keep the tissue pieces and go to step 9. For fibroblast cells only, dilute the 5 ml (first collagenase) solution up to 20 ml with wash buffer. Spin the cells down at 250 x g for 10 min. Remove the supernatant and discard. Re-suspend the pellet in 5 ml growth media, plate it in a 60 mm dishes and incubate at 37 °C in 5% CO2. Note that it is important that cells are not too spaced after plating.",
    "If the number of cells are less than 5 x 106, re-suspend them in a smaller volume of media and use a smaller cell culture dish because many cells might not survive after plating. 6-well plates can also be used in case of fewer cell numbers. Add another 5 ml of collagense solution to the remaining tissue pieces in the beaker and cover with sterile foil (label as second collagenase). Incubate for 20 min at 37 °C with stirring again. Do not stir too fast.Stop the second collagenase by adding 10 ml of wash buffer. The total volume will be 15 ml now. Transfer the solution and tissue pieces from the beaker into a fresh 15 ml centrifuge tube. Spin at 250 x g for 10 min. Transfer only 10 ml of the solution (label as second collagenase) into a fresh tube. Again, if you want fibroblasts, keep the 10 ml solution and repeat step 8. However, if you only want to culture mammary tumor epithelial cells, then discard this solution and only keep the 5 ml pellet containing tissue pieces and go to step 12. To the pellet (remaining 5 ml) add 10 ml of wash buffer and resuspend (this is considered first wash) and incubate at room temperature in laminar flow hood for 20 min. Epithelial cells and fibroblasts were separated by a modification of the sedimentation technique as described previously (Lanari et al., 2001). Therefore, allow the epithelial cells to settle down for 20 min at this step. Remove 10 ml of the first wash, transfer to a fresh tube and keep at room temperature (label as “first wash”).",
    "Add 10 ml of fresh wash buffer to the remaining 5 ml with pellet and allow the cells to settle down by gravity by incubating at room temperature for another 20 min.Repeat step 13 10 times, i.e. do a further 10 washes. Each time collect 10 ml of the wash into a fresh tube and label it with the wash number and add 10 ml fresh wash buffer to the remaining.After the last wash, spin the pellet down in 10 ml wash buffer at 250 x g for 10 min. Remove the supernatant and discard. Add 10 ml growth media to the pellet and transfer the cells into a 100 mm cell culture plate with all the pieces of tissue. This is the final epithelial pellet. At the end, spin all the tubes of all the washes down separately at 250 x g for 10 min. Remove the supernatant and discard. Add 5 ml of growth media to the pellet and transfer the cells to separate 60 mm cell culture plates. If any of the pellets are too small, use less growth media and smaller cell culture plate such as 6-well plates. Alternately, you can combine some of the washes that have few cells and transfer them all in one 60 mm cell culture plate. After plating, cells need to be about 70-80% confluent. Confluence is important at this step. If the cells are too far space out, they will not survive. Using separate plates for each wash gives you the possibility of having more homogenous culture. Leave the cells at 37 °C with 5% CO2 incubator for couple of days before changing the media. The plate that has pellet and pieces of tissue will reach confluence sooner.",
    "Cells will grow away from tissue pieces once they are on a plate. This plate can be trypsenized and the extra cells and tissues can be frozen for future use. This is considered “Passage Zero” cells. Each wash will be a non-homogenous cell mix with different numbers of fibroblast and epithelial cells. You can identify them using a light microscope. At this step, according to your preference you can keep the cultures with mainly epithelial cells or mainly fibroblast cells. In general there is high percentage of fibroblast cells in earlier digestion and washes and more epithelial cells in last washes and final pellet. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140216/20140216204331_1694.jpgFigure 1. Tumor epithelial cells isolated from mouse mammary tumor (20x, Images was acquired using Nikon TE300 inverted microscope equipped with differential interference contrast microscope/phase/fluorescence optics, connected to a Leica DC200 digital camera and analyzed using DCViewer software).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140216/20140216204357_7987.jpgFigure 2. Tumor fibrolast cells isolated from mouse mammary tumor (20x, Images was acquired using Nikon TE300 inverted microscope equipped with differential interference contrast microscope/phase/fluorescence optics, connected to a Leica DC200 digital camera and analyzed using DCViewer software).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140216/20140216204418_7807.jpgFigure 3. Mixed culture of tumor fibrolast and epithelial cells. Fibroblasts are surrounding tumor epithelial cells. Cells were isolated from mouse mammary tumor (20x, Images was acquired using Nikon TE300 inverted microscope equipped with differential interference contrast microscope/phase/fluorescence optics, connected to a Leica DC200 digital camera and analyzed using DCViewer software)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}