{
  "id": 7214,
  "origin_website": "Bio",
  "title": "Chromatographic Assays for the Enzymatic Degradation of Chitin",
  "procedures": [
    "Unless otherwise stated, all solutions are prepared in standard purified water (MilliQ water). Enzymes are produced and purified as described elsewhere (e.g., Mekasha et al., 2020) and are usually stored at 4°C.Preparation of copper-saturated LPMONote: All steps are performed at room temperature; see Notes below for challenges associated with using LPMOs in enzymatic reactions. Mix a solution of Cu(II)SO4 in TraceSelect water (e.g., 50 mM) with a solution of purified LPMO (typically 50-100 μM, for example in 20 mM Tris pH 8.0) to obtain a 3-fold molar surplus of Cu(II) relative to the LPMO.Incubate for 30 min at 4°C, without stirring.To remove excess Cu(II), use a standard gravity flow size-exclusion chromatography protocol as described below (this protocol is slightly modified relative to supplier instructions, to minimize copper contamination in the final enzyme sample):Equilibrate a PD MidiTrap G-25 desalting column by applying 15 ml 20 mM Tris pH 8.0 (enzyme storage buffer) in 5-ml aliquots. Allow the buffer to enter the packed column bed before adding the next portion.Discard the flowthrough.After the final 5-ml aliquot of washing buffer has entered the column, apply 0.5 ml Cu(II)-saturated LPMO solution; allow the solution to enter the packed bed completely.Apply 0.5 ml 20 mM Tris pH 8.0 and allow the buffer to enter the packed bed completely.Discard the flowthrough.To elute the sample, place an microfuge tube under the column and apply 1.0 ml 20 mM Tris pH 8.0 to the column.Collect the flowthrough, which contains the Cu(II)-saturated LPMO.Discard the column.Alternatively, excess free copper may be removed by standard high-performance size-exclusion chromatography using an appropriate chromatographic system. Dialysis is not recommended.",
    "Preparation of substrate (see Notes below for challenges associated with using chitin as a substrate)Mill the chitin to the desired particle size using a Retsch PM100 planetary ball-mill as described below:Transfer chitin flakes to a 500-ml zirconium oxide grinding vessel containing zirconium oxide balls (10 × 10 mm) in (approximately) a 1:1 volume:volume ratio. Typically, with this vessel, one uses 100 ml chitin flakes and 100 ml milling balls; volumes are approximate and determined using a plastic graduated beaker. The appropriate total working volume for this vessel is 75-220 ml.Mill the chitin using a milling speed of 450 rpm for a total milling period ranging from 15 to 30 min; to avoid excess heating, apply 5-min milling periods followed by 2-min pauses.Pass the milled chitin through a Retsch 0.8-mm stainless-steel sieve and collect particles with a size ≤0.8 mm.Transfer the milled chitin (particle size ≤0.8 mm) to a clean and dry container.Store at room temperature.Prepare a homogeneous stock suspension of the milled chitin (50 mg/ml) in TraceSelect water or a suitable buffer by mixing the suspension well for 24 h using magnetic stirring (see Recipes).The suspension can be stored at 4°C. We recommend a maximum storage time of three months.Activity assaysChitinase assay Stock solutions needed before starting the assays:50 mg/ml chitin suspension prepared as described above.1 M BisTris pH 6.0, where pH is set at 40°C.Stock solution of purified chitinase, stored on ice. A typical concentration of such a stock solution would be 50 µM.MilliQ water.Prepare reactions (200 µl) as follows (volumes are based on the use of a 50 µM chitinase stock solution):Using a wide-orifice pipette tip, transfer 40 µl magnetically stirred chitin suspension (final concentration of 10 mg/ml) to 2.0-ml reaction tubes.Add 152 µl MiliQ water and 4 µl 1 M BisTris pH 6.",
    "0 (20 mM final concentration) to the chitin suspension.Incubate the tubes in a pre-heated themomixer with ThermoTop at 40°C for 10 min.Add 4 µl chitinase solution to the reaction tubes. This gives a final chitinase concentration of 1 µM, which tends to be appropriate; variations are possible and may be needed, depending on the enzyme type.Incubate the reactions in a thermomixer with ThermoTop at 40°C, 1,000 rpm for the desired duration (typically 0.5-24 h; the optimal duration of the incubation depends on multiple factors, such as the efficiency of the chitinase(s), the type of chitin, and the purpose of the experiment).LPMO assay The following stock solutions are needed in addition to those listed above:100 mM ascorbic acid (see Recipes).TraceSelect water (metal-free).50 µM stock solution of purified and Cu(II)-saturated LPMO, prepared as described above and stored on ice.Prepare reactions (200 µl) as follows:Using a wide-orifice pipette tip, transfer 40 µl magnetically stirred chitin suspension (final concentration of 10 mg/ml) to 2.0 ml reaction tubes.Add 150 µl TraceSelect water and 4 µl 1 M BisTris pH 6.0) (20 mM final concentration) to the chitin suspension.Incubate the tubes in a pre-heated thermomixer with ThermoTop at 40°C for 10 min.Add 4 µl Cu(II)-saturated LPMO (final concentration of 1 µM) to the reaction tubes.Add 2 µl 100 mM ascorbic acid (1 mM final concentration).Incubate the reactions in a thermomixer with ThermoTop at 40°C, 1,000 rpm for the desired duration (typically 0.5-24 h; the optimal duration of the incubation depends on multiple factors, such as the efficiency of the LPMO, the type of chitin, the amount and nature of the reductant, and the purpose of the experiment).SamplingSampling of chitinase reactions Draw 50 µl samples from the reaction tubes under shaking using wide-orifice pipette tips to ensure obtaining a homogenous suspension of chitin particles.",
    "Immediately filter the samples using a 96-well filter plate and a multiScreen Vacuum Manifold connected to a vacuum pump/compressor. The filtrates are collected into another 96-well plate. This step should be well prepared and take less than 30 s.Quench the reactions by mixing 20 µl filtrate (containing soluble products from the reaction) with 20 µl 50 mM H2SO4 (i.e., a two-fold dilution; see Recipes) in 0.3-ml polypropylene vials; seal with caps and septa.Analyze the samples using the method described in Step E1 below.Sampling of LPMO reactions and further processing for quantitation To analyze the complete profile of soluble LPMO products, including longer oligosaccharides:Follow steps 1 and 2 in “Sampling of chitinase reactions” above. This yields filtrates (from 50 μl reaction samples) containing soluble products.Mix 13 µl filtrate with 37 µl 100% acetonitrile in a microfuge tube (i.e., a final dilution factor of approximately 4).Spin the mixtures at max speed using an Eppendorf centrifuge 5418/54 to pellet the enzyme precipitate.Transfer the supernatants to 0.3-ml polypropylene vials, seal with cap and septum.Analyze the samples using the method described in Step E2 below.To simplify quantitation of soluble LPMO products, further degradation of oxidized chitooligosaccharides by chitobiase (CHB) is recommended. The degradation by CHB yields the oxidized dimer, GlcNAc2ox, and the monomer, GlcNAc, as final products.Follow steps 1 and 2 in “Sampling chitinase reactions” in Section D. This yields filtrates (from 50 µl reaction samples) containing soluble products.Mix the filtrate (containing soluble LPMO products) with a solution of purified CHB, to reach a final CHB concentration of 2 µM. For example, mix 38 µl filtrate with 2 µl 40 µM CHB solution; see Loose et al. (2014) for details.Incubate for 16 h at 37°C without shaking.",
    "Spin the reaction tubes containing the CHB degradation products for a few seconds at max speed using an Eppendorf centrifuge 5418/54 to collect condensation droplets.Transfer 20 µl reaction mixtures to 0.3-ml polypropylene vials containing 20 µl 50 mM H2SO4 (giving a total dilution factor of 2.1), mix well before sealing with caps containing septa.Analyze the samples using the method described in Step E1 below.Product analysis and quantitationAnalysis of native products from chitinase reactions and CHB-treated LPMO reactions (Figure 1).If analyzing a mixture of native monomers and dimers, or a mixture of oxidized dimers and native monomers, HPLC analysis of the samples may be achieved using a Rezex RFQ-Fast Acid H+ (8%) column heated to 85°C, mounted in an UltimateTM 3000 UHPLC system, with 5 mM H2SO4 as the mobile phase (see Recipes) at a flow rate of 1 ml/min. The solutes are separated isocratically over 6 min and detected using UV absorption at 194 nm.Note: The native trimer, tetramer, pentamer, and hexamer are also visible using this method, but the separation of these analytes is suboptimal (Figure 1). If analysis of longer chitooligosaccharides is desired, a Rezex ROA-Organic H+ (8%) column heated to 65°C may be used, with the same system settings as described in point a above, except that the flow rate should be 0.6 ml/min. With this set-up, isocratic elution over 15 min gives better separation of the trimer, tetramer, and pentamer peaks as compared with the method described in a and shown in Figure 1. See Monge et al. (2018) for examples of chromatograms.The amounts of GlcNAc1-6 and GlcNAc2ox are quantitated using GlcNAc1-6 and GlcNAc2ox standards of known concentrations, which need to be analyzed in the same round of chromatographic runs (same sample series). See Section F for preparation of the standards.",
    "Analysis of chromatograms and calculations of analyte concentrations are performed using the Chromeleon 7.2.9 software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4014/bioprotoc-11-09-4014-g001.jpgFigure 1. Examples of chromatograms produced using the method described in Step E1a. Peaks for native GlcNAc1-6, indicated as A1-A6, and the peak for oxidized chitobiose, indicated as A2ox, are labeled. The chromatograms show four standards (A1, A2, A3, and A1-A6), the products of a chitinase reaction (“Jd1381”), and the products of an LPMO reaction that has been treated with CHB (dotted line, showing the native monomer and the oxidized dimer). The figure is modified from Mekasha et al. (2020). The Jd1381 chitinase also contains an LPMO domain, and since the reaction was run with a reductant, the product mixture also contained small amounts of oxidized products, which elute prior to A2, whose poorly resolved peaks overlap with those belonging to longer non-oxidized products. mAU stands for milli-absorbance units.Analysis of product profiles from LPMO-containing reactions (Figure 2).Note: This method can also be used to analyze the product profile of reactions with only chitinases if the separation of chitooligosaccharides using the (faster) methods described in Section E1 is considered insufficient. In this case, samples from the chitinase reactions need to be treated as described for the LPMO reactions (i.e., dilution in acetonitrile). Analyze the samples by HPLC using an Acquity UPLC BEH Amide column mounted in an UHPLC Agilent Technologies 1290 Infinity system with a gradient composed of 15 mM Tris-HCl, pH 8.0, and 100% acetonitrile, as follows: 0-5 min, 74% acetonitrile; 5-7 min, 74-62% acetonitrile; 7-8 min, 62% acetonitrile; 8-10 min, 62-74% acetonitrile; 10-12 min, 74% acetonitrile.Quantitate the amounts of oxidized products using a standard curve based on standards produced as described below. The chromatograms are analyzed using the Chromeleon 7.2.9 software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4014/bioprotoc-11-09-4014-g002.jpgFigure 2. Examples of chromatograms produced using the method described in Step E2.",
    "Peaks for native GlcNAc3-6 are labeled A3-A6. Peaks representing oxidized products are labeled A2ox-A6ox. The dotted lines represent standards of native and oxidized chitooligosaccharides. Note that the α- and β-anomers of the native chitooligosaccharides are separated. The solid lines are examples of product profiles obtained after chitin degradation by a chitin-active LPMO (SmLPMO10A) in the presence or absence of a reductant, ascorbic acid (AscA). The figure is modified from Mekasha et al. (2020).Production of chitooligosaccharide standards, including GlcNAc2ox, GlcNAc3ox, GlcNAc4ox, GlcNAc5ox, or GlcNAc6ox.Preparation of oxidized chitooligosaccharides.Mix 5 mM GlcNAc2, GlcNAc3, GlcNAc4, GlcNAc5 or GlcNAc6, or a mixture of these, with 2 µM purified chitooligosaccharide oxidase from Fusarium graminearum (Heuts et al., 2008; Loose et al., 2014).Incubate at room temperature for 16 h without stirring; this leads to full conversion. The products in the reaction mixture are stable for months when frozen at -20°C.Prepare standard solutions in 74% acetonitrile at concentrations in the range of 0.02 mM to 0.5 mM to generate standard curves for quantitation.Spin the mixtures at max speed using an Eppendorf centrifuge 5418/54 to remove enzyme precipitate.Transfer the supernatants to 0.3-ml polypropylene vials; seal with caps and septa.Standard solutions for native products are prepared by diluting the chitooligosaccharide solutions made in point 1 to yield the appropriate concentrations. The required concentrations depend on the experiment and will usually be higher than those of the standards for oxidized products."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}