{
  "id": 9803,
  "origin_website": "Jove",
  "title": "Physiological Recordings of High and Low Output NMJs on the Crayfish Leg Extensor Muscle",
  "procedures": [
    "1) Introduction\nMotor neurons communicate with a muscle fiber at synapses which are collectively referred to as a neuromuscular junction (NMJ).  NMJs can be accessed easily in most crayfish muscle preparations. Many of the crayfish NMJs demonstrate non-spiking excitatory postsynaptic potentials (EPSP) similar to the graded electrical signals generated in postsynaptic dendrites within the mammalian CNS or subthreshold responses noted in vertebrate NMJs (Wiersma & Van Harreveld, 1938; Katz & Kuffler, 1946). The crayfish NMJs can serve as fundamental synaptic models to provide general insights into synaptic transmission and synaptic differentiation.",
    "Generally, motor units regulate aspects of animal behavior via the type of synaptic communication at NMJs and properties of the muscles. Since the first observation of \"fast\" and \"slow\" muscle contractions in crab and crayfish closer muscle (Lucas, 1907, 1917), similar muscular contractile differentiation has been described in other crayfish muscle types such as abdominal flexors (Kennedy & Takeda,1965a, b) and limb extensors (Van Harreveld & Wiersma, 1936). \"Fast\" contractions initiate quick responses. For example, the crayfish tail flip is a fast behavior.  \"Slow\" contractions maintain slow movements and help maintain posture (Bradacs et al., 1997). Corresponding to \"fast\" and \"slow\" muscle contractions, \"phasic/high output\" and \"tonic/low output\" are broadly used to describe the motor neurons. The difference in rate and timing of muscle contraction is in part related to presynaptic differences in synaptic structure and synaptic strength (King et al., 1996). Myofibrillar protein isoform expression is also important in contractile differences, but in preparations like that of the leg extensor muscle, in which a given fiber is innervated by both types of motor neurons, the focus is on synaptic differences of the terminals, since the terminals share the same target cell (Mykles et al., 2002). An earlier study examined the two excitatory motor axons of the leg extensor and described the phasic and tonic phenotypes (Bradacs et al., 1997). In this report, we demonstrate how to perform the dissection and obtain recordings so that others can further investigate the properties of the synaptic differentiation of these nerve terminals.",
    "Viewed with transmission electron microscopy, various series of sections obtained from the tonic and phasic terminals on crayfish leg extensor muscle revealed that tonic terminals contain more RRP vesicles than phasic terminals; the mitochondria are more prevalent in tonic neurons, and the synapses on phasic terminals are more complex than those on the low-output synapses, since they contain multiple active zones with varied spacing (Miller et al, 2002; Johnstone et al., 2008; King et al., 1996; Bradacs et al., 1997). The low-output tonic terminals are also more susceptible to enhancing synaptic transmission with the neuromodulator serotonin (5-HT) than are the phasic terminals (Cooper et al., 2003).\nThe fact that the tonic and phasic NMJ are present on the same muscle fiber makes it easier to assess presynaptic differences on a given muscle fiber and to address questions of muscle fatigue, synaptic depression and synaptic cross talk.  Various questions remain to be addressed in this preparation, such as whether there are differences in the postsynaptic receptor density and glutamate receptor subtypes in postsynaptic targets for the tonic and phasic terminals, but a better understanding of the fundamental differences in the anatomy and physiology of these two motor units will aid in building a more profound knowledge base. The hope is that the fundamental principles learned in this synaptic preparation will be applicable to other synapses in various preparations and will enhance future investigations in this synaptic model of the crayfish.\n2) Methods\n All the experiments are conducted on the first or second walking legs of midsize crayfish (Procambarus clarkii). The animals are individually housed in plastic containers with oxygenized water. The temperature of the animal room is in the range of 13°C-16°C. The animals are fed with dry fish food and the water changed on a weekly basis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig1.jpg",
    "Figure 1: Schematic of a crayfish walking leg and the six distal segments.\n The distal aspect of the walking leg in a crayfish is anatomically divided into six segments (Figure 1). The leg extensor is located in the meropodite, and the nerve bundle that will be isolated is close to the meropodite ischiopodite joint. The tonic or phasic axon can be selectively stimulated as needed for physiological purposes after they are exposed. \n Cooper and Cooper (2009) described some aspects of the initial dissection, including methods for exposing the excitor of the opener motor neuron within the meropodite region, but their description does not provide the care required for protecting the extensor muscle from damage, as it was not needed to address the opener muscle preparation.  In order to protect the extensor, the first or second walking leg is removed from the crayfish, measuring 6-10 cm in body length (Atchafalaya Biological Supply Co., Raceland, LA), by inducing the animal to automize the limb with forceful pinching distal to the fracture plane in the ischiopodite segment. The leg is placed on the dissection plate with the lateral (outer side) facing the viewer. The leg is turned around until the viewer can be sure the outside (lateral side) is facing up on the dissection plate, usually with the arched side up (Figure 2). Placing the leg on a piece of tissue paper makes it easier to turn the preparation while making these cuts.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig2.jpg\nFigure 2:  The lateral side of the meropodite, usually the side that is arched, is facing up on the dissection plate.",
    "With a scalpel blade breaker and holder,  a sharp razor blade is used to etch the cuticle until just cutting through in the pattern shown in Figure 3 for the meropodite segment. Care is taken not to cut too far distal on the dorsal to ventral cut by the meropodite-carpopodite joint.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig3.jpg\nFigure 3: The meropodite segment with lines as a suggested pattern for etching out the window of cuticle.The preparation is placed in saline. The dissection dish should have a Sylgard (Dow Corning) coating on the bottom (1cm thick).The Sylgard is used so that insect pins can be stuck into it for holding the preparation still. At this point, a pin is stuck in the middle of the carpopodite segment  and in the dorsal aspect of the ischiopodite segment (Figure 4). Dissected preparations are bathed in standard crayfish saline, modified from Van Harreveld s solution (1936), which is made with 205 NaCl; 5.3KCl; 13.5 CaCl2; 2H2O; 2.45 MgCl2; 6H2O; 5 HEPES  and  adjusted to pH 7.4 (in mM).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig4.jpg\nFigure 4: The meropodite segment with cut window being lifted off. Note the location of the dissection pins.\n The cuticle is gently lifted in the distal region and the muscle fibers are cut away from the cuticle by making strokes towards the base of the leg. The cuticle can be lifted off.\n The apodeme (tendon) is cut at the meropodite-carpopodite joint.  A pin is placed on the inner surface of the flexor tendon to show where the cut is to be made (Figure 5). The tendon is then pinched where it was cut with tweezers and the flexor muscle pulled off by lifting it in a caudal direction (Figure 6), exposing the main leg nerve and the extensor muscle.imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig5.jpg",
    "Figure 5: The apodeme of the flexor muscle is highlighted by displacing it from the flexor with a pin.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig6.jpg\nFigure 6: The apodeme of the flexor muscle is cut and removed with care as not to damage the main leg nerve.\n The main leg nerve is cut at the meropodite-carpopodite joint  and carefully pulled back over the extensor muscle. The medial surface of the muscle is used throughout this study. The separation of the nerve to the extensor muscle from the main leg nerve can be enhanced by gently pulling the distal stump of the main leg nerve to the side of the preparation. When peeling the main leg nerve back over the extensor muscle, small branches of axon may need to be cut. These are branches from the inhibitory motor neuron to the extensor muscle. The larger bundle branching off from the main leg nerve near the proximal end of the meropodite is the small nerve bundle of interest. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig7.jpg\nFigure 7: The main leg nerve is cut and pulled back in a proximal direction.This nerve bundle can be seen with methylene blue staining (Figure 8) or with 4-Di-2-ASP fluorescent stain (Figure 9).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig8.jpg\nFigure 8: The extensor muscle stained with methylene blue. Note the axon branching and the two readily visible axons within the nerve. Red arrows demark the nerve track.imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig9.jpg\nFigure 9: The axons of the motor nerve stained with 4-Di-2-ASP. The tonic axon is more brightly visible due to the increased mitochondrial content.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig10a.jpg\nFigure 10A:  Individual terminals of phasic and tonic neurons stained with 4-Di-2-ASP. Note the varicosities on the tonic terminals and the thin nature of the phasic terminals.imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig10b.jpg\nFigure 10B -Tonic notedimgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig10c.jpg\nFigure 10C -Phasic noted\n3) Physiological Profiles",
    "To observe the excitatory postsynaptic potentials (EPSPs) of the tonic or phasic  neurons, one of the isolated axons in the nerve bundle is stimulated by a suction electrode (Figure 11) connected to a Grass stimulator while intracellular potentials in the muscle are monitored (Johnstone et al., 2008). Stimulation at 70 Hz is applied to the tonic axon in order to promote a facilitated response for the low output NMJs, or a single pulse (1 Hz) is applied to the phasic axon in order to obtain large EPSPs of the high output NMJs as shown in Figure 12. The EPSPs are recorded to a computer via a PowerLab/4s interface.imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig11.jpg\nFigure 11: Stimulating electrode placed over a single axon within the nerve bundle. Note the green line outlining the 2 main axons.imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig12.jpg\nFigure 12: Postsynaptic potentials (EPSPs) of the tonic or phasic neurons as obtained by intracellular recordings.\n Investigation in the nature of synaptic facilitation and synaptic depression can be approached by various experimental paradigms with the low and high output NMJs.  Facilitation of the low output NMJs depends on the frequency, as shown for the 20, 40 and 60 Hz pulses of approximately 20 stimuli (Figure 13). imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig13.jpg\nFigure 13: EPSPs in response to a train of stimulation pulses given at three different frequencies 20, 40 and 60 Hz in normal crayfish saline.\n The rate of synaptic depression to frequency of stimulation is also related to the high output NMJs. Figure 14 shows a continuous 5 Hz of stimulation depressing the NMJ over 30 min.  With higher stimulation frequency, the preparation will depress more rapidly (Bradacs et al., 1997).imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig14.jpg\nFigure 14: EPSP amplitude of the phasic response during 5 Hz stimulation to induce depression.\n4) Quantal Responses",
    "A procedure similar to that described for the opener muscle of the crayfish (Cooper and Cooper, 2009) is used in this preparation. The quantal EPSPs directly over identifiable regions of the nerve terminal are recorded by placing the lumen of a macro-patch recording electrode on synaptic varicosities visualized with the vital dye 4-Di-2-Asp (5 μM, 5-min treatment, Cooper et al., 1995; Magrassi et al., 1987). The spontaneous as well as evoked quantal responses can be recorded along the nerve terminals. The evoked and spontaneous synaptic potentials are recorded with the macro-patch electrode (Dudel, 1981; Wojtowicz et al.,1991; Mallart, 1993). Kimax glass (outer diameter: 1.5 mm) was pulled and fire-polished to produce patch tips with inside diameters ranging from 10 to 20 μm (Figure 15). imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig15.jpg\nFigure 15: The lumen of a macro-patch recording electrode.The lumen of the electrode is filled with the bathing medium. The amplifier is the same as that used for the intracellular recordings mentioned above. Electrode and seal resistance can be determined by passing test current pulses through the electrode. In our experiments, seal resistances ranged from 0.3 to 1.0 MOhm and the electrode resistance ranged from 0.5 to 1.0 MOhm. Seal resistance can be monitored throughout the recording.\n Direct counting of quantal events is possible with low stimulation frequencies. For each evoked response, the number of quantal events can be readily determined for the low output terminals (Figure 16). These direct counts can help estimate the mean quantal content (Del Castillo & Katz, 1954; Cooper et al., 1995). Since the evoked high output NMJs produce multi-quantal evoked events, the mean amplitude or area of the deflections, along with the average peak amplitude or area of the spontaneous events, can be used to approximate the mean quantal content (Cooper et al., 1995).imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig16.jpg",
    "Figure 16 Focal traces recorded from a phasic and a tonic NMJ.imgsrc://cloudfront.jove.com/files/ftp_upload/2319/2319fig17.jpg\nFigure 17"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}