{
  "id": 5630,
  "origin_website": "Bio",
  "title": "Photothrombotic Induction of Capillary Ischemia in the  Mouse Cortex during <em>in vivo</em> Two-Photon Imaging",
  "procedures": [
    "Cranial windowsIn order to perform photothrombotic occlusion of capillaries, a cranial imaging window must be generated in the mouse skull. Both thinned skull windows (Drew et al., 2010; Yang et al., 2010) and windows involving full removal of skull can be used (Holtmaat et al., 2009). Occlusions can also be performed through windows that are acute (< 24 h) or chronic. Images shown in this protocol used polished and reinforced thinned-skull windows (PoRTs), and a video and detailed written procedure for this window type are available (Shih et al., 2012a and 2012b). Two-photon microscope and laser for photothrombosisOur system passes a green laser beam through to the imaging objective via the two-photon imaging beam path (Figures 1A and 1B). The microscope we use is a Sutter Moveable Objective Microscope, and details for how to introduce a green laser has been described previously (Taylor and Shih, 2013). The green laser greatly under-fills the back aperture of the 20x objective (Olympus; XLUMPlanFI), yielding a fixed laser focus with ~20-40 μm diameter at the imaging plane. The power of the green laser is ~1 mW at the sample. Prior to initiating photothrombotic occlusion, the location of the green laser focus should be determined. To do this, we place a small piece of filter paper in a Petri dish, apply 25 µl of fluorescein-dextran onto the filter paper and cover with a cover glass. The filter paper is imaged using the 20x objective, and then irradiated with the green laser. The green laser photobleaches the fluorescent dye at its focus, providing a target location relative to the imaging field (Figures 2A and 2B). This is also described in-depth in a previous protocol (Taylor and Shih, 2013). The filter set we use to detect fluorescein-dextran emission is 525/70m-2P (Chroma Corp).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170628/20170628190733_3706.jpgFigure 1.",
    "Photothrombotic occlusion of capillaries in mouse cortex. A. Schematic illustrating two-photon imaging laser and B. photothrombotic green laser beam paths in a typical two-photon imaging microscopy. C. The objective brings the green laser to a focus in upper layers of cortex allowing for photothrombotic irradiation of capillaries. D. Wide-field vascular map of the imaging area contained within the PoRTS window, obtained by montaging several maximally z-projected images collected using a 4x objective. E. Magnified region within the window, visualized with a 20x objective (projected over 100 µm of depth, beginning ~10 µm below the pial surface), showing ischemic damage to capillaries over 24 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170628/20170628190829_4647.jpgFigure 2. Green laser focusing for targeted photothrombosis. A. FITC-Dextran on filter paper prior to irradiation with green laser; B. Photobleached region of filter paper following irradiation with green laser light revealing the laser focus.Targeted photothrombotic occlusionAnesthetize the mouse and affix the animal’s head to a stable imaging apparatus under the two-photon microscope. For anesthesia, the data shown here is collected from a C57BL/6 mouse under 0.75 to 1.5% isoflurane supplied in medical air. However, other types of anesthesia can also be used. Typically, a custom machined aluminum flange is attached to the head using dental cement during a pre-surgical procedure. Later, the metal flange can be secured to a custom holder using screws. There are many variations of head fixation that are compatible to this protocol. See methods in Shih et al. (2012a) for one method for head fixation of mice.Administer 25 µl of 5% w/v fluorescein-dextran (2 MDa) into the infraorbital vein. Using a 0.3 ml insulin syringe, carefully insert the needle tip 3 mm into the corner of the eye closest to the animal’s midline.",
    "To ensure that the needle does not penetrate too deeply, place a mark on the needle 3 mm from the tip using a black marker. The needle should go behind the eye, slightly pushing the eye laterally. Inject the contents of the syringe over a period of 20 sec. None of the solution should accumulate outside the eye, when correctly administered. Withdraw the syringe and carefully clean the eye with a moistened cotton swab. Ophthalmic ointment should then be applied to both eyes to avoid desiccation. A video for this procedure is also available (Shih et al., 2012b). This procedure should be done under anesthesia, and with care to avoid damage to the eye. The vasculature should be clearly visible with two-photon imaging immediately after injection. Too deep insertion of the needle will result in fluorescein-dextran within the cranium and increased subdural fluorescence during two-photon imaging.Starting at a low magnification with the 4x objective, obtain z-stacks of the vasculature over the entire cortical area accessible through the cranial window. These images, when montaged, provide a map of the cortical vasculature for navigation at higher magnification (Figure 1D).Change to the 20x objective and focus on the larger vessels at the pial surface. Use the map collected at lower magnification to determine your location within the imaging window. Locate a region of capillaries without larger vessels overlying them (Figure 1E). When finding a capillary location of interest, target a region at least 20 µm away from larger penetrating vessels, which may lead to larger strokes if inadvertently occluded.Place the target of the green laser over the region of the capillary bed that is to be irradiated (Figures 1D and 1E; white dot).Inject 25-50 µl of 1.25% Rose Bengal into the infraorbital vein, using the same method described above for fluorescein-dextran.",
    "IMPORTANT: Check to be sure that the field of view and green laser focus has not shifted prior to beginning laser irradiation.Initiate photothrombosis by turning on the green laser light (Figure 1B) (1 mW at the sample) and allowing irradiation for 25 sec. IMPORTANT: The Rose Bengal dye will only remain in the blood stream for ~5-10 min, with rapid removal from the blood plasma over this period. Thus, it is important to perform irradiation as quickly as possible after administering Rose Bengal.Imaging the evolution of capillary ischemiaOne can expect to observe complete cessation of blood flow in ~10 capillary segments within a 211 x 211 x 150 µm cube of tissue immediately after the 25 sec irradiation (Figure 3A; yellow arrowheads). A capillary segment is defined as a length of capillary between branch-points. The integrity of the capillary wall is typically maintained in for the first 0.5-1 h after which localized sites of dye leakage begin to appear from non-flowing capillaries (Figure 3A; white arrows). The number of these leakage sites increases gradually over a period of 3 h. For each imaging time-point, we collect image z-stacks of the irradiated region. While our studies have characterized changes occurring in the first 3 h post-occlusion (Underly et al., 2017), the precise experimental time-line and imaging interval can be adapted based on the experimental question. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170628/20170628191052_3059.jpgFigure 3. In vivo observation and post-hoc quantification of capillary leakage. A. In vivo tracking of capillary leakage over 3 h following photothrombotic irradiation of cortical capillaries; B. Two-dimensional (left) and 3-dimensional (right) representation of capillaries before irradiation. Sixteen ROIs (purple) are strung along a capillary segment in the 3-dimensional panel, with ROI 8 positioned at the central point of leakage. C. The same vessels are shown 1 h after irradiation, when fluorescein-dextran leakage is evident.",
    "D. Graph of fluorescein-dextran volumes pre (dotted line) and post (solid line) irradiation, corresponding to the capillary leakage site. The post-irradiation dye volume trace for data of panel C is shown as the solid red line.Image processingImaris supports numerous imaging formats, but Fiji software can be used to convert formats not compatible with Imaris to .tif files. Ensure that the pixel/micron ratios for x-y and z planes are correctly entered into Imaris. The ratios can be modified in Image Properties within the Imaris software. It is also important to consider your file names as Imaris will combine similar file names not separated into different folders.Begin by identifying the initial regions of dye leakage by utilizing the two-dimensional .tif stacks in Fiji. These are regions in which the intravascular dye has begun to expand beyond the initial (pre-image) border of the blood vessels, and are associated with a region of high intensity fluorescence (Figure 3A; white arrows).Using Imaris, open the image stacks containing the fluorescein channel, captured during or after dye leakage has begun. With an image rendered in 3-dimensions in Imaris, string regions of interest (ROIs) along the vasculature where leakage is occurring (Figures 3B and 3C; purple, right column).These ROIs are created by using the ‘Surface’ feature in Imaris and selecting the ‘region of interest’ option. Start by placing an initial region identified at the site of leakage. Then string ROIs outward from this central point, without overlap, to sample surrounding regions of the capillary segment. These ROIs should be appropriately sized so that the depth of the ROI is never completely filled to avoid a volume ceiling effect which would prevent finding the region of peak dye extravasation."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}