{
  "id": 18495,
  "origin_website": "Jove",
  "title": "Measuring Cardiac Autonomic Nervous System (ANS) Activity in Toddlers - Resting and Developmental Challenges",
  "procedures": [
    "This study was approved by the Committee on Human Research of the University of California, San Francisco.  \n1. Pre-protocol Set-up (See Materials Spreadsheet for Complete List of Equipment)\nSet up the equipment by turning on the computer and connecting the ANS data acquisition unit to a power source.\n\tNOTE: Do not turn the acquisition unit on.\nPrior to beginning any data collection, set up the ANS data collection software. Choose settings to match Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53652/53652fig1.jpg\nFigure 1. BioLab Software Configuration settings. This figure displays a screenshot of the configuration settings to be used during ANS data collection as described in step 1.2.\nKeep spot electrodes in a sealed package until they are needed because electrode quality degrades over time with exposure to air. Snap the spot electrodes onto each of the 7 snap leads using a hard surface. Ensure that the leads are untangled and firmly connected to the electrodes.\nTurn the tablet on and cue audio and visual applications (see Step 4 below). Set volume to 80% of max volume on the tablet and full volume on the speaker.\nSet up tripod and video camera in unobtrusive place.\nSet up the lemon juice task items prior to beginning the protocol. Pour some water in a small paper cup for rinsing after the lemon juice task (about 3 ounces). Put a very small amount of lemon juice from a packet into another cup and fill the disposable plastic pipette with 2 drops of lemon juice (this amount will come up to the first narrowing of the pipette and is equal to about 0.1 ml). Rest dropper on a paper towel or in the lemon juice cup and set out of the way.\n2. Preparing the Mother and Child for the Developmental Challenges Protocol",
    "Ensure that two individuals, the Child Assessor (CA) and Computer Operator (CO), are prepared to administer the protocol. Introduce staff to the mother and child and make them comfortable. Make eye contact and talk to the child in order to establish a trusting relationship between the mother, child, and staff. Allow the child some space to acclimatize to the CA and CO. Do not overwhelm the toddler with attention.\nAsk the mother if the child needs to be fed or have his or her diaper changed before the electrodes are placed on the child to avoid disruptions later. Let the mother attend to the child’s needs before starting the protocol.\nAllow the child to play on the floor or an open space during the introduction. Once protocol begins, instruct the mother to keep the child on her lap until it is completed.\nReview the protocol with the mother by reading Script A (see supplemental information). Also, speak to the child directly about what is going to happen during the visit.\n3. Connecting the ANS Acquisition Equipment to the Child\nInstruct the CA to apply the electrodes to the child’s neck and torso (see Figure 2), while the CO distracts the child. Use white circle stickers to demonstrate the electrode placement on a doll to engage the child if necessary. Move quickly and place the electrodes underneath the child’s shirt to minimize likelihood that child will touch or remove the electrodes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53652/53652fig2.jpgFigure 2. Electrode Configuration for 18 month olds.  Note: the 2 ECG electrodes are applied in a Lead II configuration. Also, the alternative electrode placement for the nape of the neck is shown here.",
    "Apply the electrodes directly to the skin. Press with fingers over the paper tape around the gel to ensure that the spot electrode adhered to the skin. All electrodes must be placed at least 3 cm apart from neighboring electrodes to ensure proper signal conduction. For any distances that are difficult to determine, use a measuring tape to measure and verify this minimum distance by measuring the length between the centers of each electrode.\n\tNOTE: The following order of placing electrodes on children has been efficient and well-tolerated by toddlers.\n\t\nPlace the electrode attached to the red (-) lead on the center of the lower back.\nPlace the electrode attached to the white (-) lead just above the xiphoid process, which is located on the xiphosternal junction (bottom tip of the sternum; where the left and right rib cage meet). Ensure that this electrode is at least 3 cm above the red (-) spot electrode.\nPlace the electrode attached to the white (+) lead just left of suprasternal notch (assessor’s right) on the edge of the clavicle.\n\t\t\nUse the measuring tape to measure, verify, and record the distance in cm between the 2 front electrodes (white (+) and white (-)) for later use in the impedance scoring program.\nPlace the first ECG electrode attached to the brown (-) lead on the right clavicle where the clavicle bone meets the shoulder bone. Press on the foam around the electrode and feel the clavicle bone. Place electrode lengthwise along bone.\nPlace the second ECG electrode attached to the brown (+) lead on the left lower rib. Press on the foam around the electrode and feel the rib bone.",
    "Place the grounding electrode attached to the black (-) lead on the child’s lower right rib in line with horizontal plane of the lower left rib electrode.\nBundle and clip lower end of leads to the child’s clothing to minimize movement of leads. Instruct the CO to monitor the computer. Instruct the CA to engage the child and review the activities involved in the protocol with the mother (see Script B in supplemental information).\nTurn on the ANS data acquisition unit in order to acquire impedance and electrocardiogram (ECG) signals. Press “ Redetect” to begin EKG analysis, then click once on “Start” located next to the green light in the lower right hand corner of the program window.\n\t\nWait 5 min after the electrodes have been placed to allow for the gel to adhere fully to the child’s skin for optimal conductance of the ECG and impedance signals. After 5 min, check the computer screen to view the signals and makes sure they look normal (CO). Turn on the video camera (CO).\n\t\t\nAvoid small talk with the child during this time. Offer child a standardized “optional” soft toy to hold if he or she seems uncomfortable (plan to remove toy from hand just prior to protocol beginning).\n\t\t\tNOTE: Explain to the child and mother that it is necessary to wait a bit to make sure the equipment is working correctly.\nShow computer image of child’s heart activity to mother and explain what each signal represents. Remind mother that this activity is not used to diagnose any health problems. Assure her that if the research team notices something concerning, she will be notified. Follow Script B (see supplemental information).\n4. Administering the Tasks in the Developmental Challenges Protocol",
    "Open the media player in the tablet. Play the first 1-min lullaby. Keep the tablet out of reach of the child.\nHold jack-in-the-box in front of the child. Slowly rotate the arm and play the music until the sock monkey pops up, making it take 15 sec to finish one round. Repeat four times.\nStart lemon juice task with Script C (see supplemental information). Place 2 drops of concentrated lemon juice on the center of the child’s tongue, slightly back from the front, so juice does not roll off the tongue.\n\tNOTE: If the pipette was resting in the juice cup, shake off extra drops from the outside of the pipette prior to dropping it on the tongue.\n\t\nWait 10 sec quietly with a friendly, neutral expression. Say “What did it taste like?” if the child needs reassurance.\n\t\tNOTE: The lemon juice task must take at least 20 sec, starting from telling the child about the liquid through waiting until after the drops are in their mouth and then watching for a reaction.\nAt least 10 sec after dropping lemon juice say, “Now it is time to drink some water,” and give the child a sip of water. If child refuses, wait a few seconds and try again by saying, “Now you can take a drink of water.” Press the F4 key as the assessor starts offering the water (CO).\nPlay the 30 sec recording of the sick infant crying on the tablet using a media player. Keep the tablet out of reach of the child.\nPlay the second 1 min lullaby on the tablet using a media player. Keep the tablet out of reach of the child.",
    "Play the 2 min neutral video on the tablet using a media player. Hold the tablet roughly 12 inches from the child’s face but do not let them grab and hold the tablet.\n5. Marking Protocol Segments During the Developmental Challenges Administration (CO) \nInstruct the CO to push function (F) keys (set a priori by the user to identify the tasks or potential problems during data scoring) to mark important protocol steps in the ANS data (see Table 1). Push F11 to indicate that a task ended early (type “ended task early” and explanation into text box) or for major protocol problems or violations, like an electrode falling off or someone walking in the room and distracting child (type explanation into text box).\ntable:\n﻿0,1,2\nMarker Key,Event,Duration after Start\nF1,Lullaby 1 start,60 sec\nF2,Jack in the box start,60 sec\nF3,Lemon juice script start,At least 20 sec\nF4,Lemon juice end (water drink offered),At least 10 ses\nF5,Infant cry start,30 sec\nF6,Lullaby 2 start,60 sec\nF7,Video start,120 sec\nF10,End of DCP (video end),\nF11,Serious irregular events,\nTable 1: Marker-Keys for Protocol Event Marking During Challenge Tasks. Marker keys as described in step 5.1 are shown, used to indicate important protocol events and rare occurrences in the ANS data file.\n6. Post Developmental Challenges Protocol\nHave the CA say to the mother:“So how was that for you? (pause to hear response) It’s interesting to see how children respond to these various activities. Now it is time to gently remove the electrodes from your child’s skin.” \nTurn off the ANS data acquisition before touching/removing electrodes.\n\tNOTE: The equipment will not conduct or transmit electricity when it is turned off.",
    "Remove electrodes from the child by using one finger to hold the skin tight while the other hand removes the electrode. Pull up on the tab on the electrode and away from the direction the tab is pointing. Remove the most sensitive electrodes last (front and back of the neck). Allow the mother to remove electrodes if the child is particularly upset or if she desires to. Use a wet wipe to remove any excess residue remaining on the skin from the electrodes and a dry gauze pad if the skin is wet or there is gel on the skin.\nTurn off the video camera. Save the ANS data file, exit the program, and turn off the computer.\n\tNOTE: The ANS data acquisition software creates two data files, the “.mw” file (raw ANS data) and an “.event” file, which is a text file of function keys pressed.\n7. Respiratory Sinus Arrythmia Scoring\nOpen the Heart Rate Variability (HRV) Analysis program to clean ECG data and score heart rate (HR), RSA, and respiratory rate (RR).\nimgsrc://cloudfront.jove.com/files/ftp_upload/53652/53652fig3.jpg\nFigure 3. HRV Analysis Main Navigation Screen. Settings for scoring the toddler ANS data using the HRV Analysis scoring software are displayed. To score segments, drag events to the ‘Event Type” boxes.\nReview any available field notes from data collection to be aware of unusual circumstances or errors that may have occurred. Locate and double-click the “.mw” file to be scored from the pop-up window (“Choose or Enter Path of File”).\n\tNOTE: The file name for the participant data being scored should appear in the white box on the top of the screen.",
    "Set the “Channel Labels” as follows: Channel 1- ECG, Channel 2- Zo, Channel 3- DZ/dt. Verify that the Sampling Frequency is set to 1,000. Click “ok” at the bottom of the screen to open the main navigation screen (Figure 3).\n\t\tNOTE: These channels should match those set during data collection.\nChoose settings to match those in the figure. Set Mode to “Event.” Set Event Identifier to “Name” to view the name of the task (i.e., “jack-in-the-box”). Set the “Post Event Time(s)” to 30 sec.\n\t\tNOTE: File Length will vary for each child’s file. “Type” refers to the Function (F) key that was pressed during the protocol by the CO. If the Mode is not Event but is Time, the “Segment Time” can be set to different lengths of time in seconds (i.e., 30 or 60).\nClick the “HRV Calibration Settings” tab. Set calculation method to “Entire”. Set respiratory signal to “Zo” (not dZ/dt). Set windowing Function to “Hamming”. Set VLF Band range to 0.003 to 0.04 Hertz (Hz), low frequency or LF Band range to 0.04 to 0.15 Hz, and high frequency HF Band range to 0.15-1.04 Hz for infants and toddlers.\nClick the next tab, “R Peak & Artifact Settings.” Set IBI and MAD MED to “on.” Set the Maximum Heart Rate (beats per minute (BPM)) to 230 and Minimum Heart Rate to 40 BPM. Set the slider bar for the R Peak Detection Sensitivity to 1. Set manual override to OFF. Turn Baseline and Muscle Noise Filter on (bright green) and notch filter off (dark gray). Set the noise filter to 60 Hz.",
    "Click the next tab, “Additional Settings.” Click the yes/no box in the output settings section (“Use default output path”) to choose the default location to save the output file. Check the “Show report” button (bright green).\n\t\tNOTE: Synchronous video can be viewed by clicking the “Yes/No” box under “use default video path.” A previously edited data file can be viewed by clicking the “use edited data” Yes/No box.\nReturn to the “Events and Modes” tab. Click the “analyze” button.\nChoose “yes” or “no” when asked, “Is the ECG inverted? No/Yes.”\n\t\tNOTE: The majority of ECGs are not inverted. The analysis window will open, showing 30 sec of data. The HRV Analysis program marks each R peak with a light blue dot and marks a yellow star when there is a potential ‘outlier’ or irregular pattern. Outliers may be marked when the distance between two R peaks is different that the regular R-R interval for this individual.\nReview all outliers (yellow stars) to identify the reason for the yellow star (see editing options in 7.1.1.9). Record variables of interest in the data log after making any necessary edits.\n\t\tNOTE: The bottom right box of the analysis window shows the calculated values from this segment, including HR, RR and RSA.\nClick “Edit R’s” (the green button in the Controls window) to examine outliers. Click the magnifying glass icon to zoom in further.\nUse the red “delete” button to remove yellow stars that are incorrectly placed and the white “insert” button to mark the R peaks.",
    "NOTE: It is usually clear where R peaks should be deleted or manually marked. Extremely messy sections can be removed using the yellow “Remove Data Portion” button, after sliding the light blue x cursors around the section to be deleted. This should only be done at the beginning or end of a segment; there must be 20 consecutive sec of data to calculate valid scores for a 30 sec segment.\nClick “OK’ at the bottom of the screen to save edits, return to the previous screen, and display edited data. Click “Write” (the white button in the top toolbar) to output scored data to an Excel file. Repeat this process for each 30 sec interval or task to be scored.\n\t\tNOTE: “Cancel” exits without saving changes.\nClick “Done” on the “Controls” panel after editing and writing all 30 sec segments of data.\n\t\tNOTE: A pop-up window will request a filename for the edited data. All of the edited data and scored data for each child will be saved to one .edh file.\n8. Pre-ejection Period Scoring\nNOTE: The Impedance (IMP) Analysis program allows one to clean the impedance data and obtain HR and PEP values.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53652/53652fig4.jpg\nFigure 4. IMP Analysis Impedance Calibration Settings Screen. Settings for scoring the toddler ANS data using the Impedance Analysis scoring software are displayed.\nOpen the IMP Analysis Program. Double click on the IMP Analysis program and choose the same .mw file just scored in HRV Analysis. Choose the same channels for each “Channel Label:” Channel 1- ECG, Channel 2- Zo, Channel 3- dZ/dt. Press “OK.” On the Events and Modes tab, choose the same settings as for the HRV Analysis program.",
    "Click the “Impedance Calibration Settings” tab (Figure 4). Choose settings to match those in the Figure. Set “Electrode Type” to “spot”. Enter the electrode distance (distance between white electrodes as measured and recorded during data collection). Set “Ensemble Length (ms)” to 400 for toddlers.\nSet “Q point calculation method” to “Minimum value K-R interval.” Set the K value to 25 for 18 month olds (the K value can be adjusted on a per-child basis if needed). Set “B point calculation method” to “percent of dZ/dt time + C.” Set the percent dZ/dt peak to “55” and the constant to “4”. Set the “dZ/dt source” to “measured”. Verify that the “Detrend dZ/dt” light is ON for the non-mobile acquisition unit.\nClick the “R Peak & Artifact Settings” tab. Verify that the IBI min/max and MAD MED checks are “on.” Set the Maximum Heart Rate (BPM) to 230 for toddlers and the Minimum Heart Rate (BPM) is 40. Set the Peak Detection Sensitivity to 1. Set Manual Override to off. Turn on the “Baseline and Muscle Noise Filter” (bright green). Turn off the “notch filter” (dark green). Turn off the 60 Hz setting.\nClick the “Additional Settings” tab. Do not check the “Auto Analyze All Data Segments” button. Choose “YES” in the “Use Edited Data” yes/no box if any edits were made in the HRV program. Double-click the edited (.edh) file from the pop-up box. Choose “Excel” for the output mode. Click the bright green “Analyze (Enter)” button.\n\t\tNOTE: If no edits were made while scoring HRV, it is not necessary (or possible) to use edited data here.\nClick “Ensemble Editor” to see a full-screen view of the ensemble wave, which is an image that averages all the waveforms from the segment.",
    "Check the placement of the Q point, which is determined by the K value entered during set-up. Scroll through all of the segments to check the Q placement.\n\t\tNOTE: The Q point should be the lowest point just before the red (EKG) line starts to rise to the R peak. If there is a gradually sloping “pre-Q” area, the Q should be marked at the point where the slope to R starts to rise more steeply.\nReturn to the Impedance Calibration Settings tab and increase the K value by 5 if the Q point marking is not correct when K=25. Review segments again. Continue making changes to K until the Q marking is optimal.\n\t\tNOTE: The K value needs to be consistent for each child; do not choose different values for different segments and do not move any marks by hand.\nRecord the PEP value for each segment scored.\n\t\tNOTE: PEP is fairly stable within each individual and typically fluctuates by 4-6 ms throughout the assessment for each child. However, PEP values may be very different across children.\nClick the “Write” button in order to output score data to an Excel file. Repeat this process for each section to be scored.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}