{
  "id": 13319,
  "origin_website": "Jove",
  "title": "Neurogenesis Using P19 Embryonal Carcinoma Cells",
  "procedures": [
    "1. Culture Maintenance\nCulture the P19 cell line in Maintenance Medium (Dulbecco's modified Eagle's medium with 4,500 mg/L of glucose supplemented with 10% FBS, 100 units/mL penicillin and 100 units/mL streptomycin). Incubate at 37 °C and 5% CO2.\n2. Sub-culturing Cells\nWhen cells reach approximately 80% confluence, remove the spent medium from the cell culture flasks (surface area 25 cm2).\nWash the cells with 2 mL of phosphate buffered saline (PBS) free of calcium and magnesium.\nAdd 1 mL of 0.25% trypsin-EDTA (ethylenediaminetetraacetic acid) onto the cell monolayer.\nPut the flask in the CO2 incubator (37 °C and 5% CO2) for 2-3 min.\nAssess the cell attachment to the flask surface. Ensure that all of the cells are detached and floating in the medium.\nAdd 9 mL of Maintenance Medium to stop the enzymatic activity of trypsin.\nResuspend the cells in Maintenance Medium.\nTransfer cells to a 15 mL tube and centrifuge for 5 min at 200 x g and room temperature (RT).\nDiscard the supernatant and add 10 mL of fresh Maintenance Medium into the 15 mL tube.\nUse the cell suspension to determine the cell number using a cell counter according to manufacturer's instructions.\nSeed cells at 2 x 104 cells/cm2 in a new 25 cm2 flask.\nAdd the Maintenance Medium up to 10 mL.\nPut the flask with cells in the CO2 incubator (37 °C and 5% CO2) for 2-3 days.\n3. Trypsin Digestion\nAspirate Maintenance Medium from the cell flask. Wash the cells once with 2 mL of calcium and magnesium-free PBS.\nAdd 1 mL of 0.25% trypsin-EDTA.\nPut the flask with cells into the CO2 incubator at 37 °C for 2-3 min.\nUse 1 mL pipette to dissociate the cells by pipetting cells ten times.",
    "Neutralize trypsin by adding 9 mL of Differentiation Medium (Dulbecco's modified Eagle's medium with 4500 mg/L of glucose supplemented with 5% FBS, 100 units/mL penicillin and 100 units/mL streptomycin) without RA to the cells.\nTransfer cells to a 15 mL tube and centrifuge for 5 min at 200 x g and RT.\nDiscard the supernatant and add 1 mL of Differentiation Medium without retinoic acid (RA). Resuspend the cell pellet.\nUse the cell suspension to determine the cell number using a cell counter according to manufacturer's instruction.\n4. Aggregate Generation\nAdd 5 µL of RA (1 mM stock dissolved in 99.8% ethanol, stored at -20 °C) to the 10 mL of Differentiation Medium and mix well (final concentration of 0.5 µM RA).\nNOTE: RA is light sensitive. Low concentration of EtOH does not affect cell differentiation19,20,21.\nAdd 10 mL of Differentiation Medium (with RA) to the 100 mm non-treated culture dish (dedicated to suspension culture).\nSeed the 1 x 106 cells in the 100 mm dish (Dish surface area 56.5 cm2).\nPut the flask with cells into the incubator at 37 °C and 5% CO2 for 2 days in order to promote aggregates formation.\nAfter 2 days, exchange the Differentiation Medium. Aspirate medium containing aggregates using a 10 mL pipette and transfer to a 15 mL tube at RT.\nAllow the aggregates to settle by gravity for 1.5 min at RT.\nDiscard the supernatant.\nAdd a fresh 10 mL of Differentiation Medium with 0.5 µM RA using a 10 mL serological pipette.\nCAUTION: Do not pipette the cell aggregates up and down.\nSeed the aggregates into new 100 mm non-treated culture dish (dedicated to suspension culture).\nPlace the plate in the incubator (at 37 °C and 5% CO2) for 2 days.\n5. Aggregates Dissociation",
    "Aspirate the cell aggregates using a 10 mL pipette.\nTransfer the aggregates to a 15 mL tube. Allow the cell aggregates to settle by gravity for 1.5 min.\nRemove the supernatant.\nWash the aggregates with DMEM alone (serum- and antibiotic- free).\nAllow the cell aggregates to settle by gravity sedimentation for 1.5 min at RT.\nAspirate the supernatant and add 2 mL of trypsin-EDTA (0.25%).\nPlace the cell aggregates into a water bath (37 °C) for 10 min. Agitate the aggregates gently every 2 min by tapping with a hand.\nStop the trypsinization process by adding 4 mL of Maintenance Medium.\nPipette aggregates up and down 20 times using 1 mL pipette.\nCentrifuge cells for 5 min at 200 x g and RT.\nRemove the supernatant and resuspend the cell pellet in 5 mL of Maintenance Medium.\nDetermine the cell number with a cell counter.\n6. Plating Cells\nAdd 3 mL per well of Maintenance Medium to a 6-well plate.\nSeed cells in the 6-well culture plate at a density of 0.5 x 106/well.\nIncubate at 37 °C with 5% CO2 concentration.\nSeed the cells on cover glass in 6 well culture plate and perform immunostaining with anti-MAP2 antibody (20% confluence). Use 6-well plate to isolate RNA and perform RT-PCR for Map2, NeuN, Oct4, Nanog, and Gapdh (20% confluence).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}