{
  "id": 19101,
  "origin_website": "Jove",
  "title": "Development of Obliterative Bronchiolitis in a Murine Model of Orthotopic Lung Transplantation",
  "procedures": [
    "1. Donor Procedure\nAll surgical procedures were performed utilizing sterile technique. No antibiotics are given to both donor and recipient mice.\nInduction of anesthesia of the donor mouse is initiated with 5% Isoflurane.\nThe mouse is orotracheally intubated with a 20-gauge intravenous catheter and then placed on a rodent ventilator, using 100% oxygen at a rate of 125 breaths/minute and approximately 0.5 ml tidal volume (2% of its body weight).\nAnesthesia is maintained with inhaled 1-2% Isoflurane.\nThe donor mouse is placed in a supine position, prepped with 70% alcohol.\nLaparosternotomy is performed as a combined midline and transverse incision.\nHeparin at 100 u/kg is injected into the Inferior vena cava (IVC), from just below the liver.\nThe diaphragm is cut along the ventral costal attachment toward the spine, and the thoracic cavity is exposed by cutting both sides of the chest wall to the neck.\nAfter incising the IVC at the level of diaphragm, the right atrial appendage is cut and the lungs flushed with 2 ml of cooled (4 °C) Lactated Ringer's injection and 0.1 ml of heparin via a transverse incision at the root of the pulmonary artery (PA) trunk.\nArresting ventilation at two thirds of end-tidal inflation, the heart-lung block is excised and stored on ice (4 °C).\nThe donor left lung is prepared for the recipient by the attachment of cuffs. The pulmonary ligament is incised up to the Pulmonary Vein (PV). The hilum is brought out by removing esophagus and aorta.\nIdentify the PA, located at the most cranial aspect of the hilum, as well as the attached main bronchus (Br). Carefully dissect the PA from the bronchus.\nPA cuff is made from a 24-gauge Intravenous (I.V.) catheter and cut to 0.5 mm in length with an extension of 0.7 mm.",
    "The entire surface of the cuff is then abraded to facilitate anastomosis.\nThe cuff for the bronchus is derived from a 20-gauge IV catheter, and cut in length of 1.0 mm with an extension of 0.7 mm.\nUsing the same materials, the PV cuff varies with the weight of the donor mouse. Specifically, for mice 24-27 grams the cuff size is 22-gauge, 0.7 mm in length with a 0.7 mm extension. For mice weighing 27-32 grams, the studies utilized a 20-gauge catheter that is 0.7 mm in length with a 0.7 mm extension.\nThe cuffs are inserted into the distal ends of the PA, PV and Br and secured with a 9-0 suture.\nThe donor lung is flushed and washed with sterile saline with sterile heparin before storage. The donor lung is then wrapped with sterile gauze soaked in sterile saline on ice (4 °C), which keeps the lung very clean and sterile. \nA microvessel clamp is placed on the bronchus to prevent Lactated Ringer entry into the airway.\n2. Recipient Procedure\nInduction of anesthesia and mechanical ventilation are the same as described for the donor above.  \nThe left chest wall is shaved and prepped with 70% alcohol and the surgical field is draped.\nA thoracotomy incision is made in the left third intercostal space, extending the incision dorsally close to the spine, and a microvessel clamp placed on the left pulmonary vessels and bronchus adjacent to the heart. You can see PA at the cranial aspect, PV at the caudal end of hilum and Br between them.\nUsing gentle traction on the hemostat to cause mild tension on the PA, Br and PV, the left lung is pulled out from the thoracic cavity while leaving the central hilar structures clamped.",
    "The PA, PV and Br are isolated by blunt dissection followed by placing a 9-0 suture positioned loosely around the PA, PV and Br.\nAfter dissecting the PA completely from its adventitial sheath, a small transverse incision of approximately one fourth of the vessel's circumference is made into the anterior wall, leaving the continuation of the dorsal part of the artery intact.\nThe donor lung, wrapped in cold, Lactated Ringer-soaked cotton gauze and prepared as described above, is then positioned into the thoracic cavity, and cuffs inserted into the recipient PA, PV and Br and secured with 9-0 suture.\nThe hilar cross clamp is removed allowing for reperfusion and ventilation.\nAfter positioning the transplanted lung back into the recipient thorax, the thoracotomy incision is closed using a 5-0 suture.\nThe mouse is allowed to recover from anesthesia. Buprenorphine (0.05-0.15 mg/kg) is administered immediately after surgery, and for every 8 hours for 2-3 days post-surgery.\n3. Representative Results\nOur experience has taught us that it requires several months of repeated practice to become proficient in the mouse lung transplant model. After proficiency is attained, we achieved a 96% (96/100 consecutive surgeries) perioperative survival rate with deaths occurring within seven days post operatively. Two deaths were due to bleeding that began intraoperatively, and pneumothraces were the cause of death in the other two mice. For all procedures, the warm ischemia time was 14.32 ± 3.14 minutes, and cold ischemia time was 58.51± 18.06 minutes. Three orthotopic lung transplant groups were studied: isograft: C57BL/6→C57BL/6, allograft: C57BL/10→C57BL/6 and C57BL/6→C57BL/10. We used only male mice but our technique can be also applied to female mice, because there is no significant anatomical difference between the sexes.",
    "Grading of rejection pathology was conducted in a blinded fashion utilizing standard criteria for clinical lung transplantation7(Table 1). Whereas we observed mild or no rejection in isograft (C57BL/6→C57BL/6), both allograft combinations developed comparable acute or chronic rejection (Figure 1). In contrast, OB was significantly more frequent in the C57BL/10→C57BL/6 than C57BL/6→C57BL/10 group by day28 (Table 1).\ntable:\n﻿0,1,2,3,4\n,C57BL/6→  C57BL/6,C57BL/10→  C57BL/6,C57BL/6→  C57BL/10,P-value\n\"Rejection Pathology  \"\"A\"\" Scores at day 28\",0.67±0.89,*3.33±0.82,*3.29±0.76,*P>0.05\nOB/Total mice at day 21 and 28,0/24 (0%),**14/34 (42.1%),**2/16 (12.5%),**P<0.05\nTable 1.  Histological scores of acute rejection and prevalence of obliterative bronchiolitis post transplant. Scoring of acute rejection (\"A\" Scores) by standard criteria as described in representative results. Data represents the mean ± SD of \"A\" Scores at days 28 post transplantation. Data represents the quantity and percentage of mice in each group that developed OB at days 21 and 28 post transplantation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3947/3947fig1.jpg\nFigure 1. Macroscopic findings and histopathology at 28 days post lung transplantation. Panel 1A represent macroscopic findings and H&E stained Isograft lung and right naïve lung. Panel 1B and 1C represents H&E and Masson's Trichrome stained BL/10 lung allograft transplanted into BL/6 mouse recipient, which developed OB and non OB, respectively. The white arrow in 1B identifies lesions of OB. Panel 1D shows BL/6 lung allograft transplanted into BL/10 mouse recipient.\nMain trouble shooting during the procedure were as follows.\nBlood flow disorder: Flush donor lung until the color becomes white in color. Use of excessive pressure could induce pulmonary edema. But do not push too much to prevent edema after transplant.\nDifficulty of cuff insertion into the donor: Ascertain that vasculature is of sufficient length and free of attached fat and connective tissues.\nBleeding at anastomotic site: Use Q tips to apply pressure at affected site for approximately 5 minutes.",
    "Recipient PA blood flow obstruction: Mainly caused by torsion of the during cuff insertion. If air is observed within the PA then re-do of the anastomosis is necessary.\nDifficult PV anastomosis: Membrane of PV is very thin and easily tears. Select proper cuff size and insert straight to the recipient's PV very gently.\nRecipient PV blood flow obstruction: Make sure the position and direction of the cuff. Release the compression from the bronchial cuff.\nPneumothorax: This may be caused by either bronchial perforation due to manipulation of the airway, or perforation of lung surface due to trauma associated with the transplant procedure. The former is treated with surgical closure of the hole within the airway wall; and the latter is treated by oversewing the leak on the lung surface using 10-0 nylon suture."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}