{
  "id": 7364,
  "origin_website": "Bio",
  "title": "Anaerobic Expression and Purification of Holo-CCIS, an Artificial Iron-sulfur Protein",
  "procedures": [
    "The following methods describe the native maturation of iron-sulfur clusters within the CCIS protein and helix 1 of CCIS described as ‘h1’ (Jagilinki et al., 2020). These methods can, in general, be used for any natural and artificial proteins to achieve high yields of biologically assembled [4Fe-4S] clusters.Transformation of CCIS/pET-28a (+) in BL21(DE3) competent cellsNote: Perform Steps A1-A8 under aseptic conditions. To 20 µl of BL21(DE3) competent cells in a clean Eppendorf tube, add 100 ng of CCIS/pET-28a (+) DNA plasmid and incubate on ice for 40 min. Figure 1A represents the overall layout of the CCIS fusion protein, whereas Figure 1B shows the vector map of the CCIS/pET-28a (+) construct. (weblink to the pET-28a (+) vector map http://wolfson.huji.ac.il/expression/commercial-vectors/pet-28-map.pdf[href=http://wolfson.huji.ac.il/expression/commercial-vectors/pet-28-map.pdf]).During the incubation time, set the dry bath temperature to 42°C.Following incubation, heat shock the BL21(DE3) competent cells for 90 s in the dry bath at 42°C.Place the Eppendorf back on ice for 5 min.Add 800 µl of LB medium to the Eppendorf containing DH5α competent cells inside the laminar hood.Transfer the competent cell vial to a shaker incubator and incubate at 37°C for 45 min at 200 rpm.Following incubation, transfer the competent cells inside the laminar hood and add 50 µl of culture onto an LB agar plate containing kanamycin and gently spread the culture using a sterile spreader.Allow the plate to air dry and incubate the LB agar plate inverted at 37°C for 16 h.Starter culture of BL21(DE3) competent cells harboring CCIS/pET-28a (+)Note: Perform Steps B1-B3 under aseptic conditions. Add 10 µl of kanamycin to 10 ml of LB medium in a sterile 50 ml Falcon tube.Pick an isolated colony from the transformed plate and inoculate into 10 ml of LB broth medium containing kanamycin.Incubate the culture in a shaker incubator at 37°C overnight.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210915/20210915222954_1856.jpgFigure 1.",
    "CCIS fusion protein layout (A) and vector map of CCIS/pET-28a (+) (B). The gene of interest is cloned between NcoI and XhoI.Ideal growth conditions for high yields of in vivo assembled CCISNote: Steps C1 to C3 should be performed inside a laminar flow hood. To 1 L TB medium, add 4 ml of ammonium ferric citrate stock solution (final concentration 4 mM) and add 2 ml of freshly prepared L-Cysteine hydrochloride hydrate (final concentration 2 mM) (see Notes 1 and 2). Similarly, add 25 ml of D-glucose solution (final percentage 0.5%) to the medium (see Note 3).Add a 1,000-fold dilution of kanamycin (50 mg/ml of stock solution in water) to the culture medium (1 ml in 1 L TB).Inoculate the 1 L TB medium with a 100-200-fold dilution of overnight grown starter culture (5-10 ml).Allow the culture to grow in a shaker incubator at 37°C and with 200 rpm agitation until the optical density (OD600) reaches 0.8-2.0, determined using an OD600 spectrophotometer (see Note 4).Once the desired OD is reached, remove the cap from the culture and transfer the culture flask along with the cap separately inside the anaerobic chamber, and let the culture stay inside the chamber for at least one hour to make the culture anaerobic.After one hour of incubation inside the chamber, add 2 ml of freshly prepared L-Cysteine hydrochloride hydrate (final concentration 2 mM) and add 500 µl of IPTG solution (0.5 mM) to the culture; then, tighten the GL45 screw cap inside the chamber (see Notes 5 and 6).Remove the conical flask containing culture with airtight cap under anaerobic conditions from the anaerobic chamber and allow growth for protein over-expression in a shaker incubator at between 20 and 24°C and 160 rpm of agitation for at least 16 h (Figure 2A).",
    "Alternatively, if inducing at room temperature (~25°C), leave the conical flask inside the anaerobic chamber on a magnetic stirrer at 160 rpm for 16 h with stirrer bar inside the culture (Figure 2B).After 16 h, transfer the culture inside the anaerobic chamber, pour the culture into the centrifugation bottles, and tighten the cap (see Note 7).Remove the bottles from the chamber and centrifuge them at 3,075 × g for 15 min at 4°C.Either freeze the cultures anaerobically or isolate the protein immediately inside the anaerobic chamber.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210915/20210915223032_7660.jpgFigure 2. Anaerobic induction of iron-sulfur proteins. A. Preferred method of anaerobically inducing iron-sulfur proteins inside orbital shaker where both temperature and rotation speed of the shaker can be controlled. B. Alternative method of anaerobically inducing iron-sulfur proteins at room temperature by placing the conical flask on a magnetic stirrer with a stirrer bar inside. This can be performed either inside or outside the anaerobic chamber.Ideal growth conditions for biologically assembled 57Fe labeled holo-CCISNote: Steps D1 to D3 should be performed inside the laminar hood. To 1 L M9 medium, add 10 mg of 57Fe ferrous sulfate.Add a 1,000-fold dilution of kanamycin (50 mg/ml of stock solution in water) to the culture medium (1 ml in 1 L M9 medium).Inoculate the 1 L M9 medium with a 100-200-fold dilution of overnight grown starter culture (5-10 ml).From step 4 to step 12, refer to steps mentioned in section C. Ideal growth conditions for high yields of in vivo assembled CCIS”.Anaerobic isolation and purification of iron-sulfur proteinsTransfer the bacterial pellet (either fresh or frozen) inside the anaerobic chamber (see Note 8).Resuspend 1 L bacterial pellet in 20 ml of buffer A additionally containing protease inhibitor cocktail at a 1:1,000 ratio.",
    "Sonicate the culture inside the anaerobic chamber at least for 5 one-minute cycles with intermittent pulses (see Note 9).Transfer the cell lysate into sorvall tubes and centrifuge at 2,4000 × g for 30 min at 4°C.Following centrifugation, transfer the sorvall tubes inside the anaerobic chamber and decant the clear supernatant into a clean 50 ml Falcon tube.Allow the supernatant to flow through (gravity flow) Strep resin, pre-equilibrated with 5 column volumes of buffer A (see Note 10).Following binding, wash the strep resin with 10 to 20 column volumes of buffer A.Add TEV protease in 1:200 ratio to perform on-column cleavage. Allow the cleavage for at least 6 h by incubating at room temperature inside the anaerobic chamber. (Weblink of the detailed protocol for the production of ‘in house’ Tobacco Etch Virus (TEV) protease: https://mcl1.ncifcrf.gov/waugh_pubs/64_Waugh.pdf[href=https://mcl1.ncifcrf.gov/waugh_pubs/64_Waugh.pdf]).The bound tag protein can be stripped off from the strep resin by passing 10 column volumes of buffer B.Although the strep based affinity chromatography yields high purity of target protein, ion-exchange chromatography is highly recommended to get even better purity as well as more concentrated samples.For ion-exchange chromatography, dilute the protein sample four times in buffer C so that the final NaCl concentrations are around 50 mM.Equilibrate the 1 ml Q Sepharose column with 5 ml of buffer D manually using a syringe inside the anaerobic chamber.Pass the diluted protein through a Q Sepharose column; gradually, the protein starts binding at the top of the column, and a very dark brown color ring appears on the top of the column, indicating the protein is completely bound to the column.Wash the column with 1 ml of buffer D.Wash the column with 1 ml of buffer E.Wash the column with 1 ml of buffer F.Elute CCIS protein from the column using 1 ml of buffer G.",
    "To regenerate the column, wash the Q Sepharose column with 5 ml of buffer H.The concentrated holo-CCIS protein should be transferred to an airtight glass vial as shown in Figure 3 and store at 4°C until further use. The strong reddish-brown color of the protein sample is indicative of the presence of iron-sulfur clusters and that the protein can be used in further studies using various biophysical techniques. To determine the purity of the sample, refer to Supplementary Figure 1 (A and B) of Jagilinki et al. (2020).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210915/20210915223053_6917.jpgFigure 3. Air-tight glass vial for storing iron-sulfur proteins at 4°C"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}