{
  "id": 4088,
  "origin_website": "Cell",
  "title": "Functional assays with human patient-derived enteroid monolayers to assess the human gut barrier",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Development of human EDMs in 96-well inserts\nTiming: 3–4 days\nDay 0 of the EDMs preparation\nPrepare the Human monolayer EDM media required for the differentiation of the stem cells to colon specific cells. The EDM model resembles the physiologic gut lining in which all cell types (enterocytes, goblet, Paneth enteroendocrine, and tuft cells) are proportionately represented (Sato et al., 2011[href=https://www.wicell.org#bib11], Sato et al., 2009[href=https://www.wicell.org#bib12], Sayed et al., 2020a[href=https://www.wicell.org#bib13], Miyoshi and Stappenbeck, 2013[href=https://www.wicell.org#bib9]).\nThe components of the human monolayer EDM media is mentioned in the previous section under the title “Materials and Equipment.”\nAllow media to incubate at room temperature around 20°C–22°C during the step of EDMs preparation. Since the step of EDM preparation takes 30–45 min, the EDM media can be kept at room temperature around 20°C–22°C at the start of EDM preparation.\nCritical: The human monolayer media should be fresh, constituted on the day of EDMs preparation. The media can be kept at 4°C for few days (2–3 days). Storing the media at 4°C for a longer period could affect the degree of stem cell differentiation due to the stability and efficacy of the components added to human monolayer EDM media could be affected by long-term storage.\nPrepare Matrigel solution diluted in phosphate-buffered saline (PBS) at a (1:40) ratio (around 300 μg/mL) on ice.\nCoat each transwell with 50 μL of the PBS-diluted Matrigel.\nLeave the plate at room temperature around 20°C–22°C in the hood during the period of monolayer preparation (60–90 min).\nCritical: Dilute the Matrigel in PBS without EDTA. Avoid introducing bubbles in the Matrigel PBS mixture.\nSplitting of 3D organoids into single cells\nRemove media from the organoid culture grown in 12-well plate, then add 1 mL of 0.5 μM PBS-EDTA to each well.",
    "Scrape cells/Matrigel in PBS-EDTA mixture and collect the cell suspension in a 15 mL conical tube, then centrifuge at 200 xg for 4 min to precipitate the cell pellets. No wash media is used in this step.\nRemove the supernatant above the pellets and add 300 μL of TrypLE / well to separate the cells from each other. The volume of TrypLE should be adjusted according to the numbers of wells collected\nIncubate the TrypLE suspension in a 37°C water bath for 5–15 min.\nDisrupt the organoids mechanically in the TrypLE mixture by pipetting the cells up and down up to 20 times using a p1000 micropipette to have single or small clusters of cells. Pipetting should be continued until no cell clumps/ aggreagtes are appeared.\nInactivate the TrypLE by adding a serum-containing buffer such as wash buffer at the ratio (1:5) (1 TrypLE: 5 washing media).\nCentrifuge at 200 × g for 4 min to remove the TrypLE and precipitate the dissociated cells.\nCritical: The time of TrypLE incubation depends on the density, size, and overall health of the organoids. Large and dense organoids require a longer incubation period with the TrypLE at 37°C. Inadequate incubation of organoids with the TrypLE or insufficient pipetting of the organoids could lead to incomplete dissociation of organoids into single stem cells. Alternatively, clumps of condensed cells are formed, which could affect the differentiation of the stem cells after that.\nFiltration and counting the single cells,\nPlace a 70 μm filter over a 50 mL tube. Wet the filter with 200 μL human monolayer media (prepared at step 1).",
    "Resuspend the cells in the desired volume of human monolayer media to get a good concentration of cells and to allow complete resuspension of the cell pellet to avoid loss of cells in the filter (∼200 μL per transwell).\nFilter the suspended cells using the pre-wet 70 μm filter over a 50 mL tube.\nCount the single cells or very small clusters of cells using the Trypan blue method or automated counter.\nCritical: The human monolayer media should be kept at room temperature around 20°C–22°C before the suspension of single cells.\nCritical: The volume of human monolayer media required to dissolve the single cells should be appropriate, 1 mL is a good start. If the concentration of cells is high, more media can be added till it reach the required concentration of cells.\nCritical: If the cells are more diluted in human monolayer media, the cells can be precipitated again by centrifugation at 200 × g and then dissolved in the appropriate volume.\nSeeding the single cells in the transwell (Figure 2[href=https://www.wicell.org#fig2]; Methods video S1[href=https://www.wicell.org#mmc1])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/826-Fig2.jpg\nFigure 2. Development of human EDMs in 96-well inserts\nDay 0: Coat 96-well trans-well plates with Matrigel and plate stem cells\nDay1: Media change\nDay2: Measure the TEER by REMS AutoSampler and start the experiment.\nCalculate the number of cells needed for seeding 8 ×104 cells per transwell. Prepare the appropriate mixture of cell suspension and monolayer media needed.\nCarefully aspirate the PBS from Matrigel coating in all wells without touching the tip to the bottom of the well.",
    "Add 250 μL of monolayer media to the basolateral side of the transwell. Add 100 μL of the cell suspension mix to the apical side of each well. Incubate the plate on a flat surface inside the hood for ∼15 min. Then carefully transfer to the incubator on a flat shelf.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. The Development of high-throughput functional assay platform with human patient-derived enteroid monolayer and measurement of the TEER by REMS AutoSampler, related to part 1: development of human EDMs in 96-well Inserts, steps 1–9\nAlso the video includes part 2-PC-controlled high-throughput automated TEER measurement for epithelial monolayer in 96-well plate (REMS AutoSampler), steps 18–24.\nDay 1 of the EDMs preparation (Figure 2[href=https://www.wicell.org#fig2])\nChange the media from the apical and basolateral sides of the transwells using the monolayer media.\nCheck the monolayer appearance under the microscope. After 24 h, you should see the cells start to flatten out, but all space between cells may not be filled until 48 h post-seeding.\nMeasure the transepithelial electrical resistance (TEER) using the REMS automated TEER machine (as will be discussed in detail in the next step). The TEER value after 24 h (first-time point) helps to follow the TEER kinetics of the monolayers at different time points, which indicates the monolayer's efficiency (Figure 2[href=https://www.wicell.org#fig2]).\nCritical: The human monolayer media should be kept at around 20°C–22°C before changing the media and the media should be added smoothly and slowly on the apical side of the transwells (inserts) to avoid the detachment of the differentiated cells from the transwells.\nDay 2 of the EDMs preparation (first exposure to vapor infused media)\nMeasure the TEER in the morning using the REMS automated TEER machine before applying any conditions.",
    "Expose the basolateral side of the transwells to the e-cigarette vapor-infused media for 4 h. Single exposure of the EDMs with the vapor media for 4 h represents acute exposure)(Sharma et al., 2021[href=https://www.wicell.org#bib16]). To mimic the vapor exposure to the gut, we expose the basolateral side of EDMs (which represents the gut epithelium side facing the blood), while the apical side of the EDMs represents the side of epithelium facing the internal GIT.\nCollect supernatants from the basolateral side of the transwells at 4 h of exposure to assess the level of inflammatory cytokines.\nCollect the supernatant from the apical part of the transwells, save the supernatant at –20°C until the analysis. The supernatant collected from apical and/or basolateral compartments can be used to assess the cytokine levels and other functional assays.\nCollect the RNA lysate to assess the transcriptome change upon addition of e-cigarette vapor-infused media, Add RNA lysis buffer to the cells attached to the transwells, incubate the lysis buffer with the transwell for 2–3 min, then pipette the lysis buffer up and down 10 times and then collect the cell lysate in 1,5 Eppendorf tubes for further RNA extraction.\nPause point: The cell lysate in RNA lysis buffer is kept at –80°C till the step of RNA extraction. Supernatant collected can be kept at –20°C or –80°C till analysis for cytokine assay.\nDay 3 of the EDMs preparation (chronic exposure for vapor infused media)",
    "To assess the effect of chronic exposure of EDMs to e-cigarette vapor-infused media, expose the EDMs on Day 3 of the preparation continuously to e-cigarette vapor-infused media for 4 h, and the medium is refreshed with new e-cigarette vapor-infused media for repeated exposure (3 times exposure) prior to analyzing them at 24 h (Day 4 of EDMs preparation). Measure the TEER after 24 h for exposure.\nCollect supernatants from the basolateral side of the transwells at 24 h of exposure to the vapor-infused media.to assess the level of inflammatory cytokines.\nCollect the cell lysate for RNA extraction as described in the previous step.\nPause point: The cell lysate in RNA lysis buffer is kept at –80°C till the step of RNA extraction. Supernatant collected can be kept at –20°C or –80°C till analysis.\nCritical: In 96-well plate, the RNA extracted from one well is relatively low and insufficient to assess the transcriptome analysis. Therefore, 2–3 wells from each condition should be combined to get an adequate RNA concentration for qPCR and/or sequencing analysis.\nCritical: After RNA extraction and measurement of the RNA concentration, aliquot the fresh RNA into 2 parts: 200–300 ng for RNA sequencing and 500 ng–1000 ng for transcriptome analysis by qRT-PCR. Repeated freezing and thawing for the extracted RNA should be avoided.\nNote: The EDMs used in chronic exposure experiment (Day 3) are not the same ones used for acute exposure experiment (Day 2), but they are derived from the same organoid cultures.\nPart 2: PC-controlled high-throughput automated TEER measurement for epithelial monolayer in 96-well plates (REMS AutoSampler)\nTiming: 5–60 min, depending on the numbers of wells to be measured\nPlace the plate on the REMS plate holder and ensure all 4 corners are properly placed and clipped in (Figure 2[href=https://www.wicell.org#fig2] and Methods video S1[href=https://www.wicell.org#mmc1]).",
    "Select the option “Take Data/ Well Sequence” tab in REMS software: Perform 70% Ethanol Rinse (Wash Station 1: Right) followed by Wash Media Rinse (Wash Station 2: Left).\nSelect “Stabilize” to confirm that the Recording Electrode is working correctly. Range should be within 32–45Ω and varies with different media composition.\nUsing the REMS Autosampler software, select the Plate Files Tab -> Edit Plate File. Using the Plate File Settings window, Perform calibration test of A1 Well using the WPI REMS-96C recording Electrode.\nUnder the Movement tab: Send Electrode to well A1 Position using the XY Position Axis.\nAdjust Z Low to 130 mm and ensure basal Electrode is centered (Adjust XY as needed).\nSend Z Low down 2 mm at a time to confirm basal electrode calibration (no edge-clipping and relatively centered).\nClose the Plate File Settings without saving the adjustments to prevent overwriting the original settings\nReturn to “Take Data/ Well Sequence” tab. Set the TEER Electrode Sequence:\nCheck the increment box and fill in the number 1 to start your sequence at 1.\nGo to the plate map to select the targeted wells. Set the desired sequence for TEER measurements. The Electrode is still centered overA1 well during these steps.\nIf there are multiple conditions, select “Data Collection” tab and select Rinse Between Wells.\nLabel the experiment name and select “Start” under “Take Data/ Well Sequence” tab. TEER values will be saved in a Text File.\nCritical: Calibration steps are important to ensure the electrodes will be correctly centered. Inappropriate calibration could lead to incorrect direction and movement of the Electrode, which could lead to the damage of expensive electrode.",
    "Critical: The electrode returns home (the original position) after every run, and the A1 calibration steps should be run every time the electrode returns to home. The abrupt mechanical movement made when the probe returns home can cause a slight misalignment of the XY position.\nPause point: It is recommended to coat the unused wells with plastic adhesive sheets for future use without causing contamination of these wells in the current analysis.\nPart 3: Gentamicin protection assay to assess bacterial internalization in the human EDMs\nTiming: 4 days\nDay 0: Prepare the human monolayer EDMs as in protocol #1 in 24-well transwell (inserts) (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/826-Fig3.jpg\nFigure 3. Gentamicin protection assay to assess bacterial internalization in the human EDMs\nDay 0: Plate cells in 24-well trans-well\nDay1: Media change\nDay2: Infect the EDMs with E.coli for 1–3 h then add gentamicin to kill extracellular bacteria. Lyse the cells and prepare the bacteria dilutions and plate\nDay3: Count the bacteria and replate the dilutions if needed\nFollow the same steps in the human EDMs preparation as Part 1, starting from step 1 to step 4.\nPlate 2 × 105 cells per well in 24-well corning transwell inserts.\nThe transwell inserts are coated with 130 uL of PBS-diluted Matrigel (1:40 dilution) with a dilution of 300 μg/mL.\nAdd 700 μL of monolayer media to the basolateral side of the transwell. Add 200 μL of the cell suspension mix to the apical side of each well.\nThe precautions and critical steps applied to the preparation of human EDMs in 96-well plate should also be applied in the preparation of EDMs in 24-well plate.\nDay 1:\nChange monolayer media on the apical and basolateral sides as described in protocol # 1",
    "Culture E. coli LF82 in LB broth (Sayed et al., 2020a[href=https://www.wicell.org#bib13]). We did the following steps :\nMake a day culture: inoculate one loopful of bacteria from an agar plate into 10 mL of LB in a 50 mL conical tube with a slightly loose lid to allow aeration. Incubate the culture at 37°C in an orbital shaker at 150 rpm for 6–8 h.\nMake overnight culture: Add 100 μL of the day culture to 10 mL of LB in a 15 mL conical tube. Incubate at 37°C without shaking for overnight (about 16 h) and the lid should be tightly closed to allow minimum aeration and keep the bacteria invasive.\nDay 2: Infection of EDM exposed to e-cigarettes with E.coli LF-82\nExpose the EDMs to the e-cigarette vapor-infused media and E.coli inoculum.\nExpose the basolateral side of the transwells to the e-cigarette vapor-infused media for 4 h (single exposure) or 3 times, each 4 h apart prior to analyzing them at 24 h (chronic exposure).\nMeasure the OD600 of the E.coli LF-82 bacteria using a spectrophotometer.\nSpin down the calculated concentration of bacteria for 2 min at 9391 xg. Aspirate the supernatant and resuspended the bacteria in 1 mL of wash media without antibiotics.\nInfect the monolayers with E.coli LF-82 at a multiplicity of infection (MOI) of 1:30 in wash buffer without antibiotics. Add 200 μL of the bacterial mixture to the apical side of each transwell.\nCritical: The infection media should be without antibiotics.\nKill the extracellular bacteria and lyse the cells for bacterial counting\nAfter 1–3 h of infection, add 200 μg/mL of gentamicin to kill the extracellular bacteria.",
    "After 90 min of incubation with gentamicin, remove the media from the wells used for the bacterial internalization at every time point. Add 150 μL of 1% Triton X-100 to the apical side of each transwell and incubate for 10 min in a 37° C 5% CO2 incubator.\nLyse the cells by pipetting up and down 5–7 times. Do serial dilution of the cell lysate by adding 100 μL of lysate to 900 μL of 1× PBS (10−1 dilution). Dilutions up to 10−6 should be done depending on the cells.\nCritical: Pipette the cell-lysis buffer cautiously to avoid the puncture of the membrane of the transwell.\nPlate 50 μL of 10−6, 10−5, 10−4, 10−3, 10−2, 10−1 dilutions on LB agar tri-plates. Place the tri-plates upside-down in a 37°C incubator for 16–18 h.\nCritical: For longer infection time-points, remove the 200 μg/mL gentamicin after 90 min and add 200 μL of low gentamicin (50μg/mL) to the apical side of the wells till the end of the experiment.\nDay 3: Count the colony-forming units (CFU) of bacteria\nCount the colonies from different dilutions on the next day and calculate the average total CFUs."
  ],
  "subjectAreas": [
    "Immunology",
    "Stem Cells",
    "Cell Culture",
    "Cell Biology",
    "Microbiology",
    "Organoids",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}