{
  "id": 13041,
  "origin_website": "Jove",
  "title": "Gene Expression Analyses in Human Follicles",
  "procedures": [
    "This project was approved by the Erasme Hospital Ethical Committee (Brussels, Belgium). The patient included in this protocol underwent ovarian tissue cryopreservation (OTC) for fertility preservation before chemotherapy exposure in 2000. The patient signed informed written consent to donate her residual frozen tissue to research at the end of the storage period.\n1. Thawing of cryopreserved ovarian tissue\nPrepare a 6-well plate containing five thawing solutions. The first well contains 5 mL of cryoprotectant solution composed of Leibovitz-15 medium, 0.1 mol/L sucrose, 1.5 mol/L dimethyl sulfoxide (DMSO), and 1% human serum albumin (HSA). The next wells contain 5 mL of Leibovitz-15 medium with decreasing concentrations of cryoprotectant: 1 mol/L, 0.5 mol/L, and 2 x 0 mol/L DMSO.\n\tNOTE: The cryoprotectant solution can differ according to the protocol used in the fertility clinic.\nRemove a vial containing an ovarian cortical fragment from liquid nitrogen in compliance with safety rules (cryogenic gloves, protective glasses, and closed shoes), and keep the tube at room temperature (RT) for 30 s.\nSoak the vial in double-distilled water for 2 min at RT with gentle agitation before opening the vial under a vertical hood and directly transferring it into the first well of the 6-well plate (on ice).\nTransfer the fragment successively into each well of the 6-well plate, with each containing decreasing concentrations of cryoprotectant in 5 mL of Leibovitz-15 medium. Gently agitate the tissue in each medium for 5 min (on ice).\n2. Follicle isolation\nNOTE: All experiments are conducted using RNase-free materials and under a vertical hood.",
    "Transfer the thawed tissue into a 2 mm gridded Petri dish filled with 10 mL of dissection medium (Leibovitz-15 medium, sodium pyruvate [2 mmol/L], L-glutamine [2 mmol/L], HSA [0.3%], penicillin G [30 µg/mL], and streptomycin [50 µg/mL]). Adjust the size of the tissue with a scalpel if necessary.\n\tNOTE: Depending on the clinical protocol, the size of the frozen tissue can vary from 8 mm x 4 mm x 1 mm to 4 mm x 2 mm x 1 mm. For this protocol, two strips of 4 mm x 2 mm x 1 mm were used.\nPile up the three pieces of the tissue slicer, put the fragment between the two blocks, and cut the fragment in half using a blade, sliding through the blocks to obtain two fragments of 0.5 mm thickness.\nUse the tissue chopper to cut the fragment and obtain smaller pieces. If necessary, cut the remaining pieces manually with a scalpel until the tissue is totally shattered.\nTransfer the fragmented tissue into a gridded Petri dish filled with 7 mL of digestion medium (culture medium [McCoy's 5A medium, 3 mmol/L glutamine, 0.1% HSA, 30 µg/mL penicillin G, 50 µg/mL streptomycin, 2.5 µg/mL transferrin, 4 ng/mL selenium, and 50 µg/mL ascorbic acid] supplemented with 0.2 % collagenase and 0.02% DNase).\nPut the dish in the incubator at 5% CO2 and 37 °C. Every 10 min, take the Petri dish out of the incubator, and flush the tissue by pipetting up and down with a 1 mL pipette.\nAfter 45 min of incubation in the digestion medium, place the dish under a stereomicroscope with a magnification range of 5x-6.3x, and retrieve the follicles using a microcapillary pipette. Select the follicles of interest, and isolate them by sucking them up with a mouth pipette.",
    "NOTE: Mouth pipetting should be performed carefully to avoid the loss of material into the pipe and contamination.\nIf the follicles remain stuck in a piece of cortex, isolate them mechanically with two 27 G syringes by ripping the cortex off with the tip of the syringes to release follicles from the stroma.\n\tNOTE: Do not touch the follicles with the syringes to avoid damaging them.\nTransfer the follicles with the microcapillary in a 4-well plate containing drops of 15 µL of the calibrated culture medium covered by 500 µL of oil culture (1 to 10 follicles per drop). This step maintains the follicle viability during the collection process. At the end of the procedure, rinse the follicles twice for 5 s each time into two drops of 15 µL of phosphate-buffered saline solution (PBS) covered by 500 µL of oil culture (on ice).\nCollect 20 follicles with a minimal quantity of PBS using the mouth pipette (maximum 10 µL) in an empty tube, and keep the tube on ice.\n\tNOTE: For RNA stability, it is crucial to perform step 2.8 and step 2.9 on ice. Around 20 follicles (<75 µm) are needed to have enough RNA for standard RT-qPCR (SYBR Green).\nAfter a maximum of 90 min of incubation in the digestion medium, stop the enzymatic reaction by adding into the Petri dish an excess of cold (4 °C) blocking solution (7.5 mL) composed of culture medium supplemented with 10% fetal bovine serum (FBS).\n\t​NOTE: The blocking solution can be added as soon as the experimenter observes follicles sticking on the plate or damaged follicles (asymmetric shape or darker-colored follicles). It is advised to perform follicle isolation within a maximum period of 2.5 h to avoid follicular damage and to perform RNA extraction immediately after isolation.\n3. RNA extraction",
    "NOTE: RNA extraction is performed following the instructions provided with an RNA extraction kit by adapting the elution volumes.\nSuspend the isolated follicles by adding 100 µL of the lysis solution provided with the RNA extraction kit to the tube containing the follicles under a chemical hood, and vortex at a high speed (2,500 rpm/min) to break the structure of the follicles. Add 50 µL of ethanol (100%) to the tube, and briefly vortex at a high speed.\n\tNOTE: As the lysis buffer contains 2-mercaptoethanol and thiocyanic acid, this step must be performed with caution under a chemical hood.\nTransfer the total volume of the tube (approximately 160 µL) to a microfilter cartridge assembly comprising a column and a collection tube, and centrifuge it for 10 s at 16,363 x g at 4 °C. Wash the column with 180 µL of wash solution 1, provided with the kit, and centrifuge the tube for 10 s at 16,363 x g at 4 °C.\nAdd 180 µL of wash solution 2/3, provided with the kit, to the column, and centrifuge for 10 s at 16,363 x g at 4 °C. Perform this step twice. Centrifuge the tube one last time for 1 min to dry the filter, and place a new collection tube under the cartridge.\nPerform the elution of the nucleic acids in two steps:\n\t\nFirst, add 8 µL of warm elution solution (75 °C) to the filter, wait for 1 min at RT, and centrifuge for 30 s at 16,363 x g at 4 °C.\nRepeat this step with 7 µL of elution solution.\n\t\tNOTE: The tube containing the eluted nucleic acids must be kept on ice. To avoid DNA contamination, a supplemental step of DNA degradation is highly recommended-step 3.5.",
    "Incubate the tube with 2 IU DNase and 1x DNase buffer for 20 min at 37 °C. Block the enzymatic activity with 1/10 DNase inactivation reagent for 2 min at RT.\nCentrifuge the tube for 1.5 min at 16,363 x g at 4 °C. Finally, collect the suspension containing the RNA, and transfer it to a new tube.\nAssess the quantity of RNA present in the sample by using a spectrophotometer (NanoDrop 2000 software > Nucleic Acid > RNA). Use 1 µL of elution solution as a blank, and measure the RNA quantity extracted from isolated follicles with 1 µL of solution.\nCheck the 260/280 ratio for RNA purity (around 2.0). Store the sample at −80 °C, or directly retrotranscribe it to perform RT-qPCR.\n\tNOTE: To assess the RNA integrity, the sample can be processed with a high-resolution automated electrophoresis system before or after freezing at −80 °C. In this work, following retrotranscription, RT-qPCR was performed with the following cycle:\n\tHold stage with 20 s at 50 °C and 10 min at 95 °C\n\t40 PCR cycles with 15 s at 95 °C and 1 min at 60 °C\n\tMelt curve stage with 15 s at 95 °C, 1 min at 60 °C, 30 s at 95 °C, and 15 s at 60 °C\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}