{
  "id": 5986,
  "origin_website": "Bio",
  "title": "Quantification of Bacterial Attachment to Tissue Sections",
  "procedures": [
    "The procedure outline is described in Figure 1.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180226/20180226200624_8260.jpg Figure 1. Protocol outline. General outline of the protocol describing the three main stages of the assay. The left panel shows preparation of fluorescent protein expressing E. coli. The middle panel outlines the tissue adhesion test and the right panel shows an output of analysis of data acquired during imaging.    Preparation of competent bacteria   Grow E. coli strain of interest in 5 ml of sterile LB medium (see Recipes) in a 50 ml tube, overnight (12-18 h) at 220 rpm shaking at 37 °C.   Inoculate 500 μl of the overnight starter culture into 50 ml of preheated LB (37 °C) and grow for two hours, at 220 rpm shaking at 37 °C until OD600 of 0.3 to 0.4.   Centrifuge at 4 °C, 3,220 x g for 10 min.    Discard supernatant, keep pellet on ice for 10 min.   Suspend pellet in 20 ml of 0.1 M cold CaCl2.   Leave for 25 min on ice.   Centrifuge again as indicated in Step A3, discard supernatant and suspend pellet in 2 ml of 0.1 M CaCl2 + 15% glycerol.  Note: Glycerol should be autoclaved and the CaCl2 solution should be filtered prior to use.   Incubate on ice for 90 min.      Bacterial transformation   Take 100 μl of competent bacteria into a 1.5 ml tube and add 30 ng of the plasmid of choice encoding for–either GFP (Hansen et al., 2001) or mCherry (Sason et al., 2009).   Incubate for 20 min on ice.   Transfer tubes to a thermoblock heated to 42 °C for 90 sec.   Move tubes to ice for 5 min.   Add 1 ml sterile LB and shake for 1 h at 37 °C, 220 rpm.   Centrifuge at 4,830 x g for 5 min.",
    "Resuspend pellet in 150 μl of fresh LB and seed on an LB agar plate supplemented with appropriate antibiotic for selection, according to resistance encoded on the plasmid of choice (here ampicillin and erythromycin, see Recipes).   Incubate plate overnight at 37 °C.   The next day–pick a single colony, grow in 5 ml LB (supplemented with appropriate antibiotics, see Recipes section) overnight (12-18 h) at 220 rpm shaking at 37 °C. Note: In order to avoid loss of fluorescent signal, it is strongly recommended that bacteria expressing fluorescent proteins should be protected from light at all times.   Bring bacterial culture to OD600 of 1 (dilute in sterile 1x PBS).      Tissue binding assay This assay uses 4 μm thick paraffin embedded section of tissues fixated in PFA, mounted on glass slides (see Materials and Reagents).   Fill three staining jars with these three solutions and perform deparaffinization as described (Figure 2A):   Xylene–5 min, 5 min, 2 min.   Ethanol 100%–5 min, 5 min, 2 min.   Ethanol 96%–3 min, 2 min, 2 min.   Note: Deparaffinization is done in a chemical hood.   Cover sections with blocking solution (see Recipes) and incubate at room temperature for 6 h.   Suspend 50 μl of bacteria at OD600 = 1 in 950 μl blocking solution, after discarding blocking solution, lay the bacterial suspension gently on slide.    Incubate overnight at 4 °C in a wet chamber (line chamber with wet tissues), protected from light.   Next day washing:   Prepare 2 staining jars filled with 1x PBS and another staining jar containing PBS with 0.05% Tween 20 (PBST, Figure 2B).   Wash twice with PBS for 5 min per wash. Transfer the slides to PBST and wash for 10 min (Figure 2B).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180226/20180226210517_0643.jpg Figure 2. Washing/deparaffinization illustration.",
    "Prepare three washing jars filled with the solution indicated on the jar in the illustration and keep the slides in the jar for the indicated amount of time. Figure 2A illustrates the first round of slide deparaffinization in preparation for the binding assay. Figure 2B illustrates washing after overnight incubation to wash off unbound bacteria, dark purple jar contains PBS supplemented with tween (PBST).    Dilute Hoechst 33258 1:5,000 in 1x PBS at approximately 200 μl per slide, apply and incubate for 20 min at room temperature. Protect from light.   Apply mounting medium to slide and cover with a coverslip.   Imagining can be done under a fluorescence microscope using a 60x magnification. Note: Scan at least four fields per slide."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}