{
  "id": 18677,
  "origin_website": "Jove",
  "title": "Activated Cross-linked Agarose for the Rapid Development of Affinity Chromatography Resins - Antibody Capture as a Case Study",
  "procedures": [
    "1. Cultivate the Transgenic Tobacco Plants\nNOTE: The design of the DFE fusion protein and the generation of transgenic plants are described elsewhere5,17.\nGerminate the transgenic tobacco seedlings in soil. Irrigate the plants with a 1.0 g·L-1 fertilizer solution. Transfer the plants to single, 100 mm x 100 mm x 60 mm (length, width, height) pots when they grow to a diameter of ~0.04 m.\nCultivate the transgenic tobacco plants in a greenhouse with a 16-h photoperiod (25/22 °C light/dark temperature regime), with 70% relative humidity and automated fertilization with a 1.0 g·L-1 fertilizer solution for 15 min every hour.\nAfter 7 weeks, harvest all leaves except the four cotyledon leaves at the base of the plant stem. Immediately process the harvested leaves as described below.\n2. Heat Precipitation of Host Cell Proteins\nSet up a water bath with a 20 L working volume in a stainless-steel heated vessel (0.3 m x 0.3 m x 0.3 m). At the start, place a magnetic pump in the water bath to agitate the liquid permanently with a flow of 5 L min-1. Mount an adjustable thermostat on the water bath for temperature control (steps 2.4 and 2.8).\nCAUTION: All the following steps up to 2.10 involve the handling of hot liquid. Wear appropriate personal protective equipment including thermally insulated gloves and goggles.\nAdd 15 L of deionized water to the water bath and heat the liquid to 70 °C.\nPlace a 10 L bucket filled with 5 L of deionized water on a magnetic stirrer. Add sodium phosphate to a final concentration of 120 mM. Adjust the pH to 8.14 using 10 M hydrochloric acid. When all the components have dissolved, add the resulting concentrated blanching buffer (5 L) to the water bath from step 2.2.",
    "Agitate the water bath until the temperature reaches 70 °C. Use 10 M hydrochloric acid to adjust the pH to 8.14 if necessary. Continue agitating for at least 15 min after the required temperature and pH are reached to ensure that the entire assembly is in thermal equilibrium.\nPrepare a 20 L bucket (0.3 m x 0.3 m x 0.3 m) filled with deionized water at a temperature of ~17 °C (required for step 2.9).\nPrepare 400 g aliquots of the harvested tobacco leaves from step 1.3. Place one aliquot in a perforated basket (0.2 m x 0.2 m x 0.2 m; pore width at least 0.02 m x 0.02 m). Avoid overfilling the basket with plant material or packing the leaves too tightly to avoid damaging the tissue.\nFully submerge the basket in the hot blanching buffer from step 2.4 and make sure all leaves remain under the liquid surface. Use a thermostable silicone spoon to hold the leaves under the surface if necessary.\nIncubate the tobacco leaves for 1.5 min in the blanching fluid while the pump is still agitating the liquid. Monitor the liquid temperature during the entire incubation period. Avoid blocking the pump inlet with tobacco leaves.\nRemove the basket of tobacco leaves from the blanching buffer and drain residual buffer from the leaves for 30 s. Transfer the basket to the bucket filled with cold water (from step 2.5) and immerse the leaves for 30 s. Remove the basket and drain residual water from the leaves for 30 s before homogenization (step 3).\nRepeat steps 2.6 to 2.9 with fresh aliquots from 2.6 until the entire harvested biomass is processed. Constantly monitor and adjust the pH and the temperature of the blanching buffer in the water bath.",
    "NOTE: Blanched plant material can be stored on ice for up to 30 min when several blanching cycles are required to process the entire biomass. Blanched leaves can also be stored in vacuum-sealed bags at –80 °C for at least 3 weeks. However, immediate processing is recommended because prolonged storage can reduce the DFE yield.\n3. Protein Extraction and Clarification\nCAUTION: The following steps involve a blender with rotating blades. Do not work in the blender vessel when powered or mounted on the motor unit.\nPlace 150 g (wet mass) of blanched tobacco leaves (step 2.9) in the blender vessel and add 450 mL of extraction buffer (50 mM sodium phosphate, 500 mM sodium chloride, 10 mM sodium disulfite, pH 7.5). Close the blender cap tightly to prevent the spilling of plant material or buffer.\nHomogenize the leaves for 3x for 30 s, with 30 s breaks between each pulse. Ensure that all leaves are homogenized and that none stick to the top of the blender vessel. If necessary, open the blender during the breaks and push down leaves that stick at the upper part of the vessel, using a clean silicone spoon.\nAfter homogenization, take a 1.0 mL sample of the homogenate for subsequent analysis (step 7).\nCollect the homogenate in a vessel of adequate size (e.g. if working with a total biomass of 1.0 kg, use a vessel with a capacity of at least a 5 L). Repeat steps 3.1 to 3.3 until all of the blanched biomass is homogenized.",
    "Mount a bag filter into a filter mount and place another adequately sized vessel (see 3.4) beneath the assembly. Apply the homogenate to the bag filter at a rate of ~0.15 L min-1. Take samples of the bag filtrate after each liter for subsequent analysis (step 7) and measure the turbidity of the bag filtrate pool as a 1:10 dilution in extraction buffer using a turbidimeter or similar device.\nFurther clarify the bag filtrate pool using 0.02 m2 of a K700 (top) and KS50 (bottom) depth filter layer combination per liter of bag filtrate pool. Apply a flow rate of 3.0 L min-1·m-2 up to a maximum pressure of 0.2 MPa. Then remove residual particles by passing the clarified filtrate through a 0.2 µm sterile filter as previously described5.\n4. Purification of the DFE Affinity Ligand\nPrepare a fast protein liquid chromatography system by flushing with elution buffer (10 mM sodium phosphate, 300 mM imidazole, pH 7.4), wash buffer (10 mM sodium phosphate, pH 7.4) and equilibration buffer (20 mM sodium phosphate, 500 mM sodium chloride, pH 7.4). Mount a column containing ~50 mL of chelating cross-linked agarose resin per kilogram of leaf biomass (~2.5 L depth filtrate).\nCharge the column with nickel ions by applying 5 column volumes (CV) of 200 mM nickel sulfate solution and wash it with 5 CV of elution buffer. Use a flow rate of 50 cm h-1 and monitor the UV signals at 260, 280 and 558 nm for all subsequent chromatography steps.\nEquilibrate the column with 10 CV of equilibration buffer. Then load 50 CV of the clarified plant extract (from step 3.6) onto the conditioned column.",
    "Wash the column with 10 CV of wash buffer. Elute the DFE fusion protein with 5 CV elution buffer and collect the product-containing fraction once the UV signals at 280 nm and 558 nm have increased to more than 5 mAU above the baseline.\nTake a 0.2 mL sample from the elution fraction in order to measure the total soluble protein (TSP) concentration (step 7.1), DFE concentration (steps 7.2 and 7.3), and DFE purity (step 7.4).\nMount a column containing ~50 mL of cross-linked dextran resin on a chromatography system. Equilibrate the column with 5 CV of coupling buffer (200 mM HEPES, 500 mM sodium chloride, pH 8.5). Inject 10 mL of the DFE elution fraction (step 4.4) for buffer exchange and monitor the UV absorbance at 280 and 558 nm.\nCollect the DFE-containing fraction once the UV signals at 280 nm and 558 nm have increased to more than 5 mAU above the baseline. Take a 0.2 mL sample and determine the TSP concentration, DFE concentration, and DFE purity (step 7).\nConcentrate the purified DFE sample (from step 4.7) to 15 g L-1 using a centrifugal concentrator tube at 3,000 x g at 4 °C for 30 min in a centrifuge. Continue with the coupling reaction (step 5).\nNOTE: Store the DFE solution at 4 °C if the concentration or coupling steps cannot be carried out immediately.\n5. Coupling DFE to the Activated Cross-linked Agarose Resin\nNOTE: Do not replace the isopropanol used for the storage of NHS-activated columns until all equipment and solutions for coupling are ready. Never let the columns run dry.\nSetup a design of experiments (DoE) model to optimize the coupling of DFE to the activated resin, with pH, buffer composition and DFE concentration as factors. The details of the DoE method are described elsewhere15.",
    "Prepare the affinity ligand solution (from step 4.8) in a concentration range from 0.5–15 g·L-1 or as defined in the DoE and store it on ice until the coupling reaction is ready (step 5.5). Fill at least ten 2 mL syringes with the DFE solution and prepare an adapter to mount the syringes on NHS-activated cross-linked agarose columns with a bed volume of 1.0 mL.\nFor every 10 columns used for coupling, prepare 30 mL of deactivation solution (0.5 M ethanolamine, 0.5 M sodium chloride, pH 8.3), 30 mL of low-pH solution (0.1 M sodium acetate, 0.5 M sodium chloride, pH 4.0) and 10 mL of storage solution (0.05 M disodium phosphate, 0.1% (m/v) sodium azide, pH 7.0).\nPrepare 20 mL of 1 mM hydrochloric acid in a tube and incubate it on ice for at least 20 min. Prepare a precision scale to monitor the flow-through fractions for all steps during the coupling reaction (step 5.7).\nOpen a sealed NHS-activated cross-linked agarose column and mount the syringe adapter at the column inlet. Prevent any air entering the column by applying a drop of buffer onto the adapter inlet before connecting it to the syringe.\nWash the column with 6 mL of ice-cold 1 mM hydrochloric acid (from step 5.4) at a flow rate of <1 mL min-1 and immediately proceed to step 5.7.\nInject 1.5 mL of DFE solution (step 5.2) using a 2 mL syringe at a flow rate of <1 mL min-1 and collect the flow-through fraction on a precision scale (step 5.4) for subsequent analysis (step 7). Seal the column at both ends and incubate for 15–45 min at 22 °C, depending on the DoE setup.",
    "Inject 6 mL of deactivation solution followed by 6 mL of low-pH solution at a flow rate of <1 mL min-1 to remove non-covalently bound ligands from the resin. Then inject 6 mL of deactivation solution and incubate the column for 15 min.\nInject 6 mL of low-pH solution into the column, followed by 6 mL of deactivation solution. Then inject another 6 mL of low-pH solution into the column.\nInject 2 mL of storage solution into the column and store at 4 °C.\n6. Testing the Purification of mAbs from Clarified Plants Extracts\nPrepare 100 mL of clarified plant extract containing 2F55 or the supernatant from the preferred cell-based expression system, also containing 2F5.\nPrepare equilibration buffer (20 mM sodium phosphate, 500 mM sodium chloride, pH 7.4), low-pH elution buffer (0.05 M citrate, 0.05 M sodium chloride, pH 4.0–3.25), and high-ionic-strength elution buffer (1.0–4.0 M magnesium chloride, 0.1 M HEPES, pH 8.0)\nFlush the chromatography system with the buffers. Mount a DFE affinity column (from step 5.10) on the chromatography system and equilibrate with 5 CV of equilibration buffer at a flow rate of 1.0 mL min-1. Monitor the UV absorbance at 280 nm.\nNOTE: Loading plant extract or cell culture supernatant onto the column can cause an increase in backpressure. Set a high-pressure alert at 0.2 MPa to avoid damage to the chromatography system or DFE column.\nLoad 80 mL of the clarified plant extract or supernatant (step 6.1) onto the column at a flow rate of 0.5 mL min-1 to guarantee a contact time of 2 min. Collect the flow-through samples in 2 mL fractions for breakthrough curve reconstruction (step 7.3). Store the flow-through samples at 4 °C if immediate sample analysis is not possible.",
    "Wash the column with 6 CV of equilibration buffer. Collect a sample of the wash at the beginning, middle and end of this step.\nElute mAb 2F5 with 5 CV of low-pH elution buffer or high-ionic-strength elution buffer (0.1 M HEPES, 1.25 M magnesium chloride, pH 8.0). Collect the DFE fraction when the UV 280 nm signal has increased to 5 mAU above the baseline.\nOptimize the elution buffer for each epitope–antibody pair. For 2F5, 1.25 M magnesium chloride achieved an optimal balance between product recovery and ligand stability.\nNOTE: The magnesium chloride solution is prone to precipitation. Therefore, dissolve the magnesium chloride in ~700 mL of water. Separately dissolve the HEPES in 100 mL of water and adjust the pH to 8.0. Add the dissolved magnesium chloride solution to the HEPES solution and add water to a final volume of 1.0 L. Do not adjust the pH after dissolving the magnesium chloride because this will cause precipitation.\nAnalyze all samples taken during steps 6.4–6.6 using the Bradford method, lithium dodecylsulfate polyacrylamide gel electrophoresis (LDS-PAGE) and surface plasmon resonance (SPR) spectroscopy (step 7).\n7. Sample Analysis\nMeasure the TSP concentration using the Bradford method18,19.\nIn triplicate, pipette 2.5 µL of each sample into a single well of a 96-well plate. Use eight bovine serum albumin (BSA) standards in triplicate covering the range 0–2,000 mg·L-1.\nAdd 200 µL of Bradford reagent to each well and mix by gently pipetting up and down. Keep the pipette level to avoid the formation of bubbles that distort the subsequent readout.\nIncubate the plate for 10 min at 22 °C and measure the absorbance at 595 nm in a spectrophotometer. Calculate the TSP concentration in the samples based on a standard curve through the BSA reference points.\nQuantify DFE by fluorimetry",
    "In triplicate, pipette 50 µL of each sample into single wells of a black 96-well half-area plate. Include six DsRed standards covering the range 0–225 mg·L-1.\nMeasure the fluorescence twice using a 530 ± 30 nm excitation filter and a 590 ± 35 nm emission filter in a spectrophotometer. Calculate the DFE concentration in the samples based on a standard curve through the DsRed reference points.\nMeasure the 2F5 concentration by SPR spectroscopy20.\nPrepare the HBS-EP running buffer (10 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES), 3 mM ethylenediaminetetraacetic acid (EDTA), 150 mM sodium chloride, 0.005% v/v Tween-20, pH 7.4) and filter sterilize it by passing it through a 0.2 µm vacuum bottle-top filter. Degas the buffer for 15 min.\nConnect the HBS-EP running buffer to the SPR instrument before docking a carboxymethylated dextran surface chip and equilibrate the system using the prime function. Start a manual run with a flow rate of 30 μL min-1 and condition the chip surface by alternately injecting 30 mM hydrochloric acid and 25 mM sodium hydroxide (two injections each) over flow cells 1 and 2 at a flow rate of 30 μL min-1 for 1 min.\nPrepare 300 µL of a 500 mg·L-1 Protein A solution in 10 mM sodium acetate (pH 4.0). Thaw vials containing 0.4 M 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide hydrochloride (EDC) and 0.1 M NHS and centrifuge at 16,000 x g for 1 min before mixing 70 μL of EDC and 70 μL of NHS.\nTransfer the EDC/NHS mixture and the Protein A solution to 7 mm plastic sample vials and place in the sample rack. Activate the carboxymethylated dextran chip surface by injecting the EDC/NHS mixture over flow cells 1 and 2 at a flow rate of 10 μL min-1 for 10 min.",
    "Couple Protein A to the activated carboxymethylated dextran surface by injecting the Protein A solution over flow cell 2 at a flow rate of 15 μL min-1 for 15 min.\nWhile coupling the Protein A, thaw a vial of 1.0 M ethanolamine hydrochloride (pH 8.5) and centrifuge at 16,000 x g for 1 min. Transfer 150 µL to a 7-mm plastic vial and place into the instrument. When step 7.3.5 is complete, deactivate the chip surface by injecting the ethanolamine solution over flow cells 1 and 2 at a flow rate of 10 μL min-1 for 7 min.\nCondition the chip surface by alternately injecting 30 mM hydrochloric acid and 25 mM sodium hydroxide (two injections each) over flow cells 1 and 2 at a flow rate of 30 μL min-1 for 0.5 min.\nPrepare standards of antibody 2F5 in HBS-EP running buffer at a concentration of 500 µg·L-1 and dilute samples containing 2F5 in HBS-EP to a final concentration in the range 20–1,000 µg·L-1. Inject samples and standards over flow cells 1 and 2 at a flow rate of 30 μL min-1 for 3 min. Inject a 2F5 standard after every 15 samples.\nSubtract the relative units (RU) signal of flow cell 1 (reference cell) from the signal of flow cell 2 (measurement cell) for each sample and calculate the antibody concentration based on the RU signal of 2F5 standard injections.\nAfter every sample or standard injection, regenerate the chip surface by injecting 30 mM hydrochloric acid at a flow rate of 30 μL min-1 for 0.5 min over flow cells 1 and 2.",
    "Plot the 2F5 concentration for each flow-through sample from step 6.4 against the flow through volume to obtain the 2F5 breakthrough curve. Calculate the amount of injected 2F5 when 10% of the loading 2F5 concentration was reached to obtain the 10% dynamic binding capacity (DBC).\nAnalyze protein samples by LDS-PAGE.\nOpen a ready-to-use 4–12% BisTris LDS polyacrylamide gel and place it in an electrophoresis module. Transfer 800 mL of running buffer (50 mM MES, 50 mM Tris base, 0.1% (m/v) SDS, 1 mM EDTA, pH 7.3) into the module and add 0.5 mL of antioxidant solution.\nIn a 1.5 mL reaction tube, mix 10 µL of loading buffer with 4 µL of reducing agent and 26 µL of the protein sample. Incubate the tube in a heat block for 10 min at 80 °C. Centrifuge the tube at 500 x g for 30 s.\nLoad the LDS polyacrylamide gel (10 µL of sample per lane) and load 5 µL of pre-stained protein standard (10–180 kDa) in a separate lane.\nClose the electrophoresis chamber and connect the power supply. The electrophoresis should run for 40 min and at constant 200 V.\nRemove the gel from the electrophoresis chamber. Open the gel sheathing and wash the gel for 15 min in water on a shaker at 19 rpm. Stain the gel for 1 h in staining solution on a shaker at 19 rpm.\nDestain the gel for 1 h in water on a shaker at 19 rpm. Scan the gel using a film scanner."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}