{
  "id": 6388,
  "origin_website": "Bio",
  "title": "Induction and Analysis of Anti-CD40-induced Colitis in Mice",
  "procedures": [
    "Induction of colitis in Rag2-/- miceDilute the anti-CD40 antibody or isotype control to 1 mg/ml in sterile 1x PBS.Inject 100 μg of anti-CD40 or isotype control antibody intraperitoneal (i.p.) or 50 μg intravenous injection (i.v.)–based on researcher’s technical expertise–with a 1 ml sterile sub-Q syringe 26 G. Each batch of anti-CD40 antibody should be verified to be endotoxin-free (by checking with the manufacturer) to avoid systemic immune activation. Notes:Every animal facility will have a specific microbial environment, so it is crucial to determine the dose of anti-CD40 empirically by performing an initial dose-titration (25-100 μg) (Figure 2).  A dose that is too high will result in death of the animals while an insufficient dose will lead to weak disease induction (characterized by inconsistent or poor colon inflammation) and variability in colitis development.  Mice are weighed every day for seven consecutive days and % weight loss is calculated in comparison to the initial weight on Day 0. Mice that lose more than 20% of initial body weight or demonstrate shaking or severe systemic responses are euthanized within 24 h. Weight loss kinetics of colitis may vary between i.p. and i.v. injection type. In our hands, mice recover weight more quickly after i.p. delivery. However, the route of injection does not alter the timing or severity of colitis development. At Days 2-7 post induction, euthanize mice by carbon dioxide asphyxiation according to the approved ethical protocol.Collect serum via cardiac puncture for the detection of systemic cytokines levels.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190128/20190128192240_1145.jpgFigure 2. Titration of the anti-CD40 antibody. Rag2-/- mice received a single dose of anti-CD40 antibody i.v. as indicated. Percentage of initial weight over a 7 days period. Initial weight is measured right before injection of anti-CD40 antibody.",
    "Isolation and preparation of colon tissue/cells for endpoint analysisHistopathological analysis by H&E stainingHarvest colons and remove fecal content by gently dislodging from colon with forceps. Roll colon into a tissue embedding cassette with proximal end in the center and fix in 10% neutral buffered formalin overnight (the cassette needs to be submerged).Transfer the cassettes to 70% ethanol, embed in paraffin, section at 4-5 μm and then stain with hematoxylin for 10 min and eosin as previously described (Wang et al., 2017).Wash with running water until the water is clear.Transfer the slides to the Eosin solution and incubate for 3 min.Successively transfer the slides into 70% ethanol for 20 s, 90% ethanol for 20 s, 100% ethanol for 1 min and xylene for 3 min.Take out slides from xylene and dry them out in a fume hood.Mount and cover the slides.Gene expression profiling of the proximal colonAt the desired time point after induction of colitis, mice are euthanized by carbon dioxide asphyxiation according to approved ethical protocol.Note: For analysis of genes encoding cytokines produced by the innate immune cells, we recommend euthanizing mice on Days 1 to 3 post induction. For analysis of genes expressed by epithelial cells in response to inflammation, we recommend euthanizing the mice on Day 7 post induction when the disease is maximal. Harvest a piece of proximal colon (about 0.5 cm long), remove the fecal content by gently dislodging it from colon with forceps, transfer into a sterile polypropylene tube and snap freeze in liquid nitrogen (Figure 3B). Since inflammatory infiltrate can be variable, it is important to cut a vertical section of the colon starting from the base of the cecum and descending into the proximal colon to ensure consistent molecular signature.",
    "Note: To avoid RNA degradation, samples must be snap frozen in liquid nitrogen within 2 min post euthanasia. Frozen proximal colons can be stored at -80 °C for at least 6 months. Extract RNA and run RT-PCR protocols as described in Bauche et al., 2018.Isolation of proximal colon lamina propria cells, ex-vivo stimulation and flow cytometryIsolation of proximal colon lamina propria cellsAt 2-7 days post induction, mice are killed by carbon dioxide asphyxiation according to approved ethical protocol.Harvest and collect the proximal colon in a 15 ml Falcon tube filled with 5 ml of 1x HBSS. Remove the fat (Figure 3A).Transfer the colon into a Petri dish.Cut colon open lengthwise and wash by submerging and gently shaking in 50 ml of 1x HBSS until the tissue is clear of fecal matter. Cut into 0.5 cm segments. Place into a 50 ml Falcon tube with 20 ml of epithelial cell dissociation solution. Wrap in parafilm, place sideways in a water bath at 37 °C for 20 min with medium shaking.Vortex well for 15 s.Filter through a 70 μm strainer, collect and transfer the undigested piece of colon tissues in a new 50 ml Falcon tube. Rinse fragments with 20 ml 1x HBSS by gently vortexing for 10 s.Transfer colon fragments into a petri dish and chop into tiny pieces with a scalpel.Using a 25 ml Serological pipettes, transfer into a new 50 ml tube with 10 ml of enzyme digestion mix then incubate for 20 min in a water bath at 37 °C with shaking as above.Vortex for 15 s.Collect sup by filtering through a 70 μm cell strainer and put on ice. Pellet cells for 5 min at 375 x g, 4 °C.Prepare 100% Percoll solution (9 parts Percoll + 1 part 10x PBS).",
    "Prepare 40% and 80% Percoll solutions by diluting 100% Percoll with 1x PBS.In a 15 ml tube resuspend the pellet in 5 ml of 40% Percoll, using a 5 ml Serological pipettes, and underlay with 5 ml of 80% Percoll for each colon.Spin 670 x g for 20 min at 20 °C with no acceleration and no brake.Collect interface (white ring) between and the two layers of percoll into a 15 ml tube, wash with 10 ml of complete IMDM media and spin for 5 min at 375 x g, 4 °C. Resuspend in 1 ml of complete IMDM and cells are ready to go.Note: The interface is characterized by a white ring and contained mainly colon lamina propria immune cells. Cell number and viability should be measured at this step. Ex-vivo stimulation For cytokines analysis, stimulate 2 x 106 viable cells/well in a 96-well plate for 4 h at 37 °C, 5% CO2 with 50 ng/ml PMA, 500 ng/ml Ionomycin and Brefeldin A (1/1,000) in 200 μl of complete IMDM.Spin for 5 min at 375 x g, 4 °C and proceed to flow cytometry staining.Flow cytometry stainingIncubate cells in 100 μl of 1x PBS with 0.3 μl of live/dead fixable dead cell stains and 5 μl of mouse BD Fc block per well for 25 min at 4 °C in the dark.Wash with 100 μl of 1x PBS per well and spin for 5 min at 375 x g.For surface staining: Incubate cell suspension with 0.2 μg of anti-mouse conjugated antibodies (i.e., CD45, CD3, CD4) in 100 μl of BD stain buffer per well for 25 min at 4 °C in the dark.Wash with 100 μl of BD stain buffer and spin for 5 min at 375 x g.",
    "For intracellular staining: Resuspend cell suspension in 100 μl of 1x Fix/perm buffer (BD) and incubate for 45 min at 4 °C in the dark.Wash with 1x Perm/Wash buffer and spin for 5 min at 375 x g.Incubate cell suspension with 0.2 μg of anti-mouse conjugated antibodies (i.e., RORγt, IL-22) in 100 μl of 1x Perm/Wash buffer per well for 45 min at 4 °C in the dark.Wash with 1x Perm/Wash buffer and spin for 5 min at 375 x g. Resuspend cells in 300 μl of 1x Perm/Wash buffer. Analyze and acquire data using a flow cytometer (we used LSRII flow cytometer from BD and analyzed data on FlowJo). Samples can be stored overnight at 4 °C in the dark.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190128/20190128192315_5155.jpgFigure 3. Preparation of colon tissue. A. Attached fat tissue (here shown by arrows) must be removed from the colon as fat can decrease the viability of isolated colon lamina propria. B. Taqman Sampling: The colon is separated from the cecum and carefully dissected from host by removing all the fat and connective tissue. The colon is cut from the proximal (cecal) end, down the midline and until the distal end. Flatten out the tissue, cut a 2-3 cm strip (pink square) and immediately snap freeze using polypropylene tubes in liquid nitrogen."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}