{
  "id": 16887,
  "origin_website": "Jove",
  "title": "Iterative Development of an Innovative Smartphone-Based Dietary Assessment Tool: Traqq",
  "procedures": [
    "NOTE: All the procedures including human participants were conducted in a non-invasive manner by means of mostly qualitative research methods. Informed consent was obtained from all participants before the start of the evaluations. This protocol describes the iterative developmental process that can be roughly divided into four stages in which stages 1-3 are intertwined (Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62032/62032fig01.jpg\nFigure 1: Overview of the stages of the iterative development process of the app. The development process consisted of five stages in total. However, the process was iterative which means that stages 1 through 3 were intertwined. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62032/62032fig01large.jpg]\n1. Conduct extensive formative research in preparation of the actual developmental process.\nPerform desktop research exploring existing web- and smartphone-based dietary assessment tools, with special attention to features known to be of key importance for accurate food intake data collection, i.e., method of food entry (including the food list and underlying FCDB) and portion size estimations.\nInspect existing web- and smartphone-based dietary assessment tools focusing on aspects such as dietary assessment methodology, information provision, reliability, search engine, and implemented features (e.g., images, barcode scanner, recipe functions).\nConsult experts in the field of dietary assessment.\n\tNOTE: Results of the desktop research and inspection of existing tools were discussed with experts in the field of dietary assessment, leading to a draft design plan for the development of the app. This draft design plan was evaluated by the experts and further improved as required.\n2. Design the dietary assessment app\nCreate the visual design of the app considering important aspects such as animation, branding, color, layout, and typography20.\n\tNOTE: As space, color, fonts, graphics, and interface elements highlight content and convey interactivity, it is essential to incorporate elements facilitating the functionality of the app.",
    "Select a trustworthy FCDB (here, NEVO) to facilitate nutrient calculations of the collected food intake data14.\nCreate a food list by critically evaluating the description of the food items mentioned in the FCDB.\n\tNOTE: FCDBs are mostly developed for professional use; food descriptions are often complex and hinder searchability (e.g., \"margarine low-fat 35% fat < 10 g of saturated fats unsalted\"23).\nFormulate search engine requirements; consider the use of punctuation marks, foreign names, misspellings, different search terms, and ranking of search results to facilitate searchability of food items.\nSelect portion size estimation (aid) by evaluating various existing dietary assessment tools and field testing of suitable options.\nDesign routing within the app to ensure that the user's navigation through the app is logical, predictable, and easy to follow.\nDesign backend features and requirements to control the app; include functions related to overall project management, project-specific management (e.g., participants, invitations, data collection), and user management (e.g., authorizations).\n3. Evaluations by researchers\nNOTE: Following each upgrade, the app was tested by nutrition scientists and research dieticians with expertise in dietary assessment (in-house testing) to verify whether functionalities improved as anticipated. The following instructions are to be executed by researchers.\nConduct expert evaluation by means of cognitive walkthroughs to simulate a first-time user experience so that the experts can explore the app individually and without guidance28. Ensure that the cognitive walkthroughs consist of the following steps.\n\t\nMake sure that the expert completes a general questionnaire inquiring about the brand and type of smartphone.\nInstall the app on the expert's smartphone.\n\t\tNOTE: To ensure proper installation and functioning and minimize the risk of interruptions during the evaluation, it is recommended that the researcher first verifies the app's functionality.",
    "Instruct the expert on test procedures in which each expert is asked to take on the role of first-time user (i.e., research participant). Emphasize that the evaluation is performed from a user's perspective and not from the expert's own perspective.\n\t\tNOTE: The user was assumed to be an experienced smartphone user and to have knowledge on the use of apps in general. However, this app was used for the first time.\nStart the screen and audio recording.\nHave the expert complete the cognitive walkthrough while using the app and carrying out a predetermined set of tasks31: 1) \"I want to record my dinner. I started with a cup of tomato soup and a glass of milk.\", 2) \"Thereafter, I ate a pasta dish, which I consume regularly and want to enter it as a favorite (i.e., predecessor of My Dishes).\" [recipe was provided], 3) \"As I also consumed the pasta dish, I want to add this to today's food intake record.\", and 4) \"I entered everything I ate during dinner. I want to check my entry once more and then submit it.\".\n\t\tNOTE: While performing the tasks, the expert informs the researcher about his/her thought process, i.e., by explaining the steps needed to be completed to fulfill the described task.\nConduct a brief follow-up to clarify ambiguities32, and provide the expert the opportunity for additional feedback.\nEvaluate the results of each expert by checking the recordings to ensure that tasks were executed as intended and by reviewing the additional comments provided.\nShare the results with the experts to assess whether assumptions made based on the recordings were correct.\n\t\t​NOTE: Results of the evaluation were discussed and prioritized in consultation with the experts. Based on the results of this evaluation, the app was further upgraded.",
    "Conduct usability testing with intended users to evaluate the app's usability and likability among the intended users by means of think-aloud interviews and the system usability scale (SUS)33 by following these steps:\n\t\nRecruit participants who are representative of the target user population35.\nInstruct the participant regarding the study procedures, including the recording of screen and audio. Then, obtain informed consent from the participants.\n\t\tNOTE: It is important that the researcher encourage the participant to \"think-aloud\" during the evaluation, i.e., explaining their thoughts on the required steps to complete each task whilst performing the task, as well as commenting on what functionalities did or did not work well.\nInstall the app on the participant's smartphone.\n\t\tNOTE: To ensure proper installation and functioning and minimize the risk on interruptions during the evaluation, it is recommended that the researcher first verify the app's functionality.\nAsk the participant to perform a practice task for the think-aloud interview: ask participants to visualize their bedroom and count the number of windows, while telling the researcher about what they saw and thought while counting the windows. Next, ask the participants to approach one of the windows in their bedroom and describe their experiences on their way to that window.\n\t\tNOTE: A practice task was provided and repeated if needed to ensure that participants felt comfortable to think-aloud as desired37.\nStart the screen and audio recording.\nAsk the participant to complete actual think-aloud interview with the predefined tasks: the participant must: 1) record everything they ate and drank during the previous day, and 2) record a regularly consumed dish through the My Dishes function.",
    "During the session, observe, take notes, and stimulate the participants to keep thinking aloud, if needed, by simple prompts such as \"Keep talking out loud\", \"Tell me what you think\", or \"Tell me what is on your mind\". Minimize further interactions to prevent interference with the participant's thought process28,32.\nConduct a brief follow-up to clarify ambiguities32.\nAsk the participant to complete an evaluation questionnaire with general questions related to age, sex, educational level, type of smartphone, level of smartphone experience (i.e., experienced users are more likely to perform tasks quick and correctly38), as well as the SUS33-a 10-item questionnaire to assess the system's usability by means of Likert scale scoring ranging from 1 (strongly disagree) to 5 (strongly agree).\nAnalyze the data from each session by 1) transcribing, coding, and creating (sub)themes, and 2) calculating the SUS score using a predefined formula resulting in a score between 0 to 10033, where a score of >68/100 indicates that the tool functions at above-average level of usability and a score >80/100 indicates excellent usability39,40.\n\t\tNOTE: It is recommended that the researcher who guided the session analyze the data by using qualitative data analysis software. A second researcher can be consulted in case of ambiguities.\nConduct quantitative validation of dietary intake records against validated traditional methods and preferably independent measures3.\n\t​NOTE: The app is being validated against web-based and telephone-based (i.e., interviews) 24hRs as well as independent urinary and blood biochemical markers. As the quantitative validation of the app is outside the scope of this paper, this will not be discussed further.\n4. Using the backend system for app and study management",
    "NOTE: The system has three authorization levels: (1) administrator-this authorization level provides access to all sections of the backend (i.e., creating new users, determining user authorization, and granting users access to one or more projects); (2) project managers-this authorization level allows access to specific projects and the possibility to create new projects; and (3) researchers-this authorization level only provides access to the specific projects that researchers are involved in.\nManagement of users and projects in the backend by administrators\n\t\nAccess the online backend via traqq.idbit.net, with login credentials (i.e., username, password).\nCreate a new project by clicking on the Projects tab and then on Create a new project.\nIn the next screen, enter the requested project details (i.e., project name, contact description, contact email, contact phone, contact website).\n\t\tNOTE: Only the project name is mandatory to create a new project. The contact description, email, phone number, and website will become visible in the app under the Contact & Info button.\nSelect the desired features (i.e., product list, ask eating occasion and/or time of consumption, record or recall).\n\t\tNOTE: Each new project requires individual decision-making with respect to the most appropriate dietary assessment method (i.e., record or recall), food list, portion size estimation, and eating occasion or meal times.\nSave the new project by clicking on Save.\n\t\tNOTE: When the screen closes, the administrator returns to the Project overview screen.\nNext, create a new user by clicking on the User tab and then on Add new user.\nIn the following screen, enter a Username, a Password, and assign the user a Role (i.e., administrator, manager, or user).\nSave the new user by clicking on Save.\n\t\tNOTE: When the screen closes, the administrator returns to the User overview screen.",
    "Assign a user to a project by clicking on the notepad icon (i.e., Edit column) for a specific user.\nAssign a project by opening the dropdown menu under Linked Projects, selecting the desired project, and clicking on Add.\n\t\tNOTE: This action needs be repeated for each project the user needs to be assigned to.\nCommunicate the log-in credentials to the new user along with the backend URL.\nManagement of projects in the backend by researchers (i.e., Manager or User role)\n\t\nLog in to the backend via traqq.idbit.net by using the credentials provided by the administrator.\nClick on Go to projects to manage the projects.\nClick on the arrow in the View column for the desired project.\n\t\tNOTE: After doing this, the researcher is taken to a Project Overview page, and new tabs for this specific project appear.\nEnter the participants in the backend by clicking on the Participants tab. Next, when a Participant Overview screen appears, click on Add new participant.\nIn the following screen, enter Codename, Notes (optional), Login ID, Login Key, and ending with Save.\n\t\tNOTE: It is recommended that the Participant's study ID be used as both codename and login ID. This minimizes confusion for the participant in case of multiple login credentials. Moreover, the codename is visible in the responses. Using the participant ID makes it easy to use the data. This option needs to be repeated for each participant. For larger groups, Import participants from file (.csv) can be used. Here, the same details are required for each participant. The backend may not contain any personal information of participants.\nSchedule invitations for each participant by clicking on the Invitations tab. Next, when an Invitation Overview screen appears, click on Add new invitation.",
    "In the following screen, select a Participant from the dropdown menu, and enter Period start time, Period end time, Opening time, Closing time, Survey URL (i.e., optional for implementation of additional questions), Notes (optional), Enable (always yes).\n\t\tNOTE: The Period start and end time refer to reporting time frame (i.e., what has been consumed between ..:.. and ..:..). In contrast, opening and closing time refer to the period in which the participant can actually report their intake. The correct implementation of an external survey requires some coding; for this, help from the administrator is recommended. For the majority of the invitations, the Import invitations from (.csv) option under File can be used. The file requires the same information as for the manual input. Invitations can also be created via Sampling Schemes (i.e., where the system generates a random invitation scheme across different days and times based on a preset of rules such as sampling period, number of required invitations, response deadline). An advantage of the Sampling Schemes option is that the system automatically schedules a new invitation in case of non-response.\nTrack data collection via the Calendar tab by selecting a participant of interest from the dropdown menu.\n\t\tNOTE: The calendar provides an overview of scheduled invitations within a project, either in general or for specific participants. Future invitations are portrayed in blue, completed past invitations are green, while past invitations without response are red. Responses to invitations can also be checked via the Response tab.\nTrack responses via the Response tab.\n\t\tNOTE: In the Response section, the reported food intake data (i.e., food item, consumed amount, eating occasion and/or time of consumption) is gathered.\nRequests the administrator for data export.",
    "​NOTE: Data can be exported from the backend to a .csv file for further analysis (e.g., responses/food intake data, compliance data) by the administrator. Responses include reported food items, selected portion sizes, consumed amounts in grams, and eating occasions/times.\nImport the .csv file into nutrition calculation software for in-depth nutrient analyses.\n\t\t​NOTE: The data can be imported into nutrition calculation software that makes use of the Dutch FCDB.\n5. Use of the app by the participants during the study\nDownload the freely available app from the App Store (iOS) or Google Play Store (Android), and access the app by logging in.\n\tNOTE: Login credentials, as provided by the researcher, are required to access the app (step 4.2.5.). After logging in, the app sends invitations as scheduled in the backend based on the participant's credentials (step 4.2.7.).\nAfter receiving an invitation via the app, report food intake.\n\tNOTE: Participants can only register their food intake on predetermined days and times.\n\t\nOpen the app by clicking on the notification received or by opening the app via the app icon.\n\t\tNOTE: After opening the app, an Invitation Overview screen appears where previous and current invitations are displayed.\nClick on the open invitation.\n\t\tNOTE: Participant is taken to an Overview screen where the invitation period is visible.\nEnter the food item consumed first by clicking on Product toevoegen (Add food item).\n\t\tNOTE: The participant is taken to the Search screen.\nStart typing the name of the consumed item (e.g., orange juice [jus d 'orange]). Click on the desired item as it appears whilst typing.\nIn the following screen, report the consumed amount (Hoeveelheid), corresponding portion size description (Portie), eating occasion (Maaltijdmoment) and/or time of consumption (Tijdstip), and end by saving (Opslaan) .\nRepeat the aforementioned steps until all food items are reported.",
    "Submit the list (recall) by clicking on (Lijst versturen) (Send List), or the invitation automatically closes at the end of the day (record).\n\t\t​NOTE: The Send List option is also visible in the record version, so participants using the record can also send their input to the database. However, even if the data is already sent, the invite still closes at the end of the day, sending all data to the server."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}