{
  "id": 7732,
  "origin_website": "Bio",
  "title": "Proteome Integral Solubility Alteration (PISA) Assay in Mammalian Cells for Deep, High-Confidence, and High-Throughput Target Deconvolution",
  "procedures": [
    "Cell culture and ligand treatmentThaw the cells to be studied from the N2 stock vials, and wash them in 10–15 mL of their regular cell culture medium (e.g., DMEM supplemented with 10% heat-inactivated FBS, 1% penicillin/streptomycin, and 2 mM L-Glutamine), and sediment cells down by centrifugation according to cell type-specific recommendations (250 × g for 5 min). Discard the supernatant and resuspend the cells in complete growth medium.The day before the PISA experiment, split the cells in the number of samples as by experimental design, up to 18–25-cm2 cell culture flasks containing 5 mL of complete cell growth medium in each flask, and let the cells attach overnight.Incubate each biological replicate with active ligands to be studied (e.g., drugs, active molecules of interest)—here named “D”—at a biologically active concentration previously tested (e.g., IC50 or similar) using a stock with 1,000–2,000× concentration, with at least three biological replicates per D ligand. Control replicates are to be treated with the volume of the vehicle solution (e.g., DMSO). In the chosen example of PISA multiplexing scheme, five D ligands (D1–D5) with three biological replicates each and three replicates of the vehicle-treated controls are used, for a total of 18 biological samples.Note: The number of biological replicates can be higher, as recommended for lower numbers of D ligands to be tested, depending on the number of molecules or conditions to be tested, and up to 18, by using the TMTproTM 18-plex label reagent set, which can host up to five ligand-treated or vehicle-treated samples in triplicate. Incubate treated cells for 30–90 min in a 5% CO2 cell culture incubator at 37 °C.",
    "At the end of the treatment with each D or vehicle, collect cells from each flask using TrypLE, and wash the cell pellets twice with 10 mL of PBS, followed by centrifugation (250 × g for 5 min).Protein extraction for PISA assay samplesResuspend the cell pellet in 750 μL of PBS buffer including protease inhibitors.Gently mix, resuspend cells homogeneously, and distribute 45 μL in each 0.2-mL tube, for a total of 16 temperature points to be used for each sample.Perform step B2 for each sample.Heat each sample at a range of 44 to 59 °C, with 1 °C intervals, and perform the temperature treatment for 3 min at each temperature.Notes:  By using a gradient thermal cycler, samples can be treated at different temperatures at the same time. The temperature range can be varied and tuned according to specific expectations or needs, with virtually unlimited number of temperature points. Leave the samples at 23 °C for 6 min.At the end of the 23 °C incubation, snap freeze the samples in liquid N2.Thaw all samples at 37 °C, vortex for 10 s, and snap freeze in liquid N2.Repeat step B7 four times, for a total of five freeze-thaw cycles.For each sample and replicate, combine the contents of 16 tubes corresponding to all temperatures of that replicate into one protein low-binding tube, and add 20% NP40 solution, up to a final concentration of 0.4%, which at this point should not resolubilize insoluble proteins.Incubate all samples shaking at 350 rpm/min at 4 °C, in a thermomixer or a refrigerated room, for 30 min.Perform ultracentrifugation at 150,000 × g at 4 °C for 30 min, and recover the supernatant of each replicate without disrupting the pellet.",
    "Soluble protein fraction processingDay 1 Measure the total protein concentration of all samples, using a micro-BCA kit and an absorbance plate reader.Take the volume corresponding to 50 μg for each sample. To equalize volumes, dilute all samples with PBS up to the volume of the sample with the least concentration. Perform reduction by adding 0.5 M DTT solution to a final concentration of 8 mM, and incubate samples at 55 °C for 45 min.Add 0.5 M IAA solution to a final concentration of 25 mM, and incubate samples in darkness at 25 °C for 30 min.Precipitate proteins using cold acetone at -20 °C overnight, at a sample:acetone ratio of 1:6 (v/v).Day 2 Collect the precipitated proteins by centrifugation (10,000 × g, 10 min), remove the supernatant, and air-dry the pellet for 5 min.Solubilize each pellet in 15 μL of EPPS buffer at pH 8.2 including 8 M urea for 10 min.Add 14 μL of EPPS buffer to each sample. Dissolve 20 μg LysC powder using 30 μL of EPPS buffer, then add 1 μL of this LysC enzyme solution (equivalent to 0.67 μg of LysC) to each sample, and allow the digestion to proceed gently mixing at 350 rpm/min at 30 °C for 6 h.Add 90 μL of EPPS buffer to each sample. Dissolve 20 μg lyophilized sequencing grade modified trypsin using 20 μL of trypsin resuspension buffer, then add 1 μL of this trypsin solution (equivalent to 1 μg of trypsin) to each sample, and let the digestion occur gently mixing at 350 rpm/min at 37 °C overnight.Stop the reaction the day after by placing the samples on ice.Take out a volume of 60 μL, corresponding to 25 μg, from each of the digested protein samples.",
    "Dissolve 800 μg TMTpro 18-plex reagent using 150 μL of water-free acetonitrile, and label each sample with 25 μL of a different TMTpro 18-plex labeling reagent solution. Let the labeling reaction occur at room temperature for 2 h. Keep the remaining 25 μg of each sample at -80 °C as a backup. The remaining TMTpro 18-plex reagent solution can be stored at -80 °C after speed-vacuum drying.Stop the reaction by adding 50% hydroxylamine solution to quench labeling, to a final concentration of 0.5% hydroxylamine.Pool the labeled samples together in a 2-mL tube and concentrate the obtained multiplexed sample at least two-fold in a speed-vacuum concentrator.Acidify the samples using acidifying solution, to a final concentration of ~1% TFA, to reach a final pH < 3.Perform desalting of the multiplexed sample using a C-18 desalting column and a vacuum manifold. The sample desalting procedure, in sequence, is as follows:Wash the column with 0.45 mL of 100% methanol.Wash with 0.45 mL of 50% ACN (v/v) solution including 0.1% TFA (v/v).Equilibrate with 0.9 mL of 0.1% TFA (v/v); load the sample.Wash with 0.45 mL of 2% ACN (v/v) solution including 0.1% TFA (v/v).Wash with 0.15 mL 2% ACN (v/v) solution including 0.1% FA (v/v).Elute with 0.45 mL of 50% ACN (v/v) solution including 0.1% FA (v/v). Collect the elution in a 2-mL protein low-binding tube.Elute with 0.3 mL of 80% ACN (v/v) solution including 0.1% FA (v/v). Collect the elution in the same 2-mL protein low-binding tube of the previous step.Concentrate the desalted and cleaned sample to dryness, using a speed-vacuum concentrator (overnight concentration is possible).Peptide separation, mass spectrometry, and proteomics data analysisResuspend the final multiplexed sample in 100 µL of High pH Buffer A, and use 50 μL (equivalent to 225 μg of original starting protein amount) for the next steps.",
    "Keep the remaining at ­80 °C for backup (it is also possible to dry it again in a speed-vacuum concentrator before storing it, which is advised for long term storage).Inject the resuspended sample for off-line, high pH reversed-phase separation and fractionation into a capillary HPLC system equipped with a 25-cm long, 2.1-mm wide (inner diameter) C18 column, at a flow rate of 200 μL/min.Perform peptide separation with a binary solvent system consisting of high pH Buffer A and high pH Buffer B, using a gradient from 1% to 6% B from 2 min to 6 min, to 26% B in 36 min, to 53% B in 4 min, to 63% B in 3 min, and then at 63% B for 5 min. Monitor the elution by UV at 214 nm (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4556/bioprotoc-12-22-4556-g001.jpgFigure 1. Example of a chromatogram showing the separation of TMT-labeled peptides during high pH reverse phase HPLC, monitored by absorbance at 214 nm (blue), and its gradient (black and dotted line). The light blue area depicts the sample collected in fractions, while the fractions are delimited by light blue and dotted lines.Collect 96 fractions of 100 μL in a ninety-six-well plate, starting at the minute 2.5 after injection.Concatenate the ninety-six 100-μL fractions into 48 concatenated fractions by merging each fraction “n” with “n+48” (for example, 1 with 49, 2 with 50 … and 48 with 96).Dry the final fractions using a speed-vacuum concentrator.Inject the equivalent of 1 μg peptides of each fraction on a reversed-phase C18 nano-LC (nLC) column of a nano-LC–ESI–MS/MS instrument, with a C18 nano-trap column and the column for nLC separation at the temperature of 55 °C during peptide analysis.",
    "Perform nLC separation using a binary solvent system, consisting of LC-MS buffer A and LC-MS buffer B, with a gradient of 4% to 26% B from 5 min to 91 min, 26% to 95% B in 9 min, and 5 min in 95% B, prior to equilibration in 4% A (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4556/bioprotoc-12-22-4556-g002.jpgFigure 2. Gradient for nano-LC separation of TMT-labeled peptides before MS/MS analysis Perform quantitative bottom-up proteomics analysis for TMTpro-based MS/MS acquisition. Acquire mass spectra in a mass-to-charge (m/z) range of 375–1,500, with a resolution of 120 000 at m/z 200 for MS1. Set the AGC target to 3 × 106, with a maximum injection time of 100 ms. Select the 17 most intense peptide peaks for peptide fragmentation via HCD, with the NCE value set at 33. The ion selection abundance threshold is set at 0.1% with charge exclusion of z = 1 ions. The MS/MS spectra are acquired at a resolution of 45 000, with an AGC target value of 2 × 105 ions, or a maximum injection time of 120 ms. The fixed first m/z is 110, and the isolation window is 1.6 m/z. The instrument is operated in the positive ion mode for data-dependent acquisition of MS/MS spectra, with a dynamic exclusion time of previously selected precursor ions of 45 s."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}