{
  "id": 2620,
  "origin_website": "Cell",
  "title": "Dissection of murine collecting lymphatic vessels for imaging, single-cell analysis, and tissue culture of lymphatic muscle cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse preparation for surgery\nTiming: 10 min\nIn this section, the mouse is anesthetized, partially shaved, and has the contrast agent for lymphatics injected.\nAnesthetize mouse using an intraperitoneal injection (IP) of ketamine/xylazine cocktail (K/X).\nRecommended dose of K/X is 0.2 mL/20 g mouse weight for IP injection with syringe containing a 26G × 5/8-inch needle.\nWait till the mouse does not react to a toe pinch (around 5 min).\nNote: After 60 min, an additional dose might be required.\nRemove fur from hindlimbs to minimize possibility of microorganism contamination and improve visualization of the area.\nUse mechanical clippers first.\nApply hair removal cream for 30 s using a cotton tip applicator. Use a paper towel wetted with water to wipe away cream. Then dry the area.\nInject 2% Evans blue in foot pad of both limbs subcutaneously (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2117-Fig1.jpg\nFigure 1. Exposing vessels of the hind limb\n(A) Evans blue subcutaneous injection (left paw).\n(B) Shaved mouse immobilized for surgery (left limb).\n(C) View of vessels of ankle under stereomicroscope. Arrows point to where the cuts should be made.\n(D) Initial cut in the left side of the left ankle.\n(E) Cut extensions from ankle to upper thigh in left side of left hind limb.\n(F) Transverse cut joining incisions from both sides of the left hind limb.\n(G) Pulling of the skin flap to expose vessels.\n(H) Cut skin flap to reveal vessels. Arrow pointing to part of the skin flap to be cut.\n(I) Vessels of the left hind limb exposed. Circled area is where the vascular branch bends. Blue arrow points to PLV.\n(J) Pulling upwards of the fat layer on top of vascular branch. Black arrow points to fat.",
    "(K) Pulling downwards of the fat layer on top of vascular branch. Black arrow points to fat.\n(L) Diagram showing the distribution of the main lymphatic vessels in the mouse hind limb.\nInject in the middle point of back of the paw between digital and metatarsal pads with a depth of 3–5 mm.\nWe recommend using a volume of 10–20 μL (enough to make a visible bolus beneath the skin) injected with insulin syringe containing a 28G × ½ inch needle.\nPlace the mouse in lid of sterile Petri dish in prone position. Tape the ankle and upper part of the thigh to immobilize the surgical area (Figure 1[href=https://www.wicell.org#fig1]B).\nSanitize surgical area with iodine and alcohol wipes.\nAdd a drop of iodine to the alcohol pad.\nExposure of vessels\nTiming: 5 min\nIn this section, the skin of the hind limb is removed to expose the vessels in the area. The popliteal lymphatic vessel (PLV) exposure described in this section has been optimized from Liao et al. (2014)[href=https://www.wicell.org#bib4] for procedures in this protocol but can also be used for measuring PLV contraction. The mouse should be placed in the orientation depicted in Figure 1[href=https://www.wicell.org#fig1]B and a stereomicroscope is preferred for removing the skin and the underlying connective tissue.\nLocate the PLVs in the ankle area (Figure 1[href=https://www.wicell.org#fig1]C).\nNote: The PLVs should be visible through the skin after Evans blue injection into the footpad.\nOn one side of the ankle, pinch a portion of the skin without PLVs using blunt forceps and make a cut with micro scissors. Repeat on other side (Figure 1[href=https://www.wicell.org#fig1]D).\nBe careful not to cut any of the PLVs (this would interrupt the flow of Evans blue within the collecting lymphatic vessel to be isolated).",
    "If the PLVs are not visible, make the incisions as laterally as possible on both sides of the ankle, using the blood vessel as a reference.\nExtend both cuts towards the end of the thigh (Figure 1[href=https://www.wicell.org#fig1]E).\nOnce the end of the thigh is reached with both cuts, make a transverse cut to join the incisions and pull downwards to expose the PLVs and BVs (Figures 1[href=https://www.wicell.org#fig1]F and 1G).\nNote: It is preferred that the skin flap made during these steps remains small (around 0.3 × 1 cm) since this is conducive to pulling of the skin to expose the vessels. More resistance is encountered with large skin flaps and with diseased mice.\nCritical: Avoid pulling too forcefully, since this could lead to the rupture of vessels. See troubleshooting 1[href=https://www.wicell.org#troubleshooting] and troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nCut the skin flap to reveal the vessels from the lymph node to the ankle (Figures 1[href=https://www.wicell.org#fig1]H and 1I).\nAfter removing the skin, use a sterile cotton applicator to remove any blood coming from broken capillaries and immediately hydrate the area with sterile PBS.\nNote: During the surgery, add sterile PBS to keep the exposed area hydrated. PBS also improves visibility of surrounding fat to be extracted.\nPlace the mouse at an oblique angle and using a different set of forceps (fine forceps instead of blunt) and micro scissors, remove the membrane of fat covering the vessels.\nThis can be achieved by pulling the membrane with fine forceps and making small incisions in the fat with micro scissors or microscalpel (Figures 1[href=https://www.wicell.org#fig1]J and 1K).",
    "Note: Take caution to not pull on any of the vessels while removing the fat. The area of the limb where the vascular branch bends is usually covered in more fat than the rest. This fat layer can be pulled with forceps and cut with micro scissors to expose the vessels.\nDissection of hindlimb tissue for immunofluorescence staining\nTiming: 4 days\nPerform this section if the structure of the vessels needs to be preserved for histological studies. We recommend performing steps 12–15 with the help of a stereomicroscope.\nLocate the fat within the area of vascular branch. Use micro scissors to make a cut that runs parallel to either PLV (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2117-Fig2.jpg\nFigure 2. Isolation of vascular branch of the hind limb\n(A) Vessels of the right hind limb exposed and initial cut parallel to the right PLV. Blue arrow points to PLVs.\n(B) Progressive cut of the fat below the vascular branch from the right side of the right PLV to the left side of the left PLV.\n(C) Extension of separation of vascular branch from underlying tissue with micro scissors. Blue arrow points to PLVs.\n(D) Extraction of vascular branch by making two cuts with micro scissors.\nPull the fat on the exterior side of the PLV upwards to aid the process.\nNote: Although the upper layer of fat has been removed in step 11, a layer of fat surrounding the vessels will still be present and can be cut.\nOnce a cut is made on the side of the PLV, trim the fat underneath the PLV, BV, and the PLV of the opposite side (Figure 2[href=https://www.wicell.org#fig2]B).\nPull the fat in between the BV and PLVs to aid the process.",
    "Keep cutting until the three vessels are separated from the underlying tissue. If necessary, cut from the other side of the vascular branch.\nOnce a portion of the vascular branch is separated from the fat and the BV, the separation can be widened with the aid of a microscalpel or micro scissors (Figure 2[href=https://www.wicell.org#fig2]C).\nOnce the area of interest of the vascular branch has been separated from the underlying tissue, cut with micro scissors to retrieve it (Figure 2[href=https://www.wicell.org#fig2]D).\nPlace in PBS to wash off the blood.\nPlace in 4% PFA for 1–4 h at 18°C–25°C.\nWash with PBS for at least 1 h at 18°C–25°C (or 12–14 h at 4°C).\nFor sectioning, an appropriate protocol for OCT (cryosections) or paraffin embedding can be followed. The latter is recommended to preserve tissue architecture.\nFor whole-mount, continue performing steps 19–26.\nNote: For OCT embedding, samples usually undergo a glucose/OCT gradient, while for paraffin, samples usually undergo ethanol and xylene/paraffin gradients before the final embedding. For sectioning, the vessels should be embedded in vertical orientation to obtain cross-sections of the lumen. For paraffin sectioning, we recommend making 5–8 μm sections.\nPermeate with 0.5% triton (in PBS) at 4°C for 12–14 h in a microcentrifuge tube.\nNote: If the tissues are derived from a mouse expressing fluorescent reporters, use an opaque microcentrifuge tube.\nIncubate with PBS-glycine wash buffer for 20 min at 18°C–25°C. Repeat 3 times.\nIncubate samples with blocking buffer (10% normal donkey serum in immunofluorescence wash buffer (PBS, 0.1% Tween)) for 1 h at 18°C–25°C.\nIncubate samples with primary antibody for 24–48 h at 4°C.\nWe typically combine a fluorophore-conjugated anti- α-sma antibody to visualize LMCs with and anti-Prox1 antibody to detect lymphatic endothelial cells.\ntable:files/protocols_protocol_2117_9.csv\nWash three times with PBS 20 min each time.",
    "Incubate with secondary antibody with desired fluorophore for 12–14 h at 4°C.\n1:100 of anti-goat 647 for Prox1.\nRinse samples with PBS. For 20 min. Repeat 3 times.\nTo image using confocal microscopy, place the stained sample on a glass slide with enough PBS for hydration. Use a glass coverslip to flatten tissue for imaging.\nIsolation of popliteal lymphatic and blood vessels\nTiming: 20 min\nPerform this section if the separation of PLVs and BVs is needed for downstream applications. This section continues from step 11 and requires the use of a different set of forceps (fine forceps) and micro scissors. We recommend performing steps 27–31 with the help of a stereomicroscope.\nCut the fat between one of the PLVs and the BV (Figure 3[href=https://www.wicell.org#fig3], Methods video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2117-Fig3.jpg\nFigure 3. Separation of PLV from fat and BV\n(A) Separation of PLV from BV by pulling on the PLV and subsequently using the tip of the scalpel in a downward motion to separate from BV. Blue arrow points to PLV. Red arrow points to blood vessel.\n(B) Progressive side to side cutting with scalpel removes fat (encircled) surrounding the LV. See also Methods video S1[href=https://www.wicell.org#mmc1].\n(C) PLV being pulled to show separation from underlying tissue from top of limb to the bend of the vascular branch (separation also present from bend to ankle but not shown). Arrow points to where to make the first cut to remove the PLV.\n(D) Removal of PLV from upper to lower left hind limb by cutting with micro scissors. See also Methods video S2[href=https://www.wicell.org#mmc2].\nStart with the PLV most distal from the BV. This distance between vessels is greater in the area between the popliteal lymph node (pLN) and where the vascular branch bends.",
    "Pull the fat adjacent to either PLV and make a small downward incision in the fat in between the PLV and BV with the tip of a microscalpel (Figure 3[href=https://www.wicell.org#fig3]A, Methods video S1[href=https://www.wicell.org#mmc1]).\nRepeat step 27b till the PLV is completely separated from the underlying tissue (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: The fat on the exterior side of the PLV can be cut with micro scissors to aid step 27c.\nCritical: In step 27b, be gentle when pulling the PLV and keep the blade of the scalpel horizontal to not slice through the BV. See troubleshooting 2[href=https://www.wicell.org#troubleshooting].\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Fat removal of PLV in left upper thigh, related to step 27\nOnce a portion of the PLV is separated from the fat and the BV, widen the interior incision with the aid of the microscalpel or micro scissors.\nRepeat this process from the pLN ideally all the way down to the ankle or at least down to the vascular bend till the majority of the vessel is detached from the underlying tissue (Figure 3[href=https://www.wicell.org#fig3]C).\nPerform step 27b in areas along the vessels that have high amounts of fat (they usually are towards the bend of the vascular branch).\nNote: Around the vascular bend, a network of blood vessels can be intertwined with the PLVs, making the extraction more challenging. The region of PLVs that extend to the ankle area are amenable to separation once step 27a has been performed in the upper areas of the hind limb.\nOnce one of the PLVs has been separated from the fat and the BV, repeat steps 27 and 28 with the other PLV in the hindlimb.\nRotate the Petri dish to work more comfortably on the other LV.\nDetach the BV before the PLV.",
    "Once the three vessels are detached, cut the PLV with micro scissors and place in a 35 mm TC dish containing HBSS on ice.\nMake the initial cut proximal to the pLN and then pull towards the ankle. Since the vessel is detached from the tissue, the vessel should not resist pulling unless some regions remain attached to fat. These areas can be cut with micro scissors (Figures 3[href=https://www.wicell.org#fig3]C and 3D and Methods video S2[href=https://www.wicell.org#mmc2]).\nSeparate the BV from the fat in the same way.\nCritical: When the BV is cut, an EtOH pad should be applied to stop the bleeding. See troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nPut instruments in ethanol, change gloves, and repeat steps 6–11 and 27–30 on the other limb, if desired.\nAfter extraction is complete, euthanize the mouse.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. PLV extraction in left upper thigh, related to step 30\nGeneration of single cell suspensions from lymphatic and blood vessels\nTiming: 1 h 20 min\nPerform this section if a single cell suspension is required for downstream analysis such as cell culture, flow cytometry, and RNA sequencing. For cell culture, all steps must be performed in a biological safety cabinet.\nTake the enzymatic solution from 37°C incubation and pipette 200 μL to the lid of the 35 mm TC plate.\nUsing fine forceps, transport the extracted LVs to the 200 μL of enzymatic solution.\nNote: Since PLVs are extremely small, a stereomicroscope can be used to confirm that all PLVs (maximum 4 per animal) have been transferred to the enzymatic solution.\nCritical: Do not mince PLVs since vessel fragments can easily stick to the instruments, resulting in sample loss. See troubleshooting 5[href=https://www.wicell.org#troubleshooting].",
    "With a P1000 pipette, transport the enzymatic solution containing the vessels to a 15 mL conical centrifuge tube containing the remainder of the enzymatic solution.\nIf the vessels do not dislodge easily, the pipette should be taken out of the solution and the forceps and micro scissors used to detach the vessels and transported to the lid once again. If vessels remain, repeat this step.\nIf possible, avoid clumping of the vessels. In our experience this leads to poor cell yield (most likely because the solution cannot reach the entirety of the vessels, see troubleshooting 5[href=https://www.wicell.org#troubleshooting]).\nNote: Ensure that all PLVs are transferred to the solution. The pieces can be very sticky and attach to the tip of the pipette. The pieces can be dislodged by pipetting vigorously up and down. However, this should not be done more than 10 times as our experience indicates that it leads to poor cell yield.\nRepeat steps 33–36 for the median blood vessels (maximum 2 per animal) if desired.\nIn 15 mL conical centrifuge tube, incubate enzyme solution with vessels at 37°C, 5% CO2 for 60 min.\nAfter 60 min, add 10 mL of DMEM with 10% FBS to neutralize enzymatic activity and centrifuge at 300 g for 5 min. Repeat twice.\nCell culture\nTiming: 10 min\nThis section describes how to culture a PLV and BV derived single cell suspension. The following steps must be performed in a biological safety cabinet.\nResuspend cell pellet (obtained from step 38) in cell culture media (DMEM, 20% FBS, 1% P/S).\nTake 10 μL of each cell solution for counting and assessing cell viability.",
    "Note: We recommend resuspending cells from PLVs and BVs in 100 μL and 200 μL cell culture media, respectively, based on typical cell yields. In our hands, cell viability is consistently above 90% (determined by trypan blue). For low cell yield see troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nAdd cell suspension from LVs and BVs to respective collagen-coated wells.\nWe recommend using collagen-coated wells of a 48 well plate and a final volume of 500 μL.\nAllow cells to grow in the cell culture incubator for 7 days.\nNote: After 1 day, a few cells should adhere. If around 104 total cells were plated, the well should reach 100% confluency within 7 days. To stimulate growth, media can be replaced after 5 days of plating to replenish nutrients. It is recommended to check the cells every day to assess growth and potential microbial contamination. For suboptimal growth see troubleshooting 6[href=https://www.wicell.org#troubleshooting]."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Culture",
    "Developmental Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}