{
  "id": 10401,
  "origin_website": "Jove",
  "title": "Fabrication and Implementation of a Reference-Free Traction Force Microscopy Platform",
  "procedures": [
    "1. Photopolymerizing a PEGDA base hydrogel\nGathering Reagents\nCollect lithium phenyl-2,4,6-trimethylbenzoylphosphinate (LAP), 3.4 kDa poly(ethylene) glycol diacrylate (PEGDA), n-vinyl pyrrolidone (NVP), AlexaFluor 488 labeled PEGDA (PEG-488), AlexaFluor 633 labeled PEGDA (PEG-633), and PEGylated RGDS peptide (PEG-RGDS) from their respective freezers and bring each to room temperature.\nIn separate amber microcentrifuge tubes, measure 3 mg of LAP, 10 mg of PEGDA, 5 mg of PEG-488, 20 mg of PEG-633, and 6 mg of RGDS peptide.\nPreparation of the Pre-Polymer Solution\nDissolve the LAP in 1 mL of phosphate buffered saline (PBS, pH 7.4). Use 200 μL of the dissolved LAP solution to dissolve the PEGDA. Then, use 200 μL of the PEGDA solution to dissolve the PEG-RGDS.\n\t\tNOTE: If control of cell shape is desired, omit dissolving PEG-RGDS in the base hydrogel pre-polymer solution, as it will be added via two-photon, laser scanning lithography later in the protocol.\nUse 80 μL of PBS to dissolve the PEG-488. Add 2.5 μL of this solution to the pre-polymer solution.\n\t\tNOTE: The PEG-488 will give the final hydrogel a fluorescent signal which can be used to navigate during patterning and the concentration can be modified to alter the signal intensity.\nFilter the complete pre-polymer solution through a 0.2 μm polytetrafluoroethylene (PTFE) filter to remove any particulates that may be present in the solution. If reactants are properly synthesized, the filter should not become clogged.\nPhotopolymerizing the base hydrogel\nPlace 3 μL of the pre-polymer solution on a thin flat sheet of perfluoroalkoxy alkanes (PFA). Place flat 150 μm thick polydimethylsiloxane (PDMS) strips surrounding, but not in contact with, the drop of pre-polymer solution. Place an acrylate-silanized coverslip21,22,23,24 on the PDMS—with the pre-polymer droplet centered under the coverslip—to flatten the pre-polymer droplet to the thickness of the PDMS spacers.",
    "Expose the sandwiched pre-polymer solution to UV light until a hydrogel is fully formed (approximately 1 min at 14 mW/cm2 of 370-400nm light).\nCarefully separate the coverslip from the PDMS spacers and attach to an open-bottom Petri dish using high-performance, double-sided acrylic adhesive. Apply pressure to the adhesive contact surface to create a complete seal between the coverslip, adhesive, and Petri dish—with care not to crack the glass.\nRinse the hydrogel in the Petri dish using sterile-filtered PBS to minimize biological and particulate contaminants.\nRepeat steps 1.3.1-1.3.4 as needed to create the desired number of hydrogels.\nAdd 8 μL of NVP to the remaining 800 μL of LAP solution and keep this solution as well as undissolved PEG-633 until ready to pattern.\n\t\tNOTE: The LAP solution with NVP is very sensitive to light and will polymerize if not kept in the dark. Wrapping the tube in aluminum foil can help improve its shelf life.\n2. Creating patterning instructions\nDesigning a binary image\nTo create a virtual mask for prescribing fiducial marker arrays, use image-processing or drawing software to create an image with an aspect ratio of 100:1 (e.g., 2000 pixels long x 20 pixels wide).\nCreate a row of 100 evenly spaced white pixels on a black background centered along the long axis of the image.\nSave this image as a *.tif filetype.\n\t\tNOTE: If control of cell shape is desired21,25,26,27,28, create an additional virtual mask. Use a square shaped image canvas and create positive white features on a black background. For approximating an appropriate size for the white features (which will eventually support cell adhesion) assume that the total size of the image is equivalent to the size of the microscope’s viewfield used for laser scanning lithography.\nConverting a binary image to a digital mask",
    "Download the LSM-ROI-Generator functions available free at the software repository29.\nOpen Matlab and find the directory of the downloaded function files. Once in the directory, open the run_script.m Matlab script and run the script.\nSelect the binary *.tif file for conversion. Then, select a folder to save regions files.\nInput the desired final size, in microns, of the selected image. The input image will be scaled and dimensioned to match these parameters. For the entire image to fit in the viewfield of the microscope, the total size of the image must be less than or equal to the size of the microscope viewfield.\nIf creating a single pixel array, in the ROI-Generator Options, make sure to uncheck the Remove tickbox under Small Regions/Single Pixels, to check the tickbox labeled Squares, and to uncheck Use under Horizontal Break Lines. Then, click OK.\n\t\tNOTE: If creating a regions file to create single cell patterns the default options are appropriate.\nFind the resulting *.ovl file in the previously specified folder. This file must be brought to the microscope to load the desired regions that control the laser shutter during two-photon laser scanning lithography.\n3. Fabricating fiducial marker arrays\nSoaking the base hydrogel\nUnder low light conditions, add 200 μL of the LAP/NVP solution to the AF633 (both prepared in step 1). Mix thoroughly while protecting from light.\nRemove all PBS solution from the Petri dish containing a PEGDA hydrogel from step 1.\nAdd the dissolved PEG-633 to the hydrogel to form a droplet that completely encompasses the base hydrogel.",
    "NOTE: If the hole in the Petri dish is only slightly larger than the hydrogel, it can serve as a well to hold the patterning solution. Otherwise, make sure that the coverslip is completely dry before adding patterning solution or it may run off the hydrogel causing the hydrogel to dehydrate during patterning.\nLoad the Petri dish onto the sample holder on the microscope stage and place the lid on the Petri dish. Allow the patterning solution to soak into the hydrogel for at least 30 min in the dark.\n\t\tNOTE: The microscope can be turned on and configured during this soak time. Using the 488 nm laser to image the hydrogel during soaking is fine.\nConfiguring the microscope\nUsing a 488 nm laser line and filters appropriate to image AlexaFluor 488, locate the hydrogel using the PEG-488 signal. Block collection of longer emission wavelengths from the detector as these will be saturated with signal from the PEG-633.\nFind the center of the hydrogel in the XY plane using vertical and horizontal tile scans and zero the stage position here.\nFind the surface of the hydrogel using line scans and the z-stack function. Zero the focus position here. Level the hydrogel by repeating these line scans away from the XY center to identify the surface position and adjusting the set screws for the microscope stage.\nWithin the microscope software workspace, create a separate experiment file for photopatterning. Set the multiphoton power to 1.8% (15.5 mW at 740 nm as measured at the back aperture of the objective), and the scanning speed to 6 (0.1 µm/µs). Adjust the size of the image frame in pixels to achieve a pixel size of 0.1 µm per pixel and an aspect ratio of 100:1.",
    "Load the regions file (*.ovl) created in step 2.2 into the regions tab. Use a macro to set all regions to acquisition.\nTurn on the z-stack function and set the spacing to 3.5 μm for a total depth of 28 μm and total number of z-slices of 9.\nUse the positions function to set specific locations on the hydrogel where the fiducial marker arrays will be photopatterned.\n\t\tNOTE: The z-location of these positions will dictate the center position of each z-stack; when placing positions, be sure that each position will guarantee that the patterned volume will overlap with the hydrogel at all surface locations.\nUse the tile function to specify additional rows and columns at each position. Be careful to avoid overlapping patterned regions. Ideally, make sure that patterned areas are close enough to remove empty and unusable locations between positions.\nPhotopatterning the fiducial marker arrays\nAs soak time approaches the 30 min mark, take successive z-stack line scans of the surface of the hydrogel every 5 min to check for swelling based on changes in the location of surface relative to the zeroed focus position.\nIf no change in the surface position occurs over a 5 min interval, load and run the patterning settings created in step 3.2.4\nOnce the patterning experiment has finished running, use the 488 nm laser to verify that the surface of the hydrogel did not move during patterning.\n\t\tNOTE: If it the surface of the hydrogel is not in the same position as it was prior to patterning, several scenarios exist. The hydrogel had not reached swelling equilibrium prior to patterning, the hydrogel began to dry out during patterning, or the microscope experienced z-drift. The source of this surface translation should be identified and corrected in subsequent patterning runs.",
    "Remove the hydrogel from the microscope and aspirate the PEG-633 solution from the Petri dish.\n\t\tNOTE: The hydrogel is still extremely sensitive to light. Keeping the hydrogel in the dark is very important until all rinsing is complete.\nRinse the hydrogel 3 times with sterile-filtered PBS, making sure to completely remove rinsate between each successive rinse. Repeat this triple rinse every 15 min for 1 h.\nAllow the hydrogel to rinse in PBS overnight.\n\t\tNOTE: The protocol can be paused here.\nTriple rinse the hydrogel with PBS. Then quickly triple rinse the hydrogel with a 200-proof ethanol solution, followed by another triple rinse with PBS. Do not allow the hydrogel to sit in 200 proof ethanol for extended periods of time.\n\t\tNOTE: Some components of the patterning solution can crash out of solution and deposit onto the surface of the hydrogel and appear as a solid layer of fluorescence (~1-5 microns thick) under 633 nm illumination. Rinsing with 200 proof ethanol should remove these unwanted components.\nUsing successive photopatterning to generate single cell patterns (Optional)\n\tNOTE: If control over cell spread area and shape is desired, multiple rounds of patterning can be performed. The base gel must have PEG-RGDS omitted from its initial formulation. It is recommended that patterning of the fiducial marker arrays be performed last to avoid bleaching of the fluorescent fiducial markers.\n\t\nDissolve 20 mg of PEG-RGDS in the LAP/NVP solution prepared in step 1.\nRepeat steps 3.1 – 3.3 using the PEG-RGDS solution instead of the PEG-633 solution. Use the appropriate regions file that defines the single cell patterns (see step 2 for instructions).",
    "NOTE: To visualize the arrays of PEG-RGDS patterns, there are several options. A fluorescent variant of PEG-RGDS can be used21,30 or the PEG-RGDS can be doped with fluorescent PEG. Recommended: Alternatively, the 488 nm laser line can be run in tandem with the multiphoton patterning laser to bleach PEG-488 signal in the base hydrogel, creating non-fluorescent regions that coincide with RGDS incorporation.\n4. Visualizing fiducial marker arrays\nAcquiring a z-stack image of the fabricated array\nReplace PBS in the Petri dish with the cell media used for cell culture.\n\t\tNOTE: Phenol red free media is recommended for use during image acquisition to prevent phototoxicity.\nAfter 1 h of soak time, use a widefield fluorescence microscope equipped with a structured illumination module and a high-magnification water immersion objective lens to visualize the hydrogels using a filter set appropriate for the fluorescent fiducial markers.\nCollect a high-resolution z-stack of images (spaced 0.4 μm in Z) encompassing at least 20 μm of depth from the surface of the hydrogel into the hydrogel in the patterned area, making sure the upper limit of the z-stack includes at least 1-2 images physically above the patterned area (i.e., where the fluorescent fiducial markers are no longer visible and only noise is present).\n\t\tNOTE: Acquisition of this image stack is necessary to verify that all patterning parameters are correct and can be analyzed alongside cell data in step 5.3.\n5. Performing TFM using photopatterned hydrogels\nSeeding Cells\n\tNOTE: To maintain sterility, follow all standard tissue culture practices.\n\t\nPrior to cell seeding, follow standard protocols for the respective cell line for cell culture and maintenance.\n(Optional) If sterility of the hydrogel is a concern, incubate the hydrogel for 24 h in media containing antibiotics followed by rinsing with normal media.",
    "To seed cells, first re-suspend trypsinized cells in the final volume of media to be used in the hydrogel Petri dish.\nRemove all solution from the hydrogel dish and replace with the cell-laden media.\nAllow the hydrogel to sit undisturbed in cell-laden media for 10 min.\nCarefully move the Petri dish to an incubator. Maintain the cells in the incubator for 4 h or until the cells are visibly adhered.\nReplace the cell-laden media with cell-free media to remove unadhered cells.\nAcquiring images of cells and the fiducial markers\nSet the temperature for the incubation chamber on the microscope to 37 °C and CO2 to 5% and allow the chamber to reach the set points.\nPlace the Petri dish on the sample holder and locate the patterned areas.\nLocate a cell of interest (COI) and acquire a transmitted or fluorescent image of the COI.\n\t\tNOTE: This image will be used to segment the cell boundary during analysis, so the image should clearly visualize the cell boarders.\nAcquire a z-stack of the patterned array beneath the COI as in step 4.1.4.\nAcquire a second set of transmitted or fluorescent images of the cell.\n\t\tNOTE: Compare the second image set to the first to determine if cell damage due to phototoxicity is observed and whether the image acquisition settings need to be adjusted. Cells which shrink after exposure have likely suffered significant phototoxic effects, which may affect results.\nRepeat steps 5.2.3-5.2.5 for each COI.\n6. Analyzing the Images\nPreparation of the image files for analysis",
    "Using data collected in step 5.2, prepare a cropped image stack of the area around a COI such that the bottom image (first image) of the stack represents the first frame where: (1) >80% of the patterned marker columns are visible, (2) the uppermost image (last image) in the stack no longer contains any visible fiducial markers (i.e., above the hydrogel surface), and (3) there is at least 20 μm of non-stressed fiducial markers surrounding the COI.\n\t\tNOTE: Cropping the images greatly reduces computational time during analysis. The analysis code in later steps can be run without cropping the images but this is not recommended.\nCreate a cropped image of the transmitted and/or fluorescent image to match the XY cropping of the stack in the previous step.\nUse either the cropped transmitted or fluorescent image—whichever is more representative of the cell shape—to segment the image by hand (trace the cell border) or via image processing tools.\nConvert this image into a binary image where the interior of the cell is black (i.e., intensity = 0) and the area surrounding the cell is white (i.e., intensity ≠ 0). Save this image as Binary Mask.tif.\nFor each COI, collect the image stack file, transmitted image file, and binary mask file in a single folder.\nRunning analysis scripts on the images\nClone or download the TFM analysis functions available free at the software repository29. The entire repository should be downloaded as there are a significant number of dependencies in the subfolders.\nOpen Matlab and add the directory and all subfolders of the local clone of the code repository to the path.\nSet the directory within the Matlab workspace to the folder location where the prepared images in step 6.1 were stored.",
    "Open and run the tracking.m script. When prompted, follow the instructions to load the appropriate images, perform initial pre-processing steps, and error-check the object tracking algorithm.\nOnce the script has completed, open and run the dispShear.m function. This script should not require input from the user.\nOnce the dispShear.m script has completed, open and run disp3D.m. If prompted to open any images, follow the instructions.\n\t\tNOTE: During runtime, the script may ask the user to draw a line on an image of the patterned array. This line should represent the primary motion axis of the scanning laser during patterning and should line-up with a row of patterned fiducial markers. This process instructs the code as to which direction (i.e., rows or columns of fiducial markers) likely yields the most aligned rows of fiducial markers.\nOnce the dispShear.m code has completed, run the dispSurface.m code followed by the interpFinal3D_2.m code. These scripts should not require inputs from the user.\n\t\tNOTE: The interpFinal3D_2.m script converts displacement data into surface tractions using software obtained externally, which has been previously described31. To apply these external functions, the interpFinal3D_2.m interpolates displacement data into uniform grids to serve as inputs for the conversion functions. If using a different conversion method, or if tractions are not needed, this step can be skipped.\nOnce all scripts have been run, ensure all data and outputs can be found in the initial directory.\nRepeat steps 6.2.3 – 6.2.8 for each COI.\n\t\tNOTE: Within the code repository, there is a folder containing scripts that allow automatic batch running of each of the scripts on a list of directories. Refer to the automation scripts themselves (i.e., comments within the code) for instructions on how to use them.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}