{
  "id": 5830,
  "origin_website": "Bio",
  "title": "Monitoring the Targeting of Cathepsin D to the Lysosome  by Metabolic Labeling and Pulse-chase Analysis",
  "procedures": [
    "Radioactive pulse-chasePlate 5 x 105 HeLa CCL-2 cells/well (6-well plate) in 2 ml of complete DMEM and incubate for 24 h/37 °C/5% CO2 (Figure 1). Use one well for each time-point or condition.Tilt plate and aspirate media, wash cells twice with 1 ml pre-warmed (room temperature) PBS.Incubate the cells with 700 µl pre-warmed (37 °C) pulse medium (-Cys/-Met; supplemented with 10 µl/ml 100x L-glutamine, see Recipes) for 30 min/37 °C/5% CO2. Remember to check your local radiation safety guidelines. From this step on, the waste has to be collected separately and discarded according to your local safety guidelines.Transfer the plate to an ice bucket covered with aluminum foil.Remove the medium and add 700 µl/well ice-cold pulse medium (+Cys 35S/+Met 35S).Incubate for 15 min/37 °C/5% CO2.The length of time for pulse depends on the rate of catD biosynthesis, which may vary according to the cell line. For HeLa cells, 15 min/37 °C is adequate. For other cell lines, the user may have to optimize the time of the pulse. Transfer the plate to an ice bucket covered with aluminum foil.Tilt plate and aspirate media, wash cells twice with 1 ml ice-cold PBS.Add 800 µl pre-warmed (37 °C) chase medium (see Recipes). Incubate the cells for 5 h/37 °C/5% CO2.Transfer the plate to an ice bucket covered with aluminum foil.Transfer the culture media (hereafter called ‘Media’ sample) to micro-centrifuge tubes and place them on ice.Wash the cells twice with 1 ml ice-cold PBS. Remove PBS and add 800 µl ice-cold lysis buffer/well (supplemented with 1:100 protease inhibitor cocktail fleshly prior to use, see Recipes). Transfer the plate to an ice bucket and incubate for 15 min under gentle agitation on a titer plate shaker.After 15 min.",
    "incubation, gently homogenize the cell lysates (hereafter called ‘Cell lysate’ sample) on each well using a micropipette tip and transfer the lysates to micro-centrifuge tubes.Centrifuge the samples (Cell lysate or Media, see steps A12 and A16) for 20 min at 18,000 x g (or for 30 min at 14,000 x g) 4 °C.Transfer equal volume of cleared supernatant (~750 µl) from the tubes (cleared Cell lysate or Media samples) to new micro-centrifuge tubes, put them on ice and discard the pellets.Carryover of sedimented material into the immunoprecipitation steps may result in high nonspecific background.If necessary, the cleared Cell lysate and Media samples can be frozen at -80 °C until used for immunoprecipitation. However, it is preferable to harvest cells (from step A13) and freeze the cell pellet rather than the cell lysate (step A17) to avoid protein degradation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171031/20171031230815_4944.jpgFigure 1. Schematic overview illustrating the metabolic labeling and pulse-chase analysis of Cathepsin DImmunoprecipitationWash beads (30 μl of 50% Protein-A Ultralink resin/aqueous slurry per chase-time/condition point) 3 times with 500 μl of ice-cold PBS by centrifugation for 1 min at 3,000 x g, 4 °C (Figure 1). This step removes the aqueous slurry containing 0.02% sodium azide supplied with the beads, which might interfere with the antibody binding. Make sure to leave the initial volume of beads/slurry in the tube (~30 μl per chase-time/condition point).For large amounts of beads (more than 500 μl), a 15 ml conical polystyrene centrifuge tube may be used and washes are done with at least 1:3 volume of beads-slurry/PBS.It is important to start with around 10-20% extra volume of beads to compensate for loss during the wash and pipetting.",
    "After washing, resuspend 30 μl of beads (in 50% PBS slurry) in 500 μl of ice-cold PBS containing 5 μl of 10% (v/v) BSA and 2 μl Cathepsin D antibody. Mix the suspension thoroughly. When working with multiple samples, it is recommended to prepare a beads/antibody ‘master mix’. This is done by increasing the quantities indicated above proportionally to the number of samples, and incubating the suspension in a 15 ml conical polystyrene centrifuge tube.Incubate for 2-3 h/4 °C under slow rotation on a tube rotator (capable of end-over-end inversion). During this step, the antibody will bind to the beads.Pellet the beads by centrifugation for 1 min at 3,000 x g, 4 °C and remove the supernatant. Wash the beads 3 times with 1 ml ice-cold lysis buffer by repeating step B4. After the final washing step, centrifuge the tubes containing the beads and remove the supernatant making sure to leave the initial volume of beads/slurry in the tube (~30 μl per chase-time/condition point). For each immunoprecipitation sample, incubate in a microcentrifuge tube: 30 μl beads/antibody (50% PBS slurry), 750 µl of cleared Cell lysate or Media, sample, 10 μl 10% BSA and 200 μl lysis buffer (supplemented with 1:100 protease inhibitor cocktail).Incubate for 2-3 h/4 °C under slow rotation on a tube rotator.After the incubation step, centrifuge the tubes, remove the supernatant and wash the beads 3 times each with 1 ml wash buffer (see Recipes) and one final wash step with 1 ml 1x PBS. Remove all PBS from the microcentrifuge tubes and resuspend the beads in 20 µl of 2x sample buffer (see Recipes). At this point, samples can be stored at -80 °C.SDS-PAGE and fluorographyBoil the samples for 5 min/95 °C.Spin the tubes and load the supernatant onto SDS-PAGE mini-gels (10%; 1 mm gels).",
    "Here you can also load a molecular weight standard on the gel.Run the electrophoresis for ~2 h at constant 120 V in running buffer (see Recipes). Note that running conditions and time will vary according to the electrophoresis system used.Fix gels with 25 ml/gel fixation solution (see Recipes) for 30 min at room temperature in a clean plastic container on titer plate shaker with slow shaking.Remove the fixation solution and incubate the gel with 25 ml/gel amplify fluorographic reagent for 30 min at room temperature on titer plate shaker with slow rotation.Dry gels onto chromatography paper in a gel dryer for 45 min/80 °C. Cover the gel with a plastic wrap to avoid sticking to the gel drier cover. The gel must be fully dehydrated (no longer sticky), 45 min at 80 °C is generally enough.Expose the BAS storage phosphor screen to the dried gel in an exposure cassette for generally 1 week at room temperature, protected from the light. The ideal exposure time will depend on the amount of labeled catD.Scan the screen using the Pharos FX plus molecular imager or equivalent and analyze the result by using the Quantity One 1-D Analysis Software (Bio-Rad Laboratories)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}