{
  "id": 18782,
  "origin_website": "Jove",
  "title": "Vascular Gene Transfer from Metallic Stent Surfaces Using Adenoviral Vectors Tethered through Hydrolysable Cross-linkers",
  "procedures": [
    "1. Preparation of Cy3-labeled Adenovirus for the Release Experiments\nSuspend 2 x 1012 particles of Adempty (approximately 2 x 1011 infective units) in 650 µl of carbonate/bicarbonate buffer (CBB; pH 9.3).\nDissolve the content of 1 vial (0.2 mg) of amine-reactive fluorescent dye (Cy3(NHS)2) in 1 ml CBB to a final concentration of 0.2 mg/ml.\nAdd 100 µl of the dye solution to virus suspension, vortex for 5 sec and incubate for 1 hr at 28 °C with shaking (100-200 rpm).\nEquilibrate a 20 ml Sepharose 6B column with PBS. Add 750 µl of Cy3-labeled Ad suspension drop-wise to the center of the gel bed.\nAfter viral suspension permeates the resin, add 5 ml of PBS. Discard the eluate.\nAdd 0.5 ml of PBS and collect the eluate in a labeled glass container. Repeat this step 10x collecting a total of ten 0.5 ml fractions.\nAssay the collected fractions by spectrophotometry (260 and 280 nm) for viral DNA content.\nPool the fractions containing more than 10% of total (sum of F1 through F10) optical density (OD) at 260 nm. Note: Typically the fractions F3, F4, F5, and F6 are pooled and mixed.\nRe-assay the mixed pooled fractions by spectrophotometry (260 and 280 nm) and assay by fluorometry (550ex/570em nm) for viral DNA content and Cy3 labeled capsid protein, respectively. Note: A Cy3(NHS)2 calibration curve covering the 10-9-10-13 mol/L range is prepared and fluorimetrically assayed on the same plate as the pooled fractions.",
    "Calculate the labeled virus yield and labeling density. Assume that 1.19 x 1012 virus particles/ml corresponds to 1 OD unit for a 1 cm path length29. Use the formula: Yield = [(OD260nm/1.19)*1012*V/input Ad amount]*100, where, OD260nm is the optical density of the pooled formulation at 260 nm and V is the volume of the pooled formulation (ml) to calculate Ad recovery yield (%). Use the formula: Labeling Density=C*6.02*1023/(OD260nm/1.19)*1012, where C is Cy3 concentration of the pooled formulation (moles/ml) and OD260nm is the optical density of the pooled formulation at 260 nm to calculate average Cy3 labeling density . NOTE: A typical recovery of labeled virus is >70% of the input dose. The labeling density is 600-800 fluorophore molecules per single virus particle.\nAliquot Cy3-labeled Adempty into smaller portions (typically 5 x 1011 particles) suitable for the individual release experiments. NOTE: Current protocol specifies the use of Cy3-labeled Ad solely in the release experiment. All transduction studies are carried out with non-labeled vectors.\n2. Activation of Metal Samples\nWash the stainless steel mesh disks or stainless steel stents consecutively in isopropanol (5 min x 2) and chloroform (5 min x 2) at 55 °C with shaking (100 rpm). Remove the solvent.\nHeat the samples for 30 min at 200 °C.\nDissolve polyallylamine bisphosphonate with installed latent thiol groups (PABT27,28,30) in water (1-2% w/v) at 72 °C with shaking (100 rpm). Adjust pH to 4.5-5 with KHCO3.\nIncubate metal samples in the PABT solution for 2-4 hr at 72 °C with shaking (100-200 rpm). NOTE: The procedure may be paused at this point. The samples are stable for 3 days at 4 °C.\nRinse the samples thrice with double distilled water (DDW).",
    "Expose the samples to tris(2-carboxyethyl) phosphine (TCEP; 15 mg/ml in 0.1 M acetic buffer) for 15 min at 28 °C with shaking (100-200 rpm).\nRinse 5x in degassed DDW.\nExpose the samples to 2% polyethyleneimine with installed pyridyldithio groups (PEIPDT27,28,30) in degassed DDW in an argon atmosphere for 2 hr at 28 °C with shaking (100-200 rpm). NOTE: The procedure may be paused at this point. The samples are stable for 2 weeks at 4 °C.\nRinse the samples three times with DDW.\nExpose the samples to 10 mg/ml dithiothreitol/DDW to convert pyridyldithio groups to thiols.\nRinse 5x again in degassed DDW.\n3. Adenovirus Activation and Metal Surface Immobilization\nSuspend 5 x 1011 particles of either AdeGFP or AdLuc (approximately 5 x 1010 infective units) in 487.5-495 µl of carbonate/bicarbonate buffer (CBB; pH 9.3). Note: For the release studies, use 5 x 1011 of Cy3 labeled Adempty particles (adjust volume to 487.5-495 µl with CBB).\nDissolve HC with varying hydrolysis rates28 [(rapidly (t1/2 = 5 d), intermediately (t1/2 = 12 d) and slowly (t1/2 = 50 d) HC, i.e. RHC, IHC or SHC; Figure 1] or non-hydrolysable cross-linker (NHC), sulfo-LC-SPDP in CBB at 20 mM.\nImmediately add 5-12.5 µl of cross-linker solution to the virus suspension for a total volume of 500 µl (200-500 µM final concentration of cross-linker), vortex and incubate for 1 hr at 28 °C with shaking (100-200 rpm).\nEquilibrate a 20 ml Sepharose 6B column with degassed 5 mM EDTA/PBS (EPBS). Add dropwise 500 µl of cross-linker-modified Ad suspension to the center of the resin bed.\nAdd 5 ml of degassed EPBS. Discard the eluate.\nAdd 0.5 ml of degassed EPBS and collect the eluate in a labeled glass container. Repeat this step 10 times collecting a total of ten 0.5-ml fractions.",
    "Determine OD of the collected fractions using spectrophotometry at 260 and 280 nm and convert OD to virus titers (1.19 x 1012/ml corresponds to 1 OD)29.\nPool the fractions containing >10% of the eluted virus (Note: Typically, the fractions F3-F6). Repeat the spectrophotometric titer assay for the pooled suspension.\nTransfer viral suspension to the vial with the activated metal samples (as per 2.11). Incubate in an argon atmosphere for 1 hr at 28 °C with shaking (100-200 rpm). Note: The Ad-tethered metal samples obtained in this step are further used in the subsequent release and transduction experiments described in the protocol sections 5-7.\n4. Quantification of Surface-associated Ad Vector by PCR\nPrepare meshes formulated with surface-immobilized AdeGFP tethered via NHC, SHC, IHC and RHC (n=3 for each type) as described in sections 2 and 3.\nUse a QIAamp DNA Micro kit to isolate viral DNA. Place the meshes individually into 1.5-ml plastic tubes containing 200 µl of mixture composed of 180 µl of ATL buffer and 20 µl of proteinase K (both from the kit). Add known amount of AdeGFP particles (as standards for the calibration curve) into the separate tubes containing the same mixture. Incubate at 56 °C overnight without shaking.\nAdd 200 µl of AL buffer (from the kit), mix by vortexing, add 200 µl of 100% ethanol, and incubate at room temperature for 5 min.\nTransfer the mixture from each tube onto an individual MinElite column (from the kit) and spin at 8,000 rpm for 1 min. Rinse the mesh-containing tubes with 180 µl of fresh ALT buffer, add onto respective columns and spin at 8,000 rpm for 1 min. Discard the eluates.\nAdd 500 µl of AW1 buffer (from the kit) into the columns and spin at 8,000 rpm for 1 min. Discard the eluates.",
    "Add 500 µl of AW2 buffer (from the kit) into the columns and spin at 8,000 rpm for 1 min.\nDiscard the eluates.\nSpin at 14,000 rpm for an additional 3 min until the columns are completely dry. Discard the eluates.\nAdd 50 µl of MilliQ-grade water into the columns. Spin at 14,000 rpm for 5 min. Collect 50 µl of eluate from each column into individual collection tube (from the kit).\nPrepare PCR Master Mix solution by combining multiplies of the following (12.5 µl of Power Sybr Green PCR Master Mix, 0.63 µl of 10 µM eGFP sense primer [5’- ACG TAA ACG GCC ACA AGT TC -3’], 0.63 µl of 10 µM eGFP anti-sense primer [5’- AAG TCG TGC TGC TTC ATG TG -3’], 6.3 µl of MilliQ-grade water). Multiply these volumes by the number of planned reactions including “no DNA” controls.\nLoad 5 µl of AdeGFP DNA (from step 4.8) and 20 µl of PCR Master Mix into triplicate wells of a MicroAmp Optical 96-well Reaction plate. Seal the plate with MicroAmp Optical Adhesive Film. Spin the plate at 1,000 rpm for 1 min to eliminate air bubbles.\nPlace the plate into the receptacle of a 7500 Real-Time PCR engine. In the main menu of the 7500 System SDS Software (v1.4 or higher) select “Create new experiment”. Click “next”. In the “New experiment wizard” screen choose Sybr Green from a scroll-down menu and click “add”. Click “next” to get a layout of the plate. Highlight all wells to be analyzed, select Sybr Green. Highlight consecutively no DNA control wells, AdeGFP DNA standards and unknowns, and mark them using respective designations from the scroll-down menu.\nSwitch to the instrument tab. Select “add dissociation phase”, change the well volume from default 50 µl to 25 µl. Click start.",
    "Analyze PCR results using after checking the QC summary for outliers and other irregularities.\n5. Release Kinetics of Hydrolysable Cross-linker-tethered Vector Particles from the Model Steel Mesh\nWash the mesh samples derivatized with Cy3-labeled Ad via RHC, IHC, SHC and NHC (as per 3.9) in 1% BSA/PBS (1 hr x 3) with shaking (100-200 rpm).\nUsing sterile fine forceps, place the meshes into individual wells of a 96-well plate prefilled with 200 µl of elution buffer (0.1% BSA/0.1% Tween-20/PBS).\nTake fluorescent images of a central part of each mesh. Record the settings of the microscope and the CCD camera used for image acquisition.\nAssay the plate fluorimetrically (550ex/570em) in well-scan mode with maximum reduction. Use the wells with non-derivatized meshes as a background control.\nIncubate the plate at 37 °C with shaking (50 rpm).\nAt predetermined times (1-30 days range) aspirate the elution buffer without disturbing the meshes and add 200 µl of fresh elution buffer. Repeat steps 4.3-4.5 after replacing the buffer.\n6. Transduction of Cultured Cells by Mesh-immobilized Ad Vectors\nWash the AdeGFP- or AdLuc-derivatized meshes thrice with sterile PBS for 5 min with shaking (100 rpm).\nUsing fine sterile forceps remove the mesh disks one by one and individually place them into the wells of a 96-well plate with the cell type of interest in the log phase of growth.\nIncubate the cells for 24 hr at 37 °C, in 5% CO2.\nUse the respective non-terminal endpoint assay (fluorescent microscopy, fluorometry for eGFP or bioluminescence imaging for luciferase) to determine the extent and the spatial distribution of gene expression in the wells.",
    "Optionally, substitute medium for PBS to increase sensitivity of the fluorometry assay (485/535 nm) if low eGFP expression is expected. Note: If a fluorometer is equipped with well-scan capability, read the plate in a well-scan mode to assess the spatial distribution of eGFP-expressing cells in the wells. Exchange PBS for medium after completing fluorometry.\nImage the transduced cells in the wells with AdeGFP-eluting meshes (both underlying and outlying the mesh) using the FITC filter set. Take representative images at 40-200X magnification. Record the exact settings of the fluorescent microscope and the CCD camera used for the acquisition of images.\nAdd 5 µl of luciferin stock in PBS (10 mg/ml) directly to wells with AdLuc-eluting meshes to a final concentration of 500 µg/ml and incubate at 37 °C and 5% CO2 for 10 min prior to bioluminescence imaging. Aspirate media and replace with luciferin-free media after imaging.\nRepeat endpoint assays at predetermined times (up to 2 weeks) to study the kinetics of reporter gene expression following substrate-mediated gene transfer.\n7. Validation of Preserved Transduction Capacity at Delayed Time Points\nPrepare the AdeGFP derivatized meshes using RHC, IHC, SHC and NHC for vector tethering (as per 2.1-2.11 and 3.1-3.9) and individually place the meshes in the wells of a 96-well plate with 60-80% confluent bovine aortic endothelial cells (BAEC).\nAnalyze transduction of cultured BAEC with mesh-immobilized AdeGFP at 1 and 2 days post-mesh placement using fluorescence microscopy and fluorometry (as per 6.4-6.5).\n48 hr after commencement of transduction wash the mesh-containing wells with PBS twice.\nAdd 200 µl of 0.25% trypsin/EDTA to each well and incubate for 15 min at 37 °C with shaking (100 rpm). Wash 3x with PBS.\nUse fluorescent microscopy and fluorometry to ascertain complete removal of all eGFP-positive cells associated with the meshes.",
    "Seed freshly passaged BAEC into the wells with partially released meshes at a 60-80% initial seeding density (2-2.7 x 104 cells/well).\nIncubate the plate at 37 °C and 5% CO2 for predetermined periods of time (1-10 days) prior to assessment of “new” transduction events by fluorescent microscopy and fluorometry.\n8. Ad-eluting Stent Deployment in the Rat Carotid Model of Stent Angioplasty\nAll animal procedures described in this protocol conform to Federal regulations on laboratory animal use and were approved by the IACUC of the Children’s Hospital of Philadelphia. To adhere to aseptic surgical conditions all instruments are autoclave sterilized. To assure continuous sterility a bead sterilizer is employed between use of the instruments in up to five consecutive animals.\nPrepare AdLuc-eluting stents according to 2.1-2.11 and 3.1-3.9. Store the virus-derivatized stents in sterile PBS at 4 °C for no longer than 24 hr prior to use.\nAnesthetize male Sprague-Dawley rats (400-450 g) with IP injection of ketamine (100 mg/kg), and xylazine (5 mg/kg). Determine the depth of anesthesia by paw pinch response and muscle tonus. Apply ophthalmic vet ointment to prevent dryness of cornea and sclera. Note: The inhalation anesthesia with 4% and 2% isoflurane (1 L/min) for inducing and maintaining anesthesia, respectively, is possible but impedes free access to the neck region of the animal and thus is not recommended for an inexperienced user.",
    "Reassess depth of anesthesia by toe pinch. Shave and aseptically prep neck and upper chest region. Administer antibiotic (cefazolin; 20 mg/kg; IM), analgesic (meloxicam; 0.5 mg/kg; SC) and saline (10 ml/kg; SC). Catheterize the tail vein with a 24 G catheter and administer heparin (200 IU/kg; IV). Note: A dose of 10 mg/kg (IM) enrofloxacin (Baytril) can be used instead of cefazolin. Avoid use of antibiotics lacking significant activity against Gram-positive bacteria. 10-15 mg/kg carprofen (Rimadyl) may be used instead of meloxicam as a preemptive analgesic. Narcotic analgesics (e.g., morphine, buprenorphine) should be avoided because of their respiration-depressing properties.\nPerform a midline incision through the skin and neck fascia. Use blunt dissection techniques to isolate the left external carotid artery. Tie-off the external carotid artery at the most distal approachable site. Apply a sliding temporary ligature to the origin of the internal carotid artery.\nMake a 2-mm arteriotomy incision in the left external carotid artery.\nInsert a 2-French Fogarty catheter into the common carotid artery through the incision in the external carotid artery. Inflate the tip of catheter with saline and pass 3x from the aortic arch to the carotid bifurcation in order to denude the endothelium.\nSlide a piece of tubing (1.04 mm OD, 0.99 mm ID) over the Fogarty catheter and into the common carotid artery. Withdraw the Fogarty catheter.\nMount and crimp an AdLuc-derivatized stent over the balloon of a 1.5 mm diameter angioplasty catheter. Insert the stent through the Teflon tubing and advance it into the mid-section of the common carotid artery. Avoid rubbing the stent against the tube or vessel wall.\nDeploy the stent at 12 atm for 30 sec and withdraw the angioplasty catheter.\nTie-off the external carotid artery proximal to the arteriotomy site and release the temporary ligature on the internal carotid artery.",
    "Repair the operative wound in layers with running 4.0 Vicryl suture and staple the skin.\nRecover the animal on a warming pad until ambulatory and return to its isolated cage. While no signs of pain or discomfort are typically exhibited by the post-operative animals beyond the first 12 hr after the procedure, consider extension of meloxicam  therapy (0.5 mg/kg, SC daily) for 72 hr.\n9. Bioluminescence Imaging of Arterial Gene Expression\nAt predetermined time points (1 day – 3 weeks range) after gene-eluting stent deployment in the common carotid artery, anesthetize the rat using isoflurane inhalation anesthesia (2-4% isoflurane in oxygen).\nRemove the surgical staples, aseptically prepare the site and reopen the operative wound. Using blunt dissection, re-gain access to the left common carotid artery and separate it from the vagus nerve and adjacent connective tissue.\nPrepare a mixture of 50 mg/ml Luciferin in PBS and 25% Pluronic F-127 in PBS (1:4 v/v) and store it on ice. Note: This formulation presents as a viscous solution at 4 °C and immediately turns to gel upon contact with tissue at 37 °C.\nApply 200 µl of a chilled Luciferin/Pluronic mixture directly to the exposed segment of the common carotid artery and verify gel solidity.\nPlace the animal in the supine position in the imaging chamber of the IVIS-Spectrum apparatus and maintain isoflurane anesthesia with a face mask.\nIn the acquisition control panel window (Living Image, version 4.2 or higher) choose the position “B” (6.6 cm camera to object distance) and binning factor “medium” from the dropdown menus entitled “field of view” and “binning”, respectively. Type in “2.5 cm” in the subject height box. Choose “min” as a unit of time in the “exposure time” box, and choose a numerical value of “2”.",
    "Three min after application of the Luciferin/Pluronic gel, start image acquisition by clicking the “Acquire” button on the screen. NOTE: Image acquisition time can vary from 1 to 6 min depending on the anticipated signal strength.\nAfter acquiring the image, wash the gel off with saline and dab the periarterial space with sterile gauze and cotton applicators.\nClose the wound with Vicryl suture and staple the skin.\nRecover the animal and return to its cage. Repeat imaging at later time points to study the time course of arterial expression brought about by the stent-immobilized Ad vectors.\nAlternatively, perform imaging following a systemic administration of luciferin. Anesthetize and prep the animal as per 9.1-9.2. Catheterize the tail vein with a 24 G catheter and secure catheter with surgical tape.\nPrepare a solution of luciferin in PBS (50 mg/ml) and inject 1 ml of the solution through the catheter over a 10 sec interval. One min after injection start image acquisition as per 9.7-9.8. Note: A faster injection rate (<10 sec) can provoke seizure activity and respiratory arrest. The animal must be euthanized if seizures or respiratory arrest occur during imaging.\nFollow step 9.10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}