{
  "id": 3190,
  "origin_website": "Cell",
  "title": "A protocol for visualization of murine in situ neurovascular interfaces",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPerfusion\nTiming: 45 min\n      This section provides stepwise instructions to catheterize the abdominal\n      vessels of the mouse and to terminally cast and visualize the intracranial\n      vasculature with polymer mixture.\n    \n        Positioning and exposure of the vasculature to be catheterized.\n        \n            Position the mouse supine on a surgical board and secure all four\n            limbs with tape.\n          \n            Under microscopic visualization, perform a midline abdominal\n            incision with a #10 or #15 scalpel extending to the xyphoid process.\n          \n            Using a hemostat, secure the xyphoid process.\n            \nOptional: If access to the\n              abdominal aorta and inferior vena cava (IVC) is limited and\n              greater exposure is therefore needed, incise the diaphragm and rib\n              cage bilaterally inferior to the internal thoracic arteries. The\n              anterior chest wall can then be elevated to expose the thoracic\n              cavity.\n            \n            Identify and secure the IVC, close to the diaphragm, with a 7-0 silk\n            suture. Place an additional loose suture around the IVC, proximal to\n            the heart.\n          \n            Make an incision in one wall of the IVC in between the two placed\n            sutures.\n          \n            Similarly, place two loose sutures around either the exposed\n            abdominal or thoracic aorta and make a small incision distal to\n            those sutures (Figure 2[href=https://www.wicell.org#fig2]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2762-Fig2.jpg\n                  Figure 2. Catheterization for perfusion and casting\n                \n                  (A) Gross photograph of the aorta (Ao) and\n                  inferior vena cava (IVC) following exposure and\n                  catheterization. The catheter is secured with suture. The IVC,\n                  which has not yet been incised to allow outflow of perfused\n                  solutions, has a loose suture placed, which is later secured\n                  when perfusion is complete. (B) Photograph of\n                  the Ao and IVC following catheterization under the dissecting\n                  microscope at 0.63× magnification. Scale bar = 1000 microns.\n                \n            If not previously prepared, fill a 10 mL syringe with 10−4\n            M sodium nitroprusside in a phosphate-buffered saline (PBS).",
    "Connect the 10 mL syringe to a 30G needle.\n            Fasten the syringe with the needle to a catheter made of 15 cm of\n            polyethylene-10 (PE-10) tubing.\n          \n            Expel air bubbles from the tubing connected to the syringe by\n            flushing the catheter.\n          \n            Insert the PE-10 catheter into the incision previously made in the\n            aorta.\n          \nAdvance the catheter beyond the sutures and secure.\n        Perfuse the sample.\n        \n            Begin perfusing the vasculature with sodium nitroprusside solution\n            to remove blood and achieve maximal vessel dilation.\n            Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\n            \n                Continue until perfusate exiting the IVC is clear, approximately\n                10 min.\n              \nLeave the catheter in place once complete.\n            Prepare a 5 mL mixture of Microfil® silicate polymer as follows: 2\n            to 7 to 1 ratio of Microfil® to diluent to polymerizing agent.\n          \n            Remove the plunger from a 5 mL syringe and fill with the above\n            mixture. Replace the plunger, invert the syringe, and purge the\n            syringe of air.\n          \n            While being careful not to introduce air bubbles, disconnect the\n            10 mL syringe from the 30G needle and replace with the 5cc syringe\n            filled with Microfil®.\n          \n            Slowly perfuse until Microfil® can be seen exiting the IVC,\n            approximately 15 min from the start of perfusion.\n            Troubleshooting 2[href=https://www.wicell.org#troubleshooting] and\n            3[href=https://www.wicell.org#troubleshooting].\n            \n                Ligate the IVC by securing the suture circumferentially to stop\n                polymer outflow.\n              \n            Position the mouse prone.\n            \n                Tent the scalp and incise midline, exposing the skull from the\n                snout to the neck to the level of the galea aponeurotica, which\n                has many veins.\n              \nNote: Preservation of the galea prevents\n      small leaks from the venous system and still allows diploic veins and\n      dural venous sinuses to be appreciated through the thin murine skull (Figure 3[href=https://www.wicell.org#fig3]).\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2762-Fig3.jpg\n          Figure 3. Discerning the galea aponeurotica\n        \n          (A) Anatomic view of the top of the posterior aspect of the murine\n          skull centered over the craniocervical junction where the galea",
    "aponeurotica inserts into the occipitocervical fascia (arrowheads). A\n          reflection of the galea denotes its delicate transparent appearance as\n          it stretches anteriorly over the pericranium (asterisk).\n        \n          (B) Partial polymer filling of diploic veins (arrow) in a\n          galea-preserved specimen.\n        \n          (C) Division of the galea after complete polymer casting. The galea\n          (arrowheads) was lateralized on both sides for direct comparison of\n          vessel casting visualization with and without this additional layer.\n          With the galea preserved, visualization is decreased due to the\n          additional layer of tissue and increased light reflection, however,\n          small vessel leaks are minimized and hydration of the pericranium is\n          concomitantly preserved.\n        \n          (D) The galea is elevated from the murine skull and grasped with\n          forceps to demonstrate its tensile strength.\n          Abbreviations: A-Anterior; L-Left; R-Right; P-Posterior.\nNote: Blood within diploic veins, or\n      venous structures present between the boney layers of the skull, can be\n      seen as it is replaced with polymer. Continue to inject Microfil® until\n      all visible vascular structures are filled with polymer.\n    \nNote: Transgression of the galea\n      aponeurotica will afford a better view of the diploic veins but may\n      facilitate small vascular leaks which will decrease perfusion pressure and\n      possibly lead to incomplete vessel filling. To instead avoid disruption of\n      this tissue, and therefore small vessel leaks, incise above the galea\n      aponeurotica by maintaining dissection within the loose areolar plane\n      containing the fatty scalp tissue only. This step is dependent on operator\n      ability. We recommend keeping the galea intact, however, if it is divided,\n      it will not significantly impact terminal vessel casting.\n    \nOptional: A syringe pump may be used\n      as an alternative to manually driving the Microfil®.\n    \nMicrofil® curing and sample fixation\nTiming: 25–37 h\n      This section provides stepwise instructions to cure the vascular casting\n      solution and to preserve the sample in preparation for iterative\n      processing and imaging.",
    "Allow the Microfil® to cure for approximately 60 min.\n        Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\n      \nNote: The mouse (sample) may be cured\n      using ice, dry ice, or at 4°C to prevent tissue decay to suit the needs of\n      downstream applications. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\n    \nNote: If utilizing dry ice for storage,\n      consider placement of samples on top of a cardboard barrier to prevent\n      direct contact of the sample with dry ice and therefore rapid ice\n      formation. Rapid freezing may create histologic artifacts.\n    \n        Fix the sample in a volume sufficient to immerse the entire mouse for\n        24–36 h at 20°C–22°C. or at 4°C using a fixative appropriate for\n        downstream applications.\n      \nNote: When immunohistochemistry is\n      anticipated, consider fixation in 4% paraformaldehyde using the same\n      parameters.\n    \nNote: When only cytomorphologic assessment\n      is anticipated, consider 24-h fixation in 10% formalin.\n    \nNote: Antigen retrieval may be performed\n      if needed when immunohistochemistry is performed on a sample that has been\n      fixed in formalin.\n    \n        Transfer samples into PBS, add 0.02% sodium azide, and store in 4°C\n        until imaging.\n      \nNote: Specimen storage duration is not\n      restricted as long as the fixative is appropriate and microbial growth can\n      be prevented. Imaging quality does not decrease with the duration of\n      storage, and samples can be reimaged at later dates if desired.\n    \nMicro-CT set-up\nTiming: 30–45 min\n    \n      This section provides stepwise instructions to set-up the micro-CT and\n      optimize its parameters for use at every stage of sample processing.\n    \n        Turn on the micro-CT and begin warming/aging of the X-ray source per\n        manufacturer instructions.\n      \n        Prepare and place the sample in an appropriate specimen holder, noting\n        the following:\n        \n            The orientation of the sample should be as symmetrical as possible\n            and perpendicular to the path of the X-ray beam to maintain similar\n            X-ray penetration depth throughout the scan rotation.\n          \n            The holder must 1.) be rigid and as radiolucent as possible, 2.)",
    "prevent sample movement and any changes in hydration status and 3.)\n            will ideally be no wider and/or longer than necessary to allow the\n            sample and air on each of its sides to be visible within the field\n            of view (FOV) along the path of the X-ray beam. Note: Parafilm can\n            be used instead of a tube with a top.\n          \n        Place sample in the scanner and determine appropriate settings based of\n        the X-ray absorption through the sample while looking at its\n        radiograph/scout and adjusting as needed.\n        \n            Pixel Size and Pixel Matrix: determine based on sample size, scanner\n            capabilities and study needs\n          \n            Filter Setting, X-ray Voltage (kV), Power (μA), Exposure Time (ms):\n            air should have the lowest absorbance, while the rest of the sample\n            should have an increase in absorption through each of its different\n            radio density characters throughout the sample (Figure 4[href=https://www.wicell.org#fig4]). The most radio dense areas will absorb while still allowing\n            sufficient beam penetration past these areas and through the\n            entirety of the sample.\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2762-Fig4.jpg\n                  Figure 4. Optimization of micro-CT parameters for iterative\n                  sample processing and imaging\n                \n                  (A) X-Ray projection image of murine head after vascular\n                  polymer casting and fixation but before decalcification and\n                  PTA immersion. The plot below shows the intensity profile of\n                  the above image at the pixels along the red line shown.\n                \n                  (B) A single coronal slice reconstructed from the micro-CT of\n                  the same sample after decalcification. The inset and plot on\n                  the right show the intensity profile of a small vessel\n                  indicated by the red line. Related to STAR Methods.\n                \n        Remove the sample and all materials from the FOV, allowing only air to\n        remain and obtain calibration images per manufacturer instructions at\n        the determined scan settings. This may include a bright image (X-ray on)\n        and dark image (X-ray off).\n      \nPlace sample within the FOV.",
    "Enter additional scan parameters as determined by your study needs:\n        \nScan Name.\nRotation Step.\nAveraging.\nRandom Movement/Dead Pixel Compensation.\nTotal Rotation (180º vs. 360º).\n        Turn on the X-ray source and allow the sample to reach a stable state.\n      \nBegin scanning.\nIterative processing and imaging\nTiming: 12–16 days\n    \nTiming: ∼12–24 h for step 15\n    \nTiming: ∼30–45 min for step 16\n    \nTiming: ∼3–5 days for step 17\n    \nTiming: ∼ 8–10 days for step 18\n    \n      This section provides stepwise instructions for iterative sample\n      processing and imaging of brain, bone, and vessels within the sample.\n    \nNote: If a scan with calcified bone and\n      polymer-perfused vasculature is desired, continue to the next step below.\n    \nNote: If only the polymer-perfused\n      vasculature without bone is desired, proceed directly to step 8.\n    \nNote: To add soft tissue visualization,\n      continue to step 9.\n    \n        Perform micro-CT on the sample.\n        \n            To prevent movement of the sample during image acquisition, secure\n            the sample in an appropriately fitted holder that fits within the\n            scanner FOV. Consider wrapping the sample in parafilm and securing\n            it in a trimmed 50 mL conical tube.\n          \n            Determine the optimal scanning parameters for your sample. Acquire\n            bright field.\n            \nNote: Time to scan the sample will\n              largely depend on the number of FOV sections required to capture\n              the entire sample. A partial volume scan will decrease the scan\n              time, but the sample must be centered; a micro-positioner\n              attachment can help.\n            \n            Check your scan settings, including the file names and output\n            location.\n          \n            Start the scan. Troubleshooting 6[href=https://www.wicell.org#troubleshooting].\n          \n            When the scan is complete, remove the sample, and return it to PBS.\n          \n        Reconstruction of raw data and preliminary visualization.\n        \nOpen images in NRecon.\n            Use the densest material, usually the enamel, to adjust the dynamic\n            range by setting the upper limit.\n            \n                Apply ring artifact reduction and beam hardening correction as\n                needed.",
    "Fine tune the alignment of each section of the scan.\n            Start the reconstruction.\n            \nNote: Maintain the same parameters\n              between the samples, including the beam hardening correction,\n              dynamic range, and smoothing parameters. Reconstruction time is\n              largely dependent on the number of sections contained in the scan,\n              image resolution, and computational power.\n            \nOptional: If desired, rotate\n              the reconstructed images in DataViewer® 2D/3D micro-CT Slice\n              Visualization (Bruker Software, Microphotonics, Allentown, PA) and\n              export the newly rotated reconstruction.\n            \n            SkyScan CTVox software (Microphotonics, Allentown, PA) or any other\n            software capable of viewing the image files may be used to generate\n            and view the volume rendered 3D images of each acquired image.\n            \n                Adjust parameters in the thresholding window to accentuate the\n                Microfil® and remove soft tissue.\n                \nNote: Preset transfer\n                  functions may be provided with the software package.\n                \nNote: Microfil® and bone tend\n                  to have similar attenuation and the skull may not be\n                  completely removed by adjusting thresholding parameters. To\n                  achieve radiolucency of bone, consider decalcification before\n                  scanning as follows in the next step.\n                  Troubleshooting 7[href=https://www.wicell.org#troubleshooting] and\n                  8[href=https://www.wicell.org#troubleshooting].\n                \n        Decalcification for radiolucent bones.\n        \nSeparate the head from the body.\n            Prepare a 10% HCl solution or similar strong acid.\n            \nNote: Weak acids may be used to\n              perform decalcification, but sample treatment time will vary to\n              achieve the optimal radiolucency.\n            \nTransfer skinned sample to a 50 mL conical tube.\nSubmerge the sample in acid solution.\nIncubate for 3 days at 20°C–22°C.with agitation.\n            Remove the head from the acid solution and rinse with deionized\n            water.\n          \nReturn the head to 1× PBS.\nRepeat steps 6 and 7.\n        Phosphotungstic acid (PTA) diffusion for soft tissue visualization.7[href=https://www.wicell.org#bib14],8[href=https://www.wicell.org#bib15]\nRemove the skin from the head of the mouse.\n            Submerge the sample into 1:40 (vol/vol) PTA:70% ethanol solution for\n            5–7 days based on sample size. Exchange PTA solution every 2–3 days.\n            \nOptional: Graduated ethanol",
    "dehydration, while not required, may be performed prior to\n              submerging the sample into PTA. If desired, the sample can\n              sequentially be submerged over 12 h in 30%, 50%, and 70%\n              ethanol.7[href=https://www.wicell.org#bib14] PTA is amphipathic, which means\n              that it is soluble in both organic and aqueous solvents. While\n              ethanol dehydration may introduce tissue shrinkage artifact, which\n              is accounted for in the deformable registration in the\n              Neurosimplicity Imaging Suite, PTA is less soluble in aqueous\n              solutions than organic solutions. Therefore, we recommend\n              immersion in PTA that has been dissolved in ethanol to improve PTA\n              diffusion.9[href=https://www.wicell.org#bib16] Ethanol dehydration should be\n              performed gradually to prevent tissue lysis.\n            \n            To evaluate if PTA has penetrated the center of the region of\n            interest completely, perform a quick, low-resolution scout scan.\n            \n                If the scout scan displays incomplete penetration of PTA, which\n                would be represented by absent attenuation in the center of the\n                sample, for example the brain, return the sample to PTA/ethanol\n                solution for an additional 1–2 days, then repeat the\n                low-resolution scan. Otherwise, perform the high-resolution scan\n                as described in step 6.\n                \nNote: New scan parameters will\n                  need to be optimized for the PTA sample. Scan power will need\n                  to be increased compared to previous scans, and a denser\n                  filter should be applied.\n                \nVisualization\nTiming: 12–24 h\n      This section provides stepwise instructions for processing of acquired\n      image data utilizing the Neurosimplicity Imaging Suite software.\n    \n        Process acquired imaging data with the Neurosimplicity Imaging Suite for\n        automatic deformable registration, feature extraction, and\n        visualization. Troubleshooting 9[href=https://www.wicell.org#troubleshooting] and\n        10[href=https://www.wicell.org#troubleshooting].\n      \nNote: If any of the iterative processing\n      steps were skipped or not completed and thus those scans were not\n      acquired, the imaging data acquired can still be processed by the\n      Neurosimplicity Imaging Suite for extraction of the relevant features,\n      i.e., visualization of vessels, brain, or bone."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms",
    "Systems Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}