{
  "id": 7336,
  "origin_website": "Bio",
  "title": "U2.3 Precursor Small Nuclear RNA <em>in vitro</em> Processing Assay",
  "procedures": [
    "Assemble pre-U2.3 templatesAdd the following to the PCR reaction:36.5 μl ddH2O10 μl 5× Phusion HF buffer1 μl 10 mM dNTP mix200 ng DNA of Arabidopsis 0.5 μl U2.3-RNA-F and U2.3-RNA-R primers (10 pmol/μl)0.5 μl High-Fidelity DNA PolymerasePerform PCR to generate pre-U2.3 fragment with the following cycles:98°C for 30 s to denature the DNA95°C for 10 s58°C for 30 s72°C for 15 sRepetition of PCR for 31 cycles72°C for 10 min4°C for storageElectrophorese PCR-generated DNA fragments in 1.5% agarose gel.Verify the pre-U2.3 (355 bp) fragment and purify PCR product from agarose gel using Gel Purification kit following manufacturer’s instructions.Cloning of the amplified PCR products to pCR-Blunt.6 μl purified pre-U2.3 PCR product1 μl pCR-Blunt vector2 μl 5× T4 DNA Ligase buffer1 μl T4 DNA LigaseIncubate the ligation reaction at room temperature for 10 min. Transform the construct into competent Escherichia coli. Extract the positive vector and confirm the pre-U2.3 fragment using singer sequencing.Assemble pre-U2.3 templates and fuse with T7 promoter and Ploy-G. Add the following to the reaction:74 μl ddH2O20 μl 5× Phusion HF buffer2 μl 10 mM dNTP mix1 μl pre-U2.3 pCR-Blunt vector (50 ng/μl)1 μl T7-U2.3-F and PolyG-U2.3-R primers (10 pmol/μl)1 μl High-Fidelity DNA PolymerasePerform PCR with the following cycles:98°C for 30 s to denature the DNA95°C for 10 s58°C for 30 s72°C for 15 sRepetition of PCR for 33 cycles72°C for 10 min4°C for storageLoad a small aliquot of PCR product (5 μl) in 1.5% agarose gel for checking the quality of PCR fragments. If the product contains a single band, the rest of the product (95 μl) can be purified directly using the PCR Extraction Kit without gel purification.Elute the PCR product in the final 50 μl DEPC water, used as in vitro transcription template.Synthesize pre-U2.3-polyG snRNA substratesIn vitro RNA transcription.",
    "Add the following to the reaction:22 μl DEPC water10 μl 5× Transcription Buffer (Ambion)2.5 μl NTPs (10 mM ATP, CTP, UTP, GTP)1 μl RNasin (Promega 40 units/μl)1 μl 1 M DTT5 μl Transcription Template (200 ng/μl)1 μl T7 RNA Polymerase (50 unit/μl)Incubate for 1 h at 37°CAdd 1 μl of DNase I (10 units/μl) and incubate for 15 min at 37°C.Add 50 μl 2× formamide loading buffer to the reaction solution, boil for 5 min, and load onto a pre-run 5% denaturing polyacrylamide gel containing 6 M urea. Separate RNAs at 20 mA/gel, ~1 h.After electrophoresis, visualize the PAGE gel with ethidium bromide and cut out the RNA bands directly with a clean razor blade. The gel slice is crushed into a fine slurry, which is soaked in the TE buffer. The slurry is then centrifuged and the supernatant recovered with a pipette. Polyacrylamide fragments carried over into the supernatant can be removed by filtration through a 0.2 mm filter.Add 3 M sodium acetate (pH 5.2) to a final concentration of 0.3 M and use 3 volumes of absolute ethanol to precipitate RNA. Pellet the RNA by centrifuging at 12,000 × g for 15 min.Wash small pellets with 75% ethanol to remove undesired salts.Dissolve the RNA substrates in 20 μl DEPC water.Radioactive labeling of RNA substrates. Add the following to the reaction:3 μl DEPC H2O20 μl RNA substrate3 µl T4 PNK Reaction Buffer (10×)1.5 µl T4 PNK1.5 μl RNasin (Promega 40 units/µl)1 µl [γ-32P]-ATPIncubate at 37°C for 30 min. Add 30 μl DEPC water (This volume can be varied if more or less pre-snRNA probe is desired).Unincorporated nucleotides are removed using a Sephadex G-25 quick spin column.Synthesize radioactive RNA markerTake 15 μl commercial RNA marker into Sephadex G-25 column to remove the salt and dye.",
    "For radioactive labeling of the RNA marker, add the following to the reaction:10 μl filtered RNA marker6 μl DEPC water2 µl T4 PNK Reaction Buffer (10×)1 µl T4 PNK1 µl [γ-32P]-ATPIncubate at 37°C for 30 minRemove unincorporated nucleotides using a Sephadex G-25 quick spin column.Prepare a dilution series of the labeled RNA marker (1:5, 1:15, 1:50, and 1:150). Drip 2 µl of series diluted marker and pre-U2.3-polyG RNA substrate onto the nylon membrane. Fix the RNAs spot to the membrane by cross linking using the UV crosslinker with a setting of 120,000 µJ cm-2.Place the plastic-wrapped nylon membrane on the storage phosphor imaging screen and expose for 8 h. The phosphor screen is then scanned with PhosphorImager.Dilute RNA marker using RNA loading buffer to same radiation level with pre-U2.3-polyG RNA substrate according to the radioactive signal of the series dilution spot.In vitro processing assay of pre-U2.3-polyG snRNACarefully grind 2 g inflorescence to fine powder in liquid N2 and pour the powder into 15 ml tube.Set the tube on ice, add 8 ml M1 buffer, and invert several times.Filter the solution through cell strainer (100 µM) into a 50 ml tube.Centrifuge at 12,000 × g for 10 min at 4°C.Discard the supernatant, add 4 ml M2 buffer, and mix by pipetting. Transfer the solution into a 5 ml tube. Wash with 3 ml M2 buffer and 3 ml M3 buffer, consecutively, each wash by spin 1 min at 13,200 × g. Remove all of the solution with a small tip pipette.Add 200 μl processing buffer (without creatine phosphate) to suspend the pellet.Take 10 μl nuclear protein into 190 μl Bradford reagent, let stand for 5 min, and measure the protein concentrations at 595 nm.Dilute the nuclear protein of each sample to 50 ng/μl using processing buffer (without creatine phosphate).",
    "For a total of 50 μl reaction volume for each repeat, incubate 40 μl of nuclear protein, 5 μl of labeled DNA, and 5 μl of 200 mM creatine phosphate stock solution (20 mM final concentration) at 30°C. (The number of repeats can be varied. We did four repeats here).Stop reaction by adding 450 μl TRIzol at various time points (we stopped at 10, 30, 60, and 90 min reaction time points). RNAs were extracted following the manufacturer’s instructions.Dissolve the RNA pellet in 10 μl DEPC water. Add 10 μl formamide loading buffer to the solution and boil for 5 min.Load half of the RNA extraction, as well as 0.5 μl pre-U2.3 substrate (used as input) and 5 μl RNA marker, onto a pre-run 6% denaturing polyacrylamide gel containing 6 M urea.Run at 120 V in 1× TBE until the loading dye reaches 2/3 of the gel length.Remove the gel from the electrophoresis apparatus after electrophoresis. Transfer gel onto plastic wrap carefully. Absorb solution with filter paper. Wrap the gel carefully using plastic wrap.Place the plastic-wrapped gel on the storage phosphor imaging screen and expose for 6-10 h. The phosphor screen is then scanned with the PhosphorImager.Export the image of the radioactive signal in the ‘tiff’ format (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4142/bioprotoc-11-17-4142-g001.jpgFigure 1. In vitro processing of pre-U2.3-polyG. In vitro transcribed pre-U2.3-polyG RNAs were processed in the nuclear protein extracts from Arabidopsis for various time points, as indicated at the top of the figure. After extraction, RNAs were resolved on a PAGE gel and detected with a PhosphorImager. The position of the pre-U2.3-polyG RNA is indicated by the grey arrow, while the processed mature snRNAs are indicated by the black arrow."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}