{
  "id": 9112,
  "origin_website": "Jove",
  "title": "Imaging Serotonergic Fibers in the Mouse Spinal Cord Using the CLARITY/CUBIC Technique",
  "procedures": [
    "Ethics Statement: All procedures involving animal subjects follow the guidelines of the Animal Care and Ethics Committee (ACEC) at The University of New South Wales (the approved ACEC number is 14/94A).\n1. Preparation of the Transparent Mouse Spinal Cord\nPreparation of Ice Cold Hydrogel Solution\n\t\nPreparation of 16% paraformaldehyde solution (PFA)\n\t\t\nAdd 16 g paraformaldehyde powder into 70 ml pre-warmed distilled water (50-55 °C) and stir on a heated magnetic stirrer until paraformaldehyde is dissolved. Note: Do not allow the solution to heat over 55 °C and be aware that paraformaldehyde is toxic.\nTransfer the paraformaldehyde solution to a cylinder and add distilled water to 100 ml. Cool the paraformaldehyde solution using a 4 °C refrigerator.\nDissolve 125 mg VA-044 initiator in 26.25 ml distilled water and cool the solution in a 4 °C fridge.\nCool 5 ml acrylamide solution (40%), 1.25 ml Bis solution (2%) (CAUTION: Bis and acrylamide solutions are toxic, may cause genetic defects or cancer), 5 ml 10x PBS, 12.5 ml 16% PFA solution, and the VA-044 initiator solution on ice.\nMix the above solutions on ice.\n\t\tNote: the total volume is 50 ml.\nPerfusion and Collection of the Mouse Spinal Cord\n\t\nAnaesthetize a mouse with an intraperitoneal injection of ketamine (80 mg/kg) and xyzaline (5 mg/kg) diluted in 0.9% normal saline.  The dosage for mouse can be lower than that for rats.\nOn a suitable plastic surface in a fume hood, fix the limbs of the mouse away from the body (sticky tape is effective) once the mouse does not respond to a pinch to its skin of the foot.\nCut the mouse skin over the chest and then the bone chest to expose the heart with a scissor.",
    "Using a peristaltic pump, with a 25 G needle attached to the end of the tubing, insert the needle into the left ventricle of the heart, snip the right atrium to create an exit point for the blood and then start washing with 40 ml 0.9% normal saline a rate of approximately 10 ml/min.\nWhen complete, perfuse the mouse with 35 ml ice cold hydrogel solution.\n\t\tNote: perfuse at a speed of 10 ml/min to avoid swelling of the nervous tissue.\nIncise the skin over the back with a blade and then remove the muscles next to the vertebrate. After cutting the vertebral arches on one side and flipping them to the other side, take the spinal cord out of the vertebral column with a fine scissor.\nClearing the Mouse Spinal Cord\n\t\nPlace the spinal cord in 15 ml of hydrogel solution overnight at 4 °C.\nRemove 10 ml of the hydrogel solution and pour the rest of the solution with the spinal cord segments to a 5 ml tube. Fill the 5 ml tube with the hydrogel solution until it is completely full.\nStretch a small piece of parafilm over the top of the 5 ml tube and then wrap parafilm around the neck of the tube. Note: Ensure the parafilm contacts the hydrogel solution and there are no bubbles between the hydrogel solution and the parafilm.\nPut the 5 ml tube in a 37 °C oven overnight. Observe the hydrogel solution till it becomes a gel.",
    "Take the 5 ml tube out of the oven and remove the gel from the tube with a spanner (such as a shoveled 1 ml pipette tip). Remove the gel from the spinal cord tissue by sticking the coarse tissue to the gel and then take the coarse tissue away (the gel will stick to the tissue and therefore will be removed by the tissue).\nAfter removing the gel from the spinal cord tissue, wash the spinal cord 4 times with 1x PBS (pH 7.4) for 24 hr on a shaker.\nPrepare the CUBIC clearing solution by dissolving 3.85 g urea and 3.85 g N,N,N',N'-tetrakis (2-hydroxypropyl) ethylenediamine in 5.38 ml distilled water.\n\t\tNote: A hot stirrer is used. Add 2.31 g polyethylene glycol mono-p-isooctylphenyl ether/Triton X-100 to the solution once it is clear and cools down to room temperature.\n\t\tNote: 10 g of these three chemicals are for one mouse.\nCut the mouse spinal cord coronally into 2-3 mm long segments with a razor blade and put them into 5 ml of the above CUBIC clearing solution. Place on a shaker in the oven at 37 °C for 3 days.\nThree days later, change the clearing solution to a fresh one. Note: the above solution is prepared prior to use.\nTwo to three days later after refreshing the CUBIC clearing solution, check the transparency of the tissue against a paper with font 8 letters. If it is transparent, the letters can be seen through the cleared tissue. Remove the clearing solution and add 4 ml of PBST (0.1% Triton-X100) to wash the tissue 4 times a day (every 6 hours).\n2. Immunofluorescence Staining",
    "Incubate the spinal cord segments in the primary antibody solution (anti-serotonin, raised in rabbit, diluted 1:100 in PBST) for 3 days on a shaker in a 37 °C oven.\nRemove the antibody solution and add 4 ml of PBST (0.1% Triton-X100) to wash the spinal cord segments 4 times a day (every 6 hr) in a 37 °C oven.\nRemove the PBST solution and add the secondary antibody solution (594 conjugated goat anti-rabbit IgG, diluted 1:100 in PBST) to incubate the tissue for 3 days on a shaker in a 37 °C oven.\nRemove the secondary antibody solution and add 4 ml of PBST to wash the spinal cord segments 4 times a day (every 6 hours) on a shaker in a 37 °C oven. The next day the tissue is ready for imaging.\n3. Imaging\nRemove the PBST solution and add 4 ml of 85% glycerol to make the refractive index of the tissue even.\nCheck the clarity of the tissue. Once it is clear in approximately 1 hr, put the tissue onto a large, thin glass slide which fits the holding frame of the multi-photo fluorescent microscope.\nPut a few drops of 85% glycerol next to the spinal cord tissue and coverslip it with a 22 x 50 mm2 coverslip glass.\n\tNote: The orientation of the spinal cord decides how the image looks like.\nPut the glass slide onto the holding frame of the multi-photon fluorescent microscope and move the tissue into the light pathway.\nChoose the Helium Neon laser line 594 nm and adjust the intensity of the laser to the optimal level by checking the brightness of the positive signal in the live image.",
    "Select the scanning area of the spinal cord tissue using the 20X objective (in water, NA 0.7) and prepare to create a z-stack, and the depth of each step set to 3 µm.\nScan the tissue from the top to the bottom of the z-stack under the 20X objective and then 63X objective (in oil, NA 1.4) (step size was 1 µm), respectively. Reconstruct 3D videos using a 3D software28.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}