{
  "id": 2207,
  "origin_website": "Cell",
  "title": "Protocol for high-throughput cloning, expression, purification, and evaluation of bispecific antibodies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCloning\nTiming: 1 week\nHigh-throughput cloning is performed in 5 sequential steps: Golden Gate Reaction, transformation, bacterial culture and DNA purification, sequencing verification, and DNA mixing.\nGolden Gate Reaction.\nResuspend synthesized DNA fragments (gBlocks) in deionized water to a final concentration of 5 ng/μL.\nDilute vector in deionized water to a final concentration of 5 ng/μL.\nSet up Golden Gate Reactions in 96-well PCR plates. Master mix can be prepared using the table in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section. Prepare enough master mix for 1.2× number of samples, to account for loss due to pipetting error.\nNote: Master mix is prepared and aliquoted into PCR plates using a multichannel pipette. Required gBlocks can be added using an automatic liquid handler (Tecan Freedom EVO, Boston Industries) following manufacturer’s instructions[href=https://www.tecan.com/knowledge-portal/freedom-evo-operating-manuals].\nNote: Positive and negative controls are not routinely used for Golden Gate cloning. However, these controls can be useful for troubleshooting failed reactions, and are described in the troubleshooting[href=https://www.wicell.org#troubleshooting] section.\nSeal the PCR plates with a thermal plate sealer. Mix thoroughly and quickly spin plates at 500 g for 1 min.\nSet up the Golden Gate thermocycler reaction as follows:\ntable:files/protocols_protocol_1682_5.csv\nNote: 15 cycles of digestion/ligation are recommended for constructs assembled with fewer than 3 DNA fragments; 25 cycles are preferred for constructs with 3 or more DNA fragments.\nNote: Holding the thermocycler at 4°C is recommended for product stability. A heated lid (104°C) should be used to mitigate condensation during Golden Gate Reaction, including the Hold step.\nTransformation.\nRemove pre-dispensed chemically competent bacterial cells (Lucigen, 15 μL of cells pre-dispensed in 96-well plate or 8-tube strip) from −80°C storage and thaw on ice for 5 min.\nUse a multichannel pipet to add 1.5 μL of Golden Gate Reaction to each well of competent cells.",
    "Gently mix by tapping the wall of the tube, then incubate on ice for 20 min.\nUsing a pre-warmed thermocycler, heat shock cells at 42°C for 1 min, and then place on ice for 1 min.\nAdd 80 μL recovery medium (medium supplied with competent cells or SOC broth) to cells. Seal plate and incubate at 37°C for 30 min.\nPlate cells onto standard LB agar plates containing 100 μg/mL carbenicillin, and plate using sterile glass beads or another preferred method.\nIncubate the agar plates at 37°C overnight.\nBacterial culture and DNA purification.\nPrepare growth medium (LB broth + 100 μg/mL carbenicillin). Use a multichannel pipette or VIAFLO 96 channel electronic pipette (Integra) to aliquot growth medium into 96-well deep well blocks (1 mL per well).\nInoculate each well with a single colony from a successful transformation.\nGrow bacterial culture overnight in a 37°C incubator with a shaking platform set to 1,200 RPM.\nPurify transfection-grade DNA (∼30–50 μg of DNA per sample) using a QIAGEN Plasmid plus 96 Kit (96-well format) following manufacturer’s recommendation[href=https://www.qiagen.com/us/resources/resourcedetail?id=35950015-61a6-4f78-a440-f795e83c7aab&lang=en].\nAssess concentration of the purified DNA by measuring absorbance at 260 nm (A260).\nNote: A DropSense96 instrument (PerkinElmer) or similar instrument is recommended for high-throughput measurements, as DNA samples can be measured in a 96-well format using Drop plate 96 (Unchained Labs).\nNote: On average, analyzing 4 colonies per construct is sufficient. However, if constructs are complex and expected to be difficult-to-clone, more colonies should be screened to ensure success.\nSequencing verification.\nPrepare 96-well DNA sequencing plates by adding 10 μL of DNA, diluted with 30 μL deionized water to a final concentration of 50–200 ng/μL, to each well using a multichannel pipette or VIAFLO 96 channel electronic pipette (Integra).",
    "Use Sanger sequencing to verify construct identity. Sequencing can be done in-house or through third-party suppliers such as Genewiz or Eurofins. The following primers are frequently used for pTT5 cloning:\nVector forward primer: 5′- ACGAGGAGGATTTGATATTCACC-3′.\nVector reverse primer: 5′- CTTCCGAGTGAGAGACAC-3′.\nHeavy chain CH2 reverse primer: 5′- TTGTACTCCTTGCCATTCAGC-3′.\nTo identify successful clones, analyze Sanger sequencing results using a software application such as Geneious (Biomatters).\nDNA mixing.\nFor each construct, pool sequencing-confirmed DNA using an automatic liquid handler (Tecan Freedom EVO, Boston industries) according to manufacturer instructions[href=https://www.tecan.com/knowledge-portal/freedom-evo-operating-manuals].\nTo prepare DNA for transfection, mix plasmid DNA encoding each chain of a bispecific antibody at defined ratios (i.e., HC1:LC1:HC2:LC2 = 1:1:1:1 for a Hetero-IgG), and then normalize concentration of the mixed DNA to 100 ng/μL. DNA mixing and normalization can be performed using a Tecan liquid handler.\nNote: The 1:1:1:1 ratio mentioned above is recommended for high-throughput screening. However, the optimal DNA ratios for multi-chain molecules are largely sequence-dependent, and it is recommended to test other ratios for top candidates. Optimizing the DNA ratio is critical for balancing chain expression, which can lead to higher yields and lower levels of impurities.\nValidate the concentration of each sample by measuring A260 of the mixed DNA. A DropSense96 (PerkinElmer) or similar instrument allows for rapid testing of 96-well plates. Mixed DNA can be stored at 2°C–8°C for several weeks, or at −20°C for long-term storage.\nExpression\nTiming: 7 days\nThe HEK 293-6E expression protocol shown below was developed in our laboratory and consists of 3 key steps: cell seeding, DNA transfection and supplementation (including histone deacetylase inhibitor (HDACi) supplementation), and measuring titers.\nNote: As a control, include a mixed DNA containing genes for a high-expressing monoclonal antibody (cloned into the same vector types as the experimental samples) in every transfection.\nCell seeding.",
    "Twenty-six hours before transfection, and using a biological safety cabinet, seed cells into a shake flask at a density of 1 × 106 cells/mL in fresh cell culture medium, so that the cells reach optimal cell density (∼2 × 106 cells/mL) at the time of transfection.\nNote: Viable cell density (VCD) and cell viability are measured using a Vi-CELL XR viability analyzer, Vi-CELL sample vials and Trypan blue based Vi-CELL XR reagents (Beckman Coulter), following instrument manual instructions.\nOn the day of transfection, take culture medium and DNA from 4°C and warm to 20°C–25˚C.\nMeasure cell density and viability using the Vi-CELL XR viability analyzer. Cell density should be between 1.8 to 2.2 × 106 cells/mL at the time of transfection, with >98% viability.\nCritical: Carefully monitor cultures to ensure cell density does not exceed 2.2 × 106 cells/mL. Achieving optimal cell density and high viability is critical for efficient transfection.\nGently aliquot cells into 96-well deep-well blocks (0.45 mL per well) and place the cell plate in the 37°C incubator on a shake rack (Kuhner AG) at 1,000 RPM.\nTransfection and supplementation.\nTo make the DNA-PEI complex, use a multichannel pipette to aliquot 50 μL Freestyle F17 medium into each well of a 96-well plate, add 5 μL of DNA (100 ng/μL) and 2 μL of PEImax (0.1% w/v, pH 7.0, Polysciences; see before you begin[href=https://www.wicell.org#before-you-begin] section), and then immediately swirl to mix.\nAfter incubation at 20°C–25˚C for 10 min, add DNA-PEI mixture to cells, gently mix by swirling, and place cell plates in the 37°C incubator on a shake rack at 1,000 RPM.\n24 h post-transfection, add 0.5 mL of cell culture supplemental medium (pre-warmed to 37°C) to each well of cells. Supplemental medium can be prepared using the table in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.",
    "Note: Adding supplemental medium can be performed as soon as 4 h post-transfection, although a 24-hour interval is recommended and routinely performed.\n4 days post-transfection, add 7.5 μL of 500 mM sodium valproate (prepared using deionized water) to each well of cells (final concentration = 3.75 mM).\nNote: Sodium valproate solution can be stored at −20°C for at least 2 years, or at 4°C for 3 months.\nMeasure antibody titers.\n6 days post-transfection, using a multichannel pipette or VIAFLO 96-channel electronic pipette (Integra), transfer 50 μL of each well of transfected cells into a 96-well plate.\nCentrifuge the plate at 3,000 × g for 30 min to pellet cells and cellular debris.\nCarefully transfer 30 μL of the supernatant (i.e., the conditioned medium) to a new 96-well plate and add 120 μL Octet Sample Diluent using a multichannel pipette or VIAFLO 96-channel electronic pipette (Integra).\nTo generate a standard curve dataset, use 2-fold serial dilution (in triplicate) of a purified antibody of known concentration (e.g., a commercially available antibody) to prepare a dilution series ranging from 250 to 1.9 mg/L.\nMeasure antibody binding curves using an Octet QK instrument (ForteBio) and with Octet ProA biosensors (Sartorius).\nNote: ProA biosensors are ready for use and are automatically conditioned as part of the titering run. Reusing biosensors is not recommended.\nCalculate antibody concentration estimates based on a standard curve generated from the serially diluted purified mAb.\nPurification\nTiming: 20 h (∼16 h incubation followed by ∼4 h hands-on time).\nProtein A (ProA) affinity capture is a widely established method for purification of antibodies, for both small- and industrial-scale workflows. ProA magnetic beads, in conjunction with the KingFisher Flex Purification System (Thermo Scientific), provide a high-throughput and automated solution for purifying antibodies from conditioned medium.\nProA magnetic bead incubation.",
    "Six days post-transfection, in a biological safety cabinet, use a multichannel pipette to add 100 μL of the 50% bead slurry to each cell culture (see before you begin[href=https://www.wicell.org#before-you-begin] section).\nReturn cells to 37°C shake rack in incubator for an overnight (∼16 h) binding step.\nCritical: Beads in the source container may settle over time, especially when a large number of samples are being prepared. While aliquoting beads into cell cultures, frequently swirl the bead source container to achieve a consistent distribution.\nProA magnetic bead washing and elution using Kingfisher.\nFor each 96-well plate containing the cell/bead mixture, prepare the following Kingfisher 96-well plates with wash and elution buffers in each well:\n5 plates containing 1 mL 1×DPBS (pH 6.8).\n2 plates containing 1 mL deionized water.\n1 plate containing 0.4 mL elution buffer (100 mM Sodium acetate, pH 3.6).\nCritical: Ensure each plate is properly labeled and oriented to avoid mix-ups.\nCollect ProA magnetic beads from cell culture using Kingfisher Flex 96-well magnetic head and FLEX 96-Tip Comb, and then carefully transfer beads to 96-well plates containing 1×DPBS.\nPlace the plates on the Kingfisher instrument in the following order: Elution plate, 2 water plates, 3 DPBS plates, beads plate (in DPBS), and the final DPBS plate assembled with Tip Comb.\nRun Kingfisher purification using the following protocol:\ntable:files/protocols_protocol_1682_6.csv\nAfter Kingfisher purification, immediately neutralize the eluted samples by adding 8 μL 3 M Tris-HC (pH 11).\nTransfer neutralized samples to 96-well 0.22 μm filter plates, and then place the filter plates on top of 96-well collection plates. Filter by centrifuging at 1,200 × g for 3 min.",
    "Critical: Neutralization must be performed immediately after elution, to minimize damage to the samples. However, if residual ProA beads are present in the neutralized elution plates, they can potentially re-bind the eluted proteins. Thus, neutralized samples should be filtered as soon as possible to maximize recovery.\nSamples in collection plates are ready to be used for downstream analytics. Samples can be stored at 4°C for approximately 4 weeks, or at −80°C for longer-term storage.\nAnalytics\nTiming: 1 day\nWith the purified material, first assess the total recombinant expression level by measuring the absorbance at 280 nm (A280). In addition to the correctly assembled bispecific antibodies, many undesired species, such as aggregates and half-antibody fragments (½ Ab), can be present in the conditioned medium (cell supernatant), and any species containing an Fc region can be recovered by Kingfisher ProA purification. To assess product quality, analyze ProA samples with non-reducing Microchip Capillary Electrophoresis (nrMCE) and Analytical Size-exclusion Chromatography (aSEC).\nCalculate ProA yield by A280 measurement.\nTransfer 140 μL of each sample into A280-compatible plates using a multichannel pipette or VIAFLO 96 channel electronic pipette (Integra).\nMeasure absorbance (A280) with an instrument such as Multiskan Go (Thermo Scientific) following instrument manual instructions. Samples used for A280 nm can subsequently be used for other analytics assays if desired.\nCalculate protein concentration using a rearrangement of the Beer-Lambert Law: Concentration (mg/mL) = A280 / molar extinction coefficient (M-1cm-1).\nNote: Molar extinction coefficient is sequence-dependent and can be predicted using online tools such as the ProtParam Tool (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/]). Molar extinction coefficient of the correct species should be used for calculation.\nCalculate ProA yield: ProA yield (mg/L) = concentration (mg/mL) × elution volume (mL) / cell culture volume (L).",
    "Non-reducing Microchip Capillary Electrophoresis (nrMCE). The Caliper LabChip GXII (PerkinElmer) is a Microcapillary Electrophoresis system used for rapid characterization of protein samples. The microfluidics chip technology automatically stains, electrophoretically separates, destains and analyzes protein samples from 96- or 384-well microplates (LeSaout et al., 2016[href=https://www.wicell.org#bib12]). The separation observed in nrMCE is analogous to that of nrSDS-PAGE, in which high molecular weight (MW) species (such as covalent aggregates) migrate at a slower rate compared to low-MW species (such as ½ mAb).\nCritical: Sample protein concentrations should be within the range of 0.05–2 mg/mL. The Caliper LabChip GXII is capable of separating proteins between 14 and 200 kDa. High molecular weight (HMW) covalent aggregates may not be resolved by this system.\nAllow Protein Express Reagent Kit and one Protein Express Assay LabChip to equilibrate to 20°C–25˚C (∼30 min).\nCalculate the amount of nrMCE sample buffer needed to distribute 21 μL to each sample, plus an additional 20% excess to account for pipetting error. A stock solution of nrMCE buffer (without iodoacetamide) can be prepared in advance using the table in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nBased on the calculation in the previous step, transfer the required volume of nrMCE sample buffer stock to a separate container.\nThaw an aliquot(s) of iodoacetamide, add the appropriate amount to the separate container (based on the nrMCE sample buffer recipe table), and gently mix.\nTransfer 6 μL samples to 96-well microplates, add 21 μL nrMCE sample buffer from the reservoir, cover with adhesive foil, gently vortex to mix, and centrifuge at 2,200 × g for 30 s.\nDenaturation: Heat microplates at 85°C for 10 min, and then centrifuge at 2,200 × g for 30 s.",
    "Remove foil, add 105 μL water to each sample, pipet up and down to mix, cover with adhesive foil, and then centrifuge at 2,200 × g for 30 s.\nRemove foil and visually inspect wells to ensure no air bubbles are present in the wells.\nCritical: Air bubbles can cause spikes in the electropherogram profiles and interfere with analysis. All wells should be carefully checked for air bubbles after centrifugation. If bubbles are present, re-centrifuge samples and if necessary, break bubbles using clean pipet tips.\nPlace the microplate in the instrument platform, aligning the plate with the “A1” marking on the platform edge.\nAfter warming to 20°C–25˚C, gently vortex the HT Protein Express Ladder tube (supplied in the Protein Express Assay Reagent Kit), and pulse centrifuge (using a mini centrifuge at approximately 2,000 × g).\nTransfer 12 μL to a 0.2 mL microtube (provided in Protein Express Assay Reagent Kit), and then add 120 μL water followed by pipetting up and down to mix.\nReverse pipette 520 μL of Protein Express Gel Matrix (supplied in the Protein Express Assay Reagent Kit) to the top basket of the provided spin filter.\nGently vortex the HT Protein Express Dye Solution (supplied in the Protein Express Assay Reagent Kit), centrifuge briefly at 2,000 × g, and transfer 20 μL to the spin filter containing the Protein Express Gel Matrix.\nCap the filter, invert, and vortex until the solution is well mixed.\nCentrifuge at 9,000 × g for 6 min at 20°C–25˚C, discard filter, label and minimize light exposure to the tube.",
    "Note: Reverse pipetting is a technique used to minimize pipetting error caused by loss of residual material in the tip, and can improve pipetting accuracy for highly viscous samples. Depress the pipette plunger beyond the first stop, insert the tip into the liquid, and completely release the plunger while aspirating. Dispense the liquid by depressing the plunger to the first stop. Residual material in the tip should be discarded.\nReverse pipette 250 μL of Protein Express Gel Matrix (supplied in the Protein Express Assay Reagent Kit) to a separate spin filter. Centrifuge at 9,000 × g for 6 min at 20°C–25˚C, discard filter, label and minimize light exposure to the tube.\nOpen chip storage box and remove parafilm covering from the wells. Using a pipette tip attached to a vacuum line, aspirate liquid from active wells (only touch the sides of the well; do not touch the center region of the bottom of the well).\nWash each active well with ultrapure water 2–3 times, using the vacuum line to aspirate after each wash.\nNote: After the final wash, proceed immediately to the next step. Do not allow the wells to dry out.\nIn accordance with the instrument manual and desired number of runs, load the recommended amount of Ladder solution, Gel-Dye Solution and Destain solution to the corresponding chip wells.\nTransfer 750 μL of HT Protein Express Wash Buffer (supplied in the Protein Express Assay Reagent Kit) to a provided 0.75 mL Buffer Tube.\nPlace the prepared chip and Buffer Tube in the instrument platform and then run the assay using default settings.\nUsing the Caliper LabChip software, quantify the area under the curve for pre-main peak (pre-MP, low-MW species), main peak (MP), and post-main peak (post-MP, high-MW species) as a percent of total area for each sample.",
    "HPLC-based Analytical Size-exclusion Chromatography (aSEC). An aSEC workflow enables rapid and automated characterization of bispecific antibodies in solution, with run times of approximately 12 min or less. aSEC is routinely used to quantify relative abundances of pre-MP, MP, and post-MP. However, in contrast to nrMCE, the pre-MP in aSEC generally contains species of higher hydrodynamic radius, including aggregates; likewise, the post-MP generally indicates the presence of low molecular-weight species. Prior to running experimental samples, several control runs are recommended. First, a blank sample (i.e., sample buffer) can be used to identify any signals originating from buffer or the HPLC system; second, a Gel Filtration Standard (Bio-Rad, prepared according to the manufacturer’s instructions[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/MSLIT-102E.pdf]) (Figure 4[href=https://www.wicell.org#fig4]C) as well as a control antibody (e.g., a commercially available purified mAb) can be run and analyzed to ensure the column and instruments are functioning properly. In addition, Standards and Control Abs can be run at the end of a sample sequence to ensure consistent column performance throughout the sequence. Multiple replicates of sample runs are not routinely performed. The following steps describe the use of a 1260 Series HPLC system (Agilent) and the Chromeleon Chromatography Data System (Thermo Fisher Scientific) for aSEC:\nInstall hardware[href=https://www.agilent.com/cs/library/usermanuals/public/G1311-90300_QuaternarySystem_ebook.pdf] and column(s[href=https://www.sepax-tech.com/usermanual/UserManual_Zenix-C.pdf]) according to manufacturer’s instructions (see before you begin[href=https://www.wicell.org#before-you-begin] section above).\nCreate and save an instrument method using the Instrument Method Wizard. Specify run time, flow rate, inlets, and a description.\nCreate and save a processing method using the Processing Method Wizard. Specify components to be used for annotation (i.e., pre-MP, MP and post-MP).\nSelect and save a report template layout using on-screen instructions.\nPrior to initializing a run, navigate to the instrument control console and manually switch on all devices required for the method. The status of all devices must read as “Ready” before starting a run.",
    "Create a workflow sequence using the eWorkflow Wizard containing the desired number of runs.\nNavigate to the Data tab and enter sample information, including sample ID, injection volume, sample position, instrument method, processing method, and any other relevant information.\nNote: When using a 300 mm Zenix-C column, injected mass should be no greater than 32 μg, in a volume of no greater than approximately 50 μL. If necessary, samples can be diluted with SEC running buffer prior to injection.\nAn example of an aSEC workflow sequence is shown below:\nBlank.\nGel Filtration Standard.\nControl Molecule.\nSample 1.\nSample 2.\n(All sample runs).\nGel Filtration Standard.\nControl Molecule.\nStart run sequence. During initial Standard run, monitor run progress to ensure proper performance of the system (Figure 4[href=https://www.wicell.org#fig4]C).\nAfter the run sequence is complete, use the Chromeleon analysis tool suite to quantify the area under the curve for pre-MP, MP and post-MP as a percent of total area for each sample."
  ],
  "subjectAreas": [
    "Antibody",
    "Biotechnology And Bioengineering",
    "Protein Expression And Purification",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}