{
  "id": 18059,
  "origin_website": "Jove",
  "title": "Bedside Ultrasound for Guiding Fluid Removal in Patients with Pulmonary Edema: The Reverse-FALLS Protocol",
  "procedures": [
    "1. Assess Extravascular Compartment Before Diuresis: Chest Ultrasound\nUse a low-frequency, phased array probe.\nSelect the appropriate machine setting (abdomen or lung) with the screen marker operator-left.\nAdjust the depth to 8-12 cm.\nPlace the patient in supine or semi-recumbent position and expose the anterior chest. Place the transducer at a 90° angle to the patient's anterior chest with the probe marker facing cephalad.\n\t\nPerform this protocol at the midclavicular line in two locations on each side of the chest for a total of four locations: in the 2nd-3rd or the 3rd-4th intercostal space, and in the 4th-5th or 5th-6th intercostal space.\nVisualize B-lines, if present.\n\t\tNOTE: B lines are echogenic artifacts with a narrow origin on the pleural line, and they move synchronously with respiratory movements (Figure 1).\nCount the number of B-lines in each scan plane to quantify the extent of pulmonary edema.\n\tNOTE: Up to one B-line is normal; two to three B-lines represent mild pulmonary edema, whereas 4 or more B-lines represent moderate to severe edema; a whiteout pattern with no A-lines represents very severe pulmonary edema (Figure 2).\n2. Assess Intravascular Compartment Before Diuresis: IVC Ultrasound\nUse a low frequency, phased array probe.\nSelect the cardiac machine setting with the screen marker operator-right and adjust the depth to 12-21 cm for optimal image resolution.\nPlace the patient in a supine position and expose the anterior chest. Place the transducer at a 90° angle to the patient's sub-xiphoid region with the probe marker facing cephalad.\n\t\nPerform this protocol with the transducer located just right of the midline, tilted slightly right-lateral and cephalad.\nBy scanning right-to-left, visualize both the IVC and the aorta.",
    "Note that the objective is to visualize the cavo-atrial junction, diaphragm, liver, hepatic vein, and IVC in its longitudinal plane. The aorta is visualized by angulating the scan plane medially (Figure 3).\nOnce the IVC and the cavo-atrial junction have been identified, set the ultrasound to M-Mode to measure the anterior-posterior diameter of the IVC.\n\t\nUsing the touch pad, select the M-mode beam that corresponds to a near-orthogonal section, 2-4 cm distal to the cavo-atrial junction just beyond the visible hepatic vein.\nSelect the M-mode button a second time, and freeze the screen after the M-mode reading is complete through at least 1 respiratory cycle.\nUse machine calipers for all measurements, measuring the vessel from internal edge to internal edge.\nMeasure D-max and D-min during a normal respiratory cycle.\n3. Set Fluid Management Goals Based on Gradation of Pulmonary Edema and Diameter of IVC\nAssess the lung ultrasound to determine the need for diuresis (Figure 2).\nAssess the IVC ultrasound to determine the patient's ability to withstand diuresis (Figure 3).\n4. Reassess Extravascular and Intravascular Compartments Throughout Diuretic Therapy.\nRepeat the protocol as outlined above every 6 hours to evaluate the progress of diuretic therapy and to guide fluid management goals.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}