{
  "id": 18282,
  "origin_website": "Jove",
  "title": "Automated Radiochemical Synthesis of [18F]3F4AP: A Novel PET Tracer for Imaging Demyelinating Diseases",
  "procedures": [
    "CAUTION: All procedures involving the use of radioactive materials must be approved by the local Office of Radiation Safety. When working with radioactive materials wear a lab coat and personal radiation badges. Use two layers of gloves at all times and check hands with a Geiger counter after each step that involves handling radioactivity. If the gloves are contaminated with radioactivity discard and replace outer gloves. Use appropriate shielding, minimize time in contact with the radiation source and maximize distance.\n1. One Week before Experiment: Preparation of Materials\nDownload [18F]3F4AP sequence: Synthera users can log into the Users Database (http://www.iba-radiopharmasolutions.com/products/chemistry) and download the sequence file for 3F4AP. Users of other synthesizers may need to write their own script based on the sequence of steps. Browse through the annotated sequence to become familiar with the steps involved in the synthesis.\nEnsure that there is enough gas for the synthesis. The synthesizer requires compressed gas, either helium or nitrogen. It also requires >75 psi compressed air. Ensure that the pressures are within the recommended by the manufacturer.\nPrepare HPLC mobile phase: prepare 1 L of 50 mM sodium phosphate and 10 mM triethyl amine. Using a pH meter adjust the pH to 8.0 ±0.1 by adding dropwise saturated sodium hydroxide while stirring. Filter the solution through a 0.22 µm bottletop filter and add 5% volume of ethanol.\nDry glassware in the oven overnight.\n2. Day of Experiment: Before Arrival of Fluorine-18\nUsing 1 mL syringes, fill reagent vials with the appropriate reagents. For vials 2 and 3 use oven-dried vials and anhydrous solvents kept under argon. Seal the vials with crimp seals using a crimper.\nFill Vial 1 (11 mm diameter / 2 mL volume vial) with 400 µL of TBA-HCO3 + 800 µL of acetonitrile (MeCN).",
    "Fill Vial 2 (13 mm / 4 mL vial) with 50 µL of precursor solution 1.0 mg/mL + 450 µL of MeCN.\nFill Vial 3 (11 mm / 2 mL vial) with 500 µL of MeCN.\nFill Vial 4 (13 mm / 4 mL vial) with 4 mL of 0.2% oxalic acid in methanol (MeOH).\nCondition the QMA (strong anion exchange) and Alumina-N solid phase extraction cartridges. Using a 10 mL syringe, pass 5 mL of 8.4% NaHCO3 drop-wise through the QMA followed by 5 mL of ultrapure deionized Type I water (18.2 ΜΩ•cm at 25 ºC). Pass 5 mL of ultrapure water drop-wise through Alumina-N cartridge followed by 5 mL of MeOH + 0.2% oxalic acid.\nTurn on the HPLC and condition the C-18 column with 4 mL per min of mobile phase for 30 min.\nLoad a new catalyst cartridge onto the hydrogenator cartridge holder and start a flow of 0.5 mL/min of 100% MeOH. Set the hydrogen regulator to 50 psi and condition the cartridge for 15 min (Figure 2).\nAssemble the Integrated Fluid Processor (IFP) by introducing vials 1 through 4 in their positions, attaching the cartridges and collection vial as shown in Figure 3. Attach a collection vial with a vent needle to the output line of the hydrogenator.\nStart the synthesizer's software. Enter login and password. Perform pre-run checks on the synthesizer according to manufacturer instructions.\nClick on \"Sequences\" and then \"Open\" to load the 3F4AP sequence.\nLoad the IFP by clicking the \"Load\" button on the screen. Type a file name for the run and start the sequence by clicking \"Start\". (The automated synthesizer will automatically pause before the 18F loading step.)",
    "Watch as the synthesizer goes through the routine self-check steps (part one of the sequence). Look at the screen to ensure that there are no warnings or alarms. Pay attention to sounds as the synthesizer flushes lines and preheats reaction vessel in preparation for the run. The temperature indicator should rise and stay at 65 ºC. Wait for the signal (auditory beep) indicating that the synthesizer is ready for the 18F transfer.\n3. Day of Experiment: 18F Labeling\nRemotely transfer desired amount of cyclotron-produced 18F from the cyclotron target to 18F vial. Verify the amount of radioactivity and record it with the time of delivery.\n\tNOTE: If not using a direct line for 18F- transfer use a prefilled syringe with a needle attached to transfer the activity to the vial through the septum. The amount of starting radioactivity depends on the limits set by the Office of Radiation Safety and the desired amount of final tracer. Typical amount ranges between 50 and 500 mCi.\nResume sequence on the synthesizer by pressing \"Resume\". This will initiate the transfer of the 18F into the QMA.\nMonitor the progression of the synthesis throughout the automated sequence on the computer screen.\nWatch the transfer the 18F from the vial onto the QMA for 90 s. After trapping 18F- on QMA it elutes with TBA-HCO3 solution (vial 1). (Part two of the sequence)\nMonitor the pressure and temperature traces on the synthesizer while the TBA18F is dried under reduced pressure (5 kPa) and heating (100 ºC), followed by additional drying and cool down steps. (Part 3 of the sequence)",
    "Watch the transfer of anhydrous MeCN (vial 3) and precursor solution (vial 2) to the reactor and how it reacts for 1 min at room temperature. The solution should be colorless or very faint yellow. (Part 4 of the sequence)\nWatch the transfer of oxalic acid solution (vial 4) to the reactor. Watch as the solution is pressure transferred from the reactor through alumina-N cartridge to the final product vial. (Part 5 of the sequence)\nAt the end of the sequence, print out the report, eject the IFP, shut off gas tanks, and close the software.\nWhile first establishing the procedure, measure the radioactivity in the alumina-N cartridge and the collection vial by separately introducing the cartridge and vial in the dose calibrator. Record the activity and time of measurement. Place the used cartridge in a leaded waste container. Place the collection vial in a shielded container for transport to the next step.\nUsing a 1 mL syringe with a 2\" needle attached, manually transfer approximately 100 μL of sample of the intermediate product solution into a standard HPLC vial for in-process quality control. Inject 10 μL of this sample into the HPLC to evaluate the purity and identity of the intermediate compound.\n\tNOTE: HPLC conditions: XDB 5 µm, 9.4 x 250 mm C18 column. Flow 4 mL/min. Mobile phase (50 mM Na2HPO4, 10 mM TEA, 5% EtOH). Isocratic 15 min.\n4. Day of Experiment: Hydrogenation\nCAUTION: Injection of the product into the hydrogenator has to be done using proper shielding precautions. Hydrogen gas must be properly handled and vented.\nNOTE: the hydrogenation reactor can be connected in place of the HPLC column on the synthesizer and controlled using the synthesizer software.",
    "Set up the hydrogenator flow at 0.5 mL/min by starting the synthesizer HPLC sequence. Manually set up hydrogen pressure to 50 psi.\nAfter finishing the labeling and quenching steps the synthesizer will transfer the intermediate product solution into hydrogenator/HPLC loop.\nWhen the radioactive peak appears on the HPLC software toggle the collection valve to collect the product. Measure radioactivity of crude product using a dose calibrator.\n\tNOTE: The crude product should be injected into an automated HPLC system inside a hot cell. After purification, the final product is then collected and dispensed into an aseptic ISO class 5 laminar air flow hot cell as per USP and FDA regulations.\n5. Day of Experiment: Purification and Preparation of the Dose\nInject crude product into the HPLC and use the automated fraction collector to collect the fractions corresponding to the final product peak. Each tube contains 0.66 mL of solution.\n\tNOTE: HPLC conditions: XDB 5 µm, 9.4 x 250 mm C18 column. Flow 4 mL/min. Mobile phase (50 mM Na2HPO4, 10 mM TEA, 5% EtOH). Isocratic 15 min. Collect 4-15 min.\nMeasure the radioactivity of each fraction using a dose calibrator and record it. Combine the fractions with highest amounts of radioactivity (typically tubes 14-18).\nDraw the product solution with a 10 mL syringe and pass the sample through 0.22 µm filter into a sterile vial. Record the amount of radioactivity, end of synthesis time and solution volume on the vial label. This is the final dose for injection. Put aside ~0.8 mL of the solution for quality control tests.\n6. Day of Experiment: Quality Control (QC) Tests\nBefore dose release:\n\tInspect the dose through lead-shielded glass. The solution must be clear, colorless and free of particulate matter.\nRadiochemical identity:",
    "For RadioTLC: spot a drop of the sample on a TLC plate side-by-side with the reference standard. Run TLC plate on a TLC chamber using 95% MeOH: 5% acetic acid. Visualize the reference standard under UV illumination and mark its position with pencil.\nTape the TLC plate to the stage of the radioTLC scanner and record time of the peak. Rf values of the reference standard and radioactive peak must match within 5%.\nFor RadioHPLC: run 10 µL of the dose with and without the reference standard on the HPLC. Retention time of the reference standard and the radioactive peak must match. A single coelution peak must be seen on the spiked sample.\nFor radiochemical purity: measure the area under curve for the radioHPLC and radioTLC target peaks. The area of the target peak must be >95% of the area for all radioactive peaks combined.\nFor the specific radioactivity: calculate the specific radioactivity as the amount of radioactivity in the peak (measured on step 5.2) over the mass amount determined from the area under the curve of the UV HPLC trace using a pre-established calibration curve. The specific radioactivity must be higher than 50 mCi/µmol.\nFor the residual solvent analysis: measure the amount of residual solvents (MeCN, MeOH) in the dose using gas chromatography. Solvents levels must be < 0.04% for acetonitrile and <3,000 ppm for methanol. The amount of EtOH must be less than 10% w/v.",
    "For the sterile filter integrity test (bubble point): connect the filter used in step 5.3 to a nitrogen supply equipped with a pressure regulator and submerge the needle in water. Gradually open the gas valve while watching the pressure gauge. The filter should withstand pressures up to 50 psi without bursting as evidenced by the lack of a stream of bubbles from the needle. Increase the pressure beyond 50 psi until a stream of bubbles comes out of the needle. Record this pressure, it is the burst pressure and it must be >50 psi.\nFor the radionuclide half-life: measure the radioactivity of the product at two time points ≥10 min apart in a dose calibrator. Calculate the half-life using the equation below. The half-life must match that of 18F to within 5 minutes (109 ±5 min):\nt½calculated = 0.693 t ÷ ln (A1/A2)\n\twhere t is the interval between measurements and A 1, A 2 the activity measured at each time point.\nFor the radionuclidic identity and purity: obtain the γ-ray spectrum of a sample of the product using a gamma counter. The spectrum should exhibit one single photo-peak at an energy of 511 keV. There should be no other photo-peaks in the spectrum.\nFor the endotoxin analysis: measure the endotoxin levels using a LAL chromogenic endotoxin quantitation test. Endotoxin levels must be <1.75 EU/mL for a 1:10 diluted product with a final product volume of 10 mL.\nDocument the results from each QC test. Release the dose for animal studies only if all the tests passed.\nPost-dose release:\n\tFor the sterility test: add a sample of the dose to both fluid thioglycolate and trypticase soy broth. No growth must be seen on the media after 14 days.\n7. Day of Experiment: Calculations (Table 1)",
    "For the non-decay corrected radiochemical yield (n.d.c. RCY): calculate the n.d.c. RCY as the amount of radioactivity in the final product over the starting radioactivity.\nFor the radiolabeling efficiency: calculate the labeling yield as the ratio of radioactivity in the collection vial over radioactivity in the alumina-N cartridge (unincorporated [18F]F-) and the collection vial.\nFor the hydrogenation yield: calculate the hydrogenation yield as the amount of radioactivity in the desired peak over the radioactivity injected into the HPLC.\nFor the filtering losses: calculate filtering loses as the radioactivity remaining in the filter and syringe over radioactivity before filtering."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}