{
  "id": 19208,
  "origin_website": "Jove",
  "title": "Isolation of Human Islets from Partially Pancreatectomized Patients",
  "procedures": [
    "1. Pancreatic tissue collection in the operating room\nThe surgeon performs a partial resection of the pancreas.\nAfter placing the pancreatic specimen in a box on ice, deliver it immediately to the pathologist.\n2. Tissue selection for islet isolation\nThe pathologist selects tissue that appears soft and healthy, retaining the damaged tissue for diagnostic purposes. Fibrotic tissue and specimens offering less than 2 g of usable tissue are excluded from islet isolation.\nImmerse the pancreatic tissue in Euro Collins Solution and deliver on ice to the laboratory.\n3. Isolation of human islets\nWeigh the pancreatic tissue, then place it into a 10 cm dish.\nPut 150 ml RPMI media in a 500 ml flask.\nIn a 250 ml flask, prepare the digestive enzyme solution by combining 130 ml RPMI media with 100 mg/ml DNase and 20 ml of 5mg/ml Liberase RI. Draw 10 ml of this solution into a syringe to inject the pancreatic tissue.\nInject the digestive enzyme solution into the pancreatic tissue, aiming to distend it homogeneously. If this is prevented by fibrosis, the digestion will likely fail. Next, mince the tissue into ~4 mm3 pieces on ice.\n4. Human pancreas digestion circuit\nAssemble the digestion circuit as shown in Figure 1. The flow direction in the Ricordi chamber is in at the bottom and out at the top of the chamber.\nAdd the remaining digestive enzyme solution to the 500 ml flask up to a total volume of 300 ml and insert a thermometer.\nTransfer the pancreatic tissue into the chamber, insert the mesh (pore diameter: 600 μm) and three Silicon Nitride Marbles (diameter: 15 mm), close the chamber and start the pump with the flow set at 140 ml/min.",
    "When the temperature of the circuit reaches 37 °C, start timing and periodically take samples to determine when to stop the digestion. Staining with dithizone (2 mg/ml) allows microscopic visualization of islets within the digested tissue4.\nOnce the islets are separated from the surrounding acinar tissue, quickly stop the digestion by placing the heating coil on ice and adding 200 ml of cold wash media (900 ml RPMI 1640 with 5.5 mM glucose and 10% FBS) to the circuit.\nCollect the islet solution in 250 ml conical tubes as it comes out of the sample tube. Continue until the circuit is empty.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2962/2962fig1.jpg\nFigure 1. The human pancreas digestion circuit The human pancreas digestion circuit includes a Ricordi chamber containing mesh (pore diameter: 600 μm) and three silicon nitride marbles (diameter: 15 mm). Outflow from the chamber is driven to the tissue collection flask by the peristaltic pump (140 ml/min). Arrows indicate the flow direction. An optimal temperature for enzymatic digestion is maintained by immersing the heating coil in a 37 °C water bath.\n5. Washing post-digestion\nCentrifuge the 250 ml conical tubes containing the islet solution at 1000 rpm, 4 °C for 5 min.\nDiscard the supernatant, resuspend the islet pellet in wash media (900 ml RPMI 1640 with 5.5 mM glucose and 10% FBS) and distribute it in equal fractions to 50 ml conical tubes. (Optional: Distribute into additional conical tubes to improve washing.) Centrifuge at 1000 rpm, 4 °C for 5 min.\nDiscard supernatant and gently loosen pellets by manual shaking.\n6. Purification on a Ficoll gradient\nResuspend the pellet with Ficoll media at a density of 1.125 g/ml, pH 7.4 and slowly overlay 10 ml aliquots of Ficoll media with densities of 1.080, 1.060 and 1.037 g/ml.",
    "Centrifuge the Ficoll gradients at 2400 rpm, 4°C for 20 min.\n7. Islet Collection and Culture\nAfter centrifugation, different tissue components can be distinguished by their partitioning in the gradient.\nDiscard the upper layer consisting of fat and connective tissue.\nCarefully harvest the first layer of islet aggregates at the 1.037-1.060 g/ml interphase. This layer contains the most pure isolated islets. Collect fractions separately for efficient isolation.\nCollect the second, less pure fraction of islet aggregates at the 1.060-1.080 g/ml interphase.\nDilute the Ficoll gradient by adding wash media (900 ml RPMI 1640 with 5.5 mM glucose and 10% FBS) to each conical tube up to a total volume of 50 ml. Centrifuge at 1000 rpm, 4°C for 5 min.\nDiscard the supernatant by suction. Use care as the pellet might be loose due to the Ficoll gradient.\nWash the pellets with wash media (900ml RPMI 1640 with 5.5 mM glucose and 10% FBS) and centrifuge at 1000 rpm, 4°C for 5 min. Repeat using islet culture media\nResuspend the islets in culture media and place them in the incubator with 5% CO2 at 37 °C for 24-48 hours before further processing."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}