{
  "id": 10890,
  "origin_website": "Jove",
  "title": "3D Hydrogel Scaffolds for Articular Chondrocyte Culture and Cartilage Generation",
  "procedures": [
    "All experiments were performed in accordance with the Stanford University Human subjects’ guidelines and approved Institutional Review Board protocol.\n1. Articular Chondrocyte Isolation\nObtain cartilage from tissue discarded during total knee arthroplasty and dissect as described previously 8.\nVisually select the medial or lateral femoral condyles of cartilage samples for smooth surfaces and make incision at the surface of the cartilage through a scalpel in order to remove 4-5 mm cartilage biopsies without affecting the subchondral bone.\nIsolate chondrocytes from the extracellular matrix by enzymatic dissociation of the tissue with O/N treatment with purified collagenase. Use 1:1 ratio of Collagenase II (125 U/ml) and Collagenase IV (160 U/ml) in chondrocyte growth media at 37 °C.\nThe following day, filter the digested tissue containing the dissociated cells through a 70 mm pore size Nylon mesh. Wash two times with 20 ml of DMEM/F12 and centrifuge at 600 x g for 5 min.\nPlate the isolated chondrocytes at a density of 1 x 106 cells/60 mm culture dish following re-suspension in DMEM/F12 supplemented with 10% Fetal Bovine Serum (FBS), 25 µg/ml ascorbate, 2 mM L-glutamine, antimicrobials (100 U/ml penicillin, 100 µg/ml streptomycin, and 0.25 µg/ml fungizone). Keep the plates at 37 °C and maintain the primary chondrocyte cultures as a high-density monolayer prior to encapsulation in biomimetic hydrogels.\n2. Biomimetic Hydrogel Fabrication\nNOTE: This method allows the synthesis of a biomimetic hydrogel containing poly(ethylene glycol diacrylate) (PEGDA, MW 5,000 g/mole), chondroitin sulfate-methacrylate (CS-MA) in DPBS. The addition of photoinitiator enables photoactivated crosslinking. The final hydrogel composition contains 7% weight/volume (w/v) of PEGDA, 3% w/v of CS-MA, and 0.05% w/v of photoinitiator.\nSynthesize CS-MA by functionalizing CS polymer with methacrylate groups.",
    "Prepare buffered solution of 50 mM 2-morpholinoethanesulfonic acid (MES) and 0.5 M sodium chloride (NaCl) by dissolving 1.952 g of MES and 5.84 g of NaCl in 200 ml of deionized water (DiH2O). Dissolve 5 g of chondroitin sulfate sodium salt in the buffered solution.\nAdd 0.532 g (4.62 mmol) N-hydroxysuccinimide (NHS) and 1.771 g (9.24 mmol) 1-ethyl-3-(3-dimethylaminopropyl)-carbodiimide hydrochloride (EDC) (molar ratio of NHS:EDC = 1:2) to the solution and stir for 5 min.\nAdd 0.765 g (4.62 mmol) 2-aminoethyl methacrylate (AEMA) (molar ratio of NHS:EDC:AEMA = 1:2:1) to the solution and maintain the reaction at RT for 24 hr.\nPurify the mixture by dialysis against deionized water (diH2O) for 4 days using dialysis tubing (12-14 kDa MWCO).\nFilter the purified solution through a 0.22 μm filter and place the open tubes containing the solution in the desiccator and vacuum O/N. Ensure that all tubes are protected from light. Store the dissolved polymer at -20 °C protected from light and moisture.\n3. Cell Encapsulation\nAutoclave the PCR film and cylindrical rods (for punching out the cell-laden 3D hydrogels) and sterilize the custom-made cylindrical gel mold by submersion in 0.2 µm filtered 70% ethanol in tissue culture hood under UV light.\nSeal the bottom of the gel mold with autoclaved PCR film without air bubbles or gaps to prevent leaks. Keep it in a sterile 150 mm plate.\nThe day prior to cell encapsulation in biomimetic hydrogel, dissociate the high-density chondrocyte monolayer with O/N treatment in Collagenase II and Collagenase IV solution. Use 125 U/ml for Collagenase II and 160 U/ml for Collagenase VI each in chondrocyte growth media at 37 °C.",
    "Take a 50 ml tube and add 5% weight/volume (w/v) poly(ethylene glycol diacrylate) (PEGDA, MW=5,000 g/mole), 3% w/v chondroitin sulfate-methacrylate (CS-MA), and 0.05% w/v photoinitiator in DPBS. Vortex the tube to mix the solution and keep it aside. Protect the tube from light.\nCollect the dissociated cells in a 50 ml Falcon tube, count and centrifuge at 460 x g for 5 min. Aspirate all the media from the cells tube and add the above mixed gel material to re-suspend cells at a density of 15×106 cells/ml. Mix it 30 times thoroughly while avoiding air bubbles formation.\nPipette 72 µl of the cell-hydrogel suspension or hydrogel alone into the custom-made cylindrical gel mold and Induce gelation through exposure to UV light (365 nm wavelength) at 3 mW/m2 for 5 min. Prepare some hydrogel solution with no cell content. Use these constructs as negative controls for the future biochemical and mechanical testing. Measure the intensity of the UV light with a UV intensity meter. To adjust intensity, change the distance between the UV light source and the hydrogel scaffold during gelation.\n\tNOTE: Since the hydrogel contains CS, the acellular contribution is subtracted from the biochemical GAG content of the cell-laden hydrogels to represent only the cellular GAG.\nUse a scalpel to cut the film for easy peel off and carefully remove it. With the help of the cylindrical rods, push out the gel into a 6 well plate with 5 ml of sterile DPBS to wash off unpolymerized gel and loose cells.\nCulture the cell-laden hydrogels in 24 well plates containing 1.5 ml of chondrocyte growth media into each well. Use a disposable spatula to transfer the washed hydrogels into the well.",
    "Assess cell viability by live dead staining 24 hr post-encapsulation using a viability/cytotoxity kit. Culture the cell-laden hydrogels and the empty hydrogels for 3-6 weeks changing to fresh chondrocyte growth media every 2 days before harvesting for analyses.\n4. RNA Extraction and Gene Expression Analyses\nCarefully aspirate the media and put sterile PBS 1X on the cell-laden as well as the empty control hydrogels.\nWith the help of a sterile spatula, transfer each hydrogel to a clean 1.5 ml eppendorf tube and add 250 µl of Tri-reagent to each tube. Follow manufacturer’s instructions to isolate RNA.\nAfter RNA isolation and quantification use 1 µg of it from each sample and perform a reversed transcription into cDNA using the High Capacity cDNA Reverse Transcription Kit.\nFor quantitative PCR use TaqMan Gene Expression Arrays for examination of the expression of your genes of interest. Normalize the gene expression levels internally to GAPDH.\nFor the PCR conditions include a 2 min incubation at 50 °C to inactivate previous amplicons with uracil-DNA glycosylase, followed by a 10 min incubation at 95 °C to activate the Taq polymerase. Then perform forty cycles of PCR, consisting of 15 sec at 95 °C, and 1 min at 60 °C.\n5. Biochemical Analyses\nFor each cell-hydrogel constructs quantify DNA and sulfated glycosaminoglycan (sGAG) production as follow.\nCarefully aspirate the media and put sterile PBS 1X on the cell-laden as well as the empty control hydrogels. Weigh an empty tube and put the hydrogel inside after blotting it on tissue paper and record the weight or wet weight of the hydrogels.\nFreeze each hydrogel at -20 °C in a separate 1.5 ml eppendorf tube for enzymatic digestion and later use an aliquot of the digested product to run Picogreen assay (for DNA) and Dimethyl-Methylene blue assay (for GAG).",
    "Prepare the papainase solution for enzymatic digestion of the hydrogels.\n\t\nFirst prepare the PBE buffer by weighing out 7.1 g of Sodium phosphate dibasic (Na2HPO4) and 1.6 g of Ethylenediaminetetraacetic acid disodium salt (EDTA-Na2). Dissolve in 500 ml of dH2O, adjust the pH to 6.5 and filter the purified solution through a 0.22 mm filter.\nDissolve 0.035 g of L-cysteine in 20 ml of PBE buffer. Filter the solution and 100 µl of sterile papain enzyme.\nWhen ready to perform the assays, take the tubes from -20 °C and add 300 μl of the ready papain solution to the frozen hydrogels. Crush the gel with a mortar and pestle and mix it well with the motor pestle.\nBring the volume to 500 µl with additional papain solution. Perform the same procedure for the control gels. Incubate at 60 °C for 16 hr 3,9. The solution containing the digested hydrogel can therefore used for DNA and GAG quantification. Measure the DNA content using the Picogreen assay with Lambda phage DNA as standard following manufacturer’s protocol.\nQuantify the sulfated-GAG content using the 1,9-dimethylmethylene blue (DMMB) dye-binding assay with shark chondroitin sulfate as standard 10. Determine the GAG content by dividing the amount of GAG for the corresponding wet weight.\n6. Mechanical Testing\nPerform unconfined compression tests using an Instron 5944 testing system fitted with a 10 N load cell.\n\t\nAfter the desired days of in vitro culture, perform the compression test on the cell-hydrogel scaffold and the acellular control hydrogels.\nSubmerge the specimens in a PBS bath at RT and compress at a rate of 1% strain/sec to a maximum strain of 15% 11,12 since the physiological strain experienced by cartilage tissue under loading condition has been reported to be 10-20% 13,14.",
    "Create stress vs. strain curves and curve fit using a third order polynomial equation. Determine the compressive tangent modulus from the curve fit equation at strain values of 15%."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}