{
  "id": 17338,
  "origin_website": "Jove",
  "title": "A Retrograde Implantation Approach for Peritoneal Dialysis Catheter Placement in Mice",
  "procedures": [
    "For this study, eight female C57BL/6J mice, 8-12 weeks in age, and an average weight of 20 g were used. The mice were housed under standard conditions and were fed with chow and water ad libitum. This study was performed with the approval of the Institutional Animal Care and Use Committee (IACUC), Boston University Medical Center (AN-1549). The procedures described here were performed under sterile conditions.\n1. Anesthetize the mouse in an Isoflurane chamber, and inject the analgesic subcutaneously\nHold the animal from the base of the tail. Keep the animal on the dorsum surface of the non-dominant hand.\nTransfer the animal to the continuous anesthetic induction chamber filled with 3%-4% isoflurane. Confirm adequate general anesthesia by the absence of toe-pinch reflex in the right and left hind limbs. Keep the maintenance of the general anesthesia with Isoflurane 1%-3%.\nApply ophthalmic ointment on both eyes.\nAdminister a subcutaneous injection of Buprenorphine.\n\t\nDissolve the stock of Buprenorphine at a concentration of 0.3 mg/mL in sodium chloride (NaCl) 0.9% to achieve the final concentration of 0.03 mg/mL.\nInject a dosage of 0.05-0.1 mg/kg of 0.03 mg/mL Buprenorphine, together with 500 µL of sterile NaCl 0.9%, 20 min before surgery in a 20 g mouse (2 µg or 66 µL of 0.03 mg/mL Buprenorphine per mouse).\n2. Skin preparation\nPlace the fully anesthetized mouse in a left lateral position, exposing its right flank to the heating blanket. Shave the right side of the abdomen, just close to the midline to the paraspinal area, and down to the animal's tail.",
    "Disinfect the shaved area three times using a cotton swab with the alternate application of the antiseptic solution or scrub and either 70% alcohol or sterile saline in a circular motion, starting at the surgical incision site and moving outward. Discard the cotton swab after each use. Be careful not to excessively wet non-surgical areas of the animal with alcohol or antiseptic as this can worsen hypothermia.\n\tNOTE: It is important to properly dilute antiseptic solutions and not leave surgical scrubs on the skin during surgery, as they can be irritating and need to be rinsed off. Frequently check the temperature of the heating blanket during the procedure to ensure that the temperature does not fall.\n3. Measure the catheter length and mark the insertion point within the abdomen and the tube tract over the prepared skin\nAssign the access port pocket 1 cm above the animal's tail. Hold the installation segment with the non-dominant index and thumb finger over the assigned area near the tail.\nPlace the catheter above the skin and estimate the place for the catheter's tube insertion within the abdominal cavity. Mark the assigned place for tube insertion, respecting the minimal bending of the tube near the anterior midline.\n\tNOTE: All the procedures must be performed with sterile gloves, and the catheter should be kept sterile during the measurement. Surgical tools must be autoclaved at 121 °C before use. Refer to Supplemental Figure S1 for the instruments required for the procedure.\n4. Customize the peritoneal catheter reservoir section\nPunch a side hole over the frame of the reservoir section with the mouse ear tagger (Figure 1 and Figure 2). It should be noted that the ear punch is a surgical tool, and it needs to be sterile.\n5. Place the instillation port",
    "Make a horizontal 1 cm wide skin incision 1 cm above the tail. Bluntly dissect the subcutaneous plane from the underlying muscular layer to make a pouch for the catheter placement to ensure the instillation port resides in the ideal port pocket freely.\nKeep the iris scissors' tip toward the midline to make an oblique tunnel for the tube placement (Figure 3A).\nPass the 3.0 suture from the customized side hole. Fix the access port to the muscular bed by tightening the passed suture, keeping the tubing course cephalad.\n6. Make the catheter tip insertion site incision\nMake a 1 cm incision over the formerly marked area near the midline. Confirm the well-developed tract by passing scissors through the tract.\nPick the catheter tip gently with forceps to place the catheter in a retrograde course.\n\tNOTE: Avoid pinching the side holes of the tube.\nPass the catheter tube through the prepared tract (Figure 3B). Make a 1 cm incision over the muscular layer close to the right midline.\n7. Confirm the functioning of the catheter\nBefore closing all the incisions, make sure the placed catheter is functional. Check the function with a 1 mL syringe attached to the specific Huber needle for the port.\nInject 200 µL of normal saline into the instillation port. Look for a smooth flow with a zero tolerance for resistance.\nFlush the port and catheter with 10% heparin to maintain patency.\n8. Close the skin incisions\nClose the skin incisions around the port reservoir (Figure 3C) with 3-0 absorbable sutures.\n9. Fix the catheter tip inside the abdominal cavity\nPlace a loose purse-string suture with 4-0 round absorbable suture around the incised abdominal wall muscle. Pass the proximal felt of the catheter inside the incision.",
    "Tighten the prepared purse-string suture around the tube while keeping the second felt outside the purse string, over the muscular layer (Figure 3D), and close the skin with 3-0 absorbable sutures (Figure 2).\n10. Monitor the animals postoperatively and daily, administer postoperative analgesia and fluids, and maintain daily postoperative records for a minimum of 7 days and until complete recovery\nKeep the catheter functional with a daily injection of 200 µL of normal saline through the catheter.\n11. Fluid injections\nConfirm the uneventful postprocedural process by carefully inspecting the skin incision.\nPrepare LPS 2 mg/kg body weight for intraperitoneal injections (i.p.) by diluting 40 µg of the LPS with sterile phosphate-buffered saline (PBS) to the working concentration of 0.2 µg/µL (in essence, 10 µL for 2 µg/g body weight and 200 µL of LPS for 20 g mice).\nStart the injections in the second week following the catheter implantation.\n\t\nHold the animal gently with the non-dominant hand and restrain the instillation port while moving the index and thumb fingers in the cephalad direction.\nDisinfect the skin overlying the reservoir with 70% isopropyl alcohol. Use the syringe attached to the Huber needle to inject the LPS.\n\t\t\nAfter entering the port with the Huber needle, inject 100 µL of normal saline into the port to confirm the patent course.\nInject the prepared 200 µL of LPS, followed by the 100 µL of normal saline for tube irrigation, and make sure there is no resistance.\n12. Anesthetize the mice before harvesting the peritoneum and collect the peritoneal fluid\nFollowing 7 days of LPS injections and 2 weeks of catheter implantation, plan for the peritoneal biopsy.\nPlan for general anesthesia.\n\t\nAnesthetize the mouse in an isoflurane chamber and inject the analgesic subcutaneously.",
    "Hold the animal from the base of the tail, and keep the animal on the dorsum surface of the hand.\nTransfer the animal to the continuous anesthetic induction chamber filled with 3%-4% isoflurane. Confirm adequate general anesthesia by the absence of toe-pinch reflex in the right and left hind limbs. Keep the maintenance of the general anesthesia with isoflurane 1%-3%.\n13. Peritoneal biopsy\nPlace the animal on the heated blanket in the supine position. Make a midline skin incision from the sub-xiphoid to the bladder.\nPerfuse the subfascial plane with cold PBS (Figure 3E).\nMake sure the plane is completely dissected without disturbing the integrity of the peritoneum. Start dissecting the peritoneum from the lateral peritoneal reflection at the left lower quadrant, starting from the hilum to the left flank, and bladder in the lower aspect to keep samples consistent between animals (Figure 3F).\nFollowing the peritoneal harvest, euthanize the animal by cervical dislocation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}