{
  "id": 4816,
  "origin_website": "Bio",
  "title": "Pectin Nanostructure Visualization by Atomic Force Microscopy",
  "procedures": [
    "First preparative step, at the acoustic-isolated and temperature-controlled room, is to turn on air conditioning and all the AFM equipment (PC, monitor, amplifiers…) to avoid background noise during AFM scanning. In the meantime, you can prepare your samples as described next.Sample preparationDilute pectin solution (pectin fractions obtained with CDTA and sodium carbonate buffer) in pure water to 1 mg/ml and heat at 80 °C for 30 min. Make a serial dilution in 10 mM ammonium bicarbonate* to a final concentration of 1-5 μg/ml. The required volume depends on the initial concentration of the sample taking into account that it would only 3 μl would be required for AFM. Dilutions must be prepared freshly just before used. A sublimable buffer is used to prevent deposition of buffer crystals on the mica substrate, because they don´t leave residual salt crystals when evaporates.Warm up the sample at 80 °C for 20 min and immerse in ultrasonic bath* for 10 min. *(only for sodium carbonate fraction; for CDTA fraction both dilution steps are done with pure water and the ultrasonic step is omitted). This step promotes disaggregation of cell wall networks to enable visualization of isolated chains.Reshape the mica to the final size, which will fit the liquid cell, and cleave the sheet by inserting a sharp tip on the corner or peeling off the outer sheets with adhesive tape (Video 1). Always use tweezers to manipulate mica and keep them covered to protect from dust. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. How to cleave the mica  Pipette out 3 μl of the CDTA or sodium carbonate pectin sample onto freshly cleaved mica and dry over a heating stage at 37-40 °C for 20 min, in order to promote even spreading, to reduce molecular aggregation and to sublime off the buffer before imaging.",
    "Note: Incubation times, temperature and dilutions must be optimized for different polymers, always keeping in mind that those parameters must be consistent amongst samples that will be compared with each other. Atomic force microscopyInsert the sample into the liquid cell of the microscope (Figure 1C) and inject 300 μl of tri-distilled butanol into the cell, halfway of the sample approach sequence. The use of butanol as an imaging solvent has a double purpose; it eliminates capillary condensation but also is a precipitant for polysaccharides, so prevents desorbing of the polysaccharide during imaging. AFM tip probe is mounted on the tip holder (Figure 1B; Video 2), inserted into the microscope (Figure 1A-3) and roughly positioned onto the top of the sample using a low-power microscope equipped with a television camera (Figure 1A-2). The sharpness of the tip determines the resolving power of the instrument, so must be carefully manipulated as it can be blunted or contaminated with polysaccharide if driven into direct contact with the substrate.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. How to mount sample on open bucket cell  Align laser and detector beams onto the tip using the four-quadrant photodiode and amplifier (Figure 2). In this case the tips used have a resonant frequency and force constant of 13 KHz and 0.4 N/m, respectively. Align the laser beam: The laser alignment knobs (represented by red arrows in Figure 2B) are used to move the laser in the X and Y directions until the laser spot is positioned on the end of the cantilever (Figure 2D).",
    "An optical microscope is used to visualise the laser spot and cantilever to check if the laser is aligned (Figure 2C-D)Align photodetector to the laser beam: Once the laser is aligned onto the cantilever, two different screws are used (represented with yellow arrows in Figure 2B) to position the photodiode so that it captures the reflected laser spot. Once it detects the reflected laser beam the photodiode must be finely adjusted to position the laser spot to a perfectly central position on the 4 quadrants of the photodiode. If the laser is not properly positioned on the cantilever, it will be impossible to detect the reflected spot with the photodiode. The total voltage generated by the photodetector is shown in the electronic-combined box (Figure 2F). The level of cantilever deflection is shown in Figure 2E. This indicates the voltage difference between the top and bottom segments of the photodetector. For the contact mode, the deflection signal of the photodetector has to be close to zero.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150929/20150929061258_6244.jpgFigure 2. Atomic force microscope basic set-up. A. Atomic force microscope. B. AFM knobs to align the laser beam and photodetector. C. Probe with laser aligned. D. Probe with laser not aligned correctly. E. Photodetector amplifier with axis data. F. Photodetector amplifier with SUM data.Approach the sample to the tip to subtly position the tip onto the sample surface. This step must be done carefully to avoid hitting the tip onto the sample, which will blunt or contaminate the tip and ruin the scanned image. This step is done with the support of an oscilloscope (Figure 3) that reproduces the vibration of the cantilever.",
    "When the tip is far from the sample, the vibration waves will be broad (Figure 3A) and when the tip closely approaches the surface the wave pattern will a make sudden change denoting that tip and sample are establishing contact (Figure 3B). Adjust the force to obtain a good resolution during the scanning. Increasingly in modern AFMs this approach step is automatic.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150929/20150929061816_8961.jpgFigure 3. Oscilloscope output signals when tip and sample are at a far (A) or in correct (B) position. C. Scheme of different tip positions on the sample and its oscilloscope output signal. (see how those lines behave during the approaching sequence in Video 3)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. A general overview of AFM method  Once everything is mounted and aligned, it is recommended to leave the sample and instruments 1 hour at 20 °C to equilibrate temperature and reduce background noise during scanning.The imaging is scanned at a scan speed of 2 Hz.AFM acquires data simultaneously from the movement of the feedback loop in the z-axis to keep a constant force during scanning (topographical mode image), and from the cantilever deflection (error signal image) with additional information about topography. Both topographical (Figure 4B) and error signal (Figure 4A) mode images are collected. Note: See Video 3 for a general overview of AFM method. Further information about alternative scanning modes and AFM in other biological samples are described in Morris et al. (2010). AFM image analysisHeight measurements. The heights of features are analyzed using the AFM software supplied with the instrument (SPM 6.01, ECS, Cambridge, UK), which fits a plane and re-normalizes the AFM images.",
    "Topographical data is crucial for distinguishing true branch points from overlapping chains, where the height is doubled, and these are easily visualized as they appear as bright points at the crossing points on the chain (Figure 4). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150929/20150929062011_1975.jpgFigure 4. AFM image analysis for true branch point verification. A. Representative image of CDTA pectins from ripe strawberry fruit obtained by AFM in contact mode. Branched pectin chains and micellar aggregates with emerging strands can be observed in the image. B. Height profiles, showing the heights in a true branch point (black arrow) of a polymer chain (profile 1) and micellar aggregates (profile 2) with emerging strands of same height than isolated chains (grey arrow) and higher height at the core area (arrowhead). Reprinted from Posé et al. (2015) with permission from Elsevier.Length measurements. The images are converted to TIFF files using Paint Shop Pro v 5.00 software. Image contrast and 3D layouts are performed by Gwyddion v 2.32 software. Then, the images are analyzed offline using ImageJ v1.43u software by plotting the strands with the freehand tool of the software. To determine the chain lengths only isolated chains, defined as individual strands that are not entangled with other strands, that are long enough to be exactly visualized, and which lay entirely within the scanned area are measured. The total length of the chain, including branches if any, is defined as the contour length.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150929/20150929062041_5864.jpgFigure 5. ImageJ workflow. A. First set the scale of your scan size (e.g., 256 pixels correspond to 1,000 nm). B. Chose freehand tool and draw the chains. C. Click CTRL+M and a new data window will prompt with the data measurements. Data analysis for length measurement.",
    "The contour length can be represented by histograms with the frequency of occurrence of particular lengths plot against the molecular length (Figure 6). Because polymers are mixtures of molecules of different molecular weight, they are naturally polydisperse, and their characterization is not well described with a single average. Instead, AFM data is characterized measuring the number-average (imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235112_9325.jpg) and the weight-average (imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235135_8022.jpg) contour length, as well as the ratio of the two average polymer lengths (imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235233_7563.jpg), called polydispersity index (PDI). (imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235310_7127.jpg) is an arithmetic average (a), (imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235336_5464.jpg) is a weight average (b) that compensates the bias of a higher count of small chains over large ones (because is more likely to encounter small chains fully visualized in the scan area), and PDI a parameter to define the breadth of the distribution curve (Posé et al., 2012). This PDI index would be unity for a perfectly monodisperse polymer, so the higher the value the more disperse the polymer. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235437_0745.jpgAn example of the intermediate calculations is included in table 1. Briefly, once contour length data is collected, interval Range should be defined (e.g., 0-25; 25-50; 50-100…), as well as the Frequency for each interval and its Mark Class (average interval range value). Then: Total (N) = Total number of dataSUM1 = ∑ Mark Class x Frequency SUM2 = ∑ Mark Class x SUM1    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235604_8091.jpg= SUM1 / N   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235624_9019.jpg= SUM2 / SUM1 PDI = imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235731_7948.jpgTable 1. AFM contour length analysis and intermediate calculations to obtain LN, LW and PDIimgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928235905_6134.jpgBranching pattern. When true branch points are present, the number of branching points per isolated strand and their lengths can be measured. When equivalent dilutions are employed, the number of branched chains per scanned area can be used to define the percentage of branched polymers within a sample.",
    "Differences in the branching of the polymer chains, presence/absence of side chains and the number of side chains per backbone, are analyzed by a Chi-square test.Statistical distribution. Usually the frequency is a right skewed distribution which does not fit a normal distribution and median (ME) is the statistical parameter to analyze samples with Kruskal–Wallis test (Posé et al., 2012). Further statistical analysis of right skewed distributions data (Figure 6A-B) can be done by fitting a Log normal distribution to the data (Posé et al., 2012). Thus, if original data (L) is transformed by natural logarithm a normal distribution is obtained, and the data can be compared by analysis of variance (ANOVA). Another useful option for sample analysis is the cumulative frequency curves generated by the Log normal function (Figure 6C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150929/20150929062130_3677.jpgFigure 6. Contour length distribution from CDTA (A) and sodium carbonate (B) soluble polymers. Bars represent observed data whilst the curved lines represent Log normal approximations. C. Cumulative frequencies for CDTA (black line) and Na2CO3 (grey line) pectic fractions by Log normal function normalized to the maximum peak obtained in each profile. N = 379 and 372 for CDTA and Na2CO3 samples, respectively. Reprinted from Posé et al. (2012) with permission from Elsevier.Note: It is recommended to analyze at least three dozen AFM images for each condition, with a minimum of 100 independent measurements of isolated chains from different images, to obtain a representative sample. Once everything is optimized, an AFM image is done every 5 min. See Video 3 for a general overview of AFM method."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}