{
  "id": 17695,
  "origin_website": "Jove",
  "title": "A Mouse Model of Incompletely Resected Soft Tissue Sarcoma for Testing (Neo)adjuvant Therapies",
  "procedures": [
    "Animals used in these experiments were obtained from the Animal Resource Centre (Perth, Western Australia). Animals were maintained under standard pathogen-free conditions at the Harry Perkins Institute of Medical Research Bioresources North Facility (Perth, Western Australia). All experiments were carried out following the protocol as approved by the Harry Perkins Institute of Medical Research Animal Ethics Committee. BALB/c mice of 8-12 weeks of age were used in these experiments. The WEHI 164 fibrosarcoma cell line was obtained from CellBank Australia (Westmead, NSW).\n1. Inoculation of cells\nPreparation of cells and animals\n\t\nEnsure that the cell line is maintained in the recommended media. For example, maintain WEHI 164 cell line in Roswell Park Memorial Institute (RPMI) 1640 medium supplemented with 2 mM L-glutamine, 10% fetal bovine serum, 20 mM HEPES, 0.05 mM 2-mercaptoethanol, 100 U/mL penicillin, and 100 µg/mL streptomycin.\n\t\tNOTE: Passage cells at least 3 and up to 5 times after being removed from cryogenic storage. To ensure an optimum cell viability, cells should be split when they are between 70-80% confluent. Tumor cell lines should be tested for mycoplasma, as infection can alter the cell growth and influence the immune response in vivo.\nOne day before inoculation, shave mice on the lower right flank using clippers.\n\t\tNOTE: Female BALB/c mice, aged between 8-12 weeks, of normal weight (16 -22 grams) were used in this experiment.\nOn the day of inoculation, harvest WEHI 164 cells when 70-80% confluent by trypsinization.\n\t\t\nAspirate the culture medium from the tissue culture flasks and then add sterile phosphate buffered solution (1x PBS), to remove remaining traces of fetal bovine serum (FBS).",
    "Aspirate the PBS from the tissue culture flasks. Add 3 mL of 0.05% trypsin (for a T75 flask) and then swirl the flask so that the whole surface of flask with cells is covered by trypsin.\nIncubate the flask at 37 °C, 5% CO2 incubator for 3 min. Check cells periodically, by tapping on the sides of the flask to see if cells have dislodged.\nRemove flasks from cell culture incubator and add 5 mL of media supplemented with FBS to neutralize the trypsin.\n\t\t\tNOTE: Do not leave cells in trypsin longer than necessary, as this can damage cells and lead to low cell viability.\nPipet suspension multiple times to obtain a single cell suspension. Transfer cell suspension to a conical centrifuge tube.\nPellet cells by spinning at 350 x g for 3 min.\nWash the cells three times in 1x PBS.\n\t\t\nResuspend cells in 50 mL of sterile 1x PBS and wash cells by pipetting cell suspension up and down. Pellet cells by spinning at 350 x g for 3 min.\nAspirate the supernatant and resuspend cells in 15 mL of sterile 1x PBS. Wash cells by pipetting cell suspension up and down. Pellet cells by spinning at 350 x g for 3 min.\nAspirate the supernatant and resuspend cells in exactly 10 mL of sterile 1x PBS. Wash cells as in step 1.1.4.2 and transfer a small amount (approximately 100 µL) of cell suspension to an centrifuge tube for counting. Pellet cells by spinning at 350 x g for 3 min.\nDetermine the cell number using the Trypan blue exclusion method by either using a hemocytometer or an automated cell counter. Resuspend cells in sterile 1x PBS at a concentration of 5 x 106 cells/mL. Keep cell suspension on ice.",
    "NOTE: The viability of tumor cells should be equal or above 80 % to ensure reproducible tumor growth.\nSubcutaneous inoculation\n\t\nMix the cell suspension thoroughly and fill a syringe with a 26 G needle with 100 µL of cell suspension (5 x 105 cells) in sterile 1x PBS. Repeat mixing of cells before loading the next syringe.\n\t\tNOTE: Keep cells on ice throughout the procedure to maintain viability.\nRestrain the mouse appropriately, ensuring access to the lower-right flank. Inoculate the mouse subcutaneously on the shaved lower-right flank.\n\t\tNOTE: Make sure the inoculation is not in the peritoneum by lifting the needle slightly, which should be visible under the skin. A bubble-like lump should form under the skin following inoculation.\nMonitor mice as required by the applicable ethics approval and perform surgical resection when the tumours have grown to a size of about 50 mm2.\n2. Partial surgical resection of the tumor\nNOTE: This protocol requires TWO researchers; one for surgical procedures (SURGEON), and another for mouse monitoring (ASSISTANT).\nSurgery setup\n\t\nOn day 12 post inoculation, when tumors have reached a size of approximately 50 mm2, dose mice with 100 µL (0.1 mg/kg) of buprenorphine s.c. in the scruff of the neck, 30 minutes prior to surgery.\nSet up the surgical area with a heat pad covered with bench coat and set up a nose cone for anaesthesia. Sterilize surgical tools prior to use, and between each animal using a heat bead sterilizer, allowing tools to cool before use. Have the following surgical equipment clean and within easy reach: chlorhexidine, swab, gauze, eye gel, two curved forceps, scissors, clip applicator, clip remover, clip refills (Figure 2A, 2B).",
    "Warm the heating chamber to 37 °C and set up another heat pad for recovery (Figure 2C). Place sterilized tools on a sterile surface such as autoclaved pads.\nAnesthesia\n\t\nPlace the mouse in the induction chamber and anesthetize the mouse with 4% isoflurane (4% in 100% oxygen at a flow rate of 1 L/min) until the breathing rate slows to approximately 60 breaths per minute (1 per second) (this usually takes <1 min).\n\t\tNOTE: Do not leave the mouse in the chamber for too long as that may lead to asphyxiation and death. Only have one mouse under anesthesia at a time.\nTransfer the mouse onto the heat pad on the surgery table, place the mouse with its nose in the nose cone and maintain the anesthetic state with 3-4% isoflurane in 100% oxygen at a flow rate of 0.5 L/min. Monitor the breathing rate to ensure that the depth of anesthesia is maintained.\n\t\tNOTE: The ASSISTANT must monitor the breathing of the mouse throughout the surgery to ensure the correct level of anesthesia is maintained. Lower the anesthetic concentration if breathing becomes too slow or increase the concentration if the depth of anesthesia is too shallow. If the mouse begins gasping, remove mouse from the nose cone, decrease the anesthetic concentration, and wait until breathing normalises before placing on the nose cone again.\nPerform a \"pinch test\" and \"corneal reflex test\"14 to ensure that the mouse is fully anesthetized before commencing surgery.\n\t\tNOTE: Movement of any part of the mouse is an indication that the mouse is not fully anesthetized. The animal should immediately be given additional anesthetic by increasing the anesthetic concentration.\nCover the mouse's eyes with a small amount of ophthalmic gel to avoid eye dryness.\nSurgical procedure (SURGEON)",
    "Swab the surgical area 3 times with alcoholic chlorhexidine. Using forceps and a pair of scissors, make a 1 cm straight incision along the dorsal side, 3 mm away from the tumor (Figure 3A, 3B).\n\t\tNOTE: Standardizing the incision to 1 cm in every mouse (using a ruler) allows for even assessment of wound healing between mice. Locating the incision 3 mm away from the tumor allows for subsequent intratumoral adjuvant therapy without leakage from the wound.\nUsing tweezers, pull away the facia and subcutaneous fatty tissue between the tumor and peritoneum. The subcutaneous tumor is normally attached to the skin-side.\nOpen the wound by gently holding the skin on the tumor bearing side using tweezers, and \"invert\" the tumor so that it is visible outside (Figure 3C, 3D).\n\t\tNOTE: The section of tumor to be debulked should be closest to the opening, to have enough skin to close the wound. Be careful not to cut the skin when removing the tumor.\nUsing a pair of scissors, cut away the tumor capsule from the half to remove, starting from the base of the tumor closest to the opening.\nFor 50% debulk surgery, cut across the middle of the tumor. Using curved forceps, scoop up the section of the tumor to be removed (50%); scoop up any remnants from the debulked area.\nFor 75% debulk, perform a 50% tumor debulk as in part 2.3.5 above. Then cut in half the remaining 50% of tumor and scoop up 25% of the tumor, using curved forceps as described above.\nClosing the surgical site\n\t\nPlace the remaining tumor back underneath the skin, and using forceps, pull the skin flaps together and line up the skin along the wound.",
    "Hold the skin together 5 mm from the edge of the wound, and use surgical clips to close the wound, starting on the side closest to the forceps. Apply as many clips as needed to ensure no underlying tissue is exposed. Generally, three to four clips are applied with 2 mm gaps between clips.\n\t\tNOTE: If any clips is not well applied, remove it using a clip remover and replace with new clips.\nRecovery of mice (ASSISTANT)\n\t\nAllow the mice to recover by putting them into the warm (37 °C) heating chamber.\nPlace the mouse's cage on the heat pad. Monitor the mice in the heating chamber until they have recovered from the anesthetic (awake and walking) and then put the mice back into the cage. Leave the cage on the heat pad for a further 10 minutes, until the mice have become more active.\nGive the mice wet and soft food. Monitor the mice 1 hour after surgery for recovery and ensure clips remain in place. Ensure the cage is half on/half off the heat pad to allow animals to self-regulate temperature while unattended.\nDose mice with 0.1 mg/kg buprenorphine (100 µL subcutaneously in the scruff of the neck), 6-8 hours after surgery (at the end of the day). Monitor mice early the following morning, and dose mice again with 0.1 mg/kg buprenorphine (100 µL subcutaneously in the scruff of the neck). Give more wet food as needed.\nMonitor mice daily for the next seven days. Clips may be removed after seven days using the clip remover.\nAdjuvant or neoadjuvant treatment\n\t\nTreat mice peri-operatively with (neo)adjuvant therapy at any given time, depending on the treatment of interest.",
    "For example, treat mice with one dose of 100 µg of anti-CTLA-4 intraperitoneally (i.p.) on day 15 after inoculation, or with three doses of 200 µg anti-PD-1 i.p. on day 15, 17 and 19 after inoculation.\nExperimental controls\n\t\nWhen using this model to assess the effects of inflammation/wound healing, consider using the following control groups: 1) No-surgery control (treatments can still be administered intratumorally); 2) Sham surgery control: A surgical incision is made in the skin; the tumor is manipulated and exposed, but no tumor tissue is removed; the wound is closed with clips.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}