{
  "id": 15384,
  "origin_website": "Jove",
  "title": "Tools to Study the Role of Architectural Protein HMGB1 in the Processing of Helix Distorting, Site-specific DNA Interstrand Crosslinks",
  "procedures": [
    "1. Preparation of TFO-directed ICLs on Plasmid Substrates\nIncubate equimolar amounts of plasmid pSupFG110,11 DNA (5 µg plasmid DNA is a good starting point) with psoralen-conjugated TFO AG30 in 8 µl of triplex binding buffer [50% glycerol, 10 mM Tris (pH 7.6), 10 mM MgCl2] and dH2O to a final volume of 40 µl in an amber tube. Mix thoroughly by pipetting up and down. Incubate the reaction at 37 °C water bath for 12 hr.\nWarm up the UVA lamp to ensure full power output. Place the triplex reaction on paraffin film, and place the paraffin film on ice under the UVA (365 nM) lamp. Place a Mylar filter between the lamp and the reaction.\nUVA irradiate for a total dose of 1.8 J/cm2. Store the samples at 4 °C for further use.\n\tCaution: Wear proper protective eyewear and clothing with UVA irradiation.\nLinearize 200 ng of the above prepared plasmid with the restriction enzyme EcoR1 in a 20 µl total volume using the manufacturer supplied 10x buffer. Heat denature the enzyme for 20 min at 65 °C. Spin the samples for 10 min at 10,000 x g and store at 4 °C.\nPrepare 50x alkaline buffer [1.5 M NaOH, 50 mM Ethylenediaminetetraacetic acid (EDTA)]. Add 0.5 mg of agarose to 50 ml dH2O. Boil to dissolve the agarose and place it in a 50 °C water bath.\nAfter the temperature of the dissolved agarose is down to 50 °C, add 1 ml of the 50x alkaline buffer, mix it and then pour the gel into the gel tray. Allow time for the gel to solidify at room temperature prior to use.\nAdd 4 µl of 0.5 M EDTA to the 20 µl of linearized DNA sample and incubate for 10 min at room temperature.",
    "Add 6x alkaline gel loading buffer (300 mM NaOH, 6 mM EDTA, 18% (w/v) high molecular weight polysaccharide, 0.06% Bromocresol Green in dH2O) to the samples and to a 1 kb DNA ladder.\n\tNOTE: It is important to use 6x alkaline gel loading buffer, please see discussion.\nLoad samples onto the gel in the cold room and run overnight in 1x alkaline buffer (12-16 hr) at 3.2 volts per cm. Once the samples have entered the gel, place a glass plate on top of the gel to prevent it from floating.\nNeutralize the samples by soaking the gel in neutralization buffer [1 M Tris-Cl (pH 7.6), 1.5 M NaCl, 3 M sodium acetate (pH 5.2)] for 45 min at room temperature.\nStain the gel for DNA with 4 µl of 1% ethidium bromide (EtBr) in 50 ml water for 1 hr at room temperature. Destain with water for 15 min. Visualize the DNA by using an imaging system.\n\tCaution: EtBr is a potent mutagen and can be absorbed through the skin. Avoid direct contact with EtBr.\n2. Transfection and Immunoprecipitation of TFO-directed ICL-containing Plasmids in Human Cells\nPlate 400,000 mammalian cells (e.g., U2OS osteosarcoma cells) per 60 mm dish in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum (FBS) without antibiotics 24 hr before transfection. Incubate cells overnight at 37 °C with 5% CO2.\nPrior to transfection, warm growth media and phosphate buffered saline (PBS) to 37 °C in a water bath. Warm the transfection reagent to room temperature.\nIncubate 30 µl of transfection reagent with 500 µl of 1x growth media (mix 1) and 2 µg of TFO-directed ICL-containing plasmids in 500 µl of 1x growth media (mix 2) in separate 14 ml round bottom tubes for 10 min at room temperature.",
    "Add mix 1 to mix 2, mix well by pipetting up and down. Incubate for 25-30 min at room temperature.\nWash cells twice with warm PBS. Add the transfection mix in a drop-wise fashion distributing evenly throughout the plate of cells. Add 1 ml of growth media to the plate and bring the final volume to 2 ml. Mix well. Place the culture plates in the 37 °C incubator with 5% CO2 for 4 hr.\nReplace the media with 3 ml growth media supplemented with 10% FBS, and incubate further for 16 hr. Do not use antibiotics.\nTreat cells with 80 µl of 37% fresh formaldehyde per plate to a final concentration of approximately 1% and incubate for 10 min at room temperature in the absence of light.\n\tCaution: Formaldehyde is toxic and should be handled according to its safety instructions. Formaldehyde exposure can cause harm to skin, eye and respiratory tract.\nQuench formaldehyde crosslinking by adding 300 µl of chilled glycine (supplied in commercially available kits) per plate and incubating for 5 min. Remove the media and wash twice with chilled PBS, and then collect cells by scraping in 1 ml chilled (4 °C) PBS into a microcentrifuge tube. Keep the samples on ice at all times.\nPrepare cell pellets by centrifuging at 4 °C for 5 min at 13,400 x g using a tabletop refrigerated centrifuge. Pipet out the supernatant and place the cell pellet on ice.\nHomogeneously resuspend the pellet in 1 ml chilled (4 °C) Buffer A (supplied in commercially available kits) and incubate on ice for 10 min. Mix occasionally by inverting the tube. Pellet cells as before (see step 2.9 above).",
    "Homogeneously resuspend the pellet in 1 ml chilled (4 °C) Buffer B (supplied in commercially available kits) and incubate on ice for 10 min with occasional mixing by inverting. Pellet cells by centrifugation as before (see step 2.9 above).\nResuspend the cells again in 200 µl chilled Buffer B. Add 2 µl of Micrococcal nuclease (MNase) and incubate at room temperature for 10 min. Mix reaction occasionally by flicking the tube. Stop the MNase reaction by placing the tube on ice and adding 40 mM EDTA. Pellet cells as before (see step 2.9 above).\nResuspend cells in 100 µl 1x chromatin immunoprecipitation buffer (ChIP) buffer (supplied in commercially available kits) supplemented with protease inhibitor cocktail.\nPlace the resuspended cells in a thin-walled microfuge tube. Sonicate the samples by floating them on water bath sonicator for 20 sec followed by 20 sec incubation on ice. Repeat sonication steps 9 times to generate ~800-1,200 bp fragments.\n\t\nTo 20 µl of the sonicated samples add 3 µl 5 M NaCl and 1 µl RNase A. Mix well by vortexing and incubate at 37 °C for 30 min. Subsequently, add 2 µl Proteinase K and incubate for 2 hr at 65 °C. Purify the samples using a PCR purification kit. Run samples on 1% agarose gel and visualize with EtBr.\n\t\tNOTE: Maximum intensity of the resulting DNA should be at or under 1,000 bp.\nIn three separate tubes, add 30 µl of lysate in a pre-chilled siliconized tube and then add 70 µl of chilled 1x ChIP buffer with added protease inhibitors. Add 1 µg of anti-immunoglobulin G (IgG), anti-histone H3 (as a positive control), or anti-HMGB1 antibodies to the respective tubes. Incubate overnight in a cold room with continuous rotation.",
    "Resuspend protein G beads homogeneously in the cold room. Add 4 µl of protein G beads per tube and incubate for another 2-4 hr in the cold room with rotation.\nUsing a magnetic rack, pellet the beads and remove the supernatant. Add 200 µl 1x ChIP buffer mixed with protease inhibitor cocktail to the pellet and wash for 5 min in the cold room with rotation. Repeat wash twice.\nPerform one additional wash with high salt 1x ChIP buffer (containing 70 mM NaCl).\nResuspend the pellets with 160 µl elution buffer (supplied in commercially available kits) and incubate at 37 °C with rotation for 30 min.\nPellet the beads and collect the supernatant in a fresh tube. Add 6 µl of 5 M NaCl and 2 µl of proteinase K, and incubate overnight at 65 °C.\nPurify the DNA using a PCR product purification kit and elute the DNA using 50 µl dH2O.\nPerform PCR16 reactions using primer sets to the region(s) of interest, and resolve the products on a 1% agarose gel stained with EtBr.\n3. Supercoiling Assay and 2-dimensional Agarose Gel Electrophoresis\nPrepare DNA repair synthesis buffer (45 mM Hepes-KOH, pH 7.8; 70 mM KCl; 7.4 mM MgCl2; 0.9 mM DTT; 0.4 mM EDTA; 2 mM ATP, 20 µM dNTPs, 3.4% glycerol and 18 µg bovine serum albumin). Store at -80 °C. Thaw on ice and prior to use add 40 mM phosphocreatine and 2.5 µg creatine phosphokinase.\nPrepare 10x supercoiling buffer [500 mM Tris (pH 8.0), 500 mM NaCl, 25 mM MgCl2, 1 mM EDTA], and store at room temperature.\nLinearize 300 ng of supercoiled plasmid pSupFG1 DNA completely using 1 µl Vaccinia Topoisomerase I (5-15 U/µl) with 1x supercoiling buffer in a 10 µl reaction. Incubate the mixture at 37 °C for 1 hr.",
    "Thaw HeLa cell-free extract24 on ice. To the completely relaxed plasmids, add 25 µl HeLa cell-free extract and DNA repair synthesis buffer. Mix well. Add additional 1 µl of Vaccinia Topoisomerase I to the mix, and incubate for 1 hr at 37 °C.\nTerminate the reactions by adding sodium dodecyl sulfate (SDS) (1% final concentration) and proteinase K (0.25 mg/ml final concentration). Incubate at 65 °C for 2 hr.\nCast a 1% agarose gel with 1x Tris Borate EDTA (TBE) buffer. Add DNA loading dye and load the reactions directly onto the gel at least 4 lanes apart. Run the gel for 8-10 hr at 2 V/cm in 1x TBE (dimension 1) at room temperature to resolve the topoisomers.\n\tNOTE: Prepare a 5x TBE stock solution in 1 L of dH2O by adding 54 g of Tris base. 27.5 g of boric acid and 20 ml of 0.5 M EDTA (pH 8.0).\nPrepare 2 L of 1x TBE with 3 µg/ml chloroquine-phosphate. Soak the gel in 200 ml of this solution for 20 min. Cover the gel tray with aluminum foil.\nTo electrophorese the gel in the second dimension, turn the gel 90° in a clockwise fashion and run it for 4-6 hr at 2 V/cm in chloroquine containing 1x TBE to resolve the positive and negative supercoils.\nStain the gel with EtBr for 1 hr on a rocker. Destain the gel with dH2O for 15 min and subsequently visualize the thermal distribution of the topoisomers using an imager.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}