{
  "id": 3276,
  "origin_website": "Cell",
  "title": "Protocol for siRNA-mediated TET1 knockdown during differentiation of human embryonic stem cells into definitive endoderm cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell culture of hES before induction of hDE\nTiming: ∼6 days\nIn this step, we describe how to passage and culture hES cells before inducing them into hDE cells. We also outline the conditions that must be met for successful hDE induction.\nRecovery of hES cells.\nAdd 1 mL of diluted Matrigel per well of 6 well plate, let the plate sit at 37°C for 0.5–1 h.\nNote: Matrigel is used here as a substrate for cell attachment.\nTurn on a water bath and maintain the temperature at 37°C.\nRetrieve the cell cryovials from liquid nitrogen.\nRoll the vial between gloved hands for 3–5 s to remove the frost.\nImmerse the cryovials to the 37°C water bath quickly.\nGently swirl the cryovials, monitor the thaw process by holding the vial up to the light to assess the size of the ice crystals.\nNote: Do not submerge the cap of the vial in the water bath as this could contaminate the cells.\nWhen only small ice crystal remains, thoroughly wipe the cryovials with 75% alcohol to sterilize.\nTransfer the contents of the cryovials to a 15 mL centrifuge tube.\nSlowly add 5 mL of mTeSR1 medium (containing 10 μM Y27632) to the cells in the 15 mL centrifuge tube. When adding the medium, gently rock the tube back and forth to ensure the osmotic pressure of the cells remains stable.",
    "Note: The additional of Y27632 in this step is necessary to improve cell survival since the cells were in a single-cell state. Usually, when repleting cells that have been digested into a single-cell state, the addition of Y27632 is required to improve cell viability. However, if cells are in a clonal state during repletion, Y27632 is no necessary. Additionally, when replacing the culture medium after cells have attached well to the substrate (for example, in step 1.m), Y27632 is also not required.\nCentrifuge the cells at 250 g for 5 min.\nCarefully aspirate the supernatant.\nNote: Remove as much supernatant as possible but be careful not to aspirate the cell pellet.\nRe-suspend the pellet by adding 1 mL of mTeSR1 medium (containing 10 μM Y27632) and pipetting gently several times.\nAspirate Matrigel from the 6 well plate. Then:\nSlowly add all the 1 mL of the hES cell suspension to the well.\nAdd an addition 1 mL mTeSR1 medium (containing 10 μM Y27632) to bring the total amount of medium to 2 mL.\nCarefully slide the plate forward-to-back and side-to-side to ensure even cell distribution, then place the plate into the 37°C incubator.\nObserve the cell growth under the microscope daily and replace 2 mL of fresh mTeSR1 medium (without Y27632) for each well.\nhES culture and passaging.\nAfter hES culture for 4–7 days, we observed cell morphology under a microscope to determine when to passage and amplify the cells.\nThe clone boundaries are clear, the nuclear material is uniform, the nucleoli are prominent, the center appears bright lipid droplets, and there is no fusion between clones.\nConfluence rate reach to 85%.",
    "Note: If the passaging is performed too early, the cells may not adhere well, resulting in a lower yield and increase risk of differentiation. And if the passaging is performed too late, the cells may undergo excessive growth leading to spontaneous differentiation.\nPre-warm DMEM/F12 medium, 0.5 mM EDTA, and mTeSR1 medium at 15°C–25°C.\nAdd 1 mL of diluted Matrigel per well of 6 well plate, let the plate sit at 37°C for 0.5–1 h.\nBefore digesting the cells, observe the cells under microscope and take pictures of the cells.\nAspirate the supernatant, and 1 mL of DMEM/F12 medium to each well to wash, aspirate, and add 1 mL of 0.5 mM EDTA. Incubate at 37°C for 5 min.\nObserve digestion of the cells in each well under the microscope. When bright gaps between cells are visible, aspirate the EDTA and add 1 mL of mTeSR1 medium.\nGently pipette the cells in an up-to-down, left-to-right sequence to dislodge the cells from the plate, avoiding forceful pipetting that may lead to the cells being dislodged in too small clusters.\nAspirate the Matrigel from each well of the Matrigel plate (step c.), add 1.5 mL of mTeSR1 medium, and label the cell line name, passage number, and date of passaging.\nSlowly pipette the cell suspension into the wells at an appropriate ratio (usually 1: 3 to1: 20).\nGently slide the plate forward-to-back and side-to-side to ensure even cell distribution.\nThen gently slide the plate once before placing it in the incubate and leaving it undisturbed.\nCulture at 37°C with 5% CO2.\nObserve the cell growth under the microscope daily and replace 2 mL of fresh medium for each well.\nWhen hES cells are growing well and not differentiated, induction of definitive endoderm (DE) cells can be initiated.\nInducing ES differentiate to DE cells",
    "Timing: ∼6 days\nThe procedures below describe how to differentiate hES cells into hDE cells, isolate RNA and perform qPCR assays to evaluate the efficiency of differentiation.\nPreparations before hDE cells induction.\nPre-warm DMEM/F12 medium, 0.5 mM EDTA, and mTeSR1 medium at 15°C–25°C.\nAdd 0.5 mL of diluted Matrigel per well of 12 well plate, let the plate sit at 37°C for 0.5–1 h.\nAspirate the supernatant (hES cells in 6-well plate of Step 2), and 1 mL of DMEM/F12 medium to each well to wash, aspirate, and add 1 mL of accutase. Incubate at 37°C for 7 min.\nWhile the hES cells are incubated with accutase, aspirate the Matrigel from each well of the Matrigel plate (step c.), add 1 mL of mTeSR1 medium (containing 10 μM Y27632).\nObserve digestion of the cells in each well under the microscope. When bright gaps between cells are visible, add 1 mL mTeSR1 medium (containing 10 μM Y27632) and gently pipette the cells to generate single-cell suspension.\nTransfer the cell suspension to a 15 mL centrifuge tube and centrifuge at 250 g for 5 min.\nCarefully aspirate the supernatant and add 1 mL mTeSR1 medium (contain 10 μM Y27632), gently pipette to suspend the cells.\nAspirate 20 μL of the cell suspension and add 20 μL of trypan blue dye to calculate the number of viable cells.\nSlowly pipette the cell suspension into each well at a density of 400,000 cells per well of 12-well plate.\nSlide the plate gently forward-to-back to side-to-side to ensure an even distribution of cells.\nPlace the plate in the incubator, culture at 37°C with 5% CO2.\nPrepare DE induction medium as followed recipes:",
    "D1 medium: RPMI1640 base medium + Activin A (final concentration: 100 ng/mL) + CHIR99021 (final concentration: 3 μM) + BSA (final concentration: 5 mg/mL).\nD2 medium: RPMI1640 base medium + Activin A (final concentration:100 ng/mL) + ITS supplement (final concentration: 0.1%) + BSA (final concentration: 5 mg/mL).\nD3 medium: RPMI1640 base medium + Activin A (final concentration: 100 ng/mL) + ITS supplement (final concentration: 1%) + BSA (final concentration: 5 mg/mL)\nThe induction of DE.\nThe next day (denoted as D0), confirm cell growth under the microscope, replace the medium in each well with 1 mL of D1 induction medium.\nOn Day 1 (24 h later), remove the D1 induction medium from each well, and add 1 mL of D2 induction medium.\nOn Day 2 (another 24 h later), remove the D2 induction medium from each well, and add 1 mL of D3 induction medium.\nOn Day 3 (an additional 24 h later), the induction process is complete, proceed to next step.\nExamine Cell morphology and collect cell samples.\nExamine Cell Morphology under microscopy (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2868-Fig1.jpg\nFigure 1. Cell morphology during the 4-day induction of hESC to hDE cells under microscopy\n(A‒D) four panels showing cell morphology on days 0–3 of induction, respectively.\nCell collections.\ndiscard the medium and wash the cells with 2 mL of 1× PBS.\nDetach the cells from the surface using 1 mL of EDTA at 37°C for 5 min.\nUse a pipette tip to pipette the sample up and down several times to disperse the cells, and then transfer it to a 1.5 mL EP tube.\nCentrifugation at 250 g for 5 min, and then discard the EDTA solution carefully with pipette.\nAdd different reagents depending on the intended use.",
    "For RNA isolation, add 1 mL of Trizol to each cell sample and pipette vigorously several times to lyse the cells. Perform RNA isolation immediately or store at –80°C.\nFor DNA isolation, add 200 μL of buffer GA from the kit TIANamp Genomic DNA Kit, perform DNA isolation intermittently or stored at –20°C.\nRNA isolation.\nAdd 200 μL Chloroform (If the samples are stored at −80°C, they should be taken out from the freezer and fully thawed at 15°C–25°C before adding chloroform).\nMix the sample thoroughly by repeated inversion, incubate for 2 min at 15°C–25°C.\nRepeat the above step for three more times.\nCentrifugate at 12000 rpm (∼ 13000 g) for 15 min at 4°C.\nDuring centrifugation, prepare a new EP tube containing 400 μL of isopropanol for each sample and place them on ice.\nCarefully pipette 400 μL of the top transparent liquid (aqueous phase) and transfer it to the EP tube containing pre-chilled isopropanol.\nNote: Take care not to aspirate the middle interphase and lower organic phase.\nMix it thoroughly by repeated inversion for 15 s, place it on ice and incubate for 10 min.\nCentrifugate at 12000 rpm (∼13000 g) for 10 min at 4°C.\nDiscard the supernatant, be careful not to discard the precipitate.\nAdd 700 μL of 75% ethanol, which has been freshly prepared and pre-cooled on ice, to the precipitate. Invert the mixture several times to thoroughly wash the precipitate.\nCentrifugate at 12000 rpm (about 13000 g) for 5 min at 4°C, then discard the supernatant.\nCentrifugate at 12000 rpm (about 13000 g) for 3 min, and then Carefully remove the residual ethanol completely using a micropipette.\nAllow the precipitate to air-dry for 10 min at 15°C–25°C.\nDissolve the precipitate in an appropriate amount of RNase-free water, then incubate at 55°C for 10 min.",
    "Measure the concentration of isolated RNA in a NanoDrop;\nAssess the quality of isolated RNA by gel electrophoresis. The RNA can be stored at −80°C for several months.\nSynthesis of cDNA.\nSynthesis cDNA using the kit PrimeScript RT Master Mix, following manufacture’s instruction (https://www.takarabio.com/documents/User%20Manual/RR036A_e.v2008Da.pdf[href=https://www.takarabio.com/documents/User%20Manual/RR036A_e.v2008Da.pdf]) (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2868_2.csv\nNote: During the preparation of the mix, the RNA should be kept on ice.\nPerform the reverse-transcription reaction after gently mixing the reaction solution. Star the cDNA synthesis program as shown in Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_2868_3.csv\nExamine the hDE inducing efficiency through qRT-PCR.\nPerform qPCR experiments using the “ChamQ Universal SYBR qPCR Master Mix” kit from Vazyme, following manufacture’s instruction https://www.vazyme.com/product/167.html[href=https://www.vazyme.com/product/167.html].\nPrepare qRT-PCR mix (Table 3[href=https://www.wicell.org#tbl3]) and primer mix (Table 4[href=https://www.wicell.org#tbl4]) as tables below.\ntable:files/protocols_protocol_2868_4.csv\ntable:files/protocols_protocol_2868_5.csv\nNote: Before preparation of the qRT-PCR mix, dilute the cDNA synthesized in step 6 to a concentration of 1/10 for use.\nPerform qPCR program shown below.\nWe use the CFX Connect Real-Time PCR Detection System (Bio-rad) for qRT-PCR, to detect the expression of FOXA2 and SOX17, two marker genes of hDE cells,5[href=https://www.wicell.org#bib5] as well as LTR6B, a transposable element that is specifically expressed in DE cells. The primers used in this study is provided in the resource table. More applicable primers of most of genes can be search in PrimerBank6[href=https://www.wicell.org#bib6] (https://pga.mgh.harvard.edu/primerbank[href=https://pga.mgh.harvard.edu/primerbank]).\nIn a 96-well white plate, pipet 7.5 μL of the qRT-PCR mix into each well.\nPipet 2.5 μL of primer mix to each well.\nPlace the 96-well plate in a centrifuge equipped with a suited rotor.\nCentrifuge at 4000 rpm for 2 min at 4°C.\nLoad the 96-well plate into the Real-Time PCR Detection System.\nStar the PCR program as shown in Table 5[href=https://www.wicell.org#tbl5].\ntable:files/protocols_protocol_2868_6.csv\nCalculate relative expression.",
    "The relative expression of FOXA2, SOX17 and LTR6B in relation to the endogenous reference gene β-actin was calculated using the “ΔCt” method (references).\nThe relative expression was determined as follows:\nΔ\nC\nt\n=\nC\nt\nD\nE\n−\nC\nt\nE\nS\nR\ne\nl\na\nt\ni\nv\ne\nE\nx\np\nr\ne\ns\ns\ni\no\nn\n=\n2\n−\n(\nΔ\nC\nt\n)\nThis method gives the mRNA transcript level of FOXA2 or SOX 17 in DE cells relative to in ES cells (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2868-Fig2.jpg\nFigure 2. qPCR results and immunofluorescence staining showing expression of hDE marker genes and LTR6B after induction of DE cells\n(A‒C) Relative expression of SOX17 (A), FOXA2 (B) and LTR6B (C) was measured using qPCR with triple biological replicates. The relative expression levels of each gene were calculated using delta Ct method and normalized to endogenous reference gene β-Actin, presented as mean ± SEM.\n(D) Immunostaining of SOX17 and FOXA2 at the DE stage (at D3).\nsiRNA knockdown of TET1 during induction of DE cells\nTiming: ∼6 days\nIn below steps, we utilized siRNA to suppress TET1 expression during DE induction. Briefly, we induced DE cells as described in step 3–4 and performed two rounds of siRNA transfection to enhance the repression effect. The first round was performed simultaneously when cell seeding, and the second at D0, 24 h after the first transfection.\nTransfection of siRNA of hTET1, using NC siRNA as control.\nDissolve siRNA with RNAse-free water to a concentration of 20 μM.\nSiRNA is transfected using Lipofectamine™ RNAiMAX kit from ThermoFisher, following the manufacturer’s protocol https://www.thermofisher.cn/cn/zh/home/life-science/cell-culture/transfection/rnai-transfection/rnai-transfection-protocols.html[href=https://www.thermofisher.cn/cn/zh/home/life-science/cell-culture/transfection/rnai-transfection/rnai-transfection-protocols.html].\nFor each round of transfection, prepare transfection mix shown below (Lipid dilution shown in Table 6[href=https://www.wicell.org#tbl6] and siRNA dilution shown in Table 7[href=https://www.wicell.org#tbl7]).\ntable:files/protocols_protocol_2868_7.csv\ntable:files/protocols_protocol_2868_8.csv",
    "∗For NC siRNA (negative control), add 7.5 μL directly.\nAdd the siRNA dilution to the lipid solution (1:1) and incubate for 5 min at 15°C–25°C.\nThe first round of transfection was performed when cell seeding. Add the siRNA-lipid mixture to cells.\n8 h later, aspirate the medium containing siRNA, replace with fresh mTeSR1 medium (contain 10 μM Y27632).\n16 h later, replace the medium with D1 induction medium and performed the second round of transfection simultaneously.\n8 h later, aspirate the medium containing siRNA-lipid mixture, replace with fresh D1 induction medium.\nAfter culturing the cells for 16 h, replace the D1 medium with D2 induction medium.\nCulture the cells for another 24 h before replacing the D2 medium with D3 medium.\nAllow the cells to continue to culture for an additional 24 h to complete the DE induction process.\nCheck the cell morphology under microscope to confirm the ES cells have been successfully induced to DE cells (Figure 3[href=https://www.wicell.org#fig3]) and collect cell samples according to step 4.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2868-Fig3.jpg\nFigure 3. Cell morphology during the 4-day induction of hDE cells under conditions of transfection of siNC (Negative Control) and siTET1 (TET1 siRNA)\n(A‒D) four panels showing cell morphology on days 0–3 of induction with siNC transfection.\n(E‒H) four panels showing cell morphology on days 0–3 of induction with siTET1 transfection.\n(I and J) Immunostaining of SOX17 and FOXA2 at the DE stage (at D3) of siNC (I) and siTET1 (J).\nExamine knockdown efficiency using qPCR\nTiming: ∼2 days\nPerform RNA isolation and cDNA synthesis according to step 5 and step 6, respectively.\nPerform qRT-PCR according to step 7 to examine efficiency of siRNA knockdown and evaluate its impact on LTR6B expression and DE induction (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2868-Fig4.jpg",
    "Figure 4. qPCR results showing relative expression of genes in hDE cells under condition of siTET1 transfection\n(A) relative expression of TET1, showing efficient knockdown of TET1 by siRNA.\n(B) Relative expression of LTR6B.\n(C and D) relative expression of hDE marker genes, SOX17(C) and FOXA2 (D). The relative expression levels of each gene were calculated using delta Ct method and normalized to endogenous reference gene β-Actin, presented as mean ± SEM. qPCR analysis was conducted using triple biological replicate. (∗, p < 0.05, ∗∗, p < 0.01, ∗∗∗<0.001, student’s t test).\nDetect changes of CpG methylation of LTR6B\nTiming: ∼5 days\nIn these steps, we introduce in detail procedures for isolating genomic DNA, performing bisulfite sequencing PCR (BSP) to examine the effects of TET1 knockdown on DNA methylation of LTR6B.\nGenomic DNA isolation.\nWe isolated genomic DNA using TIANamp Genomic DNA Kit, following the manufacturer’s protocol https://en.tiangen.com/upload/file/20220509/20220509165835_34395.pdf[href=https://en.tiangen.com/upload/file/20220509/20220509165835_34395.pdf].\nMeasure the concentration of genomic DNA in a NanoDrop;\nBisulfite conversion:\nWe perform bisulfite conversion of genomic DNA using EpiTect Fast Bisulfite Conversion Kits, following the manufacture’s protocol: https://www.qiagen.com/us/resources/resourcedetail?id=12eec91a-0b70-4421-b0bf-2fdd616e3df9&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=12eec91a-0b70-4421-b0bf-2fdd616e3df9&lang=en] and https://www.qiagen.com/us/resources/resourcedetail?id=e072eb69-54a4-430c-9648-ca92ad8c534e&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=e072eb69-54a4-430c-9648-ca92ad8c534e&lang=en]. For each sample, in total 1 μg genomic DNA was used for conversion.\nPolymerase chain reaction.\nUse the TAKARA La Taq kit for PCR.\nThaw 10× La Buffer and dNTPs on ice.\nSet up PCR reaction as given in Table 8[href=https://www.wicell.org#tbl8].\ntable:files/protocols_protocol_2868_9.csv\nPerform PCR in a grogram given in Table 9[href=https://www.wicell.org#tbl9].\ntable:files/protocols_protocol_2868_10.csv\nGel electrophoresis and Purification of PCR products.\nLoad the PCR products along with a nucleic acid stain (e.g., SYBR Gold) and a tracking dye such as Bromophenol Blue. A suited DNA Ladder is also required.\nPerform electrophoresis in 1× TAE buffer at 120 V, for 30 min.\nVisualize DNA fragments on a UV gel imaging system.",
    "Excise the DNA fragments with a size of 263 bp, using a clean razor blade.\nTransfer the gel slices into a clean 1.5 mL EP tube.\nPurify DNA from the gel pieces using a HiPure Gel DNA Mini Kit, following the manufacture’s protocols https://www.magen-tec.com/products/info.aspx?itemid=126#i5[href=https://www.magen-tec.com/products/info.aspx?itemid=126].\nLigation of Purified PCR product into pMD18-T vector.\nWe perform TA cloning using pMD™18-T Vector Cloning Kit (https://www.takarabiomed.com.cn/ProductShow.aspx?m=20141220150817403017&productID=20141227130215047304[href=https://www.takarabiomed.com.cn/ProductShow.aspx?m=20141220150817403017&productID=20141227130215047304]#) from Takara Biomedical Technology.\nSet up ligation reaction given in Table 10[href=https://www.wicell.org#tbl10].\ntable:files/protocols_protocol_2868_11.csv\nIncubate at 16°C for 4 h.\nTransformation of the ligation reaction.\nTurn on a water bath and set the temperature to 42°C.\nThaw a required amount of E. coli competent cells (DH5α) on ice. For each transformation, 30 μL of competent cells are used.\nAdd all the ligation reaction in step 15 to the 30 μL competent cells kept on ice.\nGently tap the tube, and then incubate on ice for 30 min.\nPlace the competent cells in the water bath at 42°C and heat shocked for 45 s.\nImmediately place the heat-shocked competent cells on ice and kept for 3 min.\nAdd 200 μL of pre-warmed LB liquid medium without any antibiotic, incubate the cells in a shaking incubator at 37°C for 5 min.\nWhen the E. coli cells were incubated, Spread a 7 μL of IPTG and 40 μL X-gal evenly on the surface of the LB agar plate.\nPlate the transformation mixes onto the LB agar plates with ampicillin antibiotics using a sterile loop.\nIncubate at 37°C for ∼16 h in a bacterial incubator.\nCheck the growth of bacterial colonies on the agar plates. Most of the colonies are expected to be white, and some colonies might be blue formed by non-recombinant cells.\nSequence the Colony.\nPrepare sterile EP tubes, add 500 μL LB liquid medium with ampicillin antibiotic to each tube.",
    "Pick a white colony using a sterile 10 μL pipette tip, transfer it into the LB liquid medium in the EP tube, agitate it for several times and discard the tips. Pick at least 20 colonies for each agar plate.\nNote: Each tube should only contain one single colony.\nOptional: To decrease the occurrence of false positives, it is recommended to perform colony PCR concurrently with colony picking for incubation.\nIncubate these tubes in a shaker at 37°C in 200 rpm, for ∼ 16 h.\nPerform Sange Sequencing using a universal primer M13F or M13R (sequences are shown in the key resources table[href=https://www.wicell.org#key-resources-table]) at a commercial sequencing facility.\nAnalyze sequencing results and calculate CpG methylation ratio (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2868-Fig5.jpg\nFigure 5. Bisulfite sequencing analysis of LTR6B DNA methylation in hESC, and hDE cells under transfection of siNC or siTET1\n(A‒C) Bisulfite sequencing results of a region on LTR6B of hESC (A), hDE with siNC transfection (B), and hDE with siTET1 transfection (C). Each row stands for a sequenced DNA template molecule from a single colony. Methylated CpG sites are shown as solid circles, whereas open circles indicate unmethylated CpG sites.\n(D) Barplot sumarise of CpG methylation rate in (A‒C).\nWe analyze the bisulfite sequence to calculate the CpG methylation using a web-based tool QUMA (http://quma.cdb.riken.jp/[href=http://quma.cdb.riken.jp/]), following the user’s manual (http://quma.cdb.riken.jp/files/quma_manual_e.pdf[href=http://quma.cdb.riken.jp/files/quma_manual_e.pdf]).4[href=https://www.wicell.org#bib4]\nOptional: Other tools such as BiQ analyzer can be also used to analyze bisulfite sequence data.7[href=https://www.wicell.org#bib7]"
  ],
  "subjectAreas": [
    "Cell Culture",
    "Genetics",
    "Cell Differentiation",
    "Gene Expression",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}