{
  "id": 16984,
  "origin_website": "Jove",
  "title": "2D-HPLC-MS Technology Combined with Molecular Network for the Identification of Components in Tibetan medicine Aconitum pendulum",
  "procedures": [
    "1. Preparation\nSample preparation\n\t\nUse a 1/10,000 sensitivity balance to weigh 0.25 g (dry weight) of APB in a 3 mL microcentrifuge tube, add 2.5 mL of methanol, and then sonicate for 30 min (power 240 W, frequency 40 kHz).\nPerform centrifugation at 1.2 x g for 5 min, collect the supernatant, and filter through a membrane filter with a 0.22 µm pore size.\nPreparation of experimental materials\n\t\nPrepare the two-dimensional mobile phase, use acetonitrile as the organic phase B phase, and configure 0.1% formic acid ultrapure water as the aqueous phase A.\nPerform two-phase filtration (0.22 µm) and sonicate using an ultrasound machine (40 kHz) for 15 min. Purge the replaced mobile phase to remove the bubbles. In this experiment, the C18 column was used as the 1D column, the hydrophilic column as the 2D column, and the column was mounted to the instrument.\nAdjustment of the appropriate shunt ratio\n\t\nConnect the 2D-LC instrument out line through a tee to the mass inlet and the other end of the tee to a shunted line. Adjust the flow rate to a suitable value to ensure that the flow rate into the mass spectrum is 0.3-0.5 mL/min.\n\t\t​NOTE: Since the second dimension of the 2D-LC is usually set above 2 mL/min, this flow rate is too large for MS, so it is necessary to perform a split.\n2. 2D-LC operation\nDouble-click the Instrument 1 Online icon, and the chemical workstation will automatically communicate with the 1260 LC and enter the workstation.\nFor 2D-LC method parameter setting, select the Method and Run Control screen from the View menu to invoke the desired interface, which will normally be entered by default. Click on the injector module, right-click Method, set the injection volume, flow rate and mobile phase time gradient of the 1D pump.",
    "Enter the sample run time under Stop Time. Click on the main menu Instrument and click 2D-LC Method on the drop-down menu. Select Comprehensive in 2D-LC Mode. Enter 2 min at Modulation time, 1.9 min at 2D Gradient Stop time. Set Flow Settings to 2 mL. Edit 2D-Gradient and set to wavelengths. After editing the method, select Save Method As on the Method menu to name the new method, and then click OK.\n\t​NOTE: The external transfer pump requires manual setting of the flow rate.\n3. MS operation\nTurn ON the switch of the vacuum pump. Open the argon cylinder main valve and the pressure divider valve and adjust the pressure to about 0.3 MPa. Open the nitrogen valve.\nWait at least 8 h to ensure adequate vacuum for experimental conditions. Check that the air pressure of argon and nitrogen is high enough before analysis.\nTo launch the MS control software, click on the Heating SEI Source in the software panel and enter the MS parameters, including heater temperature (350 °C), sheath flow rate (35 arb), auxiliary air flow rate (15 arb), spray voltage (3.8 KV in positive mode, -2.5 KV in negative mode), and capillary temperature (275 °C). Click the Apply button to activate the ion source.",
    "To set up the MS method, enter values to configure acquisition time, polarity, mass range, transfer value number, transfer value duration, and more. Set MS Run Time (min): 93.00. Set up ScanEvent Details: ITMS + c norm o (100.0-1200.0), CV=0.0v. ITMS + c norm Dep MS/MS, most intense ion from (1): Activation Type: CID, Min. Signal Required: 500, Isolation Width: 2.00, Normalized Coll. Energy: 35.0, Default Charge State:3, Activation Q: 0.250, ActivationTime: 93.000. To set data-dependent settings, use separate polarity settings as disabled, Neutral loss in top:3, Product in top: 3. Click Save to configure the settings as the instrument method.\n\tNOTE: The end of run time is consistent with the 2D-LC.\nClick the Sequence Setup button to open the sequence table. Enter the sample type, file name, path, sample ID, instrument method, location, injection amount, and other information in the form.\nClick the Save button to record the sequence listing, then click the Start Analysis button to set up and start MS acquisition. Click Run Control on the 2D-LC instrument and select Run Method. At the same time, the MS instrument also clicks the Run button.\n\t​NOTE: Because the 2D-LC and MS are not controlled by the same software in this experiment, they need to be set up on both instruments separately.\n4. Molecular network operation\nData preparation: Export 2D-HPLC-MS raw mass spectral data and convert secondary mass spectral data into mzXML or mzML data via ProteoWizard's Msconvert. (http://proteowizard.sourceforge.net/).\nTo upload data, download the WinSCP software on the official website and upload mzML data to the account created by GNPS via FTP protocol. Once the installation is complete, launch WinSCP.",
    "Connect to GNPS FTP server: In the WinSCP interface, on Session configuration page, fill in the following connection information: File protocol: Select FTP. For Hostname: Enter massive.ucsd.edu., for port number: Keep the default 22.\nEnter the account number and password. After filling in the above information, click the Login button to establish a connection to the GNPS FTP server.\nCreate molecular networks by opening a web browser and visiting the GNPS website (https://gnps.ucsd.edu/). New users need to sign up for an account and then log in.\nOn the main interface of the GNPS website, click the Tasks tab in the top navigation bar and select Create A New Task from the drop-down menu. On the task creation page, click the Add Files button, then select and upload the data file. (e.g., mzML format).\nIn the Task Parameters tab, set the various parameters that generate the MN. These parameters include peak extraction algorithm, peak overtravel value, similarity calculation method, etc. Make the appropriate parameter settings as needed. Click the Launch Analysis button at the bottom of the page to run the task.\nAfter the task runs, find the created task in the task list and click the Service Name to view the analysis results. The website provides MN diagrams, substitutes, symbiotic networks, and other related information.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}