{
  "id": 6114,
  "origin_website": "Bio",
  "title": "Dual-probe RNA FRET-FISH in Yeast",
  "procedures": [
    "Probe designTwo DNA oligo probe sequences are chosen based on the target of interest. Designing a FRET pair of probes is much more constrained than designing a single probe.The probes should target a specific feature of the mRNA. Ideally, for mRNA isoforms, they should flank the junction between a sequence that is unique to one isoform and a sequence that is conserved in both isoforms. The donor should be on the conserved sequence so that both isoforms can be detected using a single excitation. For example, an intron retention isoform could be detected by placing Cy3 on the exon and Cy5 on the intron. However, FRET can also be used to simply exclude false positives and not need a specific feature. In this case, FRET only occurs if the donor and acceptor probes are on the target so that any spot appearing in the donor channel is a non-specific spot. (Note A1)The probes should not interfere with the binding of each other. To avoid steric effects, these probes are placed two nucleotides apart from the 3’ end of the first to 5’ end of the second probe.The probe should be stable and specific. Overall probe length should be determined by RNA-DNA melting temperature (60 °C and between 20-30 nt). (Note A2)The secondary structure of the target RNA should be avoided. Ideally, one of the probes should bind completely or partially in a loop in the determined mRNA structure (mFOLD) (Zuker et al., 2003).FRET efficiency should be high. Cy3 and Cy5 should be placed within 5 nm of one another when bound to the target to ensure high FRET.",
    "Placing the fluorophores 2 nucleotides in from the adjacent 3’ and 5’ ends of the sequence places the fluorophores ~2 nm apart if there is a 2 nucleotide gap between the ends, e.g., 6 nucleotide total separation.Microscope designOur microscope is a custom-built microscope configured in highly inclined illumination geometry (HILO). This custom microscope is not necessary for imaging single fluorophore considering any widefield TIR/HILO microscope should be able to be configured for this type of imaging (~1-2 photon limit) with a properly sensitive camera, such as an EMCCD camera. For single fluorophores in a FRET pair, epi-fluorescence will not generate an adequate signal, Figure 1. It is necessary to have a variable angle geometry on the illumination. This is essentially the same geometry as a single probe FISH experiment (Wadsworth et al., 2017) with the added requirement of dual channel simultaneous imaging of the signal from the FRET pair (e.g., Cy3 and Cy5). This can be done by using a dual band dichroic (Semrock), which reflects the 532 nm excitation beam, but transmits the emissions of both Cy3 and Cy5. In the emission pathway, the camera is no longer mounted to the microscope. The emission is relayed from the image plane to a conjugate image plane where the EMCCD is positioned. In between these planes are a pair of dichroic mirrors that split the emissions of Cy3 and Cy5 (Semrock) along with filters matched to those fluorophores (Semrock), see Figure 2. These paths can be mapped onto one another using an affine transformation and alignment tools (e.g., DNA probe designed with half FRET efficiency) that fluoresce in both channels. (Note B)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180530/20180530235252_0740.jpgFigure 1. Comparing Epi and inclined illumination. A. An epi-fluorescence microscope has the illumination incident on the sample through the objective and the entire volume of the sample is illuminated.",
    "This leads to poor signal to noise for single fluorophores since the widefield microscope collects out of focus light. B. An inclined illumination geometry has the illumination displaced radially in the back focal plane of the objective so that the light becomes a thin laminated sheet in the sample volume (Tokunaga et al., 2008). This enables z-sectioning and increases signal to noise significantly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180530/20180530235349_9487.jpgFigure 2. Emission pathway of a microscope configured for two channel FRET. The emission is transmitted through a dichroic with two transmission bands compatible with the FRET pair. An adjustible mechanical slit is placed at the image plane. A dichroic is placed near the image plane formed by the tube lens to split the two bands of emission. Filters are placed in the path between the first dichroic and the second dichroic, which recombines the emissions in the same direction. The broadband mirrors are adjusted so that the light from each path covers half of the sensor. If aligned properly, there should be no difference in orientation or magnification between the two images.Sample preparationDay 1At the end of the day, inoculate yeast cells into SD Complete liquid media in a culture flask from cells actively growing on an SD Complete plate.Day 2–cell fixation and permeabilizationMeasure cell OD600 using a spectrophotometer at 600 nm by placing 1 ml of cell culture in a cuvette.Once cell OD600 has reached 0.6, decant cell solution into a 50 ml Falcon tube and pellet by centrifuging at 671 x g for 5 min and aspirate.Resuspend the pellet in 10 ml of ice cold (4 °C) methanol for 10 min for fixation.Pellet cells and resuspend in ice cold Buffer B twice and aspirate.Resuspend the cells in 1 ml of Spheroplasting buffer and transfer to a 1.",
    "75 ml microcentrifuge tube and add 2 µl of 5 units/µl of zymolyase and gently pipette to mix. (Note C1)Incubate the cells for 30 min or until the OD600 of 100 µl of cells added to 900 µl of deionized water shows a reduction of 30% from the initial OD after 1 min, which demonstrates cell lysis.Pellet the cells and aspirate. Centrifuge at no more than 268 x g since they are fragile once they are spheroplasts.Wash the cells two more times in ice cold Buffer B and aspirate.Resuspend the cells in 1 ml of 70% ethanol and keep at 4 °C for a minimum of 1 h to overnight. (Note C2)Day 2cont./Day 3–hybridizationPellet cells at 268 x g and wash twice each with 1 ml Wash Buffer and aspirate. Wash buffer should be prepared fresh and formamide should be warmed to room temperature before opening. (Notes D1 and F2)Dilute the probes to 1 µM in 10 mM Tris-HCl, pH 8. Prepare a mixture of hybridization buffer and probes based on the working concentration determined by titration. (Note D2)Resuspend cells to a final volume of 100 µl in the probe-hybridization buffer mixture by gentle pipetting.Then wrap samples with aluminum foil to prevent photobleaching and place in an incubator at 30 °C overnight.Day 3/Day4–Slide PreparationPellet cells at 268 x g and wash twice each with 1 ml Wash Buffer and aspirated. (Note D3)Imaging buffer is prepared immediately before use. (Note D4)Wipe the slides with ethanol; or (optional) clean slides and coverslips in a plasma cleaner for 10 min.Note: The slide should be clean of dust and other particles by wiping with ethanol. Any air bubbles will severely impact the performance of the Imaging Buffer. Mix 2.5 µl of Imaging Buffer with 2.5 µl of cells and place on the coverslip.",
    "Place the coverslip on a slide and seal with epoxy. (Note E) Note: Slides should be kept in a dark place while not on the microscope. Several slides can be prepared simultaneously. Once sealed, the performance of the imaging buffer will not degrade for several hours.Data acquisitionUsing a microscope as described above (Note F1), hardware control and the acquisition parameters can be set in the Micromanager software (Edelstein et al., 2014). Z-stack images can be acquired using the multi-dimensional tool in Micromanager for each channel of interest (e.g., DIC, Cy5, etc.).Aquire images at full region of interest (512x512) on an EMCCD (iXonEM +, Andor) at 100 msec exposure times. The pixel size and z-step were chosen to be less than or equal to the Nyquist sampling limit for the shortest wavelength (see Introduction to Fourier Optics 3rd edition, Goodman).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531000415_9386.jpgSet the laser to output 25 mW at the sample plane. For each chamber, the thickness is approximately 2 µm and acquire an appropriate number of z-slices. An example of the contrast between a negative control and a low copy number strain is shown in Figure 3. (Note F2) An example of bleedthrough can be seen in Figure 4.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531000642_7267.jpgFigure 3. Example images of dual-probe FISH-FRET. A. Three channels of a FRET acquisition are shown on a single cell expressing yEvenus mRNA where every target should have both probes. The left and right images are during excitation using 532 nm light. These images represent a single z-slice of Cy5 emission (left) and Cy3 emission (right). Cy5 emission during direct excitation with 640nm light is shown in the center. This image was taken second so that the spots that are visible in the FRET (left) image but not the Cy5 (center) image are primarily due to photobleaching.",
    "The spots visible in the Cy3 (right) image are due to a combination of non-specific binding (lower melting temperature of the probe) and lower detection efficiency (inactive fluorophores). B. The 256x512 image of Cy5 under direct (Red) and FRET (Green) emission is shown. Where fluorophores were detected in both channels, the image is yellow. The direct excitation was measured second. Approximately 80% of fluorophores were detected in both under this excitation condition with the difference due to photobleaching during excitation by FRET. Shown above is an example where transcripts are countable (~40 spots per cell). A more extreme example (~1,000 transcripts expected) of FRET detection is shown in Wadsworth et al., 2017. In this example, the control shows that crosstalk between channels is minimal.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531000725_9658.jpgFigure 4. Controls for dual-probe FISH-FRET. Each image shown is at the same scale and contrast. A. Cells that have only been treated with a Cy3 labeled probe are shown in dual-view where the emission on the top and bottom panels of a slice were acquired simultaneously. Some bleedthrough is expected in FRET experiments. Much of the intensity in the bottom channel during 532 nm excitation is due to cellular auto-fluorescence, however, there are some peaks in intensity due to Cy3 emission in the Cy5 channel. B. Cells with only Cy5 labeled probes are shown. Under 532 nm excitation there is very little fluorescence observed. Under 640 nm excitation, Cy5 is seen in the bottom panel and virtually no emission is observed in the top panel. C. In a TIR setup, Cy3 and Cy5 are observed when labeled on the same DNA oligo bound to the surface with BSA-biotin. These are designed to calibrate the affine transformation that maps the top panel to the bottom panel.",
    "They can also be used to calibrate sensitized emission to determine FRET efficiency since these fluorophores are separated by a known number of nucleotides and double stranded DNA is essentially rigid below its persistence length. Variations in spot intensity here are due to non-uniform illumination."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}