{
  "id": 2609,
  "origin_website": "Cell",
  "title": "Protocol for genome editing in wild allotetraploid rice Oryza alta",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe first transgenic rice plants were reported more than 30 years ago (Shimamoto et al., 1989[href=https://www.wicell.org#bib11]). Since 1994, Agrobacterium-mediated transformation has become the most popular method for rice transformation, and various optimizations have been made for efficient and simplified transformation (Wu and Sui, 2019[href=https://www.wicell.org#bib13]). However, the regeneration and transformation of allotetraploid wild rice still remains a challenge (Shimizu-Sato et al., 2020[href=https://www.wicell.org#bib12]).\nCalli induction\nTiming: 2–3 months (depending on the subculture cycle)\nThis section describes calli induction of mature seeds.\nRemove the coats of full mature seeds by hand (Methods video S1[href=https://www.wicell.org#mmc2]).\nNote: The seeds should be fully filled, healthy and pathogen-free.\nSterilize the surface of the seeds with 75% ethanol by vigorously hand-shaking for 2 min. Pour out ethanol and then rinse seeds with sterile water (Methods video S1[href=https://www.wicell.org#mmc2]).\nSterilize the seeds in a flask with 50 mL of a bleach solution (sodium hypochlorite with 2.5% active chlorine) on a rotary shaker at 200 rpm for 30 min at room temperature (Methods video S1[href=https://www.wicell.org#mmc2]).\nMove the seeds to the clean bench (Methods video S1[href=https://www.wicell.org#mmc2]).\nRinse the seeds with sterile water, repeat five times and dry the seeds on sterile filter paper for five minutes (Methods video S1[href=https://www.wicell.org#mmc2]).\nPlace the 8–10 sterilized seeds on a petri dish, with the embryos facing towards fresh callus induction medium and incubate in dark at 28°C for 20 days (Figure 2[href=https://www.wicell.org#fig2]A and Methods video S1[href=https://www.wicell.org#mmc2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2107-Fig2.jpg\nFigure 2. Agrobacterium-mediated transformation of allotetraploid rice\n(A) Calli induction of mature seeds, 20 days after induction.\n(B) Two weeks later, yellow, compact calli were subcultured on fresh CIM.\n(C) Propagated calli.\n(D) The calli after three cycles of subculture.\n(E) Agrobacterium-infected rice calli on sterile filter paper in clean bench.\n(F) Healthy, yellow and resistant calli in fresh selection medium.",
    "(G) Visible green spots from resistant calli on regeneration medium.\n(H) Two weeks later, the plantlets with formed shoot transferred to new rooting medium plates for root inducing.\n(I) Seedlings after transferring to rooting medium for hardening.\nSelect the embryogenic calli that have started to form the scutella and remove the shoots or shoot-like structures (Figure 2[href=https://www.wicell.org#fig2]B).\nTo obtain sufficient embryogenic calli for infection and maintain vitality, subculture the embryogenic calli on fresh CIM for several times.\nReplace CIM for every 7–10 days (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nNote: The selection of embryogenic calli from non-embryogenic calli is essential at this step. The embryogenic calli are identifiable as solid granular structures with smooth surfaces and creamy/yellow color rather than filamentous and gelatinous. The subculturing process can be repeated several times until sufficient calli are obtained, but should be performed for less than six months from initiation of cultures to ensure vitality.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Seed sterilization for calli induction, refer to steps 1–6\nDesign sgRNA in O. alta\nTiming: 2–3 days\nThis section describes sgRNA design.\nThe reference genome of O. alta have been deposited in the Genome Sequence Archive in BIG Data Center under accession number: PRJCA002366 (https://ngdc.cncb.ac.cn/bioproject/browse/PRJCA002366[href=https://ngdc.cncb.ac.cn/bioproject/browse/PRJCA002366]) (Yu et al., 2021[href=https://www.wicell.org#bib15]).\nObtain the sequences of gene of interest: https://ngdc.cncb.ac.cn/bioproject/browse/PRJCA002366[href=https://ngdc.cncb.ac.cn/bioproject/browse/PRJCA002366].\nIdentify 20 nt target sequence within an exon of the gene of interest.\nNote: When Cas9 is employed, the target sequence must contain the PAM sequence 5′-NGG-3′.\nNote: Example websites for gRNA design include CRISPR-direct: http://crispr.dbcls.jp/[href=http://crispr.dbcls.jp/], CRISPR-GE: http://skl.scau.edu.cn/[href=http://skl.scau.edu.cn/] (Xie et al., 2017[href=https://www.wicell.org#bib14]), and CRISPR-P 2.0: http://crispr.hzau.edu.cn/CRISPR2/[href=http://crispr.hzau.edu.cn/CRISPR2/] (Liu et al., 2017[href=https://www.wicell.org#bib4]).\nIf multiple-recessive mutants are desired, align the two homeologous sequences of subgenomes CC and DD for the gene of interest, and find identify conserved regions.",
    "Analyze the predicted secondary structures of the sgRNA sequence, including target site and gRNA scaffold to avoid TTTTs and target-scaffold pairing.\nNote: Example websites include RNAfold web server: http://rna.tbi.univie.ac.at/cgi-bin/RNAWebSuite/RNAfold.cgi[href=http://rna.tbi.univie.ac.at/cgi-bin/RNAWebSuite/RNAfold.cgi] (Lorenz et al., 2011[href=https://www.wicell.org#bib6]), and RNAstructure website: https://rna.urmc.rochester.edu/RNAstructureWeb/[href=https://rna.urmc.rochester.edu/RNAstructureWeb/] (Reuter and Mathews, 2010[href=https://www.wicell.org#bib9]).\nPredict off-target edits by Cas-OFFinder software: http://www.rgenome.net/cas-offinder/[href=http://www.rgenome.net/cas-offinder/] (Bae et al., 2014[href=https://www.wicell.org#bib2]) and minimize sgRNA-dependent off-target activity by sgRNA selection.\nDesign primers specific to target regions on two subgenomes for amplifying the fragments including the target sites.\nNote: Example websites for primer design include Primer3Input: https://primer3plus.com/primer3web/primer3web_input.htm[href=https://primer3plus.com/primer3web/primer3web_input.htm], and Primer-BLAST: https://www.ncbi.nlm.nih.gov/tools/primer-blast/index.cgi?LINK_LOC=BlastHome[href=https://www.ncbi.nlm.nih.gov/tools/primer-blast/index.cgi?LINK_LOC=BlastHome].\nNote: Editing efficiency is largely dependent on perfect matching between the sgRNA and target sequence. The target sites should be sequenced first to confirm as genomic variations exist among different lines of O. alta.\nAlternatives: Overlap between the site of DNA cleavage of Cas9 and a restriction recognition sequence allows for detection of putative edits by PCR/RE (Shan et al., 2014[href=https://www.wicell.org#bib10]). PCR products specific to the two subgenomes should be used to detect the mutations. In order to increase the likelihood of successful editing, preliminary evaluations of sgRNA efficiency could be carried out in protoplasts first (Lin et al., 2018[href=https://www.wicell.org#bib3]; Nadakuduti et al., 2019[href=https://www.wicell.org#bib8]).\nVector construction\nTiming: 3–4 days\nThis section describes vector construction of genome editing through CRISPR/Cas9.\nSynthesize forward and reverse oligo DNAs. The chimeric oligo DNAs comprise the 20-bp target sequence and a 3-bp overhangs specific for the gRNA cloning vector VK005 (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2107-Mmc1.extension]A). The oligo DNAs are designed as below:\nTarget-sense: 5′-CAGNNNNNNNNNNNNNNNNNNNN (gRNA sense)-3′\nTarget-antisense: 5′-AACNNNNNNNNNNNNNNNNNNNN (gRNA antisense)-3′\nFor example, for OaGS3 target (5′-CCGGCAGCGCCCGACCCCTG-3′) (Yu et al., 2021[href=https://www.wicell.org#bib15]), oligo DNAs are designed as:\nOaGS3 gRNA-F: 5′-CAGCCGGCAGCGCCCGACCCCTG-3′\nOaGS3 gRNA-R: 5′-AACCAGGGGTCGGGCGCTGCCGG-3′\nDilute 5 μL of forward and 5 μL reverse oligo DNAs (10 μM) into 15 μL distilled water in PCR tube, and centrifuge the mix after blending.",
    "Anneal the oligonucleotides to form the oligoduplex in a T100TM Thermal Cycler. The program is below.\ntable:files/protocols_protocol_2107_12.csv\nAlternatives: This step can also be performed as follows. Boil the oligonucleotides at 95°C for 3 min and leave at room temperature (20°C–25°C) for 30 min to anneal the oligonucleotides.\nLigate the annealed gRNA oligoduplex into the Cas9/gRNA vector according to the manufacturer’s instructions of Cas9/gRNA Vector Construction Kit: http://www.v-solid.com/product_detail/106.html[href=http://www.v-solid.com/product_detail/106.html].\ntable:files/protocols_protocol_2107_13.csv\nTransform 10 μL of the ligation reaction into E. coli DH5α Competent Cells. Plate the cells onto LB agar containing kanamycin (100 μg/mL), and incubate at 37°C for 16 h.\nSelect monoclone to amplify assembled expression cassettes with two flanking primers (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2107-Mmc1.extension]B), and culture the positive clone into LB liquid medium containing kanamycin at 37°C for 16 h (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2107_14.csv\nExtract correct plasmid DNA with an EasyPure Plasmid MiniPrep Kit and sequence for correct construction.\nTransform the binary vector into A. tumefaciens\nTiming: 3–4 days\nThis section describes transforming the binary vector into A. tumefaciens through electrotransformation.\nPre-wash 2 mm electroporation cuvettes using 75% ethyl alcohol and ddH2O and dry in a clean bench.\nAdd 50 ng correct plasmid into EHA105 competent cells.\nTransfer the competent cells into electroporation cuvettes and pulse an electric shock at 1.8 kV.\nRecover EHA105 competent cells in MG/L liquid medium without antibiotic at 28°C for 45–60 min.\nPlate the cells onto MG/L solid medium containing kanamycin and rifampicin at 28°C for 2 days.\nPick a monoclone and culture in 3–4 mL liquid MG/L liquid medium containing kanamycin and rifampicin and acetosyringone at 28°C for 14–16 h with vigorous shaking until the OD600 reaches 0.6–0.8.\nNote: Keep EHA105 competent cells on ice and operate gently.\nAgrobacterium-mediated genetic transformation\nTiming: 3 days\nThis section describes agrobacterium-mediated genetic transformation.",
    "Collect Agrobacterium cells containing constructs by centrifugation at 800 g, 4°C for 5–10 min.\nResuspend the Agrobacterium in cooled fresh infection medium containing 100 μM acetosyringone and 0.1% Pluronic F68 and adjust OD600 at 0.5 (Methods video S2[href=https://www.wicell.org#mmc3]).\nIncubate the resuspension solution on ice for 10–20 min (Methods video S2[href=https://www.wicell.org#mmc3]).\nPlace the calli in sterile conical flasks (Figure 2[href=https://www.wicell.org#fig2]E and Methods video S2[href=https://www.wicell.org#mmc3]) on ice for 10 min prior to the infection.\nPour the suspension into the flask immersing the calli for infection and then gently shake the flask at 40 rpm for 10 min (Methods video S2[href=https://www.wicell.org#mmc3]).\nPlace the infected calli on sterile filter paper in the dishes and co-cultivate in the dark at 22°C for 3 days (Methods video S2[href=https://www.wicell.org#mmc3]).\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Agrobacterium mediated transformation, refer to steps 25–30\nSelection of infected calli, shoot regeneration and transgenic plantlet hardening\nTiming: 3–4 months\nThis section describes plant regeneration.\nTransfer the calli to fresh selection medium and culture in the dark at 28°C for 7 days.\nSubculture the hygromycin B resistant and actively growing calli on fresh selection medium every 10 days for three or four cycles under the same condition (Figure 2[href=https://www.wicell.org#fig2]F and Methods video S3[href=https://www.wicell.org#mmc4]).\nTransfer resistant calli to regeneration medium with 5 pieces on each dish and culture at 28°C in dark for 1 week (Methods video S3[href=https://www.wicell.org#mmc4]).\nCulture the calli under 16-h light and 8-h dark photoperiod for 3 weeks at 50–100 μmol m-2 s-1 light intensity.\nGreen spots and new shoots should be formed on the calli in two and three weeks, respectively (Figures 2[href=https://www.wicell.org#fig2]G and 2H and Methods video S3[href=https://www.wicell.org#mmc4]).\nOne transformed line from a single piece of callus is to be identified as an individual transgenic event.",
    "Transfer the regenerated shoots to rooting medium and culture at 28°C for four weeks until the shoots grow up to 10 cm (Figure 2[href=https://www.wicell.org#fig2]I and Methods video S3[href=https://www.wicell.org#mmc4]).\nNote: The plants that are truly hygromycin resistant will develop roots in the rooting medium, which are longer and whiter than those which are not resistant.\nHarden the plants of transformants by opening the lid of medium.\nWash the plants with warm water and re-harden the plants to greenhouse conditions.\nTransplant the plants to soil in the greenhouse or field.\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Calli seletion and plant regeneration for transformed seedlings, refer to steps 32–35\n4\nMutation detection and genotyping\nTiming: 2–3 days\nThis section describes genotyping of transformants.\nExtract genomic DNA from leaves of transformants using CTAB method (Allen et al., 2006[href=https://www.wicell.org#bib1]).\nConfirm positive transformants with Cas9 primers or hygromycin B primers (sequences in key resources table[href=https://www.wicell.org#key-resources-table]).\nAmplify the targeted region of positive transformants by PCR with two subgenome specific primer pairs.\nSequence the PCR product and decode the genotypes.\nNote: For single-gene editing, Sanger sequencing could be used and if more than two genotypes are present in sequencing data, an additional 10–20 clones should be sequenced. A higher proportion of chimeras were observed from transformed seedlings in allotetraploid rice. Genotypes of chimeras can be quickly decoded with next generation sequencing, such as Hi-Tom (Liu et al., 2019[href=https://www.wicell.org#bib5])."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Plant Sciences",
    "Crispr"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}