{
  "id": 9675,
  "origin_website": "Jove",
  "title": "Subcutaneous Administration of Muscarinic Antagonists and Triple-Immunostaining of the Levator Auris Longus Muscle in Mice",
  "procedures": [
    "1. Subcutaneous administration of muscarinic acetylcholine receptor (mAChR) antagonists\nPrepare under aseptic conditions the appropriate dose of mAChR antagonist,  (cf., Table) by dissolving the drug in sterile physiological saline in 1.5mL reaction tube. The following antagonists were used: atropine, Methoctramine, 4-DAMP, AFDX-116, AFDX-384, MT 7. \nDraw 50μl of solution into a1cc insulin syringe and use a separate syringe for each mouse. Also prepare syringes containing physiological saline only for each mouse in the control group. Keep syringes on ice until ready to inject. \nAnesthetize mice with ketamine-xylazine cocktail (120 mg/kg ketamine, 8 mg/kg xylazine)  Check for appropriate anesthetic depth by observing lack of response to toe pinch.\nAfter proper sedation, shave hair covering the rostral region of the head to the caudal region of the neck, wipe remaining hair away with 70% ethanol. \nPlace mouse under stereomicroscope, and insert needle parallel to LAL muscle while pulling up lightly on the needle of the syringe (Fig. 1A,B). This ensures that the needle is inserted into overlying connective tissue and does not directly damage the LAL muscle itself. Insert the needle so that the tip covers the caudal aspect of the LAL muscle.\nVery slowly begin to inject solution over the right LAL muscle while withdrawing the syringe; the total injection time should be approximately 1 minute. If injected properly, the solution should form a \"dome\" that is roughly 1 cm in diameter, in the overlying skin that will remain for at least one hour. A uniformly injected solution will cover the entire rostral and caudal regions of the right LAL muscle.",
    "Repeat the procedure every 12 hours for 1 to 7 days. For other studies1, we used the same protocol to inject growth factors every 12 hours for up to 21 days. No abnormal responses were observed from mice administered with anesthesia 2x a day for up to 21 days.\n2. Dissection of LAL muscles\nEuthanize mice with an overdose of sodium pentobarbital ( 390 mg/kg).  Death is assured by assessing lack of heartbeat after thoracotomy is performed.\nPin down the mouse in a dissection dish, dorsal side up with 1 pin in each paw and 1 pin through the nose. \nMake the first incision through the skin only, using small spring scissors to cut along the left LAL from the region just proximal to the ear to the region around the left shoulder blade.\nCarefully remove the skin in this region, but avoid cutting too close to the right ear as this is one of the points of attachment for the right LAL muscle. \nLocate the centrally positioned adipose tissue strip of lipid along the midline, on the superficial surface of the head, where the right and left LAL muscles meet. Using small spring scissors, cut 1cm to the right of the fat tissue (toward the left ear ) from the proximal edge of the left LAL muscle until reaching the shoulder (Fig. 1C). \nOnce the incision is made, peel back the right LAL muscle with small forceps to expose the ventral side of the muscle. Trim the connective tissue and fascia while carefully pulling up on the right LAL muscle with forceps (Fig. 1C).",
    "Cut around the caudal end of the right LAL at the base of the ear. Continue cutting, moving towards the rostral end of the right ear, keeping the right LAL turned over (Fig. 1C).. It is better to include more tissue at this step than risk damaging the LAL itself. If the muscle begins to dry out, pipette 1X PBS over the muscle.\nPlace dissected right LAL in 30mm culture Sylgard dish containing 1X PBS, dorsal side up. Pin down four corners of muscle with small insect pins. \nUsing small forceps and spring scissors, clean connective tissue from dorsal and ventral surfaces of the right LAL muscle. Turn muscle over and re-pin in order to clean off ventral surface. 2-3 muscles may be placed in the same 30mm dish.\n3. Triple immunostaining of LAL NMJs: Day 1\nBefore beginning immunostaining, prepare all needed reagents. 1X PBS, 2% bovine serum albumin BSA)/PBS, 0.1M Glycine in 2%BSA/PBS, 0.2% Triton X100 in 2% BSA/PBS, and 4% paraformaldehyde (PFA) in 1X PBS will be needed. Pre-cool methanol in -20°C freezer. \nLeave LAL muscles pinned in the dish dorsal side up during this process. Discard 1X PBS solution and add enough 4% (PFA) to cover the muscle. Place dish on shaker set at speed 2 or 3 for 20 minutes. Unless otherwise noted, the dish should be placed on a shaker for the following steps. \nDiscard 4% PFA and wash the muscle with 1X PBS 3 times, 10' each. \nDiscard last 1X PBS wash and add 0.1M Glycine in 2% BSA/PBS solution for 30'. \nDiscard 0.1M Glycine solution and add 1X PBS containing rhodamine conjugated α-bungarotoxin at a concentration of 1:200 for 15'.\nDiscard α-bungarotoxin solution and wash muscle in 1X PBS, 3 times 10' each.",
    "Permeabilize tissue by adding pre-cooled methanol and place the dish in the -20°C freezer for precisely 5 minutes, no shaking needed. \nRemove methanol and wash 3 times 10' each with 1X PBS. Discard last wash and block tissue with 0.2% triton X-100 in 2% BSA/PBS for 1 hour. The washing and blocking steps are performed at room temperature. \nIncubate the muscles overnight, shaking,  at 4°C in a cocktail of primary antibodies diluted in the blocking solution (cf., Table). \n4. Triple immunostaining of LAL NMJs: Day 2\nWash muscles in 1X PBS 3 times, 10' each at room temperature. \nAdd cocktail of secondary antibodies in blocking solution for 1 hour at room temperature (cf., Table). The muscles must be protected from light from this step onward to prevent photo-bleaching of Alexa-Fluor 647 fluorescence.\nWash muscles in 1X PBS 3 times, 10' each. \nClean off any remaining connective tissue in 1X PBS, cut the lateral borders of the LAL muscles and mount on slides dorsal side up, using glass cover-slips and mounting media. Use clear nail polish to secure cover slip in place. \nProtect slides from light and store at -20°C until ready for analysis. \n5. Confocal imaging of LAL NMJs\nHigh-resolution confocal images are obtained with a Leica Plan Apo 63X oil objective (1.4NA) on a Leica TCS 4D confocal microscope.",
    "Fluorescein and Alexa 647 signals were simultaneously scanned with laser lines 488 nm (Argon, 488 nm, 20 mW) and 633 nm (HeNe, 633 nm, 10 mW), respectively. Sequentially, Rhodamine signal is then scanned with the laser line 561 nm (DPSS, 561, 20 mW). Optical sections were collected at 0.3 μm intervals, and the number of images in the z-plane varied from 60-80. The pinhole is adjusted to Airy 1 (107.97 um). The image format 1024 x 1024 (X,Y), with a zoom factor of 1, at 400Hz speed results in an image size of 234.32 μm x 234.32 μm and pixel size of 229.05 nm x 229.05 nm.\nLeica TCS-NT acquisition software is then used to reconstruct z-series images into maximum intensity projections. \nMultipanel images are adjusted for brightness and contrast using Adobe Photoshop.\nFor a typical LAL muscle, one should be able to analyze approximately 75-100 en face NMJs. Synaptic stability is determined by features such as spatial alignment of pre-, peri- and postsynaptic elements (i.e., nerve, Schwann cells and muscle), and measurements of synaptic area (i.e., synapse size).\nRepresentative results:",
    "At the adult mammalian NMJ, a single motor axon elaborates fine branches that form highly differentiated arbors of a nerve terminal (Fig. 2; Green) on a single muscle fiber, precisely apposed to postsynaptic clusters of nicotinic AChRs (Fig. 2; Red). Perisynaptically, terminal Schwann cells tightly cover all the branches of presynaptic nerve terminals (Fig. 2; Blue). The structural and functional integrity of this tripartite organization is severely perturbed by daily application of subtype-specific mAChR inhibitors. In the example presented here (Fig. 3), 4-DAMP, a mAChR antagonist with high affinity for M1, M3, M4 and M5  mAChR subtypes , evokes selective elimination of nerve terminals from numerous NMJs throughout the muscle surface (Fig. 3B, C). In addition, terminal Schwann cells are abnormally quiescent8 as evidenced by bright S100 labeling without process extension (Fig. 3B\", 3C\"). Postsynaptically, muscle fibers are normal and there is no loss of nAChRs (Fig. 3B', 3C'). \nimgsrc://cloudfront.jove.com/files/ftp_upload/3124/3124fig1.jpgFigure 1. Anatomical location and organization of the LAL muscle. Location of rostral (rLAL), caudal (cLAL), and the LAL nerve (LALn) and corresponding endplate bands are shown (A, inset). The location and orientation of the needle in respect to the LAL muscle is shown for the injection procedure (B). Incision points are shown for the dissection procedure (C). \nimgsrc://cloudfront.jove.com/files/ftp_upload/3124/3124fig2.jpgFigure 2. Tripartite organization of the NMJ. High-magnification confocal views of a mouse NMJ. A single axon elaborates fine terminal branches (A), tightly covered by terminal Schwann cell and their processes (A', asterisks point to terminal Schwann cell bodies). Postsynaptically in a muscle fiber, a cluster of nicotinic AChRs is precisely apposed to the branches of nerve terminals and terminal Schwann cells.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/3124/3124fig3.jpgFigure 3. LAL muscles treated with 4-DAMP, a mAChR antagonist. Low and high-magnification confocal views of LAL muscles treated with vehicle or 4-DAMP. In contrast to the vehicle-treated muscle (A-A'''), numerous NMJs in the 4-DAMP-treated muscle lack nerve terminals (B-B''', C-C'''). A boxed area in Figure 2B is zoomed in Figure 2C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}