{
  "id": 14910,
  "origin_website": "Jove",
  "title": "High-Throughput Expression and Purification of Human Solute Carriers for Structural and Biochemical Studies",
  "procedures": [
    "NOTE: All codon-optimized RESOLUTE SLC genes have been deposited into AddGene43, the links to which are available on the list of RESOLUTE public reagents44. These genes have been cloned into the pDONR221 plasmid and allow direct cloning of the genes into the destination vector using recombination cloning45. To maximize parallelism, bacterial, insect, and mammalian cells are grown in block format for bacmid production (section 3), baculovirus amplification (section 5), and expression testing (section 6), respectively. For these steps, a micro-expression shaker is required to ensure sufficient mixing and aeration.\n1. (High-throughput) cloning of SLCs into pHTBV1.1 bacmid\nNOTE: The cloning step uses a recombination cloning protocol for efficient cloning and transformation into Escherichia coli (E. coli) using the heat-shock method46. The protocol is designed for high-throughput and parallel cloning of multiple targets or constructs but can be readily adapted to smaller scales.\nIn a 96-well plate, add 150 ng of the pDONR221 SLC clone and 100 ng of the pHTBV1.1-C3CGFP-SIII-10H-GTW vector. Bring the reaction volume to 8 µL with 10 mM Tris pH 8.0, and then add 2 µL of the recombination enzyme mix.\nIncubate at room temperature for 1 h, add 1 µL of Proteinase K, and incubate for 30 min at 37 °C.\nUse 4 µL of the reaction mixture to transform 50 µL of chemically competent E. coli MACH-1 cells using the heat-shock method46 and SOC medium for recovery. Plate onto LB-agar containing 5% sucrose, or SOC agar, supplemented with 100 µg/mL ampicillin.\nIdentify colonies harboring the pHTBV1.1 vector with the SLC gene insert using appropriate primers (see Table 1) and standard protocols for colony PCR47.\nPurify the recombinant plasmid from single colonies with the gene of interest using a plasmid miniprep kit.\n2. Transposition",
    "NOTE: The following steps are used to transpose the SLC genes from the pHTBV1.1 vector into a bacmid for BacMam baculovirus generation in Sf9 cells. Using the heat-shock method46, the pHTBV1.1 vector is transformed into DH10Bac competent E. coli cells, which contain a parent bacmid with a lacZ-mini-attTn7 fusion. Transposition occurs between the elements of the pHTBV1.1 vector and the parent bacmid in the presence of the transposition proteins provided by a helper plasmid48. See Table 2 for the composition of solutions used in this protocol.\nUsing 3 µL of 100-200 ng/µL purified pHTBV1.1 vector DNA, transform DH10Bac using the heat-shock method in a 96-well PCR plate. Recover the cells by incubating them in recovery medium for 4-5 h at 37 °C while shaking at 700 rpm in a micro-expression shaker.\nSpread 50 µL of transformed cells onto DH10Bac selection plates. Incubate the plates at 37 °C for 48 h covered with foil.\nPick a single white colony (containing the recombinant DNA) and streak to dilution. Incubate at 37 °C overnight.\n3. High-throughput bacmid production\nNOTE: The protocol describes the steps for extracting bacmids using a 96-well bacmid purification kit.\nInoculate individual white colonies (isolated from the streaked to dilution plates) into wells of a 96-deep-well block, containing 1 mL of 2x LB medium (Table 2).\nCover with a porous seal and incubate at 37 °C overnight at 700 rpm in a micro-expression shaker.\nPrepare a glycerol stock of the cells by mixing 120 µL of the culture with 30 µL of 60% glycerol in a microtiter plate and store at -80 °C.",
    "Centrifuge the deep well block at 2,600 × g for 30 min. Decant the supernatant into a suitable container for decontamination. Invert the block and tap gently on a paper towel. Add 250 µL of Solution 1 to each well of the block using a multi-channel pipette.\nResuspend the pellets; if necessary, use a multi-channel pipette.\nAdd 250 µL of Solution 2 to each well and seal with a silicone mat. Invert gently 5x and incubate at room temperature for 10 min. Spin very briefly.\nAdd 300 µL of Solution 3 and seal with a silicone mat. Mix gently but thoroughly by inverting 5x.\nPlace the sample on ice for 20 min, then centrifuge at 2,600 × g for 30 min at 4 °C.\nTransfer the clear supernatant to a fresh 96-well block. Centrifuge again at 2,600 × g for 30 min at 4 °C.\nIn a fresh 96-deep-well block, dispense 0.8 mL of 100% isopropanol per well. Add 0.8 mL of supernatants from the corresponding wells.\nGently pipette up and down using a pipette, then incubate on ice for 30 min or overnight at 4 °C to yield more bacmid.\nCentrifuge at 2,600 × g for 30 min at 4 °C.\nInside a biological safety cabinet, spray the outside of the block with 70% ethanol, open the block, and discard the supernatant.\nAdd 500 µL of 70% ethanol (v/v) to each well and tap the block gently to wash the pellet. Cover with an adhesive plastic seal and centrifuge at 2,600 × g for 30 min at 4 °C.",
    "Inside a Biological Safety Cabinet, open the block and discard the supernatant. Tap the block very gently on a paper towel to remove the ethanol. Allow the block to dry either inside the hood for 1-2 h or in a 50 °C oven.\nAdd 50 µL of sterile TE buffer to resuspend the bacmid DNA and seal using an adhesive plastic seal. Transfer the contents to a V-bottom microtiter plate. Store the bacmid DNA at 4 °C until the test purification is complete and then store it at -20 °C.\n\tNOTE: While not routinely measured, generally a yield of 500 to 2,000 ng/µL bacmid DNA can be expected.\nUse standard colony PCR methods47, and the following vector primers to screen for bacmids successfully incorporating the target gene:\n\tpFBM-fwd caaaatgtcgtaacaactccgc\n\tpFBM-rev tagttaagaataccagtcaatctttcac\n\t​NOTE: The amplicon will be approximately 700 bp bigger than the target gene.\n4. Transfection\nNOTE: These steps are used to transfect Sf9 insect cells with the bacmid produced, which causes the insect cells to generate baculovirus particles (P0).\nGrow Sf9 cells in serum-free insect medium to a density of 2.0-2.4 × 106 cells/mL. Dilute the cells to 2 × 105 cells/mL in serum-free insect medium and dispense 1 mL of the diluted cells into a 24-well tissue culture plate well. Include a transfection-reagent-only as well as a cells-only control. Incubate the plate in a humidified incubator at 27 °C for 1 h to allow cell attachment.\nMix 38 µL per well of serum-free insect medium with 2 µL per well of the transfection reagent. Dispense 40 µL of the mixture into a 96-well sterile flat-bottom microtiter plate. Add 2 µL of recombinant bacmid DNA at 0.5-2.0 µg/µL, cover the plate, and incubate inside the microbiological safety cabinet for 15 min.",
    "Add 160 µL of serum-free insect medium into each well of the microtiter plate containing the DNA-transfection reagent mixture.\nAspirate medium from the cells in step 4.1. Gently, add the 200 µL of bacmid-transfection reagent-medium mixture onto the cells, cover the plate, and incubate for 4 h in a humidified incubator at 27 °C.\nAdd 400 µL of serum-free insect medium supplemented with 2% FBS to each well. To reduce evaporation, transfer the plate into a clean plastic bag but do not seal it. Incubate the plate at 27 °C for 72 h in a humidified incubator.\nAfter 3 days, transfer the media from the plate into a sterile 96-deep-well block and centrifuge at 1,500 × g for 20 min at room temperature. Transfer the clarified supernatant containing P0 baculovirus into a sterile 96-deep-well block and store at 4 °C away from light.\n5. BacMam baculovirus amplification\nNOTE: The following steps are used to amplify the initial P0 baculovirus to higher titer viral stocks; namely P1, P2, and P3. The final P3 titer is appropriate for transduction and protein expression. For efficiency and parallelism, this protocol uses fixed volumetric ratios for viral amplification, which have been empirically optimized. However, if the subsequently transduced cells do not show GFP fluorescence and increased cell diameter by microscopy or if protein expression fails (see sections 6 and 8), baculovirus amplification should be re-optimized for a low multiplicity of infection at each step after quantifying the baculovirus titer49,50,51,52, and infection monitored by GFP fluorescence microscopy and increased cell diameter53.",
    "Prepare the P1 virus stock by growing Sf9 cells in serum-free insect medium to a density of 2 × 106 cells/mL, add 2% FBS, and seed the cells in a 24-deep-well block in a final volume of 3 mL per well. Add 120 µL of P0 virus stock to the cells.\nIncubate the block at 27 °C while shaking at 450 rpm in a micro-expression shaker for 66-72 h. Centrifuge the block at 1,500 × g for 20 min at room temperature and harvest the supernatant into 96-deep-well blocks. Store as P1 virus stock at 4 °C away from light.\nPrepare P2 virus stock by infecting 50 mL of Sf9 cells (2 × 106 cells/mL cell density), grown in serum-free insect medium supplemented with 2% FBS, with 250 µL of P1 virus stock. Incubate the cells at 27 °C with shaking at 110 rpm.\nHarvest P2 virus stock after 66-72 h by centrifugation at 1,500 × g for 20 min and store at 4 °C away from light.\nPrepare P3 virus stock by infecting the desired volume of Sf9 cells (2 × 106 cells/mL cell density) with 1:200 (v/v) P2 viral stock. Incubate the cells at 27 °C with shaking at 110 rpm.\nAfter 66-72 h, centrifuge at 1,500 × g for 20 min and harvest the P3 virus by collecting the supernatant and store at 4 °C, protected from light.\n6. Transduction for expression testing\nNOTE: The following section describes small-scale expression testing and can be modified for parallel testing of multiple constructs using deep well blocks.\nPrepare a 20% (w/v) polyethylene glycol solution by dissolving 200 g of PEG 10,000 and 12 g of NaCl in 600 mL of double-distilled H2O. Stir and bring to a final volume of 1,000 mL. Autoclave the solution.",
    "Add 300 µL of harvested P1 virus into the wells of a 24-deep-well block and 75 µL of the PEG solution to each well. Incubate the block in a micro-expression shaker at 18 °C while shaking at 300 rpm for 5 min and store the block at 4 °C overnight.\nShake the block again at 300 rpm for 30 min at 18 °C and centrifuge the block at 3,000 × g for 45 min. Discard the supernatant using a pipette in a microbiological safety cabinet.\nPrepare suspension-adapted HEK293 cells in HEK293 medium to a density of 2 × 106 cells/mL, and seed 3 mL into each well containing the virus pellet, supplementing with 5 mM sodium butyrate.\nIncubate the block at 30 °C with 8% CO2 while shaking at 200-250 rpm for 72 h.\n\tNOTE: The vendor-recommended CO2 concentrations during cell culture are different for suspension-adapted and ancestral HEK293 cell lines, at 8% and 5%, respectively.\nHarvest the cells by centrifugation at 900 × g for 20 min and wash each well with 1 mL of PBS.\n\tNOTE: Aspirate 10 µL of resuspended cells and view the cells under a fluorescence microscope with a GFP-compatible filter cube to assess protein expression and localization. Aspirate 10-15 µL of resuspended cells and run a whole-cell SDS-PAGE gel for in-gel GFP fluorescence detection54.\nCentrifuge again at 900 × g for 20 min. Freeze the pellets at -80 °C.\n7. High-throughput small-scale test purification\nNOTE: The following steps describe a rapid test purification workflow in a 24-well block format for screening the expression levels of individual SLCs. See Table 2 for the composition of solutions used in this protocol.",
    "Add 1 mL of HT lysis buffer to each well of harvested cells and proceed to sonicate on ice for a total length of 4 min (cycling at 3 s on/15 s off) in 24-well blocks using a 24-head probe.\nTransfer the contents to a 96-deep well block, add 125 µL of detergent stock, and seal with a silicon seal. Rotate the block gently at 4 °C for 1 h. Alternatively, add dodecylmaltoside (DDM) and cholesterol hemisuccinate (CHS) directly to the 24-well blocks and place them on a rocker-shaker at 4 °C.\nCentrifuge the block at 2600 × g for 20 min at 4 °C and transfer the supernatant into a new 96-deep-well block.\nPrepare a 50% stock of high-capacity Strep-Tactin resin preequilibrated with lysis buffer.\nAdd 100 µL of resuspended resin stock to each well.\nCover the block with a silicon seal and rotate at 4 °C for 2 h and then centrifuge very briefly (up to 200 × g) to remove liquid sticking to the cover.\nPlace a 96-well filter plate on top of an empty block and transfer the resin/supernatant mix into the filter plate. Rinse the wells of the deep well block with 800 µL of HT wash buffer and transfer to the filter block to collect the maximum amount of resin.\nAllow the buffer to drip through or centrifuge briefly at 200 × g and collect the flowthrough. Place the filter plate on top of a new wash block and wash the resin with 800 µL of HT wash buffer, allowing the buffer to drip through (or centrifuge briefly). Repeat the wash step twice more and centrifuge the block at 500 × g for 3 min to remove the residual HT wash buffer.",
    "Place the filter plate on top of a 96-well microtiter plate. Add 50 µL of HT elution buffer and incubate with shaking at room temperature for 10 min. Elute samples by centrifuging at 500 × g for 3 min.\nRun 15 µL of the eluted sample on a Coomassie-stained SDS-PAGE gel to check the protein expression. Load the remaining samples of eluent onto a Size Exclusion Chromatography (SEC) or Fluorescence-detection Size Exclusion Chromatography (FSEC) system to evaluate protein monodispersity in DDM/CHS.\n8. Transduction for large-scale expression\nNOTE: The following steps are the standard RESOLUTE protocol for SLC expression. Individual targets will require further optimization for the expression time, incubation temperature, and concentration of sodium butyrate. Further, we routinely optimize the baculovirus multiplicity of infection by testing various volumetric ratios of the P3 virus used to infect the suspension-adapted HEK293 cells in small-scale experiments. This is time efficient, uses techniques and equipment already at hand, and directly evaluates the desired experimental output. However, this empirical method requires re-optimization with each amplification of the P3 virus, and other methods are available to quantify the baculovirus particles49,50,51,52.\nScale up the required volume of suspension-adapted HEK293 cells in HEK293 medium.\nDilute suspension-adapted HEK293 cells to 1 × 106 cells/mL and grow for 24 h (at 170 rpm for 2 L roller bottles and 105 rpm for 3 L roller bottles).\nAdd 30 mL of P3 virus per liter of cells and add 5 mM sodium butyrate. Incubate cells at 37 °C for 48 h or at 30 °C for 72 h.\nDuring and after the incubation period, a Key Step is to examine the cells using brightfield microscopy to check for microbial contamination and cell viability. Assess protein expression and localization using fluorescence microscopy with a GFP-compatible filter cube.",
    "Harvest the cells by centrifugation at 900 × g for 20 min.\nWash the cell pellet by resuspending it in 10-15 mL of PBS per liter of cell culture and pellet again at 900 × g for 20 min.\nSnap-freeze the cell pellets in liquid nitrogen and store them at -80 °C.\n9. Protein purification\nNOTE: The following is the standard RESOLUTE method for SLC purification for 5 L of cell culture. For each SLC target, the optimal detergent must be determined empirically. Prepare base buffer, detergent stock solution, wash, elution, and SEC buffers in advance (Table 2). For a list of the standard detergents tested, see Table 3. ATP and MgCl2 in the wash buffer reduce contamination by heat-shock proteins.\nDay 1\n\t\nThaw the frozen cell pellet in a water bath set to room temperature.\nPrepare solubilization buffer with 135 mL of base buffer and three protease Inhibitor Cocktail tablets. Allow the tablets to dissolve.\nResuspend the thawed pellet with solubilization buffer. Use 27 mL of solubilization buffer per 10-15 g of cell pellet, add DNase, and pour into an ice-cold Dounce homogenizer. Homogenize the solution by moving the plunger up and down approximately 20x, keeping the homogenizer on ice.\n\t\tNOTE: The resuspension volume will need to be optimized based on the target protein and the cell pellet mass, which will vary due to the cell density at harvest. Commercial DNase can be added as per the manufacturer's instructions. DNase can also be expressed and purified in-house using established protocols55.\nAdd detergent stock solution to 1% final concentration.",
    "NOTE: A Key Step to optimizing protein purification is identifying the optimal detergent for SLC solubilization and purification, which must be identified empirically. We have regularly utilized various detergents; each alone and in combination with cholesteryl hemisuccinate, keeping the detergent to CHS mass ratio at 10:1.\nTransfer the solubilization mixture to 50 mL conical tubes. Rotate slowly for 1 h at 4 °C.\nCentrifuge the solution at 50,000 × g for 30 min at 4 °C. Collect the supernatant.\nEquilibrate 4-6 mL bed volume of Strep-Tactin resin with the base buffer.\nAdd equilibrated resin to the solubilized supernatant and rotate for 2 h at 4 °C.\nPour the solution into a gravity flow column and allow the solution to flow through.\nWash the resin with 30x the bed volume of Strep wash buffer in 3 equal volume steps.\nAdd 3-5 mL of elution buffer, incubate for 15 min, and collect the eluate. Repeat this step four more times, collecting each elution fraction separately.\n\t\tNOTE: A Key Step is protein elution from the Strep-Tactin resin, where it is important to incubate for 15 min after each addition of the elution buffer. Typically, the first eluate fraction contains a lower concentration of protein due to the dilution of the elution buffer by the residual wash buffer. Therefore, the first eluate fraction may be discarded if a higher final protein concentration is desired. Alternatively, the protein concentration in all serial elutions may also be analyzed using SDS-PAGE to optimize the protocol.\nMeasure protein concentration by UV absorbance spectroscopy, combine the desired elution fractions, and add 3C protease at the ratio of 1:5 (w/w) to 1:10 (w/w).\nRotate slowly overnight at 4 °C.",
    "NOTE: Steps 9.1.12 and 9.1.13 are only necessary if the GFP tag needs removal. If the tag removal is not required, proceed to Step 9.2.4 directly. Alternatively, the protein can be kept at 4 °C overnight to continue the following day. Furthermore, for SLCs with diminished stability, the protease concentration, incubation period, and temperature may need optimization. The 3C protease is active over a wide range of temperatures and allows for optimization best suited for various SLCs.\nDay 2\n\t\nEquilibrate 2-4 mL of bed volume of cobalt metal affinity resin with SEC buffer.\nAdd equilibrated cobalt metal affinity resin to the overnight 3C reaction mixture and rotate for 1 h at 4 °C.\nPour the solution into a gravity flow column and collect the flowthrough.\nConcentrate the flowthrough in a 100 kDa cut-off centrifugal filter by spinning at 3,000 × g at 4 °C and gently mix the sample every 5 min until the desired SEC injection volume is reached.\nEquilibrate a dextran-agarose-based size exclusion chromatography column using SEC buffer. The SEC procedure should be carried out at 4 °C (cooled chamber or cold room).\n\t\tNOTE: Key step: Depending on the oligomeric state of the SLC, a different column, such as an agarose-based size exclusion chromatography column, may be used to perform SEC.\nInject the sample into the sample loop and run the SEC program, with a flow rate such that column pressure is below the column manufacturer's specifications. Using a fraction collector, automatically collect 0.3 mL fractions over the entire SEC run.\nPool peak fractions, measure UV absorbance, and concentrate in a 100 kDa cut-off centrifugal concentrator to the required volume/concentration by spinning at 3,000 × g at 4 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}