{
  "id": 9633,
  "origin_website": "Jove",
  "title": "In vivo Imaging of the Mouse Spinal Cord Using Two-photon Microscopy",
  "procedures": [
    "1. Building the spinal stabilization device\nOrder the Narishige STS-A Compact Spinal Cord Clamps and the Narishige MA-6N head holding adaptor.\nCustom design and make a stainless steel base plate to hold the two Narishige parts in alignment so that the animal's head is supported while its spinal column and tail are clamped. Keep in mind that the entire device should fit under the microscope lens usually on a lowered microscope stage.\n2. Animal surgery\nPre-heat the microscope chamber with an air heating device and maintain it at 37 °C.\nWeigh the animal and make the anesthetic mix using 100 mg ketamine, 15 mg xylazine and 2.5 mg acepromazine per kg of body weight, diluted in 0.9% NaCl solution under sterile conditions.\nAnesthetize the animal by injecting the anesthetic mix (KXA) intraperitoneally. Regular toe pinching should be performed to ensure deep anesthesia throughout the experiment. Supplement with half the original dose hourly or as needed.\nUse a small animal heating pad to provide thermal support while performing the surgical procedure.\nApply artificial tears ointment over the eyes to prevent corneal dehydration and damage.\nShave the back of the animal first with a trimming device and then with a sharp blade to completely remove hair from the area around the incision.\nRemove shaved hairs and disinfect the shaved skin surface with an alcohol pad.\nPerform a small (~1.5 cm) longitudinal incision of the skin over the desired spinal level (thoracic vertebrae shown here).\nExpose the back musculature by carefully retracting the subcutaneous connective tissue.\nCarefully separate the paravertebral muscles from the spinal column at the desired level. Perform the fewest possible incisions to detach the muscles from both sides of each spinous process and then scrape the detached muscles away from the laminar surface.",
    "Choose the lamina that will be removed and prepare the sites of entry for the spinal clamps on each side of the spinal column, immediately rostral and caudal to the laminectomy. Carefully displace muscular tissue to make four pockets where the clamps will be inserted.\nLift the spinal column with the straight toothed-tip forceps to allow safe insertion of the curved blunt-tip scissors under the lamina without touching the spinal cord. Perform the laminectomy by slowly cutting the bone on one side and then on the other side.\nUse a cotton swab or insert precut small gelfoam absorbable gelatin sponge pieces next to the incisions to limit minor bleeding. Use a small vessel cauterizer to control further bleeding if necessary. Use preheated sterile artificial cerebrospinal fluid (ACSF) to wash tissue.\n3. Stabilization of the spinal column and preparation for in vivo imaging\nPlace the animal on an elevation pad on the base plate of the spinal stabilization device and secure the head in the head holding adaptor.\nPlace the spinal clamps of the STS-A device along the anterior-posterior axis of the animal in the pre-prepared pockets flanking the laminectomy (Figure 1). The two clamps should be placed at an angle of ~45° relative to the animal's rostro-caudal axis to allow enough space for lowering a water immersion lens over the exposed spinal cord (Figure 1).\nPlace the third clamp of the STS-A device at the base of the tail so the animal's body can be suspended in the air after removal of the elevation pad for the duration of the imaging experiments (Figure 1).",
    "Build a small well of Gelseal (Amersham Biosciences Corp.) around the exposed spinal cord to facilitate the maintenance of the spinal cord in ACSF and the immersion of the microscope lens in this solution for in vivo imaging.\n4. In vivo imaging of the mouse spinal cord with two-photon microscopy\nTransfer the animal on the spinal stabilization device inside the preheated chamber covering the microscope and secure it on a lowered microscope stage placing the laminectomy straight under the lens (Figure 1).\nLower a water-immersion lens carefully into the ACSF solution making sure that it does not touch the spinal clamps or the Gelseal.\nUse epifluorescence to identify the area of interest and focus on it. Switch to laser scanning mode and perform in vivo imaging using the appropriate two-photon laser excitation wavelength, dichroics and bandpass filters for the fluorophores present in the imaged tissue.\n5. Repetitive imaging and post-operative care\nAt the end of imaging experiments, remove the mouse from the spinal stabilization device and carefully wipe the Gelseal from the area around the laminectomy. Clean the area well.\nRestore and suture the back muscles over the laminectomy.\nRestore and suture the skin over the laminectomy, swab it with betadine.\nProvide 1 ml Lactated Ringers solution (Baxter Healthcare) as a nutrient and hydration supplement, as well as analgesic treatment subcutaneously (0.1 mg/kg buprenorphine).\nAdminister antiseptic treatment intraperitoneally (0.03 ml per mouse, 2.27% enrofloxacin injectable antibacterial solution).\nPlace animal on a heating pad until full recovery from anesthesia and subsequently house it individually.\nRepeat antiseptic administration daily for the first 3-5 days after surgery and analgesic treatment every 8-12 hours for 2-3 days post-operatively. Monitor animal daily to ensure normal behavior and full recovery.",
    "For re-imaging through the same laminectomy, reopen the sutured skin and muscles and repeat the steps described in sections 2 - 4.\nRe-locate the previously imaged area by using the blood vasculature as a map as previously described 10.\n6. Representative results\nAll animal procedures were performed under the guidelines set by institutional Animal Care and Use Committees at the University of California, San Francisco and are in accordance with Federal regulations. A picture of the spinal stabilization device and a schematic showing the positioning of a mouse on the device under a microscope lens is shown in Figure 1. Allowing adequate room for breathing movements underneath the animal's body ensures stable in vivo imaging in the spinal cord. Figure 2 shows the close relationship between microglia and the vasculature as it was imaged in vivo in the spinal cord of Cx3cr1GFP/+ transgenic mice18, in which microglia are endogenously labeled with GFP. Figure 3 shows examples of repetitive in vivo imaging as it was performed in the same spinal cord areas in mice expressing a fluorescent protein in spinal axons (YFP-H line 3) and microglia (in the Cx3cr1GFP/+ mice).\n \n \nimgsrc://cloudfront.jove.com/files/ftp_upload/2760/2760fig1.jpg\nFigure 1. Stabilization of the mouse spinal column for in vivo imaging using two-photon microscopy. (A) A custom-made steel base plate is used to support and align the STS-A Narishige compact spinal cord clamps and the MA-6N Narishige head holding adaptor as shown here. (B) Proper positioning of adult transgenic mice anesthetized with a KXA anesthetic on the spinal stabilization device. The insert shows the placement of the spinal clamps immediately rostrally and caudally to the laminectomy and the exposed spinal cord tissue.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2760/2760fig2.jpg",
    "Figure 2. In vivo imaging of high density microglial cells and blood vessels in the spinal cord of anesthetized mice. Projected but non-aligned z-stacks of (A) highly dense GFP-positive microglia (green) in the spinal cord of a CX3CR1GFP/+ mouse in close proximity with blood vessels (red, labeled with i.v. injection of rhodamine dextran). (B) High magnification image labeled as in (A) of a single microglial cell attached to the wall of a blood vessel with processes extended around the vessel and towards the spinal cord parenchyma. Scale bars, 10μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2760/2760fig3.jpg\nFigure 3. Repetitive in vivo imaging of the same axonal segments and microglia as they were relocated and reimaged in the spinal cord of anesthetized mice on different days. (A) YFP-labeled axons on days 0 and 5. (B). The same vascular structures and microglial cells around them imaged in vivo in the spinal cord of Cx3cr1GFP/+ mice on days 0 and 1. Scale bars, 10μm.\nMovie 1. Representative timelapse sequence acquired in vivo from the mouse spinal cord. This sequence shows in detail fine microglial process dynamics (green) and their interactions with the vasculature (red, labeled with i.v. injection of rhodamine dextran) over time within a tissue densely populated with fluorescent structures. The raw images were only corrected for background noise, brightness and contrast and the timelapse movie was constructed by z-projecting sequentially acquired image stacks, without image alignment, averaging or z-selection of individual planes. Blood vessels go through a similar range of z planes as the images of microglia. Z plane depth: 38 μm. Click here to watch the movie.[href=http://www.jove.com/files/ftp_upload/2760/Davalos_Movie_1.mov]",
    "Movie 2. Timelapse sequence demonstrating the raw stability of the imaging method at the level of a single z-plane. Fast acquisition of the same single z-plane in the spinal cord of CX3CR1GFP/+ mice placed on the spinal stabilization device under KXA anesthesia, demonstrates minimal image displacement between consecutive frames at a scanning rate of 1 frame/s that is faster than the breathing rate of the mouse. The minor residual displacement is probably due to heartbeat. Click here to watch the movie.[href=http://www.jove.com/files/ftp_upload/2760/Davalos_Movie_2.mov]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}