{
  "id": 1799,
  "origin_website": "Cell",
  "title": "Metabolic biorthogonal labeling and dSTORM imaging of peptidoglycan synthesis in Streptococcus pneumoniae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStep I: Peptidoglycan labeling in growing cells\nTiming: 1 day\nIn this step, S. pneumoniae cells in the exponential growth phase are grown for a short period (5 min, called the PULSE period) in the presence of the aDA-DA probe. During this incubation period, aDA-DA is incorporated into the PG precursor (called lipid II), leading to the labeling of the fourth position of the peptide chain with an azide group (see Figure 1[href=https://www.wicell.org#fig1] and (Trouve et al., 2021[href=https://www.wicell.org#bib14])). Following lipid II oligomerization and cross-linking of glycan chains, the new PG will then be labeled for a short time. Optionally, the labeled cells will be further grown in the absence of the probe to investigate the fate of the new PG and determine how it is remodeled over time (PULSE-CHASE experiment).\nPrepare fresh CY medium.\nThaw a 50-μL aliquot of a frozen glycerol stock of pneumococcal cells.\nInoculate 1 mL of CY medium with the glycerol stock (starting OD600nm = 0.1) and incubate the culture for 90 min in a 15-mL Falcon tube placed at 37°C in a static CO2 incubator.\nDilute the culture 1/10th by adding 9 mL of CY medium. Further incubate the culture at 37°C until the OD600nm reaches 0.3.\nDilute the culture 1/10th by mixing 1 mL of sample with 9 mL of CY medium (starting OD600nm = 0.03). Further incubate the culture at 37°C until the OD600nm reaches 0.3.\nNote: These dilutions allow one to reach a steady state of growth, ensuring that all cells are actively dividing.\nPre-warm fresh CY medium, aDA-DA solution and PFA at 37°C.\nCentrifuge (4,000×g, 15 min, 22°C) the culture and resuspend the cell pellet into 1/25th volume of CY medium (see Troubleshooting, problem 1[href=https://www.wicell.org#sec7.1]).",
    "Mix 200 μL of the cell sample with 50 μL of 10 mM aDA-DA (final concentration of 2 mM).\nIncubate cells for 5 min at 37°C in a water bath (labeling PULSE period).\nNote: Incubation of cells with 2 mM aDA-DA for 5 min provides optimal signal-to-noise ratio, temporal and spatial resolution in S. pneumoniae. However, the optimal aDA-DA concentration and duration of the PULSE period might vary in other bacteria (see Troubleshooting, problem 1[href=https://www.wicell.org#sec7.1]).\nFix cells by adding 260 μL of PBS-PFA 4% (the final PFA concentration will be 2%) to the 250-μL sample. Incubate for 12–18 h on ice at 4°C (see Troubleshooting, problems 2[href=https://www.wicell.org#sec7.4] and 5[href=https://www.wicell.org#sec7.16]).\nCritical: Steps 7–10 should be performed as fast and as precisely as possible to get the maximal temporal resolution and efficiency of aDA-DA incorporation.\nOptional: For a PULSE-CHASE experiment aiming at investigating the fate of the labeled PG, add the following steps between steps 9 and 10:\nCentrifuge (4,000×g, 5 min, 22°C) the cells and resuspend the pellet into 250 μL of pre-warmed CY medium.\nIncubate for 15 min at 37°C in a water bath (CHASE period).\nCritical: To perform comparable PULSE and PULSE-CHASE experiments on the same bacterial culture, double the culture volume for the PULSE labeling step, and split the sample in two at the end of the labeling period. One half of the labeled sample will be fixed directly and the other half will be used for the CHASE step (incubation in the absence of the aDA-DA probe) before fixation.\nPause point: Fixed cells can be stored on ice (in an ice bucket placed at 4°C) for up to 2 days before fluorescent tagging.\nStep II: Fluorescent tagging of labeled peptidoglycan\nTiming: 90 min",
    "In this step, a covalent bond will form through a copper-free click chemistry reaction between the azide group incorporated into the PG peptides and the DIBO group carried by the AF647 fluorescent dye.\nCentrifuge the fixed sample (7,000×g, 5 min, 22°C) and resuspend the cell pellet into 150 μL of PBS 1× and 10 μL of 500 μM DIBO-AF647 (final DIBO-AF647 concentration of about 30 μM) (see Troubleshooting, problem 3[href=https://www.wicell.org#sec7.8]).\nIncubate for 1 h at 22°C (CLICK reaction) in the dark (to preserve the fluorescence of AF647), and add 1 mL of 1× PBS.\nWash twice by centrifuging (7,000×g, 5 min, 22°C) the cell sample and resuspending the cell pellet into 1 mL of 1× PBS.\nNote: When adapting this protocol to a new bacterial species, when using another PG probe or fluorescent dye, many factors need to be optimized. For each optimization step, the fluorescent signal-to-noise ratio can be evaluated by conventional fluorescence microscopy before proceeding to dSTORM data collection. Figure 2[href=https://www.wicell.org#fig2] provides a flowchart for this optimization process.\nDuring the two washes, prepare the dSTORM buffer (see Troubleshooting, problem 4[href=https://www.wicell.org#sec7.12]).\nNote: For an experiment in which cells will be mounted between two coverslips, add Tetraspeck fiducial markers in the dSTORM buffer. For an experiment in which cells will be mounted in a microhole agarose pad, do not add any fiducial marker in the dSTORM buffer.\nCentrifuge the cell sample (7,000×g, 5 min, 22°C) and resuspend the pellet into 15 μL of dSTORM buffer.\nNote: Depending on the density of the cell suspension, add more STORM buffers to reach the desired cell density on the microscopy field (about 200 S. pneumoniae cells for a 32.2 x 32.2 μm field, see Figure 6[href=https://www.wicell.org#fig6]).",
    "Optional: Instead of step 14, to prepare sacculi from labeled cells and check incorporation of aDA-DA into the PG, add 300 μL of 8% sodium dodecyl sulfate (SDS) and incubate for 1 h at 100°C. Wash 5 times with 1 mL of 1× PBS. Then incubate with 20 μg⋅mL−1 DNAse and 20 μg⋅mL−1 RNAse in 100 mM Tris-HCl pH 7.5, 20 mM MgCl2 (2 h, 37°C) on a rotating wheel. After addition of 2 mM CaCl2 and 200 μg⋅mL−1 proteinase K, incubate sacculi for 12–18 h at 37°C on a rotating wheel. Finally, wash the sacculi 3 times with 1× PBS before imaging by conventional fluorescence microscopy.\nStep III: Mounting of cells for dSTORM imaging\nTiming: 20–30 min\nThis step describes how to mount pneumococcal cells to observe them along their longitudinal or radial axis. It will need to be adapted for each particular bacterial species and shape, because their morphological features will influence the way they lie on the microscopy coverslips or enter microholes.\nLoad 8 μL of cell suspension onto a rectangular UV-treated microscopy coverslip.\nPlace a square coverslip onto the cell drop and place a Kimtech wipe on top.\nApply a 2.3-kg weight onto the coverslip for 15 min to allow the cells to settle on the microscopy slide (see Troubleshooting, problems 2[href=https://www.wicell.org#sec7.4] and 5[href=https://www.wicell.org#sec7.14]).\nNote: Place and remove the weight by applying a precise vertical movement to prevent slipping of the coverslip.\nSeal with transparent nail polish.\nOptional: The nail polish can be replaced by twinsil silicon glue.\nOptional: Instead of steps 16 to 19, to orient the cells vertically relative to the microscopy coverslip, mount the cells in a microhole agarose pad by applying the following steps:\nLoad 300 μL of 2% (w/vol) agarose solution onto a rectangular UV-treated microscopy coverslip.",
    "Place a micropillar device (Söderström et al., 2018[href=https://www.wicell.org#bib13]) horizontally on top of the agarose drop and wait for about 30 min until the agarose has solidified.\nRemove the micropillar device as vertically as possible and cut the excess of agarose around the microholes.\nNote: The microhole agarose pad should be prepared about 40 min before the end of the fluorescent tagging step (step 12).\nPrepare the dSTORM buffer without the GLOX solution.\nLoad 20 μL of dSTORM buffer without GLOX on the agarose pad, incubate for 10 min at 22°C and remove excess buffer.\nNote: As the agarose pad contains water, step e is essential to replace water with the dSTORM buffer.\nLoad 15 μL of cell suspension onto the agarose pad and apply a slow circular movement to spread the cell suspension all over the agarose pad.\nLet the agarose pad sit for 10 min at 22°C.\nWash twice with 10 μL of dSTORM buffer (containing GLOX) to remove bacteria that have not entered the microholes. Do not flush into the microholes but rather apply a horizontal flow at the surface of the agarose pad.\nPlace a square UV-treated coverslip on top of the agarose pad.\nImmobilize the coverslip with two pieces of tape.\nNote: The microhole agarose pad is too thick to be sealed with nail polish or silicon glue.\nStep IV: dSTORM data acquisition\nTiming: 20 min",
    "This step describes how dSTORM data can be acquired on labeled pneumococcal cells observed at 25°C with a home-built PALM/STORM setup. This setup is based on an Olympus IX81 inverted microscope equipped with a diode-pumped solid-state laser at 405 nm (CrystaLaser) and a diode 643 nm laser (Toptica Photonics). To achieve wide-field illumination, circularly polarized laser beams are focused to the back focal plane of a × 100 1.49-numerical-aperture oil immersion apochromatic objective lens (Olympus). The laser illumination intensities are tuned by an acousto-optic tunable filter (AOTF; AA Opto Electronic). Fluorescence images are acquired with an Evolve 512 back-illuminated EMCCD camera (Photometrics) controlled by the MetaMorph software (Molecular Devices). Commercial STORM systems can also be purchased from companies such as Abbelight or Nikon. The optimal imaging conditions will depend on the fluorescent dye, the composition of the dSTORM buffer and the bacterial species that is observed. Experimental cues to optimize the acquisition of dSTORM data are given in Figure 2[href=https://www.wicell.org#fig2].\nPlace an autofluorescent pink slide on top of the objective and set up the 643-nm laser at low intensity; orient the laser vertically relative to the slide (epifluorescence illumination) and center it in the camera field of view.\nPlace an autofluorescent yellow slide on top of the objective and set up the 405-nm laser at low intensity, and center the laser in the camera field of view to overlap with the 643-nm laser.\nPlace the sample with the rectangular coverslip oriented toward the objective.\nFind a field in which cells are concentrated enough but not overlapping and acquire a bright field image.\nAcquire a diffraction-limited fluorescence image of the bacterial field:\nSet up the 643-nm laser to 0.5% of intensity (8.5 W⋅cm−2).\nAdjust the focus.\nAcquire a diffraction-limited image.\nAcquire the dSTORM image stream:",
    "Progressively increase the 643-nm laser intensity from 0.5 to 100% (from 8.5 W⋅cm−2 to 1.7 kW⋅cm−2, within about 1 min) to convert the fluorophores into their dark state while preserving the chromophore integrity (see Troubleshooting, problem 4[href=https://www.wicell.org#sec7.12]).\nWhen the fluorophores start blinking (see Troubleshooting, problem 4[href=https://www.wicell.org#sec7.12]), acquire the image stream using 100% intensity of the 643-nm laser and 50 ms of exposure time and EM gain of 200.\nNote: the AF647 fluorophores should turn off rapidly and start blinking before reaching 100% of laser intensity (1.7 kW⋅cm−2). When the fluorophore blinking frequency starts decreasing, progressively increase the intensity of the 405-nm laser from 0.1 to 3% (0.05–1.5 W⋅cm−2), to maintain a constant blinking frequency.\nNote: Adjust the exposure time so that the ON time of each fluorophore covers a single frame, and the EM gain to cover the dynamic range of the camera (to avoid saturation or under sampling of the signal).\nNote: The first time you perform the experiment, you can analyze the acquired dSTORM frames using the NanoJ-SQUIRREL plugin in order to plot the resolution versus the number of frames. The optimal number of frames for future experiments can be estimated from the plateau phase of the curve.\nNote: Before placing a new sample, clean the left-over immersion oil on the objective and apply a new drop of oil.\nStep V: dSTORM data processing\nTiming: 40 min",
    "This part of the protocol describes the raw data fitting process, as well as rendering and post-processing of the final super-resolution images using the ThunderSTORM plugin of ImageJ. The first step here is to fill in the camera parameters in the Camera setup window (Figure 4[href=https://www.wicell.org#fig4]B). It is done to calibrate acquired images by converting pixels to nanometers and intensity grey levels (ADUs) to photoelectrons. The parameters such as Photoelectrons per A/D counts (also known as CCD sensitivity or Camera gain, not to mix with the EM gain), Base level (Bias or Camera Offset), and Quantum efficiency can be found in the Certificate of Camera Performance or in the Camera Datasheet that are normally sent with a camera. Alternatively, they can be measured following, for example, the protocol from Photometrics (https://www.photometrics.com/learn/white-papers[href=https://www.photometrics.com/learn/white-papers] → \"Camera Test Protocol\") which is presented below. It is especially recommended to periodically control the EM gain amplification, which is known to degrade with time depending on the usage of an EMCCD camera.\nThe formula used in ThunderSTORM to convert the image signal from grey levels (ADUs) to photoelectrons is the following:\n  Signal   [  e −  ]  =  (  Signal   [ ADUs ]  − Base level   [ ADUs ]   )  ∗   Gain   [  e −  /ADUs ]   EM Gain   \nIn order to get the number of detected photons, this value should be further divided by the camera Quantum efficiency:\n  Signal   [ photons ]  =  Signal   [  e −  ]   / Quantum efficiency   [  e −  /photons ]   \nNote: The Quantum efficiency parameter is wavelength specific, so check the emission spectrum of your dye of choice before referring to the graph. This parameter is not presented in every version of ThunderSTORM plugin.",
    "For a practical purpose, the ratio of gains can be represented as a single parameter called the photon conversion factor and calculated by a single point mean variance test (see step 28).\nCalculate the pixel size of the camera as follows (Figure 3[href=https://www.wicell.org#fig3]A):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1278-Fig3.jpg\nFigure 3. Measurement and calculation of camera parameters\n(A) Image of a microscope ruler taken with a 100× oil objective (left panel) and its intensity profile used to calculate a pixel size value (right panel).\n(B) Screenshots accompanying the procedure to determine a camera Base level.\n(C) Two unfocused images of a grid taken in the same conditions in order to calculate the photon conversion factor.\n(D) The result of image subtraction (images from panel C, whose mean values are shown in the blue box) and measured standard deviation of the signal (green box).\nTake a brightfield image of a calibration target slide (e.g., R1L3S2P from Thorlabs).\nIn ImageJ select the \"Straight line\" tool and plot a cross-section profile (\"Analyze\" → \"Plot profile\"). imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1278-Fx5.jpg\nMeasure the distance between the furthest visible lines of the ruler; divide the known distance (provided by the manufacturer of the calibration slide) in micrometers by the measured value in pixels.\nCalculate the base level of the camera as follows (Figure 3[href=https://www.wicell.org#fig3]B):\nPrevent any light from entering the camera (e.g., by closing a camera shutter).\nSet exposure time to 0 ms (if you get an error message, set it to 1 ms) and record a stack of 100 images.\nNote: Go to \"Analyze\" → \"Set Measurements\" and check that the \"Mean grey value\" parameter is selected.",
    "In ImageJ, calculate the mean intensity value for each frame (in grey levels). For this, make an ROI of the image size, add it to ROI manager (\"Analyze\" → \"Tools\" → \"ROI manager\" → \"Add\"), then select your ROI from the list and click \"More\" → \"Multi Measure\".\nCalculate the base level as the mean of the 100 obtained values by clicking \"Results\" → \"Summarize\" in the Results window.\nCalculate the photon conversion factor of your camera as follows:\nTake two images using the same light level, with 5 ms exposure time and EM Gain used for the dSTORM data collection (Figure 3[href=https://www.wicell.org#fig3]C).\nIn ImageJ, calculate the mean intensity of each image (\"Analyze\" → \"Measure\") and then average the two values (Figure 3[href=https://www.wicell.org#fig3]D, blue box).\nUsing the \"Image Calculator\" tool (\"Process\" → \"Image Calculator\"), subtract one image from another. Both boxes should be checked: create new window and 32-bit (float) result (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: Go to \"Analyze\" → \"Set Measurements\" and check that the \"Standard deviation\" parameter is selected.\nMeasure the standard deviation of the resulting image (\"Analyze\" → \"Measure\") (Figure 3[href=https://www.wicell.org#fig3]D, green box).\nCalculate the variance from the standard deviation:\n  Var  =    StdDev 2  2   \nCalculate the photon conversion factor (PCF) using values from steps 27, 28b and 28e:\n  PCF  =      Average  1 , 2   − Base level )  Var   \nRepeat previous steps with a few more exposure times (e.g., 10, 20, 40 ms) to ensure that the PCF factor does not vary with different light levels.\nNote: As mentioned above, the PCF factor replaces the ratio of gains and should be entered into the field \"Photoelectrons per A/D counts\" of the Camera setup window in ThunderSTORM, whereas the \"EM Gain\" should be set to 1, in order to not double count the real value.",
    "To determine the fitting radius, open the image stream under ImageJ and measure the distance between the maximum and minimum values of a point spread function. For this, draw a line across a single fluorescent spot using the \"Straight line” tool, and plot its intensity against pixels (\"Analyze\" → \"Plot profile\") (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1278-Fig4.jpg\nFigure 4. Running parameters for dSTORM data processing using ThunderSTORM\n(A) Representative image of a single fluorescent spot across which a line has been drawn to plot the point spread function. On the right panel, the Fitting radius value is measured as the distance between the minimum and maximum value of the point spread function.\n(B) Snapshot of a Run analysis window from ThunderSTORM, showing various parameters (arrowheads of different colors are mentioned along the protocol) that must be entered to process data.\nProcess the dSTORM image stream using the ThunderSTORM ImageJ/FIJI plugin as follows:\nNote: A complete guide to dSTORM data processing using ThunderSTORM can be found in (Ovesný et al., 2014[href=https://www.wicell.org#bib8]). Here, the protocol only aims at providing basic directions for this.\nLaunch the ThunderSTORM plugin under FIJI.\nOpen the Camera set up window and specify the \"Pixel size\", \"Photoelectron count”, \"Base level\" and \"EM Gain\" values (Figure 4[href=https://www.wicell.org#fig4]B, red box) found in the certificate of camera performance or equivalent document, or otherwise determined in steps 26–28.\nFor the \"Peak intensity threshold\" (Figure 4[href=https://www.wicell.org#fig4]B, green arrowhead), start with a default value and adjust if needed (between 0.5 and 2) to correct for false positive (threshold is too low, noise is detected) or false negative localizations (threshold is too high and some of real localization are not detected).",
    "In the \"Sub-pixel localization of molecules\" parameters, specify the \"Fitting radius\" value (Figure 4[href=https://www.wicell.org#fig4]B, orange arrowhead) determined in step 29. Decimal values of the fitting radius must be rounded up.\nSpecify \"Maximum likelihood\" as the \"Fitting method\" (Figure 4[href=https://www.wicell.org#fig4]B, dark blue arrowhead).\nNote: \"Maximum likelihood\" is the most precise fitting method in the list, however, it is more resource demanding and requires longer time for fitting.\nEnter an \"Initial sigma\" value (Figure 4[href=https://www.wicell.org#fig4]B, violet arrowhead) approximated to the third of the \"Fitting radius\" value.\nNote: The \"Initial sigma\" value will be optimized after a first run of localization.\nSelect \"Normalized Gaussian\" as the visualization method (Figure 4[href=https://www.wicell.org#fig4]B, light blue arrowhead).\nNote: We use the \"Normalized Gaussian\" method because it allows displaying the calculated localization precision for each molecule.\nRun data analysis.\nUsing the \"Plot histogram\" tab (Figure 5[href=https://www.wicell.org#fig5]A, red ellipse) in the ThunderSTORM result page, plot the \"Sigma\" parameter (Figure 5[href=https://www.wicell.org#fig5]A, violet box). Calculate the \"Initial sigma\" value as the ratio between the \"Mean\" value of the sigma distribution (Figure 5[href=https://www.wicell.org#fig5]B, violet arrowhead) and the \"Pixel size\" value determined in step 26.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1278-Fig5.jpg\nFigure 5. Refinement of dSTORM data processing using ThunderSTORM\n(A) Snapshot of a ThunderSTORM results window showing various options (ellipse of different colors are mentioned along the protocol) to refine the reconstruction of the dSTORM image.\n(B) Snapshots of histogram distributions used to determine the \"Sigma\" value (pink arrowhead) and the localization precision (green arrowhead).\nEnter the new \"Initial sigma\" value in the \"Sub-pixel localization of molecules\" parameters (Figure 4[href=https://www.wicell.org#fig4]B, violet arrowhead) and run the analysis again.\nNote: This step is only performed once, unless the fluorophore and microscope are modified.",
    "Using the \"Plot histogram\" tab (Figure 5[href=https://www.wicell.org#fig5]A, red circle) in the ThunderSTORM result window, plot the \"Uncertainty_xy\" value (Figure 5[href=https://www.wicell.org#fig5]A, green box). Note the localization precision as the \"Mean\" value of the uncertainty distribution (Figure 5[href=https://www.wicell.org#fig5]B, green arrowhead).\nIf you have used fiducial markers during the data acquisition, correct the drift by choosing \"Fiducial markers\" (Figure 5[href=https://www.wicell.org#fig5]A, dark blue circle) in the \"Drift correction\" tab (Figure 5[href=https://www.wicell.org#fig5]A, orange ellipse). Otherwise, use the \"Cross correlation\" method (Figure 5[href=https://www.wicell.org#fig5]A, light blue ellipse) to correct the drift.\nNote: In our experiments, we use fiducial markers when cells are trapped between two coverslips, and corrected the drift using the cross correlation method when cells are trapped in microholes. The cross correlation algorithm works especially well with regular structures and a high number of detected molecules. When working with fiducial markers, make sure to have few of them in the field of view and check that they all display the same drift, indicating that there is no freely moving fiducial marker.\nGenerate the final reconstructed dSTORM image through the \"Visualization\" tab.\nNote: Other post-processing analyses can be run through the localization table tabs to improve the quality of the final image. For example, multi-emitters can be filtered out by their Sigma value using the \"Filter\" tab, background noise can be removed using the \"Density filter\" tab, or multiple localizations of the same molecule can be combined together with the \"Merging\" function."
  ],
  "subjectAreas": [
    "Chemistry",
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}