{
  "id": 2544,
  "origin_website": "Cell",
  "title": "Direct isolation of single cells from living brains of Drosophila melanogaster without dissociation for transcriptome analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvesting the cells\nTiming: 10 min workspace preparation and 30 min/ session\nThis section describes the steps required to remove single cells from living tissues. See Figures 3[href=https://www.wicell.org#fig3]A and 3B for setup.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2049-Fig3.jpg\nFigure 3. Harvest of single cells\n(A) Inverted microscope with manipulator and capillary holder. The angle of the capillary holder should be as shallow as possible.\n(B) The capillary holder.\n(C) The tip of the capillary needs to be filled with halocarbon oil during penetration into the tissue and during storage.\n(D) After release of the cell contents into a drop of reverse transcript mix, aspirate all of the drop including some halocarbon oil using a 0.5-2 μL pipette under a dissecting microscope.\n(E) Examples of successful (+) and failed (-) single cell transcriptome amplifications run in 1% Agarose gel. Samples with a clear cDNA banding pattern in the range between 0.5 and 1.6 kB show excellent results on microarrays. Samples with no signal, only smear or only low bands have failed. Samples with weak bands (+/-) can be used to confirm sequencing or microarray results by qPCR. Numbers mark kb.\nWorkspace preparation:\nInstall a dissecting scope next to the inverted microscope intended to use for micromanipulation. 10× magnification is sufficient.\nCool down the centrifuge to 4°C.\nFill a styrofoam box with dry ice.\nSpray the work bench area that will be used with RNAse decontamination solution (RNAaseZap, AM9780, Invitrogen).\nCapillary adjustment and block.\nAttach the capillary to the polyethylene (PE) tube.\nInsert needle into capillary holder but do not tighten clamp at this point.\nInstall holder into the micromanipulator.\nPlace the coverslip with the embryos/ brain, but without the slide, into the universal sample holder and onto the microscope stage (Figure 3[href=https://www.wicell.org#fig3]B).",
    "Switch on the transmitted light and manually move the tip of the capillary into the light cone.\nClamp the capillary.\nUsing a 10 μL pipette deposit 1 μL of BSA (gamma irradiated, sterile filtered, Fisher Scientific Cat. No. 11580506) onto the halocarbon oil covering the sample.\nNote: Deposit the drop away from the capillary tip.\nUsing the stage controls move the drop under the capillary tip.\nUsing the micromanipulator controls lower the tip into the drop.\nAttach the 5 mL syringe to the end of the PE tube to stop BSA flowing into the needle.\nExpel the BSA by pressing the piston and fill the tip only with halocarbon oil (Figure 3[href=https://www.wicell.org#fig3]C).\nCell harvest.\nEmbryos:\nLift capillary and remove the slip.\nDeposit a drop of immersion oil onto the 63× objective, replace the coverslip and move up the 63× objective so that the immersion oil drop touches the under side of the coverslip.\nNote: Most of the immersion oil will hang below the cover slip and adding or wiping oil while switching between 10× and 63× objective is no longer required.\nUsing the 10× objective and the micromanipulator controls, move the tip close the outer embryo membrane.\nFocus on the rim created by the contact between embryo and glue to adjust the Z position of the tip close to cover slip.\nNote: Move the capillary slightly back and forth to ensure it is not trapped in the glue.\nSwitch to 63× objective and turn on epifluorescence to focus on cell targeted for removal.\nMemorize cell position, close shutter and do not re-focus.\nMove the tip of the capillary into focus.\nPierce through the vitelline membrane with the capillary tip but stay out of the embryo proper.",
    "Move the stage in Y-position so that the capillary rips the membrane along approximately 25% of embryo length.\nMove the capillary up and down with the micromanipulator.\nNote: These capillary movements will break the membrane and allow maneuvering inside the embryo.\nPress the piston of the syringe lightly to allow the oil in the capillary to move to the tip.\nNote: During the next step ensure that the oil stays at the tip. This will prevent the influx of any unwanted tissue whilst moving towards the cell of interest.\nUsing the stage and micromanipulator controls move towards the cell whilst constantly switching between epifluorescence and transmitted light.\nNote: Avoid long epifluorescent exposure (more than 10 s).\nWhen reaching the cell of interest, make sure oil is still the only visible content in the tip.\nSwitch on epifluorescence and using the micromanipulator move the tip tight against the cell.\nNote: If cell contact is established, a deformation of the cell membrane will be visible.\nSlowly increase suction using the syringe and continue when fluorescently labeled material is moving into the needle (see graphical abstract).\nNote: If the suction shows no effect, adjust the needle again. The cell should be moving into the needle smoothly and with low suction. Avoid high suction since this results in the removal of unlabeled tissue. Leave approximately 5% of fluorescence behind to ensure that only one cell is removed,\nHold piston of syringe in position and remove capillary from the embryo.\nNote: Watch the cell at the tip of the capillary. If it moves up the capillary, lower piston and thereby decrease suction. If it moves out of the capillary increase suction. Switching between epifluorescence and transmitted light confirms that only one cell is in the capillary.",
    "Pull the tip out of the embryo into the surrounding halocarbon oil.\nSlowly increase suction to move the cell to the back of the capillary tip but keep it in the field of view.\nLift the capillary out of the oil and change to the 10× objective.\nwith a 2 μL pipette remove 0.6 μL of RT mix from the PCR tube and deposit it on top of the halocarbon oil close to the capillary tip.\nMove the stage to steer the RT drop under the capillary tip.\nLower the tip into the RT mix and under ocular observation expel the capillary contents into the RT mix.\nNote: Stop pressure when oil which fills the back of the capillary is forming drops in the RT mix.\nLift the needle and move the coverslip back on to the slide.\nSet the pipette to 1 μL and under the dissecting scope (5× magnification) suck up the drop of RT mix from the top of the oil (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: Remove also some halocarbon oil to ensure you pick up all of the mix.\nDeposit content of pipette tip into the same PCR tube from which you have removed the 0.6 μL previously (step xxi).\nNote: Always keep tubes in cooling block.\nWipe 63× objective and add new oil.\nSet timer to 20 min and repeat from step ii.\nStop picking cells after 20 min and proceed to reverse transcription.\nBrains: Removal of brain cells follows the protocol listed for embryos with few amendments.\nSchneider’s and oil form a clear border. Avoid that the medium surrounding the brains is sucked into the capillary. When moving closer to the brain, minimally increase pressure within the capillary and make sure that the oil in the needle stays at the tip.",
    "Due to the rupture of the blood brain barrier with the tungsten needle, the capillary should move freely along the brain border. Restrict the removal of cells to the ruptured barrier.\nFor inspection of the capillary content move the tip back into the halocarbon oil. To avoid clogging of the tip, do not leave the tip for longer periods in the Schneider’s medium.\nCritical: Do not use Mercury or Xenon bulbs as epifluorescence source but LEDs. In particular, Mercury lamps tend to damage fluorescently labeled cells. Keep the angle of the capillary as flat as possible to avoid damage to non-fluorescent tissue. During any movement inside the tissue there is the need to press lightly and hold the piston of the syringe, keeping over-pressure inside the capillary to avoid contamination with unlabeled cells. The oil at the capillary tip will help to move cells out of the way. To re-use the capillary, the tip must always be stored filled with halocarbon oil. To avoid contamination with microorganisms and RNAse, ice for cooling the PCR tubes should not be used. Wear gloves.\nReverse transcription and amplification\nTiming: 8 h\nThe following steps lay out the procedure for reverse transcription and amplification of the harvested RNA.\nSpin the PCR tubes with the harvested cells at 14k rpm (35 g) for 1 min at 4°C.\nSet thermal cycler to 70°C for 3 min and pause when temperature has been reached.\nAfter spin has ended, place tubes in thermal cycler, start cycler and wait for 2.5 min.\nAfter 2.5 min, remove tubes from cycler and place immediately on dry ice.\nNote: Do not wait until cycler cools down.",
    "Keep tubes in dry ice and add 1 μL first strand buffer and 0.5 μL NTP (10 mM) to every tube on one side of their inside wall. Add on the opposite side 0.5 μL of SR mix.\nNote: Do not add the ingredients directly into the RT mix.\nDefrost the samples by spinning at 14k (35 g) for 3 min at 4°C.\nSet thermal cycler to 42°C for 90 min followed by 65°C for 10 min to inactivate enzyme.\nOptional: Add 0.5 μL RNAse H and incubate for 20 min at 37°C followed by RNAse inactivation at 65°C for 10 min.\nNote: Always start amplification immediately after reverse transcription or RNAse treatment.\ntable:files/protocols_protocol_2049_5.csv\nIn the case of more than one sample, produce a master mix without the enzyme. Add the enzyme last.\ntable:files/protocols_protocol_2049_6.csv\nCritical: Only use Expand Long Template kit. During protocol optimization we obtained poor cDNA yields with Taq or Phusion enzymes."
  ],
  "subjectAreas": [
    "Genomics",
    "Microscopy",
    "Cell Isolation",
    "Cell Biology",
    "Neuroscience",
    "Genetics",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}