{
  "id": 19618,
  "origin_website": "Jove",
  "title": "Free-floating Immunostaining of Mouse Brains",
  "procedures": [
    "C57BL/6J mice of both sexes (8-16 weeks of age) were used in the present study. Care of all animals and all procedures were approved by Baylor College of Medicine's Institutional Animal Care and Use Committees.\n1. Perfusion\nNOTE: Steps 1.1 - 1.6 are performed in a fume hood.\nAnesthesia\n\t\nPour 5 mL of isoflurane (see the Table of Materials) onto a paper towel placed at the bottom of a desiccator. Introduce the mouse onto the holed barrier inside the desiccator and wait until signs of respiration have disappeared.\n\t\tNOTE: Without respiration, the mouse still has heartbeat for a short period of time, and it will be perfused before the disappearance of the heartbeat.\nBefore proceeding, confirm there is no reflex to a toe-pinch.\nFix the mouse to a foam board by driving a pin through each foot. Ensure that the foam board is placed in a tray to collect liquid spillover.\nExposing the heart\n\t\nMake a longitudinal superficial incision along the midline over the thorax and abdomen, then move the skin aside to expose the muscle wall of the thorax and abdomen. Next, make an incision in the muscle layer to expose the liver and the intestine. Finally, cut the rib cage with scissors to open the thorax and expose the heart and lungs. Use hemostatic forceps to pull the ribcage aside to widen the work area.\nCollection of terminal blood (optional)\n\t\nInsert a 1 mL syringe (see the Table of Materials) carefully into the right atrium of the heart until the tip is completely embedded. Hold the syringe steady and draw blood slowly until the desired volume is reached.",
    "NOTE: Take care not to penetrate past the right atrium; Collection of 300-400 µL of blood is achievable per adult mouse. Additives such as a clot accelerator or anticoagulant may be used, depending on the purpose of blood collection.\nPlacement of the perfusion cannula\n\t\nFor beginners, cut a small hole (<1 mm) in the left ventricle of the heart with scissors and insert a blunt cannula (18 G needle for young mice and 21 G needle for aged mice) through the left ventricle into the ascending aorta. Alternatively, for experienced experimenters, penetrate the left heart ventricle with a blunt cannula directly and insert it into the ascending aorta carefully.\nPlace pins around the conjunction of the cannula and coupled tubing on the foam board to prevent movement during the perfusion. Alternatively, use hemostatic forceps to fix the cannula in place. Proceed to cut the right atrium to allow the outflow of blood from circulation.\n\t\tNOTE: The perfusion cannula and coupled tubing are connected to the perfusion pump.\nPerfusion with saline\n\t\nTurn on the saline pressure switch, and perfuse the mouse transcardially with 40-60 mL of saline (0.9% NaCl: 25 °C, pH 7.4). Observe the outflow from the right atrium and the color of the liver closely.\n\t\t​NOTE: An automated perfusion pump (see the Table of Materials) is used to flush the blood within 1-2 min. As the pressure range of the pump is 1-300 mmHg, the speed can be adjusted accordingly. If saline is leaking from the nose and/or the lung is inflated, decrease the pressure and adjust the cannula. Once the outflow no longer contains blood, the brain is sufficiently flushed with saline. Meanwhile, the liver is devoid of blood and becomes brownish-gray in color.\nPerfusion with formalin",
    "Turn off the saline pressure switch and turn on the formalin pressure switch to perfuse the mouse with 40 mL of 10% neutral buffered formalin (10% NBF: 25 °C, pH 6.8-7.2, see the Table of Materials). Observe the animal's limbs for evidence of tremors.\n\t\t​NOTE: Tail movement may also be observed after infusion of 10% NBF. CAUTION: As NBF is hazardous, it is suggested that researchers wear personal protective equipment (e.g., appropriate respirator, face shield) throughout the procedure.\nBrain isolation9\nUse scissors to remove the head. Make a middle line incision along the integument to expose the skull. Trim off the skin and muscle attachment with scissors.\nMake a cut at the orbital ridge, and then place the sharp end of iris scissors into the foramen magnum. Advance the scissors along the inner surface of the skull, maintaining upward pressure to avoid damage to the brain. Remove the parietal/frontal bones and meninges carefully. Finally, remove the brain from the opened skull gently.\nPost-fixation\n\t\nPlace the brain in a 15 mL tube filled with 10 mL of 5% NBF and 15% sucrose for overnight fixation at 4 °C.\n\t\t​NOTE: To prepare 10 mL of 5% NBF and 15% sucrose, combine 5 mL of 10% NBF and 5 mL of 30% sucrose (w/v, dissolved into phosphate-buffered saline (PBS), see the Table of Materials). Make sure the volume of the fixative buffer is at least 10x larger than the sample itself. Initially, the brain will float in the buffer and will sink to the bottom after overnight fixation.\nDehydration\n\t\nTransfer the brain sample to a 15 mL tube filled with 10 mL of 30% sucrose for dehydration at 4 °C until it sinks.\n2. Cryosectioning (coronal sections)\nPreparation",
    "Place dry ice on top of the height adjustment plate of a sliding microtome, and wait until white frost is visible. Carefully spread 5 mL of 30% sucrose on top of the plate to form a layer of a solid base after the sucrose solution is fully frozen. Place all brain samples (up to 5 brain samples in one batch) horizontally in a line on top of the sucrose, and then add 0.5 mL of 30% sucrose to the bottom of each brain.\n\t\tNOTE: The brain will immediately stick to the frozen sucrose base and gradually freeze from bottom to top. Place additional sucrose around the mounted portion of the brain to form a sturdier base for cutting.\nSectioning\n\t\nAfter 5-10 min of freezing, when the brain has become hard and white, trim the brain until the desired layer/region is reached.\n\t\tNOTE: Adjust the amount of dry ice on the plate to control the temperature. The temperature is too low when ice crystals appear on the surface of the brain. The temperature is too high when the brain becomes soft and is no longer white.\nSwitch from the Trim mode to the Feed mode and section brain tissue to 25 µm thickness. Prepare a 48-well plate filled with 1x PBS, and mark five wells for one mouse brain. Use a paintbrush to collect each section from one mouse and place it into one well. Collect the subsequent section of the same mouse and place it into the 2nd well.\nRepeat 2.2.2 until the 5th well is reached, placing sections 6-10 in the 1st-5th well and so on. Repeat the same procedure for the rest of the brains simultaneously. Repeat until all the sections from one mouse are collected into the 5 wells in anatomical order.",
    "NOTE: Following this procedure, the brain sections from each mouse are aliquoted into 5 series, which can be used for up to 5 different histological studies.\nStorage\n\t\nUse a paintbrush to transfer the sections from each well to a 1.5 mL microtube filled with cryoprotectant buffer (20% glycerol, 30% ethylene glycol, and 50% PBS), and store the samples at -20 °C.\n\t\t​NOTE: These sections stored in small tubes (1.5 mL) can save physical space in the freezer, and the integrity of the sections can be preserved for several months.\n3. Free-floating WFA staining and anti-AVP immunostaining\nPlace a cell strainer into a well of a 6-well cell culture plate filled with PBS, and use a paintbrush to transfer one series of brain sections into the cell strainer. Rinse the sections in PBS by transferring the cell strainer to another well filled with PBS. Rinse for 6 x 10 min on a shaker for sections stored in cryoprotectant buffer and 3 x 10 min for freshly cut sections.\n\tNOTE: All the washing procedures are performed in a 6-well cell culture plate with a cell strainer inside each well (see the Table of Materials). Each strainer holds the brain sections of interest from each mouse. To save reagents, all the incubation procedures described below are performed in a 1.5 mL microcentrifuge tube. Between washing and incubation procedures, use a paintbrush to transfer the brain sections between each cell strainer and each tube. For washing with PBS, 12 mL is adequate for each well.\nPrepare 1 mL of biotin-labeled WFA (1:1,000) solution in PBT (2.5 mL of Triton X-100 dissolved in 1,000 mL of PBS) buffer in 1.5 mL tube. Transfer brain sections from the cell strainer to the tube and incubate at room temperature on a rocking platform ~50 rpm overnight.",
    "Rinse the brain sections with PBS for 3 x 10 min as described in 3.1.\nPrepare 1 mL of streptavidin-Dylight 488 (1:500) solution in PBT in a 1.5 mL tube. Transfer brain sections into the tube and incubate at room temperature for 2 h on a rocking platform at ~50 rpm.\n\tNOTE: Cover the plate with foil to avoid light exposure from this step forward.\nRinse the brain sections with PBS for 3 x 10 min. Incubate the brain sections in blocking buffer (3% normal donkey serum diluted in PBT) for 2 h at room temperature.\n\tNOTE: The choice of blocking serum is determined by the species from which the secondary antibody is generated. e.g., if the secondary antibody is from goat, normal goat serum should be used.\nIncubate the brain sections in primary antibody (rabbit anti-AVP, 1:500) at room temperature on a rocking platform at ~50 rpm overnight.\n\tNOTE: Prepare both primary and secondary antibodies in blocking buffer. The concentration, duration of incubation, and temperature of incubation need to be optimized in pilot studies.\nRinse the brain sections with PBS for 3 x 10 min. Incubate the brain sections in secondary antibody (Alexa Flour 594 donkey anti-rabbit IgG (H+L), 1:500) at room temperature for 2 h on a rocking platform at ~50 rpm. Rinse the brain sections with PBS for 3 x 10 min.\n4. Mounting\nFill two Petri dishes (a diameter of 150 mm) with 100 mL of 1x PBS each. Transfer all the brain sections from one strainer into the first dish, and align the brain sections in neuroanatomical order from caudal to rostral.\n\tNOTE: To avoid mixing sections from different animals, mount one series of brain sections from one animal at a time.",
    "After all the brain sections are aligned in the first dish, submerge one slide into the second dish with one end slightly tilted with a stand (see Figure 1 and Figure 2). Use a fine paintbrush to gently place a brain section just below the air-buffer interface onto the tilted slide. Repeat the same procedure with another brain section and mount it side by side with the first section.\nUse a transfer pipette to slowly and gently remove the buffer to lower its level until both brain sections are entirely above the air-buffer interface.\n\tNOTE: Take care to minimize the disturbance of the buffer surface, or the brain sections may float away. When dry, this row of brain sections will adhere to the slide firmly. If necessary, gently adjust the sections on the slide to ensure there are no wrinkles or folds in the tissue when the sections are still wet.\nRepeat this process until the bottom of the slide is reached. Continue to repeat until all sections are mounted onto the slide(s).\n5. Coverslipping\nAfter all sections have dried (1-24 h at room temperature), place 80-100 µL of anti-fading mounting medium with DAPI (see the Table of Materials) on the slide, and gently apply a glass coverslip to cover the samples.\n\tNOTE: Apply the glass coverslip carefully and slowly to avoid bubbles.\nPlace the slides in a microscope slide box (see the Table of Materials) and store them at 4 °C.\n\t​NOTE: Image all sections within 1-3 days to avoid fading of fluorescence and the development of autofluorescence.\n6. Imaging\nTurn on the scanner and the computer (see Table of Materials). Position the slides in the slide holder with the loading device and insert the holder in the scanner.",
    "NOTE: The scanner enables scanning of multiple channels (e.g., 4′,6-diamidino-2-phenylindole (DAPI), green, and red channels) simultaneously. The scanner scans slides only with a 20x magnification, and a traditional fluorescent microscope (see Table of Materials) can be used when a higher magnification (e.g., 40x) is needed.\nOpen the software for the scanner (see the Table of Materials). Choose the appropriate storage location and scanning profile.\nStart the preview scan by clicking on the Start Preview Scan button. After the preview scan, open the tissue detection wizard and circle the regions of interest for imaging.\nClick on the Start Scan button after choosing the regions for imaging. Wait for the machine to finish scanning. Check the result file and export the images.\n\tNOTE: If the profile is unsuitable for the slide, adjust by refocusing and changing the exposure time or light strength to adapt the profile to the tissues. Refer to the instructions for the scanner for more technical details (Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}