{
  "id": 9579,
  "origin_website": "Jove",
  "title": "Rapid Determination of the Thermal Nociceptive Threshold in Diabetic Rats",
  "procedures": [
    "TNTs of mice and rats are determined by using the incremental hot-plate analgesia meter [iHPAM, IITC Inc. Life Science (Woodland Hills, CA)]. The equipment consists of several components: an aluminum plate (10 x 20 cm) with the heating system underneath and a Plexiglas observation chamber above; a heat controlling unit, software for data acquisition (IITC Part # Soft Series 8), a PC (personal computer) and a footswitch for remote start, stop or reset control of the unit. The heating system also allows starting/stopping/resetting of the heating process manually through a keypad in front of the equipment. The iHPAM can be set to various heating rates, standby/cutoff temperatures.\n1. Equipment Set-up\nBefore testing animals, visually inspect the unit to corroborate the chosen heating rates (e.g., 6 °C/min), initial standby and final cut-off temperatures (e.g., 28 °C and 55 °C, respectively).\nVerify all connections. To keep electronic copy of the results, the unit must be connected to a computer running Software Series 8. Alternatively, hard copies of the results can be printed out via the serial port of unit.\nTest the equipment. Press the footswitch once to make sure the Software Series 8 records the data: initial standby, final cutoff temperatures and time in seconds required to reach the cut-off temperature.\nAs a further control test, the investigators involved in the experiments may need to experience the device on themselves. Withdrawing the hand from the metal plate at the moment of pain perception (46-48 °C) must neither cause harm to the skin nor produce any later discomfort.",
    "Once the unit has been set and the results from steps 1.3 and 1.4 recorded they can be compared. This is helpful to detect potential problems that could invalidate the use of the unit. For instance, discrepancies between initial standby/final cut-off temperatures and the actual reading of the unit, and/or differences between temperatures displayed by the unit and the actual plate temperature required for hand withdrawal.\n2. Testing Normal Animals\nEither young or adult Wistar rats [post-natal (p) age 21-25 days], or mice (p21-25) of any genetic background or gender can be used.  The mice used in our experiments are of the strain C57BL/6J.\nThe night before the experiments to be performed, acclimate the animals by placing their cages on the bench where the iHPAM is placed. Two hours before performing the tests, turn on the iHPAM to familiarize the animals with the background noise of the unit. At this point, the iHPAM can be set up and tested to verify proper function (see Steps 1). Food and water is provided ad libitum throughout the test, except when the animal is in the observation chamber (see Step 2.1).\nNote: It is important not to assume that the laboratory conditions in behavioral experiments are controlled by default. Special attention should be paid to genetic and environmental factors that may influence the outcome of the behavioral studies (reviewed in 7).\nGently place a normal mouse/rat in the Plexiglass observation chamber on top of the heating plate of the unit. Allow the animal to acclimate to the warmed surface (set at 28 °C) until the animal shows a comfortable behavior.",
    "Note: Under this conditions normal adult rats show an initial exploratory behavior, occasionally standing up towards the lid of the observation chamber while sniffing. After a few minutes, rats may show casual bouts of grooming and a relaxed behavior. Sometimes, rats lay with a relaxed body posture (prone extension) while casually sniffing the surroundings. Normal mice are usually more active than rats. However, mice show a relaxed exploratory behavior after few minutes in the observation chamber. It is exceptionally rare to observe either escaping behaviors (e.g., jumping, trying to escape from the observation chamber) or defensive attitudes (e.g., squealing). It is also important to note that mice can communicate pain from one mouse to another8. Therefore, it may be important to test mice placed in separate cages.\nPlace mirrors in the back of the observation chamber, to permit observations at all angles. A tripod holding a digital video camera may be of help to determine the exact moment at which nocifensive (pain avoiding) behavior had occurred.\nOnce the animal is comfortable in the observation chamber heat up the plate by pressing the footswitch. When the plate temperature heats up at a rate of 6 °C/minute, normal animals exhibit nocifensive behavior involving either hind-paw* usually temperatures raging from 46 to 48 °C3,5,9,10.  Thus, the animal is typical removed form the observation chamber after approximately 3 minutes.",
    "Note: Observing the typical nocifensive response of a rat or mouse i.e., hind-paw licking, while shaking and/or lifting, is enough to terminate the thermal stimulus. This is achieved by pressing the footswitch. At this moment, the software records the plate's temperature and the plate immediately cools down until standby temperature (28 °C) is reached (~0.5 min). This temperature i.e., the one that evokes any nocifensive reaction is regarded as the noxious heat threshold (TNT) of the normal (control) animal.\n\t*Sometimes, particularly in mice, nocifensive behavior to noxious temperature may first be observed in one or both forepaws (e.g., licking while sitting), few seconds before hind-paws. However, fore-paw licking is a normal component of the grooming behavior. Hence, only hind-paw reactions are assessed. In occasions mice may groom their hind-paws as well. However, normal grooming do not last more than a few seconds, does not involve intensive licking and usually ends after cleaning its claws.\nGently remove the animal from the plate and place it in its respective cage. The heat threshold measurement is then repeated for other control (normal) animal.\nNote: TNTs can be determined in a single animal at intervals of 1-2 minutes without removing the animal from the observation chamber. TNT determinations in rats or mice can be repeated several times during several days. This is particularly useful to determine the mean TNT of an individual animal as well as its variation with age.\nThe TNT of control animals is expressed as the mean of three or more thresholds ± SEM.",
    "Statistical analysis of data obtained is performed to compare different treatment groups of mice or rats. Parametric procedures including Analysis of Variance may be appropriately used where data are normally distributed and where treatment groups are homoskedastic; when these conditions have been satisfied the following approaches can be applied. Analysis of Variance followed by the Newman-Keuls test to detect differences in multiple measurements i.e., repeated individual TNTs with/without treatment or at different time points (e.g., data in Figure 3). The paired Student's t-test may be used to compare two data groups i.e., TNTs before vs. after drug treatment; the unpaired t-test may be used to determine differences in TNT changes in drug-treated vs. vehicle-treated animals (e.g., data in Figure 4).\n3. Testing Diabetic Animals\nThe streptozotocin (STZ)-induced diabetic rat is the most commonly used animal model to study mechanisms of PDN and to assess analgesic drugs and therapies11,12. Rats made diabetic by a single intraperitoneal dose of STZ (60 mg/kg) can be tested for thermal hyperalgesia during the 3rd week after onset of diabetes11. It is important to note that not all diabetic rats develop PDN. However, animals that do develop hyperalgesia (~50%) can be easily identified. Indeed, their TNTs are lower than normal*.\n*To determine TNTs of STZ-diabetic rats, a starting plate temperature of 15 °C instead of 28 °C is used. The reason for these change is that most diabetic animals with PDN are expected to be hyperalgesic2,11. Therefore, they will have lower than normal noxious heat thresholds (e.g., <45 °C).\nA diabetic rat is placed in the observation chamber on top of the testing apparatus. The animal is allowed to acclimate to the plate surface until the animal shows a comfortable behavior.",
    "Note: Typically, a diabetic rat does not show much of the normal behavior. Diabetic rats are usually hypoactive, lethargic; often showing restricted movements and slow grooming. It is rare to observe standings towards the lid of the observation chamber. After few minutes, diabetic rats may calmly stay in a corner of the chamber with casual sniffing of the surroundings.\nOnce the diabetic animal is comfortable in the observation chamber, the plate is heated up as in Step 2.3 the diabetic rat may exhibit nocifensive behavior involving either hind/fore-paw. This usually happens at non-noxious plate temperatures (e.g., <45 °C), or after no more than 5 minutes in the chamber with the 6 °C/min temperature increase.\nNote: The nocifensive response of a young adult diabetic rat does not differ from that of a normal rat. However, the lowest temperature evoking such behavior is significantly lowered.\nSee Step 2.4\nThe mean of more than three thresholds in the day of the experiment expressed as °C ± SEM is considered the noxious heat threshold of the diabetic animal.\nNote: A similar paradigm to the one explained for normal or diabetic rats can be followed to determine the thermal anti-nocifensive effect of analgesics on heat thresholds.\n4. Testing Analgesia",
    "The anti-nociceptive properties of drugs (e.g., analgesics) as well as the determination of pharmacologic parameters such as the minimum effective dose can be easily obtained by using the steps explained above. It is predicted that proper doses of an analgesic administered to rats/mice would significantly increase their TNTs. This is particularly sensitive in animals with thermal hyperalgesia3. However, to avoid bias in the interpretation of the results, the investigators involved in the behavioral observation of an animal group must not know or be aware if the animals had been treated or not. Further, drugs to be injected by the observer may be prepared by another investigator and labeled A, B, C, etc. Dosage is provided in a printout, listing individual doses per identified animal.\nDepending on the drug being tested, different doses of a potential analgesic may be administered to normal or diabetic animals 5-15 min prior behavioral tests. Proper controls must be included (i.e., age-matched animals injected with vehicle alone and/or diabetic rats without PDN) and tested using identical conditions (e.g., same starting temperature of the plate). Chronic effects of drugs can be tested as well.\n5. Representative Results\nThe lowest plate temperature evoking nocifensive reactions in either hind-paw of young adult normal non-treated rats or mice were determined following steps 2-1 to 2-6. As shown in Figure 1, TNT of normal young adult rats and mice were 47.2 ± 0.2 °C and 47.5 ± 0.5 °C, respectively.\nWe have observed neither significant daily variation of individual's TNTs (Figure 2A) nor significant changes of TNTs among individuals of the same age (Figure 2B). TNT differences due to gender were not observed (not shown).",
    "TNTs of young adult STZ-diabetic rats were determined in a similar fashion as for normal rats (Steps 3.1 to 3.3). However, the starting plate's temperature was set to 15 °C instead of 28 °C. The nocifensive behavior of STZ-diabetic rats was assessed at least three times in an individual and in a daily fashion starting eleven days post-STZ injection. As shown in Figure 3, a significant drop (p<0.01) in the TNT of STZ-diabetic rats becomes evident two weeks post-STZ injection. The mean TNT of STZ-diabetic rats was 45.6 ± 0.1 °C (n=16, pooled values from days 14-23).\nDiabetic rats exhibiting significantly lower TNT than normal were considered to have PDN. These rats were used to test the acute anti-nociceptive properties of an analgesic (compound A). TNTs were determined in normal and diabetic rats injected with either a single dose of the compound or vehicle alone five minutes before the test. As shown in Figure 4, a single intra-peritoneal dose of the compound significantly increased TNTs of diabetic rats when compared to rats treated with vehicle alone (45.6 °C vs 47.6 °C, respectively). The anti-nocifensive effect of compound A was also observed in normal rats; although significant (p<0.01), it was less pronounced (47.4 °C vs 48.0 °C, respectively).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3785/3785fig1.jpg",
    "Figure 1. Determination of TNTs of normal young adult rats or mice: The TNTs of young adult rats (p21-24) or mice (p20-21) were tested in the iHPAM following the steps outlined above. A total of 12 rats and 25 mice were tested. Measurements were performed during several days and the results were pooled. Results are expressed as mean ± SEM. The minimum and maximum TNT values recorded in these rats were 46.2 °C and 48.6 °C respectively. In the case of mice, the maximum and minimum TNT values recorded were 48.8 °C and 44.9 °C, respectively.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3785/3785fig2.jpg\nFigure 2. Age-dependency of TNTs in rats and mice: A) Plotted are the TNTs of four normal rats (n=4) of 21 days of age determined at least three times daily during 5 days. B) TNTs of mice littermates determined once at indicated ages. The numbers on top of each determination point represents the number of littermates used.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3785/3785fig3.jpg\nFigure 3. Diabetic rats become hyperalgesic 3 weeks after the onset of diabetes: TNTs of six (n=6) age matched young adult STZ-diabetic rats were determined every day starting 11 days post-induction of diabetes. Shown are daily TNT averages (mean ± SEM). Diabetic TNTs determined between 11-13 days post-STZ injection were within the normal range (red line). Two weeks after STZ injection TNTs decreased significantly to 45.1 ± 0.4 °C, (p<0.05).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3785/3785fig4.jpg\nFigure 4. Acute anti-nocifensive effects of compound B in STZ-diabetic rats. Young adult normal rats (blue group n=12) and age matched STZ-diabetic hyperalgesic rats (green group n=6) were tested in the iHPAM after intraperitoneal injection of vehicle (dark bars) or compound A (light bars). The mean TNT ± SEM for each treatment (vehicle control or compound A-treated) are shown. Asterisks denote statistical differences (p<0.05).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}