{
  "id": 13313,
  "origin_website": "Jove",
  "title": "Genetic Engineering of Primary Mouse Intestinal Organoids Using Magnetic Nanoparticle Transduction Viral Vectors for Frozen Sectioning",
  "procedures": [
    "This protocol was approved by the Johns Hopkins Medical Institutions Animal Care and Use Committee (IACUC). This protocol is modified from a previously published methods10,11,12,13.\n1. Preparation of Reagents\nPrepare fresh 293T medium several hours in advance and warm to 37 °C in a water bath for at least 10 min before use (Table 1).\nPrepare plasmid DNA2,13,14 for viral packaging. (Table 2).\nAcquire all other required materials (Table of Materials).\n2. Lentivirus or Retrovirus Particle Production\nHuman embryo kidney (HEK) 293T cell seeding (Day 1)\nPrepare one 150 mm culture dish by coating with 50 µg/mL poly-D-lysine dissolved in phosphate buffered saline (PBS; 10 mL/dish) for 1 h at room temperature (RT).\nRemove the phosphate buffered saline (PBS)/poly-D-lysine and wash the coated dish twice with 5 mL PBS.\nSeed 293T cells (8‒10 x 106) in 293T medium (Table 1) to a total volume of 15 mL.\nCulture 293T cells overnight in a standard tissue culture incubator (37 °C, 5% CO2).\nHEK 293T cell transfection (Day 2) \nPerform transfection once cells have reached 70-80% confluence (usually about 24 h after seeding 8‒10 x 106 cells).\nPrepare transfection mixture using an efficient approach such as a commercial cationic liposome formulation (Tables 1‒2, Table of Materials)2.\n\t\t\nDilute lentivirus DNA constructs12 (total ~24 µg plasmid DNA, Table 2) in 1.2 mL of transfection medium and incubate for 5 min at RT in 1.5 mL tubes (Table of Materials).\nDilute transfection regent (36 μL) in 1.2 mL of transfection medium (Table of Materials) and incubate in 5-mL tubes for 5 min according to the manufacturer’s instructions.\nAdd the lentivirus reagent (step 2.2.2.1) to the transfection reagent (step 2.2.2.2) and gently mix by slow pipetting up and down using a 5 mL pipet.\nIncubate the mixture for 20 min at RT.",
    "Gently wash 293T cells with 5 mL of transfection medium and replace with 10 mL of transfection medium.\nAdd the DNA-lipid complexes (from step 2.2.2.3) dropwise to the medium of 293T cells and carefully mix the media in the culture dishes by moving in horizontal and vertical directions to ensure equal distribution of the DNA-lipid complexes in each dish.\nIncubate for 6 h in a standard tissue culture incubator (37 °C, 5% CO2).\nAfter incubation, replace the media with 20 mL fresh virus collecting medium (Table 1).\nVirus collection (Days 3‒5)\nCollect virus media in 50 mL tubes, and store in a 4 °C refrigerator for further concentration.\nReplace 20 mL of fresh virus collecting medium every 24 h and culture overnight (~24 h). Repeat media collection over the next 2 days (Days 4‒5).\nEnsure that the total volume of medium collected after day 5 is ~ 60 mL (20 mL/day x 3 days).\nVirus concentration (Day 5)\nCentrifuge the collected media (60 mL) for 5 min at 400 x g. Then, pass the supernatant through a filter (0.45 µm pores) to remove any cellular debris.\nConcentrate the virus by adding 15 mL of filtered virus media in a centrifugal filter unit (Table of Materials). Centrifuge at 2,500 x g for 15 min at 4 °C. Because the virus cannot pass through this filter, it will be concentrated in the upper chamber of the filter.\nAspirate the flow-through from the tube (bottom chamber) and add another 15 mL of remaining viral collection media supernatant to the same centrifugal filter unit. Centrifuge as above (2,500 x g for 15 min at 4 °C) to concentrate additional virus from the supernatant.",
    "Repeat the process using the same filter for 60 mL media from a single transduced plate until the desired concentration is reached (~100-fold).\n\t\tNote: We typically concentrate ~60 mL of virus collection media to ~600 µL.\nRemove the concentrated virus from the upper chamber of the filter using a 1 mL pipet, then aliquot and store in 1.5 mL tubes (50‒60 µL/tube) at -80 °C for later use. Store concentrated particles for up to 6‒12 months.\n3. Isolating Crypts\nEuthanize mice using CO2 according to the local IACUC guidelines.\nPlace the euthanized animal on its back and wash the abdomen by spraying with 70% ethanol.\nPerform a longitudinal midline incision from the sternum to the groin, incising the skin first, and then the subcutaneous tissue.\nRemove the small intestine from the stomach to the cecum.\nIdentify regions of interest within the small intestine; crypts can be isolated from the duodenum, jejunum and ileum.\nUsing a 10 mL syringe, flush the isolated small intestine with crypt dissociation buffer (pre-chilled PBS containing 1 mM dithiothreitol (DTT), 1% penicillin/streptomycin (no Ca2+ and Mg2+)) in a 10 cm tissue culture dish (Table 1)\nRemove peripheral fat tissue, and open or “fillet” the intestinal tissue longitudinally on a sterile glass plate (15 cm x 15 cm).\nGently scrape off the intestinal epithelial villi using a cell scraper.\nCut the small intestine into 2‒3 cm length-wise sections.\nTransfer the tissue to a 15 mL tube containing pre-chilled PBS using flat forceps (116 mm). Wash the tissue fragments by shaking vigorously by hand for ~30 s (moving the tube in opposite directions ~60 times).\nRefresh the PBS and repeat wash until the PBS becomes clear.\n\tNote: We typically wash the fragments 2‒3 times.",
    "Incubate the tissue in a 15 mL conical tube containing 10 mL of crypt dissociation buffer (Table 1) for 10 min at 4 °C on an orbital shaker at medium speed once the PBS is clear.\nVigorously shake the tube by hand for ~30 s (opposite directions ≈60 times) and transfer the tissue using flat forceps to another 15 mL conical tube containing 10 mL of crypt dissociation buffer. Incubate this fraction on ice. Do not use the first fraction for organoid culture because it contains primarily villi.\nRepeat steps 3.11‒3.13 for 3‒4 times, collecting each fraction and placing them on ice.\nSelect the fraction that is enriched with the highest percentage of intestinal crypts by scanning 200 µL samples from each fraction under an inverted microscope (4x). Identify crypts by the typical morphology as described previously (Figure 1A)10.\nNOTE: They will appear round or oval in shape and contain granulated Paneth cells. In contrast, villi are finger-like structures lacking the granular Paneth cells (Figure 1B).\nPass the selected fraction through a 40 µm cell strainer to obtain crypts of similar size if required. Alternatively, isolate Lgr5+ stem cells based on flow cytometry for green fluorescent protein (GFP) if mice are crossed onto the EGFP-Lgr5+ background or another suitable model that enables identification of Lgr5+ cells2.\nCount the total number of crypts in the selected fraction as follows.\nPipette 50 µL of the selected fraction into a hemocytometer and count the number of crypts using an inverted light microscope (4x). Place ~100 crypts per well when using a 48-well plate to allow for the transduction experiments in which 3‒6 wells will be transduced per experimental condition for gene silencing or overexpression.",
    "Based on the number of crypts per 50 µL, calculate the volume of crypt dissociation buffer needed and transfer that volume into a 1.5 mL tube.\n\t\tNote: For example, 10 crypts per 50 µL are counted, 6 x 50 µL or 300 µL are needed for 300 crypts.\nCentrifuge the crypts in the 1.5-mL tubes at 300 x g for 5 min.\nCarefully discard the supernatant by gently pipetting off the upper liquid layer and resuspend the pellet in 100 µL of growth factor reduced basement membrane matrix on ice (Table of Materials).\nSeed the matrix-containing crypts into a 37 °C pre-warmed 48-well plate (30 µL/well, ~100 crypts/well). Incubate the plate in a standard tissue culture incubator for 5‒15 min to allow for matrix gelation (37 °C, 5% CO2).\nOverlay each gel with 250 µL organoid culture (ENR) medium (Table 1) and place the 48-well plates back into a standard tissue culture incubator (37 °C, 5% CO2). Check the cultures for crypt organization into small, round, cystic shapes after 24 h; buds will form after 2‒5 days.\nGently replace ENR media every 3 days. Remove old ENR media with gentle suction, taking care not touch the matrix when replacing media.\nPassage organoid cultures every 4‒7 days as previously described11.\n4. Organoid Fragment Preparation\nTransduce organoids once they form (within 1‒2 weeks) or after being passaged. For a single transduction experiment, prepare 2‒3 wells of cultured organoids in a 48-well plate per condition with ~100‒200 organoids/well or ~200‒600 organoids per experimental transduction condition.",
    "Exchange ENR with 250 µL transduction media (Table 1) and culture in the transduction media for 3 or more days or until the organoids adopt a cystic morphology. Include both Wnt3a and ROCK inhibitor (Y27632) in the transduction medium to increase the number of stem and Paneth cells; Nicotinamide (Nic) improves culture efficiency (see transduction medium in Table 1).\nMechanically rupture the dome-like basement membrane matrix structure with media and a pipet tip using a 1 mL pipet.\nTransfer the organoids and media to a sterile 1.5 mL tube.\nMechanically disrupt the matrix further by pipetting with a 200 µL pipet ~10‒15 times.\nCentrifuge the organoid fragments at RT at 500 x g for 5 min.\nDiscard the supernatant carefully using a pipette and resuspend the pellet in 1 mL DMEM/F12 medium (Table 1).\nAdd Dispase I (6 µL at 10 mg/mL) and DNase I (2.5 µL at 10 mg/mL). Mix well by pipetting gently using a 1 mL pipet.\nIncubate organoids at 37 °C for 20 min in the 1.5 mL tube.\nAdd 500 µL of ENR media to terminate the dissociation reaction; the serum in the ENR terminates the reaction.\nPass the organoid cells through a 20 µm cell strainer and centrifuge the organoid fragments at 400 x g for 5 min.\nResuspend organoid fragments with 150 µL transduction medium (Table 1).\n5. Genetic Engineering of Organoids or Crypt Cells by Viral Transduction\nNOTE: See Figure 2.\nSeed organoid cell clusters with 200 µL transduction medium/well in a 48-well plate and incubate in a standard tissue culture incubator (37 °C, 5% CO2). Alternatively, place freshly isolated crypt cells (~1,000 crypts) in 200 µL transduction medium/well in a 48-well plate and incubate in a standard tissue culture incubator (37 °C, 5% CO2).",
    "Thaw vials of virus for transduction allowing for ~50 µL of concentrated virus for transduction of each well in 48-well plates or ~100 µL of concentrated virus per well in 24-well plates.\nIncubate virus with 12 µL of magnetic nanoparticle solution for 15 min at RT in a 1.5 mL tube (Table 3).\nAdd the magnetic nanoparticle solution/virus mixture to the cells to be transduced.\nPlace the cell culture plate on a magnetic plate and incubate for at least 2 h (and up to ~6 h) in a standard tissue culture incubator (37 °C, 5% CO2).\n6. Seeding of Infected Organoid Fragments\nTransfer the infected organoid cell clusters and transduction media from each well into a 1.5 mL tube.\nCentrifuge at 500 x g for 5 min.\nDiscard the supernatant with gentle suction and cool the tube containing the pellet on ice for 5 min.\nAdd 120 µL of basement membrane matrix and resuspend the pellet by pipetting slowly up and down.\nSeed 30 µL drops of the matrix-cell mixture into a new 48-well plate.\nIncubate the plate at 37 °C for 5‒15 min until the matrix solidifies.\nAdd transduction medium to each well and incubate in a standard tissue culture incubator for 3‒4 days (37 °C, 5% CO2).\nAfter 3‒4 days, inspect cultures under a light microscope (10x) to ensure organization of cell clusters into organoid structures. Then, gently replace transduction media with 250 µL ENR medium.\nReplace media every 3‒4 days.\n7. Selection (If Applicable)\nAfter 2‒3 days, add relevant antibiotics or hormones for selection to the transduction medium if appropriate.\nNOTE: We used puromycin (2 µg/mL) for selection of the lentivrial transduction because plasmids harbored a puromycin resistance gene2,14.\n8. Confirmation of Successful Transduction and Gene Expression or Silencing",
    "If using FUGW lentivirus2,14, estimate transduction efficiency by measuring GFP signals via fluorescent microscope or flow cytometry.\nValidate gene overexpression or silencing using quantitative reverse transcriptase polymerase chain reaction (RT-PCR) for quantitative comparison of mRNA in the control and experimental organoid cultures.\nConfirm protein levels for protein-coding gene expression or silencing by Western Blot or immunostaining2.\n9. Organoid Cryosection in Basement Membrane Matrix\nNOTE: See Figure 3.\nRemove ENR medium by gentle suction, being careful not to perturb the basement membrane matrix and gently wash once with 500 µL of PBS.\nFix organoids with 1.0 mL of 4% paraformaldehyde (PFA) solution (Table of Materials) at RT for 30 min.\nRemove PFA by suction, and gently wash twice with 1 mL PBS.\nRemove PBS by suction and add 1.0 mL of 30% sucrose buffer to each sample. Incubate fixed organoids in sucrose for 1 h at 4 °C in a cold room, refrigerator, or on ice to dehydrate samples.\nRemove sucrose buffer by suction and add just enough embedding compound (Table of Materials) to cover the matrix layer (~300 µL/well) in each well.\nIncubate at RT for 5 min.\nPlace samples in a -80 °C freezer for 10 min, or until the embedding compound turns solid and white.\nPlace the dish with frozen embedding compound at RT to allow for minimal melting of the compound along the edges. Use a scalpel to separate the block from the walls of the well.\nRemove the matrix-embedding compound block using forceps and place it in a specimen block (e.g. cryomold), working quickly to prevent melting.\nFill the mold completely with embedding compound and freeze at -80 °C for 30 min.\nUse the block is for sectioning or storage in -80 °C freezer for further use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}