{
  "id": 3273,
  "origin_website": "Cell",
  "title": "Establishment of a primary porcine retinal pigment epithelium monolayer to complement retinal ex vivo cultures",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of ppRPE cells\nTiming: 3 h\nThis protocol provides effective preparation, harvesting, and isolation steps for the cultivation of ppRPE cells. All steps need to be carried out in a biosafety cabinet. Dissection tools should be routinely disinfected throughout the protocol using 70% ethanol to minimize the risk of contaminating the freshly isolated ppRPE cells. Upon completion of this protocol, ppRPE cells maintain their organization and pigment, and can be cultured long-term with regular media changes (twice a week with low FBS ppRPE cultivation media) for further experiments.\nDissection of the eye cups and digestion of the RPE layer (Figures 2[href=https://www.wicell.org#fig2] and 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2865-Fig2.jpg\nFigure 2. Opening of the pig eyes for explant generation and ppRPE cell isolation\n(A and B) Use forceps to hold the eye in place to cut a small line with the scalpel (0.5–1 cm distance from the limbus).\n(C) After cutting around the circumference of the globe, cornea, iris, lens, and vitreous humor are removed carefully.\n(D) Cut a line below the visual streak into the eye (red line) to enhance lifting of the retina in the next step.\n(E) Place the eyecup in a petri dish containing 2% PS Neurobasal media to lift the retina up.\n(F) Remove the retina completely without touching the RPE-layer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2865-Fig3.jpg\nFigure 3. Isolation of ppRPE cells\n(A) Eyecups are placed in a 12-well plate and incubated with 1 mL TrypLE-Express for 10 min followed by 1 mL Trypsin/EDTA.\n(B) After 45 min of incubation, the enzymatic reaction is stopped using 10% FBS/PBS solution. ppRPE cells of each eyecup were released by pipetting 15 times up and down.",
    "(C) To reduce cell damage, provide 4 mL of stopping solution in each of two 50 mL falcons. ppRPE-cell solution of 8 eyecups is collected in a 50 mL falcon.\n(D) After centrifugation at 800 x g for 7 min, cell pellets of ppRPE cells can be generated.\n(E) Each pellet should be resuspended with 10% FBS RPE-cultivation media and the total cell suspension is then collected in a 50 mL falcon. 10 mL of 10% FBS RPE-cultivation media is added and the suspension is mixed carefully.\n(F) ppRPE cells can now be seeded in a 12-well plate (1 mL cell suspension/well).\nWash disinfected eyes 10 times each, using two sterile urine cups filled with 2% PS/PBS (Figure 2[href=https://www.wicell.org#fig2]A).\nPlace one eye in a petri dish lid, secure the eye using forceps and cut a small line with a sharp scalpel (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nUsing sharp scissors carefully cut around the circumference of the globe in 0.5 cm distance from the limbus (Figure 2[href=https://www.wicell.org#fig2]C).\nCritical: Make sure that the eyecups not damaged by the incision using forceps, as this could harm the RPE layer.\nCarefully remove cornea, iris, lens, and vitreous humor from the opened eyecup (Figure 2[href=https://www.wicell.org#fig2]C).\nCritical: If the vitreous humor does not easily separate from the retina, make sure to use sharp scissors and to cut a line in 0.5 cm distance from the limbus, as cutting too close to the limbus will make it harder to remove the vitreous humor. Use forceps to slowly stir in the eyecup. Then, the vitreous can be easily dislodged.\nCut a line into the eye (below the visual streak, Figure 2[href=https://www.wicell.org#fig2]D) using scissors and place the opened eyecup in a Neurobasal-medium (+2% PS, 50 mL) containing petri dish.",
    "Critical: Hold the eyecup with forceps only at the upper limit to prevent damage of the ppRPE cells.\nAs the retina lifts, carefully remove any retinal remains using scissors and forceps.\nCritical: Be careful not to disrupt the RPE below and be sure to completely remove the retina. After dissection above the optic nerve, the retina can be removed easily in one piece.\nPlace the opened eyecup in a sterile 12-well plate and pipet (2% PS containing) Neurobasal-media (1 mL/each) into the eyecup to prevent drying. Close the lid (Figure 3[href=https://www.wicell.org#fig3]A).\nContinue with the other 5 eyes until you achieved 16 eyes in total.\nHarvesting of ppRPE cells (Figure 3[href=https://www.wicell.org#fig3])\nAfter all 16 eyes are prepared for ppRPE harvesting, remove the medium from every eyecup. Aspiration of the media will help to remove remaining retinal tissue.\nFor each eyecup pipette 1 mL of TrypLE-Express solution and transfer the closed well plate in an incubator (37°C, 5% CO2) for 10 min.\nCritical: This step is critical to remove remaining retinal tissue.\nAspirate TrypLE-Express solution and replace with 1 mL Trypsin/EDTA per eyecup.\nPlace in incubator (37°C, 5% CO2) for 45 min.\nCritical: Ensure to stick to 45 min. Exceeding this time-period will result in damaged cells. Shortening the incubation time will result in less cells.\nStop the enzymatic reaction by adding 1 mL of stopping solution (10% FBS/PBS) to each eyecup.\nFill 4 mL of stopping solution in each of two 50 mL falcons.\nBy using a P1000 pipette gently, triturate the cell suspension to loosen the ppRPE cells from the walls of each eyecup (Figure 3[href=https://www.wicell.org#fig3]B).\nCritical: To ensure harvesting of all ppRPE cells triturate cell suspension at least 15-times per eyecup.\nTransfer media from each globe to the prepared 50 mL falcons (Figure 3[href=https://www.wicell.org#fig3]C).",
    "The media of 8 eye cups will be collected in one falcon.\nCentrifuge falcons at 800 × g for 7 min (Figure 3[href=https://www.wicell.org#fig3]D).\nResuspend both pellets carefully with 1 mL of fresh RPE-cultivation media containing 10% FBS.\nCollect cell suspensions in one of the 50 mL falcons and add an additional 10 mL RPE-cultivation media (with 10% FBS) and mix carefully (Figure 3[href=https://www.wicell.org#fig3]E).\nSeed cells in a 12-well plate with 1 mL/well (Figure 3[href=https://www.wicell.org#fig3]F).\nPlace the well plate in an incubator (37°C, 5% CO2).\nAfter 48 h carefully remove media completely and replace with fresh RPE-cultivation media containing 10% FBS.\nCritical: Avoid moving the plate during this time as it will disturb adherence of the cells. To keep the ppRPE cells from floating, avoid adding new media directly onto the cells, instead, slowly add the fluid in a rotating motion along the wall of each well.\nRenew 80% of the media every second day.\nWhen reaching confluence, switch to 1% FBS containing RPE-cultivation media to avoid overgrowing. This step will take 1–2 weeks, depending on the quality of the ppRPE cells.\nUse the cells to generate ppRPE-monolayers for co-cultivation.",
    "Critical: It is extremely important to use fresh and cooled eyes, as the survival of the ppRPE cells will decrease when eyes are not cooled or older than 5 h. Furthermore, be careful to perform each step as sterile as possible as ppRPE – harvesting has a high risk of contaminations. To verify that the isolation was successfully without contaminations, testing for mycoplasma/bacteria or fungal contaminations are useful (also see troubleshooting[href=https://www.wicell.org#troubleshooting] problem 5[href=https://www.wicell.org#sec7.9]). Every harvesting step should be performed quickly to enhance better survival rate of the cells. Resuspension of cells must be carried out thoroughly but carefully, as remaining clusters have a strong negative effect on the cultivation (also see troubleshooting[href=https://www.wicell.org#troubleshooting] problem 1[href=https://www.wicell.org#sec7.1]). Furthermore, ensure to not add media directly to ppRPE, as during media replacement ppRPE cells will eventually lift up and the confluent monolayers will be destroyed.\nEstablishing of a functional ppRPE Monolayer\nTiming: 4–6 weeks\nThis protocol aims to generate a ppRPE-monolayer for direct co-cultivation in trans-well inserts.\nCoating.\nCoat a 12-well plate trans-well insert or a 24-well plate trans-well insert with 20 μg/mL pure, sterile laminin in the biosafety cabinet and coat overnight (12–18 h) at 4°C–8°C.\nNext day, remove and store laminin (at 4°C) and wash twice with sterile PBS.\nCritical: Store coated trans-well inserts with PBS at 4°C until use. Avoid longer storage (more than 7 days) and prefer to prepare coated inserts right before use.\nPreparation of the workplace.\nAdjust the ppRPE-cultivation media (with 10% FBS), sterile 1×PBS, stopping solution, Trypsin/EDTA to 37°C by using a water bath.\nPlace a non-coated 12-well plate (for co-cultivation with an 8 mm retinal explant) or a 24-well plate (3–4 mm retinal explant) under the biosafety cabinet as well as the amount of needed (laminin-) coated trans-well inserts.\nSeeding of ppRPE cells.",
    "Transfer the 12-well plates with the confluent ppRPE cells out of the incubator into the biosafety cabinet.\nWash cells with sterile PBS to remove cell debris and FBS from the cultivation media.\nCritical: Avoid flushing the cells off by slowly adding the media in a rotating motion along the wall of the well.\nRemove PBS and add 150 μL Trypsin/EDTA per well.\nPlace the well plate in the incubator at 37°C for 5–10 min.\nCritical: By hitting the edge of the plate, it is possible to check whether the ppRPE cells completely detached. This step also facilitates the simultaneous detachment of all cells. Redo this step until the ppRPE cells are detached.\nAs soon as the ppRPE cells start to detach, add 300 μL stopping-solution and carefully resuspend the cells in each well by flushing them off the bottom several times.\nCollect cell suspension in a 15 mL falcon tube.\nCentrifuge at 800 × g for 7 min.\nCarefully resuspend the cell pellet in 1 mL of ppRPE-cultivation media containing 10% FBS.\nCritical: Avoid getting clumps by pipetting several times.\nCount the cells with an automatic cell counter or manually with a counting chamber.\nSeed 300,000 cells/trans-well insert of a 12-well plate and 150,000 cells/24-trans-well insert.\nFor seeding in a 12-well plate trans-well insert, add 500 μL cell suspension/insert and 1 mL ppRPE cultivation media (10% FBS) at bottom/well.\nFor seeding in a 24-well plate trans-well insert, add 250 μL cell suspension/insert and 500 μL ppRPE cultivation media (10% FBS) at bottom/well.\nPlace the cell culture plates with the inserts on an orbital, horizontal plate shaker with gently shaking of 200 rpm for 3 min.\nCritical: Gentle shaking will enhance equal distribution. Do not extend shaking time.",
    "Carefully transfer the cell culture plates in an incubator and avoid moving them for the next 48 h.\nAfter 48 h remove media completely in a biosafety cabinet and add fresh, sterile RPE-cultivation media containing 10% FBS.\nCritical: Avoid flushing the cells to prevent cell loss. RPE media should always be warmed up to 37°C by using a water bath to avoid cell loss.\nChange media very carefully 3-times a week with 10% FBS ppRPE-cultivation media until cells reach confluency, then switch to 1% FBS ppRPE-cultivation media. This step takes around 1 week. Decrease of FBS concentration will enhance correct polarization and barrier-functions of the ppRPE monolayer.\nCultivate ppRPE-monolayers in 1% FBS ppRPE-cultivation media for another 4 weeks, change media (80%) 3-times/week.\nCritical: This amount of time is needed to ensure correct polarization and differentiation of the cells. Do not shorten this time-period.\nAfter 4 weeks, check for functionality and barrier-functions via transepithelial-Electrical-Resistance (TEER) measurements and staining’s (ZO-1; RPE-65). Additionally, confirm the correct morphology (a regular hexagonal shape of the single cells with dense pigmentation and in total a tight monolayer of uniform sized and tight connected cells without gaps).\nOnly use the ppRPE-monolayers for further experiments, if:\nTEER values are above 300 Ω/cm2.\nTypical RPE cell morphology can be observed (no vessel formation or changes to fibroblast-like morphology/cells, as discussed in the troubleshooting[href=https://www.wicell.org#troubleshooting] section as problem 1[href=https://www.wicell.org#sec7.1]).\nPhalloidin staining reveals typical tight RPE monolayers.\nZO-1 staining reveals honeycomb like structure of the RPE monolayer.\nIn some cases, ppRPE monolayer generation can take up to 6 weeks (also see troubleshooting[href=https://www.wicell.org#troubleshooting] problem 1[href=https://www.wicell.org#sec7.1] and 4[href=https://www.wicell.org#sec7.7]).\nCo-cultivation with retinal organ cultures\nTiming: 3 h",
    "With this final step of the protocol, the previously generated ppRPE monolayers can now be co-cultivated with retinal explants. Thereby, the influence of different stressors can be investigated in a manner closely similar to in vivo methods. Also, different damage models can be established. The retinal explants as well as the ppRPE monolayers can be examined regarding many different parameters, such as viability, gene/protein expression, oxidative stress level, or cell death. By using different diameters of retinal explants, various experiments can be carried out. For example, co-cultivation of a 12-well plate monolayer with an 8 mm (diameter) explant is suitable for evaluating oxidative stress levels, as well as for histological studies using cryo-sectioning. Smaller explants (3–4 mm diameter) co-cultivated with 24-well plate monolayers are more suitable for cell assays designed for 3D tissue. Both sizes are suitable for gene and protein expression analysis.\nPreparation of the workplace/pig eyes.\nPrepare workspace and pig eyes as described in “before you begin[href=https://www.wicell.org#before-you-begin]” (step 2–4; also see Figure 1[href=https://www.wicell.org#fig1]).\nPlace sterile dermal punches and spoons of sizes needed under the biosafety cabinet.\nTo let the cells adapt to the co-cultivation, remove ppRPE-cultivation media from ppRPE monolayers and replace with warm (37°C) retina cultivation media. In this step, also reduce the media in the inserts to 100 μL retina medium for 12-well-plate-Inserts and 30 μL retina medium for 24-well plate-Inserts.\nCritical: Reduced media volume in the insert is needed for less folding and floating of the retinal explants.\nCritical: Warming the retina cultivation media to 37°C in a water bath is essential to prevent cell damage.\nTransfer well plates in the incubator until needed (37°C, 5% CO2).\nDissection of the eye cups (Figure 2[href=https://www.wicell.org#fig2]).\nDissect the eyes as described in “Isolation of primary ppRPE cells”, step 1, a-d.\nGeneration of retinal explants (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2865-Fig4.jpg",
    "Figure 4. Generation of retinal explants of different sizes for co-cultivation with ppRPE monolayer\n(A–G) For co-cultivation with ppRPE monolayers either small retinal explants (3–4 mm, A–E) or large retinal explants (8 mm, (F-G) can be generated. (A–C) 3- and 4-mm retinal explants can be directly obtained from the opened eyecup. With a dermal punch, the retina of the cleaved eyecup is punched. The spoon needs to be filled with 2% PS/Neurobasal media to lift the retina. (A) To remove the explant, the moistened spoon is placed under the retina at the edge of the punched circle and then gently inserted between the retina and the ppRPE layer. (B) The 4 mm explant fits completely on a spoon. (C) To remove remaining ppRPE cells, the explant is washed once in 2% PS/Neurobasal media. (D) The explant is carefully placed on top of a ppRPE monolayer for co-cultivation. (E) Control ppRPE monolayers without retinal explants are cultivated alongside. (F) To generate 8 mm retinal explants, opened eyecups are punctured with an 8 mm dermal punch. To detach the retina from the eyecup, the punched eyecup is transferred into a petri dish containing 2% PS/Neurobasal media. With a spoon and forceps, the explant should be carefully transferred on the spoon. (G) After washing the 8 mm explant in 2% PS/Neurobasal media to remove ppRPE cells, the explant is gently positioned on a 12-well plate insert with or without a ppRPE-monolayer.\nTo generate a flat surface for punches, cut the eyecup in a cloverleaf like structure with sharp scissors. This step creates a flat surface to generate punches.\nThe punch is positioned on one of the cloverleaves and punched through the retina in a twisting motion.",
    "Critical: Be careful to completely penetrate the whole retina. It is critical to only use explants that have a sharp edge and no internal damage from the tweezers as this result in dead and damaged cells.\nCritical: Generate punches from the same area for each condition of your experiment as different areas of the retina have different cell distributions, resulting in increased variation.\nIn case of 3-4 mm explants (Figures 4[href=https://www.wicell.org#fig4]A–4E), moisture a spoon with 2% PS/Neurobasal medium and carefully move the spoon under the retinal punch to transfer the punch onto the spoon (Figures 4[href=https://www.wicell.org#fig4]A and 4B). Afterwards, wash the explant once in a petri dish filled with 2% PS/Neurobasal medium to remove remaining ppRPE cells (Figure 4[href=https://www.wicell.org#fig4]C). Then directly transfer the explant on a ppRPE monolayer (Figures 4[href=https://www.wicell.org#fig4]D and 4E) in an insert.\nCritical: When placing the explant on a ppRPE monolayer avoid touching the monolayer directly as this will result in ppRPE cell damage and interruptions of the monolayer.\nIn case of 8 mm explants (Figures 4[href=https://www.wicell.org#fig4]F and 4G), transfer the punched cloverleaf-eyecup in a 2% PS/Neurobasal containing petri dish. When the retina is detached carefully collect the punches with a spoon (Figure 4[href=https://www.wicell.org#fig4]F), wash them shortly in media to remove remaining ppRPE cells and transfer directly on top of a ppRPE monolayer.\nCritical: To not damage the retinal explant, use forceps very carefully.\nExplants (3 mm) without a ppRPE monolayer can be cultivated for up to 2 weeks without significant loss in viability.\nHistological staining of the ppRPE monolayer\nTiming: 2 days",
    "With this protocol, it is easy to stain different proteins in the ppRPE monolayer (in the well plate as well as in the insert). In addition, to produce histological staining’s of sections, the 12-insert trans-well ppRPE monolayers can be frozen, cut, and stained. This is a general protocol, which can be used for any staining.\nFixation of cells on trans-well membranes\nRemove cell culture media and gently wash upper and lower chambers of the trans-well with 1×PBS to remove excess cell culture media.\nCritical: Be careful to not remove any cells from the membrane.\nFix cells for 30 min at RT by adding 4% paraformaldehyde (PFA in PBS) to the upper and the lower chambers.\nCritical: This step should be performed under a ventilated hood.\nRemove PFA and wash three times with PBST to remove any PFA remains.\nStaining.\nTo enable the antibodies to penetrate the cells, permeabilization solution (0.1% Triton-X-100/PBS) is added to each insert for 5 min at RT. The solution should cover the cell layer completely. Every step from here on is performed with PBS in the well below the inserts.\nWash with PBST for 5 min three times.\nRemove PBST completely.\nBlock cells for 1 h by adding 5% BSA/PBS directly to the cells at RT.\nRemove blocking solution completely.\nDilute primary antibodies in 5% BSA/PBS and add directly to the cells. Incubate overnight (12–18 h) at 4°C–8°C.\nOn the next day, wash monolayers three times for 5 min with PBST and add the secondary antibody, diluted in 5% BSA/PBS, directly on the cells. Incubate for 1 h at RT.\nWash monolayers three times for 5 min with PBST.",
    "To stain nuclei, add DAPI (1 μg/mL in PBS) directly to the monolayer and incubate for 15 min. Afterwards, wash cells three times for 5 min with PBST and once with distilled water. Also, NucBlue Live Cell Stain Ready Probes can be used to stain nuclei. Incubate the membranes with working solution (2 drops to 1 mL of ppRPE cultivation media) for 20 min at RT. Also see troubleshooting[href=https://www.wicell.org#troubleshooting] problems 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5].\nAdd 2 drops of NucBlue Live Stain ReadyProbes to 1 mL of culture media.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2865-Fig5.jpg\nFigure 5. ppRPE-monolayers can be removed from the inserts and placed on a slide\n(A) After (co-)cultivation, ppRPE-monolayers can be fixed and stained to investigate protein expression.\n(B) To use the stained RPE-monolayers for fluorescence microscopy, the membranes can be cut out from the inserts in a circular manner (red line).\n(C) To do so, a small cut is made on the plastic edge of the insert using a sharp scalpel.\n(D and E) (D) A tweezer is placed carefully on the border between the membrane and the plastic wall of the insert, and the membrane is (E) removed completely from the insert.\n(F and G) (F) The uneven parts were cut off in a circular manner using a scissor to flatten the membrane and (G) the ppRPE-monolayer was placed directly in a drop of fluorsafe on an object slide.\n(H) A glass plate can be placed on the membrane.\nOptional: By using a scalpel, gently remove the trans-well membrane from the plastic of the insert by cutting around the edge of the insert (Figures 5[href=https://www.wicell.org#fig5]A–5F). Place membranes into a drop of Fluorsave on a microscope slide (Fig. G). Cover with a glass slide and make pictures immediately (Fig. H). Performing this step will enable generating pictures on a Fluorescence microscope.",
    "Add a few drops of fluorsave to the monolayers to prevent loss of signal. Images of the inserts can now be taken with appropriate inverted microscopes.\nOptional: Lipidgreen2 staining to mark neutral lipids\nTo investigate the deposition of neutral lipids, as seen in Drusen during AMD development, Lipidgreen2 staining can be performed on co-cultivated ppRPE cells.\nRemove culture media completely.\nWash with 1×PBS three times for 5 min.\nCover cells with 10 μM Lipidgreen2 solution in 1×PBS and incubate for 15 min at 37°C.\nWash cells with 1×PBS three times for 5 min.\nFix cells with 4% PFA/PBS for 30 min at RT.\nRemove PFA completely and wash three times with PBST for 5 min.\nCritical: This step should be performed under a ventilated hood.\nIncubate with DAPI for 5 min.\nWash cells with PBST three times for 5 min and once with MilliQ-Water.\nAdd a few drops of Fluorsave to the monolayers. Images of the inserts can now be taken with appropriate microscopes."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}