{
  "id": 17353,
  "origin_website": "Jove",
  "title": "Extraperitoneal Laparoscopic Modified Y-V Plasty for the Treatment of Refractory Bladder Neck Contracture",
  "procedures": [
    "All the procedures in the following protocol were reviewed and approved by the Shandong Provincial Hospital ethics committee.\n1. Patient selection and preparation\nInclusion criteria: Include patients having: lower urinary tract obstruction; urethrogram or cystoscopy suggestive of BNC; history of at least two unsuccessful transurethral procedures.\nExclusion criteria: Exclude patients with: suspected malignancy; acute systemic inflammation or pelvic inflammatory disease; severe coagulation disorders; any other contraindications for general anesthesia or laparoscopy.\nInform all patients about the surgical option with its expected outcomes and potential risks, and obtain written informed consent.\nPerform the procedure under general endotracheal anesthesia. Administer prophylactic antibiotics intravenously 1 h before surgery.\n2. Establish pneumoperitoneum\nPlace the patient in the recumbent position. Make a 3 cm vertical incision at the lower umbilicus edge.\nPerform a blunt separation to reveal extraperitoneal space between rectus abdominis and posterior sheath of rectus abdominis. Then, perform balloon dilatation to improve operative field exposure.\nInsert a 10 mm trocar into the vertical incision. Then, place the camera and establish pneumoperitoneum.\nPlace two 12 mm trocars on both sides 2 cm below the navel, and two 5 mm trocars on bilateral McBurney's point (Figure 1).\n3. Modified Y-V plasty\nClear the fat around the surface of the bladder neck and prostate to expose their junction.\nMake a Y-shaped incision at the anterior wall and neck of the bladder at the junction of prostate and bladder with an ultrasonic knife.\nThen cut the narrow segment fully (i. e., cut the scar tissue completely until the normal bladder mucosa is observed) (Figure 2A).\nInsert a 20F silicone catheter slowly, and check whether the urinary tract is probed for patency. If there is resistance when passing through the bladder neck, the narrow segment may need to be incised again (Figure 2B).",
    "Perform a V-shaped anastomosis with two 2-0 absorbable barbed sutures. Suture the lowest point of bladder flap and normal mucosa.\nThen, close the mucosa and submucosa layer with a tensionless continuous suture on the left side of the bladder. Perform the same procedure on the other side (Figure 2C).\nTighten both sutures simultaneously. Then, suture serosa and tunica muscularis for reinforcement (Figure 2D). Knot the two sutures at the 12 o'clock position.\nIndwell a pelvic drainage tube and remove the trocars after the abdomen is deflated. Close the skin with an interrupted suture.\n4. Postoperative management\nMonitor the color and volume of urine and drainage fluid. Remove the drainage tube 1-2 days after surgery, and remove the urinary catheter 2 weeks after surgery.\nFollow up postoperatively at 3 months, 6 months, 1 year, and annually thereafter. The follow-ups include the international prostate symptom score (IPSS), maximum urine flow rate (Qmax; mL/s), urethrography, urethroscopy, and ultrasound.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}