{
  "id": 8337,
  "origin_website": "Jove",
  "title": "Analysis of Cerebral Vasospasm in a Murine Model of Subarachnoid Hemorrhage with High Frequency Transcranial Duplex Ultrasound",
  "procedures": [
    "The animal experiments were approved by the responsible animal care committee (Landesuntersuchungsamt Rheinland-Pfalz) and conducted in accordance with the German Animal Welfare Act (TierSchG). All applicable international, national, and institutional guidelines for the care and use of animals were followed. In this study, we performed measurements of blood flow velocities of intracranial and extracranial arteries in female C57BL/6N mice aged 11-12 weeks with a body weight between 19-21 g. The mice were subjected to either SAH induction or sham surgery, which has been described in detail elsewhere10,12,13.\n1. Preparation of materials\nSwitch on the ultrasound machine and enter the animal ID.\nWarm the heating plate of the ultrasound system to 37 °C. Ensure that the rectal temperature probe is ready for use.\nUse a water bath to heat the ultrasound gel to 37 °C. Prepare hair removal cream, contact cream for the electrodes, and eye ointment.\n2. Anesthesia\nInduce anesthesia by putting the mouse in a chamber flushed with 4% isoflurane and 40% O2 for 1 min. Protect the eyes with eye ointment. Continue only after a sufficiently deep anesthesia has been reached (absence of reactions to pain stimuli).\nMaintain anesthesia with 1.5% isoflurane and 40% O2 using an anesthesia mask throughout the entire procedure.\n3. Determination of blood flow velocities of the intracranial internal carotid arteries with transcranial high-frequency Duplex sonography\nPlace the mouse in the prone position on the heating plate of the ultrasound system to maintain a body temperature of 37 °C.",
    "Coat the four extremities of the animal with conductive paste and fix them with tape on the ECG electrodes embedded in the board. Check if the physiological parameters (ECG, respiration signal) are displayed correctly on the screen of the imaging system (e.g., Vevo3100). If necessary, adjust the level of anesthesia to obtain target heart rate of 400-500 beats per minute (bpm).\nPlace lube on a rectal temperature probe and carefully insert it to monitor the body temperature. Use an additional warming lamp if necessary.\nBefore the first exam, remove the fur at the occiput chemically using hair removal cream. Use a cotton swab to spread and rub the cream for 2 min until the hairs start to fall out.\n\t\nAfter an additional 2 min, remove the cream and hairs with a spatula and disinfect the skin with an alcoholic skin antiseptic. Coat it with ultrasound gel warmed to 37 °C.\nUse a 38 MHz linear array transducer and a frame rate above 200 frames/s to acquire ultrasound images and fixate the probe in the mechanical arm. Place the transducer on the occiput tilted back by 30°.\nUse Brightness-(B)-mode and Color-wave-(CW) Doppler-mode to visualize the right intracranial internal carotid artery and move the transducer with the control unit back and forward, until the maximal flow of the arteries is found.\nTo collect anatomical information, use the traditional B-Mode and CW-Doppler-mode and start acquisition by clicking on the Acquire button.\n\t\nTo record information on the flow characteristics of the intracranial vessels click on the Pulse-Wave (PW) Doppler button, place the sample volume in the center of the vessel, and acquire a cine loop longer than 3 s.\nProceed identically with the left side.\nProceed with the extracranial carotid arteries.",
    "4. Determination of blood flow velocities of the extracranial internal carotid arteries with high frequency Duplex sonography\nPlace the mouse in the supine position on the heating plate of the ultrasound system to maintain a body temperature of 37 °C.\nCoat the four extremities of the animal with conductive paste and fix them with tape on the ECG electrodes embedded in the board. Check again for the correct display of the physiological parameters on the screen.\nBefore the first exam, remove the hair at the front neck chemically by using hair removal cream as described above. Coat the front neck with ultrasound gel warmed to 37 °C.\nUse a 38 MHz linear array transducer and a frame rate above 200 frames/s to acquire ultrasound images. Place the transducer parallel to the animal and adjust the position in order to obtain longitudinal images of the right carotid artery.\nUse Brightness-(B)-mode and Color-wave-(CW) Doppler-mode to visualize the right carotid artery. The image should contain the right common carotid artery (RCC), the right internal carotid artery (RICA) and the right external carotid artery (RECA).\nTo collect anatomical information, use the traditional B-Mode and CW-Doppler-mode and start acquisition by clicking on the Acquire button.\n\t\nTo record information on the flow characteristics of the extracranial carotid artery click on the Pulse-Wave (PW) Doppler button, place the sample volume in the center of the middle of the common carotid artery, the internal carotid artery and the external carotid artery and acquire a cine loop longer than 3 s.\nProceed identically with the left side.\nTerminate anesthesia and remove the animal from the warming plate. Return the animal to a cage placed in an incubator heated to 37 °C for 1 hour to prevent hypothermia and check for full recovery.\n5. Processing of ultrasonography data",
    "Use an external workstation for post-processing of the high-frequency ultrasound data. Export the B-mode, CW-Doppler-mode and PW-Doppler-mode images and cine loops.\nOpen the exported ultrasound study. Select one animal and open the PW-Doppler cine loop of the intracranial carotid artery. In this protocol typically 7 to 8 heartbeats and corresponding flow-velocity curves are recorded.\nPause the cine loop and click on the Measurement button. Choose the Vascular Package and click on RICA PSV to measure the peak systolic pressure (PSV). Now click left on the peak of a velocity curve and pull the straight line to the zero line. Determine the measurement by a click with the right mouse button.\nNow choose RICA EDV to measure the enddiastolic velocity (EDV). Click left on minimal rash of the velocity curve at the end of the diastole. Pull the line straight to the zero line and determine measurement by a click with the right mouse button.\nChoose RICA VTI to measure the velocity time integral (VTI). Click left at the beginning of a velocity curve and follow the curve with the mouse until the end of the diastolic plateau. Then click right again to determine the measurement.\nExport the data of the intracerebral internal carotid arteries by using the report button. Press Export and save the data as a VSI Report file.\nUse the same approach to measure PSV, EDV and VTI of the right extracranial internal carotid arteries and export the data accordingly.\nProceed identically with the left side.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}