{
  "id": 3800,
  "origin_website": "Cell",
  "title": "Sequencing, cloning, and antigen binding analysis of monoclonal antibodies isolated from single mouse B cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse immunization and treatments\nCritical: Experiments involving mice should be performed according to all relevant governmental and institutional guidelines and regulations, in compliance with protocols approved by local animal ethics committees.\nTiming: 2 h\nFootpad (FP) immunization at experimental day 0.\nAntigen precipitation in alum.\nDilution of the antigen at the chosen concentration in PBS 1× and Alum at a 2:1 ratio (25 μL/FP with 5 μg of TM4-Core diluted in 8.33 μL Alum and 16.7 μL PBS 1×).\nRotate at 4°C for 45 min.\nInjection of adjuvanted antigen in the footpad of anesthetized mice (isoflurane anesthesia) using 0.5 mL insulin syringe (25 μL/FP).\nTiming: 1 h\nTamoxifen treatment. The day of injection, the concentration and the number of doses will vary according to the user’s proposed study. In the experiment illustrated in Figure 2[href=https://www.wicell.org#fig2]A, we injected one dose (12 mg) 9 days after immunization.\nDissolve tamoxifen in Corn oil at 60 mg/mL. Incubate in a rotator at 60°C for 15 min minimum. (Troubleshooting 2)\nOral gavage (200 μL/mice) with plastic feeding tube and 1 mL syringe.\nSingle-cell index sorting\nTiming: 1 day\nCritical: Cell staining, cytometer compensations, and gating strategies need to be optimized before the experiment.\nPreparation of B cell suspensions.\nEuthanize mice according to institutional guidelines.\nCollect the mouse popliteal lymph nodes (LNs): secure the mice with the knee down to expose the popliteal fossa. Carefully separate the LN from surrounding adipose tissues and muscles using micro-dissecting tweezers and forceps (Figure 3[href=https://www.wicell.org#fig3]). Put the LN in a 70-μm polystyrene sterile cell strainer immersed in FACS Buffer (FB: PBS 1× pH 7.2, 10% Fetal Bovine Serum (FBS), 2 mM EDTA, 4°C) and placed in a Petri dish on ice.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/522-Fig3.jpg\nFigure 3. Dissection mouse popliteal lymph nodes",
    "Red arrow: position popliteal LN, right footpad.\nDisaggregate the LN with the help of a 3 mL syringe plunger (Figure 3[href=https://www.wicell.org#fig3]).\nFilter the cell suspensions into a 15 mL conical tube using a new 70-μm polystyrene sterile cell strainer. Bring the final volume to 10 mL with cold FB.\nCentrifuge the cells at 350 × g for 5 min at 4°C. Carefully remove the supernatant.\nLyse red blood cells by resuspending the pellet in 1 mL of ACK Lysis Buffer for 1 min at 4°C. Stop the reaction with 10 mL of FB.\nCentrifuge the cells at 350 × g for 5 min at 4°C. Carefully remove the supernatant.\nResuspend the cells in 500 μL of FB and transfer them to a 5 mL polystyrene round-bottom tube.\nB cell staining.\nCentrifuge at 350 × g for 5 min at 4°C.\nAdd anti-mouse CD16/32 to block Fc receptors (1:500; final concentration at 1 μg/mL) in FB for 15 min at 4°C.\nCentrifuge the tubes at 350 × g for 5 min at 4°C. Carefully remove the supernatant.\nAdd fluorescently labeled antibodies and Dead Cells Marker (DCM) in PBS 1× pH 7.2, 2 mM EDTA (without adding FBS as it decreases the DCM labeling efficiency; DCM staining protocol is modified from the manufacturer’s instructions) for 30 min at 4°C (Figure 2[href=https://www.wicell.org#fig2]B: labeling of ZSGreen+ B cells).\nWash the cells with 2 mL of FB and centrifuge at 350 × g for 5 min at 4°C. Carefully remove the supernatant.\nResuspend the cells in 500 μL of FB. Protect from the light and keep at 4°C\nSingle B cell sort (gating strategy: Figures 2[href=https://www.wicell.org#fig2]B and 2C).",
    "Add 5 μL of lysis buffer (TCL with 1% 2-β-mercaptoethanol) into each well of a 96-well PCR plate. Prepare an ice bucket with dry ice to immediately freeze the plates containing the sorted B cells.\nUsing a BD Aria III cell sorter, or equivalent, proceed with the compensation setup and set the gate strategy.\nSort single B cells into individual wells of the 96-well plates containing the lysis buffer. In the experiment illustrated in Figures 2[href=https://www.wicell.org#fig2]A–2C we sorted between 3 and 4 96-well plates of ZSGreen+ B cells from one popliteal LN.\nAfter completion, immediately seal the 96-well plate and place it on dry ice.\nPause Point: Plates can be stored at −80°C for several years.\nmRNA purification and reverse transcription\nTiming: 2.5 h\nAfter isolation of single B cells, single-cell RNA is purified using RNA-SPRI paramagnetic beads. The RNA-SPRI beads need to be brought to room temperature (20°C–22°C) at least 30 min in advance. The reverse transcription mix 1 and 2 can be prepared in advance and stored at 4°C until use.\nCritical: It is critical to work in a DNA and RNase free area to prevent potential contamination and RNA degradation. It is recommended to work in a laminar flow hood specifically designated for antibody gene amplification from single cells, to use sterile filter pipette tips and to thoroughly clean all pipets and surfaces with RNase Away.\nBring RNA-SPRI beads at room temperature (20°C–22°C) for 30 min and mix thoroughly by vortexing to resuspend any magnetic particles that may have settled.\nThaw the plate containing the sorted B cells on ice for 5 min. Centrifuge at 400 × g for 30 s at 4°C and add 10 μL of nuclease-free water.",
    "Add 33 μL of RNA-SPRI beads/well and mix by pipetting. We used a 1: 2.2 ratio of Lysate and RNA-SPRI beads to allow the purification of RNA molecules of both larger and smaller molecular weights. Incubate at RT (20°C–22°C) for 10 min.\nPrepare wash buffer: 80% ethanol in nuclease-free water.\nPlace the plate on a DynaMag-96 side magnet. Incubate for 5 min at RT (20°C–22°C) or until beads are clearly attached to the wall of the tube next to the magnet.\nRemove the supernatant with a multichannel pipet without disturbing the bead pellet.\nAdd 125 μL of 80% ethanol and wash the beads by moving the plate to an adjacent magnet column a total of 4 times. Allow the beads to completely move from side to side of the tube wall to ensure proper washing. Carefully remove the ethanol and repeat the washes two more times for a total of 3 washes.\nAir dry the bead pellets for 8–10 min.\nElute RNA from beads with 11 μL of reverse transcription (RT) Mix-1 per well. Pipette up and down several times to resuspend the bead pellet.\ntable:files/protocols_protocol_522_6.csv\nIncubate the plates for 3 min at 65°C in a thermocycler.\nAdd 7 μL of RT Mix-2 per well.\ntable:files/protocols_protocol_522_7.csv\nCritical: The reverse transcription mix 1 and 2 can be prepared in advance and stored at 4°C until use.\nIncubate the plate in a thermocycler using the following program:\ntable:files/protocols_protocol_522_8.csv\nAdd 10 μL/well of nuclease-free water. Proceed to immunoglobulin gene amplification by PCR or store the plate containing cDNA at −20°C or −80°C.\nPause Point: Plates can be stored for several years.\nFirst PCR amplification of the heavy- and light-chain genes\nTiming: 3.5 h",
    "Critical: Use sterile filter pipette tips for all reactions. All surfaces should be sprayed with DNA/RNAse away. Resuspend lyophilized primers (Table 1[href=https://www.wicell.org#tbl1]) at 50 μM in RNase free water. Prepare a working solution mix by mixing equal volumes of each primer.\nThaw the cDNA plate on ice.\nThe variable heavy and light chain genes are amplified in separate PCR reactions. Prepare PCR mixes for the first step of PCR amplification (PCR 1) of IgH and IgK genes.\ntable:files/protocols_protocol_522_9.csv\nPrimers (Table 1[href=https://www.wicell.org#tbl1]):\nThe forward primers are a mix of 9 or 10 different primers. In order to have sufficient amount of each primer in the reaction we use a slightly higher concentration of the forward mix compared to the concentration of the single reverse primer.\n5′ F Primers Heavy chain: 1mFHI / 1mFHII / 1mFHIII / 1mFHIV / 1mFHV / 1mFHVI / 1mFHVII / 1mFHVIII / 1mFHIX\n3′ R Primers Heavy chain: 1mRHG (IgG) / 1mRHC\n5′ F Primers Light chain: 1mFkA / 1mFkB / 1mFkC / 1mFkD / 1mFkE / 1mFkF / 1mFkG / 1mFkH / 1mFkI / 1mFkJ\n3′ R Primer Light chain: 1mRk\nAdd 38 μL/well of PCR 1 mix in a new 96-well PCR plate.\nCentrifuge the cDNA plate at 400 × g for 1 min at 4°C.\nTransfer 3 μL of cDNA solution from the cDNA plate to the same position in the new 96-well plate containing PCR1 mix.\nPlace the plate in a thermocycler and incubate according to the following program:\ntable:files/protocols_protocol_522_10.csv\nProceed to the second step of amplification (PCR 2) or store the PCR1 plate at −20°C.\nPause Point: Plates can be stored at −20°C for several years.\nSecond PCR amplification of the heavy- and light-chain genes\nTiming: 3.5 h",
    "Critical: Use sterile filter pipette tips for all reactions. All surfaces should be sprayed with DNA/RNAse away. Resuspend lyophilized primers (Table 1[href=https://www.wicell.org#tbl1]) at 50 μM in RNase free water. Prepare a working solution mix by mixing equal volumes of each primer.\nThaw the PCR 1 plate for 5 min on ice.\nPrepare PCR mixes for the second step of PCR amplification (PCR 2) of IgH and IgK genes.\ntable:files/protocols_protocol_522_11.csv\nLoading buffer: dissolve 20 g sucrose in nuclease-free water to a final volume of 50 mL and sprinkle a few grains of cresol red dye.\nPrimers (Table 1[href=https://www.wicell.org#tbl1]):\n5′ F Primer Heavy chain: 2mFG\n3′ R Primers Heavy chain: 2mRG (IgG) 1mRHC\n5′ F Primer Light chain: IgK-Fw1-Fw2\n3′ R Primer Light chain: 2mRk\nAdd 38 μL/well of PCR 2 mix in a new 96-well PCR plate.\nCentrifuge the PCR 1 plate at 400 × g for 1 min at 4°C.\nTransfer 4 μL of PCR 1 from each well to the same position in the PCR 2 plate.\nPlace the plate in a thermocycler and incubate according to the following program:\ntable:files/protocols_protocol_522_12.csv\ntable:files/protocols_protocol_522_13.csv\nRun 5 μL of the product of PCR 2 in a 2% agarose gel. The expected PCR product is ~500 bp for IgH and ~450 bp for IgK.\nSequence the PCR 2 products by Sanger sequencing using the reverse primer of PCR 2. In the experiment illustrated in Figures 2[href=https://www.wicell.org#fig2]A–2D we sequenced between 77 to 124 GC cells paired antibodies from 3 to 4 96-well plates of ZSGreen+ GC cells sorted from one popliteal LN\nPause Point: Plates can be stored at 4°C for several days.\nPCR amplification of heavy- and light-chain genes for cloning\nTiming: 2.5 h",
    "The cloned insert is obtained amplifying the product of the first nested PCR to add sequences homologous to the plasmid’s site of insertion. The primers used for the cloning PCR have adaptor sequences adding at the end of the inserts the restriction site homolog to the vectors. In this protocol, we are using AgeI and SalI for heavy chain and AgeI and BsiWI for K chain.\nCritical: Use sterile filter pipette tips for all reactions. All surfaces should be sprayed with DNA/RNase away. Resuspend lyophilized primers at 50 μM in RNase free water. Prepare a working solution mix by mixing equal volumes of each primer.\nThaw the first PCR plate for 5 min on ice.\nThe variable heavy and light chain genes are amplified by separate PCR reactions. Prepare PCR mix for the cloning PCR for each chain.\ntable:files/protocols_protocol_522_14.csv\nPrimers (Table 2[href=https://www.wicell.org#tbl2]):\n5′ F Primers Heavy chain: T4hmFH_I / T4hmFH_II / T4hmFH_III / T4hmFH_IV / T4hmFH_V / T4hmFH_VI / T4hmFH_VII / T4hmFH_VIII / T4hmFH_IX\n3′ R Primers Heavy chain: T4hmRG_I / T4hmRG_II / T4hmRG_III / T4hmRG_IV\n5′ F Primers Light chain: T4hmFK_I / T4hmFK_II / T4hmFK_III / T4hmFK_IV / T4hmFK_V / T4hmFK_VI / T4hmFK_VII / T4hmFK_VIII / T4hmFK_IX\n3′ R Primers Light chain: T4hmRK_I / T4hmRK_II / T4hmRK_III\nAdd 38 μL/well of cloning PCR mix in a new 96-well PCR plate.\nCentrifuge the PCR 1 plate at 400 × g for 1 min at 4°C.\nAdd 4 μL of PCR 1 from each well to the same position in the Cloning PCR plate.\nPlace the plate in a thermocycler and run the following program:\ntable:files/protocols_protocol_522_15.csv",
    "Load 5 μL of the cloning PCR product from each well in a 2% agarose gel. Run the gel at 140 V for 20 min. The expected product is ~500 bp for the heavy chain and ~450 bp for the light chain.\nPause Point: Plates can be stored at 4°C for several days.\nSequence and ligation-independent cloning (SLIC) of heavy and light chain genes in expression vectors\nTiming: 2 days\nCritical: Preset thermocyclers at 25°C and 42°C and bring LB plates containing the appropriate antibiotic to room temperature (20°C–22°C) (e.g., ampicillin).\nPlasmid linearization: the expression vector containing the corresponding restrictions sites specific for IgH (AgeI and SalI) or IgK (AgeI and BSiWI) insertion need to be linearized with the appropriate restriction enzymes to allows the homologous recombination with the insert.\nEnzymatic digestion with the appropriate restriction enzymes. In this method, we used AgeI and SalI to linearize the plasmid containing the IgG constant region and AgeI and BsiWI to linearize the plasmid containing the IgK constant region.\ntable:files/protocols_protocol_522_16.csv\nIncubate at 37°C, overnight (12–16 h).\nAdd 1 μL of Alkaline phosphatase, calf intestinal (CIP) (stock 10,000 U/mL) to de-phosphorylate the 5′ and 3′ ends of the linearized vector. This will prevent the relegation of the plasmid. Incubate at 37°C for 30 min.\nPurify the linearized plasmid. Run the digestion mix in a 1% agarose gel and purify the linearized vector from the gel by cutting the corresponding DNA band under the UV light and using a DNA purification system (NucleoSpin Gel and PCR Clean-up) according to manufacturer’s instructions (https://www.mn-net.com/media/pdf/f0/ee/cf/SP-NucleoSpin-Gel-and-PCR-Clean-up-vacuum-processing.pdf[href=https://www.mn-net.com/media/pdf/f0/ee/cf/SP-NucleoSpin-Gel-and-PCR-Clean-up-vacuum-processing.pdf)]).\nInsert purification. Purify the products of the cloning PCR using the most suitable method in function of the number of samples. (e.g., QIAquick 96 PCR Purification Kit)",
    "Pause Point: Purified PCR products can be stored at 4°C for several days or at −20°C for years.\nSequence and Ligation-Independent Cloning (SLIC)\nPrepare the following ligation mix on ice.\ntable:files/protocols_protocol_522_17.csv\nMix 8.5 μL of ligation mix with 1/10 of the final volume of purified PCR product in a new 96-well PCR plate on ice.\nCritical: The reaction must be prepared on ice to prevent the premature exonuclease activity of T4 polymerase.\nIncubate the plates for 2.5 min at 25°C in thermocycler.\nCritical: The incubation time has been optimized to generate overhangs of the appropriate length to ensure efficient SLIC.\nImmediately place the plate on ice for at least 10 min to stop the reaction.\nPause Point: Plates can be stored at 4°C for several days.\nTransformation.\nThaw chemically competent DH5α cells on ice. Pipette 30 μL of competent cells into individual wells of a new 96-well plate.\nWhile on ice add 4 μL of the ligation reaction to the competent cells, making sure the cells and DNA are in contact. Do not mix. Incubate on ice for 5 min.\nProceed to heat shock the bacteria at 42°C for 40 s in a thermocycler.\nImmediately transfer the plate to ice and incubate for at least 1 min.\nAdd 40 μL of LB medium. Place the plate on a shaker at a 45° angle and incubate at 210 rpm and 37°C for 40 min.\nStreak transformed cells on prewarmed LB-antibiotic agar plates.\nIncubate LB-antibiotic agar plates over night at 37°C.\nPause Point: LB plates can be stored at 4°C for several days.\nScreening of bacteria colonies and sequencing\nTiming: 1 day",
    "Critical: Use sterile filter pipette tips for all reactions. All surfaces should be sprayed with DNA/RNAse away. Resuspend lyophilized primers at 50 μM in RNase free water. Prepare a working solution mix by mixing equal volumes of each primer.\nScreen bacterial colonies by PCR using the 5′Ab sense forward primer and the corresponding IgH and IgK reverse primers used in PCR 2.\nPrepare the colony PCR mixes.\ntable:files/protocols_protocol_522_18.csv\nPrimers (Table 2[href=https://www.wicell.org#tbl2]):\n5′ F Primer: 5′ Ab sense\n3′ R Primer: Reverse IgH or IgK primers from PCR 2\nAdd 25 μL/well of Colony PCR mix in a new 96-well PCR plate.\nUsing sterile pipette tips, pick individual bacterial colonies and introduce the tips in individual wells of a 96-well plate containing the colony PCR mix. It is recommended to pick 3 colonies per ligation reaction. Leave the tips inside the PCR mix until the next step.\nPrepare a bacterial stock for each reaction by streaking each tip from the colony PCR plate on a LB-antibiotic agar plate. It is suggested to use a numbered grid to organize the bacteria stock on the agar plate.\nIncubate LB-antibiotic agar plates at 37°C overnight (12–16 h).\nRun the colony PCR plate in a thermocycler following the program:\ntable:files/protocols_protocol_522_19.csv\nLoad 5 μL of Colony PCR product of each well in a 2% agarose gel. Run the gel at 140 V for 20 min. The expected product is ~500 bp for the heavy chain and ~450 bp for the light chain.\nSequence the colony PCR products by Sanger sequencing using the 5′Ab sense primer\nPause Point: LB–ampicillin agar and colony PCR plates can be stored at 4°C for several days.\nAnalyze the sequences of the Colony PCR products to identify correct sequences\nAntibody DNA preparation and transfection\nTiming: 8 days",
    "DNA preparation: Grow individual bacterial cultures carrying the heavy and light chain plasmids in LB media with antibiotic (e.g., ampicillin 0.1 mg/mL) at 37°C and 220 rpm, overnight (12–16 h). Purify plasmid DNA from the bacteria cultures using the preferred commercial DNA isolation system (NucleoBond Xtra Maxi) and follow the manufacturer’s instructions (https://www.mn-net.com/media/pdf/ed/82/0f/Instruction-NucleoBond-Xtra.pdf[href=https://www.mn-net.com/media/pdf/ed/82/0f/Instruction-NucleoBond-Xtra.pdf)]). Alternatively, the heavy and light chain cultures from a paired antibody can be mixed 50:50 and processed together resulting in a mixed preparation of heavy and light chain plasmid DNAs.\nTransfection of HEK293-6E cells:\nCritical: Transfections should be done under a laminar flow hood. The cells used for antibody production are HEK293-6E cells. They grow in suspension in FreeStyle 293 expression medium supplemented with penicillin and streptomycin (10 000 U/mL).\nUse HEK293-6E cell cultures in the range of 8.0 × 10E5 to 1.2 × 10E6 cells per mL for transfection.\nUse 50 mL of cell culture in a 125 mL Erlenmeyer flask:\nMix 25 μg of heavy chain DNA with 25 μg of light chain DNA or alternatively 50 μg of pre-combined heavy and light chain DNA and bring to a total of 2.3 mL with PBS 1×. Vortex.\nAdd 170 μL of 0.045% (wt/vol) polyethylenimine (PEI 0.34% of cell culture volume to be transfected). Vortex the mixture for at least 15 s.\nAdd the mixture to 50 mL of the HEK293-6E cell culture.\nIncubate for 5–10 days at 130 rpm, 37°C, 95% humidity and 8.0% CO2\nFab purification\nTiming: 2 days\nAfter 5–10 d, transfer the transfected HEK293-6E cell cultures to 50 mL tubes and centrifuge at 5,000 × g for 30 min at 4°C. Filter the supernatant using a 0.22-μm membrane filter to eliminate debris.",
    "Pause Point: The supernatant can be kept at 4°C for several days. For longer times, it is recommended to add Azide (0.02%–0.05%) to prevent bacterial growth.\nPurify Fabs by using Ni-beads according to the manufacturer’s instructions (https://www.sigmaaldrich.com/catalog/product/sigma/ge17531806?lang=en&region=US[href=https://www.sigmaaldrich.com/catalog/product/sigma/ge17531806?lang=en&region=US)]). The Fab present in the culture supernatant are purified with Ni Sepharose beads because they are histidine-tagged. Ni-beads are recommended for high-resolution purification of histidine-tagged proteins, providing sharp peaks and concentrated eluate.\nTo activate the Ni-beads and remove the ethanol-based storage buffer: add 500 μL of beads in a poly-prep chromatography column. Wash by flowing through the column 5 mL of distilled water. Add 1 mL of 20 mM Imidazole buffer (20 mM Imidazol, 20 mM Tris pH 7.5, 300 mM NaCl in water) and let go through by gravity. Add the end cap to the column and resuspend the beads with 500 μL of 20 mM Imidazole buffer, then transfer the beads to a new tube.\nAdd 200 μL of beads to 50 mL of cell supernatant containing the Fabs, and incubate the mixture overnight (12–16 h) at 4°C in a spinning wheel.\nEquilibrate poly-prep chromatography columns with 5 mL of PBS 1×.\nCentrifuge the supernatants for 10 min at 300 × g and 4°C to pellet the beads. Carefully decant 2/3 of the supernatant, and pour the remaining supernatant containing the beads into the column. Let pass through the column by gravity.\nWash one time with 1 mL of 20 mM Imidazole buffer followed by one time with 30 mM Imidazole buffer (30 mM Imidazol, 20 mM Tris pH 7.5, 300 mM NaCl in water).\nElute in 1.5 mL Eppendorf tubes using 600 μL of 250 mM Imidazole buffer (250 mM Imidazol, 20 mM Tris pH 7.5, 300 mM NaCl in water).",
    "Depending on the subsequent use, it will be recommended to do buffer exchange with PBS 1× using 10K centrifugal filters according to the manufacturer’s instructions. (https://www.emdmillipore.com/US/en/product/Amicon-Ultra-4-Centrifugal-Filter-Unit,MM_NF-UFC801024?ReferrerURL=https%3A%2F%2Fwww.google.fr%2F&bd=1[href=https://www.emdmillipore.com/US/en/product/Amicon-Ultra-4-Centrifugal-Filter-Unit,MM_NF-UFC801024?ReferrerURL=https%3A%2F%2Fwww.google.fr%2F&bd=1])\nThe Fab productivity is determined by measurement with nanodrop and PAGE analysis.\nPause Point: Fabs can be stored at 4°C for several years."
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Protein Expression And Purification",
    "Cell Isolation",
    "Molecular Biology",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}