{
  "id": 1721,
  "origin_website": "Cell",
  "title": "Cell-specific mitochondria affinity purification (CS-MAP) from Caenorhabditis elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAnimal harvesting and cleaning\nTiming: ∼20 min\nSynchronized adult animals are harvested and cleared of E. coli OP50 before being homogenized.\nHarvest animals (see Experimental models: Organisms/strains of the key resources table[href=https://www.wicell.org#key-resources-table] for strains to use: myo-3/eft-3/ges-1/rgef-1/dpy-7p::tomm-20::mKate2::HA or N2 [as a control]) by washing them off the plate with two successive volumes of 7.5 mL of M9 buffer into a 15 mL Falcon conical tube using a pipettor. Washing animals off the plate with two successive volumes of M9 buffer ensures that the maximum numbers of animals are collected before beginning the procedure.\nNote: If multiple plates are being used per sample, wash the animals off one plate and onto the next with 7.5 mL of M9 buffer to maximise the collection of animals. Continue this process on each successive plate and then collect the animals in a 15 mL Falcon tube at the end. Repeat this sequential collection technique with another 7.5 mL of fresh M9 buffer and add to the Falcon tube.\nCentrifuge the tube at 200 × g for 2 min and replace the M9 supernatant with 14 mL of fresh M9 buffer.\nRepeat the previous washing step once more to remove as much OP50 from the sample as possible. See troubleshooting problem 1[href=https://www.wicell.org#sec7.1].\nOptional: Rotate the animals in 10 mL of M9 buffer in a 15 mL Falcon tube for 30 min at 30 RPM at 22°C–25°C to clear bacteria from the animals’ intestines. After rotating, pellet the animals by centrifugation at 200 × g for 2 min and wash the pellet once more with 14 mL of M9 buffer.",
    "Pellet the animals by centrifugation at 200 × g for 2 min and replace the M9 supernatant with 14 mL of ddH2O to remove traces of the M9 buffer and thus reduce the salinity of the solution.\nCentrifuge again at 200 × g and remove the ddH2O supernatant. Keep the sample on ice for less than 1 h.\nNote: Allow more than 20 min for the processing of multiple samples or multiple plates per sample.\nGenerating an enriched mitochondrial fraction\nTiming: 40 min\nThe sample is homogenized using a glass Dounce tissue grinder set with a low clearance pestle (usually called B clearance [P1235, Sigma-Aldrich]). A crude animal homogenate is then created by differential centrifugation.\nCritical: From this point onwards, all procedures must be performed on ice or at 4°C and all tubes must be cooled prior to use.\nSuspend the sample in 1.5 mL of cold Mitochondrial Isolation Buffer (MIB) with protease inhibitor cocktail.\nTransfer the sample with a 1 mL tip and a micropipette into a cold 7 mL Dounce tissue grinder tube (T0566, Sigma-Aldrich).\nNote: The animals tend to adhere to the plastic walls of the pipette tip. To minimize this, animals can be sequentially transferred into the Dounce tissue grinder tube in successive volumes of 300 μL. This reduces the surface area available for animals to adhere to and therefore reduces the animal loss during the transfer.\nCritical: Prewashing the pipette tip with a mild detergent might not be suitable, as subsequent traces of detergent can irremediably damage the released mitochondria (Gurtubay et al., 1980[href=https://www.wicell.org#bib6]).\nPerform 20 to 30 Dounce tissue grinder strokes.",
    "Dounce the animals by pushing the pestle towards the bottom of the Dounce reservoir in a motion parallel to the tube. Before reaching the bottom of the tube, twist the pestle, keeping the shaft of the pestle parallel to the tube walls, and then pull the pestle out of the buffer.\nRepeat for a total of 20–30 strokes. Strokes must be regularly spaced, relatively fast, and go in and out of the buffer for each individual stroke. A medium to strong resistance against the sample must be experienced during the douncing for the animals to be homogenized.\nCritical: This step is crucial and can determine the success of the entire procedure. Twenty to 30 strokes usually suffice to extract mitochondria from the major tissues tested (body wall muscle [BWM], intestine, hypodermis, neurons, and germline). Importantly, the glass Dounce tissue grinder set can erode over time and produce inconsistent homogenization results. To prevent both erosion of the Dounce set and cross-contamination between samples, the Dounce should be meticulously washed with demineralized water between each individual sample. After each experiment, the Dounce must be meticulously washed with demineralized water and air-dried before storage. If results become inconsistent due to the wearing of the Dounce, consider using a new Dounce set.\nNote: During homogenization, a fraction of animals is broken into multiple fragments and mitochondria are released from cells into the MIB. A fraction of animals in the sample may still be alive but suffering from damage that is severe enough to release some of their mitochondria into the MIB. Over-douncing the sample may potentially fragment mitochondria and generate a large amount of cellular debris that is very difficult to clear during the purification steps described below.",
    "Critical: Homogenization is more efficient on animals synchronized at L4 larval stage to adulthood as early larval stages tend to be more resistant to douncing. For this reason, a synchronised population is preferred to achieve the best results.\nTransfer the homogenate into a 1.5 mL microcentrifuge tube.\nCritical: At this step, the homogenate should be gently mixed by pipetting a few times up and down with a volume of 300 μL using a 1 mL tip. Then, 300 μL (containing intact animals, animal fragments, mitochondria, and various debris) should be saved as Input 1 (also called whole animal homogenate). Input 1 should be centrifuged at 12,000 × g for 10 min and the supernatant discarded before being frozen (not necessarily flash frozen) at -80°C for later processing (for PCR, qPCR, or Western blot applications - see expected outcomes[href=https://www.wicell.org#expected-outcomes] for processing information). For metabolic assays, Input 1 should be kept on ice and processed directly at the end of the CS-MAP procedure. In principle, frozen tissues shouldn’t be used for physiological assays.\nAfter separating 300 μL of the homogenate for use as Input 1, remove intact animals, animal fragments, and large pieces of cellular debris from the remaining 1.2 mL of the animal homogenate from step 9 by a low-speed centrifugation at 200 × g for 5 min.\nTransfer the supernatant to a new 1.5 mL tube.\nRefine the sample further with a second centrifugation at 800 × g for 10 min and transfer the supernatant to a new 1.5 mL tube. The supernatant is now a crude animal homogenate.\nNote: A small aliquot of the crude animal homogenate can potentially be saved as Input 2.\nPellet the enriched mitochondrial fraction within the crude animal homogenate by centrifugation at 12,000 × g for 10 min.",
    "Discard the supernatant and quickly add 20 μL of MIB to the enriched mitochondrial fraction. See troubleshooting problem 2[href=https://www.wicell.org#sec7.3].\nResuspend the enriched mitochondrial fraction in MIB by vigorously pipetting the solution up and down for 1 min using a P20 micropipette. As mitochondria can agglutinate, this will help ensure uniform distribution of mitochondria throughout the MIB.\nCritical: At this point, the quality of the enriched mitochondrial fraction should be assessed using a fluorescence microscope. This is performed by observing the presence of mitochondria labelled by the red fluorophore mKate2. Pipette 1 μL of the sample from step 14 onto a glass slide and cover with a coverslip. Observe the sample under a fluorescent compound microscope by using a 40× oil objective (EC Plan-Neofluar 40×/1.30 Oil DIC M27) and selecting the red channel (excitation wavelength 587 nm, emission wavelength 610 nm, light source intensity 50%, exposure time 3 s, binning mode 2.2). The first time the protocol is performed for a given cell-type, the 587 nm red channel of the microscope should be calibrated to background fluorescence levels using wild-type (N2) animals that have undergone the same CS-MAP procedure. If the appropriate microscope settings are not used (e.g., excessively long exposure time), irrelevant background dots may be misidentified as mKate2-positive mitochondria. A typical observation of an enriched mitochondrial fraction obtained from N2 animals and animals harbouring mKate2-labeled mitochondria is shown in Figures 6[href=https://www.wicell.org#fig6]A and 6B (see expected outcomes[href=https://www.wicell.org#expected-outcomes]). The quantity of mKate2-labelled mitochondria can vary from one strain to another, depending on the cell-type labeled by the fluorophore. If no fluorescent mitochondria are observed, the procedure has not worked properly and should be restarted.",
    "Note: Wild-type (N2) animals generally don’t produce particles that exhibit autofluorescence at a brightness comparable to mKate2-labeled mitochondria. Only some rare red particles can be observed but can easily be discriminated from mKate2-labelled mitochondria by their aberrant shape or brightness.\nCritical: Mitochondria, various organelles, vesicular fragments, and other debris of the enriched mitochondrial fraction tend to clump together. Pipetting the sample up and down with a P20 micropipette for 1 min helps to disrupt these clumps. The enriched mitochondrial fractions shown in Figure 6[href=https://www.wicell.org#fig6]B (see expected outcomes[href=https://www.wicell.org#expected-outcomes]) are relatively free from major clumps with red-labeled mitochondria uniformly distributed throughout the image and are thus suitable for subsequent steps. If clumps are observable, pipette the sample up and down with a P20 micropipette an extra 20 times and observe 0.5 μL of the sample under the microscope. Repeat again if required.\nBinding of anti-HA magnetic beads to HA-taggedmitochondria\nTiming: 1 h 15 min\nThe enriched mitochondrial fraction is incubated with anti-HA magnetic beads, which selectively bind tissue-specific HA-taggedmitochondria.\nCritical: To be performed on ice or at 4°C.\nAdd 400 μL of cold Phosphate EDTA BSA buffer (PEB) with protease inhibitor cocktail to the 20 μL of MIB-suspended enriched mitochondrial fraction and homogenize the sample by vigorously pipetting up and down 10 times using a P200 micropipette set to 200 μL. Transfer the contents into a 0.6 mL round-bottom microtube.\nOptional: Consider pipetting up and down more times if clumps are still present in the sample. This step is empirical, as it can be difficult to spot clumps of mitochondria under the microscope once they are diluted in 400 μL of PEB.\nNote: Performing the next incubation step in a smaller 0.6 mL round-bottom microtube minimizes the contact of mitochondria with the plastic walls of the tube, thereby reducing their loss.",
    "Carefully wash 100 μg of anti-HA magnetic beads (88837, Pierce) in a 1.5 mL microcentrifuge tube by adding 1 mL of cold PEB with protease inhibitor cocktail and flicking gently to mix.\nPlace the microcentrifuge tube into a standard magnetic rack (SureBeads, Bio-Rad or equivalent) and leave for 1–2 min until the magnetic beads have assembled against the magnet.\nCarefully remove clear PEB before removing the tube from the magnetic rack and repeating the washing process at least 6 times.\nResuspend the clean anti-HA magnetic beads in 100 μL of PEB with protease inhibitor cocktail.\nCritical: Commercial anti-HA magnetic beads are usually stored in 0.05% Tween-20 detergent and 0.05% NaN3. Trace amounts of these reagents may affect mitochondrial physiology or lyse the organelles. Therefore, careful washing of the anti-HA magnetic beads prior to use is critical.\nNote: 100 μg of anti-HA magnetic beads are used per sample. If the experiment involves multiple samples, calculate the μg of beads required in total and wash together. To obtain the greater quantity of mitochondria required for protein extraction, up to 200 μg of anti-HA magnetic beads have been used per sample.\nAdd the washed 100 μg of anti-HA magnetic beads (in 100 μL of PEB with protease inhibitor cocktail) to the 400 μL sample from step 15.\nWrap Parafilm around the closed lid of the tube to prevent it from opening and incubate at 4°C under gentle rotation, using an Intelli-Mixer RM-2 (ELMI) on program F1 at 8 RPM for 1 h.\nNote: Incubation can be increased to 2 h with similar results.\nImmunomagnetic purification of mitochondria\nTiming: 30 min\nMitochondria bound by immunomagnetic beads are column-purified on the homemade CS-MAP setup (Figure 4[href=https://www.wicell.org#fig4]). The procedure is shown step-by-step in Methods video S1[href=https://www.wicell.org#mmc1]: Purification of mitochondria.",
    "Carefully pipette up the sample with a 1 mL tip and a P1000 micropipette.\nPosition the tip – still connected to the micropipette – into the magnetic field of the magnet (adjacent to one of the flat surfaces of the magnet) on the PCR rack of the homemade CS-MAP device (see Figure 4[href=https://www.wicell.org#fig4]B and 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1178-Fig5.jpg\nFigure 5. Pellet of immunomagnetic mitochondria\nMitochondria attached to magnetic beads aggregate on the wall of the tip closest to the magnet after 1 min. White arrow: magnetic bead pellet.\nCritical: Do not release the micropipette from the tip until the magnetic beads have formed a visible pellet on the wall of the tip closest to the magnet. It usually takes 1 min (Figure 5[href=https://www.wicell.org#fig5]).\nOnce a visible pellet of magnetic beads is visible on the wall of the tip (after 1 min), carefully remove the micropipette from the tip, without disturbing the tip or magnet. When the micropipette is released, the supernatant will drain into the waste bucket.\nUsing a pipettor and a 25 mL plastic serological pipette, aspirate 25 mL of cold PEB.\nNote: PEB used for washing does not require the protease inhibitor cocktail.\nPlug the tip of the 25 mL pipette into the top of the 1 mL tip and carefully unplug the pipette from the pipettor without disrupting the 1 mL tip or magnet. Allow the PEB to flow through the 1 mL tip and into the waste bucket. This step washes the magnetic beads that remain held in place by the magnet.",
    "Note: If an air bubble forms in the 1 mL tip preventing uniform washing, reattach the pipettor to the 25 mL pipette and very briefly re-aspire less than 1 ml of liquid. This causes a slight backflow in liquid that refills the 1 ml tip and can clear the bubble. Once the bubble is removed, unplug the pipette from the pipettor once again.\nOnce all the PEB has passed through the column, remove the 25 mL pipette and discard.\nNext, remove the 1 mL tip from the magnetic field, place it into a 1.5 mL microcentrifuge tube, and elute the bead pellet by adding 1 mL of PEB into the tip.\nReconnect the P1000 micropipette to the tip containing the beads and pipette up and down a few times to resuspend the beads (see Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: For a low stringency wash, only 1 wash with 25 mL of PEB is sufficient, so directly proceed to step 28. A low stringency wash improves the yield of immunomagnetic-purified mitochondria at the expense of purity. For a higher stringency wash, proceed to step 24. A high stringency wash involves a second wash with 25 mL of PEB and improves the purity of immunomagnetic-purified mitochondria at the expense of yield. A low stringency wash is preferred when protein and metabolic analyses will be performed but a high stringency wash is required for analysis of nucleic acids.\nUsing a standard magnetic rack (SureBeads, Bio-Rad, or equivalent), pellet the magnetic beads and replace the PEB used for the elution with 1 mL of fresh PEB.\nVortex the sample 3 times for 2 s each.\nPlace the tube under gentle rotation for 10 min at 4°C.\nPerform a second wash with 25 mL of cold PEB on the CS-MAP homemade setup (steps 18 to 23).",
    "Remove PEB using a standard magnetic rack and resuspend the immunomagnetic-purified (IPed) mitochondria in 20 μL of cold MIB with protease inhibitor cocktail. The sample of immunomagnetic-purified (IPed) mitochondria is ready to use and must be kept on ice. See troubleshooting problem 3[href=https://www.wicell.org#sec7.5] and problem 4[href=https://www.wicell.org#sec7.7] for potential issues.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Purification of mitochondria, related to step 20\nStep 1) A 1 mL micropipette tip containing the immunomagnetic mitochondria is positioned next to the flat surface of the magnet. Step 2) the immunomagnetic mitochondria are trapped by the magnet to the wall of the 1 mL micropipette tip closest to the magnet (1 min waiting). Step 3) A 25 mL pipette containing PEB is plugged into the top of the 1 mL micropipette tip to create a transitory washing column and the sample is washed using gravity flow. Step 4) Purified immunomagnetic mitochondria are collected with PEB and concentrated into a reduced volume of MIB."
  ],
  "subjectAreas": [
    "Cell Separation/Fractionation",
    "Protein Expression And Purification",
    "Metabolism",
    "Protein Biochemistry",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}