{
  "id": 8042,
  "origin_website": "Bio",
  "title": "Detailed Protocol to Perform Direct PCR Using Filamentous Fungal Biomass—Tips and Considerations",
  "procedures": [
    "Preparation of fungal culture Transfer an agar plug containing fungal mycelia onto a PDA plate.Incubate the agar plate for five days at 25 °C.Direct PCR amplification For a 20 μL reaction volume, add 0.5 μL of each primer (20 μM) to AccuPower® Taq PCR Premix tubes.To dissolve the vacuum-dried premixture, add 19 μL of nuclease-free water into the PCR tubes.Gently scratch the fungal culture using a pipette tip to collect a small amount of mycelium (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4889/bioprotoc-13-21-4889-g001.jpgFigure 1. Mycelium collection for direct PCR. Aerial hyphae of Fusarium graminearum were collected using a pipette and 10 μL pipette tips. The distal part of the pipette tip is magnified for clarity. Scale bar = 500 μm.Transfer the collected mycelium to the reaction mixture. Vigorously vortex the PCR tubes and then briefly centrifuge to bring down the contents.For the heat shock reaction, place the PCR tubes in a thermal cycler and set the program (3 min at 95 °C, then cool down to 25 °C).After the program, immediately transfer the PCR tubes to an ice bath for 1 min.Vortex the samples vigorously for 15 s and then chill them on ice for an additional 15 s.Repeat step B7 two more times.Centrifuge the reaction mixture briefly to collect all contents at the bottom and then return the PCR tubes to the thermal cycler.Set the thermal cycler with the following program:Initial denaturation at 95 °C for 1 min.Denaturation at 95 °C for 30 s.Annealing at 56 °C (adjust temperature based on primer specifications) for 1 min.Extension at 72 °C (adjust time based on the expected amplicon size) for 1 min.Repeat steps b–d for 40 cycles (based on our results, 40 cycles were more optimal than 30).Final extension at 72 °C for 3 min.Hold at 4 °C for 5 min.Gel electrophoresis Gel preparation:Weigh 2.",
    "25 g of agarose powder.Dissolve agarose powder in 150 mL of 1× TAE buffer (see Recipes) completely using a microwave (avoid overboiling) to make a 1.5 % agarose gel (w/v).Add 7.5 μL of RedSafe nucleic acid staining solution and mix thoroughly.Pour the dissolved agarose solution into a gel tray with a well comb.Allow the poured gel to solidify fully at room temperature for 20–30 min.Loading samples and running:Add 6× loading buffer to each PCR product.Place the solidified agarose gel into the electrophoresis unit and submerge it entirely in 1× TAE buffer.Carefully load your samples and 100 bp Plus DNA ladder into the gel wells.Operate PowerPacTM basic power supply at 100–120 V for 30–40 min (adjust the voltage and running time depending on gel concentration and PCR product size).After gel running, carefully remove the gel from the unit and place it under a UV light device to visualize DNA fragments.Purification and sequencing To purify the DNA samples, use MEGAquick-spinTM Plus Total Fragment DNA Purification kit and follow the protocol provided with the kit.Transfer 50 μL of your PCR product into a 1.5 mL microcentrifuge tube and add 250 μL of agarose gel lysis buffer (included in the DNA purification kit). Mix well by vortexing.Insert a spin column in a collection tube.Transfer the sample mixture to the spin column and centrifuge at 11,000× g for 30 s.Discard the flowthrough.Add 750 μL of the ethanol-added wash buffer solution (included in the kit) to the spin column and then centrifuge at 11,000× g for 30 s.Discard the flowthrough.Centrifuge again at 13,500× g for 3 min to dry the column matrix.Place the spin column in a new 1.5 mL microcentrifuge tube.Add 20–40 μL of elution buffer (included in the kit) to the membrane center of the spin column and wait for 3 min.",
    "Centrifuge at 13,500× g for 1 min to elute the DNA.Measure DNA concentration using a NanoDrop 2000 and submit the samples to a sequencing service center."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}