{
  "id": 19490,
  "origin_website": "Jove",
  "title": "Quantification of Immunostained Caspase-9 in Retinal Tissue",
  "procedures": [
    "This protocol follows the Association for Research in Vision and Ophthalmology (ARVO) statement for the use of animals in ophthalmic and vision research. Rodent experiments were approved and monitored by the Institutional Animal Care and Use Committee (IACUC) of Columbia University.\n1. Preparation of retinal tissue and cryosectioning\nEuthanize the animals by administration of intraperitoneal anesthesia (ketamine (80-100 mg/kg) and xylazine (5-10 mg/kg)), and perfuse the mice subjected to RVO (see8 for details) with 4% paraformaldehyde (PFA) using a peristaltic pump.\n\tNOTE: Toe-pinch the animal to confirm depth of anesthesia before proceeding with euthanization and perfusion. Details about perfusion can be found in16.\nHarvest the eyes by careful enucleation using forceps and put the globe in 1 mL of 4% PFA. Leave the eyes overnight at 4 °C. Wash the eyes three times for 10 min, adding 1 mL of 1x PBS and placing them in the shaker.\nImmerse the eyes in 1 mL of 30% sucrose for 3 days, until they settle to the bottom of tube, indicating absorption of the sucrose.\nFill the eyes with optimal cutting temperature compound using a 30 G syringe, until the eye has a rounded appearance (approximately 50 µL).\nEmbed the eyes in a cryomold with optimal cutting temperature compound until the eyes are covered and freeze at -80 °C until ready to cryosection.\nSection embedded the eyes at 20 µm onto glass slides using a cryostat.\n\t\nRemove the optimal cutting temperature compound block from the cryomold.\nPlace it on the cryostat chuck by adding optimal cutting temperature compound and placing the block on the chuck. Leave it inside the cryostat until it freezes.\nProceed to cut the block at 20 µm until the retinal tissue is seen.",
    "NOTE: This can be confirmed with a light microscope at 30x magnification (3x objective, 10x eyepieces). Tissues can be distinguished from the OCT media by color and shape.\nCollect the retinal tissue in microscope slides in a series of four sections per slide.\n\t\tNOTE: See Figure 1A for suggested placing of retinal sections.\nLabel the slides with an ID that de-identifies the treatment and genotype.\nStore the slides at -20 °C until staining.\n2. Immunohistochemistry\nNOTE: Use fixed cryopreserved tissue for immunohistochemistry to maintain cell morphology. Pick sections that are at the level of the optical coherence tomography (OCT) images acquired in vivo7. Use the first two series of slides collected from the cryostat or sections from 150 µm into the retinal tissue.\nPlace the slides in a dark and humid slide chamber.\nPermeabilization and blocking: Wash the retinal cross-sections with 300 µL of 1x PBS for 5 min to remove the OCT and discard after.\nPermeabilize the tissue by adding 300 µL of 1x PBS with 0.1% Triton X-100 for 2 h at room temperature (RT) and discard after.\nBlock the tissue by adding 300 µL of blocking buffer (10% Normal Goat Serum (NGS), 1% Bovine Serum Albumin (BSA) in 1x PBS, filtered) and leave overnight at 4 °C.\nPrimary antibodies: Dilute primary antibodies in blocking buffer. Primary antibodies used include anti-cl-caspase-9 at 1:800, anti-CD31 at 1:50, and anti-caspase-7-488 (direct labeled antibody) at 1:150.\n\tNOTE: Follow manufacturer's recommendation for the appropriate dilution of primary antibodies.\n\t\nPour the blocking buffer off sections and apply 100 µL of the primary antibody cocktail to the retinal slides.\nIncubate the cross-sections overnight at 4 °C.\nWash the sections four times for 5 min with 300 µL of 1x PBS.",
    "NOTE: If the tissue sections are very fragile, washes should be removed using capillary action by applying a tissue to the corner of the slide to avoid displacing the retinal sections.\nTo avoid cross-labeling of primary antibodies raised in the same host species, complete the staining with secondary antibodies prior to applying the directly labeled antibodies.\nSecondary antibodies: Dilute the secondary antibodies in blocking buffer at a concentration of 0.1%. For example, to detect anti-cl-caspase-9, an antibody raised in rabbit, use goat-anti-rabbit-568 secondary.\n\t\nApply 200 µL of the secondary antibody cocktail to the retinas.\nIncubate the tissue for 2 h at RT.\nWash the sections four times for 5 min with 300 µL of 1x PBS.\nStain the nuclei for 5 min with 300 µL of DAPI at a dilution of 0.02%.\nWash once for 5 min with 300 µL of 1x PBS.\nPlace a coverslip on the retinal sections using 500 µL of fluoromount-G media, which preserves the fluorescent signal, and carefully place the coverslip on the top of the slide, avoiding bubbles.\n3. Confocal imaging\nAcquire images of the stained sections with confocal microscopy.\n\t\nTurn on the confocal microscope.\nPlace the slide on the stage.\nAdjust the focus to see the retinal section clearly.\n\t\tNOTE: Take at least four images per section and image four sections per retina. See the Retinal imaging schematic for suggested imaging areas (Figure 1B, C).\nImage caspase, vascular, and nuclear staining using a confocal microscope that has Z-stack acquisition, using a 20x or 40x objective.\n\tNOTE: The imaging parameters and software setup should be constant for all imaging in an experiment. The 20x objective provides an overview of the retinal layers, which are well-defined by the nuclear staining. The 40x objective provides more cellular detail.",
    "Set appropriate exposure and laser intensity times per channel by clicking acquire settings.\nSet the Z-stack to visualize the whole section by clicking Z-series and set up and down parameters to cover the depth of the tissue.\nSave the images following the masked ID assigned during cryosectioning.\n4. Quantification of caspase levels\nDrag image files of 405, 470, 555, and 640 channels to FIJI's console.\nClick Image > Color > Merge Channels.\nAssign colors to the files as follows: red to 555, green to 470, gray to 405, cyan to 640.\nCompress the Z-stack by clicking Image > Stack > Z Project.\nClick Projection Type: Max Intensity.\nOpen the Channels Interface by clicking Image > Color Channels Tool.\nOpen the Brightness and Contrast interface.\nSelect parameters per channel.\n\t\nGo to Channels and select one channel.\nPut the cursor on top of the caspase expressed cell and annotate the pixel value.\nPut the cursor on top of the background and annotate the pixel value.\nTest parameters\n\t\nGo to the Brightness and Contrast interface.\nClick Select.\nPlug in the minimum displayed value (annotated pixel value of the caspase expressed cell).\nPlug in the maximum displayed value (annotated pixel value of the background).\nClick Ok.\nRepeat steps 4.8-4.9 for all channels.\nTest the parameters by choosing random images from blinded tissue.\n\tNOTE: Edit brightness and contrast parameters only if the background value is not adequate for other images.\nOnce the parameters are set, open the image files and compress the Z-stack.\nAdd in the brightness and contrast parameters for the caspase channel and the isolectin, vascular marker channel.\nUse the point tool to quantify the number of vascular positive areas using colocalization of the vascular marker with caspase expression as the readout of positive areas.",
    "Repeat step 4.14 but using Hoechst as the marker of neuronal positive areas.\nAnnotate the values on a spreadsheet per image.\nAverage the values by section.\nAverage the section values-this will be the readout per eye.\n5. Genetic confirmation of the relevance of the endothelial cell caspase-9\nUse retinas obtained from the Casp9FL/FL-VECad-CreERT2 mice that were subjected to RVO7.\nImmunostain the retinas for caspase-9 (the deleted caspase), caspase-7 (a down-stream effector caspase), vascular markers, and DAPI as described above in section 2.\nImage and quantify as described above in sections 3 and 4.\n6. Targeting caspase-9 in RVO\nObtain eyes from the mice subjected to RVO followed by application of the caspase-9 inhibitor Pen1-XBir3 topically to eyes as in7.\nImmunostain the retinas for caspase-7 (a down-stream effector caspase), vascular markers, and DAPI as described above in section 2.\nImage and quantify as described above in sections 3 and 4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}