{
  "id": 17652,
  "origin_website": "Jove",
  "title": "Real-Time Monitoring of Neurocritical Patients with Diffuse Optical Spectroscopies",
  "procedures": [
    "The protocol was approved by the local committee of the University of Campinas (protocol number 56602516.2.0000.5404). Written informed consent was obtained from the patient or a legal representative prior to the measurements. We monitored patients that were admitted to the Clinics Hospital at the University of Campinas with a diagnosis of either ischemic stroke or a subarachnoid hemorrhage affecting the anterior circulation. Patients with ischemic strokes affecting the posterior circulation, patients with decompressive craniectomies due to elevated intracranial pressure and patients with other neurodegenerative diseases (dementia, Parkinson's or any other disease that can be associated with cortical atrophy) were excluded from the study protocol.\n1. Preparations before moving the system to the ICU\nConnect all the fibers to the relevant lasers and detectors, and make sure they are properly attached to the optical probe (Figure 1B).\nCheck that the optical probe is covered with a black cloth to avoid the lasers shining in the room.\nTurn the system power switch to the ‘ON’ position. After powering the system, wait 30s and then turn the DCS laser key switch to the ‘ON’ position. The FD-DOS lasers are automatically turned on when the system is powered.\nWhile the system is being prepared, obtain consent from either the participant or a legal representative. After obtaining consent, bring the cart to the patient’s room.\n\tNOTE: Since the hybrid system has a built-in battery that lasts up to 45 min, it does not need to be turned off during transport.\n2. Calibration and gain settings of the DOS system\nUpon arrival at the ICU, turn off the DCS laser by switching the key to the ‘OFF’ position.\nStarting with the solid phantom marked ‘Calibrate’, run the calibration process on the FD-DOS software (BOXY, ISS) by following the steps below.",
    "On the ‘File’ menu, load the appropriate settings file for the probe being used by clicking on the ‘Load settings file’ option.\nPlace the probe on the curved side of the phantom, ensuring a good contact with the surface and then optimize the PMT bias voltage by clicking on the ‘Optimize All Detectors’ button in the FD-DOS software.\nRun the calibration for multiple source-detector separations by clicking on the option ‘Calc. Waveform Calib. Values for Optical Props. and Multiple Distances’ from the ‘Calibrate’ menu.\nOpen the ‘User-defined Calculations’ option from the ‘Text-Mon’ menu to check that the measured optical properties match the prespecified values (written in the solid phantom), and that the fitting R2 is close to one.\nRepeat the steps above (except step 2.2.3) to measure the optical properties of the phantom marked as ‘Check’ to ensure the calibration was adequate. The measured optical properties should match, within 10%, the values specified in the phantoms.\n\tCAUTION: Make sure to turn off PMTs (by clicking on the ‘All Detectors OFF’ button) every time the probe is moved to avoid damaging PMTs due to direct illumination from ambient light.\nIf the calibration is not adequate, re-run the calibration process (steps 2.2 and 2.3). Ensuring a good calibration of the FD-DOS system is essential to the validity of the FD-DOS measurements.\n3. Preparation of the participant at the bedside\nUse sanitizing wipes to clean both the probe and patient forehead.\nPlace the double-sided tape on the probe (Figure 1B), ensuring the tape is not in direct contact with the optical fiber tips.\nPlace a laser safety googles on the subject.",
    "Place the probes over the region-of-interest (ROI) and wrap the elastic straps around the subject’s head. Although not strictly necessary for FD-DOS and DCS, it is advisable to cover the optical probe with a black cloth or black bandage to reduce noise due to ambient light.\n\tNOTE: It is important to assure that the elastic strap is neither too tight nor too loose. If the strap is too tight it may cause significant discomfort to the patient, and if the strap is too loose it may lead to poor data quality as the double-sided tape is not strong enough to keep the probes in place.\nAfter the probe is properly secured to the patient's forehead, turn on the DCS laser by switching the key to the ‘ON’ position.\n\tCAUTION: The DCS system uses a Class 3B laser which is hazardous for eye exposure. It is very important to only turn on the lasers when the probe is properly attached to the patient’s forehead.\n4. Data quality assessment\nBefore starting to acquire data with the GUI, write the DCS source-detector separations in the ‘Settings’ tab of the GUI.\n\tNOTE: The DCS system does not require a calibration step, but the proper input of the source-detector separations is necessary for the real-time analysis (see Supplementary Material for details).\nStart the acquisition software by pressing the ‘Start’ button in the GUI and check the DOS signal in the FD-DOS software:\n\t\nClick on the ‘Optimize All Detectors’ button in the FD-DOS software to optimize the PMT bias voltage.",
    "Check the optical properties and the R2 of the DOS fitting in the ‘User Defined Calculation’ option from the ‘Text-Mon’ menu. The R2 coefficient should be close to unity and, as a rule of thumb, the absorption coefficient of human patients should be within 0.05 and 0.2 cm-1, while the scattering coefficient should be within 6 and 13 cm-113.\nCheck the DCS signal in the ‘Correlation curves’ tab of the GUI.\n\t\nTurn on the DCS detectors by turning the switches to the ‘ON’ position.\nEnsure that each DCS detector is measuring an adequate light intensity. As a rule of thumb, more than 10 kHz is required.\nIf the measured intensity is higher than 800 kHz, use a neutral density filter to reduce the photon counts to avoid damaging the detectors. This is typically a problem for shorter (< 1 cm) source-detector separations.\n\t\tNOTE: Apart from potentially damaging the DCS detectors, photon counts higher than 800 kHz may also bring errors due to non-linear effects in the detector.\nCheck the autocorrelation curves to ensure a good skin coupling (see the Representative Results and Figure 2) and reposition the optical probe if necessary.\nIf the repositioning of the probe was necessary in the previous step, repeat Steps 4.2 and 4.3. These steps may need to be repeated multiple times.\n\t\tNOTE: The DCS and the FD-DOS detectors must be turned off each time the probe is moved. To turn the DCS detectors off, manually move the switches to the ‘OFF’ position. The FD-DOS detector is turned off by clicking the ‘All Detectors OFF’ button in the FD-DOS software.",
    "When a good contact between the probe and the skin is achieved, stop the data collection by clicking the ‘Stop’ button in the GUI. Then, set the experiment and patient identifiers in the ‘Folder’ textbox and write the ROI name in the ‘File name’ textbox.\nStart the data acquisition by pressing the ‘Start’ button in the GUI.\nCollect data in the first ROI for as long as required by the protocol. If necessary, move the probe to the other ROIs and repeat the measurement.\n\tNOTE: The monitoring period may vary depending on the study goals.\n5. Considerations for the experimenter during the measurement\nAfter starting the measurement, write in the ‘Experiment Info’ tab of the GUI the relevant patient information (e.g., type and location of the injury, drugs being administered, age, sex, etc.).\nEnsure that any relevant event that occurred during the monitoring period is marked by clicking the ‘Mark’ button on the GUI. After each mark, make sure to write the event description in the ‘Experiment Info’ tab of the GUI.\n6. Stop data collection\nStop the data collection by pressing the ‘Stop’ button in the GUI.\nStop the FD-DOS software by pressing the stop data acquisition and recording button represented as two red squares in the FD-DOS software.\nTurn off the DCS detectors by flipping the switches to the ‘OFF’ position and turn off the DCS laser by turning the key to the ‘OFF’ position.\nTurn off the PMTs of the FD-DOS module by clicking the ‘All Detectors OFF’ button.\nRemove the probe from the patient's head and remove the double-sided tape from the probe. Then, clean the probe with sanitizing wipes.",
    "Repeat the measurement of the optical properties of each solid phantom as soon as possible to ensure the calibration remained adequate throughout the monitoring session (see step 4.2.2).\n\tNOTE: Ideally, the calibration step should be done right after removing the optical probes from the patient's head (step 6.6). However, due to timing issues, in the examples presented in the next section this was done in the storage facility.\nClean the system and its accessories with sanitizing wipes.\nWheel the cart back to the storage room.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}