{
  "id": 19925,
  "origin_website": "Wiley",
  "title": "Optimization of Large-Scale Adeno-Associated Virus (AAV) Production",
  "procedures": [
    "Here, we describe our protocol for AAV production, which entails the use of AAVPro-293T cell culture, transfection, and cell lysis for AAV particle harvest. Specifically, this protocol encompasses the following major steps: (1) passaging of AAVPro-293T cells; (2) plating of AAVPro-293T cells into T-175 tissue culture (TC) flasks; (3) transfection of AAVPro-293T cells for recombinant AAV production; and (4) harvest of recombinant AAV particles from AAVPro-293T cells. By the end of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0001], cell lysates containing AAV should be ready for subsequent purification, which is described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0002].\nMaterials\nAAVPro-293T cells (one frozen vial of 1 ml of 8–10 × 106 AAVPro-293T cells; Takara, cat. no. 632273)\n70% (v/v) ethanol\nCulturing medium (see recipe), 37°C\nDulbecco's phosphate-buffered saline (DPBS), no calcium, no magnesium (1×; Gibco, cat. no. 14190250)\nTrypLE Express Enzyme (1×; Gibco, cat. no. 12605010)\n1× polyethyleneimine (PEI; diluted from 10× PEI, Polysciences, cat. no. 24765-100)\nDMEM/F12 (1:1; Gibco, cat. no. 11320033, or Cytiva, cat. no. SH30023.FS)\npAdDeltaF6 (AAV helper plasmid; Addgene, cat. no. 112867)\npAAV2/9n (rep/cap gene expression construct; Addgene, cat. no. 112865)\nrAAV plasmid (backbone vectors are available from Addgene)\nTransfection medium (see recipe)\nAAV lysis buffer (see recipe)\nDry ice\nMethanol\n37°C water bath\nSerological pipets, sterile (VWR or equivalent)\n50-ml conical centrifuge tubes (Corning or equivalent)\nCentrifuge with swinging-bucket rotor (Eppendorf or equivalent)\n150-mm TC dishes (Fisher, cat. no. FB012925, or equivalent)\nTC microscope (ECHO or equivalent)\nHemocytometer\n175-cm2 (T-175) TC flasks, vented cap (Corning, cat. no. 355001, or equivalent)\nVortex\nNOTE: Apart from centrifugation and microscopic visualization, ensure all cell culture steps are performed in a laminar flow hood (Labconco Purifier BSC Class II or equivalent). All solutions and equipment coming into contact with cells must be sterile, and proper sterile technique should be used accordingly.",
    "NOTE: All culture incubations are performed in a 37°C water-jacketed incubator with 5% CO2 (Thermo Scientific) unless otherwise specified.\nPassaging AAVPro-293T cells\n1. Thaw one frozen vial of 1 ml of 8–10 × 106 AAVPro-293T cells quickly in a 37°C water bath. Once thawed, spray vial with 70% ethanol before placing it in a laminar flow hood.\nIMPORTANT NOTE: Ensure that the vial cap is not submerged in the water to prevent contamination.\nThe cell number per vial is crucial in order for the subsequent steps to occur according to the schedule outlined in the Strategic Planning section (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001]). If a lower cell number is used, start this step earlier than what is outlined in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001].\nIf purchasing a new vial from a vendor, consider growing the cells according to vendor instructions and passaging until several 150-mm dishes are confluent. These cells can then be frozen, wherein one confluent 150-mm TC dish yields sufficient cells for two cryovials containing 8–10 × 106 AAVPro-293T cells each. We recommend passaging and freezing cells to build an adequate supply of frozen vials for future AAV preparations.\n2. Add 1 ml warm culturing medium dropwise to thawed cells in vial and then collect cells with a serological pipet and add, dropwise, to 3 ml culturing medium in a 50-ml conical centrifuge tube.\n3. Centrifuge 5 min at 1500 × g in a centrifuge with a swinging-bucket rotor.\n4. During centrifugation, add 10 ml culturing medium to one 150-mm TC dish.\n5. After centrifugation of the cells, aspirate the supernatant and resuspend the cell pellet in 5 ml culturing medium using a 5-ml serological pipet, resuspending gently but thoroughly by pipetting up and down 3 to 4 times.",
    "6. Add the 5 ml cells to the 150-mm TC dish dropwise. Rock 3 to 4 times and incubate at 37°C, 5% CO2 for 16 to 24 hr.\n7. Visually inspect cells under a TC microscope the next day to ensure that they are at least ∼70% confluent and then proceed to the next step. If they have not reached the required confluence, maintain them in the incubator until ∼70% confluency is reached (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/86ea0987-e8e5-4351-9cf9-916371b474c1/cpz1757-fig-0002-m.jpg</p>\nFigure 2\nRepresentative image of AAVPro-293T cell density 24 hr after thawing. A frozen vial of ∼10 × 106 AAVPro-293T cells were seeded onto one 150-mm TC dish. The image shows the confluency after 24 hr of incubation. The image shown is the maximal confluency needed for continued passaging. Ideally, cells should appear as shown in the image or 20% to 30% less confluent at minimum. Scale bar indicates 380 μm; magnification: 10×.\n8. Begin passaging cells by aspirating medium, adding 10 ml DPBS to the dish, rocking 1 to 2 times, and aspirating DPBS. Then, add 1 ml TrypLE Express Enzyme and incubate at room temperature for 2 to 3 min.\n9. Rock 3 to 4 times to ensure that the cells are no longer adherent to the dish.\nAt this step, you should visually see cells lift off the dish.\n10. Add 4 ml culturing medium to collect trypsinized cells into a 50-ml conical centrifuge tube and centrifuge 5 min at 1500 × g.\n11. During centrifugation of the cells, wash the 150-mm TC dish with 7 to 10 ml DPBS and aspirate.\nTo reduce plastic use and for cost-effectiveness, we reuse previously used 150-mm TC dishes after a wash with DPBS. This ensures complete removal of TrypLE from the dishes.",
    "12. To this dish and each of three new 150-mm TC dishes, add 14 ml culturing medium. After centrifugation of the cells, aspirate supernatant from the 50-ml conical tube and resuspend cell pellet in 8 ml culturing medium, using a 5- or 10-ml serological pipet to resuspend the cell pellet gently but thoroughly by pipetting up and down 3 to 4 times.\nNote that the volume used to resuspend the cell pellet can be adjusted as long as one 150-mm dish has a total volume of 15 ml.\n13. Add 1 ml cells to each of the four 150-mm TC dishes and rock 3 to 4 times for even plating. Place at 37°C, 5% CO2 for 72 hr.\nThe remaining 4 ml cells can be frozen in cryovials or discarded.\nA 72-hr incubation is used here for efficiency, where one frozen vial is thawed and plated on one 150-mm TC dish on Thursday and cells are passaged for a 1:8 split on Friday, resulting in four 150-mm TC dishes that are ∼70% confluent on Monday (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001]). The scheduling paradigm in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001] is an example and a recommendation to streamline the protocol for a Monday-to-Friday workweek but can be designed according to the research personnel's schedule. No more than a 1:8 split is recommended.\n14. After 72 hr, visually inspect cells to ensure all four 150-mm TC dishes are ≥70% confluent. Passage the cells by trypsinization, as described in steps 8 to 13, but use a 1:2 split, i.e., cells from four 150-mm TC dishes should be resuspended in 8 ml culturing medium and then plated onto eight 150-mm TC dishes (1 ml each). Incubate 16 to 24 hr at 37°C, 5% CO2.",
    "To reduce plastic use and for cost-effectiveness, we reuse previously used 150-mm TC dishes, as done in step 11. For example, after trypsinization and collection of cells from the four 150-mm TC dishes, wash the used 150-mm TC dishes by adding 7 to 10 ml DPBS and then rock and aspirate before adding culturing medium and cells. Obtain four new 150-mm TC dishes for the other 4 ml cells.\n15. Repeat step 14 daily for two more days, resulting in 32 dishes.\nAccording to the Strategic Planning outline (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001]), at this point, you should have 32 TC dishes on a Thursday.\nPlating AAVPro-293T cells into T-175 TC flasks\n16. Trypsinize all the cells, as previously described in steps 8 to 13, but after centrifugation, resuspend the cells in 30 ml culturing medium.\n17. Perform a 1:10 dilution by adding 100 µl cells to 900 µl culturing medium and perform a cell count by adding 10 µl of the diluted cells to a hemocytometer.\nThe total cell count from 32 confluent 150-mm TC dishes should be 520–560 × 106 cells.\n18. Resuspend the cells to a concentration of 11 × 106 cells/ml with culturing medium, i.e., in ∼50 ml, depending on the exact count.\n19. Add 17 ml culturing medium to 48 T-175 TC flasks. Then, add 1 ml cells (i.e., 11 × 106 cells from step 18) to each flask. Rock and then incubate at 37°C, 5% CO2 for 16 to 24 hr.\n20. If another AAV preparation is desired, as outlined in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001], proceed to steps 21 and 22. If not, skip to step 23.",
    "The cell density is crucial for high AAV production (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0003]). If less than the expected total number of cells is obtained, use fewer flasks. Next time, adjust the number of TC dishes plated on Friday (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001]) so that you have enough cells for 48 flasks at 11 × 106 cells/flask.\nIf desired, AAV production can be done using T-225 or T-182 TC flasks. Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-tbl-0002] lists the pertinent adjustments when using different-sized flasks.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f700fee2-c82b-488d-9971-0dc3794c2846/cpz1757-fig-0003-m.jpg</p>\nFigure 3\nOptimal AAVPro-293T cell density in T-175 flasks for AAV production. (A) Western blot and Coomassie blue stain of a Bis-Tris gel loaded with a standard of known viral titer and two AAV preparations, one produced from AAVPro-293T cells seeded at 14 × 106 cells/flask (14M) and the other at 11 × 106 cells/flask (11M). The AAV yields listed are from 48 T-175 flasks incubated for 3 days post-transfection. Note that the lower cell density of 11M provides the optimal, high AAV titer. Our results showing that a higher cell density yields lower AAV titers have been consistent in our hands and potentially indicate poorer transfection when cells are too crowded. (B) Representative images of AAVPro-293T cells seeded in T-175 flasks at 11 or 14 × 106 cells/flask (11M or 14M). vp: viral particles, M: million; note the “# Units” at 1 × 1011 vp is indicative of how many mice can be injected at a dose of 1 × 1011 vp, our typical dose injected into animals by tail vein injection. Scale bars indicate 380 μm; magnification: 10×.\nTable 2.\n                Adjustments for Different Flask Sizes\ntable:\n﻿Flask size,Culturing/transfection medium (ml),AAVPro-293T cell density (million/ml),# flasks for a single AAV prep\nT-175,18,11,48\nT-182,19,12,46\nT-225,23,14,38",
    "21. To one 150-mm TC dish, add 8–10 × 106 cells (there should be enough cells left over after step 19) and bring up to 15 ml with culturing medium. Incubate at 37°C, 5% CO2 for 16 to 24 hr.\n22. On the next day, perform a 1:8 split of the single 150-mm TC dish from step 21, resulting in four dishes, as described in steps 8 to 13.\nThis restarts the procedure from steps 8 to 20 for a subsequent full AAV preparation.\nAccording to the Strategic Planning outline (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001]), you should be performing this 1:8 split on Friday so that the four 150-mm TC dishes are confluent by Monday.\nTransfecting AAVPro-293T cells for recombinant AAV production\n23. On the next day, prepare six 50-ml conical centrifuge tubes. In three of the tubes, dilute the transfection agent, 1× PEI, with DMEM/F12 according to the volumes listed in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-tbl-0003]. In the remaining three tubes, dilute the helper plasmids (pAdDeltaF6 and pAAV2/9n) and the recombinant AAV (rAAV) plasmid with DMEM/F12 according to the volumes listed in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-tbl-0003]. Allow to sit at room temperature for 5 min.\nThe helper plasmid pAdDelta6 encodes the functional proteins that facilitate AAV production. pAAV2/9n specifically encodes capsids of AAV serotype 9, though vendors like Addgene have plasmids encoding capsid proteins for various AAV serotypes. We generate AAV serotype 9, as that has proven to be the most cardiotropic, and the heart is our organ of interest (Bish et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0001]; Inagaki et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0003]). The recombinant AAV plasmid is your cloned or purchased rAAV plasmid that will become the rAAV genome.\nTable 3.\n                AAVPro-293T Transfection\ntable:",
    "﻿Prepare the transfection reagent by diluting with DMEM/F12 as follows:,Prepare the transfection reagent by diluting with DMEM/F12 as follows:.1,Prepare the transfection reagent by diluting with DMEM/F12 as follows:.2,Prepare the transfection reagent by diluting with DMEM/F12 as follows:.3\n,Per 16 T-175 flasks (add listed volumes to each of three 50-ml conical tubes),Per 12 T-182 flasks (add listed volumes to each of three 50-ml conical tubes),Per 19 T-225 flasks (add listed volumes to each of two 50-ml conical tubes)\n1× polyethylenimine (PEI); dilute 10× PEI stock (5.17 mg/ml) to 1× with molecular biology–grade water,2.56 ml,2.56 ml,3.84 ml\n\"1:1 DMEM/F12, no antibiotic\",16 ml,16 ml,24 ml\nPrepare the helper and recombinant AAV plasmids by diluting with DMEM/F12 as follows:,Prepare the helper and recombinant AAV plasmids by diluting with DMEM/F12 as follows:,Prepare the helper and recombinant AAV plasmids by diluting with DMEM/F12 as follows:,Prepare the helper and recombinant AAV plasmids by diluting with DMEM/F12 as follows:\n,Per 16 T-175 flasks (add listed volumes to each of three 50-ml conical tubes),Per 12 T-182 flasks (add listed volumes to each of three 50-ml conical tubes),Per 19 T-225 flasks (add listed volumes to each of two 50-ml conical tubes each)\nrAAV plasmid,80 µg,80 µg,120 µg\npAdDeltaF6,160 µg,160 µg,240 µg\npAAV2/9n,80 µg,80 µg,120 µg\n\"1:1 DMEM/F12, no antibiotic\",16 ml,16 ml,24 ml",
    "\"Allow the diluted PEI and plasmids to sit separately for ∼5 min at room temperature. Then, combine the diluted PEI with the diluted plasmids and vortex vigorously for 1 min. Add to transfection medium as follows:\",\"Allow the diluted PEI and plasmids to sit separately for ∼5 min at room temperature. Then, combine the diluted PEI with the diluted plasmids and vortex vigorously for 1 min. Add to transfection medium as follows:\",\"Allow the diluted PEI and plasmids to sit separately for ∼5 min at room temperature. Then, combine the diluted PEI with the diluted plasmids and vortex vigorously for 1 min. Add to transfection medium as follows:\",\"Allow the diluted PEI and plasmids to sit separately for ∼5 min at room temperature. Then, combine the diluted PEI with the diluted plasmids and vortex vigorously for 1 min. Add to transfection medium as follows:\"\nFlask size,Transfection medium (for each 50-ml conical tube of PEI/plasmid mixture),# flasks (for each 50-ml conical tube of PEI/plasmid mixture),# flasks (for each 50-ml conical tube of PEI/plasmid mixture)\nT-175,270,16,16\nT-182,273,12,12\nT-225,385,19,19\n24. Combine the diluted PEI from one tube with the diluted plasmids from another tube. Repeat for the remaining two pairs of tubes. Vortex vigorously for 1 min. Incubate mixture at room temperature for 30 min and then combine the contents of one tube (∼18 ml PEI/plasmid mixture) with 270 ml transfection medium (see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-tbl-0003]).\nIMPORTANT NOTE: Keep to the times stated to ensure PEI and DNA complex formation.\nThe volumes of the contents of each tube are appropriate for 16 T-175 flasks. If using different-sized flasks, use the volumes listed in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-tbl-0003].",
    "25. Aspirate culturing medium from 16 T-175 flasks from step 19 and replace with 18 ml of the transfection medium/PEI/plasmid mixture from step 24. Rock 4 to 5 times before placing in a 37°C, 5% CO2 incubator.\n26. Repeat steps 24 and 25 for the remaining two tubes and 32 T-175 flasks. Incubate all 48 T-175 flasks at 37°C, 5% CO2 for 3 to 4 days.\nIncubation for 3 or 4 days has resulted in the same AAV yield (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ecc3a7b3-cd14-4375-a97b-71d3374df861/cpz1757-fig-0004-m.jpg</p>\nFigure 4\nComparison of AAV yields from cell lysate or medium after 3 or 4 days of incubation post-transfection. (A) Western blot and Coomassie blue stain of a Bis-Tris gel loaded with a standard of known viral titer and two AAV preparations demonstrating the AAV yield from cell lysate or medium when AAVPro-293T cells are incubated for 3 or 4 days. The AAV yields are from 12 T-175 flasks. (B) Representative images of AAVPro-293T cells at 3 and 4 days post-transfection. vp: viral particles, d: days; note the “# Units” at 1 × 1011 vp is indicative of how many mice can be injected at a dose of 1 × 1011 vp our typical dose injected into animals by tail vein injection. Scale bars indicate 380 μm; magnification: 10×.\nHarvesting recombinant AAV particles from AAVPro-293T cells\n27. Three or four days later (Monday or Tuesday, if following the Strategic Planning outline in Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0001]), set up 24 tubes (i.e., 50-ml conical centrifuge tubes) in a laminar flow hood.\n28. Move 12 of the 48 T-175 flasks from the 37°C, 5% CO2 incubator into the laminar flow hood. Collect all of the medium from two T-175 flasks with a serological pipet and transfer into one 50-ml conical centrifuge tube. Repeat for the remaining 10 T-175 flasks.",
    "You should end up with six 50-ml conical tubes with ∼36 ml collected medium each.\n29. To each bare T-175 flask, add 3 ml TrypLE, rock 3 to 4 times to evenly coat the surface, and place back in the 37°C, 5% CO2 incubator for ∼10 min.\n30. During the 10-min incubation, repeat steps 28 and 29 with another 12 T-175 flasks. By the time this second set of flasks has TrypLE and are ready to incubate in the 37°C, 5% CO2 incubator, move the first set of flasks back into the laminar flow hood and rock 3 to 4 times to ensure the cells have been efficiently trypsinized from the surface of the flask. Using a 10-ml serological pipet, add ∼10 ml of the collected medium from one tube to each of two flasks and wash the surface of each flask to collect the trypsinized cells. Add the cells from the two flasks to the same tube from step 28. Repeat for the remaining 10 flasks.\n31. Repeat step 30 for the second set of T-175 flasks.\nBy the end of this step, you should have 24 empty T-175 flasks and 12 tubes full of medium and cells (∼39 ml/tube).\nOptional: If intending to perform a dual AAV preparation of the same virus, these T-175 flasks can be reused for the next AAV preparation but only if making the same recombinant AAV. This significantly reduces the cost associated with two AAV preparations. To reuse, add DPBS to wash the flasks of residual cells and TrypLE and aspirate. Leave in the laminar flow hood without UV on. To increase efficiency, another member of the lab should be recruited for washing of T-175 flasks. We have not detected any contamination from this process that has affected our in vivo applications.",
    "32. Centrifuge the 12 tubes from steps 30 and 31 for 10 min at 300 × g at room temperature, with gentle handling. Remove the supernatant from the pellet with a 25-ml serological pipet and place into a biohazard waste collection container. Add 3 ml AAV lysis buffer to each tube, resuspend with a 10-ml serological pipet, and combine cell pellets from six tubes into one. Place these tubes on ice.\nBy the end of this step, you should have two tubes with ∼20 ml cell lysate each.\nAAV particles in media can be subjected to ammonium sulfate extraction to harvest any virus remaining in the media; however, in our hands, this generates a negligible increase in the yield of AAV (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0004]). For this reason, media disposal in a biohazard waste collection container is recommended. The biohazard waste collection container can be bleached for 1 hr before disposal or disposed of according to your institution's recommendations.\n33. Repeat steps 28 to 32 for the remaining 24 T-175 flasks.\nBy the end of this step, there should be a total of four tubes with ∼20 ml cell lysate each.\nThe setup for steps 28 to 33 is designed according to our optimized workflow but can be adjusted, as long as a total of ∼80 ml cell lysate is obtained at the end, as this volume is crucial for the success of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0002].\nNote that steps 28 to 33 take ∼2 hr for one individual. It is recommended that 1 to 2 more personnel be recruited if you want to reduce the time to 1 hr.",
    "34. Next, perform three rounds of freeze-thaw on the four tubes of cell lysate by placing lysates in a bath of dry ice and methanol for 20 to 30 min and then thawing in a 37°C water bath for 20 to 30 min. After three rounds of freeze-thaw, store at −80°C until ready for Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0002].\nAs an alternative to the dry ice/methanol bath for freezing, samples can be frozen at −80°C for the freeze-thaws, but expect 1 hr for complete freezing.",
    "Here, we describe our basic protocol for AAV purification, which entails two major steps: (1) iodixanol gradient centrifugation to purify the AAV particles from other cellular contents of the AAVPro-293T cell lysates and (2) concentration of AAV particles using an ultrafiltration and concentrator device that also facilitates the replacement of iodixanol with Lactated Ringer's solution. By the end of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0002], high-titer AAV in a safe, injectable solution will be ready for administration in vivo.\nMaterials\nFour 50-ml conical centrifuge tubes of cell lysate containing AAV particles (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0001])\n250 U/µl Benzonase Nuclease (Millipore Sigma, cat. no. 71205-3)\n1 M MgCl2 (Sigma, cat. no. M1208)\n15%, 25%, 40%, and 60% (w/v) iodixanol solutions (see recipes; make 60% fresh)\nAAV lysis buffer (see recipe)\n70% (v/v) ethanol\n4× Laemmli buffer (Bio-Rad, cat. no. 1610747)\nβ-mercaptoethanol (Sigma-Aldrich, cat. no. M6250)\n4%-12% Bis-Tris protein gel (Bio-Rad, cat. no. 3450124)\n1× MES buffer (from 20×; Bio-Rad, cat. no. 1610789)\nPre-stained protein ladder (Precision Plus Protein Kaleidoscope Prestained Protein Standards, Bio-Rad, cat. no. 1610375)\nCoomassie blue stain (InstantBlue, Abcam, cat. no. ab119211)\nLactated Ringer's solution (NDC 0990-7953-09)\nDPBS, no calcium, no magnesium (1×; Gibco, cat. no. 14190250)\nAAV of known titer (Addgene or equivalent)\n37°C water bath\nCentrifuge with swinging-bucket rotor (Eppendorf or equivalent)\nOptiSeal ultracentrifuge tubes (32.4 ml; OptiSeal ultracentrifuge tube kit, Beckman, cat. no. 361662)\nSerological pipets, sterile (VWR or equivalent)\nSpinal needles (18G × 3.5 in.; Med Vet International, cat. no. 29660)\n10-ml syringes, sterile (Fisher, cat. no. 14-955-459, or equivalent)\n18G hypodermic needles (BD, cat. no. 305195, or equivalent)\nWeighing scale (Ohaus, cat. no. 1450-SD)\nType 70 Ti fixed-angle rotor (Beckman, cat. no. 337922)\nOptima XE-90 ultracentrifuge (Beckman, cat. no. A9983), 16°C\nMetal support stand with burette clamp\n2.0-ml tubes, sterile (Fisher-Scientific, cat. no. 02-681-375)",
    "5-ml syringes, sterile (Fisher, cat. no. 14-955-458, or equivalent; optional)\n95°C heat block\nElectrophoresis system (Criterion cell and PowerPac power supply, Bio-Rad, cat. no. 1656019)\n50-ml conical centrifuge tubes (Corning or equivalent)\nVivaspin 20 ultrafiltration devices (100-kDa MWCO; Sartorius, cat. no. 28-9323-63)\n1.5-ml microcentrifuge tubes (VWR or equivalent)\nMicrocentrifuge (Thermo Scientific or equivalent)\nImageJ\nNOTE: Apart from centrifugation and weighing of ultracentrifuge tubes, ensure all AAV handling is performed in a laminar flow hood (Labconco Purifier BSC Class II or equivalent).\nIodixanol gradient centrifugation\n1. Thaw the four 50-ml conical centrifuge tubes of cell lysate containing AAV particles from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0001] in a 37°C water bath for 20 to 30 min. Once thawed, add 11 µl of 250 U/µl Benzonase Nuclease and 20 µl of 1 M MgCl2 to each of the four tubes. Incubate in a 37°C water bath for 30 min.\n2. Centrifuge 20 min at 3200 × g at room temperature in a centrifuge with a swinging-bucket rotor to collect the supernatant.\nThe supernatant will contain soluble proteins as well as AAV that can now be subjected to purification by iodixanol gradient centrifugation.",
    "3. Set up eight OptiSeal ultracentrifuge tubes for iodixanol gradient centrifugation in a laminar flow hood. To each ultracentrifuge tube, add 15%, 25%, 40%, and 60% iodixanol phases according to the volumes listed in Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-tbl-0004]. Begin by adding the 15% iodixanol phase to the bottom of each ultracentrifuge tube with a 5-ml serological pipet. Then, use a spinal needle and 10-ml syringe to set up each subsequent phase, placing the needle all the way at the bottom of the tube so that each phase is layered below the other (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005] and 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005]). Then, layer the AAV9-containing cell lysate from step 2 (∼10 ml/ultracentrifuge tube) carefully on top of the 15% phase using an 18G hypodermic needle and 10-ml syringe. Bring the cell lysate layer up to the base of the tube's neck with AAV lysis buffer.\nEight ultracentrifuge tubes are sufficient for ∼80 ml cell lysate generated from 48 T-175 flasks in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0001].\nThe spinal needle and syringe used to set up the 25%, 40%, and 60% iodixanol phases can be reused. Before setting up the next phase, wash the needle and syringe with molecular biology–grade water. Do not use the syringe or needle for any purpose other than iodixanol gradient setup.\nBend the 18G needle such that it touches the inner plastic tube so that transferred contents fall gently on top of the 15% phase (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005] and 5D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005]).\nTable 4.\n                Iodixanol Gradient Setup\ntable:\n﻿Iodixanol (OptiPrep),Volume\n15% iodixanol,7.3 ml\n25% iodixanol,4.9 ml\n40% iodixanol,4 ml\n60% iodixanol,4 ml\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0c973166-1c58-40c2-ad4b-19853e748728/cpz1757-fig-0005-m.jpg</p>\nFigure 5",
    "Iodixanol gradient ultracentrifugation workflow. Setup of an iodixanol gradient in OptiSeal ultracentrifuge tubes, starting with an illustration of (A) a spinal needle and 10-ml syringe adding the 25% iodixanol phase under the 15% phase in an ultracentrifuge tube. This method is to be repeated for all subsequent phases, resulting in the iodixanol gradient shown in (B). Subsequently, (C) illustrates cell lysate being layered on top of the 15% iodixanol phase with an 18G needle and 10-ml syringe, resulting in the complete iodixanol gradient shown in (D). Note that the color of the iodixanol phases change to a slightly pinker hue over time but that this has no impact on subsequent steps. Weigh the ultracentrifuge tubes using a weighing scale as in (E), followed by ultracentrifugation. After ultracentrifugation, the iodixanol gradient tubes appear as shown in (F). The setup and method for 40% iodixanol phase extraction are shown in (G) and (H), respectively. L: AAVPro-293T cell lysate.\n4. Balance the ultracentrifuge tubes using a weighing scale (Fig. 5E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005]) by placing a pair on the balance together and removing/adding lysate between the tubes until they are balanced.\nThis pair of tubes will be placed directly across from each other in the 70 Ti rotor to ensure perfect balance.\nIMPORTANT NOTE: Ensure ultracentrifuge tubes are balanced before centrifugation.\n5. Seal the tubes with the plastic corks provided in the OptiSeal ultracentrifuge tube kit. Press down firmly on caps to ensure closure.\n6. Centrifuge in a Type 70 Ti fixed-angle rotor in an Optima XE-90 ultracentrifuge for 1 hr at 69,000 rpm, 16°C, with maximum acceleration and coast (no brake) on deceleration.",
    "On an Optima XE ultracentrifuge, the settings for acceleration and deceleration are 0 and 10, respectively. At coast, expect ∼30 min for the rotor to stop. The coast setting is used to ensure that there is no disturbance of the gradient. However, we have set the deceleration to the next lowest setting, i.e., 9 on an Optima XE, with no disturbance of the layers. At this setting, it takes the rotor ∼15 min to stop.\nAt the end of ultracentrifugation, the genome containing AAV will settle into the 40%-to-60% interface and the clear 40% iodixanol phase (Fig. 5F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005]), and all other proteins and empty AAV capsids will settle in the upper 25% phase and 25%-to-40% interface, respectively (Kimura et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0004]; Lopez-Gordo et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0006]; Zolotukhin et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0007]). After the centrifugation is complete, the iodixanol gradients should look as depicted in Figure 5F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005].\n7. Prepare a metal support stand with a burette clamp, as depicted in Figures 5G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005] and 5H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005], in a laminar flow hood. Wipe each ultracentrifuge tube with 70% ethanol. Remove the cap on top of a tube, being mindful not to apply too much force that would disturb the layers. Gently secure one iodixanol gradient tube onto the burette clamp so that it is held in place. For collection of the 40% phase and the 40%-to-60% interface in subsequent steps, set up five 2.0-ml tubes with caps off in a rack underneath the iodixanol gradient tube, as shown in Figures 5G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005] and 5H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0005].",
    "8. Attach a 5- or 10-ml syringe to an 18G hypodermic needle and use the syringe to guide insertion of the needle into the tube ∼2 mm below the 40%-to-60% interface. While applying pressure as the needle is inserted, twist the needle clockwise and counterclockwise until a drop appears from the tube and the needle breaks through the tube into the 60% iodixanol phase. Ensure that the needle is positioned bevel side up inside the tube.\nNo further drops should emanate once the needle is fully inserted through the ultracentrifuge casing. However, twisting of the needle to let out an initial drop has proven crucial for steady flow of solution through the needle at the next step. If no drop appears, we have found the flow of the solution to be slow, but at no detriment to AAV retrieval. Proceed as usual.\n9. Once the needle is fully inserted into the tube, unfasten the syringe from the needle. As soon as the syringe is unfastened, the iodixanol solution will quickly begin to flow through the needle hub.\nEnsure that the first 2.0-ml tube is positioned directly beneath the lip of the needle hub to catch the solution as it drips. Once the first 2.0-ml tube is ∼1 ml full, move to the next tube, collecting about 0.5 to 1 ml, then the next, collecting 0.25 to 0.5 ml, and so on until most of the clear 40% phase has been collected. In total, about 3 to 4 ml is collected per iodixanol gradient tube, divided into fractions among the five 2.0-ml tubes. Do not collect any of the 40%-to-25% interface or any of the 25% phase because these contain cellular proteins and empty AAV particles (Kimura et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0004]).",
    "When the 25% phase gets near to the needle, you should be at the last or second-to-last tube. This ensures that any contamination from the 25%-to-40% interface and 25% phase lies only in the last two tubes, which can be discarded if needed with minor loss to total AAV retrieval.\nCollected samples can be stored at 4°C overnight before proceeding to the next step. Samples can remain at 4°C for up to 1 week, but 1 to 2 days is recommended.\nOptional: Rather than removing the syringe and allowing the iodixanol phase to drip through the needle hub, you can leave the syringe fastened and pull the 40%-to-60% interface and 40% phase into the syringe directly. However, this method increases the risk of contamination from the 25% phase.\n10. Load a sample from each 2.0-ml tube on a Bis-Tris protein gel to determine successful generation of AAV and purity of the AAV after iodixanol gradient ultracentrifugation. Begin by taking 18 µl from each 2.0-ml tube and supplementing with 6 µl of 4× Laemmli buffer and 0.3 µl β-mercaptoethanol and boil for 5 min at 95°C in a heat block. Load on a 4%-12% Bis-Tris protein gel with 1× MES buffer. Include a lane with 4 µl pre-stained protein ladder. Run the gel at 200 V for 40 min using an electrophoresis system. Then, stain with Coomassie blue stain for ≥15 min to visualize the viral capsid proteins VP1, VP2, and VP3, whose molecular weights are 87, 73, and 62 kDa, respectively (Kimura et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0004]).",
    "Samples from the last 2 to 3 tubes need only be run because they should be the only ones at risk of having been contaminated by the 25% phase. If any of the 25% phase was accidentally collected, a smear of proteins running at various sizes will be visible (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0006]). The intensity of the viral capsid protein bands can also provide a subjective estimate of the titer of virus produced.\nOptional: 4%-12% Bis-Tris gels are not necessary. Any percentage gel can be used.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9a9d4302-0b79-4955-9da0-ac5206a535c3/cpz1757-fig-0006-m.jpg</p>\nFigure 6\nAnalysis of 40% iodixanol fractions collected after iodixanol gradient ultracentrifugation. (A) Western blot and Coomassie blue stain of a Bis-Tris gel loaded with 18 μl from the last three 2.0-ml tubes used to collect the 40% phase after ultracentrifugation. The lanes marked 3, 4, and 5 indicate samples from the last three 2.0-ml tubes collected from the first iodixanol ultracentrifuge tube; the lanes marked 8, 9, and 10 indicate samples from the last three 2.0-ml tubes collected from the second iodixanol ultracentrifuge tube; and so on, for a total of four iodixanol ultracentrifuge tubes represented. (B and C) show the same setup as in (A), but with samples representing 25% phase contamination, indicated by Xs. These samples are to be discarded to preserve AAV purity.\nConcentration of AAV particles\n11. Discard any samples with obvious contamination from the 25% phase (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-fig-0006]). Combine all pure samples into two 50-ml conical centrifuge tubes, with about 10 to 15 ml sample in each tube. Bring the volume of each tube to ≥40 ml with Lactated Ringer's solution.\n12. Wash four Vivaspin 20 ultrafiltration devices by adding 10 ml Lactated Ringer's solution and centrifuging for 5 min at 200 × g in a swinging-bucket rotor at room temperature.",
    "Fewer Vivaspin 20 ultrafiltration devices can be used. Four are used in this protocol for the sake of time. If using fewer than four Vivaspin devices, consider diluting the sample by adding Lactated Ringer's up to a volume of 50 ml in step 11. This is to safeguard the Vivaspin device from being overloaded with iodixanol. It will take longer to pack ∼100 ml of 40%-to-60% iodixanol onto fewer columns, but diluting the iodixanol ensures optimal flow through the Vivaspin device.\n13. Add 20 ml of the diluted sample from step 11 to each of the four Vivaspin 20 devices and centrifuge 10 to 15 min at 3000 × g at room temperature, until the volume of sample has reached between 1 and 5 ml, as indicated on the Vivaspin 20 device. Discard the effluent.\nAfter centrifugation, the virus will remain inside the column of the Vivaspin 20 device. The attached collection tube holds the effluent that is to be discarded.\nIf the volume reaches between 0.5 and 1 ml, decrease the centrifugation time. Do not allow the column to dry. Work quickly to add more sample during this process. If the volume continues to reach 0.5 to 1 ml despite decreasing the centrifugation time, consider lowering the speed to 2000 × g.\n14. Repeat step 13 if there is any remaining sample from step 11. Bring the volume to 20 ml with Lactated Ringer's solution.\n15. Then, fill the Vivaspin 20 device up to 20 ml with Lactated Ringer's solution and centrifuge 10 to 15 min at 3000 × g at room temperature, until the volume is between 1 and 5 ml. Discard the effluent.\nIf the volume reaches between 0.5 and 1 ml, decrease the centrifugation time or speed.\n16. Repeat step 15 two more times.",
    "This repeated centrifugation is necessary for thorough replacement of iodixanol with Lactated Ringer's solution.\n17. Perform a final centrifugation with 20 ml Lactated Ringer's solution at 3000 × g at room temperature. Run the centrifuge until the volume of sample reaches the 0.2-ml mark on each device.\nThis ensures highly concentrated virus. The timing of this step is variable but can take up to 30 min.\n18. Unscrew the caps of the Vivaspin 20 devices, and with a 200-µl pipet, collect all traces of sample from inside the columns and combine into one 1.5-ml microcentrifuge tube. Separate 16 µl of the virus into each of two 1.5-ml tubes (8 µl/tube). For the remaining sample, measure and take note of the total volume and then aliquot the virus into four 1.5-ml tubes. Store at −80°C.\nBecause each device should have ≥0.2 ml sample, there should be at least ∼800 µl total.\n19. To each tube with 8 µl virus, add 4 µl DPBS and then 4 µl of 4× Laemmli buffer and 0.3 µl β-mercaptoethanol. Set aside.\n20. Prepare a dilution series of an AAV of known titer, i.e., the standard, by adding 16 µl standard to 4 µl Lactated Ringer's solution in a 1.5-ml tube. From this tube, take 10 µl and add to 10 µl DPBS in a new tube, and so on, until five tubes are prepared in total. Prepare a technical replicate of two.\nOur standard was provided as a gift from Dr. Roger Hajjar's lab (Lopez-Gordo et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-bib-0006]), but an AAV of known titer from Addgene or an alternate source can be used.",
    "21. Boil the samples from steps 19 and 20 for 5 min at 95°C in a heat block. Let cool at room temperature for 1 min and then centrifuge 1 min at >12,000 × g. Load all samples on a 4%-12% Bis-Tris gel with 1× MES running buffer, including 4 µl pre-stained protein ladder. Run at 200 V for 40 min. Stain with Coomassie blue stain for 1 hr or overnight to obtain the most sensitive detection of the viral capsid proteins. Wash the gel several times with water to wash off the background stain.\nWashing will lead to a cleaner gel for quantification (see step 22).\n22. Perform densitometry analysis of VP3 of the standard AAV and the new AAV sample preparation using ImageJ.\nDensitometry of VP3 is performed due to its greater intensity relative to the other viral capsids. Densitometry of the standard virus will yield a standard curve that you can use to determine the titer of the new AAV sample preparation. Specifically, the results of this analysis yield a standard curve plotted as measured densitometry units (arbitrary units on the y-axis) versus known concentration (viral particles on the x-axis), with an R-squared value between 0.97 and 1.0. A high R-squared value will ensure the most accurate quantification of your sample. An R-squared value of 0.96 or lower likely indicates pipetting error, and steps 19 to 21 should be repeated with more careful consideration for sample setup and gel loading. At the end of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.757#cpz1757-prot-0002], purified recombinant AAV in a safe injectable solution is generated for use to genetically manipulate transgenes in vivo."
  ],
  "subjectAreas": [
    "Pharmacology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}