{
  "id": 17463,
  "origin_website": "Jove",
  "title": "Laparoscopic Pancreatoduodenectomy for Pancreatic Cancer Using In-Situ No-Touch Isolation Technique",
  "procedures": [
    "This study was permitted by the Ethics Committee of the Second Affiliated Hospital of Guangzhou University of Chinese Medicine.\n1. Patient selection\nAdvise the patients suspected of suffering pancreatic ductal adenocarcinoma (PDAC) in the pancreas head to take a contrast-enhanced computed tomography (CT) scan at first. Then select the following patients: borderline resectable cases after neoadjuvant therapy, tumor regresses significantly and has the possibility of radical resection; meanwhile, SMV reconstruction is potentially needed.\nExclude the following patients: (1) metastatic PDAC; (2) patients with a poor general condition that cannot tolerate major surgery; (3) vascular involvement of SMA, common hepatic artery (CHA), or celiac artery (CA).\n2. Surgical technique\nOperative setting\n\t\nPlace the anesthetized patient in a completely supine position, with legs spread out.\nDuring the sterile exposition, ensure that the suprapubic region is exposed adequately for the later specimen removal by a Pfannenstiel incision. Ensure that the operator surgeon stands on the right side, the first assistant is on the left side, and the second assistant holding the laparoscope is positioned between the patient's legs. Use the 5-port technique to perform the procedure (Figure 1).\nAfter the pneumoperitoneum is created, introduce the rigid laparoscope through the sub-umbilical 12 mm trocar, and place the other four trocars along a semi-circle.\nExploration phase\n\t\nExplore the intraperitoneal organs and peritoneal surfaces meticulously for unexpected extrapancreatic metastases.\nResect the greater omentum and open the lesser sac by dividing the gastrocolic ligament.\nLigate Henle's gastrocolic trunk vein. Explore the gap between the pancreatic neck and SMV at the lower edge of the pancreas.\n\t\tNOTE: The tunnel between the pancreatic neck and SMV can not be created easily if the anterior wall of SMV is involved.\nDissection phase:\n\t\nSubcolonic mesenteric approach: For this approach, follow steps 2.3.2-2.3.5.",
    "After the transverse colon and its mesentery are elevated cephalad, place the entire small bowel on the left side to facilitate exposure of the pancreaticoduodenal region.\nExpose the second and third parts of the duodenum after the mesentery section.\nIn order to reconfirm resectability and mobilize the posterior of the pancreatic head, expose the inferior vena cava (IVC), left renal vein (LRV), celiac trunk, aorta, and SMA (Figure 2).\nThen perform the dissection along the SMV to clear all the tissues on the right side. In order to expose the SMV fully, ligate the root of the middle colonic artery after confirming that there is no ischemia in the transverse colon.\nLeft posterior of SMA approach: For this approach, follow steps 2.3.7-2.3.18.\nPlace the entire small bowel on the left side to facilitate exposure and the dissection of the distal duodenum proximal to the ligament of Treitz.\nDivide the proximal jejunum with a stapler.\nExpose the SMA by tracing along the jejunal artery.\nPlace a Fr8 catheter for hanging for encircling the dorsal aspect of the SMA and SMV.\nPull the catheter to the upper right side to allow SMA dissection on its periadventitial plane on the anterior-left margin and its separation from the mesopancreas.\nLigate the first jejunal artery (FJA) involved by the tumor and sacrifice.\nIdentify the first jejunal vein (FJV) and the inferior pancreaticoduodenal veins (IPDV), which are the branches from the dorsal side of the SMV.\nLigate and dissect the IPDV.\nCircumferentially dissect the SMA to identify the inferior pancreaticoduodenal artery (IPDA), which either forms a common trunk with the FJA or arises directly from the SMA (Figure 3).\nSacrifice the IPDA.\nAt the left posterior approach, dissect the SMA, which is identified at its origin above the LRV, free from the mesopancreas.",
    "In cases that the tumor invades the mesocolon, hang the SMV and SMA through a rubber band followed by coring out of the mesocolon.\nSupracolic median-anterior of SMA approach: For this approach, follow steps 2.3.20-2.3.34.\nStart the SMA approach from the upper colon region.\nExplore the gap between the pancreatic neck and SMV at the lower edge of the pancreas.\nUse a stapler device to divide the stomach 3-5 cm away from the pylorus.\nRemove the gallbladder.\nDivide the common bile duct (CBD) as conventional PD. Take a frozen pathologic examination of the bile duct stump. Apply the laparoscopic bulldog clamps to occlude the CBD temporarily.\nDissect the hepatoduodenal ligament. Perform a lymphadenectomy along the CHA, the proper hepatic artery (PHA), and the PV.\nLigate and dissect the right gastric artery.\nIdentify the gastroduodenal artery (GDA) at the point where the PHA branches from the CHA.\nDoubly ligate or suture the GDA to minimize the chance of subsequent erosion and bleeding.\nTransect the neck of the pancreas with an ultrasound knife. Take a frozen pathologic examination of the pancreatic stump.\nSuspend the splenic vein (PV) using a rubber band.\nSet up a diamond-shaped window by retracting the transverse mesocolon caudally, the PV cranially, the SMV rightward, and the SMA leftward.\nDuring the supracolic median-anterior of the SMA approach, dissect the right and dorsal aspects of the SMA within this diamond-shaped window.\nResect the fat and fibrous tissues around SMA and CA from the caudal side to the cephalic side.\nLigate and transect the uncinate process artery (UPA) under the PV, leaving the specimen attached to the PV/SMV.\nCombining with median-anterior and left-posterior approaches to the SMA, expose the origin of the IPDA or the common trunk of the IPDA and FJA easily.",
    "NOTE: During this procedure, the GDA, UPA, and IPDA have been completely ligated. Furthermore, all the tumor artery inflows are completely occluded till this moment to reduce bleeding.\nUse laparoscopic bulldog clamps to temporarily clamp the PV, the splenic vein, and the SMV. Transect the involved vein with sufficient margin.\nAfterward, cut off the lymphatics and dissect the duodenum from the retroperitoneum.\nFinally, resect the tumor in situ and remove en bloc following the oncologic principles of No-Touch2,6,7.\nReconstruction phase\n\t\nMeasure the length of the venous defect with a soft ruler. If the defect exceeds 3 cm, consider using an artificial interposition graft.\nPerform SMV reconstruction from caudal to cephalic by continuous suture using 5-0 prolene sutures (Figure 4).\nReconstruct the digestive tract by Child's method9.\nAn end-to-side, perform single-layer running suturing hepaticojejunostomy with 4-0 absorbable sutures.\nConduct pancreatic anastomosis by duct-to-mucosal, end-to-side pancreaticojejunostomy within an internal stent9.\nAfter a side-to-side gastrojejunal anastomosis, place three drainages near the anastomosis.\nBag the specimen and retrieve it through the Pfannenstiel incision.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}