{
  "id": 2766,
  "origin_website": "Cell",
  "title": "Multiplexed evaluation of mouse wound tissue using oligonucleotide barcoding with single-cell RNA sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Tissue harvest\nTiming: 1 h\nIn this section, full-thickness wound tissue is excised and processed into a single cell suspension. Wounds may theoretically be harvested at any time post-surgery, but we have only tested this protocol at timepoints between 2 days and 6 months.\nTissue harvest and processing.\nHarvest each wound en bloc with the splinting ring in place (Figure 8[href=https://www.wicell.org#fig8]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2277-Fig8.jpg\nFigure 8. Wound tissue harvest\n(A) The mouse is sacrificed. The adhesive dressing is removed prior to tissue harvest, but the silicone ring is left in place.\n(B–D) The region of depilated dorsal skin is harvested using dissecting scissors by separation below the panniculus carnosus to ensure complete thickness.\n(E–I) The skin is finely minced to sub-millimeter diameter pieces (E–H) and subjected to enzymatic digestion (I).\n(J and K) The resulting suspension is then filtered through a 40 mm nylon mesh.\nHarvest the dorsal skin using dissecting scissors by separation below the panniculus carnosus to ensure the complete thickness of the skin is harvested (Figures 8[href=https://www.wicell.org#fig8]B–8D).\nAt this stage, up to one-third of each wound may be set aside and processed separately for histology.\nIsolate the remaining wound tissue from any underlying attached hypodermis with a scalpel.\nRinse the resulting skin in cold PBS.\nTo achieve a cell suspension:\nFinely mince the harvested skin using sharp scissors into sub-millimeter diameter pieces (Figures 8[href=https://www.wicell.org#fig8]E–8H).\nMinced tissue should be roughly 0.5 mm in diameter.\nEnzymatically digest the minced skin using Liberase DL (0.5 mg/mL; 10 mL needed per 100 mg of tissue) for 1 h at 37oC (Figure 8[href=https://www.wicell.org#fig8]I).\nFilter the resulting suspension through a 40 mm nylon mesh (Figures 8[href=https://www.wicell.org#fig8]J and 8K).\nOptional: FACS isolation\nTiming: 2 h\nThis optional step allows for the isolation of cell subsets prior to barcoding.",
    "Optional: FACS isolation.\nIsolate cells from single cell suspensions using a pre-specified fluorescence-activated cell sorting (FACS) strategy.\nOne approach to isolate fibroblasts uses a negative lineage gating strategy, wherein a lineage gate (Lin) for hematopoietic (CD45, Ter-119), endothelial (CD31, Tie2), and epithelial (CD326, CD324) cell markers are used as a negative gate to isolate fibroblasts (Lin-).3[href=https://www.wicell.org#bib3]\nPart 2: Oligonucleotide barcoding\nTiming: 1.5 h\nThis step tags cells from each sample with unique oligonucleotide barcodes to permit their downstream identification.\nHashtag oligonucleotide barcoding.\nPreparation of cell suspensions.\nEnzymatic digestion may cause a cleavage of tissue-specific epitopes, which may not be applicable to non-wound tissue specimens, resulting in reduced staining with TotalSeq antibodies.\nStaining conditions and concentrations should be optimized separately for each tissue type.\nAssessment of cell viability.\nPerform cell counts using a hemocytometer to ensure accurate assessment of cell viability. An ideal cell viability is ≥ 95%.\nDilute cells in an appropriate volume prior to staining.\nDilute 1 million cells in 49.5 μL of Cell Staining Buffer (pre-made from BioLegend) in 1.5 mL Eppendorf tubes (Figures 9[href=https://www.wicell.org#fig9]A and 9B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2277-Fig9.jpg\nFigure 9. Single cell suspension preparation and hashtag oligonucleotide barcoding\n(A and B) Prior to staining, cell suspensions are washed, spun down, decanted, diluted to an appropriate volume.\n(C and D) Cells are then blocked by incubating with TruStain FcX and tagged using titrated amounts of each TotalSeq hashtag antibodies.\n(E–I) Following incubation, the cells are filtered using a pipette tip cell strainer to remove any clumps of cells or debris.\nIf working with pig or human cells, instead dilute 1 million cells in 45 uL of Cell Staining Buffer.\nNote: Staining buffer should be stored at 2°C–8°C, for no longer than 6 months.\nBlock cells.",
    "Add 5 μL of Human TruStain FcX Fc Blocking reagent or 0.5 μL of TruStain FcX PLUS (anti-mouse CD16/32) antibody.\nThe final blocking volume should be 50 μL.\nIncubate for 10 min at 4°C.\nWhile cells are incubating in Fc Block, proceed to next step.\nPrepare antibody pool using titrated amounts (up to 1 μg) of each TotalSeq hashtag antibodies.\nIf the antibody cocktail volume is less than 50 μL, add Cell Staining Buffer up to 50 μL. Then centrifuge the antibody pool at 14,000 g at −8°C for 10 min before adding to the cell suspension prepared above.\nCarefully pipette out the prepared antibody pool, avoiding the bottom of the tube, and add the 50 μL of TotalSeq antibody cocktail to the 50 μL blocked cell suspension (Figures 9[href=https://www.wicell.org#fig9]C and 9D).\nIncubate the stained suspension for 30 min at 4°C.\nWash the stained suspension (repeat 3 times).\nAdd 0.5 mL of Cell Staining Buffer and spin at 4°C for 5 min at 500 g.\nCarefully remove the supernatant using a pipette.\nFollowing the last wash step.\nResuspend the cells in PBS at a concentration of 500–800 cell/μL.\nSlowly filter cells through a 40 μm Flowmi Cell Strainer (Figures 9[href=https://www.wicell.org#fig9]E–9I).\nVerify cell concentration and viability after filtration using a hemocytometer.\nDilute cells in PBS as necessary for appropriate input (10–20 uL) into the 10× Chromium chip for cell capture and subsequent library preparation and sequencing.\nIdeal loading volume is 10–20 uL per single well of the 10× Chromium controller.\nManufacturer recommendation for cell number is 10,000 cells, but well-clustered data may be obtained with as few as 1,000 cells per capture.",
    "Our group has found that 10 samples (with unique HTO barcodes) is the ideal number for pooling per 10× well/capture, but we have had success using as few as 2 and as many as 12 pooled samples."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Gene Expression",
    "Single Cell",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}