{
  "id": 17557,
  "origin_website": "Jove",
  "title": "Organotypic Slice Cultures as Preclinical Models of Tumor Microenvironment in Primary Pancreatic Cancer and Metastasis",
  "procedures": [
    "Tissue specimens were collected and processed after approval by the local ethics committee of the University of Lübeck (# 16-281).\n1. Fresh tissue collection and handling\nNOTE: Every unfixed human tissue specimen should be handled with caution to prevent the risk of infection from blood-borne pathogens. All patients should be tested to be negative for HIV, HBV, and HCV prior to tissue processing. Wear a protective coat and handle human tissue specimens with gloves.\nCollect fresh, unfixed, and unfrozen PDAC tissue specimen with a minimum size of 0.4 x 0.4 cm immediately after surgery and transport the specimen to the laboratory in a tissue storage solution.\nWhen possible, process the fresh tissue immediately.\nAlternatively, store tissues in tissue storage solution on wet ice at 4 °C overnight. However, tissue storage might result in impaired viability and should generally be avoided.\n2. Preparation\nLow melting agarose preparation\n\t\nPrepare 100 mL of low-melting agarose (8%) by dissolving 8 g of agarose in 100 mL of prewarmed Ringer's solution and store it at 4 °C until needed.\nUpon the announcement of tumor resection, melt the agarose in a microwave.\nPlace the agarose in a pre-heated water bath (37 °C) allowing it to cool down to physiological temperatures prior to the preparation.\nVibratome setup\n\t\nPlace a razor blade into the holder of the vibratome and perform an automated angle adjustment according to the manufacturer's instructions, if applicable.\nCool down the jacket of the cutting chamber using a cooling unit or wet ice.\nFill the cutting chamber with approximately 100 mL of a physiological cutting solution (e.g., Ringer's solution).\nPlace the mounted razor blade into the pre-chilled cutting solution, allowing the razor blade to cool down.\n3. Tissue embedding in low-melting agarose",
    "Wash the tissue specimen with cooled (4 °C) PBS and place the tissue in PBS onto a large (~14 cm) Petri dish on ice.\nRemove macroscopically visible excess connective tissue on ice using a scalpel since it might impede the cutting efficiency.\nPlace the tissue into a small Petri dish (~3 cm).\nAdjust the tissue orientation so that remaining macroscopically visible connective tissue has the same orientation as the plane of the bottom of the Petri dish. The bottom of the Petri dish has the same orientation as the cutting plane.\nPour the prepared low-melting agarose into the small Petri dish.\nReadjust the orientation of the tissue, if needed, using forceps.\nPlace the Petri dish on wet ice for faster hardening of the agarose.\nCarefully cut the tissue using a scalpel, leaving at least 5 mm surrounding agarose on each side of the tissue.\nCarefully transfer the embedded tissue and glue it on the sample holder using super glue.\nAfter a few seconds, place the sample holder into the cutting chamber.\nAdjust the orientation of the tissue toward the razor blade, if needed.\n4. Slicing of the agarose-embedded tissue using a vibratome\nDefine the outer limits of the cutting range (y axis) according to the size of the tissue specimen.\nAdjust the blade toward the top of the tissue block.\nSet cutting speed to 0.04 mm/s, cutting amplitude to 1 mm and slice thickness to 300 µm.\nCarefully cut the first slices and transfer the slices to a separate container with prechilled (4 °C) cutting solution on wet ice.\n5. Culture of organotypic slice cultures\nPrepare a 6-well plate with 1 mL of the appropriate cultivation medium per well.\n\t\nMedium A: Advanced DMEM/F12, 10% FBS, 1% Penicillin/Streptomycin.",
    "Medium B: RPMI 1640, 10% FBS, 1% Penicillin/Streptomycin, 4 µg/mL Insulin, 8 ng/mL EGF, 0.3 µg/mL hydrocortisone.\n\t\tNOTE: The medium for optimal culture conditions might vary depending on the tissue and the patient. Two distinct tissue culture media were compared, one based on DMEM/F12 (medium A), the second based on RPMI (medium B). No substantial differences were detected between these media. For all experiments shown in this protocol, medium A was used.\nPlace the 6-well plate with the medium into an incubator, allowing temperature and pH to adjust prior to cultivation.\nPlace slices onto cell culture inserts (e.g., hydrophilic PTFE inserts with 0.4 µm pore size) using a gaze filter.\nRemove any excess cutting solution by placing the loaded filter onto a sterile cloth.\nPlace the loaded filter into the prepared 6-well plate. Do not add any additional medium to the insert.\nPlace the 6-well plate in an incubator (37 °C, 5% CO2).\nChange the medium every 2 days by repeating steps 5.1, 5.2, and 5.5 with a new 6-well plate.\n\t​NOTE: Organotypic slice cultures can be cultured for various periods depending on the individual research question.\n6. Resazurin viability assay\nNOTE: The resazurin viability assay measures general metabolic activity of the organotypic slice cultures based on the reduction of non-fluorescent blue resazurin to red fluorescent resorufin in living cells15. The assay has no toxic effects on cells and can be applied to the cultures repeatedly depending on the individual research question. Viability was measured using the resazurin assay every 2-3 days.\nPreparation of resazurin stock solution\n\t\nTurn off the light of the sterile hood, since resazurin stock solution is light sensitive.\nPrepare a stock solution with 10 mg/mL of resazurin sodium salt in 1x PBS.",
    "Store the stock solution in light protected aliquots at 4 °C in the fridge until use.\nAssessment of overall slice viability\n\t\nTurn off the light of the sterile hood, since resazurin stock solution is light sensitive.\nDilute the resazurin stock solution 1:250 with an appropriate medium.\n\t\tNOTE: The medium used for dilution should be the same as used for cultivation (medium A or medium B).\nPrepare 1 mL of the final resazurin solution per slice and add an additional 1 mL for the blank control, e.g., for 6 slices dilute 28 µL of resazurin stock solution in 7 mL of medium.\nDispense the resazurin solution in 6-well plates, with 1 mL of the diluted resazurin solution per well.\nTransfer the cultivation filters with the slices into the wells with the resazurin solution. One well with the resazurin solution is kept empty as blank control.\n\t\tNOTE: To simplify the experimental procedure, this step can be combined with changing the medium (step 5.7). However, in case additional viability measurements are needed, the assay can be done anytime during the cultivation of the slice cultures.\nPlace the tissue slices in an incubator for 1 h at 37 °C and 5% CO2.\nPrepare new 6-well plates with the culture medium if slice culture is continued (see steps 5.1 and 5.2).\nRemove the cultivation filters with the slices from the resazurin solution and remove excess solution by placing the loaded filter onto a sterile cloth.\nTransfer the cultivation filters with the slices onto the previously prepared culture plate.\nFrom each 6-well, take 100 µL of resazurin solution and transfer it onto a 96-well plate. From blank control, place three samples (3 x 100 µL) in separate wells of the 96-well plate.",
    "Quantify the extinction with a plate photometer according to the manufacturer's instructions. Excitation wavelength is set to 545 nm and emission wavelength is set to 600 nm.\n7. Formalin fixation and paraffin embedding of OTSCs\nCautiously transfer the cultivated tissue slices to a plastic embedding cassette. To do so, follow the steps below.\n\t\nPlace the cultivation filter with the mounted slice on a Petri dish.\nWith a scalpel, carefully cut out the filter membrane with the mounted tissue slice.\nCarefully transfer the filter membrane with the mounted slice into a biopsy nylon bag and place it in an embedding cassette.\nSubsequently transfer plastic embedding cassettes in a container with pre-chilled (4 °C) 4.5% formalin. Slices can be kept in formalin solution at 4 °C until further use but should be incubated for at least 24 h.\n\t\tNOTE: OTSCs need to be transferred with great caution as they tear apart easily.\nCautiously rinse the formalin-fixed slice culture with running tap water for 1.5 h.\nDehydrate the formalin-fixed tissue slice by incubation in 70% ethanol (2x for 3 h), 95% ethanol (1x for overnight, 1x for 3 h), followed by absolute ethanol (1x for 3 h, 1x for overnight).\nClear the formalin-fixed tissue slice by 3 h incubation in xylene twice.\nImmerse the tissue with paraffin at 60 °C (1x for overnight, 1x for 2 h). Embed the tissue in a paraffin block in a tissue embedding mold.\nSection the paraffin-embedded tissue block at 4 µm thickness with a microtome and float in a 40 °C water bath containing distilled water. Transfer the sections onto glass slides.\nIncubate paraffin sections for 1 h at 60 °C to bond the tissue to the glass. Incubate the slides overnight at 37 °C.\n8. Hematoxylin and Eosin (H&E) staining",
    "Deparaffinize sections from step 7.7 by incubation in xylene (3x for 5 min).\nRe-hydrate by incubation in absolute alcohol (2x for 5 min), 95% alcohol (2x for 5 min), and 70% alcohol (1x for 5 min). Rinse briefly with distilled water.\nStain in Mayer hematoxylin solution for 5 min. Rinse with running tap water for 10 min.\nCounterstain in 0.5% Eosin solution for 40 s. Rinse with distilled water.\nDehydrate by incubation in 70% alcohol (maximal 1 min), 95% ethanol (2x for 3 min), and absolute alcohol (2x for 3 min), respectively.\nClear in three changes of xylene (few seconds each). Place a drop of mounting medium and cover slides with a coverslip.\n9. Immunohistochemistry of OTSCs\nDeparaffinize sections by incubation in xylene 2x for 10 min, followed by 1:1 ethanol/xylol for 10 min.\nTransfer slides to 100% ethanol (2x for 3 min), 96% ethanol (2x for 3 min), 70% ethanol (1x for 3 min), and then to 50% ethanol (1x for 3 min).\nPerform antigen retrieval to unmask the antigenic epitope. Heat the slides in a microwave in citrate buffer for 5 min at 900 W, followed by 2x for 8 min at 600 W. Allow the slides to cool to room temperature for 20 min.\nWash in PBS 3x for 3 min on a shaker.\nPerform permeabilization of cell membranes by incubation in 0.1% Triton X-100 in PBS (200 µL per slide) in a humidified chamber at room temperature for 10 min.\nWash in PBS for three changes, 3 min each on the shaker.\nIncubate sections with 3% H2O2 solution in methanol (200 µL per slide) in a humidified chamber at room temperature for 10 min to block endogenous peroxidase activity.\nWash in PBS 3x for 3 min on a shaker.",
    "Add 200 µL of blocking buffer (1:50 horse serum in PBS) and incubate in a humidified chamber at room temperature for 25 min.\nDrain off the blocking buffer from the slides by tilting the slide on a paper tissue.\nApply 200 µL of appropriately diluted primary antibody in antibody diluent on the slides and incubate in a humidified chamber at 4 °C overnight. As a negative control, use appropriate isoform of mouse immunoglobulins at the same dilution as the primary antibody.\nWash 3x for 3 min in PBS on a shaker.\nApply 200 µL of biotinylated secondary antibody (1:50 solution in PBS) on the slides and incubate in a humidified chamber at room temperature for 30 min.\nWash 3x for 3 min in PBS on a shaker.\nPrepare the avidin/biotin-based peroxidase complex according to the manufacturer's instructions prior to application. Apply 200 µL of avidin-biotin-peroxidase complex on the slides and incubate in a humidified chamber at room temperature for 30 min.\nWash 3x for 3 min in PBS on a shaker.\nApply 200 µL of DAB substrate solution (freshly made directly before use: 1 drop of DAB in 1 mL of substrate), 200 µL per slide. Allow the color development 1-3 min until the desired color intensity is reached.\nRinse with running tap water for 10 min.\nCounterstain the slides by immersing sides in Hematoxylin for 5 min.\nRinse with running tap water for 10 min.\nCover the slides using aqueous mounting medium and coverslips. The mounted slides can be stored at room temperature permanently.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}