{
  "id": 19722,
  "origin_website": "Wiley",
  "title": "Microglial Phagocytosis/Cell Health High-Content Assay",
  "procedures": [
    "The assay introduced here is a simplified cellular imaging assay without any fixation and washing steps, while producing multiparameter measurements with high capacity using a 384-well plate format. The assay procedures include plating cells on day 1, incubating cell plates overnight before treating cells on day 2, adding pHrodo-myelin/membrane debris to cell plates on day 3, and 20 hr later, staining cell nuclei with Hoechst-33342 for 30 min before performing high-content imaging on day 4. Three selected parameters are measured from cells: 1) mean total fluorescence intensity per cell of pHrodo-myelin/membrane debris in phagocytosis vesicles to quantify phagocytosis; 2) cell counts per well to quantify treatment effects on proliferation and cell death; and 3) average nuclear intensity to quantify treatment-induced nuclear changes such as in apoptosis. The assay has been used on HMC3 cells (an immortalized human microglial cell line), BV2 cells (an immortalized mouse microglial cell line), and primary microglia isolated from mouse brains. For initial assay attempts, we recommend using HMC3 cells available from the ATCC.\nMaterials\nHMC3 microglial cell line (ATCC, cat. no. CRL-3304) (Janabi et al., 1995[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0014]), or BV2 immortalized mouse microglial cell line (kindly gifted by Dr. Michelle Block, Indiana University School of Medicine) (Blasi et al., 1990[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0002]; Taetzsch et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0037]), or primary microglia isolated from C57BL/6J mouse brain (Saura et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0034])\nMaintenance medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-rec-0003])\nAssay medium (see recipe)\nTrypLE Express (ThermoFisher Scientific, cat. no. 12605-028)\nDulbecco's phosphate-buffered saline (DPBS, 1×) no calcium, no magnesium (ThermoFisher Scientific, cat. no. 14190-144)\n0.4% trypan blue solution (Gibco, cat. no. 15250061)\nSterile water: filter water using MilliQ Millipak 0.22-µm filter (Millipore Sigma, cat. no. MPGP002A1), then autoclave\nSerum-free medium: 500 ml DMEM, high glucose, GlutaMAX supplement (ThermoFisher Scientific, cat. no. 10566-016)\n70% ethanol\nLipopolysaccharides (LPS) (Sigma-Aldrich cat. no. L2143)\nCytochalasin D (ENZO, cat. no. MBL-T109-0001)",
    "Idelalisib (Medchemexpress, cat. no. HY-13026)\nSaracatinib (Medchemexpress, cat. no. HY-10234)\nDMSO, ≥99.9% (Sigma-Aldrich, cat. no. 276855-100 ml)\nHoechst 33342 (Invitrogen, cat. no. H3570)\npHrodo-myelin/membrane debris (1 mg/ml, 55 µl-aliquots) (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-prot-0002] below for preparation)\nCellXpert C170i cell culture incubator (Eppendorf, cat. no. 2231000868)\nBiosafety cabinet: 1300 series class II, type A2 biological safety cabinet (ThermoFisher Scientific, cat. no. 1323TS, model 1371)\nT-75 flasks (uncoated) (Fisher Scientific, cat. no. FB012937)\n2-ml microcentrifuge tubes (Fisher Scientific, cat. no. 05-408-138)\n10 ml serological pipettes (Fisher Scientific, cat. no. 13-678-11E)\nCountess II automated cell counter (ThermoFisher Scientific, cat. no. AMQAX1000)\nCountess cell counting chamber slides (ThermoFisher Scientific, cat. no. C10283)\n50-ml conical tubes (Thermo Scientific, cat. no. 339652)\n384-well clear-bottom cell culture plates (Corning, cat. no. 353962)\nThermo Scientific Multidrop 384 (cat. no. 5840150 or 5840157) set in the biosafety cabinet\n96-well compound plates (Thermo Scientific, cat. no. 249946)\n15-ml conical tubes (Thermo Scientific, cat. no. 339650)\nOT-2 pipetting robot (Opentrons, SKU 999-00111, 999-00002, or 999-00002)\nOT-2 accessories and tips: HEPA module (Opentrons, model GEN1), P300 GEN2 multichannel pipette (Opentrons), P20 GEN2 multichannel pipette (Opentrons), 15-ml reservoir (12-well, Opentrons, SKU 999-00076, or Nest, cat. no. 360112; or similar), 96 tips/box and refills (20 μl and 200 μl or 300 μl)\nUltrasonic bath (Fisher Scientific, ca. no. 15336130; model: Branson 1800), or similar\nSonicator (Fisher Scientific, model: FB50)\nArrayScan XTI high-content analysis (HCA) Reader (Thermo Scientific), and associated image analysis software (Thermo Scientific HCS Studio).\nDay 1: Cell plating\n1. Culture the cells in the T-75 flasks with 10 ml maintenance medium per flask, until they are 70%-90% confluent, changing the medium every 2-3 days depending on cell density.\nUse two flasks for each cell line, one for the assay, and one as a backup and for passaging.",
    "2. Pre-warm the assay medium and TrypLE to 22°C-37°C.\n3. In the biological safety cabinet, gently remove the medium from the cells in the T-75 flasks and gently rinse the cells twice with 5-10 ml DPBS per flask.\n4. Immediately after removing the second DPBS rinse, coat the cells with 2 ml TrypLE per flask.\n5. Replace the lids on the flasks and return the cells to the incubator (37°C, 5% CO2) for 5-10 min.\nDo not leave cells in TrypLE for more than 15 min to avoid over-digesting the cell membrane proteins.\n6. After the 5-10 min incubation period, add 4 ml assay medium to each flask and mix so that the fetal bovine serum (FBS) in the medium inactivates the TrypLE. Use the resuspension to rinse any remaining cells off the bottom surface of the flask, then stand the flask up on its end (opposite the cap) to pool the resuspension over a smaller surface area.\n7. Mix the cells (gently and carefully; avoid making bubbles) ten times with a 10 ml serological pipette.\nAt this point, if detaching multiple flasks of a single cell type, cells of the same type may be pooled together into a single resuspension volume.\n8. Remove 11 μl cell resuspension into a 2-ml microcentrifuge tube for counting.\n9. Add 11 μl 0.4% trypan blue solution to the cell sample and gently mix with pipetting three times.\n10. Transfer 10 μl dyed sample into each chamber on the cell counting slide, load the slide into the cell counter, and read the cell count and viability. Make sure the viability of the cells to be used for the assay is >90%.",
    "11. In a 50-ml conical tube, prepare 35 ml cell solution for plating one 384-well plate (prepare 20 ml more for each additional cell plate if needed), at the concentration needed to achieve the desired number of cells per well. Plating volume for the 384-well plate is at 45 μl/well; HMC3 cells are prepared at 13,333 cells/ml to yield 600 cells/45 μl/well, and BV2 cells at 8,889 cells/ml to yield 400 cells/45 μl/well; and mouse primary microglia at 44,444 cells/ml to yield 2,000 cells/45 μl/well. Each 384-well plate can test 16 different treatments in duplicate in 10-point concentration serial dilutions. Plate the number of plates for an experiment accordingly.\n12. Prepare the following in separate 50-ml conical tubes for washing tubes of the 384 Multidrop (or similar instrument can be used for plating cells into 384-well plates):\n         \n>30 ml sterile water\n25 ml serum-free medium\nThis is the volume needed for plating 2 cell lines; add 10 ml per additional cell line.\n15-20 ml 70% ethanol\n13. Prepare the Multidrop and set it to dispense 45 μl/well into all the wells of a 384-well plate.\n14. Label an empty clear-bottomed 384-well plate and set it on the plate carrier of the Multidrop. Remove the lid and set it aside.\n15. Run ∼10 ml of serum-free medium through the instrument into a waste container.\n16. Draw up some air into the tubing, then gently mix the first 50-ml conical tube of cells for plating. Draw up the cell suspension into the instrument. Gently agitate the cell suspension constantly, until plating is completed.\nEnsure that no air bubbles are being drawn up. Be sure to have at least 22.5 ml cell suspension in the 50-ml tube for plating a 384-well plate with 45 μl/well.",
    "17. Initiate the cell plating program to plate the cells.\n18. If plating multiple plates of the same cell type, be sure to add more cell suspension to the 50-ml conical tube, then repeat the plating.\n19. Check the plate visually for any obvious volume errors, which can be corrected manually.\n20. When the plating step is completed, empty the tubes of residual cell suspension.\n21. Prepare tubes for plating the next cell line by sequentially running 20 ml sterile water followed by 10 ml serum-free medium through the tubes, then hold the tubes up in the air and draw up some air.\n22. Repeat steps 16-19 with the second cell line.\n23. Check the plates under a microscope to ensure that the cells were plated evenly and with no visible contamination.\n24. Clean tubes by sequentially by running 30 ml sterile water through the instrument followed by 10 ml 70% ethanol until all the ethanol has run through into the waste container.\n25. Power off the instrument. Clean and store the instrument and accessories.\n26. Incubate plated cells overnight (16-24 hr) at 37°C with 5% CO2 before treatment.\nDay 2: Compound serial dilution and treating cells\nThe following procedures are for a single plate of each cell type, with duplicates of each compound dilution series within each plate.\nProtocols for the OT-2 (or other similar liquid handling) robot (compound dilution protocol and compound distribution protocol) will need to be designed and tested before proceeding. Multichannel pipettes in the robot are oriented along the Y (e.g., plate column) axis using the protocols.",
    "27. Use a 96-well compound plate for serial dilutions. Start by manually filling column 2 wells with 97 µl assay medium, then add 3 µl 20 mM compound in DMSO in each well to get 600 µM and 3% DMSO of each compound as 10×.\n28. Make 3% DMSO in assay medium (30 µl DMSO and 970 µl medium/ml), prepare 6 ml for each compound plate, add the 3% DMSO-medium at 60 µl/well to wells in column 3-12.\n29. Prepare a 1:3 dilution series by sequential transferring/mixing (three times) 30 μl from each well to the next well across the rows, from column 2 to column 11. Column 12 will remain without compound, as the vehicle control column. An example plate map of compound dilution is shown in Figure 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0001].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c37bbb86-0f96-47ce-b2ed-e46c06f32a3f/cpz1724-fig-0001-m.jpg</p>\nFigure 1\nCompound serial dilutions are performed in 96-well compound plates for treating cells in the 384-well cell plate. Two 96-well plates will be used for compound dilutions to cover one 384-well cell plates for testing 16 compounds in duplicates. An example plate map of compound dilution is shown in (A) and a treated cell plate map shown in (B). (C) pHrodo-myelin/membrane debris concentration-dependent phagocytosis was tested in both HMC3 and BV2 cells through 4-hr exposures. Both cells showed a concentration-dependent phagocytosis signal; 5 μg/ml (>50% of maximal signal) was chosen for the assay.\n30. Transfer and position the compound plates, cell plates, and a box of 20 µl tips securely in the proper positions within the robot enclosure, according to the protocol setup on the robot app/software. Remove any lids or covers from these items.",
    "31. Use the 8-channel pipette to pick up 20 µl control DMSO-medium from column 12, and transfer it to columns 1, 12, 23, and 24 in each cell plate, distributing 5 µl/well, twice per column since it is a 96-well to 384-well transfer. Change tips after this step.\n32. Pick up 10 μl compounds from column 2 of the compound plate, transfer to column 2 of a 384-well cell plate through two duplicate actions (5 μl/well, 2 distributions/column); repeat these actions (pick up and transfer) through column 3-11 to treat the left half of the 384-well cell plate.\n33. Repeat step 32 with a new set of tips and the second compound plate to treat the right half (column 13-22) of the 384-well cell plate.\n34. Return cell plates to the incubator at 37°C with 5% CO2 for 24 hr before proceeding with the next step.\nAn example map of treated cell plate is shown in Figure 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0001].\nThe above compound distribution procedures are performed with the OT-2 automatic pipetting robot; These steps can be done with similar instruments. The compound distribution protocol requires the 20 μl 8-channel pipette to transfer 5 μl of each concentration of each compound from the 96-well compound plate to the corresponding wells in the 384-well cell plates, changing tips for each compound plate.\nDay 3: pHrodo-myelin/membrane debris seeding",
    "The pHrodo-myelin/cell debris seeding protocol uses the 20 μl 8-channel pipette to transfer 5 μl pHrodo-myelin/membrane debris from the compound plate to the corresponding wells in the cell plates so that final cell exposure to 5 μg/ml that was experimentally determined (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0001]), changing tips after every transfer (from the compound plate to the cell plate) to avoid potential cross-contamination of compounds into the pHrodo-myelin/cell debris in the compound plate. The following protocol is for two cell plates; adjust volumes accordingly if using additional plates.\n35. Pre-warm 5 ml cell culture assay medium to 37°C.\n36. For each cell plate, thaw 2 aliquots of pHrodo-labeled myelin/cell debris (ea. 55 µl at 1 mg/ml) in the water bath at room temperature.\n37. Vortex the aliquots briefly, then sonicate them in the sonicating water bath for 2 min, vortex the aliquots again, and transfer them into the biosafety cabinet.\n38. In the biosafety cabinet, dilute each pHrodo-myelin/membrane debris aliquot with 1.1 ml assay medium (yielding 50 µg/ml pHrodo-myelin/membrane debris), pool the four aliquot dilutions in a 15-ml conical tube, and mix thoroughly.\n39. Distribute 260 µl/well diluted pHrodo-myelin/membrane debris to wells in the first two columns (one column per cell plate) of a clean compound plate for seeding cells with the OT-2.\n40. Use 20 μl tips to transfer 5 μl/well of the pHrodo-myelin/membrane debris from the compound plate to two 384-well cell plates; seed control columns 12 and 23 first, changing tips after every seeding to avoid cross contamination among wells when seeding wells in columns 2-11 and 13-22. Total seeded wells cover columns 2-23 of a 384-well cell plate; leave wells in columns 1 and 24 without seeding as negative controls.\n41. Return cell plates to the incubator at 37°C with 5% CO2 for 20 hr before next step.",
    "Day 4: Nuclear staining and imaging\nThe following protocol is for two cell plates; adjust volumes accordingly if using additional plates.\n42. Perform nuclear staining as follows:\n         \nPre-warm 22 ml of assay medium to room temperature.\nAdd 22 μl of 10 mg/ml Hoechst 33342 into 22 ml assay medium; mix well.\nUse 200 μl tips to transfer 20 μl/well of the diluted Hoechst 33342 to 384-well cell plates, final cell exposure to 2.6 μg/ml Hoechst 33342; return cell plates into incubator for 30 min at 37°C with 5% CO2 for incubation.\nThis step is performed with the OT-2 automatic pipetting robot but can be done with similar instruments.\nRemove cell plates from the incubator for imaging.\n43. Perform imaging as follows:\n         \nPower on the ArrayScan XTI high-content imaging instrument, start Thermo Scientific HCS Studio Cell Analysis Software, choose the template of General Spot Measurement Tool. Set two channels, channel-1 for nuclear fluorescence (Hoechst 33342, ex. 386 nm, em. 440 nm) and channel-2 for phagocytosis vesicle fluorescence (pHrodo red, ex. 560 nm, em. >585 nm).\nThe plate imaging alignment may need to be optimized on the instrument at this time if not properly centered on wells.\nLoad the plate and optimize the imaging settings using the 10× objective, adjust appropriate imaging settings for each cell type to be imaged including automatic focusing on nucleus, find optimal exposure time for each channel, set the software to take a z-stack of 3 images with 6.7 μm apart to generate a projected image for analysis and taking 4 projected images/well.",
    "Take example images from max and min wells and analyze these images through image analysis process: 1) segment cells on nucleus to identify individual cells; 2) expand identified edge of nucleus 30-50 μm to cover whole cell area; 3) identify phagocytosis vesicles in cell area for analysis.\nStart the imaging, collecting four images per well. For analysis, collect cell counts per well, average nuclear intensity, and mean total phagocytosis spot intensity/cell, plus any other additional parameters of interest, for quantitation.\nIn the ArrayScan system, choose the template of “General Spot Measurement Tool” that allows to identify and analyze both the nuclei and the phagocytosed vesicles. A separate analysis protocol is needed for each cell type since different cell sizes and morphology need to be optimized for each specific cell type before starting the automated analysis. The imaging and analysis can be done with other high-content imaging systems using the similar analysis method.",
    "When developing the phagocytosis assay, we questioned what would be a proper ligand for measuring microglial phagocytosis. There are many options from which to choose, such as commercially available recombinant Aβ, Tau, microbeads, zymosan, and bacteria, or experimentally isolated dead neurons, synaptosomes or myelin from mouse brains. Since our project targets the TREM2 pathway, and since myelin/membrane debris has been shown to be a good ligand for TREM2 binding (Andreone et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0001]; Ennerfelt et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0008]; Nugent et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0026]) and a natural material in the brain that is cleaned up by microglia in both homeostasis and neurodegenerative diseases, we decided to use myelin/membrane debris for the microglial phagocytosis/cell health assay. Isolation of crude myelin/membrane debris from 6-8 week old wild type C57BL/6J mouse brains was followed and modified on established literature protocols using sucrose gradients (0.32 M/0.85 M) and ultracentrifugation (Andreone et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0001]; Erwig et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-bib-0009]). The crude myelin/membrane debris was diluted to 1 mg/ml (protein equivalent) in DPBS, stored in a −80°C freezer, and subsequently labeled with pHrodo red dye.\nAdditional Materials (also see Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-prot-0001])\n6-8 week old C57BL/6J mice (B6; The Jackson Laboratory, 000664), 3 mice for each preparation\nAnesthesia (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-rec-0001])\nUltrapure distilled water (Invitrogen cat. no.10977-015); or autoclaved MilliQ water\nSucrose (Thermo Scientific, cat. no. A1558336) for preparing 0.3 M, 0.32 M and 0.85 M solutions in distilled water, 20 ml each, keep on ice.\nLysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-rec-0002])\nPierce Rapid Gold BCA Protein assay kit (Thermo Scientific, cat. no. A53226)\npHrodo red, 10 mM (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-rec-0005])\nNaHCO3, 1M (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-rec-0004])\npH 4 buffer (Fisher Scientific, cat. no. Orinon 910104)\nGlass petri dish (Fisher Scientific, cat. no. 08749B)\nRazor blades\nGlass dounce homogenizer (Fisher Scientific, cat. no. 06-435B)",
    "5-ml ultracentrifuge tubes (SETON Scientific, cat. no. 5022) or similar 5-10 ml tubes for ultracentrifuge\nSterilized Pasteur pipette\nBeckman Optima XPN-80 ultracentrifuge and SW 40 Ti rotor, 4°C (or similar)\nEppendorf centrifuge 5424R, 4°C\nMicrocentrifuge (BT labsystems, model. BT604)\nBenchtop shaker (Fisher Scientific, cat. No. 88861045)\n96-well clear-bottom cell culture plates (Thermo Scientific, cat. no. 165305)\n1. Anesthetize 6-8 week old C57BL/6J mice (up to 3 mice for each prep) with anesthesia through intraperitoneal (ip) injection of 20 μl/gram body weight, then euthanize by cervical dislocation. (All experiments were approved by the Institutional Animal Care and Use Committee at Indiana University).\n2. Remove brain tissues and place each brain in 1.2 ml cold lysis buffer in a glass petri dish on ice, cut into fine pieces with a razor blade and then dissociate via dounce homogenization (20× loose, then 20× tight).\n3. Transfer the homogenate to 5-ml ultracentrifuge tubes with 1.2 ml/tube. Weigh loaded tubes to have balanced pairs for ultracentrifugation.\n4. Add 1.2 ml of 0.32 M sucrose carefully underneath with a sterilized Pasteur pipette, and then add 1.2 ml of 0.85 M sucrose underneath both layers.\n5. Precool the Beckman Optima XPN-80 ultracentrifuge to 4°C, load samples, and spin 30 min at 75,000 × g, 4°C (in an SW 40 Ti rotor, or similar) with low acceleration and deceleration.\n6. Carefully remove myelin at the 0.32 M/0.85 M sucrose interface from centrifuge tubes and resuspended in 10 ml cold distilled water in a 15 ml tube, mix well.\nSome tubes may fail to generate the myelin layer between 0.32 M/0.85 M sucrose gradients; we collected about 120 µl from the top of the whitish precipitates (about top 10% of the precipitates) which are membrane debris.\n7. Transfer the myelin/membrane debris to 2-ml microcentrifuge tubes with 1.2 ml/tube.",
    "8. In a microcentrifuge (Eppendorf centrifuge 5424R), spin 10 min at 14,000 × g, 4°C, with maximum acceleration and deceleration; discard supernatant, resuspend pellets in 1.2 ml cold distilled water for each tube and vortex. Repeat three more times; after final centrifugation step, resuspend myelin/membrane debris with DPBS at 1 ml/tube.\n9. Combine myelin from the 2-ml tubes into one 15-ml tube on ice for sonication at max amplitude for 15 s, sonicate three times.\n10. Perform BCA assay to determine protein concentration, then dilute with DPBS to 1 mg/ml protein concentration, make 5 ml/tube aliquots (using 15-ml tubes) store in −20°C or −80°C freezer, or process for pHrodo labeling immediately through the following procedures.\n11. Transfer 15 ml thawed 1 mg/ml myelin/membrane debris into a 50-ml conical tube.\n12. Add 1.65 ml 1 M NaHCO3 to the 15 ml myelin/membrane debris. Mix by pipetting.\n13. Add 150 μl 10 mM pHrodo red in DMSO to the myelin/membrane debris in the 50-ml conical tube. Mix by pipetting.\n14. React for 45 min at room temperature: wrap the 50-ml tube with aluminum foil and set the tube in a rack on a shaker with gentle shaking.\n15. Remove unbound dye as follows: \n         \nTransfer labeled myelin/membrane debris from the 50-ml tube to about 10-12 2-ml centrifuge tubes with 1.5 ml/vial (weigh tubes for balance before centrifuging).\nSpin 10 min at 14,000 × g, 4°C, using the Eppendorf centrifuge 5424R.\nDiscard supernatant.\nResuspend labeled myelin/membrane debris in cold DPBS (keep on ice) by vortexing.\nRepeat b-d three more times to remove unbound pHrodo red dye\n16. Resuspend the labeled myelin/membrane debris in cold DPBS to total 15 ml (same as original volume of the unlabeled myelin, to keep the concentration at about 1 mg/ml); pool in a 50-ml conical tube on ice.",
    "17. Sonicate the labeled myelin/membrane debris solution on ice (put the sonicator probe into the myelin solution in the 50-ml tube kept on ice in a beaker) at max strength for 15 s; perform this step three times.\n18. Make aliquots of 55 μl/vial in 2 ml vials (two aliquots are required for each 384-well plate for one assay); store at −20°C (up to 3 months) or −80°C (up to 1 year) or use immediately. The final molar ratio of pHrodo red/myelin is at least 2 (counting myelin basal protein with MW 20 kD as the average MW of the sample).\n19. Check the quality of the pHrodo-myelin/membrane debris prep with a fluorescent microscope as follows: \n         \nPrepare pHrodo-myelin/membrane debris at 5 μg/ml in DPBS (1:200 dilution of 1 mg/ml stock with DPBS).\nTransfer 100 μl of the prep to a well of a 96-well clear-bottom cell culture plate.\nImage with a fluorescent microscope using a 20× lens to get both transmitted light and fluorescent (ex. 560, em. 585 nm) images.\nWhen in DPBS (about pH 7), the sample should show little or no fluorescence.\nAdd 200 μl of a pH 4 buffer to the well and repeat step c.\nThe pHrodo-myelin/membrane debris should show strong red fluorescence in acid solution (around pH 4.2) (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0002] and 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f68d422c-2bbc-490e-995a-e0db74ef4c2b/cpz1724-fig-0002-m.jpg</p>\nFigure 2\nCharacterization of pHrodo-myelin/membrane debris. The pHrodo-myelin/membrane debris was checked in DPBS for fluorescence and on cells for phagocytosis. Overlayed transmitted light and fluorescent images are shown: (A) in pH 6.94 DPBS with no red fluorescence; (B) in pH 4.28 DPBS with strong red fluorescence. (C) HMC3 cells with red phagocytosis vesicles. (D) BV2 cells with red phagocytosis vesicles. Scale bar: 100 µm.\n20. Check pHrodo-myelin/membrane debris signal in phagocytosis as follows:",
    "Plate cells in a clear-bottomed microplate (1,000 cells/45 μl/well for a 384 well plate, or 5,000 cells/90 μl/well for a 96-well plate).\nIncubate overnight in an incubator at 37°C with 5% CO2.\nOn day 2, prepare a 1:20 dilution (as 10× for seeding to cells) of the 1 mg/ml pHrodo-myelin/membrane debris (e.g., 5 μl mixed with 95 μl medium),\nAdd the diluted pHrodo-myelin/membrane debris into the cell plate (e.g., 5 μl/well for a 384-well plate with 45 μl cells/well plated, or 10 μl/well for a 96-well plate with 90 μl cells/well plated) so that cells are exposed to 5 μg/ml pHrodo-myelin/membrane debris.\nIncubate at 37°C with 5% CO2 for 4-5 hr.\nCheck phagocytosis with a fluorescent microscope as above in step 19 (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0002] and 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0002]).\nUsing 5 μg/ml pHrodo-myelin/membrane debris for the assay was determined with concentration dependent phagocytosis on both HMC3 and BV2 cells (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.724#cpz1724-fig-0001])."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}