{
  "id": 11320,
  "origin_website": "Jove",
  "title": "Tri-layered Electrospinning to Mimic Native Arterial Architecture using Polycaprolactone, Elastin, and Collagen: A Preliminary Study",
  "procedures": [
    "Prior to electrospinning, collagen, from 6 month bovine corium, must be extracted using an acetic acid based process.  This extracted collagen is then purified through a subsequent series of dissolutions, precipitations, and dialyses.  Once collagen is lyophilized, the electrospinning process can begin.\nThree materials are massed: polycaprolactone (PCL), elastin (ELAS), and collagen (COL).  These materials will be separately dissolved in 1,1,1,3,3,3 hexafluoro-2-propanol (HFP, TCI America) at concentrations of 100 mg/ml, 200 mg/ml, and 70 mg/ml, respectively.\nThe materials are blended in five different scintillation vials at volumetric ratios of 98-2-0 PCL-ELAS-COL (intima), 45-45-10, 55-35-10, and 65-25-10 PCL-ELAS-COL (media), and 70-0-30 PCL-ELAS-COL (adventitia).\nFor uniaxial tensile testing and individual layer compliance testing, each of the materials was individually electrospun, while multi-layered vascular grafts for burst, suture retention, and compliance testing were electrospun from a 3 to 1 configuration.  Uniaxial tensile testing scaffolds were flat and rectangular (2.5 cm wide x 10.2 cm long x 0.3 cm thick) since the 2 mm diameter mandrels used to electrospin individual layers and multi-layered grafts were too small for punching test samples.",
    "For both individual and multi-layer electrospinning, the polymer solutions were loaded into a plastic 3 ml Becton Dickinson syringe with an 18 gage blunt-tip needle, and placed onto a syringe pump at a set dispensary rate.  Individual electrospinning rates were set to 4 ml/hr, while multi-layered electrospinning rates were varied depending on transition and layer.  Flow rates and volumes were as such:  the intima was electrospun at a rate of 4 ml/hr and a volume of 0.5 ml followed by a transition combining both intimal and medial syringes for 0.2 ml at 2 ml/hr each.  The intimal syringe was then shut off and the medial layer was allowed to spin for 0.6 ml at 4 ml/hr followed by a transition between the media and adventitia for 0.2 ml of polymer solution at 2 ml/hr each.  Finally, the media was stopped and the adventitia was allowed to spin for 0.4 ml at 4 ml/hr.\nAll samples were cross-linked in 50 mM EDC for 18 hours prior to any testing 1.\nUniaxial tensile testing was performed on six samples from one electrospun sheet hydrated in PBS for 24 hours.  \"Dog-bone\" shaped samples were punched from electrospun mats and tested on a MTS Bionix 200 testing system with a 100 N load cell and an extension rate of 10.0 mm/min.  Peak stress, modulus, and strain at break were calculated using TestWorks version 4.",
    "Suture retention testing was performed on six 2 mm inner diameter tubular specimens from six different electrospun grafts, soaked in PBS for 24 hours at 37°C, on a MTS Bionix 200 testing system with a 50 N load cell (MTS Systems Corp.) and an extension rate of 150.0 mm/min in accordance with the straight across procedure described in the American National Standards Institute 2.  5-0 commercial PDS II violet monofilament suture was placed 2 mm from the end of the sample and extended until the suture had pulled through the graft.  Peak load was recorded in grams-force using TestWorks version 4.\nBurst strength testing was performed on six samples from six different electrospun grafts.  Burst tubes, 2-3 cm in length, were hydrated in PBS, fitted over 1.5 mm diameter nipples attached to the device, and secured with 2-0 silk suture.  Air was introduced into the system, increasing the pressure at a rate of 5 mmHg/s until the tubes burst 2. Results are reported as the pressure in mmHg at which tubes ruptured.\nDynamic compliance was determined for six 2 mm inner diameter tubular grafts taken from six different electrospun grafts at a length of 3 cm under simulated physiological conditions.  Both individual layers and multi-layered tubular constructs were electrospun and tested under the same conditions.  The specimens were tested in an Intelligent Tissue Engineering via Mechanical Stimulation (ITEMS) Bioreactor developed by Tissue Growth Technologies filled with PBS at 37°C.  The bioreactor provided a 1Hz cyclic pressure change to the inside of the graft, where three different pressure levels of 90/50, 120/80, and 150/110 mmHg systolic/diastolic were investigated 2, 3.\nRepresentative Results",
    "When the electrospinning protocols are carried out correctly, the end product should be a soft, seamless tube with no initial signs of delamination between the layers.  When the uniaxial tensile tests, burst strength tests, suture retention tests, and compliance tests are performed, the results should indicate that as the medial layer stiffness is increased, with decreased amounts of elastin, the associated mechanical properties should demonstrate a stiffer tube.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}