{
  "id": 19362,
  "origin_website": "Jove",
  "title": "Abdominal Massage to Improve Motor Dysfunction in Rats with Cerebral Palsy",
  "procedures": [
    "The Animal Ethics Committee of Jinshan Hospital, affiliated with Fudan University in Shanghai, approved this study. Young Sprague Dawley (SD) rats were raised in an SPF animal room with light from 08:00 to 20:00, darkness from 20:00 to 08:00, temperature controlled at 22 °C, and indoor relative humidity of 40%-50%. They had free access to food and water. All experimental operations on animals comply with the welfare ethics of experimental animals and animal experimental safety regulations.\n1. Neonatal hypoxic-ischemic encephalopathy animal model 21\nRandomly divide 18 Sprague Dawley (SD) rat male pups, 7 days after birth (P7), into the following groups: sham (no massage), model, and Massage (model + massage group) (n = 6 for each group).\nAnesthesia\n\t\nUse a small animal gas anesthesia machine to administer 5% sevoflurane gas, adjust the oxygen flow rate to 4, and use a 4% induction fraction to anesthetize the young rats. Confirm the animal is fully anesthetized by waiting for the point when the young rat is lying on its back, its limbs stop moving, there is no response when touched, and its muscles relax.\nAdd pet eye ointment and eye drops to the anesthetized young rats to prevent eye dryness.\nMicroscopic surgical process\n\t\nFirst, disinfect the neck skin of rats with iodophor once, then with 75% ethanol once (perform this procedure three times), and make a longitudinal incision ~0.5 cm long in the middle of the neck of the young rats. Separate the right subcutaneous tissue passively and expose the common carotid artery.",
    "Model and massage groups: Separate the common carotid artery and the vagus nerve carefully (Figure 1A). After splitting the common carotid artery, coagulate the common carotid artery with an electric coagulation gun. After confirming the absence of bleeding, suture the skin layer by layer and disinfect the surgical incision again (Figure 1C).\nSham group (No CP, no massage): Separate only the common carotid artery without any treatment of blood vessels. Suture the skin layer by layer and disinfect the surgical incision again. When observing the unrestricted crawling of the young rat, place the young rat back beside the mother rat.\nDisinfect with iodine after surgery. Place the rats that have completed the surgery on a 37 °C insulation pad and constantly observe whether the wound is bleeding and whether there is inflammation in the eyes.\nPlace the model and massage groups of young rats in an open hypoxia chamber and observe for 1 h until they awaken.\n\tNOTE: When the young rats can freely crawl, they are ready to undergo hypoxia treatment.\nHypoxia treatment\n\t\nAfter they recover from anesthesia, place the young rats in a closed anoxic device at 37 °C with 92% N2 and 8% O2 gas conditions (2 L/min) for 3 h of hypoxia. After the hypoxic treatment, place the awake young rat back beside the mother rat.\nDisinfect the surgical instruments and wipe the hypoxic chamber with alcohol. After the surgery, disinfect the young rat with iodophor, monitor the wound daily for signs of infection, and use sterile padding. Complete the entire surgical process in the SPF animal room and keep the animals in the SPF animal room.\nRaise the model group normally after the successful establishment of the model without any intervention measures. Subject the massage group to manual intervention after the completion of the modeling.",
    "NOTE: The sham group was fed normally and did not undergo hypoxia treatment.\nPlace each group of rats next to the mother rats on sterile and high-temperature sterilized bedding. Observe them for 1-2 h until the mother rats feed the offspring rats. Observe them every day to check whether the wound is bleeding and whether there is inflammation in the eyes; observe until the wound is completely healed.\n2. Massage technique parameters\nNOTE: The core techniques of massage include pressing and rubbing as the primary intervention techniques. Before the experiment, the researchers drew on the operation of a technique tester who collected techniques from the Tianjin abdominal massage expert Wang Jingui.\nSet the forces of pressing and rubbing to 6 N and 3 N, respectively22,23,24,25.\n3. Massage manipulation\nNOTE: Ensure that the researcher's thumb pressure on the acupoints is stable and long-lasting.\nOn the second day after the operation (P8), take the young rats out of the cage without disturbing the maternal rats. In the massage group, massage the rats from the 8th day of birth to the 40th day.\nBefore massaging the young rats, rub hands slightly to warm them up to almost the same temperature as the skin of the young rats.\nFollow this sequence of Massage: Limb Acupoints → Abdomen Acupoints → Abdomen.\nPlace the young rat in the palm of the left hand, and gently touch the back of the young rat from head to tail with the thread surface of four fingers for 1 min to make it quiet.\nPerform the following rubbing steps.\n\t\nRub the abdomen of the right thumb and forefinger back and forth.\nRub the forelimb, from the proximal end to the distal end for ~30 s. Press Quchi (LI11), Waiguan (SJ5), and Hegu (LI4) points 10x for 1 s each time.",
    "Rub the hind legs, from the proximal end to the distal end for ~30 s, and press Yanglingquan (SP9), Zusanli (ST36), Sanyinjiao (SP6), and Taichong (LR3) points 10x for 1 s each time for a total period of ~5 min.\nUse the right thumb to press Zhongwan (RN12), Tianshu (ST25), Guanyuan (CV4), and Qihai (CV6). Press each acupoint 10x, each time for ~1 s, lasting for 1 min.\nKeep the young rat prone, and press and rub the Zhongwan point on the abdomen with the right thumb. Take the navel of the young rat as the center and use the thumb to move clockwise 120x/min for ~5 min.\nFinally, use the thread surface of the four fingers of the right hand to gently touch the head of the young rat to its tail, make it quiet, then place it back in the cage, and allow the mother rat to feed it.\n4. Acupoint localization\nNOTE: For rats born within 2 weeks, the weight and length of the rats are the same as those of the mice. Therefore, we used mouse massage methods in relevant literature to massage the rats during the 8-15 days of the rats24.\nTwo weeks to 40 days later, treat the rats with regular rat massage using the following acupoints: LI11, SJ5, LI4, SP9, ST36, SP6, LR3, RN12, ST25, CV4, and CV626.\n\t​NOTE: See Table 1 and detailed descriptions of rat acupoint localization elsewhere26 and Figure 2 for the specific positions of the acupoints.\n5. Weight and behavioral test\nWeigh the young rats daily from P7 to P40.\nConduct behavioral experiments on the balance beam at P37 to P40. Test the motor balance function of young rats using a balance beam (35 cm long, 1.5 cm wide, and 100 cm high).",
    "Place the young rat on the balance beam and let it run into the black box placed at the other end of the balance beam.\nConduct balance beam training for the young rats on P37-P39, 3x a day, and conduct a test on P40. Record the time when the three groups of young rats pass the balance beam and the number of times their hind limbs slip (Figure 1D).\n\t\tNOTE: Use the carbon dioxide suffocation method to euthanize rats."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}