{
  "id": 19317,
  "origin_website": "Jove",
  "title": "Monitoring Fine and Associative Motor Learning in Mice Using the Erasmus Ladder",
  "procedures": [
    "In the current study, adult (2-3 months old) C57BL/6J mice of both sexes were used. Animals were housed two to five per cage with ad libitum access to food and water in an animal unit under observation and maintained in a temperature-controlled environment on a 12 h dark/light cycle. All procedures were conducted in accordance with the European and Spanish regulations (2010/63/UE; RD 53/2013) and were approved by the Ethical Committee of the Generalitat Valenciana and the animal welfare committee of the Universidad Miguel Hernández.\n1. Behavioral room setup\nReserve the behavioral testing room every day at the same time and establish the list and order of mice to be used, as well as arrangements for their hosting.\nKeep the experimental mice outside the testing room so they do not hear the sounds of the air compressor and Erasmus Ladder tones when not being tested.\nCheck that all components of the Erasmus Ladder system are in order and ready to use: the network router, the computer with the software (see Table of Materials), the air compressor, two goal boxes, and the ladder with the rungs properly positioned.\nExtensively clean the goal boxes, ladder, and rungs with water after each animal and with water and 70% ethanol at the end of each training day.\n2. Behavioral test protocol\nCreate an experiment and enter the protocol into the software (Supplementary Figure S1).\n\t\nTurn on the software.\nTo create an experiment, choose File | New experiment | New or Set up | Experiment protocol.\n\t\tNOTE: The default protocol, used in this study, is named EMC and was designed at Erasmus University Medical Center, Rotterdam.\nGive the experiment a name and click OK.",
    "Check that the default EMC protocol selected consists of 4 days of undisturbed sessions (42 undisturbed trials per day) and 4 days of challenge sessions (42 daily mixed trials: undisturbed, CS-only (tone), US-only (obstacle), Paired (obstacle announced by tone) (see Figure 1B). In the right side panel, also check the light cue (3 s maximum duration), air cue (45 s maximum duration), and tailwind (Yes in all the trial types), used to encourage the mouse to cross the ladder, and the tone (250 ms, Yes only in CS-only and Paired trials).\nTo create a different protocol, choose Set up | Experiment protocol | New | From scratch or Copy from the EMC protocol and simply modify it, editing the table lines related to number of sessions (days of experiment) and number and type of trials per day.\n\t\tNOTE: Resting time, cues type and activation, duration, intensity, and interval can also be adapted according to the experimental questions.\nTo open the session list and name the subjects, choose Setup | Session List.\nClick on Add Subjects and Variables.\nEnter each specific Mouse Identifier, Birth Date, Sex, Genotype, and relevant categories, following the ordered list of mice.\nStart the session (Supplementary Figure S2).\n\t\nBefore starting, check that the software is open, then turn on the Ladder.\nCheck that the air compressor is connected and switched on.\nTo open the Acquisition window, open the Experiment created.\nChoose Acquisition | Open Acquisition.\nPlace the mouse with the identifier indicated by the software in the starting goal box (right side of the ladder).\nSelect the mouse identifier to acquire in the first session.\nClick on Start Acquisition.",
    "Press the red ladder menu knob 3x. Check that the session starts and automatically controls and records mouse movements until the end of the last trial of the session.\nEnd the session.\n\t\nCheck that at the end of the 42nd trial, the display shows the messages Sending Data and Acquired.\nReturn the mouse to the home cage.\nClean the ladder and the goal boxes.\nPlace the next mouse and repeat from step 2.2.6 onwards.\nPerform the selected type of session every day until the end of the protocol. Repeat steps 2.2 and 2.3 every day according to the selected protocol.\nExport the data (Supplementary Figure S2).\n\t\nTo visualize the recorded data, choose from the Analysis menu, Trial Statistics, Session statistics, and Group Statistic & Charts.\n\t\tNOTE: Data can be downloaded as a spreadsheet with data for individual trials and the means of the same trial types within a session. Sessions can also be filtered by variables chosen for specific analysis.\nClick on the Export button at the top-right corner choosing the file format (spreadsheet) and folder location.\nRight-click on the automatically generated charts and select Save to File as *.jpg.\n3. Data analysis\nNOTE: A list of parameters is automatically measured by the Erasmus Ladder based on the instantaneous recording of the activities of the touch-sensitive sensors. For analysis, output parameters selected by the user are organized and processed in the spreadsheets. Along with the software-generated graphs, users can generate graphs using the graphing software of choice to visualize specific changes in different parameters over sessions.\nChoose specific parameters to analyze basal motivation or anxiety states, sensory responses, motor performance, and fine motor learning over the first 4 days.",
    "Select and plot control parameters, including resting time in the goal box and time to exit the goal box after the resting period in response to light and air cues (Figure 2A).\n\t\tNOTE: Resting times or response to cues are relatively constant in WT mice. Other parameters such as frequency of exits are basically negligible in WT mice-the animals rarely leave the rest box without the cues or come back once in the ladder, resulting in frequencies of exit equal to 1 per trial. If an animal goes out before cues are applied, an airflow gets activated forcing the mouse to return to the goal box; this is not counted as a trial by the software.\nSelect and plot the time on ladder after cues, measured as the time spent crossing the ladder once the mouse leaves the goal box (Figure 2B).\n\t\tNOTE: A power non-linear regression is a robust method for evaluating learning. The Pearson or Spearman coefficients (R) will provide a measure of whether the data fitting is good (R values close to one when the animals learn/improve over sessions; R values close to 0 imply that the data are constant and mice do not learn).\nSelect and plot stepping pattern parameters such as the percentage of trials with missteps as a sensitive learning parameter (Figure 2C).\n\t\t\nDefine a correct step as a step from a high rung to another high rung (H-H), irrespective of the length of the step. Consider step types that involve a lower rung as missteps.\nDivide correct steps and missteps into short and long steps, backsteps, and jumps depending on the length and directionality of the step between the rungs pressed (see Figure 1A).",
    "Select and plot specific parameters to evaluate challenged motor learning (US-only trials) and associative learning (paired trials) over the last 4 days.\n\t\nSelect and plot the time on ladder after cues (Figure 3).\nSelect and plot the percentage of trials with missteps (Figure 4A).\nSelect and plot the pre and post perturbation step times, defined as a ms precision difference between rung activation just before (control step) and after the obstacle (adapted step) on the same side of the ladder (Figure 4B).\n\t\tNOTE: Pre vs post-perturbation step times analysis should be performed to compare data inside each type of session. The parameter measures the ability of the mice to predict and overcome the obstacles during associative learning.\nAnalyze the data with dedicated statistical software (e.g., SigmaPlot). Perform a power non-linear regression analysis of data collected from the same trial type across sessions to describe the learning process more efficiently and use Two-Way Repeated Measures (RM) ANOVA to compare between trial types.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}