{
  "id": 8572,
  "origin_website": "Jove",
  "title": "The Detection of 5-Hydroxymethylcytosine in Neural Stem Cells and Brains of Mice",
  "procedures": [
    "All the animal procedures have been approved by the Animal Ethics Committee of Zhejiang University.\n1. The Culture of Adult Neural Stem Cells and Neurons\nIsolate adult neural stem cells from the forebrain of an adult (8-10 week old) C57/BL6 male mouse as described previously31,32.\nCulture adult neural stem cells in DMEM/F-12 medium containing 20 ng/mL FGF-2, 20 ng/mL EGF, 2% B27 supplement, 1% antibiotic-antimycotic, and 2 mM L-Glutamine in a 5% CO2 incubator at 37 °C. Induce the differentiation of adult neural stem cells with 1 µM retinoic acid and 5 µM forskolin for 48 h as described previously31,32.\nIsolate neurons from the embryonic day 17 (E17) hippocampi of the mouse and culture with neurobasal medium containing of 0.25% L-Glutamine, 0.125% GlutaMax and 2% B27 supplement in a 5% CO2 incubator at 37 °C as previously described33.\n2. Transcardial Perfusion of the Mouse\nPrepare 10% chloral hydrate, 4% paraformaldehyde (PFA) and phosphate buffered saline (PBS) one day before the experiment, and store at 4 °C.\nAnesthetize an adult male or female C57 BL/6J mouse with 10% chloral hydrate (50 mg/kg, i.p.), and ensure that the animal is deeply anesthetized by checking the body reaction. Fix each limb with sticky tape on a plastic board (in a face-up position).\nCut the skin and then the muscle with surgery scissors. Open the thoracic cavity with a surgical scissor. Expose the heart and cut off a little part of the right atrium with a fine surgical scissor.\nPerfuse the mouse with a 10 mL disposable sterilized syringe from the left ventricle with cold PBS (around 30 mL per adult mouse).\nPerfuse the mouse with 4% PFA (around 30 mL in 10 min per adult mice) until it is stiff.",
    "Open the skull of the mouse with bone forceps. Remove the brain and put into 5 mL of 4% PFA in a 15 mL centrifuge tube for post-fixation at 4 °C.\nNOTE: Clean the surgical area after surgery has finished.\nAt least 24 h later, transfer the brain samples into a 30% sucrose solution for complete dehydration at 4 °C.\n3. Brain Sectioning\nEmbed the brain samples in optimal cutting temperature compound (OCT) in a small container, and cool down at -20 °C for at least 1 h.\nSection brain samples at a thickness of 20-40 μm with a cryostat microtome.\nCollect sections into PBS and store at 4 °C.\n4. Immunofluorescence Staining\nPick up the sections with the targeted brain regions and put them into a 24-well plate with PBS. For cultured cells on a coverslip, go directly to step 4.2.\nWash with PBS on the shaker at room temperature for 10 min. Repeat this twice more.\nRemove PBS, and treat with preheated 1 M HCl for 30 min at 37 °C.\nNOTE: Prepare 1 M HCl by adding 1 mL of hydrochloric acid (36-38%) into 10 mL of water in a chemical hood. Preheat 1 M HCl in the incubator at 37 °C.\nWash the samples with PBS for 5 min. Repeat this twice more.\nBlock samples with PBS containing 3% normal goat serum and 0.1% Triton X-100 for 1 h on the shaker at room temperature.\nIncubate sections with specific primary antibodies overnight at 4 °C on the shaker.\nNOTE: Use the following primary antibodies: polyclonal rabbit antibodies anti-5-hydroxymethylcytosine (1:5,000), mouse monoclonal antibody anti-NeuN (1:500).\nTake out the samples, and further incubate at room temperature for 1 h.\nWash the samples with PBS for 10 min. Repeat this twice more.",
    "Incubate with secondary antibodies corresponding to the primary antibodies at room temperature for 1 h on the shaker. Cover the plate with aluminum.\nNOTE: Use the following secondary antibodies: Alexa Fluor 488 goat anti-rabbit IgG (1:500), Alexa Fluor 568 goat anti-mouse IgG (1:500). Counterstain nuclei with 4′-6-diamidino-2-phenylindole (DAPI).\nWash the samples with PBS for 10 min on the shaker. Repeat this twice more.\nMount brain sections onto the slides, add proper amount of antifade mounting medium (around 100-150 μL), and cover with premium cover glass. Seal with nail polish.\nTake images with a regular or confocal fluorescence microscope.\n5. Genomic DNA Isolation\nEuthanize an adult C57 BL/6J mouse (male or female) by cervical dislocation and remove the brain.\nDissect the hippocampus, cortex and cerebellum tissues on an ice-cooled dish. Grind tissues with a tissue grinder in 1 mL of DNA lysis buffer and transfer into clean microcentrifuge tube. Add 250 μg of proteinase K per 600 μL of lysis buffer. For cell pellets, directly add lysis buffer, proteinase K, and mix thoroughly.\nNOTE: Prepare DNA lysis buffer: 5 mM EDTA, 0.2% SDS, 200 mM NaCl in 100 mM Tris-HCl, pH 8.5. Wash and autoclave the tissue grinder before the experiment.\nThe second day, add about 50 μg of RNase A per sample for at least 12 h at 37 °C.\nAdd an equal volume of phenol:chloroform:isoamyl alcohol (25:24:1) and mix completely.\nCentrifuge at 20,817 x g for 15 min, and remove the supernatant into a new microcentrifuge tube.\nAdd 600 μL of chloroform to the supernatant to precipitate DNA, and mix thoroughly.\nCentrifuge at 20,817 x g for 15 min, and remove the supernatant into another new tube.\nAdd 500 μL of isopropanol to the supernatant, and mix thoroughly.",
    "Centrifuge at 20,817 x g for 15 min, and remove the supernatant completely.\nWash the precipitation with 1 mL of 70% ethanol, centrifuge at 20,817 x g for 1 min, and remove the supernatant completely. Repeat once.\nDry the DNA pellet completely.\nDissolve DNA pellet with Tris-HCl buffer (pH 8.5) to the proper concentration.\n6. DNA Dot Blot\nPrepare the solutions: 2 M NaOH, Tris-HCl buffer (pH 8.5), 6x saline sodium citrate (SSC).\nMake the sample mixture as Table 1.\nDenature DNA samples at 100 °C for 10 min, and cool down on ice.\nCut the proper size of nylon membrane (e.g., Hybond-N+) and rinse with 6x SSC.\nPut the membrane on dot-blot apparatus and connect to the vacuum pump. Spot 6 μL of mixture per dot onto the membrane.\nHybridize for 30 min at 80 °C, and block the sample membrane with fat-free milk in Tris-buffered saline (TBS) for 1 h.\nIncubate with primary antibody at 4 °C overnight.\nNOTE: the following primary antibody: polyclonal rabbit anti-5-hydroxymethylcytosine (1:5,000).\nOn the second day, incubate the sample membranes at room temperature for 1 h. Wash with TBS for 10 min. Repeat this wash twice more.\nIncubate the membrane with anti-rabbit secondary antibody (1:5,000) for 30 min at room temperature.\nWash with TBS for 10 min. Repeat this wash twice more.\nVisualize the chemiluminescence signals, and quantify signal intensities.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}