{
  "id": 4068,
  "origin_website": "Cell",
  "title": "An optimized protocol with a stepwise approach to identify specific nuclear receptor ligands from cultured mammalian cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn vitro recombinant luciferase assay\nTiming: 30 min\nSome compounds may inhibit luciferase enzyme activity, leading to an artifactual decrease or increase of the bioluminescent reaction in transfected cells. An increased signal detection may be due to the stabilization of the enzyme by the tested compound, causing its accumulation in the cell. Upon addition of a large excess of luciferin to the cell lysate, the inhibitory compound is displaced and this generates a higher than expected bioluminescent signal independently of transcriptional regulation and thus incompatible with RN ligand identification (Thorne et al., 2010[href=https://www.wicell.org#bib10]). Thus, this first step allows the selection of the appropriate reporter gene assay [Luciferase or Secreted Embryonic Alkaline Phosphatase (SEAP)] for the next steps (CAR/PXR off target evaluation and targeted NR assay).\nPrepare working solution: dilute recombinant luciferase protein at 10 nM (final concentration) into LAS solution supplemented with 10 μM ATP (final concentration, 1: 1,000 dilution).\nDilute 1:2, 1:20 and 1:200 luciferase inhibitor II stock solution in DMSO to obtain 100× concentrated solutions (1 mM, 100 and 10 μM).\nDilute tested compounds in DMSO to obtain 100× concentrated solution (from 1 mM to 10 μM for example) (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nPrepare 100 μM Luciferin solution into LAS solution supplemented by 10 μM ATP. Protect from light until use.\nRecombinant luciferase activity determination (assay must be performed at least in triplicates for each condition):\nIn a white 96-well plate, add in this order:\n90 μL working solution\n1 μL DMSO [reference] or 1 μL 100× luciferase inhibitor II solutions (final concentrations 10, 1 and 0.1 μM) [positive controls] or 1 μL 100× tested drug solution (final concentration from 10 μM to 100 nM for example)\n10 μL of 100 μM luciferin solution (prepare in step 4).",
    "Shake the plate (directly in the luminometer if possible) and collect light signal with a luminometer (acquisition time 1 s).\nCritical: Since luciferin is light-sensitive, the tube containing the luciferin solution must be wrapped in an aluminum foil and the solution must be added to wells just prior reading. If the tested compounds act on luciferase activity, all further experiments must be carried out using the SEAP reporter construct [p(UAS)4-tk-SEAP].\nCAR/PXR activation assay\nTiming: 5 days\nThis step allows to comply with EMA and FDA recommendations (guideline to mitigate drug-drug interaction highly regulated by CAR and PXR) by determining the ligand-dependent activation of the xenobiotic receptors PXR (Pregnane X Receptor, NR1I2) and CAR (Constitutive Androstane Receptor, NR1I3) by the tested drugs (Berthier et al., 2012[href=https://www.wicell.org#bib1], Hering et al., 2018[href=https://www.wicell.org#bib3]).\nDay 1: Seed 106 HepG2 cells (use cells from 3 to 17 passage number) in 6-well plates using CG medium and incubate for 16 h at 37°C in a humidified atmosphere and 5% CO2.\nDay 2: Co-transfect cells with expression vector [pSG5-GAL4(DBD)-hPXR(LBD) or pGAL4-hCAR1 or pM (Gal4 empty control vector)], and the reporter vector(s) [p(UAS)4-tk-Luc and pRL (Luciferase) or [p(UAS)4-tk-SEAP (SEAP)].\nPrepare the transfection mix) (troubleshooting 3[href=https://www.wicell.org#sec6.5]):\nDNA mix: in 100 μL sterile 150 mM NaCl add 500 ng PXR, CAR or Gal4 empty expression vector, 1 μg of reporter vector (Luciferase or SEAP) and 100 ng of pRL (in case of luciferase assay). Vortex gently and spin down briefly using a bench top centrifuge.\nJetPEI mix: dilute 5 μL JetPEI transfection reagent in 100 μL 150 mM NaCl. Vortex gently and spin down briefly.\nAdd JetPEI mix to DNA mix, vortex the solution immediately and spin down briefly using a bench top centrifuge.\nIncubate at 20 to 22°Cfor 20 min.\nReplace medium by 2 mL fresh CG medium.",
    "Add the transfection mix to CG medium on cells and incubate for 24 h at 37°C and 5% CO2.\nDay 3: Seed transfected cells into white 96-well plate.\nWash cells with PBS (warmed at 37°C)\nAdd 200 μL trypsin-EDTA solution and incubate for 10 min at 37°C.\nAdd 2 mL TCS medium.\nResuspend cells with a Combitips® and distribute 100 μL of cell suspension in each well (∼4.5×104 cells per well).\nIncubate for 16 h at 37°C in a humidified atmosphere and 5% CO2.\nDay 4: Cell treatment is carried in triplicate using CT medium (prepare 400 μL [for 3wells] for each condition).\nFor CAR assay:\nCharacterization of potential CAR inverse agonist properties:\nPrepare 0.1% (v/v) DMSO (negative control)\nPrepare each tested drug (final DMSO concentration 0.1% v/v)\nCharacterization of CAR agonist properties:\nPrepare 10 μM PK11195 (reference for blunted-basal activity)\nPrepare 10 μM PK11195 with 5 μM CITCO (agonist positive control)\nPrepare 10 μM PK11195 with tested drugs.\nFor PXR assay:\nPrepare 0.1% (v/v) DMSO (negative control).\nPrepare 10 μM Rifampicin (positive control).\nPrepare each tested drug (final DMSO concentration 0.1% v/v).\nWash cells with PBS (37°C) and treat cells for 24 h with 100 μL of prepared solutions.\nDay 5: Determination of reporter activities using a luminometer plate reader (troubleshooting 4[href=https://www.wicell.org#sec6.7]):\nFor Luciferase assay, use the Dual-Glo® Luciferase Assay System according to the instructions provided by the manufacturer.\nFor SEAP assay, use the Great EscAPe™ SEAP Chemiluminescence Kit 2.0 according to the instructions provided by the manufacturer. For the signal normalization use the “in lab” protein quantification method.",
    "Critical: If more testing conditions are needed, increase the number of wells at day 1 and pool transfected cells before seeding into 96-well plate to have a homogenous transfected cell population. The human isoform hCAR1 is constitutively active in reporter gene assays, thus drugs must be tested alone to detect inverse agonist activity and in combination with the hCAR1 inverse agonist PK11195 in order to blunt its high basal activity and detect agonist activity.\nGFP-CAR nuclear translocation assay\nTiming: 4 Days\nThis step allows the identification of drugs able to activate the xenobiotic nuclear receptor CAR independently of direct ligand-receptor interaction, but rather by triggering its nuclear translocation through signal transduction pathway(s) activation (Koike et al., 2007[href=https://www.wicell.org#bib4]). It requires an epifluorescence microscope (excitation filter 485 ± 20 nm / emission filter 530 ± 25 nm).\nDay 1: Seed 2.5×106 HepG2 cells in 6 cm-diameter plate in CG medium and incubate for 16 h at 37°C in a humidified atmosphere and 5% CO2.\nDay 2: Transfect cells with the peGFP-hCAR1 expression vector.\nPrepare the transfection mix (troubleshooting 3[href=https://www.wicell.org#sec6.5]):\nDNA mix: dilute 5.5 μg peGFP-hCAR1 expression vector in 250 μL sterile 150 mM NaCl. Vortex gently and spin down briefly using a bench top centrifuge.\nJetPEI mix: dilute 11 μL JetPEI transfection reagent in 250 μL 150 mM sterile NaCl. Vortex gently and spin down briefly using a bench top centrifuge.\nAdd JetPEI mix to DNA mix, vortex the solution immediately and spin down briefly.\nIncubate the mix at 20°C–22°C for 20 min.\nReplace medium by 5 mL fresh CG medium.\nAdd the transfection mix on the cells and incubate for 24 h at 37°C.\nPre-cool for 16 h 24-well plate and pipette tip box at −20°C\nDay 3: Seed transfected cells into phenol red-free Matrigel-coated 24-well plate:",
    "Pre-coat plate with phenol red-free Matrigel: (troubleshooting 5[href=https://www.wicell.org#sec6.7])\nPlace pre-cooled 24-well plate, pipette tip box and 10 mL cold (4°C) phenol red-free DMEM on ice.\nThaw Matrigel aliquots on ice (2 mL for one full 24-well plate), mix gently and dilute 2 mL in 4 mL cold phenol red-free DMEM.\nAdd 200 μL diluted Matrigel in each well and incubate plate at 20°C–22°C for 1h\nSplit transfected cells.\nWash cells with pre-warmed PBS (37°C)\nAdd 500 μL trypsin-EDTA solution and incubate for 10 min at 37°C.\nAdd 5 mL TCS medium, resuspend cells with a Combitips®, count cells and dilute in TCS medium to reach 100,000 to 200,000 cells per mL.\nRemove excess Matrigel and wash carefully wells with pre-warmed PBS.\nAdd 1 mL cell suspension to each well.\nIncubate plate for 24 h at 37°C and 5% CO2.\nDay 4: Cell treatment and eGFP-hCAR1 subcellular localization determination\nCell treatment is processed in duplicate in CT medium:\nPrepare 2.5 mL 0.1% (v/v) DMSO (negative control).\nPrepare 2.5 mL 1 μM CITCO and 2.5 mL 1 mM phenobarbital (positive controls in 0.1% [v/v] DMSO).\nPrepare 2.5 mL of tested drugs at appropriate concentration with 0.1% (v/v) DMSO final concentration (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nWash cells with PBS and add 1 mL of “cell treatment” solutions.\nIncubate for 2 h at 37°C and 5% CO2.\nFor GFP-CAR subcellular localization:\nWash cells with PBS\nFix cells for 15 min with 1 mL 4% paraformaldehyde solution (work under a fume hood).\nWash fixed cell twice with 1 mL PBS.\nStain nuclei for 15 min with Hoechst-33258 (1:1000 in PBS)\nWash cells 3 times with PBS\nRemove PBS and add 1 droplet of fluorescent mounting medium. Cover with 12 mm diameter circular cover glasses.",
    "Visualize GFP and Hoechst signals with an epifluorescent microscope (excitation 485 nm / emission 530 nm for GFP and excitation 352 nm / emission 451 nm for Hoechst). Take 2 to 3 pictures of 3 different fields for each well (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nCritical: In contrast to endogenous hepatic CAR, overexpression of eGFP-hCAR1 in cancer cell lines give rise to an artifactual nuclear localization of the exogenous fusion protein (Figure 1[href=https://www.wicell.org#fig1] A, B and C). Thereby, in order to study a potential “compound-dependent” nuclear translocation, it is mandatory to first reversibly sequestrate the fusion protein into the cytoplasm. To do so, we developed the above described method based on culture plates pre-coated with Matrigel (Figures 1[href=https://www.wicell.org#fig1]D–1F). The unliganded-hCAR1 cytosolic-sequestration by the Matrigel is under the control of MEK1/2 kinases activation (for details, see “troubleshooting 5[href=https://www.wicell.org#sec6.9]” section of this protocol).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/779-Fig1.jpg\nFigure 1. Compound-dependent GFP-hCAR1 nuclear translocation\nTransfected cells were seeded on plastic (A–C) or on Matrigel-coated wells (D–F). After a 24 h incubation, cells were treated for 2 h with 0.1% DMSO (A and D), 1 μM CITCO (B and E) or 1 mM phenobarbital (C and F). The green signal corresponds to GFP-hCAR1 and the blue signal shows nuclei staining by Hoechst-33258. Scale bar: 10 µM\nTargeted nuclear receptor assay: The NR1D1 mammalian two-hybrid assay as an example\nTiming: 5 days",
    "This step allows the identification of potentially specific ligands for the targeted NR. In this protocol, we describe as an example the procedure allowing the identification of REV-ERBα (NR1D1) ligands using a mammalian two-hybrid system (for full description, see Hering et al., 2018[href=https://www.wicell.org#bib3]). Briefly, REV-ERBα interacts with NCoR1 to repress target gene expression. The two-hybrid system is based on this interaction, thus cells are co-transfected with pGal4-hREV-ERBα and with pVP16-NCoR. The pVP16-NCoR vector codes for a fusion protein composed by the NR-interaction domain of NCoR1 fused to the transactivation domain of the VP16 virus. The ligand-dependent activation of Gal4-REV-ERBα allows the recruitment of VP16 through its interaction with NCoR and activates reporter gene expression.\nDay 1: Seed 106 HepG2 cells in 6-well plate using CG medium and incubate for 16 h at 37°C in a humidified atmosphere and 5% CO2.\nDay 2: Co-transfect cell with expression vectors [pGal4-Rev-erbα or pM (Gal4 empty control vector) and pVP16-NCoR], and reporter vector(s) [p(UAS)4-tk-Luc and pRL (Luciferase) or [p(UAS)4-tk-SEAP (SEAP)].\nPrepare the transfection mix (troubleshooting 3[href=https://www.wicell.org#sec6.5]):\nDNA mix: dilute 500 ng of each expression vector (pGal4-Rev-erbα [or pM] and pVP16-NCoR), 1 μg of reporter vector (Luciferase or SEAP) and 100 ng of pRL (in case of luciferase assay) in 100 μL sterile 150 mM NaCl. Vortex gently and spin down briefly using a bench top centrifuge.\nJetPEI mix: dilute 5 μL JetPEI transfection reagent in 100 μL 150 mM NaCl. Vortex gently and spin down briefly using a bench top centrifuge.\nAdd JetPEI mix to DNA mix, vortex the solution immediately and spin down briefly.\nIncubate mix at 20°C–22°C for 20 min.\nReplace medium by 2 mL fresh CG medium.\nAdd the transfection mix on the cells and incubate for 24 h at 37°C.\nDay 3: Seed transfected cells into white 96-well plate.",
    "Wash cells with pre-warmed PBS (37°C)\nAdd 200 μL trypsin-EDTA solution and incubate for 10 min at 37°C.\nAdd 2 mL TCS medium\nResuspend cell with a Combitips® and distribute 100 μL of cell suspension in each well (∼4.5×104 cells per well).\nDay 4: Cell treatment is processed in triplicate using CT medium (prepare 400 μL for each condition).\nPrepare 0.1% (v/v) DMSO (negative control).\nPrepare 10 μM GSK 4112 (positive control).\nPrepare each tested drug (final DMSO concentration 0.1% v/v) alone\nPrepare each tested drug in combination with 10 μM GSK 4112 to evaluate the potential antagonist properties of compounds.\nWash cells with pre-warmed PBS (37°C) and treat cells for 24 h with 100 μL of prepared solutions.\nDay 5: Determination of reporter activities using a luminometer plate reader (troubleshooting 4[href=https://www.wicell.org#sec6.7]):\nFor Luciferase assay use the Dual-Glo® Luciferase Assay System using instructions provided by the manufacturer.\nFor SEAP assay use the Great EscAPe™ SEAP Chemiluminescence Kit 2.0 using instructions provided by the manufacturer. For signal normalization, use the “in lab” protein quantification method.\nNote: Mammalian two-hybrid systems should be preferred when the targeted NR possesses a repressive activity, such as REV-ERBs (NR1D1 and NR1D2). However, mammalian one-hybrid system (with only Gal4-NR and UAS-driven reporter vectors) should be chosen when the NR target has a ligand-dependent transactivation activity."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Cell-Based Assays",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}