{
  "id": 17135,
  "origin_website": "Jove",
  "title": "Echocardiography Recording in Awake Miniature Pigs",
  "procedures": [
    "The building and use of the echocardiography cart were conducted in compliance with the animal handling and training standards of the University of Utah's Institutional Animal Care and Use Committee.\n1. Considerations for building the echocardiography cart\nBuild a contraption that allows access to lateral and ventral standing echocardiography imaging windows.\nUse a cart with tall sides, front, and back to prevent the pigs from climbing or jumping out during echocardiography.\nUse a length- and width-adjustable cart to accommodate pigs of various sizes and ages; however, in research studies in which all pigs are of the same size, breed, and age, this may not be necessary.\nProcure a non-slip ramp for mounting and dismounting the cart. Pigs prefer to walk forward, so a backward dismount is undesirable. In this example, a detachable ramp was utilized, such that it could be disconnected from one end after mounting the cart and then moved to the other end of the cart for dismounting.\nUse a wheeled cart with locking wheels as this allows the contraption to be moved from storage to the animal room.\nTo comply with vivarium cleaning and disinfection standards, use plastic, metal, and rubber material.\nFinally, include a detachable feeding trough to the front of the cart to provide the pigs with a distraction during the echocardiography.\n2. Cart-building specifications\nNOTE: The pigs utilized in our study were Yucatan and Gottingen miniature pigs aged 5-10 months old, and, therefore, our cart was constructed with this size in mind.\nWhile a similar structure could be built from scratch, to decrease some of the building work, start from a premade heavy-duty utility cart (Figure 1). Locking wheels are recommended.",
    "Saw off and remove the front and back of the utility cart, and replace with gates constructed of PVC pipe and chain link. Use the chain link material for hanging a food trough using hooks or carabiners (Figure 2). With the removal of the front and back, the integrity and holding strength of the plastic are reduced, so for larger and heavier pigs, reinforce with metal bars on the undersides of the cart shelves.\nCreate an aperture on the top floor of the cart that is large enough to pass a hand holding an ultrasound probe. Retain a plastic cover piece fitted to the top of the aperture, which can be removed for subxiphoid echocardiography access once the pigs are safely standing in the cart (Figure 3).\nAs a custom fit, use aluminum stock (e.g., square tube, bar, and sheet metal) to build a metal mount/dismount ramp with reinforcements to attach to the modified cart at certain attachment points. Add removable rubber padding for grip using bolts and grommets (Figure 4).\nCreate a hinge mechanism for the side gates, with simple pins used to narrow the pig standing area for improved restraint (Figure 5). This provides a snug fit for the pig within the cart and ensures the pigs are restrained in a forward-facing direction without the ability to turn around.\n3. Training the minipigs to stand in the cart\nPigs must be trained to eat from the trough for a prolonged period of time, walk up the ramp, and walk down the ramp.",
    "Filling the trough with a frozen treat prolongs the pigs' standing time. Use combinations such as juice, meal replacer drink, or yogurt with cereal and standard chow, biscuits, and/or fruit bars. Freeze these combinations together to create long-lasting frozen treat troughs (Figure 6). Another option to consider is to withhold the animal's normal meal and instead feed it in the trough in the cart during the echocardiography period.\nPrior to teaching the pigs to eat the frozen treats in the contraption, introduce the frozen treat troughs on the ground, encouraging the recognition of the trough as providing a high-value treat.\nTrain the pigs to accept standing echocardiograms for 5-7 days, with one training session per day. Perform the following steps to do this.\n\t\nIntroduce the pigs to the cart by surrounding the cart with high-value treats (biscuits or cereal) for 1-2 days.\nIntroduce the pigs to the ramp for 1-2 days by placing high-value treats along the ramp and providing additional rewards when the pigs walk up the ramp.\nAllow the pigs to stand on the cart without engaging the side restraints or gates (which can induce fear), and provide frozen treat troughs at the front gate for 2-3 days. During the last 1-2 days, while the pigs eat from the troughs, place the ultrasound probe with ultrasound gel on the pigs to accustom them to the sensation of contact with the probe.\nAfter this training regimen, the pigs will easily allow the restraints and gates to be closed and ultrasound to be performed for the acquisition of echocardiography imaging.\n4. Image acquisition\nObtain images in the echocardiography cart, which allows probe positioning in the following positions, as described below.",
    "Take images through the sides of the cart to the right and left axillae. These positions are used to obtain the right and left parasternal imaging planes.\nTake images through the floor of the cart to the subxiphoid region to obtain apical views.\nTake images for both B-mode and M-mode imaging from these standing positions.\nFor a mock awake echo recording procedure, see Video 1. In the video, the animal subject is represented by a real-sized minipig doll, constrained like a real minipig with limited moving room in the cart. The best access window and positioning of the recording echocardiography probe are also shown."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}