{
  "id": 8534,
  "origin_website": "Jove",
  "title": "Wireless Electrophysiological Recording of Neurons by Movable Tetrodes in Freely Swimming Fish",
  "procedures": [
    "All surgery procedures must be approved by the local ethics committees on animal welfare (e.g., IACUC).\n1. Construction of the Microdrive Housing\nTo construct the housing, cut a 1 mm wide brass plate into a 19 mm x 29 mm x 1 mm plate using a saw. Cut two 5.5 mm slits on each of the long sides perpendicular to the edge, such that each slit is 6.5 mm away from the narrow sides (Figure 2A).\nUsing pliers, fold the area between the slits on the long sides inward, then fold the bottom part inward and the upper side outward to obtain the housing (Figure 2B,C).\nUsing a 3 mm drill bit, make holes for screws in the microdrive housing.\nNOTE: These holes will be used later to attach the housing to the logger box (Figure 2D).\nSolder the sides of the housing.\nUsing a fine circular file, generate a small, 1.5 mm in radius, semicircular slit at the bottom of the housing (Figure 2E).\nNOTE: This will be used later to insert the stainless steel tube to guide the electrodes.\nUse a 1 mm drill bit to make a hole in the back of the housing for the tetrodes (Figure 2F).\nNOTE: A 3D model of the housing is found in the Supplementary housing.stl file.\n2. Construction of the Microdrive\nUsing a cutter, break off a three-pin piece from a single row male pin header strip (Figure 1H). Using pliers, pull out the middle pin.\nUsing a cutter, cut the remaining pins to 10 mm in length (2 mm less than the screw length). Another possibility is to use a longer screw (see step 2.4).\nDrill a hole using a #65 drill bit through the middle pin hole. Drill a thread using a 00−99 tap.",
    "Assemble the microdrive and the brass plates (7.5 mm x 2.5 mm x 0.6 mm, see Supplementary Figure 4) such that the brass plates are touching the pins. Insert a screw (#00-90 round head, 12 mm, brass) through the first brass plate, then through the pin header thread and the second brass plate. Finally, place a nut on the screw and gently tighten the assembled microdrive.\nSolder the pins together with the brass plates, and the nut with the tip of the screw.\nSolder the microdrive into the microdrive housing at four points on the sides of the microdrive brass plates.\nCut one stainless steel tube 6 mm long with an inner diameter of 1.5 mm and another stainless steel tube 3 mm long with an inner diameter of 1.2 mm. Polish the ends of the tubes to avoid sharp ends.\nGlue the 6 mm long tube to the small semicircular slit at the bottom of the microdrive housing using epoxy. Glue the 3 mm long stainless steel to the pin header, lined up with the 6 mm long tube on the housing.\nCut two 5 cm long silicone tube segments with diameter of 0.64 mm and one 5 cm long polyimide tube with diameter of 0.250 mm.\nInsert the three tubes into the two stainless steel tubes. Glue the tubes to the stainless steel tube attached to the pin header using cyanoacrylate glue. Screw the microdrive all the way up and cut off the excess tubing from the top and bottom of the two steel tubes.\nNOTE: The microdrive with the housing is now ready for use (Figure 1C).\n3. Preparing the Tetrode Array",
    "To fabricate a two-tetrode implant with four electrodes on each tetrode, prepare eight wires, each 12 cm long, Formvar insulated, out of 25 µm diameter tungsten wire.\nNOTE: The same design can accommodate four tetrodes.\nPlace a holder for a 16-channel electrode interface board (EIB-16) PCB (see Table of Materials) under the microscope.\nUsing a soft tipped tweezer and a lighter, remove the coating off each of the eight wires on one side using the flame.\nNOTE: This is to ensure that the wire will be properly connected to the PCB connector later on.\nPush a wire into one of the holes in the EIB-16 with the coated side in the hole. Place a pin and press it using pliers. Check the connectivity by measuring the resistance between the pin and the uncoated side of the wire.\nNOTE: The resistance is on the order of tens of Ohms.\nRepeat step 3.4 with all eight wires.\nTape two groups of four wires together using duct tape at the end of each wire.\nNOTE: Each group will be glued together later to form a tetrode.\nCut one piece of tungsten wire 12 cm long with a 50 µm diameter. Connect it to one of the EIB-16 connections.\nNOTE: This wire will serve as the reference electrode.\nCut two bare silver wires 12 cm long with a 75 µm diameter that will serve as grounds for the recording logger. Solder the two wires to the ground connection in the EIB-16.\nHold the EIB-16 above a motorized turning device and place the duct tape end of one group of four wires on the motorized tuning device. Apply 130 rounds clockwise followed by 20 counter- clockwise rotations. Apply cyanoacrylate glue to cover the tetrode.",
    "Wait for the glue to cure. Cut the tetrode close to the duct tape.\nRepeat steps 3.9 and 3.10 with the second tetrode.\nNOTE: This produces the finished two-tetrode array (Figure 1D).\n4. Assembling the Implant\nScrew the microdrive all the way down.\nUsing 1 x 3M Phillips round head screws, attach the EIB-16 to the PVC plate.\nUsing soft end tweezers, pull all the tetrodes and wires through the hole in the front of the logger box cover.\nUsing the 2 x 6M Phillips flat head screws, attach the PVC plate to the logger box cover. Keep the EIB-16 connector in the correct orientation so that the logger can be mounted on the EIB-16. Make sure the EIB-16 is fixed in place to avoid motion artifacts in the recorded signal.\nSeal the wires to the box using epoxy. Apply as little as possible because the primary sealing will be done by room temperature vulcanizing (RTV) later on.\nAttach the microdrive housing to the logger box cover using 2 mm screws.\nThread the tetrodes and all wires through the hole at the back of the microdrive housing. Thread the tetrodes through the two silicone tubes in the microdrive. Thread the 50 µm tungsten wire through the polyimide tube in the microdrive.\nGlue the tetrodes and wires to their tubes by applying cyanoacrylate glue to the top end of the tubes, to ensure the movement is consistent with the microdrive. Screw the microdrive all the way to the top.\nApply soft petroleum (see Table of Materials) on the exposed tetrode and wires inside the microdrive housing to prevent motion.",
    "Cut a 12 mm x 14.5 mm Petri dish bottom window using a heated razor blade. Attach the window to the front of the microdrive housing with epoxy. Keep the ground wires outside the window.\nApply RTV coating to the exposed tetrodes and wires between the logger box cover and the microdrive housing.\nAfter the RTV is cured, close the box with a small weight inside, and submerge in water overnight to ensure there is no water leakage into the box.\nCut the tetrodes and reference wire to the desired length using sharp scissors.\nAttach the marked extruded polystyrene foam (see Table of Materials) to the box. Adjust its size so its buoyancy is balanced when submerged in a water bath.\nDip the tetrode tips in platinum black solution and use a direct current (-0.2 µA) to coat the electrodes and set the electrodes' impedance as desired. Use a multielectrode impedance tester (see Table of Materials) for coating and impedance measurements.\nNOTE: In the goldfish pallium, a value of 40 kOhm is best. Depending on the application, the electrode impedance can be adjusted by modifying the platinum black coating10,11.\n5. Anesthesia Preparation — 1% MS-222 Stock Solution\nCAUTION: Anesthesia preparation includes the use of powdered MS-222, a carcinogen. Hence, steps 5.2 and 5.3 must be done in a chemical hood using gloves.\nAdd 100 mL of water to a tube that can contain more than 100 mL.\nIn a chemical hood, place a disposable weighting plate on a scale. Add 1 g of MS-222 powder using a spatula, then add the powder to the tube.\nShake the tube well.\nNOTE: In liquid form, MS-222 can be used outside the chemical hood wearing gloves but does not require a mask.",
    "Place a disposable weighting plate on a scale. Add 2 g of sodium bicarbonate using a spatula, then add the powder to the tube. Shake the tube well.\n6. Preparing the Fish Skull\nNOTE: At this stage, the fish is ready for implant surgery. Prior to surgery, make sure that all components and supplies have been sterilized by the appropriate procedures. For this step, an out of water U-shaped fish holder is needed. In this protocol, an aluminum holder that fits a 15 cm head to tail long goldfish is used. This system holds the fish out of water while perfusing the gills with oxygenated water. For details see Vinepinsky et al.8.\nPlace the fish in a 0.02% MS-222 water bath for 20 min until the fish is asleep.\nUsing sterile gloves, take the fish out of the water and place it in the holder.\nNOTE: The oxygenated water perfusing the fish contains MS-222 at a concentration of 0.02%, so that the fish remains anesthetized during surgery.\nUsing a sterile spatula, apply lidocaine 5% paste on the skin above the designated place for surgery for 10 min, then remove the lidocaine.\nNOTE: Consult an appropriate brain atlas to target the specific brain region.\nUsing a sterile 15 blade scalpel, remove the skin above the skull in the region of implant.\nUsing a dental drill with 0.7 mm drill bits, drill 4 holes in the skull. Insert a 1 mm screw (3 mm long) into each hole and apply cyanoacrylate glue on the holes right before inserting the screw.\nUsing a dental burnisher, apply dental cement on the screws and on the periphery of the exposed skull.",
    "Using the dental drill, make a 5 mm diameter hole in the skull above the brain region of interest. Remove the fatty tissue between the skull and the brain and expose the brain region target using fine tweezers and soft tissue paper. Be careful not to damage the large blood vessels underneath the skull.\nNOTE: By the end of this stage, the fish is prepared to implant the probe. Only the main steps specific to this protocol are described here. Several postoperative procedures (such as detailed documentation on the animal's health and sterilization of the surgery tools and area) are not presented or discussed because they are applicable to all surgeries with fish or small animals.\n7. Implanting the Probe\nNOTE: To complete the final step in the protocol, a manipulator that can hold the implant in place while it is inserted into the brain is needed.\nUse the manipulator to hold the logger box cover with the tetrodes pointing down toward the fish brain.\nBend the reference electrode such that when the tetrodes are lowered into the brain, the reference stays outside the brain.\nCut the grounds such that they fit into the skull. Optionally, connect one ground wire to one of the skull screws.\nLower the implant such that the electrodes are inserted into the brain while the bottom part of the microdrive housing is near the skull.\nStart attaching the implant to the skull by applying a small quantity of dental cement between the housing and the nearest skull screw.\nAfter the first part of the dental cement is cured, apply dental cement and close the hole above the skull and the entire exposed skull.\nNOTE: Usually several rounds of dental cement applications are needed in order to cover the entire exposed skull.",
    "Install the logger and the battery in the box and seal the box with all the screws.\nApply antibiotics and local painkillers according to the type of fish used for the experiments.\nFlush the fish's gills with fresh water until the fish starts to wake up. Remove the fish from the holder and place it back in its home tank.\nNOTE: The fish is fully recovered within 60 min after surgery.\nMake sure the fish is able to swim freely with the implant (Figure 3, Supplementary Video 1). If needed, readjust the size of the extruded polystyrene foam above the logger box such that the fish can balance easily.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}