{
  "id": 11074,
  "origin_website": "Jove",
  "title": "Investigating Receptor-ligand Systems of the Cellulosome with AFM-based Single-molecule Force Spectroscopy",
  "procedures": [
    "A schematic of the pulling geometry used in this work to probe the cohesin-dockerin interaction is shown in Figure 1A. The protein immobilization protocol reported here for cantilever and cover glass functionalization is a modified version of the procedure published previously27. The proteins were expressed from plasmid vectors in E. coli using conventional methods. The proteins were designed with a solvent-accessible thiol group, which was used in combination with maleimide chemistry to tether the protein via a stable thioether linkage to the cover glass surface and cantilever. The engineered cysteine residues in both the CBM-cohesin and xylanase-dockerin fusion proteins were located towards the N-terminal side of the proteins, away from the cohesin-dockerin binding interface11. A detailed overview of the chemical bonding employed in protein immobilization is shown in Figure 1B.\n1. Sample Preparation\nBuffers\nPrepare Tris buffered saline supplemented with calcium (TBS): 25 mM TRIS, 75 mM NaCl, 1 mM CaCl2, pH 7.2\nPrepare sodium borate buffer: 50 mM Na2B4O7, pH 8.5\n\t\tThe process flow diagram showing sample preparation steps is shown in Figure 2.\n\t\tWhen handling cantilevers and cover glasses, self-locking tweezers are recommended.\nAminosilanization of cover glass (approximately 1.5 hr)\n\t\nPlace cover glass (24 mm diameter, 0.5 mm thickness) in a PTFE holder.\nSonicate cover glass in 1:1 ethanol : ultrapure water (v/v) for 15 min.\nRinse cover glass with ultrapure water.\nPlace cover glass in piranha solution (1:1 H2SO4 (concentrated) : H2O2 (30%) (v/v)) for 30 min, then thoroughly rinse with ultrapure water. Dry cover glass under a gentle stream of N2. Caution: piranha solution is extremely corrosive. Eye and skin protection are required.\nSubmerge cover glass in 45:5:1 ethanol : ultrapure water : 3-aminopropyl dimethyl ethoxysilane (v/v). Place on a shaker at RT for 60 min (approximately 50 rpm).",
    "Submerge cover glass sequentially in ethanol and ultrapure water (2x each). Dry cover glass under a gentle stream of N2.\nBake cover glass in an oven (80 °C for 30 min).\nSilanized cover glasses may be stored under argon for up to 6 weeks.\nAminosilanization of cantilevers (approximately 1.5 hr)\n\tNOTE: The presented protocol for tip functionalization is appropriate for silicon cantilever tips.\n\t\nPlace cantilevers on a clean glass slide. Treat with UV-ozone for 15 min.\nSubmerge cantilevers for 3 min in 1:1 ethanol : 3-aminopropyl dimethyl ethoxysilane (v/v) with a catalytic amount (0.25%, (v/v)) of ultrapure water.\nRinse cantilevers with gentle stirring sequentially for 60 sec in beakers of toluene, ethanol, and ultrapure water. Carefully dry cantilevers on filter paper between rinses.\nPlace levers on a clean glass slide and bake (80 °C for 30 min).\nProtein disulfide reduction (approximately 3 hr)\n\tAll solutions should be prepared to obtain approximately 30 µl of diluted protein per cantilever and 20 µl of diluted protein per cover glass. Protein solutions should be mixed with Tris(2-carboxyethyl)phosphine (TCEP) disulfide reducing gel in a ratio of 1:2 (v/v).\n\t\nPrepare aliquots of TCEP disulfide reducing beads in micro-tubes. It is recommended to cut micropipette tips with scissors to widen the hole diameter when pipetting the TCEP bead slurry.\nRinse TCEP bead slurry with 1 ml TBS buffer, and centrifuge at 850 rcf for 3 min.\nCarefully remove and discard the supernatant with a micropipette.\nRepeat steps 1.4.2-1.4.3 2x.\nApply concentrated protein solution (1-10 mg/ml) to the TCEP beads (1:2 protein : TCEP bead slurry (v/v)) and gently mix by stirring with micropipette tip. Avoid introducing air bubbles.\nPlace protein/TCEP bead slurry mixture on a rotator for 2.5 hr.\nPEGylation of cover glasses and cantilevers (approximately 1.5 hr)",
    "Prior to modification with NHS-PEG-maleimide linkers, soak aminosilanized cantilevers and cover glasses in sodium borate buffer (pH 8.5) for 45 min to deprotonate primary amine groups on the surface.\nEnsure that the NHS-PEG-maleimide powder is warmed up to RT before opening the cap and weighing the appropriate amount for a 25 mM solution. Unused NHS-PEG-maleimide should be stored under argon at -20 °C. Approximately 30 µl of polymer solution per cantilever, and 90 µl per 2 cover glasses (sandwiched together) is required.\nAfter weighing the 5 kDa NHS-PEG-maleimide, add sodium borate buffer and vortex to obtain a 25 mM solution.\n\t\tNote: The solution should be used as quickly as possible due to the extremely short half-life of NHS at pH 8.5. Vortexing and transfer of the liquid onto the cantilevers/cover glasses should be completed within 1-2 min.\nIncubate cantilevers in 30 µl droplets of NHS-PEG-maleimide solution in a Petri dish. For cover glasses, place 90 µl of NHS-PEG-maleimide solution onto a single cover glass, and add a second cover glass on top creating a cover glass sandwich with NHS-PEG-maleimide solution in the middle.\nIncubate the cantilevers/cover glasses with the NHS-PEG-maleimide solution in a water-saturated atmosphere at RT for 1 hr.\nProtein conjugation (approximately 2 hr)\n\tCritical: Minimize the exposure of PEGylated cantilevers and cover glasses to air.\n\t\nCentrifuge TCEP-bead/ reduced protein solutions at 100 rcf for 1 min and collect the supernatant.\nDilute protein solution with TBS. Aim for a protein concentration during surface conjugation in a range of 0.5-2 mg/ml. Set reduced and diluted protein solutions aside for a few minutes while rinsing cantilevers and cover glasses.\nRinse cantilevers and cover glasses in three sequential beakers of ultrapure water.",
    "Carefully remove residual liquid from cover glasses by carefully touching the edges to a filter paper under a gentle stream of N2. Carefully remove residual liquid from cantilevers by touching to a filter paper. Apply diluted protein solution immediately.\nMount cover glasses in an appropriate sample holder that is compatible with the AFM instrument.\nIncubate PEGylated cover glasses and cantilevers with respective diluted protein solutions at RT for 1-2 hr.\nRinse cantilevers in three sequential beakers with TBS to remove unbound proteins. Pipette rinse cover glasses at least 10x.\nStore cantilevers and cover glasses under TBS prior to measurement.\n2. Data Acquisition\nIn this work, a custom-built AFM28 controlled by an MFP-3D AFM controller from Asylum Research with custom written Igor Pro software was used. Cantilever deflection is measured via the optical beam deflection method29. The sample preparation and data analysis protocols provided here are applicable regardless of the exact AFM model used. However, the AFM model should be suitable for measuring in liquids and support an accessible speed range on the z-piezo of approximately 200-5,000 nm/sec.\nMount the functionalized cantilever and glass surface on the AFM. During the whole procedure, the surface should stay covered with buffer. When mounting the cantilever, minimize exposure to air. Upon correct adjustment of the laser beam, let the system equilibrate for at least 30 min to reduce any drift effects and readjust if necessary.\nRecord a thermal noise spectrum with the cantilever far away from the surface, i.e. in the absence of damping effects.",
    "Use a minimally invasive method like the acoustic approach to find the surface without damaging the cantilever tip prior to measurement. If possible, manually approach the surface with the cantilever and use headphones to listen to the thermal noise on the raw deflection output from the AFM controller. As soon as the cantilever draws near the surface, a distinct change in sound is audible.\n\tNote: The cantilever tip should now be within 2-5 µm of the surface. The nature of the sound change is dependent on the cantilever used. The resonance frequency of the cantilever used in this work is approximately 25 kHz in water, above the human audible range. Due to damping effects near the surface, the resonance is shifted towards lower frequencies bringing the cantilever resonance into the audible range. Hence, an apparent increase in frequency and sound intensity is perceived.\n\tIn cases where an audio output of the deflection signal is not available, the surface can be approached with the z-piezo while an active feedback on the deflection signal is enabled. As soon as the deflection signal increases by a defined amount due to indentation of the surface, the approach is stopped.\nDetermine the inverse optical lever sensitivity, (InvOLS) which represents the tip displacement distance (in nm) per volt deflection signal. Do this by indenting the surface with the cantilever tip. A deflection set point voltage corresponding to a cantilever tip displacement of approximately 3 nm is recommended.\nDetermine the spring constant of the cantilever by fitting a simple harmonic oscillator response function to the thermal noise spectrum, according to the equipartition theorem30,31.",
    "Initialize an experimental routine. For this work, the following set of measurement parameters was used: approach speed: 3,000 nm/sec; indentation force: 180 pN; surface dwell time: 10 msec; retract velocities: 0.2, 0.7, 2.0, 5.0 µm/sec with sampling rates of 2,000, 5,000, 15,000, 20,000 Hz respectively; retract distance: 500 nm.\n\tNote: The sampling rate should not be set higher than 10 points/nm to avoid oversampling and to keep data sizes reasonable.\nAfter each force-distance trace, actuate the x- and y-piezo stages to expose a new surface location to the cantilever in each force-distance curve. This technique samples a larger area of the cover glass surface during long-term measurements.\nUse periodic rezeroing of the deflection stage (i.e. photodiode position) and height of the z-piezo chassis during long-term measurements in case the deflection signal drifts out of range, or contact is lost with the surface.\nUpon completion of the measurement run, perform another InvOLS measurement with a significantly higher indentation force than used prior to measurements to obtain a more precise InvOLS value.\nRecord another thermal noise spectrum far away from the surface. Determine the spring constant at the end of the experimental run.\n3. Data Analysis\nThe flow diagram in Figure 3 illustrates the process of data analysis. Perform all data manipulations using an appropriate software package such as Igor Pro or MATLAB. First convert the raw signal from the detector into units of force, and correct for offset and drift. Subsequently, use models of biopolymer elasticity to locate energy barriers in the unfolding pathways, and identify protein subdomains. Finally, kinetic and energetic parameters of the receptor-ligand interaction are obtained.\nUnit conversion and data corrections\nMultiply the raw deflection signal (volts) by the InvOLS (nm/volt) and spring constant (pN/nm) to convert the detector voltage into units of force.",
    "Offset the data such that the unloaded cantilever has a force value of zero pN by first averaging the force values from the last 10% of the force-distance trace (acquired farthest away from the surface), and then subtracting the average from all force values in the data trace.\nOffset each trace in the x-direction such that the first intercept with the distance axis occurs at a distance of 0 nm.\nThe InvOLS is dependent on the laser spot position on the cantilever. Even small amounts of drift in the optical readout system may cause noticeable changes in the InvOLS when the footprint of the cantilever is comparable to the laser spot size. Correct for this by analysis of the noise on the deflection signal at zero force. Assuming constant ambient conditions, noise on the deflection signal is directly proportional to the InvOLS.\n\t\t\nMeasure the route mean square (RMS) deflection value (noise level under zero force) of the last 10% of each force-distance trace.\nPlot the noise vs. the curve number and apply a suitable fit. Typically an exponential fit in the form of imgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950_clip_image002.jpg will work best, where N is the noise, ni is the curve number, and N0 and k are fit parameters. A linear fit may also be appropriate for certain data sets.\nDetermine a scaling factor (SF) for each curve:\n\t\t\tEquation 1:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950eq1.jpg\n\t\t\twhere, ni is the curve number, nf is the final curve number, and C is an offset.\nNext divide all the force values in each individual curve by the scaling factor. This procedure scales each curve by the ratio of the RMS noise value of the current curve to the RMS noise value of the final trace that was acquired immediately prior to the InvOLS measurement.",
    "Perform a deflection correction to transform the distance axis (z) to molecular extension (z*). This accounts for bending of the cantilever under force which shortens the distance between cantilever tip and sample from the value reported by the z-piezo sensor position.\n\t\t\tEquation 2:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950eq2.jpg\n\t\t\tWhere z is the measured z-sensor position, F the force acting on the cantilever and k the spring constant.\nContour length analysis\n\tThe contour length of a protein is the maximum stretched length of the polypeptide chain. The folding state of a protein refers to its geometry and end to end distance determined by secondary and tertiary structure. The contour length of a protein is directly related to its folding state9,25,32. The position of specific ruptures in force-extension traces varies widely due to polydispersity of PEG linkers, as well as external parameters such as temperature, buffer properties and loading rates. This complicates direct data analysis but can be overcome by transforming force-extension data into contour length space. This technique enables averaging over huge datasets, and allows automatic pattern recognition to be used to identify characteristic unfolding events. It is therefore possible to sort individual force traces depending on the type of interaction exhibited. The following previously described procedure25 is used to transform force-extension data into contour length space.\n\t\nSolving the WLC model (Equation 3)23 for the contour length L at a fixed persistence length p results in Equation 4, which provides  the contour length L(x,u). Here, x is the distance and u=F*p/kBT, where kB is Boltzmann's constant and T is the temperature. Only real solutions can be considered. Additional constraints are x<L, F>0, L>0, x>0;\n\t\tEquation 3:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950eq3.jpg\n\t\tEquation 4:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950eq4a.jpg\n\t\twhere,\nimgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950eq4b.jpg",
    "Plot the transformed data points in a force vs. contour length plot. Apply a force threshold of approximately 10 pN to exclude noise. Unspecific interactions can be excluded by applying a long-pass length filter. Assemble a histogram of contour lengths.\nCross-correlate33 the obtained histograms with a template histogram, and offset along the x-axis to correct for PEG polydispersity. Use the resulting correlation values to measure the similarity of individual data traces. Thereby, data traces can be sorted into predefined classes to simplify further analysis.\nUse a similar technique to find repeating features in a single trace by autocorrelation, e.g. for multiple Ig-domain unfolding.\nSort traces manually to investigate other unfolding events.\nLoading Rate Analysis\n\tExtract kinetic and energetic information about receptor-ligand dissociation by applying suitable models to the force spectrum, i.e. the rupture-force vs. ln(loading-rate) plot.\n\t\nFor a given pulling speed, determine the rupture force and loading rate for rupture events of interest:\n\t\t\nPerform a line fit to a force-time trace in the vicinity of the rupture event of interest. Determine the loading rate from the slope of the line fit to the peak. Repeat this procedure for every trace showing the rupture event of interest.\nDetermine the most probable rupture force by applying a Gaussian fit to a histogram of the rupture forces. Alternative fit functions are possible.\nDetermine the most probable loading rate.\nRepeat steps 3.3.3.1 - 3.3.3.3 for all pulling speeds.\nPlot the most probable rupture forces against the natural logarithm of the most probable loading rates to obtain the force spectrum.",
    "Apply a suitable theoretical model to the force spectrum to extract kinetic and energetic parameters (Figure 4C). In many cases, the linear Bell-Evans model20,34 can be used and will yield good estimates for koff, the dissociation rate in the absence of force, and Dx, the distance to the transition state along the reaction coordinate, as shown in Equation 5.\n\t\tEquation 5:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50950/50950eq5.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}