{
  "id": 13965,
  "origin_website": "Jove",
  "title": "Performing Behavioral Tasks in Subjects with Intracranial Electrodes",
  "procedures": [
    "All tasks were performed according to an approved protocol submitted to the Institutional Review Board (IRB) of the Cleveland Clinic Foundation. An informed consent process was conducted with each patient prior to all research activities. In this example, a subject that meets study criterion that has had stereo-electroencephalography (SEEG) electrodes implanted for seizure is chosen. The project was discussed with the subject and they have consented to participate.\n1. Patient Enrollment\nEvaluate patients with refractory epilepsy in consideration for intracranial electrode implantation. If the patient is a good candidate for the invasive surgery, analyze the patient’s MRI, PET and MEG along with the seizure pathology in order to optimize placement of the electrodes. A clinical team carries out all evaluations and no decisions are made for research purposes. .\nIdentify eligible patients for the study subsequent to evaluation for implantation and verify the patients per the approved IRB protocol based on the inclusion/exclusion criteria.\n\tNOTE: It is in the best interest of the patient to include subjects with an aura in the inclusion criteria. Patients with auras are able to notify the researchers that they are about to have a seizure; giving the researchers and patient time to take the necessary precautions (pressing the seizure alarm to notify the clinical staff and pulling all equipment out of the way). However, if subjects are recruited that do not have an aura, ensure that the patient input devices can be readily removed from the patient area and that the staff is aware of the research equipment and protocol.",
    "Obtain informed consent prior to any research activities in accordance with the IRB. During the informed consent, explain the research, emphasizing that participation is strictly voluntary and will in no way impact the patients clinical care. In most cases there is no direct benefit to the patient and their willingness to participate is altruistic.\nMaintain respect for the patient’s rights and privacy at all times. Remind the patients that their information will remain anonymous and confidential and they may cease participation in the study at any time under no consequence.\nHave the patient sign and date the informed consent if he or she understands and agrees to participate in the study. Leave one copy is left with the patient to review; should they have any questions or concerns encourage the patients to contact the PI.\n2. Behavior System Set-up\nBefore bringing the equipment into the room, ensure that there is sufficient space in the patient’s room, as well as access to the necessary outlets (2).\nCheck that all equipment and wires are ready to expedite the set up. The behavioral system includes an FDA approved robotic arm (which allows the subject to control a cursor during the task), a laptop computer to control the behavioral program, a monitor for presenting the task stimuli, and a data acquisition system to store the electrophysiological and behavioral data.\n\tNOTE: Make necessary modifications to meet specific needs of one’s research. For instance, use a button box for the patient interface instead of the robotic arm.\nIf the patient is not presently positioned in a manner suitable to complete the task, assist the patient to a reclining chair (or bed) with arms, should they have a seizure.",
    "NOTE: It is a good idea to discuss the study design, equipment, etc. with all the members of the monitoring unit to inform them of what is going on, how the group will be interacting with the patients, and any possible issues that may arise.\nWhen the patient is ready, bring the behavioral system into the room and begin booting up the behavioral system and robotic arm.\nConnect the digital event marker output from the behavioral computer to the DC channels of the electrophysiological acquisition system in order to time lock the recorded SEEG signals with behavioral event markers.\n\tNOTE: At this center there is a separate electrophysiological acquisition system designated for research purposes, which does not interfere with the clinical acquisition system. However, it is possible to use the clinical acquisition system by working with the appropriate personnel. All efforts should be made not to disrupt the clinical acquisition.\nCalibrate the robotic arm and position it such that the range of motion is comfortable for the patient. If using another interface device, ensure that the equipment is operating correctly and is positioned comfortably for the subject to use.\nWhile using the robotic arm, ensure that the emergency stop buttons are easily accessible by the researchers throughout the behavioral task. In the event of a seizure, the emergency stop button is pressed and the equipment is pulled away from the patient so that they do not harm themselves. In addition, we do not use the velcro straps that come with the robot system to facilitate removal from the patient in case a seizure occurs.",
    "NOTE: In this example, the parallel port of the behavior rig is connected to the digital input port of the acquisition system using a parallel port cable. Additional analog signals such as the x & y position of the robotic arm are recorded simultaneously.\n3. Behavioral Task\nExplain the task to the patient following the completion of the rig set up and calibration of the interface device.\nUse a behavioral task similar to the children’s card game of “war”. Ask the patient to make wagers as to whether their card is greater than the computer’s card. The choice of the wager is based on the patients’ perception of the relative value of their card. Simplify the task for subsequent analysis, by only using cards of one suit and limiting the deck to the 2, 4, 6, 8, and 10 numbered cards.\nShow a fixation cue on the screen for 350 msec. Ensure the patient holds the cursor over the fixation mark to initiate the task.\nShow the stimulus for 1,000 msec. Allow the patient to see their card with the computer’s card next to it face down.\nFollowing the cards disappearance, show a go-cue (<5,000 msec) displaying two options, asking the patient to bet either $5 or $20, based on their card. Ask the patient to place the bet by moving the cursor using the robotic arm, over their chosen wager. Randomize the wager position from trial to trial to ensure no bias based on position.\nAfter the wager has been selected, notice a 250 - 500 msec delay (blank screen), followed by the revelation of the computer’s card (1,000 - 1,250 msec). Observe the outcome (1,000 msec), whether the trial was a win, lose, or draw and how much was won or lost.",
    "Allow the patient to practice until they are confident in their performance and have no questions.\n4. Data Acquisition\nRecord the data when the patient is ready and verify that the settings on the research (or clinical) acquisition system are appropriately selected.\nTurn off the room lights and TV to keep the background noise to a minimum during the recording. Additionally, ask the patient to refrain from behaviors such as tapping their foot, talking or shaking their legs.\nBegin the task and record the patient performing the task. Ask the subject to perform the task for 30 min. The sampling rate of the robotic arm system is 1 KHz, and that of SEEG recording system is 2 KHz.\n\tNOTE: This duration may be different for other paradigms.\n5. Data Analysis\nFirst, de-identify the recorded SEEG data to ensure that the patient’s information remains confidential and that his/her data is submitted anonymously.\nObtain the coordinates of the electrode locations from the postoperative CT and preoperative MRI.\nAlign the neurophysiological recordings with the digital timestamps of interests from the behavioral task.\nApply signal analysis methods to analyze the event dependent brain activity modulation.\n\tNOTE: In this study, power spectral density (PSD) of the event related SEEG signals was calculated using Chronux multitaper toolbox26,27. Each trial data was aligned with respect to the relevant event (time zero), and the calculated PSD was normalized in each frequency bin with respect to the baseline PSD.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}