{
  "id": 18234,
  "origin_website": "Jove",
  "title": "Induction and Micro-CT Imaging of Cerebral Cavernous Malformations in Mouse Model",
  "procedures": [
    "All animal ethics and protocols were approved by The Sydney Local Health District Animal Welfare Committee and Institutional Animal Care and Use Committee (IACUC) of Tianjin Medical University. All experiments were conducted under the guidelines/regulations of Centenary Institute, University of Sydney and Tianjin Medical University\n1. Induction of Cerebral Cavernous Malformations in Mouse Models\nCross Cdh5-CreErt2; Ccm2fl/fl mice with Ccm2fl/fl to generate litters with Cdh5-CreErt2; Ccm2fl/fl (Ccm2iECKO) pups and littermate controls (Ccm2fl/fl). Cdh5-CreErt2 and Ccm2fl/fl animals have been previously described19.\nDissolve 4HT in 100% ethanol and store at -80 °C in aliquots of 30 µL (4HT concentration: 10 mg/mL). On the day of use, dilute aliquoted 4HT in corn oil (0.5 mg/mL).\nIntragastrically inject 50 µL of 4HT (0.5 mg/mL) to neonatal pups at P1 to induce experimental CCM lesions using an insulin syringe.\n2. Sample Preparation for Micro-CT Scans\nEuthanize neonatal pups at P8 via carbon dioxide asphyxiation.\nPerform intra-cardiac perfusion by inserting a 29-gauge needle with 3 mL of 2% paraformaldehyde in PBS in a 10 mL syringe into the ventricle of the mouse heart.\n\tCAUTION: Paraformaldehyde is toxic; wear appropriate protection.\nDetach the head from the body using a scissors. Remove all the skin off the head using a scissors and peel off the skull using forceps to dissect the whole brain.\nTake images of the brain with stereomicroscope at 7.82x magnification, 1x gain, 0.6 gamma, and 20 ms exposure time.\nFix the dissected brains with 4% paraformaldehyde in PBS solution overnight.\n\tCAUTION: Paraformaldehyde is toxic; wear appropriate protection.\nOn the following day, detach hindbrains using a forceps and wash with PBS solution.\nIncubate the hindbrains in Lugol's iodine solution for 48 h.\nFollowing the incubation, briefly air dry the hindbrains to remove excess Lugol's iodine solution.",
    "Pack the Lugol's iodine stained hindbrains in 0.65 mL microcentrifuge tubes and seal completely with plastic paraffin film to avoid tissue shrinkage (Figure 2A).\nPlace microcentrifuge tubes in 5 mL plastic tubes with sponges to prevent them from moving during scan (Figure 2B).\n3. Micro-CT Scan of CCM in the Mouse Brain\nVertically mount the hindbrain packed in a tube on an aluminum holder in the micro-CT system.\nSet the scanning parameters to 540 projections and 2 s exposure time with source conditions of 50 kV and 10 W to acquire the tomographic datasets (image resolution 9.5 μm/pixel).\nRadiographs from the scan are reconstructed automatically by hardware-based projection reconstruction software supplied by the micro-CT system, producing an image series of 16-bit axial slices (\"TXM\" file).\n4. Analysis of Micro-CT Datasets\nOpen the reconstructed image file (\"TXM\" file) in the 3-D analysis software and visualize the brain using the \"volume rendering\" function.\nTransform the hindbrain to the desired orientation using the \"bounding box\" and \"clipping plane\" functions.\nResample the transformed image in extended mode and preserve the voxel size.\nCreate \"edit new label field\" on the transformed image (4.3) and highlight only the hindbrain using greyscale intensity.\nAdd the highlighted areas and run \"label analysis\" to obtain measurements of the whole hindbrain (i.e., total volume and area). Export measurements in an Excel file.\nVisualize the hindbrain using the \"isosurface rendering\" function.\nCreate another \"edit new label field\" on the transformed image and highlight areas with lesions using greyscale intensity.\nAdd the highlighted areas and run \"label\" analysis to obtain measurements of the lesions within the hindbrain (i.e., total volume and area). Export measurements in an Excel file.\nVisualize the lesions using the \"generate surface\" and \"surface view\" functions.",
    "Snapshot the images of the hindbrain at desired orientations or generate a movie for 3-D visualization of the lesions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}