{
  "id": 11936,
  "origin_website": "Jove",
  "title": "Modeling the Effects of Hemodynamic Stress on Circulating Tumor Cells using a Syringe and Needle",
  "procedures": [
    "1. Cell preparation\nRelease cells from tissue culture dish when 70-90% confluent by following the recommended guidelines for the cell line in use.\n\t\nFor example, aspirate the growth medium for PC-3 cells, and wash the 10 cm dish of cells with 5 mL of calcium- and magnesium-free phosphate-buffered saline (PBS).\nAspirate the PBS before adding 1 mL of 0.25% trypsin using manufacturer's protocol.\nAfter observing the detachment of the cells under an inverted microscope, add 5 mL of DMEM:F12 medium containing 10% fetal bovine serum to inhibit the trypsin.\nPlace the cell suspension into a conical tube.\nDetermine the cell concentration and total cell number.\nPellet cells by centrifugation (300 × g for 3 min), aspirate the supernatant, and resuspend cells in serum-free tissue culture medium to 5 × 105 cells/mL.\n\t​NOTE: It is critical that the assay medium contains at least 1.17 mM Ca++ as extracellular Ca++ has been demonstrated to be required for cellular resistance to FSS15.\n2. Fluid shear stress exposure\nPrior to exposing cells to FSS, cut a round-bottom 14 mL polystyrene tube at the 7 mL line. Mix the cell suspension, place 5 mL of the suspension into the cut tube, and collect static control samples.\n\tNOTE: The volume needed to collect for the static sample depends on the viability assay used (see step 3).\nDraw the cell suspension into a 5 mL syringe, and attach a 30 G ½\" needle. Uncap the needle, place the syringe onto a syringe pump, secure the syringe, and set the flow rate to achieve the desired level of FSS.",
    "NOTE: Table 1 shows the maximum wall shear stress for different needles and flow rates, as well as the minimum level of FSS depending on cell size (10, 15, and 20 µm). Inspect the needle prior to use to ensure that it is not bent; if uncertain, replace the needle with a new one. Needle integrity can have significant impact on the level of FSS applied.\nRun the syringe pump, and collect the sheared sample in the cut tube at an approximate 45° angle to reduce foaming. Collect a sample depending on the type of viability assay or downstream assay needs.\n\t\nCarefully remove the syringe and needle from the syringe pump, and use pliers to remove the needle from the syringe, taking care to not touch the needle.\n\t\tNOTE: Non-beveled needles can be used interchangeably with beveled needles as an additional safety measure.\nDraw the sheared suspension back into the syringe, carefully reattach the needle using pliers, and place it back into the syringe pump.\nRepeat steps 2.3 and 2.4 until the cell suspension has been exposed to the desired number of pulses of FSS.\n\t​NOTE: To assess the capacity of cells to resist mechanical destruction from FSS exposure the cell suspension is typically subjected to 10 pulses of FSS. However, it has been demonstrated that cells start to undergo biological adaptations in response to FSS after 2 pulses24.\n3. Viability measurement\nNOTE: Viability can be assessed using enzymatic assays (luciferase, resazurin, and WST-1), counting intact cells, flow cytometry, or by clonogenic assays.\nFor all measures of viability, collect a sample prior to exposing cells to FSS.\n\t\nFor enzymatic assays, take duplicate 100 µL aliquots and place them into a 96-well plate.\nFor flow cytometry, take one 500 µL aliquot and place it into a 1.5 mL tube.",
    "For clonogenic assay, collect a 100 µL aliquot.\nEnzymatic assay\n\t\nCollect 100 µL samples after 1, 2, 4, 6, 8, and 10 pulses of FSS exposure and place them in a 96-well plate.\nAdd the desired substrate, and follow the protocol for the assay used:\n\t\t\nFor resazurin, add 20 µL of a 0.15 mg/mL solution to each well. Add 20 µL of 0.15 mg/mL resazurin solution to wells containing 100 µL of medium alone. Incubate for 2 h in a 37 °C tissue culture incubator. Measure the absorbance using a plate reader capable of reading fluorescence (579 excitation/ 584 emission).\nFor luciferase-expressing cells, add 100 µL of 15 mg/mL D-luciferin to 5 mL of medium. Add 100 µL of that solution to each well containing cells. Wait for 5 min, and then read the plate using a reader compatible with luminescence.\nFor WST-1, add 10 µL of WST-1 to each well, including wells containing medium only. Incubate for 4 h, and then read the absorbance between 420 and 480 nm using a plate reader.\nCompare the averaged signal from each of the FSS-exposed samples to the averaged static control sample to obtain the percentage of viable cells.\nFlow cytometry24\nCollect 500 µL samples and place them into 1.5 mL centrifuge tubes after 1, 2, 5, and 10 pulses of FSS.\nCentrifuge samples (500 × g for 3 min), and discard the supernatants.\nResuspend the pellets with 1 mL of calcium- and magnesium-free PBS, and centrifuge the samples (300 × g for 3 min).\nSuspend the pellets with 500 µL of fluorescence-activated cell sorting (FACS) buffer (PBS with 0.5% bovine serum albumin and 0.1% sodium azide) with counting beads and membrane-impermeable or viability dyes such as propidium iodide (1.75 µg/mL).",
    "Determine the viability by comparing the ratio of viable cells, normalized to counting beads, in sheared samples to that of the static sample.\nClonogenic assay\n\t\nTake 100 µL of the static sample, and add 900 µL of growth medium to make a 1:10 dilution.\nTake 100 µL of the 1:10 diluted sample, and add 900 µL of growth medium to make a final 1:100 dilution.\nAdd 100 µL of the 1:100 dilution sample into each of 3 wells of a 6-well dish containing 2 mL of growth medium.\nRepeat steps 3.4.1-3.4.3 with samples that have been subjected to 10 pulses of FSS.\nLet the cells grow for 7-10 days without changing the medium, and check for colony formation. Once colonies of ≥50 cells have formed, aspirate the growth medium, rinse each well with 1 mL of PBS, aspirate the PBS, and fix for 5 min using 1 mL of ice-cold 70% ethanol (EtOH). Importantly, fix both sheared and static samples at the same time\nAfter fixing the samples, aspirate the EtOH, and add 1 to 2 mL of crystal violet solution (0.1% crystal violet in 90% H2O, 10% EtOH) for 5 min.\nRinse with an excess of water, and let the plate dry\nCount the colonies (clusters of ≥50 cells) for both the static and sheared samples. Compare the ratio of the average number of colonies from the sheared sample to the average number of colonies from the static sample to determine viability.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}