{
  "id": 10333,
  "origin_website": "Jove",
  "title": "Controlling Electrospun Polymer Morphology for Tissue Engineering Demonstrated Using hepG2 Cell Line",
  "procedures": [
    "1. Solution preparation\nLarge (random, aligned, and cryogenic) fibers\n\t\nPrepare a 5:1 ratio of chloroform and methanol by mixing 50 mL of chloroform and 10 mL of methanol in a glass solvent-proof bottle using a glass serological pipette.\n\t\tCAUTION: Chloroform and methanol are toxic solvents and mixing must be conducted in a fume hood.\nTo create a 19 w/v% solution of PCL in 5:1 chloroform:methanol, weigh 1.9 g of PCL and add to 10 mL of 5:1 chloroform:methanol in a glass solvent-proof vial. Double seal the vial using paraffin film and leave the vial on a roller overnight to allow the PCL to fully dissolve.\n\t\tCAUTION: Mixing must be conducted in a fume hood.\nSmall (random and aligned) fibers\n\t\nTo prepare a 7 w/v% solution of PCL in hexafluoroisopropanol (HFIP), weigh 0.7 g of PCL and mix with 10 mL of HFIP in a glass solvent-proof vial. Double seal the vial using paraffin film and leave on a roller overnight to allow the PCL to fully dissolve.\n\t\tCAUTION: HFIP is highly toxic and mixing must be conducted in a fume hood.\nSmall cryogenic fibers\n\tCAUTION: Mixing must be conducted in a fume hood.\n\t\nPrepare a 3:1 ratio of chloroform and methanol by mixing 30 mL of chloroform and 10 mL of methanol in a glass solvent-proof bottle using a glass serological pipette.\nTo create a 14 w/v% solution of PCL in 3:1 chloroform:methanol, weigh 1.4 g of PCL and add to 10 mL of 3:1 chloroform:methanol in a glass solvent-proof vial. Double seal the vial using paraffin film and leave on a roller overnight to allow the PCL to fully dissolve.\n2. Electrospinning setup\nNOTE: The parameters must be set before beginning the electrospinning process.\nNeedle size and placement",
    "For large fibers (random, aligned, and cryogenic) use a 1 mm OD/0.8 mm ID brass needle and place the needle 230 mm away from the mandrel surface.\nFor small fibers use a 1 mm OD/0.4 mm ID brass needle and place the needle 15 mm away from the mandrel surface.\nLateral needle motion\n\tNOTE: The scaffolds detailed in Figure 1 were fabricated with a 100 mm needle traverse at 50 mm/s, with repeated motion left and right throughout the process.\n\t\nTo set the lateral motion, press Motion | TNS 1 and set Start position [mm] to -50, Distance [mm] to 100, Speed [mm/s] to 50 and Turn Delay [ms] to 750.\nSyringe pump flow rate\n\t\nFor large fibers (random, aligned, and cryogenic), press the Material tab on the user interface and set the syringe pump to 4 mL/h.\nFor small (random and aligned) fibers, set the syringe pump to 0.8 mL/h.\nFor small cryogenic fibers, set the syringe pump to 2.5 mL/h.\nVoltage settings\n\t\nFor the large fibers, set the needle voltage at +15 kV and the mandrel voltage at -4 kV by pressing the Voltage tab on the user interface and changing the positive and negative voltage values.\nFor the small (random and aligned) fibers, set the needle voltage at +17 kV and the mandrel voltage at -4 kV.\nFor the small cryogenic fibers set the needle voltage at +18 kV and the mandrel voltage at -4 kV.\nMandrel rotation (large and small fibers)\n\t\nFor random fibers, press Motion | Target and set the mandrel rotation speed to 250 rpm.\nFor aligned fibers, set the mandrel rotation speed to 1,800 rpm.\nFor cryogenic fibers, set the mandrel rotation speed to 180 rpm.\n3. Electrospinning of random and aligned fibers (large and small fibers)",
    "Insert the needle (refer to section 2.1 for information on needle size and placement) into 1 mm bore PTFE tubing and secure within the electrospinner needle holder.\nUnder a fume hood, transfer the 10 mL of polymer solution into a polypropylene or glass (solvent-proof) syringe. Make sure to remove any bubbles by letting the syringe stand before priming.\nConnect the syringe to the needle via the PTFE tubing and secure the syringe within the syringe pump. Once connected, prime the PTFE tubing by squeezing the syringe plunger and filling the tube with polymer solution.\nWrap the mandrel in aluminum foil and secure onto the mandrel rotation device.\nSwitch on the mandrel rotation by pressing Motion | Target | Rotate and the syringe pump by pressing Material | Start Pump 1.\nWhen a small bead of polymer has formed at the end of the needle, switch on the voltage by pressing ACTIVATE HIGH VOLTAGE. A jet of polymer should then be emitted from a conical protrusion of polymer solution, called the Taylor cone. Check the mandrel to confirm fiber deposition on the mandrel surface.\nRun the electrospinning process until the desired amount of PCL solution is electrospun.\n\tNOTE: For the scaffolds presented in the Figure 1, 4 mL of solution was electrospun.\nOnce the electrospinning has terminated, remove the aluminum foil covered with the fiber from the mandrel and leave in a fume cupboard overnight to allow for excess solvent evaporation.\nAfter evaporation, store the fibers at room temperature (RT).\n4. Electrospinning of cryogenic fibers\nFor cryogenic electrospinning, use the cryo-spinning mandrel. Repeat steps 3.1-3.3 then proceed with the following steps.\nWrap the mandrel in aluminum foil.",
    "Fill the mandrel with dry ice pellets. Secure the cryo-spinning mandrel cover onto the mandrel to ensure that dry ice cannot escape the mandrel but pressure can escape. Ice crystals should form on the surface of the mandrel almost immediately.\n\tCAUTION: Use protective gloves when handling dry ice to avoid cold burns.\nSecure the mandrel onto the mandrel rotation device and immediately switch on the mandrel rotation by pressing Motion | Target | Rotate and the syringe pump by pressing Material | Start Pump 1.\nOnce a bead of polymer has formed at the end of the needle, switch on the voltage by pressing ACTIVATE HIGH VOLTAGE. A jet of polymer should then be emitted from a conical protrusion of polymer solution (i.e., the Taylor cone). Check the mandrel to confirm fiber deposition on the mandrel surface.\nAfter 1 h of electrospinning, pause the process by pressing STOP ALL and top up the mandrel with dry ice. Ensure adequate protection from solvent vapor while refilling the mandrel. Perform this for a total of 3x for 4 h total of electrospinning time.\n\tNOTE: Electrospinning can be resumed by repeating steps 4.4 and 4.5.\nOnce the electrospinning ends, carefully remove the mandrel and immediately place it into a freeze drier for 24 h to sublimate the ice crystals on the mandrel surface.\nAfter sublimation remove the fiber-covered foil from the mandrel and store at RT, taking care to avoid crushing.\n5. Scaffold punching\nPunch scaffolds from the sheet of fibers using a 10−12 mm biopsy punch. If the fibers remain adhered to the aluminum foil, place the scaffolds in 70% ethanol to facilitate detachment.\n6. Sterilization and plasma coating",
    "Place the scaffolds (1 scaffold per well) into a 24 or 48 well plate and wash them 3x in 70% ethanol. Leave submerged in the final wash, place into a -80 °C freezer, and allow to freeze.\nOnce frozen, place the plate into a freeze drier and lyophilize for 24 h. The dried scaffolds can now be plasma coated.\n\tNOTE: If there is no access to a plasma coater, submerge the scaffolds in 1% antibiotic-antimycotic (Anti-Anti) in phosphate buffered saline (PBS) and leave to incubate at 37 °C overnight.\nPlace the plate into the plasma chamber and remove the lid. Run the plasma coater at 500 mTorr and medium radiofrequency (RF) power for 30 s.\nAfter plasma coating, submerge the scaffolds in 1 mL of PBS and 1% Anti-Anti. The scaffolds should readily absorb the PBS solution.\n\tNOTE: The scaffolds are now ready to be seeded with cells.\n7. Preparation and seeding of cells\nNOTE: The basic cell culture technique provided below is for the hepg2 cells used for demonstration purposes in the representative results. These principles can be applied to any adherent cell type; however, different cells may require different materials and different processes. Cell handling must be conducted in a biological safety cabinet, following aseptic technique.\nTake 1 x 106 cryopreserved hepg2 cells and seed into a T75 cell culture flask with 12 mL of complete media consisting of Eagle's minimum essential media (EMEM) supplemented with 10% fetal bovine serum, 100 U/mL penicillin-streptomycin, 5 mM L-glutamine, and 1% nonessential amino acids.\nOnce the cells are at 80% confluence detach the cells from the culture flask by washing 3x in PBS and incubating in 2 mL of trypsin at 37 °C for 4 min. After tapping the flask, the cells should detach.",
    "Deactivate the trypsin by adding 8 mL of complete media. Transfer the cell suspension into a 15 mL tube and spin down the cells in a centrifuge at 120 x g for 5 min.\nRemove the supernatant above the cell pellet with an aspirating pipette and replace with 5 mL of complete media. Resuspend the cells by pipetting up and down with a 5 mL serological pipette.\nCount the resulting cell suspension via the trypan blue exclusion method. Take 100 µL of cell suspension and add to 100 µL of trypan blue in a 1.5 mL vial. Introduce the mixture onto a hemocytometer under a glass coverslip and count the cells under a microscope.\nAdjust the cell concentration to 2.6 x 106 cells/mL by adding or removing complete media. To remove media, centrifuge cells at 220 x g for 5 min, remove the required media, and resuspend the cells.\nAspirate the 1% Anti-Anti in PBS from the well plate and seed 50 µL of 2.6 x 106 cells/mL cell suspension onto the scaffold surface using a 200 µL pipette.\nAllow cells to attach under incubation at 37 °C and 5% CO2 for 1−3 h, making sure they do not dry out. Once attached, add 300 µL (for a 48 well plate) or 500 µL (for a 24 well plate) of culture media and incubate at 37 °C and 5% CO2.\n\tNOTE: Standard cell culture techniques can be used from here until further functional analysis."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}