{
  "id": 3820,
  "origin_website": "Cell",
  "title": "CRISPR/Cas9 ribonucleoprotein-mediated knockin generation in hTERT-RPE1 cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\ngRNA preparation and RNP assembly\nTiming: 45 min\nCritical: Work in sterile conditions under a biological hood.\nResuspend Alt-R® CRISPR-Cas9 crRNA (IDT™) and Alt-R® CRISPR-Cas9 tracrRNA (IDT™) in Nuclease Free Duplex Buffer (IDT™) to a final concentration of 100 μM and keep on ice.\nPrepare gRNAs by mixing 1:1 crRNA and tracrRNA.\n5 μL of 100 μM crRNA\n5 μL of 100 μM tracrRNA\nHeat the mixture at 95°C for 5 min.\nCool down samples to 18°C–22°C on the benchtop for 5 min.\nPause Point: crRNAs, tracrRNA and gRNAs can be stored at −20°C for 1 year. Homemade Cas9 (Anders and Jinek, 2014[href=https://www.wicell.org#bib1]) instead can be stored at −80°C in 20% v/v glycerol.\nMix the following components to form the ribonucleoprotein (RNP).\n3.0 μL of gRNA\n120 pmol of Cas9 (see key resources table[href=https://www.wicell.org#key-resources-table]. Typically 1.8 μL at a 70 μM concentration)\nIf needed, add Nuclease Free Duplex Buffer (IDT™) to a final volume of 5 μL per reaction\nIncubate for 15–20 min at 18°C–22°C.\nPause Point: RNPs can be stored at 4°C for 1 month and at −20°C for 2 years.\nhTERT-RPE1 electroporation\nTiming: 2 h\nRPE1 cells are electroporated in the 4D-NucleofectorTM System (Lonza) using the P3 Primary Cell 4D-NucleofectorTM X Kit S (Lonza).\nResuspend Ultramer® DNA Oligonucleotides (IDT™) in Nuclease Free Duplex Buffer (IDT™) to a final concentration of 100 μM and keep on ice. Resuspended Ultramer® DNA Oligonucleotides (IDT™) can be stored at −20°C for 2 years.\nPrepare P3 Primary Cell Full Electroporation Buffer (Lonza) to a final volume of 20 μL per reaction and keep on ice.\n16.4 μL of P3 Primary Cell NucleofectorTM Solution\n3.6 μL of Supplement\nSet up the 4D-NucleofectorTM System (Lonza) program in advance.",
    "Note: Lonza (https://knowledge.lonza.com/[href=https://knowledge.lonza.com/]) provides a cell line-specific 4D-NucleofectorTM System electroporation program and kit. EA-104 program and P3 Primary Cell kit are used as the optimal setup for RPE1 cells. The same kit is used for the electroporation of human iPSCs in combination with program CM-113, while for example the SE Cell Line kit and CH-125 program can be used for MDA-MB-231 breast cancer cells.\nStarting from a 10 cm culture dish, detach cells by trypsinization and transfer the cell suspension in a 15 mL tube.\nNote: Consider that contact inhibition displayed by RPE1 cells might, when present, negatively impact on the fraction of actively cycling cells, hindering thereby the HDR efficiency. Cells for electroporation should be harvested when growing exponentially, i.e., at less than 80% confluency.\nCentrifuge cell suspension at 400 × g for 5 min and discard the supernatant.\nResuspend the pellet with 5 mL PBS (pre-warmed at 37°C).\nCount (e.g., using the LUNA Automated Cell Counter, Logos Biosystems) the required number of cells (2 × 105 cells/reaction) and transfer the corresponding volume in a 1.5 mL tube.\nCentrifuge the cell suspension at 400 × g for 5 min.\nDiscard the supernatant and resuspend the pellet in 20 μL P3 Primary Cell Full Electroporation Buffer (or an alternative buffer if a different cell line is used).\nElectroporation mix is obtained combining:\n20 μL of cell suspension in P3 Primary Cell Full Electroporation Buffer\n1.2 μL of Alt-R® Cas9 Electroporation Enhancer (IDT™)\n1.2 μL of Ultramer® DNA Oligonucleotide (100 μM, IDT™), corresponding to 1.2 nmol\n5 μL of RNP complex\nPBS to a final reaction volume of 30 μL.",
    "Alternatives: If using PCR amplicons (ca.2 kbp) as donor DNAs add 200 ng of purified PCR product (NucleoSpin® Gel and PCR Clean-up columns, Macherey-Nagel) to the reaction instead of the Ultramer® DNA Oligonucleotide. Note that using 50 ng of PCR product as HDR donor significantly reduced the knockin efficiency.\nMix gently each sample and transfer 25 μL in a free well of the 16-well electroporation strip (Lonza).\nPlace the strip in the proper 4D-NucleofectorTM System (Lonza).\nElectroporate the cells, recover the strip and turn off the instrument.\nNote: The unused wells from the strip can be used for another experiment.\nCritical: Work in sterile conditions under a biological hood.\nDNA-PKcs inhibition and recovery of the cells\nTiming: 3–7 days\nThe electroporation reaction is followed by a 48-hour treatment with the DNA-PKcs inhibitor NU7441 with the ultimate aim to favor the occurrence of homology-directed repair (HDR) at the Cas9-generated double strand break.\nKeep the cells into the strip for 10 min.\nMeanwhile prepare the post-electroporation culture medium by adding NU7441 DNA-PKcs inhibitor to pre-warmed DMEM-F12 to a final concentration of 1 μM and fill a 12-well plate (1–2 mL/well).\nNote: The administration of the DNA-PKcs inhibitor NU7441 resulted in an evident improvement of tagging efficiency for all the editing strategies implemented with the present protocol (see Figure 2[href=https://www.wicell.org#fig2] as an example). The observed favorable NU7441 effect was confirmed also in breast adenocarcinoma MDA-MB-231 cells or in human iPSCs, suggesting that various cell types might display the same trend. See problem 3[href=https://www.wicell.org#sec5.5] for a discussion of the poor tolerability of NU7441 displayed by some cell types.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/542-Fig2.jpg\nFigure 2. DNA-PKcs inhibition augments the efficiency of HDR-mediated gene editing",
    "Homozygous tagging of the centriolar distal appendage protein SCLT1 with the V5-epitope is presented as example. Characterization of the polyclonal population of RPE1 cells resulting from the electroporation with a SCLT1-V5-tagging RNP mixture (Cas9, SCLT1 gRNA and SCLT1-V5 Ultramer®) in the absence (DMSO) or presence (NU7441) of the DNA-PKcs inhibitor.\n(A) Centrioles are stained with anti-γTub antibody, V5 signal (if present) co-localizes with one of the two γTub-positive centrioles. White arrows indicate V5+ cells. Scale bar, 10 μm. Blow-ups without Hoechst 33342 are magnified 2.5×.\n(B) Bar chart showing the percentage of V5+ cells for each condition. N=3 independent experiments (with >100 cells visually scored for each condition), unpaired Student’s t test, ∗∗ = p < 0.05.\n(C) Electroporated RPE1, both untreated (DMSO) and treated with NU7441 were probed for V5 and compared to RPE1 parental cells. V5 signal, when present, corresponds to the expected molecular weight of 75 kDa.\nAdd 75 μL of NU7441 DMEM-F12 medium to each well of the electroporation strip and resuspend the cells.\nUse a capillary tip (e.g., a gel-saver tip) to collect the whole volume (100 μL) and seed the cell suspension in the 12-well plate.\nIncubate the cells at 37°C with 5% CO2 and change the culture medium 18–24 h after electroporation, maintaining NU7441 treatment.\n48 h after electroporation change the medium with fresh DMEM-F12 complete medium without NU7441.\nKeep cells in culture up to when they are fully recovered.\nNote: RPE1 cells may require from 3 to 7 days to completely recover after electroporation.",
    "Alternatives: Ultramer® DNA Oligonucleotides-based protocols do not require antibiotic selection (up to 60% of cells after electroporation are positive for the desired edit). Contrarily, tagging with larger markers is less efficient: donor DNAs are designed so that they contain a Neomycin resistance cassette enabling to enrich for the population of edited cells, Figure 1[href=https://www.wicell.org#fig1]B (Stewart-Ornstein and Lahav, 2016[href=https://www.wicell.org#bib16]) upon antibiotic selection. In this case, fully recovered RPE1 cells after electroporation are kept under antibiotic selection with G418 (400 μg/mL, InvivoGen) for 10 days.\nEditing efficiency analysis via PCR, followed either by analytical electrophoresis or Sanger sequencing and Inference of CRISPR Edits (ICE)\nTiming: 3 days\nHarvest part of the fully recovered cells after electroporation, while keep the rest in culture, and extract genomic DNA using the NucleoSpin® Tissue kit (Macherey-Nagel) following manufacturer’s instructions for cultured cells.\nNote: 50% of a confluent 12-well plate well is sufficient to successfully perform genomic DNA extraction resulting in ca. 1.5 μg of genomic DNA.\nDetermine genomic DNA concentration and dilute it to the working concentration of 10 ng/μL.\nAmplify the locus of interest by PCR using specific primer pairs designed around the cut site (as described in the PCR Primers section). Prepare the PCR reaction mix as follows:\ntable:files/protocols_protocol_542_1.csv\nSet the cycling conditions as reported below:\ntable:files/protocols_protocol_542_2.csv\nNote: Derive the annealing temperature using the Thermo Fisher Tm Calculator for Phusion Polymerase (available on the manufacturer’s web page).\nNote: Calculate the extension time considering 30 s per 1 kb following manufacturer’s instructions for high complexity genomic DNA.\nAlternatives: For point mutations application of this protocol, skip step 30 and proceed with steps 31 and 32.",
    "If the desired edit induces a change in size of the designed PCR amplicon (as in the case of epitope tagging of a protein), run the PCR product on an analytical agarose gel. Evaluate the editing efficiency based on the observed electrophoretic pattern in the heterogenous cell population stemming from the electroporation (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/542-Fig3.jpg\nFigure 3. Analyses of RNP-mediated editing efficiency using agarose gel electrophoresis\nSmall PCR products were run in 2% agarose gel to separate upper and lower band corresponding to edited and parental templates, respectively.\nSynthetic plDNA containing either the parental sequence (V5-) or the expected sequence after integration of V5 (V5+), were generated and used as reference for the expected electrophoretic behavior. Synthetic controls were used alone or mixed in the indicated fractions of parental:edited DNA (right part of the gel). The PCR strategy established V5-tag insertion at the desired site after RNP electroporation (left part of the gel). Moreover, the augmented editing efficiency upon DNA-PKcs inhibition (NU7441 +) is confirmed. NC = negative control. Both gel parts in this figure stem from the same image.\nPurify PCR products at the expected molecular weight using the NucleoSpin® Gel and PCR Clean-up kit (Macherey-Nagel), then quantify the eluate.\nSamples are subjected to Sanger sequencing at a commercial provider (e.g., Eurofins) utilizing the forward PCR primer as sequencing primer and the resulting chromatograms are analyzed using the ICE online tool by Synthego (Hsiau et al., 2018[href=https://www.wicell.org#bib12]), or TIDE / TIDER (Brinkman et al., 2014[href=https://www.wicell.org#bib4]; Brinkman and van Steensel, 2019[href=https://www.wicell.org#bib3]).\nGeneration of monoclonal cell lines by limiting dilution\nTiming: 6–8 weeks",
    "Note: The number of clones to be screened in order to successfully isolate the edited RPE1 derivative varies in dependence of the editing efficiency of the strategy. While the work carried out in the previous section can influence the size of the screening pool, we estimate that the percentage of cells carrying at least one edited allele when utilizing an Ultramer® as HDR template varies between 35% and 62%. When using the eFlut strategy, we observed that on average 84% of the cells surviving antibiotic selection was carrying at least one allele characterized by the desired edit.\nFill the appropriate number of 96-well plates (usually 6–10) with 200 μL/well of pre-warmed DMEM-F12.\nOnce electroporated cells are fully recovered detach them by trypsinization and count them using the LUNA Automated Cell Counter (Logos Biosystems).\nAdd 0.5 or 1 cell/well contained in 10 μL of diluted cell suspension to the 96-well plates.\nIncubate cells for at least 2 weeks before proceeding with expansion and characterization (i.e., immunoblotting, immunofluorescence, PCR, Sanger sequencing, etc.), see Figure 4[href=https://www.wicell.org#fig4] as example.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/542-Fig4.jpg\nFigure 4. Genotyping of candidate V5+ monoclonal RPE1-derivatives\nSmall-amplicon PCRs spanning the V5 insertion genomic site were designed to yield either a 254 bp (non-edited parental DNA) or 302 bp (V5+ DNA) PCR product. PCR reactions were run on genomic DNA isolates obtained from 11 independent clones generated by limiting dilution, thereby revealing homo- vs heterozygosity of the tagging.\nNote: The clonogenic potential of RPE1 cells handled as described is approximately 15%, i.e., each 96 well plate will give rise to clones in ca. 15 wells when seeding 1 cell/well.",
    "Note: When the tagging confers an increase in fluorescence of the cells, FACS-sorting can greatly improve the percentage of productively tagged cells within an heterogeneous population and/or it can be exploited to seed individual fluorescent cells in a microtiter plate for cloning (Collin et al., 2013[href=https://www.wicell.org#bib7]). If productive HDR confers an antibiotic resistance as suggested here however, considering that over 80% of the cells surviving antibiotic selection bear the desired integration, FACS-sorting might provide little/no advantage.\nNote: Inspect all the wells during the first two weeks of incubation and exclude those which are not suitable for further analyses (i.e., polyclonal or empty wells).\nNote: RPE1 cells effectively undergo contact inhibition when reaching confluency. This phenomenon can be exploited to defer the screening of clones stemming from the same 96-well plate seeding iteration. For instance, once all suitable candidates are transferred from a 96- to a 24-well plate, a fraction of clones can be kept at confluency while expanding the rest to a format compatible with genetic/functional characterization."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}