{
  "id": 2122,
  "origin_website": "Cell",
  "title": "Establishing transgenic murine esophageal organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMurine esophageal tissue isolation\nTiming: 2 h\nTiming: 15 min\nTiming: 15 min\nTiming: 15 min\nTiming: 15 min\nThis section describes how to extract epithelial cells from the mouse esophagus and seed them with Matrigel for EO culture (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1604-Fig1.jpg\nFigure 1. Schematic process of murine esophageal organoid culture\nAfter extracting mouse esophageal tissue, the epithelial cell layer is further isolated physically. The small pieces of epithelial tissue are trypsinized, and the single cells are seeded on the plate with Matrigel.\nDay 1\nEuthanize the mice by CO2 inhalation, followed by cervical dislocation.\nExcise the esophagus and transfer it to 10-cm Petri dishes containing cold phosphate-buffered saline (PBS) with 1% penicillin/streptomycin.\nPBS can be replaced with Hank’s balanced salt solution, if available.\nThe esophagus is attached to the trachea. Cut the esophagus and trachea together and detach the esophagus using 2 surgical tweezers. The esophagus is easily distinguished from the trachea because only the trachea has the rings of cartilage.\nWash the isolated esophagus in a new PBS with 1% penicillin/streptomycin by gently moving the dishes back and forth until the supernatant becomes clear.\nOpen the esophagus longitudinally and wash it with cold PBS containing 1% penicillin/streptomycin.\nPeel off and collect the epithelial cell layer.\nThe epithelial cell layer exists in the very inner phase of the esophagus.\nThe epithelial cell layer can be easily peeled off using sterile 2 surgical tweezers.\nNote: This step can be made easier with a stereomicroscope.\nCollect epithelial cell layer and discard the stromal cell and muscle cell layers.\nMince the epithelial cell sheet into 0.5-cm3 pieces with a surgical blade on a glass plate.",
    "Collect the minced tissue in a 1.5-mL Eppendorf tube and digest it with 0.05% trypsin-EDTA at 37°C for 45–60 min with vigorous vortexing every 15 min.\nSingle cells as well as fragments of tissues and aggregates are visible in the microscope at this stage.\nA concentrated enzyme such as 0.5% trypsin-EDTA can be used to increase the cell detaching efficiency.\nInactivate the trypsin with a 3× volume of 10% FBS + DMEM, followed by vigorous pipetting.\nPass the trypsinized cells through a 35-μm sterile strainer to collect the single-cell suspension.\nCollect the pass-through cell suspension and discard the strainer containing tissue.\nCentrifuge the cells (180 g, 4 min) at 4°C and discard the supernatant by aspiration.\nResuspend the cells with PBS and centrifuge them (180 g, 4 min) at 4°C.\nAspirate the supernatant and resuspend the cells with 100 μL of ice-cold E-MEOM medium.\nPrepare E-MEOM with 10 μM Y-27632 before use.\nE-MEOM with 10 μM Y-27632 will be used for the initial 3 days from seeding.\nCount the cell numbers and prepare 5,000 cells in a new 1.5-mL Eppendorf tube.\nAdd E-MEOM to 10 μM Y-27632 medium, up to 40 μL, and place the tube on ice. If the total volume exceeds 40 μL, centrifuge the cells again and resuspend them with 40 μL of E-MEOM with 10 μM Y-27632.\nCritical: The cell suspension–containing tube should be kept on ice to avoid Matrigel solidification.\nAdd 60 μL of Matrigel to a cell suspension stored on ice.\nMatrigel should be pre-thawed at least 3 h at 4°C.\nPipette tips should be ice-cold before use.\nMix and incubate the cell suspension with Matrigel on ice for 5 min.\nNote: Apply gentle pipetting to disperse the cells in the Matrigel and to avoid bubbles.",
    "Pre-warm a 48-well plate in the 37°C incubator for 5 min.\nCritical: The cell suspension–containing tube should be kept on ice to avoid Matrigel solidification.\nAliquot 20 μL of the mixture in each well of the pre-warmed 48-well plate. In total, 4 wells will be used.\nPlace the drop in the center of the well. The dome will not be created properly if the solution attaches to the wall of the well (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1604-Fig2.jpg\nFigure 2. Esophageal organoid culture and viral infection process\n(A) Matrigel domes are solidified at the center of each well before the culture medium is added.\n(B) Hematoxylin and eosin staining of EO at day 10. Keratin pulp is formed in the central region of the organoid. Scale bar, 50 μm.\n(C) Microscopic images of EO at different timepoints. Scale bar, 50 μm.\n(D) Adeno-GFP virus was transduced into the murine EOs. Images were obtained 1 day after the viral infection. Scale bars, 100 μm.\n(E) Lentivirus (pEGIP)-transduced murine EOs. Images were obtained 4 days after infection. Scale bars, 200 μm (upper) and 50 μm (bottom).\n(F) Lentivirus-based gene KO using the CRISPR/Cas9 system in the EOs. 3 different Ajuba sgRNA containing lentivirus plasmids were infected and the KO efficiency was evaluated by immunoblot with anti-Ajuba antibody.\n(G) Lentivirus-based gene KO in the EOs was further confirmed by genomic DNA sequencing. sgRNA targeting the Ajuba gene were highlighted with red boxes.\nCritical: The cell suspension–containing tube should be kept on ice to avoid Matrigel solidification.\nIncubate the plate in the 37°C cell culture incubator for 15 min to allow the Matrigel to solidify.\nAdd 500 μL of E-MEOM with 10 μM Y-27632 medium to cover the Matrigel and incubate it at 37°C with 5% CO2.",
    "Critical: E-MEOM medium should be warmed before use to avoid Matrigel dissociation.\nDay 3.\nChange the medium with fresh E-MEOM medium with 10 μM Y-27632.\nNote: Be careful not to aspirate the Matrigel dome during the aspiration of the old medium.\nNote: New E-MEOM medium must be pre-warmed and dispensed gently not to disrupt the Matrigel dome structure.\nDay 4.\nChange the medium with a fresh E-MEOM medium.\nNote: Be careful not to disturb the Matrigel dome during the aspiration of the old medium.\nNote: New E-MEOM medium must be pre-warmed and dispersed gently not to disrupt the Matrigel dome structure.\nDay 6.\nChange the medium with a fresh E-MEOM medium.\nNote: Be careful not to disturb the Matrigel dome during aspiration.\nNote: New E-MEOM medium must be pre-warmed and dispersed gently not to disrupt the Matrigel dome structure.\nDay 8.\nChange the medium with a fresh E-MEOM medium.\nNote: Be careful not to disturb the Matrigel dome during the aspiration of the old medium.\nNote: New E-MEOM medium must be pre-warmed and dispersed gently not to disrupt the Matrigel dome structure.\nOrganoid passaging\nTiming: 2 h\nTiming: 15 min\nTiming: 15 min\nTiming: 15 min\nTiming: 15 min",
    "This section describes how to passage EOs cultured in Matrigel. We usually perform the passaging 8–10 days after seeding 1,000 cells on the 48-well plate. We have reported that the average size of the EOs is around 25,000 μm2 at Day 10 in the microscopic images (Zheng et al., 2021[href=https://www.wicell.org#bib13]). If different scales of culture are used, the morphology of EOs and the culture medium should be carefully monitored. Mature EOs show a thin outward basal cell layer and inward suprabasal and stratified cell layers (Figure 2[href=https://www.wicell.org#fig2]B). Keratin pulp is formed in the central region of Eos, which is a typical feature and is visible in the light microscope in mature EOs (Figures 2[href=https://www.wicell.org#fig2]B and 2C). After an optimal passaging time, the dark Keratin pulp area grows larger while maintaining the overall organoid size, indicating that the proportion of the live cells is decreasing. Therefore, EOs should be passaged before this Keratin pulp becomes too large and before the culture medium turns yellow.\nDay 1.\nPrepare ice, ice-cold 10% FBS DMEM, ice-cold Dulbecco’s phosphate-buffered saline, and 0.05% trypsin-EDTA before starting.\nDiscard the culture medium using an aspirator.\nDissociate the Matrigel by vigorous pipetting with ice-cold 10% FBS DMEM medium. Scrape the Matrigel from the bottom of the well with a pipette tip.\nNote: Ice-cold 1,000 μL pipette tips are used. Before using Matrigel, coat the tip wall with 10% FBS DMEM by pipetting to avoid organoid attaching to the pipette tip.\nCollect and transfer the sample into a 15-mL tube and place it on ice. Fill the tube with ice-cold 10% FBS DMEM medium, up to 13 mL.\nCollect 4 wells together if this process is a continuation from the esophageal tissue isolation section.",
    "Note: Organoid forming efficiency is relatively low in the organoids isolated from the esophagus tissue (0 passage) compared to the established organoids (passaged).\nCollecting 2 wells into 1 tube is sufficient if this process is for already established cultured EOs.\nCentrifuge the sample (180 g, 4 min) at 4°C and discard the supernatant.\nWash the sample with 13 mL of cold PBS, centrifuge it (180 g, 4 min) at 4°C, and remove the supernatant.\nAdd 1 mL of trypsin-EDTA (0.05%) to the sample and transfer it to a 1.5-mL Eppendorf tube.\nIncubate the sample at 37°C (30–45 min) and vortex it every 5 min.\nPass the sample through a 35-μm cell strainer.\nNote: Cells should be dissociated into single cells after this step. Single cell-grown organoid can be compared with the organoid from the previous passage to assess organoid forming efficiency and growth.\nInactivate trypsin with 3 mL of 10% FBS DMEM medium and pipette vigorously.\nCollect the cells in the 15-mL tube and centrifuge them (180 g, 4 min) at 4°C.\nAspirate the supernatant and resuspend it with 50 μL of ice-cold E-MEOM medium.\nPrepare E-MEOM with 10 μM Y-27632 before use.\nThis medium will be used for 3 days after seeding.\nCount the cells with 10 μL of cell suspension, check the cells’ viability, and calculate the cell numbers for seeding.\nGenerally, 1,000 cells are used in each well of a 48-well plate.\nNote: More cells (3,000–5,000 cells) can be seeded in a well according to subsequent experiments. Of note, EOs need to be monitored carefully and passaged earlier than day 10 (e.g., viral transduction can be performed with day 4–5 of organoids. In this case, 3,000–5,000 cells can be seeded to harvest enough cells from a well for the experiment).",
    "Transfer the calculated volume of the cell suspension to a new 1.5-mL Eppendorf tube and place it on ice.\nAdd E-MEOM with 10 μM Y-27632 to the Eppendorf tube, up to 8 μL.\nIf you plan to seed 3 wells, prepare 3,000 cells in 24 μL of total E-MEOM with 10 μM Y-27632 in a 1.5-mL Eppendorf tube.\nAdd 12 μL of Matrigel to the cell suspension (for a total volume of 20 μL).\nThe Matrigel should be pre-thawed at least 3 h at 4°C.\nPipette tips should be chilled before use.\nIncubate the cell suspension, mixed with Matrigel, on ice for 5 min.\nNote: Apply gentle pipetting to disperse the cells in the Matrigel and to avoid bubbles.\nPrepare a 48-well plate in the 37°C incubator for 5 min.\nIf the cells are subjected to be seeded in 3 wells, mix 36 μL of Matrigel with 24 μL of cell suspension.\nAliquot 20 μL of the mixture into each well of a 48-well plate. In total, 4 wells will be used.\nBe sure to aliquot the solution in the center of a well. Domes will not be created properly if the solution attaches to the wall of the well.\nIncubate the plate in the 37°C cell culture incubator for 15 min to allow the Matrigel to solidify.\nAdd 500 μL of pre-warmed E-MEOM with 10 μM Y-27632 medium to cover the Matrigel and incubate it at 37°C with 5% CO2.\nNote: E-MEOM should be pre-warmed before use. Or it will disrupt the Matrigel dome formation.\nDay 3.\nChange the medium with fresh E-MEOM medium with 10 μM Y-27632.\nNote: Be careful not to aspirate the Matrigel dome during the aspiration of the old medium.",
    "Note: New E-MEOM medium must be pre-warmed and dispensed gently not to disrupt the Matrigel dome structure.\nDay 4.\nChange the medium with a fresh E-MEOM medium.\nDay 6.\nChange the medium with a fresh E-MEOM medium.\nDay 8.\nChange the medium with a fresh E-MEOM medium.\nCritical: EOs need to be passaged before day 11 on the scale of 1,000 cells seeded in 48 well-plate. Cell viability decreases drastically after day 11. The passaging time point can be shortened if more cells were seeded (e.g., Passaging on days 7–8 is appropriate when 3,000 cells are seeded in a well of 48-well plate).\nOrganoid freezing\nTiming: 1.5 h\nThis section describes how to freeze and store mouse EOs. Prepare ice, ice-cold 10% FBS DMEM, ice-cold Dulbecco’s phosphate-buffered saline, and 0.05% trypsin-EDTA before starting.\nDay 1.\nDiscard the culture medium using an aspirator.\nDissociate the Matrigel by vigorous pipetting with ice-cold 10% FBS DMEM medium. Scrape the Matrigel from the bottom of the well with a 1,000 μL pipette tip.\nCollect the sample and transfer it into a 15-mL tube and place the tube on ice. Fill the tube with ice-cold 10% FBS DMEM medium, up to 13 mL. Collect 2–3 wells together.\nCentrifuge the sample (180 g, 4 min) at 4°C and discard the supernatant.\nNote: Matrigel is not visible after the centrifugation. EOs pellet is embedded in a gel after aspiration if the Matrigel is not dissociated enough. In this case, an additional washing step with an ice-cold 10% FBS DMEM medium or PBS is required.\nWash the sample with 13 mL of cold PBS, centrifuge it (180 g, 4 min) at 4°C, and remove the supernatant.\nAdd 1 mL of trypsin-EDTA (0.05%) and transfer the sample to a 1.5-mL Eppendorf tube.",
    "Note: Dissociation into a single cell does not have to be perfect. Fragmented EOs can be frozen and restored well after thawing.\nIncubate the sample at 37°C (30–45 min) with vortexing every 5 min.\nPass the sample through the 35-μm cell strainer.\nInactivate trypsin with 3 mL of 10% FBS DMEM medium and pipette it vigorously.\nCollect the cells in the 15-mL tube and centrifuge them (180 g, 4 min).\nAspirate the supernatant and resuspend the pellet with an ice-cold E-MEOM medium.\nAdd 900 μL of E-MEOM per cryovial.\nUse 2.7 ml of E-MEOM for 3 vials.\nAdd DMSO to a final volume of 10%.\nKeep the vials on ice until moving them to −70°C.\nTransfer the cells into the cryovials and store them at −70°C for at least 4 h using Corning CoolCell LX Cell Freezing Vial Containers.\nNote: Another controlled-rate freezing method is also available such as Mr. Frosty, which uses isopropyl alcohol.\nTransfer the cryovial to the liquid nitrogen tank.\nAdenovirus transduction\nTiming: 2 h\nTiming: 15 min\nTiming: 15 min\nTiming: 15 min\nThis section describes how to transduce adenovirus into mouse EOs. Adenoviral transduction is a widely used method to transiently express the gene of interest into the cells. In this protocol, we described how to introduce adenovirus into the EOs. This method is beneficial for establishing genetically engineered EOs derived from the mouse models carrying the Cre-LoxP system for gene manipulation (knock-out, knock-in, or inducible expression), using adenovirus encoding Cre-GFP.\nDay 1.\nHarvest the cells from EOs and count the single cells as described in the organoid passaging[href=https://www.wicell.org#sec3.2] section (steps 1–12).\nNote: Any stage of organoid cells can be used, but we recommend using the cells at day 4- day 6 to increase organoid forming efficiency after viral transduction.",
    "Calculate the required volume of adenovirus.\nInfected organoids can be visualized if the virus contains fluorescence, such as GFP.\nWe set the ratio of adenovirus: organoid cell = 1000:1, but the optimized ratio can be different based on the viral vectors and the batch.\nFor example: If the virus stock is 4 × 107 PFUs/μL, 1 μL of adenovirus is required for 4 × 104 cells.\nNote: We did not perform the adenovirus titration here because it was verified from the provider (See key resources table[href=https://www.wicell.org#key-resources-table]), but the titration can be done with a titration kit if the viral vector is prepared manually.\nMix the required cell suspension, virus-containing medium, and Matrigel and place the drop in the center of the well.\nFill E-MEOM medium up to 8 μL after mixing cell suspension and virus-containing medium.\nAdd 12 μL of Matrigel into cell suspension and virus mixture on ice.\nIncubate the plate in the 37°C cell culture incubator for 15 min to allow the Matrigel to solidify.\nAdd 500 μL of E-MEOM with 10 μM Y-27632 medium to cover the Matrigel and incubate it at 37°C with 5% CO2.\nNote: Since our protocol uses adenovirus encoding GFP, virus-infected EOs can be easily visualized by GFP expression 1 day after infection (Figure 2[href=https://www.wicell.org#fig2]D).\nDay 4.\nChange the medium with a fresh E-MEOM medium.\nNote: The fluid waste containing Adenovirus should be appropriately discarded. Bleaching (with 10% final bleach volume) for 20 min is recommended.\nDay 6.\nChange the medium with a fresh E-MEOM medium.\nDay 8.\nChange the medium with a fresh E-EMOM medium.",
    "Critical: The number of GFP-positive cells is decreased 6 days after adeno-GFP virus infection because adenovirus is transiently expressed in the cells. Virus-infected cells should be selected with a marker or fluorescence-activated cell sorting before the signal disappears.\nLentivirus transduction\nThis section describes how to transduce mouse EOs with lentivirus. This protocol will be useful to introduce genes of interest or perform CRISPR/Cas9-based gene editing using lentivirus. Choosing lentivirus containing fluorescent ORF will be helpful to visualize and isolate the infected organoids. Since EOs have autofluorescence in a Keratin layer, avoiding longer emission wavelengths of fluorescence (e.g., RFP) is recommended.\nLentivirus preparation\nDay 1–3. Lentivirus can be produced by using packaging plasmids, Lentivirus plasmid with PEI and Opti-MEM as described elsewhere (Miyoshi and Stappenbeck, 2013[href=https://www.wicell.org#bib9]; Lo et al., 2021[href=https://www.wicell.org#bib8]; Kim et al., 2021[href=https://www.wicell.org#bib7]). We transfected 293T cells with packaging and lentiviral plasmids at Day 1 and changed the medium at Day2. We then collected the media at day 3 using a 0.45 μm filter.\nOptional: Concentrate the virus with Lenti-X Concentrator.\nProduce 500 μL of virus-containing media.\nWe do not perform the virus titration because we establish stably transduced EOs using cell sorting or antibiotics selection. Additionally, we include a positive control, EOs transduced with lentivirus encoding GFP. GFP-positive organoids are traceable in a live cell image and showed more than 80% (46 of 56 organoids) infection rate (Figure 2[href=https://www.wicell.org#fig2]E).\nEO infection\nTiming: 7 h\nTiming: 10 min\nTiming: 10 min\nTiming: 10 min\nTiming: 10 min\nDay 3 (or day 4 if incubated with concentrator).\nHarvest cells from EOs and count the single cells as described in the organoid passaging[href=https://www.wicell.org#sec3.2] section (steps 1–12).",
    "Note: Any stage of organoid cells can be used, but we recommend using the cells at day 4- day 6 to increase organoid forming efficiency after viral transduction.\nPrepare virus-containing medium with polybrene (7 μg/mL in 500 μL).\nAdd polybrene-containing medium to the cell pellet and transfer the cell suspension into a new 1.5-mL Eppendorf tube.\nCentrifuge the tube for 1 h with 600 g at ambient temperature (set the temperature at 32°C if possible).\nNote: Centrifuge at 20°C–25°C is also applicable. We confirmed that the infection efficiency is comparable to that of the cells infected at 32°C.\nIncubate the tube in the 37°C incubator for 4 h.\nCentrifuge the tube (380 g, 5 min) at 20°C–25°C.\nNote: Use swinging centrifuge if concentrator is applied.\nWash the tube with PBS and centrifuge it again if concentrator is applied.\nRemove the supernatant, resuspend the cell pellet with an appropriate volume of medium (8 μL in each well of a 48-well plate) and place the tube on ice to cool down.\nNote: The fluid waste containing adenovirus should be discarded properly. Bleaching (with 10% final bleach volume) for 20 min is recommended.\nAdd an appropriate volume of Matrigel to the tube (12 μL of pre-thawed Matrigel to each well of a 48-well plate).\nSeed the cells in the center of the well in a 48-well plate and incubate at 37°C for 15 min.\nAdd E-MEOM medium containing Y-27632 (10 μM) to the well.\nDay 5.\nReplace the E-MEOM medium with the antibiotic based on the selection cassette of the viral vectors (puromycin 0.4 μg/mL, blasticidin 2 μg/mL).\nNote: Virus-infected organoids can be visible 48 h after infection if a fluorescent vector such as GFP is used (Figure 2[href=https://www.wicell.org#fig2]E).\nDay 7.",
    "Replace the medium with the selected antibiotic (puromycin 0.4 μg/mL, blasticidin 2 μg/mL).\nDay 9.\nReplace the medium with the selected antibiotic (puromycin 0.4 μg/mL or blasticidin 2 μg/mL).\nDay 11.\nReplace the medium with the selected antibiotic (puromycin 0.4 μg/mL or blasticidin 2 μg/mL).\nPassage the EOs and keep the selected antibiotic if positive cells are not sufficiently selected.\nNote: The antibiotic concentration should be optimized to kill only uninfected cells."
  ],
  "subjectAreas": [
    "Organoids",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}