{
  "id": 10427,
  "origin_website": "Jove",
  "title": "A Cross-Disciplinary and Multi-Modal Experimental Design for Studying Near-Real-Time Authentic Examination Experiences",
  "procedures": [
    "Procedures were approved by the Institutional Review Board (IRB) under a general review at Utah State University for studies on human subjects and use of these constructs. The typical results include two semesters of an engineering statics course, each with a slightly different experimental setup, at a western institution of higher education in the United States. Practice exams, whose content paralleled the actual exams, were developed by the course instructor and were used for our study. Please note that the protocol outlined below describes concurrent steps, and some steps may overlap.\n1. Considerations for Experimental Designs and Integration of Disciplinary Practices\nAs researchers consider experimental designs of this nature, disciplinary knowledge and approaches must be integrated in a way that complements and sustains the main research goal. As new instruments and methods are added, additional validation considerations are needed. In this work, we will explore an experimental study where surveys and electrodermal sensors were used for one of the semesters (experimental design A), and salivary biomarker collection (i.e., cortisol and sAA) was added to the subsequent semester (experimental design B). Below are the considerations for the two setups:\nExperimental Design with Surveys and Electrodermal Sensors\nElectrodermal sensors are sensitive. Participants’ startle responses, if unintentionally activated, can create a significant spike in EDA response. This is particularly important when considering multiple participants for data collection, whose actions may enhance these startle responses. As such, be sure to set up the workspace carefully to minimize as many distractions as possible. As shown in Figure 1, include a testing shield if exploring examination experiences for an individual or group of individuals.",
    "NOTE: To increase the ecological validity of the testing environment, plan to provide any material that a student would be using on their actual exam (e.g., workbooks, equation sheets) to allow participants to reflect upon and work out any needed exam problems\nElectrodermal sensors provide a signal every 1/4th of a second. To allow an event to be defined and studied, implement a plan to collect a precise measure of the onset of a task. When time synching electrodermal sensors with surveys, make sure that the presentation of the survey question is synchronized to the electrodermal sensor by using the internal clock of the computer to establish a data collection timeframe (see Figure 1). If using any Bluetooth-enabled electrodermal sensors (e.g., see Table of Materials), synch times in Greenwich Meridian Time (GMT) to account for time zone changes and daylight savings time differences during data collection procedures30.",
    "NOTE: If using a web server for the presentation of stimuli (e.g., test question, survey item, etc.), be sure to align the times between the server and the computer internal clock as these are not typically synched. Note that it may be necessary to pre-install a cross-platform web server (e.g., XAMPP or other Apache servers) to each computer used for the study. If intending to sync a web camera for video recording purposes, consider using security software that allows recording of the date, time, hour, minute, second and millisecond (e.g., 01/01/2000 04:01:02:05) of the video. Note that this video must also be synched with the computer’s internal clock and the other devices (e.g., EDA sensor). Set the web cameras to measure the participant’s face at different angles, if needed. We recommend that for a frontal faced web camera; the video is positioned parallel to the workstation surface and for downward facing web cameras to position the video at 30° to 45° from the workstation surface to the participant’s face.\nPlace the electrodermal sensor on the non-dominant hand of the participant to minimize any noise in the signal due to movement or electrode contact error during data collection, as suggested in a prior protocol30. If researchers would like to minimize artifacts in the EDA due to movement, one alternative is to include a wrist gel pad in a location that is comfortable to the participant and that simultaneously allows them to rest their non-dominant hand on.",
    "NOTE: The placement of the laptop computer, gel pad, sensor, exam sheets, and other elements in the study must be standardized to ensure repeatability across examination conditions and semesters. As shown in Figure 1, painter’s tape was used to center each item (e.g., laptops, exam sheets, cameras) of the experimental setup consistently across participants and semesters of data collection.\nFor electrodermal sensor readings, establish a period during which participants have achieved a relaxed state to establish baseline EDA data31. For this, either indicate a time at the beginning of the exam for participants to stare at the testing shield (~5–15 minutes) or program this cue into the laptop computer as part of the timestamping program. Upon completing this period, participants can commence with any pertinent surveys and exam questions. In the same vein, assign a relaxation period at the end of the exam experience.\nExperimental Design with Surveys, Electrodermal Sensors, and Salivary Biomarkers\nWhen integrating electrodermal sensors with surveys and salivary biomarkers, ensure that disruptions are minimized to the best extent possible. As one strategy, create a training video to help participants understand how to provide their salivary samples at set time periods of the exam according to manufacturing specifications (see Table of Materials) to minimize interruptions from the researchers.",
    "NOTE: In this study, the researchers were interested in collecting saliva during four time-points: beginning, middle, end, and post-exam. However, researchers can choose other times they deem appropriate for their study. Also, we used the swab collection method32 instead of its passive drool method33 for ease of use and faster sample collection times. Also, we selected cortisol34 and sAA35 kits (see Table of Materials) and followed manufacturer specifications in its processing. However, if your group does not have a biological lab to conduct these forms of testing, other providers may be able to analyze the samples32,36.\nWhen collecting saliva samples, have a cooler with dry ice with an internal temperature of -20 °C; this will prevent room-temperature degradation of enzymes for the cortisol samples34. If collecting salivary alpha-amylase, its stability is much longer (~five days at room temperature and allowing for 5 freeze-thaw cycles35). If collecting both, as was the case in this study, follow the guidelines needed to store salivary cortisol samples according to manufacturer recommendations34,35.\nIf using the swab collection method25, have the swab remain either in the inner cheek or under the tongue of the participant for 60 s. When handling the vials and sample collection caps, follow manufacturer protocols34,35 and convey the information to participants before the commencement of the study.",
    "NOTE: If the experiment is more granular (e.g., question by question data collection), make sure to record the onset and offset times of each salivary sample collection, as these may need to be accounted for in the EDA analysis. The same applies to the onset and offset of survey data collection times. For salivary data collection, our group developed a flagging system to allow participants to notify the researcher/proctor when a salivary sample was ready to be collected. Consider designating multiple proctors to assist with during an experimental session in case multiple salivary samples are ready to be collected and stored.\n2. Setup and cleaning pre- and post-experiment\nSurveys\nIn survey form, organize a scheduling process, designate participant IDs, and collect any demographic information, as needed. Also, establish or pre-label any pertinent survey questions in preparation for data export. This will enable faster and more efficient data cleaning, management, and statistical analyses.\nSync the survey presentation and exit times throughout the exam protocol. If integrating sensors or video, sync these technologies with the survey software as well.\nAs a matter of courtesy and in the interest of contributing to a cordial and welcoming research environment, and if instructors agree, set up an automated follow-up email containing responses to the exam questions to be sent to participants immediately or soon after their participation in the session.\nElectrodermal Sensors\nPlan to pre-schedule participants to an examination session/time, assess any medical information and dietary habits for EDA and saliva collection30 and hand dominance for EDA collection30, and remind participants to avoid consumption of sugary or caffeinated products the day of the experiment. This is important as certain medical conditions (e.g., metabolic disorders) and dietary habits (e.g., caffeine consumption) can influence EDA (and salivary values), as suggested in a prior protocol30.",
    "Before participants arrive, make sure sensors are correctly calibrated, software updates have been taken care of, and sensors have been cleaned with 70% alcohol wipes30.\nWhen fitting the EDA sensor on a participant’s wrists, make sure to place it on the participant’s non-dominant hand. To fit the EDA sensor:\n\t\t\nPlace the sensor with the button facing down towards the thumb.\nWith their palms facing up towards their face, have participants draw an imaginary line from the space between the second and third finger of their non-dominant hand to their mid-wrist area and place the sensor electrodes there.\nAsk participants to fit the sensor straps in a way that is not too tight or too loose.\n\t\t\tNOTE: A representative image of this fitting can be found in Figure 2.\nWhen starting the sensor, be sure to follow manufacturer protocols31 to ensure the sensors are set up to collect data. In this experiment, the protocol is tailored to use with a particular brand of sensors (see Table of Materials), although researchers are welcome to use any physiological sensor of their choosing.\n\t\t\nFor devices used here, depress the sensor button for three seconds. A green light will blink intermittently, followed by a red blinking light, and then a fade-out occurs.\nDuring fade-out, to make sure the sensor is ON, press the button once for less than 1 s. If it blinks red, it is indicating that it is recording data.\nWhen turning the sensor OFF, press the button for 3 s. The sensor will turn off if the lights on the bottom of the wristband go from green to fade.\nTo retrieve the data from the sensor, connect it to the computer, and upload the data in the managing software system according to manufacturer recommendations31.\nSalivary Biomarkers",
    "As stated before, pre-assess any medical conditions or dietary habits that may influence salivary values during analysis. Also, remind participants not to wear any lip balm, make-up, or products near the lips when they arrive at the session, as this could introduce contaminants that may influence cortisol and salivary alpha-amylase samples. If participants arrive wearing these products, gently guide them to a restroom or provide appropriate wipes that would remove these products without introducing other chemicals (e.g., water on a napkin versus make-up remover towels). Finally, clear experiment rooms of food or drinks that have a strong smell (e.g., pizza, oranges) that may enhance salivary production among participants.\nUpon participants’ arrival to the experimental room, hand participants 1 ounce of water poured into a cup in their presence. Ask them to swish and swallow the water. This is done to clear the mouth of any food residues that may influence the cortisol and salivary alpha-amylase data.\nIf collecting EDA data in conjunction with saliva, gently remind participants to minimize hand movement in the hand that has the EDA sensor. As such, participants will need to be informed that any saliva sample collection provided has to be done in their dominant hand. To facilitate this process, it is recommended that the experimental setup includes pre-labeled vials and a stand to minimize any loss of samples (refer to Figure 1).\nWhen collecting salivary samples, wear fresh nitrile gloves to minimize any dust particulate or any other contaminant from hand oils to be transferred to the salivary sample vial.\nAs indicated previously, immediately transfer the samples to a cooler that has an internal temperature of -20 °C.\n3. Increasing ecological validity in light of surveys, electrodermal sensors, and salivary biomarkers\nConcerning exam authenticity",
    "To provide an authentic testing experience, align the exam content with course content. For this, review the course content in conjunction with a group of content experts, including the course instructor.\nSelect an evaluation (test or assessment) of the course content that can be replicated in an experimental setting, or that can complement existing course content (e.g., practice exam).\n\t\tNOTE: Depending on the Institutional Review Board policies of your institution, using real exams may not be allowed due to its potential harm to students’ grades in the course. As such, an equivalent experience (e.g., practice exam) may be considered instead.\nAlongside the instructor, develop an answer key and exam problems and its solutions to be used to collect performance data at a granular level (i.e., question by question) and/or macro-level (i.e., entire exam) depending on the goals of the research\nAsk the instructor also to provide any additional materials that are typically used in their exams (e.g., cheat sheets) or any allowable materials (e.g., textbooks, list of references) typically used in their courses. Experimenters should be prepared to provide these tools to the participants.\nMake sure that the testing environment parallels the experimental setup (e.g., exam times, the offering of exam—testing center or classroom, etc.) and its features such as desk space, lighting, the temperature of the room, among others.\nConcerning survey inclusion\nDepending on the number of survey questions, it will be important to account for the approximate times; it might take participants to complete the survey questions while they are taking their exam.\nAllot additional test-taking time to account for interruptions and design the examination program to return students to a particular exam problem if a survey prompt interrupted them. Also, be sure this interruption time is consistent across participants (e.g., beginning, middle, and end of the exam).",
    "Depending on the type of experimental design, if the granular type of responses is needed (e.g., question by question), plan to present the exam problem first, then prompt participants to respond to the survey question, and then allow participants to enter their response (e.g., open-text, multiple choice, etc.). This will allow participants first to view the problem and respond to the survey question according to the presented problem. If the experimental design is on a macro-level, make sure that participants are allowed to reflect on the exam experience up to that point before responding.\n\t\tNOTE: Theories and hypotheses are important to consider in this step as the choice of the particular kind of presentation of an item (e.g., survey, exam) will matter. For example, if studying self-efficacy, this is best assessed at the level of the test question, while academic achievement emotions are typically asked pre-, during-, and post-exam.\nConcerning electrodermal activity sensors \nTo ensure participants are not being overly stressed due to the experimental protocol, include calibration and relaxation periods throughout the exam experience. One strategy could be to allow participants to refocus their attention between questions. Beginning with a simple-to-respond question (e.g., “what day of the week are we in?”) and allow participants 30 s to rest in between each exam question.\n\t\tNOTE: Keep in mind that understanding the design of the exam questions itself and predicting what students’ reactions may be important (e.g., increased cognitive loads or neural efficiencies37) as they could influence the salivary marker and EDA data collection. For example, the exam questions should all be in the form of essay entry, which would require hand movement that can influence EDA data24,25 or an exam may be designed by varying levels of difficulty, which could influence students’ cognitive loads or neural efficiencies37.",
    "Ensure that the time stamping program will account for any changes in the examination experience (e.g., calibration periods, onset and offset of in-between calibration questions, survey questions onset and offset, start and finish of the exam). This is an important step as it will allow for data source matching, which will determine the intervals or events to be processed and analyzed.\nConcerning salivary biomarker use \nBe mindful of when to collect salivary biomarkers.\n\t\tNOTE: Salivary bio-marker studies typically are explored through a pre-pre-mid-post-post-post design32,33,34,35,36. As cortisol takes 20 minutes to respond to stress14, these time lags are needed to observe cortisol onset and recovery. In the case of students’ preparing for an exam, participants may be worried about taking the exam, and, thus, a before-onset measure may not be possible. It is also important not to interrupt students frequently during the exam. In our study, we opted to collect saliva once before onset, once during, immediately after, and 20 minutes after the exam as quietly as possible to minimize disruptions. A sample testing timeline is provided in Figure 3.\nIn the examination program, include timed prompts to cue participants when it is time to collect saliva. Include a 60-s timer, so participants are aware of the duration of the salivary collection. Return participants to the problem they were working on in the exam once the 60 s are complete.\n4. Considerations for data processing and analysis\nSurvey\nBe sure that data outputs are labeled and organized appropriately to allow for effective data management and ensure statistical programs (e.g., SPSS, SAS) can perform any needed analysis.\nIdentify any potential outlier data based upon standards for survey outlier detection38 as well as any determined through the demographic data collected previously (e.g., medical conditions).",
    "Determine the type of statistical analysis and/or modeling to conduct based upon the established research question(s) and/or hypotheses\nElectrodermal Activity\nNote that electrodermal data outputs may vary by company. For the device used in this study31, data outputs are presented as a single column with a starting time measured in GMT, followed by the frequency of data collection and the EDA measured in microSiemens. The EDA data then increments according to the frequency of data collection. Since the data is dependent on the time of onset, convert this time to UNIX time according to manufacturing protocols and previous protocols30. This will allow more seamless synchronization of the EDA data changes throughout the experiment.\nIdentify and remove any potential manufacturer sources of outliers, such as sensor malfunction, incomplete data collection, or poor contact of the electrodes in the skin. These will be identified by negative values or constant near-zero continual data segments in the data output sheet.\nIdentify and remove any potential user-generated sources of outliers such as erratic movements (e.g., hand hitting desk or nervous tapping), survey or salivary biomarker collection periods, or large changes in body temperatures or blood volume pressure readings.\nTo remove noise due to movement, do the following series of steps:\n\t\t\nFirst, scan through the participants’ accelerometer (ACC) profiles, also provided by the wrist sensor. Note that the data will have X, Y, and Z columns indicating three-dimensional horizontal, vertical, and spatial hand movements, respectively. Calculate the moving average of this accelerometer data according to the Euclidean Distance (L2-Norm)39,53 equation to calculate the total movement:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60037/60037eq1.jpg\nCalculate the standard deviation of the Euclidean distance values for the entire participant set and rank-order them. Calculate the average values of the Euclidian distance values too.",
    "Calculate the coefficient of variance of the Euclidean distance values to determine the signal-to-noise ratios40 according to the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60037/60037eq2.jpg\n\t\t\tNOTE: Coefficient of variance values that exceed a score of 1 indicates an outlier and must be removed from analysis according to recommendations in handling signaling data33.\nOnce the noise due to movement is removed, determine the needed threshold to filter the data. For this, calculate the upper and lower limits of the 95% of the standard deviation of the signals. Any data outside these ranges can be either removed from the dataset/analysis or imputed according to the researcher´s goals and objectives. For this study, we opted to average the outside ranges with the determined acceptable data.\nReturn to the EDA data and use the time-stamped accelerometer data to identify the corresponding intervals of EDA (which have also been time-stamped).\n\t\t\tNOTE: To sync accelerometer and electrodermal data, note that the recording frequencies are different (4 Hz for EDA and 32 Hz for ACC) so they must first be aligned. Since, inherently, there will be more ACC data than EDA data, use the average EDA values to account for this difference.\nOnce EDA data sets have been cleaned41,42 though the filtered accelerometer data, proceed to separate the tonic (baseline) and phasic (immediate, reactive) signals using prescribed tools (e.g.., Ledalab, EDA Explorer)43,44, for statistical analysis, primarily the phasic, filtered EDA data are used and values (e.g., magnitudes, number of peaks, latency times) are calculated based upon the research question/hypothesis and using methods described by Bouscien22,23.\nSalivary Biomarker\nFor both cortisol and salivary alpha-amylase assays, follow manufacturer protocols22,23,24,25,26,27,28 and technician recommendations about terms of use, storage, and handling samples.",
    "Spin thawed samples at 1,500 x g at 4 °C. Be sure to remove the swabs carefully and that the vials have salivary supernatant at the bottom of the vial to ensure mucin separation.\nAs good practice, before following the assay protocols, do a buffer rinsing of the wells using a plate washer before processing. This is particularly important for cortisol.\nEnsure that the optical density plate reader has been pre-programmed to the appropriate temperatures (e.g., sAA samples require incubation temperatures of 37 °C whereas cortisol samples require room temperature readings) and wavelengths (i.e., sAA requires 405 nm and cortisol requires 450 nm and 490–492 nm reference filters). For sAA assays, it is recommended that the plate reader used has both a shaker and an incubator inside.\nFollow manufacturer protocols34,35 to calculate the concentration values of each sample and the corresponding intra- and inter-assay percent of the coefficient of variation (%CV) equations to identify outliers from the data set (this is calculated differently compared to the equation provided previously). Please note that, for sAA, keep track of the lot numbers used in the controls as they are not standardized.\n\t\t\nFirst, average the %CV of the controls by lot number and then average these values to get a grand average %CV score.\nFor samples, the manufacturer recommends that the intra-assay of samples should have a %CV under 10% while the controls should have an inter-assay %CV under 15%34,35. However, these %CV values will significantly depend on the laboratory conditions and equipment used to conduct the research. As such, consider alternate methods of immunoassay assay validation as needed45.\nFreeze saliva samples at -80 °C after the assay to allow verification of its validation. Do not freeze thaw more than once to prevent further enzymatic degradation of the samples or controls.\nData Triangulation",
    "Depending on the research question or hypothesis, correlate relevant variables. Ensure that all outliers and data are appropriately pre-processed and filtered before use46.\nDetermine if the sample size, data collection points, observed statistical power, and research questions or hypothesis necessitate amalgamating data47, or utilizing repeated-measures analytic techniques48,49,50.\nAccounting for inter-individual differences in task time51 and the delay in response of salivary biomarkers to stress14, use timestamps, or determine events to sync datasets together.\nUsing statistical models and software, analyze the data set, and interpret findings.\ncontains the 16 zip files.  Each zip file contains all of the EOL quizzes for a given Core chapter.  They will want to unzip this file, and then each zip file gets loaded individually into Canvas.  Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}