{
  "id": 18652,
  "origin_website": "Jove",
  "title": "A Simple Critical-sized Femoral Defect Model in Mice",
  "procedures": [
    "NOTE: This protocol is designed for female nude (Nu/J) mice (18-25 g, 6 weeks) acquired from Jackson Laboratories. Since strains of mice vary slightly in terms of anatomy and growth rate, we advise that the fabrication of pins is optimized to the strain, gender and age of the recipients prior to implantation into live subjects. If the strains are carefully matched, the interference fit between the pin and marrow cavity is highly reproducible. Procedures for housing, diet and general animal husbandry are beyond the scope of this protocol, but all mice were housed in accordance with the Guide for the Care and Use of Laboratory Animals (8th Edition) and institutional policies set by the Institutional Animal Care and Use Committee (IACUC) and Department of Comparative Medicine (DCM) at Scott and White Hospital.\n1. Fabrication of Pins\nimgsrc://cloudfront.jove.com/files/ftp_upload/52368/52368fig2highres.jpg\nFigure 2: Pin assembly. (A) Photographs of the surgical steel tubing at various stages of assembly and a 4 mm diameter cylinder cut from 5 mm thick Gelfoam sheet. (B) After polishing the assembled pin (above), the Gelfoam cylinder is trimmed, positioned over the steel collar (middle), then autoclaved, resulting in a sterile pin coated with dried Gelfoam. This improves cell attachment at the site of injury and maintains the direction of healing (below). (C)  An excised femur fitted with the medullary pin. (D) Examples of pin assemblies at various thicknesses and lengths demonstrating the flexibility of this approach. (E) µCT reconstruction of a pin-stabilized femoral defect illustrating the interaction of the medullary pin with the trabecular bone in the proximal and distal ends of the femur.",
    "Cut a 9 mm length of 22 G stainless hypodermic tubing, and a 3 mm length of 19 G tubing using a 23.8 mm diameter fiberglass reinforced heavy duty cut-off wheel fitted to a rotary tool. Use small fine-tipped pliers to immobilize the tubing (Figure 2A, above). Wear appropriate eye protection and handle rotary tool with care.\nPlace a small amount (approximately 10 µl) of cyanoacrylate adhesive to the middle of the 9 mm shaft. Pass the 3 mm collar over the 9 mm shaft until in the center and twist to evenly distribute the glue between the collar and shaft. Measure dimensions with a pair of digital calipers and compare with Figure 1. Allow to set for at least 15 hr (Figure 2A, center).\nUse a 220 grit emery-impregnated disc to remove burrs and excessive glue.\nUsing the rotary tool, polish the pin using a felt polishing disc.\nRinse with deionized water and dry with compressed air.\nTest integrity by placing a 19 G hypodermic blunt needle over the shaft of the newly made pin and push against the collar. Ensure that the collar can resist approximately 25 g of weight.\nRinse the pin in sterile-filtered phosphate buffered saline (Figure 2B, top). Ensure that the shaft of the pin fits snugly into the femoral medullary cavity with the collar flush against the edges of the cut bone (Figure 2C). Prototype various configurations for the specific purposes of the study and the recipient (Figure 2D). Make sure that the ends of the pin penetrate into the trabecular bone of the diaphysis so as to maximize fixation and improve the interference fit (Figure 2E).\n\tNOTE: It is recommended that the fit is tested on bone specimens before implantation in live mice (e.g. Figure 2C).",
    "Use a 4 mm diameter punch-biopsy cutter to cut a cylinder from a 5 mm thick sheet of surgical gelatin sponge. Use a scalpel to trim the cylinder to 3 mm length and pass a 20 G hypodermic needle along the length of the cylinder to generate a hole (Figure 2A, below).\n\tNOTE: We have found that the positioning of a gelatin or collagen scaffold at the site of the defect improves cell retention and induces longitudinal growth along the axis of the bone.\nPass the gelatin foam cylinder over the pin and align with the collar (Figure 2B, center) and autoclave on a dry cycle at 120 °C at 15 psi. The gelatin foam will dry and darken in color (Figure 2B, below).\n2. Surgical Technique\nNOTE: The following procedure is written observing all guidelines set by the Guide for the Care and Use of Laboratory Animals (8th Edition). Please observe all additional policies set by the local IACUC and ensure an IACUC-approved animal use protocol (or equivalent) is in place before proceeding with the following sections.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52368/52368fig3highres.jpg\nFigure 3: Surgical instruments. (A) Surgical kit. Micro-drill (1), cutting wheel (2), absorbable suture (3), outer suture (4), scalpel blades (5), scalpel handle (6), sterile medullary pins wrapped in foil (7), medullary depth gauge made form hypodermic tubing (8), fine nosed forceps (9), rat-teeth forceps (10), blunt reaming needles (11), needle drivers (12), small hemostats (13), fine scissors (14), periosteal elevator (15), modified Kern forceps (16). (B): Modifications required to produce Kern-style bone-grips for mice.\nSelect a surgical procedure room or clean laboratory with a closable door and no through-traffic. Sanitize a suitable work surface with a clinical grade quaternary-based disinfectant cleaner.",
    "While wearing disposable sterile gloves and robe, set up a sterile field of approximately 60 x 90 cm2 on the sanitized work surface with autoclaved cloth drapes.\n\tNOTE: It is advisable to have an assistant remove the outer packaging and present the sterile materials to the investigator setting up the field.\nPlace a sanitized heating pad fitted to a warm water re-circulator on the drape and cover with sterile disposable drapes. Warm a bead sterilizer to operating temperature (250-265 °C, this takes up to 30 min).\nOn the sterile field, arrange the surgical kit (Figure 3A) to provide convenient access to all components. Also, provide sterile cotton gauze (2 x 2 inch2), sterile Q-tips, a sterile steel bowl (500 ml) containing sterile saline (0.9% w/v), and chlorhexidine/isopropyl alcohol surgical disinfectant applicators.\nAssemble a small animal anesthesia unit next to the sterile field with an induction chamber and nose-cone assembly in accordance with veterinary guidance and the user manual. Use clinical grade oxygen as the gas supply and isoflurane, USP.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52368/52368fig4highres.jpg\nFigure 4: Surgical procedure. (A-C) Approach and exposure of the femur. (D-E) Elevation and cuts. (F-K) Reaming and sizing of medullary canals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52368/52368fig5highres.jpg\nFigure 5: Surgical procedure. (A-B) Installation of pin. (C-D) Closure. (E) Typical image of properly positioned pin 24 hr after surgery.\nPlace a mouse in the induction chamber of the anesthesia system and set the output to 2 L min-1 O2 and the isoflurane concentration to 3% (v/v).",
    "Check that the mouse is unconscious within 1 min; raise the concentration to 4% (v/v) if necessary. Remove the mouse, place on sterile field with the heating pad positioned underneath  and apply the nose cone. Transfer flow to the cone, and reduce the isoflurane to 2.5%, wait for a further 20 sec, and test for adequate surgical plane in accordance with institutional policy. Typically, lack of a hind limb reflex when gently squeezed is adequate for determining adequate anesthesia.\nDuring the entire process, have an assistant monitor for strong regular breathing and pink coloration of the extremities and mouth region to ensure an appropriate level of oxygenation while unconscious. Adjust anesthesia in accordance with veterinary guidance and institutional policy if necessary. Apply sterile artificial tears lubricant ointment (15% (v/v) mineral oil, 83% (v/v) white petrolatum) to the eyes.\nTurn the mouse onto one side with the hind-limb facing upwards on a new disposable drape. If necessary, remove fur with an electric razor or hair removal cream. Wipe the site with sterile saline and remove the additional drape with excess fur. Place a new fenestrated drape over the mouse so as to cover all parts but the entire hind-limb (Figure 4A) but maintain view of the face and paw to monitor coloration and breathing.\nLocate the proximal and distal ends of the femur and incise the skin for 5-10 mm along the longitudinal axis (Figure 4B). Separate the skin layer from the fascia with a #15 scalpel, exposing a lateral approach to the femur via the biceps femoris and vastus lateralis. Locate where the septa of both muscles meet (it is a line of white tissue against the pink coloration of the muscle). With a scalpel, carefully dissect along the intermuscular boundary until the femur is visible (Figure 4B).",
    "Develop the incision with a blunt periosteal elevator so as to expose the entire diaphysis (Figure 4C). Use the elevator to further expose the central two thirds of the femur while taking care to preserve the posterior neurovascular bundle on the medial side (Figure 4D). Gently scrape soft tissue off of the bone with a scalpel, and dry with a sterile Q-tip or equivalent.\nLocate the center of the femur with calipers if necessary and mark with a sterile scalpel or marker, then mark 1.5 mm proximally and distally from the center. Gently grasp the femur using a pair of fine-nosed forceps previously fashioned in the Kern style to prevent excessive pressure on the bone.\n\tNOTE: Exact dimensions for modifications are provided in Figure 3B. It is advisable to test the forceps on a euthanized specimen prior to use to ensure the bone will not break under pressure required for immobilization during cutting.\nUsing a fine drill fitted with a fine diamond-grit coated cutting wheel (8 mm diameter x 0.1 mm width), make the first cut with the elevator in place to protect tissue below (Figure 4E). Raising the cut femur to 45° while firmly holding the extremity of the diaphysis, make the second cut, removing a 3 mm segment.\n\tNOTE: Face protection is recommended at this stage.\nWith the bone immobilized by forceps, carefully ream the medullary cavities of each end with a blunt 23 G hypodermic needle. Using a pre-made depth-gauge made from a length of 22 G tubing placed in 19 G tubing (Figure 3A, item 8), assess the depth of the reamed medullary cavity and ensure it is 3 mm (Figure 4F-K). If the medullary cavity resists the 22 G depth gauge, ream again with a blunt 22 G hypodermic needle.",
    "Carefully insert the medullary pin into the proximal then distal medullary cavities to bring the femur back out to its original length and establish a stable 3 mm gap (Figure 5A, B). If needed, apply a small amount of manual stress to achieve a good interference fit of the rod with the cortical bone of the femur. Ensure that the pin fits snugly into the medullary cavities of both sides and the edges of the cut bone are flush with the collar. If there is a gap, ream once again with a 22 G blunt needle.\nReposition the muscle and peripheral tissue over the pin and close with a continuous absorbable 5-0 suture (Figure 5C). Close skin incision with 5-7 square knot nylon 5-0 sutures and seal with surgical adhesive (Figure 5D).\n3. Postoperative Procedures\nAfter closing the skin incision, withdraw anesthesia, but allow O2 to remain flowing until the mouse begins to move; this should take less than 1 min. If the mouse remains motionless after 5 min of O2 administration, refer to institutional policies on veterinary intervention.\nWhen the mouse begins to move, gently transfer it to a cage preferably containing dry, autoclaved bedding.\n\t\nPlace an igloo-type nest in each cage and the mouse will retreat into it, reducing movement. Check that the mouse recovers hind-limb mobility 5-10 min after recovery of consciousness.\nPerform daily postoperative monitoring in accordance with institutional policies. Provide gelatinized hydration and food on the floor of the cage for the first 5-7 days and administer analgesia and postoperative monitoring in accordance with institutionally approved policies.\n\t\tNOTE: We administer 0.05-0.1 mg kg-1 buprenorphine24 with 0.25 ml saline subcutaneously, twice daily for the first 3 days and thereafter if the mouse does not regain normal utility.",
    "After the first 24 hr of recovery, perform live-animal X-ray imaging under anesthesia to visualize pin placement (Figure 4E). If the pin is dislocated, consider immediate revision surgery.\nAt day 7 post-surgery, remove sutures under anesthesia and house in groups in accordance with institutional animal husbandry policies.\nAfter 2-5 weeks, humanely euthanize animals in accordance with the American Veterinary Medical Association approved methods for euthanasia25.\n\tNOTE: An intraperitoneal injection of commercially available barbiturate-combination euthanasia cocktail is effective and humane, but local institutional policies on euthanasia should be followed.\nCarefully dissect away the hind-limb by exposing the proximal femur and the pelvis from the medial side. Gently press the joint inwards from the lateral side of the limb while detaching the femoral head from the acetabulum (the hip socket) with a scalpel. Cut remaining muscle and skin with a sharp scalpel or micro-scissors, releasing the entire limb form the pelvis. With a sharp pair of rongeurs or heavy scissors, cut the lower hind-limb (tibia/fibula) approximately 5 mm below the knee joint.\n\tNOTE: It is recommended that all specimens are stored in an identical manner prior to analysis.\nRemove skin, but leave muscle in place. Fix the tissue in 10% buffered formalin supplemented with 10 mM CaCl2 fixative for 1 week followed by storage in phosphate buffered saline supplemented with 10 mM CaCl2 for up to 1 month prior to imaging. Perform fixation and storage at 4 °C. Alternatively, scan specimens immediately without fixation.\n4. Analysis of Specimens",
    "NOTE: Bone healing can be assessed by a wide variety of methodologies that are beyond the scope of this protocol. The following is a method that we have successfully employed using a specimen microCT (µCT) imager. It is recommended that the following parameters are tested initially, then optimized for the specific needs of the project.\nWrap specimen in a thin layer of plastic sealing film and position it vertically in the instrument chamber. Make sure that the femur is perpendicular to the sample stage during the entire scan. Set the scan to the following parameters; voltage = 29 kV, current = 661 µA, power = 19 W, image pixel size (μm) = 21.00; 360 degree rotation = yes; frame averaging = on (5); rotation step (deg) = 1.00, random movement = on. Save images as JPEG files in a single destination folder per scan (e.g. Figure 6A).\n\tNOTE: The scan should be complete in 57 min.\nUtilize the reconstruction software to generate axial images based on the following parameters; smoothing = on (4), misalignment compensation = on, ring artifact reduction = on (5), beam-hardening correction (40%), CS rotation (deg) = 0.00. Set output to 2,000-15,000 Hounsfield units. Save images as JPEG files in a single destination folder per scan.\nUsing the axial images and analytical software, define the region of interest (ROI) by first setting the proximal and distal edges of the original defect. Achieve this by selecting the sections that encompass the collar only. Because the collar is thicker than the medullary pin, these sections are easily defined (Figure 6B, left). Exclude the collar from calculations by drawing an exclusion zone around it (with a 100 µm margin) and transferring the zone to each of the sections in the ROI (Figure 6B, right).",
    "NOTE: Polar moments of inertia, 3D reconstructions and calculations such as the volume of new bone (Figure 6C, D) can readily be achieved using the software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}