{
  "id": 6761,
  "origin_website": "Bio",
  "title": "Mesenchymal Stromal Cells Derived from Bone Marrow and Adipose Tissue: Isolation, Culture, Characterization and Differentiation",
  "procedures": [
    "Surgical procedureEuthanize the rat using isoflurane according to the local regulations.Disinfect the rat by completely bathing with 1% iodized ethanol (Figure 1A) and wipe the abdomen and lower limbs with 2.5% chlorhexidine.Transfer the rat in a sterile surgical drape.Wear a sterile coat, mask, cap, and gloves.To prevent contamination, use sterile scissors and forceps, to make a small bilateral incision in the skin of the femorotibial joint region (Figure 1B).Use this incision as an access point to perform a bilateral divulsion toward the abdominal and inguinal region.Make a horizontal cut to join the two previously made incisions (Figure 1B).Using a #15 scalpel blade attached to cable #3, cut the patellar tendons, and the lateral and medial collateral ligaments bilaterally to expose the joint capsules.Perform joint capsule divulsion bilaterally.Remove the muscle tissue to expose the anterior part of the femur (Figure 1C).Cut the remaining ligaments and disarticulate the femoral hip joint.Remove the femur, and quickly clean off the majority of muscle and connective tissues attached to the bone.Transfer the femur to a 50-ml conical tube containing 15 ml of transport medium.Retract the skin from the abdominal and inguinal regions (Figure 1D).Carefully remove all adipose tissue without puncturing the abdominal wall and transfer it to a 50-ml conical tube containing 15 ml of transport medium.Take the conical tubes containing the fat tissue and femurs to the laminar flow hood.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212045_1852.jpgFigure 1. Surgical procedures for harvesting the femur and adipose tissue of a Wistar rat weighing 150-200 g. A. Disinfection of the animal with 1% iodized ethanol after euthanasia. B. Schematic representation of the incisions. C. Muscle removal and femur exposure. D. Skin retraction and exposure of the abdominal and inguinal adipose tissues.BM-MSC isolation and culture proceduresTransfer the femurs from the conical tubes to a glass tissue culture dish filled with 70% ethanol.",
    "Within 1 min, remove the remaining connective tissue with sterile scissors, forceps and a #15 scalpel blade.Transfer the femurs to a new glass tissue culture dish filled with 2.5% chlorhexidine.Within 1 min, clean the remaining connective tissue with sterile scissors, forceps and a #15 scalpel blade (Figure 2A).Transfer the femurs to new conical tubes containing 15 ml of transport medium and incubate for 15 min at RT.Again, transfer the femurs to a new conical vial containing 15 ml transport medium and incubate for 15 min at RT.Lastly, transfer the femurs to a new conical vial containing 15 ml transport medium and incubate for 15 min at RT.Transfer the contents of this conical tube to a glass tissue culture dish.Fill a 20-ml syringe with growth medium and attach a 21G needle.Hold the femur with tweezers and cut the epiphyses using sterile scissors (Figure 2B).Insert the needle of the syringe filled with growth medium into the diaphysis and flush all bone marrow into a new 50-ml conical tube (Figure 2C).Centrifuge this tube for 5 min at 600 x g at RT.Discard the supernatant and resuspend the pellet in new growth medium (2 ml per femur).Transfer 2 ml of this suspension in a 75 cm2 cell culture flask filled with 10 ml of growth medium.Incubate this flask in an incubator at 37 °C in a humidified atmosphere containing 5% CO2 and 95% air.After 24 h, gently rinse the flask three times with 1x PBS and replace with fresh growth medium.Change the culture medium every 2 days until the cells grow to 70% confluence.Note: After 7 days of culture in growth medium, approximately 5 x 106 MSCs were generated from each femur of each animal.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212032_6938.jpg Figure 2. The harvesting of bone marrow from femur. A. Cleaned femur. B. Marrow cavity exposure after epiphyseal sectioning.",
    "C. Bone marrow flushing with growth medium using a needle and a syringe.AT-MSC isolation and culture proceduresTransfer the adipose tissue from the 50-ml conical tube to a glass tissue culture dish filled with 1x PBS to rinse the tissue.Transfer the adipose tissue to a new glass tissue culture dish (Figure 3A).Use sterile scissors to mince the adipose tissue into small pieces, around 1-2 mm3 (Figure 3B).Transfer the minced pieces to a 50-ml conical tube containing 20 ml of collagenase solution (Figure 3C).Place the tube in a water bath for 40 min at 37 °C, with shaking.Add 20 ml of growth medium to the 50-ml conical tube containing the adipose tissue and collagenase solution.Centrifuge the conical tube containing the adipose tissue, collagenase solution, and growth medium for 5 min at 600 x g.Discard the supernatant and resuspend the pellet in new growth medium (5 ml per adipose tissue removed from 1 animal).Transfer 5 ml of this suspension into a 75 cm2 cell culture flask filled with 10 ml of growth medium.Incubate this flask in an incubator at 37 °C in a humidified atmosphere containing 5% CO2 and 95% air.After 24 h, gently wash the flask three times with 1x PBS and replace with fresh growth medium.Replace the culture medium every 2 days until cells are 70% confluent.Notes:After 7 days of culture in growth medium, approximately 5 x 106 MSCs were generated from the adipose tissue of each animal.Typically, within 7 days, MSCs reach 70% of confluence and are ready to be used in subsequent experiments (Figure 4). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212234_6381.jpg Figure 3. The enzymatic digestion of abdominal and inguinal adipose tissue. A. Harvested adipose tissue. B. Mincing of adipose tissue into small pieces using sterile scissors and tweezers. C.",
    "Transfer adipose tissue pieces to collagenase type II solution for enzymatic digestion and cell isolation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212330_1215.jpg Figure 4. Phase-contrast micrographs showing the morphology of BM-MSCs and AT-MSCs that were cultured in growth medium and on polystyrene dishes for up to 7 days. After 24 h, both BM-MSCs and AT-MSCs have attached to the polystyrene dish, and their morphology is round/oval. As the cells were cultured, they proliferated and became elongated, polygonal, and spindle-shaped. Scale bar = 100 µm.Characterization of BM-MSCs and AT-MSCsWash the flask three times with 1x PBS.Add 5 ml of trypsin solution into the flask and incubate for 5 min at 37 °C.Add 2.5 ml of fresh growth medium into the flask, transfer the cell suspension into a 50-ml conical tube, and centrifuge for 5 min at 600 x g.Discard the supernatant.Wash the cell pellet once with 1x PBS.Centrifuge the cell suspension for 5 min at 600 x g.Discard the supernatant.Add 5 ml of 1x PBS to the cell pellet and mix the cell suspension.Count the cells in a hemocytometer (Neubauer Chamber).Adjust the concentration of the cell suspension to obtain a density of 2 x 105 cells/ml with 1x PBS.Add 1 ml of cell suspension to each flow cytometer tube (one tube for each specific antibody, one tube for isotype control, and one tube with cells that will not be labeled with antibody).Centrifuge the flow cytometer tubes for 5 min at 600 x g.Discard the supernatant.Add 100 µl of 1x PBS to the cell pellet and mix by flicking/tapping the tube.Incubate each tube for 30 min at RT in the dark with 2 µl of the following monoclonal anti-rat antibodies: anti-CD29, -CD31, -CD34, -CD45, and -CD106, directly conjugated with a fluorophore (antibody final dilution: 1:50).",
    "For monoclonal anti-rat antibody -CD90 directly conjugated with a fluorophore: dilute the antibody 1:5 in 1x PBS and then add 2 µl to the cell suspension (antibody final dilution: 1:250).Add 2 µl of isotype control to the corresponding tube.Wash the cells with 2 ml of 1x PBS.Centrifuge for 5 min at 600 x g.Discard the supernatant.Add 0.5 ml of formaldehyde solution (4%) diluted to 1% in 1x PBS.Analyze the cells by flow cytometry (Figures 5 and 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212347_7520.jpg Figure 5. Flow cytometry analysis of BM-MSCs cultured in growth medium on a polystyrene culture dish for 7 days. Histograms show the expression of the surface markers CD29, CD90, CD106, CD31, CD34, and CD44 after incubation with the respective antibodies. Cells were also incubated with the isotypes FITC-A and PE-A, which were used as negative controls. A high percentage of BM-MSCs expressed CD29, CD90, and CD106 (98.7%, 98.7%, and 28.7%, respectively) and a low percentage expressed CD31, CD34, and CD44 (7.8%, 0.4%, and 0.3%, respectively).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212451_8183.jpg Figure 6. Flow cytometry analysis of AT-MSCs cultured in growth medium on a polystyrene dish for 7 days. Histograms show the expression of the surface markers CD29, CD90, CD106, CD31, CD34, and CD44 after incubation with the respective antibodies. Cells were also incubated with the isotypes FITC-A and PE-A, which were used as negative controls. A high percentage of AT-MSC expressed CD29, CD90, and CD106 (99.9%, 99.3%, and 41.8%, respectively) and a low percentage expressed CD31, CD34, and CD44 (7.6%, 5.3%, and 0.2%, respectively).Osteoblast differentiationWhen BM-MSCs or AT-MSCs reach 70% confluence, remove the growth medium.Wash the flask three times with 1x PBS.Add 5 ml of trypsin solution into the flask and incubate for 5 min at 37 °C.Add 2.",
    "5 ml of fresh growth medium into the flask, transfer the cell suspension to a 50-ml conical tube, and centrifuge for 5 min at 600 x g.Discard the supernatant and resuspend the cell pellet in new growth medium.Count the cells and plate them at a cell density of 2 x 104 cells/well in 24-well culture plates in 1 ml of osteogenic medium or 1 x 105 cells/well in 6-well culture plates in 2 ml of osteogenic medium.Incubate the plates in an incubator at 37 °C in a humidified atmosphere containing 5% CO2 and 95% air during the time-course of the experiment.Replace the culture medium every 2 days.The extracellular matrix mineralization can be observed after 21 days in culture.Alizarin red stainingTo confirm osteoblast differentiation, one of the methods we used is the detection of mineralized extracellular matrix by alizarin red staining.Remove the culture medium from each well and gently wash the cells 3 times with 1x PBS.Add 10% formalin and incubate at 4 °C for 24 h (24-well plates–500 µl; 12-well plates–1 ml; 6-well plates–2.4 ml).Remove the 10% formalin and dehydrate the cells using increasing concentrations of ethanol (30%, 50%, 70%, and 96%) for 1 h each (24-well plates–500 µl; 12-well plates–1 ml; 6-well plates–2.4 ml).Remove the 96% ethanol and incubate at RT until the wells are dry.Cover the well with alizarin red staining and incubate at RT for 10 min.Wash once with deionized water and incubate at RT until the wells are dry.Take macroscopic (Figure 7) and microscopic photos of the wells.Note: Typically, BM-MSCs are more committed to osteoblast differentiation compared to AT-MSCs, as we previously observed (Abuna et al., 2016).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212508_6977.jpg Figure 7.",
    "Mineralized extracellular matrix detected by alizarin red staining in BM-MSC and AT-MSC cultures after 21 days of culture in osteogenic medium on polystyrene dishes Chondroblast differentiationWhen BM-MSC and AT-MSC cultures reach 70% confluence, remove the growth medium.Wash the flask three times with 1x PBS.Add 5 ml of trypsin solution into the flask and incubate for 5 min at 37 °C.Add 2.5 ml of fresh growth medium into the flask.Transfer this cell suspension to a 50-ml conical tube and centrifuge for 5 min at 600 x g.Discard the supernatant.Resuspend the cells in chondroblast differentiation medium at a density of 1.25 x 106 cells/ml.Using a pipette, dispense 200 µl aliquots of the cell suspension (2.5 x 105 cells) into each well of polypropylene 96-well plates.Centrifuge the plates at 500 x g for 5 min.Add 200 μl of 1x PBS into the empty wells to minimize the evaporation of the culture medium.Incubate the plates in an incubator at 37 °C in a humidified atmosphere containing 5% CO2 and 95% air during the time-course of the experiment.After 24 h of incubation, cell aggregates were visible, and the chondrogenic phenotype was observed after 30 days in culture.Replace the culture medium every 2 days by carefully aspirating the expired medium using a sterile 200 μl pipette and adding 200 μl of fresh chondrogenic medium to each well.Trichrome stainingTo confirm chondroblast differentiation, one of the methods we used is the detection of collagen fibers with trichrome staining.Using a micropipette, remove the chondroblast differentiation medium.Add 200 μl of 1x PBS into each well.Using a micropipette, remove the PBS.Add 200 μl of 4% paraformaldehyde for 5 min at RT.Remove the paraformaldehyde.Wash each well with 1x PBS, 2 times for 3 min each.Stain the cell aggregates with eosin for 5 min at RT.",
    "Remove the eosin and wash with 1x PBS, 2 times for 3 min each.Using a 1,000 µl micropipette, harvest the aggregates and transfer them to 1.5-ml microtubes.Dehydrate the cells aggregates in 300 µl of a graded ethanol series (70%, 80%, 90%, 95%, and 100%, 5 min each) by placing them into 1.5-ml microtubes.Remove the 100% ethanol and perform three clarification steps in 300 µl xylene for 3 min each.Paraffin-embed the aggregates into a mold in a hot surface for 5 min then transfer each mold to a cold surface.Cut adjacent 5 μm sections using a microtome.Deparaffinize the sections overnight in an incubator at 60 °C.Deparaffinize the sections in three steps of xylene for 5 min each, and rehydrate the sections by incubation in an ethanol series (100%, 95%, 90%, 80%, and 70%, 3 min each).Wash the sections with deionized water for 5 min.Stain with acid fuchsin (HT15-1) for 5 min at RT.Wash with water for 5 min.Stain with a working solution of phosphomolybdic acid (HT15-3) and phosphotungstic acid (HT15-2) for 5 min at RT.Stain the sections with an aniline blue solution for 5 min at RT.Remove the excess aniline blue, and add a 1% acetic acid solution for 3 min.Rinse with sections with tap water for 3 min.Dehydrate sections in a graded ethanol series (70%, 80%, 90%, 95%, and 100%, 1 min each), followed by three clarification steps in xylene for 1 min each.Mount the slides using Erv-Mount®.Take microscopic photos of the histological sections (Figure 8).Note: Cytoplasm is stained in red, and collagen fibers are stained in blue.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217212527_9022.jpg Figure 8. Collagen fibers (blue) and cytoplasm (red) detected by trichrome staining in BM-MSCs and AT-MSCs cultured in chondrogenic medium on ultra-low cluster 96-well plates for 30 days. Scale bar = 100 µm.",
    "Adipocyte differentiationWhen BM-MSC and AT-MSC cultures reach 70% confluence, remove the growth medium.Wash the flask three times with 1x PBS.Add 5 ml of trypsin solution into the flask and incubate for 5 min at 37 °C.Add 2.5 ml of fresh growth medium into the flask.Transfer this cell suspension to a 50-ml conical tube and centrifuge for 5 min at 600 x g.Discard the supernatant and resuspend the cell pellet in fresh growth medium.Count the cells and plate them at a cell density of 2 x 104 cells/well in 24-well culture in 1 ml of adipogenic medium plates or 1 x 105 cells/well in 6-well culture plates in 2 ml of adipogenic medium.Incubate the plates in an incubator at 37 °C in a humidified atmosphere containing 5% CO2 and 95% air during the time-course of the experiment.Replace the culture medium every 2 days. The intracytoplasmic lipid droplets were observed after 10 days in culture.Oil red O stainingTo confirm adipocyte differentiation, one of the methods we used is the detection of intracytoplasmic lipid droplets with oil red O staining.Remove the culture medium from each well.Add 10% formalin and incubate for 5 min at RT (24-well plates–500 µl, 12-well plates–1 ml, 6-well plates–2.4 ml).Discard the 10% formalin and add the same volume of fresh 10% formalin. Incubate for at least 1 h.Note: Cells can be kept in formalin for a couple of days before staining. Wrap parafilm around the plate to prevent the cells from drying out and cover the plate with aluminum foil. Remove the 10% formalin using a small transfer pipette.Wash the wells with 60% isopropanol (24-well plates–500 µl, 12-well plates–1 ml, 6-well plates–2.4 ml).Let the wells dry completely.Add the oil red O staining working solution for 10 min (do not touch walls of the wells).",
    "Remove the oil red O staining, and immediately add deionized water (repeat this step 4 times).Remove all deionized water and incubate at RT to dry.Image the wells using a phase-contrast microscope (Figure 9).Note: Typically, AT-MSCs are more committed to adipogenic differentiation compared to BM-MSCs, as we previously observed (Abuna et al., 2016).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200217/20200217214817_3341.jpgFigure 9. Intracytoplasmic lipid droplets detected by oil red O staining in BM-MSCs and AT-MSCs cultured in adipogenic medium on a polystyrene dish for 10 days. Scale bar = 100 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}