{
  "id": 9844,
  "origin_website": "Jove",
  "title": "Assessment of Ultrasonic Vocalizations During Drug Self-administration in Rats",
  "procedures": [
    "*= important points  Well-handled male Sprague-Dawley rats are trained to lever press with food reward (45 mg sucrose pellets; Bio-Serv, Frenchtown, NJ). *Intravenous catheters are constructed out of stainless steel cannula (Plastics One, VA) and Silastic tubing. Rats undergo a jugular catheterization surgical procedure to allow drug self-administration. After surgery, catheter patency is maintained by daily flushing with 0.1 ml of a 0.9% saline, heparin and Timentin solution. Cocaine (NIDA Drug Inventory and Supply and Control Program; RTI International, Research Triangle Park, NC) used in this experiment was dissolved in isotonic saline solution (0.9%) in the appropriate dose concentrations according to animal weights (0.75 mg/kg/injection) so that each injection was 0.1 ml. Control animals received saline solution in the same volume/injection. *The apparatus used for drug self-administration consists of a single-lever operant chamber (28 x 22 x 21 cm) equipped with house and stimulus lights and 3 sets of photobeams. The operant chamber is housed within a larger sound-attenuating chamber (Med Associated, St. Albans, VT) to limit outside noise and light. During the administration sessions, the animals were intravenously connected via tubing to a syringe mounted on a motorized pump (Razel Scientific Instruments, Model A, St. Albans, VT) containing either a cocaine solution (0.75 mg/kg/injection) or sterile saline. After each lever press, a stimulus light above the lever illuminates and cocaine or saline is administered over a 6-sec infusion time. Locomotor activity is assessed as the number of photobeam interruptions. The drug self-administration program is controlled, and behavioral responses (e.g., lever responses and locomotor activity) are recorded using a Med Pentium computer equipped with Med PC software (Med Associates). *To detect and record USVs, ultrasonic microphones, data acquisition hardware, recording software (Avisoft Bioacoustics, Berlin, Germany) and PC computer systems are needed.",
    "For the current experiment, ultrasonic microphones (frequency response range =10-100-kHz) are securely mounted in the center of the operant chambers. Microphones are connected to data acquisition hardware (Avisoft-Ultrasoundgate) located outside of the operant chamber and recordings are collected on a PC computer system (Dell Optiplex GX270, Windows XP Professional, Intel(R) Pentium(R) 4 CPU, 2.60 GHz, 1 GB RAM) using RECORDER multi-channel recording software (Avisoft Bioacoustics). *Each drug self-administration/USV recording session proceeds as follows:  The animals are gently taken out of their home cage and their indwelling intravenous catheter is flushed with 0.05 ml of a heparinized saline solution to detect possible catheter malfunctions. *Rats are connected to a swivel mounted on the operant chamber that allows either drug or vehicle administration during the self-administration sessions. Animals are gently placed into the operant chamber and the doors are quietly closed. The drug self-administration program (Med PC) and the USV recording software (RECORDER) are on two separate computer systems. Therefore, in order to be able to link behaviors within the operant chamber with USV detection, both programs need to be started simultaneously (e.g., may need two people depending on location of computers). *The individual USVs are recorded and time-stamped continuously throughout the session. The MedPC program controlling and recording events within the operant chamber can be written to any specification. The MedPC program automatically closes at the end of the session. The USV recording needs to be stopped manually on the USV recording-dedicated computer system. At the end of the session, the animals are gently taken out of the operant chamber, disconnected from the swivel and flushed with 0.05 ml heparinized saline to clear the catheter from drug residue.   *For logistical purposes, we used a separate computer system for USV analyses (Dell Optiplex 745, Windows XP Professional, Intel(R) Core(TM), 2 CPU, 2.",
    "40 GHz, 2 GB RAM), but the analyzing software can also be installed on the same computer system as the recording software. USV analyses must be performed carefully to ensure accuracy:  *SASLab Pro analyzing software (Avisoft Bioacoustics, Berlin, Germany) allows the recorded USVs to be visible and audible for the human experimenters displayed in a spectogram. *Using the available configuration settings, the resulting spectogram can be modified for individual preferences. In addition, background noises in low frequencies (e.g., generated by the fan of the operant chambers) can be cut out to allow the software to automatically detect sounds above that frequency in the spectogram. These functions assist in data analyses as by making the sound files shorter and faster to assess. Background noises in the same frequencies as USVs are sometimes detected in the spectrogram. Since the sound files are recorded as .wav files, the researcher needs to listen to the sound files during assessment to confirm and differentiate USVs from background noise. *The analyzing software can create Excel files with parameters such as call frequencies, bandwidth, duration, and exact time of the emitted USV. The latter allows the correlation of USVs to the exact time before or after drug is self-administered. This allows USVs to be used as real-time measurements of the rat's emotional response at specific instances during the experimental procedure.    Representative Results: imgsrc://cloudfront.jove.com/files/ftp_upload/2041/2041fig1.jpgFigure 1: Spectogram display of a 22-kHz range USV. Long calls in the 22-kHz range are elicited in conjunction with aversive stimuli and are thought to reflect a negative emotional state. imgsrc://cloudfront.jove.com/files/ftp_upload/2041/2041fig2.jpgFigure 2: Spectogram display of 50-kHz USVs. Short \"flat\" and \"frequency modulated\" 50-kHz USVs are elicited in anticipation and during cocaine self-administration. They are associated with positive affect. imgsrc://cloudfront.jove.com/files/ftp_upload/2041/2041fig3.jpgFigure 3: Cocaine-Induced 50-kHz range USVs.",
    "Graph depicts USVs (10-sec bins) elicited before and after self-administered cocaine injections (0.75 mg/kg/inj) in a representative rat on Day 5 of cocaine self-administration sessions. Immediately after placement within the operant chamber and prior to cocaine availability, cocaine-anticipatory USVs were elicited and during self-administration, cocaine-induced USVs were emitted."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}