{
  "id": 13465,
  "origin_website": "Jove",
  "title": "Streamlined 3D Cerebellar Differentiation Protocol with Optional 2D Modification",
  "procedures": [
    "1. Preparations\nNOTE: For all steps see Table of Materials for specific items.\nPrepare 500 mL defined hPSC culture medium for hPSC culture\n\tNOTE: Use medium for steps 2.1-2.6.\n\t\nThaw hPSC medium supplement overnight (o/n) at 4 °C. Remove 12.5 mL of hPSC base medium from medium bottle, then add 10 mL of supplement and 2.5 mL (making 100 U/L) Penicillin/Streptomycin (Pen/Strep) to the bottle.\nStore at 4 °C and use within 2 weeks.\n\t\tNOTE: The hPSC medium may be used to freeze down cells by adding 10 µM ROCK Inhibitor (RI) and 10% DMSO.\nPrepare 1 L neural maintenance medium (NMM) for differentiation culture\n\tNOTE: Use medium for steps 3.1-4.4.\n\t\nMix glutamine fortified DMEM/F12 and neural basic medium (1:1 ratio) in a 1 L bottle, then supplement with (1x) N2 supplement, (1x) B27 supplement, 5 µg/mL insulin, 1.5 mM L-glutamine, 100 µM non-essential amino acids (NEAA), 100 U/L Pen/Strep, and 10 µM beta-mercaptoethanol.\nStore medium at 4 °C and use within 3 weeks.\n\t\tNOTE: Before adding supplements to mixed basal medium, remove the appropriate volume to adjust for the required volume of added components based on stock concentrations.\nPrepare 500 mL of 0.5 mM EDTA working solution for passaging hPSCs\n\tNOTE: Use medium for steps 2.4 and 2.5.\n\t\nUnder a flow-hood, transfer 49 mL of Phosphate Buffered Saline (PBS) from a 500 mL sterile PBS bottle to a 50 mL tube. Add 0.5 mL of 0.5M EDTA and 0.9 g NaCl to the 50 mL tube. Mix gently to dissolve.\nFilter-sterilize solution using a 0.22 µm filter and transfer to the 500 mL sterile PBS bottle. Store at room temperature (RT).\nPrepare hPSC culture plates for hPSC culture\n\tNOTE: Use plates for steps 2.1-2.6.",
    "Make 50x working solution of hPSC-appropriate adherent coating (PAAC): Thaw a vial of PAAC o/n at 4 °C. Dilute PAAC in 1:1 ratio with DMEM/F12 and transfer as 400 µL aliquots into 1.5 mL tubes. Store 50x working solution PAAC at -80 °C.\n\t\tNOTE: (Important) PAAC solidifies quickly at RT, therefore it is necessary that all components (DMEM, tubes, etc.) are kept on ice (or at 4 °C).\nThaw tube of 50x working solution PAAC at 4 °C, then dilute 50x in cold DMEM/F12. Add 750 µL/well of diluted PAAC to a 6WP. Incubate plate for at least 1 h at 37 °C.\n\t\tNOTE: PAAC plates may be stored for 1 week at 4 °C, by wrapping the plate after 1 h incubation period. Warm plate to 37 °C prior to use.\nPrepare anti-adhesive (AA) plates for differentiation culture\n\tNOTE: Use plates for steps 3.1-4.1.\n\t\nMake 5 mg/mL Poly (2-hydroxyethyl methacrylate) (poly-HEMA) solution in 95% Ethanol. Shake o/n at 37 °C until a clear solution is obtained. Store at RT.\n\t\tNOTE: Filtering through a 0.22 µm filter can remove undissolved poly-HEMA.\nAdd poly-HEMA to the culture plate so that it covers the bottom of each well. Incubate the plate at 37 °C for 2 days, and inspect the plate to ensure complete evaporation of liquid/uniform coating of wells. AA plates may be wrapped and stored at RT.\nPrepare Poly-L-Ornithine/Laminin (PLO/LAM) plates for differentiation culture\n\tNOTE: Use plates for steps 4.2-4.4.\n\t\nCoat the surface area of wells, using 20 µg/mL PLO dissolved in sterile PBS. Incubate the plate o/n at 37 °C. Aspirate PLO and rinse 3 times with PBS.\n\t\tNOTE: (Optional) Incubated plate with PLO may be wrapped and stored at 4 °C until needed.",
    "Coat the surface areas of the PLO-coated wells, using 10 µg/mL LAM dissolved in sterile PBS. Incubate for at least 2 h at 37 °C or o/n at 4 °C. Remove LAM and wash wells 2-3x with PBS, then immediately add appropriate medium and/or cells.\n\t\tNOTE: (Optional) Removed LAM solution can be stored at 4 °C and re-used up to 2 times. (Important) Do not allow LAM-coated surfaces to dry out; to prevent this immediately add PBS or appropriate medium.\n\t\t \n2. Protocol 1: Feeder-free hPSC Culture\nNOTE: hESCs were obtained from a non-commercial organization (line H01, see Table of Materials). Three hiPSC control lines (hvs51, 60, and 88) were generated by reprogramming fibroblasts from three healthy human patients (fibroblasts were derived from anonymous, non-identifiable donors and therefore exempt from IRB approval)10,17.\nMaintain hPSCs in feeder-free culture\nAfter thawing and plating hPSCs onto PAAC plates in hPSC medium (see step 2.2), maintain hPSCs at 37 °C with 5% CO2. Refresh hPSC medium daily (see step 2.3), except the day after thawing or passaging, and examine cells under the microscope (objectives: 2.5x/0.06, 5x/0.12 Ph0, 10x/0.25 Ph1) to observe the growth rate and identify potential areas of differentiation (Figure 3, upper left panel shows example of differentiation).\nPassage hPSCs every 3-4 days, or when culture reaches >80% confluence. If less than 5% of cells exhibit differentiation, use normal hPSC passaging method (see step 2.4), otherwise use the gentle method (see step 2.5). When no longer needed in culture, hPSCs may be frozen for long term storage (see step 2.6).\nThaw hPSCs in hPSC medium\nTransfer the required volume of hPSC medium to sterile tubes for the thawing process (9 mL/cryogenic tube) and to the prepared PAAC plate to receive thawed cells. Supplement the medium in both tubes with 10 µM RI.",
    "Retrieve the cryotube from LN2 storage and place directly into a water bath (37 °C). When only a small ice crystal remains, remove from the water bath and transfer the contents of the cryogenic tube to the tube for thawing process (total volume 10 mL). Centrifuge the tube at 290 x g for 5 min at RT.\nUse a serological pipette to remove the PAAC solution from the wells of the PAAC plate (see step 1.4) intended to receive cells, and add hPSC medium with 10 µM RI.\n\t\tNOTE: (Important) Do not aspirate PAAC solution with a suction needle, or it may solidify and clog lines to the vacuum pump.\nRemove the supernatant from the tube and resuspend cells in hPSC medium with 10 µM RI. Distribute the cells to the destination plate at ratio of 1 cryogenic tube/well of 6WP. Incubate at 37 °C with 5% CO2, and do not refresh medium for 1 day.\n\t\tNOTE: Starting up cells at 5% O2 may increase cell survival.\nRefresh hPSC medium\nWarm the necessary volume of hPSC medium in a sterile tube at RT or in a water bath; 2 mL/well of 6WP is suggested.\n\t\tNOTE: (Optional): By adding an extra amount of hPSC medium, hPSCs can remain an extra day without refreshing; however, do not allow this more than once a week.\nAspirate the medium from wells containing hPSCs and add fresh hPSC medium.\nCulture the hPSCs in an incubator at 37 °C and 5% CO2.\nPassage hPSCs in hPSC medium\nTransfer the required volume of hPSC medium to sterile tubes, for passaging process and for preparation of PAAC plate to receive passaged cells. Supplement the medium for the destination plate with 10 µM RI. Warm the medium tubes at RT or in a water bath.",
    "NOTE: Preparation and handling will differ if using an alternative coating material than one listed in Table of Materials.\nUse a serological pipette to remove the PAAC solution from the wells of the PAAC plate (see step 1.4) intended to receive cells, and add hPSC medium with 10 µM RI.\n\t\tNOTE: (Important) Do not aspirate the PAAC solution with a suction needle, as it may solidify and clog lines to the vacuum pump.\nAspirate the medium from wells with hPSCs to be passaged, wash cells twice with 0.5 mM EDTA, then add 0.5 mM EDTA and incubate for 2-5 min at 37 °C.\n\t\tNOTE: 1 mL/well of 6WP is a sufficient volume of EDTA for washing and incubation.\nCheck the wells under the microscope (objectives: 2.5x/0.06, 5x/0.12 Ph0, 10x/0.25 Ph1). If cells are beginning to detach, aspirate EDTA solution and flush cells free using hPSC medium.\n\t\tNOTE: (Important) Take care not to remove whole hPSC colonies when aspirating EDTA (do not wait until whole colonies are detaching). Do not flush cells more than 5 times as this may harm hPSCs and affect pluripotency. Also, do not let cells stand in hPSC medium with RI before flushing cells from wells, as they may re-adhere to the plate.\nBased on empirical determination (usually related to confluence, size of colonies, and growth rate), transfer hPSCs to wells of the destination plate using a splitting ratio of 1:4-1:16 (i.e., 1 well from the original plate to 4 wells of the destination plate). Incubate at 37 °C with 5% CO2, and do not refresh medium for 1 day.\n\t\tNOTE: Splitting ratios as high as 1:16-1:20 are possible to prevent crowding and improve appearance of colonies.\nPassage hPSCs using the gentle-method (G-method)",
    "Transfer the required volume of hPSC medium to sterile tubes, for the passaging process and for preparation of PAAC plate to receive passaged cells. Supplement the medium for destination plate with 10 µM RI. Warm medium tubes at RT, or in water bath at 37 °C.\nUse serological pipette to remove PAAC solution from wells of PAAC plate (see step 1.4) intended to receive cells, and add hPSC medium with 10 µM RI.\n\t\tNOTE: (Important) Do not aspirate PAAC with a suction needle, or it may solidify and clog lines to the vacuum pump.\nAspirate medium from the wells with hPSCs to be passaged, and wash the cells twice using 0.5 mM EDTA. On the second wash, wait 30 s before aspirating EDTA, then add 1 mL of PBS and incubate for 4-9 min at 37 °C. While waiting, prepare a sterile tube with 4 mL of PBS.\n\t\tNOTE: 1 mL/well of 6WP is sufficient volume of EDTA for washing.\nCheck the wells under microscope (objectives: 2.5x/0.06, 5x/0.12 Ph0, 10x/0.25 Ph1). If cells are starting to detach, carefully tap the sides of the plate to help free colonies. When >50% of colonies are free floating, use a 5 mL serological pipette to transfer colonies in 1 mL PBS to the tube containing 4 mL PBS (do not triturate).\n\t\tNOTE: (Important) Since the purpose is to clean up hPSC culture, check to determine whether differentiated cells remain attached to the plate. Also, it is not necessary to passage all colonies in a well using this process, so colonies that remain attached may be left behind.",
    "Wait 5-10 min at RT for cells to settle in the tube (do not centrifuge). Aspirate PBS from the tube, taking care not to remove settled hPSCs. Carefully resuspend the cells in hPSC medium (do not triturate), and transfer the cells to the destination plate using a splitting ratio of 1:4-1:16. Incubate at 37 °C with 5% CO2, and do not refresh medium for 1 day.\nFreeze down hPSCs\nDepending on the confluence, use 1 well of hPSCs, at 2-3 days (maximum) in culture, to fill 1-2 cryopreservation vials for storage in LN2.\nAt the end of passaging (step 2.5), use 500 µL or 1 mL of hPSC medium to transfer cells from 1 well of 6WP to 1 or 2 cryopreservation vials, respectively (500 µL/vial). To each tube, add 500 µL of 2x freezing medium containing hPSC medium, 20 µM RI, and 20% DMSO.\n\t\tNOTE: (Optional) Cells can be transferred directly in 1x freezing medium at 1 mL/vial.\nPlace the cryogenic tubes in a cryogenic container (containing isopropanol) pre-cooled to 4 °C, and store immediately at -80 °C.\nOn the next day, transfer the cryogenic tubes to an LN2 tank for long-term storage.\n3. Protocol 2: 3D \"Organoid\" Differentiation\nSetup of differentiation with modified G-method of passaging of hPSCs\nTransfer the required volume of NMM for the number of destination wells to a sterile tube. Supplement with 4 ng/mL FGF2 and 10 µM RI. Warm the medium tube at RT, or in water bath at 37 °C.\n\t\tNOTE: Depending on confluence of the origination wells, hPSCs are concentrated during the distribution to the destination plate in a 2:1 or 3:1 ratio (i.e., 2 wells from the original plate to 1 well of the destination plate), with an end volume of 2.5 mL/well of 6WP.",
    "Aspirate the medium from wells containing hPSCs to be differentiated, and wash the cells twice using 0.5 mM EDTA. On the second wash, wait 30 s before aspirating EDTA, then add 1 mL of PBS and incubate for 4-9 min at 37 °C. While waiting, prepare a sterile tube with 4 mL of PBS.\n\t\tNOTE: 1 mL/well of 6WP is sufficient volume of EDTA for washing. (Important) It is preferable to use hPSCs that were no longer than 3 days in culture after the last passage, and at least 1-2 passages after thawing.\nCheck wells under the microscope (objectives: 2.5x/0.06, 5x/0.12 Ph0, 10x/0.25 Ph1). If cells are starting to detach, free the cells by gentle tapping on the sides of the plate. Transfer the cells to a tube containing 4 mL PBS with a 5 mL pipette.\n\t\tNOTE: (Important) Light flushing and trituration is permitted to break up colonies and collect loose cells, but ignore cells that remain adhered to the plate.\nAllow the tube to sit for 10 min at RT, for gravity separation. Optionally, centrifuge the cells lightly (no greater than 200 x g at RT, for 5 min) if required.\nAspirate the PBS from the tube, taking care not to remove settled hPSCs, resuspend the cells in NMM with 4 ng/mL FGF2 and 10 µM RI, and then distribute to the AA-coated plate in a 2:1 or 3:1 ratio. Incubate at 37 °C with 5% CO2, and do not refresh the medium for 3 days, unless required (see step 3.2.1).",
    "NOTE: (Optional) For convenience of transferring cells, add a portion of culture medium to wells of the destination plate prior to distribution, and resuspend the cells in a smaller volume. Also, hPSCs may be stained and counted to define the exact starting cell density. However, the final volume in the destination plate should be 2.5 mL/well of 6WP.\nMaintain free-floating differentiation culture at 37 °C (5% CO2)\nCheck the plates every day for changes in medium color, accumulation of dead cells, clumping, and adherence to well bottoms.\n\t\t\nOptional: Regardless of the medium change schedule, refresh (including the first 3 days of no refreshing) the medium if it has turned yellow, and follow instructions for medium change/refresh (step 3.3). If the majority of cells appear dead, follow the instructions for medium change/refresh with gravity separation (step 3.4).\n\t\t\tNOTE: Formation of EBs and growth into large cell aggregates are expected, but cells and cell aggregates can clump together into large masses not due to individual growth/proliferation. If this is observed, light trituration to break up masses is permissible. If cells start to adhere to the AA-plate surface, the remaining floating contents of wells may be transferred directly to new wells, or transferred during the process of medium change/refresh. Do not attempt to transfer cells that have adhered to the plate.\nOn day 3, change the medium to NMM with 4 ng/mL FGF2. Refresh the medium every other day.\nOn day 7, change the medium to NMM with 1 µM Retinoic Acid (RA), 100 ng/mL FGF8B, and 4 ng/mL FGF2. Refresh the medium every other day.\n\t\tNOTE: (Important) RA is light-sensitive. Protect RA culture samples from light.\nOn day 14, change the medium to NMM with 100 ng/mL FGF8B, 100 ng/mL FGF4, and 20 ng/mL FGF2. Refresh the medium every other day.",
    "On day 17, change the medium to NMM with 100 ng/mL FGF8B. Refresh the medium every other day.\nOn day 21, change the medium to NMM with 100 ng/mL Brain Derived Neurotrophic Factor (BDNF) and 10 ng/mL Glial Derived Neurotrophic Factor (GDNF). Refresh the medium every other day.\nOn day 28, change the medium to NMM with 100 ng/mL BDNF and 10 ng/mL GDNF, 3 ng/mL SAG, 100 ng/mL Neurotrophic Factor 3 (NT3), and 25 mM KCl. Refresh the medium every other day.\nOn day 35, collect the 3D organoids for analysis.\nChange/refresh differentiation medium for 3D culture\nTransfer the required volume of NMM with the appropriate components (see steps 3.2.2-3.2.7 for component schedule) to a sterile tube. Warm in a water bath at 37 °C.\nTip the plate and shake gently until the cells settle to the bottom edges of the wells. Carefully remove 2 mL of old medium using a serological pipette, avoiding removal of the cells, then add 2 mL of fresh medium. Incubate at 37 °C with 5% CO2.\n\t\tNOTE: (Important) The end volume should be 2.5 mL/well of 6WP. If evaporation occurs, do not remove 2 mL of old medium as this would further dry out the cell cultures; instead, add extra medium.\nChange/refresh differentiation medium with gravity separation\nTransfer the required volume of NMM with the appropriate components to a sterile tube. Warm in a water bath at 37 °C.\nTransfer the contents of the wells to a sterile tube, and allow the tube to sit for 10 min at RT, for gravity separation.\nUse a pipette to remove old medium from the tube, taking care not to remove settled cells, resuspend in NMM with appropriate components, and then distribute to new AA-coated wells. Incubate at 37 °C with 5% CO2.",
    "NOTE: (Optional) For convenience, a portion of culture medium may be added to the destination wells prior to distribution, with differentiating cells resuspended in a lower volume. The end volume should be 2.5 mL/well of 6WP.\n4. Protocol 3: Alternative 2D Differentiation Culture\nStart and maintain culture using the steps as per Section 3 for 3D protocol through day 12\nFollow steps 3.1-3.2.3 and change/refresh medium as per steps 3.3 and 3.4.\nSwitch to and maintain as 2D monolayer culture\nOn day 13 of differentiation, follow the instructions for change/refresh medium with gravity separation (step 3.4), only distribute the cells/aggregates to PLO/LAM coated plate (see step 1.6) with an end volume of 2.5 mL/well of 6WP.\n\t\tNOTE: The medium may be supplemented with 10 µM RI during the initial plating to help adherence and survival of cells. (Important) It is desirable to evenly spread the cells in the wells, to avoid low density or crowding on the plates, and to passage (see step 4.4) as necessary. The preferred size of PLO/LAM coated plates (i.e., 6WP, 12WP, etc.) must be empirically determined, based on the proliferation rate for the cell line, and purpose for the product. Instructions will give volumes for 6WP, and can be converted by halving for each doubling of well number (i.e., 2 mL/well for 6WP, 1 mL/well for 12WP, etc.)\nOn day 14, change the medium to NMM with 100 ng/mL FGF8B, 100 ng/mL FGF4, and 20 ng/mL FGF2. Refresh the medium every other day as described in step 4.3.\nOn day 17, change the medium to NMM with 100 ng/mL FGF8B. Refresh the medium every other day as described in step 4.3.",
    "On day 21, change the medium to NMM with 100 ng/mL BDNF and 10 ng/mL GDNF. Refresh the medium every other day as described in step 4.3.\nOn day 28, change the medium to NMM with 100 ng/mL BDNF and 10 ng/mL GDNF, 3 ng/mL SAG, 100 ng/mL NT3, and 25 mM KCl. Refresh the medium every other day as described in step 4.3.\nOn day 35, collect cells for analysis, or maintain in the same medium as step 4.2.5 for extended culture (potential limit not tested).\nChange/refresh differentiation medium for 2D culture\nTransfer the required volume of NMM with appropriate components (see steps 4.2.2-4.2.5 for component schedule) to a sterile tube. Warm in a water bath at 37 °C.\nAspirate the medium from wells, then add 2 mL new medium. Incubate at 37 °C with 5% CO2.\n\t\tNOTE: (Optional) The end volume can be kept at 2.5 mL/well of 6WP, using a pipette to remove 2 mL of old medium and adding 2 mL of fresh medium. Reserving a portion of old medium in the wells, and preventing cells from air contact, may lessen shock to the cells during change steps.\nPassage 2D differentiation culture\nTransfer the required volume of NMM with the appropriate components (see steps 4.2.2-4.2.5 for component schedule) to sterile tubes, for passaging process and, separately, to prepare PLO/LAM coated plate for receiving passaged cells. Supplement the medium of the destination plate with 10 µM RI. Warm the medium tubes at RT, or in a water bath at 37 °C. To save on components, it is possible to use NMM alone for washing cells during the passaging process.\n\t\tNOTE: (Important) If products will be used in calcium imaging experiments, ensure to passage cells between 2-6 days before the end of differentiation.",
    "Aspirate the medium from wells to be passaged. Add 300 µL/well of trypsin-based dissociation agent (see Table of Materials), swirl plate to cover wells, then immediately remove the dissociation agent.\nAllow the plate to sit for 2 min at RT, then loosen the cells by tapping on sides of the plate. Add 600 µL/well defined trypsin inhibitor (DTI) and transfer the cells in DTI to a sterile tube with 5 mL NMM.\nCentrifuge the tube at 290 x g for 15 min at RT. Aspirate the medium and add another 5 mL NMM to the tube.\nCentrifuge the tube at 290 x g for 15 min at RT. Aspirate the medium and resuspend the cells in the appropriate medium containing RI.\nDistribute the cells on the PLO/LAM plate using a splitting ratio of 1:1-1:12, depending on the initial confluence, proliferation rate, and size differential in origin to the destination plate, and maintain at 37 °C with 5% CO2."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}