{
  "id": 10502,
  "origin_website": "Jove",
  "title": "A Droplet-Based Microfluidic Approach and Microsphere-PCR Amplification for Single-Stranded DNA Amplicons",
  "procedures": [
    "1. Fabrication of a PDMS Microfluidic Platform\nPrepare 20 mL of liquid PDMS prepolymer by mixing base polymer and catalyst in a volume ratio of 10:1. Pour 10 mL of the liquid PDMS onto a prepared SU-8 mold on a silicon wafer for the upper part of the microfluidic network. For the bottom flat part, pour the same volume of liquid PDMS on the silicon wafer without a mold structure.\n\tNote: The microfluidic network is designed in a CAD program and then converted into a photomask in order to fabricate a master using the typical photolithography process (See Supplemental Figures). This master is comprised of the negative photoresist SU-8 mold on the silicon wafer11.\nPlace two silicon wafers coated with liquid PDMS prepolymer on the hot plate and cure at 75 °C for 30 min.\n\t\nManually peel off the cured PDMS layer from the SU-8 mold. Align a 1.5 mm diameter round hole punching tool to the oil port on the replicated microfluidic network for interfacing micron-scale flow channels with the macro fluid samples. Punch out the through-hole manually.\nRepeat this punching process three times for the formation of the two solutions and the outlet port.\nPerform hydrophilic surface treatment on both the upper and bottom PDMS layers using a hand-held corona treater12 for several seconds per sample.\n\t\nStack two plasma-treated PDMS layers and heat at 90 °C for 30 minutes using a hot plate for the PDMS-to-PDMS bonding process. Supply the pressurized water using the syringe pump into three inlet ports for the structural bonding and leakage testing of the fabricated device.\n2. Production of Polyacrylamide Oligo-Microspheres\nPrepare bead-mixture detailed in Table 1.\nVortex and briefly centrifuge the standard ssDNA acrydite labeled probe (Ap, 100 μM) and acrylamide:bis (19:1) stock solution.",
    "Prepare solution I by mixing 25 μL of 40% acrylamide bis solution, 10 μL of ssDNA (acrydite probe), 10 μL of 5x TBE buffer (1.1 M Tris; 900 mM borate; 25 mM EDTA), and 5 μL of water. Prepare solution II with 50 μL of 20% ammonium persulfate.\nPrepare two syringes individually filled with solution I and solution II, and mount them onto the pump to introduce solution flows into the microfluidic platform. Prepare mineral oil mixed with 0.4% TEMED for surface solidification of the microsphere.\n\tNote: TEMED is well-known as a free radical stabilizer. Free radicals can accelerate the rate of polymer formation with ammonium persulfate (APS) in order to catalyze acrylamide polymerization.\nFill a glass bottle with 4 mL of the mineral oil to generate a continuous flow.\nInsert two tubes to two ports in the cap of the glass bottle as a microfluidic reservoir: the pneumatic port for applying the compressed air into the glass bottle from the air compressor and the fluid port for supplying the pressurized oil to the micro channel network from the glass bottle. Connect tubes between the glass bottle and the oil port in the microfluidic device.\n\t\nConnect the tubes to the two solution ports in the microfluidic device in order to supply the two solutions from the syringe pumps. Insert tubes to the outlet port in order to transfer the generated microsphere into the beaker.",
    "Set the flow rate of the syringe pump to 0.4 - 0.7 mL/h. Adjust compressed air pressure of the compressor using a regulator (82 - 116 kPa). Set the rotational speed (500 rpm) of the magnetic stirrer bar in the glass beaker on a hot plate. Operate the syringe pump and supply the compressed air generated by an external compressor into the glass bottle using the ON/OFF control of an electromagnetic valve13.\nObserve the formation of microspheres in the flow-focusing geometry and solidification of generated microspheres in the glass beaker with a digital microscope.\n\tNote: The size and production speed of the microsphere depend on the flowrate of solutions and the pressure applied for the mineral oil flow (Table 2).\n3. Performing Polyacrylamide Oligo-Microspheres Counts\nFor hemocytometer quantification, take a small amount (approximately 100 μL) of aqueous solution of polyacrylamide oligo-microspheres and place on the glass hemocytometer, and gently fill the microsphere suspension up the well of the counting chamber.\n\tNote: For further details, see http://www.abcam.com/protocols/counting-cells-using-a-haemocytometer.\nUse a microscope and hand tally counter to count microspheres in one set of 16 squares. Then, move the hemocytometer to the next set of the chamber and carry on counting until all four sets of 16 corners are counted.\nDetermine the average microsphere count and calculate the number of microspheres in the original bead suspension.\nTransfer 100 μL of microspheres to a 1.5 mL microcentrifuge tube. Remove the supernatant through gentle centrifuging (400 x g) and pipetting.\n4. Performing DNA Hybridization on the Surface of Polyacrylamide Oligomicrosphere\nNote: An identical DNA probe with a 5’-NH2-group instead of 5’-acrytide modification is added into solution I and tested for Ap-containing microspheres in parallel. DNA hybridization results are shown in Figure 2. The Cy3-labeled complementary oligonucleotide probes (cAp) solution should be placed in a dark room.",
    "Resuspend Cy3-cAp using 100 μL of 1xTE buffer (TE buffer: 10 mM Tris and 1μM EDTA, pH 8.0) in order to achieve a final concentration of 100 μM. For example, resuspend 1 pmol of cAp in 100 mL of TE buffer and transfer to a microcentrifuge tube covered with aluminum foil.\n\tNote: For strand sequences, see Table 3.\nAdd 100 μM of Cy3-cAp to a sterile 1.5 mL microcentrifuge tube containing Ap-copolymerized microspheres.\nTap the tube a few times to mix and incubate at room temperature in the dark for 1 h.\nDiscard the supernatant and remove residual buffer through pipetting.\nRinse three times with 500 μL of TE buffer.\nResuspend microspheres by gently tapping the microcentrifuge tube. Then, repeat step 4.4.\nPlace microspheres on the glass slide (75 mm x 50 mm) and cover with aluminum foil prior to imaging.\n5. Asymmetric PCR for Amplifying ssDNA\nPrepare an asymmetric PCR reagent mix for amplifying ssDNA to be analyzed. Thaw the reagents in Table 4 on ice. Do not keep the Taq polymerase enzyme (50 U/µL) on ice, but rather store it at -20 °C until needed.\nGently vortex all reagents and then briefly centrifuge tubes at 10,000 x g for 10 s.\nCombine all reagents as described in Table 4.\nPlace samples into a thermocycler and start the asymmetric PCR under the following conditions: 25 cycles (95 °C for 30 s, 52 °C for 30 s, and 72 °C for 30 s), 85 °C for 5 min, hold at 4 °C.\n6. Microsphere-PCR for Amplifying ssDNA",
    "Note: This section describes the protocol for amplifying ssDNA in a PCR reaction tube. Microsphere-PCR reactions were performed in 50 μL of reaction volume. The detailed sequences used to amplify ssDNA are listed in Table 5. In this case, Ap on the surface of microspheres can anneal to random DNA templates in a complementary manner. This is a very important step for producing complementary DNA strands (antisense DNA strand, Figure 3). The DNA extended is used as a template for microsphere-PCR amplification.\nPrepare microsphere-PCR reagent mix. Thaw the reagents in Table 6 on ice; however, do not keep the Taq polymerase enzyme on ice. Store it at -20 °C until needed.\nGently vortex all reagents and then briefly centrifuge tubes at 10,000 x g for 10 s.\nObtain approximately ~25 microspheres through microscopic counting.\n\tNote: The number of microspheres in one reaction tube are calculated using a light microscope with 40X magnification. About ~25 microspheres are used for microsphere-PCR amplification. More detailed information is in Step 3.\nCombine all reagents as described in Table 6.\nPlace samples into a thermocycler and start the asymmetric PCR under the following conditions: 25 cycles (95 °C for 30 s, 52 °C for 30 s, and 72 °C for 30 s), 85 °C for 5 min, hold at 4 °C.\nFollowing amplification, add 8 μL of 6x loading buffer and load 15 μL of each sample into 2% agarose gel. Then, perform electrophoresis at 100 V for 35 min in 1x TAE (Tris-acetate-EDTA, 40 mM Tris acetate, 1 mM EDTA, pH 8.2) buffer.\n7. Confocal Microscopy Acquisition\nNote: The results of microsphere-DNA probe hybridization are imaged under a confocal microscope. Image analysis is performed using ImageJ.\nFix hybridized microspheres to the stage of the microscope in a holder.",
    "Select the laser (Helium/Neon laser, 543 nm line) and turn it on in laser control.\nSelect the objective lens in microscope control.\nSelect the desired filter for Cy3 and channel in configuration control.\nStart the experiment and observe the sample. Settings for the confocal microscope are summarized in Table 7.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}