{
  "id": 13763,
  "origin_website": "Jove",
  "title": "Scalable 96-well Plate Based iPSC Culture and Production Using a Robotic Liquid Handling System",
  "procedures": [
    "The robotic liquid handling system, which for the following protocols was Gilson’s pipetmaX, facilitates automated, scalable stem cell culture and production while maintaining traditional adherent culture conditions in the 96-well plate format. Like traditional 6-well plate culture, iPSCs are grown with this protocol as a monolayer of distinct colonies but in the 96-well plate format. Each well can be isogenic or distinct and either configuration can be cultured in parallel since the robot can keep each well segregated. The typical robotic iPSC culture routine has two phases: a feeding program where cultures are fed on a customizable schedule and a passage program where the user chooses the dissociation method and splitting ratio thereby controlling seeding density and scale rate. The following protocols describe how a new culture is started, how feeding and passage are accomplished and the supplementary programs that facilitate iPSC culture.\nNote: Please see the Materials List for specific recommendations on the matrix coating material and dissociation reagents validated for the following protocols.\n1. Preparing Extracellular Matrix Gel Coated 96-well Plates\nRemove the packaging from six new, RT 96-well plates and place them on the liquid handling robot bed in positions 2, 3, 5, 7, 8, 9 (see Figure 1A for bed positions).\nPlace a pre-chilled, 4 °C 4-well trough in bed position 6.\nLoad column 12 of the tip rack in bed position 1 with pre-chilled, 4 °C 200 µl pipet tips.\nFill the first (left most) trough well in bed position 6 with 25 ml 4 °C DMEM/F12 by pouring an aliquot using sterile technique. Alternatively, use a pipet to complete the transfer.\nRemove the 96-well plate lids and slide each into the specially designed plate lid holding rack (PLHR, see Figure 1A). Avoid contact with the inside of plate lids.",
    "Note: Handling the inside of a plate lid or stacking the plate lids where the inside of one lid touches the outside of another is an excellent route for contamination.\nUsing the robotic control touch pad, press the following series of buttons to start the well pre-wetting process:\n\t\nTap “Run a Protocol”.\nSelect “extracellular matrix gel Prewet” and tap next.\nUser decision: Tap “test run” to use the step-by-step wizard to pre-test the selected program.\n\t\tNote: The robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\nDuring the pre-wetting process (step 1.6) continue to step 1.8.\nThaw on ice one 4 mg aliquot of growth factor reduced extracellular matrix gel (GFRM) contained in a 50 ml conical tube stored at -80 °C. Keep the aliquot on ice until ready to use.\n\tNote: The GFRM will solidify if allowed to come to RT and will not be useful.\nResuspend the 4 mg GFRM aliquot in 24 ml 4 °C DMEM/F12 with a 25 ml glass pipet. When transferring the DMEM/F12, pause for 2-3 sec to allow the pipet to cool prior to resuspending the GFRM aliquot.\nWhen the pre-wetting process (step 1.6) is complete, continue to step 1.11.\nTransfer the 24 ml of DMEM/F12 GFRM mixture to the fourth well of the trough in bed position 6.\nUsing the robotic control touch pad, press the following series of buttons to start the extracellular matrix gel coating process:\n\t\nTap “Run a Protocol”.\nSelect “extracellular matrix gel aliquot” and tap next.\nUser decision: Tap “test run” to use the step-by-step wizard to pre-test the selected program.",
    "Note: The robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\nWhen step 1.12 is complete, replace the plate lids.\nTransfer the extracellular matrix gel coated 96-well plates to a 37 °C, 5% CO2, humidified incubator and hold there for 24 hr at which point the plates will be ready to use or stored.\n\tNote: Under extenuating circumstances, the newly coated extracellular matrix gel plates may be used after 15-30 min of incubation but O/N to 24 hr incubation is recommended.\nRepeat protocol steps 1.1, 1.3, 1.5-1.6, 1.10, and 1.12-14 until all of the DMEM/F12 with GFRM is used.\n2. Storing Extracellular Matrix Gel Coated 96-well Plates\nRemove extracellular matrix gel coated 96-well plates from the 37 °C, 5% CO2, humidified incubator.\nOptional: Allow the extracellular matrix gel coated 96-well plates to come to RT before proceeding to step 2.3.\n\tNote: This optional step will reduce condensation build up when the plates are placed at 4 °C.\nPlace the plates on the liquid handling robot bed in positions 2, 3, 5, 7, 8, 9 (see Figure 1A for bed positions).\nLoad column 12 of the tip rack in bed position 1 with RT 200 µl pipet tips.\nPlace a four trough reservoir in bed position 6.\nFill well 4 (rightmost) of the reservoir with RT DMEM/F12.\nRemove the 96-well plate lids and slide each into the PLHR.\nUsing the robotic control touch pad, press the following combination of buttons:\n\t\nTap “Run a Protocol”.\nSelect “extracellular matrix gel aliquot” and tap next.\nUser decision: Tap “test run” to use the step-by-step wizard to pre-test the selected program.",
    "Note: The robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\nOnce complete, replace the plate lids and remove the plates from the machine bed.\nWrap around the entire side of each extracellular matrix gel coated 96-well plate (where the lid meets the plate) with a one inch by 6 inch paraffin film strip. Be sure to stretch the paraffin film to create an airtight seal.\nOptional: Label the plates with the date of completed extracellular matrix gel coating, the extracellular matrix gel lot number, user name and any other information.\nStore the plates at 4 °C where they will be good to use for up to two weeks.\n\tNote: Plates have been successfully used beyond the two week limit, however, it is not recommended.\n3. Performing a Stem Cell Colony Seeding Density Gradient in the 96-well Plate Format from a Live or Frozen Culture: How to Start or Restore Normal Passage Intervals to a Stem Cell Line\nIf starting with a frozen culture, proceed to step 3.2. If starting with a live stem cell culture already on a plate, begin at step 3.5.\nThaw the frozen culture by swirling the tube in a 37 °C water bath until only a small chunk of ice remains.\nOptional: Dilute the thawed cells into 10 ml RT stem cell growth media (SCGM), centrifuge for 2 min at 300 x g, aspirate the supernatant media and resuspend the stem cell pellet in 7 ml fresh SCGM containing 10 µM Y27632.\n\tNote: This step eliminates carryover of the freezing media.\nProceed to Step 3.6.",
    "If starting with live, already plated stem cells: passage the cells as normal using enzymatic or non-enzymatic dissociation. Try to harvest a total of 1.5-3 million cells; usually one well of a six-well plate. Centrifuge the harvested cells for 2 min at 300 x g, aspirate the supernatant media and resuspend the stem cell pellet in 7 ml fresh SCGM containing 10 µM Y27632. Proceed to Step 3.6.\nEnsure the cells, either from a frozen or live culture, are suspended in 7 ml RT SCGM with 10 μM Y27632.\nLoad column 12 of the tip rack in bed position one with RT 200 µl pipet tips.\nPlace a four trough reservoir in bed position 2.\nPlace one new extracellular matrix gel coated 96-well plate pre-warmed to 37 °C in bed position 5 and remove the lid placing it in the PLHR.\nTransfer the 7 ml of resuspended cells to well 3 of the reservoir by pipet or sterile pour.\n\t\nUsing the robotic control touch pad, press the following combination of buttons:\nTap “Run a Protocol”.\nSelect “Seeding Density Gradient” and tap next.\nUser decision: Tap “test run” to use the step-by-step wizard to pre-test the selected program.\n\t\tNote: The robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\nWhen the dilution series is complete, re-cover the plate and place in a 37 °C, 5% CO2, humidified incubator until the next feeding.\nOptional: Label the plate with the date, strain information, user name, media type and other pertinent information.\nOver the next several days, feed the 96-well plate as required using Protocol 4 below.",
    "Note: A typical stem cell plate will require a full media change once every 24 hr and the SCGM does not contain Y27632 for feeding; only during the initial seeding after passage. Prior to feeding, check the plate for contamination and colony density. See step 3.16 for more on monitoring colony density.\nOver the next few days, several columns near the center of the plate (usually columns 5-8) will approach an ideal density for passage; to identify this density, compare the 96-well plate to the density range shown in Figure 3B with the following information in mind:\n\t\nPassage when the space between the majority of the colonies is approximately 25% of adjacent colony diameter.\n\t\tNote: The rationale to identify the time to passage is that another cycle of feeding and growth would result in colonies making contact, which should be avoided.\nTo start a uniformly diluted plate and begin regular culture, select a column that is at the ideal density and passage. See Protocol 5 to passage.\n4. Feeding 96-well Plate Stem Cell Colonies\nNote: The following protocol describes the feeding of one 96-well stem cell colony plate. The technique can be scaled up to accommodate 6 total plates in parallel.\nRemove the 96-well stem cell colony plate from the 37 °C, 5% CO2, humidified incubator.\nCheck the plate for contamination and cell density. In order to feed, ensure that the colony density is below the ideal passage density. See Figure 3B for information on density.\n\tNote: Contamination may present as turbid media and be accompanied by an unpleasant smell. Small, obviously non-iPSC aggregates may also be visible under microscopic inspection. To evaluate cell density, see step 3.16.1 above.\nPlace the 96-well stem cell colony plate in bed position 3 on a sloped, 37 °C ramp.",
    "Load column 12 of the tip rack in bed position 1 with RT 200 µl pipet tips.\nPlace a 4-well trough in bed position 2.\nFill well 3 of the trough in bed position 2 with 8 ml fresh, RT SCGM without Y27632 either by sterile pour or pipet transfer.\nRemove the 96-well stem cell colony plate lid placing it in the PLHR.\nUsing the robotic control touch pad, press the following combination of buttons:\n\t\nTap “Run a Protocol”.\nSelect “Colony Feed One Plate” and tap next.\nUser decision: tap “test run” to use the step-by-step wizard to pre-test the selected program.\n\t\t​Note, the robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\nWhen the feeding protocol is complete, re-cover the 96-well stem cell colony plate and return to the 37 °C, 5% CO2, humidified incubator until the next feeding or passage is required. This is usually required after 24 hr.\n\tNote: It is recommended to record the feeding event on the plate cover with the date, media type, user name and other pertinent information.\n5. Passaging 96-well Plate Stem Cell Colonies\nAfter several feeding cycles the 96-well stem cell colony plate will be ready to passage. This protocol describes passage of one column to one 96-well plate, representing a 1:12 split ratio. The user can define the split ratio and select any number of wells or columns to split, including choosing wells that may not be adjacent.",
    "Compare the 96-well stem cell colony plate density to Figure 3B to determine whether to passage. The ideal passage density is when the space between the majority of colonies is approximately 25% of adjacent colony diameter or a subsequent feeding would result in the colonies growing into one another.\nExamine the 96-well stem cell colony plate under a microscope to ensure there is no contamination.\nPlace the 96-well stem cell colony plate in bed position 3 on a sloped, 37 °C ramp.\nLoad columns 8-12 in the tip loading rack in bed position 1 with RT 200 µl pipet tips.\nPlace a 4-well trough in bed position 2.\nLeave trough well 1 empty, put 8.5 ml SCGM + 10 µM Y27632 in well 2, put 3.5 ml 30% proteolytic and collagenolytic dissociation reagent (or EDTA based dissociation reagent) in well 3, put 4.5 ml PBS in well 4.\n\tNote: All reagents can be at RT or 37 °C. RT proteolytic and collagenolytic dissociation reagent at 30% diluted with PBS was used for the Adipose and Fibroblast derived iPSC culture described here.\nPlace one new, pre-warmed 37 °C extracellular matrix gel coated 96-well plate in bed position 5.\nRemove the 96-well stem cell colony plate lid, as well as the new 96-well plate lid and place them both in the PLHR.\nUsing the robotic control touch pad, press the following combination of buttons:\n\t\nTap “Run a Protocol”.\nSelect “Colony Split 1:12 Column 1” and tap next.\nUser decision: Tap “test run” to use the step-by-step wizard to pre-test the selected program.\n\t\tNote: The robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\nOnce the passage protocol has finished, re-cover both plates.",
    "Optional: Label the new plate with the requisite information (i.e., date, cell line, passage number, media type, user name etc.).\nReturn both plates to the 37 °C, 5% CO2, humidified incubator until the next feeding or passage is required. Note: The next feeding is typically after 24 hr.\n\tNote: Cells and colonies should attach to the plate within 2-3 hr of splitting and look very spread out. This is due to the presence of Rho-kinase inhibitor and the cells will condense and exhibit the characteristic stem cell morphology (i.e., cobblestone packed colonies with small cell volume to big nucleus ratio) after the first Rho-kinase inhibitor free feeding.\n6. Harvesting 96-well Plate Stem Cells for Production\nNote: Stem cell colonies may be harvested for use at any point during culture. Usually this occurs when the cells are ready to passage (see protocol 5). This protocol describes how to harvest eleven columns from a 96-well stem cell colony plate.\nExamine the 96-well stem cell colony plate under a microscope to ensure there is no contamination.\nPlace the 96-well stem cell colony plate in bed position 3 on a sloped, 37 °C ramp.\nLoad columns 11 and 12 in the tip loading rack in bed position 1 with RT 200 µl pipet tips.\nPlace a 4-well trough in bed position 2.\nLeave trough well 1 empty, put 8.5 ml SCGM in well 2, put 3.5 ml 30% proteolytic and collagenolytic dissociation reagent (or EDTA based dissociation reagent) in well 3, put 4.5 ml PBS in well 4.\n\tNote: All reagents can be at RT or 37 °C.\nRemove the 96-well stem cell colony plate lid and place in the PLHR.\nUsing the robotic control touch pad, press the following combination of buttons:\n\t\nTap “Run a Protocol”.",
    "Select “Colony Harvest Columns 2-12” and tap next.\nUser decision: Tap “test run” to use the step-by-step wizard to pre-test the selected program.\n\t\tNote: The robot does not run but rather the software tests the protocol for software problems. With established protocols, tapping, “skip setup” is acceptable.\nTap “Run Protocol”.\n\t\tNote: Once the collection procedure is complete, the cells will be in trough well 2 and ready for collection."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}