{
  "id": 18518,
  "origin_website": "Jove",
  "title": "VDJ-Seq: Deep Sequencing Analysis of Rearranged Immunoglobulin Heavy Chain Gene to Reveal Clonal Evolution Patterns of B Cell Lymphoma",
  "procedures": [
    "1. VDJ Amplification\n1.1) DNA Extraction from Tumor Samples\nExtract DNA from thin sections (10-20 µm) of frozen O.C.T. embedded normal or malignant tissues.\n\t\nDigest 10-30 thin sections of embedded tissue cut by a cryostat microtome in 4 ml Nucleic Lysis Buffer (0.0075 M Tris HCl, pH 8.2; 0.3 M NaCl; 0.002 M Na2EDTA) with Proteinase K (0.5 mg/ml, final concentration) and 0.625% SDS in a 15 ml centrifuge tube in a 37 °C water bath overnight.\nAdd 1 ml of saturated NaCl (5 M) to the digestion mixture and shake vigorously for 15 sec.\nCentrifuge at 1,100 x g for 15 min at room temperature.\nTransfer the supernatant to a new 15 ml centrifuge tube and add two volumes of 100% Ethanol.\nMix by inverting the tube 6-8 times. Centrifuge at 5,000 x g for 60 min at 4 °C to collect the precipitated DNA.\nWash the DNA pellet twice with 70% ethanol. Centrifuge at 5,000 x g for 15 min each time to collect the pellet.\nDissolve DNA in 100-400 µl TE buffer at room temperature on a shaker overnight. The DNA yield is 5 to 200 µg (final concentration between 50-500 ng/µl) depending on the size of the tissue\nExtract DNA from thin sections (10-20 µm) of formalin-fixed, paraffin- embedded (FFPE) normal or malignant tissue.\n\t\nIncubate paraffin sections in 1 ml xylene twice at room temperature for 10 min each time in a 1.5 ml microcentrifuge tube to de-paraffinize. Collect the tissue sections by spinning at 13,000 x g for 5 min at room temperature.",
    "Incubate sections in 1 ml 100% ethanol twice at room temperature, 10 min each time to remove residue xylenes. Collect the tissue sections by spinning at 13,000 x g for 5 min at room temperature. The paraffin is completely dissolved at this point and only the tissue section is remaining.\nAir-dry the sections at room temperature for 10-15 min.\nMake a 0.5 mg/ml Proteinase K solution with 1x PCR buffer (diluted from 10x PCR buffer with nuclease-free water). Add the Proteinase K solution to the samples in a final volume of 50-100 µl and incubate overnight at 37 °C.\nHeat the samples at 95 °C for 10 min to inactivate Proteinase K.\n\t\tNote: At this step, sample DNA is dissolved in the PCR buffer and can be used in Steps 1.2 and 1.3 directly. The DNA yield is 0.5 to 20 µg (final concentration between 10-200 ng/µl) depending on the size of the tissue.\n1.2) DNA Quality Assessment\nMix 0.25 µl Taq DNA polymerase with 45 µl of master mix from the commercial ladder kit in a PCR tube.\nAdd 5 µl DNA prepared from 1.1.1.7 or 1.1.2.5 into the PCR tube and mix well by pipetting up and down for at least 5 times.\nUse the following conditions to amplify the DNA: 95 °C for 7 min; followed by 35 cycles of 45 sec at 95 °C, 45 sec at 60 °C, and 90 sec at 72 °C; then 72 °C for 10 min and hold at 15 °C.\nPrepare a 2% agarose gel in TBE (Tris/Borate/EDTA).\nMix 20 µl PCR reaction with 4 µl 6x loading dye, and load onto a 2% agarose gel.",
    "Stain the agarose gel with 0.5 µg/ml ethidium bromide solution and detect PCR products with a gel imagining system. Note: the samples that yield 5 PCR products at sizes of 100, 200, 300, 400, and 600 bp will be continued to generate VDJ amplicons.\n\tCAUTION: Ethidium bromide is a potent mutagen. Please handle with extreme caution by wearing protective gears, i.e. gloves, and dispose into specific containers per institution’s guidelines.\n1.3) VDJ PCR\n1.3.1) Amplify Recombined IgH VDJ Segment from Framework Region 1 (IgVHFR1)\nMix 45 µl master mix from the tube labeled as “Mix 2” of a commercial somatic IGH Hypermutation Assay for Gel Detection kit, 0.25 µl Taq DNA polymerase, and 5 µl sample DNA prepared from 1.1.1.7 or 1.1.2.5 in a PCR tube.\nUse the following conditions to amplify the DNA: 95 °C for 7 min; followed by 35 cycles of 45 sec at 95 °C, 45 sec at 60 °C, and 90 sec at 72 °C; then 72 °C for 10 min and hold at 15 °C.\nResolve the entire PCR product in a 2% agarose gel by electrophoresis.\nStain the agarose gel with 0.5 µg/ml ethidium bromide solution and detect PCR products with a gel imaging system. A monoclonal amplicon is expected with the size range of 310-380 bp.\nExcise the gel portion containing the monoclonal amplicon between 310-380 bp.\nPurify DNA from excised gel using a standard Gel Extraction Kit according to manufacturer’s protocol. Note: for samples that FR1 fragments could be obtained, there is no need to amply IgVHFR2 and IgVHFR3.\n1.3.2) Amplify Recombined IgH VDJ Segment from Framework Region 2 (IgVHFR2)",
    "Mix 45 µl master mix from the tube labeled as “Tube B” of a commercial IGH Gene Clonality Assay for Gel Detection kit, 0.25 µl Taq DNA polymerase, and 5 µl sample DNA prepared from 1.1.1.7 or 1.1.2.5 in a PCR tube.\nUse the following conditions to amplify the DNA: 95 °C for 7 min; followed by 35 cycles of 45 sec at 95 °C, 45 sec at 60 °C, and 90 sec at 72 °C; then 72 °C for 10 min and leave at 15°C.\nResolve the entire PCR product in a 2% agarose gel by electrophoresis.\nVisualize PCR product(s) by 0.5 µg/ml ethidium bromide staining. A monoclonal amplicon may be observed within the size range of 250-295 bp.\nExcise the gel portion containing the monoclonal amplicon between 250-295 bp.\nPurify DNA from excised gel using a standard Gel Extraction Kit according to manufacturer’s protocol.\n1.4) Optimize VDJ PCR\nUse the following modified PCR conditions to amplify IgVHFR1 and IgVHFR2 using suboptimal DNA: 95 °C for 7 min, 40 cycles of 95 °C for 60 sec, 60 °C for 60 sec, and 72 °C for 90 sec, final extension at 72 °C for 10 min.\n2. VDJ Amplicon Library Preparation and Sequencing\n2.1) Library Preparation\n2.1.1) End-repair\nTransfer VDJ PCR product from 1.3 into a PCR tube and add Resuspension Buffer from DNA Sample Preparation Kit to bring up the volume to 60 µl.\nAdd 40 µl of End Repair Mix from DNA Sample Preparation Kit and mix thoroughly.\nIncubate the reaction at 30 °C for 30 min in a pre-heated thermocycler (30 °C) with a pre-heated lid at 100 °C.",
    "Mix 136 µl magnetic beads and 24 µl PCR grade water first in a 1.5 ml tube, then transfer the entire End-repair reaction from 2.1.1.3 into the 1.5 ml tube and mix well with the beads solution.\nPlace tubes on a magnetic stand for 2 min to allow the separation of the beads from the solution. Aspirate the supernatant, and wash the beads with 80% fresh prepared EtOH twice while the tube is on the magnetic stand.\nAspirate the ethanol solution completely and allow the beads to air dry for 15 min at room temperature for 15 min.\nTake tube off the magnetic stand and resuspend beads in 17.5 µl Resuspension Buffer.\nPlace tubes back onto the magnetic stand for 2 min to separate beads from the Resuspension Buffer. Remove the Resuspension Buffer (End-repair product is resuspended in the Resuspension buffer now) into a clean PCR tube.\n2.1.2) A-tailing\nAdd 12.5 µl A-tailing mix into the PCR tube containing End-repair product and mix thoroughly.\nIncubate the PCR tube at 37 °C for 30 min in a pre-heated thermocycler (37 °C) with a pre-heated lid at 100 °C.\n2.1.3) Adaptor Ligation\nAdd 2.5 µl Resuspension Buffer, 2.5 µl Ligation Mix, and 2.5 µl DNA Adaptor Index into the A-tailing reaction.\nIncubate the reaction at 30 °C for 30 minl in a pre-heated thermocycler (30 °C) with a pre-heated lid at 100 °C.\nAdd 5 µl Stop Ligation Buffer into each reaction and mix thoroughly.\nMix 42.5 µl well-mixed magnetic beads to clean the reaction following steps 2.1.1.5 to 2.1.1.8. Add 50 µl Resuspension Buffer to elute the adaptor-ligated product.\nClean the adaptor-ligated product for a second time by using 50 µl well-mixed AMPure XP beads, and elute the product in 25 µl Resuspension Buffer into a clean PCR tube.",
    "2.1.4) Amplify DNA Fragments\nAdd 5 µl PCR Primer Cocktail and 25 µl PCR Master Mix to the PCR tube containing adaptor-ligated product and mix thoroughly.\nPerform amplification in a pre-programmed thermocycler with the following conditions: 98 °C for 30 sec; 10 cycles of 98 °C for 10 sec, 60 °C for 30 sec and 72 °C for 30 sec; then 72 °C for 5 min and hold at 10 °C.\nClean up the reaction by using 50 µl well-mixed magnetic beads, and elute the final product in 30 µl Resuspension Buffer.\n2.1.5) Library Validation\nQuantify the final product with a fluorometer using manufacturer’s protocol. Final library concentration is between 2.5 to 20 ng/µl.\nAssess the quality of the final product by using an analytical instrument with High Sensitivity DNA chip according to manufacturer’s protocol. Expect a single band with the expected size for either IGVHFR1, IGVHFR2 or IGVHFR3. The expected size of the library product equals the size of the original VDJ amplicon plus the size of the adaptors (~125 bp).\n2.2) VDJ-PCR Library Pooling and Sequencing\nCalculate the molarity of each library fraction using the following formula: nM = [(ng/1,000)/bp*660] x 109 where ng is the concentration of the VDJ-PCR library measured in step 2.1.5.1 and bp is the peak size of the VDJ-PCR library measured in step 2.1.5.2.\nDilute the library to 2 nM (10 µl total) with DNase-free water.\nCombine the 10 µl of the diluted 2 nM libraries together into a 1.5 ml tube.\nAdd an equal volume of PhiX spike-in control into the 1.5 ml tube.\nLoad the pool at 7 pM concentration onto a flowcell.\nSequence the libraries using a paired-end 150 cycle sequencer according to manufacturer’s protocol.\n3. Data Analysis",
    "Note: A summary of the bioinformatics scripts used in this section can be found as a Supplementary Code File.\n3.1) Alignment and QC\nMap paired-end sequencing reads against a human IGH V, D and J region database downloaded from the IMGT website11 using an adapted nucleotide blast algorithm based upon ‘blastn’ available from NCBI with gap open penalty of 2, gap extension penalty of 1, word length of 7, and e-value threshold of 10-4. Discard the read-pair does not map to both an IGH V and a J region.\nCount the remaining read-pairs that have IGH V and J mappings to obtain the frequencies of matching VJ combinations across all read pairs obtained from the sequencing run on the sample. Count a read-pair if it is mapped to both an IGH V and J gene, and then add its allele to the corresponding count for the particular VJ combination.\nRank the counts for each recombined VDJ region obtained from 3.1.2 from the highest to the lowest. The VDJ region has the highest reads count is defined as major rearrangement combination.\nDiscard aligned sequences that cover less than 35% of the domain major rearrangement identified in 3.1.3.\n3.2) SHM Profile Identification\nCount all SHM patterns across the reads from step 3.1.3. Define each SHM pattern as a subclone.\nCount the number of the subclones that are corresponding to different unique SHM patterns, and the number of reads that are mapped to individual subclones.\n3.3) Graphical Representation of Results",
    "Perform the phylogenetic analysis on the subclones using their corresponding SHM patterns using a neighborhood joining method from R package “ape” according to manufacturer’s protocol. Calculate a distance matrix from the individual distinct alignments to recreate the subclone phylogeny rooted to the germline sequence of the VJ combination in question for each paired sample set.\nUse the nucleotide sequence of each subclone as character vector and calculate the approximate string distance between all subclones in the major VJ rearrangement for both diagnosis and corresponding relapse samples using a Levenshtein distance measure where mathematically the distance between two alignments is given by dx,y(i,j) where dx,y(i,j) = 1 if i ≠ j and 0 otherwise, and then sum this function over the length of the string corresponding to nucleotide sequences i and j.\nGraphically display the resulting matrix of subclone distances and their corresponding subclone counts in the following two ways:\n\t\nUse R package “MASS” according to manufacturer’s protocol to apply multidimensional scaling to the subclone distance matrix and generate a two dimensional principle coordinates map, which is then plotted along with the logarithm of subclonal counts as the radius of the circle.\nConstruct an undirected graph based upon the Levenshtein distance, where the vertices correspond to each distinct subclone arising from the major VJ rearrangement.\n\t\tNote: If the distance between two distinct clones is equal to one then there exists an edge between these two vertices. If the distance is greater than one, then there is no edge connecting them.",
    "Plot the graph of 3.3.3.2 using the tkplot function in the “iGraph” R package with the Kamada Kawai layout according to manufacturer’s protocol. The radius of the vertices is proportional to the cubed root of the total number of clones mapped to it and the shading uses a red and blue range to denote the proportion of clones that either belong to the diagnosis (blue) or relapse (red) samples.\n3.4) Heterogeneity (Entropy) Measurement\nExamine the numbers and subclone counts of the individual patterns of somatic hypermutation occurring in the major VJ rearrangement for each paired set of samples.\nCalculate the empirical entropy and residual empirical entropy adjusted for the number of distinct clones in each sample using the standard histogram based entropy estimation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}