{
  "id": 13680,
  "origin_website": "Jove",
  "title": "Isolation and Differentiation of Adipose-Derived Stem Cells from Porcine Subcutaneous Adipose Tissues",
  "procedures": [
    "Note: This method has been established and used in research reported previously14-17 from this laboratory; over time the methodology was modified. The current procedure was performed using an average of 60 g of porcine subcutaneous adipose tissues from one piglet (7 to 9 days old) with seeding on 6-well tissue culture plates. All procedures were performed at RT unless otherwise designated. All the animal experiments were approved by the Institutional Animal Care and Use Committee (IACUC) at National Taiwan University.\n1. Prepare Digestion Medium\nObtain subcutaneous adipose tissues from the neck and back; 40 to 80 g per piglet (7 to 9 days old), depending on the size of the pigs. Here, use 60 g of subcutaneous adipose tissues obtained from one pig.\nPrepare digestion medium: weigh collagenase II powder with a total of 54,000 units and dissolve it in 90 ml Dulbecco's Modified Eagle Medium (DMEM, for 60 g fat) in a 100 ml serological bottle (900 units of collagenase/1.5 ml DMEM/g fat).\nGently agitate the digestion medium on a shaker table (100 rpm) for at least 15 min to dissolve and then pass the digestion medium through a 0.22 µm filter for sterilization. Store at 4 °C before use.\n2. Dissect Subcutaneous Adipose Tissues from Pigs\nSterilize all instruments, glass and plastic ware and warm all the media to 37 °C before use.\nSacrifice the piglet with electrical stunning and exsanguination or by using a method in accordance with the local IACUC regulations. Perform dissection carefully and immediately after piglets are sacrificed.\nLay the piglet on a clean surgical table (back facing up and belly down). Shave off the hair from the piglet back removing all hair from the neck to the tail and on both sides down to the midline.",
    "Scrub the pig's dorsal skin with 7.5% povidone-iodine three times (with three new independent-scrubs) and then allow the iodine to sit on the surface of the skin for about 10 min.\nRemove the povidone-iodine with multiple sprays of 70% ethanol. Use gauze pads or tissue papers containing 70% ethanol to wipe the skin in one direction, repeating until no obvious color of povidone-iodine is observed.\nUse a scalpel to separate the porcine dorsal fat layer of subcutaneous adipose tissues along with the attached skin layer from the muscles while holding up the fat and skin using forceps.\nImmediately immerse the fat layer of subcutaneous adipose tissues with attached skin in a sterilized beaker (200 ml) containing serum-free DMEM.\nSpray the outside of the beaker containing the fat layer with 70% ethanol and place in a laminar flow cell culture hood. Place a large (40 cm x 30 cm) sterilized triple-layer cover foil in the hood. [A triple layer is used to ensure continual integrity.]\nPlace the tissue with the skin facing down onto the cover foil.\nTrim the remaining muscle tissue off of the adipose tissue using forceps and scissors to avoid contamination with muscle tissue.\nCut the fat into square pieces (~7 cm X 7 cm) with a scalpel or scissors. Put these pieces of the fat layer into a new sterilized beaker (200 ml) containing serum-free DMEM.\nSet a customized slice holder on the cover foil assembled with a carbon steel slicer blade (Figure 1). Take one piece of fat out of the beaker and place it on the slicer (skin layer on top and fat layer below).\nSlice the fat layer of subcutaneous adipose tissues into approximately 1 mm thick pieces. Slice the fat layer from the skin as close as possible but avoid slicing the skin.",
    "Mince sliced adipose tissues with scissors as fine as possible.\nAdd filtered digestion medium containing collagenase to a 250 ml Erlenmeyer flask or a serological bottle with minced adipose tissues (54,000 units of collagenase/90 ml DMEM/60 g fat).\nIncubate and swirl the Erlenmeyer flask at 45 rpm in an orbital shaker for 90 min at 37 °C to allow the collagenase to digest the tissues.\n\tNote: Check every 15 to 30 min to avoid over-digestion. The digestion process is completed if the digestion medium is a slurry without significant tissue clumps.\nAdd an equal volume (equal to the digestion medium) of culture medium containing DMEM/F12 with 10% fetal bovine serum (FBS) to stop the collagenase digestion.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53886/53886fig1.jpg\nFigure 1. A customized slicer used for isolation of pADSC. Dissected adipose tissues from porcine dorsal subcutaneous adipose tissues are composed of the fat layer with attached skin layers. A slicer is required to slice the fat layer approximately 1 mm thick with avoidance of over-slicing into the skin layers. From left to right: slice holder, slicer pad, carbon steel slicer blade, and screws. Slicer blade is inserted between slice holder and slicer pad when assembled. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53886/53886fig1large.jpg]\n3. Collection of pADSC from the Stromal-vascular Fraction\nPass the digestion medium containing the digested adipose tissues through a single layer of chiffon into a clean sterilized 250 ml Erlenmeyer flask or a 250 ml serological bottle. Use a forceps to depress the middle of the chiffon to guide and assist passage of the digest.\nDrain and twist the chiffon with a forceps to complete passage.\nDistribute the digestion medium into four 50 ml conical centrifuge tubes (~40 ml medium per tube).",
    "Centrifuge at 700 x g for 10 min to collect the pellet of stromal-vascular cells.\nDecant the supernatant without disturbing the pellets to remove most of the top fat layer containing mature adipocytes. Wash the pellet by adding 10 ml DMEM into each tube to resuspend the pellet with pipetting and gentle shaking of the tube.\nCentrifuge at 700 x g for 6 min. Decant the supernatant.\nAdd 10 ml ACK lysis buffer and then resuspend the pellet by pipetting. Let it stand for 7 min (5 to 10 min) at RT to lyse red blood cells in the stromal-vascular fraction.\nAdd equal amounts of DMEM (10 ml) to stop the reaction with gentle shaking of the tube and then centrifuge at 700 x g for 10 min.\nDecant the supernatant, add 10 ml DMEM into each tube, resuspend the pellet with repeated pipetting, and centrifuge at 700 x g for 6 min. Repeat twice.\nCollect and pass the DMEM (total of 40 ml DMEM from 4 tubes representing 60 g fat) with suspended cells through a 100 µm strainer into a new 50 ml conical tube.\nGently pipette medium several times to mix well and aliquot 20 µl of cell-containing medium mixed with 180 µl of 0.4% trypan blue solution (1:10 dilution) in a new 1.5 ml Eppendorf tube.\nCount the cells with a hemocytometer and then seed pADSC at a density of 60,000 cells/cm2 onto a desired size of culture dish or plate with culture medium containing DMEM/F12, 10% fetal bovine serum (FBS) and 1% antibiotics of penicillin-streptomycin-amphotericin B solution (P/S/A). Generally, seed the pADSC on the 6-well tissue culture plates for adipocyte or osteocyte differentiation. Seed the pADSC on 10-cm dishes for surface marker staining of stem cells or chondrocyte differentiation.",
    "Incubate the plates or dishes in the 37 °C incubator in air with 5% CO2 to allow cell attachment to the plates.\n4. Identification Stem-cell Surface Markers of pADSC by Flow Cytometry\nAfter 24 hr, remove the medium completely, wash the 10-cm dish twice with phosphate-buffered saline (PBS), and harvest cells with 1 ml of 0.25% trypsin-EDTA for 5 min at 37 °C.\nNeutralize trypsin-EDTA with equal amounts of culture medium (1 ml), collect cells in a new 15-ml conical tube, and then centrifuge at 400 × g for 7 min.\nDecant the supernatant. Wash the pellet twice in 3 ml ice-cold FCS-wash buffer (PBS containing 10% FBS) using re-suspension by pipetting coupled with centrifugation at 400 x g for 7 min.\nResuspend, count, and adjust pADSC to 106 cells/ml in ice-cold FCS-wash buffer. Place cells (100 µl/each tube) into multiple new 15-ml conical tubes and incubate tubes containing pADSC at 4 °C for 30 min with antibodies against either phycoerythrin-conjugated CD4a (CD4a-PE), CD29-PE, CD31-PE, CD44-PE, CD45-PE, CD90-PE, MHC I-PE or MHC II-PE for direct staining. Stop the reaction by washing the cells twice in 10 ml FCS-wash buffer coupled with 400 × g centrifugation for 7 min.\nFix and resuspend cells in fixation buffer (PBS with 0.01% FBS and 1% formaldehyde) for flow cytometry according to the manufacturer's instructions and our previous publication18.\n5. Differentiation of pADSC into Adipocytes, Osteocytes and Chondrocytes\nDifferentiation of pADSC into adipocytes\n\t\nPrepare adipocyte induction medium and adipocyte maintenance medium",
    "For adipocyte induction medium, prepare 1 L of serum-free DMEM/F12 (with antibiotics of 1% P/S/A) containing the following: 1 ml insulin stock (10 mg/ml HEPES buffer, pH 8), final conc = 10 µg/ml; 1 µl T3 stock (3,3',5-Triiodo-L-thyronine, 1 mM in DMSO), final conc = 1 nM; 200 µl transferrin stock (50 mg/ml double distilled H2O), final conc = 10 µg/ml; 100 µl dexamethasone stock (10 mM in ethanol), final conc = 1 µM; 100 µl rosiglitazone stock (10 mM in DMSO), final conc = 1 µM.\nPrepare adipocyte maintenance medium with the same additions as the induction medium, but with omission of dexamethasone.\nDifferentiation process for adipocytes\n\t\tNote: After seeding pADSC on 6-well plates, pADSC will be confluent within 72 h.\n\t\t\nAfter 3 days, remove the medium completely and then add 3 ml of adipocyte induction medium into each well. Return the plates to the incubator. This is day zero of differentiation.\nAfter 3 days, remove the adipocyte induction medium completely and replace with 3 ml of adipocyte maintenance medium every three days. Mature adipocytes will be terminally differentiated by about 9 days. Over 90% of adipocytes are well differentiated using this protocol. These adipocytes are ready for Oil Red O staining.\nDifferentiation of pADSC into osteocytes\n\t\nPrepare osteocyte induction medium: complete culture medium (DMEM/F12 with 10% FBS and 1% P/S/A) containing 1 µM dexamethasone, 10 mM β-glycerophosphate and 50 µg/ml ascorbate-2-phosphate.\nDifferentiation process for osteocytes\n\t\tNote: After seeding pADSC on 6-well plates, pADSC will be confluent within 72 h.\n\t\t\nAfter 3 days, remove the medium completely and add 3 ml of osteocyte induction medium into each well. Return the plates to the 37 °C incubator. This is day zero of differentiation.",
    "Replace with osteocyte induction medium every three days. Mature osteocytes will form by 14 days of differentiation. These osteocytes are ready for Alizarin Red S staining.\nDifferentiation of pADSC into chondrocytes\n\t\nPrepare chondrocyte induction medium: αMEM containing 1% FBS, 6.25 µg/ml insulin, 50 µg/ml ascorbate-2-phosphate, and 10 ng/ml transforming growth factor-β1.\nDifferentiation process for chondrocytes\n\t\t\nAfter seeding pADSC on 10-cm culture dishes for 24 h, remove culture medium completely and wash dishes twice with PBS.\nTrypsinize pADSC with 1 ml of 0.25% trypsin-EDTA for 5 min, and then neutralize with 1 ml culture medium. Collect, count and adjust pADSC in 15 ml conical tubes with a density of 2.5 × 105 cells per tube. Use a hemocytometer to count the cells.\nAfter centrifugation at 400 × g for 7 min, discard the supernatant without disturbing the pellet and add 1 ml of chondrocyte induction medium in a 15 ml tube. The tube is returned to the 37 °C incubator. This is day zero of differentiation.\nReplace the chondrocyte induction medium every three days without removing cells on the bottom. Mature chondrocytes will form in approximately 14 days. These chondrocytes are ready for Toluidine Blue O staining.\n6. Staining of Differentiated Adipocytes, Osteocytes and Chondrocytes\nOil Red O staining for differentiated adipocytes\n\t\nAt day 9, remove adipocyte maintenance medium in 6-well culture plates with differentiated adipocytes and then wash the plate twice with PBS. [In the following steps, add enough designated reagents to cover each well of the 6-well plate.]\nFix adipocytes with 10% formalin solution for at least 10 min.\nRemove the 10% formalin solution and wash the plate twice with double-distilled water.\nAfter two washes, add 100% propylene glycol to the culture plate and let stand for 1 min.",
    "Remove the 100% propylene glycol and then add Oil Red O solution (0.5% in propylene glycol) to the culture plate. Let stand for at least 10 min on a rocker shaker with gentle agitation (100 rpm).\nRemove the Oil Red O solution and then replace with 60% propylene glycol. Let stand for 1 min.\nRemove the 60% propylene glycol and then wash the plate twice with double-distilled water.\nReplace with 10% formalin solution. The stained lipid droplets inside of adipocytes are ready for observation by light microscopy.\nQuantification of intracellular Oil Red O (optional steps below): after microscopic observation, remove 10% formalin solution and wash the plate twice with double-distilled water.\nDrain the plate completely and add 500 µl of isopropanol to the 6-well plate.\nLet isopropanol stand in the 6-well plate on a gentle rocker shaker (100 rpm) for at least 10 min to dissolve the dye of Oil Red O.\nAspirate the isopropanol containing Oil Red O and distribute on a 96-well plate. Quantify the extracted Oil Red O using a spectrophotometric reading at 510 nm.\nAlizarin Red S staining for differentiated osteocytes\n\t\nAt day 14, remove osteocyte induction medium from 6-well plates with differentiated osteocytes and wash the plates twice with PBS. [In the following steps, add enough designated reagents to cover each well of the 6-well plate.]\nFix osteocytes in 10% formalin solution for at least 10 min.\nRemove the 10% formalin solution from each well and wash the plate twice with double-distilled water.\nAfter two washes, add 2% Alizarin Red S solution (pH = 4.1-4.3) to the 6-well plate and let stand for at least 15 min on a gentle rocker shaker (100 rpm).\nRemove the Alizarin Red S solution and then wash the plate twice with double-distilled water.",
    "Replace with 10% formalin solution. Osteocytes are ready for observation by light microscopy.\nToluidine Blue O staining for differentiated chondrocytes\n\t\nAt day 14, aspirate chondrocyte induction medium from the 15 ml conical tube without removing sediments of differentiated chondrocytes in the bottom of the tube and wash the tube twice with PBS. [In the following steps, add enough designated reagents to cover chondrocytes in the bottom of the tube or on the section slide.]\nFix chondrocytes in 10% formalin solution for at least 10 min.\nRemove the 10% formalin solution from each tube and wash the tube twice with double-distilled water.\nAfter two washes, embed pellets in OCT Compound and section with a cryostat at a thickness of 5 µm.\nStain the slide of the cryostat sections with Toluidine Blue O solution (0.1% with pH 4.1).\nRemove Toluidine Blue O solution and then wash the section twice with double-distilled water.\n\t\tNote: Chondrocytes on slides are ready for observation by light microscopy."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}