{
  "id": 9548,
  "origin_website": "Jove",
  "title": "Extinction Training During the Reconsolidation Window Prevents Recovery of Fear",
  "procedures": [
    "Overview\nThe study we describe in this protocol is conducted over three consecutive days, with a between-subject design of three experimental groups. On day 1, all subjects undergo fear conditioning, where they learn to discriminate between two cues, one that predicts a shock and another that doesn't. On day 2, all subjects undergo extinction training, but differ regarding to what happens beforehand: Two groups receive a reminder cue to reactivate the fear memory before extinction training whereas a third group receives no such cue. One group receives the reminder cue 10 min before extinction, thus they undergo extinction while the fear memory is reconsolidating. The other group receives the reminder cue 6 hr before extinction, thus they undergo extinction after this window has presumably closed. The third group receives no reminder cue before undergoing extinction, thus they undergo standard extinction training. On Day 3, all subjects return for another extinction session. Their level of fear when they first see the conditioned cue on Day 3 indicates whether the fear memory remains. All three days are conducted in the same experimental setting, which is a sound-attenuated, temperature-controlled room. The conditioned stimuli are colored squares presented on a computer screen. We induce and measure fear with a mild electric shock and skin conductance, respectively, using a Biopac system module (see Table 1). A desktop computer is used to run the AcqKnowledge software program that allows for the recording and monitoring of SCR while a separate computer is used to run and present the experimental script to the subject. The subjects undergo all three stages around the same time of the day.\n1. Fear Assessment with Skin Conductance Response (SCR) - Electrode Application & Recording",
    "The experiment room should ideally be kept warm (we set our rooms somewhere between 70 and 75 degrees) in order to facilitate reliable and measurable SCR. Clean the subject's right or left fingertips using a q-tip dampened with distilled water; we do not recommend abrasive cleansors as they can dry the skin, disrupting sweat responses. Ensure fingertips are completely dry prior to electrode application.\nApply highly conductive electrolyte gel to both electrodes (here we use \"Signa Gel\" by Parker Laboratories Inc., and electrodes connected to an MP100 Data Acquisition System made by Biopac Systems). Allow gel to rise slightly above the SCR electrode well and ensure there are no air bubbles within the gel as this can interefere with the SCR signal.\nAttach an electrode to the first and sec fingers of the hand between the first and sec phalanges, where the electrodermal signal is more pronounced. Ensure the electrode velcro straps are securely fastened and ask the subject to report whether they feel any pulsing in their fingertips. This pulsing indicates the straps have been applied too tightly, which can interefere with the SCR signal.",
    "Once skin conductance electrodes are secured, begin recording a skin conductance sample for approximately 5 min in order to test the subject's electrodermal signal. Here, we use AcqKnowledge 3.9 software (from Biopac Systems Inc.) and record SCR waveforms on a MAC desktop computer. We use a sampling rate of 200Hz, a level appropriate for a signal as slow as SCR, however higher rates may be used. The recording screen should be separate from the computer presenting the experimental script and out of the subject's sight. Ensure the subject has robust SCR responses by directing them to take in and hold a deep breath; this should produce a substantial rise in SCR (see Figure 1 for an example of such a response).\n2. Fear Induction with Mild Electric Shock Stimulation - Electrode Application & Work-up Procedure\nOn the wrist opposite the hand with the SCR electrodes, attach the stimulator bar. Here, we use a bar electrode (product code EL350 from Biopac Systems Inc.), connected to an SD9 Square Pulse Stimulator (made by Grass Technologies, an Atro-Med, Inc. Product Group) with a bead of conductance gel applied to each of the electrode heads.\nThe shock trigger should be unplugged from the stimulator box during the work-up procedure. Place the bar on the inner wrist, on either side of the palmaris longus tendon and secure with nylon velcro strap in order to keep it in place during the experiment, but ensure the strap is not on too tight.",
    "Inform the subject that they will receive manually delivered shocks. Start at a low level (we recommend 20 v), and work up to a level that they determine is uncomfortable but not painful. We recommend the shock duration to be set at 200 ms, 50 pulses/sec, a standard level used in an array of past fear conditioning studies21,24, although others have used slightly different durations to induce the same sensation25,26.\nManually trigger the shocks, starting at 20 volts. Continue triggering single shocks, gradually increasing the intensity in 5v increments, until the subject indicates that shocks are uncomfortable, but not painful. There should be a large SCR to the shocks (see Figure 2 for an example of a response to the shock). Record the final shock level and maintain this voltage level for the remainder of the experiment.\n3. Day 1 - Acquisition\nDirect the subject to keep their eyes on the screen at all times, find a comfortable position that will not require movement and breathe naturally since abrupt respiratory changes can interfere with SCR. Both arms should be placed in a relaxed position with wrists up on the table/desk in front of subject or on the arms of a comfortable chair. Tell the subject that they will see visual stimuli on the screen and receive occasional shocks. Instruct the subject to monitor the relationship between the stimuli they are seeing and when a shock is received.\nPlug the trigger back into the Stimulator and change the trigger on AcqKnowledge setting from OFF to EXTERNAL. Once the subject is ready to begin, place the voltage back up to the recorded level, and initiate both the AcqKnowledge file and the experimental script. Here, we use E-prime Software version 2.0 from Psychology Software Tools, Inc.",
    "During the acquisition session, one conditioned stimulus (here, a yellow square) co-terminates with an aversive outcome (here, a mild shock) on a subset (38%) of trials; we refer to this as our CS+. The other conditioned stimulus (here, a blue square) is never paired with the US; we refer to this as our CS-. We use partial reinforcement to slow learning since previous work has found that 100% reinforcement results in rapid extinction once subjects realize the relationship between the CS+ and US has changed21. A partial reinforcement paradigm also allows us to limit our analysis to non-reinforced CS+ trials, thus excluding CS+ related SCRs that are potentially contaminated by physiological responses to shock (see Figure 3 for examples of conditioned and unconditioned SCRs to each CS type).\nConditioned stimuli (CSs) are presented for 4 sec. There is a 10-12 sec random variable inter-trial-interval (ITI), during which subjects view a black screen with a white fixation cross in the center. Each session begins with a screen indicating the experiment is about to start (*READY*) and terminates with a screen indicating that they had successfully completed that part of the experiment (*YOU HAVE COMPLETED THIS PART OF THE EXPERIMENT*). During acquisition, a total number of 10 unreinforced trials CS+ trials and 10 CS- trials are presented in addition to 6 CS+ trials that are reinforced by shock.",
    "Produce two distinct pseudo-randomized orders for the whole experiment such that no trial-type (CS+, CS- or CS+US) repeats more than two times. Within each order, counterbalance the colors of the CSs. This should result in 4 orders whose assignment is randomized between individuals within each group. We recommend including at least one occurrence of consecutive reinforced CS+US trials to prevent subjects from assuming they will never receive consecutives shocks (see Table 2 for an example of trial order).\n4. Day 2 - Reactivation & Extinction Training\nSubject breakdown:\nRandomly divide all subjects that have demonstrated adequate acquisition of fear from day 1 (see Exclusion Criteria below) into three groups:\nGroup 1 (reactivation-10 min):  receives extinction training 10 minutes after retrieval within the reconsolidation window\nGroup 2 (reactivation-6 hr):  receives extinction training 6 hours after retrieval outside of the reconsolidation window\nGroup 3 (no-reactivation):  receives standard extinction training without any retrieval\nUpon arrival, each subject should be set up as per steps 1 - 2.2, with the same shock level set on Day 1 (no work-up is required). There are no new instructions. Tell the subject to sit comfortably and pay attention to the stimuli presented, just as the previous day.",
    "Subjects in the reactivation groups (both 10 min and 6 hr) undergo a single, unreinforced presentation of the CS+ (no shock) followed by a 10-min break. Subjects in the no-reactivation group undergo the set-up procedure, but then go directly to the break without the reactivation session. During the break, stop the AcqKnowledge recording of the SCR, turn the stimulator voltage to zero and direct subjects' attention to a separate screen that has a pre-selected TV show (e.g., here, we used a randomly selected ~10 min portion of a \"Simpsons\" episode). Subjects will watch it for 10 min while all electrodes remain attached.\nAfter the break, the reactivation-10 min group proceeds with extinction training. Subjects in the reactivation-6 hr group return for extinction training 6 hr later. For the no-reactivation subjects, half immediately undergo extinction training, and half return 6 hr later for training. This group controls for the reminder cue, as well as different time lapses between reactivation and extinction training in each reminder group. Additionally, since subjects in the reactivation-6 hr group might undergo extinction either in the afternoon or evening (to allow ample time to elapse after reactivation) it is important to run subjects in the reactivation-10 min and no-reactivation group in the morning, afternoon and evening, to allow an even distribution of subjects at each time of the day.\nDuring extinction, a total number of 10 unreinforced CS+ trials and 11 CS- trials are presented to each reactivation group. Since the CS- is not presented during the reactivation session, an extra presentation should be added to the extinction session so all CSs are presented an equal number of times during Day 2. The no-reactivation group should receive 11 unreinforced presentation of each CS.",
    "In the extinction session, resume the AcqKnowledge recording file and return stimulator voltage to the set level. Instruct the subject to attend to the experimental screen where an extinction script is waiting on *READY* screen. A reminder of the previous day's directions is often useful. Resume with the extinction training script, whereby the subject receives repeated presentations of both CSs without shock (see Table 2).\n5. Day 3 - Spontaneous Fear Recovery Assay\nIf the subject demonstrates adequate extinction learning (see Exclusion Criteria below) they should return to the lab 24 hr after their extinction session. Upon arrival, they should be set up as per steps 1 and 2.2; voltage is set to the same level as the acquisition session. Remind subjects of the directions from the previous days.\nEach subject would undergo a re-extinction session, whereby they again receive 10 unreinforced presentations of both CSs (see Table 2) in order to assess the extent to which fear responses recover due to the passage of time. The first trial on Day 3 should be an extra CS- (see Table 3) and is disregarded due to the orienting response at the beginning of the session. (The same can be done at the start of Day 2, however, since only the data from late acquisition is used to assess extinction learning (see Exclusion Criteria below) and in the final analysis, this recommendation is not critical for Day 2.) The next trial on Day 3 should be counterbalanced between CS+ and CS-. Spontaneous recovery is measured by subtracting the SCR during the first CS+ trial during re-extinction from the last CS+ trial during extinction.\nAt the end of the session the subject is debriefed and paid $40 before departing.\n6. Pre-processing & Scoring SCR Data",
    "Analyze the data offline using AcqKnowledge software. Here, we set three parameters to be measured from our data chart: t (time), delta-t (latency), and p-p (peak-peak). These measurements record the time-point, latency and peak amplitude of the selected SCR. Begin a new journal graph to record your measurements. Pass waveforms through a low-pass filter in order to reduce high frequency data by selecting Transform→Digital filter→FIR→ Low pass (we use the default settings provided in the Acknowledge Software Guide's: cut off frequency = 25; 32 coefficients; filter entire wave). Smooth the data in order to reduce noise by selecting Transform→smoothing→ transform entire wave (we use the default settings provided in the Acknowledge Software Guide's: mean value smoothing; smoothing factor = 3 samples; filter entire wave; however, with higher sampling rates or increased noise, the smoothing factor can be increased).\nSelect a skin conductance response during each trial by taking the base to peak difference for the largest waveform (in microsiemens, μs) that begins within the 0.5 to 4.5 sec window following stimulus onset. The onset of the SCR must begin within this window to qualify as a stimulus-specific response, but may take longer to peak. SCRs may be recorded until they reach peak amplitude, however, responses that peak after 5 sec are not considered stimulus-specific and should be disregarded. This is precisely why reinforced trials should not be recorded: a SCR that is still peaking at the end of the trial may be tainted by the shock and produce subsequent increases in SCR that are not related to the CS itself.",
    "A response peak criterion of 0.02 μs should be utilized; responses below this criterion are typically regarded as noise and encoded as zero. After scoring, all unreinforced trials for each subject should be divided by that respective subject's mean US response. This is derived by taking the average SCR for all shock trials across the acquisition session and accounts for individual differences in subject's shock reactivity. Finally, all trials should be square root transformed to reduce skewness.\nTiming\nDay 1\nPreparation: 5-7 min\nAcquisition Script: ≈9 min\nTotal: 15 min\nDay 2\nPreparation: 5-7 min\nReactivation Script: ≈30 sec\nBreak: 10 min\nExtinction Script: ≈5.5 min\nTotal: 20 min\nDay 3\nPreparation: 5-7 min\nRe-Extinction Script: ≈6.5 min\nTotal: 15 min\n7. Representative Results for Each Group",
    "At the end of day 1 (acquisition), subjects should demonstrate differential SCR to the CSs, that is, higher responding to the CS+ as compare to the CS- (see Figure 4, acquisition, for an example from individual subjects). By the end of day 2 (reactivation/extinction), this differential response should diminish, such that there is no longer a difference between CS+ and CS- (see Figure 4, extinction, for an example from individual subjects). When examining spontaneous recovery on Day 3, we would expect to see a lack of fear recovery in the reactivation-10 min group since this group received extinction training within the reconsolidation window, thus allowing the original memory trace to reconsolidate with this new safety information, and preventing the recovery of fear responses (see Figure 4, top panel, for an example from an individual subject). We would expect to see substantial recovery of fear, however, for the CS+ (not CS-) in the reactivation-6 hr group that received extinction training outside of the reconsolidation window (see Figure 4, middle panel, for an example from an individual subject) as well as the no-reactivation group that received standard extinction training (see Figure 4, bottom panel, for an example from an individual subject).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893fig1.jpg\nFigure 1.  Example of SCR during electrode set up. Black, vertical arrows indicate the point at which subject was instructed to take a deep breath which resulted in a marked increase in SCR.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/3893/3893fig1large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893fig2.jpg\nFigure 2.  Example of SCR during shock work-up procedure. Black vertical arrows indicate point at which shock was administered. Grey arrows indicate the peak of skin conductance rise in response to the shock.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/3893/3893fig2large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893fig3.jpg",
    "Figure 3.  Example of conditioned response (CR) to the onset of the CS+ followed by a larger unconditioned response (UR) to the delivery of shock (US); subsequent trial is that of a CS-. Grey arrows indicate the CS onset and offset; black arrows indicate the delivery of US.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/3893/3893fig3large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893fig4.jpg\nFigure 4.  Example of acquisition, extinction and spontaneous recovery in an individual subject from each experimental condition (top panel: reactivation-10 min; middle panel: reactivation-6 hr; bottom panel: no reactivation).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893table1.jpg\nTable 1. Table of relevant products and equipment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893table2.jpg\nTable 2.  Reconsolidation protocol and timeline.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3893/3893table3.jpg\nTable 3.  An example of trial order for each phase of the experiment. Note one extra CS- should be added to Day 2.2 (extinction) in both reminder groups in order to account for the reactivation of the CS+. The first CS- trial on Day 3 (denoted with grey background) is disregarded due to the orienting response at the beginning of the session.\nExperimental Set up\nThe setup includes a PC running E-prime, a Mac running acknowledge, an MP100 Biopac system, and a shock box. In-line code is programmed into the E-prime script to communicate with the Acknowledge software and the shock box. This enables E-prime to send signals to Acknowledge denoting event onsets, and signals to the shock box to trigger shock administration. The output from E-prime is sent via a printer port to the Biopac system, which in turn sends the event signal to the Mac recording physiology with Acknowledge via a USB connection provided with the Biopac system, as well as to the shock box (see Table 1 for product information).\nExclusion Criteria\nSubjects should be excluded before completing all experimental sessions or from data analysis if they demonstrate any of the following:",
    "Failure to show detectable or reliable SCR - when applying and testing skin conductance response, subjects may demonstrate flat SCR. If this occurs, it is recommended to wait an additional 5 min as responses may not immediately emerge, or check for bubbles with in the conductance gel (in this case electrodes should be removed, cleaned and refilled). Subjects who have flat SCR response even after these troubleshooting strategies should be excused from the experiment.\nFailure to demonstrate acquisition of the fear response (on Day 1): differential SCR to the CS+ and CS- by the end of the acquisition session (mean of second half of the acquisition trials) that is in the wrong direction (i.e. CS- > CS+) or that is too small to conclude learning has occurred (i.e., difference is less than 0.1 μs).\nFailure to demonstrate extinction of the fear response (on Day 2): differential SCR to the CS+ and CS- by the end of the extinction session (on the last trial) that is larger than 0.1 μs.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}