{
  "id": 10142,
  "origin_website": "Jove",
  "title": "Inactivation of Pathogens via Visible-Light Photolysis of Riboflavin-5′-Phosphate",
  "procedures": [
    "1. Photolysis system setup\nMount six light-emitting diodes (LED) (DC 12 V) on the inside of an opaque plastic cup (8 cm x 7 cm) as shown in Figure 1 to establish a photolysis system31.\nAdd reactants (see below) into the glass test tubes (13 mm in diameter and 100 mm in height) and secure the tubes at the top of the cup as shown in Figure 1. Place the experimental setup in a room with a steady temperature of 25 ± 3 °C.\nMonitor and record the temperature of test units throughout the photolytic reactions by an infrared thermometer.\n\tNOTE: Figure 2 shows the emission spectra for blue, green, red, and violet lights, as recorded using a calibrated UV-Vis optical spectrometer. The wavelengths corresponding to the absorbance maximum for blue, green, red, and violet LED lights used in the study are 465, 529, 632, and 405 nm, respectively. The LED chips can heat the apparatus during irradiation experiments. The whole photoreaction system in each experiment was, therefore, placed in a room where the temperature was kept constant at 25 ± 3 °C.\n2. The effect of light wavelength on the photolysis of FMN (Figure 3)\nPrepare a 0.1 mM FMN solution in 100 mM potassium phosphate buffer (PB) (pH 7.8). Expose FMN samples (3 mL each) to blue, green, red, or violet light at an intensity of 10 W/m2 for 5 min. Keep 3 mL of FMN solution in dark as a control.\nRecord the absorbance of irradiated FMN samples in the 250-750 nm range using a UV/Visible spectrophotometer.\n3. Nitro blue tetrazolium (NBT) reduction method to detect imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg (Figure 4).",
    "NOTE: The NBT reduction method used here was slightly modified from the assay for riboflavin photoreaction. The NBT reduction method is used to evaluate the level of imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg generated from FMN photolysis. The photochemically excited FMN is first reduced by L-methionine into a semiquinone, which then donates an electron to oxygen giving rise to imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg31. The as-generated imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg reduces NBT to formazan, which has a characteristic absorbance at 560 nm32.\nAdd 109.3 mg of L-methionine to 73.3 mL of PB (100 mM; pH 7.8). Vortex the solution to dissolve the L-methionine.\nAfter the L-methionine is fully dissolved, add 10 mg of NBT powder and 1.53 mL of 0.117 mM FMN to the solution. For each 1 mL of the reaction solution (i.e., a mixture of FMN, L-methionine, and NBT) applied, the final concentrations of FMN, methionine, and NBT are 2.4 x 10-6 M, 1.0 x 10-2 M, and 1.6 x 10-4 M, respectively.\nExpose the reaction solution (1 mL) to blue or violet LED light irradiation at 10 W/m2 for 1-5 min.\nDetect the imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg species (from the absorbance at 560 nm) produced by the photochemical reaction, which reduces NBT and produces formazan.\n4. S. aureus viability after FMN photolysis (Figure 5)\nTransmit a colony of S. aureus(BCRC 10451) from a cultured plate into 10 mL of Lysogeny broth taken in a 15 mL screw-capped test tube. Culture in a shaker at 37 °C for 16 h.\nTransfer 0.5 mL of the culture to a 1.5 mL centrifuge tube. Add sterilized water into the centrifuge tube to dilute the culture to an optical density of 0.5 at 600 nm (OD600) (~6 x 107 CFU/mL).",
    "Transfer 0.5 mL of the culture to a 1.5 mL centrifuge tube, centrifuge at 14,000 x g for 10 min and decant the supernatant to obtain a cell pellet.\nAdd 1 mL of FMN-buffered solution (30, 60, and 120 µM FMN in PB) to the cell pellets obtained as in step 4.3, and vortex. For irradiated control, add 1 mL of PB alone.\nTransfer 1 mL each of viable bacterial cell solutions containing 30 µM FMN and PB alone into glass tubes, and irradiate them with violet light at 10 W/m2 for 30 min.\nTransfer 1 mL each of viable bacterial cell solutions containing 30, 60, and 120 µM FMN and PB alone into glass tubes and irradiate them with blue light at 20 W/m2 for 120 min. Set up another glass tube with 1 mL of viable bacterial cell solution containing 120 µM FMN and irradiate it with blue light at 20 W/m2 for 60 min.\nSet up test tubes as described in steps 4.5 and 4.6 and cover them with thick aluminum foils. These tubes serve as dark controls.\nKeep the irradiation chamber (as well as the dark controls) in a cold room at 9 ± 1 °C during the 30-120 min irradiation period.\n\tNOTE: Heat released by LED lights cannot be ignored as the LED chips placed inside the cup can heat the photoreaction system during irradiation experiments. The experiments were, therefore, conducted in a cold room maintained at 9 ± 1 °C.\nAfter irradiation, transfer 0.2 mL from each of the reaction solutions onto a Luria agar (LA) plate. Spread the bacteria over the plate by an L-shaped glass rod and incubate overnight at 37 °C.\nCalculate the viable plate count and the inactivation rates of S. aureus after overnight growth.",
    "NOTE: The inactivation rate of S. aureus is calculated as the percentage reduction, which is equal to [1 -I / D] ×100%, where I and D denote, respectively, the number of CFUs in the irradiated sample and dark control. The percentage reduction is defined as a negative value of the inactivation rate.\n5. Detection of imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg in S. aureus (Figure 6)\nPrepare the S. aureus samples as described in step 4.\nDilute the bacterial density of the samples with sterilized water to an optical density of 0.5 at 600 nm (OD600, ~6 x 106 CFU/mL). Transfer 0.5 mL of the culture to a 1.5 mL centrifuge tube. Centrifuge at 14,000 x g for 10 min and decant the supernatant to obtain a cell pellet.\nAdd 0.1093 g of L-methionine, 0.1 g of NBT, and 25 mL of FMN (400, 240, or 120 µM) to 75 mL of PB. For each 1 mL of the reactant applied, the final concentrations of FMN, methionine, and NBT are 100 (60 or 30) x 10-6 M, 7.3 x 10-3 M, and 1.2 x 10-3 M, respectively.\nAdd 1 mL of each reactant solution (i.e., with varying FMN concentrations) to the cell pellets obtained as in step 5.2. Irradiate the solutions by violet light at 10 W/m2 for 10 min.\nCentrifuge the mixture at 14,000 x g for 10 min and decant the supernatant. Resuspend the pellet in 1 mL of dimethyl sulfoxide (DMSO) to extract the reduced NBT. Detect the produced imgsrc://cloudfront.jove.com/files/ftp_upload/63531/63531eq01.jpg species from the absorbance at 560 nm.\n6. Statistical analysis\nExpress data as mean ± standard deviation (SD) of three independent tests.\nApply a homoscedastic two-sample t-test to evaluate whether two measurements are different. p-values < 0.05 are considered statistically significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}