{
  "id": 1669,
  "origin_website": "Cell",
  "title": "A simple protocol to produce mature human-induced pluripotent stem cell-derived cardiomyocytes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of 50× fatty acid solution and 50× galactose solution\nTiming: 2 h\nThis procedure will describe how to prepare stocks of BSA-conjugated fatty acids and galactose solutions for later preparation of maturation medium. It is essential that fatty acids are conjugated to BSA prior to their use in maturation medium, as otherwise fatty acids will form insoluble droplets or globules which cells will largely be unable to absorb. See Table 1[href=https://www.wicell.org#tbl1] for the recipe for the recipe for 50X galactose solution, and Table 2[href=https://www.wicell.org#tbl2] for the recipe for 50X fatty acid solution.\nPrepare fatty acid stocks:\nPrepare a 250 mM palmitic acid solution by dissolving palmitic acid crystals in 100% ethanol, and vortexing until completely dissolved.\nPrepare a 500 mM oleic acid solution by diluting oleic acid (oleic acid is liquid at room temperature: (∼22°C) in 100% ethanol.\nFatty acid stocks can be stored, paraffin wrapped, at -20°C for up to three months.\nPrepare 10% BSA solution:\nIn a 50 mL conical tube, weigh out 1–4 g of Fatty Acid Free BSA Fraction V (depending on the final volume of 50× solution desired).\nNote: this can be scaled up to produce a larger volume of fatty acid solution, but we do not recommend creating more than 40mL of solution in a single 50 mL conical tube due to BSA frothing that may occur.\nIn the sterile hood, add glucose-free RPMI to create a 10% BSA solution: for example 10 mL RPMI to 1 g BSA, 20 mL to 2 g, etc.\nVigorously vortex solution until BSA is completely dissolved (Figure 1[href=https://www.wicell.org#fig1]A). This may require several minutes.\nHeat solution to 37°C in water bath for 15 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1130-Fig1.jpg\nFigure 1. Conjugation of fatty acids with BSA",
    "(A) Image of 10% fatty-acid free BSA/glucose-free RPMI solution, with BSA completely dissolved.\n(B) Image of 10% BSA solution immediately after addition of oleic acid (palmitic acid has already been added and conjugated). Note that the mixture has become cloudy, indicating fatty acid precipitation.\n(C) Image of the same fatty acid solution after 30 min incubation at 37°C. The solution has cleared, indicating that both palmitic and oleic acid have successfully conjugated to BSA. This solution is ready to be used for preparation of maturation medium (or aliquoted and frozen).\nAdd palmitic acid to BSA:\nAdd 250 mM palmitic acid solution at a 1:100 dilution, such that the final concentration will be 2.5 mM.\nNote: Add palmitic acid slowly while agitating solution, as this may reduce aggregation and precipitation of palmitic acid .\nVortex solution vigorously. It is likely that solution will appear somewhat cloudy with fine particles at this point.\nIncubate solution for 30 min at 37°C, occasionally vortexing. Solution should shift from cloudy to clear during this process.\nAdd oleic acid solution:\nAdd 500 mM oleic acid at a 1:100 dilution and vigorously vortex such that the final concentration will be 5 mM. Once again, solution will become somewhat turgid (Figure 1[href=https://www.wicell.org#fig1]B).\nIncubate solution for 30 min at 37°C, occasionally vortexing. Solution should again clear up during this process, as fatty acids conjugate onto BSA (Figure 1[href=https://www.wicell.org#fig1]C).\nAt this point, the 50× fatty acid solution is ready to use.\nPrepare 50× galactose solution:\nWeigh out galactose, and resuspend in glucose-free RPMI to a concentration of 500 mM (for example, resuspend 4.51 g galactose in 50 mL RPMI).\nVortex solution vigorously, until galactose is totally dissolved.",
    "Pause point: At this point, both 50× galactose and 50× fatty acid solutions are ready to be used, and may be stored at −20°C for up to three months.\nAlternatives: Using Goldbio BSA Fraction V with palmitic and oleic acid, we have always had success conjugating fatty acids to BSA at 37°C. However, if using a different source of BSA, different concentrations or different types of fatty acids, it is possible that a more rigorous conjugation protocol may required. Although this protocol describes specifically conjugating oleic and palamitic acid to BSA for maturation medium, other fatty acids can be used as well – for example, we have also successfully conjugated linoleic acid to BSA. However, depending on the particular fatty acids used, the protocol may need to be modified, in terms of incubation times, temperatures, etc.\nPreparation of maturation medium\nTiming: 30 min\nSee Table 3[href=https://www.wicell.org#tbl3] for a complete recipe for maturation medium. Thaw out aliquots of 50× galactose solution, 50× fatty acid solution, and B-27™ supplement to room temperature (∼22°C).\nWorking in a sterile hood, add galactose solution, fatty acid solution, and B-27™ supplement to glucose-free RPMI medium, each to a 1:50 dilution.\nFor example, if creating 250 mL maturation medium, add 5 mL 50× galactose solution, 5 mL 50× fatty acid solution, and 5 mL 50× B-27™ supplement each to 235 mL RPMI. This will produce a final concentration of 10 mM galactose, 50 μM palmitic acid, and 100 μM oleic acid.\nMix solution via repeated pipetting or via use of a stir bar until it is completely homogenized.\nFilter medium using a 0.22 μm filter, into a sterilized/autoclaved container.",
    "Maturation medium preparation is now complete. Medium will be good for 2–3 weeks if stored at 4°C. Medium may also be aliquoted into smaller vessels (under sterile conditions) to avoid repeated warming/chilling cycles.\nCritical: As fatty acid and galactose solutions are not prepared under fully sterile conditions, it is absolutely essential to filter maturation medium prior to storage or use.\nPrepare patterned coverslips\nTiming: 90 min on day 1; overnight incubation; 2 h on day 2\nThis protocol describes the process of preparing and sterilizing micropatterned coverslips for plating of hiPSC-CMs. This entire process is also documented in Methods video S1[href=https://www.wicell.org#mmc1] of the supplement.\nCut 20 micron lapping paper into ∼2 cm squares.\nHolding coverslip firmly, draw lapping paper square along half of coverslip 15–20 times. Move lapping paper unidirectionally, in as straight of a line as possible to ensure linear patterning (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1130-Fig2.jpg\nFigure 2. Process of patterning+ sterilizing coverslip\n(A) Lapping paper being drawn across coverslip to create micropatterns. This is repeated 15–20 times.\n(B) Closeup image of a patterned coverslip.\n(C) Photograph of coverslips being sonicated in soapy water to clean.\n(D) Image of patterned coverslip in a well of a 6 well plate after ethanol evaporation and UV treatment. This coverslip is sterilized and ready for fibronectin coating.\n(E) Image of patterned coverslip under the microscope.\nRepeat this process on the other half of the coverslip.\nTo help ensure linear patterning, it may be useful to use a ruler or straight piece of tape to coordinate coverslip.",
    "After patterning the coverslip, it may also be useful to bend up one corner of coverslip to indicate which side has patterning and allow for later manipulation (Figure 2[href=https://www.wicell.org#fig2]B). Alternatively, one may consider making a small mark or scratch (such as an X) on the unpatterned side of the coverslip, again to make it easier to identify. This will help prevent mistakenly plating cells on the unpatterned side of the coverslip.\nPlace coverslips in a 50 mL conical tube, and wash twice, with vigorous vortexing, using distilled water. Take care when decanting water between washes to avoid losing coverslips (it may be useful to use mesh or a strainer when decanting water).\nIncubate coverslips with soapy water. Sonicate them (we use 70% strength, 5 s pulse on, 10 s pulse off, for 3 min total), keeping conical tube on ice to prevent overheating (Figure 2[href=https://www.wicell.org#fig2]C).\nRinse coverslips repeatedly, with vigorous vortexing, with distilled water until soap is completely removed.\nIncubate coverslips overnight (for 12–18 h) in 100% ethanol on rocker.\nNote: The remaining steps are to be conducted in a sterile hood.\nWorking in a sterile hood, use forceps to place coverslips in proper size cell culture dishes (we use 6 well plates for full sized coverslips, 24 well plates for quarter sized coverslips) (Figures 2[href=https://www.wicell.org#fig2]D, 3[href=https://www.wicell.org#fig3]A, and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1130-Fig3.jpg\nFigure 3. Plating of hiPSC-CMs on patterned surfaces\n(A) Photograph of hiPSC-CMs being pipetted onto sterilized, fibronectin-coated patterned surfaces.\n(B) Photograph of patterned surfaces with cell solution for initial cell attachment (prior to filling wells with medium).\n(C) Microscope images of hiPSC-CMs progressively attaching to surfaces over the first 5 days post plating. In later pictures, cells are difficult to see as they elongate, but can be seen to contract (Methods video S2[href=https://www.wicell.org#mmc2]).",
    "Allow ethanol to evaporate from coverslip by leaving them uncovered in sterile hood (this usually takes about 15 min).\nIncubate coverslips (again, uncovered) under UV light from the sterile hood for 15 min. Coverslips should now be sterile. Make sure that each patterned surface, as well as the remainder of the cell culture containers they are in, are completely dry before proceeding to the next step (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: If one has concerns about whether coverslips have successfully been sterilized, incubate one of them, after sterilization, in antibiotic-free media, without cells, to confirm lack of growth of any microbes.\nPrepare fibronectin solution by diluting fibronectin stock in DPBS, to final concentration of 12 μg/mL. Carefully pipette an equal volume of fibronectin solution onto each patterned surface. The volume chosen should be sufficient to adequately cover the surface, typically about 500 μL per large patterned surface, or 100–125 μL per small patterned surface.\nIncubate coverslips with fibronectin solution at room temperature (∼22°C) for at least one hour.\nAspirate all fibronectin solution from coverslips and wash once with DPBS.\nPause point: Completely aspirate DPBS. If cell culture plates are wrapped in wrapping film, coverslips may now be stored at 4°C for up to one week. Prior to sterilization and fibronectin coating, patterned coverslips may also be stored for several months at 4°C in ultrapure water.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. A short video demonstrating the construction of patterned surfaces, related to steps 10–12\nPlate cardiomyocytes on patterned surfaces\nTiming: 2 h on day 1; subsequent cell culture can last for weeks to months as desired.\nThis protocol describes the process of plating hiPSC-CMs on patterned surfaces and long-term cell culture.\nWarm up replating and cell dissociation medium to 37°C:",
    "We have used the following medium types for hiPSC-CM replating:\nRPMI-20 + Y-2: RPMI medium mixed with 20% (v/v) fetal bovine serum, supplemented with 5 μM Y-27632 (a ROCK inhibitor).\nSTEMdiff™ Cardiomyocyte Support Medium (Stem Cell Technologies).\nFor cell dissociation, we use Accumax™ (Stem Cell Technologies).\nFibronectin-coated patterned surfaces in appropriate cell culture containers should also already be prepared and on hand.\nWe recommend replating hiPSC-CMs between day 35 and 45 post induction. Cells should be plated on sterile 0.1% gelatin-coated dishes and grown to a high degree of confluency prior to replating, as detailed earlier in this protocol.\nWash cells once with room temperature (∼22°C) DPBS.\nAdd Accumax™ or other dissociation medium to cells (typically 2.5 mL for a 10 cm dish, 0.5 mL for a 6WPW).\nIncubate cells at 37°C for 5–9 min.\nObserve cells during dissociation until cells begin to detach. You may agitate cell culture dishes and tap the bottom of the cell culture dish lightly to help promote cell detachment.\nOnce cells have detached, halt dissociation by adding an equal volume of cell replating medium (RPMI-20 + 5 μM Y-27632 or STEMdiff™ Cardiomyocyte Support Medium) to dissociated cell mixture.\nPipette medium up and down several times to help detach cells and create single cell suspension.\nCell detachment should be visually apparent but it may be helpful to confirm by observing cell culture dishes under a microscope.\nPipette cells into a 10 or 50 mL conical tube (depending on volume of cell solution). It may be beneficial to wash plates with additional medium to ensure all cells are transferred.\nCount cells using hematocytometer, and calculate cell concentration and total yield.",
    "Carefully aspirate medium from cell pellet, and resuspend in replating medium, to density of 500,000 to 1,000,000 cells/mL. Gently pipette cells up and down repeatedly to further homogenize cell suspension.\nCarefully add cell suspension onto patterned surfaces, dropwise. Try to slowly cover the entire surface with cell solution (Figure 3[href=https://www.wicell.org#fig3]A).\nFor large surfaces (6WP), add 300k–500 k cells/surface. For small (24WP) surfaces, add 30k–60 k cells per surface.\nThis plating density will generally yield a confluent hiPSC-CM monolayer. Lower densities may be preferable for microscopy of isolated cells.\nIf cell suspension added doesn’t adequately cover patterned surface, slowly add additional media across surface (again, dropwise) but do so very slowly to avoid causing cell solution to run off of surface.\nCritical: Do not add excess media to patterned coverslips, or cells and solution will run off of coverslip into well. Be extremely careful handling cell culture dishes containing coverslips. If this occurs, it may be possible to salvage the well by pipetting up excess solution, then using vacuum suction to ∗thoroughly∗ dry the area around the coverslip, then adding cell solution back onto coverslip. Plating cells at a high density reduces the volume of solution which must be added per coverslip, thus reducing the likelihood of runoff.\nAllow cell solution to sit on patterned surface for at least 30 min before adding additional medium, to allow hiPSC-CMs to attach to the coverslip (Figure 3[href=https://www.wicell.org#fig3]B).\nAfter this, bring medium volume up to typical amount using replating medium (aka 2 mL for 6WPW, 0.5 mL for 24WPW).\nOver the next several hours, cells should begin to elongate as they spread out along surface (Figure 3[href=https://www.wicell.org#fig3]C). As cells attach and elongate, they will become more difficult to see.",
    "When plated at a high density, hiPSC-CMs will generally form a monolayer exhibiting synchronous contraction along the direction of patterning (Methods video S2[href=https://www.wicell.org#mmc2]).\n48 h after replating cells, switch cells to maturation medium. Cells may be cultured in maturation medium indefinitely depending on desired cell age at time of experimentation.\nWhen changing medium, remove old medium via suction from an area of the cell culture well outside of the patterned surface to avoid scratching off cells. As with any cell culture, work quickly when changing medium to avoid drying out cells.\nWhen cells have been cultured for the desired duration, they may be fixed and stained (see below), harvested for RNA or protein studies, or other protocols in a similar fashion as hiPSC-CMs cultured via other approaches.\nWhen lysing cells, it will be necessary to use vigorous scraping to detach cells from surfaces.\nNote: We typically culture cells on patterned surfaces until day 55–75 post induction: this duration of culture is typically sufficient to produce elongated cardiomyocytes with relatively organized sarcomeres and low BNP expression. We have cultured cells up to day 120 post induction, but observed relatively few changes in terms of gene expression or myofibril mechanics compared to day 75 (unpublished observations).\n    Your browser does not support HTML5 video.\n  \nMethods video S2. A synchronously contracting hiPSC-CM monolayer, cultured on a patterned surface in maturation medium, related to steps 30 and 31\nFix and stain hiPSC-CMs plated on patterned surfaces for BNP\nTiming: 2 days: approximately 2 h of work on each day.\nThis protocol describes the process of fixing hiPSC-CMs and staining them for the hypertrophic marker BNP. Cells may then be stained for other markers and imaged. The protocol for staining for BNP is immunofluorescence-based and is adapted from a previous protocol (Carlson et al., 2013[href=https://www.wicell.org#bib3]).",
    "Prepare permeabilization buffer: 3% (w/v) milk and 0.1% (v/v) Triton-X 100 in DPBS. Use this solution within 5 days of preparation and store at 4°C. This step can be delayed if storing fixed cells before staining.\nFix cells:\nWash cells to be fixed once with DPBS.\nFix cells in 4% paraformaldehyde/PBS for 15 min at room temperature (∼22°C).\nNote: Although lab-prepared paraformaldehyde solution is acceptable for staining cells, we have had best results when using commercially available, electron microscopy-grade paraformaldehyde (see key resources table[href=https://www.wicell.org#key-resources-table]). For other stains, other fixatives may also be used, but methanol-acetone may change the color of (bleach) the plastic of the coverslips.\nWash cells once with DPBS.\nPause point: After fixing cells and removing paraformaldehyde solution, fixed cells may be immersed in DPBS and stored in wrapping film sealed containers at 4°C for 1–2 weeks.\nPermeabilize cells: incubate patterned surfaces (coverslips) with permeabilization buffer at room temperature (∼22°C) for 30 min.\nIncubate cells with primary antibody: dilute BNP antibody (in our case, Abcam ab13115, 1:200 dilution) in permeabilization buffer, and add over coverslips.\nIncubate coverslips with primary antibody solution overnight (12–18 h) at 4°C. We recommend performing this incubation in a wrapping film or Saran wrap-sealed container, to prevent evaporation and minimize volume of antibody solution required.\nThe following day: wash cells;\nWash coverslips 3 times with DPBS supplemented with 0.05% (v/v) Triton-X 100. Incubate cells at 5 min at room temperature (∼22°C).\nAdd secondary antibody solution, diluted in permeabilization buffer.\nWe typically use Alexa Fluor 488 secondary goat anti-mouse antibody, diluted 1:400, for BNP staining, but other antibody types should work as well.\nIncubate coverslips in secondary antibody solution at room temperature (∼22°C) for 1 h.\nWash cells:",
    "Wash coverslips 3 times with DPBS supplemented with 0.05% (v/v) Triton-X 100. Incubate cells at 5 min at room temperature (∼22°C).\nOptional: Counterstain cells for other markers as desired. While we have found that optimal BNP staining can be achieved using milk-based permeabilization buffer as indicated, most other markers, including sarcomeric proteins, stain well using more typical methods, such as blocking and antibody dilution solutions based on horse or goat serum in DPBS, or using DAKO reagents. These stains can be performed after staining for BNP, without any noticeable loss of BNP signal.\nStain nuclei and/or mount coverslips:\nNote: If using mounting medium containing DAPI, it is unnecessary to conduct nuclear staining.\nIf staining cells directly, dilute a nuclear dye such as DAPI or Hoescht 33342 1:5000 in DPBS, and incubate coverslips with this solution for 5 min at room temperature (∼22°C).\nWash cells twice with DPBS.\nMount coverslips: on a glass slide, place a small drop of mounting medium such as Vectashield® or Prolong™ Gold, and place coverslip with the patterned side facing down into mounting medium.\nNote: Gently press onto coverslip to remove any bubbles. Remove excess mounting reagent by vacuuming or pipetting.\nCritical: Make absolutely sure that the cell covered/patterned side of the surface is in mounting medium here (facing down) as otherwise cells will rapidly dry out and signal will be lost.\nSeal coverslip to slide using nail gloss. Cells are now ready to image.\nIf staining is successful, BNP is primarily observed to be localized proximal to cell nuclei. Please note that maturation medium suppresses BNP expression, so relatively few BNP positive cells will be observed at baseline, in the absence of hypertrophic agonists (Figure 4[href=https://www.wicell.org#fig4]C). Some degree of autofluorescence will likely be observed on patterned surfaces, especially in the green channel.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1130-Fig4.jpg",
    "Figure 4. Morphological changes induced in hiPSC-CMs with maturation-inducing culture\n(A) Cellmask™ Orange-stained (CMO) hiPSC-CMs cultured in standard glucose-based RPMI (GLUC), or in maturation medium on patterned surfaces (MPAT).\n(B) α-actinin staining in hiPSC-CMs. The patterned hiPSC-CMs demonstrate significant elongation, with a greater proportion of α-actinin localized perpendicular to the long axis of the cells.\n(C) BNP/pro-NT-BNP staining in hiPSC-CMs. Culture with maturation medium and on patterned surfaces suppresses BNP expression.\nIsolate myofibrils from hiPSC-CMs\nTiming: 1 h to isolate myofibrils, several additional hours if measuring myofibril mechanics. Extensive solution preparation required before beginning.\nNote: This protocol describes ONLY how to isolate myofibrils from hiPSC-CMs. These myofibrils can then be used for protein studies, or for measuring myofibril mechanics. The protocols and equipment needed to measure mechanics are quite sophisticated and specialized and therefore will not be described here – for further information on these techniques, please refer to Woulfe et al. (Woulfe et al., 2019[href=https://www.wicell.org#bib12]). For examples of isolated myofibrils from cells cultured in maturation medium and on patterned surfaces (MPAT) and an activation/relaxation trace from a myofibril, see Figure 5[href=https://www.wicell.org#fig5]. Preparing bath and myofibril lysis buffer takes some time. Prepare these before beginning this procedure.\nFor characterizing myofibril mechanics, we recommend using 2 full size (22 mm by 22 mm) patterned surfaces with a confluent layer of hiPSC-CMs (typically 350k–500 k cells per patterned surface) per experiment.\nPrepare myofibril lysis buffer as described in Tables 4[href=https://www.wicell.org#tbl4] and 5[href=https://www.wicell.org#tbl5]. Cool this buffer on ice.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1130-Fig5.jpg\nFigure 5. Myofibrils and a representative myofibril activation/relaxation trace",
    "(A and B) (A) Myofibrils isolated from hiPSC-CMs cultured under MPAT conditions, and mounted between glass microtools in relaxing solution. Different sizes of stretchers, the microtool on the left, may be used, as seen in (A and B). When Ca2+ is added to this solution, the myofibril will contract, pulling the force probe (the dark microtool) to the left. When Ca2+ is removed from solution, the myofibril will relax. By tracking the deflection of the force probe, which is displayed on the y-axis, an activation/relaxation trace as show in (B), can be prepared. This trace was also derived from a myofibril from an MPAT hiPSC-CM. From such a trace, speed of activation and relaxation, as well as force generated by the myofibril, can be calculated. Please note that significant equipment and protocols which are not covered by this manuscript will be needed to fully conduct myofibril mechanics experiments.\ntable:files/protocols_protocol_1130_4.csv\nTo prepare, mix the first 5 ingredients, pH solution to 6.8, add final two starred components (ATP and creatine), and pH solution to 7, and filter with 0.45 μm filter. Store at −20°C for up to 1 year.\ntable:files/protocols_protocol_1130_5.csv\nTo prepare, mix all ingredients immediately before use. Store once ice until used to lyse cells. Do not store long term. In steps 46–47, to wash myofibrils, use myofibril lysis buffer with all components except sucrose.\nWash hiPSC-CMs once with DPBS. Remove PBS using vacuum.\nAdd chilled myofibril lysis buffer to each patterned surface to be lysed.\nUsing a plastic scraper, lift cells from patterned surfaces. Vigorously scrape cells, passing scraper over patterned surface 20 or more times. Cells detaching from surface should be visible (lysis buffer will become increasingly cloudly).\nPipette cell lysate into 1.5 mL microfuge tube. Vortex solution vigorously.\nIncubate lysate on ice for 10 min, periodically vortexing.",
    "Centrifuge lysate at 1500 g for 5 min, at 4°C.\nAfter centrifugation, a small myofibril-rich pellet should be visible.\nRemove supernatant, and wash pellet with fresh myofibril bath with protease inhibitors (same as in step 42, but without sucrose; see Table 5[href=https://www.wicell.org#tbl5]).\nRepeat steps 45 and 46 twice more, to remove any residual sucrose.\nHomogenize lysate using a brief (∼5 s) pulse of a Tissue Tearor Homogenizer at 30–50% of maximum speed. Avoid introducing bubbles into solution. Under the microscope, elongated myofibrils should now be visible, along with cell debris. The lysate is now ready for use in mechanical studies.\nIf using myofibrils for protein studies, centrifuge solution at 1500 g for 15 min to pellet myofibrils. Remove relaxing solution, and resuspend myofibrils in isoelectric focusing buffer (IEF, see Table 6[href=https://www.wicell.org#tbl6]). Lysate may be frozen at −80°C until use.\ntable:files/protocols_protocol_1130_6.csv\nTo prepare, mix first four ingredients and filter with 0.45 μm filter. Aliquot and store for up to 1 year at −20°C. Immediately before use, thaw aliquot of solution, vortex to clear out crystals and add final four starred ingredients. Usually only a small volume (1 mL or less) of IEF will be used for a single experiment, so scale down these ingredients accordingly. Keep IEF with inhibitors on ice until use, but do not store long term."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Cell Culture",
    "Cell Biology",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}