{
  "id": 5165,
  "origin_website": "Bio",
  "title": "Purification and Identification of Novel Host-derived Factors for Influenza Virus Replication from Human Nuclear Extracts",
  "procedures": [
    "Large scale culture of HeLa S3 cells (see Note 2)Seed HeLa S3 cells on tissue culture dish(es) in MEM + 10% FBS medium. Incubate at 37 °C in 5% CO2 to grow until total cell number reaches to ≥ 1 x 107. Keep the density of adherent cells within 30-80% confluence. If necessary, passage all of the growing cells by increasing size and/or numbers of culture dish(es). Trypsinize the cells, resuspend in S-MEM + 5% calf serum (CS), and count the number of cells.Adjust the cell density to ~2 x 105 cells/ml by adding S-MEM + 5% CS.Place the cell suspension into a 500 ml-size spinner flask (sterilized), and incubate at 37 °C with gentle stirring by a magnetic stirrer (60-80 rotations/min).Monitor the cell growth by daily counting the number of cells, and add fresh medium (S-MEM + 5% CS) to maintain cells at 3-6 x 105 cells/ml. When the volume of cell culture reaches to 500 ml, transfer the culture to a large-scale spinner flask (8 L-size) and maintain incubation at 37 °C.When the cell culture reaches maximum volume (e.g., 8 L of 6 x 105 cells/ml; approximately 5 x 109 of total cells), proceed to the nuclear extracts preparation steps (see Note 3).Nuclear Extracts (NEs) preparation from HeLa S3 cells (see Note 4)Harvest the cultured HeLa S3 cells by centrifugation (at 1,500 x g, 4 °C for 10 min).Suspend the cell pellet in PBS, and collect by centrifugation.Suspend the cells in ~5 packed cell volumes (PCV) (i.e., pellet mass of the collected cells) of ice-cold buffer A, and store on ice for 10 min (see Note 5).Collect by centrifugation at 1,500 x g for 10 min at 4 °C.",
    "Suspend the cells in 2 PCV of the buffer A and allow cells to swell on ice for 10 min.Lyse the cells by 10-15 strokes of a Dounce homogenizer with “type B (tight)” pestle.Check for the cell lysis under a microscope (Figure 1). If the homogenization appears to be insufficient, homogenize additionally and check the lysis again.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160909/20160909020659_5930.jpgFigure 1. Microscopic view of the cell homogenate. Suspensions before and after homogenization (step B6) were observed at 200-fold magnification by phase-contrast microscopy. A. Cells suspended in PBS (step B2); B. Swollen cells in a hypotonic “buffer A” before homogenization (step B5); C. Homogenized cell suspension (step B6). Cytoplasmic debris and nuclei were observed.Centrifuge the homogenate at 3,300 x g for 10 min at 4 °C, and remove the supernatant. The supernatant removed at this step can be saved as “S-100” cytoplasmic extracts (Dignam et al., 1983), and utilized for other purpose (Matsumoto et al., 1993).Re-centrifuge the remaining pellet (i.e., nuclei) at 14,000 x g for 20 min at 4 °C and remove the residual supernatant completely.Suspend the cells in an equal volume of packed nuclei (i.e., equal to pellet mass of the collected nuclei) with ice-cold buffer C (see Recipes and Note 6) and homogenate by 10 strokes of a Dounce homogenizer with “type B (tight)” pestle to ensure complete suspension.Transfer the homogenate to a centrifuge tube and invert gently by rotating for 30 min at 4 °C.Centrifuge the homogenate at 25,000 x g for 10 min at 4 °C.Place the supernatant (NEs) in a dialysis membrane bag. The remaining pellet at this step can be frozen and stored at -80 °C, and utilized as a chromatin fraction (Simon and Felsenfeld, 1979; Schnitzler, 2001).Dialyze against ≥ 50 volumes of buffer D at 4 °C for 3 h.",
    "Change the buffer to fresh buffer D (≥ 50 volumes), and additionally dialyze at 4 °C for 3 h.Transfer the dialysate (white-turbid NEs) to a centrifuge tube and centrifuge for 20 min at 25,000 x g by benchtop centrifuge.Determine the protein concentration of NEs of the supernatant (see Note 7). Dispense aliquots into tubes (if desired), and freeze in liquid N2 and store at -80 °C until use (see Note 8).Fractionation and purification of NEs by successive column chromatographies (see Figure 2 and Note 9). Herein, the procedures of the column chromatography are desired to purify and identify two host-derived factors, pp32 and APRIL (as known as ANP32A and B, respectively), termed as “influenza virus replication factor (IREF)-2” which stimulates influenza virus RNA replication process (Sugiyama et al., 2015).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160909/20160909020953_6737.jpgFigure 2. Purification scheme of IREF-2 from NEs. Chromatographic behavior of IREF-2 appears to be highly acidic and hydrophilic.Stepwise fractionation on weak cation-exchanger columnPrepare phosphocellulose (PC) column, as follows:Suspend the powder of PC resin (Whatman® cation exchange cellulose, P11) by gentle swirling in ≥ 20 volumes of water and keep for 30~60 min.Pour off supernatant, resuspend the resin in water, and repeat at least 8-10 times to remove any unsettled fine.Suspend the resin in 0.2 M NaOH, allow to settle for 30 min.Pour off supernatant and repeat until pH of supernatant is above 10.Wash the resin with water until pH of supernatant is below 8.Suspend the resin in 0.2 M HCl, allow to settle.Pour off supernatant and repeat until pH of supernatant is below 3.Wash the resin with water until pH of supernatant is about 5.Equilibrate the resins in buffer HG. If the PC resin is to be stored for longer than a week, add 0.1% sodium azide and store at 4 °C (never freeze).",
    "Suspend the PC resin and pour carefully into the column housing [approximately, 10 ml (bed volume) of the PC resin is enough for 10~15 ml of input NEs] and allow to settle. Then, attach the flow-adaptor carefully above the bed.Set up the FPLC system and column, routinely as follows:Wash the system (including a “sample loop”) with pure degassed water.Connect the prepared PC column (10 ml bed volume) to the system without introducing air, and wash the system including the column with enough water. Ensure no leakage from the column during flow.Set degassed buffer HG as solvent A to inlet A and degassed buffer HGK as solvent B to inlet B, respectively.Wash the system with 100% solvent B (buffer HGK; 1 M KCl) and then equilibrate with 5% solvent B (i.e., 95% solvent A of buffer HG; 50 mM KCl).Ensure the valve position to be “load”, and load the NEs (approximately, 12.5 ml in this protocol) into the sample loop.Change the valve position to “inject”, and run the program to start stepwise fractionation on the PC column (10 ml bed volume), as follows:Isocratic flow (0.15 ml/min) with 45 ml (4 volumes of the input NEs) of 5% solvent B (i.e., 95% solvent A; final 0.05 M KCl), collect the eluate (2 ml/fraction; total 23 fractions).Change the valve position from “inject” to “load” to bypass the flow channel through the sample loop. If forget this, following salt-elution steps would be delayed by the volume of the sample loop.Isocratic flow (0.15 ml/min) with 40 ml (4 column volumes) of 20% solvent B (i.e., 80% solvent A; final 0.2 M KCl), collect the eluate (2 ml/fraction; total 20 fractions).Isocratic flow (0.15 ml/min) with 40 ml (4 column volumes) of 50% solvent B (i.e., 50% solvent A; final 0.",
    "5 M KCl), collect the eluate (2 ml/fraction; total 20 fractions).Isocratic flow (0.15 ml/min) with 40 ml (4 column volumes) of 100% solvent B (i.e., 0% solvent A; final 1 M KCl), collect the eluate (2 ml/fraction; total 20 fractions).Make small aliquot(s) of each fractionated sample to avoid unnecessary freezing/thawing cycle in future, and freeze in liquid N2 and store at -80 °C.Check the activity (i.e., stimulation activity for influenza virus RNA replication, termed as “IREF-2” in this protocol) involved in the PC-fractions by employing a cell-free viral RNA replication assay using small aliquot (see Figure 3 and Note 10).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160909/20160909021529_3707.jpgFigure 3. Profile of the fractions from phosphocellulose column chromatography for IREF-2. Each stepwise fraction of NE from the phosphocellulose (PC) column chromatography was individually added to the cell-free viral RNA replication reaction (1.75 μg of each fraction/reaction), as follows; unbound fraction (i.e., flow-through) eluted with 0.05 M KCl buffer (lane 1), materials eluted with buffer containing 0.2 M KCl (lane 2), 0.5 M KCl (lane 3) and 1 M KCl (lane 4), respectively. For the detail of the cell-free viral RNA replication assay, see Note 10 and the original article (Sugiyama et al., 2015). Robust viral RNA product was detected (upper panel, lane 1), suggesting that certain activity stimulating a viral RNA replication reaction, termed as IREF-2, was present in the flow-through fraction from the PC column chromatography. Each fraction was also subjected to 14% SDS-PAGE (1 μg of each fraction/lane), and polypeptides were visualized by silver staining (lower panel). The arrow indicates viral RNA replication products. The molecular weight (kDa) positions are denoted on the right side of the lower panel. MWM: molecular weight marker.",
    "Stepwise fractionation on a strong anion-exchanger columnSet up the FPLC system and pre-packed UNO Q1R column, routinelySet degassed buffer HG as solvent A to inlet A and degassed buffer HGK as solvent B to inlet B, respectively.Wash the column with 100% solvent B, and equilibrate with 5% solvent B (i.e., 95% solvent A).Thaw the IREF-2 activity-positive fraction (total 9 ml in this protocol) of the PC column chromatography (i.e., the unbound “flow-through” fraction, see Figure 3) and centrifuge at 20,000 x g for 5 min at 4 °C to remove insoluble material.Load the supernatant into the sample loop and change the valve position to “inject”. Run the program to start stepwise fractionation on the UNO-Q column (1.3 ml column volume) as follows:Isocratic flow (0.5 ml/min) with 18 ml (2 volumes of the input) of 5% solvent B (i.e., 95% solvent A; final 0.05 M KCl), collect the eluate (1 ml/fraction; total 18 fractions).Change the valve position from “inject” to “load”.Isocratic flow (0.5 ml/min) with 7.8 ml (6 column volumes) of 15% solvent B (i.e., 85% solvent A; final 0.15 M KCl), collect the eluate (1 ml/fraction; total 8 fractions).Isocratic flow (0.5 ml/min) with 7.8 ml (6 column volumes) of 30% solvent B (i.e., 70% solvent A; final 0.3 M KCl), collect the eluate (1 ml/fraction; total 8 fractions).Isocratic flow (0.5 ml/min) with 7.8 ml (6 column volumes) of 60% solvent B (i.e., 40% solvent A; final 0.6 M KCl), collect the eluate (1 ml/fraction; total 8 fractions).Isocratic flow (0.5 ml/min) with 7.8 ml (6 column volumes) of 100% solvent B (i.e., 0% solvent A; final 1 M KCl), collect the eluate (1 ml/fraction; total 8 fractions).Make small aliquot(s) of each stepwise-fractionated sample by the UNO-Q column, and freeze in liquid N2 and store at -80 °C.",
    "Check the IREF-2 activity present in each fraction (see Note 10).Gradient fractionation on a strong anion-exchanger columnSet up the FPLC system and the UNO Q1R column, routinelySet degassed buffer HG as “solvent A” to inlet A and degassed buffer HGK as “solvent B” to inlet B, respectively.Wash the column with 100% solvent B, and equilibrate with 25% solvent B (i.e., 75% solvent A).Thaw the IREF-2-active fractions of the stepwise fractionated sample on the UNO-Q column chromatography (= total 8 ml), the eluate with 0.6 M KCl [i.e., mixture of 60% of buffer HGK (as solvent B) and 40% of buffer HG (as solvent A)], and dilute with 1.5 volume of buffer HG to decrease the salt concentration in the sample (finally, 20 ml as an input volume). Centrifuge at 20,000 x g for 5 min at 4 °C to remove insoluble material. Load the supernatant into the sample loop and change the valve position to “inject”. Run the program for gradient fractionation on the UNO-Q column (1.3 ml column volume) as follows:Isocratic flow (0.5 ml/min) with 30 ml (~1.5 volumes of the input) of 25% solvent B (i.e., 75% solvent A; final 0.25 M KCl), collect the eluate (1.5 ml/fraction; total 20 fractions).Change the valve position from “inject” to “load”.Linear gradient flow (0.5 ml/min) ranging from 25% to 80% of solvent B with 15 ml, collect the eluate (0.5 ml/fraction; total 30 fractions).Make small aliquot(s) of each fractionated sample on the UNO-Q column chromatography, and freeze in liquid N2 and store at -80 °C.Check the IREF-2 activity present in each fraction (see Note 10).Gradient fractionation on a hydrophobic column chromatographyPrepare the FPLC system and pre-packed hydrophobic column, SOURCE 15PHE PE 4.",
    "6/100, routinelySet degassed buffer HG as solvent A to inlet A and degassed buffer HGN1M as solvent B to inlet B, respectively.Wash the column with 100% solvent A, and equilibrate with 100% solvent B.Thaw the IREF-2-active fractions of the gradient-fractionated sample by the UNO-Q column chromatography and combine them as an input sample (= total 3 ml), and mix an equal volume of ice-cold buffer HGN2M, gradually. Centrifuge at 20,000 x g for 5 min at 4 °C to remove insoluble material.Load the diluted supernatant (~6 ml) into the sample loop and change the valve position to “inject”. Run the program for gradient fractionation on the SOURCE 15PHE column (1.7 ml column volume) by reducing the concentration of (NH4)2SO4, as follows: Isocratic flow (0.3 ml/min) with 15 ml (~2.5 volumes of the input) of 100% solvent B [i.e., 0% solvent A, final 1 M (NH4)2SO4], collect the eluate (0.75 ml/fraction; total 20 fractions).Change the valve position from “inject” to “load”.Linear gradient flow (0.3 ml/min) ranging from 100% to 0% of solvent B (i.e., from 0% to 100% of solvent A) with 12 ml, collect the eluate (0.75 ml/fraction; total 16 fractions).Dialyze each fraction against 50 volumes of buffer HG for 5 h at 4 °C.Make small aliquot(s) of each fractionated and dialyzed sample by the hydrophobic column chromatography, and freeze in liquid N2 and store at -80 °C.Check the IREF-2 activity present in each fraction (see Note 10).Gradient fractionation on a strong cation-exchanger column chromatographySet up the FPLC system and pre-packed UNO S1 column, routinely.Set degassed buffer HG as solvent A to inlet A and degassed buffer HGK as solvent B to inlet B, respectively.Wash the column with 100% solvent B, and equilibrate with 3% solvent B (i.e., 97% solvent A).",
    "Thaw the IREF-2-active fraction of the hydrophobic column chromatography, (i.e., unbound “flow-through” fraction). Centrifuge at 20,000 x g for 5 min at 4 °C to remove insoluble material.Load the supernatant (approximately 5 ml) to the sample loop and change the valve position to “inject”. Run the program for gradient fractionation on the UNO-S column (1.3 ml column volume) as follows: Isocratic flow (0.4 ml/min) with 10 ml (2 volumes of the input) of 3% solvent B (i.e., 97% solvent A; final 0.03 M KCl), collect the eluate (0.65 ml/fraction; total 16 fractions).Change the valve position from “inject” to “load”.Linear gradient flow (0.5 ml/min) ranging from 3% to 100% of solvent B with 15.6 ml (12 column volumes), collect the eluate (0.65 ml/fraction; total 24 fractions).Make small aliquot(s) of each fractionated sample on the UNO-S column chromatography, and freeze in liquid N2 and store at -80 °C.Check the IREF-2 activity present in each fraction (see Note 10).Gradient fractionation on a strong anion-exchanger columnSet up the FPLC system and pre-packed Mono-Q column, routinely.Set degassed buffer HG as solvent A to inlet A and degassed buffer HGK as solvent B to inlet B, respectively.Wash the column with 100% solvent B, and equilibrate with 35% solvent B (i.e., 65% solvent A).Thaw the IREF-2-active fraction from the fractionated samples by the cation exchanger (UNO-S) column chromatography (i.e., unbound “flow-through” fraction). Centrifuge at 20,000 x g for 5 min at 4 °C to remove insoluble material.Load the supernatant (approximately 5 ml) to the sample loop and change the valve position to “inject”. Run the program for gradient fractionation on the Mono-Q column (1 ml column volume) as follows:Isocratic flow (0.5 ml/min) with 10 ml (2 volumes of the input) of 35% solvent B (i.e., 65% solvent A; final 0.",
    "35 M KCl), collect the eluate (1 ml/fraction; total 10 fractions).Change the valve position from “inject” to “load”.Linear gradient flow (0.4 ml/min) ranging from 35% to 70% with 12 ml, collect the eluate (0.4 ml/fraction; total 30 fractions).Make small aliquot(s) of each fraction from the Mono-Q column chromatography, and freeze in liquid N2 and store at -80 °C.Check the IREF-2 activity present in each fraction (see Note 10 and Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160911/20160911192432_5267.jpgFigure 4. Profile of the fractions from Mono-Q column chromatography for IREF-2. Each Mono-Q fraction (fraction numbers 1-11) or input material for the Mono-Q column chromatography (i.e., unbound fraction of the UNO-S column chromatography at procedure C, 5) was individually added to the cell-free viral RNA synthesis reaction (upper panel). Each fraction was also subjected to 11.5% SDS-PAGE, and polypeptides were visualized by silver staining (lower panel). The arrow indicates viral RNA replication products. By comparing carefully between the IREF-2 activity level and the elution pattern of each peptide, two peptides (arrowheads A and B) migrated at 31 and 30 kDa are expected to be candidates for the IREF-2 activity. The molecular weight (kDa) positions are denoted on the left side of the panel. MWM: molecular weight marker.Fractionation on a gel filtration column (see Note 11)Set up the SMART system and gel filtration column, routinely.Set degassed buffer HG as solvent A to inlet A and degassed buffer HGK as solvent B to inlet B, respectively.Wash the column with 100% solvent B, and equilibrate with 20% solvent B (i.e., 80% solvent A).Thaw the IREF-2-active fraction number 8 of the anion exchanger column chromatography (see Figure 4). Centrifuge at 20,000 x g for 5 min at 4 °C to remove insoluble material.",
    "Load a small part of the supernatant (approximately 40 μl) into the sample loop and change the valve position to “inject”. Run the program for fractionation on the Superdex 75 gel filtration column (2.4 ml column volume) as follows: Isocratic flow (50 μl/min) with 2.4 ml (1 column volume) of 20% solvent B (i.e., 80% solvent A; final 0.2 M KCl).At 0.78 ml of the total flow, start collecting the eluate from the gel filtration column (30 μl/fraction).Make small aliquot(s) of each fraction on the gel filtration column chromatography, and freeze in liquid N2 and store at -80 °C.Check the IREF-2 activity present in each fraction (see Note 10 and Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160911/20160911192710_2118.jpgFigure 5. Profile of the fractions from gel filtration chromatography for IREF-2. Each gel-filtrated fraction (fraction numbers 1-23) or input material for the gel-filtration chromatography (i.e., the fraction number 8 of the Mono-Q column chromatography in step C6) was individually added to the cell-free viral RNA synthesis reaction (upper panel). Each fraction was also subjected to 11.5% SDS-PAGE, and polypeptides were visualized by silver staining (lower panel). The arrow indicates viral RNA replication products. The arrowheads indicate two candidate peptides responsible for the IREF-2 activity. The molecular weight (kDa) positions are denoted on the left side of the panel. MWM: molecular weight marker.Identification of two polypeptides responsible for IREF-2 activity by mass spectrometrySubject two Mono-Q fractions involving two candidate peptides, the fraction number 6 enriched with the peptide A and the fraction number 9 enriched with the peptide B (see Figure 4), to 11.5% SDS-PAGE.Visualize the peptides separated in the gel by using a glutaraldehyde-free silver staining kit (for MS analysis).Excise the gel pieces containing the bands of the peptide A and B, respectively (by using a clean razor blade).",
    "Tryptic digestion in the gel pieces, followed by mass analysis (MALDI-TOF MASS)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}