{
  "id": 16076,
  "origin_website": "Jove",
  "title": "Analysis of Lipid Signaling in Drosophila Photoreceptors using Mass Spectrometry",
  "procedures": [
    "1. Rearing flies and preparation of chemicals\nRear flies (Drosophila melanogaster) on standard fly food in an incubator with 50% relative humidity at 25 °C without internal illumination. Prepare fly food by adding 80 g/L of corn flour, 20 g/L of D-glucose, 40 g/L of sucrose, 8 g/L of agar, 15 g/L of yeast extract, 4 mL of propionic acid, 0.7 g/L of TEGO (methyl para hydroxybenzoate), and 0.6 mL of orthophosphoric acid as described in34 and are also available at https://bangalorefly.ncbs.res.in/drosophila-media-preparation. Grow one set of flies, post-eclosions, in a cooled incubator maintained at 25 °C with continuous white light illumination of ~2,000 lux.\nPrepare phosphoinositide elution buffer (PEB) by adding chloroform:methanol:2.4 M hydrochloric acid in a ratio of 250:500:200 (vol/vol/vol). Prepare lower phase wash buffer (LPWS) by adding methanol:1 M hydrochloric acid:chloroform in a ratio of 235:245:15 (vol/vol/vol). Prepare post-derivatization wash solution by adding chloroform:methanol:water in an 8:4:3 (vol/vol/vol) ratio.\n\tNOTE: Use MS grade solvents and chemicals. Do not store the PEB and LPWS buffer for more than 3 months.\nUse the C4 (1.7 µm x 1 mm x 100 mm) column for the phosphoinositides, PI4P and PI(4,5)P2 and the C18 column (1.0 mm x 100 mm x 1.7 mm) for PA, phosphatidylcholine (PC), and phosphatidylinositol (PI). For NPLC-MRM-EPI method, use the silica column (1 mm x 150 mm x 3 µm).\nPrepare eluent A by adding hexane:isopropyl alcohol:100 mM aqueous ammonium acetate in a 68:30:2 (vol/vol/vol) ratio and eluent B by adding hexane:isopropyl alcohol:100 mM aqueous ammonium acetate in 70:20:10 (vol/vol/vol) ratio for PA, PC, and PI. Prepare solvent A for phosphoinositides by adding 0.1% formic acid in water and solvent B by adding 0.1% formic acid in acetonitrile.\n2. Isolation of tissue",
    "Collect 10 flies per sample using carbon dioxide (CO2) anesthesia (flies immobilize within seconds) and decapitate the flies using a sharp blade on a CO2 anesthetizing plate.\nCollect dark or light adapted flies of defined age (12-24 h old) in 1.5 mL tubes and snap-freeze in liquid nitrogen. Dehydrate the flies in acetone at -80 °C for 48 h in a glass vial35. For retinal tissue, collect 100 retinae from freeze dried flies. Using a scalpel, remove the eyes from the rest of the head and scoop out the retinae.\nFor phosphoinositides PI4P and PI(4,5)P2 analysis, when working with fresh retinae, use 25 retinae per sample from flies grown under conditions of appropriate illumination for measuring lipid levels during illumination and from flies grown without light for measuring lipid levels in dark. Store in 50 µL of 1x PBS in homogenizer tubes on dry ice until ready for extraction.\n3. Lipid extraction\nCAUTION: Chloroform is a toxic solvent and is carcinogenic in nature. It affects the reproductive system and is a skin and eye irritant. Precaution should be taken in handling this chemical. All the steps involving chloroform should be performed in a well ventilated chemical hood.\nFor all glycerophospholipids other than PI4P and PI(4,5)P2\nFor each sample, homogenize 10 fly heads or 100 retinae (collected as described in step 2.2) in 0.1 mL of 0.1 N ice-cold methanolic HCl and 30 µL of internal standard mixture (PA (17:0/14:1), PC (17:0/14:1), lysophosphatidic acid (LPA; 13:0), lysophosphatidylcholine (LPC; 13:0), LPC (17:1), PA (17:0/17:0), PA (16:0-D31/18:1), LPA (17:1), LPC (19:0), PI (12:0/13:0), PA (12:0/13:0), and PC (12:0/13:0)). Prepare standards such that the final amount of any lipid standard falls within the linear response curve of the mass spectrometer.",
    "Homogenize tissues using an automated homogenizer that allows rapid and simultaneous treatment of all the samples. Briefly spin tubes in a tabletop centrifuge and ensure no pellet is formed-this indicates complete homogenization. Transfer the methanolic homogenate into a 2 mL capped microcentrifuge tube.\nAdd 0.2 mL of ice-cold 0.1 N methanolic HCl for recovering any residual material in the tube and combine in the 2 mL tube. Add 0.1 mL of 0.1 N ice-cold methanolic HCl followed by 0.8 mL of chloroform and mix thoroughly. Allow the mixture, containing tissue homogenate, to stand on ice for 10 min, and then add 0.4 mL of 0.88% KCl and vortex for 30 s.\nCentrifuge the mixture at 1,000 x g for 10 min at 4 °C to separate the aqueous and organic phases. Take out the lower organic phase containing lipids very carefully without mixing with the aqueous phase and transfer into a fresh 2 mL microcentrifuge tube.\n\t\tNOTE: During lipid extraction, transfer the lower organic phase with utmost care to avoid mixing with aqueous phase, which may hamper downstream lipid analysis.\nDry this lipid solution in a vacuum evaporator at 4 °C, visually inspect the sample to ensure complete drying. Resuspend in 420 µL of 2:1 methanol:chloroform mixture for analysis. Analyze the samples immediately without storage.\nFor phosphoinositides PI4P and PI(4,5)P2\nHomogenize 25 retinae in 950 µL of phosphoinositide elution buffer (PEB; 250 mL of CHCl3, 500 mL of methanol and 200 mL of 2.4 M HCl) and add internal standards (phosphatidylethanolamine (PE) 17:0/14:1; PI (17:0/14:1); PI4P (17:0/20:4); and PI(4,5)P2 (16:0/16:0)) mixture containing 50 ng of PI, 25 ng of PI4P, 50 ng of PI(4,5)P2, and 0.2 ng of PE per sample.",
    "Add 250 µL each of chloroform and 2.4 M HCl, followed by sonication for 2 min and centrifugation at 1,000 x g for 5 min at 4 °C for phase separation. Take out the lower organic phase into a fresh tube, wash with 900 µL of LPWS and centrifuge at 1,000 x g for 5 min at 4 °C.\nExtract lipids from the remaining aqueous phase by once again performing a phase separation as in step 3.2.2. Dry the collected organic phases in a vacuum centrifuge set at 4 °C, visually inspect the samples to ensure complete drying.\n4. Organic phosphate assay\nMake a stock solution of 7.34 mM KH2PO4. Make the standard dilutions, using distilled water, in microcentrifuge tubes as per Table 1. Lightly vortex the tubes and transfer the standard dilutions to phosphate-free glass tubes.\nPrepare a separate set of glass tubes containing the lipid samples. Optimize the volume of lipid samples such that the absorbance at 630 nm (after completion of this protocol) falls within the range of standard KH2PO4 (which is 0 to 20x).\nHeat the glass tubes containing standard dilutions at 120 °C to complete dryness. Heat the glass tubes containing the lipid samples (take 1/8th of total sample volume required to have absorbance within the range of standard KH2PO4) at 90 °C to complete dryness.\nAdd 50 μL of 70% perchloric acid to all the tubes and heat at 180 °C for 30 min. Cool the tubes to room temperature. Add 250 μL of water, 50 μL of 2.5% ammonium molybdate and 50 μL of 10% ascorbic acid to each tube.\n\tNOTE: 2.5% ammonium molybdate and 10% ascorbic acid are weight/vol concentrations. They need to be freshly made and can be stored at 4 °C for up to 1 week.",
    "Keep the tubes in a shaking incubator at 37 °C for 1 h. Aliquot 130 μL of sample into a 96-well plate and measure the absorbance at 630 nm using a spectrophotometer.\n5. Derivatization\nCAUTION: Trimethylsilyldiazomethane (TMSD) is reported to have many toxicological effects in humans. TMSD in solution targets kidney, liver, gastrointestinal tract, skeletal muscles, central nervous system, and respiratory and reproductive systems. Extreme precaution should be taken while handling this chemical. The entire process should be performed in a well ventilated chemical hood.\nTo the lower organic phase of the samples obtained from the end of step 3.2.3., add 50 µL of 2 M TMSD. Allow the reaction to proceed at room temperature for 10 min with constant shaking at 250 rpm. After 10 min, add 10 µL of glacial acetic acid to quench the reaction, indicated by the disappearance of yellow color in the solution.\nTap the tubes and cautiously open them to remove the N2 formed in the quenching reaction. After N2 gas has escaped, close the tubes and spin them down. Then, add 600 µL of post-derivatization wash solution and vortex for 2 min in a mixer at 250 rpm.\nDiscard ~400 µL from the upper phase that will form. Repeat step 5.2. Discard the entire upper phase and add 50 µL of 90% methanol to the lower phase and mix it.\nDry the samples for 2 h in a centrifugal concentrator at 800 x g operating in vacuum. After drying, the tubes should contain ~20 µL of the remaining sample. Add 180 µL of 100% methanol, mix it well, and store at 4 °C for up to 2-3 days prior to LC-MS/MS.\n6. Data acquisition and analysis\nData acquisition in direct infusion MS (DIMS)",
    "NOTE: MS can be done by either direct infusion or liquid chromatography MS (LC-MS) method. In this section, we describe direct infusion-based MS.\n\t\nBefore starting the experiment, calibrate the mass spectrometer as per the manufacturer's instructions.\nGenerate a linear response curve for the dilution series of synthetic standards and based on the linear response of the instrument, dilute the sample so that the intensity of the lipid analyte falls within the linearity of the instrument. Dilute total lipid extracts or lipid standards with a mixture of 2:1 methanol:chloroform (vol/vol). Select dilution of the total lipid extracts and the synthetic standards individually for each experiment.\nTransfer the extracts and standards to individual vials. Avoid air bubbles during the transfer of samples into sample vials of MS. Air bubbles will create high pressure in the column and hamper the lipid analysis.\nPrior to the analysis, centrifuge the samples for 9 min at 6,440 x g and load into a 96-well plate and seal with aluminum foil.\nPerform MS analyses on a high-resolution mass spectrometer using direct infusion method. Achieve stable ESI-based ionization of glycerophospholipids using a robotic nanoflow ion source using chips with spraying nozzles of diameter 4.1 µm.\nControl the ion source using a custom mass spectrometer software and set ionization voltages at +1.2 kV and -1 kV in positive and negative modes, respectively; back pressure at 1 psi in both modes; and temperature of ion transfer capillary at 180 °C. Perform acquisition at mass resolution, Rm/z400 = 100,000. See Figure 2A for the software interface to set up mass spectrometer parameters.",
    "Re-dissolve dried total lipid extracts in 400 µL of chloroform:methanol (1:2). For the analysis, load 60 µL of samples onto a 96-well plate ion source and seal with aluminum foil. Analyze each sample for 20 min in positive ion mode to detect PC, phosphatidylserine (PS), phosphatidylethanolamine (PE), PE-O (ether linked phosphatidylethanolamine), ceramide (Cer), and ceramide phosphate (Cer-P).\nPerform an independent acquisition in negative ion mode for 20 min where PA and PI was detected. See Figure 2B for specific details of instrument setup for data acquisition for high resolution MS and a targeted list of PA species that has been included in data dependent acquisition (DDA) set up.\n\t\tNOTE: The software interface for setting up of DDA method is shown in Figure 2C. The list of PA molecules targeted in this approach is listed in Table 2. A screenshot of the experimental outcome in DDA approach is shown in Figure 2D.\nData analysis in direct infusion MS (DIMS)\n\tNOTE: The analysis of mass data generated by all types of mass spectrometers requires an automated lipid analysis platform. LipidXplorer36 is a non-commercial software that supports all types of DIMS lipid experiments. This software can be found here: https://www.mpi-cbg.de/research-groups/current-groups/andrej-shevchenko/projects/lipidxplorer/\n\t\nOnce the data has been acquired using the methods described in step 6.1, identify lipid species using a lipid analysis platform by matching m/z of their monoisotopic peaks to the corresponding elemental composition constraints. The data import example is shown in Figure 3A. Set mass tolerance to 10 ppm and intensity threshold according to the noise level reported by the mass spectrometer software.\nAfter importing, compile molecular fragmentation query language (MFQL) queries for PA based on the chemical structure of PA, which is shown in Figure 3B. See Figure 3C for the MFQL set up in the lipid analysis platform.",
    "Using a similar approach, compile MFQL for other glycerophospholipids in the lipid analysis platform software. Each query targets one lipid class and many queries can be used in a single execution.\nRun all the MFQLs by clicking on the Run button. All the identified lipid species are reported in a single results file in .csv file format with the abundances of corresponding precursor and/or fragment ions for the subsequent quantification of lipids. An example of the output is given in Table 3.\n7. Liquid chromatography and tandem MS of derivatized samples\nSeparate the samples obtained from step 5.4 by liquid chromatography using an ultra-performance liquid chromatography system. While choosing this system, ensure that its software can integrate with that of the mass spectrometer used for the analysis.\nConnect the system to a triple quadrupole mass spectrometer. Choose a separation column. For the separation of lipids other than PI4P and PI(4,5)P2 choose a C18 column (1.0 mm x 100 mm x 1.7 mm). For PI4P and PI(4,5)P2, choose a C4 column of dimensions 300 Å (1.0 mm x100 mm x 1.7 µm).\nPrepare the mobile phase that contains ammonium formate by dissolving ammonium formate in mass spec grade water first, and then in organic solvents. Sonicate all the solvents that are used in mass spectrometry for 20 min to remove air bubbles.\nEquilibrate the column by infusing solution A containing water + 0.1% formic acid and solution B having acetonitrile + 0.1% formic acid.\nInject the eluate from the liquid chromatography system (injection volume in the range of 1-20 µL) into the mass spectrometer for analysis. Set the flow rate at 0.1 mL/min and temperature of the column at room temperature. Inject the entire elute volume coming out of the column into mass spectrometer.",
    "In the sample injection sequence, always start with a blank solvent injection (methanol) and keep neat standard samples intermittently in between biological samples for mass spectrometry run quality control checks (every sixth run).\nFor the hybrid triple quadrupole ion-trap mass spectrometer experimental set-up, before starting the experiment, calibrate the mass spectrometer as per the manufacturer's instructions. For PA, PC, and PI, use electrospray ionization (ESI) to generate the ions and operate in positive mode to detect the positively charged lipid species. Acquire the data and analyze it using the installed data analysis software with the system.\nOptimize the parameters for analysis according to the corresponding internal standard used. Mass spectrometer parameters are as follows: dwell time = 30 ms; CAD (collision activated dissociation) = 3 psi; GS1 (source gas 1) = 24 psi and GS2 (source gas 2) = 21 psi; CUR (curtain gas) = 30 psi; IS (ESI voltage) = 4.5 kV; and TEM (source temperature) = 450 °C.\nFor PI4P and PI(4,5)P2, use mass spectrometer in the positive mode. Mass spectrometer parameters are as follows: dwell time = 65 ms; CAD (collision activated dissociation) = 2 psi; GS1 (source gas 1) and GS2 (source gas 2) =20 psi; CUR (curtain gas) = 37 psi; IS (ESI voltage) = 5.2 kV; and TEM (source temperature) = 350 °C.\n8. Normal phase liquid chromatography-multiple reaction monitoring-enhanced product ion scan MS (NPLC-MRM-EPI MS)\nChromatographic conditions\n\t\nUse a normal phase LC method using a silica column, which is able to separate PA from other phospholipids. Use hexane:isopropyl alcohol:100 mM aqueous NH4COOH in the ratio 68:30:2 as mobile phase A and isopropyl alcohol:hexane:100 mM aqueous NH4COOH in a 70:20:10 ratio as mobile phase B.\n\t\tNOTE: This combination provided the best separation and peak selectivity of different molecular species of PA.",
    "Use the chromatographic behavior of reference compounds (internal standards), in terms of resolution and peak shape, to choose the optimal conditions.\nPerform chromatographic separation on a normal phase silica column (1 mm x 150 mm x 3 µm) at room temperature on an ultra-performance liquid chromatography column. Set the autosampler injection volume to 6 µL and the eluent flow rate to 210 µL/min.\nAfter 5 min of equilibration with 100% of mobile phase A, linearly increase the mobile phase B to 30% over 5 min, further to 80% over 5 min, then to 100% over 5 min, and hold it constant at 100% for 5 min. Lastly, re-equilibrate the column for 9 min.\nMass spectrometry\n\t\nUse a hybrid triple quadrupole ion-trap mass spectrometer operating in negative ESI mode. Control the system operation and data acquisition using the analysis software provided. Before starting the experiment, calibrate the mass spectrometer as per the manufacturer's instructions.\nOptimize the source parameters using flow injection analysis of the internal standard mixture. Accordingly, set the ion spray voltage = -4.5 kV, source temperature (TEM) = 450 °C, collision activated dissociation gas (CAD) = 3 psi. Use nitrogen gas as the collision gas and set nebulizer gas (GS1) = 24 psi, the auxiliary gas (GS2) = 21 psi, and the curtain gas (CUR) = 30 psi.\nSet the compound dependent ion path parameters as declustering potential (DP) = -42 V, entrance potential (EP) = -6 V, and collision cell exit potential (CXP) = -12 V, optimized using continuous infusion of internal standard mixture solution. Record full product spectra along with precursor to product MRM transitions with varying collision energy (CE) starting from 12 eV to 40 eV for fragmentation analysis using EPI scanning function available in the mass spectrometer.",
    "NOTE: The MRM triggered IDA based EPI simultaneously records precursor ion-product, ion scanning and on the fly MS/MS acquisition. The MRM narrowed the ion scan range in quadrupole 1 (Q1) and the ion trap enhanced the ion fragments passing through Q2 thus improving the qualitative capability of quadrupole MS/MS greatly, especially for capture of all the fragments arising from the precursor ion. In EPI mode, multiple fragment ions arising from the precursor ions are detected in Q3 with better signal-to-noise ratio.\nPerform MRM experiments with CE of 39 eV to gain high sensitivity. Limit the maximum number of MRM to 75 and dwell time to 30 ms to detect and record the MRM of any specific molecule which elutes from the chromatographic column at any time during the run. This increases the duty cycle of the machine.\nPerform experimental tuning to decide the best ionization parameters for PA, as described above. For this experiment, set the ion spray voltage = -4.5 kV, source temperature (TEM) = 450 °C, collision activated dissociation gas (CAD) = 3 psi. Use nitrogen gas as the collision gas. Set nebulizer gas (GS1) = 24 psi, the auxiliary gas (GS2) = 21 psi, and the curtain gas (CUR) = 30 psi.\nManually examine all tuning data to ensure proper selection of ionization parameters and product ions. Take into consideration the minimizing potential interference between MRM channels when selecting the product ion. The experimental parameters used for the analysis of all the PA molecular species are shown in Table 4.",
    "NOTE: The hybrid triple quadrupole linear ion trap mass spectrometer allows us to combine MRM scan mode with the ion trap scanning function, thus, enabling fast and high scanning by utilizing methods such as EPI scan for recording useful tandem mass spectra of each detected precursor. In this study, to identify distinct molecular species of PA, we have exploited this MRM-EPI based MS/MS approach based on the conventional triple quadrupole ion path with the EPI scanning property of the ion-trap, controlled by the analysis software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}