{
  "id": 19610,
  "origin_website": "Jove",
  "title": "A Mouse Model of Direct Anastomosis via the Prespinal Route for Crossing Nerve Transfer Surgery",
  "procedures": [
    "All the animal experiments were approved by the Institutional Care of Experimental Animals Committee of Fudan University and the Chinese Academy of Science in conformity with the National Institute of Health guidelines. Eight-week-old adult male C57BL/6N mice were used.\n1. Preoperative setup\nEnsure an appropriate stock of autoclaved sterilized surgical instruments, equipments, analgesic medications, and anesthetic medication.\nEnsure adequate working space on an operating table.\nPrepare the operating table using a diaper-covered customized surgical foam board as a bed for the mouse. Fix a warming pad to the foam board with medical tape covered with sterile gauze.\nCreate retractors by bending an acupuncture needle using vascular forceps, folding it in half, and then bending the tip of the folded acupuncture needle into a hook. Fix a rubber strip at the end of the acupuncture needle, and use a thumbtack to fix the end of the rubber strip to the foam board.\nCalibrate the stereomicroscope; choose a stereomicroscope with an adequate focus distance. Cover the zoom/focus buttons with sterilized aluminum foil to allow the surgeon to adjust them during the operation. The sterilized aluminum foil was placed on the zoom/focus buttons allowing the surgeon the use it with sterile gloves.\n2. Mouse anesthesia and preparation\nWeigh the mouse and anesthetize corresponding to the body weight (isoflurane 3%). Ensure that the mouse does not respond when the interdigital spaces of its paw are pinched to confirm the depth of anesthesia. Adequate depth of anesthesia should be maintained throughout the procedure (1% isoflurane).\nApply ophthalmic ointment bilaterally to the eyes to prevent irritation or drying of the cornea during surgery.\nPrepare the surgical site by shaving the fur on the neck and chest with an automatic clipper. Remove and clean the loose hair.",
    "Place the mouse in a supine position on the warming pad covered with sterile gauze. Maintain the temperature of the mouse at 37 °C during the whole operation. Fix the mouse with medical tape to cause the forelimbs to abduct horizontally and prevent the hind limbs and tail from moving. A sterilized disposable surgical drape with appropriate opening was placed on the mice.\n3. Operative procedure\nInject tramadol as the pre-emptive analgesia (20 mg/kg, i.p.). Mark the transverse incision on the superior edge of the clavicle. Use three cycles of alternating scrubs of iodophor disinfection solution and ethanol to disinfect the surgical site. Confirm the depth of anesthesia with a toe pinch before surgery.\nWorking under a microscope, make a 4 mm transverse incision along the mark using a sterile scalpel. Enlarge the incision during the procedure as necessary.\nBluntly dissect through the subcutaneous fascia and identify the inferior border of the submandibular gland. Pull the submandibular gland upward to expose the supraclavicular fossa and sternum.\n\tNOTE: There might be small-caliber blood vessels in this area. Electrocautery can be used to stop bleeding.\nMake a partial median sternotomy incision (~4 mm) by incising the sternum from head to tail along the middle line. Protect the pleura, heart, and blood vessels during sternotomy.\nIdentify the sternohyoid muscle. Pull the sternum gently with two small customized retractors made of acupuncture needles and identify the sternohyoid muscle, over the trachea and esophagus. Retract this muscle to expose the carotid artery, internal jugular vein, phrenic nerve, vagus nerve, trachea, and esophagus.\n\tNOTE: Gently retract the sternum to avoid open pneumothorax. Unlike in humans, the esophagus of the mouse is not behind the trachea but adjacent to the trachea on the left side.",
    "Identify the left brachial plexus. At the lateral edge of the left internal jugular vein, pull the fascia and adipose tissue outward to expose the brachial plexus. Look for the superior trunk, composed of the C5 and C6 nerves, which has three branches. Identify the middle trunk composed of the C7 nerve and the inferior trunk composed of the C8 and T1 nerves, along the upper trunk up to the tail of the mouse.\n\tNOTE: There are longitudinal blood vessels on the surface of the brachial plexus. Use electrocautery to prevent bleeding. When separating the left brachial plexus, protect the chylous canal to avoid a chylous fistula.\nHarvest the left C7 nerve. Dissect the anterior division and posterior division of the middle trunk (C7 nerve) distally to the division-to-cord level under the clavicle and block the C7 nerve with 0.1 mL of 2% lidocaine by local infusion into nerve trunk. Resect the C7 nerve by vannas spring scissors at its merger points with the lateral cord and posterior cord. Trim the C7 nerve so that the length of each division is similar.\n\tNOTE: The anterior and posterior divisions of the C7 nerve and the anterior and posterior divisions of upper and lower trunks run for a long distance before confluence, so the C7 nerve should be freed sufficiently before resection. In fact, the C7 nerve is not always divided into two divisions; sometimes, it is divided into three divisions or even into four in rare cases.",
    "Remove the left C6 lamina ventralis. Carefully protect the phrenic nerve and severe the anterior scalene muscle at the level of the C6 segment to expose the C7 nerve root. Cut small branches of the C7 nerve innervating the paraspinal muscle with microforceps. Pull out the C7 nerve gently and excise the C6 lamina ventralis carefully.\n\tNOTE: There is a bony prominence between the medial side of the left carotid artery and the lateral side of the esophagus. This bony prominence is the lamina ventralis of the 6th cervical vertebrae. The longitudinal muscle of the lateral edge of the C6 lamina ventralis is the anterior scalene muscle, and the phrenic nerve runs on the surface of the anterior scalene muscle.\nHarvest the right C7 nerve. Severe the anterior scalene muscle on the right side, similar to the left side, and transect the right C7 nerve root close to the intervertebral foramen. Dissect the right C7 nerve from its division level.\n\tNOTE: Carefully cut the right C7 nerve to prevent damage to the blood vessels under the nerve.\nTransfer the left C7 nerve.\n\t\nRemove the muscular longus colli beside the vertebral bodies partially on both sides. Bluntly separate and expand the space between the trachea-esophagus and vertebral body.\nSend a half-fold 5-0 nylon sutures from the right side of the vertebral body to the left side through the prespinal route.\nHitch the left C7 nerve with an infusion tube and guide the nerve to the right side via the prespinal route.\nRetract the trachea and esophagus gently and coapt the anterior and posterior divisions of the left C7 nerve to the right C7 nerve root without tension using 12-0 Nylon sutures. Suture the epineurium around the nerves with 4-5 stitches to coaptate the nerves strongly.",
    "NOTE: It is crucial to choose a plastic infusion tube of appropriate thickness. Too thin of a tube could damage the nerve, and too thick of a tube could damage the trachea and esophagus. In addition, the space between the trachea-esophagus and the vertebral body is a \"V\"-shaped space, and cutting part of the muscular longus colli can shorten the transfer pathway.\n4. Wound closure\nIrrigate the wound with sterile normal saline and dry it with sterile gauze.\nSuture the sternum and close the skin using 5-0 monofilament sutures. \n5. Postoperative care\nWait for the mouse to wake from anesthesia. Transfer the mouse to a clean cage without bedding material but warmed with a warming blanket. Observe the mouse until it is ambulatory. Use tramadol (20mg/kg, i.p.) as the postoperative analgesia.\nPlace the mice in a recovery cage and monitor it till recovery. Restore the water and diet of the mice after the operation. Monitor the mice postoperatively for signs of impairment or infection every day, including malnourishment, hunched posture, and ruffled fur. At two weeks after surgery, suture removal should occur.\n\tNOTE: Apply erythromycin ointment to the wound surface every day for three consecutive days.\nIf any complications, such as wound edema is observed, that should be immediately resolved.\n6. Behavioral analysis\nNOTE: All behavioral testing and analysis were done by an observer blinded to the experimental groups.\nCylinder test\n\tNOTE: The cylinder test evaluates the use of forelimbs during spontaneous vertical exploration within a cylinder at 4 and 8 weeks after surgery21. \n\t\nPlace the mice in a transparent cylinder (diameter 9 cm, height 15 cm) on an elevated frame.\nTo facilitate observation and recording, fix a mirror at a 45° angle below the cylinder.",
    "Record spontaneous rearing of each mouse observed with the help of the mirror for 10 min.\n\t\t\nManually determine the length of time for which the (i) right paw, (ii) left paw, or (iii) both paws made contact with the glass walls. Count a total of 20 movements during each session. Exclude mice that are not active during the test from the analysis.\nScore the test performance as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63051/63051eq01v2.jpg\nGrid-walk test\n\tNOTE: The grid-walk test assesses the accurate placement of the forepaws on the rungs of a grid during spontaneous exploration at 4 and 8 weeks after surgery.22.\n\t\nPlace the mice on a wire grid (20 cm x 24 cm) with 25 mm square holes and allow them to freely explore for 10 min while recording their performance with a video camera.\nScore a foot slip in the case of either of the following:\n\t\t\nLook for instances when the paw completely misses a rung (in which case the limb falls between the rungs and the animal loses balance).\nLook for instances when the paw is correctly placed on a rung but slips off while bearing body weight.\nExpress the test result as foot slip of right forelimb / total foot slip. Although neither the cylinder test nor the grid-walk test requires training, obtain baseline scores by testing each animal once before surgery."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}