{
  "id": 10342,
  "origin_website": "Jove",
  "title": "Generation of Transgenic Rats using a Lentiviral Vector Approach",
  "procedures": [
    "The production and application of viral vectors was in accordance with Biosafety Level 2 guidelines and was approved by the Polish Ministry of Environment. All experimental animal procedures that are described below were approved by the Local Ethical Committee. The animals were housed in individually ventilated cages at a stable temperature (21–23 °C) and humidity (50–60%) with ad libitum access to water and food under a 12 h/12 h light/dark cycle.\n1. Lentiviral vector production\nTransfection of HEK 293T cells\n\tNOTE: The protocol that is presented herein is designed for the transfection of twenty Ø10 cm culture dishes that produces approximately 200 mL of crude vector supernatant.\n\t\nCulture HEK 293T cells in DMEM medium that is supplemented with fetal bovine serum (10%, v/v) in a humidified CO2 incubator at 37 °C. For transfection, prepare twenty 10 cm diameter plates, and seed 1.5–2 x 106 HEK 293T cells per dish.\nWhen confluence reaches ~70%, transfect the cells using polyethylenimine (PEI) reagent, pH 7.0, at a ratio of 3 μg of PEI per 1 μg of DNA.\n\t\t\nPrepare the transfection mixture for five plates (prepare the number of repetitions according to the total number of dishes). To 1 mL of Dulbecco’s Modified Eagle Medium (DMEM; without serum), add the mixture of three plasmids so they reach a final amount of 25 µg of VSVg plasmid, 50 µg of delta R8.2, and 50 µg of coding plasmid.\nPipette up and down, and add 125 µL of PEI at a concentration of 3 µg/µL. Incubate at room temperature for 15 min, inverting the tube three times during incubation. Add 200 µL of the transfection mixture per plate. Next, incubate the plates in a humidified CO2 incubator at 37 °C.\nConcentration of lentiviral vectors",
    "Forty-eight hours after transfection, harvest the medium that contains LV particles. Use 50 mL conical tubes.\n\t\tNOTE: When using a plasmid with a fluorescent tag, cells can be visualized at this point to verify transfection efficiency. A new portion of DMEM medium can be added, and cells may be incubated for an additional 24 h. The LV yield is comparable when collected at the 48 and 72 h time points after transfection.\nCentrifuge the medium at 3,000 x g for 5 min and room temperature to remove detached cells.\nFilter the supernatant (0.45 μm) and pour it into new tubes.\n\t\tNOTE: This step can be omitted.\nAdd DNase I (RNase-free, 1 μg/mL) and MgCl2 (1 mM), and incubate in a water bath at 37 °C for 15 min.\nTransfer the medium to disposable polyethylene tubes, and ultracentrifuge in a swinging rotor at 115,000 x g and 4 °C for 1.5 h.\nAfter centrifuging, gently drain the walls of the tubes from the medium residues.\nSoak the pellet with sterile phosphate-buffered saline (PBS; 70–80 µL per tube).\nIncubate for 2 h at 4–8 °C.\nResuspend the viral vectors in PBS by gentle pipetting.\n\t\tCAUTION: Avoid foaming.\nTransfer to a 1.5 mL centrifuge tube and centrifuge at 7,000 x g and 4 °C for 30 s. Transfer the supernatant to a new tube. Repeat this step until no cellular debris pellet is visible.\nAliquot and freeze at -80 °C. Avoid refreezing the LV aliquot.\nDetermination of virus titer using quantitative polymerase chain reaction\n\tNOTE: The titration of viral vectors is performed using quantitative PCR (qPCR). This method is based on amplifying a double-stranded 84 bp long DNA fragment within the long terminal repeat region of the viral genome15.",
    "Prepare the standard curve by making serial dilutions of the LV-coding plasmid: 1:500, 1:1,000, 1:5,000, 1:10,000, 1:100,000, and 1:1,000,000. Determine the number of copies of the plasmid that is used for the standard curve. Use the following formula: number of copies/µL = (concentration [g/µL] x 6.02 x 1023 [number/mol]) / (660 [g/mol] x plasmid size [bp]), where 6.02 x 1023 number/mol is Avogadro’s number, and 660 g/mol is the bp weight.\n\t\tNOTE: Online copy number calculators may be used.\nPrepare dilutions of the lentiviral suspension: 1:100, 1:500, and 1:1,000.\nPrepare the reaction mixture (volumes per well): 10 µL of qPCR Mastermix, 1 µL of 10 μM Forward primer, 1 µL of 10 μM reverse primer, and 7 µL of H2O. Pipette the mixture into the wells of 96-well plates.\n\t\tNOTE: Forward primer: 5’-AGCTTGCCTTGAGTGCTTCA. Reverse primer: 5’-TGACTAAAAGGGTCTGAGGGA.\nAdd 1 µL of each standard dilution and lentiviral suspension in triplicate.\nRun the qPCR according to the following parameters: 50 °C for 2 min, 96 °C for 5 min, and 35 cycles of 96 °C for 20 s, 60 °C for 40 s, and 70 °C for 1 min, followed by melt curve stage: 95 °C for 1 min and 60 °C at 30 s.\nAnalyze the results by comparing the number of molecules that are received for each dilution to the standard curve. Determine the concentration of vector molecules as the average of three replicates for each dilution.\n\t\tNOTE: The presented quantification gives the physical concentration of the viral particles. It should not be treated as a functional titer.\n2. Generation of transgenic rats\nSuperovulation and collection of fertilized embryos\n\t\nAdminister gonadotropins.\n\t\tNOTE: To increase the number of collected embryos (approximately 30 per female), use immature 5-week-old Wistar females for hormonal stimulation.",
    "On Day 1 (12 PM–1 PM), intraperitoneally inject pregnant mare’s serum gonadotropin (PMSG; 25 IU per female). Prepare 1 mL aliquots of working solution at a concentration of 125 IU/mL by dissolving hormone powder in 0.9% NaCl. Store at -20 °C for up to 1 month or -80 °C for up to 6 months.\nOn day 3 (12 PM–1 PM), intraperitoneally inject human chorionic gonadotrophin (hCG; 30 IU per female). Prepare 1 mL aliquots of working solution (150 IU/mL) by dissolving hormone powder in 0.9% NaCl. Store at -20 °C for up to 1 month or -80 °C for up to 6 months.\nAfter hCG administration, mate females 1:1 with sexually fertile males (3-10 months old).\nThe next morning (day 4 at 8–10 AM), check the females for the presence of a vaginal plug. Check the vaginal opening for the presence of a whitish mating plug, which for best visualization should be checked early in the morning after the mating night. For embryo collection, use only females with a visible plug.\nCollect embryos at 10 AM. Sacrifice the animals to excise the oviducts, and collect the oviducts in a dish with pre-warmed M2 medium.\n\t\t\nTransfer the oviducts to a 35 mm dish that contains pre-warmed M2 medium with hyaluronidase from bovine testes at a concentration of 0.5 mg/mL.\nOpen the walls of the oviduct using fine forceps under a stereomicroscope and press the ampulla (i.e., the swollen part of the oviduct that contains fertilized embryos that are surrounded by cumulus cells) until the embryos are freed.\n\t\t\tNOTE: Hyaluronidase enzymatically digests cumulus cells, releasing embryos.\n\t\t\tCAUTION: Prolonged exposure to hyaluronidase is deleterious to embryos; therefore, this step should last no longer than 5 min.",
    "To facilitate the release of embryos from cumulus cells, gently pipette them up and down using a glass transfer pipette that is connected to a mouth-operated aspirator tube.\n\t\t\t\nTo produce the transfer pipette, pull a glass Pasteur pipette over a flame to produce a straight ~5-10 cm tip. Break the pipette leaving a ~4 cm tip.\nWash the embryos a few times in M2 medium to remove hyaluronidase and cellular debris. Transfer the embryos to a 60 mm dish that contains (~50 µL) drops of pre-equilibrated M16 medium, covered by liquid paraffin or mineral oil, in a humidified 37 °C incubator with a 5% CO2 atmosphere.\nMicroinjection of lentiviral vectors to one-cell-stage embryo under the zona pellucida\n\tNOTE: Use one-cell-stage embryos with two visible pronuclei for microinjection (Figure 1).\n\t\nThaw the LV aliquot at room temperature and centrifuge at 10,000 x g and RT for 2 min to pellet any remaining cellular debris.\nMicroinjection setup\n\t\t\nPrepare glass holding pipettes (borosilicate glass capillary) using a microforge. Pull the glass capillary over a flame to produce a 5–10 cm tip. Break the pipette leaving a ~4 cm tip. The outside diameter should be ~80–120 µm.\n\t\t\tNOTE: Ensure that the pipette tip is perfectly straight and smooth.\nAssemble the pulled pipette in a microforge with the tip in front of the heating filament. Heat the filament very close to the pipette tip and allow it to shrink to a diameter of ~15 µm (approximately 20% of embryo size). Position the pipette perpendicularly to the heating filament, 2–3 mm from the pipette tip, and begin to heat. The glass will soften. Heat until it reaches a 15° angle.",
    "Prepare microinjection borosilicate glass capillaries with a filament using a pipette puller. Insert the capillary in the pulling chamber. Run a ramp test (for the first time for new glass and every time after changing the filament). Set the Heat to the ramp value -10, Pull to 100, Velocity to 150 and Time to 100.\n\t\t\tNOTE: Modify the parameters to obtain an optimal injection capillary.\nUnder a biosafety laminar flow hood, load approximately 2 µL of the viral solution into the microinjection pipette with a microloader tip.\nPrepare a microinjection dish (lid of 60 mm Petri dish) with a 100 µL drop of M2 medium (in the middle), covered by liquid paraffin or mineral oil.\nMount the holding pipette and microinjection capillary that is loaded with viral solution to a micromanipulator and microinjection dish under an inverted microscope.\nPerform the microinjection.\n\t\t\nTransfer 15–20 one-cell-stage embryos to the M2 drop on the microinjection dish. Hold the embryo using a holding pipette.\nUsing 400x magnification, inject the LV solution under the zona pellucida to the perivitelline space using the glass capillary that is connected to an automatic injector. Hold the capillary under the zona pellucida for a moment.\n\t\t\tNOTE: Using gentle positive pressure, the viral solution will flow continuously out of the injection capillary, but the volume of the suspension that is delivered cannot be controlled.\nUsing a fine pipette, return the embryos to the culture dish in the incubator at 37 °C in a 5% CO2 atmosphere. The number of injections of one zygote may vary and can be adapted based on the viral vector concentration.",
    "NOTE: The injected embryos can be transferred to foster mothers at the one-cell stage or incubated O/N in M16 medium before being transferred at the two-cell stage. Prolonged in vitro culture of rat embryos should be avoided.\nTransfer of injected embryos to foster mothers\n\t\nPrepare foster mothers by mating sexually mature SD females with fertile BN males or with vasectomized SD males (the vasectomy procedure is described in section 3 below) on day 3 (for transferring embryos at the one-cell stage) or day 4 (for transferring embryos at the two-cell stage).\n\t\tNOTE: For oviduct transfer, use 0.5 days post coitum (dpc) females.\nThe next morning, check SD females for a vaginal plug, and use only those with a visible plug.\nPerform embryo transfer.\n\t\tNOTE: Conduct the surgical procedure with sterile instruments under a stereomicroscope. Before the day of surgery, autoclave scissors, fine forceps, needle holder, and scalpel holder.\n\t\t\nAnesthetize a female with i.p. administration of ketamine (50 mg/kg) and medetomidine (0.5 mg/kg) solution.Test for reflexes to confirm anesthesia before starting the surgical procedure.\nInject the animal subcutaneously with tolefenamic acid (2 mg/kg), butorphanol tartrate (1 mg/kg), and enrofloksacin (5–10 mg/kg) to prevent inflammation, pain, and infection, respectively.\nApply ophthalmic ointment lubrication to both eyes to prevent corneal drying. Shave the fur from the back, and sterilize the skin with surgical scrub followed by 70% alcohol using sterile non-adhering pads. Allow the skin to dry.\nInject the animal subcutaneously with 100 µL of 0.25% bupivacaine (local anesthetic) at the incision site. Transfer the animal in a prone position to a clean surface on a heating pad under the objective of a surgical microscope. Cover the rat with a sterile drape with a small hole cut over the lower back.",
    "Perform an approximately 2 cm skin incision, parallel to the lumbar vertebral column.\nUsing sharp scissors, make a cut in the abdominal wall. Grab an ovarian fat pad using forceps, and pull out the ovary and oviduct and place them on gauze that is wetted with 0.9% NaCl.\nAspirate M2 medium, three bubbles of air, and the embryos into the transfer capillary. Recommended total number of embryos to be transferred (unilateral or bilateral): pregnant female (≤ 15–16 embryos), pseudopregnant female (≤ 30 embryos).\nMake a small incision in the oviduct (between the infundibulum and ampulla) using micro-scissors, and insert the transfer pipette in the oviduct.\nGently expel embryos and air bubbles from the pipette to the oviduct. With blunt forceps, place the reproductive tract back in the abdominal cavity.\nSuture the abdominal wall with polyglycolic acid absorbable sutures and close the skin incision with wound clips. Depending on the number of embryos that are available, repeat this procedure for the other oviduct.\nInject the animal intraperitoneally with atipamezole (0.5 mg/kg) to reverse the effect of anesthesia.\nTransfer the animal to a clean cage and keep it on a warming plate to fully recover from anesthesia. Delivery in rats occurs after ~21 days.\n\t\t\tNOTE: When male BN rats are used for mating, only white pups are potentially transgenic; brown pups are from natural pregnancy.\nCollect tissue fragments (preferably from the ear) to genotype 3-week-old pups.\n3. Vasectomy\nNOTE: Before the day of surgery, autoclave scissors, fine forceps and needle holder.\nAnesthetize a 5-week-old male SD rat with i.p. administration of ketamine (50 mg/kg) and medetomidine (0.5 mg/kg) solution. Test for reflexes to confirm anesthesia before starting the surgical procedure.\nAdminister tolfenamic acid (2 mg/kg), butorphanol tartrate (1 mg/kg), and enrofloksacin (5–10 mg/kg) subcutaneously to prevent inflammation, pain, and infection, respectively.",
    "Apply ophthalmic ointment lubrication to both eyes to prevent corneal drying. Place the rat supine on a clean surface on a heating pad, and sterilize the skin on the testes with surgical scrub followed by 70% alcohol using sterile non-adhering pads. Allow the skin to dry. Cover the rat with a sterile drape with a small hole cut over the testes. Gently press the abdomen to expose the testes in the scrotal sac.\nUsing surgical scissors, make a ~0.5 cm incision in the middle of the scrotal sac. Locate the midline wall (whitish line) between the testes.\nMake a 5 mm incision in the testis membrane close to the left side of the midline wall.\nCarefully push the testis to the left and locate vas deferens (between the testis and midline) as a white duct with a single blood vessel.\nGently pull the vas deferens out of the scrotal sac using a watchmaker’s forceps. Hold the vas deferens with one pair of forceps, and cut it with fine scissors (or cauterize with red-hot tips of a second pair of forceps). Remove a ~1 cm fragment of the duct.\n\tNOTE: If cauterization is performed, hold the tip of the second pair of forceps in the flame.\nRepeat the above procedure for the other testis. Suture the skin with polyglycolic acid absorbable sutures and inject the animal intraperitoneally with atipamezole (0.5 mg/kg).\nPlace the rat in a clean cage on a warming plate until the animal recovers from anesthesia.\n\tNOTE: Males can be used in the test matings after a ~2-week recovery period. After sterility is confirmed, they can be used for pseudopregnancy induction.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}