{
  "id": 17915,
  "origin_website": "Jove",
  "title": "Blood Collection Through Subclavian Vein Puncture in Mice",
  "procedures": [
    "This study was approved by the Central South University Ethics Committee for Animal Research from The Second Xiangya Hospital (Changsha, China). The manuscript was prepared according to ARRIVE (Animal Research: Reporting of In Vivo Experiments) guidelines12.\n1. Material and animal\nPrepare required materials: 75% ethanol, adhesive tape, epilating agent, 2 mL tube, 1.0 mL syringe connected with needle (26G), electronic scale, heparin and saline (see Table of Materials).\nAnimals: Prepare 10 Kunming mice, 6-8 weeks old and weighing 21.6-28.3 g (see Table of Materials). Maintain mice in accordance with the Guide for the Care and Use of Laboratory Animals13.\n2. Anesthesia and animal positioning\nWeigh the mouse to calculate the required dosage of anesthetic agent.\nInject sodium pentobarbital (60 mg/kg) through intraperitoneal injection to induce general anesthesia14 (Figure 1). Apply a sterile eye lubrication ointment at the start of the procedure to prevent damage to exposed eyes.\n\tNOTE: Mice are considered to be sufficiently anesthetized when showing no motor response to testing of the pedal withdrawal reflex, tail pinch, or abdominal skin pinch.\nPlace the mouse in the operation table in a supine position and 2-4 cm away from the edge of the table to facilitate vein puncture (Figure 2). Fix the limbs in a comfortable position as shown in Figure 2. No intubation or mechanical ventilation is needed in the whole procedure.\nApply epilating agent around the infraclavicular space with a cotton swab.\nThree minutes later, wash the epilating agent with a wet cotton swab to remove the fur and any visible dirt.\nSterilize the infraclavicular space with 75% ethanol and then dry with clean gauze.\n3. Subclavian vein puncture and blood collection\nIdentify the location of the clavicle bone and superior sternal fossa with a finger.",
    "Locate the puncture site close to the middle of the clavicle bone and caudal to it. Put the left index finger lateral to the puncture site to fix the skin and subcutaneous tissue (Figure 3).\nMove the needle upward and cranially toward the superior sternal fossa. Once the needle enters the subcutaneous tissue, move the ring finger of the right hand backward to form negative pressure (Figure 3).\n\tNOTE: During this step, the position of the operator´s right hand should be slightly lower than the operation table to make the needle move upward and superior to the horizontal plane. That is why the animal is placed near the edge of the table.\nMove the syringe forward 3-4 mm but stop if there is no blood drain into the syringe. Then slowly draw back the syringe and keep negative pressure in it. In most occasions, the blood would enter the syringe when drawing back.\nOnce the blood enters the syringe, fix the syringe and maintain negative pressure until the required volume (200 µL) of blood is collected in the syringe.\nAfter blood collection, withdraw the puncture needle, and press the puncture site with a cotton swab slightly for 1-2 minutes to stop bleeding. Then, return mice to the cage.\n\tNOTE: Occasionally, one could not obtain the blood at his/her first attempt. Adjust the direction of the needle laterally and repeat steps 3.3-3.5. If 3 attempts fail to obtain blood sample, switch to the other side.\nTransfer the blood sample into a heparinized tube.\n4. Mice recovery\nWhile the pentobarbital anesthesia is in effect, speed recovery by providing heat support until the mouse is moving again."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}