{
  "id": 9162,
  "origin_website": "Jove",
  "title": "Visual Evoked Potential Recording in a Rat Model of Experimental Optic Nerve Demyelination",
  "procedures": [
    "Ethics Statement: All procedures involving animals were conducted in accordance with the Australian Code of Practice for the Care and Use of Animals for Scientific Purposes and the guidelines of the ARVO Statement for the Use of Animals in Ophthalmic and Vision Research, and were approved by the Animal Ethics Committee of Macquarie University.\n1. VEP Electrode Implantation\nAnesthetize the animal with an intraperitoneal injection of ketamine (75 mg/kg) and medetomidine (0.5 mg/kg).\n\tNote: Following induction of anaesthesia, observe the withdrawal reflexes (pinch test, corneal and palpebral reflex, etc.) and their absence as an indication to begin surgery. Continually monitor animals throughout the surgery and administer additional anaesthetic drug (10% of initial ketamine dose per top-up) if the reflexes are present. Adult rats (>12 weeks) are used in the experiments.\nShave the skin of the surgical area. Place the animal on a warming pad (37 °C) to maintain body temperature during the surgery. Prepare skin through topical application of povidone-iodine. Apply surgical draping. Apply topical ophthalmic ointment to prevent corneal dryness under general anaesthesia. Maintain asepsis by using sterile instruments.\nMake a longitudinal skin incision on the midline of the head skin. Clear the connective tissue to achieve good exposure of the skull.\nCarefully, drill small burr holes manually using a micro hand drill at 7 mm behind the bregma and 3 mm lateral to the midline.\nImplant screw electrodes through the skull into the cortex (area 17), penetrating the cortex to a depth of approximately 0.5 mm. Implant a reference screw electrode on the midline 3 mm rostral to the bregma. Apply dental cement to encase and fix the screws (not always required).\nSuture the skin of the head, administer antibiotic ointment onto the skin and allow the animal to recover from anaesthesia on a warming pad.",
    "Note: Alternatively, electrodes can be left exposed, so that skin doesn’t need to be reopened in each recording. Immediately upon cessation of surgery but prior to anaesthetic recovery, administer a non-steroidal anti-inflammatory drug (NSAID) (if not administered pre-operatively) or an opioid analgesic. Monitor the animals constantly until full recovery from anaesthetic and fully ambulatory.\nAllow at least 1 week for the animals to recover from the surgery prior to VEP recording.\n2. Optic Nerve Injection\nAnesthetize the animal, prepare the skin and apply draping as above (1.1 and 1.2).\nMake a 1- to 1.5-cm incision in the skin above the orbit of a randomly selected eye. Open the subcutaneous tissue to reach the orbital cavity using fine iris scissors. Open the conjunctiva and anterior Tenon's capsule under the operating microscope.\nRetract the extraocular muscles and intraobital lacrimal glands to expose approximately 3 mm length of the optic nerve. Open the dura and arachnoid matter layers around the optic nerve longitudinally using an ophthalmic blade.\nInsert the glass pipette into the optic nerve at a distance of 2 mm posterior to the globe. The glass micropipette is attached to a Hamilton syringe.\nInject 1% lysolecithin (0.4 - 1.0 µl, with 0.02% Evan’s Blue which doesn’t have effects on myelination) slowly into the nerve approximately over a period of 30 sec.\nSuture the skin incision. Apply antibiotic ointment to prevent infection. Fellow eyes can be served as internal controls for electrophysiology recordings.\nPlace the animals on a warming pad to recover from anaesthesia.\n3. VEP Recording\nAnesthetize the animal and prepare the skin as 1.1 and 1.2.\n\tNote: Lower dose of anaesthetics can be used for electrophysiological recording (ketamine 40 mg/kg and medetomidine 0.25 mg/kg).",
    "Place the rat in a dark room and allow it to adapt to darkness for 5 - 30 min. In some cases rats can respectively be dark adapted O/N for scotopic or light adapted for photopic VEP recordings8.\nMaintain the body temperature at 37 ± 0.5 °C by the homoeothermic blanket system with a rectal thermometer probe.\nDilate the pupils with 1.0% tropicamide eye drops. Open the skin over the skull to access the pre-placed in situ screw electrodes.\nConnect the screw over the contralateral visual cortex of the stimulated eye and the reference screw to the amplifier. Insert a needle electrode into the tail as the ground. Measure and maintain the electrode impedance below 5 kΩ.\nPlace a mini-Ganzfeld stimulator directly on the skin around the eyelids to provide superior eye isolation7. The illumination of the stimulator needs to be calibrated beforehand by a photometer.\nDeliver photic stimulation through light flashes 100 times at a frequency of 1 Hz, with low and high band-pass filter settings of 1 and 100 Hz, respectively. The signal sampling rate is at 5 kHz.\n\tNote: Signals should be sampled at least at about 250 - 300 Hz to ensure that more that two samples are collected during each cycle.\nSuture the skin back and keep the animals on a warming pad to recover from anaesthesia. Recording can be repeatedly recorded on individual animals to monitor functional changes over a period of time.\nAt the end-point, administer an overdose injection of sodium pentobarbitone (100 mg/kg, i.p.) to euthanize the animal. Confirm euthanasia by cardiac arrest, respiratory arrest and decrease of body temperature.\n4. Tissue Preparation and Histology\nRemove the optic nerves from euthanized animals under the microscope and fix the tissue in 1% paraformaldehyde O/N.",
    "Wash the tissue thoroughly with saline. Treat the tissue in an automatic tissue processor and embed in paraffin. Cut sections (5 - 10 µm) using a rotary microtome.\n\tNote: For immunohistochemistry study, fix tissue in 1% paraformaldehyde, wash with saline and incubate with 30% sucrose O/N. Embed tissue in OCT embedding medium and make cryosections using a cryostat.\nIncubate sections in 0.1% fast blue solution such as Luxol (in 95% ethanol) O/N at 56 °C. Differentiate the sections in 0.05% lithium carbonate for 30 sec and then 70% ethanol for another 30 sec. Finally, counterstain in 0.1% cresyl violet solution for 30 sec before mounting the sections. Use the fast blue staining to identify myelin in the optic nerve5.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}