{
  "id": 15377,
  "origin_website": "Jove",
  "title": "Investigation of Microbial Cooperation via Imaging Mass Spectrometry Analysis of Bacterial Colonies Grown on Agar and in Tissue During Infection",
  "procedures": [
    "NOTE: Animal experiments were approved by the Animal Care and Use Committees of the Children's Hospital of Philadelphia and the University of Pennsylvania Perelman School of Medicine (protocols IAC 18-001316 and 806279).\nCAUTION: Clostridium difficile (C. difficile) and Enterococcus faecalis (E. faecalis) are BSLII pathogens and should be handled with extreme caution. Utilize proper decontamination protocols when necessary.\n1. Growth of bacterial culture macrocolonies and preparation for overnight shipment\nPrepare C. difficile and E. faecalis overnight cultures and grow them individually at 37 °C in an anaerobic chamber (85% nitrogen, 10% hydrogen, 5% carbon dioxide) in brain-heart-infusion broth supplemented with 0.5% yeast extract and 0.1% l-cysteine (BHIS). Use 1.5% agar for all plated samples.\nNormalize the bacterial culture media to optical density at 600 nm (OD600). Plate 5 µL of each macrocolony onto BHIS + l-cysteine agar plates and grow anaerobically for 7 days at 37 °C. For mixed species macrocolonies, mix the bacterial culture media at a 1:1 ratio prior to plating.\nPrepare indium tin oxide (ITO)-coated microscope slides by using an ohmmeter to identify the side of the slide with the conductive coating. Use a diamond-tipped scribe to etch and label the ITO-coated side of the microscope slide.\nExcise the entire culture from the agar growth plate and then mount onto an ITO-coated microscope slide while ensuring that air bubbles are not trapped between the agar and slide.\n\tNOTE: The water content in the agar media should allow the culture to adhere naturally to the microscope slide surface. A video exemplifying this process is provided in the supplementary documentation of Yang et al.22.",
    "Place the colonies in microscope slide boxes for protection. Store the slide boxes in 8 in x 8 in biohazard specimen transport bags with a handful of desiccant pellets and seal for overnight shipping for further processing and analysis.\n\t​NOTE: It is important to maintain a dry environment for the bacterial cultures when shipped under ambient conditions to slow bacterial growth and metabolism and maintain fixation of the bacterial specimens until analysis. This shipping method has been optimized through extensive experiments and is preferred over shipping the colonies frozen in dry ice. Major temperature changes prior to drying tend to cause dismounting and bubbling underneath the mounted agar sample.\n2. Ambient drying of  C. difficile + E. faecalis bacterial macrocolonies\nRemove the agarose bacterial colonies mounted on ITO-coated microscope slides from the packaging material. Place the samples in a dry box with desiccant for 48-72 h at room temperature.\n\tNOTE: This is a mild and slow drying process that minimizes bubbling, cracking, or detachment of the agar media from the microscope slide surface.\nProperly dispose of all contaminated packaging material and decontaminate the workspace with an appropriate bactericidal/sporicidal disinfectant.\nVisually inspect the colonies for deformations in the agar surface (e.g., bubbling, cracking, dismounting).\n\t​NOTE: The height of the agarose surface should visibly decrease and lie flat across the slide.\n3. Vacuum and heat-mediated drying of  C. difficile + E. faecalis bacterial macrocolonies",
    "NOTE: A custom-built vacuum drying apparatus (Figure 1) was built to facilitate the removal of excess moisture from the agar samples. This apparatus utilizes a rotary vane vacuum pump connected in line to a HEPA biofilter, a cold trap, and a stainless-steel chamber, where the bacterial samples are placed. A variable voltage transformer is connected to an insulated wire filament, which allows the user to heat the chamber to expedite the drying process.\nClose the vacuum line to the sample chamber and turn on the power switch to the rotary vane pump to allow the vacuum pump to warm up and achieve proper vacuum pressure.\nTurn on the variable voltage transformer to heat up the wire filament wrapped around the chamber. Adjust the variable power supply until the internal temperature of the vacuum chamber reaches ~50 °C. While the pump is warming up, place a slurry of dry ice and 100% ethanol into the condenser of the cold trap.\n\tNOTE: The cold trap condenses any vapors or spores from the sample and avoids contamination of the rotary vane pump system and vacuum pump oil.\nOpen the vacuum chamber by using a wrench to loosen the 16 mm double claw flange clamps. Insert the agarose samples into the chamber and seal the chamber tightly with the 16 mm double claw flange clamps.\nOpen the pump valve to evacuate the chamber. Allow the samples to dry for 60-120 min (e.g., at ~150 mTorr).\n\tNOTE: This drying time is sufficient to remove most of the moisture in small agar sections. Empirical determination of the optimal drying time for moisture removal and decreasing the agar height may be necessary depending on the individual setup and samples. Substantially longer drying times can cause the dried agar to become brittle and prone to cracking.",
    "When complete, slowly vent the vacuum chamber to ambient pressure by closing the valve on the rotary vane pump and opening the external valve to ambient air. Open the chamber using the previously mentioned protocol and remove the dried agarose sample from the chamber.\nStore the sample in a dry box with desiccant until matrix application.\n\t​NOTE: Figure 2 shows images of the agar surface prior to and after drying.\n4. MALDI matrix application  via robotic spraying\nNOTE: After the agarose samples have been thoroughly dried and the height of the culture sections have noticeably decreased, use a robotic matrix sprayer to homogeneously apply a thin coating of a chemical MALDI matrix compound. This procedure should be performed in a chemical fume hood and with proper personal protective equipment, including gloves, laboratory glasses, and a lab coat.\nSelect the appropriate MALDI matrix. To follow this protocol, use 1,5-diaminonaphthalene (DAN) MALDI matrix for its favorable desorption and ionization of amino acids in negative ion mode.\nPrepare 10 mL of a 10 mg/mL DAN MALDI matrix solution in 90/10 (v/v) acetonitrile/water. Use HPLC-grade solvents, sonicate for 30 min, and filter the solution through 0.2 µm nylon syringe filters prior to introduction to the robotic sprayer syringe pump. Additionally, prepare wash solutions to ensure the sprayer line is clean between each use.\n\tNOTE: Wash solutions are chosen to increase the solubility of the matrix and other contaminants in the sprayer line and facilitate their removal from the system. The wash solutions used herein are 90/10 (v/v) acetonitrile/water, 50/50 (v/v) water/methanol, 99/1 (v/v) acetonitrile/acetic acid, and 95/5 (v/v) water/ammonium hydroxide.",
    "Attach the sample to the sprayer tray and load the prepared solutions into the sprayer line (Figure 3). Using the computer software, specify the necessary parameters to allow for a uniform coating of the matrix compound: 30 °C nozzle temperature, eight passes, 0.1 mL/min flowrate, CC pattern, 0 s drying time, 10 psi.\n\tNOTE: It is generally accepted that most pathogens will be inactivated by application of the MALDI matrix, which is typically a small organic acid or base.\nAfter the spraying sequence has finished, remove the sample from the sprayer tray and store in a desiccation cabinet until analysis.\n5. Preparing bacterial macrocolonies for MALDI imaging mass spectrometry data acquisition\nNOTE: All imaging mass spectrometry analyses were performed using a Fourier transform ion cyclotron resonance (FTICR) mass spectrometer. This instrument is equipped with a Nd:YAG MALDI laser system (2 kHz, 355 nm) .\nInsert the matrix-coated sample into the MALDI target plate microscope slide adapter and scribe at least three fiducial markers that encompass the sample area using permanent markers (Figure 4). Use a flatbed scanner to acquire an optical image of the microscope slide including the fiducial markers.\n\tNOTE: The fiducial markers will allow the registration of the optical image to the MALDI camera view observed in the instrument.\nDefine an MS instrument method optimized for the desired mass range, sensitivity, and resolution, which includes mass calibration, MALDI laser settings, ion optics parameters, and ICR cell conditions. For this method, select a 100 Da mass window from m/z 100 to 200 for gas-phase signal enrichment in negative ion mode using a continuous accumulation of selected ions (CASI) approach,23 which encompasses the m/z values of the metabolites of interest.",
    "Open the instrument's image acquisition software and use the setup wizard to define the file name and location, the MS acquisition method, regions of interest to be sampled, and the spatial resolution of the image.\n\tNOTE: Spatial resolutions of 100-300 µm are typically employed for bacterial macrocolony imaging.\nOnce all the parameters have been defined, start the acquisition sequence to serially acquire a mass spectrum at each pixel across the defined region(s) of interest.\n\t​NOTE: Image acquisition time depends on the instrument settings, but typically ranges from 2 to 6 h for images containing 5,000-10,000 pixels.\n6. Imaging mass spectrometry data analysis and compound identification\nFollowing image acquisition, save the data with a \".mis\" file extension, which is a vendor-specific file format for imaging mass spectrometry platforms. Open the data file in flexImaging or SCiLS software packages or export to a non-proprietary data format such as .mzml and visualize using vendor-neutral software (e.g., Cardinal24 or MSIreader25,26).\n\tNOTE: An average mass spectrum is displayed upon opening the imaging data in flexImaging, which represents the average intensities of all ions detected in the sampled regions. Peaks of interest can be tentatively identified based on accurate mass measurements. Typically, mass accuracies of better than 5 parts per million (ppm) are sufficient for metabolite identification on FTICR mass spectrometers.\nUsing the referenced software, define mass windows for peaks of interest to generate false-color heat maps of ion distributions across the sampled regions.\n\t\nOn the average mass spectrum display, zoom in to the peak of interest and select an appropriate mass window that encompasses the area of the peak profile.\nRight click on the highlighted mass window and select Add Mass Filter.... Label the selected m/z value using the tentative identification for the suspected metabolite as determined by the high resolution accurate mass measurement.",
    "Select the intensity threshold to adjust the dynamic range of the analyte image displayed by the false-color heat map. Further adjust the mass filtering parameters so that the mass window encompasses the area of the peak profile, and then add the mass filter.\n\t\t​NOTE: Intensity normalization can be performed as appropriate to improve relative quantification across measured regions. The experiments herein utilized CASI data acquisition (vide infra), which may render total ion count (TIC) and root mean square (RMS) normalization methods inaccurate. As such, all ion images shown herein are displayed without normalization.\n7. Preparation and shipment of noninfected control and C. difficile -infected mouse cecal tissues\nInnoculate 4-8-week-old C57BL/6 male mice with antibiotics (0.5 mg/mL cefoperazone or 0.5 mg/mL cefoperazone + 1 mg/mL vancomycin) in drinking water ad libitum for 5 days, followed by a 2 day recovery period and subsequent infection.\nEuthanize the animals by CO2 asphixiation and harvest the mouse cecum organ immediately. Embed in a 20% mixture of optimal cutting temperature (OCT) compound in distilled water.\nPlace the samples on dry ice and then package and ship for analysis; store at -80 °C until analysis.\n8. Cryosectioning of noninfected control verus  C. difficile -infected mouse cecal tissues\nClean all cryosectioning equipment by rinsing with 100% ethanol and allow to dry before placing samples into the cryostat chamber. Prepare ITO-coated microscope slides by using an ohmmeter to identify the side of the slide with the conductive coating. Use a diamond-tipped scribe to etch and label the ITO-coated side of the microscope slide.\n\tNOTE: Proper personal protective equipment, including gloves, laboratory glasses, a lab coat, and cryostat sleeves, should be worn.",
    "Perform cryosectioning on a research cryomicrotome. Transfer the OCT-embedded mouse ceca tissues from a -80 °C freezer to the cryomicrotome chamber (30 °C chamber temperature, -28 °C object temperature) on dry ice. Mount the tissue samples to be compared using imaging mass spectrometry (e.g., noninfected control vs. C. difficile-infected) on the same microscope slide to ensure identical sample preparation of both tissue types and enable accurate metabolite comparisons.\nInside the cryomicrotome chamber, mount the OCT-embedded tissue on a sample chuck using additional OCT solution. After the OCT solution has solidified, fix the chuck to the specimen head. Begin cryosectioning at 10-50 µm increments to reach the desired tissue depth/plane of the organ.\nOnce an optimal cross section of the tissue is reached, begin collecting sections at 12 µm thickness. Gently manipulate the slice using artist paintbrushes and place it onto a Teflon-coated microscope slide.\nRoll the ITO-coated microscope slide on top of the tissue section to pick up the tissue from the Teflon-coated slide. Thaw mount the tissue section to the microscope slide by pressing the palm to the back of the ITO-coated slide. Continue to thaw mount until the tissue section transitions from translucent to an opaque/matte texture.\nTransfer the tissue-mounted microscope slides on dry ice to a dry box with desiccant for storage for same day analysis, or store at -80 °C for longer-term storage.\n9. Preparation of noninfected control versus C. difficile -infected mouse cecal tissues for matrix application and MALDI imaging mass spectrometry\nPerform MALDI matrix application using the same protocol described in step 4 (30 ° C nozzle temperature, eight passes, 0.1 mL/min flowrate, CC pattern, 0 s drying time, 10 psi).\nPerform MALDI imaging mass spectrometry using the same protocols described in steps 5 and 6.",
    "Analyze the ion images from multiple biological replicates and compare the results for significance via intensity box plot comparisons using the SCiLS statistical software referenced above.\n\tNOTE: The appropriate statistical tests and comparisons will depend on the application and can include spatial segmentation, classification models, and comparative analysis for determining discriminative and correlated spectral features. Comparitive analyses can include assigning p-values to significant features, generating principal component analyses for tissue comparisons, and visualizing box plots to identify variations. It is also useful to visualize the tissue using brightfield microscopy of the tissue section stained via hematoxylin and eosin (H&E) following imaging mass spectrometry. This enables clear identification of morphological features in the tissue and can be analyzed in consultation with a trained pathologist.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}