{
  "id": 2560,
  "origin_website": "Cell",
  "title": "Optimized protocol for obtaining and characterizing primary neuron-enriched cultures from embryonic chicken brains",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of a neuron-enriched cell fraction from chicken embryos\nTiming: 5–6 h\nThis step describes the detailed protocol for the isolation of a neuron-enriched cell from 48 embryonic chicken eggs.\nOn the 9th day post- fertilization, analyze the eggs by trans-illumination with a white 60 W light bulb to confirm the presence of a viable embryo (Figure 2[href=https://www.wicell.org#fig2]). Keep the eggs in the incubator until the next day.\nOn the 10th day, prepare the working area as well as the necessary material (see isolation procedure preparation[href=https://www.wicell.org#sec1.5] and Figure 3[href=https://www.wicell.org#fig3]).\nSpray and wipe the eggs with 70% ethanol to minimize contamination.\nIsolate the head and collect the brain from embryonic chicken eggs (Methods video S1[href=https://www.wicell.org#mmc1]).\nIn the laminar flow cabinet, place the egg in the support with the air sack facing upward and, using a pair of scissors, make a hole through the air sack. Use tweezers to increase the size of the hole (Figure 4[href=https://www.wicell.org#fig4]A).\nNote: Start with the eggs that are apparently not fertilized or possibly non-viable, to check that no viable embryos are present. This will minimize the waiting time of viable cells before the further steps of the isolation protocol.\nLocate the embryo and transfer it from the amniotic fluid to a clean Petri dish on ice, using curved tweezers (Figures 4[href=https://www.wicell.org#fig4]B and 4C).\nNote: This step requires some practice. In the beginning, transfer the egg content into a clean Petri dish and transfer the embryo to another clean Petri dish on ice.\nIdentify the head and dissect the embryo brain using a sterile pair of scissors (Figures 4[href=https://www.wicell.org#fig4]D–4H).\nWith a 1 mL pipette tip and some dissection buffer, clean the dissected brain. Collect it and transfer it into a 50 mL tube containing approximately 10 mL of ice-cold dissection buffer.",
    "Upon collection of all the brain tissue, grind them mechanically using a sterile glass Pasteur pipette.\nNote: apply some pressure with a finger on top of the glass pipette to avoid the rise of dissection medium.\nPellet the tissues by centrifugation at 80 × g for 5 min, at room temperature.\nDiscard the supernatant and resuspend the pellet in 4–6 mL of 0.25% trypsin-EDTA solution at 37°C, in a water bath. See troubleshooting 1[href=https://www.wicell.org#sec7.1].\nHomogenize the cell suspension by gently swirling the tube.\nAfter 5 min of incubation, homogenize the cellular suspension by pipetting up and down with a 5 mL serological pipette.\nReturn the 50 mL tube to the water bath.\nAfter 10 min of incubation, add 3 volumes of neuron culture medium (at room temperature). See troubleshooting 1[href=https://www.wicell.org#sec7.1].\nFilter the cell suspension through a 40 μm nylon cell strainer to remove clumps, flushing the strainer with 2–3 mL of medium. See troubleshooting 2[href=https://www.wicell.org#sec7.3].\nPellet the cells by centrifugation at 200 × g for 10 min. Discard the supernatant.\nLyse red blood cells via an osmotic shock.\nAdd 6 mL of ice-cold RBC lysis buffer and incubate for 8 min on ice.\nDilute the cell suspension with 34 mL of PBS.\nPellet the cells by centrifugation at 270 × g for 10 min, at room temperature.\nRepeat once, with a 4 min-RBC buffer incubation.\nAfter RBC lysis, resuspend cells in ca. 16 mL dissection buffer and pass them through a 40 μm nylon cell strainer.\nNote: This volume can be adjusted based on the pellet size and the number of falcons that will be used in step 13.\nIsolate a neuron-enriched cell fraction using a Ficoll density gradient for separation.\nAdd 4 mL of a Ficoll-PAQUE:PBS (2:1) mixture to a 15 mL tube.",
    "Critical: The Ficoll-PAQUE:PBS (2:1) mixture should be at room temperature before use.\nGently, add 4 mL of cell suspension on top of the Ficoll-PAQUE:PBS solution.\nCentrifuge at 1,500 × g for 30 min.\nCritical: The centrifuge acceleration and break should be turned off or, if not possible, set to minimum.\nDiscard the upper phase and keep the bottom pellet (Figure 5[href=https://www.wicell.org#fig5]).\nWash the pellet (neuron-enriched cell fraction) with ca. 10 mL of neuron culture medium, twice, centrifuging at 270 × g for 10 min.\nNote: If you want to characterize both isolate fractions by mass spectrometry before culturing, save the upper phase and the pellet, and skip to step 18 (Characterization of the neuron-enriched cell fraction by mass spectrometry proteomics).\nDetermine cell number and viability using 0.1% trypan blue using a hemocytometer. See troubleshooting 3[href=https://www.wicell.org#sec7.5].\nSeed the cells at 200 000 cells/cm2 with 1.8 mL, 400 μL or 50 μL of culture medium per well (6-, 24-, and 96-well PDL-coated plates, respectively; see culture vessel coating[href=https://www.wicell.org#sec1.4]). See troubleshooting 4[href=https://www.wicell.org#sec7.7].\nMaintain cultures at 37°C in a humidified atmosphere of 5% CO2 in air.\nOn the 2nd and 5th day after seeding, change the culture medium.\nPre-warm the culture medium to 37°C in a water bath.\nRemove 50% of the well volume and add equal volume of new culture medium.\nCritical: Since we are working with a neuron-enriched fraction, do not replace the total volume of culture medium, but only 50% of the volume per well, in order to facilitate cell adaptation to the fresh medium.\nSee troubleshooting 5[href=https://www.wicell.org#sec7.9].\nNote: After 5 days, the neuronal network should be established (Figure 6[href=https://www.wicell.org#fig6]) and the cells are ready for further assays, e.g., cell viability using the resazurin reduction assay, metabolomics, and proteomics.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2063-Fig4.jpg",
    "Figure 4. Isolation of the chicken embryo and dissection of its brain\nA sequence of illustrative photos of the different steps of the process are presented.\n(A–D) (A–C) After opening a hole in the eggshell and through the air sack, identify the embryo and transfer it using curved tweezers to a Petri dish placed on ice (D).\n(E–H) Identify the head and dissect the brain. The eye is clearly visible as a large disproportionate darker circle.\n(F) On top of the embryo, above the eye, the brain is transparent round organ.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2063-Fig5.jpg\nFigure 5. Isolation of a neuron-enriched cell fraction after a Ficoll-Paque:PBS density separation\nThe resulting pellet is the neuron-enriched cell fraction, while the white interface corresponds to a neuron-poor cell fraction.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2063-Fig6.jpg\nFigure 6. Development of neurons isolated from chick embryo brain\n(A–E) Cultured neurons were observed daily under 20 × magnification, after A. 1 day, B. 2 days, C. 3 days, D. 4 days, and E. 5 days after plating. Morphological changes occurred during the growth and differentiation process. Scale bar 100 μm.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Embryonic chick brain isolation procedure, related to step 4\nCharacterization of the neuron-enriched cell fraction by mass spectrometry proteomics\nTiming: 2 days\nAfter neuron isolation, the two fractions obtained after a density separation can be characterized by mass spectrometry proteomics. The following filter-aided sample preparation (FASP) protocol (Figure 7[href=https://www.wicell.org#fig7]) was adapted from Carvalho et al. (2020)[href=https://www.wicell.org#bib3]; Wiśniewski (2016)[href=https://www.wicell.org#bib34]; Wiśniewski (2019)[href=https://www.wicell.org#bib35]; Wiśniewski et al. (2009)[href=https://www.wicell.org#bib36].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2063-Fig7.jpg\nFigure 7. FASP protocol used to prepare samples for proteomic analyses",
    "Samples were prepared according to an optimized FASP (Filter Aided Sample Preparation) protocol. Tissues were homogenized in a 0.1 M Tris-HCl pH 7.8 lysis buffer supplemented with 0.05 M DTT, 2% (w/v) SDS and a protease inhibitor cocktail. After sonication and incubation in a water bath, the supernatant protein content was quantified by a 96-well plate Bradford protein assay, and proteins were loaded on a 3, 10, or 30 KDa Amicon® ultra-centrifugation filter, and washed with an 8 M urea solution prepared in 25 mM ammonium bicarbonate. After centrifugation, the retained proteins were alkylated with iodoacetamide, washed, and digested with trypsin. Peptides were eluted and analyZed by high-resolution mass spectrometry. ACN, acetonitrile; DTT, 1,4-dithiothreitol; FA, formic acid; FASP, Filter Aided Sample Preparation; IAA, iodoacetamide; SDS, sodium dodecyl sulfate; Tris-HCl, tris(hydroxymethyl)-aminomethane hydrochloride. Image created with BioRender.com[href=http://BioRender.com].\nMake sure all the solutions are ready, including those that must be prepared fresh (see proteomics protocol[href=https://www.wicell.org#sec2.2]).\nBefore starting the proteomics work, wash the cells with 0.9% NaCl solution.\nAdd 0.9% NaCl solution. Adjust the volume according to the pellet size. Using 3 pellet-volumes of NaCl is usually adequate; for example, use 600 μL of NaCl solution to wash a cell pellet with a size ca. 200 μL.\nPellet the cells by centrifugation at 270 × g for 10 min. Discard the supernatant.\nPause point: If necessary, cells can be stored at this point. Upon the last centrifugation, discard the supernatant and store at −80°C. Samples are stable at −80°C for at least 2 years. Upon thawing, proceed to step 20.\nAdd 400 μL of lysis buffer (0.1 M Tris-HCl pH 7.8, 2% SDS, 0.05 M DTT, and protease inhibitor) to each sample. E.g., 400 μL of lysis buffer to a cell pellet with a size ca. 200 μL.",
    "Note: If necessary, adjust the volume of lysis buffer to avoid low protein concentration. As a general guideline, use 2 pellet-volumes of lysis buffer – for example, 200 μL of lysis buffer to a cell pellet with a size ca. 100 μL, or 100 μL of lysis buffer to a cell pellet with a size ca. 50 μL. If cells are being counted, use 200 μL of lysis buffer to 1.9 M cells.\nSonicate the samples for 2 min, and incubate them at 95°C for 5 min in a water bath.\nAfter cooling to room temperature, centrifuge at 16 000 × g for 10 min.\nCollect the supernatant and quantify their protein content using the Bradford quantification assay, using the Bio-Rad Protein Assay Dye Reagent, following the manufacturer’s protocol, available online[href=http://online].\nNote: It is not possible to use BCA (bicinchoninic acid) assay due to the DTT content of the lysis buffer.\nLoad the intended volume of protein solution into a regenerated cellulose membrane Amicon® ultra-centrifugal filter with a 3 kDa molecular weight cutoff (previously washed with water).\nNote: The membrane molecular cut-off can be adjusted to the proteins of interest.\nCritical: Filter membranes should be of regenerated cellulose or equivalent to minimize losses due to protein adsorption.\nCentrifuge the Amicon® at 12 000 × g for 30 min at 20°C.\nDiscard the eluate and wash the retained protein with 200 μL of an 8 M urea solution prepared in 25 mM ammonium bicarbonate (urea base buffer).\nCentrifuge at 12 000 × g for 30 min at 20°C.\nDiscard the eluate and alkylate the retained protein with 100 μL of 50 mM iodoacetamide in 8 M urea and 25 mM ammonium bicarbonate solution.\nIncubate for 20 min in the dark.\nCentrifuge at 12 000 × g for 30 min at 20°C.",
    "Discard the eluate and wash twice the retained proteins with 200 μL of a 25 mM ammonium bicarbonate solution.\nTransfer the membrane to a new centrifuge microtube.\nAdd 100 μL of a trypsin solution prepared in 12.5 mM ammonium bicarbonate buffer to each sample. Protease/total protein ratio should be 1 μg of trypsin per 30 μg of total protein content.\nNote: Other peptidases can be used.\nDigest the proteins, overnight (ca. 16 h), at 37°C.\nSonicate for 2 min, and centrifuge at 12 000 × g for 30 min at 20°C.\nNote: Do not discard the eluate. Keep it in the collection tube for the following steps.\nAdd 50 μL of a 3% (v/v) acetonitrile in water containing 0.1% (v/v) formic acid to the membrane to elute the remaining peptides by centrifugation at 12 000 × g for 30 min at 20°C. Repeat this step once more.\nNote: Do not discard the eluate.\nCollect the eluates from the last two steps (steps 35 and 36) (following the overnight digestion) and analyze by UHPLC-ESI-HRMS or store at −80°C until analysis. Analysis parameters are detailed in SI. See troubleshooting 6[href=https://www.wicell.org#sec7.11].\nCharacterization of the neuron-enriched cell fraction by cell staining\nTiming: 1 h\nNeurons can also be characterized by conventional microscopy staining techniques. At least three different staining procedures can be applied: Hematoxylin and Eosin Staining, toluidine blue staining, and Congo red staining (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2063-Fig8.jpg\nFigure 8. Microscopy images of neurons cultured for 5 days\nDifferent staining dyes were used to identify cell components.\n(A) Cells were stained with Mayer’s Hematoxylin and Eosin Staining (H&E). Hematoxylin stains cell nuclei in blue, while eosin stains cytoplasm in pink.",
    "(B) Toluidine blue staining has a high affinity for the acidic components of neuronal cells, especially the Nissl bodies. In figure B, neurons display a visible cytoplasm around the nucleus (a) and, in some large pyramidal neurons, two nucleoli (b).\n(C) Cells were stained with Congo red, which has a high affinity to fibril proteins. In figure C, some amyloid aggregates (or neurofibrillary tangles) (c) became evident after staining. Cells were observed under 20 ×, 40 × or 100 × magnification, as indicated in each panel. The insets correspond to the dashed areas and were filtered for color enhancement.\nOn the 5th day of culture maintenance, fix the cells with 4% paraformaldehyde (dissolved in PBS) for 30 min at 4°C.\nNote: Despite having been performed on the 5th day of cell maintenance, staining can be applied at any time after complete cell adhesion. Cells became adherent around 4–8 h after being seeded.\nWash the cells with water 3 times.\nApply the intended staining.\nMayer’s Hematoxylin and Eosin Staining (H&E) (adapted from Patton et al. (2011)[href=https://www.wicell.org#bib17]) (Figure 8[href=https://www.wicell.org#fig8]A):\nCover the cells with Mayer’s hematoxylin solution for 8 min.\nDifferentiate the cells with 1% acid ethanol for 30 s.\nRinse with saturated lithium carbonate solution for 30 s.\nRinse with water.\nDehydrate with 95% ethanol – dip the cells for 1 or 2 s in 95% ethanol and let all the ethanol drain and evaporate. Repeat the procedure 10 times.\nApply eosin Y for 5 min and wash with water.\nToluidine blue staining (adapted from García-Cabezas et al. (2016)[href=https://www.wicell.org#bib8] and Mohd Lazaldin et al. (2020)[href=https://www.wicell.org#bib16]) (Figure 8[href=https://www.wicell.org#fig8]B):\nCover the cells with toluidine blue solution for 5 min.\nRinse with water.\nDifferentiate with 70% ethanol.\nRinse with water.\nCongo red staining (CR) (adapted from Song et al. (2018)[href=https://www.wicell.org#bib28]) (Figure 8[href=https://www.wicell.org#fig8]C):",
    "Cover the cells with Congo red solution for 20 min.\nRinse with water.\nDifferentiate with alkaline alcohol solution.\nRinse with water.\nObserve the stained cells under the microscope."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Microscopy",
    "Proteomics",
    "Cell Culture",
    "Mass Spectrometry",
    "Cell Biology",
    "Cell-Based Assays",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}