{
  "id": 18821,
  "origin_website": "Jove",
  "title": "Detergent-assisted Reconstitution of Recombinant Drosophila Atlastin into Liposomes for Lipid-mixing Assays",
  "procedures": [
    "1. Purification of GST-DAtl-His8\nProtein expression and lysate preparation\nTransform BL21 (DE3) E. coli with the GST-DAtl-His8 construct in pGEX4-T32 and select on an ampicillin plate.\nSelect a single transformant and inoculate 5 mL of LB + ampicillin (5 µL of 100 mg/mL ampicillin) in a 14 mL culture tube and incubate at 25 °C with shaking at 200 rpm for 6-8 h.\nNOTE: Due to leaky expression, it is not recommended to incubate at higher temperatures. Growth at 25 °C reduces aggregation of protein during this growth period.\nInoculate 200 mL of LB + ampicillin with 1 mL of the 5 mL culture and incubate overnight (~15–18 h) at 25 °C.\nThe next morning, harvest the cells by centrifugation (2,000 x g for 10 min) and resuspend in 5 mL of LB.\nInoculate 4 L of LB + ampicillin and measure OD600 (0.05–0.15). Incubate at 25 °C with shaking.\nNOTE: Reserve some media to serve as a blank for the OD600 measurements before adding bacteria.\nMeasure OD600 every hour until it reaches an OD between 0.4–0.5. At this point, reduce the temperature to 16 °C.\nInduce with 0.2 mM IPTG (800 µL of 1 M stock), 10 min after the incubator reaches 16 °C. Incubate overnight (~15–18 h) at 16 °C.\nNOTE: The lower temperature improves the yield of functional protein by reducing aggregation of atlastin.\nThe next morning, harvest the cells by centrifuging at 7,500 x g at 4 °C.\nResuspend the cells in 200 mL of A200 (25 mM HEPES (pH 7.4) and 200 mM KCl).\nCentrifuge the cells at 11,000 x g for 5 min at 4 °C.",
    "Resuspend the pellet in 40 mL of breaking buffer (A200 plus 10% glycerol, 2 mM 2-mercaptoethanol, 4% Triton X-100 (TX100), 40mM imidazole, and one EDTA-free protease inhibitor cocktail tablet).\nNOTE: Add TX-100 after resuspending to avoid generating bubbles and foam.\nPass through an 18 G needle and run the cells through a cell disrupter three times at ~10,000 psi.\nCentrifuge the extract at 125,000 x g for 1 h.\nNOTE: Optionally dissolve the pellet 1:2 (w:v) in 8 M Urea and nutate at room temperature overnight. Urea as a denaturant will dissolve slowly any insoluble pelleted protein for SDS-PAGE analysis. Save 1 μL for SDS-PAGE and Coomassie stain analysis.\nFilter the extract through a 0.45 µm cellulose nitrate sterile membrane filter to remove bacteria and large bacterial debris.\n\t\tNOTE: Optionally, save 1 μL for SDS PAGE and Coomassie stain analysis.\nProtein purification by affinity chromatography\nLoad the filtered lysate onto an immobilized metal affinity chromatography (IMAC) resin column charged with Ni2+, pre-equilibrated with low imidazole buffer (A100 plus 10% glycerol, 2 mM 2-mercaptoethanol, 1% TX-100, 40 mM imidazole) at a rate of 1 mL/min at 4 °C.\nWash the column with 25 mL of A100 plus 10% glycerol, 2 mM 2-mercaptoethanol, 0.1% Anapoe X-100, 40 mM imidazole with a rate of 1 mL/min at 4°C. Elute the protein with a 30 mL linear gradient of imidazole from 40 mM to 500 mM, and a final 5 mL wash at 500 mM.\nPool together peak fractions and incubate for 1 h at 4 °C with swollen GSH-Agarose beads, previously swollen in water and equilibrated in A100 with 10% glycerol, 2 mM 2-mercaptoethanol, 0.1% Anapoe X-100, and 1 mM EDTA.",
    "NOTE: GSH-Agarose beads can be swollen in 50 mL of water the day before and incubated overnight at 4 °C, or for 1 h at RT. To remove water and equilibration buffer, centrifuge in a swinging bucket rotor at 500 x g for 1 min without brake. Aspirate the supernatant with a 26 G needle.\nPellet GSH-Agarose beads by centrifuging in a swinging bucket rotor at 500 x g without brake and remove the lysate supernatant by aspiration with a 26 G needle.\nTransfer the beads to a 10 mL polyprep column and wash five times with 5 mL of equilibration buffer (A100 with 10% glycerol, 2 mM 2-mercaptoethanol, 0.1% Anapoe X-100, and 1 mM EDTA) by centrifuging at 500 x g.\nElute the protein with 1–1.5 mL of equilibration buffer supplemented with 10 mM reduced glutathione. Aliquot eluted protein and flash freeze in liquid nitrogen. Protein can be stored at -80 °C indefinitely.\nNOTE: Adjust pH of elution buffer to 7.4.\nQuantify protein concentration by amido black protein assay9 and assess purity by SDS-PAGE and Coomassie staining.\n2. Reconstitution of Recombinant Atlastin into Liposomes\nLiposome production by extrusion method10\nMake lipid mix stocks in chloroform (10 mM total lipid). The necessary lipids are 1-palmitoyl-2-oleoyl-glycero-3-phosphocholine (POPC), 1,2-dioleoyl-sn-glycero-3-phospho-L-serine (DOPS), 1,2-dioleoyl-sn-glycero-3-phosphoethanolamine-N-(7-nitro-2-1,3-benzoxadiazol-4-yl) (NBD-DPPE), and 1,2-dipalmitoyl-sn-glycero-3-phosphoethanolamine-N-(lissamine rhodamine B sulfonyl) (Rh-DPPE). Acceptor liposomes consist of POPC: DOPS (85:15 molar ratio) and donor liposomes of POPC:DOPS:Rh-PE:NBD-PE (83:15:1.5:1.5 molar ratio).\nNOTE: While POPC:DOPS lipid mixes have been traditionally used for in vitro lipid mixing assays, alternative lipid compositions may be adapted for different experimental purposes. POPC:DOPS liposomes are very stable and harder to fuse, therefore is a very stringent system for fusion.",
    "Add 1 μCi/mL of L-α-dipalmitoyl-phosphatidylcholine (choline methyl-3H) to lipid mixes in order to determine lipid concentrations at later steps by liquid scintillation counting. Reserve at least 8 μL of this stock.\nTransfer desired amount of lipid mixes to flint glass tubes.\nDry the lipid mixes under a gentle stream of N2 gas for ~10 min until no more chloroform is visible.\nDry the lipid film further in a desiccator by vacuuming for 30 min.\nAdd enough aqueous A100 with 10% glycerol, 2 mM 2-mercaptoethanol, and 1 mM EDTA to the lipid film and bring back the concentration to 10 mM. Resuspend the lipid film by vortexing lightly for 15 min at room temperature. A vortexer that can accommodate flint glass tubes is recommended.\nFreeze-thaw the hydrated lipids in liquid nitrogen ten times. After freezing in liquid nitrogen, thaw the liposomes by letting the solution sit at room temperature for 30 s, then transfer to water for faster thawing. This freeze-thaw cycling will minimize multilamellar vesicles.\nCAUTION: Tubes may crack if they contain volumes larger than 0.5 mL and if they are transferred directly form liquid nitrogen to water.\nPass the lipid through polycarbonate filters with 100 nm pore size 19 times using mini-extruder.\nDetermining total lipid concentration of liposomes by scintillation counting\nNOTE: Some of the lipid may be left behind in glass tubes and in mini-extruder.\n\t\t\nAdd 4 μL of lipid stock and liposomes in 3 mL of scintillation cocktail.\nMeasure average counts per minute (CPMA) for stock and liposomes. And calculate liposomes concentration with the following formula: imgsrc://cloudfront.jove.com/files/ftp_upload/59867/59867equ01.jpg\nStore the liposomes at 4 °C for up to a week. Longer storage is not recommended as liposomes might aggregate with time, decreasing reconstitution efficiencies.\nReconstitution by detergent assisted incorporation into preformed liposomes",
    "Calculate the amount of buffer, protein, liposomes and extra detergent to be mixed together:\n\t\t\nDetermine the desired total volume. This volume is made up of buffer A100 with 10% glycerol, 2 mM 2-mercaptoethanol, and 1 mM EDTA. Volumes less than 250 μL do not mix well in 0.5 mL microcentrifuge tubes.\nCalculate the volume of liposomes needed to give a final lipid concentration of about 1 mM. Subtract the volume from the buffer volume.\nCalculate the volume of protein needed to give the desired protein to lipid molar ratio (usually 1:400). Decrease the buffer volume accordingly.\nDetermine how much extra detergent needs to be added to saturate the liposomes aiming for an effective detergent to lipid ratio (Reff) between 0.64–0.8. Remember to consider the detergent that is added with the protein. The (Reff) is determined by the equation imgsrc://cloudfront.jove.com/files/ftp_upload/59867/59867equ02.jpg Dtotal is the total detergent concentration and Dwater is the monomeric detergent concentration (0.18 mM for TX-100 and Anapoe X-100 in the presence of detergent)4,11.\nMix the solutions together in a 0.5 mL tube in the following order: buffer, detergent, protein, and liposomes. Add the liposomes rapidly and vortex immediately for 5 s to homogenize the mixture.\nIncubate the reaction in a nutator for 1 h at 4 °C.\nMake 0.2 g/mL nonpolar polystyrene adsorbent bead “slurry” in water.\nNOTE: Make the polystyrene adsorbent bead “slurry” during previous the 1 h incubation in step 2.2.3.\nWeigh out 0.2 g of polystyrene adsorbent beads and transfer to a microcentrifuge tube.\nDegas the beads by adding 1 mL of methanol to the tube and mix for 1 min. Degassed beads will sink.",
    "Aspirate the methanol and add water to the beads. Let the beads mix with water for 5 min, then aspirate the water. Repeat four times, then bring the polystyrene adsorbent bead “slurry” to 1 mL volume with water and a final concentration of 0.2 g/mL.\nNOTE: Beads should still settle to the bottom of the tube. If they do not, degas again. Use a 21 G or higher needle to aspirate methanol and water from beads. \nCalculate the amount of polystyrene adsorbent beads needed to absorb all the detergent in each sample. 1 g of polystyrene adsorbent beads absorbs 70 mg of TX-100. To calculate the volume of polystyrene adsorbent bead slurry needed for each reaction, divide the total detergent in the reaction (step 2.2.1.4) by 70 mg, and then by the concentration of the bead slurry (0.2 g/mL (step 2.2.7).\nTransfer calculated amount of polystyrene adsorbent bead slurry to a 0.5 mL tube and aspirate the water.\nNOTE: Cut the end of a 20–200 µL tip to transfer the beads, vortex the tube just prior to pipetting to resuspend settled beads.\nAdd the samples to the 0.5 mL tube containing polystyrene adsorbent beads and incubate the sample nutating for 1 h at 4 °C.\nRepeat twice leaving old beads behind and transferring the sample to fresh beads.\nAdd the sample to a fourth tube with fresh beads and incubate overnight (~15–18 h) at 4 °C.\nIn the morning, remove the sample from polystyrene adsorbent beads and pellet insoluble protein aggregates by centrifuging for 10 min at 16,000 x g at 4 °C.\nRecover the supernatant and determine the final lipid concentration by liquid scintillation counting (see step 2.1.9.2). Optionally, protein concentration may be determined by amido black protein assay9.",
    "NOTE: For atlastin proteoliposomes, enzymatic assays should be performed with fresh liposomes. Long storage at 4 °C or freezing leads to significant loss in atlastin activity.\n3. Lipid Mixing Assays\nBring the donor and acceptor proteoliposomes to a concentration of 0.15 mM each in A100 with 10% glycerol, 2 mM β-mercaptoethanol, 1 mM EDTA and 5 mM MgCl2. Each reaction (50 μL) should be added to a well in a flat white 96 well plate suitable for fluorescence readings. Prepare at least 4 reactions including a triplicate, and a no-GTP negative control.\nPlace the plate in a preheated plate reader at 37 °C. Measure NBD fluorescence (excitation 460 nm and emission 535 nm) for 5 min every min.\nInduce fusion by adding 5 mM GTP (5 μL of 50 mM GTP).\nMeasure NBD fluorescence every minute for 1 h.\nAdd 5 μL of 2.5% w/v n-Dodecyl β-D-maltoside to dissolve the proteoliposomes and measure the maximum NBD fluorescence. Read NBD fluorescence for 15 min every min.\n4. Liposome Floatation on Iohexol Discontinuous Gradient12\n(optional) Analyze the efficiency of reconstitution by floatation assays13.\nPrepare an 80% and a 30% w/v iohexol in A100 with 10% glycerol, 2 mM 2-mercaptoethanol, and 1 mM EDTA. Iohexol does not dissolve readily, so this must be prepared a day before by nutating overnight at 4 °C.\nThoroughly mix 150 μL of 80% iohexol stock with 150 μL of proteoliposomes sample to bring it to a 40% iohexol. Add this to a 5 x 41 mm2 Ultra-clear tube avoiding bubbles.\nLayer 250 μL of 30% iohexol stock slowly on top of the sample to make a middle layer. Avoid any bubbles and disturbing the bottom layer. On top of the middle layer, slowly add 50 μL of A100 with 2 mM 2-mercaptoethanol and 1 mM EDTA.",
    "Centrifuge the gradient in a swinging bucket rotor at 220,000 x g for 4 h at 4 °C with slow acceleration and no break.\nHarvest the layers of the gradient and analyze by SDS-PAGE and Coomassie stain, quantification may be done by densitometry. Reconstituted protein should float to the top layer, while protein and lipid aggregates will sediment at the bottom or in the middle layer.\n5. Analysis of Orientation of Reconstituted Protein by Thrombin Proteolysis\nNOTE: The atlastin construct reported here has a thrombin cut site between the end of the N-terminal GST tag and the beginning of atlastin. Atlastin in the correct orientation will have this cut site accessible to the protease, while protein in the wrong orientation will be protected by the lipid bilayer.\nTo assay atlastin proteoliposome orientation, reserve at least 8 μL of fresh reconstituted proteoliposomes.\nAdd 8 μL of proteoliposomes and 1 μL of 1 U/μL thrombin. Incubate at 37 °C for 1 h.\nQuench the protease with 1 μL of 5 mg/mL of EDTA-free protease inhibitor cocktail and incubate for 30 min at 37 °C.\nAnalyze the sample by SDS-PAGE and Coomassie stain. Proportion of cleaved and uncleaved protein may be determined by densitometry.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}