{
  "id": 14444,
  "origin_website": "Jove",
  "title": "Corticospinal Excitability Modulation During Action Observation",
  "procedures": [
    "1. Preparation of the Video Stimuli\nCommission a model to perform four action sequences.\n\t\nIn the first two action sequences, seat the model at a table facing the camera. Place three mugs on the table near to her and a fourth one further away on the other side of the table in the foreground. Instruct the model to start her action by reaching towards and grasping a sugar spoon.\nInstruct the model to start her action by pouring sugar into the three mugs. When she has finished pouring sugar into the third mug, instruct the model to move her wrist as if she intends to pour sugar into the 4th one as well.\nInstruct the model to start her action by pouring sugar into the three mugs. When she has finished pouring sugar into the third mug, have the model move her wrist to bring it back to its original position.\nIn the last two action sequences, seat the model once again at a table facing the camera. Place three espresso coffee cups on the table near to her and a fourth one further away from her on other side of the table in the foreground. Instruct the model to start her action by reaching towards and grasping a thermos.\nInstruct the model to start her action by pouring coffee into the three espresso coffee cups. When she has finished pouring coffee into the third cup, have the model move her wrist as if she intends to pour coffee into the fourth cup as well.\nInstruct the model to start her action by pouring coffee into the three espresso coffee cups. When she has finished pouring coffee into the third cup, have the model move her wrist to bring it back to its original position.",
    "Instruct the model to pick up and hold the sugar spoon using a precision grip (PG; i.e. the opposition of the thumb with the index finger) and to pick up and hold the thermos in a natural way using a whole-hand grasp (WHG; i.e. the opposition of the thumb with the other fingers).\nAt the beginning of each video-clip, instruct the model to show that her hand is in a prone position resting on the table.\n\t\nArrange for the model to begin a reach-to-grasp movement approximately 900 msec later.\nArrange for the model's fingers to make contact with the first object approximately 450 msec later.\nHave the model begin to move her hand to perform the second action step 5,000 msec later.\nUse a digitizing technique to perform a post-hoc kinematic analysis of the model's movements\n\t\nMark each movement, frame by frame, by manually assigning a marker to the model's wrist.\nTrack the model's movements. Pinpoint the Trajectory Deviation: the moment when the hand trajectory begins to diversify for social and nonsocial conditions. Lock the most salient kinematic events characterizing the action sequence with TMS stimulation timing.\n2. Instrument Preparation\nConnect four sintered Ag/AgCl bipolar and one monopolar surface electrodes (15 kΩ, 1.5 mm touch-proof safety socket) with a sensor area (9 mm diameter) to an isolated portable ExG input box linked to the main EMG amplifier. A twin fiber optic cable for signal transmission is recommended, but not compulsory.\nManage a script for individual resting motor threshold (rMT) assessment, presentation of video stimuli and TMS stimulation synchronized with EMG registration by E-Prime presentation software running on a PC with a monitor (resolution 1,280 x 1,024 pixels, refresh frequency 75 Hz, background luminance of 0.5 cd/m2) set at eye level.",
    "Attain an animation effect by selecting a series of single frames (30 msec each, 30 fps) and the first and last frames lasting, respectively, 500 and 1,000 msec.\n3. Participant Recruitment\nRecruit only right handed participants with normal or corrected-to-normal vision. Check for handedness using the Standard Handedness Inventory questionnaire31.\nVerify if any of the candidates have contraindications to TMS32,33.\n\t\nExclude subjects with higher than normal seizure risk (based on personal/family history of epilepsy, neurosurgery, brain injury) or receiving neuroactive medication in view of the fact that the principal known health risk of TMS is seizure induction.\nExclude pregnant women as the risks of TMS to an unborn fetus are unknown.\nGive basic information about the study to all the participants and ask them to sign written informed consent forms.\nPossibly perform experiments in a sound-attenuated Faraday room: this is recommended, but not compulsory.\nHave the participant sit in a comfortable armchair.\nPosition his/her right arm on a full arm-support.\nFix the participant's head on a head rest. Eye distance from the screen should be determined on the basis of the size of the stimulus presentation.\nAsk the participant to remove all metal objects (earrings, necklaces, etc.) and objects sensitive to magnetic fields (mobile phones, credit cards) as the rapid rate of change of current in the coil is capable of inducing a changing magnetic field.\nInstruct the participants to watch the visual stimuli carefully and to maintain a good level of attention; explain that they will be questioned later about the contents.\n4. TMS Stimulation and MEP Recording",
    "Determine where the electrodes should be positioned over the ADM and the FDI muscles by palpation during maximum voluntary muscle activation. Clean the skin for all electrode locations (also for the ground). Apply an abrasive skin prepping gel to the entire site using a gauze pad. Rub it into the skin lightly and remove any excess with a clean gauze pad.\nPlace two surface electrodes, each containing a small amount of water soluble EEG conductive paste, over each muscle and attach them to the skin using self-adhering pads.\n\t\nPerform a belly-tendon montage by placing the active electrodes over the muscle bellies of the right ADM and FDI and the reference electrodes over the ipsilateral metacarpophalangeal joint. Attach a single ground electrode containing conductive paste on the participant's left wrist.\nConnect the electrodes to the common input of the ExG input box and check impedance values. In the event they are above the threshold (>5 Ω), prepare the skin again.\nDeliver single-pulse TMS to the scalp overlying the left primary motor cortex (M1) corresponding to the hand region using a 70 mm figure-of-eight coil connected to a Magstim 200 stimulator.",
    "Note: A basic TMS stimulator is composed by a power source, an energy storage element and a high-power switch precisely controlled by a processor that accepts control input from the equipment operator. The fundamental operating mechanism of a TMS stimulator is to create a changing magnetic field that can induce a current in adjacent conductive material (such as cortical tissue). Tissue stimulation is provoked by inducing a current of sufficient density in the tissue, which is proportional to the time rate of change of the magnetic flux density34. With a figure-of-eight coil, the isopotential lines of the induced electric field form an oval, whose long axis is parallel to the direction of current flow at the coil junction35.\n\t\n\t\tPlace the coil at a 45° angle with respect to the interhemispheric fissure and position it perpendicularly with respect to the central sulcus: the lowest motor threshold is achieved when the induced electric current in the brain is flowing approximately perpendicular to the central sulcus36,37.\nHave the handle pointing laterally and caudally to induce a posterior-anterior brain current through the precentral gyrus38. At low, but supra-threshold, stimulation intensities, the TMS-induced current excites preferentially axons of interneurons which project directly or indirectly on corticospinal neurons. Both inhibitory and excitatory synapses are activated, but at such stimulation intensities the net effect is that of an excitatory post-synaptic potential in corticospinal neurons.\nLocate the optimal scalp position (OSP) over the pars opercularis of the inferior frontal gyrus. Stimuli of a slightly suprathreshold intensity on the OSP invariably produce the highest levels of MEP activity from the contralateral ADM and FDI muscles.",
    "Use a 10-20 International System (the stimulated site corresponding to the C3 location) to establish the OSP for eliciting motor-evoked potentials (MEPs) in the hand muscles, then move the intersection of the coil in approximately 0.5 cm steps around the target area and deliver TMS pulses at constant intensity.\nAfter the target area has been correctly identified, stabilize the coil using a mechanical support to maintain consistent positioning.\nUse a neuronavigation system to maintain constant coil-positioning throughout the entire experiment and prevent any bias due to small movements of the participant's head during data collection.\n\t\nApply passive spherical markers both on the coil and on the participant's head.\nRecord marker positions using an optical digitizer in order to reproduce them on the computer screen.\nDetect any difference in spatial coil location and orientation and adopt a tolerance of 2-3 mm for each of the Cartesian coordinates.\nUtilize three-dimensional online information with regard to the initial and actual coil placements to allow for the exact repositioning of the TMS coil in real time during the experimental session, when needed.\nTo determine the \"individual resting motor threshold\" (rMT) for each participant on the OSP, detect the minimum stimulation intensity necessary to produce reliable MEPs (≥50 μV peak-to-peak amplitude) in a relaxed muscle in five out of ten consecutive trials. Determine the OSP and the rMT for the higher threshold muscle to avoid the loss of any differential modulations involving the less excitable muscle.\nKeep the stimulation intensity at a fixed value (i.e. 110% of the rMT) during the entire recording session.\nUse a bandpass filter (20 Hz-1 kHz) to record the raw myographic signals. After amplification digitize the signals (5 kHz sampling rate) and store in the computer for offline analysis.",
    "Record 10 MEPs while the participant passively watches a white-colored fixation cross on a black background on the computer screen at the beginning of the experimental session.\nRecord 10 more MEPs at the end of the experimental session.\nRecord EMG data from the right ADM and FDI muscles after the TMS pulse at one of the five possible time points (Figure 1) and that is:\n\t\nWhen the model's hand first makes contact with the sugar spoon or the thermos (T1).\nWhen the model finishes pouring sugar/coffee into the third cup/mug (T2).\nWhen the model begins to pull her hand away from the third cup/mug (T3).\nWhen the model's arm begins to return to the starting position or starts moving towards the fourth cup/mug (respectively, the nonsocial and social conditions) (T4).\nWhen the model's arm returns to the starting point or when it reaches the fourth cup/mug (respectively, the nonsocial and social conditions) (T5).\nInsert a 10 sec rest interval between the videos. Have a message appear during the first five seconds of the rest interval reminding the participants to keep their hands resting quietly and fully relaxed. Once the message disappears arrange for a fixation cross to appear for the remaining five seconds.\n5. Debriefing\nProvide the participants with detailed information about the experimental design at the end of the session.\n6. Data Analysis\nPerform a post-hoc kinematical analysis.\n\t\nSet a frame of reference identifying x- and y-axes as horizontal and vertical directions and analyze the video sample frame-by-frame.\nUse a known length in the camera's field of view and in the movement's plane as the reference unit measurement.\nAssign a marker to the model's wrist to measure arm kinematics.",
    "Define the starting position as the time the model's right hand is resting in a prone position on the table. Track the wrist trajectory in space and time, extract the trajectory path, and identify the salient kinematic events characterizing the model's double-step action.\nAnalyze EMG data.\n\t\nSegment the EMG tracing for each muscle into different segments (epochs) of the same length relative to a reference marker (TMS stimulus). Set the time window at 100 msec before TMS pulses are delivered and 200 msec after TMS pulses. This will allow you to check for possible background activity.\nIn each channel of the EMG select a precise range of a time frame (e.g. 10-40 msec) to search for peaks in all the segments.\nApply an algorithm which take into account the positive and negative peaks within each segment and calculate the maximum amplitude of the EMG curve in μV from peak to peak.\nEliminate trials with background EMG activity greater than 100 µV to avoid contaminating MEP measurements by background activity.\nCalculate the average peak-to-peak MEP amplitudes separately from the ADM and FDI muscles for each condition excluding those deviating more than 2 standard deviations from the mean (outliers).\nCompare the two series of MEP amplitudes recorded from each muscle in each participant during the fixation cross baseline trials at the beginning and at the end of the experimental session to check for corticospinal excitability variations related to TMS per se. The average amplitude of the two series also allow to set the individual baseline value for data normalization procedures in each muscle separately39.\nCompute ratio values using the participant's individual baseline value (MEP ratio = MEPobtained/MEPbaseline) 39."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}