{
  "id": 6336,
  "origin_website": "Bio",
  "title": "Blinded Visual Scoring of Images Using the Freely-available Software Blinder",
  "procedures": [
    "Acquire images of specimen to be scoredIn this example, images were acquired by scanning with a 488 nm laser at 1 mW power with 100 ms exposure. Body wall muscle was imaged in the posterior region, just anterior to the tail, in order to avoid confounding autofluorescence from the intestine. 21 images were taken beginning at -15 µm relative Z at 0.5 µm intervals (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181129/20181129013822_7717.jpgFigure 1. Representative confocal stack (0.5 µm slices) of 8-day adult C. elegans nematodes expressing GFP in the mitochondria of body wall muscle. Slices are numbered according to position in the stack. Body wall muscle mitochondria appear clearly in a large upper portion of the image in slices 5-12 and are also present along the lower edge in slices 13-21.Process images to obtain a single, isolated and clearly distinguishable image for each specimenIn our study, we used FIJI to generate maximal intensity Z-projections for the confocal stacks and to crop images to display body wall muscle from a single animal (Figure 2). Z-projections were created by opening all images as a stack, then choosing Image, Stacks, Z-project. In the dialog box, we selected all slices and the projection type “Max Intensity.”imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181129/20181129015705_7959.jpgFigure 2. Representative cropped Z-projection from confocal stack displayed in Figure 1. Max intensity was used for the Z-projection type. Decide upon an appropriate scoring system for your specimens/phenotypeHere, we created a 1-5 scoring system to classify age-related degeneration of mitochondria. In this system, mitochondria with a relatively ‘healthy’ score of 1 showed abundant, networked mitochondria with no “blebs” (large, bright GFP structures) and no spaces between mitochondria (breaks in the network). As the scores increased from 1 to 4, mitochondria become increasingly more fragmented (breaks in the network), sparse, and blebbed.",
    "Finally, a score of 5 represents the absence of mitochondria in the muscle region imaged (shown in Figure 3, the example for score 5 shows only autofluorescence). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181129/20181129015728_1670.jpgFigure 3. Scoring system for mitochondrial networks in C. elegans body wall muscle. Scores range from healthy (score 1) to severely degenerated (scores 4-5) phenotypes that arise as animals age (adapted from Hartman et al., 2018). Load images into Blinder software: “Add Groups of Images”. Click on “Add Group” to add images from each treatment group. Define Quality Control parameters. Select how many images (% of total images) you would like to have repeated to ensure that scoring is consistent with multiple queries. See “Notes” for suggestions on best practices for quality control. Define within the software the scoring system developed in Step 3. It is a good idea to include both a numerical value for each category (i.e., 1-5 in our case) and a short description of the selection criteria to remind the user what defines a category. This scoring system can be saved for future use using the “Save” button. Score your images! Images will be presented randomly to the user, who can assign a score either by using the keyboard (typing the number or letter that begins each score will automatically fill in the dropdown menu) or by selecting the score in the drop-down menu with the mouse (see screenshot in Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181129/20181129015753_9396.jpgFigure 4. Screenshot demonstrating selection of score for a randomly displayed image. Note that the progress through the image set is shown at the top of the screen (75/170 in this case), and the user has the option to go back to the previous image if an incorrect score is mistakenly assigned.",
    "Browse your results in the Summary and Quality Control windows within the software (see screenshots in Figure 5). The results can then be exported in a .csv format using the “Save Results” button. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181129/20181129015812_8125.jpgFigure 5. Screenshot of results. Panel A shows the summary indicating the number of images from each unblinded group (in this case, Control and Exercise) in each scoring category. Panel B gives the raw results indicating the score for each file (given as a full path). Panel C shows the results of the quality control, or repeated images. Red arrows highlight images with failed quality control (mismatched scores). See Notes section for tips if scoring fails quality control."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}