{
  "id": 9437,
  "origin_website": "Jove",
  "title": "Motor Nerve Transection and Time-lapse Imaging of Glial Cell Behaviors in Live Zebrafish",
  "procedures": [
    "1. Preparation and Mounting of Zebrafish Embryos for Ablation and Live Imaging\nPrepare a stock of 0.8% low melt agarose in egg water. Aliquot into 13X 100 mm disposable culture tubes and store at 4 °C until needed.\nCross adult zebrafish containing stably integrated transgenes to fluorescently label motor neurons and glial cell types of interest. Collect zebrafish embryos in egg water and place in 28.5 °C incubator for correct staging later 3.\nAt approximately 24 hr post fertilization (hpf), remove egg water and add 0.002% 1-phenyl 2-thiourea (PTU) in egg water. Return embryos to the incubator.\nBetween 24 and 96 hpf, embryos should be screened for the presence of desired transgenes on a fluorescent dissecting scope. Place selected embryos in fresh PTU egg water and return to the incubator.\nWhen larvae have reached 6 days post fertilization (dpf) (or desired age), remove them from the incubator, select a few larvae for mounting, and transfer them to a smaller dish.\nRemove the water from the dish and immediately replace with approximately 0.02% Tricane in PTU egg water. Allow larvae to sit in anesthetic approximately 5 min.\nPlace an aliquot of 0.8% low melt agarose in a beaker with tap water and microwave for 30 sec, or until the agarose is melted. Allow the beaker to cool until the agarose in the culture tube feels lukewarm to the touch (not hot).\nSelect an anesthetized larva and transfer it to a single or multi-well 35 mm glass bottom dish. Remove any water that was transferred with the larva, then immediately cover the larva with enough warm agarose to fill the glass-bottomed portion of the dish but not create a large dome.",
    "As the agarose hardens, use a dissecting needle to position the larva on its side at the bottom of the dish, then tilt the larva just slightly on its back. It is imperative for injury and subsequent imaging, that the mounted larva be touching the glass on the bottom of the dish. Use the dissecting needle to maintain the larva in this position until the agarose is solidified and the larva is immobilized.\nOnce the agarose is fully hardened, slowly pipette enough Tricane water (this can be the same Tricane used for anesthesia) into the dish to completely cover the agarose and larva.\n2. Laser Calibration and Testing\nTurn on all confocal microscope instrumentation, appropriate diode lasers for exciting zebrafish transgenes, and the nitrogen-pumped dye laser. Be sure the \"blank\" beam splitter is in place, the laser attenuator is fully open, and the 435 nm Coumarin dye cell is in place. On the computer, open imaging software.\nMove a 63x 1.2NA water immersion objective into position and apply a small drop of immersion medium for water objectives onto the objective. A 63x objective will allow for good laser ablation accuracy, and water immersion allows for a larger working distance, which is necessary when working with 6-7 dpf zebrafish larvae.\nObtain a glass slide with one mirrored side to use for calibration of the laser. Place the slide, mirror side down, onto the microscope stage.",
    "Using the eyepiece under brightfield illumination, find and focus on a scratch or etch in the mirror. The brightfield light will be shining down onto the glass slide, but will only pass through to the objective in places where the mirror has been scratched or etched away, causing the mirror to look black through the eyepiece, and the etchings to look like spots or lines of light.\nView and focus the etchings on the computer screen using imaging software. Open the window that controls the laser calibration and power settings. Set the number of pulses to \"1\" and the attenuation plate to \"3\" % transmission. The number of pulses represents the number of times the laser will fire within each region of interest (ROI) and the % transmission represents the laser power. Be sure the correct calibration setting is selected for the 63x 1.2NA water immersion objective.\nSelect the ellipse tool from the main toolbar, and click the image on the computer screen to create a single circular ROI. Do this 3 more times until there are 4 circular ROIs spaced randomly over the image.\nSome systems may include a safety feature that will not allow the laser to fire if the light path to the oculars is open. If this is the case, manually close the light path to the oculars at this time.",
    "Fire the laser. This will create 4 small spot etchings, 1 within each circular ROI. If the laser does not fire, check to be sure the laser is turned on and connected properly, and that the light path to the oculars is closed. If the laser fires but no etching is seen, check to be sure the \"blank\" beam splitter is in place. If everything is in place, increase the laser power and \"frap\" until the etchings are visible. If a laser power setting greater than 10 is necessary to etch the glass, this may indicate the laser plasma cartridge needs to be replaced.\nIf the etched spots appear centered within the selected ROIs, no calibration is necessary (proceed to 2.12). If the spots are not centered, the calibration setting needs to be updated.\nTo calibrate, click the update the calibration setting. The laser will fire and an image will appear containing a single etched point. If the point does not appear, cancel the calibration, increase the laser power, and start the calibration again.\nClick in the center of the spot. The laser will fire again, and another point will appear. Click that point, and repeat this process until the calibration is complete and 9 spots appear in a grid fashion. Repeat steps 2.6-2.9 to check that the calibration was successful.\nRemove the glass slide from the microscope stage and clean the objective. Open the light path to the oculars, and replace the \"blank\" beam splitter with the \"100%ILL\" beam splitter.\n3. Nerve Transection Using Laser Ablation and Time-lapse Confocal Imaging of Glial Cell Behaviors\nRemove the stage used to hold the glass slide and replace with a stage suitable for holding 35 mm glass bottomed dishes. Continue to use the 63x 1.2NA water immersion objective.",
    "Apply a small drop of water immersion medium to the objective, and place the dish with mounted larva on the stage. Stabilize the dish with clips.\nUsing the eyepiece and widefield illumination, focus the larva and locate the motor nerves. Scan the nerves in hemisegments 10-20 and select a motor nerve for transection.\nBring up a live-view of the nerve on the computer screen using imaging software. Select Z-planes and acquire an image of the axons and glial cells of the uninjured nerve.\nPrepare time-lapse imaging settings in the imaging software to capture Z-projections of all cell types in 5-30 min intervals, depending on the experiment. It is best to create all necessary settings for the time-lapse before performing the ablation, so there is no delay in starting the time-lapse once the injury is complete.\nRemove the \"100%ILL\" beam splitter and replace with the \"blank\". Close the light path to the oculars.\nReturn to the live-view of the nerve. Use the appropriate fluorescent channel to view the axons that will be transected.\nUsing the ellipse tool, create a thin elliptical ROI in the area to be ablated, then create smaller ROIs within the selected region.\nIn the window that controls the laser settings, set the number of pulses to \"2\" and the attenuation plate to \"18\" % transmission. Fire the laser within the selected ROIs. If fluorescence remains within the ROIs, increase the laser power, wait approximately 10 sec, and fire the laser again. Do this until you reach a setting that causes fluorescence to disappear within the ROIs.",
    "Wait 10 or more seconds and check the ablated area again for fluorescence. Beware that an ROI may initially appear ablated, when it is actually photobleached. If fluorescence returns, increase the laser power and fire the laser again. Repeat this until florescence disappears within the ROIs and does not return within 10 sec. It is best to start with a lesser laser power and increase to the necessary power. The necessary laser power may vary based on individual microscopy systems, age of Coumarin dye, specimen mounting, age of larvae, and thickness of the tissue. Once an ideal laser power has been established, this power setting may be used again on subsequent nerves in the same experiment.\nOnce the ablation is completed, begin time-lapse imaging.\nWhen the time-lapse is complete, use imaging software to compile data and create color composite Z-projections for each time point. Create a QuickTime movie to analyze the behavior of axons and glial cells simultaneously .\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}