{
  "id": 4575,
  "origin_website": "Bio",
  "title": "<EM>Agrobacterium</EM>-mediated Transformation of Mature Ginseng Embryos",
  "procedures": [
    "Korean ginseng (Panax ginseng Meyer cv. “Yunpoong”) (Lee et al., 2011) seeds were stratified in humidified sand at 15 °C for 4 months (Figure 1) since the zygotic embryo right after the harvest were in an immature globular stage (about 200 μm in length).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141217/20141217233511_0358.jpg Figure 1. Diagram of ginseng seeds stratification. Ginseng seeds were stacked as depicted in the diagram inside of square cement pad or wooden square box. The seeds were mixed with river sand 1:3 (seed:sand) or often sandwiched in net bag with sand on top and down and kept at 15 ~20 °C, 10~15% moisture by watering once or twice a day. Sand within 2 mm size is good and coarse sand within 4 mm.    Then the seeds were further stratified for 100 days at 2-4 °C to break seed dormancy. After stratification for about 6.5 -7 months, the zygotic embryos reach in mature stage (Figure 2C-D, about 4.0-4.5 mm in length), which means the seeds are ready to germinate.    Once uncover the hard seed coat using fingers, the seeds were immersed in 70% (v/v) EtOH for 1 min, surface sterilized in 2% (v/v) NaOCl for 15 min, and washed three times with sterilized distilled water (Figure 2A-B) in the clean bench (Figure 2A). The zygotic embryos from the seed were carefully dissected using fingers and forceps, placed on MS (Murashige and Skoog, 1962) basal medium vertically containing 3% (w/v) sucrose and 0.8% (w/v) phytoagar, and grown for 5-10 days (Figure 3A).    An Agrobacterium tumefaciens C58C1 (pMP90) (Bechtold and Pelletier, 1998) strain containing a plant binary vector (pCAMBIA1390) harboring gene of interest was cultured in 5 ml of YEP liquid medium overnight (170 rpm for 20 h) at 28 °C. The next day morning, 5 ml of A.",
    "tumefaciens cells was subcultured in 100 ml of erlenmeyer flask till the OD600 nm reach 0.6. Bacteria cells were washed with liquid MS medium containing 3% (w/v) sucrose twice and resuspended in the same media for the ginseng explants infection. The cotyledon explants (Figures 2E and 3A, 4 mm) were used for A. tumefaciens transformation. A pCAMBIA1390 vector contains hptII and nptII genes under the cauliflower mosaic virus (CaMV) 35S promoter was used (Lee et al., 2010; Kim et al., 2014).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141217/20141217233529_0382.jpg Figure 2. Ready-to-go ginseng seeds for transformation and sterilization. A. Clean Bench. B. Ginseng seeds for sterilization. C. Ginseng seed with and without hard seed coat, then ginseng embryo covered with endosperm. D. Ginseng embryo. E. Ginseng cotyledons ready for the Agrobacterium co-cultivation.    The explants were dipped in the bacterial solution for 15 min, subsequently blotted with sterile filter paper, and co-cultivated on MS medium containing 3% (w/v) sucrose and 1 µg/ml 2, 4-dichlorophenoxyacetic acid (2, 4-D) for 2 days (Figure 3B).    Thereafter, the explants were cultured on MS selection medium (called callus induction medium) with 3% (w/v) sucrose, 1 µg/ml 2, 4-D, 0.5 µg/ml 6-benzylaminopurine (BAP), 250 µg/ml cefotaxime, and 50 µg/ml hygromycin (Figure 3C). After subculturing three to four times every two weeks on selection medium, the surviving cotyledons producing calli were cultured on the same medium without antibiotics (Figure 3D), and adventitious roots were induced from calli on B5 medium with 3% (w/v) sucrose and 3 mg/L indole-3-butyric acid (IBA) (Figure 3E).    Adventitious roots were excised from the maternal explants prior to sub-culturing in liquid B5 medium with 3% sucrose and 2 mg/L IBA, which was replaced every 5 weeks (Figure 3F).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141217/20141217233550_1918.jpg Figure 3. Ginseng transformation by Agrobacterium tumefaciens for the transgenic adventitious root induction. A. Five days further grown cotyledons. B.",
    "Cotyledon explants dipped in the bacterial solution for 15 min, subsequently blotted with sterile filter paper, and co-cultivated on MS medium containing 3% (w/v) sucrose and 1 µg/ml 2, 4-dichlorophenoxyacetic acid (2, 4-D) for 2 days. C. Transgenic calli selection on MS selection medium, 1 µg/ml 2,4-D, 0.5 µg/ml BAP, 250 µg/ml cefotaxime, and 50 µg/ml hygromycin containing 3% (w/v) sucrose. D. Survived calli were cultured on the same medium without antibiotics. E. Adventitious roots on B5 medium containing 3% (w/v) sucrose and 3 mg/L IBA. F. Subculture in liquid B5 medium containing 3% sucrose and 2 mg/L IBA."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}