{
  "id": 11828,
  "origin_website": "Jove",
  "title": "Reconstruct Human Retinoblastoma In Vitro",
  "procedures": [
    "This study is approved by the institutional Ethics Committee of Beijing Tongren Hospital, Capital Medical University. H9 hESCs are obtained from the WiCell Research Institute.\n1. Generation of  RB1 mutated hESC\nCRISPR/Cas9 targeting vector for the knockout (KO) of RB1.\nDesign a pair of sgRNA. For the ablation of RB1, target the first exon of this gene. The forward primer sequence is CACCGCGGTGGCGGCCGTTTTTCGG, and the reverse primer sequence is AAACCCGAAAAACGGCCGCCACCGC.\n\t\tNOTE: For the specific RB1 mutation, a repaired template is also required. In this protocol, RB1-KO cell line is used as an example.\nDigest 1 µg of pX330-U6-Chimeric BB-CBh-hSpCas9-2A-Puro with BbsI restriction enzymes (see Table of Materials) for 30 min at 37 °C by following the manufacturer's instructions.\nPurify the digested plasmids using a purification kit according to the manufacturers' instructions.\n\t\tNOTE: Enzymatic reactions could be directly cleaned up without agarose gel using the purification kit (see Table of Materials).\nPhosphorylate and anneal each pair of oligos using the T4 polynucleotide kinase (PNK) (Table of Materials) with the reaction comprising 1 µL of oligo1 (100 µM), 1 µL of oligo2 (100 µM), 1 µL of 10x T4 Ligation Buffer, 6.5 µL of ddH2O, and 0.5 µL of T4 PNK.\n\t\tNOTE: The forward and reverse primers in step 1.1.1 are a pair of oligos. Phosphorylate and anneal the oligos in a thermocycler using the following parameters: 37 °C for 30 min; 95 °C for 5 min; ramp down to 25 °C at 5 °C per minute.\nDilute the phosphorylated and annealed oligos 200 times by adding 1 µL of oligo reagent to 199 µL of nuclease-free water at room temperature (RT).",
    "Set up the ligation reaction and incubate at RT for 10 min by mixing the following: 50 ng of Bbs1 digested plasmid from step 1.1.3, 1 µL of oligo duplex from step 1.1.5, 5 µL of 2x ligation buffer, 1 µL of ligase, and top up to 10 µL using nuclease-free water.\nTransform the ligation mixture and sequence the positive colonies for the next step.\n\t\tNOTE: Use U6 forward or reverse primer for sequencing.\n\t\t\nThaw the competent cells on ice.\nTake 50 µL of the competent cells in a 1.5 mL microcentrifuge tube.\nAdd 1 µL of the ligation mixture from step 1.1.6 into the competent cells.\nMix gently by pipetting up and down the tube three times.\n\t\t\tNOTE: Do not vortex.\nPlace the mixture on ice for 30 min.\nHeat shock the mixture at 42 °C for 90 s.\nAdd 950 µL of room temperature Luria-Bertani (LB) broth without antibiotic to the tube.\nPlace the tube in a shaker at 300 rpm at 37 °C for 60 min.\nWarm the LB plates (peptone, peptone from casein, sodium chloride, agar-agar, and ampicillin) to 37 °C in advance.\nSpread 50-100 µL of the cells and ligation mixture onto the plates at RT.\nIncubate the plates overnight at 37 °C.\nPick up 12 colonies from the plate and transfer them to the LB medium with ampicillin. Place the medium on a shaker at 300 rpm for 60 min.\nUse 1 µL of the bacteria solution (from step 1.1.7.12) as template for PCR and select the positive colonies.\nSequence the positive colonies by the U6 primers, use the colony with the designed sgRNA sequences in the next step.\nExtract the plasmid using a midi kit (see Table of Materials).",
    "NOTE: The quality and the quantity of the plasmid using a mini kit are not enough for the following nucleofection experiment. Midi or maxi kit is more suitable than the mini kit.\nHESC culture and nucleofection.\n\tNOTE: Prewarm all the reagents to RT.\n\t\nThaw 1 x 106 H9 cells into a pre-coated 6-well plate with 10 µM Y-27632 (ROCK inhibitor) and 2 mL of fresh ncEpic-hiPSC/hESC culture medium.\n\t\tNOTE: Coat the 6-well plate with 1% Growth factor reduced basement membrane matrix for at least 30 min at 37 °C before use.\nThe next day, remove the supernatant, rinse the cells with 1x Dulbecco's Phosphate-Buffered Saline (DPBS), and then add 2 mL of fresh ncEpic-hiPSC/hESC culture medium.\nChange the medium every day with 2 mL of fresh ncEpic-hiPSC/hESC culture medium in the following 3-5 days until the cells grow to around 80% confluency.\nPassage once or twice to adjust the state of the hESC.\n\t\tNOTE: The easiest way to identify the state of the hESC is the morphology.\nCulture the undifferentiated H9 cells in a 6-well plate until they reach 80% confluency.\nChange the medium 2 h before the nucleofection with 2 mL of fresh ncEpic-hiPSC/hESC culture medium mixed with 10 µM of Y-27632 and precoat one well of a 12-well plate using 1% Growth factor reduced basement membrane matrix.\nAspirate the medium and rinse with 1 mL of prewarmed DPBS.\nRemove the DPBS and incubate with 1 mL of cell dissociation enzyme (see Table of Materials) for 3.5 min at 37 °C.\nAdd 1 mL of fresh ncEpic-hiPSC/hESC culture medium to the cells and pipette twice to make the H9 cells into a single cell suspension.",
    "Take out 100 µL of the mixture for cell counting and transfer the remaining to a 15 mL centrifuge tube containing another 2 mL of ncEpic-hiPSC/hESC culture medium inside.\nCentrifuge at 200 x g for 5 min. Remove the supernatant and resuspend around 2 x 106 cells into a 100 µL reaction volume. According to the manufacturer's protocol, optimize the volume for the cells, plasmids, nucleofector, and reaction conditions. See Table of Materials for the nucleofection system used in this protocol.\n\t\tNOTE: Generally, bubbles are not allowed during the nucleofection.\nAfter transfection, transfer the cells to the precoated 12-well plate, supplement with 1.5 mL of ncEpic-hiPSC/hESC culture medium and 10 µM of Y-27632, and then culture the cells in a 37 °C, 5% CO2 incubator.\nChange the medium daily. After 48 h, add 2 µg/mL of puromycin for cell selection around one week.\n\t\tNOTE: Numerous cells die during the first 3 days. The remaining cells may proliferate and generate into colonies in the following week after the puromycin selection. In the selection week, ensure that the medium always contains 2 µg/mL of puromycin.\nPick the colonies manually under a microscope.\n\t\tNOTE: The colony morphology is the same as the hES colony. Cut the colonies into pieces (2-6 pieces per colony) with a 10 µL white/normal pipette tip in the medium and transfer one colony into one precoated well of a 12-well plate.\nFirst, Identify the RB1 mutations and the off-target situations (Table 1), and then pluripotency to characterize the RB1 knockout H9 cell line.\n\t\t​NOTE: Detect the RB1 mutations and the off-target situations using PCR and sanger sequencing. Identify the pluripotency markers by RT-PCR and Immunofluorescence.\n2. Generation of human retinoblastoma\nMaintenance of RB1-KO hESC.",
    "Culture the gene-edited H9 cells in a Growth factor reduced basement membrane matrix coated 6-well plate with 2 mL of ncEpic-hiPSC/hESC culture medium and change the medium every day.\nPassage using EDTA buffer for 3.5 min at 37 °C or 5 min at RT.\n\t\t​NOTE: EDTA buffer is the mixture of 1x DPBS, 5 mM EDTA, and 0.9 mg/mL of NaCl.\nRetinal cell differentiation.\n\tNOTE: Prepare Medium I before the differentiation. To prepare Medium I, mix 24.5 mL of Dulbecco's Modified Eagle Medium (DMEM)/Nutrient Mixture F-12(F12)-Glutamine (1x), 24.5 mL of Neuronal basal medium, 250 µL of 100x supplement A, 500 µL of 50x supplement B, 0.1 mM ß-mercaptoethanol, and 250 µL of 100x L-glutamine. Prewarm all the mixtures to RT before use.\n\t\nGrow the RB1-KO hESC to 80% confluence in one well of a 6-well plate.\nRemove the medium and rinse the cells with 1 mL of 1x DPBS.\nElevate the cell colonies using 1 mL of dispase buffer (see Table of Materials) for 5 min at 37 °C.\n\t\tNOTE: Check the cell colonies under a microscope. Usually, it takes 5 min for the edge of the colonies to roll out.\nAspirate the dispase buffer and gently rinse the cells once with 1 mL of 1x DPBS.\nAdd 1 mL of Medium I into the well.\nCut the colonies into pieces (6-9 pieces per colony) with a 10 µL white/normal pipette tip in the medium.\n\t\tNOTE: Generally, around 60%-70% of cells detach from the well. Use a cell scraper to scrape the remaining cells in the medium.\nHarvest all the cells by centrifuging in a 15 mL tube at 200 x g for 5 min.",
    "Leave around 50 µL of the supernatant to disperse the cells in the medium, and then mix the cells with 250 µL of Growth factor reduced basement membrane matrix by gentle agitation.\n\t\tNOTE: Keep the Growth factor reduced basement membrane matrix either at 4 °C or on the ice before use. If it is aliquoted and stored at -20 °C, place it at 4 °C overnight or at least 1 h before use.\nKeep the 15 mL tube with the suspended cells into a 37 °C incubator for 20 min.\n\t\tNOTE: Ensure that the cells and Growth factor reduced basement membrane matrix form a solidified gel.\nAdd 1 mL of Medium I into the 15 mL tube, and then lightly pipet the solidified gel two to three times to disperse the clump with a 1 mL pipette.\nAdd 9 mL of Medium I and transfer the cell suspension into a 10 cm cell culture dish.\nMove the dish to a 37 °C incubator with 5% CO2 and set the day as day 0.\nExamine the cells using a microscope on day 1.\n\t\tNOTE: Thousands of hollow cysts could be observed in the dish. On average, 3 to 4 cysts are observed in one piece of gel.\nChange the medium on day 5. Collect the supernatant into a 15 mL tube, wait for the cysts to settle to the bottom, and then remove the medium and replace it with fresh Medium I.\n\t\tNOTE: If the medium becomes yellow on day 4, change the medium on day 4, otherwise on day 5. Add 10 mL of fresh Medium I into the original dish. Hundreds of cysts have already attached to the culture surface; keep them there.\nDisperse the cysts in the tube into two 10 cm dishes.",
    "NOTE: Make sure at least 300 cysts are in a dish. If the cysts are not confluent, do not separate the cysts into other dishes; return them to the original 10 cm dish.\nOn day 7, most cysts (above 95%) attach to the dish, spread out, and form adherent colonies.\n\t\tNOTE: As early as day 3, the adherent colonies can be observed.\nOn day 10, change the medium with fresh Medium I. Ensure that all the cysts are attached to the dish.\nPrepare Medium II before the next step by mixing the following: 36 mL of DMEM, 12 mL of F12, 2% of supplement B (v/v), 0.1 mM MEM Non-Essential Amino Acids Solution (NEAA).\nEnsure that the cells are spread out by day 13-17. Perform the next step on day 15 when the cells are spread out but not interacting with the neighboring colonies.\nRinse the cells once with 1 mL of DPBS and add 1 mL of dispase solution for 5 min at 37 °C.\n\t\tNOTE: Within 5 min, the edge of the cells elevate.\nRemove the dispase buffer and gently rinse the cultures with 1 mL of 1x DPBS.\nAdd 10 mL of Medium II to each 10 cm dish and culture in a 37 °C, 5% CO2 incubator.\nThe adherent cultures spontaneously detach after 24 h and assemble into retinal organoids.\n\t\tNOTE: Numerous cells that do not form the organoids would die in the following 2 days.\nThree days after detachment, collect the cells from the cell culture dish and allow the organoids to settle in a 15 mL tube.\nRemove the supernatant from the tube and transfer the organoids to a new non-adherent dish (Petri dish) with 10 mL of Medium II for the following four days.",
    "Prepare Medium III by mixing DMEM: F12 at 3:1 ratio (v/v), 2% supplement B (v/v), 0.1 mM MEM Non-Essential Amino Acids Solution (NEAA), 8% Fetal Bovine Serum (FBS) (v/v), 100 µM of Taurine, and 2 mM Glutamine.\nA week after the detachment, change the medium to Medium III.\nFrom this day onward, culture the organoids in Medium III and refresh the medium twice a week.\nEstablishment of RB cell line.\n\tNOTE: All the reagents are prewarmed at RT.\n\t\nOn day 90, the RBs (80%-90%) encompass the retinal organoids. Therefore, choose the 90-day RB organoids for the generation of the RB cell line.\nPrepare the 1640 medium by mixing the Roswell Park Memorial Institute (RPMI)-1640 medium with 10% FBS.\nCut the RB into pieces (20-25 pieces per RB) with a microsurgical knife under a microscope in RPMI-1640 medium.\nRemove the RPMI-1640 medium and treat the pieces with 0.25% Trypsin/EDTA for 10 min at 37 °C.\nAdd the RPMI-1640 medium to end the reaction and centrifuge at 200 x g for 5 min.\nRemove the supernatant and resuspend the cells in 1640 medium in a non-adherent dish.\nThe RB cell line is a floating culture. Change the medium twice a week and passage the RB cells within 2 weeks.\n\t\tNOTE: The proliferation rate of primary RB cells is quite slow.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}