{
  "id": 8357,
  "origin_website": "Jove",
  "title": "Investigation of Activated Mouse Olfactory Sensory Neurons via Combined Immunostaining and in situ Hybridization",
  "procedures": [
    "Animal procedures were carried out in accordance with Animal Protocol #1883-1, approved by the University of Campinas (Institute of Biology's Institutional Animal Care and Use Committee - Committee for Ethics in Animal Use in Research), which follows the guidelines established by the federal National Council for Animal Experimentation Control (CONCEA).\n1. Material preparation\nPrepare 1 L of 3% H2O2 (v/v) in 1x PBS. Dilute 100 mL 10× PBS and 100 mL of 30% H2O2 in 500 mL of ultrapure water. Complete the volume with ultrapure water. Prepare this solution immediately before use.\nPrepare a humidified chamber containing pieces of lint-free laboratory wipes wet with 5× SSC solution.\nPrepare hybridization wash solutions: 5× SSC (at 55 °C), 2× SSC (55 °C), 0.2× SSC (55 °C) and 0.1× SSC (55 °C and room temperature). Dissolve the appropriate volumes of 20× SSC stock solution in RNase-free ultrapure water. Prepare the diluted solutions fresh before the start of each experiment.\nPrepare immunohistochemistry blocking solution: 1× PBS/1% BSA/0.1% Triton X-100. For 100 mL, dilute 10 mL of 10× PBS, 10 mL of 10% BSA and 3.33 mL of 3% Triton X-100 in 70 mL of ultrapure water. Complete the volume with ultrapure water. Prepare the diluted solutions fresh before the start of each experiment.\nPrepare PTw solution: 1× PBS/0.1% Tween-20. For 100 mL, dilute 1 mL of 10% Tween-20 and 10 mL of 10× PBS in 70 mL of ultrapure water. Complete the volume with ultrapure water. Prepare this solution fresh before the start of each experiment.",
    "Prepare RNase-free 0.1 M triethanolamine solution. For 250 mL, dilute 3.33 mL of reagent-grade triethanolamine in 200 mL of RNase-free ultrapure water under agitation (use RNase-free glassware and magnetic stirrer when preparing this solution). Adjust pH to 8.0 with HCl. Complete the volume with RNase-free ultrapure water and store protected from light until use. Prepare this solution fresh before the start of each experiment.\nPrepare RNase-free 0.1% H2O2 (v/v) in 1× PBS. For 1 L, dilute 100 mL of 10× PBS and 3.3 mL of 30% H2O2 in 500 mL of RNase-free ultrapure water. Complete the volume with RNase-free ultrapure water. Prepare this solution immediately before use.\nPrepare RNase-free solutions of the following: 0.2 M HCl; 1 M Tris-HCl pH 8.0; 10 mg/mL yeast tRNA; 10% SDS; 10× PBS; 100× Denhardt's solution; 20× SSC; 50% dextran sulfate; 6 M HCl\nPrepare RNase-free 4% paraformaldehyde fixative solution. For 100 mL, dissolve 4 g of paraformaldehyde in 80 mL of 1× PBS. Adjust pH to 7.4 with 10 M NaOH. Complete the volume with 1× PBS. This solution must be prepared fresh before the start of each experiment.\nCaution: Paraformaldehyde is a hazardous substance that can potentially cause harm if inhaled. Prepare solution under a fume hood and wear protective gloves, mask, and safety goggles.\nPrepare RNase-free dissection solution: 30% sucrose/0.45 M EDTA pH 8.0/1× PBS. For 100 mL, dissolve 30 g of sucrose in 60 mL of RNase-free 0.5 M EDTA pH 8.0. Add 10 mL of 10× PBS. Complete the volume with RNase-free 0.5 M EDTA pH 8.0.\nPrepare RNase-free glass or plastic graduated cylinders and beakers.",
    "Prepare RNase-free pre-hybridization and hybridization solutions: 50% deionized formamide (v/v)/600 mM NaCl/200 μg/mL yeast tRNA/0.25% SDS (w/v)/10 mM Tris-HCl pH 8.0/1× Denhardt's solution/1 mM EDTA pH 8.0/10% dextran sulfate (w/v). For 10 mL in a graduated cylinder, add 5 mL of deionized formamide, 1.2 mL of 5 M NaCl, 200 μL of 10 mg/mL yeast tRNA, 250 μL of 10% SDS, 100μL of 1 M Tris-HCl pH 8.0, 200 μL of 50× Denhardt's solution, 20μL of 500 mM EDTA pH 8.0, and 2 mL of 50% dextran sulfate (M.W. 500,000). Complete the volume with RNase-free ultrapure water. Prepare this solution fresh before the start of each experiment.\n\tNOTE: Dextran sulfate is very viscous. It is advisable to prepare an extra 20% of the total volume of hybridization/pre-hybridization solutions to account for pipetting errors. Yeast tRNA may be omitted from the pre-hybridization solution, if desired.\nPrepare thermoplastic laboratory film coverslips. Cut rectangular thermoplastic laboratory film pieces 1-2 mm shorter than the length and width of a microscope slide.\nPrepare TN buffer: 100 mM Tris-HCl/150 mM NaCl. For 100 mL, dilute 10 mL of 1 M Tris-HCl pH 7.5 and 3 mL of 5 M NaCl in 70 mL of ultrapure water. Complete the volume with ultrapure water. Prepare this solution fresh before the start of each experiment.\nPrepare TNB blocking buffer: 0.5% blocking reagent A (w/v) in TN Buffer. For 200 mL, dissolve 1 g of blocking reagent A in 200 mL of TN Buffer (see Table of Materials for commercial source of blocking reagent A).\nPrepare TNT buffer: 0.05% Tween-20 in TN Buffer. For 1 L, dilute 5 mL of 10% Tween-20 in 950 mL of TN buffer. Slowly complete the volume with TN buffer to avoid foaming. Prepare this solution fresh before the start of each experiment.",
    "Prepare Tyramide-Alexa 488 working solution: 1× amplification buffer A/0.0015% H2O2/1:100 tyramide-Alexa 488. For 100 μL, dilute 1 μL of 0.15% H2O2 and 1 μL of tyramide-Alexa 488 in 98 μL of amplification buffer A (see Table of Materials for commercial sources of tyramide-Alexa 488 and amplification buffer A). Prepare this solution immediately before use.\nPrepare Tyramide-Alexa 555 working solution: 1× amplification buffer A/0.0015% H2O2/1:100 tyramide-Alexa 555. For 100 μL, dilute 1 μL of 0.15% H2O2 and 1 μL of tyramide-Alexa 555 in 98 μL of amplification buffer A (see Table of Materials for commercial sources of tyramide-Alexa 555 and amplification buffer A). Prepare this solution immediately before use.\nPrepare Tyramide-biotin working solution: 1× amplification buffer B/0.0015% H2O2/1:50 tyramide-biotin. For 100 μL, dilute 1 μL of 0.15% H2O2 and 2 μL of tyramide-biotin in 97 μL of amplification buffer B (see Table of Materials for commercial sources of tyramide-biotin and amplification buffer B). Prepare this solution immediately before use.\nBake glassware at 200 °C for at least 4 h. Treat non-disposable plasticware (including slide racks, Coplin jars and syringes) with 3% H2O2 for 15-30 min, followed by thorough washing under RNase-free water. Treat stainless steel metal instruments, such as dissection tools, forceps, and cryostat specimen holders, with 3% H2O2 for 15 min, followed by thorough washing under RNase-free water. Clean bench surfaces, heated plate, and dry blocks with RNase cleaning solution.\n2. Riboprobe synthesis\nNOTE: The following procedure to synthesize 1 kb digoxigenin-labeled cRNA probes for in situ hybridization via in vitro transcription is based on previously published protocols20,21,22,23.",
    "Use appropriate oligonucleotide primer pairs to amplify a 1 kb DNA fragment from the gene of interest (e.g., olfactory receptor gene). Select primer pairs that amplify a region present in the mature mRNA to be detected (for example, the gene's coding sequence). A selection of primers for different olfactory receptors is provided in the Table of Materials. For details on probes to detect other vomeronasal olfactory receptors, please check previous publications16,21.\nRun the PCR products on an 0.8% agarose gel and remove the desired 1 kb band.\nPurify the DNA fragment using a suitable mini column-based gel purification kit according to manufacturer's protocol.\nQuantify the purified DNA fragment and clone it into a suitable PCR cloning vector according to manufacturer's protocol. It is advisable to use cloning vectors containing T7 and SP6 RNA polymerase promoters flanking the cloned amplicon.\nTransform the recombinant plasmid into competent recombination-free bacteria via chemical transformation or electroporation according to manufacturer's protocol.\nSeed isolated transformant bacterial colonies into rich medium and isolate the plasmid via DNA mini-preparation according to manufacturer's protocol.\nPerform restriction digestion analysis with suitable restriction enzymes and/or Sanger sequencing to check the identity and orientation of the inserted DNA fragment according to manufacturer's protocol.\nPerform restriction digestion to linearize 10 μg of the plasmid using an appropriate restriction enzyme. To produce an anti-sense riboprobe after in vitro transcription, use a restriction enzyme that digests the plasmid DNA at the extremity of the insert opposite to the RNA polymerase promoter located downstream to the gene's coding sequence. To produce sense riboprobes after in vitro transcription, use a restriction enzyme that digests the plasmid DNA at the extremity of the insert opposite to the RNA polymerase promoter located upstream to the gene's coding sequence.",
    "Run an aliquot of the plasmid linearization reaction product on a 0.8% agarose gel to confirm completeness of digestion. Once complete linearization is confirmed, purify the remainder of the reaction using a column-based PCR cleanup kit according to manufacturer's protocol.\nSynthesize digoxigenin-labeled cRNA probes by in vitro transcription using 1-2 μg of the linearized plasmid as a template, the appropriate enzyme (e.g., T7 or SP6 RNA polymerase), and a suitable digoxigenin (DIG) labeling kit.\nRemove the DNA template from the reaction by digesting with DNase I at 37 °C for 30 min.\nPurify the cRNA probes using either a mini column-based RNA purification kit or a gel filtration-based purification kit. Elute the resulting probe in 50 μL of RNase-free water.\nQuantify the resulting riboprobe, preferably using fluorometric methods. Usually, the expected yield is above 100 ng/μL.\nRun the riboprobe on an automated electrophoresis system or on an RNase-free 0.8% agarose gel to check for probe quality and degradation.\nStore the synthesized probe at -80 °C until needed.\n3. Exposure of mice to olfactory stimuli\nIndividually house each animal in a clean cage for at least 24 h prior to exposure. Remove the food grid at least 2 h before exposure. All animals used in this study were 8-12 weeks old male C57BL/6 mice (average weight: 20 g).\nPrepare the appropriate olfactory stimulus. Different stimuli can be used to activate olfactory neurons in the MOE (main olfactory epithelium) or VNO (vomeronasal organ). For a comprehensive list of olfactory stimuli, please consult other publications3, 16, 22,23,24. Liquid stimuli, such as chemical solutions, urine, or recombinant protein solution, can be deposited on a medical gauze or cotton ball.\nInsert the olfactory stimulus into the cage and leave the animal undisturbed for 1 h.",
    "Euthanize the mouse subject and quickly dissect the MOE or VNO using RNase-free dissecting tools.\n4. Tissue dissection and freezing\nDissect the MOE or VNO under a stereomicroscope using dissection solution.\n\t\nFor the VNO, remove the thick septal bones, leaving the softer cartilage shells surrounding the organ.\nPrepare specimen for cryo-sectioning.\n\t\nBlot the specimen dry on a piece of blotting paper and place it inside a histological plastic mold containing embedding medium.\nFor VNO, arrange each organ vertically and pull it to the bottom of the plastic mold with the help of a 1 mL syringe (Figure 1A).\nFor MOE, place it at the bottom of the plastic mold with the cribriform plate facing down.\nRemove the excess of bubbles around the specimen since these can interfere with sectioning.\nFreeze specimens on dry ice.\nStore the specimen block at -80 °C.\n\t\tNOTE: Frozen specimens may be stored for several months before sectioning.\nPerform cryo-sectioning.\n\t\nTurn the cryostat on and set the temperature to -23 °C at least 4 h prior to use.\nRemove the frozen block from the histological plastic mold and trim it with a razor blade.\nLeave 5 mm around the specimen, as this makes section handling easier (Figure 1B).\nUse embedding medium to attach the block to the cryostat's specimen holder.\nCollect 16 μm sections onto positively charged microscope slides.\nStore the slides at -80 °C.\n\t\t​NOTE: Slides may be stored at -80 °C for several months before in situ hybridization.\n5. Step-by-step in situ hybridization protocol\nDry the slides for 10 min using a hair dryer. Use the warm jet to defrost the slides, then switch to room-temperature jet until the embedding medium is opaque.",
    "Add 500 μL per slide of RNase-free 4% paraformaldehyde fixative solution and incubate at 23-26 °C for 15 min to fix the histological sections.\nWash the slides twice in RNase-free 1× PBS for 5 min each.\nAdd 500 μL per slide of RNase-free 0.2 M HCl and incubate at 23-26 °C for 10 min.\nWash the slides twice in RNase-free 1× PBS for 5 min each.\nAdd 500 μL per slide of RNase-free 0.1% H2O2/1× PBS and incubate for 30 min at 23-26 °C. Perform this step in the dark to prevent light-induced degradation of hydrogen peroxide.\nWash slides twice in RNase-free 1× PBS for 5 min each.\nPerform acetylation by transferring slides to a jar containing 250 mL of RNase-free triethanolamine 0.1 M pH 8.0 and a magnetic stir bar, in a fume hood. Add 625 μL of acetic anhydride under constant stirring. Turn stirring speed down, add another 625 μL drop by drop onto the slides, then turn stirring off and incubate for 10 min.\nWash slides twice in RNase-free 1× PBS for 5 min each.\nWash slides once in RNase-free 1× PBS at 60 °C for 5 min.\nPerform pre-hybridization by removing slides from 1× PBS one at a time and blotting each of them dry using lint-free laboratory tissue paper. Pipet 400 μL of pre-hybridization solution onto each slide and place it inside a humidified chamber pre-warmed at 60 °C in a water bath or heated oven. Incubate at 60 °C for 1 h.\nHeat up enough hybridization solution to 60 °C, aliquot 200 μL per slide in microfuge tubes, and heat them up to 85 °C for 10 min.\nAdd the appropriate cRNA probe(s) to the hybridization solution tubes (1 μg/mL each probe) and denature at 85 °C for 5 min.",
    "For hybridization, take one slide at a time from the humidified chamber, blot it dry and place it onto a 60 °C heated plate. Add 200 μL of riboprobe-containing hybridization solution and cover the slide with a glass coverslip. Incubate for 12-16 h in the humidified chamber at 60 °C.\n\tNOTE: Do not allow slides to cool down after pre-hybridization. Hybridization temperature must be empirically determined for each probe. Sixty degrees Celsius is suggested as a starting point, since it generally works well for 1 kb probes.\nHeat SSC wash solutions to 55 °C in separate jars and place them in a water bath at the appropriate temperature.\nAfter hybridization is finished, remove the coverslip from each slide using a bath containing 5× SSC solution at 55 °C. Hold each slide horizontally inside the warm SSC solution. When the coverslip has detached, tilt the slide and let the coverslip fall down to the bottom.\nWash with 2× SSC at 55 °C for 30 min in a slide jar.\nWash with 0.2× SSC at 55 °C for 20 min in a slide jar.\nWash with 0.1× SSC at 55 °C for 20 min in a slide jar.\nTransfer to 0.1× SSC at 23-26 °C and incubate for 3 min in a slide jar.\nWash in PTw for 10 min in a slide jar.\nWash twice in TN Buffer, for 5 min each, in a slide jar.\nPipet 600 µL of TNB blocking buffer onto each slide and incubate for 3 h at 23-26 °C.\nPipet 500 µL of primary antibody solution (peroxidase-conjugated anti-DIG antibody diluted 1:400 in TNB solution) onto each slide. Carefully overlay a piece of thermoplastic laboratory film onto each slide and incubate for 12-16 h at 4 °C.",
    "Wash slides 6 times with TNT Buffer for 5 min each, under mild stirring in a slide jar.\nPipet 100 µL of tyramide-biotin working solution onto each slide. Cover with thermoplastic laboratory film coverslips and incubate for 12 min at 23-26 °C.\n\tNOTE: Perform this incubation step in a staggered fashion, with 2 or 3 slides per batch, to allow good control over incubation times. Duration of tyramide incubation may need to be optimized, depending on cRNA probe sensitivity and concentration.\nWash slides 6 times with TNT Buffer for 5 min each, under mild stirring in a slide jar.\nPipet 200 µL of solution containing peroxidase-conjugated streptavidin (SA-HRP, diluted 1:100 in TNB buffer) onto each slide and cover with a thermoplastic laboratory film coverslip. Incubate at 23-26 °C for 1 h.\nWash slides 6 times with TNT Buffer for 5 min each, under mild stirring in a slide jar.\nPipet 100 μL of tyramide-Alexa 488 working solution onto each slide, cover with thermoplastic laboratory film coverslip and incubate at 23-26 °C for 12 min in the dark.\nWash slides 6 times with TNT Buffer for 5 min each, under mild stirring in a slide jar.\nIncubate in 3% H2O2/1× PBS in a slide jar for 1 h, to inactivate peroxidases from the previous steps.\nWash slides 6 times with TNT Buffer for 5 min each, under mild stirring in a slide jar.\n6. pS6 immunostaining\nPipet 500 μL of 4% paraformaldehyde/1× PBS solution onto each slide and incubate at 23-26 °C for 15 min to fix sections.\nPipet 500 μL of 1× PBS/0.1% Triton X-100 onto each slide and incubate for 5 min to permeabilize sections.\nWash twice with 1× PBS in a slide jar.",
    "Pipet 2-3 drops per section of commercially available tyramide signal amplification blocking solution B (Table of Materials) and incubate at 23-26 °C for 1 h.\nPipet 400 μL of immunohistochemistry blocking solution onto each slide and incubate at 23-26 °C for 30 min to block sections.\nPipet 200 μL of rabbit anti-pS6 primary antibody solution (diluted 1:200 in immunohistochemistry blocking solution; final concentration: 1 μg/mL) onto each slide, cover with thermoplastic laboratory film coverslip, and incubate at 4 °C for 12-16 h.\nWash 3 times with 1× PBS/0.1% Triton X-100, for 5 min each in a slide jar.\nPipet 2-3 drops per slide of commercially available peroxidase-conjugated anti-rabbit secondary antibody solution (Table of Materials) and incubate at 23-26 °C for 1.5 h.\nWash 3 times with 1× PBS/0.1% Triton X-100, for 5 min each in a slide jar.\nBlot slides dry and pipet 100 to 200 μL of tyramide-Alexa 555 working solution onto each slide, overlay with a piece of thermoplastic laboratory film coverslip, and incubate for 7 min in the dark.\nWash twice with 1× PBS for 5 min each in a slide jar.\nPipet 500 μL of diluted nuclear stain (in 1× PBS) onto each slide and incubate at 23-26 °C for 30 min.\nWash twice with 1× PBS at 23-26 °C for 5 min each in a slide jar.\nMount slides with anti-fading mounting medium and let the mounting medium cure for 24h in the dark.\nStore slides at the appropriate temperature until imaging, to avoid fluorescence fading.\n7. Microscopy imaging\nImage slides using a epifluorescence or confocal microscope equipped with appropriate filters for the fluorophores used.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}