{
  "id": 2805,
  "origin_website": "Cell",
  "title": "Measuring SERCA-mediated calcium uptake in mouse muscle homogenates",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing the reaction mixture\nTiming: 5 min\nThis step is for combining the necessary materials to create the reaction mixture that is plated and used to obtain a measure of starting free Ca2+.\nSet plate reader to 37°C.\nIn black 1.5 mL Eppendorf tubes add 200 μL of Ca2+ uptake buffer, 20 μL of muscle homogenate, and 1 μL of Indo-1 (2 mM).\nNote: ensure to shake the Ca2+ uptake buffer and vortex the homogenate prior to addition to the tube.\nNote: the amount of tissue sample added can vary and may need to be optimized. For example, cardiac and brain tissue or cells may require 60 μL of homogenate. This can be altered freely as uptake rates are made relative to the amount of protein in each well.\nVortex the reaction mixture and plate 100 μL in duplicate in an all-black 96-well plate.\nUsing an excitation wavelength of 355 nm and dual emission at 405 nm and 485 nm, read the plate to gain values of the starting free Ca2+ concentration in each well.\nCritical: Once Indo-1 is added, the amount of light exposure should be kept to a minimum.\nRunning and calibrating the kinetic plate\nTiming: 15–45 min\nThis step will guide through the process of running the kinetic plate as well as the calibration steps.\nRemove the plate from the plate reader and add 4 μL of 250 mM ATP to each well.\nNote: It is recommended to use a repeater pipette for this step so that the ATP is added to all wells as quickly as possible.\nUsing the same excitation and emission settings as stated in step 4, read the plate kinetically, with continuous or interval shaking, for 30 min at 20 s intervals.",
    "Note: It is likely that the interval separation depends on the plate reader being used and the amount of samples on the plate. However, we recommend running intervals that are no more than 30 s apart, and therefore, the user may have to minimize the amount of samples run on a single plate in order to accommodate this (troubleshooting 3[href=https://www.wicell.org#troubleshooting]).\nOnce the plate is finished reading, add 10 μL of 50 mM EGTA to each well in order to obtain a “minimum” value for calibration.\nNote: To ensure an accurate “min” value, EGTA can be added in increments of 10 μL, with a read after each 10 μL addition, until the values become stable between reads (i.e., the values do not continue to decrease with each addition of EGTA).\nFollowing EGTA, add 80 μL of 100 mM Ca2+ solution to each well and read the plate, in order to obtain a “maximum” value for calibration.\nNote: This value must be higher than the starting Ca2+ read at the very least, but Ca2+ can continue to be added, with the plate being read after each addition, being mindful of the maximal volume of the wells (troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\nOptional: To gain a measure of Ca2+-leak, add a SERCA inhibitor, such as cycolpiazonic acid (1 μL of 40 mM stock, dissolved in DMSO), to each well and continue the kinetic plate read for an additional 10–15 min (or until a plateau is reached). The calibration steps can then be performed following leak measurements. This step also ensures that the amount of Ca2+ uptake during this protocol was mediated by the SERCA pump.",
    "Note: The timing of the kinetic read will vary from experiment to experiment, and the timing listed in the steps is just a recommended starting point. Generally, the plate can be run until samples have reached a plateau or until a pre-determined endpoint.\nPause point: The plate can be paused throughout the kinetic read to add a reagent/treatment to the samples and then resumed once ready. However, it is important that any breaks in the assay be as brief as possible."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Metabolism",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}