{
  "id": 3410,
  "origin_website": "Cell",
  "title": "A Cell-Based Assay Optimized for High-Content Cilia Imaging with Primary Rat Hippocampal Neurons",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPreparation of Rat Hippocampal Cultures\nTiming: 3–4 h\nThis step describes isolation and dissociation of hippocampi from rat brains at embryonic day 18 (E18). All experimental procedures were done in agreement with animal protocols approved by the Institutional Animal Care and Use Committee at Boston Children’s Hospital.\nNote: This protocol is an optimization of a previous protocol (Di Nardo et al., 2014[href=https://www.wicell.org#bib2])\nCollect rat embryos to 10 cm dish containing 1× DM (Figures 2[href=https://www.wicell.org#fig2]A and 2B). Peel away skin and skull using forceps under dissecting scope and collect brain. Transfer brain to fresh 1× DM in 6 cm dish on ice, collect brain for each embryo.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/299-Fig2.jpg\nFigure 2. Overview of Hippocampal Dissociation\nRat embryos collected at E18 (A). Each embryo is transferred to a fresh dish (B), brain is removed (C). Hippocampi are collected in a 6 cm dish (D), transferred to a conical tube (E), dissociated by papain and resuspended in plating medium (F).\nTransfer brain to fresh 1× DM in 10 cm dish (Figure 2[href=https://www.wicell.org#fig2]C). Under dissecting scope grasp meninges from brain with sterile forceps and gently pull it away (see Troubleshooting 1[href=https://www.wicell.org#sec6.1]). Separate hemispheres from midbrain and hindbrain. Isolate hippocampi and transfer to a 6 cm dish on ice containing 5 mL of fresh 1× DM in (Figure 2[href=https://www.wicell.org#fig2]D). Repeat for each brain.\nAdd 25–30 units/mL papain to 10 mL solution of 3 mM L-Cysteine, mix and place in water bath at 37°C for a few minutes.\nTransfer 5 mL of hippocampi to a 15 mL conical tube using a 10 mL pipette and let them settle to the bottom of the tube (Figure 2[href=https://www.wicell.org#fig2]E). Filter sterilize papain/L-Cysteine with 0.2 μm membrane into a 50 mL conical tube.",
    "Remove 4 mL of 1× DM from hippocampi, add 5 mL papain/L-Cysteine, mix by inverting tube and place in water bath at 37°C for 5 min.\nFilter sterilize 20 mL of trypsin inhibitor with 0.2 μm membrane into fresh 50 mL conical tube and place in water bath. Remove papain/L-Cysteine from hippocampi using a 10 mL pipette, add 5 mL trypsin inhibitor. Mix by inverting the tube, remove trypsin inhibitor. Add 5 mL fresh trypsin inhibitor. Mix and place in water bath at 37°C for 5 min. Repeat three times.\nRemove last trypsin inhibitor wash, add 5 mL warm PM and gently triturate with a 10 mL pipette until all clumps have disappeared. Add 5 mL warm PM for a total volume of 10 mL (Figure 2[href=https://www.wicell.org#fig2]F). Filter the hippocampal culture through a cell strainer with pore size of 40 μm.\nNeuron counting: Dilute culture 1:5 in PM (make 50 μL). Aliquot 10 μL of 0.4% Trypan Blue solution to an Eppendorf tube, add 10 μL of diluted neurons, mix by pipetting up/down and incubate for 3 min. Transfer 10 μL to hemocytometer and count viable (clear) neurons under light microscope. Do not count unhealthy (blue) neurons. Count 4 squares and calculate the number of viable cells using the following formula: [4 squares × 2 × 5]/400 = n × 106 neurons/mL. For accurate estimate of neuronal counts make three different neuronal dilutions.\nNeuronal plating: Dilute culture to 5 × 105 cells/mL with PM (make 6 mL). Add 50 μL neuron culture to wells of 96 plate containing 80 μL of PM/well, gently mix by pipetting up/down. Final neuronal density is 25,000 neurons/well. Tap plate to homogenously disperse neurons in the wells and place in a 37°C, 5% CO2 humidified incubator. Dissociation/plating day is considered DIV0.",
    "Critical: Sterility is critical when preparing primary neuronal cultures. Sterilize dissecting scissors and forceps with ethanol before use, dry, and keep aside. Steps 1 and 2 are performed on the bench/dissecting microscope wearing a mask to prevent contamination, ensure sterile environmental conditions. Steps 3–9 are performed under a laminar flow tissue culture hood.\nCritical: Trypan blue is a cell-membrane impermeable dye used as exclusion test to determine cell viability. It is important not to leave neurons in trypan blue staining solution for prolonged times as it might result to cell death and inaccurate cell counting.\nCritical: For cilia imaging, neurons are plated at 25,000/well in a 96 well plate (Figures 3[href=https://www.wicell.org#fig3]A and 3B). However, neuronal density can range between 10,000–30,000 neurons/well. Densities lower than 10,000 neurons/well are not recommended as sparse neuronal cultures will result to clump formation and cell death (Figures 3[href=https://www.wicell.org#fig3]C and 3D; see Troubleshooting 2[href=https://www.wicell.org#sec6.3] for tips on how to monitor healthy neuronal cultures).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/299-Fig3.jpg\nFigure 3. Neuronal Plating for Cilia Imaging\nRepresentative phase contrast images showing DIV13 cultures of healthy neurons plated at a single-cell density optimal for cilia imaging (A and B), sparse neurons with several clumps (C) and dead neurons with high cell clumping (D). Scale bar, 100 μm.\nNote: When plating the neurons use gentle pipetting and do not generate aerosol as it will cause cell damage.\nPause Point: Dissociated neuronal cultures can be stored on ice for up to 4–5 h before plating. Longer pause is not recommended as it may decrease neuronal viability.\nLentiviral Transduction of Neurons\nTiming: 7–8 h\nThis step describes how to transduce DIV1 rat hippocampal neurons with lentivirus expressing Luciferase- control shRNA tagged with green fluorescent protein (LVGFP) (Di Nardo et al., 2020[href=https://www.wicell.org#bib1]).",
    "Thaw LV particles in water bath, prepare 1:1 dilution of LV (Vol/Vol) in NB medium in the presence of polybrene at 0.6 μg/mL. Transduce neurons by replacing PM medium with diluted virus at 70 μL/well in a 37°C, 5% CO2 humidified incubator.\nAfter 6 h, wash neurons twice with NB-wash medium at 100 μL/well. Replace last wash with 130 μL of PM medium.\nChange PM medium every 3–4 days; keep neurons in culture until DIV13.\nCritical: Primary neuronal cultures are extremely delicate. Limit the time outside the incubator to af minimum and make sure to have all reagents/equipment ready under the sterile laminar tissue culture hood before procedure.\nCritical: LV are biosafety level 2 material and need to be handled with safety precautions. De-contaminate any labware that touched LV (tips, Eppendorf tubes, conical vials) by soaking in 30% bleach. Incubate for at least 20 min before discarding in biohazardous waste. After infection, LV particles are recovered from neurons with multichannel pipette and soaked in reservoir containing 30% bleach before discarding in biohazardous waste.\nOptional: LV-transductions can also be performed at later neuronal ages in culture (DIV2–5) and/or extended for prolonger times (up to DIV20).\nNote: LV particles are stored in small aliquots at −80°C. When preparing dilutions avoid thawing too much virus, repeated thawing/freezing is not recommended as it will decrease transduction efficiency.\nPause Point: LV-transductions should be performed for a minimum of 6 h and can last for up to ~10 h. Longer incubation times are not recommended as they might result in neuronal cell death.\nImmunofluorescent Staining Protocol\nTiming: 2 days\nThis step describes fixation and immunofluorescent staining to monitor cilia by high-content image-based assay (ciliaHCA) in neuronal cultures transduced with LVGFP (Di Nardo et al., 2020[href=https://www.wicell.org#bib1]).",
    "Day 1 (timing 3–4 h): Before Procedure, set up a reservoir filled with 6 mL of 100% ice-cold methanol (MeOH) on ice. Under chemical hood prepare a reservoir containing 6 mL of 1× PBS and a reservoir with 6 mL of freshly thawed 4% PFA at 20°C–25°C.\nTransfer plate with neurons to chemical hood, replace PM medium with 4% PFA and incubate for 10 min at 20°C–25°C. Replace fixative with 1× PBS.\nNote: Unless otherwise specified, all reagents for immunofluorescent staining are aliquoted to the neurons at 50 μL/well using filtered tips with a multichannel pipette.\nNote: 100% MeOH is stored at −20°C and precooled on ice before use.\nCritical: PFA is toxic and corrosive, it needs to be disposed as hazardous waste in an appropriate waste container.\nCritical: Incubations of plates with neurons expressing fluorescent proteins are performed in a dark container.\nPause Point: Once fixed, neurons can be kept for up to 2 weeks in 200 μL of 1× PBS with 0.05% Sodium Azide (NaN3). Wrap plate with parafilm and store at 4°C.\nOptional: For cilia imaging we typically fix the neurons at DIV13 however, assay endpoint can vary anywhere between DIV5–20 (Di Nardo et al., 2020[href=https://www.wicell.org#bib1]).\nTransfer plate on ice, replace 1× PBS with ice-cold 100% MeOH, incubate for 10 min. Invert plate to quickly remove MeOH, dry plate by tapping on clean tissue, and incubate with PBT-glycine for 5 min at 20°C–25°C. Wash with PBT-glycine two times.\nReplace PBT-glycine with PBT-block solution, incubate for 90 min at 20°C–25°C. Prepare primary antibody solution with anti-rabbit-adenylyl cyclase III [(ACIII) cilia marker antibody, diluted 1:700] and anti-chicken-GFP (LV-expressing neurons marker, diluted 1: 1,000) in PBT-block (make 6 mL). Replace PBT-block with antibody solution, wrap plate with parafilm and store at 4°C for 16–24 h.\nDay 2 (timing 3 h)",
    "Wash neurons with PBT buffer three times for 5 min at 20°C–25°C. Prepare secondary antibody solution by diluting anti-rabbit Alexa-647 and anti-chicken Alexa-488 fluorescently labeled secondary antibodies diluted at 1:1,000 in PBT-Block (make 6 mL). Incubate neurons with secondary antibody solution for 90 min at 20°C–25°C (see Troubleshooting 3[href=https://www.wicell.org#sec6.5], Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/299-Fig4.jpg\nFigure 4. Immunofluorescent Staining of the Neurons\nRepresentative images showing a culture with good (A) and bad (B) detection of GFP positive neurons and good (C) and bad (D) detection of cilia stained with ACIII antibody. White arrows in (C) indicate cilia. Scale bars: 40 μm in (A) and (B) and 25 μm in (C) and (D).\nReplace secondary antibody mix with Hoechst dye diluted 1:5,000 in PBS, incubate for 5 min at 20°C–25°C. Wash neurons three times with PBT buffer and two times with 1× PBS. Replace last wash with 200 μL of 1× PBS with 0.02% sodium azide (NaN3).\nPause Point: Plates can be imaged right away or within to 2–3 weeks after staining. Store plate in a dark container at 4°C wrapped in parafilm.\nNote: Unless otherwise specified, reagents are always aliquoted at 50 μL/well with filtered tips using a multichannel pipette.\nNote: Keep track of antibody lot numbers as staining efficiency can vary from batch to batch (see Troubleshooting 3[href=https://www.wicell.org#sec6.5]; Figure 4[href=https://www.wicell.org#fig4]).\nNote: Fluorescently labeled secondary antibodies are stored in small aliquots at −20°C. Once thawed, they are kept at 4°C.\nHigh-Content Cilia Imaging\nTiming: 14–18 h\nThis step describes the setup for cilia imaging using the high-content platform Cellomics Arrayscan XTI (Thermo Fischer Sci).",
    "Cilia are imaged on 80 fields of view per well (20% of the well, average scan time: 12–14 h/96-well plate) using a 40× air objective (Numerical aperture = 0.75). Nuclei are detected by Hoechst staining at 386 nm emission for 30 ms, the LV-transduced neurons are detected using GFP staining at 485 nm emission for 20 ms at a 1.9 μm Z offset above the focal plane of the nuclei, and cilia are detected using ACIII staining at 647 nm emission for 130 ms. Cilia are imaged using the “image projection tool” which allows the acquisition of a stack of images at three different focal planes with a step size of 1.9 μm/step for a total of 5.7 μm (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/299-Fig5.jpg\nFigure 5. Algorithm for High-Content Cilia Imaging\n(A) Overview of focal planes used for the ciliaHCA.\n(B) Raw image (a) of hippocampal neuron transduced with GFP-tagged lentivirus (in green) stained with the adenylyl cyclase III (ACIII, cilia marker in red) and with Hoechst (nuclei in blue). Identification of nuclei (grayscale in b), infected neurons (green object in c), and cilia (red spot in d). White masks show the region of interest (ROI) for object identification. Image acquisition for the ciliaHCA was performed at 40×. Scale bar, 25 μm.\nObjects are identified using the spot detector algorithm of the HCS Studio Cell Analysis Software. Hoechst staining is used to draw a circular mask for nuclei identification and for the region of interest (ROI) for the subsequent channels. GFP+ spots are identified using a circular mask of the size of the nuclei. ACIII+ spots are identified by a circular mask with a diameter of 32 μm drawn from the nuclei ROI. Border objects at the border of the well are excluded (Figure 5[href=https://www.wicell.org#fig5]B).",
    "Critical: Gene knockdown by LV-mediated shRNA in primary neurons is more efficient than transient transfection methods (Karra and Dahm, 2010[href=https://www.wicell.org#bib3]). However, when monitoring ciliation after gene knockdown it is critical to analyze the cilia in the shRNA transduced neurons (LV-GFP+ neurons). The Spot detector algorithm available with the HCS Studio Cell Analysis Software allows the detection of subcellular structures and their co-localization. A positive event should be considered a spot detection in both the GFP and ACIII channel. The Spot detector algorithm allows the quantification of cilia number, but it does not quantify cilia length.\nNote: Other than fluorescent tags, alternative markers that could be used for the identification of the shRNA transduced neurons include the use of lentiviral particles co-expressing non-fluorescent tags followed by antibody staining of the tag (e.g., HA, Myc).\nNote: The reason for choosing a 32 μm circular mask is that it allows the detection of spots in the perinuclear region of the cell body which is where the ACIII+ cilia are typically observed. The 32 μm diameter is drawn from the nuclei ROI to ensure the inclusion of cilia in certain disease models with enlarge some size (Di Nardo et al., 2020[href=https://www.wicell.org#bib1]).\nNote: Use Hoechst staining for focal plane acquisition of the well, then adjust Z offset for optimal resolution of neurons and cilia at 485 nm and 647 nm, respectively (see Troubleshooting 4[href=https://www.wicell.org#sec6.7] for tips on how to overcome out of focus imaging)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cell-Based Assays",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}