{
  "id": 3818,
  "origin_website": "Cell",
  "title": "Quantification of microglial contact and engulfment of oligodendrocyte progenitor cells in the rodent brain",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConfocal microscopy\nTiming: 1–3 days (∼2 h per animal)\nThis step of the protocol describes how to acquire a high-resolution confocal z-stack for analysis of microglial engulfment of OPCs in the corpus callosum of the P7 mouse brain. Samples should express fluorophores on microglia with CX3CR1:GFP transgenic reporter mice, or be fluorescently labeled by immunofluorescent staining methods described above. Likewise, samples should express fluorophores on OPCs with NG2:dsRed transgenic reporter mice or be fluorescently labeled using immunofluorescent staining methods described above.\nPlace dry slide on the stage of the confocal microscope, such as the Nikon C2 confocal microscope with NIS-Elements software (Nikon, Melville, NY).\nLocate the area of interest, such as the corpus callosum at the level of the lateral ventricles in a coronal section to identify large, ameboid microglia (Figures 1[href=https://www.wicell.org#fig1]D–1G).\nUse a high-powered objective, such as a Plan Fluor 40×/1.30 NA oil immersion objective, to focus on one region within the area of interest (Figure 2[href=https://www.wicell.org#fig2]A, white boxes). Set the laser power and gain for each wavelength to optimize the image without overexposure.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/540-Fig2.jpg\nFigure 2. Observing microglial interactions with OPCs in 3D\n(A) The locations in the corpus callosum where confocal z-stacks were acquired are illustrated by 3 white boxes. Scale bar, 200 μm.\n(B) Representative 3D reconstructed z-stack from the corpus callosum of CX3CR1:GFP;NG2:dsRed mouse stained with bisbenzimide, a marker of cell nuclei. The image file for this z-stack is provided as part of the practice tutorial for this protocol. Scale bar, 20 μm.",
    "(C–F) (C) Screen view of Imaris software with the provided sample image file in 3D view. The navigation controls (white arrow 1) can be used to rotate the image (navigate) or select surface rendered objects (select). The brightness of the image can be adjusted (white arrow 2) with the display adjustment tab where individual channels can also be turned on or off using the checkboxes. Surface renders of each channel can be created (white arrow 3) within the “Scene” window on the left side of the screen by clicking the “Add New Surfaces” icon on the top of the window, which appears as a blue 3D bulbous shape, shown in the box of this image. Scale bar, 30 μm. Representative surface renders of (D) microglia, (E) OPCs, and (F) merge of both surfaces together. See Methods video S1[href=https://www.wicell.org#mmc3] for this process. Scale bars, 20 μm.\nNote: The laser power and gain will be different based on the specimen and microscope set up. Be sure to optimize this in a non-essential region of the tissue before imaging the experimental region to avoid photobleaching.",
    "Set the top and bottom of the z-stack based on the clarity of the cells in the image. The z-stack should be 15 μm thick. Set the step size to 0.3 μm. To avoid photobleaching, test the microscope settings on a section that is not needed for the experiment. Keep the laser power settings low and adjust the gain to increase the brightness. Since each area will only be imaged one time, the proper microscope settings should not create significant variability in the fluorescence signals between image stacks. If fluorescence intensity is low, it may be an issue with tissue quality from storage or staining technique. See the troubleshooting[href=https://www.wicell.org#troubleshooting] section for more details. Acquire the z-stack in the appropriate color channels necessary to capture the image. It is recommended to image 3 regions of the corpus callosum as illustrated by white boxes in Figure 2[href=https://www.wicell.org#fig2]A. A representative z-stack is shown in Figure 2[href=https://www.wicell.org#fig2]B. At least 2–3 brain sections are suggested for a total of 6–9 z-stacks per mouse.\nCritical: To ensure proper sampling, start imaging on one end of the area of interest working across the area to avoid imaging the same region more than once. Make sure that all image stacks are the same size across x, y, and z planes.\nAlternatives: Live cells or ex vivo slices can be imaged using time-lapsed confocal microscopy. These files can be analyzed using the methods described below.\nPause Point: Once the images have been acquired, the data analysis can begin at any point. It is recommended to keep slides at 4°C for long-term storage.\nImage preparation\nTiming: ∼15 min per image stack",
    "Imaris 9.6 requires a 3 Ghz dual core processor with 8 GB of available ram and graphics support from a 2 GB or stronger graphics card. Depending on the microscopy software used, image stacks may need to be converted into a format that is supported by Imaris. This software is updated regularly and may support different file formats after this publication. Check the updated information to determine the supported image files and current system requirements for the latest version of Imaris: https://imaris.oxinst.com/[href=https://imaris.oxinst.com/]\nA sample Imaris image file is available in Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/540-Mmc1.zip].\nImport image stacks into the Imaris software Arena.\nOpen Imaris and click the Image button to import an image, or an image folder into the arena. Images can also be dragged directly into the arena to be imported. There should be a status bar on the bottom right corner of the program to provide the status of the file import. Once completed, the images will appear in the arena.\nOpen the file of interest by double-clicking it in the arena. Make sure the image stack is in 3D view by clicking the “3D View” icon from the menu on the top left corner of the window. The sample image file is shown in 3D in Figures 2[href=https://www.wicell.org#fig2]B–2F. The image can be rotated using the “Navigate” tool (Figure 2[href=https://www.wicell.org#fig2]C, white arrow 1).\nAdjust the display of the channels using the “Display Adjustment” window (Figure 2[href=https://www.wicell.org#fig2]C, white arrow 2). If this window is not appearing, click “Edit” then select “Show Display Adjustment” to show the window. You may also wish to adjust the colors of the image, which is particularly important for colorblind accessibility. This can be done by clicking “Edit” then “Image Properties…” and adjusting the Channels individually for their color.",
    "If necessary, images may be processed for noise using the smoothing functions under the “Image Processing” tab at the top of the window.\nNote: Use the same image processing methods across all images within a dataset to be consistent. To move around the 3D image, click the “Navigate” circle under the “Pointer” window on the right side of the screen (Figure 2[href=https://www.wicell.org#fig2]C, white arrow 1). When the pointer is set to navigate, the image can be moved around. Alternatively, the pointer selection can be toggled by pressing the “Esc” key on the keyboard. The “Select” option for the pointer will be used later. It allows objects to be selected instead of moving the 3D image around.\nPause Point: This process can be saved at any time. It is recommended to prepare each image prior to analyzing it, rather than preparing all images and analyzing them afterward. To save the processing, click “File” then select “Store” or “Store As” to save the changes in the Imaris arena.\n3D cell surface rendering of microglia\nTiming: ∼1 h per image stack\nThis step will create a surface render, or a mask over each channel corresponding to the different cell types. Microglia in the FITC channel will have a 3D render corresponding to their surfaces, and OPCs in the TRITC channel will have a separate 3D render corresponding to their surfaces. This process is demonstrated in Methods video S1[href=https://www.wicell.org#mmc3].\nCreate a surface render for microglia in the FITC channel.\nDeselect all channels except FITC in the “Display Adjustment” window to have a clear view of the microglia (Figure 2[href=https://www.wicell.org#fig2]C, white arrow 2). Adjust the channel as necessary to see a clear boundary of the cell without overexposure.",
    "Within the “Scene” window on the left side of the screen, click the “Add New Surfaces” icon on the top of the window which appears as a blue 3D bulbous shape (Figure 2[href=https://www.wicell.org#fig2]C, white arrow 3).\nAfter clicking “Add New Surfaces,” a new line will appear within the “Scene” folder named “Surfaces 1” which can be renamed by double-clicking. Rename it to “Microglia” for better organization.\nWith the microglia surface selected, navigate to the menu below with the tab “Create” selected by default. This menu will allow the user to specify parameters for the channel to create a surface render that best overlaps the cells. The parameters can be saved as “Favorites” which will appear in the dropdown menu under “Default.” It is recommended to determine the best parameters before creating a favorite setting, so do not change the “Default” selection initially. For this analysis, ensure that the “Segment a Region of Interest” button is not selected, which should be the default setting. Click the blue arrow button on the bottom to advance to the next step of creating the surface render.\nThe next section of this process is labeled “Source Channel” which allows the user to select the channel for surface rendering. For this step, select the FITC channel to create a surface render on microglia. The smoothing should also be adjusted to determine the amount of detail used in the rendering. For microglia, use 0.1 μm smoothing (Figure 2[href=https://www.wicell.org#fig2]D), which will create a surface render that captures the microglial processes as previously described (Schafer et al., 2012[href=https://www.wicell.org#bib6]). Test this setting on a few image stacks and determine the best setting to use on all image stacks for the study to remain consistent. Select “Absolute Thresholding” for this protocol. Click the blue arrow to advance to the next step.",
    "Threshold the image using the histogram by dragging the setting until the image accurately represents the surface of the cells. For this protocol, do not enable the “Split Touching Objects” option. With the “Navigation” pointer selected, check the thresholding by zooming in on the cells and rotating them around to ensure the boundary is accurate. Examples are given for under-representative, representative and over-representative thresholding (Figures 3[href=https://www.wicell.org#fig3]A–3C, respectively). Thresholding an image will depend on the exposure and brightness of the fluorescence. It is recommended to process all tissue samples at the same time and use the same microscope acquisition settings while acquiring image stacks. Keeping these settings consistent will allow for the same threshold settings to be used on all samples within an experiment. Threshold settings should be determined in a small representative pilot sample and used consistently throughout the experimental image stacks. Thresholding should cover 100% of the cell boundary. Data should always be analyzed in a blinded and unbiased manner. To return to the default view of the image, click the “Reset” button on the bottom right corner of the screen. Once satisfied with the thresholding, click the blue arrow to advance to the next step.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/540-Fig3.jpg\nFigure 3. Creating a surface render that accurately represents the cell boundaries\nThresholding images is extremely important to creating an accurate surface render that overlaps 100% of cell boundaries without picking up background noise. These settings are dependent on exposure during acquisition and brightness settings in Imaris. Be sure that all images analyzed are not over- or under-exposed which would result in incorrect surface renders.\n(A–C) Examples of thresholding microglia by absolute intensity with an example of an (A) under-representative threshold setting, (B) a representative threshold setting and (C) an over-representative threshold setting.",
    "(D–F) Examples of thresholding OPCs by absolute intensity with an example of an (D) under-representative threshold setting, (E) a representative threshold setting and (F) an over-representative threshold setting. Threshold setting values required to create a representative surface render will vary based on raw fluorescence intensities. It is important to be consistent with image acquisition and processing to ensure low variability of fluorescent intensities between image stacks. Scale bars, 10 μm.\nThe next step allows additional filtering of the surface render. For this protocol, leave the default filter for “Number of Voxels” set to 10 which will remove any small particles. This option may be optimized for different studies, but should be kept consistent for all image stacks within a study. Click the green double arrow button to complete the surface render for microglia. There will now be a green 3D surface render on top of the cells (Figure 2[href=https://www.wicell.org#fig2]D). This surface render can be turned off at any time by clicking the checkbox for “Microglia” under the “Scene” window.\nSince microglia tend to cluster in tissue, it is important to manually edit the 3D surface render to accurately represent individual cells, using bisbenzimide staining of nuclei to determine if objects are cellular. This becomes important for analysis metrics such as determining the number of microglia and their average volume.",
    "To begin, select the microglia surface render in the “Scene” window. To view the surface render objects individually, click the “Color” button within the bottom menu as shown by a rainbow hexagon. Change the “Color Type” to “Object ID” to view objects in separate colors. The final edited surface render should show each individual cell as a different color, and objects which are not cells (as determined by no nuclear staining) should be deleted. To do this, some objects may need to be merged together in the instance that a cell has been separated in the surface render. This can be done using the “Unify” feature. Other cells may be clustered within one object and need to be separated, which can be done with the “Split” feature. To begin editing the surface, select the “Edit” button shown as a pencil icon to open the editing menu.",
    "To edit, it is necessary to move the image around using the “Navigate” feature of the pointer, but also select individual objects using the “Select” feature of the pointer. This can be done by clicking the buttons to switch between each function of the pointer, or by pressing the “Esc” key to toggle between the two functions. To zoom in and out of an area, scroll the mouse while the pointer is set to “Navigate.” The selection box size can also be changed by scrolling the mouse while the pointer is set to “Select.” Moving from one side of the image to the other in an organized way to review all cells, begin navigating through to merge or separate objects. To move to a new field within the image, right click and drag the image while in “Navigate” mode. It may be helpful to continuously turn the surface render on and off to view the raw image by clicking the checkbox next to the “Microglia” surface within the “Scene” window. Additionally, it is recommended to use a nuclear stain such as bisbenzimide in the DAPI channel to identify cells. Turning the channels on and off within the “Display Adjustment” window is helpful for this.\nTo merge two or more objects, select the first object by clicking on it while the pointer is in “Select” mode, then hold the “Ctrl” key and click any additional objects that need to be merged together. The objects should turn yellow as they are selected. Once all areas needed to be merged are selected and appear yellow, click the “Unify” button under the “Editing” window. The objects should all turn the same color indicating that they are now one object.",
    "To separate two objects, be sure that the “Edit” menu is selected first (this feature will only work in edit mode). Using the nuclear stain to identify individual cells, determine where the object needs to be cut. One limitation of this software is that it can only cut vertical lines. Therefore, using the “Navigate” feature of the pointer, move the object around to orient it in a way that allows the object to be cut in the correct location using a vertical line. Switch the pointer to “Select” mode once the object is in the correct position for the cut and hold down the “Shift” key, then click the object. A line should appear to indicate where it will be cut. If this line is not appropriate, click the “Clear Scissor” button on the editing tab. Switching back to “Navigate” with the pointer, move the object to the correct position and create a new cut in the Select mode of the pointer, holding the “Shift” key and clicking the correct area. Once the line appears in the correct location for the cut, click the “Cut Surface” button under the editing tab. The two objects should turn different colors to indicate that they are cut and now separate objects. In some situations, you may need to cut objects and re-unify them, or unify objects before cutting them to get the correct orientations. At the end, be sure that each cell is labeled a single unique color. Doing this precisely is essential for accurate results.",
    "It may also be necessary to select individual objects that are artifacts and delete them. To do this, be sure that the pointer is set to “Select” and click on the object, then click the “Delete” button under the edit menu for the surface render. It may be helpful to set parameters for objects that should be excluded by volume or sphericity based on the dataset. To check parameters for an individual object before deleting it, click the “Statistics” button shown as a data chart within the bottom menu, followed by selecting “Detailed” to use the dropdown menu to select various parameters such as volume or sphericity. In some cases, it may be necessary to delete all objects below 10 μm3 for example, which may be easier to do at the beginning of the editing process if it is not removing any important regions. However, it is recommended to do this again at the end of the editing process if any objects were cut, as they often leave small fragments behind as separate objects. This depends on the images and the amount of artifact which will need to be optimized for the dataset. To do this, sort all of the objects by volume from smallest to largest, click the largest object within the specified range (such as 10 μm3) then hold the “Shift” key and click the smallest object within the list. All objects within this volume should be selected (as shown by the yellow color) and can be deleted by clicking the “Edit” tab again and the “Delete” button. All objects that have less than 50% of their cell body within the field or lack a nucleus should also be excluded.",
    "Pause Point: The file can be stored at any time to save the edited surface render. The next step is to create a 3D surface render of the OPCs, which are the same basic steps as listed above for microglia.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Creating surface renders on microglia and OPCs and identifying internalized surfaces, related to (steps 10–15)\nDemonstration of creating surface renders within Imaris software (Bitplane) using the sample image file provided with this manuscript. Surface renders are first created over microglia (green) and OPCs (red) which are edited to accurately represent individual cells using cut and unify tools. Objects are excluded according to the criteria written in this protocol. The internalized areas of OPCs within microglia are identified using the Surface-Surface Coloc XTension to create a surface render (gray).3\n3D cell surface rendering of OPCs\nTiming: ∼1 h per image stack\nThe steps for creating a surface render for OPCs are almost the same as the steps above for microglia. OPCs in the TRITC channel will now have their own 3D render corresponding to their surfaces. This process is demonstrated in Methods video S1[href=https://www.wicell.org#mmc3].\nCreate a surface render for OPCs in the TRITC channel.\nTo start, deselect the surface render of microglia under the “Scene” window. Also deselect the FITC channel from appearing with the “Display Adjustment” window. Select the TRITC channel instead to show the OPCs.\nCreate the surface render by clicking the “Add New Surfaces” icon within the “Scene” window on the left side of the screen which appears as a blue 3D bulbous shape (Figure 2[href=https://www.wicell.org#fig2]C, white arrow 3).",
    "After clicking “Add New Surfaces,” a new line will appear within the “Scene” folder named “Surfaces 2” which can be renamed by double-clicking. Rename it to “OPCs” for better organization.\nWith the “OPCs” surface selected, navigate to the menu below with the tab “Create” selected by default. Again, leave the “Default” selection in the dropdown menu and make sure that the “Segment a Region of Interest” button is not selected. Click the blue arrow button on the bottom to advance to the next step of creating the surface render.\nIn the “Source Channel” step, select the TRITC channel to create a surface render on OPCs. The smoothing setting for OPCs should be 0.4 μm smoothing (Figure 2[href=https://www.wicell.org#fig2]E), which corresponds to the cell boundary based on the spherical OPC morphology as we have previously described (Nemes-Baran et al., 2020[href=https://www.wicell.org#bib3]). Be sure to use the same settings on all image stacks for the study to remain consistent. Select “Absolute Thresholding” for this protocol. Click the blue arrow to advance to the next step.\nUsing the histogram as before, threshold the image until the gray surface accurately represents the surface of the cells. Examples are given for under-representative, representative and over-representative thresholding (Figures 3[href=https://www.wicell.org#fig3]D–3F, respectively). For this protocol, do not enable the “Split Touching Objects” option. Once satisfied with the thresholding, click the blue arrow to advance to the next step.",
    "Apply the same filter as before by leaving the default filter for “Number of Voxels” set to 10 which will remove any small particles. This option may be optimized for different studies, but should be kept consistent for all image stacks within a study. Click the green double arrow button to complete the surface render for OPCs. There will now be a red 3D surface render on top of the cells (Figure 2[href=https://www.wicell.org#fig2]E). This surface render can be turned off at any time by clicking the checkbox for OPCs under the “Scene” window. To view a merge of both microglia and OPC surface renders, check the “Microglia” surface render under the “Scene” window (Figures 2[href=https://www.wicell.org#fig2]F and 4[href=https://www.wicell.org#fig4]A, white box).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/540-Fig4.jpg\nFigure 4. Identifying internalized surfaces by microglia on OPCs using 3D surface renders\n(A) Screen view of Imaris software containing the sample image (file provided with this manuscript) with surface renders for microglia (green) and OPCs (red). Surface renders appear in the “Scene” menu as shown by the box on the left side of this image, and each surface can be turned on or off by selecting the checkboxes next to each render. Scale bar, 30 μm.",
    "(B) After surface renders have been created over microglia and OPCs, the internalized surface of OPCs within microglia can be identified with a ColocSurface render. Follow the steps in the protocol to create a Random Color Map on the TRITC channel first. While the OPC render is selected in the “Scene” menu as described in A, click the “Tools” icon in the lower window of the left side of the screen (white arrow 1; shown as a gear, enlarged in this figure). Select “Surface-Surface coloc” (white arrow 2) and follow the steps in the protocol to create a new surface identifying areas on OPCs that are internalized by microglia.\n(C) Once a new surface has been created, a new channel will appear (white arrow 3) under the “Display Adjustment” window. Before the ColocSurface render is created, a “Masked TRITC” channel should be generated, as described in the protocol.\n(D) Within the “Scene” menu, a new surface (white arrow 4) will appear corresponding to the ColocSurface render. It can be turned on or off using the checkbox.",
    "(E–K) (E) ColocSurface Render, (F) OPC Render, (G) Microglia Render, and (H) Merge from the sample image file that is provided with this manuscript. Scale bars, 30 μm. Region of the sample file showing (I) SurfaceColoc on (J) OPCs not interacting with microglia (asterisk), being contacted by microglia (arrow) and engulfed by microglia (arrowhead) with (K) microglia overlay. See Methods video S1[href=https://www.wicell.org#mmc3] for this process. Scale bars, 10 μm. Note: the microglia render transparency was reduced in H and K to show internalized regions (gray) on OPCs. This can be done by clicking on the microglia render, selecting the “Colors” tab from the options window on the lower left side of the screen, clicking “Base” for the color type and adjusting the “Transp.” percentage under the RGB tab.\nOPCs should be more spaced out than microglia, but it’s still necessary to manually edit the 3D surface render to accurately represent individual cells. This is especially important for analysis of engulfment, as the equation uses the OPC volume to determine the level of contact. Take the time necessary to ensure all cells are individual objects that colocalize with bisbenzimide, a marker of cell nuclei. As we have previously described (Nemes-Baran et al., 2020[href=https://www.wicell.org#bib3]), OPC surface rendering also filters out any surfaces with a volume less than 10 μm3 and sphericity value lower than 0.49 to exclude pericytes on blood vessels that express the NG2 marker. These criteria were determined based on the size of pericytes on blood vessels as reported (Peppiatt et al., 2006[href=https://www.wicell.org#bib5]).\nBe sure that the “OPCs” surface render is selected in the “Scene” window. Click the “Color” button within the menu as shown by a rainbow hexagon. Change the “Color Type” to “Object ID” to view objects in separate colors.",
    "Working from one side to the other as before, begin navigating through the image to merge or separate objects.\nAs described above, to merge two or more objects, select the first object by clicking on it while the pointer is in “Select” mode, then hold the “Ctrl” key and click any additional objects that need to be merged together. The objects should turn yellow as they are selected. Once all areas needed to be merged are selected and appear yellow, click the “Unify” button under the Editing window. The objects should all turn the same color indicating that they are now one object.",
    "To separate two objects, be sure that the “Edit” menu is selected and determine where the object needs to be cut. Move the object around to orient it in a way that allows the object to be cut in the correct location using a vertical line. Switch the pointer to “Select” mode once the object is in the correct position for the cut and hold down the “Shift” key, then click the object. A line should appear to indicate where it will be cut. If this line is not appropriate, click the “Clear Scissor” button on the editing tab. Switching back to “Navigate” with the pointer, move the object to the correct position and create a new cut in the “Select” mode of the pointer, holding the “Shift” key and clicking the correct area. Once the line appears in the correct location for the cut, click the “Cut Surface” button under the editing tab. The two objects should turn different colors to indicate that they are cut and now separate objects. At the end, be sure that all cells are labeled a different color to indicate that they are each a separate object. Each individual cell should only be one color, indicating that they are single objects. Doing this precisely is essential for accurate results.",
    "If using NG2 as a marker of OPCs such as with the NG2:dsRed transgenic mouse or immunostaining for NG2, blood vessels will need to be excluded from the surface rendering as pericytes also express NG2. Since OPCs are spherical at this stage in development, pericytes and blood vessels can be excluded by volume and sphericity parameters. To exclude them, click the “Statistics” button shown as a data chart within the bottom menu, followed by selecting “Detailed” to use the dropdown menu to select volume. Sort all of the objects by volume from smallest to largest, click the object closest to 10 μm3 then hold the “Shift” key and click the smallest object within the list to select all objects 10 μm3 or less. All objects within this volume should be selected (as shown by the yellow color) and can be deleted by clicking the “Edit” tab again and the “Delete” button. Next, sort the objects in the same way by sphericity, which is another option available within the dropdown menu of “Statistics” under “Detailed” view. Sort the objects by sphericity from smallest to largest. Select all objects with a sphericity less than 0.49 and delete them. This should exclude blood vessels and pericytes from the sample, but additional objects may be excluded by the lack of a nucleus as shown by nuclear markers in the DAPI channel. Objects that have less than 50% of their cell body within the field or lack a nucleus should also be excluded.",
    "Pause Point: The file can be stored at any time to save the edited surface renders. Next, a new surface render will be created to identify any OPC surfaces that are internalized within microglia using the Surface-Surface Coloc XTension. Contact Bitplane for support with your Imaris software to ensure that this XTension is installed.\nIdentify internalized surfaces\nTiming: ∼15 min per image stack\nNow that there are 3D surface renders for microglia and OPCs (Figure 4[href=https://www.wicell.org#fig4]A), Imaris can determine what volume is internalized using the Surface-Surface Coloc XTension. This will create a new 3D surface render of the internalized material with information available on volume that can be used to identify OPCs that are being engulfed (>15% of the cell is internalized) or just contacted (<15% of the cell is internalized). These categories were based on our previously published observations, showing microglia contacting OPCs but not engulfing OPCs (Nemes-Baran et al., 2020[href=https://www.wicell.org#bib3]). Therefore by testing analyzed data with other values (10%, 20%, 25%), it was determined that 15% accurately categorizes cell engulfment with no false positives or negatives observed consistently. While analyzing the data, spot-checking can be conducted to ensure that each cell is being appropriately categorized. It is important to remove particles and objects that fit the exclusion criteria described to avoid false categorizations. This process is demonstrated in Methods video S1[href=https://www.wicell.org#mmc3].\nCreate a Random Color Map on the TRITC channel (or whichever channel is being engulfed) to determine the internalization of this channel.",
    "With the OPCs surface render selected (or whichever surface is being engulfed), click the “Edit” tab as shown by a pencil icon. Click the “Mask All…” button. Choose the TRITC channel (or whichever channel is being engulfed) and click “Random Color Map.” Make sure the “Duplicate channel before applying mask” checkbox is selected. Click “OK” and a new channel should appear in the “Display Adjustment” window that says “Masked TRITC” with a rainbow color.\nCreate a new surface render of the internalized material within microglia.\nClick the “Tools” tab shown by a gear icon within the OPCs surface render menu (Figure 4[href=https://www.wicell.org#fig4]B, white arrow 1).\nClick the “Surface-Surface coloc” link on the very bottom of the list (Figure 4[href=https://www.wicell.org#fig4]B, white arrow 2).\nNote: If this option is grayed out, check that the MATLAB Runtime MCR software is installed. Click “File,” then “Preferences,” select “CustomTools.” If there is an orange link to download a different MATLAB Runtime MCR software, try downloading it to see if the Surface-Surface Coloc option appears. If it is still not working, contact Bitplane Support for assistance in activating this XTension within the Imaris software installed on the device.\nA dialog box will appear. Select the two surfaces to colocalize (Microglia and OPCs) and click continue.\nAnother dialog box will appear inquiring about using a smoothing feature. It is recommended not to use this smoothing feature for this protocol.\nA new channel will appear called “ColocChannel” in a gray gradient color within the “Display Adjustment” window (Figure 4[href=https://www.wicell.org#fig4]C, white arrow 3).",
    "New objects will also appear which represent the internalized area of OPCs within microglia. They will have their own 3D surface render within the “Scene” window called “ColocSurface” (Figure 4[href=https://www.wicell.org#fig4]D, white arrow 4). To view individual surface renders, click the checkbox to select each render to view individually (Figures 4[href=https://www.wicell.org#fig4]E–4G) or merged together (Figure 4[href=https://www.wicell.org#fig4]H). Viewing surfaces separately and together can identify regions on the OPCs that have a large volume internalized (Figures 4[href=https://www.wicell.org#fig4]I–4K).\nPause Point: The file can be stored at any time to save the edited surface renders. One option is to create surface renders on all of the files first, then move on to the data analysis.\nQuantification of engulfment\nTiming: ∼1 h per image stack\nAfter all cells have 3D Surface Renders and the internalized portion of OPCs has its own 3D Surface Render, the data can be analyzed for engulfment. The ColocSurface render represents the voxels labeled in both the OPC and microglia surface volumes that come in contact with each other. This step will use the volume from the ColocSurface render divided by the volume from the OPCs to determine the overall amount of internalization for that cell. This process is demonstrated in Methods video S2[href=https://www.wicell.org#mmc4].\nFirst, obtain the volumes for all internalized surfaces.\nWith the ColocSurface render selected, click the Statistics tab as shown by a chart icon (Figure 5[href=https://www.wicell.org#fig5]A, white box), then click “Detailed” view.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/540-Fig5.jpg\nFigure 5. Quantifying microglial engulfment of OPCs",
    "(A) Select the ColocSurface render in the “Scene” menu and click the “Statistics” tab (denoted by a graph icon, enlarged in the image) in the window of the bottom left corner of the screen. Click “Detailed” and select “Volume” from the second drop-down menu to display the volumes of each ColocSurface render. These values can be exported by clicking “Export Statistics on Tab Display to File” (save icon) on the bottom of the window. This process is demonstrated in Methods video S2[href=https://www.wicell.org#mmc4].\n(B) To calculate the OPC internalization within microglia, use the calculation shown to determine percent internalization.\n(C) Cells that are only contacted by microglia are categorized as < 15% internalization as shown by the example image.\n(D) Cells that are engulfed by microglia are categorized as ≥ 15% internalization as shown by the example image. Scale bars, 5 μm.\n(E) A template with these calculations has been provided with this manuscript. Follow the instructions within the protocol and demonstrated in Methods video S2[href=https://www.wicell.org#mmc4] to calculate percent internalization for each ColocSurface/OPC.\n(F) Bar graph showing the percentage of interactions within the sample image file, including contacted (55.56%), engulfed (44.44%), and total interactions (100%).\n(G) The number of total microglia (56) and OPCs (89) within the sample image file. This number may vary depending on how the objects were unified, cut, and removed and may slightly differ from these results.\n(H) The average volume of all microglia (434.06 ± 30.93) and OPCs (216.68 ± 13.12) within the sample image file.\n(I) The average sphericity of all microglia (0.48 ± 0.01) and OPCs (0.82 ± 0.01) within the sample image file. Error bars represent ± SEM. Note: these data can also be represented as normalized to wild-type conditions or by area of the field.",
    "Sort the objects by volume by selecting Volume in the dropdown menu and sort smallest to largest by clicking “Volume” in the table of data.\nDelete any surface that is less than 1 μm3 to avoid any particles that may be present.\nExport the data by clicking the “Export Statistics on Tab Display to File” button that is shown as a single blue disc icon. The data will be saved as a .csv file, and can be opened in Excel and resaved as an Excel Workbook (.xlsx) format at any time.\nNote: If the file name is long, has non-alphabetical characters, or the path is within multiple folders, it may not save properly and an error message will appear as “Could not write to file.” In this situation, try to rename the file something simpler or save it to a location with a shorter path.\nTo quantify engulfment, calculate percent internalization by dividing the internalized surface volume (ColocSurface) by the total volume of the OPC (Figure 5[href=https://www.wicell.org#fig5]B). Cells can be categorized by the percent internalization, with cells only contacted by microglia having a percent internalization < 15% (Figure 5[href=https://www.wicell.org#fig5]C) and cells that are engulfed by microglia having a percent internalization ≥ 15% (Figure 5[href=https://www.wicell.org#fig5]D). To do this in Excel, set up new columns within the Excel sheet to manually enter the volume for the OPC that the ColocSurface corresponds with. Then, set a new column to divide the internalized volume by the total OPC volume to calculate percent internalization. A template Excel sheet (Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/540-Mmc2.xls]) is available with these labels and the calculations described in this protocol. If using the sample image file, export the data then copy and paste it into the provided template.",
    "Within the exported data file, create a new section of columns to input parameters for the OPC that corresponds to the ColocSurface volume. New columns should include corresponding OPC ID, volume and percent internalization (Figure 5[href=https://www.wicell.org#fig5]E).\nWithin the Imaris software, organize the ColocSurface render volume data by ID from smallest to largest. This should match the data organization within the data file.\nClick the first object of the ColocSurface render. Its volume should match the volume in the data file for that ID.\nTurn the surface render on for the OPCs to view the cell that this volume corresponds with. Click the OPC to determine its volume and ID. Enter the information within the data sheet to correspond with the appropriate ColocSurface ID.\nCalculate percent internalization by dividing the ColocSurface volume by the OPC volume. Set the format of the percent internalization column to percentage by right-clicking the column, then “Format Cells…” and select “Percentage,” then click “OK.” This will now show the percentage of engulfment for this particular OPC.\nContinue through each ColocSurface volume and match it with the appropriate OPC surface render. Enter the data as directed in the above steps until the data sheet is complete.\nCellular interactions can now be categorized by OPCs that are contacted by microglia (cells with < 15% internalization) or OPCs that are engulfed by microglia (≥ 15% internalization). These parameters may be altered for different applications.\nCritical: Be sure to carefully enter the information for the corresponding OPC, as the volume of the internalized material divided by the total volume of the OPC is what determines the percent internalization. If the wrong OPC is selected for an individual ColocSurface volume, the data can be drastically skewed.",
    "Note: In some cases when a cell is completely encapsulated, the percent internalization can be slightly greater than 100% as shown in Methods video S2[href=https://www.wicell.org#mmc4]. This will only occur with complete cell engulfment from slightly overlapping surfaces due to the different smoothing settings used for each cell (0.1 μm for microglia and 0.4 μm for OPCs).\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Quantification of internalized areas on OPCs and data analysis for microglial engulfment of OPCs, related to (steps 16 and 17)\nSample image file with surface renders created in Methods video S1 is quantified for percent internalization using the calculations described in Figure 5. Areas on OPCs (red) that are internalized within microglia (green) are divided by the total volume of the corresponding OPC to determine its percent internalization within the microglial cell. Cells with percent internalization < 15% are considered contacted by microglia. Cells with percent internalization ≥ 15% are considered engulfed by microglia.4"
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Model Organisms",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}