{
  "id": 2274,
  "origin_website": "Cell",
  "title": "In vitro analyses of paracrine effects of murine classically activated macrophage on beige adipocyte metabolism",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation and culture of bone-marrow-derived macrophage\nTiming: 6–7 days\nEuthanize 8–12 weeks old CD-1 mice according to an approved IACUC protocol.\nIsolate the femurs and tibias at joint, and remove skin and muscle as clear as possible.\nWash 3 times with PBS, then transfer to a new 10 cm dish with PBS at room temperature (RT: 18°C–24°C).\nCut off the ends of the bones and flush with PBS using a 23-gauge needle. Collect bone marrow in a 50 mL Falcon tube.\nCentrifuge at 400 × g for 5 min at RT (18°C–24°C) and aspirate supernatant.\nResuspend pellet in 4 mL of BMDM growth medium.\nOverlay 4 mL of bone marrow (per mouse) over 3 mL of Ficoll-Paque PLUS Media in a 15 mL tube.\nCritical: As slowly as possible, to form a separate and distinct layer.\nCentrifuge for 20 min at 600 × g at RT (18°C–24°C), no brake (deceleration rate is 0). Take ∼45 min.\nCritical: Do not centrifuge at cold condition because the density of Ficoll will change.\nCollect all the supernatant (both Ficoll and BMDM medium, but not the pellet) into a 50 mL tube.\nAdd 25 mL pre-warmed PBS and mix well.\nCentrifuge for 5 min at 200 × g.\nResuspend the cell pellet in BMDM growth medium and plate into 2 Falcon dishes (15 cm).\nCritical: Do not use cell culture dish, which will make it difficult to digest differentiated BMDM.\nOn day 3, 5 and 6, aspirate medium gently and add fresh BMDM growth medium.\nCritical: It is very important to change the medium at day 5 and 6 for the differentiation of BMDM. (Troubleshooting 1[href=https://www.wicell.org#sec6.1])\nBy day 7, cells should be fully differentiated and are ready to be plated.",
    "Wash cells with 5 mL PBS once, and then incubate with 5 mL 5 mM EDTA (in PBS) for 5 min in cell incubator.\nNote: Do not use trypsin for digestion, which will activate the macrophage, and the digestion should not be longer than 10 min. (Troubleshooting 3[href=https://www.wicell.org#sec6.5])\nView cells under microscope to ensure that half of cells are detached.\nAdd another 5 mL pre-warmed BMDM growth medium to stop the digestion by EDTA and resuspend the cells.\nCentrifuge for 5 min at 200 × g.\nResuspend the cell pellet with 5 mL BMDM growth medium.\nCount and adjust the final cell density to 4–6 × 10ˆ5/mL.\nPlate 1 mL cell suspension per well into a 12-well cell culture plate.\nAfter 8–16 h, the plated mature macrophages are stimulated with PBS or 100 ng/mL lipopolysaccharide (LPS) for 4 h (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1742-Fig1.jpg\nFigure 1. Bright-field images illustrating the differentiated BMDM before (left) and after (right) 100 ng/mL LPS treatment for 4 h\nScale bar represents 400 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1742-Fig2.jpg\nFigure 2. qRT–PCR analysis of proinflammatory gene expression in BMDM treated by 100 ng/mL LPS for 4 h\nData are represented as mean ± SEM. ∗∗∗∗P < 0.0001 by two-tailed Student’s t test.\nOptional: You can also polarize the BMDM to classically activated macrophage or alternatively activated macrophage by 10 ng/mL LPS or 10 ng/ml IL-4 treatment for 24–48 h.\nAspirate medium gently, then wash with pre-warmed PBS twice and add fresh BMDM growth medium.\nAfter 12 h, the conditioned medium is collected for cell treatment or stocked at −80°C.\nFor extracting RNA of BMDM, add 350 μL TRIzol per well and transfer to 1.5 mL tubes. Then perform qRT–PCR to analyze proinflammatory gene expression in BMDM (Figure 2[href=https://www.wicell.org#fig2]).\nPreparation and culture of SVF-derived beige adipocyte\nTiming: 9–10 days",
    "Add 5 mL pre-chilled scWAT digestion buffer to a 6 cm dish.\nEuthanize 12–16 days old CD-1 mice according to an approved IACUC protocol.\nSoak mice with 70% ethanol.\nPlace mouse ventral side up, and make central incision from the base of the tail extending to the sternum.\nNote: Make sure not to penetrate the peritoneal cavity.\nPull ventral skin away from both flanks gently and slowly.\nIdentify the scWAT depot, then use scissor to trace the edges of the tissue and cut along the way until the entire depot is detached from the skin (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1742-Fig3.jpg\nFigure 3. Illustration of scWAT dissection\nTransfer dissected scWAT into pre-chilled scWAT digestion buffer in a 6 cm dish immediately.\nWash scWAT twice with pre-chilled scWAT digestion buffer.\nTransfer the tissues to a 1.5 mL tube with 200 μL scWAT digestion buffer supplemented with 600 IU/mL collagenase type I.\nMince the tissues by using sterile surgical scissors. Tissue pieces should be ∼1–2 mm thick.\nTransfer tissues and scWAT digestion buffer into a 50 mL sterile conical tube containing 15 mL scWAT digestion buffer supplemented with 600 IU/mL collagenase type I.\nPlace the tube horizontally and digest tissues at 37°C with shaking at 100 rpm for 40–60 min.\nNote: Digestion time depends on disappearance of visible pieces of adipose tissue, but no more than 60 min.\nAdd 15 mL scWAT digestion buffer to stop the digestion.\nSuspend tissues promptly by 10 mL pipette until tissue pieces are no longer visible.\nCentrifuge the cells for 5 min at 200 × g.\nCompletely remove mature adipocyte layer and aspirate supernatant gently.\nOptional: The mature adipocytes at the upper layer can be collected for analysis.\nResuspend SVF cell pellet in 5 mL scWAT digestion buffer.\nFilter the cells by 75 μm cell strainer.",
    "Rinse the cell strainer with another 5 mL scWAT digestion buffer.\nCentrifuge the cells for 5 min at 200 × g.\nAspirate supernatant and resuspend SVF cell pellet with beige adipocyte maintenance medium. (SVF cells from every mouse (two pieces of scWAT) resuspended by 2 mL medium).\nPlate 1 mL cell suspension per well into a 12-well flat-bottom plate.\nNote: The SVF cells from one mouse can be seeded to 2 wells of 12-well flat-bottom plate.\nAfter 12–24 h, remove the beige adipocyte maintenance medium carefully and wash the cells with pre-warmed PBS for twice.\nChange beige adipocyte maintenance medium every 2 days until the cells reach 90% confluent.\nWhen the cells reach 90% confluent (day 0), remove beige adipocyte maintenance medium and add 1 mL beige adipocyte induction medium per well.\nCritical: Beige adipocyte induction medium has to be prepared freshly prior to usage.\nOn day 2, remove beige adipocyte induction medium and add 1 mL beige adipocyte differentiation medium per well.\nCritical: Beige adipocyte differentiation medium has to be prepared freshly prior to usage.\nOn day 4, remove the medium and add 1 mL fresh beige adipocyte differentiation medium per well.\nChange beige adipocyte differentiation medium every day until the cells are fully differentiated to beige adipocyte on day 7–8 (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1742-Fig4.jpg\nFigure 4. Bright-field images illustrating the differentiated beige adipocyte\nScale bar represents 400 μm.\nBMDM conditioned medium treatment for western blot analysis\nTiming: ∼24 h\nRemove beige adipocyte differentiation medium of beige adipocyte and add 0.5 mL beige adipocyte maintenance medium per well.\nAdd 0.5 mL conditioned medium from PBS- or LPS-treated BMDM per well.\nCulture at 37°C 5% CO2 for 12 h.\nAdd vehicle (Veh) or 50 nM norepinephrine to differentiated beige adipocyte directly without changing the medium.",
    "Culture at 37°C 5% CO2 for 8 h.\nRemove the medium and wash cells twice with pre-chilled PBS.\nRemove as much of the PBS as possible.\nAdd 300 μL RIPA supplemented with protease inhibitor cocktail per well.\nResuspend the cells and transfer to 1.5 mL tubes.\nLyse the cells for 10 min on ice and then vortex.\nCentrifuge for 20 min at 15,000 × g and transfer 200 μL supernatant to 1.5 mL tubes.\nNote: Avoid to aspirate or contact the sediment as carefully as possible. (Troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nAdd 1/5 volume of 6 × Loading buffer (E.g. add 40 uL 6 × loading buffer into 200 uL supernatant), and boil for 10 min at 95°C.\nStore at -20°C until western blot analysis."
  ],
  "subjectAreas": [
    "Metabolism",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}