{
  "id": 11820,
  "origin_website": "Jove",
  "title": "Simple and Fast Rolling Circle Amplification-Based Detection of Topoisomerase 1 Activity in Crude Biological Samples",
  "procedures": [
    "NOTE: Find a list of buffer compositions, equipment, and other materials required in Table of Materials.\n1. Cell culture\nCulture the preferred cells in suitable medium and grow them according to instructions. As an example, grow Caco2, colorectal adenocarcinoma-derived cells, in Minimal Essential Medium (MEM) supplemented with 20% fetal bovine serum (FBS), 1% non-essential amino acids (NEAA), 100 units/mL penicillin, and 100 mg/mL streptomycin. Maintain the cell cultures in a humidified incubator (5% CO2/95% air atmosphere at 37 °C). Plate the cells into tissue culture flasks and split every 3 days to maintain the cells at 70% confluency.\nHarvest the cells from an 70% confluent flask by trypsin treatment (0.25% trypsin, 0.02% EDTA solution) and wash with phosphate buffered saline (PBS).\nResuspend the cell pellet in PBS to adjust the cell concentration to 0.5 × 106 cells/tube. Spin at 200 × g for 5 min and carefully aspirate the supernatant.\n\t​NOTE: Cells used for REEAD must be used fresh and kept on ice. The results obtained with Caco2 cells has been recently published17. The assay has been tested with a variety of cell lines, including colon, breast, lung, and cervical cancer derived cells18,19,20,21,22,23, but it can be used with all crude biological samples containing TOP1, such as tissues, blood, and saliva.\n2. Preparation of functionalized slides\nAttach the custom-designed silicone isolator grid to the functionalized slide, thereby making the wellmaker. Press the silicone to avoid the formation of air bubbles (see Figure 1A).\nPrepare a mixture of 5 µM 5'-amino primer in 1x print buffer. Add 4 µL of the mixture to each well and put the wellamker in a hybridization chamber with saturated NaCl at temperatures between 15 °C and 25 °C, protected from light.",
    "NOTE: A hybridization chamber can easily be made by using a pipette tip box filled with saturated NaCl. The hybridization takes a minimum of 16 h and a maximum of 72 h. See the sequence of the 5'-amino primer in Figure 1B. The slides are functionalized with NHS groups to allow for the binding of amino-modified oligonucleotides.\n3. Generation of closed circular substrates\nPreparation of closed circular substrates with recombinant TOP1 or cell extract.\n\t\nLyse a cell pellet of 0.5 × 106 cells in 500 µL of Lysis Buffer to reach a cell density of 1,000 cells/µL. Incubate for 10 min on ice.\nPrepare a circle mixture of 2 µL of 5 µM TOP1-specific substrate (the sequence of the substrate is as following: 5'-AGA AAA ATT TTT AAA AAA ACT GTG AAG ATC GCT TAT TTT TTT AAA AAT AAA TCT AAG TCT TTT AGA TCC CTC AAT GCA CAT GTT TGG CTC CGA TCT AAA AGA CTT AGA-3') and 2 µL of recombinant TOP1 enzyme or 2 µL of cell extract (see step 3.1.1) in 16 µL of 1x TOP1 Reaction Buffer.\n\t\t​NOTE: The concentration of recombinant TOP1 used depends on the readout method chosen (see Figure 2, Figure 3, Figure 4, and Figure 5). See the sequence of the TOP1-specific substrate in Figure 1C.\nIncubate for 30 min at 37 °C (see Figure 1C,D).\nStop the reaction by adding 2 µL of 1% SDS.\nPreparation of closed circular substrates in the presence of drugs\n\t\nPrepare a circle mixture of 2 µL of 5 µM TOP1-specific substrate and 1 µL of 100% DMSO or 1 µL of 1.6 mM camptothecin (CPT) in 14 µL of 1x TOP1 Reaction Buffer. Add 2 µL of 5 ng/µL recombinant TOP1 enzyme.",
    "NOTE: Other small molecule compounds or drugs can be used. In that case, a titration of the compound should be made. If the compound is dissolved in a solvent other than DMSO, this should be used as a control instead of DMSO.\nIncubate for 1 min at 37 °C.\nStop the reaction by adding 2 µL of 1% SDS.\n​NOTE: Step 3 can be started in parallel with step 2, and the circles can be stored at 4 °C overnight. Alternatively, the DNA circles can be prepared at the same time as step 4 and used immediately. See the sequence of the TOP1-specific substrate in Figure 1C. The substrate folds into a dumbbell shape with a double stem region containing a preferred TOP1 cleavage site and two single-stranded loops. The open dumbbell substrate is converted into a closed circular substrate by TOP1-mediated cleavage and ligation and is hereafter referred to as a circle. As there is an excess of the 5'-amino primer, there will be no competition between open and closed TOP1-specific substrates.\n4. Blocking of the wellmaker\nImmerse the wellmaker in a 5 cm x 5 cm tray filled with Buffer 1 that was preheated to 50 °C. By using a pipette, push the liquid inside the wells to make sure that there are no air bubbles. Incubate for 30 min at 50 °C.\nRemove Buffer 1 and wash 2 x 1 min with dH2O. Shake vigorously by hand.\nAdd Buffer 2 that has been preheated to 50 °C. Make sure that there are no air bubbles in the wells. Incubate for 30 min at 50 °C.\nWash 2 x 1 min with dH2O. Shake vigorously by hand.\nWash with 70% EtOH for 1 min. Shake vigorously by hand.\nLet the wellmaker setup air-dry.",
    "​NOTE: Use compressed air to dry the wells. Alternatively, it is possible to blow air using a Pasteur pipette. Ensure that the wells are dry before proceeding.\n5. Hybridization of the circles to the wellmaker\nAdd 4 µL of the circles (made in step 3) to each corresponding well.\nPlace the wellmaker in a humidity chamber for 1 h with dH2O at 37 °C.\n\t​NOTE: A humidity chamber can be made by using a box for pipette tips filled with dH2O. Alternatively, the hybridization can be done overnight at 25 °C in the humidity chamber.\n6. Washing\nWash the wellmaker with Buffer 3.\nRemove Buffer 3 and replace with Buffer 4.\nRemove Buffer 4 and wash with 70% EtOH.\nRemove the EtOH and let the wellmaker dry.\n\t​NOTE: All the washing steps are performed for 1 min in a 5 cm x 5 cm tray by fully submerging the slide. Always make sure that there are no air bubbles inside the wells.\n7. Rolling circle amplification\nPrepare an RCA mixture of 1x Phi29 Reaction Buffer supplemented with 0.2 µg/µL BSA, 1 unit of Phi29 polymerase, and either 0.25 mM dNTP and 0.0125 mM ATTO-488-dUTP for fluorescence readout, or 0.1 mM dATP, 0.1 mM DTTP, 0.1 mM dGTP, 0.09 mM dCTP, and 0.01 mM Biotin-dCTP for colorimetric/chemiluminescence readout. Add 4 µL to each well. See Figure 1E.\n\tNOTE: Preparation of the RCA mixture must be done on ice. When incorporating fluorescent nucleotides in the RCA, avoid direct light from this step to protect the fluorophores.\nIncubate for 2 h at 37 °C in the humidity chamber. In case of fluorescent nucleotides used, set the humidity chamber in the dark. See Figure 1F,G.\n8. Washing",
    "For the chemiluminescence or colorimetric readout protocols, wash the wellmaker as in step 6, and then proceed to step 11.\nFor the fluorescence readout protocol, remove the silicone grid using tweezers before washing as in the following steps.\n\t\nWash the slide for 10 min in Buffer 3.\nRemove Buffer 3 and replace with Buffer 4. Wash for 5 min.\nRemove Buffer 4 and wash for 1 min in 70% EtOH.\nRemove the EtOH and let the wellmaker dry.\n9. Visualization of fluorescent rolling circle products using a fluorescence scanner\nScan the slide in a fluorescence scanner using the filters corresponding to the fluorophore used. Use the maximum photomultiplier possible that does not give saturation.\n\tNOTE: The fluorescent scanner used for image acquisition in this protocol is equipped with a 473 nm laser and a FAM filter-excitation 490 nm, emission 520 nm.\nImport the picture into ImageJ and change the image type to 8-bit (Image | Type | 8-bit). To measure the bands separately, limit the measured area by using the rectangle drawing tool from the toolbar. Draw the desired area and measure the intensity (Analyze | Measure). Then, move the originally drawn area to the next band and measure.\nPlot the data in the desired software. Representative images including quantification extracted from ImageJ are depicted in Figure 2.\n10. Visualization of fluorescent rolling circle products using a fluorescence microscope\nWith an EtOH-resistant pen, draw the position of the wells before removing the silicone grid and wash the slide as in step 8.2. After the washing steps, mount the slide with 1 µL of mounting medium without 4',6-diamidino-2-phenylindole (DAPI) and add a cover glass. To allow for visualization in the camera, glue the slide onto a 76 mm x 26 mm microscope slide.",
    "Analyze using a fluorescence microscope equipped with a 60x oil immersion objective and a camera. Take 12-15 images of each sample/well.\nImport the pictures to ImageJ and stack the images (Image | Stacks | Image to stack). Change the image type to 8-bit (Image | Type | 8-bit).\nSet the threshold (Image | Adjust | Threshold).\n\t\nSet the threshold as follows: set the lower bar and adjust the upper bar so that only the right signals are red and the background is black. Ensure that the threshold is as low as possible before the real signals start to disappear.\nSweep through the individual images and make sure that they correspond to the images before setting the threshold. Note that the threshold may change from experiment to experiment.\nCount the signals (Analyze | Analyze particles). Ensure that the summarized field in the ImageJ settings is checked.\n\t\nExport the results to a spreadsheet or other software for further data processing. Representative images including quantification extracted from ImageJ are depicted in Figure 3.\n11. Coupling of HRP-conjugated anti-biotin antibody to the biotin-labeled rolling circle products\nAdd 4 µL of HRP-conjugated anti-biotin antibody diluted 1:300 in Buffer 5 supplemented with 5% non-fat skimmed milk and 5% BSA to each well.\nIncubate for 50 min at 15-25 °C in the humidity chamber (see Figure 1H).\nWash 3 x 3 min with Buffer 5.\nDry the wellmaker.\n12. Visualization of the biotin-labeled rolling circle products\nVisualization with ECL\n\t\nMix 40 µL of ECL Luminol and 40 µL of H2O2 immediately before use. Add 2 µL to each well.\nVisualize the slide using a CCD camera or on X-ray films.\nVisualization with TMB",
    "After step 11.4, remove the silicone grid. Then, add 400 µL of TMB on top of the entire slide and put the slide in a humidity chamber. Wait for ~5-10 min for color development. After the color development, wash the slide with 70% EtOH.\nVisualize the color development with the naked eye. Take a photograph of the slide with a photo camera or mobile phone.\nImport the picture to ImageJ and change the image type to 8-bit (Image | Type | 8-bit). To measure the bands separately, limit the measured area by using the rectangle drawing tool from the toolbar. Draw the desired area and measure the intensity (Analyze | Measure). Then, move the originally drawn area to the next band and measure.\nPlot the data in the desired software. Representative images including quantification extracted from ImageJ are depicted in Figure 4, Figure 5, and Figure 6."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}