{
  "id": 3587,
  "origin_website": "Cell",
  "title": "Protocol to fabricate wearable stretchable microneedle-based sensors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: The fabrication procedure of the wearable stretchable MN-based patch comprises four main steps. First, the fabrication of the soft stretchable part involves preparing the electrodes by fabricating Ag NWs using a mask through spray coating techniques and annealing at 200°C to achieve conductive electrodes. These electrodes are then transformed into the stretchable SIS substrate. Second, the rigid MNs part is fabricated. This involves designing and preparing PDMS molds using a laser cutter, applying a polymeric solution (polystyrene), drying at 80°C, and demolding to obtain the rigid polymeric MNs templates. A gold deposition is then applied to the electrodes to prepare different biosensors through various modifications. Third, the SIS film is updated using a thickness-gradient strategy. This ensures that the side electrodes are included in the thin part, while the rigid MNs component is loaded onto the thick part. Fourth, the stretchable film created using the thickness-gradient strategy is integrated with the rigid MNs component to obtain a stable, wearable stretchable MN-based patch. In each step, the material types can be optimized and changed based on the requirements. For example, different types of soft, stretchable, and flexible polymers (e.g., styrene ethylene butylene styrene) can be used for fabricating stretchable patches. Various materials can be used for fabricating the electrodes, such as carbon nanotubes and gold nanowires. The thickness-gradient strategy can be employed to combine different types of rigid structures for diverse applications. Additionally, the rigid component can include other types of structures, such as flat components or structures made of different materials apart from polystyrene polymers, including polycaprolactone, polylactic acid, and others. Furthermore, the MNs can be deposited with metals other than gold, such as silver, platinum, and nickel, expanding their range of applications.\nFabrication of Ag NWs\nTiming: 2 days",
    "The synthesis of Ag NWs included purification and modification with thiol. The following steps demonstrate the procedure of synthesizing Ag NWs, purification steps, and thiol modification, as shown in Figure 1[href=https://www.wicell.org#fig1].28[href=https://www.wicell.org#bib28]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig1.jpg\nFigure 1. Synthesis and purification procedure of the Ag NWs\n(A) The setting of the synthesis system, including all required parts.\n(B) The final step in the synthesis to obtain the gray-silver product.\n(C) Schematic of the purification procedures of the Ag NWs (The illustration was created with BioRender.com[href=http://BioRender.com]).\nWash all the glassware with IPA, acetone, and ethanol, then dry in the oven at 80°C for 10 min.\nCAUTION: Wear gloves and goggles, and handle under a chemical hood.\nMeasure 2.49 gr of PVP, put it in a beaker, and mix it with 40 mL of EG. Add a stir bar, place on a hot plate at 60°C, and cover with aluminum foil.\nNote: Wait for solids to dissolve. It can take 10–30 min.\nMeasure 2.54 gr of AgNO3, put it in a beaker, and mix it with 10 mL of EG. Add a stir bar and place on a hot plate at 60°C.\nNote: Wait for solids to dissolve. It can take 10–30 min.\nPrepare FeCl3 and NaCl solution:\n43.83 mg FeCl3 + 5 mL purified water\n43.83 mg NaCl + 5 mL purified water\nPrepare a three-neck round bottom flask stand.\nHalf submerge the three-neck round bottom flask in silicon oil.\nHeat to 160°C, and stir constantly using a stir bar at 500 rpm.\nNote: Be sure to set the thermometer to 160°C to monitor the temperature continuously.",
    "Critical: When heating the round flask at 160°C, the temperature should be controlled and monitored using a thermometer. Be careful not to touch or get too close to the hot plate and the silicon oil to avoid injuries and burns.\nCAUTION: Handle under a chemical hood and be careful of the hot plate.\nAdd a condensation tube on the top of the three-neck round bottom flask and flush dry air inside.\nAdd the EG + PVP solution, including the stir bar, to the three-neck round bottom flask and stir until it reaches 160°C.\nWhen the temperature reaches 160°C, add 100 μL FeCl3 to the flask and wait 5 min.\nAfter 5 min, add 100 μL NaCl.\nAdd the AgNO3 + EG solution in 15 μL/s increments.\nAfter adding all the AgNO3 + EG solution, wait 1.75 h for the reaction.\nStop heating and let cool for 15 min (keep stirring).\nMove the reacted solution to a clean beaker and add 200 mL methanol to stop the reaction.\nNote: Keep the solution in the hood until it cools down to room temperature (20°C–25°C).\nPause point: The solution should be kept in a chemical hood until it reaches room temperature (20°C–25°C).\nDivide the solution into plastic tubes and add ethanol.\nShake the tubes and sonicate for 2 min.\nCentrifuge the tubes at 1006 × g for 6 min, 25°C.\nDisperse the solvent and add new ethanol.\nWash 5 times at least to obtain pure Ag NWs.\nCAUTION: Discharge the solvent waste in a proper chemical waste in a chemical hood.\nSpray some Ag NWs onto A4 paper and check the conductivity. Ohm (Ω) or kilo ohm (KΩ) is good.\nCAUTION: Perform the spray coating of Ag NWs under a chemical hood.",
    "Weight 28 mL glass jars (without cups) and write down the weight of each jar for later calculating the Ag NWs weight.\nDrain the waste after the last centrifuge run.\nAdd around 3 mL of ethanol to clean the plastic tubes of silver and transfer it to the glass jars.\nNote: Make sure not to fill the glass jars to the top. Fill each jar to 1/4 of its max.\nDry ethanol in the glass jars using a vacuum oven at 50°C for 2–4 h.\nCalculate the Ag NWs' weight.\nAg NWs thiol modification\nSuspend 50 mg of dry Ag NWs in 5 mL ethanol/chloroform 1:1 V/V (10 mg/mL) and sonication for 5 min.\nAdd 5 μL of the thiol group 1H,1H,2H,2H-perfluorodecanethiol (10 mg Ag NWs: 1 micron thiol) to obtain Ag NWs modified with 1H,1H,2H,2H-perfluorodecanethiol (Ag NWs-F)\nSonicate the Ag NWs-F solution for 10 min.\nHeat the solution to 80°C–90°C and stir overnight for 12–14 h.\nCAUTION: Handle under a chemical hood and be careful of the hot plate.\nCentrifuge and wash three times with ethanol/chloroform solution: Sonicate (2 min), centrifuge (1006 × g for 6 min, 25°C).\nCAUTION: Wear gloves and goggles and handle under a chemical hood while using chloroform.\nWeight 28 mL glass jars (without cups) and write down the weight of each jar for later calculating the modified Ag NWs’ weight.\nDrain the waste after the last centrifuge run.\nAdd around 3 mL of ethanol to clean the plastic tubes of silver.\nTransfer the solutions to the glass jars.\nDry the ethanol in the glass jars using a vacuum oven at 50°C for 2–4 h.\nCalculate the weight of the final product Ag NWs-F.\nFabrication of the stretchable polymer-The soft part\nTiming: 2 days",
    "The fabrication of the soft stretchable part included forming a thin film of SIS and preparing the electrode by spray coating techniques. The following steps describe the fabrication process of the stretchable polymer part, as shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig2.jpg\nFigure 2. Preparing the Ag NWs electrodes\n(A) Hydrophobic modification of the Si wafer by immersing it in toluene, including trichloro(hexyl)silane.\n(B) Spray coating of the Ag NWs-F electrodes using a mask.\n(C) The sprayed Ag NWs electrodes on the Si wafer after annealing at 200°C for 20 min.\n(D) Setting the parameters of the spin-coater to coat with a thin layer of SIS.\n(E) Adding 100 mg/mL of SIS on the Si wafer.\n(F) Spreading the SIS on the Si wafer to cover the whole area of electrodes.\n(G) The obtained electrodes covered with a very thin layer of SIS.\nSpraying of Ag NWs electrodes\nClean the surface of a silicon (Si) wafer using an oxygen plasma system.\nNote: Use these parameters: O2 50% + Argon (Ar) 50%: Pumping down for 3 min, gas supply 2 min, plasma 3 min, flushing 1 min, and venting for 30 s.\nIn a glass plate, add 80 mL of toluene and then add 8 drops of trichloro(hexyl)silane, 97%.\nCAUTION: Wear gloves and goggles, and handle under a chemical hood.\nAdd the Si wafer inside the solution and cover the plate for 30 min.\nWash the Si wafer with toluene and acetone and dry it with dry air to obtain a hydrophobic Si wafer.\nCAUTION: Wear gloves and goggles, dry, and handle under a chemical hood.\nUse the laser cutter to create a mask using matte self-adhesive paper with the desired shape of the electrodes.",
    "CAUTION: Avoid looking directly at the laser beam during use. Exposure to the laser beam may cause severe eye damage.\nStick the mask on the hydrophobic Si wafer and spray-coat Ag NWs-F using a spray gun.\nRemove the mask and anneal the electrodes using a hot plate at 200°C for 20 min to obtain a conductive Ag NWs electrode.\nCAUTION: Be careful of the hot plate and perform in a chemical hood.\nSpin-coat 100 mg/mL SIS in toluene on the Ag NWs-F on the Si wafer with 1000 rpm for 60 s.\nCAUTION: Wear gloves and goggles and perform under a chemical hood.\nPreparing the soft stretchable polymer with the Ag NWs electrode\nPrepare a thin SIS film by pouring 100 mg/mL SIS in toluene into a Teflon template and let dry (for 12–14 h).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig3.jpg\nFigure 3. Transforming the Ag NWs electrodes to a soft SIS film\n(A) Adding the SIS/Ag NWs-F/Si wafer on a heat plate at 50°C and stretching a pre-prepared soft SIS film.\n(B) Pressing the stretched SIS film on the SIS/Ag NWs electrodes.\n(C) Peeling off the SIS film carefully and slowly from the Si wafer.\n(D) The SIS film with the transformed Ag NWs electrode.\nCAUTION: Wear gloves and goggles and perform under a chemical hood.\nPause point: The Teflon containing the SIS should be kept on a stable surface and dried in a chemical hood for 12–14 h.\nPre-stretched the obtained thin SIS film to 100% of the original length and press it gently using a round tip spatula onto the SIS/Ag NWs-F/Si wafer (prepared in step 34) at 50°C for 30 s (Figure 3[href=https://www.wicell.org#fig3]).\nPeel off the SIS film carefully and slowly to ensure the Ag NWs electrode is entirely transformed into the film. Troubleshooting[href=https://www.wicell.org#troubleshooting].",
    "Check the conductivity of the transformed Ag NWs electrode by stretching the film to different lengths using a Digit Multimeter (Figure 4[href=https://www.wicell.org#fig4]). Troubleshooting[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig4.jpg\nFigure 4. Checking the conductivity of the transformed Ag NWs electrode on the SIS film in different stretching lengths\n(A) Initial length: 0% stretching.\n(B) 25% stretching.\n(C) 50% stretching.\n(D) 75% stretching.\n(E) 100% stretching.\n(F) Back to the initial length: 0% stretching.\nFabrication of MNs—The rigid part\nTiming: 1 day\nThe fabrication of the rigid MNs part included casting polystyrene solution into a PDMS mold, centrifuge to fill the polymer inside the mold, then heating the molds and de-molding to receive the rigid MNs similar to previously described scalable manufacturing procedures.29[href=https://www.wicell.org#bib29],30[href=https://www.wicell.org#bib30] The MNs are then deposited with gold to obtain the final gold MNs, as shown in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig5.jpg\nFigure 5. Fabrication procedure of MNs—The rigid part\n(A) Adding the PDMS MNs molds into the polystyrene solution to centrifuge.\n(B) Adding the PDMS molds filled with polystyrene solution on a heat plate at 80°C.\n(C) Sticking the de-molded polystyrene MNs on the Si wafer using a mask and tape.\n(D) The MNs after evaporation of gold.\nPreparing the polystyrene rigid MNs\nPrepare a mold of PDMS for the MNs using a laser cutter to carve holes.\nNote: Use these parameters: 10% power, 3% speed, 1000 points per inch (PPI), and a Z-axis of 1.8 mm to make even holes inside the PDMS polymer. The diameter of each hole is around 458 μm × 358 μm, and the length is equal to 1153 μm. Troubleshooting[href=https://www.wicell.org#troubleshooting].\nAdd the PDMS molds inside a polystyrene solution in DMF (200 mg/mL) and then centrifuge at 1006 × g for 3 min.",
    "Move the PDMS molds filled with polystyrene solution onto a heat plate, drop-cast more polystyrene solution on the top of the molds, and dry at 80°C for 12–14 h.\nCritical: When adding the PDMS molds filled with polystyrene on the hot plate, be careful not to touch the hot plate to avoid injuries and burns. Also, avoid creating bubbles when drop-casting more polystyrene to get a uniform MN without holes. Troubleshooting[href=https://www.wicell.org#troubleshooting].\nDe-mold the template to get rigid polystyrene MNs.\nPreparing the gold-coated MNs\nCover the rigid polystyrene MNs substrate with an electrode mask and stick them well on a Si wafer using a tape.\nEvaporate a thin layer of titanium (Ti) (10 nm) as an adhesion layer using a thermal evaporation technique with a pressure of 5∗10-7 Torr and a rate of 3A/s.\nDeposit a gold layer with a thickness of 300 nm to receive the gold MNs by a thermal evaporation technique using a pressure of 5∗10-7 Torr with a rate of 7A/s.31[href=https://www.wicell.org#bib31]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig6.jpg\nFigure 6. Schematic of the fabrication of MN-based biosensors\n(A) Fabrication of the sensing electrode.\n(B) Fabrication of the reference electrode.\nNote: For fabricating biosensors, one of the gold-coated MN arrays should be used as a sensing electrode and the other as a reference electrode. Based on the desired target analyte, different biomolecules can be modified in the sensing area, such as enzymes, antibodies, and ion-selective membranes (ISMs) (Figure 6[href=https://www.wicell.org#fig6]A). For preparing a reference electrode, the other gold-coated MN electrode is deposited with Ag NWs followed by drop-casting 10 μL of 0.05 M FeCl3 for 1 min, then washing using pure water. A solution of NaCl and poly(vinyl butyral) (PVB) in methanol is then drop-cast and dried for 30 min to obtain the Ag/AgCl reference electrode (Figure 6[href=https://www.wicell.org#fig6]B).",
    "Combining the soft polymer with the rigid MNs\nTiming: 12 h\nThe soft SIS polymer with variant thickness was combined with the rigid MNs part by sticking the MNs on the thick parts of the polymer. To connect between the Ag NWs electrodes on the thin, soft part and the MNs component on the rigid part, a silver paste was used, and the connection was performed on the rigid part of the patch to keep the connection stable after stretching, as shown in Figures 7[href=https://www.wicell.org#fig7] and 8[href=https://www.wicell.org#fig8].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig7.jpg\nFigure 7. Schematic of the procedure for integrating the rigid MNs with the soft stretchable substrate using the thickness-gradient strategy\nThe illustration was created with BioRender.com[href=http://BioRender.com].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3155-Fig8.jpg\nFigure 8. The stretchable stable MNs patch prepared by the thickness-gradient strategy\n(A) SIS film with variant thicknesses prepared with the thickness-gradient strategy. Reproduced with permission.1[href=https://www.wicell.org#bib1] Copyright © 2022 Wiley-VCH GmbH.\n(B) Combined rigid-MNs part with the soft SIS thin part using the thickness-gradient strategy.\n(C) Stretching the combined MNs rigid and soft SIS thin parts while maintaining the patch’s stability.\nCombining the soft SIS film with the rigid MNs using a thickness-gradient strategy\nAfter transforming the Ag NWs electrode to the soft SIS film, drop-cast 100–200 μL SIS solution on specific locations onto the backside of the prepared stretchable Ag NWs electrode and let it dry to create a variant thickness substance (See steps 35–38).\nFix the rigid MNs on the thick part of the SIS film with a small amount of SIS solution.\nConnect the gold-coated MNs with the Ag NWs electrode using silver paste. Troubleshooting[href=https://www.wicell.org#troubleshooting]."
  ],
  "subjectAreas": [
    "Material Sciences",
    "Chemistry",
    "Molecular/Chemical Probes",
    "Antibody",
    "Health Sciences",
    "Biotechnology And Bioengineering"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}