{
  "id": 12170,
  "origin_website": "Jove",
  "title": "Utilizing 18F-FDG PET/CT Imaging and Quantitative Histology to Measure Dynamic Changes in the Glucose Metabolism in Mouse Models of Lung Cancer",
  "procedures": [
    "All procedures described in the protocol have been approved by the institutional animal care and use committee (IACUC) at the University of California, Los Angeles.\n1. 18F-FDG PET and CT Imaging in Mice\nCAUTION: Use protective equipment when handling radioactivity. Follow all applicable regulatory procedures when handling radioactivity.\nPlace the cage with the mice to be imaged on a warm bed at 37 °C 1 h prior to the 18F-FDG injection to reduce the brown fat consumption of 18F-FDG.\n\tNOTE: Fasting the mice for 4 - 16 h can help reduce the myocardial consumption of 18F-FDG.\nWeigh the mouse and record its weight.\nAnesthetize the mouse using 2 - 3% isoflurane in oxygen at 0.5 - 2 L/min for 2 - 3 min using an anesthesia chamber kept at 37 °C. Ensure that mouse has been anesthetized by pinching the toe; no reaction will be observed if the mouse has been anesthetized. Apply ophthalmic ointment to the eyes to prevent any dryness during the anesthesia.\nDilute 18F-FDG (109 min radioactive half-life) in sterile saline at an adjusted decay-corrected injection concentration of 70 - 75 µCi/100 µL.\n\tNOTE: Follow the PET scanner manufacturer's recommended 18F dose for optimal scanner imaging.\nDraw 70 - 75 µCi with an insulin syringe with a 28 G needle, measure the radioactivity dose using a dose calibrator, and record the measurement and time. Place the syringe in a lead syringe holder.\n\tNOTE: The amount of 18F-FDG radioactivity in each dose is measured with a dose calibrator, which is calibrated against a standard reference material, such as cesium-137, according to the manufacturer's protocols. The time of the reading is also recorded to determine the decay correction.\nPrick the distal end of the mouse tail and measure the mouse's blood glucose with a glucometer.",
    "Warm the tail for 1 - 2 min with a gauze soaked in warm water. Wipe the tail with 70% isopropanol to dilate the tail vein just prior to the injection. Administer 100 µL of 18F-FDG (the entire volume in the syringe) with a bolus injection via the lateral tail vein and record the time of injection. Measure the remaining dose in the syringe using the dose calibrator and record the measurement and time.\n\tNOTE: There will be some amount of probe left in the syringe. The use of insulin syringes is preferred over syringes connected to needles via Luer locks due to the decreased amount of the dose trapped in the syringe/needle after the injection has been administered.\nPlace the injected mouse in the anesthesia chamber kept under 1.5 - 2% isoflurane at 37 °C to allow the probe to be distributed via the mouse's systemic circulation for 1 h prior to the PET scan.\n\tNOTE: It might be beneficial to void the bladder prior to the scanning to allow for an easier 18F-FDG PET visualization of the tumors implanted in the lower flanks of the mouse.\nAfter 1 h, place the mouse in an imaging chamber under nose-cone isoflurane anesthesia and at 37 °C, and secure its limbs in place with medical tape in a supine position.\nPlace the imaging chamber in the PET/CT scanner.\nAcquire the PET and CT scans as described in the PET/CT scanner manual28.",
    "NOTE: The PET images are acquired for 600 s with an energy window of 150 - 650 keV, reconstructed using maximum-likelihood expectation maximization with corrections for photon attenuation, detector normalization, and radioisotope decay (a scatter correction was not applied). The CT images are acquired in a continuous mode for 50 s using a 50 kVp, 200 µA X-ray source and a flat-panel detector, and they are reconstructed using the Feldkamp algorithm.\nAfter the PET/CT is completed, remove the mouse from the imaging chamber and allow it to recover in its cage. Monitor the mouse until it has fully regained consciousness and can maintain sternal recumbency.\nImport the reconstructed PET/CT images into AMIDE software by clicking File, then Open, and selecting the appropriate file.\nConvert the PET data to the unit of percent-injected dose per gram (%ID/g) by entering the dose at the time of injection after accounting for any residual dose left in the syringe, or to the unit of standardized uptake value (SUV) by additionally entering the subject's weight. To do this, right-click on the PET data set and locate the %ID/g field on the Basic Info tab. Enter the %ID/g recorded earlier.\nDraw the regions-of-interest (ROIs) on the tumors and normal tissues (liver, muscle, lung, heart, brain, and subcutaneous fat). To do this, click on Edit, select Add ROI, select ROI shape and give the ROI a name. Draw ROIs over tumors and tissues and adjust their dimensions to cover tissue of interest in all 3 axes.",
    "NOTE: To account for differences in PET probe biodistribution between animals, tumor ROI values can be further normalized to ROI values of the liver, a well-perfused organ with minimal glycolytic activity representing 18F-FDG in circulation. ROI analyses of tumor and normal tissues are performed on the same mouse. Lung tumor lesions are generally identified by 18F-FDG PET since the 18F-FDG retention in a normal lung is relatively low. CT is also used to identify lesions, particularly lesions that are 18F-FDG non-avid. An ex vivo analysis of isolated lungs also helps to localize tumor lesions.\n2. 18F-FDG Autoradiography\nPrepare the mouse for imaging with 18F-FDG by following steps 1.1 - 1.12, except now, dilute 18F-FDG in sterile saline at an adjusted decay-corrected injection concentration of 1,000 µCi/200 µL.\n\tNOTE: Higher doses of 18F-FDG are used for autoradiography to account for additional sample processing time and an optimal detection by phosphor plates.\nEuthanize the mouse via a lethal inhalation of isoflurane at 5% or by CO2 (an IACUC-approved procedure).\n\tNOTE: Cervical dislocation should not be used as this can damage the lung tissue.\nPin down the mouse with the ventral surface exposed and spray it with 70% ethanol to mat down its hair prior to the incision.\nOpen the thoracic cavity by applying a midline incision, cutting away the diaphragm and removing the chest walls. Expose the trachea by carefully removing the salivary gland. Place the bulldog clamp on the trachea as close to the jaw as possible, ensuring a tight fit on the trachea. Place a 23 G needle attached to a 3 mL syringe inside the trachea below the bulldog clamp and inject ~2 mL of an OCT:PBS (1:1) (Optimal Cutting Temperature:Phosphate Buffered Saline) solution.",
    "NOTE: OCT is very viscous and is mixed with PBS to allow for an easier injection into the lungs.\nRemove the needle from the trachea and use forceps to clamp on the injection point to prevent any leaking of the OCT:PBS solution.\nCarefully remove the lungs from the thoracic cavity and separate the left lobe from the rest of the lungs. Place the left lobe in labeled cryomold filled with a few drops of OCT. Once the lung lobe is inside the mold, fill the cryomold to the top with OCT.\nRepeat the same procedure with the right half of the lungs.\n\tNOTE: If the 18F-FDG signal in the heart is expected to be high or if the lung tumors are located close to the heart, it might be beneficial to remove the heart in order to prevent any tracer leakage. Alternatively, entire lungs can be embedded into a single cryomold. It is important to avoid air bubbles when working with OCT.\nUsing long forceps, place the prepared cryomold in a closed-cell extruded polystyrene foam container containing a mixture of dry ice and isopentane.\n\tNOTE: This mixture should be at approximately -70 °C before placing the cryomold in it for freezing. After hardening, the OCT compound will become white. If multiple samples are processed at the same time, the frozen samples in OCT cryomolds can be temporarily stored on dry ice.\nRemove the frozen block from the cryomold and mount it onto a cryostat for sectioning. Section the block at a 4 µm thickness using microtome blades (34°/80 mm, high profile). Transfer the tissue sections to a glass slide that has been stored at room temperature.",
    "Place the specimen slides onto a phosphor imaging plate. Place the plate in the cassette and gently close it to prevent slides from shifting. Store the cassette in a -20 °C freezer for the plate exposure, generally overnight.\n\tNOTE: The plates and cassettes need to be pre-chilled to -20 °C before use. Placing the samples at -80 °C is acceptable as well.\nAfter the exposure, remove the slides from the plate and read the plate on the image reader.\nThe slides can be wrapped in plastic wrap and stored at -80 °C, or they can be prepared for hematoxylin & eosin staining or immunohistochemistry.\n3. Harvesting Lung Tissue for Histology\nFollow steps 2.2 - 2.4, except now, instead of using the OCT:PBS solution, inject 2 - 3 mL of 10% normal buffered formalin to fix the lungs.\nRemove the needle from the trachea and use forceps to clamp on the injection point to prevent any leaking of the formalin. Carefully remove the lungs from the thoracic cavity and place them into a 50 mL conical tube containing ~20 mL of 10% normal buffered formalin for 16 - 24 h to ensure a complete fixation.\n\tNOTE: Fixing the lungs allows for the preservation of the optimal anatomical features.\nThe next day, transfer the fixed lungs from the formalin to 70% ethanol and prepare the lungs to be placed in a tissue cassette.\nPrepare the lungs for histology by carefully dissecting lobes using scissors to cut at branch points between 5 lobes, numbered 1 - 5 as shown in Figure 1D, and place them in a non-overlapping orientation in the tissue cassette. Place a foam pad gently on the lung tissue to keep the orientation intact.\nStore the dissected lung lobes in 70% ethanol until the paraffin embedding.",
    "Paraffin-embed the tissue in cassettes and cut 4 µm thick sections for the staining, using standard procedures.\n4. Tissue Segmentation and Quantification Using Commercial Software\nImage hematoxylin and eosin (H&E) stained lung sections at a 1.25X magnification using a commercial multispectral imaging system.\nConvert the images to digital image cubes and load (click on File, then on Load Spectral Library) pre-made spectral libraries for H&E.\n\tNOTE: The spectral libraries were developed in advance by acquiring spectral images from singly stained lung sections, one section stained only with eosin and the other only stained with hematoxylin, which were saved in an open-source proprietary spectral library file (.csl). The imaging system has operating software that acquires an image at each wavelength that is needed (as defined by the acquisition protocol). Those images (the \"image cube\") are stored in an open-source proprietary multispectral file format (.im3). Spectra are extracted from the image cube using the morphometric software and stored in separate spectral library files.\nSpectrally unmix the pseudo-colored H&E images of the whole lungs by clicking on the Unmix button.\n\tNOTE: Unmixing takes less than 1 s. The number of pixels in each tissue type were quantified using morphometric image analysis software.\nVisualize each image cube by converting the multispectral data into the equivalent 3-color (red, green, blue) image by using the eye's wavelength-dependent color response convolved with the intensity of each image.\n\tNOTE: The resulting 3 images are displayed as a standard 24-bit color image.\nPseudo-color each unmixed image by scaling that image in a user-chosen color (e.g., red, green, purple, etc.) and add that together with the other pseudo-colored unmixed images into one standard 24-bit color image.\nUse the default settings for all analyses.",
    "NOTE: In general, since this kind of segmentation relies on a visual assessment of the results (i.e., an assessment of how well the segmentation on the images outside of the training set works), it is important to properly divide the images up into training, test, and validation sets.\nStart with 2 - 3 images as a training set (10 - 15 for human biopsy samples), train on those until the results look good, and then apply that algorithm to another 2 - 3 images. Then, apply the resulting algorithm to the full validation set.\n\tNOTE: Most likely, some retraining will be needed.\nAnalyze the tumor area in whole lung sections by calculating the total pixel count for the red pseudo-colored tumors in lobes 1 - 5 of each mouse.\n\tNOTE: The normal tissue was pseudo-colored green and blood/blood vessels were pseudo-colored pink as shown in Figure 3. The mean tumor burden for each treatment group was calculated by measuring the total pixel count for each mouse in the treatment group."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}