{
  "id": 19622,
  "origin_website": "Jove",
  "title": "Efficient and Scalable Generation of Human Ventral Midbrain Astrocytes from Human-Induced Pluripotent Stem Cells",
  "procedures": [
    "1. Human hiPSC line thawing, maintenance, and cryopreservation\nFor coating hiPSC culture plates, dilute vitronectin to 5 µg/mL (1:100) in PBS at 1 mL per 10 cm2 cell culture plate surface area. Leave for 1 h at room temperature.\nRemove vitronectin and proceed immediately to adding hiPSCs/media to the culture plate.\n\tNOTE When removing vitronectin from the plate, it is crucial that the culture surface is not allowed to dry out.\nTo thaw hiPSCs, remove cryovials containing hiPSCs from liquid nitrogen and place in a 37 °C water bath until the contents have completely thawed.\nPrepare 9 mL of prewarmed cell culture medium (e.g., E8 or E8 Flex) containing 1x cell supplement (e.g., Revitacell). Add 1 mL dropwise to the contents of the cryovial. Place the remaining 8 mL media into a 15 mL centrifuge tube and to this add the diluted contents of the cryovial.\n\t​CAUTION: Do not triturate the contents.\nCentrifuge at 150 x g for 3 min. Aspirate the liquid without disturbing the cell pellet and resuspended in an appropriate volume of cell culture medium (e.g., E8 or E8 Flex) containing 1x cell supplement (e.g., Revitacell). For example, 2 mL per well of a 6-well plate.\nAdd resuspended hiPSCs to vitronectin coated dishes and place in 37 °C/5% CO2 incubator.\n\tNOTE: hiPSCs should start to attach to vitronectin coated plasticware in 30 min-2 h after thawing.\nMaintain hiPSCs in cell culture medium (e.g., E8 or E8 Flex). Feed cells daily by media exchange. Always prewarm culture media for 30 min before feeding.",
    "NOTE If using E8 Flex, hiPSCs do not require media changes every 24 h and feeding increments can be extended to 48 h, if needed. Either E8 Flex or E8 media yield equally high-quality hiPSC cultures. HiPSCs should be cultured for a minimum 14 days post-thawing, and prior to beginning the differentiation steps. Culture periods of less than 14 days appear to negatively impact the survival of the hiPSCs during the initial differentiation period.Passage hiPSCs at approximately 80% confluency (Figure 1A: 3-4 day passaging interval).\n1 h prior to beginning, add 1x cell supplement (e.g., Revitacell) to the hiPSC culture.\nWash hiPSCs once with PBS (without calcium or magnesium) and add 0.5 mM EDTA (diluted from stock in PBS without calcium or magnesium).\nIncubate for 5 min at room temperature, or until the hiPSCs begin to detach from each other and take on a more rounded appearance, with the boundaries of each iPSC appearing brighter under a brightfield microscope.\nAdd 200 µL EDTA on to a focused area of the hiPSCs with a pipette. If they readily detach, making a clear space in the cell layer, then they are ready to be harvested. If they do not readily detach, leave in EDTA and repeat after 1 min.\nWhen ready to proceed, gently remove EDTA, and using a pipette, gently wash the hiPSCs twice with cell culture medium (e.g., E8 or E8 Flex).\n\tNOTE: To achieve this without the hiPSCs detaching, tip the plate and add media dropwise down the side of the culture plate.\nTo harvest hiPSCs use 1 mL cell culture medium (e.g., E8 or E8 Flex) containing 1x cell supplement (e.g., Revitacell). Release the media directly onto the hiPSC layer and the cells should detach. If required, repeat with another 1 mL media.",
    "View the hiPSCs under the microscope. Ideally, hiPSCs should appear in relatively uniform clusters as shown in Figure 1B. If hiPSC clusters are much larger, or very variable in size, use the pipette to break up the larger hiPSC clusters (Figure 1B).\n\tNOTE Do not over-triturate hiPSCs. Although the supplement increases the overall cell survival, over trituration negatively impacts on the survival of the hiPSC culture. 1-4 passes with a pipette are recommended.\nUsing a serological pipette, transfer the hiPSC suspension on to a vitronectin-coated plate as prepared in step 1.1. Return the hiPSC culture to the 37 °C/5% CO2 incubator.\n\tNOTE: Cryopreserve hiPSCs at approximately 80% confluency.\n1 h prior to beginning, add 1x cell supplement (e.g., Revitacell) to the hiPSC culture.\nDetach hiPSCs from culture plates using 0.5 mM EDTA as described in step1.4, collecting cells in cell culture medium (e.g., E8 or E8 Flex) containing 1x cell supplement (e.g., Revitacell). Centrifuge at 150 x g for 3 min.\nResuspend pelleted hiPSCs in cell freezing media (see Table of Materials). Use 700 µL per 10 cm2 culture area, equivalent to 1 cryovial of cells per well of a 6-well plate.\nTransfer cryovials into an appropriate cell freezing vessel (for details see Table of Materials).\nTransfer the freezing vessel to a -80 °C freezer for 24 h. After 24 h, cryovials can be transferred to liquid nitrogen (-196 °C) for long-term storage.\n2. vmAstro Differentiation protocol\nNOTE: A schematic summary of the vmAstros differentiation protocol is shown in Figure 1A. A detailed list of reagents required for the protocol and their preparation is given in Table 1.\nInduction of vmNPCs",
    "NOTE: This protocol has been optimized to begin with a minimum with 1x well of a 6-well plate (10 cm2) of hiPSCs 70%-80% confluency, which is approximately 4-5 x 104 cells/cm2 (Figure 1B)30. Starting cell number and density must be optimized for each hiPSC line as it significantly impacts survival and differentiation efficiency.\n\t\nRemove cell culture medium from hiPSCs and wash 3x in DMEM/F12 + glutamax. Replace media with 2 mL vmNPC induction media (N2B27 + CHIR99021 + SB431542 + SHH(C24ii) + LDN193189. See Table 1 for details of preparing media and reagents).\nFeed on alternate days with a half media change after 24 h, and a full media change at 48 h.\n\t\t​NOTE: After 3-4 days the vmNPC culture will require passaging. A standard passaging ratio of 1:3 or 1:4 is recommended-this needs to be optimized for each hiPSC line used.\n1 h before passaging, add 1x cell supplement (e.g., Revitacell) to vmNPCs, and prepare 1x basement membrane matrix (e.g., Geltrex) coated tissue culture plastic (section 2.2 Preparing basement membrane matrix and coating rissue culture plastic).\nRemove the media from vmNPCs and wash 2x with D-PBS. Add 1 mL pre-warmed cell detachment solution (e.g., Accutase) per 10 cm2 culture area (1 mL per well of a 6-well plate).\nPlace at 37 °C for 1 min and then examine vmNPCs using a phase contrast microscope.\n\t\t​NOTE: The vmNPCs will start to round up, their processes will re-tract, and gaps will appear in the cell layer. This can take from 1-3 min depending on cell density.\nWhen vmNPCs take on this appearance, add 100 µL of cell detachment solution (e.g., Accutase) on to the layer of vmNPCs.",
    "​NOTE: If the vmNPCs are ready to detach, a hole in the cell layer will appear. If this doesn't happen, then the vmNPCs require further incubation with cell detachment solution.\nIf vmNPCs readily detach, then gently remove the cell detachment solution and wash vmNPCs 2x with N2B27 media. Add N2B27 media gently down the side of the well or culture vessel and gently swirl to wash, ensuring that vmNPCs do not detach.\n\t\t​NOTE: This step must be completed quickly to ensure vmNPCs do not reattach to the cell surface. If vmNPCs start to detach in the wash steps, collect via centrifugation at 150 x g for 3 min. vmNPCs are not centrifuged as standard when passaging as this can reduce their survival.\nFinally, remove vmNPCs using a pipette, by vigorously ejecting vmNPC induction media containing 1x cell supplement (e.g., Revitacell) directly on to the cell layer. This should remove vmNPCs, which can then be transferred directly into the new matrix-coated coated culture vessels.\n\t\tNOTE: Do not re-use media already containing resuspended vmNPCs to remove further cells as this will result in their over-trituration, which reduces their survival.\nReplace in 37 °C/5% CO2 incubator. vmNPCs should begin to attach to the matrix-coated surface after 20-30 min. Replace half of the media with fresh vmNPC induction media (without cell supplement) after 24 h and continue the feeding schedule as earlier.\nContinue the regime of feeding and passaging for 10 days.\nPreparing basement membrane matrix and coating tissue culture plastic\n\tNOTE: For maintaining vmNPCs 1x basement membrane matrix (e.g., Geltrex) is used for coating plasticware. For maintaining vmAPCs or vmAstros, 0.25x basement membrane matrix can be used.\n\t\nRemove basement membrane matrix stock from a -80 °C freezer and place in a 4 °C fridge overnight to thaw.",
    "Dilute 1:10 with ice cold DMEM/F12 + glutamax, aliquot and store at -80 °C as a 10x stock.\nWhen coating plasticware dilute this 10x stock to 1x (for vmNPCs) or 0.25x (for vmAPCs or vmAstros) with ice cold DMEM/F12 + glutamax.\nImmediately add to tissue culture plastic at 1 mL per 10 cm2, for example, 1 mL per well of a 6-well plate.\nPlace at 37 °C for 1 h. The basement membrane matrix solution should not be removed from plasticware until ready to add media/cells to ensure the coated plasticware does not dry out. Matrix coated plates do not require washing before adding cells.\nExpansion of vmNPCs\nOn day 10 of the protocol, replace the induction media with vmNPC expansion media (N2B27 + GDNF + BDNF + ascorbic acid. See Table 1 for details of preparing media and reagents).\n\t\tNOTE The vmNPCs do not require the addition of mitogens to induce proliferation. BDNF, GDNF, and ascorbic acid support the survival and maintenance of vmNPCs30.\nFeed on alternate days with a half media change after 24 h, and a full media change at 48 h.\n\t\tNOTE: After 3-4 days, the vmNPC culture will require passaging. For passaging, a standard passaging ratio of 1:3 or 1:4 is recommended (this needs to be optimized for each hiPSC line used. Determine the ratio that gives the best survival, proliferation, and generation of vmNPCs).\n1 h before passaging, add 1x cell supplement (e.g., Revitacell) to vmNPCs, and prepare 1x matrix coated plates/flasks in advance (section 2.2 Preparing basement membrane matrix and coating rissue culture plastic). Prewarm the cell detachment solution (e.g., Accutase) to 37 °C. Prewarm fresh vmNPC expansion media containing 1x cell supplement (e.g., Revitacell).",
    "Remove media from vmNPCs and wash 2x with D-PBS. Add 1 mL cell detachment solution (e.g., Accutase) per 10 cm2 culture area (1 mL per well of a 6-well plate). Place at 37 °C for 1 min and then examine vmNPCs using a phase-contrast microscope.\n\t\tNOTE: The vmNPCs will start to round up, their processes will re-tract, and gaps will appear in the cell layer. This can take from 1-3 min depending on the cell density.\nWhen vmNPCs takes on a rounded appearance, add 100 µL of cell detachment solution (e.g., Accutase) on to the layer of vmNPCs.\n\t\tNOTE: If the vmNPCs are ready to detach, a hole in the cell layer will appear. If this doesn't happen, then the vmNPCs require further incubation with the cell detachment solution.\nIf vmNPCs do readily detach, then gently remove the cell detachment solution and wash vmNPCs 2x with N2B27 media. Add N2B27 media gently down the side of the well or culture vessel and gently swirl to wash, ensuring that vmNPCs do not detach.\n\t\tNOTE: If vmNPCs start to detach in large numbers in the wash steps, collect via centrifugation at 150 x g for 3 min. vmNPCs are not centrifuged as standard when passaging as this can reduce their survival. This step must be completed quickly to ensure vmNPCs do not reattach to the cell surface.\nRemove vmNPCs using a pipette, and vigorously eject vmNPC expansion media containing 1x cell supplement (e.g., Revitacell) directly on to the cell layer. This should remove vmNPCs, which can then be transferred directly into the preprepared matrix coated plates/flasks (see section 2.2 ‘Preparing basement membrane matrix and coating tissue culture plastic’).\n\t\tNOTE: Do not re-use media already containing resuspended vmNPCs to remove further cells as this will result in their over-trituration, which reduces their survival.",
    "Replace in 37 °C/5% CO2 incubator. vmNPCs should begin to attach to the matrix coated surface after 20-30 min. After 24 h, replace half of the culture media with fresh vmNPC expansion media (without cell supplement) and continue the previous feeding schedule.\nContinue this regime of feeding and passaging for 10 days. vmNPCs can be expanded up to day 50.\nDifferentiation and expansion of vmAPCs\n\tNOTE: vmNPCs can be used successfully for the generation of vmAPCs/vmAstros anywhere between 30 and 50 days from the initial hiPSC stage (Figure 1A).\n\t\nTake a confluent vmNPC culture and wash vmNPCs 3x in advanced DMEM/F12 to remove traces of the components of vmNPC expansion media. Replace the media with vmAPC expansion media (ASTRO media +EGF +LIF. See Table 1 for details of preparing media and reagents).\nAfter 72 h passage, the vmNPC culture is at a high ratio (1:7.5). For example, assuming vmNPCs were maintained in a single well of a 6-well plate, they should now be passaged into a 1x matrix coated 75 cm2 flask (coated as described in section 2.2 ‘Preparing basement membrane matrix and coating tissue culture plastic’). Passage using cell detachment solution, as described for vmNPCs in section 2.3 ‘Expansion of vmNPCs’.\nResuspend vmNPCs in an appropriate volume of vmAPC Expansion media (7.5-15 mL media per 75 cm2 flask. Complete media changes every 3 days, or as the cells require.\n\t\tNOTE: From this point on, vmNPCs are referred to as vmAPCs and should be passaged as single cells rather than cell clusters. vmAPCs should be passaged every 3-7 days or as they become confluent to avoid becoming over confluent. From this point onward the reduced concentration of 0.25x matrix should be used to coat plasticware (as described in section 2.2 Preparing basement membrane matrix and coating tissue culture plastic).",
    "Expand vmAPCs until they reach day 90 (from the hiPSC stage), cryopreserving vmAPCs at various points in their expansion.\nGeneration of mature vmAstros from vmAPCs\n\t​NOTE: At this stage, vmAPCs can be grown in 175 cm2 tissue culture flasks. This may be expanded for the generation of large numbers of mature vmAstros.\n\t\nWhen vmAPCs reach 80% confluency, wash 3x with ASTRO media and replace with vmAstros maturation media (ASTRO media +BMP4 +LIF. See Table 1 for details of preparing media and reagents).\nCarry out a complete media change every 3 days, or as the cells require, for 10 days.\n\t\tNOTE: a) At this point, characterization indicates that the vmAstros are mature, as confirmed by immunocytochemistry (Figure 2G - I) and by gene expression analysis (manuscript in preparation). b) vmAstros used immediately after maturation should be re-plated on a newly prepared matrix-coated surface. Maintaining either vmAPCs or vmAstros on the same culture surface for over 14 days could lead to suboptimal cultures, where cells begin to shrink in size and even detach. c) For applications examining neuroinflammatory modulation, BMP and LIF are removed 72 h prior to neuroinflammatory stimulation. This is to avoid any potential interaction between BMP/LIF signalling and induced neuroinflammatory signalling.\nvmAstros can now be re-plated for experimental assays, for example, onto coverslips for immunocytochemistry or cryopreserved for future applications (sections 3, 4).\n\t\tNOTE: Passaging should not be necessary at this stage of the protocol as proliferation should only occur at a very low rate. vmAPCs plated too densely at this stage maintain higher levels of proliferation. If this is the case, passage and split cells to achieve a density as is shown in Figure 1F.\n3. Cryopreservation of vmNPCs, vmAPCs, and vmAstros\nNOTE: Cryopreserve vmNPCs/vmAPCs/vmAstros at full confluency.",
    "1 h prior to beginning, add 1x cell supplement (e.g., Revitacell) to culture. Fill the cryostorage vessel (see Table of Materials) with isopropanol at room temperature.\nDetach the cells from the culture plates using cell detachment solution as previously described, collecting cells in appropriate media (N2B27 or ASTRO media) containing 1x cell supplement (e.g., Revitacell). Centrifuge at 150 x g for 3 min.\nResuspend pelleted vmNPCs/vmAPCs/vmAstros in cell freezing media (see Table of Materials) volumes as follows (steps 3.3.1. - 3.3.3.)\n\t\nFor vmNPCs: use 700 µL per 10 cm2 culture area, into 1 cryovial.\nFor vmAPCs: use 700 µL per 60 cm2 culture area, into 1 cryovial (approximately 1/3 of a T175 culture flask).\nFor vmAstros: resuspend in a 2 mL of media and count the number of vmAstros. Re-centrifuge and resuspend in cell freezing media (see Table of Materials) at a number per cryovial appropriate to future applications. Assuming an approximate cell loss of 15% due to freeze-thawing, newly thawed vmAstros are counted and plated with a 15% excess cell number to compensate for cell death in the freeze-thaw process. This is, therefore, equivalent to 74,750 vmAstros per cm2. Thawed vmAstros are maintained for 72 h in ASTRO media prior to assaying.\nTransfer the cryovials into a cell freezing vessel (for details see Table of Materials) and transfer the freezing vessel to a -80 °C freezer for 24 h. After 24 h, cryovials can be transferred to liquid nitrogen (-196 °C) for long-term storage.\n4. Characterization of vmAstro phenotype\nImmunocytochemistry\nPlace 100-200 13 mm glass coverslips in glass Petri dishes on a layer of filter paper and sterilize them in a dry autoclave.",
    "Transfer the coverslips to wells of 4- or 24-well plates using sterile forceps. Add 1x matrix solution (e.g., Geltrex) on the coverslips as 50 μL droplets and incubate at 37 °C for 1 h.\nPassage or thaw vmAstros, resuspend in ASTRO media and carry out a count. Plate vmAstros at 25-100,000 cells per coverslip in a 50 μL droplet.\nRemove the matrix from the coverslip and immediately add vmAstros in a droplet of media. Place at 37 °C for 30 min and then flood the wells with an additional 250 µL ASTRO media.\n\t\t​NOTE: If carrying out immunocytochemistry to simply check for astrocyte and midbrain marker expression, vmAstros can be fixed 24 h after plating.\nPrepare 4% formaldehyde solution by diluting 36% formaldehyde solution 1:9 in D-PBS.\nWash vmAstros 1x with D-PBS. Immediately add 4% formaldehyde to the wells and leave at room temperature for 10 min.\nRemove formaldehyde and replace with D-PBS. Either store at 4 °C or proceed to immunocytochemistry.\nWash coverslips in wells 3x with D-PBS. Permeabilize and block in 10% goat serum, 1% BSA in 0.1% PBTx (D-PBS + 1:1000 Triton-X) for 1 h at room temperature.\nAdd primary antibodies (Table of Materials) in 1% goat serum, 0.1% BSA in 0.1% PBTx (D-PBS + 1:1000 Triton-X) and incubate overnight at 4 °C on a rocker.\nOn the next day, remove primary antibodies and wash coverslips 3x with D-PBS.\nAdd appropriate secondary antibodies (Table of Materials) in 1% goat serum, 0.1% BSA in 0.1% PBTx, and incubate for 1-2 h at room temperature and protect it from light on a rocker. Wash coverslips 3x with D-PBS.\nAdd DAPI solution (0.1 µg/mL DAPI in D-PBS) and incubate at room temperature for 10 min. Wash coverslips 3x with D-PBS.",
    "To mount the coverslip, add a 5 μL droplet of Mowiol/DABCO mounting media [12% Mowiol (w/v), 12% glycerol (w/v) dissolved overnight stirring in 0.2 M Tris (pH 8.5) with 25 mg/mL 1,4-diazabicylo[2.2.2]octane (DABCO)] to a glass microscope slide. Using forceps, carefully remove the coverslip from the well; dab the edge of the coverslip on the tissue to remove the excess liquid and place vmAstros side down onto the Mowiol/DABCO droplet.\nRepeat for each coverslip and leave to dry for 8 h before microscopic examination.\nELISA measurement of vmAstros secretion of IL-6 in response to cytokine treatment\n\tNOTE: Following the 10-day maturation with BMP4 and LIF, vmAstros should be passaged, counted, and plated on 0.25x matrix-coated tissue culture plasticware (as detailed in section 2.2 Preparing basement membrane matrix and coating tissue culture plastic), at a density of 65,000 vmAstros per cm2 in ASTRO media. BMP4 and LIF should be removed from the vmAstros 72 h prior to cytokine treatment as active signaling from these factors can interfere with the efficacy of the cytokine treatment. Alternatively, cryopreserved vmAstros can be thawed and used for assays.\n\t\nOn the day of the assay, gently wash vmAstros 3x in non-redox media (DMEM/F-12 + glutamax + N2).\nUse an untreated control and cytokine-treated well for comparison. Add chosen cytokine at optimized concentration. The data in Figure 2J - L were generated using IL-1α at 3 ng/mL9 in non-redox media at 1 mL per 10 cm2 cell culture area.\nReplace vmAstros in 37 °C/5% CO2 incubator for 24 h. After 24 h, collect culture media into sterile microfuge tubes.\nIf ELISA will not be carried out immediately, snap freeze media samples by submerging microfuge tubes in liquid nitrogen and store at -80 °C for future analysis.",
    "NOTE: The following protocol is optimized specifically for use with the IL-6 ELISA kit detailed in the Table of Materials. Antibodies and standards delivered as lyophilized powder in a new ELISA kit must be reconstituted prior to first use, and aliquoted for future use. The data sheet provided with the kit details the reagents and volumes required for reconstitution. The capture antibody must be reconstituted in PBS (without carrier protein).\nPerform the ELISA in a 96-well plate format and calculate the volumes of reagents according to the wells used. On the day of ELISA, prepare capture antibody by diluting stock 1:120 in PBS. Coat the plate by loading 50 µL of capture antibody per well. Cover the plate with an adhesive strip and incubate at room temperature overnight.\nNext day, wash the plate 3x with D-PBS-Tween (D-PBS with 0.05% Tween-20), 100 µL per well. Blot dry.\nBlock the plate by loading 150 µL D-PBS/1% BSA per well. Incubate at room temperature for at least 1 h. Wash plate as described.\nThaw samples on ice (this can take 1-2 h). Dilute samples 1:5 by loading 10 µL sample and 40 µL D-PBS/1% BSA. Vortex every sample prior to loading.\n\t\tNOTE: It is necessary to dilute samples when carrying out an IL-6 ELISA, dilutions should be optimized.\nPrepare the top standard (1,000 ρg/mL) by diluting stock 1:180 in D-PBS/1% BSA. Prepare 7 standards by carrying out a serial dilution of the top standard. Vortex between each dilution.\nAdd 50 µL of standards/samples to wells. Use D-PBS/1% BSA as the blank. Incubate at room temperature for 2 h on an orbital shaker to properly mix the diluted samples. Wash plate as described.",
    "Prepare detection antibody by diluting stock 1:60 in D-PBS/1% BSA. Load 50 µL of detection antibody per well. Cover the plate and incubate at RT for 2 h. Wash plate as described.\nPrepare streptavidin conjugated to horseradish peroxidase (Strep-HRP) by diluting stock 1:40 in D-PBS/1% BSA. Load 50 µL Strep-HRP per well and incubate at room temperature for 20 min in the dark. Wash plate as described.\nInitiate the color reaction by loading 50 µL TMB substrate solution per well. Incubate at room temperature in the dark for 20 min (or until the standards and samples have developed a blue color).\n\t\tNOTE: TMB is stored at 4 °C but should be used at room temperature.\nStop the reaction by adding 25 µL stop solution (1 M H2SO4) per well and note the color change from blue to yellow.\nRead the plate at 450 nm absorbance using a microplate reader. Set wavelength correction to 540 nm absorbance to maximize accuracy. Calculate the protein concentrations in the samples from the standard curve produced.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}