{
  "id": 2835,
  "origin_website": "Cell",
  "title": "Generation of PAX7 Reporter Cells to Investigate Skeletal Myogenesis from Human Pluripotent Stem Cells",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nCloning of Candidate gRNA Expression Plasmids for Reporter Insertion\nTiming: 1–2 weeks\nThis step constructs plasmids expressing candidate gRNAs to be tested for CRISPR/Cas9-mediated DNA cutting efficiencies.\nAdd 1 μg of the gRNA cloning vector (Addgene, #41824) along with 1 μL (20 units) of AflII restriction enzyme to a total of 50 μL reaction volume supplemented with H2O. Incubate at 37°C for 1 h.\nPurify the digested vector using the DNA Clean & Concentrator-5 Kit according to manufacturer’s instructions.\nOptional: If not immediately subjected to DNA purification or gel electrophoresis, the digested product should be heat-inactivated at 65°C for 20 min before storage.\nLigate the linearized vector with each pair of forward and reverse DNA oligos containing each candidate gRNA targeting site using the NEBuilder HiFi DNA Assembly Master Mix. Prepare the reactions as in the following table. Incubate at 50°C for 15 min and then keep on ice.\ntable:files/protocols_protocol_234_12.csv\nNote: Due to our design, each pair of the forward and reverse DNA oligos partially overlap and leave 3′ overhangs on both ends, which are compatible to anneal to the digested and 5′-chewed vector backbone in the NEBuilder HiFi DNA Assembly reactions. Therefore, it is not necessary to pre-anneal the oligos in separate reactions before ligation.\nUse 2 μL of the assembled product to transform the NEB 10-beta competent cells following manufacturer’s instructions. Spread different dilutions of the transformed cells onto kanamycin selective LB agar plates and incubate them at 37°Cfor ~16 h.\nEarly the next day, stop incubation when good-sized colonies have formed (in general takes ~16 h). Seal and keep the plates on benchtop.",
    "Later the same day, inoculate 1–3 individual colonies per cloned candidate gRNA expression plasmid into 3–5 mL of kanamycin selective LB medium. Grow in a shaker at 37°Cfor ~16 h. Seal the agar plates tightly and store them at 4°C as backups in case more colonies need to be picked.\nNote: The 5′ → 3′ exonuclease in the NEBuilder HiFi DNA Assembly Master Mix will destroy the cleaved AflII restriction site, thus preventing vector self-ligation. Include an additional reaction with digested vector only to monitor any false positive events.\nOn the following day, stop growing the bacteria when the liquid culture is dense and healthy (~16 h). Take most of the culture to extract plasmid DNA using the QIAprep Spin Miniprep Kit according to manufacturer’s instructions. Mix the remaining liquid culture with an equal volume of 50% glycerol and store long-term at −80°C.\nSubmit the extracted plasmids for Sanger sequencing to verify successful cloning of the candidate gRNAs using the T7 sequencing primer (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_234_13.csv\nPause Point: Keep the glycerol stocks harboring the correctly cloned plasmids and discard those that are false positives or with incorrect insertions. At this point, the glycerol stocks at −80°C can be stored for long-term and you can proceed to the next steps at a later time.\nThaw the glycerol stocks on ice. Streak kanamycin selective LB agar plates and incubate them at 37°Cfor ~16 h.\nEarly the next day (after ~16 h of incubation), inoculate a single colony from each plate into 3–5 mL of kanamycin selective LB medium. Grow bacteria for ~8 h at 37°C in a shaker, followed by taking a small volume and add into fresh 100 mL of kanamycin selective LB medium at a 1:500 dilution. Grow bacteria at 37°C in a shakerfor ~16 h.",
    "On the following day (after ~16 h of culture), use the EndoFree Plasmid MaxiKit to extract transfection-grade plasmids according to manufacturer’s instructions. Store the plasmids at 4°C for short-term or −20°C for long-term.\nInitial Screening of Candidate gRNAs in 293FT Cells\nTiming: 1–2 weeks\nThis initial screening step tests the cutting efficiencies of the candidate gRNAs in an easy-to-transfect cell type (here we use 293FT cells). It excludes gRNAs that show no or low cutting efficiencies in 293FT cells, which are unlikely to work in hard-to-transfect hPSCs.\nMaintain 293FT cells in 293 medium in a humidified 37°C incubator with 5% CO2 and change medium every other day. Passage cells before they reach over 70%–80% confluent to avoid overgrowth for optimal transfection performance.\nOne day before transfection (day −1), seed cells at 75,000/cm2 onto 24-well tissue culture plates.\nThe next day (day 0), transfect 293FT cells using the TransIT-293 reagent according to manufacturer’s instructions. We transfect a total of 1 μg of plasmids with 0.5 μg each of Cas9 (Addgene, #41815) and gRNA expression plasmid per well on a 24-well plate with a reagent-to-plasmid ratio of 3:1.\nOn day 1, feed cells with fresh medium.\nOn day 3, harvest cells and extract genomic DNA using the DNeasy Blood & Tissue Kit following manufacturer’s instructions.\nPause Point: Extracted genomic DNA can be stored long-term at −20°C for later analysis.\nUse the Q5 Hot Start High-Fidelity 2× Master Mix to PCR amplify the genomic sequence encompassing the cut site of each candidate gRNA. Assembly of the PCR reactions and the cycling conditions are as follows (see Table 4[href=https://www.wicell.org#tbl4] for primer sequences).\ntable:files/protocols_protocol_234_14.csv\ntable:files/protocols_protocol_234_15.csv\ntable:files/protocols_protocol_234_16.csv\naSet annealing temperature at 62°C for PAX7 Surveyor primer pairs 1–11, 4–11, 5–10 and 6–9, and 60°C for 2–4 and 3–7.",
    "Critical: The efficient design of PCR primers flanking the cut site of each candidate gRNA is important to the successful detection of cutting events in the downstream Surveyor assay. PCR amplicons that are too short will be difficult to analyze using standard DNA gel electrophoresis. On the other hand, PCR products that are too long will be hard to amplify and are more susceptible to potential PCR-introduced mutations that could result in false positives in the Surveyor assay. Moreover, it is ideal to design the PCR products so that two fragments with different sizes are produced after Surveyor nuclease digestion to facilitate downstream detection. We were able to design primers that produced amplicons all around 1 kb to balance the above considerations. However, the primer design for your own experiments will be influenced by the cutting sites of choice and the feasibility to design good primers and amplicons from the surrounding sequences.\nRun 5 μL of the PCR products on a 2% TAE agarose gel to estimate the PCR product concentrations and ensure specific amplification (no unspecific bands near the sizes of expected fragments to be generated in the downstream Surveyor assay).\nPerform the Surveyor assay.\nAdd 200–300 ng of the remaining PCR products into separate PCR tubes and supplement with H2O to a final volume of 10–20 μL. Run the following denature and gradual re-annealing program in a thermal cycler to form DNA heteroduplex.\ntable:files/protocols_protocol_234_17.csv\nAfter hybridization, add the following components from the Surveyor Mutation Detection Kit for Standard Gel Electrophoresis and incubate at 42°C for 60 min to digest the mismatched DNA double strands.\ntable:files/protocols_protocol_234_18.csv",
    "Note: The final Mg2+ concentration and Surveyor Nuclease S amount for optimal DNA heteroduplex digestion are dependent on the buffer conditions of the PCR reactions. Refer to the Surveyor assay user guidelines for adjustment of these components according to your choice of PCR reagents.\nStop digestion by adding 10% reaction volume of the Stop Solution.\nRun the entire digested products on a 2% TAE agarose gel. Pick the candidate gRNAs that show clear bands with correct sizes of expected digested PCR fragments (reflecting successful CRISPR/Cas9 mediated genomic DNA cutting) and quantify the cutting efficiencies (Figure 3[href=https://www.wicell.org#fig3]A). Use the following formula (Guschin et al., 2010[href=https://www.wicell.org#bib12]) for estimating CRISPR/Cas9-introduced small insertions and deletions (indels): indel% = (1-(1-(B+C)/(A+B+C))ˆ0.5)∗100, where A represents the integrated band intensity of the uncleaved PCR product and B and C of the two cleaved products.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig3.jpg\nFigure 3. Gel Electrophoresis of Surveyor Assay Products from 293FT or H9 Cells Transfected with Different Candidate gRNAs\n(A) 293FT cells were co-transfected with plasmids encoding Cas9 and one of the 20 bp (L) or 17 bp (S) gRNAs. An additional transfection was performed with the Cas9 plasmid and empty gRNA cloning vector (EV). Genomic sequences surrounding candidate gRNA cutting sites were PCR amplified using indicated primer pairs and subsequently subjected to Surveyor assay digestion. Digested fragments corresponding to expected sizes are denoted by “∗” above or below the respective bands. The positive G/C Control included in the assay kit was analyzed along with the other samples.\n(B) H9 cells were nucleofected with plasmids encoding Cas9 and the gRNAs selected from screening in 293FT cells. Nucleofection for each candidate gRNA was performed in duplicates and processed separately in the downstream Surveyor assay. Fragments and controls are denoted similarly as in (A).",
    "Note: It is recommended to use the G/C Control included in the Surveyor assay kit as a positive control to ensure proper conditions and compatibility of PCR, hybridization, and digestion reactions.\nCritical: When transfecting cells with candidate gRNA expression plasmids, also include a condition where cells are transfected by the empty gRNA cloning plasmid. Process this condition the same as others for genomic DNA extraction, PCR amplification, and Surveyor assay analysis. This can serve as a control for any potential false positives related to unwanted Cas9 cutting, unspecific PCR amplification, as well as background nuclease digestion introduced, e.g., by SNPs between alleles.\nAlternatives: More computationally based methods such as TIDE (Tracking of Indels by DEcomposition) (Brinkman et al., 2014[href=https://www.wicell.org#bib4]) could also be used in place of enzyme-based assays to estimate CRISPR/Cas9 genome editing efficiencies for candidate gRNAs.\nSecondary Screening of Candidate gRNAs in hPSCs\nTiming: 1–2 weeks\nAfter initial screening of candidate gRNAs in 293FT cells (or any other easy-to-transfect human cell lines), we picked the most efficient gRNAs PAX7 4-11S, 5-10L and 6-9S to further examine their efficiencies in H9 hPSCs (or other desired hPSC lines for reporter generation).\nMaintain H9 cells as colonies on Matrigel-coated tissue culture plates using hPSC culture medium in a humidified 37°C incubator with 5% CO2 and change medium every day. Passage cells when they reach ~70%–80% confluent using 0.5 mM EDTA solution with 4–5 min incubation in the hood.\nOn the day of nucleofection (day 0), remove spent hPSC culture medium and add fresh medium supplemented with 10 μM of the ROCK inhibitor Y-27632. Incubate the cells at 37°C for 1 h to increase cell viability during the transfection procedures.",
    "Note: Use cells that are no more than 50% confluent or colonies not too compact or large. This ensures the majority of cells are in a rapid proliferation state to maximize the transfection efficiency. For H9, EDTA-passaged colonies after ~3 days of culture are ideal.\nDissociate into single cells using TrypLE Express with 7–8 min incubation at 37°C.\nAdd at least 3 volumes of hPSC culture medium to TrypLE Express to stop dissociation and transfer the cell solution to a 15 mL conical tube to prevent cells from reattaching to the tissue culture plates.\nCount and aliquot 800,000 cells into one 1.5 mL Eppendorf tube per nucleofection reaction.\nSpin down cells, remove supernatant and resuspend cells using 100 μL reconstituted nucleofection solution per reaction prepared by mixing 82 μL Nucleofector Solution and 18 μL of Supplement from the P3 Primary Cell 4D-Nucleofector X Kit L.\nAdd to the cells 2 μg each of the Cas9 and gRNA expression plasmid per reaction.\nOptional: Include a separate reaction with the pmaxGFP plasmid accompanied with the kit to monitor nucleofection efficiencies.\nCritical: Include a separate reaction with the Cas9 and empty gRNA cloning plasmid. This condition can serve as a control for unwanted Cas9 cutting, non-specific PCR amplification, as well as background nuclease digestion in downstream analysis.\nTransfer the cell/plasmid mixture to the kit-supplied Nucleocuvette Vessels and run program CA-137 on a 4D-Nucleofector X Unit assembled with a Core Unit.",
    "Note: The manufacturer recommends program CB-150 for nucleofection of hPSCs including H9 cells. However, in our hands, program CA-137 clearly outperforms CB-150 in H9 as well as other hPSC lines on nucleofection efficiencies (Figure 4[href=https://www.wicell.org#fig4]). The variation could result from but not limited to the hPSC lines and the specific culture conditions used. Therefore, we highly recommend users to test a few different nucleofection programs for their lines of interest to achieve optimal viability and efficiency.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig4.jpg\nFigure 4. Comparison of Nucleofection Efficiencies of Different Programs\n(A) H9 cells were nucleofected with the pmaxGFP plasmid using either the CA-137 or CB-150 program and examined for GFP expression 1 day later.\n(B) An in-house generated iPSC line (CDMD 1006) was nucleofected and examined similarly as described in (A).\nTo each Nucleocuvette Vessel, add 0.5 mL of hPSC culture medium supplemented with 10 μM of Y-27632 and transfer the nucleofected cells to 1 well on a 24-well tissue culture plate pre-coated with Matrigel.\nCritical: Use the kit-supplied transfer pipettes instead of regular pipette tips to add medium and mix and transfer the nucleofected cells from the Nucleocuvette Vessels to the tissue culture wells. Additionally, limit pipetting and mixing nucleofected cells to no more than 2–3 times to increase cell viability.\nAdd another 0.5 mL of hPSC culture medium supplemented with 10 μM of Y-27632 to the well. Shake the plate several times in a back-and-forth and left-and-right motion and culture the cellsfor ~24 h.\nThe next day (day 1), dissociate the cells in each well on the 24-well plate using TrypLE Express and seed them into 1 well on a Matrigel-coated 6-well tissue culture plate. Culture the cells in hPSC culture medium supplemented with 10 μM of Y-27632. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nOn day 2, refresh cells with regular hPSC culture medium without Y-27632.",
    "On day 3, harvest cells and extract genomic DNA using the DNeasy Blood & Tissue Kit following manufacturer’s instructions.\nPause Point: Extracted genomic DNA can be stored long-term at −20°C for later analysis.\nPerform downstream analysis of PCR amplification, Surveyor assay and gel electrophoresis (Figure 3[href=https://www.wicell.org#fig3]B) as described in steps 17–20 in section “Initial Screening of Candidate gRNAs in 293FT Cells.”\nCloning of Reporter Donor Plasmid\nTiming: 1–2 weeks\nAfter gRNA screening in 293FT and H9 cells, we decided to use the gRNA 6-9S to mediate Cas9 cutting and insertion of a reporter cassette in the endogenous PAX7 gene 3′ UTR through homology-directed recombination (HDR). In this step, we describe the procedures to construct the donor plasmid by replacing the Oct4 targeting homology arms (HAs) from the Oct4-IRES-eGFP-PGK-Neo plasmid (Addgene, #48681) with PAX7 genomic sequences surrounding the gRNA 6-9S targeted region.\nExtract genomic DNA from H9 cells and use as template to PCR amplify the left and right HAs (L-HA/650 bp and R-HA/700 bp, respectively; Table 5[href=https://www.wicell.org#tbl5]) for HDR at the PAX7 locus. Assemble the PCR reactions and run the cycling program as follows.\ntable:files/protocols_protocol_234_19.csv\ntable:files/protocols_protocol_234_20.csv\ntable:files/protocols_protocol_234_21.csv\nNote: In principle, the HAs can be PCR amplified from genomic DNA extracted from any human source or synthesized through commercial services using reference human genomes. However, subtle genomic differences could exist in distinct cell lines and differ from reference human genomes, which might affect HDR efficiencies. Therefore, we recommend using genomic DNA isolated from the cell lines to be used for reporter generation as the template to prepare HAs.",
    "PCR amplify the backbone and reporter cassette (IRES-eGFP-PGK-Neo) from the plasmid. Include 20 bp overlapping sequences with the HAs on the 5′ end of each primer (Table 5[href=https://www.wicell.org#tbl5]) for compatibility in downstream plasmid construction. Assemble the PCR reactions and run the cycling program as follows.\ntable:files/protocols_protocol_234_22.csv\ntable:files/protocols_protocol_234_23.csv\nRun the entire PCR products from the above two steps on a 1.5% TAE agarose gel, excise the correct-sized bands, and extract DNA using the MinElute Gel Extraction Kit according to manufacturer’s instructions.\nAlternatives: Run gel electrophoresis of a small portion of the PCR products. If no overt unspecific amplification is observed, clean the remaining PCR reactions using the DNA Clean & Concentrator-5 Kit according to manufacturer’s instructions.\nSubmit the purified PCR products for Sanger sequencing to exclude any PCR-introduced mutations. Refer to the following table for sequencing primer(s) for each PCR amplicons (see Table 3[href=https://www.wicell.org#tbl3] for primer sequences).\ntable:files/protocols_protocol_234_24.csv\nLigate all four PCR fragments using the NEBuilder HiFi DNA Assembly Master Mix. Prepare the reaction as in the following table. Incubate at 50°C for 1 h and then keep on ice.\ntable:files/protocols_protocol_234_25.csv\nTransform competent cells, grow bacteria and extract plasmids as described in steps 4–7 in section “Cloning of Candidate gRNA Expression Plasmids for Reporter Insertion.” Replace kanamycin with ampicillin in LB agar and medium.\nSubmit the extracted plasmids for Sanger sequencing to verify successful cloning. Use the following sequencing primers to cover the junctional regions of the four PCR fragments (see Table 3[href=https://www.wicell.org#tbl3] for primer sequences).\ntable:files/protocols_protocol_234_26.csv\nPrepare transfection-grade plasmids as described in steps 9–11 in section “Cloning of Candidate gRNA Expression Plasmids for Reporter Insertion.” Replace kanamycin with ampicillin in LB agar and medium.\nEstablishment of Reporter Cell Lines with Antibiotic Resistance\nTiming: 4–6 weeks",
    "In this step, we describe the procedures of reporter knockin by co-nucleofection of plasmids encoding Cas9, gRNA, and the donor template into H9 hPSCs, followed by establishing single-cell clones post antibiotic selection. We also provide materials and methods for genotyping to check correctly integrated clones.\nPerform H9 nucleofection as described in steps 21–30 in section “Secondary Screening of Candidate gRNAs in hPSCs” with 2 μg each of the Cas9, PAX7 6-9S gRNA, and PAX7 HDR donor plasmid. Culture the cells for ~24 h with hPSC culture medium supplemented with 10 μM of Y-27632.\nOptional: Include a separate reaction with the same amount of the Cas9 and PAX7 6-9S gRNA plasmid while replacing PAX7 HDR donor with the kit-accompanied pmaxGFP plasmid. This can be used to monitor the efficiencies of nucleofection as well as downstream antibiotic selection.\nThe next day, dissociate the cells in 1 well on a 24-well plate using TrypLE Express and seed them into 1 well on a 6-well plate. Culture the cells in hPSC culture medium supplemented with 10 μM of Y-27632.\nOn day 2 post nucleofection, refresh cells with regular hPSC culture medium without Y-27632 and allow the HDR donor-integrated cells to express the antibiotic-resistant protein.\nOn day 3 post nucleofection, start antibiotic selection by feeding cells with G418 (neomycin; 100 μg/mL) hPSC selection medium.",
    "Critical: Since different hPSC lines can possess distinct sensitivities to a certain antibiotic, it is important to perform kill curve experiments in advance to establish the optimal antibiotic concentrations for the cell lines of interest. As variables such as cell density, colony compactness, and transfection-related cellular stress can also influence antibiotic sensitivity, we highly recommend processing the cells in the kill curve experiments as similarly as possible to the actual selection process. Accordingly, we established the G418 kill curve in H9 cells 3 days after mock-nucleofection and observed that a concentration of 100 μg/mL was needed to kill all cells over a period of ~5 days.\nFor the next 4–5 days after starting antibiotic selection, you will see massive cell death with only a few single cells or tiny cell clusters (2–3 cells per cluster) remaining in the well. This is normal. Do not discard the cells and keep refreshing them with hPSC selection medium on a daily basis.\nAfter ~1 week of antibiotic selection, small resistant colonies start to emerge, and cells grow more rapidly than the initial period of selection.\nNote: If the Cas9 + gRNA + pmaxGFP reaction is included for nucleofection, cells subjected to this condition should be all dead at this point.\nKeep feeding cells with hPSC selection medium. After 1–2 weeks of selection manually detach individual middle-sized colonies (~200–400 cells per colony) with P200 pipette tips and transfer each colony into 1 well on a 24-well plate pre-coated with Matrigel. Change tips and wash the wells after each colony picking to prevent cross-contamination.",
    "Critical: Closely monitor the culture during this period of time, and only pick and transfer colonies emerging from single cells. Do not include colonies that you suspect to have already merged together. As the growth rate of individual colonies varies, you will most likely need to stagger the process and pick colonies on different days once suitable ones emerge.\nNote: Based on the fact that almost all cells were killed by antibiotic selection under our experimental setting, it is extremely unlikely that 2 or more close-by cells simultaneously integrated the donor plasmid and became resistant. Therefore, it is reasonable to assume that the individual colonies emerged after selection are of single-cell origin. However, if antibiotic selection is not available or there are many cells surviving the selection, it will be impossible to perform single colony picking as described here. In such cases, cell sorting, low density plating, or serial dilution will be required to ensure clonal cell line establishment.\nFor colonies transferred to 24-well plates, let them attach to the culture wells and start feeding daily with hPSC selection medium 2 days post transfer. At the same time, feed the remaining cells in the 6-well plate with hPSC selection medium on a daily basis.\nNote: Not all colonies transferred to 24-well plates are suitable for downstream processing. Some colonies might not reattach to the culture wells after transfer. Some colonies might grow a lot slower or faster than normal, which could indicate potential genomic abnormalities and should be discarded. In addition, colonies that show overt spontaneous differentiation should be excluded from downstream processing.",
    "During the next week (~week 2–3 after selection starts), use 0.5 mM EDTA to split the colonies in each 24-well to one Matrigel-coated 12-well once they become big in size. Tweak the optimal EDTA incubation time depending on the size and compactness of colonies in each well.\nCritical: It is important to let the colonies reach a big size (comparable to that of regularly maintained hPSC colonies with at least a few thousand cells) before splitting to allow expansion of the clones. However, avoid keeping growing the colonies without passage until they show signs of overt spontaneous differentiation such as rugged colony edges or brown colony centers. Colonies with slight spontaneous differentiation will most likely recover after 1–2 regular passages.\nAlternatives: Colonies can also be split by TrypLE Express dissociation into single cells or manually cutting into smaller pieces and detach and transfer to new culture vessels.\nDuring the same period, split the remaining cells in the 6-well to one 12-well. Culture the cells with hPSC selection medium. These pooled “polyclonal” cells can be saved as backups in case more single clones are needed in the future.\nDuring the following week (~week 3–4 after selection starts), use 0.5 mM EDTA to split the colonies in each 12-well to multiple 6-wells once they become 70%–80% confluent. Feed cells daily with hPSC selection medium.\nOnce cells reach 70%–80% confluent in 6-wells, freeze them at one 6-well per cryotube using hPSC culture medium supplemented with 10% DMSO.\nPause Point: The frozen vials can be kept in liquid nitrogen tanks long-term while genotyping the individual clones for correct reporter insertion (see below).",
    "During either of the cell split points above (24- to 12-well or 12- to 6-well) or when freezing cells for cryopreservation, set aside some cells to isolate genomic DNA using the DNeasy Blood & Tissue Kit following manufacturer’s instructions.\nNote: If many clones are to be screened, it is desirable to extract genomic DNA as early as possible (split from 24- to 12-well) to process for genotyping in order to exclude unwanted clones from further culturing and expansion. When more cells are used for genomic DNA extraction, it will take a longer time for cells to grow back in the 12-wells or you might need to split cells into a smaller well format. It is possible to use alternative genomic DNA extraction kits such as the Epicentre QuickExtract DNA Extraction Solution which requires lower cell input. Although suitable for quick initial genotyping with short and easy-to-amplify PCR products, the quality and yield of DNA obtained from this method are consistently low in our hands and it is difficult to use the resulting products for more demanding genotyping involving challenging PCR conditions (see below).\nPerform genotyping to assess if clones have the correct genomic insertion of the reporter cassette. Design PCR primers outside the HAs to amplify the wildtype (WT) locus to determine whether heterozygous integration takes place. Design primers for junctional PCR to amplify sequences encompassing part of the internal portion of the reporter cassette as well as a genomic region outside one of the HAs (Figure 5[href=https://www.wicell.org#fig5]A and Table 6[href=https://www.wicell.org#tbl6]). Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig5.jpg\nFigure 5. Genotyping of Clones before Antibiotic Cassette Removal",
    "(A) Schematic showing the PAX7 allele after reporter knockin while retaining the antibiotic resistance cassette. Positions of genotyping primers and expected PCR product sizes are also shown. WT, wild type; KI, knockin; EX, external; IN, internal; FW, forward; RV, reverse.\n(B) Genotyping PCR products of the WT allele (EX-FW #2 and EX-RV #2). Note that the whole length of inserted reporter cassette was not successfully amplified in this case. M, molecular marker; Poly, the leftover “polyclonal” cells after single clone picking.\n(C) Similar to (B) with 3′ junctional genotyping PCR (IN-FW and EX-RV).\n(D) Sanger sequencing results showing the intact WT allele sequences surrounding PAM of the targeting gRNA (lower case bases denoted by the green arrow).\n(E) Sanger sequencing of the 3′ junctional region demonstrating proper reporter insertion at the intended locus. The right HA on the HDR vector is denoted by lower case bases while the genomic sequences outside the HA by upper case bases. The red arrow indicates the 3′ junction.\nIn (D) and (E), chromatograms are shown with light gray peaks representing base call qualities. Dark gray bars on top indicate matches between expected and obtained DNA sequences.\ntable:files/protocols_protocol_234_27.csv\ntable:files/protocols_protocol_234_28.csv\ntable:files/protocols_protocol_234_29.csv\ntable:files/protocols_protocol_234_30.csv\nRun the entire PCR products on a 0.8% TAE agarose gel, excise the correct-sized bands, and extract DNA using the MinElute Gel Extraction Kit according to manufacturer’s instructions (Figures 5[href=https://www.wicell.org#fig5]B and 5C).\nSubmit the purified PCR products for Sanger sequencing to confirm the integration of the reporter cassette at the intended genomic location and the intactness of the unintegrated WT allele (Figures 5[href=https://www.wicell.org#fig5]D and 5E). Refer to the following table for sequencing primers for each PCR amplicons (see Table 3[href=https://www.wicell.org#tbl3] for primer sequences). Troubleshooting 3[href=https://www.wicell.org#sec6.5]\ntable:files/protocols_protocol_234_31.csv",
    "We chose one of the heterozygous clones with the correct genotyping (clone #3) to continue with the rest of the protocol.\nRemoval of Antibiotic Resistance Cassette from Reporter Cells\nTiming: 4–6 weeks\nSince the strong constitutive PGK promoter driving neomycin resistance might have unpredictable effects on the expression of nearby endogenous gene(s), it is ideal to remove the PGK-Neo portion of the integrated reporter cassette from the host genome. Since this region is flanked by two loxP sites, in this step we describe procedures to excise out this sequence by introducing the Tat-Cre recombinase into the cells followed by another round of single-cell cloning. We also illustrate genotyping of the resultant clones to confirm successful removal of the antibiotic resistance cassette.\nAlternatives: Cells can be transfected with plasmids or transduced with viruses expressing Cre to remove the antibiotic resistance cassette.\nAlternatives: Antibiotic cassette removal can be initiated immediately after cells recover from antibiotic selection without an initial round of single-cell cloning to save time on cell culture and genotyping. However, this might increase the number of false positive clones picked and the need to genotyping more clones. In addition, performing two rounds of single-cell cloning practically eliminate any possibilities of multi-clonality of the established reporter cell lines.\nThaw the chosen reporter clone (#3 in this case) and culture for 1–2 passages to let the cells recover. Make sure colonies show regular growth rate and morphology without spontaneous differentiation before proceeding to the next steps.\nOnce colonies reach ~70%–80% confluent, dissociate into single cells with TrypLE Express and seed them into Matrigel-coated tissue culture vessels with hPSC culture medium supplemented with 10 μM of Y-27632 at a few different densities: 6,250, 12,500, 25,000 and 50,000 per cm2.",
    "The next day, change to hPSC culture medium supplemented with 200 μg/mL of recombinant Tat-Cre (a gift from Anjana Rao Lab). Monitor the cells every hour and replace with regular hPSC culture medium after 3 h of Tat-Cre exposure when ~50%–70% of cells are dead.\nCritical: From this point on, do not include G418 in the hPSC culture medium as cells will regain sensitivity to the antibiotic once the selection cassette is successfully removed.\nDuring the first week or so after Tat-Cre exposure, the majority of cells will die while a few cells will survive and grow to small-sized individual colonies ready to be picked.\nCritical: It is important to use an optimal combination of cell seeding density and Tat-Cre dosage and exposure time to enable single colony picking later on. If the cell density is too low or Tat-Cre is overdosed (concentration too high or exposure time too long), no cells will survive. On the other hand, if cell density is too high or Tat-Cre is not adequately used, there will be too many surviving colonies which will be in contact with each other before becoming suitable in size for single colony picking. Moreover, it will cause a high proportion of picked clones to not have successful Cre mediated antibiotic cassette removal. In our hands, a seeding density of 25,000 cells/cm2 with 3 h of Tat-Cre exposure at 200 μg/mL works the best. We have also tried lower Tat-Cre concentrations at 40 or 80 μg/mL with for ~24 h exposure. While 80 μg/mL was too toxic and killed all cells across all seeding densities, 40 μg/mL with 50,000 cells/cm2 produced workable colonies for downstream usage.",
    "Alternatives: The Tat-Cre recombinant protein can also be obtained from commercial sources such as the TAT-CRE Recombinase from Millipore-Sigma. It should be used following manufacturer’s instructions and the principals described above.\nEstablish single clones, store cells and obtain genomic DNA for genotyping using similar procedures as described in steps 49–55 in section “Establishment of Reporter Cell Lines with Antibiotic Resistance.” During one of the passages of the clonal lines, set duplicate receiving wells and culture one well of cells with regular hPSC culture medium while the other with medium supplemented with 100 μg/mL of G418. Discard the clones which are still resistant to G418.\nPerform genotyping to confirm clones with the antibiotic resistance cassette successfully removed. At this stage, we also performed genotyping PCRs to confirm the 5′ integration junction region and the absence of random plasmid backbone recombination (Figure 6[href=https://www.wicell.org#fig6] and Table 6[href=https://www.wicell.org#tbl6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig6.jpg\nFigure 6. Genotyping of Clones after Antibiotic Cassette Removal\n(A) Schematic showing the PAX7 knockin allele after antibiotic resistance cassette removal. Positions of genotyping primers and expected PCR product sizes are also listed except for those used to check donor vector backbone integration. EX: external; IN: internal; FW: forward; RV: reverse.\n(B) Genotyping PCR products of the 3′ junctional region (IN-FW and EX-RV #2) after successful antibiotic cassette removal. PCR products from the parental H9 cells as well as clone #3 containing the antibiotic cassette are included as controls.\n(C) Genotyping of 5′ junctional region (EX-FW #2 and IN-RV #2).",
    "(D) Genotyping to confirm no random vector backbone integration using AmpR forward #2 and reverse #2 genotyping primers. The HDR donor plasmid is included as a positive PCR control showing amplification of a region within the ampicillin resistant (AmpR) cassette in the vector backbone with an expected size of 345 bp. In (B)–(D), M indicates a molecular marker.\n(E) Sanger sequencing results showing the intact WT allele sequences surrounding PAM of the targeting gRNA (lower case bases denoted by the green arrow).\n(F) Sanger sequencing of the 3′ junctional region demonstrating proper reporter insertion at the intended locus. The right HA on the HDR vector is denoted by lower case bases while the genomic sequences outside the HA by upper case bases. The red arrow indicates the 3′ junction. In (E) and (F), chromatograms are shown with light gray peaks representing base call qualities. Dark gray bars on top indicate matches between expected and obtained DNA sequences.\ntable:files/protocols_protocol_234_32.csv\ntable:files/protocols_protocol_234_33.csv\ntable:files/protocols_protocol_234_34.csv\naAnnealing temperature of 58°C and extension time of 5 min for the primer pair to check antibiotic cassette removal. Annealing temperature of 55°C and extension time of 2 min for the primer pair to check insertion at intended genomic location (50 junction region). Annealing temperature of 60°C and extension time of 0.5 min for the primer pair to check random recombination of vector backbone.\nRun the entire PCR products on TAE agarose gels, excise the correct-sized bands and extract DNA (excluding those for vector backbone recombination examination) using the MinElute Gel Extraction Kit according to manufacturer’s instructions.",
    "Submit the purified PCR products for Sanger sequencing to confirm the final integration of only the desired portion of the reporter cassette (Figures 6[href=https://www.wicell.org#fig6]E and 6F). Refer to the following table for sequencing primers for each PCR amplicons (see Table 3[href=https://www.wicell.org#tbl3] for primer sequences).\nWe chose clone #3-13 and #3-22 to continue with the rest of the protocol.\nNote: Pick the clones that show normal pluripotent colony morphology with comparable growth rate to the parental cells. Confirm pluripotency by checking marker expression such as OCT4, NANOG, and SOX2. Also confirm normal karyotypes of the selected clones before proceeding to the next steps.\nRun the entire PCR products on TAE agarose gels, excise the correct-sized bands and extract DNA (excluding those for vector backbone recombination examination) using the MinElute Gel Extraction Kit according to manufacturer’s instructions.\nSubmit the purified PCR products for Sanger sequencing to confirm the final integration of only the desired portion of the reporter cassette (Figures 6[href=https://www.wicell.org#fig6]E and 6F). Refer to the following table for sequencing primers for each PCR amplicons (see Table 3[href=https://www.wicell.org#tbl3] for primer sequences).\ntable:files/protocols_protocol_234_35.csv\nWe chose clone #3-13 and #3-22 to continue with the rest of the protocol.\nNote: Pick the clones that show normal pluripotent colony morphology with comparable growth rate to the parental cells. Confirm pluripotency by checking marker expression such as OCT4, NANOG, and SOX2. Also confirm normal karyotypes of the selected clones before proceeding to the next steps.\nFunctional Validation of Reporter Cells - Artificial PAX7 Activation by CRISPR/dCas9-VPR\nTiming: ~2 weeks",
    "PAX7 is expressed in skeletal muscle progenitor cells (SMPCs) and stem cells (satellite cells, SCs), as well as neural crest and a few other lineages (Jostes et al., 1990[href=https://www.wicell.org#bib16]; Lepper and Fan, 2010[href=https://www.wicell.org#bib17]). However, it is not expressed in undifferentiated hPSCs. Therefore, it is desired to be able to rapidly test the functionality of the GFP reporter to reflect endogenous PAX7 expression. Here, we designed gRNAs targeting the PAX7 promoter region coupled with the SP-dCas9-VPR system (Addgene, #63798) to artificially activate endogenous PAX7 expression, followed by examination through fluorescent-activated cell sorting (FACS), immunofluorescent (IF) microscopy and quantitative real-time PCR (qPCR).\nConstruct the plasmids expressing gRNAs for PAX7 activation/reporter validation according to steps 1–11 in section “Cloning of Candidate gRNA Expression Plasmids for Reporter Insertion.”\nScreen for the most potent gRNA(s) to activate PAX7 expression in the parental H9 hPSCs.\nDissociate ~70%–80% confluent H9 colonies into single cells with TrypLE Express and seed them into Matrigel-coated tissue culture vessels with hPSC culture medium supplemented with 10 μM of Y-27632 at 25,000 cells per cm2.\nThe next day, switch to presomitic mesoderm (PSM) promoting medium and culture the cells for 2 days with daily medium change.\nTwo days later, dissociate into single cells with TrypLE Express and seed the cells into Matrigel-coated tissue culture vessels at 75,000 cells per cm2 with SC medium.",
    "One day after seeding, transfect the cells using ViaFect following manufacturer’s instructions. In each well on a 24-well plate, use 0.25 μg each of the dCas9-VPR and gRNA plasmid with 1.5 μL of ViaFect reagent (reagent-to-plasmid ratio of 3:1 (v/w)). Include a condition with dCas9-VPR plus empty gRNA cloning vector as a negative control. In addition to transfection of individual gRNA plasmids, set up a separate condition with all four gRNA plasmids mixed at an equal amount (0.0625 μg each).\nCulture the cells with daily SC medium change. Two days post transfection harvest the cells and extract RNA using the RNeasy Plus Micro Kit following manufacturer’s instructions.\nGenerate cDNA using the iScript Reverse Transcription Supermix and perform qPCR to check PAX7 expression using the SsoAdvanced Universal SYBR Green Supermix.\nCritical: It is important to select gRNA(s) that can activate endogenous PAX7 expression strong enough to enable the isolation of reporter (GFP) positive cells for downstream analysis. Consistent with reports from literature (Didovyk et al., 2016[href=https://www.wicell.org#bib8]), we have found that the mixture of all four gRNAs resulted in a much higher PAX7 expression level than any of the individual ones alone even when the total gRNA plasmids were kept at the same (Figure 7[href=https://www.wicell.org#fig7]A). Accordingly, we transfected all four gRNAs in our further experiments for PAX7 activation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig7.jpg\nFigure 7. Artificial Reporter Validation through PAX7 Promoter Activation Using the dCas9-VPR System\n(A) Pre-differentiated H9 cells were co-transfected with dCas9-VPR plus individual, mixed or empty (EV) gRNA plasmids. All transfections were performed in duplicates followed by RNA extraction. PAX7 expression was examined by qPCR and normalized to GAPDH.\n(B) Reporter cells from clone #3-13 and #3-22 were transfected by dCas9-VPR along with the mixed PAX7 promotor targeting or EV gRNA plasmids and sorted into GFP+ and GFP− fractions.",
    "(C) Representative images of sorted cells subjected to cytospin followed by IF microscopy of PAX7. Numbers represent average percentage of sorted cells expressing PAX7 with SEM, from 2 independent experiments. Nuclei were counterstained by DAPI. Scale bars, 50 μm.\n(D) Sorted cells were examined by qPCR for GFP and PAX7 expression with normalization to GAPDH.\n(B–D) Adapted from Supplemental Figure S4 in Xi et al. (2020)[href=https://www.wicell.org#bib26].\nNote: In our hands, the efficiency of simultaneous nucleofection of mid/large-sized plasmids into undifferentiated hPSCs is relatively low (although for small plasmids such as pmaxGFP, the efficiency can exceed 40%). This poses a challenge for the sensitivity of detection of PAX7 activation when the plasmids do not carry features that can be used to enrich the transfected populations such as in our case. We have found in house that hPSCs differentiated to an early mesoderm stage are more easily transfected than the undifferentiated state (data not shown). Therefore, we employed this approach to enable comparison of PAX7 activation by different gRNAs directly in unenriched populations.\nAlternatives: As long as sufficient transfection efficiency is achievable, undifferentiated hPSCs or hPSCs under a different state can be used to screen for PAX7 activation gRNAs. Easy-to-transfect cells such as 293FT can also be used for this purpose.\nTransfect the H9 reporter clones #3-13 and #3-22 with a mixture of plasmids encoding all four gRNAs along with dCas9-VPR following the same procedures as the above step 70. Use bigger culture vessels such as 6-well plates (with a total of 2.5 μg plasmids per well) for transfection to obtain enough cells for downstream processing.",
    "On day 3 post transfection, dissociate into single cells with TrypLE Express and FACS sort each transfected clone into GFP+ and GFP− fractions. Also obtain cells transfected with dCas9-VPR and the empty gRNA cloning vector as no PAX7 activation controls (Figure 7[href=https://www.wicell.org#fig7]B).\nLoad 10,000–20,000 cells in 100–200 μL volume into each channel of the Shandon Double Cytofunnel and attach the cells onto the Superfrost Plus Microscope Slides using a Cytospin 4 Cytocentrifuge at 1,000 rpm for 5 min. Fix the attached cells with 4% paraformaldehyde and proceed to stain for PAX7 protein following regular IF microscopy procedures. Image and quantify PAX7+ cells in GFP+ and GFP− fractions (Figure 7[href=https://www.wicell.org#fig7]C).\nExtract RNA from the remaining cells not used for Cytospin and proceed with cDNA generation and qPCR to examine PAX7 expression in sorted populations (Figure 7[href=https://www.wicell.org#fig7]D).\nFunctional Validation of Reporter Cells - Physiological PAX7 Activation by Directed Skeletal Myogenic Differentiation\nTiming: ~5 weeks\nTo examine the functionality of the PAX7-GFP reporter in a physiological context, we differentiated the reporter cells toward the skeletal muscle lineage as PAX7 is highly expressed when cells are specified to a SMPC fate. We illustrate the procedures here using a chemically defined myogenic differentiation protocol we have previously established (Figure 8[href=https://www.wicell.org#fig8]) (Xi et al., 2017[href=https://www.wicell.org#bib25]). Other published protocols can also be used to achieve the same goal (Chal et al., 2015[href=https://www.wicell.org#bib5]; Chal and Pourquie, 2017[href=https://www.wicell.org#bib6]; Hicks et al., 2018[href=https://www.wicell.org#bib15]; Magli and Perlingeiro, 2017[href=https://www.wicell.org#bib19]; Shelton et al., 2014[href=https://www.wicell.org#bib22]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig8.jpg\nFigure 8. Overview of the Directed Myogenic Differentiation Protocol\n(A) Schematic of the protocol. PS, primitive streak; pPSM, posterior presomitic mesoderm; aPSM, anterior presomitic mesoderm; SM, somite; DM, dermomyotome; CHIR, CHIR99021; L, LDN-193189; SB, SB431542.\n(B) Morphology of differentiating cultures at key time points.",
    "On day −1, dissociate ~70%–80% confluent reporter cell colonies into single cells with TrypLE Express and seed them onto Matrigel-coated tissue culture vessels with hPSC culture medium supplemented with 10 μM of Y-27632 at 12,500–25,000 cells per cm2.\nNote: Also set up a small-scale differentiation of the parental H9 cells to be used as gating controls for GFP FACS sorting at the end of the experiment.\nCritical: It is important to optimize the initial cell seeding densities for optimal differentiation outcomes. Too high of a seeding density will cause inadequate fate specification, whereas too low of a seeding density will result in excessive cytotoxicity during the initial differentiation stages. In addition, we have found that cells in a loosely aggregated state (1 day after single-cell seeding) are better specified compared to those in more compact colonies (multiple days after single-cell seeding or seeded as small colonies) (Figure 9[href=https://www.wicell.org#fig9]). In our hands, a 12,500–25,000 cells per cm2 seeding density works well for H9 and derived reporter cells as well as some in-house generated iPSC lines (Young et al., 2016[href=https://www.wicell.org#bib27]). However, seeding conditions might need to be further optimized for user-specific hPSC lines.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig9.jpg\nFigure 9. Influence of Cell Density on hPSC Early Stage Mesoderm Fate Specification\nH9 cells were seeded as single cells at 25,000 or 50,000 cells per cm2 and allowed to grow for 1–3 days before starting differentiation. Alternatively, cells were seeded as colonies and allowed to grow for 3 days to reach small-to-medium size before differentiation was initiated. Primitive streak (PS) markers T and MIXL1 and posterior presomitic mesoderm (pPSM) markers TBX6 and PDGFRA were examined by qPCR after 1 or 2 days, respectively. Expression was normalized to GAPDH.\nThe next day (day 0), wash cells with PBS once and start differentiation by adding PSM promoting medium.",
    "On day 1, cells are specified to a primitive streak (PS) fate. Refresh cells with PSM promoting medium.\nOn day 2, cells are specified to a posterior PSM (pPSM) fate. Wash cells with PBS once and add somite (SM) promoting medium.\nOn day 3, cells are specified to an anterior PSM (aPSM) fate. Refresh cells with SM promoting medium.\nOn day 4, cells are specified to a SM fate. Wash cells with PBS once and add dermomyotome (DM) promoting medium.\nNote: Cell fate change at these early stages are fairly rapid and cells can drift toward unwanted fates if they are not exposed to medium promoting the next desired state in time. Add SM promoting medium no more than 48 h after differentiation is initiated, and switch to DM promoting medium no more than 48 h after SM promoting medium is applied.\nOn day 5, refresh cells with DM promoting medium.\nOn day 6, cells are specified to a DM fate. Wash cells with PBS once and add myogenesis (Myo) promoting medium.\nOn day 8 and onwards, refresh cells with Myo promoting medium every other day until the end of differentiation. SMPCs emerge during week 3–4 of differentiation and the myogenic populations become robust after around week 4. Troubleshooting 4[href=https://www.wicell.org#sec6.7]",
    "Note: It is normal to observe significant cell death during week 1–2 after switching to Myo promoting medium. Wash the wells 1–2 times with PBS to remove excessive dead cells and cellular debris at each medium change. The differentiating cells will recover after this period and become rapidly growing during the following week or so. If medium color is found to change to yellow too quickly before the next feeding schedule, refresh medium every day instead of every other day, or increase the volume of medium used (e.g., feed with 3 mL instead of regular 2 mL per 6-well). Cultures will become stable after week 3–4 of differentiation.\nNote: For differentiation longer than 5–6 weeks, it is not uncommon to see a sheet of differentiating cultures partially detached from the culture vessels. This sheet is mainly composed of dense extracellular matrix (ECM) produced during the differentiation process and the cells growing underneath it are still usable. Be careful when changing medium to avoid completely peeling the sheet off from the culture vessels.\nAfter about 4 weeks, stop differentiation and harvest cells for functional reporter validation.\nWash cells with PBS once and incubate at 37°C for ~5 min with 2 mg/mL of Collagenase IV in DMEM/F12 medium. After incubation, cultures will start to loosen up, but no cells should detach at this point.\nRemove the Collagenase IV solution using pipette tips (not vacuum) and wash once with PBS. Incubate at 37°C for 6–8 min with TrypLE Express. Tap the culture vessels occasionally to facilitate dissociation.\nAdd FACS buffer at least 2 times the volume of TrypLE Express and triturate to fully dissociate the cultures.",
    "Note: The ECM present in the differentiation cultures tend to aggregate and trap cells during the dissociation process. Use pipette tips to “tear apart” the aggregated ECM before starting trituration. To prevent excessive clogging during pipetting, cut the end of tips or use wide-bore tips to triturate first followed by regular P1000 tips.\nFilter the cell solution through 100 μm cell strainers. Add additional volume of FACS buffer to wash the culture vessels and filter and combine with the cell solution.\nFilter the eluent again through 70 μm cell strainers, and centrifuge at 300 × g for 6 min.\nResuspend the cell pellets with FACS buffer and count the cells. If necessary, adjust cell solution volume to achieve optimal cell concentrations for the specific cell sorters to be used.\nOptional: If desired, stain cells with antibodies of interest for FACS soring and/or flow cytometry analysis.\nAliquot appropriate number of cells for sorting controls or samples into individual test tubes by filtering through 35 μm cell strainer snap caps.\nAdd DAPI at a final concentration of 0.5–1 μg/mL to the sample and appropriate control tubes and mix well.\nFACS sort the reporter cells into GFP+ and GFP− fractions.\nExamine the sorted populations for PAX7 enrichment through Cytospin-IF microscopy and qPCR (Figure 10[href=https://www.wicell.org#fig10]) as described in steps 73 and 74 in section “Functional Validation of Reporter Cells - Artificial PAX7 Activation by CRISPR/dCas9-VPR.”\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/234-Fig10.jpg\nFigure 10. Physiological Reporter Validation through hPSC Directed Myogenic Differentiation\n(A) Representative FACS plots of clone #22 reporter cells under myogenic differentiated and sorted for GFP+ and GFP− fractions. H9 parental cells from the same differentiation batch were used as GFP gating controls.",
    "(B) Representative images of sorted cells subjected to cytospin followed by IF microscopy of PAX7. Numbers represent average percentage of sorted cells expressing PAX7 with SEM, from 2 independent experiments. Nuclei were counterstained by DAPI. Scale bars, 100 μm.\n(C) Sorted clone #3-22 cells, as well as unsorted #3-22 or parental H9 cells, were examined by qPCR for GFP and PAX7 expression with normalization to GAPDH. This figure is adapted from Supplemental Figure S4 in Xi et al. (2020)[href=https://www.wicell.org#bib26]."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Stem Cells",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}