{
  "id": 19928,
  "origin_website": "Wiley",
  "title": "Establishing a Microfluidic Tumor Slice Culture Platform to Study Drug Response",
  "procedures": [
    "This protocol describes Breast Cancer (BrC) PDX tumor collection, preparation, and handling in detail. The method elaborates on the preparation of 300-µm tumor slices suitable for culture. Following the protocol allows the generation of tissue slices and culture conditions that preserve the viability of the original tissue. Next, the microfluidic device is described in more detail. The device is a closed version of the comPLATE (Bi/ond, Delft, The Netherlands). This protocol contains a step-by-step explanation of the procedure, including cleaning, assembly, control during the run, and disassembly of the device. This protocol allows breast cancer tissue slices to be cultured for up to 14 days with or without treatment. A maximum of six slices can be handled within a single setup. A video demonstration of how to assemble the comPLATE can be found at https://youtu.be/SKmaQeLZYP8[href=https://youtu.be/SKmaQeLZYP8].\nMaterials\nBreast PDX tumors (or other tumor tissue)\nBreast medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-rec-0001]; Naipal et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-bib-0012])\n4% Low-gelling agarose (Sigma-Aldrich, cat. no. A9414) in PBS\nEthanol\n0.1 g/ml Mebiol hydrogel (Cosmo Bio Co, cat. no. MGB-PMW20-1001-COS)\nStore at 4°C. Dilute 1 g hydrogel in 10 ml breast medium\n30 μM 5-Ethynyl deoxyuridine (EdU, 10 mM; Invitrogen, cat. no. A10044) in DMSO\nFormalin\n15- and 50-ml Falcon tubes (Greiner Bio-one, cat. no. 188271-N and 227261)\n10-cm culture dishes (Cellstar, Greiner Bio-one, cat. no. 664160)\nDisposable scalpel (e.g., Swann-Morton, cat. no. SM0501)\n6-well plates (Starstedt, cat. no. 83.3920)\nLeica VT 1200S Vibratome\n60°C water bath\nIncubator (37°C, 5% CO2)\nStuart SSM1 mini orbital shaker (Camlab Limited)\nBlades (e.g., Super Chrome Blades, Shark)\nSuperglue (e.g., Bison)\n10-ml plastic pipettes\nThermometer\nTubing, OD 1/16″ (Darwin Microfluidics, cat. no. BL-PTFE-1608-20)\nFlangeless PEEK Fittings (IDEX, cat. no. CIL-XP-230X)\nETFE Ferrules ¼-28 to 1/16″ OD (IDEX, cat. no. CIL-XP-200NX)",
    "comPLATE (Bi/ond, includes a bottom plate, top plates, rings, black rubber gasket, and chips)\nFLPG Plus pumping system (Fluigent)\nFluigent MFCS-EZ (Fluigent)\nFluigent FLOW UNIT-S (Fluigent)\nIO-Biofilm-Entferner (Umweltanalytik)\nPaper tissues\nPlastic precision tweezers (e.g., Cole-Parmer, cat. no. 15657418)\nMetal precision tweezers (e.g., Fisher Scientific, cat. no. 16647753)\nP20 pipette (Gilson)\nP20 pipette tips, pre-cooled at −20°C\nScissors\n1. Prepare a 50-ml Falcon tube with approximately 30 ml breast medium; tumor samples can be collected by placing tissue in this tube and transporting it on ice.\nTissue handling is done in a semi-sterile environment; wear gloves while filling the Falcon tube with medium and use clean utensils to place the tissue inside the tube.\n2. Place the tissue in a 10-cm dish filled with medium and prepare the tissue for slicing using a scalpel.\nTumors may contain necrotic cores; by cutting the tumor into four parts through the middle, the necrotic tissue can be localized and separated from the live tumor tissue. To avoid contamination, ensure that all utensils and surfaces are properly cleaned.\n3. Clean the Leica VT 1200S vibratome and its surroundings with 70% ethanol and operate only while wearing gloves.\nTissue slicing is performed in a semi-sterile environment; it is important to keep the Vibratome and surrounding surfaces clean.\n4. Pour the 4% agarose/PBS (kept in a 60°C water bath) into one well of a 6-well plate to fill it entirely.\n5. Monitor the temperature until the agarose cools to 37°C.\n6. Place the tissue in the 4% agarose and wait until the agarose solidifies (Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0001]).",
    "The tissue will sink to the bottom of the well before the agarose solidifies. Ensure that the tissue stays at the top of the plate by holding it in position with metal tweezers. This step will aid the slicing process by positioning the tissue in the preferred location. Alternatively, let the tissue sink to the bottom of the plate and invert the agarose block before cutting.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c52d5943-ab75-4f5a-9efa-43a8e9013b68/cpz1693-fig-0001-m.jpg</p>\nFigure 1\nCoC device assembly. (A) Tumor sample embedded in an agarose block to immobilize it for slicing with the Leica VT 1200S vibratome. (B) Agarose block containing tissue glued to the magnetic bottom and assembled within the vibratome. (C) Top view of a Bi/ond microfluidic three-channel chip. A silicon frame supports the PDMS membrane. (D) Schematic of a vertical cross-section of the bi/ond microfluidic chip. The microchannel and well are separated by a porous PDMS layer that allows media perfusion. (E) Bi/ond chip on the bottom plate containing a tissue slice immobilized in thermoreversible Mebiol hydrogel. (F and G) Fully assembled comPLATE platform with the bottom plate, chips containing tissue slices, top plates, and white rings. This assembly allows connection to the perfusion system using adaptors that fit the top plate inlets.\n7. Remove the agarose block from the 6-well plate using a scalpel.\n8. Trim the agarose block to ensure it fits in the Leica VT 1200S vibratome.\n9. Glue the agarose block to the removable magnetic bottom of the Leica VT 1200S Vibratome using Bison superglue.\n10. Place the magnetic bottom with the agarose block into the vibratome and fill the well with PBS until it covers the agarose block (Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0001]).\n11. Begin slicing the tissue at a speed of 0.6 to 1 mm/s, amplitude 2.00 mm, and thickness 300 µm.",
    "These settings can be adjusted according to the quality of the tissue. If the tissue is difficult to process, the speed may be decreased and the amplitude increased.\n12. Use sterile metal tweezers to transfer the slices to a 10-cm dish filled with breast medium.\nCollecting the slices in a dish before placing them into separate wells of a 6-well plate allows randomization. If sequential slices are preferable, they can be collected directly into the 6-well plate.\n13. Place each slice in a separate well of a 6-well plate and place it on an orbital shaker at 60 rpm in a 37°C, 5% CO2 incubator.\nTissue slices can be cultured using this method until the microfluidic setup is complete; the maximum culture time is 1 day.\n14. Cut the tubing to appropriate lengths, clean it, and connect it to the perfusion system. Prepare the medium reservoir (15-ml Falcon tube) and collection tubes (15-ml Falcon tubes) and fix them in the appropriate tube holders connected to the shelf inside the CO2 incubator (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0002]). Make sure the ends of the tubing are submerged in the medium in both reservoir and collection tubes to avoid air bubbles.\nThe tubing should be long enough to reach from the perfusion system to the plate and from the plate to the reservoir (the length will depend on the perfusion system selected for this assay). Cut the tubing with sharp scissors or a knife to avoid deformation.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e7ebfc0f-bb4c-4a13-a9c0-1a025d51dcab/cpz1693-fig-0002-m.jpg</p>\nFigure 2",
    "CoC platform connection to the Fluigent flow control system. (A) The microfluidic flow control system (Fluigent MFCSTM-EZ) connected to an FLPG pump, and flow rate sensors (Fluigent FLOW UNIT-S) are placed on a shelf that can be inserted in a CO2 incubator and connected to the CoC device. The white holders on the shelf are for media reservoirs (15-ml Falcon tubes) and collection reservoir. (B) The CoC device with connections between the comPLATE and MFCS-EZ system, along with the flow rate sensor in the CO2 incubator. (C) Schematic overview of the connections made within the system to allow continuous perfusion under flow control. Tubing length and diameter are specific to maintain a flow rate between 1.6 and 10 µl/min.\n15. Connect the tubing with adaptors and ferrules to the plate (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0002]).\n16. Prepare the medium with or without additional (chemotherapeutic) compounds.\nThis step depends on the choice of experimental setup. For example, Chakrabarty et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-bib-0003], used 5 µg/ml cisplatin. Prepare drugs/treatments to the appropriate concentrations and handle all compounds with care, as they may be toxic or carcinogenic.\n17. Prepare the comPLATE parts and connect the black rubber element with the top plate.\n18. Prepare the tissue slices generated in step 13 and the pre-cooled hydrogel (keep on ice).\nMebiol hydrogel is a thermo-reversible gel that solidifies at room temperature. Even on ice, the hydrogel is quite viscous. While handling, keep the hydrogel and P20 pipette tips on ice to maintain solubility. Avoid bubble formation.\n19. Place the tissue on the chip using the Mebiol hydrogel (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0001] and 1D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0001]).",
    "Use P20 tips that are pre-cooled at −20°C. Pipette approximately 2 µl hydrogel on the bottom of the open well, place the tissue on top using metal tweezers and cover with 2 µl hydrogel. Work fast to prevent gelling of the hydrogel in the pipette tip.\n20. Close the system with a top plate and tighten with the white ring (Fig. 1E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0001] and 1F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0001]). Fill and connect the medium reservoir to the holder attached to the incubator shelf (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0002]). Connect the collection reservoir to the holder opposite the medium reservoir. Ensure the tubing is fully submerged in both reservoirs.\n21. Connect the CoC device to the FLPG Plus pumping system with an MFCS-EZ flow control system for continuous perfusion according to manufacturer directions.\n22. Connect the microfluidic flow control system (Fluigent MFCS-EZ) and flow rate sensors (Fluigent FLOW UNIT-S) to the comPLATE containing tumor slices in each well using tubing and adaptors. Ensure the MFCS-EZ is connected to the MAESFLO software to check the flow rate during the run.\n23. Make sure that the flow rate control system is connected to the Fluigent Microfluidic Automation Tool (MAT) with the predesigned program set for an inlet flow rate of 5 µl/min through the top and bottom channels.\nAlternatively, a perfusion system connected to a syringe pump can be used instead of steps 21-23.\n24. Run the CoC device for the number of days required for the experiment while checking the system for leaks or disturbances daily. Ensure there is sufficient medium in the reservoir for at least 1 day.",
    "The system needs to be monitored daily to ensure that the CoC platform is running correctly, there are no leaks, and no visible contamination (this can be done by assessing the clarity of the medium). It is also possible to choose a pump setup that allows medium recirculation. Such systems can include a syringe pump that changes direction after pumping a few milliliters of medium or a valve system that can direct pumping from the collection tubes. The medium in the 15-ml reservoir lasts for approximately 3 days at a flow rate of 5 µl/min. Replenish the medium reservoir to avoid air bubbles. The collection tubes must be emptied when full to avoid overflow in the incubator.\n25. After incubation, stop the system and disassemble the connectors from the Bi/ond plate.\n26. Place the comPLATE on ice and incubate for 5-10 min to allow the thermoreversible Mebiol hydrogel to liquefy.\nIt can be helpful to disassemble the plate first and place it on ice before cleaning the remaining parts of the apparatus.\n27. While incubating the comPLATE on ice, prepare a 6-well plate with 3 ml breast medium per well.\nPrepare enough wells to fit one tissue slice per well.\n28. Disassemble the comPLATE and place tissue slices in the medium-filled wells.\nDo not forget to properly label the wells before transferring the tissue slices from the OoC device.\n29. Add EdU (3 µg/ml) to each well and incubate for 2 hr while placing the tissue on an orbital shaker at 60 rpm in a 37°C and 5% CO2 incubator.\nFor fixation instructions, continue to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-prot-0002].",
    "30. After the run, thoroughly clean all tubing, adaptors, connectors along, and flow sensors with water, biofilm-removing detergent, and isopropanol. The detergent should be diluted with ultra-pure MQ water (20% IO-Biofilm-Entferner and 80% MQ-water). The comPLATE is cleaned with isopropanol followed by ultra-pure MQ water.",
    "This protocol describes sample fixation and analysis. Tissue slices are fixed using the formalin-fixation paraffin embedding (FFPE) technique. Following this protocol allows the generation of 4-µm tissue sections that can be used for immunostaining or immunohistochemistry. Analyses described in this protocol allow assessment of tissue proliferation (EdU), apoptosis (TUNEL), DNA damage induction (53BP1), and histological tumor architecture (H&E) (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/81f9b92c-eb54-4818-b9d2-111e4f640ec7/cpz1693-fig-0003-m.jpg</p>\nFigure 3\nSchematic representation of the steps involved in tissue slice processing. Tissue slices are fixed in formalin for 1-3 days. Next, the sample is transferred to cassettes and placed in ethanol (4°C). Samples can be kept in ethanol until the Histokinette processing is done with the tissue processor. The tissue slices are then embedded in paraffin in a block mold. Paraffin blocks can be sliced using a microtome to generate 4-μm slices. Samples prepared by this method are suitable for immunohistochemistry assays.\nMaterials\nFormalin\nEthanol\nXylene\nTarget Retrieval Solution (Dako, cat. no. S1699)\n0.1% Tween-20/2% BSA (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-rec-0003])\nClick-iT cocktail (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-rec-0002])\n0.1% Tween-20 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-rec-0004])\nTUNEL kit (Roche Diagnostics, cat. no. 11684795910)\nVectashield with DAPI (Vector Laboratories, cat. no. H-1200)\n               \nAlternatively, Vectashield without DAPI (Vector Laboratories, cat. no. H-1000) can be used with a separate DAPI incubation (Sigma Aldrich, cat. no. 10236276001). Prepare a 1 mg/ml stock in MQ water and dilute to 1 µg/ml in PBS.\n53BP1 primary antibody (Novus Biologicals, cat. no. NB100-305)\nAlexa-Fluor-488 goat-anti-rabbit secondary antibody (ThermoFisher Scientific)\n15-ml Falcon tube\nEmbedding Cassettes (Simport Scientific, cat. no. M490-4)\nBiopsy foam pads (Simport Scientific, cat. no. M476-1)\nBiopsy paper (Imeb, cat. no. BP-P)\nEFTP Fast Tissue Processor (Adamas Instrumenten)\nHM 335E Microtome (Microm International)\nSuperfrost Plus Adhesion Microscope Slides (VWR, cat. no. J1800AMNZ)\nMicrowave oven\nImmunofluorescence Microscope (e.g., Automated Upright Microscope Leica DM4000 B)\nImmedge Hydrophobic Barrier Pen (Vector Laboratories, cat. no. H-4000)",
    "StainTray System with Black Cover (Simport Scientific, cat. no. 87000-136)\n1. Place the tissue slice in a 15-ml Falcon tube filled with 10 ml formalin and incubate for 1-3 days at room temperature.\n2. Move the tissue slices to 70% ethanol while placing them into cassettes.\nConsidering the small size of the tissue, it is helpful to use two foam pads and biopsy paper while placing the tissue slices into cassettes.\n3. Handle the material with the tissue processor Histokinette and embed samples in paraffin.\nSamples fixed using this method can be stored at RT indefinitely.\n4. Prepare 4-µm tissue sections on microscope slides using a microtome.\n5. Proceed to an appropriate staining protocol.\nImmunostaining was performed with EdU/DAPI, TUNEL, 53BP1, and H&E. Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.693#cpz1693-prot-0002] describes the procedure for EdU/DAPI/53BP1 staining. The manufacturer provides instructions for TUNEL staining.\n6. Remove the paraffin from the slides by washing in xylene for 3 min. Repeat 3 times.\n7. Rehydrate the sample by washing the slides in an ethanol series, 1 min per wash: twice at 100%, twice at 95%, once at 80%, once at 70%, and once at 50%).\n8. Wash the samples twice in demineralized water for 5 min.\n9. Boil the samples in pre-heated antigen retrieval buffer for 15 min.\nThis step can be performed using a microwave. Pre-heat the antigen retrieval buffer during the second deionized water wash. Place samples in the pre-heated antigen retrieval buffer and microwave at 600 watts for 15 min.\n10. Let the samples cool to room temperature while keeping them in the antigen retrieval buffer for approximately 30 min.\n11. Perform a series of 5-min washes: twice in demineralized water, twice in PBS, and twice in 0.1% Tween-20.\n12. Mark tissue areas on the slide using the Immedge Hydrophobic Barrier pen.",
    "This step can be performed during the series of washes described in step 11. Take a single slide, carefully remove the remaining liquid from the slides, and mark a circle around the tissue using the hydrophobic pen. This will allow the liquid to stay within the circle while immunostaining. Place the demineralized water or PBS (depending on the washing steps for the remaining slides) inside the marked circle. Repeat for all slides.\n13. Block using 0.1% Tween-20/2% BSA solution for 60 min.\n14. Add the Click-iT cocktail and incubate for 30 min.\nThe Click-iT cocktail contains fluorescent components; therefore, this and all subsequent steps should be performed in the dark. The Click-iT cocktail should be prepared fresh, approximately 15 min before the incubation.\n15. Wash with 0.1% Tween-20.\nIf no immunostaining is needed, steps 16-18 can be omitted. It is important to perform the wash in step 19 with PBS/0.1% Tween-20/2% BSA instead of PBS/0.1% Tween-20 as described in step 19.\n16. Add primary antibody diluted in 0.1% Tween-20/2% BSA and incubate for 90 min.\nIn this study, the 53BP1 antibody was diluted 1:1000 in 0.1% Tween-20/2%BSA. Depending on the treatment and intended outcome assessment, other antibodies can be used.\n17. Wash three times with 0.1% Tween-20/2% BSA for 5 min.\n18. Add a secondary antibody diluted in 0.1% Tween-20/2% BSA and incubate for 90 min.\nThe choice of secondary antibody depends on the primary antibody used in step 16. We used goat-anti-rabbit Alexa-Fluor-488 antibody diluted 1:1000 in 0.1% Tween-20/2%BSA.\n19. Wash three times with 0.1% Tween-20 for 5 min.\nWhen only EdU/DAPI staining is performed and steps 16-18 are omitted, samples should be washed with 0.1% Tween-20/2% BSA instead of 0.1% Tween-20.\n20. Wash with PBS.",
    "21. Embed the samples in Vectashield containing DAPI and seal the slides using nail polish.\nAlternatively, a separate incubation step can be performed to improve DAPI signal quality (see troubleshooting section). Incubate the tissue slice with DAPI (1 µg/ml) for 15 min and wash briefly with PBS.\n22. Image samples using a fluorescence microscope.\nThe choice of microscope depends on the goal of the imaging. Imaging techniques should be efficient to allow acquisition of multiple fields of view per sample.\n23. Analyze images using ImageJ software.\nThe goal is to calculate the fraction of proliferating cells from the total nuclear signal. 53BP1 staining can be performed to quantify cisplatin-induced DNA damage by calculating the number of 53BP1 foci per nucleus. Both analyses can be done automatically using a macro in ImageJ."
  ],
  "subjectAreas": [
    "Pharmacology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}