{
  "id": 2383,
  "origin_website": "Cell",
  "title": "CRISPR-Cas9 Ribonucleoprotein-Mediated Genomic Editing in Primary Innate Immune Cells",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nSplenic Natural Killer (NK) Cell Isolation\nTiming: 30 min\nBefore innate immune cell populations can be edited, they must first be isolated ex vivo.\nRemove spleen(s) from the mice and place in a 6-well plate containing 4 mL LHM on ice.\nDisrupt spleen within the well using the rough sides of two microscope slides.\nPush slides together to squeeze out contents of the spleen. Continue until the spleen is no longer visibly red in color.\nPipette liquid through 100 μm nitex mesh covering a 15-mL centrifuge tube on ice.\nCentrifuge at 450 × g for 3 min at 4°C.\nAspirate the fluid above the pellet.\nAdd 1 mL RoboSep buffer, pipette up and down to mix well for up to 1 x 108 nucleated cells (~1 spleen).\nNote: No need to perform RBC lysis, as the isolation kit removes red blood cells\nLiver Group 1 ILC Isolation\nTiming: 2 h\nBefore innate immune cell populations can be edited, they must first be isolated ex vivo.\nTransfer liver tissue to dounce tissue homogenizer using forceps and add 5 mL of PBS. Dounce tissue slowly and firmly. Transfer homogenized liver into a 15 mL conical tube.\nPellet the homogenized liver by centrifugation at 450 × g for 3 min at 22°C and carefully decant supernatant slowly.\nResuspend homogenized liver in 5 mL of PBS and pellet the homogenized liver by centrifugation at 450 × g for 3 min at 22°C.\nResuspend pellet in 3 mL of liver-prep 40% Percoll and carefully overlay 3 mL of liver prep onto 60% Percoll using a 5 mL serological pipette to create a gradient.\nAllow gradients to settle for 10–15 min.\nCentrifuge samples at 800 × g without brake for 15 min at 22°C.",
    "Aspirate top layer of suspension, and pipet liver leukocytes at the interphase of the gradient into a new 15 mL conical capped with 100 μm nitex mesh to strain debris from cell suspension.\nWash cells with 8 mL PBS and then pellet cells by centrifugation at 800 × g for 5 min.\nResuspend liver leukocytes in 1 mL RoboSep buffer and transfer samples to a 5 mL FACS tube (up to 5 livers can be pooled into 1 mL for isolation).\nNote: Do not perform RBC lysis\nGroup 1 ILC Magnetic Purification\nTiming: 45 min\nThis protocol is adapted from the STEM CELL EasySep™ Mouse NK Cell Isolation Kit\nObtain 1 EasySep™ Mouse NK Cell Isolation Kit per 10 spleens to be isolated.\nUse 5 mL FACS tubes for samples of 1–2 mL and 14 mL round bottom tubes for samples of 2–5 mL.\nResuspend cell suspension using P1000 pipette and add 50 μL isolation cocktail per 1 mL sample solution. (e.g., 250 μL for 5 mL sample containing 5 spleens).\nCap tube and invert to mix\nLet sit at 22°C for 10 min\nVortex RapidSpheres™.\nNote: Particles should appear evenly dispersed.\nAdd 100 μL RapidSpheres™ per 1 mL sample solution.\nCap tube and invert to mix.\nLet sit at 22°C for 5 min.\nInvert every 90 s to keep RapidSpheres™ in solution.\nAdd RoboSep buffer to top up sample to the indicated volume (up to 2.5 mL for 5 mL tube and up to 10 mL for 14 mL tube)\nMix by gently pipetting up and down 2 to 3 times\nPlace the tube (without lid) into the EasyEights™ EasySep™ Magnet and incubate for 5 min",
    "Carefully pipette using P1000 for 5 mL tubes or 10 mL serological (do not pour) the enriched cell suspension into a new 15 mL conical tube.\nNote: Do not repeat isolation protocol for increased cell number, this results in much lower overall purity\nThis tube contains purified Group 1 ILCs. Save 1% of your total volume and check the purity by flow cytometry. Cells should be 85%–90% NK1.1 + at this point. See Figure 1[href=https://www.wicell.org#fig1]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/187-Fig1.jpg\nFigure 1. Analysis of Isolated NK Cell and BM-cDC1 Phenotypes\n(A) Representative gating strategy for the identification of purified splenic NK cells.\n(B) Representative gating strategy and phenotypic analysis of BM-cDC1.\nGroup 1 ILC Activation\nTiming: 24 h\nPellet cells by centrifugation at 450 × g for 5 min.\nResuspend in 1 mL pre-warmed CR-10 media containing 50 ng/mL recombinant murine IL-15 using P1000 pipette\nAdd appropriate volume of CR-10 + IL-15 according to Table 1[href=https://www.wicell.org#tbl1]\ntable:files/protocols_protocol_187_8.csv\nCulture cells for 16–24 h in TC treated plates according to Table 1[href=https://www.wicell.org#tbl1].\nProceed to step 36, cRNP Treatment and Electroporation of 24-h-activated Liver Group 1 ILCs\nBone-Marrow-Derived cDC1 (BM-cDC1) and Macrophage (BMDM) Production\nTiming: 3 days for BMDM or 9 days for BMDC1\nDay 0: Harvest Bone Marrow\nSacrifice mouse and proceed to isolate tibia, fibula, femur\nCut at the ankle joint and at the hip and then place legs into 6 cm petri dish on ice until ready to remove muscle\nClean bones prior to crushing\nScrape muscle and fat off of leg bones, holding with forceps and scraping with scissors\nPlace cleaned bones in 5 mL LHM in 15 mL conical on ice until all bones are cleaned\nProcess Bone Marrow to single cell suspension\nWash bones with 5 mL 70% Ethanol (1×) and 5 mL LHM (2×).",
    "Pour into mortar and crush with pestle until bones are white.\nAspirate LHM-bone marrow mixture and pass through 100 μm nitex mesh into new 15 mL conical.\nAdd another 5 mL LHM and crush bones again, filtering through 100 μm nitex mesh into the same 15 mL conical as before\nCentrifuge bone marrow mixture at 450 × g for 3 min at 4°C\nResuspend pellet in 1 mL LHM and add 1 mL ACK lysis buffer. Lyse on ice for 2.5 min.\nCentrifuge mixture at 450 × g for 3 min at 4°C\nResuspend pellet in 10 mL DC or Macrophage media depending on the target cell type\nPlate bone marrow suspension\nNote: If making BMDC1, add cytokines to DC media:\nFinal concentration 200 ng/mL FLT3-L\nFinal concentration 5 ng/mL GM-CSF\nNote: Macrophage media already contains the necessary cytokines\nAdd 5 mL DC or Macrophage media to two 10 cm non-TC-treated dishes\nAdd 5 mL resuspended bone marrow mixture to each, making a total of 10 mL in each dish\nDay 3: Macrophage precursors are ready for RNP treatment.\nDay 5: For BMDC1 only: Add 5 mL DC media (no cytokines necessary) to each dish.\nDay 9: For BMDC1 only: Conventional dendritic cell precursors (cDCP) are ready for RNP treatment.\nCritical: For either BMDC1 or BMDM production, bone marrow single cell suspensions should spend minimal time in ACK lysis buffer. Quenching with excess LHM will help to minimize cell death, but removal right after centrifugation works fine\ncRNP Treatment and Electroporation of Bone-Marrow-Derived cDCP, Macrophages, and 24-h-Activated Group 1 ILCs\nTiming: 2–4 h\nThis step outlines the cRNP editing of D9 cDCP, D3 BMDMs, and 24-h-activated Group 1 ILCs\nMake the volume of media and cytokines required:\n2.5 mL DC media is needed for each guide to be tested.",
    "3.5 mL Macrophage media is needed for each guide to be tested.\n2 mL NK media is needed for each guide to be tested.\nPlace 1 mL warmed media into a 1.5 mL tube for each guide.\nThaw sgRNA and resuspend each in 15 μL TE Buffer (Provided by SYNTHEGO).\nMake sgRNA and Cas9 Master mixes.\n40 pmol Cas9 MM for each condition.\n1 μL of 40 pmol/μL Cas9.\n5 μL ddH2O per reaction.\nTotal of 6 μL per sample.\nFor myeloid cell types: 120 pmol sgRNA MM for each condition\n1.2 μL Guide.\n4.8 μL ddH2O per reaction.\nTotal of 6 μL per sample.\nFor lymphoid cell types: 120 pmol sgRNA MM for each condition\n1.2 μL Guide.\n0.9 μL IDT enhancer.\n3.9 μL ddH2O per reaction.\nTotal of 6 μL per sample.\nPipette 6 μL Cas9 master mix to tube containing 6 μL guide master mix to create RNP complex\nNote: you can create a large mastermix of Cas9 to use for each individual guide\nAdd Cas9 master mix to sgRNA master mix 1:1 to minimize precipitation\nIncubate for 10–15 min at 22°C.\nNote: RNP complex is stable for up to 1 h at RT\nAdd Cas9 master mix to sgRNA master mix 1:1 to minimize precipitation\nDuring complexing step, harvest and count viable cells\nHarvesting cDCP is done using a serological pipette to remove the non-adherent cells.\nHarvesting BMDM requires a cell scraper to remove the adherent precursors from the dish.\nGroup 1 ILCs can be harvested using a p1000 pipette.\nPurity should be > 95% NK1.1+ cells at this point\nSpin down cells at 450 × g for 3 min at 22°C and resuspend in T Buffer\nMyeloid cells: 1 x 106 cells/100 μL in T Buffer\nLymphoid cells: 5 x 105 cells/100 μL T Buffer",
    "Add 100 μL cell suspension in T Buffer to 1.5 mL tubes containing complexed cRNP mixes\nNote: If bubbles keep occurring using neon pipette, change total volume to 100 μL cell suspension in T Buffer\nDraw up mixture into Neon tip and electroporate (see Methods Video S1[href=https://www.wicell.org#mmc1])\n1,900 V 1 × 20 ms\nAfter electroporation, immediately place cells into filled 1.5 mL tubes and invert slowly to dilute out T Buffer\nOnce all samples have been electroporated, place 1.5 mL tubes into rack and place in 37°C incubator for 90 min\nRack can be placed on its side to prevent T buffer and cells from concentrating at bottom of tube\nNote: If using cells in vivo, rest cells for 10–15 min in 37°C incubator then proceed to remove T buffer via centrifugation followed by resuspension in PBS for injection\nWhile samples are incubating, fill non-TC-treated plates with respective media\ncDCP will be placed into a 24-well plate with 1.5 mL DC media and cytokines.\nBMDM will be placed into a 12-well plate with 2.5 mL Macrophage media.\nGroup 1 ILCs will be placed into a 48-well plate with 1 mL NK media.\nSpin down sample tubes at 450 × g for 3 min at 22°C and aspirate supernatant.\nResuspend cell pellets and place into plates.\nWait until cells are mature before isolating genomic DNA or assessing knockout via flow cytometry.\ncDCP will have matured by D15 (For phenotypic analysis, see Figure 1[href=https://www.wicell.org#fig1]B).\nBMDM will have matured by D7.\nGroup1 ILCs will be ready after 3–4 days in culture.\nCritical: Cells should spend minimal time in T Buffer as it is toxic and will reduce viability.\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. Electroporation of Innate Leukocytes with cRNP Complexes, Related to Step 46",
    ". Ensuring quick and precise aspiration, electroporation, and ejection of cells will maximize viability.\nAnalysis of Editing Efficiency via Flow Cytometry\nTiming: 1–3 h\nOnce electroporation is complete and innate leukocytes have been cultured for the appropriate amount of time, they can be analyzed by flow cytometry and/or by Sanger sequencing. Representative results for flow cytometry are shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/187-Fig2.jpg\nFigure 2. Flow Cytometry Analysis of cRNP-Edited Innate Leukocytes\n(A and B) 1 × 106 cDC1 or macrophages were electroporated at 1,900 V with 1× 20 ms pulse in the presence of Itgax (CD11c) or Itgam (CD11b) cRNP complex, respectively.\n(A) CD11c expression in BM-cDC1 6 days after electroporation compared to controls electroporated in the presence of Cas9 protein alone.\n(B) CD11b expression in BMDM 4 days after electroporation compared to controls electroporated in the presence of Cas9 protein alone.\n(C and D) Group 1 ILCs were electroporated at 1,900 V with 1× 20 ms pulse in the presence of Klrb1c (NK1.1) cRNP complex.\n(C) NK1.1 expression 3 days after electroporation of 5 × 105 rmIL-15 pre-activated purified splenic NK cells compared to controls electroporated in the presence of Cas9 protein alone.\n(D) NK1.1 expression 3 days after electroporation of 2.5 × 105 rmIL-15 pre-activated purified liver ILC1 (TCRβ−CD3ϵ−NK1.1+CD49b−CD200r+) compared to controls electroporated in the presence of Cas9 protein alone. Data are representative of 3 independent experiments of 3 mice per group.\nPrepare fluorophore-conjugated antibody cocktail for staining in 1× PBS.\nHarvest innate leukocytes from plating conditions and transfer to 96-well v-bottom plate.\nCentrifuge plate at 450 × g for 3 min at 4°C.\nFlick off supernatant and proceed with surface staining for 30 min at 4°C.",
    "Add 200 μL 1× PBS to wash excess antibody cocktail and then centrifuge plate at 450 × g for 3 min at 4°C.\nResuspend pellet in desired volume of 1× PBS and record data.\nData are analyzed using FlowJo (TreeStar).\nAnalysis of Editing Efficiency via Sanger Sequencing\nTiming: 2–3 days\nOnce electroporation is complete and innate leukocytes have been cultured for the appropriate amount of time, they can be analyzed by flow cytometry and/or by Sanger sequencing.\nHarvest innate leukocytes from plating conditions and proceed with DNA isolation using the DNeasy Blood and Tissue kit (Qiagen).\nAfter DNA is eluted, check purity/concentration using the NanoDrop OneC Microvolume UV-Vis Spectrophotometer (Thermo Scientific).\nDilute genomic DNA to 50 ng/μL and then proceed with PCR amplification of cRNP-targeted genomic regions of approximately 500–1,000 base pairs.\nPCR conditions will be specific for each primer pair.\nRemember to include non-edited genomic DNA as to use as a control for sequencing\nConfirm successful PCR reaction by visualizing results via Gel Electrophoresis before submitting for Sanger sequencing (GENEWIZ).\nOnce sequencing has been performed, retrieve .ab1 files and analyze InDel Percentage and Knockout score using ICE analysis (SYNTHEGO). Representative results for Sanger sequencing are shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/187-Fig3.jpg\nFigure 3. Analysis of Editing Efficiency of cRNP-Edited Innate Leukocytes Using Sanger Sequencing and ICE Analysis\n(A–C) SYNTHEGO ICE analysis on Sanger sequencing results from PCR region surrounding the Klrb1c locus 3 days after electroporation of 5 × 105 rmIL-15 pre-activated purified splenic NK cells.\n(A) Alignment plot showing control (orange) and edited (green) sequences.\n(B) Indel plot displaying the predicted range of insertions and deletions in the edited gene locus.\n(C) Traces from control and edited DNA files. The guide sequence is underlined in black, PAM sequence in red, and expected cut site in vertical dashed line."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Crispr",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}