{
  "id": 12821,
  "origin_website": "Jove",
  "title": "Novel Object Exploration as a Potential Assay for Higher Order Repetitive Behaviors in Mice",
  "procedures": [
    "The protocol described here was approved by the Institutional Animal Care and Use Committee at the University of Redlands. The C58, C57, and FVB mice used in these studies were bred at the University of Redlands vivarium from stock originally obtained from the Jackson Laboratory (Bar Harbor, ME).  Sentinels from this vivarium were screened every six months and found to be pathogen free.\n1. Equipment and Room Set Up\nNote: We used two different arenas for novel object testing: a clear plastic rectangular cage (45 cm x 24 cm x 20 cm) or an opaque circular cage with a base diameter of 41 cm; however, any cage may be used. Pearson et al. used a smaller rectangular cage (20 cm x 30 cm x 20 cm) in their assay. Details from this specific experimental design are included below, but given the novelty of this assay, there is no accepted standards within the field of behavioral phenotyping for any of the variables described. \nFill the testing arena with approximately ½ in of corn-cob bedding.\nSelect four different novel objects. Select four objects that are approximately the same size, constructed of high density plastic to facilitate cleaning and resist chewing and different from each other in shape and color. Importantly, ensure that test mice are not exposed to these objects until being run in the assay.\n\tNote: For example, a pink toy brick, a red monkey, a white tile with blue writing and a standard white die were used here.",
    "In the rectangular arena, place these objects approximately 3 cm from the corners. In the round arena, place the objects such that they are at equal distances from each other and approximately 10 cm from the sides. Record the placement of each object as a different number, 1-4 (Figure 1). Ensure that the objects are placed in a random or counterbalanced order throughout testing.\nPosition a camera directly above the testing arena to record the entire arena during the acclimation and test periods.\n\tNote: Having investigators in the same room with the mice can potentially influence activity levels and exploration during testing.\n2. Novel Object Exploration Test\nTest at the beginning of the light cycle in a room illuminated with fluorescent lighting at approximately 100 lux. Ensure that lighting is uniform across the testing arena to standardize appearance while video recording.\nPlace a notecard of known dimensions in the bottom of the testing arena and begin video recording.\nTransfer the test mouse into an empty testing arena for 10 min to serve as an acclimation period. Video record the acclimation period.\nAfter the acclimation period, leave the mouse in the arena, quickly add the four novel objects to the test arena and record the mouse behavior for an additional 10 min.\nOnce the full 20 min acclimation/testing period has elapsed, return the test mouse to its home cage and thoroughly clean and dry the novel objects and testing arena with unscented dish soap and water.\n3. Video Scoring\nComplete all behavior scoring using video to facilitate reliability.\n\tNote: The behavioral logging software Noldus The Observer was used to perform the steps22 as described here, but a specialized program is not necessary:",
    "Prior to scoring the first video, set up the project coding scheme in the behavioral logging software by creating a new project or by editing an existing, similar project.\n\t\t\nWithin the Project Setup box, set data acquisition to 'Offline Observation.' Within the Behavior Coding box, program \"Scrabble\", \"Digging\", \"Rearing\", \"Grooming\" and \"Sniff Object 1, 2, 3 and 4\" as 'State Events'. Program \"Jumping\" as a 'Point Event'. Note: Definitions for these behaviors are described in detail elsewhere11.\n\t\t\tNote: State Events have a start and stop time, whereas Point Events simply collect count data. The keystrokes for each discrete behavior are generated by the software and these corresponding keystrokes are programmed into a secondary keyboard (step 3.1.2).\nTo program the secondary keyboard, open the keyboard software, click on the appropriate secondary keyboard button displayed on the screen, type in the appropriate keystroke combination, and click OK. Once the secondary keyboard has been programmed, close the software as the program will run in the background of the computer.\nOnce the project and has been set up, use the behavioral logging software to score the number and duration of rears (defined as both front paws being placed on a wall of the arena), digs (defined as two front paws of the mouse burrowing into the bedding of the arena), self-grooms (defined as the mouse licking any region of their own body and/or the mouse touching any part of the face with their front paws), and jumps (defined as a mouse rearing and then jumping so that all four feet are off the ground simultaneously).\n\t\t\nTo score a video, go to File > Open Project and then Observe > Observation > New. The program prompts for a file name. Once named, select the appropriate video media file.",
    "Begin the scoring by clicking on the Begin Observation button.\n\t\t\tNote: When scoring mouse repetitive behavior, all State Events require two keystrokes, the first corresponding to the initiation of the behavior and the second corresponding to the end of the behavior. Point Events only require one keystroke.\nScore the number of times the mouse sniffed each object. Sniffs are defined as any time a mouse moves its nose within 0.5 cm of an object. Measure sniff duration using behavioral logging software in the same way that repetitive behavior durations were measured (step 3.1.2).\n\t\t\nEvery time a mouse sniffs an object, record the corresponding position number, which will lead to a string of numbers by the end of the 10 min testing period (e.g. 1243421…). Manually record these data.\n\t\t\tNote: To facilitate efficiency and consistency while scoring videos, the numbers always correspond to a given position, not object.\nIf a mouse sniffs an object, looks away, then sniffs the object again, count that number twice.\nOnce the full 10 min video has been scored, visualize the data by clicking on Analyze > Behavior Analysis > New. Once the data appear on the screen, export or copy and paste into a separate spreadsheet.\nRecord the total distance the mouse traveled within the arena during testing.\n\t\tNote: The video tracking software, calibrated to track the test mouse and record the total distance moved in centimeters, was used to perform this step. All videos scored by the video tracking software had a notecard of known dimensions placed in the arena at the start of the video.",
    "Use the notecard to calibrate each video within the software by setting a calibration line along each end of the notecard and inputting the appropriate length within the software's calibration screen. Once the lines are drawn, input the known length and width of the notecard that correspond to each line.\nWithin Arena Settings, select the entire arena.\n\t\t\tNote: Separate areas of the arena can be differentiated in the software if, for e.g., mouse movement along the walls vs. through the center was of interest.\nWithin Trial Control Settings, select a ten-minute duration. In Detection Settings, choose a dark object on a light background.\n\t\t\tNote: This would need to be changed if albino mice were being used or if the background was a darker shade.\nOnce the settings have been programmed, score the videos. Click Acquisition > Open Acquisition. In the Acquisition Control box, click New Trial and then Start Trial. After ten minutes has elapsed, the program stops and the data can be visualized.\nClick Analyze > Calculate Statistics. Once the data appear on the screen, export or copy and paste into a separate spreadsheet.\n4. Statistical Analyses, Sequencing\nWithin the string of numbers corresponding to object investigations generated by each mouse, identify the total number of all possible 3 digit combinations without repeat numbers (e.g. 121, 123, 124 but not 112 or 122).\n\tNote: A program written in Python programming language was used to identify the number of times each possible sequence appears in the string of numbers. It is not necessary to use an outside program, and this step could be completed many different ways (e.g. using a Find function in Microsoft Word or Excel).\nRecord the number of times each sequence occurs and identify the three most often repeated sequences for each mouse.",
    "Note: Individual sequences will vary by mouse and the actual sequence is of less interest than the number of times a sequence was repeated (i.e. adherence to a pattern is more important than the pattern itself).\nBecause the total number of sequences a mouse repeats will correlate positively to activity level, correct these values by dividing the quantity of most frequent patterns by the total number of patterns for each individual mouse. This will yield a sequence repeat index that is independent of overall activity.\nCompare the number of times each mouse repeats its most common sequences (corrected for activity level) between groups using an appropriate ANOVA, multiple comparison procedure (Dunnett's test, for e.g.) and post-hoc tests.\n5. Statistical Analyses, Object Preference\nUsing the same string of numbers generated above (step 3.1.3.1), identify the novel object preference of each mouse by counting the total number of times each object was investigated, or in other words, counting the total number of 1 sec, 2 sec, 3 sec, and 4 sec in the string of data. Correct for activity level and compare via ANOVA as described above (steps 4.3-4.4).\n\tNote: These methods published by our lab22 and described here are based heavily on Pearson et al.17\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}