{
  "id": 6024,
  "origin_website": "Bio",
  "title": "Measurement of Mesenchymal Stem Cells Attachment to Endothelial Cells",
  "procedures": [
    "Cell culture and single cell suspensions   hMSCs culture Human bone marrow-derived MSCs (hMSCs) were purchased from Lonza. Culture hMSCs in a growth medium consisting of DMEM, 10% FBS, and 1% penicillin and streptomycin for 72 h.    Culture of human umbilical vein endothelial cells (HUVECs) and human lung microvascular endothelial cells (HMVECs-L)   Culture HUVECs in endothelial growth medium (EGM)-2 plus 2% FBS and supplements for 72 h.    Culture HMVECs-L in EGMTM-2 MV BulletKitTM Medium for 72 h.  Note: EGMTM-2 MV BulletKitTM Medium includes endothelial basal medium-2 (EBM-2, Lonza) and the following growth supplements: human epidermal growth factor (hEGF); vascular endothelial growth factor (VEGF); R3-insulin-like growth factor-1 (R3-IGF-1); ascorbic acid; hydrocortisone; human fibroblast growth factor-Beta (hFGF-β); fetal bovine serum (FBS) and gentamicin/amphotericin-B (GA).      Optimization of blocking antibody concentrations and cell adhesion assay   Coat 24-well plates with 10 μg/ml fibronectin (diluting in sterile HBSS or PBS solutions) or 0.4-1 μg/ml vitronectin (diluting in sterile water) for 1 h at room temperature.   Remove fibronectin or vitronectin buffer without washing, air dry for 1-2 h in a hood.   Block the plates with 3% BSA in PBS for 1 h at 37 °C.    Gently wash the plates with PBS once, air dry in a hood.   Use 3% BSA in PBS alone-coated wells as a negative control.    Pre-label hMSCs and freshly isolated human peripheral blood leucocytes with fluorescent label DiI (Lipophilic fluorophore 1,1’-dioctadecyl-3,3,3’,3’-tetramethylindocarbocyanine perchlorate) (Wu et al., 2006).   For cells in suspension, wash with PBS and incubate with DiI at a concentration 2 μg/ml in DMEM basal medium (serum-free) for 20-30 min at 37 °C. Then incubate with fresh growth medium (DMEM supplemented with 10% FBS) for 30 min. After two washes with PBS (400 x g, 5 min), re-suspend the cells in fresh growth medium.",
    "For cells in adhesion, wash with PBS and incubate with DiI at a concentration of 2 μg/ml in DMEM basal medium (serum-free) for 20-30 min at 37 °C. Then replace the medium with fresh growth medium and incubate for 30 min. Trypsinize the cells with 0.25% trypsin-EDTA for 2 min and suspend cells in DMEM supplemented with 10% FBS.     Pre-incubate hMSCs in suspension with different concentrations of integrin β1, integrin α5 or integrin αVβ3 blocking to determine the lowest concentrations of the blocking antibodies that achieve maximum inhibition to hMSCs attachment (Wang et al., 2015).   Incubate hMSCs with anti-integrin β1 blocking mAb at concentrations of 0, 2, 4, 6, 8, 10 and 20 μg/ml in DMEM containing 2% FBS for 30 min at 37 °C.   Incubate hMSCs with anti-integrin α5 blocking mAb at concentrations of 0, 2.5, 5, 10, 20 and 40 μg/ml in DMEM containing 2% FBS for 30 min at 37 °C.   Incubate hMSCs with anti-integrins αVβ3 blocking mAb at concentrations of 0, 2.5, 5, 10 and 20 μg/ml for 30 min at 37 °C.   Incubate hMSCs with isotype IgG antibody as a control.   Wash once with PBS after incubations.    Seed 5 x 104 per well of hMSCs after blockade with integrin β1, integrin α5 or isotype control IgG, or 5 x 104 per well freshly isolated human peripheral blood leucocytes on fibronectin-coated plates.   Seed 5 x 104 hMSCs per well after blockade with integrin αVβ3 or isotype control IgG on vitronectin-coated plates.   Incubate the cells in DMEM plus 10% FBS for 30, 60, 90 and 120 min at 37 °C.   Collect non-adherent cells every 30 min (wash once with PBS).   Centrifuge non-adherent cells at 400 x g, 5 min.   Count the non-adherent cells with a hemocytometer.   Photograph the DiI-labelled hMSCs in attachment by fluorescence microscopy.",
    "The experiment must be performed in quadruplicate for each variable.       hMSCs attachment to endothelial cells   Culture HUVECs and HMVECs-L in 12-well plates with endothelial growth medium (EGM)-2 and EGMTM-2 MV BulletKitTM Medium, respectively, to confluence. The confluence density is approximate percentage of 80%-90%. Cells were treated with or without of 10 ng/ml TNF-α for 24 h immediately before the addition of hMSCs or leucocytes. TNF-α treatment, which is able to activate endothelial cells (Ko et al., 2009), increased the attachment of hMSCs and leucocytes to endothelial cells.    Isolate leucocytes from freshly human peripheral blood (Boyum, 1976; Chacko et al., 2013).   Prepare hMSCs: trypsinize hMSCs from 80%-90% confluent 10 cm plates.    Label hMSCs and leucocytes with fluorescent DiI.   Suspend DiI-labeled leucocytes at a density of 1 x 106 in M199 plus 0.1% BSA.   Suspend DiI-labeled hMSCs at a density of 0.5 x 106 in DMEM plus 0.1% BSA.   Find out the appropriate time-point to detect hMSCs attachment to endothelial cells.   Add DiI-labeled hMSCs to 80%-90% confluent monolayers of HUVECs and HMVECs-L in 12-well plates and incubate cells at 37 °C and 5% CO2.   Detect hMSCs attached to endothelial cells every 15 min for 60 min.   Incubation for 30 min is normally sufficient for strong adhesion of hMSCs to endothelial cells.    Incubate hMSCs which have been treated with blocking antibodies against integrin β1 at 4 μg/ml, integrin α5 at 10 μg/ml, integrin αVβ3 at 5 μg/ml, or control IgG at 10 μg/ml for 30 min at 37 °C.   Wash samples once with PBS.   Re-suspend samples with fresh growth medium and incubate for 30 min at 37 °C.   Add cells to 80%-90% confluent monolayers of HUVECs or HMVECs-L in 12-well plates.   Incubate culture seeded with leucocytes for 1 h, and culture seeded with hMSCs for 30 min.",
    "Wash the cultures twice with HBSS to remove non-adherent cells.   Count the non-adherent cells with a hemocytometer.   Fix the adherent cells with 1% PFA.   Acquire images of adherent cells under a fluorescence microscope (200x), and 10 fields per well were imaged (Figure 1).    Count the number of cells per field. Six duplicate wells are used for each condition.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315003740_5934.jpg Figure 1. Adhesion of hMSCs to HMVEC-L. A. DiI-labeled single hMSCs derived from monolayers (2D) were pre-incubated with blocking antibodies against integrin α5, integrin β1, or integrin αVβ3, seeded on HMVECs-L monolayers and incubated for 30 min. hMSCs and leucocytes pre-incubated with isotype IgG were used as controls. Scale bars = 250 µm. B. The non-adherent cells were removed and counted, and the adherent DiI-hMSCs were photographed. Six replicate wells were used for each condition, and the experiment was repeated three times, * P < 0.05; ** P < 0.01. Abbreviation: MSC, mesenchymal stem cells."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}