{
  "id": 1971,
  "origin_website": "Cell",
  "title": "Statistical machine learning for comparative protein dynamics with the DROIDS/maxDemon software pipeline",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGenerating MD simulations for statistical comparison in DROIDS\nTiming: many hrs/days depending upon sampling and size of GPU\nThis will lead you through the generation of molecular dynamics simulations for comparisons using the DROIDS GUI-based scientific pipeline.\nFrom the main menu for DROIDS (Figure 1[href=https://www.wicell.org#fig1]), please select one of several types of comparisons to run. If you intend to use maxDemon machine learning to detect functionally conserved regions of protein dynamics, then choose the third option.\nChoose the type of model comparison you are running (e.g., simple protein, protein-DNA, protein-ligand or protein-protein interaction. See Figure 1[href=https://www.wicell.org#fig1]). Be sure to also indicate whether your computer has one or two GPUs by highlighting the bar button on the GUI as shown below (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1453-Fig2.jpg\nFigure 2. GUI for setup and control of Amber18/20 molecular dynamics simulations in DROIDS\nHere the user indicates whether the computer they are using has one or two graphical processor units (GPU), selects the type of functional comparison, and then opens the GUI for molecular dynamics control working from the top to the bottom of the GUI as indicated in the protocol.\nA GUI for running and post processing the molecular dynamics (MD) simulations will open and you will proceed pushing the buttons from the top to the bottom and following any additional instructions that appear in the Linux terminal. The control menu proceeds from top to bottom and the user proceeds linearly down the GUI (Figure 2[href=https://www.wicell.org#fig2]).",
    "Note: We warn the potential user that appropriate quantitative and qualitative interpretations of the output should be based upon a good theoretical understanding of MD simulation and where it can go wrong. The biggest factors influencing the comparative outputs are the proper choice of modern force fields and the choice of an adequate sampling regime that will capture the scale of the physical phenomena one wants to observe. MD is notoriously slow as it is time stepped in femtoseconds. Most biological phenomena occur at nano or microsecond time scales. Therefore comparative protein dynamics should be applied to rapid phenomena that can be readily observed many times under nanosecond time scales. The comparison of atom fluctuation profiles of stable states are a good example of this, whereas comparison of longer term processes (e.g., involving protein folding of changes in conformational states) are not. A sampling regime of 100 production runs at 1 ns, with 10 ns of equilibration should be considered the bare minimum requirement for a statistically stable result. DROIDS should never be run only once, but several times to ensure that a comparison is stable and meaningful.\nThe tasks to perform on the GUI from top to bottom are listed below\n(TEXT ENTRY) Enter PDB file names, force field file names, number of MD samplings (recommend = 100), and number of protein chains in the structure.\n(CHECKBOXES) Choose method of solvation (i.e., implicit OR explicit (preferred)) and MD simulation engine (i.e., Amber (preferred) OR openMM).\nNote: Comparison of MD with implicit solvation can run quite a lot faster but may not be as accurate as comparisons based upon explicit solvation.\n(SLIDERS) Set the sliders for length of MD runs (heating, equilibration, and production samples).",
    "Note: If the user wants to use range settings for the length of MD heating, equilibration, or production that are not available on the GUI, these can be manually edited in two files that control all the Amber MD settings (MDr.ctl and MDq.ctl for the reference and query protein structures resp.)\n(BUTTON: ‘open GPU job surveillance’) - opens top and nvidia-smi to watch CPU/GPU activity.\n(BUTTON: ‘dry and reduce structure’) - runs pdb4amber to add hydrogens (i.e., reduce), remove crystallographic waters (i.e., dry), reformat and resave PDB files.\n(BUTTON: ‘make control files’) – makes .ctl files that contain user inputs from above and are read by subsequent scripts in the analysis pipeline.\n(BUTTON: ‘create sequence and structural alignment’) - opens both PDB models in UCSF Chimera, and Linux terminal instructions guide user through superpositioning of models (via MatchMaker under Tools drop down menu) followed by structural alignment (via Match->Align). Make sure to save this alignment file in Clustal format (e.g., my_align.aln). When Chimera is closed, the user is prompted for the name of the saved .aln file and this is copied, renamed, and stored by the DROIDS program for later use.\n(BUTTON: ‘prepare ligand force field modification’) If protein-ligand model type was chosen earlier, this runs antechamber and sqm programs to generate mol2 file and force field modifications (.frcmod) for the ligand via scaled quantum mechanical optimization (logged in sqm.out).",
    "(BUTTON: ‘generate topology and coordinate files’) - runs teLeAP program to build the topology (.prmtop) and input coordinate (.inpcrd) files needed to set up both protein systems implicitly solvated in vacuum and charge neutralized in explicitly solvated octahedral water boxes. A .bat file is opened for each simulation and can be edited to modify the simulation preparations (e.g., change water box size, change water model, add additional force fields, load additional ligands etc.). When completed the DROIDS code will look for the output files and check their sizes to see that tLeAP has run to completion properly.\nCritical: When done, the leap.log file and/or terminal outputs should be carefully read for any reported errors. Error at this stage will prevent MD simulations from launching.\n(BUTTON: ‘launch MD run’) launches the MD simulations and cycles through energy minimization, heating equilibration, and all MD production sampling runs. If the dual GPU option was chosen earlier, two new terminal windows will open and then close after simulations are completed. This process can take many hours or days to complete. Very large binary trajectory files (.nc) are created at this stage, often in the 10–100s GB size range. Please make sure there is enough space on the GPU. GPUs should be monitored on nvidia-smi to make sure that jobs queue properly (i.e., that only one pmemd0.cuda or pmemd1.cuda job runs on each card). If more than one job loads, close the terminals and use the pkill button right below to stop the GPUs. Then launch it again.\n(BUTTON: ‘create atom info files’) - creates atom information files using cpptraj.\n(BUTTON: ‘create atom fluctuation files’) - runs cpptraj on trajectory files to retrieve atom fluctuations and correlations.",
    "(BUTTON: ‘parse/prepare files for DROIDS’) - parses and analyzes these results for later analysis. Approximately 30 min. Also opens next GUI for statistical analyses to compare the sample sets of MD production runs.\n(BUTTON: ‘ exit DROIDS’) - optional button to exit DROIDS.\nConducting statistical comparison in DROIDS\nTiming: 5–10 min\nThis next GUI will produce output data files and R plots of results in a DROIDS output folder (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1453-Fig3.jpg\nFigure 3. GUI and output for statistical comparison of dynamic motion\nThis GUI produces R plot output for DROIDS analysis comparing the molecular dynamics of SARS-CoV-2 virus bound to human ACE2 receptor domain to that of unbound human ACE2 receptor domain (PDB 6M17).\nSelect alpha level for the tests and a method of correction for multiple tests.\nNote: This correction is necessary to control for the fact that a statistical hypothesis test is conducted for every amino acid site in the comparison. Benjamini-Hochberg is recommended. If models have more than one protein chain, options to analyze and plot each single chain will also appear.\nButton creates a control file to store this information (DROIDS.ctl).\nButton runs site-wise statistical tests, and R plot (Figure 3[href=https://www.wicell.org#fig3]) will appear to show positional atom fluctuations along protein sequence for both models, differences in atom fluctuation along the sequence (as dFLUX = signed symmetric Kullback-Leibler or KL divergence), and statistical significance of these dynamic differences along the sequence (as determined via 2 sample Kolmogorov-Smirnov or KS test). See Equation 3 in (Babbitt et al., 2020a[href=https://www.wicell.org#bib1]), Equation 4 in (Babbitt et al., 2020b[href=https://www.wicell.org#bib2]), and Figure 2[href=https://www.wicell.org#fig2] from (Rynkiewicz et al., 2021[href=https://www.wicell.org#bib9])\nButton to open GUI for molecular visualization of these results.\nOptional button to exit DROIDS.\nColor mapping images and movies of comparative dynamics in DROIDS\nTiming: 10–30 min",
    "This GUI allows the positional information regarding the statistical comparison of the protein dynamics to be color-mapped to a reference PDB file and to short movies of the dynamics (Figure 4[href=https://www.wicell.org#fig4]). We recommend you start with KL divergence since averaging can reduce the information in the color mapping. See our software note for details regarding the different metric. Please refer to (Babbitt et al., 2018[href=https://www.wicell.org#bib3], 2020a[href=https://www.wicell.org#bib1], 2020b[href=https://www.wicell.org#bib2]; Rynkiewicz et al., 2021[href=https://www.wicell.org#bib9])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1453-Fig4.jpg\nFigure 4. GUI and output for visualization of divergence in dynamics\nThis GUI produces color mapping for DROIDS analysis showing dampened atom fluctuation as negative KL divergence (blue) caused by binding of SARS-CoV-2 (aqua ribbon) to human ACE2 receptor domain (PDB 6M17). Three levels of decreasing transparency are shown (A = 80%, B = 50% and C = 0%). The last image also shows UCSF ChimeraX full ambient occlusion lighting. Supplemental movie files (Videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2] show spin movie of KL divergence and associated p-values for the site-wise KS test. Red = significant dampening of motion, black = non-significant change in dynamics).\n(CHECKBOXES) Select protein visual model, color scheme, statistical attributes, and color scaling mode for visualization of DROIDS results in UCSF ChimeraX window.\n(BUTTON: ‘edit image control file’) - edits DROIDS.ctl with the options selected here.\n(BUTTON: ‘make attribute files for Chimera’) - creates ‘color by attribute’ files in the proper format needed by UCSF ChimeraX.\n(BUTTON: ‘display statistics on PDB reference structure’) - opens selected color mappings in UCSF ChimeraX display (Figure 4[href=https://www.wicell.org#fig4]).",
    "Note: Images and spin movies of color-mappings can be generated and saved from the UCSF ChimeraX GUI. This GUI can be closed and reopened repeatedly to generate visuals of all the various options (avg. difference, p values, KL divergence etc.). Video S1[href=https://www.wicell.org#mmc1] shows a spin representation of the SARS-CoV-2 viral binding signature on ACE2 in terms of KL divergence. Degree of blue indicates degree of atom fluctuation dampening under binding. Video S2[href=https://www.wicell.org#mmc2] shows significant p-values for changes in dynamics under viral binding to ACE2 in red. Black is not significant.\n(BUTTON: ‘render movies in UCSF Chimera file’) - allows color-mapped movies of the dynamics to be rendered in UCSF Chimera.\nNote: If surface models are used, the rendering process is significantly slowed.\n(BUTTON: ‘play movies in DROIDS viewer’) - After rendering, movies are played back from ‘Movie Player Options’ using customized gstreamer movie players.\nAt this point the DROIDS analyses are complete. If the maxDemon machine learning option was chosen on the main GUI at the beginning of the pipeline, two more buttons remain. The first will parse the molecular dynamics data into many time slices for machine learning, while the second will open the maxDemon GUI (see next section).\n(BUTTON: ‘exit DROIDS’) - Optional button to exit DROIDS.\n    Your browser does not support HTML5 video.\n  \nVideo S1. Spin video showing color mapping for KL divergence from DROIDS analysis (step 11)\n    Your browser does not support HTML5 video.\n  \nVideo S2. Spin video showing color mapping for p values from DROIDS analysis (step 12)\nDetecting functionally conserved protein binding dynamics and comparing genetic/drug class variant impacts on conserved dynamics in maxDemon\nTiming: 1–2 days",
    "At this stage, users can further utilize the multi-agent machine learner (maxDemon) to parse and display the regions with evolutionary conserved dynamics (i.e., nanomachine-like motions) involved in the functional binding interactions from the random thermal noise that is also present in the MD simulations. The analyses can also compare genetic or drug class variant impacts on the conserved dynamics (optional), and map sites with coordinated motions within the conserved dynamics.\nCheck or uncheck the settings for this analysis (Figure 5[href=https://www.wicell.org#fig5]).\nSelect up to 7 machine learning methods to be used to classify bound vs. unbound protein dynamics.\nNote: The machine learner(s) are trained upon the simulations generated earlier using DROIDS and then deployed upon new simulations generated at this stage.\nNote: Support vector machines can be very slow on large sampled MD systems. An option to subsample the data to speed the analysis is given at the Linux terminal if the SVM option is chosen. A kernel method (e.g., linear, polynomial or radial basis function) must also be selected at the terminal if the SVM option is chosen.\nA multivariate feature vector for machine learning is now created comprised of small time slices of atom fluctuations at a given amino acid site/position as well as fluctuations at nearby sites 1,3, and 9 positions downstream on the protein backbone. One can also select to analyze correlations of the motion at these downstream sites to the given amino acid site/position. See Equation 4 from (Babbitt et al., 2020a[href=https://www.wicell.org#bib1]) and Figure 3[href=https://www.wicell.org#fig3] from (Rynkiewicz et al., 2021[href=https://www.wicell.org#bib9]).\nPush the buttons on the maxDemon GUI in the order in which they are numbered (Figure 5[href=https://www.wicell.org#fig5]).\n(1) This button opens a GUI to set up and run MD simulations upon which the machine learning will be deployed.",
    "Note: It is run similarly to the GUI for MD runs used earlier in DROIDS. At minimum 3 new simulations are run on the functionally bound state of the protein. Two of these are just copies of the functionally bound reference PDB file. The third must be an evolutionary ortholog of the protein in its functionally bound state. This ortholog can be found at Protein Data Bank OR it can be modeled from the reference PDB in UCSF Chimera using the swapaa function. Initially, a series of text files are opened in which the user will list the names of the PDB files to be put to MD simulation and machine learning analysis (i.e., the two validation runs, the ortholog run, then all runs for the genetic/drug class variants to be compared). If protein-ligand option is used, two text files listing the unbound protein structures and their respective ligands will be prompted. The length of the MD runs can be set to 1×, 3×, 5× or 10× the length of a single production run in the DROIDS training set. Buttons on this GUI make control files (.ctl) for this part of the analysis, dry and reduce PDB files, create additional alignments if needed (optional), create force field modifications for additional ligands (if needed), create topology (.prmtop) and input coordinate files (.inpcrd) files for the MD simulation, launch the MD simulations, create atom information files, calculate atom fluctuation and atom correlations in cppraj, and parse the results for later steps.\n(2) Button parses and processes training/testing data sets for R implementation.",
    "(3) Button runs machine learning in R over each consecutive method chosen and each site on the protein. A multi-agent classifier is constructed using K nearest neighbors, naïve Bayes, linear and quadratic discriminant function analyses, support vector machine, random forest, and adaptive gradient boosting (AdaBoost).\n(4) Button uses canonical correlation analysis between the machine learning profiles in the two validation MD runs and the ortholog MD run to detect protein regions with significantly similar functional/evolutionary conserved dynamics (i.e., not due to thermal noise). See Equation 6 from (Babbitt et al., 2020a[href=https://www.wicell.org#bib1]), Equations 3 and 4 from (Babbitt et al., 2020b[href=https://www.wicell.org#bib2]) and Figure 3[href=https://www.wicell.org#fig3] from (Rynkiewicz et al., 2021[href=https://www.wicell.org#bib9]). These conserved regions are color mapped in the R plots and PDB structure in UCSF ChimeraX using dark gray (Figure 6[href=https://www.wicell.org#fig6], Video S3[href=https://www.wicell.org#mmc3]). This analysis typically indicates regions of the protein with important functional motion that may be conserved over deep evolutionary time scales. A relative entropy calculation is used to quantify the impacts of the genetic or drug class variants on the conserved dynamics identified by the learner(s) in the comparative MD simulations. See Equation 7 from (Babbitt et al., 2020a[href=https://www.wicell.org#bib1]), Equation 5 from (Babbitt et al., 2020b[href=https://www.wicell.org#bib2]), and Equation 3 and Figure 4[href=https://www.wicell.org#fig4]A from (Rynkiewicz et al., 2021[href=https://www.wicell.org#bib9])\n(5) Sites of coordinated machine learning classifications over time are determined via a calculation of mutual information and displayed in a heat map (if Wes Anderson color palette is chosen at the Linux terminal, then blue = no coordination, yellow= moderate coordination, and red= high coordination). See Figure 7[href=https://www.wicell.org#fig7]. Also see Equation 4 and Figure 4[href=https://www.wicell.org#fig4] (Rynkiewicz et al., 2021[href=https://www.wicell.org#bib9]) for more mathematical details.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1453-Fig5.jpg\nFigure 5. GUI for maxDemon machine learning identification and visualization of conserved dynamics",
    "Here, the user selects the machine learning methods to be stacked into the multi-agent learner. Then the user follows the numbering of the buttons on the GUI as outlined in the protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1453-Fig6.jpg\nFigure 6. Output for machine learning identification and visualization of conserved dynamics\n(A) The maxDemon analysis output is shown in (A) and comprises identification of functionally/evolutionary conserved dynamic regions (dark gray), the local and total conserved region impacts of genetic variants representing human, ape and various bat species orthologs of ACE2 protein. Error bars on the conserved region impacts represent 95% confidence intervals for 100 bootstrap replications.\n(B) Color mapping for maxDemon analysis showing conserved dynamics (dark grey) caused by binding of SARS-CoV-2 (aqua ribbon) to Rhinolophus bat ACE2 receptor domain (PDB 7c8j).\n(C) A maximum likelihood tree representing the bat orthologs generated in MEGAX (Kumar et al., 2016[href=https://www.wicell.org#bib5]). Video S3[href=https://www.wicell.org#mmc3] shows spin representation of image in (B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1453-Fig7.jpg\nFigure 7. Output for visualization of coordinated site dynamics\nA heatmap showing levels of coordinated dynamics determined by mutual information in learning classifications over time in the validation MD run. Blue denotes no coordination, yellow denotes moderate coordination and red denotes high coordination.\n    Your browser does not support HTML5 video.\n  \nVideo S3. Spin video showing color mapping for conserved dynamics regions from DROIDS/maxDemon analysis (steps 13 and 14)"
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Systems Biology",
    "Computer Sciences",
    "Structural Biology",
    "Evolutionary Biology",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}