{
  "id": 3492,
  "origin_website": "Cell",
  "title": "Protocol for potential energy-based bifurcation analysis, parameter searching, and phase diagram analysis of noncanonical bistable switches",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDownload codes\nTiming: 10 min\n      Download the zip file that contains the MATLAB codes and relevant model\n      parameters from the GitHub link (https://github.com/dbarikUoH/Protocol_NonCanonicalSwitch[href=https://github.com/dbarikUoH/Protocol_NonCanonicalSwitch]) mentioned in the ‘key resources table[href=https://www.wicell.org#key-resources-table]’. Extract the folders from the zip file by unzipping the file. Note that\n      the directories ‘Bifurcation1p’, ‘ParameterSearch’ and ‘PhaseDia’ contain\n      MATLAB codes to perform 1-p bifurcation analysis, parameter searching for\n      bistability and phase diagram calculation, respectively.\n    \nPseudo-potential energy based 1-p bifurcation analysis\nTiming: 10–15 min\n    \n      This section lists the steps to carry out 1-p bifurcation analysis using\n      the pseudo-potential energy of the dynamical system corresponding to the\n      positive feedback regulated network motifs. We describe here the details\n      of pseudo-potential energy based 1-p bifurcation analysis of ppMISA\n      network under OR logic gate (Figure 1[href=https://www.wicell.org#fig1]A).1[href=https://www.wicell.org#bib1]\n      The MATLAB code generates 1-p bifurcation diagram by monitoring the\n      extrema in the effective pseudo-potential energy of the dynamical system.\n      Further, the code identifies the bistable switch provided it falls under\n      the group of 189 bistable switches listed in the\n      Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc1.xlsx].\n    \nNote: The group of 189 switches contains\n      both canonical and noncanonical switches. It includes 84 reversible and\n      105 consequential irreversible switches. The irreversible switches include\n      irreversible at the lowest (42), highest (42) and both at the lowest and\n      highest (21) values of the bifurcation parameter. These switches originate\n      from the fusion of canonical bistable and noncanonical isola, mushroom,\n      inverted isola and inverted mushroom switches (Figure 1[href=https://www.wicell.org#fig1]) in different numbers and orientations.\n    \nThe steps of the bifurcation analysis are listed below.\n        Browse to the ‘Bifurcation1p’ directory.\n        \n            Run the code by typing ‘STAR_1p_bifurcation_ppMISA_OR’ in the MATLAB\n            command window. The steps bifurcation calculation are mentioned\n            next.\n          \nNote: The code generates the bifurcation\n      diagram − a plot of the steady state value of the dynamical variable, B,",
    "as a function of the bifurcation parameter, S.\n    \n        At every S, calculate the effective pseudo-potential energy (V(S,B)) of\n        the dynamical system by integrating the right hand side (pseudo force\n        term) of the one dimensional representation of the dynamical system (Figure 1[href=https://www.wicell.org#fig1]B).\n      \nNote: The statements below calculate the\n      force and pseudo potential energy of the dynamical system, respectively.\n    \n[f]=BS_model_bifurcation(S0,b1,param); pot=dx2∗cumtrapz(-f);\nCritical: The pseudo force term in the\n      one-dimensional representation of the dynamical system is defined in the\n      function file BS_model_bifurcation.m. The theoretical method of\n      pseudo-potential energy based bifurcation can be found in Das et al.1[href=https://www.wicell.org#bib1]\n      and Dey et al.2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3]\n        Determine the locations of extrema in the potential energy using the\n        findpeaks function in MATLAB.\n        \n            Store the locations of the minima (stable steady states) and maxima\n            (unstable steady states) in separate arrays.\n          \n            Repeat the above steps for a range of S (\n0\n≤\nS\n≤\n1000\n ) to construct the 1-p bifurcation plot of the bistable switch.\n          \n        Using the statement below, determine the number of jumps in the stable\n        branch at the bifurcation points and their locations required for the\n        identification of switches.\n      \n[sum_diffss2,bfrSN,jmpN,jmpLocSN]=BS_jumpSS_SN(peaks_ss,vss,vuss);\nNote: Identification of the bistable\n      switch, from the list of 189 switches is based the number of bifurcation\n      points, number of jumps in the stable branch at the bifurcation points and\n      the location of these jumps (see Figure 1[href=https://www.wicell.org#fig1]F and\n      Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc1.xlsx]). See Das et al.1[href=https://www.wicell.org#bib1] for the details of the\n      method.\n    \n        Use the function BS_switchType_189BS.m to identify the type of the\n        bistable switch making use of jump pattern calculated in the previous\n        step.\n      \nBS_switchType_189BS(peaks_ss,sum_diffss2,jmpN,jmpLocSN)\nNote: In the MATLAB command window, the\n      code prints the abbreviated name of the identified switch. Identification\n      of a bistable switch is an add-on feature and is not mandatory for\n      bifurcation analysis. Therefore, this part of the calculation can be",
    "omitted by commenting the relevant line (line # 124).\n    \n        Use the statement below to plot the 1-p bifurcation diagram (Figure 1[href=https://www.wicell.org#fig1]C).\n      \nplot_bifurcation(bfrSN,vss,vuss)\nNote: In the bifurcation plot, the arrays\n      corresponding to the stable and unstable steady states are plotted as a\n      function of S. The maximum value (sig_max) and the step length (dsig) of\n      the bifurcation parameter are chosen as 1000 and 0.1, respectively. The\n      step length can be modified to alter the resolution of the bifurcation\n      diagram and if required the sig_max can be increased to avoid truncation\n      of the bifurcation diagram at the largest value of S. The upper limit (xE)\n      in the numerical integration of force is chosen as 10000 and it can be\n      increased to avoid the truncation of the bifurcation diagram in the steady\n      state axis (B-axis in the bifurcation plot).\n    \n        Uncomment the line # 140–148 to overlay the bifurcation diagram on top\n        of the contours of the pseudo-potential energy (Figure 1[href=https://www.wicell.org#fig1]D).\n      \nNote: The contour plot takes a longer time\n      to plot in MATLAB. By default, the code loads the parameter for isola\n      bistability and generates an isola bistable switch (Figure 1[href=https://www.wicell.org#fig1]C). The parameter sets for inverted isola, mushroom and inverted mushroom\n      are also provided and can be loaded to obtain these switches by\n      uncommenting the line # 36, 37 and 38, respectively, for inverted isola,\n      mushroom and inverted mushroom switches (Figure 1[href=https://www.wicell.org#fig1]E).\n    \n      Parameter searching for canonical and noncanonical bistable switches using\n      high-throughput bifurcation analysis\n    \nTiming: 18–20 h\n      This section details the steps to run potential energy based\n      high-throughput bifurcation analysis to determine the ability of a network\n      to generate reversible canonical and noncanonical bistable switches and to\n      search for parameter sets for these switches with a maximum of three\n      bistable regions (84 in total). By carrying out 1-p bifurcation analysis",
    "for a randomly sampled parameter set, we determine the occurrence\n      probability (percentage chance) and total counts of these switches for a\n      network. We segregate the parameter sets based on the type of switches\n      leading to switch specific parameter sets. In addition, we created a list\n      of 14 switches by grouping together topologically similar switches from\n      the 84 switches (see\n      Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc2.xlsx]). We determine the counts and occurrence probabilities of these 14\n      switches as done in Das et al.1[href=https://www.wicell.org#bib1]\nNote: To improve computational efficiency,\n      we perform parameter search calculation in two steps. With a randomly\n      chosen parameter set, first we carry out a low-resolution bifurcation\n      analysis and if the set generates bistability then we perform a\n      high-resolution bifurcation calculation for accurate identification of the\n      bistable switch.\n    \nThe steps of the parameter search calculations are following:\n        Browse to the ‘ParameterSearch’ directory to locate the necessary MATLAB\n        files relevant to parameter search calculation.\n      \n        The first step in the searching is sampling of parameters randomly. Run\n        the ‘Thre_inwards_ppMISA_OR.m’ in MATLAB to generate the values of\n        threshold parameters of S, A and B genes in the ppMISA network. The\n        steps for generating threshold values are the following:\n        \n            Determine the threshold values of S, in regulating A and B genes,\n            from the unregulated steady state expression of S by choosing the\n            synthesis and degradation parameters of S from independent uniform\n            distributions of specific ranges.1[href=https://www.wicell.org#bib1]\n            Calculate the threshold values of A from the network segment\n            considering only the inward regulatory interactions of A (S –> A\n            |– B).\n          \n            Use similar method to obtain the threshold values of B (S –> B |–\n            A).\n          \nNote: The threshold parameters in the Hill\n      functions of the model equations are generated using half-function rule to\n      ensure that the sampled threshold parameters are not biased favoring\n      either activation or inhibition.4[href=https://www.wicell.org#bib4] The",
    "threshold values of these three regulators are stored in three separate\n      ‘.dat’ files and are used in the main code of the parameter search\n      calculation. All other parameters are sampled from independent uniform\n      distributions within the main code of the parameter searching.\n    \n        Run the ‘STAR_parSearch_189BS_ppMISA_OR.m’ (main code) from the current\n        folder to perform the parameter searching of canonical and noncanonical\n        bistable switches. The steps in the main code of the parameter searching\n        are mentioned next.\n      \n        Define the sample size of random parameter sampling (nr), initial values\n        of the counts of all bistable switches and arrays required to store the\n        segregated parameters.\n      \n        Load the values of the threshold parameters obtained from\n        half-functional rule calculations (Step 9).\n      \n        Sample all other parameters from independent uniform distributions with\n        defined ranges.1[href=https://www.wicell.org#bib1]\n        Specify the numerical parameters for the low- and high-resolution 1-p\n        bifurcation calculations next.\n      \n        With the randomly chosen parameter set, run the low-resolution\n        bifurcation calculation for the entire range of the bifurcation\n        parameter (\n0 ≤\nS ≤\n1000\n ) and the dynamical variable (\n0 ≤\nB ≤\n10000\n ) with larger step lengths of S and B.\n      \nNote: The step length of S (dsig1) and B\n      (dx1), respectively, are 0.5 and 8.\n    \n        Run the high-resolution bifurcation calculation, with much smaller step\n        lengths of S and B, provided the low-resolution run results in\n        reversible bistability with the sampled parameter set.\n        \nNote: Parameter sets leading to\n          monostability, irreversible bistability and higher order\n          multistability (e.g., tristability) are discarded. In the\n          high-resolution calculation, the step length of S is calculated based\n          on the locations of first and last bifurcation points obtained from\n          the low-resolution run.\n        \nCritical: During the\n          high-resolution bifurcation calculation, various measures are taken to\n          reduce computational cost.\n        \n            High-resolution bifurcation calculation is not carried out for the\n            entire range of the bifurcation parameter (\n0\n≤",
    "S\n≤\n1000\n ). Instead, the range is determined from the locations of first\n            (\n S F \n ) and last (\n S L \n ) bifurcation points obtained from the low-resolution run. The\n            high-resolution bifurcation calculation is run between\n            \n S 0 \n( =\n S F \n− Δ S\n)\n            and\n            \n S N \n( =\n S F \n+ Δ S\n)\n . We choose a small value of\n            \n Δ S \n            satisfying the condition that\n            \n S 0 \n≥\n0\n            and\n            \n S N \n≤\n1000\n .\n          \n            The step length of S is chosen based on the magnitude of\n            \n(  S F \n−\n S L  )\n . We chose a bigger step length for a larger value of this\n            difference. The following statement determines the range and step\n            length of S to be used in the high-resolution calculation.\n            \n[sigE3,sigE3F1,dsig2nw,dsig2]=ParRegion_highres(nmbr_peaks_ss,sum_diffss,dSc,Sct,dSr,dSn,sigE1,sigE2,dsig2);\n            In the high-resolution run, the upper limit (xE1) in the numerical\n            integration of the force is adoptively chosen based on the value of\n            largest steady state obtained from the low-resolution run.\n          \n        Determine the number of jumps in the stable branch at the bifurcation\n        points and their locations required for the identification of switches\n        (See Step 4 and\n        Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc1.xlsx]).\n        \nCritical: A number of measures are\n          implemented to avoid erroneous identification of the switches.\n        \n            If the high-resolution bifurcation run generates a higher order\n            multistability (for example tristability), which was not detected in\n            the low-resolution run due to the larger step size of S, the\n            corresponding parameter set is discarded.\n          \n            If the bifurcation diagram is truncated in the steady state axis\n            (B-axis) either at the lowest (S = 0) or largest (S = 1000) values\n            of S, then the jump-based identification of bistability may lead to\n            an erroneous result. If such a rare situation arises, then the\n            corresponding parameter set is also discarded.",
    "Note: The default value of the\n              maximum value of the dynamical variable (xE) is 10000 and it can\n              be increased if truncation occurs frequently.\n            \n        Use the statement below to identify the type of bistable switches, count\n        their numbers and segregate their parameters in separate arrays.\n      \n[Cnt,Indx,Par]=BS_switchSegregation_189BS(kk,ic1,data,peaks_ss,sum_diffss2,jmpN,jmpLocSN,Cnt,Indx,Par);\n        Repeat the steps 15–18 for the sample size (nr) number of times to\n        determine the count of various switches.\n      \n        Use the statement below to store the counts of the 84 reversible\n        bistable switches and their parameters in structured arrays.\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Fig2.jpg\n              Figure 2. Outcome of the parameter searching for noncanonical\n              bistable switches\n            \n              (A–F) Bar plot of the counts (A–C) and occurrence probabilities\n              (percentage chance) (D–F) of 84 reversible bistable switches\n              obtained from parameter search calculation with a sample size of\n              10000. The plots are segregated based on the number of bistable\n              regions as indicated inside each plot. See the\n              Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc1.xlsx]\n              for the schematic representations of all the switches.\n            \n[ppMISA_OR_189BS]=BS_saveCntParIndx_189BS(Cnt,Indx,Par);\nNote:\nFigure 2[href=https://www.wicell.org#fig2] presents the counts and the occurrence\n      probabilities obtained from the MATLAB run with a parameter sample size\n      (nr) of 10000. For the ease of visualization, the counts and occurrence\n      probabilities of bistable switches with one, two and three bistable\n      regions are plotted separately. The counts of 84 switches and their\n      segregated parameters are saved in the ‘parSearch_ppMISA_OR_189BS.mat’\n      file.\n    \n        The statement below stores the counts of the group of 14 bistable\n        switches and their parameters in structured arrays.\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Fig3.jpg\n              Figure 3. Outcome of parameter searching for the group of 14\n              bistable switches\n            \n              (A–F) The counts (A–C) and occurrence probabilities (percentage\n              chance) (D–F) of 14 types of bistable switches are segregated\n              based on the number of bistable regions. See Das et al.1[href=https://www.wicell.org#bib1]\n              for the counts and occurrence probabilities of these switches with\n              a much bigger sample size of 900,000.\n              Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc2.xlsx]",
    "lists these 14 switches along with their ‘parent’ switches.\n            \n[ppMISA_OR_14BS]=BS_saveCntParIndx_14BS(Cnt,Par);\nNote: Figure 3[href=https://www.wicell.org#fig3] reports\n      the counts and occurrence probabilities of these 14 switches (See\n      Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc2.xlsx]). The counts and parameters of the group of 14 bistable switches,\n      reported in Das et al.,1[href=https://www.wicell.org#bib1] are stored in the\n      ‘parSearch_ppMISA_OR_14BS.mat’ file.\n    \nOptional: One-parameter bifurcation\n      diagrams can be plotted during the parameter searching by uncommenting the\n      lines # 972–974. However, for parameter searching with a larger sample\n      size (nr > 1000), these lines must be left commented to improve\n      computational efficiency.\n    \nNote: The parameter searching calculation\n      takes about 18–20 hours for a sample size of 10000 in a workstation with\n      2×Intel(R) Xeon(R) Gold 6226R CPU @ 2.90GHz processors. To get a sense of\n      the calculation, a trial run can be performed with a smaller sample size,\n      say 1000, while plotting the 1-p bifurcation diagrams by uncommenting the\n      line # 972–974. The code is provided for the ppMISA model however the\n      method can be applied to other regulatory motifs reported in Das\n      et al.1[href=https://www.wicell.org#bib1]\nCritical: The maximum value of the\n      bifurcation parameter (sig_max) and the dynamical variable (xE) were\n      chosen to be 1000 and 10000, respectively, in the low-resolution run. With\n      the selected ranges of various parameters, most of the bistable switches\n      fall within those two limits. However, the maximum values of those two\n      parameters may need to be modified as required due to altered ranges of\n      various parameters. For example, with an increased range of expression\n      rate (or decreased range of degradation rate) of B, the maximum value of\n      the dynamical variable may need to be increased accordingly.\n    \n      Calculation of phase diagrams of noncanonical bistable switches\n    \nTiming: 20–24 h\n      This section describes the steps to run phase diagram analysis of a\n      bistable switch. In the phase diagram calculation, we determine the fate",
    "of a switch under simultaneous variation of two other parameters. In the\n      phase diagram calculation, for each combination of two secondary\n      parameters, we run 1-p bifurcation analysis and determine the type of\n      resulting switch. By repeating this process for a range of combination of\n      these two parameters, we create a phase diagram where we plot the\n      ‘identity index’ of the resulting switches as a function of these two\n      parameters.\n    \nNote: Here we considered a total of 189\n      bistable switches that include both reversible and irreversible switches.\n      The basic structure of the phase diagram calculation involves running a\n      low-resolution bifurcation run with selected values of the two relevant\n      parameters followed by the high-resolution bifurcation calculation to\n      identify the type of bistability.\n    \nThe steps of the phase diagram calculation are listed below.\n        Browse to the ‘PhaseDia’ directory where all the necessary MATLAB codes\n        are available.\n      \n        Run the MATLAB code ‘STAR_phaseDia_189BS_ppMISA_OR.m’ to generate the\n        phase diagram under the variation of the mutual regulatory strengths of\n        the gene A and gene B (\n g AB \n        and\n        \n g BA \n ) in the ppMISA network.\n      \n        Define the initial counts of 189 switches and then load the parameter\n        values for the starting bistable switch (a mushroom) from the data file\n        parameter_phaseDia.mat.\n      \nload parameter_phaseDia.mat\nNote: The parameter set of the starting\n      bistable switch provided in the code corresponds to mushroom bistability.\n      Modify the parameter set accordingly to start with a different starting\n      switch.\n    \n        Choose the phase diagram related parameters associated with the\n        \n g AB \n        and\n        \n g BA \n . These parameters include their initial values, step lengths and the\n        number of values.\n      \n        Specify the numerical parameters for the low- and high-resolution\n        bifurcation calculations.\n      \n        Initiate the nested loops to choose the values of\n        \n g AB \n        and\n        \n g BA \n        independently for the phase diagram calculation.",
    "Perform the low-resolution bifurcation calculation with the particular\n        combination of\n        \n g AB \n        and\n        \n g BA \n .\n      \n        Subsequently carry out the high-resolution bifurcation calculation with\n        various speed enhancing features as detailed in the previous section\n        (see Step 16).\n      \n        Determine the number of jumps in the stable branch at the bifurcation\n        points and their locations (see Step 17).\n      \n        Determine the type of bistability next and assign the ‘identity index’\n        of the switch obtained.\n      \nNote: Each type of switch is assigned an\n      identity index (phaseIndx) between the number 1 to 189 (See\n      Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Mmc1.xlsx]). The phaseIndx values for monostability and tristability are 0 and 200,\n      respectively. The abbreviated names of the resulting switches are printed\n      in the MATLAB window during the calculation.\n    \nRepeat the steps 27–31 to construct the phase diagram.\n        Store the counts of various types of bistable switches in the structured\n        array using the statement below\n      \n[ppMISA_OR_189BS]=BS_saveCnt_189BS(Cnt);\nNote: These counts are not used for any\n      other analysis in the phase diagram calculation and thus can be commented\n      if needed.\n    \n        Use the statement below to plot a two-dimensional surface plot of the\n        color-coded phaseIndx as a function of\n        \n g BA \n        and\n        \n g AB \n        (Figure 4[href=https://www.wicell.org#fig4]A).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3066-Fig4.jpg\n              Figure 4. Phase diagram of bistable switches\n            \n              (A and B) The phase diagram plots ‘phaseIndx’ as a function of\n              mutual regulatory strengths of A (\n g AB \n ) and B (\n g BA \n ) (A). In the modified phase diagram, the ‘phaseIndx’ are changed\n              according to the total number of phases and thereby result in a\n              greater color contrast among phases (B).\n            \nplot_phaseDia(Val_gba,Val_gab,phaseDia)\nNote: Phase diagram plot is color coded\n      based on the phaseIndx values of the switches. In a particular diagram, if\n      the range of phaseIndx values becomes wide then switches with close\n      phaseIndx values can be difficult to identify due to poor color contrast",
    "in the surface plot. To improve the color contrast, we have provided an\n      additional function plot_phaseDia_Rscl(Val_gba,Val_gab,phaseDia) that\n      modifies the phaseIndx values based on the total number of phases present\n      in the diagram and thereby reducing the range of the phaseIndx values.\n      This function also plots the phase diagram with modified phaseIndx values\n      creating a greater contrast of colors among the phases (Figure 4[href=https://www.wicell.org#fig4]B). Note that phaseIndx values in this modified phase diagram cannot be\n      used for manual identification of the phases in the surface plot and the\n      unaltered phaseIndx values (Figure 4[href=https://www.wicell.org#fig4]A) must be used\n      for the identification of phases from the surface plot.\n    \n        Save the counts of various types of switches, phaseIndx and the values\n        of\n        \n g BA \n        and\n        \n g AB \n        in the data file phaseDia_189BS_ppMISA_gab_gba.mat using the command\n        below.\n      \nsave phaseDia_189BS_ppMISA_gab_gba.mat phaseDia Val_gab Val_gba\n          ppMISA_OR_189BS\nOptional: During the phase diagram\n      calculation 1-p bifurcation diagrams can be plotted during a trial run for\n      visual inspection of the 1-p bifurcation diagrams by uncommenting line #\n      511–515.\n    \nNote: The phase diagram is calculated with\n      101 × 101 values of\n      \n g BA \n      and\n      \n g AB \n      with a step length of 1 for both of the parameters and it takes about 20\n      hours in a workstation with 2×Intel(R) Xeon(R) Gold 6226R CPU @ 2.90GHz. A\n      trial calculation can be done with 20 × 20 grid with a step length of 5 to\n      get a sense of the phase diagram and during the trial calculation 1-p\n      bifurcation diagrams can also be plotted for visual inspection."
  ],
  "subjectAreas": [
    "Computer Sciences",
    "Systems Biology",
    "Biotechnology And Bioengineering",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}