{
  "id": 10843,
  "origin_website": "Jove",
  "title": "In Vivo Quantitative Assessment of Myocardial Structure, Function, Perfusion and Viability Using Cardiac Micro-computed Tomography",
  "procedures": [
    "All animal work in this study was approved by the Erasmus MC animal research ethics committee. Throughout the experiments, the animals were kept in accordance with Erasmus MC institutional regulations. At the end of the experiment animals were euthanized using an overdose of inhalant anesthetic isoflurane. Please seek institutional animal care and use committee approval before commencing this work.\n1. Preparation of Cardiac Ischemia Model\nAnesthetize the mouse (C57Bl6, 12 weeks old) by inhalation of 4% isoflurane. Intubate the animal using a 20 G cannula and respirate the mouse at 100 breaths per minute with a peak inspiratory pressure of 18 cm H2O and a positive end expiratory pressure of 4 cm H2O.\n\t\nUse a gas mixture of O2/N2 (v/v = 1/2) containing 2.5% isoflurane to maintain anesthesia and apply eye drops to prevent desiccation of the eyes while under anesthesia. Place the mouse on a heating pad and measure body temperature rectally to maintain body temperature at 37 °C during surgery.\nInject buprenorphine (0.05-0.2 mg/kg) subcutaneously just prior to surgery and check the toe pinch reflex to assure sufficient depth of anesthesia before the start of the surgical procedure. Depilate the mouse chest using hair removal cream and apply iodine to the skin.\nPerform an incision by making a small cut with scissors in the skin between the 2nd and 3rd left ribs. Pull the pectoralis minor and the xiphihumeralis muscle as well as the latissimus dorsi muscle to the side using small hooks to allow access to the intercostal muscles.\nCarefully cut through the 3rd intercostal muscle without harming the lungs using a curved 2 mm blade spring scissor. Push the lung aside using a small piece of wet gauze and rupture the pericardium.\n\tNOTE: Be careful not to damage the left phrenic nerve.",
    "Reposition the small hooks that hold the muscle to inside the thorax and reposition them so that a large part of the left ventricular (LV) free wall and part of the left atrium are visible.\nInsert a 7-0 silk surgical suture underneath the left coronary artery and occlude the artery by firmly knotting the suture.\n\tNOTE: Because in most mice the coronary artery is not visible, determine the position of the ligature using the atrium and always ligate the coronary artery 2 mm below the edge of the left atrium in order to standardize infarct size.\nVisually check for successful induction of the infarct by confirming the paling of the left ventricular free wall. When paling is not observed, perform an additional attempt to occlude the LAD.\nClose the chest firmly using a 6-0 silk surgical suture.\n\tNOTE: The chest should be closed airtight to allow independent breathing after recovery.\nClean the wound with saline and close the skin using silk sutures. Apply wound spray on the skin to stimulate wound healing and prevent infection.\nTurn the isoflurane off and wait until the animal start to breathe by itself before removing the ventilation tube. Place the mouse in a cage on a heating pad while recovering.\n\tNOTE: Do not leave an animal unattended until it has regained sufficient consciousness to maintain ventral recumbency. Do not return an animal that has undergone surgery to the company of other animals until fully recovered.\nAdminister additional doses of buprenorphine every 8-12 hr after surgery for post-surgery analgesia. Administer Buprenorphine (50 µg/kg) intraperitoneally.\n\tNOTE: Scan the animals by MicroCT (Section 3) 3-4 hr after the surgery for the first scan and 6-7 hr after the surgery for the second scan.\n2. Injection of MicroCT Contrast",
    "In order to acquire anatomic, functional, and metabolic information in two successive MicroCT imaging sessions, use iodinated contrast agent.\nExpose and treat the rubber of the vial stopper using 70% alcohol. Using a low dead space syringe, withdraw a required volume (5-10 µl/g of body weight) of the contrast agent. To prevent the risk of embolism during injection, purge air bubbles, if any, by advancing the plunger back and forth and/or gently tapping the side of the syringe and slowly expelling the air into sterile absorbent tissue until fluid appears at the tip of the needle.\n\tNote: Injection of the MicroCT contrast can be performed in conscious or sedated animals. Physical restraint should be performed on conscious animals. To minimize stress, consider light sedation or general isoflurane anesthesia with an inhalation anesthesia system.\nPrior to injection, swab the tail with 70% alcohol. Warm up the tail with a lamp or by immersing the tail into warm water (40-45 °C) to provide better vessel dilation. Inject the contrast agent intravenously (e.g. via one of the lateral tail veins) at 5-10 µl/g of body weight.\n\tNote: Optimize the injected dose for a particular animal model or MicroCT instrument's acquisition settings, as the contrast enhancement can be influenced by the health or dietary status of the animal under study and the level of image noise.\n3. MicroCT Imaging\nPrior to contrast injection, turn on MicroCT scanner by pressing the computer power button. Start the MicroCT control software, and warm up the X-ray tube by clicking the Warm-up button shown in the software control window.\nAllow for the Live Mode button to appear in the control software indicating that warm-up is complete. Insert the small bore cover and place the small animal bed.",
    "Create or select the appropriate database, study, and subject where the image data will be saved. To create a new database click the New Database button in the Database window, enter a name that would specify the new database, click Browse button in the dialog box that appears, navigate to the drive where the database will be saved, and click OK. Observe the new database in the Database window. To connect to an existing database, click the Connect to Database button in the Database window, and double-click the database name.\nSet the scan conditions by selecting the following parameters from the drop-down menus of the software control window: X-ray tube voltage, 90 kV; CT X-ray tube current, 160 µA; Live X-ray tube current, 80 µA; FOV, 20 mm; Gating technique, cardio-respiratory; Scan technique, 4.5 min.\n\tNOTE: This imaging protocol allows for reconstruction of end-diastolic and end-systolic 3D datasets, each with a matrix size of 512 x 512 x 512, with a reconstructed isotropic voxel size of 40 µm.\nAfter injecting the animal with the contrast agent, anesthetize it in an induction chamber by inhalation of 4% isoflurane. Place the animal on the animal bed of the scanner with a nose cone supplying 1.5-2.0% isoflurane in an air oxygen mixture. If necessary, adjust the flow of isoflurane to achieve the animal's stable respiratory activity with ≤60 breaths per minute.\nClose the instruments door by sliding it to the right to engage the safety interlock. Turn on Live Mode by clicking the Live Mode button shown on the control software window to view the subject in real time. Observe the X-capture window and the animal.\n\tNote: The instrument does not generate X-rays unless the door is properly closed and the safety interlock is engaged.",
    "Move the animal bed to align the mouse chest within the field of view (FOV) by pressing the stage Z-axis control back and forth buttons located on the front panel of the instrument. Verify that the chest is in the center within the FOV. Use the animal bed control LEFT and RIGHT arrows located on the front panel of the instrument to position the animal inside the blue bounding box.\n\t\nRotate the gantry by selecting \"90\" from the Rotation Control drop-down list shown on the control software window and clicking the Set button. Make sure the animal remains within the blue bounding box of the X-capture window. If necessary, align the animal by using the animal bed control UP and DOWN arrows located on the front panel of the instrument.\n\t\tNote: Only the image data inside the blue bounding box shown on the X-capture window will be used to reconstruct the 3D volume.\nIn the Xcapture window, resize the cardio-respiratory region of interest (ROI) with the left mouse click and by dragging the ROI edges with the mouse cursor, so that the cardio-respiratory traces are clearly visible in the synchronization view. Ensure that the ROI covers the diaphragm and the apical portion of the heart in all gantry positions. Rotate the gantry 90° as described in step 3.6 to make sure that the cardio-respiratory traces are still clearly visible.\n\tNOTE: In order to prevent unnecessary exposure to ionizing radiation, minimize the time during which the animal position and cardio-respiratory ROI are adjusted.",
    "Click the CT Scan button shown on the control software window to initialize the acquisition. CT Scan Confirmation Message will appear. Click the YES button shown in the CT Scan Confirmation Message to confirm. Click the NO button to abort the scan. Once the YES button is pressed, the red X-ray energizing indication located on the instrument will be lit.\n\tNOTE: The indication will be also visible by the blinking voltage icon of the instrument status box of the control software window. The scan will be completed in 4.5 min. The X-ray tube will be switched off automatically and the red X-ray energizing indication located on the instrument and on the control panel of the control software window will dim. The projections will be automatically sorted and the progress will be indicated by the green progress bars shown on GetSynchronizedRaw window. The volume sets representing end-diastolic and end-systolic phases of the cardiac cycle will be automatically reconstructed within 2-3 additional min.\n\tNOTE: To abort the scan click the emergency stop button in the Control panel of the control software window or push the mechanical emergency stop button located on the front panel of the instrument.\nObserve the transaxial, coronal, and sagittal views of the reconstructions in 2D Viewer software. Take a few seconds to review the quality of the acquired images. Look for the signs of animal movement that can be caused by an inadequate level of anesthesia. If necessary, make appropriate modifications and repeat the scan.",
    "NOTE: If the structures in the image are doubled, shown with double edges, or shown with streaks, then these are the usual \"red flags\" that can indicate that the level of anesthesia may be inadequate and that the animal has moved during the scan. In such instances, the level of anesthesia should be adjusted and the scan should be re-acquired.\nRemove the animal from the scanner and allow for full recovery from anesthesia under supervision.\nAcquire an additional MicroCT scan during the metabolic phase of the contrast uptake (3 to 6 hr after the contrast injection).\n\tNOTE: More details on mean myocardial enhancement values for C57Bl/6 and BALB/c mice were published by Detombe et al and Ashton et al.22,23.\n4. MicroCT Data Analysis\nLoad both end-diastolic and end-systolic VOX files into Analyze 12 software.\nOpen each loaded image with the Oblique Sections module and perform short-axial image reformation.\nIn order to minimize image-processing time consider cropping the images using the Subregion/pad volume function of the Image Calculator module. For both volumes, maintain identical SubRegion Low and High X, Y, Z dimensions.\nAppend both volumes and open with the Volume Edit module. For better visualization of the structures, adjust image intensity if necessary.\nPerform endocardial contour segmentation. From the Semi-Automatic tab of the Volume Edit module select Object Extractor, set a seed point into the left ventricle (LV) and adjust threshold values, so that the left ventricular cavity is delineated from the myocardium. To determine the threshold value, use automatic thresholding algorithms or the full width half max value (FWHM) determined with the Line Profile module.",
    "Draw a limit along the mitral valve leaflet plane to prevent the region spreading to the aorta, click the Extract Object button to complete the segmentation. Both end-diastolic and end-systolic volumes will be processed automatically. Name the region (e.g. LV Cavity) and save the object map to the corresponding file directory.\nPerform epicardial contour segmentation. Add a new object and perform the segmentation of the epicardial heart surface using either Semi-Automatic or Manual segmentation tools of the Volume Edit module. Make sure that both end-diastolic and end-systolic contours are correctly identified. If necessary, perform manual adjustment. Name the regions (e.g. LV Myocardium) and save the object map to the corresponding file directory.\n\tNote: Image filtering with the Spatial Filters module can be additionally performed to improve the speed and quality of the segmentations.\nIn order to extract volumetric measurements from the object maps (saved) open the appended volume with the Region of Interest module. Make sure the corrected map is loaded, open the sample Option window, make sure both LV Cavity and LV Myocardium objects are selected, and click the Sample Images button. Save the log file.\nFor regional analysis of the heart function and metabolism, use the Radial Divider tool of the Region of Interest module to further subdivide the segmented volumes.\n5. Computation of the Global and Regional Heart Parameters\nTo compute the left ventricular stroke volume (LVSV), subtract the left ventricular end-systolic volume (LVESV) from the left ventricular end-diastolic volume (LVEDV):\nLVSV = LVEDV - LVESV;\nTo compute the left ventricular ejection fraction (LVEF), divide the left ventricular stroke volume (LVSV) by the left ventricular end-diastolic volume (LVEDV) and multiply by 100%:\nLVEF = LVSV / LVEDV*100%;\nTo compute cardiac output (CO), multiply the left ventricular stroke volume (LVSV) by the heart rate (HR):",
    "CO = LVSV * HR;\nTo compute the left ventricular myocardial mass (LVMM), subtract the left ventricular myocardial wall volume bound by the endocardial surface (LVMVENDO) from the left ventricular myocardial wall volume bound by the epicardial surface (LVMVEPI), and multiply by the specific gravity of the myocardium, 1.05 g/cm3:\nLVMM = (LVMV EPI - LVMV ENDO ) * 1.05;\nTo compute the left ventricular myocardial mass index (LVMMI), divide the left ventricular myocardial mass (LVMM) by the mouse body weight (BW):\nLVMMI=LVMM / BW;\nTo compute the percentage of the left ventricular myocardial infarct size (%LVMIS), divide the left ventricular volume of infarcted myocardium (LVMVMI) by the total left ventricular myocardial volume (LVMVTOTAL), and multiply by 100%:\n%LVMIS = LVMV MI / LVMV TOTAL * 100%;\nNote: For LVMM, LVMMI, and %LVMIS calculations, use endo- and epicardial volume measurements from the corresponding end-diastolic or end-systolic datasets. Report average end-systolic and end-diastolic indices.\nTo compute the segmental left ventricular wall motion abnormalities (LVWM), subtract the segmental left ventricular end-systolic wall diameter (LVESWD) from the segmental left ventricular end-diastolic wall diameter (LVEDWD):\nLVWM = LVEDWD - LVESWD;\n\tDisplay the results as circumferential polar maps (Bulls eye polar plots).\nTo compute the segmental left ventricular wall thickening (%LVWTh), subtract the segmental left ventricular end-diastolic wall thickness (LVEDWTh) from the segmental left ventricular end-systolic wall thickness (LVESWTh), divide by the segmental left ventricular end-diastolic wall thickness (LVEDWTh), and multiply by 100%:\n%LVWTh = (LVESWTh - LVEDWTh) / LVEDWTh * 100%;\n\tDisplay the results as circumferential polar maps (Bulls eye polar plots).",
    "To calculate the regional ejection fraction (%rEF), subtract the square of segmental left ventricular end-systolic wall diameter (LVESWD) from the square of segmental left ventricular end-diastolic wall diameter (LVEDWD), divide by the square of segmental left ventricular end-diastolic wall diameter (LVEDWD), and multiply by 100%:\n%rEF = ( LVEDWD 2  - LVESWD 2 ) / LVEDWD 2 * 100%;\n\tDisplay the results as circumferential polar maps (Bulls eye polar plots).\nTo present regional myocardial perfusion and contrast uptake, convert the mean intensity values into CT numbers (Hounsfield units, HU). Convert both end-diastolic and end-systolic datasets by rescaling air selected from the region selected outside the animal to - 1000 HU, and water to 0 HU using a water-filled small radio-transparent tube. Display the results as circumferential polar maps (Bulls eye polar plots).\n6. Statistical Analysis\nRepresent all polar plot display data as mean ± standard deviation (SD). Assess the statistical difference using one-way analysis of variance (ANOVA) or another appropriate technique."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}