{
  "id": 17836,
  "origin_website": "Jove",
  "title": "Murine Cervical Aortic Transplantation Model using a Modified Non-Suture Cuff Technique",
  "procedures": [
    "All experiments were performed according to the guidelines of the German animal welfare act (TierSchG.) (AZ: 55.2-1-54-2532.Vet_02-80-2015).\n1. Animal housing\nFor experiments, use male C57BL/6 and BALB/c mice weighing 20-25 g with C57BL/6 mice as the recipient animals and BALB/c mice as the donor animals.\nPurchase the animals and house in a barrier pathogen-free facility, in accordance with the FELASA guidelines for health monitoring12.\nKeep the mice in standard Makrolon cages with enrichment nesting material. Provide ad libitum access to water and pelleted food at a day/night cycle of 12 h.\nMaintain the room temperature at 22 ± 2°C and the relative humidity at 55 ± 5%.\n2. Recipient preparation\nFirst, anesthetize the recipient animal (C57BL/6) with an intraperitoneal injection of midazolam (5 mg/kg; 5 mg/mL), medetomidin (0.5 mg/kg; 1 mg/mL) and fentanyl (0.05 mg/kg; 0.05 mg/mL).\n\tNOTE: The correct depth of the anesthesia should be reached in 5-10 min.\n\t\nPinch the hind feet with forceps to check for reflexes to confirm the depth of anesthesia.\nClip all the hair of the cervical lateral region with an electric hair clipper for small animals and apply ophthalmic ointment with cotton swabs to prevent the eyes from drying out during the procedure.\nPlace the animal in a supine position on a heating pad under the microscope and gently tape its legs to the operating table with skin sensitive plaster strips.\nTilt its head back and scrub the operative field several times with alcohol.\nMake a skin incision from the jugular incision to the right lower mandible with small scissors.\nRemove the right lower lobe of the submandibular gland via bipolar cautery of the vessel pedicle and subsequent excision with microscissors.",
    "Remove the right sternocleidomastoid muscle via bipolar cautery of the upper and lower portion and subsequent excision with microscissors to gain access to the common carotid artery.\nMobilize the common carotid artery as far distally and proximally as possible by pulling the surrounding connective tissue apart with fine forceps.\nTie two 7-0 silk ligatures with minimal distance between each around the middle of the common carotid artery and transect the common carotid artery with fine microscissors between the ligatures.\nPass the proximal, ligated end through the cuff and fix it with a small artery clamp.\n\tNOTE: The cuffs that were used in this procedure were cut with microscissors from tubes of polyimide with an outer diameter of 0.610 mm and a wall thickness of 0.0254 mm. The completed cuffs had a length of ~2 mm with one half, which is used for the cuffing process, being a full cylinder and the other half, which is clamped, being a half-cylinder.\nRemove the ligature with fine microscissors, as close to the ligature as possible, and flush the lumen with heparinized saline (50 IU/mL) with a 30 G needle, while taking care not to damage the vessel walls.\nDistend the open lumen using fine vascular dilatators and evert the carotid stump over the cuff by pulling it gently over the polyimide tube.\nImmediately fix the everted carotid with a loosely pre-tied 7-0 silk loop.\n\tNOTE: Loosely pre-tie 4 7-0 silk loops with a diameter of about 1.5 mm before the surgery to make the cuffing-procedure smoother and easier.\nPerform the same procedure (2.10-2.13) at the other end of the carotid artery.\nSet the recipient animal aside and moisturize the operative field with saline until the aortic segment is explanted.\n3. Donor operation",
    "Anesthetize the donor mouse (BALB/c) in the same fashion as the recipient animal.\n\t\nPinch the hind feet with forceps to check for reflexes to confirm sufficient anesthesia.\nClip all hair of the abdominal and thoracic region with an electric hair clipper for small animals and apply ophthalmic ointment with cotton swabs to prevent the eyes from drying out during the procedure.\nPlace the animal in a supine position on a heating pad under the microscope and gently tape its legs to the operating table with skin sensitive plaster strips.\nScrub the operative field several times with alcohol.\nPerform a midline abdominal laparotomy with small scissors and push the intestines slightly upward to expose the inferior vena cava (IVC).\nInject the inferior vena cava (IVC) with 1 mL of heparinized saline using a 30 G needle.\nCut the abdominal aorta and IVC below the renal arteries with small scissors to exsanguinate the donor animal. Loosely place a compress into the abdomen to absorb the blood.\nPerform a thoracotomy at the bilateral diversion of the ribs with scissors and tilt the anterior chest wall cranially with a surgical clamp to expose the mediastinum.\nCut the IVC and the esophagus directly above the diaphragm with microscissors.\nRemove the heart and the lungs by tilting them upward with forceps holding the cut IVC/esophagus and then excising them with microscissors from their base to gain access to the thoracic aorta in the dorsal mediastinum.\nMobilize the thoracic aorta from its surrounding tissue by pulling apart the surrounding connective tissue and fat with fine forceps while being careful not to damage any intercostal arteries.\nCauterize all branches from the thoracic aorta with bipolar cautery forceps and excise the aortic segment between the diaphragm and the aortic arch using microscissors.",
    "Flush the excised aortic segment with heparinized saline with a 30 G needle, while taking care not to damage the vessel walls, to remove any remaining blood or clots, and transfer the graft to the recipient animal.\n\tNOTE: Directly place the aortic graft in the roughly right position in the recipient during transfer. If there are problems confusing the different ends of the graft in the recipient animal, a loose ligature around the distal end could help.\n4. Implantation\nPull the proximal end of the donor aortic segment over the proximal cuff on top of the everted carotid artery with fine forceps and immediately fix it with a loosely pre-tied 7-0 silk loop.\nTrim the distal, free end of the aortic graft with microscissors so that the graft length fits the distance between the two cuffs.\nRepeat step 4.1 on the other end of the aorta with the other cuff to complete the anastomosis.\nRemove the distal clamp to allow retrograde perfusion.\nAfter achieving hemostasis, remove the proximal clamp to complete the anastomosis.\nFinally, close the wound with 6-0 continuous suture.\n5. Postoperative care\nMonitor the mouse closely in the first 6 h after the operation and then several times a day for the first 72 h after the transplantation to detect any complications instantly.\nFor postoperative analgesia, inject the transplanted mouse with buprenorphine (0.05-0.1 mg/kg) subcutaneously directly after the transplantation and then every 12 h for 72 h to provide appropriate, long term analgesia.\n6. Aortic graft explanations\nAnesthetize the transplanted animal with an intraperitoneal injection of midazolam (5 mg/kg; 5 mg/mL), medetomidin (0.5 mg/kg; 1 mg/mL) and fentanyl (0.05 mg/kg; 0.05 mg/mL) 4 weeks after transplantation.\n\t\nPinch the hind feet with forceps to check for reflexes to confirm sufficient anesthesia.",
    "Clip all hair of the abdominal, thoracic and cervical region with an electric hair clipper for small animals.\nPlace the animal in a supine position on a heating pad under the microscope and gently tape its legs to the operating table with skin sensitive plaster strips.\nScrub the operative field several times with alcohol.\nPerform a midline abdominal laparotomy with small scissors and push the intestines slightly upward to expose the inferior vena cava (IVC).\nInject the inferior vena cava (IVC) with 1 mL of heparinized saline using a 30 G needle.\nCut the abdominal aorta and IVC below the renal arteries with small scissors to exsanguinate the donor animal. Loosely place a compress into the abdomen to absorb the blood.\nMake a skin incision from the jugular incision to the right lower mandible with small scissors corresponding to the skin incision made during the transplant procedure.\nIdentify the transplanted aortic graft together with the distal and proximal cuff and blunt remove any surrounding tissue with forceps.\nUsing microscissors, cut through the common carotid artery distal and proximal to the aortic graft with the cuffs in order to explant the aortic graft together with the two cuff ends.\nCut the aortic segment in half and preserve the specimens for further analyses (frozen sections, paraffin embedded sections, snap frozen material)13,14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}