{
  "id": 9154,
  "origin_website": "Jove",
  "title": "Transsynaptic Tracing from Peripheral Targets with Pseudorabies Virus Followed by Cholera Toxin and Biotinylated Dextran Amines Double Labeling",
  "procedures": [
    "NOTE: All animal procedures have been reviewed and approved by the Duke University Institutional Animal Care & Use Committee.\n1. Storing Pseudorabies Virus\nWe obtain live virus (PRV152) from the laboratory of Dr. Lynn Enquist at Princeton University at a titer of 1 x 109 pfu/m. The protocol to generate the virus has been published2.\nAliquot the virus at 20 µl per tube inside a BSL-2 biosafety cabinet and store at -80 °C under appropriate biosafety conditions.\nThaw an aliquot of PRV immediately before injecting.\n2. Surgical Preparation for Injections into Muscle\nInduce general anesthesia by intramuscular injection of ketamine-xylazine (100 mg/kg ketamine; 10 mg/kg xylazine) and maintain an appropriate anesthetic plane using isofluorane.\nProtect the corneas with an opthalmic ointment.\nPrepare the surgical site according to aseptic technique by trimming hair and disinfecting the surgical site with alternating scrubs of Betadine and 70% alcohol (minimum of 3 cycles).  Be sure to use sterile drapes to cover surgical areas. Make sure to adhere to sterile techniques throughout the procedures.  \nMake a skin incision and reveal the muscle of interest. For example, to access the cricothyroid laryngeal muscle it is necessary to first remove the overlying portion of the sternohyoid muscle.\nSeal any transected muscles with VetBond tissue adhesive.\n3. Injection of PRV into Muscle\nLoad the 10 µl NanoFil microsyringe system with freshly thawed PRV solution, attach a 34 G stainless steel needle, and carefully mount it on the stereotaxic device.\nSlowly clear the dead space and verify that solution exits the microsyringe tip. Discard fluid as bioharzard waste.",
    "Using a stereotaxic micropositioning device carefully place the microsyringe tip into the muscle of interest and slowly fill the muscle until slight swelling is visible. The injection rate will vary depending on the size of the muscle and volume to be injected. For example, five injections of 200 nl (1 µl total) at a rate of 4 nl/sec should be made 1 min apart at the same site to fill the cricothyroid muscle. Move the syringe to the next muscle of interest (the lateral cricoarytenoid in this case) and repeat the injection procedure. Only puncture each muscle once.\nRetract the microsyringe after five minutes.\nSeal the break in the fascia using VetBond tissue adhesive.\nAfter all injections have been completed, close the wound using VetBond tissue adhesive. Depending on your local institional animal use guidelines, sutures or wound clips may be used. \nMonitor the animal until sternal recumbency and provide analgesia, food, water, and care as required by your institutional animal use guidelines.\nAfter the experimentally determined survival time (in this case, 90 hr to label 2nd order cortical neurons), sacrifice the animal by pentobarbital overdose and perfuse transcardially with 0.9% saline followed by 4% formaldehyde in 0.1 M PBS.\nRemove and post-fix the brain in 4% formaldehyde for 24 hr.\nCryoprotect the brain in phosphate buffer containing 30% sucrose for at least 48 hr.\n4. Immunochemical Detection of eGFP\nCut sections at 40 µm on a sliding microtome and save floating sections into 0.1M PBS. Thinner sections, for example 30 µm, may be used when staining mounted sections.\nQuench sections for 30 min in 0.3% H2O2 in PBS protected from light.\nBlock non-specific antigens in the sections for 30 min in PBS containing 0.3% Tween 20 with normal goat serum from the VECTASTAIN Elite Kit (VE kit).",
    "Incubate blocked sections for 3.5 hr in rabbit anti-eGFP (1:1,000) at RT.\nWash sections three times in PBS for 5 min, then incubate them for 1 hr in goat anti-rabbit secondary antibody from the VE kit at RT.\nPrepare the ABC solution from the VE kit according to the manufacturer’s instructions.\nWash sections three times in PBS for 5 min, then react them for 1 hr in ABC solution from the VE kit at RT.\nWash sections three times in phosphate buffer for 10 min, and develop for 8 min in phosphate buffer, pH 7.4, containing 0.05% DAB (3, 3'-diaminobenzidine) and 0.015% H2O2.\nMount sections on SuperFrost Plus slides and dehydrate them through a graded alcohol series (70%, 95%, 100% and 100% for 5 min each).\nClear the sections through two xylene washes (5 min each) and coverslip the slides with Permount mounting medium.\nImage the mounted sections on a microscope. The DAB reaction product inside the cells should appear brown. Digitized images can be color inverted to highlight fine processes.\n5. Surgical Preparation for Injection of Tracers into Brain Regions Discovered by PRV Tracing\nInduce general anesthesia by intramuscular injection of ketamine-xylazine (100 mg/kg ketamine; 10 mg/kg xylazine) and maintain an appropriate anesthetic plane using isofluorane.\nProtect the corneas with an opthalmic ointment.\nFix the head in an appropriate stereotaxic frame.\nPrepare the surgical site according to aseptic technique by trimming hair and disinfecting the site with alternating scrubs of Betadine and 70% alcohol (minimum of 3 cycles).\nMake a scalp incision and retract the skin over the brain region of interest.\nPerform a small craniotomy at the appropriate stereotaxic coordinates. For example, the coordinates for laryngeally connected motor cortex identified by PRV tracing in an adult mouse are 1.2 mm lateral and 0.2 mm rostral to Bregma.",
    "6. Injection of Biotinylated Dextran Amines into Brain\nPrepare 7.5% biotinylated dextran amines (BDA) by dissolving 25 mg of BDA (10,000 MW) in 333 µl of sterile saline.\nLoad the Nanoject II micropipette system with sufficient BDA solution for the planned injections.\nSlowly clear the dead space and verify that solution is exiting the micropipette tip.\nUsing a stereotaxic micropositioning device carefully lower the micropipette tip into the brain region of interest and slowly inject BDA. Adjust the injection rate depending on the size of the region to be labeled. For example, 12 injections of 4.6 nl should made be at four different locations 0.2 mm apart (rostro-caudal direction) to cover the laryngeally connected motor cortex in adult mice. The final injection volume should be adjusted according to the size of the brain region of interest, keeping in mind that label may spread from the injection core by diffusion through brain tissue and along the processes of labeled neurons.\nSeal the craniotomy using dental cement, and close the scalp wound using VetBond tissue adhesive.\nMonitor the animal until sternal recumbency and provide analgesia, food, water, and care as required by your institutional animal use guidelines.\n7. Injection of Cholera Toxin Subunit b into Muscle\nPrepare 1% Cholera Toxin subunit b (CTb) by dissolving 1 mg of CTb in 100 µl of sterile saline.\nSix days after BDA injection into the brain, perform the surgical preparation as described above for PRV injections into muscle.\nLoad the 10 µl NanoFil microsyringe system with CTb solution, attach a 34 G stainless steel needle, and carefully mount it on the stereotaxic device.\nPerform the microinjections into the muscle(s) of interest as previously described for PRV.",
    "Monitor the animal until sternal recumbency and provide analgesia, food, water, and care as required by your institutional animal use guidelines.\nThree days after CTb injection, sacrifice the animal by pentobarbital overdose and perfuse transcardially with 0.9% saline followed by 4% formaldehyde in 0.1 M PBS.\nRemove and post-fix the brain in 4% formaldehyde for 24 hr.\nCryoprotect the brain in phosphate buffer containing 30% sucrose for at least 48 hr.\n8. Detection of BDA and CTb in the Same Sections\nCut sections at 40 µm on a microtome and save floating sections into 0.1M PBS.\nQuench sections for 30 min in 0.3% H2O2 in PBS protected from light.\nPrepare the ABC solution from the VE kit according to the manufacturer’s instructions.\nWash sections three times in PBS for 5 min, then react them for 1 hr in ABC solution at RT.\nWash sections three times in phosphate buffer for 10 min, and develop for 8 min in phosphate buffer, pH 7.4, containing 0.05% DAB (3, 3'-diaminobenzidine), 0.015% H2O2, and 0.05% nickel chloride. The DAB reaction product inside the cells should appear black.\nBlock sections for 30 min in PBS containing 0.3% Tween 20 with normal rabbit serum from the VECTASTAIN Elite Kit.\nIncubate blocked sections for 2 hr in goat anti-CTb (1:10,000) at RT.\nWash sections three times in PBS for 5 min, then incubate them for 1 hr in rabbit anti-goat secondary antibody from the VE kit at RT.\nPrepare the ABC solution from the VE kit according to the manufacturer’s instructions.\nWash sections three times in PBS for 5 min, then react them for 30 min in ABC solution at RT.",
    "Wash sections three times in phosphate buffer for 10 min, and develop for up to 8 min in phosphate buffer, pH 7.4, containing 0.05% DAB (3, 3'-diaminobenzidine) and 0.015% H2O2. The DAB reaction product inside the cells should appear brown.\nMount sections on SuperFrost Plus slides and dehydrate them through a graded alcohol series (70%, 95%, 100% and 100% for 5 min each).\nClear the sections through two xylene washes (5 min each) and coverslip the slides with Permount mounting medium.\nImage the mounted sections on a microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}