{
  "id": 18581,
  "origin_website": "Jove",
  "title": "Therapeutic Effectiveness of a Dietary Supplement for Management of Halitosis in Dogs",
  "procedures": [
    "This clinical evaluation was planned accordingly with the European legislation (86/609/EU) and the experimental protocol was approved by the Ethics and Welfare Animal Committee of the AIRMO Research Center (Milan, Italy).\n1. Dogs and Food Selection\nRandomly divide 32 dogs of different breeds (7.01 ± 0.20 year [mean ± standard error of mean (SEM)]; 34.05 ± 1.47 Kg [mean ± SEM]; 12 males and 20 females) suffering from chronic halitosis into 2 groups, providing them with either the dietary supplement or the placebo over a period of 30 days.\nEnsure that each dog receives the appropriate dose of dietary supplement or placebo based on the animal’s weight in kilograms, according to the manufacturer’s instructions. (Table 1).\nAfter a 30 day treatment, ensure that both groups have a 10 day wash out, where all animals are fed with placebo.  At the end of the wash out period, the feeding regimen for the two groups are reversed such that the control group receives the dietary supplement for another 30 days and the treatment group receives the placebo.\nTwo veterinary inspections performed on the dogs in both groups, one before and one after the 30 day treatment.\n2. The Gas Chromatograph\nNote: The gas chromatograph is a portable device which measures the volatile sulphur compounds (VSC), hydrogen sulfide, methyl mercaptan, and dimethyl sulfide, which are the major causative factors of halitosis, providing information about the concentration of each gas measured. Measuring each VSC helps to identify the cause of halitosis and assess treatment efficacy.\nUsing the procedure outlined in sections 3 and 4, examine volatile sulphur compounds (VSC) before treatment with the dietary supplement (time 0), 10 days post-treatment (time 10), 20 days post-treatment (time 20) and at the end of treatment (time 30).\n3. Gas Chromatograph Setting",
    "Turn on the main switch at the back of the unit. Note: The initial screen displays the word “MEASUREMENT MODE”.\nPress the ENTER key to select MEASUREMENT MODE.\n\tNote: WAIT is displayed on the screen and the standby time required to stabilize the measuring device is displayed next to the word “COUNTER”. When the standby time has come to an end, the device is automatically ready to measure and the READY indicator lamp turns on.\n4. Dogs Breath Sampling and Analysis\nRun the Data Manager software.\nClick “Measurement” after confirming that “Current status” is “Ready to measure”\nEnter ID and click “Select”. Note: A message is displayed at the upper right-hand corner of the window.\n\t\nIf the message displayed is “Inject oral gas”, start the measurement.\nIf the message displayed is “The device is being ready”, then wait.\nBy means of a 1 ml disposable syringe, collect the breath from the dog’s mouth by placing the syringe in the dog’s labial commissure, slowly pulling the plunger and removing the syringe from the dog’s mouth .\nAdjust the volume of the syringe to 1 ml.\nAttach the supplied needle to the end of the syringe and, after opening the lid, eject the sample into the inlet on the device main unit by pushing the plunger.\n\tNote: Measurements start automatically and the READY indicator lamp goes off. Measurement is completed in 8 min and the result is automatically displayed (display can be changed to “Chromatogram”). The Judgment window appears upon completing the measurement. Measurement history and measured data can be displayed .\nPush ENTER to store the results into the unit.\n\tNote: Data are expressed in standard units of parts per billion (ppb) and/or ng/10 ml.",
    "Then wait 1 min to stabilize the device and perform a new measurement. Note: At the end of this time, the lamp turns on meaning that the device is ready."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}