{
  "id": 9118,
  "origin_website": "Jove",
  "title": "Video Imaging and Spatiotemporal Maps to Analyze Gastrointestinal Motility in Mice",
  "procedures": [
    "Animal handling and cervical dislocation of animals prior to all experiments were performed strictly according to protocols approved by the Animal Experimentation Committee for the University of Melbourne (Ethics ID: 1212494.7)\n1. Tissue Collection and Dissection\nEuthanize adult mice by cervical dislocation. If possible avoid anesthesia to prevent influences on gut function via receptors located on neuronal populations of interest.\nRecord the animal's total body weight, pin the body (via the four paws, ventral side exposed to experimenter) firmly to a dissection board using hypodermic needles (Size: 20 G).\nUsing dissecting forceps and scissors; make an incision through the epidermis overlaying the lower abdominal muscle layers. Continue to use the forceps and scissors to open the abdominal cavity along the midline of the abdomen to the sternum.\nTo prevent the tissue dehydrating, pour physiological saline (Krebs solution: 118 NaCl, 4.6 KCl, 2.5 CaCl2, 1.2 MgSO4, 1 NaH2PO4, 25 NaHCO3, 11 D-glucose in mM - bubbled at RT with carbogen gas; 95% O2 and 5% CO2 for a minimum of 20 min) onto abdominal contents at regular intervals (i.e., every 30-60 sec) during the dissection process.\nTo isolate the colon while attached to the cecum and rectum, hold the cecum (located adjacent to the proximal end of colon) gently using dissecting forceps approximately 4-5 cm above the body of the animal while trimming the mesentery using fine dissection scissors.\nTake care not to handle, stretch or cut the gastrointestinal tissue while removing the adjoining mesentery.\nRemove excess tissue (i.e., urinary bladder and testes). Using coarse dissecting scissors, make two vertical incisions (i.e., approximately 0.5 cm from the midline) to cut the pelvic bone on each side of the colon.\nUse fine scissors to separate the rectum from adjoining pelvic tissue and trim surrounding muscle from the colon.",
    "Place the full-length colon (from cecum to rectum) into a beaker containing physiological saline (previously oxygenated with carbogen) and continue to oxygenate at RT. Remove the caecum and rectum using fine dissecting scissors and replace in beaker.\nEmpty fecal pellets/intestinal content from colonic preparations by applying gentle positive pressure at the oral end using a 5 ml syringe attached to a 200 µl pipette tip filled with physiological saline. In order to orientate the tissue in future, use an insect pin to mark the most proximal end of the colon, where striations in the mucosa are visible.\n\t\nModify the plastic pipette tip to fit the 5 ml syringe by removing approximately 1 cm of the widest/proximal end using a razor blade. To increase the flow rate, widen the distal/smaller end by cutting on an angle (approximately 45 °C) using a razor blade.\nGrip the colon tissue gently at its proximal end with dissecting forceps, insert the pipette tip into the lumen of the colon and flush physiological saline through the lumen.\n2. Preparation of Colonic Tissue and Experimental Set Up for Video Imaging\nFlush physiological saline through all tubing attached to a two chambered organ bath set up (Figure 1 and Figure 3), using a syringe attached to a 200 µl pipette tip. This step removes any debris within the tubing that could block the flow of solution. For tubing specifications refer to the materials table.\nEnsure that the chambers of the organ bath are continuously superfused with physiological saline bubbled with carbogen (95% O2 and 5% CO2, flow rate of 5 ml min-1). Using a temperature probe at regular intervals, ensure that the temperature of the bath is maintained between 33 °C -37 °C.",
    "Fill the inflow reservoir connected via a 3-way stopcock to the inlet tube with approximately 20-30 ml physiological saline using a 50 ml syringe.\nDuring the experiment, maintain the pressure in the inflow reservoir using arubber stopper with a glass tube (5 mm inside diameter) inserted through its center. Make sure that the upper opening of the inflow reservoir is securely sealed (with the inner glass tube remaining unsealed).\nPlace the colon (length 5-7 cm) into the organ bath chamber, making sure that it is fully submerged in physiological saline.\nCannulate each end of the colonic segment to the two submerged inlet/outlet tubes (inlet/outlet tubes of different diameter can be changed according to the size of the tissue lumen eg. postnatal tissue, adult mice and guinea pig) in the bath using standard cotton sewing thread. Attach the proximal end of the colon to the inlet tube and the distal end of the colon to the outlet tube (connected via a 3-way stopcock to a vertical outflow tube; 6 cm in height). Make sure that the tissue is not overstretched or too relaxed after cannulation to avoid interference with future measurements and analysis.\nRecord the length of the colon by measuring the distance between the proximal and distal cannulations using a 15 cm ruler. This is important for interpreting changes in contraction length, propagation speed and contraction initiation points.\nEnsure a stable baseline luminal pressure (cm H2O) is established before beginning the experiment. Calculate luminal pressure by measuring the vertical distance from the tissue to the meniscus of physiological saline within the glass tube of inflow reservoir (oral) and the vertical outflow tube (anal).",
    "Maintain tissue preparations at a constant intraluminal pressure (e.g., 1-2 cm H2O) by ensuring that the inflow stopper seal pressure is kept constant and that no blockages are present in the set up.\nLeave the colon to equilibrate in physiological saline for 30 min before recording intestinal movements. Check for any blockages arising in the in- or outflow tubes and remove them by applying pressure through the inflow reservoir or by re-cannulating the oral and anal ends of the colon.\n3. Image Capture and Experimental Protocol\nRecord intestinal movements as video files using a video camera (30 frames/sec, 640 x 840 pixels) positioned 10-15 cm above the organ bath on a standard laboratory retort stand (Figure 1).\nOpen Virtual Dub (video capture software) from the icon on the desktop. From the 'File' tab, select 'capture AVI' to view the camera image. On the 'Audio' tab deselect 'enable audio capture' to disable sound.\n\t\nIn the video tab select 'compression' and 'DivX6.9.2. Codec' to compress video files to minimize usage of storage space. This function will become available upon the installation of the compression software 'DivX'.\nManually adjust the camera location so that the entire cannulated colon segment is visible (with cannulated regions immediately adjacent to the vertical edges of the video frame) via the video capture software window (see Figure 1). In order to improve image quality and minimize reflections, attach a paper/cardboard shield to the camera support to block extraneous light onto the organ bath. Optimize video quality by adjusting the brightness, contrast and exposure settings using the camera software interface.\n\t\nBefore recording, set a specific file name; in the 'File' tab, select 'Set capture file' and specify a unique name for the video.",
    "Begin capturing video by pressing 'Capture file' from the 'Capture' tool bar. To stop recording select the 'Stop capture' button or the 'Esc' key on the keyboard.\nReplace the physiological saline contained within the inflow reservoir with fresh physiological saline every 30 min.\n\t\nRecord luminal pressure (see 2.9) and using a temperature probe, take note of the organ bath temperature. Repeat these steps throughout the experiment (i.e., every 30 min) to ensure that these variables are constant.\nRecord colonic activity in total for 3 hr (including drug application and washout duration). For data storage purposes, record data in 15 min video segments. A full experiment will typically be composed of 12 x 15 min video recordings.\n\t\nRecord activity for 1 hr under control conditions (physiological saline).\nApply the drug (either superfused into the bath or administered into the lumen via the inflow reservoir) for 30 min to 1 hr.\n\t\tNote: Different routes of administration can yield different effects23.\nApply fresh physiological saline to the bath or lumen during a 1 hr washout period.\n4. Data Processing and Generation of Spatiotemporal Maps\nProcess each video recording offline using in-house software written in MATLAB (R2012a, Version 7.4; available on request) in order to generate spatiotemporal maps illustrating colonic motility.\n\t\nOpen analysis software from the icon on the desktop.\nIn the command window, enter \"Analyse2\" in order to open the analysis control panel.\nUtilize the edge detection function to generate spatiotemporal maps by clicking \"Edge detection for .avi files\" in the control panel window. This function will enable the analysis software to read the recoded videos in Audio Video Interleaved (AVI) format.\nCarry out the following steps sequentially to generate spatiotemporal maps using an adaptive edge detection algorithm.",
    "Open recorded video files by selecting the \"Add files\" tab, select 'Open video' and select the location of the video files.\nFrom the video files listed within the analysis software, select the file of interest.\nSelect a rectangular region of interest within the frame of the video, e.g., the entire length of the colon, from the point at which the colon is cannulated orally to the anal cannulation. Ensure that the proximal and distal cannulation points are adjacent to the vertical boundaries of the region of interest. Edge detection lines (red and green) will automatically appear superimposed on the real time image.\nEnsure that the edge detection threshold lines are immediately adjacent to the colon on both the upper and lower boundaries of the colon tissue (this can be optimized for each video by altering detection threshold values on the control panel). Ensure that the edge detection lines are continuous along the length of the colon image by adjusting the contrast and brightness using the control panel.\nEnter the full length of the colon (mm) into the width dialog box (as recorded in step 2.7). Then select \"Generate heat map\".\nIn the pop up window, select a location for the file to be saved and specify a file name for the spatiotemporal map.\nSelect the '.su2' format and select 'Add to queue'.\n\t\tNote: .su2 format compresses data to a smaller file size and multiple video files can be added to the queue.\nSelect 'Begin detection' to generate spatiotemporal maps.\n5. Analysis of Spatiotemporal Maps\nUtilize spatiotemporal maps to estimate parameters such as frequency, propagation speed, length and duration of CMMCs, gut diameter and the point of initiation and direction of contractions.",
    "To start analyzing spatiotemporal maps, type 'analyse2' in the command window as described in the previous section. Instead of \"Edge detection\", select the \"Heat map analysis\" button.\nOpen spatiotemporal map files (.su2 files) by selecting the 'Add files' tab and specifying the location of previously obtained .su2 files.\nOnce the spatiotemporal map is visible on the screen, specify a color range on the control panel, ensuring that the minimum is set to 1.\n\t\tNote that the maximum can range from 5-10 according to the contractility of the tissue.\nSelect 'Lock color range' to ensure all the maps from a single experiment are analyzed under the same conditions.\nEnsure that the time frame settings are constant for all spatiotemporal maps from a given experiment.\nIn order to determine CMMC frequency, manually count contractions that traverse more than 50% of the length of the colon. These contractions can be visualized as red/orange streaks (standard HSV color index) on the spatiotemporal map (see Figure 2 for an example). Other contractions that are shorter or do not propagate can also be identified and quantified.\nIf desired, conduct further analysis at a higher resolution from these maps. For example, detailed properties including the speed and duration of each contraction can be examined.\n\t\nIn order to measure the speed and duration, select the \"Annotate contraction waves\" button on the heat map analysis control panel.",
    "Next, zoom in to each CMMC by clicking on the \"Zoom\" button and selecting the area of interest. Then select the \"Manually annotate\" button to annotate each contraction by using the mouse to draw a line from the most initial position to the end of each contraction. This method can be used to measure the apparent propagation speed and duration of dilations that appear to propagate (for e.g., see anal end of maps in Figure 2A, 2B).\n\t\tNote: The data for speed and duration will appear under the results window. These values can be transferred to a spreadsheet of interest by selecting the \"Export data\" tab. Unwanted annotations can be removed by clicking on the \"Remove selected annotations\" button.\nIf desired, utilize the x and y coordinates of the spatiotemporal maps (time and position along the colon, respectively) to determine the position of initiation of small contractions or CMMCs.\nSimilarly, in order to determine intervals between contractions, use the \"Annotate\" function to measure the duration between contractions. As previously, these results can be exported to a spreadsheet by selecting the \"Export data\" tab.\nIn order to measure the resting gut width, select the \"Take cross section\" button on the Heat map analysis panel.\n\t\nSelect 'Add' on the temporal cross sections panel. Double click at any location within the map to generate a horizontal line superimposed on the heat map. Gut diameter data will now be displayed in a new window.\nTo measure gut diameter, place the cursor on a peak and adjacent trough to obtain average gut width for a specific experimental condition. Changes in gut diameter can be compared between experimental conditions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}