{
  "id": 10249,
  "origin_website": "Jove",
  "title": "An Experimental Paradigm for Measuring the Effects of Ageing on Sentence Processing",
  "procedures": [
    "The experiment was approved by the Ethics Committee of Beijing Foreign Studies University and it complied with the guideline for experiments with human subjects. All participants in the experiment provided written informed consent.\n1. Stimuli Construction\nConstruct experimental stimuli on the basis of the specific experimental questions. This protocol is intended to explore the effect of ageing on online sentence processing during reading, and as such, the visual stimuli used in the experiment are two types of RCs, namely SRCs and ORCs, which are the structures most frequently used in the studies of sentence processing by older adults.\nPrepare at least 24 experimental sentences with twelve sentences in each condition and at least 24 fillers that are of various length and structures. The number of fillers can be increased to up to three times of the experimental sentences. The experimental sentences should be counterbalanced across the two conditions.\nNOTE: As our study focused on the processing of Mandarin sentences, all the sentences used in the experiment were in Mandarin Chinese. However, the protocol reported here may be also applicable to other languages.\nPlausibility rating: Invite at least 30 participants to rate the semantic plausibility of the experimental sentences using a five-point Likert scale with scores from ''1'' (the least plausible) to ''5'' (the most plausible). Make sure the group is similar to the participants in age, gender ratio and education. Make sure they do not take part in the subsequent experiment. Ensure the sentences used in the study are all semantically plausible (>3) and semantic plausibility does not differ significantly between different experimental conditions.\nNOTE: In our study, 15 older adults and 15 younger adults were invited to participate in the plausibility rating (Mage = 43.6, SD = 24.1; Female 16, Male 14).",
    "For each word in the experimental sentences, provide an ungrammatical alternative. In this way, prepare a pair of words for each segment of the sentences, with one of them being the grammatical continuation of the sentence and the other is not. Match the two alternatives in lexical frequency. Participants are expected to choose between the grammatically correct word and the grammatically incorrect one (See Figure 1 for sample sentences in English). An experimental sentence used in this study is shown in Figure 2.\nRandomization and design. Randomize the sentences and the positions of the two alternatives in the sentences before presenting them to participants. Find the Selection tab of the Property Page in the stimulus presentation software (see Table of Materials) and set the selection method to Random.\nDivide the experiment into blocks with each lasting for no more than 10 min.\nNOTE: In the study, the experiment consisted of two blocks with 24 sentences in each block. Each block lasted for about 5 min.\nAllow participants to have a break between two blocks. Breaks for about 5 min can be helpful for younger adults. Allow longer breaks for older adults to ensure they can recover from fatigue.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60417/60417fig2b.jpg\nFigure 2: Example of two experimental sentences. This figure shows that participants were presented two Chinese words in each frame and were required to choose the one which can grammatically continue the sentence. The words on the frame are Chinese characters with the English equivalents provided in parentheses. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60417/60417fig2blarge.jpg]\n2. Participant Screening and Preparation for the Experiment",
    "Recruit participants who are native speakers of the language tested. Ensure participants have normal or corrected-to-normal vision. Invite at least 30 younger adults and 30 older adults. Match the two age groups in years of education and gender ratio.\nAsk participants whether they have had neurological, psychiatric or communication disorders before. Exclude the ones who report any history of these diseases.\nTo ensure older participants recruited are cognitively healthy, have them complete the Global Deterioration Scale22 before the experiment as a way of screening. Exclude the participants who score above level two.\nInform the participants that they should be free from exhaustion, hunger, illness or other conditions that make them uncomfortable on the day of the experiment.\nInvite the participants individually or in groups to the laboratory room.\n3. Procedure\nTake participants to the laboratory room and instruct them to sit down at the computer workplaces.\nAsk the participants to read and sign the written informed consent forms. Exclude the participants who cannot provide informed consent for any reason.\nProvide verbal instructions to the participants to ensure they are clear about the requirements of the task. Ask participants to choose between the two words or phrases on the computer screen to form a grammatical continuation of the sentences. Inform them that their responses will be timed, so they are expected to respond as quickly and as accurately as possible.\nProvide the written instruction to the participants and ask them to read it carefully. Answer any questions participants may have about the instructions. Present the following message on paper or on computer screen in participants' native language:",
    "\"In this experiment, you will read a number of Chinese sentences. However, the sentences will be presented one word at a time. On each screen, two words will be presented and you need to choose the word which can grammatically continue the sentence as quickly as possible. If you choose the word on your left hand side, please press the F button on the keyboard and if you choose the word on the right, please press J. Please respond as quickly as possible. If you fail to respond in ten seconds, the next trial begins. If you have no further questions, press any key to start practice.\"\nAsk the participants to complete a small number of practice questions to ensure they understand how to perform the task. Provide participants with feedbacks after they have made their choices regarding which of the two phrases is the grammatical continuation of the sentence. To minimize the disturbance to the natural reading process, only provide feedback when incorrect answers are detected. The feedbacks are short phrases (\"incorrect\") in the participants' native language, which are visually presented on the computer screen.\nWhen participants complete the practice questions, ask them to make a choice as to whether they would like to redo the practice. If they press the button p on the keyboard, the practice session starts all over again and if they press the space bar, the practice session is over and the experimental session begins. Allow them to redo the practice as many times as possible until they are familiar with the procedures of the task. Provide them assistance whenever they encounter any difficulties during the practice session.\nAllow the participants to perform the required experimental task when they are clear about the experimental procedures.",
    "Present the items on the computer screen as black letters on a white background.\nHave participants read the items and for each segment, choose between the two words placed side by side on the screen with a press of the button on the keyboard (F button for the word on the left and J button for the word on the right).\nIf participants choose the correct answer, present the next pair of words. When they choose a wrong answer, have the sentence terminate and have the next one appear.\nAdminister the digital span task from the Wechsler Memory Scale23 to assess participants' working memory span. Test participants individually.\nAsk participants to listen to a sequence of digits (1-9) that are presented auditorily at the rate of one digit per second.\nAsk participants to repeat the digit sequence in the same order.\nStart from short strings and increase the string length one digit at a time. Stop the test when participants make errors at two trials at a given length.\nRecord participants' responses on the record form. Use a digital recording device to record participants' responses.\nAsk participants to complete the questionnaires about their background information, such as age, gender and years of education. Prepare participants' payment during the questionnaire.\nProvide participants monetary compensation for their participation.\nNOTE: In our experiment, each participant was paid 20 RMB (about USD$3) for their participation. The amount of payment may vary in different experiments. Other approaches can also be used to motivate participants such as rewards.\n4. Data Analysis\nObtain the RTs (ms) for each word in the sentences from the output files of the presentation software.",
    "Exclude the RTs for the trials that are responded incorrectly from data analysis. In order to reduce the influence of outliners on the results, exclude the RTs above three standard deviations from the means for each participant in each condition.\nAnalyze the RTs for the regions of interest in the sentences, using repeated measures ANOVA with RTs as the dependent variable and age group (old, young), type of sentence (SRC, ORC) and region (1-6) as independent variables.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}