{
  "id": 9558,
  "origin_website": "Jove",
  "title": "Atomic Scale Structural Studies of Macromolecular Assemblies by Solid-state Nuclear Magnetic Resonance Spectroscopy",
  "procedures": [
    "1. Solid-state NMR sample productiona\nProduction of uniformly 13C/ 15N-labeled protein subunits\nUse freshly transformed, pET24-peptide-6his plasmid-containing E. coli BL21 (DE3) cells, harvest them from the prepared agar plate.\nInoculate a 15 mL pre-culture of pre-warmed LB medium with one colony. Incubate at 37 °C with 200 rpm shaking overnight.\nTransfer the pre-culture into 1 L of the main culture of pre-warmed M9 medium (see composition in Table 1), containing the required isotope-labeled carbon and nitrogen sources.\n\t\tNOTE: This can be uniformly 13C-labeled glucose, selectively (1-13C)- or (2-13C)-labeled glucose 29,30,31 or (1,3-13C)- or (2-13C)-labeled glycerol32,33.\nIncubate this at 37 °C and measure the OD600 as soon as the culture becomes turbid. When the OD600 has reached a value of 0.8, induce protein expression with 0.75 mM IPTG for 4 h.\n\t\tNOTE: The optimal induction conditions can vary from one protein to another.\nRecover the cells by centrifugation for 30 min at 6000 x g and 4 °C.\nPurification sketch (not shown in the video protocol)\n\t\nLyse cells using standard techniques such as sonication or lysozyme treatment and purify the protein subunit using techniques established or adapted for the investigated protein assembly.\n\t\tNOTE: The protein can be expressed in inclusion bodies, check for the protein localization by cell lysis and subsequent centrifugation. If the protein is found in the sediment with the cell debris, it has been accumulated in inclusion bodies.\nTest expression and purity of the protein sample for example by a standard 12-15% Tris-Tricine SDS-PAGE, see Figure 2A. If the purity is sufficient, the protein can be assembled, otherwise perform a supplementary purification step.\nIn vitro assembly of the protein filaments",
    "Check protein concentration in the purified solution. If the protein contains absorbing residues, measure the absorption in a UV spectrophotometer at 280 nm. Insert the pure buffer into the spectrophotometer as calibration and measure then the protein absorbance.\nCalculate the protein concentration using the absorption coefficient of the protein subunit with the adapted Beer-Lambert law: Aλ=ελ x l x c; here A is the optical density at a given wave-length λ; ε is the specific absorption coefficient; l is the length of the optical trajectory in cm; c is the concentration in mol/L.\nConcentrate the protein to a concentration of 1 mM in a centrifugal filter unit. Introduce the sample into the centrifugal filter unit and centrifuge at 4000 x g for 30 min, mix the solution in the filter unit gently with a pipet to avoid protein deposition at the filter. Repeat the procedure until the desired concentration is reached.\n\t\tNOTE: The optimal assembly concentration depends on the system and needs to be optimized (usually between 0.1 - 1 mM). If an equimolar mixed labeled sample of two different labeled protein batches is prepared (e.g. (50/50) (U-15N)-/(U-13C)-labeled), mixing must take place either before or right after the concentration step to ensure homogenization of the mixed solution.\nTransfer the sample into a tube and incubate it under agitation for one week at room temperature.\nUsually the polymerization of the subunits into filaments is accompanied by the solution becoming turbid. Check the microscopic fibril morphology and homogeneity for example by electron microscopy (magnification 6300X - 45000X), see Figure 2B.\nCentrifuge the sample for 1 h at 20000 x g and 4 °C. Remove the majority of the supernatant, leave only enough liquid to cover the surface to avoid sample drying. Check the supernatant for non-assembled subunits on the UV spectrophotometer.",
    "Wash the sample by adding H2O and careful resuspend the content with a pipette. Do not vortex. Spin the sample for 30 min at 22000 x g and 4 °C. Repeat the washing step 3 times. Check during all washing steps if the pellet preserves its aspect after centrifugation and check the supernatant for non-assembled subunits on the UV spectrophotometer.\nAdd 0.02% (w/v) sodium azide (NaN3) to avoid bacterial contamination and store the sample until measurement at 4 °C.\nSolid-state NMR rotor filling\nCentrifuge twice for 30 min at 22000 x g and 4 °C. Remove maximum amount of the supernatant; the resulting sample consistency depends on the protein assembly, and is usually a gel-like deposit.\nUse a capillary pipet to insert the sample into the SSNMR rotor.\n\t\tNOTE: Here, we present the procedure on a 4 mm diameter rotor.\n\t\t\nCentrifuge the rotor on a table centrifuge to gently introduce the sample into the rotor. Repeat the procedure until the rotor is filled up. Keep minimum space to close the rotor with the rotor cap. If the sample quantity is not sufficient, introduce a commercially available insert to fill up the remaining space to ensure the sample distribution homogeneity in the rotor.\n\t\t\tNOTE: Dependent on the assembled sample consistency, it might be more adequate to use a thin spatula, especially for very dense samples. Rotors with diameters of 2.5 to 4 mm are used at moderate MAS frequencies.\nAdd traces of 4,4-dimethyl-4-silapentane-1-sulfonic acid (DSS) for internal chemical shift and temperature calibration.\nClose the cap with a closing device.\nCheck under a magnifier if the cap is well inserted and completely closed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55779/55779fig2v3.jpg",
    "Figure 2: Representative results for protein subunit purification and assembly. A) 15% Tris-tricine SDS-PAGE of protein subunit (including His6-tag) at different stages of purification. Lane 1 - Protein molecular weight marker; lane 2 - E. coli BL21 (DE3) cells uninduced control; lane 3 - E. coli BL21 (DE3) cells induced with 0.75 mM IPTG; lane 4 - solubilized inclusion bodies lane 5 - supernatant fractions of cell lysate; lane 6 - purified fraction after Nickel immobilized metal affinity chromatography (IMAC) FPLC and desalting. B) Negatively stained protein fibrils by TEM imaging. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/55779/55779fig2v2large.jpg]\n2. Preliminary structural characterization based on one-dimensional (1D) solid-state NMR\nInitial set-up and 1D cross-polarization (CP)\nInsert the rotor into the NMR magnet\nStart to spin the rotor at a frequency of 5 kHz and wait for a stabilization of ±10 Hz, then accelerate until 7 kHz. Tune and match 1H, 13C and 15N channels. Set the temperature to 2-10 °C (275-283 K); sample heating at 7 kHz MAS is low and temperature adjustment is usually not required at this MAS frequency.\nRecord a single-pulsed 1D 1H spectrum using 16 scans.\n\t\tNOTE: Power levels must have previously been optimized on a reference compound (such as a 13C/15N histidine or glycine),to provide starting values for optimizing the power levels in the experiments on the target sample; this procedure is a routine task and therefore out of scope in this protocol.\nKeep the temperature during all experiments between 2-10 °C, in hydrated samples the temperature is reflected in the relative shift of the bulk water 1H resonance with respect to the DSS signal34. Measure the temperature following the relationship δ(H2O) = 7.83- T/96.9 with a precision of 1 - 2 °C35.",
    "Set up the desired MAS frequency and wait until stabilization of ±10 Hz.\n\t\tNOTE: Here it is demonstrated for a frequency of 11 kHz.\nTune and match 1H and 13C channels again and adjust the temperature with the help of a 1D 1H experiment.\nSet up a 1D 1H-13C CP36.\n\t\tNOTE: CP experiments show the signals arising from residues in a rigid conformation. Pulse calibration and decoupling parameters can be directly optimized on the sample when the sensitivity is high enough to observe signals after less than ~32 scans. The initial optimization values are taken over from the standard optimization on a reference compound. CP contact time and power levels are chosen based on maximal signal intensity. In protein samples, the optimal CP contact time is usually between 200 µs and 2 ms. The decoupling parameters should also be re-adjusted from the calibration on a reference compound.\n\t\t\nCarefully observe the localization of spinning sidebands at the given MAS frequency.\nRecord a reference 1D 13C CP spectrum that serves as 1D spectral fingerprint. Typical parameters are 128 scans, 1 ms CP contact time, 100 kHz decoupling strength, a recycle delay of 3 s and 25 ms of acquisition.\nCalibrate the 1H and 13C chemical shifts following the IUPAC recommendations37. Determine the resonance frequency of the 1H DSS signal (chemical shift of 0 ppm); 13C chemical shifts are referenced to 1H shifts (usually ~0.25144, derived from the ratio of the 13C to the 1H resonance frequency37).",
    "Process the 1D 1H-13C CP experiment without apodization function (see Figure 3A and B for the detection on a homogeneously well-ordered protein assembly). Choose an isolated peak to estimate the linewidth in the sample, indicative of structural order and homogeneity. Typical 13C linewidths for well-ordered biological protein assemblies under MAS at high magnetic fields range between 20 - 150 Hz (measured as the full-width at half-height (FWHH)).\nEstimate the signal-to-noise (S/N) ratio in the CP spectrum.\n\t\tNOTE: The S/N ratio depends on many factors, including mainly the amount of sample in the rotor, the degree of rigidity of the protein structure and the presence of a single molecular conformation. As a rule of thumb, a sample should be suitable for multidimensional SSNMR spectroscopy if a signal is observed in an optimized 1D 1H-13C CP spectrum recorded with 64 scans.\nZoom into the spectral region of the protein backbone carbonyl resonances (mainly) localized between 165 - 180 ppm. Estimate the secondary structure content in the assembly by the position of the protein backbone carbonyl resonances with resonances from residues in α-helical or β-strand conformation shifted downfield or upfield, respectively (see Figure 3B for a mostly α-helical subunit)38.\n1D INEPT experiment\nSet up a 1D 1H-13C INEPT experiment to probe highly mobile parts (sub-µs) of the protein assembly.\n\t\tNOTE: GARP decoupling of a few kHz during acquisition39 is commonly used, to allow for short interscan delays (typically 1 s) without damaging the probe.\nRecord a reference INEPT spectrum that serves as fingerprint for the mobile protein segments; typical parameters are 128 scans and an acquisition time of 25 ms.\nProcess the 1H-13C INEPT experiment. The amount and the positions of the signals are indicative of the amount of mobile residues and the amino acid composition respectively.",
    "NOTE: Also record a 2D 1H-13C INEPT experiment if signals are present in the 1D INEPT spectrum (see Figure 3C for an example) to permit a more specific amino acid identification. In ambiguous assignment cases, we recommend checking the buffer component signal positions by solution NMR.\nUse the BMRB database40 and published data38 to assign the resonances to their corresponding amino acid in near random coil conformation; the spectrum contains only mobile buffer components if no residues are in a highly mobile regime.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55779/55779fig3v2.jpg\nFigure 3: Representative results of SSNMR spectra acquisition for a well-structured protein assembly. A) 13C-detected FID of a 1H-13C cross-polarization experiment. B) 1H-13C cross-polarization experiment. C) 1H-13C INEPT experiment of a rigid protein assembly; only buffer components are visible. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/55779/55779fig3large.jpg]\n3. Conformational analysis and 3D structure determination\nSequential resonance assignment\nSet up a 2D 13C-13C proton-driven spin diffusion (PDSD)41 experiment to detect intra-residue 13C-13C correlations, including side chains. Take over the values for the initial 1H-13C cross-polarization step from the 1D 1H-13C CP experiment.\n\t\t\nSet the mixing time to 50 ms for uniformly 13C-labeled samples and to 100 ms for selectively 13C-labeled samples. Set the indirect acquisition time between 5 - 25 ms and the direct acquisition between 15-25 ms dependent on the intrinsic spectral resolution, which can be estimated by the visible signal in the Free Induction Decay (FID) length (exemplified in Figure 3A).\nTest several processing parameters to find optimal values with respect to signal-to-noise and resolution in the spectrum, typically adequate processing can be achieved using a qsine window function with a sine bell shift (SSB) of 2.5-4.",
    "Set up, record and process a 2D 13C-13C PDSD with an intermediate mixing time experiment to detect sequential 13C-13C correlations connecting mostly i - i±1, but also i±2 and i±3 residues, depending on protein backbone rigidity and secondary structure elements. The mixing time should be set between 100-200 ms for uniformly labeled samples. All other values can be taken over from the short mixing time 2D 13C-13C PDSD.\nSet up, record and process a 2D 15N-13C NiCAi and NiCOi experiment using a CP 1H-15N and a specific CP 15N-13C transfer42. Optimize the 15N-13C polarization transfer in a 1D fashion directly on the sample of interest, based on maximal intensity in the CA or carbonyl region, respectively. Typical values for the specific CP contact time are between 2-6 ms.\nSet up, record and process a series of 2D 15N-(13C-)13C experiments for the assignment purpose.\n\t\tNote: The first 15N-13C polarization transfer parameter value can be taken over from the NiCAi / NiCOi experiments. Intra-residue correlations are established from Ni(CAi)CBi and Ni(CAi)COi, using respectively DREAM43 and PDSD 13C-13C polarization transfers. The residue (i) to residue (i-1) sequential connectivity is obtained from Ni(COi-1)CAi-1 and Ni(COi-1)CXi-1 experiments, both using a PDSD 13C-13C polarization transfer.\nChoose an NMR analysis program such as CcpNmr analysis44 or SPARKY45\nLoad the 2D spectra into the software (exemplified with CcpNmr analysis) and load the primary protein sequence.\nStart with the identification of the amino acid types visible in the short-mixing 13C-13C PDSD spectrum. Connect the carbon atoms of the spin systems to allow for the \"residue-type\" specific assignment; see Figure 4A for the assignment of a Threonine residue. Identify as many residues as possible; this will depend on the protein subunit size, the spectral resolution and dispersion.\nOverlay the short-mixing with the intermediate-mixing 13C-13C PDSD spectrum.",
    "NOTE: The supplementary peaks visible in the intermediate-mixing PDSD arise mostly from sequential (residue i - residue i±1) contacts. An example for a two-residue sequential assignment is illustrated in Figure 4B.\n\t\t\nMark the resonance peaks of a spin system and find correlations in the intermediate-mixing PDSD with resonance frequencies of other spin systems. In small proteins or peptides, it can be possible to achieve the entire sequential resonance assignment based on 2D 13C-13C PDSD experiments.\n\t\t\tNOTE: In β-strand secondary structure motifs residue i - residue i±2 13C-13C contacts might show more intense signals than sequential contacts due to their proximity in space; in α-helical secondary structure motifs residue i - residue i±3 13C-13C contacts can also lead to intense signals.\nIf intermediate-mixing PDSD experiments on selectively 13C-labeled samples are available, overlay them onto the short-mixing spectrum (if available on the selectively 13C-labeled sample) and assign the supplemental peaks, taking into account the selective 13C labeling pattern (1,3-13C and 2-13C glycerol32,33 or 1-13C and 213C glucose29,30,31.\n\t\tNOTE: For example, in a 2-13C glycerol labeled sample several amino acid types are labeled on the Cα position without the adjacent carbons (Cβ and C') labeled, therefore favoring the Cα-Cα transfer between adjacent residues. In selectively labeled samples, long-range 13C-13C correlations might build up already in intermediate-mixing 13C-13C PDSD experiments. If a peak cannot be explained by a sequential correlation, it could arise from a long-range contact. For highly ordered homogeneous subunit structures in the macromolecular assembly, only one set of resonances is expected to be visible in the spectra. If doubled (or further multiplied) resonances are visible for 13C atoms or protein backbone stretches, two (or more) conformations for the atom or the primary sequence stretch in the assembly, respectively, exist.",
    "Use the 2D NCA spectrum containing intra-residue 15N-13Cα correlations to identify the 15N resonance frequencies for each residue. If the resolution in the 13C dimension is not sufficient, use the supplementary information about the Cβ resonance in the 2D NCACB to identify the intra-residue 15N resonance frequency.\nUse the 2D NCACB and NCACO spectra containing intra-residue 15N-13C-13C correlations to (i) identify the intra-residue 15N frequency and (ii) to resolve ambiguities in the 13C-13C PDSD with the help of the additional 15N dimension. The inversion of the signal due to the DREAM transfer leads to the observation of typical Cα-Cβ correlations for which the Cα signal is positive and the Cβ signal negative. Further side-chain 13C, if visible in the spectrum, are positive again.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55779/55779fig4v3.jpg\nFigure 4: 2-dimensional 13C- 13C SSNMR PDSD experiments on a well-ordered, uniformly 13C, 15N-labeled protein assembly. A) Short mixing time PDSD (50 ms mixing). B) Assignment of the 2-residue stretch Ile32 - Thr33 using the overlay of the short mixing time PDSD with a long mixing time PDSD (200 ms mixing). Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/55779/55779fig4v2large.jpg]\nSecondary structure determination\nUse 13Cα, 13Cβ chemical shift values to calculate the secondary chemical shift 46ΔδCα-ΔδCβ, indicative of the secondary structure. Calculate 13Cα(assigned)-13Cα(random coil) and 13Cβ(assigned)-13Cβ(random coil).\n\t\tNOTE: Chemical shift values for residues in random coil conformation can be obtained from38.\n\t\t\nPlot ΔδCα-ΔδCβ, negative or positive values for > 3 residues in a row indicate β-strand or α-helical conformation respectively; glycine and proline residues might show unusual chemical shift values, as they often act as \"secondary structure breakers\".",
    "Predict the protein dihedral angles from the assigned chemical shifts using TALOS+47,48 or PREDITOR49,50. The predicted Phi/Psi dihedral angles reflect the secondary structure of the protein subunit and are used as structural restraints throughout the modeling process.\nCollection of structural restraints\nSet up and record a 2D 13C-13C PDSD experiment with a long mixing time to detect long-range 13C-13C correlations. Typical mixing times range from 400 ms to 1 s. Use selectively 13C-labeled samples, as the spin dilution greatly improves the polarization transfer among distant carbons.\nOverlay the long-mixing 2D 13C-13C PDSD recorded on selectively labeled sample onto the intermediate-mixing 13C-13C PDSD, if possible recorded on the same selectively labeled sample. Supplemental peaks arise from correlations between more distant 13C atoms. During resonance assignment, take into account the selective labeling scheme.\nCarefully evaluate the resolution of the spectrum to define an assignment tolerance window, i.e. dependent on the spectral resolution resonances in a certain ppm range this can contribute to the signal. The standard deviation of the assignment precision is automatically calculated in NMR assignment programs such as CcpNmr analysis or SPARKY.\nIf a signal can be explained by a sequential (residue i - residue i±1) or a medium-range 13C-13C contact (residue i - residue i ± 2, 3 or 4), maintain this assignment since relayed polarization transfer can explain the correlation even if the 13C-13C distance is above the expected visible contact range.\nClassify the assignments of long-range 13C-13C contacts into frequency unambiguous and ambiguous signals. In the case of frequency unambiguous assignments, only one resonance assignment is possible with respect to the assignment tolerance window.",
    "NOTE: Ambiguous assignments contain all possible resonance assignments within the tolerance window. The ambiguities can be lifted simultaneously during the structure calculation by iterative rounds of disambiguation based on preliminary structures calculated using only the unambiguous restraints, as performed in computational routines such as ARIA51 or UNIO52. Furthermore, structural data from different biophysical sources (e.g. mutated or truncated subunit structure by solution NMR or X-ray crystallography, mass-per-length measurements, cryo-EM map) can also be used to reduce the level of ambiguity, for examples see 1,3,53,54,55,56,57,58.\nDetection of intermolecular distance restraints in a symmetrical protein assembly\nSet up a 2D 15N-13C PAIN-CP59 experiment on a mixed (50/50) U-15N- / U-13C-labeled sample. Signals detected on the PAIN-CP spectrum should arise from inter-molecular 15N-13C proximities. Use the previously assigned resonances to perform the assignment of the intermolecular contacts.\nSet up a 2D 13C-13C PDSD with a long mixing time (>600 ms) on a (50/50) mixed (1,3-13C)- / (2-13C)-glycerol or (1-13C)- / (2-13C)-glucose sample.\n\t\tNOTE: Signals detected in this 13C-13C spectrum arise from intra-molecular and inter-molecular 13C-13C proximities. However, the high complementarity of the two labeling schemes lets particular resonance pairs arise unambiguously from inter-molecular contacts, e.g. a Serine CA in the (2-13C)-glucose labeled subunits that correlate a Serine CB in the (1-13C)-glucose labeled subunits.\n\t\t\nOverlay the spectrum of the mixed sample to the 2D 13C-13C spectra recorded on homogeneously labeled samples ((1,3-13C)- and (2-13C)-glycerol or (1-13C)- and (2-13C)-glucose labeled samples). Additional signals in the spectrum recorded on the mixed sample should arise from inter-molecular interactions.\nStructure modeling from SSNMR data",
    "Prepare the SSNMR restraint lists needed for the structure calculation: (1) protein sequence; (2) intra-molecular unambiguous distance restraints; (3) intra-molecular ambiguous distance restraints; (4) TALOS-based dihedral angle restraints; (5) inter-molecular unambiguous distance restraints; (6) inter-molecular ambiguous distance restraints; (7) additional data from other biophysical techniques (e.g. mass-per-length, symmetry parameters).\nSeveral reviews provide insights into structure modeling based on SSNMR data and in conjunction with complementary structural data 14,60,15,19,61,62 Note that the ambiguous distance restraints can be disambiguated during structure calculation with respect to the preliminary structural models based on unambiguous distance restraints. To ensure structure accuracy, carefully observe if the structure converges to a single fold.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55779/55779fig5v3.jpg\nFigure 5: Intra- and intermolecular contacts in symmetric protein assemblies. Schematic representation of intra- vs. intermolecular 13C-13C long-range contacts in a helical macromolecular assembly. The subunits are colored in white and red to illustrate the mixed labeling of the subunits; i.e. before assembly a 1:1 mixture of two different labeling schemes was performed (e.g. 1-13C glucose and 1-13C glucose). A) Intramolecular 13C-13C long-range contacts (blue dashed arrow); B) intermolecular 13C-13C long-range contacts (red dashed arrows). Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/55779/55779fig5v2large.jpg]"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}