{
  "id": 11169,
  "origin_website": "Jove",
  "title": "Nanotopology of Cell Adhesion upon Variable-Angle Total Internal Reflection Fluorescence Microscopy (VA-TIRFM)",
  "procedures": [
    "1. Seeding and Incubation of Cells\nSeed individual cells, e.g. U373-MG or U-251-MG glioblastoma cells at a typical density of 100 cells/mm2 on a glass slide and grow them for 4872 hr in culture medium (e.g. RPMI 1640 supplemented with 10% fetal calf serum and antibiotics) using an incubator at 37 °C and 5% CO2.\nIncubate cells with a membrane marker, e.g. 6-dodecanoyl-2-dimethylamino naphthalene (laurdan) applied for 60 min at a concentration of 8 μM (in culture medium)4, or a cytoplasm marker, e.g. calcein acetomethlyester applied for 40 min at a concentration of 5 μM3, or a membrane associated photosensitizer, e.g. protoporphyrin IX induced upon 4 hr incubation with its precursor 5-aminolevulinic acid (5-ALA; 1 mM)4,5.\nWash the cells with culture medium or phosphate buffered saline (PBS) prior to fluorescence microscopy.\n2. VA-TIRFM\nUse an upright microscope, e.g. Zeiss Axioplan, and replace its condenser by an illumination device, as described in Ref. 3 with a hemi-spherical or a hemi-cylindrical glass prism optically coupled to the object slide (see Figure 1).\nUse a parallel collimated laser beam which after imaging by the glass prism and further optical components (e.g. concave mirror) again results in a parallel beam on the surface of the sample (telecentric pupil ray). Take care that the electrical field vector is polarized perpendicular to the plane of incidence.\nUse an adjustable mirror located inside the condenser which is imaged in the sample plane and illuminates the sample under a variable angle of incidence (object ray). The adjustable mirror may be driven by a step motor, where each position corresponds to a well defined angle of incidence, as determined by goniometric measurements3.",
    "Calibrate the angular position of the adjustable mirror using the critical angle Θc=61.3° for a glass-water transition as a fixed value. Θc can be visualized upon variation of Θ when a fluorescent dye (e.g. 1 mM flavin mononucleotide, FMN) is dissolved in water. The position of the mirror at Θ=Θc is stored in the mirror positioning program.\nSet the parameters of the camera (back illuminated Andor Ixon EMCCD, DV887DC, ANDOR Technology, Belfast , U.K.6), including temperature, gain, recording time and shift speed.\nUse an objective lens of appropriate magnification and preferentially moderate numeric aperture (e.g. 40×/0.75 or 63×/0.90 water immersion) and localize the object slide in the microscope. Use immersion oil to assure optical contact of the sample with the glass prism. Record fluorescence images of identical samples upon variation of the angle of illumination (Θ≥Θc with Θc corresponding to 64.5° for a cell-glass interface). An angular range of 66°-74° with steps of 0.5° or 1° is recommended. Use an appropriate long pass or band pass filter for fluorescence detection.\n3. Data Analysis\nRead the images (e.g. in ASCII format) recorded at various angles Θ, as well as the camera settings (for background discrimination), the excitation wavelength and the refractive indices for glass (n1 = 1.52) and cells (n2 = 1.37) into the evaluation program (LabView; NanoCell). For each set of parameters the penetration depth d(Θ) and the transmission factor T(Θ) are calculated automatically.\nSelect images used for evaluation of cell-substrate distances Δ according to Equation 5 (membrane marker) or Equation 4 (cytoplasm marker), Individual images with inhomogeneous illumination (revealing e,g. stripes) may be excluded.",
    "Calculate images of cell-substrate topology and select an appropriate color code for display. During evaluation profiles of individual pixels can be displayed, as depicted in Figure 2. These profiles may be used as an indicator for the quality of the fit.\nStore the evaluation protocol.\n4. Representative Results\nRepresentative experiments are carried out with genetically engineered U251-MG glioblastoma cells kindly supplied by Prof. Jan Mollenhauer, Dept. of Molecular Oncology, University of South Denmark, Odense. In two subclones of those U251 cells the tumour suppressor genes TP53 or PTEN are over-expressed using a Tet-On inducible expression system, such that these cells exhibit a reduced tumorigenic potential and may be regarded as less malignant. Highly malignant U251-MG cells without suppressor gene are used as controls, and U251-MG wild type cells serve for a further comparison. A laser diode emitting a quasi continuous series of picosecond pulses (LDH400 with driver PDL 800-B, Picoquant, Berlin, Germany; wavelength: 391 nm; pulse energy: 12 pJ; repetition rate: 40 MHz) is used as an excitation source.",
    "In Figure 3 TIRFM images of U251-MG glioblastoma cells with an activated TP53 tumour suppressor gene and incubated with laurdan (8 μM; 60 min) are depicted for angles of incidence of 66.0°, 69.0° and 73.0° corresponding to penetration depths of the evanescent electromagnetic field of about 140 nm, 75 nm and 60 nm, respectively. With decreasing penetration depth fluorescence decreases in intensity (see scales) and originates from more superficial sites of the cells (e.g. focal contacts on their edges). Cell-substrate distances (visualized in Figure 3d by a color code ranging from 0-600 nm) strongly vary over the cells between only a few nanometers (white-yellow) and 250-300 nm (dark red), i.e. focal contacts and larger cell-substrate distances are in close vicinity. The same holds for U251-MG glioblastoma cells with an activated suppressor gene PTEN (Figure 4d), while cell-substrate distances are rather constant for U251-MG control and wild type cells with typical values of 80-100 nm (yellow; Figure 4b) and 150-200 nm (orange-red; Figure 4a).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4133/4133fig1.jpg\n Figure 1.  Illumination device for VA-TIRFM in an upright microscope. An adjustable mirror driven by a step motor permits an angular resolution of ±0.25°.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4133/4133fig2.jpg\n Figure 2.  Evaluation profile for one pixel (schematic). When ln[IF/T(Θ)] is plotted as a function of 1/d(Θ), the slope represents the cell-substrate distance Δ. This slope is commonly determined with a precision of about ±10%. One value - resulting from inhomogeneous illumination - has been marked and excluded from evaluation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4133/4133fig3.jpg",
    "Figure 3.  TIRFM images of U251-MG glioblastoma cells with activated TP53 suppressor gene upon incubation with laurdan (8 μM; 60 min) recorded at various angles of illumination (a-c); cell-substrate distances in the range of 0-600 nm shown by a color code (d); excitation wavelength: 391 nm, detection: ≥420 nm; image size: 210 μm × 210 μm. Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4133/4133fig3large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4133/4133fig4.jpg\n Figure 4.  Cell-substrate distances of U251-MG glioblatoma cells in the range of 0-600 nm shown by a color code; (a) wild type (b) controls; (c) cells with activated suppressor gene TP53; (d) cells with activated suppressor gene PTEN; excitation wavelength: 391 nm, detection: ≥420 nm; image size: 210 μm × 210 μm. Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4133/4133fig4large.jpg].Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}