{
  "id": 15045,
  "origin_website": "Jove",
  "title": "A Suppressor Screen for the Characterization of Genetic Links Regulating Chronological Lifespan in Saccharomyces cerevisiae",
  "procedures": [
    "1. Identify potential genetic interactions for screening\nIdentify the genetic background(s) for characterization, that results in an abnormally shorted chronological life span (CLS) in Saccharomyces cerevisiae using the Saccharomyces Genome Database (the SGD, https://www.yeastgenome.org29,30), which compiles known phenotypic information for this organism.\n\t\nSelect the Function tab from the options on the top of the webpage.\nSelect Phenotype followed by selecting Browse all Phenotypes.\nFrom the Yeast Phenotype Ontology options scroll to the Development subheading and select Chronological Lifespan, found under the Lifespan subheading.\nSelect the qualifier for decreased, which allows for the identification of genes that exhibit a phenotype that results in a decreased chronological lifespan phenotype when deleted. For this proof-of-method atg1Δ was selected, which results in a short-lived CLS phenotype and is disrupted for autophagy26.\nIdentify target gene(s) to screen for genetic interactions that may suppress the phenotype, based on reported or predicted ontology attributes, of the mutant identified in part 1.2. Repeat the phenotype search as found in steps 1.1.1-1.1.4 above, querying for genes that result in a longer CLS when overexpressed in a wild-type background. SIR2 was selected based on the reported CLS phenotype and reported interactions with autophagy31,32.\n2. Prepare reagents\nNOTE: Unless otherwise specified autoclave each solution at 121 ˚C for 20 min to sterilize prior to use.\nYPAD liquid media: Add 1% Yeast Extract, 2% Peptone, 2% Dextrose (glucose), and 40 mg adenine (as adenine sulfate dehydrate) per liter of double distilled water. Mix well with a magnetic stirrer.\nLB liquid media: Add Tryptone (10 g), Yeast extract (5 g), and Sodium Chloride (10 g) per liter of double distilled water. Mix well with a magnetic stirrer.\nPrepare 1000x (100 mg/mL) ampicillin stock, in double distilled water. Mix well and filter sterilize.",
    "Synthetic complete – Leucine (SC-LEU) liquid media: Add 1.7 g of Yeast nitrogen base w/o amino acids, 2% Glucose, 1.92 g of SC-LEU Dropout mix, 5 g of Ammonium sulfate per liter of double distilled water. Mix well with a magnetic stirrer.\nTE buffer: Mix Tris (10 mM final concentration), EDTA (1 mM final concentration) in the solution with double distilled water. Mix well with a magnetic stirrer.\nPrepare 50% PEG 3350 in solution with double distilled water. Mix well with a magnetic stirrer.\nPrepare 1 M and 100 mM Lithium Acetate solution with double distilled water. Mix well with a magnetic stirrer.\n\tNOTE: To make solid agar plates add 20 g of agar (per liter with double distilled water) to the media prepared in 2.1 and 2.2 above prior to autoclaving. If preparing ampicillin plates add 1mL of the ampicillin to the media in 2.2 above after it has cooled to roughly 60 ˚C. Pour into sterile plates and allow to set for 48–72 h prior to use. Store plates at 4 ˚C for longer storage.\n3. Design the cloning strategy to clone SIR2 into the pRS315 vector\nDesign PCR primers to amplify the SIR2 gene for cloning into the pRS315 vector.\n\t\nDesign primers manually to have 21–22 nucleotide complementarity to the intergenic regions upstream and downstream of the SIR2. Ensure that the entire gene, along with the untranslated regions of the mRNA is cloned by mapping those features from the available datasets33,34.\nEnsure that the PCR primer design results in forward and reverse primers that have a melting temperature (Tm) above 53 °C and below 60 °C.",
    "NOTE: Ideally, both primers should have a Tm as close to each other as sequence will allow, with an approximate GC content of between 40–50%, making sure to avoid dinucleotide repeats and balancing GC and AT distribution throughout the sequence.\nAfter the design of the PCR primers that will allow for the generation of the amplicon for cloning, add restriction enzyme digestion (R.E.D.) target sites to the 5’ end of each primer that are compatible to the plasmid-cloning vector. In this method, a HindIII restriction enzyme digestion site (5’-AAGCTT-3’) is added to the upstream, forward primer and a SacII restriction enzyme digestion site (5’-CCGCGG-3’) is added to the downstream, reverse primer.\n\t\tNOTE: The use of the SacII and HindIII sites requires that the consensus cut site for each endonuclease is not present in the target gene. If either enzyme targets within the target gene, alternative restriction enzymes should be chosen. There are many that are compatible with the polylinker region on the pRS315 vector.\nLastly, add a four nucleotide (5’-NNNN-3’) sequence overhang to the 5’ end of each primer to allow the restriction enzyme to bind and digest the amplicon. Once the primers have been designed, have the oligonucleotides commercially synthesized for use cloning the SIR2 gene.\nResuspension of the PCR primers: Centrifuge the PCR primers using a tabletop microfuge at maximum speed for 4 min. Add TE solution to make a stock concentration of 100 µM. Store the stock concentration at -20 °C and dilute 1/10 for use in PCR applications.\n\t\tNOTE: To make a 100 μM stock, dissolve the primers in a volume of sterile TE buffer that is 10x the amount of nmoles in the primer tube, using microliters of TE. For example, if the tube contains 15.6 nmoles of primer, add 156 μL of TE buffer.",
    "Isolate wild-type yeast gDNA for PCR amplification of the SIR2 cloning construct.\n\tNOTE: Several high-quality options are commercially available for isolating yeast gDNA. Utilization of a kit that includes the digestion of the fungal cell wall with zymolyase results in better quality gDNA (higher yield, less impurities). The protocol below consistently returns high concentration and purity. Details of a kit we recommend can be found in the Table of Materials.\n\t\nGrow 5 mL culture of wild-type yeast for 48-72 h to post-log phase in enriched media, such as YPAD. Pellet the yeast cells at >800 x g for 3 min at room temperature, remove the growth media, and resuspend in 120 μL of zymolyase digestion buffer supplemented with 5 μL of zymolyase (2 units enzyme/μL). Mix the sample by vortexing and incubate at 37 °C for 40 min.\nAdd 120 μL of a chaotropic lysis buffer (e.g., guanidinium chloride), 250 μL of chloroform, and vortex the sample for 60 s.\nCentrifuge at >8,000 x g for 2 min and transfer the supernatant into a purification column in a sterile collection tube.\nCentrifuge at >8,000 x g for 60 s and discard the flow through. The gDNA will be bound to the column matrix.\nWash the column twice with 300 μL of an ethanol-based wash buffer, repeating the centrifugation step from above (3.2.4). Discard the flow through after each spin. Transfer the column into a 1.5 mL microfuge tube, add 60 μL of TE buffer, and incubate at room temperature for 60 s. Flash spin the sample for 30 s to elute the DNA.",
    "NOTE: Determine the concentration of the DNA in the sample (Absorbance at 260nm) and the quality (Absorbance 260nm/280nm). A typical yield will be 100–200 ng/ μL of gDNA with absorbance ratio at 260nm/280nm as close to 1.8 as possible.\nAmplify and isolate the pRS315 plasmid vector for cloning.\n\tNOTE: Several high-quality options are commercially available for the purification of plasmid vectors. A silica-based column chemistry is recommended for this step. The changes noted below have led to the highest concentration and purity. Details are found in the Table of Materials.\n\t\nGrow a 5 mL of culture of E. coli containing the pRS315 vector overnight in LB+ ampicillin (80 μg/mL) media. Pellet the culture by centrifugation at >8,000 x g for 2 min at RT (15–25 °C).\nRe-suspend pelleted bacterial cells in 250 μL of TE buffer with RNase A (100 μg/mL) and transfer to a microcentrifuge tube. Ensure that no clumps of cells remain.\nAdd 250 μL of lysis buffer and mix by inverting the tube 6–8 times. Incubate for 5 min at room temperature. Do not allow lysis to proceed for more than 5 min – a little less is preferable.\nAdd 350 μL of neutralization buffer and mix immediately and thoroughly by inverting the tube 10 times. Centrifuge for 10 min at >8,000 x g.\nCarefully transfer the supernatant from above to a silica spin column by pipetting. Centrifuge for 30 s and discard the flow-through.\nAdd 500 μL of a high salt wash buffer and centrifuge as in step 3.3.5. Discard the flow-through. Wash the DNA binding spin column by adding 750 μL of an ethanol-based wash buffer, to remove residual salts, and centrifuge as in step 3.3.5.",
    "Discard the flow through and centrifuge for an additional 2 min at >8,000 x g to remove residual wash buffer. Place the spin column in a clean, labeled 1.5 mL microcentrifuge tube. To elute DNA, add 20 μL of TE buffer to the center of the spin column, incubate for 1 min at room temperature, and centrifuge for 1 min at >8,000 x g.\nUse a spectrophotometer to determine the quantity (Absorbance at 260nm) and the quality (Absorbance 260 nm/280 nm) of DNA. A typical yield will be 1–2 μg/µL.\nPCR amplification of the candidate gene, SIR2, from wild-type genomic DNA\n\t\nTo produce an amplicon that is suitable for cloning, utilize a high-fidelity (HF) PCR polymerase to avoid the unintentional generation of mutations into the sequence being amplified.\n\t\tNOTE: Many different high-fidelity PCR options are commercially available. To facilitate the optimization of the PCR reaction conditions, use two-buffer combination: one that is a standard HF buffer and one optimized for high GC and complex amplicons. Details can be found in the Table of Materials.\nPCR amplify the SIR2 construct for cloning as described in Table 1.\n\t\tNOTE: To maximize success in the cloning steps, multiple identical 50 μL can be set up and concentrated by a PCR column clean up step. Be sure to set up one no gDNA template control reaction (negative control).\nSet up the PCR cycling conditions as described in Table 2.\n\t\tNOTE: Different primer pairs vary on their annealing temperature and different polymerases function at different speeds. Make sure to optimize the amplification conditions based upon the enzyme selected and the specifications of the primer combination as designed.",
    "Verify the success of the PCR reaction by visualizing the PCR reaction, which would produce an approximately 2.5 kb of DNA fragment, on a 1.0% TAE-agarose gel (with 0.5 μg/mL ethidium bromide for visualization).\nDigestion and ligation of the candidate gene, SIR2, into the pRS315 plasmid vector.\n\t\nPerform restriction digestion of the vector and the insert: 625 ng DNA (either the vector or insert), q.s. water to bring the final reaction volume to 50 μL, 5 μL of buffer, 1 μL SacII, and 1 μL HindIII. Incubate the restriction digestions at 37 °C for 3 h, followed by 80 °C for 20 min to heat inactivate the enzymes. Digests can be stored at 4 °C prior to proceeding to the next step.\nSet up a 15 μL ligation reaction to create the desired plasmid: 6 μL of sterile water, 2 μL digested vector (50 ng DNA), 4 μL digested insert (100 ng DNA), 2 μL T4 reaction buffer, and 1 μL of T4 DNA Ligase. Incubate the ligation reactions overnight at 16 °C, followed by 80 °C for 20 min to heat inactivate the enzyme.\n\t\tNOTE: Set up a no insert control, substituting an additional 4 μL of sterile water (10 μL total) in lieu of the insert.\nTransform the ligation reactions into E. coli.\n\t\tNOTE: There are many options available for competent cells that are available. This protocol uses chemically competent cells that are stored at -80 °C prior to use.\n\t\t\nThaw a 50 μL tube of frozen, competent E. coli cells on ice until just thawed and immediately add 15 μL of the ligation reaction. Flick the tube several times. Immediately return the tubes to ice and incubate for 30 min.",
    "Heat-shock the cells for 20 s in a water bath at exactly 42 °C, and immediately return the tubes to ice for a 2 min incubation. Add 450 μL of room temperature recovery media (e.g., SOC or LB) to each transformation reaction and incubate for 60 min at 37 °C with shaking.\nFor each transformation reaction, make a 1:10 dilution of cells. Using sterile technique, plate 150 µL of the undiluted cells and the 1:10 dilutions onto LB + (80 μg/mL) ampicillin plates35. Incubate the plates at 37 °C overnight.\nScreen prospective transformants for the overexpression vector.\n\t\nUsing sterile technique, inoculate the potential transformants that grew into 5 mL LB + (80 μg/mL) ampicillin and grow overnight. Following the procedure outlined in section 3.3.1–3.3.7 above, isolate the plasmids from every potential transformant and screen for successful integration of the insert by restriction digestion followed by gel electrophoresis on a 1.0% TAE-agarose gel (with 0.5 μg/mL ethidium bromide for visualization).\n4. Transform the vector into atg1Δ and wild type yeast strains\nNOTE: This is performed using a modified lithium acetate transformation protocol36.\nPellet 15 mL of wild type and atg1-null yeast cells grown overnight in YPAD media to early to mid-log phase (O.D. 600nm = 0.4-0.9) of growth for 3 min at > 800 x g at room temperature.\nDecant the supernatant, re-suspend the cell pellet in 1 mL of sterile ddH2O and transfer the contents to a 1.7 mL microfuge tube. Pellet the cells for 3 min at > 800 x g at room temperature.\nRemove the supernatant and re-suspend the cells in 250 μL of 100 mM lithium acetate with gentle pipetting. Split the cells into separate microfuge tubes for each of the transformations that you will perform. Use 50 μL of the cell-lithium acetate mix per transformation.",
    "Set up a transformation mix. To each of the transformations add: 240 μL of 50% PEG3350, 36 μL of 1.0 M Lithium acetate, and 5 μL of Salmon sperm (or other carrier) DNA, boiled for 5 min and on ice.\n\tNOTE: PEG is very viscous. Pipette and measure carefully. Mix by pipetting after the addition of each component prior to moving on.\nAdd 5 μL of the appropriate plasmid for each transformation performed. Vortex each tube to mix thoroughly. Incubate the samples at 30 °C for 45 min. Heat shock samples at 42 °C for 10 min.\nPellet cells for 3 min at > 800 x g at room temperature, carefully remove the transformation mix, and re-suspend samples in 300 μL of sterile ddH2O. Pellet cells by repeating the spin above, carefully remove water, and re-suspend your samples in 200 μL of sterile ddH2O.\nSet up 1/10 and 1/100 dilutions for each transformed strain of yeast.\nUsing sterile technique plate 150 μL from each sample onto SC-leucine plates to select for the plasmids. Spread the cells uniformly and evenly and allow the plate to dry before inverting and incubating at 30 °C to grow for 48–72 h.\n\tNOTE: Once the appropriate strain is generated, it may be stored long term in 25% glycerol at -80 °C. The quantification of copy number present can be determined by several methodologies, including qPCR, RNA-FISH, or another appropriate measure37,38.\n5. Determine the chronological life span to test for shortened CLS phenotype suppression\nTest the effect of overexpression of the putative suppressor on CLS in the short-lived yeast, atg1Δ mutant, by determining the number of colony forming units (CFUs) that remain as a function of time39.",
    "NOTE: It is necessary to set up this portion of the experiment with the appropriate controls. A typical experiment will compare a wild type (WT) strain of yeast with the empty vector, WT with the suppressor vector, the deletion mutant with the empty vector, and the deletion mutant with the suppressor vector.\n\t\nTake a single colony of the strain to study and inoculate it into SC-LEU media. Grow the culture at 30 °C for 72 h, with shaking.\nUsing a hemocytometer, determine the concentration of cells that are present in the culture40.\nDilute an aliquot of the culture, so that the result is a uniform number of cells in a 150 µL volume of sterile water. Plate the culture using sterile technique onto SC-LEU plates and grow at 30 °C for 72 h. These plates are the day three time-point and the experiment will be normalized to this time-point as 100% viability39.\n\t\tNOTE: The number of cells should be 200–500, sufficiently large for the analysis and a manageable number for counting. In this study, we used 200 cells for our plating quantity.\nContinue to incubate the yeast cultures at 30 °C, taking regular aliquots and plating as outlined in 5.1.3. Continue this process until the strains are no longer viable, then compile and analyze the results.\n\t\tNOTE: The complete list of strains used in this study are found in Table 3.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}