{
  "id": 10185,
  "origin_website": "Jove",
  "title": "Molecular Spring Constant Analysis by Biomembrane Force Probe Spectroscopy",
  "procedures": [
    "1. Obtain Analyzable DFS Events\nStart the experiment in the software (e.g., LabVIEW VI) for the BFP control and parameter setting (Figure S1A).\nObserve the repetitive probe bead-target bead/cell touches in the software for BFP Monitor (Figure S1B).\nTest and achieve the adhesion frequency ≤ 20% within the first 50 touches by tuning the impingement force and contact time, by which it ensures that ≥ 89% of DFS adhesion event are mediated by single bonds12,13,14.\n\tNOTE: For each Bead-Cell/Bead pair, we perform 200 repetitive touch cycles. To obtain publishable data quality, we usually perform n ≥ 3 Bead-Bead or Bead-Cell pairs.\n\t\nSave data, in the form of Force vs. Time, to the user directed folder by the end of each pair, prompted by the software for BFP control and parameter setting.\nCollect the Force vs. Time raw data of Bond events, as exemplified in the Figure 2A, using the BFP acquisition platform (Figure S1C).\n\t\nOpen the BFP data analysis software. Click on the yellow folder icon and select the corresponding raw data file by double clicking on them.\nRun the program, and then click the up and down button to switch between events. Use the outlier exclusion criteria (Figure S2) to screen out invalid events. Select the exporting data type as Force vs. Time format and click on the Export Plots Data button.\n2. Convert the Force vs. Time Curve to the Force vs. Displacement Curve\nExport the data segment corresponding to the Retract stage to a spreadsheet (Figure 2A, square marquee), which is relevant to the spring constant analysis.",
    "Plot the Force vs. Time Curve using spreadsheet software. To obtain the Force vs. Displacment curve, convert the time values (Figure 2A, x-axis) to the total displacement values (Δxtot) by multiplying time values with piezo movement velocity (i.e., 4,000 nm/s by preset).\nZero the first data point by subtracting the smallest displacement value from each acquired displacement value. This horizontal transformation does not affect the ascending slopes of the Retract stage nor the subsequent spring constant calculation.\nNotably, the BFP is considered as a serial spring system in which Δxtot (Table 1) sum deformations of the RBC, ΔxRBC (Table 1), the molecular bond, Δxmol (Table 1), and the Target cell, Δxcell (Table 1), as the Eq. 2:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62490/62490eq02.jpg (Eq. 2)\nPlot the Force (F) vs. Displacement (Δxtot) curve as shown in the Figure 2B.\n3. Spring Cnstant Analysis of Bead- Cell Mode\nIn the Force vs. Displacement curve, two distinct slop can be identified, where each can represent the compressive phase and the tensile phase. Fit a regression line to each data group (Figure 2B), where the larger linear fit slope represents the total spring constant at compressive phase (Figure 2B, red), denoted as k1  (Table 1); and the smaller linear fit slope represents the total spring constant at tenslile phase (Figure 2B, blue), denotated as k2 (Table 1).\nFor springs connected in series per step 2.2 description, express the reciprocal of the total spring constant, ktot (Table 1), as the sum of the spring constant inverses of RBC, kRBC (Table 1), the molecular bond, kmol (Table 1), and the Target cell, kcell (Table 1). During the compressive phase of the Bead-Cell mode, the molecular bond is not stretched, therefore kmol is not taken into consideration. The reciprocal of the ktot in this scenario (1/k1) is expressed as",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/62490/62490eq03.jpg (Eq. 3).\n\tIn the example data, kRBC is pre-determined (0.25 pN/nm by default). kcell can be derived from the Eq. 3 with the acquired k1 and kRBC (Figure 3B).\nDuring the tensile phase, adhesion is formed between the ligand-receptor pair. Express the reciprocal of the ktot in this scenario (1/k2) as\nimgsrc://cloudfront.jove.com/files/ftp_upload/62490/62490eq04.jpg (Eq. 4)\n\twhere k2 (Table 1) represents the total spring constant during the tensile phase.\nDerive kmol from subtracting 1/k1 from 1/k2 (compare Eq. 3 vs. Eq. 4).\n4. Spring Constant Analysis of Bead- Bead Mode\nFit a regression line to the compressive phase data to obtain k1 (similar to the Figure 2B, red). Of note, in the Bead-Bead mode, the Target cell is replaced by a glass bead coated with the receptor of interest (Figure 1C). Since bead deformation is negligible, the 1/kcell term can be removed from the Eq. 3 and Eq. 4 accordingly. The reciprocal ktot of the compressive phase (1/k1) can be expressed as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62490/62490eq05.jpg (Eq. 5)\nFit a regression line to the tensile phase data to obtain k2 (similar to the Figure 2B, blue). The reciprocal ktot of the tensile phase (1/k2) can be expressed as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62490/62490eq06.jpg (Eq. 6)\nDerive kmol from subtracting 1/k1 from 1/k2 (compare Eq. 5 vs. Eq. 6).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}