{
  "id": 2425,
  "origin_website": "Cell",
  "title": "Protocol for Flow Cytometric Detection of Immune Cell Infiltration in the Epidermis and Dermis of a Psoriasis Mouse Model",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nEstablishment of IMQ-Induced Mouse Model of Psoriasis\nTiming: 1 week\nIMQ cream is applied to mouse skin for 6 consecutive days to induce psoriasis-like skin lesions.\nInject 90 mg/kg pentobarbital sodium intraperitoneally (i.p.) to anesthetize the mice.\nOptional: 400 mg/kg chloral hydrate (i.p.) can also be used.\nNote: We use 7-week-old male C57BL/6J mice in this protocol.\nShave a 1.5 cm × 2 cm area on mouse back skin using an electric pet shaver, not required if IMQ is applied to the ear.\nCritical: Do not scratch the mouse skin, especially when genetically engineered mice might have vulnerable skin barriers.\nWeigh 5% IMQ cream using an electronic balance, 60 mg for back skin or 30 mg for ventral and dorsal sides of an ear.\nSmear the IMQ cream to mouse skin gently and evenly with a pair of curved forceps (Methods Video S1[href=https://www.wicell.org#mmc1]).\nRepeat steps 1 and 3–4 same time every day for 5 days.\nNote: The skin thickens gradually along with daily application of IMQ. After 5 days of IMQ application, obvious erythematous lesions covered with squama will form (Figure 2[href=https://www.wicell.org#fig2]).\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. The Procedure of IMQ Application on Mouse Back Skin Using a Pair of Curved Forceps, Refer to “Step-by-Step Method Details,” Step 4\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/191-Fig2.jpg\nFigure 2. Typical Psoriasis-like Skin Lesions after IMQ Application\n(A) Typical psoriasis-like skin lesions on mouse ear after 5 days of IMQ treatment.\n(B) Typical psoriasis-like skin lesions on mouse back skin after 5 days of IMQ treatment.\nScale bars: 0.5 cm.\nSkin Collection and Processing\nTiming: ∼2 h",
    "After 6 days of IMQ application, collect the skin and separate the epidermis from the dermis. The skin can also be collected at an alternative timepoint (e.g., after 3 days, 5 days or 7 days of IMQ application) and processed in exactly the same way.\nEuthanize the mice by CO2 inhalation.\nCollect skin samples.\nCut off a 1 cm × 1 cm area from mouse back skin if IMQ was applied.\nNote: Such an area is enough for flow cytometric analysis of the epidermis and the dermis. If a larger area is needed, multiply the reagents accordingly.\nCut off the whole ear if IMQ was applied (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/191-Fig3.jpg\nFigure 3. The Processing of Mouse Ear Skin\n(A) A pair of IMQ-treated ears cut off from a C57BL/6J mouse.\n(B) The HBSS is turbid due to the presence of IMQ cream on the ear.\n(C) After washing the ear rigorously for three times, the HBSS is transparent.\n(D) Splitting the dorsal and ventral sections of the ear.\nTransfer the skin to an EP tube containing 1 mL HBSS and wash rigorously by quickly shaking up and down by hand for 15 s.\nRepeat step 8 by transferring the skin to a new EP tube and refreshed HBSS for two times to wash off remaining IMQ cream (Figures 3[href=https://www.wicell.org#fig3]B, 3C, 4[href=https://www.wicell.org#fig4]A, and 4B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/191-Fig4.jpg\nFigure 4. The Processing of Mouse Back Skin\n(A) The HBSS is turbid due to the presence of IMQ cream on the skin.\n(B) After washing the skin rigorously for three times, the HBSS is transparent.\n(C) 1 cm2-area of back skin is cut into four triangular pieces for subsequent digestion with Dispase II.\n(D) Back-skin tissue fragments after mechanical disruption and before enzymatic digestion.\n(E) Back-skin tissue suspension after 30 min of enzymatic digestion and pipetting.",
    "Critical: The presence of IMQ cream affects the viability of cells released from enzyme digested tissues in the later steps. Ensure that HBSS is transparent after 3 times of washing, each for 15 s. Note that scales from the epidermis can flow in HBSS after 3 times of washing, which is normal.\nIf processing back skin, cut the back-skin sample with scissors into two pieces along the diagonal, then to four pieces along the diagonal (Figure 4[href=https://www.wicell.org#fig4]C).\nNote: Cut the back skin into triangular pieces to ensure efficient digestion with Dispase II.\nIf processing ears, split the dorsal and ventral sections of the ear with forceps (Figure 3[href=https://www.wicell.org#fig3]D).\nDigest the skin (4 pieces of back skin or two sections of an ear) with 1 mL of Dispase II working solution in one well of a 12-well plate at 37°C for 1 h.\nNote: Pre-chill HBSS at 4°C for later steps.\nTransfer the skin to a petri dish with 10 mL of cold HBSS and separate the epidermis from the dermis using curved forceps (Methods Videos S2[href=https://www.wicell.org#mmc2] and S3[href=https://www.wicell.org#mmc3]).\nWash the epidermis and the dermis with cold HBSS for three times.\nTransfer the epidermis to one well of a 12-well plate containing 1 mL cold HBSS and place the plate at 4°C.\nNote: Dermis requires longer time for digestion, so we leave the epidermis in HBSS at 4°C until the processing of dermis is almost finished. This is to ensure all samples ready for antibody staining immediately after single-cell suspensions are prepared. The epidermis can be left at 4°C for 6 h without affecting cell viability.\n        Your browser does not support HTML5 video.\n      \nMethods Video S2. Separate the Epidermis from the Dermis of Mouse Ear, Refer to “Step-by-Step Method Details,” Step 13\n        Your browser does not support HTML5 video.",
    "Methods Video S3. Separate the Epidermis from the Dermis of Mouse Back Skin, Refer to “Step-by-Step Method Details,” Step 13\nDermis Digestion\nTiming: ∼1.5 h\nMouse dermis samples are digested to generate single-cell suspensions.\nTransfer the dermis to one well of a 6-well plate placed on ice containing 1 mL of cold Dermis Dissociation Buffer.\nQuickly cut the dermis into pieces as small as possible (< 0.5 mm in size) with curved scissors in 1 mL of cold Dermis Dissociation Buffer in the 6-well plate placed on ice.\nCritical: The tissue from one ear is regarded as one sample; the 1 cm × 1 cm area from back skin is regarded as one sample. Because the cutting process can be time-consuming if many samples are to be processed, proceed this step with the 6-well plate placed on ice to minimize digestion time differences between samples processed earlier or later. If there are > 4 samples, we recommend having ≥ 2 people working together in this step, to minimize digestion time differences between samples.\nAdd another 2 mL of Dermis Dissociation Buffer to an ear sample or 2.5 mL of Dermis Dissociation Buffer to a back-skin sample (Figure 4[href=https://www.wicell.org#fig4]D).\nIncubate the sample in a 37°C cell culture incubator for 30 min.\nCut the 5 mm-long top end of a 1-mL pipet tip with scissors, and gently mix the tissue suspension by pipetting. Incubate the sample in a 37°C cell culture incubator for another 30 min.\nNote: The tissue fragments become smaller visibly upon pipetting (Figure 4[href=https://www.wicell.org#fig4]E).\nCut the 5-mm-long top end of a 1-mL pipet tip with scissors, and gently mix the tissue suspension by pipetting.",
    "Critical: There should leave no obvious debris by this time. If not, continue the 37°C incubation for another 10–30 min until the debris disappears after pipetting. Check the sample status every 10 min. Longer than 1.5 h of collagenase digestion at 37°C affects cell viability.\nPass the suspension through a 40–μm cell strainer into a 50-mL tube.\nRinse the well with 2 mL DMEM/high glucose containing 10% FBS and pass the suspension through the strainer into the same 50-mL tube.\nAdd 10 mL DMEM/high glucose containing 10% FBS to the strainer to wash the sample.\nNote: Filter the sample through the strainer by gravity but no other forces.\nTransfer the suspension to a 15-mL conical centrifuge tube. Centrifuge at 400 × g for 5 min at 4°C, discard the supernatant, and resuspend the pellet with 2 mL cold Staining Buffer.\nCentrifuge at 400 × g for 5 min at 4°C, discard the supernatant, and resuspend the pellet with 90 μL cold Staining Buffer.\nTransfer the sample to a 5-mL round-bottom flow test tube. Keep on ice until staining.\nNote: One ear sample generates 5∼8 × 105 live cells; one back-skin sample generates 1∼3 × 105 live cells.\nEpidermis Digestion\nTiming: 30 min\nMouse epidermis samples are digested to generate single-cell suspensions.\nPre-warm 1 mL 0.05% TE Buffer in a 2-mL microfuge tube at 37°C water bath for 10 min.\nTransfer the epidermis from HBSS to a new well of the 12-well plate that does not contain any buffer.\nCut the epidermis into small pieces (∼2 mm in size) with scissors and squeeze the remaining HBSS to avoid unintended dilution of the TE buffer.\nTransfer the sample to the TE Buffer and incubate at 37°C water bath for 5 min.\nShake the sample up and down for five times.",
    "Continue incubation at 37°C water bath for 5 min.\nNote: The tissue will not completely disappear due to the presence of stratum corneum and hair follicles.\nAdd 1 mL cold trypsin neutralizing solution (4°C) to the sample and pipette rigorously for five times.\nPass the suspension through a 40–μm cell strainer into a new 50-mL tube.\nRinse the 2-mL tube with 2 mL of cold HBSS and pass the suspension through the strainer into the same 50-mL tube.\nUse 5 mL of cold HBSS to pass through the strainer to wash the sample.\nTransfer the suspension to a 15-mL conical centrifuge tube. Centrifuge at 400 × g for 5 min at 4°C, discard the supernatant, and resuspend the pellet with 2 mL cold Staining Buffer.\nCentrifuge at 400 × g for 5 min at 4°C, discard the supernatant, and resuspend the pellet with 90 μL cold Staining Buffer.\nTransfer the sample to a 5-mL round-bottom flow test tube. Keep on ice until staining.\nNote: One sample generates 1∼2 × 105 live cells, except for untreated back-skin epidermis, which generates 4∼8 × 104 live cells.\nFlow Cytometry Antibody Staining\nTiming: 1 h\nThe cell suspensions are stained with indicated antibodies for flow cytometric analysis.\nSet up an unstained control and seven single-stained controls.\nLabel a tube for each fluorochrome that will be used.\nAspirate 20 μL from a dermis sample to a tube labeled “Blank” and add 180 μL Staining Buffer to generate an unstained control. Keep on ice until detection.\nAspirate 20 μL from a dermis sample to a tube labeled “DAPI” and add 180 μL DAPI Buffer to generate a DAPI-single-stained control. Keep on ice until detection.\nMix UltraComp eBeads™ Compensation Beads by vortex.",
    "Add 1 drop of the beads to an empty labeled tube for a fluorochrome and add 0.5 μL of the relevant antibody to the tube.\nMix well by flicking and incubate at 4°C for 15 min in the dark.\nAdd 2 mL Staining Buffer, vortex briefly and centrifuge at 400 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend the pellet with 200 μL Staining Buffer. Keep on ice until detection.\nAdjust the epidermis and dermis sample volumes to 90 μL with Staining Buffer.\nDilute Fc block at a dilution of 1:20 with Staining Buffer.\nAdd 10 μL of the diluted Fc block to the sample and incubate at 4°C for 10 min in the dark.\nMix the indicated antibodies in an EP tube (Table 1[href=https://www.wicell.org#tbl1]). Add 4 μL of the antibody mix (without DAPI) to the 100-μL sample, vortex briefly, and incubate at 4°C for 30 min in the dark.\nAdd 2 mL Staining Buffer, vortex briefly and centrifuge at 400 × g for 5 min at 4°C.\nOptional: After this step, if intracellular cytokines are to be detected, use BD Cytofix/Cytoperm™ Fixation/Permeabilization Solution Kit to process the sample; If transcription factors are to be detected, use eBioscience™ Foxp3 / Transcription Factor Staining Buffer Set to process the sample.\nDiscard the supernatant and resuspend the pellet with 200 μL DAPI Buffer. Keep on ice until detection.\nData Collection\nTiming: 1 h\nThe data are collected using a BD LSRFortessa™ cell analyzer and analyzed using the FlowJo software.\nSelect parameters including FSC-A, FSC-H, FSC-W, SSC-A, SSC-H, SSC-W, Alexa Fluor 700-A (CD45), FITC-A (CD3), APC-A (CD11b), PE-A (F4/80), BV510-A (CD11c), PerCP-Cy5.5-A (Ly6G) and BV421-A (DAPI).",
    "Use the unstained control and single-stained controls to set appropriate PMT voltages and adjust compensations on a BD LSRFortessa™ cell analyzer using the BD FACSDiva software.\nCollect a total of 5,000 events from the unstained control and from each single-stained control.\nCreate gates for the samples (Figure 5[href=https://www.wicell.org#fig5]), set “Storage Gate” value to “All Events,” “Events to Record” value to 10,000 and “Stopping Gate” value to “P4” (CD45+ cells), and collect data.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/191-Fig5.jpg\nFigure 5. Gating Strategy for Data Collection\n“Events to Record” value is set to 10,000 and “Stopping Gate” value is set to “P4” (CD45+ cells). CD45+ cells are gated from DAPI- live cells; CD3+ cells, CD11c+ cells, CD11b+Ly6G+ cells and CD11b+F4/80+ cells are gated from CD45+ cells.\nNote: All cells in the epidermis samples and the untreated back-skin dermis will be collected, as the numbers of CD45+ cells in these samples will not reach 10,000.\nAnalyze the data with the FlowJo software.\nNote: Dead cells have autofluorescence. Keratinocytes in the epidermis can have autofluorescence detected as FITC. This would not be a problem if dead cells are gated away, a dermis sample is used as the unstained control, and Alexa Fluor 700 is used to stain CD45."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}