{
  "id": 9912,
  "origin_website": "Jove",
  "title": "Capillary Electrophoresis Separation of Monoclonal Antibody Isoforms Using a Neutral Capillary",
  "procedures": [
    "1. Preparation of Solutions\nPrepare the BGE solution.\nPrepare 100 ml of a solution composed of 0.05% (m/v) hydroxy propyl methyl cellulose (HPMC), 200 mM ε-amino n-caproic acid (EACA) and 30 mM lithium acetate.\n\t\tNOTE: As HPMC is a viscoelastic polymer, pour the powder into a glass beaker, add 80 mL of water and finally add the stirring bar. Continue adding the remaining reagents as normally. Wear safety glasses when handling lithium acetate as it can cause eye irritation.\nAdjust to pH value 4.8 ± 0.1 with 50% (v/v) acetic acid. Allow the solution to stabilize for 5 min and adjust as necessary.\nAdd water to make up to a final volume of 100 ml in volumetric flask.\nFilter through a hydrophilic membrane with a 0.2 µm pore size.\nStore at 2-8 °C for up to 7 days.\nPrepare the internal standard.\nPrepare 1 mL of a solution composed of 1% (m/v) histamine.\nFilter through a hydrophilic membrane with a 0.2 µm pore size.\nStore at 2-8 °C for up to 1 day.\n2. Sample Preparation\nPrepare 180 µl of mAb sample diluted with Tris buffer (50 mM tris(hydroxymethyl)aminomethane, pH 8.0) to a final concentration of 1 mg/ml.\nAdd 20 µl of 1% (m/v) histamine.\nMix and centrifuge at 1,000 x g for 5 sec.\nPlace a micro vial inside a universal vial.\nTransfer the sample into the micro vial and cap the universal vial. Dispense the sample upwards in order to avoid introducing any bubbles.\nStore at 2-8 °C for up to 1 day.\nPlace the universal vial (with micro vial containing the sample solution) in the sample inlet tray.\n3. Preparation of CE System.\nCE system cleaning.",
    "NOTE: Conduct this procedure at least once a week in order to avoid electric current leakage derived from accumulation of dust and debris. However, depending on the application (e.g., use of a BGE with increased viscosity or with high salt concentration, samples with increased viscosity) electrodes and opening levers may require to be cleaned more frequently to prevent cross contamination and sample carryover.\n\t\nTurn off the power switch of the CE instrument and open the front door.\nClean the surface of the sample cover, sample holding system (sample and buffer trays), cartridge cover, clamp bar, interface block and electrodes with a water-dampened nonwoven wipe. Repeat the procedure with an ethanol-dampened wipe and dry before use.\nRinse the opening levers thoroughly with water. Clean their surface with a nonwoven wipe. Repeat the procedure with an ethanol-dampened wipe and dry before installation.\nClean the two ends of the fiber optic cable carefully with a water-dampened microfiber cloth. Repeat the procedure with an ethanol-dampened cloth.\nCartridge assembly.\nRemove a new neutral capillary (50 µm internal diameter) from its package.\nTape down one end of the capillary protective tubing to the workbench. Uncoil, straighten and pull the capillary out the tubing.\nStick a piece of tape or paper to the workbench and add measurement marks as follows: length to the detector (30 cm), capillary window (0.2 cm) and length to the outlet end (10 cm) (i.e., 40.2 cm total length, 30.0 cm effective length).\nAlign the capillary window to the 0.2 cm measurement mark in the reference paper. Fix the capillary with tape and mark the capillary ends 2 mm outside the measurement marks.\nCut the protective cap at the capillary inlet end (the end farthest from the window) in a single straight movement using the flush edge of the cleaving stone.",
    "Immerse the capillary end into a capped universal vial filled with water in order to avoid permanent damage to the capillary inner coating. Repeat this procedure each time the capillary end is exposed to the ambient for more than 1 min.\nInsert the capillary inlet end into the outlet side of the cartridge.\nPush and pull the capillary through the cartridge as necessary until the capillary window is centered to the cartridge window.\nInsert the aperture plug (100 µm x 200 µm) into the cartridge window.\n\t\tNOTE: Confirm that white light passes through the window when exposed to a white source of light. If the light that passes through has a brownish appearance, adjust as necessary.\nInsert the capillary into the pre-formed coolant tubing for a total capillary length of 40.2 cm (with pre-installed tubing nut, ferrule and O-ring at both ends in that order).\nPush the capillary through the coolant tubing as necessary until the capillary appears at the other side of the tubing.\nInsert the end of the coolant tubing into the outlet side of the cartridge and tighten the tubing nut.\nInsert the capillary inlet end into the inlet side of the cartridge.\nPush and pull the capillary through the cartridge as necessary until the capillary appears at the inlet side of the cartridge.\nInsert the end of the coolant tubing into the inlet side of the cartridge and tighten the tubing nut.\nCut the protective cap at the capillary outlet end (the end nearest from the window) in a single straight movement using the flush edge of the cleaving stone.\nInsert the seal-retainer clips over the capillary ends and press to snap into position. Visually inspect the capillary ends. If they are not even, repeat the procedure.",
    "Place the capillary-length template on the edge of the workbench.\nPlace the cartridge facing down against the capillary-length template and align the capillary ends with the reference lines on the template. If the capillary measurement marks (see 3.2.4) do not align with the reference lines, adjust as necessary.\nHold the capillary against the capillary-length template and cut both ends of the capillary using the flush edge of the cleaving stone 2 mm below the reference lines on the template.\nVisually inspect the capillary ends with a magnifying glass. If capillary ends are not smooth, burnish them using the soft face of the cleaving stone.\nInsert the aperture O-ring into the aperture plug hole using the O-ring insertion tool.\nInstall capped universal vials filled with water into the cartridge case and place cartridge into case immediately with capillary ends inserted into vials. For short and long term storage keep at 2-8 °C.\nPreparation of buffer trays.\nFill and place capped universal vials in the buffer inlet and outlet trays (Figure 1). Repeat vial positions in lanes 2, 3, 4 and 5 according with the number of samples to be analyzed, placing one lane for every six sample injections.\n\t\tNOTE: Avoid wetting the vial caps in order to prevent current leakage.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55082/55082fig1.jpg\nFigure 1: Position and fill level of universal vials in the buffer inlet and outlet trays. Fill levels: 1/1 = 1400 µL, 3/4 = 1300 µL and 1/2 = 1000 µL. Abbreviations: W = water, HCl = 0.1 M hydrochloric acid. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55082/55082fig1large.jpg]\nCE system components assembly.\nInstall the UV detector.\nInstall the opening levers by pressing up into the interface block.",
    "Install the fiber optic cable. Insert the corresponding end to the clamp bar and, while holding both ends, rotate clockwise. Connect the other end to the UV detector.\n\t\tNOTE: Handle the fiber optic cable with care during this procedure since bending could cause its fracture.\nPlace sample and buffer trays into the sample holding system and snap into position.\nPlace the capillary cartridge into the interface block and, while pressing the clamp bar at both ends, tighten the knobs.\n4. Instrument Methods Set-up\nCreate the conditioning, running and shutdown instrument methods according with the following parameters and Table 1: Voltage, max: 30.0 kV; Current, max: 300.0 µA; Cartridge temperature: 20.0 °C; Sample storage temperature: 10.0 °C; UV detector initial conditions: Wavelength: 214 nm; Data rate: 4 Hz; Filter: Normal; Peak width (points): 16-25; Absorbance signal: Direct.\n\tNOTE: Data acquisition rate can be increased up to 25 Hz in order to improve the coverage of narrow separation zones.\ntable:\n﻿0,1,2,3,4,5,6,7\nConditioning method time program,Conditioning method time program,Conditioning method time program,Conditioning method time program,Conditioning method time program,Conditioning method time program,Conditioning method time program,Conditioning method time program\nTime (min),Event,Value,Duration,Inlet vial,Outlet vial,Summary,Comments\n-,Rinse - Pressure,2068 mbar,1.0 min,BI:C1,BO:C1,Forward,HCl 0.1 M\n-,Rinse - Pressure,2068 mbar,2.0 min,BI:B1,BO:C1,Forward,Water\n-,Rinse - Pressure,2068 mbar,10.0 min,BI:E1,BO:C1,Forward,BGE\n0.00,Separate - Voltage,15.0 KV,10.0 min,BI:D1,BO:D1,\"0.17 Min ramp, normal polarity\",Separate\n10.00,Rinse - Pressure,2758 mbar,10.0 min,BI:E1,BO:C1,Forward,BGE\n20.01,Wait,-,0.0 min,BI:A1,BO:A1,-,Rinse tips\nRunning method time program,Running method time program,Running method time program,Running method time program,Running method time program,Running method time program,Running method time program,Running method time program\nTime (min),Event,Value,Duration,Inlet vial,Outlet vial,Summary,Comments\n-,Rinse - Pressure,2068 mbar,1.0 min,BI:C1,BO:C1,\"Forward, In / Out vial inc 6\",HCl 0.1 M\n-,Rinse - Pressure,2068 mbar,2.0 min,BI:B1,BO:C1,\"Forward, In / Out vial inc 6\",Water\n-,Rinse - Pressure,2068 mbar,4.0 min,BI:E1,BO:C1,\"Forward, In / Out vial inc 6\",BGE\n-,Inject - Pressure,34 mbar,20.0 sec,SI:A1,BO:B1,\"Override, Forward\",Sample Injection",
    "-,Wait,-,0.4 min,BI:A1,BO:A1,In / Out vial inc 6,Wash tips\n0,Separate - Voltage,15.0 KV,30.0 min,BI:D1,BO:D1,\"0.17 Min ramp, normal polarity, In / Out vial inc 6\",Sample Separation\n0.5,Autozero,-,-,-,-,-,-\n30.01,Stop data,-,-,-,-,-,-\n30.02,Rinse - Pressure,2068 mbar,2.0 min,BI:B1,BO:C1,\"Forward, In / Out vial inc 6\",Water\n32.03,Wait,-,0.0 min,BI:A1,BO:A1,In / Out vial inc 6,Rinse tips\n32.04,End,-,-,-,-,-,End\nShutdown method time program,Shutdown method time program,Shutdown method time program,Shutdown method time program,Shutdown method time program,Shutdown method time program,Shutdown method time program,Shutdown method time program\nTime (min),Event,Value,Duration,Inlet vial,Outlet vial,Summary,Comments\n-,Rinse - Pressure,2068 mbar,1.0 min,BI:E6,BO:E6,Forward,HCl 0.1 M\n-,Rinse - Pressure,2068 mbar,6.0 min,BI:F6,BO:F6,Forward,Water\n-,Lamp - Off,-,-,-,-,-,-\n-,Wait,-,0.0 min,BI:A1,BO:A1,-,Rinse tips\nTable 1: Conditioning, running and shutdown time programs.\n5. Data Acquisition and Processing\nProgram the sample set.\nProgram the capillary for conditioning using the conditioning instrument method. When the capillary is used for the first time, program four repetitions; otherwise program only two repetitions of the conditioning method.\nProgram the samples to be analyzed using the running instrument method.\nProgram the capillary for storage using the shutdown instrument method and repeat the procedure indicated in section 3.2.22.\nRun the experiment.\nExport the electropherograms.\nCalculate the migration time and the percentage content of basic, main and acidic isoforms using vertical drop line integration of the electropherogram profile.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}