{
  "id": 17112,
  "origin_website": "Jove",
  "title": "Dynamic Light Scattering Analysis for the Determination of the Particle Size of Iron-Carbohydrate Complexes",
  "procedures": [
    "1. Operating the machine\nStarting up the machine and software\n\tNOTE: Supplemental Figure S1A-D describes the steps for starting up the machine and software.\n\t\nSwitch on the instrument at least 30 min before starting the measurements, and then start the PC.\nDouble-click on the instrument software icon to start the program.\nEnter the username and password in the login window. Ensure that each user has their own account.\nWait for all three black bars at the bottom right corner to light up green, indicating that the unit is ready for operation.\nIn the case of long periods of inactivity, when the user is automatically logged out, under Security, click on Login, and re-enter the password.\nCreating a measurement file\n\tNOTE: A new measurement file is created at the beginning of each measurement day. All the measurements are listed and stored in the measurement file. For details of this procedure, see Supplemental Figure S2A-B.\n\t\nCreate a new measurement file by clicking on File | New | Measurement File. In the opened window, select the storage location, and name the measurement file. Confirm the details by clicking on Save.\nTo open a file, click on File | Open | Measurement File. Select the measurement file in the opened window, confirm the details by clicking on Open, select the file name, and click on Save.\nPrinting the results\n\t\nPrint or save the results of the system suitability test (SST) (see step 1.5) and the mean value of the sample measurement according to Supplemental Figure S3.\nMark the measurement(s) in the Records View of the Measurement File.\nRight-click on Batch Print, and wait for another small window to open.\nSelect the PSD Intensity report from the choices, and confirm it by clicking on OK.\nGeneral procedure to start a measurement",
    "NOTE: The procedure for starting a measurement is described in Supplemental Figure S4A-D. Follow the path outlined below for the required unit parameter file (referred to as SOP):\n\t\nSelect the required SOP from the dropdown list. Since the most recently used SOPs are displayed in the list, if an older SOP is needed, select Browse for SOP, and confirm by clicking on the green arrow. Once the storage location of the SOPs opens, proceed with step 1.4.2.\n\t\tNOTE: For details of the important system parameters specific for iron sucrose (e.g., equilibration time of an attenuator), see Table 1.\nIn the opened window, make the required entries under Sample Name and Notes. Confirm by clicking on OK, and wait for the measurement window to open automatically.\nStart the measurement by clicking on the green Start button.\nOnce an acoustic signal sounds at the end of the measurement, close the measurement window.\nSystem suitability test (SST) measurement\n\tNOTE: Do not touch the lower part of the cuvette (measuring zone). At the beginning and at the end of the sequence, measure the 20 nm particle standard.\n\t\nFill ~1 mL of the undiluted particle standard into a polystyrene cuvette, and close with the lid.\n\t\tNOTE: The diluted standard prepared in step 1.5.1 can be used for 1 month.\nAfter filling, close the cuvette, and check for air bubbles. Remove air bubbles by tapping the cuvette lightly.\nPlace the cuvette in the cell holder of the instrument with the arrow mark facing forward, and close the measuring chamber cover.\nLoad the unit parameter SOP, and enter the following data in the start window:\n\t\tSample Name: SST 20 nm Particle Standard\n\t\t​Then, add a note: Identifier number and expiry date of the standard\nStart the measurement.",
    "After the end of the measurement when the acoustic signal sounds, close the measurement window.\nPrint the report (see point 1.1.3).\n\t\tNOTE: The SST is passed if the particle size Z-average corresponds to the value of the certificate of analysis ± 10%.\nMeasurement of the iron sucrose solution\n\t\nPipette 0.5 mL of an IS solution with an iron content of 2% m/V into a 25 mL volumetric flask, and fill up to the mark with low-particle water (e.g. freshly deionized and filtered [pore size 0.2 µm]); this solution contains 0.4 mg Fe/mL.\n\t\tNOTE: The sample preparation in step 1.6.1. with this specific dilution was established during method development, and this was determined as the optimal dilution for this purpose.\nFor preliminary cleaning, fill the polystyrene cuvette approximately 3/4 full with the prepared measuring solution, swirl gently, and then empty as completely as possible.\n\t\tNOTE: Do not touch the lower part of the cuvette (measuring zone), and avoid air bubbles by not shaking the cuvette.\nFor the measurement, pipette 1 mL of the measuring solution into the cuvette, and put on a lid.\nCheck the measuring solution in the cuvette for air bubbles. If there are air bubbles, remove them by lightly tapping the cuvette.\nPerforming the measurement\n\t\nPlace the plastic cuvette with the measuring solution in the device with the arrow mark facing forward, and close the lid.\nLoad the parameter SOP (see step 1.4.1), and enter the following data in the start window:\n\t\t​Sample Name: Batch number\nStart the measurement.\nAfter the end of the measurement, when the acoustic signal sounds, close the measurement window.",
    "Calculate the mean value of the six individual measurements according to Supplemental Figure S5. Mark the individual measurements in the Records View of the Measurement File, right-click on Create Average Result, add the name of the mean value under Sample Name, and confirm by clicking on OK.\nWait for the software to create a new record at the end of the list, and look for the name entered and the averaged result in that record.\nPrint the report (see step 1.1.3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}