{
  "id": 17668,
  "origin_website": "Jove",
  "title": "Evaluation of Capnography Sampling Line Compatibility and Accuracy when Used with a Portable Capnography Monitor",
  "procedures": [
    "The capnography sampling lines used in these bench tests included 16 adult, pediatric, and neonatal capnography sampling lines from 7 commercial sources. Among the 16 sampling lines included in the bench tests, 5 sampling lines were from the same manufacturer as the capnography monitor utilized for the bench tests (‘matched’), and 11 sampling lines were from alternate manufacturers (‘cross-paired’) (Table of Materials). All of the nasal cannula sampling lines share a similar design, with up to 10 connection points between the cannula, humidifier, O2 connector, CO2 connector, 4-way, O2 tube, and CO2 tube (Figure 1).\n1. Measure sampling line tensile strength\nCalibrate the tensile testing jig.\n\t\nIn the tensile testing jig software, set the load cell selection to 100.00 kg and the load parameter to 10.00 kg.\nAttach sampling line components (example: O2 connector with O2 tube) to the calibrated tensile testing jig.\nStarting with a mass of 0 kg, initiate tension on the sampling line component and observe whether the sampling line connection remains intact.\nIf the sampling line connection remains intact, automatically increase the mass in a continuous manner, and observe when the subparts break or disconnect.\n\tNOTE: The resolution of the jig is limited to 10 g increments.\nRecord the maximum tension (kg) exerted before the sampling line break occurred.\nRepeat the tensile strength test for all 10 potential sampling line subparts: O2 connector with O2 tubing; O2 tubing with 4-way; 4-way with O2 tubing; O2 tubing with cannula; cannula with CO2 tubing; CO2 tubing with 4-way; 4-way with CO2 tubing; CO2 tubing with CO2 connector; humidifier with tubing; tubing with cannula.\nRepeat the tensile strength test on 16 sampling lines from 7 commercial sources.\n2. Measure rise time and sampling line accuracy\nCalibrate the rise time measurement device.",
    "Cut standard 0.95 mm internal diameter CO2 PVC tube into ten 15 cm pieces.\nOperate the jig using the following steps:\n\t\t\nTurn on the air compressor, jig controller, and power supply.\nOpen the CO2 gas flow.\nAttach the sampling channel directly to the measurement chamber without the sample.\nCalibrate the air and CO2 flow to 10 L/min and the gas sampling rate to 50 mL/min using a mass flow meter and a dedicated restrictor.\n\t\t\tNOTE: The maximum sampling rate of the capnography monitor is 50 mL/min.\nOpen the jig software and define the test parameters as follows: Air:CO2 ratio 1:1; Air time = 3 seconds, CO2 time = 3 seconds, 10 cycles, rise time measurement length: none.\nOpen the CO2 valve.\nSelect the Finish Calibration button on the Measurement tab and make sure it turns green.\nSelect the Measure button and wait for the gas flow cycles to end.\nClose the CO2 valve.\nRecord the background rise time and ensure the result is less than 60 ms. If it is larger, clean the optical chamber with air flow and re-connect the y-piece/airway adapter properly.\nTake 10 measurements and calculate the average rise time value.\nCompare the rise time value to the margins and confirm it is inside the specification limits, pre-defined as rise time background < 60 ms and rise time of a control sample, a 15 cm PVC tube, 0.95 mm internal diameter, equal to 39 ± 5 ms.\nCompare the delivery time to the margins and confirm it is inside the specification limits, predefined as background delivery time <100 ms and delivery time of a control sample, a 15 cm PVC tube, 0.95 mm internal diameter, equal to 152 ± 5 ms.\nOpen a new commercial sampling line.\nConnect the sampling line to the rise time measurement device.",
    "Click on the Start button in the rise time measurement device software and wait for the device to measure the rise time.\n\tNOTE: The device repeats the measurement 10 times and automatically averages the repeats to report the rise time mean and standard deviation.\n\t\nCopy the rise time result to the report.\nDisconnect the sampling line from the rise time measurement device.\nCalculate maximum respiratory rate for inhalation:exhalation time ratios of 1:1 and 1:2, in breaths per minute (BPM).\n\t\nCalculate the maximum respiratory rate using the measured rise time for the sampling line and a 1:1 breath ratio, using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61670/61670equ01.jpg\nwhere 30 s represents the cumulative time used to exhale during 1 min (1:1 inhalation:exhalation time).\n\t\tNOTE: For a 1:1 breath ratio, the maximum respiratory rate represents the fastest allowed respiratory rate without impacting ETCO2 accuracy when the time required for inhalation and exhalation is the same.\nCalculate the maximum respiratory rate using the measured rise time for the sampling line and a 1:2 breath ratio, using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61670/61670equ02.jpg\nwhere 40 s represents the cumulative time used to exhale during 1 min (1:2 inhalation:exhalation time).\n\t\tNOTE: For a 1:2 breath ratio, the maximum respiratory rate represents the fastest allowed respiratory rate without impacting ETCO2 accuracy when the time used to exhale is twice as long as the time used to inhale.\nCalculate exhalation time for inhalation:exhalation time ratios of 1:1 and 1:2.\n\t\nFor a 1:1 breath ratio, use the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61670/61670equ03.jpg\nwhere 30 s represents the cumulative time used to exhale during 1 min (1:1 inhalation:exhalation time).\nFor a 1:2 breath ratio, use the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61670/61670equ04.jpg\nwhere 40 s represents the cumulative time used to exhale during 1 min (1:2 inhalation:exhalation time).",
    "Determine the accuracy of each sampling line at 150 BPM for 1:1 and 1:2 breath ratios by evaluating the maximum respiratory rate.\n\tNOTE: If the maximum respiratory rate is ≥150 BPM, then the sampling line is considered accurate for the breath ratio, but if the maximum respiratory rate is <150 BPM, then the sampling line is not considered accurate at 150 BPM.\nRepeat steps 2.2-2.8 for all 16 sampling lines tested.\n Perform statistical analysis using statistical software.\n\t\nCompare mean and standard deviation using Student’s t-test, with a two-sided significance level of 0.05, for all capnography monitor matched sampling lines vs. all capnography monitor cross-paired sampling lines.\nRepeat statistical analysis to compare all capnography monitor matched pediatric sampling lines to all capnography monitor cross-paired pediatric sampling lines.\nRepeat statistical analysis to compare all capnography monitor matched adult sampling lines to all capnography monitor cross-paired adult sampling lines.\n3. Measure ETCO2 accuracy as a function of respiratory rate\nPrepare the manikin by placing in a supine position and connect the sampling line to the manikin per manufacturer instructions.\nAttach the sampling line to the capnography monitor and change the capnography monitor setting to accept sampling lines from all manufacturers by selecting Settings and Cancel Gold Ring Identification.\nPrepare and calibrate the breath simulator jig, to control the simulated respiratory rate.\n\tNOTE: The breath simulator jig is composed of a 2-way electrical operating valve, allowing for precise control of the flow of CO2 and N2 to the manikin, to simulate human breathing.\n\t\nUse a flow meter to measure the gas flow and calibrate it to 10 L/min.\nOpen the breath simulator jig software and set the duty cycle to 50%.\nTest for leaks in the system using a leak testing jig.",
    "Connect the sampling line to the CO2 port on the leak testing jig.\nCreate a kink in the sampling line to prevent CO2 from exiting the end of the sampling line.\nUsing a flow rate of 50 mL/min CO2, allow the pressure in the sampling line to increase to 300 mmHg, and then stop adding CO2.\nObserve if the pressure in the sampling line remains the same or decreases. If the pressure decreases, this confirms a leak in the system, and a new sampling line should be applied in Step 4.2.\nConnect the breath simulator jig to the manikin.\nIncrease the 5% CO2 flow rate to 10 L/min and the N2 flow rate to 10 L/min using the breath simulator jig. Keep flow rates constant throughout the test.\nWait 30 seconds to allow a steady capnography waveform to be established, then record the ETCO2 value (mmHg).\nMeasure a total of 10 ETCO2 values over 180 seconds.\nChange the respiration rate using the breath simulator jig, allow the capnography waveform to normalize for 30 seconds, and record 10 ETCO2 readings over 180 seconds.\n\t\nRepeat readings for each respiratory rate examined: 10, 20, 40, 60, 80, 100, 120, and 150 BPM.\nDetermine the average and standard deviation of the 10 measured readings at each respiratory rate.\nRepeat steps 4.1-4.8 for all 16 sampling lines tested.\nPerform statistical analysis using Bland-Altman graphical plots to evaluate sampling line bias.\n4. Measure ETCO2 accuracy in the presence of supplemental O2\nPrepare the manikin and breath simulator jig as described in Steps 4.1-4.3. Set the breath simulator jig to 10 BPM.\nConnect the O2 line to 100% O2.\nIncrease the CO2 flow rate to 6 L/min and the O2 flow rate to 0 L/min, to use as a reference measurement.",
    "To allow the capnography waveform to stabilize, wait 30 seconds before recording the ETCO2 value.\nRead the ETCO2 value 10 times over 180 seconds.\nChange the flow rate of the CO2 and O2, allow the capnography waveform to normalize for 30 seconds, and repeat the 10 ETCO2 measurements over 180 seconds. To capture common clinical scenarios, use the following combinations of CO2 and O2 flow rates:\n\t\nUse a combination of 2 L/min CO2 and 2 L/min O2.\nUse a combination of 4 L/min CO2 and 2 L/min O2.\nUse a combination of 4 L/min CO2 with 4 L/min O2.\nUse a combination of 6 L/min CO2 with 4 L/min O2.\nUse a combination of 6 L/min CO2 with 6 L/min O2.\nUse a combination of 8 L/min CO2 with 6 L/min O2.\nRepeat the test as described in 5.1-5.6 for each sampling line.\nPerform statistical analysis using Bland-Altman graphical plots to evaluate sampling line bias."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}