{
  "id": 8872,
  "origin_website": "Jove",
  "title": "Differentiation of Mouse Embryonic Stem Cells into Cortical Interneuron Precursors",
  "procedures": [
    "NOTE: The dual reporter mESC line described in this protocol is available upon request (sande@mail.med.upenn.edu).\n1. Media Preparation\nNOTE: Warm all media to 37 °C before use in cell culture.\nMouse Embryonic Fibroblast (MEF) media (for preparing 500 mL)\nAdd 50 mL fetal bovine serum (FBS) to 449 mL of Dulbecco's Modified Eagle's Medium (DMEM), and filter through a 500 mL 0.22 µm pore filter unit.\nAdd 1 mL antimicrobial agent (50 mg/mL) after filtration. Store the media at 4 °C for up to 1 month or aliquot and store at ≤ -20 °C.\nN2 media (for preparing 500 mL)\nAdd 5 mL L-alanine-L-glutamine (100x) and 500 µL 2-Mercaptoethanol (55 mM) to 489.5 mL DMEM: Nutrient Mixture F-12 (DMEM/F-12), and filter through a 500 mL 0.22 µm pore filter unit.\nAdd 1 mL antimicrobial agent (50 mg/mL) and 5 mL N2 supplement-B after filtration. Store the media at 4 °C in the dark for up to 1 month.\nSerum-free growth medium (KSR) (for preparing 500 mL)\nAdd 75 mL serum-free medium supplement, 5 mL L-glutamine (100x), 5 mL MEM Non-Essential Amino Acids (MEM-NEAA) (100x), and 500 µL 2-Mercaptoethanol (55 mM) to 413.5 mL non-glutamine containing DMEM, and filter through a 500 mL 0.22 µm pore filter unit.\nAdd 1 mL antimicrobial agent (50 mg/mL) after filtration. Store the media at 4 °C for up to 1 month.\nMouse embryonic stem cell media (for preparing 500 mL)\nAdd 75 mL stem cell grade FBS, 5 mL MEM-NEAA (100x), 5 mL L-glutamine (100x), and 500 µL 2-Mercaptoethanol (55 mM) to 413.5 mL non-glutamine containing DMEM, and filter through a 500 mL 0.22 µm pore filter unit.",
    "Add 1 mL antimicrobial agent (50 mg/mL) after filtration. Store the media at 4 °C in the dark for up to 1 month or aliquot and store at ≤ -20 °C.\n2. Culturing mESCs\nPlate mitotically inactive MEF feeder cells in MEF media onto tissue culture treated plates at 3-4 x 104 cells/cm2. Allow at least 12 h for them to settle in a cell culture incubator at 37 °C with ≥ 95% relative humidity and 5% CO2 before plating the mESCs. If not used immediately, replace the MEF media every 3 days. Dispose of MEFs if not used within 7 days of plating.\nAdd mESCs (density range from 1-4 x 104 cells/cm2) to MEF plates in mESC media containing Mouse Leukemia Inhibitory Factor (mLIF) (1,000 U/mL). Incubate the cells at 37 °C with ≥ 95% relative humidity and 5% CO2.\nPassage mESCs using trypsin-EDTA (0.05% trypsin) (1:5-1:10) once the dish becomes ~ 70-80% confluent or if the colonies are beginning to touch. This typically occurs every 2 days, but can take up to 4 or 5 days depending on the initial plating density.\nMaintain the mESCs on a MEF feeder layer in mESC medium to keep pluripotency.\nBefore starting differentiation, passage the cells at least once onto gelatin coated plates without MEFs to dilute out the MEFs.\nPrepare gelatin coated plates by adding 0.1% gelatin in phosphate buffered saline (PBS) with Ca2+/Mg2+ to a tissue culture treated dish and leaving at 37 °C for at least 1 h. Plate 1.5-2 x 106 cells/10 cm plate (2.7-3.6 x 104 cells/cm2) and allow the cells to expand for 2 days before beginning differentiation.\n3. Differentiating mESCs Toward MGE-like Telencephalic Progenitors\nDifferentiation day (DD) 0 = \"float cells\"",
    "After the mESCs have grown on gelatin coated plates for 2 days, aspirate the media and wash the cells once with PBS without Ca2+/Mg2+. Add enough trypsin-EDTA (0.05% trypsin) to cover the surface of the plate (typically 4 mL trypsin-EDTA for one 10 cm tissue culture dish), and place the cells back into the incubator at 37 °C with ≥95% relative humidity and 5% CO2 for 4 min.\nAfter 4 min, quench the trypsin-EDTA using 2 times the volume with mESC media. Transfer the cells to an appropriately sized centrifuge tube and centrifuge the cells at 200 x g for 5 min. After 5 min, remove the tube and aspirate the media without disturbing the pellet. Resuspend the pellet in 1 mL KSR:N2 media (1:1) containing the BMP inhibitor LDN-193189 (250 nM) and the Wnt inhibitor XAV-939 (10 µM).\nMeasure the cell concentration using a hemocytometer or automated cell counter. Start growing cells as embryoid bodies (EBs) by adding 75,000 cells/mL in KSR:N2 media (1:1) containing LDN-193189 (250 nM) and XAV-939 (10 µM) in non-adherent tissue culture dishes. Incubate the cells at 37 °C with ≥ 95% relative humidity and 5% CO2.\nOn DD1, prepare for cell \"landing\" by coating tissue culture treated dishes with poly-L-lysine (10 µg/mL in PBS with Ca2+/Mg2+) overnight (O/N) at 37 °C with ≥ 95% relative humidity or for at least 1 h.\nOn DD2, aspirate the poly-L-lysine and coat the plates with laminin (10 µg/mL in PBS with Ca2+/Mg2+) O/N at 37 °C with ≥ 95% relative humidity.\n\tNOTE: While O/N is optimal, as little as 2 h may be sufficient. If plates are not used by the next day, aspirate laminin, replace with PBS without Ca2+/Mg2+, and store at 4 °C for up to 2 weeks.\nDD3 (\"land cells\")",
    "Before beginning EB dissociation, aspirate the laminin and allow the plates to completely dry in a tissue culture hood. Do not use plates that appear shiny or visibly wet. Transfer the EBs with media into a 15 mL tube and centrifuge for 3-4 min at 15 x g or until the EBs have pelleted.\nAspirate the media and add 3 mL of cell detachment solution containing DNase (2 U/mL) and incubate at 37 °C with ≥ 95% relative humidity and 5% CO2 for 15 min. Gently flick the tube every 3 min to aid in EB dissociation.\nOnce the EBs are no longer visible or 15 min have elapsed, add 6 mL KSR:N2 (1:1) containing DNase (1 U/mL) and centrifuge for 5 min at 200 x g.\nPlate the cells in KSR:N2 (1:1) containing LDN-193189 (250 nM), XAV-939 (10 µM), and the ROCK inhibitor Y-27632 (10 µM) at 4.5-5 x 104 cells/cm2.\n4. SST-enriching Protocol: \"DD12 GFP High Sonic Hedgehog (SHH)\" (continuation from step 3.7)\nOn DD5, change media with KSR:N2 (1:1) containing FGF-2 (10 ng/mL), IGF-1 (20 ng/mL), and SSH (50 ng/mL).\nPrepare tissue culture plates for re-plating on day 8 (step 4.4) using the instructions outlined in steps 3.2-3.3.\nOn DD7, change media with KSR:N2 (1:1) containing FGF-2 (10 ng/mL), IGF-1 (20 ng/mL), and SHH (50 ng/mL).\nOn DD8, re-plate the cells.\n\tNOTE: While this step is not essential, re-plating the cells can reduce early-differentiated, unwanted cell types. Re-plating also breaks up balls of cells that make downstream immunohistochemical analyses difficult, and increases the efficiency of FACS at later time points.",
    "To re-plate cells, detach the cells from the plate with trypsin-EDTA (0.05% trypsin) for 5 min at 37 °C with ≥95% relative humidity and 5% CO2. Quench the trypsin-EDTA using 2 times the volume with KSR:N2, and centrifuge at 200 x g for 5 min. Filter the cells through a 40 µm filter tube to remove any clumps. Re-plate the cells at 250,000 cells/cm2 in N2/KSR (1:1) containing FGF-2 (10 ng/mL), IGF-1 (20 ng/mL), and Y-27632 (10 µM) with SHH (50 ng/mL).\n\t\tNOTE: If instead, the decision is made not to re-plate the cells on DD8, change the media with KSR:N2 containing SHH (50 ng/mL) every 2 days from DD7 to DD12 and continue to add IGF-1 (20 ng/mL) and FGF-2 (10 ng/mL) until DD9.\nOn DD10, change the media with KSR:N2 containing SHH (50 ng/mL).\nOn DD12, to obtain cells that are enriched for SST subtypes, use FACS to isolate Lhx6::GFP-only expressing cells.\nTo detach the cells, use a non-trypsin containing cell-dissociation reagent rather than trypsin-EDTA. Wash cells once with PBS without Ca2+/Mg2+. Add pre-warmed non-trypsin containing cell-dissociation reagent containing DNase (2 U/mL) to the cells. Place them in the incubator at 37 °C with ≥95% relative humidity and 5% CO2 for 10-30 min or until the cells have detached. Gently tap the plates every 5 min to aid the dissociation.\n\t\tNOTE: For DD11-12 cultures, only 10-15 min may be necessary. For DD15-16 cultures, 30 min or more may be required for complete dissociation.\nOnce the cells have completely lifted off the plate, proceed to FACS isolation using standard protocols or use the cells in other downstream analyses.\n5. PV-enriching Protocol: \"DD11/DD17 mCherry + aPKCi\" (continuation from step 3.7)\nOn DD5, change the media with KSR:N2 (1:1) containing FGF-2 (10 ng/mL) and IGF-1 (20 ng/mL).",
    "Prepare tissue culture plates for re-plating on DD8 (step 4.4) using the instructions outlined in steps 3.2-3.3.\nOn DD7, change the media with KSR:N2 (1:1) containing FGF-2 (10 ng/mL) and IGF-1 (20 ng/mL).\nOn DD8, re-plate the cells as described in step 4.4 with the following exceptions: when re-plating the cells, replace SHH with smoothened agonist (SAG; 30 nM) and add atypical PKC inhibitor (aPKCi; 2 µM). Taken together, the re-plating media is now N2/KSR (1:1) containing FGF-2 (10 ng/mL), IGF-1 (20 ng/mL), Y-27632 (10 µM), SAG (30 nM), and aPKCi (2 µM).\nOn DD10, change the media with KSR:N2 containing aPKCi (2 µM).\nDD11\n\tNOTE: At this point, Nkx2.1::mCherry+ cells are enriched to become PV CIns.\n\t\nDetach the cells from the plate for FACS using the same protocol outlined in step 4.6. If the decision is made to collect Nkx2.1::mCherry+ cells at a later differentiation day, disregard this step.\nOn DD12, change the media with KSR:N2 containing aPKCi (2 µM). On DD14, change the media with KSR:N2 containing aPKCi (2 µM). On DD16, change the media with KSR:N2 containing aPKCi (2 µM). On DD17, collect the Nkx2.1::mCherry+ cells using the same protocol outlined in step 4.6.\n6. PV-enriching Protocol: \"DD17 mCherry Low SHH\" (continuation from step 3.7)\nOn DD5, change the media with KSR:N2 (1:1) containing FGF-2 (10 ng/mL) and IGF-1 (20 ng/mL). On DD7, change the media with KSR:N2 (1:1) containing FGF-2 (10 ng/mL) and IGF-1 (20 ng/mL).\nOn DD9, change the media with KSR:N2 (1:1). From this point onward, no additional growth factors are necessary.\nContinue to change the media every 2 days until harvesting the cells on DD17.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}