{
  "id": 18808,
  "origin_website": "Jove",
  "title": "A Modified Method for Heterotopic Mouse Heart Transplantion",
  "procedures": [
    "Prior to commencement of experiments, obtain approval from the relevant institution’s Animal Care Ethics Committee for the planned experiments. Maintain mice in the accordance with the requirements of your institution. The following protocol has been approved by Sydney University and Royal Prince Alfred Hospital committees.\nPrior to commencing surgery, all instruments should be cleaned thoroughly and sterilized by soaking in 80% ethanol. Some institutions stipulate autoclaving however this can damage fine microsurgical instruments over the long term.  Where possible use sterile disposable equipment.\n1. Anesthesia\nAnesthetize mouse with isoflurane in a sealed container then place it supine on an operating board, quickly connecting anesthetic nose cone. Test adequacy of anesthesia by pinching the hind foot to ensure there is no reflex.\nShave the skin with a surgical blade and sterilize with 80% ethanol. In addition, 2% chlorhexidine in 70% isopropyl alcohol can be used for skin sterilization. During induction of anesthesia the isoflurane concentration is 3% but reduce this to 1-1.5% for maintenance. Make minor adjustments to this concentration to maintain regular breathing and heart rate. Maintain temperature of the animal on a heating pad.\n2. Donor Operation\nMake a thoracotomy to expose the heart and vessels by cutting the chest through both sides of the rib cage from the rib edge up to the axilla followed by a transverse cut at the level of the xiphisternum to form a chest wall flap. Lift this flap up beside the head and pin it to the operating board. Tear off pericardium to expose the heart and vessels.",
    "Lift the inferior vena cava with forceps in one hand and with the other inject 1 ml cold heparinized saline proximal to heart through the IVC, then put a small artery clamp on the IVC to prevent flow of perfusion solution back through the needle hole.\nUsing gauze and a cotton bud, retract the heart downward to expose the ascending aorta and pulmonary artery. Pass one blade of a pair of microscissors through the channel (transverse sinus) posterior to the bundle of aorta and pulmonary artery and cut the aorta and pulmonary artery together as far distally as possible to ensure sufficient length for anastomosis.\nTie and divide the IVC, right superior vena cava (SVC), left SVC and pulmonary veins using 6-0 silk thread. Tie the IVC and right SVC separately then place a single thread posterior to the heart to encircle the left SVC together with pulmonary veins and tie it. Harvest the heart from the donor site by cutting the vessels distal to the ties, then store it in cold sterile saline at 4 °C until transplantation. This results in death of the donor by exsanguination.\n3. Recipient Operation\nAnesthetize the recipient as above (section 1). Carefully shave abdomen to avoid irritation, then make a laparotomy by midline incision from pubis to xiphisternum and retract using paper clips bent to form retractors. Wrap the bowel in warm sterile saline soaked gauze and retract to the upper right of the abdomen.",
    "To expose the infra-renal aorta and IVC, free the bundled segments of aorta and IVC from the left renal artery and vein to the iliac bifurcation by dividing them from the lumbar vessels using a cautery device. Take care that the cautery is at the correct temperature and used for sufficient time to divide and seal the vessel ends.\nApply small atraumatic vessel clamps to the aorta and IVC segments distally and proximally. Make an incision in the front wall of the aorta by first puncturing a hole with a 30 G needle; then cut an incision vertically with microscissors to match the size of the donor aorta. Flush the aorta lumen with heparinized saline to remove any blood clots.\nBring the donor heart to the recipient site covered with gauze soaked in cold saline and place it to the right side of the abdomen. Make sure the donor aorta is positioned next to the incision on the recipient aorta and the donor pulmonary artery positioned next to the recipient IVC.\nAnastomose the donor aorta end-to-side to the recipient aorta using running 10-0 nylon sutures starting from the proximal corner and suturing along the left side first until reaching the distal corner, at which stage the animal is rotated through 180°. Gently move the donor heart to the left side of the abdomen to expose the right side of the aorta and continue suturing through the right side of the aortic wall from the distal end to the proximal end. Before closing the aortic anastomosis, gently flush the lumen with heparinized saline to remove any clot and air.",
    "Anastomose the donor pulmonary artery (PA) end-to-side with the recipient IVC. Make an incision vertically with microscissors in the front wall of the IVC at a site in accordance with the artery anastomosis. Anastomose the donor PA to recipient IVC with running 10-0 nylon sutures starting from the distal end of the left wall within the lumen of the IVC. After reaching the proximal end, continue sutures along the front right side wall up to the distal end to complete the anastomosis. Before closing the anastomosis, gently flush the lumen to remove any clots and air.\nBefore releasing the vessel clamps, place pieces of Gelfoam around the anastomosis sites, and apply gentle pressure with a cotton applicator until hemostasis is achieved. At the time of revascularization, release the distal clamp first, followed by the proximal clamp.\nAfter revascularization, apply warm saline at 37 °C to the graft externally to assist its recovery. The graft usually starts fibrillation immediately and reverts spontaneously to sinus rhythm within a few minutes. Inject 0.6 ml warm saline subcutaneously to maintain hydration of the recipient. Inject buprenorphine subcutaneously for analgesia prior to completion of surgery\nClose the abdominal wound with one 5-0 absorbable running suture for both the layers. Start by completing the inner layer and continue along the skin.\n4. Recovery and Graft Monitoring",
    "Inject ampicillin for prophylaxis of infection and place the recipient on a heating pad at 37 °C for recovery. Most animals recover rapidly and are usually drinking and often eating within 3 hr. If the mouse shows signs of distress, examine closely to determine cause. If no obvious cause, treat with buprenorphine and monitor closely. Consult a veterinarian if symptoms are severe or persist more than 8 hours and consider euthanasia. If necessary, give continuing 12 hourly injections of buprenorphine until symptoms resolve. If the mouse shows signs of distress after 8 hr, give continuing 12 hourly injections of buprenorphine until they resolve. Consult the veterinarian if symptoms continue for more than 48 hr and euthanize if necessary.\nMonitor graft heart beat by direct abdominal palpation and record the strength of beat as ++++ for a healthy graft to + for weak beat due to advanced rejection and – as non beating due to complete rejection of the graft. Monitor mice daily for the first 10 days, then 3x per week for the duration of the experiment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}