{
  "id": 4439,
  "origin_website": "Bio",
  "title": "Isolation of Tomato Fruit Chromoplasts and Determination of ATP Levels",
  "procedures": [
    "Chromoplast isolationPrepare in advance the buffers for chromoplast isolation (buffers A and B) and the sucrose solutions for ultracentrifugation in discontinuous gradients.Wash about 300 g tomato fruits with washing solution for 15 min.Cut fruits and remove seeds and the gelatinous material of the locular cavities. Store the pericarp tissue in a glass beaker placed on ice.Cut the pericarp tissue in small pieces (approximately 1 cm2) with a razor blade.Weigh the pericarp tissue and place in the cold Waring blender jar. Add two volumes of ice-cold buffer A. Homogenize with three pulses of 1 sec each at low speed. Filter the homogenate through 8 layers of gauze and then through 2 layers of Miracloth. Transfer the flow through to two polypropylene centrifuge tubes of 250 ml. Keep samples on ice.Centrifuge at 200 x g for 2 min at 4 °C.Carefully transfer the supernatant to new polypropylene centrifuge tubes of 250 ml. Centrifuge at 5,000 x g for 10 min at 4 °C.Discard the supernatant and gently resuspend the pellets in 25 ml of ice-cold buffer B.Centrifuge at 5,000 x g for 10 min at 4 °C.Gently resuspend the chromoplast pellet in 4 ml of ice-cold buffer B using a 1 ml micropipette (cut the tip to increase its diameter for not harming the chromoplasts).In advance, prepare the sucrose differential density blocks in two 35 ml SW28 ultracentrifuge tubes by carefully loading the corresponding sucrose solutions in the following order (from bottom to top): 8 ml of 50% sucrose solution, 8 ml of 40% sucrose solution, 8 ml of 30% sucrose solution and 8 ml of 15% sucrose solution. Keep at 4 °C. Carefully load 2 ml of the resuspended chromoplast sample on top of the 15 % sucrose solution.",
    "Centrifuge at 50,000 x g for 60 min at 4 °C in a SW28 rotor (mild brake).Carefully remove the tubes from the buckets and hold them using an extension clamp.Carefully harvest the chromoplasts present in the 30-40% interface using a Pasteur pipette and transfer into a prechilled 30 ml centrifuge tube. Add one volume of ice-cold buffer B and centrifuge at 5,000 x g for 10 min at 4 °C.Resuspend chromoplasts in the appropriate buffer according to the protocols used for ATP measurements described in steps B and C.Measurement of ATP levels (end point measurement)Resuspend chromoplasts (step A21) in 750 µl of ice-cold buffer C by gentle pipetting. Samples should be kept continuously on ice.Aliquot the resuspended chromoplasts into microcentrifuge tubes (30 µl per tube) and incubate samples at room temperature (23 °C) on a bench orbital shaker for as long as needed according to the experiment (usually 10 to 60 min). This step allows chromoplasts to perform the biochemical reactions needed for the de novo synthesis of ATP. At the end of the incubation, samples can be processed immediately or stored at -80 °C.Add 90 µl of the “Cell Lysis Reagent” (contained in the kit “ATP Bioluminescence Assay Kit HS II”) to each tube, mix and incubate the samples for 2 min at 95 °C in a heat block, then transfer the samples on ice.Centrifuge the samples for 3 min in a microcentrifuge at high speed and room temperature to pellet chromoplasts debris. Transfer the supernatants to fresh microcentrifuge tubes. Keep samples on ice. Transfer 50 µl from each sample to a 96-well microplate. Keep samples on ice.Perform the ATP determination reactions using the Glomax 96 Microplate Luminometer.",
    "For these experiments only one injector is used, primed with the “Luciferase reagent” included in the kit “ATP Bioluminescence Assay Kit HS II” and prepared in advance following the instructions provided by the supplier. The instrument is set to add automatically 50 µl of the “Luciferase reagent” to each sample and to start the measurements after 1 sec delay. The final outcome values of the instrument show relative luminescence (light) of the samples, which expresses ATP content according to the reaction: D-luciferin + ATP + O2 → oxyluciferin + PPi + AMP + CO2 + light. The values of the blank samples (samples without chromoplasts, but only the buffer C) have to be subtracted from the sample values.Note: The above described method using the “ATP Bioluminescence Assay Kit HS II” kit allows the determination of relative ATP values and the comparison of the ATP content of different samples according to the luminescence observed values. Furthermore, absolute ATP values can be measured using the same kit and method. For this purpose, the ATP standard (contained in the kit) has to be prepared, according to the kit manual, in serial dilutions of known ATP concentration. Next, the luminescence of these serial dilutions has to be determined using the Glomax 96 Microplate Luminometer to generate an ATP standard curve. Comparison of the luminescence values of the samples with those of the ATP standard curve can help for the estimation of absolute ATP values of the samples of interest. The estimated ATP amount can be referred to chromoplast protein content (see step D). Measurement of ATP synthesis rates (kinetics measurements) Reconstitute the “ENLITEN® rLuciferase/Luciferin Reagent” following the instructions provided by the supplier. The reagent has to be stored at -20 °C in 2 ml aliquots for no more than two weeks.",
    "Resuspend chromoplasts (step A21) in 500 µl of buffer D by gentle pipetting. Keep chromoplast samples on ice and start the ATP measurements within the first 15 min after chromoplast isolation.Prime injector 1 of the luminometer with 0.5 mM ADP. Then select the “kinetic protocol” with injector 1 and adjust the settings as indicated: i) injector volume: 40 µl, ii) delay after injection: 0.4 sec, and iii) integration time: 60 sec.Allow the following reagents to equilibrate at room temperature for approximately 5 min. Then, add the reagents in this order into the wells of a 96-well microplate:table:",
    "﻿0,1\nrLuciferase/Luciferin Reagent,80 µl\nBuffer E,80 µl\nDAPP,4 µl\nNADH 100 mM and NAD+ 100 mM (or NADPH 100 mM and NADP+ 100 mM),2 µl of each\nChromoplasts resuspended in buffer D,20 µl\nNote: DAPP is an inhibitor of adenylate kinase that does not affect the ATP synthase.Place the microplate in the luminometer and start the “kinetic protocol”. The injector should inject automatically 40 µl of 0.5 mM ADP and light emission data should be collected during 60 sec for each well.To prepare the ATP calibration curve, select the “non-injection kinetic protocol” in the luminometer and adjust the following settings: i) delay in the first measurement: 0 sec, and ii) integration time: 30 sec.Add the following components in the appropriate wells of the microplate (at room temperature):table:\n﻿0,1\nrLuciferase/luciferin Reagent,80 µl\nBuffer,80 µl\nUltrapure water,20 µl\nDAPP,4 µl\n\"Corresponding ATP standard (10 µM, 0.1 µM or 0.001 µM ATP)\",20 µl\nChromoplasts resuspended in buffer D,20 µl",
    "Note: Chromoplasts are added because they quench part of the light emitted in the luciferase reaction. Place the plate in the luminometer and start the “non-injection kinetic protocol”.Data analysis: Relative luminescence data will appear in an Excel spreadsheet. Calculate the ATP standard curve equation using the Excel functions and apply this equation to obtain the ATP concentration of all samples at each measurement time (sec). Then, the ATP synthesis rate can be represented in a graph (Y-axis: nmol ATP; X-axis: sec) and can be expressed as nmol ATP x mg protein-1 x sec-1 performing the appropriate calculations. Note: Data from the first 5 sec of kinetics measurements are discarded because they are usually erratic. Determination of protein content of chromoplast samplesAliquots of 50 µl of chromoplast samples resuspended in buffer C or D are supplemented with Tween-20 at 1% final concentration and incubated at 4 °C in an orbital shaker for 30 min.Process the samples using the RC DC Protein Assay kit following the indications provided by the supplier.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140729/20140729060631_1175.jpgFigure 1. Transversal section of a tomato fruit (var. MicroTom). (A). Preparation of fruit samples prior to homogenization (B, C and D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140729/20140729060648_2931.jpgFigure 2. Schematic overview of the procedures included in this protocol showing the typical results obtained in each case"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}