{
  "id": 3048,
  "origin_website": "Cell",
  "title": "Protocol to assess substrate dephosphorylation by serine/threonine phosphoprotein phosphatases in vitro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart I: In-vitro phosphorylation of substrates with purified kinases\nTiming: 2 h\nThese steps prepare phosphorylated substrates (i.e.: GST-p107-R1-R2 variants (WT and Mutants) for dephosphorylation by the PP2A holoenzyme. Multiple kinases and substrates are suitable to generate phosphorylated substrates.8[href=https://www.wicell.org#bib7],9[href=https://www.wicell.org#bib11],11[href=https://www.wicell.org#bib8],12[href=https://www.wicell.org#bib9],13[href=https://www.wicell.org#bib10]\nAliquot 0.1–0.5 μg of GST-protein loaded Sepharose beads and equilibrate with 100 μL 1× KAS buffer.\nCentrifuge at 775 × g for 3 min at 4°C and aspirate buffer.\nRepeat wash with 1× KAS buffer and the centrifugation and aspiration steps.\nAdd 10 μL 1× KAS + 1.5 mM ATP + 1 unit of Kinase to the beads (e.g.: Cyclin B/CDK1. Cyclin A/CDK2 or Cyclin E/CDK2 can also be used with GST-p107-R1-R2 substrates).\nShake at 37°C for 1 h using modified vortex genie (flat adapter capable of holding microcentrifuge tubes) at shake level 3.\nCentrifuge at 775 × g for 3 min at 20°C–24°C and aspirate buffer.\nEquilibrate GST-protein loaded Sepharose beads for dephosphorylation with 1 mL of Complete DIP buffer.\nRepeat centrifugation and equilibration step with 1 mL of complete DIP buffer.\nFor control samples that do not need to be dephosphorylated, the reaction can be terminated with 2× LSB.\nAspirate residual buffer to move on to dephosphorylation (Part II).\nPart II: In vitro dephosphorylation of phospho-GST-fused-substrates with purified PP2A/B55α\nTiming: 4 h\nThis step allows determining the ability of PP2A holoenzymes to dephosphorylate specific phospho-substrates in a variety of conditions (time dependent, dose-dependent, comparison of substrates, etc). The steps below are for time dependent conditions.\nPrepare an appropriate volume of Master mix consisting of 5 μL phosphatase and 10 μL of Complete DIP buffer per sample.\nAdd the 15 μL phosphatase-DIP master mix to the phosphorylated substrate and incubate at 37°C for the given timepoints (e.g.: 0.25, 0.5, 1, and 2 h).",
    "Terminate the reactions with LSB followed by heating to 65°C.\nResolve proteins using SDS-PAGE (8%–10%, depending on the size of the GST-fused substrates).\nFor substrates which shift migration upon phosphorylation, stain the gel with Coomassie Blue.\nFor these and substrates where the migration shift is difficult to observe a western blot using phosphospecific antibodies to detect phosphorylation/dephosphorylation of substrates might be needed (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2591-Fig2.jpg\nFigure 2. Dephosphorylation of Cyclin B/CDK1 phosphorylated GST-p107-R1-R2 with purified PP2A/Flag-B55α and enzyme/GST-fused substrate binding assay\n(A) Purified GST-p107-R1-R2 loaded on glutathione Sepharose beads was phosphorylated with purified Cyclin B/CDK1 in the presence of ATP for 1 h at 37°C. After washing the beads, with DIP buffer, P-p107-R1-R2 was dephosphorylated with purified PP2A/Flag-B55α holoenzyme for the indicated amount of time. The beads were resolved by SDS/PAGE followed by western blot analysis with anti-P-SP CDK substrate antibody and subsequently the PVDF membrane was stained with Coomassie Blue.\n(B) Glutathione beads loaded with GST or GST-p107-R1-R2 substrates were incubated with 293T lysates, washed and resolved by SDS/PAGE followed by western blot analysis using anti-B55α and subsequently the membrane was stained with Coomassie Blue.\nNote: This will add 4–5 h to timing of Part II.\nNote: in this case the PVDF membrane can also be blotted with anti-GST antibodies to visualize the GST-fusion proteins or the membrane can be stained with Coomassie Blue. Coomassie Blue staining of the membrane should be the last step, as it could potentially be detrimental to subsequent blotting with antibodies.\nPart III: In-vitro GST-fused substrate binding to PP2A/B55α using cell lysates or purified enzyme.\nTiming: 1 h–1 day\nThese steps allow to determine the ability of the holoenzyme to bind the substrate.\nAliquot normalized GST-fused substrate loaded Sepharose beads and equilibrate with 100 μL Complete DIP buffer.",
    "Centrifuge at 775 × g for 3 min at 4°C and aspirate buffer.\nRepeat wash with Complete DIP buffer and repeat centrifugation and aspiration.\nPrepare the source of PP2A/B55α holoenzyme:\nIf using a cell lysate, prepare it from any cell lines expressing endogenous PP2A/B55α holoenzymes using 200–400 μg of lysate (∼1 μg/μL).\nAlternatively, use 5 μL purified PP2A/B55α holoenzyme with Complete DIP buffer (minimum volume of 250 μL) per sample.\nCollect sample inputs (5%–10%) for future SDS-PAGE applications.\nAdd washed GST-protein beads (0.2–0.5 μg) to the lysates or purified PP2A/B55α and incubate at RT or 4°C on a rotator (1 h, this step can also be done overnight).\nCollect sample supernatants (5%–10%) for future SDS-PAGE applications.\nPerform wash of protein-bound, GST-substrate loaded Sepharose beads with 1 mL of Complete DIP buffer.\nCentrifuge at 775 × g for 3 min at 4°C and aspirate buffer.\nRepeat wash step and aspiration two additional times.\nOn-bead complexes can be denatured using 2× LSB and heating to 65°C.\nResolve proteins using SDS-PAGE followed by western blot analysis to detect B55α, PP2A/A, and PP2A/C binding to the GST-fused substrate.\nStain the membrane with Coomassie Blue to visualize the GST-fused substrates (Figure 2[href=https://www.wicell.org#fig2]B).\nAlternatively, a western blot can be performed with anti-GST antibodies to visualize the GST-fused proteins.\nPart IV: In-vitro GST-substrate binding to PP2A/B55α competition assays with synthetic peptides.\nTiming: 5 h–1 day\nThese steps allow to determine the ability of wildtype and variant synthetic peptides to compete substrate binding to the holoenzyme. The use of mutant variant peptides with amino acid substitutions allows to determine the key residues important for the substrate holoenzyme interaction.\nProcure synthetic peptides derived from your protein of interest (e.g.: p107). We have used 16-mer peptides.\nSolubilize and dialyze peptides according to manufacturer peptide specifications.",
    "Pre-incubate purified PP2A/B55α holoenzyme (5 μL) with 30–300 μM of synthetic peptide at 37°C for 30 min in a final volume of 200 μL in Complete DIP buffer.\nAdd normalized purified GST-fused substrate to the pre-incubated holoenzyme for 3–16 h at 4°C using on a rotator.\nCollect sample supernatants (5%–10%) for future SDS-PAGE applications.\nPerform wash of GST-protein loaded Sepharose beads with 1 mL of Complete DIP.\nCentrifuge at 775 × g for 3 min at 4°C and aspirate buffer.\nRepeat wash steps four additional times.\nDenature proteins with 2× LSB and heat to 65°C.\nDetect proteins using SDS-PAGE followed by western blot analysis.\n(Note that the peptide competitions can also be applied to dephosphorylation assays)."
  ],
  "subjectAreas": [
    "Chemistry",
    "Protein Expression And Purification",
    "Cell Culture",
    "Signal Transduction",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}