{
  "id": 5895,
  "origin_website": "Bio",
  "title": "FACS-based Isolation of Neural and Glioma Stem Cell Populations from  Fresh Human Tissues Utilizing EGF Ligand",
  "procedures": [
    "Fresh brain tissue dissociation into single cell suspensionNotes:  Tissue processing and FACS are performed in a Biological Safety Level (BSL-2) laminar flow hood, using universal precautions for bloodborne human pathogens. All tissues are collected de-identified, under approved IRB protocols. It is recommended that tissues/cells are kept on ice as much as possible, unless otherwise noted for specific incubation steps.Collect fresh brain tissue (GM postmortem dissection or GBM surgical resection) in cold, freshly prepared PIPES solution (see Recipes). Dissolve papain in activating solution (1 ml of activating solution per 0.003 g papain for each 50-200 mg tissue) (see also Note 7). Note: The papain must be activated for at least 20 min but no more than 30 min at room temperature, prior to tissue incubation.Mechanical digestionWhile the papain is activating, mince the tissue with a razor blade in a small Petri dish, containing a small volume of cold PIPES solution (1-2 ml), until the tissue is finely minced (Figure 1A). The process of mincing should not last more than 5 min. Once the tissue is minced, the Petri dish should be placed on ice.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214195154_1015.jpgFigure 1. Tissue dissociation from fresh human brain tissue. A. Mechanical tissue dissociation using a razor blade, prior to adding papain. B. Enzymatic tissue dissociation using papain, with resultant cell pellet after centrifugation. C. Cell suspension formed after trituration of dissociated tissue. D. Layering of cell suspension onto 22% Percoll solution. E. Separation of cells from extracellular debris after gentle centrifugation in 22% Percoll. Myelin and other extracellular debris are contained within the supernatant (top) while live cells are pelleted (bottom).Transfer the minced tissue into a 15 ml Falcon tube and add additional cold PIPES solution up to 9 ml.",
    "Add 1 ml of activated papain for a final volume of 10 ml (final concentration of papain 300 μg/ml). Note: Papain digestion solution (10 ml total) = 0.003 g papain + 1 ml activating solution + 50-200 mg tissue in 9 ml cold PIPES.Enzymatic digestionIncubate the tissue with activated papain, 13 min at 37 °C, in a rotating incubator (rocking speed: 12 rpm). After the first 5 min, add 50 μl of DNase I (10 mg/ml, see Recipes), mix the digesting tissue by shaking, and then re-incubate at 37 °C for the remaining 8 min.Centrifuge the digested tissue in a refrigerated centrifuge, 10 min at 310 x g at 4 °C.Stop the enzymatic digestionAfter centrifugation, there will be a pellet of cells (Figure 1B). Gently decant the supernatant, taking care not to disturb the pellet, which may be loose. Resuspend the cells in 1 ml of ice cold DMEM/F-12 with additional 50 μl of DNAse I (10 mg/ml) and 100 μl of papain/trypsin inhibitor (ovomucoid) (7 mg/ml, see Recipes).Single cell suspensionTriturate the cell pellet continuously first with a P1000 pipette until no tissue chunks are visible (Video 1). Then, triturate with a P200 pipette, approximately 50 times, or until a murky, homogenous cell suspension is obtained without visible debris (Figure 1C) (Video 2). Avoid foaming.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Primary trituration of dissociated tissue suspension using P1000. After enzymatic digestion, the dissociated cell pellet is triturated continuously first with a P1000 pipette until no large tissue chunks are visible.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Secondary trituration of dissociated tissue suspension using P200. Subsequent trituration with a P200 pipette is also performed in order to obtain a homogenous cell suspension without any visible debris.Eliminate extracellular debrisAdd 4 ml of cold 22% Percoll solution to new, sterile 15 ml tubes (two tubes per sample).",
    "Take approximately half of the cell suspension (~650 μl) and layer it on top of the Percoll in a continuous drop-by-drop manner in order to prevent as much as possible mixing between the cell suspension and the Percoll solution (see Recipes and Note) (Video 3) (Figure 1D). Layer the remaining half of the cell suspension into another tube with 4 ml of cold 22% Percoll (split each cell suspension sample into two Percoll tubes).Note: Tilting the Percoll tube at 45° while adding the cell suspension may help to prevent mixing. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Elimination of extracellular debris using Percoll solution. The cell suspension is carefully layered onto a 22% cold Percoll solution in a continuous drop-by-drop manner, with the tube being tilted at 45°, minimizing contact between the Percoll solution and the cell suspension. This step allows elimination of myelin and other extracellular debris. Centrifuge the sample, 10 min at 594 x g in a refrigerated centrifuge at 4 °C, with ‘no brake’ or ‘free deceleration’ setup.After centrifugation, myelin and other extracellular and fibrillar debris will be contained within the Percoll supernatant, while intact cells will be pelleted at the bottom of the tube (Figure 1E). Carefully decant the entire supernatant and resuspend each pellet in 450 μl of cold 1% BSA/0.1% glucose/1x HBSS (see Recipes). Re-combine every two resuspended pellets (that were split during Step A9) into a new 15 ml Falcon tube.Eliminate red blood cells: Add 100 μl (10x) of Red blood cell lysis (RBL) buffer and incubate at room temperature, 10 min.Wash the RBLAfter erythrocyte lysis, add 9 ml of cold 1% BSA/0.1% glucose/1x HBSS and centrifuge, 5 min at 310 x g at 4 °C.Count live cellsDecant the supernatant and resuspend the cell pellet in 550 μl of cold 1% BSA/0.1% glucose/1x HBSS.",
    "Count the number of live cells using trypan blue exclusion in a hemocytometer. Mix 5 μl of trypan blue with 5 μl of sample, and load in a hemocytometer chamber to count live cells, which exclude trypan blue, under the microscope. Calculate the number of live cells in the stock solution.Ligand and antibody incubation for FACS:Aliquot out 5% of the total cell suspension for each single color/no color controls (approximately 30 μl for each) and use the remaining cell suspension for the experimental sample.For the experimental sample, add EGF-Alexa Fluor 647 ligand (5 μg/106 live cells) and exclusion antibody markers (anti CD24-PE, 1:10; anti CD34-PE, 1:10; anti CD45-PE, 1:10) to the remaining cell suspension in the same 15-ml tube (approximately 450 μl). Mix gently by flicking the tube.For single color controls, add EGF-Alexa Fluor 647 ligand only or CD24-PE/CD34-PE/CD45-PE only to each 30 μl (5%) cell suspension aliquot in a new 15-ml tube, using the same ligand and antibody dilution used for the experimental sample. For the no color (DAPI only) control, incubate the 30 μl aliquot on ice without adding anything and add DAPI only during Step A18.Incubate on ice, 30 min, in darkness. Re-mix gently by flicking the tube after the first 15 min.Wash unbound antibodies/ligandWash all tubes with 10 ml of cold 1% BSA/0.1% glucose/1x HBSS and centrifuge, 5 min at 310 g at 4 °C.Decant the supernatant and resuspend the cell pellet in 1 ml of cold 1% BSA/0.1% glucose/1x HBSS with DAPI (1:1,000).Achieve single cell suspension and minimize clumping:Pass the solution through a 40 μm filter.Fluorescence-Activated Cell Sorting (FACS)Note: Technical support during sorting is highly recommended for untrained personnel.Gate and sort cells following gating procedure described in Tome-Garcia et al. (2017) and in Figure 2.",
    "No color (DAPI only), single color, and fluorescence minus one color (if using more than two colors) controls should be performed with each experiment to establish negative/positive cut-off values for the specific cell populations tested, and to ensure consistency.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214211708_1417.jpgFigure 2. Isolation of EGFR+ cells from freshly dissociated GM and GBM tissues by FACS. Representative examples of sequential gating during FACS in order to eliminate tissue debris (A) (GBM sample), exclude cell doublets (B and C) (GBM sample), remove dead/dying cells using DAPI (D and F) (GBM and GM samples, respectively), and exclude ependymal/neuroblasts/endothelial/inflammatory cells using CD24/34/45 antibody cocktail (E and G) (GBM and GM samples, respectively, see also Note 6). In GBM, but not in GM sorts, a subset of live cells displays a shift in DAPI fluorescence (DAPIlow) (D). The EGFR+ DAPIlow GBM population contains the majority of cells with stem cell properties (Tome-Garcia et al., 2017) (see also Notes). Violet-A, PE-A, and APC-A light filters were used to visualize DAPI, bound CD24/34/45-PE antibodies, and bound EGF-AF647 ligand, respectively.After proper gating, collect EGF-bound (i.e., EGFR+) live (DAPI- and DAPIlow) cells for molecular or functional downstream analysis. For cell culture, collect cells in a 1.5 ml microcentrifuge tube containing sterile and freshly prepared neurosphere media (see Recipes) supplemented with EGF (20 ng/ml) and bFGF (20 ng/ml). Note: Neurosphere growth is also observed in the absence of ligand supplementation.Functional validation of in vitro stem cell behaviorNote: Culture validation is recommended for all GBM tumors, since in rare cases, tumors without a well-defined EGFR+ population may show sphere growth in both positive and negative fractions (Tome-Garcia et al., 2017) (see also Note 4).Seed the cells in 96-well low-attachment plates at a clonal density of 10 cells/μl (200 μl/well), (Pastrana et al., 2011), in triplicate wells at minimum.",
    "Let the cells form neurospheres for one week and then change media every three days (replace only ~1/3-1/2 of the media volume, removing it carefully from the edge of the well without disturbing the neurospheres). Neurosphere formation can be checked under an inverted microscope as soon as 1 week after seeding (Figures 3A-3B). Consider letting cells grow for 12-21 days or until neurospheres reach at least 40 μm diameter before passaging them into secondary neurospheres or testing their multipotency for differentiation (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214212055_8500.pngFigure 3. In vitro functional analysis of stem cell properties of acutely isolated EGFR+ and EGFR- GM and GBM cells. A-B. FACS-isolated EGFR+ and EGFR- primary cells are seeded at clonal density (10 cells/μl). Neurosphere formation, assessed at day 6 of seeding, in GM EGFR+/EGFR- populations (A), and at day 12 in GBM EGFR+/EGFR- populations (B). C. Illustration of trilineage differentiation of primary GM neurospheres using immunofluorescence, with EGFR+ cells showing differentiation into astrocytic (GFAP+,  white); neuronal (TuJ1+, red) and oligodendroglial (O4+, green) lineages. DAPI (blue) is used to counterstain cell nuclei. Magnification of neurosphere pictures, 10x. Pictures have been adapted from Tome-Garcia et al., 2017. Scale bars = 20 μm.To differentiate neurospheres, pick up single neurospheres with a 200 μl pipette and seed them on laminin-coated chambers. Let the neurospheres attach to the laminin for 4-5 h in a 37 °C cell incubator. Once attached, remove the old neurosphere media, and add new neurosphere media without B27, EGF, bFGF growth factors supplement. Let the neurospheres differentiate in a 37 °C cell incubator for 1 week with no change of media.Note: Prior to neurosphere seeding, Lab-Tek® chambers should be pre-coated with laminin (10 μg/ml), incubated overnight at 37 °C, and then washed three times with 1x PBS.",
    "After 1 week of differentiation, fix the cells using 4% PFA solution (see Recipes), 10 min at room temperature. Wash the cells with 1x PBS (see Recipes), three times.To perform immunofluorescence studies, incubate the differentiated cells with blocking solution (10% normal donkey serum (NDS)/0.5% Triton X-100) (see Recipes), 1 h at room temperature, and then incubate with primary antibodies in 1% NDS/0.25% Triton X-100 (see Recipes), overnight at 4 °C. Perform three washes with 1x PBS, 5 min each, and incubate with species-appropriate fluorochrome-conjugated secondary antibody in 1% NDS/0.25% Triton X-100 (see Recipes), 4 h at room temperature. Wash the secondary antibody with 1x PBS, 5 min each, counterstain with DAPI (1:1,000), and mount with Aqua-Poly/Mount aqueous mounting medium.Specifically, for O4, immunofluorescence is performed on live, unfixed cells. Incubate cells with primary anti-O4 antibody, 40 min at 4 °C, perform three washes with DMEM/F-12 media, 5 min each at room temperature, and incubate with anti-mouse IgM secondary antibody, 40 min at 4 °C. Wash three times with DMEM/F-12 media at room temperature, 5 min each time, and fix cells for 10 min with 4% PFA solution.Check immunoreactivity for GFAP (astrocytes), TuJ1 (neurons) and O4 (oligodendrocytes) under a confocal or epifluorescence microscope (Figure 3C)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}