{
  "id": 8084,
  "origin_website": "Bio",
  "title": "Isolation of Infiltrating Leukocytes from the Spinal Cord of Mice",
  "procedures": [
    "Preparation of the animalEuthanize the mouse using CO2 gas (cervical dislocation might damage the spinal cord therefore it should be avoided).Spray the mouse with 70% ethanol to maintain aseptic conditions and cut open the chest wall to expose the heart.Perfusion of the animalAttach a 27G needle to a 10 ml syringe pre-filled with ice-cold PBS.Cut the right atrium of the heart with scissors (Figure 1). Perfuse the animal with the entire 10 ml of PBS through the left ventricle (Figure 1), repeat this procedure for 3-5 times (final volume of ~50 ml). Alternatively, a perfusion pump can be used in this step. By the end of the perfusion, the effluent from the atrium should be clear and the liver should have lost its red color. If this does not occur, continue to perfuse. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150128/20150128223742_9978.jpgFigure 1. Photograph of the heart with the incision site (right atrium) and injection site (left ventricle) indicted.Isolation of the spinal cordSpray the back of the mouse with ethanol. Remove the head using scissors by doing a clean cut at the base of the head (start of the spinal column). Then expose the spinal column by cutting open the skin on the back from the base of the head to the tail of the animal. Identify where the base of the spinal column attaches to the pelvis.Using a pair of scissors, make a perpendicular cut through the spinal column at this location. Attach an 18G needle to a 10 ml syringe pre-filled with PBS. Hold the spinal column with forceps and identify the spinal canal at the caudal end of the spinal column. Carefully insert the 18G needle up to 10 mm at this point. Resistance will be encountered as the needle enters the spinal canal.",
    "Slowly push past the resistance in the canal until the point where the resistance is suddenly lost. Hold the spinal column over the 75 mm petri dish and flush the spinal cord out of the column.Dissociation of the spinal cord tissueTransfer the spinal cords to a 50 ml conical centrifuge tube containing 1x PBS and keep on ice (pool a maximum of 5 spinal cords per tube). In a petri dish and using scalpel or scissors and a pair of forceps, cut the spinal cords into very small pieces of about 10 mm.Transfer the spinal cord pieces into a 70 µm cell strainer placed on top of a 50 ml conical centrifuge tube and homogenize the tissue using the plunger of a 5 ml syringe. Add cold PBS to wash the cell strainer and top up to 50 ml.Centrifuge at 400 x g for 10 min, discard the supernatant and resuspend the cells in 5 ml of 30% isotonic Percoll (prepared using Percoll stock solution and 1x PBS). Add the 30% isotonic Percoll gently on top of 4 ml 70% isotonic Percoll (prepared using Percoll stock solution and 1x PBS) contained in a 15 ml conical centrifuge tube. Avoid mixing of the interface between the 70% and 30% solutions. Percoll should be used at room temperature, since cold cells tend to clump.Centrifuge for 20 min at 500 x g, at room temperature, without break or accelerator. The myelin will form a compact layer at the top, while the leukocytes will form an opaque ring between the two layers of Percoll, the so called interface.Remove the myelin and part of the supernatant above the interface by aspiration.Collect the cells in the interface into a clean 15 ml conical tube.",
    "Wash the cells 1-2x with 1x PBS by centrifuging at 400 x g for 5 min. Proceed with any further analysis of experimentation. If culturing of the cells is required, processing of the spinal cords (step IV) should be performed under sterile conditions, e.g. in a biological biosafety cabinet."
  ],
  "subjectAreas": [
    "Immunology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}