{
  "id": 9323,
  "origin_website": "Jove",
  "title": "Live Imaging of Mitosis in the Developing Mouse Embryonic Cortex",
  "procedures": [
    "1. Preparation of Media (Figure 1, Step 1)\nSlice Culture Medium\n\t\n25 ml of slice culture medium is sufficient to prepare 5 glass bottom dishes with 2 slices per well.\nIn a 50 ml conical tube, add 250 µl of a 100x N2 solution and 500 µl of a 50x B27 solution without vitamin A. Add DMEM/F12 to a volume of 22.5 ml.\nFilter sterilize solution and subsequently add 1.25 ml of heat inactivated horse serum and 1.25 ml of fetal bovine serum.\nIncubate solution in a water bath at 37 °C for the duration of the preparation of the slices.\nAdd growth factors (FGF and EGF, final concentration of 10 ng/ml and 20 ng/ml, respectively) immediately prior to the beginning of culture. The composition of this medium has been optimized to promote the survival of cells in culture and to increase the proliferation rate of neural progenitors. This will thus maximize the probability to observe mitotic cells in the slice.\nFull HBSS Dissection Solution\n\t\nPrepare 500 ml of full HBSS by adding 50 ml of 10x HBSS, 1.25 ml of 1 M Hepes (pH 7.4, FC 2.5 mM), 6 ml of 2.5 M D-Glucose (FC 30 mM), 2.2 ml of 0.9 M NaHCO3 (FC 4 mM) and autoclaved diH2O to final volume of 500 ml.\nFilter sterilize solution and store at 4 °C until the collection of uterine horns from the pregnant mouse. This solution can be kept at 4 °C for weeks.\nKeep HBSS on ice during the whole dissection procedure.\nEmbedding solution\n\t\nFor the embedding of 4 embryonic brains, prepare 30 ml of 3% low melting agarose in the full HBSS solution. In a 50 ml conical tube, add 0.9 g of low melting agarose and full HBSS to 30 ml.",
    "Mix the solution with a vortex mixer, and melt in a microwave with the tube standing and the cap open.\nWhile in the microwave, monitor the solution to prevent overflow due to excessive boiling. When boiling starts, stop the microwave and vortex the solution.\nRepeat these steps until all the agarose has melted.\nStore the tube in a water bath at 42 °C.\n2. Dissection of the Embryos (Figure 1, Step 2)\nAfter careful euthanasia of the pregnant mouse, collect the uterine horns and transfer them into a 10 cm2 Petri dish containing cold full 1x HBSS. The age of the embryo can vary depending upon the study. This protocol has been used successfully for culturing brain slices from embryonic days E12.5 to E17.5. Due to their size, younger brains tend to be more difficult to work with.\nCollect the embryos and dissect out the embryonic brains as described previously in the rat and mouse26,27, until a full embryonic brain including the hindbrain and the forebrain with the two cerebral hemispheres is obtained. These can be kept at RT until all brains have been dissected.\nCollect the embryos and dissect out the embryonic brains as described previously in the rat and mouse26,27, until a full embryonic brain including the hindbrain and the forebrain with the two cerebral hemispheres is obtained. These can be kept at RT until all brains have been dissected.\n3. Embedding of the Embryonic Brains (Figure 1, Step 3)\nIn a bucket containing ice, create a hole in ice to insert the embedding molds into.\nPour the 3% agarose medium into a plastic mold and place that mold into the hole prepared in the ice.\nStir the agarose medium with the tip of a digital thermometer until the temperature reaches 35 °C.",
    "Promptly transfer the brain into the embedding medium.\nCritical Step: To remove the excess HBSS at the interface between the brain and the agarose, carefully and gently tumble/rotate the brain repeatedly in the embedding solution with the forceps.\nA cushion of gelled agarose will form at the bottom of the mold in contact with the ice. Once the cushion can be felt with the tip of the forceps while stirring the brain, position the brain with the dorsal side up. The brain should not sink to the very bottom of the mold.\n4. Preparation of Agarose Block (Figure 1, Step 4)\nLet the agarose harden in the ice for at least 5 min.\nUsing a razor blade, section the corners of the mold.\nCarefully carve an agarose block around the brain using a razor blade. Try to minimize the number of cuts to avoid perturbing the embedded brain.\nMake sure that the block has a larger surface area in the caudal region of the brain (versus the rostral region, see Figure 1, Step 4) to increase the stability of the block on the sectioning pedestal.\nThe last cut should be the one on the caudal side of brain; this cut will define the correct sectioning plane with the vibratome.\nDo so by aligning the blade perpendicular to the rostro-caudal axis of the brain and the agarose block. Slide down the blade caudally along the rostro-caudal axis and make the final cut about 5 mm away from the most caudal region of the brain.\nSet the agarose/brain block aside and repeat embedding of other brains.\n5. Transfer of the Embedded Brains into the Tray of the Vibratome (Figure 1, Step 5)",
    "Add a drop of glue onto the bottom of the vibratome tray. Place glue so that the agarose blocks will be positioned within reach of the vibrating blade.\nPlace the agarose/brain block caudal side down on the edge of the spatula, with about 50% of the block tipping over the edge of the spatula.\nApply the caudal face of the agarose block to the glue and slide the spatula away, maintaining the agarose block to the bottom of the tray with the shoulder of a pair of tweezers. Do not let the spatula directly contact the glue.\nLet the glue solidify at room temperature for 5 min.\n6. Sectioning of the Embedded Brains (Figure 1, Step 6)\nFill the vibratome tray with HBSS.\nDefine the start and finish positions of the vibratome blade.\nGenerate 200 - 250 µm slices. With the VT1000s vibratome, use the following parameters: speed 2 - 4, frequency 8.\nCarefully remove the slices from the vibratome as they are cut. Transfer the slices with a spatula and the back end of tweezers into 12 well dishes filled with full HBSS. Alternatively some researchers have used a paintbrush in lieu of tweezers. Key point: During transfer, take care that the brain slices remain attached to the surrounding agarose.\n7. Syto11 Staining of the Slices (Figure 1, Step 7)\nDilute Syto11 to a final concentration of 0.5 - 1 µM in the slice culture medium supplemented with growth factors.\nIn the well of a 12-well plate, incubate slices from one brain in 2.5 ml of the staining solution for 1 hr at 37 °C.\nWash the slices in 2.5 ml of slice culture medium without staining solution for 20 min.\n8. Mounting the Slices in a Glass Bottom Dish (Figure 1, Steps 8, 9)",
    "Prepare 15 µl of embedding collagen solution per slice. Prepare a 1.5 mg/ml collagen solution by mixing 375 µl of 3 mg/ml collagen type I solution with 75 µl of 10x DMEM, 9.4 µl of 1 M NaOH, and 290 µl of H2O. Store on ice.\nPlace a 15 µl drop of the collagen solution at the bottom of a 35 mm Glass bottom Microwell Dish. Spread it with a pipet tip to match the size of the slice.\nTransfer the slice into the drop of collagen with a spatula and pair of tweezers. Key point: Mounting multiple slices in different dishes increases the probability to acquire slices suitable for imaging. Screen through different slices and select the ones that best meet the criteria described below in the \"Representative Results\" section.\nLet the slices incubate at RT for 10 min before transferring them into a 37 °C incubator with 5% CO2.\nAfter 20 min, add 1.2 ml of slice culture medium into the Glass Bottom Microwell Dish. Add 600 µl of medium at a time and spread it with a pipette tip.\nCapture a low magnification image of the brain slice to record the anatomical level and integrity of the slice.\n9. Live Imaging of the Slices (Figure 1, Steps 10, 11)\nLet the slices recover in the incubator for at least 1 hr and 30 min at 37 °C with 5% CO2 before live imaging.\nImage the slices with the microscope of choice, keeping in mind that Syto11 is very prone to photobleaching. Here an inverted spinning disk confocal microscope is used (Andor XD revolution spinning disk confocal microscope). Alternatively a laser scanning confocal microscope can be used. The following parameters are for the spinning disk microscope set-up.",
    "During the entire live imaging session, maintain slices at 37 °C, 5% CO2 in a humidified incubation chamber attached to the microscope.\nImage cells with a 60X silicon oil objective with a working distance of 300 µm, and a numerical aperture of 1.3 (for examples see Figures 3B, 3C, 3E, 3F, 4A, 4B). A 100X oil objective with a working distance of 130 µm and a numerical aperture of 1.4 (for example see Figure 4C) can also be used. The resolution of the camera is 512 x 512.\nImage the cells in a 30 µm z-stack, with the center of the z-stack located about 40 µm below the surface of the slice. Trying to image deeper into the tissue can cause the objective to add mechanical pressure on the slice. This can affect the integrity of the brain slice. If planning to make 3D reconstructions of the cells, use a z-interval of no more than 2 µm.\nAdjust the laser power and exposure times to limit photobleaching. Use exposure times ranging from 30 to 200 msec, depending on the intensity of the Syto11 signal.\nWith a motorized stage, image multiple positions across multiple slices mounted in 1 dish. For example, image up to 20 positions scattered across 4 different slices in 1 single dish.\nFor live imaging, use a temporal resolution of less than 5 min to enable the identification of the different phases of mitosis. Using Syto11 and/or histone H2B-EGFP, 4 - 5 hr of live imaging are sufficient to observe a significant number of mitotic cells. However, if imaging sparsely labeled mitotic cells (such as those achieved by in utero electroporation), then a longer imaging parameter (overnight) is appropriate and works well.",
    "Note: Using this protocol, we typically observe on average 10 mitotic cells per position. As stated above, imaging multiple mounted slices increases the probability of having a successful experiment. With this approach we typically identify mitotic cells in virtually all experiments performed with Syto11 or histone H2B-EGFP.\n10. Post-acquisition Analysis of Mitosis (Figure 2)\nAll the procedures in this section have been optimized in Fiji (ImageJ), which is advantageous because it is a free open source software. Other software solutions are available to perform the same tasks, such as Metamorph, Imaris, and Amira.\nIdentification of Mitotic Figures in Fiji\n\t\nAfter opening the dataset for one position as a \"hyperstack\", select one z-plane (see Figure 2A for the location of the scroll bar) where the tissue and cells look healthy (see criteria in the discussion section). Scroll across the temporal dimension to identify cells going through anaphase, as it is the easiest mitotic phase to identify.\nScroll back in time to identify the time point where the cell enters mitosis (DNA condensation). The cell may move across z-planes, but the temporal resolution and the z-stack parameters described earlier have been optimized to enable this process.\nIn a spreadsheet, record the 4D coordinates of the cell in the hyperstack (X,Y,Z and time, see Figure 2A to visualize the location of these figures in the Fiji interface) as it enters mitosis. Knowing these coordinates will prevent counting the same cell several times.\nScroll forward in time and record the time when the cell progresses from one phase to another. Document the duration of each mitotic phase for one given cell.\nProceed with other cells, across the full dataset (multiple cells within and across positions).\n3D Reconstruction of the Cells and Quantitation of Rotation During Metaphase (Adapted from Haydar et al, 2003) (Figure 2B).",
    "After having identified multiple mitotic cells, use the coordinates of a cell and scroll forward in time until the beginning of metaphase.\nRotate the entire \"hyperstack\" so that the ventricular border is planar (using the \"Image/Transform/Rotate…\" command). Use the \"angle\" tool to determine the angle to apply for this rotation.\nIdentify the z-plane where the cell of interest is the most visible. In that plane, use the \"rectangle selection\" tool to draw a selection that includes the whole cell.\nIdentify the z-planes that include the cell of interest. Use the \"Image/Duplicate\" command to create a \"sub-stack\". In the dialog box, leave \"Duplicate hyperstack\" checked. The \"Slices (z)\" parameter corresponds to the z-planes including the whole cell, and the \"Frames (t)\" parameter corresponds to the current time point.\nIf the resolution is poor, increase the size of the \"sub-stack\" using the \"Image/Adjust/Size…\" command.\nGenerate a 3D reconstruction of the cell at the current time point using the \"Image/Stacks/3D project…\" command. The parameters for this command are displayed in Figure 2B. The \"Slice spacing\" corresponds to the interval between each of the z-plane images (µm). Important: make sure that the physical dimension (µm) of the sub-stack has been conserved. If not, the interpolation of the pixels in the z dimension will be incorrect, and the 3D reconstruction will be inaccurate.\nUsing the scrollbar, rotate the resulting 3D reconstruction so that the edge of the metaphase plate is visible. The number of the frame corresponds to the beta angle described in Figure 3B, record this number. Using the \"angle\" tool and the \"Analyze/Measure…\" command, measure the angle between the horizontal and a line bisecting the metaphase plate perpendicularly (Figure 2B). This is the angle alpha.",
    "Record these angles for all the metaphase time points of the cell of interest. The angle of rotation between time points (t) and (t-1) equals to the absolute value of the difference between an angle at (t) and this angle at (t-1).\nMeasuring the Orientation of the Cleavage Plane\n\t\n3D reconstruct a cell of interest at one time point during anaphase following the instructions described for the 3D reconstruction of metaphase plates.\nRotate the reconstruction until the edges of the two plates formed by the segregating chromosomes are visible.\nUse the angle tool to measure the angle between the horizontal (the ventricular edge) and a line parallel to the two plates formed by the segregating chromosomes. This is the angle of the cleavage plane (Figure 2C).\nGeneration of Movies\n\t\nAs the cells often move across different z-planes, identify the z-planes occupied by the cell during the live imaging session. Generate a \"Maximum intensity projection\" of these z-planes using the \"Image/Stacks/Z project…\" command. Save the resulting stack as a \".TIF\" file.\nOpen this file in the 1.45 version of ImageJ as Fiji does not include a stable plugin for the generation of \".mov\" or \".avi\" files.\nUse the \"File/Save as/…\" command of ImageJ to generate a movie in a format compatible with your down-stream applications.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}