{
  "id": 16621,
  "origin_website": "Jove",
  "title": "Measurement of Fatty Acid β-Oxidation in a Suspension of Freshly Isolated Mouse Hepatocytes",
  "procedures": [
    "All experimental procedures on mice (C57BL/6J, males, 9-11 weeks of age) were approved by the Institutional Animal Care and Use Committees (IACUC) of West Virginia University.\n1. Hepatocyte isolation\nPreparation\n\t\nIn the days before the hepatocyte isolation, prepare the buffers and cell culture media listed in Table 1. Set up a water bath with the temperature set to 37 °C close to where the surgery will be performed.\nOn the day of the hepatocyte isolation, under a laminar flow hood, transfer 35 mL of Buffer 1 to a sterile 50 mL centrifuge tube and 70 mL of Buffer 2 to a 100 mL sterile beaker or bottle.\nAdd antibiotics gentamicin (50 µg/mL) and penicillin/streptomycin (1x) to both buffers.\nTransfer 20 mL of Buffer 2 as prepared in step 1.1.3 to a 100 mm cell culture dish and place on ice.\nTransfer the remaining 50 mL of Buffer 2 to a sterile 50 mL centrifuge tube. Place the 50 mL tubes containing the antibiotic-supplemented Buffers 1 and 2 in a water bath set at 37 °C and let them warm up for at least 15 min before starting the perfusion.\n\t\tNOTE: If conducting multiple hepatocytes isolations in a session, scale up the number of antibiotic-supplemented aliquots of Buffers 1 and 2 to prepare accordingly.\nThaw an aliquot of collagenase solution and keep on ice.\n\t\tNOTE: If properly stored, there is no significant loss of enzyme activity in collagenase solutions frozen and thawed up to 3 times and used within 3 weeks from preparation.\nPrepare the surgical instruments and peristaltic pump. Sterilize the lines of the peristaltic pump by circulating 15 mL of 70% ethanol, followed by 15 mL of sterile water.",
    "Connect a 22 G needle to the exit line (Figure 1A). The hollowed filter of a catheter works well as a connector. Fill the lines with Buffer 1 and inspect the lines, connector, and needle to ensure no air bubbles are trapped.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62904/62904fig1v2.jpg\nFigure 1: Perfusion apparatus and perfused liver. (A) Peristaltic pump with outlet line connected to the needle used to cannulate and perfuse the liver. (B) Successful cannulation is indicated by immediate and homogeneous blanching of the liver. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62904/62904fig1v2large.jpg]\nLiver perfusion and dissociation\n\t\nAnesthetize a mouse via isoflurane inhalation with medical grade air as carrier gas, using 4% isoflurane for induction and 1.5% isoflurane to maintain anesthesia. Verify the depth of anesthesia by assessing the loss of pedal reflex.\nWhen there is no response to toe pinching, place the mouse in a supine position on a surgery board, outstretch the limbs, and secure them to the board with pins.\nLiberally spray the abdomen and chest of the mouse with 70% ethanol.\nUsing forceps, pull up the skin and abdominal wall near the base of the abdomen and cut laterally, on either side of the midline and up to the diaphragm, to expose the organs.\nExpose the inferior vena cava (IVC) by moving the intestines to the right side and gently flipping the lobes of the liver up. Insert a small cylindrical object, such as a needle cap, under the back of the mouse to slightly tilt the IVC and facilitate its cannulation (Figure 1B).\nStart the pump at the lowest speed and, with Buffer 1 flowing, insert the needle into the IVC.",
    "Cut the portal vein to relieve the pressure and allow for drainage of blood and perfusion buffers, then immediately increase the flow rate to 7 mL/min. If done correctly, the liver will uniformly blanch within a few seconds (Figure 1B).\nFor more consistent results, hold the needle in position by hand for the entire duration of the perfusion.\nPerfuse the liver with warm Buffer 1. To avoid introducing air bubbles, ensure that the line inserted in the tube containing Buffer 1 remains continuously submerged.\nWhile perfusion occurs, add 130 µL of collagenase solution to Buffer 2 and mix by pipetting up and down or stirring with a 5 mL or 10 mL serological pipette.\nAs the volume in the tube containing Buffer 1 decreases to about 5 mL, slowly add 5 mL of Buffer 2 to Buffer 1 by pipetting on the side of the tube. The goal is to avoid introducing air bubbles in the line while changing from Buffer 1 to Buffer 2.\nWait until the volume decreases again to 5 mL and slowly add another 5 mL of Buffer 2. Repeat one more time. As Buffer 2 replaces Buffer 1 and the dissociation starts, the liver will swell.\nAdd the remaining Buffer 2 to the tube originally containing Buffer 1. Stop the perfusion when there is about 5-10 mL of Buffer 2 left in the tube.\n\t\tNOTE: While Buffer 2 is perfusing the liver, the portal vein can be intermittently clamped with forceps for 5 s. This step is optional, but the resultant increase in pressure throughout the liver can improve its dissociation and, thus, the final hepatocyte yield.\nCarefully excise the liver and transfer it to the 100 mm culture dish containing the 20 mL of ice-cold Buffer 2 set aside at step 1.1.4.",
    "Under the laminar flow hood, gently break the liver apart using surgical scissors and tweezers.\nAdd about 20 mL of ice-cold M199 to the hepatocyte suspension and filter it through a 100 µm cell strainer using the plunger of a syringe to gently promote the release of additional hepatocytes from larger liver pieces.\nWash the 100 mm culture dish and the cell strainer with additional M199 until the collection tube is full.\nCentrifuge the suspension at 50 x g for 2 min at 4 °C. Carefully aspirate the supernatant and gently resuspend the hepatocyte pellet in 30 mL of cold M199 by swirling.\nPellet the hepatocytes as mentioned in step 1.2.18. Repeat the wash one more time.\nResuspend the hepatocytes in 10 mL of warm M199 and determine the viability and yield using the trypan blue exclusion method and a hemocytometer12.\nDilute the cells in M199 warmed to 37 ºC to a final concentration of 1.0 x 106 viable cells/mL and immediately start the assay.\n2. Fatty acid β-oxidation assay\nNOTE: The assay is conducted in triplicate, and each reaction mixture contains 750,000 cells, 1.35 mg/mL bovine serum albumin (BSA), 100 µM palmitic acid, and 0.4 µCi [1-14C]palmitic acid in a final volume of 2 mL.\nCAUTION: Radioactive compounds are hazardous. Purchase, handle, store, and dispose of radioactive material in accordance with Institutional, State, and Federal regulations.\nPreparation\n\t\nIn the days before the assay, prepare the palmitic acid and BSA solutions (Table 1) and store them at -20 °C.\nOn the day of the assay, complete steps 2.1.3-2.1.9 before starting the liver perfusion.\nThaw the palmitic acid and BSA solutions. Prepare the substrate mixture for multiple reactions plus a 20%-30% excess, with a typical assay setup shown in Table 2.",
    "Aliquot 13.5 µL of BSA solution per reaction in a microcentrifuge tube and warm to 41 °C, then add 1 µL of the 200 mM palmitic acid solution (BSA: palmitic acid molar ratio = 1:5) per reaction.\n\t\tNOTE: It is preferable to dispense solutions prepared using organic solvents, such the radioactive and non-radioactive palmitic acid solutions, with a positive displacement pipette and appropriate tips.\nVortex vigorously and incubate at 41 °C to facilitate the formation of the soluble palmitic acid: BSA complex. Vortex occasionally during the incubation period.\nThe mixture will initially appear cloudy but will clarify completely after 20-30 min of incubation at 41 °C. Keep it at 41 °C until ready to start the reactions.\nAliquot 133 µL of 1 M perchloric acid in 1.5 mL microcentrifuge tubes to stop the reactions.\n\t\tCAUTION: Perchloric acid is a strong acid and a strong oxidant. Appropriate protective gear is required for handling this compound.\nAliquot 485.5 µL of M199 per reaction into a tube and keep it at 37 °C to dilute the radioactive BSA: palmitic acid complex prepared at steps 2.1.4-2.1.6 before starting the reactions.\nDispense 750 µL of M199 in as many 14 mL round-bottom tubes as the samples. If desired, add inhibitors of fatty acid β-oxidation, such as etomoxir, rotenone, and antimycin, including a vehicle control (Table 2).\nDuring the hepatocyte wash steps, 10-15 min before starting the reactions, transfer the tubes prepared at step 2.1.9 to a shaking water bath set to 37 °C and shaking at 180-200 rpm.\nStarting, stopping, and analyzing the fatty acid β-oxidation reactions",
    "If the viability of the hepatocytes is acceptable (typically ≥ 75%, Figure 2), for each reaction, transfer 0.8 µL of [1-14C]palmitic acid (0.5 mCi/mL) to the microcentrifuge tube containing the clarified BSA: palmitic acid solution (steps 2.1.4-2.1.6). Vortex and return to the water bath at 41 °C.\nTo equilibrate the hepatocytes to 37 °C and to pre-incubate them with inhibitors (if present), immediately after the final hepatocyte resuspension (step 1.2.21), transfer 750 µL of the hepatocyte suspension with a 1 mL pipette to each of the 14 mL round-bottom tubes in the shaking water bath (steps 2.1.9-2.1.10) and vortex briefly at low speed to mix.\nStagger each addition by 30 s and incubate for 15 min. To save a sample for protein determination, transfer another aliquot of hepatocytes to a 1.5 mL microcentrifuge tube and spin at 3,000 x g for 5 min.\n\t\tNOTE: While dispensing, the hepatocyte suspension needs to be continuously swirled or gently stirred with the dispensing 1 mL pipette to prevent settling and large variability in cell number across samples.\nRemove the supernatant and store the pellet at -80 °C until ready to measure the total amount of protein in the sample to normalize the results (Figure 3).\nWhile the hepatocytes are under pre-incubation at 37 °C, add the radioactive BSA: palmitic acid complex to the warm medium in 2.1.8, and keep at 37 °C until ready to start the reactions. This is the final substrate mix.\nTo start the reactions, remove the hepatocytes from the water bath and add 500 µL of substrate mix.\nVortex at low speed for 5 s to completely resuspend the cells and return to the water bath. Repeat with all the samples, staggering by 30 s.",
    "Incubate for 15 min. Start a set of reactions and immediately stop (see steps 2.2.10-2.2.11) to determine the background radioactivity (Table 2).\nTransfer duplicate aliquots (200-250 µL) of the leftover substrate mix to 6 mL scintillation vials and set aside to count. Use these counts to calculate the radioactivity corresponding to the total nmoles of palmitic acid available for oxidation in 500 µL of substrate mix.\nTo stop the reactions, remove the hepatocytes from the water bath, resuspend the hepatocytes by vortexing at moderate speed, and then transfer 400 µL of the hepatocyte suspension to the microcentrifuge tubes containing perchloric acid.\nImmediately cap the tubes. Repeat this sequence for all the samples, staggering by 30 s.\nVigorously vortex the 1.5 mL microcentrifuge tubes and spin them down the 1.5 mL microcentrifuge tubes at 13,000 x g for 10 min.\nTransfer 300 µL of the supernatant to a 6 mL scintillation vial, add 4 mL of scintillation fluid, and count the radioactivity in the samples and the substrate mix aliquots (step 2.2.9) in a scintillation counter.\n\t\tCAUTION: After centrifuging, open the tubes under a fume hood to avoid breathing the 14C-CO2 produced by the complete oxidation of 14C-acetyl-CoA generated by fatty acid β-oxidation and released by the acidic conditions.\ntable:\n﻿0,1,2,3\nBuffers/Media Components,Amount,Final Concentration,Instructions\nSolution C,Solution C,Solution C,Solution C\nKCl,1.79 g,480 mM,Add water to 50 mL. Store at 4 °C\nMgSO4 heptahydrate,1.48 g,120 mM,Add water to 50 mL. Store at 4 °C\nKH2PO4,0.81 g,119 mM,Add water to 50 mL. Store at 4 °C\n\"Krebs-Henseleit Buffer (KHB), calcium-free\",\"Krebs-Henseleit Buffer (KHB), calcium-free\",\"Krebs-Henseleit Buffer (KHB), calcium-free\",\"Krebs-Henseleit Buffer (KHB), calcium-free\"\nNaCl,7.0 g,120 mM,\"Add water to 900 mL, adjust the pH to 7.4, and bring the final volume to 1 L. Store at 4 °C\"",
    "NaHCO3,2.0 g,24 mM,\"Add water to 900 mL, adjust the pH to 7.4, and bring the final volume to 1 L. Store at 4 °C\"\n1 M HEPES pH 7.45,5 mL,5 mM,\"Add water to 900 mL, adjust the pH to 7.4, and bring the final volume to 1 L. Store at 4 °C\"\nGlucose,1 or 2 g,5.6 or 11 mM,\"Add water to 900 mL, adjust the pH to 7.4, and bring the final volume to 1 L. Store at 4 °C\"\nSolution C,10 mL,,\"Add water to 900 mL, adjust the pH to 7.4, and bring the final volume to 1 L. Store at 4 °C\"\nBuffer 1,Buffer 1,Buffer 1,Buffer 1\nKHB,500 mL,,Mix components and filter sterilize. Store at 4 °C\n50 mM EGTA,1.0 mL,0.1 mM,Mix components and filter sterilize. Store at 4 °C\nBuffer 2,Buffer 2,Buffer 2,Buffer 2\nKHB,500 mL,,Mix components and filter sterilize. Store at 4 °C\n1 M CaCl2 dihydrate,686 µL,1.4 mM,Mix components and filter sterilize. Store at 4 °C\nGentamicin solution,Gentamicin solution,Gentamicin solution,Gentamicin solution\nGentamicin sulphate,0.5 g,50 mg/mL,Add water to 10 mL and filter sterilize. Aliquot and store at -20 °C\nCollagenase solution,Collagenase solution,Collagenase solution,Collagenase solution\nCollagenase I and II blend,10 mg,7 mg/mL,Dissolve the entire content of the vial in 1.43 mL of water. Aliquot and store at -20 °C\nM199,M199,M199,M199\nM199,1 pouch,,Add water to 900 mL and adjust the pH to 7.2-7.4. Bring the final volume to 1 L and filter sterilize. Store at 4 °C\nNaHCO3,2.2 g,26 mM,Add water to 900 mL and adjust the pH to 7.2-7.4. Bring the final volume to 1 L and filter sterilize. Store at 4 °C\n1 M HEPES (cell culture grade),25 mL,25 mM,Add water to 900 mL and adjust the pH to 7.2-7.4. Bring the final volume to 1 L and filter sterilize. Store at 4 °C",
    "Extra glucose (only for fed mice),1 g,11 mM,Add water to 900 mL and adjust the pH to 7.2-7.4. Bring the final volume to 1 L and filter sterilize. Store at 4 °C\nBSA solution,BSA solution,BSA solution,BSA solution\nFatty acid-free BSA,400 mg,20% (w/v),Dissolve in 2 mL of water. Aliquot and store at -20 °C\nNon-radioactive palmitic acid solution,Non-radioactive palmitic acid solution,Non-radioactive palmitic acid solution,Non-radioactive palmitic acid solution\nPalmitic acid,103 mg,200 mM,\"Dissolve in 2 mL of ethanol, store at -20 °C\"\n1 M Perchloric acid,1 M Perchloric acid,1 M Perchloric acid,1 M Perchloric acid\n70% Perchloric acid,3.5 mL,1 M,Dilute to 40 mL with water. Store at room temperature\nTable 1: Buffers, media, and other solutions required for the hepatocyte isolation and the fatty acid β-oxidation assay\ntable:\n﻿0,1,2,3,4,5,6,7\nReaction number,M199 ± Inhibitors,M199 ± Inhibitors,,Hepatocyte suspension (µL),,Substrate mix (µL),\nReaction number,Volume (µL),Etomoxir,,Hepatocyte suspension (µL),,Substrate mix (µL),\n1,750,-,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Incubate at 37 °C for 15 min\n2,750,-,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Incubate at 37 °C for 15 min\n3,750,-,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Incubate at 37 °C for 15 min\n4,750,+,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Incubate at 37 °C for 15 min\n5,750,+,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Incubate at 37 °C for 15 min\n6,750,+,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Incubate at 37 °C for 15 min\n7,750,+,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Stop immediately\n8,750,+,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Stop immediately\n9,750,+,Pre-warm at 37 °C,750,Pre-incubate at 37 °C for 15 min,500,Stop immediately\nTable 2: Example of the experimental setup for a hepatocyte suspension assayed in triplicate in the presence and absence of etomoxir.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}