{
  "id": 10182,
  "origin_website": "Jove",
  "title": "Injection of Porcine Adipose Tissue-Derived Stroma Cells via Waterjet Technology",
  "procedures": [
    "The porcine adipose tissue samples were obtained from the Institute for Experimental Surgery at the University of Tuebingen. All procedures were approved by local animal welfare authorities under the animal experiment number CU1/16.\n1. Isolation of porcine adipose tissue-derived stromal cells\nUse porcine adipose tissue delivered from the Institute for Experimental Surgery in a 50 mL centrifuge tube to the laboratory.\nTransfer the tissue to a sterile Petri dish under the sterile bench and mince it with two scalpels (No. 10) to small fragments and mush.\n\tNOTE: Scissors can also be used in order to get small fragments. The smaller the fragments are, the better for the following digestion.\n\t\nTransfer the small fragments/mush into a 50 mL centrifuge tube and incubate it with 5 mL of homogenizer solution for 30 min at 37 °C on a shaker. The homogenizer solution is PBS with 1% bovine serum albumin (BSA) (stock solution: 1 % (w/v) BSA in PBS) and 0.1% collagenase type I.\n\t\tNOTE: Always prepare homogenizer solution freshly. The shaker has a circular shaking motion at a slow speed 25-500 rpm.\nTo stop the incubation, add 10 mL of growth media [Dulbecco's Modified Eagle's Medium - low glucose (DMEM-LG), 2.5% HEPES sodium salt solution (1 M), 10% fetal bovine serum (FBS), 1% L-Glutamin (200 mM), 1% Penicillin-Streptomycin (10000 U/mL Penicillin; 10,000 µg/mL Streptomycin) and 1% Amphotericin B (250 µg/mL)].\n\tNOTE: Growth media can be prepared beforehand. Antibiotics and antifungal drugs are necessary in the preparation of the growth media for cell culture to protect cells from contaminations.\nIncubate the centrifuge tubes for 10 min at room temperature.\nAspirate the fraction with adipocytes, which is lighter and therefore swimming on top of the liquid, with a 10 mL pipette and discard it.",
    "Filter the remaining stromal fraction through a 100 µm cell sieve with a polyethylene terephthalate (PET) membrane free of heavy metals to withhold adipose tissue fragments and to retrieve only the cell suspension.\nCentrifuge the filtered cell suspension for 7 min at 630 x g at room temperature.\nResuspend the cell pellet in 2 mL of PBS to wash the cells once.\nCentrifuge the cell suspension again for 7 min at 630 x g at room temperature.\nAfter centrifugation and repeated resuspension of the cell pellet in 10 mL of growth media per flask, seed cells in 75 cm2 cell culture flasks.\n\t​NOTE: Depending on the size of the cell pellet after the washing step with PBS, seed cells in one to four flasks.\n2. Cell cultivation of porcine adipose tissue-derived stromal cells\nHarvest and passage cells when they reach 70% confluence.\nWash cells with 10 mL of PBS twice and aspirate PBS completely.\n\tNOTE: This step is necessary to remove remaining growth media, which is complemented by 10% FBS. FBS has several protease inhibitors which can hinder the function of the following trypsinization.\nAdd 3 mL of 0.05%-Trypsin-EDTA per flask to detach the cells.\nIncubate flasks for 3 min at 37 °C.\nCheck under the microscope if cells are detached.\n\tNOTE: Sometimes it takes some more time to detach the cells. In this case, incubate flasks for maximum 5 min at 37 °C.\nTo stop the incubation and detaching process, add 3 mL of growth media.\n\tNOTE: As noted above, growth media is complemented by 10% FBS that contains protease inhibitors.\nTransfer the detached cells to a centrifugation tube and centrifuge for 7 min at 630 x g at room temperature.\nResuspend the cells in 10 mL of growth media and count them with a hemocytometer.",
    "Seed cells with an inoculation density of 3 x 105 cells per 75 cm2 flask.\n3. Labelling of cells with calcein-AM\nNOTE: Cells that are injected into cadaveric tissues are stained with a green-fluorescent membrane-permeable live-cell stain and a red-fluorescent membrane-impermeant viability indicator to verify that extracted cells are the same as the injected cells and not tissue fragments of the urethra.\nWash cells twice with 10 mL of PBS.\nAdd 5 mL of dye solution per 75 cm2 flask. The dye solution consists of growth media with 2 µM of the green-fluorescent membrane-permeable live-cell dye and 4 µM red-fluorescent membrane-impermeant viability indicator.\nIncubate for 30 min at room temperature in the dark.\nAspirate and discard the dye solution.\nWash cells again twice with 10 mL of PBS.\nAdd growth media and document the green and red fluorescence signal by fluorescence microscopy.\n\t\nPlace the 75 cm2 flask on the microscope table, use the 10x objective, select no fluorescence filter and make sure that the transmitted light path is active.\n\t\tNOTE: These steps are all performed manually on the microscope.\nIn parallel to step 3.6.1, open the software program.\nPress the Live button under the Locate tab to obtain a live image of the cells in the flask on the table and focus on them with the coarse and fine adjustment drives.\n\t\tNOTE: On the right sight the live image will appear once the Live button is activated.\nIn the sub-tab Microscope Components, select the correct objective (10x).\nIn the sub-tab Camera, apply a checkmark for Auto Exposure.\nPress the button Snap to take the first picture with transmitted light.\nInsert the scale bar by using the Graphics tab in the menu bar and selecting Scale Bar.",
    "Save the image by using the Files tab in the menu bar and selecting Save as czi.\nFor the fluorescence pictures change the filter to the one specific for green or red fluorescence and select the reflected light path.\n\t\tNOTE: These changes have to be done manually on the microscope.\nPress again the Live button under the Locate tab to obtain a live image of the cells.\nPress the button Snap to take the second picture with either green or red fluorescence.\nInsert the scale bar by using the Graphics tab in the menu bar and selecting Scale Bar.\nSave the image by using the Files tab in the menu bar and selecting Save as czi.\nRepeat steps 3.6.9 to 3.6.13 with the other fluorescence channel.\n4. Prepare urethral tissue samples for injections\nDissect the urethra and the connecting bladder out of the pig.\n\tNOTE: Urethral tissue samples from fresh cadaveric samples of adult female landrace pigs were used for the experiments.\nTransport it to the laboratory in bags on wet ice.\n\tNOTE: The samples should be left on ice until further processing. No additives were added to the samples.\nPlace the urethra with the bladder on a sponge, which mimics the elasticity of the lower pelvic floor.\n\t\nUse the bladder to determine the orientation (proximal, distal, dorsal, and ventral) of the urethra. This is possible due to the localization of the ureters and the three ligaments which fix the bladder in the abdominal and pelvic cavity. The three ligaments are the two vesicae lateralia ligaments on the sides of the bladder and the vesicae medianum, which arises from the ventral surface of the bladder (Figure 1).\nCut open the urethra longitudinally on the dorsal side with aid of a catheter.",
    "Inject the cells into the opened urethra as described in the following chapters.\n5. Injections of cells via a Williams needle in fluids and tissue samples\nHarvest cells as described in step 2.\nIn contrast to step 2.9, adjust cell density for injections to 2.4 x 106 cells per mL.\n\tNOTE: For injections into tissue samples label the cells with a green-fluorescent membrane-permeable live-cell.\nAspirate the cell suspension with a syringe and apply the Williams cystoscopic injection needle (WN) to it.\nEither hold the needle shortly above the 2 mL of growth media in a 15 mL centrifugation tube or insert the needle into the opened urethra tissue. In both cases inject 250 µL of cells manually.\n\tNOTE: Cells injected into the cadaveric urethra form an injection dome.\nCollect cells injected into media directly by centrifugation for 7 min at 630 x g at room temperature.\nFor cells injected into the cadaveric urethra, aspirate them out of the injection dome with an 18G needle applied on a syringe.\nTransfer the injected and aspirated cells into a centrifugation tube and centrifuge for 7 min at 630 x g at room temperature comparably to the cells injected into media.\nAfter centrifugation, resuspend the cells in 4 mL of growth media in both cases.\nDetermine cell yield and viability by aid of Trypan blue dye exclusion with a hemocytometer.\n\t\nMix 20 µL of cell suspension thoroughly with 20 µL of Trypan blue.\nFill 10 µL of this mixture in each chamber of the hemocytometer.\n\t\tNOTE: Both chambers are filled and counted to gain statistical optimization by doubling sampling.\nUnder a microscope, count cells in all four corner squares.\n\t\tNOTE: Count cells shining in white (unstained) as viable cells whereas cells shining blue (stained) are counted as dead cells.",
    "To calculate the cell number per mL, calculate the mean of the two chambers, divide this number by two and multiply it with 104.\n6. Injections of cells via Waterjet in fluids and tissue samples\nHarvest cells as described in step 2.\nIn contrast to steps 2.9 and 5.2, adjust cell density for injections to 6 x 106 cells per mL.\n\tNOTE: For injections into tissue samples use cells labelled with a green-fluorescent membrane-permeable live-cell.\nFill the cell suspension into the dosing unit of the WJ device.\nEither hold the injection nozzle shortly above the 2 mL of growth media in a 15 mL centrifugation tube or shortly above the opened urethra tissue.\nIn both cases inject 100 µL of cells by the device using a high pressure for tissue penetration followed by a low-pressure phase for cell injections. Use the pressure settings E60-10.\n\tNOTE: Cells injected into the cadaveric urethra form an injection dome.\nCollect cells injected into media directly by centrifugation for 7 min at 630 x g at room temperature.\nFor cells injected into the cadaveric urethra, aspirate them out of the injection dome with an 18G needle applied on a syringe.\nTransfer the injected and aspirated cells into a centrifugation tube and centrifuge for 7 min at 630 x g at room temperature comparably to the cells injected into media.\nAfter centrifugation, resuspend cells in 4 mL of growth media in both cases.\nDetermine cell yield and viability by aid of Trypan blue dye exclusion with a hemocytometer as described in detail in 5.10.\n7. Biomechanical assessment of cellular elasticity by atomic force microscopy (AFM)\nPreparation of samples\n\tNOTE: The retrieved cells following injection are now subject for further analyses by AFM. Additionally, cells that were not injected are used as controls.",
    "Seed cells in tissue culture dishes with a density of 5 x 105 cells per dish.\n\t\tNOTE: Seed one tissue culture dish per condition. The conditions are controls, ADSCs injected by WJ or WN into media and ADSCs injected by WJ or WN into cadaveric tissue.\nIncubate cells in tissue culture dishes for 3 h at 37 °C.\n\t\tNOTE: To avoid variances due to cells in G1 phase and during mitosis, we performed AFM measurements 3 h after the cell seeding step.\nRight before the measurement with the AFM replace the growth media with 3 mL of Leibovitz's L-15 media without L-glutamine.\nPlace the tissue culture dish in the sample holder of the AFM device and turn on the Petri dish heater set at 37 °C.\nPreparation of AFM and cantilever calibration\n\t\nUse a glass block that is specified for measurements in liquids and adjust it on the AFM holder.\n\t\tNOTE: The upper surface of the glass block must be straight and in parallel to the AFM holder.\nCarefully place the cantilever on the surface of the glass block. The tip A must lay over the polished optical plane.\n\t\tNOTE: Do not scratch the polished optical surface of the glass block because scratches could lead to interferences in the measurements. The tip A must protrude over the polished optical plane because otherwise the reflection of the laser of the AFM to the photodetector is not possible.\nTo stabilize the cantilever on the glass block, add a metallic spring with the aid of tweezers.\nWhen the cantilever is fixed on the glass block place the block on the AFM head and lock the integrated locking mechanism.\nMount the AFM head on the AFM device.",
    "NOTE: The spring must face the left side to be placed correctly. If this is not the case, correct the position of the glass block and adjust the AFM head again.\nInitialize the software setup and open the software together with the laser alignment window and the approach parameter settings. Additionally, turn on the stepper motor, the laser light and the CCD-camera.\nIdentify the cantilever tip A by using the CCD-camera.\nLower the cantilever until it is fully dipped into the medium. Use the stepper motor function to reach this aim.\nOnce the cantilever is fully covered by medium, the laser is aligned on top of the cantilever by using the adjustment screws. The reflected beam must fall onto the center of the photodetector and the sum of the signals must be 1 V or higher. The lateral and vertical deflections should be close to 0.\n\t\tNOTE: If the center is reached can be monitored in the laser alignment function as well as the signal values. If the signal values are not correct, further adjustments are necessary.\nRun now the scanner Approach with the approach parameters (Table 1).\nRetract the cantilever by 100 µm once it reaches the bottom by pressing the Retract button.\n\t\tNOTE: Make sure that no cell is attached at that field were the approach is done because this would falsify the calibration.\nSet up the Run parameters according to the following specifications: Setpoint 1 V, Pulling Length 90 µm, Velocity: 5 µm/s, Sample rate: 2000 Hz and as a Delay Mode: Constant Force.\nStart the calibration force-distance curve measuring by pressing the button Run.\n\t\tNOTE: By clicking the Run button in the software a force-distance curve is obtained.",
    "Select the region of linear fit of the retracted curve in the software on the obtained calibration force-distance curve. Calculate the spring constant measurement by the software.\nCalibrate the cantilever following the exact parameters and steps as described by Danalache et al.17.\nMeasuring the elasticity of individual cells\n\t\nVisually identify a cell and focus on it. Place the computer mouse at the middle of the cell. To improve the measurements precision, position the AFM tip directly above the cell nucleus.\n\t\tNOTE: The computer mouse is used as visual marker to identify the target site of indentation.\nNow focus on the cantilever and move it on the computer mouse.\nStart the measurement with Run with the parameters given in Table 2.\n\t\tNOTE: The set point parameter obtained by calibration of the cantilever are used. Furthermore, one cell is measured three times. Measure at least 50 cells.\nData processing\n\t\nProcess the data following exact steps and parameters as previously described by Danalache17.\nSave and export the file.\n8. Statistical analysis\nOpen the statistical software.\nChoose the selection of New Dataset.\n\tNOTE: Two files are opened. One is the \"DataSet\" and the other one is the \"Output\" file.\nSelect the DataSet file and open the Variable View tab.\nInsert the numeric variables for site injection (capture fluid or cadaveric tissue), category (control, WJ injection, WN injection) and elasticity.\nInsert the measured elasticity data with their corresponding site injection and category number in the Data View tab.\nAnalyze the data by selecting the menu bar tab Analyze | Descriptive Statistics and choose Exploratory data analysis.\nAs the dependent variable, select Elasticity and factor list select Category.\n\tNOTE: The results are displayed in the \"Output\" file including a box plot which is used for the results section.",
    "To perform a statistical test, select the Independent Samples within the Nonparametric Test under the menu bar tab Analyze.\nIn the new opened file keep the settings in the tab Objective and Settings.\nOpen the tab Fields and choose Elasticity as Test Fields and Category as Groups.\nPress Run.\n\tNOTE: The results are displayed in the \"Output\" file. For these analyzes a Mann-U-Whitney test is performed.\nInclude the result of the nonparametric test in the box plot of the exploratory data analysis.\nSave the files by selecting File in the menu bar and choosing Save.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}