{
  "id": 12123,
  "origin_website": "Jove",
  "title": "Flow Cytometric Detection of Newly-formed Breast Cancer Stem Cell-like Cells After Apoptosis Reversal",
  "procedures": [
    "1. Preparation of Breast Non-stem Cancer Cells\nCulture MCF-7 and MDA-MB-231 cells in 10 mL of phenol red-free Roswell Park Memorial Institute (RPMI) 1640 medium supplemented with 10% heat-inactivated fetal bovine serum (FBS) in a 100 mm dish. Culture T47D in 10 mL of phenol red-free RPMI 1640 medium supplemented with 2 mM L-glutamine, 10% heat-inactivated FBS, and 1% v/v Penicillin-Streptomycin (PS) in a 100 mm dish. Culture cells at 37 °C in a 5% CO2/95% air cell culture incubator.\nNOTE: Phenol-red affects fluorescence-based detection but also has a potential influence on the growth of breast cancer cells due to its estrogen-like effects31. For example, phenol red could stimulate progesterone receptor and growth of MCF-7 cells31. It could also stimulate the growth of T47D cells31.\nWash cells with 2 mL of phosphate buffered saline (PBS) twice. Add 2 mL of 0.05% trypsin-EDTA to MCF-7 and MDA-MB-231 or 2 mL of 0.25% trypsin-EDTA to T47D cells.\nNOTE: The concentration of trypsin-EDTA needed for separation of cells among different breast cancer cell types vary while an inappropriate concentration may affect the expression pattern of some cell surface markers such as CD44 and CD2432.\nCulture the dishes for 5 min at 37 °C under an atmosphere of 5% CO2/95% air. Frequently check the detachment of cells under the microscope to prevent cells from over-digestion by trypsin-EDTA.\nWhen over 90% cells detach, add 5 mL of completed RPMI medium to the dish and pipette it over the cell layer surface several times.\nTransfer the cells to a 15 mL conical tube and centrifuge at 300 x g and 4 °C for 5 min.\nNOTE: Usually, around 6 x 106 cells can be obtained from a 100 mm dish when the confluency reaches 70%.",
    "Discard the supernatant and resuspend the pellets at 106 cells/100 μL of FACS buffer (PBS containing 0.5% BSA and 0.1% sodium azide) in a 1.5 mL microcentrifuge tube.\nDivide the cells into several tubes. For MCF-7 cells, divide the cells into 4 tubes: two for isotype controls, one for CD24 single staining as CD24 positive control and one for dual staining.\nFor T47D cells, divide the cells into 3 tubes: two for isotype controls and one for dual staining.\nFor MDA-MB-231 cells, divide the cells into 4 tubes: two for isotype controls, one for CD44 single staining as CD44 positive control and one for dual staining.\nCentrifuge the tubes again at 300 x g and 4 °C for 5 min. Discard the supernatant, and then add Fc block diluted 1:50 in FACS buffer.\nIncubate the samples on ice for 20 min in the dark before centrifugation at 300 x g and 4 °C for 5 min. Discard the supernatant.\nAdd fluorochrome-conjugated monoclonal antibodies against human CD44 (PerCP-Cy5.5) and CD24 (PE) at 1:40 and 1:10 dilutions (in FACS buffer) in the dual staining groups. For positive controls, add CD44 (PerCP-Cy5.5) to MDA-MB-231 and add CD24 (PE) to MCF-7 cells at the same concentration, respectively.\nNOTE: The combination of CD44 and C24 has been commonly used in breast CSC study26,27,28,29,30.\nFor the isotype control groups, add PerCP-Cy5.5 Mouse IgG2b,κ at a 1:40 dilution as the isotype control for CD44 antibodies and PE Mouse IgG2a,κ at a 1:10 dilution as the isotype control for CD24 antibodies at 106 cells/100 μL.\nNOTE: Isotype controls for the antibodies of interest are recommended as negative controls33.",
    "Incubate the samples (from steps 1.12 and 1.13) at 4 °C in the dark for 30 min. Centrifuge at 300 x g and 4 °C for 5 min. Discard the supernatant.\nWash the pellet twice with 500 μL of PBS and centrifuge at 300 x g and 4 °C for 5 min.\nResuspend the pellet in 0.5 mL of PBS and filter through a 40 µm nylon mesh before running on a fluorescence-activated cell sorter.\nFor gating and compensation purposes, stain MCF-7 cells with PE-conjugated anti-CD24 antibodies and stain MDA-MB-231 cells with PerCP-Cy5.5-conjugated anti-CD44 antibodies as positive controls. Use cells stained with isotype controls as negative controls (Figure 1).\nCollect cells with CD44-/CD24+ markers in round-bottom polystyrene 12 x 75 mm tubes containing 1 mL of collection medium (phenol red-free RPMI 1640 medium supplemented with 20% heat-inactivated FBS and 2% v/v PS). Centrifuge the tubes at 300 x g and RT for 5 min and discard the supernatant.\nNOTE: CSC-like cells in breast cancer cells are defined as CD44+/CD24- cells26,27,28,29,30, and breast non-stem cancer cells are defined as CD44-/CD24+ cells18 (Figure 1).\nPlate the sorted breast non-stem cancer cells in the culture dish containing fresh collection medium for further culture at 37 °C in 5% CO2 cell culture incubator. \n2. Apoptotic Induction and Detection\nPrepare 1 mM staurosporine12,34 in DMSO. For the treated MCF-7 group, add 25 μL of 1 mM staurosporine to the completed medium of MCF-7 cells to make up to 10 mL of final volume (2.5 μM staurosporine) in a 15 mL conical tube. Pipette to mix the content evenly.",
    "Remove the culture medium from the cells, wash the cells with 2 mL of PBS once. Then add the 10 mL of medium with 2.5 μM staurosporine to MCF-7 cells for 6 h to induce apoptosis when cell density reaches 70% confluency.\nPrepare 1 mM paclitaxel35,36 in DMSO. For the treated T47D group, add 12.5 μL of 1 mM paclitaxel to the completed medium of T47D cells to make up to a final volume of 10 mL (5 μM paclitaxel) in a 15 mL conical tube. Pipette to mix the content evenly.\nRemove the culture medium from the cells, and wash the cells with 2 mL of PBS once. Then add the 10 mL of medium with 5 μM paclitaxel to the T47D cells for 10 h to induce apoptosis when cell density reaches 70% confluency.\nNOTE: The induction time and the concentration of the inducers that induce apoptosis should be optimized whenever a new cell line is used for the first time.\nFor the solvent-treated MCF-7 group, add 25 μL of sterile dimethyl sulfoxide (DMSO) to the completed medium of MCF-7 cells to make up to a final volume of 10 mL (i.e., 0.25% v/v DMSO) in a 15 mL conical tube. Pipette to mix the content evenly.\nRemove the culture medium from the solvent treated MCF-7 cells, wash with 2 mL of PBS once. Then add the 10 mL of medium with 0.25% v/v DMSO for 6 h as the solvent control for STS.\nFor the solvent-treated T47D group, add 5 μL of sterile DMSO to the completed medium of T47D cells to make up to 10 mL final volume (i.e., 0.05% v/v DMSO) in a 15 mL conical tube. Pipette to mix the content evenly.",
    "Remove the culture medium from the solvent treated T47D cells, wash with 2 mL of PBS once. Then, add the 10 mL of medium with 0.05% v/v DMSO for 10 h as the solvent control for paclitaxel.\nTo observe the morphological changes of treated cells, stain cells with 50 nM Mitotracker Red CMXRos and 250 ng/mL Hoechst 33342, and incubate for another 20 min at 37 °C under an atmosphere of 5% CO2/95% air. Observe the typical apoptotic cell morphology under a 60x confocal laser scanning microscope (Figure 2).\nNOTE: Typical apoptosis morphology includes cell shrinkage, membrane blebbing, mitochondria fragmentation and nuclear condensation but with intact cellular membrane12,13,14,15,18,37.\n3. Isolation of Apoptotic Cells and Apoptosis Reversal Procedure\nStain both the apoptotic inducer- and solvent-treated MCF-7 or T47D cells with 3 μM Caspase-3/7 Green Detection dye at the cell concentration of 106/mL in the dark for 30 min at 37 °C under an atmosphere of 5% CO2/95% air.\nFilter the cells through a 40 µm nylon mesh before running on the sorter for sorting.\nFor gating purposes, first gate the major population (R1) and exclude the debris by plotting the graph in dots with forward scatter and side scatter (Figure 3).\nUse the untreated cells without adding the Caspase-3/7 Green Detection dye as a negative control to gate the negative region (R2) (Figure 3A).\nUse cells treated with staurosporine12,18,34 for 24 h and stained with the dye as a positive control to gate the positive region (R3) (Figure 3B).\nCollect positive cells (R3) from the inducer-treated groups in round-bottom polystyrene 12 x 75 mm tubes containing 1 mL of collection medium (same as the collection medium in step 1.18) (Figures 3C-3D). Centrifuge the tubes at 300 x g and RT for 5 min and discard the supernatant.",
    "Collect negative cells (R2) from solvent-treated groups in round-bottom polystyrene 12 × 75 mm tubes with 1 mL of collection medium as in step 3.6 (Figures 3E-3F).\nNOTE: A small portion of cells (such as 10,000 cells) can be collected and re-run on the sorter to check the pattern of active caspases marker. If over 90% of sorted solvent-treated cells are shown in the caspase-negative region or over 90% of sorted inducer-treated cells are shown in the caspase-positive region, these collected cells are believed to be relatively pure (Figures 3C-3F). Otherwise, the sorting region and/or the sorter should be reset.\nResuspend the sorted cells in fresh collection medium and seed them in 12-well tissue culture plates and culture at 37 °C under an atmosphere of 5% CO2/95% air for 7 days for apoptosis reversal.\n4. Confirmation of Apoptosis in Caspase-activated Cells \nMix 10 mM HEPES, 140 mM NaCl, and 2.5 mM CaCl2 to prepare annexin-binding buffer (pH 7.4). Store the buffer at 4 °C and avoid the buffer to expose to light.\nPrepare a 100 µg/mL working solution of propidium iodide (PI) by diluting 5 µL of the 1 mg/mL PI stock solution in 45 µL of annexin-binding buffer. Store the solution at 4 °C and avoid the solution to expose to light.\nNOTE: PI is a potential mutagen and should be handled with care.\nPrepare the inducer-treated cells as in steps 2.1 to 2.5.\nCollect the inducer-treated MCF-7 or T47D cells by pipetting the medium over the cell layer 3-5x to detach the cells. Transfer the cells to a 15 mL conical tube.\nCentrifuge at 300 x g and RT for 5 min. Discard the supernatant.",
    "Resuspend the cells with completed medium at the cell concentration of 106/mL in a 1.5 mL microcentrifuge tube and stain cells with 3 μM Caspase 3/7 Green Detection dye in the dark for 30 min at 37 °C.\nCentrifuge at 300 x g and RT for 5 min. Discard the supernatants.\nWash the cells with 1 mL of ice-cold PBS and centrifuge at 300 x g and 4 °C for 5 min. Discard the supernatants.\nResuspend the cells in 100 μL of annexin-binding buffer with the add 5 μL of the annexin V conjugate and 1 µL of 100 µg/mL PI working solution to each 100 μL of cell suspension and incubate the cells for 15 min at room temperature.\nNOTE: Annexin V and PI are commonly used together to label apoptotic cells in flow cytometry38,39,40.\nAdd 400 µL of annexin-binding buffer, mix gently. Keep the samples on ice before running on a flow cytometer.\n5. Measurement of Breast CSC-like Cells by Flow Cytometry\nHarvest the reversed MCF-7 in both inducer- or solvent-treated groups with 0.05% trypsin-EDTA. Harvest T47D cells in both inducer- or solvent-treated groups or with 0.25% trypsin-EDTA as in steps 1.2 to 1.5.\nStain the cells with fluorochrome-conjugated monoclonal antibodies against human CD44 (PerCP-Cy5.5) and CD24 (PE) as in step 1.12. Meanwhile, prepare the isotype controls as in step 1.13.\nRun the cells on a flow cytometer and detect the percentage of cells with CD44+/CD24- markers.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}