{
  "id": 3227,
  "origin_website": "Cell",
  "title": "Isolation and profiling of viable tumor cells from human ex vivo glioblastoma cultures through single-cell transcriptomics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue collection, transport, sectioning, and preservation\nTiming: 3–4 h\nHere we describe best practices to collect, preserve and carry out the slicing of neocortical access tissue obtained from the resection of brain tumors and from epilepsy surgery. The neocortical access tissue used is not required for neuropathological diagnostics and would otherwise be discarded during the usual course of surgery. Depending on the point of entry and the extent of resection, the neurosurgeon removes a piece of neocortical access tissue, using the shortest non-eloquent trajectory as usual. The dissection is ideally performed with a scalpel and a sharp dissector, with only minimal cauterization and avoiding mechanical damage.1[href=https://www.wicell.org#bib5],2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib6] The anatomical location of the resected tissue is recorded in the neuronavigation software (Cranial Map Neuro Navigation Cart 2; Stryker). In the operating theater, the resected tissue is immediately immersed in pre-cooled (0°C) and oxygenated preparation medium (95% O2, 5% CO2) and transported to the laboratory on ice as quickly as possible (<5 min).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2796-Fig1.jpg\nFigure 1. Neurosurgical cortical tissue sampling and pathological evaluation\n(A) Illustration of tissue dissection for tissue culture experiments.\n(B) The example of a neocortical access tissue sample from a neurosurgical operation (left) which is processed and cut into blocks (0.5–1 cm3, right), Scale bar: 1 cm.\n(C) Stimulated Raman histology of a representative slice of non-infiltrated neocortical access tissue (top row) vs. a slice of infiltrated (arrow) access tissue (bottom row) from the same sample. Note, that slices from a visibly tumor infiltrated block would not be used for tissue culture experiments. WM: white matter, Boxes and Scale bar: 500 μm.\nSet up of the tissue processing platform, tissue sectioning, and tissue culture.",
    "Keep the cortical tissue always immersed in preparation medium saturated with carbogen (95% O2, 5% CO2) at 0 ± 4°C before tissue processing.\nProcess the resected tissue.\nPrepare a cooled metal platform (0° ± 4°C) that is generously flooded with preparation medium.\nExtract the resected tissue from the transport chamber and place it on the cooled platform (Figure 1[href=https://www.wicell.org#fig1]B).\nDissect away all visibly cauterized and damaged parts.\nFurther dissect the processed tissue block into smaller blocks (size from 0.5–1 cm3) for sectioning (Figure 1[href=https://www.wicell.org#fig1]B).\nNote: We recommend that each processed and dissected smaller block of tissue contains portions of the neocortex as well as underlying white matter.\nSection the prepared tissue blocks into 300 μm slices with a dimension of 6 mm by 6 mm using a tissue vibratome (Leica V1200 vibratome) at a speed of 0.16 mm/s, in preparation medium.\nNote: The temperature of the sectioning chamber is monitored and is maintained between 0–4°C with the help of crushed ice. During sectioning, the vibratome containing the preparation medium must be bubbled using carbogen.\nProcess the resected tissue.\nNote: The temperature of the sectioning chamber is monitored and is maintained between 0–4°C with the help of crushed ice. During sectioning, the vibratome containing the preparation medium must be bubbled using carbogen.\nTransfer 300 μm tissue sections onto Millipore inserts in 6-well plates, with 1.2 mL of growth medium in each well.\nNote: The first two tissue sections from each block are generally discarded due to lack of consistency of section thickness (>300 μm).\nNote: Each block of tissue allows for the generation of 20–25 tissue sections for technical replicates, allowing for the usage of tissue sections across multiple experimental paradigms.",
    "Note: We recommend a maximum of 3 sections/well. Increase in the number of sections/well requires an increase in the frequency of medium exchange due to increased cytokine/chemokine release during culture. The medium can be collected for further experimental workplan with ELISA to detect metabolites from within the culture medium such as cytokines and neurotransmitters, as has been previously described by us.2[href=https://sciwheel.com/work/citation?ids=7155616&pre=&suf=&sa=0&dbf=0]\nCritical: For proper pre-recovery of tissue sections before culture, it is essential to transfer them using a glass pasteur pipette into ice-cold incubation medium in 60 mm × 15 mm petri dishes that are saturated with carbogen. The sections should be allowed to incubate for 10–15 min before being placed onto the inserts for culture. This step is critical to ensure the viability of the tissue sections during the subsequent culture process.\nRefresh the growth medium at periodic intervals to ensure maximal viability: The first medium refresh must be carried out 6 h post plating, followed by medium refreshes every 48 h, until the end of the culture period.\nNote: For infiltration within the cortical tissue sections is assessed using conventional histopathological staining methods (e.g., Hematoxylin and Eosin (H&E)) or alternatively using label-free simulated Raman histology (SRH).\nNote: For H&E staining and immunohistochemistry, tissue sections are embedded in O.C.T. (Tissue-TEK, SA62550-01/-02) and re-sectioned using a cryotome (NX70, ThermoFischer Scientific) for a final thickness of 10 μm.\nNote: For SRH imaging, no re-sectioning is required. An entire 300 μm tissue section is briefly (15 min) fixed in 4% paraformaldehyde (PFA) and subsequently washed in PBS. The section is then mounted on a specialized microscopy slide (NIO Slide, Invenio Imaging #PRT 01-0224). Imaging is performed using the NIO Laser Imaging System (Invenio Imaging) as described6[href=https://www.wicell.org#bib7],7[href=https://www.wicell.org#bib8] and tumor infiltration is assessed over the neocortical depth (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Critical: Sterile processing guidelines must be upheld during the entire protocol to ensure tissue viability, avoiding any/all sources of contamination. To ensure proper tissue processing, it is necessary to clean the vibratome with 100% alcohol and wash all spatulas and scalpels with Incidin™. The vibratome can be placed outside the flowhood during this process. And lastly, to prevent any potential contamination, it is mandatory to wear both lab coats and face masks. Additionally, preparation and growth medium should be sterile filtered.\nPrimary Glioblastoma cell inoculation, tumor growth, and monitoring\nTiming: 8–9 Days\nThis section describes the isolation of tumor cells from our human organotypic cortical glioblastoma (GBM) model for single-cell transcriptional profiling.\nNote: It is necessary to ensure the viability of the cultured sections using electrophysiology or immunostaining protocols, during the culture period.2[href=https://sciwheel.com/work/citation?ids=7155616&pre=&suf=&sa=0&dbf=0]\nGenerate fluorescently labeled GBM cells.\nNote: Here we use patient derived GBM cells. Cells were transduced with lentiviral particles (rLV.EF1.ZsGreen1-9 (0037VCT), Takarabio; Clonetech). The concentration of viral particles required was calculated according to the manufacturer’s instructions (M.O.I. = 10, 109 TU/mL).\nSeed 5 × 105 cells per well and incubated overnight in an incubator at 37°C and 5% CO2.\nPrepare the transduction mix by adding the required volume of thawed viral particles and Hexadimethrine bromide (Polybrene, 800 μg/mL).\nRefresh culture medium after 24 h.\nAssess the quality of transduction after 48 h using microscopy.\nInoculate 1 μL of GBM cells at the interface of gray and white matter using a 10 μL Hamilton syringe (80330; Hamilton Company, Bonaduz, Switzerland). Inoculate fluorescently tagged GBM cells into cultured sections.\nNote: We suggest to carry out this step 48 h post tissue plating to allow the tissue to recover from the trauma of sectioning.\nTrypsinize GBM cells and dilute the suspension to ass concentration of 20,000 cells/μL.",
    "Inoculate 1 μL of GBM cells at the interface of gray and white matter using a 10 μL Hamilton syringe (80330; Hamilton Company, Bonaduz, Switzerland).\nCritical: Inoculation using the Hamilton micro syringe must be performed delicately to avoid damage to the tissue section.\nCritical: To prevent cross contamination, the Hamilton micro syringe must be washed using methanol, ethanol, and then PBS ∼20 times, between inoculations.\nNote: To obtain reliable and informative results when injecting primary tumor cells into a tissue section of 6mm-by-6mm dimension, it is essential to optimize the injection volume. Based on our experience, we recommend injecting no more than 1 μL (20,000 cells/μL) of primary tumor cells to prevent compromising the viability of the cortical tissue sections. Injecting excessive cells can cause cell expansion and migration, leading to inaccuracies in the experimental results.\nRinse the sections with growth medium immediately after GBM inoculation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2796-Fig2.jpg\nFigure 2. Representative images of tumor inoculation\nThe inoculation of tumor cells is checked under EVOS M7000 microscope.\n(A and B) (A) Failed Tumor Inoculation and (B) Successful Tumor Inoculation in human cortical slice cultures. Scale bar: 0.02 inch.\nCritical: This step is essential to remove surface tumor cells outside the inoculation spot, to ensure that the tumor grows in an infiltrative fashion and not on the surface of the tissue sections.\nCritical: Hamilton syringe must be checked on a regular basis for potential clog to avoid failed inoculations (as shown in Figure 2[href=https://www.wicell.org#fig2]A).\nNote: If any clog is noticed in the Hamilton syringe. It is advisable to flush the syringe with 100% ethanol.\nMonitor the tumor growth every 24 h, using a humidified and temperature-controlled incubating microscopic platform (EVOS M7000 with onstage incubator, Thermo Fisher Scientific, USA).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2796-Fig3.jpg\nFigure 3. Inoculated GBM growth pattern live monitored using EVOS microscope",
    "(A–E) Representative live imaging of GBM inoculated cortical tissue at 0,1,3,5,7 days post inoculation (DPI). Scale bar: 0.02 inch.\n(F) Immunostaining showing tumor cells interacting with the microenvironment: Tumor cells are tagged with ZsGreen, GFAP was used to mark Astrocytes, DAPI was used to mark nucleus. Scale bar: 50 μm.\nNote: Culture conditions are maintained as before GBM inoculations.\nCritical: It is recommended to preserve a few sections of interest by fixing them in 4% paraformaldehyde (PFA) overnight. This step will enable effective fluorescence staining of the tumor microenvironment, providing valuable insights into cellular behavior (as shown in Figure 3[href=https://www.wicell.org#fig3]F).\nTissue preparation for FACS sorting of viable single cells\nTiming: 2–3 h\nThis section describes the methods including tissue dissociation, single-cell suspension and FACS sorting from cortical sections for single-cell sequencing.\nNote: A minimum 3 of 300 μm thick tissue sections are required for obtaining sufficient viable cells to proceed with 10× Chromium Single Cell Library Preparation protocol.\nTissue dissociation (using Neural Tissue Dissociation Kit) and single-cell suspension.\nPrepare the enzyme mix 1 (200 μL Enzyme T in 1750 μL Buffer X for every 500 mg of tissue).\nPrepare the enzyme mix 2 (10 μL Enzyme A in 20 μL Buffer Y for every 500 mg of tissue).\nTransfer tissue into C-tube, add enzyme mix 1 and incubate at 37°C for 5 min.\nDissociate the sample within the C-tube for 2 min at 37°C under slow and continuous rotation.\nAdd enzyme mix 2, incubate at 37°C for 5 min.\nRepeat the dissociation step as described in step 6 d.\nCentrifuge sample for 1 min at 350 g, 4°C.\nRemove supernatant and resuspend pellet in 9 mL growth medium.\nPrepare 50 mL falcon tube with a 100 μm strainer at the opening. Apply 1 mL growth medium to moisten the strainer.",
    "Filter the resuspended pellet solution from step 6 h bit by bit through the strainer tube setup from step 6 i.\nCollect and transfer the sample into a 15 mL falcon tube.\nFACS preparation and DAPI staining.\nCentrifuge the suspension in a 15 mL falcon tube at 300 g and 4°C for 10 min.\nAspirate the supernatant leaving approximately 100 μL in the falcon and resuspend the pellet gently.\nAdd the resuspended sample to a FACS tube filled with FACS buffer, and centrifuge at 300g and 4°C for 5 min.\nRepeat steps 7 b and 7 c to wash the samples, aspirate the supernatant and keep approximately 100 μL. Simultaneously, prepare FACS incubation buffer with DAPI (DFIB) by diluting DAPI into FACS buffer for a final concentration of 1 μg/mL.\nAdd 450 μL DFIB mix from step 7 d into the washed sample and resuspend gently. This step needs to be carried out on ice, avoiding direct light.\nCollect 70,000 cells that are DAPI- and ZsGreen+ by collecting two sets of 35,000 cells each into pre-coated Eppendorf tubes.\nNote: To ensure optimal collection efficiency and cell viability, pre-coat the Eppendorf tubes with 4% BSA overnight at 4°C, and fill each tube with 100 μL of FACS collection buffer before use.\nSingle-cell barcoding preparation.\nMeasure and confirm one set of collected samples with a 1000 μL pipette, and further filter with 70 μm FlowMi Cell Strainers.\nCentrifuge the filtered sample at 300 g and 4°C for 10 min. Aspirate the supernatant, leaving a final volume of 45 μL.",
    "Critical: The viability of the sorted cells is determined by microscopic observation. The second collection tube of 35,000 cells per condition is used to check the viability of cells. Resuspend the pellet and use 10 μL of collected cell suspension for a 1:10 dilution of in total 100 μL solution. Mix 10 μL of diluted GBM cells with 10 μL 0.4% Trypan Blue. After a 5 min incubation in room temperature, observe under the microscope count live/dead cells and calculate the viability.\nResuspend the pellet from step 8 b in the 45 μL supernatant. Use 43.2 μL to proceed 10× Genomics Single Cell Library Preparation protocol (CG000204 Rev D) and Illumina Sequencing protocol (# 15048776 v09).\nSingle-cell library construction and sequencing\nTiming: 8–9 h\nIn this section, we briefly describe the single-cell library preparation and sequencing procedure. Detailed step-by-step protocol could be found from 10× Genomics (CG000204 Rev D) and Illumina Inc. (# 15048776 v09).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2796-Fig4.jpg\nFigure 4. Representative library quality control results using Fragment Analyzer\n(A–C) Representative cDNA library (A), final library (B) quality control performed using Fragment Analyzer. As well as low quality cDNA library (C) quality control result using Fragment Analyzer.\nGEM generation and barcoding.\nPrepare Master Mix on ice.\nAssemble Chromium Next GEM Chip G.\nLoad Chromium Next GEM Chip G row labeled 1 with 70 μL Master Mix + cell suspension.\nLoad Chromium Next GEM Chip G row labeled 2 with 50 μL Gel Beads.\nLoad Chromium Next GEM Chip G row labeled 3 with 45 μL Partitioning Oil.\nRun the Chromium Controller (about 18 min).\nImmediately transfer GEMs and proceed GEM-RT Incubation.\nStore at 4°C for up to 72 h or −20°C for up to 1 week, or proceed to the next step.\nAdd 125 μL Recovery Agent without pipetting mix or vortexing.",
    "Carefully discard Recovery Agent and Partitioning Oil from the bottom of the tubes.\nPost GEM-RT Clean-up and cDNA Amplification.\nPrepare Dynabeads Cleanup Mix and proceed to cleanup.\nWash samples 2 times in 80% ethanol using a magnetic separator.\nPrepare Elution Solution I based on the protocol.\nImmediately add Elution Solution I, incubate and transfer supernatant to new strip tubes using a magnetic separator.\nPrepare cDNA Amplification Mix, mix with samples.\nIncubate in a thermal cycler following 10× Genomics protocol for cDNA Amplification.\nStore at 4°C for up to 72 h or −20°C for up to 1 week, or proceed to the next step.\nAdd SPRIselect and incubate for a cDNA cleanup.\nRemove supernatant after magnetic separation and wash 2 times with 80% ethanol.\nResuspend beads in Buffer EB, incubate and magnetic separate again.\nCollect and transfer 40 μL samples to a new tube strip.\nStore at 4°C for up to 72 h or −20°C for up to 4 weeks, or proceed to the next step.\nRun 1 μL of sample (Dilution Factor 1:10) on Fragment Analyzer with High Sensitivity NGS (1–6000 bp) kits for cDNA quality control.\nGene expression library construction.\nPrepare a thermal cycler and Fragmentation Mix.\nTransfer 10 μL cDNA samples and proceed the following part of protocol.\nAdd Buffer EB and Fragmentation Mix to sample strip, pipette mix.\nTransfer samples into the pre-cooled thermal cycler and proceed incubation.\nApply SPRIselect (0.6×), incubate, magnetic separate and collect supernatant.\nApply SPRIselect (0.8×), incubate, magnetic separate and collect beads.\nWash 2 times with 80% ethanol, resuspend in Buffer EB and collect 50 μL supernatant using a magnetic separator.\nPrepare Adaptor Ligation Mix and well mix with samples.\nSet up a thermal cycler and proceed incubation following 10× Genomics protocol.\nApply SPRIselect (0.8×), incubate, magnetic separate and collect beads.",
    "Wash 2 times with 80% ethanol, resuspend in Buffer EB and collect 30 μL supernatant using a magnetic separator.\nPrepare Sample Index PCR Mix and add the mix to sample tubes.\nAdd individual sample index (i7 Multiplex Index, Plate SI-GA) to tubes and pipette mix.\nIncubate in a thermal cycler with proper cycle numbers based on cDNA quality control results from step 10 k.\nStore at 4°C for up to 72 h, or proceed to the next step.\nApply SPRIselect (0.6×), incubate, magnetic separate and collect supernatant.\nApply SPRIselect (0.8×), incubate, magnetic separate and collect beads.\nWash 2 times with 80% ethanol, resuspend in Buffer EB and collect 35 μL supernatant using a magnetic separator.\nStore at 4°C for up to 72 h or −20°C for long-term storage.\nRun 1 μL of sample (Dilution Factor 1:10) on Fragment Analyzer with High Sensitivity NGS (1–6000 bp) kits for final library quality control.\nNote: A quality control is required by the end of step 10 (Figure 4[href=https://www.wicell.org#fig4]A) and step 11 (Figure 4[href=https://www.wicell.org#fig4]B) to continue the sequencing procedure (Refer also to 10× protocol). A low-quality cDNA library (Figure 4[href=https://www.wicell.org#fig4]C) is not recommended to proceed with further library construction (Starting from step 11).\nLibrary normalization, denaturation, dilution, and sequencing.\nNormalize each single library to a “starting concentration” and combine single libraries to a library mixture.\nDenature combined library with a corresponding amount (see the table from Illumina protocol) of 0.2 N NaOH and 200 mM Tris-HCl pH 7.\nDilute the denatured library to the final concentration with HT1.\nCritical: The entire library construction is recommended to proceed on ice as possible to minimize the degradation of samples.\nNote: A Phix control for the final sequencing library could be planned and included if needed.",
    "Load the samples in cartridges and run Illumina NextSeq 550 with the following cycle numbers (Read 1 – i7 – i5 – Read 2: 28–8 – 0–56 cycles).\nFollowing sequencing, the Cell Ranger analysis pipeline (Version 7.1.0, Manufacturer) will align reads and count barcodes and UMIs to map transcripts in singe cells.\nThe primary output of Cell Ranger is a count matrix, consisting of columns of every cell barcode and rows for all measured features, such as genes for transcriptome analysis.\nThe final files were exported to R for further analysis and visualization using standard pipelines."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Microscopy",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Single Cell",
    "Tissue Engineering",
    "Cell Biology",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}