{
  "id": 15294,
  "origin_website": "Jove",
  "title": "Primordial Germ Cell Transplantation for CRISPR/Cas9-based Leapfrogging in Xenopus",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee of the University of California, Irvine.\n1. Preparations for PGC Transplantation\nPrepare dissection tools in advance, as previously described23.\n\tNOTE: Eyebrow hair knives are used to make incisions with the assistance of a hair loop to stabilize the embryo while performing the surgeries. Eyebrow hairs and hair loops are glued into borosilicate glass Pasteur pipettes that have first been drawn in a flame and broken on the thinned portion (see Figure 1A, arrowhead) to create a shorter, narrower tip (Figure 1B) for greater dexterity when performing surgeries.\nGenerate sgRNAs using procedures previously described24 .\n\tNOTE: Briefly, short DNA templates coding for sgRNAs are created using overlapping deoxyoligonucleotides containing 5' bacteriophage T7 promoters, which are annealed and \"filled in\" by an error-free, thermostable DNA polymerase. In vitro sgRNA synthesis reactions are incubated for several hours to overnight (depending on the kit used). Reactions are DNAse-treated to remove the template. The sgRNAs are purified by standard methods of phenol/chloroform extraction and ammonium acetate/isopropanol precipitation, according to the kit manufacturer's instructions24.\nShortly before performing microinjections, prepare Cas9-sgRNA complexes by first denaturing ~250 ng of sgRNA in a 3 µL total volume of RNAse-free (diethylpyrocarbonate-treated) H2O at 60-65 °C for 5 min, followed by quick-cooling on ice for 5 min. Centrifuge the sgRNA for a few seconds, add 1 µL of 1 µg/µL Cas9 protein, and incubate for 10 min at 37 °C to promote complex formation.\n\tNOTE: Following this incubation, the tube can be kept on ice while preparing the embryos for microinjection.\nObtain X. tropicalis embryos by in vitro fertilization using standard methods, as previously described25. De-jelly25,26 the embryos at 10 min post-fertilization.",
    "NOTE: Fertilization time is considered the time after the sperm suspension is added to the eggs and the dish is flooded with 1/9thX Marc's Modified Ringers (MMR)26. For X. tropicalis25, unlike X. laevis, perform the de-jellying in 1/9x MMR containing 3% cysteine free base (not the HCl salt), pH adjusted to 7.8-8.0, followed by multiple washes in 1/9x MMR. Transfer the embryos to an agarose (1%)-coated dish containing 1/9x MMR at room temperature.\nImmediately transfer the embryos to be injected to a 1% agarose-coated dish containing 1x MMR using a Pasteur pipette.\nInject at the 1-cell stage. See references26,27 for detailed descriptions of Xenopus microinjection methods.\nInject each embryo at a single site in the animal pole, with 4 nL of Cas9-sgRNA complex (final amount = 1 ng of Cas9 and ~250 pg of sgRNA; see the Discussion)24. After 10-20 min of injection site healing, transfer the embryos to an agarose-coated dish containing 1/9x MMR and incubate at 25 °C. Also create a dish of uninjected sibling embryos that will serve as graft recipients.\nPrepare Petri plates (60 mm) that contain a ~5 mm-thick layer of 1% agarose made in 0.3x MMR, if doing transplantations in X. tropicalis, or 1x MMR for X. laevis.\nCreate depressions ~3-4 mm deep by inserting a 3- x 4-well mold (created by cutting a 96-well PCR plate) into the molten agarose when pouring the plates (see Figure 1C and D). Hold the mold several millimeters above the bottom of the Petri dish using a clamp attached to a ring stand until the agarose has hardened.\nAdditionally, make a 24-well plate to house individual embryos by coating the wells with a thin layer of 1% agarose made in 1/9x MMR.",
    "NOTE: The culture medium added to these wells is 1/9x MMR supplemented with 50 µg of gentamycin sulfate/mL.\n2. Transplantation of PGCs\nWhen the embryos just reach Nieuwkoop and Faber28 blastula stage 9 (Figure 2A), ~4.5 h post-fertilization (hpf) for X. tropicalis, remove them from the 25 °C incubator and allow them to equilibrate to room temperature for an additional 0.5 h.\nTo begin the transplantation at 5 hpf (Figure 2B), use a Pasteur pipette to transfer one PGC donor embryo (injected with Cas9-sgRNA) to the 60 mm agarose dish containing depressions (created in step 1.7) in 0.3x MMR (or 1x MMR if using X. laevis). Also transfer one uninjected sibling embryo, the graft recipient, to this dish.\n\tNOTE: It is critical that the identities of each of these embryos are not confused.\nManually remove the vitelline envelopes from each embryo using forceps and rotate both embryos so that their vegetal poles are in view and accessible for surgery.\n\tNOTE: A description of manual de-vitellination of embryos has previously been described26.\nUsing the sharp tip of an eyebrow hair knife, make four shallow incisions in the shape of a square on the vegetal pole of the recipient embryo, inside the zone where future bottle cells that mark the blastopore will form. Make the incisions by inserting the tip of the eyebrow hair knife into the embryo, just below the surface, and make upward slicing movements while stabilizing the embryo with the hair loop.\n\tNOTE: Figure 2 shows vegetal views of an embryo at half-hourly intervals from 4.5-7.0 hpf to show the cell size and to provide a guide for estimating where the bottles cells will form (dashed white circle). The aim is to make incisions where the dashed black box is indicated.",
    "Once the four sides of the square are delineated by incisions, deepen each incision with the eyebrow hair knife using similar cutting motions to reach a depth of approximately 1/3 to 1/2 of the distance to the blastocoel floor.\nFree the vegetal tissue explant from the recipient embryo (Figure 3A and B) by making a horizontal (parallel to the vegetal surface) cut(s) in the deep vegetal region.\n\tNOTE: The size of the PGC-containing vegetal explant is approximately 0.4-0.45 mm per side and 0.25-0.3 mm in depth. This vegetal explant from the recipient embryo is no longer needed and should therefore be set aside to be discarded.\nWorking quickly, repeat this procedure (steps 2.4-2.6) on the PGC donor embryo to create a similarly sized vegetal tissue fragment for transplantation.\n\tNOTE: It is important to carry out this second dissection with little delay to minimize the time for the recipient embryo to heal its open wound.\nOnce the tissue containing PGCs is removed from the donor embryo, use the eyebrow hair knife and hair loop to move this explant into position in the opening created in the recipient embryo.\n\tNOTE: The interior surface of the donor graft must be facing the interior of the recipient embryo. It is not necessary to match the orientations of the dorsal-ventral and left-right axes of the graft with the recipient embryo.\nUse the long edge of the shaft of the eyebrow hair knife, held parallel to the surface of the graft, to gently press the graft into the opening in the vegetal surface of the recipient embryo.",
    "Once the graft has been placed, use a hairloop or the shaft of an eyebrow hair knife to gently slide the \"carcass\" of the donor embryo across the agarose surface and into an agarose depression. Make sure that the open wound of the carcass is facing the bulk liquid. If not, use the eyebrow hair knife to rotate the embryo to achieve this orientation.\nSlide the recipient embryo, with the graft healing in place, into an adjacent depression and likewise make sure that the grafted vegetal pole tissue is facing the bulk liquid.\nRepeat this procedure (steps 2.1-2.11) using another pair of donor and recipient embryos to create another transplant/carcass pair; transfer these to empty depressions.\n\tNOTE: It is critical that one makes notations to keep track of matched pairs of carcasses and transplant-bearing embryos. The donor carcasses will be used as a proxy for the efficiency of Cas9-sgRNA-induced mutagenesis in the transplanted PGCs, which cannot be easily assayed until the transplant-bearing animals reach sexual maturity (see step 3.3, below, and the Discussion).\nContinue making transplants until the embryos reach approximately early gastrula stage 10, which is approximately 6.5 hpf in X. tropicalis (see Figure 2E).\n3. Post-healing Care of Embryos\nNOTE: Grafts heal into place within ~30 min, and it is normal to observe some yolky debris from cell lysis exuding from the embryo (Figure 3C).\nOnce healed, use a Pasteur pipette to very gently transfer embryos from the depressions to individual wells of an agarose-coated 24-well plate. The exudate will be removed (Figure 3D) by fluid mixing during the transfer.\nRotate the embryos so that they are placed vegetal-pole up, facing the bulk solution. Again, place the donor carcasses and graft recipients in adjacent wells to assist in keeping track of embryo pairs; record this information.",
    "Transfer the 24-well plate containing embryos to a 25 °C incubator for overnight culture.\n\tNOTE: The next day, the embryos will have reached tailbud stages.\nMove the graft recipients to clean agarose-coated 6-well plates containing 1/9x MMR supplemented with 50 µg of gentamycin sulfate/mL, with 1 embryo per well. Maintain a clear record of donor carcasses that match these graft recipients.\nTo assess mutagenesis efficiency by sequencing PCR amplicons5,17,24 or using other methods that rely on PCR amplicons (see the Discussion), move individual carcasses to 0.2 mL PCR strip tubes. Remove most of the medium and homogenize in 100 µL lysis buffer24 containing proteinase K (PK) by repeated up-and-down pipetting using a P200 pipette.\nPerform embryo lysis24 at 56 °C for 6 h to overnight to permit PK digestion. Inactivate PK by heating it to 90-95 °C for 10 min, followed by quick cooling to 4 °C. Use lysates without further cleanup steps to seed the PCR reactions to obtain short amplicons for direct Sanger DNA sequencing24. Store the lysates at -20 °C.\n\tNOTE: Within several days, the tadpoles will reach feeding stages (approximately stage 45-46) and can be fed a suspension of planktonic powder (sera Micron).\nAfter ~1 week, with daily changes of culture medium to maintain cleanliness and minimize microbial overgrowth, move tadpoles to small tanks in a circulating aquatic system with drip flow. Use the sequencing data to segregate tadpoles with highly efficiently mutagenized PGCs from tadpoles with lower mutagenesis efficiency. Once metamorphosis is complete, move the froglets to the adult aquatic system in the lab.\n\tNOTE: Regimens developed by the National Xenopus Resource (Marine Biology Laboratory, Woods Hole, MA) provide a guide for tadpole feeding29 and adult frog maintenance30.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}