{
  "id": 6830,
  "origin_website": "Bio",
  "title": "Assessing <em>in vitro</em> and <em>in vivo</em> Trogocytosis By Murine CD4<sup>+</sup> T cells",
  "procedures": [
    "Preparation of APC (including surface biotin labeling) either the day before, or the day of, the trogocytosis assayNote: Many different antigen presenting cell types can be used in trogocytosis assays. We predominantly use peptide-pulsed primary bone marrow derived dendritic cells (BMDC) or transfected murine fibroblasts expressing CD80, ICAM-1 and an MHC Class II molecule covalently attached to antigenic peptide via a flexible linker (Wetzel et al., 2002). BMDC are grown in cRPMI and fibroblast APC are grown in cDMEM. To generate the BMDC, culture bone marrow cells isolated from mouse femurs and for 6 days in sterile 100 mm diameter non-tissue culture Petri dishes at 105 cells/ml in cRPMI medium containing 30 ng/ml recombinant murine granulocyte macrophage-colony stimulating factor (GM-CSF) (PeproTech, Rocky Hill, NJ) at 37 °C and 5% CO2. Add fresh culture media and GM-CSF on day 3 and harvest non-adherent cells on day 6. Activate these non-adherent cells by plating on tissue culture-coated 6-well plates with addition of Sigma adjuvant system at 125 ng/ml 18 h prior to use (Inaba et al., 1992 and 2009). Resulting adherent cells were surface biotinylated (as described in A4-A6) and exogenously loaded with antigenic peptide by addition of peptide solution (to a final concentration 2.5 µM) to BMDC culture for at least 2 h before use. Resulting adherent cell population is > 90% CD11c+ (Reed and Wetzel, 2019).Grow APC to 70-80% confluence in tissue-culture grade flasks or Petri dishes. Following surface biotinylation, typical recovery of live APC is ~70%.Remove APC from flasks/plates with 0.2% EDTA in PBS, or a cell scraper. Trypsin-EDTA can be used, but ensure that molecules of interest are not targets of enzymatic cleavage.Remove protein from culture media by washing cells ~1 x 106 cells/ml, wash 3 times in PBS pH 7.4.",
    "Centrifuge cells at 500 x g for 5 min in 15 ml conical tubes, decant supernatant, resuspend cell pellet and repeat for each wash. The last wash may be performed in PBS pH 8.0, or 0.1 M carbonate buffer depending on recommended buffer for labeling the specific substrate.Resuspend cells according to protocol provided with the NHS-LC-Biotin manufacturer (typically between 0.5 and 1 x 107 cells/ml) in PBS pH 8.0 containing 0.1 mg/ml NHS-LC-Biotin reagent. Incubate at room temperature for 15-20 min.Note: Alternatively cells may be labeled at 4 °C to minimize internalization of biotinylated proteins, but this is generally not necessary. Quench the reaction with 10x volume of PBS pH 7.4 containing 100 mM glycine. Centrifuge cells at 500 x g for 5 min in 15 ml conical tubes. Wash again in the same 100 mM glycine buffer for 5 min before centrifuging.Resuspend cells in cell culture media containing 10% FBS, and count live cells using trypan blue exclusion.At this point, cells can be plated and incubated overnight for use the following day, or may be used on the same day, providing enough time (~2 h) is allowed for APC to strongly adhere to surfaces. If B cells are to be used as APC, this incubation time is not necessary. We have found that a 2.5:1 T cell:APC ratio to be effective in stimulating T cells during the trogocytosis assay (4), though this number may be titrated out, and ratios between 10:1 and 1:10 T:APC may be used, if desired.Plating of APC: Resuspend cells at 0.25 x 106 cells/ml and plate 2 ml/well in 6-well plates (assuming doubling time of cells is ~12 h for cell line).",
    "If primary bone marrow derived dendritic cells (BMDC) are used, or the trogocytosis assay is to be performed the same day, double the concentration to 0.5 x 106 cells/ml for a final count of 106 cells/well at the time of the trogocytosis-assay. Primary BMDC are cultured in cRPMI and transfected fibroblasts are cultured in cDMEM.If loading cells with peptide, peptide can be added at desired concentration at the time of APC plating, or 1-2 h prior to use in the trogocytosis assay.To activate APC, plate BMDC on tissue-culture treated plates or Petri-dishes and add Sigma Adjuvant System or pattern recognition receptor (PRR) agonists, such as LPS, at the time of APC plating.Incubate cells at 37 °C in 5% CO2 until use in the trogocytosis assay.(Optional) If magnetic separation of phagocytic APC following the trogocytosis assay is desired, 2.22 µm magnetic polystyrene beads can be added to cultures immediately prior to plating of APC (Step A1 above) at a final concentration of ~0.01% w/v. If using Spherotech beads as listed in the materials section, a recommended volume is 5 µl/well. The concentration needed will vary between APC type, and titrations should be performed to establish optimal concentrations prior to performing trogocytosis assays. If the number is too high, it may result in APC death due to over internalization. Visualize APC using a 10x objective on an inverted phase contrast microscope prior to the trogocytosis-assay, generally 4-10 beads/APC results in efficient magnetic separation. Bead diameter is between 1/10th and 1/4th the diameter of the cells and are very easily visualized. Alternatively, magnetic beads can be added 2-6 h prior to the trogocytosis assay, however overnight incubation typically yields in better results. Mix thoroughly before plating each well, as the magnetic beads rapidly settle to the bottom of tubes.",
    "Preparation of T cell blastsPre-coat 6-well plates with 1 ml/well of PBS pH 7.4 containing 1 or 2 µg/ml of anti-CD3 and anti-CD28. Insure the entire surface of each well is covered with buffer by gently rotating the plate. We generally use red blood cell depleted splenic cultures as T cell source, but if using cultures of purified T cells, CD28 can be added at the time of T cell plating. For optimal coating of wells, seal plates with parafilm to minimize evaporation and incubate plates at 4 °C overnight. Coating can also be done by incubating plates at 37 °C for a minimum of 2 h, if preferred.Note: As an alternative to antibody coated wells, antibody-coated beads may be used, but we do not have experience with this technique. Soluble anti-CD3 is not recommended as it may result in anergy induction rather than activation (Smith et al., 1997). Prior to addition of T cells to anti-CD3 + anti-CD28 coated wells, in a biosafety cabinet (tissue culture hood) remove the coating buffer and allow wells to completely dry.Collect spleen(s) from donor animals and generate single cell suspensions via rupturing the capsule by gently grinding between the ground glass (labeling) section of sterile microscope slides. This is done in a sterile Petri dish and cells are liberated into approximately 10 ml cRPMI. The techniques necessary to collect spleens and prepare single cell spleen cell suspensions are described in Wetzel et al., 2002 and 2005; Doherty et al., 2010; Osborne and Wetzel, 2012; Thueson et al., 2015.Mix splenocytes thoroughly and filter debris through a 60 µm sterile Nitex screen or filter-top tube, or allow debris to settle to the bottom of the conical tube before transferring cell suspension to a new 15 ml conical centrifuge tube.",
    "If debris is not removed, cells in culture will stick to them, which may significantly reduce activation and/or cell recovery.Lyse red blood cells (RBC) using Gey’s buffer. Resuspend cell pellet in 5 ml of Gey’s solution and incubate 5-10 min at room temperature or 5 min at 37 °C. Add an equal volume of cRPMI and centrifuge for 5 min at 500 x g. The resulting cell pellet should be an off-white color and may have a thin layer of red blood cells on the top. If the pellet is uniformly brick red (indicating insufficient RBC lysis), repeat this step.If desired, purified CD4+ T cells can be generated by negative selection of CD8+ T cells and other unwanted cell types at this time using your desired method. This is not necessary as with whole splenocyte cultures, typically > 90% of the recovered viable cells after the Ab-stimulation period are T cells.Adjust cell concentration to at 1.25 x 106 T cells, or 1.5 x 106 total splenocytes/ml in cRPMI.Add 2 ml of cell suspension to each well of the pre-coated plates.Incubate cells at 37 °C for 36-48 h. Check cells at 24 h and ensure the T cells are adhering to the bottom of the wells, which is consistent with activation. If T cells are floating and their cytoplasm are optically dense or crenated when viewed at 10x using an inverted microscope, the cells have not been activated and the experiment must terminated and subsequently restarted.At 36-48 h, gently rinse the wells with the media in the well to remove cells from 6-well plates and place into new un-coated 6-well plates, or tissue culture flask in cRPMI.Note: If the media becomes acidic (i.e.",
    ", phenol-red containing media turns yellow), add between 1/3 volume and an equal volume of fresh cRPMI to cultures. Do not add more than an equal volume of fresh media as critical cytokines such as IL-2 will be diluted out and cells will not continue to proliferate. Check media every 12-24 h until use in the trogocytosis-assay. Ab-generated blasts can be used 2-4 days after removal from antibody containing plates. Use prior to 2 days may result in higher levels of non-antigen specific trogocytosis due to a heightened state of activation in the T cells.Immediately prior to use in the trogocytosis assay, remove dead cells from T cell cultures via density centrifugation using room temperature Lympholyte-M (which is optimal for mouse lymphocytes). Resuspend the T cells at 0.5 x 107-1 x 107 cells/ml in room temperature RPMI. To avoid cell clumping, serum-free media is recommended for this step. If cultures contain < 2.5 x 107 cells, resuspend in 5 ml. Add 5 ml of the T cell culture into a 15 ml conical tube. Using a pipette gently underlay 5 ml of Lymphocyte-M below the T cells, being careful to avoid large bubbles, which can disrupt the T cell-Lympholyte interface.Spin tubes containing cells underlayed with Lympholyte for 15 min at 1,000 x g. Approximately 85% of the viable lymphocytes are found at the media–Lympholyte interface (the remainder are suspended in the media layer). Dead cells and non-lymphocytes will pellet at the bottom of the tube. Carefully collect cells at the media:Lympholyte interface using a sterile glass Pasteur pipette or a P1000 micropipette and transfer to a new 15 ml conical tube. Take care to transfer a minimal amount of Lympholyte to the new tube so that the viable lymphocytes will pellet in subsequent wash steps.",
    "Centrifuge for 5 min at 500 x g. Wash cells 1 time in cRPMI.Resuspend cell pellet in pre-warmed cRPMI and count viable, recovered T cells.Adjust the concentration to 1.25 x 106 cells/ml in pre-warmed cRPMI and proceed to in vitro trogocytosis assayPreparation of naïve T cellsCollect and homogenize spleens, and perform RBC lysis, as above.APC and other unwanted cells can be removed from cultures by positive selection using biotinylated antibody cocktail (anti-MHC, anti-B220, etc.) followed by incubation with streptavidin-coated micro beads and magnetic removal labeled cells. Commercial kits may also be used at this step to obtain an enriched culture of desired (i.e., CD4+ T) cells.(Optional) Lympholyte-M may also be used to enrich lymphocyte populations at this step.Once enriched T cell cultures are obtained, resuspend cells at 1.25 x 106 cells/ml in cRPMI and proceed to the in vitro trogocytosis assayIn vitro trogocytosis assay*Critical step* Remove non-adherent APC and magnetic beads from wells. If non-adherent/dead APC are present at the time of T cell addition, T cells will stick to these clumps to form large aggregates. To remove non-adherent APC, gently wash wells containing APC 2x by running pre-warmed PBS pH 7.4 from top-to-bottom of wells held at a ~45 degree angle. Carefully aspirate buffer at bottom of wells. Vigorous washing may lead to dislodging of APC.Note: This step should be done carefully, but quickly as wells should not be allowed to fully dry. Gently add 2 ml of resuspended T cells (1.25 x 106 cells/ml) to APC, and place immediately in a 37 °C incubator containing 5% CO2. Incubate in vitro T cell blasts with APC for 90 min. With T cell blasts we have observed T cell killing of APC by 120 min.",
    "For naïve T cells, measurable trogocytosis was first observed at 3 h and after 24 h debris from dying APC can lead to false positive trogocytosis results, so it is recommended that the T be incubated with APC between 3-24 h, depending on desired experimental design.Following the co-incubation, gently rinse the surface of the dish to remove non-adherent cells and collect in conical tubes. Wash cells in 10 ml cold PBS pH 7.4 for 5 min before centrifugation at 500 x g for 5 min. Discard the supernatant and pulse-vortex the cell pellet, and proceed with cell staining if cells are to be analyzed immediately. If cells are to be cultured for an extended period of time, magnetic depletion of contaminating APC (as outlined in Procedure E) must be done before establishing the cultures.APC removal from recovered T cellsRe-suspend cells recovered from the in vitro trogocytosis assay at 106 cells/ml in PBS pH 7.4 in a 12 x 75 polystyrene culture tube.Using an EasySepTM magnet, remove APC containing phagocytosed magnetic beads. Incubate the tube containing the cells in magnet for 5 min. APC with magnetic beads should form a clear pellet at the magnet. Gently decant the cells suspended in PBS into a sterile 15 ml conical tube. Potential contamination of T cells with APC can quickly assessed using a microscope. If there are visible bead-containing APC present in the T cell suspension after the first magnetic separation, Step E2 must be repeated. Figure 1 shows the efficiency of this method of contaminating APC depletion from the recovered T cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200426/20200426223203_6594.jpgFigure 1. Magnetic depletion of contaminating APC. A. Immediately after recovery from a 90 min. in vitro trogocytosis assay approximately 20% of cells are contaminating APC. B. After magnetic depletion, contaminating APC make up less than 0.05% of cells.",
    "A secondary APC removal step should be performed to remove any residual APC. Resuspend T cell cultures in cRPMI at 105 cells/ml, and place 3 ml/well into a fresh 6-well plate, or 9 ml into a 100 mm tissue-culture treated Petri-dish.Incubate for 1 h at 37 °C in the presence of 5% CO2.Gently swirl plates to bring non-adherent T cells into suspension, and carefully collect media without disrupting any residual APC that have bound to the surface of the plates/wells.Cultures should now contain < 0.5% APC, which can be assessed via flow cytometry.Resuspend T cells at low density (104 cells/ml) to avoid cell:cell interactions, and place 2.5 ml/well into fresh 6-well plates. If cultured T cells are observed to undergo significant proliferation, dilute cells in cRPMI to 104 cells/ml and place into fresh wells.Collect samples for analysis at desired time points. Typically, between 7-10 days of culture, the vast majority of cells will have died, and beyond 10 days in culture, biotinylated APC proteins may be undetectable.ControlsNote: Neutralizing antibodies against trogocytosed-materials can be used to inhibit trogocytosis-mediated signaling. As cells are cultured at low density, neutralizing Abs have not been found to increase Ab-mediated cell killing or complement-mediated lysis. Concentrations of 20 µg/ml have been shown to be sufficient in blocking trogocytosis-mediated signaling, however appropriate concentrations should be determined by titratration. This can be tested by adding neutralizing antibodies to APC 30 min prior to, and during an in vitro trogocytosis-assay, with a 1:5 APC:T cell ratio. Ab-concentrations that are successful in blocking signaling from APC should be expected to be sufficient in blocking trogocytosis-mediated signaling. Set aside 2 x 106 T cells (naive or T cell blasts) before establishing 90 min in vitro trogocytosis culture.",
    "Store on ice until stained along side cells recovered from the trogocytosis assay (Steps H3-H9). These serve as unstimulated controls used to determine baseline exposure of T cell activation markers and trogocytosed molecules.Stimulate T cells on anti-CD3 + anti-CD28 pre-coated plates (Step B1) in parallel to the in vitro trogocytosis assay. Recover cells and stain along side the cells recovered from the trogocytosis assay. These cells serve as both a positive control for T cell activation, and a negative control for trogocytosis.In vivo trogocytosis Trogocytosis occurs during T cell activation in vivo (Riond et al., 2007; Ford McIntyre et al., 2008; Rosenits et al., 2010). Trogocytosis+ cells are generated in vivo by routine immunization of wild type (WT) mice.Note: Trogocytosed molecules have been detected on T cells up to 28 days post-immunization, however the greatest number of detectable trog+ cells will likely be within 5-10 days post-immunization. Immunize wild type mice subcutaneously at the base of tail with 300 µg of chicken egg white albumin (OVA) (Sigma-Aldrich) in 100 µl Sigma Adjuvant System (SAS), or 100 µl SAS alone as a control using a 1 ml syringe with a 25 G needle (5/8 inch long).Inject the same mice 14 days later subcutaneously to provide a booster vaccination. The initial OVA-immunized mice are injected s.c. with 300 µg OVA in 100 µl of PBS, while the PBS control mice injected with 100 µl PBS alone.Five days after the second immunization, recover the draining inguinal lymph nodes and spleens were from each mouse and prepare single cell suspensions for flow cytometry (Steps B3 and B5).Stain the cells and analyze by flow cytometry as in Steps H3-H9.Notes: To detect trog+ cells generated in vivo, it is recommended that biotinylated antibodies against trogocytosed target molecules and streptavidin are used to enhance detection.",
    "If multiple trogocytosed molecules are to be identified, it is ideal to have the antibodies against these targets be conjugated to brighter fluorophores (i.e., PE-CF594, APC-Cy7/780, or BV421, BV711, BV786). Trog+ cells are identified as CD3+ CD4+ CD80/86+ I-A/E+. To confine analysis of cytokine and transcription factor expression to cells with similar activation states, CD4+ CD69High cells were gated on prior to identification of trog+ and trog– populations.Staining cells for analysis by flow cytometryIn TCR transgenic systems approximately 20-40% of naïve cells and 30-40% of activated cells are trog+ following recovery from the in vitro trogocytosis assay. Depending on the time-point observed, the frequency of trog+, Ag-specific activated CD4+ T ranges from 3-20%, while < 1% of control cells (non-Ag specific) are trog+. If extended in vitro culturing of the T cells is performed following the trogocytosis assay, an aliquot of cells should be stained immediately following the trogocytosis-assay to determine the initial frequency of trog+ cells.At desired time-points following recovery of cells from either the in vitro or in vivo trogocytosis assay, place cells to be analyzed into 12 x 75 mm polystyrene tubes or individual cells of a round bottom, 96-well plate. Staining should be done in 50 µl of flow staining buffer per 106 cells.Wash cells in PBS pH 7.4 (250 µl for 96-well plate, or 0.5 ml if done in tubes) by spinning cells at 300-500 x g for 5 min. After centrifugation discard the supernatant and then gently flick or quickly vortex to loosen pelleted cells.Dilute live/dead stain in PBS pH 7.4 and incubate for 10 min at room temperature in the dark. During this incubation, prepare staining reagents as outlined in Step H5 below.Dilute desired antibodies in flow staining buffer.",
    "Staining panels should include markers on target cells of interest (such as CD4), and antibodies against trogocytosed molecules of interest that are not expressed by target population, such as CD80/CD86, ICOS-L, and MHC class II (mouse). Titrations should be done for each antibody to maximize separation between positive and negative populations. If fluorochrome conjugated streptavidin is to be used to detect the presence of biotinylated APC-derived molecules on the T cells, it should be added to the antibody staining solution.Wash cells 2 times as in Step H3.Add staining cocktail and incubate cells for 20 min on ice protected from light.Following the incubation, wash cells 2 times in flow staining buffer, as in Step H3.Resuspend cells in 300 µl of flow staining buffer. Samples should be kept at 4 °C or on ice and analyzed within 2 h. Alternately, cells can be fixed with 2-4% paraformaldehyde diluted in PBS pH 7.4 for 30-45 min washed 2 times in flow staining buffer and resuspended in approximately 300 µl of flow staining buffer overnight at 4 °C in the dark and analyzed the following day.Note: If examining intracellular targets, surface staining should be completed before cells are treated with appropriate permeabilization reagents for desired targets, i.e., Triton X-100, saponin-containing buffers, or methanol, prior to staining. When non-permanent permeabilization is performed such as 0.1% saponin, staining for intracellular markers, and subsequent washes must include permeabilizing reagents. Following intracellular staining, proceed as in Step H8."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}