{
  "id": 16331,
  "origin_website": "Jove",
  "title": "High-Throughput Small Molecule Drug Screening For Age-Related Sleep Disorders Using Drosophila melanogaster",
  "procedures": [
    "This protocol uses the 30-day-old w1118 flies from the Bloomington Drosophila Stock Center (BDSC_3605, see Table of Materials).\n1. Preparation of the aged fruit flies\nFood preparation\n\t\nPrepare standard corn starch culture medium by mixing 50 g/L cornflakes, 110 g/L sugar, 5 g/L agar, and 25 g/L yeast. Heat the cornflakes and yeast with water to gelatinize, and then fully dissolve all the substances.\nWhen the medium cools to 50-60 °C, add 6 mL/L of propionic acid and promptly pack them into culture bottles.\nFly rearing and preparation of aged flies\n\t\nBreed the fly strain w1118 in bottles containing a standard cornstarch culture medium and put bottles in a constant temperature incubator at 25° C, 68% relative humidity, 500-1000 lux lighting conditions, and a 12 h:12 h light: dark cycle.\nTransfer flies into a new bottle every 7 days according to the growth cycle of flies, keeping the age of individuals in the same bottle consistent.\nCollect the new batch of flies that hatch from the original bottle 3 days after transferring them and put them into a new bottle. Following the principle of changing the bottle every 7 days, they will be cultured until around 30 days old.\n2. Preparation of medicinal food and glass tubes for monitoring\nNOTE: The procedure for glass tube preparation follows the work of Jin et al. with modifications34.\nCleaning and drying of glass tubes\n\t\nPlace the glass tube (5 mm in diameter x 65 mm in length, see Table of Materials) into a large beaker, soak it, and boil it with double distilled water for 20 min. Repeat 3 times.\nRemove and bundle the glass tube, rinse the inside with double distilled water 3-5 times, and place it in an oven for drying.\nPreparation of simple culture medium (100 mL)",
    "Dissolve 1.5 g agar and 5 g sucrose in double distilled water, heat, and concentrate to 100 mL.\nAdd 600 µL propionic acid when the medium cools to about 70 °C, preventing it from solidifying using a constant temperature water bath.\nAdd approximately 4 mL of simple medium and Reserpine (see Table of Materials) into a 10 mL small beaker until the drug reaches 20 µM or 50 µM. Add dimethyl sulfoxide (DMSO) to the concentration of 0.2% in the negative control group.\nPreparation of the glass tubes containing medicine\n\t\nTo facilitate the flow of the medium, carefully insert a suitable length of glass tube into a small beaker. The medium will naturally enter the glass tube due to atmospheric pressure.\nPull out the glass tube when the culture medium is completely solidified and wipe the outer wall to obtain a monitoring glass tube with a culture medium containing drugs at one end.\nHeat the solid paraffin in a beaker until it melts at 70 °C, put the end of the glass tube close to the food into the paraffin liquid for about 5 mm, and quickly remove it. Wait for the paraffin to solidify to seal the food end of the glass tube.\n3. Experimental design and fly treatment\nDesign the experiment for the fly treatment following Table 1.\n4. Drosophila assembly and sleep monitoring\nNOTE: The procedure for Drosophila assembly follows the work of Jin et al.34 with modifications.\nAnesthetize flies with CO2 gas, put them into paraffin-sealed glass tubes (one per tube), and block the non-food end with an absorbent cotton ball to prevent flies from escaping and ensure air circulation.\nLoad tubes onto the infrared monitor for monitoring them.",
    "Assemble the glass tubes containing flies onto an infrared monitor in the same direction, and record the monitor number and hole number corresponding to each drug.\nAdjust the alignment of each tube, and make the infrared rays pass vertically through the center of the fly's activity range.\nPlace the monitor inside a 25 °C incubator located in the fly sleep darkroom, following the specified settings: 25 °C temperature, Zeitgeber 12 (ZT12) (equivalent to local time 08:00 p.m.), and ZT24 (equivalent to local time 08:00 a.m.). This setup ensures that the flies experience alternating periods of 12 h of light and darkness.\n\t\tNOTE: Try not to open the door until monitoring data collection is complete to maintain a stable environment in the incubator during monitoring.\nStart monitoring using the DAM2 system (see Table of Materials).\nOnce the monitoring is complete, download the collected data in .txt format from the system.\n5. Data processing\nNOTE: The data processing using the DAM system, DAMFileScan107, and SCAMP was performed according to the instructions on their official websites (see Table of Materials).\nImport the above txt file into DAMFileScan107 software for scanning and divide it as needed to obtain sleep data.\n\t\nSet the starting time of segmentation data to 8:01 (1 min segmentation) or 8:00 (30 min segmentation) on the third morning after starting the monitors, and the termination time is 8:00 a.m. three days after the starting time (Figure 2A1).\n\t\tNOTE: Flies must adapt to the monitoring environment for at least one day. So, one can set the split data start time to 8 a.m. on the third day after the monitor begins.",
    "Split the data at intervals of 1 min and 30 min. Change the option \"Bin Length\" to 1 minute, change the option \"Output File Type\" to Channel files, rename, and output. The 30 min data segmentation method is the same as above (Figure 2A2-5).\n\t\tNOTE: When performing data segmentation at 1 min and 30 min intervals, the final renaming of the two files should be consistent; otherwise, it may be unreadable during subsequent Matlab processing. If necessary, the file name can be changed after output to facilitate differentiation.\nData processing using SCAMP2020\n\t\nOpen the program package SCAMP2020 in Matlab, and double-click on Vecsey Sleep and Circadian Analysis MATLAB Program (SCAMP) (Figure 2B).\nAdd its subfolder \"Vecsey SCAMP Scripts\" to the path, find the file \"scamp.m\" in that folder, and run it. In the following pop-up window, select the process 1 min and 30 min folders in sequence (Figure 2C,D).\nSelect a monitor, click on Load individual See Plots to preview (Figure 3A1), and check the image that appears. Uncheck the corresponding channel of dead flies (Figure 3A2, Figure 3B).\nRepeat the above steps to check all monitors.\nRename each channel in each monitor based on the corresponding drug to be tested (Figure 3A3), select all monitors, and click on ANALYZE Selected Data for analysis (Figure 3A4).\nDefault to the selected option, click on Analyze for Chosen Bin, check Export Data, and finally click on GRAPH 30 min Data Types for All Days for Selected Groups and EXPORT All Data to output the results (Figure 3C).",
    "Select the file named s30 from the CSV file, find the corresponding mean value and standard error data for each monitor, back up it to Excel for modification and adjustment, and paste it into GraphPad Prism (see Table of Materials) to draw a sleep status diagram (Figure 4A,B).\nFind the file named \"stdur\" and calculate the average values of daytime, nighttime, and total sleep for each fly within three days (Figure 4A,C). Paste the data into the Prism software to complete the difference test and draw a graph.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}