{
  "id": 9080,
  "origin_website": "Jove",
  "title": "Recording Temperature-induced Neuronal Activity through Monitoring Calcium Changes in the Olfactory Bulb of Xenopus laevis",
  "procedures": [
    "All experiments with Xenopus laevis tadpoles were performed according to the guidelines approved by the Göttingen University Committee of Ethics in Animal Experimentation.\n1. Electroporation\nChoose animals of stages 49-54 according to Nieuwkoop and Faber7.\nMake sure that the recording setup consists of a stereomicroscope with a large working distance and an electroporation device which can apply voltage pulses of 20 V for 20 msec at a frequency of at least 2 Hz. Apply the voltage pulses via two platinum electrodes with a rough diameter of 200 µm so that they can be inserted into the tadpoles' nostrils without causing damage.\nPrepare crystals of a dextran conjugated dye (e.g., Calcium Green 10 kDa Dextran, or Alexa Fluor 647 10 kDa Dextran) by dissolving the typically delivered amount of 5 mg in about 100 µl of distilled water and letting small droplets of 2 µl dry on a sheet of Parafilm.\n\tNote: The crystals dry in less than a day and can be stored afterwards at -18 °C in the freezer for a period of over a year.\nAnesthetize the animals by placing them in tap water containing 3% Tricaine methane sulfonate for 1-2 min until it reaches the surgical anesthesia state characterized by decreased heart rate, loss of all movements and lack of responses to mechanical stimuli.\nImmerse the anesthetized animal for 10 sec in pure tap water.\nPlace the animal on a gel cushion and fix it by placing needles around it without harming it.\n\tNote: Do not fix the animal by poking needles through its skin.\nGently dry the area surrounding the nostrils with a tissue.\nPlace the animal under the stereomicroscope and focus on the nostrils.",
    "Use forceps to pick a dye crystal of size matching the nostril hole, place it in one of the nasal cavities and wait until it dissolves completely, which takes less than 1 min. If the crystals are smaller, add 2 or 3 into each cavity until they produce a non-translucent high-concentrated solution.\nPlace the cathode on the skin of the tadpole and the anode into one of the nostrils.\n\tNote: This particular setting applies to the dyes cited in step 1.3. For dyes with a different polarity, the staining results may be improved by placing the cathode into the nostrils. If unsure about the polarity of the dye, both electrodes can be placed simultaneously in the nostrils (one per nostril), and the polarity alternated between single voltage pulses.\nApply six pulses of 20 V and 20 msec with approximately 0.5 sec of stimulus interval.\n\tNote: Small bubbles should appear around the electrode in the nostril during the electroporation provided that the electrodes are in contact with the skin and the solution in the nostril. If no bubbles are visible check the connecting cables and make sure the electroporating device is delivering the desired voltage pulse.\nRepeat the procedure (1.9-1.11) for the second nostril.\nTransfer the electroporated tadpole into a beaker filled with tap water at room temperature. Wait 5 to 10 min till the animal regains consciousness and resumes its swimming. Feed it and let it recover for at least 1 day during which the dye is transported along the olfactory nerve to the olfactory bulb.\nUse the electroporated animals within 1-7 days following the electroporation for the best imaging results. Give at least 24 hr time for dye transport and recovery before imaging.\n2. Whole Mount Preparation",
    "Anesthetize the animal in tap water containing 3% Tricaine methane sulfonate until all movements have stopped and it no longer responds to mechanical stimulations.\nTransfer the tadpole to a gel cushion under a stereomicroscope and fix it tightly by poking needles through the skin on each side of the forebrain.\nSacrifice the tadpole by severing its spinal cord.\nUse a scalpel to dissect out a block of tissue containing both nasal cavities, the olfactory nerves and olfactory bulbs (Figure 1A). Make the first incision close to left nostril-without touching it-and move the blade forward cutting alongside the left olfactory nerve and bulb until the telencephalic-diencephalic border. Do likewise on the right side. Isolate the preparation from the rest of the nervous system by making a final cut posterior to the telencephalon.\nDispose of the body of the tadpole and carefully flip the tissue block upside down so that the ventral side of the brain preparation faces upwards.\nPin the tissue block again by inserting two needles between the olfactory nerves.\nPut a drop of Frog Ringer solution (98 mM NaCl, 2 mM KCl, 1 mM CaCl2, 2 mM MgCl2, 5 mM glucose, 5 mM Na-pyruvate, 10 mM HEPES, adjusted to pH 7.8, osmolarity of 230 mOsmol/L) on the tissue.\nRemove the meninges covering the axon sorting zone and the olfactory bulbs by making three incisions using fine scissors. Starting from the posterior edge of the tissue block, cut caudorostrally closely along the left olfactory bulb until the entrance point of the olfactory nerves into the bulbs (the axon sorting zone).\nRepeat step 2.8 for the right hemisphere.\nRaise the meninges with forceps and make the third cut, perpendicular to the previous ones at the axon sorting zone.",
    "Note: The ventral side of the olfactory bulb is now accessible for imaging and bolus loading.\nTo improve the image quality in the transmitted light image, repeat the procedure for the dorsal side. These extra steps can facilitate the navigation of the micropipette for bolus loading, but are not strictly necessary.\nTransfer the sample to a recording chamber filled with Frog Ringer for further processing and imaging. Make sure that the ventral side is facing upwards and secure the sample with a net of nylon fibers spanned over a small platinum frame.\nFor an easier application of stimuli place the nasal cavities on top of one of the nylon fibers.\n3. Bolus Loading\nDissolve 50 µg of the calcium AM dye (e.g., Fluo-8 AM) in 20 µl of dimethyl sulfoxide (DMSO) containing 20% of Pluronic F-127 (w/v) to prepare a stock solution of AM dye. Freeze the stock solutions in small aliquots of 1-2 µl volume. The stock solution is stable for at least half a year but avoid freeze-thaw cycles.\nUse a micropipette puller and pull pipettes with a resistance of 5-8 MΩ and a tip diameter of 1-2 µm.\nDissolve the prepared stock solution of the dye in Frog Ringer's solution at a concentration of 250-500 µM.\nAdd MK571 to reach a concentration of 500 µM to block multidrug resistance transporters.\nFill the micropipette with 10 µl of the solution using an elongated pipette tip and remove all air bubbles by flicking the micropipette.\nMount the micropipette in the pipette holder and make sure that pressure can be applied either manually with a syringe or a pneumatic drug ejection device and monitor the applied pressure with a gauge.",
    "If possible, use a microscope setup with the capability to excite the injected dye so that the outflow from the micropipette tip can be visualized and adjusted. Ideally, use a confocal imaging setup. Use an upright microscope with an immersion objective so that the tissue can be reached with the micropipette.\nPlace the whole mount preparation under the microscope, follow the olfactory nerve until the bulb and focus onto the area of interest in the olfactory bulb.\nPerfuse fresh Ringer solution through the recording chamber in order to increase the viability of the preparation and wash out the dye leaking from the micropipette tip.\nLower the pipette onto the surface of the olfactory bulb, with the tip pointing into the rostral direction of the preparation.\nApply a small and constant positive pressure (~25 hPa) to the micropipette to prevent clogging of the pipette and gently insert it into the tissue.\nOnce the pipette has breached the outer tissue layers, move it in a rostro-dorsal direction into the mitral cell layer. (Note that a counter staining of olfactory receptor neurons by electroporation is helpful to adjust the micropipette's position.) Ideally, place the pipette tip at a distance of 50-100 µm from the desired recording site.\n\t\nFor staining the temperature-sensitive γ-glomerulus, target an area about 50 µm rostrally from the position of the presynaptic neuropil of the γ-glomerulus.\nApply a positive pressure in the range of 100-200 hPa. Adjust the pressure strength depending on the size of the micropipette tip. Confirm the outflow from the pipette by watching for slight tissue movements visible under brightlight illumination when pressure is applied for the first time.",
    "Maintain a constant pressure for about 10 min while the micropipette remains in the tissue. If possible, check the neuropil in the meantime for cell loading under fluorescent illumination as successful loading will result in visible cell somata staining with increasing intensity over time.\n\tNote: Often the reason for unsuccessful loading is pipette clogging due to tissue entering the tip or aggregated dye clusters. It is sometimes possible to rescue the pipette by gently breaking its tip against the lower surface of the recording chamber. However, the pipette tip should not exceed a few micrometers. Compensate larger pipette openings by applying lower pressure during bolus loading.\nAfter the 10 min of loading, reduce the applied pressure to zero and check the staining.\n\tNote: The size of the stained area varies significantly and depends on several parameters like amount of injected dye and location of ejection site. A good staining covers an area of about 100 µm x 100 µm.\nIf the stained area is too small or does not cover the desired recording site, repeat steps 3.10-3.13. Use the same micropipette for the next injection if it has not yet clogged.\nWait at least 30 min after the last injection before starting any experiments to allow dye uptake and deesterification. Continue to perfuse the recording chamber with fresh Ringer solution at all times.\n4. Measurement Settings\nMake sure that the measurement setup consists of a confocal microscope with sufficient speed to record three dimensional volumes. Choose an acquisition rate of at least 1 Hz per stack.",
    "Note: Suitable setups include for example line-illumination microscopes scanning the sample line-wise instead of point by point. A simple realization of such a setup has been previously described6. Other options are spinning disk microscopes. If no such setup is available, it is still possible to measure smaller areas with a normal point-scanning setup.\nSet the measurement parameters so that a volume large enough to fit the size of a glomerulus can be covered.\n\tNote: The typical thickness of a recording volume is in the range of 20 µm which should be covered by at least 5 layers.\nCheck all presynaptic measurements for bleaching. Adjust the laser power until the average fluorescence intensity of the recorded images does not drop over the time course of the recording.\nLimit the measurement time and area for recordings on the postsynaptic side to avoid bleaching as much as possible, although for measurements exceeding 20-30 sec bleaching is likely to occur.\n5. Odor Application and Temperature Experiments\nPour 25 ml of fresh Ringer solution (previously stored at 4 °C) in a 50 ml tube. Place the tube in an ice bucket.\nMonitor the temperature of the cooled Ringer by inserting the clean probe of a thermometer into the tube. Wait until the temperature drops below 1 °C before starting the experiment.\nPrepare 50 ml of L-histidine dissolved in Ringer solution at a concentration of 10 µM.\nUse a funnel applicator8 or similar application systems allowing stimulus delivery concomitantly to the perfusing Ringer so that the water flow in the chamber remains constant and uninterrupted during the release of the stimulus solution. Position the funnel in such a way that the distal outlet is less than 1 mm away from the olfactory epithelium.",
    "Place a NiCr-Ni temperature sensor connected to a digital thermometer close to the epithelium and the outlet of the funnel applicator. Wire the thermometer output port to a computer to record and visually display voltage changes reflecting small temperature fluctuations.\nBefore starting the experiment, connect another thermosensor to a standard thermometer to establish the voltage-to-temperature scale factor.\nSurvey the bath temperature in the recording chamber and ensure that it does not exceed 22 °C.\nStart the image acquisition and sequentially apply 200-400 µl of cold Ringer, L-histidine and room-temperature Ringer (20-22 °C) via an electronic pipette with an interstimulus interval of 20-30 sec. For a better control of the stimulus application, release the stimulus with a trigger signal sent by the chosen imaging setup to the pipette if possible. Repeat the application protocol for reproducible results.\nTake sets of longer recordings with several rounds of stimulation since they are preferable for post-imaging analysis with activity correlation imaging.\n\tNote: A compromise between the recording time and the slice viability has to be found. Measurements of ca. 2 min covering 6 stimulus applications provide sufficient activity for a good reconstruction of the network.\n6. Image Processing Using Activity Correlation Imaging (ACI)\nImage Processing of the Pre-synaptic Recordings\n\t\nIn recordings with stimulation by cold Ringer solution and histidine, distinguish the temperature-sensitive γ-neuropil from the neighboring histidine-sensitive glomerulus by their different response profiles (see Kludt et al.5).\nCreate a maximum intensity projection in the axial direction from recordings of the brain preparation in which ORNs have been electroporated with two different dyes to visualize the bilateral innervation of the γ-glomerulus.\nImage Processing of the Post-synaptic Recordings Using Activity Correlation Imaging (ACI)\n\t\nSelect recordings with sufficient time points (more than 100 frames) and a decent amount of activity (at least two events).",
    "Note: The activity can be either spontaneous to reveal the processes of single mitral cells or induced by several applications of stimuli during the same recording to reveal the cellular networks activated by the olfactory stimuli.\nChoose recordings where the measured structures move no more than 2-3 pixels over the time course of the recording.\n\t\tNote: Recordings with too much movement can be rescued by applying a shift correction procedure described in Kludt et al.5\nCheck whether the recordings suffer from bleaching. If the average intensity of the whole image drops over the time course of the recording, bleach correction is necessary, otherwise skip the next two steps.\nCalculate the linear trend for the time trace of each pixel by performing a linear regression.\nSubtract the result from each pixel individually to eliminate the linear component of the bleaching.\n\t\tNote: As an alternative Legendre fitting can be used as described by Bao and Schild9.\nDownload the ready-to-use MATLAB script together with a step-by-step guide for activity correlation imaging (ACI) as described by Junek et al.6\n\t\tNote: Follow the steps described in Junek et al.6 as an alternative to using the provided MATLAB script.\nMove the files 'aci.m', 'matVis.m' and 'aci_roiSelector.m' from the downloaded container to the MATLAB path of the system used for data evaluation.\nLoad the raw data acquired in step 5.8 as a variable to MATLAB's user workspace organized as a [x,y,z,t]-matrix with x and y referring to the lateral dimensions, z, the axial direction and t, the time course.\nCall 'aci' from the MATLAB command line.\nIn the user interface (UI) which appears, select 'Prepare Data', then select the variable containing the data and a directory in which the results will be saved.",
    "Note: For a full description of the UI see the manual accompanying the aci script.\nScroll through the measured z-layers by moving the corresponding slider in the UI to get an overview of the variance map displayed.\nEnter the size of the region of interest (ROI) into the UI. For a mitral cell soma adjust the ROI to span approximately 10 µm in the lateral and 5 µm in the axial direction. For a glomerulus, the slightly higher values of 20 µm laterally and 10 µm axially are appropriate.\n\t\tNote: The ROI size has to be entered as a number of pixels, which depends on the pixel scaling chosen for the recording.\nSelect a ROI containing the γ-glomerulus and additional regions for each visible soma of the surrounding mitral cells by clicking with the middle mouse button onto the center of the cell/glomerulus.\nClose the main UI which triggers the calculation of correlation maps for all reference traces. The result is automatically saved and displayed."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}