{
  "id": 1899,
  "origin_website": "Cell",
  "title": "Measuring synaptic transmission and plasticity with fEPSP recordings in behaving mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBuilding brain implants\nTiming: 20–60 min\nThis step describes the construction of (1) a ground wire, (2) recording and stimulating electrodes, and (3) a cannula for local delivery of drugs. Stimulating and recording electrodes are identical except for the final cut (step 2.h). The implants described here can be modified to fit the specific experimental needs.\nPrepare a ground screw.\nCut 4 cm of stainless-steel wire.\nExpose 3 mm from both sides of the wire.\nSecure the wire tightly between your fingernails or a hemostat.\nPlace the wire 3 mm within fine tweezers and apply a small amount of pressure.\nRapidly pull the tweezers such that the protective sheet is removed from the edge of the wire.\nSolder one end of the wire to the head of the screw.\nPlace the screw on a table such that the shank is pointed upwards.\nSolder the tip of the wire to the edge of the head (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig4.jpg\nFigure 4. Building the implants\n(A) Solder the wire tip to the ground screw at a single point.\n(B) Wrap the wire around the screw base and solder them together.\n(C) Solder the other end of the ground wire to a connector pin.\n(D) Solder both ends of a wire to the remaining two pins of the connector.\n(E) Use a magnetic stirrer to twist the wire.\n(F) Cut the wire such that there is a 1mm height difference between the two tips.\n(G) File the sharp edges of the cannula tube with a rotary tool.\n(H) Measure and log the cannula length.\n(I) Prepare a filler rod and bend it before placing it within the cannula.\nWrap the wire around the head. Avoid circling the threads.",
    "Solder the wrapped wire at a point other than the first.\nMake sure that both the drive and threads of the screw are clear from tin (Figure 4[href=https://www.wicell.org#fig4]B).\nClean the screw from remnant soldering flux.\nLoop the free end of the wire around the tip of a thin tweezer. The loop should be big enough to surround a connector pin.\nSolder the looped end of the wire to a connector pin.\nHold the connector with helping hands or a secured tweezers such that the pins are freely accessible.\nPass the connector pin through the wire loop (Figure 4[href=https://www.wicell.org#fig4]C)\nApply soldering flux and solder the wire to the pin.\nCut the excess length of the pin with a cutter. This reduces the amount of glue that will be used in the next step.\nCover the soldered pin with light curable glue and cure the glue. Use as little glue as possible to minimize mass and volume of the head construct.\nNote: Accurate soldering is more easily accomplished when only small amounts of soldering flux are applied with a fine (24–28G) needle.\nAlternatives: If only one recording electrode is to be implanted, we recommend using a 3-pin female connector for the recording electrode (two pins for the electrode wires and one pin for the ground screw; Figure 4[href=https://www.wicell.org#fig4]D). If multiple recording electrodes are to be implanted, we recommend soldering one ground screw to a connector with multiple pins (one for each electrode) rather than preparing multiple ground screws.\nPrepare electrodes.\nCut 10 cm of stainless-steel wire.\nExpose 3 mm from both sides of the wire as in step 1.b.\nLoop the exposed ends of the wire as in step 1.d.",
    "Solder each end of the wire to adjacent pin connectors as in step 1.e. When bringing the second end of the wire in proximity to the second pin, make sure the wire is evenly bent throughout its length rather than folded at a single junction (Figure 4[href=https://www.wicell.org#fig4]D).\nTwist the connector relative to the farthest end of the loop to a thread pitch of ∼0.5 (i.e., 1 complete turn every two mm).\nNote: Twisting the electrode can be done manually or with a magnetic stirrer (Figure 4[href=https://www.wicell.org#fig4]E). The number of twists can be approximated as the length of the wire [mm]/thread pitch.\nCover the pins and soldered wires with light curable glue as in step 1.f.\nBend the electrodes to 90° twice: at 2- and 10-mm distance from the connector (Figure 6[href=https://www.wicell.org#fig6]A). This is so that during implantation the electrodes can be spread apart from one another (Figure 5[href=https://www.wicell.org#fig5]I). Use a table or other flat surface to assure right angles.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig5.jpg\nFigure 5. Surgical procedure to chronically implant a cannula and fEPSP electrodes in mice\n(A) Place the mouse in the stereotaxic instrument and remove the hair from the animal’s scalp.\n(B) Cut the scalp.\n(C) Expose the skull with hydrogen peroxide and perform incisions to the skull with a scalpel. Mark the implant coordinates with a pen (blue circles).\n(D) Drill holes in the skull for the implants.\n(E) Cover the holes with Gelfoam.\n(F) Insert the ground screw.\n(G) Insert the cannula.\n(H) Cover the cannula and ground screw with Metabond (dashed line).\n(I) Cover the electrodes with Metabond once they are localized at their final position. REC – recording electrode; STIM – stimulating electrode; CAN – cannula; ROD – filler rod.\n(J) Cover all implants with dental acrylic (dashed line) before releasing the electrodes from the manipulators.",
    "(K) Position the connectors at their final position close to the skull with light curing glue.\n(L) Finalize the head construct with dental acrylic. The photograph in this panel depicts a mouse with three pairs of electrodes for simultaneous recordings of evoked responses from three different pathways. Note the metal head bar (dashed line) used for connecting the mouse to the head fixation apparatus. This construct weighs approximately 2.3 gr, measured as the difference in the animal’s weight before and after the surgery. As a general guideline, head constructs should weigh no more than 10% of the total animal weight.\nCritical: Inserting the electrodes at a 90° angle to the skull surface is crucial for reproducibility (see troubleshooting 5[href=https://www.wicell.org#troubleshooting]; Figure 6[href=https://www.wicell.org#fig6]). This is mainly achieved by carefully aligning the electrodes to the manipulator during the surgical procedure (Figure 6[href=https://www.wicell.org#fig6]F). Still, electrodes with round bends (Figure 6[href=https://www.wicell.org#fig6]B) or bends other than 90° (Figure 6[href=https://www.wicell.org#fig6]C) are more susceptible to deviate from the DV axis due to forces exerted by the brain during implantation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig6.jpg\nFigure 6. Alignment of electrodes during implantation\n(A) An electrode bent properly. Note two sharp right angles (dashed lines).\n(B) An electrode bent improperly with a round bend. This may cause the electrode to deviate from the DV axis when penetrating the brain.\n(C) An electrode bent improperly. Although the electrode tip is parallel to the connector, the deviation from 90° angles may cause the electrode to deviate during implantation.\n(D) Electrodes should be perpendicular to the bregma-lambda plane in both the AP and LM axes.",
    "(E) The line between the wire tips of the stimulating electrode should be perpendicular to the orientation of the axon bundle. If the orientation is unknown or disorganized, set the stimulating electrode such that the line between its wire tips is parallel to the interaural line. This default setting is arbitrary but may still help reduce variability between mice.\n(F) Alignment of electrodes during implantation should be done very patiently on all three axes.\nCut the end of the wires according to the electrode purpose.\nFor a recording electrode the cut should be 1 mm graded. This is achieved by cutting each wire individually (Figure 4[href=https://www.wicell.org#fig4]F).\nFor a stimulating electrode the cut should be straight. This is achieved by cutting both wires with a single cut.\nAlternatives: The wires of recording electrodes are graded so that during implantation one wire is positioned at the target site and one wire is positioned at a distant site inert to the stimulation. Using the SC synapse as an example, the wires should be positioned at CA1 stratum radiatum and the sensory cortex 1 mm dorsal to CA1 (Figure 3[href=https://www.wicell.org#fig3]C). Alternatively, the ground screw described in step 1 may provide the reference potential for both wires such that two fEPSP signals are generated from one implant. This is common practice when recording from regions other than the hippocampus. In the hippocampus, the use of an inert wire as the reference typically produces cleaner signals mainly because noise is manifested similarly on conductors with identical properties.\nAlternatives: To reduce tissue damage during implantation, or if the target brain region is very small (e.g. midline thalamic nuclei; Figure 7[href=https://www.wicell.org#fig7]E) and/or very localized LFP events are of interest (e.g. hippocampal ripples), then a smaller diameter wire may be preferred (e.g. 790900 from A-M systems).",
    "Note: After an electrode is completed, measure resistance with a multimeter between the tip of each wire and the connector pins to make certain that conductance is exclusive to the appropriate pairs of wire and pin. For easy access to the connector and wire tips, connect a male connector to the female connector and attach rigid metal wires to the multimeter probes. This step cannot replace step 1 in the Prepare for surgery section.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig7.jpg\nFigure 7. Example fEPSP recordings from three different pathways\n(A) An evoked response recorded from CA1 stratum radiatum in response to a 0.5 ms square pulse at 0.05 mA to the SC.\n(B) Evoked response amplitudes in response to increasing stimulating currents to the SC. This graph is termed an input-output (I/O) curve.\n(C) An evoked response recorded from the medial prefrontal cortex (mPFC) in response to a 0.5 ms square pulse at 0.07 mA to CA1 stratum radiatum.\n(D) I/O curve for the CA1 – mPFC pathway.\n(E) An evoked response recorded from midline thalamic nuclei in response to a 0.5 ms square pulse at 0.04 mA to CA1 stratum radiatum.\n(F) I/O curve for the CA1 – midline thalamus pathway.\nPrepare a cannula and a filler rod.\nCut ∼7 mm of the cannula tube (HTX-23T-30) with a cutter.\nFile both ends of the tube with the rotary tool cutting wheel (Figure 4[href=https://www.wicell.org#fig4]G).\nPolish both ends of the tube with a coarse grit sandpaper.\nClean the interior side of the tube with water.\nDry the tube completely with an air duster.\nMeasure and log in a notebook the length of the cannula (Figure 4[href=https://www.wicell.org#fig4]H).\nPrepare the filler rod from tube (HTX-28R-30) as in steps a-e.",
    "Bend the filler rod 2 mm from its edge to a ∼90° angle so that it can be placed within the cannula without falling deeper than intended (Figure 4[href=https://www.wicell.org#fig4]I).\nSurgery\nTiming: 2–6 h\nThis step describes the implantation of fEPSP electrodes and cannulas. The surgery can be “chronic”, i.e., the animal is awakened and kept for future experiments, or “acute”, i.e., the experiment (e.g., injection of pharmaceuticals) is done during surgery while the animal is anesthetized.\nAnesthetize the mouse.\nPlace the mouse in a container connected to the isoflurane vaporizer and deliver 3% Isoflurane at a rate of 350 mL/min until the animal lies still in the container and the respiration rate becomes slow.\nMake sure that the animal is unresponsive by tipping the container.\nPlace the mouse on the stereotaxic instrument.\nSet the heating pad to 34°C and insert the rectal probe.\nInject i.p. the Ketamine/Xylazine solution.\nGradually reduce the concentration and flow rate of Isoflurane to 1% at 150 mL/min.\nCritical: Throughout the procedure, monitor the animal’s anesthesia depth by occasionally testing the toe pinch reflex and observing its respiration rate.\nPrepare the mouse for incision of the scalp (Figure 5[href=https://www.wicell.org#fig5]A).\nFixate the head of the mouse to the stereotaxic instrument.\nInject s.c. the Carprofen solution.\nSpread eye protecting cream on the animal’s eyes.\nRemove all hair from the scalp with scissors and/or hair removal cream.\nClean the surface of the scalp with povidone-iodine and wash with ethanol 70%.\nExpose the skull.\nMake an incision along the midline of the scalp from the area between the eyes to the back of the head with a scalpel or scissors.\nSpread both sides of the scalp with bulldog serrefines.",
    "Remove the aponeurosis and periosteum with a drop of 3% hydrogen peroxide and clean with PBS. You may also use the blunt end of a scalpel to make sure all connective tissue has been removed (Figure 5[href=https://www.wicell.org#fig5]B).\nPerform horizontal and vertical incisions to the skull with a scalpel without penetrating the skull. This strengthens the adherence of Metabond to the skull (Figure 5[href=https://www.wicell.org#fig5]C).\nMark implant coordinates.\nMeasure and log the anteroposterior (AP) distance between bregma and lambda. For adult (26–30 g) mice the distance should be 3.7–4.7 mm (Paxinos and Franklin, 2004[href=https://www.wicell.org#bib15]).\nAlign the head on all three axes.\nFor pitch check that bregma and lambda are aligned in the dorsoventral (DV) axis.\nFor yaw check that bregma and lambda are aligned in the lateromedial (LM) axis.\nFor roll check that the DV height is identical ±2.5 mm lateral to bregma.\nConnect a needle to the manipulator and mark the desired coordinates for all implants (electrodes, cannula/s, and ground screw). Do this by applying ink to the needle tip (Figure 5[href=https://www.wicell.org#fig5]C).\nNote: For convenience, we deposited in the accompanying GitHub repository a spreadsheet that can be used to align the skull and calculate distances relative to bregma (see resource availability[href=https://www.wicell.org#resource-availability]).\nPrepare craniotomies (Figure 5[href=https://www.wicell.org#fig5]D).\nHold the drill by hand or with a stereotaxic manipulator and slowly lower to the skull.\nGradually remove bits of skull by alternately lowering and retreating the drill. This prevents overheating of the skull.\nClean the skull with PBS.\nCover the craniotomies with Gelfoam soaked in PBS (Figure 5[href=https://www.wicell.org#fig5]E). This (1) coagulates the brain surface in case of bleeding, (2) maintains the brain tissue wet while the electrodes are mounted to the stereotaxic instrument, and (3) protects the craniotomies from the Metabond applied in step 11.",
    "Note: All implants described in this protocol fit best with a 0.7 mm diameter burr. Any modifications to the implants should also consider the burr size.\nNote: In mice, the dura is easily penetrated by both the electrodes and cannula. If the surgery is done on rats and/or the implants are modified to be less rigid (e.g. when using smaller diameter wires as electrodes), remove the dura with fine curved tweezers before step 8.d.\nInsert the ground electrode to the hole with a screwdriver. Leave a small gap between the screw head and the skull (Figure 5[href=https://www.wicell.org#fig5]F).\nImplant the cannula to its proper location (Figure 5[href=https://www.wicell.org#fig5]G).\nConnect a small needle (e.g., 27 gauge) to the manipulator.\nPass the needle through the cannula until the tip of the needle almost emerges from the other side of the cannula. Glue the cannula in place with adhesive tape or plasticine.\nInsert the cannula into the brain until the proper coordinates are reached.\nCritical: Lowering an implant such as a cannula or electrodes into the brain must occur very slowly in order to minimize brain damage and dimpling; two major contributors to intra- and inter-subject variability (see troubleshooting 4[href=https://www.wicell.org#troubleshooting] and 5[href=https://www.wicell.org#troubleshooting], respectively). As a rule of thumb, we recommend advancing 300 um every 10 s and even slower as the target depth is approached.\nCritical: Validate the length of the cannula before implantation. This measurement will be used during the experiment to direct the syringe needle precisely through the cannula (step 20.b).\nSecure the cannula and ground screw with Metabond (Figure 5[href=https://www.wicell.org#fig5]H). Be careful not to cover any other craniotomies (e.g., for the electrodes). If Metabond reaches other craniotomies, remove the Gelfoam from the craniotomies before the Metabond cures and cover the craniotomies with a small drop of PBS.",
    "Critical: For maximal adherence to occur, make sure that the skull is completely dry before applying Metabond.\nNote: Most stereotaxic instruments allow the control of two manipulators. Thus, only two devices can be implanted simultaneously since they must be secured with Metabond to the skull before they are released from the stereotaxic manipulator. If multiple electrodes and/or cannulas are to be implanted, plan in advance the order of implantations such that Metabond is applied as few times as possible. For example, if only two electrodes and a ground screw are implanted, Metabond can be applied only once after positioning of the electrodes (step 14).\nNote: Most brain atlases provide DV coordinates starting from the skull surface at bregma. From our experience, calibrating depth coordinates from the brain (pia) surface reduces variability, especially for brain regions positioned laterally.\nCritical: We highly recommend performing histological verification of the implants’ position after sacrificing the animal (troubleshooting 5[href=https://www.wicell.org#troubleshooting]; Figure 2[href=https://www.wicell.org#fig2]). To enhance the detection of the electrodes in a histological slice, dip the electrodes in a cell labeling solution (e.g. Vybrant CM-Dil by Invitrogen) prior to implantation (step 12).\nPause point: Take a break for 15–20 min while the Metabond is being cured. Do not be tempted to touch the implants even if the outer surface of the Metabond appears dry (see troubleshooting 5[href=https://www.wicell.org#troubleshooting]).\nInsert the electrodes to the brain.\nConnect the electrodes to the electrophysiological setup. Make sure the cables are long enough to permit free movement of the electrodes.\nMount the recording and stimulating electrodes on manipulators.\nMove the electrodes towards their holes and manually adjust their alignment.\nBoth electrodes are perpendicular to the bregma-lambda plane in both the AP and LM axes (Figure 6[href=https://www.wicell.org#fig6]D).",
    "The line between the wire tips of the stimulating electrode is perpendicular to the direction of axon travel (Figure 6[href=https://www.wicell.org#fig6]E).\nThe recording and stimulating electrodes are spaciously positioned such that they will not collide during implantation (Figure 6[href=https://www.wicell.org#fig6]F).\nInsert the electrodes 200–300 um into the brain.\nCritical: If the target region involves midline structures (e.g. thalamic nuclei), the implants must be inserted in an angle to prevent puncturing of the sagittal sinus. This should be done by adjusting the angle of the manipulator. Do not bend the electrodes to the desired angle as this will not hold true during implantation.\nSearch for an evoked response.\nLower the stimulating electrode 0.5 mm above the target depth.\nStart recording while delivering a medium (0.04–0.1 mA) intensity stimulus at 0.5 Hz.\nLower the recording electrode to 0.5 mm above the target depth.\nLower the stimulating and recording electrode one at a time in graduations of 0.05 mm until the “best” signal is achieved (see CRITICAL remark below and troubleshooting 1[href=https://www.wicell.org#troubleshooting]).",
    "Critical: The evoked response of commonly investigated pathways (e.g. the SC) frequently exhibit characteristic waveforms which can be used to determine that the electrodes are in their proper position (Figure 7[href=https://www.wicell.org#fig7]A). Specifically, four main parameters should be inspected while searching for a signal (step 13): (1) the delay of the response relative to stimulus onset, (2) the presence of STP (facilitation versus depression, depending on the frequency of stimuli and the type of synapse under investigation), (3) the waveform shape, and (4) the amplitude. For novel pathways, the main indication that the target has been reached is the evoked response amplitude. However, since a large response can be achieved by accidently recording other pathways, we recommend not to deviate from the DV coordinates by more than 500 um even if it produces larger response amplitudes.\nNote: All pathways investigated in our lab displayed some degree of synaptic facilitation when an STP protocol was applied (Figure 8[href=https://www.wicell.org#fig8]A). If synaptic facilitation is to be expected, STP protocols during implantations may serve as another indication that the target regions have been reached.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig8.jpg\nFigure 8. Representative fEPSP recordings for investigating short-term plasticity and its modulation by stimulus frequency and intensity\n(A) Traces of fEPSP recordings in response to a train of five stimuli delivered at various frequencies. Red – 10 Hz; blue – 20 Hz; green – 50 Hz). Each trace is the average of 10 repetitions delivered with a 30 s inter-burst interval.",
    "(B) Quantification of short-term synaptic plasticity (STP) is typically done by measuring the slope of each response and normalizing it to the slope of the first response. Synaptic facilitation is defined as a ratio greater than one and synaptic depression is defined as a ratio smaller than one. In the SC synapse, a train of stimuli at 20 Hz and 50 Hz typically elicits synaptic facilitation to a greater extent than a train of stimuli at 10 Hz.\n(C) Quantification of synaptic facilitation in response to various stimulus intensities (50 Hz burst). Black – 0.03 mA; purple – 0.05 mA; Brown – 0.07 mA. Error bars represent SEM.\nOnce the desired signal is achieved, check stability of the signal by delivering a stimulus every 20 s for 5–10 min.\nPause point: Take a break for 5–10 min.\nNote: If an acute experiment is preferred, continue with the stimulation for 30 min or until a stable signal is achieved (i.e. the evoked response amplitude remains constant for at least 5 min; Figure 9[href=https://www.wicell.org#fig9]B). Afterwards, continue with the experiment according to the guidelines detailed in the experiment[href=https://www.wicell.org#sec3.3] section. Note that acute surgeries typically take > 5 hours and thus require that the animal be sacrificed at the end of the experiment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig9.jpg\nFigure 9. fEPSP recordings of the SC in response to pharmacogenetic/pharmacological manipulation\n(A) Pharmacogenetic manipulation of CA1 pyramidal cells. Left: mice were injected with AAV5-CamKIIα-hMD3q-mCherry in CA1 to express hMD3q specifically in pyramidal cells. Middle: in the presence of the ligand CNO, hMD3q is activated and leads to an increase in intracellular calcium. Right: Histological image at ×10 (top) and ×40 (bottom) magnification of CA1 from a mouse expressing the chemogenetic agent.",
    "(B) fEPSP amplitudes recorded at the SC synapse in response to a 0.5 ms square pulse delivered once every 15 s. Dashed line represents the time of i.p. injection of 1 mg/kg CNO. Arrows represent the time of measurements for the data in parts (C and D). Note that continuously monitoring evoked responses can reveal the kinetics of a manipulation. In this example, CNO started to elicit a noticeable effect approximately 15–20 min after the i.p. injection.\n(C) Representative fEPSP traces in response to a train of three stimuli delivered at 50 Hz before (black) and after (red) CNO administration.\n(D) Synaptic facilitation before (black) and after (red) CNO administration. CNO decreased the amount of synaptic facilitation despite increasing the absolute amplitude of the first response.\n(E and F) Teriflunomide (TERI) or the same volume of vehicle (VEH) was injected intracerebroventricular daily for 3 consecutive days. fEPSP recordings were done 2–4 h after the last injection. Adapted from (Styr et al., 2019[href=https://www.wicell.org#bib18]).\n(E) Representative fEPSP traces in response to a train of three stimuli delivered at 50 Hz after TERI (blue) or VEH (black) administration.\n(F) Synaptic facilitation before (black) and after (blue) TERI administration. TERI increased the amount of synaptic facilitation despite decreasing the absolute amplitude of the first response. N = 9 mice for each group. Error bars represent SEM.\nCover the electrodes and entire skull with Metabond (Figure 5[href=https://www.wicell.org#fig5]I). All notes provided for step 11 are also relevant for this step.\nCover the electrodes and entire skull with dental acrylic (Figure 5[href=https://www.wicell.org#fig5]J). Wait 10–30 min for the acrylic to be completely dry.\nFinalize the head construct.\nGently release the electrodes from the cables and manipulators.",
    "Position the connectors at their final position close to the skull and hold them in place with a few drops of light curing glue (Figure 5[href=https://www.wicell.org#fig5]K).\nSecure all components including the head bar to one another and to the Metabond surface with dental acrylic (Figure 5[href=https://www.wicell.org#fig5]L).\nNote: Use as little of dental acrylic as possible to minimize the weight of the final head construct, but enough dental acrylic to cover all wires.\nFinalize the surgery.\nApply povidone-iodine to the scalp at the edges of the head construct.\nInject i.p. the buprenorphine solution.\nSet the Isoflurane concentration to 0%. Do not stop the airflow from the vaporizer.\nWait for 5–20 min until the toe pinch reflex can be elicited.\nWeigh the mouse and log its weight in a dedicated notebook.\nReposition the mouse on the heating pad until it is completely awake and moving.\nPlace the mouse in its home cage.\nCritical: The added weight during surgery should be no more than 10% of the animal’s body weight.\nCritical: We typically allow the mouse to recover for 5–7 days before handling it. During this time the surgeon should check the animal’s wellbeing twice a day and log its recovery.\nExperiment\nTiming: 1–4 h daily, for 7 days up to 6 months",
    "This major step describes the conduction of experiments in mice implanted with fEPSP electrodes and a cannula. Here we focus on studying pharmacological agents but the general procedure can be easily expanded to a wide variety of other manipulations and/or behavioral settings. Before attempting any manipulations (step 20), we insist that the experimenter achieve stable baseline recordings for several consecutive days (step 19). Although the data acquired during this time is typically not reported, a stable baseline provides invaluable confidence when later trying to interpret the experimental results (See troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\nPerform baseline recordings.\nConnect the mouse to the electrophysiological setup.\nPlace the mouse in the experimental arena (open field, home cage, etc.)\nCharacterize the I/O curve (see the before you begin[href=https://www.wicell.org#before-you-begin] section).\nAnalyze the I/O curve with the MATLAB analysis package provided in this study.\nBased on the I/O curve, select 1–3 stimulus intensities for STP recordings.\nNote: The head fixation apparatus can be used during recordings to minimize movement artifacts (troubleshooting 3[href=https://www.wicell.org#troubleshooting]) and variability in arousal state (troubleshooting 4[href=https://www.wicell.org#troubleshooting]). However, if the head fixation apparatus is to be used during recordings, the animal must be accustomed to the apparatus several days before starting the recording sessions.\nNote: The overall number of stimulations per day should be limited to avoid long term plasticity effects (troubleshooting 4[href=https://www.wicell.org#troubleshooting]). Thus, to minimize the amount of stimulations while retaining enough repetitions for statistical analysis, we recommend fully characterizing the I/O curve only 2–3 times a week (e.g. at the beginning of the baseline period, one day before the perturbation and immediately after the perturbation). Daily measurements should include only 3–5 stimulus intensities selected as representatives of the full I/O curve.\nPerform the experiment.\nPerform a recording session as in step 19.",
    "Apply a sham (e.g., saline injection) or true manipulation (e.g., drug injection; Figures 9[href=https://www.wicell.org#fig9]E and 1[href=https://www.wicell.org#fig1]B).\nPrepare the syringe and drug delivery system with the desired solution (see the before you begin[href=https://www.wicell.org#before-you-begin] session).\nPosition the head fixation apparatus near the stereotaxic instrument and connect the animal.\nUsing the stereotaxic manipulator, direct the syringe towards the cannula opening.\nSlowly lower the syringe to a depth precisely equal to the cannula length.\nInject the solution and log in a notebook the volume, delivery rate, and time of injection.\nWait 10–20 min after the injection has been completed and before the needle is removed. This allows sufficient time for the drug to diffuse and minimizes the risk that pulling the needle will cause back propagation of the drug (troubleshooting 6[href=https://www.wicell.org#troubleshooting]).\nSlowly raise the needle until it exits the cannula.\nRelease the animal back to its home cage.\nWait as much time as needed for the drug to produce its expected effect (troubleshooting 6[href=https://www.wicell.org#troubleshooting]) and perform another recording session.\nCritical: Before and after every injection with an electrical pump, we recommend releasing a small volume (100–500 nL) of drug outside of the brain to make sure the needle is not clogged (troubleshooting 6[href=https://www.wicell.org#troubleshooting]).\nAlternatives: If long term effects of the manipulation are of interest, we recommend performing a recording session once a day at the same time of day and comparing the data between days rather than comparing the data between two recording sessions of the same day. This increases statistical power since it allows for several days to be averaged and it also prevents differences between the first and second sessions that are due to the circadian rhythm (Figure 10[href=https://www.wicell.org#fig10]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1379-Fig10.jpg\nFigure 10. fEPSP recordings of the SC in response to behavioral interventions.",
    "(A–C) Contextual fear conditioning (CFC) increased synaptic transmission of the SC. In sum, mice were individually placed in an arena three times in two consecutive days. On the first day, after two min in the arena the mice received two 1 mA electric shocks 80 s apart through a metal grid placed on the floor. This typically causes the animal to associate the context (visual and olfactory cues of the arena) with an aversive stimulus (the electric shock). During the second day, mice were placed in the arena with the same contextual cues but no electric shock was delivered. Four hours later, the visual and olfactory cues were altered to represent a novel context and the mice were placed again in the arena for 2.5 min without an electric shock. The percent of time spent without movement (freezing) serves as a measurement for the association of the context with the electric shock (Curzon et al., 2009[href=https://www.wicell.org#bib6]). fEPSP measurements were taken from head-fixed animals three times a day, two hr before and after the onset of behavioral experiments. Data presented is from 15 mice. (A) Percent freezing after CFC (orange) was significantly greater than before CFC (gray) in the same context (comparison of the behavioral session on day 1 with the first behavioral session on day 2). (B) Percent freezing in the context of the electrical shock (gray) was significantly greater than in a novel context (orange; comparison of the two behavioral sessions on day 2). (C) The I/O curve of the SC after CFC (red) was significantly greater than before CFC (blue). For each mouse, the average I/O curve from all sessions was used to normalize the I/O curve of a single session.",
    "For each session, the I/O curve was generated by five stimulus currents linearly spaced between values that elicit a minimal and maximal response. A significant difference in the evoked response amplitudes between the two recording times was found by two-way ANOVA with repeated measures (p < 0.0001). This is in accordance with previous findings (Subramaniyan et al., 2021[href=https://www.wicell.org#bib19]) and implies that fear conditioning induced LTP of the SC. Error bars represent SEM.",
    "(D) The I/O curve of the SC from 13 mice was significantly greater eight (8 ZT; blue) compared to two (2 ZT; black) hours into the light phase. I/O curves were generated and normalized as in (C). This effect of the circadian rhythm on neural excitability is in accordance with previous findings (Herzog, 2007[href=https://www.wicell.org#bib10]). Error bars represent SEM."
  ],
  "subjectAreas": [
    "Microscopy",
    "Neuroscience",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Ecology & Environmental Biology"
  ]
}