{
  "id": 15078,
  "origin_website": "Jove",
  "title": "Tomato Root Transformation Followed by Inoculation with Ralstonia Solanacearum for Straightforward Genetic Analysis of Bacterial Wilt Disease",
  "procedures": [
    "NOTE: Important parts of this method involve handling plant materials in vitro, and therefore it is important to keep sterile conditions during all these procedures, including the visualization of DsRed fluorescence. During all the transformation process, tomato seedlings grow at 25−28 °C and 16 h/8 h light/dark (130 µmol photons m-2s-1 light). Plates are sealed with micropore tape in order to facilitate gas exchange and transpiration.\n1. Preparation of tomato plants and Agrobacterium rhizogenes\nSterilize tomato seeds (Solanum lycopersicum cv. Moneymaker, LA2706, Tomato Genetics Resource Center, TGRC) with 5% (v/v) sodium hypochlorite for 5 min. Wash 4-5 times with distilled sterile water and keep the seeds shaking slowly in sterile water over-night to facilitate germination.\nTransfer the tomato seeds to half-strength Murashige and Skoog (1/2 MS) medium without sucrose (2.21 g/L MS, 8% w/v agar). Keep the seeds in the dark at 25−28 °C for three days (Figure 1A).\n\tNOTE: Around 40 seeds are usually needed for each construct.\nAutoclave 8.5 cm2 square filter papers. Place the square filter papers inside 9 cm2 square petri dishes containing 1/2 MS medium (place the paper on top of the agar) and place six germinated tomato seeds on each plate (Figure 1B). Seal the plate with micropore tape and incubate the germinated seeds at 25−28 °C for 3−4 days.\nGrow Agrobacterium rhizogenes MSU440 in solid LB medium (with appropriate antibiotics) at 28 °C two days before plant transformation.",
    "NOTE: A. rhizogenes is provided by Dr. Juan Antonio López Ráez, EEZ-CSIC, Granada, Spain. In the experiment described in this article, A. rhizogenes containing pK7GWIWG2_II-RedRoot::CESA6 or an empty vector, as control, were used. pK7GWIWG2_II-RedRoot contains a reporter gene, DsRed, driven by the Arabidopsis thaliana ubiquitin promoter (pAtUBQ10), and confers resistance to spectinomycin (50 µg/mL). It is possible to use other vectors for gene overexpression, as reported before5. In this work, the amplification of the specific fragment for SlCESA6 silencing was obtained by reverse transcription (RT) PCR using RNA isolated from tomato (S. lycopersicum cv. Moneymaker) and ligated into p-ENTR/D-TOPO vector (Table 1). Subsequently, the SlCESA6-RNAi fragment was cloned into the pK7GWIWG2_II-RedRoot binary vector.\n2. Plant transformation and selection\nUsing a sterile scalpel, cut the radicle and the bottom of the hypocotyl of tomato seedlings (Figure 1C,D).\nHarvest A. rhizogenes biomass from the surface of the LB medium using plastic tips or a scalpel blade and carefully dip the cut tomato seedlings in the bacterial biomass (Figure 1E).\nAfter inoculation with A. rhizogenes, cover the tomato seedlings with a 2 cm x 4 cm semi-circular filter paper (Figure 1F), in order to keep a high humidity and facilitate survival and new root development.\nStore the transformed tomato seedlings for 6-7 days. Then, use a sterile scalpel to cut the new emerging hairy roots (Figure 1G,H; at this step, the roots are not transformed yet) and allow the seedlings to produce new hairy roots.\nOnce the second generation of new hairy roots appear (Figure 1I), remove the filter paper on top of the seedlings, and seal the plate with micropore tape again.\n\tNOTE: At this point, the presence of the DsRed fluorescent marker in the transformation vector allows to visualize the transformation efficiency in the new roots.",
    "To visualize DsRed fluorescence, use a stereomicroscope or any other equipment for plant in vivo imaging (Figure 1J). Mark the positive (red fluorescence) transformed roots and remove the negative non-transformed roots (no red fluorescence) using a sterile scalpel.\nTransfer the seedlings showing red fluorescence to a new plate containing 1/2 MS medium, in order to facilitate the development of the transformed root as the main root (Figure 1K). Keep the seedlings that do not show red fluorescence in the same plate to check the emergence of fluorescent roots (Figure 1L) in later time points.\nAlternative method based on antibiotic selection\n\t\nAlternative to step 2.5, prepare half-filled 9 cm2 square plates containing 1/2 MS medium with the appropriate antibiotic. Incline the plates approximately 5° during the preparation process to generate an empty space without medium (Figure 2A), allowing the shoots to grow avoiding contact with the antibiotic.\nAlternative to step 2.6, after cutting the first non-transformed hairy roots emerged (step 2.4), transfer the seedlings without roots to the half-filled plates using filter papers with the appropriate size (Figure 2B).\n\t\tNOTE: As positive control, it is recommended to transform several seedlings with a plasmid containing the same antibiotic resistance and a reporter gene (in this protocol, pK7GWIWG2_II-RedRoot; kanamycin 50 µg/mL).\nAlternative to step 2.7, let the seedlings develop new hairy roots and cut those roots that are not in direct contact with the surface of the filter sandwich papers, since these roots may avoid antibiotic selection.\n\t\tNOTE: Due to the antibiotic effect, root development may be slower than in plates without antibiotics. New transformed hairy roots appear within 14−18 days after transferring the seedlings without roots to the half-filled plates (step 2.8.2) (Figure 2C-E).",
    "Cover the seedlings with a 2 cm x 4 cm semi-circle filter paper, seal the plate and incubate the seedlings to let them develop new hairy roots.\n\tNOTE: It is not necessary to eliminate the A. rhizogenes using antibiotics. The filter paper on top of the MS medium and the lack of sucrose inhibit the spread of the A. rhizogenes on the plate5.\nFive-to-seven days after the first root selection, repeat the selection process to select new transformed roots and remove non-transformed roots. Transfer the seedlings containing transformed roots to a new plate containing 1/2 MS medium.\n3. Transfer to inoculation pots\nPrepare inoculation pots where the surface of the roots will be exposed to the bacterial inoculum: soak the inoculation pots with water, pour off any excess water, and place them in a plastic planting tray. Transfer the selected seedlings with transformed roots to inoculation pots using tweezers (Figure 3A).\nCover the tray with plastic wrap or a transparent lid and keep them at 25−28 °C and 65% humidity (16 h/8 h light/dark; 130 µmol photons m-2s-1 light), to maintain a high level of humidity Figure 3B). Remove the cover after five or six days.\n\tNOTE: The transformed tomato plants are ready for inoculation two-to-three weeks after transferring them to soil (Figure 3C). During the growth on soil, tomato plants may produce new roots that are not transformed. To determine the extent of this phenomenon, red fluorescence was visualized in roots of 3-week-old transformed tomato plants. Most roots (80%-100%) showed red fluorescence, indicating that they are indeed transformed (Figure 3D,E).\n4. Soil-drenching inoculation\nGrow R. solancearum (strain GMI1000 in this protocol) in phi liquid medium (Table 211) in an orbital shaker (200 rpm) at 28 °C until stationary phase.",
    "Determine bacterial numbers by measuring the optical density of the bacterial culture at 600 nm (OD600). Dilute the bacterial culture with water to an OD600 of 0.1 (in conditions used here, this corresponds to approximately 108 colony-forming units [CFU]/mL).\nPlace 16−20 inoculation pots containing transformed tomato plants in an inoculation tray (29 cm x 20 cm; Figure 4A).\nPour 300 mL (~15 mL per plant) of bacterial inoculum (OD600 of 0.1) into the tray containing the inoculation pots. Let them soak in the inoculum for 20 min (Figure 4B).\nPrepare a new tray with a layer of potting soil. Move the inoculated pots into the new tray (Figure 4C) and place the trays in a growth chamber with 75% humidity, 26−28 °C, and a photoperiod of 12 h light and 12 h darkness (130 µmol photons m-2s-1 light).\n5. Determination of infection parameters and statistical analysis\nScore disease symptoms as previously described12,13, using a scale ranging from 0 (no symptoms) to 4 (complete wilting) (Figure 4D-H), each day after Ralstonia inoculation for two weeks.\n\tNOTE: The disease index data are collected from the same experimental unit (each plant) over time.\n6. Gene expression analysis\nNOTE: The expression of the transgene or the silencing of the target gene can be determined by RT-PCR or by quantitative RT-PCR (qRT-PCR).\nCollect samples and extract RNA from a representative part of the transformed root system (to evaluate the effect on the target gene) and leaves (as internal control).\nSynthesize cDNA using 1 µg of total DNase-treated RNA.\nAnalyze gene expression of the target genes by qRT-PCR. Calculate the relative transcription levels using the 2-ΔΔCT method14, using SlEFα-1 as housekeeping gene15.\n\tNOTE: Primer sequences are listed in Table 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}