{
  "id": 11141,
  "origin_website": "Jove",
  "title": "Cell Co-culture Patterning Using Aqueous Two-phase Systems",
  "procedures": [
    "1. Phase System Characterization: Determining Thresholds for Phase Separation\nPrepare solutions containing PEG and DEX in the desired buffer or cell culture medium as shown in Figure 1 (purple dots) in 15 ml or 50 ml conical tubes. Hereafter, PEG and DEX will refer to 35 kDa PEG and 500 kDa DEX; however, critical concentrations will change depending on the two polymers used. Record the mass of PEG and DEX in each solution. High-concentration polymer solutions may take several hours to dissolve. Vortexing can be used for serum-free solutions. For media containing proteins or serum, place the tubes on a rocking stage until both polymers are fully dissolved. Record the weight of the media used to dissolve the polymers and take note of the initial concentrations.\nOnce the polymers are fully dissolved, the solutions should appear cloudy. This is the first indication that phase separation has occurred. To confirm this, allow the polymer solutions to rest in a vertical position at room temperature for 20 min. Centrifugation at 1,000 x g can be used to accelerate the phase separation process. The denser bottom phase will be DEX-rich and the top phase will be PEG-rich.\nSlowly add additional buffer or media to the tubes. Small increments should be used so as not to overshoot the phase separation point.\nWhen the solution becomes clear and no longer phase-separates after centrifugation, the threshold for phase separation has been reached. Record the final weight of the tube.\nUsing the previous recorded weights for the polymers, along with the final weight after adding media, determine the % wt/wt of each the two polymers at which phase separation no longer occurs.",
    "Plot these values as % wt/wt PEG on the y-axis and % wt/wt DEX on the x-axis. This plot, known as the binodal curve, can be used to determine the threshold concentration for phase separation for different concentrations of PEG/DEX in a specific cell culture medium.\n2. Configuration 1: Exclusion Patterning (96-well Plate Format)\nPrepare separate solutions of 5.0% wt/wt PEG and 12.8% wt/wt DEX in cell culture medium. Use ATPS solutions of at least twice the critical point to ensure that an ATPS remains after the polymers equilibrate with respect to each other. There is a small amount of flux of DEX into the PEG-rich phase and vice versa, therefore, working too near the critical concentration can result in loss of the phase system as concentrations drop below critical point. Similarly, transferring the cell culture dish to a humidity- and temperature-controlled incubator can alter the two-phase properties and make the two solutions miscible. Note: Some cells may perform better with other ATPS formulations. Acceptable formulations may be selected based on the binodal curves determined from Part 1.\nHarvest the cells to be used for exclusion patterning. Determine the total number/concentration of cells available. Optional: label the cells with CellTracker or other non-cytotoxic labels for fluorescence microscopy.\nPellet the cells and resuspend the pellet in an appropriate volume of 5.0% PEG to achieve the desired number of cells for exclusion. For example, one well of a 96-well plate requires 37,500 fibroblast cells to be resuspended in 200 μl of PEG to produce confluence the following day. Scale these numbers as appropriate for other cell types and culture substrate sizes.",
    "Using a micropipettor, dispense 0.5 μl droplets of DEX onto a dry cell culture substrate. Larger volume droplets produce larger exclusion zones. Droplets ranging in size from 0.1 to 1 μl are recommended for exclusion micropatterning. Optional: DEX droplets can be deposited 24 hr ahead of time and allowed to dehydrate at room temperature. This can produce cleaner patterns.\nDispense 200 μl of PEG cell suspension into the well to cover the DEX droplets.\nPlace in a humidified incubator for 12 hr at 37 °C, 5% CO2. Make sure that the dish is not tilted during handling and that it is placed on a level incubator shelf to avoid disrupting the patterns.\nRemove the PEG solution and wash three times with 200 μl of culture medium.\nAdd fresh culture medium and return to the incubator.\nMonitor the cultures periodically to observe cell movement into the exclusion zone.\n3. Configuration 2: Island Patterning (96-well Plate Format)\nPrepare solutions of 5.0% wt/wt PEG and 12.8% wt/wt DEX in cell culture medium, as above.\nHarvest the cells to be used for island patterning. Determine the total number/ concentration of cells available.\nPellet and resuspend the cells in an appropriate volume of 12.8% DEX to achieve the desired concentration of cells for island patterning. Concentrations of 5,000 cells/μl or less are recommended for strongly adherent cell types. For cells that have difficulty attaching or cells that loosely adhere, concentrations of up to 10,000 cells/μl may be considered.",
    "Working quickly to avoid drying, pipette 0.5 μl droplets of DEX onto a dry cell culture substrate, as described above. Do not allow droplets to dry. Optional: 200 μl of PEG solution can be added to the well ahead of time. DEX droplets can then be deposited into the PEG solution where they will sink to the bottom and contact the culture surface. This can produce cleaner island patterns.\nCover the DEX droplets with 200 μl of PEG.\nPlace in a humidified incubator for 12 hr at 37 °C, 5% CO2. Make sure that the dish is not tilted during handling and that it is placed on a level incubator shelf to avoid disrupting the patterns.\nRemove the PEG solution and wash three times with 200 μl of culture medium.\nAdd fresh culture medium and return to the incubator.\nMonitor the cultures periodically to observe cell movement and proliferation outwards from the islands.\n4. Configuration 3: Exclusion Co-cultures (96-well Plate Format)\nPrepare solutions of 5.0% wt/wt PEG and 12.8% wt/wt DEX in cell culture medium, as above.\nHarvest the cells to be used for exclusion and island patterning. Determine the total number/concentration of cells available for each cell type. Optional: Some cell pairings may display dramatically different proliferation indices. To prevent the excluded cells from overpopulating the island patterned cells (especially for long term cultures), treat the cells used for exclusion with mitomycin C for 2 hr or irradiate them before harvesting. This will prevent proliferation. Fluorescent CellTracker dyes can be used to distinguish the two cell populations if necessary.",
    "Pellet the cells and resuspend the pellet for exclusion patterning in an appropriate volume of 5.0% PEG to achieve the desired number of cells, as above. Resuspend the pellet for island patterning in an appropriate volume of 12.8% DEX to achieve the desired concentration of cells, as above.\nUsing a micropipettor, dispense 0.5 μl droplets of DEX cell suspension onto a dry cell culture substrate. Do not allow droplets to dry.\nCover the DEX droplets with 200 μl of PEG cell suspension.\nPlace in a humidified incubator for 12 hr at 37 °C, 5% CO2. Make sure that the dish is not tilted during handling and that it is placed on a level incubator shelf to avoid disrupting the patterns.\nRemove the PEG solution and wash three times in 200 μl of culture medium.\nAdd fresh culture medium and return to the incubator.\nMonitor the co-cultures to observe interaction between cell populations. Optional: Controls can be prepared by performing exclusion or island patterning individually, by co-culture cells that do not interact or by blocking pathways of interest in one or both cell populations before or after patterning.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}