{
  "id": 5634,
  "origin_website": "Bio",
  "title": "Endpoint or Kinetic Measurement of Hydrogen Sulfide Production Capacity in Tissue Extracts",
  "procedures": [
    "Note: This protocol includes two related techniques to measure H2S production capacity via an endpoint assay (Procedure B) or a kinetic assay (Procedure C). Both techniques use the specific chemistry in which lead acetate (white in color) is converted to lead sulfide (brown to black in color) upon exposure the H2S. The techniques differ in their detection methods, with (Procedure B) utilizing endpoint densitometry to quantitate lead sulfide spots on the filter paper, while (Procedure C) utilizes the kinetic-capable absorbance of light in the 310 nm wavelength as well as endpoint densitometry of the lead sulfide spots on the agar gel. Shared common procedures and techniques are presented first (Procedure A) and then later split into the specifics that differentiate the two. Shared proceduresTissue samplesExcise mouse liver tissue following euthanasia according to the procedures detailed in the animal use protocol that has been approved by your institutional animal welfare committee.Before euthanasia and harvesting, prepare 10 ml PBS in a Petri dish on ice to use as a wash for removing superficial blood/debris from the excised liver tissues. Also, fill the liquid nitrogen flask with liquid nitrogen.After euthanasia, quickly remove the large left lobe of the liver, rinse in PBS, place into a 1.5 ml centrifuge tube and flash freeze in liquid nitrogen.Leave samples in liquid nitrogen until all livers have been harvested.For previously harvested liver samples, store at -80 °C until ready for homogenization.Homogenize mouse liversWith liver samples in 1.5 ml centrifuge tubes, remove from liquid nitrogen or -80 °C freezer and place on dry ice.Using a sterile or clean disposable razor and forceps, quickly remove the frozen liver from the tube, cut off segments on a hard plastic or other dissecting platform/sheet that is placed on dry ice, and weigh on a scale to approximately 100 mg.",
    "Note: This weight does not need to be accurate, just close enough so that the weight of liver sample to volume of lysis buffer is relatively constant between samples.While still frozen, place the ~100 mg of liver tissue into a new 1.5 ml centrifuge tube precooled on dry ice.Make up a fresh 1x solution of passive lysis buffer (see Recipes) from the 5x passive lysis buffer stock (Promega) with deionized H2O. Note: 1x passive lysis buffer should be kept on regular ice and made fresh with each assay. The 5x passive lysis buffer should always be stored at -20 °C when not in use. Unfortunately the recipe is proprietary.One 1.5 ml tube at a time, add 250 µl of 1x passive lysis buffer to each approximate 100 mg sample.Immediately, start homogenizing with the Motorized tissue grinder (Fisherbrand) with Pellet Pestle (Fisherbrand) until the sample has been thoroughly homogenized. This usually takes 30 sec to 1 min to perform.Remove the grinder and pestle from the tube, secure the cap, and place the homogenized sample and 1.5 ml tube into liquid nitrogen to flash freeze. Continue to homogenize all samples, keeping those completed in the liquid nitrogen.Once all samples have been homogenized, remove all samples at the same time from liquid nitrogen and thaw at room temperature for approximately 5-10 min or in a 37 °C water bath for approximately 1-5 min. Caution: Take care to use tubes suitable to freeze/thaw with liquid N2 to avoid loss of samples and potential injury from exploding tubes.Repeat freeze-thaw an additional two times, ensuring at least 1 min of freezing in the liquid N2 and keeping the same times for thawing as described above.Spin down the tubes in a microcentrifuge for 5 min at 4 °C at 5,000 x g.",
    "Remove and save the supernatants (~200 µl) in 8-strip well format tubes and place on ice if immediately going onto the next step (protein concentration determination). If not, flash freeze the tubes and place into a -80 °C freezer until ready to do protein concentration determination.Protein concentration determination and normalization of protein concentrationsIn fresh 8-trip well tubes, place 198 µl of deionized water and 2 µl of the liver homogenate supernatant to make a 1:100 dilution.Follow the directions of the Pierce BCA Protein Assay Kit for preparing the working solutions and standard BSA solutions (between 0 µg/µl to 2 µg/µl) that are contained in the kit for the protein concentration assay.Pipette 200 µl of the assay solution in each needed well, and 5 µl of the standard or 1:100 diluted sample.Cover with plastic wrap and incubate at room temperature in the dark for 30 min.Unwrap the plate and place it onto a UV-Vis spectrophotometer.Note: We use a Synergy 2 multimode plate reader running the Gen5 software, but other plate readers can be used.Measure the absorbance of light at 562 nm.Determine the protein concentration of each sample based on the standard curve equation obtained from the absorbance at 562 nm from each of the standards.In new 8 strip well tubes, normalize the protein concentration of each sample to 20 µg/µl using 1x passive lysis buffer. Bring up the final volume to 100 µl. Note: If 20 µg/µl is not possible, then dilute each sample to 10 µg/µl or other suitable concentration.Filter paper-embedded lead acetate endpoint assayPrepare lead acetate filter papersIn a large glass Pyrex dish, pour 100 ml of 20 mM lead(II) acetate trihydrate (see Recipes) in deionized H2O.Cut the 703 style Whatman filter papers into approximate size dimensions of a 96-well plate (8 x 12.5 cm).",
    "Place the cut filter papers into the lead(II) acetate trihydrate solution and let soak for at least 20 min.Embed and dry the lead(II) acetate trihydrate into the filter papers by placing the wet papers into the vacuum oven set at 110 °C and the vacuum turned on. Let the papers sit in the vacuum oven at these settings for 20-30 min.Store the finished papers at room temperature in a dark and dry area until ready for use. Although we have not empirically tested the shelf-life and stability of these papers, they are good for at least one month after their production.Prepare H2S production capacity reaction solution. Note: This must be done fresh for each assay. Calculate the volume needed to run all of the samples. Each sample requires 150 µl of reaction solution (see Recipes).Prepare working stock of L-cysteine (100 mM in PBS) and pyridoxal 5’-phosphate (PLP) (10 mM in PBS). The cysteine must be made fresh each time. For PLP, warming to 37 °C and vortexing may be necessary to completely solubilize the powder. The PLP stock solution can be stored in aliquots at -20 °C for several months.In an adequate amount of PBS to cover the needed volume of reaction mixture, add L-cysteine to a final concentration of 10 mM and pyridoxal 5’-phosphate hydrate to a final approximate concentration of 1 mM.Keep at room temperature and use immediately.Setting up the assayIn each well of a 96-well plate, pipette 150 µl of the reaction mixture.In each well, pipette 0-500 µg of sample protein. We have found 100 µg (or 5 µl when samples are diluted to 20 µg/µl) produces a detectable and non-saturating signal within 1 h with liver lysates. Other tissues may require more protein.",
    "Once all samples have been added, ensure there is no residual or spilled liquid on the surface of the 96-well plate by gently wiping with tissue paper.Place the dry lead acetate embedded filter paper directly over the 96-well plate.Place a similar sized piece of hard/rigid plastic or other non-flexible cover over the paper to keep it in place and ensure direct contact of the lead acetate paper with the lips of the wells on the plate.Place the heavy heating block cube or other heavy object with similar dimensions (9.5 x 7.5 x 5 cm) over the piece of hard plastic. Making sure not to shake or spill any of the liquid, place the ‘sandwich’ into a non-shaking/rocking 37 °C incubator.Over time, brown to black circles will form on the filter paper over the wells (see Figure 1 for visual example). This is the formation of lead sulfide due to the interaction of lead acetate with hydrogen sulfide.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170629/20170629205105_5675.jpgFigure 1. Filter paper-embedded lead acetate endpoint assay for H2S production capacity determination from liver extracts. A. Schematic overview of the assay. Liver is excised from the mouse, homogenized and lysed in passive lysis buffer followed by protein determination and normalization. In a 96-well plate, the reaction mixture is added first, followed by the liver lysate samples. The lead acetate paper, rigid plastic, and weight are then placed on top of the 96-well plate. Incubation occurs at 37 °C for 1 to 2 h followed by imaging and analysis of the lead sulfide dots on the paper. B.",
    "Photographic image of the lead acetate embedded filter paper after a 2-h incubation at 37 °C over a 96-well plate containing increasing amounts (between 0 to 500 µg) of mouse liver protein in each in a 150 µl reaction in PBS containing 10 mM L-cysteine and 1 mM pyridoxal 5’-phosphate hydrate. The dark circles are due to the formation of lead sulfide on the filter paper. C. Quantification of the image in (B) using the Integrated Density (IntDen) function of the software program ImageJ and subtracting out the background. Notice that this two hour exposure leads to a saturation plateau between the 300 to 400 µg reactions.After 45 min, take a look at the paper by looking from the underside of the plate. Do not take apart the ‘sandwich’.Once strong circles have formed, which usually takes 1 h to 2 h, remove the filter paper and place off to the side. A new filter paper can be placed onto the same plate and the ‘sandwich’ reassembled and placed back into the 37 °C incubator for a second or even third exposure. These secondary exposures will take less time to reach a saturation point, so care must be used to not incubate too long. Approximately 15 min to 30 min is all that is needed to obtain a signal for the secondary/tertiary incubations/exposures when using strong H2S producing tissues like the liver.To each finished paper, image with a digital camera or scanner.Note: Over time, the brown to black circles can become photobleached if exposed to light.",
    "Thus, if some samples may have hit a saturation point on the filter paper, the paper can be left out in ambient light for several hours to decrease the intensity of all the bands and bring the circles to a non-saturating point in order to more accurately analyze differences between strong and weak producing samples. However, it is recommended that a new, shorter incubation/exposure be performed (such as the 15-30 min secondary/tertiary exposure) to obtain an image with signals in the linear range.The image file can then be analyzed by densitometry of each circle via ImageJ using the IntDen (Integrated Density) as the readout. Make sure to also analyze the same size area of a portion of the filter paper where there was no sample to be used for background subtraction.The results will give a relative H2S production capacity when compared to a standard, control, or known amount of protein added. It is recommended to run all samples in duplicate or triplicate. Results can be presented as average H2S production capacity relative to a control group or standard, or can be plotted as the raw arbitrary IntDen units given from the ImageJ analysis subtracting the background reading. An example of the experimental setup, data output and analysis of the lead acetate/lead sulfide filter paper method and data analysis using a single liver homogenate but with various amounts of protein input (from 0 to 500 µg) is given in Figure 1.Agar-embedded lead acetate kinetic assay for H2S production capacity determination from liver extracts and data analysisThis adaptation of the filter-paper embedded lead acetate endpoint assay described above was inspired by the use of a Nafion polymer embedded silver ion microplate for H2S production (Jarosz et al., 2013).",
    "This assay offers the potential for kinetic analysis, making it much easier to confirm that the data obtained are in the linear range and below the saturation point. Drawbacks compared to the filter paper method include increased set up time and decreased number of samples that can be run at once. The method is described below:Prepare the lead acetate agar plateMake 50 ml of 1% agarose gel (Agarose HS Molecular Grade from Denville) (see Recipes) in double deionized H2O in a glass Pyrex flask by microwaving until all of the agarose has dissolved.Let it cool slightly, but do not let it start solidifying. Add lead(II) acetate trihydrate to the agarose to a final concentration of 100 mM. Hand mix the flask until all of the lead(II) acetate trihydrate is dissolved. Note: Under normal conditions, lead acetate is not volatile under room temperature or in room temperature solutions with water. However, care should be taken, such as wearing a face mask, when putting it into the hot/warm agar. Additionally, proper disposal of lead containing compounds into appropriate chemical waste containers should be completed as per the regulations of each respective research institution.Pour the 1% agarose/100 mM lead acetate solution onto the top cover of a 96-well culture plate.Allow the solution to solidify and cool for 30 min in the dark on a flat surface.Note: The volume of the agarose/lead acetate solution added to the top cover is approximately 50 ml.",
    "However, due to differences in the shapes and styles of 96-well format plates and tops, this volume may need to be adjusted in order to cover the entire surface of the inside of the lid and have enough volume so that the well edges touch the gel in a way that they leave a slight impression into the gel without breaking the gel.After the gel has solidified, place it in the dark uncovered while the H2S production capacity reaction solutions and plate are prepared. It should be used immediately and not stored long term in order to prevent drying/cracking of the gel.Set up the H2S production assay reactionsPrepare H2S production capacity reaction solution. This must be freshly done with each assay.Calculate the volume needed to run all of the samples. Each sample requires 150 µl of reaction solution.In an adequate amount of PBS to cover the needed volume of reaction mixture, add L-cysteine to a final concentration of 10 mM and pyridoxal 5’-phosphate hydrate to a final concentration of 1 mM from stocks as described previously.Keep at room temperature and use immediately.In each well of a 96-well plate, pipette 150 µl of the reaction mixture. Note: To prevent cross contamination of signal between wells, it is recommended to skip a space in all directions from each well used.In each well, pipette 0-300 µg of sample protein. Once all samples have been added, ensure there is no residual or spilled liquid on the surface of the 96-well plate by gently wiping with tissue paper.Directly place the solidified lead acetate agarose gel containing lid cover over the 96-well plate. Note: Make sure the lid is firmly in place to avoid cross contamination between wells, but do not press too hard so that the gel is broken.",
    "An illustrative description of the assay setup is given in Figure 2A.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170629/20170629205548_9333.jpgFigure 2. Agar-embedded lead acetate kinetic assay for H2S production capacity determination from liver extracts. A. Schematic overview of the assay. Liver is excised from the mouse, homogenized and lysed in passive lysis buffer followed by protein determination and normalization. In a 96-well plate, the reaction mixture is added first, followed by the liver lysate samples. The lead acetate gel-filled plate lid, which is prepared just prior to setting up the reaction, is placed on top of its compatible 96-well plate. Absorbance at 310 nm is at 0 min to establish a baseline prior to incubating the plate at 37 °C. Throughout the incubation, the absorbance at 310 nm is determined at various time points as lead sulfide gradually forms in the gel. At the completion of the assay, the lead sulfide dots in the gel-filled lid are imaged and analyzed. B. Photographic image of a 96-well plate with a lid cover containing a lead acetate embedded agarose gel after a 2-h incubation at 37 °C. Reaction wells contained various amounts of mouse liver protein (between 0 to 300 µg) as indicated in a 150 µl reaction in PBS containing 10 mM L-cysteine and 1 mM pyridoxal 5’-phosphate hydrate. The dark circles are due to the formation of lead sulfide in the agarose gel. The well highlighted by the red circle contained only the reaction mixture without any protein added and served for background subtraction in the Data analysis. C and D. Plots of the absorbance of light at 310 nm after subtracting background when the entire assembly (plate and lid) was analyzed in the plate reader as a function of time (C) or protein concentration (D) on the x axis. E.",
    "Photographic image of the lid cover containing a lead acetate embedded agarose gel after 5 h of incubation at 37 °C. The dark circles are due to the formation of lead sulfide in the agarose gel. The spot highlighted by the red circle corresponds to the well that did not have any protein added and served as background subtraction in the data analysis. F. Plot of the absorbance of light at 310 nm after subtracting background when using just the lid, after a 5 h incubation at 37 °C, was analyzed in the plate reader as a function of protein concentration on the x axis. G. Quantification of the image in (D) using the Integrated Density (IntDen) function of the software program ImageJ and subtracting out the background and plotting the average IntDen for each sample set as a function of protein concentration on the x axis.Take baseline absorbance at 310 nm reading on the UV-Vis spectrophotometer.Incubate the plate at 37 °C in the dark for 0-120 min. At various timepoints between 0-120 min, take the plate out and analyze the absorbance at 310 nm on the plate reader.Visual data obtained during the kinetic/timecourse portion of this assay that can be used for endpoint analysis if so desired is done by taking an image of the plate with the lid to visualize the formation of lead sulfide (Figure 2B). Quantitative and numerical data obtained during the kinetic/timecourse portion of this assay is accomplished by subtracting the background absorbance at 310 nm from the 0 µg protein reaction and plotting the absorbance data at 310 nm for the experimental samples. This can be done as a function of time on the x axis (Figure 2C) or as a function of protein concentration on the x axis (Figure 2D).",
    "Visual data obtained during the endpoint analysis of this assay is done by removing the lid and taking a digital image of the underside of the lid to capture the dark lead sulfide circles formed from H2S exposure to the lead acetate in the gel (Figure 2E). Quantitative and numerical data obtained during the endpoint analysis of this assay is accomplished by placing just the lid upside down into the plate reader and reading the absorbance at 310 nm, subtracting the background, and plotting the values on a graph as a function of protein concentration on the x axis (Figure 2F). Additionally, the digital image of the gel can be analyzed for densitometry of each circle via the software program ImageJ (similar to the procedure described for the lead acetate/lead sulfide filter paper method) using the IntDen (Integrated Density) as the readout. Make sure to also analyze the same size area of a portion of the gel where there was no protein sample added to be used for background subtraction. The values are plotted on a graph as a function of protein concentration on the x axis (Figure 2G)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}