{
  "id": 12208,
  "origin_website": "Jove",
  "title": "Tumor Engraftment in a Xenograft Mouse Model of Human Mantle Cell Lymphoma",
  "procedures": [
    "The human blood samples were used according to procedures approved by the local ethics and human experimentation committees of the Geneva University Hospital.\nAnimal procedures were performed in accordance with the Institutional Ethical Committee of Animal Care in Geneva, Switzerland and the Cantonal Veterinary Office (authorization number: GE/26/15).\n1. Preparation of Primary Peripheral Blood Mononuclear Cells (PBMCs) by Density Gradient Separation\nNOTE: 3 - 5 mL of peripheral blood was obtained from patients presenting with MCL in a leukemic phase. The diagnosis was established according to standard diagnostic criteria for flow cytometry (CD5+, CD23−, CD200+, monoclonal B cell population), and subsequently confirmed by presence of the chromosomal translocation t(11;14) and overexpression of cyclin D1. In all cases, monoclonal B cells constituted to >90% of the total B cell population. The remaining cells were mainly monocytes and some T cells.\nDilute (1:1) 5 mL of MCL blood sample with 5 mL of Roswell Park Memorial Institute medium 1640 (RPMI) (Figure 1A).\nInvert the density gradient media (Table of Materials) several times before use to ensure thorough mixing.\nAdd 5 mL of density gradient media into a 15 mL centrifuge tube using a pipette aspirator.\nGently layer the diluted blood sample over the density gradient media in the 15 mL centrifuge tube using an aspirator (the blood to density gradient media ratio should be 2:1, e.g., 10 mL of blood to 5 mL of density gradient media). Care should be taken to not mix the two layers (Figure 1B, C).\nCentrifuge the sample at 400 x g for 40 min at room temperature with the centrifuge brakes turned off.\nUsing a sterile Pasteur pipette, gently aspirate the middle layer (whitish, thin ring marked with an arrow (Figure 1D, E)) containing the mononuclear cells and transfer them into a clean tube.",
    "Washing of mononuclear cells\n\t\nEstimate the volume of the transferred cell suspension and add to it 3 volumes of sterile 1x phosphate buffered saline (PBS) with 1% bovine serum albumin (BSA).\nMix the suspension by pipetting up and down several times.\nCentrifuge the suspension at 400 - 500 x g for 10 - 15 min at room temperature.\nDiscard the supernatant to obtain the cell pellet and repeat the wash step again.\nRemove the supernatant and resuspend the cells in the desired volume, e.g., 1 or 2 mL of PBS.\nCount the number of cells by an automated cell counter or manually using a hemocytometer (Neubauer chamber).\n2. Enrichment of B Cells by B Cell Negative Selection\nDilute the cells in PBS to a final concentration of 50 x 106 cells/mL.\nTransfer the cells to a 5 mL round bottom polystyrene tube. Add 100 µL of antibody cocktail from the B cell enrichment kit to 2 mL of cell suspension, and mix gently by pipetting up and down (Figure 2-1).\nIncubate the cells at room temperature for 10 min.\nBriefly vortex the magnetic particles provided in the B cell enrichment kit for 30 s (Figure 2-2). Add 150 µL of the magnetic particles to 2 mL of the sample .\nIncubate the sample for another 5 min at room temperature.\nBring the sample volume to 2.5 mL with 1x PBS containing 2% fetal calf serum (FCS) and 1 mM ethylenediaminetetraacetic acid (EDTA). Place the tube in the magnet and incubate the tube for another 3 - 5 min (Figure 2-3).",
    "Pick up the magnet with the tube in place, and in one continuous motion, decant the tube so that the enriched cell suspension is collected in a fresh tube (Figure 2-4). Count the cells by an automated cell counter or manually using a hemocytometer to obtain the total yield of B cells.\n\tNOTE: Typically, the yield is ~105 B cells/mL for normal B cells and 5 - 50 x 106 cells/mL for MCL.\nConfirming the purity of the B cell enrichment\n\t\nTake ~ 50,000 cells and incubate the cells with anti-CD19/CD20 antibodies (1:20 dilution) and anti-CD45 antibody coupled to different fluorochromes (1:10 dilution) at room temperature for 15 - 30 min.\nWash with 1 mL of 1x PBS + 1% BSA, centrifuge the cells at 400 - 500 x g for 5 min, and resuspend the cells in ~200 µL of PBS.\nAcquire the cell samples by flow cytometry and analyze for the purity of B cells. Purity is mostly >90% by this method (Figure 3).\n3. Development of the Xenograft Mouse Model\nSuspend ~40 - 60 x 106 cells in 150 - 200 µL of 1x PBS (volume required to inject per mouse).\nInject 150 µL of the cell suspension intravenously (i.v.) into each tail vein of 6 - 7 week old immunodeficient NOD scid gamma (NSG) mice irrespective of the gender (Figure 4A).\nAllow the mice to develop human lymphoma for ~10 weeks.\n\tNOTE: Primary human lymphoma cells take much longer to develop tumor compared to human lymphoma cell lines (~3 weeks).\nWhen the animals start to show symptoms of fatal illness like weight loss, ruffled hair, decreased activity, hind limb paralysis, etc., sacrifice the mice by CO2 asphyxiation followed by cardiac heart puncture to obtain blood.",
    "Collect different organs like bone marrow, spleen, and liver by dissecting the mice and collect peripheral blood by drawing blood from the heart at the time of sacrifice for tumor engraftment analysis (Figure 4B - F).\n4. Chimerism Analysis of Tumor Cell Engrafted in Different Organs\nAfter collecting the different organs, process them by mechanical disruption to generate single cell suspensions following red blood cell (RBC) lysis using 200 µL of 1x ammonium chloride potassium buffer for blood and bone marrow, 500 µL for spleen, and 2 mL for liver.\nCount and stain the cells using human B cell specific antibodies, i.e., anti-CD19, anti-CD20, and anti-CD45.\n\tNOTE: NSG mice lack B cells and hence for analysis, cells are stained with human specific B cell markers.\nAnalyze the cells derived from each organ by flow cytometry by gating on B cells (CD19+, CD20+, CD45+).\nQuantify the engrafted tumor cells in different organs derived from MCL injected mice based on the gated cells as indicated in step 4.3 (Figure 4G) .\n\tNOTE: See Table of Materials for details.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}