{
  "id": 18841,
  "origin_website": "Jove",
  "title": "Isolation and Functional Characterization of Human Ventricular Cardiomyocytes from Fresh Surgical Samples",
  "procedures": [
    "The experimental protocols on human tissue were approved by the ethical committee of Careggi University-Hospital (2006/0024713; renewed May 2009). Each patient gave written informed consent.\n1. Solutions and Equipment Preparation\nSolutions are described in Table 1. A simplified flowchart of the cell isolation procedure is found in Figure 1.\ntable:\n﻿0,1,2,3,4,5,6,7,8\nSolution,Solution,CP,DB,KB,TB,PS,EB1,EB2\nReagent (mM),KH2PO4,50,,,,,,\nReagent (mM),MgSO4,8,1.2,5,,,1.2,1.2\nReagent (mM),HEPES,10,,,10,10,,\nReagent (mM),adenosine,5,,,,,,\nReagent (mM),glucose,140,10,20,10,,10,10\nReagent (mM),mannitol,100,,,,,,\nReagent (mM),taurine,10,20,5,,,20,20\nReagent (mM),NaCl,,113,,136,,113,113\nReagent (mM),KCl,,4.7,85,5.4,25,4.7,4.7\nReagent (mM),MgCl2,,,,1.2,5,,\nReagent (mM),KH2PO4,,0.6,30,,,0.6,0.6\nReagent (mM),Na2HPO4,,0.6,,,,0.6,0.6\nReagent (mM),NaHCO3,,12,,,,12,12\nReagent (mM),KHCO3,,10,,,,10,10\nReagent (mM),Na-pyruvate,,4,,,,4,4\nReagent (mM),BDM,,10,,,,10,10\nReagent (mM),BHBA,,,5,,,,\nReagent (mM),succinic acid,,,5,,,,\nReagent (mM),EGTA,,,0.5,,,,\nReagent (mM),K2-ATP,,,2,,,,\nReagent (mM),pyruvic acid,,,5,,,,\nReagent (mM),creatine,,,5,,,,\nReagent (mM),KMES,,,,,115,,\nEnzymes (U/ml),Collagenase Type V,,,,,,250,250\nEnzymes (U/ml),Protease Type XXIV,,,,,,4,\npH,,7.4 KOH,7.3 NaOH,7.1 KOH,7.35 NaOH,7.2 KOH,7.3 NaOH,7.3 NaOH\nTable 1. Solutions used for specimen collection, cell isolation and functional characterization of myocytes. CP= cardioplegic solution; DB=dissociation buffer; KB= Kraft-Bruhe solution; TB=Tyrode buffer; PS=pipette solution; EB1= enzyme buffer 1; EB2= enzyme buffer 2.\nPrepare cardioplegic (CP) solution. CP solution can be stored at 4 °C for up to 1 week.\nPrepare Ca2+-free dissociation buffer (DB). This solution should be used within the day.\nPrepare Kraft-Bruhe (KB) solution. KB solution can be stored at 4 °C for up to 1 week.\nPrepare Ca2+-free Tyrode buffer (TB). This solution should be used within the day.\nFilter all solutions using syringe filters prior to use.\nPrepare the digestion device (Figure 2), a scraping container made of two facing brushes of silicone elastomer, one of which rotated by an electric motor. The digestion device is custom made. Details on the digestion device are in Figure 8; images of the device are in Figures 2C and 2D. Wash the tissue chamber with 70% ethanol and water.\n2. Collection and Processing of Myocardial Samples",
    "Pour 40 ml of cardiplegic (CP) solution in a 50 ml tube and store it in ice for specimen transportation from the operative room to the cell isolation lab.\nCollect the ventricular myocardial specimen from the operative room immediately after excision, wash it with ice cold CP solution and store it in the tube. Use endocardial specimens excised from the upper inter ventricular septum during open heart surgery, weighting >100 mg.\nRapidly transfer the specimen to the lab area; start specimen processing within 10 min from specimen excision.\nWhile keeping the specimen in ice cold CP buffer, carefully remove the endocardial fibrotic layer using fine scissors under a stereomicroscope; afterwards, cut the myocardial tissue to small pieces (2-3 mm long). Depending on tissue sample size, cut a total amount of ventricular myocardium between 100 mg and 1 g for each isolation.\nUpon completion of tissue mincing, transfer the myocardial chunks into the digestion device, with clean ice cold CP solution. Avoid filling the whole volume between the two silicon brushes (3-4 ml) with myocardial chunks, using no more than 1 g of total tissue.\n3. Washing and Digestion of Myocardial Chunks\nAfter the chunks are transferred into the scraping chamber of the digestion device, change the CP buffer in the chamber with cold Ca2+-free dissociation buffer (DB).\nPlace the digestion device in a thermostatic bath, in order for the chamber to be in contact with the heated water in the bath (Figure 1). Set the bath to 37.5 °C and turn it on, in order to slowly raise the temperature of the tissue chamber. Turn on the motor of the digestion device, setting the rotation speed to 1 revolution/second.",
    "Perform 3 washing cycles with DB, changing the solution in the chamber with clean DB every 8 min. The DB is warmed (37 °C) and oxygen saturated before getting in contact with the myocardial chunks.\nPrepare enzyme buffer 1 (EB1) by adding 250 U/ml of Collagenase Type V and 4 U/ml Protease Type XXIV to DB solution. Prepare enzyme buffer 2 (EB2) by adding 250 U/ml Collagenase Type V to DB solution. Warm up (37 °C) and oxygenate EB1 and EB2.\nPerform two 12 min cycles of digestion in the rotating digestion device with 100% oxygenated EB1 (at 37 °C). At each cycle, use ~3 ml of EB1. Remove the solution by pipette aspiration and discard it after each cycle.\nPrepare 6 15 ml tubes for cell collection and ~80 ml of cold (4 °C) KB solution for eluting the buffers.\nPerform a first 15 min digestion cycle with 3 ml 100% oxygenated EB2 at 37 °C. After the digestion cycle, collect the solution containing the first dissociated myocytes in a 15 ml tube and dilute the cell suspension with 12 ml cold KB solution. Store the tube flat at room temperature.\nDilute the remaining EB2 solution with an equal amount of DB in order to halve the concentration of collagenase V for the following digestion cycles.\nPerform other 5 12 min digestion cycles with 3 ml EB2 at 37 °C; after each of them collect of myocyte containing buffer in a 15 ml conical tube and dilute it with 12 ml KB solution. Store the 6 cell containing tubes at room temperature for 30 min.\n4. Cell Resuspension and Ca2+ Readaptation\nAdd 1 mg/ml bovine serum albumin (BSA) to 20 ml Ca2+-free Tyrode buffer (TB). Filter the solution.",
    "Centrifuge the six myocyte containing conical tubes at 100 x g for 5 min to force myocytes to settle. Remove the supernatant and resuspend the cells in each tube with a variable amount (1-3 ml, depending on the yield) of BSA containing TB at RT.\nGradually increase Ca2+ concentration in the cell containing buffer by adding small aliquots of 100 mmol/L CaCl2 solution. In the first and second steps Ca2+ concentration is raised up to 50 μmol/L and 100 μmol/L, respectively. The following Ca2+ addition steps are performed every 5 min and the concentration is raised by 100 μmol/L at each step to a final concentration of 0.9 mmol/L.\nAssess the yield of the isolation procedure. Transfer 0.5 ml of myocyte containing solution onto the glass bottom chamber of a microscope. Evaluate 15 microscope fields at 10x objective magnification and calculate the percentage of healthy myocytes (e.g. rod shaped cells with clear striations and no significant inclusions, Figure 2). The expected yield is around 20 %.\n5. Functional Evaluation of Isolated Cardiomyocytes.\nThe following protocol is an example of human cardiomyocyte functional assessment including simultaneous recordings of action potentials and intracellular Ca2+ fluxes.\nPrepare pipette solution (PS) for patch clamp experiments in perforated patch configuration. The solution can be stored at -20 °C for up to 3 months.\nAdd 1.8 mmol/L CaCl2 to Ca2+-free Tyrode buffer (TB). Use this solution for superfusion of cardiomyocytes during patch clamp/fluorescence experiments.\nTransfer 1 ml of cell suspension to a 1.5 ml tube and add 10 μmol/L Fluoforte and 10 μl Powerload Concentrate. Incubate for 30 min at RT. Afterwards, set the tube in vertical position and leave the cell to settle for 5 min; resuspend the cells in Ca2+ containing TB.",
    "Transfer 0.25 ml of cell suspension to a small (0.5 ml), temperature controlled microscope mounted recording chamber, superfused by gravity with a heated microperfusor system at a flow rate of 0.3 ml/min (temperature: 37 ± 0.5 °C).\nUsing a micropipette puller, prepare patch clamp pipettes with a tip diameter of 3 to 5 μm and a resistance of 3 to 4.5 M when filled with PS.\nAdd amphotericin B to a batch of PS (250 μg/ml) and use it to fill the electrodes. \nSelect a rod shaped cell with clear striations, devoid of inclusions, form the giga seal and wait 5 to 10 min, until access resistance drops below 20 MΩ.\nElicit action potentials in current clamp mode using short pulses (< 3 msec) at different frequencies of stimulation (0.2 Hz, 0.5 Hz and 1 Hz, 1 min at each frequency). During the recording phase, turn on bright field illumination at 492 ± 3 nm and detect Fluoforte fluorescence at 505-520 nm. Acquire fluorescence and membrane potential signals using Digidata 1440A and pClamp 10.0 software. Repeat the recording sequence multiple times if needed; however, keep the total recording time below 15 min for each cell.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}