{
  "id": 13655,
  "origin_website": "Jove",
  "title": "In Vitro Colony Assays for Characterizing Tri-potent Progenitor Cells Isolated from the Adult Murine Pancreas",
  "procedures": [
    "Ethical Statement: We adhere to the widely accepted ethical standards in conducting research to ensure the quality and the integrity of the results. Animal experimentation is conducted according to protocols approved by the Institutional Animal Care and Use Committee at City of Hope.\n1. Prepare Single-cell Suspension from Adult Murine Pancreata\nNOTE: In prior publications 7,11, CD-1 or B6 background mice were used; both backgrounds yielded similar results. A transgenic mouse line (designated Sox9/EGFP) with enhanced green fluorescence protein driven by Sox9 loci 19,20, was created in the CD-1 background.\nEuthanize 3 to 5 adult mice using gas CO2 for 1-2 min or until breathing stops. Next, perform cervical dislocation on each mouse.\nDissect and Prepare the Pancreata.\n\tNOTE: Dissect the mice as soon as possible after euthanasia. This is important to avoid auto-digestion of the pancreas due to post-mortem changes.\n\t\nMake a vertical incision on the midline of the abdominal wall of the mouse using scissors and open the abdominal cavity. Find the spleen and use forceps to gently lift it. Cut the connective tissue between the spleen and the splenic lobe of the pancreas with scissors.\n\t\t\nRepeat this practice for the duodenal and gastric lobes of the pancreas. Place the pancreatic tissues in a Petri dish on ice containing cold Dulbecco's modified phosphate buffer solution (DPBS), 0.1% bovine serum albumin (BSA), and penicillin and streptomycin (P/S; complete solution designated as PBS/BSA).\nRemove fat tissues from the pancreas under a dissecting microscope using fine-tip forceps.\n\t\tNOTE: This is critical for the health of the dissociated pancreatic cells in the following steps.\n\t\t\n(Optional) Check the pancreata for green fluorescence under the fluorescence stereomicroscope using 488-509 nm excitation to ensure EGFP expression.",
    "In a tissue culture hood, rinse the tissue three times sequentially in three 100 mm Petri dishes containing 10 ml of cold PBS/BSA.\nGenerate Small Pieces of Tissues.\n\t\nTransfer the dissected pancreata to a dry sterile Petri dish to remove as much PBS/BSA as possible, and transfer them to another dry Petri dish on ice.\nPrepare PBS/BSA containing DNase I by adding 2 µl DNase I stock solution (1 million units [MU] /ml) per 1 ml PBS/BSA.\n\t\tNOTE: This solution is designated PBS/BSA/DNase I. Make ~200 ml of this solution at once, which will cover one sorting experiment.\nMince the pancreata using spring scissors for 2-3 min or until the tissue is in fine pieces. Add 2-3 ml of cold PBS/BSA/DNase I to the tissue pieces in the Petri dish to suspend them.\nTransfer the tissue pieces to a 50 ml conical tube on ice with a 10 ml pipette. Bring the total volume to 10 ml with PBS/BSA/DNase l after recovering as much tissue as possible.\nDigest the Pancreatic Pieces into Mostly Single Cells.\n\t\nAdd collagenase B (100 mg/ml stock) at 350-450 µl/10 ml to the tissue pieces and incubate the tissue at 37 °C in a water bath for 8 min, swirling every 3-4 min. Use a 10 ml syringe with a 16 ½ G needle to draw up and subsequently spray the tissue solution down the wall of the 50 ml tube at RT. Repeat this seven times.\n\t\tNOTE: Use enough force to break up the cell clusters but avoid generating bubbles that may kill the cells.",
    "Return the tube to the water bath at 37 °C for 8 min and mix by swirling every 3-4 min. Syringe the tissue up and down seven times, as mentioned above, and place a sample (10 µl) of the tissue solution on a dry Petri dish. Observe the tissue solution under an inverted, phase-contrast, light microscope with a 10X objective lens. Expect single cells and some small-sized cell clusters to be present.\nHandle the cells on ice from this point on to slow or stop the activity of collagenase. Adjust the volume to 50 ml using cold PBS/BSA/DNase I. Centrifuge the cells at 400 x g for 5 min at 4 °C, and resuspend in 5 ml of cold PBS/BSA/DNase I using a P1000 pipettor.\nFilter to Yield Single Cell Suspensions and Wash.\n\t\nFilter the cells through a 70 µm nylon mesh filter cup and then through a 40 µm nylon mesh filter cup.\nResuspend the cells in 5 ml cold PBS/BSA/DNase I and count the cells.\n\t\tNOTE: For 2-4 month-old B6 or CD-1 mice, each pancreas may yield ~5 or 10 million cells, respectively. These numbers may vary among different experimentalists. If excessive cell debris is found at counting, bring the volume to 50 ml with cold PBS/BSA/DNase I and centrifuge the cells at 400 x g for 5 min at 4 °C.\nAdjust the volume of the cell suspension to a concentration of 2 x 107 cells/ml using cold PBS/BSA/DNase I.\n2. Sort the Cells to Enrich Pancreatic Colony-forming Progenitors",
    "NOTE: From B6 mice, CD133+ but not CD133- cells are enriched for PCFUs 7,9,11. CD133+ cells represent ~13% of the total dissociated pancreatic cells after all gating parameters are applied11. From CD-1 mice, CD133+Sox9-EGFP+ cells typically represent ~4% of total pancreatic cells, and this cell population is enriched for PCFUs 7. Sorting of the CD133+Sox9/EGFP+ cells is described here.\nStain the Dissociated Pancreatic Cells.\n\t\nBlock the entire pancreatic single-cell suspension to reduce non-specific binding by incubating the single-cell suspension with anti-mouse CD16/32 at 10 µg/ml final concentration for 5 min on ice.\nRemove an aliquot of 1 x 106 cells (50 µl) to stain with the isotype control antibody, biotin-conjugated rat IgG1 at 5 µg/ml final concentration, for 20 min on ice, swirling every 5-7 min.\nRemove an aliquot of 1 x 106 cells (50 µl) and keep on ice as an unstained control.\nStain the remainder of the cells with a biotin-conjugated anti-mouse CD133 primary antibody, at 5 µg/ml final concentration, for 20 min on ice, swirling every 5-7 min.\nWashing Cells.\n\t\nWash the isotype control and primary antibody-stained samples by bringing the volume to 1 ml with PBS/BSA/DNase I and centrifuge at 400 x g for 5 min at 4 °C. Repeat this washing step.\nResuspend the isotype control and primary antibody-stained samples in PBS/BSA/DNase I, so the final concentration is 2 x 107 cells/ml.\nStain the isotype control and primary antibody-stained samples with streptavidin (STV)-labeled allophycocyanin (APC) at 2 µg/ml final concentration. Incubate for 15 min on ice, swirling every 5-7 min.\nWashing cells and 4',6-diamidino-2-phenylindole (DAPI) staining.",
    "Wash the isotype control and primary antibody-stained samples twice with PBS/BSA/DNase I, as in step 2.2. Resuspend the cells in PBS/BSA/DNase I with DAPI (0.2 µg/ml final concentration). The final volume of the isotype control sample should be 0.5 ml.\n\t\tNOTE: Ensure that the final density of the primary antibody-stained sample is appropriate for the sorter to be used. A concentration of 5 x 106 cells/ml is routinely used for sorting.\nAdjust the volume of the unstained cells to 0.5 ml with PBS/BSA/PS/DNase I. Filter all cells through a 20 µm mesh before sorting and keep the cells on ice in the dark.\nSorting of Cells.\n\t\nUse an 80 µm or larger nozzle for sorting.\n\t\tNOTE: Murine pancreatic endocrine cells are prone to physical stress. However, murine PCFUs do not appear to be affected by the stress caused by passing through a sorter 7.\nAcquire cell events and analysis parameters on the sorter. Gate the cells for forward and side scatter areas to exclude cell debris 7. Gate for forward and side scatter widths to exclude cell doublets. Gate to exclude DAPI+ dead cells 7. Choose gating parameters for the EGFP and CD133-APC signals based on the values from the isotype control cells (Figure 1).\nCollect the sorted cells into 5 ml polystyrene tubes containing 1.5 ml of DMEM/F12 medium supplemented with 5% fetal calf serum (FCS). Centrifuge the sorted populations at 400 x g for 5 min and resuspend in a small volume (~200 µl) of either DMEM/F12 or PBS/BSA/DNase I supplemented with 5% FCS. Keep the cells on ice until use.\nCount the number of CD133+Sox9-EGFP+ cells obtained from the sorter. Take a 10 µl cell sample and count the cells with a hemacytometer to determine the cell density.",
    "NOTE: Hemacytometer use is recommended because machine counts from the sorter are often unreliable.\n3. Plate the Sorted Cells into the Colony Assay Containing Murine ECM Proteins \nNOTE: Please refer to the detailed protocols for the plating of cells into the murine ECM-containing colony assay in another JoVE publication 18. \nPrepare Culture Media.\n\t\nPrepare a culture medium containing DMEM/F12 medium, 1% (wt/v) methylcellulose, 5% (v/v) murine ECM proteins, 50% (v/v) conditioned medium from mESC-derived pancreatic-like cells, 5% (v/v) FCS, 10 mmol/L nicotinamide, 10 ng/ml human recombinant activin B, 0.1 nmol/L exendin-4, and 1 ng/ml vascular endothelial growth factor-A. Methods for generating the conditioned medium are detailed elsewhere 18.\nAdd 750 ng/ml of RSPO-1 to the medium if Dense colony formation is desired.\nIncubate the murine ECM protein culture at 37 °C and 5% CO2 for 3 weeks.\n4. Culture the Sorted Cells at 1 Cell Per Well\nNOTE: The following procedures apply to manipulating single cells using hand and mouth pipettes. An alternative approach is to purchase a micromanipulator. A typical micromanipulator includes an inverted microscope with a joystick-operated, motorized platform.\nPrepare Glass Pasteur Pipettes.\n\t\nUsing a Bunsen burner, draw out the tip of a glass Pasteur pipette to a fine point (~30 µm at the opening). The glass Pasteur pipettes should have a cotton stopper to create a barrier to the air flow from the operator.\nAutoclave the flamed glass Pasteur pipettes at 121 °C for 20 min for sterilization.\nPrepare 96-well Plates for Culture.\n\t\nPrepare cold semi-solid culture medium according to the previously described protocol 18.\nDispense the medium into the inner wells of a low-binding flat-bottom 96-well plate at 100 µl/well using a 1 ml syringe. Fill the outer wells with sterile water to maintain humidity.\nPlace the culture dish on ice until use.",
    "Prepare the Sorted Cells.\n\t\nAdd ~6,000 cells collected from a sorter to 2.5 ml final volume of DMEM/F12/PS containing 10% FCS and 1% methylcellulose in a 5 mL polystyrene tube. Shake vigorously to mix the components. Wait for 5 min or until the bubbles float to the top of the tube. This step does not need to be performed on ice.\nDispense the cell solution to two 35 mm dishes at 1 ml/dish using a 1 ml syringe with an 18 ½ G needle.\nSpread the cell solution in the dish by gently rocking the dish by hand. Do not allow the semi-solid medium to reach the margin of the 35 mm dish, as the single cells at the margin of the well cannot be observed clearly using an inverted light microscope.\nPrepare the Working Area Around a Microscope.\n\t\nMake a solution containing DMEM/F-12 medium and 1% methylcellulose without any cells ('no-cell' medium), and dispense the solution (as described in 4.3.2) into two 35 mm Petri dishes (1 ml per dish).\nClean and wipe the work area around an inverted phase-contrast microscope with a 70% alcohol solution.\nAssemble the Pipette with the Mouth Piece.\n\t\nPick a sterile glass Pasteur pipette that was prepared in step 4.1. Attach the large end of a 1 ml plastic pipette tip to the top of the glass Pasteur pipette. Attach the small end of the 1 ml plastic pipette tip to one end of a thin-walled rubber tube, and the mouthpiece to the other end of the tube. Use the same glass pipette for picking up multiple cells of the same group.\nDraw up, by mouth suction, a small volume (~10 to 50 µl) of the \"no-cell\" semi-solid solution made in step 4.4.1 with the glass Pasteur pipette.",
    "NOTE: The semi-solid solution at the narrow opening of the glass Pasteur pipette creates flow resistance and provides a barrier to prevent contamination of the cells to be picked.\nPick a Single Cell.\n\t\nPlace the 35 mm dish containing the sorted cells on the microscope stage and remove the lid.\nFind the cells using a 10X objective lens and focus on a suitable cell to be picked.\nFind and place the opening of the pipette tip next to the cell of interest. Apply suction through the mouth.\n\t\tNOTE: The motion of the cell should be quite slow, so that there is no risk of losing the cell during the process later. The motion of the cell entering the opening of the pipette should be visible. If the flow moves too fast, change to a pipette with a narrower opening.\nDeposit the Single Cell into a Culture Well.\n\t\nOnce the cell is in the pipette, use the tongue to stop the flow by blocking the opening of the mouth piece. Pause briefly before withdrawing the tip from the semi-solid medium to ensure that the semi-solid medium has stopped flowing.\nPlace the tip of the pipette into a well in the 96-well plate prepared in step 4.2. Push the cell out slowly by gently blowing into the mouth piece. Mark the well after the cell is deposited, to avoid plating two cells into a well.\nEnsure that a Single Cell is Placed in a Culture Well.\n\t\nPlace the pipette tip in the 'no-cell' medium prepared in step 4.4.1. While observing the opening of the tip under the microscope, push out the remaining semi-solid solution. Expect no cell to flow out the tip of the pipette.\nTo double check, find the location in the culture well where the single cell was implanted.",
    "Culture the single cells at 37 °C in 5% CO2 for up to 3 weeks.\n5. Pick Individual Colonies from Semi-solid Culture for Microfluidic qRT-PCR Analysis\nNOTE: Three weeks after plating sorted CD133+Sox9/EGFP+ cells into the murine ECM-containing colony assay, Ring or Dense colonies are formed 7 (Figure 2). When Ring/Dense colonies are dissociated into single cell suspension and re-plated into laminin hydrogel culture, Endocrine/Acinar colonies are generated after approximately one week 7 (Figure 2). To determine the lineage composition of each colony, microfluidic qRT-PCR analysis is used to detect the expression of lineage markers 7. For pre-amplification, a colony is mixed in a master mix containing a TaqMan probe mix, reaction buffer, and SuperScript III 21. The 48.48 array chip is subsequently used for microfluidic PCR reactions 21. \nPrepare the pre-amplification PCR mix containing 48 probes.\n\t\nPipette 1.5 µl of each TaqMan probe (20x stock) in a 1.5 ml tube. Add 78 µl of TE buffer to adjust the volume to 150 µl.\nPrepare the master mix by following protocols from the manufacturer 21.\nPlace 9 µl of master mix into each 0.2 ml thin-walled reaction tube suitable for PCR, and repeat this step for up to 48 tubes.\nPick single colonies from the semi-solid culture.\n\tNOTE: Ring/Dense colonies are larger than Endocrine/Acinar colonies, with diameters ranging from ~50 to 400 µm 9,11. Therefore, single Ring/Dense colonies are picked using a P10 pipettor outfitted with a 10 µl pipette tip that is bent into a curved shape. For picking the small Endocrine/Acinar colonies (Figure 2), refer to step 4.\n\t\nLocate a colony of interest under high magnification (e.g., 20X objective lens), reduce the magnification, and aspirate the colony. (Optional) Take a phase-contrast image of the colony at this step to document the visible characteristics of the colony.",
    "Transfer the colony into the PCR tube containing 9 µl of master mix.\nPick the next colony. Up to 45 colonies in total may be analyzed per PCR run, leaving 3 spots for controls.\nRNA extraction and cDNA synthesis with pre-amplification.\n\t\nVortex the samples vigorously before performing the thermal reaction.\nPerform the thermal cycling reactions according to the manufacturer's instructions 21. Ring/Dense colonies require 14 cycles, Endocrine/Acinar colonies require 16-20 cycles, and single cells require 22 cycles.\n\t\tNOTE: Pre-amplification cDNAs can be stored at -20 °C prior to microfluidic PCR analysis.\nRun subsequent PCR reactions, using a microfluidic chip, according to the manufacturer's instructions 21.\n6. Whole Mount Immunostaining of Colonies\nHarvest and Fix Colonies.\n\t\nPick up the colonies under the microscope, as in steps 4 or 5.4, and add them to a 4% paraformaldehyde solution. Incubate O/N at 4 °C with gentle shaking.\nWash the colonies with 1X PBS twice for 10-30 min at RT. Store the fixed colonies at 4 °C in 1.5 ml tubes sealed with paraffin.\nStain the Colonies with Antibodies.\n\t\nTransfer colonies to one well of a 96-well black plate with a clear bottom containing 200 µl of blocking buffer (5% donkey and/or goat serum, 0.1% Triton X-100 in 1x PBS). Incubate O/N at 4 °C with gentle shaking.\nDilute the primary antibody to a pre-determined concentration (e.g., 1:500 for hamster anti-Mucin 1 antibody) using blocking buffer. Transfer the colonies to a clean well with 200 µl of primary antibody, and incubate O/N at 4 °C with gentle shaking. Wash the colonies 3 times with PBS containing 0.1% Tween 20. Transfer the colonies into a new well with 200 µl of 1x PBS/0.1% Tween 20 for 10 min at RT for each wash.",
    "Dilute the secondary antibody to a pre-determined concentration (e.g., 1:2,000 for goat anti-Armenian hamster antibody) using blocking buffer. Keep the solution in the dark. Transfer the colonies to clean wells containing 200 µl of secondary antibody, and incubate for 2 hr at RT. Wash the colonies 3 times with PBS/0.1% Tween 20, as in step 6.2.2.\nCounter-stain colonies with DAPI and visualize with confocal microscopy.\n\t\nTransfer the colonies into wells with PBS containing 300 nM DAPI and incubate for 5 min at RT.\nTransfer the DAPI-stained colonies to a 35 mm glass-bottom Petri dish for visualization. Place a cover slip on top of the colonies to prevent evaporation.\nUse a confocal microscope to capture the images. To visualize DAPI staining, use two-photon excitation wavelength of 730-950 nm. Use an argon laser with a wavelength of 458 nm to excite fluorochromes with emission wavelengths of 519 and 561 nm. Use a helium-neon laser with a wavelength of 633 nm to excite fluorochromes with emission wavelengths of 665 nm.\n7. Dissociate and Re-plate Primary Ring/Dense Colonies into Secondary Colony Assays\nNOTE: All procedures should be performed under sterile conditions. Avoid cold shock to the cells in this procedure as much as possible, such as putting cells on ice or washing cells with cold PBS/BSA. Such practices reduce the viability of re-plated cells. \nPrepare Solutions.\n\t\nPre-warm wash buffer (DMEM/F12; P/S; 0.1% BSA) in a 37 °C water bath.\nPre-warm a 96-well plate (flat bottom; low binding) in a 37 °C incubator. Add 100 µl 100% FCS to one well of the plate and 100 µl 0.25% trypsin-EDTA solution to a second well.\nCollect Colonies.\n\t\nPick and pool a total of 20 or more Ring/Dense colonies in primary cultures using 10 µl pipette tips, as described in step 5.4.",
    "Place the colonies in warm (at least RT) wash buffer (~1,000 µl) in a 1.5 ml tube and spin at 400 x g for 5 min. Remove the supernatant.\nDissociate the Colonies into Single-cell Suspensions Using Trypsin.\n\t\nTransfer the remaining volume (20 µl or less), which contains the colonies, into the well that contains warm trypsin solution (prepared in 7.1).\nIncubate the plate in a 37 °C incubator (not a water bath) for 1.5 min. Remove the plate and pipette the colonies a few times. Incubate at 37 °C for another 1.5 min.\nRemove the plate and pipette up and down a few more times to break up the colonies. Check under the microscope to see whether the colonies have been dispersed predominantly into single-cell suspension. Avoid over-digestion of the colonies.\nStop the Trypsin Reaction by Adding FCS.\n\t\nTransfer 100 µl of warm FCS into the well that contains the cells. Pipette up and down a few times. Transfer the cells into a 1.5 ml tube containing 1,000 µl warm wash buffer. Centrifuge at 400 x g for 5 min at RT.\nWash twice with warm buffer.\nRe-suspend the cells in ~200 µl of buffer or culture medium.\nCount the number of cells using a hemacytometer. Keep the cell suspension at RT.\nRe-plate dissociated cells into secondary colony assays containing either murine ECM proteins (5% v/v) or laminin hydrogel (100 µg/ml) and incubate the cells at 37 °C with 5% CO2.\n\tNOTE: For re-plating cells into murine ECM proteins, use 2,500-5,000 cells per well and culture for 2-3 weeks. For re-pating into laminin hydrogel culture, use 10,000-25,000 cells per well and culture for 7-12 days.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}