{
  "id": 2900,
  "origin_website": "Cell",
  "title": "Immunofluorescence assay for demyelination, remyelination, and proliferation in an acute cuprizone mouse model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAdministration of cuprizone, tamoxifen, and EdU\nTiming: 7 weeks\nIn this step, the Gli1 expressing cells are fate-mapped by intraperitoneal administration of Tamoxifen to Gli1CreERT2;Ai9 mice and demyelination is induced 1 week later by feeding 0.2% cuprizone diet for 5 weeks. In addition, the proliferating cells are labeled by intraperitoneal administration of EdU a day prior to euthanasia.\nInject 5 mg tamoxifen per day intraperitoneally on alternate days for 4 injections (total 20 mg/mouse).\nFill the 1 mL tuberculin syringe with Tamoxifen and wipe the tip of the filled syringe with a kimwipe, before attaching a 27G needle to the syringe.\nAdminister 250 μL/day (5 mg/day) of 20 mg/mL Tamoxifen by intraperitoneal (i.p.) injection to each mouse, on alternate days, for a total of 4 i.p. injections.\nScruff the mouse and insert the needle into the lower left or right quadrant of the abdomen, perpendicular to the surface of the skin.\nAfter insertion, aspirate to check for the presence of fluid prior to injecting the drug.\nAlternate between the left and right side for i.p. injections.\nCritical: Ideally there should not be any fluid aspirate before injecting the drug. If a blood vessel is punctured by the needle, the aspirated fluid will be red blood and if the urinary bladder is punctured by the needle, the aspirated fluid will be clear or yellow urine. Injecting Tamoxifen into the bladder can lead to urinary tract inflammation and death if not treated promptly. In case fluid is aspirated, remove and discard the needle properly. Using a clean syringe, perform the i.p. injection again at a different site. If the bladder is punctured, watch for turbid white discharge from the urethra for about 2 days, which indicates a urinary tract infection.",
    "Note: The typical dose of Tamoxifen is 100 mg/kg live weight. However, we examined the recombination efficiency with i.p. injections of 1–6 mg/day tamoxifen on 4 alternate days and found that 20 mg Tamoxifen ensures recombination of the floxed allele in adult mice of C57bl/6 and swiss webster background strains with weights ranging from 20 g to 60 g, without any toxic effects on neural stem cells. We have also used this dosage in multiple CreER and floxed mouse lines.1[href=https://www.wicell.org#bib1],3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4]\nOne week after the last Tamoxifen injection, change the diet to 0.2% cuprizone pellets.\nTransfer the mice to a clean cage before starting cuprizone diet to prevent the mice from eating any leftover regular chow buried in the bedding.\nProvide the cuprizone diet and water ad libitum for 5 weeks.\nDiscard the pellets in the cage, every 2–3 days and replenish with fresh cuprizone pellets, since the drug degrades gradually with time.\nCritical: Feeding 3 g per mouse per day is sufficient to avoid discarding excessive amounts of food.\nAfter 5 weeks of cuprizone diet, change the diet to regular chow to allow for remyelination.\nNote: Analyze remyelination from 2–10 weeks after cessation of cuprizone diet.\nNote: Store the vacuum sealed bags of Cuprizone pellets at −20°C. Refrigerate the opened bag at 4°C, away from light and use within 4 weeks.\nAlternatives: Instead of the pellets, provide 0.2% Cuprizone diet in the powdered form by mixing 0.2 g of cuprizone with 99.8 g of powdered chow. For the healthy control mice, feed regular chow in the powdered form. Place the powdered diet in a feeding jar on the floor of the cage and change the diet every day to minimize consumption of food contaminated with urine and feces.\nAdminister EdU by i.p. injection, 24 h prior to euthanasia.",
    "Prepare working solution of EdU (2.5 mg/mL).\nAdminister 20 μL of 2.5 mg/mL working solution per gram body weight of mouse, or 50 mg/kg body weight, by a single i.p. injection following the precautions mentioned in step 1.\nIntracardiac perfusion and harvesting the brain\nTiming: 30 min per mouse\nIn this step, Gli1CreERT2;Ai9 mice are perfused by intracardiac administration of 4% Paraformaldehyde (PFA) and their brains are cryopreserved by embedding in OCT.\nSet up the peristaltic pump.\nConnect the scalp vein set tubing to the outlet tube of the peristaltic pump.\nInsert one tube of the pump into a container with 1× PBS (30 mL/mouse) and another tube into a container with 4% PFA solution (30 mL/mouse).\nAttach the tubing from the two containers to a 3-way stopcock.\nSet the pump speed at 8 mL/min and fill the main outlet line with 1× PBS until there is a steady stream without bubbles from the needle.\nTurn off the peristaltic pump and turn the stopcock to allow the flow of 4% PFA.\nPump 4% PFA until the fluid has reached the stopcock but not entered the main line.\nTurn off the peristaltic pump and turn the stopcock to allow the flow of 1× PBS.\nAnesthetize the mouse.\nAdminister 120 mg/kg of Fatal Plus (390 mg/mL Pentobarbitol sodium), via i.p. injection using a tuberculin syringe with 27G needle.\nCritical: Fatal-Plus is a controlled substance. A DEA license is required to purchase it.\nLay the mouse on its back on a cork board or a flat piece of styrofoam placed in a dissecting tray, after the mouse is completely unresponsive to painful stimuli, such as a sharp toe pinch, but the heart is still beating.\nPin all four limbs of the mouse to the cork board using dissection pins or needles.",
    "Expose the heart.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2407-Fig1.jpg\nFigure 1. Perfusion and brain harvest\n(A) Illustration of the incision point for creating an outlet for the blood and perfusion fluids, and the insertion point for the butterfly needle, demonstrating the position of the needle in the left ventricle.\n(B) Illustration of mouse brain harvest. Incisions for separating the skin (i-ii), and the bone (iii-vii) to expose the brain.\n(C) Examples of incompletely perfused (left) vs. completely perfused brains (right).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2407-Fig2.jpg\nFigure 2. Cryopreservation and cryosectioning\n(A) Illustration of the brain embedded in OCT in a tissue mold.\n(B) Illustration of mounting the frozen tissue block for cryosectioning coronal sections. The chuck is coated with a layer of OCT (i-ii), and the frozen tissue block firmly pressed into the OCT on the chuck (iii). Excess OCT can be carefully trimmed before sectioning (iv).\n(C) Illustration of olfactory bulb and forebrain sections (from Allen Brain Atlas) on a slide.\nIncise the skin over the abdomen and chest with a large forcep (std. pattern tissue forceps) and dissecting scissors (supercut surgical scissors).\nIncise the diaphragm with small dissecting scissors (supercut iris scissor), being careful not to puncture the beating heart.\nCut the ribcage on both sides of the sternum with a small scissor (supercut iris scissor).\nLift the sternum with a forcep (std. pattern dressing forceps) to expose the heart.\nPin the xiphoid process of the overturned sternum to the dissection board with a needle.\nIntracardiac perfusion.\nGently lift off the white membrane like thymus covering the upper part of the heart with a forcep (std. pattern dressing forceps).\nMake a nick in the right auricle which is the dark appendage attached to the right atrium, using the tip of small pointed scissors (supercut iris scissor) (Figure 1[href=https://www.wicell.org#fig1]A).",
    "Note: This allows the blood and perfusion fluids to drain into the dissection tray.\nInsert the butterfly needle, connected to the main line of the peristaltic pump, into the apex of the heart, which is formed by the left ventricle (Figure 1[href=https://www.wicell.org#fig1]A).\nTurn on the peristaltic pump and perfuse with 30 mL of 1× PBS at approximately 8 mL/min.\nSwitch the stopcock to perfuse with 30 mL of 4% PFA at the same rate.\nNote: Curling and stiffening of the tail is the earliest indication of a good perfusion. Subsequently the liver becomes pale and the body stiffens when perfused well. (See troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 1) Ideally, the lungs should not inflate and fluid should not ooze out of the nose or mouth during perfusion. (See troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 2).\nCritical: If bubbles appear in the main line, remove the needle from the heart to expel the bubble and reinsert it into the heart.\nCollect the brain.\nRemove the needle from the heart and the pins holding the mouse to the dissection board.\nCut the head at the base of the skull with large scissors (supercut surgical scissors) (Figure 1[href=https://www.wicell.org#fig1]Bi).\nRemove the skin from the dorsal side of the head (Figure 1[href=https://www.wicell.org#fig1]Bii) using a smaller pair of scissors (supercut iris scissor).\nInsert the blade of a small scissor (supercut iris scissor) through the foramen magnum and cut the skull bone laterally up to the orbit on both sides, taking care not to nick the brain (Figure 1[href=https://www.wicell.org#fig1]Biii-iv).\nMake another midline incision through the skull bone, along the sagittal suture, anteriorly past the eyes with a small scissor (supercut iris scissor) (Figure 1[href=https://www.wicell.org#fig1]Bv).",
    "Carefully remove the skull bone from around the brain using a pair of thin pointed forceps (Dumont forceps), starting by gently pulling the bone laterally, away from the midline on either side (Figure 1[href=https://www.wicell.org#fig1]Bvi-vii).\nWhen reaching the area of the skull encasing the olfactory bulbs, it may be necessary to make a few more small snips to release the olfactory bulbs.\nNote: Ensure that the olfactory bulbs are no longer attached to the bone before removing the brain.\nSeparate the brain along with the olfactory bulbs from the skull using a pair of flat forceps (flat blade membrane forceps), and drop it into a 15 mL conical tube containing 5 mL of 4% PFA.\nNote: A well-perfused brain appears pale and does not have a pinkish or red color (Figure 1[href=https://www.wicell.org#fig1]C) (See troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 3).\nIncubate the brain in 4% PFA for 4–6 h at 4°C.\nCryoprotect the brain.\nGently remove the brain from the 4% PFA solution by emptying the tube in a petri dish.\nDrop the brain into a 15 mL conical tube containing 15 mL of 30% sucrose solution using flat forceps (flat blade membrane forceps).\nNote: The brain should float to the top of the solution.\nIncubate at 4°C on a nutating mixer at 20–30 rpm, overnight for 12–16 h.\nNote: After incubation, the brain should be at the bottom of the tube due to increase in density.\nCritical: Minimize the amount of air space in the tube containing 30% sucrose to ensure that the brain remains submerged in the solution and the surface does not dry.\nPause point: Brains can be incubated in 30% sucrose solution for up to 24 h at 4°C.\nEmbed brains in OCT media and freeze.\nLabel the tissue mold and add OCT media into the mold.",
    "Remove the brain from sucrose solution by gently emptying the tube into a petri dish.\nPick the brain with flat forceps (flat blade membrane forceps) and roll it on lint free paper napkin like kimwipe to remove the excess sucrose from the surface.\nWith minimal pressure, gently lift the brain with flat forceps (flat blade membrane forceps) and place it into the mold with the ventral surface facing the bottom of the mold (Figure 2[href=https://www.wicell.org#fig2]A).\nNote: Add more OCT on top if needed, to submerge the brain completely in OCT.\nImmediately place the mold on a level surface in the −80°C freezer for at least 24 h prior to cryosectioning.\nPause point: Brains can be stored in OCT at −80°C for years.\nCryosectioning\nTiming: 3 h per brain for beginners\nIn this step, the brain is sectioned into 20 μM thick sections.\nEquilibrate the temperature of the embedded frozen brain to that of the cryostat by incubating the brain at −20°C, either in a freezer or in the cryostat, at least 1 h prior to sectioning.\nPause point: The frozen brain can be kept in a −20°C freezer for 12–16 h before sectioning.\nPlace a fresh cryostat blade, a 25 mm diameter metal specimen holder or chuck, and a brush inside the cryostat, at least 30 min prior to sectioning, to equilibrate their temperature to −20°C.\nMount the brain to the specimen holder or chuck.\nRemove the plastic mold from the embedded brain by cutting the 4 corners with a razor or a used cryostat blade.\nPour OCT medium on the pre-cooled chuck (Figure 2[href=https://www.wicell.org#fig2]Bi) inside the cryostat; quantity should be enough to cover the surface (∼500 μL) (Figure 2[href=https://www.wicell.org#fig2]Bii).\nImmediately place the embedded brain on the OCT before it freezes (Figure 2[href=https://www.wicell.org#fig2]Biii).",
    "Note: For coronal sections, position the brain so that the caudal end is facing the chuck and the rostral end is facing you. For sagittal sections, place the brain on its side.\nAllow the brain to freeze on the chuck for 10–20 min before sectioning.\nCollect 20 μM sections of the brain.\nClamp the chuck firmly into the object head of the cryostat.\nTurn on the cryostat and trim the block until the brain tissue is visible.\nTrim the excess OCT from the sides of the block with a razor or a used cryostat blade (Figure 2[href=https://www.wicell.org#fig2]Biv).\nCollect about 3–5 sections of the olfactory bulb and 8–10 sections of the forebrain, starting from the genu of the corpus callosum to the hippocampal commissure, on each slide (Figure 2[href=https://www.wicell.org#fig2]C).\nCritical: To avoid wrinkling of the tissue section, apply a drop of PBS on the slide with a brush and immediately collect the section on the PBS.\n(See troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 4).\n(See troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 5).\nNote: Use a gauze sponge dipped in PBS to remove unwanted tissue sections and OCT from the slide. To avoid detachment of the section from the slide in subsequent procedures like immunohistochemistry, prevent OCT from collecting between the tissue and the surface of the slide (Figure 2[href=https://www.wicell.org#fig2]C).\nTo dry the sections, keep the slides on a flat surface at room temperature, overnight or for 12–16 h.\nAfter drying, keep the slides in a slide storage box at −80°C.\nPause point: The cryosections on the slides can be stored at −80°C for years.\nImmunofluorescent staining and EdU labeling\nTiming: 18–22 h\nIn this step, EdU labeling is followed by immunofluorescence of the brain cryosections to examine proliferation and myelination respectively.\nEquilibrate the frozen slides to room temperature for at least 15 min.",
    "Place the slides in a moist chamber prepared with a paper towel soaked in distilled water in a tray.\nNote: Balance the slides on two rods or serological pipets glued/taped to the tray (Figure 3[href=https://www.wicell.org#fig3]A).\nDraw a line with a PAP pen along the periphery of the slide to form a hydrophobic barrier for minimizing the amount of reagents used per slide.\nNote: If needed, gently wipe the condensation on the edge of the slide without touching the cryosections, with a kimwipe before using the pap pen.\nAfter 15 min, wash the sections once with 500–800 μL 1× PBS for 5 min at room temperature (20°C–25°C).\nAfter the wash, remove the PBS either by tilting the slide to pour the liquid into the tray or aspirate the liquid with vacuum suction (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: To prevent the cryosections from lifting off the slide during suctioning, attach a 200 μL pipet tip to the tip of the glass pipette attached to the suction tube for slowing the aspiration (Figure 4[href=https://www.wicell.org#fig4]B).\nEdU labeling with Click-iT Plus EdU imaging kit.\nNote: EdU labelling kits are available for many wavelengths depending on the microscope filter or laser used for imaging. We have used the Click-iT Plus Alexa-647 kit. The following steps are modified from the manufacturer’s directions in Life Technologies MAN0009885 MP10637 Revision A.0[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/mp10637.pdf].\nAdd 500 μL of 0.5% PBS-Triton X-100 solution on each slide to permeabilize the tissue.\nIncubate for 20 min at room temperature (20°C–25°C).\nMeanwhile, prepare the 1× Click-iT EdU buffer additive and use it to prepare the Click-iT Plus reaction cocktail.\nRemove the PBS-Triton X-100 and wash the slide twice with 3% BSA-PBS solution.\nAdd 500 μL Click-iT Plus reaction cocktail to the slide and incubate for 30 min at room temperature (20°C–25°C).",
    "Note: Protect from light by covering the transparent lid of the tray with aluminum foil.\nCritical: From this point onward, protect the tissue from light in all the steps.\nRemove the Click-iT Plus reaction cocktail and wash once with 3% BSA-PBS solution for 5 min at room temperature (20°C–25°C).\nRemove the 3% BSA-PBS solution.\nWash 3 times with 500–800 μL of 1× PBS for 10 min each at room temperature (20°C–25°C) before continuing with immunofluorescence.\nImmunofluorescence.\nOptional: This step is specifically needed for immunofluorescence of Myelin Basic Protein (MBP). For all other proteins, you can start from step 19c.\nFix the tissue with methanol to enhance detection of myelin proteins by adding 500 μL of cold methanol (stored at −20°C) on each slide.\nIncubate at room temperature (20°C–25°C) for 15 min (See troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 6).\nRemove the methanol.\nWash the slide 3 times with 500–800 μL of 1× PBS per slide for 10 min/wash at room temperature (20°C–25°C).\nTo minimize non-specific binding of the primary antibody to the tissue, add 500 μL of blocking buffer per slide.\nIncubate for 45 min to 1 h at room temperature (20°C–25°C).\nRemove the blocking solution.\nAdd 500 μL of primary antibody per slide.\nNote: Dilute the primary antibody in the BSA-Triton X100 solution to obtain the desired concentration.\nIncubate with the primary antibody for 2 h at room temperature (20°C–25°C) or overnight at 4°C.\nPause point: Slides can be incubated in primary antibody for up to 24 h at 4°C.\nRemove the primary antibody.\nWash 3 times with 500–800 μL of 1× PBS per slide for 10 min/wash at room temperature.\nRemove the PBS.\nAdd 500 μL of the secondary antibody with Hoechst stain per slide.",
    "Note: Dilute the Alexafluor secondary antibodies 1:1000 fold and the Hoechst nuclear stain 1:5000 fold in the BSA-Triton X100 solution.\nIncubate with the secondary antibody plus Hoechst for 1 h at room temperature (20°C–25°C), protected from light.\nNote: We do not recommend longer incubation periods since they can result in higher background staining.\nCritical: For performing immunofluorescence without EdU labelling, the slides should be protected from light from this step onwards.\nRemove the secondary antibody.\nWash 3 times with 500–800 μL of 1× PBS per slide for 10 min/wash at room temperature (20°C–25°C).\nWash the slide once with 500–800 μL of distilled water per slide at room temperature (20°C–25°C) for 5 min.\nMount coverslips with Fluoromount G mounting media.\nGently aspirate the distilled water from around the tissue, taking care not to aspirate the tissue.\nTo avoid creating bubbles, dip a 500 μL pipet tip into Fluoromount G mounting media and add 4–5 drops of the medium on each slide by touching the pipet tip to the slide.\nGently place the coverslip on the slide by hinging it from one end (Figure 3[href=https://www.wicell.org#fig3]C).\nAllow Fluoromount G to solidify overnight or for 12–16 h in the dark at room temperature (20°C–25°C) before imaging.\nSeal the coverslips on the slides using a coverslip sealant.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2407-Fig3.jpg\nFigure 3. Immunolabeling of tissue sections\n(A) Diagram of a humidity chamber for immunolabeling tissue slides.\n(B) Tilting the slide for aspirating during washes, as well as using a 200 μL pipet tip on the end of the glass pipet attached to the suction tube to decrease the force of aspiration.\n(C) Hinging the coverslip onto the slide during mounting.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2407-Fig4.jpg\nFigure 4. Immunofluorescence and EdU labeling",
    "(A) Immunofluorescent labeling of brain cryosections from mice fed with regular diet (Reg), 0.2% cuprizone diet for 5 weeks (Cup 5wk), and 0.2% cuprizone diet for 5 weeks followed by two weeks regular diet (Cup 5wk + Reg 2wk), showing MBP in the corpus callosum (CC) outlined with white dotted lines. Scale bars = 50 μm, Subventricular zone (SVZ), Lateral ventricle (LV).\n(B) Examples of immunofluorescent labeling of CC1 expressing mature oligodendrocytes, NG2 expressing oligodendrocyte precursor cells, RFP expressing Gli1 fate mapped cells, and EdU positive proliferating cells in the CC of mice fed with regular diet, cuprizone diet for 5 weeks, and cuprizone diet for 5 weeks followed by two weeks regular diet, with quantification of CC1, NG2, and EdU positive cells in the corpus callosum. N = 3, Data = Mean ± SEM, One-way ANOVA with Tukey’s post-hoc t-test, Scale bars = 25 μm, inset scale bar = 5 μm."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Stem Cells",
    "Microscopy",
    "Cell Biology",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}