{
  "id": 5268,
  "origin_website": "Bio",
  "title": "Murine Leukemia Virus (MLV)-based Coronavirus Spike-pseudotyped  Particle Production and Infection",
  "procedures": [
    "Day 1Cell culture procedures preparations (performed each time cells and viral pseudotyped particles are manipulated) – see Note 1 for basic recommendations regarding cell culture.Pre-warm cell-culture reagents required in 37 °C water bath: DMEM-C, DPBS, trypsin. Note: This is a particularly important step since HEK-293T/17 cells are poorly adherent – see Note 2 for details. Turn on biosafety cabinet for at least 15 min before starting procedures.Disinfect all internal surfaces of biosafety cabinet (except top grills) with 70% ethanol-soaked paper towels.Cell seeding (performed in biosafety cabinet)Place an 80-90% confluent T75 flask (check by visual inspection using an inverted light microscope) containing HEK-293T/17 cells in sterilized biosafety cabinet.Wash cells twice with 10 ml of pre-warmed DPBS being careful not to dispense liquid directly on cells.Trypsinize cells with 1 ml of pre-warmed trypsin solution.Rock plate gently with hands so the trypsin solution covers the entire surface of cell monolayer.Incubate cells at 37 °C 5% CO2 incubator for 3-5 min avoiding longer incubation times. Note: It is crucial to avoid long trypsin incubation times because this typically leads to cells clumping – see Note 3. Gently tap sides of flask to detach cells.Place trypsinized flask back into biosafety cabinet.Add 4 ml of warmed DMEM-C to neutralize trypsin activity.Resuspend cells by performing repetitive up-down pipetting using a 5 ml serological pipette.Add 5 ml of DMEM-C to cells and resuspend cells again.Transfer 10 ml of cell suspension to a 50 ml Falcon tube.Vortex cells gently for 30 sec.Transfer 10 µl of cell suspension to a cell counting chamber using a P20 pipettor and appropriate tip.Count cells using the cell counting chamber under an inverted light microscope.Calculate cell density using the calculator.Add DMEM-C to obtain a final cell density of 5 x 105 cells/ml.Resuspend cells by up-down pipetting and gently vortex tube.",
    "Seed cells to wells of a 6-well plate by adding 2 ml of cells (1 million cells) per well.Gently rock plate back and forth (avoid swirling movement), sideways and diagonally.Incubate plate at 37 °C 5% CO2 incubator for 16-18 h.Day 2Transfection (performed in biosafety cabinet)Check for cell confluence using a light microscope – ideally cells should be around 40-60% confluency, see Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128233123_4588.jpgFigure 1. HEK-293T/17 cell confluency before transfection. For efficient transfection and pseudotyped particle production, HEK-293T/17 cell confluency should be around the 40-60% range as shown in the above microscopy picture taken with a Zeiss Axiovert 200 microscope. Scale bar represents 100 µm.Warm Opti-MEM in 37 °C incubator.Calculate volumes of plasmid DNA and Opti-MEM required for mix A (the quantities given for 1 well of a 6-well plate can be scaled-up or down depending on needs).For 1 well of a 6-well plate (1 µg total DNA transfected):pCMV-MLVgag-pol                                              300 ngpTG-Luc                                                              400 ngEnvelope-encoding or empty vector                   300 ngOpti-MEM                                                          to 50 µlNotes: The above DNA ratios can be optimized, if required – see Note 4.Also, this protocol is performed using a 6-well plate format. This can be scaled up or down according to experimental requirements – see Note 5.Include transfection conditions with co-transfection of pCMV-MLVgag-pol and pTG-Luc with a plasmid for positive control particles (VSV-Gpp, e.g., with pCAGGS-VSV-G) and for negative control particles (∆envpp, e.g., with pCAGGS empty vector) – see Note 6 for details on pseudotyped particle controls.Calculate volume of Lipofectamine 2000 transfection reagent required for mix B.For 1 well of a 6-well plate (1:3 ratio used, 1 µg DNA for 3 µl Lipofectamine 2000):Lipofectamine 2000                                                3 µlOpti-MEM                                                             47 µlNote: The 1:3 ratio can be optimized, if required – see Note 4.",
    "Include 2 ‘safety’ wells in volume calculations for mixes A and B of each transfection condition to avoid running out of solutions when performing the same transfection in multiple wells.Handle Lipofectamine 2000 reagent with care avoiding direct contact with plastic surfaces (tube walls) and always dispense in tubes already containing a liquid solution.Perform mix A and mix B dilutions according to calculations.Incubate at room temperature for 5 min.Use a 1:1 ratio (i.e., 50 µl each for one well to transfect) of mix A and B and mix solutions by performing multiple up-down pipetting.Incubate at room temperature for 20 min.Place plate of cells to be transfected in incubator and label wells to be transfected with name of viral enveloped used.Aspirate supernatants gently and replace with 1 ml of warmed Opti-MEM.Add 100 µl of transfection mix to each well in a drop-wise manner.Gently rock plates front and back and side to side.Incubate in 37 °C 5% CO2 incubator for 4-6 h.Pre-warm transfection DMEM (DMEM-T, no antibiotics) in 37 °C water bath. Note: DMEM-T is used here instead of DMEM-C because the transfection reagent increases cell membrane permeability, which leads to enhanced susceptibility to the cytotoxic effects of antibiotics in the cell culture medium – see Note 4. Add gently 1 ml of DMEM-T to each well.Incubate in 37 °C 5% CO2 incubator for 48 h.Day 4Harvesting (performed in biosafety cabinet)Label cryovials with name of pseudotyped virus (envelope glycoprotein used), date of harvest and initials of user.Collect supernatants in 50 ml Falcon tubes (solutions from multiple wells can be pooled if they were transfected identically).Spin tubes in centrifuge at 290 x g for 7 min.Pass pseudotyped virus solution through a 0.45 µm filter using appropriate syringe.Aliquot solution in labeled cryovials (e.g., 1 ml aliquots).",
    "Store tubes at -80 °C – see Note 7 for more details on storage.Decontaminate with 10% bleach solution all culture vessels, serological pipettes, syringes that have come into contact with pseudotyped virus solutions, with a minimum contact time of 15 min.Note: This protocol describes how to produce and use pseudotyped particles for infectivity assays. To estimate quantities of particles produced as well as incorporation of specific viral envelope glycoproteins into particles, additional experiments are required such as Western blot analyses or ELISA assays – see Note 8 for details.Cell seeding for infection (performed in biosafety cabinet)Place an 80-90% confluent T75 flask containing Huh-7 cells in biosafety cabinet.Wash cells twice with 10 ml of warmed DPBS being careful not to dispense liquid directly on cells.Trypsinize cells with 1 ml of warmed trypsin solution.Rock plate gently with hands so the trypsin solution covers the entire surface of cell monolayer.Incubate cells at 37 °C 5% CO2 incubator for 3-5 min avoiding longer incubation times. Note: It is important to avoid long trypsin incubation times because this typically leads to the clumping of cells as well as cell counting and density problems – see Note 3. Gently tap sides of flask to detach cells.Place trypsinized flask back in biosafety cabinet.Add 4 ml of warmed DMEM-C to neutralize trypsin activity.Resuspend cells by performing repetitive up-down pipetting using a 5 ml serological pipettor.Add 2-3 ml of DMEM-C to cells and resuspend cells again (adjust depending on cell confluency).Transfer cell suspension to a 50 ml Falcon tube.Vortex cells gently for around 30 sec.Transfer 10 µl of cell suspension to a cell counting chamber using a P20 pipettor and appropriate tip.Count cells using the cell counting chamber under a light microscope.Calculate cell density using a pocket calculator.",
    "Add DMEM-C to obtain a final cell density of 5 x 105 cells/ml.Resuspend cells by up-down pipetting and gently vortex tube.Seed cells to wells of a 24-well plate by adding 500 µl of cells (2.5 x 105 cells) per well using the repeater dispenser. Note: The infection is performed in a 24-well plate. This can be scaled up or down depending on experimental requirements – see Note 5 for details.Gently rock back and forth (avoid swirling movement), sideways and diagonally the plate.Incubate plate at 37 °C 5% CO2 incubator for 16-18 h.Day 5Infection (performed in biosafety cabinet)Check for Huh-7 cell confluency using light microscope (cells should be nearly confluent as shown in Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128234724_3425.jpgFigure 2. Huh-7 cell confluency before infection with pseudotyped particles. For efficient transduction by pseudotyped particles, Huh-7 cells should be almost completely confluent as shown in the above microscopy picture taken with a Zeiss Axiovert 200 microscope. Scale bar represents 100 µm.Pre-warm DPBS in 37 °C water bath.Thaw pseudotyped virus solution vials at room temperature (vials can then be kept on ice).Place the 24-well plate with Huh-7 monolayer in biosafety cabinet.Wash three times with 200 µl of warmed DPBS being careful not to dispense liquid directly on cells.Inoculate wells with 200 µl of pseudotyped virus solution.Include non-infected (n.i.) control conditions by adding 200 µl DMEM-C solution per well.Place the plate on rocker located in 37 °C 5% CO2 cell culture incubator. Note: Alternatively, cells can be placed in incubator without rocker. Incubate cells for 1-2 h.Pre-warm DMEM-C in 37 °C water bath.Add 300 µl DMEM-C using a repeater dispenser and appropriate tip.Incubate at 37 °C 5% CO2 cell culture incubator for 72 h. Note: This infection time can be optimized if required, see Note 9.",
    "Decontaminate with 10% bleach solution all culture vessels and pipette tips, that have come into contact with pseudotyped virus solutions, with a minimum contact time of 15 min.Day 8Luciferase assay (performed in biosafety cabinet until step G5)Bring luciferase assay lysis buffer (stored at -20 °C) and luciferin substrate (stored at -80 °C) at room temperature.Place plate containing infected cells in biosafety cabinet and incubate until temperature has equilibrated to room temperature.Dilute to 1x luciferase assay lysis buffer with sterile water.Aspirate gently the supernatants of cells.Add 100 µl of 1x luciferase assay lysis buffer to each well using the repeater dispenser.Incubate on rocker at room temperature for 15 min (after incubation, plate can be opened outside of biosafety cabinet).Turn GloMax 20/20 luminometer on.Prepare clear 1.5 ml Eppendorf tubes for each well to be analyzed by dispensing 20 µl of luciferin substrate solution in each tube.Add 10 µl of lysed cell supernatant to each 20 µl luciferin-containing tube, performing quick up-down pipetting and gentletube flickering immediately followed by placing the tube in tube holder found in the luminometer.Press ‘Measure Luminescence’ button on touch screen of luminometer. Record reading of relative luciferase units (RLU). Repeat measurement recording (steps G8-G11) procedure for the other wells."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}