{
  "id": 2483,
  "origin_website": "Cell",
  "title": "Protocol to examine the neural basis of symbolic and non-symbolic quantity processing in human brain with fMRI",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNumerosity comparison task\nTiming: Approximately 15 min per participant\nIn this section, we described the instructions for applying the experimental paradigm. Furthermore, we mentioned the technical prerequisites that should be checked before starting the experiment. Finally, we highlighted the key points of the experimental design for the neuroimaging phase.\nBefore starting the experiment, make sure the PC that you run the experimental task and the screen system of the scanner are connected.\nThe task is displayed on the PC running the Psychtoolbox code via MATLAB. Participants see the visual images on the MRI-compatible screen via a mirror placed in the head-coil. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nCritical: If participant cannot see the task due to a visual impairment, use MR-compatible glasses to correct refractive errors.\nGive the following instructions to the participants for the numerosity comparison paradigm (Figure 2[href=https://www.wicell.org#fig2]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1992-Fig2.jpg\nFigure 2. Numerosity comparison paradigm depicting non-symbolic and symbolic conditions\nFigure adapted with permission from (Vatansever et al., 2020[href=https://www.wicell.org#bib6]).\nYou will see a pair of stimuli composed of dot arrays or Arabic numbers which are presented simultaneously on the left and right sides of the gray screen throughout the numerosity comparison task.\nSelect the larger quantity in each pair of stimuli by pressing the button corresponding to the side on the screen.\nDesign an experiment with four scan runs, each lasting approximately 3 min 20 s.\nSet every experimental run to include 36 trials.\nSet all trials as 2 s long.\nNote: Each experimental run consists of 9 trials of each condition (symbolic and non-symbolic) as well as each difficulty level (easy and difficult) pair.",
    "Present four different trial types in a randomized order. Set the inter-trial intervals (with the presentation of a fixation cross in the center of the screen) to 2, 4, and 6 s arranged in a pseudo-randomized and logarithmic manner favoring shorter durations.\nTrain participants for behavioral paradigm by a computer before going into the scanner.\nCritical: The training session should be long enough for participant fully understand the task but not so long as to make them too familiar with it.\nImage acquisition\nTiming: Approximately 30 min per participant\nThroughout the neuroimaging session, participants lie down in the supine position in the scanner. Participants perform the numerosity comparison task during the fMRI scan. All responses are collected with a response pad positioned under participants’ right hands. The purpose of the neuroimaging session is to detect the brain activity related to symbolic and non-symbolic quantity processing. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nNote: In our original study, we used a 3-T Siemens Magnetom Trio MRI system with a 32-channel head-coil array to obtain fMRI images.\nFollowing instructions reveal how to start the scanning session.\nRegister the participant to the computer system of the scanner.\nOpen the experiment protocol.\nInform the participant that localizer acquisition is about the start and remind not to move.\nCritical: Check the localizer acquisition in the computer screen and make sure the participant's head is adjusted on the alignment of the isocenter. If there are any metallic objects left on the participant, the image will reveal defects caused by magnetic area disturbances.\nImage should be seen in three main axes (coronal, sagittal and horizontal) on the computer screen.\nBefore starting the anatomical acquisition, make sure that the slice placement is adjusted to cover the entire brain.",
    "Acquire anatomical images using T1-weighted sequence (Time to Repeat (TR): 2,600 ms, Time to Echo (TE): 3.02 ms, Field of View (FOV): 256 mm, matrix: 256 × 256 and slice thickness: 1.00 mm).\nStart the experimental paradigm.\nAcquire functional image using 46 slices with 3-mm width and a 0-mm gap (TR: 2,600 ms, TE: 28 ms, matrix: 64 × 64, FOV: 192 mm, voxel size: 3 × 3 × 3 mm).\nRepeat the functional acquisition to achieve four experimental runs.\nSave all data obtained in the experiment.\nFinish the session by moving the bed out of the scanner and slowly getting the participant up."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Neuroscience",
    "Behavior",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}