{
  "id": 19982,
  "origin_website": "Wiley",
  "title": "Determining ADCC Activity of Antibody-Based Therapeutic Molecules using Two Bioluminescent Reporter-Based Bioassays",
  "procedures": [
    "The ADCC reporter bioassay is a bioluminescent reporter-gene assay for quantifying the biological activity of the antibody via FcγRIIIa-mediated pathway activation in an ADCC mechanism of action (Cheng et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0006]; Leibson, 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0016]). The assay uses ADCC bioassay effector cells which are engineered Jurkat cells stably expressing the human FcγRIIIa receptor, V158 or F158 variants and an NFAT response element (NFAT-RE) driving the expression of firefly luciferase (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0001]). When the antibody binds to the antigens on the target cells and the FcγRIIIa receptor on the ADCC bioassay effector cells, it leads to the activation of FcγRIIIa and the subsequent luciferase activation in the ADCC bioassay effector cells.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/250fc427-36cd-4cef-8f57-8d9dacd1af03/cpz1296-fig-0001-m.jpg</p>\nFigure 1\nAssay design of ADCC reporter bioassay. ADCC, antibody-dependent cellular cytotoxicity.\nThe antibody-induced luciferase activity in the effector cell is quantified with a luminescence readout which is specific to the antibody and antigen-expressing target cells. The assay can be used to evaluate the effects of antibody glycosylation on their ADCC activity in early drug development (Chung et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0007]). In addition, it has the performance characteristics (precision, accuracy, and linearity) required for a potency assay for lot release and stability study (Parekh et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0019]; Prior et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0024]; Wege et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0034]).\nThe assay offers a simple, add-mix-read assay format. It starts by combining the target cells, antibody, and ADCC bioassay effector cells in the assay plates; after a few of hours of incubation, add the luciferase detection reagent and monitor luminescence on a luminescent plate reader. Critical assay parameters, include the effector:target (E:T) ratio, cell numbers per well, the antibody dose range, assay buffer, and incubation times. These parameters may differ based on the specific antibody and target cell pair and should be evaluated rigorously.",
    "Because the ADCC reporter bioassay produces a bioluminescent readout, the assay requires a sensitive luminescence plate reader for the detection of signal. With most luminescent plate readers we tested, an integration time of 0.5 s/well is appropriate and sufficient. The assay also requires the use of white, flat-bottom tissue-treated assay plates; clear-bottom or black-bottom assay plates do not work and should not be used.\nThe procedure described here serves as an example protocol and is designed to test two antibody samples in a single assay run. Each test antibody and a reference antibody are run in triplicate in a ten-point dilution series in a single 96-well assay plate using the same target cells. Other protocols and plate layouts are possible. The protocol needs to be adjusted and optimized for the specific antibody and target cells.\nThe general assay procedure is described in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0002]. To set up the ADCC reporter bioassay, plate the target cells into the assay plates. Next, prepare serial titrations of the antibody and add to the assay plates, followed by the addition of the ADCC bioassay effector cells. An example plate layout is shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0003]. After the addition of the assay components, transfer the assay plates to a CO2 incubator. After several hours of incubation, add the luciferase detection reagent to the assay plates and then read the plates on a luminescence plate reader. Induction time of 16-24 hr is a good start for the assay and has given optimal results for most antibodies tested.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b2abfd9e-e215-4492-b214-70a1cf453945/cpz1296-fig-0002-m.jpg</p>\nFigure 2\nSchematic protocol of ADCC reporter bioassay. ADCC, antibody-dependent cellular cytotoxicity.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0c1dc6da-6b8d-4fbe-84ff-1fc0b97f942a/cpz1296-fig-0003-m.jpg</p>\nFigure 3\nExample plate layout for ADCC reporter bioassay. ADCC, antibody-dependent cellular cytotoxicity.\nMaterials\nRPMI 1640 Medium (Corning, cat. no. 10-041-CV or Gibco, Thermo Fisher Scientific, cat. no. 22400)",
    "FBS (HyClone, cat. no. SH300070) or equivalent\nSuper low IgG FBS (HyClone, cat. no. SH30898) or equivalent\nDulbecco's phosphate-buffered saline (DPBS; Gibco, Thermo Fisher Scientific, cat. no. 14190) or equivalent\nSodium pyruvate (Gibco, Thermo Fisher Scientific, cat. no. 11360) or equivalent\nMEM nonessential amino acids (Gibco, Thermo Fisher Scientific, cat. no. 11140) or equivalent\nHygromycin (Gibco, Thermo Fisher Scientific, cat. no. 10687-010) or equivalent\nG-418 Sulfate Solution (Promega, cat. no. V8091) or equivalent\nTrypan Blue solution (MilliporeSigma, cat. no. T8154) or equivalent\nAccutase solution (MilliporeSigma, cat. no. A6964) or equivalent\nBio-Glo™ Luciferase Assay System (Promega, cat. no. G7940 or G7941)\nTest monoclonal antibody or derivative with Fc effector function (defined by user)\nADCC Reporter Bioassay, V Variant (Promega, cat. no. G7102, G7010, or G7018)\nADCC Reporter Bioassay, F Variant (Promega, cat. no. G9302, G9790, or G9798)\nTarget cells expressing target antigen recognized by mAb (defined by user)\nSterile clear 96-well, V-bottom plate with lid (Linbro, cat. no. 76-223-05) or equivalent\nWhite, flat-bottom 96-well assay plates (Corning, cat. no. 3917) or equivalent\nPipets (single channel and 12-channel)\nSterile 15- and 50-ml conical tubes\nSterile reagent reservoirs (Corning, cat. no. 4870) or equivalent\n37°C, CO2 incubator\nLuminescence plate reader: GloMax®-Multi+ Detection System (Promega, cat. no.) or equivalent\nPrepare ADCC assay buffer on the day of the assay\n1. Thaw the low lgG FBS in a 37°C water bath and add to RPMI 1640 medium to make ADCC assay buffer (RPMI 1640/0.5% low IgG FBS). Mix well and warm to 37°C prior to use. As a reference, 50 ml ADCC assay buffer is enough for 120 wells in 96-well assay format.",
    "The recommended ADCC assay buffer contains 0.5% low IgG FBS. This works well for most target cells and antibodies that we have tested. If you experience any target cell viability or assay performance issues with this assay buffer, we suggest that you test several other serum concentrations (in the range 0.5%-10%) to determine the optimal serum concentration for the specific antibody and target cells of your interests.\nPreparing and plating target cells\nFor suspension target cells\n2a. On the day of assay, remove suspension target cells from the propagation flasks and transfer to a centrifuge tube.\n3a. Count cells and evaluate cell viability using trypan blue staining.\n4a. Harvest cells by centrifugation at 130-200 × g for 10 min.\n5a. Aspirate medium, wash cell pellet with 10 ml DPBS, and centrifuge.\n6a. Resuspend cells in ADCC assay buffer (prewarmed to 37°C) and adjust volume to generate the cell density based on the desired E:T ratio you need for bioassay.\nThe recommended cell plating density for ADCC bioassay effector cells is 150,000 cells per well. You can calculate the cell density of target cells accordingly.\n7a. Transfer target cell suspension to a sterile reagent reservoir. Using a multichannel pipet, immediately add 25 μl of cells to the inner 60 wells of white 96-well assay plates.\n8a. Dispense 75 μl ADCC assay buffer into outermost wells. Place lids on plates and leave on bench while preparing antibody dilutions and ADCC bioassay effector cells.\nFor adherent target cell lines\nFor adherent cells, all steps must be performed in a sterile cell culture hood the day before the assay.\n2b. Twenty to twenty-four hours before the assay, dissociate adherent target cells from the propagation flasks with a gentle cell dissociation reagent such as Accutase.",
    "3b. Add 10-20 ml fresh culture medium to target cells and transfer to a centrifuge tube.\n4b. Count cells and evaluate cell viability using trypan blue staining.\n5b. Harvest cells by centrifugation at 130-200 × g for 5-10 min.\n6b. Resuspend cells in fresh culture medium and adjust volume to generate the cell density based on the desired E:T ratio you need for bioassay.\n7b. Transfer cells to a sterile reagent reservoir and immediately add 100 μl of cells to the inner 60 wells of white 96-well assay plates using a multichannel pipet.\n8b. Dispense 100 μl culture medium into the outermost wells. Place lids on the plates and incubate overnight in a CO2 incubator at 37°C.\n9b. After overnight incubation, take the assay plates containing adherent target cells out of the CO2 incubator and transfer to the bench top. Remove 95 μl culture medium from each of the wells. Add 25 μl per well of ADCC assay buffer (prewarmed to 37°C) to the inner 60 wells of assay plates.\n10b. Dispense 75 μl ADCC assay buffer into those outermost wells of the assay plates. Cover plates with lids and keep the plates on the bench top before adding antibody dilutions and ADCC bioassay effector cells.\nPreparing antibody serial dilutions on the day of assay\nTo establish a full dose-response range for the test antibody in the ADCC reporter bioassay, it is important to determine the starting concentration and serial dilution scheme optimal for the antibody based on previous test results. As a reference, when tested in the ADCC reporter bioassay, the starting concentrations and serial dilution schemes are 1 × 10-6 g/ml, four-fold serial dilution for rituximab, and 1 × 10-6 g/ml, three-fold serial dilution for trastuzumab. These provide full dose-response curves in both cases.",
    "11. In a clear V-bottom 96-well plate or 12-well dilution reservoir, prepare ten-point antibody serial dilutions in assay buffer for reference and test antibodies.\n12. Prepare enough antibody to plate 25 μl per well, in triplicate, at each dose.\n13. Hold antibody serial dilution preparation on the bench top until step 21.\nPreparing ADCC bioassay effector cells\n14. Prepare ADCC bioassay effector cells for use in the assay according to the manufacturer's recommendation (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-tbl-0001]). Use cells in assay only after cell growth rate during propagation has stabilized and cell viability is >95%.\nTable 1.\n                Components of Cell Culture Medium for ADCC Bioassay Effector Cells\ntable:\n﻿Component,Final concentration\nRPMI 1640 medium,90%\nFBS,10%\nSodium pyruvate,1 mM\nMEM nonessential amino acids,0.1 mM\nHygromycin,100 μg/ml\nG-418,250 μg/ml\n15. Transfer ADCC bioassay effector cells from the cell culture vessels to a centrifuge tube.\n16. Count cells and determine cell density and viability using trypan blue staining.\n17. Pellet cells by centrifuge at 130 × g for 10 min at ambient temperature; aspirate medium and resuspend cells with 10 ml of 1× DPBS.\n18. Pool cells to one centrifuge tube if needed; centrifuge at 130 × g for 10 min.\n19. Resuspend cells in ADCC assay buffer to make a final cell suspension at a density of 6 × 106 cells/ml.\n20. Hold the ADCC bioassay effector cells at room temperature until next step.\nAdding antibody and ADCC bioassay effector cells to the assay plates containing target cells\n21. Using a multichannel pipet, add 25 μl per well of the antibody dilution series from the antibody dilution plates to the white, 96-well assay plates already containing target cells.",
    "22. Transfer the ADCC bioassay effector cells to a sterile reagent reservoir. Using a multichannel pipet, plate 25 μl of ADCC bioassay effector cells to those wells in the assay plate already containing target cells and antibody to yield 150,000 ADCC bioassay effector cells per well.\n23. Cover assay plate with a lid and incubate plate in a 37°C, CO2 tissue culture incubator for 16-24 hr.\nPreparing and adding Bio-Glo™ luciferase assay reagent\n24. Prepare an appropriate amount of Bio-Glo™ luciferase assay reagent according to the manufacturer's instructions. It can be prepared on the day of assay for same day use or prepared and frozen in aliquots for future use. Thaw Bio-Glo™ luciferase assay buffer in a room-temperature water bath, protected from light. Once thawed, transfer buffer into the amber bottle containing the substrate, and mix by gentle inversion until the substrate is thoroughly dissolved. For reference, 10 ml of Bio-Glo™ luciferase assay reagent is enough for 120 assay wells in a 96-well assay format.\nFor large size Bio-Glo™ reagent, make 10 ml aliquots of reconstituted Bio-Glo™ luciferase assay reagent and store at –20°C for up to 6 weeks. Avoid frequent freeze-thaw cycles. Approximate stability of Bio-Glo™ luciferase assay reagent after reconstitution: 18% loss of luminescence over 24 hr at ambient temperature.\n25. After 16-24 hr incubation, remove assay plates from the 37°C incubator and equilibrate to ambient temperature (22°-25°C) on the bench for 5-15 min.\n26. Using a manual multichannel pipet, add 75 μl Bio-Glo™ luciferase assay reagent to all the inner 60 wells of the assay plates; avoid creating any bubbles.\n27. Add 75 μl of Bio-Glo™ luciferase assay reagent to wells B1, C1, and D1 in the assay plate to determine plate background.\n28. Incubate at ambient temperature for 5-30 min.",
    "29. Read assay plates and measure luminescence on a luminescence plate reader.\nData analysis\n30. Calculate Fold of Induction = RLUinduced – background/RLUno antibody control – background\nWhere RLU is defined as relative luminescence unit.\nWhen calculating Fold of Induction, if the sample RLUs are ≥100 times the plate background RLU, there is no need to subtract plate background from sample RLU.\n31. Graph data as RLU versus log10 [antibody] and Fold of Induction versus log10 [antibody]. Fit curves and determine EC50 of antibody response using appropriate curve fitting software (such as GraphPad Prism® software).\n32. The representative data are shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0004] and Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0005].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ba199322-ccd0-4a3b-88b2-b2b0e47796ac/cpz1296-fig-0004-m.jpg</p>\nFigure 4\nRepresentative data of ADCC reporter bioassay for anti-CD20 antibody rituximab. WIL2-S cells were plated in a 96-well white assay plate, followed by addition of a serial titration of rituximab. ADCC bioassay effector cells (150,000 cells per well) were then added to the assay plate. The E:T ratio is 6:1. After 20 hr of induction at 37°C, Bio-Glo™ luciferase assay reagent was added and luminescence was determined using a GloMax®-Multi+ luminometer. The data were fitted to a four parameter logistic curve using GraphPad Prism® software. ADCC, antibody-dependent cellular cytotoxicity.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/67bfa9f2-09b5-4e4f-b946-5457d3ec5b74/cpz1296-fig-0005-m.jpg</p>\nFigure 5",
    "Representative data of ADCC reporter bioassay for anti-HER2 antibody trastuzumab. SK-BR-3 cells were plated in 96-well assay plate the day before assay. On the day of assay, the culture medium was replaced with assay buffer and a serial titration of trastuzumab. ADCC bioassay effector cells (150,000 cells per well) were then added to the assay plate. The E:T ratio is 15:1. After 20 hr of induction at 37°C, Bio-Glo™ luciferase assay reagent was added and luminescence was determined using a GloMax®-Multi+ luminometer. The data were fitted to a four parameter logistic curve using GraphPad Prism® software. ADCC, antibody-dependent cellular cytotoxicity.",
    "The PBMC ADCC bioassay is a bioluminescent assay for quantitatively measuring the ADCC activity of monoclonal antibodies. The assay uses primary PBMC as effector cells and engineered target cells expressing HiBiT (Pinto et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0022]). HiBiT is an 11-amino-acid peptide tag and has high binding affinity to Large BiT (LgBiT) to form functional NanoBiT luciferase and it can be fused to a house-keeping protein or a small peptide (Dixon et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-bib-0009]). When ADCC occurs, the HiBiT expressed in the target cells is released into the medium after target cell lysis. HiBiT then binds to LgBiT in the detection reagent to form a functional NanoBiT luciferase enzyme and emits luminescence in the presence of the substrate furimazine (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5561181c-4019-47d6-9aa0-4a9e9836b3cb/cpz1296-fig-0006-m.jpg</p>\nFigure 6\nAssay design of PBMC ADCC bioassay. PBMC, peripheral blood mononuclear cells; ADCC, antibody-dependent cellular cytotoxicity.\nThe bioassay combines the primary PBMC, antibody, and HiBiT target cells in the assay plates and offers a simple, add-mix-read assay format. The critical assay parameters include the E:T ratio, cell numbers per well for both target and effector cells, the antibody dose range, assay buffer, and incubation time. They should be evaluated rigorously and final conditions should be selected based on assay performance for the specific antibody and target cell pair.\nThe bioassay requires a sensitive luminescence plate reader for the detection of the luminescence signal. With most luminescent plate readers we tested, an integration time of 0.5 s/well is appropriate and sufficient. The bioassay also requires the use of white, U-bottom or V-bottom assay plates.",
    "The protocol provided below shows how the PBMC, ADCC qualified, can be used with suspension or adherent HiBiT target cells in the PBMC ADCC bioassay. The procedure serves as an example protocol and is designed to test two antibody samples in a single assay run. Each test antibody and a reference antibody are run in triplicate in ten-point dilution series in a 96-well assay plate using the same target cells. Other protocols and plate layouts are possible and may need to be optimized for the specific antibody and target cells of your interests.\nThe general assay procedure is described in Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0007]. The PBMC, ADCC qualified, are supplied in a frozen, ready-to-use format. When they are used in the assay, we recommend plating them in PBMC recovery medium overnight before using them in the assay as described in the current protocol. Alternatively, fresh PBMC isolated from donor blood can be used and plated into assay plates on the day of assay. To set up the PBMC ADCC bioassay, plate the target cells into the assay plates first. Next, add the serial titration of the antibody to the assay plates followed by the addition of the primary PBMC. An example plate layout is shown in Figure 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0008]. Once the assay plates are set up, transfer the assay plates to a CO2 incubator. After several hours of incubation, add Nano-Glo™ HiBiT extracellular detection reagent to the assay plates and read plates in a luminescence plate reader. Induction time of 4 to 5 hr is a good start for the assay and has given optimal results for most antibodies tested. You can vary the induction time in a range of 4 to 24 hr to determine the optimal induction time for your antibody.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7c84e905-89c7-4f5b-b773-79ee6c9204d6/cpz1296-fig-0007-m.jpg</p>\nFigure 7",
    "Schematic protocol of PBMC ADCC bioassay. PBMC, peripheral blood mononuclear cells; ADCC, antibody-dependent cellular cytotoxicity.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/111f4392-b496-4ea6-88c6-17996020df72/cpz1296-fig-0008-m.jpg</p>\nFigure 8\nExample plate layout for PBMC ADCC bioassay. PBMC, peripheral blood mononuclear cells; ADCC, antibody-dependent cellular cytotoxicity.\nMaterials\nPBMC recovery medium (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-tbl-0002])\nRPMI 1640 Medium (Corning, cat. no. 10-041-CV or Gibco, Thermo Fisher Scientific, cat. no. 22400)\nHeat-inactivated FBS (Gibco, Thermo Fisher Scientific, cat. no. 16140) or equivalent\nTrypan Blue solution (MilliporeSigma, cat. no. T8154) or equivalent\nAccutase solution (MilliporeSigma, cat. no. A6964) or equivalent\nSodium pyruvate (Gibco, Thermo Fisher Scientific, cat. no. 11360) or equivalent\n2-Mercaptoethanol, 1,000× (Gibco, Thermo Fisher Scientific, cat. no. 21985)\nIL-2 (MilliporeSigma, cat. no. I2644)\nDigitonin (MilliporeSigma, cat. no. D141)\nNano-Glo HiBiT Extracellular Detection System (Promega, cat. no. N2420; N2421; N2422)\nMonoclonal antibody or derivative with Fc effector function\nHuman PBMC, ADCC qualified (Promega, cat. no. CS3055A15, CS3055A18)\nUser-defined target cells expressing target antigen and HiBiT\nTable 2.\n                Components of PBMC Recovery Medium\ntable:\n﻿Component,Final concentration\nRPMI 1640 medium,90%\nHeat-inactivated FBS,10%\nSodium pyruvate (100×),1×\n\"2-Mercaptoethanol (1,000×) 55 mM\",1×\nIL-2 (100 μg/ml),5 ng/ml\nWhite, U-bottom, 96-well plates (Costar, cat. no. 3355)\nClear, 96-well plate lids (Costar, cat. no. 3098)\nClear, V-bottom 96-well plates (Costar, cat. no. 3896) for low volume antibody dilution (100-300 µl)\nDilution reservoirs with lid (Dilux, cat. no. D-1002) for high volume antibody dilution (300 µl-5 ml)\n56°C water bath (to heat-inactivate FBS if starting with non-heat inactivated FBS)\nPipets (single channel and 12-channel)\nSterile 15- and 50-ml conical tubes\n37°C, CO2 incubator\n37°C water bath\nLuminescence plate reader (GloMax®-Multi+ Detection System; Promega) or equivalent\nThe day prior to the assay, prepare human PBMC, ADCC qualified, in a cell culture hood.",
    "1. Prepare PBMC recovery medium according to Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-tbl-0002] and prewarm to 37°C; 25 ml PBMC recovery medium is sufficient for one vial of human PBMC, ADCC qualified.\n2. Transfer one vial of PBMC from storage at –140°C to the bench on dry ice. Thaw the vial in a 37°C water bath with gentle agitation (no inversion) until just thawed (2-3 min).\n3. Gently mix cell suspension by pipetting and transfer all cells (∼1 ml) to a 50-ml conical tube containing 25 ml prewarmed PBMC recovery medium.\n4. Using a 25-ml pipet, gently mix cell suspension and transfer it to a T75 tissue culture flask.\n5. Place the flask horizontally in a 37°C, 5% CO2 humidified incubator.\nDo not wash, centrifuge, or count PBMC cells on Day 1.\n6. Incubate PBMC cells for 16-24 hr until assay setup on Day 2.\nOn the day of assay\n7. On the day of assay, prepare the appropriate amount of assay buffer according to Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-tbl-0003]; 75 ml assay buffer is sufficient for two assay plates in 96-well format.\nTable 3.\n                Components of Assay Buffer for PBMC ADCC Assay\ntable:\n﻿Component,Final concentration\nRPMI 1640 medium,95%\nHeat-inactivated FBS,5%\n\"2-Mercaptoethanol (1,000×) 55 mM\",1×\nIL-2 (100 μg/ml),5 ng/ml\n8. Prepare digitonin for maximum release control:\n         \nDilute digitonin stock in assay buffer to 300 μg/ml (3× concentration).\nPrepare 100 μl for each antibody to be tested.\nHold the digitonin dilution preparation at room temperature.\nPreparing antibody serial dilutions",
    "In order to establish a full dose-response range for the test antibody in the PBMC ADCC assay, it is important to determine the starting concentration and serial dilution scheme optimal for the antibody based on previous test results. As a reference, when tested in the PBMC ADCC assay, the starting concentrations and serial dilution schemes are 1 × 10-6 g/ml, three-fold serial dilution for rituximab and cetuximab. These provide full dose-response curves in both cases.\n9. In a clear V-bottom 96-well plate or 12-well dilution reservoir, prepare antibody serial dilutions in assay buffer for reference and test antibodies.\n10. Prepare enough antibody to plate 25 μl per well at each dose.\n11. Hold the antibody serial dilution preparation in a 37°C, 5% CO2 humidified incubator until step 27.\nPreparing target cells\nFor suspension HiBiT target cells\n12a. On the day of assay, remove suspension HiBiT target cells from the propagation flasks and transfer to a centrifuge tube.\n13a. Count cells and evaluate cell viability using trypan blue staining.\n14a. Harvest target cells by centrifugation at 150-200 × g for 5 min.\n15a. Remove medium and resuspend cells in 10 ml prewarmed assay buffer.\n16a. Harvest cells by centrifugation at 150-200 × g for 5-10 min.\n17a. Repeat step 15a and 16a for a second wash: Remove supernatant and resuspend cells in 10 ml prewarmed assay buffer; harvest cells by centrifugation at 150-200 × g for 5-10 min.\n18a. Remove medium and resuspend cells in prewarmed assay buffer to make a cell suspension of 2 × 105 cells/ml.\n19a. Hold HiBiT target cell suspension at 37°C.\nFor adherent HiBiT target cell lines\n12b. On the day of assay, dissociate adherent HiBiT target cells from the propagation flasks using a gentle cell dissociation reagent such as Accutase.",
    "13b. Resuspend cells in 10 ml prewarmed assay buffer.\n14b. Count cells and evaluate cell viability using trypan blue staining.\n15b. Harvest target cells by centrifugation at 150-200 × g for 5 min.\n16b. Remove medium and resuspend cells in 10 ml prewarmed assay buffer.\n17b. Harvest target cells by centrifugation at 150-200 × g for 5 min.\n18b. Repeat step 16b and 17b for second wash: Remove supernatant and resuspend cells in 10 ml prewarmed assay buffer; harvest target cells by centrifugation at 150-200 × g for 5 min.\n19b. Remove supernatant and resuspend cells in prewarmed assay buffer to make a cell suspension of 1 × 105 cells/ml.\n20b. Hold HiBiT target cell suspension at 37°C.\nPreparing human PBMC, ADCC qualified\n21. Remove PBMC from the CO2 incubator, gently resuspend cells, and transfer all cells (∼25 ml) to a 50-ml conical tube.\n22. Harvest PBMC by centrifugation at 300 × g for 5 min at room temperature.\n23. Remove supernatant and resuspend PBMC in 4 ml assay buffer.\nThis results in a cell density ∼5 × 106 PBMC/ml or 125,000 PBMC/well in assay plates when added to assay plates according to the instructions in this protocol.\n24. Proceed to assay plate setup: Add HiBiT target cells, antibody, and PBMC into assay plates.\nOnly use white, U-bottom or V-bottom assay plates. If white U- or V-bottom plates are not available, the assay may be run by adding PBMC, antibody and HiBiT target cells in clear U- or V-bottom plates for incubation. At the end of the 5-hr incubation, carefully transfer approximately half of supernatant to a white flat-bottom plate and then add an equal volume of detection reagent before reading the plates.\n25. Gently mix HiBiT target cell suspension and transfer to a sterile reagent reservoir.",
    "26. Using a multichannel pipet, dispense 25 μl per well to all assay wells.\nWhen diluted and plated as instructed, this results in an E:T ratio of 25:1 when suspension target cells are used and an E:T ratio of 50:1 when adherent target cells are used.\n27. Using a multichannel pipet, dispense 25 µl per well of antibody dilutions to the inner 60 assay wells only.\n28. Gently mix PBMC cell suspension and transfer to a sterile reagent reservoir.\n29. Using a multichannel pipet, dispense 25 μl per well to all assay wells.\nWhen diluted as instructed, this results in roughly 125,000 PBMC per well.\n30. Using a single channel pipet, add 25 µl per well of 3× digitonin to digitonin wells only.\n31. Using a multichannel pipet, add 75 μl per well of prewarmed assay buffer to the rest of empty wells.\n32. Cover assay plates with lids and incubate in a 37°C, 5% CO2 humidified incubator for 5 hr.\nAdd Nano-Glo™ HiBiT extracellular detection reagent\nStore Nano-Glo™ HiBiT extracellular buffer at -20°C; thaw overnight at 4°C and warm to room temperature during assay period. Store Nano-Glo™ HiBiT extracellular substrate and LgBiT protein at -20°C.\nPrepare Nano-Glo™ HiBiT extracellular reagent ∼30 min before the end of assay incubation; prepare enough reagent for the assay of the day based on the guidelines in Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-tbl-0004], then return all remaining components to their appropriate storage temperatures.\nThe reconstituted Nano-Glo™ HiBiT Extracellular Reagent (mixture of buffer, substrate, and LgBiT protein) should be stored at room temperature prior to the addition to the assay plate. Do not freeze/thaw.\nTable 4.\n                Guidelines for the Quantities of Nano-Glo® HiBiT Extracellular Reagent\ntable:\n﻿Number of assay plates run in the same day,Nano-Glo™ HiBiT extracellular buffer,LgBiT™ protein,Nano-Glo™ HiBiT extracellular substrate\n1 plate (66 wells),1 bottle,0.1 ml,0.2 ml",
    "2 plates (132 wells),1 bottle,0.1 ml,0.2 ml\n3 plates (198 wells),2 bottles,0.2 ml,0.4 ml\n4 plates (264 wells),2 bottles,0.2 ml,0.4 ml\n33. Near the end of the 5-hr incubation, prepare Nano-Glo™ HiBiT Extracellular Reagent. For reference, one kit of Nano-Glo™ HiBiT extracellular reagent (10 ml, cat. no. N2420) is sufficient for 132 assay wells.\n         \nAdd 0.1 ml LgBiT protein and 0.2 ml Nano-Glo™ HiBiT extracellular substrate to one bottle of Nano-Glo™ HiBiT extracellular buffer (∼10-11 ml).\nMix by inverting several times.\nStore the Nano-Glo™ HiBiT extracellular reagent at room temperature protected from bright light for same day use.\n34. After 5 hr of incubation, remove assay plates from the CO2 incubator and allow plates to equilibrate to room temperature for 5-15 min on the bench.\n35. Transfer Nano-Glo™ HiBiT extracellular reagent to a reagent reservoir.\n36. Using a multichannel pipet, add 70 µl per well of Nano-Glo™ HiBiT reagent to assay wells B2-G12.\n37. Incubate plates at room temperature for 5-10 min, protected from bright light.\n38. Read plate and measure luminescence in a luminescence plate reader.\nData analysis\n39. The spontaneous release values (untreated control) are generated from the wells containing PBMC and HiBiT target cells only, no antibody; the maximum release values are generated from the wells containing PBMC, HiBiT target cells, and digitonin.\n40. Calculate Fold Induction = RLUtreated/RLUuntreated control.\n41. Calculate % Specific Lysis = [(RLUtreated – RLUuntreated control)/(RLUdigitonin – RLUuntreated control)] × 100.\n42. Graph data as RLU versus log10 [antibody], Fold of Induction versus log10 [antibody], and % Specific Lysis versus log10 [antibody]. Fit curves and determine EC50 of antibody response using appropriate curve fitting software (such as GraphPad Prism® software).\n43. The representative data is shown in Figure 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0009] and Figure 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.296#cpz1296-fig-0010].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c335f0b3-4133-4113-9b49-5f50a8732970/cpz1296-fig-0009-m.jpg</p>\nFigure 9",
    "Representative data for PBMC ADCC assay for anti-CD20 antibody rituximab. Ramos/HaloTag-HiBiT target cells were plated in 96-well assay plate at 5,000 cells per well, followed by addition of a serial titration of rituximab. Primary PBMC (125,000 cells per well) were then added to the assay plate. The E:T ratio is 25:1. After 5 hr of induction at 37°C, Nano-Glo™ HiBiT extracellular reagent was added and luminescence was determined using a GloMax®-Multi+ luminometer. The data were fitted to a four parameter logistic curve using GraphPad Prism® software. PBMC, peripheral blood mononuclear cells; ADCC, antibody-dependent cellular cytotoxicity.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/cdf78c13-4600-47fa-a92c-72acacb1e7b7/cpz1296-fig-0010-m.jpg</p>\nFigure 10\nRepresentative data for PBMC ADCC assay for anti-EGFR antibody cetuximab. A549/HaloTag-HiBiT target cells were plated in 96-well assay plate at 2,500 cells per well, followed by addition of a series dilution of cetuximab. Primary PBMC (125,000 cells per well) were then added to the assay plate. The E:T ratio is 50:1. After 5 hr of induction at 37°C, Nano-Glo™ HiBiT extracellular reagent was added and luminescence was determined using a GloMax®-Multi+ luminometer. The data were fitted to a four parameter logistic curve using GraphPad Prism® software. PBMC, peripheral blood mononuclear cells; ADCC, antibody-dependent cellular cytotoxicity."
  ],
  "subjectAreas": [
    "Protein Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}