{
  "id": 8739,
  "origin_website": "Jove",
  "title": "Healthy Brain-pituitary Slices for Electrophysiological Investigations of Pituitary Cells in Teleost Fish",
  "procedures": [
    "All animal handling was performed according to the recommendations for the care and welfare of research animals at the Norwegian University of Life Sciences, and under the supervision of authorized investigators.\n1. Preparation of Instruments and Solutions\nNOTE: All solutions should be sterile. Careful attention should be given to the pH and the osmolality (osmol/kg water) of all solutions, which should be carefully adapted to the extracellular environment of the studied species. pH and osmolality should be adjusted with precise electronic equipment such as pH meter and freezing point osmometer respectively.\nMake 500 mL of extra-cellular solution without Ca2+ (Ca2+ free EC): 150 mM NaCl, 5 mM KCl, 1.3 mM MgCl2, 4 mM glucose, 10 mM Hepes.\nDissolve 4.38 g of NaCl, 186.37 mg of KCl, 61.89 mg of MgCl2, 360.32 mg of Glucose and 1.19 g of HEPES in 450 mL of ultrapure (0.055 uS/cm at 25 °C, the resistivity of 18.2 MOhm) H2O in a glass beaker using a magnetic agitator.\nAdjust the pH to 7.75 with NaOH.\nTransfer the solution into a 500 mL volumetric flask. Fill the volumetric flask with ultrapure H2O until 500 mL.\nMix the solution well before measuring the osmolality. Adjust to 290–300 mOsm with mannitol. Filter sterilize the solution using water vacuum system and 0.2 µm filter.\nMake 500 mL of extra-cellular solution (EC): 150 mM NaCl, 5 mM KCl, 2 mM CaCl2, 1.3 mM MgCl2, 4 mM glucose, 10 mM Hepes.\nDissolve 4.38 g of NaCl, 186.37 mg of KCl, 147.01 mg of CaCl2, 61.89 mg of MgCl2, 360.32 mg of Glucose and 1.19 g of HEPES in 450 mL of ultrapure H2O in a glass beaker using a magnetic agitator.\nAdjust the pH to 7.75 with NaOH.",
    "Transfer the solution into a 500 mL volumetric flask. Fill the volumetric flask with ultrapure H2O until 500 mL.\nMix the solution well before measuring the osmolality. Adjust to 290–300 mOsm with mannitol. Filter sterilize the solution using water vacuum system and 0.2 µm filter.\nMake 500 mL of extra-cellular solution with 0.1% bovine serum albumin (EC with BSA): 150 mM NaCl, 5 mM KCl, 2 mM CaCl2, 1.3 mM MgCl2, 4 mM glucose, 10 mM Hepes.\nDissolve 4.38 g of NaCl, 186.37 mg of KCl, 147.01 mg of CaCl2, 61.89 mg of MgCl2, 360.32 mg of Glucose and 1.19 g of HEPES in 450 mL of ultrapure H2O in a glass beaker using a magnetic agitator.\nAdjust the pH to 7.75 with NaOH.\nTransfer the solution into a 500 mL volumetric flask. Fill the volumetric flask with ultrapure H2O until 500 mL.\nMix the solution well before measuring the osmolality. Adjust to 290–300 mOsm with mannitol. Filter sterilize the solution using water vacuum system and 0.2 µm filter. Add 50 mg BSA.\nMake 250 mL of intracellular solution (IC): 110 mM KOH, 20 mM KCl, 10 mM Hepes, 20 mM sucrose.\nDissolve 1.54 g KOH, 327.75 mg of KCl, 595.75 mg of HEPES and 1.712 g of sucrose in 450 mL of ultrapure H2O in a glass beaker using a magnetic agitator.\nAdjust the pH to 7.2 with (N-morpholino) ethane sulfonic (MES) acid.\nTransfer the solution into a 250 mL volumetric flask. Fill the volumetric flask with ultrapure H2O until 250 mL.\nMix the solution well before measuring the osmolality. Adjust to 280–290 mOsm (10 mOsm lower than EC) with sucrose. Filter sterilize the solution using water vacuum system and 0.2 µm filter.",
    "Make 100 mL of 2% low melting agarose solution in Ca2+ and BSA free EC (2 g of low melting agarose in 100 mL of Ca2+ free EC). Dissolve using a microwave and place the melted agarose in a water bath at 40 °C. Let it cool down until it reaches 40 °C before use on the tissues.\n\tNOTE: EC, Ca2+ free EC may be stored at 4 °C for several weeks if sterile and IC solutions at -20 °C, for several months. Agarose can be stored for a week at 4 °C and can be reused 3–5 times by briefly microwaving. Excessive reuse will lead to evaporation and alteration of agarose and salt concentration and quality.\nMake agar bridge:\nHeat 7.5 mm long borosilicate glass capillaries with outside diameter (O.D.) 2 mm and inside diameter (I.D.) 1.16 mm using a Bunsen burner at a focal point about 1/3 from one end until the glass starts to bend. Remove the glass from the flame and allow the glass to bend with an angle of about 120 degrees (Figure 2A).\nMelt 2% agar in normal EC without glucose using a microwave, and while the agarose is liquid fill the pre-made glass capillary using capillarity forces by putting one of the ends of the glass into the liquid and waiting for few minutes. Store bridges until use at 4 °C in EC without glucose.\nPrepare borosilicate glass with filament patch pipettes using a suitable pipette puller. Refer to the pipette puller manual to obtain the desired electrode resistance.\n\t​NOTE: The taper of the pipette should be as short as possible. Short pipette taper is achieved by using 4–6 pulling steps. The electrode resistance should be between 2 and 6 MΩ depending on cell size.",
    "To avoid movement of tissue during the patch-clamp experiments coat the surface of the recording chamber with 0.1% of polyethylenimine (PEI) in borate buffer.\nPrepare 500 mL of borate buffer (25 mM):\n\t\t\nDissolve 4.768 g of Na2B4O7/10H2O in 450 mL of ultrapure H2O in a glass beaker using a magnetic agitator.\nAdjust pH to 8.4 with HCl.\nTransfer the solution into a 500 mL volumetric flask. Fill the volumetric flask with ultrapure H2O until 500 mL and 0.2 µm filter sterilize the solution using water vacuum system.\nPrepare a 1% stock solution of PEI (1 mL 50% PEI to 49 mL 25 mM borate buffer) and a 0.1% PEI dilution by diluting 10 µL of 1% stock solution in 100 µL of borate buffer for final use.\nAdd 2 mL of 0.1% PEI on the glass of the slice holder and let the coating incubate for 1 minute. Then briefly wash the glass twice with 5 mL of ultrapure H2O and let air dry until use.\nPrepare amphotericin B solutions.\nMake 60 mg/mL stock solution by dissolving 3 mg of amphotericin B powder in 50 µL dimethyl sulfoxide (DMSO), in a 1 mL tube protected from light. Vortex at the maximum speed for 30 s and sonicate for 15 min to homogenize. Store aliquots into 3–5 tubes at -20 °C and use one aliquot per day.\n\t\tNOTE: If the amphotericin B stock solution is not clear and yellow color but milky (still yellow) after 15–20 min sonication make a new stock solution.",
    "Make IC solution with amphotericin B by pipetting 2 mL of the IC into a clean glass beaker with more than 10 mL capacity. Add 8 µL of amphotericin B stock solution into the pipette solution and mix by pipetting. Wrap the beaker with aluminum foil and place on ice until use and renew it every 3 h.\n2. Dissection and Slicing with Vibratome\nPrepare the dissection tools before dissecting, including one sharp and one strong forceps with scissors. Clean the tools (tissue holder, brush, forceps) with ethanol and make sure that they are used only for dissection purposes and never in contact with fixed tissues. Keep them in a separate box to avoid contamination.\nEuthanize the fish in cold ice water for 1 min.\nFollow the subsequent steps to quickly dissect the medaka brain and pituitary with sharp forceps (use no more than 3 min).\nWhile holding the fish with the strong forceps severe the two optic nerves behind the eyes with scissors or sharp forceps.\nOpen the dorsal part of the skull from the posterior to the anterior side by breaking the skull bones step by step with strong forceps.\nPeel off the skull on one side with strong forceps.\nSevere the spinal cord with scissors or sharp forceps.\nGently, grab the spinal cord with the forceps, flip the brain from posterior to anterior and place it into a dish with the ice-cold Ca2+ free EC.\nFill a 1.5–2 cm3 metal mold with liquid agarose and place it on the ice.",
    "Just before the agarose solidifies (at around 25–30 °C), gently grab the brain by the spinal cord with the forceps, dry the forceps with a piece of fine paper and put the tissue into the agarose. Quickly mix the agarose to dilute the traces of EC left around the tissue and orientate the tissue and let the mold on ice for a few seconds until the agarose hardens.\n\tNOTE: It is essential for this step to be fast. The agarose solidifies quickly as the metal mold is cooled down by the ice.\nTrim a square block of agarose containing the tissue with a scalpel blade and glue it on the vibratome specimen holder using surgery (non-toxic) glue.\nFill the cuvette of the vibratome receiving the specimen (brain-pituitary) holder with ice-cold Ca2+ free EC.\nPlace the specimen holder into the vibratome and cut the agarose block to make parasagittal sections of 150 µm, using high frequency and the low speed for the sectioning. Collect the selected sections and place them into the patch-clamp recording chamber with 3 mL of ice-cold Ca2+ free EC.\nPlace the grid harp (Figure 2B) on the tissue section.\n\tNOTE: The harp will together with the coating stabilize the tissue and prevent it from moving during the patch-clamp recordings.\nAfter the harp is in place, change the Ca2+ free EC medium to the normal EC with Ca2+ and BSA. Let the tissue rest for 10 min.\n3. Perforated Patch-clamp and Electrophysiological Recordings\nBefore starting the experiment, chloride the silver wire electrodes by the following steps: First, use a fine sandpaper (p180) to clean the silver wire electrodes. Second, rinse with 2 mL, 70% ethanol. Third, dip the wires in 2 mL, 2–5% chlorine for 10 min. Finally, rinse with 2 mL, ultrapure H2O.",
    "Place the recording chamber with the brain-pituitary slice in the microscope stage and locate the target area (pituitary) using 10X objective and inspect the cells using 40X objective.\n\tNOTE: If the preparation is successful, very few round cells should be visible. These round cells are usually damaged cells that are detaching from the tissue.\nPlace the grounding electrode through the 2% agar bridge into the EC bath.\nLocate a healthy cell using the 40X objective.\n\tNOTE: A healthy cell should be firmly attached to the tissue slice and not rounded up and detached from the slice.\nSet the amplifier in voltage-clamp (VC; Figure 4A point 1) mode. Open the seal test window and press the bath configuration (Figure 4B point 1 and 2. Use a 5-mV pulse to monitor pipette resistance (Figure 4B point 3).\nBackfill the tip of the patch pipette with the antifungal free IC solution before adding the IC solution with amphotericin B using a micro-filler syringe (see Figure 3).\nAdd a slightly positive air pressure into the patch pipette using 1 mL syringe.\n\tNOTE: This makes a small liquid flow from the patch pipette that avoid contamination of the tip.\nOnce in the bath, assess the patch pipette resistance and make sure no particles are attached to the tip of the pipette (Figure 4C).\n\tNOTE: A small piece of tape is attached onto the monitor displaying the video recording form the field of view. This makes the positioning of the patch pipette relative to cell easier when the objective is not focusing on the cell.\nGuide the patch pipette down to the cell using micromanipulators.",
    "NOTE: Make sure that the pipette is clean by looking for small particles that may have attached to the tip of the pipette. Sudden changes in resistance may also be a result of particles stuck in the pipette tip.\nReadjust the pipette when a few microns above the cell so that the tip of the pipette will touch the cell 1/3 from the middle of the cell, as shown in Figure 5. When touching the cell, release the pressure and apply the gentle suction to make a seal.\n\tNOTE: The time from the patch pipette enters the bath to a successful seal should be kept as short as possible. Not more than 1–1.5 min in order to avoid amphotericin B reaching the tip of the pipette and leak into the bath.\nImmediately switch to the patch window in the patch-clamp software (Figure 4D point 1) and have a holding potential between -50 and -60 mV (Figure 4D point 2). Zero out the fast capacitance made up by the glass pipette (Figure 4D point 3).\nSwitch to the cell window in patch-clamp software (Figure 4E point 1 and 2) and start monitoring access resistance, Ra, displayed on the window. Zero out the membrane capacitance in the amplifier software (Figure 4E point 3) after sufficient access.\n\tNOTE: Sufficient access might take 10 to 30 min (Figure 4E point 2). A good access for current clamp recordings should be below 20 M .\nSwitch to current clamp, IC, in amplifier software window (Figure 4F point 1). Adjust the fast-capacitive currents in the I-clamp window of the amplifier software (Figure 4F point 2 and 3) to the same value as in 3.12. Check membrane potential (Figure 4F point 1).",
    "NOTE: Importantly, if the membrane potential is shallow (typical above -35 mV) the cell might be damaged. Cancel the recording and find a new cell.\nAfter finding a healthy cell (firmly attached to the tissue with membrane potential below -40 mV), start the experimental recordings as detailed in the manufacturer's protocol 33,34.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}