{
  "id": 1863,
  "origin_website": "Cell",
  "title": "Protocol for identification and validation of 2′3′-cGAMP-binding proteins by photoaffinity probes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLabeling of cell lysates using 2′3′-cGAMP probe (Probe 3)\nTiming: 2 days\nThis section describes how to visualize the potential 2′3′-cGAMP-binding or -interacting proteins present in the cell lysate based on fluorescence image of the protein gel by using Probe 3.\nSet up the labeling assay in 1.5 mL microcentrifuge tubes as below:\ntable:files/protocols_protocol_1343_9.csv\nFor the competitive labeling sample, add 2′3′-cGAMP (0.5 μL 40 mM stock in H2O, final 1 mM) into 60 μg cell lysate (Sample No: 4) in the 1.5 mL microcentrifuge tubes, and incubate at 4°C for 1 h.\nFor non-competitive labeling samples, add the same volume of water instead of 2′3′-cGAMP into 60 μg cell lysate (Sample No: 1, 2, 3) in the 1.5 mL microcentrifuge tubes, and incubate at 4°C for 1 h.\nAdd Probe 3 (0.5 μL 0.4 mM stock in H2O, final 10 μM) into the samples (Sample No: 2–4), respectively, and incubate at 4°C for 1 h. For the control sample, add the same volume of water instead of Probe 3 into the sample (Sample No: 1), and incubate at 4°C for 1 h.\nTransfer the samples (Sample No: 1, 3, 4) onto the Parafilm inside of the 48-well plate lid on ice, and irradiate at 365 nm (CL-100 Ultraviolet Crosslinker, 9999 μJ/cm2) for 30 min (Figure 4[href=https://www.wicell.org#fig4]). For the control sample, don’t irradiate it (Sample No: 2).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1343-Fig4.jpg\nFigure 4. Sample setup for photocrosslinking\nCollect each sample into a 1.5 mL microcentrifuge tube, and add urea (19 mg) to the final 8 M.\nNote: The addition of urea into the sample to final 8 M increases the sample volume to 40 μL (2 times of the original volume).",
    "Critical: It is very important to execute protein denaturing by urea for next step of click chemistry, which eliminates the false positive labeling of proteins that don’t interact with probes directly.\nPerform click chemistry to conjugate Rh-N3. Add Rh-N3 (0.9 μL 10 mM stock in DMF, final 225 μM), TBTA (0.6 μL 10 mM stock in DMF, final 150 μM), CuBr (1.5 μL 20 mM stock in DMSO, final 750 μM), CuSO4 (1.5 μL 20 mM stock in H2O, final 750 μM), and TCEP (1.5 μL 20 mM stock in H2O, final 750 μM) into 34 μL each sample ( final 40 μL) in order, and incubate the reaction mixture at 22°C for 2 h in the dark.\nCritical: It is very important to add the reagents in order to have maximum reaction efficiency. TCEP solution should be made freshly before use. Vortex briefly after addition of each reagent.\nMix the samples with 20 μL 6× loading buffer and resolve the samples (20–30 μg protein equivalent for each sample) by SDS-PAGE using a 12% acrylamide gel.\nFix the gel by incubation with a destaining buffer for 1 h in the dark on a mini-shaker.\nNote: During the incubation with the destaining buffer, the background of fluorescence from unreacted Rh-N3 will be eventually washed out from the gel. If the background fluorescence of the gel is still high, extend the period of incubation with destaining buffer to 2–4 h.\nScan the gel using a Typhoon 7000 imager to record the Rhodamine (Rh) fluorescence image. For representative fluorescence image figure, see Figure 2A in Hou et al. (2021)[href=https://www.wicell.org#bib4].\nStain the gel with Coomassie blue, and record the image of protein gel with a digital camera.",
    "Note: This method is also suitable for visualization of potential 2′3′-cGAMP-binding or -interacting proteins present in different subcellular fractions, tissue lysate or other protein sources. The protein bands with significantly higher fluorescence signal in Sample No. 3 than in Sample No. 1, 2 and 4 are considered as potential 2′3′-cGAMP-binding or -interacting proteins. Because there is no Probe 3 in Sample 1 and no UV irradiation in Sample 2, no obvious fluorescence signal will be seen in these two samples. Nevertheless, the level of reduced signal in Sample 4 compared with Sample 3 is dependent on the binding affinities of the potential target proteins with 2′3′-cGAMP and the probe.\nPulldown MS experiments using Probe 3 with SILAC HeLa cell lysate\nTiming: 3 days\nThis section describes how to identify the potential 2′3′-cGAMP-binding or -interacting proteins from the SILAC cell lysates by probe pulldown and mass spectrometry.\nFor the competitive pulldown samples (Sample No: 3, 6), add 2′3′-cGAMP (25 μL of 40 mM stock in H2O, final 1 mM) into the cell lysates (1 mL of 2 mg/mL solution) in a 1.5 mL microcentrifuge tube, and incubate at 4°C for 1 h. For the non-competitive pulldown samples (Sample No: 1, 2, 4, 5), add the same volume of water instead of 2′3′-cGAMP into the cell lysates in a 1.5 mL microcentrifuge tubes, and incubate at 4°C for 1 h.\ntable:files/protocols_protocol_1343_10.csv\nAdd Probe 3 (5 μL 2 mM stock in H2O, final 10 μM) into the samples (Sample No: 2, 3, 5, 6), and incubate at 4°C for 1 h. For the control sample, add the same volume of water instead of Probe 3 into the samples (Sample No: 1, 4), and incubate at 4°C for 1 h.",
    "Transfer each sample into 24-well plates (200 μL/well) on ice, and irradiate them at 365 nm (CL-100 Ultraviolet Crosslinker, 9999 μJ/cm2) for 30 min (Figure 4[href=https://www.wicell.org#fig4]).\nCollect Normal Set of Samples (Sample No: 1, 2, 3, total 3 mL 6 mg cell lysate) into a 50 mL conical tube, and add 2.8 g urea to the final 8 M. Same for Reverse Set of Samples (Sample No: 4, 5, 6, total 3 mL 6 mg cell lysate).\nNote: The addition of urea into the sample to final 8 M increases the sample volume to 6 mL (2 times of the original volume).\nCritical: It is very important to execute protein denaturing by urea for next step of click chemistry, which eliminates the false positive hits.\nPerform click chemistry to conjugate Biotin-N3. Add Biotin-N3 (135 μL 10 mM stock in DMF, final 225 μM), TBTA (90 μL 10 mM stock in DMF, final 150 μM), CuBr (225 μL 20 mM stock in DMSO, final 750 μM), CuSO4 (225 μL 20 mM stock in H2O, final 750 μM), and TCEP (225 μL 20 mM stock in H2O, final 750 μM) into 5.1 mL each sample (final 6 mL) in order, and incubate the reaction mixture at 22°C for 2 h in the dark with gentle rotating.\nCritical: It is very important to add the reagents in order to have maximum reaction efficiency. TCEP solution should be made freshly before use. Vortex briefly after addition of each reagent.\nPerform protein precipitation.\nAdd 7.98 mL methanol (ice-cold), 3 mL chloroform (ice-cold) and 6 mL water (ice-cold) into samples. Vortex and then centrifuge 40 min at 4,500×g, 4°C.\nWash the pellets with 8 mL of ice-cold methanol twice, and centrifuge 25 min at 4,500×g, 4°C.",
    "Remove as much methanol as possible, and allow the pellets to dry for about 20 min.\nPerform protein resolubilization.\nResuspend the pellets in 600 μL 4% SDS buffer with 1 mM EDTA.\nSonicate the samples by Ultrasonic Homogenizer with 2 mm probe. Repeat two times. Condition: power 4%; working time: 10 s; ultrasonic opening time: 2 s, ultrasonic turn-off time: 2 s.\nAdjust the SDS concentration below 0.4% by adding 6 mL 1% Brij 97 buffer.\nCentrifuge 15 min at 4,500×g, 22°C. Collect the supernatants as the protein samples for the following enrichment.\nPerform protein enrichment.\nPrewash High Capacity Streptavidin Agarose (40 μL 50% aqueous slurry for each sample) three times with 1 mL of 1% Brij 97 buffer in 15 mL conical tubes by centrifugation at 4,000×g for 5 min at 22°C for each time.\nIncubate the protein samples with the prewashed beads in 15 mL conical tubes for 1.5 h at 22°C with gentle rotating.\nCentrifuge 5 min at 4,000×g at 22°C to remove supernatant. Resuspend the beads with 1 mL 1% SDS in PBS and transfer the beads to a 1.5 mL microcentrifuge tube.\nCentrifuge 5 min at 4,000×g at 22°C to collect the beads. Using the same centrifugation conditions, wash the beads 4 times with 1 mL of 1% SDS in PBS, followed by 4 times with 1 mL of 0.2% SDS in PBS and finally 4 times with 1 mL PBS. Be sure that all beads have been resuspended during the washes by inverting the tube 3–4 times.\nAfter the last wash, dry the beads with a gel loading tip.",
    "Note: After protein enrichment, 2′3′-cGAMP-binding or -interacting proteins (endogenous or exogenous) have been enriched on the beads. Thus it is also feasible to detect them by western blot using their antibodies. For representative western blot figure, see Figures 1D and 2F in Hou et al. (2021)[href=https://www.wicell.org#bib4].\nPerform on-bead trypsin digestion.\nResuspend the beads in 500 μL of 6 M urea in PBS and transfer to a 1.5 mL microcentrifuge tube. Add TCEP (25 μL of 200 mM) to final 10 mM, and incubate for 30 min at 22°C with gentle rotating (do not heat the samples).\nAdd IAA (25 μL of 500 mM) to final 25 mM, and gently rotate for 30 min at 22°C in the dark.\nCentrifuge for 2 min at 1,400×g to remove the supernatant. Wash beads with PBS (1 × 1 mL).\nAdd 200 μL of 2 M Urea in PBS, 2 μL of 100 mM CaCl2 (final 1 mM), 4 μL of 0.5 mg/mL trypsin (2 mg total) in re-suspension buffer to the beads, and incubate for 12 h at 37°C (Thermal Mixer, 1100 rpm).\nCentrifuge for 1 min at 4,000×g and transfer the supernatant to a 1.5 mL microcentrifuge tube.\nPurify digested peptides using C18 Tips.\nSet the pipettor to 100 μL and secure the C18 tip tightly to the end of the pipettor for optimum tip-to-pipettor seal and sample aspiration.\nWet the tip by aspirating 200 μL of pure ACN and then discarding the solvent. Repeat once (keep the membrane wet).\nEquilibrate the tip by aspirating 200 μL of 0.1% TFA and discarding the solvent. Repeat once.",
    "Aspirate up to 200 μL of the sample (prepared in Step 18) into the C18 tip. For maximum efficiency, dispense and aspirate the sample for 10-20 cycles. Keep the sample after the last dispensation for the second round.\nRinse the tip by aspirating 200 μL of 0.1% TFA and discarding the solvent. Repeat twice.\nAspirate up to 200 μL of 70% ACN, and elute the solution (containing tryptic peptides) into a clean 1.5 mL microcentrifuge tube. Dry the tip.\nRepeat Step b-f for the second round with the kept sample at step d. Total elution is about 400 μL.\nNote: The samples (prepared in Step 18) will be loaded to the C18 Tip twice to recover and elute more digested peptides, in case some peptides weren’t captured in the first round.\nDry down the elution in a vacuum centrifuge to remove the solvent. Submit the dried peptides for nanoLC-MS/MS analysis.\nFrom mass spectrometry data analysis, in the Normal Set of Samples, proteins with enrichment ratio (Medium/Light) > 1.2 and competition ratio (Medium/Heavy) > 1.2 were considered as positive hits. And in the Reverse Set of Samples, proteins with enrichment ratio (Light/Heavy) > 1.2 and competition ratio (Light/Medium) > 1.2 were considered as positive hits. Positive hits from both Normal Set of Samples and Reverse Set of Samples are seen as identified target proteins in one replicate. Totally three independent replicates for SILAC HeLa cell lysates were carried out, and the overlapped proteins of these three replicates are considered as final target proteins. For representative probe pulldown MS experiments of SILAC cell lysates, see Figures 2G and 2H in Hou et al. (2021)[href=https://www.wicell.org#bib4].",
    "Note: The details of Data analysis for SILAC experiments are shown here, same as in the reference (Hou et al., 2021[href=https://www.wicell.org#bib4]). MS/MS raw spectra were processed using MaxQuant software (version 1.5.3.30) and thermo proteome discoverer(2.1.0.81). The human protein sequence database containing 20410 sequence entries in the Swiss-Prot database downloaded on October 12, 2018 was used for database search. Trypsin was set as the enzyme, and the maximum missed cleavage was set to 2. The first-search peptide mass tolerance and main-search peptide tolerance were set to 20 and 4.5 ppm. The MS/MS match tolerance was set to 0.5 Da for ITMS and 20 ppm for FTMS. A fixed carbamidomethyl modification of cysteine and variable modifications on methionine oxidation were set. “Match between runs” was applied, and the match time window was set to within 2 min. The false discovery rate (FDR) was controlled with a decoy database and set to no more than 1%. The minimum Andromeda score for modified peptides was 40, and the minimum delta score was 6 for the modified peptides. For SILAC sample, Proteome Discoverer determines the area of the extracted ion chromatogram and computes the “heavy/medium/light” ratio. Protein ratios are then calculated as the median of all the unique quantified peptides belonging to a certain protein. The ratios among proteins in their heavy and light versions were used as fold-change. We used “Wu Kong” platform (https://www.omicsolution.com/wkomics/main/[href=https://www.omicsolution.com/wkomics/main/]) for relative Enrichment and Competition analysis of MS data. Average foldchange was calculated for enrichment and competition. The p-values were resulted from the welch t-test. Alternatively, there are several options to analyze the MS data instead using the “Wu Kong” platform website. Volcano plots can be generated by (1) Graphpad; (2) EnhancedVolcano (using R script, https://www.bioconductor.org/packages/release/bioc/vignettes/EnhancedVolcano/inst/doc/EnhancedVolcano.html[href=https://www.bioconductor.org/packages/release/bioc/vignettes/EnhancedVolcano/inst/doc/EnhancedVolcano.html]); (3) or a web app VolcaNoseR (https://huygens.science.uva.nl/VolcaNoseR/[href=https://huygens.science.uva.nl/VolcaNoseR/]).",
    "Note: The enrichment ratio (Medium/Light) and competition ratio (Medium/Heavy) are set according to the lowest ratio of EF1A1 in SILAC experiments. The minimum ratio in SILAC experiment is 1.2 in general. For ratio calculation, infinite ratio (with zero value as the denominator) is set as 100 for convenience.\nNote: Identification of potential 2′3′-cGAMP-binding or -interacting proteins can also be carried out with non-SILAC cell lysates, and label-free MS analysis should be performed to obtain the target proteins.\nNote: The probe could bind non-specifically to proteins and remain attached in the absence of crosslinking. In this protocol, we execute several steps to minimize this non-specificity. First, urea is used to denature proteins in the sample after photocrosslinking step to diminish the nonspecific binding. Second, protein precipitation and resolubilization is carried out after click chemistry to further clean up the probe from the proteins. Third, the arrangement of Normal and Reverse Set of Samples is to reduce the false positive hits generated by this non-specificity. Fourth, the experiment is repeated three times to systematically decrease the nonspecific effect. Please check the reference (Hou, et al., 2021[href=https://www.wicell.org#bib4]) for the fluorescence images and MS data of probe labeling to have a better understanding.\nLabeling of endogenous EF1A1 in purified EF1 complex using Probe 3\nTiming: 1 day\nThis section describes how to verify the identified protein targets as the real 2′3′-cGAMP-binding proteins by using purified target proteins and 2′3′-cGAMP Probe 3.\nSet up the labeling assay in 1.5 mL microcentrifuge tubes as below:\ntable:files/protocols_protocol_1343_11.csv\nFor the competitive labeling sample (Sample No: 3), add 2′3′-cGAMP (0.5 μL 40 mM stock in H2O, final 1 mM) into 4 μg purified EF1 complex in the 1.5 mL microcentrifuge tube, and incubate at 4°C for 1 h.",
    "For non-competitive labeling samples (Sample No: 1, 2), add the same volume of water instead of 2′3′-cGAMP into 4 μg purified EF1 complex in the 1.5 mL microcentrifuge tube, and incubate at 4°C for 1 h.\nAdd Probe 3 (0.5 μL 0.4 mM stock in H2O, final 10 μM) into the samples (Sample No: 2, 3) respectively, and incubate at 4°C for 1 h. For the control sample, add the same volume of water instead of Probe 3 into the sample (Sample No: 1), and incubate at 4°C for 1 h.\nFollow Step 3-9 to obtain the labeling results of endogenous EF1A1 in purified EF1 complex with Probe 3. For representative figure of probe labeling with purified proteins, see Figure 3B in Hou et al. (2021)[href=https://www.wicell.org#bib4].\nNote: This method is suitable for any purified proteins. The tested protein with significantly higher fluorescence signal in Sample No. 2 than in Sample No. 1 and 3 is considered as a positive hit.\nLabeling of live cells with Probe 3 to detect EF1A1 from Probe 3 bound proteins\nTiming: 3 days\nThis section describes how to validate the association between identified protein targets and 2′3′-cGAMP in cells by using probe pulldown.\nRemove the medium from 293T cells (1 × 10-cm dish, 30% confluency), and incubate cells with fresh medium containing 0.1 mM STF-1623 (ENPP1 inhibitor) and 30 μM Probe 3 for 18 h (Sample No: 2). For the negative control, don’t incubate cells with Probe 3 (Sample No: 1).\ntable:files/protocols_protocol_1343_12.csv\nRemove the medium from the dish, rinse cells with 5 mL PBS, and cover cells with 3 mL PBS containing 30 μM Probe 3 (no Probe 3 in PBS for the negative control). Put the dish on ice and irradiate it at 365 nm with CL-100 Ultraviolet Crosslinker (9999 mJ/cm2) for 30 min.",
    "Critical: For positive labeling of live cells, it is very important to use PBS containing the same concentration of Probe 3 as in cell culture medium to cover cells for photocrosslinking, in order to have the optimum labeling result.\nRemove PBS buffer from the dish, add 600 μL 4% SDS buffer, lift up cells with cell scrapers and collect the suspension into a 1.5 mL microcentrifuge tube.\nLyse the suspension by Ultrasonic Homogenizer with 2 mm probe. Condition: power 20%, working time: 30 s, ultrasonic opening time: 2 s, ultrasonic turn-off time: 2 s.\nCentrifuge 15 min at 20,000×g, 22°C, and collect the supernatant in a 1.5 mL microcentrifuge tube.\nPerform click chemistry to conjugate Biotin-N3 as Step 14 (with the same final concentration of each reagent), protein precipitation as Step 15, protein resolubilization as Step 16, and protein enrichment as Step 17.\nMix the beads with 20 μL 2× loading buffer and heat at 95°C for 5 min. Resolve the samples by SDS-PAGE using a 12% acrylamide gel, and detect EF1A1 by western blot using EF1A1 antibody. For representative western blot figure, see Figure 5A in Hou et al. (2021)[href=https://www.wicell.org#bib4].\nNote: This method is also suitable for other potential 2′3′-cGAMP-binding or -interacting proteins. The tested protein with significantly higher western blot signal in Sample No. 2 than in Sample No. 1 is considered as a positive hit, which illustrates the association between the tested protein and 2′3′-cGAMP in cells.\nLabeling of live cells with Probe 3 to validate Probe 3 bound with EF1A1 in EF1 complex\nTiming: 3 days",
    "This section describes how to validate the association between identified protein targets and 2′3′-cGAMP in cells by using IP of target proteins. Here Flag IP of the overexpressed Flag-EF1D is applied for the protocol, which is also suitable for IP of endogenous target proteins (Hou et al., 2021[href=https://www.wicell.org#bib4]).\nRemove the medium from 293T cells and 293T cells stably overexpressing Flag-EF1D (1 × 10-cm dish, 30% confluency), and incubate cells with fresh medium containing 0.1 mM STF-1623 (ENPP1 inhibitor) and 30 μM Probe 3 for 18 h (Sample No: 1, 3). For the negative control, don’t incubate cells with Probe 3 (Sample No: 2).\ntable:files/protocols_protocol_1343_13.csv\nRemove the medium from the dish, rinse cells with 5 mL PBS, and cover cells with 2 mL PBS containing 30 μM Probe 3 (no Probe 3 for the negative control). Put the dish on ice and irradiate it at 365 nm with CL-100 Ultraviolet Crosslinker (9999 mJ/cm2) for 30 min.\nRemove PBS buffer from the dish, add 600 μL 1% NP-40 buffer, lift up cells with cell scrapers and collect the suspension into a 1.5 mL microcentrifuge tube.\nLyse the suspension by Ultrasonic Homogenizer with 2 mm probe. Condition: power 20%, working time: 30 s, ultrasonic opening time: 2 s, ultrasonic turn-off time: 2 s.\nCentrifuge 15 min at 20,000×g, 4°C, and collect the supernatant in a 1.5 mL microcentrifuge tube.\nDilute the supernatant with the same amount of 0.2% NP-40 buffer, and incubate with 20 μL Flag beads (50% suspension) in each tube for 2 h at 4°C with gentle rotating.\nCentrifuge 5 min at 4,000×g at 4°C to remove supernatant. Using the same centrifugation conditions, wash the beads 3 times with 0.5 mL 0.2% NP-40 buffer.",
    "Elute the bound proteins from the beads by incubation with 20 μL 4% SDS buffer and heat at 95°C for 10 min. Collect the supernatant in a 1.5 mL microcentrifuge tube after centrifugation for 5 min at 4,000×g at 22°C.\nPerform click chemistry to conjugate Biotin-N3 as Step 14 (with the same final concentration of each reagent).\nMix the samples with 10 μL 6× loading buffer, resolve the samples by SDS-PAGE using a 12% acrylamide gel, and detect biotin conjugated on EF1A1 in EF1 complex via Probe 3 by western blot using avidin-HRP. For representative western blot figure, see Figures 5B and 5C in Hou et al. (2021)[href=https://www.wicell.org#bib4].\nNote: This method is also suitable for other potential 2′3′-cGAMP-binding or -interacting proteins. The tested protein with significantly higher biotin signal in Sample No. 3 than in Sample No. 1 and 2 is considered as a positive hit, which illustrates the association between the tested protein and 2′3′-cGAMP in cells."
  ],
  "subjectAreas": [
    "Chemistry",
    "Molecular/Chemical Probes",
    "Immunology",
    "Mass Spectrometry",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}