{
  "id": 4905,
  "origin_website": "Bio",
  "title": "[<sup>14</sup>C] Linoleic Acid Uptake and Fractionation Assay in <em>Vibrio cholerae</em>",
  "procedures": [
    "[14C] linoleic acid uptakeUse one colony of V. cholerae classical biotype strain O395 to start an overnight culture in a test tube containing 5 ml standard LB at 37 °C and 200 rpm shaking.After overnight growth, subculture the bacteria 250 μl in 10 ml LB pH 6.5 (1:40 ratio) in an Erlenmeyer flask, and grow for 2 h in a water bath shaker at 30 °C. At 2 h, record the OD600 of the culture. Expect an OD600 of between 0.2 and 0.3. Transfer the culture to a 15 ml falcon tube and add 0.1 μCi (1 μl) of 14C-radiolabeled linoleic acid for each milliliter of the subculture (final concentration of about 3.2 mM linoleic acid). This tube can stay on the bench top for the duration of the experiment or, if desired, put at 37 °C without agitation between aliquots.Upon addition of the radiolabeled linoleic acid, extract 1 ml of the culture and immediately centrifuge in a 1.5 ml microcentrifuge tube at 15,000 rpm for 3 min at room temperature. This is t = 0. In order to compare the counts per minute (CPM) of 14C in the supernatant and the cell pellet, transfer the supernatant in a 1.5 ml tube and wash the cell pellet 3 times with 1 ml of 1x PBS and centrifuge each for 3 min.Resuspend the cell pellet in 100 μl of 1x PBS and add to 5 ml of scintillation cocktail per scintillation vial. In order to compare the amount of 14C-radiolabeled linoleic acid not taken up by V. cholerae, add 100 μl of the supernatant fraction to another vial with 5 ml scintillation cocktail.The same procedure can be repeated for other aliquots of the subculture at times 5, 15, and 30 min or whatever time points are desired.",
    "All scintillation vials can be stored at room temperature and read together after the last time point. After uptake, counts per minute are measured for each time point using a scintillation counting system.Data are then analyzed using the cpm determined from the cell pellet fraction and an equation of best fit determined. To determine how much  14C-radiolabeled linoleic acid is not taken up as a check of accuracy, use cpm determined from the supernatant fraction and multiply by 10 as only 100 μl of the 1 ml was used. The amount of 14C-radiolabeled linoleic acid in the cell pellet is graphed below for each time point:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220223151_9324.jpgFigure 1. 14C-radiolabeled linoleic acid uptake by V. cholerae. The equation of best fit is y = 24622 + 156786*(1 - e-0.036x) with an R2 value of 0.989.Fractionation of V. cholerae to determine localization of [14C] linoleic acidAfter overnight growth at 37 °C as described in step A1, subculture V. cholerae O395 classical biotype 250 μl in 10 ml LB (pH 6.5) (1:40 ratio) and grow in a water bath shaker at 30 °C for 2 h. At 2 h, add 0.1 μCi of 14C-radiolabeled linoleic acid to 1 ml of the subculture and incubate at room temperature for 1 h without agitation. This time is chosen to ensure the bacteria are still in log-phase growth.Harvest the bacteria by centrifugation (15,000 rpm) at room temperature for 3 min and wash the pellet three times with 1 ml 1x PBS at 15,000 rpm for 3 min each time. Resuspend the bacteria in a 500 μl solution of 20 mM Tris-Base (pH 8.5) and 500 mM NaCl. Freeze the suspension in an ethanol (at least 95%) and dry ice bath for 2 minutes ensuring the tube is fully submerged, and then put at 37 °C until thawed.",
    "Repeat this freeze-thaw process for a total of three freeze-thaw cycles to ensure complete fractionation. Fractionate the bacteria by centrifugation for 10 min at 15,000 x g at 4 °C to separate the membrane and cytoplasm. The cytoplasm is taken as the supernatant and the pellet (cell envelope fraction) is washed 3 times in 500 μl of 1x PBS by centrifuging for 3 min at 15,000 x g. Expect a very small pellet at the bottom of the tube. The amount of 14C-linoleic acid in each fraction is determined by adding the entire fraction to 5 ml scintillation cocktail, followed by measurement of CPM in a scintillation counter.Data are then analyzed as percent 14C-linoleic acid in each fraction. A representative graph is shown below:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220223208_6712.jpgFigure 2. Percentages of 14C-radiolabeled linoleic acid in cytoplasm and envelope fractions"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}