{
  "id": 18045,
  "origin_website": "Jove",
  "title": "Designing CAD/CAM Surgical Guides for Maxillary Reconstruction Using an In-house Approach",
  "procedures": [
    "This study was approved by the authors' institutional review board, and written consent forms were completed by all patients.\n1. Preparation of Materials\nUse a personal computer, computed tomographic (CT) data of facial bone and fibula, conversion software such as InVesalius20, and three-dimensional (3-D) CAD software (e.g., Blender21).\n\tNOTE: A maximum thickness of 1 mm slices of CT data is recommended for an accurate design. For the actual surgical simulation, use the patient's CT data. For research, use free human 3-D data22.\nUse a 3-D printer23, screws, metal plates, and a small saw, to check not only the designs but also real objects and results.\n\tNOTE: The present study is experimental. Metal plates, screws, and a small saw can be used for the model surgery. Instead of metal plates, plastic-fixation plates can be also printed by the 3-D printer, together with the surgical guides.\nTransfer the imaging data of both facial bone and fibula into 3-D data (.stl format) using InVesalius20.\n\tNOTE: CT data is essentially recorded in the form of two-dimensional (2-D) pictures. Thus, before using the 3-D data, it is necessary to convert the data into 3-D data. Free software is sufficient for this purpose. This report does not explain how to transfer the data into a 3-D file; instructional videos and guides are available elsewhere.\nImport each .stl file into Blender21.\n\tNOTE: CAD software usually accepts a .stl-style 3-D format. At first, maxillary and fibular .stl files should be opened in the specific CAD software by importing them.\n2. Design\nDeciding on the area of bone removal and solidifying a bone defect\nDecide on the area to be excised.",
    "NOTE: In this experimental simulation surgery, any part of the maxilla can be set as an excised area. Because reconstruction after total maxillectomy is difficult, only a small part of the maxilla will be a choice for beginners. In a clinical setting, otorhinolaryngologists will decide the area according to the cancerous region.\nMake a large plane and place it on the border of the area for removal in the object mode (Figures 1a and 1b). Follow that by placing a second plane (Figures 1b-1d) and continue to do so until the planes surround the whole area for removal. Unite these planes in the object mode.\nSelect the vertices of all these planes and connect them to each other by making edges and faces (Figure 1e) in the edit mode to surround the areas for removal.\n\t\tNOTE: The excision planes should be copied and maintained because these original planes are used and discarded when solidifying the excision. In the present study, copying every plane and solid on every occasion is recommended in order to make it possible to reuse them.\nSubtract the resectable solid from the facial bone using a Boolean modifier in the edit mode. This results in a shaved facial bone (Figure 1f), which is the maxillary defect model.\nPlacing a fibula bone\nPlace a fibula into the maxillary defect area (Figure 2a). Place small cubes at two points (8 cm distal from the fibular head and 5 cm proximal from the lateral malleolus) in the fibula as markers (purple small cubes are shown in Figure 2).\n\t\tNOTE: In clinical situations, a fibula can be used between 8 cm distal from the fibular head and 5 cm proximal from the lateral malleolus. By this marking, we can easily understand the areas that can be used.",
    "Link small cubes to the fibula as a parent setting in the object mode.\nPlace small cubes as markers in several points in the maxillary lesion where reconstruction is necessary. With this marking, the visibility of the necessary reproduction points is increased.\nFit the fibula to the front margin of the alveolar bone in the object mode, if the fibula is placed from the midline.\nUse the previous plane of the midline maxillary osteotomy as a first fibular osteotomy plane (Figure 2b).\nPlace a new osteotomy plane where appropriate in the object mode (Figure 2c). Link this new plane to the fibula as a parent setting.\n\t\tNOTE: By setting the parent to the fibula, the relative orientation between this new osteotomy plane and the fibula is always maintained even if the fibula is moved into different places. The area of the fibula that is surrounded by these two cutting planes becomes the first fibular block.\nCopy the fibula and two planes of osteotomy as a parent setting in the object mode. Move this copied fibula, which has the first block area with two cutting planes on both ends, to the second area where reconstruction is necessary (Figure 2e) to plan the second fibula block.\nPlace the second cutting plane by adding a new plane in the object mode.\n\t\tNOTE: The first and second cutting plane will become the ends of the second fibula block. If a third block is necessary, similar procedures are added. The appropriate length of the gaps between the adjacent fibular blocks should be maintained.",
    "NOTE: The gap between the first and second block is considered to be key to having a comfortable osteotomy. If this gap is wide, the osteotomy will be easy because of the wide working space, but the vascular length is somewhat wasted. By contrast, if the gap is narrow, osteotomy becomes troublesome, but the second or third block can be designed by eliminating the waste of the unused bone.\nDesigning the fibular cutting guides\nVisualize only the fibula and cutting planes for designing the fibula cutting guide in the object mode (Figure 3a).\nMake each cutting plane smaller to occupy only half the area of the fibula cutting section by sliding vertexes along the edges (Figures 3b-3d) in the edit mode.\n\t\tNOTE: The fitting side of the cutting guide is the lateral aspect of the fibula. Because the feeding vessels are located in the medial aspect, the guide is not designed in the medial aspect.\nUnite two planes of the ends to build a solid in the object mode (Figures 4a-4e). Select the vertexes of all these planes and connect them to each other by making edges and faces in the edit mode to form a rectangular solid.\nSubtract the fibula from this rectangular solid by using a Boolean modifier (Figures 5a-5c).\n\t\tNOTE: The surface of this subtraction completely fits the fibular lateral aspect. The same procedures are repeated in every necessary fibular block.\nUnite each subtracted solid in the object mode.\nPlace a cube near the subtracted solids (Figure 5d). Extrude faces to make pillars (Figures 5e-5g). Unite these pillars to the subtracted solids. This is the fibular cutting guide (Figures 5h-5j).\nOsteotomy cutting guide for the maxilla",
    "NOTE: To cut the maxilla, it is not necessary to design the guide for every cutting surface, because only limited areas are to be reconstructed using the fibula. Usually, two cutting guides, which cover the medial alveolar and lateral zygomatic areas, are designed.\n\t\nPrepare the maxillary and zygomatic planes that were the original remaining surface after the maxillary removal. A margin of 1 cm in width is sufficient (Figure 6a).\nExtrude the faces prepared in step 2.4.1 to thicken the plane and to solidify them in the edit mode using the solidify modifier (Figure 6b).\nDelete the thickened solid over the resection planes, which were decided in step 2.1, on both ends; this is how the maxillary cutting guides are designed.\n\t\t​NOTE: If the fitting surface is jagged, a smaller fitting area is sufficient. If the fitting surface is apt to be flat, a large area is needed to avoid any slippage of the guide.\nFixation guide for the fibular segments\n\tNOTE: Fibular segments that are to be transferred to the maxilla are considered to be accurate in size and length, but the location of the transfer can deviate freely if the fixation guide is not used. The fibula and each cutting plane (as made in step 2.2) are used again in this segment.\n\t\nConstruct each fibular block in the Boolean modifier by taking out the intersection area between the fibula and the solid with cutting planes on both ends (Figures 7a and 7b) in the edit mode.\nExtract half of the superficial surface of each fibular block.\nUnite all of these surfaces in the object mode (Figure 7c).\nDelete small faces in the edit mode by using a knife cut ( Figure 8a) to secure the spaces for fitting the metal plates.",
    "Thicken the surface by using a solidifying modifier in the edit mode (Figures 8b-8e).\n\t\tNOTE: A minimum 2–3 mm of thickness is necessary to stabilize the fixation guide and avoid warping. If the wing is designed on both ends, it will help the guide to the maxilla without using any metal plates.\n3. 3-D Printing for Model Surgery and Real Guides\nNOTE: The main purpose of this report is to show the method of designing surgical guides; the procedure described below is not necessary if 3-D printing is not needed.\nExport the designs of the guides in .stl format, which can be 3-D printed.\nPrint all guides and bones.\n\t​NOTE: In printing, rafts are considered to disturb smooth surface printing and lead to a jagged surface and poor fit to the bone, so the plane that needs to be smooth must be pointed upward.\nPerform the model surgery as follows:\nSimilar to actual surgery, fit the maxillary cutting guide to the facial bone model first (Figure 9a). Then, cut the facial bone along with the cutting plane using a saw.\nAttach the fibular cutting guide to the fibular bone model and cut it into pieces (Figure 9b). Attach the fibular blocks to the fixation guide (Figures 9c and 9d).\nFix this fixation guide complex to the maxillary defect using screws and plates (Figure 9e). After fixing the fibular segments to the maxilla in the area where the fixation guide does not attach by using screws and plates, remove the fixation guide. This completes the reconstruction (Figure 9f).\nScan the 3-D-reconstructed image and record it in .stl format using a 3-D scanner24.\nCompare the post-model surgery .stl file and the CAD reconstructed design (Figure 10) using comparison software25.",
    "NOTE: By comparing the virtual reconstruction design and the guided reconstruction model, actual accuracy is calculated. Because CAD/CAM accuracy is obtained within a 2.5 mm deviation in the mandibular reconstruction10, a similar precision should be required in this method. If the required accuracy cannot be obtained, redo the virtual design.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}