{
  "id": 3223,
  "origin_website": "Cell",
  "title": "Protocol for modulating the noradrenergic pathway from locus coeruleus to heart to prevent sudden unexpected death in epilepsy in mouse models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStereotactic surgery\nTiming: 3 h\nShave the mouse head based on the location of the target nucleus. With reference to the AP value (−5.45 mm) of LC, our shaving range extends to the binaural level (Figure 1[href=https://www.wicell.org#fig1]).\nFix the head of mice on the stereotaxic device by ear bars. After fixing, the head does not move forward or back, left or right, or up or down.\nTo avoid irreversible damage to the mice’s vision caused by strong light, smear eye ointment on the surface of mouse eyeballs and then cover them with sterile cotton balls (Figure 1[href=https://www.wicell.org#fig1]).\nCut the skin of the mouse head with ophthalmic scissors, and press the saline cotton ball to stop the bleeding.\nTo expose bregma and lambda, gently wipe the bone suture with a cotton ball damped with hydrogen peroxide (Figure 1[href=https://www.wicell.org#fig1]).\nInsert four miniature screws far away bilateral LC laterally along the front and back of the skull, forming roughly a square.\nNote: The implantation position should be away from the bregma and target nucleus. The implant depth is 1/2 to 2/3 of the screw.\nGently touch bregma and lambda with the glass electrode.\nLevel back and forth according to the DV value (difference less than 0.03 mm), then return to bregma level for horizontal leveling.\nAfter leveling left and right, double check the bregma and lambda levels.\nAccording to the parameters of the injected brain region, carefully sand the skull with a dental drill at the injection site (AP-5.45 mm, ML ±0.9 mm), thinning it slowly.\nNote: Twist sterile cotton balls into thin threads and hook out he bone fragments at the injection site.\nSlowly insert the glass electrode until it reaches the target nucleus.",
    "Based on the mouse atlas of Paxinos and Franklin (4th Edition, 2013), microinject (100 nL, at a rate of 40 nL/min) rAAV-DBH-GCaMP6m-WPRE-hGH pA virus by microinfusion pump(Kd Scientific) according to the following stereotaxic coordinates of LC (AP-5.45 mm, ML ±0.9 mm, DV −3.65 mm).\nNote: It is recommended that the injection speed should be set at 10–40 nL/min. If the injection position is deep or the needle is easily blocked, the injection speed can be accelerated up to a maximum of 80 nL/min.\nCritical: During microinjection, if the tip of the needle is smooth, the dropping liquid level of the virus and liquid paraffin in the glass electrode can be observed through the microscope. The front end of the glass electrode can be trimmed with tissue scissors, and the length of the front end refers to the DV value of the nucleus. If the needle tip is too thin, it will easily cause needle blockage.\nDo not pull out the syringe until 10 min after the injection to allow the virus to spread.\nAt the same coordinates, implant the optical fiber (FOC-W-1.25-200-0.37-4.0, Inper, Hangzhou, China) above LC for 0.10 mm (AP-5.45 mm, ML ±0.9 mm, DV −3.65 mm ) (Figure 1[href=https://www.wicell.org#fig1]).\nUse dental cement to fix optical fibers.\nNote: The time for bone cement to set completely is approximately 10 min. After the surgery, place the mice on a heating pad. 0.5–1 h after surgery, the mice will awaken. To avoid the fiber optic on the mouse's head getting stuck in the feeding trough, sprinkle the feed on the bedding.",
    "Note: When dental cement is used to secure the sleeve, the cement must completely cover the screw and only the upper part of the guide sleeve is visible outside the implant structure. In order to avoid adverse effects on the recovery and physiological activities of mice, excessive dental cement should not be used.\nNote: After implantation, let the virus express for 3 weeks.\nImmunohistochemistry\nInject 3.5% chloral hydrate intraperitoneally to anesthetize mice. Other anesthesia methods are acceptable.\nNote: Recommended dosage of anesthetic is 15 mg/kg of 3.5% chloral hydrate.\nPerfuse the brain with cold PBS to rinse the blood from the left ventricle, and then perfuse with 4% PFA (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2792-Fig2.jpg\nFigure 2. Key immunohistochemical procedures for testing DSP-4 disruption of LCNE neurons\n(A) Two methods for injecting DSP-4 to destroy the LCNE neurons: IP injection of DSP-4 for non-specific destroying of LCNE neurons; Intra-LC injection of DSP-4 for specific destroying of LCNE neurons.\n(B) Perfuse the brain with cold PBS to rinse the blood, and then perfuse the brain with 4% PFA.\n(C) Strip the brain carefully and saturate it in a 30% sucrose solution for 24 h.\n(D) Slice the brain into 35-μm-thick coronal slices with a freezing microtome.\n(E) Wash the brain slices with PBS, and then block them by incubation for 2 h at room temperature in the blocking solution (10% normal donkey serum, 1% bovine serum albumin, and 0.3% Triton X-100 in PBS).\n(F) The brain slices are incubated at 4°C overnight in a solution of rabbit anti-TH.\n(G) The brain slices are incubated in a solution of secondary antibodies for 2 h.\n(H) The brain slices are mounted onto glass slides and incubated in DAPI solution for 7 min.",
    "(I) Immunohistochemically stained slices were photographed using an Olympus microscope (VS.120) and a laser confocal microscope (Nikon A1). IP, intraperitoneal; PFA, paraformaldehyde; PBS, phosphate-buffered saline; LC, locus coeruleus.\nSoak brain tissue in 4% PFA and post-fixation time is 24 h.\nStrip the brain carefully and saturate it in a 30% sucrose solution for 24 h.\nNote: When extracting the heart, take care that the injection speed of the syringe. It is highly recommended to use infusion pump to avoid the deformation of the heart.\nSlice the brain into 35-μm-thick coronal slices with a freezing microtome.\nNote: Slice the heart into 15-μm-thick coronal slices with a freezing microtome.\nWash the brain slices.\nPlace the brain slices in the hole plate, fill each hole with 1× PBS from the side wall.\nPlace them on a shaker (40–50 r/min) for 5 min.\nAfter 5 min, absorb the waste liquid, and wash 3 times (Figure 2[href=https://www.wicell.org#fig2]).\nSeal the brain slices.\nPrepare sealing fluid on the ice box (1 mL contains 100 μL 100% NDS, 100 μL 10% BSA, 15 μL 20% triton and 785 μL 1× PBS).\nAdd 200 μL sealing fluid to each hole.\nPlace the plate on a shaker (10 r/min) at room temperature for 2.5 h.\nNote: After thawing the NDS BSA, shake the solution evenly before use. Compound sealing fluid, first antibody diluent and second antibody diluent when it is used.\nPrepare the first antibody diluent (1 mL contains 10 μL 100% NDS, 100 μL 10% BSA, 15 μL 20% triton and 875 μL 1× PBS) on an ice box, add TH antibody (1:1000), and shake evenly.\nAdd the first antibody to an octuple tube (50 μL/well), place it on a shaker (10 r/min) in 4°C refrigerator, and incubate it overnight",
    "The next day, after warming the sample to room temperature (RT, 15°C–25°C), place the sample in a hole plate filled with PBS, place it on a shaker (40–50 r/min), and wash 10 min. Repeat for 3 times.\nPrepare the second antibody diluent (1 mL contains 10 μL 100% NDS and 990 μL 1× PBS) on the ice box, add the second antibody and store it away from light.\nNote: Subsequent steps are light avoidance operation.\nAdd 200 μL of secondary antibody to each well and incubate it in a shaker (10 r/min) in dark for 1 h.\nAfter incubation, remove the secondary antibody and add 1× PBS, place it on a shaker (40–50 r/min) for 15 min and wash 3 times.\nUse a line marker to gently fix the brain slice in the orifice plate onto the slide, fully unfold the brain slice, and avoid bending corners.\nAfter the brain slices are completely dry, drop the DAPI diluted with PBS (1:4000) onto the slide, and completely covers all the brain slices. Incubate in dark for 7 min.\nNote: Completely cover the brain slices with DAPI. Incubate in dark for 7 min.\nDiscard the DAPI, drop the 1× PBS onto the slides, and wash 7–10 times.\nAfter the brain slices dry thoroughly, add 2–3 drops of sealing agent, cover with an appropriate cover glass, and store in dark for 4°C before imaging.\nFiber photometry experiment\nTiming: 2 h\nAnimal handling and habituation: place the mice into the experimental environment 10 min in advance.\nConnect the photometry recording system to the experimental animals through ceramic sleeves, optical fibers, rotary joints and optical fiber jumpers (Figure 6[href=https://www.wicell.org#fig6]).\nNote: Since calcium signal recording is susceptible to external light, we recommend that it be performed in a dark environment.",
    "Set the required experimental parameters on the device, such as pulse width, frequency and duration.\nNote: In our experiment, the fiber photometry system (Inper, Hangzhou, China, C11946) uses a 488 nm diode laser. The parameter for pulse width, frequency and duration: 20 Hz, 20-ms pulse width, 15 mW and 60 min.\nIn the fiber photometry experiment, a 410 nm signal needs to be recorded simultaneously.\nNote: The 410 nm laser does not affect the fluorescence protein signal, but it can reflect the signal changes of the above interference factors to reflect the background noise signal, and can re-eliminate the background noise signal to directly obtain the real calcium signal data.\nAfter the animals acclimate to the environment, start recording.\nELISA sampling\nTiming: 120 min\nAnesthesia or intraperitoneal injection of PTZ before sampling.\nThe control group was anesthetized by 3.5% chloral hydrate (for 20 g male DBA/1 mice, 8 weeks old, 0.30 mL of 3.5% chloral hydrate, 15 mL/kg body weight is recommended).\nFor the experimental group, IP administration of a single dose of PTZ at a dose of 75 mg/kg, and samples were taken immediately after the onset of S-IRA in the mice.\nPreparation of blood plasma (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2792-Fig3.jpg\nFigure 3. Key procedures for the measurement of TH content and specific activity in the whole heart and heart blood",
    "(A) Plasma sample preparation: a. Inject the needle (the needle was fully moistened with heparin) from the apex of the heart and draw blood as mildly as possible. b. When transferring blood from a syringe to a centrifuge tube, remove the needle from the syringe and slowly push the syringe to drip the blood into the tube. c. The collected blood samples are left to stand at room temperature for 2 h d. After standing for 2 h, centrifuge the samples for 15 min (1000 rpm) to obtain plasma. e. The TH content and specific enzyme activity of plasma from the heart are measured using an ELISA kit.\n(B) Heart tissue sample Preparation: a. After blood collection, perfuse the heart with cold PBS immediately. b. Remove the heart quickly. c. Use ophthalmic scissors to crush the heart tissue, then whip the solution with an ultrasonic knife until the solution is uniform. d. Pre-cool the centrifuge to 4°C and centrifuge the samples for 20 min (12000 rpm). e. The TH content and specific enzyme activity of heart tissue are measured using an ELISA kit. ELISA, enzyme-linked immunosorbent assay; PBS, phosphate-buffered saline.\nFully moisten the needle with heparin to prevent blood clotting.\nInject the needle from the apex of the heart and draw blood as slowly as possible to keep the needle free of air.\nWhen transferring blood from the syringe to the centrifuge tube, avoid pushing the needle rapidly and allow the blood to drip slowly into the tube to minimize hemolysis.\nAfter standing for 2 h, centrifuge the samples for 15 min (1000 rpm) to obtain 0.75–0.1 mL plasma.",
    "Note: It is suggested to divide the plasma into multiple parts before storage. Blood samples can be stored for 24–48 h at 2°C–8°C, 1 month at −20°C, 6 months at −70°C. The sample cannot be repeatedly frozen and dissolved, otherwise the potency will quickly decrease. It is recommended to use fresh samples for testing and not store them for too long.\nPreparation of heart samples (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2792-Fig4.jpg\nFigure 4. Key procedures of verifying the distribution of β1-AR and the content of β1-AR and p-β1-AR in each heart chamber\n(A) 3.5% chloral hydrate intraperitoneally injected to anesthetize mice (for 20 g male DBA/1 mice, 8 weeks old, 0.30 mL of 3.5% chloral hydrate, 15 mL/kg body weight is recommended).\n(B) Key procedures for verifying the distribution and expression of β1-AR in RA, RV, LA, and LV: a. Perfuse the heart with cold PBS to rinse the residual blood, and then perfuse the heart with 4% PFA. b. Harvest the heart and saturate it in a 30% sucrose solution for 24 h c. Slice the heart into 15-μm-thick coronal slices with a freezing microtome. d. Immunohistochemically stained slices were photographed using an Olympus microscope and a laser confocal microscope. e. Representative image shows that β1-AR is preferentially distributed in RA, RV, LA, and LV.",
    "(C) Key procedures for measuring the content of β1-AR and p-β1-AR in H, RA, RV, LA, and LV: a. Perfuse the heart with cold PBS to rinse the residual blood. b. The heart of a mouse is carefully divided into four parts using a scalpel: RA, RV, LA, and LV. c. Use ophthalmic scissors to crush the heart tissue (H, RA, RV, LA, and LV) separately, then whip the solution with an ultrasonic knife until the solution is uniform. d. The obtained tissue homogenates from H, RA, RV, LA, and LV are centrifuged for 20 min (12000 rpm) to get supernatant. The supernatant is used for the measurement of the content of β1-AR and p-β1-AR. PBS, phosphate-buffered saline; PFA, paraformaldehyde; RA: the right atrium. RV: the right ventricle. LA: the left atrium. LV: the right ventricle. H: the whole heart. β1-AR: Beta receptor1. p-β1-AR: phospho-Beta receptor1.\nAfter blood collection, perfuse the heart with cold PBS and immediately take the heart sample.\nRemove the connective tissue from the surface of the heart, and wash it three times in PBS on ice until the PBS becomes clear.\nUse filter paper to absorb the surface and cavity fluid, and then weigh it.\nAdd a certain amount of PBS, for example, 0.15 g of heart is added with 0.15 × 5 mL, which is 650 μL PBS.\nUse an ophthalmic scissors to crush the heart tissue, then whip the solution with an ultrasonic knife until the solution is uniform.\nNote: This process will generate heat, and the single stirring time should not exceed 4 s. Then place it on ice to cool, and repeat 3–4 times until the homogenate is evenly mixed.\nPre-cool the centrifuge to 4°C and centrifuge the samples for 20 min (12000 rpm).",
    "Note: The heart extraction and homogenate preparation process is done on ice.\nELISA\nTiming: 3 h\nBalance the kit at room temperature for 15–30 min before use.\nNote: Store the kit in an environment of 2°C–8°C.\nTake out the required plate from the aluminum foil bag, and set the standard hole, sample hole, blank hole and multiple holes.\nNote: If the enzyme label coated plate is not used up after opening, the remaining plate shall be put into a sealed bag and stored away from light.\nAdd 50 μL standard solution of different concentrations to each standard hole. Add 50 μL tested sample with different dilution ratios to sample holes. Blank holes are not added.\nCritical: It is best to control the addition time within 5 min. If there is a large number of samples, it is recommended to use a row gun for addition.\nNote: If the content of the substance to be tested in the sample is too high, dilute it by a certain number of times with the sample diluent. The dilution times for this experiment are 2, 5, and 10 times.\nCover the reaction plate with a sealing film and incubate it in a 37°C water bath or incubator for 30 min.\nNote: The sealing film is limited to one-time use to avoid cross-contamination.\nAfter incubation, peel off the sealing film and discard the liquid.\nWash the plate.\nPat the plate dry on absorbent paper.\nWash each hole with 200 μL 1× wash buffer, let stand for 30 s.\nThen discard the solution, pat dry on absorbent paper, and repeat washing for 5 times.\nAdd 50 μL horseradish peroxidase labeled detection antibody to the standard holes and sample holes.\nNote: The sealing film is limited to one-time use to avoid cross-contamination.",
    "Incubate it in a 37°C water bath for 30 min, then discard the solution and repeat washing for 5 times.\nBefore adding the substrate, thoroughly pat the reaction plate dry on clean, chip paper.\nColor reaction.\nAdd 50 μL substrate A and 50 μL substrate B to each hole.\nCover the reaction plate with a sealing film.\nPlace it in the 37°C incubator, incubating it in dark for 15 min.\nNote: After adding the chromogenic agent, avoid light in the following procedure.\nTo stop the reaction, add 50 μL termination solution to each hole.\nRead the absorbance (OD value) on the enzyme marker within 15 min.\nNote: Measure the absorbance at 450 nm and 630 nm (background) respectively using Enzyme Labeling Instrument (Thermo Scientific 5250040) (Figures 3[href=https://www.wicell.org#fig3] and 4[href=https://www.wicell.org#fig4]).\nCritical: The final result is OD value(at 450 nm) minus OD value(at 690 nm) and takes the average with the corresponding multiple holes.\nECG recording\nConnect the machine in advance, including the monitor, limb leads, and software (Figure 5[href=https://www.wicell.org#fig5]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2792-Fig5.jpg\nFigure 5. Key procedures for ECG recording and the ECG characteristics of the DBA/1 mice\n(A) Place the mouse in a plexiglass chamber with a body restraint, and connect the clips of the electrocardiographic lead wires to the mouse limbs in sequence (Right forelimb: red; left forelimb: yellow; right hindlimb: black; left hindlimb: green).\n(B) Representative image of the DBA/1 mice with clips of electrocardiographic lead wires in place.\n(C) Representative image of recording ECG and collecting data in the DBA/1 mice. The parameters of the ECG recording are set as follows: the paper speed of ECG was 25 mm/s, and the standard voltage was 1 mV.\n(D) Electrocardiographic characteristics of the DBA/1 mice. ECG, Electrocardiogram.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2792-Fig6.jpg",
    "Figure 6. Protocol for the implantation of optical fibers and recording of calcium signals in bilateral LC\n(A) The location of the LC is determined according to the 4th edition of the mouse brain atlas and microinject (100 nL, at a rate of 40 nL/min) rAAV-DBH-GCaMP6m-WPRE-hGH pA at the stereotaxic coordinates of LC (AP-5.45 mm, ML±0.9 mm, DV-3.65 mm).\n(B) At the same coordinates, the optical fibers are implanted above LC for 0.10 mm (AP-5.45 mm, ML±0.9 mm, DV-3.65 mm).\n(C) Schematic illustration of calcium signal recording in DBA/1 mice infected with GCaMP6f in the bilateral LC.\n(D) The calcium signal data obtained were analyzed to show the activity of neurons in the LC and then perform the statistical analysis between the vehicle and experimental groups. LC, locus coeruleus.\nDisinfect the limb leads with alcohol before connecting them to increase the conductivity of the limb leads.\nFor ECG recording, place the mouse in a plexiglass chamber with body restraint, and attach the clips of the electrocardiographic lead wires to the limbs of the mouse in sequence.\nNote: Connect the electrocardiographic lead wires in the right order (Right forelimb: red; left forelimb: yellow; right hindlimb: black; left hindlimb: green). When connecting the limb leads, be careful not to pull the limbs of the mice too hard to avoid irreversible damage to the limbs of the mice (Figure 5[href=https://www.wicell.org#fig5]A).\nAfter connecting the ECG, wait the mice calm for 5 min before ECG recording.\nPerform the ECG recording once the mice had adapted to their situation (ECG-2303B, Guangzhou 3Ray Electronics Co., Ltd).\nFor DBA/1 mice in the different pre-treatment groups, ECG was connected at different times.\nIn the acoustic stimulation model, when S-IRA occurred during acoustic stimulation, immediately remove the mice from the isolation box and quickly connect limb leads.",
    "Note: The limb leads of the acoustic stimulation model DBA/1 mice must be connected quickly and timely, requiring two individuals if necessary, otherwise the ECG changes of mice with S-IRA could not be recorded.\nIn the PTZ model, after IP administration of PTZ, tape the mice into a plexiglass chamber with body restraint immediately and record the changes of ECG during the whole course of seizures.\nFor groups that received esmolol injection, perform ECG recording 10 min prior to IP injection of atomoxetine (15 mg/kg) and 10 min after acoustic stimulation or 1 h after IP injection of PTZ (75 mg/kg).\nPerform ECG recording at a speed of 25 mm/s and sensitivity of 10 mm/mV. Carry out arrhythmia analysis based on ECG features in humans and mice, as described previously.7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8],9[href=https://www.wicell.org#bib9]\nNote: Define three or more consecutive episodes of spontaneous ventricular electrical depolarizing activity as ventricular tachycardia (VT). Define the premature onset of the QRS complex (wide malformation) with no P wave before it as the ventricular premature beat (VPB). Define slower conduction velocity and longer P-R interval as I atrioventricular block (I AVB). The P-R interval is gradually prolonged until the P wave could not propagate down and the QRS complex disappears, or the P-R interval is stable and the P wave could not be propagated down, which is defined as II atrioventricular block (II AVB). Define the separation of the P wave from the QRS complex as III atrioventricular block (III AVB).\nThe paper output speed of ECG was 25 mm/s, the transverse interval was 0.04 s for each small grid, 0.2 s for each large grid, and the standard voltage was 1 mV (Figure 5[href=https://www.wicell.org#fig5])."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Behavior",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}