{
  "id": 9478,
  "origin_website": "Jove",
  "title": "Intact Histological Characterization of Brain-implanted Microdevices and Surrounding Tissue",
  "procedures": [
    "Solutions\nPhosphate  Buffered Saline (PBS) -  in g/l; 9 g NaCl, 0.144 g KH2PO4, 0.795 g Na2HPO4,  at pH 7.4\n4%  Formaldehyde -  in ml/l; 202 ml sodium phosphate dibasic solution (0.4 M Na2HPO4),  48 ml sodium phosphate monobasic solution (0.4 M NaH2PO4),  500 ml 8% formaldehyde solution, 250 ml Milli-Q DDi water, at pH 7.4\nHEPES  Buffered Hank's Saline with Sodium Azide (HBHS) - in g/l; 7.5 g NaCl, 0.3 g KCl, 0.06 g KH2PO4,  0.13 g Na2HPO4, 2 g glucose, 2.4 g HEPES, 0.05 g MgCl2  6 parts H2O, 0.05 g MgSO4 7 parts H2O, 0.165 g  CaCl2, 0.09 g NaN3 at pH 7.4\nWash  Solution (WS) -  1% Vol/Vol, Normal Goat Serum, 0.3% Triton X-100, in HBHS with sodium azide  (NaN3). Refrigerate the WS at 4 °C before use in subsequent steps.\nU2  Scale Solution - 4 M urea, 30% glycerol and 0.1% Triton X-100 17\nPROCEDURE\nAll experiments were done under the supervision of the Purdue Animal Care and Use Committee and the Laboratory Animal Program at Purdue University.\n1. Surgery\nVarious  aseptic surgical methods are compatible with the presented histological  method.  The use of a stereotaxic frame and  automated inserters are recommended to improve reproducibility and control of  the microelectrode  arrays (MEA) implantation angle with respect to  stereotaxic planes.",
    "Note:  In this  demonstration our surgical method is as follows: hold the rodent subject in  stereotaxic earbars while under isoflurane anesthetic (between 1-3%) carried by  medical grade oxygen.  Test for the lack  of a toe-pinch reflect in the rat or lack of a tail pinch reflex in the mouse  to confirm that the animal is fully anesthetized. Apply eye ointment and clean  the surgical site with three alternating washes of Betadine and ethanol. Wash  hands, dawn surgical gloves, hairnet, facemask and gown. Inject a bolus of  Lidocaine to numb the surgical area, create an incision using scissors or a scalpel,  clear periosteum with bone scraper and cotton applicators, and create a  craniotomy using a dental drill handpiece and drill bit.  Drive a single-shank MEA into the cortex  using a micromanipulator.  Have a  surgical assistant aid in maintaining aseptic surgery conditions and document  the progress of the surgery.\nFollowing  implantation of the MEA into the brain, collect images through a surgical  microscope to inform the eventual removal of the skull from around the  brain.  Implanted portions of the devices  will be preserved in situ.\nNote:  The  eventual collection of tissue with in situ devices relies on closely  matching the plane of device insertion with the plane of tissue  sectioning.  Detailed notes about the  device insertion plane relative to the brain are thus very important.\nAfter  device implantation, apply the silicone elastomer Kwik-Sil (WPI), around any  exposed MEA shanks or cabling, and allow to cure.  A sterilized plastic piece, such as a cut  pipette tip, may be used to help contain the silicone elastomer in a small well  around the craniotomy while curing.\nApply  a layer of two-part dental acrylic (\"Jet Liquid\" and \"Jet Powder\" from Lang  Dental) over the Kwik-Sil and any exposed skull.",
    "Note: In a later step, the headcap will be melted  through to allow for the implant to be separated from the skull. UV-curing  acrylic should be avoided over the Kwik-Sil and craniotomy, as this very hard  acrylic is difficult to remove later.   Visually opaque materials around the implant should also be avoided;  clear Kwik-Sil provides a view of the implant during subsequent steps of this  protocol.\nPerform  post-operative care procedures as per the local protocol of the animal welfare  regulations, and return ambulatory subjects to single-housed cage-boxes.\n2. Perfusion and Tissue Collection\nNote: See Gage et al.  for a detailed perfusion procedure walkthrough in the rat animal model19.\nUse  the anesthesia and perfusion protocol approved by the institution's animal care  and use committee.  After deeply  anesthetizing the rodent (confirmed by a lack of toe-pinch reflex in rat or  tail-pinch reflex in mice) and exposing the heart, make shallow scissor cuts  into the left ventricle and right atrium.   Insert a blunt needle into the left ventricle and deliver room temp  PBS.  Deliver a total of ~10 ml PBS at ~5 ml/min in mice and ~200 ml PBS at ~100 ml/min in rats.  Look for blood clearance from the liver during.\nInject  histologically relevant chemical labels transcardially, if so desired, by  syringe delivery with care taken to avoid introducing bubbles.\nNote: Vascular labels (e.g. DiI) and nucleic acid  counterstain dyes (e.g. Hoechst 33342) are examples of chemical labels  deliverable during perfusion.  When  administered properly, these histological markers should label the whole animal20.",
    "Deliver  buffered, room temperature, 4% formaldehyde transcardially to fix the  animal.  Avoid septum perforation across  the heart, which can be evidenced by lung-nose drainage during perfusion.  Look for fixation tremors in the large  muscles to indicate complete perfusion. Deliver a total of ~10 ml fixative at  ~5 ml/min in mice and ~200 ml fixative at ~100 ml/min in rats.\nFollowing  perfusion, decapitate the animal, expose part of the brain stem or cerebellum  using rongeurs or scissors, and place head in 4% formaldehyde solution for  overnight at 4 °C.\nWash  the head in three changes of PBS with one to four hour intervals between  washes.\nStore  fixed heads in HBHS containing sodium azide at 4 °C for days to months.\n3. Brain Removal with in situ Devices\nNote: Perform this section in a fume hood while  wearing appropriate personal protective equipment.  Avoid tissue desiccation by returning the  fixed head to HBHS solution periodically.\nCarefully  dissect away skin and other tissues from around the acrylic skull cap using  forceps and small scissors.\nWhile  wearing heat-insensitive gloves, use a soldering iron to remove dental acrylic  and expose an area of underlying clear Kwik-Sil (Figure 2a).\nNote: The goal of this step is to allow  micro-scissors an appropriate angle of access to positions where the implanted  devices enter the brain, so that brain-implanted components may be separated  from components secured to the skull.\nUnder  a surgical microscope, cut into the silicone elastomer with curved  micro-scissors, removing small pieces of Kwik-Sil with tweezers down to the  position where the devices enter the brain.",
    "Continue  cutting along the surface of the craniotomy with curved micro-scissors to  separate device components attached to polysilicon and skull from components  implanted in the brain.  Again use  microscope magnification and great care when cutting through the exposed device  components, taking care to avoid pushing or dragging the implants in the fixed  tissue.\nRemove  bone around the headcap with care using rongeurs.  Use a spatula to separate the brain with  implanted devices from the skull.  Store  the brain in HBHS solution until ready to slice.\nPlace  the brain in a glass Petri dish filled with HBHS, and use a razor blade to  remove extraneous tissue, such as spinal cord, cerebellum, or olfactory bulb,  depending on whether they are relevant to the location of the device  implantation.  Use a brain block (Ted  Pella) and razor blades to section the brain and create a flat plane closely  matching the angle of the implanted devices; this is accomplished by placing  the brain in an appropriately-sized brain block, orienting the brain such that  any visible portion of the implant is parallel with the razor blade guide, and  placing a razor blade in a blade guide at least 2 mm from the implant.  Press the razor blade through the  tissue.  Mount this surface to a  vibratome platform.  Alternatively, a  razor blade mounted to a micromanipulator can be used in a similarly controlled  fashion as the brain block to create a plane closely matching the direction of  the implant.",
    "Place  ice under the vibratome platform, and, after allowing the tissue surface to  briefly dry on a paper towel, adhere the brain to a vibratome using Super  Glue.  Glue the flat tissue plane created  in the previous step is to the stage.   With asymmetric tissue dimensions, orient the sample such that the  widest dimension is glued down parallel with the movement direction of the  vibratome blade to help avoid the blade potentially knocking the tissue  over.  After the glue sets (~1-2 min),  add chilled (~4 °C) PBS to the vibratome dish around the tissue.\nCollect  thick tissue slices between 200-400 μm, including control tissue, using the  maximum vibration rate (~100 Hz) and a slow blade progression rate (< 0.2 mm  per second), with a blade angle of 10 °   from horizontal.  Collect slices  carefully with a brush or scoop spatula and store in HBHS in a 24 well plate at  4 °C.\nOnce  the in situ device is visible to the unaided eye or a surgical  microscope, collect thinner sections to approach the device in slice increments  of 100 μm or less.\nNote: Typical silicon micro-implants are visible with  the unaided eye in formaldehyde-fixed rodent cerebral cortex tissue between 300  and 500 μm from the device surface.\nWith  the in situ device now close to the surface of the tissue, collect a  >250 μm tissue slice containing the device within.  Estimation of the necessary thickness can be  aided by referencing previously collected slices.",
    "Note: Larger devices, multishank devices, and angled  devices may require thicker tissue slices (>500 μm) to capture the device in  one tissue piece; remember that both the penetration of applied labels and the  microscopy imaging depth will be limited in the eventual data collection from  these very thick slices.  If possible,  avoid striking the device with the vibratome blade, as this can cause dragging  of the device through the tissue and morphological deformation.\n4. Tissue Processing and Clearing\nWash  slices 3x at 5 min per wash in HBHS\nIncubate  in sodium borohydride (5 mg NaBH4/ 1 ml of HBHS) for 30 min total  (15 min each side of the slice).  Flip  the slices using a stainless steel or Teflon coated micro spoon and small  paintbrush (Ted Pella).  Slow and  thoughtful movements improve the success of each slice flip.  Avoid touching any areas around the implanted  device with the brush.  When possible,  adding significantly more solution than required (>2 ml) allows one to  manipulate and flip the tissue slices more easily.\nNote: This step reduces endogenous autofluorescence;  skip this step if fluorescent labels were applied during perfusion or xFP  transgenic markers are present.\nWash  slices 3x at 5 min per wash in Wash Solution at room temperature.\nNote: Agitation during wash and incubation steps is  optional.  The authors speculate that  subtle jarring of the stiff implant with respect to the surrounding brain  tissue may occur with agitation.   However, an orbital mixer moving at a gentle rate (< 60 rpm) may  avoid this while increasing the movement of solutions.\nBlock  for 2 hr in Wash Solution at room temperature (flip slices after one hour).\nIncubate  in primary antibodies (diluted in Wash Solution) for approximately 48 hr (24 hr on each side of the slice) at 4 °C.",
    "Perform  6 quick 3 min washes with Wash Solution.\nPerform  6, 1 hr washes (3 washes on each side of the tissue slice) in Wash Solution  (store at 4 °C if washing overnight).\nIncubate  in secondary antibodies (diluted with Wash Solution) for approximately 48 hr  (24 hr on each side) in 4 °C.\nPerform  6 quick 3 min washes with Wash Solution.\nPerform  6, 1 hr washes (3 washes on each side) in Wash Solution; store at 4 °C if  washing overnight.\nRemove  Wash Solution and add the glycerol-based \"U2 - Scale\" clearing  solution.  Allow to clear approximately 1  week for thick slices (250-500 μm) or 2-3 weeks for very thick tissue sections  (>500 μm) at 4 °C.\nCover  plate with foil and store at 4 °C.\nMount  in slides accommodating thick tissue sections (Figure 2b, 2c) using clearing  solution as mounting media and sealing with clear nail polish.  Store at 4 °C away from light.\n5. Panorama Imaging of Full Tissue and Device Interface\nUsing  longer-working distance microscope objectives (> 2 mm), begin imaging with a  laser scanning confocal microscope or 2-photon microscope.  We will demonstrate with a Zeiss LSM 710,  Carl Zeiss \"Zen\" software (2010), and a computer-controlled XY translating  stage to image a 3D panorama around an implant.\nNote: Correct for the refractive index of the  clearing solution either in software, through a corrective collar on the  objective, or in data processing after collection. In this demonstration we  enter a refractive index value for the \"U2\" clearing solution of 1.4 into the  Leica Zen microscope software; this setting subtly adjusts z-step intervals to  account for refractive index mismatch.",
    "In  tissue near the device, roughly assess the appropriate z-axis window and data  collection settings in the z-dimension for each fluorescent channel using low  laser power (~0.5 to 5%) and large z-step sizes (>25 μm).\nNote: Include additional space above and below when  setting the z-axis when setting up for panoramic data collection, as the tissue  may not lie entirely flat on the slide glass (~20 μm each direction).\nSet  the objective at the x-y center of your eventual panorama; using the Zen  panorama software, determine the number of collection positions required for  each axis (x and y) to cover your region of interest.\nReassess  and finalize the z-axis collection window.\nManually  set the detector sensitivity and laser power to ramp appropriately with  increased depth; the aim is typically to maintain approximately the same image  intensity regardless of imaging depth into the tissue slice, but to also avoid  high background noise.\nCollect  each fluorescent image data series.  If  necessary to avoid overlapping signals, run laser lines sequentially.\nNote: If available, set the software to automatically  save data to the hard drive during collection.\nChange  the software settings to collect the \"reflectance\" and \"transmittance\" data,  and use a longer, more penetrative wavelength laser (e.g. 633 nm) to capture  these channels.  Determine the  appropriate laser power and detector sensitivity for \"reflectance\" and  \"transmittance\" collection and repeat the same collection series around the  implanted device.\nExport  the data for later processing, quantification, and analysis."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}