{
  "id": 12096,
  "origin_website": "Jove",
  "title": "Droplet Digital TRAP (ddTRAP): Adaptation of the Telomere Repeat Amplification Protocol to Droplet Digital Polymerase Chain Reaction",
  "procedures": [
    "1. Buffer preparation and storage\nPrepare 50 mL of 1x stock RNase-/DNase-free NP-40 lysis buffer (10 mM Tris-HCl [pH 8.0], 1 mM MgCl2, 1 mM ethylenediaminetetraacetic acid (EDTA), 1% [vol/vol] NP-40, 10% [vol/vol] glycerol, 150 mM NaCl, 5 mM β-mercaptoethanol, and 0.1 mM 4-benzenesulfonyl fluoride hydrochloride (AEBSF)). This buffer can be aliquoted and stored at -20 °C for future use. Avoid freeze/thaw cycles in order to obtain an optimal lysis of cells.\nPrepare 50 mL of 10x stock RNase-/DNase-free TRAP extension buffer (200 mM Tris-HCl [pH 8.0], 15 mM MgCl2, 630 mM KCl, 0.5% [vol/vol] Tween 20, and 10 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N′,N′-tetraacetic acid (EGTA)). This buffer can be aliquoted into 1 mL aliquots and stored at -20 °C for future use.\n2. Cell lysis\nPreparation of the cells\nThaw a frozen aliquot of NP-40 lysis buffer. Once thawed, place the lysis buffer on ice. Add phenylmethylsulfonyl fluoride (PMSF protease inhibitor) to the NP-40 lysis buffer to reach a final concentration of 0.2 mM.\n\t\tNOTE: This should be done immediately prior to lysing the cells.\nRemove any excess liquid from the collected cell pellets to ensure a dry cell pellet. Note that cell pellets, whether freshly collected or previously frozen (-80 °C or flash frozen in liquid N2), must not contain any leftover solutions from previous centrifugations as these solutions may interfere with downstream procedures.\nGrow, collect, and freeze both telomerase-positive and telomerase-negative cell lines (BJ fibroblasts, IMR-90 or U2OS) in order to use them as positive and negative controls. Use new control lysates every time the assay is performed to ensure assay reproducibility.",
    "NOTE: It is advised that a large culture of telomerase-negative cells is grown and aliquoted prior to freezing to remove any tissue-culture-related artifacts that may be introduced during the long-term culture of cell lines to help ensure reproducible results of the negative control sample.\nPlace the cell pellets on ice. If the cells were frozen, allow them to thaw briefly on ice.\n\t\tNOTE: Typical cell pellet sizes for the ddTRAP are between 500,000 and 1,000,000 cells. Smaller cell pellets may also be used if necessary, but the cell number must/ideally should be known. The ddTRAP can also be performed based on protein input using a BCA protein assay (input usually is 1 µg).\nLysing of the cells\nLyse the cells in the NP-40 lysis buffer. Maintain a cell equivalence of 25,000 cells/µL of buffer. For example, lyse a pellet (containing 1,000,000 cells) in 40 µL of NP-40 lysis buffer. Gently pipet the lysate up and down in order to break open the cells. Try to avoid making bubbles.\nAllow the cells to lyse on ice for 30 min. Make sure to gently vortex the lysate to prevent clusters of cell debris from forming. This can be done every 10 min and is meant to keep the lysate a homogenized mixture.\nDilute the cell lysate (25,000 cells/µL) 1:20 in NP-40 lysis buffer, making the new cell equivalence 1,250 cells/µL. For example, dilute 5 µL of cell lysate into 95 µL of lysis buffer.\n3. Telomerase extension reaction\nPrepare a master mix (Table 1) for the telomerase extension reaction (per reaction).\n\tNOTE: It is best to prepare the extension reaction master mix during the cell lysis and store it on ice.\n\t\nPipet 48 µL of extension master mix into each PCR tube.",
    "Add 2 µL of the diluted (1,250 cells/µL) lysate to the extension reaction. The total volume should now be 50 µL with a final cell equivalence of 50 cells/µL.\nPerform the telomerase extension reaction (Table 2).\nStore the telomerase extension products at 4 °C for up to 3–5 days; however, it is optimal to use the extension products within the first 24 h.\n4. Droplet digital PCR setup\nPrepare a master mix (Table 3) for the ddTRAP (per reaction).\n\tNOTE: Once the reagents are at room temperature, do not place them or the master mix on ice. Placing the mix on ice may increase viscosity and lead to poor droplet formation. The DNA polymerase in the ddPCR supermix is a hot start and should be stable at room temperature. The ddPCR supermix may be stored at 4 °C after an initial thaw from -20 °C.\n\t\nPipet 19.8 µL of ddPCR master mix into each PCR tube.\nAdd 2.2 µL of the extension reaction to each tube. Note that the total volume should now be 22 µL.\n\t\tNOTE: The total amount of sample needed for a ddTRAP is 20 µL (cell equivalence of 100 cells). The extra volume is a precaution for pipet error or sample loss.\nSet up the droplet generation cartridge.\n\tNOTE: The cartridge contains three different columns of wells that are labeled.\n\t\nLoad 20 µL of the reaction prepared according to step 4.1.2 into the sample well (middle well) in the cartridge. Avoid bubbles when pipetting the sample.\n\t\tNOTE: If there are bubbles, gently tap the side of the cartridge so that these bubbles come to the top of the solution.\nLoad 70 µL of droplet generation oil into the oil well (left well).",
    "NOTE: In order to avoid contamination, strictly use a separate set of pipettes and tips for ddPCR droplet generation steps. The order of loading the cartridge is important. The sample must be loaded prior to loading oil as oil is heavier and will fill the microfluidic chambers and lead to poor droplet formation. The minimum number of samples that can be run is eight. All wells of the cartridge must be loaded with the sample as any empty well will lead to a halt in the droplet generation from the droplet generator. If adequate samples are not available to load all eight wells within a cartridge, 20 µL of ddTRAP master mix (step 4.1) can be loaded into the remaining cartridges.\nSecure the gasket in place by tethering it to the ends of the cartridge.\n\t\tNOTE: The lack or improper placement of the gasket will prevent the generator from generating droplets.\nPlace the loaded and assembled cartridge into the droplet generator.\n\t\tNOTE: The cartridge is recognized by a magnet in the generator, which will inform the user when the cartridge is placed properly.\nRemove the cartridge once the droplets are generated and the cycle is complete (~60–90 s).\n\t\nGently remove the gasket from the cartridge. Pipet the newly generated droplets (right well), using a multichannel pipette, into a 96-well PCR plate.\n\t\tNOTE: The approximate volume for the newly generated droplet emulsion should be 40–43 µL.\nHeat seal the plate with aluminum foil PCR plate seals once all the samples are loaded in the 96-well plate in order to prevent evaporation during the PCR steps.\nLoad the 96-well plate into the thermocycler and perform the following PCR reaction (Table 4).\n\tNOTE: All ramp rates between the temperature steps must be set to 2.5 °C/s in order to properly heat the reactions.",
    "5. Detection of telomerase extension products\nLoad the 96-well plate in the droplet reader.\n\tNOTE: Make sure to orient the plate properly so that the A1 sample matches with that of the holder.\n\t\nOpen the software associated with the droplet reader. Double-click the first well A1 to open the sample/well editor screen.\nClick Experiment and select ABS from the drop-down menu.\n\t\tNOTE: Experiment defines the type of assay to be used (i.e., absolute quantification or gene copy number assay). ABS stands for absolute quantification.\nSelect QX200 ddPCR Evagreen Supermix to ensure that the correct detection method is employed by the reader. Click Apply in the lower right-hand side of the well editor screen to save the user-defined settings to all of the highlighted wells.\n\t\tNOTE: SUPERMIX defines the type of PCR mix and detection chemistry that will be read by the reader.\nClick on TARGET in the well editor screen of the software in order to define the sample.\nDefine the TYPE of sample by clicking the TARGET drop-down menu and selecting either unknown, reference, or NTC (no-template control).\n\t\tNOTE: Unknown would refer to an experimental sample, reference could be a control sample of known telomerase activity, and an NTC is a critical control for the determination of assay validity in terms of contamination and background signal.\nLabel all the samples in the Sample Name section and click Apply to ensure the highlighted wells are edited appropriately.\nClick Run to run/read the plate. Select either Columns or Rows in the RUN OPTIONS screen when prompted to inform the machine about the orientation the plate should be read in.\n6. Data analysis\nDetermine the number of accepted droplets for each sample by clicking on individual wells. Double-click the individual wells or column/row headers to view and analyze the sample data.",
    "NOTE: The most important criteria on whether or not to proceed with the analysis of a particular sample is the number of “accepted droplets”. For the ddTRAP, samples with 10,000 or more accepted droplets are valid for further analysis. Data can be provided to the user in many formats, including a .csv table, .jpg images, histograms, etc. There are many resources available for the in-depth analysis of ddPCR data, including the ddTRAP11,13. These resources offer a guide to analyzing ddTRAP data, from selecting thresholds11,13 to choosing samples for further analysis11,13, identifying false positives and negatives13, and general troubleshooting13.\nHighlight the wells representing sample replicates and NTC samples. Analyze the samples in comparison to either NTC or negative control lines, such as BJ cells (as listed above in step 2.1.2).\n\t\nManually set the threshold for the samples by clicking on the icon for setting thresholds on the bottom left of the screen. Set thresholds for each individual well or for multiple wells at a time (recommended).\n\t\tNOTE: If background is detected in the NTC, it can be subtracted from all of the other samples to ‘normalize’ the signal and ensure that only the true positive signal is analyzed. NTC values are typically in the 0.2–1 molecule/µL range for the NP-40 lysis buffer system. Other buffer systems and components would need to be tested (for example, CHAPS buffers).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}