{
  "id": 10076,
  "origin_website": "Jove",
  "title": "Aptamer-Based Target Detection Facilitated by a 3-Stage G-Quadruplex Isothermal Exponential Amplification Reaction",
  "procedures": [
    "See Supplementary Table 1 (the reaction set-up table) for tube preparation, including the specific volumes and concentrations of the reaction components. The protocol demonstrated here uses a preassembled detection platform kit as described in the Table of Materials. All the components must be kept on ice unless indicated otherwise.\n1. Preparation of ribozyme\nNOTE: The primary detection component is an allosteric (aptamer-regulated) ribozyme recognizing theophylline (see Supplementary Table 2).\nCollect 5 U of T4 polynucleotide kinase (0.5 µL, see Table of Materials) in a PCR tube, which will be used to activate the ribozyme cleavage products.\n\tNOTE: This component is added first so the user can see the correct dispensing of the enzyme.\nAdd 1 µL of preprepared 5x ribozyme buffer (see Table of Materials) to each sample tube (PCR tube).\nFor the purposes of visually demonstrating specificity, add 1.5 µL of 2 mM theophylline (target) or 2 mM caffeine (control) (see Table of Materials) to each sample tube as the test samples.\n\tNOTE: For establishing a standard curve, it is recommended to start at 3.125 mM analyte and test five-fold dilutions until 0.001 mM.\nMix each sample tube thoroughly by pipetting 5-10 times.\nAdd 2 µL of 600 nM RNA containing an aptameric domain specific to the target (see Table of Materials) to each sample tube to make a final concentration of 240 nM in 5 µL of test solution, then mix quickly by pipetting and place on a cold block to minimize the background signal.\n\t​NOTE: it is important to initially prepare all the reactions without ribozyme, as the self-cleavage reaction will begin immediately when ribozyme is combined with ribozyme buffer and may produce significant background.",
    "Once all the reaction tubes are prepared, incubate each sample (5 µL) at room temperature (23 °C) for exactly 3 min using a timer. Immediately return the sample tubes to ice (4 °C) after incubation.\n2. GQ-EXPAR\nAdd 3.5 µL of nickase-polymerase enzyme mixture (see Table of Materials) to each sample tube and mix well.\n\tNOTE: The required enzyme concentrations depend on the recognition sequences, types of enzymes, and reaction temperatures, the combination of which was empirically determined.\nAdd 31.5 µL of EXPAR reaction mixture containing template, nucleotides, and reaction buffer (see Table of Materials) to each sample tube and pipet to mix.\n\tNOTE: The component concentrations are optimized based on the enzymes and sequences of the polymerase products.\nOnce all the samples are prepared, incubate each prepared sample (40 µL) at 55 °C for exactly 5 min using a timer. If possible, incubate on a thermocycler, although a heated lid is unnecessary.\nImmediately return the sample tubes to ice (4 °C) after the incubation step.\n3. Color development\nAdd 2 µL of Hemin solution (25 uM, see Table of Materials) to each sample tube and mix well.\nAdd 58 µL of the commercially available TMB solution (see Table of Materials) to each sample tube and mix well.\nIncubate the color development reaction (100 µL) at room temperature for at least 3 min and up to 30 min.\n\tNOTE: (Optional) Color development can be stopped by adding 20 µL of 2 M sulfuric acid.\nRead the samples qualitatively by eye, or quantify the results using an absorbance plate reader at 450 nm if the color development reactions are stopped using sulfuric acid.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}