{
  "id": 6415,
  "origin_website": "Bio",
  "title": "Cytotoxicity Assay for Detection of Cereulide Produced by Emetic <em>Bacillus cereus</em>",
  "procedures": [
    "Cereulide sample preparation (B. cereus culture and growth conditions)Inoculate 3 ml LB medium with B. cereus and incubate at 30 °C, 150 rpm for 16 h (pre-culture). After 16 h, determine the cell count (CFU/ml) of the pre-culture with a counting chamber appropriate for bacteria (e.g. Helber counting chamber). Inoculate 100 ml LB in 500 ml baffled flask with 103 CFU/ml (approx. 1:10,000 dilution; i.e. add approx. 100 μl of 1:100 dilution of bacteria to 100 ml LB). Incubate at 30 °C, 150 rpm for 24 h.Cereulide accumulates to stable levels after 24 h of cultivation at 30 °C (Frenzel et al., 2011). Withdraw 1-2 ml samples of B. cereus cultures and autoclave in safe seal tubes (17 min at 121 °C). This step will denature heat-labile enterotoxins and proteases, whereas cereulide remains stable. Store samples at -20 °C. The remaining part of the B. cereus culture is autoclaved (17 min at 121 °C) and disposed.HEp-2 cell based cereulide cytotoxicity assayimgsrc:https://en-cdn.bio-protocol.org/attached/image/20130112/20130112081506_8343.jpgFigure 1: Example for setup of cereulide cytotoxicity 96-well assay plate. MEM = MEM-Earle HEp-2 medium with ethanol; val = valinomycin (5 μg/ml); green= background control wells; orange = 100% cell viability wells without test substance.Maintain HEp-2 cells as monolayers in 75 cm2 tissue culture flasks at 37 °C in a 5% CO2 atmosphere. Routinely grow HEp-2 cells in 25 ml MEM-Earle HEp-2 medium and sub-culture cells 1:4 approximately every 2-3 days when they reach 70-80% confluence. To detach adherent cells for sub-culturing, add 5 ml of trypsin/EDTA solution and incubate for 5-10 min at 37 °C. Add 5 ml of MEM-Earle HEp-2 medium and resuspend detached HEp-2 cells. Centrifuge cells (5 min, 150 x g, room temperature) and resuspend pellet in 10 ml MEM-Earle HEp-2 medium.",
    "Split cells 1:4 in new tissue culture flask containing 25 ml MEM-Earle HEp-2 medium.If cells from point 2a) reach 70-80% confluence, cytotoxicity assay can be performed. Add 90 μl of MEM-Earle HEp-2 medium with ethanol to wells A1 to H1 of a 96-well cell culture plate (see Figure 1). Fill the remaining wells with 50 μl MEM-Earle HEp-2 medium with ethanol. Dilute valinomycin stock solution (50 μg/ml) 1:10 with MEM-Earle HEp-2 medium with ethanol. Add 10 μl in wells B1 and C1 (final concentration is 500 ng/ml). Two additional samples (prepared as described in point 1 and stored at -20 °C) can be tested on this plate: add 10 μl of sample 1 to wells D1 and E1; add 10 μl of sample 2 to wells F1 and G1. Rows A and H remain free of samples (background control wells).Mix samples and medium thoroughly by repeated pipetting using a multichannel pipet. Remove 50 μl of the wells and perform serial dilutions (1:1) of the samples to column A10-H10. Columns 11 and 12 remain free of sample (100% cell viability control wells). Remove growth medium from a HEp-2 culture flask containing a 70-80% confluent monolayer. Wash the cells with 5 ml PBS. Add 5 ml of trypsin/EDTA solution and incubate for 5-10 min at 37 °C.Add 5 ml of MEM-Earle HEp-2 medium and resuspend detached HEp-2 cells. Centrifuge cells (5 min, 150 x g, room temperature) and resuspend pellet in 10 ml MEM-Earle HEp-2 medium.Determine cell count with counting chamber. Adjust the cells count to 3.4 x105 cells/ml. Dispense 150 μl of cells per well (~5 x 104 cells/well). Incubate plate for 48 h at 37 °C in a 5% CO2 atmosphere.",
    "To save WST-1 reagent, discard 100 μl of culture medium from each well and add 10 μl of WST-1 reagent to the remaining culture to detect mitochondrial activity of HEp-2 cells. Rows A and H remain free of WST-1 for calculation of the background value. Shake plate to distribute proliferation reagent uniformly and incubate plate for 20 min at 37 °C in a 5% CO2 atmosphere. Shake plate thoroughly and measure absorbance in a microplate reader at 450 nm.Calculation of cereulide amountsImport raw data from absorbance measurement to calculation/statistics program (e.g. Microsoft Excel).Perform background subtraction on all wells with the mean of the background control wells (Rows A and H; see Figure 2). Calculate dose-response curve for the internal standard valinomycin [Percent viability inhibition = (mean absorbance test wells /mean absorbance 100% cell viability control wells) x 100]. Determine the 50% inhibitory concentration for valinomycin by linear regression. Calculate dose-response curves for samples as given above. Determine the 50% inhibitory concentration for samples (presented by the reciprocal value of the sample dilution that resulted in 50% loss of mitochondrial activity). Calculate cereulide amounts as valinomycin equivalents (VE) by extrapolating the absorbance value at 50% cell viability inhibition to the dose response curve for valinomycin. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130112/20130112081119_9677.jpgFigure 2. Example for calculation of cereulide concentrations (given in valinomycin equivalents) from dose-response-curves plotted in Microsoft Excel"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}