{
  "id": 8726,
  "origin_website": "Jove",
  "title": "The Combined Use of Transcranial Direct Current Stimulation and Robotic Therapy for the Upper Limb",
  "procedures": [
    "This protocol follows the guidelines of our institution's human research ethics committee.\n1. tDCS\nContraindications and Special Considerations\n\tNote: tDCS is a safe technique that sends constant and low direct current through the electrodes, inducing changes in neuronal excitability of the area being stimulated.\n\t\nPrior to device setup, confirm that the patient does not have any contraindications to tDCS, such as adverse reactions to previous tDCS treatment, implanted brain medical devices, or the presence of metal implants in the head.\nUse the following inclusion criteria: subacute and chronic stroke patients with light to moderate upper-extremity hemiparesis. Other contraindications include skull defects, which could alter intensity and location of current flow, and subjects must be free of unstable medical conditions such as uncontrolled epilepsy.\nInspect the patient's scalp thoroughly for cutaneous lesions, such as acute or chronic skin disorders, cuts, or other inflammatory signs. Avoid placing the electrodes and stimulating areas with such lesions as a safety precaution.\nMaterials for tDCS\nCheck if all the following listed materials are available (Figure 1) before starting the procedure: tDCS stimulator device, 9 V battery, 2 conductive electrodes, 2 sponge electrodes, cables, 2 rubber head bands (or Velcro straps, non-conductive straps), sodium chloride (NaCl) solution, measuring tape\nMeasurements\nElectrode sites are usually defined as 10/20 EEG positions, as described in a previous publication20. Make sure the subject is comfortably seated.\nFirst, localize the vertex (Cz).\n\t\t\nMeasure the distance from the nasion (bridge of the nose or intersection of the frontal bone and two nasal bones) to the inion (external occipital protuberance or most prominent projection of the protuberance), and mark 50% of this length. Mark this preliminary Cz location as a line, using either an oil pencil or nontoxic water-based marker.",
    "Measure the left and right pre-auricular points distance (i.e., the area anterior to the tragus). Divide this distance in half and mark the calculated point with a line.\nConnect both lines to create a cross. The intersection of both lines will correspond to the vertex (Cz) (Figure 2).\nIdentify the target site on the head.\n\t\tNOTE: Anodal stimulation increases the cortical excitability in the stimulated brain tissue, while cathodal stimulation decreases it. Previous studies have used anodal stimulation in the lesioned hemisphere or cathodal stimulation in the contralesional hemisphere in order to decrease cortical excitability in the unaffected motor cortex and increase it in the affected motor cortex. In this protocol, we will describe both bihemispheric stimulation (with both anodal and cathodal stimulation in the same session) and anodal stimulation over the primary motor cortex.\n\t\t\nTo locate the primary motor cortex (M1), use 20% of the distance from Cz to the left or right pre-auricular point (Figure 3). This area should correspond to the C3/C4 EEG location.\nPlace the anode over the center of M1 motor cortex of the ipsilesional hemisphere and the cathode over the contralateral supraorbital region (Fp) (Figure 3).\nAlternatively, place the anode over the center of M1 motor cortex of the ipsilesional hemisphere and the cathode over the contralesional M1. The M1 positions for the tDCS electrodes are located at channels C3 and C4 (Figure 3).\nSkin Preparation\nInspect the skin and avoid stimulating over lesions or damaged skin.\nMove the hair away from the site of stimulation to improve conductance. Clean the surface of the skin, removing any signs of lotion and gel. For subjects with thicker hair, using conductive gel may be necessary.\nElectrode positioning and device setup20",
    "After preparing the skin and localizing the stimulation site, place one head strap under the inion, around the head circumference. Provide head straps made of non-conducting and non-absorbent material such as elastic, Velcro, or rubber straps.\nSoak the sponges with saline solution. For a 35 cm2 sponge, approximately 6 mL of solution per side may suffice. Avoid oversoaking the sponge. Avoid producing fluid leaks over the subject. If necessary, use a syringe to add more solution.\nConnect the cables to the tDCS device. Make sure the polarity of the cables is correct, since the effects of tDCS are polarity-specific (as standardized: red corresponds to the anode electrode, and black or blue corresponds to the cathode electrode).\nInsert the connector cord pin securely into the conductive rubber inset.\nInsert the conductive rubber inset into the sponge. Ensure that the entire conductive rubber inset is covered by the sponge and that the connector cord pin is not visible.\nPlace the first sponge electrode under the head strap and ensure that excessive fluid is not released from the sponge.\nConnect both elastic head straps, according to the electrode montage planned.\nPlace the second sponge electrode on the head over the area being stimulated, under the second elastic head strap.\nIf the overall electrical resistance of the electrodes and body is high, it may indicate inadequate electrode set-up. Some devices provide resistance measuring, which should be under 5 kΩ, ideally.\nSome devices provide a continuous indication of resistance during stimulation, which is a useful way to detect potentially hazardous situations (such as a dry electrode). In such cases, the device may finish or reduce the stimulation intensity if resistance increases beyond a certain threshold.\nStimulation\nMake sure that the patient is awake, relaxed, and seated comfortably during the procedure21.",
    "Adjust the tDCS stimulator settings (intensity, time, and sham condition, if applicable). In accordance with previous studies, apply direct current for 20 minutes at an intensity of 1 mA.\n\t\tNOTE: For sham intervention, the current is usually applied only for the first 30 s to give the subject the sensation of stimulation. This duration has been established in several studies as being effective in blinding them to the assigned intervention, without stimulating cortical excitability22.\nInitiate the tDCS stimulation. Start the current flow by ramping up the current to avoid the most adverse effects. Ramping up is automatically done on some devices, but if it is not, increase the current slowly during the initial 30 s to reach the maximum programmed current (in our protocol, up to 1 mA).\nAfter starting the electrical stimulation, some patients may perceive temporary slight itching sensations, dizziness, or vertigo. This can be avoided by ramping the current up and down at the start and end of each session.\nAt the end of the procedure, gradually ramp off the current for 30 s.\nAfter the procedure\nTo record and evaluate the safety of the stimulation, ask the patient to fill out a questionnaire of common adverse effects and their intensities after the procedure is done. These may include skin irritation, nausea, headaches, burning sensations, dizziness, tingling, or other discomforts.\nExplain to the patient that any possible side effects are usually of mild or moderate intensity and usually temporary.\nAfter tDCS, refer the patients to undergo robotic therapy.\n\t\tNOTE: In the next sections of this protocol, we will describe the use of the commercial versions of the MIT-Manus and T-WREX.\n2. Robotic Therapy with MIT-Manus\nPositioning",
    "NOTE: This robot is an interactive robot for rehabilitation of the upper limb. The version utilized in our study allows training of wrist movement in the horizontal plane (planar).\n\t\nMake sure the subject is seated in a comfortable and ergonomic chair, secured by a four-point seatbelt, and facing the video screen.\nMake sure that a trained therapist is supervising the robotic training.\nPlace the hand that will be subject to training into the grip of the robotic handle. Adjust both straps around the subject's arm. Adjust the support on the back of the arm so that it stays stable during training.\nPlace the paretic upper extremity as indicated: shoulder in a 30° flexion, 90° elbow flexion, forearm in mid-prone position, wrist in neutral position.\nDuring machine operation, make sure movement of the shoulder joints and elbow range is limited to about 45°. Make sure that the arm is immobilized, and the wrist has freedom of movement. Movement is possible in the horizontal plane (in all possible directions).\nTraining\nThe number of movements in a robotic training session is variable; however, it is common to perform about 320 repetitions in every possible direction of a plane within a same plane.\nThe video screen shows cues of the tasks that the subject needs to perform and gives constant feedback of the position of the arm.\nThe robot's software has several therapeutic exercise games for motor training. The visual feedback usually consists of a yellow ball that the patient must move between targets. Other training scenarios are available.",
    "The robot will only assist the patient if necessary; for example, if the subject cannot realize the intended movement within 2 s, the machine will help complete its movement. If the subject does not have enough motor coordination to carry out the intended movement, the robot will guide the subject's arm to perform the appropriate movement.\n3. Training with MIT-Manus Arm\nNote: This robotic arm allows training of elbow flexion and extension, shoulder protraction and retraction, and shoulder internal and external rotation on a horizontal plane.\nPositioning\nFor the MIT-MANUS Arm, make sure the subject is seated comfortably. Adjust the seat belts accordingly. Position the patient's right or left arm on the robot and adjust both straps.\nAdjust the robot's height as necessary. Adjust the table height as necessary.\nIf there is any discomfort or pain, press the emergency stop button to turn off the robot immediately.\nTraining\nCalibrate the machine by asking the subject to move its arm along the lines.\nThe robot will only assist the patient if necessary. For example, if the subject cannot realize the intended movement within 2 s, the machine will help complete its movement. If the subject does not have enough motor coordination to carry out the intended movement, the robot will guide the subject's arm to perform the appropriate movement.\n\t\tNOTE: The robot's software has several therapeutic exercise games for motor training. The visual feedback usually consists of a yellow ball that the patient must move between targets. Other training scenarios are available.\n4. Training with T-WREX\nPositioning\n\tNOTE: The T-WREX consists of an exoskeleton that fits the subject's arm and allows free movement of the shoulder, elbow, and wrist joints in a tridimensional setting.",
    "Ensure that the subject is seated in a comfortable and ergonomic chair facing the video screen, which provides visual and auditory feedback in a virtual reality setting, helping the patient achieve his or her goal.\nPlace the patient seated in front of the robot's main module. Use the provided remote control to adjust the exoskeleton's height accordingly. Adjust the robot's exoskeleton arm to the corresponding side of the patient's limb that will be trained (either left or right).\nLeave about 4 fingers of height above the shoulder.\nAdjust the patient's limb into the exoskeleton, adjusting the straps on the arm and forearm.\nAdjust the length of the exoskeleton's arm and forearm accordingly, as well as the weight (gravity) compensation necessary for the arm (A to I) and forearm (A to E). It consists of a linear scale of gravity support, where A has no gravity support.\nInput these measurements to the computer.\nBefore starting the training, adjust and calibrate the range of motion limits of the robot, according to the patient's capabilities.\nTo test the calibrated range of motion, ask the patient to move the cube in all directions of the screen.\nTraining\nIn each session, have the individual perform about 72 repetitions of the movement towards different functional targets (a T-WREX training session usually lasts about 60 min).\nBetween each movement, allow a 10-second interval to prevent fatigue. The 72 repetitions are divided into 3 blocks of 24 movements each. Allow an interval of 5 min between each block of 24 movements.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}