{
  "id": 8350,
  "origin_website": "Jove",
  "title": "Preparing Adult Drosophila melanogaster for Whole Brain Imaging during Behavior and Stimuli Responses",
  "procedures": [
    "All steps are performed under a stereomicroscope.\n1. Preparing the holder\nPrint the holder ‘FlyholderVJove.stl’ (see Supplementary Material) with a 3D printer or have it printed using online services (Figure 1A). Both SLS (Nylon PA12) and multijet fusion (PA12) are suitable.\nCreate the head slot.\n\t\nPlace a piece of sticky tape rectangularly on a flat surface. Cut a slice of approximately 5 mm x 1 cm. Cut the neck slot (~400 x 400 µm) in the middle of the longer side of the tape using fixed parallel blades (two scalpel blades stuck together) to ensure the same width in every holder (Figure 1B).\nPlace the tape over the flatter side of the hole in the holder on the bottom side (see Figure 1C and Figure 1D). The tape can be deformed by pushing it down with forceps ~500 µm around the hole; this will further minimize hindering later fly movements.\nCover the tape and the holder from the top with black nail polish to prevent the buffer from leaking out. The black nail polish will also protect the fly’s eyes from the excitation light of the microscope. Let the nail polish dry at least an hour before using the holder.\nOnce the nail polish is dry, add ~1 µL of grease in the head slot using a rolled tissue to ensure the glue will not wet the back of the fly’s head (Figure 2A). Make sure not to put grease outside of the slot that would prevent the glue from sticking.\nCreate the body slot (Figure 2B).",
    "Optionally, prepare the tape that will be used to position the fly’s body (see below) in advance. Use the design shown in Figure 2B (top) to cut a piece of ~2 cm wide tape in two and cut 1.5 mm wide slices. Cut out 0.3 mm deep shoulders and body slot. Make sure that it fits the holder.\n\t\tNOTE: The variability between fly sizes (in particular with sex, age, genotype or species) can make it necessary to adjust the tape design. If the head tends to be ill-centered, it can be helpful to add a V-shaped piece of tape temporarily over the neck slot (Figure 3). Also apply a few microliters of grease inside the neck slot and on the V-shaped tape.\n2. Placing the fly\nNOTE: One to four days old female flies are ideal because the female head is bigger and thus easier to dissect than the male head, and younger flies have softer cuticle. For walking experiments the activity of the fly can be increased by matching the experiments with times of higher circadian activity (ZT0 or ZT11), by using saline containing glucose (such as 103 mM NaCl, 3 mM KCl, 5 mM TES, 8 mM trehalose 2 H2O, 10 mM glucose, 26 mM NaHCO3, 1 mM NaH2PO4, 2.5 mM CaCl2·2 H2O, 4 mM MgCl2·6 H2O), by starving the fly up to 24 h with a water only environment, and by heating the environment to ~28 °C during the experiment. Clipping the wings at least one day in advance also helps to decrease attempts to fly and thus increase the frequency of walking bouts7,29,30.\nFill a Petri dish or pipette tip box lid with ice, place a laboratory tissue on top of the ice and set the holder upside down on it.",
    "Transfer a fly on ice to paralyze it by sucking it from its vial into a tube and blowing it onto the ice (make sure the ice is not melted which would drown the fly).\nWhen the fly stops moving, use dull forceps to slide it into the holder with the neck inside the slot (the fly can be held at the basis of the wing) as in Figure 4 (left). The eyes should be at equal positions in respect to the sides of the slot (Figure 4, middle). If needed, add 1 µL grease on the top of the head to prevent the glue (see next step) from reaching the back of the head and remove later.\nCover the body with a tissue and some ice to make sure the fly does not move during this step and the next (Figure 4, right). Another option to prevent the legs from reaching the head is to use a piece of tape just below the head (see Figure 6).\n3. Securing the head\nPlace the head at a ~20° angle from a fully posterior view (around the lateral axis, see Figure 5A). This is a compromise between decreasing the depth to image and on the other side maintaining the front leg free to move and minimizing the stretch of the neck.\nWith a rolled-up tissue (Figure 5B), put UV-glue around the head while avoiding soiling the sensory area of interest (antennae, proboscis and/or eyes). For taste experiments, pull the proboscis out and add glue at its base to prevent movement. If no taste experiment is planned, the proboscis is best pushed into the head and fixed with glue to minimize movement (Figure 6).",
    "Cure the glue with UV-light for 5 s. Carefully clean the surrounding of the head with a rolled-up tissue to remove remaining liquid glue that could stick to the legs and/or soil sensory areas.\n\tNOTE: The tape can be roughed with sandpaper to increase glue adhesion if necessary.\nUse a thin strip of tape or a rolled-up tissue to move the legs to the front (if they are not already), so they will not be damaged by the next step.\n4. Positioning the body\nNOTE: This step needs to be performed fast; before the fly recovers from anesthesia.\nRemove the ice container and turn the holder around. Remove the water around the fly with a tissue.\nPlace the body slot tape (created in step 1) over the hole and gently push the fly’s body down (Figure 7). Be careful to not stretch the neck too much.\n5. Sealing the hole\nCover any remaining large holes with tape.\nAdd ~1 µL of grease to the back of the head and in the neck area to make sure no glue will wet there.\nWith a rolled-up tissue, paint UV-glue around and on top of the tape and on the thorax (upper dorsal part of the mesonotum) to fix it. Cure the glue with UV-light for ~5 s.\n\tNOTE: It is important to minimize the use of UV light as it can strongly affect the fly’s health.\nCarefully clean grease and uncured glue with a laboratory tissue.",
    "Put ~1 mL of saline on top of the head. Push air bubbles aside with forceps. Look for leaks by placing a coverslip over the saline and turning the holder around to check for saline on the front side. If there are any leaks, remove the saline and fix the hole (either by adding more glue or more grease).\n\tNOTE: This can be a good time to pause if necessary. The fly can be offered a small piece of tissue or Styrofoam ball to walk on to prevent flailing and calm the fly down.\n6. Dissecting the head\nNOTE: Use sharpened forceps for the following steps. Very fine forceps are critical as dull forceps will make it more difficult to open the head cuticle and may lead to additional injuries on the fly’s head or brain. Strong magnification can help at this stage. To that aim, one can replace the oculars of the binocular microscope with 30x oculars.\nMake two cuts at the base of the central dark cuticular triangle on each side of the neck (see crosses in Figure 8A).\nCut around the dark triangle and remove this part of the cuticle.\nThe hole in the brain through which muscle 16 and the esophagus go should now be visible and move rhythmically (Video 1 presents this rhythmic movement in a fly with fluorescent muscles). Carefully pinch the top of this area to cut muscle 16 without puncturing the esophagus. If the rhythmic movement of the brain stopped, muscle 16 was likely removed, however, the movement sometimes pauses and restarts later. It is thus important to pay attention to rhythmic movements and perform this step again if necessary.",
    "Cut the remaining cuticle in small pieces and remove them carefully. Try not to pull on the cuticle too much. Instead use the forceps like a pair of scissors, to cut pieces of tissue. One can start on the medial edges, where the dark triangle was removed before and work one’s way to the sides.\n\tNOTE: Pieces of cuticle can be used to gently scrape of fat bodies if present.\nRemove the air sacks one piece after the other by grabbing them with the forceps and pulling slowly and steadily."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}