{
  "id": 12067,
  "origin_website": "Jove",
  "title": "E-Patient Counseling Trial (E-PACO): Computer Based Education versus Nurse Counseling for Patients to Prepare for Colonoscopy",
  "procedures": [
    "The study is authorized by the ethics review board of the Radboud University Medical Center (#2015-1742). Subsequent approval of the executive boards from each of the participating institutes is obtained (Trial registration: Dutch Trial Registry, NTR 5475).\n1. Enrolling patients in the trial/randomization\nApproach all referred patients by general practitioners, surgeons or internal medicine specialists for colonoscopy, to achieve a diverse sample.\nContact all eligible patients for inclusion by the outpatient’s clinic assistant by telephone call or face-to-face contact with the patient in a protocol led manner (described below).\n\t\nSay the following: Good morning/afternoon, you are speaking to the gastroenterology department of the trial center. You have been referred for colonoscopy, correct? We have to inform you prior to the examination. Do you have a computer/tablet/smart phone with internet access? (If not, do you have a peer who does?) We have the possibility to give you the information using an internet-based application. This is subject to our scientific research, comparing the novel method to a traditional visit of the outpatient’s clinic. If you cooperate in this trial, you will have to answer several questionnaires in the process. We also use information from your patient record. If you agree, we will randomize the method of education; either digital or nurse counseling. If no, reason for declining is noted. Negative answers are categorized in reasons to decline participation. If yes, can I have your e-mail address?\nRandomize patients to the intervention or control group per center after obtaining permission.\n\tNOTE: This is linked to the invitation that is sent out; patients are asked for their e-mail addresses, linked to their patient identification number. The automated HTML script then randomly decides which invitation is being sent (nurse visit or computer-based education). The outcome is visible to the assistant.",
    "Make sure that the patient reads the automatically sent email with instructions regarding more information on the trial. Here, digital informed consent for trial participation is obtained.\n2. Baseline questionnaire\nSubject the patient to the intervention or control group after randomization. Make sure that the patient completes the first questionnaire, containing baseline characteristics, several validated tools such as the RAND-36, PAM-13, e-Health Literacy Scale and the STAI.\n3. Intervention arm: patient is prepared with computer-based education\nMake sure that the patient receives the interactive CBE via e-mail.\n\tNOTE: Current best practices are implemented in the design, including the use of plain language, good accessibility and obligatory interaction to engage users7. The used CBE is a web-based platform, mimicking the patient journey with specific video guided by voiceover, supported by photos, three-dimensional animation and instructive texts.\nConduct a dedicated video and photo shoot specific for each separate endoscopy unit in the trial following a uniform script. (Figure 1, the CBE used in one of the trial sites is accessible via https://trials.medify.eu/cbe-colonoscopy). Divide the video in short clips, with a maximum duration of 45 seconds. Implement a mandatory mouse-click after each item to ascertain interaction in the CBE. Ensure that the tool contains all elements that are obligatory for informed consent such as risks, benefits and alternatives for colonoscopy.\nHave the patient complete the CBE.\n\tNOTE: The following steps (under tab 3.3) are mandatory for the patient to follow in the CBE.\n\t\nClick on the link in the email: https://trials.medify.eu/cbe-colonoscopy.\nEnter the main menu of the CBE. First, read the pop-up with instructions how to use the CBE.\nClick on the tab Explanation of colonoscopy procedure.\nRead the text on slide (1/21): How do you prepare for the examination? After finishing, click Next.",
    "Play the video on slide (2/21): Just before the examination. The video voiceover will say: “Welcome to the hospital, where the examination of your large intestine will take place. It is important that you are here 30 minutes before the examination is due to start. You check in at the endoscopy center reception and take a seat in the waiting room. A department staff member will pick you up from the waiting room. The telephone number of your contact person is noted to let them know when you can be picked up again.” After finishing, click Next.\nPlay the video on slide (3/21): Preparation for the examination. The video voiceover will say: “In the preparation room, you will have an intake discussion with a nurse with the help of the COW (computer on wheels). Your name and date of birth are verified and your medical information checked. You will receive a wrist band with your patient information on it. Then an IV needle is inserted into your arm. The pain killer and, if applicable, the sedative will be administered via this IV needle.” After finishing, click Next.\nPlay the video on slide (4/21): Preparation for the examination. The video voiceover will say: “The nurse will ask you to take off your trousers/skirt/dress and underwear. You can place your belongings under the bed. You lay down on the bed. You are now ready to be taken to the endoscopy room.” After finishing, click Next.",
    "Play the video on slide (5/21): The endoscope. The video voiceover will say: “The tube with which we will perform the examination is called an endoscope. It is first thoroughly cleaned and kept in a special clean cupboard. The clean endoscope is fed into a box, the cover of which is closed with a cable tie. In accordance with requirements, the endoscope is always checked before the examination starts.”. After finishing, click Next.\nPlay the video on slide (6/21): Meeting the doctor. The video voiceover will say: “In connection with the sedative, it is important to monitor your blood pressure, heart rate and the oxygen saturation in your blood. You will have a small clip on your finger and a blood pressure meter on your arm. Then you will meet the gastroenterologist or resident gastroenterologist who will perform the endoscopy.” After finishing, click Next.\nPlay the video on slide (7/21): Time out procedure. The video voiceover will say: “Before the procedure actually starts, a time out procedure takes place. The doctor and nurse will run through a list of control questions with you. You can also ask questions at this time.” After finishing, click Next.\nPlay the video on slide (8/21): Sedative. The video voiceover will say: “To alleviate the pain, you will receive a pain-relieving medicine, sometimes in combination with a sedative, administered via the IV needle. You will get a bit sleepy, which will help you relax and make the examination easier for you. This is not an anesthetic. It may cause you to be a bit forgetful for the rest of the day. Due to the medication administered, it is important that you do not drive a vehicle or drink alcohol for twenty four hours after the examination.” After finishing, click Next.",
    "Read the text on slide (9/21): Location of the intestines. After finishing, click Next.\nLook at the automated 3D animation in the background, centering the intestine. Drag to rotate the 3D image. Read the text on slide (10/21): Small intestine. After finishing, click Next.\nDrag to rotate the 3D image. Read the text on slide (11/21): Large intestine. After finishing, click Next.\nDrag to rotate the 3D image. Read the text on slide (12/21): Continuation of large intestine examination. After finishing, click Next.\nLook at the automated 3D animation in the background, centering the anus. Read the text on slide (13/21): Alternative examination. After finishing, click Next.",
    "Look at the automated 3D animation in the background, entering the colon. Play the video on slide (14/21): Air infusion. The video voiceover will say: “The examination usually takes half an hour. You lie on your left side and the lights are dimmed during the examination. The endoscope is inserted carefully. Then air, or actually carbon dioxide gas, is blown into the intestine. The endoscope is pushed forward to the end of the large intestine. During the withdrawal of the endoscope, the intestinal wall is thoroughly inspected. The doctor may remove small pieces of intestinal tissue or polyps. It may be necessary for you to change your position during the examination. The nurse may occasionally press on your stomach to prevent the endoscope from slipping out of place. In order to ensure that your intestine cramps as little as possible, a medication is often given to relax the intestine. This may cause you to have a dry mouth and your heart may beat faster. After the examination, we place the used endoscope back in the box and it is covered with a lid before the scope is taken away to disinfection..” After finishing, click Next.\nRead the text on slide (15/21): Examination technique. After finishing, click Next.",
    "Look at the automated 3D animation in the background, centering a polyp. Play the video on slide (16/21): Removing the polyp. The video voiceover will say: “Here you see the removal of a polyp from the large intestine. This is also called a polypectomy. The doctor will first inspect the polyp. A polyp is usually between 5 and 15 millimeters in diameter. Then the doctor will put a noose around the base of the polyp. This is pulled tight. Using the noose, the base of the polyp is continually heated, which cauterizes the base. The polyp is kept for further examination.” After finishing, click Next.\nPlay the video on slide (17/21): After the examination. The video voiceover will say: “After the examination we will take you back to the recovery room. You will be reconnected to the monitoring equipment. The nurse will keep an eye on this and will regularly check on how you are doing. During this period, blood pressure, pain and possible blood loss are monitored. You may have some abdominal pain after the procedure, namely cramping, due to the carbon dioxide gas which was blown into your large intestine during the examination. It is important to release the gas you feel and not to keep it in. When you are awake enough, you will be given something to eat and drink. The IV needle will be removed.” After finishing, click Next.",
    "Play the video on slide (18/21): Examination report and follow-up appointment. The video voiceover will say: “When you have significantly recovered, your companion will be notified that you can be picked up. You can get dressed. When you leave, you will receive a letter from the doctor with the preliminary results of the examination and telephone numbers you can call if you experience any complications after the procedure. The referring physician or a nurse from your surgery will give you the definitive results of the examination and the results of the tissue biopsy.” After finishing, click Next.\nRead the text on slide (19/21): Have a nice journey. After finishing, click Next.\nRead the text on slide (20/21): Risks of the examination. After finishing, click Next.\nFill out the questionnaire on medical history and medication use on slide (21/21): Questionnaire & Informed consent. After finishing, click Send.\n\t\tNOTE: This module serves as a pre-sedation risk assessment. It double-checks the informed consent. After final approval by the patient the information is sent via e-mail to the endoscopy unit.\nClick on the tab Preparation for the colonoscopy that is now made available. Follow the steps and read all information on the use of the laxatives in the same stepwise fashion.\nClick on the tab Route to the department for the routing to the endoscopy unit.\nFor the trained endoscopic nurse: assess the received information sent by the patient. Use the automated protocol whereby actions are related to the answers provided by the patients.\n\tNOTE: This system automatically labels responses with “green” (no action), “orange” (action might be necessary) and “red” (action is necessary). When in doubt, risk assessment will be performed by a consultant gastroenterologist.\n4. Control arm: Patient is visiting the outpatient clinic",
    "Schedule a visit for the patient at the outpatient clinic for instruction by a trained nurse. Follow the standard operating procedure during counseling.\n\tNOTE: This provides information on how to use the purgatives, dietary instructions, effects of sedation with benzodiazepines and relevant practical matters. Finally the nurse double-checks signed informed consent and files information on medical history.\n5. Day of colonoscopy\nSchedule the patient approximately 2-8 weeks from baseline for the colonoscopy. Ask the patient to complete the questionnaire, containing the 10-item knowledge test, the STAI and measures for patient satisfaction prior to colonoscopy (T1).\nScore the bowel cleanliness during colonoscopy (T2) online and in the endoscopy report; also fill out the several relevant items regarding colonoscopy here (indication, type of sedation and analgesic, ASA classification).\nAsk the patient to complete the post-colonoscopy questionnaire, containing measures for patient satisfaction (T3), just prior to discharge.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}