{
  "id": 3029,
  "origin_website": "Cell",
  "title": "Protocol for mapping double-stranded DNA break sites across the genome with translocation capture sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIntroduce DSB via CRISPR-spCas9 and isolate genomic DNA\nTiming: 2–4 days\n      Introduce plasmids containing spCas9 and the sgRNA targeting the desired\n      bait site to induce DSBs. Allow the cells to repair the DSB for 24–72 h.\n      This allows for one slow cell division while limiting subsequent apoptosis\n      or necrosis from cytotoxic translocations.\n    \n        Per sample, plate two replicates of 5 million cells into two 10cm\n        tissue-culture dishes, each containing 3 mL media without antibiotics.\n        \nNote: In this example, mouse Neuro2a\n          cells are used, cultured in DMEM with 10% fetal bovine serum at 37°C\n          with 5% CO2.\n        \n            Allow to adhere, beginning transfection 6–24 h post-plating.\n            \nNote: This step is flexible and\n              should be adjusted to culture conditions pertinent to the\n              experimental situation specific to user cell lines and DNA repair\n              environment.\n            \n        Per sample, transfect CRISPR-spCas9 expressing plasmid containing one\n        sgRNA which should target either:\n        \n            Non-targeting control (the example here does not target the mouse or\n            human genome, GTATTACTGATATTGGTGGG. Other genomes may\n            require a different guide).\n          \n            Targeted bait site (the example here targets the mouse genome,\n            CTCGCAGCCCTCCACCGTAA).\n            \n                In two separate 1.5 mL microcentrifuge tubes per sample, aliquot\n                1 mL optiMEM.\n              \n                In one tube, add 30 μL EndoFectin Max transfection reagent.\n              \nIn the other tube, add 3 μg plasmid.\nIncubate at 22°C, 5 min.\n                Combine diluted transfection agent with plasmid solution. Mix\n                gently by pipetting up and down slowly.\n              \nIncubate at 22°C, 10 min.\n                Add the 2 mL of optiMEM+plasmid+transfection reagent drip-wise\n                onto each plate of cells.\n              \n        Once cells are adhered to the plate, transfect for 6 h–24 h in a tissue\n        culture incubator (6 h recommended for most cells).\n      \n        Aspirate transfection media and replace with normal media (10 mL per\n        sample). Incubate in tissue culture incubator for 24–72 h (just over 1",
    "cell division, 24 h for most cells [including transfection time: 30 h]).\n      \n        Aspirate media. Rinse once with PBS (gently so as to not disturb cells).\n        Aspirate PBS.\n      \n        Add 2 mL Trypsin-EDTA to cells. Incubate in tissue culture incubator\n        until cells are no longer adherent (5 min for most cells).\n      \n        Combine Trypsin-EDTA with 1 mL normal media and split resuspended cells\n        into two 1.5 mL microcentrifuge tubes (1.5 mL each). Spin cells 750 g\n        2 min.\n      \n        Aspirate media from cell pellet. Wash cells once with 1 mL PBS per tube,\n        repeat spin.\n      \n        Add 200 μL PBS and resuspend cells using P200 pipette. Add 20 μL\n        Proteinase K (NEB, or Qiagen kit, 600 mAU/mL). Incubate 56°C 30 min to\n        lyse cells. Heat inactivate 95°C 5 min.\n      \nAdd 5 μL RNaseA (8 mg/mL) and incubate 37°C for 30 min.\n        Purify DNA using\n        Qiagen Blood and Tissue Kit[href=https://www.qiagen.com/us/resources/download.aspx?id=68f29296-5a9f-40fa-8b3d-1c148d0b3030&lang=en]. Elution step should be: 100 μL elution buffer, twice from same column\n        with two sequential spins. Pool eluted DNA from each pair of replicate\n        samples, here.\n      \n        Use NanoDrop to quantify DNA. A260/280 should be > 1.8 if kit\n        isolated DNA properly.\n      \nSave purified DNA in −20°C until ready to continue protocol.\nPause point: DNA is stable frozen.\n    \nShear DNA and linearly-amplify Cas9-cut bait site\nTiming: 1 day\n      These steps utilize a primer upstream of the spCas9 cut site to isolate\n      and amplify the bait region ≥70- fold. The linear amplification utilizes a\n      biotinylated primer, which will be used to bind to beads.\n    \n        Use Biorupter Pico or other DNA shearing instrument to sonicate DNA\n        samples, shearing to ∼500 bp according to\n        manufacturer protocol[href=https://www.diagenode.com/files/protocols/protocol-dna-shearing-bioruptor-pico.pdf]\n        [alternatively, use enzymatic shearing methods].\n      \nNote: This shearing length is assuming\n      2 × 250–300 bp long NGS reads. If using 2× 150 bp NGS, shearing to",
    "∼250–300 bp average may enable some R1-R2 read overlap, but this change\n      from 500 bp is not necessary.\n    \n        Run 1 μL sheared DNA on a 1% agarose gel.\n        \n            Validate that the sheared DNA recapitulates quality control step,\n            for each sample.\n          \n            Redo shearing with any samples which fail this quality control step,\n            altering the shearing conditions appropriately.\n          \nNote: Due to RNase, depending on quality\n      of DNA purification, the most intense band may appear very small - this is\n      degraded RNA. Degraded RNA will not affect the assay.\n    \nSet up 8 × 50 μL bait-amplification reactions for each sample:\ntable:files/protocols_protocol_2572_4.csv\nNote: Error-proofing polymerase (such as\n      Phusion) is recommended, but not required for accurate mapping of\n      translocations. Cycling conditions should be adjusted to be appropriate\n      for the polymerase used.\n    \nNote: This is not a\n      polymerase-CHAIN-reaction protocol; only one primer is used, resulting in\n      linear amplification.\n    \nRun thermal cycler with the following cycling conditions:\ntable:files/protocols_protocol_2572_5.csv\nOptional: Add polymerase again to each\n      tube and repeat. Error-proofing polymerases decline in activity over time.\n      This fresh addition allows for further amplification in a non-chain\n      reaction condition, as is the case with the linear-amplification done\n      here.\n    \nPause point: Save PCR strips in\n      −20°C. Note that error-proofing polymerases often have resection activity\n      and these tubes should not be stored at 4°C or 22°C.\n    \n        Use\n        Invitrogen PureLink PCR cleanup kit[href=https://tools.thermofisher.com/content/sfs/manuals/purelink_pcr_man.pdf]\n        (Binding Buffer 2) here to further remove residual RNA from original\n        RNase use and any excess biotin primer. Elute 2 × 100 μL in E1 buffer.\n      \nPause point: Save purified DNA in\n      −20°C or 4°C.\n    \nIsolate bait DNA and ligate adapters on beads\nTiming: 1–2 days\n      Streptavidin beads capture biotinylated DNA containing translocated,\n      normal, or Non-Homologous End-Joining (NHEJ) sequences at the bait site.\n    \nCritical: All steps until elution from",
    "beads should be completed daily at defined pause points. Do not allow\n      bead-containing reactions sit idle for days or weeks, even in cold\n      storage. Do not freeze beads.\n    \n        Pool bait-amplified DNA from PCR strips in a 1.5 mL microcentrifuge\n        tube. Add 50 μL 5 M NaCl. Add 2.5 μL 0.5 M EDTA pH8.\n      \n        Transfer 40 μL (per sample) Dynabeads C1 streptavidin beads (well\n        vortexed!) into new 1.5 mL microcentrifuge tube. Add 600 μL 1× Bead\n        Buffer. Mix by pipetting 10×.\n      \nCapture beads on magnetic stand 1 min. Discard supernatant.\n        Resuspend beads off magnetic stand in 600 μL 1× Bead Buffer. Mix well.\n      \nCapture beads on magnet stand 1 min. Discard supernatant.\n        Resuspend beads with pooled bait-amplified DNA. Rotate at 22°C a minimum\n        of 2 h (4 h or 16 h is best).\n      \nPause point: 16 h bead-DNA capture.\n    \n        Thaw bridge adapter on ice (a slow thaw is important to ensure\n        primers remain bound).\n      \n        Capture DNA-beads on magnet stand. Wash with 600 μL 1× Bead Buffer, 3\n        washes.\n      \n        Resuspend beads in 1 mL nuclease-free water. Capture beads and discard\n        supernatant.\n      \nResuspend beads in 45 μL nuclease-free water.\nSet up 100 μL ligation reactions in PCR strips (1 per sample):\ntable:files/protocols_protocol_2572_6.csv\nMix well. Incubate reactions at 25°C 1 h. 22°C 1 h.\nResuspend mixture well. Incubate another 22°C 1 h.\nIncubate reactions at 16°C 1–16 h.\nPause point: 16 h T4 DNA ligase\n      reaction at 16°C.\n    \n      Digestion of normal sequence to enrich for translocations\n    \nTiming: 3–5 h\n      Digestion of normal sequence is the key step to enable a reasonable amount\n      of sequencing to find hundreds to thousands of translocated sequences\n      within your DNA samples. Otherwise, almost all sequencing reads will\n      contain short insertion-deletions (indels) from NHEJ or completely normal\n      sequence. Digestion of normal sequence is accomplished using a methylated",
    "oligo which binds to non-translocated DNA and a hemi-methyl sensitive\n      restriction enzyme (the example here is LpnPI). This process removes the\n      adapter from the above step, preventing PCR of cleaved sequence.\n    \n        Add 100 μL 2× Bead Buffer in each PCR tube made in step 13. Combine in\n        new 1.5 mL microcentrifuge tube.\n      \n        Capture beads on magnetic stand, remove supernatant. Wash with 200 μL 1×\n        Bead Buffer twice.\n      \nWash once with 200 μL nuclease-free water. Remove water.\nSet up normal-sequence digestion reaction:\ntable:files/protocols_protocol_2572_7.csv\nCritical: When designing the\n      methylated oligo, ensure the methylated cytosine is within LpnPI’s\n      recognition sequence: CmCDG (D is A or G or T), and 20-60 bp\n      from spCas9 target cleavage site (distal to biotinylated primer sequence).\n      It is recommended to perform quality control of LpnPI digestion on a\n      carefully controlled PCR of the bait site prior to using on translocated\n      DNA.\n    \nNote: The enzyme LpnPI is not included in\n      above reaction, as the following 95°C step will diminish its activity.\n      95°C also diminishes streptavidin bead efficiency, so denaturation is\n      intentionally short.\n    \nAnneal methylated oligo on a thermal cycler:\ntable:files/protocols_protocol_2572_8.csv\n        Add 0.5 μL LpnPI enzyme (5,000 U/mL) and 1 μL 30× enzyme activator per\n        reaction.\n      \n        Incubate 37°C for 2–4 h [can prepare nested PCR reactions during\n        incubation].\n      \nOptional: Heat inactivate LpnPI at\n      65°C for 20 min. This step does not appear to affect assay outcome.\n    \nAdd 30 μL 2× Bead Buffer.\nTransfer reactions to 1.5 mL microcentrifuge tubes.\n        Wash beads with 600 μL 1× Bead Buffer three times, once with 1 mL\n        nuclease-free water.\n      \n        Resuspend beads and LpnPI-digested DNA in 225 μL nuclease-free water.\n        Proceed immediately to Nested PCR, do not pause.\n      \nNested PCR\nTiming: 3 h\n      Streptavidin-biotin interactions are exceptionally strong, so instead of\n      trying to disrupt this interaction chemically, a nested PCR is performed.",
    "To achieve this with variable translocated sequences, a reverse primer\n      binds to bridge adapter sequence, resulting in chain-reaction\n      amplification of translocated sequences without LpnPI cleavage. Once PCR\n      is complete, the amplified nested sequence is released from the beads.\n    \nSet up 8 × 50 μL Nested PCR reactions per sample:\ntable:files/protocols_protocol_2572_9.csv\nNote: Either the I5-nested and/or I7-blue\n      primers may be designed with in-line sample barcodes or\n      unique-molecule-identifiers (UMIs) for downstream bioinformatics. Sample\n      barcodes are used, note which sample barcode was used with each sample.\n      These in-line barcodes are not to be confused by the “index” sequences\n      used with Illumina sequencers, which are often used by sequencing lab\n      technicians to allow the sequencer to automatically de-multiplex samples\n      when the sequencing run is complete.\n    \n        Mix beads (do not spin tubes down). Run thermal cycler as follows:\n      \ntable:files/protocols_protocol_2572_10.csv\nPool 8 PCR products in new 1.5 mL microcentrifuge tube.\nCentrifuge 15,000 g for 5 min at 22°C.\n        Use Invitrogen PureLink PCR cleanup kit (Binding Buffer 2) to purify\n        supernatant. Elute once with 66 μL nuclease-free water.\n      \nPause point: Save purified nested\n      PCR DNA in −20°C or 4°C indefinitely for further steps.\n    \nSequencer adapter PCR and library purification\nTiming: 1 day\n      These steps add the adapters necessary for proper next-generation\n      sequencing of the translocated-DNA libraries. Next-generation sequencers\n      have an optimal DNA library base-pair range. The size selection step\n      (either before or after pooling libraries) results in a sample ready to be\n      sent to an Illumina next-generation sequencer.\n    \n        Check concentration of each DNA sample with NanoDrop or Qubit\n        (preferred).\n      \n        Calculate PCR cycles:\n        \n[DNA] ≥10 ng/μL: N = 11 cycles.\n7 ≤ [DNA] < 10 ng/μL: N = 12–13 cycles.\n[DNA] < 7 ng/μL: N = 14–20 cycles.\nSet up four 50 μL PCR reactions:\ntable:files/protocols_protocol_2572_11.csv\nNGS-adapter PCR. Run thermal cycler as follows:\ntable:files/protocols_protocol_2572_12.csv",
    "Perform size selection of final DNA libraries. This may be done before\n        or after pooling samples. There are multiple adequate procedures to\n        size-select, and each should be confirmed on a 1% agarose gel or\n        TapeStation to result in DNA within the 350–1,000 bp range.\n        \n            Option 1: Simple column purification using specialized buffer to\n            remove long adapter primer dimers.\n            \n                Use\n                Invitrogen PureLink PCR cleanup kit[href=https://tools.thermofisher.com/content/sfs/manuals/purelink_pcr_man.pdf]\n                (using Binding Buffer High-Cutoff (B3)).\n              \n                Be sure that no high molecular weight DNA is observed\n                (>2,000 bp or in the sample wells), or the sequencer may not\n                cluster efficiently.\n              \n            Option 2: Run the entire DNA library on a 1% agarose gel.\n            \n                Physically cut out the 350–1,000 bp section using a razor blade.\n              \n                Purify DNA from the agarose using a\n                PureLink Quick Gel Extraction Kit[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fpurelink_quick_gel_extraction_kit_qrc.pdf].\n                \nNote: if UV light is used,\n                  mutations will be introduced. Specialized dyes or running of a\n                  parallel size control gel may enable cutting out this range\n                  without using UV light.\n                \n            Option 3: Bead-based size selection.\n            AMPure XP[href=https://www.beckmancoulter.com/wsrportal/techdocs?docname=B37419]\n            is an example of a commonly used bead-based DNA size selection kit.\n          \n        Before sending libraries to an NGS facility, perform a simple Sanger\n        sequencing check of the final libraries.\n        \n            Using P5/I5 Illumina adapters as PCR primers and sequencing primers,\n            the Sanger sequence should appear fairly normal until the bait DSB\n            site nears, where insertion-deletions and translocations begin to\n            create random A’s T’s C’s and G’s at all following locations. An\n            example of this quality control step is shown in\n            Figure 4[href=https://www.wicell.org#fig4].\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2572-Fig4.jpg\n                  Figure 4. Sanger sequencing example of successful\n                  translocation capture\n                \nOptional: Perform qPCR using either\n      (a) NGS sequencing primers or (b) NGS sequencer-binding primers to ensure\n      linear amplification of properly constructed libraries. Most NGS\n      facilities do this for user-created custom libraries.\n    \n        Design your submission based on the assumption that 0.1%–1% of your",
    "reads are translocations.\n      \nNote: Many of these will be on the same\n      chromosome as the induced DSB, with a smaller fraction on other\n      chromosomes. This percentage may be higher depending on your optimization\n      of steps 33–36: LpnPI digestion.\n    \n        When all libraries are ready, submit to an Illumina next-generation\n        sequencing facility which routinely processes ≥150 bp reads.\n      \nNote: This protocol was initially\n      developed for Illumina MiSeq, but modern high-throughput Illumina\n      sequencers readily perform 150 bp or higher single- or paired-end\n      sequencing. Depending on how the primers are designed, this allows for\n      ∼30–50 bp upstream base-pairs from the spCas9 cleavage site, and the\n      remainder allows for accurate mapping of (a) NHEJ indels or\n      (b) translocations.\n    \nAnalyze the data\nTiming: 1 h - 2 days, or up to weeks\n      longer depending on analysis needs\n    \n      Analysis of translocations depends entirely on the research question\n      related to the designed DSB. However, most analyses will include\n      (a) quality control of correctly captured DSB, (b) trimming of bait\n      sequence, and (c) mapping of translations to the reference genome. These\n      procedures are outlined below, using the public, free web-based\n      bioinformatic suite UseGalaxy.org[href=https://usegalaxy.org/].\n    \n        Upload “∗.fastq.gz” sequencing file (or two per sample for paired-end\n        sequencing) to your account, using the “Upload Data” button. If using\n        large files, utilize FileZilla to send via FTP via\n        UseGalaxy.org[href=http://UseGalaxy.org]\ninstructions[href=https://galaxyproject.org/ftp-upload/].\n        \n            In the upload menu in\n            UseGalaxy.org[href=http://UseGalaxy.org], set uploaded files\n            as datatype “∗.fastqsanger.gz” so downstream tools sense the\n            sequencing data. This works better for more tools using Illumina NGS\n            data, despite there being a “∗.fastqillumina.gz” option.\n          \n            If your file fails to process in\n            UseGalaxy.org[href=http://UseGalaxy.org] for any steps, try\n            sending your input file to “FASTQ Groomer” first. While this makes\n            the file size large, duplicates the file, and adds processing time,\n            the tool can fix unexpected file type errors.",
    "Trim the bait sequence prior to the bait DSB, and retain only those\n        reads which contained the bait DNA.\n        \n            Use the “cutadapt” tool, pasting ∼40 bp of bait DNA near the DSB\n            into the “5′ (Front) Adapter” input box, using the “Enter custom 5′\n            adapter sequence” within the “Enter custom sequence” sub-menu. For\n            the example in this protocol, the sequence is:\n            “CAAGCCCCCCACCAAGTGCTTCAGGAACAGGTCGAAAGCC”. Under “Filter Options”,\n            check “Yes” for “Discard Untrimmed Reads”.\n          \n            When this step is complete, only sequences which had the captured\n            DSB site will be analyzed.\n          \nOptional: Perform sequencing-quality\n      trimming using tools and settings appropriate for the sequencer used.\n    \nOptional: In our hands, A-tailing can\n      be observed. In the first “cutadapt” trim step, this can be mitigated\n      using a “3′ (End) Adapters” inclusion of a “AAAAAAA” sequence\n      in the “Enter custom 3′ adapter sequence” option. This may also be\n      considered with NextSeq instruments using a polyG sequence, to remove low\n      signal sequences. However, these repetitive sequences do not appear to\n      alter Bowtie2 mapping drastically using the settings below.\n    \n        Trim ∼10 bp past the DSB site to keep only translocated sequence. In\n        this example, this is an additional 45 bp. Use “cutadapt” a second time,\n        using the output from step 58. Set “Read 1 options”, “Cut bases from\n        reads before adapter trimming” to 45. In filter options, set “Minimum\n        length (R1)” to 50, resulting in an output which only contains\n        translocations with 50 bp of sequence or more.\n      \n        Map your translocations to the genome. Use Bowtie2. In this example, the\n        mouse genome (mm10 or mm39 at the time of writing) is the reference\n        genome.\n      \nNote: While it is common to use RmDup to\n      remove PCR duplicates after mapping, in this case, it will remove many\n      normal sequences with set insertion-deletions around the bait site. RmDup",
    "may still be used to ensure only unique translocations are output for\n      quantitative purposes.\n    \n        If chromosome coordinates are desired to determine where the\n        translocation map to, utilize the BAM to BED tool. This will output a\n        tabular file of each mapped translocation for your sample. This “∗.BED”\n        file is a reasonable “final processed data output” for translocation\n        analysis.\n      \n      A screenshot of an example workflow in\n      UseGalaxy.org[href=http://UseGalaxy.org] is provided as\n      Figure 5[href=https://www.wicell.org#fig5].\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2572-Fig5.jpg\n          Figure 5. Example GEF-TLC-seq bioinformatic workflow in Galaxy\n        \n      Or alternatively, with RmDup to include only unique translocations in\n      Figure 6[href=https://www.wicell.org#fig6].\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2572-Fig6.jpg\n          Figure 6. Example GEF-TLC-seq bioinformatic workflow in Galaxy with\n          RmDup"
  ],
  "subjectAreas": [
    "Genomics",
    "Cell Biology",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}