{
  "id": 17592,
  "origin_website": "Jove",
  "title": "Psychophysical Tracking Method to Assess Taste Detection Thresholds in Children, Adolescents, and Adults: The Taste Detection Threshold (TDT) Test",
  "procedures": [
    "1. General considerations\nNOTE: This protocol for the TDT test describes the procedures for preparing the taste solutions and for determining taste detection thresholds for sucrose, NaCl, or MSG, using sucrose as the example. This method has been approved by the Office of Regulatory Affairs at the University of Pennsylvania. For the research studies described herein, informed consent was obtained from each adult participant or parent/legal guardian of pediatric participants. Informed assent was obtained from each child aged seven years or older prior to participation.\nAs shown in Table 1, prepare 17 solutions, ranging from 1 M to 0.00010 M, that are quarter-log steps apart. Ideally, use ultrapure water such as distilled water (dH2O) as the diluent and not tap water due to taste issues12. Refrigerate the solutions for a maximum of 2 weeks, but only if the protocol described below is adhered to.\nAfter informed consent is obtained from the adult participants or parent/legal guardians and, when applicable, assent from the pediatric participants, conduct the tests in a comfortable, private room that ideally has a sink for expectoration. Ensure that the solutions are not swallowed but rather swished in the oral cavity and spat out. If a sink is not available, provide a large cup for spitting.\nEnsure that testing personnel do not wear heavily scented products and limit conversation to instruction or explanation of methods. Instruct the adult participants and the parents/legal guardians of child participants that the participant should abstain from eating or drinking anything but water, or using tobacco products (adults only) for 1 h prior to testing.\n2. Materials and recipes to make taste stimulus solutions",
    "NOTE: Detailed instructions for making the stock solution (1000 mmol/L; hereafter referred to as stock) and the 16 serial dilutions of the stock solution (in quarter-log steps) for sucrose, NaCl, or MSG are provided here. Table 1 lists the concentrations of each dilution step. Figure 1 illustrates the steps to make stock solution through dilution steps 1-16. The volume of solution made will be sufficient to determine thresholds for at least four participants.\ntable:\n﻿0,1,2,3,4\nStep,Molar,Sucrose (g/L),NaCl (g/L),MSG (g/L)\nStep,(1/4 log units apart),Sucrose (g/L),NaCl (g/L),MSG (g/L)\n0,1 M,342.3,58.44,187.13\n1,0.562 M,192.37,32.84,105.17\n2,0.316 M,108.17,18.47,59.13\n3,0.178 M,60.93,10.4,33.31\n4,0.100 M,34.23,5.84,18.71\n5,0.056 M,19.17,3.27,10.48\n6,0.032 M,10.95,1.87,5.99\n7,0.018 M,6.16,1.05,3.37\n8,0.010 M,3.42,0.58,1.87\n9,0.0056 M,1.92,0.33,1.05\n10,0.0032 M,1.09,0.19,0.6\n11,0.0018 M,0.62,0.11,0.337\n12,0.0010 M,0.34,0.058,0.187\n13,0.00056 M,0.19,0.033,0.105\n14,0.00032 M,0.11,0.019,0.059\n15,0.00018 M,0.06,0.0105,0.034\n16,0.00010 M,0.03,0.0058,0.019\nTable 1: Concentration steps and corresponding molarity of sucrose, sodium chloride (NaCl), and monosodium glutamate (MSG) solutions needed for Taste Detection Threshold (TDT) testing.\nPrepare test materials.\n\t\nObtain a food-grade source of sucrose, NaCl, or MSG.\nClean and sterilize all needed glassware (see Table of Materials).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62384/62384fig01.jpg\nFigure 1: Step-by-step instructions to make stock solutions through dilution steps #1-16.  Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62384/62384fig01large.jpg]\nMake stock solution, as depicted in Figure 1A-C.\n\t\nLabel all glassware with the date, type of tastant, and Stock.\nWeigh the tastant into a disposable weigh boat on a scale accurate to 0.01 g, and transfer to the 2000 mL beaker.\n\t\tNOTE: The amounts needed to prepare the stocks are 684.60 g for sucrose, 374.26 g for MSG, and 116.88 g for NaCl.\nRinse with dH2O any tastant remaining in the weigh boat, and pour into the beaker. Add 1500 mL of dH2O to dissolve the sample.",
    "Transfer the contents of the beaker to the 2000 mL volumetric flask using a funnel, and rinse the beaker and funnel with more dH2O, pouring the rinse water into the flask. Fill the flask with dH2O to the 2000 mL mark, and affix the stopper on the flask. Invert to mix until the tastant is dissolved.\nMake solutions #1-4, as depicted in Figure 1D-F.\n\t\nLabel 1000 mL volumetric flasks with numbers 1 to 4 and corresponding 1000 mL glass bottles with the date, type of tastant, and Stock to Step 4.\nTransfer 560 mL, 320 mL, 180 mL, and 100 mL of stock into flasks 1, 2, 3, and 4, respectively. Fill flasks 1-4 with dH2O to the 1000 mL mark, affix with stopper, and mix until the tastant is dissolved. Pour the contents of each flask into its corresponding 1000 mL glass bottle (labeled Step 1 to Step 4) using a funnel if needed.\nPour the remaining stock solution into the bottle labeled Stock; close the lid tightly, and place in the refrigerator at 4 °C.\nMake solutions #5-16, as depicted in Figure 1G-I.\n\t\nLabel twelve 1000 mL bottles with the date, type of tastant, and Step 5 to Step 16.\nLine up the bottles in a 4 x 4 grid with the bottles containing step 1 - 4 solutions in the front row (as shown in Figure 1G-I).\n\t\tNOTE: This positioning allows a simple dilution series, such that it starts with the most diluted step in the row (e.g., step 4) and end with the most concentrated step (e.g., step 1).\nPipet 50 mL of steps 1, 2, 3, and 4 into bottles 5, 6, 7, and 8, respectively. Add 450 mL of dH2O to bottles 5-8, affix the stoppers, and invert to mix (Figure 1 H).",
    "Repeat the process starting with the second row. Pipet 50 mL of steps 5, 6, 7, and 8 into bottles 9, 10, 11, and 12, respectively. Add 450 mL of dH2O to bottles 9-12, affix the stoppers, and invert to mix.\nRepeat the process starting with the third row (Figure 1 I). Pipet 50 mL of steps 9, 10, 11, and 12 into bottles 13, 14, 15, and 16, respectively. Add 450 mL of dH2O to bottles 13 - 16, affix the stoppers, and invert to mix. Place lids on bottles 1 - 16, close the lids tightly, and store in the refrigerator at 4 °C.\nFill several sterilized 120 mL labeled glass bottles with dH2O, close the lids tightly, and store in the refrigerator at 4 °C.\n3. The psychophysical method: TDT\nPresent the participants with medicine cups containing pairs of solutions, one of which is a given concentration of a tastant and the other dH2O.\n\tNOTE: For the first pair, the tastant paired with dH2O is concentration step 10 when determining sucrose thresholds and step 12 when determining NaCl or MSG thresholds. The concentrations of tastant in the first step were chosen because each is a few steps below the average detection threshold for that particular tastant. Nevertheless, the TDT is a reliable tool to measure thresholds, regardless of whether these are above or below the average.\nAsk the participants to taste both solutions without swallowing and rinse their mouth with dH2O between tastings. Instruct them to point to the medicine cup they think has a taste in it or that tastes different than water.",
    "NOTE: The concentration of the tastant presented during the subsequent pairs depends on whether or not the participant's response was correct (i.e., the participant pointed to the tastant). The method is a forced-choice procedure, which means that participants cannot respond by saying \"neither\" or \"I don't know\"; rather, they must pick one of the two solutions. The method is a staircase procedure because the taste stimuli are presented in ascending (higher concentrations of tastant) or descending (lower concentrations of tastant) order, depending on the participant's response13. For ease of description, instructions have been provided for making the sucrose series and determining sucrose detection thresholds. The methods for MSG and NaCl are identical with two exceptions: (a) concentration of tastant needed to make stock solution differs (Table 1), and (b) as noted above, the concentration that testing starts with is step 12 for NaCl or MSG, instead of step 10 for sucrose.\nWhen assessing detection thresholds in pediatric population, limit testing to a single tastant per session.\n\t​NOTE: Adults can complete all three thresholds in a single session.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62384/62384fig02.jpg\nFigure 2: Threshold tracking grid. (A) Recording taste detection thresholds. (B) Setup of one tray. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62384/62384fig02large.jpg]\n4. Preparation of materials prior to testing\nGenerate a randomization sequence for the order of presentation of stimuli within pairs, and fill in the top row of the tracking grid (Figure 2A) for each pair by placing W in the box if water comes first, or T if tastant comes first.\nRemove the bottles containing solutions (steps 0 - 16) and dH2O from the refrigerator, and transfer ~120 mL of the solution for each step into appropriately labeled 120 mL sterilized glass bottles 2 h before testing.",
    "Return step 0 - 16 bottles to the refrigerator, and allow the transferred solutions to equilibrate to room temperature.\nLabel two, 12-cup muffin pans with the pair number, and mark positions that will hold the dH2O medicine cups with a W (Figure 2B).\n\t​NOTE: Although it is not known how many pairs will be required, fill the medicine cups that are in in the W positions with 10 mL of dH2O for the first 6 pairs.\n5. Preparation of participants for testing\nInstruct adults to abstain from eating, drinking, or using tobacco products, and instruct parents to not give their child participant anything to eat or drink for at least 1 h before testing.\nSeat one participant at a table in front of a sheet of paper, labeled with the numbers 1 and 2 (Figure 3).\n\tNOTE: Participants should not see the taste stimuli until they are placed in front of them; this can be achieved by having an opaque partition separate the participant from the investigator.\nAllow the participants to acclimate to the testing room and the tester for at least 10 min.\nUse a stopwatch to time the 10 s interstimulus intervals (time from expectoration of the first stimulus to sipping the second stimulus).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62384/62384fig03.jpg",
    "Figure 3: Child participating in a taste threshold detection test. A pair of solutions is placed on the table in front on the participant in the order that it should be tasted. The participant is asked to taste the solution in position 1 for 5 s, to expectorate, to rinse her mouth with dH2O, and to repeat for the solution in position 2. After tasting both solutions, the participant is asked to point to the solution that has a taste or tastes different than water. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62384/62384fig03large.jpg]\n6. Verbal instructions to participants\nPediatric participants\n\t\nShow the cups to the participant and say: \"We're going to play a game with things to taste. Here are two cups. You will taste what is inside the first cup, swish it around your mouth, but don't swallow, and I will tell you when to spit it out in the sink (or cup). You will then rinse with water, and taste what is inside the second cup. I will tell you when to spit it out. Then I want you to point to the one that tastes different than water. If you are not sure, just guess. You will then rinse your mouth two times with water, and we will do this again. There is no right or wrong answer; we want to know which one you think has a taste.\"\nAfter every response, reward the participant by saying \"Thank you. You are doing a good job!\"\nAdolescents and adults",
    "Show the cups to the participant and say: \"We're going to give you solutions to taste. Here are two cups. You will taste what's inside the first cup, swish it around your mouth, but don't swallow, and I will tell you when to spit it out in the sink (or cup). You will then then rinse with water and taste what's inside the second cup. I will tell you when to spit it out. Then I want you to point to the one that tastes different than water. If you are not sure, just guess. You will then rinse your mouth two times with water, and we will do this again. There are no right or wrong answers; we want to know which one you think has a taste.\"\nAfter every response, reward the participant by saying \"Thank you. You are doing a good job!\"\n7. Investigator instructions: Taste detection thresholds\nAs indicated on the tracking grid, start at step 10 for sucrose (or step 12 for NaCl or MSG). Place two medicine cups, one containing 10 mL of step 10 and the other containing dH2O on the sheet of paper with 1 and 2 in front of the participant (Figure 3).\n\tNOTE: The number the water or taste solution is placed on is determined by the generated, randomized order of stimuli presentation. For example, in Figure 2, the randomized order for pair 1 is W (water first), so the cup containing water is in position 1, and the one containing step 10 is in position 2.\nInstruct the participant to taste the solution in position 1 by swishing; after 5 s, instruct the participant to expectorate, to rinse his or her mouth with water, and to expectorate again.",
    "Instruct the participant to taste the solution in position 2 by swishing and to expectorate after 5 s.\nAsk the participant to point to the solution that has a taste or tastes different than water. If the participant says neither, instruct the participant to choose one.\n\tNOTE: Participants cannot go back and retaste either solution and must pick one of the two.\nAfter they make their choice, instruct them to rinse their mouths with water, and place a plus sign (+) on the grid if the participant picked the cup with the tastant (correct response), or a minus sign (-) if they picked the cup with water (incorrect response).\nContinue to the second pair, noting that the concentration of the tastant depends on participant's response for first pair. If the participant was incorrect for first pair (the participant chose W), then proceed up on the grid, noting that the tastant in the second pair will be the next higher concentration (step 9). If the participant was correct (chose T), then note that the tastant in the second pair will be the same step 10. Refer to the grid for the order of presentation (W or T first).\nRepeat this process described in steps 7.2-7.5. If the participant is correct two times in succession at step 10 (picks T both times), then remember that the next pair will contain the next lower concentration (step 11). If the participant is incorrect for pair 2 (picks W), proceed up on the grid to the next higher concentration (step 9).\nContinue this process, moving up the grid to the next higher concentration with each incorrect answer, or down the grid to the next lower concentration after two correct answers in a row.",
    "Circle the steps on the grid where there is a reversal-a change in direction in the accuracy in the participant's response, that is, when the participant becomes either more or less successful in identifying the tastant when tasting the next steps on the staircase.\n\tNOTE: Specifically, the participant goes from failing to identify T at one step (-) to successfully identifying T at the next more concentrated step two times in a row (++), or the participant goes from successfully identifying T twice at the same step (++) to failing to identify T when given the next less concentrated step; this failure can occur during either the first or second presentation of the less concentrated step (- or +-).\nContinue with the taste testing until four reversals are achieved, and list the step numbers of these four reversals.\nDetermine that the four reversals met the desired criteria; i.e., successive reversals are no more than two steps apart from each other, and there are two sets of pairs in which the participant correctly identified the T twice at the same step. STOP and go to 7.13 to calculate the detection threshold.\nAlternatively, determine that the four reversals did not meet criteria; i.e., successive reversals are more than 2 steps apart from each other, or at least 2 sets of pairs are not present in which the participant correctly identified the T twice at the same step. CONTINUE with testing until four reversals meet the criteria, or the participant reaches the top of the grid (threshold is 1 M (stock)) or continues to provide correct answers and reaches the bottom of the grid, giving correct responses twice at step 16 (threshold is 0.00010 M (step 16)).",
    "Determine the participant's detection threshold by calculating the arithmetic mean of the log values of the molarity of those four reversals:\n\tarithmetic mean = (log concentration step of reversal 1 + log concentration step of reversal 2 + log concentration step of reversal 3 + log concentration step of reversal 4) / 4.\n\tNOTE: This is equivalent to calculating the geometric mean of the concentrations of the last four reversals:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62384/62384eq01.jpg\nDiscard the unused taste solutions that were transferred into 120 mL bottles during the preparation of materials for testing."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}