{
  "id": 5319,
  "origin_website": "Bio",
  "title": "Measuring Oxidative Stress in <em>Caenorhabditis elegans</em>: Paraquat and Juglone Sensitivity Assays",
  "procedures": [
    "Paraquat development assay - sensitivity to chronic oxidative stress during developmentPrepare NGM media (see Recipes) in Erlenmeyer flask (Note 1).Cover the top of Erlenmeyer flask with aluminum foil and use autoclave tape to secure it in place.Autoclave NGM media and MgSO4, CaCl2 and KPI solutions (see Note 2).Cool media to ~55 °C (see Note 3) while stirring.Add MgSO4, CaCl2 and KPI (according to Recipes) while stirring. Pour control plates (no paraquat): 10 ml of media in 60 mm Petri dish (see Notes 4 and 5).Add paraquat (methyl viologen) (according to Recipes) while stirring (see Note 6). Allow ~60 sec for paraquat to be mixed into the media. Pour plates: 10 ml of media in 60 mm Petri dish.Repeat steps A7 and A8 for each concentration of paraquat (see Note 7).Allow plates to solidify and dry overnight at room temperature.Seed plates with 100 µl of OP50 bacteria overnight culture.Allow bacteria to dry and grow at room temperature for 2 days. Transfer equal numbers of eggs from each strain being tested to control plates and plates containing paraquat (Note 8) ensuring that you don’t transfer any eggs that have hatched into the first larval stage of development (L1 worms).Check to ensure that eggs have hatched the following day.Monitor the developmental stage of the worms daily (see Note 9). Expected results: Wild-type N2 worms should develop to fertile adults on plates up to about 0.35 mM paraquat.Positive controls: clk-1, sod-2 both arrest at an early larval stage at concentrations of paraquat that permit WT worms to develop to fertile adults (e.g., 0.2 mM). References in which this protocol was used: Van Raamsdonk and Hekimi, 2012; Van Raamsdonk et al., 2010.Standard output format: see Figure 1. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229180409_8626.jpgFigure 1. Paraquat development assay.",
    "Results are displayed as either a graph of the furthest developmental stage reached by worms of each genotype (Left) or the average stage of development each day after transferring to paraquat plates (Right). Typically, wild-type worms can develop to fertile adults (FA) at paraquat concentrations up to 0.35 mM. Increasing concentrations of paraquat result in slower development times.Acute paraquat sensitivity assayPrepare NGM media (see Recipes) in Erlenmeyer flask (Note 1).Cover the top of Erlenmeyer flask with aluminum foil and use autoclave tape to secure it in place.Autoclave NGM media and MgSO4, CaCl2 and KPI solutions (see Note 2).Cool media to ~55 °C (see Note 3) while stirring.Add MgSO4, CaCl2 and KPI (according to Recipes) while stirring.Pour control plates (no paraquat): 4 ml of media in 35 mm Petri dish (see Notes 4 and 5).Pour NGM media equivalent to the number of plates required plus one into a new Erlenmeyer flask or bottle. E.g., for 5 plates pour 24 ml of media into a new vessel (see Note 10).Add paraquat (methyl viologen) (according to Recipes) while stirring (see Notes 6 and 11). Pour plates: 4 ml of media in 35 mM Petri dish.Repeat steps B7 and B8 for each concentration of paraquat (see Note 7).Allow plates to solidify and dry overnight.12.Seed plates with 50 µl of 10x concentrated OP50 bacteria overnight culture (see Note 12).Allow bacteria to and grow at room temperature for 2 days. Transfer 25 worms from each experimental strain to paraquat plates.Check the survival of the worms hourly until all worms have died (see Note 13). Expected results: The majority of wild-type N2 worms will die by 15 h. For young adults, 50% survival occurs around 8 h. Positive controls: clk-1 worms have decreased survival compared to WT, isp-1 worms have increased survival compared to WT.",
    "References in which this protocol was used: Schaar et al., 2015.Standard output format: see Figure 2. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229180856_5131.jpgFigure 2. Acute paraquat sensitivity assay. Results are displayed as the percentage of worms that are still alive at each time point. The majority of wild-type worms do not survive past 15 h. Developing L2 and L4 worms have decreased survival compared to young adults (YA). Results represent the average of three biological replicates of 25 worms per replicate.Acute juglone sensitivity assayJuglone plates lose their toxicity with time (Cooper et al., 2016). They need to be made fresh on the day of the assay and it is best to have a constant amount of time between pouring the plates and putting the worms on. They cannot be used for a chronic assay.Prepare NGM media (see Recipes) in Erlenmeyer flask (Note 1).Cover the top of Erlenmeyer flask with aluminum foil and use autoclave tape to secure it in place.Autoclave NGM media and MgSO4, CaCl2 and KPI solutions (see Note 2).Make juglone solution (see Recipes), stir in the dark for at least an hour (see Note 14).Cool media to ~55 °C (see Note 3) while stirring.Add MgSO4, CaCl2 and KPI (according to Recipes) while stirring.Pour control plates (no juglone): 10 ml of media in 60 mm Petri dishes (see Notes 4 and 5).Add juglone to desired concentration: 300 μM = 2.5 ml juglone/100 ml NGM240 μM = 2 ml juglone/100 ml NGM180 μM = 1.5 ml juglone/100 ml NGM120 μM = 1 ml juglone/100 ml NGM60 μM = 0.5 ml juglone/100 ml NGMYou can make multiple concentrations by progressively adding more juglone.Pour juglone plates: 10 ml of media in 60 mm Petri dishes. More concentrated plates will be a darker yellow color.Leave plates uncovered for 30 min to solidify agar.",
    "Plates should be in a single layer on the bench top, ideally next to a flame for sterility. Add 40 μl of 5x concentrated OP50 bacteria with a pipet and spread to a thin layer by tilting plate in a circle (so bacteria will dry quicker). Do not let bacteria reach the edge of the plate, to limit the number of worms that will crawl up the sides.Once bacteria is dry (~30 min), add 25 young adult worms per strain to the juglone plates to begin assay. Check worm survival periodically (e.g., 1, 2 and 4 h).Expected results: At 240 μM, wild-type N2 worms will start to die at 2 h and most will be dead by 4 h. Increasing juglone concentration to 300 μM results in more rapid death, while decreasing juglone concentration results in increased survival. Positive controls: sod-1 worms have decreased survival compared to WT. References in which this protocol was used: Van Raamsdonk and Hekimi, 2009; 2012; Van Raamsdonk et al., 2010; Cooper et al., 2015; Schaar et al., 2015; Dues et al., 2016; Machiela et al., 2016. Standard output format: see Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229181316_7996.jpgFigure 3. Acute juglone sensitivity assay. Results are displayed as the percentage of worms that are still alive at each time point. There is a dose-dependent decrease in survival with increasing juglone concentrations. Results represent the average of three biological replicates of 25 worms per replicate.Chronic paraquat assay during adulthoodPrepare NGM media (see Recipes) in Erlenmeyer flask (Note 1).Cover the top of Erlenmeyer flask with aluminum foil and use autoclave tape to secure it in place.Autoclave NGM media and MgSO4, CaCl2 and KPI solutions (see Note 2).Cool media to ~55 °C (see Note 3) while stirring.Add MgSO4, CaCl2 and KPI (according to Recipes) while stirring.",
    "Add FUdR to a concentration of 100 µM (see Note 15).Pour control plates (no paraquat): 10 ml of media in 60 mm Petri dishes (see Notes 4 and 5).Add paraquat (methyl viologen) (according to Recipes) while stirring (see Note 6). Pour paraquat plates: 10 ml of media in 60 mm Petri dishes.Repeat steps D7 and D8 for each concentration of paraquat (see Note 16).Allow plates to solidify and dry overnight.Seed plates with 150 µl of 10x concentrated OP50 bacteria overnight culture (see Note 12).Allow bacteria to and grow at room temperature for 2 days. Transfer 25 worms from each experimental strain to control and paraquat plates.Check the survival of the worms daily until all worms have died. Transfer worms to new plates every seven days.Expected results: Wild-type N2 worms should have an average survival of about 10 days. Positive controls: sod-1 and sod-2 worms have decreased survival compared to WT (Figure 4).References in which this protocol was used: Van Raamsdonk and Hekimi, 2009; 2012; Dues et al., 2016; Schaar et al., 2015.Standard output format: see Figure 4.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229182057_4684.jpgFigure 4. Chronic paraquat assay. Results are typically shown as a Kaplan-Meier survival plot. Results represent the mean survival rate from a minimum of three biological replicates of 25 worms per replicate."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}