{
  "id": 17956,
  "origin_website": "Jove",
  "title": "Analyzing Oxygen Consumption Rate in Primary Cultured Mouse Neonatal Cardiomyocytes Using an Extracellular Flux Analyzer",
  "procedures": [
    "For work with neonatal mice, please refer to local university/institute guidelines set forth by the animal care programs and adhere to one’s institutional and other appropriate regulations. All methods described in this protocol have been approved by the UC San Diego Institutional Animal Care and Use Committee (IACUC) and adhere to federal and state regulations.\n1. Preparation of Reagents\nPrepare 25 mL of pre-digestion solution: HBSS (without Ca2+ and Mg2+) supplemented with trypsin (0.5 mg/mL). Sterilize the solution using a 0.22 µm filter and keep on ice until use. Make pre-digestion solution on the day of experiment.\nNOTE: It is critical to use HBSS without Ca2+ and Mg2+, as Ca2+ and Mg2+ will cause myocyte contraction and subsequent cell death during isolation.\nPrepare 30 mL of collagenase digestion buffer: collagenase (0.8 mg/mL, approximately 350 U/mL) dissolved in HBSS (without Ca2+ and Mg2+) buffer. Sterilize the solution using a 0.22 µm filter and keep on ice until use. Make collagenase digestion solution on the day of experiment.\nPrepare 500 mL of cardiomyocyte culture media (growth media): Mix 375 mL of DMEM, 125 mL of M-199, 25 mL of Horse serum, and 12.5 mL of FBS. Supplement with 1% penicillin and 1% streptomycin solution.\nPrepare mitochondrial stress test medium: Make 200 mL of DMEM based stress test medium (DMEM without NaHCO3, see Table of Materials) supplemented with 1 mM sodium pyruvate, 2 mM L-glutamine, and 10 mM glucose, and 2 mM Hepes.\nNOTE: Make 1 L of medium with DMEM without sodium pyruvate, L-glutamine, glucose, and Hepes, filer sterile, and store in 4 °C. Prepare the stress test medium on the day of the assay by adding other reagents. Using DMEM medium without NaHCO3 is critical.",
    "Adjust pH of mitochondrial stress test media to 7.4 on the day of use. Warm media to 37 °C before use.\nPrepare oligomycin: Prepare 5 mL of a 5 mM stock solution in DMSO, make 250 µL aliquots, and store at -20 °C.\nPrepare FCCP: Prepare 5 mL of a 5 mM stock solution in DMSO, make 250 µL aliquots, and store at -20 °C.\nPrepare antimycin A: Prepare 5 mL of a 5 mM stock solution in DMSO, make 250 µL aliquots, and store at -20 °C.\nPrepare rotenone: Prepare 5 mL of a 5 mM stock solution in DMSO, make 250 µL aliquots, and store at -20 °C.\nNOTE: All reagents and solutions used in this protocol are listed in Table 1.\n2. Harvesting and Pre-digestion of Hearts from Neonatal Mice (Day 1)\nAutoclave scissors, forceps, and a Moria spoon to sterilize.\nPerform all steps in the cell culture hood for sterility.\nAliquot 5 mL of HBSS (without Ca2+, Mg2+) to each well of a 6-well cell culture plate; place on ice. Aliquot 10 mL of HBSS into a 10 cm cell culture dish.\nPrepare 20 mL of trypsin pre-digestion solution in a 50 mL sterile conical tube. Keep all solutions on ice.\nQuickly dip newborn (day 0) mice in 70% ethanol solution for sterilization.\nDecapitate pups using sterile scissors (straight) without anesthesia, and then open chest along the sternum to allow access to the chest cavity and the heart. (Figure 1A)\nNOTE: 1) It is critical to use P0 neonatal mice to achieve high cell viability. 2) This euthanasia method is permitted for neonates in accordance with NIH and American Veterinary Medical Association guidelines 17.",
    "Extract hearts from the body with a fine scissors and transfer immediately into the sterile cell culture dish containing HBSS (without Ca2+, Mg2+) (Figure 1B).\nRemove any residual lung tissue, larger vessels, etc. (and atria, if desired). Wash hearts in the HBSS solution using gentle agitation.\nCut each heart with a fine scissors into 8 pieces and transfer the all heart tissue with forceps into one well of a 6-well cell culture plate with HBSS (Figure 1C and 1D).\nWash the hearts by transferring the hearts from well to well in the 6-well plate filled with HBSS, using a Moria spoon (Figure 1D).\nNOTE: Transferring the hearts from well to well is enough to wash out the blood. Since blood interferes with enzymatic digestion it is important to wash the hearts with HBSS and remove blood.\nTransfer the hearts with a Moria spoon into a conical tube containing 20 mL of trypsin (0.5 mg/mL) and incubate with gentle agitation at 4°C for 4 h (Figure 1E).\n3. Prepare a 96-well Culture Plate (Day 1)\nPrepare 5 mL of coating solution: PBS containing 0.5% gelatin (autoclave before use) and 1% fibronectin solution. (e.g. 5 mL gelatin solution plus 50 µL of fibronectin solution)\nAliquot 50 µL of coating solution into each well of the 96-well cell culture plate (see Table of Materials). If bubbles are present, remove them by using a 20 µL pipette to suck bubbles out.\nNOTE: It is important to cover all the surface area of each well with coating solution.\nIncubate the plate in a 37 °C cell culture incubator for 1 h or more to allow drying of the matrix coating.\nAspirate any residual coating solution before seeding cardiomyocytes.\n4. Enzymatic Digestion and Plating of Cells (Day 1)",
    "Pre-warm collagenase digestion solution in a 37 °C water bath.\nNOTE: This is step is important to achieve efficient enzymatic digestion.\nMove the conical tube containing hearts and pre-digestion solution from 4 °C to a cell culture hood. (Figure 1F)\nLet the hearts sink to the bottom of the tube and remove the pre-digestion solution by using a 10 mL serological pipette (1 to 2 mL of the isolation medium may remain in the tube).\nAdd 10 mL of HBSS into the tube. Re-suspend the hearts with HBSS 2-3 times to wash out trypsin using a 10 mL serological pipette. Aspirate HBSS (1 to 2 mL may remain in the tube).\nAdd 10 mL of pre-warmed collagenase digestion solution into the tube with hearts. (Figure 1G)\nIncubate the tube with hearts in a 37 °C water bath for 10 min without agitation (1st digestion).\nAfter 1st digestion, move the tube to the cell culture hood. Gently triturate hearts by re-suspending the hearts within the tube gently 10 times using a 10 mL serological pipette. This will allow hearts to disperse and cells to be released from heart tissue. (Figure 1H)\nNOTE: Since cardiomyocytes are fragile, gentle trituration is important to achieve high viability.\nLet the undigested tissue sink, transfer digested solution enriched in cardiomyocytes (approximately 9 - 10 mL) to a new conical tube, and immediately add an equal amount of cell culture media to stop the collagenase digestion.\nAdd 10 mL of collagenase digestion solution into the tube containing the remaining undigested heart tissue.\nIncubate the tube with heart tissue in a 37 °C water bath for 10 min (2nd digestion).\nRepeat procedure 4.7 and 4.8.",
    "NOTE: If there is still much undigested tissue, repeat digestion one more time. However, in most cases, two digestions are enough to disperse most of the cells from the heart tissue.\nPlace a sterile cell-strainer (100 µm nylon mesh) in a new sterile 50 mL conical tube. Pre-wet the cell strainer with 2-3 mL of cell culture media and pass cells through the cell-strainer. Rinse the cell-strainer with 2-3 mL of cell culture media. (Figure 1I)\nCentrifuge conical tube containing cardiomyocytes for 5 min at 180 x g (Figure 1J). Aspirate the supernatant (Figure 1K), which will contain cell tissue debris and re-suspend the cell pellet in 10 mL of cell culture media (Figure 1L).\nGently resuspend the cells and plate cells onto a 10 cm cell culture dish (plastic without any type of coating) and incubate for 1 h in a cell culture incubator (1st pre-plating) (Figure 1M). This pre-plating step allows non-cardiomyocytes, such as fibroblasts and endothelial cells, to adhere to the uncoated cell-culture dish.\nNOTE: At this point, cardiomyocytes are typically a round shape and appear shiny under the microscope. (Figure 1N).\nAfter the 1 h incubation, gently agitate the plate, wash non-adherent cells (enriched in cardiomyocytes) from the 10 cm culture dish, and re-suspend cells by repeatedly pipetting the cell culture medium over the dish using a 10 mL serological pipette. Then, transfer non-adherent cells (enriched in cardiomyocytes) into a new 10 cm cell culture dish (plastic without any coating) and incubate for an additional 1 h in a cell culture incubator (2nd pre-plating).\nNOTE: Cells that attach to the non-coated plate are dominantly non-cardiomyocytes: fibroblasts and endothelial cells, that can be visualized under a microscope (Figure 1O).",
    "After 2nd pre-plating, gently agitate the plate, wash non-adherent cells (cardiomyocytes) from the 10 cm culture dish, then transfer the cardiomyocytes into a new 50 mL conical tube.\n5. Counting Cells and Plating Cells into a 96-well Cell Culture Plate (Day 1)\nCount the cells using a hemocytometer.\nPlate the cells into an extracellular matrix coated 96-well cell culture plate at a density between 10–30 x 103 cells/well by using a multi-channel pipette in a final volume of 200 µL (Figure 1P). Use wells A1, A12, H1, and H12 for background: add 200 µL of culture medium as other wells in these wells (no cells). Incubate the plate in a 37 °C cell culture incubator.\nNOTE: In this study, oxygen consumption was tested by using different cell densities such as 10 x 103, 20 x 103, or 30 x 103 cells/well. (Figure 2A). Also, as above, cardiomyocytes immediately after isolation are typically a round shape and appear shiny under the microscope. Viable cells will flatten out within 16-24 h of culture.\n6. Oxygen Consumption Assay using a 96-well-format Extracellular Flux Analyzer (Day 2)\nNOTE: Oxygen consumption assay can be carried out one day after plating the cells or later. Neonatal cardiomyocytes cultured using this protocol can survive up to 7 days post isolation.\nHydrate a flux analyzer sensor cartridge (see Table of Materials) for at least 3 hours, but ideally for a full day, before the assay. Add 200 µL of Calibrant solution (see Table of Materials) into the each well of the utility plate, put the sensor cartridge back onto the utility plate, and incubate in a 37°C incubator without CO2 or O2 supplementation.",
    "Change cell culture media to mitochondria stress test medium one hour prior to the assay. Cardiomyocytes are fragile. Therefore, gently remove the cell culture media by using a multi-channel pipette and wash the cells with 200 µL of pre-warmed mitochondrial stress test media twice. After second wash, add 175 µL of pre-warmed mitochondria stress test media and culture the cells in a 37°C incubator without CO2 or O2 supplementation.\nPrepare concentrated test compounds. For mitochondria stress test, prepare 3.0 mL each of 16 µM oligomycin, 9 µM FCCP, and a mixture of 20 µM rotenone and 20 µM antimycin A, all in mitochondrial stress test medium.\nNOTE: Each compound at the concentration described has been tested. However, titrating the concentration of each compound in one’s own laboratory is necessary.\nLoad 25 µL of each compound into the injector ports of the sensor cartridge using a multichannel pipette (Figure 1Q). The volume and final concentration are described in Table 2.\nSet up extracellular flux assay protocol. The program is described in Table 3.\nStart the program. First, put the sensor cartridge into the machine for calibration (Figure 1R). Replace the calibrant for the assay plate once the calibration step is done.\nNOTE: Using the software provided by manufacturer, indicate groups of wells and each compound and port.\nIf desired, after the assay, carefully discard all assay medium by using a multi-channel pipette and store the cell culture microplate at -20 °C for future cell normalization using protein assay.\nMeasure protein content. Add 50 µL of standard RIPA cell lysis solution (see Table of Materials). Incubate the plate on ice for 30 min to fully lyse cells. Transfer all material to a new clear flat bottom 96 well assay plate.\nMeasure protein concentration by BCA assay according to manufacturer’s protocol.",
    "NOTE: Coating the well with extracellular matrix results in a high protein concentration in each well. Therefore, subtract the amount of the background well(s) (no cells) to get actual cell protein concentration. The protein concentration derived from cells is low in a 96-well culture plate. In addition, protein concentration can vary from well-to-well due to extracellular matrix coating. Therefore, using cell number to normalize the OCR is suggested.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}