{
  "id": 4737,
  "origin_website": "Bio",
  "title": "Protein Immunoprecipitation Using <em>Nicotiana benthamiana</em> Transient Expression System",
  "procedures": [
    "Grow Nicotiana benthamiana at 22 °C (16 h day/ 8h night) to the age of 4 weeks. Grow Agrobacterium strains harboring binary vector with the targeted gene fused with 3x FLAG overnight at 28 °C at 200 rpm in 3 ml LB with proper antibiotic selection. With a sterilized pipette tip, inoculate a tiny amount of Agrobacterium glycerol stock into the test tube.Prepare induction medium and inoculate agrobacterium from the LB medium into the induction medium. (1/100 dilution for overnight culture or 1/25 for about 8 h culture). This can be done in the morning to prepare for an evening infiltration, or at night to prepare for infiltration the next morning. Incubate at 28 °C, with shaking at 200 rpm, for ~8-12 h, so that the Agrobacterium cell is in the log growth phase. The best OD value should be 0.6-0.8.Centrifuge Agrobacterium culture in 50 ml Falcon tube for 10 min at 3,200 x g to pellet the cells.Prepare infiltration solution.Resuspend Agrobacterium pellet in ~5-10 ml of infiltration solution.Measure the OD of Agrobacterium cell and add appropriate amounts of infiltration solution to dilute the Agrobacteria to the desired OD (usually 0.1-0.3 OD). Make at least 1 ml infiltration solution per leaf. If you want to co-express two or multiple proteins, mix different kinds of Agrobacteria, with the desired OD for each one. It’s recommended to carry out preliminary expression experiment to test the protein expression level for different constructs. You can adjust the OD value for each kind of Agrobacteria based on its protein expression level in N. benthamiana. For instance, you can use larger OD value for Agrobacteria expressing lower protein while use smaller OD value for Agrobacteria expressing abundant protein.Water the N. benthamiana plants about 30 min before the infiltration to make the infiltration easier.",
    "Choose the proper leaves for infiltration. Choose the healthiest looking plants, and avoid leaves that are torn or otherwise damaged. The ideal leaves are the young leaves, ~3-5 cm across, use 2-3 leaves per plant. One leaf is about 0.1 g of tissue, which is enough for measuring protein expression. For immunoprecipitation, 10 leaves are usually enough. Use a 1 ml blunt syringe to inject the solution into the underside of the leaf. Swirl the solution in the tube before drawing it up into the syringe, in order to evenly suspend the agrobacterium. Try to be as gentle as possible when injecting, to avoid damaging the leaf. The infiltrated area can easily be seen as a dark, water-soaked region. If the infiltrated region stops expanding without pushing too hard, infiltrate again in a different area of the leaf. There is no specific requirement for the infiltration regions as long as the infiltration can cover the leaf. Try to finish the infiltration using less than 5 different infiltrations per leaf. There is short video showing the Agrobacteria infiltration of N. benthamiana: https://www.youtube.com/watch?v=GHc7PU_jG2M[href=https://www.youtube.com/watch?v=GHc7PU_jG2M]. After infiltration, the plants can be grown at the same condition as before.Harvest the N. benthamiana leaves without the main vein at 36-48 h after agrobacterium infection. 1 g tissue usually is enough. Time point experiment might need to be carried out to decide at which time point the protein express the highest. Grind the tissues into a fine powder in liquid nitrogen using a cold mortar and pestle.",
    "Add extraction buffer [see Recipes, with 2% PVPP (polyvinylpolypyrolidone), 10 mM DTT, 1x protease inhibitor (PI) and 1 mM PMSF] into the mortar (2 ml extraction buffer per gram plant tissue), place it in the 4 °C fridge, wait until the powder start to thaw and homogenize the mixture by grinding.Transfer all the liquid into the 1.5 tubes and centrifuge at highest speed for 10 min at 4 °C.Transfer the supernatant into new tubes and centrifuge for another time.Transfer the supernatant into the tubes and add 20% NP40 to a final concentration of 0.15%.Add 20 μl protein G sepharose beads into the sample and incubate for 30 min in the cold room to pre-clear the sample (the beads were pre-equilibrated using 1 ml extraction buffer and the supernatant buffer was discarded after centrifugation at 12,000 x g for 30 sec).Pellet the beads by centrifugation at 12,000 x g for 30 sec and transfer the supernatant into new tubes. 60 μl of the supernatant is taken as the input sample, which stands for the sample before immunoprecipitation.Add 10 μl anti-FLAG beads into the supernatant. The beads also need to be equilibrated as shown in step 18. Incubate the beads at 4 °C for 3 h on an Eppendorf tube rotator.Pellet the beads by centrifugation and take 60ul of supernatant for flow-through sample.Wash the beads with 1 ml extraction buffer (with 0.15% NP40) for 3 times. For each washing step, pellet the beads by centrifuging at 12,000 x g for 1 min at 4 °C, discard the supernatant and add 1 ml extraction buffer.Add 100 μl diluted 3x FLAG peptide (dilute the 3x FLAG stock 1/10 in TBS containing 1 mM EDTA with 1x protease inhibitor. The 3x FLAG stock is 2.",
    "5 mg/ml in TBS which can stored at -20 °C for years) into the beads and incubate in the cold room for 1 h on an Eppendorf tube rotator. Pellet the beads by centrifugation. Transfer the supernatant into a new tube. Add 35 μl 4x SDS loading buffer into the supernatant. This fraction is the elution sample containing the purified immunoprecipitated protein. Add 60 μl 1x SDS loading buffer into the tube containing the beads. The beads sample might contain the residue protein that fails to elute from the beads.Add proper volume of 4x SDS loading buffer to the samples of input and flow-through. Boil all the samples at 95-100 °C for 5-10 min. And analyze the samples using Western blot."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}