{
  "id": 18608,
  "origin_website": "Jove",
  "title": "Generation and 3-Dimensional Quantitation of Arterial Lesions in Mice Using Optical Projection Tomography",
  "procedures": [
    "1. Surgical Induction of Neointimal Lesions in the Mouse Femoral Artery\nExperiments using animals should be performed in accordance with national and institutional ethics requirements. All surgery should be performed using appropriate aseptic technique. Induction of neointimal lesions is achieved using a modification of the technique described by Roque et al.12 and Sata et al.13.\nWeigh male C57Bl6/J mice (Age 10-12 weeks; weight 25-30 g) then anaesthetize by delivering 4-5% isoflurane in an induction chamber. Once anesthesia has been induced, transfer the mouse to a heated mat to maintain body temperature at 37 °C. Continue administration of isoflurane (2-3%) via a mask.\nOnce an appropriate level of anesthesia has been induced (lack of response to toe pinch), provide analgesic cover by administration of buprenorphine (0.1 mg/kg-1). Then place the mouse in a supine position and shave the ventral surface of the left hindlimb.\nMake an incision to expose the muscles of the upper hindlimb and, between the bifurcation with the popliteal artery and the abdominal wall, use blunt dissection to isolate the femoral artery and vein from the femoral nerve. Irrigate the wound as required using 1% w/v lignocaine.\nPlace proximal (close to the abdominal wall) and distal (immediately below the branch with the popliteal artery) temporary ligatures (6/0 Mersilk) around the femoral artery and vein to control blood flow. Then isolate the popliteal artery (for approximately 2-5 mm distal to the branch with the femoral artery) and ligate distally. Place a second, untied ligature beneath the popliteal artery.",
    "Make a small incision (arteriotomy) in the popliteal artery, immediately distal to the branch with the femoral artery, preventing bleeding by applying pressure to the proximal temporary ligature. Advance a straight, sprung 0.014” guidewire 1-1.5 cm along the femoral artery in the direction of the abdominal wall and leave in place for 30 sec (Figure 1A).\nRemove the guidewire and ligate the popliteal artery above the arteriotomy, using the ligature placed for that purpose, and taking care not to occlude the femoral artery.\n\tNOTE: For ligation-induced injury. Neointimal remodeling without intraluminal injury can be induced by ligating the femoral or popliteal arteries (Figure 1B and 1C). To achieve this follow steps 1.1-1.5. However, do not make the arteriotomy but (avoiding step 1.6) either (i) ligate the popliteal artery immediately distal to the femoral artery or (ii) ligate the common femoral artery at the branch point with the popliteal artery. Then proceed with step 1.8.\nRemove temporary ligatures, close the wound with a discontinuous external suture (5/0 Mersilk) and apply EMLA cream (2.5% lidocaine, 2.5% prilocaine). Allow the animals to regain consciousness (usually 5-10 min) and ensure they are moving freely around their cage (slight lameness may be evident in the affected leg but this should resolve over the first 2-3 days after surgery) before returning to holding rooms. Mice do not have to be housed singly after surgery.\nAllow the animals to recover for up to 3 months. Small lesions will begin to appear ~7 days after wire injury and will reach a stable maximum size after ~ 21-28 days.\n2. Induction of Atherosclerotic Lesions in the Apolipoprotein E-/- Mice\nAdminister western diet (0.2% cholesterol; Research Diets, USA) to male, 6 week old ApoE-null mice (bred in house) for 12 weeks.",
    "Atherosclerotic lesions are often visible on gross inspection of the aortic arch and its major branches (Figure 2).\n3. Analysing Arterial Lesions using Optical Projection Tomography (OPT)\nNOTE: OPT images of lesions in murine femoral arteries and aortic arch samples were obtained using an optical projection tomograph.\nEuthanize mice by transcardiac perfusion fixation and exsanguination under terminal anesthesia (80 mg/kg sodium pentobarbital), using heparinised (10 U/ml) phosphate buffered saline (PBS) followed by 10% neutral buffered formalin.\nIsolate femoral arteries or the aortic arch and its major branches (left carotid artery, left subclavian artery, brachiocephalic trunk), as appropriate, and remove extraneous peri-adventitial material. Post-fix in 10% buffered formalin O/N, before storage in 70% ethanol until needed.\nEmbed arteries in 1.5% low melting point agarose, pre-filtered through Whatman 113 V paper. Attach each sample to a magnetic OPT mount with cyanoacrylate adhesive with the vessel axis in line with that of the mount. Trim excess agarose to a conical shape. Dehydrate in 100% methanol for at least 12 hr.\nClear vessels by immersion (for 12-24 hr) in a mixture of benzyl alcohol and benzyl benzoate (1:2 v/v).\nPlace cleared samples in a calibrated tomograph. Set resolution to 1,024 x 1,024, and determine an optical magnification that allows the entire area of interest to be seen. OPT volume is isotropic the z-axis is reconstructed to the same resolution (i.e., 1,024 x 1,024 x 1,024), voxel size ~200 µm. This may represent an over-estimate of resolution as there are likely to be reconstruction artifacts. Adjust sample position so that it rotates upon its own axis in the center of the field of view in the bright-field, transmission channel.",
    "In the GFP1 filter emission channel (excitation filter 425 nm with 40 nm band-pass; emission filter: 475 nm long pass), focus the specimen and adjust exposure time to maximize the dynamic range of the resulting image (avoid over-saturation). Scan the vessel in the GFP1 emission channel only, with a 0.9°rotation step.\nAt completion, confirm quality of data acquisition using DataViewer software. Remove specimen from the scanner.\nTo allow subsequent histological analysis, place sample in 100% methanol for >24 hr before processing to paraffin wax as normal.\n4. Image Reconstruction and Analysis\nTomographic re-construction by filtered back-projection is performed using NRecon software or similar. Reconstructions can be performed unattended, in batches.\nImprove image quality by compensating for misalignment and adjusting image intensity levels.\nCheck the quality of image reconstruction using DataViewer software.\nIdentify the appropriate section of the sample for analysis. Keep this length consistent between vessels if luminal dimensions are to be recorded.\nDefine the outline of the lesions by manually tracing the appropriate border for 1 in every 50 re-constructed cross-sections.\nCheck each interleaved cross-section to ensure computer-generated interpolations are correct. Manually adjust the border where necessary.\nSet the grey-level threshold so that only the lesion is selected and export the measurement data.\nFor each scan, define a vertical region of interest containing the lesion and trace the border between media and neointima (i.e., the position of the internal elastic lamina) for every 50th scan-line. Interpolate intima/media borders for the interleaved scan lines in software, and verify and correct the fit where required. Further segment this defined three dimensional volume to a manually-defined intensity threshold to produce a binary image set in which white pixels represent neointima and black pixels represent patent lumen.",
    "Measurements taken include: total lesion volume (object volume), luminal volume (total volume – object volume) and the distribution of lesion and lumen cross-sectional area along the axial length of the studied vessel."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}