{
  "id": 1933,
  "origin_website": "Cell",
  "title": "Transcriptome profiling of PBMCs and formalin-fixed autopsy tissues from COVID-19 patients",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nRNA isolation\nTiming: approximately 1 h for PBMC samples and 2 h for FFPE samples\nThis step will enable RNA isolation from PBMC and FFPE samples. The protocols and timing below are described for 12 samples. This corresponds to the number of samples that can be run in one NanoString cartridge. Please note that steps 1 and 2 under ‘RNA isolation’ can be carried out independently as they refer to RNA isolation of PBMC and FFPE samples respectively (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1415-Fig2.jpg\nFigure 2. Schematic of RNA isolation from PBMC and FFPE samples\nRNA is isolated using the RNeasy Mini Kit (Qiagen) when using PBMC samples and the AllPrep DNA/RNA FFPE Kit (Qiagen) when using FFPE samples, according to the manufacturer’s protocols (please refer to https://www.qiagen.com/us/resources/resourcedetail?id=14e7cf6e-521a-4cf7-8cbc-bf9f6fa33e24&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=14e7cf6e-521a-4cf7-8cbc-bf9f6fa33e24&lang=en] for RNeasy Mini Kit; and to https://www.qiagen.com/us/resources/resourcedetail?id=3ff86eb0-d95b-4941-95c3-252ad30fe3e6&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=3ff86eb0-d95b-4941-95c3-252ad30fe3e6&lang=en] for AllPrep DNA/RNA FFPE Kit). Changes from the original protocols have been indicated.\nNote: For both PBMC and FFPE samples, we recommend including control and patients’ samples in the same run. This will enable avoiding a batch effect potentially confounding the analysis of results. This recommended experimental setup will also enable assessing whether differences between control and patients’ samples are consistent between runs.\nRNA isolation from PBMC samples Reagents preparation for RNeasy Mini Kit: Before starting RNA isolation from PBMC samples, we recommend i) adding 10 μL β-mercaptoethanol (Sigma Aldrich, St. Louis, MO) to 1 mL of RLT Buffer (included in the kit) before use; ii) adding 4 volumes of 100% ethanol to RPE Buffer, which is supplied as a concentrate in the kit; iii) preparing 70% ethanol.\nCritical: β-mercaptoethanol should be added to RLT Buffer under a fume hood while wearing appropriate protective clothing.",
    "Note: Buffer RLT containing β-mercaptoethanol can be stored at room temperature for up to one month without being degraded.\nNote: The procedure described here is optimized for 5–10 × 106 PBMCs per sample. For samples with lower cell numbers, add half of the volumes indicated below.\nAdd 600 μL RLT Buffer and pipet to resuspend the pellet. Do not centrifuge.\nAdd 600 μL 70% ethanol to the homogenized cell pellet and mix by pipetting.\nTransfer 600 μL sample to a RNeasy spin column placed in a 2 mL collection tube, supplied with the kit.\nNote: We recommend adding no more than 600 μL sample to avoid unnecessary spillage when closing the lid.\nCentrifuge at 10,000×g for 30 s. Discard the flow-through and re-use the collection tube.\nCentrifuge the remaining 600 μL sample at 10,000×g for 30 s, using the same RNeasy spin column. Discard the flow-through after centrifugation.\nAdd 700 μL RW1 Buffer to the column and carefully close the lid. Centrifuge at 10,000×g for 30 s and subsequently discard the flow-through. Please re-use the same collection tube.\nNote: After centrifugation carefully remove the column from the collection tube to avoid the column getting in contact with the discarded flow-through.\nAdd 500 μL RPE Buffer to the column and spin at 10,000×g for 30 s. This step enables washing the column membrane. After discarding the flow-through, please re-use the collection tube.\nAdd 500 μL RPE Buffer to the column and spin at 10,000×g for 2 min. This centrifugation enables drying the spin column membrane from ethanol, which may interfere with subsequent steps. Remove the spin column and discard the flow-through.\nPlace the column into a new 2 mL collection tube (supplied with the kit) and centrifuge at 12,000×g for 1 min. This step enables removal of residual RPE Buffer.",
    "Place the column into a new 1.5 mL collection tube (supplied with the kit) and add 25 μL RNase free water to the column membrane. After closing the lid, leave the columns on the bench for 1 min and then centrifuge at 10,000×g for 1 min. This step will enable RNA elution.\nNote: The volume of RNase free water depends on the initial number of cells. For large cell numbers, the volume of water applied to the column should be adjusted.\nRNA isolation from FFPE samples Reagents preparation for AllPrep DNA/RNA FFPE kit: Before starting the protocol, we recommend preparing i) RLT Buffer by adding 10 μL β-mercaptoethanol/mL Buffer; ii) FRN Buffer by addition of 42 mL 100% isopropanol to the 14 mL concentrate (then tick the box on the bottle to indicate that isopropanol addition has been made); if precipitation is noted for RLT and/or FRN Buffer, we recommend dissolving by warming the solution with gentle agitation; iii) RPE Buffer by adding 4 volumes of ethanol (i.e., 44 mL) to the bottle containing 11 mL concentrate RPE Buffer.\nNote: Shake the bottles before use to ensure mixing of the solutions.\nDeparaffinize using xylene; add 1 mL xylene and vortex vigorously for 10 s, then centrifuge at 10,000×g for 2 min.\nRemove the supernatant by either pipetting without disturbing the pellet, or, alternatively, by pouring it into a fresh tube. We prefer this second option.\nAdd 1 mL 100% ethanol, vortex and centrifuge at 10,000×g for 2 min.\nRemove the supernatant as indicated in ‘b’.\nIncubate at room temperature for 10 min with the lid open.\nAdd 150 μL PKD Buffer and flick the tube to loosen the pellet. Add 10 μL proteinase K and vortex.\nIncubate at 56°C for 15 min.\nIncubate on ice for 3 min.",
    "Centrifuge at 20,000×g for 15 min.\nNote: During centrifugation, set the heating block at 80°C.\nTransfer the supernatant without disturbing the pellet into a new 2 mL safe-lock microcentrifuge tube for RNA purification.\nIncubate the supernatant at 80°C for 15 min.\nNote: Do not exceed the 15-min incubation. If the heat block has not reached the 80°C yet, the sample should be left at room temperature while the desired temperature is achieved.\nBriefly centrifuge to remove the drops from the lid.\nAdd 320 μL RLT Buffer and mix by pipetting.\nAdd 1,120 μL 100% ethanol and mix by pipetting.\nTransfer 700 μL sample (including precipitates that may have formed) to a RNeasy MinElute spin column, which is placed in a 2 mL collection tube (supplied with the kit). Centrifuge at 10,000×g for 30 s. Repeat the step until the entire sample volume has passed through the column.\nAdd 350 μL FRN Buffer to the column and centrifuge at 10,000×g for 30 s and discard the flow-through.\nNote: Although indicated in the manufacturer’s protocol, we do not perform DNase treatment. However, we recommend you test this additional step in your experiment. For example, if the analysis of RNA integrity indicates strong genomic DNA contamination, DNAse treatment step becomes necessary.\nAdd 500 μL FRN Buffer to the column and centrifuge at 10,000×g for 30 s. Save the flow-through as this contains RNA.\nPlace the column into a new 2 mL collection tube (supplied with the kit) and apply the flow-through to the column. Centrifuge at 10,000×g for 30 s and discard the flow-through.\nAdd 500 μL RPE Buffer to the column, centrifuge at 10,000×g for 30 s and discard the flow-through.",
    "Add 500 μL RPE Buffer to the column and centrifuge at 10,000×g for 30 s to wash the column membrane. After centrifugation, discard the collection tube and the flow-through.\nPlace the column into a new 2 mL collection tube (supplied with the kit) and centrifuge at 10,000×g for 5 min keeping the lid open.\nPlace the column into a new 1.5 mL collection tube (supplied) and add 20 μL RNase free water to the column membrane. Close the lid and incubate at room temperature for 1 min.\nCentrifuge at 12,000×g for 1 min.\nNote: When adding water to the column membrane, please consider that the dead volume in the column is 2 μL.\nRNA quantification and purity assessment\nTiming: 1 h\nIn this step, measurement of RNA concentration will be carried out using NanoDrop Spectrophotometer. RNA integrity will be evaluated using Agilent Bioanalyzer.\nMeasure the concentration of RNA isolated from PBMC and/or FFPE samples using NanoDrop Spectrophotometer:\nBring the RNA samples along with RNase free water used to elute them on ice to the NanoDrop Spectrophotometer Station.\nClean the sample reader with molecular grade water and wipe with a KimWipe.\nLoad 1.2 μL of RNase free water and initialize the system.\nSelect ‘RNA’ and click ‘blank’.\nLoad 1.2 μL of RNA sample and click ‘measure’.\nRecord the A260/280 and A260/A230 ratios along with the RNA concentration (ng/mL).\nWipe the sample reader between samples with a clean KimWipe and repeat steps e-f.",
    "Note: RNA samples with a A260/A280 ratio ranging from 1.8 to 2.1 are considered of good purity. A A260/A280 ratio lower than 1.8 may indicate DNA or protein contamination. This is, however, more frequent when other protocols of RNA isolation are applied (e.g., TRizol). The optimal A260/A230 ratio should be above 2. Lower values are indicative of contamination with the wash solutions, phenols and proteins. Troubleshooting 1[href=https://www.wicell.org#sec7.1]. Troubleshooting 2[href=https://www.wicell.org#sec7.3].\nCheck RNA integrity using Agilent Bioanalyzer. 2.5 μL per sample is used.\nNote: RNA integrity is assessed as an additional measure of the sample RNA quality. The Distribution Value 200 (DV200) is the percentage of RNA fragments longer than 200 nucleotides. The lower is the DV200 value, the more degraded is the RNA in the sample. Reportedly, DV200 < 30% are considered being degraded for further experiments (Wimmer et al., 2018[href=https://www.wicell.org#bib9]); values of DV200 between 50% and 70% are of acceptable quality but might require higher input volumes for transcriptome analysis (Wimmer et al., 2018[href=https://www.wicell.org#bib9]). DV200 values higher than 70% are usually associated with high RNA quality (Wimmer et al., 2018[href=https://www.wicell.org#bib9]). Based on this evidence, we recommend using samples with DV200 higher than 70% to maximize the chances of success in the NanoString assay. For additional information on how the DV200 is calculated, please refer to https://www.agilent.com/en/promotions/dv200-determination[href=https://www.agilent.com/en/promotions/dv200-determination].\nNanoString assay\nTiming: approximately 2 days\nNanoString technology enables detection and counting of hybridized transcripts using barcodes. In this protocol step, RNA hybridization and post-hybridization processing are carried out as per manufacturer’s instructions at https://www.nanostring.com/support-documents/ncounter-xt-assay-user-manual/[href=https://www.nanostring.com/support-documents/ncounter-xt-assay-user-manual/]. (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1415-Fig3.jpg\nFigure 3. Schematic of NanoString assay procedure. Critical steps are highlighted\nDay 1\nPre-heat the thermocycler to 65°C (lid temperature 70°C). Program the thermocycler for 18 μL volume.",
    "Thaw the Reporter Code Set (nCounter CAR T Characterization Panel), the Capture Probe Set (nCounter CAR T Characterization Panel), PLUS COVID-19 Reporter and PLUS COVID-19 Capture (Coronavirus Panel Plus). Thawing is carried out at room temperature. Invert or flick the tubes several times and spin at less than 1,000×g for less than 30 s.\nCritical: Do not vortex or pipette vigorously as this may shear the Reporter Code Set. When using the microcentrifuge to spin down the tube, please do not use speed higher than 1,000×g for more than 30 s. Pulse centrifugation should be avoided too.\nAdd 28 μL of PLUS COVID-19 Reporter to Reporter Code Set. Invert or flick several times and spin down tubes, as indicated in step 6.\nPrepare a master mix by adding 70 μL of hybridization Buffer to the tube containing PLUS COVID-19 Reporter and Reporter Code Set. The Reporter Code Set should not be removed from the tube.\nAfter labeling tubes, add 10 μL of the master mix into each tube.\nAdd 100 ng of RNA sample per tube. The volume should not exceed 5 μL; if less, adjust with RNase free water. The total volume per tube should be 15 μL.\nAdd 14 μL of Capture PLUS Reagent to the thawed aliquot of Capture Probe Set. Invert several times to mix and spin down reagents.\nAdd 3 μL of Capture Probe Set and Capture Plus Reagent mix into each tube immediately before placing it at 65°C.\nNote: It is important minimizing the time between the addition of the Capture Probe Set and the incubation at 65°C as this will improve assay sensitivity.\nIncubate in the thermocycler at 65°C for 18 h. Ramp the reaction down to 4°C (see table) and process the following day.",
    "Note: We recommend not leaving the samples at 4°C for more than 24 h as this may result in increased background.\ntable:files/protocols_protocol_1415_1.csv\n∗This includes 16 h hybridization and 2 h at 4°C.\nNote: It is recommended not hybridizing more than 12 samples at the same time.\nDay 2\nRemove the samples from the thermocycler and spin them down.\nNote: Make sure that no evaporation has occurred, and all samples have the same volume.\nTake the two 96-well plates (supplied with the NanoString kit) from the refrigerator at 4°C and spin them down at 2,000×g for 2 min. Remove the cartridge from −20°C freezer.\nBring the samples, 96-well plates, tips and cartridge to the nCounter Prep Station.\nPrepare the nCounter Prep Station based on the manufacturer’s instructions, shown on the display. Please also refer to the manual https://www.nanostring.com/wp-content/uploads/2020/12/MAN-C0035_nCounter_Analysis_System_MAX_FLEX.pdf[href=https://www.nanostring.com/wp-content/uploads/2020/12/MAN-C0035_nCounter_Analysis_System_MAX_FLEX.pdf]\nFollow the instructions on the screen without changing any setting. The run is already pre-set for ‘high sensitivity’.\nPlace the plates on the deck with labels forward. Discard the lids.\nRemove the foil from the cartridge. Before loading the cartridge, make sure the bottom is not cracked or damaged. Place the cartridge under the electrode fixture with the notch in the back and the barcode on the right. The right side should bounce up and down after applying a light pressure from your finger. Lower the electrode fixture to insert the electrodes in the cartridge.\nNote: When loading the tips (supplied with the kit and kept at room temperature until use), you can facilitate the procedure by covering them with a plate lid.\nPlace the tip sheaths in the slot in front of the tip rack.\nPlace empty strip tubes, provided with the kit, into the heater block.\nUncap the sample strip tubes and place them into the metal tube holder.",
    "Close the heater lid and click ‘Start Processing’. The processing will take approximately 3 h.\nNote: We recommend waiting for 10 min until the ‘System Processing’ message appears on the display (this indicates that the validation automatically carried out by the machine is completed and the run is starting).\nAfter 3 h, remove the cartridge from the nCounter Prep Station and seal it with the clear adhesive film (supplied with the kit).\nCritical: Make sure to seal the cartridge within 1 h after processing, to avoid evaporation and subsequent data loss.\nNote: Cartridges can be scanned immediately after processing or stored in the dark at 4°C for up to 1 week.\nClean the nCounter Prep Station following the instructions shown on the display and proceed to the nCounter Digital Analyzer.\nRetrieve the NanoString supplied USB from −80°C. The CodeSet from NanoString is shipped with a Reporter Library File (RLF) that can be found on the NanoString USB inside the −80°C CodeSet box. The RFL contains the barcode definitions for the group of probes included in the CodeSet.\nInsert the NanoString supplied USB into the nCounter Digital Analyzer (port on the right-hand side of the Digital Analyzer touch screen) and follow the instructions on the screen and as indicated in the manufacturer’s protocol https://www.nanostring.com/wp-content/uploads/2020/12/MAN-C0035_nCounter_Analysis_System_MAX_FLEX.pdf[href=https://www.nanostring.com/wp-content/uploads/2020/12/MAN-C0035_nCounter_Analysis_System_MAX_FLEX.pdf]\nClick on ‘Upload Files’ and then ‘Upload RLF’.\nNote: This is done for the first run of each NanoString panel. RLF files are saved in the analyzer).\nClick on ‘Start Counting’ and select a stage position on the touch screen.\nPlace the cartridge in the selected stage position by holding it lengthwise. Close the magnetic clip and push down to ensure the cartridge is flat.",
    "Under Cartridge Definition Mode, select ‘Create New’. This option is for use with generic sample names. If specific names are used, please refer to ‘Creating a CDF section’ in the nCounter Analysis System Manual https://www.nanostring.com/wp-content/uploads/2021/02/MAN-C0035-08-nCounter-Analysis-System-User-Manual.pdf[href=https://www.nanostring.com/wp-content/uploads/2021/02/MAN-C0035-08-nCounter-Analysis-System-User-Manual.pdf]\nEnter a cartridge ID.\nSelect ‘fields of view (FOV) count’ for scanning.\nNote: Higher FOV counts result in longer scanning time and generate less noisy data. In our protocol, the maximum FOV count (i.e., 555) was used.\nClick ‘Samples’ and select all sample tubes.\nEnter a ‘Sample ID’; individual samples will be differentiated by lane numbers.\nClick ‘Library RLF’ and select the RLF that corresponds to the CodeSet being run.\nClick ‘Done’ to return to the Cartridge Information Screen; click ‘Done’ again to return to the Select Stage Position Screen; and then ‘Done’ for the third time, if no additional scans are planned.\nClick ‘Start’.\nNote: The run will take approximately 5 h. The cartridge can be left in the counter until the next day and then placed at 4°C, covered by aluminum foil. This would enable scanning the cartridge again, if needed.\nOnce the scan has completed, insert a USB drive into the Digital Analyzer USB port.\nClick ‘Download data’ from the touch screen.\nSelect the file corresponding to the cartridge ID and click ‘Download data’ and export Reporter Code Count (RCC) files."
  ],
  "subjectAreas": [
    "Gene Expression",
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Cell Biology",
    "Cell-Based Assays",
    "Microbiology",
    "Molecular Biology",
    "Clinical Protocol"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}