{
  "id": 10431,
  "origin_website": "Jove",
  "title": "Isokinetic Robotic Device to Improve Test-Retest and Inter-Rater Reliability for Stretch Reflex Measurements in Stroke Patients with Spasticity",
  "procedures": [
    "1. Experimental set-up\nPatient recruitment\n\tNOTE: All procedures were reviewed and approved by the Seoul National University Bundang Hospital Institutional Review Board. These subjects were inpatients or outpatients with stroke diagnoses from four rehabilitation hospitals in the region.\n\t\nPerform the screening process using the following inclusion criteria: (1) upper extremity hemiparesis due to stroke; (2) over the age of 20 years; (3) mild elbow joint spasticity of MAS 1-2; (4) no previous disease affecting function of the hemiparetic arm, except for stroke; (5) free from hemodynamic instability; (6) no severe elbow contracture; (7) possibility for the shoulder to be abducted 90° and forearm to be in the neutral position without any joint pain; and (8) normal cognitive, language, visuospatial, or attention ability to follow experimental procedures.\n\t\tNOTE: The criteria are designed to screen patients who are able to participate in the experiment and regulate factors affecting the results.\nRecruit subjects who are provided with a detailed explanation of the entire study and expected clinical issues. Consent must be obtained prior to inclusion.\nDemographics and baseline characteristics of the recruited subjects are shown in Table 1.\nExperimental system\n\tNOTE: A customized robotic device is used to produce standardized motion and measure the quantitative data simultaneously. The robotic system consists of a robotic part, control system, and measurement units. The overall configuration is shown in Figure 2.\n\t\nRobotic part\n\t\t\nFor the robotic part, use a one-degree-of-freedom planar robot consisting of a motor and a forearm manipulandum, with three other components for adjusting the robot height and installing the device to various desks. The overall composition is shown in Figure 2A.",
    "For the forearm manipulandum, use an elbow joint connected to the motor, a linear slider with a fixation block to adjust the overall length and two cuff units for fixating the forearm and hand (as shown in Figure 3). The elbow joint has a rotating plate and a thrust bearing to prevent chafing during the experiment, and the cuff units were curved similar to that of a human forearm and were made using a 3D printer. The handle unit is designed to accommodate both left and right handed individuals, making it available to any subjects.\nUse a motor with a low gear ratio of 51:1, which should have back-drivable characteristics and the ability to produce a nominal speed of 315°/s and a continuous torque of 42.33 Nm.\nUse a lab jack unit that is attached to the bottom of the motor to adjust the height of the motor unit. The height of the robot will be able to be adjusted to the sitting height of various subjects.\nPlace a fixation arm for mounting the device to the desk on the front part of the robot. The fixation arm will be movable up and down through a linear shaft and has clamps for securing to the desk.\nPlace casters with stopper on the bottom of the robot, making the robot movable and grounded during the experiment.\nControl system\n\t\t\nUse a personal computer (PC), real-time processor, and motor driver for the central control system. The detailed control architecture block diagram is shown in Figure 4.\nUse a graphic user interface (GUI) to control the experiment mode (maximum ROM measurement, Isokinetic MTS, and manual MTS measurement modes) and store robot motion data. It contains a control panel and a monitoring panel (Figure 5). Details on the GUI configuration are included in the appendix.",
    "Implement the robot control algorithm using a real-time processor. The control algorithm consists of three control loops. The first loop is a data input/output loop that runs at 1 MHz from the FPGA module of the sbRIO. The second is a robot motion control loop that runs at 1 kHz from the real-time VI level. The last is a data communication loop that runs at 250 Hz. This loop transmits robot data (time, angle, torque and trigger signal for matching with EMG data).\n\t\t\tNOTE: The real-time processor has two communication modules: NI-9237 and NI-9853. The NI-9237 is an analog input device for receiving torque sensor data, and the NI-9853 is a CAN communication module for communicating with the motor driver.\nMeasurement units\n\t\t\nMount a torque sensor between the manipulandum and the motor to measure the reaction force. The torque data is transferred to the real-time processor via NI-9237. The NI-9237 has its own passband, stopband, and alias-free bandwidth filter. The filtered data enters the FPGA module and is processed again at 100 Hz with a low-pass filter to remove noises.\nMeasure the joint angle by an encoder (HEDL 9140, Maxon, Switzerland) attached to the motor. The angle data is transferred to the real-time processor via the motor driver.\nMeasure muscle activity with an eight-channel surface EMG device. The EMG data was collected at a sampling rate of 1024 Hz, and initially processed with a bandpass filter (20–450 Hz) and a notch filter (60 Hz). The measured EMG data is transferred to the PC directly.\n2. Experimental set-up",
    "NOTE: Two raters should participate in this experiment. In our case, the first rater was a physiatrist with more than 6 years of experience in rehabilitation, and the second rater was an occupational therapist with more than 3 years of experience in stroke rehabilitation.\nInitial posture setting\nPlace the patient in a chair with his/her back in a straight posture.\nSecure both sides of the shoulder and abdomen with seatbelts to keep the shoulder position stable throughout the experiment.\nPlace the subject’s hemiparetic arm lightly on the robot manipulandum without fastening the strap.\nUnfasten the fixation block of the linear slider so that the cuff can be moved freely on the slider and allow the subject’s hemiparetic arm to be placed on the robot manipulandum without fastening the straps.\nAdjust the height of the robot using the lab jack until the patient’s shoulder is abducted 90°. Confirm the abduction angle using a goniometer.\nInstruct the subject to hold the handle and fasten the hand to the handle with straps. Align the rotation axis of the robot and anatomical axis of the elbow joint.\nFlex and extend the elbow joint so that the position of the cuff can be readjusted naturally in an optimal position without generating resistance during the elbow movement. Then, fasten the fixation block to fix the position of the cuff and fasten the straps of the forearm cuff.\nAttach the surface EMG electrodes on the biceps brachii muscle in the hemiparetic arm.\nPassive ROM measurement\n\tNOTE: Passive ROM is used as a boundary ROM in the following experiments to prevent problems caused by movement outside the patient’s operation range.\n\t\nInput the patient's hemiparetic side information into the program GUI (right or left).",
    "Set the elbow 90° flexed using a goniometer. Press the 90 deg set button on the GUI panel. This process matches the angle recognized by the robot with the actual human joint angle.\nPress the Finish set button on the GUI to switch the robot to the actuating state.\nClick the buttons on the Motor run panel on the left side of the GUI in order from top to bottom.\nTurn on the Angle set button and set the speed to 1°/s. Then click the run button. The robot will extend the elbow slowly at 1°/s from a 90° flexed posture until the reaction torque reaches a certain threshold level or extends by 170°.\n\t\tNOTE: In this experiment, the torque threshold was set to 0.6 Nm. This value is determined experimentally via a pilot study.\nThe maximum extended angle is automatically stored as the maximum ROM.\nChange the speed to -1°/s and click the run button again. The robot flexes the elbow slowly until the reaction torque reaches the threshold level.\nThe maximum flexed angle is automatically stored as the minimum ROM.\n3. MTS measurement\nNOTE: The time required for each step is shown in Figure 1. The total time taken by one subject to perform all the experiment is about 50 min (including the experiment set-up step), but most of the time should be spent resting to maintain consistency of fatigue.\nInertia effect compensation",
    "NOTE: Theoretically, there should be no inertia effect during the isokinetic motion. However, there may be an inertia effect at the beginning of the motion. The inertial force should be compensated to measure only the reaction force generated by a stretch reflex. Since the magnitude of the inertial force is different for each subject, a preliminary test for the inertial force compensation should be performed before the actual MTS measurement. An example result is shown in Figure 6.\n\t\nClick the Back button on the control panel. The robot will flex the elbow to minimum angle posture (maximally flexed posture).\nSet the speed to 150°/s and turn on the Inertia test button then the Run button. The robot will apply a short perturbation of 5° to the patient at a rate of 150°/s. The peak torque and period value of each trial are automatically stacked and displayed on the GUI panel.\nRepeat steps 3.1.2–3.1.3 two more times. Determine a proper peak torque value and period value from the measured data and enter the value on the program GUI. The compensation torque profile (τcomp) is automatically generated based on Equation 1 below, where: a, represents the determined amplitude and λ represents the period.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59814/59814equ01.jpg\n\t\tNOTE: The shape of the inertial torque is modeled as a raised cosine shape to reduce the calculation load. The compensation torque, which is designed for two periods due to the inertia effect, almost disappears after the second period. The amplitude of the second period is designed to be 15% of the first period.\nFamiliarization step\nPrior to the actual experiment, perform three training operations to familiarize the patient with sudden movements.\nClick the Back button on the panel. The robot will flex the elbow to the minimum angle posture.",
    "Click the Run button after informing the subject. The robot will extend the patient’s elbow at a rate of 150°/s, until the angle reaches to a maximum angle or the reaction torque reaches the threshold level.\nRepeat steps 3.2.2–3.2.3 two more times and take a 5 min rest before starting the test.\nIsokinetic MTS measurement\n\tNOTE: The isokinetic MTS measurement is designed to implement an ideal MTS measurement condition. The robot produces accurate constant velocity motion at a predetermined speed (150°/s) until reaching the maximum ROM or until reaching a certain threshold of the reaction torque. The maximum ROM value is determined in step 2.2, and the torque threshold value is determined as 0.6 via previous pilot studies, which is sufficient for detecting stretch reflexes.\n\t\nClick the Back button to flex the elbow to the minimum angle posture.\nClick the Run button without informing the subject. The robot will extend the patient’s elbow at a rate of 150°/s until the angle reaches the maximum angle or the reaction torque reaches a certain threshold level. Time, angle, reaction torque, and trigger signal data are stored during the test.\nTake a 2 min break between sets and repeat steps 3.3.1–3.3.3 two more times.\nTake a 5 min rest after performing three sets.\nManual MTS measurement\n\tNOTE: The manual MTS measurement is designed to simulate the MTS measurement normally performed at actual medical sites. To compare the results of isokinetic MTS, the robotic device is used only as a quantitative measuring tool that removes the measurement error, and actual measurement operation is performed by a human rater. For this purpose, the robot only compensates the friction of the robot itself. Details of the friction removal is in the appendix.\n\t\nClick the Back button to flex the elbow to the minimum angle posture.",
    "Click the Free run button, and the robot operation will change to manual operation mode.\nHold the handle of the manipulandum and stretch the subject’s arm. During operation, the rater should generate a constant speed of 150°/s.\nTurn off the Free run mode and take a 2 min break.\nRepeat steps 3.4.1–3.4.4 two more times.\nRepeat MTS measurement\nTake a 10 min rest after finishing the whole experiment with the first rater.\nChange the rater (to the second rater) and repeat steps 3.3–3.4.\n4. Quantifying the AoC\nNOTE: AoC is determined based on two data: EMG and torque. AoC is determined by manual analysis due to the noisy characteristics of the EMG data and variability of individual characteristics. The AoC selection is carried out by a third rater, who is blind to the order of raters.\nIsokinetic MTS experiment data analysis\nAoC evaluation using EMG data\n\t\tNOTE: Generally, AoC is determined as the angle at which the maximum peak value of the EMG occurs. However, a stretch reflex duration is different for each patient; thus, using the EMG maximum peak point as an AoC is expected to have low reliability. The time difference may not be large; however, the AoC error can be significant due to the fast assessment speed of the MTS method. Therefore, the angle at the start of EMG upsurge point is selected as the AoC.\n\t\t\nProcess the raw EMG data using the root mean square (RMS) to smooth the data and amplify it 50x.\nSynchronize the EMG data and robot angle data using the trigger signals of each data set.",
    "NOTE: In this system, the EMG data is measured by an independent device, unlike other data; therefore, the reference time may be different. The EMG device has a trigger interrupt marking function, which obtains the trigger signal from a real-time processor at the onset of MTS assessment.\nDetermine the AoC manually as the starting point of the RMS EMG upsurge. The example is shown in Figure 7.\n\t\t\tNOTE: The RMS EMG of <0.1 is ignored here because it appears frequently even without the stretch reflex. Thus, a clear upsurge point at the start of the peak is selected as the AoC.\nAoC evaluation using the torque data\n\t\tNOTE: Muscles have passive mechanical characteristics that acts like a spring-damper system. Even if the muscle does not exert any force, the reaction force can increase as the muscles stretch. Because the intensity of the passive mechanical property and stretch reflex varies from patient to patient, it is difficult to identify the catch using only the absolute value of the reaction force. Instead, in this study, the catch is determined by changing the passive property due to spasticity rather than the absolute value of the reaction force. The change of the passive property is manually determined by the change in the slope of the regression line of the reaction torque.\n\t\t\nDraw one regression line from the point where the trigger signal goes up and draw another regression line from the point where the trigger signal goes down.\nCompare the slopes of the two regression lines. If the gradients of two regression lines show a significant difference, AoC can be determined at the intersection of two regression lines. The example is shown in Figure 8.\nManual MTS experiment data analysis",
    "NOTE: In the case of manual MTS, it is difficult to separate the force exerted by the subject and that applied by the rater using only one torque sensor. Therefore, in the case of manual MTS, only an AoC analysis using EMG data is performed without performing AoC analysis using the torque data.\n\t\nAoC evaluation using EMG data\n\t\tNOTE: The method to determining AoC evaluation using EMG is basically the same as for the isokinetic MTS case.\n\t\t\nProcess the raw EMG data using the RMS method to smooth the data and amplify it 50x.\nSynchronize the EMG data and the robot angle data using the trigger signals of each data set.\nDetermine the AoC manually as the starting point of the RMS EMG upsurge. An example is shown in Figure 9.\n5. Data analysis\nNormalized assessment motion index (NAMI)\n\tNOTE: The AoC of MTS can be affected by various motion factors, such as assessment speed, acceleration, etc. Therefore, the assessment motion should be as isokinetic as possible. The NAMI is proposed to evaluate the ideality of the assessment motion. The proposed index is a non-dimensional index that can be used to evaluate the consistency of the assessment motion assigned to the subjects in each trial.\n\t\nCalculate the ROM, maximum velocity and assessment time from each assessment trial.\n\t\tNOTE: The angle is measured by the encoder; thus, the calculated velocity is noisy. Therefore, the maximum velocity is determined as the maximum velocity of the trend line, not the peak point.\nCalculate the NAMI value for each trial during the whole experiment using Equation 3: imgsrc://cloudfront.jove.com/files/ftp_upload/59814/59814equ02.jpg",
    "Where: ϑmax and ϑmin represent maximum and minimum angles, respectively, measured during the experiment; ωmax is the maximum assessment speed; and Δt is the total time spent for one assessment. Figure 10 shows an example of each variable.\n\t\tNOTE: The proposed index gives a score close to 1 if the assessment motion is close to completely isokinetic and a score close to 0 if the velocity of the motion is inconsistent.\nStatistical analysis\n\tNOTE: All statistical analyses are performed using the PASW statistical package (SPSS version 18.0). The intraclass correlation coefficient (ICC) method is used to identify the test-retest reliability and inter-rater reliability. Only results from the second and third tests are used to calculate the ICC.\n\t\nTo verify test-retest reliability, calculate the ICC from the measured AoC data and NAMI result.\nTo verify inter-rater reliability, calculate the ICC from the average of AoC and NAMI data.\nCalculate the p-value of the AoC results using paired sample t-tests to evaluate the differences between each rater or each assessment trial.\n\t\tNOTE: P-values of <0.05 are considered statistically significant.\nCalculate the Pearson correlation coefficient between AoC based on EMG criteria and torque criteria to verify a correlation between the two methods.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}