{
  "id": 15234,
  "origin_website": "Jove",
  "title": "A Novel Saturation Mutagenesis Approach: Single Step Characterization of Regulatory Protein Binding Sites in RNA Using Phosphorothioates",
  "procedures": [
    "NOTE: Figure 1 provides an overview of phosphorothioate mutagenesis and summarizes key steps in the process.\n1. Generation of a Library of Mutants — Doping DNA Template with Non-wild Type Nucleotides\nSynthesize T7 Primer (5’-GTAATACGACTCACTATAG-3’) by chemical synthesis on a DNA synthesizer.\nSynthesize a doped oligonucleotide (complementary strand) by chemical synthesis on a DNA synthesizer corresponding to the protein binding site. Use an appropriate mixture of phosphoramidites during chemical synthesis for each site of doping (X below) with a ratio of 90% A as the wild-type nucleotide and 10% T as the non-wild type nucleotide (see Representative Results for more detail on this ratio).\n\tNote: Here, the sequence of the doped oligonucleotide is 5’-GTTCACTACACTXGAXAXAXAXCAXCXAXAXGXTGCCCTATAGTGAGTCGTATTAC-3’. The underlined sequence is the reverse complement of SXL protein binding site, plus additional nucleotides outside the binding site that provide useful controls confirming that not every change in the RNA affects binding, as well as being loading controls for comparison and normalization of nucleotides within the binding site. The SXL-binding site sequence UUUUUGUUGUUUUUUUU, which is present in transformer pre-mRNA14,15,16,17, was used to devise the proposed methodology. The sequence in italics is complementary to the T7 primer sequence and is the T7 promoter for in vitro transcription.\n2. Synthesis of RNA\nSynthesize RNA in a 20 µL transcription reaction, as previously described18.\nMix T7 transcription buffer and 1 µM T7 oligonucleotide, 1 µM doped oligonucleotide, 10 mM dithiothreitol (DTT), 2 mM GTP, 1 mM each ATP, CTP, and UTP (guanosine, adenosine, cytidine, and uridine triphosphate), and 2 U/µL T7 RNA polymerase.\nAdd, in two separate microcentrifuge tubes, 0.167 mM α-thio ATP or 0.05 mM α-thio UTP to incorporate phosphorothioates (see schematics in Figure 2) into RNAs.",
    "NOTE: For alternative protocols, add 0.2 mM α-thio CTP or 0.2 mM α-thio GTP to an appropriate transcription reaction containing a doped oligonucleotide to test the two remaining nucleotide substitutions.\nIncubate the RNA synthesis reaction mixture for 2 h at 37 °C.\nAdd 2.5 µL heat-labile alkaline phosphatase and 2.5 µL 10xphosphatase buffer to the RNA sample. Incubate this 25 µL reaction for 10–30 min at 37 °C to remove 5’ phosphates.\nInactivate the alkaline phosphatase enzyme by heating at 80 °C for 2–5 min.\nRadiolabel the 5’ end of dephosphorylated RNA (5 pmole) using 1 µL T4 polynucleotide kinase and 1 µL γ-32P ATP in a 10 µL reaction volume. Incubate the reaction mix for 30–60 min at 37 °C.\nInactivate the T4 polynucleotide kinase enzyme by heating at 65 °C for 20–30 min.\nGel purify the RNA by electrophoresis in a 10% denaturing polyacrylamide gel. Locate RNA on the gel by autoradiography. Excise the gel slice containing radiolabeled RNA, crush in a microcentrifuge tube by pressing against the walls with a pipette tip, and soak in proteinase K (PK) buffer (100 mM Tris, pH 7.5, 12.5 mM EDTA, 150 mM NaCl, 1% Sodium dodecyl sulfate). Rotate the tube at room temperature from 2 h to overnight.\nCentrifuge the gel slurry, discard the gel and collect the buffer solution.\nExtract the solution twice with equal volume of phenol-chloroform and once with chloroform and collect the aqueous phase.\nAdd to the aqueous phase 0.1 volume of 3M Sodium Acetate, pH 5.2, carrier tRNA or glycogen, and 2.5 volume of ethanol. Keep the sample at -80 °C for 1 h.\nCentrifuge the sample for 5–10 min in a high speed microcentrifuge at 16,873 x g. Remove the buffer/ethanol solution carefully without disturbing the RNA pellet.",
    "Wash the pellet with 70% ethanol and centrifuge for 2–5 min. Remove ethanol carefully. Dry the pellet in air.\nResuspend the pellet in 20–50 µL diethyl pyrocarbonate (DEPC)-treated water. Store at -20 °C until use.\n\tNOTE: Perform all steps with radiolabeled RNA using appropriate precautions and a plexiglass shield to protect from radioactivity. Presently, spin columns are more commonly used and more convenient to remove unincorporated radioactivity, as an alternative to gel purification of RNA.\n3. Protein Binding Reaction and Separation of Bound RNA\nExpress the recombinant protein in and purify from E. coli.\nEstimate recombinant protein concentration by spectrophotometry or by separating in an SDS-polyacrylamide gel next to a known protein standard, bovine serum albumin (BSA). Visualize the protein of interest and the BSA standard by staining the gel with Coomassie Brilliant Blue R-250. Quantitate the protein in comparison to known quantities of BSA dilutions on the same gel.\n\tNOTE: Store recombinant protein at -80 °C until use and dilute in 20 mM 4-(2-Hydroxyethyl)piperazine-1-ethanesulfonic acid (HEPES), pH 8.0, 1 mM dithiothreitol (DTT), 0.2 mM Ethylenediaminetetraacetic acid (EDTA), 0.05% NP-40, 20% glycerol. Use of 0.5–1.0 mM protease inhibitor phenylmethane sulfonyl fluoride (PMSF) is optional.\nPerform RNA-binding reaction (20–100 µL) in 10 mM Tris-HCl, pH 7.5, 1 mM DTT, 50 mM KCl, 0.5 units/µL RNase inhibitor, 0.09 µg/µL acetylated bovine serum albumin, 1 mM EDTA, 0.15 µg/µL tRNA, 5’-end radiolabeled RNA, and 6 µL of appropriate concentration (a concentration at which ~50% of RNA binds to protein) of the protein.",
    "NOTE: This binding buffer works for three RNA–binding proteins (SXL, U2AF65, and PTB), but must be standardized for a protein of interest. Estimate protein concentration empirically, using various dilutions for a given protein preparation, that is required to obtain approximately 50% RNA binding. This condition or Kd represents the most sensitive part of the RNA-binding curve.\nIncubate the protein binding reaction for 20–30 min at 25 °C (or on ice).\nSeparate the protein-bound RNA fraction from the unbound fraction using one of two approaches:\nNitrocellulose filter binding\n\t\t\nApply the binding reaction (20–100 µL) onto a nitrocellulose filter connected to a vacuum manifold at room temperature.\n\t\t\tNOTE: Only the RNA-protein complex is retained on the filter and unbound RNA flows through the filter. The filter binding approach allows higher recovery of the bound RNA and is faster and simpler, compared to the gel mobility shift assay. By placing a DEAE membrane underneath the nitrocellulose filter it is also possible to collect the unbound RNA fraction or free RNA for comparison with the bound fraction.\nCut the portion of the nitrocellulose filter containing the retained radioactive RNA into smaller pieces to fit into a microcentrifuge tube, soak in sufficient PK buffer (300–500 µL containing 10–20 µg PK) to immerse the filter pieces, and elute RNA from the filter for 2–3 h or overnight.\nExtract with phenol-chloroform, chloroform, and collect aqueous phase. Add sodium acetate and ethanol and, after incubation in freezer, centrifuge, wash, dry and resuspend RNA in DEPC-treated water. Follow these steps as detailed in steps 2.10 to 2.14 above.\nGel mobility shift\n\t\t\nPrepare and polymerize a 5% native polyacrylamide gel (60:1 Acrylamide:bis-acrylamide) in 0.5x TBE (standard Tris-Borate-EDTA buffer) before starting the binding reaction, as an alternative to the filter binding method.",
    "Pre-run the gel for 15 min at 250 V in a cold room (4 °C).\nLoad each binding reaction (above) into separate wells of the above pre-run gel.\n\t\t\tNOTE: The protein storage buffer provides sufficient glycerol for sample loading into wells.\nSeparate the protein-bound RNA by gel electrophoresis in a cold room at 250 V for 1 to 2 h, depending on the RNA size and specific protein.\nLocate the position of the RNA-protein complex on the gel by autoradiography. Excise the gel slice containing the RNA-protein complex. Elute the RNA from the gel slice by crushing the gel slice and soaking in the PK buffer.\nExtract with phenol-chloroform, chloroform, and collect aqueous phase. add Sodium acetate and ethanol and, after incubation in freezer, centrifuge, wash, air dry, and resuspend RNA in DEPC-treated water. Follow these steps as detailed in steps 2.10 to 2.14 above.\n4. Analysis of Iodine-cleaved Phosphorothioate Products for Detection of Mutant Nucleotide Positions\nAdd 1 mM iodine in a 20 µL DEPC-treated water containing up to 10 µg carrier tRNA to cleave RNAs (bound and total RNAs) at the sites of phosphorothioate incorporation. Incubate at room temperature for 5 min.\n\tNOTE: Further details on iodine cleavage with slightly different conditions — 7% (v/v) iodoethanol, heating at 95 °C for 3 min — can be found in Gish & Eckstein 198819.\nPrecipitate cleaved RNA by adding sodium acetate/ethanol, as described above. Resuspend in a loading dye for denaturing gels. Heat and load the sample to separate RNA fragments by electrophoresis in a 15–20% denaturing polyacrylamide gel.\nExpose the polyacrylamide gel to an X-ray film.\nDetect bands in the bound fraction versus total pool using autoradiography.",
    "NOTE: Perform all steps with iodine in an exhaust hood. For RNA separation shown here, a wedge-shaped gel is employed, which is achieved by doubling the thickness of the both spacers at the bottom of the gel plates by inserting an extra inch-long spacer at the bottom of the gel. This shape allows more uniform or closer spacing between shorter RNA fragments. Alternatively, a phosphorimager can be used rather than X-ray films for detection and quantitation of radioactivity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}