{
  "id": 2227,
  "origin_website": "Cell",
  "title": "An Optimized Immunoprecipitation Protocol for Assessing Protein-RNA Interactions In Vitro",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPreparation of Whole Cell Protein Extracts\nTiming: 30 min\nThe protocol is optimized for ESC whole cell protein extracts but can be adapted to any cell type or cellular fraction.\nNote: The choice of the right Lysis Buffer is critical for the quality of the sample that will be used for immunoprecipitation. Detergent (non-ionic: 0.1%–2%) and salt (0–500 mM) concentrations should be determined empirically for each protein of interest, to ensure maximum release of the proteins from the cells while maintaining native protein structures and interactions for the downstream immunoprecipitation and RNA interaction assays. Most immunoprecipitation assays use 100–150 mM salt concentrations which fall within the range of physiological concentration (approximately 137 mM).\nHarvest cells for further processing.\nProceed as previously stated to enzymatically detach the cells from the culture dish (see “Murine Pluripotent Cell Culture” section).\nPellet cells by centrifugation in a swing-bucket rotor at 300 × g for 5 min at 20°C–25°C.\nCarefully discard supernatant.\nWash cell pellet once with PBS.\nPause Point: Alternatively, cell pellet may be flash frozen and stored at −80°C for at least 1 year. For flash-freezing the cells, introduce the 15-mL conical tube containing the cell pellet directly in liquid nitrogen for 10 s. Store at −80°C until use.\nTiming: 2 h\nThis step describes the processing of cell pellets to obtain whole cell protein extracts. Here, we presented an example using 15 cm cell culture plates of pluripotent ESCs at a 70%–80% confluence (≈80–100 × 106 cells). Adequate reagent volumes to the specific cell culture plates were used.\nCritical: Pre-chill tubes before use and keep the samples on ice at all times to prevent protein degradation.\nNote: If frozen cell pellets are used, allow them to thaw slowly on ice before proceeding to lysis.",
    "Resuspend the cells in 4 mL of ice-cold Lysis Buffer 150 mM NaCl containing fresh protease inhibitors.\nNote: Both cell density and volume will affect the efficiency of cell lysis by sonication and should be optimized for each cell type. An appropriate cell density should be used to allow, on the one hand, a proper cell lysis with a short number of sonication pulses to reduce sample heating and, on the other hand, the obtention of protein extracts of high concentration (1–3 μg/μL) to avoid excessive dilution during the immunoprecipitation.\nMix by constant rocking for 30 min at 4°C.\nBriefly spin down the samples at 4°C to collect the sample in the tube.\nSonicate the samples in a Branson Digital Sonifier using 4 cycles of 5 s ON and 30 s OFF at 50% amplitude to disrupt cells and obtain whole cell lysates.\nCritical: Sound level and frequency of the noise emitted during the ultrasonic processing may result in an uncomfortable noise being emitted. Operators may need to use auditive protective equipment.\nCritical: Mix well the cell suspension to make it homogeneous before the first sonication cycle. Sonication process heats up the sample leading to protein degradation, especially proteins larger than 80–100 kDa. If the sonicator is not coupled to a refrigeration system, perform this step with the 15-mL polystyrene tube placed in an ice-water bath (Figure 2[href=https://www.wicell.org#fig2]). Use short ON pulses to reduce the heating up of the samples during sonication. Foaming will dramatically decrease the sonication efficiency.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/170-Fig2.jpg\nFigure 2. Sonication Setup\n(A) An ice-water bath is used to avoid protein degradation due to sample heating upon sonication.\n(B) Representation of correct sonicator probe setup, set deep in the sample avoiding touching the tube walls.",
    "(C) Foaming can appear as the result of not keeping the sonication probe properly submerged into the sample.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/170-Fig3.jpg\nFigure 3. Monitorization under the Microscope of Cell Lysis by Sonication\n(A) Cell solution before sonication.\n(B) Cells are lysed by sonication and detergent presence. Scale bars represent 100 μm.\nNote: Sonication parameters are highly dependent on the device used and they need to be optimized. Check the cell suspension under the microscope for intact cells after each burst to decide the end point of the sonication (Figure 3[href=https://www.wicell.org#fig3]).\nClear the cell lysates by centrifugation of the 15-mL tube at 4,000 × g for 30 min at 4°C to remove insoluble debris.\nCollect supernatant (whole cell protein extract) and transfer to a new 15-mL tube.\nPause Point: Cells lysates may be flash frozen in liquid nitrogen and stored at −80°C until use. In the day of use, protein extracts should be thawed on ice to avoid fast freeze-thaw cycles and keep protein complexes integrity.\nImmunoprecipitation – Day 1\nTiming: 1 day\nThis step describes the immunocomplexes formation between protein and antibody.\nMeasure protein concentration with Bradford reagent using an appropriate standard (e.g., bovine serum albumin).\nAlternatives: Protein concentration can be assessed by BCA Protein Assay, or other methods compatible with detergent concentration of the Lysis Buffer (i.e., 1% Triton X-100 and 0.5% IGEPAL).\nUse 1 mg of whole cell protein extract for each immunoprecipitation (IP) in a Protein-LoBind Eppendorf tube.\nNote: Keep a 1% aliquot as input sample to test the immunoprecipitation by Western Blot (see Figure 5[href=https://www.wicell.org#fig5]).",
    "Bring the reaction to 100 mM NaCl by adding Lysis Buffer without NaCl and adjust to a final volume of 1.5 mL with Lysis Buffer 100 mM NaCl. Table 1[href=https://www.wicell.org#tbl1] can be used to simplify the calculations of the buffers used in the IP.\ntable:files/protocols_protocol_170_8.csv\nAdd 1 μg of antibody per mg of protein to the corresponding pre-labeled tube. Include a mock IP, using the non-immune IgG fraction from the same species in which the antibody was made.\nNote: The amount of antibody required is dependent on the antibody affinity and protein abundance, and should be empirically determined for each antibody/protein pair.\nAdd 100 U of Benzonase and MgCl2 to a final concentration of 1.5 mM to each tube to remove DNA and RNA molecules.\nCritical: Benzonase is a genetically engineered endonuclease that cleaves both DNA and RNA while having no proteolytic activity. Benzonase requires 1–2 mM MgCl2 to work, and its activity is reduced by high concentration of EDTA. Lack of MgCl2 in your sample will result in incomplete nucleic acid removal. Use tip filters for benzonase, RNases and DNases to avoid cross contamination and degradation of the samples.\nAlternatives: This endonuclease could be replaced by a combination of DNase I and RNase A nucleases treatment.\nAllow immunocomplexes to form by slow (i.e., 15–30 rpm), constant rotation for 12–16 h at 4°C.\nNote: Tube caps can be sealed with parafilm to avoid any potential leakage.\nAlternatives: Incubation time is dependent on the kinetics of each antibody to reach the equilibrium of binding. For high affinity antibodies, 2 h should be enough for immunocomplexes to form.\nImmunoprecipitation – Day2\nTiming: 7 h\nThis step describes the collection of protein-antibody immunocomplexes using magnetic DynabeadsTM Protein G and the incubation with RNA.\nEquilibrate the magnetic beads.",
    "Add the desired volume of magnetic bead slurry to a clean 1.5-mL tube (10 μL of magnetic beads per 1 μg of antibody should be enough).\nNote: Beads have a high binding capacity, increasing the bead volume could lead to a higher background binding with limited increase in specific protein purification.\nNote: Resuspend magnetic beads by rocking the vial. Avoid vortexing the beads.\nAlternatives: Agarose beads may also be used. Different handling procedures may apply.\nAdd 1 mL of 100 mM NaCl Lysis Buffer to the beads.\nRotate for 5 min at 4°C.\nPlace the tube on the DynaMag™-2 magnet to separate the beads from the buffer and invert 3–4 times to facilitate their adherence to the magnet and the collection of the beads located at the tube cap.\nCarefully remove the supernatant (Figure 4[href=https://www.wicell.org#fig4]). Avoid disrupting the magnetics beads with the micropipette tip.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/170-Fig4.jpg\nFigure 4. Magnetic Beads Handling\n(A) Magnetic beads in suspension after rotating 5 min at 4°C.\n(B) Magnetic beads adhere to the side of the tube facing the magnet after 3–5 min of letting the tube sit. This enables an easy removal of the supernatant.\n(C) Samples in the magnet should be processed on ice to prevent protein and RNA degradation.\nRepeat the wash steps (b–e) twice more.\nResuspend the beads with 1 volume of 100 mM NaCl Lysis Buffer per volume of beads.\nAdd the beads to the RNA LoBind Eppendorf containing immunocomplexes from step 13.\nNote: To avoid disrupting protein binding when pipetting DynabeadsTM due to mechanical forces exerted by flowing the beads solution thought the tip, cut a 1,000 μL pipette tip around 1–2 mm upstream the tip end.\nMix by slow rotation (i.e., 15–30 rpm) on a rotamer for 2–4 h at 4°C.",
    "Place the tube on the DynaMag™-2 magnet. Allow the beads to bind the magnet and the solution to become totally clear (Figure 4[href=https://www.wicell.org#fig4]B).\nRemove the supernatant.\nCritical: Store samples on ice during this processing step to avoid sample degradation (Figure 4[href=https://www.wicell.org#fig4]C).\nNote: the supernatant can be kept at −80°C to analyze by Western Blot. This fraction should be depleted of the immunoprecipitated protein.\nWash the beads.\nAdd 1 mL of 100 mM NaCl Lysis Buffer with protease inhibitors.\nRotate 5 min at 4°C.\nPlace the tube on the DynaMag™-2 magnet to separate beads from the solution.\nWhen the solution becomes clear, carefully remove the supernatant using a micropipette.\nRepeat wash steps (a–d) five times.\nResuspend the beads in 500 μL of RIP Buffer with freshly added proteases and RNase inhibitors.\nAdd total RNA purified in step 15 of the “Before You Begin” section to bead-protein complexes and incubate by slow rotation for 45 min at 20°C–25°C.\nNote: Whereas to facilitate the visualization of the interacting RNAs in an agarose gel higher amounts of total RNA (i.e., up to 100 μg) should be used in this step, small amount of total RNA (i.e., up to 1 μg) might be sufficient for detection by RT-qPCR (see “RNA detection by RT-qPCR” section).\nNote: The amount of RNA required for assessing the interaction is highly dependent on the RBP-binding affinity and specificity and it might need to be optimized.\nPlace the tube on the DynaMag™-2 magnet. Allow the beads to bind the magnet and the solution to become totally clear.\nRemove the supernatant.\nWash beads with protein-RNA complexes.\nAdd 1 mL of RIP Buffer with protease inhibitors.\nRotate 5 min at 4°C.\nPlace the tube on the DynaMag™-2 magnet to separate beads from the solution.\nCarefully remove the supernatant using a micropipette.",
    "Repeat wash steps (a–d) five times.\nResuspend the complexes in 50 μL of RNase-free water and transfer to a new 1.5-mL tube.\nNote: Save 5 μL of the immunobound complexes to validate the immunoprecipitation by Western Blot (Figure 5[href=https://www.wicell.org#fig5]). Add 10 μL of Milli-Q water and 5 μL 4× Laemmli buffer and boil the samples for 5 min at 95°C. Store at −20°C until use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/170-Fig5.jpg\nFigure 5. Validation of the Immunoprecipitation of 3xFLPSPC1 with Anti-FLAG Antibody by Western Blotting\nPspc1 KO cells rescued with an empty vector (EV) control were used as negative control. The percentage of input is shown.\nAdd 450 μL of TRIzol™ to the remaining 45 μL of beads containing the protein-RNA immunocomplexes. Mix well by vortexing 15 s to allow the elution of the RNA from the protein-antibody-bead complexes.\nNote: The sample volume should not exceed 10% of the volume of TRIzol™ Reagent used for lysis.\nNote: Process in a similar way 0.5%–1% of input RNA from step 15 of the “Before You Begin[href=https://www.wicell.org#before-you-begin]” section.\nPause Point: Samples can be stored at 4°C 12–16 h or at –20°C for up to a year.\nExtraction of the IPed RNAs\nTiming: 1.5 h\nAfter eluting the immunocomplexes, perform RNA extraction from TRIzol™ reagent to isolate the co-immunoprecipitated (co-IPed) RNAs.\nCo-IPed RNAs extraction.\nIncubate the samples at 20°C–25°C for 5 min.\nAdd 0.2 mL of chloroform per mL of TRIzol™ reagent used in step 25.\nSecurely cap the tube and shake vigorously or vortex briefly.\nIncubate 3 min at 20°C–25°C.\nCentrifuge samples at 12,000 × g for 15 min at 4°C.\nAngle the tube at 45° and pipette the upper aqueous solution to a new RNase-free Eppendorf.",
    "Note: Avoid transferring any of the interphase or organic layer, which contain contaminants for downstream applications such as genomic DNA and proteins respectively.\nAdd 0.5–1 μL of RNase-free glycogen (1 mg/mL stock).\nAdd 0.5 mL of isopropanol per mL of TRIzol™ reagent used in step 26.\nMix by inversion 10 times.\nIncubate the samples 10 min at 20°C–25°C.\nCentrifuge samples at 12,000 × g for 10 min at 4°C.\nDiscard supernatant with a pipette.\nAdd 1 mL of pre-chilled ethanol 75% per mL of TRIzol™ reagent used in step 26.\nVortex briefly and centrifuge at 7,500 × g for 5 min at 4°C.\nCarefully discard all supernatant with a micropipette.\nAllow the pellet to air dry 5 min at 20°C–25°C.\nResuspend in 20 μL of RNase-free water.\nQuantify IPed RNAs using Qubit RNA HS Assay Kit following manufacturer's protocol.\nAlternatives: RNA concentration and quality can be assessed by Nanodrop, although its sensitivity is much lower and some carry-on contaminants may interfere with an accurate measurement.\nRNA Visualization in an Agarose Gel\nTiming: 2.5 h\nThis step describes the visualization of the IPed RNA using agarose gel electrophoresis.\nPrepare the agarose gel.\nPrepare TAE 1× in DEPC-treated Milli-Q and filter it with a 0.22 μm filter to avoid the appearance of spots in the gel that may interfere with the visualization of the bands.\nPrepare a 1% agarose gel with the filtered TAE 1×.\nClean gel bed and combs with tissue wipes that do not leave any fibers behind (e.g., VWR ® Light-Duty Tissue Wipers).\nTreat half of the volume to be visualized in a gel with RNase A.\nIncubate the RNA (≤1 μg) with 25 U of RNase A (DNase and protease-free) for 20 min at 37°C.\nKeep on ice.",
    "Note: At low salt concentrations (0 - 100 mM NaCl), RNase A cleaves single-stranded and double-stranded RNA as well the RNA strand in RNA-DNA hybrids. Use filter tips to avoid cross-contaminations, as RNases are very stable and not easy to inactivate.\nLoad the IPed samples (±RNase A) using an Orange G-based loading dye and run the gel for 15 min with 80 V.\nCritical: Do not use a Bromophenol blue-containing tracking dye as it migrates with the 370 bp bands in TAE and may interfere with the visualization of your bands.\nNote: Load a small volume of an appropriate ladder two-three wells apart from the samples, so its signal does not interfere with the fainter RNA signal during the visualization. This also applies to the input RNA sample used in the IP.\nPost-staining of the gel.\nPrepare a post-staining solution for the gel by adding 45 μL of ethidium bromide per 50 mL of filtered TAE\nIncubate the gel in the post-staining solution for 1 h at 20°C–25°C.\nCaution: Ethidium bromide is an intercalant agent used to visualize nucleic acids under UV light exposition. It is toxic by inhalation and causes mutagenic and carcinogenic effects. This compound should be handled with gloves and face mask, especially during powder reconstitution. Dispense the post-staining solution in an appropriated recipient.\nVisualize the gel in a UV transilluminator.\nNote: Staining of RNA with ethidium bromide is less sensitive than dsDNA, requiring 10 times more nucleic acid for equivalent detection. The minimum RNA amount that can be detected is ≈30 ng per lane.\nAlternatives: SYBR® Gold Nucleic Acid Gel Stain or other nuclei acids stains can be used to improve detection sensitivity.\nRNA Detection by RT-qPCR\nTiming: 4.5 h",
    "Prepare cDNA from the co-IPed RNA sample and quantify the specific transcript abundance by real-time quantitative PCR (RT-qPCR).\nPerform first strand cDNA synthesis from the IPed RNA obtained in step 27.\nSet up the reaction by mixing 4 μL of 5× qScript cDNA SuperMix with the RNA (10 pg to 1 μg) and bring to 20 μL with RNase-free Milli-Q water.\nNote: Input RNA should also be included for cDNA preparation. 1%–5% of total RNA purified in step 27 should be used.\nBriefly vortex and spin down the samples.\nIncubate: 5 min at 25°C, 30 min at 42°C and 5 min at 85°C.\nAlternatives: qSCRIPTTM is a Single Step retrotranscription system which includes Oligo (dT) and random primers. Other high sensitivity retrotranscriptases can be used.\nPause Point: cDNA can be stored at −20°C until use.\nSet up the RT-qPCR reaction. Plan the RT-qPCR plate for determining the abundance of a target of interest among the IPed RNA. Use triplicates for each sample (i.e., input, mock IP and IP) and gene (e.g., at least one negative control not bound by your protein of interest should be included).\nDilute the cDNA 1/10–1/100 for RT-qPCR.\nPrepare a mix for each primer pair containing SYBR™ Green and the primers as follows.\ntable:files/protocols_protocol_170_9.csv\nMix thoroughly and centrifuge briefly to spin down the contents and eliminate any air bubbles.\nTransfer 11 μL of the master mix to the corresponding well of the 96-well plate using an electronic pipette.\nAlternatives: If no electronic pipette is available, samples can be loaded with regular pipettes, although this can result in lower reproducibility between technical replicates.\nAdd 4 μL of the diluted cDNA to the appropriate wells.\nSeal the plate with an optical adhesive cover suitable for RT-qPCR detection.\nCritical: Securely seal the plate to avoid sample evaporation during cycling.",
    "Briefly centrifuge the plate to spin down contents and eliminate air bubbles.\nIntroduce the plate in the Thermocycler and set the appropriate program (an example is shown in Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_170_10.csv\nNote: RNA target enrichment among the RBP-interactome can be calculated from RT-qPCR data following the pipeline explained in Quantification and Statistical Analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Protein Expression And Purification",
    "Antibody"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}