{
  "id": 3658,
  "origin_website": "Cell",
  "title": "Global mapping of translation initiation sites by TIS profiling in budding yeast",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: The protocol describes the procedure for prepping one sample at a time. Scale up as needed.\nNote: We advise to perform TIS profiling on two independent biological replicates when comparing two or more conditions to confidently identify true translation initiation sites.\nYeast growth\nTiming: depends on strain, conditions used\nPrepare your strain of interest as desired.\nNote: You will need to prepare enough culture to obtain sufficient numbers of LTM-protected fragments for optimal sequencing coverage. We have successfully used extracts with Abs260 values in the range of 12 to 20 (2.4–4 Abs260 units per 200 μL of extract; see Preparation of cell extract for footprinting[href=https://www.wicell.org#sec3.4]), corresponding to ∼100 mL of vegetative yeast culture at OD600 = 0.6 or 50 mL of meiotic culture at OD600 = 1.9.\nLTM treatment and cell harvesting\nTiming: 1 h\nLabel and prepare a 50 mL tube for sample collection by piercing 3–4 holes in its cap with a 20G needle.\nFill styrofoam box with LN2 and lodge a 50 mL tube rack inside.\nSet up the filtration apparatus by connecting the filter flask to a vacuum pump and placing the filter piece into the flask top piece. Put a 0.45 μm nitrocellulose membrane in the center of the filter piece, place the collection beaker over the membrane and attach it to the filter piece with a clasp.\nImmerse the labeled 50 mL tube without its cap in LN2.\nCool a large flat metal spatula in LN2 with handles sticking out.",
    "Treat cells with a final concentration of 3 μM of LTM (or with the concentration optimized for your organism/conditions; see Before you begin[href=https://www.wicell.org#before-you-begin]) by directly adding LTM to the media and let cells incubate for 20 min at 30°C (or for as long as determined to be necessary for your organism/conditions; see Before you begin[href=https://www.wicell.org#before-you-begin]).\nCritical: The timing this step is crucial for allowing elongating ribosomes to run off completely.\nUse long tweezers to remove the 50 mL tube from LN2 and put it into rack immersed in LN2, keeping tube half filled with LN2.\nFilter culture through the membrane. Once all media has been filtered, immediately remove the clasp and the collection beaker.\nUse the cooled flat spatula to horizontally scrape off cells from the exposed membrane and quickly transfer cells to the LN2-filled 50 mL tube to snap-freeze cells. Make sure not to tear the membrane.\nCritical: Acting quickly at this step is very important to capture ribosomes in their physiological state. Ideally, you want all cells scraped off in one swipe. If necessary, plunge the whole spatula into the 50 mL tube.\nCap tube and store vertically at −80°C indefinitely. Let LN2 evaporate off completely.\nPrepare a separate 50 mL tube per sample by piercing 3–4 holes in its cap with a 20G needle and immerse it in LN2.\nPrepare fresh polysome lysis buffer (see Materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Keep on ice.\nUse long tweezers to remove the 50 mL tube from LN2 and put it into rack immersed in LN2, keeping tube half filled with LN2.\nSlowly add 3 mL of cold polysome lysis buffer by letting if drip into the LN2.\nCap tube and store vertically at −80°C indefinitely. Let LN2 evaporate off completely.",
    "The following steps are similar to our standard ribosome profiling protocol, which is discussed in detail in (Powers and Brar, 2020[href=https://www.wicell.org#bib6]).\nYeast cell lysis by mixer milling\nTiming: 30 min\nNote: Do not allow sample to thaw while grinding. Everything that touches the sample including spatulas, grinding jars, and balls needs to be pre-cooled in LN2. Closed grinding jars should not be removed from LN2 for more than 5 min at a time. Open grinding jars should not be removed from LN2 for more than 3 min at a time.\nPut the 50 mL tubes with the frozen cell pellet and the frozen buffer pieces in a tube rack lodged in a styrofoam box filled with LN2.\nLoosen pellet by lightly hitting the tube with a tong and add the frozen buffer pieces to the tube containing the frozen cell pellet.\nPut both halves of the grinding jar and grinding balls into LN2 in a styrofoam box using tongs. Wait until boiling stops.\nNote: It is recommended to put on multiple layers of protective gloves when handling grinding jars, such as a pair of latex/nitrile gloves under a pair of cryogloves and another pair of larger latex/nitrile gloves on top.\nRemove both halves of the jar from LN2 and place them on a paper towel, removing all LN2.\nTransfer grinding ball to the large half of the jar.\nPour sample (frozen pellet + frozen buffer pieces) into the large half of the jar and screw top on tightly. Rechill in LN2 until boiling stops.\nRemove jars from LN2 using tongs and loosen one quarter of a turn and then re-tighten. This is to ensure they do not lock shut.\nGrind sample for 3 min at 15 Hz in a mixer mill.\nReturn to LN2. Wait until boiling stops.",
    "Repeat steps 23–25 two more times (three grinding rounds total).\nDuring last round of grinding, pre-cool spatulas (two per sample).\nWith jars still in LN2, remove cap from the 50 mL tube on LN2.\nRemove jar from LN2 using tongs and put on a layer of Kimwipes.\nTap top of jar with tongs to knock ground up sample to the bottom.\nUnscrew jar vertically, making sure that the grinding ball stays in the bottom half of the jar.\nUse spatula to scrape cell powder from the top half of the jar into the open 50 mL tube on LN2.\nTransfer grinding ball from the bottom half to the empty top half of the jar and use second cold spatula to scrape powder from the bottom half of the jar into the open 50 mL tube on LN2.\nStore samples upright at −80°C∗.\nNote: If you are grinding additional samples you will need to very thoroughly disassemble and clean all parts of the jars and balls in between with MilliQ water, methanol all surfaces, and dry completely before re-use.\nPause Point: We have found that samples remain of high quality for as long as 2–3 years but have not tested beyond this.\nPreparation of cell extract for footprinting\nTiming: 30 min\nThaw cell powder in a 30°C water bath in constantly swirling water. Place on ice.\nPellet cells for 5 min at 3,000 × g at 4°C.\nTransfer supernatant to a 1.5 mL microcentrifuge tube on ice.\nCentrifuge for 10 min at 20,000 × g at 4°C.\nTransfer supernatant to a 1.5 mL low-adhesion microcentrifuge tube (USA scientific). Vortex briefly.\nAliquot extracts in 100 Abs260 units into 2 mL cryotubes on ice. Aliquots should not exceed 200 μL.",
    "Make a 1:100 dilution of the extract in 10 mM Tris-HCl pH 7 in a separate tube in an adequate volume for a 260 nm absorbance measurement by your method of choice. For example, 1 μL of extract diluted in 100 μL of 10 mM Tris-HCl pH 7 provides more than enough material to measure with a NanoDrop (Thermo-Fisher). Undiluted aliquots can be flash-frozen in LN2 and stored at −80°C indefinitely.\nMeasure the absorbance of the diluted extract at 260 nm using a spectrophotometer.\nNote: We used extracts with Abs260 values in the range of 12–20 for undiluted extracts (2.4–4 Abs260 units in a total aliquot of 200 μL) for our original TIS-profiling study (Eisenberg et al., 2020[href=https://www.wicell.org#bib2]).\nFootprint isolation by sucrose gradient\nTiming: 7 h\nCool SW41 rotor and rotor buckets at 4°C.\nPrepare polysome gradient buffer and 10% sucrose (w/v) and 50% sucrose (w/v) solutions in separate 50 mL tubes.\nNote: Prepare buffer and solutions for two gradients per sample (one for RNase I-digestion and footprint isolation and one for an uncut control to check the quality of the extract).\nLet sucrose solutions shake horizontally for 15–30 min at 22°C or until sucrose is completely dissolved.\nUse two undiluted aliquots of extract per sample: digest one aliquot with 10 U RNase I per Abs260 unit and treat the second aliquot with an equal volume of 20 U/μL SUPERase·In, in place of RNase I (uncut sample).\nNote: If using frozen aliquots, thaw extracts on ice first.\nIncubate sample with gentle shaking or rotating at 22°C for 1 h. Place on ice.",
    "While the sucrose solutions are dissolving, label two 12 mL ultracentrifuge tubes per extract (for RNase-digested and uncut sample) along the outside near the rim with the sample name and the rotor position and clean with compressed air to remove any debris.\nThe following steps (49–56) describe the procedure for forming a single sucrose gradient. Two gradients are required per extract (for RNase-digested and uncut sample).\nNote: The directions apply to the BIOCOMP Gradient Master and Bio-Rad Econo UV Monitor. They may differ for other gradient collection set-ups.\nPlace tube in the marker block and mark a line at the upper edge of the block around the tube.\nFill tube with 10% sucrose solution up to the line (approximately 6 mL) using a serological pipet.\nAttach large metal needle/cannula to the end of a 10 mL syringe. Pull up ∼6.3 mL of 50% sucrose solution.\nPlace the tip of the needle at the bottom of the ultracentrifuge tube and slowly inject 50% sucrose below the 10% sucrose layer by slowly moving the needle upwards so that it stays slightly below the interface of the two solutions.\nOnce the interface reaches the mark on the tube carefully pull needle out of the tube along the side.\nCritical: Do not disturb the interface\nCap tubes with rubber caps. Push edge of the tube with hole in last to release any air bubbles.\nMake 10%–50% gradients for SW41 Ti rotor buckets for tubes with short caps (81.5° tilt, rotating at 16 rpm, for 2 min) by using the built-in 7%–47% gradient program on the BIOCOMP gradient station.\nNote: Be careful not to disturb the gradients during the remaining steps of the protocol.",
    "Carefully remove tubes from the gradient station and remove caps raising the side with the hole first. Remove any sucrose from the outside of the tube.\nPlace tubes in SW41 Ti rotor buckets and loosely cap buckets.\nRe-cool buckets and gradients for 15 min at 4°C.\nLoad the RNase I-digested and uncut samples on top of separate gradients.\nBalance the opposing tubes including lids to within 10 mg of each other. Add 10% sucrose for this purpose, if necessary. Screw lids on buckets.\nUltracentrifuge gradients for 3 h at 35,000 rpm (209,000 × g) at 4°C.\nPut a collection tip onto the piston of the gradient station and place output tubing into a waste container. Set the voltage rate on the UV lamp between −2.0 and + 2.0 for maximum detection range.\nRemove the \"uncut\" gradient from the bucket using tweezers, place into the cylindrical gradient holder and lock in place.\nPut the holder onto platform on the gradient station and lock in place with the window facing you.\nIn the \"fractionate\" mode, lower the piston until it contacts the top of the gradient. Mark this position by selecting \"Rset.\" Choose \"Singl\" and set the parameters for collecting fractions to 0.2 mm/s (\"Speed\"), between 70 and 80 mm (\"DIst\"), and 1 fraction (\"Numb\").\nPress \"Start\" and begin recording on the UV monitor.\nFollow profile on the computer screen. Several peaks will be visible. First, free mRNA and other cellular material will appear as a large spike, followed by two smaller peaks representing the small (40S) and the large (60S) ribosome subunit. Sometimes, small scanning ribosome species appear as a peak between the 40S and the 60S peak. Next, monosomes (80S) appear as a large peak followed by several smaller periodic peaks representing polysomes (Figure 1[href=https://www.wicell.org#fig1]).",
    "Note: Polysomes will not fully collapse in uncut samples as even the lowest effective concentrations of LTM, which enriches the inhibition of post-initiation ribosomes, also inhibits some elongating ribosomes. You should see polysome peaks that will be smaller relative to traditional ribosome profiling samples collected by cycloheximide pre-treatment or flash freezing without drug pre-treatment.\nOnce the run is fully recorded, rinse tubing with MilliQ and flush remaining water through with air before running next sample.\nRepeat steps 64–68 with your RNase I-digested sample. There will be a 40S and a 60S peak, likely less distinct than in the uncut sample, followed by a very large monosome peak (Figure 1[href=https://www.wicell.org#fig1]).\nCollect fractions from the monosome peak of the RNase I-digested sample into 2 mL collection tubes labeled with respective fraction numbers. Be careful not to collect from the 60S peak that might slightly overlap with the monosome peak.\nFlash-freeze collected fractions and store at −80°C.\nClean gradient station.\nRNA extraction from monosome (80S) fraction\nTiming: 3 h\nThaw monosome fractions on ice (or fractions can be extracted immediately after collection, if kept on ice in the interim).\nPreheat 2 × 750 μL of acid-phenol:chloroform, pH 4.5, per sample in separate low-adhesion 1.5 mL tubes at 65°C in a chemical hood.\nNote: Tubes containing acid-phenol:chloroform might pop open when heated. It is advisable to use sturdy low-adhesion 1.5 mL tubes (such as from Ambion) or RNase-free screw-cap tubes for all heating steps and you may wish to secure/tape lids down by additional means if they do not stay shut.\nTransfer 1.4 mL of each monosome fraction into two separate 1.5 mL tubes (700 μL each) on ice and add 40 μL of 20% SDS. Vortex briefly.\nHeat samples at 65°C until SDS dissolves (∼3 min).",
    "Add sample/SDS mixture to the tubes containing 750 μL of pre-heated acid phenol.\nIncubate for 5 min with rigorous shaking at 65°C.\nPut samples at −80°C for a few min until mostly frozen.\nLet samples thaw at 22°C and centrifuge for 5 min at 20,000 × g at 22°C.\nTransfer the upper aqueous phase to a new tube containing 700 μL of 22°C acid-phenol:chloroform, pH 4.5. Mix and incubate at 22°C with rigorous shaking for 5 min.\nCentrifuge tubes for 2 min at 20,000 × g at 22°C.\nRecover the aqueous layer and add to a tube containing 600 μL of chloroform. Vortex for 30 s.\nCentrifuge tubes for 2 min at 20,000 × g at 22°C.\nTransfer the aqueous phase to a new tube containing 40 μL of 3 M NaOAc pH 5.5 and vortex briefly. Add 1 volume of isopropanol and 2.5 of μL of GlycoBlue, invert tubes a few times and vortex well.\nIncubate samples at −20°C for at least 30 min to precipitate RNA.\nCentrifuge tubes for 30 min at 20,000 × g at 4°C to pellet RNA.\nRemove supernatant, pulse spin to collect any remaining liquid and completely remove supernatant. Wash pellet in 750 μL of ice-cold 80% EtOH.\nRemove EtOH, pulse spin, completely remove residual EtOH.\nAir-dry pellet for 30 min or until any residual EtOH has evaporated off at 22°C.\nResuspend RNA pellet in 5 μL of 10 mM Tris-HCl pH 7 by pipetting up and down for ∼1 min.\nPool samples from duplicate tubes.\nNote: The remaining protocol steps describe the library preparation of ribosome footprint fragments for sequencing. Although the steps below are the ones that we recommend, any library preparation method that is suitable for short RNA fragments should work well.\nFootprint size selection\nTiming: 2 h",
    "Add 10 μL of Novex TBE-Urea Sample Buffer (2×) to RNA samples. Mix well.\nPrepare ladder by mixing 1 μL ladder with 9 μL of DEPC water and 10 μL of 2× Urea sample buffer.\nPrepare 28-mer and 31-mer control oligos by mixing 1 μL of 10 μM of each oligo with 9 μL of DEPC water and 10 μL of Novex TBE-Urea Sample Buffer (2×) per lane.\nNote: Prepare enough of each oligo that every RNA sample is flanked by a 28-mer and a 31-mer control oligo. Do not run actual samples in neighboring lanes.\nPre-run a 15% TBE-Urea gel for 15 min at 200 V in 1× TBE.\nDenature RNA samples, ladder, and oligos at 80°C for 2 min, put on ice.\nClean wells with TBE buffer and load 20 μL of each sample (including ladder and oligos). Make sure that every RNA sample is flanked by a 28- and a 31-mer control oligo lane.\nRun gel for 65 min at 200 V.\nWhile the gel is running, prepare a 0.5 mL tube for each sample by piercing three holes in the bottom with a 20G needle and place it in a 1.5 mL low-adhesion tube.\nStain gel with SYBR Gold (6 μL in 60 mL 1× TBE) while shaking for 5 min at 22°C.\nPlace gel onto Saran wrap and image.\nExcise footprints by cutting just below the 28-mer oligo band and just above the 31-mer oligo band (Figure 2[href=https://www.wicell.org#fig2]). Be careful to avoid cutting into the neighboring lanes, as oligo contamination can occur that will dramatically decrease your mappable reads. Also cut out one of the 28-mer oligo bands to use as a control for subsequent steps.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/345-Fig2.jpg\nFigure 2. Footprint size selection",
    "15% TBE-urea gel loaded with RNA extracted from the 80S fraction (S) containing the isolated ribosome footprints next to the 28-mer and the 31-mer control oligos. Cut just below the 28-mer oligo band and at the top of the 31-mer oligo band to extract footprints (red box).\nTransfer the gel pieces into the 0.5 mL tube.\nGel extraction\nTiming: 2 h\nSpin the nested tube for 3 min at 20,000 × g to force the gel through the holes.\nEmpty small unbroken pieces from the 0.5 mL tube into the 1.5 mL tube (if there are still large gel pieces in the 0.5 mL tube, repeat the spin).\nAdd 700 μL of DEPC water and incubate at 70°C for 10 min with vigorous shaking.\nPour the gel slurry into a centrifuge tube filter column (alternatively, use a cut p1000 tip to transfer the gel slurry).\nSpin for 3 min at 20,000 × g and transfer the eluate to a new 1.5 mL low- adhesion tube.\nAdd 2 μL of GlycoBlue, 78 μL of 3 M NaOAc pH 5.5 for RNA (post-size- selection), or 78 μL of 3 M NaCl for DNA (post-RT and post-PCR steps), for precipitation.\nAdd 780 μL of isopropanol. Mix by inversion, vortex and precipitate for at least 30 min at −20°C.\nCentrifuge at 20,000 × g for 30 min at 4°C.\nCompletely remove supernatant with pipet tip and wash RNA pellet in 1 mL of ice-cold 80% EtOH by inverting the tube a few times.\nSpin for 1 min at 20,000 × g at 4°C and remove supernatant with a pipet tip.\nPulse spin, completely remove supernatant with a small pipet tip and let pellet air-dry for ∼10 min or until EtOH is completely evaporated off.",
    "Resuspend in 10 mM Tris-HCl pH 8 for DNA or pH 7 for RNA in a volume appropriate for downstream steps.\nDephosphorylation of 3′ ends\nTiming: 3 h\nResuspend gel extracted RNA in 14 μL of 10 mM Tris-HCl pH 7.\nAdd 2 μL of fully resuspended (heat if necessary) 10× T4 PNK buffer, 2 μL of T4 PNK (10 U/μL) and 2 μL of SUPERase·In.\nNote: Make sure to always use a PNK buffer that does not contain ATP as otherwise the PNK will not dephosphorylate RNA fragments.\nMix well by pipetting up and down and incubate for 1 h at 37°C, with shaking at 600 rpm.\nIncubate at 75°C for 10 min to heat inactivate the enzyme.\nAdd 450 μL of DEPC water, 56 μL of 3 M NaOAc pH 5.5 and 2 μL of GlycoBlue.\nAdd 600 μL of isopropanol and mix well.\nPrecipitate RNA at −20°C for at least 30 min.\nSpin at 4°C for 30 min at 20,000 × g and completely remove supernatant with a pipet tip.\nWash RNA pellet with 750 μL of ice-cold 80% EtOH.\nPulse spin, completely remove EtOH with a pipet tip, and air-dry pellet.\nResuspend in 5.5 μL of 10 mM Tris-HCl pH 7.\nPoly(A)-tailing\nTiming: 2 h\nNote: Linker ligation can be performed instead of poly(A)-tailing [see (Powers and Brar, 2020[href=https://www.wicell.org#bib6]) for details]. We have found that both work well and applied poly(A)-tailing in our original TIS profiling paper (Eisenberg et al., 2020[href=https://www.wicell.org#bib2]). mRNA fragments with 3′ adenosine residues will show slightly shifted peaks when poly(A)-tailed, resulting in less crisp start site peaks in some cases. Linker ligation is likely to improve peak resolution in these cases.",
    "Note: We found that the efficacy of the poly(A)-tailing reaction varies with the enzyme lot used and advise to test each new tube of enzyme individually on a small scale prior to performing TIS profiling.\nAdd 12 μL of DEPC water to RNA sample. Mix by pipetting up and down a few times.\nIn a separate 1.5 mL low-adhesion tube, mix 0.5 μL of 20 μM 28-mer control oligo with 22 μL of DEPC water.\nDenature RNA sample at 75°C for 2 min. Put on ice.\nAdd 5 μL of 10× PolyA pol buffer, 5 μL of 10 mM ATP, 1.25 μL of SUPERase·In and 13.75 μL of DEPC water. Mix well.\nAdd 2 μL of DEPC water and 0.5 μL of E.coli PolyA polymerase (5 U/μL). Mix well.\nIncubate at 37°C for 10 min.\nQuench reaction with 160 μL of 5 mM EDTA.\nAdd 290 μL of DEPC water, 56 μL of 3 M NaOAc pH 5.5 and 2 μL of GlycoBlue. Mix well.\nAdd 600 μL of isopropanol and mix well.\nPrecipitate RNA at −20°C for at least 30 min.\nSpin at 4°C at 20,000 × g for 30 min.\nCompletely remove supernatant with a pipet tip.\nWash pellet with 750 μL of 80% ice-cold EtOH.\nPulse spin, completely remove EtOH with a pipet tip, and air-dry pellet.\nResuspend pellet in 10 μL of DEPC water.\nrRNA subtraction\nTiming: 3 h\nPrepare Dynabeads B&W buffer 1× + 0.01% Tween, Dynabeads B&W buffer 2× + 0.01% Tween, Dynabead Solution A, and Dynabead Solution B.\nAdd 5 μL of asDNA1b (undiluted, 20 pm/μL) per sample (including poly(A)-tailed 28-mer control oligo).\nAdd 6 μL of a 1:10 dilution (2 pm/μL) of antisense oligo asDNA2b.\nAdd 5 μL of a 1:10 dilution (2 pm/μL) of antisense oligo asDNA3b.",
    "Add 3 μL of 20× SSC.\nIncubate for 2 min at 70°C. Put on ice.\nAdd 1 μL of SUPERase·In.\nIncubate at 37°C for 15 min with shaking at 400 rpm.\nPut on ice for 5 min.\nPrepare MyOne Streptavidin C1 Dynabeads as follows:\nVortex Dynabeads and transfer 150 μL of beads per sample to a new tube.\nWash 3× in 150 μL of Dynabeads B&W buffer 1× + 0.01% Tween.\nWash 2× in 150 μL of Dynabead Solution A.\nWash 2× in 150 μL of Dynabead Solution B.\nResuspend in 30 μL of Dynabeads B&W buffer 2× + 0.01% Tween.\nAdd sample to Dynabeads.\nIncubate at 22°C for 15 min with 400 rpm shaking.\nPlace tube on magnetic stand and transfer supernatant to a new 1.5 mL low-adhesion tube.\nAdd 468 μL of DEPC water, 70 μL of 3 M NaOAc pH 5.5 and 2 μL of GlycoBlue. Mix.\nAdd 600 μL of isopropanol and mix well.\nIncubate at −20°C for 30 min.\nSpin for 30 min at 20,000 × g at 4°C.\nRemove supernatant with a pipet tip.\nWash pellet with 750 μL ice-cold 80% EtOH.\nPulse spin, completely remove EtOH with a pipet tip, and air-dry pellet.\nResuspend pellet in 10 μL of 10 mM Tris-HCl pH 7.\nReverse transcription\nTiming: 3 h\nNote: It is advisable to perform the reverse transcription (RT) reaction on only ∼75% of the rRNA-depleted RNA sample and save the rest for troubleshooting if needed.\nAdd 3.28 μL of 5× FS buffer, 0.81 μL of dNTPs (10 mM each) and 0.5 μL of 20 μM RT primer per sample (including poly(A)-tailed 28-mer control oligo).\nDenature at 80°C for 2 min. Put on ice.\nAdd 0.5 μL of SUPERase·In and 0.82 μL of 0.1 M DTT. Mix well.",
    "Add 0.82 μL of Superscript III and mix well.\nIncubate at 48°C for 30 min with shaking at 600 rpm.\nAdd 1.8 μL of 1 M NaOH and mix well. You may have to pulse spin sample down at this step.\nIncubate at 98°C for 20 min with shaking at 600 rpm.\nNote: Use a thermomixer with a Thermotop for this step as the samples will otherwise dry up. Keep tube caps tightly closed.\nAdd 1.8 μL of 1 M HCl and mix well. You may have to pulse spin sample down at this step.\nPut on ice and add 20 μL of Novex TBE-Urea sample buffer (2×).\nPre-run a 10% TBE-Urea gel at 200 V for 15 min.\nDenature samples at 95°C for 3 min and put on ice.\nLoad samples on gel (each sample will be split into 2 lanes). Do not run samples in neighboring lanes; use either the 28-mer control RT reaction or an empty lane between samples.\nRun at 200 V for 65 min.\nWhile the gel is running, prepare a 0.5 mL tube for each sample by piercing three holes in the bottom with a 20G needle and place it in a 1.5 mL low-adhesion tube.\ncDNA selection from gel\nTiming: 2.5 h\nStain gel with SYBR gold and use a single-use scalpel to cut each band corresponding to the RT product. These will run slightly higher than the 28-mer control RT reaction (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/345-Fig3.jpg\nFigure 3. RT gel\n10% TBE-urea gel loaded with the poly(A)-tailed and rRNA-subtracted sample (S) after reverse transcription (RT) and the 28-mer control oligo. Extract RT product that runs slightly higher than the 28-mer oligo. Avoid cutting the primer band (∗).",
    "Note: RT products might not be visible on the gel due to low abundance. If that is the case, blind cut at the correct product size.\nTransfer gel slices to the 0.5 mL tube.\nWash gel pieces with 200 μL of DEPC water by carefully pipetting the water onto the gel slice and letting it run down the gel slice to the bottom of the 0.5 mL tube twice. Remove all water carefully with a pipet, making sure not to disrupt or break the gel slice.\nNote: This step is crucial to remove any contamination from the very abundant RT primer that will otherwise dominate the PCR product in LTM samples.\nProceed to gel extract the cDNA (see Gel extraction[href=https://www.wicell.org#sec3.8]).\nResuspend pellets following gel extraction in 15 μL of 10 mM Tris-HCl pH 8.\nCircularization\nTiming: 1.5 h\nAdd 2 μL of 10× CircLigase 10× Reaction Buffer, 1 μL of 1 mM ATP and 1 μL of 50 mM MnCl2 per sample. Mix well.\nAdd 1 μL of CircLigase ssDNA Ligase. Mix well.\nIncubate at 60°C for 60 min.\nHeat inactivate enzyme at 80°C for 10 min. Put on ice or store at −20°C.\nPCR amplification\nTiming: 4.5 h\nFlick circularized sample to resuspend fully, pulse spin down, and transfer 1 μL to a PCR tube.\nAdd 3.34 μL of 5× HF buffer, 0.34 μL of dNTPs (10 mM each), 0.8 μL of 10 μM index primer, 0.8 μL of 10 μM PCR forward primer, 10.4 μL of DEPC water and 0.16 μL of Phusion polymerase.\nNote: Use different index primers for samples that will be multiplexed on the same sequencing lane.",
    "Estimate optimal cycle numbers: if RT product can clearly be seen on the RT gel, perform 6 cycles. If the RT product can barely be seen, perform 12 cycles. If the RT product cannot be seen, perform 14 cycles.\nPerform PCR as described below:\ntable:files/protocols_protocol_345_11.csv\nPre-run an 8% TBE gel at 180 V for 15 min.\nAdd 3.5 μL of 6× DNA loading dye and load 20 μL of total sample on gel.\nRun gel at 180 V for 55 min.\nWhile the gel is running, prepare a 0.5 mL tube for each sample by piercing three holes in the bottom with a 20G needle and place it in a 1.5 mL low-adhesion tube.\nStain gel with SYBR gold.\nExcise PCR product band and gel extract DNA (see Gel extraction[href=https://www.wicell.org#sec3.8]).\nNote: The PCR product should appear as a prominent single band just above the primer band (Figure 4[href=https://www.wicell.org#fig4]A). Redo PCR with a higher number of cycles if product appears underamplified (faint). The presence of higher molecular weight bands likely results from overamplification (Figure 4[href=https://www.wicell.org#fig4]B). Redo PCR with a lower number of cycles in case of overamplification.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/345-Fig4.jpg\nFigure 4. PCR gel\n(A) 8% TBE gel loaded with PCR amplified samples (S1, S2). PCR products will appear as single prominent bands (red box) above primer bands (∗). Avoid cutting the empty vector band that may be visible in some samples.\n(B) Example of an overamplified sample (S3). Try to lower the number of PCR cycles if high molecular bands are present.\nNote: In some samples you will see an empty vector band that runs just below the actual product band (Figure 4[href=https://www.wicell.org#fig4]A). Avoid excising and extracting material from this band.\nResuspend pellet in 10 μL of 10 mM Tris-HCl pH 7. This is your final sample.",
    "Analyze DNA on a TapeStation or BioAnalyzer prior to sequencing."
  ],
  "subjectAreas": [
    "Genomics",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}