{
  "id": 4062,
  "origin_website": "Cell",
  "title": "Immunohistochemistry for protein detection in PFA-fixed paraffin-embedded SARS-CoV-2-infected COPD airway epithelium",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrimary NHBE cell differentiation – ∼5 weeks\nTiming: 4–7 days for step 1\nTiming: 3–4 weeks for step 3\nPrimary NHBE cells from COPD patients are grown as a monolayer and they can be cryopreserved for a long-term storage. Passage-4 NHBE cells are differentiated into pseudostratified airway epithelium by using air-liquid interface culture.\nBasic cell culture:\nCoat 100 mm2 cell culture dish with 5 mL PureCol for 20 min at 15°C–25°C.\nThaw cryopreserved primary early-passage (P0) NHBE cells (around 10ˆ6 cells) in a water bath at 37°C.\nUsing a sterile pipette, add 1 mL of new cAEC medium into the cryovial drop by drop.\nTransfer cells from the cryovial into a 15 mL conical tube.\nSpin the cells at 330 × g at 4°C for 5 min in a benchtop centrifuge.\nRemove supernatant and resuspend the cell pellet in 2 mL of cAEC medium.\nAdd the cell solution to the precoated 100 mm dish containing 8 mL of cAEC medium and gently swirl the dish for homogeneous distribution of the cells.\nIncubate the cells at 37°C and 5% CO2.\nReplace cAEC medium every 48 h.\nOnce cells are fully confluent (around 90%), split the cells at 1 in 3 ratios.\nCritical: Make sure you mix cells gently while resuspending cell-pellet.\nSubculture for cell propagation (optional):\nRemove the old-medium from confluent NHBE culture in a 100 mm dish and wash with 5 mL of sterile 1× DPBS.\nAdd 5 mL of TrypLE express and incubate for 5 min at 37°C.\nTransfer the cells into a 15mL conical tube and spin at 330 × g for 5 min at 4°C.\nRemove supernatant and resuspend cell pellet in cAEC medium.\nSeed cells into a new 100 mm dish at desired cell concentration (1:3 ratio) for subculture.",
    "Note: First, do not neutralize TrypLE express treatment by adding Trypsin neutralizing reagent. Second, subculture of the cells can be done more than four times; however, the differentiation of the cells into airway epithelium has been tested up to passage 4. For differentiation, we do not recommend using more than four-passaged cells. Third, splitting cells is required while the cell monolayer is at 90% confluency. Cell split ratio at 1:3 in a 100 mm culture dish has been found optimal for cell growth.\nDifferentiation:\nCoat Transwells (e.g., 6.5 mm) at the apical side with 100 μL PureCol for 20 min at 15°C–25°C.\nRemove the old-medium from a confluent NHBE culture (Passage 4) in a 100 mm dish and wash with 5 mL of sterile 1× DPBS.\nAdd 5 mL of TrypLE express and incubate for 5 min at 37°C.\nTake Transfer the cells into a 15 mL conical tube and spin at 330 × g for 5 min at 4°C.\nRemove supernatant and resuspend cell pellet in 2 mL of cAEC medium.\nCount cells, e.g., manual count using trypan blue dye and hematocytometer.\nRemove PureCol and seed 50,000 cells in 100 μL of cAEC medium on the apical side of a Transwell. Add 500 μL of cAEC medium on the basal side.\nAfter 24–48 h, cells form a 100% confluent monolayer. Remove the cAEC medium from both apical and basal sides of the Transwell. Add 500 μL complete PneumaCult-ALI medium on the basal side of the Transwell.\nReplace complete PneumaCult-ALI medium every 48 h on basal sides for differentiation for 3–4 weeks.",
    "Airway epithelium starts producing mucus from around the 14th day of differentiation, and ciliary function is also visible around that time. 200 μL of sterile 1× DPBS was used to wash the mucus once a week since day 14 differentiation. This was increased to every other day when excessive mucus production was observed.\nAfter 3–4 weeks of differentiation, the airway epithelium can be verified for\nCiliary function by quantifying ciliary beat frequency (CBF) using a high-speed live-cell imaging followed by image quantification using SAVA-system (Ammons Engineering)\nMembrane integrity by measuring transepithelial electrical resistance (TEER) using an EVOM2 voltmeter (World Precision Instrument) (not described).\nImmunohistochemistry/immunofluorescence – ∼3–4 days\nTiming: 24–26 h for step 4\nTiming: 5–6 h for step 5\nTiming: 3–5 h for step 6\nTiming: 3–4 h for step 7\nTiming: 4–5 h for step 8\nSARS-CoV-2 infected COPD airway epithelium needs PFA-fixation, paraffin-embedding and sectioning for staining. Here, the sectioned slides are stained for SARS-CoV-2 S or N.\nPFA-fixation of SARS-CoV-2 infected COPD airway epithelium:\nSARS-CoV-2 infection should be performed at a high-containment facility. Infect four-week differentiated COPD epithelium in Transwells with SARS-CoV-2 (nCoV-WA1–2020 (MN985325.1) at a multiplicity of infection (MOI) of 0.1 for four days at 37°C and in a 5% CO2 humidified incubator.\nNote: For virus inactivation, use freshly prepared 1% sodium hypochlorite (chlorine bleach, e.g., Clorox). For laboratory waste disposal, follow institutional biosafety committee recommended standard operating procedures.\nAt four days post-infection, wash apical and basal sides of the Transwells twice with 1× DPBS (200 μL for apical and 500 μL for basal).\nAdd freshly prepared 4% paraformaldehyde (PFA) solution to both apical and basal sides of the Transwells (200 μL for apical and 500 μL for basal).\nIncubate the Transwells for 18–24 h at 15°C–25°C.",
    "The virus-infected Transwells should be PFA-fixed over night before transporting them safely from the high biocontainment facility. Remove PFA and wash the Transwells twice with 1× DPBS on both apical and basal sides (200 μL for apical and 500 μL for basal).\nPause point: Keep the Transwells submerged in 1× DPBS for storage at 4°C. We recommend processing Transwells at the earliest convenience; however, the Transwells can be kept in PBS at 4°C for short-term storage (less than a month).\nParaffin-embedding and sectioning:\nCarefully take out polycarbonate membrane containing the epithelium from the Transwell using a sterile scalpel and place the membrane in a petri dish containing PBS.\nCut the membrane into at least two small pieces to fit into a Paraffin cassette, which has a smaller diameter than the membrane.\nPlace the membrane into a Paraffin cassette containing PBS.\nPause point: The membrane can be stored in PBS for several days (less than a week) at 4°C before processing. The membrane stays in PBS till further processing.\nFor processing, the membrane in the cassette undergoes following incubation steps:\ntable:files/protocols_protocol_773_5.csv\nThree, 30-min paraffin infiltration steps are required in a vacuum oven with a temperature setting of 58°C +/− 2°C under pressure for enhanced paraffin infiltration.\nEmbed the membrane on the edge and the paraffin block can be stored at 4°C.\nPause point: The block can be stored at 4°C before sectioning for slide preparation.\nCut sections about 5 μM thick using a rotary microtome and mount onto superfrost plus slides.\nSectioned slides can be stored at 4°C for several months.\nDeparaffinization and antigen retrieval process:\nDay 1: Deparaffinize membrane on section slides by incubating them in following solutions:\ntable:files/protocols_protocol_773_6.csv\nTransfer slides into a slide chamber and submerge them in R-Buffer A 10× solution for antigen retrieval using the 2100 Retriever.",
    "Fill the 2100 Retriever’s body with 750 mL of deionized water and place the slide chamber rack into the body.\nSecure the lid and make sure the depressurizing valve is closed.\nPush the Start button and run for 20 min. Let the unit cool down for 2 h or longer (around 12 h) at 15°C–25°C before the slide chambers are removed from 2100 Retriever.\nPause point: The slides can be cooled down around 12 h at 15°C–25°C in the slide holder containing R-buffer\nBlocking and primary antibody incubation:\nPlace slides in a coplin jar and wash 3 times for 10-min in 1× PBST. The Coplin jar is placed on the belly button shaker on medium speed for efficient washing.\nAfter final wash, using a fresh KimWipe gently wick away as much PBS as possible without disturbing the tissue.\nUsing a PAP pen, draw a circle around each tissue to create a hydrophobic barrier to keep staining reagents localized on the individual tissue section.\nAdd 300 ul of blocking buffer (10% goat serum in 1× PBS). Incubate at 15°C–25°C for 2 h in a humidified, light-protected chamber.\nPrepare solution for primary antibody incubation (more than one antibody can be used) in antibody diluent (10% goat serum in 1× PBS). For examples, combination 1: SARS-CoV-2 N specific mouse monoclonal (1:10 dilution) and Acetyl-alpha-tubulin specific rabbit polyclonal (1:500 dilution) and combination 2: SARS-CoV-2 S specific rabbit polyclonal (1:100 dilution) and specific mouse monoclonal p63 (1: 100 dilution).\nAfter blocking, remove the blocking buffer by gently wicking away with a KimWipe.\nAdd 100 μL (2–3 drops) of primary antibody solution on the slides.\nIncubate the slides around 12 h at 4°C in a humidified light-protectant chamber.\nCritical: Do not allow tissue to dry out.",
    "Note: Do not wash the slides in between blocking and primary antibody incubation steps.\nPause point: Slides can be incubated around 12 h with primary antibody at 4°C.\nSecondary antibody incubation followed by Phalloidin and DAPI staining:\nRemove primary antibody solution from the slides and wash three times with 1× PBST. For washing, follow the steps mentioned above in a coplin jar and on the shaker.\nPrepare secondary antibody solution (secondary antibodies should correspond to the primary antibodies) at 1:100 in antibody diluent (PBS with 10% goat serum). For example, combination 1: goat anti-mouse AF488 and goat anti-rabbit AF647 and combination 2: goat anti-rabbit AF647 and goat anti-mouse AF488.\nAfter the final wash step, using a fresh KimWipe, gently wick away as much PBS as possible, then add 100 μL (2–3 drops) per section of the appropriate secondary antibody solution.\nIncubate slides in secondary antibody solution for 45 min at 15°C–25°C in a humidified, light-protected chamber.\nAfter 45 min, perform three 10 min washes with PBST as mentioned above in a coplin jar and on the shaker.\nPrepare rhodamine phalloidin soulution 1:100 in antibody diluent (PBS with 10% goat serum).\nWipe with KimWipe to remove excess liquid. Add 100 ul of rhodamine phalloidin solution and incubate slides for 30 min at 15°C–25°C in a humidified, light-protected chamber.\nPerform three 10-min washes with PBST as mentioned above in a coplin jar and on the shaker.\nAdd 1 drop of DAPI (NucBlue TM fixed cell stain ReadyProbes) to each slide.\nIncubate for 5 min at 15°C–25°C in a humidified, light-protected chamber.\nPerform two 10 min washes in PBST in a coplin jar using a shaker. Add one water wash for 10 min.\nAfter the final wash, mount slide with a coverslip using gold antifade reagent",
    "Pause point: The slides can be dried around 12 h at 15°C–25°C in the dark.\nThe next day clear nail polish is placed around the coverslip allowed dry for an hour.\nImage the slides immediately. Slides can be kept at 4°C for longer term storage (several months).\nImage acquisition by using Leica DMi8 inverted epifluorescence microscope:\nTurn on the microscope and Leica LASX software on the computer.\nAdd all the channels on the software. We used four channels: DAPI: DAPI (EX: 325–375 nm and EM: 435–485 nm), Phalloidin: TexRed (EX: 540–580 nm and EM: 592–668 nm), AF488: Cy3/FITC (EX: 460–500 nm and EM: 512–542 nm) and AF647: Cy5 (EX: 590–650 nm and EM: 662–738 nm)\nThe membrane section is like a hair strand, so first find it at a lower magnification by using the 5× objective.\nTake images at 63× oil objective for higher resolution.\nAcquired images can be further processed by using 2D- or 3D-deconvulation option available in the LASX software to get sharper images."
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Health Sciences",
    "Microscopy",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}