{
  "id": 4537,
  "origin_website": "Bio",
  "title": "Fractionation by Ultracentrifugation of Gram Negative Cytoplasmic and Membrane Proteins",
  "procedures": [
    "The bacteria should be cultured in media appropriate for the bacterial species under investigation or the environmental condition being tested. Cultures can be at logarithmic or stationary phase, although stationary phase cultures can be harder to lyse for protein extraction.    Harvest the bacteria by centrifugation at 6,708 x g for 10 min at 4 °C, discard the culture supernatant (unless it is needed to analyse secreted protein profiles).   Wash the pellet by re-suspending it uniformly with buffer to a volume at 50 times that of the pellet (e.g. the pellet from a 200 ml stationary phase E. coli culture would be around 2 ml in volume and would need at least 100 ml of buffer), then re-centrifuge at 6,708 x g for 10 min at 4 °C. Repeat this wash step.    For separation of E. coli membrane proteins the pellet should be washed in 10 mM Tris base (pH 7.5) (this buffer can be used with any proteins from any cellular source). For small volume culture protein fractionations (e.g. 25 ml) an overnight growth will give an OD600 of approximately 2; once harvested and washed, this would be re-suspended in 0.5-1 ml 10 mM Tris base (pH 7.5), to give a final cell density of OD600 of 20-30 (the suspension should have the appearance of pouring cream). For large volume culture (e.g. 200 ml) re-suspend in 5-10 ml 10 mM Tris base (pH 7.5). If proteolysis is likely to be a problem, a cocktail of broad spectrum protease inhibitors should be included at the levels recommended by the manufacturer.   Freeze the culture suspension at -80 °C for 2 h or overnight to weaken the cell wall and increase the lysis of the bacterial cells by sonication.",
    "Thaw the bacterial suspension on ice and place it in a non-breakable plastic beaker sitting in an ice water bath. Set the sonicator between 6-8 microns and lyse the cells in cycles of 15 sec sonication followed by 45 sec cooling until the lysate changes from an opaque solution into a less turbid solution (usually 4-5 cycles are enough for log phase cells; stationary phase cultures may need more treatments).    Centrifuge the lysed sample at 6,708 x g for 10 min at 4 °C to remove large debris fragments and unlysed cells (these will be contained in the pellet) and transfer the supernatant containing the total protein extract (membrane and cytoplasmic) into appropriate ultracentrifuge tubes.    Ultracentrifuge the protein extract at 108,726 x g for 10 min at 4 °C to separate membrane proteins from cytoplasmic proteins.    After the centrifugation the supernatant will contain the cytoplasmic proteins while the pellet contains the total membrane protein. If only a total membrane proteins fraction is required (comprising both inner and outer membrane proteins) then go to step 11, if only the outer membrane and inner membrane proteins fractions are required go to step 11 and then 10.   The pellet consisting of total membrane proteins is re-suspended in 10 mM Tris-HCl (pH 7.5) supplemented with 2% Triton X-100 in 10 mM Tris-HCl (pH 7.5) (TT; e.g. for a small volume culture initially of 25 ml re-suspend in 100-200 μl of TT); the inner membrane proteins are solubilised by incubation at room temperature with occasional mixing for 30 min. The mixture is then again centrifuged at 108,726 x g for 10 min at 4 °C; the supernatant will contain the inner membrane protein fraction whereas the insoluble pellet will contain the outer membrane protein.",
    "To remove any residual inner membrane proteins, the outer membrane pellet is re-extracted for a further 30 min in 500 μl of TT (this step is only to purify the outer membrane proteins and so the supernatant should be discarded).  Note: The extra wash/extraction steps are needed to increase the relative purity of the different fractions. Sometime it is possible that there are carry over between the fractions especially if people do not take care to remove all supernatants between centrifugations (but that's is more a procedure error). Generally, we determined that two washes are enough to obtain a pure membrane fraction. We tested the purity of the protein fraction by separating them on SDS gel and subjecting the proteins to sequencing. However, more washes steps can be increased to enhance the purity if required.   Wash the total membrane pellet twice or outer membrane pellet once in 10 mM Tris-HCl (pH 7.5); for a small volume culture initially of 25 ml, 500 μl of buffer would be sufficient. Finally, re-suspend in 30-50 μl of the same buffer according to the membrane pellet size.   The concentration of the cytoplasmic and membrane protein samples should be measured using the Bradford assay (He, 2011a) or via a spectrophotometer set at 280 nm.    For storage, proteins should be contained in capped 1.5 or 2 ml sterile plastic tubes, and stored at -20 °C for around 1 month or -80 °C for 6 months or longer. Protein extracts should be thawed on ice and always kept at 0-4 °C for the minimum amount of time to maximize stability and protein activity.   For simple 1-dimensional SDS PAGE, normalized protein samples are mixed with adequate amounts of 2x SDS protein sample buffer and the gel electrophoresis carried out as described by He (2011b) (for 1D SDS-gel electrophoresis).",
    "The protein fractions can also be separated by 2D gel electrophoresis if required."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}