{
  "id": 6808,
  "origin_website": "Bio",
  "title": "Isolation and Characterization of Exosomes from Mouse Feces",
  "procedures": [
    "Preparing the feces sample (selection of the mouse strain depends on the animal model of interest, in our case, we use C57BL/6, as DSS induced acute colitis in C57BL/6 is a well-established model)Put 20 C57BL/6 mice to autoclaved mouse cages (without bedding, 5 per cage or one mouse per cage, depends on the experiment) or clean disposable paper boxes (5 per box or one mouse per box, depends on the experiment).After 2 to 3 h, collect all the feces.Store the feces to -20 °C fridge if not use immediately. The fecal pellets can be stored for one week.Isolating the total exosomesWeigh the feces, add to a clean 50-ml conical tube (1.0 gram of feces in each tube, roughly 50 to 75 fecal pellets.)Take another clean 50-ml conical tube, put five protease inhibitor cocktail tablets, add 50 ml ice-cold PBS, shake until the tablets are dissolved.Add 25 ml PBS solution prepared in Step B2 to the 50-ml conical tube (contains 1.0-gram feces.)Put the tube in the 4 °C fridge for 30 min.Take out the tube, vortex for 5 min at maximum speed.Note: A simplified workflow for isolating exosomes from feces is shown in Figure 1. All the feces should be broken up into small particles (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201636_2827.jpgFigure 1. Simplified workflow for isolation exosomes from mouse fecesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201707_7464.jpgFigure 2. Fecal suspension after vortexCentrifuge at 3,000 x g for 10 min at 4 °C, collect the supernatant.Add 25 ml PBS solution prepared in Step B2 to the remains of the 50-ml conical tube.Repeat Step B6.Pool the supernatant.Centrifuge at 3,000 x g for 30 min at 4 °C, collect the supernatant.Set up a filtration device with a sterilized glass funnel, run the sample through filter paper to remove debris (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201737_7783.jpgFigure 3. Paper filtration to remove the fecal debrisCentrifuge at 40,000 x g for 1.",
    "5 h at 4 °C, collect the supernatant.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201803_9255.jpgFigure 4. Vacuum filtration to remove the microbesRun through a 0.22 μm filter to remove microbes (Figure 4).Centrifuge at 150,000 x g for 2.5 h at 4 °C, discard the supernatant, and keep the visible pellet.Wash the pellet three times with 1-2 ml PBS, centrifuge at 150,000 x g for 10-15 mins (at 4 °C) between each wash and discard the first and second time’s PBS, save the last time washing PBS as the exosome blank solution for protein quantitation.Save the pellet (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201830_7377.jpgFigure 5. Exosome pellet after ultracentrifugationResuspend the pellet in PBS (1 ml PBS per 1 g of feces sample).Store the suspension in the 4 °C fridge before characterization.Note: Store the samples at -80 °C if you do not test the sample in 2 days. Subfractionation of total exosome (sucrose density gradient ultracentrifugation) to isolate colonic exosomes from microbiota-derived extracellular vesiclesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201855_5649.jpgFigure 6. Setting up of the sucrose gradientMake 8%, 30%, 45%, 60% (w/v) sucrose solution in double distilled water and filtrate the solution through 0.22 µm filter.Note: Filter all the 8%, 30%, 45%, 60% sucrose solutions through 0.22 μm membrane to remove small particles before sample loading, small particles will contaminate the exosomes when doing ultracentrifugation. Load the centrifuge tubes (14 x 89 mm) with sucrose solution, from 60% to 8%, with 1.5 ml of 60%, 1.5 ml of 45%, 1.5 ml of 30%, 1ml of 8%, then 4.5 ml of PBS (Figure 6).Label the sample with dye (Ponceau S Solution, 1.0 ml sample with 10 μl dye).Load labeled sample to the PBS layer.Centrifuge at 150,000 x g for 3 h at 4 °C (using SW41 rotor).",
    "Remove the 8-30% layer by pipetting, use a glass pipette to collect the layer with dye (30-45% layer, Figure 7), dilute the collected solution with PBS to 10 times volume.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201921_5658.jpgFigure 7. Labeled band of exosomeCentrifuge at 150,000 x g for 2 h at 4 °C, save the pellet.Re-suspend the pellet in 5 ml PBS.Store the suspension in the 4 °C fridge before characterization (see Note 1).Characterization Particle size and surface zeta potentialNote: Turn on the instrument (Particle size analyzer and Zetasizer) for at least 15 min before the size and zeta potential measurement. Particle size measurement: Take 0.5 ml exosome solution, dilute with 2.0 ml PBS, pipette into a cuvette (avoid generating bubbles), insert cuvette to the chamber of particle size analyzer. Read the size of the particles by the 90 Plus Particle Sizing Software. The average size of the hydrated exosome is about 155 nm (152.8 to 157.9 nm in this test, see Note 2) in diameter (Figure 8).Particle surface zeta potential measurement: Take a 0.8 ml diluted solution (prepared for particle size measurement in Step D1), slowly pipette into a disposable capillary cell, cover the cell, insert the cell to the chamber of zeta analyzer, and record the value. The Z-potential of the sample is about -11.2 mV (-10.2 to -12.2 mv in this test) at neutral pH (Figure 9, software: Malvern Zetasizer, see Note 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413201958_6498.jpgFigure 8. Particle size measurement of the hydrated fecal exosomeimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413202024_0683.jpgFigure 9. Zeta potential test of fecal exosomesProtein concentrationUse the DCTM Protein assay reagent kit. Add 20 µl of reagent S to each ml of reagent A.Prepare a protein standard curve containing 0.25, 0.50, 0.75, 1.0, 1.25, 1.50 mg/ml BSA in 1x PBS.Pipet 5 µl of standards and samples into a clean 96-well plate.",
    "Add 25 µl of reagent A' (1 ml reagent A and 20 µl of reagent S) into each well.Add 200 µl reagent B into each well. Mix by pipetting up and down three times.Wait for 15 min at room temperature.Read the absorbance at 750 nm by a microplate reader.Draw the standard curve and calculate the protein concentration.Note: Expected protein concentration is between 0.25 to 1.5 mg/ml for exosomes isolated from 1g of feces as starting material. If the concentration is beyond the linear range (0.25 to 1.5 mg/ml, see Figure 13 and Table 1), dilute or concentrate the sample and redo the test.CD-63 protein detection (Western Blotting method)Add 100 μl RIPA buffer (10x) to 900 μl icy cold PBS (containing protease inhibitor cocktail (Roche)) to make a 1 ml solution A.Take 20 μg fecal nanovesicles (20 μl from 1 mg/ml solution), add 100 μl icy cold solution A.Sonicate the sample for 3 times at 42 kHz, room temperature, 10-15 s each time.Spin at 16,000 x g for 20 min at 4 °C.Take the supernatant, add the same volume of Laemmli buffer (2x).Boil the samples at 95 °C for 5 min.Centrifuge at 16,000 x g in a microcentrifuge for 1 min.Load the sample on 4-20% pre-casted gel. Add running buffer (Recipe 1), run the gel for 5 min at 50 v.Increase the voltage to 100 v, run the gel for 1 h.Take out the gel, add transfer buffer (Recipe 2), adjust the voltage to 100 v, and transfer to nitrocellulose membranes (Chankova et al., 2013).Take out the nitrocellulose membrane, block with 5% non-fat milk at room temperature for 1 h.Add primary antibody (Anti-CD63 1:200 dilution in PBS, and Anti-beta-actin, 1:200 dilution in PBS), incubate for 2 h at room temperature.",
    "Wash 3-5 times with PBS for 5 mins, add the secondary HRP-conjugated antibody and incubate for 2 h at room temperature.Detect the chemiluminescence bands with ECL Plus reagent. A representative western blotting picture is shown in Figure 10.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413202104_4111.jpgFigure 10. Western blot band of CD63 (use lysed mouse large intestine sample as control)Transmission electron microscopy (TEM)Pipette 1 μg (1 μl of 1mg/ml) fecal exosome solution in 10 μl distilled water.Deposit 5 to 10 μl sample onto the surface of Formvar®-coated copper grids.Add 5 μl 1% uranyl acetate (Recipe 3) for 15 s.Dry the sample at room temperature for at least 30 mins.Test the sample by the transmission electron microscopy. A representative TEM picture of the fecal exosome is shown in Figure 11.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413202129_9552.jpgFigure 11. TEM graph of the isolated fecal exosomeAtomic force microscopy (AFM)Pipette 0.25 μg (0.5 μl of 0.5 mg/ml) fecal exosome solution in 10 μl PBS.Deposit the 5 to 10 μl sample onto a mica sheet.Dry the sample at room temperature for about 2 h.Add 20 μl distilled water to the mica sheet.Dry the sample at room temperature for another 2 h.Wait until the sample is relatively flat.Scan the sample with an area about 4 x 4 μm or a smaller area with 2-50 nm in height. A typical AFM graph of the fecal exosome is shown in Figure 12.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200413/20200413202156_2694.jpgFigure 12. AFM graph of the isolated fecal exosome"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}