{
  "id": 12050,
  "origin_website": "Jove",
  "title": "In Vivo Immunofluorescence Localization for Assessment of Therapeutic and Diagnostic Antibody Biodistribution in Cancer Research",
  "procedures": [
    "All methods described here have been approved by the Institutional Administrative Panel on Laboratory Animal Care (APLAC) of Stanford University.\n1. Transgenic mouse model of breast cancer development\nObserve mice from the desired cancer model for the appropriate tumor growth via palpation or caliper measurement before proceeding.\n\tNOTE: Here, the transgenic murine model of breast cancer development (FVB/N-Tg(MMTV-PyMT)634Mul/J) (MMTV-PyMT) was used. These animals spontaneously develop invasive breast carcinomas between 6 and 12 weeks of age in each mammary gland20. Normal mammary glands were used as controls from the transgene-negative, age-matched littermates.\n2. Intravenous injection of specific and nonspecific antibody agents\nPurify rabbit anti-mouse B7-H3 and rabbit IgG isotype control antibodies on a desalting column (e.g., PD-10) to remove preservatives and storage buffers following manufacturer instructions.\n\tNOTE: Some antibodies may need further purification with Protein-A agarose beads based protocol21.\nAliquot dosages of 33 µg of each antibody conjugate in individual microcentrifuge tubes.\n\tNOTE: Dosage of the administered agent may vary depending on the application and matches the dosages at which the antibody conjugate is routinely used. The concentration of the antibody solutions is required if the volume is more than 100 µL for animal safety.\nAt the desired time point before the tissue collection, here 96 h, anesthetize the tumor bearing animal with 2% isoflurane flowing in oxygen at 2 L/min, and place on a 37 °C heated stage. Do a toe pinch to make sure the proper level of anesthsia was reached prior to the procedure.",
    "To prepare for the tail vein inoculation of the antibody solutions, disinfect the tail of the animal by wiping three times with an alcohol wipe. Dilate the tail veins by warming with a heat pad for approximately 30 s. Avoid heating the entire animal. Wipe the tail once more with an alcohol wipe after removing the heat pad.\nUsing a 27G tail vein catheter, insert the butterfly needle into one of the two lateral tail veins and carefully fix the tail with the inserted needle to the stage with a piece of surgical tape.\n\tNOTE: Visible blood backflow into the catheter indicates the proper location of the needle within the tail vein.\nFlush the catheter with 25 µL of sterile phosphate buffered saline (PBS), then inject the antibody solution into the catheter using insulin syringes. Flush the catheter once again with 25 µL of sterile PBS.\nRemove the needle from the tail and apply pressure to stop any bleeding.\nTurn off anesthesia and observe the animal until fully awake for any signs of distress.\n3. Collection and preparation of target tumor tissues\nAt the desired time point, humanely euthanize the animal according to the acceptable institutional procedure, here, by gradual inhalation of 100% CO2 from a compressed gas tank with a chamber displacement flow rate of 10-30% volume/min.\n\tNOTE: Some applications of the IVIL technique require euthanasia by cardiac perfusion with PBS to remove freely circulating antibody19,22.\nAfter confirmation of humane euthanasia via cessation of respiratory and cardiac movement, lack of toe pinch response, and greying of mucous membranes, excise tumor tissues using surgical scissors and forceps as follows:",
    "Lay the mouse in the supine position and grasping only the outer layer of skin between the set of mammary glands closest to the tail (5th) with forceps, make a small incision with a pair of surgical scissors.\nIntroduce the closed scissors into the cut and slowly open the tip to carefully separate the skin from the underlying abdominal wall membrane keeping it intact.\nMake a vertical incision up the abdomen, continuing to separate the skin from the inner membrane. Between the 3rd and 4th mammary glands, make a horizontal cut across the abdomen to allow retraction of the skin and visualization of the mammary glands.\n\t\tNOTE: Mammary tumors and glands are located superficially under the skin.\nGrasping each tumor or normal gland with forceps, carefully trim away the attached skin using surgical scissors.\nPlace excised tissues into tissue disposable base molds, prelabeled and filled with optimal cutting temperature (OCT) embedding medium and freeze the molds quickly by placement on dry ice. In order to study off-target delivery, excise other tissues or organs of interest (e.g., the liver or lungs).\n\tNOTE: To pause the protocol at this point, store frozen tissue blocks at -80 °C until ready to proceed.\nUsing a cryostat, section frozen tissue blocks at 10 µm thickness and place adjacent sections onto prelabeled adhesion glass slides.\n\tNOTE: To pause the protocol at this point, store slides at -80 °C until ready to proceed.\n4. Ex vivo staining protocol\nNOTE: For the quantitative comparison between fluorescence microscopy images, all slides are stained at the same time with the same prepared solutions.\nRinse frozen tissue slides with room temperature PBS for 5 min to remove OCT.\nDemarcate tissue sections with a hydrophobic barrier pen to reduce the volume of solutions needed during staining.",
    "NOTE: Be careful not to allow the pen to run over the tissue samples as it may either remove the tissue from the slide or prevent proper staining on the affected tissue portion. Do not allow the tissue sections to dehydrate at any point.\nFix the tissue sections with 4% paraformaldehyde solution for 5 min.\nRinse slides in PBS for 5 min.\nPermeabilize tissue sections with 0.5% Triton-X 100 in PBS for 15 min.\nRinse slides in PBS for 5 min.\nBlock the tissues with 3% w/v bovine serum albumin (BSA) and 5% v/v goat serum, both in PBS (blocking solution) for 1 h at room temperature.\n\tNOTE: Match the blocking solution serum to the secondary antibody host animal.\nRinse slides in PBS for 5 min.\nIncubate sections with record-keeping primary antibodies as desired, possibly a common nuclear (e.g., DAPI), vascular (e.g., CD31), or cytoplasmic marker (e.g., actin). Here, rat anti-mouse CD31 (vascular marker) at a 1:100 dilution was used according to manufacturer's instructions in the blocking solution overnight at 4 °C protected from dehydration on a slide tray.\n\tNOTE: Do not add additional primary antibody or antibody conjugate. The conjugate that was injected and allowed to accumulate in the tissues in vivo act as the primary antibody.\nRinse slides in PBS for 5 min three times, changing the PBS each time.\nIncubate slides with secondary antibodies to label primary antibodies. For this application, visualize anti-B7-H3 antibody using AlexaFluor-546 conjugated goat anti-rabbit antibody (1:200 dilution, optimized according to manufacturer's instructions) and CD31 with AlexaFluor-488 goat anti-rat secondary antibody (1:200 dilution, optimized according to manufacturer's instructions) in blocking solution, protected from light and dehydration on a slide tray, for 1 h at room temperature.",
    "NOTE: Secondary antibodies are from the same host animal but match the affinity of the secondary antibodies to the host species of the respective primary antibody. Slides are protected from light from this point onwards.\nRinse slides in PBS for 5 min three times, changing the PBS each time.\nApply one drop of the mounting medium into the center of the tissue slice and carefully place a coverslip avoiding entrapment of air bubbles.\nSeal the edges of the coverslip with clear nail polish and allow to dry.\n\tNOTE: To pause the protocol for up to a week at this point, store slides at -20 °C until ready to proceed.\n5. Confocal microscopy imaging and quantitative image analysis\nNOTE: Preparing the confocal microscope and imaging parameters will depend on the confocal system used. The microscope used here was purchased commercially (e.g., Zeiss LSM 510 Meta system) and the associated acquisition software was used (e.g., Zen 2009). However, many of these steps will apply to any confocal microscope and assume basic confocal microscopy knowledge.\nAfter the system has been turned on and warmed up, select the desired objective; here a 20x (numerical aperture = 0.8) objective was used.\nLoad a positive control slide, coverslip down, to allow for setting the optimization for the brightest signal. Imaging in the red channel, focus the system on the sample in Live imaging mode.\nFor each laser channel used, optimize the laser intensity, master gain, and pinhole size as follows:\n\t\nSwitch to Continuous mode for imaging.\nOptimize the Laser Intensity (which controls the laser power) and Gain (Master) (which controls the voltage for photomultiplier tube) slide bars while monitoring the Look Up Table (LUT) histogram. Adjust these two settings until the dynamic range of the histogram is filled without saturating pixels.",
    "NOTE: If the laser intensity is too high photobleaching will occur. If the Gain (Master) is too high, the image will become noisy. Ideally, the Gain (Master) will be in the middle of its range.\nSet the pinhole to 1 airy unit (AU), which gives the highest resolution and the thinnest z-slice.\nSlide the Digital Offset bar to minimize the noise floor on the LUT histogram for a true black background.\n\t\tNOTE: Once microscopy settings are optimized for each laser channel and objective, keep them constant throughout the imaging session and for imaging of all slides, to allow for the quantitative comparison between slides.\nUnder the Acquisition Mode tab, under Averaging, select the desired Number and Bit Depth. Click the Optimal button to set the optimal pixel size.\nUse the Snap acquisition button to collect a high-quality image. Here, random fields of view were selected from within the tumor, but other areas of interest may apply for different applications (vessels, tumor margins, penetration depth, etc.)\nSave image files in the format used by the confocal software (here, \".lsm\") for offline processing and quantification.\n\tNOTE: If not all slides are imaged during the same session, save the settings and reload them on subsequent visits, though reimaging the same slide is not recommended due to photobleaching.\nPerform the quantitative fluorescence intensity measurements. Open Fiji (Fiji Is Just ImageJ software)19,23 and load an .lsm image file by dragging onto the status bar.\nSplit the color channel data. Go to Image > Stacks > Split Channels.\nPreprocess the fluorescence images as needed, i.e., subtract the background signal (Process > Subtract Background) or reduce the noise via a filtering method.",
    "Segment the color channel corresponding to the reference protein (vascular, nuclear, cellular stain) by setting a threshold on the signal intensity (Image > Adjust > Threshold).\n\tNOTE: Manual thresholding introduces subjectivity into the image analysis, therefore, using an automated thresholding algorithm or referencing image histograms makes image analysis results less biased.\nUse this threshold to create a binary mask (Process > Binary > Convert to Mask).\nMeasure and label ROIs within the mask (Analyze > Analyze Particles > Check Add to Manager > OK).\nApply ROIs to the color channel corresponding to the antibody of interest (Click channel image, Analyze > Tools > ROI Manager > Measure). This will apply the mask ROIs to the antibody image and provide image measurements for label sections in the Results window. Save results window (File > Save).\nCalculate the desired statistic of interest, such as the mean fluorescence intensity as described here24.\nPerform all processing steps identically to each image within a set of slides. Create a macro to automatically do this for large image batches23.\nFor image display only after quantitative measurements, apply qualitative image adjustments to optimize visualization of biodistribution patterns by adjusting minimum, maximum, brightness, and contrast to the same levels on all slides (Image > Adjust > Brightness/Contrast).\nConvert the image type (Image > Type > RGB Color) and save files in a lossless image type such as .tiff (File > Save As > Tiff…) for use in presentations and publications.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}