{
  "id": 2747,
  "origin_website": "Cell",
  "title": "Protocol for Biochemical Analysis and Structure Determination of the ZZ Domain of the E3&nbsp;Ubiquitin Ligase HERC2",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nHERC2ZZ and Full-Length SUMO1 Expression and Purification\nTiming: 4–5 days\nPrepare the protein samples for NMR, tryptophan fluorescence and crystallization experiments (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/226-Fig1.jpg\nFigure 1. Diagram of the Procedure for Purification of HERC2ZZ\n(A) Preparation of cells expressing HERC2ZZ.\n(B) Affinity purification and removal of the His8-SUMO tag from HERC2ZZ.\n(C) Further purification by size exclusion chromatography.\nNote: The plasmids and corresponding antibiotics for selection are summarized as bellow:\ntable:files/protocols_protocol_226_21.csv\nNote: DH5α chemically competent cells carry no resistance to antibiotics while BL21-CodonPlus (DE3) RIL chemically competent cells are chloramphenicol-resistant.\nTransform the expression plasmids that encode HERC2ZZ, H31–6-HERC2ZZ, SUMO11–6-HERC2ZZ and full-length SUMO1 into BL21 (DE3) RIL chemically competent cells (Agilent Technologies) following the protocol described above and plate onto LB agar plates supplemented with 34 μg/mL chloramphenicol and 100 μg/mL kanamycin (PCIOX HERC2ZZ) or ampicillin (pDEST-15 SUMO1).\nInoculate single colony into 200 mL LB media supplemented with corresponding antibiotics. Culture the cells in a Forma Scientific Model 4580 Orbital Incubator Shaker (Forma Scientific) at 37°C and 200 rpm, 14–18 h.\nDilute the overnight culture 1:100 in 2L LB media supplemented with 34 μg/mL chloramphenicol and 100 μg/mL kanamycin (pCIOX HERC2ZZ) or ampicillin (pDEST-15 SUMO1), and 50 μM ZnCl2 in a 6 L Narrow-Mouth Erlenmeyer Flask (Thermo Fisher Scientific). Culture the cells at 37°C in a MaxQ™ 5000 Floor-Model Shaker (Thermo Fisher Scientific) with an agitation speed of 200 rpm until the optical density of a 1 mL sample reaches 0.6–0.8 at an absorbance of 600.",
    "Critical: For heteronuclear NMR experiments, the 15N-labeled protein is expressed in M9 minimal media containing 50 μM ZnCl2. HERC2ZZ is a zinc binding protein. Adding ZnCl2 in LB media and M9 minimal media is essential to produce folded protein. The IPTG concentration should not be too high to avoid aggregation of the expressed protein.\nCritical: Expression of 15N-labeled HERC2ZZ in M9 minimal media reduces yield of the protein compared to the yield of the unlabeled protein expressed in LB media, therefore a double amount of M9 media is recommended.\nReduce the shaker temperature to 16°C and the speed to 180 rpm, while cooling down the cell culture for 30 min to 23°C–25°C. Protein expression is induced by adding IPTG (at a final concentration of 0.2 mM), along with agitation and incubation at 16°C for 20 h.\nHarvest cells by centrifugation at 5,000 rpm (4,424 × g) using a F10-6 × 500y Fixed-Angle Rotor (Thermo Fisher Scientific) in Sorvall RC-5B Refrigerated Superspeed Centrifuge (Sorvall) for 10 min at ∼4°C and discard supernatant.\nPause Point: Pellets can be stored at −80°C for up to 3 months.\nFor HERC2ZZ and H31–6 linked and SUMO11–6 linked HERC2ZZ purification, resuspend the cell pellets in 50 mL lysis buffer A per liter cell culture by pipetting up and down using 10 mL transfer pipette. For SUMO1 purification, resuspend the cell pellets in 50 mL lysis buffer B per liter cell culture.\nLyse the resuspended cells in a beaker on ice by sonication for 10 min at 60% power with intervals of 5 s on and 10 s off.",
    "Note: 0.1–1 mg/mL Lysozyme (Thermo Fisher Scientific) can be added to the buffer to increase the lysis efficiency. Additionally, 1 tablet of EDTA-free protease inhibitor cocktail (Roche) per 1 L buffer and 10 μg/mL DNAse I (Sigma-Aldrich) could be added to inhibit the protease activity and remove DNA that may be bound by the protein of interest.\nSpin down the cell lysate at 15,000 rpm (26,964 × g) using a SS-34 Fixed-Angle Rotor (Thermo Fisher Scientific) for 30 min to remove cell debris and insoluble fractions.\nCritical: Always keep the cell lysate on ice during the purification.\nFor HERC2ZZ, H31–6 linked and SUMO11–6 linked HERC2ZZ purification, incubate the supernatant with 3 mL Ni-NTA resin (QIAGEN) in a 50 mL Falcon tube for 1 h rocking on a test tube rocker (Unico) at 4°C.\nApply the suspension to an Econo-Pac® Chromatography Column (Bio-Rad) to collect the protein bound Ni-NTA resin.\nTo remove impurities, wash the resin with 20 mL lysis buffer A, followed by 40 mL lysis buffer A that contains 20 mM and 30 mM imidazole (pH 7.5) respectively.\nAnalyze a 15 μL sample of each purification step by SDS Polyacrylamide gel electrophoresis (PAGE). Before loading the gel, add 5 μL of 4X SDS loading buffer and denature the samples by heating to 90°C for 10 min before loading onto a 15-well 15% SDS PAGE gel (15% resolving, 5% stacking). The gel and 4X SDS loading buffer were prepared according to standard Bio-rad gel making protocol. http://www.bio-rad.com/webroot/web/pdf/lsr/literature/Bulletin_6201.pdf[href=http://www.bio-rad.com/webroot/web/pdf/lsr/literature/Bulletin_6201.pdf]\nResuspend the Ni-NTA resin in 10 mL lysis buffer A, add the prepared Ulp1 enzyme (14 mg/mL, 30 μL), and incubate the reaction mixture rocking on a Microplate Titer Plate Shaker (LAB-LINE INSTRUMENTS, Inc.) for 4–24 h at 4°C to cleave the His8-SUMO tag.",
    "Analyze a 15 μL sample of the Ulp1 cleavage reaction by polyacrylamide gel electrophoresis (PAGE) as described in step 12 (Figure 1[href=https://www.wicell.org#fig1]B). Once the desirable extent of the cleavage reaction is achieved (∼60%–100%), collect the cleavage supernatant, which contains the cleaved protein. Concentrate the protein to 2 mL using a 3 kDa MWCO centrifugal filter (Millipore) at 3,000 × g in an Eppendorf 5804 R Centrifuge with an A-4-44 rotor.\nInject the concentrated protein onto a HiPrep™ 16/60 Sephacryl® S-100 HR column (GE Healthcare) pre-equilibrated in gel-filtration buffer at 0.5 mL/min. HERC2ZZ elutes at ∼85 mL on this column.\nPool protein-containing fractions and concentrate the protein to 5 mg/mL using a 3 kDa MWCO centrifugal filter (Millipore) at 3,000 × g in an Eppendorf 5804 R Centrifuge with an A-4-44 rotor (Eppendorf).\nFor SUMO1 purification, incubate the supernatant with 3 mL Glutathione Sepharose 4B beads (GE Healthcare) for 3 h rocking on a test tube rocker (Unico) at 4°C.\nApply the suspension to an Econo-Pac® Chromatography Column (Bio-Rad) to collect the protein bound GST resin.\nWash the resin by adding 50 mL lysis buffer B through the column to remove impurities.\nResuspend the GST resin in 10 mL lysis buffer B, add the prepared TEV enzyme (14 mg/mL, 30 μL), and incubate the reaction mixture gently rocking for 4–24 h at 4°C to cleave off the GST tag. Analyze a 15 μL sample of cleavage supernatant as in step 14 to assess MW difference corresponding to protein cleavage.\nConcentrate untagged SUMO1 to 2 mL using a 10 kDa MWCO centrifugal filter (Millipore) at 3,000 × g in an Eppendorf 5804 R Centrifuge with an A-4-44 rotor (Eppendorf) and inject the protein onto an HiPrep™ 16/60 Sephacryl® S-100 HR column (GE Healthcare) pre-equilibrated in gel-filtration buffer at 0.5 mL/min.",
    "Purification of GST-Tagged Protein\nTiming: 2–3 days\nPrepare the protein samples for histone peptide pull-down\nExpress HERC2ZZ following the steps 1–4 in the section of HERC2ZZ and full-length SUMO1 expression and purification.\nResuspend the pellet from a 100 mL culture in 10 mL pre-chilled lysis buffer C.\nAdd 100 μL of 50 mg/mL lysozyme solution to the cells, and keep the cells on ice for 30 min, invert occasionally.\nSonicate the cells on ice using a Branson SFX250 sonicator at 18% power for 20 s with intervals of 1 s on and 1 s off. Repeat this step twice.\nTransfer the lysate into a 15 mL disposable tubes and spin down at 12,000 rpm (13,000 × g) at 4°C for 15 min. Transfer the supernatant (∼10 mL) of lysed bacteria to a new 15 mL tube.\nPrepare glutathione beads. For each 10 mL cell lysate, use 100 μL of glutathione agarose slurry for purification.\nNote: Mix the glutathione agarose slurry before taking.\nAdd 10 mL cold lysis buffer C, and wash the beads at 4 ˚C for 2 min.\nCentrifuge at 2,000 rpm (376 × g) at 4°C for 2 min.\nRemove the supernatant and wash the beads two more times with lysis buffer C.\nAfter the final wash, bring the final volume of beads to 200 μL with lysis buffer C (2X the beads volume).\nAdd 200 μL of washed 50% slurry of glutathione beads into the cell lysates from step 24. Incubate the supernatant with beads at 4°C with gentle rotation on tube rotator (Lab Quake) at 20 rpm for 4 h.\nCentrifuge the tube at 2,000 rpm (376 × g) at 4°C for 2 min. Remove the supernatant.",
    "Add 10 mL of pre-chilled lysis buffer C, incubate at 4 ˚C with rotation for 5 min, and spin down the beads. Repeat this step twice.\nAdd 10 mL pre-chilled GST elution buffer (without glutathione) to the beads. Centrifuge at 4,000 rpm (1,500 × g) for 1 min to remove the supernatant.\nAdd 350 μL GST elution buffer (with glutathione) and incubate at 4°C with rotation for 4 h.\nCentrifuge at 4,000 rpm (1,500 × g) for 2 min and transfer 300 μL supernatant into a new 1.5 mL Eppendorf tube.\nDetermine protein concentration by Bio-Rad Bradford assay.\nCritical: Always make fresh elution buffer that contains reduced glutathione and adjust the pH to 8.0 before using. Use wide bore P1000 tips to take beads solution.\nHistone Peptide Pull-Down\nTiming: 2–3 days\nDetect the interaction between HERC2ZZ and histones through in vitro pull-down method (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/226-Fig2.jpg\nFigure 2. A Step-By-Step Peptide Pull-Down Procedure to Identify Histone Substrates for HERC2ZZ\nThaw GST-tagged proteins on ice and spin down at 13,000 rpm (15,871 × g) for 10 min.\nDilute proteins for binding: each pull-down requires 1–2 μg of GST-tagged protein in 300 μL of binding buffer. Prepare two extra tubes of diluted GST-tagged protein: one for input and one for pull-down without histone peptide as a negative control.\nAdd 1 μg of each biotinylated histone peptides (1 mg/mL) (Synpeptide) into each tube. Incubate at 4˚C with rotation for 4 h.\nPrepare Streptavidin Magnetic beads (Pierce). Use 5 μL Streptavidin beads for each binding assay. Wash the beads two more times with binding buffer with agitating for 5 min on a tube rotator (Lab Quake) at 20 rpm. After the final wash, resuspend the beads with 10 μL (2-fold of beads volume) of binding buffer.",
    "Add 10 μL of 50% beads slurry into each tube and incubate at 4°C with agitating on tube rotator (Lab Quake) at 20 rpm for 1 h.\nWash the beads with 1 mL of binding buffer for three times at 4˚C with rotation for 5 min.\nResuspend beads in 60 μL of 2X SDS sample buffer.\nTo replace 10% input, take 30 μL of samples from the saved input tube, add 30 μL 2X SDS sample buffer and heat the samples in boiling water.\nLoad 10 μL of each sample for Western blot analysis.\nCritical: Compared with agarose beads, magnetic beads normally give less background for binding. The quality and quantity of biotinylated histone peptides are important for direct comparison; make sure the peptide concentrations are equal by dot blot.\nNMR Titration Experiments Using HERC2ZZ and the H31–12 or SUMO11–6 Peptides\nTiming: 1–2 days\nValidate the interaction between HERC2ZZ and its ligands by NMR spectroscopy (Figure 3[href=https://www.wicell.org#fig3]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/226-Fig3.jpg\nFigure 3. Characterization of the Interaction between HERC2ZZ and the Histone H3 Peptide\nThe workflow of biochemical assays: NMR titration (A) and tryptophan fluorescence (B) used to qualitatively and quantitatively characterize the binding of HERC2ZZ to the H3 peptide. The 1H,15N HSQC spectra were recorded at protein:peptide molar ratios of 1:0, 1:1, 1:2, and 1:5.\nConcentrate the 15N-labeled WT HERC2ZZ and mutant proteins to 0.1 mM in binding buffer. Add 22 μL Deuterium oxide (Sigma-Aldrich) to 198 μL protein sample and transfer the sample to the Shigemi 5 mm Symmetrical NMR microtube (SHIGEMI Co., LTD).",
    "Record 1H,15N heteronuclear single quantum coherence (HSQC) spectra of the protein apo-state at 298K on a Varian INOVA 600 MHz NMR spectrometer using 48 increments, 32 scans, and 1.1 s relaxation delay. Sweep widths of 13.2 ppm and 28 ppm and offsets of 4.63 ppm and 119 ppm are used for the 1H and 15N dimension, respectively. The total acquisition time for each experiment is 65 min.\nAdd increasing amounts of the H31–12 or SUMO11–6 peptide to the NMR sample and record 1H,15N HSQC spectra of the sample after each addition of the ligand until saturation is reached.\nProcess the spectra using the NMRPipe software (Delaglio et al., 1995[href=https://www.wicell.org#bib3]). Overlay of these spectra will reveal resonance perturbations induced in HERC2ZZ by the peptide binding.\nMeasurements of Binding Affinities of HERC2ZZ to H31–12 and SUMO11–6 Peptides by Tryptophan Fluorescence\nTiming: 1–2 day(s)\nQuantitative analysis of the interaction of HERC2ZZ with the H31–12 and SUMO11–6 peptides (Figure 3[href=https://www.wicell.org#fig3]B)\nExperiments are performed at 25°C on a Fluoromax-3 spectrofluorometer (HORIBA Scientific).\nFill a quartz fluorometer cuvette (Starna Cells, INC) with 400 μL binding buffer A and record the spectrum of control. The sample is excited at 295 nm, and tryptophan emission spectra are recorded over a range of wavelengths between 330 nm and 360 nm with a 0.5 nm step size and a 1 s integration time and averaged over three scans.\nAdd HERC2ZZ into the binding buffer to have the final protein concentration of 5 μM. Before adding the protein, remove equal volume of buffer from the cuvette to minimize change of the sample volume. Record spectra using the same parameters as above at 0 min, 5 min and 10 min to make sure that the emission curves are stable before adding ligands into the sample.",
    "Add increasing amounts of the H31–12 or SUMO11–6 peptide to the protein sample and record spectra after each addition of the peptide.\nAnalyze the data using a KaleidaGraph 4.5 software (Synergy Software). Other programs such as Prism 8 (GraphPad) and OriginPro (OriginLab) could also be used to analyze the data. The binding affinity is determined using a nonlinear least-squares analysis and the equation:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/226-Si1.jpg\nwhere ΔI is the observed change of signal intensity, and ΔImax is the difference in signal intensity of the free and bound states of HERC2ZZ. [L] is the concentration of the ligands, [P] is the concentration of HERC2ZZ. The Kd value is averaged over three separate experiments, with error calculated as the standard deviation between three runs.\nCritical: The instrument is very sensitive, and therefore it is essential to stabilize the emission curve before adding ligands into the protein sample. Bubbles in buffer cause bouncy curves, and therefore it is recommended to use fresh buffer every time.\nCo-immunoprecipitation\nTiming: 3–4 days\nDetect the interaction between HERC2ZZ and histone H3 in cells (Figure 4[href=https://www.wicell.org#fig4])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/226-Fig4.jpg\nFigure 4. Cross-validation of the Interaction between HERC2ZZ and Histone H3 Tail Using Co-IP Experiments\nCulture HEK 293T (ATCC CRL-3216) cells in DMEM (Corning, 10-013-CV) medium at 37°C in a 5% CO2 incubator. Perform plasmid transfection when HEK 293T cells reach 50%–60% confluence.\nPerform transfection reactions in 500 μL Opti-MEM (Gibco). For example, use 2 μg of pcDNA-H3-3Flag, 4 μg of pcDNA-HERC (aa 2,702–2,755) and 18 μL X-tremeGENE™ HP DNA transfection reagent (Roche); for control, use 2 μg of pcDNA-flag vector, 4 μg of pcDNA-HERC (aa 2,702–2,755) plasmids and 18 μL X-tremeGENE™ HP DNA transfection reagent (Roche).\nNote: For plasmids, run an agarose gel before transfection to make sure the plasmids are of good quality with high percentage of a supercoil form.",
    "Scrape the cells 48 h after transfection and resuspend cells in 1 mL cell lysis buffer. Keep the cell lysate on ice for 30 min, flipping tubes gently occasionally.\nSonicate the cells on ice using a Branson SFX250 sonicator using 15% output and intervals of 1 s on and 1 s off for 30–40 s.\nSpin cells at 12,000 rpm (13,000 × g) for 10 min. Gently transfer supernatant into a new 1.5 mL reaction tube and determine protein concentration. Save 50 μL of lysate as 5% input.\nUse 30 μL of Flag M2 beads for each binding. Wash flag beads three times with 10X volume of cell lysis buffer containing PMSF. Rock the tubes on tube rotator (Lab Quake) at 4˚C for 5 min each time and spin down the beads at 3,000 rpm (845 × g) for 2 min.\nResuspend the beads with same volume of cold cell lysis buffer after the last wash.\nUse wide bore pipette tips (Axygen) to add 30 μL of FLAG M2 beads into 950 μL of lysate and incubate the lysate with beads at 4˚C with rotation for 4 h. When mixing the beads with the cell lysate, make sure to mix well by gently flipping the bottle up and down until the beads are fully resuspended (∼20 times).\nWash the beads for 4–5 times with 1 mL of cold cell lysis buffer.\nAfter final wash, add 200 μL of 2X SDS sample buffer into the pellet. For input, add 150 μL of 2X SDS sample buffer.\nHeat all samples at 95°C for 5 min. Load 10 μL sample for Western blot analysis.",
    "Critical: It is critical to sonicate all samples at the same setting. Ensure the lids are properly closed while mixing. Carefully, remove the wash supernatant with a pipette at an angle to not lose any beads during wash steps.\nCrystallization and Structure Determination of HERC2ZZ in Complex with H3 and SUMO1\nTiming: 7–14 days\nGenerate the crystals of H31–6-HERC2ZZ (aa 1–6 of histone H3, aa 2,702–2,755 of HERC2ZZ, no linker between) and SUMO11–6-HERC2ZZ (aa 1–6 of SUMO1, aa 2,702–2,755 of HERC2ZZ, no linker between), collect data sets on these crystals and determine the structures of the complexes (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/226-Fig5.jpg\nFigure 5. Elucidation of the Molecular Mechanism by which HERC2ZZ Recognizes H3 Tail\nThe N terminus of H3 is shown as green sticks, and residues of HERC2ZZ involved in the interaction with H3 are shown in pink sticks. The crystallization process consists of a broad screening using sitting drop method, generating diffracting crystals, data collection, and structure determination.\nThe crystallization screening is performed using commercially available JCSG plusTM and PACT premierTM kits (Molecular Dimensions).\nConcentrate the H31–6-HERC2ZZ and SUMO11–6-HERC2ZZ proteins to 3–5 mg/mL and spin down to remove any precipitates before setting trays. Crystals are grown by equilibrating a mixture containing 1 μL protein solution and 1 μL reservoir solution against 50 μL reservoir solution at 25°C using sitting drop vapor diffusion methods.\nThe H3-HERC2ZZ crystals are obtained in 0.1 M ammonium acetate, 0.1 M Bis-Tris, pH 5.5 and 17% PEG 10,000 condition. The SUMO1-HERC2ZZ crystals were obtained in 0.2 M ammonium chloride, 0.1 M Tris, pH 8.0 and 20% PEG 6,000 condition. Plate-shaped crystals appear within 24 h and grow to their full size within 2–3 days.\nLoop the crystals using appropriate loops under the optical microscope and cryoprotect the crystals with 25% glycerol before freezing in liquid nitrogen.",
    "Collect the crystallization data sets using a high-frequency microfocus X-ray generator. The Advanced Light Source beamline 4.2.2 or a campus X-ray homesource: Rigaku Micromax 007 high-frequency microfocus X-ray generator were utilized for these experiments.\nUse HKL2000 program (Otwinowski and Minor, 1997[href=https://www.wicell.org#bib12]) for indexing, integration, and scaling of crystallographic data.\nDetermine the structures by molecular replacement using the Molrep program in CCP4 (Emsley et al., 2010[href=https://www.wicell.org#bib4]) and a search model with ≥25% sequence similarity. P300ZZ (PDB code: 6DS6) was used to determine phase solutions for the HERC2ZZ structures (Zhang et al., 2018[href=https://www.wicell.org#bib14]).\nPerform the model building by using the Coot program (Emsley et al., 2010[href=https://www.wicell.org#bib4]) and refine the structures with the Phenix Refine program (Adams et al., 2010[href=https://www.wicell.org#bib1]).\nFurther validate the final model using Worldwide Protein Data Bank OneDep SYSTEM (https://validate-rcsb-1.wwpdb.org/[href=https://validate-rcsb-1.wwpdb.org/]), fix any issues that may arise, if possible.\nDeposit data in Worldwide Protein Data Bank OneDep SYSTEM (https://deposit-2.wwpdb.org/deposition/[href=https://deposit-2.wwpdb.org/deposition/])\nCritical: The H31–6-HERC2ZZ and SUMO11–6-HERC2ZZ proteins precipitate at low temperature, therefore the concentration should be performed at 23°C–25°C.\nNote: Timing of crystallization and structure determination may vary based on the protein and data quality."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Nmr",
    "Structural Biology",
    "X-Ray Crystallography"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}