{
  "id": 19951,
  "origin_website": "Wiley",
  "title": "A Rapid and Universal Workflow for Label-Free-Quantitation-Based Proteomic and Phosphoproteomic Studies in Cereals",
  "procedures": [
    "This protocol describes total protein crude extraction and requires total protein extraction buffer, which contains the following. The compounds 6 M urea and 2 M thiourea are high-concentration chaotropic compounds that disrupt hydrogen bonds and hydrophobic interactions in proteins, thereby bringing insoluble proteins into solution in an unfolded form. Phenylmethanesulfonyl fluoride (PMSF) is a protease inhibitor that prevents protein degradation during sample preparation. DL-Dithiothreitol (DTT) reduces disulfide bonds to unfold protein complexes to improve protein solubility. Polyvinylpolypyrrolidone (PVPP) has a high affinity toward polyphenols and is used to remove them from crude extracts. For phosphoproteomics applications, it is recommended to add protease and phosphatase inhibitors to prevent phosphorylated proteins from undergoing dephosphorylation during sample preparation.\nMaterials\nLiquid nitrogen\nFrozen plant sample: maize root and shoot or wheat leaf (about 200 mg to 1 g; freshly harvested or frozen at −80°C)\nTotal protein extraction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0005]; make fresh)\nMortar and pestle of proper size\n2-ml tubes (e.g., Eppendorf)\nVortex shaker (e.g., Scientific Industries Vortex-Genie 2 with microtube insert)\nRefrigerated microcentrifuge (e.g., Eppendorf 5430R), 4°C\n5-ml tubes (e.g., Eppendorf; optional)\n1. Pre-cool a mortar and pestle of proper size with liquid nitrogen, place frozen plant sample into the cold mortar, add liquid nitrogen to cool down sample, and then grind tissue into fine powder with the cold pestle.\nThe better the powder, the more efficient the extraction. Choose a proper size of mortar depending on the volume of the tissues, e.g., an 80-ml mortar for 200 mg tissues.\nOptional: Grind the tissue with pre-cooled balls and containers using a ball mill (e.g., Retsch, MM400).\n2. Pre-cool a 2-ml tube with liquid nitrogen and weigh 50 to 200 mg ground powder into pre-cooled tube.",
    "Different tissues have different protein extraction efficiency. For example, roots give lower yields than leaves. Adjust the amount of input sample appropriately according to the tissue type.\n3. Add 0.5 to 1 ml total protein extraction buffer and mix on a vortex shaker for 1 hr at 4°C.\nAvoid high temperatures and prolonged incubations because urea can cause carbamylation at the N-termini of proteins or peptides, which will impede LC-MS/MS quantification (see Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0010]).\n4. Centrifuge mixture for 10 to 20 min at 21,000 × g, 4°C. Transfer supernatant to a fresh 2- or 5-ml tube.\nThe duration of centrifugation depends on the ground tissue type.\nTransfer the supernatant to a 5-ml tube if the volume is >300 µl.\nStore the supernatant for up to several months at –20°C if not using it immediately for further processing in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0002].",
    "The total protein crude extracts from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0001] contain large amounts of interfering substances, such as phenolics, lipids, organic acids, carbohydrates, terpenes, and pigments that are necessary to remove. A high concentration of EtOH can reduce protein solubility, resulting in protein precipitation. Sodium acetate provides positively charged Na+ to neutralize negatively charged residues on the surface of proteins and acidify the solution environment to assist in reducing protein solubility.\nMaterials\nEtOH, absolute (Sigma-Aldrich, cat. no. 34852-M)\nTotal protein extract supernatant (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0001])\n2.5 M sodium acetate, pH 5.0 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0004])\n8 M UTU (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0009]; make fresh)\nMicrocentrifuge (e.g., Eppendorf 5430R)\nCleaning wipes (e.g., KIMTECH SCIENCE)\n1. Add 5 volumes of EtOH to the total protein extract supernatant from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0001].\n2. Add 100 to 300 µl (∼1/20 of the total volume) of 2.5 M NaOAc (pH 5.0). Mix gently by inverting several times and incubate at room temperature (24°C) for 3 hr.\n3. Centrifuge 20 min at 21,000 × g.\n4. Discard supernatant, carefully removing the residual liquid from the tube wall with a cleaning wipe.\n5. Gently resuspend pellet with 100 to 300 µl of 8 M UTU as total protein.\nThe volume of resuspension buffer needed depends on the pellet size, which can differ from tissue to tissue. Resuspension must be done very gently to avoid induction of air bubbles in the tube. This can be achieved by gentle pipetting. Vortexing is not recommended, as it results in air bubble formation.\n6. Proceed to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0005] to determine protein concentration and make protein aliquots.",
    "SP3 technology (Hughes et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0021]) applies paramagnetic beads coated with carboxyl to bind proteins by hydrophilic interaction. Unbound substrates in the solution will be easily removed with a magnetic rack and pipet. This technique supports on-bead tryptic digestion, so clean-up of proteins and protein digestion will be conducted in the same tube. This protocol is a combined alternative to Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0002] and 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006].\nMaterials\nSpeedBeads magnetic carboxylate-modified particles (GE Healthcare, cat. no. 45152105050250/65152105050250)\nUltrapure water (∼0.055 μS/cm; e.g., Sartorius)\nTotal protein extract supernatant (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0001])\n8 M UTU (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0009]; make fresh)\n6.5 mM DTT (e.g., Sigma-Aldrich, cat. no. D0632)\n27 mM iodoacetamide (IAA; e.g., Sigma-Aldrich, cat. no. I1149)\nEtOH (e.g., Sigma-Aldrich, cat. no. 34852-M)\n80% (v/v) EtOH (e.g., Sigma-Aldrich, cat. no. 34852-M)\n100 mM ammonium bicarbonate (ABC; e.g., Sigma-Aldrich, cat. no. A6141; store ≤1 month in cool place)\nLys-C (e.g., Promega, cat. no. VA1170; optional)\n0.4 μg/μl trypsin, modified sequencing grade (e.g., Promega, cat. no. V5113)\n10% (v/v) trifluoroacetic acid (TFA; e.g., Thermo, cat. no. 85183)\n1.5- and 2-ml tubes (e.g., Eppendorf)\nMagnetic rack\nTube shaker (e.g., Thermo-Shaker, BioSan TS-100C), room temperature and 37°C\nMicrocentrifuge (e.g., Eppendorf 5430R)\nAdditional reagents and equipment for determining protein concentration and making protein aliquots (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0005])\nCAUTION: Prepare the TFA solution in a fume hood.\nReady-to-use bead preparation\n1. Calculate required amount of SpeedBeads magnetic carboxylate-modified particles (abbreviated as “beads” below).\nFor example, 2 mg (40 µl) of beads is required for every 200 µg protein.",
    "2. Resuspend beads well in the original bottle, immediately transfer required amount of beads (according to the calculation in step 1) to a new 2-ml tube, place tube on a magnetic rack for 2 min to make the beads settle to the bottom of the tube, and then discard supernatant using a pipet.\n3. Remove tube from the magnetic rack, add 400 µl ultrapure water and gently mix beads and water by inversion, put tube back on the magnetic rack for 2 min, and then discard supernatant using a pipet.\n4. Repeat step 3 two more times.\n5. Resuspend beads with 40 µl ultrapure water per 2 mg beads.\nPrepared beads can be stored ≤1 month at 4°C.\nProtein aliquots and pre-digestion\n6. According to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0005], determine protein concentration and make protein aliquots (e.g., 200 µg protein per aliquot) of the total protein extract supernatant from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0001].\n7. Bring up volume of each aliquot to 452 µl with 8 M UTU.\n8. Add 4 µl of 6.5 mM DTT per 200 µg protein and incubate at room temperature for 30 min.\n9. Add 4 µl of 27 mM IAA per 200 µg protein and incubate in the dark at room temperature for 20 min.\nProtein clean-up with ready-to-use beads\n10. Add 40 µl ready-to-use beads from step 5 for every 200 µg protein.\n11. Add 500 µl EtOH to induce protein-bead binding.\nAvoid excessive mixing to minimize loss due to beads sticking to the upper region of the tube.\n12. Briefly shake to homogenize and incubate at room temperature (24°C) for 15 min with shaking at 1000 rpm.\n13. Place tube on the magnetic rack for 2 min and then discard supernatant using a pipet.",
    "Pay attention to the binding pattern of beads on the interior bottom tube wall. If the beads on the tube wall show a distributed spread, then it means the proteins bound to the beads nicely.\n14. Remove tube from the rack, add 1.5 ml of 80% EtOH, and mix by pipetting to wash beads.\n15. Place tube in the magnetic rack for 2 min and then discard supernatant using a pipet.\n16. Repeat steps 14 and 15 two more times.\n17. Remove tube from the rack and add 200 µl of 100 mM ABC to tube.\nProtein-on-beads digestion\n18. Optional: Add 4 μl Lys-C per 200 μg protein, gently shake tube to mix the solution and beads, and incubate at room temperature for 3 hr.\nLys-C is recommended when phosphopeptide enrichment is desired, as trypsin often fails to cleave near phosphorylated amino acids. For complex proteome analysis, pre-digestion with Lys-C could increase the number of identified proteins by up to 10%. It is optional as it depends on the researcher's budget.\n19. Add 4 µl of 0.4 µg/µl trypsin per 200 µg protein, gently shake tube to mix the solution and beads, incubate at 37°C overnight with shaking at 1000 rpm.\nUsing a 200-μl tip, gently push the beads not covered by liquid into the digestion solution. Avoid mixing by pipetting up and down. Because the beads are very sticky at this point in the protocol, they will attach to the pipet tip, resulting in protein loss.\n20. Centrifuge tube for 1 min at 21,000 × g, at room temperature (24°C).\n21. Place tube in the magnetic rack for 2 min.\n22. Transfer supernatant to a fresh tube and add 20 µl of 10% TFA solution to acidify sample.",
    "23. Continue to Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0007] for phosphoproteome analysis or go directly to Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009] for proteome analysis.",
    "MF extraction is a common procedure in studies involving membrane proteins. Here, we provide an MF extraction protocol using a glass tissue homogenizer for disruption of cereal plant tissue based on previous work (Pertl-Obermeyer & Obermeyer, 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0039]; Wu et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0059]).\nMaterials\nFrozen plant sample: maize root and shoot or wheat leaf (about 200 mg to 1 g; freshly harvested or frozen at −80°C)\nMF extraction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0003]; make fresh), 4°C\n8 M UTU (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0009]; make fresh)\nAluminum foil\nHammer or pestle\n10-ml glass Potter-Elvehjem homogenizer with Teflon pestle (e.g., 10 ml)\nMiracloth (e.g., EMD Millipore, cat. no. 475855)\nGlass funnel (e.g., VWR)\n50-ml Falcon tubes\nRefrigerated high-speed benchtop centrifuge (e.g., Sigma-Aldrich 3-30KS), 4°C\nUltracentrifuge tubes (30-ml round-bottom tubes, screw cap, for rotor 12158; Sigma-Aldrich 3-30KS)\nCleaning wipes (e.g., KIMTECH SCIENCE, cat. no. 05511)\n1. Weigh 1 to 3 g frozen plant sample, wrap sample with aluminum foil, and smash wrapped sample into smaller pieces with a hammer or a pestle.\nAvoid grinding samples in liquid nitrogen. Keep the samples cool by performing this step as quickly as possible.\n2. Transfer frozen plant material into a 10-ml glass Potter-Elvehjem homogenizer with a Teflon pestle and add 10 ml cold MF extraction buffer, and place homogenizer into an ice bath. Slowly push and pull pestle while twisting it over the sample to generate a homogenate as thoroughly as possible.\nIf the sample is >3 g, use a larger homogenizer (e.g., 30 ml) fully filled with extraction buffer. For optimal homogenization, perform at least 200 strokes. An electric cordless driver (e.g., Einhell TE-SD 3,6 Li, cat. no. 45.134.90) can be used to efficiently generate homogenate with less manual labor. Perform the homogenization in a gentle way to avoid formation of air bubbles.",
    "3. Place four layers of miracloth on a glass funnel, hold glass funnel atop a 50-ml Falcon tube on ice, and filter homogenate through the miracloth and into the tube.\nNylon mesh (105 to 150 µm) can be used instead of miracloth.\n4. Centrifuge filtered homogenate for 15 min at 7500 × g, 4°C, in a refrigerated high-speed benchtop centrifuge.\n5. Transfer supernatant to an ultracentrifuge tube and centrifuge 80 min at 48,000 × g, 4°C.\n6. Discard supernatant and carefully remove residual liquid from the tube wall with a cleaning wipe.\nAlternatively, collect the supernatant into a fresh Falcon tube as cytoplasmic fraction (CF) protein if it is useful for other experiments.\n7. Gently resuspend pellet with 100 to 500 µl of 8 M UTU as MF protein.\nThe volume for resuspension depends on the size of the MF pellet. Resuspension must be done very gently to avoid formation of air bubbles.\nThe MF proteins stay natively in the extraction buffer. To keep the proteins in native form for other experiments, resuspension buffer containing 330 mM sucrose/mannitol, 25 mM Tris-MES, pH 7.5, and 0.5 mM DTT is recommended instead of 8 M UTU. Addition of 0.1% dodecylmaltoside (DDM) to the resuspension solution would facilitate the MF solubilization.\n8. Proceed to determining protein concentration and making protein aliquots according to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0005].",
    "The Bradford assay (Bradford, 1976[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0007]) is a colorimetric method to determine protein concentration based on the unspecific interaction of a dye (Coomassie brilliant blue G-250, or CBB) with proteins. Upon binding to proteins, a shift in the absorption maximum of CBB (from 465 to 595 nm) occurs, which can be detected via photometric measurements. As there is a linear relationship between protein concentration and the shift in the absorption maximum, it is an easy and precise tool for reliable protein quantification. Please note that the Bradford assay is not tolerant to high detergent content in the sample.\nMaterials\nUltrapure water (∼0.055 μS/cm; e.g., Sartorius)\n1 µg/µl bovine serum albumin (BSA; Sigma-Aldrich, cat. no. A9647)\n8 M UTU (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0009]; make fresh)\nBradford reagent (Sigma-Aldrich, cat. no. B6916)\nTotal protein extract supernatant (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0001]) or resuspended proteins (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0002] or 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0004])\nFlat-bottom, transparent 96-well plate (e.g., microplate 96-well flat-bottom clear, Greiner, cat. no. 655101)\nSpectrophotometer (e.g., Tecan, Infinite M200 PRO)\n1.5-ml Eppendorf tubes\nStandard curve\n1. Add reagents to wells of a flat-bottom, transparent 96-well plate as follows:\n         \ntable:\n﻿0,1,2,3,4,5,6\nReagent,Example well position,Example well position,Example well position,Example well position,Example well position,Example well position\n,A1,A2,A3,A4,A5,A6\nUltrapure water (μl),24,23,22,21,20,19\n1 μg/μl BSA (μl),0,1,2,3,4,5\n8 M UTU (μl),1,1,1,1,1,1\nBradford reagent (μl),200,200,200,200,200,200\nThe 8 M UTU is applied as blank buffer. For proteins resuspended in another resuspension buffer, change the 8 M UTU to that resuspension buffer.\n2. Incubate at room temperature in the dark for 15 min and then determine absorbance at 595 nm using a spectrophotometer.\n3. Generate a standard curve with linear regression (absorbance read A595 = a × protein concentration + b) and display equation and R2 value on the chart.\nThe regression fit to estimate a, b, and R2 can be performed in spreadsheet software (e.g., Excel).",
    "Resuspended protein concentration\n4. To determine the unknown protein concentration, add the following reagents to another well:\n         \ntable:\n﻿0,1\nReagent,Example well position\n,A7\nUltrapure water (μl),24\nTotal protein extract supernatant or resuspended proteins (μl),1\nBradford reagent (μl),200\n5. Incubate at room temperature in the dark for 15 min and then determine absorbance at 595 nm using a spectrophotometer.\nA prolonged incubation time or exposure to light can alter the results, as CBB gets oxidized naturally by the oxygen in the air.\n6. Calculate unknown protein concentration.\nResuspended protein concentration (μg/μl) = (A595 – b)/a, where a and b are derived from the standard curve in step 3.\nIn principle, unknown protein concentrations ranging from 1 to 5 µg/µl can be determined relatively accurately. Concentrations outside this range may be measured with significantly reduced accuracy. In this case, adjust the concentrations used in the standard curve accordingly.\nProtein aliquots\n7. Make protein aliquots into fresh 1.5-ml Eppendorf tubes.\nTypical amounts of protein in aliquots are 150 to 200 µg for phosphoproteome analysis and 5 to 7 µg for proteome analysis. Adjust the amount of protein in each aliquot according to the availability of protein extracts and the quantitation ability of the LC-MS/MS (see Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0010]). If less than the recommended protein amount is available, the protocol will still work but will yield fewer protein/peptide identifications.\nStore the supernatant for up to several months at –80°C if not used immediately.",
    "Before LC-MS/MS analysis (Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0010]), the protein should be digested into peptides ideally ranging between 7 and 20 amino acids in length and that likely produce a positive charge during electrospray ionization. The 8 M UTU provides a good buffering environment for protein resuspension and unfolding, making proteins accessible to enzymatic digestion. The DTT and IAA prevent the formation of disulfide bonds from cysteine residues and aid in the complete denaturation of proteins for enzymatic digestion. Endoproteinase Lys-C cleaves peptide chains at the C-terminal side of lysine (K), and trypsin cuts at the C-terminal side of lysine (K) or arginine (R). It is optional to add Lys-C, which reduces the number of proteins identified with miscleavages by trypsin, especially in the high-urea environment. Pre-digestion with Lys-C can increase the number of identified peptides by up to 10%, but on the whole-protein level, it rarely affects the downstream analysis. For phosphopeptide analysis, pre-digestion is recommended, as trypsin often misses cleavage near phosphorylated amino acids. The TFA acidifies the buffer environment to stop the trypsin digestion reaction and adds positive charge to the peptides.\nMaterials\nAliquots of protein from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0002] or 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0004] (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0005])\n8 M UTU (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0009])\n6.5 mM DTT (e.g., Sigma-Aldrich, cat. no. D0632)\n27 mM IAA (e.g., Sigma-Aldrich, cat. no. I1149)\nLys-C (e.g., Promega, cat. no. VA1170; optional)\n10 mM Tris/HCl, pH 8.0 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0006])\n0.4 μg/μl trypsin, modified sequencing grade (e.g., Promega, cat. no. V5113)\n10% (v/v) TFA (e.g., Thermo, cat. no. 85183)\nTube shaker (e.g., Thermo-Shaker, BioSan TS-100C), 37°C\npH strips (e.g., Roth, cat. no. 0549.2)\nMicrocentrifuge (e.g., Eppendorf 5430R)\n1.5-ml Eppendorf tubes\nRotary vacuum concentrator (e.g., Christ, RVC 2-25 CD plus; optional)\nCAUTION: Prepare the TFA solution in a fume hood.",
    "1. Bring up volume of the aliquots of protein from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0002] or 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0004] to the same level using 8 M UTU.\nThis step enables adding an equal volume of dilution buffer to each aliquot in step 5, which is more convenient when processing many samples and reduces reaction variance among aliquots.\n2. Add 4 µl of 6.5 mM DTT per 200 µg protein and incubate at room temperature for 30 min.\n3. Add 4 µl of 27 mM IAA per 200 µg protein and incubate in the dark at room temperature for 20 min.\n4. Optional: Add 4 μl Lys-C per 200 μg protein and incubate at room temperature for 3 hr.\nLys-C is recommended when phosphopeptide enrichment is desired, as trypsin often fails to cleave near phosphorylated amino acids. For complex proteome analysis, pre-digestion with Lys-C could increase the number of identified proteins by up to 10%. It is optional as it depends on the researcher's budget.\n5. Dilute solution with 4 volumes of 10 mM Tris/HCl (pH 8.0).\nThis step is absolutely necessary to dilute the urea concentration; trypsin is very sensitive to high salt.\n6. Add 4 μl of 0.4 μg/μl trypsin per 200 μg protein and incubate at 37°C overnight with shaking at 1000 rpm.\n7. Acidify solution with 0.02 volumes of 10% TFA. Test solution pH with pH strips to verify it has been acidified to around pH 2.\nIf the sample pH remains more alkaline, carefully add more of the 10% TFA solution to reach pH 2.\n8. Centrifuge acidified solution for 10 min at 21,000 × g and then transfer supernatant to a fresh 1.5-ml Eppendorf tube.",
    "9. Dry supernatant in a rotary vacuum concentrator and then proceed to Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0008] for phosphoproteome analysis or go directly to Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009] for whole proteome analysis of the supernatant.",
    "TiO2 has a high affinity toward phosphopeptides (and other rather acidic peptides) and is water insoluble. Phosphopeptides can be loaded onto TiO2 beads in an acidic environment (loading buffer) and eluted from TiO2 beads into alkaline buffer (elution buffer). When using TiO2 bulk material to enrich the phosphopeptides, the buffer exchanges and removal of non-phosphopeptides are easily achieved by spinning and pipetting. The formic acid in the final step is used to create positively charged phosphopeptides that can bind to the C18 material in Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009].\nMaterials\nTiO2 beads (e.g., GL Science, cat. no. 5020-75000)\nMethanol (e.g., Sigma-Aldrich, cat. no. 34860)\nElution buffer: 1% (v/v) ammonia (NH4OH) solution (Sigma-Aldrich, cat. no. 5438300250)\nDried peptides (see Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0003])\nLoading buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-rec-0002])\nWash buffer: 80% (v/v) acetonitrile (ACN; Sigma-Aldrich, cat. no. 34851) and 1% (v/v) TFA (Thermo, cat. no. 85183)\n10% (v/v) formic acid (FA; e.g., Roth, cat. no. 4724.1)\n2-ml round-bottom Eppendorf tubes\nVortex shaker (e.g., Scientific Industries Vortex-Genie 2 with microtube insert)\nMicrocentrifuge (e.g., VWR MiniStar silverline)\n1.5-ml Eppendorf tubes\nCAUTION: Combine the ACN and TFA in the wash buffer in a fume hood and prepare the FA solution in a fume hood.\nReady-to-use TiO2 preparation\n1. Weigh 2 mg TiO2 beads per 200 μg protein into a 2-ml round-bottom Eppendorf tube.\n2. Add 200 μl methanol and suspend TiO2 beads by shaking on a vortex shaker for 60 s. Then, centrifuge 2 min at 2000 × g and carefully remove methanol with a pipet.\nCAUTION: Add the methanol in a fume hood.\n3. Add 200 μl elution buffer to TiO2 beads and shake on vortex shaker for 10 min. Then, centrifuge 2 min at 2000 × g and carefully remove buffer with a pipet.",
    "4. Add 100 μl wash buffer to TiO2 beads and shake on vortex shaker for 2 min. Then, centrifuge 2 min at 2000 × g and carefully remove buffer with a pipet.\n5. Repeat step 4 two more times.\nNow the TiO2 beads are ready to use.\nPhosphopeptide enrichment with ready-to-use TiO2\n6. Resuspend dried peptides from Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0003] with 200 μl loading buffer.\n7. Transfer resuspended peptides to the ready-to-use TiO2 beads and incubate for 30 min with continuous shaking on a vortex shaker.\n8. Centrifuge 2 min at 2000 × g and carefully transfer supernatant to a fresh tube with a pipet or discard.\nThe buffer contains peptides that did not bind to the TiO2. If these unbound peptides are required to also be quantified, collect the supernatant into a fresh tube; otherwise, discard the buffer.\n9. Add 100 μl loading buffer to TiO2 beads, briefly shake on vortex shaker for 60 s, centrifuge 2 min at 2000 × g, and carefully transfer supernatant to a fresh tube with a pipet or discard.\nThe buffer contains peptides that did not bind to the TiO2. If the unbound peptides are required to be quantified, collect the supernatant into a fresh tube; otherwise, discard the buffer.\nTo quantify the unbound peptides by LC-MS/MS, dry the collected buffer in a vacuum dry evaporation system, resuspend the dried peptides with 10 mM Tris/HCl (pH 8.0), acidify the buffer to pH 2 with 10% TFA, and desalt with C18 according to Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009]. Unbound peptides are then ready to be quantified by LC-MS/MS as in Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0010].\n10. Add 100 μl wash buffer to TiO2 beads, shake on vortex shaker for 2 min, centrifuge 2 min at 2000 × g, and carefully remove supernatant with a pipet.",
    "11. Repeat steps 9 and 10 two more times.\n12. Add 80 μl elution buffer to TiO2 beads and incubate for 15 min with continuous shaking on vortex shaker.\n13. Centrifuge 2 min at 2000 × g and carefully transfer supernatant to a fresh 1.5-ml Eppendorf tube with a pipet.\nThe buffer in this step contains eluted phosphopeptides.\n14. Repeat steps 12 and 13 for two more cycles.\n15. Add 60 μl of 10% FA to 240 μl eluate.\n16. Centrifuge acidified solution for 10 min at 21,000 × g, transfer supernatant to a fresh tube, and directly proceed to Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009].\nIn the case that samples need to be stored before LC-MS/MS analysis (see Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0010]), we recommend storing the samples at –20°C after desalting (see Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009]).",
    "Robotized automation of sample preparation significantly reduces hands-on time and improves sample handling consistency. This protocol (an alternative to Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0007]) describes phosphopeptide enrichment using the Agilent Bravo Automated Liquid Handling Platform. The Fe3+ can interact with negatively charged phosphate groups on the peptides, and it has been widely applied as an immobilized metal-ion affinity-based enrichment method. The Fe(III)-NTA cartridge is a standard product for phosphopeptide enrichment using the Agilent Bravo platform (Russell & Murphy, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0042]). Of course, other cartridge materials as offered by other manufacturers can also be used following this protocol.\nMaterials\nRobot buffers:\n               \nReversed Phase S Priming buffer and Syringe Wash buffer (70% ACN, 0.1% TFA)\nReversed Phase S Elution buffer (70% ACN, 0.1% TFA)\nReversed Phase S Equilibration and Cartridge Wash buffer (5% ACN, 0.1% TFA)\nFE(III)-NTA cartridges Priming buffer and Syringe Wash buffer (99.9% ACN, 0.1% TFA)\nFE(III)-NTA cartridges Elution buffer (99% H2O, 1% NH3)\nFE(III)-NTA cartridges Equilibration and Cartridge Wash buffer (80% ACN, 1% TFA)\nDried peptides (see Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006])\nLoading buffer (see recipe)\n10% (v/v) FA (Roth, cat. no. 4724.1)\nBravo Automated Liquid Handling Platform (Agilent)\nLabware (all Agilent):\n               \n96 AssayMAP Head (Agilent, cat. no. G5058A)\n96 V11 LT 250 Tip Box (cat. no. 19477.002)\n96AM Cartridge Seating Station (cat. no. G5409-20025)\n96 AbGene 1127, 1 ml Deep Well, Square Well, Round Bottom\n96 Greiner 650201, U-Bottom Standard, PolyPro\n96 Eppendorf 30129300, PCR, Full Skirt, PolyPro\n12 Column, Low Profile Reservoir, Natural PP (cat. no. 201280-100)\nAssayMAP Reversed Phase S 5-µl cartridges (Agilent, cat. no. G5496-60033)\nAssayMAP Fe(III)-NTA cartridges (Agilent, cat. no. G5496-60085)\nCAUTION: Combine the ACN and TFA in the robot buffers in a fume hood and prepare the FA solution in a fume hood.\nRobot system initialization",
    "1. Turn on water pump, robot, thermo controller, and computer for the Bravo Automated Liquid Handling Platform (Agilent).\nPrepare the robot system according to the standard manuals from Agilent.\n2. Open “Protein Sample Prep Workbench” application on the computer to connect the robot and access the operation interface. Click on “Utility Library,” go to “System Startup/Shut down v2.2,” and start program “Run Startup.”\nPeptide clean-up\n3. When the “Run Startup” program has finished, click “APP Library” button and go to program “Peptide Cleanup v3.0.”\n4. In the “Select method” area, click “…” button to browse the methods folder. View ready-to-use methods located at “VWorks Workspace” > “Methods” > “AM Peptide Cleanup v3.0.” Select method file with the default setting and click on “Load.”\nAs soon as the loading finishes, all the parameter boxes on the operation interface can be filled with numbers from the default method setting.\n5. Change parameters according to the experiment requirements. Select labware according to the experiment in the “Labware Table” area on the interface.\nExamples for the parameters are shown for reference (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f5d079f0-6020-4360-b4d4-0e3522f9732d/cpz1425-fig-0002-m.jpg</p>\nFigure 2\nScreenshot presenting the reference parameters for the Agilent robot for phosphopeptide enrichment preparation. (A) Peptide Cleanup program parameters. (B) Phosphopeptide Enrichment program parameters.\n6. According to the “Deck Layout” and “Labware Table,” place corresponding labware and AssayMAP Reversed Phase S 5-µl cartridges at the required deck position on the robot stations.\n7. Fill corresponding robot buffers in deck numbers 5, 6, and 8. Resuspend dried peptides from Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006] in 200 ml loading buffer and transfer into appropriate Labware (96 Greiner 650201, U-Bottom Standard, PolyPro) at deck position 4 (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-fig-0002]).\nAlways double-check that the layout on the robot is the same as described in the method interface.\n8. Click on “Run Protocol.”",
    "Protein samples need to be acidified by 10% TFA (Thermo, cat. no. 85183) to pH 2 (step 7 in Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006]) before loading on the reversed-phase cartridges.\nThe AssayMAP Reversed Phase S 5-µl cartridges can be stored in their priming buffer and used up to five times.\nPhosphopeptide enrichment with Fe(III)-NTA cartridges\n9. When the protocol program finishes, click “App Library” button and go to program “Phosphopeptide Enrichment v2.1.”\nIn the program, the parameter boxes are prefilled with default settings.\n10. Change parameters according to the experiment requirements. Select labware in the “Labware Table” area.\nReference parameters and labware are shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-fig-0002].\n11. Prepare corresponding labware plate and AssayMAP Fe(III)-NTA cartridges at the right deck position on the robot stations.\n12. Fill corresponding robot buffers into the labware at deck numbers 5, 6, and 8.\nDouble-check the layout on the robot. It should be the same as described in the method interface.\n13. Click on “Run Protocol.”\n14. When the protocol program finishes, take final eluate plate off deck 9 and immediately add 20 µl of 10% FA to acidify samples.\nThe volume of 10% FA required for acidification depends on the elution volume. It is recommended to use pH strips to measure sample pH. Acidified samples should be at around pH 2 (see also step 7 of Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006]).\nFinalization and robot system shut-down\n15. Save leftover buffers or discard into a special waste station and tidy up robot stations.",
    "AssayMAP FE(III)-NTA cartridges can be washed and stored in their priming buffer and used up to three times. However, if the used cartridge is found drying in the air for >20 min or the filling of the cartridge has cracked, throw the cartridge away. Regenerated cartridges should still be light yellow in color. If the phosphopeptides are in a solution with colorful substance (e.g., plant secondary metabolites) and this changed the color of the cartridge after use, throw the cartridge away.\n16. Click “Utility Library” button and go to “System Startup/Shut down v2.2.” Run program “Run Shutdown.” As soon as the program finishes, shut down system according to the user manual from Agilent.",
    "Salts can interfere with the column resolution, and peptide solutions containing high salt are usually not suitable to run in LC-MS/MS (Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0010]) due to highly dominant salt ions. This protocol describes using the Empore Disk C18 material for reversibly binding peptides for desalination and concentration (Rappsilber, Ishihama, & Mann, 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0040]).\nMaterials\nSolution B: 80% (v/v) ACN (Sigma-Aldrich, cat. no. 34851) and 0.5% (v/v) acetic acid (Thermo, cat. no. 85183; store at room temperature or 4°C)\nSolution A: 0.5% (v/v) acetic acid (Thermo, cat. no. 85183; store at room temperature or 4°C)\nSupernatant (see Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0003] or 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0008] or Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006] or 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0007])\nEmpore Disk C18 (e.g., Varian, cat. no. 12145004)\nBlunt-tipped hypodermic needle\nSuitable-diameter stick (to allow passage through needle)\n200-µl pipet tip (e.g., VWR, cat. no. 89041-378)\nCentrifuge adapter (for 200-µl pipet tip; e.g., GL Sciences, 5010-21341)\n2-ml round-bottom Eppendorf tube\nMicrocentrifuge (e.g., Eppendorf 5430R)\n1.5-ml Eppendorf tube\nRotary vacuum concentrator (e.g., Christ, RVC 2-25 CD plus)\nCAUTION: Prepare Solutions A and B in a fume hood.\nImmobilization of C18 material in pipet tip\n1. Place an Empore Disk C18 on a flat, clean surface (e.g., disposable plastic petri dish).\n2. Press and twist a blunt-tipped hypodermic needle into Empore Disk C18 to punch out two small pieces.\n3. Push small pieces of disk out of the needle with a suitable-diameter stick and immobilize it in taper of a 200-µl pipet tip.\nOne piece of disk can bind ∼100 µg protein. It can be stored for long periods of time at room temperature.\nReady-to-use C18 tip preparation\n4. Hold C18 tip with a centrifuge adapter and place it into a 2-ml round-bottom Eppendorf tube.",
    "5. Add 50 µl Solution B to C18 tip and centrifuge ∼5 min at 3000 × g, until solution has completely passed through the C18 tip.\n6. Discard waste solution in the tube.\n7. Add 100 μl Solution A to C18 tip and centrifuge about 5 to 8 min at 3000 × g, until solution has completely passed through the C18 tip.\n8. Discard waste solution in the tube.\n9. Repeat steps 7 and 8 once more.\nNow the C18 tip is ready to bind peptides.\nPeptide desalting\n10. Transfer supernatant from Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0003] or 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0008] or Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0006] or 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0007] to the ready-to-use C18 tip and centrifuge about 5 to 10 min at 3000 to 6000 × g, until solution has completely passed through the C18 tip.\nAvoid aspiration of any pellet. The maximum loading volume for one centrifugation is 150 µl.\n11. Discard waste solution in the tube.\n12. Add 100 μl Solution A to wash peptides bound to the C18 tip and centrifuge about 5 to 10 min at 3000 to 6000 × g, until solution has completely passed through the C18 tip.\n13. Discard waste solution in the tube.\n14. Repeat steps 12 and 13 once more.\n15. Centrifuge C18 tip with bound peptides for 2 min at 3000 × g to remove residual solution on the tip.\n16. Place C18 tip in a fresh 1.5-ml Eppendorf tube.\n17. Add 20 μl Solution B to elute peptides from the C18 tip and centrifuge 5 min at 3000 × g until solution has completely passed through the C18 tip.\n18. Repeat step 17 once more.\n19. Concentrate eluted peptides in a rotary vacuum concentrator until completely dry.\nDried peptides can be stored dry for a long time at –20°C.",
    "The complex peptide mixture obtained at the end of Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009] is separated by reversed-phase LC and is then directly detected and quantified by tandem MS (MS/MS). We apply the Thermo EASY-nLC 1200 system as a nanoflow liquid ultra-high pressure chromatography system (UHPLC). We use a C18 stationary phase packed into an EASY-Spray analytical column (25 cm × 75 μm inner diameter). Eluting peptides are directly sprayed into the mass spectrometer after ion spray ionization. The MS platform that we use here is the Thermo Q-Exactive HF Hybrid Quadrupole-Orbitrap Mass Spectrometer. The raw spectrum scans from MS are subjected to matching against proteome sequences from the respective organism using the application MaxQuant (Version 2.0.3.0) (Cox & Mann, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0010]; Tyanova, Temu, & Cox, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0052]). The reference protein sequence database is downloaded from EnsemblPlants (https://plants.ensembl.org/index.html[href=https://plants.ensembl.org/index.html]). We describe the parameter settings for LC-MS/MS analysis and MaxQuant data processing for phosphoproteome analysis in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-tbl-0001]. The settings for non-modified proteins can be found in previous studies (He et al., 2021; Li et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0029]; Schulze et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0044]).\nTable 1.\n                LC-MS/MS Parameters for the Analysis of Phosphopeptides\ntable:\n﻿Instrument,Parameter,Setting\nLC system,Sample loading Gradient length (min) Gradient flow rate (nl/min) Linear gradient (% LC solvent B in LC solvent A),At max. pressure 900 bar 90 250 2%-55% for 60 min 55%-95% for 10 min 95% for 5 min 95%-2% for 5 min 2% for 10 min\nIon source,Column heater temperature (°C) Spray voltage (kV) Capillary temperature (°C),35 2.0 250\nMass spectrometer: full MS,Resolution (at m/z 200) Automatic gain control target (ions) Maximum injection time (ms) Scan range (m/z),\"60,000 500,000 60 300-1800\"",
    "Mass spectrometer: dd-MS2,Resolution (at m/z 200) Automatic gain control target (ions) Maximum injection time (ms) Loop count Isolation window (m/z) TopN Scan range (m/z) Normalized collision energy ((N)CE),\"15,000 100,000 60 20 1.6 20 200-2000 27\"\nMass spectrometer: general,Polarity Intensity threshold Charge exclusion Peptide match Dynamic exclusion (s),\"Positive 210,000 Unassigned, 1, 6-8, >8 Preferred 20\"\nMaterials\nDried (phospho)peptides (see Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009])\nResuspension buffer: 5% (v/v) ACN (Sigma-Aldrich, cat. no. 34851) and 0.1% (v/v) TFA (Thermo, cat. no. 85183) (store ≤2 months at room temperature)\nMicrotiter plate (e.g., Thermo, cat. no. AB-0800)\nNanoflow UPLC system (e.g., Thermo, EASY-nLC 1200)\nPacked column (C18 stationary phase packed into EASY-Spray analytical column, 25 cm × 75 μm inner diameter)\nMass spectrometer (e.g., Thermo, Q-Exactive HF)\nMaxQuant application (e.g., Version 2.0.3.0)\nCAUTION: Combine the ACN and TFA in the resuspension buffer in a fume hood.\n1. Resuspend dried (phospho)peptides from Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-prot-0009] with 5 µl resuspension buffer and transfer them to a microtiter plate. Place microtiter plate into the nanoflow UPLC system for LC detection.\n2. Run LC with a packed column using standard settings (see parameters in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-tbl-0001]).\n3. Set parameters for mass spectrometer data acquisition according to Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-tbl-0001] and run MS analysis.\nThe data acquisition parameters may need to be modified when alternative LC or MS instruments are used.\n4. Load LC-MS/MS output raw file into the MaxQuant application and set parameters for fixed and variable modification quantitation and protein identification as proposed in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-tbl-0002].\nDefault settings in MaxQuant are suggested to be left unchanged. For analysis of protein modifications, such as phosphorylation, variable modifications need to be defined accordingly. In-depth information about MaxQuant settings is available (Tyanova, Temu, & Cox, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0052]).\nTable 2.\n                MaxQuant Settingsa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-tbl2-note-0001_119] for Phosphopeptide Identification and Quantification\ntable:\n﻿Parameter type,Parameter,Setting",
    "Group-specific parameters,Version Type Multiplicity Enzyme Maximum missed cleavages Variable modifications Fixed modifications Label-free quantification First search p.p.m. Main search p.p.m.,2.0.3.0 (or newer) Standard 1 Trypsin/P 2 Oxidation (M) Acetylation (protein N-term) Phosphorylation (STY) Carbamidomethyl (C) Fast LFQ 20 4.5\nGlobal parameter,\"Include contaminants Minimum peptide length (residues) Maximum peptide mass (Da) PSM FDR Protein FDR Site decoy fraction Match between runs Match time window (min) Alignment time window (min) MS/MS tolerance (Fourier transform MS, p.p.m.) Top MS/MS peaks per Da interval\",TRUE 7 4600 0.01 0.01 0.01 TRUE 0.7 20 20 12\na In-depth information about MaxQuant settings is provided in Tyanova, Temu, & Cox (2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0052]).\n5. Begin loading reference sequence into MaxQuant in the tab “Global parameters” > “Sequence” > “Fastafiles.” Click on “Add” button to load the reference sequence from a local folder where the reference sequence was downloaded from the web.\nThe latest download links for “fasta” files of maize and wheat are http://ftp.ensemblgenomes.org/pub/plants/release-52/fasta/zea_mays/pep/[href=http://ftp.ensemblgenomes.org/pub/plants/release-52/fasta/zea_mays/pep/] and http://ftp.ensemblgenomes.org/pub/plants/release-52/fasta/triticum_aestivum/pep/[href=http://ftp.ensemblgenomes.org/pub/plants/release-52/fasta/triticum_aestivum/pep/], respectively.\n6. Obtain output files and perform statistical analysis.\nMaxQuant generates output files that can be used as input for project-specific statistical analysis. The peptide quantification information is found in “evidence.txt” or “Phospho (STY)Sites.txt,” which contain information on phosphopeptides, whereas the output file “ProteinGroups.txt” table contains information on all proteins identified. An explanation of column headers in each of the tables is provided by MaxQuant together with the output tables.",
    "There are many software platforms and R-based or Python-based packages for downstream data processing. For example, popular software platforms include Perseus (Tyanova, Temu, Sinitcyn, et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0053]; see Current Protocols article: Yu et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0063]) and cRacker (Zauber & Schulze, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0064]). Recently released packages for phosphoproteomic analysis include the R-based packages PhosPiR (Hong et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0018]) and PhosR (Kim, Kim, Hoffman, et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0023]; Kim, Kim, & Xiao, 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0024]) and the Python-based package PaDuA (Ressa, Fitzpatrick, Van Den Toorn, Heck, & Altelaar, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.425#cpz1425-bib-0041])."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}