{
  "id": 4962,
  "origin_website": "Bio",
  "title": "Dye Labeling of Live <em>Nippostrongylus brasiliensis</em> Larvae for Visualization in Host Tissue",
  "procedures": [
    "If only external labeling of the larvae is required, follow step A1 from the Internal labeling protocol and then proceed with the external labeling protocol.Internal labeling of N. brasilienisis iL3 using YO MicrospheresPrepare sufficient Nippostrongylus brasiliensis L3 larvae for experiment by washing larvae three times with 3 ml of PBS in a 15 ml tube and allowing larvae to settle by gravity after each wash. Allowing the larvae to settle by gravity should take approximately 15 min and the larvae should form a pellet at the bottom of the 15 ml tube. This is carried out at room temperature.Note: 600 Nippostrongylus brasiliensis L3 larvae are used per injection. By preparing at least 700 Nippostrongylus L3 per injection, it allows for any loss during the labeling procedure.Transfer the pellet of L3 into a 1.7 ml micro-centrifuge tube using a 1 ml pipette, allow the larvae to form a pellet at the bottom of the tube by gravity for approximately 15 min and then discard any remaining PBS.Add 500 μl of Wash solution I and incubate at 37 °C in a water-bath for 1 h. Following incubation, discard Wash solution I using a pipette.Prepare a suspension of 1,500 L3 per ml in Culture Solution by microscopically counting a 10 μl sample of the L3 suspension and adjusting the concentration of larvae with Culture Solution.Add 1 ml of 1,500 L3 per ml suspension into wells of a 24 well plate. Incubate at    37 °C, 5 % CO2 overnight. Add 1 μl of YO microspheres to each well and mix by gently swirling the plate. Please refer to Note 1 in the Notes section for more information regarding this step.Incubate for 4 h at room temperature in the dark by placing in a drawer or covering the plate with tinfoil.",
    "Please refer to Notes 2-3 in the Notes section for more information regarding this step.Add 1 ml Wash solution II to each well and mix by gently swirling the plate. Transfer the larvae from each well into 15 ml tubes covered with tin foil to protect from light. Let the larvae settle for approximately 15 min to form a pellet and discard supernatant. Add 3 ml Wash Solution II to each tube and allow larvae to settle by gravity.Discard supernatant and repeat at least three times or until the supernatant becomes clear.External labeling of N. brasilienisis iL3 using CFSE Transfer the larval pellet in a 1.7 ml micro-centrifuge tube and cover with tin foil to protect from light. Allow the larvae to settle and discard supernatant using a pipette.Add 1 μl of 10 mM CFSE to the pellet and mix by gently flicking the micro-centrifuge tube 2-3 times.Incubate at room temperature for 8 min. Add 1 ml Wash solution II and mix by inverting 2-3 times.Allow larvae to settle by gravity and discard supernatant using a pipette.Repeat wash step at least three times or until the supernatant becomes clear.In vivo imaging of N. brasilienisis iL3Prepare a suspension of 600 L3 per 30 μl in PBS by microscopically counting a 10 μl sample of the L3 suspension and adjusting the larval concentration with PBS.Using an insulin syringe and needle, inject 30 μl of the L3 suspension in the appropriate site of the body intended for study:Use intra-dermal (i.d.) administration of N. brasilienisis iL3 on the ventral surface (belly skin) or the ear pinnae for imaging of the skin. Hair should be plucked around the site of injection for optimal imaging results (Figure 1). Use intra-venous (i.v.) administration of N. brasilienisis iL3 for imaging of worms migrating to lung.",
    "Note: Intra-nasal administration of live larvae does not lead to direct infection and development in the lung. Rather, the infective larvae must first past into the venous blood supply from the airway mucosa and arrive in the lungs 16-18 h later.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160217/20160217235348_1551.jpgFigure 1. Representative image of intra-dermal administration of N. brasiliensis larvae in the ear pinna with India ink incorporated in the injected solution for visualization purposes only [adapted from Camberis et al. (2013)]Harvest the tissue of interestEar-Euthanise the mouse using an approved form of euthanasia, remove the pinna using scissors and place in a Petri dish containing cold PBS for approximately 15 min to lightly anaesthetize the larvae. Belly skin-Euthanise the mouse using an approved form of euthanasia, cut a 1 cm x 1 cm piece of skin around the injection site using scissors, peel skin off and place the skin piece ventral side down in a Petri dish containing cold PBS for approximately 15 min to lightly anaesthetize the larvae. Take care to spread the skin out. Lung-Euthanise the mouse using an approved form of euthanasia. Expose the thoracic cavity and remove the lungs in one piece and place in a Petri dish containing cold PBS for approximately 15 min to lightly anaesthetize the larvae.Transfer the tissue onto a glass slide. Belly skin-Place a cover slip onto the tissue. Ear-Flatten the ear pinna as much as possible.Lung-Place lung ventral side up.Image using fluorescent stereomicroscope or Confocal microscope for more detailed imaging in the tissue. For visualizing dyes using the Confocal microscope:CFSE 473 nm laser -BP 515/50NY 559 nm laser-BP 625/100For visualizing dyes using the stereo microscope with fluorescence:CFSE BP Excitation filter 495/10-Emission BP 538/45NY Excitation filter 545/30-Emission filter BP 610/75"
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}