{
  "id": 17011,
  "origin_website": "Jove",
  "title": "Murine Intrapulmonary Tracheal Transplantation: A Model for Investigating Obliterative Airway Disease After Lung Transplantation",
  "procedures": [
    "All animals were treated in accordance with the guidelines set forth by the Canadian Council on Animal Care in the Guide to the Care and Use of Experimental Animals. The experimental protocol was approved by the Animal Care Committee of the Toronto General Hospital Research Institute, University Health Network.\n1. Donor surgery\nNOTE: BALB/c mice are used as an example of donors for the experiment. All procedures must be performed utilizing a sterile technique.\nPrior to the procedure, record the weight of each mouse.\nEuthanize the mouse using a CO2 chamber.\nOnce death is confirmed, position the mouse in a supine position and secure the limbs with tape.\nPrep the surgical area by sterilizing it with 70% isopropyl alcohol.\nMake a midline incision on the skin, starting from the mid-abdomen and extending to the anterior cervical region.\nAccess the trachea by carefully retracting the fat pads, laterally moving the strap muscles, and separating the trachea from surrounding connective tissue. Use forceps to create space between the trachea and the esophagus.\nLift the xiphoid and cut the diaphragm.\nRaise the sternum, ensuring a clear path from the sternum to the neck region by inserting a hemostat. Clamp the rib cage on both sides and cut through the sternum, extending up through the neck muscles.\nRemove the thymus and any fat or muscle obstructing the trachea to expose the tracheal bifurcation.\nCut both the main bronchi and carefully separate the airway from the esophagus.\nCut the larynx and remove it.\nSpray the dissected trachea with sterile saline solution or preservation solution with sterile gauze soaked in sterile saline or preservation solution and place it on ice to preserve its viability.\n2. Recipient surgery\nNOTE: C57BL/6 mice are used as an example of recipients for the experiment.",
    "Administer sustained-release buprenorphine subcutaneously at a dose of 1 mg/kg on the morning of the surgery day.\nInduce anesthesia in an induction chamber using 5% isoflurane.\nOnce the mouse is lightly anesthetized, intraperitoneally inject a cocktail consisting of (0.1 mg/g) xylazine and (0.01 mg/g) ketamine.\nReturn the mouse to the induction chamber with 2-3% isoflurane maintained.\nShave the fur at the surgical site.\nConfirm the absence of reflex response to a toe pinch before orotracheal intubation. Intubate the mouse orotracheally using a 20 G intravenous catheter and connect it to a ventilator with 50% oxygen and 2% isoflurane. Use a stand with a clamp applied to the tongue, holding the animal in a vertical position with the neck extended, to facilitate this procedure.\nActivate a heating pad and position the mouse in a right lateral position on top of the pad, with the head away from the surgeon and the tail facing the surgeon (Figure 2). Secure the limbs with tape. Put veterinary ointment on the eyes to prevent dryness while under anesthesia.\nScrub the surgical area with 7.5% polyvidone iodine, sterilize with 70% isopropyl alcohol, and re-scrub with 10% polyvidone iodine.\nLoad the donor trachea into a 16 G intravenous catheter during this time (Figure 3C,D).\nUse scissors to make an incision in the recipient's skin and cauterize the muscle and connective tissue.\nOpen the fifth or sixth intercostal space and hold the rib cage open using two retractors.\nDissect the inferior pulmonary ligament using cotton swabs and scissors.\nSimulate the creation of the pathway for the donor trachea (Figure 3G,H).\nSecure the ventilator outflow tube by partially occluding it with a three-way stopcock to facilitate inflation of the left lung.",
    "Create a pathway by puncturing the left lung with a 20 G needle. Ensuring that the puncture depth is roughly equivalent to the length of the tracheal allograft. Select the puncture site at the lung's edge (as indicated in Figure 3I), ensuring the pathway runs parallel to the tabletop (as marked by a blue circle in Figure 3J).\n\tNOTE: An upward insertion angle will result in penetration of the pleural layer, while a deeper angle may lead to bleeding from major vessels (as marked by red crosses in Figure 3J).\nInsert the 16 G intravenous catheter into the left lung and extrude the donor trachea into the left lung. After insertion of the tracheal allograft, release the three-way stopcock to allow unobstructed expiratory flow through the outflow tube.\nClose the pleural injection site with a clip (Figure 3K,L). Position the clip precisely onto the puncture site, with its edge aligned to match the contour of the lung's edge (indicated by the blue circle in Figure 3L).\n\tNOTE: An incorrect location for the clipping site can result in ineffective sealing and air leakage, while insufficient clip depth may lead to the clip detaching post-surgery (as shown by the red crosses in Figure 3L).\nFill the thoracic cavity with saline solution and absorb the saline with a gauze.\nReinflate the left lung and close the ribs using a running suture technique.\nClose the muscle and skin with interrupted sutures.\nAdminister meloxicam analgesic subcutaneously at a dose of 5 mg/kg at the end of the surgery.\nObserve the recipient mouse until it is awake. Then, remove the tracheal tube and put the recipient mouse in a cage.\n\tNOTE: Recipient mice should be housed individually.",
    "Administer meloxicam (5 mg/kg) once daily via subcutaneous injection, starting 24 h after the surgery and continue for 3 days postoperatively.\n3. Collection of samples from recipient mice\nInduce anesthesia in an induction chamber using 5% isoflurane.\nConfirm the absence of reflex response to the toe pinch before orotracheal intubation. The intubation method and respirator setting are the same as in recipient surgery.\nPosition the mouse in a supine position and secure the limbs.\nPrep the surgical area by sterilizing it with 70% isopropyl alcohol.\nMake a midline incision on the skin, starting from the mid-abdomen and extending to the anterior cervical region.\nExsanguinate the mouse via the inferior vena cava using a 1 ml syringe connected to a 25 G needle, resulting in euthanasia.\nOpen the chest and access the trachea in the same way as a donor mouse. Tie the trachea around the intubating tube with 7-0 silk.\nRemove the thymus, fat, and muscles to expose the heart.\nCut the left atrium, right atrium, and inferior vena cava. Perfuse the lungs with 3 mL of sterile saline via the right ventricle.\nFor histologic analysis, inflate the lungs with 10% formalin via an intubating tube.\nExtubate the ventilation tube and tie off the trachea with 7-0 silk.\nDivide the larynx and esophagus. Pull them in an inferior direction, and then extract the heart and lung block, placing it into 10% formalin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}