{
  "id": 17627,
  "origin_website": "Jove",
  "title": "A Proinflammatory, Degenerative Organ Culture Model to Simulate Early-Stage Intervertebral Disc Disease.",
  "procedures": [
    "Experiments were performed using bovine tails obtained from local abattoirs. The biological materials used in the current study are taken from the food chain and require no ethical approval in Swiss and European law.\n1. Dissection of the bovine intervertebral disc\nRinse the whole tail thoroughly with tap water to remove dirt and hair on the surface.\n\tNOTE: With intact, distal ends, a maximum of 9 IVDs (coccygeal 1-9) per tail can be used for the experiments depending on the desired size of the IVDs. Considering the desired diameter between 15-20 mm, we used 12 bovine tails with 5 IVDs per tail for the experiments.\nImmerse the whole tail in a box containing 1% betadine solution for 10 min. Briefly dry the tail with sterile gauze and place it on a sterile drape.\n\tNOTE: During dissection of the disc, humidify the tails with Ringer's solution wetted gauze to prevent dehydration. Store the tails (or left-over segments) wrapped in wet gauze until the whole dissection procedure is completed.\nUse a scalpel (No. 20) to remove the soft tissue as completely as possible from the caudal spine to facilitate the identification of the IVDs. Remove the spinous and transverse processes of the vertebrae with bone removal pliers.\n\tNOTE: Select IVDs with the desired diameter. IVDs with a diameter range of 15-20 mm were used in the current study.\nCut transversely with bone pliers through the middle of each vertebral body to obtain individual motion segments. Put motion segments in a Petri dish with gauze wetted with Ringer's solution.",
    "Locate the IVD and vertebra by palpation and by moving the motion segments gently. Make two parallel cuts with the band saw in the growth plate of the IVDs, one on each side of the IVD. Identify the location of the growth plate by touching and finding the convex site of the bony endplate part (hard) adjacent to the disc (soft) with a safety distance of approximately 0.5-1 mm from the IVD towards the vertebra. Ensure that the blade of the band saw is cooled with Ringer's solution while cutting the vertebrae.\nTransfer IVDs in a clean Petri dish with clean gauze wetted with Ringer's solution.\n\tNOTE: The gauze should be moistened and not too wet to prevent swelling of the IVDs,\nUse the scalpel blade to scrape off the vertebral body (red/pink bone), growth plate (white cartilage), leave the endplate intact (yellow-pink). Make the two surfaces flat and parallel for the loading procedure. Transfer scraped IVDs to a fresh Petri dish with gauze wetted with Ringer's solution.\n\tNOTE: Wear a chainmail glove to protect the hand while holding the IVD and scraping.\nMeasure the disc height and diameter with a caliper. Clean the blood clots in the vertebrae bone with Ringer's solution using a jet lavage system.\nTransfer the IVDs to 50 mL plastic tubes, one IVD per tube. Add 25 mL of Phosphate-Buffered Saline (PBS) + 10% Penicillin/Streptomycin (P/S) per IVD and leave it shaking for 15 min on an orbital shaker at room temperature.\nAspirate the supernatant and add 10 mL of PBS + 1% P/S per IVD for 2 min to rinse the IVDs.\n2. IVD culture and loading",
    "Transfer discs to IVD chambers and add IVD culture medium (Dulbecco's Modified Eagle Medium (DMEM, 4.5 g/L high glucose DMEM for the physiological group and 2 g/L low glucose DMEM for the pathological group) + 1% P/S + 2% fetal calf serum + 1% ITS (contains 5 µg/mL insulin, 6 µg/mL transferrin, and 5 ng/mL selenious acid) + 50 µg/mL ascorbate-2-phosphate + 1% non-essential amino acid + 50 µg/mL antimicrobial agent for primary cells) and place in an incubator at 37 °C, 85% humidity and 5% CO2.\nCulture the discs for 4 days within a bioreactor system according to experimental groups16. In the pathologic group, maintain degenerative loading conditions at 0.32-0.5 MPa, 5 Hz for 2 h/day. In the physiological control group, use a loading protocol of 0.02-0.2 MPa, 0.2 Hz for 2 h/day.\n\tNOTE: Position the IVDs in chambers containing 5 mL of IVD medium during the loading procedures. The volume depends on the size of the bioreactor's loading chambers. Between the loading procedures, place the IVDs in six-well plates with 7 mL of IVD culture medium for free-swelling recovery.\nFor analyzing the changes in disc height during the experimental period, measure the disc height with a caliper after IVD dissection (baseline) and then daily after the free swelling period and after dynamic loading for the experimental duration.\n3. Intradiscal tumor necrosis factor-alpha (TNF-α) injection\nDirectly after the first dynamic loading cycle on day 1, place the IVDs in a Petri dish in a vertical position and stabilize the IVDs with a tweezer.\nInject recombinant TNF-α (100 ng in 70 µL of PBS per IVD) with a 30-gauge insulin needle into the nucleus pulposus tissue of the pathological group17. Inject slowly at a speed of approximately 70 µL in 1 min.",
    "After injection, pull the syringe halfway back within the IVD and pull the syringe plunger to create a vacuum that prevents the injected solution from leaking back, before removing the needle and syringe completely from the IVD.\n\t​NOTE: Perform a pilot experiment by injecting PBS containing trypan blue dye to evaluate the distribution of the injected solution after loading and overnight culture.\n4. Gene expression\nHarvest the IVDs on day 4. Collect the nucleus pulposus (NP) tissue (gelly part in the middle of IVD) with a biopsy punch. Collect the outer annulus fibrosus (AF) with a scalpel blade (No.20).\n\tNOTE: For the baseline reference at day 0, collect tissues immediately after dissection for RNA extraction.\nUse the amount of NP or AF tissue needed for gene expression analysis, depending on the experimental design.\n\tNOTE: For the present experiments, approximately 150 mg tissue was used. The ratio of RNA isolation solution to tissue mass should be at least 2 mL per 100-150 mg tissue for efficient extraction.\nDigest the NP or AF tissue with the digestion solution (0.2% pronase in DMEM, filter sterilized) and incubate for 1 h at 37 °C with magnetic stirring18.\nFlash-freeze the tissue samples using liquid nitrogen and pulverize to a fine powder. Divide the pulverized tissue powder equally into two 2 mL tubes each containing 1 mL of guanidine thiocyanate and phenol in a monophase solution (RNA isolation solution).",
    "Perform the homogenization in 2 mL tubes containing the RNA isolation solution and the pulverized tissue powder. Homogenize the tissue powder 5x with an 8 mm stainless steel ball and a tissue-lyzer at 30 Hz for 3 min. Centrifuge at 12,000 x g, 4 °C for 10 min and transfer the supernatant to a fresh tube. The supernatants can be stored at -80 °C for at least one month.\nAdd 0.1 mL of 1-bromo-3-chloropropane (BCP) per 1 mL of RNA isolation solution and shake vigorously for 15 s. Store the resulting mixture at room temperature on an orbital shaker for 15 min and centrifuge at 12,000 x g for 15 min at 4 °C.\n\tNOTE: The RNA remains exclusively in the upper aqueous phase.\nTransfer the aqueous phase into a fresh tube and precipitate RNA with 0.25 mL of isopropanol and 0.25 mL of high salt precipitation solution per 1 mL of RNA isolation solution used for initial homogenization. Store the samples at room temperature for 15 min on an orbital shaker and centrifuge at 12,000 x g for 8 min at 4 °C.\n\t​NOTE: Alternatively, use the column-based RNA extraction method which generally leads to higher RNA purity but lower RNA yield.\nRemove the supernatant and wash the RNA pellet with 1 mL of 75% ethanol per 1 mL of RNA isolation solution used for initial homogenization. Centrifuge at 7,500 x g for 5 min at 4 °C.\nRemove the ethanol wash and briefly air-dry RNA pellet for 3-5 min. Dissolve the RNA in 20 µL of diethylpyrocarbonate (DEPC) treated water by passing the solution a few times through a pipette tip and incubating for 10-15 min at 55-60 °C.",
    "Measure the absorbance at 230 nm, 260 nm, and 280 nm (A230, A260 and A280 respectively). A260 of 1.0 corresponds to 40 µg/mL RNA. An A260/A280 ratio of 1.6-1.9 is expected, whereas contamination results in a A260/A280 ratio of <1.6.\nPrepare a reverse transcriptase (RT) reaction mix for a 20 µL reaction volume. The mix contains RT enzyme mix, ribonuclease inhibitor, helper protein, primers, dNTPs, MgCl2, RNase free water, and 0.4 μg of RNA sample.\nBriefly centrifuge the RT tubes to mix all the components at the bottom of the tube.\nPlace the samples in the thermocycler instrument. Select the appropriate program for the RT. Run the RT for 10 min at 25 °C, followed by the reverse transcription step for 120 min at 42 °C and inactivation of the reverse transcriptase for 5 min at 85 °C, cooling it down to 4 °C at the end.\nDilute the resulting cDNA with Tris(hydroxymethyl)aminomethane (Tris)-ethylenediaminetetraacetic acid (EDTA) (TE) buffer (10 mM Tris with 1 mM EDTA) to a final concentration of 0.4 µg RNA used for RT per 100 µL cDNA solution. Store the cDNA samples at -20 °C.\nPerform real-time polymerase chain reaction (PCR) using a 10 µL reaction volume. The reaction volume contains the master mix (containing DNA polymerase, uracil-DNA glycosylase, dNTPs with dUTP, passive reference and optimized buffer components), forward primer 45 µM, reverse primer 45 µM, probe 12.5 µM (containing a reporter dye linked to the 5' end of the probe, a minor groove binder at the 3' end of the probe, and a nonfluorescent quencher at the 3' end of the probe), 2 µL cDNA and DEPC-treated water.\nRun an endogenous control (RPLP0) for relative quantification with the 2-ΔΔCT method19.",
    "Add samples in duplicates and run a no template control by adding TE-buffer instead of cDNA. Run PCR at standard conditions (2 min at 50 °C, 10 min at 95 °C, 40 cycles of 15 s at 95 °C, and 1 min at 60 °C).\nPerform relative quantification of mRNA targets following the comparative CT method. The amount of mRNA normalized to the baseline sample is calculated as 2-ΔΔCT, whereas ΔΔCT is the difference between the ΔCT (CT target- CT endogenous control) of sample and ΔCT (CT target and CT endogenous control) of the baseline sample.\n5. Quantification of protein content in the IVD medium\nCollect the medium conditioned by the IVD samples to measure the protein content in the medium. Perform enzyme-linked immunosorbent assay (ELISA) according to the protocol of the target protein.\nBovine interleukine-8 (IL-8) is quantified by anti-bovine IL8 ELISA kit according to the manufacturer's instruction.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}