{
  "id": 2480,
  "origin_website": "Cell",
  "title": "Functional Multiple-Spine Calcium Imaging from Brain Slices",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nReagent and Pipette Preparation on the Day of the Experiment\nTiming: 30–60 min\nPrepare artificial cerebrospinal fluid (aCSF).\nRefer to Materials and Equipment[href=https://www.wicell.org#materials-and-equipment] for buffer recipe.\nPrepare patch-clamp pipettes.\nPrepare standard pipettes (4–6 MΩ) for somatic recordings. There is no need to prepare pipettes with designated shapes for spine imaging. Refer to Materials and Equipment[href=https://www.wicell.org#materials-and-equipment] for more information.\nDissolve a 20 μl aliquot of 1 mM stock solution of Fluo-4 (or Fluo-5F) pentapotassium salt with intracellular solution to a final concentration of 200 μM\nCritical: Keep the solution on ice throughout the experiment.\nSomatic Recording and Dye Loading\nTiming: 30–60 min\nCut the membrane around a slice using a surgical microknife and transfer the slice to a recording chamber that is perfused with aCSF warmed to 32–34°C.\nCritical: Perfuse the slice with 200 μM Trolox, which is an antioxidant, in aCSF to reduce phototoxicity and photobleaching.\nCritical: The speed of aCSF perfusion should be kept at 2–4 mL/min.\nCritical: For good recordings, use slices within 4 h after transferring them to the chamber.\nPlace a platinum anchor on the slice membrane to keep the slice from being dislodged by the perfusion solution.\nCritical: Trim the membrane to leave enough room for the platinum anchor.\nStabilize the slice in the recording chamber for 15 min to reduce the movement of the slice during recording.\nSearch and focus on a healthy neuron with a 60× objective lens. If necessary, use a differential interference contrast or gradient contrast video microscope to facilitate patch-clamping.",
    "To load the dendrites with a calcium indicator, perform whole-cell recording from the soma with the intracellular solution containing 200 μM Fluo-4 (or Fluo-5F, cf. Expected Outcomes[href=https://www.wicell.org#expected-outcomes] and Limitations[href=https://www.wicell.org#limitations]). Use a glass pipette with a resistance of 4–6 MΩ to obtain an access resistance of –20 MΩ. Carefully approach the selected soma with a positive pressure of 50–100 kN/m2. Once the pipette tip has been positioned, release the pipette pressure and apply gentle suction (∼20 kN/m2). The patch configuration can be assessed by applying repetitive 10-mV test pulses using a patch-clamp amplifier.\nCritical: Access resistance should be kept below 20 MΩ to attain good voltage-clamp performance in the following steps.\nAfter constructing the whole-cell configuration, wait until the dendrites are sufficiently labeled with the calcium indicator. For pyramidal cells in the neocortex or hippocampus, this step takes ∼10 min.\nCritical: This period is a tradeoff. A longer time achieves a greater intensity of fluorescence at the dendritic branches (Figure 2[href=https://www.wicell.org#fig2]) but makes cells more sensitive to phototoxicity.\nCritical: This period depends on the quality of the whole-cell configuration. Higher access resistance requires a longer time to load the dendrites with the dye.\nCritical: To avoid phototoxicity and photobleaching, do not expose the cell to light.\nAdjust the parameters of image acquisition for optimal results. We find that the following settings work best: frame rates, 100–333 Hz; and spinning-disk rotation speeds, 5,000–10,000 rotations per minute (rpm) (Figures 3[href=https://www.wicell.org#fig3] and 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig3.jpg\nFigure 3. fMsCI Data\n(A) A confocal snapshot of dendritic trees of a Fluo-4-loaded CA3 pyramidal neuron in a cultured hippocampal slice.\n(B) Representative raw traces of the calcium activity of five spines recorded at a frame rate of 333 Hz. The spine numbers correspond to those in panel A.",
    "(C) A representative raster plot of spine activity. The activity of 428 spines was simultaneously recorded for 1 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig4.jpg\nFigure 4. Effects of Video Frame Rates on SN Ratios of Spine Calcium Activity\n(A) Representative raw traces of calcium activity in a Fluo-4-loaded spine recorded at frame rates of 333, 200, 100, 50, and 10 Hz.\n(B) Means ± SDs of SN ratios of 20 spines at five different frame rates. P = 0.15, F4,95 = 1.78, one-way ANOVA.\nCritical: The rest of the procedure should be performed as rapidly as possible to avoid phototoxicity and photobleaching. If the total duration of laser exposure exceeds 10 min, undesirable side effects may occur in the cells. Damage may be observed, such as the beading of dendritic varicosities and an extremely high dendritic fluorescence regardless of holding potential.\nCalcium Imaging of Dendritic Spines\nTiming: 10–15 min\nSwitch to the voltage-clamp mode for current recording, and set the holding voltage at −30 mV (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig5.jpg\nFigure 5. Effects of Clamped Voltages on Recorded Spine Calcium Activity Rates\nThe membrane potential of a CA3 pyramidal cell was clamped at −70 mV, −50 mV, and −30 mV. More spine calcium activity was detected at higher voltages, suggesting that spine activity is mediated by voltage-sensitive calcium influxes.\nFind an appropriate region of the dendritic field of the patched neuron and place the region in the center of the field of view. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nCritical: To minimize the space-clamp effect, only spines located within 200 μm of the soma should be imaged.\nCritical: Try to minimize laser power to prevent photodamage.\nAdjust the laser intensities for optimal results. We find that less than 1 mW is suitable for this protocol.",
    "Critical: Low laser power is recommended to prevent photodamage; first, start with lower power, and then adjust to obtain a sufficient SN ratio.\nStart image acquisition for a time period for the purpose of the experiment. Troubleshooting 2[href=https://www.wicell.org#sec6.3], 3[href=https://www.wicell.org#sec6.5], and 4[href=https://www.wicell.org#sec6.7].\nCritical: In some cases, the images may contain wave-like periodic noise (i.e., interference fringes due to differential interaction between the rotation speed of the Nipkow disk and the camera scanning rate (Takahashi et al., 2011[href=https://www.wicell.org#bib20])). To reduce the interference, adjust the rotational speed of the disk or the video rate.\nCritical: If necessary, record EPSCs or IPSCs simultaneously with spine activity (Figure 6[href=https://www.wicell.org#fig6]). We use a transistor–transistor logic (TTL) trigger with a stimulator to synchronize imaging and electrophysiology recording.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig6.jpg\nFigure 6. Recording Somatic EPSCs or IPSCs (Clamping at −30 mV Respectively) Simultaneously with Spine Calcium Activity\n(A) A representative raw trace of somatic EPSCs and a raster plot of spine activity.\n(B) The same as (A) but for IPSCs.\nAcquire a z-stack of images of the dendritic branches for post hoc three-dimensional reconstruction of the recorded spines (frame rate: 1 frame/s).\nCritical: The framerate is important for a clear z-stack image; it should be less than 10 frames/s.\nPause Point: The following data analysis steps can be performed at a later date.\nAnalysis of Spine Calcium Signals\nTiming: hours to days\nDetermine the regions of interest (ROIs) that encompass the recorded spines. We manually draw ROIs based on the coordinate of the center of a given spine and the radius of the spine (Figure 7[href=https://www.wicell.org#fig7]). Individual ROIs covered 1.38 ± 0.67 μm2 (ROIs on 7,750 spines from 32 cells). Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig7.jpg\nFigure 7. Representative ROIs on Dendritic Spines",
    "Manually drawn ROIs are determined by the coordinate of the center of a given spine and the radius of the spine (right).\nCritical: ROIs should match the spine contours; otherwise, the fluorescent signal may be contaminated by that of neighboring spines. We routinely analyze data using the freely available Fiji/ImageJ software and the MATLAB.\nAverage the fluorescence intensities of all pixels within each ROI for each frame and generate a time series of the mean fluorescence for individual spines.\nApply the modified Okada filter to the time series of the mean fluorescence (generated in step 17) according to the formula in the box of Figure 8[href=https://www.wicell.org#fig8]A, which reduces shot noise under low SN ratio conditions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig8.jpg\nFigure 8. Modified Okada Filter\n(A) Schematic illustration of data processing with a modified Okada filter (left). The fluorescence intensity, xt, at the focused time, t, is compared with the preceding and following values, xt–1, and xt+1, respectively. If xt is the median among xt–1, xt, and xt+1, that is, if (xt − xt–1)(xt − xt+1) ≤0, then xt is not changed (top). If xt is not the median, that is, if (xt − xt–1)(xt − xt+1) >0, then xt is replaced with (xt–1 + Zxt + xt+1)/(2 + Z) (bottom). The coefficient Z is defined as (xt+1 – M)/SD, where the mean M and the standard deviation SD are calculated from the entire time series {xt}.\n(B) The substituted value (xt–1 + Zxt + xt+1)/(2 + Z) is plotted as a function of Z. When Z is 0, xt is substituted with the mean of xt–1 and xt+1, i.e., (xt–1 + xt+1)/2. When Z takes higher values, (xt–1 + Zxt + xt+1)/(2 + Z) becomes closer to xt.",
    "(C) The original trace (black) was processed by the modified Okada filter (red). The gray dashed line and area indicate the M and SD values of the original trace.\nCritical: If noise remains, reapply the modified Okada filter (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/199-Fig9.jpg\nFigure 9. Effect of Repetitive Noise Reductions Using the Modified Okada Filter on the SN Ratios of Spine Calcium Activity\n(A) A raw original trace of calcium activity recorded from a Fluo-4-loaded spine at a video frame rate of 2,000 Hz (top) was repeatedly filtered using the modified Okada filter.\n(B–D) The SN ratios of 100 original traces (B) are compared before (C) and after (D) the application of the modified Okada filter. The SN ratio was improved by the first two applications of the filter. P was determined using the Wilcoxon signed-rank test for 100 spines from ten cells.\nExtract signals from calcium fluctuations.\nCritical: The timing of spine activity is manually or automatically determined based on the onsets of calcium transients (Sasaki et al., 2008[href=https://www.wicell.org#bib17])."
  ],
  "subjectAreas": [
    "Microscopy",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}