{
  "id": 3186,
  "origin_website": "Cell",
  "title": "Large-scale single-cell cloning of genome-edited cultured human cells by On-chip SPiS",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell transfection\nTiming: 2 days\nThis section describes cell seeding and transfection. In this example, the described amounts of reagents are for single-cell dispensing in four 96-well plates. We also use pCAG-EGFP plasmid as a positive control for transfection (use your preferred reporter expression plasmid; we recommend one that strongly drives EGFP by the CAG promoter). Untreated cells are used as a negative control for transfection as well as genome editing. HEK293T cells in 1 well of a 12-well plate are typically dispensed into two 96-well plates. Below, we describe an example transfection procedure including positive and negative controls to perform single-cell dispensing into four 96-well plates (see below Table).\ntable:files/protocols_protocol_2759_8.csv\nCell seeding.\nCover a single well of a 12-well plate with 500 μL of Matrigel solution.\nNote: We coat culture plates with Matrigel to improve the cell attachment.\nIncubate the 12-well plate at 37°C for at least 1 h to coat the plate.\nDetach HEK293T cells with 0.25% Trypsin-EDTA, and then count the cell number.\nRemove Matrigel solution from the 12-well plate, seed HEK293T cells at 2×105 cells/well, and then incubate in a 37°C 5% CO2 incubator overnight (12–24 h).\nTransfection of px458-HypaCas9 plasmid with donor DNA.\nAdjust the DNA concentration of px458-HypaCas9 in water to 1,000 ng/μL.\nAdjust the donor DNA concentration to 100 ng/μL.\nPrepare Mixture 1 and Mixture 2 by pipetting as shown in (see below Tables).\nAdd 40 μL/well of Mixture 1 40 μL/well of Mixture 2, mix well, and then incubate at room temperature for 20 min.\ntable:files/protocols_protocol_2759_9.csv\ntable:files/protocols_protocol_2759_10.csv\nDrip 80 μL/well of the incubated solution onto HEK293T cells in a 12-well plate.\nObserve the fluorescence of the transfected wells the next day.",
    "Critical: Transfection is an important factor in deciding the success or failure of single-cell dispensing. If cells are damaged during transfection, cloning efficiency will go down.\nNote: This transfection protocol works for HEK293T and HeLa cells. We recommend using Lipofectamine 3000 for transfection of PC9 cells.1[href=https://www.wicell.org#bib1]\nAlternatives: Other common lipofection reagents can be used for transfection. Lentiviral gene delivery can also potentially be used.\nCoating a 96-well plate with Matrigel.\nAdd 30 μL/well of Matrigel solution to a 96-well plate.\nIncubate the plate in a 37°C 5% CO2 incubator overnight (3–24 h).\nNote: We recommend preparing Matrigel-coated 96-well plates the day before dispensing single cells.\nAlternatives: Coating with substances other than Matrigel is also viable (e.g., iMatrix-511).\nCell soring with on-chip sort\nTiming: 30 min (for steps 4 and 5)\nThis section describes a fast and minimum-damage cell sorting using On-chip Sort (On-chip Biotechnologies Co., Ltd., Tokyo, Japan), a cell sorter based on microfluidic chip technology.13[href=https://www.wicell.org#bib13] This process collects EGFP-positive cells, allowing only cells expressing HypaCas9 to proceed to the single-cell dispensing step.\nNote: We recommend optimization of the sorting conditions before actually proceeding to single-cell dispensing. In this protocol, only cells with a strong fluorescence intensity are collected to make sure that these cells express Cas9.\nCollecting cells.\nRemove the growth medium and wash the cells once with 1 mL PBS.\nDetach the HEK293T cells from a 12-well plate with 200 μL/well of 0.25% Trypsin-EDTA for 3 min at 37°C.\nAdd 800 μL/well of growth medium and resuspend the cells by gentle pipetting.\nCollect the cell suspension in a 1.5-mL tube and centrifuge at 280 × g for 3 min at room temperature.\nRemove the supernatant by a pipette and add 350 μL of fresh growth medium to resuspend the cell pellet.",
    "Optional: In step 4e, genome editing efficiency can be estimated from EGFP-positive cells enriched with sorting by collecting 50 μL of cell suspension.\nCell sorting.\nCell sorter setup.\nTurn on the sorter and a connected computer (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2759-Fig2.jpg\nFigure 2. On-chip Sort system with microfluidic chips and sorting plots\n(A) Main unit of the On-chip Sort system.\n(B) On-chip Sort system operation screen.\n(C) Sealed holes chip for microfluidic adjustment and chip holder.\n(D) Microfluidic chip for On-chip Sort.\n(E) Sorting plot of HEK293T cells transfected with the px458-HypaCas9 plasmid. The left and right panels show the sorting gate for FSC vs. SSC and the histogram for FL2-V (EGFP), respectively.\nSelect the “OnChipFlow/Sort” icon to start the sorting control software program (Figure 2[href=https://www.wicell.org#fig2]B).\nAfter logging in, create a sample sheet.\nSet the accuracy adjustment chip (sealed hole) shown in Figure 2[href=https://www.wicell.org#fig2]C in the chip holder and insert it into the main sorter unit.\nPerform “Auto Check line” with an adjustment chip to carry out fine tuning to maintain sorting accuracy.\nWhen a dialog box appears, select “OK”.\nCell sorting.\nSet the new chip in the chip holder, add the following amount of sheath liquid (On-chip T-Buffer) to each reservoir (Figure 2[href=https://www.wicell.org#fig2]D), and insert it into the main sorter unit:\nSheath Reservoir: 8.0 mL.\nSorting Reservoir: 1.7 mL.\nCollection Reservoir: 500 μL.\nSample Reservoir: 500 μL.\nSelect \"Prime\" in the “Operation controls” panel to clean the microfluidic lines.\nRemove the sheath liquid from the sample reservoir as well as most of the sheath liquid from the collection reservoir, leaving about 50 μL of it.\nTransfer 150 μL of cell suspension prepared from step 4e to a new 1.5-mL tube and add 50 μL of T-Buffer.",
    "Transfer the full volume of the cell suspension prepared in the previous step (step 5b - (4) to the sample reservoir.\nSet the chip holder containing the cell suspension into the main sorter unit.\nSelect \"Run\" in the “Operation controls” panel to start pre-sorting.\nSort for about 10–30 s, and then select “Stop”.\nCheck the plots displayed in \"Work space\" and identify the cell population you intend to recover by gating it.\nNote: Our typical gate settings for sorting EGFP-positive HEK293T cells are shown in Figure 2[href=https://www.wicell.org#fig2]E. You can analyze non-treated cells to confirm proper gate settings. The upper limit of the optimal sorting rate is 30 events/sec; if the number of events is too high, the sample should be diluted with T-Buffer to achieve 30 events/sec.\nAfter setting up the gates, select \"Sorting\" from the \"Operation Control\" panel.\nAfter collecting 2,000 cells, transfer them to a new 1.5-mL tube, and then add T-Buffer up to 300 μL.\nNote: The cell density of the suspension (2,000 cells/300 μL T-Buffer) collected in step 5b - xi has been optimized for the next \"automatic dilution\" step with the SPiS.\nSingle-cell dispensing with on-chip SPiS\nTiming: 2–3 h (for steps 6 to 10)",
    "This section describes fast and efficient single-cell dispensing using the SPiS. The SPiS is an automated single-cell dispenser that can gently and accurately dispense single cells into multi-well plates using image recognition technology to monitor the number of cells in aliquots (Figure 3[href=https://www.wicell.org#fig3]A). In this protocol, single-cell dispensing with the SPiS is performed after sorting cells with On-chip Sort as described above. However, cell suspension prepared by other pretreatments (e.g., sorting by BD FACSAria III) can also be used. With FACSAria III, for example, suspension of sorted cells should be prepared to be as 2,000 cells in 300 μL T-buffer in a 1.5-mL tube. The cell suspension can be used directly in step 7a below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2759-Fig3.jpg\nFigure 3. Results of an image analysis for single-cell dispensing by the SPiS and the operation screen of the system\n(A) The left panel shows the main unit of the SPiS. The right panel shows the image recognition of cell suspension by the SPiS. The two images of the aspirated cell suspension are taken at 1-s intervals; if the SPiS recognizes a single cell, the cell is dispensed; if not, the SPiS aspirates the cell suspension again, and the process is repeated.\n(B) The On-chip SPiS operation screen.\n(C) Sample holder in the SPiS. Note that only position 6 is equipped with 5-mL tubes.\nThe SPiS setup.\nTurn on the SPiS unit and a connected computer (Figure 3[href=https://www.wicell.org#fig3]A).\nLaunch the software program to control the SPiS (Figure 3[href=https://www.wicell.org#fig3]B).\nInput the information of the plate into which cells are dispensed (Figure 3[href=https://www.wicell.org#fig3]B).\nSelect \"ORG\" in the operation screen panel and set the pipetting system at the initial position in the SPiS.\nPerform “Automatic dilution” with the SPiS.\nSet the following tubes in the sample holder (Figure 3[href=https://www.wicell.org#fig3]C):",
    "Position 1: 1.5-mL tube containing cell suspension from step 5b - xi.\nPosition 3: 1.5-mL tube containing 300 μL of PBS (for Waste)\nPosition 5: 1.5 mL empty tube (for dilution)\nPosition 6: 5 mL flat bottom tube containing 5 mL of PBS.\nSelect \"Automatic dilution” in the “Menu Item”.\nEnter the settings below and select Start.\nNumber of Times: 10.\nNumber of Cells: 1.\nHistogram Class: 100.\nCheck the histogram and select \"Proceed\". The diluted cell suspension is prepared in an empty tube at position 5.\nWhen the operation is complete, remove the tube in positions 1.\nTransfer the tube in position 5 to position 1.\nPre-dispensing with the SPiS.\nRemove the Matrigel from the 96-well plate (step 3b) and put it in the plate holder of the SPiS.\nSelect “Pre Dispensing” in the “operation panel” and dispense 30 μL of PBS into the 96-well plate.\nNote: The SPiS dispenses single cells into solution, so PBS must be pre-dispensed into a 96-well plate. step 8b can be skipped by manually pre-dispensing PBS into a 96-well plate.\nSingle-cell dispensing with the SPiS.\nFrom the menu screen, select \"START\" to start dispensing.\nNote: The dispensing operation takes about 1 h for a 96-well plate.\nAfter finishing dispensing into the first plate, set a second 96-well plate and start the dispensing operation in the same manner from step 8b.\nStart preparing the third and fourth 96-well plates while the single-cell dispensing into the second 96-well plate is ongoing. Return to step 4 and repeat cell sorting and single-cell dispensing.",
    "Note: Two 96-well plates per tube of cell suspension are the maximum number viable for efficient single-cell dispensing. Dispensing more than two plates may cause cells to drop down and/or attach to the bottom of the sample tube, which slows down the dispensing speed.\nAddition of conditioned medium and cell culture.\nAfter single-cell dispensing, add 100 μL/well of conditioned medium pre-warmed to 37°C using a multichannel pipette.\nThe culture medium should be replaced with growth medium every week.\nTwo weeks after cell dispension, remove the medium in 96-well plates and wash once with 100 μL/well of PBS, detach the survived cells in the 96-well plate with 10 μL/well of 0.25% Trypsin-EDTA.\nNote: The purpose of step 10c is to disperse the cells in a well to give them enough space for growth.\nAdd 100 μL of growth medium 2 and resuspend cells in the same plate.\nNote: Trypsin is neutralized by FBS so that the cells can be cultured after step 10d without any further treatments.\nKeep culturing the cells until they become confluent.",
    "Note: The established clones can be transferred into 12- or 6-well plates for expanded culture. Genomic DNA can be extracted from a portion of the detached cells when the clones are transferred to expanded culture. Genomic DNA extraction can be performed by ethanol precipitation after overnight (12–72 h) incubation at 55°C in cell lysis buffer (10 mM Tris pH7.5, 10 mM EDTA, 10 mM NaCl, 0.5% N-Lauroylsarcosine, 0.1 mg/mL Proteinase K),7[href=https://www.wicell.org#bib7] or the rapid extraction method with Alkaline lysis solution (HoTSHOT method).20[href=https://www.wicell.org#bib20] The genome editing results of clones can be analyze by common polymerase chain reaction (PCR) and/or Sanger sequencing. We perform multiplexed amplicon sequencing to genotype many clones (over a hundred clones).1[href=https://www.wicell.org#bib1],21[href=https://www.wicell.org#bib21] Note that most of the cultured cell lines do not have a stable chromosome number and carry more than two copies of genes."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Cell Isolation",
    "Crispr",
    "Cell Biology",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}