{
  "id": 8676,
  "origin_website": "Jove",
  "title": "A High-content Assay for Monitoring AMPA Receptor Trafficking",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) at Georgia State University.\n1. Preparation of Primary Hippocampal Neurons (in Laminar Flow Hood)\nIsolate primary hippocampal neurons from mixed sex postnatal day (P) 0-1 mice as previously described36.\nPlate neurons in 96-well poly-D-lysine coated microplates at a density of 2 x 104 cells per well.\nPrepare media for feeding the neurons by adding 10 mL of 50x B-27, 5 mL of 100x Glutamine, 242 µL of 10 mg/mL 5-Fluoro-2′-deoxyuridine (FUDR) and 10 µL of 10 mg/mL Gentamycin to 485 mL of neuronal media (see Table of Materials).\nFeed neurons as previously described36 by removing half (100 µL) of the pre-existing media (referred to as conditioned media, which contains constituents that support neuronal survival) from each well and replacing with 100 µL of 37 °C prewarmed media prepared in step 1.3 every 3-4 days. Store the conditioned media from each feeding at 4˚C for step 2.3.\n2. Measuring AMPA Receptor Trafficking in Response to DHPG (in Laminar Flow Hood)\nAt Day In Vitro (DIV) 14, prepare a 500 µL stock solution of Tetrodotoxin (TTX) at a concentration of 2 mM using cell culture grade water.\nCAUTION: TTX is a neurotoxin. Handle carefully and avoid contact with skin.\nUsing a multi-channel pipette, remove 100 µL from each well of the 96-well microplate of neurons and pool the media.\nAdd 2 µL of the TTX stock solution to 1 mL of the pooled conditioned media from step 2.2 to create a 4 µM solution of TTX. If there is not enough pooled conditioned media, then use some of the stored conditioned media from Step 1.4.",
    "Treat neurons with 100 µL/well of the 4 µM solution of TTX from step 2.3. Place the microplate in a 5% CO2 incubator at 37 °C for 4 h.\nAttach a sterile glass Pasteur pipette to a suction line and attach a sterile 200 µL pipette end to the tip of the pipette. Remove the media from each well carefully. Avoid touching the bottom of the microplate where the neurons are located.\nAdd 200 µL of room temperature neuronal media to each well.\nIncubate the microplate at room temperature for 15 min. Incubation in 5% CO2 is preferred but not necessary.\n3. Immunolabelling (in Laminar Flow Hood)\nPrepare a 1:150 dilution of the anti-GluA1 or anti-GluA2 antibody in neuronal media.\nRemove the neuronal media added in Step 2.6. Add 50 µL of the anti-GluA1 or anti-GluA2 antibody solutions to corresponding wells for 20 min at room temperature to allow antibody binding. Add 50 µL of neuronal media to the secondary antibody only control wells.\nRemove the antibody solutions added in step 3.2. Wash the microplate 3 times with 100 µL/well room temperature neuronal media to remove any unbound antibodies.\nMake a 50 mM stock solution of DHPG in neuronal media or cell culture grade water. Vortex the solution briefly to fully dissolve the DHPG. Prepare this solution fresh on the same day of the experiment. Avoid using old or thawed solutions.\nDilute the stock solution in neuronal media to 1:500 to make a 100 µM solution.\nRemove the existing media from each well. Add 100 µL/well of the 100 µM DHPG stock solution from Step 3.5. Incubate the microplate in the incubator at 37 °C in 5% CO2 for 10 min.",
    "Remove the DHPG solution added in step 3.6 and add 100 µL/well neuronal media. Repeat this step one more time. Place the microplate in the incubator at 37 °C in 5% CO2 for 5 min.\nAdd the sucrose to make the 4% paraformaldehyde/4% sucrose solution in PBS on the same day of the experiment. Avoid using old or thawed solutions. Remove the media added in step 3.7. Add 100 µL/well of 4% paraformaldehyde/4% sucrose solution. Repeat steps 3.6 – 3.8 for each additional time-point. Once complete, incubate the microplate at 4 °C for 20 min.\nCAUTION: Handle paraformaldehyde stocks in a fume hood.\nRemove fixative from step 3.8 and add 100 µL/well of cold 1x DPBS.\nRemove DPBS . Add 150 µL/well blocking buffer (a ready-to-use formulation in TBS, refer to Table of Materials) and incubate at room temperature for 90 min. Alternatively, incubate overnight at 4 °C.\n4. Labelling Surface Receptors\nPrepare a 1:1500 dilution of 680RD Goat anti-Mouse IgG secondary antibody in blocking buffer.\nRemove blocking buffer from step 3.10. Add 50 µL/well of the secondary antibody solution and incubate at room temperature for 60 min. Keep the microplate protected from light once the secondary antibodies are added. Make sure to continue to protect the microplate from light during subsequent incubations.\nRemove the solution from step 4.2. Add 100 µL/well TBS (50 mM Tris-HCl, 150 mM NaCl, pH 7.6) and incubate at room temperature for 5 min. Repeat this step 4 additional times.\nRemove TBS from step 4.3. Add 100 µL/well of 4% paraformaldehyde/4% sucrose in PBS and incubate at room temperature for 15 min.\nRemove solution from step 4.4. Add 100 µL/well TBS and incubate at room temperature for 5 min. Repeat this step 2 additional times.\n5. Labelling the Internalized Receptor Population",
    "Prepare TBS containing 0.2% saponin. Vortex the solution briefly to fully dissolve the saponin powder. Filter the solution using a 0.2 µm filter to remove any particles that could cause auto-fluorescence.\nAdd 150 µL TBS containing 0.2% saponin and incubate at room temperature for 15 min.\nRemove saponin solution from step 5.2 and add 150 µL/well blocking buffer. Incubate at room temperature for 90 min.\nPrepare a 1:1500 dilution of 800CW Donkey anti-Mouse IgG secondary antibody in blocking buffer.\nRemove blocking buffer from step 5.3 and add 50 µL/well of the secondary antibody solution. Incubate at room temperature for 60 min.\nAdd 100 µL/well TBS and incubate at room temperature for 5 min. Repeat this step 4 additional times.\n6. Imaging and Analysis\nImage the 96-well microplate using an infrared laser imaging system according to manufacturer’s instructions. Set the scan resolution to 84 µm, the scan quality to medium and the focus offset according to the base height of the 96-well microplate used. Click on the \"Image Studio\" menu button → Export → Image for Digital Media → Export images at a resolution of 300 dpi, in TIFF format.\nDownload Image J \"Fiji\" at https://imagej.net/Fiji/Downloads\nOpen image in Image J \"Fiji\". Split color channels by clicking on the \"Image\" menu\n\tColor → Split Channels.\nOpen the ROI manager from \"Analyze\" → \"Tools\". Check the box \"labels\" in the ROI manager to label the circles with numbers.\nIn the red channel (the 680 nm surface receptor pool), select the Region of Interest (ROI) by selecting the circle tool and drawing a circle that accurately fits the first well. Press Ctrl+T. \nDrag the circle to the next well and press Ctrl+T. Repeat until all wells are circled.",
    "From the ROI manager, click \"Measure\". Select the values that appear and copy them to a spreadsheet.\nClick on the green channel (the 800 nm internal receptor pool) and then transpose the selected ROIs from step 6.6 to the image. From the ROI manager, click “Measure”. Select the values that appear and copy them to a spreadsheet.\nCalculate the average integrated density values from the secondary only control wells. Subtract the integrated density values for each experimental well from the average secondary only control integrated density values for the surface receptor pool. Repeat this step for the internal receptor pool.\nCalculate changes in surface receptor expression using Rs/Rt, where Rs represents the integrated density of surface receptors and Rt represents the integrated density of surface receptors + integrated density of internal receptors."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}