{
  "id": 8705,
  "origin_website": "Jove",
  "title": "In Vitro Assay for Studying the Aggregation of Tau Protein and Drug Screening",
  "procedures": [
    "1. Reagent Preparation\nReaction buffer\nPrepare reaction buffer: 0.5 mM TCEP in PBS, pH 6.7 by dissolving TCEP dry powder (MW= 286.65 g/mol) in PBSstock solution, pH 7.4.\n\t\tNOTE: The presence of TCEP is due to bridging aggregation studies using wild type tau protein which contains cysteines. In the current protocol, TCEP is only used to adjust the pH of PBS from 7.4 to 6.7 and plays no role in regulating any redox reactions.\nMix thoroughly and filter the solution through a sterile 0.22 μm pore size PES membrane filter.\nAliquot and store at -80 ˚C.\nThaw on the bench and stabilize at RT before use.\nhuTau441\nRemove huTau441 (for protein expression and purification see Apetri et al.24) from -80 ˚C freezer.\nThaw on the bench and equilibrate to room temperature (RT).\nSpin tube with protein stock for 5 min at 12,000 x g at 20-25 ˚C to eliminate air bubbles.\nMeasure the concentration of huTau441by absorption at 280 nm using an extinction coefficient of 0.31 mL mg-1cm-1\nThioflavin T\nPrepare 500 μM thioflavin T (ThT) stock solution by dissolving 10 mg of ThT dry powder (MW=318.86 g/mol) in 35 mL reaction buffer.\nMix thoroughly, vortex 3 times for 20 seconds at maximum speed and filter the solution through a sterile 0.22 μm pore size PES membrane filter.\nDetermine concentration by absorption measurements at 411 nm using an extinction coefficient of 22,000 M-1 cm-1 and adjust ThT concentration to 500 μM. Store at RT protected from light. Prepare fresh every 2 months.\nHeparin\nPrepare fresh 55 μM heparin solution by dissolving 1 mg of HMW heparin dry powder (MW = 17-19 kDa) in 1 mL reaction buffer at RT.\nShake vigorously and vortex 2 times for 5 seconds.",
    "Filter solution through a sterile 0.20 μm pore size PES membrane filter (syringe).\n2. Continuous Mode ThT Aggregation Assay on a Multi-Mode Microplate Reader\nNOTE: ThT dye is added to the reaction to monitor huTau441 aggregation kinetics in a continuous mode (automatic measurements). Although the reaction can be followed by a regular fluorometer using a conventional cuvette, the manual nature of the operation limits the frequency of measurements and compromises the accuracy of the recorded kinetic curves. For this reason, an automatic multi-mode microplate reader is used.\nInstrument set up\nTurn on the computer and the multi-mode microplate reader. Let the equipment stabilize for 10 minutes.\nStart the software and prepare a protocol.\n\t\t\nSelect the protocol type: standard protocol (Data reduction is performed independently for each plate).\nSet the temperature at 37 ˚C and select preheatment before continuing the protocol.\nSet the kinetic run: Run Time 50 h / Measurement interval: 15 min.\nSet orbital shaking at 425 cpm (3 mm) in continuous mode.\nSelect the read method: Fluorescence intensity - Endpoint/Kinetic - Monochromators Wavelengths: Excitation 440 nm (20 nm bandwidth)/ Emission 485 nm (20 nm bandwidth) - Optics position: Top - Normal read speed - Read height: 4.50 mm\nStart the run using the created protocol. Name the experiment, select the destination of the newly created file and allow the instrument to pre-equilibrate to desired temperature.\nSpontaneous huTau441 conversion\nPrepare the reaction sample in a 1.5 mL tube. Use 200 μL mix per reaction and at least 4 replicates (reaction volume for 4 replicates = 800 μL).",
    "Prepare 800 μL reaction sample (in case of 4 replicates) containing 15 μM huTau441, 8 μM heparin and 50 μM ThT. Start by mixing the protein with the reaction buffer, add heparin and ThT and mix well by pipetting up and down 5 times. Respect the indicated order for reagent addition.\nSpin samples at 12,000 x g and 25 ˚C for 5 min to eliminate air bubbles.\nDispense 200 μL of reaction sample per well in 96-well microplates (96-well black solid microplate, well-volume 360 μL, flat bottom). Avoid formation of air bubbles.\nSeal microplate to avoid evaporation.\nPlace microplate in multi-mode microplate reader and start measurements.\nAfter completion of experiment, remove plate from equipment and export data to a data processing software.\nQuality check of the conversion, seed collection and storage.\nRemove the sealer from the plate and pool the different replicates in 1.5 mL tubes. Mix well the aggregated sample in the wells by pipetting up and down 2 times before collecting it. Aggregates tend to deposit on the bottom of the well.\nMix thoroughly in the 1.5 mL tube by pipetting up and down 5 times and dispense 10-20 μL on a mica surface for analyzing the aggregates by AFM(for further details see Apetri et al.24).\nHarvest the aggregates by spinning the 1.5 mL tube at 20,000 x g and 4 ˚C for 1 hour. Aggregates form a pellet.\nSeparate and analyze supernatant by S-MALS to confirm the absence of monomeric tau in the sample indicating a successful conversion into aggregates (for further details see Apetri et al.24).\nLabel the 1.5 mL tube containing the remaining aggregates (pellet)indicating initial huTau441 protein concentration and sample volume. Snap freeze the aggregates and store at -80 ˚C.\nSeeded reaction",
    "Remove huTau441 aggregates from -80 ˚C freezer. Add the volume of reaction buffer indicated on the label (initial sample volume) and let the tube stabilize to RT. Resuspend the aggregates by pipetting up and down 5 to 8 times.\nSonicate the aggregated sample. For a 200 μL sample (15 μM huTau441), sonicate on ice using a 1/8\" microtip (from 100 μL up to 10 mL) for a total period of 15 s using pulses of 1 s and pauses of 2 s at 30% amplitude (sonicator 250 Watts). Re-equilibrate sample to RT.\n\t\tNOTE: The employed sonication conditions lead to a homogeneous population of tau fibrils with lengths of 20-50 nm24.\nPrepare the reaction sample in 1.5 mL tubes. Use 200 μL mix per reaction and at least 4 replicates (reaction volume for 4 replicates = 800 μL).\nPrepare 800 μL reaction sample containing 15 μM huTau441, 8 μM heparin and 50 μM ThT. Start by mixing the protein with the reaction buffer, add heparin and ThT and mix well by pipetting up and down 5 times. Respect the indicated order for reagent addition.\nSpin samples at 12,000 x g and 25 ˚C for 5 min to eliminate air bubbles.\nDispense 200 μL of reaction sample per well in 96-well (96-well black solid microplate, well-volume 360 μL, flat bottom). Avoid formation of air bubbles.\nHomogenize thoroughly the preformed fibril sample by repetitive up and down pipetting (5 times) and add to each well the amount corresponding to the desired percentage of seeds. For a 200 μL well total volume, 2 μL of preformed seed addition is a 1% (v/v). Mix by pipetting up and down 3 times when adding to the well and avoid formation of air bubbles.\nSeal microplate to avoid evaporation.",
    "Place microplate in multi-mode microplate reader and start measurements.\nRemove plate from equipment and export data to a spreadsheet."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}