{
  "id": 10753,
  "origin_website": "Jove",
  "title": "Extraction of Plant-based Capsules for Microencapsulation Applications",
  "procedures": [
    "1. Extraction of Sporopollenin Exine Capsules (SECs) from L. clavatum Spores\nNote: The SEC extraction process involves a flammable powder (L. clavatum), hot corrosive acids, and flammable solvents, hence proper personal protective equipment (goggles, face mask, gloves, lab coat), approved risk assessment on usage, and disposal of chemicals by authorized laboratory personnel is essential.\nSpore Defatting\nPrepare a reflux set-up in a fume hood by using a glass condenser, water circulation system, and water bath (Figure 1).\nWeigh 100 g L. clavatum spores without creating dust and away from any ignition source.\n\t\tNote: The spores used here were commercially obtained (See Materials List).\nTransfer spores slowly to a 1 L polytetrafluoroethylene (PTFE) round bottom flask with a magnetic stirring rod.\nAdd 500 ml acetone to the spores in the PTFE flask and shake the flask gently to form a homogeneous suspension.\nPlace the PTFE flask in the water bath set at 50 °C and connect to the reflux condenser.\nPerform refluxing in acetone for 6 hr with stirring at 200 rpm and then allow to cool at RT.\nFilter the suspension using filter paper under vacuum and collect the defatted spores in large (15 cm diameter) glass petri dishes.\nDry the spores at room temperature (fume hood) by covering with aluminum foil with holes for solvent evaporation.\nAcidolysis\nPrepare 85% (v/v) phosphoric acid with deionized (DI) water and transfer defatted dry spores to a 1 L PTFE flask.\nAdd 500 ml of phosphoric acid (85% v/v) to the defatted spores.\nPlace the PTFE flask in a water bath set at 70 °C and connect to the reflux condenser.\nPerform gentle refluxing (70 °C) in phosphoric acid for 30 hr and then allow to cool at room temperature.",
    "Dilute the suspension by using 500 ml warm DI water and collect the SECs by vacuum filtration using filter paper.\nTransfer the SECs to a 3 L glass beaker to perform a series of washings.\nSEC Washing\nPlace the 3 L glass beaker containing SECs in a fume hood.\nAdd 800 ml hot (50 °C) DI water to the SECs with gentle stirring for 10 min.\nFilter the suspension by using filter paper and a vacuum filtration set-up.\nCollect the SECs in a clean 3 L glass beaker.\nRepeat steps 1.3.1. to 1.3.4. five times.\nAdd 600 ml hot (45 °C) acetone to the SECs with gentle stirring for 10 min.\nCollect the SECs by filtration under vacuum and transfer the SECs to a clean 3 L glass beaker.\nRepeat steps 1.3.6. and 1.3.7. using 600 ml hot (50 °C) 2 M hydrochloric acid.\nRepeat steps 1.3.6. and 1.3.7. using 600 ml hot (50 °C) 2 M sodium hydroxide.\nRepeat steps 1.3.1 and 1.3.4 eight times.\nRepeat steps 1.3.6. and 1.3.7. using 600 ml hot (45 °C) acetone.\nRepeat steps 1.3.6. and 1.3.7. using 600 ml hot (45 °C) ethanol.\nRepeat steps 1.3.6. and 1.3.7. using 800 ml hot (50 °C) DI water.\nTransfer the clean SECs to six large glass petri dishes and dry in a fume hood at RT for 24 hr to remove all water content.\nDry the SECs in a vacuum oven at 60 °C and 1 mbar vacuum for 10 hr or until constant weight.\nCollect the dried SECs and transfer to a polypropylene bottle.\nStore the SECs in a dry cabinet.\n2. Characterization of SECs\nPerform scanning electron microscopic analysis41 using spores and SECs produced at different stages.",
    "Perform elemental analysis41 using spores and SECs produced at different stages. Dry all samples at 60 °C for at least 1 hr before elemental analysis and calculate the protein content using percent nitrogen with a multiplication factor of 6.25.11 Obtain results using triplicate measurements for each sample.\nConduct micromeritic properties analysis using a dynamic image particle analyzer.41 \nScan unprocessed, processed, and FITC-BSA-loaded SECs using confocal laser scanning microscopy.41 \n3. Biomacromolecule Encapsulation by Vacuum Loading Technique\nPrepare 1.2 ml of 125 mg/ml bovine serum albumin (BSA) solution using DI water and transfer to a 50 ml polypropylene tube.\nWeigh 150 mg of SECs and transfer to the BSA solution.\nVortex the tube for 10 min to form a homogeneous solution.\nCover the tube using filter paper.\nTransfer the tube to a freeze dryer flask and dry for 4 hr with vacuum at 1 mbar.\nPerform steps 3.1 to 3.5. for three independent batches.\nCollect the BSA-loaded SECs and remove the agglomerates by using a mortar and pestle.\nTransfer the BSA-loaded SECs to a 50 ml tube and add 2 ml DI water to remove the residual BSA.\nCollect the SECs by centrifugation at 4,704 x g for 5 min and discard the supernatant.\nRepeat the washing with DI water once.\nCover the tube containing BSA-loaded SECs using filter paper.\nTransfer the SECs to a freezer (-20 °C) and freeze for 1 hr.\nFreeze dry the SECs for 24 hr and store in a freezer until further characterization.\nPrepare the placebo SECs without BSA using the same procedure as in steps 3.1. to 3.13.\nPrepare the FITC-BSA loaded SECs using the same procedure as in steps 3.1. to 3.13.\n4. Determination of Encapsulation Efficiency\nWeigh 5 mg of BSA-loaded SECs in 2 ml polypropylene tubes.",
    "Add 1.4 ml phosphate buffered saline pH 7.4 (PBS) and vortex for 5 min.\nProbe sonicate the suspension at 40% amplitude for 3 cycles of 10 sec.\nFilter the solution using a 0.45 µm Polyethersulfone (PES) filter.\nPerform the same procedure as in steps 4.1. to 4.4. using placebo SECs.\nMeasure the absorbance at 280 nm using placebo as a blank.\nQuantify the amount of BSA encapsulated using a BSA standard curve (200 to 1,000 µg/ml) in PBS.42\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}