{
  "id": 17830,
  "origin_website": "Jove",
  "title": "A Pre-clinical Rat Model for the Study of Ischemia-reperfusion Injury in Reconstructive Microsurgery",
  "procedures": [
    "All procedures were conducted in accordance with the ethical committee of the Jesús Usón Minimally Invasive Surgery Centre and the welfare guidelines of the regional government that are based on European legislation.\n1. Presurgical and Surgical Preparation\nHouse Wistar rats weighing 290–350 g in cages at 22–25 °C with free access to food and water. Acclimate for 1 week prior to the surgery to prevent stress-induced problems.\nPlace a rat in an anesthetic induction chamber, deliver 5 min of oxygen (0.5-1 L/min), and use a vaporizer to deliver 5% sevoflurane to induce anesthesia.\nTake the rat out of the chamber once anesthesia is induced. Place the inhalation facemask on the rat and provide a flow rate of 2% sevoflurane to maintain anesthesia. Check for the lack of response to a toe pinch.\nUse an eye protection ointment to prevent corneal drying and damage.\nMonitor the animal under general anesthesia as follows: Place a rectal thermometer (35.9–37.5 °C), check the mucous membrane color, and position a rodent pulse oximeter to check for the O2 saturation (>95%) and heart rate (250–450 bpm).\nUse a heat support (electric heating pads or circulating water blankets) to avoid hypothermia and improve post-procedural anesthesia recovery.\nInject 5 mL of warm subcutaneous physiological saline solution to maintain proper hydration.\nProvide analgesic and anti-inflammatory drugs (meloxicam 1 mg/kg/day) and prophylactic antibiotics (enrofloxacin 7.5 mg/kg/day) subcutaneously before the procedure and for 5 days postoperatively.\nShave the animal’s abdominal and inguinal areas.\nApply topical povidone-iodine, followed by 70% ethanol. Cover the animal with a sterile drape.\n2. Free Skin Flap Model Surgery",
    "Using a surgical marker, draw a 3 cm x 6 cm flap matching one of the 6 cm sides with the abdomen midline. Next, make a 6 cm skin incision at the midline of the abdomen and two perpendicular 3 cm incisions at the upper and lower part of the 6 cm midline incision.\nTo start dissecting the designed 3 cm x 6 cm skin flap, use scissors and Adson forceps to raise the flap (rather than a scalpel) due to the skin’s mobility.\nGently pull the flap from the cranial area towards the caudal area to help with the dissection and identify the epigastric pedicle surrounded by the abundant loose connective tissue.\nDissect the flap pedicle without touching it or by grasping the adventitia as little as possible to avoid damaging the vessel wall.\nUse 8/0 nylon sutures to occlude by ligatures the proximal caudal femoral vessels, lateral circumflex femoral vessels, and saphenous vessels. Thereby, the perfusion of the flap is provided by the femoral artery and continues directly through the superficial caudal epigastric artery, while the venous drainage is performed by the superficial caudal epigastric vein toward the femoral vein.\nClamp the vascular pedicle and then cut it to start the 8 h ischemia period. During the procedure use electric blankets to maintain temperature. Two 5 ml injections of warm (25°C) 0.9% saline solution are administered subcutaneously. The first administration is performed 2 h after the beginning of the procedure; and the second at the end of the procedure to obtain a proper recovery of the animal.\nUse heparinized saline solution (100 U/mL) to perfuse the flap and remove the stagnant blood from the microcirculation.\nUse 10/0 nylon sutures to perform the microsurgical anastomoses.",
    "After 8 h of ischemia, reperfuse the flap by removing the microvascular clamps and check the vascular patency as described below.\n3. Intraoperative Assessment\nPerform a manual patency test (empty and refill test) for the vein and artery. To do this, use two microsurgical forceps, position them distal to the anastomosis and perform the milking. Release the closest forceps to the anastomosis site first. If the blood flow continues after a vascular section is emptied, then the anastomosis is patent.\nAssess the blood flow using a transit-time ultrasound flowmeter and microsurgical probes.\nMeasure the diameter of the pedicle vessels in order to choose the proper size for the flow probes.\nNOTE: A 0.7 mm flow probe can measure vessels ranging from 0.4 mm to 0.7 mm; a 1.0 mm flow probe can measure vessels ranging from 0.7 mm to 1.0 mm; a 1.5 mm flow probe can measure vessels ranging from 1.0 mm to 1.5 mm.\nPlace the target vessel in the ultrasonic sensing window (between the reflector and the transducers) of the flow probe to quantify flow volume.\nNOTE: Hold the probe neutral to the plane of the vessel, to avoid any tension or pulling.\nCheck the quality of the acoustic coupling by observing that all the bars are green on the display.\nNOTE: If difficult to get good acoustic coupling, use ultrasonic gel or physiological saline solution topically.\nWhen good coupling is achieved and the vessel is placed in the acoustic window without any tension, click on the Record button on the display to store the data.\nNOTE: To obtain a reliable and correct measurement, make sure that the waveform pattern is constantly repeatable.",
    "Once done, use Polyglycolic Acid (PGA) 4-0 absorbable braided sutures (16mm 3/8 triangular needle)  to close the skin. Use a simple interrupted pattern to maintain strength and tissue position if part of the suture is bitten off by the rat postoperatively.\nAssess the flap’s microcirculation using laser speckle contrast analysis (LASCA).\nMake a new recording for each animal and for each follow-up of the study. For this, click File/New Recording. A new window opens, and the Setup Panel is displayed. Then edit the information of the project name, subject, operator and recording name.\nFor maximum reproducibility, standardize the following parameters: working distance, measurement area, point density, frame rate, and ambient light conditions.\n\t\t\nAdjust the Working Distance by moving the laser in relation to the tissue. Zoom in or out the laser head towards the tissue of interest. To check for the measured value, click Image Setup. Here, set at 12.0 cm.\nStandardize the Measurement Area by entering the desired Width and Height at the Image Setup. The designed flap measures 3 cm x 6 cm. For this measurement, select a width of 4.0 cm and a height of 7.0 cm to have some extra space.\nSet the Point Density as high in the Image Setup. High, medium, and low are the three options.\nAt the Image Capture Setup, select the Frame Rate (10 images/s) for the recording and the Duration (1 min) of the recording.\nNOTE: Have the same ambient light condition in the surgery room while operating or performing the assessments.\nClick the Record button to start recording. The Setup Panel is replaced by the Recording Panel. Data is saved automatically. Take snapshots during the procedure to enable further comparison.",
    "NOTE: The perfusion scale can be changed to improve visualization (Click Tools | Filters and Color Scales | Perfusion Scale | Manual 0 - 150), but the measured perfusion values will be unaffected. Before and after the recording, different regions of interest (ROIs) can be created to measure the perfusion within them. Here, we evaluated just the area of the practiced flap (3 cm x 6 cm).\nUse ImageJ software to measure the survival and necrosis areas.\nLocate a ruler at the side of the flap and then take control pictures for macroscopic measurements of the flap survival area.\nTo evaluate pictures, open the ImageJ user interface. Click File and Open the image to be measured.\nSelect Straight Line at the toolbox and draw a straight line over 1 cm of the ruler. Click on Analyze | Set Scale and introduce in the text box for known distance the value of 1 cm.\nClick on the Polygon Selection Tool and draw the polygon lines over the flap to calculate the viable area. Ultimately, click on Analyze | Measure to obtain the area value.\nPlace a postoperative dressing on the animal before housing to prevent self-mutilation of the surgical area. After the procedures, animals are housed in cages individually, in a room with temperature control (22°C to 25°C).\n4. Postoperative Assessment and Tissue Sampling\nAnesthetize the rat at 7 postoperative days for the flap assessment and tissue sampling by following the same steps previously described in this protocol (steps 1.2 and 1.3). Check for the depth of anesthesia by the lack of response to the toe pinch.",
    "Photograph the surgical area to enable macroscopic measurements of the flap survival and necrosis areas. Make the postoperative macroscopic measurements following the same steps of the intraoperative assessment that have been explained before in the protocol (step 3.5).\nNOTE: Pay attention while using the Polygon Selection Tool by drawing the lines on the flap delimiting the viable area (measured in cm2). The percentage of the viable area can be calculated as (cm2 of viable area/cm2 of total flap area) × 100.\nAssess the flap’s microcirculation using the LASCA technique (step 3.4) to visualize and quantify perfusion differences\nAfter the macroscopic analysis, remove the 4/0 sutures and rise the flap to reassess the vascular pedicle blood flow by using the transit-time ultrasound.\nPerform tissue sampling by longitudinally dividing the flap into two parts of 1.5 cm x 6 cm.\nImmerse one part in a biopsy container with 4% paraformaldehyde at room temperature for further histological analyses.\nIntroduce the other part of the tissue in a cryopreservation tube, immerse it in liquid nitrogen and then, cryopreserve the tube by storing it at -80 °C for future molecular analyses.\nEuthanize the rat under general inhalation anesthesia using a rapid intracardiac injection of 2 M KCl/kg according to the ethical committee recommendations."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}