{
  "id": 3379,
  "origin_website": "Cell",
  "title": "Protocol to study projection-specific circuits in the basal ganglia of adult mice using viral vector tracing, optogenetics, and patch-clamp technique",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIntracranial injection of viral vectors\nTiming: Surgery procedure takes about\n      1.5–2 h per mouse; histological assay takes 3–5 days\n    \nTiming: 20–45 min (for step 1)\n    \nTiming: 5–10 min (for step 2)\n    \nTiming: 15–20 min (for step 3)\n    \nTiming: 10–15 min/injection (for step 4)\n    \nTiming: 3–5 days (for step 5)\n    \n      This section includes the procedure of virus injection and the\n      verification of virus expression.\n    \n        Anesthetize a mouse.\n        \n            Intraperitoneally inject sodium pentobarbital (40 mg/kg) into a\n            mouse.\n            \nNote: Check its response to\n              noxious stimuli (e.g., tail pinch) to make sure that the mouse is\n              under deep anesthesia. Otherwise, inject 10 mg/kg more sodium\n              pentobarbital until the mouse does not respond to noxious stimuli.\n              This step usually takes 20–45 min depending on how sensitive the\n              mice are to the anesthetics, and deep anesthesia is able to be\n              maintained for at least 2.5 h.\n            \nAlternatives: Constant\n              inhalation of isoflurane or sevoflurane can be used for the\n              induction (5–10 min) and maintenance of general anesthesia in\n              mice. The mice may recover within 5–10 min after termination of\n              anesthetics.\n            \n            Remove the fur from the top of the skull with a shaver and clean the\n            hair wastes with a piece of adhesive tape.\n          \n        Mount the anesthetized mouse to the stereotaxic frame.\n        \nTurn on the heating pad.\n            Open the jaw of the mouse, place its incisors into the hole of the\n            incisor bar of the stereotaxic frame, and stabilize the snout of the\n            mouse with the nose clamp.\n          \n            Adjust the position of the incisor bar so that the ear bars reach\n            the external auditory meatus of the mouse.\n          \n            Support the mouse head from beneath to place it in the middle of the\n            head holder assembly.\n            \n                Lock one ear bar to the position that it touches one ear of the\n                mouse.",
    "Slide the other ear bar to the other ear.\n                Lock the ear bar until the two ear bars hold the head tightly.\n              \n            Pull out the tongue of the mouse out of the mouth from one side to\n            prevent suffocation.\n          \n            Use eye ointment to prevent dehydration of the cornea.\n            \nNote: The incisor bar and one of\n              ear bars of the stereotaxic frame should be vertically adjustable.\n            \n        Perform surgery (Figure 2[href=https://www.wicell.org#fig2])\n        troubleshooting 1[href=https://www.wicell.org#sec6.1].\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2961-Fig2.jpg\n              Figure 2. Determine the coordinates of the subthalamic nucleus,\n              globus pallidus interna, and substantia nigra pars reticulata\n            \n              (A) The location of the subthalamic nucleus (STN), globus pallidus\n              interna (GPi), and substantia nigra pars reticulata (SNr) in\n              different angle and planes.\n            \n              (B and C) The STN, GPi, and SNr in coronal and parasagittal\n              planes.\n            \n              (D) Mount the mouse onto the stereotaxic frame. Cut open the skin\n              and expose the skull.\n            \n              (E) Move the tip of the drill bit to the bregma and zero the\n              coordinates on the digital readouts of the manipulator. Mark the\n              holes to be drilled according to the AP and ML coordinates of the\n              STN, GPi, and SNr. Insert the injection needle into the STN.\n            \n              Image credit for (A–C): Allen Adult Mouse Brain Reference Atlas.\n            \n            Disinfect the scalp with cotton swabs soaked with 75% ethanol at\n            least 3 time.\n          \nMake an incision along the midline with a scalpel.\n            Extend the incision and detach the skin from the skull with a pair\n            of surgical scissors.\n          \n            Expose the skull by moving the skin to either side with two\n            hemostats.\n          \n            Scrape off the connective tissue on the surface of the skull with a\n            scalpel and wipe it off with cotton swabs.\n            \nNote: Wipe the skull with a cotton\n              swab soaked with 3% hydrogen peroxide if the bregma and lambda are\n              not clearly discernable. Use cotton swabs soaked with normal",
    "saline to clean up hydrogen peroxide.\n            \n            Adjust the incisor bar vertically to position the bregma and lambda\n            at the same vertical level.\n          \nAdjust the ear bars to level the two hemispheres.\n            Determine the coordinates by referring to the mouse brain atlas\n            (STN: AP, −1.78 mm; ML, 1.50 mm; DV, 4.80 mm) (SNr: AP, −3.10 mm;\n            ML, 1.50 mm; DV, 4.60 mm) or (GPi: AP, −1.30 mm; ML, 1.75 mm; DV,\n            4.70 mm) (Figures 2[href=https://www.wicell.org#fig2]A–2C).7[href=https://www.wicell.org#bib7]\n            Drill holes according to AP and ML coordinates.\n            \nPosition the tip of the drill bit to touch the bregma.\n                Zero the readout of the manipulator with the dental drill\n                attached.\n              \nMove it to the target AP and ML coordinates on the skull.\n                Drill through the skull (Figures 2[href=https://www.wicell.org#fig2]D and 2E).\n              \n            Puncture the dura mater with a needle to prevent the glass pipette\n            used for microinjection or the injection needle from breaking or\n            bending.\n            \nNote: Mice older than 4 months are\n              preferred because the mouse skull and brain stop growing\n              thereafter and have less variability among individuals.\n            \n        Perform virus microinjection troubleshooting 2[href=https://www.wicell.org#sec6.3].\n        \nConnect the syringe to the syringe pump.\n            Place a piece of parafilm (2 × 2 cm2) disinfected with\n            75% ethanol on the skull of the mouse, and add 1 μL viral vector on\n            it.\n          \n            Immerse the tip of the injection needle into the droplet of the\n            viral vector, aspirate the vector into the syringe with the\n            microinjection pump.\n            \nCritical: After loading the\n              viral vector, inject 50 nL viral vector to check whether there is\n              a dead volume in the syringe.\n            \n            Position the tip of the injection needle to touch the bregma and\n            zero the digital readout of the manipulator.\n          \n            Locate the tip of the needle to the target AP and ML coordinates and\n            lower it gradually to the DV coordinate.",
    "Start virus injection at a speed between 50–80 nL/min, then retain\n            the needle in the brain for 6–8 min after the injection.\n          \n            Gradually lift the injection needle up by 0.3 mm within 5 s and wait\n            for at least 30 s.\n          \n            Repeat this procedure until the needle is lifted up out of the brain\n            tissue.\n          \n            Wipe off the brain tissue on the tip of the needle immediately with\n            a cotton swab soaked with normal saline.\n            \nNote: This is important to prevent\n              the needle from being blocked by dried brain tissue. Additionally,\n              an injection of 50 nL viral vector after wiping clean the needle\n              may be required to confirm that the needle is not clogged during\n              viral injection.\n            \n            Close the skin with sutures (4–0) and apply a thin layer of\n            superglue to cover the wound.\n          \n            Place the mouse in a clean cage on a heating pad and return it to\n            the housing area in the animal facility after the mouse wakes up.\n          \n            Subcutaneously administer meloxicam (4 mg/kg) once per day up to\n            3 days for postoperative pain relief.\n            \nNote: Keep the skull and the brain\n              tissue moist during injection to avoid scar formation in the\n              surgery area around the injection needle, which may cause severe\n              damage to brain tissue and blood vessels when the injection needle\n              is removed.\n            \n            ‘a-c’ can be done before anesthetizing the mouse.\n          \n        Perform histological assay.\n        \n            Sacrifice the mice 3 weeks after virus injection in a CO2\n            chamber.\n          \n            Perform cardiac perfusion (see the detailed procedures in\n            ‘preparation for live brain slices’) with 10 mL ice-cold phosphate\n            buffered saline (PBS) and then 20 mL 4% paraformaldehyde (PFA) in\n            PBS.\n          \n            Remove the mouse brain and post-fix it in 4% PFA for 12 h at 4°C.\n          \n            Dehydrate the mouse brain in 30% sucrose (in PBS) (for 2 days) for\n            cryoprotection.",
    "Imbed the mouse brain in OCT and freeze it to −20°C in a\n            refrigerator.\n          \n            Cut the mouse brain into 30 μm parasagittal sections with a\n            cryostat.\n          \nMount brain sections onto glass slides.\nCoverslip the sections immersed in a mounting medium.\n            Visualize fluorescence-labeled neurons in brain sections under a\n            confocal microscope to confirm the location of the injection site\n            and labeled neurons.\n            \n                Restriction of eYFP-labeled neurons in the STN confirms the\n                correct injection site of AAV-CaMKII-ChR2-eYFP. This is\n                important to assure that the blue light-evoked postsynaptic\n                currents in SNr and GPi neurons are responses to glutamate\n                released from STN projection neurons but not being contaminated\n                by neurons outside the STN.\n              \n                Restriction of mCherry-labeled neurons in the STN indicates that\n                AAV-EF1α-DIO-ChR2-mCherry is injected into the STN in mice whose\n                STN projection neurons were retrogradely transfected with\n                Cre-recombinase by AAV retro-hSyn-Cre-eGFP injected into the SNr\n                or GPi.\n              \n                A clear dark area between labeled SNr and STN neurons is a sign\n                that injection site of AAV retro-hSyn-Cre-eGFP for retrograde\n                labeling of SNr-projecting STN neurons is correct and the\n                eGFP-labeled STN neurons are unlikely labeled by the spread\n                virus.\n              \n                The fact that GPi and STN neurons, but not SNr neurons, are\n                eGFP-labeled provides an evidence for correct injection site of\n                AAV retro-hSyn-Cre-eGFP to label GPi-projecting STN neurons\n                because if the virus spreads into the STN, it may retrogradely\n                label SNr neurons. It is vice versa for AAV\n                retro-hSyn-Cre-mCherry injection to label SNr-projecting STN\n                neurons.\n              \n                In mice that STN-SNr or STN-GPi neurons are labeled, the\n                presence of fluorescence-labeled fibers in the GPi or SNr,\n                respectively, represents the existence of STN neurons projecting\n                to both the SNr and GPi.\n              \nPatch-clamp recordings from brain slices\nTiming: 8–10 h\nTiming: 60–75 min (for step 6)\n    \n      To verify that the virus was functional and to probe and measure the",
    "synaptic strength of the STN projections, we performed patch-clamp\n      recordings on brain slices using a modified version of a protocol\n      described previously.1[href=https://www.wicell.org#bib1],3[href=https://www.wicell.org#bib3],8[href=https://www.wicell.org#bib8],9[href=https://www.wicell.org#bib9],10[href=https://www.wicell.org#bib10]\n        Prepare live brain slices.\n        \n            Place a 250 mL beaker containing 200 mL cutting solution in a −80°C\n            refrigerator for 12–15 min until ice flakes form, then go to step\n            ‘d’.\n          \n            Prepare surgical tools, including scissors, hemostats, hook,\n            forceps, disc filter, 20 mL syringe, filter paper, petri dish,\n            brush, razor blade, and spatula (Figure 3[href=https://www.wicell.org#fig3]A).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2961-Fig3.jpg\n                  Figure 3. Procedures for brain slice preparation for\n                  patch-clamp recording\n                \n(A) Surgical tools for transcardiac perfusion.\n                  (B) Put the euthanized mouse in supine on ice, open its chest,\n                  stabilize the chest bone with a hemostat, and clamp the\n                  descending iota with another hemostat. Open the right atrium\n                  and inject ice-cold cutting solution into the left ventricle.\n                \n                  (C) Remove the brain out of the skull and place it on a piece\n                  of filter paper soaked with carbogenated cutting solution.\n                \n                  (D) Trim the brain, split it into two brain blocks, and glue\n                  the brain block onto the specimen disc with the medial part\n                  facing up.\n                \n                  (E) Insert the disc in the buffer tray and fill the buffer\n                  tray with carbogenated cutting solution.\n                \n                  (F) Incubate brain slices at 32°C in cutting solution bubbled\n                  with carbogen.\n                \n                  (G) Home-made multichannel gravity-based perfusion system.\n                \n                  (H) Setup for patch-clamp recording and optogenetic\n                  stimulation.\n                \n                  (I) STN neurons under the DIC and green fluorescence\n                  illumination.\n                \n                  (J) GPi neurons in the DIC and green fluorescence\n                  illumination.\n                \n                  (K) SNr neurons in the DIC and green fluorescence\n                  illumination. Arrows in (I)-(K) point to live neurons. eYFP in\n                  right panels in (J, K) is located on puncta and fibers.\n                \n            Install razor blade onto the blade holder of the vibratome.\n            \n                Split a razor blade from the middle into two halves and use one",
    "half for brain slice preparation.\n                \nNote: Scrape the wax off the\n                  blade, wipe the surface of the blade three times with cotton\n                  swab soaked with 75% ethanol, rinse the blade with deionized\n                  water, and paste a thin layer of graphite lubricant onto both\n                  sides of the blade with a cotton swab. These procedures are\n                  helpful to reduce the friction on the surface of the blade.\n                \n                Attach it onto the knife holder of the vibratome and set the\n                clearance angle of the knife holder to 18° (refer to the users’\n                manual).\n              \nTurn on the vibratome.\n                Minimize the vertical vibration of the blade at the aid of a\n                Vibrocheck device.\n              \n                Attach the ice tray and buffer tray, and fill crushed ice in the\n                ice tray around the buffer tray.\n              \n            Fill an ice-bucket with crushed ice, place the beaker filled with\n            ice-cold cutting solution on the ice, and bubble the solution with\n            carbogen (95% O2 5% CO2) for at least 10 min.\n          \n            Fill a 250 mL beaker with 150 mL cutting solution, warm it up in a\n            water bath at 32°C, put a slice incubator in the beaker, bubble the\n            solution with carbogen (95% O2 5% CO2) for\n            more than 10 min (Figure 3[href=https://www.wicell.org#fig3]F), and go to step\n            ‘i’.\n          \n            Perform cardiac perfusion (Figure 3[href=https://www.wicell.org#fig3]B).\n            \nEuthanize a mouse in a CO2 chamber.\nOpen the chest of the mouse to expose the heart.\nStabilize the chest bone with a hemostat.\nClamp the descending iota with another hemostat.\n                Hold the heart with a hook pricked into the right ventricle.\n              \nOpen the right atrium with a pair of scissors.\n                Immediately inject 10 mL ice-cold cutting solution into the left\n                ventricle within 20 s.\n                \nNote: Transcardiac perfusion\n                  removes blood to protect the brain from oxidative damage by\n                  the ferroheme and improve the viability of neurons. Successful",
    "perfusion makes the brain and the skin of the forelimbs look\n                  pale.\n                \n            Prepare a brain block (Figures 3[href=https://www.wicell.org#fig3]C–3E).\n            \nDecapitate the mouse.\nMake an incision on the skin of the skull.\n                Cut the midline or sagittal suture of the skull from the foramen\n                magnum of the occipital bone to the olfactory bulb with a pair\n                of scissors.\n              \nOpen the skull with a pair of forceps.\nRemove the brain from the skull with a spatula.\n                Place the brain on a piece of filter paper soaked with the\n                ice-cold carbogen-saturated cutting solution.\n              \n                Trim off the temporal lobes on both sides and the brain stem\n                caudal to the pons.\n              \nSplit two hemispheres with a blade.\n                Glue the lateral side of the brain blocks down onto the specimen\n                disc with the medial parts of the brain blocks facing up.\n              \n                Insert the specimen disc into the buffer tray, fill the buffer\n                tray with ice-cold cutting solution, and bubble the solution\n                with carbogen.\n                \nNote: Cutting parasagittal\n                  brain slices helps preserve neurons in the STN, SNr, GPi, and\n                  the substantia nigra pars compacta.\n                \nCritical: The cutting\n                  solution has lower concentrations of sodium chloride and\n                  calcium, but higher concentrations of magnesium. It reduces\n                  the excitability of the brain tissue and protects neurons from\n                  excitotoxicity.\n                \n            Slice the brain tissue (Figure 3[href=https://www.wicell.org#fig3]E).\n            \n                Set parameters of the vibratome: set a cutting window to cover\n                the brain blocks, a vibration amplitude ranging between\n                1.9–2.2 mm, a blade travel speed between 0.02–0.12 mm/s, and a\n                section thickness between 250–350 μm.\n              \n                Cut the brain blocks into slices.\n                \nNote: Adjust blade travel\n                  speed to high (0.12 mm/s) and low (0.02 mm/s) levels when the\n                  edge of the blade is outside and inside the target brain\n                  regions, respectively. It helps speed up the preparation of\n                  viable brain slices.\n                \n            Incubate brain slices (Figure 3[href=https://www.wicell.org#fig3]F).",
    "Transfer the brain slices into the slice incubator filled with\n                32°C cutting solution and incubate for 60–75 min.\n              \n                Place a 250 mL beaker containing 150 mL ACSF in a water bath at\n                26°C and bubble the solution with carbogen (95% O2 5%\n                CO2) for at least 10 min.\n              \n                Transfer brain slices from 32°C cutting solution to 26°C ACSF\n                and incubate these brain slices in 26°C ACSF until perform\n                patch-clamp recording.\n                \nNote: A multi-compartment\n                  incubator with a wired bottom lifted by pillars is essential\n                  for sufficient carbogenation. In this setup, the barrier\n                  around the compartments prevents brain slices from being\n                  perturbed by strong bubbles.\n                \n        Perform patch-clamp recordings from live brain slices\n        troubleshooting 4[href=https://www.wicell.org#sec6.7].\n        \n            Adjust the parameter of the pipette puller to obtain patch\n            electrodes with a resistance of 4–6 MΩ when filled with the internal\n            solution.\n          \n            Turn on the PlexBright light source to deliver light to the brain\n            slices through an optical fiber (200 μm in diameter; NA, 0.37) for\n            optogenetic stimulation of STN neurons and their terminals in the\n            SNr and GPi and start the Radiant software ready for the TTL control\n            of the light source (Figure 3[href=https://www.wicell.org#fig3]H).\n          \n            Turn on the fluorescent light source and CCD camera equipped on the\n            upright microscope in the patch-clamp rig.\n          \n            Adjust the temperature controller to 32 ± 1°C and balance the flow\n            rate (1.5–2 mL/min) and suction rate of the gravity perfusion system\n            (Figure 3[href=https://www.wicell.org#fig3]G).\n          \n            Transfer a brain slice into the recording chamber of the patch-clamp\n            rig and stabilize the slice with a stainless steel anchor.\n            \nNote: The neuronal viability of\n              the brain slices is better on the side facing up during brain\n              slice preparation. This side should face up.\n            \n            Locate the 4× air objective (Plan Apochromat, NA 0.1, WD 30 mm)\n            above the STN under the near infra-red illumination, then switch to",
    "40× water immersion objective (ApoChromat, NIR, NA 0.80; WD 3.5 mm)\n            to check the neuronal viability of the slice under infra-red\n            illumination and to visualize virus expression under fluorescence\n            illumination (Figure 3[href=https://www.wicell.org#fig3]I).\n          \n            Select fusiform neurons with even light-gray color. Locate the tip\n            of the optical fiber 200 μm away from the recorded neurons for\n            optogenetic stimulation.\n          \n            Perform patch-clamp recordings from mice subjected to injection of\n            AAV-CaMKII-ChR2-eYFP into the STN.\n            Troubleshooting 5[href=https://www.wicell.org#sec6.9].\n            \n                Select a healthy STN neurons labeled by ChR2-eYFP (Figure 3[href=https://www.wicell.org#fig3]I) and make whole-cell patch-clamp recordings of responses\n                (inward currents and action potentials) to pulses of blue light\n                (460 nm, 1 s constant or 1 ms at 5, 10, 20, 50 Hz, 2 mW) (Figure 3[href=https://www.wicell.org#fig3]I) in the voltage-clamp and current-clamp modes.\n                \nNote: A weak positive pressure\n                  should be added to the recording pipette before the pipette\n                  enters the bath solution and approaches to the neurons to\n                  assure that the tip of the electrode is clean. This procedure\n                  facilitates gigaseal formation.\n                \n                Check ChR2-eYFP-labeled fibers in the SNr or GPi to confirm that\n                ChR2-eYFP-labeled STN neurons project to these areas and choose\n                a healthy SNr or GPi neuron among these fibers (Figures 3[href=https://www.wicell.org#fig3]J and 3K).\n              \n                Make whole-cell patch-clamp recording of inward currents evoked\n                by paired pulses (with intervals of 20, 50, and 100 ms) of blue\n                light (1 ms, 1 mW) in the voltage-clamp mode.\n                \nNote: Under this recording\n                  condition (see recipes for ACSF and internal solution),\n                  excitatory and inhibitory postsynaptic currents recorded at\n                  the holding potential of −50 mV are inward and outward\n                  currents, respectively. Paired-pulse ratio and responsiveness\n                  to a train of light pulses at various inter-pulse intervals\n                  are helpful to characterize the short-term plasticity of\n                  synapses.\n                \nCritical: If the recorded\n                  photocurrents are not blocked by the mixture of 1 μM",
    "tetrodotoxin and 0.3 mM 4-aminopyridine (4-AP), but blocked by\n                  20 μM CNQX, it may support that SNr or/and GPi neurons are\n                  innervated by STN glutamatergic neurons via a monosynaptic\n                  machinery.1[href=https://www.wicell.org#bib1] The amplitude of\n                  light-evoked currents represents the synaptic strength of the\n                  monosynaptic projection.\n                \n                Record spontaneous firing from SNr or GPi neurons in the\n                whole-cell current-clamp mode, shine 1 s blue light (1 ms at 5,\n                10, 20, and 50 Hz, 2 mW), and examine the changes in the firing\n                rate of the recorded neurons.1[href=https://www.wicell.org#bib1]\n            Perform patch-clamp recordings from mice subjected to injection of\n            AAV retro-hSyn-Cre-eGFP into the SNr or GPi and\n            AAV-EF1α-DIO-ChR2-mCherry into the STN (Figure 4[href=https://www.wicell.org#fig4]) troubleshooting 5[href=https://www.wicell.org#sec6.9].\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2961-Fig4.jpg\n                  Figure 4. Synaptic function of projections from STN-SNr-GPi\n                  neurons to the GPi and SNr\n                \n                  (A) Combining retrograde viral vector and Cre-dependent\n                  optogenetics to label STN-SNr neurons.\n                \n                  (B and C) Diagram and trace of patch-clamp recording of\n                  photo-EPSCs from GPi neurons being innervated by STN-SNr-GPi\n                  neurons.\n                \n                  (D) Combining retrograde viral vector and Cre-dependent\n                  optogenetics to label STN-GPi neurons.\n                \n                  (E and F) Diagram and trace of patch-clamp recording of\n                  photo-EPSCs from SNr neurons being innervated by STN-SNr-GPi\n                  neurons.\n                \n                  (G) Summary of the amplitude of photo-EPSCs in SNr and GPi\n                  neurons innervated by STN-SNr-GPi neurons. t = 3.48, df = 66,\n                  P = 0.0009. SNr: n = 40; GPi: n = 28. Two-tailed\n                  t-test.\n                \n                  (H) Summary of the paired-pulse ratios of photo-EPSCs in SNr\n                  and GPi neurons innervated by STN-SNr-GPi neurons. F(3, 132) = 18.76, P < 0.0001. 20 ms: t = 5.04, P < 0.0001.\n                  50 ms: t = 4.16, df = 132, P < 0.0001. SNr: n = 40; GPi:\n                  n = 28. One-way ANOVA with Holm-Sidak’s multiple comparisons\n                  test. Some of the data are derived from\n                  Figure 2[href=https://www.wicell.org#fig2]D, G-K from the published\n                  paper.1[href=https://www.wicell.org#bib1] The reuse of the data",
    "is licensed by Elsevier and Copyright Clearance Center.\n                \n                Select a healthy STN neurons labeled by ChR2-mCherry and make\n                whole-cell patch-clamp recording of inward currents and action\n                potentials evoked by pulses of blue light (1 s constant or 1 ms\n                at 5, 10, 20, 50 Hz, 2 mW) in the voltage-clamp and\n                current-clamp modes, respectively.\n              \n                Check ChR2-mCherry-labeled fibers in the SNr or GPi to confirm\n                that ChR2-mCherry-labeled STN neurons project to these areas and\n                choose a healthy SNr or GPi neuron among these fibers.\n              \n                Make whole-cell patch-clamp recordings of inward currents evoked\n                by paired pulses (with intervals of 20, 50, and 100 ms) of blue\n                light (1 ms, 1 mW) in the voltage-clamp mode.\n              \n                Record spontaneous firing from SNr or GPi neurons in the\n                whole-cell current-clamp mode, shine 1 s blue light (1 ms at 5,\n                10, 20, and 50 Hz, 2 mW), and examine the changes of the firing\n                rate.\n                \nNote: A 1 ms blue light pulse\n                  at 0.5–1 mW should be used to evoke a monosynaptic response\n                  because a longer light pulse at higher intensity may cause a\n                  saturated response and may be unsuitable to study short-term\n                  synaptic plasticity. Series resistance should be monitored\n                  during recordings."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Neuroscience",
    "Molecular/Chemical Probes",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}