{
  "id": 18294,
  "origin_website": "Jove",
  "title": "Determining Glucose Metabolism Kinetics Using 18F-FDG Micro-PET/CT",
  "procedures": [
    "All procedures described in this study were approved by the Sydney Local Health District and University of Sydney Animal Ethics Committees and followed the NIH Guide for the care and use of laboratory animals, Eighth edition (2011).\n1. Animal Preparation\nNOTE: In this protocol male db/db mice (BKS.Cg-Dock7m +/+ Leprdb/J) were maintained in group housing with ad libitum access to chow and water until 6 weeks of age. At the time of imaging, mice weighed ~ 30 g. All mice used in this protocol had fasting blood glucose levels between 10 and 14 mmol/L.\nIf required, fast the mice. In the present example, fast the mice for 5 h prior to the experimental procedure.\nTreat mice with the desired agent (e.g. drug, protein, peptide) before the commencement of imaging. In this example, administer a subcutaneous injection of insulin (3 U/kg human insulin) or equivalent volume PBS 30 min prior to the start of imaging.\n2. Set up Workflow\nNOTE: This protocol was implemented on a PET/CT scanner. Acquire PET data first, followed by acquisition of CT data.\nPET settings:\nSelect isotope as 18F, set scan duration to 3,600 s, and upper and lower level energy discrimination to 350 keV - 650 keV (default) with a coincidence timing window of 3.432 ns (default). Histogram list-mode data into 16 frames (6 × 10 s, 4 × 60 s, 1 × 300 s, 5 × 600 s) for the period 0 - 60 min after tracer injection. Reconstruct emission sinograms using 2D-FBP with a zoom 1.5.\n\t\tNOTE: The reconstructed images consisted of 16 dynamic frames, each with 128 × 128 × 159 voxels and a voxel size of 0.52 × 0.52 × 0.796 mm3.\nCT settings:",
    "For a whole body CT scan, set the current at 500 A, voltage at 50 kV, exposure time 500 ms and 200 projections over a 360 rotation. Set the detector field of view (FoV) to 30722048, number of bed positions to 3 (to cover full PET FoV range), overlap between bed positions = 30.234713% and detector binning to 4.\n\t\tNOTE: CT reconstruction was performed using cone beam tomography image reconstruction software with HU calibration, bilinear interpolation and Shepp-Logan filter.\n18 F-FDG:\nOrder sufficient 18F-FDG (for example 450 MBq in 0.5 mL) from a local provider to arrive ~ 30 min before the first injection. Aliquot and dilute the 18F-FDG so that animals receive ~ 10 MBq of 18F-FDG in a final volume of 0.1 mL.\n3. Imaging Protocol\nWipe down induction chamber and imaging bed with 80% (v/v) ethanol to maintain aseptic conditions. Place the mouse in an induction chamber and anesthetize with 5% isoflurane in oxygen.\nPlace the mouse onto an imaging bed fitted with an electric heating pad to maintain body temperature and a precision vaporizer nose cone to deliver isoflurane (maintenance, 1.5 - 2%) at a flow rate of 1 L/min. Apply ophthalmic ointment onto eyes to prevent dryness whilst under anesthesia.\nPosition the mouse in a prone position on a sensor pad to monitor breathing and ensure an adequate plane of anesthesia is maintained.\nWarm the tail using a heat pack for 1 - 2 min to dilate the lateral tail vein. Catheterize the lateral tail vein by inserting a 30-gauge needle into the lateral tail vein. Secure the needle in place with surgical glue and secure the catheter.\nLoad imaging bed into the scanner and move the bed through the machine so that the catheter can be accessed from the rear of the machine.",
    "Attach the catheter to the 18F-FDG syringe in a syringe driver. Calculate the exact 18F-FDG dose (10 MBq) based on activity in syringe before injection and the volume to be administered (< 100 μL, injected over 10 s).\nTo minimize the impact of anesthesia on variability of glucose uptake, ensure a constant time between induction of anesthesia and injection of 18F-FDG (for example, 30 min).\nCommence the PET scan immediately before injection of 18F-FDG. After finishing the PET scan (3,600 s), perform a CT scan (~ 10 min) to allow for co-registration of radiotracer uptake with tissues.\nMove the imaging bed to the starting position, remove the animal from the bed.\nAt this point euthanize the animal or allow it to recover:\n\t\nFor euthanasia, perform cervical dislocation whilst still under anesthesia and collect organs of interest for subsequent analysis.\nIf allowing the mouse to recover, place the mouse in single housing on a heating pad or in front of a heating lamp. Monitor the mouse until it has regained sufficient consciousness to maintain sternal recumbency. Allow the mouse to recover for 1 h before returning to group housing.\n4. PET Image Processing\nNOTE: Image reconstruction was performed using acquisition workplace software v1.5.0.28 and analysis in research workplace software v4.2.\nCo-register CT and PET images and ensure that the alignment is correct in all 3 dimensions.\n\t\nIn the 'File' menu, select 'Folder Search/Import' and select the folder containing the data. Select the desired PET and CT data and click on the 'General Analysis' tab.\nSort the data so that the CR is designated 'Source' and PET is designated 'Target'. In the 'Workflow' menu, select 'Registration'. If the images require adjustment to be correctly co-registered, use the tools in the 'Registration' menu.\nIn the 'Workflow' menu, select 'ROI Quantification'.",
    "Use the 'Pan' and 'Zoom' functions in the 'Image' tab to locate the desired region. In the 'Tools' menu, select the 'Create' tab and click the paintbrush icon. Draw the ROI on the image\nExtract time-activity curves by selecting 'Save ROI Quantification' from the 'Save' menu. Save the data as a CSV file.\nQuantify radioactivity uptake as Bq per cm3 of tissue. Convert values into percentage of injected dose per cm3 (% ID/ cm3) by loading the CSV file into a spreadsheet.\n5. Input Function\nTo correct for the system point spread function, deconvolve the estimated system PSF for 5 iterations using the reblurred Van Cittert deconvolution method as previously described9.\n\tNOTE: This is required due to the small size of the vena cava in a mouse.\nUse post deconvolution images to generate a blood input function time-activity curve as described above.\n6. Kinetic Modeling\nNOTE: The FDG two-tissue compartment model (Figure 1) requires the plasma input function.\nConvert the blood input function in the CSV file to the plasma input function using the following equation10: Input_plasma = Input_blood × (0.386e−0.191t + 1.165).\nIn the kinetic modelling tool click the 'Kinetic' button. Import the tissue and plasma total activity count CSV files into the kinetic modelling tool by selecting 'Load Time Activity Curve' from the 'Menu'.\nIn the 'Model' menu select 2 tissue compartments. Ensure that the box next to k4 is unselected and enter a value of 0. For initial fitting, uncheck the box for vB (blood volume fraction) and enter a value of 2%.\nClick the 'Fit current region'. Correct the extracted region of interest for dispersion11,12. Achieve this by minimizing the Chi-square value for the FDG model for different dispersion times.",
    "Perform a second fit using floating vB value (check the box next to the box for vB) and the optimized dispersion value to calculate the regional rate constants (k1-k3). Calculate the regional influx constant as Ki = (k1 × k3) / (k2 + k3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}