{
  "id": 8883,
  "origin_website": "Jove",
  "title": "A Simple Approach to Induce Experimental Autoimmune Neuritis in C57BL/6 Mice for Functional and Neuropathological Assessments",
  "procedures": [
    "All procedures described here were approved by the Florey Institute for Neuroscience and Mental Health (Melbourne Brain Centre) Animal Ethics Committee and follow the Australian Code of Practice for the Use of Animals for Scientific Purposes.\n1. EAN Induction\nNOTE: EAN can be successfully induced in male C57BL/6 mice aged between 6-8 weeks. The induction protocol takes 9 days in total. Day 0 refers to the day of the first immunization. For this protocol, injections were conducted under anesthesia (see step 1.1.2 below).\nOn Day -1:\nPrepare the Pertussis Toxin (see Table of Materials) solution of 1.6 µg/mL using the sterile 0.1 M mouse-isotonic phosphate buffered saline (MT-PBS).\nAnesthetization with isoflurane:\n\t\t\nPlace the mouse (C57BL/6, male, 6-8 weeks) in the anesthetization chamber and adjust the oxygen flow to 1 L/min.\nTurn on the isoflurane vaporizer, adjust it to 2.5% for anesthetization, and monitor breathing and wait for 2 min, or until primary reflexes (corneal and hind limb) are no longer responsive \nRemove the mouse from the anesthetization chamber and administer 250 µL of the above Pertussis Toxin solution via an intraperitoneal (i.p.) injection using a 0.5 mL syringe with a 301/2 G needle.\nPrepare the injectable inoculum for immunization:\n\t\t\nPrepare Solution A using 2 mg/mL solution of P0180-199 peptide (with > 98% purity, sequence S-S-K-R-G-R- Q-T-P-V-L-Y-A-M-L-D-H-S-R-S) in 0.9% saline.\nPrepare Solution B using 20 mg/mL solution of Mycobacterium tuberculosis (see Table of Materials) in Freund's complete adjuvant (FCA, comprising: 15% mannide monoolate + 85% of paraffin oil and 0.5 mg/mL of desiccated killed and dried M Mycobacterium butyricum).\nTo make the final inoculum for injecting, combine equal volume parts of Solutions A and B in a bead beater and mix them at a maximum speed for 1 min at room temperature.",
    "NOTE: Solutions A and B can be kept as stock and stored at 4 °C for a maximum of one month but the combined final inoculum must be freshly prepared on the day of the mouse injection.\nOn Day 0, administer 50 µL of the inoculum (preparation outlined in step 1.1.4) into a mouse via a subcutaneous injection using a 23 G needle.\n\tNOTE: The injection can be placed between the shoulder blades, or between the hind limb and tail over the caudal dorsum.\nOn Day 1, make the Pertussis Toxin solution of 1.2 µg/mL (in MT-PBS) and administer 250 µL into a mouse via i.p. injection using a 0.5 mL syringe with a 301/2 G needle.\nOn Day 3, repeat step 1.3 above.\n\tNOTE: Stock solutions A and B can be made up and stored at 4 ˚C for a maximum of one month. However, the final injectable inoculum, produced by combining stock solutions A and B, must be done on the day of the injection.\nOn Day 8, administer 50 µL of the inoculum (preparation outlined in step 1.1.4) into a mouse via a subcutaneous injection (see step 1.2 above), at the same injection site as in step 1.2 (for each animal)\n2. Clinical Scoring\nPerform clinical scoring out daily starting on Day 0.\nGive each mouse a score of 0, 1, 2, 3, or 4 according to the published criteria4. See Table 1 for EAN clinical scoring.\n\tNOTE: For consistency, an effort should be made to score mice at the same time daily by the same researcher.\n3. Motor Function Assessment",
    "NOTE: The motor performance is assessed in parallel with clinical scoring for the same cohort of animals. The motor function assessment apparatus must be connected to a computer that has a gait function imaging system (see Table of Materials) installed. It is also recommended that all mice to be assessed should be habituated to the running task prior to EAN induction. To do this, practice runs (2 test runs per mouse) are performed three days prior to disease induction (Day -3).\nTurn on the motor function assessment apparatus and switch on the light button.\nScruff the mouse firmly and ink its feet by lowering it onto a container filled with red ink while holding its tail.\n\tNOTE: This step is required for the C57BL/6 strain, but can be skipped if a mouse strain with a white coat color is being used.\nPlace the mouse into the walking compartment and set the treadmill speed at 15 cm/s.\nTurn on the treadmill and click the \"record\" button to capture the running motion of the mouse using the gait function imaging system (see Table of Materials).\nUse a timer and measure each running for 36 s. After 36 s, stop recording and stop the treadmill.\n\tNOTE: Mice that cannot successfully complete the running task for this 36 s interval are considered to have failed.\nSave the video file in the designated folder.\nRepeat the above steps for each mouse to be assessed. Test the mice with the same running task every 3 days.\nAnalyze the edited video files using software for gait function parameters (see Table of Materials).",
    "NOTE: The details of how to analyze different motor parameters vary amongst software so please refer to the manufacturer's instruction before analysis. To gain histological evidence of axonal and myelin damage via either immunohistochemistry or electron microscopy, animal tissues can be taken at the any stage post motor function assessment depending on the specific aims of research.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}