{
  "id": 16963,
  "origin_website": "Jove",
  "title": "Adult and Pediatric Porcine Model of Acute Volume Overload",
  "procedures": [
    "The study protocol was approved by the Vanderbilt University Institutional Animal Care and Use Committee (protocol M1800176-00) and strictly adhered to the National Institute of Health Guidelines for the Care and Use of Laboratory Animals. Male and Female Yorkshire pigs and piglets weighing approximately 40-45 kg and 4-10 kg are used in this experiment. The present approach does not encompass a screening for preexisting medical conditions in the ordered swine. Acknowledging that this practice could potentially influence or obscure the desired results, it is essential to note that, as per the vendor's information, the likelihood of such interference is low. The limitation is acknowledged and accepted as an inherent aspect of the procedure.\n1. Anesthesia and ventilation\nAdult porcine model\n\t\nUse an 18-20G intravenous (IV) catheter, place it in the central or marginal ear vein on the posterior side of the auricle and secure with 1-inch adhesive tape, to inject ketamine (2.2 mg/kg)/xylazine (2.2 mg/kg)/telazol (4.4 mg/kg) to anesthetize the pig.\nPlace the pig onto the operating room table, in the supine position. Ask an independent animal laboratory technician, responsible for overseeing specific parameters, to assess anesthesia depth determined by factors including vital signs, responsiveness to stimuli, presence or absence of movement, jaw tone laxity, fluctuations in heart rate, changes in end-tidal CO2 levels, and variations in respiratory rate. These assessments guide adjustments to the inhaled anesthetic dosage.\nEndotracheally intubate the pig with a 6.5 mm endotracheal tube, through direct laryngoscopy, and inflate the endotracheal cuff with 3-5 mL of air. Maintain the pig on volume-controlled ventilation with a tidal volume of 8 mL/kg, respiratory rate titrated to an end-tidal CO2 of 35-40 mmHg, and positive end-expiratory pressure of 5 cm H2O. Maintain anesthesia through the inhalation of 1% isoflurane.",
    "Place a Foley catheter in the urethra to monitor the urine output volume in female pigs and surgical place it in male pigs secondary to the anatomical difficulty of Foley placement through the urethra.\nPiglet model\n\t\nUsing a 22-24G IV, placed in best available vein, likely on the posterior side of the auricle, inject anesthesia solution of ketamine (2.2 mg/kg)/xylazine (2.2 mg/kg)/telazol (4.4 mg/kg)/dexmedetomidine (0.005 mg/kg) into an approximately 5-week-old piglet (equivalent to approximately 12-month-old human).\nPlace piglet on the operating room table, in the supine position.\nUsing direct laryngoscopy, endotracheally intubate the piglet with a 4.5-5.5 mm endotracheal tube. Inflate the endotracheal tube cuff with 3-5 mL of air using a syringe without a needle attached to it. Maintain anesthesia with 1% isoflurane with or without re-administration of dexmedetomidine (0.005 - 0.01 mg/kg IV) every 2 h as needed based on the depth of anesthesia appreciated at the time of re-dose.\nMaintain with volume-controlled ventilation a tidal volume of 8 mL/kg, respiratory rate titrated to an end-tidal CO2 of 35-40 mmHg, and a positive end-expiratory pressure of 5 cm H2O.\nPlace a Foley catheter in the urethra to monitor urine output volume in female piglets. Place the Foley catheter surgically in male piglets secondary to the anatomical difficulty of Foley placement through the urethra.\n\t\t​NOTE: Additionally, buprenorphine/dexmedetomidine analgesic administration will occur via bolus administration as deemed necessary. To maintain consistency, the respiratory rate on the mechanical ventilator will be adjusted to keep the end-tidal CO2 level within the range of 35-40 mmHg throughout the experiment.\n2. Cannulation and monitoring device placement\nAdult porcine model\n\t\nDisinfect the entire anterior neck with 2% chlorohexidine scrub solution and follow with a spray of 5% povidone-iodine solution14.",
    "Surgically expose both right and left external jugular (EJ) veins and internal carotid arteries (CA) with bilateral vertical incisions immediately lateral to trachea using blade No. 23.\nDissect the strap muscles and tract as needed using Kelly tissue scissors and Lahey retractors14. Expose bilateral EJ and CAs.\nPlace two 8.5 French (Fr) cannula into the right EJ using the Seldinger technique15. Once cannulated, place a 7 Fr pulmonary artery catheter (PAC) through the introducer of the right EJ. Use this right EJ catheter and PAC for hemodynamic monitoring.\nCannulate the left EJ with a 10 Fr cannula and connect it to a dedicated roller pump tubing primed with PlasmaLyte solution.\n\t\tNOTE: The external jugular veins tend to be of larger diameter and more appropriately angled for heart catheterization. It is for these reasons we chose to cannulate the EJ over the internal jugular (IJ) in the porcine experiments1.\nUsing the Seldinger technique15 place a 4 Fr arterial line in the right CA for invasive blood pressure monitoring throughout the experiment.\nAttach the desired monitoring to pig.\n\t\t\nMonitor the heart rate (HR) with telemetry leads and the systolic blood pressure (SBP), diastolic blood pressure (DBP), and mean arterial pressure (MAP) by connecting a pressure transducer attached to a blood pressure amplifier to the CA catheter.\nMonitor the mean pulmonary artery pressure (MPAP), systolic pulmonary artery pressure (SPAP), diastolic pulmonary artery pressure (DPAP), and central venous pressure (CVP) by attaching a pressure transducer attached to a blood pressure amplifier to the appropriate PAC ports.\nDetermine pulse pressure by finding the variance between SBP and DBP. To calculate pulse pressure variability (PPV), compute the variation between peak pulse pressure levels during both inspiration and expiration throughout the respiratory cycle.",
    "Calculate PPV measurements using LabChart 8's Blood Pressure Module and running on a PowerLab system. In this setting, select 3 min of data in the Arterial Line channel where the minimum peak height is set to 10 mmHg and cycles averaged over 10 cycles. In the software's module the peaks of each pulse cycle can be automatically calculated and visually confirmed. The resulting minimum pulse pressure and maximum pulse pressure are then used to calculate PPV.\nCarry out thermodilution cardiac output (CO) by using device specific volume/temperature calibration. Obtain pulmonary capillary wedge pressure (PCWP) by inflating the PAC balloon with 1.5 mL of air and advancing the catheter until there is visualization of both V and A waves, representing restricted right to left blood flow. Read the PCWP at the value of the A wave at end expiration.\nAdminister PlasmaLyte16 at a rate of approximately 100 mL/min to obtain a starting PCWP of 8-10 mmHg (euvolemia) before the initiation of acute volume overload.\n\t\tNOTE: The total volume needed to achieve euvolemia varies based on a multitude of variables covered in the Discussion. Approximately 500 mL is needed, on average, in pigs undergoing this experimental protocol at Vanderbilt University Medical Center. This model uses PlasmaLyte as the balanced buffered crystalloid solution. It is likely that any other balanced buffered crystalloid (e.g., Normosol-R, Lactated Ringer's) would offer similar results. Non-buffered, acidic normal saline is and should be avoided in this model to avoid the known loss of endothelial cell membrane integrity, endothelial dysfunction, and acidosis caused by normal saline16.\nPiglet model",
    "Similar to adult pigs, piglets, once anesthetized and mechanically ventilated, disinfect across their entire anterior neck with 2% chlorohexidine scrub solution and follow with a spray of 5% povidone-iodine solution14. Only cannulate the right EJ, carotid, and left femoral arteries in piglets.\nSurgically expose the right EJ vein and internal CA with a right sided vertical incision immediately lateral to trachea using blade No. 23.\nDissect the strap muscles and tract as needed using Kelly tissue scissors and Lahey retractors14. Expose the right sided EJ and CA.\nDisinfect the lower abdomen and pubic area of the piglet with 2% chlorohexidine scrub solution and follow with a spray of 5% povidone-iodine solution. Surgically expose the left femoral artery (FA) with a classic longitudinal technique as described in17.\nPlace a 6 Fr central venous catheter introducer into the right EJ, followed by placement of a 5 Fr PAC into the pulmonary artery.\nPosition two 3 Fr arterial catheters: one in the right CA and the other in the left FA. Dedicate the left FA catheter to drawing blood for frequent arterial blood gas analysis. Use the open port associated with the PAC introducer for volume administration with a 60 mL syringe.\nAdminister a PlasmaLyte16 bolus of 10 mL/kg using a 60 mL syringe at a steady push rate, stopping after each bolus to obtain a PCWP and stop once a value of 8-10 mmHg (euvolemia) is achieved.\n\t\t​NOTE: The total volume needed to achieve euvolemia varies based on a multitude of variables covered in the Discussion of this manuscript. Approximately 50-100 mL is needed, on average, in the piglets undergoing this experimental protocol at Vanderbilt University Medical Center.\n3. Volume administration\nAdult porcine model",
    "Once cannulation is complete and euvolemia achieved, infuse warm PlasmaLyte crystalloid solution in 500 mL increments at a rate of 100 mL/min (Figure 1).\nConfirm the recording of hemodynamic endpoints: HR, fraction of oxygen-saturated hemoglobin (SpO2), respiratory rate (RR), end-tidal carbon dioxide (ETCO2), CVP, SBP, DBP, MAP, PPV, SPAP, DPAP, and MPAP.\nPerform necessary procedures to obtain the static measures (CO and PCWP) after every 500 mL of volume until sacrifice, which will take place at 5 L total volume or until a 15% CO decrease from previous measurement exists, whichever occurs first.\n\t\tNOTE: The drop in CO represents the start of the descending limb of the Starling curve18. At this point, volume overload leads to dilation of the heart past the optimum length for muscle fiber contraction, resulting in impaired contraction and decreased CO18.\nAt euvolemia, and at the end of total volume administration, perform an arterial blood gas analysis to obtain the partial arterial oxygen pressure (PaO2), pH, lactate, and base excess of the pig.\nRecord the urine output (mL) after each 500 mL increment of PlasmaLyte crystalloid solution. It is advisable to zero out the urine once euvolemia is achieved. Sacrifice the pig either at a total volume of 5 L or when a 15% decrease in CO is observed, whichever occurs first.\nPiglet model\n\t\nFollowing successful cannulation and attainment of euvolemia, administer PlasmaLyte in increments of 20 mL/kg via syringe bolus every 10 min (Figure 1).\nConfirm the recording of hemodynamic parameters (HR, RR, SpO2, EtCO2, CVP, SBP, DBP, MPAP, PPV, and MPAP). Measure PCWP after each 10 mL/kg bolus.",
    "NOTE: Owing to the volume required and the resistance created by the small internal diameter of the 5 Fr PAC, thermodilution CO is not performed in the piglets. Instead, the Fick method19,20 is employed to calculate the CO. This involves obtaining a fraction of oxygen-saturated hemoglobin from the pulmonary artery blood (SvO2), which is performed concurrently with arterial blood gas analysis.\nPerform arterial blood gas analysis after each 20 mL/kg volume bolus to obtain the PaO2, pH, lactate, and base excess.\n\t\tNOTE: Given the limitations of many of these invasive data points in routine clinical care, transthoracic echocardiography (TTE) is performed after each 20 mL/kg bolus in the piglet model to measure the aortic blood flow Peak Systolic Velocity (PSV) and Left Ventricular Outflow Tract (LVOT) diameters-two data points used in pediatric clinical practice to estimate a patient's volume state.\nPerform TTE to measure PSV and LVOT diameter data points after each 20 mL/kg bolus. Record urine output after each 20 mL/kg bolus. Sacrifice the piglet either at a total volume of 500 mL or a 15% decrease in CO is observed, whichever occurs first.\n4. Euthanasia for both adult pigs and piglets\nConfirm maintenance of 1% isoflurane. Induce cardiac arrest by IV injection of sodium pentobarbital (125 mg/kg). Confirm lack of vital signs post injection to confirm demise.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}