{
  "id": 3332,
  "origin_website": "Cell",
  "title": "Detection of viable commensal bacteria in murine melanoma tumors by culturomics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSterile tumor tissue isolation\nTiming: 1–2 h\nThis step will describe our method for the sterile resection of a subcutaneously engrafted murine melanoma tumor.\nEuthanize mouse and generously spray the mouse with 70% ethanol (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2919-Fig3.jpg\nFigure 3. Sterile resection of subcutaneously engrafted murine melanoma tumor\n(A) Thoroughly wet euthanized mouse with 70% ethanol.\n(B) Make a single incision through the skin 1–2 cm above the tumor.\n(C) Pull skin back far enough to reveal tumor. Pin down skin and back legs.\n(D) Remove all tumors sterilely.\nPlace the mouse in the prone position and pin it down at the shoulders (axillary) on an autoclaved paper towel on a dissection board.\nMake an initial incision through the skin approximately 1–2 cm above the hind-flank tumor using the big scissors (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: These big scissors can be used for multiple mice.\nUse the non-dominant hand to hold the mouse firmly against the dissection board. Use the dominant hand to grab the bottom edge of the skin at the incision point and pull continuously until the skin is peeled back past the tumor (Figure 3[href=https://www.wicell.org#fig3]C).\nPin the pulled-back skin-flap and legs down to the board.\nEnsure that the peritoneal cavity does not open and contaminate the tumor.\nWith a new pair of sterile medium scissors and forceps, carefully remove the tumor, ensuring no contact with mouse fur, and transfer the tumor into a sterile 40 μm filter in a sterile 6-well plate (Figure 3[href=https://www.wicell.org#fig3]D).\nSterilely divide the sample in half using sterile medium scissors and forceps and transfer it to another sterile filter inside a 6-well plate.\nSterile tumor lysis\nTiming: 4 h\nThis section describes our process for tumor tissue homogenization and lysis to extract live bacteria from the tumor.",
    "Optional: Weigh individual tissue samples by placing the filter on a scale covered with a sterile paper towel. Return filters to the 6-well plate.\nSet up contamination controls for both aerobic and anaerobic culture plates.\nSet aside a single well in two of the 6-well plates for a mock-sample control (one should be placed in an aerobic plate, and one in an anaerobic plate).\nAdd a sterile 40 μm filter to each well.\nWave a set of sterile tools in the air and rub them on the filter to account for potential contamination during tissue isolation.\nPerform all steps indicated in the remainder of the protocol upon these mock-sample control wells in addition to your sample wells.\nNote: Without the sample control, one cannot confidently affirm that the bacterial growth was not due to contamination encountered during tissue processing.\nTransfer anaerobic samples to the anaerobic chamber. Transfer aerobic samples to the biosafety cabinet.\nAdd an appropriate volume of 0.05% NP-40 lysis solution (see Table 2[href=https://www.wicell.org#tbl2]) and record the volume of 0.05% NP-40 used for each tumor.\ntable:files/protocols_protocol_2919_3.csv\nFor control wells, add 2 mL 0.05% NP-40.\nMash tissue through the filter using a sterile 1 mL syringe plunger.\nFor control wells, rub a sterile syringe plunger in the filter with a mock mashing motion.\nFor large solid tumors (>1000 mg), use a set of sterile dissection scissors to mince tumor tissue into pieces ∼ 5 × 5 mm in size prior to mashing it through the filter.\nIncubate at 37°C for 3 h in either aerobic or anaerobic condition.\nDilute 0.05% NP-40 lysis-tissue homogenate with double the volume of sterile PBS that is at 20°C–22°C (e.g., for a tumor <500 mg and 2 mL 0.05% NP40, add 4 mL of PBS).",
    "Pipette homogenate up and down with a serological pipette around 10 times to further homogenize tissue lysate and collect sample that is out of solution.\nUsing sterile tweezers, carefully remove the filter from each well.\nTransfer tumor homogenate to a 15 mL conical tube.\nCentrifuge 4700 × g for 10 min to pellet all bacteria within the solution.\nEnsure all tube lids are tight to maintain their aerobic or anaerobic atmosphere.\nTransfer aerobic tubes back to the biosafety cabinet. Transfer anaerobic tubes back to the anaerobic chamber.\nSterilely aspirate aerobic supernatant. Gently pour anaerobic supernatant into a waste cup or use a serological pipette to gently remove supernatant if the pelleted tumor homogenate is unstable.\nCritical: Remove the 0.05% NP-40 from the sample to prevent bacterial lysis.\nResuspend samples in 1 mL sterile PBS.\nFor large pellets, if 1 mL is not enough volume to completely resuspend sample, add additional PBS in 500 μL increments and record the final volume.\nCulture procedure\nTiming: 6 days\nThis section describes our process for the live culture of tumor homogenate to facilitate the growth of bacterial populations.\nSeed expansion cultures by adding 200 μL of tumor homogenate suspended in PBS to all 5 mL broth aliquots.\nIf more than 1 mL was used for resuspension, add 1/5 of the total volume to each of the broth aliquots (see Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_2919_4.csv\nVortex at medium speed for 10 s to mix thoroughly.\nContamination control: Designate one aliquot of expansion broth of each broth type under aerobic and anaerobic conditions as a broth control to identify broth media contamination. This aliquot should be loosely capped and incubated alongside samples and the sample control.\nEnsure broth aliquots in both conditions are loosely capped.",
    "Aerobic expansion cultures should be incubated on a shaker incubator set to 150 rpm in 50 mL conical tubes, lids loosely affixed with a small piece of tape.\nAnaerobic expansion cultures should be incubated stationary in 15 mL conical tubes, loosely capped.\nIncubate at 37°C for either 2 days aerobically or 3 days anaerobically.\nPlate the expansion cultures onto appropriate agar plates (Figure 1[href=https://www.wicell.org#fig1]).\nTightly cap the expansion culture tube and vortex at medium speed for 10 s.\nDip a sterile inoculation loop into the expansion culture.\nStreak across the corresponding agar plate(s) for single colony isolation.\nStreak both the sample and broth controls across the corresponding agar plate(s) as well.\nCulture a bacterial strain of known identity on the appropriate agar media for use as a positive control during single colony 16S rRNA sequencing.\nIncubate at 37°C for either 2 days aerobically or 3 days anaerobically.\nPick colonies of at least 1 mm in size using the sterile pipette tip from the colony selection tube.\nPick 2–3 colonies per morphology per agar per sample.\nIf there was contamination on control plates, pick those colonies as well.\nEnsure colony selection tubes are labeled with agar type, collection time, and condition type (aerobic or anaerobic).\nStore tubes containing colonies at −80°C.\nOptional: If desired, wrap agar plates tightly with parafilm and store at 4°C agar-side up.\n16S sequencing\nTiming: 6 h\nThis step will describe our method for PCR amplification of the 16S rRNA region of individual bacterial colonies. These PCR products will be used for Sanger sequencing to identify individual colonies.\nRemove colony selection tubes from the −80°C freezer.\nInclude a positive control colony selection tube containing a bacterial colony of known identity and a negative control colony selection tube containing no bacterial colony.",
    "Add 20 μL of sterile ATE buffer directly into the pipette tip that was used to pick the colony.\nLet incubate at 20°C–22°C for 5 min.\nVortex for 5 s at medium speed.\nQuick spin the tubes using a bench-top centrifuge.\nMake a key identifying colony ID to sample #.\nUsing the cut pipette tip that was used to pick the colony, pipette the ATE solution up and down to mix the sample and transfer 10 μL of the colony suspension into a sterile 8-strip PCR microtube.\nPlace the 8-strip PCR microtubes in a bench-top centrifuge and give a quick spin.\nLyse bacteria by placing 8-strip PCR microtube in a thermocycler following the parameters below:\nThe remaining un-lysed sample can be placed back into −80°C freezer for storage and can be used to grow monoclonal stocks of the recovered bacterial strain if desired.\ntable:files/protocols_protocol_2919_5.csv\nDuring sample lysis, prepare a master mix for PCR amplification, as seen in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_2919_6.csv\nTransfer 2 μL of bacterial lysate to new sterile 8-strip PCR microtubes.\nAdd 8 μL of the master mix.\nQuick spin to bring down contents of each tube.\nAmplify 16S rRNA gene using the following parameters:\ntable:files/protocols_protocol_2919_7.csv\nOptional: Combine 2 μL of amplified PCR mix with 8 μL PCR grade water and run 1% agarose gel with 6 μL of ethidium bromide at 150 V for 20 min. If the reaction was successful, a band at 1500 base pairs should be seen.\nCritical: Ethidium bromide is a hazardous carcinogen and should be worked with in a designated area to avoid contamination.\nAfter PCR amplification (2.5 h), use Exosap-IT to purify PCR products.\nAdd 2 μL of Exosap-IT to a new set of sterile 8-strip PCR microtubes.\nAdd 5 μL of the amplified PCR mix to the PCR tubes containing Exosap-IT.",
    "Quick spin to bring down contents.\nPurify PCR products according to PCR cycling conditions for Exosap Purification using the following parameters:\ntable:files/protocols_protocol_2919_8.csv\nAfter purification, prepare the sample according to desired sequencing company’s instructions (i.e., dilute to proper DNA concentration, transfer to a specific size tube, etc.).\nThere are several commercial options available for targeted sequencing, as well as core facilities at many universities that are also qualified to perform this sequencing step."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Sequencing",
    "Microbiology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}