{
  "id": 7192,
  "origin_website": "Bio",
  "title": "Measuring Cytosolic Translocation of <em>Mycobacterium marinum</em> in RAW264.7 Macrophages with a CCF4-AM FRET Assay",
  "procedures": [
    "Growth of M. Marinum bacterial cultureApproximately 5 d before the infection assay, prepare the M. Marinum culture for infection. Inoculate M. marinum into 50 ml of 7H9 media supplemented with 10% OADC enrichment and proper antibiotics as needed, we routinely use 30 mg/ml Kanamycin. This bacterial culture will be used to start a new bacterial culture and passaged to reduce cell clumping. If the bacterial culture contains too many clumped cells, then add Tween-80 at a concentration of 0.05% (v/v) to the 7H9 media. Allow the bacterial culture to grow at 30 °C while shaking at 150 rpm until it reaches approximately OD600 1.2.Once the bacterial culture has grown past mid log phase, transfer 4 ml of culture into 46 ml of fresh 7H9 media supplemented with 10% OADC.Incubate at 30 °C while shaking at 150 rpm; allow the bacterial culture to grow into mid log phase once more, approximately 2 d. Culturing of RAW264.7 mouse macrophage cellsApproximately 2-3 d before infection, grow RAW264.7 cells in a T-75 flask with 10 ml of DMEM media containing 10% Fetal Bovine Serum (FBS) with penicillin and streptomycin at 100 unit/ml. Allow the cells to grow to 80-90% confluence at 37 °C with 5% CO2. The day before the infection, use a cell scraper to lift all of the cells (at 80-90% conflucence) from the  bottom of the TC flask.Transfer the cells and media into a 50 ml centrifuge tube.Centrifuge at 160 × g for 10 min at RT. Remove supernatant media and discard.Resuspend the pellet in 10 ml of DMEM media containing 10% FBS with penicillin and streptomycin. Count the cells using whichever method you prefer. Record the approximate number of cells in the sample. Fill a 6-well plate with 2 ml of media per well, then add RAW264.",
    "7 cells to seed a total of 2.5 × 106 cells/well.Incubate the cells overnight at 37 °C with 5% CO2.Bacterial single-cell preparation Pellet down the bacterial culture from Part A by centrifuging at 3,220 × g for 15 min. Remove the supernatant and resuspend the bacteria in 50 ml of PBS. Wash the cells 2 more times for a total of 3 washes with PBS. After the third wash, remove the supernatant and resuspend the pellet in 10 ml of PBS. Aspirate the bacteria in PBS using a syringe and pass through a 22-gauge needle.Note: This step is optional but will facilitate passing the culture through a filter.  Aspirate the bacteria with a syringe and pass through a 27-gauge needle. Aspirate the bacteria and pass through a 5 µm filter. Measure the density of the bacterial culture with OD600. Calculate the volume of bacterial cells needed to add to your macrophages depending on the multiplicity of infection (MOI). If needed, concentrate the bacterial cells by pelleting and resuspending them into a smaller volume. Infection of macrophagesCheck RAW264.7 cells under a microscope; they should be at 60% confluence. Aspirate DMEM media and replace with EM medium. Infect macrophages with Mycobacterium marinum at 10 MOI, or at the desired MOI. Incubate for 2 h at 30 °C with 5% CO2.After incubation, aspirate the media. Gently wash with 3 ml PBS and agitate the plate.Remove the PBS and wash 2 more times to remove extracellular bacteria.Add 2.5 ml of pre-warmed EM media with 10% FBS and incubate for 48 h. CCF4-AM FRET AssayLoad RAW264.7 cells with CCF4-AM loading solutions by following the manufacturer’s recommendation:The uninfected RAW264.7 cells loaded with CCF4-AM serve as a negative control. The RAW264.7 cells without CCF4-AM serve as another negative control.",
    "A Chiense hamster ovary (CHO) cell line that expresses β-lactamase (CHO-β-Lac) is used as a positive control for cleavage of CCF4-AM (Zhang et al., 2016).Solution B (100 mg/ml Pluronic-F127 surfactant in DMSO and 0.1% acetic acid) and Solution C (24% w/w PEG 400, 18% TR-40 v/v in water) are prepared by manufacturer. Add 182 µl of DMSO to dissolve 200 µg of CCF4-AM, gently pipet up and down.Note: This will be solution A, as specified by manufacturer.  Decant the solution into 20 µl aliquots.Notes: If you wish to store, desiccate under vacuum and store at -20 °C protected from light.  If vacuum is not available, the solution may be stored at -20 °C in the dark. This solution is stable for up to three months.  Add 3 µl of Solution A to 30 µl of Solution B and vortex. Add 467 µl of Solution C and vortex to produce 6× CCF4-AM substrate loading solution.Note: This solution is stable for 12 h at RT.  Add 500 µl of 6× CCF4-AM loading solution to 100 µl of the cell culture to make 1× CCF4-AM loading solution. Incubate at room temperature for 2 h while protected from light.Note: If cells are disturbed, the 2-h incubation will give them enough time to settle to the bottom of the plate.  Aspirate the media and CCF4-AM substrate.Resuspend the cells with 3 ml PBS and agitate the plate gently.Remove the PBS and wash 2 more times with PBS for a total of 3 washes.Fix the cells with fresh 4% paraformaldehyde (PFA) for 30 min at room temperature (RT) while protected from light.Wash once more with PBS and at this stage the cells are ready for measurement.Measurement using a fluorometerGently resuspend the cells in PBS and transfer them to a thin walled UV cuvette.",
    "The fluorometer program should be set up to excite at 405 nm and record emissions between 430 nm to 600 nm to obtain the curves containing both blue and green peaks (Figure 1). Note: In the fluorometer, two polarizers are placed vertical to each other on the excitation beam path and a 435 nm long-pass filter is placed on the emssition beam path to reduce the background and scattered light.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210415/20210415202459_3043.jpgFigure 1. The emission spectra of the samples were recorded from FRET measurement. A. After excitation at 405 nm, the hydroxycoumarin will transfer energy to fluorescein resulting in a green emission at 527 nm. Bacteria containing β-lactamase will escape the phagosome and come into contact with the FRET dye in the cytosol, resulting in the loss of FRET and a blue emission at 450 nm. B. The first peak is the emission of hydroxycoumarin (blue) and the second peak is the emission of fluorescein (green).The intensitiy at 450 nm (blue), I1, and the intensity at 527 nm, I2, are measured for 20 iterations. The Blue/Green ratio is calculated as I1/I2 (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210415/20210415202554_4634.jpgFigure 2. The blue/green ratio for sample data is calculated by division of I1 by I2. The intensity at 450 nm (blue) and 527 nm (green) are measured for 20 iterations. The Blue/Green ratio is calculated. A higher ratio, as observed for Mycobacterium marinum of ~0.8 represents a good change of signal, indicating cytosolic translocation. Lower ratios (< 0.2) are obtained by bacteria unable to escape the phagosome or the negative control."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}