{
  "id": 18291,
  "origin_website": "Jove",
  "title": "Expression of Exogenous Cytokine in Patient-derived Xenografts via Injection with a Cytokine-transduced Stromal Cell Line",
  "procedures": [
    "Studies were conducted in accordance with Loma Linda University's Institutional Animal Care and Use Committee (IACUC) and Institutional Review Board (IRB) approved protocols and according to all federal guidelines.\nCAUTION: PDX and human tissues should be handled in accordance with safety procedures to prevent the transmission of blood borne pathogens.\n1. Culture and Expansion of Cytokine-Transduced Stromal Cells\nNOTE: Each time stroma are passaged, harvest the culture supernatant (1 mL aliquot) and store at -80 °C for future quantification of cytokine level via ELISA assay.\nPrepare R10 culture medium and freezing medium as described in the Table of Materials.\nGenerate10,11 or obtain control stroma (transduced with empty vector) and cytokine-producing (TSLP+) stroma.6 Store in liquid nitrogen (LN2) until use. Thaw stromal cells as described12 and plate them in 5 mL of R10 medium in separate T-25 cell culture flasks. Culture cells in an incubator at 37 °C with 5% CO2. This is post-thaw \"passage #1\".\nOnce stroma are confluent (24-48 h), passage cells by trypsinizing using 1× trypsin EDTA (0.25%) and re-plating in a T-150 culture flask. This is post-thaw \"passage #2\".\nWhen stroma achieve confluency in the T-150 flasks (3-4 days later), passage the cells by trypsinizing. Use this cell suspension for experimental needs.\nCell expansion to multiple flasks\n\t\t\nSplit the harvested cells between three T-150 flasks and culture until confluent. Repeat this step if stroma expansion is necessary. Typical human stromal (HS-27A) cell count at confluence in a T-150 flask is ~5 x 106.\nCell storage\n\t\t\nTransfer the harvested cell suspension to a conical tube and centrifuge at 500 x g for 5 min, decant the supernatant and resuspend the cells in freezing medium. Freeze and store in LN2 ~1.5 x 106 cells per vial.\nFor intra-periotoneal stroma injections into mice, proceed to step 4.1.",
    "2. ELISA Assays to Monitor In Vitro Cytokine Production from Transduced Stroma\nPurchase commercially available ELISA assay kit to detect the cytokine of interest.\nThaw stromal cell supernatant from control and cytokine-producing (TSLP+) stroma harvested at early, middle and late passages (Figure 2).\nDetermine the TSLP concentration in supernatant samples using an ELISA kit according to manufacturer's instruction.13 Compile these serial data to monitor the stability of cytokine production during cell culture (Figure 2A-B).\n\t\nIdentify and discard cytokine-producing stroma with reduced or suboptimal cytokine expression, as well as any corresponding vials in storage (Figure 2A-B).\nIdentify and maintain cytokine-producing stroma that demonstrate stable, high level cytokine concentrations. Use these thaws for experiments.\nUse the ELISA kit to routinely monitor stroma throughout the duration of the cell culture (at least 1 time during early, middle and late post-thaw passages) to assure stable cytokine production or, in the case of control stroma, the absence of cytokine production.\n3. Phospho-flow Cytometry Assays to Evaluate the Activity of Cytokine Produced by Stroma\nNOTE: Assess the supernatant from engineered stroma before the first experiment to verify the relevant bio-activity of the stroma-generated cytokine for individual experiment.6 Once the engineered stroma are validated, further testing is not necessary unless stroma are introduced that were produced with a new vector.\nPurchase MUTZ5 and/or MHH-CALL4 leukemia cell lines (TSLP responsive),14 recombinant human cytokine, and antibodies approved for use in phospho-flow cytometry assays to detect appropriate downstream phosphorylation targets.\nThaw harvested supernatant from control and cytokine-expressing stroma.",
    "Plate the leukemia cell lines in R20 medium (see Table of Materials) at a concentration of 0.2 x 106 cells per well in a 96 well tissue culture plate. Plate 3 wells per condition to allow for triplicate assays. Incubate for 2 h at 37 °C. This time allows for the loss of any phosphorylation that occurred during prior culture conditions.\n\tNOTE: 12 wells per cell line provides triplicate assays for each experimental condition shown in step 3.4.\nAfter 2 h in culture, transfer the cells from each well to separate 4 mL tubes and centrifuge at 500 x g for 5 min, at 4 °C. Decant the supernatant.\nRe-suspend the cells in 200 µL for each of the following experimental conditions (perform assays in triplicate): 1) negative control-media only, 2) positive control-media with recombinant cytokine at saturating concentration(s) (TSLP at 15 ng/mL, etc.), 3) control stroma-supernatant from control stroma, and 4) cytokine-stroma-supernatant from cytokine-producing stroma.\nIncubate the cells for the duration specified by specific commercial phospho-assay (e.g. 30 min for phospho-STAT5 in MUTZ5 or MHH-CALL4 in response to TSLP).\nCentrifuge at 500 x g for 5 min at 4 °C and decant the supernatant.\nPerform phospho-flow cytometry staining per manufacturer's protocol and collect flow cytometry data.15\nAnalyze flow cytometry data.15\nGate on intact cells based on forward (FSC, indicates cell size) and side (SSC, indicates cell granularity) light scatter.\nDetermine the the median fluorescent intensity (MFI) of the intact cells in each sample. Compare the average MFI obtained from the triplicate values of stromal cell supernatant to that of positive and negative media controls.\n4. Injection of Cytokine-Transduced Stroma into Mice\nNOTE: Culture HS-27A stroma for a minimum of 3 post-thaw passages prior to injecting them into mice to ensure healthy cells and adequate cytokine production.\nPreparation of stroma",
    "Transfer the harvested stromal cell suspension to a conical tube and aliquot 10 µL for hemocytometer count; obtain live cell count using trypan blue.16 Centrifuge the remaining cell suspension at 500 x g for 5 min.\nAspirate the supernatant from the pelleted cells and gently resuspend the cells in the necessary volume of sterile phosphate-buffered saline (PBS) for mouse injection (depending on the number of mice to inject).\n\t\tNOTE Typical stromal cell concentration for mouse injection: 0.5 x 106-5 x 106 cells per mouse in 200 µL PBS.\nKeep the stromal cell suspension at 4 °C (or on ice) until immediately before the injection. Ensure that the cell suspension is at least at room temperature (RT) (~25 °C) for mice injection.\nStromal cell injection\nDisinfect the bio-safety hood, assemble materials for injections and then place the mouse cage inside.\nGently mix the cell suspension by inversion prior to drawing up 200 µL into a tuberculin syringe.\nUsing standard intra-peritoneal injection techniques,17 restrain the mouse and administer the 200 µL cell suspension into the peritoneal cavity. Details have been previously demonstrated by Machholz et al.18\n5. Serial Blood Collection and Plasma Monitoring for Exogenous Human Cytokine in Mice\nBlood collection via tail snip\nDisinfect the biosafety hood and assemble mouse restrainer, scissors and other tools/supplies for the procedure.\nPlace the mouse in a restrainer and secure the tube to minimize mouse movement.\nDisinfect the tail and surgical scissors with isopropyl alcohol. Apply topical anesthetic cream on the tail.\nUsing very sharp surgical scissors snip off about 0.5 - 1 mm of the tip of the mouse's tail. Collect approximately 80 µL of peripheral blood using heparinized capillary tubes.",
    "NOTE: If blood will be collected with this method more than six times, tail removal should be conservative with respect the amount of tail removed. As snips progress up the tail the diameter increases, it hemorrhages faster, and healing takes longer.\nPlasma separation\nTransfer the blood using a bulb syringe (to expel it from the capilliary tubes) into a labeled K2EDTA microtainer tube; invert 20 times to prevent coagulation.\n\t\tNOTE: Typically blood clotting from tail nip is fast. However, if hemorrhage persists longer than ~ 2 min use a styptic pencil/powder to aid coagulation.\nCentrifuge blood collection tubes according to manufacturer's instruction and aliquot the plasma for storage (-20 °C) until ready for the ELISA assay.\nIf mouse-human cell chimerism data is needed from the mouse blood, then treat the remaining pellet as described in step 6.3.1. Otherwise, discard the blood cell pellet.\nModified ELISA for micro-volumes of mouse plasma\n\tNOTE: The manufacturer's ELISA procedure was modified from the recommended 100 µL sample volume to a 40 µL volume to accommodate the micro-volumes collected from mice. It is not possible to run the in vivo mouse plasma samples in triplicate with these limited volumes. At the end of the experiment ~500 µL of post-mortem blood is collected via cardiac puncture. Cytokine concentrations evaluated in 100 µL of euthanasia plasma are used to validate the 40 µL in vivo data for each mouse.\n\t\nThaw frozen mouse plasma samples.\nSerially dilute ELISA standards and plate them in triplicate at 40 µL per well.\nAdd 40 µL of each mouse plasma sample to the ELISA plate.",
    "NOTE: If a mouse sample is less than 40 µL, then bring the volume up to 40 µL with ELISA buffer. Record this diluent volume and use it to calculate a dilution factor for each diluted sample. When analyzing the ELISA data multiply the diluted sample concentration by the sample's dilution factor to determine the actual cytokine concentration in original sample.\nComplete ELISA assay according to manufacturer's instructions.\n6. Transplantion of Hematopoietic Cells into Mice\nSublethal irradiation to condition bone marrow for transplant\n\tNOTE: Loma Linda University (LLU) uses a Cobalt-60 radiation source. Animals are placed in a pie restrainer which is positioned 80 cm from the radiation source in a 20 x 20 cm field and with a 0.5 cm layer of Lexan on top of the restrainer. Exposure time is calculated to achieve a 225 cGy dose based on most recent calibration of source (currently 2-3 min for this source).\n\t\nSub-lethally irradiate mice (total body irradiation dose of 225 cGy maximum for immune deficient mice).\nTransplant hematopoietic cells ~ 24 h later via intravenous tail vein injection.\nIntra-venous hematopoietic cell transplant\nPrepare human cell suspensions for transplant in a volume of 200 µL sterile PBS per mouse: CD34+ hematopoietic stem cells (HSC) : 1 x 105 to 5 x 105 cells per mouse and leukemia cell lines/patient samples: 1 x 106 to 5 x 106 cells per mouse.\nKeep cells at 4 °C (transport on ice) until immediately prior to transplant. Ensure cells are at least at RT prior to transplant.\nDisinfect the bio-safety hood and prepare the hood area for transplant injections.\nPlace the mouse in warming cage for at least 5 min to allow dilation of tail veins.",
    "Gently mix the cell suspension and draw up 200 µL into a tuberculin syringe. Safely set the needle aside where it will remain sterile.\nPlace the mouse in a restraint and disinfect the tail with isopropyl alcohol.\nUsing standard intravenous injection techniques,17 inject the human cell suspension into mouse tail vein.\n\t\tNOTE: Tail vein injections may take several attempts, especially for a novice animal handler. Kovacscics and Raper's JoVE video19 provides detailed demonstration of this animal technique.\nMonitor mouse's recovery for ~5 min. Record any adverse events during the injection (e.g. spilled cells, major hemorrhage, excessive tail trauma).\nAnalysis of human cell chimerism in mouse peripheral blood\nObtain the blood cell pellet remaining in microtainer tube after plasma separation (step 5.2.3).\nFor red blood cell (RBC) lysis, resuspend the remaining blood pellet in a volume of PBS equal to plasma removed (to replace plasma volume) and mix well (vortex/pipette).\nTransfer each re-suspended blood sample to a labeled 4 mL tube and then add RBC lysis buffer to each tube in a 1:9 ratio (900 µL RBC lysis buffer for 100 µL re-suspended blood). Incubate for 5 min at RT. Centrifuge (5 min, 500 x g) and decant.\nPerform second RBC lysis buffer incubation (5 min at RT). Centrifuge and decant as before.\nWash the remaining cells in ~ 1 mL PBS. Centrifuge and decant as before.\nResuspend the pellet in a volume of PBS appropriate for standard flow cytometry staining (this varies according to manufacturer and individual lab protocols).20 Use immunophenotyping antibodies validated for flow-cyotmetery to identify mouse cells (mouse CD45+) and human cells (human CD45+)6,21 as well as additional human leukocyte markers specific to the cell lineage of interest.",
    "NOTE: It is recommended to take a small volume (5 µL-20 µL) from each mouse sample to create \"pooled samples\" to use for unstained, viability, and isotype control samples. It is best practice to have unstained and isotype controls for each experimental condition.\n7. Functional Evaluation of In Vivo Cytokine Activity\nMouse euthanasia and tissue harvest\nEuthanize mice via CO2 asphyxiation at designated experimental time point.\nHarvest blood via cardiac puncture and collect plasma as in steps 5.2.1-5.2.2.\n\t\tNOTE: Collect the blood prior to other tissues because it begins coagulating immediately after death.\nProcess the mouse blood, aliquot and store plasma as in step 5.2.2.\n\t\t\nAt a later time, assess exogenous cytokine concentration in plasma obtained at euthanasia via ELISA according to the manufacturer's protocol. Evaluate and compare exogenous cytokine concentrations in the mouse plasma from the serial in vivo blood collection and the euthanasia plasma samples (described in section 5.3).\nAdd PBS to remaining blood sample to replace plasma volume and process as described in steps 6.3.1 and 6.3.2. Perform flow cytometry assays immediately or resuspend cells in freezing medium for LN2 storage.\nHarvest bone marrow (BM) and spleen from PDX mice and prepare single cell suspensions as previously described.22\nObtain cell counts for each PDX mouse tissue sample using 3% acetic acid with methylene blue (lyses cell membranes and RBCs leaving intact nuclei of living cells) in a 1:1 dilution and count cells using a hemocytometer. Tabulate total cell counts for bone marrow and spleen samples for each animal.\nCentrifuge (500 x g, 15 min) cell suspensions and decant the supernatant. Perform flow-cytometery assays of bone marrow and/or spleen cells immediately or resuspend in freezing medium for LN2 storage.\n\tNOTE: Freeze 10 BM aliquots (for future biochemical assays) and ~5 spleen aliquots (for future PDX transplants) per mouse.",
    "Immunophenotyping to identify in vivo functional effects\nPrepare one master-mix (MM) of flow cytometry antibodies to immunophenotype hematopoietic population(s) responsive to the cytokine of interest and a second MM of isotype control antibodies (Figure 5 and Table of Materials).\nThaw PDX tissue aliquots (37 °C bead bath) prepared in step 7.4.\nWash the thawed cells by transfering them to a conical tube and adding least 3x volume of PBS. Centrifuge (500 x g, 5 min) and decant the supernatant.\nRepeat the wash step (7.5.3).\nCreate pooled aliquots by taking ~10 µL-20 µL cells from each PDX sample for the unstained control, viability control, and the isotype controls (see step 6.4.6 note). Stain all samples, except the unstained control, with a fixable viability dye (dead cell marker), incubate and wash as per manufacturer's protocol.\nStain each PDX cell sample with phenotyping-MM according to standard flow cytometry staining protocol; similarily stain the pooled isotype-control sample(s) with the isotype-MM. Incubate all samples, wash with PBS, and fix samples by re-suspending in 1% paraformaldehyde.\nCollect flow cytometry data and analyze data using a gating strategy appropriate for the cell population(s) of interest (Figure 5). A typical gating is as follows:\n\t\t\nDefine intact cells by drawing a FSC and SSC gate that excludes debris.\nIdentify the living cells population by gating on cells that are negative for the dead cell marker (this is the \"total living cells\").\nUse sub-gates within the \"total living cells\" to define the cell popultions with desired immunophenotype (see Figure 5).\nObtain the frequency of subset cell populations within the total living cell count from flow cytometry analysis.6,21",
    "Calculate the number of target cells in each tissue by multiplying the frequency of the B cell subset, within total living cells (obtained in step 7.5.6.4) by the total living cell counts per tissue obtained in step 7.3 (% B cell subset x \"hemocytometer cell count\"; see Table 1)\nCompare the cell counts of target cell populations between control PDX mice and cytokine-expressing (TSLP+) PDX mice to determine in vivo functional effects of the exogenous human cytokine (Table 1).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}