{
  "id": 12188,
  "origin_website": "Jove",
  "title": "Using Virtual Reality to Transfer Motor Skill Knowledge from One Hand to Another",
  "procedures": [
    "The following protocol was conducted in accordance with guidelines approved by the Human Ethics Committee of Tel-Aviv University.The study includes 2 experiments – one using visual manipulation, and another combining visual with proprioceptive sensory manipulation. Subjects were healthy, right handed (according to the Edinburgh handedness questionnaire), with normal vision and no reported cognitive deficits or neurological problems. They were naïve to the purpose of the study and provided written informed consent to take part in the study.\n1. Setting up the Virtual Reality environment\nHave the subjects sit in a chair with their hands forward and palms facing down.\nPut on the virtual reality (VR) headset with the head-mounted specialized 3D camera to provide online visual feedback of the real environment. Make sure the video from the camera is presented in the VR headset.\n\tNOTE: The video is presented by C# codebase custom software, built based on an open-source, cross-platform 3D rendering engine.\nPut on the motion-sensing MR-compatible gloves that allow online monitoring of individual finger flexure in each hand. Ensure that the software embeds the virtual hands in a specific location in space such that the subjects see the virtual hands only when looking down towards the place where their real hands would normally be.\nThroughout the entire experiment, make sure the software records the hand configuration provided by the gloves.\n\tNOTE: The embedded virtual hand movement is controlled by the same software that uses C-based application program interface (API) for accessing calibrated raw data and gesture information from the gloves including the angles between fingers' joints.\nPlace the subjects' hands in a specialized motion control device and strap the right and left fingers individually to the pistons. Make sure the subjects can move their right hand fingers separately.",
    "NOTE: The right hand finger pistons move a plunger on a potentiometer according to the degree of their flexion. This in turn controls a module that reads the location of every potentiometer on each finger of the right hand and powers motors that push/pull the corresponding left hand finger to the corresponding position.\nVerify that voluntary movement of the left hand fingers is restricted by asking the subjects to move their left hand while it is located inside the device.\n\tNOTE: Since only the active (right) hand finger movement activates the motors, voluntary left hand finger movement is impossible when the device is turned on.\n2. Conducting the experiment\nNOTE: See Figure 1 for the experimental stages. Each subject underwent three instruction-evaluation-train-evaluation experimental sessions. The details of the instructions and evaluation stages are provided in the Representative results section.\nUnstrap subjects' hands from the motion control device.\nHave the subjects perform a unimanual 5-digit finger sequence movement repeatedly as accurately and rapidly as possible with the non-training hand in a pre-defined time frame (e.g. 30 s). Each individual finger flexion should be at least 90 degrees.\n\tNOTE: The fingers are numbered from index (1) to little finger (4) and the instructions include a specific 5-digit sequence. If the sequence is 4-1-3-2-4, have the subjects move their fingers in the following order: little-index-ring-middle-little.\nAfter the evaluation (step 2.2), strap the hands of the subject to the motion control device.\nCue the patient to the upcoming training stage to perform the sequence of finger movements with the active hand in a self-paced manner.\nRepeat the evaluation stages 2.1 - 2.2 again.\n3. Analyzing the behavioral data and calculating performance gains",
    "In the customized software that reads the data files of the gloves recorded during the experiments, click 'load left hand data' and choose the files created in the 'Left Hand Capture' folder under the relevant subject.\n\tNOTE: There are no different folders for pre- and post-evaluations. The file names contain the evaluation step identification.\nClick 'load right hand data' and choose the files created in the 'Right Hand Capture' folder under the relevant subject.\nClick 'Go' to replay and visualize the virtual hands movements during each evaluation stage based on the data recorded from the sensors in the motion-tracking glove.\nFor each evaluation step and each subject separately, count the number of complete and correct finger sequences (P) performed with the non-trained hand.\n\tNOTE: A finger movement is considered valid only when the angle between the proximal phalange and the metacarpal reached 90˚. A 5-digit sequence is considered complete and correct only if all finger movements were valid.\nCalculate performance gains index (G) according to the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55965/55965eq1.jpg\n\tWhere Ppost_training/Ppre_training correspond to the subject's performance (number of complete finger sequences) in the post/pre training evaluation stage respectively."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}