{
  "id": 17358,
  "origin_website": "Jove",
  "title": "Testing Epithelial Permeability in Fetal Tissue-Derived Enteroids",
  "procedures": [
    "The human tissue collection was approved by the University of Washington Institutional Review Board (study ID: STUDY380 and CR ID: CR3603) and performed by the Birth Defects Research Laboratory. The Birth Defects Research Laboratory was supported by NIH award number 5R24HD000836 from the Eunice Kennedy Shriver National Institute of Child Health and Human Development. The specimens were collected from consenting participants and sent as de-identified and without any health information. The small intestine specimens were stored in ice-cold Dulbecco's phosphate-buffered saline (DPBS) and mailed overnight to the receiving laboratory.\n1. Reagent preparation\nNOTE: See the Table of Materials for a list of reagents and catalog numbers; the recommended volumes are for a 6-well plate unless mentioned otherwise.\nPrepare 0.1% bovine serum albumin (BSA) by dissolving 50 mg of BSA powder in 50 mL of phosphate-buffered saline (PBS) with 100 µg/mL of a broad-spectrum antibiotic primocin to coat all the plasticware and tips that come in contact with tissues or enteroids.\n\t\nTo coat with BSA, place non-filtered pipet tips in a 50 mL conical tube with enough BSA to cover the tips, add 1-2 mL of BSA to cover the Petri dish surface, or fill 15 mL conical tubes with BSA for at least 20-30 min at room temperature prior to usage.\nPrepare DPBS media by mixing 50 mL of DPBS with 100 µg/mL primocin and 50 µg/mL gentamicin. Prepare this media with and without 2.5 µg/mL amphotericin.\nPrepare enteroid growth media by mixing 2 mL of organoid growth medium, 100 µg/mL primocin, 10 µM Y27632, and 2.5 µM CHIR99021. Make fresh media daily and warm it in a cell culture incubator at 37 °C.",
    "NOTE: The dilution factor for Y27632 is 1:250. For CHIR99021, dilute the CHIR stock solution to 1:100 in warm media and then to 1:40 in enteroid growth media to achieve a 1:4000 dilution.\nPrepare basement membrane matrix mix by adding to the stock basement membrane matrix 10 µM Y27632 and 2.5 µM CHIR99021. Make a total of 285 µL of the final basement membrane matrix mix at an 8 mg/mL protein concentration for one well of a 6-well plate.\n\tNOTE: Basement membrane matrix needs to be ice-cold to stay in liquid form and will solidify at warmer temperatures. The protein concentration of the stock basement membrane matrix determines the volume required to make an 8 mg/mL final protein concentration using the equation:\n\tVolume 1 × Concentration 1 = Volume 2 × Concentration 2\nPrepare 4% paraformaldehyde (PFA) by diluting the 32% stock PFA in PBS by 1:8, and store at room temperature. Make 0.5 mL for each well of enteroids to be fixed.\nPrepare blocking buffer by adding 5% goat serum and 0.5% Triton X-100 in PBS. Prepare 1 mL for the first antibody per well and 0.5 mL for the additional antibody per well.\n\tNOTE: Use serum from the same species as the host of the secondary antibodies\nPrepare primary and secondary antibodies, diluted in blocking buffer at the concentration recommended by the manufacturer for each antibody.\nPrepare 5 μg/mL Dmidino-2-phenylindole (DAPI) by diluting to 1:200 from 1 mg/mL stock solution in PBS. Make 0.5 mL per well of stained enteroids.\nPrepare 70% glycerol in PBS and make 0.5 mL for mounting the enteroids onto microscope slides.\nPrepare 5 mg/mL dextran-FITC (Fluorescein-Isothiocyanate) by diluting the 25 mg/mL stock solution in PBS by a 1:5 ratio. Make 20 μL for microinjection.",
    "Prepare lipopolysaccharides (LPS) and dextran-FITC by reconstituting the LPS powder in PBS to a 5 mg/mL stock solution. Dilute stock solutions of LPS and dextran in PBS to 0.1 mg/mL and 0.5 mg/mL LPS and 5 mg/mL dextran-FITC. Make 20 μL for microinjection.\nPrepare ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid (EGTA) by making a stock solution of 0.2 M by dissolving EGTA powder in distilled water and adjusting the pH to approximately 8 using hydrochloric acid (HCl). Prepare a testing concentration of 2 mM in culture media by performing a 1:100 dilution.\n2. Specimen collection\nOnce the samples are received, perform epithelial cell isolation and plating within 24 h of the specimen collection.\n3. Intestinal epithelial cell plating in basement membrane matrix from whole specimens\nNOTE: This procedure follows modified protocols from the Translational Tissue Modeling Laboratory at the University of Michigan12,13,14. Using growth media with a high Wnt factor yields consistent results for enteroid establishment. Once the enteroids are established, use the same media with a high Wnt factor to drive the enteroids to spherical shapes for microinjection.\nTransfer the intestine segments to a 60 mm x 15 mm Petri dish with ice-cold DPBS with amphotericin and soak for 20 min on ice. While the tissue soaks, identify the regions (duodenum, jejunum, or ileum) of the small intestine and remove the connective tissue and blood vessels with forceps and scissors. Wash out the lumen content as needed using a small 23-25 G needle and a 3 mL syringe without disrupting the epithelium.\nCut the intestine segments into 3-5 mm pieces using a scalpel and place 1-2 pieces (for plating in one well of a 6-well plate) in a 35 mm x 15 mm Petri dish that contains 0.5-1 mL of organoid growth medium on ice.",
    "Using dissecting micro scissors and forceps, cut the intestinal tube longitudinally. Use the forceps tip to scrape the epithelial cells from the fascia under a 10x stereo microscope. Remove the fascia and swirl the dish to break up the clumps of cells.\nUse a 20 μL pipette cut tip to transfer the cells and media at the increment of 5-10 μL to the basement membrane matrix mix to make a 285 μL solution at an 8 mg/mL matrix protein concentration. Pipet up and down slowly 20x to mix cells in basement membrane matrix on ice using a 200 μL cut tip.\nPlace five 50 μL strips of the cell basement membrane matrix mix in one well of a pre-warmed 6-well plate kept on a warm foam brick. Incubate the plate in the cell culture incubator at 37 °C and 5% CO2 for 10 min to allow the basement membrane matrix to polymerize and harden.\nAdd 2 mL of the enteroid growth media into the well of the solidified basement membrane matrix strips and place back inside the cell culture incubator. Change the media daily to boost enteroid growth. Check for intestinal stem cell differentiation under a 10x inverted microscope daily.\nAfter 10-14 days, pass the enteroids into one well of a 12-well or 6-well plate, depending on the enteroid density. Start changing the media every other day and pass in a 1:2 ratio every 5-7 days as the enteroids start to thrive.\n\t\nRemove the cells that do not differentiate into enteroids with the basement membrane matrix layer during passages. Create a frozen stock of enteroids with a low passage by freezing them in 80% growth media, 10% fetal bovine serum (FBS), and 10% dimethyl sulfoxide (DMSO), if needed.\n4. Immunofluorescent staining of enteroids",
    "NOTE: The process of fixing and staining takes 3 days. In this protocol, we fixed and stained for nuclei (DAPI), epithelial markers (villin, CDX2), lysozyme, mucin, and tight junction proteins (claudin 2, claudin 3, occludin, zonula occluden-1) using a modified protocol15. Fluorescent images were taken by a confocal microscope.\nFixing\n\tNOTE: This process is usually done at the same time as the enteroid passage or freezing procedure.\n\t\nPlace the enteroid plate on ice. Remove the growth media and gently wash 2x with cold DPBS.\nIdentify the enteroids to be fixed and stained. Transfer them to a 12-well plate by carefully pipetting them with a 200 μL cut tip or using a 1 µL inoculating loop. Place enteroids in separate wells if staining with different antibodies is to be done.\nRemove as much liquid with a 200 μL tip as possible without disrupting the enteroids. Add 0.5 mL of 4% PFA and incubate for 30 min at room temperature. Swirl the plate occasionally to facilitate detachment of the enteroids from the basement membrane matrix.\nExamine grossly to determine the detachment of the enteroids from the basement membrane matrix. Carefully aspirate and discard the liquid PFA without disrupting the enteroids. Wash with PBS 3x to remove PFA and any residual basement membrane matrix\n\t\tNOTE: Aspirating the liquid under a stereo microscope can be helpful for avoiding the enteroids. Fixed enteroids can be stored in PBS at 4 °C for up to 1 month.\nBlocking\n\t\nCarefully remove residual PBS with a 200 μL pipette, without disrupting the enteroids. Add 0.5 mL of blocking buffer and incubate for 2 h at room temperature.\nRemove and discard the blocking buffer with a 200 μL pipette, being careful to avoid disrupting the enteroids.\nAntibody staining",
    "Add 500 µL of primary antibody in blocking buffer to each well with enteroids. For primary antibodies and for lysozyme, the dilution factor is 1:100, for CDX2 the dilution factor is 1:100, and for villin the dilution factor is 1:50. Incubate at 4 °C overnight.\nOn the following day, remove the antibody solution and wash 3x with PBS. Allow 10-15 min of incubation time for each wash.\nRepeat steps 4.3.1.-4.3.2. for the secondary antibody with a dilution factor of 1:400.\nAdd 500 µL of DAPI at 5 µg/mL in PBS and incubate at room temperature for 15 min. After incubation, wash 3x with PBS, and allow 10-15 min of incubation time for each wash\nMounting\n\t\nRemove as much PBS as possible. Wash the stained enteroids with 70% glycerol 1x.\nLift the enteroids out of the plate using a 1 µL inoculating loop or a cut 200 μL tip and mount with 70% glycerol onto a glass microscope slide.\nTo preserve the 3D structure of the enteroids, ensure a 0.5-1 mm space between the bottom glass slide and the coverslip. Use cut-outs of thin silicon rubber sheet or glass coverslip to create a space between the glass slide and the coverslip. The enteroids can now be imaged with a confocal microscope.\n5. Preparation for microinjection of enteroids\nNOTE: The microinjection protocol is a modified protocol from Hill et al.16 to fit the resources and setting. Some of the preparation steps need to be completed a few days in advance.\nSetting up the microinjection setup",
    "Set up the microinjector apparatus either inside a biosafety cabinet or on a clean counter, depending on the objective of the experiments, as follows: a stereo microscope for viewing, a micromanipulator with X-, Y-, and Z-axis control nobs mounted on a heavy stand next to the microscope, a micropipette holder mounted on the micromanipulator arm, a microinjector tubing connecting the micropipette holder and a syringe with a three-way stopcock, then to a pneumatic pump, and a wall air source connected to the pump (Figure 1).\nDisinfect the microinjection apparatus with 70% ethanol prior to experimental use and afterward. Test out the positioning of the microscope and micromanipulator to fit the desired physical specifications, including moving the axis knobs to ensure the micropipette can reach the targeted specimen.\nPreparation of the micropipette\n\tNOTE: Perform these steps in advance.\n\t\nUse a micropipette puller to pull the glass capillary tubes into the micropipettes.\nUnder the stereo microscope, place the micropipette on a horizontal micropipette holder (Figure 2), focus on the tips, and cut the tips using a pair of micro scissors while looking through the microscope eyepieces. Prepare about 10-15 micropipettes at a similar tip size for each experiment.\nTest the tip size by pulling up 0.5-1 μL of liquid and count how many pumps are needed to empty the volume. Test several tip sizes to find the appropriate size for the experiment. An appropriate tip size ejects approximately 10-30 nL volume per pump.\nStore the cut glass micropipettes in a clean box or tube without damaging the tips.\n\t\tNOTE: Pre-cut micropipettes are available commercially.\nEnteroid preparation\n\t\nPlace a plate of mostly large and spherical enteroids onto ice. Replace the old growth medium with fresh medium.",
    "Gently dissociate the basement membrane matrix dots from the plate with a cell lifter. Swirl the gel dots from side to side on ice to break up the basement membrane matrix without disturbing the enteroids.\nSelect around 10-15 spherical enteroids with a cut 20 µL pipette tip under a stereo microscope and add to the basement membrane matrix to make 285 µL of 8 mg/mL protein concentration mixture.\nPipet up and down gently with a cut 200 µL tip to mix the enteroids without breaking them. Plate five 50 µL gel dots in the center of a round 35 mm x 10 mm cell culture Petri dish or one with similar dimensions.\nIncubate the enteroid gel dots at 37 °C for 10 min to solidify. Then, add 1 mL of fresh growth medium to the dish. Incubate the enteroids for at least 2-3 days for stabilization and until the enteroids reach an appropriate size of 0.5-1 µL.\n\t\tNOTE: It is important to have a dish with a low wall for easier access to the enteroids and a small diameter for less volume of growth medium.\nMicroinjection of dextran-FITC and tested material\n\t\nTurn the three-way stopcock off to the pneumatic pump. Fill the micropipette with the injected material, in this case dextran-FITC with or without LPS.\nPrepare a Petri dish covered with a strip of transparent film. Place two to four 1 µL dots of injected material on the film.\nUse the micromanipulator to drive the tip of the micropipette to just inside the liquid but above the film under the visualization of a stereo microscope. Gently pull on the syringe to withdraw the injected material into the micropipette.",
    "Fill the micropipette with 2-4 µL of injected material and push on the syringe to remove any air at the tip of the micropipette. Inspect the injected material column in the micropipette to make sure there is no air pocket. Record the volume of injected material that withdrew inside the micropipette.\n\t\tNOTE: The liquid is visible in a greenish color due to dextran-FITC.\nTurn on the air source connected to the pneumatic pump, which provides an air pressure of approximately 60 psi. Turn on the pump and set the pump duration to 10-15 ms. Turn the stopcock on the syringe to open the line from the pump to the micropipette.\n\t\tNOTE: The longer pump duration allows for more material to be released per pump. It is recommended to use the same pump duration and micropipettes with similar tip sizes for the entire experiment for estimation of the injected volume.\nRemove the enteroids from the cell culture incubator and place the dishes on top of a warm foam brick in a covered container to limit light exposure after microinjection.\nPlace the Petri dish with enteroids under the stereo microscope and move the micromanipulator knobs to place the tip of the micropipette at about a 35°-45° angle to the horizontal surface (Figure 3). This requires some practice in advance.\nVisualize and map out the enteroids in each Petri dish under the microscope to make a plan for injecting around 3-5 spherical enteroids per dish.\nOnce the tip of the micropipette is close to the liquid surface, look into the microscope eyepieces to advance the tip toward the targeted enteroid.",
    "Puncture the enteroid with the micropipette tip by advancing the z-axis knob using a precise slow movement. The enteroid wall will depress and pop back once the tip goes through the enteroid surface, at which point the advancement should stop.\nTap on the pump pedal with one foot and fill the enteroid with the greenish dextran-FITC solution until it is slightly expanded. Record the number of pumps to calculate the pumped volume and dextran concentration.\nWithdraw the tip of the micropipette after finishing microinjection and move to the next enteroid. With practice, the process can go smoothly.\n\t\t\nIf the tip breaks, replace it with another micropipette with a similar tip size. Pull enough volume of injected material for all the enteroids in the same exposure group and change the micropipette between injected materials to avoid cross-contamination.\nPlace the injected enteroid dish under cover to avoid light exposure.\nDextran-FITC collection and measurement\n\t\nAfter the microinjection procedure, immediately remove the culture media. Wash with fresh growth media 2x to remove any residual dextran-FITC. Add fresh media and record the time as time 0 post microinjection.\n\t\tNOTE: You may need a second person to carry out this step without disrupting the microinjection process.\nCollect 200 µL of culture media in an opaque 0.5 mL microfuge tube and then replace the removed culture media with the same volume of fresh growth media at 1 h, 2 h, 4 h, 6 h, 8 h, 10 h, and 12 h post microinjections.\n\t\tNOTE: The time interval may vary depending on the experiment. With a basolateral exposure, the replacement media should contain the exposure at the same concentration.",
    "Store the collected culture media at 4 °C and measure the dextran concentration within 24 h. Store leftover media at −80 °C for other analyses. At the end of the culture media collection, harvest the enteroids for RNA extraction or imaging, if needed.\nMeasure dextran-FITC concentrations with a fluorescence microplate reader. Construct a standard curve for each plate using serial dilutions and by fitting a linear regression line as shown in Figure 4.\nCorrect the absorbance for the removed volume of culture media containing dextran that was replaced with fresh growth media without dextran as follows: removal of 200 µL out of 2 mL of culture media is 10% by volume.\n\t\tCorrected absorbance at 2 h = (absorbance at 1 h x 10%) + measured absorbance at 2 h\n\t\t​Absorbance of the first corrected medium does not need correction. Then, calculate the dextran concentration from the corrected absorbance value using the standard curve equation.\nFor normalization, divide the dextran concentration by the total number of pumps for each Petri dish then multiply by the largest total number of pumps per dish.\n\t\tNOTE: All exposures are performed in triplicates (three Petri dishes per exposure with 3-5 microinjected enteroids per dish). The mean values of the triplicates are compared between exposures using a Student's t-test."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}