{
  "id": 17295,
  "origin_website": "Jove",
  "title": "Transdermal Measurement of Glomerular Filtration Rate in Mechanically Ventilated Piglets",
  "procedures": [
    "The procedures are written according to national standards for the care and use of laboratory animals and were approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Tennessee Health Science Center (UTHSC).\nNOTE: Piglets in the experimental group are subjected to cecal ligation and puncture, while the sham group only undergoes opening of the abdomen without cecal ligation or puncture. Piglets in both groups are kept under anesthesia for 12 h post-procedure to allow enough time for sepsis and acute kidney injury (AKI) to ensue in the experimental group. Transdermal GFR measurement will ensue at 8 h post-procedure for a total of 12 h.\n1. Piglet supply and housing\nIdentify a local hog farm that can provide neonatal piglets aged 3-5 days. Schedule the delivery early in the week to complete the experimentation before any piglets are older than 7 days.\n\tNOTE: The supplier provided three to five piglets on Mondays for this experiment; by Friday, the piglets would have undergone the experiment. Using the same sex and near similar age is essential to avoid confounding factors.\nUpon the piglet's arrival, ensure they have an individual identification (e.g., an ear tag and a record that includes weight and age).\nHouse the piglets in a lab animal care unit (LACU) under the care of a licensed veterinarian. The animals are housed as a group in a spacious pen with a solid concrete floor that is easily washed with water to maintain good sanitation.\nAdd a piece of furniture such as a heavy ball to allow for environmental enrichment and stimulation.\nEnsure that the LACU provides optimal environmental conditions, including the following key elements: sanitation, nutrition, temperature control, ventilation, and day-night cycle by controlling illumination.",
    "Have the veterinarian check on the piglet daily, including weight measurement, to inform the investigator if any piglet appears sick, which may necessitate exclusion from the experiment.\nLeave the piglets for at least 1 day to acclimatize to the environment, which helps minimize the stress.\n2. Pre-operative preparation\nPrepare the surgical station before initiating the experiment. This includes a heating pad, catheters, a ventilator, an endotracheal tube, heparinized saline, and a bag of ringer lactate fluid.\n\tNOTE: Piglets have poor thermoregulatory capacitance and are prone to hypothermia which alters hemodynamics22,23. Therefore, allowing enough time for the heating pad to warm up is essential.\nPrepare 10 mg/mL of α-chloralose by mixing it with saline at 60 ˚C until the mixture is clear. Do not overheat the solution to avoid crystallizing of the medication upon cooling. Filter with a syringe filter (size 0.22 µm) before administering to the piglets.\nDraw up anesthetic medication based on animal weight-Ketamine: 20 mg/kg and Xylazine: 2.2 mg/kg. Use α -chloralose (5 mL/kg) to maintain anesthesia.\n\tNOTE: α -chloralose is used due to the ease of IV administration when compared to inhaled \n\tanesthetics, as the latter require an anesthetic machine and an appropriate scavenging system to be delivered via an endotracheal tube.\n3. Anesthesia\nPerform induction of anesthesia in the pig pen, an environment familiar for piglets, to avoid undue stress.\nGently pick the piglet by the back legs and administer Ketamine: 20 mg/kg and Xylazine: 2.2 mg/kg into the rear leg at the semimembranosus/semitendinosus muscle, using a 23 G ¾ needle.",
    "Allow a few minutes for the medications to take effect. Check for the adequate anesthesia level by ensuring that the animal is relaxed enough to be immobile, with loss of palpebral reflex and jaw tone to allow ease and safe transportation to the surgical station. Assess the palpebral reflex by touching the inner corner of the eye; absence of blinking indicates adequate anesthesia.\n4. Tracheostomy\nNOTE: This experiment is non-survival, so a tracheotomy is performed to establish an airway for mechanical ventilation. Tracheostomy is a quick and easy procedure, as opposed to endotracheal intubation, which is challenging in piglets given their head and upper airway anatomy24,25. Additionally, laryngospasm is commonly reported during intubation, resulting in a prolonged period of hypoxia and hypercarbia that may compromise results26.\nPosition the piglet in dorsal recumbency. Identify the cricothyroid cartilage by palpating the prominence of the thyroid cartilage which feels firm. Sterilize the area using povidone-iodine and 70% ethanol before applying a sterile drape.\nUsing a a surgical blade, make a 2-3 cm ventral midline incision inferior to the caudal end of the thyroid cartilage.\nUsing a curved mosquito hemostat, bluntly dissect the overlying subcutaneous tissues and muscles (sternohyoideus and cutaneous coli) until the cricothyroid membrane and the first few tracheal rings are visualized. When dissecting, be cautious to avoid injuring any blood vessels.\nObtain a clear view of the cricothyroid membrane and tracheal rings24, then use a pair of long mixter right angle forceps to elevate the structures.\n\t\nWith a pair of small scissors, make a small cut at the cricothyroid membrane or the first tracheal ring. Extend the cut horizontally to ~0.5 cm to pass a 3.0 mm endotracheal tube.\nInsert the tube to the 5 cm mark. Ensure bilateral chest expansion and breath sounds prior to securing the tube.",
    "Pass umbilical tape around the trachea to secure it in place. Additional tape is used to secure the tube to the base of the jaw.\nSwitch on the ventilator, connect the endotracheal tube, and roll the specific knobs (eg. SIMV knobs, PEEP knobs, etc) to select the following baseline settings. Pressure Control Mode: synchronized intermittent mechanical ventilation (SIMV); peak inspiratory pressure (PIP) - 15; positive end-expiratory pressure (PEEP) - 5; Rate- 20; I-time - 0.6. Following the first blood gas analysis, adjust the ventilator settings according to the blood gas results, with the goal of maintaining adequate oxygenation and ventilation.\n5. Femoral vessel cannulation\nEstablish the airway and ventilation, before switching attention to the femoral vessels for venous access and invasive blood pressure monitoring. The femoral artery is identified by feeling a pulse at the groove between the sartorius and gracilis muscles, and the vein can be found just medial to the artery.\nWhile the piglet is lying in a dorsal recumbent position, sterilize the groin area using povidone-iodine and ethanol, and apply an appropriately sized drape.\nUse a surgical blade to create a 3-4 cm longitudinal incision, starting cranially at the inguinal crease and extending distally along the femoral canal.\nApply blunt and sharp dissection, using mosquito curved forceps and scissors, respectively, to dissect down to the level of the femoral neurovascular bundle. The bundle can be found deep in the body of the gracillis muscle27. Circumferentially dissect the femoral artery and vein over the course of 2-3 cm to allow for cannulation. Ligate small side branches if necessary.\nApply a 3.0 silk tie at both the artery and vein's proximal and distal ends to apply traction. Tie the distal silk suture on both the vein and artery, ligating the vessels.",
    "Beginning with the femoral vein, maintain distal and proximal traction on the silk ties and then use a pair of micro scissors to create a venotomy.\nNext, use a vein pick catheter introducer to open the vessel while inserting a pre-measured polyurethane catheter with an internal diameter x outer diameter of 0.86 mm x 1.32 mm. Once inserted, tie the proximal 3.0 silk suture to fixate the catheter. Flush the catheter with 3 mL of heparinized saline solution (1 U/mL). This solution can be made by adding 0.5 mL of heparin to 50 mL of normal saline.\nInsert an invasive blood pressure catheter using the same approach above to create an arteriotomy and pass the catheter.\n\tNOTE: Maintaining distal and proximal traction is essential to minimize blood loss when accessing the artery.\nOnce the catheters are secured, cover the site with saline-soaked gauze, and if necessary, the skin may be sutured using a 3.0 silk suture to prevent infection.\n6. Maintenance of anesthesia, fluid and blood gas\nMonitor the depth of anesthesia throughout the experiment, using jaw tone and palpebral reflex, and administer  α-chloralose, intravenously, as needed to maintain the animal under deep anesthesia. Use an initial loading dose of 50 mg/kg, and 20 mg/kg for further boluses.\nInfuse ringer lactate at a rate of 4 mL/kg/h throughout the experiment as maintenance fluid. For example, if the piglet weight is 3 kg, then the fluid infusion rate is 12 mL/h.\nFor bedside gas analysis, draw an arterial blood sample in a heparinized blood gas syringe and present the sample to the analyzer machine. Select the option arterial blood gas, and wait for ~2-3 s for the the analyzer to present the blood-draw needle.",
    "Carefully insert the needle into the end of the syringe containing the blood sample. Wait for the analyzer to aspirate the required sample and withdraw the syringe. Allow the machine to analyze the blood gas and present the results.\nBased on the results, adjust the ventilator to maintain the pH between 7.35--7.45, partial pressure of carbon dioxide (PCO2) between 35-45 mmHg, and partial pressure of oxygen (PaO2) between 80-150 mmHg. The settings differ based on the ventilator type, but largely involves increasing or reducing the respiratory rate using appropriate knobs to compensate for hypoxia and/or hypercapnia.\nDraw 3 mL of blood into a light green tube (Lithium Heparin). Centrifuge the sample at 2000 xg for 15 min, maintained at 4 ˚C to extract plasma. Once completed, the plasma can be analysed immediately for serum creatinine level with the bedside chemistry analyzer or stored at -80 ˚C for later analysis.\nMonitor the temperature continuously using a rectal probe thermometer and adjust the heating pad temperature to maintain piglet temperature between 101 to 103 ˚F.\n7. Experiment group; cecal ligation and perforation (CLP) 25,28,29\nNOTE: For piglets in the experiment group, perform CLP to induce polymicrobial sepsis28 and monitor the animal for 12 h post-surgery to allow enough time for severe sepsis to ensue. Transdermal GFR recording starts at 8 h post-cecal ligation to allow for 4 h of recording.\nUse a surgical blade to create a 5-6 cm left paramedian vertical incision, as the cecum in pigs lies in the left paralumbar fossa30. Dissect down the abdominal wall layers, avoiding injury to the superficial epigastric vessels.\nOnce the peritoneal layer is incised, use a retractor to improve access to intrabdominal structures.",
    "Identify the spiral colon in the upper left quadrant of the abdomen. Trace the spiral colon, caudally and dorsally, to locate the cecum. The ileum is seen joining the spiral colon at the base of the cecum.\nLigate the cecum just distal to the ileocecal junction (Figure 1).\nUsing a 18 G needle, make seven punctures in the cecum and extrude feces into the peritoneal area.\nClose the abdomen in layers with a 3.0 silk suture using either simple interrupted or continuous stitches. A stapler may also be used to close the skin layer if available.\n8. Sham group\nFollow the steps 7.2-7.4 as above. After identifying the cecum, place it back untouched and close the abdominal wall similarly.\nMonitor piglets in the sham group for 12 h to eliminate any confounding bias attributed to prolonged exposure to anesthesia.\n9. Transdermal GFR device setup\nAfter 8 h of cecal ligation, get ready to initiate transdermal measurement of GFR.\nUse the MB service software version 3.0 to adjust the sampling rate on the GFR device. Briefly, connect the transdermal GFR device to the computer software using the USB connector. Open the software, click connect, and adjust the timing to 4000 ms. Click write to save the settings.\n\tNOTE: This gives up to 6 h of total sampling time. In the pigs, transdermal GFR is completed in 4 h. For experiments that require sampling up to 12 h, choose the 8000 ms option.\nAttach the dual-sided adhesive patches with a clear window to the device. Attach the device to one side, ensuring the light-emitting diode overlies the clear window to allow tracer detection.",
    "Shave the area overlying the lateral thoracic wall. Attach the battery to the device and immediately stick the adhesive patch with the device in place and make sure it is well secured (Figure 2). Since the piglets are deeply anesthetized, tape might be unnecessary to hold the device in place.\n\tNOTE: The adhesive patch alone is enough to secure. However, in procedures where the animal would be manipulated, become active, or where anesthesia might be disrupted, it might be important to apply a tape. A bandage might also be an alternative approach31.\nA baseline recording of 3-5 min is required before administering FITC-sinistrin.\n10. FITC-sinistrin preparation and injection\nPrepare a mixture of FITC-sinistrin with saline solution to a final concentration of 50 mg/mL. The dose administered to the piglet is 20 mg/kg. FITC-sinistrin is supplied in powder form.\n\tNOTE: The FITC-sinistrin may also be administered through a peripheral venous catheter inserted in the auricular vein. It is essential to achieve a high peak level by administering FITC-sinistrin as a push bolus through the femoral vein venous catheter.\nAttach the syringe with medication to one side of a three-way stop cock and a saline flush on the other side of the stop cock. Push the FITC-sinistrin and immediately follow with a 5 mL saline bolus before closing the three-way stop cock to the piglet vein.\n11. Transdermal GFR recording\nKeep the device attached to the piglet for 4 h. During this time, keep the piglet under anesthesia using intermittent doses of α-chloralose at a concentration of 20 mg/kg to avoid any motion artifact.\nAt the end of the 4 h, remove the device and immediately disconnect the battery.\n12. GFR measurement\nConnect the transdermal GFR device to the computer using the USB connector provided by the supplier.",
    "Open the reading software to retrieve data from the device. Save the raw data by clicking the sequence: connect, read, re-name, and save. As instructed in the manual, process and evaluate the saved data in the analysis software.\nBriefly, open the software ver. 3.0 and import the data. Adjust the offset, start, and end positions using the automated markers. Remove artifacts if necessary, and click fit. This gives a readout that shows FITC-sinistrin clearance in minutes (t1/2). The t1/2 is subsequently used to calculate the tGFR32,33 as below:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64413/64413eq01.jpg\n\tNOTE: In consultation with the manufacturer, the conversion factor used for pigs is 20 (indicating that 20% of the body weight is extracellular space), as opposed to 21.33 in rats (tGFR in mL/min) and 14,616.8 in mice (tGFR in µL/min). This is because GFR is accurately measured as a function of extracellular fluid34,35, which in turn is dependent on body weight36.\n13. Piglet euthanasia\nCollect 3 mL of blood after 12 h of CLP for further biochemical analysis.\nEuthanize the piglet by administering 0.2 mL/kg of pre-mixed mixture of 20% sodium pentobarbital and Phenytoin Sodium intravenously.\nHarvest the right kidney for histopathologic study before taking the piglet to the morgue.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}