{
  "id": 9326,
  "origin_website": "Jove",
  "title": "High-throughput Analysis of Mammalian Olfactory Receptors: Measurement of Receptor Activation via Luciferase Activity",
  "procedures": [
    "1. Culture of Hana3A Cells\nPrepare M10 media by supplementing minimum essential medium (MEM) with 10% (v/v) FBS.\nCulture Maintenance\n\t\nMaintain cells in M10 media. NOTE: The expression vectors for RTP1L, RTP2, REEP1, and Gαolf confer puromycin resistance to Hana3A cells, but maintaining the cells with this antibiotic does not significantly affect assay results.\nSubculture at a ratio of 1:8 in 10 cm dishes every 2-3 days.\nIncubate at 37 °C with 5% CO2.\n2. Plating Cells for Transfection\nAspirate media from a 100% confluent 10 cm dish of Hana3A cells.\nWash cells by adding 10 ml PBS, swirling the dish, and aspirating the PBS.\nAdd 3 ml of 0.05% trypsin/EDTA and wait for cells to dissociate (about 1 min).\nInactivate trypsin by adding 5 ml M10 and break up cell clumps by triturating roughly 10x with a 10 ml pipette. Pipette carefully to avoid introducing air bubbles into the media.\nFor each 96-well plate, transfer 1 ml of cells into a 15 ml conical tube, centrifuge at 200 x g for 5 min, and aspirate the supernatant without disturbing the cell pellet.\nResuspend the cells in 6 ml M10 per 1 ml of cells transferred in Step 2.5.\nPipette 50 µl of cells to each well of a 96-well plate and incubate overnight at 37 °C with 5% CO2.\n3. Transfection of Olfactory Receptors\nPreparation of Plasmid DNA\n\t\nPrepare plasmid DNA via an endotoxin-free protocol. NOTE: Use plasmid DNA preparation kits designated \"endotoxin-free,\" or add a phenol-chloroform extraction step to the plasmid DNA preparation protocol.\nDilute DNA to a concentration of 100 ng/µl in TE buffer.",
    "Observe plated cells (Step 2.7) to ensure a proper confluency of approximately 30-50% per well and return to incubator. NOTE: While this confluency is not optimal for the lipid transfection reagent, a confluency of 30-50% at this step is optimal for measuring luciferase activity 24 hr after transfection.\nPreparation of Transfection Mix\n\t\nPipette RTP1S-pCI, M3-R-pCI, pCRE-luc, and pSV40-RL plasmids into MEM medium per the volumes detailed in Table 1 to make the Plasmid mix (volumes indicated are per 96-well plate).\n\t\ttable:\n﻿0,1,2\nPlasmid mix,Plasmid mix,Plasmid mix\n,per well,per 96-well plate\nMEM,--,500 µl\nRTP1S-pCI,5 ng,480 ng\nM3-R-pCI,2.5 ng,240 ng\npCRE-luc,10 ng,960 ng\npSV40-RL,5 ng,480 ng\nTable 1. Plasmid mix components. Per well and per 96-well plate volumes of RTP1S-pCI, M3-R-pCI, pCRE-luc, and pSV40-RL, and MEM.\n\t\t\nFor each 96-well plate, dilute 18 µl lipid transfection reagent in 450 µl MEM medium.\nPipette Plasmid mix (from Step 3.3.1), rhodopsin-tagged olfactory receptor in pCI plasmid (Rho-OR-pCI), and lipid transfection mix (from Step 3.3.2) to make the Complex detailed in Table 2. Mix the solution by trituration and incubate at room temperature for 15 min. Stop the reaction by adding M10 according to Table 2. NOTE: this reaction is time-sensitive and should not be allowed to continue for more than 30 min. The well + 10% calculation is important to ensure sufficient volume for subsequent steps.\n\t\ttable:\n﻿0,1,2\nComplex,Complex,Complex\n,per well,per well + 10%\nPlasmid mix,4.2 µl,4.58 µl\nRho-OR-pCI,0.05 ng,0.06 ng\nLipid transfection mix,4.2 µl,4.58 µl\nM10,41.7 µl,45.83 µl\nTable 2. Complex components. Per well and per well + 10% volumes of plasmid mix (Table 1), olfactory receptor plasmid (Rho-OR-pCI), and lipid transfection mix. M10 is added to quench the reaction following a 15 min incubation at room temperature.\n\t\t\nTap out the media on the cell plates.",
    "Pipette 50 µl of complex to each well and incubate overnight at 37 °C with 5% CO2.\n4. Odor Stimulation\nObserve the transfected cells to ensure a proper confluency of 50-80% per well and return to incubator. NOTE: If cells are less than 50% confluent, firefly luciferase and renilla luciferase readings may be too low for measurement of receptor activation. Consider discarding the plate.\nPrepare 1 M stock solutions of each odor in DMSO.\nPrepare odor stimulation solutions in CD293 medium.\n\t\nFor screening experiments, dilute stock solution of odor to 100 µM. Also prepare a no-odor control (CD293 only) in order to control for OR background activation. NOTE: For screening experiments, each OR/odor pair is tested only once per experiment. Because some odor diffusion across wells is possible, it is recommended to stimulate with one odorant for each plate.\nFor dose response experiments, prepare seven 10-fold serial dilutions of odor stock solution in triplicate starting at 1 mM for each receptor. Also prepare the same odor dilutions in triplicate for empty vector-transfected cells in order to control for odor background activation. NOTE: For dose response experiments, each odor concentration treatment should be conducted in triplicate.\nTap out the media on the cell plates.\nPipette 25 µl of odor stimulation solution to each well and incubate for 4 hr.\n5. Measuring OR Activity via Luciferase Assay\nResuspend firefly luciferase substrate per the manufacturer’s instructions and store at -80 °C.\nThaw 1 ml of firefly luciferase substrate per 96-well plate.\nPrepare fresh firefly luciferase reaction quencher and Renilla luciferase substrate reagent (5 µl luciferase quencher/Renilla luciferase substrate per 1 ml of buffer). NOTE: Approximately 1 ml of reagent is needed per 96-well plate.\nPrepare the luminescent microplate reader. Open the microplate reader software. Within the system icon:",
    "Under the \"Pre-heating\" Tab, check the box for \"ON\" and set the temperature of the machine to 25 °C.\nUnder the \"Dispenser\" tab, prime each dispenser with 1,000 µl of 70% ethanol followed by 1,000 µl of distilled water. NOTE: Use separate aliquots of alcohol and water for each dispenser. Ethanol is used to disinfect the dispensers, and water removes the residual ethanol.\nPrime each dispenser with 1,500 µl of air (remove dispensers from liquid). NOTE: priming with air ensures that luciferase substrates are not diluted with residual water.\nPrime dispenser 1 with 1,080 µl of firefly luciferase substrate (from Step 5.2). Prime dispenser 2 with Renilla luciferase substrate (from Step 5.3). NOTE: Be careful not to cross-contaminate the luciferase substrates. Priming with luciferase substrates fills the dead space in the reagent dispensers.\nSet up the following protocol to read both firefly and Renilla luciferase luminescence. Within the software associated with the microplate reader, under the \"File\" menu, click on \"New Task\". Highlight \"Protocols\" and click on \"Create New\". In the next window, the circle next to \"Standard Protocol\" should be selected. Click \"OK.\" Double click on \"Procedure\" on the left hand side of the screen.\n\t\nDispense 10 µl of firefly luciferase substrate to all wells using dispenser 1. Under the \"Actions\" menu, click \"Dispense\". In the \"Dispense Step\" window, set: \"Dispenser\" to 1, \"Priming\" to none, \"Dispense Volume\" to 10 µl and \"Rate\" to 225 µl/sec. Click \"OK\".\nShake the plate for 30 sec. Under the \"Actions\" menu, click \"Shake\". In the \"Shake Step\" window, set \"Intensity\" to Medium and \"Duration\" to 0:30 MM:SS. Click \"OK\".",
    "Read the luminescence of all wells for 0.5 sec per well. Under the \"Actions\" menu, click \"Read\". In the \"Read Step\" window, set: \"Detection Method\" to Luminescence, \"Read Type\" to Endpoint, \"Integration Time\" to 0:00:50 MM:SS:ss, \"Filter Sets\" to 1, \"Emission\" to Hole, \"Optics Position\" to Top, \"Gain\" to 135, and \"Read Height\" to 1.00 mm. Click \"OK\".\nDispense 10 µl of Renilla luciferase substrate to all wells using dispenser 2. Set the conditions as in Step 5.6.1, except set \"Dispenser\" to 2.\nShake plate for 30 sec. Set the conditions as in Step 5.6.2.\nRead luminescence of all wells for 0.5 sec per well. Set the conditions as in Step 5.6.3.\nRemove the lid from the 96-well plate and place the plate in the microplate reader. Start the program set up in Step 5.5 to read plate luminescence.\nClean the reagent dispenser pumps. From the system icon under the \"Dispenser\" tab:\n\t\nPurge 1,000 µl of firefly luciferase substrate from the firefly luciferase dispenser into a recovery tube. NOTE: Firefly luciferase can be stored at -80 °C and reused.\nPrime each dispenser with 1,000 µl of distilled water, followed by 1,000 µl of 70% ethanol, and finally 1,500 µl of air (remove dispensers from liquid). NOTE: Water removes luciferase substrates from the reagent pumps, ethanol disinfects, and air dries any residual ethanol.\n6. Data Analysis\nData Export\n\t\nIn the microplate reader software, double click on \"Report/Export Builders\" on the left side of the screen.\nClick on the button \"New Export to Excel\" and click \"OK\".\nHighlight Export1 and click \"Edit\".\n\t\t\nUnder \"Content\" check \"System Description\", \"Procedure\", \"Plate Description\", and \"Plate Layout Matrix\". Include \"Raw Data\" and \"Calculated Data\".",
    "Under \"Workflow\", check \"Autoexecute on completion of the procedure\". Under Export Mode, check \"All plates in the same workbook\" and \"As a new worksheet\".\nUnder \"File\" choose file name format and file location, and click \"OK\".\nClose the \"Report/Export Builders\" window.\nTo obtain normalized luciferase values, divide the firefly luciferase luminescence reading for each well (Step 5.6.3) by the Renilla luminescence reading for each well (Step 5.6.6).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}