{
  "id": 3053,
  "origin_website": "Cell",
  "title": "In vitro flow cytometry assay to assess primary human and mouse macrophage phagocytosis of live cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMacrophages replating procedure\nTiming: 1 day\nBefore beginning the assay, macrophages must be reseeded into 12-well plates and given at least 8 h to attach. It is important at this stage to ensure that equal numbers of macrophages are seeded into each well. Macrophages can be replated after 5–6 days of culture and used for phagocytosis assessment at 7–12 days of culture, counting the initial removal from mouse femurs as Day 0. The following steps are applicable to both human and mouse macrophages unless otherwise stated.\nCollect macrophages from petri dishes.\nAspirate supernatant.\nWash adherent macrophages with PBS.\nProp petri dish at a 45° angle and rinse the plate from the top with 5–10 mL PBS. Aspirate PBS. If collecting mouse macrophages, gently rinse the plate once with PBS. If collecting human macrophages, rinse the plate more forcefully three times with PBS, as human macrophages are more difficult to remove from the plate.\nDissociate macrophages.\nAdd 5 mL of trypsin per plate and incubate up to 15 min at 37°C until cells are visibly detached from the plate.\nCollect macrophages.\nProp petri dish up at a 45° angle and collect the trypsin into a 50 mL conical tube.\nUsing a 10 mL serological pipette filled with PBS, rinse plate from the top three times to collect remaining cells.\nCollect all cells into the same 50 mL conical tube.\nCentrifuge at 400 × g for 5 min at 4°C.\nPrepare macrophages for plating.\nCount macrophages using a hemocytometer.\nResuspend macrophages in RPMI complete supplemented with appropriate M-CSF depending on the species.\nPipet 1 mL into each well of the 12-well plates at 25,000–100,000 cells/mL.\nAim for 100,000 cells per well on the day of the assay.",
    "Note: The macrophages will proliferate slightly over time, so if you do not plan on using the plates immediately, seed fewer than 100,000 cells per well.\nAfter plating macrophages, gently rock the plate from front to back and side to side to distribute the macrophages evenly.\nIncubate at 37°C with 5% CO2 for at least 24 h.\nIf not performing the phagocytosis assay within 2 days, give the macrophages additional RPMI complete with M-CSF every two to three days of culture.\nSteps for setting up phagocytosis assay\nTiming: 1 day\nOn the day of the assay, tumor cells are washed and dissociated from their flask and plated onto macrophages. If the tumor cells are not fluorescent, then additional steps are needed to label the tumor cells before plating. Different treatments may be added prior to or during macrophage and tumor cell coculture to assess their impact on phagocytosis. Here, we include the SMAC mimetic LCL-161 and cytokines IFN-γ or lymphotoxin as agents known to induce phagocytosis of live tumor cells.1[href=https://www.wicell.org#bib1],2[href=https://www.wicell.org#bib2] The tumor cells should be as healthy as possible before being plated onto the macrophages, so keep the cells on ice during any waiting periods and try to move quickly.\nCollect tumor cells (∗optional for non-adherent cells, collect cells and start from step e).\nAspirate cell medium.\nWash tumor cell flask three times with 10 mL of PBS.\nDissociate tumor cells by adding 1 mL of trypsin 0.25% EDTA and incubating the flask at 37°C for 2–3 min.\nQuench the trypsin with 9 mL of RPMI complete and collect tumor cells into a 15 mL conical tube.\nCentrifuge at 400 × g for 5 min at 4°C.\nAspirate supernatant.\nResuspend tumor cells in 10 mL of HBSS.\nCentrifuge at 400 × g for 5 min at 4°C.",
    "Repeat steps f-h for two additional washes. During the second wash, take a small aliquot of the resuspended cells and count using a hemocytometer.\nOptional: If the tumor cells do not have a fluorescent marker, stain the cells with CFSE or other dye after counting. We typically use CellTrace CFSE or CellTrace Violet (CTV) for staining. Prepare CFSE or CTV as per the manufacturer’s protocol. Dilute CFSE/CTV in HBSS to a final concentration of 2 μM for CFSE or 5 μM for CTV. Pre-warm this HBSS-CFSE/CTV solution in the 37°C water bath until ready for staining. After three washes of the tumor cells with HBSS, resuspend the tumor cells at 1 million cells/mL in the HBSS-CFSE/CTV solution and place the cells in the 37°C water bath for 5 min (CFSE) or 20 min (CTV). Centrifuge at 400 × g for 5 min at 4°C and aspirate the HBSS-CFSE/CTV. Wash the cells three more times in ice-cold HBSS.\nPrepare cells for plating.\nNote: The optimal tumor cell to macrophage ratio per well is 1:1, although other ratios may be used. If there are approximately 100,000 macrophages per well, prepare to plate at least 100,000 tumor cells per well – increase this tumor cell number based on the macrophage density. Do not exceed 500,000 cells total per well in a 12-well plate.\nDetermine the resuspension volume for the tumor cells such that there is the desired number of tumor cells per well in a final volume of 1 mL per well. Resuspend cells in RPMI complete supplemented with the appropriate recombinant M-CSF.\nKeep the cells on ice until ready for plating.",
    "Note: If you are adding treatment during the coculture, make both the tumor cell resuspension and the treatment solution at 2× the final concentration, then add 500 μL of each to the wells. To make treatment solutions, first prepare RPMI complete with the species-specific M-CSF. Add in treatments at 2× the desired final concentration. These treatments can be prepared while the tumor cells are being washed.\nOnce the tumor cells and treatment media are ready for plating, aspirate the supernatant from the 12-well plates with reseeded macrophages.\nOptional: If the macrophages are pretreated, wash the 12-well plates three times with PBS before adding tumor cells. In order to avoid detachment of the macrophages, tilt the plate at a 45° angle to gently aspirate the supernatant from the side of the well and slowly pipet 1 mL of PBS onto the side of each well.\nPlate tumor cells onto the macrophages.\nPrepare three replicate wells for each condition tested.\nIf there is no treatment in the coculture, add 1 mL of the 1× tumor cell solution into each well of macrophages.\nIf there is treatment in the coculture, first add 500 μL of the 2× tumor cell solution and then add 500 μL of the 2× treatment solution into each well.\nRemember to include a macrophage-only well and a tumor cell-only well as negative controls to help set the flow cytometry gates.\nAfter plating, gently rock the plate from front to back and side to side to distribute the cells evenly.\nIncubate at 37°C with 5% CO2 for 18–24 h.\nPhagocytosis assay harvest and analysis\nTiming: 2 h",
    "After 18–24 h of coculture, the cells are ready to be collected, stained, and fixed for flow cytometry. The cells are dissociated from each well, collected into flow tubes, and stained for CD45 to identify the macrophages. The samples are then fixed and can be processed on a flow cytometer. All of the following steps can be performed on the benchtop.\nPrepare flow cytometry tubes with 2 mL of HBSS for each well of the assay.\nPipet the 1 mL of supernatant from each well into the corresponding tube. This collects any non-adherent cells.\nAdd 1 mL of trypsin 0.25% EDTA into each well.\nIncubate plates for 15 min at 37°C.\nCollect the trypsinized cells into the corresponding flow tubes.\nThe plates and tubes should be kept on ice during this process.\nHold the plate at a 45° angle. Try to aim the pipette at different spots around the circumference of the well while pipetting up and down. The same tip can be used for wells of the same condition (troubleshooting 1[href=https://www.wicell.org#troubleshooting]).\nCheck the plates under the microscope to ensure full collection of cells.\nCentrifuge at 400 × g for 5 min at 4°C.\nPrepare flow stain.\nFor human cells, prepare 100 μL of FACS buffer with 1 μL of anti-human CD45 antibody for each sample with fewer than 0.5 million cells. For mouse cells, prepare 50 μL of FACS buffer with 0.2 μL of anti-mouse CD45 antibody for each sample with fewer than 0.5 million cells.\nDecant the supernatant from the flow tubes without disturbing the pellets.\nAdd flow stain to the appropriate tubes and briefly vortex the tubes.\nStain for 15 min on ice, covered from light.\nAdd 200 μL of 1% formalin to each tube to fix.",
    "Keep tubes at 4°C, covered from light, until ready to analyze on a flow cytometer (troubleshooting 2[href=https://www.wicell.org#troubleshooting] and 3[href=https://www.wicell.org#troubleshooting])."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Flow Cytometry",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}