{
  "id": 17650,
  "origin_website": "Jove",
  "title": "Assessing Whole-Body Lipid-Handling Capacity in Mice",
  "procedures": [
    "Animals are housed in standardized conditions following animal-care and experimental protocols approved by the Institutional Animal Care and Use Committee of the Baylor College of Medicine (BCM). Animals are fed a standard or special diet, water ad libitum, and kept with a 12-hour day/night cycle.\n1. Measuring of fasting serum lipids\nTransfer mice to a new cage after 5 PM and fast with free access to water, overnight (with around 16 hours of fasting before the experiment). The overnight fasting ensures complete emptying of the mice’s gastrointestinal tracts.\n\tNOTE: Mice eat their feces during fasting, so food withdrawal cannot ensure they are adequately fasted.\nThe next morning, grasp the mouse by the tail and place it on a surface. Pull back gently on the tail of the mouse to place the mouse in the restrainer. Place the nose restraint to retrain the movement of the mouse while still allowing the mouse to breathe. Tighten the knob of the nose restraint. Monitor chest movements to make sure the animal is breathing normally and minimize the time a mouse spends in restrainers.\nMake a superficial incision (nick) in the tail vein of the free-moving mouse, and draw 25 µL of blood from the incision into a glass capillary (filling about 1/3 of the capillary) without restraining the mouse. Quickly blow the blood into a microcentrifuge tube.\nStop the bleeding using styptic powders, refill the feed in the cage, and make sure the mice show no signs of stress.\nComplete the blood withdrawal for all the mice.\nAllow the blood to clot by leaving it undisturbed at room temperature for 1 hour. Spin the clotted blood samples at 2,000 x g at 4 °C for 10 minutes in a refrigerated benchtop microcentrifuge, and transfer supernatant (serum) for analysis.",
    "NOTE: Serum can be stored at –20 °C for several weeks until analysis. For long-term storage, keep the serum at –70°C.\nAnalyze each lipid metabolite using the manufacturer’s provided protocol.\n2. Oral Intralipid Tolerance Test\nAfter 5 PM, weigh the mice for the calculation of the intralipid volume to be given to them the next day. Then, transfer the mice into a new cage and fast them overnight (16 hours).\nThe next morning, mark tails of the mice housed in one cage to help identify them in the subsequent bleeding steps.\nMake a nick in the tail vein and draw 15 µL of blood from the incision into a glass capillary (filling about 1/5 of the capillary), and quickly blow the blood into a microcentrifuge tube for T = 0 serum.\n\tNOTE: There is no need to stop the bleeding during the assay unless the mice show excess bleeding.\nGavage mice 20% intralipid using an 18G gavage needle at a ratio of 15 µl per gram of bodyweight, using the pre-fasting bodyweight. Stack each mouse by 1 minute.\n\tNOTE: Weigh the animal and determine the appropriate gavage needle size. Generally, an 18 gauge gavage needle is appropriate for mice >25 g, and a 20-22 gauge gavage needle would be more appropriate for smaller animals. Scruff the mouse, grasping the skin over the shoulders to hold the animal’s head in place. Place the gavage needle in the mouth and then gently advance along the upper palate, until the esophagus is reached. The tube should pass without resistance. Once proper depth is reached, the Intralipid can be slowly administered. Gently remove the needle following the same angle during needle insertion after administrating the Intralipid. Return the animal to the cage and monitor for signs of labored breathing or other distress.",
    "NOTE: Researchers who are inexperienced with oral gavage or tail bleeding techniques can stack each mouse by 2 minutes or even longer.\nDraw blood at T = 1, 2, 3, 4, 5, and 6 hours: Draw 15 µL of blood (1/5 capillary) per mouse through tail bleeding, and quickly blow the blood into a microcentrifuge tube.\nSpin the blood samples at 2,000 x g at room temperature for 10 minutes in a microcentrifuge. Transfer the supernatant, including the floating fat layer, to a PCR tube for storage. The supernatant can be stored at –20 °C for several weeks until analysis.\n\tNOTE: The supernatant should be plasma. If some samples have already clotted by the time of centrifugation, it does not affect triglyceride measurement.\nAfter the last blood collection, stop the bleeding using styptic powders, refill the feed in the cage, and make sure the mice show no signs of extreme stress.\nLoad 2 µL of triglyceride standard and collected supernatants into a 96-well plate.\nAdd 200 µL of triglyceride reagent and let the plate incubate for 5 minutes at 37 °C for color development.\nMeasure the absorbance at 500 nm with a reference wavelength of 660 nm in a laboratory plate reader, and calculate the sample’s concentration.\n3. β3 Adrenergic Receptor Agonist CL 316,243 Stimulated Lipolysis Assay\nPrepare CL 316,243 as a stock solution of 5 mg/mL (50x) in sterile saline, and store at –20°C until use.\nIn the morning, weigh the mice to calculate the amount of diluted CL 316,243 solution needed for the experiment. The mouse will receive 10 µL per gram of bodyweight of diluted CL 316,243, for a final dose of 1 mg/kg bodyweight.\nTransfer the mice into a new cage with free access to water, and fast them for 4 hours.",
    "Make enough 1x CL 316,243 solution from 50x stock using saline. The final concentration of 1x CL 316,243 solution is 0.1 mg/mL. Use saline for the control treatment group.\nMark the tails of the mice housed in the same cage for easy identification during the bleeding steps.\nMake a nick in the tail vein, and draw 15 µL of blood from the incision into a glass capillary (filling about 1/5 of the capillary), and quickly blow the blood into a microcentrifuge tube for T = 0 sample.\n\tNOTE: There is no need to stop the bleeding during the assay unless the mice show excess bleeding.\nInject diluted CL 316,243 solution (or control if included in the experiment) intraperitoneally at a volume of 10 µL/g bodyweight. Stack each mouse by 1 minute. Use a maximum of 5 mice for each 60-minute experiment, or 10 mice for a two-person team.\nDraw blood at T = 5, 15, 30, 60 minutes: draw 15 µL of blood (1/5 capillary) per mouse through tail bleeding.\nAfter the last blood collection, stop the bleeding using styptic powders, refill the feed in the cage, and make sure the mice show no signs of extreme stress.\nSpin blood samples at 2,000 x g at 4 °C for 5 minutes in a refrigerated microcentrifuge. Transfer the supernatant to a PCR tube for storage. The supernatant can be stored at –20°C for several weeks until analysis.\nLoad 1 µL of 2x serially diluted glycerol standards (0.156, 0.312, 0.625, 1.25, and 2.5 mg/ml Trioleine-equivalent concentrations) and collected supernatants into a 96-well plate. Add 100 µL of free glycerol reagent, and let the plate incubate for 5 minutes at 37 °C for the color to develop.\nMeasure the absorbance at 540 nm using a laboratory plate reader, and calculate the sample’s concentration.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}