{
  "id": 4947,
  "origin_website": "Bio",
  "title": "Mouse BMDC-dependent T Cell Polarization Assays",
  "procedures": [
    "Note: The protocol outlined below has been adapted from Satchidanandam et al. (2014). Bone marrow cell isolation for BMDC culture (all steps to be performed at room temperature) (Figure 1)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205073302_6674.jpgFigure 1. Bone marrow cell isolation for BMDC culture. The figure shows the X-ray picture of a mouse hind limb. The femur and tibia are labelled, The points where the bones have to be cut during the initial dissection are clearly marked by arrows..We used female BALB/c mice bred in-house in the Institute’s central animal facility. Use of mice (and any other animals) requires prior approval by the Institutional Animal Ethics Committee. The studies were carried out in strict accordance with the Institutional Animal Ethics Committee-approved protocols of the Indian Institute of Science for mouse experiments (CAF/Ethics/220-2011 dated February 10, 2011). For details of Animal Ethics guidelines, please refer to Animal Research: Reporting In Vivo Experiments (ARRIVE) guidelines (https://www.nc3rs.org.uk/arrive-guidelines). Mice were administered inhalation anesthesia with chloroform and euthanized by cervical dislocation.Handle the mice gently and avoid making the animals edgy before they are sacrificed. Using dissection tweezers and dissection scissors remove the skin on the lower abdomen and both legs (Video 1). This will expose both legs from the hip down to the metatarsals. Proper removal of the skin at this point will prevent contamination of cultures with epidermal cells. Begin by separating the muscle along the entire leg from the skin. Then proceed by using the tweezers to stabilize the leg while removing the muscle with scissors and scalpel blade.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Dissect mouse leg Remove the femur and tibia as follows:Make one cut at the hip. Be sure to keep as much of the epiphysis intact as possible on the femur. To do this, position the scissors as close to the hip as possible while cutting (Figure 1).",
    "Make the second cut below the ankle joint, again being careful to leave the epiphysis intact (Figure 1).Place the harvested femur and tibia (should still be connected at the knee-joint) in a sterile Petri plate in about 5 ml of IMDM containing Penicillin and Streptomycin. Use bacteriological Petri dishes with lid.Remove all the flesh clinging to the bones using a scalpel blade, scissors and forceps (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Clean bones Transfer bones to a new Petri dish with fresh medium with antibiotics. Repeat removing flesh sticking to bones if necessary. Collect bone marrow under sterile conditions (Video 3). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Flush bone marrow Using a scissor first find the site of intersection between the femur and tibia and then very gently separate them from each other. Avoid exposing marrow by cutting off either femur or tibia during this process.For flushing out the marrow use different size needles for femur and tibia. For tibia use a 26 or 24 gauge needle and for femur-use a 21 gauge needle. Fill a sterile 5 ml syringe with about 5 ml of IMDM. Place a 26 gauge needle on the end of the syringe and keep ready for the next step. Prepare a fresh sterile non-treated Petri-dish to collect flushed bone marrow in the next step.Hold the bone with sterile tweezers and using a scissor gently pull each epiphysis off or cut off epiphysis to expose the bone marrow. (Avoid placing the cut bone back into the Petri place after cutting to avoid loss/leaching out of bone marrow.)Hold the cut bone over a sterile Petri dish and puncture the centre of the bone ends with the needle. It should slide in easily if it is in the center. Slowly flush out the bone marrow with sterile IMDM + antibiotics.",
    "If necessary, move the needle up and down in the bone. Repeat this process at the other end of the bone if necessary. Do not break the bone. The bone should appear white or translucent when it is clean.Repeat this procedure for the other bones. Do not use medium containing flushed marrow cells to repeat flushing of bones. Always suck up fresh medium into the syringe for each flush.Discard each bone once clean.Ensure that the bones are always kept submerged under complete IMDM as you handle one bone at a time. To cut open the ends of the bones, use a good sharp pair of scissors and avoid generating splinters. These fine bone pieces are extremely difficult to separate from the cells of the marrow. The differentiating BMDC will engulf them and undergo premature activation.Once the clumps of cells have been suspended by repeated trituration with a pipette, transfer the cells to a sterile 50 ml conical tube. Let the cell suspension in a volume of about 40 ml, stand in a conical 50 ml tube for 5 min. Use a pipette to aspirate the top 35 ml, leaving behind debris and cell clumps. These clumps can be once again triturated to obtain more cells in suspension. You may alternately filter the cell suspension through a 70 µm filter to remove clumps.BMDC culture RBC Lysis. This step is extremely critical and should be carried out with great care. Excessive exposure to the lysis buffer can kill all cells.Spin cells at 1,000 x g, 10 min at room temperature (RT).Collect supernatant after centrifugation in a clean tube. Do not discard. Check this supernatant for cells. This should not have more than a total of 2-4 million cells. Very gently dislodge cell pellet into a thick slurry by gentle repeated tapping.",
    "Add 1 ml RBC lysis buffer for 50 million cells. Mix well to suspend the cells by gentle tapping. Incubate at RT, exactly 1 min 30 sec.Rapidly bring total volume up to 25 ml (add 24 ml) with plain IMDM and spin at 1,000 x g, 15 min at RT.Decant supernatant, gently re-suspend cell pellet and add fresh 20 ml IMDM, mix well to wash off any traces of RBC lysis buffer, and pellet cells once again at 1,000 x g, 15 min at RT.Decant supernatant, gently re-suspend cell pellet and add 10 ml complete IMDM without GMCSF. Usually, from one mouse, total bone marrow cell yield is 40-70 million cells. Count cells and increase volume if required.Bone marrow cells were cultured in IMDM-10% FBS containing 2 mM β-mercapto-ethanol essentially according to standard published protocols with 50 U/ml murine rGM-CSF. Some protocols call for 200 to 800 U/ml GM-CSF. We have found these high concentrations give rise to mature BMDC with high surface expression of MHCII and CD86. Standard antibiotics Penicillin-Streptomycin (10,000 U/ml) may be included at recommended concentrations. Seed 0.5 to 1.0 million cells per 35 mm dish in a volume of 3 ml.50% of the culture medium was removed and replenished every two days. Non-adherent cells were harvested on day 7. One can get 1 to 2 million cells for every million cells seeded on day 0. Harvested cells were analysed by flow cytometry using phycoerythrin (PE)-conjugated antibodies against MHC-II, CD80 and CD86, individually in combination with FITC conjugated anti-mouse CD11c antibody to determine the percentage of immature dendritic cells which were then used for all experiments. A simple flow cytometer with an Argon ion (blue) laser will suffice to detect these two fluors. In mice, all subsets of DC express CD11c.",
    "Immature dendritic cells will express intermediate levels of MHC-II, CD80 and CD86. In most preparations, a small proportion, about 2 to 5% of the BMDC by day 7 will also express high levels of these co-stimulatory molecules. We normally obtain 60 to 85% cells being CD11c-positive by day 7. When high purity is required, we purify the CD11c-positive cells using mouse CD11c microbeads from Miltenyi Biotech according to manufacturer’s instructions.The BMDC thus obtained were infected at 5 multiplicity of infection (MOI) with Mycobacterium bovis BCG for 24 h. BMDC may also be incubated with other protein or peptide antigens; optimum incubation times required will need to be determined for each antigen.T cell polarization assaySplenocytes were isolated from BCG-immunized mice by dissecting the abdomen and removing the spleen within the biosafety cabinet to maintain sterility. The splenocyte suspension is prepared by forcing IMDM into the spleen tissue using a 20 ml syringe and 21 gauge needle. You may also gently press down on the spleen a few times using the flat rear end of a sterile syringe to release splenocytes into the surrounding medium. After counting the cell suspension, splenocytes are collected by centrifugation of the suspension at 1,300 x g for 10 min. RBC lysis was carried out for splenocytes exactly as described for bone marrow cells.20 million splenocytes were then incubated in 10 ml complete IMDM for 2 h at 37 °C in 10 cm diameter cell culture dishes. Non-adherent cells were then collected for the assay.For syngeneic polarization studies, the above mentioned infected BMDC were killed by 50 µg/ml mitomycin C treatment for 1 h followed by extensive washing.",
    "BMDC were co-cultured in 200 µl volume in 96 well plates in triplicate with 5 x 105 non-adherent splenocytes per well from BALB/c mice infected intraperitoneally 3 weeks previously with 5 x 108 Mycobacterium bovis-BCG, at varying BMDC: splenocyte ratios of 1:10, 1:20 and 1:100 for 72 h. You may alternately kill infected BMDC by gamma irradiation (15 Gray) if you have access to this machine. Place the harvested BMDC in complete IMDM in a round bottom sterile snap cap tube and place inside the gamma irradiator. Control uninfected BMDC were also cultured with splenocytes similarly.After 72 h of co-culture of non-adherent splenocytes and killed BMDC, supernatants were collected for cytokine measurements. Identity of cytokine secreting cells can be determined by intracellular cytokine staining and flow cytometry. We routinely measured by ELISA, the cytokines IFN-γ, IL-4 and IL-17 to detect polarization of T cells to give TH1, TH2 or TH17 cells, respectively.Con-A stimulation of non-adherent splenocytes at 5 µg/ml was included as positive control. Intracellular cytokine-staining and flow cytometry to detect TH17 cells106 non-adherent splenocytes were cultured with 104 or 5 x 103 irradiated BMDC In 24 well tissue culture plates in triplicate wells.10 h later, 10 µg/ml brefeldin A and 0.75 µM monensin were added for the next 26 h of culture. At the end of 36 h, harvested splenocytes were washed once with PBS-0.05% azide, and surface stained for CD4 (CD4-PE; clone GK1.5), CD25-PE-Cy7 (clone PC 61.5) and CD3-FITC (clone 145-2C-11) from BD Biosciences in PBS-1% BSA, washed with PBS-0.05% azide, fixed for 10 min. with 2% paraformaldehyde in 1x PBS and permeabilized in 500 µl of PBS-0.05% sodium azide -1% BSA with 0.1% saponin for 30 min. Intracellular IL-17 was detected using, IL-17-APC in PBS-0.05% N3-1% BSA with 0.1% saponin for 30 min on ice.",
    "Stained cells were washed once with 1 ml PBS-0.05% sodium azide - with 0.1% saponin.Stained and washed cell pellets were suspended in 100 µl PBS-0.05% sodium azide containing 1% paraformaldehyde, held on ice for 15 min. and diluted to 400 µl with PBS-0.05% azide.Samples were acquired on a BD FACS-Canto-II flow cytometer. Any flow cytometer with a blue (argon ion, 488 nm) and red (633 nm) laser will be suitable to detect this combination of fluors.IL-17 producing cells within the CD3-high, CD4-high and CD25-low population were enumerated.Identity of IL-17 producing cells was confirmed by using an isotype control antibody and more importantly, by staining with a fluorescence minus one (FMO) control missing the IL-17-APC antibody.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205073338_7971.jpgFigure 2. Gating strategy to detect IL-17 secreting T cells. Splenocytes stained as described were displayed on a linear FSC vs. SSC plot and the gate shown was applied to pick up all lymphocytes. Cells staining positive for CD3 from within this population were further selected and displayed for IL-17 and CD25. IL-17-positive cells within the CD25-low subset represent the true TH-17 subset of T cells."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}