{
  "id": 1944,
  "origin_website": "Cell",
  "title": "Calcium imaging and BAPTA loading of amygdala astrocytes in mouse brain slices",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCalcium imaging of astrocytes\nTiming: 3–7 h\nAstrocytes, as with any glial cell, do not fire action potentials. However, they do exhibit calcium-based excitability in certain contexts (Charles et al., 1991[href=https://www.wicell.org#bib2]). For instance, the cytosolic calcium concentration of astrocytes increases in response to many types of stimuli such as neurotransmitter signaling, mechanical stimulation and variations in pH (Khakh and Benjamin, 2019[href=https://www.wicell.org#bib5]). The following protocol describes a method to monitor these calcium fluctuations in astrocytes.\nFollow the initial steps (1–10) for slice preparation, as described in the preparation section above.\nTransfer the slices into an aCSF filled recording chamber (see key resources table[href=https://www.wicell.org#key-resources-table]) connected to a peristaltic pump that provides a continuous flow of oxygenated aCSF (∼2 mL/min) at room temperature (or any temperature as needed by the experiment).\nPlace a holding harp on top of the slice to prevent movement.\nNote: make sure that the strings of the harp are not too close to the recording site. Otherwise, it will bend your slice and thereby prevent consistent focus with the microscope.\nUse an Axio examiner Zeiss microscope (or Olympus BX51WI Japan for example) with a 4× objective to identify your region of interest. Set the microscope to infrared differential interference contrast (IR-DIC, ʎ = 750–790nm) and visualize the image with the uEye cockpit software (or Andor iQ 3.2 for example).\nNote: Use an appropriate atlas to identify landmarks that will help you locate your structure of interest.\nSwitch to a 40× water-immersion objective and find the surface of the slice.\nOpen the MetaFluor software and click the “Configure” menu to set the following parameters:\nSpinning disk pinhole diameter: 70 μm.\nSpinning disk rotation speed: 15.000 rpm.\nWavelength: 575 nm for SR101, 475 nm for OGB.",
    "Exposure time: 20 ms for SR101, 80 ms for OGB.\nIllumination intensity: 220 μW for SR101, 580 μW for OGB.\nExposure time: 20 ms for SR101, 80 ms for OGB.\nSampling frequency: 2 Hz (500 ms interval between acquisitions).\nCritical: Before switching on the fluorescent light, do not forget to put your microscope in confocal mode. The high intensity of the wide-field mode will bleach the calcium indicator.\nCritical: Finely tune your illumination time and intensity to avoid fluorescence bleaching. To do so, we recommend starting at an illumination intensity of 0 μW and an illumination time of 20 ms then progressively increase both values. In our hands, we typically set the illumination intensity between 580 μW and 1040 μW and find that good OGB1 loading can be seen at an illumination time of 20 ms. We never illuminate more than 100 ms.\nCells labeled with SR101 are astroxcytes.\nFind a focal plane that includes several of them (Figure 3[href=https://www.wicell.org#fig3]A & Method video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1426-Fig3.jpg\nFigure 3. Expected results from a calcium imaging experiment\n(A) Stacked picture of SR101 staining (left), OGB1 staining (middle) and the merge of both labels (right). Scale bar = 50 μm.\n(B) Pseudo-colorized images showing the increase of fluorescence after application of an OTR agonist (TGOT 1 nM 10 s duration) on OGB1-loaded astrocytes. Upper panel: SR101 staining; middle panel: basal OGB1 fluorescence; lower panel: OGB1 intensity after application of an OTR agonist (TGOT 1 nM, 10-s duration). Scale bar = 50 μm.\n(C) Traces of OGB1 fluorescence over time. The blue bar represents the application of TGOT 1 nM 10-s duration.",
    "(D) Quantification of the effect of TGOT 1 nM on astrocytic activity. From left to right: variation of AUC, frequency, calcium transient height, half-max full width (FWHM), and proportion of responsive cells after TGOT application. The gray histograms represent baseline values and the blue histograms represent the quantification of the TGOT effect. Data are represented as mean ± SEM. ∗∗∗p < 0.001, Paired t test.\n    Your browser does not support HTML5 video.\n  \nMethod video S1. Visualization of the effect of BAPTA loading in astrocytes using calcium imaging, related to step 4–8 of “Calcium Imaging of astrocytes” and to step 14–21 of “Patch-clamp-mediated BAPTA loading of astrocytes”\nCheck the shape of the cells: a healthy cell must have a ramified morphology with observable proximal processes (Figures 3[href=https://www.wicell.org#fig3]A and 3B). If the cells exhibit a round, swelled shape, it may indicate that these cells are dead or dying. If so, refer to Troubleshooting[href=https://www.wicell.org#troubleshooting].\nYou can observe 3 kinds of cells: (1) the ones that are labeled with both markers (SR101 and OGB, yellow merge in Figure 3[href=https://www.wicell.org#fig3]A), indicating that astrocytes are well loaded with both indicators; (2) the cells SR101 negative, that are probably neurons; and (3) cells labeled with SR101 but that are OGB1 negative.\nNote: In this last configuration, try to run the experiment anyway, the labeling is maybe too weak to be seen at resting state but can be enough to detect calcium transients. If you did not see any variation of the OGB1 fluorescence, refer to Troubleshooting[href=https://www.wicell.org#troubleshooting].\nNote: To guarantee a good signal/noise ratio, you must adjust the focal plane in such a way as to both see the cell and distinguish the proximal processes.",
    "Click on “Save pictures” and choose an appropriate folder. Click on “Zero clock” and then “Start”. Your data must be saved as independent pictures in the selected folder. At the end of a 10-min recording, you should have 2400 pictures (1200 for the SR101 channel and 1200 for the OGB1 channel).\nNote: Because the files produced are very large, be sure that you correctly set the sampling frequency regarding the event you want to observe. The sampling frequency should be at least twice as high as the maximal frequency of the events recorded (see Nyquist-Shannon theorem). For somatic global calcium transients that last for more than 2 seconds, a 2 Hz sampling frequency is sufficient. In our hands, a 10-minute recording at 2 Hz results in an individual picture size of ∼1 MB (∼2.4 GB of pictures in total).\nAt the desired time, apply a drug or any kind of stimulation to see if it changes astrocyte calcium activity. We apply an oxytocin receptor agonist, the TGOT at [1 nM] for 10 s through the perfusion system (Figures 3[href=https://www.wicell.org#fig3]B–3D).\nNote: If your perfusion aCSF is in a close loop, be sure to discard the solution for ∼5 minutes to avoid contamination of your clean aCSF stock.\nPatch-clamp-mediated BAPTA loading of astrocytes\nTiming: 3–7 h",
    "Astrocyte communication is largely based on intracellular calcium signaling (Khakh and Benjamin, 2019[href=https://www.wicell.org#bib5]). Thus, blocking these transients using calcium chelators will inhibit astrocytic activity. As astrocytes create a large network interconnected via gap junctions, loading a chelator in just a few astrocytes is sufficient to block calcium transients across a local network. Thus, this approach can be used to observe the effects of blocking calcium-dependent astrocyte communication on the activity of a nearby neuronal network. In this section, we describe the detailed steps needed to perform patch clamp on an astrocyte and the protocol used to load BAPTA into the astrocytic network. This experiment can also be performed with other calcium chelators such as EGTA, but we choose to use BAPTA because its binding kinetics is ∼40 times faster than EGTA, allowing for the blockade of local and rapid calcium transients (Naraghi and Neher, 1997[href=https://www.wicell.org#bib8]).\nOptional: this protocol can be used in combination with the calcium imaging of astrocytes. If you intend to do so, please follow the ‘optional’ steps such as this one that indicates what steps are required from both protocols.\nFollow the initial steps (1–10, except step 9) for slice preparation, as described in the preparation section above.\nOptional: If you intend to perform BAPTA loading together with calcium imaging, follow the initial steps (1–10, including step 9) for slice preparation, as described in the preparation section above.\nTransfer the slices into an aCSF filled recording chamber connected to a peristaltic pump that provides a continuous flow of oxygenated aCSF (∼2 mL/min) at room temperature (or any temperature as needed by the experiment).",
    "Use an Axio examiner Zeiss microscope (or Olympus BX51WI Japan for example) with a 4× objective to identify your region of interest. Set the microscope to infrared differential interference contrast (IR-DIC, ʎ = 750–790 nm) and visualize the image with the uEye cockpit software (or Andor iQ 3.2 for example).\nSwitch to a 40× water-immersion objective and find the surface of the slice.\nNote: At this point, you should visualize the cells with infrared illumination to verify that the slice is ‘healthy’. Check that there are no or only a few dead cells, which can be discriminated by their round shape and absence of clear edges.\nVisualize SR101 labeled astrocytes by illuminating the slice with yellow ∼575 nm light. Once you identify your shining star (i.e., the cell you want to patch), do not adjust the microscopic stage position (in neither the x nor y-axes) or you may lose track of it (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1426-Fig4.jpg\nFigure 4. Patch-clamp mediated BAPTA loading in astrocytes\n(A) Pseudo-colorized images showing SR101 (top) and OGB1 (bottom) at the beginning of the recording (left), after 15 min (middle) and 35 min (right) of recording. The white lines represent the pipette. The three arrows indicate the signals of the cells shown in (B). Scale bar = 50 μm.\n(B) Raw signals showing the evolution of OGB1 fluorescence from the same three cells shown in A that were recorded for 40 min. At 5 min, the patched cell membrane is ruptured (orange).\n(C) Example of current step (CS) realized during the recording in (B). Left: command step of the CS: 15 steps of 100 ms starting at −100 pA and incremented by 50 pA. Right: membrane potential of the astrocyte recorded in response to the CS.",
    "(D) Quantification of the effect of BAPTA loading in astrocytes. Left: Quantification of the area under the curve (AUC) of calcium measurement in astrocytes. This value is expressed in relative fluorescence unit2 (RFU2). Right: Quantification of calcium transients in astrocytes. The astrocyte membrane is ruptured at 5 min. The red points indicate the values for patched astrocytes and the black ones for neighboring cells. Data are represented as mean ± SEM.\nNote: One should keep several considerations in mind when choosing a cell to patch: (1) Deep cells are harder to visualize and are more easily disrupted by the pipette-induced movement of the tissue above. (2) A healthy cell is not round. (3) Bigger cells are easier to patch.\nOptional: If you intend to perform BAPTA loading together with calcium imaging, also refer to step 5 and 6 and try to find several healthy astrocytes in the same stage position.\nNote: In uEye Cockpit, press ‘Ctrl + right click’ to place a marker on the screen. This will help you return to the cell more easily. Alternatively, place a small chunk of putty (e.g. Play Dough) on the screen for each target cell.\nTo get a pipette above the slice:\nRaise the objective far away from the slice, while still keeping the lens submerged in the solution.\nTake a pulled pipette (borosilicate glass; outer ∅: 1.5 mm; inner ∅: 0.86 mm; length: 7.5 cm, see key resources table[href=https://www.wicell.org#key-resources-table]) previously filled with the internal solution.",
    "Note: To create a pipette filler: place a pipetman tip on a 1 mL syringe. Use a flame to heat the tip and pull it until it is thin enough to enter the pipette, blow air into it with the syringe while doing this to avoid clogging. Use a razor blade to cut the end of the pulled tip and then verify that it is not blocked by pushing water through it. If the water does not flow through the tip, replace it and start over. It may take several attempts to obtain a working tip (see Figure 1[href=https://www.wicell.org#fig1]D for an example of how it should look).\nInsert the pipette onto the AgCl electrode.\nPut positive pressure (about 1 mL of air with a syringe). This will help avoid clogging your pipette while moving through the tissue. Position the pipette in the bath using the manipulator.\nIf you are using pClamp, use the membrane test to determine the resistance of the pipette (if the signal is drifting, see troubleshooting[href=https://www.wicell.org#troubleshooting]). Otherwise, in voltage-clamp, apply a voltage step of 5–10mV and measure the current transients to calculate the pipette’s resistance using Ohm’s law. It must be ∼6 ± 2 MΩ (see troubleshooting[href=https://www.wicell.org#troubleshooting] for more details). A lower value means the tip is too large (or broken) and a higher value means the tip is too thin. In either case, it will be difficult to patch a cell.\nNote: The instruction manual of your pipette puller contains helpful instructions on how to pull the pipette to achieve the desired resistance.",
    "Under infrared light, bring the pipette tip under the objective using the micromanipulator. Move the pipette along the x and y axes until you see a shadow moving on the screen of the computer and then adjust the objective to focus on it. Then, move the pipette until the tip is in focus.\nNote: While positioning the pipette tip, it is important to continuously monitor both the computer screen and the actual pipette to ensure the tip does not hit any obstacles (e.g. the objective).\nCritical: Once the pipette is in the bath, extreme caution must be used when moving it along the z-axis. Uncontrolled movement of the pipette can result in damage to both the tissue and the recording chamber.\nThe next goal is to safely lower the pipette just above the slice.\nFirst, lower the objective.\nThen lower the pipette until you can see it again.\nRepeat this sequence until you are just above the slice.\nNote: you cannot go all the way down with the objective because you will bend/break the pipette and you cannot go down only with the pipette because you will not know when you will be near the tissue.\nOnce you are just above the tissue.\nPosition the pipette tip above the targeted cell, slightly to its side.\nSwitch the microscope channel to see the fluorescent labeling of astrocytes.\nLower the pipette down into the tissue until you are on the same level as the top of the target cell.\nMove the pipette toward the cell (see Method video S1[href=https://www.wicell.org#mmc1]).\nNote: To make positioning of the pipette easier, you can move the objective up and down to help identify your current location within the tissue.\nNote: Usually, it is easier to approach the cell diagonally.",
    "Two indicators can be used to confirm you are on the target cell.\nThe first is visual: the positive pressure within the pipette creates a visible deflection (dimple) on the membrane.\nThe second indicator is the pipette resistance: when you get close enough to the cell, the tip of the pipette becomes enclosed by a pocket of membrane and thus increases the resistance. You can expect an increase of about 0.2 MΩ–1 MΩ (see Method video S1[href=https://www.wicell.org#mmc1]).\nRelease the positive pressure (this increases the resistance as more membrane enters the pipette).\nNote: When releasing the positive pressure, the resistance should increase up to at least 15–20 MΩ. The better the pipette is positioned on the cell, the higher the resistance will go (sometimes even directly up to gigaseal).\nGently apply negative pressure by mouth until you achieve a gigaseal (i.e., a pipette resistance of several GΩ).\nNote: After reaching 100 MΩ, start holding the potential at the desired membrane potential value (−80 mV), this will help reach the gigaseal.\nNote: Astrocytic membranes are much more fragile than neuronal membranes. If you are accustomed to patching neurons, then be extra gentle during seal formation and membrane opening.\nOptional: To confirm that calcium has been correctly chelated by the BAPTA in the patched cell, start the calcium imaging (see step 7) once the giga seal is reached. Wait 5 min before opening the cell.\nWhen the gigaseal is reached, apply negative pressure in the pipette by repetitive suctions until the membrane opens.",
    "If the astrocyte opens correctly, you will see capacitive transients and the resistance will drop by several tens of MΩ. You can also look at the calculated membrane resistance by clicking the “Cell” button on pClamp. This resistance must be ∼20 MΩ for astrocytes and ∼200 MΩ for neurons in the central amygdala.\nOptional: If you are performing calcium imaging at the same time, you should see a drop in the fluorescence of the patched cell (Figure 4[href=https://www.wicell.org#fig4]B & Method video S1[href=https://www.wicell.org#mmc1]).\nSwitch to current-clamp mode to check the resting membrane potential, which should be around −80/−90 mV.\nApply current steps of 15 steps starting at −100 pA incremented by 50 pA and lasting 100 ms each. This is to verify that the patched cell is truly an astrocyte.\nThus, the membrane potential should have increased to at least −30 mV and you should not have seen any action potentials (Figure 4[href=https://www.wicell.org#fig4]C).\nNote: If the patched cell is a neuron or even if you just patched a presynaptic terminal, you should see action potentials (Bischofberger et al., 2006[href=https://www.wicell.org#bib1]).\nWait 20 min (Wallraff et al., 2006[href=https://www.wicell.org#bib16]) to let the BAPTA diffuse in the astrocyte network. Monitor the access resistance regularly to make sure the membrane of the astrocyte is still open and that the astrocyte is still alive.\nOptional: If you are performing calcium imaging and patch-mediated BAPTA loading simultaneously, you will observe an immediate fluorescence quenching in the patched cell and a progressive loss of fluorescence in the neighboring astrocytes after 10–20 min. For more details, see expected outcomes[href=https://www.wicell.org#expected-outcomes] and Figure 4[href=https://www.wicell.org#fig4].",
    "Remove the pipette very slowly and carefully along the x-axis, as this is the best direction for avoiding damage to the cell. It is extremely important to avoid any damage to the cell during this step, as the goal is to reseal the membrane.\nNote: When the membrane is resealed, you should see the pipette resistance reach the GΩ range again as you will inevitably tear off a part of the membrane during removal.\nRepeat all the steps from 13 to 21 on another astrocyte located approximately one screen (200 μm) apart to ensure the efficient diffusion of BAPTA within the local network."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Molecular/Chemical Probes",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}