{
  "id": 10916,
  "origin_website": "Jove",
  "title": "Automated Measurements of Sleep and Locomotor Activity in Mexican Cavefish",
  "procedures": [
    "NOTE: Set up systems for behavioral tracking in larvae and adults.\n1. Constructing a Sleep System for Larvae\nNOTE: The monitoring system for tracking larval through juvenile fish aged 4 days post fertilization (dpf) through 30 dpf A. mexicanus requires multiple pieces of equipment including infrared (IR) lighting, acrylic IR light diffusers, automated light controls (timers), computers, cameras, and secondary materials such as wiring and power controllers (Figure 1A). The following instructions will inform how to build a system to accurately track locomotor behavior to study sleep and circadian rhythms in larval A. mexicanus. \nConstruct a lighting system consisting of IR and white light emitting diodes (LED): Place three IR lights in a triangle approximately 7.62 cm from each other on a 30.5 cm x 30.5 cm thin metal platform heatsink. Wire lights in series with electrical wire and connect to a power source.\nPlace a single white light LED in the center of the three IR lights and attach them to the power source.\nConnect the power source for the LED to a light timer set to a standard circadian time.\nConstruct a platform for larval tracking system. Use 0.33 cm thick white sign acrylic for all of the components of the platform.\nPlace the recording platform on top of the lighted square heatsink on which arenas containing fish will reside during behavioral tracking.\nPlace a second acrylic inside the box between the lights and the animals to diffuse the IR for optimal lighting and contrast.",
    "NOTE: The dimensions for the larval light box is as follows: Two 18 cm x 8.5 cm and two 17 cm x 8.5 cm LEDs that are chemically bonded together to form an 18 cm x 18 cm square that is 8.5 cm tall. Additionally, acrylic may be easily cut or drilled using the proper tools for customized sizing.\n\t\nPlace the entire larval tracking stage and lighting setup within an enclosed plastic tube, and then position the camera on top of the tube.\nNOTE: It is important to keep lighting reflections from appearing on the tracking video, as this will impair tracking accuracy. The placement of cameras on top of a tube that surrounds platform improves lighting and sharpness for the cameras that are used for these experiments.\nManipulate a webcam (see Table of Materials) for IR-based recording. Remove the manufacturer lens using a rotary tool (see Table of Materials).\nRemove the small silver screws on the back sides of the camera to remove the inner housing.\nRemove the small black screws inside the body of the camera to loosen the remainder of the lens. Use a small screwdriver to remove any portions of the lens housing that is left after cutting the lens.\nRemove the blue LED on the top part of the charged coupled device (CCD) housing.\nPut the camera back together by placing the inner housing back to its original orientation and screwing the two silver screws back to their original position.\nRoute the inside of the camera using a small saw to fit with a rounded plastic routing bit. Smooth down the extra plastic until it can fit a lens adapter.\nInstall an IR-pass filter inside the camera as close to the CCD as possible without making direct contact with the camera.",
    "NOTE: Take care not to damage the CCD chip within the housing of the camera. Be sure to keep the cut as level as possible. Seal any open space between the outside of the IR filter and the body of the camera to keep light from reaching the CCD without being filtered.\nAttach the camera to a 35 mm fixed lens (see Table of Materials) by screwing the adaptor in the front of the camera into the back of the lens.\nPlace the camera and lens in the hole drilled into the lid on top of the tube that houses the stage and lights and attach the USB to the computer the animals will be recorded from.\nNOTE: Place fish in a behavior room that is separate from where stock fish are housed to ensure minimal disruptions during behavioral recordings. Take care to minimize fluctuations in temperature and ventilation which can confound behavioral experiments.\n2. Sleep System for Adults\nConstruct an IR lighting system for tracking adult fish by cutting IR strips to approximately 46 cm intervals. One 46 cm strip is sufficient for each 10 L behavior tank.\nWire each strip together in a series, soldering each strip to DC electrical wire and attach to a 9 V power source.\nAttach each IR strip to a 51 cm x 5.1 cm piece of aluminum that will act as a heat sink.\nPlace a 46 cm x 5 cm, 0.32 cm thick 9% light-pass white sign acrylic sheet directly in front of each IR light strip to diffuse the IR light.\nPlace all tanks on a rack that supports rear-mounted IR lighting.\nUse opaque plastic dividers in 10 L glass tanks to create individual arenas.",
    "NOTE: The arena size can be varied based on the number of dividers used and the size of the tank. Arena size impacts locomotor activity and sleep in both cave and surface fish23.\nMount cameras approximately 4-6 m away from tanks. Each camera can typically record from 3 tanks at a time to provide sufficient resolution for tracking.\nNOTE: Adult behavioral recordings generally do not require a separate white lighting system to control day-night changes. Simply utilizing standard overhead lights in a behavioral room connected to a timer is likely to be sufficient.\n3. Recording Locomotor Activity\nNOTE: All behavioral recordings are made using a standard laptop computer or desktop with a backup battery source. Due to the large file size of a 24 h recording (60-100 GB), save all recordings on external hard drives.\nAcclimate fish ages 4-30 dpf for 18-24 h prior to initiating recordings. Feed larval fish with live brine shrimp when first placed in the recording chamber, and 1 h prior to beginning the recording. Acclimate adult fish 4-5 days before recording behavior and feed once daily with flake food or with live blackworms.\nNOTE: Be sure to place larval fish in fresh water prior to recording, as leftover brine shrimp will cause tracking issues during later analysis. Co-culturing with rotifers provides an alternative option, as their small size does not interfere with tracking.\nPlace fish aged 4-6 dpf in 24-well tissue culture plates. House fish aged 20-30 dpf in 12-well tissue culture plates for recording.\nRecord adults in 10 L tanks fit with dividers to accommodate five individually housed fish, or without dividers to record sleep and activity in a social setting.",
    "NOTE: Take care to focus the camera prior to initiating the recording in order to maximize tracking accuracy. Do not open the iris of the camera lens too far, as this will drastically reduce sharpness of the image. There is a balance, however; if the iris is closed too far, the frame rate of the video will fall below 15.00 fps. It is essential for later analysis that the frame rate remains 15.00 frames per s for use with some custom-written sleep script23,24.\nSet lighting/brightness background illuminations.\nOptimize lighting prior to the start of recording. Always keep the contrast at the highest level possible and use the Brightness and Background Illumination to adjust the brightness till the animals are most clear.\nRecord fish for 24 or 48 h.\nNOTE: Emergency backup battery packs that power all the lighting, computers, and cameras should be purchased in case of power outages. All battery packs should also be plugged into emergency power outlets, if possible. Battery packs will generally not power the equipment for more than a few minutes to an hour at most and serve to bridge between losing main power and transferring to the emergency power system.\n4. Analysis of Locomotor Activity in Individually Housed Fish Using Automated tracking Software\nTo begin analysis of behavior, open tracking software, select New Experiment from Template, then select Apply a Pre-Defined Template.\nAs the program will now ask what species to track, select Fish. Use the dropdown box to select either Zebrafish Larvae of Zebrafish Adult depending the experimental paradigm.",
    "Set up the arenas in which each animal will be tracked. For larvae, select Well Plate, Round Well and No Zone Template. For adults, use Open Field, Square with No Zone Template. Then determine the proper number of arenas, one for each animal being tracked in the video.\nSelect the model for optimal tracking, click on track Center-point, and be sure that the animal color is selected to be darker than the background. Apply the frame rate at which the video was acquired. The tracking software should automatically detect this.\nDraw a scale to calibrate the real-world distance of an object to accurately determine the locomotor behavior of the fish using Arena Settings.\nEdit the arenas to make sure that the entire area that the fish are in will be tracked; otherwise samples will be lost during acquisition.\nNOTE: Use care when setting up areas. Larval fish especially are sensitive to tracking errors if the arenas are either too big or small. Bad lighting in the experiment can also create shadows on the walls of well plates, which the program may think is an animal, creating a false positive.\nClick on Advanced. Under Method in Detection Setting, select Dynamic Subtraction, then click on Background and select Start Learning. Adjust the dark contrast signal/noise ratio till the animals are being tracked well, and the background is not causing the tracking to jump.\nNOTE: Video quality can vary between experiments, so each trial may need to use different settings, accordingly. Using the Subject Contour and Subject Size features can significantly improve tracking results.\nSelect Trial list and load the proper parameters before starting to record the data into the program.\nClick into the Acquisition tab, select Track All Planned Trials and click on the record button.",
    "Under Analysis Profile, make sure Distance and Time & Movement are selected.\nNOTE: In order for later sleep analysis, it is critical that these settings are correct, as the .perl file must read these data in the correct order to calculate sleep.\nUnder Export, select Raw Data, export the data as Unicode text.\n5. Tracking Socially Housed Fish\nFollow steps 4.1-4.4 to set up the experiment in the tracking software.\nIn the dropdown menu, select how many animals to track for the experiment.\nIn Arena settings, draw the correct scale to calibrate the real-world distance.\nIn Detection settings, use Dynamic Subtraction, and adjust the dark contrast to best track the animal.\nAdjust the subject size under the detection settings, so that only a very small portion of the animal is tracked.\nNOTE: By tracking only a small part of the animal, this will reduce the amount of switching between animals when they cross paths during acquisition.\nOnce the tracks are acquired, use the Track Editor to manually fix times where fish may cross paths.\n6. Extraction of Sleep Data from Locomotor Activity",
    "NOTE: The behavioral definition of sleep in both larval and adult A. mexicanus is 1 min or more of quiescence. This definition was determined using arousal threshold experiments, where a greater sensory stimulus is required to initiate a behavioral response in a sleeping state (>60 s) compared to waking14,17. To account for small movements and drifting common to fish species, there are velocity thresholds applied to segregate real movement from noise or drift. These thresholds are computationally-derived by comparing correlations between distance and sleep duration to find the highest R-squared values; thereby determining the most accurate velocity for movement and sleep. For larval fish, the upper and lower limits are both 12 mm/s as there is little to no drift. For adult fish the lower limit is 2 cm/s with an upper limit of 4 cm/s to account for drift.\nInstall Cygwin to the analysis computer to carry out the execution of the custom-written scripts to extract locomotor and sleep behavior.\nCreate a new experiment folder within the Cygwin home directory.\nImport the raw Unicode data from tracking software and execute the .sh file in Cygwin to convert the encoding from UTF-16 to UTF-8.\nExecute the .perl file in Cygwin to extract the sleep data.\nOpen the macro file and follow the instructions within the spreadsheet to finalize the data analysis as desired.\nNOTE: A basic level of command-line coding will be necessary to carry out this portion of analysis. General Linux commands will suffice. If there are issues with the programs reading the data properly, check the data from tracking software in any freely available text editor to be sure the encoding and order is correct for the executables to write properly.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}