{
  "id": 3606,
  "origin_website": "Cell",
  "title": "A protocol to investigate the effects of lncRNAs on in vivo protein-protein interactions using proximity ligation assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of cells\nTiming: ∼72 h\nThis section describes the procedure to prepare cells for proximity ligation assay (PLA).\nPlace the 14 mm round glass coverslips into a 24-well plate.\nNote: Coverslips should be clean and sterile.\nSeed cells onto the coverslips in the 24-well plate.\nLet cells stand for 15 min for adhesion and then incubate at 37°C in the CO2 incubator for 24 h.\nFor p53 knockdown, transfect 10 pmol siRNA for p53 into LINC00324 knockdown and overexpression U2OS cells using the Lipofectamine RNAiMAX transfection reagent according to manufacturer’s instructions (https://www.thermofisher.com/us/en/home/references/protocols/rnai-epigenetics-and-gene-regulation/rnai-protocol/lipofectamine-rnaimax.html[href=https://www.thermofisher.com/us/en/home/references/protocols/rnai-epigenetics-and-gene-regulation/rnai-protocol/lipofectamine-rnaimax.html]). Add 10 pmol si-p53 to 50 μL Opti-MEM medium and 1.5 μL Lipofectamine RNAiMAX reagent to 50 μL Opti-MEM medium. Combine both solutions and incubate for 10–20 min at room temperature (22°C–26°C). Add the complexes to each well containing cells. Mix gently by rocking the plate back and forth. Incubate the cells at 37°C in a CO2 incubator. After 48 h growing, subject the cells to fixation.\nNote: The optimal cell confluence is 50%–70% at the time of fixation.\nCell pretreatment\nTiming: ∼2.5 h\nThis section describes the steps for cell fixation, permeabilization and blocking.\nFixation.\nRemove medium, wash cells with 1× PBS for 5 min at room temperature (22°C–26°C).\nFix cells with 4% PFA for 20 min at room temperature (22°C–26°C).\nPause point: Fixed cells can be stored in 1× PBS at 4°C for several days. The plates should be prevented from drying out.\nNote: The fixation time may vary according to the cell type. Methanol is an alternative fixing reagent. The best choice of fixation may vary depending on your sample type, antibodies, and the protein target you want to study.\nPermeabilization.\nWash cells with 1× PBS 3 times for 5 min each at room temperature (22°C–26°C).",
    "Permeabilize with 1× PBS with 0.3% Triton X-100 for 20 min at room temperature (22°C–26°C).\nBlocking.\nWash cells with 1× PBS 3 times for 5 min each at room temperature (22°C–26°C).\nPut the coverslips on slides. Draw a hydrophobic circle along the coverslips’ edges with a hydrophobic PAP pen to delimit the reaction area.\nAdd 60 μL of Duolink Blocking Solution to each sample.\nIncubate the slides in a humidity chamber for 1 h at 37°C.\nPause point: Blocking can be run for 12–18 h at 4°C.\nCritical: Be sure to cover the entire sample with all solutions. Do not allow the cells to dry before adding the antibody.\nPrimary antibodies incubation\nTiming: ∼18 h\nThis section describes the steps for primary antibodies incubation.\nDilute primary antibodies anti-p53 (rabbit) and anti-SET (mouse) in a 1:100 ratio using Duolink Antibody Diluent.\nNote: Dilute your primary antibody to a suitable concentration in your custom antibody diluent. If using two primary antibodies, dilute the two antibodies in the same diluent.\nRemove the blocking solution from the coverslips and add 60 μL of the primary antibodies solution to each sample.\nNote: Aspirate off the blocking solution as much as possible to avoid dilution of the primary antibodies.\nIncubate the slides in a humidity chamber for 12–18 h at 4°C.\nCritical: Do not allow the cells to dry. Make sufficient solutions for all samples.\nThe following PLA steps are referred to the Duolink PLA Fluorescence Protocol from Sigma-Aldrich with minor modifications.\nDuolink PLA probe incubation\nTiming: ∼1.5 h\nThis section describes the steps for probe hybridization.\nDilute the two 5× Duolink PLA probe and mix Anti-Mouse PLUS and Anti-Rabbit MINUS PLA probes at 1:5 dilution in the Duolink Antibody Diluent.",
    "Remove the primary antibody solution and wash the slides with 50 mL 1× Wash Buffer A 2 times for 5 min each on a shaker at room temperature (22°C–26°C).\nNote: Bring the wash buffer to room temperature (22°C–26°C) before use.\nRemove the excess wash buffer and add 60 μL of the PLA probe mixture solution to each sample.\nIncubate the slides in a pre-heated humidity chamber for 1 h at 37°C.\nNote: Do not allow the cells to dry. Make sufficient solution for all samples.\nLigation\nTiming: 1 h\nThis section describes the steps for oligonucleotide ligation.\nRemove the PLA probe solution, wash the slides with 50 mL 1× Wash Buffer A 2 times for 5 min each at room temperature (22°C–26°C).\nDilute the 5× Duolink Ligation buffer in a 1:5 ratio in Milli-Q water.\nNote: The buffer contains DTT that may precipitate during freezing. Gently pipette to dissolve.\nAdd ligase to the 1× Ligation buffer from step 16 in a 1:40 ratio and mix.\nNote: Ligase should stay on ice. Add the enzyme to the reaction mix immediately before use.\nRemove the excess wash buffer and add 60 μL of the Ligase-Ligation solution to each sample.\nIncubate the slides in a humidity chamber for 30 min at 37°C.\nRolling circle amplification (RCA)\nTiming: ∼2 h\nThis section describes the steps for rolling circle amplification.\nRemove the Ligase-Ligation solution, wash the slides with 50 mL 1× Wash Buffer A 2 times for 5 min each at room temperature (22°C–26°C).\nDilute the 5× Amplification Far Red buffer in a 1:5 ratio in Milli-Q water.\nNote: Amplification buffer is light-sensitive. Make sure to protect from light from this step.\nAdd Polymerase to the 1× Amplification buffer from step 21 in a 1:80 ratio and mix.",
    "Note: Polymerase should stay on ice. Add the enzyme to the reaction mix immediately before use.\nRemove the excess wash buffer and add 60 μL of the Polymerase-Amplification solution to each sample.\nIncubate the slides in a humidity chamber for 100 min at 37°C.\nFinal washes\nTiming: ∼25 min\nThis section describes the steps for washing after amplification.\nRemove the Polymerase-Amplification solution, wash the slides with 50 mL 1× Wash Buffer B 2 times for 10 min each at room temperature (22°C–26°C).\nWash the slides with 50 mL 0.01× Wash Buffer B for 1 min at room temperature (22°C–26°C).\nNote: Make sure the slides are protected from light during the procedure.\nMounting and imaging\nTiming: ∼30 min to 3 h\nThis section describes the steps for coverslips mounting and image acquisition.\nRemove the excess wash buffer, air dry in the dark.\nNote: a paper towel can be used to carefully absorb the excess buffer.\nDrop 5 μL DAPI Fluoromount G on a microscope glass slide. Put coverslips upside down on the slide carefully to make sure the mounting solution is spread all over.\nNote: Avoid air bubbles during the mounting process. You can also use the Duolink In Situ Mounting Medium with DAPI from Sigma-Aldrich as an alternative.\nPlace the slides in the dark for 15 min at room temperature (22°C–26°C) to dry before viewing using a confocal microscope (LEICA TCS SP8).\nNote: Use clear nail polish or neutral balsam to seal all sides of coverslips for long-time storage.\nAcquire images using at least a 20× objective.\nPause point: The slides can be stored at 4°C for 3–4 days or at –20°C for longer time before imaging.\nCritical: Make sure the images in the experimental and control groups acquired in the same parameters for proper comparison."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cancer",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}