{
  "id": 6948,
  "origin_website": "Bio",
  "title": "Nonenzymatic RNA-templated Synthesis of N3′→P5′ Phosphoramidate DNA",
  "procedures": [
    "The preparation of activated 3'-amino monomers is accomplished via four chemical transformations from commercially available starting materials. The nucleophilic amine is first protected using a fluorenylmethyloxycarbonyl (Fmoc) group followed by a chemical phosphorylation step to generate the nucleoside 5'-monophosphates. The installation of the 2-aminoimidazoyl group at the 5'-monophosphate, followed by removal of the Fmoc protecting group, furnishes the final activated monomers. This process is repeated for each of the four monomers used (3'-amino-2',3'-dideoxynucleoside 5′-phosphoro-2-aminoimidazolide (3′-NH2-2AIpddN) where the nucleoside (N) is adenosine (A), guanosine (G), cytidine (C), and thymidine (T)). The step-by-step protocol is outlined for 3'-amino-3'-dideoxythymidine (Figure 2) and differences with respect to the other three monomers are highlighted. It should be noted that all chemical reactions should be carried out in a fumehood designated for chemical reactions.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902093236_7128.pngFigure 2. Synthesis of 3'-amino-3'-dideoxythymidine activated monomer (3′-NH2-2AIpddT) Preparation of Fmoc protected 3'-amino-2',3'-dideoxynucleoside (Figure 2, second chemical structure from the left)Weigh out 1.0 g (4.1 mmol) of 3'-amino-3'-deoxythymidine using an analytical balance, and transfer to a 100 ml round bottom flask equipped with a stir bar.Add 12 ml of pyridine using a 20 ml disposable syringe equipped with a disposable needle.Place the flask on top of a stir plate and initiate stirring for 2 min at 25 °C.Weigh out 1.7 g (5.0 mmol) of Fmoc-OSu using an analytical balance, and transfer to the flask containing the nucleoside solution.Allow the reaction to stir for 1 h at 25 °C.Remove the solvent using a rotary evaporator.Note: The water bath was slowly ramped up from room temperature until condensation could be observed on the rotary evaporator cold finger.Co-evaporate remnant pyridine with 20 ml MeCN using a rotary evaporator.Note: The water bath was slowly ramped up from room temperature until condensation could be observed on the rotary evaporator cold finger.",
    "Repeat Step A7 twice to afford a yellow gum.Redissolve the gum using DCM (approximately 10 ml).Note: If the redissolution is difficult, MeOH may be titrated in dropwise under stirring until full dissolution is achieved. Purify the product using automated normal-phase flash chromatography, equipped with a RediSep® Rf Normal Phase Silica column (40 g), using gradient elution between (A) DCM and (B) MeOH. The column gradient was as follows: 0% B for the first 2 column volumes (CVs), 0% to 20% B over 11 CVs, and 20% B for 2 CVs, with a flow rate of 40 ml/min.Fractions containing product can be identified using low-resolution mass spectrometry. Alternatively, thin layer chromatography may be used (e.g., using a 1:9 (v/v) MeOH:DCM solvent system).Pool fractions containing purified product.Remove solvent using rotary evaporation.Note: The water bath was slowly ramped up from room temperature until condensation could be observed on the rotary evaporator cold finger. Allow the nucleoside to further dry on high vacuum (> 8 h at 25 °C).Considerations for the other nucleosides:3'-amino-2',3'-dideoxycytidine: A similar procedure can be used for 3'-amino-2',3'-dideoxycytidine (500 mg) with a few exceptions. The reaction solvent used was DMF (22 ml). The solvent was removed using a rotary evaporator equipped with a heat bath. The column gradient (A: DCM, B: MeOH) was as follows: 0% B for the first 2 CVs, 0% to 40% B over 11 CVs, and 20% B for 2 CVs, with a flow rate of 40 ml/min. Further dry the product under high vacuum (> 8 h at 25 °C).3'-amino-2',3'-dideoxyadenosine: Combine the nucleoside (1 g) with pyridine (10 ml) and water (5 ml), followed by Fmoc-OSu (1.6 g). Stir vigorously for 1h. Remove most of the solvent using rotary evaporation (until approximately 3 ml).",
    "Precipitate the product by adding 100 ml of cold (0 °C) 1:1 (v/v) MeCN:CHCl3 solution. Isolate the product using vacuum filtration (equipment specified in the equipment section). Further dry the product under high vacuum (> 16 h at 25 °C).3'-amino-2',3'-dideoxyguanosine: Combine the nucleoside (0.4 g) with pyridine (10 ml) and water (4 ml), followed by Fmoc-OSu (0.6 g). Stir vigorously for 1h. Precipitate the product by adding 500 ml of cold (0 °C) 1:1 (v/v) MeCN:CHCl3 solution. Isolate the product using vacuum filtration (equipment specified in the equipment section). Further dry the product under high vacuum (> 16 h at 25 °C).Preparation of Fmoc protected 3'-amino-2',3'-dideoxynucleoside-5'-monophosphate (similar procedure for all 4 nucleosides) (Figure 2, third chemical structure from the left)Weigh out 230 mg (0.5 mmol) of 3'-NHFmoc-3'-deoxythymidine using an analytical balance, and transfer to a 25 ml round bottom flask equipped with a stir bar.Add 5 ml of trimethylphosphate using a 10 ml disposable syringe equipped with a disposable needle.Note: This results in a 0.1 M solution of nucleoside, which is important for this reaction. Stopper the flask using a rubber stopper.Place the flask containing the solution in an ice-water bath and place on top of a stir plate.Set the stir plate to generate vigorous sample stirring in the ice-water bath for 5-10 min.Add 187 µl (2 mmol) of phosphorus (V) oxychloride (POCl3) using a single-channel pipettor (200 µl capacity).Allow to stir vigorously for 10 min in the ice-water bath.Add 44 µl (0.25 mmol) of diisopropylethylamine (DIPEA) dropwise using a single-channel pipettor (200 µl capacity).Note: Reaction fuming may be observed here. Allow to stir vigorously for 20 min in ice-water bath.Repeat Steps B8 and B9 three additional times for a total addition of 1 mmol of DIPEA.",
    "Using an single-channel pipettor, quench ~1 µl of the reaction into 500 µl of deionized water in a microcentrifuge tube (Note that the precipitation may be observed during quenching). Mix thoroughly and, if precipitation is observed, add MeCN dropwise until the precipitate is solubilized. Analyze the quenched material using low-resolution mass spectrometry in negative ion mode (Note: Quenched solutions should be filtered using a disposable syringe fitted with a syringe filter, or centrifuged (e.g., 20,000 x g at room temperature) to avoid injecting particulates into the mass spectrometer). Signal corresponding to starting material should be absent in the mass spectrum (note that a chloride adduct may be observed). Alternatively, thin layer chromatography may be used to monitor the reaction progress if a mass spectrometer is unavailable.In the event that starting material is still present, add 47 µl (0.5 mmol) of POCl3 to the reaction mixture, followed by 44 µl (0.25 mmol) of DIPEA. Repeat reaction analysis (Step B11).Once the reaction is complete, add the reaction mixture to a 250 ml round bottom flash containing 50 ml of a triethylammonium bicarbonate (1 M) solution with vigorous stirring at 0 °C. This will produce fuming and perhaps foaming.Note: Product precipitation is to be expected. Allow to warm to room temperature under vigorous stirring (approximately 30 min).If precipitation persists after Step B14, slowly titrate MeCN into the quenched reaction until solubilization of the solid material is observed.Note: The solution may remain slightly cloudy, especially in the case of ddG. Purify the product using automated reverse-phase flash chromatography, using a RediSep Rf Gold C18 column with gradient elution between (A) aqueous 2 mM TEAB (pH 7.5) and (B) acetonitrile. The column gradient should be between 0% and 70% B over 13 CVs with a flow rate of 40 ml/min.",
    "Identify fractions containing product by low-resolution mass spectrometry. Alternatively, thin layer chromatography may be used to identify fractions containing product if a mass spectrometer is unavailable.Pool fractions containing pure product in a 500 ml round bottom flask.Remove the majority of the solvent by rotary evaporation until < 10 ml remains in order to remove most of the MeCN.Caution: Subjecting solutions containing TEAB to low pressure can cause vigorous/rapid foaming/boiling. Initiate the rotary evaporation in an ice water bath and gradually increase the temperature. Allow the solution \"bubbling\" to stabilize prior to increasing the temperature (this can be time consuming). Collect the solution in a clean 50 ml round bottom flask (record the mass of the empty flask prior to the transfer).Freeze the solution in a freezer (-20 °C) or in a dry ice-acetone bath, and freeze-dry the product under high vacuum at room temperature. Alternatively, if freeze drying is unavailable, rotary evaporate to completion. Co-evaporate the residue three times using anhydrous pyridine (3 x 5 ml). Allow the residue to further dry under high vacuum at room temperature.Record the mass of the flask containing the product.Preparation of 3'-amino-2',3'-dideoxynucleoside-5'-phosphoro-(2-aminoimidazolide) (similar procedure for all 4 nucleosides) (Figure 2, final product, fourth chemical structure from the left)Weigh 270 mg of 3'-NHFmoc-3'-dideoxythymidine-5'-monophosphate using an analytical balance and transfer to a dry 50 ml round bottom flask equipped with a stir bar.Add 16 ml of anhydrous DMSO using a 20 ml disposable syringe equipped with a disposable needle.Weigh 297 mg of 2-aminoimidazole hydrochloride using an analytical balance and transfer to the reaction vessel.Initiate stirring.Add 0.43 ml of DIPEA using a 1 ml disposable syringe equipped with a disposable needle.Weigh 1.3 g of triphenylphosphine (TPP) using an analytical balance and transfer to the reaction vessel.",
    "Weigh 910 mg of 2-2'-dipyridyldisulfide (DPDS) using an analytical balance and transfer to the reaction vessel.Allow the reaction to stir for 1 h at 25 °C.Monitor the reaction progress using 31P NMR by sampling 450 µl of the reaction with 150 µl of d6-DMSO (add 1 µl of PO(OEt)3 as a reference standard).Notes:The starting material signal is near 1 ppm, PO(OEt)3 near -3 ppm, TPP is near -6 ppm, triphenylphosphine oxide (TPPO) is near 27 ppm, and product should be near -10.5 ppm. Low-resolution mass spectrometry may also be used to track reaction progress (as in Step B11). If the reaction is incomplete, add 650 mg triphenylphosphine and 455 mg of DPDS and allow to stir for 30 min. Repeat Step C9.Remove the Fmoc protecting group by the addition of DIPEA (300 µl) followed by piperidine (960 µl). The reaction should be monitored by 31P NMR (approximately 10-30 min) at 25 °C.Add the reaction mixture to a pre-chilled (0 °C) 500 ml solution of EtO2:Acetone 1:1 (v/v) containing 2 ml of a saturated solution of sodium perchlorate (NaClO4) in acetone (in a 1 L Bucher flask).Allow the precipitate to settle in an ice bath.Remove the majority of the supernatant using a pipette controller.Transfer the remaining ~100 ml into two 50 ml conical centrifugal tubes.Note: If more than 100 ml remains from the suction Step C14, repeat the centrifugation step twice. Centrifuge the tubes at 3,000 rpm (approximately 4,700 x g) for 3 min using a benchtop centrifuge (at 0 °C, if possible).Decant and discard the supernatant from the tubes.Remove residual solvent for the pelleted material by placing the tubes under high vacuum (using a freeze dryer vacuum vessel if possible).Resuspend the dried crude material in 5 ml 1 M TEAB (pH 7.5).",
    "Purify the product by automated reverse-phase flash chromatography, using a RediSep Rf Gold C18 column with gradient elution between (A) aqueous 2 mM TEAB (pH 7.5) and (B) acetonitrile. The column gradient should be between 0% and 15% B over 13 CVs with a flow rate of 40 ml/min.Test fractions containing UV-active material for presence of product by LR-MS, NMR or TLC.Pool fractions containing pure product and test the pH using a calibrated pH probe.Adjust the pH of the purified stock to 9.25-10 using 1 N NaOH (typically 5-20 µl for a ~20 ml of product).Note: Although this step is time-sensitive, the pH should not be \"overshot\". As such, the titration of base should be done meticulously. Take a UV measurement and record the reading at 260 nm.Calculate the concentration using the Beer-Lambert law (A = εcl, where A is absorbance (a.u.), ε is the molar extinction coefficient (M-1cm-1), and l is the path length (cm)).Note: Molar extinction coefficients can be acquired from the corresponding triphosphates (e.g., Maravai LifeSciences-TriLinkTechnologies, 9650 M-1cm-1 for 3'-Amino-ddT triphosphate). Aliquot the stock solution in 2 μmol samples in 1.5 ml microcentrifuge tubes.Freeze product aliquots in liquid nitrogen.Note: Cryoboxes are convenient for this step.Proper personal protective equipment should be utilized when handling liquid nitrogen. Freeze dry samples (preferably at -20 °C).Store samples at -80 °C until ready to use.Preparation of 5'-FAM-labeled primer with 3'-terminal 3'-amino-2',3'-dideoxy-cytidine (Figure 3, top sequence labeled \"3'-NH2-RNA primer\")Prepare reverse RNA phosphoramidite solutions according to manufacturer's specifications (typically 66 mM in anhydrous acetonitrile).Prepare the 3'-(TFA)amino-2',3'-dideoxycytidine 5'-CED phosphoramidite solution (typically 66 mM in anhydrous acetonitrile). Add dried molecular sieves to each of the solutions in order to ensure and maintain anhydrous conditions.Prepare the oligonucleotide using automated solid-phase synthesis according to the manufacturer's specifications on the 3'-(6-FAM) CPG solid support.",
    "Cleave and deprotect the oligonucleotide according to the specifications of the 3'-(6-FAM) CPG (Glen Research). More-specifically, first treat the CPG with 1 ml aqueous NH4OH (28%) for 30 min at room temperature, followed by the addition of an equal volume of aqueous MeNH2 (40%). Incubate for another 30 min, then remove the solution from the CPG column.Transfer the solution to a clean 2 ml screw-cap microcentrifuge tube and seal the tube.Heat the solution to 65 °C for 10 min using a dry block incubator.Allow the solution to cool to room temperature.Remove the solvent using a speed-vac concentrator without additional heating.Add 100 μl of DMSO to the pellet.Add 125 μl of NEt3·3HF in a fumehood and seal the tube carefully.Gently mix using vortex.Heat the solution to 65 °C for 2.5 h using a dry block incubator. Vortex 1 min after 1h of heating.Allow the solution to cool to room temperature. Caution: Do not open the cap when the solution is hot.Add 1 ml of isopropanol and 100 µl 3 M sodium acetate (pH 5.2) to the solution containing the oligomer to initiate precipitation.Store the solution at -20 °C for 20 min.Centrifuge the sample at 20,000 x g at 4 °C for 10 min.Carefully remove the supernatant using an single-channel pipettor (200 μl capacity). Note: The supernatant should be retained until recovery of the product is confirmed. Resuspend the pellet in 1 ml 75% ethanol in water, then repeat Steps D16-D18.Resuspend the pellet in 200 μl of a solution of 8 M aqueous urea. Split the sample in half and store one half of the crude at -80 °C.Wash 20 x 20 cm gel plates with 80% (v/v) ethanol:water.Assemble a preparatory gel apparatus according to manufacturer specifications. A thickness of 1.5 mm is typically sufficient for purification.",
    "Prepare 75 ml of an 20% solution of 19:1 (w/w) acrylamide:bis-acrylamide in 1x TBE buffer. Note: Acrylamide/bis-acrylamide solutions are toxic and should be handled with proper precautions. Initiate the polymerization by the addition of TEMED (30 μl) and freshly prepared 20% (w/v) aqueous ammonium persulfate (150 μl) to the solution reported in Step D23.Note: It is important to have the preparatory gel apparatus completely set up so that the gel solution can be poured into the plate assembly prior to \"solidification\" of the gel matrix. Carefully pour the gel solution into the plate assembly.Insert preparatory gel comb at the top of the plate assembly.Note: Avoid the air bubbles; this can typically be accomplished by inserting the comb in a diagonal fashion. Allow the gel to polymerize for 1 h.Remove the comb and wash the wells thoroughly with 1x TBE.Pre-run the gel, according to manufacturer specifications, using 1x TBE as the running buffer (5 W power for 10 min).Stop the power.Clean the well thoroughly with 1x TBE right before the introduction of the sample, using a 60 ml disposable syringe equipped with a disposable needle.Evenly deposit the 100 μl sample (resuspended in 8 M urea) at the base of the well.Add indicators (xylene cyanol and bromophenol blue) to the reference well. Note: This well is typically placed near the edge of the gel. The indicators are useful as molecular-weight size markers (e.g., the bromophenol blue migrates similarly to an octanucleotide species for this concentration of acrylamide gel). Load sample into the gel matrix by applying 5W of power for 15 min.Increase the power to 20 W.Allow the electrophoretic separation to occur until the blue dye (bromophenol blue) reaches the bottom of the gel.Note: Visual tracking of FAM-containing oligonucleotides is typically possible (yellow species).",
    "This is useful in resolving other FAM-containing species in real-time. Remove the gel from the running chamber.Carefully dislodge the plates from one another.Excise the gel band corresponding to product using a square razor blade.Note: If it is unclear which band corresponds to the desired product, excise all potential product bands.Caution: Razor blades should be handled with care and properly stored/disposed of immediately after use. Transfer the gel band to a new 50 ml conical tube and crush into small gel pieces.Note: If multiple gel bands were excised, place each band in a separate conical tube. Add 9 ml of 100 mM sodium acetate and 1 ml of a 500 mM EDTA (pH 8).Allow the mixture to gently rock overnight.Desalt the oligonucleotide-containing supernatant using reverse-phase Sep-Pak cartridges according to the manufacturer's specification.Note: This is typically carried out with 10 ml syringes and a three way valve. Elute the oligomer from the stationary phase using 1:1 (v/v) MeCN:water solution into two 2 ml screw-cap vials.Note: Most of the oligomer will be captured in the first vial. Use a speedvac concentrator to dry down the material.Resuspend the oligomer in 300 µl of deionized water.Dilute 1 µl of sample into 49 µl of water. Record the UV absorbance at 260 nm.Estimate the concentration using a calculated molar extinction coefficient of the oligomer (e.g., calculated molar extinction coefficient using the nearest neighbor method) (e.g., accessible at https://www.idtdna.com/pages/tools[href=https://www.idtdna.com/pages/tools]).Prepare a stock solution of primer at a concentration of 100 µM.Analyze the oligomer by liquid chromatography-mass spectrometry.Note: Oligomer purity should exceed 95%. Consider repurifying the material by another means (e.g., IEX-HPLC or RP-HPLC) if the purity is less than 95%.Primer extension reaction (example shown in Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902093339_1200.pngFigure 3. Chemical copying of a mixed-sequence RNA templates into 3′-NP-DNA using 3′-NH2-2AIpddNs.",
    "Top: the primer sequence is shown in green, the RNA template in blue, and the stepwise extension of the primer in red. Bottom: PAGE analysis of primer extension time course, carried out using 10 mM activated NP-DNA monomers (3′-NH2-2AIpddA, 3′-NH2-2AIpddG, 3′-NH2-2AIpddC, 3′-NH2-2AIpddT), 50 mM MgCl2, 200 mM Na+-HEPES pH 8.0, 25 °C. P, primer. C, control, which is the reaction mixture without activated NP-DNA monomers.Combine the FAM-labeled primer, RNA template (synthesized in-house, or purchased), 50 mM Na+-HEPES (pH 8) buffer, NaCl, EDTA (pH 8), and water according to Table 1 in a PCR tube.Table 1. Component amounts for the pre-annealed primer-template duplex master miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902093402_4671.jpegAnneal the primer-template duplex using a thermal cycler (95 °C to 25 °C over 15 min).Combine the annealed duplex, Na+-HEPES (pH 8) buffer, MgCl2, and water according to Table 2.Note: The experiment should be carried out in triplicate (i.e., The primer extension reaction is set up in three individual tubes, making three replicates).Table 2. Component amounts for each primer extension experiment replicateimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902093434_1026.jpegResuspend each of the monomers in 19 µl water with 1 µl of 1M HEPES (pH 8) at 0 °C to generate stock solutions at a concentration of 100 mM.Check the pH of each monomer stock using pH paper.Note: This is a rough estimate and is to verify that the stock concentrations are near pH 8.0-8.5. Mix 10 µl of each monomer in a new microcentrifuge tube.Initiate the primer extension reaction by the addition of the monomer mixture (6 µl) to each of the replicates. Reactions are typically kept in a Digital block heater or a thermal cycler at 25 °C. Note: It is not necessary to protect the reaction from light.",
    "Quench 1 µl of the primer extension reaction mixture in 29 µl of quench solution (13 mM EDTA (pH 8), ~8 µM complementary RNA (synthesized in-house or purchased), and 90% (v/v) formamide:water) at desired reactions times.Note: In this specific case, time intervals of 0.5 h, 1 h, 2 h, 3 h, 5 h, and 24 h were chosen based on previous literature/data. If this information is lacking, two independent experiments are typically conducted: A coarse time-course (e.g., 5 min, 10 min, 0.5 h, 1 h, 2 h, 4 h, 24 h, 48 h) followed by a refined time-course (e.g., as described above). Prepare an analytical PAGE gel (similar to preparatory PAGE) using 0.75 mm spacers and a 30-well comb.Note: 30 ml of gel mix is typically sufficient, with polymerization initiated using 15 µl TEMED and 75 µl of 20% (v/v) aqueous ammonium persulfate. Prerun the gel at 5 W for 15min.Wash each well using 1x TBE using a disposable syringe equipped with a disposable needle. Note: This should be done right before loading the samples onto the gel. Load the quenched samples from the time-course (3 µl) in separate wells.Load dye solution (bromophenol blue and xylene cyanol) as a molecular weight marker in flanking wells.Begin the electrophoresis at 5 W for 10 min.Turn up the power to 20 W for 1 h.Stop the power and wash the outside of the plates with warm water.Dry the plates.Analyze the gel using an Amersham typhoon biomolecular imager according to the manufacturer's directions.Note: The FAM fluorophore is best excited by the blue laser (488 nm). All gels should be imaged at a minimum resolution of 100 μm. Quantify the fraction of primer remaining, and the fraction of each primer extension product, at each timepoint (in %) using ImageQuantTM.",
    "This can be automatically accomplished by the software (e.g., background subtraction, detection of bands etc.). The user then manually adjusts the parameters as needed (e.g., selected area for each band, add bands, remove automatically detected artifacts). Refer to the user manual for more information concerning quantification.Note: Background subtraction is important to generate reproducible and reliable data."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}