{
  "id": 15699,
  "origin_website": "Jove",
  "title": "A Semi-Automated and Reproducible Biological-Based Method to Quantify Calcium Deposition In Vitro",
  "procedures": [
    "1. Cell seeding, maintenance, and calcification induction\nFor culturing primary cells, use a laminar airflow cabinet, gloves, and sterile equipment. Disinfect hands and workspace before and after conducting any work. Treat all primary cells and culture media as a potential biohazard, unless proven otherwise. Preferably autoclave surplus cells and media before disposal. Do not chemically inactivate and autoclave since this will liberate toxic fumes.\nCulture hVSMC on uncoated cell culture plates.\nRoutinely maintain hVSMC in growth medium consisting of M199 medium supplemented with 10%-20% FBS and 1% Pen/Strep and incubate at 37 °C and 5% CO2.\nSplit the cells upon 70%-90% confluency.\n\t\nTo split, wash the hVSMCs 2x with PBS. Add trypsin and incubate for 2-5 min at 37 °C. Check for the detachment of cells under the microscope.\nInhibit the trypsin reaction by adding serum-containing medium. Centrifuge the cells at 350 x g for 4 min and resuspend the pellet in maintenance medium. hVSMCs follow a 1:2 splitting scheme.\nTo start the calcification experiment, prepare the cells following instructions for a split (Step 1.4.1). Upon resuspension, count the cells and seed into a 48-well plate at a density 10-15 x 103 cells/cm2. Seed the cells avoiding the use of the outer wells, as recommended in Supplemental Figure 1.\nLet the cells adhere and recover for 24 h (overnight) while incubating at 37 °C and 5% CO2.\nGently wash the cells 2x with PBS, carefully aspirating all the remaining PBS after the 2nd wash.\nGently add calcification medium and further incubate at 37 °C and 5% CO2. Calcification medium must contain a calcification stimulus, fluorescently labeled fetuin-A (e.g., with red fluorescent protein [RFP]) (1 µg/mL), and HOECHST 33342 (0.1 µg/mL) nuclear stain or similar live fluorescent nuclear stain. Do not use DAPI, as this is non-permeable.",
    "Check daily with a light microscope until calcification occurs.\n\t​NOTE: For notes on the cell culture and maintenance of hVMSCs, please see Supplemental File 1.\n2. Calcification detection via imaging\nNOTE: The following protocol provides the general steps to be taken in preparation, imaging, and data analysis. Screenshots supporting the instructions for each step using an automated imaging platform and corresponding image analysis software (see Table of Materials for details) are provided in Supplemental File 2 and Supplemental File 3. Other imaging instruments and image processing tools may be used to apply this protocol. However, repeated imaging at the same location in each well is crucial for meaningful data acquisition. Creating a protocol to image calcification and re-use at every imaging step is necessary for obtaining reproducible results. The first time applying the method, follow the steps below to prepare before the imaging.\nProtocol setup\n\t\nOpen the software, and then select Protocols and Create New.\nSelect Procedure and click Set Temperature. In the pop-up window, set the temperature to 37 °C and the gradient to 1 °C, and click OK. Select the plate type of choice from the dropdown menu. Add the imaging step by clicking Image. Select the inverted imager, and click OK.\nAdd three imaging channels and set them to DAPI (377, 447 nm), RFP (531, 593 nm), and brightfield. Tick the Montage box and set the desired number and location of the images. 2 x 2 for a 48-well plate is a common choice. Change the overlap to represent a better coverage of each well. Select which wells are to be imaged. A new window will open where the wells of interest can be selected.",
    "Click Focus Options to set the focus mode. A new window will open. Set each channel individually. Commonly, wells are autofocused on the \"DAPI\" channel. Set all other channels to Fixed Focal Height From First Channel and set by clicking OK. Close the window.\nStart the pre-setting data reduction steps by clicking Data Reduction and select Image Preprocessing. Setting up this step reduces the fluorescence background. Accept the default settings by selecting OK. A new set of images will be created with the prefix \"TSF\". The original images will be preserved.\nSet up a step to count the cells by selecting Cellular Analysis. Select TSF DAPI images from the Channel dropdown menu. Set further details after imaging has been performed. This step can also be considered data reduction; always make sure to keep the original images.\nPrepare the analysis of the RFP (calcification) signal by selecting Statistics. In the pop-up window, label Step and select TSF RFP as the input channel. Tick the Upper Value and Lower Value boxes. Tick the box for Total Area in the lower list. Select None in the Color Effect column. In the pop-up window, click Custom and tick the Background box. This will color code the results from low-high for easy assessment. Press OK.\nFor a fair readout, normalize the RFP signal per cell. In doing so, a total area is divided per cell. To set up this step, press Ratio on the left side. In the pop-up window, select for data input 1 RFP Quantification: Total Area from the drop-down menu. Further select Cell Count as data input 2.\nFinally, select a New Data Set Name and press OK and OK again. Select Color Effect as described previously. In the upper-left corner, select File and save the file as protocol (.prt file type).",
    "Daily after the first calcification occurs\nFor every time point, repeat these steps. In the startup software, press Read Now and Existing Protocol.... Select the protocol that has been created in the previous step. The program will ask to save the experiment. This can be done at this step but also at any later step manually by clicking the Save button on the upper left.\nA pop-up window will ask to wait for the system to heat. Turn on the CO2 gas-controller and set it to 5%.\nOnce the system has reached the set temperature, a prompt will appear to insert a plate and read. Press Cancel. This is because, for each time point, the exposure of each fluorochrome must be adjusted individually.\nTransport the plate from the incubator to the imager in a safe box that resists breaking and spilling and is in line with local biosafety regulations for transporting live cells, in case of an accident. Place the plate into the plate reader.\nAfter canceling, click on Procedure. In the pop-up window, select Pre-Set Imaging Step. Adjust the focus and exposure on the DAPI channel first. Untick the Auto Exposure box at all channels. Then, click the Microscope icon next to the DAPI channel. A new window will open.\nSelect the well to focus on. Use a well with medium to high calcification for this step. If a signal is already visible, first click Autofocus and then Autoexposure. If not, first increase the exposure and repeat Autofocus and Autoexposure. If desired, the exposure can be adjusted manually by selecting the exposure drop-down menu. Check the settings on multiple wells. Once satisfied, save the settings.\nAdjust the exposure in the same manner for all channels.",
    "CAUTION: Do not focus on other channels; only adjust exposure. The focus plain should be the same for all channels.\nClose the procedure window. Select the green Read Now button in the top task bar. Save the experiment as indicated by the software.\n\t\t​NOTE: The software will now automatically read all the selected wells in the selected settings.\n3. Data analysis\nNOTE: For detailed screenshots on how to perform the data analysis using an automated imaging platform and corresponding image analysis software (see Table of Materials for details), please see Supplemental File 4. If using alternative imaging instruments or analysis software, the images should be exported and batch processed ensuring that the exposure, fluorescence threshold, or intensity are adjusted equally for all images in a comparative data set.\nWhile the system reads the plate, all the images are automatically processed in the background. Adjust the settings for cell count by selecting TSF DAPI images to display. Select the well of choice by double-clicking. A new window will pop up. Select one of the images.\nSelect the Analysis tab. In the pop-up window, select Cellular Analysis: Cell Count. Click OK. Deselect the RFP and brightfield channels. Tick the Highlight Objects box.\nClick Options to open the menu. Adjust the size and intensity threshold to include all nuclei but exclude debris. Click OK. Click Apply changes in the lower left to also transfer the settings to all other images.\nIn a similar manner as before, select a well and image with a medium to high amount of calcification to best adjust the signal-to-noise ratio; click the Analysis tab in the task menu.",
    "This time select Image Statistics. Deselect the DAPI and brightfield channel. Click Options to open the menu. Tick the box Threshold Outliers. Adjust the threshold's upper and lower values. Only count the signal if it is above the background and exclude if there are debris/artifacts.\nTo set a non-subjective threshold value for the signal above background, select the line tool from the task bar. A window will pop up. Draw a line through a patch of signal, but make sure to also include an area of background.\n\t\tNOTE: A graph will appear in the pop-up window, showing a peak representing the signal above the background line. The 25% peak height value represents the recommended threshold. It is also recommended to measure multiple signal patches to ensure the selection of the right threshold. While selecting patches of signal, selecting regions with very high signal strength may result in a threshold that neglects medium and or lower signals. It is, therefore, recommended to select patches of medium to low signal above background. Examples of too high, too low, and accurate thresholds are shown in Supplemental File 4.\nOnce satisfied, click OK and Apply Changes to transfer the settings to all other wells. Check if the threshold is accurately selected in the other wells.\nOnce the cell count and RFP thresholds are set, export the data. Select the plate of interest. In the drop-down menu, multiple parameters can be selected for export. Of relevance might be cell count, RFP area, and \"area/cell\" which is the metric used for comparison between groups. Click the Excel button next to the drop-down menu to export the data directly into a spreadsheet.",
    "NOTE: In the dropdown menu, the calculated values for the cell count, the total area of RFP signal (reflecting the area of calcification), as well as the normalized ratio of total area of RFP signal per cell can now be selected individually and exported to a spreadsheet. Display the results as the ratio of total area of RFP signal per cell and visualize (e.g., bar graphs). Apply an unpaired Student's t-test to compare two groups or an unpaired ANOVA to compare different groups at the same time point. Comparing the same group at different time points may require paired statistical analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}