{
  "id": 2728,
  "origin_website": "Cell",
  "title": "An optimized protocol to identify keratinocyte subpopulations in vitro by single-cell RNA sequencing analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell cultivation and compound stimulation\nSeeding\nTiming: approximately 1 h\nThe procedure of the in vitro NHEKs culture is described in Figure 2[href=https://www.wicell.org#fig2]. From the seeding step, cells are cultured in a 24-well plate (surface area 1.9 cm2).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig2.jpg\nFigure 2. Protocol for cell culturing and stimulation of NHEKs\nProtocol was designed based on our previous study.8[href=https://www.wicell.org#bib8] Scale bars = 200 μm.\nNote: The 24-well plate is used, thus consistent with the other experiments in Siriwach et al.1[href=https://www.wicell.org#bib1]\nObserve cells cultured in T-25 flask under a microscope. Confirm that those cells reach a good confluency of around 70%–90%.\nPrepare a 24-well culture plate.\nThaw the frozen trypsin/EDTA solution and HEPES buffer, and prewarm necessary amounts at 37°C.\nDispense 5 mL of trypsin neutralizing solution into a 15 mL-centrifuge tube and prewarm at 37°C.\nPrewarm the HuMedia-KG2 medium containing 150 μM CaCal2 to 37°C. It will be used later for cell resuspension.\nRemove the culture medium from the flask by aspiration.\nGently wash adherent cells with 2 mL of HEPES buffer for ∼30 s.\nRemove HEPES buffer by aspiration.\nTreat the cells with 2 mL of trypsin/EDTA solution for about 1 min at room temperature (20°C–25°C).\nRemove the trypsin/EDTA solution by aspiration, but leave approximately 0.5 mL of the solution. Tighten the cap to prevent cells from drying out.\nLeave the flask at room temperature (20°C–25°C).\nCritical: Do not incubate the cells in a 37°C incubator.\nOccasionally tilt the flask to spread trypsin/EDTA solution over the entire cell layer. Gently tap the side of the flask approximately every 2 min to further detach the cells.",
    "Observe the cells under a microscope at 5–8 min after trypsinization. If attached cells could still be observed, strongly tap the side of the plate to further detach the remaining cells from the culture surface.\nAfter confirming that cells are completely detached from the culture surface, add 5 mL of HEPES buffer, gently pipette mixing 1–2 times using a 10-mL pipette, and then collect them into the centrifuge tube containing trypsin neutralizing solution (d).\nCentrifuge at 220 g for 5 min.\nRemove the supernatant by aspiration.\nResuspend cells with 5–8 mL of the prewarmed medium (1e) and count the number of cells with a hemocytometer.\nThe seeding density is 2,500 cells/cm2. Number of viable cells required for one well in 24-well plate is 2,500 × 1.9 cm2 = 4,750 cells and the medium volume per well is 500 μL. Adjust the concentration of cell suspension accordingly before transferring into the 24-well plate, 500 μL of cell suspension per well.\nClose the lid and gently shake the 24-well plate to ensure even plating density.\nIncubate the plate for 24 h.\nCritical: At 24 h after seeding, observe the cells under a microscope. Cells should be attached and spread evenly on the culture surface in the form of single individual cells or small clusters (Figure 2[href=https://www.wicell.org#fig2]).\nMedium change\nTiming: approximately 30 min\nAt 24 h after seeding, change the culture medium to EpiLife (Invitrogen) containing 60 μM CaCl2 (Gibco) in the absence of growth factors for 48 h.\nPrewarm EpiLife containing 60 μM CaCl2 at 37°C in a water bath approximately 10–15 min.\nUnder aseptic conditions, discard the culture medium by aspiration and then immediately add 500 μL of EpiLife containing 60 μM CaCl2 per well.",
    "Critical: Avoid pipette tips touching cells directly by placing the tips at the sidewall of the wells.\nPut the 24-well plate back into the 37°C, 5% CO2 incubator and further incubate for 48 h.\nLPA stimulation\nTiming: approximately 1 h\nAt 48 h after medium change, cells are stimulated with EpiLife, in the absence of growth factors, containing 1.2 mM CaCl2 (Gibco) and supplemented with 30 ng/mL recombinant human IL-4 in the absence or presence of 10 μM LPA for control vehicle- and LPA-conditions, respectively. Stimulation cocktails are prepared for 12 wells per each condition.\nPrewarm EpiLife medium containing 1.2 mM CaCl2 at 37°C in a water bath, approximately 10–15 min beforehand.\nPrepare 3 mL of the EpiLife/DMSO solution by adding 30 μL of DMSO in 2,970 μL of EpiLife medium.\nPrepare 7 mL of the EpiLife/IL-4/Ca2+ by adding 3 μL of 30 ng/mL recombinant human IL-4 and 12 μL of 1 M CaCl2.\nPrepare 1 mL of 100 μM LPA by dissolving 100 μL of LPA (1 mM)/HEPES with 900 μL of EpiLife/DMSO.\nPrepare stimulation cocktails for LPA and control conditions.\nControl condition: mixing of 1,440 μL of the EpiLife/DMSO + 3,360 μL of the EpiLife/IL-4/Ca2+= 4.8 mL in total.\nLPA condition: mixing of 480 μL of 100 μM LPA + 960 μL of the EpiLife/DMSO + 3,360 μL of the EpiLife/IL-4/Ca2+ = 4.8 mL in total.\nPrewarm the cocktails at 37°C in a water bath approximately 10–15 min prior to stimulation.\nPlace the 24-well plate in the clean bench. Under aseptic conditions, discard the culture medium by aspiration and then immediately add 500 μL of the stimulation cocktails (3e). Start from 12 wells of control condition to 12 wells of LPA condition.",
    "Put the 24-well plate back into the 37°C, 5% CO2 incubator and further incubate for 72 h.\nPrepare single-cell suspension\nTiming: approximately 1 h\nAt 72 h post-stimulation, prepare 300 cells/μL of single-cell suspension from either control or LPA -treated conditions.\nPrepare two of 1.5 mL centrifuge tubes.\nThaw the frozen trypsin/EDTA solution and HEPES buffer, and prewarm necessary amounts at 37°C.\nFor each condition, dispense 6 mL of trypsin neutralizing solution into a 15 mL-centrifuge tube and prewarm at 37°C.\nFor each condition, transfer 500 μL of the stimulating culture medium (3e) in a 1.5 mL centrifuge tube. EpiLife/DMSO/IL-4/Ca2+ for control condition and EpiLife/DMSO/IL-4/Ca2+/LPA for LPA stimulation condition.\nPrewarm the medium (4d) to 37°C in a water bath. Later they will be used for cell suspension.\nRemove culture medium from the 24-well plate by aspiration.\nGently wash the cells with 500 μL of HEPES buffer for about 30 s.\nRemove HEPES buffer by aspiration.\nTreat cells with 100 μL of trypsin/EDTA solution.\nLeave the 24-well plate at room temperature (20°C–25°C).\nCritical: Do not incubate the cells in a 37°C incubator.\nConfirm that cells detach, turn into round shape and don't form large cell aggregate under a microscope.\nFive to eight mins after trypsinization, when approximately half of the cells are detached, tap the side of the plate to further detach the remaining cells from the culture surface.\nAfter confirming that cells are completely detached from the culture surface, add 500 μL of HEPES buffer, gently pipette mixing and then collect them by combining wells of the same condition together into a 15 mL-centrifuge tube containing trypsin neutralizing solution (4c).\nCentrifuge at 220 g for 5 min at room temperature (20°C–25°C).\nDiscard the supernatant by aspiration.",
    "Resuspend cells in 200 μL of the prewarmed medium (4e) and count the cell number with a hemocytometer.\nAdjust the cell concentration to 300 cells/μL.\nStore the cell suspension on ice.\nCritical: Cell suspension should be prepared as quickly as possible before the cell capture step using the Fluidigm C1 system. As least 200 μL of cell suspension for each condition is required for subsequent steps. In our study, we used the IFC size 17–25 μm. The number of cells for loading was 600 cells.\nNote: The recommendation of cell concentration is vary depending on the size of IFC. Please check the SMART-Seq® v4 Ultra® Low Input RNA Kit for the Fluidigm® C1TM System (Clontech), IFCs user manual. The protocol is available for download at https://www.takarabio.com/documents/User Manual/SMART/SMART-Seq_v4[href=https://www.takarabio.com/documents/User%20Manual/SMART/SMART-Seq_v4] (Ultra Low Input RNA Kit for the Fluidigm C1 System IFCs User Manual_032416.pdf).\nSingle-cell isolation, cDNA library preparation, and next generation sequencing\nTiming: 3 days\nThe procedure of single-cell isolation, cDNA library preparation and next generation sequencing are described in Figure 3[href=https://www.wicell.org#fig3]. Conduct experiment according to the SMART-Seq® v4 Ultra® Low Input RNA Kit for the Fluidigm® C1TM System (Clontech), IFCs user manual. The protocol is available for download at https://www.takarabio.com/documents/User Manual/SMART/SMART-Seq_v4[href=https://www.takarabio.com/documents/User%20Manual/SMART/SMART-Seq_v4] (Ultra Low Input RNA Kit for the Fluidigm C1 System IFCs User Manual_032416.pdf).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig3.jpg\nFigure 3. Step-by-step procedure of single-cell isolation, cDNA library preparation, and next generation sequencing\nSingle cell suspension of 300 cells/μL from either control or LPA stimulation is loaded onto the IFC for single-cell isolation on the Fluidigm C1 Autoprep system (hereafter, C1 machine). In our study, the IFC size was 17–25 μm. Perform cell capturing according to the Fluidigm C1 protocol.\nPrepare the C1 reagent mixtures.",
    "Prewarm buffers and reagents from the C1 Single-Cell Auto Prep Reagent Kit to room temperature (20°C–25°C) prior to use. These include Cell Wash Buffer, C1 Preloading Reagent, C1 Blocking Reagent, and C1 Harvest Reagent. Thaw C1 Suspension Buffer on ice and vortex well before use.\nThaw 5× Ultra Low First-Strand Buffer.\nPrepare Lysis Mix.\nPrepare Reverse Transcription (RT) Mix.\nPrepare PCR Mix.\nApply priming solution into the IFC according to the loading mapping in Figure 4[href=https://www.wicell.org#fig4]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig4.jpg\nFigure 4. Pipetting map\n(A) Priming step.\n(B) Cell loading step. Figure is generated based on the Fluidigm’s protocol “Using C1 to Generate Single-Cell cDNA Libraries for mRNA Sequencing”. Protocol is available for download at https://www.fluidigm.com/support/instrument-support/c1-support[href=https://www.fluidigm.com/support/instrument-support/c1-support].\nApply 200 μL of C1 Harvest Reagent into the inlets marked with large red circles for total 2 inlets. After application, swirl the IFC gently to distribute the reagent evenly.\nApply 20 μL of C1 Harvest Reagent into the inlets marked with red dots for total 36 inlets.\nApply 20 μL of C1 Harvest Reagent into 2 pairs of inlets marked with red dots in the middle of the outside columns for total 4 inlets.\nApply 15 μL of C1 Blocking Reagent into the inlets marked in yellow for total 2 inlets.\nPeel off the white tape at the IFC bottom.\nPlace the IFC in to the C1 machine and press the LOAD button. Run the SMART-Seq v4: Prime (1861×/1862×/1863×) script.\nWhen the prime run finishes, press EJECT to remove the primed IFC from the C1 machine.\nCritical: Avoid bubbles in IFC by placing pipette tips at the bottom of inlets and slowly dispensing the reagents.\nPrepare the LIVE/DEAD cell staining solution.\nVortex the dyes for 10 s and spin down.\nPrepare the LIVE/DEAD staining solution (see LIVE/DEAD cell staining solution Table).\ntable:files/protocols_protocol_2242_7.csv",
    "Freshly prepare, protect from light and store at room temperature (20°C–25°C) before use.\nVortex the solution thoroughly before transferring into the IFC.\nApply cells into the IFC according to the loading mapping in Figure 4[href=https://www.wicell.org#fig4]B.\nPrepare the Cell Mix by combining the cell suspension with C1 Suspension Reagent at 3:2 ratios according to the Cell Mix table. Slowly pipet up and down for thorough mixing. Do not vortex the cells. Keep the cell suspension on ice.\ntable:files/protocols_protocol_2242_8.csv\nFreshly prepare and store on ice.\nRemove blocking reagent from the IFC inlets marked in green and yellow by aspiration.\nSet a pipette to 12 μL, then slowly pipet the Cell Mix up and down 5–10 times to mix thoroughly and dissociate any cell clumps.\nNote: Do not vortex the Cell Mix. Avoid bubbles when mixing.\nApply 24 μL of C1 Preloading Reagent into the inlet marked in purple.\nApply 7 μL of Cell Wash Buffer into the inlet marked in pink.\nApply 10 μL of the Cell Mix into the inlet marked in green.\nNote: You may pipet up to 20 μL of Cell Mix, but only 5 μL will enter the IFC.\nVortex the LIVE/DEAD staining solution well, then apply 7 μL of the solution into the inlet marked in blue.\nPlace the IFC into the C1 machine. Run the SMART-Seq v4: Cell Load & Stain (1861×/1862×/1863×) script.\nNote: Run IFCs of control and LPA-stimulated cells in parallel on two C1 machines.\nWhen the run finishes, press EJECT to remove the IFC from the C1 machine.\nThe capturing efficiency can be evaluated under a microscope and only live single cells should be used for library preparation.",
    "Examine all 96-capture sites on the IFC using an inverted fluorescent microscope. Record the number of captured cells in each capture site. Check also the viability of the cells using LIVE/DEAD staining.\nProceed to cDNA library preparation using “SMART-Seq v4” (Clontech).\nApply Lysis Mix, Reverse Transcription and PCR reagents into the IFC according to the loading map in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig5.jpg\nFigure 5. Pipetting map for cell lysis, revere transcription, and PCR steps\nFigure is generated based on the Fluidigm’s protocol “Using C1 to Generate Single-Cell cDNA Libraries for mRNA Sequencing”.\nDiscard the remaining solution in both the flow through outlet marked in yellow, and in the inlet marked in purple.\nApply 180 μL of C1 Harvest Reagent into each of the reservoirs marked with red rectangles for total 4 total reservoirs.\nApply 7 μL of Lysis Mix into the inlet marked in orange.\nApply 8 μL of Reverse Transcription (RT) Mix into the inlet marked in green.\nApply 24 μL of PCR Mix into the inlets marked in blue for total 2 inlets.\nApply 24 μL of Preloading Reagent into the inlet marked in purple.\nPlace the IFC into the C1 machine and run the SMART-Seq v4: Sample Prep (1861×/1862×/1863×) script. Run the script overnight (8 h).\nNote: The running time is 8 h.\nCritical: Harvest should be performed as soon as the Sample Prep script run finishes. Otherwise, small volumes are prone to loss by evaporation. If the elapsed time between the start of sample prep and harvest (for example, when running the script overnight) is over 8 h, adjust the finishing time in the script by sliding the orange bar in the dialog box to “Select when the script should finish.”\nHarvest cDNAs from the C1 IFC.\nPrewarm C1 DNA Dilution Reagent to room temperature (20°C–25°C).",
    "When the SMART-Seq v4: Sample Prep script run completes, press EJECT to retrieve the IFC from the C1 machine.\nLabel a new 96-well plate “Diluted Harvest” along with the experiment name, and date.\nApply 10 μL of the C1 DNA Dilution Reagent into each well of the “Diluted Harvest” plate.\nCarefully pull back the four pieces of tape covering the IFC harvesting inlets using a plastic removal tool.\nUse an eight-channel pipette to transfer 3.5 μL of the harvested amplicon from each collection site according to Figure 6[href=https://www.wicell.org#fig6] into the Diluted Harvest plate (see Harvest amplicon dilution Table).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig6.jpg\nFigure 6. Output map\nFigure is generated based on the Fluidigm’s protocol “Using C1 to Generate Single-Cell cDNA Libraries for mRNA Sequencing”.\ntable:files/protocols_protocol_2242_9.csv\nTransfer the entire volume of C1 harvest amplicons from the IFC into each well of the diluted harvest plate containing 10 μL of C1 DNA Dilution Reagent. Follow step 1–4 in Figure 7[href=https://www.wicell.org#fig7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig7.jpg\nFigure 7. Output harvest map\nFigure is generated based on the Fluidigm’s protocol “Using C1 to Generate Single-Cell cDNA Libraries for mRNA Sequencing.”\nCritical: It is critical to follow the instruction map while transferring the cDNAs from the IFC to the “Diluted Harvest” plate in order to trace the sample IDs.\nSeal and vortex the “Diluted Harvest” plate for 10 s at medium speed and then spin it down.\nPause point: Samples can be stored for up to one week at 4°C or at –20°C for long term.\nQuantify harvested cDNAs using PicoGreen® assay.\nDetermine cDNA concentration.\nUse Single-Cell mRNA Seq PicoGreen Template for quantifying the cDNA library.\nInput values into the Concentration Estimate Table on the “Example Results” tab in the template.",
    "Dilute each sample based on an optimal dilution determined from the Concentration Estimate Table, which should fall within the optimal range of concentrations for Nextera XT library preparation as below.\nNote: The Nextera XT protocol is optimized for 1 ng of input DNA. The optimal cDNA concentration for the Nextera XT DNA Library Preparation is 0.10–0.3 ng/μL.\nLabel a new 96-well PCR plate as “Diluted for Sequencing.”\nApply an appropriate amount of C1 Harvest Reagent into each well of the “Diluted for Sequencing” plate according to the determined dilution (see Harvest amplicon dilution Table):\ntable:files/protocols_protocol_2242_10.csv\nTransfer 2 μL of each harvest sample from the “Diluted Harvest” plate to the “Diluted for Sequencing” plate.\nSeal the “Diluted for Sequencing” plate with adhesive film.\nVortex at medium speed for 20 s and centrifuge at 350 g for 1 min.\nPerform library preparation using the Nextera XT DNA Library Preparation Kit (Illumina) and Nextera XT Index Kit (Illumina).\nNote: In our study, we used the Nextera XT Index kit.1[href=https://www.wicell.org#bib1] However, a new version, V2 kit has been released. We recommend using this new kit version following the manufacturer’s instructions.\nPrepare cDNA for Tagmentation.\nCritical: Warm up Tagment DNA Buffer and NT Buffer to room temperature (20°C–25°C). Confirm there is no precipitation in NT Buffer. If there are any precipitates, vortex until they are completely dissolved.\nAfter thawing, ensure all reagents are adequately mixed by gently inverting the tubes 3–5 times, followed by a brief centrifugation.\nLabel a new 96-well PCR plate “Library Prep.”\nPrepare tagmentation premix in a 1.5 mL centrifuge tube. Calculate the required amount of the premix based on the sample number, or prepare for 96 samples (see below tables).\ntable:files/protocols_protocol_2242_11.csv\nFreshly prepare and store on ice.\ntable:files/protocols_protocol_2242_12.csv\nFreshly prepare and store on ice.\n∗Calculation based on a 25% overage.",
    "Vortex gently for 20 s and spin down the tube.\nAliquot equal amounts of the premix into each tube of an 8-tube strip.\nTransfer 3.75 μL of the premix into each well of the “Library Prep” plate using an 8-channel pipette.\nTransfer 1.25 μL of each diluted sample from the “Diluted for Sequencing” plate to the “Library Prep” plate.\nSeal the plate and vortex at medium speed for 20 s. Centrifuge at 2,000 g for 5 min to remove bubbles.\nPlace the “Library Prep” plate in a hot-lid thermal cycler and run the following program:\ntable:files/protocols_protocol_2242_13.csv\nAliquot equal amounts of NT Buffer into each tube of an 8-tube strip. Calculate the required amount of NT Buffer based on the sample number, or prepare for 96 samples (see below tables).\ntable:files/protocols_protocol_2242_14.csv\nFreshly prepare and store on ice.\ntable:files/protocols_protocol_2242_15.csv\nFreshly prepare and store on ice.\n∗Calculation based on a 25% overage.\nOnce the thermal cycler reaches 10°C, apply 1.25 μL of NT Buffer into every tagmented samples for neutralization.\nSeal the plate and vortex at medium speed. Centrifuge at 2,000 g for 5 min.\nAmplify the tagmented cDNA.\nNote: Carefully read the Illumina protocol, “Nextera XT DNA Library Prep Reference Guide” for index primer selection criteria before proceeding to PCR amplification of the tagmented cDNA.\nAliquot equal volumes of Nextera PCR Master Mix (NPM) into each tube of an 8-tube strip. Calculate the required amount of NPM based on the sample number, or prepare for 96 samples (see below tables).\ntable:files/protocols_protocol_2242_16.csv\nFreshly prepare and store on ice.\ntable:files/protocols_protocol_2242_17.csv\nFreshly prepare and store on ice.\n∗Calculation based on a 25% overage.\nApply 3.75 μL of the aliquoted NPM into each well of the “Library Prep” plate using an 8-channel pipette.",
    "Select appropriate Index 1 (N7xx) and Index 2 (S5xx) primers required for all samples. Each Index 1 Primer corresponds to a column of the 96-well plate and each Index 2 Primer corresponds to a row. Apply 1.25 μL of Index 1 Primers (N7xx) into the corresponding wells in row A of the “Library Prep” plate using a 12-channel pipette. As a result, 12 wells in row “A” will contain different Index 1 Primers.\nNote: If a 12-channel pipette is not available, use an 8-channel pipette instead.\nApply 1.25 μL of Index 2 Primers (S5xx) to the corresponding wells in column B of the “Library Prep” plate using an 8-channel pipette. As a result, each of the 8 wells in column “B” will contain different Index 2 Primers.\nSeal the plate with adhesive film and vortex at medium speed for 20 s. Centrifuge at 2,000 g for 2 min.\nPlace the “Library Prep” plate into a thermal cycler and perform PCR amplification.\ntable:files/protocols_protocol_2242_18.csv\nPause point: The PCR products can be remained on the thermal cycler overnight (8 h), or be stored at 2°C–8°C for up to 2 days or at –20°C for long term.\nLibrary pooling, cleanup, and quantification. PCR-amplified, tagmented cDNA is purified by immobilization on AMPure XP beads (Agencourt).\nNote: Before starting, incubate bead aliquots at room temperature (20°C–25°C) for at least 30 min and mix well to disperse.\nDetermine the number of samples to be pooled based on desired sequencing depth and sequencer throughput.\nNote: If preferred, samples can be cleaned up individually prior to pooling.\nIncubate AMPure XP beads at room temperature (20°C–25°C) and vortex for 1 min.\nPrepare the library by pipetting the appropriate volume from each sample into a 1.5-mL tube, according to the desired sample number.\ntable:files/protocols_protocol_2242_19.csv",
    "Add the required amount of AMPure XP beads to the pooled library according to the table above.\nMix well by vortexing or pipetting the entire mixture up and down 5 times.\nIncubate the bead mix at room temperature (20°C–25°C) for 5 min to let the cDNA libraries bind to the beads.\nNote: The beads are viscous. Pipette the entire volume and dispense slowly.\nSpin down before placing the tube on a magnetic stand for 2 min. Confirm that supernatant appears completely clear without any beads left.\nKeep the sample on the magnetic stand and discard the supernatant.\nAdd 180 μL of 70% ethanol without disturbing the beads, incubate for 30 s and carefully remove the supernatant. cDNA libraries will remain bound to the beads during this washing step.\nNote: Prepare fresh 70% ethanol.\nRepeat the above step (ix).\nSpin down and place the sample again on magnetic stand for 30 s before removing all remaining ethanol with a pipette.\nAllow the sample to air-dry for 10–15 min.\nCritical: Be sure that the pellet after drying should look matte with no shine. Insufficient drying or over-drying may reduce the recovery yield.\nOnce the pellet is dry, elute the pooled, purified library by adding a required volume of C1 DNA Dilution Reagent based on the number of pooled samples.\ntable:files/protocols_protocol_2242_20.csv\n∗C1 Dilution Reagent volume is equal to the original pool volume.\nRemove the sample from the magnetic stand and vortex the tube for 3 s to mix thoroughly. Incubate at room temperature (20°C–25°C) for 2 min.\nSpin down and place the sample back on magnetic stand for 2 min or longer, until the solution is completely clear.\nTransfer the entire volume of clear supernatant containing purified cDNA library to a new 1.5-mL centrifuge tube.\nRepeat steps iv – xii.",
    "Elute the library by adding a required volume∗ of C1 DNA Dilution Reagent according to the number of pooled samples.\ntable:files/protocols_protocol_2242_21.csv\n∗C1 Dilution Reagent volume is 1.5 times larger than the initial library volume.\nRemove the tube from the magnetic stand and vortex the tube for 3 s.\nIncubate at room temperature (20°C–25°C) for 2 min.\nPlace the tube on the magnetic stand for 2 min until the supernatant is completely clear.\nCarefully transfer the supernatant to a new 1.5-mL centrifuge tube labeled as “Cleaned Lib.”\nQuantify the cDNA library and check its quality using a Bioanalyzer 2100 (Agilent) with a High Sensitivity DNA kit (Agilent) in triplicate (see Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2242-Fig8.jpg\nFigure 8. Quantitative of the single-cell cDNA library using Bioanalyzer\nThe representative quantification data of control NHEKs single cell cDNA library with Bioanalyzer is shown.\nRefer to the “Nextera XT DNA Library Preparation Guide” to determine the appropriate library concentration for sequencing.\nProceed to next generation sequencing in single-end mode using Illumina HiSeq 2500 platform (Illumina) at the read depth of 1 million reads per cell.\nSequencing, mapping, and data analysis\nTiming: approximately 1 week\nEvaluate raw sequencing data using FastQC.2[href=https://www.wicell.org#bib2]\nRemove adapter sequence using Cutadapt.3[href=https://www.wicell.org#bib3]\nMap sequence reads to the reference genome (hg38) together with the GENCODE human annotation by using STAR.4[href=https://www.wicell.org#bib4]\nGenerate a count matrix using featureCounts.5[href=https://www.wicell.org#bib5]\nConduct downstream analysis using Seurat (v3.1.5) on R.6[href=https://www.wicell.org#bib6]",
    "Note: Cells with poor quality should be filtered out based on 3 major criteria: total count number, total detected gene number, and percentage of mitochondrial genes. Given significant batch differences in stimulated cell preparation, cDNA library preparation, and sequencing between the 2 conditions, it is critical to use a suitable batch-effect correction method to remove batch effects before further analysis. For our data, Harmony was used (v1.0).7[href=https://www.wicell.org#bib7] More analysis details are available in Siriwach et al.1[href=https://www.wicell.org#bib1]"
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Cell Biology",
    "Developmental Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}