{
  "id": 10928,
  "origin_website": "Jove",
  "title": "The Multi-organ Chip - A Microfluidic Platform for Long-term Multi-tissue Coculture",
  "procedures": [
    "NOTE: Human juvenile prepuce was obtained with informed consent and ethics approval (Ethic Committee Charité University Medicine, Berlin, Germany), in compliance with the relevant laws, from a pediatric surgery after routine circumcisions.\n1. Production of Tissue Equivalents for Cultivation in the MOC\nAggregate HepaRG and HHSteC in hanging drop plates to generate liver spheroids.\n\t\nIn order to achieve the trypsinization of HepaRG cells grown in cell culture flasks (75 cm2), remove the medium from confluent, differentiated monolayer cultures, wash with PBS twice, and add 3 ml of 0.05% Trypsin/EDTA. Incubate for 3 to 5 min at 37 °C and stop the reaction by adding 6 ml of trypsin inhibitor.\nCentrifuge HepaRG cells at 150 x g for 5 min, remove supernatant, resuspend the cell pellet in 1 ml of HepaRG cell culture medium, and count cells. Cell viability should be >90%.\nIn order to achieve the trypsinization of HHSteC cells, remove the medium from monolayer cultures, wash with PBS twice, and add 3 ml of 0.05% Trypsin/EDTA. Incubate for 5 min at 37 °C and stop the reaction by adding 6 ml of trypsin inhibitor.\nCentrifuge the HHSteC cells at 150 x g for 5 min, remove supernatant, resuspend the cell pellet in 1 ml of HepaRG cell culture medium, and count cells.\nCombine HepaRG and HHSteC at a ratio of 24:1 in HepaRG cell culture medium. To do so, adjust cell numbers by diluting cell suspensions in HepaRG cell culture medium and add 1 x 105 cells/ml HHSteC to 4.8 x 106 cells/ml HepaRG cells. Mix carefully.\nPrepare a hanging drop plate by adding 2 ml of PBS to the hanging drop and receiver plate.",
    "Pipette 20 µl of the cell suspension into each well of the hanging drop plate. Always prepare about 10% more hanging drops than you need to retrieve aggregates, as some aggregates are lost during the procedure. Carefully place the plate in a 37 °C incubator. Wait 48 hr for the spheroids to form.\nIn order to retrieve the spheroids, be sure to use pipette tips with wide tip endings or cut the tips of 1 ml pipette tips with a sterile knife in order to widen the opening to about 2 to 3 mm. Use these pipette tips to handle the spheroids without disrupting them.\nWash off spheroids carefully from the hanging drop plate by repeatedly adding 1 ml of media to the top of the wells of the hanging drop plate using a pipette. Wash the plate until all the spheroids have fallen off. Spheroids are slightly disc-shaped with a medium diameter of 300 to 400 µm and a height of 200 to 300 µm at this point.\nCollect the spheroids in the receiver plate and transfer them to 24-well ultra-low attachment plates with a maximum of 20 spheroids per well using the prepared pipette tips. Adjust the media volumes in each well to 0.5 ml. Use 20 aggregates to inoculate one MOC circuit to obtain a miniaturization rate of 1/100,000 regarding in vivo cell numbers.\nIncubate the spheroids at 37 °C and 5% CO2 until further use in the MOC. Do not store the spheroids longer than three days before usage to assure comparability. Cultivate the aggregates for at least one day in ultra-low attachment plates to retrieve the homogenous spheroids.\nPursue either of two approaches to generate skin tissue equivalents: the use of punch biopsies (1.2.1) or the use of ready-made in vitro tissue models (1.3.1).",
    "Cut transwells with an incandescent knife below the bracket to prepare 96-well cell culture inserts and store under sterile conditions until further use.\nSterilize prepuce samples in 80% ethanol for 30 sec and cut the ring open. Samples should have an average height of 2 mm.\nUse a biopsy punch to cut biopsies of 4.5 mm diameter to obtain an equal miniaturization ratio for both liver and skin. Load the biopsies into the prepared 96-well transwell inserts with forceps. Take care to position the biopsies with the epidermal side facing upwards.\nPlace cell culture inserts with biopsies in a receiver plate containing HepaRG cell culture medium and store at 37 °C and 5% CO2 until further use in the MOC. Do not store samples longer than 2 to 3 hr.\nIntegrate ready-made in vitro skin models, purchased from various suppliers, into the MOC, making sure that they are in 96-well transwell format. Use the cell culture medium supplied by the vendor or, if a coculture with another tissue is envisaged in a further step, use a minimal medium supporting both tissues. Test the respective minimal medium in prior static experiments for its capacity to support the tissues.\n\t\nRetrieve skin models from the holder plate and cut the 96-well inserts below the bracket with an incandescent knife.\nPlace the inserts back into the receiver plate and store at 37 °C and 5% CO2 until further use in the MOC. Do not store samples longer than one day.\n2. MOC Fabrication\nMix the PDMS and curing agent at a ratio of 10:1 (v/v) and place the mixture under vacuum for 15 min to remove air bubbles.\nMeanwhile, treat a polycarbonate cover-plate with the silicon rubber additive at 80 °C for 20 min.",
    "Insert Teflon screws into respective holes of the cover-plate to create the four PDMS-free cell culture compartments and the six PDMS membranes, 500 µm thick, of the micropump.\nPlug the prepared cover-plate to the master mold of the two microvascular circuits and inject the degassed PDMS. Take care not to integrate air bubbles into the system. If bubbles emerge, try to remove them by tilting the device.\nIncubate the system at 80 °C for 60 min to cure the PDMS layer.\nRemove the master mold and the Teflon screws from the device and bond the PDMS layer to a glass slide with a 75 x 25 mm2 footprint using low pressure plasma oxidation.\nScrew special thread MOC adapters to all four cell culture compartments of the cover-plate.\nConnect syringes containing culture medium to female Luer x ¼-28 male adapters and screw them to the MOC adapters of the cover-plate.\nInject the medium into the microfluidic circuit by repeatedly pushing down and pulling up the syringes plungers.\nCheck the proper filling of the channels with medium under the microscope.\n3. Endothelialization of the MOC\nPrior to endothelializing the MOC, flush each MOC circuit with endothelial cell growth medium and incubate it statically for three days at 37 °C and 5% CO2.\n\t\nSterilize the MOCs using an ethanol wipe and place them under a laminar flow bench. In addition, sterilize two pairs of forceps and two hexagonal keys for further use.\nLoosen the caps of the tissue culture compartment of the MOC using the hexagonal keys and remove the caps using the forceps. After inserting the medium, screw caps back on to the MOCs in the same way.",
    "In order to achieve the trypsinization of human dermal microvascular endothelial cells (HDMEC), remove the medium from the monolayer cultures, wash with PBS twice, and add 3 ml of 0.05% Trypsin/EDTA. Incubate for 5 min at 37 °C and stop the reaction by adding 6 ml of trypsin inhibitor.\nCentrifuge the HDMEC at 220 x g for 5 min, remove supernatant, resuspend the cell pellet in 1 ml of endothelial cell growth medium, and count cells. Cell viability should be >90%.\nAdjust the cell count in the cell suspension to a final concentration of 2 x 107 cells/ml by diluting it with endothelial cell growth medium and transfer 250 µl of it to a 1 ml syringe. Apply this concentration of cells to the MOC to keep the miniaturization rate of 1/100,000 for all organs.\nConnect the syringe to a female Luer x ¼-28 male adapter, expel the air out of this fitting, and screw it to a special thread MOC adapter. Connect the adapter to one of the two compartments of each MOC circuit.\nConnect an empty syringe in the same way to the second compartment of the MOC circuit.\nInject the cells evenly by pushing down and pulling up the two syringe plungers several times in a consecutive way. Control the infusion of cells under the microscope.\nIncubate the MOC at 37 °C and 5% CO2 under static conditions for 3 hr to allow the cells to adhere to the channel walls.\nRemove the chip from the incubator, place it under a laminar flow bench, and replace the syringes and the MOC adapters with special thread MOC cell culture chambers.",
    "Add 400 µl of fresh medium to one compartment of each MOC circuit and let it flush through the channels by hydrostatic pressure. Afterwards, replace the medium in both compartments with 300 µl of fresh medium.\nClose the compartments using caps, as described in 3.1.2.\nConnect the chip to the pump control unit. Adjust the pumping velocity to a frequency of 0.475 Hz and cultivate the chip at 37 °C and 5% CO2.\nReplace the medium of each MOC compartment every one to two days and monitor the cell morphology by light microscopy.\n4. Loading of the Chip\nPlace the MOC under the laminar flow bench and open it, as described in step 3.1.2.\nRemove the media from the tissue culture compartments and replace it with 300 µl of fresh HepaRG cell culture medium.\nTransfer 20 preformed spheroids to one tissue culture compartment of each MOC circuit using the pipette tips with a wide opening (see steps 1.1.8/9). Close the cap using forceps and hexagonal keys.\nTransfer 96-well cell culture inserts containing skin equivalents to the remaining tissue culture compartment of each MOC circuit using forceps. Take care to avoid bubble formation below the membrane of the skin equivalent. In order to do this, insert transwells at a slightly tilted angle and push down gently. Remove excess medium around the transwell being pushed up from below with a pipette.\nClose the cap using forceps and hexagonal keys.\n5. Connecting the Chip to the Pump Control Unit\nSet operational parameters in the control units to the values desired. Modify air pressure from 0 to 8,000 mbar, vacuum from 0 to -800 mbar, and pumping frequency from 0.24 to 2.4 Hz. Set the pumping direction clockwise or counterclockwise.",
    "Remove the MOC containing tissue equivalents from under the laminar flow bench and connect it to the pump control units.\nFollowing the numeration on the tubes, insert air pressure tubing to the respective fittings on the MOC.\nCultivate the MOC at 37 °C and 5% CO2 in an incubator or, in the case of live tissue imaging, use the MOC support to heat the chip to 37 °C and cultivate the chip outside the incubator. Use the heated support to cultivate cells in the MOC under a standard microscope.\n6. Performing Media Exchanges, Sampling Media and Exposure to Substances\nPerform routine media exchange every day or every other day, considering the type of tissue cultured and the metabolic activity of the cells.\n\t\nRetrieve the MOC from the incubator and observe it under the microscope to control media flow rates and check for contamination.\nDisconnect the MOC from the pump control unit by unplugging the air pressure tubing. Sterilize the MOC using ethanol wipes and put it under the laminar flow bench.\nOpen the tissue culture compartment containing the liver spheroids, as described in step 3.1.2.\nRemove up to 200 µl from the compartment using a pipette without disrupting the spheroids and store the medium in an empty well of a deep-well plate. Analyze the media sample directly or close the deep-well plate and store the media samples at -80 °C for further analysis.\nReplace the medium of the MOC with up to 250 µl fresh cell culture medium and close the cap. The difference in the amount of medium removed and replaced accounts for the loss due to small amounts leaking out of the chip when closing the system.",
    "Open the cap of the tissue culture compartment holding the skin equivalents at this point to check for tissue intactness. Take care not to introduce air bubbles into the system. Close the cap.\nConnect the tubing of the pump control unit to the MOC, according to step 5.3, and place the MOC in an incubator.\n7. Analyze Daily Media Samples and Perform On-line Analysis\nAnalyze tissue culture performance on-line using live cell imaging or offline, by analyzing the daily media samples. Perform the latter by standard routine enzymatic assays (e.g. lactate dehydrogenase (LDH) activity) or ELISA (e.g. albumin concentration). An online analysis is described in the following.\nRemove the media of the endothelialized MOC, as described in steps 6.1.1 to 6.1.4, and replace it in both tissue culture compartments with 200 µl of 10 µg/ml fluorophore conjugated acetylated low-density lipoprotein (LDL) solution (diluted in cell culture media).\nClose the caps. Connect the MOC to the pump control unit, according to step 5.3, and pump it for 30 min at 0.475 Hz to distribute the solution evenly within the microfluidic circuit.\nStop the pumping and incubate the MOC statically for 3.5 hr at 37 °C and 5% CO2.\nSimilar to step 7.2, remove the acetylated LDL solution from both compartments and replace it with 400 µl of fresh medium in one of the two compartments.\nWait for 3 to 5 min to let the hydrostatic pressure drive the medium through the microfluidic channel circuit.\nReplace the medium which has flowed through with 300 µl of fresh medium and also fill the second tissue culture compartment with 300 µl of fresh medium.\nClose the MOC, according to step 3.1.2. Put it under a fluorescence microscope and observe cell growth and viability.",
    "Place the stained MOC back in the incubator to continue cultivation. Remove the stain leaking out of the cells with each following media replacement.\n8. Retrieve Tissue Equivalents from the MOC and Perform End-point Analyses\nRetrieve tissue equivalents from the MOC at the end of the experiment for endpoint analyses.\n\t\nIn order to retrieve the liver and skin equivalents from the MOC, remove the media from each tissue culture compartment, as described in steps 6.1.1 to 6.1.4.\nRemove the 96-well cell culture inserts containing the skin from the MOC using forceps. Peel off the membrane carefully from the insert by gripping it on one side with forceps and pulling it down. Take care not to lose the skin equivalent at this point.\nFreeze the membrane holding the skin equivalent in cryo-embedding compound and store it at -80 °C until further analysis.\nRemove the liver equivalents similarly from the tissue culture compartment by pipetting them using cut pipette tips (see step 1.1.8/9).\n\t\nEmbed the liver spheroids in cryo-embedding compound. Take care not to transfer too much liquid and remove any excess fluid with a pipette. After placing the spheroids onto the embedding compound and removing the medium, add further cryo compound onto the top of the spheroids to fully enclose them.\nFreeze the liver equivalents and store it at -80 °C until further analysis.\nPerform endpoint analysis by cutting the tissue equivalents in a cryo-microtome to 8 µm sections and staining for tissue-specific markers, as described in previous protocols 10."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}