{
  "id": 15140,
  "origin_website": "Jove",
  "title": "CRISPR/Cas9 Ribonucleoprotein-mediated Precise Gene Editing by Tube Electroporation",
  "procedures": [
    "All animal maintenance, care, and use procedures were reviewed and approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Michigan.\n1. Preparation of Cells\nAcquire human iPSCs (ACS-1030) from the American Type Culture Collection (ATCC). Culture iPScs on artificial extracellular matrix with feeder-free cell culture medium (see Table of Materials) in a cell culture incubator (5% CO2 at 37 °C) following the supplier's instructions.\n2 h prior to transfection, treat the iPSCs with 10 µM Rho-associated, coiled-coil containing protein kinase (ROCK) inhibitor Y27632 (use of which reduces apoptosis of dissociated human hiPSCs and increases survival and cloning efficiency of hiPSCs without affecting their pluripotency).\nWhen transfecting, dissociate iPSCs with cell detachment solution (see Table of Materials) to single cells at 37 °C for 5 min. Count the cell number.\nEstablish a rabbit fibroblast cell culture using a primary culture of rabbit ear skin tissue biopsies, as previously described10.\nA 0.5 cm x 0.5 cm ear skin biopsy is obtained from the tip of the rabbit ear. Shave the hair off the ear tissue.\nRinse 2x with Dulbecco's phosphate-buffered saline (DPBS) with 5% penicillin-streptomycin. Transfer the ear tissue to a new 6 cm tissue culture dish, then cut the tissue into small pieces (~1.0 mm x 1.0 mm). Add a few drops of fetal bovine serum to prevent the tissue from drying out.\nSpread the shredded tissue to a 10 cm tissue culture dish, then add 10 mL of culture medium. Rabbit fibroblast cells are cultured in Dulbecco's Modified Eagle's Medium (DMEM) with 10% fetal bovine serum. Put the tissue culture dish in the cell culture incubator (5% CO2 at 37 °C).\nThree to five days after plating, use trypsin-EDTA to digest cells at 37 °C for 2 min. Count the cell number.",
    "2. Design and Synthesis of gRNAs and Donor Oligos\nFor each gene, design guide RNA based on the sequence of the targeted locus using an online tool (for example, <http://crispor.tefor.net/>).\nPaste in the DNA sequence of interest.\nSelect a genome and protospacer-adjacent motif (PAM). Possible guide sequences in input DNA sequences will be displayed on the output page. It is recommended to select gRNA with higher predicted efficiency and lower off-target potentials.\nSynthesize DNA by a commercial vendor for transcribing gRNAs. Perform in vitro transcription of gRNA using a gRNA synthesis kit according to the manufacturer's instructions.\nPurify the gRNA using an RNA purification micro column included in the gRNA synthesis kit. Measure the concentration, then store the gRNAs at -80 °C.\nDesign an ssODN donor template for each mutation site. The ssODNs can be synthesized by commercial vendors such as IDT. In general, each ssODN is 120-160 nucleotides (nt) in length, consisting of 60-80 nt in the left homology arm and 60-80 nt in the right homology arm. To prevent recutting of the edited DNA, a silent mutation at the PAM should be introduced in the ssODN whenever possible. The CRISPR cut site should be located as close to the intended genomic change as possible.\n3. Tube Electroporation of Cas9 RNP and ssODNs\nPrepare the cells as described in section 1.\nResuspend 2-3 x 105 cells in 20 µL of electroporation buffer. Pipette up and down carefully to produce a single-cell suspension.\nFor Cas9 RNP transfection, premix 2 µg of Cas9-NLS protein with 0.67 µg of gRNA at room temperature (RT) for 10-15 min. Next, gently mix the formed RNP complex along with 2 µg of ssODN with cells.",
    "Transfer the cell mixture to a 20 µL electroporation tube using universal fit pipette tips provided by the tube electroporation kit. To achieve better electroporation, try to avoid the formation of air bubbles during transfer.\nPlace the electroporation tube into the slot of the electroporator and press \"Go\" to finish. Follow manufacturer's suggested parameters for each cell type. For example, for human iPSCs and rabbit fibroblast cells, the voltage set is 420 V and pulse time is 30 ms. A successful electroporation cycle is indicated by the pulse report on the display screen of the electroporator.\nAfter the electroporation, transfer the human iPS cells to 1 mL of pre-warmed Y-27632-containing culture medium described in cell culture part. For rabbit fibroblast cells, transfer them to DMEM with 10% fetal bovine serum.\nPlate the resuspended cells to one well of a 12 well cell culture plate.\nChange the culture medium every day. Y-27632 is removed from the human iPSC culture medium 24 h post-electroporation.\n4. Analysis of Gene Editing Events\nHarvest cells 72 h after electroporation. Digest cells from the culture plate using trypsin-EDTA for rabbit fibroblast cells or cell detachment solution for human iPSCs. After centrifuge, resuspend cells with 350 mL of lysis buffer (1 M Tris HCl, 5 M NaCl, 0.5 M EDTA; pH 8.0, 10% SDS, add 20 µL of 20 mg/mL proteinase K stock per 1 mL of lysis buffer), then incubate at 55 °C overnight.\nExtract the genomic DNA with phenol-chloroform using standard procedures.\nAmplify 100-200 bp DNA fragments containing targeted region using high-fidelity DNA polymerase, then purify the DNA fragments from gels using a gel extraction kit or directly from PCR products using a PCR SV mini kit.",
    "To determine gene editing efficiency by bacterial colony sequencing, ligase the purified PCR products into a pCR4-TOPO vector using a TOPO TA cloning kit. Randomly pick up bacterial clones, then sequence the inserts using a universal sequencing primer provided by the TOPO TA cloning kit.\nTo determine gene editing efficiency by deep sequencing, send the purified PCR products (~100-200 bp) from step 4.3 for CRISPR amplicon sequencing in a DNA sequencing core."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}