{
  "id": 2428,
  "origin_website": "Cell",
  "title": "Standardized hypoxia-reoxygenation protocol to assess posthypoxic neurobehavioral impairments and molecular mechanisms in Drosophila melanogaster",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFly preparation for hypoxia\nTiming: 30 min\nIn this step the flies are prepared for the hypoxia and transferred into the designated hypoxia vials.\nTransfer the collected F1 male flies (now 1–5 d old) into vials for hypoxia.\nAnesthetize the flies in each vial using CO2.\nTransfer all 20 flies of each vial into an empty vial without food.\nUse gauze to cover the open side of the vial to guarantee an effective gas exchange.\nFix the gauze with a rubber band.\nPrepare the flies for the normoxia control condition.\nKeep the flies in the same vials with food.\nAnesthetize the flies in each vial using CO2.\nExchange the plug and cover the open side of the vial with gauze and rubber bands.\nCritical: Keep the CO2 anesthesia time as short as possible as pre-hypoxic anesthesia might influence the adaptation of the flies to the hypoxia. Use the same anesthesia times for hypoxia and normoxia conditions. Before hypoxia induction make sure all flies have recovered from the CO2 anesthesia in their vial. We recommend a recovery period of at least 3 min.\nNote: The normoxia flies should be kept in vials with food to prevent stress from starvation. However, flies subjected to hypoxia should be kept in vials without food to prevent them from sticking to the food when unconscious during hypoxia, as this could negatively bias mortality rates. Since the flies lose consciousness shortly after exposure to hypoxia, they do not require food during hypoxia.\nHypoxia induction\nTiming: 2.5 h\nNote: Timing depends on hypoxia duration, which is adjustable depending on the experiment and the genotype used.\nIn this step the flies are subjected to a hypoxic stimulus for a designated period of time under controlled and monitored environmental conditions.",
    "Place the vials into the hypoxia chamber. A detailed description of such a hypoxia chamber can be found in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1912-Fig3.jpg\nFigure 3. Technical illustration and details of the hypoxia chamber\n(A) Complete setup of the hypoxia chamber with air heater and humidifier, pressure sensor, oxygen sensor and temperature and humidity sensor. This graph was taken from (Habib et al., 2021[href=https://www.wicell.org#bib4]).\n(B) Technical illustration of the self-designed hypoxia chamber.\n(C) Technical illustration and dimensions of the chamber and the lid.\n(D) Technical illustration and dimensions of the top of the chamber.\n(E) Technical illustration and dimensions of the bottom of the chamber.\n(F and G) Technical illustration and dimensions of the lid. View from above (F) and view from below (G).\nPlace the temperature and humidity sensor inside the chamber alongside the vials.\nClose and secure the lid tightly. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nAttach the pressure gauge to the chamber.\nAttach the oxygen sensor to the top of the chamber.\nClose any unused valves of the chamber and open the gas outflow valve.\nOpen the gas entry valve and start the nitrogen gas flow to flood the hypoxia chamber.\nPass the gas through a heated water container to humidify the gas.\nKeep the inflow at a controlled and steady rate. We recommend an air flow rate of ∼ 15 L/min.\nFlood the hypoxia chamber with the humidified nitrogen until an oxygen concentration of < 0.3% is reached, then stop the gas flow, close the gas entry valve and then the gas outflow valve. During hypoxia induction, monitor humidity and pressure in the chamber. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nPlace the hypoxia chamber in an incubator (29°C, 50%–70% humidity, atm. pressure) for the experiment. Monitor oxygen levels, temperature, humidity and pressure regularly during the hypoxia.",
    "Place the vials containing the normoxia control group next to the hypoxia chamber in the incubator for the duration of the hypoxia.\nNote: Other gasses besides nitrogen, such as CO2, can also be used to induce hypoxia.\nCritical: Make sure that the gas outflow valve is at the top of the chamber as nitrogen displaces oxygen upwards. When using different gases, take their density into consideration and adjust flooding from the top or the bottom accordingly. Monitoring and maintaining the environmental factors temperature, humidity and pressure at their set value is crucial to ensure reproducible results, as these parameters have an impact on the outcome of the flies after hypoxia (Figures 4[href=https://www.wicell.org#fig4]A–4C). Therefore, it is important to humidify the gas before flooding, to set a specific temperature and to make sure the hypoxia chamber is equipped with a pressure relief valve to prevent overpressure. It is vital for the reproducibility of the results to keep these environmental parameters the same throughout all hypoxia experiments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1912-Fig4.jpg\nFigure 4. Posthypoxic mortality of 1–5 d old male Canton-S after 2.5 h of severe hypoxia (< 0.3% O2) under different environmental conditions during a reoxygenation period of 120 h\n(A) Graph displaying the O2 levels, humidity, pressure and temperature in the hypoxia chamber during 3 h of hypoxia.\n(B) Posthypoxic death rates of Canton-S wildtype flies during a reoxygenation period of 120 h after 2.5 h of hypoxia (29°C, atm. pressure) with either 10%–20% or 50%–70% of humidity in the hypoxia chamber.\n(C) Posthypoxic death rates of Canton-S wildtype flies during a reoxygenation period of 120 h after 2.5 h of hypoxia (29°C, 50%–70% humidity) with either atmospheric pressure or 280–300 mbar positive pressure.",
    "(D) Posthypoxic death rates of Canton-S wildtype flies during a reoxygenation period of 120 h after 2.5 h of hypoxia (50%–70% humidity, atm. pressure) at either 23°C or 29°C. Data are shown as means ± SEM of 3 independent experiments, including 3 technical replicates per experiment (total of 180 male flies for each condition). Multiple t-tests. ∗∗p<0.01; ∗∗∗p<0.001. The graphs B, C and D were modified from (Habib et al., 2021[href=https://www.wicell.org#bib4]).\nReoxygenation\nTiming: 5 min + reoxygenation period\nNote: Timing depends on the duration of the reoxygenation period. The duration of the reoxygenation period can depend on the chosen readout (see 17. Readout recommendations).\nIn this step, hypoxia is terminated and the flies are transferred to a normoxic environment for a designated period of time under controlled and monitored conditions.\nOpen the hypoxia chamber and take out the fly vials.\nRemove the rubber bands and gauze and transfer the flies from each vial into new vials with fresh food.\nKeep flies in the incubator at 29°C, 50%–70% humidity and atm. pressure as described in section “fly husbandry[href=https://www.wicell.org#sec1.1]” for the entire reoxygenation period.\nRepeat steps 14 and 15 with the normoxia control flies.\nNote: Place vials on the side until flies regain movement ability to prevent the flies from sticking to the food.\nReadout recommendations:\nMortality rate assessment: To assess the mortality rate during a reoxygenation period, count the number of dead flies per vial 6, 24, 48, 72, 96 and 120 h after hypoxia.\nNote: The presence of dead flies may trigger a stress response in the remaining flies. However, removal of the dead flies entails recurrent exposures to CO2-anesthesia, which could influence outcome after hypoxia. This should be taken into consideration for further analyses.",
    "Negative geotaxis assay: Assess the post-hypoxic evoked climbing ability at 3, 6, 24, 48, 72, 96 and 120 h of reoxygenation under normal lighting conditions.\nTransfer the groups of flies into empty plastic vials with a mark at 8 cm.\nTap the flies to the bottom.\nAssess the percentage of vivid flies that are able to reach the 8 cm mark in 10 s.\nRepeat step ii. and iii. 10 times with 50 s recovery time between each repetition (Ali et al., 2011[href=https://www.wicell.org#bib1]).\nDrosophila activity monitoring: Monitor the post-hypoxic activity of the flies under controlled environmental conditions in a Drosophila Activity Monitoring System.\nTransfer each fly individually into one food-containing polycarbonate vial (∼ 1.5 cm food height) after the hypoxia using a forceps or a paint brush.\nNote: As the flies subjected to hypoxia do not regain consciousness until approximately 30 min after hypoxia, no CO2 anesthesia is needed for this step. However, normoxia flies need to be anesthetized for the transfer into the DAM-tubes.\nStart the recording in the DAMSystem3 Software. Set the recording frequency to 1 h. The activity is automatically recorded using a light beam passing through the center of each vial. Any interruption of the light beam, e.g., caused by a fly crossing through it, is detected.\nCritical: Since the time of day affects fly activity, it is important to keep hypoxia times as well as the start point for the DAM measurements similar for all runs.\nKeep the flies in the DAM system in an incubator set to 29°C, 50%–70% humidity and atm. pressure for a total of 5 days.\nAfter 5 days, examine every fly individually to determine the total death rate.",
    "Note: Lighting conditions can be adjusted depending on the readout you are aiming for. It is possible to assess activity by either exposing the DAM system to constant light over the entire observation period or simulate a day-night rhythm by alternating 12 hours of light and 12 hours of darkness. It is also possible to analyze circadian rhythms through first synchronizing the circadian rhythm for 3 days by exposing the flies to a light-dark rhythm and then assessing the activity patterns during 5 days of constant darkness (Cichewicz and Hirsh, 2018[href=https://www.wicell.org#bib2]; Schmid et al., 2011[href=https://www.wicell.org#bib6])."
  ],
  "subjectAreas": [
    "Metabolism",
    "Neuroscience",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}