{
  "id": 8349,
  "origin_website": "Jove",
  "title": "Objectively Assessing Sports Concussion Utilizing Visual Evoked Potentials",
  "procedures": [
    "Approvals for the first part of the protocol was obtained from the South Eastern Sydney Local Health District (ESLHD) Human Research Ethics Committee (HREC). All players were provided with detailed participant information sheets and consent was obtained prior to participation (SESLHD-HREC reference number: 17/039 HREC/17/POWH/91).\nApprovals for the use of improved portable system study was obtained from Bellberry Human Research Ethics Committee (HREC). All control subjects were provided with detailed participant information sheets and consent was obtained prior to participation (HREC Reference number: 1802VEPEEG-CER).\n1. Participant screening and consent\nRecruit participants from a single rugby union club prior to the commencement of a competitive season. Participants must be healthy, native English-speaking, male adults (over the age of 18) who are members of an amateur rugby union team (Figure 1).\n\t\nDue to the flickering nature of the visual stimuli, ensure that the participants do not meet any of the following strict exclusion criteria: diagnosis or symptoms of epilepsy, existing and/or previous brain injuries, or legal blindness.\nInform the participants to report any symptoms following an injury on the sporting field truthfully to the medical practitioner who forwards the information to the associated study investigator(s). The participants must understand that the study involvement requires a minimum of two SSVEP testing sessions during the season, with the potential for further testings in the event of a concussive injury.\n2. Investigative SSVEP equipment setup\nFit a charged liquid-crystal display (LCD) smartphone into a Virtual Reality (VR)-frame (Figure 2A; see Table of Materials).",
    "Generate a .mp4 video file consisting of a sequence of black and white screens alternating at a frequency of 15 Hz, for a total of 30 s. Place a random number in the center of the video frame (occupying less than 2% of the screen with a visual angle of 1.5°) for the participants to focus centrally upon during the stimulation. Ensure that the number is altered at 5 s intervals to encourage sustained attention (Figure 2B).\nUpload the constructed video file to the smartphone and display it at full brightness (minimum ~490 nits), acting as the visual stimulus of the SSVEP system.\nCharge the wireless 14-channel EEG headset, which will be used as the primary EEG recording device (Figure 3A).\n\t\nPair the headset to a nearby computer via the supplied universal USB Receiver (dongle). Insert the dongle into the computer's USB port, turn on the headset via the power button, open the 14 channel EEG headset software on a computer and select the Connect button on the application next to the displayed headset ID (see Table of Materials).\nCompletely saturate the supplied felt sensors with saline solution.\n\t\nInstall the saturated sensors into the black plastic arms of the headset by gently turning each sensor clockwise until a \"click\" is felt and the sensor feels secure.\n3. Participant baseline assessment\nObtain consent from all participants who have passed the screening questions to be involved in the study before the rugby season commences.",
    "Ask consented participants to be seated in a chair in a quiet enclosed environment with natural ambient light, such as an office room. While the participants are seated, fit the 14 channel EEG headset to the participants' heads by sliding the headband down from the top of their head. Arrange the electrodes according to the International 10-20 system (Figure 3B)28,29. Position the two front sensors of the headset in line with the participants' hairline or roughly three finger widths above the participants' eyebrows.\n\tNOTE: If the participants have thick hair, work the sensor under the hair, and add additional saline. If the subject moves from the stationary seated position or there is a change in environmental settings during the assessment, an artifact (Figure 4) can occur, and the SSVEP data should not be collated for the analysis (discarded).\n\t\nUse the occipital electrodes (O1 and O2) as the main recording electrodes and the parietal electrodes (P3 and P4) as the ground and common-mode (reference) electrodes (Figure 3B).\nEnsure there is an adequate connection between the headset and the participants' head by utilizing contact quality software before proceeding with testing. Green electrodes indicate good contact quality (<20 kOhms) according to the manufacturer's standards.\n\t\nIn the event a good contact quality was not achieved for all electrode channels of interest (O1, O2), re-saturate the sensors with saline solution and re-check positioning to ensure the sensors are as flush against the scalp as possible.\n\t\tNOTE: Good contact quality must be obtained to ensure electrical connectivity between the scalp and electrodes, minimizing potential artifacts (Figure 4).\nAsk the participants to hold the testing smartphone within the VR-frame up to the eyes, flush against their faces and nasal bridge, ensuring both eyes are completely covered.",
    "Have the participants confirm that the focal number is visible at the center of the screen and that the frame is blocking out environmental light.\nRemove the VR-frame from the participants' face and inform them that the visual stimulus video will now be initiated. Then hand them back the VR-frame to reapply in the same position as step 3.4.1.\n\t\nRemind the participants that they are to focus on the focal number and remain still and quiet during the duration of the SSVEP testing.\nInitiate the visual stimulus video by pressing the Play button on the smartphone screen, and then have the participants place the VR-frame on his face (as per step 3.4).\nAsk the participants to confirm they have the VR-frame in the correct position as per step 3.4. Following participant's confirmation, simultaneously begin a countdown stopwatch for 30 s and then select the Start Recording button on the 14-channel EEG headset software to begin recording on the EEG headset.\nOnce the 30 s period is over, stop the EEG recording by selecting the Stop button on the 14-channel EEG headset software.\n\t\nRemove the VR-frame from the participants' eyes and inform them that the first SSVEP assessment is complete.\nSave the recorded SSVEP response to the local account by clicking on the Saved Sessions button on the 14-channel EEG headset software. Export the saved file as a European Data Format (EDF) file to a preferred storage hardware device.\n\tNOTE: EDF files are to be labeled with the participant's initials, date, time, and the type of test conducted (baseline, post-injury, or recovery) for identification and storage purposes.\nRepeat SSVEP assessment protocol (steps 3.2 to 3.9) in quick succession following step 3.9.\n\t​NOTE: This is conducted as the second reading from the two assessments and yields a consistently clearer EEG reading.",
    "Once the pair of SSVEP assessments have been successfully completed, have the participant remove the VR-frame from their eyes, and carefully remove the headset from the participants' heads.\n\t\nRemove the electrode sensors from the headset and store them in an appropriate protective case until their next use to ensure that the saline does not corrode the headset's electrodes.\nClean both the headset and smartphone + frame with isopropyl alcohol (70%) wipes before storing both pieces of equipment in their respective cases until their next use.\nAsk the participant whether they experienced any abnormal reactions to the stimulus, including the presence of a headache or dizziness. Record the response in a study log.\nInform the participant that they have completed their baseline testing and will be assessed again within 72 h of the next competitive game of the season.\n4. Post-injury assessment\nEnsure that any impact on the field suspected to be a concussion is recorded and reported back to the study investigator by either the team physician or player.\nObtain post-injury assessments of any players who were reported in step 4.1 within 72 h of the incident using the SSVEP protocol detailed in section 3.\nEnsure all players undergo a post-injury SSVEP assessment, which is evaluated by the team physician (see section 5) to determine when the player has recovered from the injury and can return to full-contact training and games. Ensure the team physician's diagnosis is recorded for investigational purposes.\n\t\nInform the player that they will be reassessed with the SSVEP system once deemed recovered by the team physician.\n5. Clinical concussion evaluations\nEnsure all players are evaluated by the team physician within 72 h of a potential concussion-generating impact.",
    "NOTE: The team physician must be a licensed practitioner with clinical experience in assessing sports-related injuries and approved by a relevant sport's governing body.\n\t\nHave the team physician perform a neurological exam in addition to using elements of the Sport Concussion Assessment Tool (SCAT) to determine the player's state of consciousness, and presence of any of the common signs and symptoms associated with concussion15.\n\t\tNOTE: Assessments are made with the player's typical demeanor and behavior as a reference.\nAs per Rugby Australia's Graduated Return to Play (GRTP) guidelines30, ensure the player is re-evaluated by the same team physician within 48 h of a concussion diagnosis, and again once per practice session until cleared to return to play30.\nEnsure players undergo a final evaluation with the team's physician to determine whether they have clinically recovered, before allowing them to return to full-contact practice or games. The physician is to determine the player's injury state based on the improvement in SCAT testing and reduction in associated symptoms and any atypical behavior, which was previously noted.\n\tNOTE: This final evaluation is to occur following a minimum of 12 days post-injury as per GRTP.\n\t\nRecord the clinician's determination of the player's injury state (concussed or recovered) for investigational purposes.\n6. Recovery assessment\nAssess the players who were deemed recovered in step 5.3 using the SSVEP protocol detailed in section 3 to obtain a recovery SSVEP response.\n7. Test-retest reliability assessment\nEnsure all non-injured participants are retested within 72 h following each competitive game of the season with the portable SSVEP system in the same setting as detailed in section 3 to obtain data for test-retest reliability of the system.\n8. SSVEP data processing",
    "Generate a numerical computing script that can import and process all recorded EDF data files from sections 3-7 (see Table of Materials).\n\t\nApply a Butterworth band-pass filter with corner frequencies at 5 Hz and 40 Hz to the raw SSVEP voltages obtained with the 14 channel EEG headset to minimize effects of lower-frequency noise, DC voltage offset, and mains power31.\nApply a Fast Fourier Transformation (FFT) to the filtered SSVEP values to analyze data in the frequency domain32.\nNormalize FFT values from electrode channels O1 and O2 to generate a single array of values for graphical plotting as a power spectrum density (Figure 5).\nOnce the EEG data has been processed, calculate the signal-to-noise ratio (SNR) of each data file by dividing the magnitude at 15 Hz by the average magnitude between 5-40 Hz. The SNR formula is:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62082/62082eq01.jpg\nWhere:\n\tAmplitude15Hz = The voltage of the 15 Hz Frequency band (µV)\n\tAmplitudeAverage = The average voltage of all Frequency bands between 5-40 Hz (µV)\nEnsure all data (raw EDF, processed EDF, SNR value, comments, and dates of the players injury state) is saved in appropriately labeled folders for investigative purposes.\n9. Statistical analysis\nCombine the players' data files in a comma-separated values (CSV) sheet categorically (separate columns for baseline, concussion, and recovery reading).\n\t\nUse the SNR of each SSVEP reading to compare the different groups. Express all summarized data as medians with 25th to 75th interquartile range (IQR), with a statistical significance level of alpha (α) = 0.05 set, and all levels of variance displayed in standard deviation (± S.D.). Use statistical analytics software (see Table of Materials) for analysis of the group SNR values.\nEvaluate the normality of all players' SNR values using a Shapiro-Wilk test.",
    "Compare the mean SNR between all three assessment groups using paired t-tests (between baseline-concussed readings, concussed-recovered readings, and baseline-recovered readings) for players who experienced all three types of assessments. Ensure a multiple comparison correction is applied by utilizing a Bonferroni correction.\nCalculate the effect size of the t-test comparisons by utilizing Cohen's D32.\nEstimate test-retest reliability using a model 3, type k intra-class correlation coefficient (ICC); ICC(3,k) with a 95% confidence interval (CI) to examine agreement between baseline and repeated testing throughout the season.\n\t​NOTE: The experiment can be paused here and restarted at a later point in time.\n10. Improved portable SSVEP system setup\nNOTE: The system described in this section is an all in one set up which has been designed to enable for a more efficient measurement process, both quicker and with improved comfort for the participant. Please note that the set up described in sections 2-6 is a simplistic prototype consisting of numerous pieces of equipment merged to generate a proof-of-concept system. The protocol schematic using this system is presented in Figure 6.\nObtain a portable SSVEP system that contains a visual stimulus and electrode configuration equivalent to the system described in section 2 (see Figure 7A).\n\t\nDownload the system's SSVEP application from the iOS app store onto a device that operates iOS (see Table of Materials).\nEnsure the investigational team is familiarized with the instructions for use (IFU) of the portable SSVEP system and its supplied iOS application, which enables the activation of the SSVEP device and local storage of the EEG readings.\n\t\nGenerate subject accounts on the iOS application by following the instructions for use(IFU) of the portable SSVEP system. Open the app, select the Subjects tab, then press the Add New Subject button.\n11. Reference EEG system setup",
    "Obtain a validated clinical-grade EEG amplifier unit with a modular electrode configuration that does not contain a visual stimulus component (Figure 7C).\nEnsure the investigational team is familiarized with the instructions for use (IFU) of the clinical EEG system and its supplied clinical neurology software application (see Table of Materials), which enable activation of the amplifier and local storage of EEG readings.\n12. EEG validation of an improved portable SSVEP system\nRecruit healthy, English-speaking adult participants using the same exclusion criteria detailed in section 1. Consent these participants for the SSVEP system validation study.\nRandomly assign participants a number from 01 to 20. Evaluate participants with an odd number assigned first with the portable SSVEP system, and then with the clinical EEG system (steps 12.3-12.16). Vice versa for participants assigned with even numbers (steps 12.10-12.14, then 12.3-12.9, then 12.15-12.16) (Figure 6).\n\t\nSet up the SSVEP headset as per instructions for use (IFU): fully charge the headset and Bluetooth pair it to the SSVEPiOS application. Insert the supplied polyurethane sensor cylinders into the electrode channels and saturate using normal saline solution.\nPlace the SSVEP headset on the participant's head as per the system's IFU, with the inferior of the rear housing unit situated directly above the participant's inion, the front visor housing placed securely over their eyes and nasal bridge and the headset tightened via the elastic adjustment straps and securing buckles.\nCheck the SSVEP iOS application's impedance indicator to ensure an adequate connection between the headset and the participant's head before testing. Green visual indicators on the associated application (impedance <15 kOhms) indicate good contact quality according to manufacturer's standards.",
    "If a good contact quality is not achieved for all electrode channels of interest, re-saturate the sensors with normal saline solution and re-check positioning to ensure the sensors are as flush against the scalp as possible.\n\t\tNOTE: Good contact quality must be obtained to ensure electrical connectivity between the scalp and electrodes, minimizing potential artifacts (Figure 4).\nEnsure that the participant is comfortable. Instruct them to remain still, calm, and quiet while seated and gazing forward into the lights, and to only blink when required. If the subject moves from stationary seated position or there is a change in environmental settings during the assessment, an artifact (Figure 4) can occur, and the SSVEP data should not be collated for the analysis (discarded).\nInitiate the visual stimulus by pressing the Begin Test button on the iOS application. When prompted, press the Continue button to move to the next stage of testing. The visual stimulus is run twice as per the system's IFU, obtaining a preliminary and primary SSVEP reading.\nFollowing completion of the SSVEP assessment, remove the SSVEP headset from the participant's heads. Allow the subjects to relax for a minimum of 30 s.\nIn order to obtain a test-retest reliability value, repeat the SSVEP assessment protocol with the SSVEP system (steps 12.3 to 12.7) following the end of the rest period.\nAllow the participants to rest for 5 min before proceeding with the next EEG system.\nSet up the clinical EEG amplifier as per IFU: power on the amplifier by connecting to a computer via USB dongle provided and power cable, connect five electrode leads into the respective 10-20 EEG positions of 01, O2, OZ, P1, and P2, open clinical neurology EEG software on a computer and create a new study (via the Record tab).",
    "Apply the scalp preparation gel to the occipital region of the participant's head, rubbing the gel in a clockwise motion with fingers to spread into a thin layer.\nFit the electrode cap over the participant's head as per the IFU of the clinical EEG system. Apply the conductive gel to the five electrode patches carefully and with clean hands.\nPlace the five electrode patches onto the participant's scalp in the respective O1, O2, O3, P1, and P2 positions as per the 10-20 EEG positioning nomenclature.\nCheck the clinical EEG amplifier software application's impedance indicator to ensure an adequate connection between the headset and the participant's head before testing. Impedance values of <15 kOhms are considered to be acceptable for EEG application.\n\t\nIn the instance a good contact quality is not achieved for all electrode channels of interest, re-apply the preparation gels and re-check positioning to ensure the sensors are as flush against the scalp as possible.\nInstruct the participant to hold the front visor of the SSVEP device over their eyes as per step 12.4, while an investigative assistant holds the rear housing unit away from the scalp.\n\t\nRepeat the instructions outlined in section 12.5.2.\nInitiate the EEG amplifier's recording by pressing the red Record symbol located on the top-left corner of the clinical neurology software. Immediately following the initiation of the recording, initiate the visual stimulus by pressing the Begin Test button on the iOS application.\n\t\nPress the red Record symbol to stop the EEG amplifier recording once prompted that the SSVEP system has ceased the first round of stimulus and is awaiting the command to continue.\nRestart the EEG amplifier recording by pressing the red Record symbol on the clinical neurology software, and then continue the visual stimulus by selecting the Continue button on the SSVEP iOS app.",
    "Press the red Record symbol to stop the EEG amplifier recording once prompted that the SSVEP system has ceased the visual stimulus.\nAllow the subject to relax for a minimum of 30 s. In order to obtain a test-retest reliability value, repeat the SSVEP assessment protocol with the clinical EEG system (steps 12.10 to 12.13) following the end of the rest period (two total tests: Test 1 / Test 2).\nOnce the pair of SSVEP assessments have been successfully completed, have the participant remove the front visor from their eyes, and carefully detach the electrode patches from their scalp.\n\t\nClean both the SSVEP headset and electrode leads with isopropyl alcohol (70%) wipes before storing both pieces of equipment in their respective cases until their next use.\nAsk the participant whether they experienced any abnormal reactions to the stimulus, including the presence of a headache or dizziness. Record their responses in a study log before informing them they have completed their participation in the study.\n13. Test-retest reliability calculation of the portable SSVEP system\nDownload the raw SSVEP values of both SSVEP primary test sets from the iOS device using a mobile management utility software; results will be outputted as comma-separated value (CSV) files. For identification and storage purposes, save the files using the participant's full name, the type of test conducted and date.\nModify the numerical computing script generated in section 8 to process the CSV files with an additional array of SSVEP values from the Oz recording channel.\nCollate the processed data files in an array of CSV sheets, with values summarized according to their respective category of Test 1 or Test 2.",
    "Use the SNR of each SSVEP reading to compare the results of the different tests. Estimate test-retest reliability using a model 2, type 1 interclass correlation coefficient ICC (2,1) with a 95% confidence interval (CI), and α significance level set to 0.05.\n14. Test-retest calculation of the clinical EEG system\nDownload the raw SSVEP values of both EEG amplifier primary test sets from the clinical neurology software ; results will be outputted as CSV files. For identification and storage purposes, save the files using the subject name and the type of test conducted.\nRepeat section 13.2-13.4 using the downloaded EEG amplifier CSV files to estimate test-retest reliability of the Clinical EEG System.\n15. Agreement calculation of the portable SSVEP and clinical EEG systems\nOutline the criteria for determining whether an SSVEP was detected by the EEG system (recommended criteria: if the main signal peaks between 5-35 Hz is 15 ± 0.1 Hz, and if the Z-score of the main peak is above 5).\nModify the numerical computing script generated in sections 12 and 13 to additionally determine the peak frequency and Z-score of the SSVEP files that are processed. Formula for Z-score is.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62082/62082eq02.jpg\n\tWhere:\n\tAmplitudePeak = The voltage at the peak frequency (µV)\n\tAmplitudeAverage = The average voltage of all Frequency bands between 5-35 Hz (µV)\nConduct a binomial analysis of the EEG systems' ability to successfully detect a SSVEP using the outlined criteria, with binomial probability (%) to be taken as the agreement between the two systems. Preliminary and primary recordings for each system are to be used to calculate the level of agreement across two sets of data, respectively.",
    "Use the Z-score of each SSVEP reading to compare the different EEG systems. Express all summarized data as medians with 25th to 75th interquartile range (IQR). Use statistical analytics software for statistical analysis of the system processed values.\nModify the numerical computing script generated in sections 12 and 13 to additionally determine the average SNR for each frequency that resulted in a data point ranging from 0-25 Hz, of ALL (preliminary and primary) SSVEP files generated by the SSVEP and Clinical EEG System.\n\t\nCreate a power spectrum density (PSD) of both systems normalized average SNR results between 0-25 Hz (see Representative Results).\n\t\tNOTE: Create a separate data series for each EEG system and overlay it onto the same PSD."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}