{
  "id": 11798,
  "origin_website": "Jove",
  "title": "Establishment and Culture of Patient-Derived Breast Organoids",
  "procedures": [
    "Tumor resections from breast cancer patients, along with the distal and adjacent normal tissue, were obtained from Northwell Health in accordance with Institutional Review Board protocols IRB-03-012 and IRB 20-0150, and with written informed consent from the patients.\nNOTE: All procedures mentioned below were performed in a mammalian tissue culture BSL2 room designated for patient samples upon approval of the biosafety committee. All procedures should be performed following safety protocols maintaining aseptic conditions in biosafety cabinets. Each centrifugation step is performed at room temperature (RT) unless stated otherwise. Tissue/organoids and basement membrane matrix stocks are always placed on ice unless stated otherwise. New plates are incubated overnight for pre-warming. Plating domes on pre-warmed plates ensures the best results to obtain rounded domes that don't flatten out while plating or lifting off later from the plate surface.\n1. Medium preparation and recipes\nPrepare R-spondin1 conditioned media as described below (alternatively can be bought commercially).\n\t\nPrepare two separate growing media composed of Dulbecco's modified Eagle's medium (DMEM), 10% FBS, 5% penicillin-streptomycin, and with or without 300 µg/mL zeocin supplementation.\nThaw a vial of HEK293T-HA-Rspondin1-Fc cells (obtained from Calvin Kuo's lab at Stanford University and also commercially available) in a 75 cm2 tissue culture flask with 15 mL of medium.\nSplit the cells into 2 x 175 cm2 culture flasks, each with 35 mL of medium containing zeocin.\nPassage the cells again to obtain as many flasks as needed for generating the desired batch of R-spondin1 conditioned medium. Use growth medium without zeocin.\nWhen the flasks containing medium without zeocin are confluent, remove and replace the growing medium with Ad-DF+++ (step 1.2; Table 1). Place the cells in a 37 °C incubator with 5% CO2 for 1 week.",
    "Spin down the medium at 400 x g for 5 min to remove any unattached cells. Filter the medium through a 0.22 µm filter. Make 25 mL aliquots and store them at -20 °C (can be stored for up to 6 months).\nUsing HEK293T cells, perform a dual luciferase TOPFLASH41,42 assay using a commercial DNA transfection reagent at a 4.8:1 reagent to DNA ratio with the diluent DMEM (high glucose, pyruvate). Add 100 µL of R-spondin1 conditioned medium (or basal medium for the negative control) to 100 µL of transfected cells. Then, perform the dual luciferase assay as per the manufacturer's protocol to verify Wnt activity of the R-spondin1 conditioned medium.\n\t\tNOTE: The assay uses a TOP plasmid with Firefly luciferase activity read-out, and the FOP plasmid is used as a negative control.\nPrepare basal medium (Ad-DF+++ medium, as previously published by Sachs et al.36).\n\ttable:\n﻿0,1,2\nReagent,Stock Concentration,Final Concentration\nAdvanced DMEM/F12,1x,1x\nGlutaMax,100x,1x\nHEPES,1 M,10 mM\nPenicillin-Streptomycin,\"10,000 U/mL; 10,000 µg/mL\",100 U/mL; 100 µg/mL\nTable 1: Basal Ad-DF+++ medium composition.\nPrepare complete medium for patient-derived breast organoids as previously published by Sachs et al.36.\n\ttable:\n﻿0,1,2\nReagent,Stock Concentration,Final Concentration\nAd-DF+++ medium,1x,1x\nR-spondin in-house,100%,10%\nB-27 supplement,50x,1x\nNicotinamide,1 M,5 mM\nNAC,500 mM,1.25 mM\nPrimocin,50 mg/mL,50 µg/mL\nNoggin,100 µg/mL,100 ng/mL\nHuman EGF,5 µg/mL,5 ng/mL\nHuman Heregulin β1/Neuregulin1,75 µg/mL,37.5 ng/mL\nY-27632 Dihydrochloride (Rho-Kinase),100 mM,5 µM\nA83-01,5 mM,500 nM\nHuman FGF-7,100 µg/mL,5 ng/mL\nHuman FGF-10,1 mg/mL,20 ng/mL\np38i,30 mM,498 nM\nTable 2: Complete medium composition for patient-derived breast organoids.\nPrepare 2 mg/mL collagenase IV solution by weighing the required amount of collagenase IV powder and solubilizing it in Ad-DF+++ basal medium. Filter through a 0.22 µm filter before use.",
    "Prepare 0.5% bovine serum albumin (BSA) solution from 7.5% stock solution using 1x Dulbecco's phosphate buffered saline (DPBS) as a diluent. Filter through a 0.22 µm filter before use.\n2. Establishing breast tumor/normal organoids from resected tissue (Figure 1)\nTransport a surgically resected breast tumor/normal tissue specimen to the lab in a 50 mL conical tube containing Ad-DF+++. Store the tube on ice until the start of isolation.\nThaw a bottle of basement membrane matrix on ice or overnight at 4 °C.\nTransfer the resected tissue to a 10 cm sterile Petri dish. Examine the tissue macroscopically and make a note if it appears morphologically fatty, vascularized, or necrotic. Additionally, record the size and shape of the tissue. Ideally, take a picture of the tissue with a ruler in view (Figure 2).\nMince the tissue into very small pieces (~1 mm3) with a sterile no. 10 scalpel, and transfer it into a 50 mL conical tube.\nAdd 10 mL of 2 mg/mL collagenase IV solution and seal the tube with a transparent film. Place the tube on an orbital shaker at 37 °C at 140 rpm for 30-90 min in an angled position (~30° angle).\nDuring the incubation, place an aliquot of complete medium to pre-warm in a 37 °C bead/water bath.\nEvery 15 min, resuspend the tissue by mixing up and down vigorously using a 5 mL sterile serological pipette. Pre-coat the pipette with 0.5% BSA solution to prevent tissue loss caused by the sample sticking to the pipette. Monitor dissociation over time by observing the conical tube under the microscope at a 5x or higher magnification.\nOnce the tissue is dissociated, centrifuge at 400 x g for 5 min. Aspirate the supernatant, add 10 mL of Ad-DF+++, and centrifuge at 400 x g for 5 min.",
    "Discard the supernatant carefully. Tissue pellets can occasionally be loose, so be careful when aspirating. Repeat the step once more.\nIf the tissue pellet is partially red, add 2 mL of red blood cell lysis buffer and incubate for 5 min at room temperature. Do not incubate for longer, as this will significantly reduce cell viability.\nAdd 10 mL of Ad-DF+++ to the tube, centrifuge at 400 x g for 5 min, and discard the supernatant. Resuspend the pellet in 50-300 µL of undiluted, cold basement membrane matrix and mix by pipetting carefully to avoid forming bubbles.\n\tNOTE: The volume of the basement membrane matrix added depends on the pellet size. If unsure, plate a small dome of ~10 µL from the resuspended pellet and observe the confluency under the microscope. Adjust by adding more basement membrane matrix if needed. Refer to Figure 3 (day 1 image) for a reference seeding density.\nPlate 300 µL of basement membrane matrix dome containing organoids in each well of a pre-warmed, labeled, 6-well tissue culture plate. Refer to Table 3 for recommended basement membrane matrix and medium volumes if using different plates.\n\ttable:\n﻿0,1,2\nNumber of wells per plate,Basement Membrane Matrix per dome (µL),Medium per well (µL)\n6,300,3000\n12,100,1000\n24,50,500\n48,25,250\n96,10 (suspension instead of dome),100\nTable 3: Amount of basement membrane matrix and growth medium recommended per well based on plate size.\nLeave the plate undisturbed in the hood for 5 min and then carefully place in the incubator at 37 °C for 20-30 min for the basement membrane matrix dome to fully solidify.",
    "Add 3 mL of pre-warmed complete medium dropwise to each well of a 6-well plate and place in the incubator at 37 °C and 5% CO2. Take images of the organoids using a 5x objective on an inverted brightfield microscope.\nReplenish the medium every 4-8 days based on the growth of organoids. Carefully aspirate the old medium without disturbing the dome, and add fresh, pre-warmed medium dropwise.\n\tNOTE: The protocol is the same for establishing breast cancer organoids derived from the resected tumor and for normal organoids derived from resected healthy breast tissue (either from adjacent and normal breast tissue of the same patient or healthy breast tissue obtained from a reductive mammoplasty surgery).\n3. Passaging and expanding patient-derived breast organoids in culture\nThaw a bottle of basement membrane matrix on ice or overnight at 4 °C.\nLift the basement membrane matrix dome into the medium in the well using a cell scraper or a 1 mL pipette tip.\nPre-coat the pipette tip with 0.5% BSA solution and then transfer the floating dome of the organoids with medium to a 15 mL or 50 mL conical tube, depending on the number of wells being harvested. For more than two wells containing 300 µL of basement membrane matrix domes, use a 50 mL conical tube. Add 1x DPBS to increase the volume to at least 5 mL.\nSpin the tubes at 400 x g for 5 min. The basement membrane matrix with organoids forms a layer at the bottom. Carefully aspirate to remove the supernatant.\nAdd 5-20 mL of 1x DPBS, depending on the number of wells pooled in a tube. Pre-coat a sterile disposable pipette with 0.5% BSA and mix the organoid-basement membrane matrix pellet in DPBS uniformly by pipetting up and down.",
    "Spin the tubes at 400 x g for 5 min. Carefully aspirate and discard the supernatant.\nAdd cell dissociation reagent at three times the volume of the basement membrane matrix to the tube. Using a 0.5% BSA-coated pipette tip, resuspend the organoids in the cell dissociation reagent.\nPlace the tube on an orbital shaker at 37 °C at 140 rpm for 8-15 min in an angled position. Monitor the tube by observing it under the microscope every 5 min to ensure the organoids are broken down into smaller clusters.\nAdd basal medium (i.e., Ad-DF+++) at a volume equal to or greater than the cell dissociation reagent, and pipette to mix the organoids. Spin at 400 x g for 5 min at RT to obtain an organoid pellet.\nIf the pellet contains organoids still embedded within the undissolved basement membrane matrix, repeat steps 3.7-3.9 for an additional 5-8 min of trypsinization.\nOnce a white organoid pellet with no undissolved basement membrane matrix is obtained, discard the supernatant, and add 1 mL of Ad-DF+++ to resuspend the pellet by pipetting. Then add more Ad-DF+++ up to 10 mL.\nSpin at 400 x g for 5 min at RT for the wash step. Aspirate and discard the supernatant.\nAdd the required amount of basement membrane matrix to the digested organoids based on the appropriate split ratio (this will vary widely for each organoid line based on growth rate). Refer to Figure 3 (day 1 image) for an example of seeding density. Mix by gently pipetting up and down to avoid creating bubbles. Immediately place on ice.",
    "Open and label a pre-warmed 6-well plate. It is recommended to plate a 10-20 µL dome in the corner of a well to observe the confluency under the microscope. If the organoids are confluent, more basement membrane matrix can be added to increase the split ratio.\nPlate 300 µL domes of organoids resuspended in basement membrane matrix. Make sure to keep the tube on ice while plating multiple wells so that the basement membrane matrix remains in solution.\nLeave the plate undisturbed in the hood for 5 min and then carefully place in a 37 °C incubator with 5% CO2 without disturbing the domes.\nAfter 20-30 min, the domes solidify. Add 3 mL of pre-warmed complete medium to each well and place the plate back in the incubator. Add fresh complete medium every 5-7 days. Perform routine testing of the cultures for detecting mycoplasma contamination.\n\tNOTE: The protocol for the culture of breast tumors and normal organoids is the same. However, in our experience, normal organoids tend to grow well up to passage 6-8 before slowing down. It is advisable to make as many early passage stocks as possible for future research.\n4. Freezing patient-derived breast organoids\nPassage confluent wells of organoids to remove any basement membrane matrix, as stated in steps 3.1-3.12.\nResuspend the pellet of organoids in cell freezing medium (thawed overnight at 4 ºC) with 1 mL of medium per 200-300 µL of basement membrane matrix volume before passaging. Perform a cell count before freezing for reference. Aliquot a small volume (at least 100 µL) of cells to undergo further trypsinization, if needed, to get single cells, and then count them using a cell counter machine.",
    "Transfer 1 mL of cells into 2 mL cryovials labeled with organoid line number, date, and passage number. Be sure to label the tubes with a permanent marker or use cryolabels.\nMove the vials to a cell freezing container and transfer the container to a -80 °C freezer. After incubation overnight, the vials are ready to be moved to a liquid nitrogen storage freezer for long-term storage.\n5. Thawing patient-derived breast organoids\nThaw a bottle of basement membrane matrix on ice or overnight at 4 °C. Pre-warm Ad-DF+++ medium at 37 °C. Aliquot 9 mL of pre-warmed medium into 15 mL conical tubes for each frozen vial.\nRapidly thaw the frozen vial of organoids by placing it in a 37 °C bead bath. Spray 70% ethanol and transfer the tube to the biosafety cabinet.\nRinse the pipette tip with 0.5% BSA solution to avoid organoid loss. Mix the thawed organoids gently by pipetting up and down to mix any settled organoids in the tube.\nGently transfer 1 mL of frozen organoids to 9 mL of pre-warmed Ad-DF+++ in a dropwise manner. Spin the cells at 400 x g for 5 min and then carefully discard the supernatant.\nWash the pellet by adding 10 mL of fresh pre-warmed Ad-DF+++ to the organoid pellet, and mix gently with a pipette pre-coated with 0.5% BSA to resuspend the pellet. Spin the cells at 400 x g for 5 min and carefully discard the supernatant.\nPlace the organoid pellet on ice and remove any remnant Ad-DF+++ carefully using a smaller volume pipette tip. Resuspend the pellet in 300 µL of basement membrane matrix and plate in a pre-warmed 6-well plate. Place the plate in a 37 °C incubator with 5% CO2.",
    "NOTE: It is recommended to plate a small 10 µL dome from the resuspended pellet in a corner of the well to discern the confluency under the microscope. If the organoids look confluent, dilute by adding 300 µL of basement membrane matrix to plate into two wells of a 6-well plate.\nAfter a 20-30 min incubation, add 3 mL of pre-warmed complete medium to the solidified dome.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}