{
  "id": 13708,
  "origin_website": "Jove",
  "title": "Isolation and Characterization of Mouse Antral Oocytes Based on Nucleolar Chromatin Organization",
  "procedures": [
    "This protocol is conducted in accordance with the guiding principles of European (EU 63/2010) and Italian (26/2014) laws protecting animals used for scientific research. Cervical dislocation euthanasia is used for ovaries isolation and it is performed by expert and trained individuals listed in the approved protocol covering this study. \n1. Animals\nMaintain adult 3- to 6-week-old female mice in a room with controlled temperature and humidity (with phases of 12L:12D and fed ad libitum).\nInject mice intraperitoneally with 2.5 IU of Pregnant mare serum gonadotropin (PMSG) to stimulate follicular growth by mimicking the effects of follicle stimulating hormone (FSH). Isolate the ovaries for antral oocytes collection 48hrs later. Euthanize the female mouse previously injected with PMSG, according to your institutional guidelines.\nQuickly remove the ovaries from the body cavity and place them into the petri dish containing M2 medium for subsequent oocytes isolation (see section 3).\n\t\nMake an incision on the skin covering the abdominal wall followed by an incision in the peritoneum by using sterile dissection scissors. Open the incision to expose the abdomen, move the guts on one side using sterile tweezers and localize the uterine tubes, forming a V-shape starting from the bladder.\nObserve the ovaries located below the kidneys. Hold each tube with sterile tweezer and make a small incision at the bottom of the ovaries to release them. Transfer both ovaries at the bottom of a petri dish containing pre-equilibrated medium.\n2. Hormone Preparation\nDilute PMSG (available in different stock concentrations) with sterile isotonic saline solution to obtain a working concentration of 2.5 I.U. hormone per 0.1 ml for an appropriate injection volume.",
    "NOTE: Hormone solutions must be aliquoted in 0.5 ml tubes and stored at -20 °C until the day of use. Do not keep diluted aliquots longer than three months at -20 °C. Once thawed, if serial injections are performed, store the aliquots of hormone solutions at +4 °C and use them within 4 days.\n3. Antral Oocytes Isolation\nFor proper oocytes isolation:\nEquilibrate M2 medium13 (M2) at 5% CO2 and 37 °C for at least 1 hr before starting the oocytes isolation procedure. Prepare two petri dishes (35 mm x 10 mm), one with 1 ml of M2 for ovary puncturing and the second one with small drops (20 µl) of M2 covered with mineral oil (~1.5 ml) for oocytes transfer after isolation from the ovary (see 3.4-3.6). Keep both petri dishes in the incubator at 5% CO2 and 37 °C until ready to be used.\nUse a stereomicroscope during oocytes isolation procedures.\nPrepare thin mouth glass pipettes to collect the oocytes by stretching glass Pasteur pipettes kept horizontally (holding the ends of the pipette with both hands), over a vertical flame coming from the Bunsen burner (Figure 1).\n\t\nOnce the glass begins to melt, take the pipet out of the flame and perform a quick pulling movement to obtain the desired pipette. Firmly cut the excess glass close to the narrow point of the pipette with fingernails to adjust the length and the diameter of the internal capillary. Ensure that the thin capillary has an internal diameter of ~100 µm, slightly greater than the oocyte's diameter (~80 µm).\nTo mouth pipette, connect one end of the aspirator tube to the pulled pipette by using an appropriate tip and place the other end in the mouth, securing it with the teeth.",
    "Collect the ovaries using sterile tweezers and deposit them at the bottom of a cell culture petri dish (35 mm x 10 mm). Cover them with 1 ml of M2 previously equilibrated at 37 °C and 5% CO2 (Figure 2).\nGently puncture the antral follicles of the ovaries with a sterile insulin syringe needle to release antral oocytes in M2 (Figure 3).\nGently mouth pipet the oocytes through a narrow Pasteur pipette to remove follicle cells and any other possible tissue debris (Figure 4A) and then settle them at the bottom of small drops (20 µl) of M2 covered with mineral oil suitable for embryo culture (previously prepared; Figure 4B).\n\tNOTE: It is important to remove all the cumulus cells attached to the zona pellucida of the oocytes by continuous pipetting through several and different drops of M2. Perform this step as quick as possible to avoid alterations in the pH of the medium.\n4. Antral Oocytes Staining with Hoechst33342\nNOTE: Antral oocytes can be distinguished in SN (Surrounded Nucleolus), NSN (Not Surrounded Nucleolus) or in any other intermediate form, based on their chromatin organization after staining with supravital concentration of Hoechst33342 (or any other markers specific for bases A-T)14. In fact, the SN oocytes show a Hoechst-positive ring around the nucleolus while the NSN do not, hence its name.\nFor proper oocytes staining:\nTransfer the oocytes using a mouth pipette into drops of Hoechst33342 (20 µl) diluted in M2 at the supravital concentration of 50 ng/µl for 10 min in dark.",
    "After the incubation with Hoechst33342, transfer each single oocyte with a mouth pipette at the bottom of small drops (5 µl) of M2 covered with mineral oil, for sorting based on chromatin organization (SN or NSN). Use any fluorescence microscope equipped with Hoechst33342 filter (emission wavelength 486 nm) to visualize the chromatin configuration of the oocytes.\n\tNOTE: Depending on the type of fluorescence microscope used, it may become imperative to use glass bottom petri dish for image acquisition. The confocal microscopy Olympus Fluoview Fv10i when equipped with a specimen holder for 35 mm dish requires only glass bottom-dishes for image acquisition, with a 0.17 mm standard thickness and a range from 0.13 to 0.21 mm acceptable.\nExcite the oocytes for no longer than 5-10 sec, likely enough time to visualize the presence or the absence of a ring around the nucleolus (Figure 5).\nAfter sorting, culture the antral SN and NSN oocytes in M2 at 5% CO2 and 37 °C to induce in vitro maturation or keep them in appropriate buffers for molecular or cellular analyses.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}