{
  "id": 5664,
  "origin_website": "Bio",
  "title": "Xanthoferrin Siderophore Estimation from the Cell-free Culture Supernatants of Different <em>Xanthomonas</em> Strains by HPLC",
  "procedures": [
    "Preparation of the cell-free culture supernatant   Streak the bacterial strain from its glycerol stock on a PSA plate containing rifampicin (50 μg/ml) and incubate in a static incubator at 28 °C for 2-3 days. To start a primary culture, transfer a single colony from the above mentioned plate to an autoclaved culture tube containing 3 ml fresh PS medium (see Recipes) with rifampicin (50 μg/ml). The primary culture of Xanthomonas can be grown to late-exponential growth (OD600 ~1.0) phase at 28 °C and 200 rpm in shaking incubator for 16-20 h.   Start a secondary culture by using 0.2% inoculum (2 ml) from the above primary culture into fresh PS medium (1 L) supplemented with the appropriate amount of 2,2’-dipyridyl (150 μM for X. campestris pv. campestris str. 8004, 100 μM for X. oryzae pv. oryzae, and 50 μM for X. oryzae pv. oryzicola). Incubate the secondary culture in a 28 °C incubator with shaking at 200 rpm for 48 h.    Centrifuge the bacterial cultures at 17,000 x g for 1 h at 4 °C to pellet cells and exopolysaccharides.   To remove the remaining cells from the supernatant, filter the supernatant with Stericups (pore size 0.22 μm) and a vacuum pressure pump.   Adjust pH to 2.0 with concentrated HCl (6 N) to reduce the solubility of siderophore in water (Rey et al., 1996).       Column chromatography using XAD-16 resin columns   Prepare a 2.4 x 30 cm column by packing 220 g of Amberlite XAD-16 polymeric resin.  Note: Prepare the Amberlite resin by soaking in water overnight on the day before the column is needed.   Wash the packed column with two-times the bed-volume (440 ml) of methanol and equilibrate the column with three-times the bed-volume (660 ml) of sterile MilliQ water.",
    "Pass the cell-free bacterial supernatant (Procedure A; step A5) through the equilibrated XAD-16 resin column (see Note 7).   Elute with 200 ml methanol and collect approximately 100 fractions (~2 ml each) in 2.0 ml centrifuge tubes (see Note 7; Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170714/20170714232733_9969.jpg Figure 1. Xad-16 resin column (prepared in the burette) with burette support equipment for the collection of different fractions of the elute for xanthoferrin siderophores      CAS-Plate assay   Prepare a PSA-CAS-DP plate (see Recipes).   Punch several holes in the plate with a sterile cork borer keeping approximately 2.5 cm distance between the holes.   Put approximately 250 μl of each fraction (according to elution order, Procedure B; step B4) into separate holes, placed upright with the lid on top, and incubate at 28 °C in a static incubator.   Observe the activity of the fractions after 24 h.   The characteristic, yellow-colored haloes (haloes 13-24) indicate the presence of siderophores while blue- and red-colored haloes (haloes 1-12) indicate the presence of organic acids (Figure 2).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170714/20170714233241_7293.jpg Figure 2. A PSA-CAS-DP plate with multiple holes representing different colored haloes formation after 24 h incubation with different fractions of the eluate (separated by XAD-16 resin column) for siderophore isolation from X. oryzae pv. oryzicola. Blue- and red-colored haloes (haloes 1-12) indicate the fractions with organic acids while yellow-colored haloes (haloes 13-24) indicate the fractions with xanthoferrin siderophores.  Notes:    We have not taken the 21st-24th fractions of the siderophore elutes for HPLC run. Because we have already observed there was negligible amount of siderophores present in those fractions in comparison to the presence of other impurities which create more noise during the HPLC run.",
    "Addition of those fragments for the HPLC run along with the active fragments (13th-20th) would have increased the impurity level to more extent without significantly increasing the total amounts of the siderophores in the sample. Note that Student’s t-test (paired) was used to analyze extent of contribution for those fractions towards the impurity levels and siderophore amounts in the main active fractions (13th-20th) for HPLC run.   In order to minimize the extent of interference (after heat and trial methods) due to other unwanted ingredients present in the fractions corresponding to the halos 21-24, only the active fractions of the siderophores corresponding to the haloes 13-20 should be collected from their respective remaining main stocks (~1.75 ml each) for HPLC quantification.         HPLC quantification    Pool all the active fractions (corresponding to haloes 13-20) from Procedure B; step B4 into a 15 ml centrifuge tube that display characteristic yellow haloes on the PSA-CAS-DP plate (Procedure C; step C5).    To remove the solvent, dry the sample completely using a vacuum concentrator (at 30 °C in alcohol mode).    Reconstitute in 1 ml methanol and filter with a syringe driven filter unit with 0.22 μm pore size.   Inject the recommended volume of filtered sample for each strain (25 μl for X. campestris pv. campestris, and 10 μl for X. oryzae pv. oryzicola and X. oryzae pv. oryzae) into the Agilent 1100 series HPLC system (Figures 3A-3B).   Achieve the separation with Agilent C-18 column (4.6 mm x 250 mm x 5 μm) using gradient: A = H2O/0.1% TFA, B = CH3CN/0.1% TFA; 0-30% B in 10 min, 30-45% B in 15 min, 45-0% B in 20 min at a flow rate of 1 ml/min.   Make the standard curve, draw trendline, and get equation (using Microsoft Excel) from either known amounts of vibrioferrin (Fujita et al.",
    ", 2011) or xanthoferrin versus their respective peak areas obtained by HPLC chromatograms (see Notes 1, 2 and 3).   Calculate the amount of xanthoferrin siderophores (present in the unknown sample) from the formula obtained either by standard vibrioferrin or xanthoferrin.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170714/20170714234027_6911.jpg Figure 3. HPLC program and instrument. A. HPLC program in ChemStation Software; Rev. A.10.02 [1757]. B. A part of HPLC machine indicating samples orientation and automatic injection needle."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}