{
  "id": 11751,
  "origin_website": "Jove",
  "title": "Rapid In Vitro Cytotoxicity Evaluation of Jurkat Expressing Chimeric Antigen Receptor using Fluorescent Imaging",
  "procedures": [
    "NOTE: All cell culture work is done in a biosafety cabinet with a lab coat, gloves, and following standard aseptic techniques.\n1. Generating CAR expressing Jurkats (CAR-J)\nPurchase Jurkat cells, clone E6-1 from ATCC. Thaw 1 x 106 cells in a T-75 flask and culture them in T-75 flasks. Maintain them in suspension at 0.6 x 106 cells per mL using Roswell Park Memorial Institute (RPMI) media supplemented with 10% FBS in an incubator at 37 °C with 5% CO2.\nPlate 1 x 105 Jurkat cells per well of a tissue culture treated 24 well plate in 500 µL of RPMI growth media containing 4 µg/mL polybrene which enhances lentiviral efficiency. Count cells using a laser-based fluorescent detection bench top cell analyzer. The number of wells depends on the number of constructs to be evaluated. This example will be using 4 constructs and an un-transduced control. The CAR construct design is shown in Table 1.\nAdd 10 µL of lentivirus/well of each CAR construct. CAR construct design and lentivirus production was done as described previously12.\nNext day add 1 mL of growth RPMI media to each well and continue culturing in the incubator at 37 °C with 5% CO2.\nCollect cells 2 days later (total 72 h after Jurkat transduction) and count them.\nTake 1 x 104 cells for running flow to confirm CAR expression on the Jurkat cells. Briefly, wash the cells 2x with FACS staining solution (FSS) before labelling the CAR-J with antibodies targeting Flag tag used to detect CAR positivity for 30 min in the dark at 4 °C. Wash 2x again with FSS and run cells through a flow cytometer as previously described12. Use antibody concentration as recommended by the manufacturer.",
    "Jurkat cells are easily transduced and almost always show >90% CAR expression. Produce CAR-J long in advance of the co-culture cytotoxicity assay and freeze down for later use.\n2. Plating CFSE labelled tumor cells\nNOTE: MDA-MB-231 (from ATCC, HTB-26) cells were a gift from a collaborator, and EGFR KO MDA-MB-231 were created as previously described12.\nThaw 1 x 106 cells in a T-75 flask and culture them in T-75 flasks. Maintain MDA-MB-231 tumor cells and CRISPR EGFR KO MDA-MB-231 tumor cells in 14 mL of Dulbecco's modified eagle medium (DMEM) supplemented with 10% fetal bovine serum (FBS) in an incubator at 37 °C with 5% CO2 and split when approximately 70% confluent.\nObserve adherent tumor cells under regular brightfield microscope to ensure nearly 70% confluence.\nRemove growth media from the flask using a serological pipette. Add 3 mL of trypsin to the T75 flask and place in an incubator at 37 °C with 5% CO2 for 3-5 min to detach the cells from the flask.\nNeutralize the trypsin using equal amount (3 mL) of growth media. Collect the cell suspension in a centrifuge tube and spin down the cells at 400 x g for 4 min to pellet down the cells.\nDiscard the supernatant using a pipette and resuspend the cells in 2 mL of phosphate-buffered saline (PBS). Determine the cell concentration using a cell counter.\nTransfer 8 x 105 cells into another 15 mL tube and add PBS to make it to a volume of 1 mL.\nAdd 2 µL of carboxyfluorescein succinimidyl ester (CFSE; 5 µM stock concentration) into each tube and mix well using a 1 mL pipette.",
    "Incubate the cells with CFSE for 20 min in the incubator at 37 °C with 5% CO2. Remove the tubes from the incubator after 20 min and add 5 mL of growth media to the tube.\nCentrifuge the tubes at 400 x g for 4 min to pellet down the CFSE labelled cells. Discard the supernatant using a pipette and add 1 mL of fresh media to resuspend the cells.\nRevaluate the cell concentration using a cell counter. Transfer 4 x 105 cells into a 25 mL reagent reservoir and add media for a total volume of 8 mL.\n\t\nTo ensure sufficient volume to seed 5000 tumor cells/well in 100 µL of media, volume needed to be able to pipette using the multichannel pipette, and to compensate for the loss of a few cells during step 1.7, prepare 10%-20% extra cells and media volume.\nMix the cell suspension using a 5 mL serological pipette thoroughly. Using a 100 µL multichannel pipette, pipette 100 µL of the cell suspension into each row of the clear flat bottom black 96 well plate on the left half. A sample plating strategy can be found in Table 2.\nPipette EGFR KO cells similarly on the right half of the plate. Once the whole plate is plated, drag the plate back and forth and side to side on the tissue culture hood platform to ensure uniform distribution of the tumor cells in the wells.\nIncubate the plate for 4 h in the incubator at 37 °C with 5% CO2 for the tumor cells to attach.\n3. Co-culturing CAR expressing Jurkats with CFSE labelled tumor cells",
    "Using the counts of un-transduced and CAR expressing Jurkat cells, transfer 4 x 105 cells of each CAR-J into a 25 mL reservoir. Add DMEM growth media for a total volume of 2 mL.\nFor E:T of 4:1, 2 x 104 CAR-J were added per well in 100 µL of media using a multichannel pipette gently along the side of each well so as not to disturb the tumor cells attached.\nAdd another 100 µL of growth media using a multichannel pipette to the side of wells containing tumor cells and Jurkat cells. The tumor only groups get 200 µL of media to make it a total of 300 µL of media in all wells.\nDrag the plate along the platform in back and forth and side to side motion to ensure uniform distribution of the Jurkat cells on the tumor cells.\nAllow co culture in the incubator at 37 °C with 5% CO2 for 48 h.\n4. Preparation of plate for imaging\nMake a solution of propidium iodide (PI) at 1 µg/mL in low background fluorescence media based on the number of wells and each getting 100 µL of media.\nFor 84 wells prepare 9 mL of media containing PI. Mix the media thoroughly using a pipette.\nMake 10 mL of 20% Triton-X solution by diluting Triton-X with deionized water. After 48 h of co culture, discard the supernatant containing CAR-J by a single inversion of the plate and tapping on paper towel.\nNow add 100 µL of above prepared media (step 4.2) containing PI into each well using a multichannel pipette gently so as not to disturb the adhered tumor cells.\nAdd 20 µL of 20% Triton-X solution to the first well of each tumor type which functions as a total dead control.",
    "Leave the plate in the incubator for 20 min. Image the plate using the fluorescent imaging cytometer. Data is stored on the computer and can be analyzed at a later time.\n5. Analyzing fluorescent images\nUse one of the tumor only well of cells to set the green fluorescent channel.\nDecrease the well mask to 98% to remove the cells on the edge of the well as the signal is not perfect on the edge.\nIdentify CFSE labelled tumor cells on the green, fluorescent CFSE channel. Modify fluorescence intensity threshold value to pick up all the cells on the well.\nSet the minimum cell diameter to 25 µm to remove any debris detected on the CFSE channel. This varies depending on the cell type that is analyzed.\nEnable Separate Touching Objects to identify individual cells when they are in contact with each other.\nSelect CFSE on the image display and look at graphic overlay to figure out what's being picked by the system.\nOnce CFSE labelled cells are being properly picked up, set gates to define live vs dead cell population.\nSelecting the CFSE labelled cells, generate a histogram of counts on the y-axis vs mean PI intensity on the x-axis.\nBased on the well where we added Triton-X (step 4.5), draw a splitter to differentiate low PI-stained vs high PI-stained cells. This well should have most of the cells in a high PI-stained region.\n\tNOTE: PI shows basal signal on live cells. Hence, adding Triton-X kills all the cells and they stain bright in the red fluorescent channel. This facilitates drawing gates to separate dead cells from live cells.\nAdjust the x-axis value to be better able to view the cells. Now label the low PI-stained cells as Live cells.",
    "Selecting the Live cells, set another histogram with area on the x-axis and counts on the y-axis.\nDraw another splitter using tumor only well to capture cells and not debris. Jurkat treated wells will start accumulating debris that will be CFSE stained and need to be removed from the counts. The remaining non-debris are labelled as “Big cells\".\nRun the analysis on the entire plate and export the spreadsheet containing the numbers.\nPlot the Big counts to identify the number of live CFSE labelled tumor cells remaining in the well after exposure to CAR-J. Determine statistics using one-way ANOVA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}