{
  "id": 18561,
  "origin_website": "Jove",
  "title": "Instillation and Fixation Methods Useful in Mouse Lung Cancer Research",
  "procedures": [
    "The following protocol describes a system that works well in 20–35 g mice. The method could easily be adaptable to larger or smaller mice simply by changing the catheter size. All animal protocols were approved by the Johns Hopkins University Animal Care and Use Committee.\n1. Lung Instillation\nSelect a commercial one-inch long 20 g intravenous cannula to use for the intubation.\nModify the catheter tip manually bending it to generate a slight curvature at the tip as illustrated in Figure 1.\nAnesthetize the mouse with a mixture of ketamine (100 mg/kg) and xylazine (15 mg/kg) injected IP, and confirm anesthesia by the absence of reflex motion. Apply veterinary ointment on the eyes immediately after anesthesia. Immediately after anesthesia apply veterinary ointment on the eyes and give carprofen (5-10 mg/kg SQ) for post surgical and instillation analgesia.\nPlace the mouse supine on a sloped platform. As shown in Figure 2, a large office binder with suture loops taped on works perfectly well.\nShave the ventral part of the neck and clean and disinfect the neck area with 70% alcohol.  With new latex- and powder- free gloves, use surgical instruments disinfected with 70% alcohol.\nUsing sharp scissors make a small surgical incision in the neck approximately 12 mm below the lower incisor.\nWith a forceps gently pull the skin in the neck caudally until the ventral wall of the trachea can be seen.\nGently retract the tongue and insert the cannula with the bent tip tilted toward the ventral surface of the mouse. As in 1.4, pull gently on the skin in the neck, and insert the cannula into the trachea.",
    "NOTE: With a little practice, the catheter will be visible moving down the trachea. If it goes in the esophagus, then there will be no visual sighting of the catheter’s movement. No incisions are made in the trachea.\nOnce the catheter is seen in the trachea in the neck, advanced it about 5 mm to be reliably passed the vocal cords but still well above the carina.\nPrepare to instill up to 50 µl of liquid by injecting through the catheter with a gel loading pipette tip. Place the tip in the luer hub, but before injecting look carefully to observe movement of the fluid in the tip synchronous with the mouse’s breathing. Then inject the instillate.\nWith a 1 ml syringe, immediately do a relatively rapid inflation of 0.6 ml of air into the lungs through the catheter to help distribute the liquid deep in the lungs. Remove the cannula.\nRemove the cannula. \nUse a small amount of cyanoacrylate adhesive to close the small surgical wound as per package insert instructions for VetBond. Place mice in individual cages and visually monitor them until they wake up and behave normally without any indication of discomfort.\n2. Lung Fixation\nNOTE: Once all experimental procedures are done in a mouse, the lungs can be readied for histologic processing by fixation with formaldehyde (or any other desired fixative).\nSacrifice the mouse with an IACUC acceptable procedure. For the representative mouse shown in the video, cervical dislocation of an anesthetized mouse is used.\nPerform a tracheostomy (if not already done) by surgically exposing the ventral side of trachea, making a small cut, and inserting an 18 G stub needle tip into the trachea, and tying it with thread.",
    "Carefully open the thorax with a midline incision, cut away the diaphragm, and remove the lateral chest walls to expose the lungs.\nConnect the luer end of the needle to a reservoir on a ring stand containing formaldehyde. See Figure 3.\nSet the top surface of the formaldehyde 25 cm above the level of the mouse. See Figure 3.  Next make sure there is no air in the fixation tubing by running fluid out the end of a stopcock. Connect the luer end of the tracheal cannula to the reservoir tubing. Open the stopcock to inflate the lungs with the formaldehyde. Leave the lungs under pressure for at least 20 min.\nOpen the stopcock to inflate the lungs with the formaldehyde. Leave the lungs under pressure for at least 20 min.\nNext, tie off the trachea beyond the end of the stub needle.  It may help to pull back slowly on the needle to expose more of the uncannulated trachea.  When tied securely, remove the stopcock.\nCarefully dissect out the lungs.\nPlace the lungs in formaldehyde overnight.  Longer times are fine, and some stains or procedures may specify specific times.  Also any other liquid fixatives, such as z-fix can be used for the instillation and immersion.\nBefore further histologic processing, measure the fixed lung volume as described next.\n3. Measurement of the Fixed Lung Volume\nMeasure the lung volume using Archimedes principle as illustrated in Figure 4. Remove the fixed lung from the formaldehyde and dissect the heart and any other non-lung tissue.\nUse a previously constructed simple homemade wire support device that is used to keep the lungs fully under water.",
    "NOTE: This device needs to be made compatible with whichever balance is being used. A typical device shown in Figure 5 is made from plastic pipettes and thin (20 G) wire. This system works well with the balance used in the video, but could easily be adapted to most laboratory balances.\nPlace a beaker with ≈200 ml of water on the balance and tare with the supporting cage in place in the water. See Figure 6. Remove the metal cage; place the lung on the water surface and press under water with the cage.\nRecord the weight on the balance. This number reflects the volume of water displaced and is thus a direct measure of the lung volume. Be careful to make sure the lung or suture or any part of the wire cage does not touch the sides or bottom of the beaker.\nFor accuracy, repeat this measurement. Remove the lung from the water, and dry on a tissue. Tare the beaker with cage in place again and repeat the lung volume measurement. The two volume measurements should then be averaged.\n\tNOTE: If the lungs are left in the formalin for more than about a week, the air in the lungs will be dissolved in the liquid. When this happens, the lung will sink, so it is no longer necessary to use any device as in Figure 5 to keep the lung submerged. In such case the volume can be measured by simply by holding the lung by one of the suture strings until it is completely submerged as illustrated in Figure 4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}