{
  "id": 10826,
  "origin_website": "Jove",
  "title": "Social Threat-Safety Test Uncovers Psychosocial Stress-Related Phenotypes",
  "procedures": [
    "All procedures were performed in accordance with the European Communities Council Directive regarding the care and use of animals for experimental procedures and were approved by local authorities (Landesuntersuchungsamt Rheinland-Pfalz). Figure 1 represents a schematic timeline.\n1. Treatment\nAnimals of interest: Obtain C57BL6/J male mice at 7 weeks of age, and upon arrival, single-house in a temperature- and humidity-controlled facility on a 12 h light-dark cycle (lights on: 8:00; lights off: 20:00; 23 °C; 38% humidity) with food and water ad libitum.\nChronic social defeat (CSD)\n\t\nTreatment group\n\t\t\nFollowing 1 week of habituation, perform CSD treatment for 10 consecutive days using the CD-1 strain as the resident's strain (for a detailed protocol, refer to chronic social defeat9 and the modified chronic social defeat treatment10).\nIntroduce the C57BL6/J mouse into the cage of the CD-1 mouse and count 10 s of physical attack. Repeat this episode three times, each with a different CD-1 mouse, and separate by 15 min inter-episode intervals.\nPlace a mesh wall between the C57BL6/J mouse and CD-1 mouse during these intervals, allowing only sensory contact. Following the third episode, house the C57BL6/J mice overnight in the cages of the CD-1 mice, separating both by a mesh wall. Repeat for 10 days.\n\t\t\tNOTE: CD-1 mice number = C57BL6/J mice number + 1. If the number of C57BL6/J treated mice is below 10 then a minimum of 10 CD-1 mice is still needed to ensure that every day the last sensory phase (lasting overnight) is with a new CD-1 mouse throughout the 10 days of treatment.\nCarefully assess the physical well-being of the animals throughout the 10 days. If an animal is severely wounded, exclude it from the experiment for ethical and scientific (mobility/activity during the post-treatment test) reasons. Table 1 provides a well-being checklist.\nControl group",
    "Upon arrival, maintain same-age mice in the same conditions as the treatment group.\nFollowing 1 week of habituation, introduce the control animals for 90 s in an empty cage and then return them to individual cages (single-housed) separated in half by mesh walls identical to those used for the treatment group. Perform this daily in parallel to the 10 treatment days.\n\t\t\tNOTE: It is advisable to keep the control group and the treatment group housed in different rooms.\nAfter the last (10th) sensory phase, single-house all mice in new cages in similar conditions to those described upon arrival and leave them to rest overnight.\n\tNOTE: The last sensory phase should last 24 h, then animals are single-housed.\n2. Post-treatment test: Social threat-safety test (Figure 2)\nFollowing CSD treatment, single-house all mice (treated and control groups) in new cages in similar conditions to those described upon arrival and leave them to rest overnight.\nDuring the morning hours (8:00-13:30), clean the three-chambered arena (rectangle in shape with a total size of 60 cm x 40 cm, made of transparent acrylic walls and smooth floors) with 5% ethanol and place it under the camera with light conditions of 37 lux. Ensure that the entire arena is visible.\nClean the mesh enclosures (cage-like made from metal or acrylic) with 5% ethanol and position them as shown in the corners in Figure 1A.\nHabituation phase: Introduce the animal of interest at the center of the arena, allow for exploration for 6 min, and then return them to their home cage.\nPlace the novel (unknown) CD-1 social target (conspecific) under one mesh enclosure and the novel 129/Sv social target under the other mesh enclosure.",
    "NOTE: It is important to use an unknown 129/Sv conspecific to avoid a familiarity bias. Preferably have 4 mesh enclosures per arena: 2 attributed to the habituation phase and 2 to the testing phase.\nTesting phase: Immediately re-introduce the animal of interest at the center of the arena and allow exploration for 6 min.\nReturn all animals to their home. Clean the arena and mesh enclosures with 5% ethanol between tests of different animals, but never during the observation of the same animal, i.e., never between habituation and testing phases.\nAlternate the location of the mesh enclosures between animals (and never between the two phases within the same animal) to control for possible location preferential bias.\n3. Scoring and analysis\nNOTE: Only the post-stress treatment test, i.e., the STST is scored and analyzed (and not the CSD stress treatment).\nDefine the interaction zone as 2 cm around the mesh enclosures' boundaries.\nScore the duration spent exploring the mesh enclosures during the habituation phase when the animal's nose is within the interaction zone.\nScore the duration spent interacting with the social targets during the testing phase when the animal's nose is within the interaction zone.\n\tNOTE: Detection can be achieved either manually (using a timer or software for manual scoring) or automatically. Regardless of the detection method, take the nose point for exploration and social interaction measurements and the center point of the body for activity-related measurements (e.g., distance moved).\nCalculate the social interaction index as follows: time spent exploring each social target during the testing phase / average time spent exploring the two empty mesh enclosures during the habituation phase (Figure 2B).",
    "Divide the treatment group into 3 subgroups as follows: Animals with a social interaction index ≥1 with the CD-1 social target are non-avoiders, animals with a social interaction index <1 with both social targets are indiscriminate-avoiders, animals with a social interaction index ≥1 only with the 129/Sv social target are discriminating-avoiders (Figure 2C-D).\n\tNOTE: The number of animals within each of the three subgroups can differ between different animal batches (about 1/3 of all animals that undergo the CSD treatment will display the phenotypic characteristics of one of the three subgroups).\nAssess the stress effect by statistically analyzing the social interaction index with the CD-1 social target between the treatment and control groups (either parametric two-sample t-test or nonparametric Mann-Whitney test).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}