{
  "id": 4981,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Deneddylation Assay",
  "procedures": [
    "Note: The preparation of buffers, solutions and SDS gels is explained in Recipes section. Recombinant protein overexpression and protein purificationFor overexpression of Aspergillus nidulans proteins in Escherichia coli (here: Rosetta DE3) inoculate 5 ml LB pre-culture, supplemented with appropriate antibiotics, for overnight incubation at 37 °C with agitation. The next morning, use 1 ml of the pre-culture to inoculate 1 L LB in a 2 L flask supplemented with appropriate antibiotics. Incubate the culture at 37 °C with ~220 rpm agitation for 2 to 3 h until OD600 of 0.6-0.7 is reached (depends on E. coli strain). OD600 can be determined with UV Spectrophotometer by taking 1 ml aliquot of the culture measured against a LB blank sample.When OD600 of 0.6-0.7 is reached, add 1 ml 1 M IPTG to the culture to induce the overexpression. Transfer the flask to room temperature or 16 °C for no longer than 20 h and 150-180 rpm agitation.Transfer the culture to 1 L centrifugation bottles, which should be pre-cooled on ice and then centrifuge at 4,000 rpm for 30 min at 4 °C. Discard the supernatant and keep the pellet on ice. Resuspend the pellet with 5-10 ml ice-cold affinity buffer.Transfer the resuspended pellet to a 50 ml tube and centrifuge at 4,000 rpm, 20 min, 4 °C. Discard the supernatant and store the pellet at -80 °C.For protein purification thaw the pellet on ice while preparing the lysis, affinity and elution buffers. Filter-degas the buffers using the filter and degassing system with MicronSep filters.Mix the pellet with 10 ml ice-cold lysis buffer per g pellet and resuspend by pipetting up and down (prevent air bubbles and keep solution on ice).",
    "Put the falcon in a box or glas with ice and sonicate the sample for approximately 8-10 rounds of 30 sec with 70% power and 1 min pause between each round. Take care that no air bubbles are formed during sonication and that the sample does not become warm.Transfer the lysed cells into SS34 centrifugation tubes and centrifuge at 20,000 rpm, 30 min, 4 °C.During centrifugation, wash the ÄKTA pumps and column with degassed 20% ethanol solution and degassed Millipore water and equilibrate with affinity (pump A) and elution (pump B) buffers. Transfer the supernatant to the superloop and connect the loop to the ÄKTA.Set the parameters for the ÄKTA run (pressue limit, flow, etc.) according to manufacturer recommendations. Start the run by setting the flow to 0.5 ml/min and press inject. The flow through can be collected. Switch from inject to load when the superloop is empty. Then wash with affinity buffer as long as UV reaches baseline again.Apply a gradient of 0- 50% elution buffer in 30 min and collect the flow through in 2 ml fractions. The protein of interest should elute during this gradient or when 100% elution buffer is applied to the column. Afterwards the ÄKTA system and column should be washed with degassed Millipore water and degassed 20% ethanol solution.The fractions containing the protein of interest can be analyzed by SDS PAGE. Therefore, take 20 µl samples and add 10 µl 3x loading dye, denature for 5 min at 95 °C and then load on a 12% SDS PAGE.Combine all fractions with proper amount of the protein of interest and concentrate them if necessary (e.g. to decrease the volume).Equilibrate the ÄKTA and size exclusion chromatography column in SEC buffer.",
    "Centrifuge the protein sample at 13,000 rpm for 10 min and inject the supernatant into the sample loop.Start the run with 0.35 ml/min flow and press inject. Collect the flow through and analyze peak fractions by SDS PAGE. Then combine the fractions which include the protein of interest, concentrate the solution and store at -20 °C.Preparation of protein crude extractsTake 100 ml autoclaved minimal media (MM) in 300 ml buffled falsks and add supplements according to the A. nidulans strains. Inoculate with 1 x 106 spores/ml medium and incubate at 37 °C for 20 h under illumination and 120-150 rpm agitation.Collect the mycelium in funnels with miracloth filters. Wash the mycelium with 50-100 ml 0.96% NaCl solution and then take the miracloth filter containing the mycelium and dry it between paper towels.Transfer the dry mycelium (take mycel of the size of a 1 cent coin) to a 2 ml reaction tube and put into liquid nitrogen. Pre-cool the reaction tube holders of the Mixer Mill in liquid nitrogen by pouring a small amount into a Styrofoam box.Add two metal balls to each tube and put the tube into the holder.Close the holder and assemble them to the Mixer Mill. Set the program to 1 min and frequency to 30/sec then press start. Transfer the tube holder again into the box with a little bit of liquid nitrogen to prevent thawing.Take out the metal balls with a strong magnet. Then transfer the grinded mycelium to a new 2 ml tube and put the tubes again to liquid nitrogen.Put all tubes on ice and open them immediately. Add 300 µl B* buffer and vortex for ~1 min.Centrifuge for 30 min, 13,000 rpm, 4 °C.Transfer the supernatant to a fresh 1.",
    "5 ml tube and centrifuge again for 10 min, 13,000 rpm, 4 °C. In case there is still a pellet, transfer the supernatant to a fresh 1.5 ml tube. Measure the protein concentration with Nanodrop. To prevent protein aggregate formation, do not store the crude extracts longer than 1 week at -20 °C (to perform the deneddylation assay at the same or next day would be optimal).Deneddylation assayProtein crude extracts of csn deletion and wild type strains serve as neddylated and deneddylated cullin source. Recombinant A. nidulans CSN proteins are used to complement the deletions. If necessary, thaw all protein solutions, centrifuge at 13,000 rpm for 10 min at 4 °C (do not freeze and thaw protein solutions more than 2-3 times as proteins form aggregates). Transfer the supernatant to a new tube. Re-measure the concentration using Nanodrop.For each reaction, mix 80 µg of the protein crude extracts with 8 µg recombinant protein, 100 mM DTT and B* buffer to a final volume of 30 µl in a 1.5 ml reaction tube (Table 1). As a control, prepare the same reactions without recombinant protein. Incubate at 37 °C for 30 min and 120 rpm agitation. Table 1. Pipetting scheme (example)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160321/20160321031746_9646.pngAdd 15 µl 3x SDS sample buffer to each reaction, mix, denature at 95 °C for 5 min and then cool down on ice for 1 min. Flash spin the samples for 3-5 sec in a table centrifuge.Prepare 12% SDS gels.Load 10 µl of each sample on a gel and use 3.5 µl of Page Ruler Prestained Protein Ladder as size standard. Use 1x running buffer to run the electrophoresis.",
    "Apply 120 V until the proteins reach the resolving gel and then increase the voltage to 150-180 V until the 25 kDa band of the page ruler ran out of the gel. Stop the migration and carefully transfer the gel to the western blotting apparatus. Assemble the western blot according to the manufacturer recommendations and as represented in Figure 1. Close the cassette with the colorless site and transfer it into the Mini trans-blot central core after it was placed into the electrophoresis chamber filled with transfer buffer. The proteins can be blotted either for at least 1 h at 100 V and appropriate cooling of the buffer or overnight at 35 V. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160316/20160316065905_1316.jpgFigure 1. Western blot assembly. Schematic representation of the order of blot assembly for western hybridization.Disassemble the blot and cover the membrane with blocking solution for 1 h at room temperature and gentle agitation.Discard the blocking solution and separate the membrane into two pieces at the 70 kDa page ruler band (Figure 2). Add the primary antibody α-Nedd8 or α-CulA (dilution in blocking solution 1:1,000) to the upper membrane. As loading control the primary antibody α-Tub or α-Act (dilution in blocking solution 1:1,000) can be added to the lower membrane part. Incubate for 1 h at room temperature and gentle agitation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160316/20160316065922_6504.jpgFigure 2. Western blot membrane. The dashed line indicates where the membrane needs to be cut in order to develop the loading control (Actin or Tubulin ~40 kDa) simultaneously with the CulA or Nedd8 antibody (signal ~100 kDa).Remove the primary antibodies and wash the membranes 3 x 10 min with 1x TBST at room temperature and gentle agitation.",
    "Add the secondary antibody α-goat rabbit to the upper membrane and α-goat mouse (both 1:1,000 in blocking solution) to the lower membrane for 1 h at room temperature and gentle agitation.Remove the secondary antibodies and wash the membranes 3 x 10 min with 1x TBST buffer at room temperature and gentle agitation.For signal detection prepare the detection solutions freshly. Then mix detection solution A with detection solution B on the membrane for 2 min at room temperature and gentle agitation. Subsequently place the membrane into a plastic foil and transport it via an autoradiography cassette to the Fusion imaging system (important: switch on the PC and Fusion imaging system before you are ready to use, because the camera needs approximately 10 min for cooling down). Click on ‘start preview’, place the membrane into the apparatus, click ‘Set-up’ → ‘Sensitivity’ → ‘Super Sensitivity’ → ‘Auto Exposure’ (takes 1-4 min to detect appropriate signals). Save the image as TIF file (also automatically saved as STB file).Analyze signals with Fusion BIO-1D software as followed: Click ‘Open an Image’ and then choose the image. Click ‘Optical Density’.A- Lane definition: click ‘New Lane’, a box with green lines appears (Figure 3). Drag around the signals to define the area to be analyzed. click ‘Select all’ → ‘Next >>’.B- Background subtraction: click ‘Do rolling ball’ → ‘Next >>’.C- Spot separation: click ‘Add separation’ or use given separations and place the brackets around band boundaries by dragging the cursor (Figure 4). Click ‘Next >>’.Untick ‘Concentration’, ‘Height’, Area’ and ‘Molecular Weight’ (only ‘Volume’ has a tick) (Figure 5). Press the ‘Excel’ button. An Excel window opens with the volume data representing the pixel intensity inside a defined boundary (Figure 6). Further quantify signals considering wild type signal and loading controls.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160316/20160316065937_8916.jpgFigure 3. BIO-1D, A-Lane definition.",
    "Screenshot of BIO-1D software showing a green lined box that can be dragged to define the analysis area.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160316/20160316070002_5865.jpgFigure 4. BIO-1D, C-Spot separation. Screenshot of BIO-1D software displaying the separation of the band boundaries by placing brackets.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160316/20160316070158_7755.jpgFigure 5. BIO-1D, Data export to Excel. Screenshot of BIO-1D software displaying the step where the value of the Volume has to be selected to be exported to Excel.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160316/20160316070237_5884.jpgFigure 6. BIO-1D, Data in Excel. Screenshot of Excel table with values of pixel intensity inside a defined boundary."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}