{
  "id": 2348,
  "origin_website": "Cell",
  "title": "Protocol to measure bacterial intake and gut clearance of Caenorhabditis elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nExperiment preparations\nTiming: 1 week\nIn this section, wild-type C. elegans will be synchronized via timed egg laying. E. coli OP50 and P. aeruginosa PA14 NGM plates will be prepared for measuring pumping and defecation rates.\nTransfer 5 well-fed wild-type gravid adult C. elegans to a fresh maintenance NGM plates seeded with E. coli OP50.\nAllow the animals to lay eggs and for the progeny to grow at 20°C until they reach gravid adult stage. The new eggs will develop into gravid adult animals in approximately 96 h.\nNote: Monitor the amount of bacteria on the lawn as the animals develop. Avoid starving the animals by transferring them to fresh plates if the bacteria appear depleted.\nSynchronize the animals by transferring 20 gravid adults to a NGM plate seeded with E. coli OP50.\nPlace the plate with the 20 gravid adults into a 25°C incubator for 45 min to lay eggs.\nAfter 45 min, retrieve the plates from the 25°C and remove all the gravid adults from the plates. Place the plates with the newly laid eggs in the 20°C for 65 h.\nNote: Count the number of adults as they are removed from the plate to ensure that all 20 adult animals have been removed. If an adult is left on the plate, it will ruin the synchronization and delay the experiment.\nStreak fresh E. coli OP50 on a new LB agar plate on the same day of animal synchronization and incubate the plate at 37°C for 16 h.\nStreak fresh Pseudomonas aeruginosa PA14 on a new LB agar plate on the same day of animal synchronization and incubate the plate at 37°C for 16 h.",
    "The following day, inoculate 5 mL of liquid LB with a single colony from the new E. coli OP50 streak plate, inoculate another 5 mL of liquid LB with a single colony from the new P. aeruginosa PA14 streak plate. Incubate both broths for 16 h in a shaking incubator at 200 rpm.\nThe next day, seed five 35 mm NGM plates with 30 μL for both E. coli OP50 and P. aeruginosa PA14 broth for a total of ten plates and incubate at 37°C for 16 h.\nRetrieve the ten 35 mm NGM plates from the 37°C the next day and allow the plates to cool on the bench for 30 min.\nPumping rate quantification\nTiming: 2 days\nIn this section, synchronized C. elegans will be exposed to both E. coli OP50 and P. aeruginosa PA14. The pumping rates of individual animals on both bacterial conditions will be measured three times in 30 s intervals to create a scatterplot and average pumping rate.\nTransfer ten 65 h old, synchronized adult animals to each of the fresh 35 mm NGM plates seeded with E. coli OP50 or P. aeruginosa PA14.\nPlace the ten 35 mm NGM plates with 65 h old animals in a 25°C incubator for 24 h.\nThe next day, retrieve the animals from the 25°C incubator.\nSet a timer for 30 s before finding an animal under a Leica M80 dissecting stereomicroscope.\nFocus on the terminal bulb of the pharyngeal grinding. Refer to Figure 1[href=https://www.wicell.org#fig1] for the location of the terminal bulb.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1838-Fig1.jpg\nFigure 1. Labeled DIC image of an adult C. elegans\nStart the timer and begin counting the complete cycles of the terminal bulb for the full 30 s.",
    "Note: A complete cycle of the terminal bulb is defined as the up and down motion of grinder opening and closing as bacteria enter (Avery, 1993[href=https://www.wicell.org#bib1]).\nNote: The animal will move through the bacteria as they eat. Be sure to follow the animal on the microscope as you count and do not try to touch the animal before counting the pharyngeal pumping rate. Touching the animals with the pick will increase their pumping rate temporarily and skew your results.\nRecord the number of pharyngeal contractions and continue counting the same animal’s pumping rate two more times.\nAfter counting the pumping rate in triplicate, remove the animal from the plate.\nCount and record a total of 10 individual animals per bacterial conditions.\nAverage the pumping rate for each individual animal.\nPlot the averages for each individual animal in GraphPad Prism to find the average pumping rate and standard deviation for the whole group.\nDefecation rate quantification\nTiming: 2 days\nIn this section, synchronized C. elegans will be exposed to both E. coli OP50 and P. aeruginosa PA14. The defecation rates of individual animals on both bacterial conditions will be measured five times by measuring the time between rectal muscle contractions to create a scatterplot and average defecation rate.\nTransfer ten 65 h old, synchronized adult animals to each of the fresh 35 mm NGM plates seeded with E. coli OP50 or P. aeruginosa PA14.\nPlace the ten 35 mm NGM plates with 65 h old animals in a 25°C incubator for 24 h.\nThe next day, retrieve the animals from the 25°C incubator.\nFocus on the rectum of an individual animal and track the animal under the microscope. Refer to Figure 1[href=https://www.wicell.org#fig1] for the location of the rectum.",
    "Using a stopwatch, start the watch at the first intestinal expulsion. Follow the animal and press the stopwatch’s lap button on the next intestinal expulsion.\nNote: Defecation or expulsion of the intestinal contents can be seen as both a contraction of the rectal muscles near the tail of the animals or a visible ejection of material from the nematodes.\nNote: The animal will move through the bacteria as they eat. Be sure to follow the animal on the microscope as you count and do not try to touch the animal before counting the defecation rate. Touching the animal will increase pumping rate and in turn may affect the defecation rate.\nContinue measuring the time between defecations four more times for a total of five measurements.\nAfter measuring the defecation five times, remove the animal from the plate.\nCount and record a total of 10 individual animals per bacterial condition.\nAverage the defecation times for each individual animal.\nPlot the averages for each individual animal in GraphPad Prism to find the average defecation rate and standard deviation for the whole group."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}