{
  "id": 13331,
  "origin_website": "Jove",
  "title": "Efficient Generation of Pancreas/Duodenum Homeobox Protein 1+ Posterior Foregut/Pancreatic Progenitors from hPSCs in Adhesion Cultures",
  "procedures": [
    "Experiments using hPSCs were approved by the ethics committee of the Department of Medicine and Graduate School of Medicine, Kyoto University.\n1. Preparation of Materials\nNOTE: Prepare all media and reagents for cell culture in a sterile environment. Warm up base culture media to room temperature (RT) before use. Medium for differentiation is used within 6 h at RT. Details of the reagents are listed in Table of Materials.\nDifferentiation (Figure 1A)\nStage 1A medium: Transfer RPMI 1640 medium into a tube using a pipette. Add the serum-free supplement, activin A, CHIR99021, and Y-27632 to a concentration of 1x, 100 ng/mL, 3 μM and 10 μM, respectively.\nStage 1B medium: Transfer RPMI 1640 medium into a tube using a pipette. Add the serum-free supplement, activin A and CHIR99021 to a concentration of 1x, 100 ng/mL, ≤1 μM, respectively.\n\t\tNOTE: The concentration of CHIR99021 should be lower than in Stage 1A medium, and addition is not necessary, but it increases the cell number.\nStage 2 medium: Transfer Improved MEM (iMEM) medium into a tube using a pipette. Add the serum-free supplement and keratinocyte growth factor (KGF) to a concentration of 0.5x and 50 ng/mL, respectively.\nStage 3 medium: Transfer iMEM medium into a tube using a pipette. Add the serum-free supplement, KGF, NOGGIN, 3-Keto-N-aminoethyl-N’-aminocaproyldihydrocinnamoyl cyclopamine (CYC) and 4-[(E)-2-(5,6,7,8-Tetrahydro-5,5,8,8-tetramethyl-2-naphthalenyl)-1-propenyl]-benzoic acid (TTNPB) by pipette to concentrations of 0.5x, 50 ng/mL, 100 ng/mL, 0.5 μM and 10 nM, respectively.\nFlow cytometry (FCM)\n1x Permeabilization/Wash buffer: Transfer water into a tube by a pipette. Add Permeabilization/Wash buffer by a pipette to a concentration of 1x.\nFCM blocking solution: Transfer 1x Permeabilization/Wash buffer into a tube by a pipette. Add donkey serum by a pipette to a concentration of 2% (vol/vol).\nImmunostaining",
    "Blocking solution: Transfer Dulbecco's Phosphate-Buffered Saline (DPBS) into a tube by a pipette. Add donkey serum and Triton X by pipette to concentrations of 5% (vol/vol) and 0.4% (vol/vol), respectively.\n2. hPSC Differentiation to Posterior Foregut Cells/Pancreatic Progenitors (PDX1+ Cells) \nNOTE: Conduct all procedures using sterile techniques. hPSCs are maintained on 6-well plates coated by a synthetic surface material for hPSCs with hPSC maintenance medium according to the manufacturer's instructions17,26. When cells reach 50-80% confluency (Stage 0) use them for differentiation.\nPrepare basement membrane matrix-coated plates.\nTransfer 6 mL of RPMI 1640 (4 °C) into a tube cooled to 4 °C on ice. Add 2 mg of basement membrane matrix (4 °C) with cooled 1 mL-pipette tips and mix well by gentle pipetting to make 0.33 mg/mL basement membrane matrix.\nTransfer 2 mL of diluted basement membrane matrix to each well of 6-well cell culture plates by a pipette. Place the plates at 37 °C for 60-90 min in an incubator. Afterward, keep the plates at RT until use (within 3 h).\nSeed the hPSCs and initiate differentiation to definitive endoderm (Stage 1A).\nAspirate the used medium and add 2 mL of 0.5 mM ethylenediaminetetraacetic acid (EDTA) (RT) per well by pipette to wash the hPSCs cultured in the 6-well plates.\nAspirate 0.5 mM EDTA and add 2 mL of 0.5 mM EDTA per well by pipette. Incubate the plates at 37 °C for 5 min.\nAspirate 0.5 mM EDTA and add 1 mL of hPSC maintenance medium at RT supplemented with 10 μM Y-27632 per well by pipette. Pipette gently but quickly to blow off attached cells on the plates and to dissociate clumped cells into single cells. Do not bubble the cell suspension during pipetting.",
    "Transfer the cell suspension in a 50 mL centrifuge tube containing 4 mL of hPSC maintenance medium at RT supplemented with 10 μM Y-27632. Gently pipette the cell suspension. \nCount the cell number in the cell suspension using the Trypan Blue stain exclusion procedure.\n\t\t\nMix 15 μL of cell suspension and 15 μL of Trypan Blue in a tube.\nTransfer 10 μL of the cell suspension diluted with Trypan Blue onto cell counting slides in duplicate by a 10 μL pipette.\nCount the cell number with an automatic cell counter and calculate the cell density in the cell suspension. Viability is usually >98%.\nAliquot the cell suspension in a 50 mL centrifuge tube at 1-1.5 x 106 cells per well of 6-well plates (1-1.5 x 105 cells/cm2).\nCentrifuge the 50 mL tube at 200 x g at RT for 5 min.\nAspirate the supernatant using a pipette and resuspend the cells with 1 mL of Stage 1A medium (RT) per well. Gently pipette the cell suspension and add another 1 mL of Stage 1A medium (total, 2 mL per well).\nAspirate the diluted basement membrane matrix in the wells of the cell culture plates prepared in step 2.1.2 by a 1,000 μL pipette. Proceed to the next step immediately.\nGently pipette the cell suspension in step 2.2.8 again. Immediately after mixing, transfer the cell suspension (2 mL) into each well of a 6-well plate. Cover the plate with an aluminum foil to protect the plate from light. Place the plate in the clean bench at RT for 10-15 min.\nNOTE: Do not move the plate after seeding.\nGently place the plate into a 37 °C, 5% CO2 incubator (humidified atmosphere) and culture for 24 h.\nNOTE: Do not shake the plate after seeding.",
    "Induce the differentiation into definitive endoderm (Stage 1B).\nAspirate the used medium and add 2 mL of DPBS to the wells by pipette. Repeat the aspiration and addition of DPBS one time.\nNOTE: To remove any dead cells from the monolayer, gently shake the plate before each aspiration.\nAspirate the used DPBS by a pipette and add 4 mL of Stage 1B medium (37 °C) per well. Gently place the plate into the 37 °C incubator (humidified atmosphere of 5% CO2) and culture for 48 h.\nAspirate the used medium and add 2 mL of DPBS to the well by pipette. Repeat the aspiration and addition of DPBS one time.\nNOTE: Remove the dead cells from the monolayer by gentle shaking before each aspiration.\nAspirate the used DPBS by pipette and add 4 mL of Stage 1B medium (37 °C) per well. Gently place the plate into the incubator (37 °C, humidified atmosphere of 5% CO2) and culture for 24 h.\nInduce the differentiation into the primitive gut tube (Stage 2).\nAspirate the used medium and add 2 mL of DPBS to the well by pipette.\n\t\tNOTE: Remove the dead cells from the monolayer by gentle shaking before each aspiration.\nAspirate the used DPBS by pipette and add 4 mL of Stage 2 medium (37 °C) per well. Place the plate into the incubator (37 °C, humidified atmosphere of 5% CO2) and culture for 4 days.\nInduce the differentiation into PDX1+ cells (Stage 3).\nAspirate the used medium and add 2 mL of DPBS to the well by pipette. Repeat the aspiration and addition of DPBS one time.",
    "Aspirate the used DPBS by pipette and add 4 mL of Stage 3 medium (37 °C) per well. Place the plate into the incubator (37 °C, humidified atmosphere of 5% CO2) and culture for 3 days.\nInduce the differentiation into pancreatic endocrine cells.\nPerform NKX6.1+ cell induction (Stage 4, for 8 days) followed by endocrine cell induction (Stage 5, for 12 days) with previously described protocols3,16,26. Characterize and validate the endocrine cell differentiation by immunostaining and quantitative real-time reverse transcription polymerase chain reaction (qRT-PCR) analysis.\nNOTE: Refer to Toyoda et al.16 and Kimura et al.26 for detailed experimental procedures. Refer Table 1 for primer sequences used for qRT-PCR analysis.\n3. Flow Cytometry (FCM)\nAspirate the used medium and add 2 mL of 0.5 mM EDTA to the well by pipette. Repeat the aspiration and addition of 0.5 mM EDTA one time.\nNOTE: Shake the plate gently to remove any dead cells from the monolayer cells before each aspiration.\nTo dissociate the cells (approximately 3-6 × 106 cells per well), add 2 mL of 0.25% Trypsin containing 0.5 mM EDTA per well. Incubate the plates at 37 °C for 5-10 min.\nPipette gently but quickly to dissociate clumped cells into single cells. Do not bubble the cell suspension during pipetting.\nAdd 8-10 mL of base medium (RPMI 1640 or iMEM, RT) containing 0.5x serum-free supplement and 10 μM Y-27632 per well and mix the cell suspension. Transfer the cell suspension into a centrifuge tube.\nCentrifuge the tube at 300 x g at RT for 5 min.\nAspirate the supernatant and resuspend the cells with 2 mL of 0.5 mM EDTA (RT). Gently pipette the cell suspension.\nCentrifuge the tube at 300 x g at RT for 5 min.",
    "Aspirate the supernatant and resuspend the cells with 100 μL of fixation and permeabilization buffer per 106 cells under a hood. Gently pipette the cell suspension under a hood. Keep the tube at RT for 30 min.\nCentrifuge the tube at 400 x g at RT for 5 min.\nAspirate the supernatant under a hood and resuspend the cells with 500 μL FCM Blocking solution per 106 cells. Gently pipette the cell suspension. Keep the tube at RT for 30 min.\nTransfer 50 μL of the cell suspension to a tube (approximately 1 x 105 cells). Centrifuge the tube at 400 x g at RT for 5 min. Remove the supernatant and resuspend the cells with 100 μL of diluted primary antibody (see Table of Materials) in FCM blocking solution and incubate at 4 °C for >16 h.\nCentrifuge the tube at 400 x g at RT for 5 min. Remove the supernatant and resuspend the cells with 180 μL of 1x Perm/Wash buffer.\nCentrifuge the tube at 400 x g at RT for 5 min. Remove the supernatant and resuspend the cells with 100 μL of diluted secondary antibody (see Table of Materials) in FCM blocking solution. Incubate the cells at RT for 60 min or at 4 °C for >16 h with protection from light.\nCentrifuge the tube at 400 x g at RT for 5 min. Remove the supernatant and resuspend the cells with 180 μL of 1x Perm/Wash buffer.\nCentrifuge the tube at 400 x g at RT for 5 min. Remove the supernatant and resuspend the cells with 180 μL of 2% donkey serum in DPBS.",
    "Filter the cell suspension by transferring on a 5 mL round bottom polystyrene tube with a cell strainer (35 µm nylon mesh) and keep at 4 °C with protection from light until the analysis.\nAnalyze a proportion of positively stained cells by a flow cytometer27.\n4. Immunostaining \nAspirate the used medium and add 2 mL of DPBS to the well by pipette. Repeat the aspiration and addition of DPBS one time.\nNOTE: Gently shake the plate to remove any dead cells from the monolayer cells before each aspiration.\nAdd 2 mL of 4% paraformaldehyde (PFA) (4 °C) per well by pipette under a hood. Keep the plate at 4 °C for 20 min.\nRemove the PFA by pipette under a hood. Add 2 mL of DPBS at RT to the well by pipette under a hood. Repeat the aspiration and addition of DPBS one time.\nAdd 2 mL of blocking solution per well and keep the plate at RT for 30 min.\nAspirate the used solution and add 1 mL of primary antibody (see Table of Materials) in blocking solution per well. Incubate at RT for 60 min or at 4 °C for >16 h.\nAspirate the used solution, add 2 mL of DPBS containing 0.4% Triton X-100 and incubate at RT for 10 min. Repeat the aspiration, addition of solution and incubation one time.\nAspirate the used solution and add 1 mL of secondary antibody (see Table of Materials) in blocking solution per well. Incubate at RT for 60 min with protection from light.\nAspirate the used solution, add 2 mL of DPBS containing 0.4% Triton X-100 (RT) and incubate at RT for 5 min with protection from light. Repeat the aspiration, addition of solution and incubation two times.",
    "Take micrographs to examine the differentiation efficiency under a fluorescence microscope28.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}