{
  "id": 19581,
  "origin_website": "Jove",
  "title": "Deep-Tissue Three-Photon Fluorescence Microscopy in Intact Mouse and Zebrafish Brain",
  "procedures": [
    "All animal experimentation and housing procedures for zebrafish and mice were approved and conducted in accordance with the Cornell University Institutional Animal Care and Use Committee (IACUC) guidance. Zebrafish and mice were euthanized by high-concentration tricaine solution and carbon dioxide asphyxiation, respectively, after the experiment.\n1. Optimization of the three-photon microscopy setup\nNOTE: Wear laser safety glasses for eye protection. Block the laser beam with a beam blocker when optics are placed or moved. To visualize the laser, use an infrared viewer or an infrared detector card.\nTurn the laser on and set the center wavelength of the idler output of the non-collinear optical parametric amplifier (NOPA) at ~1,300 nm or ~1,700 nm.\nPlace a thin cover glass on the beamline from the signal port of NOPA (i.e., ~700-900 nm) to reflect a small fraction of the laser beam to a Si photodiode to obtain triggering signals (Figure 1). Place a beam blocker in the transmission path of the cover glass.\nPlace pulse compressors on the light path to prechirp the femtosecond laser to optimize the pulse duration for 3PM. For ~1,300 nm beam, place a prism-pair compressor18,19 (e.g., N-SF11 prism pairs). For ~1,700 nm laser, place a Si plate of ~3 mm in thickness20. Set the angle between the Si plate and the laser path at the Brewster's angle (~73.9° for 1,700 nm) to maximize the laser transmittance. Rotate the Si plate to achieve the Brewster's angle by minimizing the reflection.\nPlace flipper mirrors to enable convenient switching between the ~1,300 nm and ~1,700 nm beam lines.",
    "Place a half waveplate (e.g., an achromatic half waveplate suitable for ~1,300 and ~1,700 nm) mounted on a rotation stage and a polarizing beam splitter (PBS) to control the intensity of the laser. Place a beam blocker in the reflection path of the PBS.\n\tNOTE: The laser needs to pass through the PBS perpendicularly to achieve a high extinction ratio. The laser power for 3PM is controlled by rotating the half waveplate.\nPlace a thin cover glass in the light path after the power controller and before the optical shutter to reflect a small fraction of the laser beam to a power meter. Use the power meter as a 'reference power meter' to calculate the laser power under the objective during imaging (see step 1.12).\nAlign the laser path by adjusting the mirrors to propagate the beam into the 3PM system.\nMeasure the beam size at the position of the back aperture of the objective using a knife-edge on a translation stage and a power meter. Ensure that the beam size is not too small or too large.\n\tNOTE: Typically, the beam slightly underfills the high NA objective lens to achieve high power throughput for deep tissue imaging. For example, a beam size of ~10-13 mm (1/e2) at the back aperture of the Olympus objective (~15 mm back aperture diameter) helps achieve an effective NA of ~0.7-0.9. When the beam size is too small, the 3P signal becomes weak, and the spatial resolution worsens because of the low effective NA. When the beam size is too large, the maximum available excitation power under the objective becomes weak due to the power loss at the back aperture of the objective. For deep-tissue imaging, the marginal rays also suffer a higher loss due to the longer path in the tissue.",
    "If the beam size at the back aperture of the objective is not appropriate, place appropriate optical elements, such as convex lenses, in the laser beam path to adjust the beam size.\n\tNOTE: Ensure that the laser beam is not larger than the galvo mirrors to prevent unnecessary power loss.\nPlace the objective lens on the 3PM setup.\nMeasure the pulse duration after the objective using an autocorrelator. Adjust the pulse compressor to achieve shorter pulses if the pulse duration is too long (e.g., >70 fs). Use ~50-70 fs pulses for 3PM and a Michelson interferometer placed between the laser and the objective to provide the delay for autocorrelation measurements.\n\tNOTE: A photodiode with a proper spectral response (e.g., a silicon photodiode for wavelength greater than 1,200 nm) placed at the focus of the objective can conveniently serve as a nonlinear detector, and the two-photon photocurrent from the photodiode can be used to obtain the autocorrelation traces20. The prism-pair compressor for ~1,300 nm can be adjusted in two ways: (1) changing the distance between the two prisms; (2) changing the pathlengths of the laser beam in the prism glass by moving the prism(s) perpendicularly to the baseline of the prism. The Si plate compressor for ~1,700 nm can be adjusted by replacing the Si plate with a thicker or thinner Si plate.\nPlace a power meter at the output of the objective lens. Measure the laser power under the objective and read the value of the reference power meter (from step 1.6). Calculate the ratio of the power under the objective and at the reference power meter.\n\tNOTE: During imaging, the actual laser power under the objective can be calculated from the power ratio and the value of the reference power meter.",
    "Take out the power meter from under the objective.\n[Optional] Verify photon shot-noise limited performance of the imaging system\n\tNOTE: To perform this task, the following elements are needed: 1) one fluorescein or Texas Red dye pool (e.g., ~10 µM), 2) a photon counter, and 3) an oscilloscope. \n\t\nPlace the dye pool sample under the 3PM objective lens.\nCarefully lower the objective lens onto the dye pool until the distance is less than the working distance of the objective lens.\nPlace water between the lens and the cover glass of the dye pool.\nSet the output power of the microscope to a small amount (e.g., <1 mW with ~1 MHz pulse repetition rate) to locate the surface of the dye pool.\nStart the Live session of the microscope and set the z location to zero.\nSlowly move the objective away from the sample to reach the top of the dye pool (as indicated by the third harmonic generation (THG) produced by the cover glass).\nSet the z location to zero at the position of the cover glass.\nLower the objective slightly until a clear fluorescence signal is visible in the fluorescence channel.\nConnect the output of the PMT to a BNC splitter. Connect the outputs of the divider to the photon counter and the image acquisition system.\nSet the laser power to a value where the photon counts per second are lower than 5% of the laser repetition rate (e.g., imgsrc://cloudfront.jove.com/files/ftp_upload/63213/63213eq03v2.jpg50,000 photons/s when a 1 MHz laser is used).\nReduce the field of view to the minimum possible with the software and ensure that the brightness is uniform across the image.\nSet the frame rate to 1.0 frame per second.",
    "Set the acquisition period of the photon counter to t = number of pixels per frame × pixel dwell time and an appropriate discriminator level.\nCollect the photon count and pixel counts simultaneously for an equivalent period. To obtain the pixel count, collect average pixel values of the entire image, as well as the mean and standard deviation values.\nRepeat step 1.14.14, blocking the excitation laser to obtain the dark photon count and pixel counts.\nStop the Live acquisition of the software.\nSubtract the dark counts (obtained in step 1.14.15) from the photon counts (obtained in step 1.14.14) and the total pixel count (obtained in step 1.14.14).\nDivide the dark-subtracted total pixel count by the dark-subtracted photon count (obtained in step 1.14.17). Use the obtained value as the 'conversion factor' (i.e., pixel values/photon) from a pixel value to a photon count.\nConvert the mean and standard deviation of the pixel counts (obtained in step 1.14.14) to photon counts, i.e., dividing them by the 'conversion factor' (obtained in step 1.14.18). Compare the mean and standard deviation of the photon counts. Ensure that the standard deviation is approximately equal to the square root of the mean of the photon counts if the imaging system performance is close to the shot-noise limit.\n[Optional] Verify the signal detection efficiency of the microscope.\n\t\nTo test the microscope performance and the signal detection efficiency, follow steps 1.14.1-1.14.17 to obtain photon counts. For step 1.14.15, create a blank sample made of the solvent for the dye and obtain the photon counts for the blank sample with the laser on and at the same power as for the dye pool. Subtract the blank counts from the photon counts from the dye pool to obtain the fluorescence photon counts.",
    "Use the known 3P cross-sections of fluorescein or Texas Red10,22 and Eq. (1) (with an effective NA to account for the back aperture filling properly) to calculate the expected photon counts and then compare the calculated value with the photon counts measured experimentally. Record both photon counts in the lab notebook as test results for the microscope for future references.\n\t\tNOTE: Ensure that the calculated and measured values are close to each other (e.g., within a factor of 2). Such quantitative tests of the system are particularly useful to ensure consistent imaging performance over time.\n2. Fish preparation for 3PM\nNOTE: Wear gloves and a lab coat for this procedure. Choose the adult zebrafish according to the experiment. Finish the entire preparation (steps 2.1 to 2.7) within ~15 min.\nPrepare a Petri dish with ~0.5 cm of 2% high-melting-point agar. Cut a rectangular hole in the agar longer and slightly wider than the fish. Use wax to attach thin tubing (for perfusion of water into the fish's mouth) to the Petri dish with one end in the rectangle. Use wax to attach larger diameter tubing (for removal of water) to the edge of the Petri dish.\nChoose fish for the experiment. Anesthetize the fish with 0.2 mg/mL tricaine solution (pH 7.2) in Hank's solution until the fish is completely unresponsive and deeply anesthetized.\nPlace the fish on its side on a wet sponge. Using a microsyringe, retro-orbitally inject 3 µL of pancuronium bromide (0.4 µg/µL in Hank's solution) to paralyze the fish. Place the fish in Hank's solution briefly to ensure it is fully paralyzed.",
    "Place the fish dorsal side-up in the Petri dish with the head toward the tubing. Using forceps to manipulate the tubing, gently open the fish's mouth and slide the tubing into the mouth. Gently slide the fish toward the tubing so that the tubing will be at the back of the fish's mouth.\nQuickly but gently dry the agar around the fish and remove the water on top of the fish. Dip a small piece of laboratory tissue into laboratory glue and put the tissue onto the agar on both sides of the fish and over the fish's back caudal to the gills.\n\tNOTE: Do not push on the fish or apply pressure. Be careful to avoid getting glue on the gills.\nApply a small drop of bupivacaine directly on the surface of the head to anesthetize the fish during imaging in the region where the laser will be contacting the skin.\nBring the Petri dish with the fish to the microscope and fill it with fish-facility water. Connect the tubing to a water pump to pump system water at 2 mL/min into the fish's mouth and simultaneously remove the perfusion solution from the dish at the same rate. Ensure that the water is oxygenated with a bubbler and warmed to ~30 °C with an aquarium heater.",
    "NOTE: The fish is now ready for imaging. Monitor the fish's health by monitoring blood flow in the third harmonic generation (THG) signal while imaging (see section 4.1). 3P imaging should also be compatible with more sophisticated fish preparations such as those used in 2P imaging to fix the head and allow body movements while imaging during virtual reality23. This completely non-invasive imaging avoids the need for skull removal as is typical in other studies of vertebrates and is a step toward minimizing invasive research and associated pain.\n3. Mouse preparation for 3PM\nNOTE: Wear gloves, surgical mask, and lab coat during the following procedures. Choose the mouse line according to the experiment. The mouse should be housed under a 12:12 h light-dark cycle before the surgery. The entire surgery (steps 3.2-3.11) is aseptic, and all surgery tools should be sterilized before use. The craniotomy takes ~1 h.\nPlace a donut-shaped (4.5-6.5 mm diameter) coverslip and a coverslip disk (5 mm diameter) on clean parafilm. Use a needle to apply a small amount of optical adhesive to glue the donut-shaped coverslip onto the coverslip disk. Cure the disk-donut coverslip on the parafilm under ultraviolet light for 10-20 min. Remove the entire disk-donut coverslip from the parafilm, and use tweezers to scratch away excess glue and 70% ethanol to remove debris.\n\tNOTE: The coverslips are ~0.17 mm thick. The donut-shaped coverslip is used to apply appropriate pressure on the brain for chronic imaging.\nAnesthetize the mouse with 3% isoflurane and 20% O2 gas mixture in an induction chamber. Weigh the mouse. Place the mouse in a prone position on a heating pad. Set the temperature of the heating pad to ~37 °C.",
    "Fix the upper teeth into the mouth hole of a stereotaxic apparatus with the placement of an anesthetic mask. Fix the ear bars to the ears. Maintain anesthesia with 2% isoflurane and 20% O2 gas mixture during the surgery.\n\tNOTE: Adjust the concentration of isoflurane by monitoring the mouse's response. Check the anesthesia level by watching the breathing rate (~1 Hz for deep sleep) and pinching the feet to check for any reaction before surgery.\nApply eye ointment to the eyes for lubrication. Close the eyelids. Turn on all the surgery lights. Subcutaneously inject ketoprofen, dexamethasone, and glycopyrrolate based on the mouse body weight before surgery.\n\tNOTE: The drug doses are 2 mg/mL, 0.1 mg/mL, and 0.1 mg/mL for ketoprofen, dexamethasone, and glycopyrrolate, respectively. The injection volumes for ketoprofen, dexamethasone, and glycopyrrolate depend on body weight and are 2.5 µL/g, 2 µL/g, and 2 µL/g, respectively.\nRemove hair on the crown of the head and near the ears.\n\t\nClip as much hair as possible with scissors or a hair clipper and remove the clipped hair from the surgical site.\nApply an appropriate amount of depilatory cream. Wait for 1 min.\nRemove hair and cream by using a cotton swab soaked in saline.\nRepeat steps 3.5.2 and 3.5.3 until the hair is completely removed.\nApply 5% povidone-iodine solution and then 70% ethanol on the skin to cleanse the area. Repeat the process three times.\nGive a subcutaneous injection of atropine (dose based on body weight, 0.02-0.05 mg/kg) on the head. Wait for 1 min.",
    "Cut the skin on the crown of the head to expose the skull. Ensure the bregma point and the lambda point are both exposed. Glue the remaining skin tissue on the edge to the skull by using biocompatible glue to avoid drilling dust from entering underneath the skin (which may elicit an immune response).\nUse a surgical marker to draw a 5 mm diameter circle over the area of interest. For example, choose the center of the area ~2.5 mm lateral and 2 mm caudal to the bregma, which covers most of the somatosensory cortex and the visual cortex.\nDrill along the circle slowly and apply saline to hydrate the skull when halfway done. Slow the drilling speed for the last half and cover the skull with saline before removing the skull. Open the skull gently with forceps and apply a small piece of sterile gelfoam soaked in saline to immediately stop any bleeding in the brain. Keep the brain hydrated by using saline.\nApply a drop of saline on the side of the prepared disk-donut coverslip facing the brain tissue. Place the protruded disk part of the disk-donut coverslip into the cranial window. Use a long bar held by the stereotaxic apparatus to gently press the disk part of the coverslip cranial window onto the brain surface, ensuring that the donut part tightly covers the skull. Dry the area around the disk-donut coverslip with a cotton swab.\nApply a layer of biocompatible glue under the donut-shaped edge. Apply a layer of dental cement mix under and around the donut part of the disk-donut coverslip. Apply another layer of glue above the dental cement. 5% glucose (dose based on body weight, 10 µL/g) can be injected subcutaneously every hour during the surgery to provide animal energy.",
    "Shut down the anesthesia system. Release the mouse from the stereotactic apparatus. Transfer the mouse to a customized compact stereotactic apparatus immediately, with a heating pad at ~37 °C and an anesthesia apparatus.\nPlace the mouse in a prone position on the heating pad of the customized compact stereotaxic apparatus. Set the temperature to ~37 °C. Fix the upper teeth into the mouth hole of the stereotactic apparatus and the ear bars to the ears of the mouse. Put on the anesthetic tubes, and maintain anesthesia with 1.5% isoflurane and 20% O2 gas mixture.\n\tNOTE: The mouse is now ready for imaging. Keep the mouse anesthetized during the following imaging procedures. Adjust the concentration of isoflurane by monitoring the mouse's response.\n4. Intravital imaging in fish and mouse brains\nIntravital imaging in the zebrafish brain\n\tNOTE: To properly locate the fish brain under the objective lens, a secondary charge-coupled device (CCD) camera is used on the same path as the excitation light for widefield imaging.\n\t\nSet up the microscope and calibrate the power (as described in section 1).\nPlace a low magnification (typically 4x) objective on the microscope.\nPlace the Petri dish containing the fish and the tubes under the microscope.\nUse a light-emitting diode (LED) light source to illuminate the Petri dish.\nOpen the Camera mode of the image acquisition software (Figure 2).\nClick Live.\nChoose channel A on the right side of the screen.\nAdjust the histogram settings to see the image clearly.\n\t\tNOTE: These need to be updated as needed.\nSet the motor setting on the motor controller to Base.\nLower the objective until the fish is visible.\n\t\tNOTE: Ensure that the objective lens does not make any physical contact with the head.",
    "Place the center of the fish head at the center of the field of view.\nMove the objective up and away from the fish head.\nReplace the low magnification objective lens with the high NA objective lens for 3PM.\n\t\tNOTE: The low magnification lens and the high NA objective lens do not need to be parfocal but must be close enough to ensure the fish is within the field of view of the high NA objective lens.\nSlowly lower the objective lens, ensuring that the objective does not make any physical contact with the head. In the CCD camera software, stop moving the objective when the top of the head is visible. Set the z location to 0 μm.\n\t\tNOTE: Ensure that there are no air bubbles under the objective lens when using a water-immersion objective.\nTurn off the LED light source and close the dark curtain around the system.\nSet the imaging acquisition software to Multiphoton GG mode for 3P imaging and set the power under the objective lens to less than 1 mW (with ~1 MHz pulse repetition rate).\nChange the motor setting button from Base to Objective on the motor controller.\nTurn down the lights in the room.\nTurn on the PMTs and open the 3PM excitation source shutter. Ensure that an outline of the bone appears in the fluorescence signal channel due to autofluorescence and in the THG signal channel due to THG of the bone (Figure 2C).\nPerform imaging at different depths by increasing the power levels when imaging deeper.\nIntravital imaging in the mouse brain\n\tNOTE: Inject 5% glucose into the anesthetized mouse every hour during imaging; the dose is based on body weight (10 µL/g).",
    "Set the imaging acquisition software to Multiphoton GG mode for 3P imaging and set the power under the objective lens to less than 1 mW (with ~1 MHz pulse repetition rate).\n\t\tNOTE: Ensure that the surgery window is placed perpendicular to the objective lens to reduce aberration. Fine adjustment is performed by tilting the stereotaxic apparatus.\nMove the objective lens close to the window and apply water between the objective and the cranial window; set axis values of all motors to zero.\n\t\tNOTE: Light absorption in H2O at ~1,700 nm is large, which significantly reduces the ~1,700 nm laser power after a depth of ~1-2 mm of water. For ~1,700 nm excitation, use D2O, which has much smaller absorption at 1,700 nm, for water immersion to reduce absorption by water.\nClick on the Live button in the image acquisition software and open PMT channels, e.g., one fluorescence signal channel and one THG signal channel. Adjust the PMT gain and background level as needed.\nSlowly move up the objective lens to locate the window surface by monitoring the THG channel from the large blood vessels and the window glass surface. Adjust the window orientation (see the note in step 4.2.12) if needed. Zero the motors to define the surface of the brain.\nPerform imaging and adjust the power level according to the imaging depth."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}