{
  "id": 19454,
  "origin_website": "Jove",
  "title": "Expression and Purification of the Human Lipid-sensitive Cation Channel TRPC3 for Structural Determination by Single-particle Cryo-electron Microscopy",
  "procedures": [
    "1. Transformation of DH10α Competent Cells to Produce Bacmid DNA\nSynthesize the gene of interest and subclone it into a modified version of the pEG vector containing a twin strep-tag, a His8-tag, and GFP with a thrombin cleavage site at the N terminus (pFastBacI)20.\nTransform competent cells by adding 5 ng of plasmid containing a desired gene in pFastBacI to 50 μL of DH10α cells in a 1.5 mL tube and incubate for 10 min on ice. Heat shock the cells for 45 s at 42 °C. Add 200 μL of super optimal broth with catabolic repressor (SOC) medium to the tube and incubate for 4 - 8 h at 37 °C in an orbital shaker at 225 rpm.\nPlate 5 μL of cells on a bacmid LB agar plate (50 μg/mL kanamycin, 7 μg/mL gentamicin, 10 μg/mL tetracycline, 100 μg/mL Bluo-gal, and 40 μg/mL isopropyl β-D-1-thiogalactopyranoside [IPTG], agar).\nIncubate the plate for 48 h at 37 °C.\n\tNOTE: The Bluo-gal indicator stains colonies that are still expressing lacZ (vector insertion unsuccessful), allowing for selection of white (successfully transformed) colonies.\nCarefully select an isolated white colony, avoiding any white colonies that are in contact with blue colonies, and grow cells overnight in 6 mL of bacmid LB medium (50 μg/mL kanamycin, 7 μg/mL gentamicin, 10 μg/mL tetracycline) at 37 °C in an orbital shaker at 225 rpm.\n2. Bacterial Preparation for Isolation of Bacmid DNA\nTo isolate bacmid DNA, spin down Escherichia coli cells for 10 min at 2880 x g.\nDiscard the supernatant and resuspend the pellet in 200 µL of cell resuspension solution from the miniprep kit (see Table of Materials) by pipetting. Be sure the pellet is fully and homogenously suspended. Then, transfer the cell suspension into 1.5 mL tubes.",
    "Add 200 µL of the cell lysis solution from the miniprep kit and mix by inverting the tube a few times. Incubate for up to 5 min at room temperature (RT) to lyse the cells. Add 200 µL of neutralization solution from the miniprep kit and mix by inverting tube a few times to stop the lysis reaction.\nSpin down for 10 min at 21,130 x g in a table-top centrifuge. Collect 600 μL of supernatant in a 2 mL tube. Add 600 μL phenol:chloroform:isoamyl alcohol solution (see Table of Materials) and mix thoroughly to extract the DNA from the remainder of the cell lysis products.\n\tCAUTION: Phenol:chloroform:isoamyl alcohol solution is toxic by inhalation, in contact with skin, and if swallowed. It can cause chemical burns and may be carcinogenic. Wear gloves and a buttoned lab coat. Work in a fume hood. Dispose of this hazardous waste appropriately.\nSpin the tube for 10 min at 21130 x g in a table-top centrifuge. Two separate liquid phases will be visible. Carefully transfer 300 μL of the upper aqueous phase to a new tube. Add 600 μL of 100% ethanol to wash the DNA. Gently invert the tube to mix.\n\tNOTE: Do not vortex, as this can shear bacmid DNA.\nCool tubes by placing them in a -20 °C freezer for 10 min. Spin down for 10 min at 21,130 x g in a table-top centrifuge. Discard the supernatant and preserve the DNA pellet.\nAdd 1 mL of 70% ethanol to wash the pellet. Gently invert the tube to mix. Spin for 10 min at 21,130 x g in a table top centrifuge. Discard the supernatant and allow the pellet to air dry for approximately 5 min or until no liquid is visible in the tube and the DNA pellet becomes translucent.",
    "Resuspend the dry pellet in 50 µL of sterile, DNase-free, deionized water. Measure the DNA concentration.\n\tNOTE: Do not freeze bacmid DNA. Store at 4 °C for up to several days.\n3. Transfection of Sf9 Insect Cells with Bacmid to Produce P1 Baculovirus\nSeed 0.9 x 106 Sf9 cells/well in 2 mL of appropriate medium (see Table of Materials) in each well of a 6-well tissue culture plate. Incubate cells at 27 °C for 20 min to promote attachment to the plate.\n\tCAUTION: Cell cultures are a potential biohazard. Work in an approved laminar flow hood using aseptic techniques and check institutional and governmental guidelines for recommended protective clothing and proper disposal of waste prior to performing experiments.\nAfter attachment, add 8 µL of transfection reagent (see Table of Materials) to 100 µL of media for each well of the 6 well plate being transfected in a sterile tube. Add 6 μg of bacmid DNA to 100 µL of medium in a separate sterile tube. Incubate 5 min at RT. Combine the two solutions and incubate for 45 min at RT.\nReplace the medium in the 6 wells with 2 mL of fresh medium. Add the mixture from previous step to each well dropwise (200 µL per well). Gently rock the plate to ensure mixing of the transfection solution into the medium.\n\tNOTE: Do not swirl or shake the plate because this will cause cells to detach.\nIncubate cells for 5 d (120 h) in a 27 °C humidified incubator. Check GFP fluorescence before harvesting to verify that virus is being produced in a large percentage of cells; if the percentage is low, extend the incubation time as necessary (see Figure 1C).",
    "Collect the supernatant containing P1 virus (about 2 mL from each well). Filter the medium containing P1 virus into 2-mL tubes using a 3 mL syringe and small 0.2 µm filter. Add sterile fetal bovine serum (FBS) to a final concentration of 1%.\n\tNOTE: This stock of P1 virus should be stored at 4 °C and be protected from light.\n4. Infection of Sf9 Insect Cells with P1 Baculovirus to Produce P2 Baculovirus\nPrepare 200 mL (or desired volume) of Sf9 cells at a concentration of 0.8 - 0.9 x 106 cells/mL in appropriate medium (see Table of Materials) in a flat bottom Erlenmeyer culture flask of sufficient size.\n\tNOTE: For suspension culture, the volume used should not exceed 40% of the total capacity of the flask.\nAdd 1:2500 ratio (v/v) of P1 virus stock from 3.5 to the Sf9 cell suspension culture. Incubate for the time of optimal virus expression (usually 48 - 120 h depending on the protein construct) at 27 °C in an orbital shaker at 115 rpm.\n\tNOTE: The relative virus expression can be determined by viewing the GFP fluorescence of the virus in a sample of the culture.\nCentrifuge the cell suspension for 40 min at 11,520 x g and collect the supernatant containing P2 virus. Filter the supernatant using disposable 0.2 µm filters. Add FBS to a final concentration of 0.5%.\n\tNOTE: This stock of P2 virus should be stored at 4 °C and be protected from light.\nObtain a titer for the P2 virus using Sf9easy cells or a virus counter.\n5. Infection of HEK293 Mammalian Cells with P2 Baculovirus for Large-scale Protein Expression",
    "Prepare a desirable volume of HEK293 mammalian cell suspension culture (4 - 6 L is recommended for preparation of frozen grids) at a concentration of 3.5 - 3.8 x 106 cells/mL in the expression medium (see Table of Materials) supplemented with 1% (v/v) sterile FBS in baffled-bottom Erlenmeyer culture flasks of sufficient size.\n\tNOTE: For suspension culture, the volume used should not exceed 40% of the total volume of the flask.\nAdd 8% (v/v) of P2 virus stock solution from step 4.3 to the HEK293 cell suspension culture. Incubate at 37 °C in an orbital shaker at 135 rpm.\nAdd 10 mM sodium butyrate at 12 - 18 h post-infection. Incubate for the time of optimal protein expression (usually 36 - 72 h) at 30 °C.\nHarvest cells by centrifuging for 20 min at 2,880 x g. Wash cells by resuspending in approximately 100 mL tris-buffered saline (TBS) per liter of cells harvested. Centrifuge again for 20 min at 2,880 x g and collect the cell pellet.\n\tNOTE: The protocol may be paused here. Cell pellets can be snap-frozen in liquid nitrogen and stored at -80 °C until purification.\n\tCAUTION: Liquid nitrogen may cause cryogenic burns or injury. It may cause frostbite. It may displace oxygen and cause rapid suffocation. Wear cold insulating gloves and face shield.\nCollect small 1 mL harvests at varying time points and solubilize for 2 h at 4 °C with rocking or stirring in the presence of different detergents and/or additives. These small whole-cell solubilized samples can be clarified by ultracentrifugation at 235,000 × g for 10 min at 4 °C and run as a 30 μL sample on a size-exclusion chromatography (SEC) column (see Table of Materials) to determine the best time for expression and the best solubilization conditions.",
    "NOTE: In the case of hTRPC3, this screening included different buffers with pH values from 4.0 - 9.5 and salt concentrations of 50 - 500 mM; different ionic compositions (such as MgCl2 or NaCl); different detergents with critical micelle concentration (CMC) values of 0.1 - 20 mM; reducing additives such as dithiothreitol, tris(2-carboxyethyl)phosphine, and β-mercaptoethanol; and the calcium-chelating additive ethylenediaminetetraacetic acid (EDTA).\n6. Purification of hTRPC3 Protein from the Frozen Cell Pellet\nThaw the pellet in buffer containing 20 mM Tris (pH 8.0), 500 mM NaCl, 1 mM phenylmethylsulfonyl fluoride (PMSF), 0.8 μM aprotinin, 2 μg/mL leupeptin, 2 mM pepstatin A, and 1% digitonin, using 100 mL of buffer per liter of cells harvested. Once thawed, ensure homogeneity of the solution by pipetting or stirring. Allow to solubilize for 2 h at 4 °C in a beaker immersed in ice with a stir bar rotating.\nRemove cell debris by ultracentrifugation at 235,000 × g for 1 h at 4 °C. Verify protein quantity by running a 30 μL sample on an SEC column (see Table of Materials) by high performance liquid chromatography (HPLC) and visualize the target protein by the GFP signal output.\nIncubate the solubilized protein (supernatant) with cobalt affinity resin for 1 - 2 h at 4 °C. Verify protein binding to the resin by running a 30 μL sample on an SEC column.\n\tNOTE: If protein binding has occurred, the GFP tagged protein target will be retained on the column, not found in the flow-through. Therefore, no GFP signal will be present at the position corresponding to the target protein size when the flow-through is run on HPLC.",
    "Wash the resin with 10 column volumes of buffer (20 mM Tris, pH 8.0, 500 mM NaCl, 15 mM imidazole, and 0.1% digitonin). Check for protein loss by running a 30 μL sample on an SEC column.\n\tNOTE: If protein loss from the column has occurred, the GFP tagged protein target will be found in the wash buffer that has passed over the column. Therefore, GFP signal will be present at the position corresponding to the target protein size when the wash buffer is run on HPLC. If protein loss has occurred, the imidazole concentration of the wash buffer may need to be lowered to prevent disrupting His tag binding to the affinity column.\nElute the resin-bound hTRPC3 with buffer (20 mM Tris, pH 8.0, 500 mM NaCl, 250 mM imidazole, and 0.1% digitonin). Add thrombin at a 1:20 molar ratio (to cleave the GFP tag) and add 10 mM EDTA (an hTRPC3 stabilizing agent) to the eluted sample and incubate for 3 h at 4 °C. Check that protein has been eluted by running 90 μL of a sample diluted 1:100 on an SEC column and verifying the presence of a GFP signal at the position corresponding to the target protein size.\n\tNOTE: At this point, the tryptophan signal from total protein in the elution can also be viewed. Only the target affinity-purified protein will remain in the elution and the GFP and tryptophan signals will be near identical in profile. If the target protein is not seen in large quantity in the elution but was not lost in the flow-through or wash, the protein has likely remained bound to the column and can be eluted using a higher concentration of imidazole in the buffer.",
    "Concentrate the eluate to 500 μL or less in a 15 mL 100K centrifugal filter tube (see Table of Materials) by spinning at 2,880 x g at 4 °C in 5 min increments. Resuspend the protein by pipetting the solution up and down between spins to avoid overconcentrating.\n\tNOTE: Centrifuge time may be shortened as the volume approaches the desired final volume.\nLoad the concentrate onto an SEC column in buffer (20 mM Tris, pH 8.0, 500 mM NaCl, 1 mM EDTA, and 0.1% digitonin). Run .\nCombine peak fractions containing the intact TRPC3 tetramer, as visualized by UV absorbance signal, and concentrate again to a final concentration of at least 5 mg/mL.\n7. Screening of Protein by Negative-stain Electron Microscopy\nTurn on the glow-discharge machine. Set the program for discharging a carbon-coated grid using argon and oxygen for 30 s. Run the program to make the carbon-coating on copper 400-mesh grids hydrophilic prior to addition of the protein solution.\nSet up five 40 μL drops of sterile water and two 40 μL drops of 1% uranyl formate solution (on lab film, wax paper, or a similar surface, see Table of Materials). Take the grid from step 7.1 and add 2.5 μL of protein sample 5 mg/mL (50 - 200 μM) onto the dark side and let it sit for 1 min.\nAfter 1 min, dry the grid using filter paper. Do not touch the filter paper directly to the grid surface; instead, bring the paper to the edge of the liquid droplet and allow capillary action to pull the liquid from the grid into the filter paper.",
    "Dip the grid into first drop of water. Dry with filter paper and repeat with the remaining drops of water and the first drop of uranyl formate. Allow the second drop of uranyl formate sit for 1 min and then dry with filter paper. Allow the grid to fully air dry (about 1 min) before storing.\n\tNOTE: This staining protocol may not be ideal for all protein-detergent combinations. Different concentrations of uranyl formate stain and different lengths of time for stain exposure should be tested if the steps above do not provide a stain with good contrast.\nImage the grids on an electron microscope (see Table of Materials) to check the protein particle quality. Ensure that the micrographs show numerous particles that are homogenous in general appearance and distribution, display good contrast, and match the predicted size of the target protein.\nGenerate preliminary, low-resolution, two-dimensional (2D) classifications using 50 - 100 micrographs (see data processing – step 10) to check that the particles represent different views of a single consistent structure.\n\tNOTE: Micrographs and preliminary 2D classes of sufficient quality, as described above, are a strong indicator that the protocol has been sufficiently optimized for protein purification. Preparation and screening of cryo-EM grids is warranted at this point.\n8. EM Sample Preparation\nGlow-discharge a gold holey carbon grid (see Table of Materials) as described in step 7.1.\nApply 2.5 μL of the concentrated hTRPC3 protein sample (5 mg/mL) onto the grid. Blot the grid for 1.5 s using a blot force of 1 and a wait time of 5 s at 100% humidity and 4 °C, then plunge the grid into liquid ethane cooled by liquid nitrogen using a vitrification machine.",
    "NOTE: The humidity, temperature, blot-force, blot time, and wait time listed here were used for the authors’ hTRPC3 study19. They may need to be changed to produce optimal vitreous ice for other proteins and detergents.\nScreen frozen grids for optimal ice conditions using a cryo-EM microscope (see Table of Materials) and manually view regions of thick ice (grid squares that appear smaller and darker), thin ice (grid squares that appear larger and brighter), and medium ice.\n\tNOTE: Thicker ice often holds more particles, while thinner ice often yields better contrast and resolution. Use manual screening of images to determine which ice conditions results in a large number of monodispersed particles with good contrast and resolution. Once good conditions are verified, move to image collection on a 300 kV cryo-EM microscope.\n9. EM Data Collection\nUsing an automated acquisition program, record image stacks in super-resolution counting mode with a binned pixel size of 1.074 Å on an electron microscope operated at 300 kV with a nominal magnification of 130,000X direct electron detector.\nDose-fractionate every image to 40 frames with a total exposure time of 8 s, with 0.2 s per frame and a dose rate of 6.76 e− Å−2 s−1 (nominal defocus values varied from 1.0 to 2.5 μm in the authors’ experiment).\n10. EM Data Processing\nImplement motion correction of summed movie stacks22 and estimate defocus values23 using the data processing software (see Table of Materials)24.\nPick particles from the micrographs. Use these picked particles to construct an initial reference-free 2D classification using the software24. Select ideal 2D class averages to use as templates for automated particle picking for the entire data set.\nManually check the quality of the auto-picked particles and remove bad particles. Use multiple rounds of 2D classification to clean up picked particles.",
    "Generate an initial model25. Subject 2D picked particles to three-dimensional (3D) classification (about 5 classes) using C1 symmetry and an initial reconstruction low-pass filter of 60 Å as a reference model. Determine which classes have high-resolution features and combine particles within such a class.\nFurther refine particles using the local refinement with C4 symmetry (in the case of hTRPC3) applied and a high-resolution limit for particle alignment set to 4.5 Å26.\n11. Model Building\nBuild a model (see Table of Materials for the software used). For hTRPC3, use the transmembrane domain (TMD) of the transient receptor potential melastatin 4 (TRPM4) structure protein data bank (PDB) 5wp6 as a guide27. Use bulky residues and secondary structure prediction to guide de novo building.\nSubject the initial model to real space refinement with secondary structure restraints28. Manually examine the refined model and remodify as needed (see Table of Materials for the software used).\nApply Fourier shell correlation (FSC) curves to calculate the difference between the final model and the EM map for validation of the refined structure. Evaluate the geometries of the atomic models (see Table of Materials for the software used)29,30.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}