{
  "id": 2446,
  "origin_website": "Cell",
  "title": "Protocol for In Vivo Evaluation and Use of Destabilizing Domains in the Eye, Liver, and Beyond",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nAAV Intravitreal Injections in a Mouse Model—ecDHFR-DD-POI Expression in the Retina\nTiming: 10 days\nDue to its serotype flexibility, low immunogenicity, and previously demonstrated efficacy for treating disease(Pierce and Bennett, 2015[href=https://www.wicell.org#bib18]), we chose to use AAV as a means to introduce our DD-POIs into the eye as well as systemically in the liver.\nPrepare HBSS-T by adding Tween-80 to sterile HBSS until reaching a final concentration of 0.14%.\nAAV is stable for multiple freeze-thaw cycles and can be thawed at room temperature (20°C–23°C). Do not leave at room temperature longer than 4 h.\nDilute the virus with HBSS-T. The user will need 1–2 μL of virus per eye at a concentration of 3.5 × 1012 viral genomes/mL. We recommend preparing twice as much volume of virus as necessary when preparing for injections due to a high degree of error/dead volume associated with the injection syringe and the small volumes used.\nPrepare a Hamilton 2.5 μL syringe by removing the screw top and inserting a 33 ½ G needle with a 10°–12° bevel (Figure 1[href=https://www.wicell.org#fig1]A). Carefully replace the screw top back onto the syringe so the needle is firmly fixed in position.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/193-Fig1.jpg\nFigure 1. Demonstration of Syringe and Needle Setup for Intravitreal Injection\n(A) To begin to assemble the needle and syringe for intravitreal injection, remove the syringe screw top and insert the 33 ½ G needle, replace the screw top to secure the needle.\n(B–D) Next, carefully fit the 25 5/8G “shield” needle over the top of the 33 ½ G needle (B and C) and fasten it securely to the syringe with tape (D).",
    "Critical: The glass Hamilton syringe should be autoclaved before use. Do not autoclave the 33 ½ G needles as this will scorch or damage the needle. Refer to step 6 in sterilizing the intravitreal 33 ½ G needles.\nTo prevent the 33 ½ G needle from flexing or bending, thread it through a 25 5/8 G needle. This is referred to as the “shield needle”, (Figures 1[href=https://www.wicell.org#fig1]B and 1C) Tape the shield needle into place carefully (Figure 1[href=https://www.wicell.org#fig1]D).\nRinse out the full syringe volume (almost 3 μL) with HBSS-T 3–4 times. Then rinse out the 33 ½ G needle with 5% bleach 3–4 times with only enough volume to rinse out the needle itself. The syringe has been sterilized and the user should avoid introducing bleach into the barrel of the syringe. Rinse the needle with only enough volume to rinse out the needle itself with HBSS-T another 8–10 times. It is now ready to use.\nIf using multiple viruses or using HBSS-T vehicle control on one eye, label the needles accordingly. We recommend always using the virus syringe for virus only for all following injections and future experiments.\nAnesthetize the mouse with 96 mg/kg Ketamine and 12.8 mg/kg Xylazine of Ketamine (30 mg/mL) Xylazine (4 mg/mL) anesthetic cocktail and apply the initial dilator, cyclopentolate hydrochloride 1% [w/v], as soon as the mouse becomes immobile. If the dilator is applied too late, the ciliary muscles will no longer be able to react due to the anesthetic.\nAfter a minute, absorb excess dilator with an absorbent tissue or Kimwipe. Apply the secondary dilator, tropicamide 1% [w/v], and allow to sit for 1–2 min.\nRemove the excess dilator with a wipe and apply GenTeal eye gel to prevent corneal clouding.",
    "Once the mouse is fully anesthetized, use a triangle spear to comb back the whiskers and eyelashes using the GenTeal gel as the “glue.” Only do this for the eye you intend to inject at this moment.\nPlace the animal under the Zeiss stereo microscope with the target eye facing up. Focus the microscope and ensure no whiskers or eyelashes are in the way. In addition, confirm that the pupil is fully dilated.\nGently proptose the eye with two fingers of the user’s nondominant hand, avoiding putting too much pressure as this might suffocate the mouse.\nIn the microscope, look for the limbus of the eye. Once located, focus the microscope to fully visualize the surrounding blood vessels. Look for areas directly underneath the limbus without many blood vessels (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/193-Fig2.jpg\nFigure 2. Demonstration of Intravitreal Injection Procedure in Balb/c Mice\n(A) Ocular structures of a Balb/c eye under magnification from a Zeiss Stemi 305 Compact Greenough Stereo Microscope (Zeiss International, Oberkochen, Germany). The pupil, iris, limbus, and limbal blood vessels can be easily recognized. The injection site should be located below the limbus and avoiding any nearby blood vessels (white circle).\n(B) To make the initial puncture, approximately half of the tip of a 30G needle is inserted below the limbus and then removed.\n(C and D) The intravitreal 33 ½ G needle is inserted into the hole made in (B) until the bevel can be visualized through the pupil (shown in D). At this point, the intravitreal needle is at an ∼45 degree angle from the horizontal (D). Scale bars, ∼1 mm.",
    "Once the user finds an area with little to no blood vessels, use a 30G needle and gently puncture the area, making sure to only insert the tip of the bevel (Figure 2[href=https://www.wicell.org#fig2]B). If the puncture hole is too large, there will be backflow of the injected virus or leaking of the aqueous humor.\nCritical: Replace the 30G puncture needle after 2–3 eyes. It dulls easily and will make the puncture much more traumatic to the surrounding tissue if blunt.\nNote: Use your nondominant hand during this entire process to keep the eye gently proptosed.\nNote: If the user accidentally punctures a blood vessel, soak up the blood with a triangle spear and continue as planned. There will be less visibility and greater chance of the virus entering the bloodstream, but this should not hinder the rest of the injection process.\nPick up the Hamilton syringe and insert the needle at a 45° angle from the horizontal until the user is able to see the needle through the pupil (Figures 2[href=https://www.wicell.org#fig2]C and 2D). Be careful not to insert the needle too far, just until the user is able to see it through the pupil is enough.\nThe user should remove their nondominant hand from the mouse and gently push down the plunger of the Hamilton syringe over the course of 60 s.\nCritical: releasing the virus solution too quickly may disturb other ocular structures or cause backflow out of the eye.\nNote: If the user injected a small air bubble into the eye, this should not be an issue. It will dissipate over time.\nOnce the plunger is fully released, hold the Hamilton syringe in place for another 60 s so that all the virus may sink down undisturbed.\nCarefully remove the needle.",
    "Apply AK-POLY-BAC antibiotic ointment to the eye. On top of this, add GenTeal gel.\nProceed to inject the other eye using the same protocol.\nPut the mouse on a warm surface and note that the GenTeal will melt over time. Replace the gel every 15 min until the mouse wakes up to avoid corneal clouding.\nFull transduction and expression of the viral construct will take at least 10 days. Some groups recommend 21 days, but we have found that the signal of reporter proteins is stable after 10 days. If a self-complementary AAV (scAAV) is used, expression will plateau more quickly than conventional single-stranded DNA-based AAV. Nonetheless, in the absence of retinal degeneration, we have noticed sustained ocular expression for 6 months or longer.\nAAV Tail Vein Injections in a Mouse Model—Hepatic Expression of ecDHFR-DD-POIs\nTiming: 2 weeks",
    "The mouse liver is a large and easily accessible organ through a tail vein injection. Hepatocytes are robustly transduced by a number of serotypes including AAV2/2, AAV5/5, AAV8/8 and AAV10/10 (Pipe et al., 2019[href=https://www.wicell.org#bib19]). We have specifically utilized the AAV2/8 serotype developed for even and strong transduction at a lower titer than the conventionally used AAV8/8 serotype, making it much more translatable to human disease in which viral dose must be kept as low as possible (Cingolani et al., 2012[href=https://www.wicell.org#bib7]). In (Peng et al., 2019[href=https://www.wicell.org#bib17]; Ramadurgum et al., 2020[href=https://www.wicell.org#bib23]), we have utilized the liver as a control organ to mirror results observed in ocular tissue due to its accessibility through the tail vein. However, because hepatocytes are continually dividing, we recommend using the mice in 1–3 days after the 2 week incubation period. We have anecdotally noted a decrease in luminescent signal following imaging 3 weeks post-injection. Before starting, place the mouse cages on a warmer. This will increase the mouse’s blood flow and will make it easier to visualize the tail vein.\nAAV is stable for multiple freeze-thaw cycles and can be thawed at room temperature (20°C–23°C). Do not keep virus thawed longer than 4 h at room temperature (20°C–23°C).\nDilute the virus with HBSS. The user will need 200 μL of virus per mouse at a concentration of 2.5 × 1010 viral genomes/mL. We recommend preparing 300–400 μL extra, as any excess virus can be frozen again at −80°C.\nThe user has the option to restrain the mouse using equipment like a tail vein illuminator (Figure 3[href=https://www.wicell.org#fig3]A) or by anesthetizing with isoflurane. We have utilized a tail vein illuminator and restrainer in this protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/193-Fig3.jpg\nFigure 3. Setup and Procedure for Intravenous Injection of AAV in Balb/c Mice",
    "(A) Braintree Tail Vein Illuminator (Braintree Scientific, Braintree, MA, USA) has two distinct components, the restrainer and tail vein illuminator.\n(B) To prevent the mouse from turning, we recommend lining the restrainer tube with paper towel and taping it into place.\n(C) The mouse can be allowed to crawl into the restrainer and the gate at the front of the restrainer can be closed, allowing only the tail through the slot and onto the illuminator deck.\n(D) Once the tail has been warmed and the vein easily visualized, the vein can be injected with a 27 ½ G needle.\nIf using a restrainer, line the inside partly with paper towel (Figures 3[href=https://www.wicell.org#fig3]B and 3C). The mouse will not be able to move around as much.\nLoad a 27 ½ G syringe with 200 μL of diluted virus. Adjust the needle so the bevel faces up.\nCritical: Throughout these injections, use the same syringe. Otherwise, the user may risk losing virus when loading a new syringe with each injection. We do, however, recommend using a new needle with every mouse. Injection through the tail flesh very easily dulls the needle.\nNote: Many animal training facilities recommend the use of a 30G insulin needle for tail vein injections. While this needle is smaller and is able to enter the tail vein much more easily, it is also very flexible. This increased flexibility can make it difficult to properly insert the needle into the tail vein.\nHold a hand warmer or reusable heat pack against the mouse’s tail for 30–60 s. Wrap the warmer with a paper towel as mice have sensitive skin.\nOnce the tail vein can be clearly visualized, insert the needle and perform the injection. Inject slowly and steadily while holding the tail taut (Figure 3[href=https://www.wicell.org#fig3]D).",
    "The virus will take 14 days to fully transduce the liver and express. We recommend utilizing the mice within 1–3 days of this 2 week mark as hepatocytes are turned over continuously and cells expressing the AAV will divide and eventually dilute AAV-based expression.\nIn Vivo Bioluminescence Imaging\nTiming: 2 days\nThe two primary ways to determine in vivo stabilization in real time in live mice are via fluorescence or luminescence. We have successfully used each of these techniques in the mouse eye. While initially we chose fluorescence (via an ecDHFR-DD-YFP 2A mCherry AAV), we have more recently transitioned to bioluminescence (via an ecDHFR-DD-firefly luciferase 2A Nano luciferase AAV) because it avoids the use of extremely bright, potentially phototoxic light administered directly to the eye. Here we describe the visualization of bioluminescence signal from firefly luciferase in mouse ocular or hepatic tissue using the IVIS Spectrum (Perkin Elmer, Waltham, MA, USA). We recommend receiving training on using the IVIS Spectrum as well as its accompanying isoflurane anesthesia machine.\nPrior to using a small molecule stabilizer, basal levels of the ecDHFR-DD-POI should be evaluated by in vivo imaging, if possible, but also through alternative or orthogonal means such as western blotting or immunofluorescence. Examples of data obtained by these means can be found later in this protocol.\nAt least 10 days post intravitreal injection or 2 weeks post tail vein injection, the mice exhibit stable signal from the AAV encoding for the ecDHFR-DD firefly luciferase fusion protein. Because retinal cells are nondividing, the signal should theoretically never decrease over the lifetime of an intravitreally injected mouse. Transduced hepatocytes will, however, continue to divide and the titer will decrease in daughter cells over time. Therefore, in the 1–3 days post 2 weeks after the tail injection, the mice must be imaged.",
    "Dissolve 40 mg of D-luciferin in 1.0 mL of 0.9% saline buffered solution. A 25 g mouse will receive an 80 μL dose (3.2 mg per 25 g mouse or 128 mg/kg).\nCritical: Keep the D-luciferin solution protected from light and store in 4°C. If the color changes, discard and make fresh luciferin solution.\nCritical: Do not store dissolved luciferin longer than 1 week.\nLoad 80 μL into insulin needles for i.p. injection. If the user has a different syringe/needle combination they feel more comfortable using, that is fine. Load one syringe per mouse.\nNote: We recommend pre-loading one syringe per mouse due to timing issues. All mice must be injected with luciferin within a few seconds of each other. This also reduces differences in dosage from inaccurate dispensing.\nEnsure the oxygen tank connected to the IVIS contains enough oxygen to image. In addition, check the level of isoflurane.\nInitialize the IVIS Spectrum, this will take around 30 s.\nPlace a clean, non-reflective black mat on the base of the IVIS imaging station.\nCritical: While the imaging stage is already matte black, we recommend the use of an additional mat due to the warmth generated by the stage. The mice will overheat or incur burns if left on the bare stage.\nAnesthetize the mice with isoflurane at a flow rate of 2.0%–2.5%. Make sure the oxygen flowrate is 1.0–1.8 L/min and the vacuum pump is turned off. This will allow isoflurane to properly accumulate in the anesthesia chamber and prevent the mouse from waking up while being placed in the imager.\nAfter a few minutes of exposure to isoflurane, turn on the flow to the IVIS stage under the same settings. Insert the nosecones into the IVIS nosecone ports and wait a minute for flow to regulate.",
    "Place mice in numerical order on their stomach on the IVIS stages. Apply GenTeal gel to their eyes to prevent drying out.\nRemove the first mouse and inject i.p. with the premeasured luciferin solution. Place the mouse back in its respective nosecone on either its side (if looking for ocular signal) or on its back (if looking for hepatic signal). If measuring ocular signal, the eye containing the reporter should face up. If both eyes contain the reporter, the user has the option of placing the mouse on its stomach or imaging one eye at a time.\nOnce all mice are injected with luciferin, place a non-reflective black strip over the ear tags. If the mice do not have ear tags, this may be skipped.\nCritical: Ear tags are reflective and therefore need to be covered. Any reflectivity in the chamber will affect the resulting measured signals.\nNote: If a whole-body image of the mouse is desired, the user may leave off the black strip for the first minute of imaging and pause imaging. Once paused, the black strip may be replaced over the ear tags and imaging can be resumed.\nIn the IVIS menu, set calibration to bioluminescence for mice with measurements taken every minute over the course of 20 min.\nAfter imaging, the mice can be placed back into their respective cages. They should awaken within 30 second to 1 min.\nIn the LivingImage software, set the units to radiance. Example images obtained before and after TMP administration are shown in Figures 4[href=https://www.wicell.org#fig4]A–4C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/193-Fig4.jpg\nFigure 4. Example Ocular and Hepatic Imaging of Wild-Type Balb/c Mice Demonstrating an Increase in Signal Post-treatment with TMP\n(A) Balb/c intravitreally injected with AAV2/2 Nluc 2A ecDHFR-Fluc show bioluminescent signal in ocular tissue after stabilization with TMP (6 h, 40 mg/kg, gavage).",
    "(B) Balb/c intravenously injected through the tail vein with AAV2/8 Nano luciferase 2A ecDHFR-firefly luciferase show efficient transduction of hepatocytes, which a high level of signal post TMP addition (6 h, 40 mg/kg, gavage).\n(C) A wild-type agouti mouse subretinally injected with AAV2/2 Nluc 2A ecDHFR-firefly luciferase displays more scattered signal due to injection method. All images and measurements were acquired on the IVIS Spectrum (PerkinElmer Inc., Waltham, MA). Scale bars, ∼15.7 mm.\nOpening up the minute 1 image, there may be signal around the eyes. The software has automatically determined the minimum and maximum signal based on the background signal and has assigned colors to specific radiance or flux values. These may be adjusted if “Individual” is selected. Adjusting the minimum or maximum will not change the absolute bioluminescent signal value, but rather alters the presentation of the signal.\nIn the region of interest (ROI) Menu, select “Apply to All” and create a circular or rectangular ROI. Drag and reshape circular ROIs over the first mouse’s eye (Figure 5[href=https://www.wicell.org#fig5]A). Make sure the ROI is slightly larger than the eye and surrounding bioluminescent signal. Select “Measure” in the ROI menu. The software will pull up all bioluminescent flux values over the course of 20 min (listed as total flux). Copy-paste this into a designated Excel sheet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/193-Fig5.jpg\nFigure 5. Region of Interest (ROI) Is Specified in the IVIS Spectrum Imaging Software to Measure Total Bioluminescent Signal, or Flux, from a Particular Area\n(A) Ocularly transduced Balb/c mice have equally sized ROI rings drawn over their eye. Eye size is consistent from mouse to mouse, regardless of age and size, and so ROI rings must remain the same for ocular imaging.",
    "(B) Hepatically transduced Balb/c mice have rectangular ROI’s drawn over their upper abdominal area where the liver is located. The size and shape of this area can vary greatly from mouse to mouse. ROI size must be adjusted for each mouse when imaging larger organs such as the liver. Scale bars, ∼15.7 mm.\nIf performing ocular imaging, drag the exact same ROI over each mouse and retrieve each one’s total flux values over the 20 min. If imaging the liver, draw a new rectangular ROI for each mouse since the sizes of each mouse may vary (Figure 5[href=https://www.wicell.org#fig5]B).\nNote: Be careful that no ROI boxes overlap as signal may be double-counted in this situation.\nOnce all values are in the designated Excel sheet, graph the “total flux” column over 20 min. The resulting scatterplot should be a curve (Figures 6[href=https://www.wicell.org#fig6]A–6C). If it is not a curve, this could be indicative that the i.p. injection of luciferin failed or the detected signal was too low to form a curve (Figures 6[href=https://www.wicell.org#fig6]D and 6E). Refer to Troubleshooting[href=https://www.wicell.org#troubleshooting] if curves seen in Figures 6[href=https://www.wicell.org#fig6]D and 6E are observed.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/193-Fig6.jpg\nFigure 6. Evaluation of Acceptable and Unacceptable Flux Readouts",
    "(A–C) Examples of acceptable flux curves. Post luciferin injection, the resulting flux values were graphed over the 20 min imaging period. This kinetics curve is important in determining the strength and consistency of signal. (A) An example of an ideal curve that follows a parabolic path and peaks somewhere between 10-15 min. There are no outliers or inconsistencies. This curve is indicative of strong signal and a successful i.p. injection of luciferin. (B) Example of an acceptable, but non-ideal curve. The values follow a general parabolic trend and the peak is still somewhat midrange. Such a peak can be a result of poor signal or a low luciferin dose due to poor injection technique. (C) An example of another acceptable, but again, non-ideal curve. Certain injections, such as subretinal, can result in low signal and consistently produce such curves. However, if a mouse which normally produces an ideal curve displays these inconsistent increases and decreases in flux, assume a failed i.p. injection of luciferin.\n(D and E) Unacceptable signal curves that have an inconsistent shape and signal variation. l. (D and E) we can note a “peak” but this signal is not in line with the rest of the curve and therefore cannot be used. This is most likely due to low overall signal from the mouse, indicating poor transduction or a failed i.p. injection of luciferin. Images and measurements were acquired on the IVIS Spectrum (PerkinElmer Inc., Waltham, MA).\nSelect the peak of the curve, the highest flux value will be used to represent the bioluminescent signal from this mouse.\nIf the mouse is untreated, this bioluminescent value is indicative of its baseline abundance of ecDHFR-DD-firefly luciferase fusion protein.\nNote: There should be a small, albeit detectable amount of basal bioluminescent signal, even in the absence of stabilizer.",
    "On the following day, treat each mouse with 40 mg/kg of trimethoprim (TMP, see below for recommended administration regimen). 6 h post treatment, image the bioluminescent signal once again and calculate the peak flux signal from each mouse.\nThe fold-change difference between these two days for each mouse should be calculated. This value should be fairly consistent (although the raw flux values will not be).\nCritical: The frequency of animal imaging in the IVIS Spectrum is limited by the time period for full excretion of the small molecule stabilizer and luciferin. We have previously noted that signal from TMP administered through oral gavage (3 mg) does not return to baseline until 9 days after (Datta et al., 2018[href=https://www.wicell.org#bib10]). By using a smaller dose (1 mg) or alternative administration regimen, the TMP washout time period post gavage can be reduced to a couple of days or even overnight. While other stabilizers may not have the same tissue penetrance and retention as TMP, we recommend further research into the specific pharmacokinetics new compounds. Regarding luciferin, we have noted that this substrate appears to be metabolized or excreted 24 h post administration. Therefore, mice cannot be re-administered with luciferin multiple times within a day to gauge real-time kinetics. Bearing all of these factors in mind, in addition to the welfare of the mouse, we do not recommend imaging mice more than 4 times a week, as repeated isoflurane doses in a short frame of time can be toxic.",
    "Note: If the user wishes to test multiple different stabilizers in a set of mice, we recommend using fully grown adult mice whose size and weight will not change significantly during this experimental period and who can endure multiple rounds of anesthesia. Changes in weight may affect distribution and absorption of small molecules as lipophilic compounds may be retained within fat pockets. In addition, metabolic changes associated with aging may affect the readings. Typically we wait at least 1 week between administrations of different stabilizers to ensure their metabolism and excretion. Before addition of the next stabilizer, we also confirm that baseline signal in the mouse has returned back to normal levels observed prior to stabilizer.\nOral Gavage Preparation and Administration of Small Molecules for In Vivo ecDHFR-DD-POI Stabilization\nTiming: 1 day",
    "Administration of small molecule stabilizers can be achieved through multiple different regimens. Previously, we demonstrated that oral gavage (1 – 3 mg, 40–120 mg/kg assuming a 25 g mouse), drinking water (0.4 mg/mL [a saturated amount], equivalent to ∼100 mg/kg based on imbibing ∼6.25 mL/night and a 25 g mouse), or eye drops (∼120 μL of a 1 mg/mL solution) could be used to successfully control ecDHFR-DD-POI abundance in the eye (Datta et al., 2018[href=https://www.wicell.org#bib10]; Peng et al., 2019[href=https://www.wicell.org#bib17]). The different routes of administration resulted in different “On/Off” kinetics of controlling the ecDHFR-DD-POI. See (Datta et al., 2018[href=https://www.wicell.org#bib10]) for more information on regimen-dependent kinetics. Gavage allows the user to better define the timing of administration of the stabilizer within a short period of time. Drinking water is a convenient medium for stabilizer administration, but requires that the compound be water soluble and requires large amounts of compounds. Additionally, since mice drink throughout the night, the temporal onset of stabilization via drinking water is likely broad and not well-defined like gavage administration is. Polytrim (polymyxin/TMP sulfate) eye drops are also a convenient way to stabilize a ecDHFR-DD-POI in the eye and possibly topically, but is an approach that does not allow for accurate control of the amount of stabilizer that can reach a tissue (due to run-off, unknown routes of absorption, etc). The final route by which a researcher chooses to administer the stabilizer will have to take these differences into account when deciding appropriate regimens.",
    "While TMP is a cheap and effective stabilizer that has good tissue penetration across a range of tissues (Iwamoto et al., 2010[href=https://www.wicell.org#bib11]; Quintino et al., 2013[href=https://www.wicell.org#bib20]; Quintino et al., 2018[href=https://www.wicell.org#bib21]; Sellmyer et al., 2017a[href=https://www.wicell.org#bib27]; Sellmyer et al., 2017b[href=https://www.wicell.org#bib28]; Tai et al., 2012[href=https://www.wicell.org#bib29]), other stabilizers such as pralatrexate are rather expensive, and/or have limited solubility. For these reasons, we prefer to administer stabilizers other than TMP via gavage. As mentioned above, this also allows for better control of timing of administration.\nBelow, we describe the preparation of the oral gavage solution containing small molecule compound for administration in mice. We recommend the use of a bath sonicator to assist with drug solubilization.\nDissolve 1 mg of small molecule compound in 20 μL of DMSO. Vortex until dissolved. Warm in a 37°C water bath, if necessary.\nNote: Allowing the 1 mg of compound to sit at room temperature in DMSO (20°C–23°C) for 5–10 min can improve solubility.\nAdd 40 μL of PEG-400 and vortex. It is not uncommon for the compound to precipitate, still proceed if this occurs.\nAdd 4 μL of Tween-80 and vortex.\nAdd 20 μL of cremophor EL and vortex.\nAdd 116 μL of dextrose 5% in water (D5W) and vortex. This can be made by dissolving dextrose to achieve a 5% concentration in water (5 g in 100 mL of water).\nIncubate the solution in a bath sonicator for 10–15 min at 37°C. The compound should be fully dissolved at this point.\nNote: If the compound does not dissolve when following these steps, warm the solution between every step in a 37°C bath. If necessary, the user may bath sonicate the solution for 2 min between each step as well.",
    "Pause Point: The gavage solution can be used immediately or stored at −20°C for up to 1 week. If frozen, thaw for 10 min in a 37°C water bath and vortex before use.\nWhen ready to treat the specified mice, preload the gavage syringe with attached gavage needle.\nScruff the specified mouse around the ears (instead of around the shoulder area) so that the head and neck is immobile. Because the grip must be fairly strong, we recommend the use of latex gloves as this will give the user better hold of the mouse.\nHolding the mouse sideways, insert the ball-tip of the gavage needle into the mouth. Gently push the mouse’s head back (so it is facing towards the ceiling) and angling the syringe so it is parallel to the mouse (pointing straight down into the esophagus).\nAt this point, the user should loosen their grip on the gavage needle and allow it to gently fall down the esophagus. The mouse may gag or bite on the needle, but do not force the needle down in any way. Gavage needles have a ball-point at the end to prevent entrance into the lungs, but are still able to do so with a little force.\nNote: If the needle encounters resistance or otherwise stops, it is most likely it has hit a ridge. Lift the needle 0.5–1 cm out of the mouse, angle it towards the front of the mouse and let it drop once again. This may need to be done several times before sucessfully inserting the gavage needle.\nOnce almost the entire needle is inside the mouse, slowly dispense the 200 μL.",
    "Slowly remove the needle from the mouse to avoid damaging of any internal structures. We recommend observing the mouse for a minute and listening to its breath. If correctly gavaged, breathing should be silent as usual. If solution has entered the lungs, the breath will sound “wet.”\nImage mice as described in “In Vivo Bioluminescence Imaging” section.\nNote: We have imaged as early as 6 h post gavage, but it is possible that an increase in signal could be observed even earlier. This will have to be determined empirically by the user."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Protein Biochemistry",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}