{
  "id": 15305,
  "origin_website": "Jove",
  "title": "Generation of Native Chromatin Immunoprecipitation Sequencing Libraries for Nucleosome Density Analysis",
  "procedures": [
    "NOTE: The minimum input for this protocol is 10,000 cells per single immuno-precipitation (IP) reaction. Print out the supplied experimental worksheet and utilize as a guideline to plan out the experiment. Incubations at room temperature are assumed to be at ~22 °C. All of the buffer recipes are provided in Table 1. All of the buffers should be stored at 4 °C and kept on ice during the procedure, unless stated otherwise.\n1. Cell Preparation\nCultured cells\nWash the cells with 1 mL of phosphate buffer saline (PBS) and accurately determine the cell concentration using a hemocytometer. If there are more than one million cells, increase the volume of PBS.\nBased on the cell count, aliquot an equivalent of 70,000-100,000 cells into a sterile 1.5 mL tube, and spin down at 500 x g for 6 min at 4 °C. Using a pipette, slowly remove and discard the supernatant (without disturbing the cell pellet) and resuspend the pellet in ice-cold lysis buffer + 1x protease inhibitor cocktail (PIC) to a concentration of 1,000 cells/µL. Mix well by pipetting up and down 20-30 times. It is critical that cell clumps are disrupted. Try not to create bubbles.\nProceed directly to Day 1 (Section 2) of the ndChIP-seq protocol or flash freeze the cell pellet in liquid nitrogen and store at -80 °C.\nSorted cells\nCollect 70,000-100,000 sorted16 cells into a 1.5 mL tube with 350 µL of Hank's buffered salt solution (HBSS), or PBS + 2% fetal bovine serum (FBS).",
    "Spin down each cell aliquot at 500 x g for 6 min at 4 °C. Using a pipette, slowly remove the supernatant (without disturbing the cell pellet) and resuspend in ice-cold lysis buffer + 1x PIC to a final concentration of 1,000 cells/µL. Mix well in lysis buffer by pipetting up and down 20-30 times. Ensure that the cell clumps are disrupted. Try not to create bubbles.\nProceed directly to Day 1 (Section 2) of the ndChIP-seq protocol, or flash freeze the cell pellet in liquid nitrogen and store at -80 °C.\n2. DAY 1: ndChIP-seq\nPreparation of the antibody-bead complex\nPrepare a 37 °C water bath and an ice bucket. Working on ice, prepare 1x IP buffer/1x PIC and 1x antibody (Ab) dilution buffer, and keep them on ice. Retrieve Protein A (or G) magnetic beads (see Discussion for selection criteria) from the 4 °C storage, and mix very well by gentle pulse-vortexing. Keep it on ice.\n\t\tNOTE: Pulse-vortexing means vortexing is stopped every time a full vortex is formed in the tube.\nTransfer 24 µL of Protein A (or G) magnetic beads per IP reaction into a new 2 mL tube. Record the volume of beads and keep the tube on ice. For example, for 7 IPs, use 24 µL x 7 = 168 µL.\nPlace the tube on the tube magnet and wait for the solution to become clear indicating bead separation. Without disturbing the beads, carefully remove the supernatant using a pipette and discard. Take the tube off the tube magnet and place it on ice.\nAdd an equal volume (i.e., initial volume of beads) of ice-cold IP buffer + 1x PIC mix. Mix by pipetting up and down. Do not vortex.",
    "Place the IP buffer+ 1x PIC + beads back onto the tube magnet and wait for the solution to become clear indicating bead separation. Without disturbing the beads, carefully remove the supernatant using a pipette and discard. Repeat cold IP buffer + 1X PIC wash two more times for a total of 3 washes.\nAfter the final wash, resuspend the beads in an equal volume (i.e., initial volume of beads) of ice-cold IP buffer + 1x PIC mix. Mix by pipetting up and down. Do not vortex. Keep the tube on ice.\nOn ice, pour 10 mL of IP buffer + PIC into a 25 mL V-shaped reservoir. Using a multichannel pipette, add 130 µL of ice-cold IP buffer + 1x PIC mix into individual wells of a clean V-bottom 96-well plate. Fill one well per IP. Label the plate as \"Ab-bead complex\".\nAdd 12 µL of the washed Protein A (or G) magnetic beads into each well containing IP buffer + PIC, and mix by pipetting up and down. Keep the remaining washed beads on ice.\nObtain validated antibodies from their cold storage and thaw on ice, if required. Working on ice, dilute the antibodies with 1x Ab dilution buffer to the concentrations shown in Table 2.\nTo each well of the Ab-bead complex plate, add 1 µL of the appropriate, diluted antibody (Table 1). Record the well to the antibody key. Using multichannel pipette, mix each row by pipetting up and down 20 times. Change tips between rows. Seal the Ab-bead complex plate very well with an aluminum plate cover and incubate at 4 °C on a rotating platform for at least 2 h.\n\t\tNOTE: This incubation can proceed until ready to start step 2.4.\nCell lysis and chromatin digestion",
    "Working on ice, prepare 1x lysis buffer + 1x PIC and 1 mL of MNase I dilution buffer (Table 3) and keep them on ice .\nRetrieve the cell pellets from their -80 °C storage (or from ice, if freshly prepared). Thaw each cell pellet in a 37 °C water bath for a 10 s, then transfer to ice.\nTo each cell pellet immediately add ice-cold 1x lysis buffer + 1x PIC to a final concentration of 10,000 cells/20 µL, and mix 10 times by pipetting up and down, without creating bubbles. For example, for 70,000 cells the final volume is 140 µL.\nWorking on ice, aliquot 20 µL/well of the resulting lysates into a 96-well plate. Cover the plate with a plastic seal and incubate on ice for 20 min. Label the plate \"MNase digestion\" and record the wells to a template key. In order to assure an exact timing of the chromatin digestion reaction, do not proceed to the digestion with more than 2 rows of samples at a time.\nJust before the 20 min lysis is complete, dilute the MNase I enzyme with MNase I dilution buffer, to a final concentration of 20 U/µL, and keep it on ice.\nWorking on ice, prepare the MNase I digestion master mix according to Table 4 and aliquot 20 µL of the mix per each row of samples plus 5 µL dead volume into one row of a 96-well reservoir plate and keep it on ice. For two rows, the volume should be: (20 µL x 2) + 5 µL = 45 µL.",
    "After the lysates finish incubating, remove the MNase digestion plate from ice. Using a multichannel pipette, add 20 µL of MNase I digestion master mix into each row of samples, and mix 10 times by pipetting up and down. Change tips between rows. Incubate at room temperature for exactly 5 min.\nAfter 5 min, to stop the reaction, use a multichannel pipette to add 6 µL of 250 µM ethylenediaminetetraacetic acid (EDTA) into each row of samples and mix up and down a few times. Change tips between rows. After EDTA addition, switch the setting of the pipette to 20 µL and mix 10 times by pipetting up and down to assure a complete stop of the digestion reaction. Change tips between rows.\nUsing a multichannel pipette, to each row of the MNase digested samples, add 6 µL of 10x lysis buffer and mix well by pipetting up and down 10 times. Cover with a plastic seal and incubate on ice for 15 min.\nInput separation and pre-clearing\nFollowing the 15 min incubation, working on ice, pool all wells for the same cell pellet/template into one sterile, pre-chilled on ice, 1.5 mL tube (pre-labeled with the template ID) and mix thoroughly but slowly using a pipette to avoid detergent foaming.\nFor each cell pellet/template, transfer 8 µL of the digested chromatin into a new sterile, 0.5 mL tube (pre-labeled with the template ID), and store at 4 °C overnight. This will serve as the input control.\nDistribute the remaining volume of the digested chromatin in 48 µL aliquots, into a new 96-well plate. Cell pellet/template 1 goes into wells A01-A06, cell pellet/template 2 goes into wells A07-A12, etc. Record the wells to a template key. Label the plate \"Pre-clearing\".",
    "Using a multichannel pipette, add 120 µL of 1x IP Buffer + 1x PIC and 12 µL of washed Protein A (or G) magnetic beads into each well of the Pre-clearing plate from step 2.3.3. Mix each row by pipetting up and down 10 times. Change tips between rows. Seal the plate very well with an aluminum plate cover and incubate on a rotating platform at 4 °C for a minimum of 2 h.\nImmunoprecipitation reaction\nBefore starting this step make sure that the Ab-bead complex plate (step 2.1.10) and the Pre-clearing plate (step 2.3.4) have incubated for at least 2 h. Quick spin both plates by centrifuging for 10 s at 200 x g.\nPlace the Ab-bead complex plate (from step 2.1.10) on a plate magnet and wait 15 s for the solution to become clear. Carefully remove and discard the supernatant using a pipette without disturbing the beads. Remove the plate from the plate magnet and keep it on ice.\nPlace the Pre-clearing reaction plate (from step 2.3.4) on a plate magnet and wait 15 s for the beads to separate and for the solution to become clear. Without disturbing the beads, carefully transfer the supernatant using a pipette to the corresponding wells of the Ab-bead complex plate kept on ice and mix gently 15 times by pipetting up and down. Seal the plate well with an aluminum plate cover and incubate overnight (12-18 h) at 4 °C on a rotating platform. Re-label the plate \"IP reaction\".\n3. DAY 2: ndCHIP-seq\nWashes and elution\nSet the heating mixer to 65 °C. On ice, prepare a low-salt wash buffer and high-salt wash buffer. Quick spin the IP reaction plate from step 2.4.3 for 10 s at 200 x g.",
    "Place the IP reaction plate on a plate magnet and wait 15 s for the solution to become clear. Using a multichannel pipette, without disturbing the beads, carefully remove and discard the supernatant. Take the plate off the plate magnet and place it on ice.\nTo each row of samples in the IP reaction plate, add 150 µL of ice-cold low-salt wash buffer and mix slowly 10 times up and down to fully resuspend the beads.\nPlace the IP reaction plate back onto the plate magnet, wait for the beads to separate, and using a multichannel pipette, without disturbing the beads remove and discard the supernatant. Place the plate back on ice and repeat steps 3.1.3 and 3.1.4 for a total of 2 washes.\nOn ice, to each row of samples in the IP reaction plate, add 150 µL of the high salt wash buffer and mix slowly 10 times by pipetting up and down to fully resuspend the beads.\nPlace the IP reaction plate back onto the plate magnet, wait for the beads to separate, and using a multichannel pipette, without disturbing the beads remove and discard the supernatant. Place the IP reaction plate on ice and pre-chill a new 96-well plate beside it.\nTo each row of samples in the IP reaction plate, add 150 µL of the high salt wash buffer and mix slowly 10 times by pipetting up and down to fully resuspend the beads. After resuspension, transfer each row of samples to the corresponding row of the new, pre-chilled, 96-well plate. Label the plate \"IP reaction\". Discard the old plate.",
    "Place the new IP reaction plate on the plate magnet and wait for the beads to separate. Using a multichannel pipette, without disturbing the beads, carefully remove and discard the supernatant. Keep the plate at room temperature.\nTo each row of samples in the IP reaction plate, add 30 µL of the ChIP elution buffer (EB) and mix slowly 10 times by pipetting up and down. Make sure to prevent bubble formation.\nSeal the plate well with a PCR cover and incubate in a heating mixer at 65 °C for 1.5 h with a mixing speed of 1,350 rpm.\nAfter 1.5 h incubation, spin down the IP reaction plate at 200 x g for 1 min at 4 °C. Change the setting of the heating mixer to 50 °C.\nAfter the spin, place the IP reaction plate on a plate magnet and wait for the solution to clear. Using a multichannel pipette, without disturbing the beads, carefully transfer 30 µL of the supernatant into a new 96-well plate. Use fresh tips for each row. Label the plate \"IP reaction\" and keep it at room temperature.\nProtein digestion\nRetrieve 30% PEG/1 M NaCl magnetic bead17 (buffer composition table) solution from the 4 °C refrigerator and keep it at room temperature for at least 30 min. Critical: Ensure that the bead solution fully reaches room temperature before proceeding.\nRetrieve input control samples from 4 °C storage (step 2.3.2) and quick spin. Measure the volume using a pipette and add ultrapure water to each input control for a final volume of 30 µL. Transfer the input control samples to the pre-selected input wells (empty wells) in the IP reaction plate (step 3.1.12). Record the well to the sample key.",
    "On ice, prepare the Protein Digestion Master Mix as shown in Table 5 and aliquot equal volume into one row of a 96-well reservoir plate.\nUsing a multichannel pipette, to each row of samples in the IP reaction plate, add 40 µL of the Protein Digestion Master Mix and mix slowly 10 times up and down. Seal the plate well with a PCR cover, spin down at 200 x g for 1 min, and incubate in a heating mixer at 50 °C for 30 min set at 650 rpm. While the plate is incubating, prepare fresh 70% ethanol (EtOH) and keep it at room temperature.\nAfter the 30 min incubation is complete, spin the IP reaction plate at 200 x g for 1 min, 4 °C. Keep the plate at room temperature.\n\t\tNOTE: The total volume should be now ~70 µL/well.\nBead clean-up using 30% PEG/1 M NaCl magnetic bead solution\nAliquot the room temperature 30% of PEG/1 M NaCl magnetic bead solution into one row of a clean 96-well reservoir plate (75 µL per sample x # of rows).\nWorking at room temperature, using a multichannel pipette, add 70 µL (1:1 ratio) of the 30% PEG/1 M NaCl magnetic bead solution to each row of samples in the IP reaction plate and mix 10 times by pipetting up and down. Change tips between rows. Incubate the plate for 15 min at room temperature.\nPlace the plate on the plate magnet and incubate for 5 min to allow the beads to separate.\nUsing a pipette, without disturbing the beads, carefully remove and discard the supernatant. Keep the beads.",
    "While the IP reaction plate is still on the plate magnet, using a multichannel pipette, to each row of samples, add 150 µL of room temperature 70% EtOH and incubate for 30 s. After 30 s, using a multichannel pipette, remove and discard the supernatant. Repeat this step one more time for a total of 2 washes.\nAfter the second EtOH wash, incubate the 'dry' plate on the plate magnet for 3 min. Visually inspect the plate to make sure that all the EtOH is evaporated. If not, incubate the plate for 1 min. Over-drying the beads results in a lower yield.\nTake the plate off the plate magnet and using a multichannel pipette, add 35 µL EB (Table of Materials). Mix well by pipetting 10 times up and down. Change tips between rows. Incubate at room temperature for 3 min to elute.\nAfter incubation, place the IP reaction plate back onto the plate magnet and incubate for 2 min. The beads should separate and the solution will become clear.\nUsing a multichannel pipette, without disturbing the beads, carefully transfer the supernatant into the corresponding wells of a new 96-well plate.\nSeal the plate with an aluminum plate cover, label \"IPed + Input DNA\", and store at 4 °C overnight, or at -20 °C for long term (>48 h) storage.\n4. DAY 3: Library Construction\nEnd repair and phosphorylation\nThe input for the End Repair/Phosphorylation reaction is the IPed + Input plate from step 3.3.10. After thawing, spin the plate down at 200 x g for 1 min at 4 °C and keep it on ice.\nRetrieve from -20 °C freezer all of the reagents (except enzymes) required for the End Repair/Phosphorylation reaction (Table 6) and thaw them at room temperature, then immediately transfer to ice.",
    "Working on ice, follow Table 6 to set up the End Repair/Phosphorylation Master Mix in a sterile, 1.5 mL microcentrifuge tube. After the addition of all of the non-enzyme components, mix well by pulse-vortexing and place the tube back on ice.\nRetrieve the relevant enzymes from their cold storage and transport to the bench in a chilled tube cool rack. Mix each enzyme by flicking the tube, quick spin, and place it back in the chilled tube cool rack. When pipetting the enzyme, aspirate slowly to assure an accurate volume transfer. After the addition, wash the tip in the master mix by pipetting up and down.\nOnce the enzymes are added, gently pulse-vortex the master mix 5 times to assure an even distribution of all the components, then quick spin and immediately place the tube back on ice.\nOn ice, aliquot an appropriate volume of the End Repair/Phosphorylation Master Mix into one row of a new 96-well reservoir plate; volume to be aliquoted: (15 µL x # of rows) + 5 µL dead volume. An example calculation for two rows: (15 µL x 2) + 5 µL = 35 µL/well.\nUsing a multichannel pipette, add 15 µL of the End Repair/Phosphorylation Master Mix to each row of samples and mix 10 times by pipetting up and down. Change tips between rows. Seal the plate with a plastic cover, spin down at 200 x g for 1 min at 4 °C, and incubate at room temperature for 30 min.\nBead clean-up after end repair and phosphorylation\nFrom the 4 °C refrigerator, retrieve the 20% PEG/1 M NaCl magnetic bead solution and 30% PEG/1 M NaCl solution and incubate at room temperature for at least 30 min.\n\t\tNOTE: The 30% PEG/1 M NaCl solution DOES NOT contain magnetic beads.",
    "After both solutions reach room temperature, for each sample prepare 80 µL of 1:2 mix of 30% PEG/1 M NaCl and 20% PEG/1 M NaCl magnetic bead solutions. An example for 24 samples: 80 µL x 24 = 1,920 µL (640 µL of 30% PEG/1 M NaCl and 1,288 µL of 20% PEG/1 M NaCl magnetic bead solutions).\nAliquot the bead solution mix, equal volume, into one row of a 96-well reservoir plate and keep it at room temperature. Aliquot EB buffer (40 µL per sample x # of rows) into one row of a clean 96-well reservoir plate. An example for two rows: 40 µL x 2 = 80 µL/well.\nUsing a multichannel pipette, add 75 µL of the bead mix prepared in step 4.2.2 into each row of samples from step 4.1.7 and mix up and down 10 times. Change tips between rows. Incubate at room temperature for 15 min. Continue with the bead clean-up procedure as outlined in steps 3.3.3-3.3.10. Cover the plate with a plastic seal, quick spin and place it on ice. Proceed to step 4.3.\nA-Tailing reaction\nRetrieve from the -20 °C freezer all of the reagents (except enzymes) required for the A-Tailing reaction (Table 7), thaw them at room temperature then immediately transfer to ice.\nWorking on ice, follow Table 7 to set up the A-Tailing Master Mix in a sterile, 1.5 mL microcentrifuge tube. Follow the general enzymatic brew setup instructions as outlined in steps 4.1.4-4.1.6.",
    "Using a multichannel pipette, add 15 µL of the A-Tailing Master Mix to each row of samples and mix 10 times by pipetting up and down. Change tips between rows. Seal the plate with a PCR cover, spin down at 200 x g for 1 min at 4 °C, and incubate in a thermocycler at 37 °C for 30 min. After the incubation, spin the plate down at 200 x g for 1 min and keep it at room temperature.\nBead clean-up after A-Tailing\nPerform the steps described in step 4.2. Cover the plate with a plastic seal, label \"A-tail + BC\", quick spin, and place it on ice. Proceed to step 4.5.\nAdaptor ligation\nRetrieve from the -20 °C freezer all of the reagents (except enzymes) required for the adapter ligation reaction (Table 8), thaw them at room temperature then immediately transfer to ice.\nRetrieve 10 µM PE adapter (Supplemental Table 1) stock solution and dilute to 0.5 µM using EB. Mix well by pulse vortexing. The volume required is 3 µL x # of samples. Working on ice, aliquot the 0.5 µM PE adapter, equal volume, into 12 wells of a clean 96-well reservoir plate. Keep it on ice.\nWorking on ice, follow Table 8 to set up the Adapter Ligation Master Mix in a sterile, 1.5 mL microcentrifuge tube. Follow the general enzymatic brew setup instructions as outlined in steps 4.1.4-4.1.6. Make sure that the 5X Quick Ligation Buffer is fully thawed and very well mixed before use.\nOn ice, aliquot an appropriate volume of the Adapter Ligation Master Mix into one row of a new 96-well reservoir plate. For example, calculation for two rows: (23 µL x 2) + 5 µL = 51 µL/well. Keep the plate on ice.",
    "Using a multichannel pipette, add 2 µL of the 0.5 µM Paired End (PE) Adapter into each row of samples from step 4.4.1 and mix. Change tips between rows.\nUsing a multichannel pipette, add 23 µL of the Adapter Ligation Master Mix to each row of samples and mix 15 times by pipetting up and down. Change tips between rows. Seal the plate with a metal cover, label \"Ligation\", spin down at 200 x g for 1 min at 4 °C, and incubate at room temperature overnight.\nDay 4: Bead clean-up #1 after adapter ligation\nFrom the 4 °C refrigerator, retrieve the 20% PEG/1 M NaCl magnetic bead solution and incubate at room temperature for at least 30 min. While the solution is equilibrating prepare fresh 70% EtOH.\nAliquot the 20% PEG/1 M NaCl magnetic bead solution, 55 µL per sample, into one row of a 96-well reservoir plate and keep it at room temperature. An example for two rows: 55 µL x 2 = 110 µL/well.\nAliquot EB buffer, 50 µL per sample, into one row of a clean 96-well reservoir plate. An example for two rows: 50 µL x 2 = 100 µL/well.\nUsing a multichannel pipette, add 48 µL of the 20% PEG/1 M NaCl magnetic bead solution into each row of samples in the Ligation plate from step 4.5.6 and mix up and down 10 times. Change tips between rows. Incubate at room temperature for 15 min. Continue with the bead clean-up procedure as outlined in steps 3.3.3-3.3.7.\nTake the plate off the plate magnet and using a multichannel pipette, add 45 µL EB (Table of Materials). Mix well by pipetting 10 times up and down. Change tips between rows. Incubate for at room temperature for 3 min to elute.",
    "After incubation, place the IP reaction plate back onto the plate magnet and incubate for 2 min. Using a multichannel pipette, without disturbing the beads, carefully transfer the supernatant into the corresponding wells of a new 96-well plate. Label the plate \"Ligation + 1 BC\".\nTo each well add 5 µL of 10x PCR high fidelity buffer and mix well by pipetting up and down. Change tips between rows. Cover the plate with a plastic seal, quick spin, and keep it at room temperature.\nBead clean-up #2 after adapter ligation\nPerform bead clean-up as described in section 4.6 with the following changes: add 60 µL of 20% PEG/1 M NaCl magnetic bead solution to each active well in the Ligation + 1 BC plate (step 4.6.7) and elute from the beads using 35 µL of EB buffer. Label the plate \"Ligation + 2 BC\" and keep it on ice.\nPCR amplification\nRetrieve from the -20 °C freezer all the reagents (except enzymes) required for the PCR reaction (Table 9), thaw them at room temperature then immediately place them on ice.\nWorking on ice, follow Table 9 to set up the PCR Master Mix in a sterile, 1.5 mL microcentrifuge tube. Follow the general brew set-up instructions as outlined in steps 4.1.4-4.1.5. On ice, aliquot an appropriate volume of the PCR Master Mix into one row of a new 96-well reservoir plate. Keep it on ice. See step 4.5.4 for sample calculations.\nWorking on ice, using a multichannel pipette, add 2 µL of each unique 12.5 µM PCR reverse indexing primer (Supplemental Table 2) into each well in the Ligation + 2 BC plate (step 4.7.1) and mix slowly up and down. Change tips between rows. Keep the plate on ice.",
    "Working on ice, using a multichannel pipette, add 23 µL of the PCR master mix into each row of samples from step 4.8.3 and mix 10 times by pipetting up and down. Seal the plate with a PCR cover, spin it down at 200 x g for 1 min, and incubate in a thermocycler (see Table 10 for PCR cycling conditions).\nBead clean-up after PCR amplification\nAfter PCR amplification spin the plate at 200 x g for 1 min, 4 °C. Perform the bead clean-up as described in section 4.6 with the following changes: add 51 µL of 20% PEG/1 M NaCl magnetic bead solution to each PCR reaction and elute from the beads using 25 µL of EB buffer. Seal the plate with an aluminum cover and spin down at 200 x g for 1 min. Store the samples at -20 °C.\nTo validate constructed libraries, perform DNA quantification using a fluorescence-based assay, visualize the final product using a chip-based capillary electrophoresis analyzer (high sensitivity assay), and run enrichment quantitative PCR (qPCR) (See Representative Results, Validation of ndChIP-seq library quality by qPCR)."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}