{
  "id": 17059,
  "origin_website": "Jove",
  "title": "Surgical Porcine Model of Chronic Myocardial Ischemia Treated by Exosome-laden Collagen Patch and Off-pump Coronary Artery Bypass Graft",
  "procedures": [
    "The Institutional Animal Care and Use Committees (IACUC) of the Minneapolis VA Medical Center and the University of Minnesota have approved all of the animal studies. The current National Institutes of Health (NIH) guidelines for the use and care of laboratory animals were followed.\n1. Isolation of mesenchymal stem cells and preparation and characterization of exosomes\nIsolation of bone marrow derived mesenchymal stem cells (MSCs)\n\t\nObtain 30-50 mL of sterile bone marrow from the sternum or tibia of a 20-week-old female Yorkshire-Landrace swine. To do this, introduce a 25 mm 15G interosseous needle into the sternum or tibia and draw the sample into a 60 mL syringe with 10 mL of heparin.\n\t\tNOTE: For further details on the collection of bone marrow refer to Pittenger et al. and Hocum-Stone et al.12,16.\nIn brief, pass the bone marrow specimen through a Vacutainer CPT tube with heparin for 30 min at 1800 x g.\nRemove the buffy coat containing the mononuclear cells and wash with Hank's balanced salt solution. Pellet mononuclear cells by centrifugation and resuspend in growth medium (10% fetal bovine serum [FBS]).\nTransfer the mononuclear cells to cell culture flasks for adherent growth. Isolate the MSCs from the mononuclear fraction by their adherent nature.\nWash all non-MSCs within 24 h, leaving a monolayer of MSCs in the tissue culture flask. Confirm the MSC phenotype by flow cytometry, ensuring negativity for CD45, a hematopoietic marker, and positivity for CD90 and CD105, markers of MSCs.\nPreparation and characterization of exosomes from porcine mesenchymal stem cells\n\t\nSeed 1 x 104 H9C2 rat cardiomyocytes and culture in 1x DMEM+ 10% FBS and 1x Pen/strep. Seed 2 x 104 porcine MSCs in advanced DMEM + 5% FBS and 1x Pen/strep.",
    "Once both cell lines are at least 80% confluent, change the media to exosome depleted H9C2 and MSC media.\nExpose H9C2 cardiomyocytes to mild hypoxia (1% O2 for 24 h). Remove flasks from hypoxia after 24 h and pipette out H9C2 media.\nRemove and discard the MSC media from MSC flask. Add purified H9C2 media to MSC flask. Incubate the flask for 6 h in normoxic conditions (5% CO2, 20% O2, and 37 °C).\nExtract the exosomes from the co-cultured conditioned media using the total exosome isolation reagent following manufacturer's instructions.\nVerify the identification of exosomes by western blot detection of common exosomal proteins with antibodies against CD-63 (1:1000)17.\nPerform nanoparticle tracking analysis (NTA) to quantify the exosomes and the assessment of nanoparticle size and its distribution. To do this, dissolve total protein (50 μg) of exosomes in 500 μL of PBS to determine the concentration and size distribution of exosomes by using nanoparticle tracking analyzer.\nAnalyze the data using nanoparticle tracking software.\n2. Off pump coronary artery bypass graft surgery\nAnimal preparation\n\t\nWeigh the animal (16-week-old female Yorkshire-Landrace pigs) 3 days before scheduled for surgery. Fast the animal for 12 h before surgery while having access to water during fasting.\nGive extended-release buprenorphine 0.18 mg/kg via intramuscular route 2-4 h before surgery.\nInduction of the animal\n\t\nSedate the animal by giving intramuscular injection of 6.6 mg/kg tiletamine-zolazepam/xylazine.\nWait for 15 min to ensure adequate sedation by assessing the jaw tone followed by 22G catheter placement in the central ear vein.\n\t\tNOTE: Another peripheral vein may be considered (i.e., cephalic vein) if ear vein is inadequate.",
    "Administer ophthalmic ointment topically to each eye. Administer 1-2 mg/kg of propofol via intravenous route to induce general anesthesia. Jaw tone most reliably reflects the depth of anesthesia and should be assessed throughout the procedure.\nIntubate the animal with an endotracheal tube of appropriate size.\nSurgery\n\t\nShave the sternum and groin of the animal in preparation for surgical procedure.\nSet mechanical ventilation at 10-15 breaths per min, oxygen 1-4 L/min, and isoflurane 1.0-3.0% as needed to maintain deep anesthesia for surgery. Check for absent eye or jaw reflex to confirm deep anesthesia.\nPosition monitoring equipment (Electrocardiogram, end tidal CO2, heart rate, Oxygen saturation, blood pressure, and temperature) on the animal.\nConnect the IV catheter to a bag of normal saline or lactate ringers' solution to administer maintenance fluids continuously.\nPrepare the skin using aseptic technique with povidone Iodine scrub and solution 3x for adequate sterility and to minimize the risk of surgical site infection.\nGive Lidocaine via intravascular route (loading dose of 2 mg/kg or continuous infusion at dose of 50 mcg/kg/min) to prevent arrhythmias.\nPosition the animal dorsally and drape with sterile towels.\nPerform either left or right femoral artery cut down for arterial line placement by Seldinger technique followed by connecting the catheter to the transducer for continuous blood pressure monitoring at the time of surgery.\nUse monopolar electrocautery to make a 20 cm incision extending from the sternal notch proximally down to the xyphoid process distally, and to incise layers of muscles, subcutaneous fat, and connective tissue down to the sternum.\nPerform median sternotomy by using oscillating saw.\n\t\tNOTE: Standard saw is avoided for repeat sternotomy as it carries higher risk for myocardial injury from previous pericardial adhesions from left thoracotomy procedure done to place the LAD constrictor.",
    "Divide the posterior sternal plate using a pair of scissors. Use a specialized chest retractor for adequate visualization of the mediastinum.\nDissect adhesions using either monopolar electrocautery or the Metzenbaum scissors. Carefully dissect the peristernal muscle and fat to expose the left internal mammary artery (LIMA).\nOnce LIMA is exposed lateral to the sternal edge, gently separate it from the chest wall using blunt dissection with electrocautery tip. Use the LIMA as a skeletonized graft.\nStart dissection at the level of 3rd intercostal space. Gently elevate the left sternal border for optimal visualization.\nUse gentle traction on the adventitia to expose the arterial and venous branches of LIMA. Clip the LIMA side of the branches using hemoclips and cauterize the chest wall side of the branches.\n\t\tNOTE: Care must be taken not to cauterize the clip on the LIMA, because this may cause conduit narrowing.\nOnce an initial segment of LIMA has been mobilized, continue the dissection proximally toward the level of subclavian vein and distally until the LIMA bifurcation.\nOnce dissection is finished, administer heparin via intravenous route at a dose of 100-300 U/kg. Wait for 3 min after the heparin is administered.\nAfter 3 min, clip the distal end of the LIMA, just before the level of the LIMA bifurcation, and divide the conduit. Sew the distal end with a free 2-0 silk suture tie.\nPrepare the proximal end for grafting. Inspect the flow quality visually by letting the graft bleed for a few seconds.\nGently clamp the distal end of LIMA conduit with an atraumatic bulldog clamp to avoid bleeding. Open the pericardium with an inverted-T making an approximately 5-6 cm incision. Place 3-0 size sutures on the pericardium for traction at both sides of the slit.",
    "Stabilize the LAD with silicone retraction tapes and tissue stabilizer, which is secured to the sternal retractor. Make an arteriotomy in LAD artery distal to the stenosis (caused by constrictor band) with an 11-blade and extend with an iris scissors.\nPlace an appropriately sized coronary shunt in the LAD. Perform the LIMA to LAD anastomosis with 7-0 running non-absorbable suture using an off-pump bypass technique. Release the bulldog occluder on the LIMA and confirm the hemostasis.\nPreparation of Mesenchymal Stem Cell (MSC)-derived exosome patch\n\t\nFollowing successful isolation of exosomes from MSCs, suspend roughly 3 x 108 exosomes in 3 mL of normal saline and add to collagen sponge.\nBring 3 mL of exosome suspension to room temperature at around 22 °C for 10 min. Place 2 absorbable collage sponges (each 1.27 cm x 2.54 cm) into a medium Petri dish.\nUse a 5 mL syringe with an 18G needle to gently mix exosome suspension. Slowly pipette 1.5 mL suspension onto each collagen sponge and wait for 5 min for full absorption.\nPlacement of exosome patch\n\t\nPlace the Exosome-laden sponge upside down onto the hibernating region of the heart, which is the epicardium of the anterior septal region in the distribution of the LAD.\nGently place two sponges to cover the hibernating region of the heart. Use one 3.5 cm x 1.0 cm polyglactin mesh to cover each collagen sponge.\nSew the mesh onto the epicardium with fine 7-0 interrupted sutures.\nChest tube placement\n\t\nPlace a chest tube through separate stab incision, near the inferior aspect of the sternotomy incision. Place the chest tube cautiously over the anterior aspect of the heart.",
    "Once the tube is in place, place a purse string suture with 3-0 suture using a horizontal mattress stitch to allow for closure of the wound upon removal of the tube.\nRemove the chest tube only after chest is completely closed. Then use suction to remove all air and tie suture as chest tube is removed with suction.\nChest closure\n\t\nApproximate the sternum with non-absorbable sutures using a figure eight pattern.\n\t\tNOTE: Suture is used rather than wires to avoid interference with MRI imaging.\nClose layers of muscle and skin in the standard fashion using 2-0 and 3-0 absorbable suture, respectively.\nPerform a breath hold to evacuate all the air out of thoracic cavity. Monitor the airway pressure on the ventilator cautiously and maintain the pressure between 15-22 mmHg and release when complete.\nOnce all the air is evacuated, remove the chest tube while closing the wound using the purse string suture. Apply adhesive glue topically to cover the sternal incision.\nAdminister 1 mg/kg bupivacaine via intramuscular route along the entire length of the incision after the procedure is complete. Administer meloxicam 0.2 mg/kg subcutaneously\nPost operative care after surgery\n\t\nGradually wean the animal off the ventilator as skin incision is being closed. Ensure that the animal is able to spontaneously breathe and protect reflexes before disconnecting the animal from anesthesia equipment.\nRemove the endotracheal tube after confirming that animal is able to protect its airway. Cover the skin incision with sterile and non-adherent dressing embedded with antibiotic ointment to minimize surgical site infection.\nContinue to monitor vital signs including heart rate, respiratory rate, body temperature every 15 min until animal is able to hold its position without assistance.",
    "Ensure animal is not left unattended until able to lift and hold its head up and can stand without assistance. Administer meloxicam at a dose of 0.2 mg /kg via subcutaneous route before transporting the animal to the recovery unit.\nTransport the animal to the recovery unit when animal is stable. Keep the surgical site dressing on the incision until postoperative day 3. Replace the dressing if it becomes soiled.\nContinue to monitor the level of the pain, skin incision and overall well-being of the animal for the first 5 days after surgery. Administer half a dose of meloxicam (0.1 mg/kg) as needed once daily for breakthrough pain.\nSingle house the animal for first 5 days after surgery while the incision(s) heal to reduce the risk of surgical site infection by another animal. Return the animal to group housing after 5 days.\nReport any complications or changes in the animal's condition (fever, ascites, weight loss, inappetence etc.) to the veterinarian or appropriate staff.\n3. Coronary angiography using femoral access\nSecure the animal on the operating table in the dorsal recumbency. Initiate mechanical ventilation at 10-15 breaths per min. Set oxygen at 2-4 L/min, isoflurane at 1% and 4%, as needed to maintain a deep plane of anesthesia.\nPlace ECG leads on the animal's limb to monitor for heart rhythm. Evaluate the animal for the depth of anesthesia. Consider the animal deeply anesthetized when the eye or jaw reflex is absent.\nClean the chest and neck area with povidone iodine scrub and then drape the animal with towels.\nAccess the femoral artery via surgical cut-down and expose the femoral artery and vein. Make a 1-2 mm longitudinal incision with a no. 11 blade in femoral artery and cannulate the artery using an 11 Fr introducer sheath in the vessel lumen.",
    "After obtaining access, advance the catheter to perform coronary angiography to assess the anatomy patency of LIMA-LAD graft.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}