{
  "id": 17603,
  "origin_website": "Jove",
  "title": "Digital Home-Monitoring of Patients after Kidney Transplantation: The MACCS Platform",
  "procedures": [
    "The protocol follows the current guidelines of the ethics and data protection committees at Charité - Universitätsmedizin Berlin and is in compliance with current EU GDPR.\n1. Perspective of the telemedicine team\nScreening for patients\n\tNOTE: Key data of the project are provided in Table 1.\n\t\nAsk the nurse to screen incoming outpatients or patients on the ward for eligibility. Ask the telemedicine team (nurse and physician) to talk to patients in the outpatient clinic or on the ward about the content, data protection, and aim of the project.\nAfter agreeing, ensure that the patients provide written consent. Ensure that the nurse documents refusals and reasons for not participating and checks again with patients who need time for consideration.\nRole of the nurse in the patient onboarding process\n\t\nAsk the patient to show his/her smartphone and support the patient in downloading the app from Apple Store or Play Store.\n\t\t​NOTE: If the patient does not own an adequate smartphone, the telemedicine team provides a smartphone for the time of participation.\nSearch for the patient in the transplant database (TBase).\n\t\t\nClick on the Onboarding into MACCS project button. Ensure that the patient registers on the registration web page with the initial login data automatically created by the transplant database.\nAsk the patient to create new login data and digitally confirm consent when redirected to the consent page. Ensure that the patient logs out of the registration page after the platform establishes a safe connection between the patient app and transplant EHR (TBase).\nPatient training by the nurse",
    "Show where to find laboratory values and how these are presented; how to find the text messaging function and how to send a message; how to start a video consultation; how to find a medication plan and how to confirm medication intake; and check the current medication plan for correctness.\n\t\t​NOTE: The current medication plan is transferred to the app automatically once the connection is established.\nDemonstrate how to submit vital signs, blood sugar, well-being status, and confirm or decline medication intake. Train the patient how to take the immunosuppressive drugs correctly, and how to measure the heart rate and blood pressure correctly.\nSet the patient's current body weight in the telemedicine dashboard by clicking on the Therapeutic Plan button, fill in Weight in kg, and click on Confirm Data.\nDefine the therapeutic plan for home measurements with the patient and fill out the Frequency table in TBase.\n\t\tNOTE: The individual adherence plan is one part of adherence calculation and is documented in the dashboard.\nDiscuss with the patients when to contact them in to remind them to forward data; encourage the patients to always call in case of medical or technical problems. Explain the working hours of the telemedicine team, morning hotline for urgent issues, and what to do in case of medical problems or emergencies during and after the regular working hours of the telemedicine team.\nCheck whether data have been received the next day, and call patients to explain that the data have arrived and ask about any technical issues they may have faced.\nDaily routine of the telemedicine team",
    "NOTE: Monday to Friday from 8 a.m. to 4 p.m. (Table 2). Outside regular working hours, the nephrologist-on-call has full access to the transplant database and the telemedicine dashboard. The telemedicine team consists of at least one experienced nurse for every 300 patients, and at least one experienced medical doctor for every 600 patients. One medical doctor is always on duty (Table 1). Currently, the telemedicine team consists of two nurses, three junior physicians, and four senior nephrologists.\n\t\nDaily routine of the nurses\n\t\t\nStart the day with a structured process in reviewing incoming vital signs in the telemedicine dashboard (Table 3). Filter patients according to their critical values as defined in Table 4 and, if necessary, call the patient or discuss the case with a physician from the telemedicine team.\nReview well-being data. Call patients if the well-being score is low or if it decreases by more than 2 points. Consult a physician of the telemedicine team if the reason for the decrease in well-being is critical. Review less critical, but suspicious values and, if necessary, discuss these cases with a physician from the telemedicine team.\nControl incoming medical messages and take action, if necessary. Document all calls and activities in the telemedicine dashboard chart.\nIdentify patients who did not document data in the app as previously agreed. Call the patients and ask about potential technical problems as the reason for the missing data. If technical data transmission is working, remind the patient to regularly forward data as agreed.\nAnswer incoming calls (on medical and technical questions) from patients and local nephrologists. Ask patients at regular intervals about satisfaction with the telemedicine service and usability of the app, and document this information, which is forwarded to the development team for evaluation and continuous improvement.",
    "Routine of the physicians on duty in the telemedicine center\n\t\t\nReview reports from the nurses on critical values, e.g., high blood pressure (acute onset or over longer periods). Contact the senior nephrologist of the transplant team, or the physician who saw the patient during the last inpatient stay in severe cases.\nCall the patient, take medical history, and give advice, e.g., how to measure the blood pressure correctly or advise on other medical problems. Follow the patient closely over the next days if a change of medication or an unclear situation has occurred.\nIn severe cases, advise the patient to contact the local nephrologist for a visit, to go to the next emergency room, or to come to the kidney transplant center for follow-up.\nContact the local nephrologist or emergency room upfront, if needed. Update the senior nephrologist at regular intervals and have a daily brief consultation with the team in the kidney transplant center on problematic cases. Document all contacts and activities in the telemedicine dashboard.\n\t\t\t​NOTE: All physicians and nurses in the regular transplant service have full access to the transplant database, including all data in the telemedicine dashboard.\nReview reports from the nurse on non-adherent patients, analyze the type of non-adherence, and determine a procedure to improve adherence, together with the regular transplant team or local nephrologist. Aim to strengthen adherence through advice and telephone calls or video consultations.\nContact a psychologist for behavior therapy to strengthen adherence, if necessary. Follow patients with documented non-adherence more closely. Provide regular feedback to the senior nephrologist and development team.\n2. Perspective of local nephrologists\nTraining of local nephrologists by the telemedicine team\n\t\nInform the local nephrologists about the project through letters, events, and congresses and offer central training courses and video courses.",
    "Make an appointment with local nephrologists for a training and onboarding visit. During the visit, explain the project in detail to the physicians and nurses, discuss data protection, and answer questions.\nExplain the contract to local nephrologists, who sign the contract with the transplant center with specified terms and conditions. Explain the technical onboarding process in detail, and provide assistance and documents on how to include patients in the project.\nOnboarding process of patients by local nephrologists using the software system (Table of Materials)\n\t​NOTE: Through a general update, all software users have the option to participate, and the current software version has a built-in functionality for a secure connection to the FHIR server.\n\t\nSelect the patient participant in the software. Click on the MACCS button; after the local software opens an overlay window, click on Connect.\n\t\tNOTE: The local nephrologist can only include patients who are already participating and have gone through the onboarding process at the transplant center.\nAfter the local software generates login data (code and QR code), ask the patients to scan the QR code with their smartphones (or enter the code manually) and complete the onboarding process by clicking on the Data Sharing button to indicate agreement.\n\t\tNOTE: The platform now enables an automatic data exchange of pseudonymized data with the transplant center and the patient app.\nReview the data transferred from the transplant center in the local software system.\nInteraction of the local nephrologists with the telemedicine team\n\t\nCall the telemedicine team if medical or technical problems occur. Ask the transplant center (including the transplant pathologist and senior transplant nephrologist) for telemedicine consultation to discuss the best therapy for the patient, if necessary.\nAttend a (virtual) training session, workshop, or onsite presentation.\n3. Perspective of patients\nOnboarding process",
    "​NOTE: Onboarding of patients will take place with the help of the telemedicine team after explanation of the additional services of the project, data protection, and right to withdraw at any time.\n\t\nListen to the telemedicine team and ask questions. Give signed consent and download the app with the help of the nurse.\nAfter receiving the initial login data from the nurse, change the login data, and confirm participation digitally. Enter the new login data into the app and push Sign in. After the app opens, enter the well-being status, and click on the Send button. Observe the buzzing sound and the confirmation sign (green banner showing Feedback sent).\nMeasure the blood pressure, enter the data into the app, and push the Send button. Observe the buzzing sound and the green banner pop-up showing Vital Data Sent. Look at the Show History list and observe the table with all the values and transmission information.\nOpen the Communication page and send a text message to the nurse. Start a video session by clicking on the Video button. Open the Lab Results page and look at recent laboratory data. Open the Medication page, scroll through the medication plan, and confirm medication intake. Set the alert function for timely medication intake.\nAfter the nurse explains how the medication plan can be forwarded and printed out, log out of the app.\nUse of the app by patients at home\n\t\nOpen the app and enter the vital signs. Look at laboratory values, medication plan, and confirm medication intake.\nSend a text message and perform a video consultation. Enter login data in the registration page and look at the consent page, where consent was given for data transfer to the local nephrologist, and where consent can be easily withdrawn.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}