{
  "id": 4889,
  "origin_website": "Bio",
  "title": "Excision of Visceral Adipose Tissue from Live Mice (VATectomy)",
  "procedures": [
    "To reduce the amount of stress experienced by the animals as a result of pain, we recommend injecting animals intraperitoneally with NSAIDs, 30 min before starting the surgical procedure. Weigh mice and apply the dosage per kg of bodyweight as indicated (for meloxicam, use 1 mg/kg dissolved in 0.9% NaCl) (Ramsey, 2014).Place mice in the anesthetic chamber. Adjust the flow of anesthetics until the animals do not respond to a stimulus that triggers the pain reflex (i.e., pinching the toes). Typically, this requires a 2-4% Isoflurane gas mixture, with 2 L/min of oxygen flow. Visually, one will observe a loss of tail-righting and a reduced breathing rate. Typically it takes approximately 1 min for the mice to be sufficiently anesthetized (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015418_2044.jpgFigure 1. Anesthesia of animals. Mice are placed in an anesthesia chamber (ideally red transparent) and oxygen/inhalation anesthetic flow is controlled. When mice are anesthetized, remove the hair from the abdomen (in the umbilical and hypogastric regions along the linea alba) using a trimmer (Figure 2). When working efficiently, one can do this without continuous administration of anesthesia gas, as the animal will take about 60 sec before it regains responsiveness. Alternatively, one can use depilation cream. When using cream, take care to properly clean the animals after application to avoid skin irritation. Place the animal back in the anesthetic chamber and wait until the animal is again completely anesthetized.Place the mouse with its back on the operation table and apply the nose cone that provides the inhalation anesthesia to the mouse (Figure 2). Reduce the isoflurane rate to 1.5-2% with 2 L/min of oxygen flow. The operation table should be placed in a biosafety cabinet to ensure a sterile working condition. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015448_8429.jpgFigure 2. Proper placing of the animal for surgery.",
    "Place the animal in such a way that the abdomen is easily accessible, whilst ensuring proper anesthesia. The blue arrow indicates where mice need to be shaved [i.e., in the hypogastric region (down from the umbilicus) along the linea alba].Disinfect the skin. Use a scalpel to make a Pfannenstiel incision in the skin along the linea alba in the hypogastric region (down from the umbilicus). Next, make a cut (0.5 cm) into the muscle and peritoneum (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015503_2105.jpgFigure 3. Opening of the abdomen. Pull up the skin with tweezers and cut the abdominal wall, making sure to cut skin, muscle and peritoneum, without damaging the underlying internal organs. The red arrow indicates where mice need to be cut.There are two perigonadal adipose tissues. Pull them out one by one with tweezers and make an incision at the basis of adipose tissue along the epididymis and testis to completely remove the tissue (Figure 4). For sham-operated controls, pull out the fat pads and place them back inside the abdomen one by one (Video 1). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Vasectomy and sham operation  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015519_5282.jpgFigure 4. Removal of the VAT. Gently pull out the abdominal fat pads without touching the gonads and cut the VAT along the gonads. Sew all three layers (peritoneum, muscle and skin) together (Figure 5). Preferably, use an absorbable fiber. Alternatively, non-absorbable fiber or a surgical suture stapler can be used (Singer et al., 2015; Boyer, 2014.).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015536_2982.jpgFigure 5. Closing of the abdomen. A. Close the abdomen with one or two stitches. B. sagittal and C. frontal illustration of layers (peritoneum, muscle and skin) and where the sutures should be placed in relation to these layers (Boyer, 2014).Inject mice with 1 ml of sterile physiological salt solution intraperitoneally to compensate for loss of liquids.",
    "After surgery, mice will be treated twice daily with NSAIDs for three days. If non-absorbable sewing materials have been used, remove these ten days after surgery. Fourteen days after surgery, additional experiments can be started. At this time, the site of surgery will have partially been overgrown with new hair."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}