{
  "id": 17342,
  "origin_website": "Jove",
  "title": "Robotic Taj Mahal Hepatectomy for Hilar Cholangiocarcinoma",
  "procedures": [
    "The patient provided written informed consent for the operation and use of medical data for scientific purposes. This research was performed in compliance with the Declarations of Helsinki and was approved by the local institution's human research ethics committee and institutional review board.\n1. Operative setting and trocar placement\nAfter satisfactory anesthesia, place the patient in a supine, 30° reverse Trendelenburg position and spread the legs apart. Perform the sterilized exposition and check the instrument availability.\nEnsure that the first surgeon stays in front of the robot console and the table-side surgeon stands between the patient's legs. Ensure the availability of the robotic system and robotic instruments (Table of Materials).\nEstablish pneumoperitoneum through a 1 cm incision above the umbilicus using a Veress needle connected to the insufflator (set the pressure to 14 mmHg). Remove the Veress needle, transfer the insufflation tube to a 12 mm trocar, and then insert the trocar as a temporary camera port.\nInsert the robotic endoscope through the camera port and perform a diagnostic laparoscopy (the robotic endoscope is held by the assistant surgeon) to confirm adhesion status, exclude peritoneum metastasis, and evaluate operative feasibility. Subsequently, insert the remaining four trocars as follows, under the visual guidance of the endoscope.\n\t\nPlace 8 mm trocars in the right and left anterior axillary lines (AALs) under the costal margin, for the second (bipolar forceps) and third (Cadiere forceps) robotic arms, respectively.\nPlace a 12 mm trocar 5 cm to the umbilicus in the right lateral position as the camera port.\nPlace an 8 mm trocar 8 cm to the umbilicus at the superior left lateral position for the first (electrocoagulation hook) robotic arm.",
    "Place a 12 mm trocar right to the umbilicus in the right midclavicular line as the camera port. The assistant port is the original temporary camera port (step 1.3) (Figure 3).\n\t\tNOTE: The location of the ports can be adjusted according to the lesion's location and the patient's body figure.\n2. Abdominal inspection and assessment of resectability\nPerform a full abdominal inspection using robotic endoscopy to observe the shape and size of the liver, gallbladder, and hepatoduodenal ligament, assessing for tumor resectability. Advance the endoscope into the abdominal cavity to rule out tumor metastasis.\nDissect the lesser omentum from right to left with an electrocoagulation hook to descend the pylorus and duodenum. Create a Kocher's incision, about 5 cm, at the lateral side of the second part of the duodenum using an electrocoagulation hook to expose the retroduodenal portion of the common bile duct.\nClip the distal and proximal stump of the common bile duct with an absorbable ligating clip.\nTransect the common bile duct in the superior edge of the pancreas using curved shears. Sample the tissue from the largest margin of the distal stump of the common bile duct and send it for frozen section pathological examination.\nDissect the common bile duct and hepatic duct from caudal to cephalad direction, toward the cystic triangle. Confirm the presence of the cystic duct and artery. Dissect the cystic triangle using an electrocoagulation hook and determine the relationship between tumor and hepatic artery as well as portal vein.\n\tNOTE: The cystic triangle is constituted by the common hepatic duct, cystic duct, and cystic artery.\nAfter ligation with an absorbable ligating clip, transect the cystic duct and artery using curved shears, and then remove them and the gallbladder from the gallbladder bed.",
    "Dissect the hepatic artery and portal vein using the intraglissonian approach8 with an electrocoagulation hook and bipolar forceps. Identify the position of the gastroduodenal artery, common hepatic artery, and portal vein, and fasten them with a rubber band.\n\t​NOTE: The intraglissonian approach is used to dissociate the whole bundle of the left, middle, and right Glissonean pedicles beyond the hilar plate, and based on this, dissect the Glissonean pedicles, hepatic artery, and portal vein, respectively. Thereafter, a regular and precise hepatectomy is performed according to the ischemia line after selective hepatic flow occlusion.\nSkeletonize arteries and veins in the hilar region using an electrocoagulation hook and bipolar forceps.\n\t\nDissect the hepatoduodenal ligament and transect the common bile duct from bottom to top. Dissect the bile duct, proper hepatic artery, and portal vein completely with an electrocoagulation hook and bipolar forceps. Transect their branches with an ultrasonic scalpel to expose arteries and veins one by one.\nResect the 8a, 8p, and 12 lymph nodes, peripheral nerve connective tissue, and hepatic portal plate with the electrocoagulation hook. Finally, remove fibrous connective tissue and lymph nodes along the duct.\nMobilize the left and right portal veins and tie a rubber band around the left portal vein. Transect the branches of the portal vein from the right caudate lobe using an ultrasonic scalpel.\n3. Taj Mahal hepatectomy and regional lymphadenectomy\nLabel the resection line of S4b, S5, and the caudate lobe on the liver's surface using an electrocoagulation hook. Transect the perihepatic ligaments and dissociate the bilateral halves of the liver with the electrocoagulation hook and bipolar forceps.",
    "Expand the Kocher's incision using an ultrasonic scalpel and an electrocoagulation hook. Resect lymph nodes 13a, 16a2, and part of the 7 and 9 groups using an ultrasonic scalpel and bipolar forceps. Remove these lymph nodes together with the previously dissected lymph nodes (8a, 8p, and 12) to achieve en bloc regional lymphadenectomy, which could also improve the exposure of the left caudate lobe.\nTransect the hepatic round ligament and its falciform ligaments using an electrocoagulation hook and bipolar forceps. Correct the resection line in order to expose intrahepatic bile ducts sufficiently, according to the actual situation during surgery.\nOcclude the left Glissonean pedicle with bulldog clamps and transect the left liver parenchyma (S4b) along the resection line with an ultrasonic scalpel. Similarly, occlude the right Glissonean pedicle and transect the right liver parenchyma (S5).\nLigate the branches of the intrahepatic Glissonean system and hepatic veins using surgical clips and use an ultrasonic scalpel for parenchymal transection. Completely resect S4b and S5.\n\tNOTE: To occlude the left and right Glissonean pedicles, use the intraglissonian approach before this process.\nTransect the liver parenchyma of the caudate lobe and the Spiegel lobe. Finally, transect the ventral caudal portion of S1.\n4. Reconstruction of the intrahepatic bile ducts and bilateral hepaticojejunostomy\nExamine the cut surface of the liver and close the bile duct orifice of the caudate lobe with 4-0 sutures. Use a electrocoagulation hook (spray coagulation model, effect 3, 80 W) to stop small bleeds and bile leakage, while using a 4-0 suture to stop larger bleeds and bile leakage.",
    "Insert silicon stents into the branches of the left and right hepatic ducts to confirm the location of the ducts. Remove the stents and suture the adjacent walls of the right hepatic duct branches (B5d/7/8+6) and the left hepatic duct branches (B2-4) with 4-0 sutures. When the adjacent branches are sufficiently close, reconstruct the adjacent hepatic duct branches into an arch with a septum using a CV-4 suture (Figure 4A). Close the remaining small bile duct orifice with 4-0 sutures. Cover the cut surface of the liver with a hemostatic sponge.\nOpen the gastrocolic ligament with an electrocoagulation hook and ultrasonic scalpel. Open the avascular area on the left of vessels of the middle colic artery to expose the jejunum. Retract the proximal jejunum through the transverse mesocolon.\nPerform retrocolic hepaticojejunostomy about 20 cm away from the ligament of Treitz for the left hepatic duct (B2-4) using a CV-4 suture in the hypotonic position of the jejunum. Using the same method, perform the hepaticojejunostomy for the right hepatic duct (b5d/7/8+6) and jejunum, and finish the bilateral hepaticojejunostomy (Figure 4).\n\tNOTE: Before the hepaticojejunostomy, suitably mobilize the bile duct stumps for anastomosis. The 5-0 absorbable suture is preferred for hepaticojejunostomy, while the non-absorbable suture, such as the size CV-4 ePTFE monofilament suture is preferred for a wider anastomosis site.\nTransect the jejunum and jejunal mesentery using a cutting stapler away from the proximal stump of the biliary-enteric anastomosis. Perform a side-to-side jejuno-jejunostomy with the cutting stapler about 45 cm away from the distal stump of the biliary-enteric anastomosis.",
    "​NOTE: To reduce the tension of hepaticojejunostomy, the key is the preparation of a tension-free jejunum loop. Transect 1-2 branches of jejunal artery, if necessary. Put two suspension sutures at both sides of the hepaticojejunostomy to further reduce the tension caused by gravity and intestinal motility.\n5. Drain placement\nExamine the cut surface of the liver and anastomosis sites. Eliminate bleeding and bile leakage as described in step 4.1.\nPlace two drainage tubes at the anterior and posterior areas of the biliary-enteric anastomosis, respectively.\n6. Postoperative care\nRemove the nasogastric tube the day after the operation. Start an abrosia and expand to a normal diet in 3 days.\nAssess serum total bilirubin on postoperative day 1, day 3, day 7, and day 12. Perform a CT of the abdomen if total bilirubin on day four is elevated compared to day three.\nAssess drain bilirubin on postoperative day 1 to day 3. Remove the drain when drain bilirubin levels are less than three times the upper limit of normal serum amylase.\nPerform abdominal CT, blood routine examination, and blood biochemistry examination to assess postoperative recovery before discharge."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}