{
  "id": 10750,
  "origin_website": "Jove",
  "title": "Studying Soft-matter and Biological Systems over a Wide Length-scale from Nanometer and Micrometer Sizes at the Small-angle Neutron Diffractometer KWS-2",
  "procedures": [
    "1. Loading the Sample Cells\nDisperse polystyrene spherical particles with different sizes (radii of R = 150, 350, 500, 1,000, and 4,000 Å) and a size polydispersity of σR imgsrc://cloudfront.jove.com/files/ftp_upload/54639/54639eq5.jpg 8% in a water solution (a mixture of 90% D2O and 10% H2O) at a volume fraction of 1%.\nTransfer the six solutions of polystyrene particles in D2O/H2O, the solution of C28H57-PEO5 in D2O, and the D2O/H2O and D2O solvents to quartz cells (Figure 3) using Pasteur pipettes. Fill each of the quartz cells up to the neck. Close the quartz cells with their stoppers.\n\tNOTE: The operation of filling the quartz cells with samples must be carried out in the sample preparation lab of FRM II by complying with the special working conditions defined there.\nInstall the filled quartz cells into the Al-cartridges of the sample holder (Figures 3). Place each filled quartz cell in a cavity of the cartridge and check whether the quartz cell is filled with enough sample by determining whether the sample entirely covers the window opening in the cartridge that is provided for neutrons. Place the correction and the standard samples (the empty quartz cell, the boron-carbide plate, and the Plexiglas plate) in additional locations on the cartridge and leave one location free for the empty beam measurement.\nCover the cartridge with the Cd-coated Al-cover plates (Figure 3) using cap screws (M3x5). Fix the cartridge on the Al-frame of the sample holder by using the special Al screws (Figure 4).\n2. Positioning the Sample Holder/Sample Environment on the Sample Stage\nDetermine the necessary space at the sample position of the sample holder by adjusting the length of the collimation nose (Figure 5). Select the appropriate configuration for the sample holder from the stored configurations in the collimation nose control system.",
    "Install the appropriate sample holder/sample environment on the sample stage in the predetermined position on the optical breadboard using Allen screws, M6x40 (Figure 6).\nClose the motorized sliding lead door (Figure 5) by using the knobs on its outer side, keeping the control knobs activated until the door reaches the end position, which will be indicated by a luminous signal.\n\tCaution: Without the door completely closed and the end-switch activated, the beam shutter cannot be opened, either manually or from the measurement control software; the measurement software will require an additional check for this issue before starting the measurement.\n3. Planning the Experiments\nChoose the adequate experimental configuration and mode for performing the investigation in a Q range that is appropriate for the length scale of the structures and the correlation effects revealed by the sample. Check the dynamic range of the instrument4 (Figure 7 and Table 2).\nChoose the adequate experimental configuration and mode for enabling proper intensity on the sample based on the estimated level of the scattered intensity by knowing the approximate size, concentration, and contrast factor that characterize the samples to be investigated8. This is done in order to optimize the measurement time for a targeted measured statistic and to match the sample stability in case of samples with a short stability time. Check the intensity map for different experimental configurations4 (Supplementary Figure 1 and Table 2).\nChoose the adequate experimental configuration and mode for providing a proper resolution based on an approximate knowledge of the degree of polydispersity in size and the concentration of the scattering objects in the sample8. This is done in order to enable the resolution of fine scattering features that occur due to ordering effects in the sample. Check for the possibility of tuning the wavelength resolution5 (Table 2).",
    "4. Preparing the Measurement Software and Conducting and Visualizing the Experiment\nStart the measurement software by typing the KWS2TC in a terminal window at the measurement control computer of the KWS-2 instrument in order to activate the main menu (Supplementary Figure 3). Use the left set of functions to define the elementary motor positions (Configuration), to select samples and setup conditions (Definition), to start the measurement and supervise all motors (Control), and to supervise the actual detector (Live-Display).\nSelect the Configuration function in the main menu in order to activate the kws2-Configuration menu (Supplementary Figure 4) to define the user data and configure the elementary motor positions and the set-points for the devices and fields on the sample.\n\t\nSelect the UserData function (Supplementary Figure 4) and fill the fields User name, E-mail, First part of filename, and Measurement comment in the User data menu (view/edit). Leave the menu by clicking Save.\n\t\tCaution: Do not use special characters, like @, $, %, etc., for the file name prefix. Avoid using special characters throughout the entire experimental procedure.\nSelect the Sample function (Supplementary Figure 4) in order to activate the Sample configuration menu (Supplementary Figure 4). Fill the fields Sample title, Sample beam window - Size, Sample thickness, and Comment for each sample and position selected from the left vertical list of the menu. Save each sample configuration after completing the definition. Leave the menu by clicking Close.\nSave all configurations under the File function at the upper set of functions in the Configuration menu.\nSelect the Definition function in the main menu (Supplementary Figure 3) in order to activate the kws2 Definition menu (Supplementary Figure 5) to define the experimental setup and the measurement program.\n\t\nSelect the Sample function in order to activate the Select Samples menu (Supplementary Figure 5).",
    "Choose the twelve samples that must be measured (as shown in Figure 3) from the list of known samples in the left vertical field and move them to the Selected Samples field using the blue arrow. Order the list of the selected samples by using the blue vertical arrows.\nCheck the sample parameters and adjust the name, thickness, and comment, if necessary. Leave the menu by clicking Save or Close.\nSelect the Detector function to activate the Definition of Measurements menu (Supplementary Figure 6).\n\t\t\nChoose the static measurement type by selecting Standard in the Measurement area. In the End Conditions area, select the proper time unit for the field measuring time.\nIn the Select Detector and Collimation Distances area, select the experimental setup and working mode by choosing the appropriate values for the wavelength (Selector field), detection distance (Detector Distance field), data acquisition mode (TOF field), aimed wavelength resolution (DLambda/Lambda field), measurement time (Time field), lenses configuration (Lenses field), and collimation distance (Collimation Distance field).\nClick the New button after one configuration is entirely defined in order to fix it and store it in the lower table. Define the next configuration and store it in a similar way until the entire set of configurations (Supplementary Figure 6) is completed. Hit Save or Close in the Definition of Measurements menu when the adjustment of the experimental setup and working modes is finished.",
    "Sort the list of measurements according to the three loops (sorting conditions) shown at the bottom of the menu that is generated by the program (Supplementary Figure 7). Remove the measurements that are not desired by marking the corresponding line and clicking the \"X\" button marked in red. Adjust the measurement time for each measurement as desired by checking the total defined measurement time in the central field, marked in red, in the kws2 Definition menu, which always remains active on the screen.\nLeave the menu with Save or Close and return to the kws2 Definition menu (Supplementary Figure 5). Close the kws2 Definition menu and return to the main menu (Supplementary Figure 3).\nSelect the Control function in the main menu of the KWS2 measurement software (Supplementary Figure 3) in order to activate the Measurement control menu (Supplementary Figure 8).\n\t\nLog in with the username and password that will be communicated by the instrument scientist and lock the session for generating the script, which will execute the commands of the uploaded measurement program. Select Loop Definition in order to check the uploaded measurement program.\nPress the Start button and answer the questions generated by the program about the actual status of the sample position door and the beam-shutter. The measurement program will be started. Select Current Values in order to enable the visualization of the ongoing measurement (the positions of motors and the status of instrument components, count rate, and evolution of the integral intensity in time).\n\t\tNOTE: The integral intensity on the detector and the count rates of the detector and monitors are shown and can be used to change the measurement program, either individually or the entirety of the set of measurements.\nAllow the measurements be conducted and completed according to the defined measurement program.",
    "NOTE: The measurements can be interrupted or stopped by activating the Stop function and choosing the desired option (to continue, to stop the current measurement with or without saving the file, or to stop the entire program) when the integral intensity collected up to a certain time point is considered sufficient or when failures are identified in the measurements sequence.\n\t\nGenerate the Logbook of the measurement session by clicking on the Print button under the Loop Definitions option (Supplementary Figure 8) when the defined measurement program has been stopped or completed.\nSelect Live-Display in the main menu of the KWS2 measurement software (Supplementary Figure 3) in order to activate the KWSlive_MainWindow interface (Supplementary Figure 9).\n\t\nAt the Type screen, choose either GEDET or PSD in order to visualize data collected with the main or with the secondary (high-resolution) detector, respectively. Choose the visualization mode at Display Mode by selecting the three-dimensional (Surface), the two-dimensional (Contour), or the one-dimensional (Radial average) mode. Enter the plot options (linear or logarithmic scale) and the parameter values (wavelength and detection distance LD) in the fields of the Radial average options menu in order to enable the presentation of data as n intensity (uncorrected) versus Q.\nChoose a desired TOF-channel in order to visualize the data collected in TOF mode (with either the main or the secondary detector).\n5. Data Analysis\nStart the data processing software by typing the qtiKWS command in a terminal window of the data analysis computer of the KWS-2 instrument. Choose the New Script option on the right side of the main interface.",
    "Choose the DAN option in the upper functions menu of the main interface (Supplementary Figure 10) in order to activate the data analysis functions. Select the KWS-2 instrument from Options on the right-side menu in order to activate the data analysis mode for data measured on the KWS-2 using the main detector. Define the folder where the measured data files are located and where the corrected data files will be stored.\nChoose the Tools option and activate the Header(s) function on the right-side menu (Supplementary Figure 11) and generate the info-table that contains the files to be processed. Define the table name by clicking the left set of green arrows on the Header(s) field. Load the measured files by clicking the right set of green arrows on the Header(s) field and selecting the measured files.\n\tNOTE: The info-table that contains the complete information about each measurement file is stored in the explorer-like menu in the lower part of the project. All results that will be generated later in the project will be stored there.\nActivate the Mask function in the right-side menu (Supplementary Figure 12) and generate the active mask that defines the area of the detector that will be considered for data processing. Enter values in the Edge and Beam-Stop fields for defining the lower-left and upper-right corners of the rectangular mask in the case of the analysis of isotropic scattering patterns.\nActivate the Sensitivity function in the right-side menu (Supplementary Figure 13) and generate the detector sensitivity for a certain configuration by entering in the marked green fields the run numbers for the measurements of the standard sample (Plexiglas), empty beam (EB), and blocked beam (B4C).",
    "Click on the set of green arrows next to the yellow field (Transmission) for calculating the transmission of the standard sample. Generate and name the sensitivity matrix by selecting Calculate as New, and visualize the generated matrix by using the appropriate plot functions in the lower menu. Repeat this procedure in case of other configurations.\nActivate the Data Processing function in the right-side menu (Supplementary Figure 14) and generate the correction and calibration table and the script table in order to correct, calibrate, and perform the radial averaging of the data.\n\t\nDefine the number of conditions used in the experiment by using the horizontal slider on the top of the right-side menu (red arrow). Fill the fields indicated with the yellow pencil by entering for each experimental condition the run numbers for the empty cell (EC), blocked beam (B4C), and standard samples-the Plexiglas (Abs. Cal. FS), empty beam for the standard correction (Abs. Cal. EB), and blocked beam for the standard correction (Abs. Cal. B4C).\nEnter the run numbers of measurements with strong forward scattering in the Center field. Enter the run number of an empty beam in the EB field and select the corresponding experimental condition for the calculation of the transmission of samples by checking the box next to the Tr (Ec-to-EB) function.\nClick each button indicated by a set of rotating green arrows on the vertical series of options (Supplementary Figure 14) in order to load the information needed for data processing from the defined files and to calculate the transmission of the empty cell. Click the head of each yellow column in order to define the column name.",
    "Click the New button in order to generate and name the table of the data files that will be processed. Click the Add button in order to load the data files that will be processed. Click the Tr button indicated with the set of rotating green arrows under the Script-Table Tools area in order to calculate the transmission of each sample. Check the results in the generated table (Supplementary Figure 14).\nChoose Project in the lower-right corner of the interface (Supplementary Figure 14) in order to save all results as tables or matrices in the current qtiKWS session (project). Click the I[x,y] button in order to perform the correction and calibration of two-dimensional data. Click the I(Q) button in order to perform the correction, calibration, and radial averaging of the data. Plot the results using the graphical functions under the Graph (Supplementary Figure 15) option.\n\t\tNOTE: All results will be generated as external files that will be saved in the external folder that was defined in step 5.2, when, in the lower-right corner of the interface, File is chosen instead of Project.\nChose Tools in the right-side menu (Supplementary Figure 11) and activate the TOF|RT option (Supplementary Figure 16) in order to split the data that were collected with the main detector in the TOF working mode into single files corresponding to each time channel.",
    "Click the TOF :: Calculate Parameters function and load one file, from which information about the TOF conditions is extracted. Click on the TOF|RT :: Sum vs Number :: Read function and load the file of interest, measured in real-time or TOF modes, in order to generate a sum-tof-file table like that shown on the left side of the working interface. Plot the integral intensity as a function of time channels (Supplementary Figure 16) from the sum-tof-file using the graphical options under the Graph function in the upper functions menu.\nDefine the processing parameters in the fields of the TOF function. Click the TOF|RT :: All Selected Steps :: Proceed button in order to load the data files that will be separated into single files corresponding to each of the defined time slots.\n\t\tNOTE: Files that contains data measured in every time slot are generated and stored in the file location defined in step 5.2 and receive the name of the original TOF file, followed by the number of the time slot.\nProceed as in step 5.6 in order to analyze the data measured with improved resolution, corresponding to Δλ\\λaimed, using the chopper.\nSelect the KWS2-HRD instrument from Options on the right-side menu of the main interface (Supplementary Figure 17) in order to activate the data analysis mode for data measured with the KWS-2 using the secondary high-resolution detector. Activate the Mask function in the right-side menu (Supplementary Figure 18A) and generate the active mask that defines the active area of the detector.\n\t\nChoose the DANP option in the upper functions menu of the main interface (Supplementary Figure 18B). Select the ASCII.2D option in the right-side menu. Activate the 2D Masking function in order to define a special sector on the detector that will be considered for the data analysis.",
    "Introduce the beam-stop center in the field Center. Select the mask matrix and the value 0 in Mask :: Conditions to neglect the outside area of the special mask. Choose the angular sector and click the colored button on the right side of the sector fields. Proceed with the data measured with the high resolution detector, as in steps 5.5 and 5.6.\nSave the qtiKWS project (save functions under the File option of the upper menu)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}