{
  "id": 15341,
  "origin_website": "Jove",
  "title": "Studying Cell Cycle-regulated Gene Expression by Two Complementary Cell Synchronization Protocols",
  "procedures": [
    "1. Cellular Synchronization, Release and Monitoring of Cell Cycle Progression\nThymidine- and nocodazole-based (Thy-Noc) synchronization and release of U2OS cells from Mitosis\nPrepare required cell culture medium. U2OS cells are routinely grown in DMEM-Glutamine medium complemented with 10% (vol/vol) FBS (optional: 1% penicillin/streptomycin). Perform all the medium preparation and manipulation under sterile conditions and warm up complemented medium (from now on referred to as \"complete medium\") to 37 °C prior to use.\nSeed 2 x 106 U2OS cells per 100 mm dish in 10 mL complete culture medium. In order to calculate the number of dishes needed, take into account that each 100 mm dish typically provides enough mitotic cells to re-plate approximately 5 wells of a 6-well plate (0.2 - 0.25 x 106 cells/well) (see Figure 1B). Two wells per selected time point are required in the experiment (1 well for RNA extraction and 1 well for cell cycle monitoring). Additionally, a third well may be collected per time point for protein analysis.\n\t\t​NOTE: Plate cells in the evening (around 7 pm) so that subsequent steps can be carried out during working hours the following days. Include 2 additional wells of asynchronously growing cells to define FACS analysis compensation settings.\nLet cells attach by incubating 100 mm dishes at 37 °C in a humidified atmosphere with 5% CO2 for 24 h.",
    "For the thymidine block, prepare a 200 mM thymidine stock solution by dissolving 145.2 mg thymidine powder in 3 mL H2O (or equivalent amounts) and sterilize the solution by filtration through a 0.2 µm pore size filter. Slight warming might help dissolve thymidine. Add 100 μL of the freshly prepared 200 mM stock to each 100 mm culture dish (final concentration 2 mM). Incubate cells with thymidine for 20 h at 37 °C in a humidified atmosphere with 5% CO2.\n\t\t​NOTE: Treat cells in the evening (around 7 pm), to have time to perform both thymidine release and nocodazole block the following day.\nTo release from the thymidine block, remove thymidine containing growth medium in the afternoon of the following day (3 pm); wash cells twice with pre-warmed 1x PBS and add 10 mL of complete medium to each 100 mm dish. Incubate cells for 5 h at 37 °C in a humidified atmosphere with 5% CO2.\nFor mitotic cell arrest, add nocodazole to a final concentration of 50 ng/mL (8 pm). Prepare a stock solution by dissolving nocodazole powder in DMSO (e.g. 5 mg/mL) and store frozen at -20 °C. Incubate cells with nocodazole for no longer than 10 - 11 h at 37 °C in a humidified atmosphere with 5% CO2.\nRelease from nocodazole-mediated arrest in early M phase (mitotic shake-off) and collection of samples at several time points (starting at 6-7 am).",
    "Detach rounded (mitotic) cells by shaking each plate and gently pipetting nocodazole-containing growth medium. Collect medium with detached cells from each 100 mm plate into 50 mL sterile tubes, centrifuge (300 x g, 5 min, room temperature (RT)) and wash cells twice by adding 1x  PBS followed by centrifugation. Use of cold PBS or PBS plus nocodazole is recommended to avoid mitotic slippage (see Discussion section).\nResuspend mitotic cells gathered from each 100 mm plate in 10 mL of complete medium. Save 2 mL for RNA extraction and 2 mL for FACS analysis for the 0 h time point (approximately 0.2-0.25 x 106 cells per sample).\nRe-plate remaining mitotic cells for subsequent time points in 6-well plates (2 mL/well; 0.2-0.25 x 106 cells/well).\n\t\t\tNOTE: Remember that 2 wells are required per selected time point (1 for RNA and 1 for FACS analysis).\nCollect samples at selected time points. Every 1.5 to 3 h is recommended in order to obtain an adequate profile of the cell cycle progression.\n\t\t\nFor RNA extraction, remove medium, rinse well with 2 mL pre-warm 1x PBS and add 1 mL of suitable RNA isolation reagent (e.g. TRIzol) in the well (perform this last step in a safety cabinet for chemicals). Pipette up and down to detach and lyse cells, transfer cell lysate to a 1.5 mL microcentrifuge tube, incubate 5 min at RT and store tube at -80 °C until further use.\nFor FACS analysis, rinse well with 2 mL pre-warm 1x PBS, add pre-warmed Trypsin-EDTA solution (0.3 mL/well) to detach cells, block Trypsin-EDTA by adding 1 mL complete medium and collect each sample in a separate 15 mL tube.",
    "Centrifuge cells (300 x g, 5 min, RT), save cellular pellet and discard supernatant. In order to fix cells, resuspend cells in 1 mL of chilled 70% (v/v) ethanol in 1x PBS by gently vortexing tubes, and place them on ice for approximately 15 min prior to storing at 4 °C or to staining for further analysis by FACS (described in steps 1.4 - 1.5).\nHU-based synchronization and release of U2OS cells from G1/S boundary\nPrepare complete cell culture medium as described in step 1.1.\nSeed 0.25 x 106 U2OS cells per well in 6 well plates (2 mL complete culture medium per well). In order to calculate the number of wells needed for the experiment, take into account that 2 wells will be required per selected time point (1 well for RNA extraction and 1 well for cell cycle monitoring) and that 2 additional wells of asynchronously growing cells are needed to define FACS analysis compensation settings.\nLet cells attach by incubating 6-well plates overnight (O/N) at 37 °C in a humidified atmosphere with 5% CO2.\nRemove complete medium from wells the following morning and add 2 mL of pre-warmed FBS-free DMEM-Glutamine medium per well. Incubate cells for an additional 24 h at 37 °C in a humidified atmosphere with 5% CO2.\n\t\t​NOTE: Perform this step in all wells except for 2 (those saved to define FACS settings). Serum withdrawal step can be omitted if efficient synchronization is achieved by simply incubating cells with HU.\nG1/S cell cycle arrest with HU.",
    "Prepare fresh HU stock solution (500 mM) prior to each use. Add 2 mL H2O to 76.06 mg of HU powder and mix until thoroughly dissolved. Sterilize the solution by filtration through a 0.2 µm pore size filter. Mix 50 mL of complete medium with 400 μL of filter-sterilized HU stock solution for a final HU concentration of 4 mM.\nRemove medium from all wells except from the 2 wells needed for defining FACS settings and replace with a freshly prepared 4 mM HU-containing complete medium (2 mL/well).\nIncubate cells for 24 h in HU-containing medium at 37 °C in a humidified atmosphere with 5% CO2.\nRelease of cells from HU-mediated arrest. Remove HU-containing medium from wells and rinse wells twice with pre-warmed 1x PBS (2 mL each time). Add 2 mL of complete medium per well. Collect 2 samples for the 0 h time point (1 for RNA extraction and 1 for cell cycle arrest verification by FACS) as well as 2 samples saved for FACS settings. Place remaining wells in the incubator.\nCollect samples every 1.5 to 3 h in order to obtain an adequate distribution of cell cycle progression. At each time point, perform sample processing (for RNA extraction and for FACS analysis) as described in 1.1.8.1-1.1.8.2.\nTreatment with DNA damaging agents",
    "NOTE: Whenever the aim is to elucidate the effect of a compound (e.g. DNA damaging agents) in cell cycle events, any of the previously described synchronization methods can be combined with treatment of cells with the genotoxic agent. In order to select the synchronization method, it is important to consider the phase of the cell cycle that we would like to analyze. In general, Thy-Noc procedure may be suitable to study the effect of a compound in G1 phase or S phase entry while HU-mediated synchronization may be more suitable to study the impact in S to G2 phases or in the entry to mitosis.\n\t\nAnalysis of the effect of genotoxic agents in G1 phase or S phase entry\n\t\t\nSynchronize cells as described in 1.1.2. to 1.1.6.\nRelease cells from nocodazole and re-plate them as described in 1.1.7. Incubate them at 37 °C in a humidified atmosphere with 5% CO2 for 3 h to let them attach prior to adding agent (required incubation period may vary depending on the cell line).\nAdd agent and collect samples as previously described in 1.1.8.\nAnalysis of the effect of genotoxic agents in S-G2 phases or M entry\n\t\t\nSynchronize cells as described in 1.2.2. to 1.2.5.\nRelease cells from HU as described in 1.2.6. and add agent straightaway.\nCollect samples as previously described in 1.8.\nMonitoring of cell synchronization and progression through the cell cycle by propidium iodide (PI) staining and FACS analysis",
    "NOTE: Samples collected at all time points together with those required to define FACS settings can be stored at 4 °C once they have been fixed (as mentioned in 1.1.8.2). Perform staining with PI solution followed by FACS analysis for all the samples of the experiment simultaneously. PI intercalates into the major groove of double-stranded DNA producing a highly fluorescent signal when excited at 535 nm with a broad emission peak around 600 nm. Since PI can also bind to double-stranded RNA, it is necessary to treat the cells with RNase for optimal DNA resolution.\n\t\nPrepare freshly made PI staining solution. A PI stock solution can be prepared by dissolving PI powder in PBS (e.g. 5 mg/mL). Store the stock solution at 4 °C (in darkness). Staining solution is composed of PI (140 μM), sodium citrate (38 mM) and Triton X-100 (0.01% v/v).\nWarm up an appropriate surface (e.g. oven) to 37 °C.\nCentrifuge fixed cells (450 x g, 5 min, RT), decant supernatant (ethanol) and wash once with 1x PBS.\nCentrifuge cells again, remove PBS and add 300 μL of PI staining solution per sample (except to one of the samples for FACS settings; add PBS to this sample instead).\nTransfer cells to FACS Tubes (5 mL round-bottom polystyrene tubes).\nAdd 1 μL of RNase A to each sample, mix and incubate samples for 30 min in darkness at 37 °C. Samples can be stored protected from light at 4 °C for a maximum of 2 - 3 days.\nAnalyze DNA content in samples by flow cytometry. Define FACS analysis compensation settings with PI-stained asynchronous sample. Use blank sample (without PI staining solution) to check for autofluorescence. Basics of PI staining-mediated analysis of DNA content by flow cytometry has been previously described9.",
    "Determination of mitotic index by double phospho-H3 (Ser 10)/PI staining\n\tNOTE: Cells undergoing mitosis can be easily detected by flow cytometry with antibodies specific for phospho-histone H3 in Serine 10 (pH3). A concomitant PI staining is useful to determine DNA content-based distribution of the cell population. 5 samples are required for the optimal configurations of FACS settings: blank, PI-only, pH3-only, secondary antibody-only and double staining.\n\t\nCentrifuge fixed cells (450 x g, 5 min, 4 °C) and discard supernatant. The following steps are described to perform staining in 15 mL tubes.\nWash cells by adding 1 mL PBS-T (PBS + 0.05% Tween-20) to the pellet and centrifuge (450 x g, 5 min, 4 °C). Remove supernatant.\nAdd anti-pH3 antibody diluted (1:500) in 100-200 µL of PBS-T + 3% BSA, and incubate with rocking for 2 h at RT (or O/N at 4 °C).\nAdd 2 mL PBS-T (PBS + 0.05% Tween-20) and centrifuge (450 x g, 5 min, 4 °C). Remove supernatant.\nWash once more by adding 2 mL PBS-T to the pellet, centrifuge and discard supernatant.\nAdd secondary antibody (anti-rabbit AlexaFluor 488 in the case of selected pH3 antibody) diluted (1:500) in 100-200 µL of PBS-T + 3% BSA and incubate with rocking for 1 h at RT (or O/N at 4 °C). Protect samples from light.\nWash twice with PBS-T (2 mL) by centrifugation as described in step 1.5.4.\nPerform PI staining as described (steps 1.4.1 to 1.4.6).\n2. Sample Collection and Processsing for Gene Expression Analysis\nTake 1.5 mL microcentrifuge samples in the RNA isolation reagent out of the freezer and let them thaw at RT inside a safety cabinet for chemicals.\nAdd 400 µL of chloroform to each sample and shake vigorously (but do not vortex) until complete mixing. Incubate samples for 5 min at RT.",
    "Centrifuge tubes for 15 min (≥8,000 x g, 4 °C) in a benchtop microcentrifuge.\nTransfer the aqueous (upper) phase to a new 1.5 mL microcentrifuge tube and register the transferred volume (in order to simplify the procedure, it is recommended to collect equal volumes in all samples of the experiment).\nAdd 1 volume of 100% ethanol slowly (drop by drop) to the aqueous phase while mixing. Do not centrifuge.\nPerform the next steps with the commercial RNA mini prep kit. Pipet up to 700 µL of each sample, including any precipitate that may have formed, into a spin column in a 2 mL collection tube (provided by the manufacturer).\nClose the lid and centrifuge (≥ 8,000 g, RT) for 15 s. Discard the flow-through. Repeat previous step with the remaining sample (if any).\nFollow manufactures´ instructions for RNA washing and elution (elute each sample in 30 - 40 µl nuclease-free H2O in order to achieve an appropriate RNA concentration for next step).\nDetermine RNA concentration and purity of samples by absorbance measurements (a A260/280 ratio of 2.0-2.1 indicates good purity of the RNA sample). Store RNA samples at -80 °C until use for RT-qPCR analysis.\nFor RNA conversion into cDNA and subsequent quantitative-PCR, take 1 µg RNA per sample and prepare retrotranscriptase reaction according to manufacturers' instructions. Obtained cDNA samples can be stored at 4 °C (for a couple of days) or at -20 °C (for longer periods of time).\n\tNOTE: Sample preparation, primer design and other considerations for real time-PCR have been extensively described in the literature22,23.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}