{
  "id": 4424,
  "origin_website": "Bio",
  "title": "Coculture between hMADS and Mouse Adult CM",
  "procedures": [
    "Cardiomyocytes isolationVentricular cardiomyocytes were obtained from 2 to 5 months old male C57BL/6J mice (Janvier) according to the AfCS Procedure Protocols PP00000125 by O’Connell T, Ni Y.Perfusion buffer, digestion buffer, stopping buffers (1 and 2) must be prepared daily.Perfusion buffer and digestion buffer must be warmed to 37 °C prior to use. Prepare the Langendroff perfusion apparatus. The circulating water bath is set so that the outflow from the tip of the cannula is 37 °C. The perfusion system is rinsed with 100 ml of purified water then with the perfusion buffer for at least 5 min and air bubbles are eliminated. 2-5 months old male mice were anesthetized with a solution of pentobarbital (60 mg/kg) and received heparin (200 UI/kg). Heart was excised and perfused on a Langendorff apparatus with calcium-free oxygenated (95% O2, 5% CO2) perfusion buffer at 37 °C. Then, heart was perfused for few minutes with the digestion buffer, the same calcium-free perfusion buffer supplemented with 0.25 mg/ml of liberase blendzyme TM, 0.14 mg/ml of trypsin and 12.5 μM of calcium chloride. Heart was removed, placed in a dish containing stop buffer 1 and further diced into small pieces using small scissors. Auricles and aorta were removed. Cellular dissociation was achieved by gentle mechanical agitation in stopping buffer 1.Cell suspension was transferred to a 15 ml polypropylene conical tube. The plate was rinsed with 2.5 ml of room temperature stopping buffer 1. This washing solution was then added to the cell suspension to reach a final volume of 5 ml. Stop buffer solution 1 contains serum to inactivate proteases. The final calf serum concentration is 5%, and the final calcium concentration is 12.5 µM. Cardiomyocytes were sedimented by gravity for 8-10 min in the 15 ml tubes at 37 °C.",
    "For each tube, the supernatant was eliminated after sedimentation and the pellet was resuspended in 5 ml of stop buffer 2 added to increasing concentration of Ca2+.5 ml of SB2 + 50 µl 10 mM Ca2+ (112 µM) 5 ml of SB2 + 100 µl 10 mM Ca2+ (212 µM)5 ml of SB2 + 25 µl 100 mM Ca2+ (500 µM)5 ml of SB2 + 50 µl 100 mM Ca2+ (1 mM)The viability of freshly isolated CM was assessed by flow cytometry analysis following Annexin V/7AAD staining.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140721/20140721001205_9872.jpgFigure 2. Suffering state of freshly isolated mouse CM (Figeac et al., 2014)Coculture Notes: Freshly isolated mouse cardiomyocytes were cocultured with mesenchymal stem cells in different conditions depending on the parameter to assess. Although most of our experiments were performed with hMADS cells, some of them were done with hMSC from bone marrow generous gift from EFS, Créteil (Acquistapace, et al., 2011). To assess cardiomyocyte reprogramming process, cocultures were placed in DMEM supplemented with 10% FBS, Gentamycine (1/500) and Fungizone (1/100) in a 1:1 ratio, each cell type seeded at 3,500 cells per square centimeter. To prevent physical contact between the two cell types, cell-culture inserts containing a polycarbonate membrane with different pore sizes (from 0.4 µm up to 3 µm pore size) were used. Note: We use a 1 µm pore size insert which allows the diffusion of soluble factors, exosomes and large microparticules as apoptotic bodies to demonstrate that these cell-to cell communication pathways were not involved in the paracrine alteration of mesenchymal stem cells through coculture. We also used 0.",
    "4 µm pore size which allows the diffusion of soluble factors and small exosomes but impedes the transfer of microvesicules and apoptotic bodies to confirm that cell-to cell communication through soluble soluble factors and exosomes did not affect stem cell phenotype and the generation of hybrid cardiac progenitor cells.To measure soluble factors released by MSC during the coculture, each of the two cell types was seeded at 105 cells/ml (ratio 1:1) in a growth medium, containing low amount of fetal calf serum, namely, DMEM supplemented with 0.8% FBS, Gentamycine (1/500) and Fungizone (1/100). As control for these experiments, hMADS and adult cardiomyocytes were seeded at 105 cells/ml of DMEM supplemented with 10% and 0.8% FBS, according the experiments considered. We used 10% FBS concentration to perform experiments on the characterization of cell fusion processes and the phenotype of resulting hybrid cells. We used 0.8% FBS concentration to study secretome changes induced by coculture in order to decrease the risk of contamination by the soluble factors contained in the serum.To determine the communication pathways involved in the paracrine activation of hMADS cells, we performed coculture experiments in presence of several pharmacological compounds. Fresh cocultures were performed in 0.8% FBS DMEM medium during 24 h in presence of 100 mM 18α-glycyrrhetinic acid to inhibit gap junction and 2.5 x 10-8 M Latrunculin A or 5 x 10-8 M Nocodazole, to inhibit tunneling nanotube formation."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}