{
  "id": 10578,
  "origin_website": "Jove",
  "title": "Automated Slide Scanning and Segmentation in Fluorescently-labeled Tissues Using a Widefield High-content Analysis System",
  "procedures": [
    "Tumor specimens were obtained as per the protocol approved by the local institutional review board and ethics committee and conducted in accordance with national regulations. The WHCAS and its associated software used in this article are listed in the Table of Materials.\n1. Importing the Journals\nOpen the associated software.\nDownload the journal suite indicated in the Table of Materials.\nImport the journal suite to a suitable directory by clicking on the main menu heading Journal, selecting Import Journal Suite…, and clicking Import.\n2. Creating Settings for Preview Scan Acquisition\nIn the Plate Acquisition Setup dialog box, go to the Objective and Camera tab. Select 4X as the magnification, 1 as the camera binning, and 2 as the gain.\nInput the settings in Figure 1A under the tab Plate – Slidescanning.\n\tNOTE: These settings have been created to allow the user to view and navigate up to 3 slides. Each slide has been divided into 3 adjacent wells for the easy navigation and 'live' visualization of the tissue slices or cells.\nIn the Sites to Visit tab, fill the wells uniformly with the sites.\nClick on Edit Plate Bottom Settings… and enter the values displayed in Figure 1B.\nUnder the Acquisition Loop tab, enter the desired wavelength (any nuclear stain in this example) for the preview scan. For the best contrast and image-based focusing, use the brightest fluorescent signal (e.g., often a nuclear stain).\n\tNOTE: Staining tissues with a bright stain such as a nuclear stain is recommended since this provides a high contrast compared to the background. Not only will this aid in the sample location, but when imaging more than one fluorophore in the following high magnification acquisition, the brightest color will be used to base the imaging offset of the other colors on.",
    "Enable Shading Correction in Plate Acquisition mode to stitch images together.\nSave these settings as Setting A.\n3. Creating Settings for Slide Acquisition at High Magnification\nIn the Plate Acquisition Setup dialog box, go to the Objective and Camera tab. Select 40X as the magnification, 1 as the camera binning (for the highest digital resolution), and 2 as the gain (to increase the signal and brightness of images).\n\tNOTE: A lower objective magnification setting can be used, but the authors found 40X to be the optimal setting for the analysis of human microglia and macrophages in brain tumor tissue using the Multi-Wavelength Cell Scoring module.\nEnsure all settings for the Plate – Slidescanning and Edit Plate Bottom Settings… tabs are the same as that for Setting A (see step 2).\nIf the images obtained are not crisp, change the Well depth, Plate height, and Plate Bottom Settings to adjust the focus. If there is still an issue with the focus, choose Laser with Image Recovery under the Autofocus options section.\nUnder the Acquisition Loop tab, enter the number of wavelengths present in the sample. Check the Enable laser-based focusing and Enable image-based focusing (for acquisition or laser recovery) options.\nUnder the Autofocus tab, select Focus on plate and well bottom.\nIn the Journals tab, select the options as indicated in Figure 2, ensuring Prevent asynchronous hardware moves is also selected.\nSave these settings as Setting B.\n4. Placing the Slide in the Widefield High-content Analysis System",
    "Press F4 to get the Main Menu. Select Slide Scanning. Click Open Door – Eject Slide and insert slide(s) and the slide adapter (that can hold up to three slides) into the WHCAS (Figure 3A and 3B). Orient the slide with the coverslip facing down and the label on the side of the notch in the slide adapter (Figure 3A).\n\tNOTE: The slides used in this experiment were standard 25 x 75 x 1 mm slides.\nClick on Close Door – Load Slide.\n5. Acquiring a Preview Scan\nUnder the Screening heading, select Plate Acquisition and Control… and Plate Acquisition Setup… and load Setting A.\nUnder the Wells to Visit tab, move to the well containing the sample, using the right-click button on the mouse. Under the Sites to Visit tab, move to different sites with the Live image capture until the cells are located. Manually focus on the sample or use the Autofocus. Use Snap to capture the image.\n\tNOTE: The sample is easier to locate with more sites, and by fitting the sites to the well (see step 2.3).\nOn the main menu, select Preview Slides.\nIn the dialog box that automatically pops up, select the option reflecting how many slides are going to be scanned. Scan one slide at a time. Press OK. Select 4X as the magnification. Press OK. Select Coverslip down (0.17 mm) as the slide orientation (use a correction collar if a different coverslip thickness is used). Press OK. Click Continue.\n\tNOTE: If the user wishes to acquire preview scans for 2 or more slides, each preview scan has to be opened individually prior to the acquisition of the corresponding high magnification image.",
    "Under Load Scan Slide Setting, ensure the Acquisition settings and Calibrations boxes are checked. Press Cancel. When the Scan Slide Settings box reappears, select Continue.\nWhen the Scan Slide dialog box appears, adjust the settings as suggested in Figure 4A-4C. Select Close when finished.\n\tNOTE: Increasing the camera binning and decreasing the camera exposure time will result in faster scanning, albeit at a lower digital resolution and dynamic range, respectively, hence decreasing the image quality. Shading correction will ensure a uniform intensity across a single field of view. Turning on Hardware and Image Autofocus will ensure the scan is in focus but will slow down the scanning. In the interest of saving time, it is recommended to have Shading correction and Hardware and Image Autofocus off while acquiring the low magnification scan, but to have these options turned on for step 6 during the high magnification imaging. The resolution of the low magnification scan will not affect the resolution of the high magnification scan.\nSelect a directory for the slide scanning data. Click OK. Enter a name for the file. Click OK.\nThe Draw Region dialog box will automatically appear. Use the Rectangular Region tool (Figure 5A) to select the entire preview scan region as shown in Figure 5B. Click Continue.\nThe Setup Complete dialog box will appear. Select Continue.\n\tNOTE: The preview slide scan will now commence.\nWhen the preview is completed, the Scanning Complete dialog box will appear. Select Continue. Do not close the preview scan window (in this example the DAPI Scan window; see Figure 6).\n\tNOTE: The setup and low magnification scan acquisition process will take approximately 20 min. The subsequent high magnification image acquisition time will depend on the number of sites chosen as well as the exposure times for each channel.",
    "6. High Magnification Scanning\nLoad Setting B.\nDetermine which wells are to be imaged. Under the Wells to Visit tab, move to the well containing the sample, using the right-click button on the mouse.\n\tNOTE: The technique is demonstrated here by imaging Well 1.\nUnder the Sites to Visit tab, move to different sites with the Live feature until the cells or tissue is located. Manually focus on the sample or use the Autofocus. Use Snap to capture the image.\n\tNOTE: To aid in locating the sample at a high magnification, use the Plate Acquisition and Control dialog box to adjust the Step size anywhere from 5 to 100 µm to find the sample if Autofocus cannot.\nUnder the W1 DAPI tab, click Auto Expose. Ensure the Plate Acquisition Snap - DAPI image is crisp.\nUnder the main menu, click on Journal to reveal the pull-down. Select Run Journal….\nDouble-click on the Slide Region Acquisition Setup journal to launch it. When the Setup Slide Region Acquisition dialog box appears, select Continue.\nWhen instructed, properly select the DAPI Scan to select the low-magnification slide image. Press OK. Similarly, highlight the Plate Acquisition Snap - DAPI when asked for the plate acquisition snap. Click on OK.\nWhen the Create or Load Regions box appears, use the Rectangular Region tool to select (a) region(s) of interest on the DAPI Scan (Figure 6). Press Continue.\n\tNOTE: The maximum area that can be selected at 40X is 45 columns by 35 rows. If multiple regions of interest are selected, the regions will be resized to the box with the greatest area. The boxes can be repositioned after the resizing.\nSelect No under the Load Regions dialog box.\n\tNOTE: Selecting Yes loads previously saved regions for batches of slides with the same region of interest locations.",
    "Using the Locator tool, highlight the largest region of interest and press Continue under the Select Region dialog box. When the Confirm regions box appears, select Continue. Decide whether the region needs to be saved when the Save Regions dialog box appears.\nThe next dialog box, Site Spacing, allows the user to choose Tiled, which results in an image with no overlap, or 10% overlap. Choose an option and click OK. The authors chose Tiled.\nThree dialog boxes will appear now. The Setup Complete box can be dismissed by pressing Continue. Keep the Acquisition Site Setup for 40X box (Figure 7A) open for now since it makes clear how many columns and rows need to be entered into the Plate Acquisition Setup box (Figure 7B). Keep the WellPositions box (Figure 7C) that appears in the bottom left-hand corner open for the duration of the imaging.\nIn the Plate Acquisition Setup box, under Wells to Visit, the same number of wells as regions of interest previously selected must be highlighted (Figure 7D).\n\tNOTE: The authors developed this protocol for a maximum of nine regions of interest per slide. If there are more, simply increase the number of columns or rows in the Plate - SlideScanning tab to reflect the number of regions of interest. These wells do not spatially represent the location of the regions of interest in any way, but the appropriate number must be highlighted (left-click).\nIn the Plate Acquisition Setup box, go to the Sites to Visit tab. Enter the suggested columns and rows (Figure 7B). Remember to click on Tile sites.",
    "To eliminate the guesswork of finding the sites containing the sample, press Acquire Plate under the Summary tab to position the stage at the pre-selected region of interest. Once the camera pans over a site containing cells, press Cancel at the bottom right-hand corner to stop the image acquisition. Ensure the stage is now located over the sample.\nOptimize the wavelength settings to ensure that a focused and a high dynamic range image is obtained. When satisfied, click on the Summary tab and Acquire Plate.\n7. Image Analysis\nSelect the desired custom module.\n\tNOTE: The authors chose the Multi-Wavelength Cell Scoring module to demonstrate an automated segmentation of the brain tumor slides.\nRun the analysis on all sites. If the analysis parameters are the same for many slides, the analysis can be included in the Plate Acquisition Setup box under the Post Acquisition tab.\nOnce the analysis is finished, exclude any sites of poor image quality so as not to bias the results. Since the goal of this analysis is to quantify microglia and macrophages in the tumor parenchyma, select the region of interest within the tumor sample's edges. Furthermore, exclude the sites that are out of focus and/or contain tissue folds or bubbles and tears in the tissue. For a demonstration, see the Representative Results. Alternatively, use the Laser focus score generated for each site depending on the amplitude of the laser reflection as a threshold below which sites are to be excluded (the threshold is customizable and depends on parameters such as the exposure time and the type of media used).",
    "NOTE: The high magnification images make it possible to specifically exclude structures, such as large blood vessels and areas of necrosis, if necessary. It is also possible to include only areas of interest, such as those that are hypercellular. This way, the specificity and accuracy of the analyses can be increased."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}