{
  "id": 2938,
  "origin_website": "Cell",
  "title": "Protocol to package and concentrate adeno-associated virus serotype 8 for use in autochthonous mouse models of pancreatic cancer",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing 293T cells – Day 0\nTiming: 0.5–1 h\nPlate 3.5∗107 293T cells in a 15cm plate in DMEM containing 10% FBS (without antibiotics).\nNote: We passage cell in 1:3 ratio and the next day it could reach 90% confluency. Also, we perform routinely mycoplasma detection per month.\nNote: Cells should reach 80%–90% confluency at the time of transfection.\nNote: Never allow cells to reach 100% confluence, if they do, rethaw a new vial of cells to ensure a good yield of AAV8.\nNote: Cell state plays an important role in AAV8 production. Use 293T cell of fewer than 20 passages.\nPackage AAV8 – Day 1\nTiming: 0.5–1 h\nThe next day, check 293T cell state by microscope. If 293T cells have reached 80%–90% confluency, warm DMEM and 1 mg/mL PEI-MAX at room temperature for 30 min.\nIn a 15 mL tube, prepare a plasmid mixture for one 15 cm plate by adding the following amounts of plasmid into pure DMEM to give a final volume of 2 mL.\n  22 μg pHelper.\n  14.3 μg pAAV8.RepCap.\n  13.7 μg pAAV_sgGOI_sg3TSG_Cre.\n  Vortex for 15 s and centrifuge briefly.\nIn another 15 mL tube, add 0.15 mL of 1 mg/mL PEI Max to 0.85 mL pure DMEM for a final volume of 1 mL (a ratio of 3 μg PEI Max to 1 μg DNA). Mix well by vortex 15 s and centrifuge briefly.\nPlace the two 15 mL tubes at RT for 5 min and then add PEI-MAX to the plasmid mixture and pipet up and down several more times.\nAfter incubating at RT for 20 min, slowly drop the transfection mixture into the dish of 293T cells and mix well by gently rocking the cell plates.",
    "Note: We add 50 μg of total DNA per 15 cm plate, maintaining a molar ratio of 1:1:1 among the three plasmids. The length of each plasmid: 11.6 kb for pHelper, 7.4kb for pAAV8.RepCap, and 7.6 kb for pAAV_sgGOI_sg3TSG_Cre.\nCritical: The plasmid preparations should be of high quality, without RNA contamination and with high concentrations. We recommend use EndoFree Maxi Plasmid Kit (TIANGEN, cat #4992438) according to the manufacturer’s instructions (https://en.tiangen.com/upload/file/20220509/20220509165013_17820.pdf[href=https://en.tiangen.com/upload/file/20220509/20220509165013_17820.pdf]). Usually, we isolate plasmid DNA of the highest purity from 100–200 mL of bacterial culture and could yield up to 1 mg transfection grade plasmid DNA.\nChange culture media – Day 1\nTiming: 0.5–1 h\n12–16 h after transfection, prewarm complete DMEM media containing serum and antibiotics for 30 min at 37°C.\nReplace the DNA-containing transfection media by gently adding the fresh media, taking care to avoid disturbing the transfected 293T cells.\nCulture cells for another 48 h.\nCritical: If the monolayer of 293T cells is disturbed, the yield of AAV8 will decrease greatly. To prevent this, the lowest speed setting should be used for pipetting, and the pipette should be against the sidewalls of the culture dish when dispensing medium.\nHarvest AAV8– Day 3\nTiming: 1.5–2.5 h\nAround 72 h after transfection, the AAV is harvested. The harvest is divided into two parts, one for the culture media and one for the cells.\nFor culture media: transfer the supernatant into a 50 mL tube and centrifuge at 800 × g for 10 min at 4°C then filter supernatant through 0.45 μM syringe filter into a new 50 mL tube and store at 4°C (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2477-Fig2.jpg\nFigure 2. Harvesting and concentration AAV8\n(A) Collection of 293T culture media 3 days after transfection with AAV packaging plasmids.\n(B) Cell pellet after three rounds of freeze/thaw cycles.",
    "(C) Culture media and supernatant from cell pellet after adding 1/3 mixture volume of concentrator.\n(D) AAV suspension after overnight rocking in the presence of concentrator.\n(E) Representative photograph of AAV and cell debris pellet.\n(F) Representative photograph of viral pellet after concentration.\n(G) Viral pellet after resuspension.\nFor the cultured cells: harvest the cells from the 15 cm plate by directly adding 5 mL lysis buffer per plate. Gently pipet the transfected 293T cells and collect the cell suspension in a 15 mL tube.\nRelease AAV8 particles by freeze/thaw cycles: place the 15 mL tube of cell lysate in −20°C freezer (freeze) for 10 min and then thaw in a 37°C water bath for another 10 min.\nRepeat freeze/thaw cycle two more times.\nTo remove cell debris, spin down the cell lysate at 3,000 × g for 10 min at 4°C (Figure 2[href=https://www.wicell.org#fig2]B).\nCarefully transfer the supernatant of cell lysate into the 50 mL tube of filtered culture media.\nAdd 1 volume of concentrator to 3 volumes of supernatant mixture (Figure 2[href=https://www.wicell.org#fig2]C).\nMake sure the lid of 50 mL tube is firmly closed and then incubate with constant rocking at least 12 h at around 60 RPM in 4°C freezer (Figure 2[href=https://www.wicell.org#fig2]D).\nCritical: Gently pipet up and down several times or vortex briefly (5 s) between each freeze and thaw reaction to avoid precipitation of the solution. Use low-binding pipette tips to prevent AAV stick to tip and then reducing AAV8 titer.\nConcentration of AAV – Day 4\nTiming: 1.5–2.5 h\nThe next day, spin down the mixture in the 50 mL tube at 1,600 × g for 60 min at 4°C (Figure 2[href=https://www.wicell.org#fig2]E).\nCarefully remove supernatant using electric suction apparatus, making sure not to disturb the pellet (Figure 2[href=https://www.wicell.org#fig2]F).",
    "Thoroughly resuspend the viral pellet into 600–1,000 μL recovery solution (Figure 2[href=https://www.wicell.org#fig2]G) and transfer into a new low-binding 1.5 mL EP tube.\nIncubate with constant rocking at around 60 RPM for at least 4 h at 4°C.\nCentrifuge 3 min at 13,000 × g, 4°C to remove cellular and protein debris.\nTransfer the clarified supernatant to a new 1.5 tube.\nAliquot AAV8 at 25–50 μL and store at −80°C until use. Avoid repeated freeze-thaw cycles. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nNote: Addition of 0.001% Pluronic F68 can prevent AAV8 aggregation during storage in the freezer.\nCritical: The suspension volume of recovery solution can be adjusted based on the following principle: the lower the volume, the higher the AAV8 titer. However, do not use less than 600 μL recovery solution in order to make sure the pellet is fully resuspended.\nPhysical titer determination of AAV8 – Day 5\nTiming: 3–4 h\nThe next day, AAV8 titer is determined using the following steps:\nPrepare a standard curve:\nPrepare pAAV_sgGOI_sg3TSG_Cre plasmid solution at 10 ng/μL to generate a standard curve.\nMake 7 serial dilutions, in duplicate, of your standard curve plasmid.\ntable:files/protocols_protocol_2477_4.csv\nPrepare AAV8 dilution sample:\nDilute one aliquot of AAV8 from −80°C by dilute 2μL AAV8 into 198μL ddH20 (100-fold) Pipet up and down for several times.\nDilute 10μL of this first dilution into 190μL ddH2O to make a 2000-fold dilution. Pipet up and down for several times and load into 384 well plate.\nPrepare qPCR master mixture as follow:\ntable:files/protocols_protocol_2477_5.csv\nDispense the master mix into the wells and seal plate with transparent film.\nCentrifuge briefly in a mini centrifuge to bring the sample to the bottom of the tube.",
    "Perform the following qPCR program: 98°C 10 min / 98°C 15 s / 60°C 30 s / 72°C 30 s /read plate/ repeat 39× from step 3 / melt curve\nAnalyze qPCR data by plotting standard curve and calculate the AAV8 physical titer.\nAn example is shown in Figure 3[href=https://www.wicell.org#fig3]A and Table 1[href=https://www.wicell.org#tbl1]. Troubleshooting 2[href=https://www.wicell.org#sec6.3] and 3[href=https://www.wicell.org#sec6.5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2477-Fig3.jpg\nFigure 3. AAV8 physical and biological titration\n(A) Example of valid 8-point pAAV8_sgGOI_sg3TSG_Cre plasmid standard curve.\n(B) Example of in vitro biological titration assay. ASFs were transduced with 2.5 μL AAV_sgRosa_sg3TSG Cre in 0.5 mL complete media, resulting in approximately 15.4% GFP-positive ASFs after 72 h transfection (right panel). Left panel is control.\n(C) Example of in vivo biological titration assay. We set four dilutions of AAV_sgRosa_sg3TSG Cre and injected IP into LSL-Cas9eGFP mice. Upper panels show flow cytometry of GFP in the pancreas 7 days post infection. Histology analysis of GFP is shown in lower panels. Control is mice without AAV infection. Scale bar = 100 μm.\ntable:files/protocols_protocol_2477_6.csv\nNote:\nSize in bp of pAAV_Cre_sgGOI_sg3TSG: 7,577 bp.\nNote: qPCR primers target WPRE, sequences shown in key resources table[href=https://www.wicell.org#key-resources-table].\nCritical: Do not forget to include a no-template control (NTC = master mix + water). The dilution should be pretested to determine a proper dilution within the qPCR standard curve. In the case of virus produced using AAV_sgGOI_sg3TSG_Cre, we dilute to 2000-fold. Please note that different pAAV_Core constructs can produce varying amounts of virus, depending on a variety of factors including genome size. The appropriate dilution should be determined empirically for each new construct packaged.\nAccording to the qPCR result, the Ct values of pAAV_sgGOI_sg3TSG_Cre with dilution of 2000 are 19.72, 19.77 and 19.64, so the concentration of pAAV_Cre_sgGOI_sg3TSG is 1.5379858 ng/mL. Based on this, we calculate AAV physical titer as below:\nTransduction test",
    "Titer AAV using qPCR is a very sensitive method, but ITR recombination could cause AAV8 inactivation which cannot be distinguished by qPCR. Consequently, we recommend performing transduction assays to test the infectivity of the AAV8 prior to performing experiments.\nAccording to experimental needs, you could choose from two alternative transduction assays:\n  1) The easiest way to test whether the AAV8 produced is functional is to directly infect adult skin fibroblasts (ASF) isolated freshly from mouse ear or tail.17[href=https://www.wicell.org#bib17]\n  2) Most applications of AAV8-mediated pancreatic tumorigenesis require specific infection rates. For example, when comparing the effects of a GOI knockout to a control (sgGOI vs sgRosa), for the results to be interpretable it is essential to achieve comparable infection rates for the two AAVs. We have found that the most reliable way to achieve this is to first titer the virus by testing infection of the pancreas in vivo. However, this method is time-consuming and increases the number of animals used.\nAlternative 1: In vitro biological titration assay – Day 5–7 (optional)\nTiming: 5–7 days\nIsolate ASF from Rosa-26-LSL-Cas9-eGFP mice.18[href=https://www.wicell.org#bib18]\nPlate 15,000 ASF per well in a 24 well plate.\nImmediately after plating, thaw one aliquot of the AAV viral stock at −80°C on ice.\nDilute AAV in complete media plus polybrene (1:1000, 4 mg/mL stock). In general, a dilution range from 100-fold to 2000-fold is acceptable, although this will depend on viral titer.\nAdd 500 μL of virus-containing media to 24 well.\nAt 24 h post-transfection, remove virus-containing media and replace with pre-warmed complete media.\n72 h later, analyze GFP expression level of infected cells using flow cytometry.\nCalculate the titer, transduction units (TU)/mL:\nT\nr\na\nn\ns\nd\nu\nc\nt\ni\no\nn\nU\nn\ni\nt\ns\n(\nT\nU\n)\n/\nm\nL\n=\n(",
    "#\no\nf\nc\ne\nl\nl\ns\na\nt\nT\nr\na\nn\ns\nd\nu\nc\nt\ni\no\nn\n)\nx\nD\ni\nl\nu\nt\ni\no\nn\nF\na\nc\nt\no\nr\n)\n(\nT\nr\na\nn\ns\nd\nu\nc\nt\ni\no\nn\nV\no\nl\nu\nm\ne\ni\nn\nm\nL\n)\nA sample AAV8 in vitro biological titer is shown in Figure 3[href=https://www.wicell.org#fig3]B. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\n15,000 ASFs were transduced with 2.5 μL AAV_sgRosa_sg3TSG Cre in 0.5 mL complete media, resulting in approximately 15.4% GFP-positive ASFs after 72 h transfection, so we calculate AAV8 in vitro biological titer as below:\nT\nr\na\nn\ns\nd\nu\nc\nt\ni\no\nn\nU\nn\ni\nt\ns\n=\n15000\n∗\n15.4\n%\n∗\n200\n0.5\n=\n9.24\n∗\n10\n5\nT\nU\n/\nm\nL\n.\nCritical: For accurate titer, the infection rate should be lower than 20% 72 h post transduction. Therefore, infecting with several dilutions is recommended. The adult skin fibroblasts should be in a good state and growing exponentially to obtain optimal AAV infection.\nAlternative 2: In vivo biological titration assay – Day 5–13 (optional)\nTiming: 5–13 days\nThaw one aliquot of the AAV viral stock at −80°C on ice.\nAccording to the previous qPCR result, dilute the AAV stock with recovery solution to three dilutions: 1.85∗109 viral genomes, 9.25∗109 viral genomes and 3.7∗1010 viral genomes per mice in 200 μL volume.\nGently pipette up and down the virus several times.\nWeigh mice and inject AAV intraperitoneally.\nSeven days post AAV injection, euthanize mice and collect the pancreas tissue.\nIsolate pancreas into single cells19[href=https://www.wicell.org#bib19] to detect the GFP expression of pancreas by flow cytometry. Troubleshooting 5[href=https://www.wicell.org#sec6.9].",
    "An example of flow and GFP IHC data is shown in Figure 3[href=https://www.wicell.org#fig3]C.\nCritical: When titer Cre-expressing AAV (For example, AAV_sgGOI_sg3TSG_Cre), it is necessary to use a mouse strain harboring Cre-inducible fluorescence to estimate infection rate. In the case described here, we use Rosa-26-LSL-Cas9-eGFP mice. Mice aged 6–10 weeks are optimal for AAV injection.\nGene editing efficiency assay (optional)\nTiming: 2 days\nAt the appropriate time point (for in vitro, 3 days post AAV8 infected, for in vivo, 7 days post AAV IP into mice), use fluorescence activated cell sorting (FACS) to sort transfected pancreatic cells (in the case of LSL-Cas9-eGFP mice infected with pAAV_sgGOI_sg3TSG_Cre, GFP-positive cells are sorted).\nExtract genomic DNA using QuickExtract™ DNA Extraction Solution 1.0 (1 μL Quick Extract buffer per 1,000 cells).\nDesign PCR primers and perform PCR according to TIDE website’s instructions.20[href=https://www.wicell.org#bib20]\nPurify PCR product from DNA gel and send for Sanger sequencing.\nLoad Sample/control chromatogram into TIDE (http://shinyapps.datacurators.nl/tide/[href=http://shinyapps.datacurators.nl/tide/]) and calculate the percentage of indels.\nExample TIDE results of in vitro & in vivo biological titration assay is shown in Table2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_2477_7.csv\nNote: sgRNA sequence and TIDE primer is shown in key resources table[href=https://www.wicell.org#key-resources-table]."
  ],
  "subjectAreas": [
    "Flow Cytometry",
    "Crispr",
    "Cancer",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Genetics",
    "Molecular Biology",
    "Gene Expression"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}