{
  "id": 5322,
  "origin_website": "Bio",
  "title": "<em>Ex vivo</em> Culture of Fetal Mouse Gastric Epithelial Progenitors",
  "procedures": [
    "Notes: General considerations regarding mice and pregnancies: Animals should be housed in a temperature (21 ± 1 °C) and humidity (55 ± 10%)-controlled room with a 12 h light/12 h dark cycle. Embryonic stage is calculated as embryonic day 0.5 (E0.5) the day the gestational plug is observed. It is important to remove the male from the mating cage the morning the plug is observed. Pregnancies can be followed by daily weighing of the females. Unless specified, steps are carried out at room temperature (RT).Dissection procedures and preparation of samplesIsolation of gastric fetal epithelium for culture (Figure 1)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102183638_5352.jpgFigure 1. Overall procedure schematic of step A1General preparations before starting the dissectionSterilize working area and dissection tools with 70% ethanol. It is not necessary to work under laminar flow, meanwhile all the steps are carried out carefully and in a clean disinfected area. It is recommended to maintain dissection tools in a glass with 70% ethanol during intermediate steps of the dissection protocol to minimize contamination.Equipment: binocular and cold light source (Figure 2).Dissection tools: scissors, curved forceps, standard tip forceps, scalpel, dissection bed. Box with ice, plastic Petri dishes, embryos medium (conserved on ice), tubes with ice cold DPBS (volume according to developmental stage and number of embryos pooled – see Table 1 below and Figure 2).Table 1. Recommended volumes (DPBS or DPBS-EDTA 5 mM or Stem Pro Accutase) for different amounts of processed tissuesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102184431_2940.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102184529_5757.jpgFigure 2. Example of equipment (a) and material and dissection tools (b). a. Binocular and cold light source; b. Material and dissection tools needed for embryos dissection: tubes with DPBS, Petri dish with embryos media, scalpels and straight thin tip forceps.Euthanize the pregnant female according to the local institutional guidelines at the desired developmental stage: E14.5-E18.5.",
    "Note that visual discrimination between proximal and distal stomach areas is difficult before E14.5. Beyond E18.5 stage, spheroid yield decreases.Lay the pregnant female on its back and fix her to the dissection bed. Spray the abdominal area with 70% ethanol in order to sterilize the area and minimize further contamination (Figure 3a). Grasp the skin with angled forceps and cut transversally through the skin and peritoneum at the level of the lower abdomen enough to visualize the uterus. Uterus can be recognized as a string of pearls. Dissect out with forceps the oviduct removing the entire uterus (Figures 3b-3h).Place the uterus with embryos on a Petri dish filled with ice-cold embryo’s medium (see Recipes section) maintained on ice (Figure 3i).Separate each embryo from the uterus with the intact yolk sac using angled serrated tip forceps (Figure 3j).Place one of the embryos on an empty Petri dish under the binocular with cold light source. Keep the rest in the medium on ice (Figure 3k). It is recommended to perform steps A1h-l under the binocular.Open the yolk sac using fine straight tip forceps. Be careful not to damage the embryo’s abdomen when separating the umbilical cord (especially at E14.5-15.5 stages), as sometimes this may pull out the internal digestive tract and compromise the rest of the dissection (Figure 3l). At this point, check that the morphological embryo’s developmental stage corresponds with the one estimated by the observed vaginal plug.Place the embryo on its left side up and open the abdomen pulling up the skin (be careful: at early developmental stages – E14-15 the tissue is very soft and might be easily damaged). Visualize space between ribs and legs. Recognize liver-intestine-stomach block and pull it out carefully with straight thin tip forceps (Figure 3m).",
    "Separate the stomach from the block by ‘cleaning away’ the other organs of no interest (intestine, liver, pancreas and esophagus) using ice-cold DPBS (Figure 3n).To obtain higher yield of fetal spheroids, it is recommended to remove the proximal area of the stomach and continue the protocol with the distal part (Figure 3o). Note: The elements growing in culture from the proximal part correspond to ‘squamous-like’ organoids, higher proportion of hollow fetal spheroids is obtained from the distal area (Fernandez Vallone et al., 2016).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102184701_5847.jpgFigure 3. Representative pictures of embryonic stomach dissection at E18.5. Successive steps are detailed (a-o). Duo: duodenum, Em: embryo, Eso: esophagus, Liv: liver, Pan: pancreas, Per: peritoneum, SI: small intestine, Spl: spleen, Sto: stomach, Uc: umbilical cord, Ut: uterus, Ys: yolk sac. Scale bars: 0.5 cm (l-m); 0.1 cm (n-o).Cut into small pieces the distal part of the stomach with the scalpel.Transfer the tissue to a tube containing sterile ice cold DPBS and place it on ice.Continue the dissection of the rest of the embryos always keeping the tissue already processed on ice. Centrifuge the tubes at 230 x g for 5 min, 4 °C.Re-suspend the pellet of each embryo or pool with the adequate volume of sterile 5 mM DPBS-EDTA (see Table 1).Place the tubes laid down on ice and incubate them in the shaker for 30 min with 75 rpm agitation speed.Centrifuge the tubes at 230 x g for 5 min, 4 °C.From this step onward, the protocol should be carried out under a tissue culture hood. Remove supernatant by aspiration and re-suspend each pellet in the adequate volume of sterile DPBS (see Table 1).Pipet up and down samples using FBS-coated micropipette (P1000) to disrupt the tissue and further separate the epithelium from the basal layer in contact with mesenchyme.",
    "The number of up and down pipetting times depends on the tissue developmental stage and on the number of embryos processed per sample. For example, tissues from E14-E15 individual embryos are pipetted 12 times whereas tissues from E16-E18 individual embryos or pools of embryos are pipetted between 15 and 20 times.Pass each suspension through a 70 µm filter into a new tube.Centrifuge the tubes at 300 x g for 5 min, 4 °C. Remove supernatant. Pellet is ready to be seeded in culture (see step B).Note: These steps allow isolating gastric fetal epithelium as clumps or group of cells that will ultimate give rise to gastric fetal spheroids in culture. However, gastric fetal spheroids can also be obtained from isolated single cells after FACS for example. In that case the user of this protocol should follow step A2 instead of step A1 (see below). Isolation of gastric fetal epithelium as single cells (Figure 4)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102190205_2163.jpgFigure 4. Overall procedure schematic of step A2Follow protocol described in section A from step 1a to step 1o. Re-suspend the pellet in Stem Pro Accutase cell dissociation reagent, using volumes as described in Table 1.Transfer each suspension to a P6 well plate and incubate it at 37 °C with 75 rpm agitation. Time of incubation varies according to the quantity of initial material (between 30 min to 2 h). It is recommended to check the dissociation every 15 min under the inverted microscope and to help this process with mechanical up and down pipetting (micropipette P1000). When single cell suspension is reached, pass it through a 40 µm filter into a new tube.Centrifuge the tubes at 300 x g for 5 min, 4 °C. Remove supernatant and re-suspend the pellets in 2 ml ice cold 2 mM DPBS-BSA 2%-EDTA solution to wash.Repeat step A2f twice.",
    "Finally re-suspend the single cell preparation in 1 ml 2 mM DPBS-BSA 2%-EDTA. Maintain the cell suspension on ice and proceed with staining steps or direct sorting in case of fluorescent protein expression. It is recommended to pass the suspension through a 40 µm filter once again before sorting.Single cells of interest can finally be centrifuged at 300 x g for 5 min, 4 °C. Remove supernatant and if desired, proceed with sample seeding for ex vivo culture.Ex vivo culture – 3DGeneral preparations before startingDefreeze Matrigel aliquots on ice and always keep them on ice, small changes in the temperature might accelerate undesired polymerization.The surface of plating and amount of Matrigel will be chosen for each sample based on the size of the pellet obtained in step A. For individual samples obtained from embryos at E14-18 or sorted samples, it is recommended to use 1 well of 12 wells plate and 100 µl of Matrigel per pellet. For pooled samples obtained after step A1, 1 well of 6 wells plate and 240 µl Matrigel per pellet will be preferred. All these estimations may change according to the user’s plans and needs.Re-suspend the pellet in the tube with the adequate amount of Matrigel and homogenize the suspension on ice.Transfer the mix sample/Matrigel suspension to the plate as a drop. Stretch the drop from the center until the bottom of the well is covered without touching the walls (use a tip for this purpose) (Figure 5a).Place the plate in an incubator at 37 °C for 10 min until the mix polymerizes. Distribute the Spheroids-ENR medium for initial seeding (see Recipes section): 700 µl per well (12 well plate) and 1.4 ml per well (6 well plate). Place the plate in the incubator.",
    "Medium should be fully changed every other day with ENR medium for maintenance (see Recipes section).Note: All steps, including the decision of plating according to density of sample should be followed by observation under inverted bright field microscope. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102193509_2746.jpgFigure 5. Spheroids initial seeding. a. Scheme showing side and upper view of the 3D culture; b. Representative pictures of gastric spheroids culture at day 6, arrows show dead cells inside the spheroids (b). Scale bars = 100 µm.Maintenance of gastric spheroidsGeneral preparations before startingAfter 5 to 7 days in culture (depending on the rate of growth), when few dead cells start to accumulate inside the spheroids, they should be replated (Figure 5b). This can be done by ‘picking’ selected elements (amplify selected population) (step C2) or by harvesting a complete part of the well (just culture maintenance) (step C3). See below details (Figure 6) for each case.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170102/20170102194356_5555.jpgFigure 6. Procedure for maintenance of gastric spheroids. Fully grown spheroids are isolated from the Matrigel, mechanically dissociated into small groups of cells, which are then mixed with a new Matrigel aliquot and seeded. The ENR seeding medium is added after Matrigel polymerization.Replating by element selectionSelect elements to be picked under the inverted microscope.Prepare one tube per sample with 1 ml DPBS at room temperature, pick the elements from the well (1 ml DPBS for 12 well plate) with a micropipette (P200) and transfer them to the tube with DPBS. Repeat the process for all the desired elements.Centrifuge the tube at 300 x g for 5 min.Remove supernatant and re-suspend the elements in 0.3 ml DPBS. Disrupt the elements mechanically by pipetting up and down with a micropipette (P200) until visual disappearance of big pieces.Add 1 ml DPBS to further wash the suspensionCentrifuge the tube at 300 x g for 5 min.",
    "Remove supernatant and re-suspend the pellet in the adequate volume of Matrigel as described in step B.Repeat steps B3-B7.Replating without selectionRemove the medium from the well by aspirating.Add 1 ml DPBS to the well (P6 or P12 well plate) and harvest the whole Matrigel with the elements embedded by pipetting up and down with a micropipette (P1000) until homogeneous suspension is reached. Take 0.25 ml from the suspension (¼) and transfer it to a new tube. It is not recommended to replate the whole well unless specific need for spheroid amplification. A too high density of replating would result in too much material and debris, ending with a bad quality of replating.Add 1 ml DPBS to the tube and centrifuge it at 300 x g for 5 min.Remove supernatant and re-suspend the elements in 0.3 ml DPBS. Disrupt the elements mechanically by pipetting up and down with a micropipette (P200) until visual disappearance of big pieces. Add 1 ml DPBS to further wash the suspension.Centrifuge the tube at 300 x g for 5 min.Remove supernatant and re-suspend the pellet in the adequate volume of Matrigel as described in step B.Repeat steps B3-B7.Cryopreservation of gastric spheroidsFreezing protocolRemove the medium from the well by aspirating.Add 1 ml DPBS to the well and harvest the whole Matrigel with the elements embedded pipetting up and down with a micropipette (P1000) until homogeneous suspension is reached.Centrifuge the tube at 300 x g for 5 min.Wash the pellet in 2 ml DPBS.Centrifuge the tube at 300 x g for 5 min.Re-suspend the pellet in 1 ml of freezing medium (see Recipes section).Transfer the suspension to a labeled cryotube and place it in the Cryo freezing container (filled with isopropanol at RT). Put the container in a -80 °C freezer.",
    "After 48 h, cryotubes can be stored in a cryostorage system in liquid nitrogen.De-freezing protocolWarm at 37 °C a tube with 2 ml of de-freezing medium (see Recipes section).Take out from liquid nitrogen the selected cryotube and de-freeze the sample by pipetting up and down with pre-warmed de-freezing medium.Transfer all the spheroid suspension to the pre-warmed tube and centrifuge at 300 x g for 5 min.Remove supernatant and wash the pellet in 2 ml of BCM medium twice and centrifuge it at 300 x g for 5 min.Remove supernatant and re-suspend the elements in 0.3 ml DPBS. Disrupt the elements mechanically by pipetting up and down 20 times with a micropipette (P200).Add 1 ml DPBS to further wash the suspension.Centrifuge the tube at 300 x g for 5 min.Remove supernatant and re-suspend the pellet in the adequate volume of Matrigel as described in step B."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}