{
  "id": 5815,
  "origin_website": "Bio",
  "title": "Touchscreen-based Visual Discrimination and Reversal Tasks  for Mice to Test Cognitive Flexibility",
  "procedures": [
    "Animal Ethics Approval: Researchers must determine ethical approvals required and maintain compliance with relevant university and government guidelines regarding the care and use of laboratory animals prior to starting experiments. Operant trainingPrior to training, mice are exposed to the strawberry milk reward by providing small amounts (~0.5 ml) in the home cage. A small autoclavable container (e.g., 50 ml Falcon tube lid) was half filled with milk and placed in the home cage for three consecutive days before training commenced. Mice may bury the lids rather than consume the milk initially, however three days seems sufficient to introduce the reward and reduce neophobia.Prior to transporting the mice the operant chamber equipment should be checked and prepared for testing. The mask should be placed over the touchscreens and the reward lines should be primed with fresh strawberry milk.Mice are then transported to the dimly lit (< 10 lux) testing room in their home cages and allowed 30 min to habituate each day before testing.The data and program are loaded on the computer, and then each mouse is placed into the correct operant chamber for testing. Mice are always tested in the same operant chamber because contextual changes can impair learning. Testing should occur at the same time each day and for at least 5 days per week. Feeding should also occur at the same time each day, but at least 1 h after testing has finished.Training stagesSeveral steps (5 pre-training and 2 task steps) are used during training. Mice can pass to the next step if the criteria were fulfilled. The training parameters and criteria to move to the next stage are shown in Table 1. The image that is rewarded should be counterbalanced within each treatment group, but constant for an individual mouse.",
    "Within each group, half of the mice are required to respond to one or the other stimulus to receive rewards. We have used one session per day, but multiple sessions can be run in a day, depending on the number of animals in a cohort or on the number of chambers that are available. Therefore, criteria are based on the number of sessions completed.Table 1. Parameters and criteria for the training stagesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171018/20171018201656_5493.jpgPre-training: HabituationThe mice learn to collect rewards from the illuminated magazine. The reward is pumped for 6,000 msec (approx. 150 μl) and the magazine light is illuminated. Once the head entry is detected, the light turns off and after the head is removed the inter-trial interval (ITI) begins (10 sec). After the ITI, a single reward (280 msec) is delivered and the magazine light illuminated, start the cycle again (Figure 1.1).Pre-training: Initial TouchThe mouse is rewarded for touching the white square on the touchscreen. Two images are selected pseudorandomly to appear in each location. One image is a white square and the other is a blank, black screen. If the square is touched within 30 sec of display, it is removed and 3 x reward (840 msec) is delivered to an illuminated magazine. If there are no touches for 30 sec, then a single reward is delivered instead (280 msec). In both cases, removal of the head from the magazine starts the ITI (5 sec) before the next trial starts. Touches to the blank image are recorded but have no consequences (Figure 1.2).Pre-training: Must TouchThe mice must touch the white square on the touchscreen to receive a reward.",
    "As for Must Touch, a white square will appear in one location and the mouse must touch it to receive a single reward and no reward is given for omitting a response. Blank touches have no consequences (Figure 1.3).Pre-training: Must InitiateThe mice must start the trials by nose poking in the magazine. The protocol starts as per Must Touch with the presentation of the same images where touching the white square is rewarded and blank touches have no consequences. After reward collection, the magazine light is illuminated again and a head entry is required to proceed to the next trial (Figure 1.4). Pre-training: Punish IncorrectThe mice receive a time-out for touching the incorrect location. As per Must Initiate, however now touching the blank image results in a time-out (5 sec) when the house light is illuminated (Figure 1.5).Task: Visual Discrimination (VD)Mice must discriminate between two visual stimuli and respond to the correct image. The protocol is very similar to Punish Incorrect, except that the testing stimuli pair is now used (Figure 1.6). The stimuli used have black backgrounds with either a single large white circle or four small white circles in each corner of the image (Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171018/20171018201726_5020.jpgFigure 1. Visual discrimination and reversal training stages. 1. Habituation where the mouse learns to collect rewards; 2. Initial touch where the mouse is rewarded with 3 rewards for touching the white square on the screen or 1 reward after 30 sec. 3. Must touch where the mouse will only receive a reward for touching the white square on the screen. 4. Must initiate where the mouse must start trials with a magazine nose poke. 5. Punish incorrect where the mouse now receives a time-out for incorrectly touching the blank screen. 6.",
    "Visual discrimination where the mouse learns to select the correct image (large circle in example) to receive a reward. 7. Reversal where the mouse must now select the alternative image (small circles in example) to receive a reward. 8. Photograph of top view of operant chamber to show stimulus panel towards top of the image and reward collection port (indicated by white arrow).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171018/20171018201800_4422.jpgFigure 2. Visual discrimination stimuli. The images used in this protocol were a single large white circle versus four small white circles. These stimuli were selected as they have similar graphic features and would allow the use of orientation shifted patterns (such as vertical vs. horizontal lines) within a battery of other tasks.Task: ReversalThe stimuli that were previously paired with reward should now be avoided and the alternative stimuli (previously unrewarded stimuli) are now correct (Figure 1.7)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}