{
  "id": 19119,
  "origin_website": "Jove",
  "title": "A Murine Model of Muscle Training by Neuromuscular Electrical Stimulation",
  "procedures": [
    "1. Electrode Preparation\nCut a 1 cm x 1 cm section of the vector circuit board.\nStabilize 2 wirewrap pins using a vice grip, with pins spaced approximately 3.5 mm apart. The bifurcated ends of the pins should be facing up.\nBend wirewrap pins at a 90° angle, approximately halfway along their length, using needlenose pliers.\nExpose the copper wires of connectors, approximately 7 cm from lead connection, by stripping the wire insulation.\nSolder one of the copper wires to the bifurcated end of one the wirewrap pins. Repeat soldering step for the other wirewrap pin.\nPull shrink tubing at soldered connection between copper wires and gold pins in order to insulate and stabilize. Heat the tubing using the soldering tip.\nInsert the unsoldered tips of the wirewrap pins into adjacent openings of the breadboard circuit board.\nEnsure that the wirewrap pins are parallel to one another and stick through the breadboard such that the tips are located the same distance when placed through the board.\nEmbed soldered ends of the pins in clear epoxy. Allow the epoxy to cure for approximately 10 minutes, or until completely dry.\nRepeat the application of epoxy until the pins and vector circuit board are completely embedded in order to provide structural integrity and strain relief for the lead wires.\nSand down the epoxy using a metal file to expose the tips of the gold pins.\nUse a multimeter to ensure the two leads are not electrically shorted and that the lead wires have proper continuity\nAttach the electrode leads from the NMES device to female 2-way wire connector (Pomona patch cord).\n2. Animal Preparation\nAnimals are anesthetized via inhalation using 2% isofluorane (Abbott Laboratories, North Chicago, IL) in 100% O2 gas. The animal should remain anesthetized throughout the NMES session.",
    "Before starting the NMES protocol perform a toe pinch to ensure that the animal is fully anesthetized.\nAnimal should be regularly checked for response to stimulation in order to ensure the anesthetic level is sufficient. The anesthesia should be adjusted as needed. Movement other than that of the stimulated leg, changes in respiratory depth, and color of mucous membranes should all be assessed regularly to monitor depth of anesthesia.\nPosition the animal in lateral recumbency.\nApply ophthalmic lubricant to the eyes in order to prevent corneal drying during the procedure.\nShave the hindlimb area to be treated, and wipe with alcohol.\nWipe the electrode with 3% bleach, then rinse with water.\nApply a layer of conducting gel over the site where the electrode will be applied. Reapply as necessary throughout the NMES protocol to ensure current flow between the electrode and the skin.\nA heat lamp or circulating water blanket should be used to maintain normal core body ranges.\nNote: All procedures have been reviewed and approved by the University of Pittsburgh Institutional Animal Care and Use Committee and performed in PHS assured and AAALAC Int. accredited program and facilities.\n3. Stimulation\nElectrode placement:\n\t\nFor stimulation of anterior compartment muscles, including the tibialis anterior and the extensor digitorum longus muscle, place the surface electrode directly over the animal's deep fibular nerve, which is a distal branch off of the common peroneal nerve, and is located just anterior to the the fibular head.\nFor stimulation of anterior compartment muscles, placement of the electrode is confirmed when stimulation elicits full ankle dorsiflexion and full extension of the digits. On the other hand, dorsiflexion, in the absence of digit extension suggests that only the tibialis anterior muscle is being stimulated. Such a targeted contractile response may be desirable, depending on study design.",
    "The muscle contraction is divided into 2 phases of stimulation: a free moving, concentric phase, which occurs during the initial ~0.5 seconds. During this first phase, the paw moves from a resting position to maximal dorsiflexion and digit extension. The second phase of stimulation is an isometric contraction sustained at end-range dorsiflexion and digit extension.\nStimulation parameters:\n\t\nThis NMES model utilizes the 300 PV Empi multifunction electrotherapy device, which provides 2 channels of conventional NMES (see Table). For the purposes of this model, only 1 channel is used.\nParameters used include symmetric waveform, a pulse duration of 150 μs and a frequency of 50Hz. Stimulation time is set to 5 seconds, with a 0.5 second ramp up and a 0.5 second ramp down. This will allow the muscle to more gradually acclimate to the stimulation. In the current protocol, off time in between contractions was set to 10 seconds, but this may be adjusted depending on the desired effect. Decreased off times will result in a more rapid initiation of muscle fatigue. These stimulation parameters were based on clinical protocols designed to enhance muscle strength using neuromuscular electrical stimulation, without inducing significant skeletal muscle damage 1, 15, 16.\nMice complete two sets of 10 contractions, with a 5 minute rest in between sets.\nFor adult animals, NMES intensity is typically initiated at 9 mA. From our experience, this is approximate to the maximal starting intensity that does not induce a noticeable gait impairment immediately following stimulation. For subsequent NMES sessions, the intensity is increased by 1 mA every time the animals are able to complete 20 full dorsiflexions.\nFollowing completion of the stimulation protocol and recovery from anesthesia, animals typically demonstrate a normal gait and posture. Gait should remain unimpaired throughout the duration of the NMES program.\n4. Representative Results",
    "The NMES protocol described in this article has been implemented in several mouse strains, including: Wild Type (B6/10), B6.SCID and mdx/SCID mice. Representative results of NMES performed over 4 weeks (20 sessions) in 3-5 month old mdx/SCID are presented.\nAnimals were humanely euthanized by cervical dislocation while under anesthesia. The tibialis anterior muscle was harvested and immediately frozen in 2 methyl-butane pre-cooled in liquid nitrogen, and stored at -80 °C. Serial cross-sections (10 μm) were obtained and mounted onto slides. Statistical analyses were performed using standard statistical software packages (SPSS, v19.0 software). First, Levene's test was used to assess whether there was equality of variances. Independent samples t-test was then performed to investigate differences between NMES and Control groups.\nHematoxylin and Eosin (H&E) stains were performed to investigate whether the NMES protocol would result in increased injury in the dystrophic muscle. One section was selected, and pictures were obtained using a light microscope (Nikon Eclipse E800; Nikon, Japan). The total number of fibers and the number of fibers with centrally located nuclei were manually counted using the National Institutes of Health (NIH) - developed image analysis software, Image J. There was no significant increase in the regeneration index (number of centrally nucleated fibers/total number of fibers) in the animals submitted to NMES, as compared to controls (p=0.802; Figure 1). This suggests that the application of NMES does not increase the degeneration-regeneration cascade observed in dystrophic animals, and is therefore not likely to be inducing an increased muscle injury.",
    "Immunofluorescent staining for CD31 was performed to investigate the effect of the 4-week NMES protocol on muscle vascularity. Briefly, muscle sections were fixed in 4% formalin and blocked using 5% Horse Serum (HS). Sections were incubated with a rat anti-mouse primary antibody (1:300 dilution in 5% HS) and treated with a 555-labeled goat anti-rat secondary antibody (1:300 dilution in 5% HS). To quantify the total number of CD31 positive cells, one section was selected, and photographed using fluorescent microscopy (Nikon Eclipse E800; Japan). The total number of capillaries was manually counted using Northern Eclipse Software (Empix Imaging Inc.). There was a significant increase in the number of CD31 positive cells in the animals submitted to NMES when compared to controls (p<0.01; Figure 2), indicating that the NMES protocol as described promotes skeletal muscle angiogenesis.",
    "In situ contractile testing: Four weeks after completion of an NMES protocol, contractile testing of the anterior compartment muscles was performed using an in situ testing apparatus (Model 809B, Aurora Scientific Inc, Canada), stimulator (Model 701C, Aurora Scientific Inc, Canada), and force transducer (Aurora Scientific Inc, Canada). Briefly, the peroneal nerve of anesthetized animals was isolated through a small incision lateral to the knee. Mice were then placed supine on a platform and the foot being tested was positioned on the footplate. The hindlimb used for testing was stabilized with cloth tape on the knee and foot. Muscles were stimulated using a hook electrodes inserted beneath the skin. Muscle tetanic contraction was tested at a frequency of 150Hz for 350ms to investigate whether the 4-week NMES protocol would induce improvements in muscle force. Results were normalized to wet muscle weight. There was an approximately 30% increase in the tetanic contraction of animals submitted to NMES, when compared to controls (p=0.005) (Figure 3), suggesting the protocol described improves skeletal muscle strength in mdx/SCID animals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3914/3914fig1.jpg\nFigure 1. Hematoxylin & Eosin skeletal muscle staining of dystrophic (mdx)/ immunodeficient mice (4-5 months)(10x magnification): A) untreated controls, B) after 4 weeks of NMES.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3914/3914fig2.jpg\nFigure 2. CD31 immunofluorescence (red), as a marker of skeletal muscle vascularity, in the skeletal muscle of dystrophic (mdx)/ immunodeficient mice (4-5 months)(20x magnification) A) untreated controls, B) after 4 weeks of NMES.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3914/3914fig3.jpg\nFigure 3.  Contractile testing of the anterior compartment muscles in control and animals treated with NMES for 4 weeks. mNm= milli Newton meters. Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/3914/3914fig3large.jpg]."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}