{
  "id": 13887,
  "origin_website": "Jove",
  "title": "Animal Models of Depression - Chronic Despair Model (CDM)",
  "procedures": [
    "All experiments were performed in agreement with European guidelines (EU 2010/63) and in accordance with the German animal protection law (TierSchG), FELASA (www.felasa.eu/guidelines.php), the national animal welfare body GV-SOLAS (www.gv-solas.de/index.html) guide for the care and use of laboratory animals, and were approved by the animal welfare committee of the University of Freiburg and by the Comite d’Ethique en Matiere d’Experimentation Animale de Strasbourg (CREMEAS, CEEA35), as well as local authorities. Both sexes of C57Bl6N wild-type mice aged 10-14 weeks (70-98 post-natal days, PND) were used for wild-type (WT) indicated experiments. As a stress-resilient line, the transgenic mouse line with enhanced expression of adenosine A1 receptors under the forebrain neuronal CaMKII promoter was used9,15. After the experiments, mice were sacrificed by cervical dislocation.\n1. Preparation\nObtain an animal research license, including thorough experimental planning.\nArrival: On arrival, raise the animals in the animal facility to perform the CDM. If the animals are bought from an external supplier, allow them at least 2 weeks to adapt to the new environment.\nHousing: To house the animals, ensure that the cages are not occupied with the maximum number of animals to avoid additional stress. Guarantee that housing conditions are in line with international recommendations of mouse housing (for further information, see22) and constantly maintain them at all times.\n\tNOTE: The most important standard housing conditions include individually ventilated cages with 25-120 air changes per hour, 12 h light-dark cycle, temperature as stable as possible (at least constant between 20-24 °C), humidity as stable as possible (at least between 45%-65%), gnawing material and shelter present, no individual housing.\nTime point: Perform all experiments at the same time of the day.",
    "NOTE: No direct assessment has been made to verify the influence of the daytime on CDM, but most behavioral tests evaluating depressive-like states show variations depending on the time of the day23,24,25, and it is highly probable that daytime also influences CDM.\nNesting material: Reduce the nesting material to a minimum. Ensure there are no running wheels, etc., present in the cage.\n\tNOTE: Enriched environment prevents the induction of a depressed state.\nGroup composition: Allow the animals to remain in the same group throughout the whole experiment. Group the female mice together even from different litters; group the male mice together with littermate male animals. Due to upcoming aggressiveness, especially of males, biting and barbering may become a problem, therefore give special emphasis to the group composition. Avoid single housing as deprivation is a major additional stressor.\nAnimals: Use different mouse strains, even though specific differences have been observed9,10. A frequently used mouse strain is C57Bl6N. Label mice in order to perform paired statistical analysis (see step 3.2.4).\nAnimal sex: Equally use both male and female mice.\nAnimal age: Ensure that the animals are at least 10 weeks (70 PND) old. Do not use younger animals due to the exhaustion caused by swimming.",
    "Equipment: Use a transparent glass cylinder/beaker with a capacity of at least 2 L, a diameter of 24-26 cm, and a minimum height of 30 cm. Further requirements include a thermometer to check the water temperature, paper towels, red light heating lamp/heating mat or comparable source of heating, timer, stopwatch, quiet surroundings. Videotape the swim sessions for offline analysis and documentation. Ensure that the date and the time are continuously visible on the tape/file, together with an identification code number for the individual animal. Store the files for later analysis and further reference. Film from the side of the glass cylinder, not from above, to facilitate analysis.\n2. Induction phase\nBefore starting\n\t\nVisually observe the animals for abnormalities, including signs of biting or barbering. Exclude the whole cage from the experimental series if an animal shows any minimal injuries. Ensure that a veterinarian is available at any time as injuries will worsen during the experiment and will prevent continuation as mice become more aggressive under the influence of stress.\nObtain the bodyweight for each animal before starting the experiment. Ensure that the weight loss often observed does not exceed 20% of the initial body weight. Exclude animals with a weight loss of over 20% and immediately euthanize them due to the assumed high suffering.\nFill up a beaker or cylinder with water at room temperature (22-23 °C) to a height of at least 20 cm from the bottom, leaving a minimum of 10 cm between the water surface and the upper border of the vessel.\nPerformance\n\t\nGently transfer the animals into the water. During the swim phase, keep the animal under continuous observation to prevent drowning. Observe from a position where the animal cannot see the experimenter (for instance, video observation from a room next door).",
    "Set a chronometer at the beginning of the experiment. Take the animals out of the water after 10 min by simply grabbing their tails. Gently dry them with a paper towel and put them either under a heating light or on a heating mat.\nEvaluate only one animal at a time. Ensure that animals cannot see each other (for example, separate the housing cage from the experimental set-up by a room-divider).\nPerform the forced swim session for 10 min each day for 5 consecutive days.\nFinishing\n\t\nTransfer the animals back to their home cages after five swim sessions and allow them to rest for at least 2 days. Start specific treatment interventions subsequently.\n3. Evaluation of an anti-depressive treatment\nTime course\n\t\nAssess the acute and subchronic treatments with the CDM. Depending on the scientific question, adapt the resting period between the induction phase and the read-out.\nTo evaluate the acute and rapid-acting potency of ketamine, choose a short resting period (a few days) after the induction phase of CDM. Apply the treatment (i.e., intraperitoneal injection), and then perform the evaluation (additional swim session or different evaluation method) shortly afterward.\nTo evaluate the effects of a subchronic treatment, increase the treatment period up to 4 weeks (there is no data available for longer treatment periods). For example, give the oral treatment with imipramine to the animals during 4 weeks after the induction phase and evaluate thereafter.\nStart to evaluate the depressed state right after the end of the treatment period, e.g., the following day. Always choose an identical time period for control and experimental conditions.\nImmobility time\n\t\nProof-of-concept",
    "To use immobility time as a read-out method, evaluate each day of the induction phase and the test day to provide a proof-of-concept (see Figure 1). For further experimental series, reduce the assessments to day 1, day 5, and the test day (see Figure 1C).\nVideotape each experiment. Allow two trained observers who are blinded to the experimental conditions to perform the analysis independently. Video analysis enables the experimenter to observe the behavior from a different room, therefore minimizing the interference with the test (for example, see the video file in the supplementary material).\nConditions: Observe and identify the three different behavioral conditions during the swim test: struggling, swimming, and immobility. Most researchers focus on immobility; a further differentiation between struggling and swimming is rarely useful and dramatically increases the complexity and duration of the analysis.\n\t\t\nStruggling: The animal actively tries to escape from the threatening situation. This involves pawing the side of the cylinder with the head oriented toward the wall and movements of all limbs. The water surface is typically slightly turbulent.\nSwimming: The animal moves at least both hind paws and travels a distance throughout the water. It actively searches for a way out but does not try to overcome the glass wall of the vessel. Swimming does not involve lifting the paws above the water surface, and the body is usually oriented parallel to the walls of the cylinder. In this condition, animals frequently turn around or move in circles.\nImmobility: The animal keeps still, in a freezing-like position, and does not move at all or only moves the tail, or the forepaws to keep its head above the water surface. No distance is actively traveled except for passive floating, and no directed movement of the front paws is observed.\nTracking",
    "Perform the assessment using offline video recordings. Use blinded ratings by two independent and experienced examiners and calculate averages between the two ratings.\nRepeat the ratings if the results of the two raters differ above a previously determined range. Continuously observe the mice as the different conditions frequently change between struggling, swimming, and immobility.\nUse a stopwatch to measure the total time spent in a focused stage (usually immobility) over the 10 min the mouse stays in the water. Consider a short latency of about a second before changing the ongoing time measurement (e.g., if an animal remains for 20 s in immobility and only moves once for less than a second and returns to immobility for another 10 s, the total immobility time is 30 s).\nStatistics: Due to the relatively high inter-individual standard deviation (probably caused by a transfer of hierarchy-depending behavior from the cage to the swim test), mark or label the animals to perform paired (instead of unpaired) parametric tests afterward. Evaluate the normality distribution and, depending on the specific question, perform analysis of variance (ANOVA) with post-hoc t-tests or paired t-tests to compare the different groups. Perform the analysis using absolute values of immobility time (s) or as normalized values.",
    "Absolute values: Give mean values of the immobility time from day 1 to day 5 and for the test day ± SEM (see Figure 1A). Compare the averaged values for day 1 and day 5, preferably using a paired t-test to validate the induction of a depressed state. If there is a significant difference between day 1 and 5, compare the mean values of day 5 to the averaged results of the test day. Ensure that a typical group size in one experiment is between 6 and 10 animals and expect significant differences between baseline and post-induction immobility times in wild-type animals. Comparing different groups with an unpaired t-test is difficult if absolute values are used because of baseline differences; therefore, use normalized values.\nRelative/Normalized values: Compare the different treatment effects by normalization to the individual result on day 5, and then express the values as a percentage of day 5 (see Figure 1B).\nControl experiments\n\t\tNOTE: The swimming performance might be correlated with locomotion. Substances that cause a hyper-locomotion could induce false-positive results (namely, a decrease of immobility time); as well as sedative agents could artificially increase immobility time.\n\t\t\nEvaluate the changes in locomotion for unknown substances before performing the swim analysis. Use Open Field Test (OFT) in a separate group of animals for at least 10 min.\nChoose the same observation time (10 min) in the OFT as in the CDM to detect unspecific hyper-locomotive effects of the tested compound that might influence CDM read-out via measurement of immobility-time with high validity.\nIn case of significant hyper-locomotive effects, do not evaluate the swim session to assess the anti-depressive potency but use different read-out methods (for instance, sucrose preference, tail suspension test, etc.).\n4. Evaluation of the development of a depressive-like state",
    "To evaluate the development of a depressive disorder, assess each day of the induction phase to measure the immobility-time.\n\tNOTE: In this case, a minor increase of immobility-time between each day describes resilience, whereas a stronger and earlier increase compared to untreated or wild-type animals represents an enhanced vulnerability to stress-induced despair. By treating mice before the swimming event, the preventive intervention or transgenic mouse lines could be assessed concerning the development of behavioral despair.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}