{
  "id": 19175,
  "origin_website": "Jove",
  "title": "Stem Cell Transplantation in an in vitro Simulated Ischemia/Reperfusion Model",
  "procedures": [
    "1. Preparing H9c2 cardiomyoblast cells\nH9c2 rat cardiomyoblasts were obtained from ATCC (Wesel, Germany) and expanded in high glucose (4.5 g/L) DMEM containing 10% fetal bovine serum, 4 mM L-glutamine, 100 U/ml penicillin and 100 μg/ml streptomycin. The H9c2 myoblast cell line is derived from embryonic rat heart, it is used as an in vitro model for both skeletal and cardiac muscle 8,9.\nPrepare 12 well plate of H9c2 cells:\nRemove culture medium from Petri dish of H9c2 cells.\nWash cells twice with 5 ml PBS and digest with 2-3 ml 0.05% trypsin/EDTA.\nPlace Petri dish for 5 minutes in the 37°C incubator.\nInhibit trypsin with 10 ml DMEM culture medium.\nSpin down the cells at 1200 RPM for 8 minutes.\nAfter removing the supernatant, resuspend cells in 1 ml DMEM culture medium and count cells with hemocytometer using Trypan Blue staining.\nSeed 30,000 H9c2 cells in 2 ml DMEM per well in a 12 well plate.\nPlace the plate into the 37°C CO2 incubator for 24 hours.\n2. Simulated ischemia/reperfusion\nIschemia/reperfusion was simulated in vitro by performing oxygen glucose deprivation (OGD) on H9c2 cell cultures. This procedure was performed on the stage of the Zeiss confocal microscope with the PeCon cell incubation system (Erbach, Germany) allowing the observation of the cells during OGD. \nRemove medium by aspiration from 12 well plate of H9c2 cells.\nWash cells twice with PBS.\nAdd 3 ml glucose free medium per well.\nPlace the plate into the cell incubation system.\nStart nitrogen gas to purge the oxygen out of the incubation system.\nWait until the level of oxygen reaches 0.5% then start the timer. 0.5% oxygen means approximately 3 mmHg partial tension. Subject cells to 150 minutes of simulated ischemia.\nAt the end of simulated ischemia, remove the glucose free medium from the cells.",
    "Pipette 2 ml normal culture medium to the wells.\nPlace the 12 well plate for 30 minutes in the 37°C CO2 incubator; this is the \"reperfusion period\".\n3. Preparing rescue mesenchymal stem cells\nBone marrow of human origin was taken into T75 flasks and diluted with Dulbecco's Modified Eagle's Medium (DMEM) culture medium containing 10% fetal calf serum (FCS), 100 U/ml penicillin and 100 μg/ml streptomycin, 4 mM L-glutamine and 1 g/l glucose. The flasks were incubated at 37°C in a fully humidified atmosphere of 5% CO2 for 3 days. After the incubation period the BMSCs adhered to the surface of the flasks and the remaining components of bone marrow were eliminated by washing with PBS. The used BMSCs were between 1 and 5 passages in the experiments. The identity of cells was confirmed by the presence of lineage-specific cell surface markers with flow cytometry. Hematopoietic linage-specific surface markers (CD34, CD45) and mesenchymal surface markers (CD73, CD90, CD105 and CD166) were investigated.\nDuring simulated ischemia, prepare rescue mesenchymal stem cells for transplantation.\nDilute the fluorescent dye Vybrant DiD in 1:200 ratio in DMEM culture medium.\nAspirate medium from the rescue cells and add 300 μl DMEM with Vybrant DiD.\nPlace Petri dish for 30 minutes in the 37°C CO2 incubator.\nRemove culture medium from Petri dish of mesenchymal stem cells.\nWash cells twice with 5 ml PBS and digest with 2-3 ml 0.05% trypsin/EDTA.\nPlace Petri dish for 5 minutes in the 37°C incubator.\nInhibit trypsin with 10 ml DMEM culture medium.\nSpin down the cells at 1200 RPM for 8 minutes.\nAfter removing the supernatant, resuspend cells in 1 ml DMEM culture medium and count cells with hemocytometer using Trypan Blue staining.",
    "After 30 minutes at the end of the reperfusion add 20,000 mesenchymal stem cells per well to  the postischemic H9c2 cardiac myoblasts.\nPlace co-culture of cells into the 37°C CO2 incubator for 24 hours.\n4. Analysis with confocal microscopy\nAfter the simulated ischemia/reperfusion injury, cells are incubated in normal culture medium for 24 hours.\nAfter 24 hours wash cells twice with PBS.\nStain the cells in 500 μl live/dead dye solution for 30 minutes (5 nM calcein and 400 nM Ethidium-homodimer-2 in PBS) (5x104 cell/ml).\nThe evaluation of confocal images for live and dead cells selected by morphology and fluorescence can be performed with the ImageJ software (National Institutes of Health, USA). In case of co-cultures, MSCs can be distinguished from H9c2 cells due to their Vybrant DiD cell labeling. The ratio of dead cells can be evaluated in 4 independent fields of view (objective 10x) for each culture in a blind fashion10.\nH9c2 cardiomyoblasts cultured on 42 mm glass coverslips can also be investigated with time lapse video microscopy during and after ischemia/reperfusion injury using the cell incubation system of the confocal microscope. Cell-to-cell interactions such as cell fusion and formation of intercellular nanotubes can be studied over time.\n5. Analysis with flow cytometry\nAfter the simulated ischemia/reperfusion injury, cells are incubated in normal culture medium for 24 hours.\nAfter 24 hours, harvest the culture media. It is very important to collect the culture medium also because some dead cells could have detached from the culture dish surface during the 24 hour incubation.\nWash cells twice with PBS and digest with 0.05% trypsin-EDTA.\nInhibit trypsin with DMEM culture medium.\nSpin down the cells and the harvested culture medium at 1200 RPM (approximately 150-200g) for 8 minutes.\nDiscard the supernatant.",
    "Suspend the cells in 500 μL live/dead dye solution for 30 minutes (5 nM calcein and 400 nM Ethidium-homodimer-2 in PBS) (5x104 cell/ml).\nTransfer cells to flow cytometry tubes.\nStart the CellQuest Pro software.\nTo set up the flow cytometer for measurement, prepare control samples of live and dead cells.\n\t\t\nPlate H9c2 cells at a density of 3x104 in 12-well plates as described in point 1.\nPrepare live cell controls with single trypsinisation as described in point 1.\nPrepare dead cell controls by treatment with 10 μM H2O2 for 1 hour. \nAfter trypsinisation, resuspend live and dead cell controls in 500 μl live/dead dye solution (5 nM calcein-AM and 400 nM Ethidium-homodimer-2 in PBS).\nThe instrument settings should be adjusted so the living cells are calcein positive and ethidium homodimer negative, while the dead cells are calcein negative and ethidium homodimer positive.\nThe percentage of these populations can be expressed as bars on a graph and statistical analysis can be performed on these values.\nMeasure the different experimental groups.\n6. Representative results:\nOur results showed that added mesenchymal stem cells could improve the survival of postischemic cardiac cells. Confocal microscopy images revealed direct cell-to-cell interactions, such as partial membrane connection or intercellular nanotubes, which probably play an important role in the observed protection10. These nanotubes span over distances of several cell diameters, and their diameters were between 200 and 500 nm (white arrows).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3575/3575fig1.jpg\nFigure 1. Nanotube formation between cells. Nanotube formation (white arrow) was observed between Vybrant DiO labeled cardiomyoblasts and Vybrant DiD labeled mesenchymal stem cells.\nFlow cytometry analysis showed the populations of surviving and necrotic cardiomyoblasts and mesenchymal stem cells. Interestingly, we also observed a third, ‘injured’ cardiomyoblast cell population which contained calcein but also contained the indicator of the dead cells, ethidium homodimer (Figure 2). \nimgsrc://cloudfront.jove.com/files/ftp_upload/3575/3575fig2.jpg",
    "Figure 2. Representative dot-plot of the different cell populations after simulated ischemia.\nThe evaluation of several experiments showed that addition of mesenchymal stem cell to postischemic H9c2 cardiomyoblast increased significantly the percentage of living cells compared to the cardiac myoblasts cultured alone after ischemia (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3575/3575fig3.jpg\nFigure 3. Effect of stem cell treatment on postischemic cardiomyoblasts. Percentage of living cells was significantly reduced after simulated ischemia compared to control (control vs. I-R model: 90.36±2.60 vs. 10.52±0.48, *** p>0.001), which increased after addition of mesenchymal stem cells (I-R model vs. I-R + BMSC: 10.52±0.48 vs. 25.21±2.13, *** p>0.001). Data represent mean±SEM. Statistical analysis of data was carried out using one-way analysis of variance with Tukey's multiple comparison post hoc test.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}