{
  "id": 2944,
  "origin_website": "Cell",
  "title": "CRISPR-based large-scale modeling of loss-of-function mutations to investigate mechanisms of stress resistance in cancer",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nScreening of iCas9-expressing clones by editing activity\nTiming: 3–4 weeks\nThe success of the large-scale fitness assay depends on the ability to generate KO populations efficiently and reproducibly across wells. Upon transduction of doxycycline-inducible Cas9 (iCas9) in the cell line of interest following standard procedures,5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6] a clonal line is required to ensure homogenous editing.\nCritical: The editing efficiency observed with iCas9 is highly variable across a polyclonal population. Moreover, leaky Cas9 expression can be detected in the absence of doxycycline (dox). Therefore, a clone exhibiting high editing efficiency and minimal editing prior to induction needs to be isolated. Since Cas9 mRNA or protein levels in isolated clones rarely correlate with activity, we have designed a simple assay to screen clones based on editing efficiency. The strategy employs a validated sgRNA targeting a non-essential and broadly expressed gene, LMNA, which is transduced into isolated clones. Subsequent detection of the encoded LaminA/C protein through a highly-specific antibody enables rapid quantification of KO efficiency in multiple clones in parallel using immunofluorescence and high-content microscopy.\nNote: This protocol starts after the transduction of doxycycline-inducible Cas9 (iCas9) in MEXF 2090 cells using the pCW-Cas9-Hygro lentiviral construct and selection of infected cells by hygromycin treatment, following standard procedures.5[href=https://www.wicell.org#bib5]\nNote: We recommend infecting at least 5–10 million cells as transduction of iCas9 is highly inefficient.\nDay 1: Isolating single cells by flow cytometry cell sorting.\nHarvest and resuspend hygromycin-resistant, Cas9-expressing MEXF 2090 cells in FACS buffer.\nUse an appropriate gating strategy for your FACS machine to stringently sort for single cells, and sort them one-per-well into the prepared 96-well plates. Single cells are sorted using side and forward scatter.",
    "Note: While using a FACS machine is the easiest way of deriving clean single-cell populations, other methods of clonal isolation such as dilution plating or transfer of grown colonies after selection are possible, and could be used instead.7[href=https://www.wicell.org#bib7]\nDay 2–20: Growing and maintaining clones.\nNote: The time taken for a clonal line to reach confluency is variable by cell type, but usually takes 2–3 weeks.\nChange the media in each plate of clones twice a week.\nBegin looking for successful clones after ten days. The recovery rate of clonal lines is variable according to the cell type and sorting conditions, but it is usually around 5%–15% of sorted cells.\nDay 21–26: Seeding Cas9 clones for functional assay.\nWhen most clones on the plate are approaching confluency, collate together into three replicate plates. Two plates are for the LMNA-editing assay (+ and – doxycycline). One replicate is kept for subsequent expansion of suitable clones.\nTransduction of LMNA-targeting sgRNAs.\nPrepare the pLenti-sgLMNA-GFP lentivirus (as described in the section: pLenti-sgLMNA-GFP virus production[href=https://www.wicell.org#sec1.4]).\nDilute virus 1:1 in fresh medium containing 5 μg mL-1 polybrene.\nAdd this to both plates, at 100 μL per well. Incubate the plates for 12–16 h.\nNote: The required concentration of polybrene can vary, and should be optimised for other cell lines.\nThe following day, replace the cell culture medium. On one plate, add medium only, and on the other add medium containing 1 μg mL−1 doxycycline. Incubate for 72 h.\nNote: Lamin A/C has a half-life of approximately 24 h and cell division is required for degradation of pre-existing protein.\nNote: Slow-cycling cell lines may require longer incubation prior to the next step, to ensure reliable detection of KO cells.\nLaminA/C immunofluorescence.\nPrepare the required solutions for immunofluorescence.\nFixation solution: 4% paraformaldehyde (PFA) in PBS.",
    "Permeabilization buffer: 0.5% Triton X in PBS.\nBlocking buffer: 3% Bovine Serum Albumin and 0.05% Triton X in PBS.\nAt 96 h after infection, fix cells with 100 μL of fixation solution per well, incubating at 20°C–25°C for 15 min.\nCritical: Fixation conditions are critical for reproducible immunofluorescence, so ensure that the dilution and incubation are both accurate.\nDiscard PFA, wash three times with PBS (5 min each), and permeabilize with 100 μL of 0.5% Triton X in PBS for 5 min.\nRemove the permeabilization solution by inverting the plate and add 50 μL blocking buffer per well. Incubate at 20°C–25°C for 30 min.\nDilute the primary antibody 1:200 in blocking buffer.\nRemove the blocking buffer and add 50 μL of primary antibody dilution per well. Incubate at 20°C–25°C for 30 min.\nRemove the primary antibody by inverting the plate, and wash three times with PBS.\nDilute the anti-mouse-568 secondary antibody 1:400 in blocking buffer.\nRemove the PBS, and add 50 μL per well. Incubate at 20°C–25°C for 30 min, shielding from light.\nRemove the secondary antibody, add PBS containing 1.5 μg mL-1 of DAPI and incubate for 5 min.\nWash three times with PBS and seal plates.\nAnalysis of editing efficiency of infected Cas9 clones.\nImage cells using a high-content microscope, such as a Thermo Scientific ArrayScan VTI HCS Reader, equipped with standard filter sets for DAPI, FITC, and TRITC.\nAnalyze images with the following pipeline:\nIdentify nuclei using DAPI.\nSelect GFP + nuclei using the FITC channel.\nMeasure LaminA/C levels in GFP+ and GFP- nuclei using the TRITC channel.\nSet a threshold of LaminA/C signal such that less than 5%–10% of cells in the control, uninfected population are below that value.\nQuantify LaminA/C-negative cells, with fluorescent signal below the threshold value, in GFP+ nuclei.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2483-Fig1.jpg",
    "Figure 1. Screening of iCas9-expressing clones by editing activity\n(A) Quantitative immunofluorescence microscopy of cells in which KO of LMNA had been induced upon doxycycline treatment. Cells without doxycycline treatment are used to assess leakiness of Cas9 expression. Data are presented as mean ± SEM.\n(B) Immunofluorescence microscopy of doxycycline-induced clone 4 cells expressing LMNA-targeting sgRNA. Scale: 100 μm.\nNote: The percentage of Lamin A/C-negative cells is used as a proxy for KO efficiency, and is controlled for infection efficiency as only GFP + cells are analysed. Optimal clones are selected based on maximal fraction of Lamin A/C-negative cells in dox-treated cells (high activity) and minimal fraction in untreated cells (low leakiness of the Cas9 construct) (Figure 1[href=https://www.wicell.org#fig1]).\nExpand clonal cell line and freeze/store for future use.\nGeneration of arrayed KO populations via lentiviral transduction of sgRNAs – Option 1\nTiming: 15 days\nThe purpose of this step is to produce the arrayed library of lentiviral particles using HEK293T cells. This protocol begins from having the plasmid library in the desired plate layout as described in the “plate layout in 96-well format[href=https://www.wicell.org#sec1.2]” section. The virus production protocol is the same as pLenti-sgLMNA-GFP virus production but it has been optimized for large-scale use in 96-well plates.\nOptimized conditions for a 96-well format. Prepare lentiviral plasmid mix for transfection as below:\ntable:files/protocols_protocol_2483_2.csv\nLeave for 15 min at 20°C–25°C.\nAdd the transfection mix to each well of HEK293T cells as per library design.\nRecover the supernatant containing the viral particles, and filter through a 96-well filter plate with 0.45 μm pore size.\nNote: This step can be done 24 h post transfection and repeated at 48 h for the second batch of virus.\nSeal plates containing the viral particles and store them in aliquots at −80°C.",
    "Note: pAdvantage is a plasmid that increases translation initiation in cells transiently transfected with protein expression constructs. It is not an essential component of the system but facilitates the production of high-titer virus.\nThe library of lentiviral particles will now be used to transduce Cas9-expressing MEXF 2090 cells and generate arrayed KO populations.\nDay1: MEXF 2090 seeding.\nCulture MEXF 2090 cells in complete RPMI medium containing 10% FBS and 1% Pen/Strep.\nTake one 10-cm dish of healthy cells (confluency: 70%–80%), trypsinize and count.\nSeed cells in 96-well plates (5,000 cells/well) to reach ∼30%–50% confluency for the following day.\nDay 2: Infection.\nRemove medium by aspirating.\nDilute the generated viral supernatant (1:8) in RPMI and add 5 μg mL−1 polybrene and add to cells, at 100 μL per well.\nNote: Viral dilution needs to be established depending on the cell line used and the virus titer. Use the maximum dose of the virus that does not lead to cell death or affect cell proliferation in the negative control wells.\nNote: Unlike approaches employing pooled sgRNA libraries, low multiplicity of infection (MOI) and expression of single sgRNAs in individual cells is not a requirement for the success of the experiment. As long as KO is efficient and toxic MOI is avoided, the final outcome is independent of the achieved MOI.\nDay 3–8: Selection with blasticidin.\n24 h post infection, treat MEXF2090 cells with 5 μg mL−1 blasticidin.\nNote: Selection is discontinued when control uninfected wells present total death (4 days). If needed, split cells in between by maintaining the blasticidin selection. Blasticidin concentration and time under selection can vary among different cell lines, and needs to be defined before starting.\nDay 9: Freezing cells in 96-well plates.\nDiscard the medium by inverting the plate.",
    "Add 30 μL of trypsin and leave the plate in the incubator for 4 min.\nAdd 80 μL of ice-cold freezing medium (90% FBS + 10% DMSO).\nNote: Freezing medium can vary among cell lines.\nSeal the plate and store it at −80°C.\nTo thaw cells, place plates in a water bath at 37°C for a few seconds, add 50 μL of medium to each well and spin down at 300 g for 5 min at 4°C. Remove 120 μL of liquid and add 100 μL of fresh medium to each well.\nPause point: An aliquot of selected MEXF 2090 cells can be frozen at this point and stored at −80°C for future usage.\nDay 10: Generation of KO cell populations – Cas9 induction via doxycycline treatment.\nReplace the cell with medium containing 1 μg mL−1 doxycycline. Incubate for 5 days.\nDay 15: The arrayed KO populations are ready to be used for the large-scale fitness assay (move to step 18) (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2483-Fig2.jpg\nFigure 2. Generation of arrayed KO populations\nSchematic representation of the generation of arrayed KO populations via lentiviral transduction of sgRNAs or via transfection of synthetic crRNAs. Figures adapted from Loukas et al.1[href=https://www.wicell.org#bib2]\nGeneration of arrayed KO populations via transfection of synthetic crRNAs – Option 2\nTiming: 7 days\nThe arrayed collections of predesigned synthetic crRNAs will now be used to transfect Cas9-expressing MEXF 2090 cells.\nDay 1: Cas9 induction.\nCulture MEXF 2090 cells in complete RPMI medium containing 10% FBS and 1% Pen/Strep. Take two 10-cm dish of healthy cells (70%–80% confluency) and add 1 μg mL−1 doxycycline to induce Cas9 expression.\nDay 2: Transfection.\nResuspend the 0.1 nmol crRNA library in 5 μL/well of 1× siRNA buffer (which is diluted from 5× siRNA Buffer (Dharmarcon) with DNAse/RNAse free water) for a 20 μM stock.",
    "Resuspend 20 nmol trRNA in 1 mL for a 20 μM stock.\nAdd to each well of the 96-well plate library 5 μL of trRNA and incubate for 5 min at 20°C–25°C to allow RNA annealing.\nDilute crRNA/trRNA into 500 μL using OptiMEM to make 200 nM. Aliquot library onto PCR plates (100 μL each) and store at – 20°C for future usage.\nCritical: 20 μM stocks must be used to form the crRNA/trRNA complex. Diluted molecules (for instance addition of 500 μL of 200 nM trRNA to individual 20 μM crRNAs) will result in inefficient complex formation and gene KO.\nPrepare diluted transfection reagent for all needed conditions, with a little excess (0.3 μL DharmaFECT Duo per 10 μL OptiMEM /96-well for MEXF 2090 cells).\nPrepare new 96-well plates according to how many transfections you need to perform.\nNote: Fitness assays should be done at least in triplicate for each condition (untreated vs treated).\nFor each condition move 10 μL of the diluted crRNA library onto a new 96-well plate and add 10 μL diluted transfection reagent to each well, mix and incubate for 15–20 min.\nRetrieve Cas9-expressing cells from the incubator. Trypsinize and count cells.\nCalculate the necessary volume of cell suspension for 4,000 cells per well in 80 μL complete medium with doxycycline.\nAdd 80 μL of cell suspension per well in the 96-well plate. Final concentration of cRNA/trRNA mix in the well will be 20 nM.\nCulture cells for 5 days and expand as necessary, adding doxycycline for at least 5 days, at which point editing should be complete.\nDay 7: The arrayed KO populations are ready to be used for the large-scale fitness assay (Figure 2[href=https://www.wicell.org#fig2]).",
    "Critical: The transfection reagent should be optimized for the cell line used. Difference in transfection efficiency could lead to major changes in the percentage of KO cells within the population. Potential transfection reagents to test using LMNA-targeting crRNAs and the immunofluorescence assay described in the section above are: Lullaby, DharmaFECT Set of 4 Transfection Reagents, DharmaFECT Duo and Lipofectamine RNAiMAX.\nLarge-scale fitness assays\nTiming: 2 weeks\nIn the large-scale experiment, sufficient identical replicates for the different treatments, are generated from each library plate. From a confluent arrayed KO plate (step 16 – generation of arrayed KO populations via lentiviral transduction of sgRNAs – option 1[href=https://www.wicell.org#sec2.2]; or step 3 – generation of arrayed KO populations via transfection of synthetic crRNAs – option 2[href=https://www.wicell.org#sec2.3]), cells are split at an empirically-defined ratio to achieve approximately 2000 cells – in our case 1:30. Then, cells are either grown under stressful conditions or maintained in unperturbed conditions. Over the course of the experiment one representative plate is monitored to confirm that the growth kinetics is similar to the one expected based on the stress titration pilot experiments, and also dictates the respective endpoint for each stress where the cells will be quantified by nuclei measurement.\nNote: The endpoint depends on how severely cells are affected by each stress, with glutamine deprivation being the most deleterious stress; it is determined by when the fittest population approaches confluency, varying from 3 d (acidity and Buparlisib) to 7 d (glutamine deprivation). Unperturbed cells are fixed 2 d after seeding, and allow normalization across wells, accounting for small differences in numbers of seeded cells, as well identification of stress-specific effects. At the indicated endpoints for each condition, the population fitness is assessed by quantification of cell count.",
    "Note: Before proceeding to the remaining part of the protocol, it is important to check KO efficiency in one of the replicate plates. Select 2–3 genes, whose antibodies are available and of good quality, and perform standard immunofluorescence. The sgRNA library used in this protocol has shown overall high activity.8[href=https://www.wicell.org#bib8]\nDAY 0: Seeding cells.\nFor each plate, discard medium by aspirating and gently wash with PBS.\nAdd 30 μL of Trypsin and incubate for 5 min.\nAdd 170 μL of complete RPMI and pipette to resuspend.\nTransfer the whole suspension of cells to a 2 mL deep well block and mix with fresh RPMI medium to achieve the desired dilution.\nTransfer 50 μL of cells into new plates containing 50 μL of fresh media. Gently shake the plate to ensure homogeneous plating.\nNote: The above dilution ratios and the volumes of seeded cells and media within the recipient wells are indicative and can be tuned to achieve different scales of seeding (e.g., plating 10 replicate plates vs 30 replicate plates).\nDAY 1: the median cell counts per well across the 96-well plates should be around 4,000. At this step, the plates are grown in the following conditions: a) unperturbed b) glutamine deprivation (0% L-Glutamine) c) acidic environment (pH 6.5) and d) PI3Ki (1nM Buparlisib).\nDiscard medium by aspirating and gently wash with PBS.\nAdd 100 μL per well of RPMI complete or RPMI with the respective stressor.\nDAY 2–7: Buparlisib treatment and media acidification is sustained for 3 days, while glutamine deprivation is sustained for 7 days.\nNote: Cell count for populations grown in unperturbed conditions is quantified at day 2, which at that day results in a 40%–60% reduction in cell counts compared to untreated cells in negative control KO populations.",
    "Critical: It is essential to keep the outer wells filled with PBS for optimal humidity levels of the plates. If that it is not done, cells close to the edge suffer and die, especially when experiencing harsh conditions.\nAt the indicated endpoints for each condition, fix plates with 4% PFA followed by nuclei staining with SYTOX Green or Red.\nImaging and data analysis\nTiming: 1–2 weeks\nImaging and quantification are performed in Incucyte® S3 Live-Cell Analysis System.\nScan type: whole well (96-well plate format).\nScan settings: Acquisition time: 300 ms (SYTOX Green), 400 ms (SYTOX Red).\nOnce the plates are scanned, use default settings to identify nuclei and quantify cell counts (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2483-Fig3.jpg\nFigure 3. Assessment of possible technical artefacts\n(A and B) Representative pictures of SYTOX Red-stained nuclei (red) surrounded by the Incucyte mask (yellow) (A) and of a cell clump in one well (B). Scale bars: 100 μm and 1 mm, respectively.\n(C) Example of inflated normalized fitness due to detrimental effects of gene KO in unperturbed conditions, rather than a true stress-specific effect (CENPA-KO). Values represent the growth of individual epigenetic regulators KO populations relative to the negative controls from one of eight plates, grown in the indicated conditions. Dashes indicate growth range of control populations.\nNote: Default settings are typically suitable to create an accurate mask and identify nuclei. However, the mask can be optimized by changing parameters such as cell size to exclude background speckles.\nQuality control via manual inspection of images is essential. Various parameters must be assessed to ensure that the data is of sufficient quality before quantification of fitness:\nWells containing cell clumps must be removed; it would strongly affect the measurement (Figure 3[href=https://www.wicell.org#fig3]B).",
    "Outliers among replicates may be removed (typically differing from the two consistent replicates more than 3 times their difference).\nKO populations with severely compromised fitness in unperturbed conditions must be removed. In such cases, the linearity of comparison is lost and the normalization (growth under stress/growth under normal conditions) artificially confers an apparent fitness advantage to populations with decreased growth kinetics (20% reduction compared to the plate median – Figures 3[href=https://www.wicell.org#fig3]C and 3D).\nNote: As an example, in Loukas et al.,1[href=https://www.wicell.org#bib2] 68 genes were excluded from the analysis because they conferred a severely compromised fitness under unperturbed conditions; leaving 250 cell populations. Moreover, 61 out of 7200 total imaged wells (0.85%) were excluded from the analysis because of poor-quality data: 53 wells (87% of excluded wells) because of visible clumps of cells and the remaining 8 wells because they were highly inconsistent with the other two replicates (typically differing from the two consistent replicates more than 3 times their difference).\nResults quantification.\nUse the stress/unperturbed ratio in cell count at endpoint to calculate the normalized fitness for each KO or control population.\nDefine KO populations with enhanced or reduced fitness based on the formula: Z=(χ-μ)/σ, where χ is the fitness of individual KO populations, μ is the mean fitness of negative controls, σ is the standard deviation of the fitness of negative controls.\nDefine populations exhibiting enhanced or reduced fitness as those with a z-score > 1.645 or < -1.645 (90% confidence interval), respectively. Since a high ratio of sample vs negative controls (2:1) is used and the z-score includes information on confidence level, correction for multiple comparisons is not required.\nPerform validation experiments with selected genes exhibiting varying degree of stress-resistance, including mild phenotypes. An example is shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2483-Fig4.jpg",
    "Figure 4. Reproducibility of the data generated by the large-scale CRISPR screen\n(A) Correlation between two biological replicates of MEXF 2090 cells grown under glutamine deprivation.\n(B) Table of the r squared values of the indicated biological replicates.\n(C) Quantification of normalized fitness for the indicated KO populations of MEXF 2090 cells. Members of the same protein complex are color-coded. The dashed lines indicate the z-score threshold values of neutral phenotypes defined by negative controls.\n(D) Growth kinetics of 4 KO and 5 control populations of MEXF 2090 cells selected for validation of the results from the large-scale assay. Two independent biological replicates are shown. Figures adapted from Loukas et al.1[href=https://www.wicell.org#bib2]"
  ],
  "subjectAreas": [
    "Crispr",
    "Cancer",
    "Cell Biology",
    "Cell-Based Assays",
    "Genetics",
    "Molecular Biology",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}