{
  "id": 10494,
  "origin_website": "Jove",
  "title": "Collecting Sleep, Circadian, Fatigue, and Performance Data in Complex Operational Environments",
  "procedures": [
    "This study was approved by the Institutional Review Board (IRB) of NASA Ames Research Center, and all subjects provided written informed consent. All study procedures conformed to those in the protocol approved by the NASA IRB (protocol number HRI-319).\n1. Participant Selection and Preparation for the Experiment\nDetermining the study schedule\nInclude a baseline data collection period in order to assess outcomes in the absence of intervention.\nIdentifying when to collect data during the experiment\nWhen assessing fatigue, it is critical that outcome measures include more than one data point due to time-of-day changes in fatigue and performance.\nCollect performance data in conjunction with operationally critical tasks when possible. In the case of airline pilots, it is useful to collect a PVT and fatigue rating at the TOD of a flight, which is in the final phase of cruise, just before the critical task of landing occurs.\nNOTE: More inflight PVT data may be required to assess outcomes for longer flights or in other operational environments. A researcher may be interested, for example, in the change in fatigue across a rest break, which requires measures to be taken pre- and post-break.\nRecruitment procedures may vary depending on study objectives. Ensure that participants are employed by a single organization and that they represent the typical population of the chosen organization; therefore, no additional screening criteria needs to be applied.",
    "NOTE: In laboratory environments, participants are typically screened out of participation if they have chronic health conditions or score out of normal range on sleep disorder questionnaires. In operational environments, participants may have chronic conditions and undiagnosed sleep disorders, but these individuals should generally be included in studies in order to gauge the effectiveness of interventions across a broad spectrum of workers. Individuals should be invited to participate in the study through e-mail or in-person presentation to the population of interest.\n\t\nHave participants engage with study personnel directly and assure them that employment decisions will not be made based on individual data.\nTake any additional precautions that may be necessary to protect the confidentiality of participants from their employer, such as obtaining a certificate of confidentiality from the National Institute of Health or a letter from company management assuring volunteers that their employment will not be affected by their participation in the study.\nHave participants undergo informed consent confirming that participation in research is strictly voluntary. Ensure that interested volunteers can follow the study work schedule and discourage them from trading work shifts during the study.\nInvite participants who volunteered in the study to attend a 30–60 min training/briefing session.\nProvide participants with a data collection kit that includes the activity monitor, the touchscreen device with the appropriate application installed, and urine collection supplies. Have participants complete background questionnaires [e.g., Pittsburgh Sleep Quality Index (PSQI)51, Fatigue Severity Scale (FSS)52, Epworth Sleepiness Scale (ESS)53, Checklist of Individual Strength (CIS)54, Morningness/Eveningness Questionnaire (MEQ)55] to estimate the prevalence of baseline sleep issues in the population. These questionnaires may also be used as covariates in data analysis.",
    "Review all aspects of the study with the participants and train them on procedures for completing study questionnaires and tests. Have participants complete one sleep diary and all daily questionnaires in front of the study staff to ensure that the participant understands how to complete the questions and use the application. Train the participants on the appropriate procedures for completing the PVT as described in section 6 below.\nProvide participants with a research validated activity monitor. Instruct participants to wear the activity monitor at all times, only removing it when it may be immersed in water. Ask participants to note the time of activity monitor removals in the application.\nProvide participants with urine collection materials and orient them to urine collection procedures. If a participant is unwilling or unable to collect urine samples, then this element of the study can be included as an optional sub-study if approved by the ethical review board.\n2. Experimental Design\nWork schedule: Ensure that all individuals follow the same schedule (or balanced schedule in the case of a randomized experiment). In addition, include a baseline or placebo condition in the experiment to interpret findings in the absence of intervention or schedule manipulation.\n\tNOTE: It will likely be necessary to work closely with the partner organization to implement the experimental schedule. Other considerations may be necessary depending on the population to be studied. In the case of our study, in which we evaluated short-haul airline pilots, we designed a schedule that allowed them to return home each day to ensure they had a consistent sleep environment. The final schedule for evaluating outcomes of interest should be similar to the one diagramed in Figure 1.\n\t\nData collection protocol on non-work days:",
    "Instruct participants to complete the sleep diary each day within 30 min of waking up and going to bed.\nAsk participants to wear their activity monitor continuously.\nInstruct participants to complete a Samn-Perelli fatigue scale (SP) and a PVT 3x a day: morning (1–2 h after waking), mid-day (8–9 h after waking), and evening (1–2 h before going to bed).\nData collection protocol on work days:\n\t\t\nInstruct participants to complete the sleep diary each day within 30 min of waking up and going to bed.\nData collection schedule: ensure that the data collection schedule includes collection of PVT data at operationally relevant times and at multiple timepoints per day (at a minimum, morning, mid-day, and evening) in order to assess changes in performance associated with sleep loss or circadian misalignment. In addition, verify that the data collection schedule does not overly burden the participant with unnecessary data collection.\nNOTE: The balance between collecting enough information to evaluate interventions and not over-burdening the participant is critical to maintaining study compliance and minimizing withdrawal from the study.\n3. Actigraphy Collection Procedures\nSelect an activity monitor that has been validated against PSG in a laboratory environment (Figure 2).\nNOTE: Some activity monitors include additional features, such as temperature and heart rate, but as described previously, these features can be influenced by an individual’s activities. Two useful features available on some devices are event markers and light sensors. Lighting information can be useful in interpreting circadian phase information and event markers can be used to mark time-in-bed and activity monitor removals, but these features are not required for the collection of sleep information.",
    "Instruct participants to wear the activity monitor snugly and securely fastened on the wrist of the non-dominant hand during the entire experimental period. If the activity monitor is not securely fastened on the wrist, activity counts could be compromised. Demonstrate appropriate fitting during the pre-study briefing session.\nInstruct participants to wear the activity monitor during exercise but remove it before swimming and showering. Activity monitor removals should be noted in the daily sleep diary to distinguish inactivity due to activity monitor removals from naps.\nIf the activity monitor includes an event marker feature, ask the participant to hit the marker whenever the activity monitor is removed. In addition, instruct the participant to press the event marker when going to bed and waking up for every sleep episode. This will enhance information obtained in the sleep diary and assist in analysis.\n4. App-based Questionnaire, Sleep Diary, and PVT Collection\nSelect the application for daily data collection.\nNOTE: App-based questionnaires should be cross-checked against validated paper versions to ensure that the app-based versions faithfully reflect the original instruments. In particular, questionnaires that include visual analog scales should be checked to confirm that app developers did not transform outcomes to Likert-type scales. Similarly, all questions and responses should be checked to confirm that original language and response options are fully included and that the visualization of the questions and responses are not compromised by the screen size of device being used.\nQuestionnaires: have participants complete baseline questionnaires (outlined in section 1.4.1) and demographic information prior to engaging in any study procedures to aid in the interpretation of study outcomes.",
    "Sleep diaries: ask participants to complete the sleep diary before and after the individual’s main sleep episode. It is desirable to provide participants with an application-based sleep diary rather than paper because 1) it is easy for the participant to complete and 2) application-based sleep diaries are time stamped, which minimizes the possibility that an individual will complete the sleep diary retroactively.\nWaking sleep diary: upon waking from the main sleep episode, have participants indicate 1) wake up time, 2) number and duration of awakenings, and 3) sleep quality.\nBedtime sleep diary: just prior to going to bed, instruct participants to document the duration and timing of any naps and anticipated bedtimes.\nPVT: instruct participants to take the PVT at pre-determined times throughout the study using precise methodology as described below (in section 6).\nPresent study information clearly and concisely, so that participants are presented with tasks in a manner that allows them to quickly determine what they need to do.",
    "NOTE: We use the NASA PVT+ app for our studies. The NASA PVT+ is an application for touchscreen devices developed at NASA Ames Research Center. The application is customized for each experiment to include or exclude various questionnaires as needed. The app presents each activity that a participant needs to complete in sequence (see Figure 3). For the present study, the main page of the app displays three main links: “Study enrollment”, “Rest day” and “Duty day”. The “Study enrollment” link includes the following questionnaires to be completed during the training day: Demographics, MEQ, CIS, and ESS. After completion, the link is not visible to the participants. The “Rest day” link includes the questionnaires to be completed during days off: morning sleep diary; SP and PVT for morning, afternoon, and evening; and evening sleep diary, presented in that order. The “Duty day” link displays three main links: Morning (sleep diary); Work Tasks; and Evening (sleep diary). The Work Tasks link is comprised of three links: Pre-flight (SP, PVT, commute time); Record at TOD, which displays the number of flights selected by the participant to complete the tests for that particular flight (SP, PVT); and post-flight (SP, PVT).\n5. Urine Collection Procedure\nUse urine collection to measure aMT6s production to estimate circadian phase (adapted for urine collection in pilots from procedures developed by Lockley18 and Hull56).",
    "Instruct participants to collect urine samples following any intervention that is expected to shift circadian phase. Provide participants with the urine kit, urine log, and instructions on the training day. The urine kit (Figure 4) includes a urinal hat or urinal collection container, several pipettes, five labeled urine collection tubes per 24 h collection, two extra tubes and white sticker labels, clean biohazard zip-lock bags, shipping materials, an ice pack, a urine collection log (Figure 5), and a copy of instructions for reference during each collection block (outlined in section 5.2).\nGeneral overview instructions: inform participants that they need to collect all urine produced over a 24 h period. The first collection block starts from the time the participant wakes up on the first urine collection day and continues in 4 h blocks during the day and an 8 h block overnight. In total, each 24 h collection includes five samples.\nProvide participants with the instructions below and review with them every step in the procedure during pre-study training. Ensure that participants are provided with a pre-paid, addressed shipping label.\nUse the following urine collection instructions for participants:\n\tWhen you wake up on the first day go to the bathroom in the toilet as usual. You will begin collecting your urine after you go to the bathroom for the first time.",
    "At the start of each collection block record the date, the start time and the approximate end time of the collection block on the collection log (e.g., 07:00–11:00 AM). You might urinate more than once during a 4 h collection block (or during the 8 h overnight collection block). In this case, you will urinate in the same urine collection container.. For example, during the 07:00–11:00 AM collection window you may urinate at 8:00 AM and 10:55 AM. Both of these urine voids will mix together in the same collection container. At the end of the collection block you will take a sample. Every time you urinate, record the exact clock time you urinate on the collection log. Every time you urinate, all of your urine should go into the collection container.\n\tEmpty your bladder just prior to taking a sample. For example, if the collection block ends at 11:00 AM, try to urinate in the collection container just before 11:00 AM, then take the sample. At the end of the collection block, record the total volume of the urine collected using the markings on the container.\n\tTake a new pipette and transfer a small amount of the urine from the collection container into a small tube. Fill the tube with enough urine so that it is at least half-full. Cap the tube. Do not fill the tube completely, because urine expands when it is frozen and may break the tube if overfilled. After you fill the tube, then you can throw the pipette away. Each sample tube is labeled with a number and arranged in numeric order. Use the sample tubes in numerical order (i.e., use 1 first, then 2, etc.).",
    "Place the small tube into a zip-lock biohazard bag. Place the large zip-lock bag in the shipping box with a cold pack. After taking the sample, record the tube number and clock time that you took the sample on the collection log, then discard the remaining urine in the toilet. Rinse the collection container with water (do not use anything other than water for rinsing the collection container). Repeat the process for the next three daytime collection blocks (e.g., 11:00 AM–3:00 PM, 3:00 PM–7:00 PM, and 7:00 PM–11:00 PM).\n\tFor the overnight collection block, collect your fourth daytime sample just before you go to bed. The collection container should be empty when you go to bed. The overnight collection block will include all of the urine you urinate during the night, as well as the urine from the first time you urinate in the morning. When you wake up in the morning, you will urinate into the collection container. Any urine from the night will be mixed in with this first urine you produce in the morning. If you do not wake during the night, then the overnight sample may only include your first morning urination. After you have urinated for the first time on Day 2, the overnight collection block is complete.\n\tPlease collect all of the urine you produce in a 24-hour period. If you accidentally urinate in the toilet, then please note this on your urine collection log and let us know that you missed a collection.”\n6. PVT Administration Methods",
    "NOTE: As described in the introduction, NASA-PVT is a 5 min sustained-attention, reaction time test that measures the speed at which individuals respond to a visual stimulus. The duration of the test can be changed based on study design. There are numerous PVT designs that have been developed, including those that illuminate a target35,57 or checkboard pattern39. The NASA-PVT was designed to mimic the laboratory PVT-192 device in which the target is in the form of a milliseconds counter.\nRead the following instructions to each participant to ensure that each receives the same training: “Please hold the device in the landscape position each time and hover each of your thumbs over the device within a few millimeters of the screen the entire time you are taking this test. During the test, tap the screen using the thumb of your dominant hand (that is, the hand you typically write with) as soon as you see the red numbers scrolling in the box. You must use your thumb from your dominant hand to respond to the stimuli in all tests. The numbers in the display show how fast you responded each time. The smaller the number, the better you did. Try to do your best and get the lowest number you possibly can each time. If you tap on the screen too early (before the numbers appear) you will see an error message (‘FS’) indicating a false start. If you tap using your non-dominant thumb, then you will see the message ‘ERR’, indicating an error. Avoid ‘FS’ and ‘ERR.’ If you forget to lift your thumb, the text screen will remind you after a short time.” Figure 6 displays the screen of the Demo NASA-PVT showing the correct position of the touchscreen device while taking the PVT and location of the thumb.",
    "Instruct participants to keep the touchscreen device in Airplane mode, with WiFi off at all times.\nNOTE: This is especially important for the PVT task where the accuracy of the internal stopwatch is influenced by connectivity functions, thus influencing the reaction time38.\nInstruct participants to initiate the PVT at a time that is free from distractions. If distractions occur, have participants note the number of distractions within the application following the test.\nNOTE: Given the demands of operational environments, it is possible that participants will not be able to complete a scheduled PVT test. In this case, participants should be instructed to take the PVT as soon as possible after the missed test. It is also important to inform participants that they should maintain at least 30 min between PVT test sessions."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}