{
  "id": 1675,
  "origin_website": "Cell",
  "title": "How to extract and analyze pollen from internal organs and exoskeletons of fossil insects",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDetection and extraction of pollen from fossil insects\nTiming: minutes to hours depending on the number of specimens studied and the number of pollen extracted. To locate and extract a single pollen from a single specimen takes about 5 min.\nThis step details how to detect fossil pollen 1) adhering to the exoskeleton of fossil insects or 2) preserved inside the body of fossil insects, and how to extract them so the pollen can be studied with LM, SEM, and TEM.\nPlace the fossil specimen under the dissecting microscope (stereomicroscope). Adjust the magnification and focus so the insect (Figure 1[href=https://www.wicell.org#fig1]A) or particular parts of it (leg [Figure 1[href=https://www.wicell.org#fig1]B], abdomen, head, etc.) are clearly visible.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig1.jpg\nFigure 1. Detection and extraction of pollen from fossil insects\n(A) Fossil bee observed with stereomicroscope using normal incident light.\n(B) Close-up of (A) showing part of leg observed with stereomicroscope using normal incident light.\n(C) Same area as in (B) observed with stereomicroscope using epi-fluorescence illumination. Note how adhering pollen grains illuminate under the epi-fluorescence light source.\n(D) Close-up of (C) showing a clump of pollen.\n(E) Drop of glycerine on a LM glass slide. Make the drop small and place it in the middle of the slide. Name the slide appropriately.\n(F) Micromanipulator, nasal hair attached to a teasing needle with UHU glue.\n(G) Fossil fly with stomach/abdomen contents preserved (orange; black arrow). Observed with stereomicroscope using normal incident light.\n(H) Fossil beetle with stomach/abdomen contents preserved (orange; black arrow). Observed with stereomicroscope using normal incident light.\n(I) Fossil fly observed with stereomicroscope using normal incident light. The thin chitin layer in the gut/abdomen region has been removed in four places with a narrow teasing needle to reveal the otherwise hidden gut contents (yellow; black arrow).",
    "To discover pollen adhering to the exoskeleton of a fossil insect turn on the epi-fluorescence illumination. The pollen grains will illuminate when they are hit by the fluorescence beam (Figures 1[href=https://www.wicell.org#fig1]C and 1D).\nPlace a small drop of glycerine on a LM microscope slide (Figure 1[href=https://www.wicell.org#fig1]E) and keep it close by.\nWhile observing through the stereomicroscope use a teasing needle or micromanipulator (with nasal hair; Figure 1[href=https://www.wicell.org#fig1]F) to extract pollen from the exoskeleton of the fossil insect.\nFor dry specimens it is more efficient to dip the needle/micromanipulator into glycerine before you touch the pollen that is adhering to the insect as the pollen grain might otherwise be “blown” away due to electrostatics.\nIt might be necessary to loosen the pollen from the surface of the insect using a teasing needle and then pick it up with the micromanipulator (nasal hair).\nPush the pollen grain with the wet micromanipulator, tip of the nasal hair, along the surface and it will eventually adhere to the hair.\nFor wet specimens preserved in glycerine make sure to quickly but carefully dry most of the glycerine from the surface of the insect with a paper napkin.\nTake care to let the liquid be absorbed by the tissue and do not scrape the surface of the fossil.\nThen use a teasing needle and/or micromanipulator (nasal hair) to extract the pollen.\nTransfer and place the pollen into the glycerine drop on the LM microscope slide.\nNote: When you dip the tip of the micromanipulator into the glycerine drop, the pollen will automatically detach from the hair and remain in the drop.\nTo discover pollen preserved inside the body (digestive system) of fossil insects place the fossil specimen under the dissecting microscope (Figures 1[href=https://www.wicell.org#fig1]G and 1H).",
    "Note: Check if the abdomen is flat or protruding. Large amounts of pollen within the digestive system of fossil insects are often seen as yellow or orange masses (pointed out by black arrows in Figures 1[href=https://www.wicell.org#fig1]G and 1H) shining through the thin chitin membrane of a protruding abdomen.\nPlace a small drop of glycerine on a LM microscope slide and keep it close by (Figure 1[href=https://www.wicell.org#fig1]E).\nUse a fine teasing needle to puncture the abdomen (Figure 1[href=https://www.wicell.org#fig1]I) and scrape out part of the gut content.\nTransfer and place the gut content (pollen) into the glycerine drop on the LM microscope slide (Figure 1[href=https://www.wicell.org#fig1]E).\nNote: When you dip the tip of the micromanipulator into the glycerine drop, the gut content (pollen) will remain in the drop.\nLight microscopy (LM)\nTiming: To transport, stain, and photograph a single pollen grain with LM takes about 25 min.\nThis step details how to transport the extracted fossil pollen into staining liquid, prepare it for LM analysis, and how to achieve satisfactory LM micrographs showing important/diagnostic features such as pollen size, polarity, aperture arrangement, P/E ratio, and major pollen wall or structural peculiarities.\nIf the pollen is dirty or showing little contrast (light in color) treat it with acetolysis fluid. If not then skip steps 11 to 16 and continue with step 17.\nProduce acetolysis solution by mixing nine parts of 99% acetic anhydride and one part 95–97% sulfuric acid.\nFill in 9 mL 99% acetic anhydride into a glass cylinder or bottle under a fume hood.\nAdd 1 mL 95–97% sulfuric acid using a pipette.\nWait until the fluid has cooled down.",
    "Note: If needed, clean the fume hood after mixing the acetolysis fluid and dispose pipette into hazardous waste. The acetolysis mixture can be stored in a chemical cabinet or fume hood at 20°C–22°C (room temperature).\nPlace a drop or two of acetolysis fluid on a new LM microscope slide (Figure 2[href=https://www.wicell.org#fig2]A) and place the slide on a paper sheet under a fume hood.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig2.jpg\nFigure 2. Light microscopy analysis\n(A) A drop of acetolysis fluid on a LM glass slide.\n(B) Pollen grain in a drop of glycerine being manipulated using the micromanipulator. Note the c. 10 mm working distance between the sample and the objective lens.\n(C) Pollen grain being pushed out of a glycerine drop using the tip of a micromanipulator (nasal hair).\n(D) Pollen grain being picked up from a LM glass slide with a micromanipulator.\n(E) Pollen grain (black arrow) seen adhering to the tip of a micromanipulator.\n(F) Example of a single pollen grain (Parthenocissus) from the gut/abdomen of a fossil fly photographed in equatorial view with LM. Scale bar: 10 μm.\n(G) Example of a pollen clump from the gut/abdomen of a fossil fly photographed with LM. Scale bar: 10 μm.\n(H) Example of a single pollen grain (Sapotaceae) from the gut/abdomen of a fossil fly photographed in polar view (optical cross section) with LM. Scale bar: 10 μm.\n(I) Same grain as in (H) in equatorial view. Scale bar: 10 μm.\nObserve the fossil pollen grain in the glycerine drop on the old LM microscope slide with an erect image compound microscope equipped with a 10× or 20× objective lens having an approximately 10 mm working distance (Figure 2[href=https://www.wicell.org#fig2]B).",
    "While observing the pollen grain through the eyepiece of the LM move the distal end of the micromanipulator (with nasal hair) between the LM microscope slide and the lens.\nGently dip the tip of the micromanipulator into the glycerine and use it to pick up the pollen grain stored within the glycerine drop.\nTransfer the pollen grain to the acetolysis liquid on the new LM microscope slide.\nNote: To extract the pollen grain from the glycerine drop, brush, or push the pollen grain towards the edge of the glycerine using the tip of the micromanipulator, then push it out of the glycerine until it adheres to the nasal hair (Figures 2[href=https://www.wicell.org#fig2]C–2E) and transfer to the acetolysis drop.\nNote: When you dip the tip of the micromanipulator with the attached pollen into the acetolysis liquid the pollen will automatically detach from the hair and remain in the drop.\nLight a tea candle and hold the LM microscope slide, with the pollen grain in the acetolysis drop, over the candle flame for 3–5 s to dissolve extra organic material on the surface of the pollen grain, to “rehydrate” the pollen grain if possible, and to stain the pollen grain for LM photography.\nNote: Do not hold the LM microscope slide over the flame for too long or the pollen grain will become too dark for optimal photography. Best is to heat the slide shortly (3–5 seconds) and then place it under the LM to check the status of the pollen grain. This should be repeated until the pollen grain has gained the required color.",
    "Place the LM microscope slide with the pollen grain in the acetolysis drop under the erect image compound microscope. Use the micromanipulator to extract the pollen grain from the acetolysis drop and transfer it back to the glycerine drop on the old LM microscope slide.\nObserve the pollen grain in the glycerine drop with an erect image compound microscope equipped with a 10× or 20× objective lens having an approximately 10 mm working distance (Figure 2[href=https://www.wicell.org#fig2]B).\nUse the micromanipulator to turn the pollen to an optimal position (polar and equatorial views) while observing it through the eyepiece of the LM.\nWhen the pollen grain has been placed in an optimal position switch to a lens with higher magnification (50× or 60×).\nPhotograph the pollen grain at different foci (high-, low focus, optical section; see Halbritter et al., 2018[href=https://www.wicell.org#bib1], p. 85–95) (Figures 2[href=https://www.wicell.org#fig2]F–2I).\nNote: Make sure to document important LM features such as size, outline in polar and equatorial views, sculpture, aperture arrangement, and irregularities in the pollen wall structure.\nScanning electron microscopy (SEM)\nTiming: To transport, wash, sputter coat, and photograph a single pollen grain with SEM takes about 2 h.\nThis step details how to transport the pollen following the LM analysis onto SEM specimen stubs, how to clean the pollen and prepare for SEM, and how to achieve satisfactory SEM micrographs showing important/diagnostic sculpture types and other features of the pollen surface.\nPosition a stereomicroscope close beside an erect image compound microscope equipped with a 10× or 20× objective lens having an approximately 10 mm working distance (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig3.jpg\nFigure 3. Scanning electron microscopy analysis\n(A) Binocular stereomicroscope (left) close beside an erect image compound microscope (right) equipped with a 10× lens having a c. 10 mm working distance.",
    "(B) SEM specimen stub positioned under a stereomicroscope using normal incident light (from the side).\n(C) Ethanol, small glass container, micromanipulator, and a glass pipette with a narrow and pointed end to transport ethanol.\n(D) Use both hands simultaneously, form a drop on the surface of the SEM specimen stub with the left and then dip the tip of the nasal hair with the fossil pollen into the drop with the right.\n(E) Clump of pollen from the abdomen of a fossil fly observed with SEM. Scale bar: 10 μm.\n(F) Example of an overview micrograph showing a single pollen grain (Parthenocissus) from the abdomen of a fossil fly observed with SEM. Scale bar: 10 μm.\n(G) Example of a close-up micrograph showing polar area of a pollen (Parthenocissus) grain from the abdomen of a fossil fly observed with SEM. Scale bar: 1 μm.\n(H) Example of a close-up micrograph interapertural area of a pollen (Parthenocissus) grain from the abdomen of a fossil fly observed with SEM. Scale bar: 1 μm.\n(I) Example of a close-up micrograph showing aperture region of a pollen (Parthenocissus) grain from the abdomen of a fossil fly observed with SEM. Scale bar: 1 μm.\nPlace a single SEM specimen stub under the stereomicroscope (Figure 3[href=https://www.wicell.org#fig3]B) and have a small container with fresh ethanol at your side as well as a narrow pointed glass-pipette (Figure 3[href=https://www.wicell.org#fig3]C; for how to make such pipettes from 2 mm wide glass pipes consult Halbritter et al. (2018, p. 121–122).\nLocate the pollen grain in the glycerine drop on the old LM microscope slide with an erect image compound microscope.",
    "While observing the pollen grain through the eyepiece of the LM move the distal end of the micromanipulator (with nasal hair) in-between the LM microscope slide and the lens and then gently dip the tip of the micromanipulator into the glycerine.\nUse the micromanipulator to pick up the pollen grain stored within the glycerine drop.\nSlowly move it towards the stereomicroscope.\nDip the tip of the narrow pointed glass-pipette into the ethanol container and it automatically sucks up a small portion of ethanol.\nPress the tip of the pipette on the surface of the SEM specimen stub to leave a tiny drop of ethanol on the SEM specimen stub.\nGently press the tip of the micromanipulator, with the attached pollen, into the drop of ethanol and the pollen will detach from the hair, float a bit in the ethanol drop, and finally rest on the surface of the SEM specimen stub when the ethanol has evaporated (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: Try to make the ethanol drop small and close to the center of the SEM specimen stub. Two to three additional ethanol drops should be added to clean the glycerine thoroughly off the pollen grain (glycerine is miscible in ethanol).\nNote: If pollen grains are sputter coated without being completely cleared of glycerine their sculpture will be obscured by the glycerine and cannot be studied properly with SEM.\nSputter coat the material placed on the SEM specimen stub with gold for 5 min and a gold coating thickness of 20 nm and photograph the pollen using a SEM (overview and close-ups) (Figures 3[href=https://www.wicell.org#fig3]E–3I).",
    "Note: Pollen of particular interest can be turned and photographed from different sides. To do this, place the SEM specimen stub under the stereomicroscope again. While observing the pollen grain through the eyepiece add a drop of ethanol to the sputtered sample so it engulfs the pollen grain and then flip the grain over using the micromanipulator before the ethanol evaporates. Then re-sputter the SEM specimen stub with the pollen grain and photograph it again using the SEM. This applies especially to any kind of heteropolar pollen/spores or tetrads of some sort.\nTransmission electron microscopy (TEM)\nTiming: To transport, wash, embed, stain, cut, and photograph a single pollen grain with TEM takes about 2 days.\nThis step details how to transport the pollen following the SEM analysis into glycerine, how to clean and dehydrate the pollen, how to embed and stain it, how to cut it into sections, and how to achieve satisfactory TEM micrographs showing important/diagnostic ultrastructural features in different areas of the pollen wall.\nBefore the pollen grain can be transferred from the LM microscope slide (or the SEM specimen stub), the setup for TEM infiltration and embedding must be prepared (Figure 4[href=https://www.wicell.org#fig4]A).\nPrepare the embedding solution (LV-Resin). Mix the components in a clean (dust-free) disposable lockable plastic beaker using a magnetic stirrer (Figure 4[href=https://www.wicell.org#fig4]B).\nThe first two components must be mixed before adding the remaining ingredients, then mix well again.\nThe mixture can be used immediately for infiltration and embedding. Inside the closed beaker, the embedding solution can be stored in a refrigerator at 4°C for 3 days.\nNote: Agar low-viscosity resin (LV-resin; Agar Scientific, 2004) and Spurr’s low-viscosity epoxy resin (Spurr, 1969) are suitable embedding media providing complete and uniform penetration of fossil pollen grains.",
    "Place a stereomicroscope, the embedding solution (LV-Resin), and a plastic pipette inside a fume hood.\nPlace an embedding mold, with a flat/smooth inner surface, under the binocular. Turn hood settings on lowest intensity in order not to lose pollen grains due to strong airflow.\nClean the embedding mold before embedding the pollen grain as extra particles might interfere with the embedding material: Add pure acetone dropwise into the empty mold and use a pipette to reabsorb and dispose of liquids. Repeat this step until the embedding mold is clean.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig4.jpg\nFigure 4. Transmission electron microscopy: Infiltration and embedding\n(A) Setup for TEM preparation with stereomicroscope inside a fume hood.\n(B) Mixing the four components of the embedding solution.\n(C) Transfer pollen from the SEM specimen stub under a stereomicroscope.\n(D) Close-up of (C) showing pollen picked up (white arrowhead) from the SEM specimen stub using a glycerine-soaked micromanipulator (black arrowhead).\n(E) Drop of glycerine on a LM microscope slide with transferred gold-coated pollen inside (arrowhead).\n(F) Close-up showing the extracted gold-coated pollen grain in glycerine (white arrowheads).\n(G) Example of a clean embedding mold with flat inner surface (e.g., Eppendorf lids). In each embedding mold only one single pollen grain, or a whole pollen clump, is placed.\n(H) Acetone is used dropwise to clean the pollen grain from glycerine inside the embedding mold.\n(I) For infiltration the embedding media is added to the acetone into the embedding mold.\n(J) Micromanipulator is used to move/keep the pollen grain in the center of the embedding mold.\n(K) The plastic pipette section is used to restrain the pollen grain in the center of the embedding mold.",
    "(L) Infiltration inside the embedding mold takes as long as the acetone needs to evaporate. This can be observed under the binocular stereomicroscope, as the pollen grain is floating inside the acetone-embedding mixture as long as acetone is still present.\n(M) Mold filled up with embedding media.\n(N) Example showing how to fill up the embedding mold (arrowhead), without overfilling it.\n(O) Example showing another type of a flat embedding mold.\n(P) Close-up of (O) showing pollen grain (black arrowhead) inside plastic pipette section (white arrowhead).\n(Q) Block holders of different sizes, made in embedding molds with remaining embedding media.\n(R) Polymerization of the embedded fossil pollen grain(s) inside the oven at 70°C.\nPlace the SEM specimen stub with the coated pollen under a stereomicroscope (Figure 4[href=https://www.wicell.org#fig4]C).\nDip the micromanipulator (with nasal hair) into glycerine and then use it to pick up the pollen grain from the SEM specimen stub (Figure 4[href=https://www.wicell.org#fig4]D).\nNote: When the glycerine-soaked micromanipulator is brushed against the pollen, laying on the SEM specimen stub, the pollen grain will adhere to it.\nTransfer the pollen grain into a drop of glycerine placed on a new LM microscope slide and study it with the LM to make sure you have extracted the correct particle (Figure 4[href=https://www.wicell.org#fig4]E). The pollen grain will look black and non-transparent due to the gold-coating (Figure 4[href=https://www.wicell.org#fig4]F).\nNote: The pollen grain can also be transferred directly from the SEM specimen stub into the embedding mold.\nUse the micromanipulator to transfer the pollen grain into the embedding mold (Figure 4[href=https://www.wicell.org#fig4]G).\nNote: Striking the micromanipulator along the bottom of the embedding mold will transfer the pollen grain into the mold where it will remain (glycerine makes it sticky).\nTo clean the pollen grain, add acetone dropwise into the embedding mold until the mold is half-full (Figure 4[href=https://www.wicell.org#fig4]H).",
    "For infiltration add a few drops of fresh embedding media (1:2, acetone/LV-resin) into the embedding mold (Figure 4[href=https://www.wicell.org#fig4]I).\nNote: Use the micromanipulator to move the pollen grain towards the center of the embedding mold (Figure 4[href=https://www.wicell.org#fig4]J).\nTo prevent pollen grains from adhering to the wall of the embedding mold, a small section from a plastic pipette (1 mL pipette, 5 mm in diameter) is used to restrain the pollen grain in the center of the embedding mold (Figure 4[href=https://www.wicell.org#fig4]K). Use forceps to place the pipette section into the embedding mold and over the pollen grain.\nNote: The plastic section is soft and easily trimmed with a razor blade.\nAgain, use the micromanipulator to move the pollen grain towards the center of the embedding mold.\nLet the sample stand for approximately 15 min at 20°C–22°C (room temperature) until the acetone has evaporated (Figure 4[href=https://www.wicell.org#fig4]L).\nDropwise fill up the embedding mold with embedding media (Figures 4[href=https://www.wicell.org#fig4]M–4O).\nNote: Do not overfill the mold since that might cause the plastic pipette section to float and the suspended pollen grain might get lost (Figure 4[href=https://www.wicell.org#fig4]N).\nIf needed, use the micromanipulator to move and manipulate suspended pollen grains inside the resin towards the center (Figure 4[href=https://www.wicell.org#fig4]P).\nRemaining embedding media can be used to make block holders, and can be filled up in bigger embedding molds (Figure 4[href=https://www.wicell.org#fig4]Q).\nPolymerize the sample and the block holders at 70°C for 6–12 h (Figure 4[href=https://www.wicell.org#fig4]R).\nNote: Polymerization time varies with the amount and type of resin.\nCut the specimen block out from the disposable embedding mold using a razor blade or scalpel (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig5.jpg\nFigure 5. Transmission electron microscopy: Trimming\n(A) Cutting out the specimen block from the disposable embedding mold.\n(B) The pollen grain is positioned close to the flattened distal side of the specimen block (arrowhead).",
    "(C) Under the binocular the pollen grain can be located inside the specimen block (arrowhead).\n(D) Specimen block fixed with two-component epoxy adhesive glue to a pre-made block.\n(E) Example of a ready-made specimen block.\n(F) Example of a ready-made specimen block fixed in a block holder.\n(G) Trimming the specimen block under the binocular using razor blades.\n(H) The soft plastic section can be easily trimmed with a razor blade (black arrowhead). The pollen grain (white arrowhead) is observable in the center of the section.\n(I) Example of a trimmed specimen block, with a trapezoid form, and a final block face between 2 and 4 mm2. The uncoated pollen grain is ideally positioned in the center (arrowhead).\n(J) Example of a trimmed specimen block with a single gold-coated pollen grain inside (arrowhead).\n(K) Specimen block seen from a trimmed side, with the pollen grain located in appropriate level (arrowhead) for sectioning.\n(L) Example of a re-embedded specimen block, with the cut-out part of the specimen block including the pollen turned in the desired position (arrowhead).\nNote: The pollen grain should now be observable with a binocular and positioned close to the flattened distal side of the specimen block (Figures 5[href=https://www.wicell.org#fig5]B and 5C).\nFix the specimen block to a larger and round pre-made block (or any other type of block holder; see Embedding Molds in Zavialova et al., 2018[href=https://www.wicell.org#bib10], pages 123–125), using a two-component epoxy adhesive glue (Figure 5[href=https://www.wicell.org#fig5]D; UHU plus for bigger blocks) or a cyanoacrylate adhesive (Krazy Glue for smaller blocks).\nThe specimen block is now trimmed sidewise into a trapezoid form using razor blades (Figures 5[href=https://www.wicell.org#fig5]E–5K). The size of the final block face should be between 2 and 4 mm2.\nThe specimen block should now be ready for ultrathin sectioning.",
    "Note: If the orientation of the pollen grain needs to be adjusted, the part of the specimen block including the pollen is cut off, turned in the desired position, and re-embedded (Figure 5[href=https://www.wicell.org#fig5]L).\nThe specimen block can now be fixed in a block holder (Figure 5[href=https://www.wicell.org#fig5]F) and adjusted in the specimen-holding arm of the ultramicrotome (Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig6.jpg\nFigure 6. Transmission electron microscopy: Ultramicrotomy\n(A) Ultramicrotome for ultrathin sectioning.\n(B) Specimen block (arrowhead) with block holder adjusted in the specimen-holding arm of the ultramicrotome.\n(C) Block adjustment parallel to the knife-edge (arrowhead).\n(D) Ultrathin sections (50–70 nm, silver to light gold) floating on the water surface.\n(E) Picking up sections with a loop.\n(F) The first ultrathin sections are transferred into a drop of water on a glass slide, to establish when the pollen grain has been reached.\n(G) Transferred sections floating on water drop (arrowhead) are visible by the reflected (interference) light.\n(H) Slide placed on hot plate to speed up the drying process.\n(I) Dry section(s) on the glass slide are stained with toluidine blue for LM analysis.\n(J) Example of an ultrathin section stained with toluidine blue under the LM. The cross section of the pollen wall (black arrowhead) of a fossil pollen grain is now clearly visible in LM with a 10× or 20× objective lens.\n(K) Example of a single fossil pollen grains cut as a whole, in a series of ultrathin sections (70 nm).\n(L) For picking up sections with the loop, the floating section-row(s) are separated into smaller groups (arrowhead) using two micromanipulators (eyelash).\n(M) The stretched sections are transferred onto formvar film-coated copper slot while observing with a stereomicroscope.\n(N) Water is removed slowly using the tip of a pre-cut filter paper.",
    "(O) Grids are stored within a box with the sections facing all the same direction.\nNote: Since the pollen grain is already positioned at the appropriate level for sectioning, semi-thin sections from the tip of the block face are not necessary.\nThe surface of the specimen block is already flat and therefore ultra-thin sections can now be produced using a DiATOME Ultra 45° diamond knife.\nThe knife is placed in the knife holder and the knife boat filled with distilled water.\nThe block has to be adjusted as precise as possible to the knife using the coarse and fine advance capabilities.\nThe block is adjusted parallel to the knife-edge by using the reflecting light (Figure 6[href=https://www.wicell.org#fig6]C).\nThe cutting window is now adjusted before starting the cutting process.\nUltrathin sections (70 nm, Figure 6[href=https://www.wicell.org#fig6]D) are cut with a slow cutting stroke (cutting speed of 1mm/s) and slow return speed.\nTo establish if the pollen grain has been reached, when contrasting structures appear in the ultrathin sections, a section is picked up for observation with LM (Figures 6[href=https://www.wicell.org#fig6]E–6J).\nA single section is isolated using micromanipulators (eyelashes), picked up with a loop, and transferred into a drop of water on a glass slide (Figures 6[href=https://www.wicell.org#fig6]E–6G).\nThe slide is placed on a hot plate (70°C; Figure 6[href=https://www.wicell.org#fig6]H). The dry section is then stained with toluidine blue for a few seconds (Figure 6[href=https://www.wicell.org#fig6]I), washed with distilled water, and viewed under LM (Figure 6[href=https://www.wicell.org#fig6]J).\nIf the pollen grain has been reached, the cutting process can continue.\nThe single fossil pollen grains can be cut as a whole (Figure 6[href=https://www.wicell.org#fig6]K), in a series of ultrathin sections (70 nm).\nSeparate the floating section-row(s) into smaller groups (Figure 6[href=https://www.wicell.org#fig6]L) using two micromanipulators (eyelash) so the section groups can be picked up with a loop.",
    "Note: Depending on the size, a group can contain as many sections as fit within the loop.\nStretch the sections before picking them up using xylol. Use a small piece of filter paper moistened with a drop of xylol and move it closely above the sections floating on the water surface.\nNote: The xylol vapors stretch the sections and they become thinner.\nUse a loop to transfer the stretched ultra-thin sections and place them onto a formvar film-coated copper slot grid while observing with a stereomicroscope (Figure 6[href=https://www.wicell.org#fig6]M).\nSlowly remove water from the loop using the tip of a pre-cut wedge shaped filter paper touching the twisted end of the loop (Figure 6[href=https://www.wicell.org#fig6]N).\nTransfer the grid(s) using curved tip forceps into a grid-box. Make sure that all grids are oriented in the same direction within the box so all the sections are facing the same direction (Figure 6[href=https://www.wicell.org#fig6]O).\nWrite a sectioning protocol, including specimen details and grid-box number.\nStore the box upside down or away from light to protect the sections from light.\nFor staining, treat the ultra-thin sections on the copper grids with 1% aqueous potassium permanganate solution (Figures 7[href=https://www.wicell.org#fig7]A–7C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1136-Fig7.jpg\nFigure 7. Transmission electron microscopy: Staining and analysis\n(A) The ultra-thin sections on copper grids are stained in drop(s) of 1% aqueous potassium permanganate solution (black arrowhead) on a piece of parafilm.\n(B) The staining solution is washed out in large drops of distilled water. The forceps are used to transfer the grid(s) and place them with the section-side directed downwards onto the drop(s).\n(C) Rows of water drops showing the grids floating on the water surface.",
    "(D) Example of an overview micrograph showing the cross section of a single pollen grain (Parthenocissus) from the abdomen of a fossil fly observed with TEM. Note the electron-dense gold-coating (arrowhead). Scale bar: 10 μm.\n(E) Example of a close-up micrograph in interapertural area of a pollen (Parthenocissus) wall from the abdomen of a fossil fly observed with TEM. Note the electron-dense gold-coating (arrowhead). Scale bar: 1 μm.\n(F) Example of a close-up micrograph in interapertural area of a pollen (Parthenocissus) wall from the abdomen of a fossil fly observed with TEM. Note the electron-dense gold-coating (arrowhead). Scale bar: 1 μm.\nPlace small drop(s) of potassium permanganate solution, using a pipette, on a piece of parafilm (Figure 7[href=https://www.wicell.org#fig7]A).\nUse forceps to transfer the grid(s) from the box and place them with the section-side directed downwards onto the staining drop(s). Stain the sections for 5–7 min.\nMake a row of 3–5 large drops of distilled water on a piece of parafilm for washing (Figure 7[href=https://www.wicell.org#fig7]B).\nTransfer the grids from the staining agent using the forceps and wash each grid three times for 5 min in the water drops (Figure 7[href=https://www.wicell.org#fig7]C).\nPut the grids back into the grid box using the forceps and use a piece of filter paper to soak water from the grids.\nThe ultra-thin sections are now ready for TEM analysis.\nStudy the ultrastructure of the pollen wall with TEM. Make sure to photograph both interapertural (Figures 7[href=https://www.wicell.org#fig7]E and 7F) as well as apertural areas. Note all pollen wall peculiarities."
  ],
  "subjectAreas": [
    "Evolutionary Biology",
    "Microscopy",
    "Earth Sciences",
    "Plant Sciences"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Ecology & Environmental Biology"
  ]
}