{
  "id": 19301,
  "origin_website": "Jove",
  "title": "A Model of Disturbed Flow-Induced Atherosclerosis in Mouse Carotid Artery by Partial Ligation and a Simple Method of RNA Isolation from Carotid Endothelium",
  "procedures": [
    "1. Partial ligation of the left carotid artery\nMice are used at ~ 8 weeks of age. The weight of the mice is recommended to be at least 18 grams.\nSterilize the instruments for 30 second in bead instrument sterilizer and allow to cool down\nInduce anesthesia with Ketamine (80mg/kg) and Xylazine (10mg/kg) intraperitoneal (i.p.) injection or alternative anesthesia as approved by IACUC.  For i.p. injection, inject mouse in the left low quadrant of abdomen.\nPlace mouse in a warming chamber until completely anesthetized. Verify depth of anesthesia with response to toe pinch.\nPlace mouse on a surgical stage, in supine (belly side up) position. Tape the fore-paws palms up and the hind-paws sole down to the stage.\nApply liberal amount of depilatory agent (e.g. Nair) to neck between the mandible and the sternum. Gently massage until all hair is removed.\nClean off the depilatory agent and apply liberal amount of Betadine to depilated area.\nPrepare 1 inch-long sections of 6-0 silk suture for ligations. Each mouse will need two pieces of suture.\nUsing a sharp small scissors, make a 4-6mm vertical incision in the middle of the neck. Both the skin and the underlying fascia need to be cut.\nMove the left parotid gland from the midline to the left and start bluntly dissecting just right of the trachea. You should be able to identify the pulsating left common carotid easily.\nFollow the common carotid caudally until you locate the bifurcation.\nBluntly dissect the bifurcation to expose the following four distal branches off the left common carotid artery: external carotid artery, internal carotid artery, occipital artery and superior thyroid artery. These vessels, especially superior thyroid, can be fragile. Be very careful with your dissection.",
    "Tie off the external carotid ABOVE the superior thyroid using 6-0 silk suture. To do this, pass one forceps underneath the artery and grab a piece of precut suture with the help of your other forceps. Gently pull the suture to pass underneath the artery. Tie firmly avoiding any surrounding tissue being caught in the knot. If you tie below the take off of the superior thyroid artery, by the end of the procedure you will effectively have performed a complete ligation which is a substantially different model.\nTie off the internal carotid and occipital arteries with one knot using the same technique.\nVerify position of sutures and patency of superior thyroid artery.\nApproximate the skin and close skin using a small amount of Tissue-Mend.\nPlace mice in a warming chamber until recovery. Recovery typically takes 30 to 60 minutes.\nA single dose of Buprenorphine (0.1mg/kg) should be administered immediately post surgery if the anesthesia used does not provide prolonged pain relief (ie. inhaled isoflurane) or if animal is in distress within the first 24 hours. In our experience, the Ketamine dose administered for anesthesia provides sufficient analgesia when surgery is performed by experienced surgeon and no further analgesia is needed.\n2. Carotid ultrasound examination\nTo validate whether the partial ligation induced disturbed flow, carotid flow should be examined one day post-ligation\n Induce anesthesia with isoflurane - anesthesia induction box could be used if needed\nPlace anesthetized mice on imaging stage, belly side up\nTape arms and legs to ECG sensor on imaging stage\nDefoliate neck by liberal application of Nair (this step is only needed if not already done for ligation procedure)\nInsert rectal thermometer to record temperature\nApply Echo gel to neck\nStart in B-mode.",
    "Imaging plane should be 90 degrees (knob on probe should point toward the nose of mouse) \nLower probe on to mouse neck until image is obtained.\nManipulate stage left and right until trachea (mid-line structure) is identified\nIdentify left common carotid artery\nTilt imaging stage so that an angle is created between imaging plane and the carotid. The greater this angle, the stronger the Doppler signal will be.\nPlace pulse wave Doppler in middle of left common carotid.\nUse angle correction as needed.\nRepeat measurements on the right common carotid.\nSuccessful partial carotid ligation will result in overall reduction in flow (~80-90%) in the left common carotid compared with the right side, with reversal of flow towards aortic inlet during diastole.\nOnce satisfactory images have been obtained, turn off anesthesia, wipe echo gel off mice and free mice from tape restraints. Place mice in warmed recovery chamber.\n3. Intimal RNA isolation from carotid\nSacrifice mice by CO2 inhalation according to the institutional IACUC protocol\nTape the paws to a paper towel.\nCut the skin of the mouse from the abdomen to the top of the thorax.\nOpen the abdominal wall below the ribcage with a sharp pair of scissors.\nLift the sternum with forceps and cut the diaphragm, then cut away the ribcage to expose the heart.\nCut the vena cava with scissors.\nPressure perfuse (120 mmHg) for 2 to 3 min with normal saline containing 10 Units/mL heparin through the left ventricle until the lungs and liver become pale.\nCut the skin of the neck and remove all the fat, muscles, and connective tissues until the carotid arteries are exposed.\nPlace the mouse under a dissecting microscope.\nPuncture a hole right below the ligation sites in the left carotid for the second perfusion.",
    "Pressure perfuse again for ~ 1 min with normal saline containing 10 Units/mL heparin through the left ventricle, making sure the left carotid is well perused.\nUsing a fine tip forceps and small spring scissors, carefully remove the peri-adventitial tissues surrounding the carotids. Be careful not to squeeze or stretch the carotids during this cleaning step.\nCut the left carotid artery between the aortic arch and the ligation points above the carotid bifurcation.\nCut the right carotid artery between the right subclavian artery branching point and the carotid bifurcation.\nTransfer the carotids to a 35 mm culture dish, containing ice-cold HBSS. If needed, carefully remove any remaining peri-adventitial tissue.\nPrepare an insulin syringe (3/10 ml syringe) with a 29g needle by filling with 150 μl QIAsol lysis buffer (Qiagen) per each carotid.\nCarefully insert tip of needle into one end of the carotid.\nWhile holding the carotid and the tip of the needle with a forceps, quickly (~ 1 sec) flush the QIAsol lysis buffer (150 μl) into a 1.5ml tube (intima eluate). \nRinse the carotid leftover (media+adventitia) once in HBSS, put it in a 1.5 ml tube, and snap-freeze in liquid nitrogen. \nIntima eluate and the frozen leftover are then used for intimal or media+adventitia RNA isolation using the miRNeasy mini kit (QIAGEN) according to the manufacturer's instructions.\n4. Representative Results:",
    "We partially ligated mouse left carotid arteries and ultrasound examination was carried out one day following the procedure. As shown in Figure 1, successful partial ligation reduces blood flow velocity and reverses flow (disturbed flow) in the left common carotid artery during diastole. Partial ligation of ApoE knockout (KO) mice accompanied by a high fat diet induces robust atherosclerosis in the left common carotid artery(LCA), but not in the contralateral right carotid, by two weeks (Figure 2). RNA collected from the carotid intima contains endothelial marker genes such as PECAM-1, while free of medial smooth muscle cell marker genes such as a-SMA (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/1861/1861fig1.jpgFigure 1: Schematic of carotid anatomy and ligations: Three branches of the left common carotid artery (LCA) [external carotid artery (ECA), internal carotid artery (ICA), and occipital artery (OA)] were ligated, while leaving the superior thyroid artery (STA) open.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1861/1861fig2.jpgFigure 2:  The ultrasound images show flow velocity profiles and reveal that partial ligation induces flow reversal (indicated by arrows) in LCA during diastole. Flow in RCA remains unchanged after ligation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1861/1861fig3.jpgFigure 3: Partial ligation and high-fat diet rapidly induces atherosclerosis in LCA of ApoE KO mice.  ApoE KO mice were partially ligated and fed the high-fat diet for 1 to 3 weeks. Frozen sections from LCA were stained with Oil-Red-O.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1861/1861fig4.jpgFigure 4. Method of intimal RNA preparation.  Intimal RNA and medial+adventitial (m+a) RNA were obtained from sham-operated RCA and LCA in C57BL/6 mice.  RNAs were analyzed by semi-quantitative RT-PCR (A) and qPCR (B, C) for PECAM-1 and α-SMA using 18s as an internal control. Bar graphs are mean ± SEM, n=3.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}