{
  "id": 13142,
  "origin_website": "Jove",
  "title": "Differentiation of Porcine Induced Pluripotent Stem Cells (piPSCs) into Neural Progenitor Cells (NPCs)",
  "procedures": [
    "These experiments were approved by the Ethics Committee on Animal Experimentation of the Faculty of Animal Science and Food Engineering, University of São Paulo (permit numbers: n° 5130110517 and n°4134290716).\nNOTE: All procedures involving cellular culture and incubations are performed in a controlled atmosphere (38.5 °C and 20% CO2 in air, maximum humidity). Cellular passaging was performed by 5 min incubation with dissociation reagent and cells were recovered after centrifugation (300 x g).\n1. Porcine fibroblast reprogramming into iPSC\nExperiment preparation\n\t\nPrepare fibroblast and 293 culture media consisting of Iscove's Modified Dulbecco's Medium (IMDM) supplemented with 10% fetal bovine serum (FBS), 0.1 mM non-essential amino acids, and 1% antibiotics (penicillin/streptomycin) unless otherwise stated.\nPrepare iPSC culture medium (reprogramming medium) consisting of low osmolality DMEM/F12 (optimized for the growth of human embryonic and induced pluripotent stem cells) supplemented with 20% serum replacement, 0.1 mM non-essential amino acids, 1 mM glutamine, 3.85 µM β-mercaptoethanol, 10 ng/mL bFGF, and 1% antibiotics.\nWhen needed, seed mouse embryonic fibroblasts (MEFs) into a T75 flask (10 mL) to obtain 70-80% confluency in the following day (approximately 6 x 105 per T75). The next day, inactivate by a 2 h 30 min incubation with 200 µL of 0.5 mg/mL mitomycin C (add mitomycin in the T75 containing MEFs without prior media change).\nAfter the incubation period, recover cells after incubation with a dissociation solution for 5 min and seed into wells previously coated with gelatin in a 6 well plate at a 1x105 concentration.\nCoat wells by incubating it with an 0.1% gelatin solution for 20 min at 37 °C (approximately 1 mL of gelatin solution per well to cover the entire well) and immediately aspirate. Then, remove the solution and replace with culture medium (2 mL per well).\nTransfection and lentiviral production",
    "Culture 293 cells in T75 culture flasks until it reaches approximately 90% confluency.\nDissociate cells and seed 5 x 106 cells per new T75 flask without antibiotics.\nThe next day, prepare two solutions per flask (T75) for transfection: 1: 1.5 mL of IMDM (no antibiotics, no serum) with the appropriate concentration of each vector (12 µg of OSKM; 1.2 µg of TAT; 1.2 µg of REV; 1.2 µg of hgpm2, and 2.4 µg of VSVG2°generation,); and 2: 1.5 mL of IMDM (no antibiotics, no serum) plus 36 µL of lipofection reagent (or as recommended by the manufacturer) 15.\nMix the solutions and incubate for 15 min.\nMeanwhile, replace the medium of the 293 cells, adding only 7 mL of IMDM supplemented with 10% FBS per flask.\nAfter the incubation period, add 3 mL of the lipofection reagent + plasmids in each flask. Replace the medium with IMDM 10% FBS after 6 h (optional).\nCollect medium (complete volume - 10 mL per T75) at the 24, 48, and 72 h time points. Filter it with a 0.45 mm PVDF filter and weigh it for balancing before ultracentrifugation.\nCentrifuge for 1 h 30 min hour at 48,960 x g.\nDiscard supernatant by pouring and incubate the remaining content (approximately 200 µL) for 1 h at 4 °C.\nResuspend viral pellet delicately pipetting up and down several times and aliquot viral solution.\nTransduction\n\t\nSeed 2x104 fibroblasts per well of a 6-well plate. Include wells for molecular analysis (e.g., PCR) and transduction controls (e.g., GFP analyses) (optional).\nThe following day, remove 1 mL of medium and add 1 µL of hexadimetrine bromide (8 µg/mL) and 50 µL of the viral solution.\nIncubate for 3 to 4 h, followed by a complete medium change (2 mL) (Day 0).",
    "Culture cells for 5 days, changing medium every 2 days.\nPreviously prepare 0.1% gelatin-coated and MEF plates as described in item 1.1.3.\nTo dissociate cells and replate cells in reprogramming medium, wash wells using 1 mL phosphate-buffered saline solution (PBS). Remove PBS.\nAdd 1 mL of dissociation reagent per well and incubate the cells at 37 °C for 5 min.\nTransfer cells to a conical tube and centrifuge cells for 5 min at 300 x g and resuspend them in 1-3 mL of iPSC culture medium.\nCount the cells using a Neubauer chamber or a cell counter equipment and seed them at a 1-2 x 104 concentration into previously 0.1% gelatin-coated and MEFs covered wells.\nChange iPSC culture medium every 2 days.\niPSC colonies (at passage 0, P0) will appear at approximately 10 days of the reprogramming period. Manually pick morphologically typical colonies (round edges and cells with a high nuclear-cytoplasm ratio) using a 26 G needle to detach colony and surrounding MEFs.\nTransfer 1 colony per new well, individually, using a 10 or 100 µL pipette tip, for clonal culture and characterization of putative iPSC cell lines.\nPorcine iPSC passaging\n\t\nManual passaging and colony picking\n\t\t\nClean and transfer an inverted microscope into a laminar flow hood.\nSterilize the microscope with ultraviolet (UV) light for 15 min.\nWash previously gelatin and MEF coated wells with PBS prior to colony transfer. Remove PBS.\nAdd 2 mL of iPSC medium.\nLocate the colony of interest in the well that will be used.\nUsing the bevel of an insulin syringe needle, separate the colony from surrounding cells.\nIf the colony is small, detach it from the well by pipetting medium up and down its borders with a 10 µL pipette.",
    "If it is a larger colony, cut it into a few smaller segments with the needle.\nAspirate the colony or colony's fragments with a 10 µL pipette.\nTransfer it to the new well.\nEnzymatic passaging of clonal lines\n\t\t\nWash wells using PBS. Remove PBS.\nAdd 1 mL of dissociation reagent per well and incubate the cells at 37 °C for 5 min.\nTransfer approximately 100 µL of cells to a new well. This amount may vary among different cell lines; therefore, daily visual analysis of confluency is highly recommended.\n2. Porcine iPSCs induction into NPCs\nExperiment preparation\n\t\nPrepare Neural Induction Medium (NIM) composed of 50% Neurobasal medium and 50% DMEM/F-12 supplemented with B27-Minus Vitamin A (20 µL/mL), N2 (10 µL/mL), 1 mM glutamine (10 µL/mL), penicillin-streptomycin (1 µL/mL). Filter the solution in a 0.22 µm filter and add BMP signaling inhibitor LDN193189 and ALK inhibitor SB431542 at a final concentration of 0.1 µM and 10 µM, respectively.\nCoat wells of a 6 wells plate with 1 mL of matrix solution and incubate at 37 °C for at least 30 minutes. Remove matrix solution and add E8 medium for iPSCs culture.\nOn day 13 of the induction protocol, prepare Neural Expansion Medium (NEM) composed of 50% Neurobasal medium and 50% DMEM/F-12 supplemented with B27-Minus Vitamin A (20 µL/mL), N2 (10 µL/mL), NEAA (10 µL/mL), 1 mM glutamine (10 µL/mL), penicillin-streptomycin (1 µL/mL). Filter the solution in a 0.22 µm filter and add FGF2 and EGF to be at an end concentration of 10 ng/mL.\nInduction protocol\n\t\nThe day before the iPSCs reaches 100% confluency, transfer cells into a new well (1:1 split). Wash the well by adding 1 mL of PBS. Remove PBS.\nAdd 1 mL of 0.5 mM EDTA and incubate cells at 37 °C for 5 min.",
    "Remove EDTA and add 1 mL of E8 culture medium.\nGently wash cells off the well and transfer the contents into a new well previously coated with matrix solution.\nThe following day, wash wells with PBS. Remove PBS and add 2 mL of NIM.\nChange induction medium every day for 14 days.\nOn day 14, wash wells using PBS. Remove PBS.\nAdd 1 mL of cell dissociation reagent per well and incubate the cells at 37 °C for 5 min.\nTransfer cells to a conical tube and centrifuge cells for 5 min at 300 x g and resuspend them in 6 mL of NEM medium.\nAdd 60 µL (10 µL/mL) of a post-thaw recovery solution and transfer 2 mL of the solution to each matrix-coated well.\nChange NEM medium the next day, and then at every two days.\n\t\t​NOTE: Each well that went through the induction protocol is considered to give rise to a new NPC line. Therefore, their respective cells should not be mixed.\n3. NPC passaging\nWash well with 1 mL of PBS. Remove PBS.\nAdd 1 mL of cell dissociation reagent and incubate cells at 37 °C for 5 min.\nGently wash cells of the well and transfer the contents into a conical tube.\nCentrifuge the solution for 5 min at 300 x g. Remove the supernatant and add 6 mL of NEM.\nGently homogenize the pellet and transfer 2 mL of the solution to a new well previously coated with matrix solution.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}