{
  "id": 4092,
  "origin_website": "Cell",
  "title": "Super-STORM: Molecular Modeling to Achieve Single-molecule Localization with STORM Microscopy",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nAssemble the Microfluidic Device\nTiming: ∼3 h\nCoat the coverslip of the microfluidic device with the biological molecules of interest, for example, coat 2 μg·mL−1 human P-selectin-Fc and 10 μg·mL−1 human ICAM-1-Fc for 2 hours at 22-24°C on a 25 mm diameter round coverslip as in Fan et al., 2019.\nCoat nanodiamonds, 100 nm diameter fiducial markers together with proteins in step 1. 1:500 dilution from the original concentration.\nBlock with 1% casein for 30 min at 22-24°C.\nWash twice with PBS.\nAssemble the flow chamber under buffer to avoid buffer-air interfaces (Figure 5[href=https://www.wicell.org#fig5])\nPrepare Petri dishes (50 mm diameter) with a hole in the bottom (15 mm diameter).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/83-Fig5.jpg\nFigure 5. Microfluidic Set Up\nThe PDMS microfluidic chip is sealed on top of a 1.5# 25mm-diameter coverglass by magnetic clamp to form nine parallel microfluidic channels with a height of 29 μm and a width of 300 μm. The coverglass is coated with adhesion molecules (2 μg·mL−1 P-selectin, 10 μg·mL−1 ICAM-1) to support leukocyte rolling and adhesion. The shear stress is generated by modulating the water-level between inlet and outlet reserves.\nCell Isolation and Labeling\nTiming: ∼1–1.5 hours\nNote: This can be performed during the 2-hour coating of coverslips.\nIsolate cells from culture, blood or tissue. Polymorphoprep was used for the isolation of human neutrophils from blood in Fan et al., 2019. Wash with PBS without Ca2+ and Mg2+ twice.\nResuspend the cells in RPMI-1640 without phenol red plus 2% HSA.\nNote: Culture media may vary for different cell types.\nAdd cell surface label by membrane dyes (a, b) or evenly distributed surface molecules (c)\nCellMask Green, CellMask Orange, CellMask Deep Red\nDiO, DiI, DiD",
    "A fluorescently labeled antibody/F(ab) to an abundant GPI-anchored cell surface antigen, such as CD16 on neutrophils as in Fan et al., 2019. Cells were stained with AF488-anti-CD16 antibody (1 μg·mL−1) for 10 min at 22-24°C, washed twice with PBS, and resuspended in RPMI-1640 without phenol red plus 2% HSA.\nNote: In most cases, an abundant GPI-anchored cell surface antigen is the best to label cell surface due to minimum bleed through. However, it may be hard to find a homogenously distributed molecule for the cell type of interest. Membrane dyes in a and b might be too bright and may interfere with STORM imaging, especially that short-wavelength dyes may bleed through to long-wavelength channels. Using a lower concentration of the membrane dyes may be helpful. Using a long-wavelength dye (CellMask Deep Red or DiD) may avoid the bleed through but will occupy the best STORM imaging channel (AlexaFluor 647 or Dylight 650).\nWash with PBS without Ca2+ and Mg2+ twice after staining. Then resuspend the cells in RPMI-1640 without phenol red plus 2% HSA.\nLabel the molecules of interest: Integrin extension (E+) and high affinity (H+) were reported by F(ab) fragments of KIM127 and mAb24, respectively. Cells (5 × 106 mL−1) were incubated with KIM127 and mAb24 F(ab) fragments (5 μg mL−1 each) at 22-24°C for 3 min and perfused into the microfluidic chamber without F(ab) separation.\nLabel the molecules before the fixation to avoid any epitope loss by the fixation.\nThere is an increase of integrin activation epitopes upon IL-8 stimulation during neutrophil rolling and arrest. There may also be a change in expression (number of molecules). This may require additional controls, like a F(ab) that binds the molecule of interest independent of its conformation.",
    "For molecules that do not change their level of expression, label the molecules of interest in the appropriate condition. Wash cells before perfusing into the flow chamber to reduce the background of unspecific binding on the coverslip.\nPause Point: Potential pause point up to 2 hours\nSample Preparation\nTiming: ∼1 hour\nAdd cells (5 × 106 ml-1) to the reservoir of the microfluidic device (cell concentration may vary depending on the cell type and microfluidic device)\nApply pressure to start the flow.\nAdd activator (for example, IL-8 for human neutrophils, 10 ng·mL−1, 12 s in Fan et al., 2019[href=https://www.wicell.org#bib4]) The process of neutrophil rolling and arrest is shown in Figure 6[href=https://www.wicell.org#fig6].\nAdd fixation buffer (for example, add the same volume of 16% PFA to the reservoir, final concentration 8% in Fan et al., 2019[href=https://www.wicell.org#bib4]) for 5 min, keep perfusing while observing cells using a bright-field microscope.\nWash for 5 min using the same buffer in which the cells are suspended, without any air bubbles.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/83-Fig6.jpg\nFigure 6. Neutrophil Rolling and Arrest\nRepresentative bright-field images showing the process of neutrophil rolling and arrest on the substrate of P-selectin/ICAM-1/IL-8 under a shear stress of 6 dyn·cm-2. Scale bar is 10 μm.\nCritical: This avoids generating an interface that could detach the cells.\nOptional: Add your labeled antibodies/F(ab)s to the perfusate for 5 minutes to saturate the labeling.\nOptional: Wash for 5 min with the same buffer in which the cells are suspended.\nDisassemble microfluidic device\nCritical: Glue the coverslip into the hole of the Petri dish with Super Glue (Gorilla) to avoid any leakage or movement/drifting, and cells face up.\nFill the Petri dish with 2 mL PBS.\nPause Point: Up to 24 hours\nSTORM Imaging\nTiming: ∼3–4 hours",
    "Transfer the sample to the microscope, for example Nikon Ti super-resolution inverted microscope, equipped with a 100x 1.49 NA Plan Apo TIRF oil objective and an ANDOR IXON3 Ultra DU897 EMCCD camera (The EM gain we used was 300 in the Nikon system), field of view 82 × 82 μm2, should contain about 3-7 cells, TIRF mode at 80 degrees incident angle.\nCritical: Replace PBS with 2 mL freshly made STORM buffer in the Petri dish.\nAcquire one TIRF image (Figure 7[href=https://www.wicell.org#fig7]A) at each wavelength (low laser power (typical 0.5%–2%) and 200 ms exposure time, typically one for the surface marker, 2 for molecules of interests, and an optional one to distinguish different cell subtypes)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/83-Fig7.jpg\nFigure 7. TRIF and STORM Images of Integrin Activation\nRepresentative images of KIM127 (magenta) and mAb24 (cyan) on the footprint of an IL-8 triggered arrest neutrophil on the substrate of P-selectin/ICAM-1. (A) TIRF image, adopted from Figure 1[href=https://www.wicell.org#fig1]A in Fan et al., 2019. (B) Pointillism map of the localization data from the STORM acquisition, adopted from Figure 2[href=https://www.wicell.org#fig2]A in Fan et al., 2019. Scale bar is 1 μm.\nNote: laser power and exposure time may vary due to different microscopy setup. A setting giving a signal-to-noise ratio larger than 5 should be applied.\nAcquire raw images from the exact same field of view (high laser power, typically 50%, and 10ms exposure time), typically 20,000 frames per channel, in the two channels (back and forth) imaging the fluorochromes that were used to label the molecules of interest",
    "Note: laser power and exposure time may vary due to different microscopy setup. You want to use high power to put all the fluorochromes in the dark state so they can “blink” well. You want to have a very short exposure time so two “blinks” within the diffraction limit (∼200-300 nm) will not be “on” in the same frame. In our study (Fan et al., 2019[href=https://www.wicell.org#bib4]), the power of the 488, 561, and 647-nm lasers was adjusted to 50% to enable collection of between 100 and 300 blinks per 256 × 256-pixel camera frame in the center of the field at appropriate threshold settings for each channel. The number of frames acquired may vary from 10,000 to 60,000. It is advisable to test different numbers of frames and determine where the image stops improving. There are several quantitative metrics for determining the number of acquisition frames (Culley et al., 2018[href=https://www.wicell.org#bib1]; Endesfelder et al., 2014).\nDuring step 20, apply an automatic drifting correction (implemented in the Nikon N-STORM software) using fiducial markers (nanodiamonds in Assemble the microfluidic device step 2)\nNote: Most vendors have their own drifting correction software implemented.\nDetermine the localization of molecules using 2D Gaussian fitting (implemented in the Nikon software)\nNote: The effective lateral resolution needs to be smaller than the size of the molecule studied.\nGenerate and store data sheets of all STORM localizations, which can be shown as a pointillism map (Figure 7[href=https://www.wicell.org#fig7]B).\nRegister the TIRF image from step 19 with the STORM positions\nTake advantage of the fiducial markers\nGenerate a STORM image using ThunderSTORM: “Visualization” – “Visualization options” – “Normalized Gaussian” – “Lateral Uncertainty” = λ/2/N.A. (λ is the excitation wavelength) – “OK”\nRegister the TIRF image with the STORM image using bUnwrapJ Plugins in FIJI-ImageJ.",
    "Convert TIRF signal to distance map using NanoHills (Github)\nPause Point: (time unlimited)\nAnalysis of STORM Images\nTiming: (∼3–4 hours for each dataset)\nSample data is available in the Supplemental Dataset 2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/83-Mmc2.zip].\nEliminate multiple blinks from each F(ab) or scFv using the molecular cut-off in Molecular modeling prep work steps 8-9\nIdentify clusters using the molecular cut-off from Molecular modeling prep work step 11\nIdentify pairs using the molecular cut-off from Molecular modeling prep work step 17\nCalculate the distance distributions for each of the conformations your antibodies/F(ab)s report using Imaris Plugin software (in Fan et al., 2019[href=https://www.wicell.org#bib4], we had 3 visible conformations: E+H−, E−H+, E+H+. E−H− was invisible because we used no conformation-independent antibody)\nCompare measured distributions, for example to\nRandom\nFace-to-face\nParallel\nBack-to-back"
  ],
  "subjectAreas": [
    "Single-Molecule Assays",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}