{
  "id": 4868,
  "origin_website": "Bio",
  "title": "Observation of Chloroplast Movement in <em>Vallisneria</em>",
  "procedures": [
    "Plant material and pretreatment of specimensYoung plants of Vallisneria of 20-30 cm long were purchased at a tropical-fish store and cultured in buckets (20 L) filled with tap water and with a layer of soil at the bottom (Figure 1C). The plants were grown under 12 h light/12 h dark regime at 20-24 °C. The light source was a bank of 20 W fluorescent lamps (50 μmol m-2 s-1, Figure 1C). The following steps A2-7 were carried out at 20-24 °C. At the end of the light period, healthy leaf segments of 10 cm long taken between 30 and 40 cm from the base of shoots, which had grown over 100 cm, were cut into smaller pieces about 4 mm in length and were put into artificial pond water (APW).The air trapped in the intercellular spaces was evacuated using a desiccator connected with a rotary vacuum pump for 20 min. Each 4 mm length leaf piece was further cut open and separated into adaxial half and abaxial half (Figure 2A; Sakurai et al., 2005). Each adaxial half was floated in a separate vessel with fresh APW and kept under another cycle of 12 h light/12 h dark regime. The leaf piece was mounted on a glass slide with a coverslip so that the epidermal cells could be seen from above, and secured with white Vaseline (Figure 2B). Each specimen was immersed in fresh APW in a Petri dish (Figure 2B) and kept under weak white light (2 μmol m-2 s-1) from the fluorescent lamps for 6 h. They were further kept in complete darkness for another 12-20 h.",
    "Time-lapse light microscopy for observation of chloroplast movementThe dark-adapted specimen was irradiated with blue light (488 nm, 80 μmol m-2 s-1) on the stage of a microscope from above through the objective lens, using the epi-illumination system with a dichroic mirror and a mercury lamp (Figure 2C). The fluence rate of blue light was adjusted manually with neutral-density filters.The specimen was observed with dim green light (550 nm, 10 μmol m-2 s-1) produced by combination of an interference filter (the maximal transmission is 35%) and a cut-off filter, according to Izutani et al. (1990), applied from below. Although many of the plant photoreceptors are known to absorb light in green region, we confirmed that light of 550 nm at this fluence rate barely affects chloroplast movement and cytoplasmic motility in Vallisneria (Izutani et al., 1990; Takagi et al., 2003).Note: The fluence rate of monochromatic light was measured with a quantum sensor and data logger.Before and during the actinic blue-light irradiation, optical images were captured digitally with a charge-coupled device camera at 5-sec intervals (Figure 2C). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151103/20151103021212_0501.jpgFigure 3. Observation of chloroplast movement. A. Scheme to prepare the adaxial leaf piece. Double-headed arrow; the longitudinal axis of leaf. Shadowed plane; cutting plane to make the adaxial and abaxial halves of leaf piece. B. Preparation of the specimen before the dark adaptation. APW; artificial pond water. C. Optical system. BL; blue light (488 nm, 80 μmol m-2 s-1), GL; green light (550 nm, 10 μmol m-2 s-1), ND; neutral density, CCD; charge-coupled device, PC; personal computer. D. Serial images of an epidermal cell arranged at 1-min intervals. At 0 min, the cell was exposed to blue light. Bar, 10 μm.The number and position of chloroplasts on each digital image were recorded for movement analyses.",
    "A series of digital images can also be assembled into a movie (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Avoidance movement of chloroplasts in Vallisneria. A series of 5-sec interval images for 1 min before and 19 min during the blue-light irradiation were stacked into a movie (12 frame per sec). Bright flash in the movie means the start of the irradiation. Bar, 10 μm. When necessary, before the start of observation, specimens were perfused with APW containing various kinds of chemicals, for example, inhibitors of photosynthetic electron transport, cytoskeleton-disrupting reagents, and intracellular-calcium-transient inhibitors. All the procedures were carried out under dim green light (0.03 μmol m-2 s-1)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}