{
  "id": 19250,
  "origin_website": "Jove",
  "title": "In Vivo Canine Muscle Function Assay",
  "procedures": [
    "1. Setting up for the experiment\nLoad the Dynamic Muscle Control (DMC) software.\nPower up the physiology rig following manufacturer’s instructions.\nRunning the DMC software:\nIt is assumed that the hardware is connected to the computer that runs the DMC software, and that the system is calibrated. The software \nmay be revised from time to time; therefore, instructions are provided below relevant to the current software version that we use. When the software is opened, it is \nalready running.\nThe user can initially write a protocol in DMC (e.g., to stimulate at 50 Hz  for 1.5 s to produce an isometric tetanus) and the protocol can \nthen be saved for subsequent use. We use two standard protocols: (1) isometric contraction protocol (e.g., twitch or tetanus); and (2) eccentric \nstretch-injury protocol. We start with the isometric contraction protocol for the twitch. To optimize the twitch, the Monitor Outputs screen is used; torque generated during the twitch can be \nobserved as the electrodes are moved. When the maximum twitch response is achieved, the data are collected by returning to the main screen (select Continue) and selecting \nBegin and Done. Files are saved from the Save As pop-up window. With the electrodes maintained in the same position, a tetanus (50 Hz) is then collected and saved.  \nWhen all isometric contractions are completed, the eccentric stretch-injury protocol can be loaded and run. Because there are a series of contractions to be executed \nin this protocol (10 contractions), on the main screen the Run One button is selected to reveal Run All status. Now when Begin is selected, a Run All Protocols pop up \nwindow appears that asks for the root file name and the directory into which the files are to be saved. Then, Start Protocol Series Test and Done are selected to",
    "initiate the eccentric protocol. The files are saved automatically into the selected Directory.\n2. Positioning the animal in the physiology rig\nAnimal care and use committee (ACUC) guidelines must be followed for all procedures involving animals.\nAnesthetize dog using inhalation anesthesia (such as isoflurane) according to approved protocol. Check blink reflex to be sure that the animal is deeply \n\tanesthetized. CO2 monitoring, pulse oximetry and temperature should be closely monitored during the entire procedure. We typically use propofol for \n\tinduction followed by sevoflurane for inhalation anesthesia.\nShave the hair around the lateral stifle (knee) where the stimulating electrodes will be placed (i.e., the lateral aspect of the limb beginning at the fibular \n\thead to 2-3 cm distal to the greater trochanter.\nPosition dog on the physiology table in dorsal recumbency with the pelvic limb positioned so that the femur and tibia make a right angle, and the tibia \n\tis parallel to the tabletop. Either the right or left limb may be tested.\nPrior to attaching dog paw to force pedal, check to insure that the force pedal is clear and safe to rotate. Follow the powering on procedure for the \n\tphysiology rig and activate the pedal. Note: the force pedal should be \"stiff\" when the user attempts to move it manually.\nGently rest the dog’s paw in the foot pedal; measure and record the length of the dog’s paw from the center axis of rotation to the end of the lateral digit.\nSecure the paw in the foot pedal using elastic self-adhering wrap. \n3. Isometric twitch torque (tibiotarsal flexion)\nFollowing a safety check, connect sterile shielded monopolar 24-gauge stimulating electrodes to the stimulus isolation unit (SIU). \nSet the stimulator to: continuous pulse output at 1 Hz (1 pulse per second)",
    "Software Settings: Load the isometric contraction protocol (on the main screen select Load Protocol). The Run One button should be visible next\n\tto the Begin button. This ensures the protocol is only run one time.\nWith gloved hands, clean the skin with alcohol, and palpate the common peroneal nerve just distal to the lateral proximal fibula. With a finger marking the area \n\tof the nerve, carefully insert the cathode (black) electrode under the skin and just external to the periosteum. The electrode should be placed parallel to the surface \n\tof the skin at a depth of about 2cm, sufficient to prevent the electrode from moving when the hand is removed.\nPlace the anode (red) electrode under the skin, parallel and slightly distal to the cathode electrode. Both electrodes should now be internal to the common \n\tperoneal nerve just distal to the fibular head.\nActivate the stimulator at 1 Hz. Observe the twitch responses on the monitor. Make small adjustments in the electrode positions to obtain the largest twitch \n\tamplitude possible. The electrode should be completely removed and replaced in three to four ½ cm increments parallel to the tibia to find the largest twitch response. \n\tThis is a critical component of the procedure and great care must be taken to find the largest response.\nRecord the twitch responses by exiting the Monitor Outputs screen (select Continue), then select Begin and Done to collect the data. Save the file with the \n\tdesired file name in the Save As pop up window. Turn off the stimulator.\n4. Isometric tetanic torque (tibiotarsal flexion)\nWithout moving the electrodes, change the stimulator settings to 50 Hz for 1.5 sec and enable the external trigger function. This allows the stimulator to be \n\tactivated by the software.",
    "Software settings: The same isometric contraction protocol is used to collect the tetanic response as for the twitch. Assuming the stimulating electrodes \n\thave not been moved, Begin and Done are selected to produce the tetanus.  In the isometric protocol to produce a tetanus, the stimulator is triggered by the\n\tsoftware to maintain the correct timing. Save the tetanic response in the Save As pop up window.\n5. Eccentric protocol\nWithout moving the electrodes, change the stimulator settings to: 50 Hz for 1 sec (100V), and enable the external trigger function. This allows the \n\tstimulator to be activated by the software.\nSoftware settings: Load the eccentric stretch injury protocol, a command to the servomotor to rotate 29 degrees (30 degrees is the maximum). \n\tSelect Run All. Select Begin; enter the root file name for the eccentric series of files and the folder into which they are to be saved. Select Start \n\tProtocol Series Test, and then Done to initiate the protocol.\nIn this protocol the stimulator is set to be triggered by the software to maintain the correct timing. As the response to each eccentric contraction appears on the screen, it is automatically saved.\nA four minute rest period follows each set of ten eccentric contractions.\nCollect a total of 30 eccentric contractions (three sets of ten contractions; each set separated by a four minute rest period).\n6. Isometric twitch torque (tibiotarsal extension)\nRepeat the twitch protocol above, but place the electrodes perpendicular to the skin and proximal to the original electrode placement for the flexion protocol. \n\tThe tibial nerve is stimulated as it courses caudally and distally within the gastrocnemious muscle bellies.  Paired stimulating and reference electrodes are placed",
    "deep within the musculature caudal and just proximal to the stifle.  The approximate point of placement is along a line that bisects the 90o angle formed by the \n\tstifle (knee). Because the tibial nerve lies deeper (and caudal) to the common peroneal nerve, the electrodes should be placed in several areas to elicit the \n\toptimal twitch potentials. This is a critical component of the procedure. Note: torque tracings for tibiotarsal twitch and tetany will appear inverted relative \n\tto tibiotarsal flexion tracings.\n7. Isometric tetanic torque (tibiotarsal extension)\nWithout moving the electrodes, change the stimulator settings to 50 Hz for 1.5 sec and enable the external trigger function. This allows the stimulator to be \n\tactivated by the software.\nSoftware settings to: 50 Hz for 1.5 sec and enable the external trigger function. This allows the stimulator to be activated by the software.\nSoftware settings: The same isometric contraction protocol is used for the tetanus as for the twitch. Assuming the stimulating electrodes have not \n\tbeen moved, Begin and Done are selected to produce the tetanus.\nIn the isometric protocol to produce a tetanus, the stimulator is triggered by the software to maintain the correct timing. Save the tetanic response in the pop up Save File window. \n8. Data analysis\nDynamic muscle analysis (DMA) program (Aurora Scientific) is used to obtain the torque and temporal information collected from twitch, tetanic and eccentric contractions.\nRunning the DMA program: The software may be revised from time to time; therefore, instructions are provided below relevant to the current software version that we \n\tuse. When the DMA software is opened it is not running. To activate the program, select the white arrow button in the top left corner. The DMA software has a number of",
    "functions, but for our purposes, only a few relevant functions will be described.\n\tLoad a file to analyze: The Reload recent data file or new data file? pop up window appears when the DMA program is started. \n\tSelect New; in the next window select Labview; in the next window, select the appropriate folder and file; select Open. Select \n\tRemove Filter Plot to remove this window. Enter a filter frequency in the Cut-off Frequency box.  Optimal filter frequency would have to be \n\tdetermined based on the specific data to be assessed. As an example, we use 30 Hz for our isometric responses and 10 Hz for the eccentric responses. \n\tSelect the Use filtered data button. Under Select Plot Data, select Filtered Force.  Use the two slide bars at the bottom to \n\texpand the display and move through the file.\nTwitch analysis (Fig 1): Assuming the file is loaded and the above steps are completed, set the position of the cursors: There are 3 \n\tcursors: (1) blue, (2) yellow and (3) white. For isometric twitches and tetani or other isometric contractions, the blue is set at the point where torque \n\trises from the resting torque; the yellow is placed where the torque returns to resting torque (i.e., after the relaxation phase); the white is placed to the \n\tright of the yellow cursor (not needed). The cursors are easily moved with the left button depressed on the mouse and dragging the selected cursor to its desired \n\tposition.\n\tPerform the analysis: When the cursors are positioned, select Do Muscle Analysis, then Show Results. On \n\tthe Analyzed Muscle Data Results pop up window, a number of variables are displayed such as Maximum  Force ; Baseline",
    "Force ; ½ Relaxation Time, etc. The data are presented for the torque response that lies between cursors 1 (blue) and 2 (yellow). \n\tAll of these variables or specific variables can be logged to a data file; however, that process is not described herein. If a data log is not set up, the data \n\twould have to be recorded by hand. Select Close Window to return to the main screen. Select Exit Program to close the DMA, and then select the white \n\tarrow to begin analysis of a new file.\nTetany analysis (Fig 2): The same steps as described above for the twitch.\nEccentric analysis (Fig 3): The eccentric analysis requires more steps to set up and uses all 3 cursors. If the eccentric torque response is \n\tnegative (i.e., the torque tracings appear in the downward direction), it can be inverted by entering -1 in the Reference Area (sq cm) box (torque values are \n\tunchanged) and select Do not normalize; the button reverses to indicate the data have been normalized (in this case, inverted). Enter \n\tthe desired Cut Off Frequency (e.g., 10 Hz) and select Use unfiltered data to reverse the button to Use filtered data, now filtered data will\n\tbe used for the analysis. Position the blue cursor at the point where isometric torque begins to rise from resting torque; position the yellow cursor at the point \n\twhere the eccentric stretch torque begins to rise from the isometric plateau (see figure below); position the white cursor where torque returns to resting \n\ttorque. Select Do Muscle Analysis, then Show Results. On the Analyzed Muscle Data Results pop up window, you can select the data between",
    "cursors 1 (blue) and 2 (yellow) for the isometric torque data, or between cursors 2 (yellow) and 3 (white) for the eccentric torque data. All of these variables or \n\tspecific variables can be logged to a data file; however, that process is not described herein. If a data log is not set up, the data would have to be recorded by \n\thand. Select Close Window to return to the main screen. Select Exit Program to close the DMA, and then select the white arrow to begin \n\tanalysis of a new file.\n9. Representative Results\nTwitch torque: Tibial nerve stimulation (1 Hz) activated single twitches of tibiotarsal extensor muscles (Fig 1). Note that the Y-axis indicates \n\t\"force\"; torque (the product of force and distance) is calculated by the user. We measure the length of the paw (from the axis of rotation to the end of the lateral \n\tdigit). This length is the distance (lever arm) used to determine torque (N-m).\nIsometric tetanic torque (tibiotarsal extension): tibial nerve stimulation tetanized tibiotarsal extensor muscles (1.5 sec train of 50hz pulses). We used Dynamic \n\tMuscle Control computer software (DMC, Aurora Scientific, Inc.) to control stimulation timing and to capture torque responses (Fig 2). \nEccentric protocol: The eccentric contractions were conducted in the tibiotarsal flexors. Percutaneous peroneal nerve stimulation activated an initial isometric \n\tcontraction followed by joint rotation causing lengthening of the activated flexor muscles (eccentric contraction; Fig 3).6\nimgsrc://cloudfront.jove.com/files/ftp_upload/2623/2623fig1.jpg\nFigure 1. Placement of the blue (#1), yellow (#2) and white (#3) cursors to analyze a twitch. A representative screen shot of the DMA software is shown \nfor tibiotarsal extension twitch in a healthy 13 kg dog. Note that for subsequent analysis performed by the software, the data are exported to a spreadsheet, and the",
    "force output (shown in the figure as Force (g) can be converted to  torque (N-m).Torque is calculated by the product of force and lever arm distance (in this the \ndistance = length measured from axis of rotation to lateral digit of the paw).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2623/2623fig2.jpg\nFigure 2. Placement of the blue (#1), yellow (#2) and white (#3) cursors to analyze a tetanus. A representative screen shot of the DMA software is \nshown for tibiotarsal extension tetany, same animal as shown in Fig 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2623/2623fig3.jpg\nFigure 3. Placement of the blue (#1), yellow (#2) and white (#3) cursors to analyze an eccentric stretch-injury contraction. A representative screen \nshot of the DMA software is shown for a single eccentric stretch-injury contraction in a healthy 13 kg dog. The initial plateau (green line) illustrates the isometric \nphase of the contraction. The isometric phase is followed by an eccentric (stretch) phase as illustrated by the rapid peak in the green line. Repeated eccentric \ncontractions typically result in a steady decline in isometric torque."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}