{
  "id": 19564,
  "origin_website": "Jove",
  "title": "Ex Vivo Optogenetic Interrogation of Long-Range Synaptic Transmission and Plasticity from Medial Prefrontal Cortex to Lateral Entorhinal Cortex",
  "procedures": [
    "All animal procedures were conducted in accordance with the United Kingdom Animals Scientific Procedures Act (1986) and associated guidelines as well as local institutional guidelines.\n1. Stereotaxic viral injection\nNOTE: The current protocol requires anatomical, but not post-synaptic cell type, specificity.\nChoose the appropriate animal. Male wild-type Lister hooded rats were used in this protocol (300-350 g, approximately 3 months old).\nChoose the appropriate viral construct. There are several factors to consider (see Discussion). The current protocol uses a virus to express the optogenetic channel ChETATC12, to transduce excitatory neurons (AAV9 - CaMKIIa - ChR2(E123T/T159C) - mCherry; titer: 3.3 x 1013 viral genomes/mL).\nEstablish the coordinates and volume of injection using a brain atlas as previously described35.\nStereotaxic injection of the viral preparation\n\tNOTE: All relevant national and institutional guidelines for the use and care of animals should be followed. The viral vectors are stereotaxically injected as previously described13 with the following modifications.\n\t\nKeep the viral preparation on ice during anesthetization and preparation of the animal.\nInduce anesthesia in an anesthetic induction chamber with 4% isoflurane. Monitor the level of anesthesia indicated by slower regular breathing rate (1 Hz) and absence of pedal and corneal reflexes (test by pinching toes and lightly touching the corner of the eye, respectively; no response should be detected).\nAdminister pre-operative analgesic such as meloxicam at least 30 minutes before the invasive procedure.\nWhen the animal is fully anesthetized, use clippers to remove fur from the scalp. Switch the isoflurane flow to the nose cone of the stereotaxic frame and mount the rat in the frame. Apply lubricating eye gel to the eyes to prevent dryness during the procedure.",
    "The surgery should be undertaken in aseptic conditions. Use sterile gloves and instruments throughout the procedure. Apply lidocaine ointment (5% w/w) before disinfecting the scalp with 4% w/v chlorhexidine solution, and then cover the body with a sterile drape. Using a scalpel, make a longitudinal incision approximately 15 mm in length on the scalp to expose bregma.\nLoad a Hamilton syringe into a microinjection syringe pump attached to a moveable arm mounted to the stereotaxic frame.\nPlace a 5 µL aliquot of the virus in a 0.2 mL tube and spin for a few seconds until all the volume is in the bottom of the tube. Pipette 2 µL of the viral preparation into the lid of the tube.\nFill the syringe with the viral preparation by first viewing the needle tip with a surgical microscope, and then manually place the bolus of the virus at the tip of the needle and withdraw the syringe plunger using the pump controls.\nSet the pump injection volume to 300 nL and flow rate to 100 nL/min. Run the pump and confirm proper flow by observing the droplet of the virus at the needle tip. Absorb the virus on a cotton bud and gently clean the needle with 70% ethanol.\nUsing the adjuster screws on the stereotaxic frame navigate needle tip to bregma (the point on the skull where the coronal and sagittal sutures meet) and take note of the stereotaxic measurements observed on the three vernier scales on the frame. The coordinates relative to bregma of rat mPFC are anterior-posterior + 3.1 mm, mediolateral ± 0.7 mm, dorsoventral - 4.5 mm; add/subtract (as indicated) these distances from bregma coordinates, and then navigate the needle to the anterior-posterior and mediolateral coordinates and gently lower the needle onto the skull surface.",
    "NOTE: The mPFC coordinates given above are appropriate for male lister hooded rats of 300-350 g; changes in rat strain, size may require alterations to these coordinates (see Discussion).\nRaise the needle off the skull surface and mark this point with a fine-tip permanent marker pen. Make a burr hole at this point using a micro drill mounted to the stereotaxic arm.\nInsert the needle into the brain at the pre-determined dorsoventral coordinate and infuse a pre-determined volume (for mPFC: 300 nL). Leave the needle in situ for 10 min to allow for the diffusion of the bolus. Upon removal of the needle, run the pump to ensure that the needle is not blocked.\n\t\tNOTE: Insert and remove the needle slowly (~3 mm/min) to minimize the damage to the brain tissue and backflow of the virus into the needle tract.\nAdminister 2.5 mL of warmed sodium chloride (0.9% w/v) and glucose (5% w/v) solution subcutaneously to maintain hydration.\nRepeat step 1.4.12. for the second hemisphere.\nSuture the scalp incision and on completion of the procedure, administer 2.5 mL of sodium chloride and glucose solution and an appropriate, institutionally recommended, analgesic for pain management, e.g., buprenorphine or meloxicam. Do not leave the animal unattended while unconscious. Place the rat in a heated recovery box until it fully regains consciousness. Only return to the home cage with other animals once fully recovered.\nFollow the institutional guidelines for post-operative care and housing procedures for viral-transfected rodents. Wait for at least 2 weeks for the opsin transgene to express adequately before starting the experiment.\n\t\t​NOTE: The time required for transduction is dependent on the distance and strength of the connection between the pre-and post-synaptic regions. For mPFC to LEC, 4-6 weeks is required.\n2. Preparation of acute brain slices",
    "NOTE: Here we describe a simple method for the preparation of brain slices which in our hands is sufficient to achieve high-quality cortical, hippocampal, and thalamic slices from adult mice and rats.\nPrepare the solutions for dissection.\n\t\nFill a 250 mL beaker with ~200 mL of ice-cold sucrose cutting solution (189 mM sucrose, 26 mM NaHCO3, 10 mM D-glucose, 5 mM MgSO4, 3 mM KCl, 1.25 mM NaH2PO4, and 0.2 mM CaCl2 made in ultrapure water (UPW) with resistivity of 18.2 MΩ cm at 25 °C) or a sufficient volume to fill the vibratome tissue chamber. Bubble with carbogen (95% O2, 5% CO2) and keep on ice.\nFill a slice collection chamber with artificial cerebrospinal fluid (aCSF; 124 mM NaCl, 26 mM NaHCO3, 10 mM D-glucose, 3 mM KCl, 2 mM CaCl2, 1.25 mM NaH2PO4, and 1 mM MgSO4 made in UPW) at room temperature, bubbled with carbogen. The slice collection chamber14 is custom made from a microcentrifuge tube rack glued onto a sheet of nylon mesh and placed into a beaker in which it is submerged in aCSF (Figure 2A).\nFill a 50 mL tube with 4% paraformaldehyde (PFA) in phosphate buffer (PB; 75.4 mM Na2HPO4.7H2O and 24.6 mM NaH2PO4.H2O).\n\t\tCAUTION: PFA is toxic. Use in fume hood.\nDissection of the brain.\n\t\nAnesthetize the rat in an induction chamber using 5% isoflurane until breathing is slow and regular (~1 Hz). To ensure a sufficient level of anesthesia test for the absence of pedal and corneal reflexes.\nDecapitate the animal using a guillotine.\nRapidly dissect out the entire brain as previously described15 and transfer into sucrose cutting solution. Complete the step within 90 s of decapitation for good slice quality and successful whole-cell recording.",
    "Using a metal teaspoon, pick up the brain, discard excess cutting solution, and place it onto a piece of filter paper on the benchtop.\nUsing a scalpel or razor blade, quickly remove the cerebellum and cut the cerebrum in the coronal plane approximately halfway along its length; the posterior half is the LEC tissue block. Be sure to include some excess tissue in addition to the region to be sliced for the next steps. Return both this tissue block and the remainder of the brain to the sucrose cutting solution.\nPlace a drop of cyanoacrylate glue onto a vibratome tissue stage. Spread it into a thin layer with an area slightly larger than the tissue block created in the previous step.\nPick up the LEC tissue block using a teaspoon, discard excess solution, and transfer onto the glue patch such that the anterior coronal cut has adhered.\nInstall the stage into the vibratome tissue chamber and quickly pour a sufficient amount of sucrose cutting solution to submerge the tissue; bubble this solution with carbogen. Orient the LEC tissue block with the ventral surface toward the blade. While ambient room lighting is insufficient to activate the opsin, avoid using additional light sources which might be present on the vibratome.\nCut slices of 350 µm thickness from ventral to dorsal using a high blade oscillation speed (100 Hz) and a slow blade advancement speed (0.06 mm/s). Typically, seven LEC slices can be obtained per hemisphere.\nTransfer the slices to the slice collection chamber. Upon completion of slice collection, transfer the collection chamber to a 34 °C water bath for 1 h before returning to room temperature. Bubble with carbogen continuously. Slices will be sufficiently healthy for recording for at least 6 h.",
    "Place the remainder of the brain in PFA for 48 h for post-hoc examination of injection site (see section 4).\n3. Electrophysiology and optogenetic stimulation\nIdentification of target cell.\n\t\nPlace the slice into a submerged recording chamber at 34 °C perfused with aCSF at a rate of 2 mL/min by a peristaltic pump. Immobilize the slice using a slice anchor.\nUnder the low magnification (4x) objective of a widefield microscope using oblique infrared illumination, navigate to LEC layer 5. Measure the distance from the pial surface to the required layer.\n\t\tNOTE: Oblique infrared illumination was achieved by positioning a near infra-red LED approximately 3 mm below the recording chamber coverslip at an angle of ~55° to the plane of the coverslip (Figure 2B). Differential interference contrast is an alternative and commonly used imaging technique for slice electrophysiology.\nChange to a high magnification water immersion objective (40x) and identify pyramidal neurons. Mark the position of the cell on the computer monitor with tape.\n\t\tNOTE: The pyramidal neurons have a roughly triangular morphology with prominent apical dendrites projecting toward the pial surface of the slice (Figure 3A). Cell health can be assessed by the absence of a condensed, visible nucleus and inspection of the plasma membrane which should appear smooth. It is unlikely that clear fluorescent labeling of axons by the opsin-fluorophore fusion protein will be visible when using a wide-field fluorescence microscope. To visualize axonal projections, perform immunohistochemistry post-hoc using a primary antibody against the opsin's fluorophore and amplify with a secondary antibody conjugated to a fluorophore of the same or similar wavelength.\nFormation of whole-cell patch-clamp.",
    "Fabricate a borosilicate glass micropipette using a pipette puller and fill with filtered intracellular recording solution (120 mM k-gluconate, 40 mM HEPES, 10 mM KCl, 2 mM NaCl, 2 mM MgATP, 1 mM MgCl, 0.3 mM NaGTP, 0.2 mM EGTA, and 0.25% biocytin made in UPW, pH 7.25, 285-300 mOsm). Place the filled micropipette in the electrode holder on the patch-clamp amplifier headstage ensuring the electrode wire is in contact with the intracellular solution.\nApply positive pressure by mouth by blowing hard into a mouthpiece (such as a 1 mL syringe with the plunger removed) connected by tubing to the electrode holder side port and maintain pressure by closing an in-line three-way valve. Raise the microscope objective such that a meniscus forms and insert the electrode into the meniscus until it can be seen on the microscope.\nOpen the Seal Test window in WinLTP16 (or other acquisition software/oscilloscope) and with the amplifier in the voltage-clamp mode, apply a 5 mV square pulse to determine whether the pipette resistance is 3-6 MΩ.\nApproach and touch onto the identified cell with the pipette tip; this should result in an indentation in the cell membrane (Figure 3A; right panel) and a small increase in pipette resistance (0.1 MΩ).\nRelease positive pressure and apply negative pressure by applying moderate suction at the mouthpiece; this should result in a vast increase in pipette resistance(>1000 MΩ). Pressure can now be left neutral. Apply negative pressure in a gradually increasing ramp until cell membrane ruptures resulting in whole-cell capacitance transients.\nRecord optogenetically evoked synaptic events.\n\t\nEnter current-clamp configuration.",
    "NOTE: In most instances long-range synaptic transmission is glutamatergic, therefore recording at membrane potentials close to the chloride reversal potential will best isolate AMPA receptor (AMPAR)-mediated transmission and minimize measurement of any feed-forward inhibition (FFI) evoked. Chloride reversal is dependent on the composition of intracellular recording solution and aCSF and can be calculated using the Goldman-Hodgkin-Katz equation; for the above solutions, this was -61.3 mV. Layer 5 LEC pyramidal neurons had an average resting membrane potential of -62 mV and, where necessary, were maintained at this potential by injection of constant current. Alternatively, cells can be voltage clamped to the desired potential. To record long-range inhibitory projections16 or to record FFI, voltage-clamp at cation reversal potential to isolate GABAergic chloride conductance. When voltage-clamping neurons at membrane potentials above action potential threshold, a cesium-based intracellular solution containing voltage-gated sodium channel blockers is used to improve voltage-clamp and prevent initiation of action potentials (130 mM CsMeSO4, 10 mM HEPES, 8 mM NaCl, 5 mM QX 314 chloride, 4 mM MgATP, 0.5 mM EGTA, 0.3 mM NaGTP, 0.25% biocytin made in UPW, pH 7.25, 285-300 mOsm).\nUsing data acquisition software, send transistor-transistor logic (TTL) signals to an LED driver to activate a mounted 470 nm LED. The mounted LED is directed into the microscope light path using filter cubes and appropriate optics (Figure 2B) to apply light pulses to the slice via the 40x objective to evoke optogenetic excitatory post-synaptic potentials (oEPSPs).",
    "NOTE: Light pulses can be applied perisomatically/over the dendrites, which will result in activation of opsins in the axons and presynaptic bouton, or the investigator can move the objective to axons away from the recorded cell to avoid over-bouton stimulation (see Discussion). Maximal oEPSP amplitude depends on the strength of the synaptic projection, the efficacy of viral injections, and opsin used. oEPSPs can be titrated to the desired amplitude by varying light intensity and/or duration18; varying the duration of light pulses (typical duration between 0.2-5 ms at maximal LED power output, which results in 4.4 mW/mm light density19) gives more consistent oEPSP amplitudes than altering the power output of the LED.\nInvestigate presynaptic release properties (change in voltage) by delivering trains of multiple light pulses with differing inter-stimulus intervals (Figure 3E); care should be taken while interpreting optogenetically evoked transmission (see Discussion).\nInvestigate long-term plasticity either by repetitively evoking oEPSPs19 or application of ligands. Monitor oEPSP amplitude for 5-10 min to ensure stability before induction of plasticity, and then monitor until a stable amplitude is reached (typically 30-40 min).\n\t\tNOTE: Most current opsins are not capable of reliably evoking multiple action potentials at high frequencies, e.g., 100 stimuli delivered at 100 Hz, as is typically used to induce LTP.\nTo confirm oEPSPs are monosynaptic, perform over-bouton activation of the transduced pathway by positioning the objective over the dendritic arbor and stimulating in the presence of 0.5 µM tetrodotoxin and 100 µM aminopyridine. Application of tetrodotoxin will abolish transmission if the responses are action potential-dependent and subsequent inclusion of aminopyridine will partially restore transmission if the oEPSPs are generated monosynaptically19,20.\nTo allow biocytin to fill the neuron, wait for at least 15 min after entering the whole-cell configuration. In voltage-clamp, monitor membrane capacitance and input resistance.",
    "Slowly withdraw the pipette along the approach angle away from the soma of the cell, observing the slow disappearance of capacitance transients and membrane current indicating the re-sealing of the cell membrane and formation of an outside-out patch at the pipette tip. Note the orientation of the slice and the location of the cell(s) within the slice. Put the slice into PFA in a 24-well plate and incubate overnight at 4 °C, and then transfer to 0.1 M PB.\n\t\t​NOTE: Slices can be stored for up to a week. If longer storage is required, change the PB regularly or use PB containing sodium azide (0.02%-0.2% of sodium azide).\n4. Histology\nSlicing injection site\n\t\nFollowing fixation, cryoprotect the tissue in 30% sucrose (w/v) in PB until it sinks (it will initially float in the sucrose solution), usually overnight at room temperature or 24-48 h at 4 °C.\nUsing optimal cutting temperature (OCT) medium, attach a block of tissue to the cryostat specimen disk. Freeze the tissue block following steps 4.1.3 to 4.1.4.\nPlace isopentane in an appropriate container. Submerge just the specimen disk, ensuring the tissue is above the level of the isopentane. Lower the container of isopentane into liquid nitrogen (or dry ice) and allow the tissue to freeze.\nOnce completely frozen (the entire tissue block becomes pale and hard), leave the tissue block in the cryostat chamber at -20 °C for 30 min to allow the temperature of the block to equilibrate.\nCut 40 µm thick sections in the cryostat at -20 °C. Use a fine paintbrush to guide the sections off the blade. Adhere frozen sections to a room temperature, poly-L-lysine coated, glass microscope slide by touching the slide to the sections.",
    "Add around 150 µL of mounting medium to each slide and cover with a coverslip; remove any air bubbles by gently pressing on the coverslip. Cover the slides to protect against photobleaching and air-dry at room temperature for at least 12 h (or overnight). Using a fluorescence microscope, examine the location of the viral injection site.\nBiocytin staining protocol\n\tNOTE: This protocol can be applied to thick sections; slices do not need to be re-sectioned.\n\t\nWash the brain slices with phosphate-buffered saline (PBS; 137 mM NaCl, 2.7 mM KCl, 10 mM Na2HPO4, and 1.8 mM KH2PO4) six times for 10 min per wash. Use a transfer pipette to empty the wells after each step.\nIncubate the slices in 3% H2O2 (w/v) in PBS for 30 min to block any endogenous peroxidase activity. This generates oxygen bubbles.\nWash the brain slices with PBS six times for 10 min per wash or until no further oxygen bubbles are visible. Incubate the brain slices in 1% (v/v) avidin-biotinylated HRP complex (ABC) solution in PBS containing 0.1% (v/v) Triton X-100 at room temperature for 3 h.\nWash the brain slices with PBS six times for 10 min per wash.\nIncubate each slice in 3,3′-Diaminobenzidine (DAB) solution for several minutes until the biocytin staining of neuronal structures becomes visible (takes around 5-10 min).\n\t\tCAUTION: DAB is toxic. Use in fume hood.\n\t\tNOTE: DAB incubation times can be unpredictable, monitor the tissue closely as the color develops.\nStop the reaction by transferring the slices to cold (4 °C) PBS. Wash the brain slices with PBS six times for 10 min per wash. Use a brush to mount the brain slices onto poly-L-lysine coated glass microscope slides.",
    "Remove all excess PBS with a clean tissue. Cover each slice with about 200 µL of mounting medium; cover with coverslips and gently press on the coverslip to push out air bubbles. Air-dry at room temperature for at least 12 h (or overnight). Using a light microscope, examine the location and morphological details of the cell(s).\n\t\tNOTE: Biocytin can alternatively be visualized using fluorophore-conjugated streptavidin; however, imaging may require resectioning or the use of a confocal microscope21.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}