{
  "id": 2071,
  "origin_website": "Cell",
  "title": "Low-coverage whole-genome sequencing of cerebrospinal-fluid-derived cell-free DNA in brain tumor patients",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\ncfDNA extraction\nTiming: 60 min\nHere, cfDNA is isolated from CSF supernatant using the NucleoSnap cfDNA kit (Macherey-Nagel) according to the manufacturer’s instructions (Protocol Version November 2019: https://www.mn-net.com/media/pdf/56/35/fa/Instruction-NucleoSnap-cfDNA.pdf[href=https://www.mn-net.com/media/pdf/56/35/fa/Instruction-NucleoSnap-cfDNA.pdf]). Other cfDNA extraction kits used by the authors include the QIAamp Circulating Nucleic Acid Kit (Qiagen), QIAamp MinElute ccfDNA Mini Kit (Qiagen), and Maxwell RSC ccfDNA Plasma Kit (RSC). The NucleoSnap kit is chosen due to a combination of factors including flexibility of input volume, high cfDNA yield (Maass et al., 2021[href=https://www.wicell.org#bib4]), and simplicity of protocol.\nAvoid exogenous DNA contamination by working in a pre-PCR area with designated equipment, regularly decontaminating pipettes and surfaces with diluted bleach, and wearing clean gloves and lab coats at start of experiment.\nThaw CSF supernatant (if necessary) at room temperature (15°C–25°C) and note volume for each sample.\nPrepare sample by centrifugation at 4,500 g for 10 min at room temperature, transfer supernatant to a new 50 mL conical tube.\nAdd 15 μL Proteinase K per mL of sample, close lid and mix carefully by swirling tube without moistening lid, incubate at room temperature for 5 min.\nAdd 1 mL of Buffer VL per mL of sample, mix by vortexing, incubate tube at 56°C for 5 min in bead or water bath.\nAdd 1 mL of 96%–100% ethanol per mL of sample, mix by vortexing.\nSet up the NucleoSnap cfDNA columns (one per sample) by connecting them to a vacuum manifold.\nPrepare the column by adding 500 μL of Buffer CC to the column and applying vacuum (0.4–0.6 bar) until the solution has passed through the column. Perform this step 1–5 min before the sample lysate is to be added according to the next step.",
    "Decant the sample lysate into the column and apply vacuum (0.4–0.6 bar) until the lysate has passed through the column.\nWash membrane by adding 1 mL of Buffer VW1 to column, apply vacuum (0.2–0.4 bar) until buffer has passed through the column.\nWash membrane by adding 0.5 mL of Buffer WB to column, apply vacuum (0.2–0.4 bar) until buffer has passed through the column.\nRemove the column from the vacuum manifold and insert it into a 2 mL collection tube, break off the upper part of the column and discard it.\nCentrifuge the lower part of the column in the collection tube at >11,000 g for 3 min at room temperature, discard collection tube with flow through and insert column into a new 1.5 mL collection tube.\nAdd 50 μL of Elution Buffer, incubate at room temperature for 3 min, and centrifuge at 11,000 g for 1 min.\nOptional: When connecting NucleoSnap cfDNA columns to the vacuum manifold, the use of disposable NucleoVac Mini Adapter is recommended to avoid cross-contamination, and the addition of NucleoVac Valves or equivalent stopcocks can be used if samples with different volumes are expected.\nPause point: If not proceeding with quantification and fragment size determination, extracted cfDNA can be stored at 4°C for a short duration or at -20°C for longer term, freeze-thaw cycles should be avoided.\nQuantification and fragment size determination\nTiming: 3 h\nAs part of quality control, extracted cfDNA is subjected to quantification and fragment size determination. In view of the expected low cfDNA concentration, a quantitative PCR (qPCR)-based assay targeting a repeat sequence (such as ALU or LINE-1) is adopted to maximize sensitivity (Rago et al., 2007[href=https://www.wicell.org#bib5]), although fluorometric quantification such as using the Qubit fluorometer and dsDNA HS Assay Kit can be considered.",
    "cfDNA is quantified by qPCR by comparison against standards of genomic DNA (gDNA) with known concentrations using primers targeting the ALU sequences (ALU115-F’: CCTGAGGTCAGGAGTTCGAG, ALU115-R’: CCCGAGTAGCTGGGATTACA) (Umetani et al., 2006[href=https://www.wicell.org#bib6]).\nUsing gDNA at known concentration (e.g., Promega G1521), prepare serially diluted gDNA samples at (10 ng/μL, 1 ng/μL, 100 pg/μL, 10 pg/μL, 1 pg/μL) as qPCR standards.\nRun qPCR according to the following setup with gDNA standards (1 pg/μL – 10 ng/μL) and samples in triplicates (1 μL of standard or extracted cfDNA per well) to obtain the mean concentration of samples relative to the standard curve.\ntable:files/protocols_protocol_1555_1.csv\ntable:files/protocols_protocol_1555_2.csv\nFragment size is determined using the Agilent 4150/4200 TapeStation instruments.\nThe High Sensitivity D1000 ScreenTape and Reagents allow sizing of DNA at the cell-free range and has a sensitivity down to 5 pg/μL (requires 2 μL of extracted cfDNA).\nAlternatively, the Cell-free DNA ScreenTape and Reagents allow sizing of DNA within the cell-free range (150-200 bp) and at the same time determines the proportion of high-molecular weight gDNA contamination (sensitivity down to 20 pg/μL, requires 2 μL of extracted cfDNA).\nPause point: If not proceeding with library preparation, extracted cfDNA should be stored at −20°C and freeze-thaw cycles avoided.\nNote: Absence of a DNA peak within the cell-free range (150-200 bp) on a TapeStation trace does not preclude downstream processing of a sample as concentrations of tumor-derived cfDNA may be lower than the limit of detection for the TapeStation assay.\nLibrary preparation\nTiming: 6 h",
    "Library preparation for lcWGS using the 2S Hyb DNA Library Kit (Integrated DNA Technologies) and the 2S MID Adapter (S1-4, Integrated DNA Technologies). Other indexing options are also available from the manufacturer. Dephosphorylation, end repair, and ligation of adapters are performed according to protocol (Indexing by Ligation and Direct Sequencing workflow, Protocol PRT-037 Version 1 by Swift Biosciences, Document S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1555-Mmc1.pdf]), with the following specifications and modifications.\nIn our experience, starting material in the range of 50 pg-5 ng of cfDNA was compatible with library preparation (ideally determined by DNA concentration from qPCR in conjunction with proportion of cfDNA based on Cell-free DNA ScreenTape). Top off sample with low-EDTA TE to 40 μL for Repair I.\nAfter completion of Ligation II, proceed with pilot amplification and library amplification according to the next section.\nPause point: If not proceeding with library amplification, prepared library should be stored at 4°C for short term or −20°C for long term, with freeze-thaw cycles avoided.\nOptional: Suggest to always include a negative control with 40 μL of low-EDTA TE as the pipeline can generate library even from negligible amounts of contaminating DNA.\nLibrary amplification\nTiming: 3 h\nLibrary amplification according to cfDNA quantity may not be effective due to the low cfDNA concentration and frequent inability to determine the proportion of cfDNA versus high-molecular weight gDNA. A pilot qPCR run is first performed to offer guidance on the PCR cycles required for actual library amplification.\nLibrary prepared after completion of Ligation II is used for a qPCR run as follows:\ntable:files/protocols_protocol_1555_3.csv\nSet up and run qPCR according to the following protocol (1 well per library):\ntable:files/protocols_protocol_1555_4.csv\nCT value to be determined from the amplification curve for each library.\nAmplify library with number of PCR cycles being (CT value + 2), detailed as follows:\ntable:files/protocols_protocol_1555_5.csv\ntable:files/protocols_protocol_1555_6.csv",
    "Clean up PCR reaction using SPRIselect beads at ratio of 0.85 (sample volume = 50 μL, bead volume = 42.5 μL). Elute in 20 μL of Tris HCl (pH 8.5) or water.\nAssess size profile and concentration of amplified and cleaned-up library using the D5000 ScreenTape and Reagents (Agilent).\nIf needed, libraries with low concentration (<4 nM) can be further amplified for 2–4 more cycles.\nPause point: If not proceeding with sequencing, amplified library should be stored at 4°C for short term or −20°C for long term, with freeze-thaw cycles avoided.\nNote: Further amplification beyond 4 cycles is unlikely to yield libraries useful for sequencing.\nWhole-genome sequencing\nTiming: 2 days\nDNA libraries are then subjected to further quality assessment and sequencing to achieve 3× genome-wide coverage.\nAnalyze for library size distribution using a 4200 TapeStation D5000 ScreenTape assay (Agilent).\nQuantify libraries using the Quant-iT PicoGreen ds DNA assay (ThermoFisher).\nPaired-end, 100 bp sequencing is then performed on a NovaSeq 6000 (Illumina), targeting approximately 50 million read pairs.\nAfter sequencing is complete, run bcl2fastq to translate and demultiplex BCL files into FASTQ files.\nComputational analysis\nTiming: 3 h\nComplete this section to detect focal and large-scale CNVs and confirm the presence of tumor-derived cfDNA in CSF based on lcWGS.\nProcess lcWGS reads (recommended QC thresholds are indicated):\nRun FastQC on FASTQ files.\nCheck that the average sequence quality is >25.\nCheck that there is not an over-representation of k-mers that would be indicative of adapter sequences.\nCheck GC content is within the expected normal distribution.\nRun ddupk on FASTQ files to remove adaptors.\nRun BWA-mem to map FASTQs to human reference genome (hg19).\nCheck >80% of reads mapped.\nRun Picard de-duplication to remove predicted duplicates.\nThe number of duplicates can vary and will be larger for lower input samples.",
    "Optionally, if unique molecular identifiers (UMIs) were included then fgbio (https://github.com/fulcrumgenomics/fgbio[href=https://github.com/fulcrumgenomics/fgbio]) can be used to collapse UMI families and remove duplicates.\nCalculate tumor purity and CNVs.\ncfdna python package: see quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]."
  ],
  "subjectAreas": [
    "Genomics",
    "Sequence Analysis",
    "Bioinformatics",
    "Health Sciences",
    "Cancer",
    "Neuroscience",
    "Molecular Biology",
    "Clinical Protocol",
    "Sequencing"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}