{
  "id": 1612,
  "origin_website": "Cell",
  "title": "CloneSeq - Single-cell clonal 3D culture and analysis protocol",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSingle-cell encapsulation in PEGDT-MALDEX hydrogels\nTiming: 4 h\nThis section describes how to encapsulate single cells into MALDEX-PEGDT hydrogel using microfluidic devices.\nCritical: Before starting, cool down a box of 20 μL tips at −20°C.\nPrepare MALDEX and PEGDT mix in a biological hood. Keep mixture on ice until use to prevent gelation.\nPrepare single cell suspension.\nNote: We work with passage under 40, but it is recommended to use the lowest passage.\nHarvest ESC cells from tissue culture plate, wash the cells with 1× PBS and centrifuge at 500 rcf for 5 min.\nWash again the cells as previous step, resuspend cells in 5 mL 1× PBS.\nPass cell suspension through a 40 μm cell strainer.\nCount and pellet 1×106 cells. Resuspend cells in 100 μL 1× PBS with 10% Optiprep.\nAdd 20μL ECM with cold tips.\nTransfer cell suspension to MALDEX mix.\nWash a magnetic stirring bar three times by 1× PBS. Put it in the MALDEX mix.\nPrepare microfluidics setup. (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1049-Fig3.jpg\nFigure 3. Microfluidic setup for single cell encapsulation in PEGDT-MALDEX hydrogel sphere\n(A) Pressure controller. Use 2000 mbar pump for carrier oil inlet, 1000 mbar pump for PEGDT and MALDEX inlets.\n(B) Pressurized reservoir. Use 1.5 mL and 2 mL Safe-Lock tubes for PEGDT and MALDEX mix, respectively and use a 15 mL tube for 2% HFE-7500 oil.\n(C) Cell mixer. The yellow square shows a zoom in on the MALDEX mix. The tube is surrounded by an ice stand, and the cell mixer is working outside of the tube towards the bottom of the tube, to make the magnetic stirring bar agitate the cells and prevent sedimentation.\n(D) Flow sensor. Use Flow unit size M for all three inlets.",
    "(E) Microfluidic device for single cell encapsulation in PEGDT-MALDEX hydrogel sphere. A zoom in on the design, indicating the position of each inlet: (1) 2% HFE-7500 oil, (2) PEGDT mix, (3) MALDEX mix and (4) outlet for collection.\n(F) Collection tube. Use a 2 mL tube, placed in a cooling block.\n(G) Control software for the microscope, zoom in on the droplet-generation junction.\n(H) A-i-O software for flow control.\nInstall everything as shown in Figure 3[href=https://www.wicell.org#fig3]. For more detailed instructions on the installation of the system, check the manual of FluigentTM (https://www.fluigent.com/[href=https://www.fluigent.com/]).\nPut a microfluidic device under the microscope. Check its channels for imperfections. (For example, impurity in channels, or adjacent channels sticking together, etc.)\nMake sure there are at least 3 mL of 2% HFE-7500 oil in the pressurized reservoir 15 mL tube.\nAttach all reagents (lysis, barcodes, oil) and single cell suspension to the corresponding pressure controllers.\nCritical: Make sure that the tubing reaches the bottom of the tubes\nConnect the cell mixer to the power supply. Add ice to the ice stand for MALDEX mix.\nPrepare collection tubes: two 2 mL tubes, in a cooling block.\nTurn on the pressure controllers, open the A-i-O control software. Change all the flow rate units to μL/h. Set scale factors for different inlets: 4.3 for oil, 1.1 for MALDEX and 1 for PEGDT. For the use of A-i-O software, check the manual of FluigentTM (https://www.fluigent.com/download/[href=https://www.fluigent.com/download/])\nRun the microfluidic system.\nFor each of the inlets, before connecting the tubing to the device, apply maximum pressure to push the liquid to the end of tubing, and then stop the pressure.\nConnect tubing to the microfluidic device according to the position shown in Figure 3[href=https://www.wicell.org#fig3].\nPut the outlet tubing into a collection tube.",
    "In the A-i-O software, press “edit mode”. Use \"pressure mode\" and set parameters as follows: oil 200 mbar, PEGDT 100 mbar, MALDEX 100mbar. Press “edit mode” again to start all inlets simultaneously.\nWait until you see all the flows from the three inlets arrive at the junction and drops are formed properly.\nNote: You are supposed to see a boundary at the junction, which indicates that both MALDEX and PEGDT arrived at the junction, as highlighted in Figure 4[href=https://www.wicell.org#fig4].\nChange the flow rate as follows: oil 2000 μL/h, PEG 500 μL/h, DEX 500 μL/h. Troubleshooting 1[href=https://www.wicell.org#sec6.11]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1049-Fig4.jpg\nFigure 4. Single cell encapsulation in PEGCT-MALDEX hydrogel sphere\nRed arrows indicate boundary where PEGDT and MALDEX meet. Scale bar: 50 μm.\nChange to a new collection tube when the upper part of the collection gets to around 500 μL. (Figure 5[href=https://www.wicell.org#fig5]A) The protocol is designed for two collections.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1049-Fig5.jpg\nFigure 5. Hydrogel washing\n(A) The collection should have two phases: an upper pink phase that contains the hydrogel spheres, and a lower phase that contains oil.\n(B) After transferring the hydrogel to the drop breaking solution and mixing, the two phases of hydrogel and oil will separate again.\n(C) After the first wash with PBS, the solution has three phases, from top to bottom: PBS, hydrogel, and oil. The separation between PBS and hydrogel should be a straight line, and the separation between hydrogel and oil is a curved surface.\n(D) After the third wash, there should be only a small volume of oil left at the bottom of the tube, and the hydrogel spheres should be transparent. The arrows with different color indicate the three phases: blue – hydrogel, orange – oil, red – PBS.\nWash the hydrogel.\nCritical: Perform the following steps in a biological hood.",
    "Transfer the collection tubes to a 37°C incubator for at least 5 min to stabilize the formation of the hydrogel.\nTransfer the upper part of the collection to the drop breaking solution. Mix by gently inverting the tubes and incubate for exactly 1 min in the 37°C incubator. (Figure 5[href=https://www.wicell.org#fig5]A)\nDiscard the lower oil fraction and add 1 mL of PBS. (Figure 5[href=https://www.wicell.org#fig5]B)\nCentrifuge at 250 rcf for 2.5 min. The hydrogel is the pink solid pellet in the middle. (Figure 5[href=https://www.wicell.org#fig5]C) Discard the upper PBS fraction and the lower oil fraction.\nWash two more times with 1 mL of 1× PBS. The hydrogel fraction is clear at the end (Figure 5[href=https://www.wicell.org#fig5]D).\nResuspend the beads in 500 μL pre-warmed ESC medium and transfer to a well in a 48-wells plate.\nAlternatives: The hydrogel could also be seeded to a T25 tissue culture flask with 1.5 mL medium.\nCritical: Do not use more than 500 μL cell medium per well, otherwise cells may lack oxygen.\nWash the collection tube with 500 μL pre-warmed ESC medium and transfer to a different well. Repeat twice. These diluted wells will facilitate the observation of individual clones under microscope. Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nNote: It will be normal to have some remnant of oil drops with hydrogels. They look like cells but in a shape of perfect circle while cells are usually not so perfect, as shown in Figure 6[href=https://www.wicell.org#fig6].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1049-Fig6.jpg\nFigure 6. Microscope photo of ESC in PEGDT-MALDEX hydrogel after encapsulation\nThe big transparent spheres are PEGDT-MALDEX hydrogel spheres. They are about the size of 70 μm diameter. Red arrows indicate single cells in hydrogel spheres. Yellow arrows indicate oil drops. Scale bar: 50 μm.\nClone expansion in PEGDT-MALDEX hydrogels\nTiming: 3 days\nThis section describes how to culture single cells into clones in MALDEX-PEGDT hydrogel.",
    "After collection, check the clone formation status every day. Change medium every day: Collect hydrogel spheres from all the three wells to a 1.5 mL tube, centrifuge at 250 rcf for 2.5 min, remove the old medium, wash once with 1× PBS, resuspend the hydrogel with the 500μL pre-warmed cell medium and transfer to a new well. The clones will attain desired size (15–20 cells per clone) after 3 days of culture. Troubleshooting 3[href=https://www.wicell.org#sec6.5]\nBarcoding of transcriptomes of single clones: System setup\nTiming: 2–4 h\nThis section describes the encapsulation of single clones with a microfluidics device and capturing of transcriptomes. The protocol is based on inDrops protocol previously reported (Zilionis et al., 2017[href=https://www.wicell.org#bib5]).\nPrepare single clone suspension.\nCollect all the hydrogel spheres together with their culturing ESC medium to a 1.5 mL tube. Add dextranase by 1:20 dilution. Incubate at 37°C for 30 min to dissolve the PEGDT-MALDEX hydrogel.\nGently mix the clone suspension then pass it through a 70 μm cell strainer.\nCritical: Filtering is essential for a complete removal of hydrogel remnant.\nPut the tube into a 37°C incubator. Let clones sink by gravity for 30 min. Gently remove the upper medium. Replace with 1 mL 1× PBS. Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nCritical: Use a pipette instead of vacuum for the wash of clone suspensions, since the pellet is not well packed, and the use of vacuum may result in loss of clones.\nRepeat PBS wash once, finally resuspend in 200 μL 1× PBS. Count 2 μL of the suspension using hemocytometer and get the concentration of clones.\nResuspend clones in 1× PBS with 10% Optiprep to a final concentration of 10,000 clones/mL.\nWash a magnetic stirring bar three times in 1× PBS. Put it in cell suspension.\nPrepare RT lysis mix.",
    "Critical: From this step operate in a UV-free zone. Either turn off the light or use a UV-filtered light source, because the barcode beads are sensitive to light.\nPrepare hydrogel barcoding beads.\nFilter the hydrogel barcoding beads solution by a 70 μm strainer to remove aggregates and debris.\nCentrifuge the hydrogel barcoding beads solution at 1500 rcf for 1 min.\nDiscard the buffer above the barcode beads pellet.\nPrepare microfluidics setup.\nInstall everything as shown in Figure 7[href=https://www.wicell.org#fig7]. For more detailed instructions on the installation of the system, check the manual of FluigentTM (https://www.fluigent.com/[href=https://www.fluigent.com/]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1049-Fig7.jpg\nFigure 7. Microfluidic setup for CloneSeq\n(A) Pressure controller. Use 69 mbar pump for carrier oil inlet, 345 mbar pump for RT lysis mix, cell and barcode bead inlets.\n(B) Pressurized reservoir. Use 1.5 mL Eppendorf® Safe-Lock microcentrifuge tubes for RT lysis and hydrogel barcoding beads, 2 mL Eppendorf® Safe-Lock microcentrifuge tube for cell suspension, and 15 mL tube for 2% HFE-7500 oil.\n(C) Cell mixer. The yellow square shows a zoom in on the MALDEX mix. The tube is surrounded by an ice stand, and the cell mixer is working outside of the tube towards the bottom of the tube to make the magnetic stirring bar agitate the cells and prevent sedimentation.\n(D) Flow sensors. Use Flow unit size M for barcode, and size S for other inlets.\n(E) Microfluidic device for CloneSeq. A zoom in on the design indicates the position for each inlet: (1) 2% HFE-7500 oil, (2) outlet for collection, (3) outlet for collection, (4) single clone suspension and (5) RT lysis mix.\n(F) Collection plate. Place it in a cooling block.\n(G) Control software for the microscope, zoom in on the junction for the generation of droplets.\n(H) A-i-O software for flow control.",
    "Note: In order to avoid blockage, we do not use the flow sensor for hydrogel barcode beads. But it is also possible to connect the flow sensor to monitor the flow rate.\nPut a microfluidic device under the microscope. Check its channels for imperfections. (For example, impurity in channels, or adjacent channels sticking together, etc.)\nMake sure there are at least 2 mL 2% HFE-7500 oil in the pressurized reservoir 15 mL tube.\nAttach all reagents (lysis, barcodes, oil) and single clone suspension to the corresponding pressure controller. Make sure that the tubing reaches the bottom of the tubes.\nConnect the cell mixer to the power supply. Add ice to the ice stand for cells.\nPrepare collection plate: take a 96-well plate, for each sample prepare 4 wells for collection by adding 50 μL 2% HFE-7500 oil in the well.\nTurn on the pressure controllers, open the A-i-O control software. Change all the flow rate units to μL/h. Set scale factors for different inlets: 4.3 for oil, 1 for RT lysis mix and single clone suspension. For the use of A-i-O software, check the manual of FluigentTM (https://www.fluigent.com/download/[href=https://www.fluigent.com/download/])\nBarcoding of transcriptomes of single clones: Cell encapsulation\nTiming: 2–4 h\nRun the microfluidic system.\nFor each of the inlets, before connecting the tubing to the device, apply maximum pressure to push the liquid to the end of tubing, and then stop the pressure.\nConnect tubing to the microfluidic device according to the position shown in Figure 7[href=https://www.wicell.org#fig7]. Put the outlet tubing into a collection tube.",
    "In A-i-O software, press “edit mode”. Use \"pressure mode\" and set parameters as follows: oil 69 mbar, lysis 27 mbar, cell 27 mbar, barcode 100 mbar. Press “edit mode” again to start all inlets simultaneously. Wait until you see all the inlets arrive at the junction and drops are formed.\nNote: You are supposed to see a boundary between the cell suspension and RT lysis mix flows, like highlighted in Figure 8[href=https://www.wicell.org#fig8].\nKeep oil and barcode inlets in pressure mode. Control them to achieve one barcode per droplet generated. Usually, the flow rate for oil will be around 350 μL/h and for barcode beads will be around 35–40 μL/h. To control cell and lysis flow, change to flow rate mode: cell 50–120 μL/h, lysis 70–120 μL/h. Troubleshooting 5[href=https://www.wicell.org#sec6.9]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1049-Fig8.jpg\nFigure 8. Single clone encapsulation for transcriptome barcoding in drops\nRed arrows indicate single clone and barcode beads. Yellow arrow indicates the separation line between cell suspension and RT lysis mix. Scale bar: 50 μm.\nCritical: Keep lysis flow rate equal to the cell flow rate to ensure the transcriptome get enough RT reaction mix.\nTake a short video to estimate encapsulation efficiency. Count the number of events of one clone and one barcode in one drop and divide by time. Troubleshooting 6[href=https://www.wicell.org#sec6.11]\nAfter having stable drops, put the collection tube into collection well plate. Count the time of collection to estimate the number of events per collection. Collect around 350 clones per well.\nCritical: The more events are collected, a greater sequencing depth will be needed in order to have enough reads per transcript. You can choose to collect more clones, but do not collect more than 10,000 events per collection. Otherwise, the chance of having two clones encapsulated with the same barcode will be too high.",
    "Termination of the run.\nStop the pump.\nPlace the collection plate under UV lamp. Keep the plate about 3–5 cm under the lamp for 10 min.\nRecycle barcodes.\nTake a new 1.5 mL Eppendorf safe-lock tube, add 1 mL T10E0.1T0.1 buffer.\nPush all the buffer through the tubing used for barcodes and collect the buffer with the tube containing the unused barcodes.\nWrap the tube with aluminum foil.\nBarcoding of transcriptomes of single clones: Reverse transcription (RT) in drop\nTiming: 2 h\nTransfer the collection plate to a PCR machine and perform RT as follows:\ntable:files/protocols_protocol_1049_10.csv\nPause point: the cDNA can be stored at −20°C for up to 1 week.\nLibrary preparation, sequencing, and data processing\nTiming: 2–3 days\nFollow the protocol reported previously (Zilionis et al., 2017[href=https://www.wicell.org#bib5]) Troubleshooting 7[href=https://www.wicell.org#sec6.13]"
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Cell Culture",
    "Cell Biology",
    "Molecular Biology",
    "Sequencing",
    "Single Cell",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}