{
  "id": 9331,
  "origin_website": "Jove",
  "title": "Preparation of Neuronal Co-cultures with Single Cell Precision",
  "procedures": [
    "The protocols are intended for neuroscientists, and are summarized in Figure 2. As such it is recommend that microfabrication of the SU-8 masters used for PDMS replication is outsourced to commercial or institutional facilities. The two layer mask designs are freely available as supplementary information (ZIP) on the Royal Society of Chemistry website12. Importantly, the first SU-8 layer should be fabricated to a depth of 2.5-3.0 μm, and the second to a depth of 25-30 μm. These are key dimensions necessary for effective neuron arraying. The 3 micron height limit is also necessary to prevent neurons being transported or migrating between the two compartments12.\n1. Microfluidic Device Replication in PDMS\nMix the PDMS prepolymer thoroughly with the curing agent (184) at a ratio of 10:1 and degas the mixture in a vacuum desiccator for typically 20 min. Alternatively, put the mixture in a 50 ml Falcon tube and use low g centrifugation for degassing.\nPlace the 2-layer microstructured SU-8 wafer on an 80 °C hotplate and align polymer frames to each device on the wafer. Pour PDMS into the frames to a depth of ≥5 mm and allow >1 hr to ensure complete thermal curing.\nOnce cured, remove the wafer from the hotplate and allow to cool on a flat surface.\nWear protective eyewear and work from one corner (away from the SU-8 microstructures) with a rigid scalpel to gently prize the frame and PDMS from the wafer.\nRemove the PDMS mold from the frame and use a pair of scissors to trim the device of excess PDMS. This so-called flashing is often produced when a thin film of PDMS spreads between the polymer frame and the wafer surface.",
    "Remaining PDMS can be applied to the entire wafer and cured to protect the wafer during storage. Remove this prior to subsequent device molding, and in doing so remove any particulate contaminants from the surface.\n2. Device Assembly and Interconnection\nPrepare the 6 interface ports using a 3 mm diameter biopsy punch. Work on a dark surface, in good light conditions and with the microstructured features facing upwards to aid alignment of the ports with the microfluidic channels.\nInspect the device for particulates. Remove these using reversible adhesive tape.\nThe microfluidic circuit is encapsulated using a thin PDMS layer mounted on a glass coverslip: These are prepared by pouring a small volume (~0.5 ml) of the PDMS-curing agent mixture (10:1, 601) onto the base of a flexible, bacteriological grade Petri dish. Gently press a coverslip onto the PDMS layer, place on the hotplate and thermally cure for a few minutes. Quickly after cooling, use a scalpel to cut out and prize the coverslip-PDMS bilayer from the Petri dish. Trim with scissors if necessary.\nPlasma bond the PDMS device and support layer to produce a good seal: Optimum conditions are instrument specific. For example, a plasma oven operating at 70 W and 40 kHz in a 0.2 mbar oxygen atmosphere for 40 sec produces an excellent PDMS–PDMS bond. Once plasma treated, press both parts together and leave for a minute to fully bond.\nUse silicone tubing (1.6 mm ID; 3.2 mm OD) to interface with pumps and syringes.\n3. Biomaterial Patterning and Microfluidic Operations\nThe protocols for in situ biomaterial patterning, neuron culture and fluidic treatments are illustrated in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51389/51389fig2highres.jpg",
    "Figure 2. Illustrated microfluidic protocols. A) PL and PLL-g-PEG patterning; addition of the cell adhesion layer (e.g., PL, green), with evaporation producing the aligned water mask. B) Atmospheric air plasma treatment of the exposed PL; two antenna pins are used, with the plasma introduction antenna illustrated with a pink star. C) PBS (blue) washing by aspiration is used to avoid contaminating the plasma-treated region with PL. D) Delivery of PLL-g-PEG (red) by aspiration to coat the plasma-treated regions. E) Cell loading; simultaneous microfluidic arraying of neurons to both flanking compartments by aspiration, F) media (pink) perfusion using a hydrostatic-driven flow. G) Isolated fluidic treatments; peripheral treatment of a test agent (black) delivered from the bottom flanking inlet by aspiration and H) central treatment delivered from the bottom central inlet by aspiration. Figure and legend reproduced with permission of the Royal Society of Chemistry (RSC)12. Click here to view larger image.[href=https://www.jove.com/files/ftp_upload/51389/51389fig2highres.jpg]",
    "Immediately following plasma bonding the PDMS microfluidic channels are highly hydrophilic (contact angle ≤5°). Such surfaces are suitable for the adhesion and culture of cell lines such as differentiated human SH-SY5Y neuron-like cells. For the ex vivo culture of primary neurons and the culture of neuronal precursor cell lines such as the Lund human mesencephalic cell line (LUHMES) a polyamine coating, either polylysine (PL) or polyornithine (PO), is required as an electrostatic anchor. In addition adhesion proteins such as laminin or fibronectin are often required as the integrin-interfacing coating. However, the PL and PO coatings readily bind neurons, hindering the microfluidic delivery to the array sites and also imposing unwanted shear stresses. To solve this problem in-chip biomaterial patterning is required to localize adhesion materials at the trap sites and the outgrowth microchannels. This also promotes the development of inter-compartment connections and reduces local entanglement. The protocol also involves the addition of PEG materials to neighboring areas to ensure proteins and neurons are restricted to the desired locations during lengthy culture. The following protocol is documented in Figure 3:\nimgsrc://cloudfront.jove.com/files/ftp_upload/51389/51389fig3highres.jpg\nFigure 3. Water masking for biomaterial patterning by plasma stenciling. A) Illustration of the water masking process with the PDMS micropillars pinning the water meniscus in place for plasma stenciling. Curvature of the meniscus in the vertical plane has been neglected. B) Water mask visualized with a red dye and positioned by meniscus pinning. C) The patterned PL-FITC coating imaged after plasma stenciling. D) Addition of protein rejecting and cell repellent PLL-g-PEG–TRITC to a plasma-patterned PL-FITC coating. This was used for the registration of SH-SY5Y cells and also for patterning an additional fibronectin layer for LUHMES cells. Figure and legend reproduced with permission of the Royal Society of Chemistry (RSC)12. Click here to view larger image.[href=https://www.jove.com/files/ftp_upload/51389/51389fig3highres.jpg]",
    "Water Masking for In situ Biomaterial Patterning by Plasma Stenciling\n\t\nShortly after plasma bonding pipette a 0.5 μl volume of PL or PO (100 μg/ml in 1x PBS) into the bottom center port. Within a matter of seconds the entire microfluidic circuit is filled by capillary action. Leave for a few minutes to fully coat the hydrophilic PDMS surfaces with the polyamines.\nRemove unbound polyamine molecules by aspiration-driven washing with 1x PBS (see Figure 2C) for 1 min.\nRemove all PBS from the ports and heat the device by illumination with a microscope. This increases evaporation from the ports for rapid water mask formation. The water mask (illustrated in Figure 3A and documented in Figure 3B) is established within ~5 min.\nInspect the device by microscopy to ensure water masking is complete. Please note reservoir structures upstream of the array site are included in the mask design to prolong the stability of the water mask (~15 min).\nInsert stainless steel pins into the ports (Figure 2B). These are used to couple the plasma generated by an atmospheric pressure hand-held corona discharge or Tesla generator (e.g., operating at 2 MHz, 30 kV signal)19,20 into the vacant microfluidic channels. Point the tip of the plasma source close to the tip of one pin and plasma treat the microchannel for ≤1 sec. Use low light conditions to observe plasma patterning.",
    "Remove the water mask with a wash step. Use parallel aspiration from the upper 3 ports. Use 4 equal lengths of silicone tubing connected by a 4-way adaptor to an aspiration pump to achieve parallel aspiration. Start aspiration and dispense PBS into the bottom 3 ports to draw PBS through the microfluidic circuit. In this manner a PDMS-polyamine material contrast is produced (see Figure 3C). Evacuate PBS from the microfluidic circuit and leave for several hours to restore the native, hydrophobic state. This renders the PDMS fully non-permissive to cell adhesion.\nShould additional adhesion materials, such as laminin or fibronectin, be needed the following steps are required and should be done immediately after removing the water mask: Pipette a 10 μl volume of the graft co-polymer poly-L-lysine–poly(ethylene glycol) (PLL-g-PEG, 100 μg/ml, in PBS) into both bottom flanking channels, followed by aspiration from the upper flanking channels for 2 min.\nWithout interrupting the flow, remove excess PLL-g-PEG by exchange with a PBS buffer. This selectively coats the non-polyamine-coated regions with the PEG moiety acting to prevent protein adsorption and cell adhesion17,21.\nAdhesion proteins such as laminin or fibronectin can then be co-localized with the poly-amine coating: Pipette 10 μl volumes of these ECM proteins (typically 10 μg/ml) into all three bottom ports. Aspirate from the top three ports until the device is filled with the protein solution and incubate for 1 hr to produce a good quality coating.\nRemove excess proteins by aspirating PBS from the bottom 3 ports.\nMicrofluidic Single Neuron Arraying",
    "Prime the devices with appropriate media. Add 20 μl volumes to the bottom 3 ports and by parallel aspiration from the upper three ports rapidly fill the microfluidic circuit with media. Use a 4-way tubing connector to couple the 3 upper ports via equal-length silicone tubing to an aspiration pump.\nAdd 20 μl of a disaggregated cell suspension (1 x 106 cells/ml) to each of the flanking inlet ports (0, in Figure 1).\nEquip an aspiration pump with a flow regulator or use a syringe for gentle aspiration from the upper 3 ports. Complete neuron arraying typically requires 1 min.\nHarvest excess neurons remaining in the 4 flanking ports with a pipette for arraying in subsequent microfluidic devices.\nRemove the tubing. Fill all ports with media and place the device in the incubator. Within a few hours the cells become fully adherent on the biomaterial pattern.\nNeuron Culture, Selective Fluidic Treatment, and Immunostaining\n\t\nExchange the media by periodic perfusion using hydrostatic feed (a 2 mm column height difference is appropriately slow).\nAlternatively, submerge the microfluidic device in media, exchanging the media periodically (2–3 days) as with standard cell cultures.\nSelective fluidic treatments to either neuron culture compartment or the central neurite outgrowth compartment are achieved as follows: Dispense 20 μl of the test substance into the bottom port of the channel of interest, and aspirate from the port directly above. For lengthy treatments reduce the flow rate using a flow regulator and replenish the test substance as required.",
    "Immunostaining protocols vary for each molecular target and associated reagents. In order to counter the potential risk of shear-induced damage to the neurons a slow flow rate was used. This results in increased application times to fully perfuse the system, extending normal protocol times. Hydrostatic perfusion using ports with differing column heights (e.g. ,by 2 mm) was used to deliver reagents. More rapid reagent addition and removal using a pump can be used to reduce experimental timescales. Connect an aspiration pump to the upper 3 ports to draw reagents from the bottom 3 ports.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}