{
  "id": 4785,
  "origin_website": "Bio",
  "title": "Determining Leukocyte Origins Using Parabiosis in the PyMT Breast Tumor Model",
  "procedures": [
    "ParabiosisThis surgical procedure will result in the formation of microvasculature at the connection site and thus a shared blood circulation between two animals during the development of oncogene-induced mammary tumors.Sterilize all surgical tools by autoclaving or soaking in 70% ethanol for at least 30 min.Lay out all sterile tools and necessary materials on clean surgical drapes/sterile pads.Warm a clean cage with heating lamp for use during recovery.Anesthetize mice using ketamine/xylazine cocktail (IP). The animals should be fully sedated (as measured by no response to a toe pinch) before proceeding. Throughout anesthesia, apply ophthalmic ointment to eyes as needed.After mice are anesthetized, shave the right flank of one partner and the left flank of the other partner. All mice should be kept on heating pads during surgery.Start procedure on first partner. Lay the mouse on its side on sterile gauze and sterilize the shaved area to prepare for incision, alternating antiseptic solution and 70% ethanol three times, using a fresh cotton-tipped applicator for each application. Make a small incision in the skin over the thigh, about 0.5 cm dorsally from the knee joint. Insert the tip of the scissors into the incision and open and close the nose of the scissors to pull the skin away from the inner fascia covering the leg muscles. This will allow you to expose the muscles and patellar tendon of the hindlimb for suturing in later steps.Cut in a straight line from this incision up to the shoulder just past the elbow joint. Repeat opening and closing of the scissors the entire length of the incision, being careful to leave the body wall intact.Holding the ankle joint of the hindlimb between your thumb and forefinger, carefully maneuver the knee out from the skin so that the patella is exposed and turned upwards, facing you.",
    "Insert the needle of the non-absorbable suture between the tibia and fibula from the inside of the leg to the outside, about 1/3 of the way below the knee. Avoid piercing major blood vessels. Pull the suture through until 2-3 inches of the free end remain (this free end will be used to tie to the other partner, so make sure there is enough length for you to comfortably perform two throws of an instrument tie square knot). Tie off the suture with the needle holder, using an instrument tie square knot (two throws of the knot is sufficient). There will be two ends of the suture radiating from the knot, the 2-3 inch free end and the end connected to the needle. Cut the needle end as close to the knot as possible, leaving the free end available to tie in subsequent steps. Try to secure the knots on the outside of the thigh as this will make connecting the two partners easier. Detailed instructions on how to perform surgical ties can be found at http://www.bumc.bu.edu/surgery/training/technical-training/instrument-tie/[href=http://www.bumc.bu.edu/surgery/training/technical-training/instrument-tie/].Repeat this procedure on the forelimb, using the remaining length of the suture (needle end) from step A8. Insert the suture needle between the radius and ulna, right below the elbow, from inside to outside.Keeping the 1st partner on the heating pad, laying on its side with the incision facing upwards, make a matching incision on the 2nd partner. Repeat the same procedure as the 1st partner. You will now have 4 loose suture ends with all of the knots facing upwards.To connect the two mice, lay them both on their backs, with their abdomens facing upwards, and their incisions facing each other.",
    "Insert the suture needle under the patellar tendon of the 1st partner from the inside of the knee to the outside and then under the patellar tendon of the 2nd partner from the outside to the inside (one continuous motion). Tie off suture (two throws) and cut both loose ends as close to the knot as possible to minimize irritation from suture ends. Be careful not to accidentally tie the suture ends from step A8 into the knot.To connect the hindlimb sutures, flip mice over so they are laying on their stomachs. Use the needle holder to perform 2 throws of an instrument tie square knot on the suture ends from step A8 and cut loose ends. Keeping the mice on their stomachs, use the needle holder to tie together the forelimb sutures from step A9 (2 throws of an instrument tie square knot) and cut loose ends. After these sutures are tied together, the mice will be in their final connected position so take care to line up forelimbs and hindlimbs in a way that will make ambulation as easy as possible. The two partners should now be tightly and stably held together with their body walls in contact with each other. Close the skin incisions using 9 mm wound clips. This procedure is best performed by two people, one person to hold the skin together, and one to apply the wound clips. Using two curved end forceps, hold the skin flaps from the dorsal sides of both mice up and away from their body walls. At this step it is very important to roll the outer edges of the skin flaps away each other as to avoid clipping any remaining hair into the wound. This also prevents the skin from curling into the wound.",
    "Apply the first wound clip where the inside of the skin flaps touch each other, approximately 0.25 cm from the edge of the incision, starting from the tail end and working towards the head, placing each wound clip right next to the previous clip. By pulling the skin up while clipping, you prevent clipping into the body wall or connecting the mice too tightly together. Once clipping on the dorsal side of the wound is complete, flip the mice onto their backs and apply clips to the ventral side of the wound, holding the skin together during clipping as previously described. Extra clips may need to be applied near the forelimbs and hindlimbs to fully close the wound.After clipping is complete, lay the mice on their stomachs, on sterile gauze, in the warmed cage. The heating lamp must be used until the mice are fully awake and ambulating.Inject each partner with 500 μl sterile saline (sub-Q) immediately following surgery and 2x daily for 4-7 days post-surgery.Inject each partner with analgesic (IP) immediately following surgery and 1x daily for 1-2 days post-surgery.Provide non-wetting sterile water in the bottom of the cage for 1 week following surgery and provide moistened food for the duration of the experiment.If maintaining the mice for more than 1 month, remove the wound clips at 3-4 weeks using a wound clip remover.Tumor isolation and processingAfter mammary tumors become palpable, euthanize the mice and remove the tumors from the unconnected side of each partner. Do not isolate mammary glands/tumors from the connected side. Special care must be taken to avoid disrupting the lymph nodes in order to prevent contamination of the tumor prep with lymph node leukocytes. This is especially important for the mammary gland that is found next to the inguinal lymph node.",
    "It is often best to avoid removing this tumor entirely. In addition, some mammary glands will not have palpable tumors, yet the pair of mice will have to be euthanized due to the size of one or more tumors. In this case, all tumors and mammary glands may be pooled (only pool tumors within one individual mouse), or analyzed separately.Remove tumors and place in 1x PBS in a 6 well plate on ice.Process tumors by cutting into small pieces with a razor blade on top of a glass slide and incubate tumors in 10-15 ml digestion buffer (see Recipes), for 1¼ h in 37 °C water bath. Vortex tubes every 15-20 min.After digestion, pour tumors and digestion buffer over a 70 micron cell strainer into a 6 well plate. Mash tumors through cell strainer with the back of a plunger from a 3 ml syringe. Wash filter with 1x PBS and move cell strainer to the next well. Continue mashing, washing, and moving the cell strainer to the next well of the plate until the majority of tumor tissue has been dissociated.Transfer digested and filtered tumor tissue to a 50 ml conical tube using a serological pipette, wash all wells with 1x PBS to collect any remaining cells, and spin down at 650 x g for 6 min in desktop centrifuge (total volume will be 40-50 ml).Pour off supernatant and resuspend cell pellet in 10 ml 44% Percoll and transfer to a 15 ml conical tube.Slowly underlayer with 3 ml 66% Percoll in the bottom of the tube using a 5 ml serological pipette, pulling out the pipette as the Percoll is deposited, taking care not to disturb the interface between the 44% and 66% Percoll.Spin at 1,500 x g, 30 min, 4 °C, NO BRAKE/lowest brake setting.",
    "Remove debris at the top of the tube, along with 3-5 ml 44% Percoll. Collect cells at interface “buffy coat” using a p1000 micropipette and transfer into a clean 15 ml conical tube. Be generous with the volume collected at this step (4-5 ml total), while avoiding the red blood cell pellet at the bottom of the tube. Spin down at 650 x g for 5 min.Wash with 10 ml 1x PBS, spin down at 650 x g for 5 min.FACS analysis of immune infiltratesResuspend the immune cell pellet in an adequate volume of 1x PBS to transfer into 96 well plate for FACS staining, approximately 100 μl/well, and place on ice.Prepare antibody cocktail in FACS buffer, 50 μl/well. The antibodies listed below are for the identification of myeloid cells, including macrophages, monocytes, and neutrophils.CD45.1 APC-eFluor780, 1:400CD45.2 PerCP-Cyanine5.5, 1:300MHC Class II (I-A/I-E) FITC, 1:1,200CD11b Pacific Blue, 1:800Ly-6C APC, 1:500Ly-6G PE, 1:500Fc block (2.4G2), 1:400Spin down plate in desktop centrifuge at 500 x g for 3 min and discard supernatant by flicking the plate. Resuspend each cell pellet in 50 μl antibody cocktail. Incubate plate, covered, on ice for 30 min.Wash 2x in 150 μl of 1x PBS and resuspend in 1x PBS for analysis using a flow cytometer."
  ],
  "subjectAreas": [
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}