{
  "id": 20030,
  "origin_website": "Wiley",
  "title": "Establishing an In Vitro 3D Spheroid Model to Study Medulloblastoma Drug Response and Tumor Dissemination",
  "procedures": [
    "Here, users will use ULA plates to generate 3D-MB spheroids from established medulloblastoma cell lines. ULA plates have a round bottom and a covalently bound hydrogel layer to inhibit cellular attachment. This structure promotes the formation of a single, highly reproducible spheroid in each well. The resulting spheroids can then be used in downstream applications, as described in Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003] to 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006].\n3D culture conditions, such as spheroid size, incubation periods, and culture medium, have been standardized across all of the medulloblastoma cell lines described in this protocol in order to allow direct comparisons between spheroids of different types. In addition, the cell seeding densities in this protocol have been optimized to produce 3D-MB spheroids of 250 to 350 µm in diameter following an initial 4-day formation period. This is the optimal size for establishment of pathophysiological oxygen gradients while still permitting drug perfusion throughout the spheroid (Vinci et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-bib-0022]).\nUse of a serum-free neurosphere medium, containing supplements and growth factors routinely used in the culture and maintenance of neural stem cells, is essential for sustained 3D-MB spheroid growth (Roper et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-bib-0018]).\nWe also provide Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002], which describes how to perform CV analysis, a method of calculating variation in 3D-MB spheroid size within and between plates, to validate the model's reproducibility. We advise that users perform CV analysis on day 4, following the initial spheroid formation period, before moving on to downstream applications (Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003] to 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006]).\nMaterials\nMedulloblastoma cell lines (growing under conditions described in Strategic Planning and Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001])\nHank's Balanced Salt Solution (HBSS; Gibco, 14170) or sterile phosphate-buffered saline (PBS)\nTrypsin-EDTA (Sigma-Aldrich, T4174)\nCulture medium, 37°C\nNeurosphere medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-rec-0002]), 37°C\nTrypan blue (Gibco, 15250061)\nBrightfield microscope\n1.5- and 15-ml tubes\nCentrifuge (capable of holding 15-ml tubes and plates)",
    "Hemocytometer (or automated cell-counting system)\nP200 multichannel pipet (capable of pipetting volumes ranging from 50 to 200 µl)\nReagent reservoirs (Thermo Fisher Scientific, 8096-11, or equivalent)\nULA round-bottom 96-well plates (Corning, 7007)\nAdditional reagents and equipment to measure 3D-MB spheroid variability (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002]; optional)\nGeneration of 3D-MB spheroids\nTiming: 2 hr of hands-on work followed by 4 days of incubation\n1. Manually inspect medulloblastoma cell lines under a brightfield microscope to ensure that they are around 70% to 80% confluent before proceeding.\nSee Strategic Planning for more information.\n2. Remove culture medium and wash cells twice with 10 ml HBSS or sterile PBS.\n3. Add 2 ml trypsin-EDTA and incubate at 37°C for 5 min to allow cell detachment.\n4. When the cells have detached from the flask, wash with 8 ml culture medium and transfer cell suspension into a pre-labeled 15-ml tube.\n5. Centrifuge cell suspension for 5 min at 180 × g at room temperature to form a cell pellet.\n6. During centrifugation, prepare volume of neurosphere medium needed.\nAt least 12 ml neurosphere medium is required for one full ULA plate (containing 60 useable wells, with the outer wells filled with HBSS or PBS).\nSome cell lines require neurosphere medium supplemented with methyl cellulose (detailed in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001]).\n7. Following centrifugation, remove and discard supernatant and resuspend cell pellet in 2 to 3 ml neurosphere medium.\n8. Perform a cell count to calculate number of cells/ml:\n         \nPrepare a 1:1 dilution of cells (10 µl) and trypan blue (10 µl) in a fresh 1.5-ml tube and then pipet up and down to mix.\nAdd 10 µl of the solution to a hemocytometer chamber and place under the microscope.\nCount total number of cells in the four outer squares of the hemocytometer grid.",
    "Once you have obtained the total count, calculate cell concentration using the following formula:\n               formula:\n\\begin{eqnarray*} Total\\;cells/ml &amp;=&amp; \\frac{{Total\\;cells\\;counted}}{{Number\\;of\\;squares\\;counted}} \\times 2\\left( {trypan\\;blue\\;dilution\\;factor} \\right)\\\\ &amp;&amp;\\times 10,\\!000 \\end{eqnarray*}\n9. Dilute cells in neurosphere medium to the appropriate seeding density for seeding in a volume of 200 µl/well.\nSeeding densities for each cell line are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001].\n10. Add 200 µl HBSS or sterile PBS to all outer wells of a ULA round-bottom 96-well plate.\n11. Gently resuspend diluted cell suspension to ensure that the cells are well distributed.\n12. Seed cells in the ULA plate in a volume of 200 µl/well using a P200 multichannel pipet and reagent reservoir.\nA P200 multichannel pipet can be used here to seed multiple wells at a time. Ensure that the cell suspension is well distributed in the reagent reservoir before seeding.\n13. For semi-adherent and suspension cell lines (HD-MB03, D283, D425, D458, CHLA-01-MED, and CHLA-01R-MED), centrifuge plate for 5 min at 100 × g after seeding to encourage spheroid compactness.\n14. Visually inspect plate under the microscope to check that cells have been seeded in each well.\n15. Transfer plate to the incubator and allow spheroid formation and growth for 4 days to achieve an optimal size of 250 to 350 µm in diameter.\nBy day 4, the edges of the spheroid should be clearly defined, and typically, a darker inner core that is characteristic of actively growing spheroids should be visible (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001] for representative images for each cell line on day 4).\n16. On day 4, follow Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002] to measure 3D-MB spheroid variability before proceeding with downstream applications (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003], 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0005], or 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006]). Alternatively, continue growing 3D-MB spheroids following steps 17 to 21.\nMaintenance of 3D-MB spheroids",
    "Timing: Every 2 to 3 days following initial 4-day incubation period\n17. Manually inspect ULA plate under the microscope to assess spheroid health.\nRepresentative examples of spheroids from each cell line are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001]. Figure 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0002] shows a healthy ONS76 spheroid imaged over a period of 21 days.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2e89b61e-b1f4-414c-8719-da590bb1c85a/cpz1357-fig-0002-m.jpg</p>\nFigure 2\n3D-MB spheroid growth characteristics over a 21-day period. (A) Representative images of ONS76 3D-MB spheroids over a 21-day period (scale bar: 100 µm). (B) Immunohistochemical staining of ONS76 3D-MB spheroids on day 21 for markers of proliferation (Ki67) and hypoxia (CA9) (scale bar: 100 µm).\n18. Gently remove 100 µl neurosphere medium from each well using a multichannel pipet.\nEnsure that the spheroids remain undisturbed by placing the pipet at a 45° angle on the wall of the well.\n19. Pour fresh neurosphere medium into a reagent reservoir.\n20. Add 100 µl fresh neurosphere medium to each well using a multichannel pipet.\nUse the same technique of placing the pipet on an angle as in step 18 to avoid disturbing the spheroids.\n21. If needed, place plate back in the incubator and continue to maintain spheroids by performing medium changes every 2 to 3 days following steps 17 to 20.",
    "In this support protocol, we describe how to perform CV analysis by manually imaging each well (containing an individual spheroid) and measuring spheroid size using the macro developed by Ivanov et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-bib-0008]) and the open-access software ImageJ. CV analysis is a useful method of determining assay uniformity by calculating variations in spheroid size within a plate. CV is commonly used to assess the reproducibility of in vitro models, and CV scores of <20% variation are considered acceptable (Sittampalam, Grossman, Brimacombe, Arkin, & Auld, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-bib-0021]).\nWe advise that this protocol be performed on day 4 of spheroid formation (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001], step 16), when spheroids should have reached the optimal size of 250 to 350 µm in diameter, before moving on to downstream applications (Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003] to 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006]).\nMaterials\n3D-MB spheroids (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001])\nImaging apparatus [e.g., brightfield microscope (Canon, DS126431, or equivalent) with attached camera (Olympus, CKX41) or automated imaging system]\nCalibration slide (AmScope, A36CALM7-3PL)\nComputer\nImageJ version 1.53n (https://imagej.nih.gov/ij/[href=https://imagej.nih.gov/ij/])\nTiming: ≤1 hr\n1. Image 3D-MB spheroids at 10× magnification with an imaging apparatus (there should be one spheroid per well). Use a calibration slide to determine scale of the images.\n2. Transfer images to a computer.\n3. Use ImageJ macro developed by Ivanov et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-bib-0008]) and open-access software ImageJ to analyze spheroid size:\n         \nDownload ImageJ and start program.\nUsing the image of the calibration slide from step 1, measure scale of images (number of pixels equal to 100 μm) at 10× magnification.\nDownload macro provided by Ivanov et al. (https://figshare.com/s/32f81784ee28e3fde015[href=https://figshare.com/s/32f81784ee28e3fde015]) and enter scale value after “distance=.”\nGo to Plugins > Macros > Install and select amended macro text file.\nGo to Plugins > Macros and select installed macro (typically listed at the bottom).\nSelect input folder containing the original spheroid images.",
    "Select output folder (an empty folder that will include any processed images with the spheroid outlined).\nRun macro.\nThis macro automatically calculates spheroid area and draws a blue outline of the detected spheroid.\nWait for macro to finish processing before analyzing the images (see steps 4 to 8).\n4. Drag and drop output folder into ImageJ and assess blue outline of the detected spheroids. If the macro has failed to detect the correct spheroid circumference, manually outline spheroid and go to Analyze > Measure (or Ctrl + M) to calculate area.\n5. Export spheroid measurements from ImageJ into a spreadsheet.\n6. Using the area values, calculate spheroid diameter using the following equations:\n         formula:\n\\begin{equation*} Radius\\left( r \\right) = \\sqrt {\\frac{A}{\\pi }}  \\end{equation*}\nformula:\n\\begin{equation*} Diameter\\left( d \\right) = 2r \\end{equation*}\n7. Calculate mean and standard deviation of the diameter measurements for each plate (or by cell line if multiple lines have been seeded within the same plate).\n8. Calculate CV for each plate/cell line using the following equation:\n         formula:\n\\begin{equation*} CV\\left( \\% \\right) = \\frac{{Standard\\;deviation\\;of\\;spheroid\\;diameter}}{{Mean\\;spheroid\\;diameter}} \\times 100 \\end{equation*}\n9. Proceed with downstream protocols (Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003] to 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006]) if CV is <20%.\nCV values >20% indicate that there were inconsistencies in cell seeding.",
    "In this protocol, users will generate 3D-MB spheroids using an adaptation of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] that allows subjection of spheroids to a drug treatment of interest in a 96-well plate format. As opposed to in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001], the 3D-MB spheroids here will be generated in opaque-walled ULA plates, thereby avoiding the need to transfer delicate drug-treated spheroids to an assay plate for viability assessment, which is the protocol's readout.\nVehicle-treated controls should always be used when assessing drug response, and treatment exposure and time points for measurements should be modified depending upon the compound's mechanism of action. The advantage of the approach described here is that all spheroids (regardless of the cell line from which they are derived) will have the same starting dimensions (250 to 350 µm) and are grown in the same medium, so any differences in response should be due to intrinsic properties of the cells themselves. Drug penetration and stability in media will also be the same, allowing direct comparisons between cell lines and compounds.\nDrug response can be monitored using the CellTiter-Glo 3D cell viability assay to measure 3D-MB spheroid viability. This luciferase-based, commercially available assay has been optimized for use with 3D in vitro culture. The CellTiter-Glo reagent used penetrates the 3D spheroid structure and lyses cells to generate a luminescent signal proportional to the amount of adenosine triphosphate (ATP) present, indicative of the number of viable cells within the spheroid. Alternatively, drug response can be measured by assessing changes in spheroid size, and we describe the steps for both approaches. These two methods of analysis produce equivalent drug response curves and IC50 values (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e11daf91-c1b2-42ae-bd33-0266e9ad3973/cpz1357-fig-0003-m.jpg</p>\nFigure 3",
    "Functional analysis of 3D-MB spheroids. (A) Comparison of two different techniques for assessing drug response: luminescence (using the CellTiter-Glo 3D cell viability assay) and volume of treated spheroids as a percentage of vehicle-treated control. (i) These methods of analysis produce comparable dose-response curves (measured by the hill slope, p-value = 0.87) and IC50 values (p-value = 0.8). (ii) The two methods produce identical and overlapping growth response curves. Dose-response curves were generated using nonlinear regression analyses, and error bars represent the mean ± SEM of n  =  3 experiments, each containing three technical replicates. (B) Study of ONS76 3D-MB spheroids migrating across hyaluronan (HA) hydrogels with and without the extracellular matrix component fibronectin (FN) over a 72-hr period. (i) Representative images of the same 3D-MB spheroid at 0 and 24 hr are shown (scale bar: 100 µm) and are representative of n  =  3 experiments, each containing three technical replicates. (ii) Spheroid outgrowth was calculated by measuring the area covered by migrating cells over a 72-hr period and normalizing to the initial spheroid size at 0 hr. Statistical significance was calculated using two-way ANOVA analyses with Sidak's multiple-comparisons post hoc test (***p ≤ 0.01, ****p ≤ 0.0001).\nThis protocol is designed for 96-well plate cultures; however, this method can easily be scaled up to 384-well plate cultures with automated dispensing and imaging approaches for users requiring a higher throughput, for example, those wishing to assess large drug compound panels. Such adaptation is described in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0004].\nMaterials\nDrug of interest (e.g., etoposide, Selleckchem, S1225)\nVehicle control [e.g., dimethyl sulfoxide (DMSO), Sigma, D2650]\nCellTiter-Glo 3D cell viability assay (Promega, G9683)\nOpaque-walled ULA round-bottom 96-well plates (Corning, 4520)\nOrbital incubator (Stuart, SI500, or equivalent)\nPlate reader (FLUOstar Omega, BMG Labtech, or equivalent)",
    "Statistical package of choice (GraphPad Prism version 9.2.0 or equivalent)\nAdditional reagents and equipment for preparing medulloblastoma cell lines to generate 3D-MB spheroids (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001]) and for measuring 3D-MB spheroid uniformity (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002])\nGeneration of 3D-MB spheroids\nTiming: 2 hr of hands-on work followed by 4 days of incubation\n1. Follow steps 1 to 9 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001].\n2. Add 200 µl neurosphere medium to any three outer wells of an opaque-walled ULA round-bottom 96-well plate (to be used later as blank controls). Add 200 µl HBSS or sterile PBS to remaining outer wells.\n3. Gently resuspend diluted cell suspension to ensure that the cells are well distributed.\n4. Seed cells in neurosphere medium in a volume of 200 µl/well in the opaque-walled ULA plate using a P200 multichannel pipet and reagent reservoir.\nSeeding densities for each cell line are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001].\nA P200 multichannel pipet can be used here to seed multiple wells at a time. Ensure that the cell suspension is well distributed in the reagent reservoir before seeding.\n5. For semi-adherent and suspension cell lines (HD-MB03, D283, D425, D458, CHLA-01-MED, and CHLA-01R-MED), centrifuge plates for 5 min at 100 × g after seeding to encourage spheroid compactness.\n6. Visually inspect plate under a brightfield microscope to check that cells have been seeded in each well.\n7. Transfer plate to the incubator and allow 3D-MB spheroid formation and growth for 4 days before proceeding to drug treatment.\nDrug treatment\nTiming: 1 to 2 hr\n8. On day 4 of spheroid growth/formation:\n         \nVisually inspect ULA plate under the microscope to assess spheroid health.\nExamples of day 4 3D-MB spheroids are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001].",
    "Follow Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002] to measure CV to confirm 3D-MB spheroid uniformity on day 4 prior to addition of drug treatment.\n9. Prepare 100 µl/well of solution of drug of interest at 2× concentration and vehicle control.\nWe advise including at least three technical replicates per drug treatment/concentration and vehicle-treated control.\n10. Gently remove 100 µl neurosphere medium from each well using a multichannel pipet.\nEnsure that the spheroids remain undisturbed by placing the pipet at a 45° angle on the wall of the well.\n11. Add 100 µl of 2× drug treatment or vehicle to each well.\nUse the same technique of placing the pipet at an angle as in step 10 to avoid disturbing the spheroids.\n12. Transfer plate to the incubator for the desired treatment length.\nTreatment length may range from hours to days depending upon the user's research question. Medium changes or sequential dosing can be performed as described above.\nAfter treatment, assess spheroid viability using the CellTiter-Glo 3D cell viability assay (steps 13a to 21a) or by measuring changes in spheroid size (steps 13b to 16b).\nMeasuring spheroid viability following drug treatment using the CellTiter-Glo 3D cell viability assay\nTiming: 1 hr\n13a. Following drug treatment, use a multichannel pipet to remove 100 µl medium from ULA plate.\n14a. Dispense required volume of CellTiter-Glo 3D cell viability reagent (thawed at room temperature) into a reagent reservoir, with enough for all wells.\nAs a guide, ∼6.5 ml CellTiter-Glo 3D cell viability reagent is required per 96-well ULA plate (using a volume of 100 µl/well in 60 wells). Adjust this volume based on the number of plates required.\n15a. Add 100 µl CellTiter-Glo 3D cell viability reagent per well using a multichannel pipet.",
    "16a. Shake plate at 250 rpm for 5 min in an orbital incubator to promote cell lysis.\n17a. Incubate plate for 25 min at room temperature in the dark.\n18a. Insert plate into a plate reader and measure luminescence.\nThe manufacturer recommends a 0.25- to 1-s integration time for luminescence detection. We routinely use a 0.5-s integration time with no issues.\n19a. Export luminescence measurements into a spreadsheet.\n20a. Correct luminescence measurements against the blank (medium-only) controls included in step 2.\n21a. Using the statistical package of choice, generate dose-response curves and calculate IC50 values (drug concentration required to inhibit growth by 50%) by nonlinear regression analysis.\nMeasuring changes in spheroid volume following drug treatment\nTiming: 1 hr\n13b. Following drug treatment, follow steps 1 to 5 of Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002].\n14b. Using the area values, calculate spheroid volume using the following equations:\n         formula:\n\\begin{equation*} Radius\\left( r \\right) = \\sqrt {\\frac{A}{\\pi }}  \\end{equation*}\nformula:\n\\begin{equation*} Volume\\left( v \\right) = \\frac{4}{3}\\pi {r^3} \\end{equation*}\n15b. Calculate mean spheroid volume for each treatment condition.\n16b. Using the statistical package of choice, generate dose-response curves and calculate IC50 values (drug concentration required to inhibit growth by 50%) by nonlinear regression analysis.\nAs an example, Figure 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0003] compares two different techniques for assessing drug response: luminescence (using the CellTiter-Glo 3D cell viability assay (steps 13a to 21a) and volume (steps 13b to 16b). These methods of analysis produce comparable dose-response curves (measured by the hill slope, i.e., the steepness of the curve) and IC50 values.",
    "In Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003], we describe how to generate 3D-MB spheroids that are suitable for drug response analysis in a 96-well plate format. However, 384-well culture is more amenable when higher throughput is required for drug screening studies, for example, when using compound libraries. Here, we describe 3D-MB spheroid culture in a 384-well format. Use of opaque-walled 384-well plates allows easy spheroid generation and analysis of luminescence-based viability assays.\nAdditional Materials (also see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003])\nOpaque-walled ULA round-bottom 384-well plates (Corning, 3830)\nGeneration of 3D-MB spheroids\nTiming: 2 hr of hands-on work followed by 4 days of incubation\n1. Manually inspect cells under a brightfield microscope to ensure that they are around 70% to 80% confluent before proceeding.\n2. Remove culture medium and wash cells twice with 10 ml HBSS or sterile PBS.\n3. Add 2 ml trypsin-EDTA and incubate at 37°C for 5 min to allow cell detachment.\n4. When the cells have detached from the flask, wash with 8 ml culture medium and transfer cell suspension into a pre-labeled 15-ml tube.\n5. Centrifuge cell suspension for 5 min at 180 × g at room temperature to form a cell pellet.\n6. During centrifugation, prepare volume of neurosphere medium needed.\nAt least 20 ml neurosphere medium is required for one full 384-well ULA plate.\nSome cell lines require neurosphere medium supplemented with methyl cellulose (detailed in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001]).\n7. Following centrifugation, remove and discard supernatant and resuspend cell pellet in 2 ml neurosphere medium.\n8. Perform a cell count to calculate number of cells/ml according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001], step 8.\n9. Dilute cells in neurosphere medium to the appropriate seeding density for seeding in a volume of 50 µl/well.\nSeeding densities for each cell line are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001].",
    "10. Gently resuspend diluted cell suspension to ensure that the cells are well distributed.\n11. Seed cells in neurosphere medium in a volume of 50 µl/well in the opaque-walled ULA round-bottom 384-well plate using a P200 multichannel pipet and reagent reservoir. Include at least six wells as blank (medium-only) controls per plate to allow for luminescence correction later.\nA P200 multichannel pipet can be used here to seed multiple wells at a time. Ensure that the cell suspension is well distributed in the reagent reservoir before seeding.\n12. For semi-adherent and suspension cell lines (HD-MB03, D283, D425, D458, CHLA-01-MED, and CHLA-01R-MED), centrifuge ULA plates for 5 min at 100 × g at room temperature after seeding to encourage spheroid compactness.\n13. Visually inspect plate under the microscope to check that cells have been seeded in each well.\n14. Transfer plate to the incubator and allow spheroid formation and growth for 4 days before proceeding.\n15. Continue to maintain the spheroids (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001], steps 17 to 21) or subject them to drug treatment (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003], steps 8 to 12) before measuring viability. Reduce volumes to always achieve a final volume of 50 µl/well.\nFollowing drug treatment, assess spheroid viability using CellTiter-Glo 3D cell viability assay (see below, steps 16a to 23a) or by measuring changes in spheroid size (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003], steps 13b to 16b).\nMeasuring spheroid viability following drug treatment using the CellTiter-Glo 3D cell viability assay\nTiming: 1 hr\n16a. Dispense required volume of CellTiter-Glo 3D cell viability reagent (thawed at room temperature) into a reagent reservoir.\nAs a guide, ∼20 ml CellTiter-Glo 3D cell viability reagent is required per 384-well ULA plate (using a volume of 50 µl/well in 384 wells). Adjust this volume based on the number of plates required.",
    "17a. Add 50 µl CellTiter-Glo 3D cell viability reagent per well using a multichannel pipet.\n18a. Shake ULA plate at 250 rpm for 5 min in an orbital incubator to promote cell lysis.\n19a. Incubate plate at for 25 min at room temperature in the dark.\n20a. Insert plate into a plate reader and measure luminescence.\nThe manufacturer recommends a 0.25- to 1-s integration time for luminescence detection. We routinely use a 0.5-s integration time with no issues.\n21a. Export luminescence measurements into a spreadsheet.\n22a. Correct luminescence measurements against blank (medium-only) controls included in step 11.\n23a. Using the statistical package of choice, generate dose-response curves and calculate IC50 values (drug concentration required to inhibit growth by 50%) by nonlinear regression analysis.\nMeasuring changes in spheroid volume following drug treatment\nTiming: 1 hr\n16b. Measure changes in spheroid size according to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003], steps 13b to 16b.",
    "In this protocol, users will harvest 3D-MB spheroids generated from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] or drug-treated spheroids from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003] for IHC staining. Multiple 3D-MB spheroids will be harvested and processed into histological blocks that, following standard fixation and embedding procedures, can be sectioned to produce slides for IHC staining. This protocol allows target validation and the visualization of protein expression patterns and gradients throughout spheroid sections, for example, for proliferation and hypoxia markers (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0002]). It also suitable for the assessment of cytotoxic response following drug treatment. This method can be performed at multiple time points to allow the assessment of staining patterns as the 3D-MB spheroids mature or in response to drug exposure.\nMaterials\nHistoGel (Thermo Fisher Scientific, HG-4000-012)\n4% (v/v) paraformaldehyde (PFA) in PBS (Thermo Fisher Scientific, J19943.K2)\nPBS (Thermo Fisher Scientific, J75889.AE)\nMethanol\nXylene (Honeywell, 534056)\nParaffin\nSodium citrate buffer, pH 6 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-rec-0003])\n70%, 80%, 95%, and 100% (v/v) ethanol\nPeroxidase suppressor (Thermo Fisher Scientific, 35000)\nBlocking buffer (Universal Blocker Blocking Buffer, Thermo Fisher Scientific, 1859332)\nPrimary antibody (e.g., Ki67, Cell Signaling Technology, 9449; CA9, Absolute Antibody, Ab00414-1.1)\nHRP polymer–conjugated secondary antibody (e.g., goat anti-mouse, Abcam, ab214879)\nSignalStain® DAB chromogen concentrate (Cell Signaling Technology, 11725)\nSignalStain® DAB diluent (Cell Signaling Technology, 11724)\nDistilled water\nHematoxylin (Harris Modified Hematoxylin, Thermo Fisher Scientific, 1859352)\nMounting medium (Thermo Fisher Scientific, 1859351)\n60°C water bath (Leica, HI1210)\n1.5-ml microcentrifuge tubes\nCryomolds (Tissue-Tek, Agar Scientific, AGG4581)\nTissue processing cassette (Simport, M490)\nBeakers\nTissue processor (Leica, TP1020)\nWax embedding machine (Leica, EG1160)\nMicrotome (Leica, RM2235)\n52°C water bath\nForceps\n3-aminopropyltriethoxysilane (APES)-coated slides (BioWorld, 42763006-1)\n60°C flattening table (Leica, HI1220)\n60°C oven\nSteamer (IHC World, IW-1102, or equivalent)\nHumidified chamber (BioLegend, 926301)\nHeat-proof containers (e.g., Tupperware)\nSlide rack\nCoplin jar (Fisher Scientific, 12858735)\nTissue paper\nHydrophobic pen (Vector Laboratories, H-4000)",
    "Coverslips (AmScope, CS-24 × 50-100-3PL)\nBrightfield microscope (Brunel Microscopes, N510)\nAdditional reagents and equipment for generating 3D-MB spheroids (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001])\nGeneration of 3D-MB spheroids\nTiming: 2 hr of hands-on work followed by ≥4 days of incubation\n1. Generate and maintain 3D-MB spheroids (10 spheroids per condition/time point) as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001], steps 1 to 15.\nSpheroids should be pre-cultured for ≥4 days to allow spheroid formation and growth. Maintain spheroids until your desired time points (e.g., days 7, 14, and 21).\nEmbedding spheroids in a HistoGel block\nTiming: 3 hr\n2. Pre-heat HistoGel to 60°C in a water bath.\n3. At the desired time points, pool 10 spheroids using a pipet and gently transfer them to a 1.5-ml microcentrifuge tube.\n4. Allow spheroids to settle at the bottom of the tube.\n5. Carefully remove as much medium as possible and avoid disrupting spheroids.\n6. Add 1 ml HBSS or sterile PBS to gently wash spheroids.\n7. Carefully remove HBSS/PBS wash.\n8. Resuspend spheroids in 500 µl HistoGel (pre-heated to 60°C in step 2).\n9. Transfer spheroid/HistoGel suspension to a cryomold and place on ice.\n10. When the spheroid block has set, transfer into a tissue processing cassette.\n11. Place cassette in a beaker and cover with 4% PFA in PBS for 2 hr.\n12. Transfer cassette to a clean beaker and cover with PBS for 10 min.\n13. Transfer cassette to another clean beaker and cover with PBS for a further 10 min.\nProcessing of spheroid blocks\nTiming: 18 hr",
    "14. Process spheroid block overnight in a tissue processor with the following cycles: one bath each of 50%, 70%, and 90% methanol and four baths of 100% methanol (1 hr each), three baths of xylene (1 hr each), and two baths of molten paraffin (2 hr each, vacuum on).\n15. The following day, embed spheroid block in paraffin using a wax embedding machine.\nThe block is now ready for sectioning.\n16. To section the spheroid block, place on ice before carefully aligning on a microtome.\n17. Cut 4-µm sections and carefully place ribbons into a pre-heated 52°C water bath.\n18. Separate each ribbon with forceps and place onto an APES-coated slide.\n19. Leave slides to dry for ≥1 hr at 60°C on a flattening table.\n20. Store slides at room temperature or proceed directly to the next stage.\nIHC staining of spheroid sections\nTiming: 1 day\n21. Prepare for the IHC protocol:\n         \nPlace slides in an oven pre-heated to 60°C for ≥30 min.\nAlternatively, slides can be incubated overnight.\nFill a heat-proof container with sodium citrate buffer (pH 6) and place in a steamer.\nPre-heat steamer for ≥20 min so that it reaches 90°C.\nPrepare a humidified chamber by placing wet paper towels under the slide supports.\n22. Place slides from step 20 in a slide rack and immerse in the following solutions for the indicated lengths of time:\n         \nXylene (10 min).\nXylene (5 min).\n100% ethanol (5 min).\n100% ethanol (5 min).\n95% ethanol (5 min).\n95% ethanol (5 min).\n80% ethanol (2 min).\n70% ethanol (2 min).\n23. Remove slides from the final 70% ethanol bath and wash slides briefly in running tap water.",
    "24. To perform heat-induced antigen retrieval, place slide rack in the sodium citrate buffer bath in the pre-heated steamer (see step 21) for 40 min.\nKeep checking the water levels in the steamer during this incubation and top up if necessary.\n25. Turn off steamer and leave slides inside to cool for 10 min.\n26. Place slides in a Coplin jar filled with PBS for 2 min.\n27. With a tissue paper, gently wipe off excess PBS from slide and draw one large circle on slide around the spheroids with a hydrophobic pen.\n28. Place slides in the humidified chamber from step 21d.\n29. Add 150 µl peroxidase suppressor over spheroid sections on each slide and incubate for 30 min to quench endogenous peroxidase activity.\n30. Wash slides by placing in a Coplin jar filled with PBS for 3 min.\n31. Replace with fresh PBS and wash slides for an additional 3 min.\n32. Add 150 µl blocking buffer over spheroid sections on each slide and incubate for 30 min.\n33. Gently blot excess buffer from slide with a tissue paper.\n34. Add 150 µl primary antibody diluted in blocking buffer (e.g., Ki67 1:400, CA9 1:800) over spheroid sections on each slide and incubate for 1 hr.\n35. Wash slides by placing in a Coplin jar filled with PBS for 3 min.\n36. Replace with fresh PBS and wash slides for an additional 3 min.\n37. Add 150 µl HRP polymer–conjugated secondary antibody diluted in blocking buffer per slide and incubate for 1 hr.\n38. Wash slides twice for 3 min each with PBS.\n39. Prepare a 1× DAB solution by diluting 30 µl SignalStain® DAB chromogen concentrate in 1 ml SignalStain® DAB diluent.\nThe 1× DAB solution is stable at 4°C for up to 2 weeks.",
    "40. Add 150 µl of 1× DAB solution and incubate until staining intensifies.\nBrown precipitate indicates the presence of the target antigen.\nTypical incubation times are 5 to 15 min.\n41. Wash slides by placing in a Coplin jar filled with PBS for 3 min.\n42. Replace with fresh PBS and wash slides for an additional 3 min.\n43. Rinse slides with distilled water and drain.\n44. Add 150 µl hematoxylin over spheroid sections on each slide and incubate until desired staining is achieved.\nThe hematoxylin counterstain should provide contrast between the target antigen and background tissue elements. The desired staining is as described by the antibody supplier, shown in publications, or approved by a pathologist. Typical incubation times are 10 s to 2 min.\n45. Drain off excess hematoxylin and wash slides several times with distilled water.\n46. Wash slides briefly in running tap water.\n47. Place slides in a rack and wash in the following solution baths for 2 min each:\n         \n95% ethanol.\n100% ethanol.\n100% ethanol.\nXylene.\n48. Place slides on a flat surface and apply 1 to 3 drops of mounting medium.\n49. Apply a coverslip on top of the mounting medium and allow to set for 1 to 2 hr at room temperature.\n50. Image stained spheroid sections under a brightfield microscope at 10× and 20× magnification to visualize protein expression patterns (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0002]).",
    "Tumor spread involves the alteration of the cell's cytoskeleton, increased cell motility, and interaction with the surrounding ECM. Spheroid models are a useful tool to study tumor dissemination in vitro by modeling the migration of cells from a solid tumor (in this case, the 3D-MB spheroids) across the brain ECM (represented by a hyaluronan hydrogel). Here, we describe how users can transfer spheroids produced in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] onto a simple brain-specific matrix and measure migration of cells across the matrix over time (also called relative spheroid outgrowth). We refer to this as the hyaluronan hydrogel spheroid migration assay. The hyaluronan hydrogel that we use represents the backbone of the brain parenchyma, and we describe how this can be tailored by the addition of other ECM factors, such as fibronectin (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0003]), to discern how these factors influence cell migration.\nMaterials\nHyStem hydrogel kit (ESI-BIO, GS311), containing Glycosil, Extralink-Lite, and DG Water\nSyringe (Scientific Laboratory Supplies, SYR6158)\nNeedle (Fisher Scientific, BD301750)\nRocker (Stuart, SRT6)\nTissue culture–treated 96-well plate (Corning, 10695951)\nStatistical package of choice (GraphPad Prism version 9.2.0 or equivalent)\nAdditional reagents and equipment for generating 3D-MB spheroids (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001]) and for imaging spheroids (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002])\nGeneration of 3D-MB spheroids\nTiming: 2 hr of hands-on work followed by 4 days of incubation\n1. Prepare spheroids as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001], steps 1 to 15, for use in the HA hydrogel spheroid migration assay.\nSpheroids should be pre-cultured for 4 days to allow spheroid formation and growth.\n2. Before proceeding with the setup of the migration model described below, visually inspect spheroids under a microscope to ensure that they are of optimal size and health (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002]).\nExamples of day 4 3D-MB spheroids are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001].\nPreparation of HA hydrogel layer",
    "Timing: 2 hr\n3. Thaw components of the HyStem hydrogel kit (Glycosil, Extralink-Lite, and DG Water) at room temperature.\n4. Using a syringe and needle, add 1 ml DG Water to the thawed Glycosil.\n5. Place vial horizontally on a rocker for 40 min to allow the solution to dissolve.\nThe resulting solution should be clear and slightly viscous.\n6. Using the syringe and needle, add 250 µl DG Water to the thawed Extralink-Lite. Invert several times to dissolve.\n7. Prepare HA hydrogel at a 1:4 (Extralink-Lite to Glycosil) ratio by combining 250 µl Extralink-Lite and 1 ml Glycosil.\nAdditional ECM components can be included to create a more complex hydrogel composition, for example, with laminin or fibronectin (e.g., Cultrex, 3420-001-03) (we have used 50 µg/ml), so that different conditions are tested. The Extralink-Lite volume should not be changed, as this is the component responsible for maintaining the correct matrix stiffness. Instead, adjust the volume of Glycosil to account for the added volume.\n8. Add 50 µl of the HA hydrogel to each well of a tissue culture–treated 96-well plate.\nThis volume is enough to form a uniform layer on the well surface. Using <50 µl is likely to result in an unevenly distributed layer.\n9. Incubate hydrogel-coated plate at 37°C for 30 min to allow the gel layer to set.\nTransfer of spheroids to HA hydrogel\nTiming: 2 hr\n10. Remove both hydrogel-coated plate (from step 9) and spheroid plate (from step 1) from the incubator.\n11. Carefully position a P200 pipet tip at base of the spheroid plate and gently aspirate one spheroid in 100 µl neurosphere medium.\n12. Transfer one spheroid into center of each well of the hydrogel-coated plate.\n13. Repeat procedure for the remaining spheroids (a minimum of three repeats per experimental condition is recommended).",
    "14. Add an additional 100 µl fresh neurosphere medium to each well.\n15. Incubate spheroid migration plate at 37°C for 1 hr to allow the spheroids to settle on the matrix.\nFollowing incubation, image spheroid migration plates on day 0 and subsequently every 24 hr.\nAssessment of spheroid migration\nTiming: 1 hr per time point\n16. Place spheroid migration plate under a brightfield microscope with an attached camera.\n17. Image each well at both 4× and 10× magnification.\nUse a calibration slide to determine the scale of the images.\n18. Transfer images to a computer.\n19. Follow step 3 of Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002] to calculate spheroid area.\n20. Drag and drop output folder into ImageJ and assess blue outline of the migrated spheroid area. If the macro has failed to detect the correct spheroid circumference, manually outline migrated spheroid area and go to Analyze > Measure (or Ctrl + M) to calculate area.\n21. Export spheroid measurements from ImageJ into a spreadsheet.\n22. Using the area values, calculate relative spheroid outgrowth by normalizing the area covered by migrating cells over time to the initial spheroid size at 0 hr.\n23. Using the statistical package of choice, generate spheroid outgrowth plots (see Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0003]-ii). Calculate statistical significance using two-way ANOVA analyses with Sidak's multiple-comparisons post hoc test.\nAs an example, Figure 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-fig-0003] shows representative images of 3D-MB spheroid migration (using the ONS76 cell line) across HA matrices with or without the addition of the ECM component fibronectin (FN) (see panel (i)). Analysis of migratory behavior following steps 16 to 23 produces spheroid outgrowth plots (see panel (ii)) showing that the addition of FN to the HA matrix significantly enhances cell migration compared to the HA matrix alone.",
    "In addition to protein expression analysis by IHC (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0005]), RNA analysis methods can also be used to investigate gene expression, either globally (RNA-Seq) or by candidate gene-based approaches (RT-qPCR). Here, we describe RNA extraction protocols for both (a) 3D-MB spheroids grown without a hydrogel matrix (as described in Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003]) and (b) 3D-MB spheroids used in hydrogel-containing migration models (Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006]). These allow the user to determine gene expression changes occurring in response to cytotoxic drugs (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003]) or to the influence of ECM components (Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006]) in comparison to control samples (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001]). In each case, the purified RNA is suitable and sufficient for use in downstream applications, including RNA-Seq and RT-qPCR.\nMaterials\nLiquid nitrogen (if snap-freezing; optional)\nNucleoSpin RNA Plus Kit (Macherey-Nagel, 740984) or equivalent RNA extraction kit, including lysis buffer, gDNA removal column, binding solution, NucleoSpin RNA Plus column, Wash Buffers 1 and 2, 1.5-ml collection tube, and RNA-free water\nMatrix D beads (2-ml tubes, MP Biomedicals, 11412420)\n1.5-ml microcentrifuge tubes\nVortex\nMicrocentrifuge\nSpectrophotometer (NanoDrop, Thermo Scientific, ND2000C)\nBioanalyzer (2100 Bioanalyzer, Agilent Technologies, G2939BA)\nTissue homogenizer (FastPrep-24 tissue homogenizer, MP Biomedicals, 12079310)\nAdditional reagents and equipment for generating 3D-MB spheroids (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] or 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003]) and for imaging spheroids (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002])\nNOTE: Experiments involving RNA require careful technique to prevent contamination.\nRNA extraction from 3D-MB spheroids (without hydrogel matrix)\nTiming: 1 hr\n1a. Prepare 3D-MB spheroids as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0001] or 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0003], with 10 spheroids per condition/time point of interest.\nMaintain spheroids until your desired time points (e.g., days 4, 7, 14, and 21).\n2a. Before proceeding, visually inspect spheroids under a microscope to ensure that they are of optimal size and health (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0002]).",
    "Examples of day 4 3D-MB spheroids are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-tbl-0001].\n3a. At the desired time points, pool 10 spheroids into a 1.5-ml microcentrifuge tube.\n4a. Allow spheroids to settle at bottom of the tube.\n5a. Carefully remove as much medium as possible and avoid disrupting spheroids.\n6a. Wash spheroids with 1 ml HBSS or sterile PBS.\n7a. Carefully remove HBSS/PBS wash.\n8a. At this stage, either snap-freeze spheroids in liquid nitrogen and store at –80°C (for RNA extraction later) or proceed directly to RNA extraction (step 9a).\nThis is a safe stopping point. To restart, thaw samples on ice and proceed immediately with step 9a.\n9a. Extract RNA using a NucleoSpin RNA Plus Kit or equivalent RNA extraction kit:\n         \nAdd 350 µl lysis buffer to spheroids. Mix by pipetting and vortexing sample.\nii. Transfer lysate to gDNA removal column. Centrifuge 30 s at 11,000 × g. Following centrifugation, discard column.\nAdd 100 µl binding solution to flow-through and transfer to a NucleoSpin RNA Plus column. Centrifuge 15 s at 11,000 × g and discard flow-through.\nAdd 200 µl Wash Buffer 1. Centrifuge 15 s at 11,000 × g and discard flow-through.\nAdd 600 µl Wash Buffer 2. Centrifuge 15 s at 11,000 × g and discard flow-through.\nAdd 250 µl Wash Buffer 2. Centrifuge 2 min at 11,000 × g to dry membrane.\nTransfer column to a 1.5-ml collection tube.\nAdd 30 µl RNase-free water. Centrifuge 1 min at 11,000 × g .\n10a. Determine RNA concentration using a spectrophotometer.\nA 260/280 ratio of ∼2.0 is generally accepted as “pure” for RNA.\nTypical RNA yields range from 10 to 20 ng/µl from 10 spheroids.\n11a. Determine RNA integrity using a bioanalyzer.\nGood-quality RNA will have clear 28S and 18S peak bands.",
    "12a. Store eluted RNA at –80°C until use in RT-qPCR or RNA-Seq.\nRNA extraction from 3D-MB spheroids (with hydrogel matrix)\nTiming: 1 hr\n1b. Prepare 3D-MB spheroid migration models as described in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.357#cpz1357-prot-0006], with 10 spheroids per condition/time point.\n2b. At the desired time points, gently remove medium from each well and use a pipet tip to move hydrogel layer containing migrated spheroids into a 1.5-ml microcentrifuge tube (pooling 10 wells).\n3b. At this stage, either snap-freeze samples in liquid nitrogen and store at –80°C (for RNA extraction later) or proceed directly to RNA extraction (step 4b).\nThis is a safe stopping point. To restart, thaw samples on ice and proceed immediately with step 4b.\n4b. Extract RNA using a NucleoSpin RNA Plus Kit or equivalent RNA extraction kit:\n         \nTransfer samples into tubes containing lysing Matrix D beads.\nAdd 350 µl lysis buffer and homogenize samples for 30 s using a FastPrep tissue homogenizer.\nTransfer lysate to a new 1.5-ml microcentrifuge tube and centrifuge 5 min at 11,000 × g to pellet hydrogel.\nTransfer centrifuged lysate to gDNA removal column, avoiding the hydrogel pellet. Centrifuge 30 s at 11,000 × g. Following centrifugation, discard column.\nAdd 100 µl binding solution to flow-through and transfer to a NucleoSpin RNA Plus column. Centrifuge 15 s at 11,000 × g and discard flow-through.\nAdd 200 µl Wash Buffer 1. Centrifuge 15 s at 11,000 × g and discard flow-through.\nAdd 600 µl Wash Buffer 2. Centrifuge 15 s at 11,000 × g and discard flow-through.\nAdd 250 µl Wash Buffer 2. Centrifuge 2 min at 11,000 × g to dry membrane.\nTransfer column to a 1.5-ml collection tube.\nAdd 30 µl RNase-free water. Centrifuge 1 min at 11,000 × g .\n5b. Determine RNA concentration using a spectrophotometer.",
    "A 260/280 ratio of ∼2.0 is generally accepted as “pure” for RNA.\nTypical RNA yields range from 10 to 20 ng/µl from 10 spheroids\n6b. Determine RNA integrity using a bioanalyzer.\nGood-quality RNA will have clear 28S and 18S peak bands.\n7b. Store eluted RNA at –80°C until use in RT-qPCR or RNA-Seq."
  ],
  "subjectAreas": [
    "Toxicology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}