{
  "id": 4883,
  "origin_website": "Bio",
  "title": "Estimation of Wound Tissue Neutrophil and Macrophage Accumulation by Measuring Myeloperoxidase (MPO) and N-Acetyl-β-D-glucosaminidase (NAG) Activities",
  "procedures": [
    "Harvesting wound tissueThe wounds are harvested after animal euthanasia. Anesthetic overdose is the preferred method for euthanasia. Avoid cervical dislocation or decapitation methods. First, remove the back skin of the mice and carefully remove the wound tissue with the aid of a circular biopsy punch (with a slightly larger diameter than the one employed to wounding) to collect entire wound area (plus about 2 mm surrounding skin tissue) (Figures 1A-D).Place the fresh samples (harvested tissue) in 2 ml microcentrifuge tubes and immediately dip in liquid nitrogen.Store the harvested tissue at -80 °C until use.To the excisional wound healing model, see Moreira et al. (2015).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151119/20151119054314_4460.jpgFigure 1. Harvesting wound tissues for analysis. After euthanasia, remove the dorsal wounded skin of mice (A). Place the larger circular punch over the skin lesion, press down, and slowly rotate to remove a circular piece of skin (B-C). Collect for NAG and MPO analyses (D) by immediately dipping the tissue-containing microcentrifuge tubes in liquid nitrogen.MPO enzyme isolation and assay (Figure 2)Weigh and homogenize the tissue in ice-cold Buffer 1 (100 mg tissue/1 ml buffer), using a powered high speed tissue homogenizer (Ultra-turrax or equivalent). Homogenizing procedures during enzyme isolation must be performed on ice.Centrifuge at 10,000 x g for 10 min at 4 °C.Discard supernatant and submit the pellet to hypotonic lysis as follows: Resuspend the pellet in 1 ml of 0.2% NaCl for 30 sec, and then add 1.0 ml of a 1.6% NaCl/5% glucose solution.Centrifuge at 10,000 x g for 10 min at 4 °C.Discard supernatant and resuspend the pellet in Buffer 2 (100 mg tissue/1 ml buffer).Vortex and then freeze-thaw three times using liquid nitrogen. The thawing step can be performed under running tap water. Centrifuged at 10,000 x g for 15 min at 4 °C.",
    "Save the supernatants for the enzymatic assay (if the MPO assay is not carried out immediately, the supernatants can be stored at -20 °C until used).Dilute samples in Buffer 2 at RT (we suggest 1:3, but the dilution should be adjusted experimentally).To assay, add 25 μl of diluted supernatants samples (or Buffer 2, used as blank) per well to 96-well microplate. All samples should be run in duplicate.Add 25 μl of MPO substrate solution.Incubate for 5 min at 37 °C.Add 25 μl of 0.002% H2O2.Incubate for 5 min at 37 °C.Finally, stop reaction with 25 μl of 1 M H2SO4.Read at 450 nm.Calculate the relative activity of MPO as follow: (sample absorbance spectrum - blank absorbance spectrum) x sample dilution factor. Express results as relative units (MPO activity/100 mg) that denote activity of MPO per 100 mg of tissue.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151119/20151119054358_0480.jpgFigure 2. MPO assay procedure summary NAG enzyme isolation and assay (Figure 3)Weigh and homogenize the tissue in ice-cold Saline-Triton buffer (100 mg tissue/1 ml buffer), using a powered high speed tissue homogenizer (Ultra-turrax or equivalent). Homogenizing procedures during enzyme isolation must be performed on ice.Centrifuge at 3,000 x g for 10 min at 4 °C.Save the supernatant for the enzymatic assay (if the NAG assay is not carried out immediately, the supernatants can be stored at -20 °C until used).Dilute assaying samples in phosphate-citrate buffer at RT (we suggest 1:3, but the dilution should be adjusted experimentally).To assay, add 25 μl of diluted supernatants samples (or phosphate-citrate buffer, used as blank) per well to 96-well microplate. All samples should be run in duplicate (Figure 4).Add 25 μl of NAG substrate solution.Incubate for 10 min at 37 °C.Finally, stop reaction with 25 μl of 0.2 M Glycine buffer. Read at 400 nm.",
    "Calculate the relative activity of NAG as follow: (Sample absorbance spectrum-blank absorbance spectrum) x sample dilution factor. Express results as relative units (NAG activity/100 mg) that denote activity of NAG per 100 mg of tissue.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151119/20151119054444_3645.jpgFigure 3. NAG assay procedure summary imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151119/20151119054615_1879.jpgFigure 4. 96-Well NAG/MPO plate layout. Example of blank and sample distribution. All samples should be run in duplicate. For NAG, the blank is phosphate-citrate buffer and for MPO is buffer 2."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}