{
  "id": 15843,
  "origin_website": "Jove",
  "title": "Uracil-DNA Glycosylase Assay by Matrix-assisted Laser Desorption/Ionization Time-of-flight Mass Spectrometry Analysis",
  "procedures": [
    "1. Substrate/template preparation\nDesign uracil substrate/template duplex with a balanced G+C content of ~50 ± 10% and minimum melting temperature of 50 °C for the duplex region.\n\tNOTE: One nucleotide difference between 18 nt substrates and 19 nt templates (Table 1 and Figure 1) helps better MS signal interpretation and appropriate annealing. The template strand serves as complementary DNA to generate A-U or G-U mismatches (Table 1) but can also be used as a reference signal in MS measurements. The use of HPLC-purified synthetic oligonucleotides is satisfactory for this study.\nDissolve DNA in 1 mM EDTA and 10 mM Tris-HCl(pH 8.0 at 25 °C) (TE) at a concentration of 100 µmol/L as a stock and store at -20 °C. Dilute this 20 µL stock with TE to a final volume of 800 µL (25-fold dilution to 4 µmol/L). Measure the absorbance of the DNA solution in a UV-visible spectrophotometer at λ = 260 nm to ensure the manufacturer's assigned concentration. For example: A260 = 0.204 for 4 µmol/L of U+9 and A260 = 0.192 for 4 µmol/L of T1 (Table 1).\nPerform MALDI-TOF MS analysis (sections 4-6) for oligonucleotide quality control by inspecting unique peak signals at designated m/z values as well as by checking that the signal-to-noise ratio is >100 (Figure 1B and Figure 1D).\n2. DNA glycosylase assay\nUsing a G:U substrate of T1/U+9 duplex (Table 1 and Figure 1A) for the glycosylase reaction, for example, in a 1.5 mL sterile microcentrifuge tube, add 70 µL of H2O, 10 µL of 10x UDG reaction buffer, 5 µL of T1 stock, and 5 µL of U+9 stock (step 1.2.).",
    "NOTE: Choose the correct type of micropipette and follow the manufacturers' instructions to handle the required volume. For example, use a 2 µL pipette to dispense 0.1-2 µL of liquid, use a 10 µL pipette to dispense 2-10 µL of liquid, and use a 100 µL pipette to dispense 20-100 µL of liquid to ensure accuracy and precision of the results. The described volume of the reagent mix is for 10 assays; adjust the volume for the desired number of reactions. The 1x UDG reaction buffer contains 1 mM EDTA, 1 mM dithiothreitol, and 20 mM Tris-HCl (pH 8.0 at 25 °C). See the Table of Materials for the source of 10x UDG reaction buffer.\nSecurely close the tube; incubate in a water bath for 30 min at 65 °C, then for 30 min at 37 °C, and finally on ice for 3 min to ensure proper annealing of the substrate/template duplex.\nIn a 1.5 mL sterile microcentrifuge tube, add 49 µL of ice-cold 1x UDG reaction buffer and 1 µL of UDG (5,000 units/mL; see the Table of Materials), diluting to 0.1 units/µL. Make serial dilutions with 1x UDG buffer to the desired enzyme concentrations of 0.05, 0.02, or 0.01 units/µL. Always keep the diluted UDG on ice.\n\tNOTE: In a 10 µL reaction, 0.1 units of UDG can cleave more than 30 pmol of uracil from a T1/U+9 duplex in 3 min.\nIn a 1.5 mL sterile microcentrifuge tube, add 9.0 µL of substrate mix from step 2.2 and prewarm the tube to 37 °C. Add 1.0 µL of the diluted UDG from step 2.3. Use a timer to time the reaction and flick the tube to mix contents.",
    "NOTE: For a unit definition assay, the incubation time is 30 min. For a kinetic assay, use a time-course analysis of 0.5, 1, 2, 3, 5 min to obtain the initial rate. For a UGI inhibition assay, time the reaction for 15 min.\nCentrifuge the tubes with the reaction mixture for 3-5 s at 3,200 × g at ambient temperature. Then, transfer the reaction immediately to 37 °C.\nReaction termination\nPrepare solutions of 0.25 M HCl and 0.23 M Tris base. In a 15 mL test tube, add 10 mL of a solution of 1 mM EDTA and 20 mM Tris-HCl (pH 8.0 at 25 °C) to mimic 1x UDG reaction buffer. Acidify with 1 mL of 0.25 M HCl and check with a pH meter to ensure the pH is ~2 ± 0.5. Neutralize with 1 mL of 0.23 M Tris base and check with a pH meter for a final pH of 6.5 ± 0.5.\n\t\tNOTE: Using pH test strips is a quick and easy way to reconfirm the pH levels of the reagent mix.\nAdd 1 μL of 0.25 M HCl to acidify the 10 μL reaction mixture to inactivate the enzyme and place it on ice for 6 min. Add 1 µL of 0.23 M Tris base to neutralize the DNA products to avoid AP site breakage by prolonged exposure to acid. Add 13 µL TE to increase the volume of the product mixture for matrix chip transfer and then place it on ice.\n\t\tNOTE: The AP product is chemically unstable and should be analyzed by MALDI-TOF MS within 2 days. After prolonged storage for more than a week, the accumulation of a substantial portion of strand breaks occurs due to β/δ elimination reactions of the AP products (Figure 1D-G).",
    "Transfer all the 25 µL UDG reaction products from microcentrifuge tubes to a 384-well microtiter plate.\n\t​NOTE: High concentrations of cations, such as sodium or potassium in buffers, generate interference in the MALDI-TOF MS analysis and thus require desalting. As E. coli UDG reaction buffer contains very low concentrations of cations, desalting is not necessary. However, modify this protocol to measure other DNA glycosylase reactions containing metal cations that require desalting as described previously35.\n3. Transfer UDG reaction products to a matrix chip\nOpen the door of the nanoliter dispenser (see the Table of Materials) and load the 384-well microtiter plate from step 2.7 onto the plate holder of the deck.\nInsert the matrix chip array into the corresponding scout plate position. Place the loaded scout plate on the processing deck of the nanoliter dispenser and close the door.\nTouch the run button on the transfer screen, and wait for the instrument to start dispensing samples from the 384-well microtiter plate to the matrix chip.\nUse the Vision tab option to show the image of the chip and the dispense volumes for each spot during dispensing. Ensure the spotted volume on the chip is in the range of 5-10 nL.\n4. Setup the assay parameters on the mass spectrometer\nUse the application program (see the Table of Materials) to prepare a .xlsx file containing the predicted signal m/z value for importing.\n\tNOTE: The settings in FILE I.xlsx (Table 2) are example settings for the UDG assay of G:U substrate in section 2.\nUse the application program to create and define a new UDG assay by right-clicking Import Assay Group in Designer Format option and selecting the .xlsx file from the dropdown list (e.g., FILE I.xlsx from step 4.1).",
    "Right-click the Customer:Project:Plate button and click on the top of the dropdown option tree to establish a new assay plate. In the dialog box, type in a file name (e.g., CTT20210620 for the lab code and assay date), and in the plate type dropdown, select the 384-well plate type and press OK. Look for a blank plate to appear on the right of the screen.\nClick the Assay option; select the assay (e.g., FILE I.xlsx) from the dropdown list.\nTo assign the selected assay (e.g., FILE I.xlsx) to each sample spot position on the plate, move the cursor to each position of the blank plate, click to highlight the well, and right-click to select Add Plex.\nUse a desktop or laptop computer to prepare a working list in .xlsx format with no header (e.g., 0620.xlsx of Table 3) for all the samples on the chip from step 2.7. Click the Add New Sample Project button; select the file (e.g., 0620.xlsx) from the dropdown list to import the working list.\nLook for all the test sample codes in the working list (e.g., from 0620.xlsx) on the left of the screen. Click the sample code in the working list, and right-click on the corresponding position of the plate to link the tests to each position.\n5. Mass spectrometer operation\nUse the application program to link the mass spectrometer (see the Table of Materials) to the sample chip (from section 3) to be analyzed.\nClick on the default setting. In the dialog box, type in a file name from step 4.3 (e.g., CTT20210620); in the Experiment Name, type in the chip ID in the Chip Barcode, and save the settings.\nStart the mass spectrometer control program (see the Table of Materials).",
    "Push the In/Out button of the mass spectrometer and let the deck extend. Take out the chip holder and insert the sample chip from step 3.4 into the chip holder. Place the loaded chip holder onto the extended deck and push the In/Out button for the sample chip to enter the instrument.\nDouble-click the Acquire icon of the application program. In the Acquire window, click the auto run tab to start the instrument and acquire mass spectra from the samples on the chip.\n6. Viewing mass spectra and analyzing the data\nRun the data analysis program (see the Table of Materials).\nBrowse the database tree and select the chip ID from step 5.2. Click to highlight a target well on the chip, and click the spectrum icon to show the mass spectrum.\nRight-click to choose Customization Dialog to crop a specific range of spectrum in a new window. Click on the X-Axis to type in the upper and lower limits of m/z, and press OK to show the specified range spectrum, including the signals of interest.\n\tNOTE: The amount of DNA is proportional to the peak intensity at each m/z value unit.\nMeasure the peak height of signals' m/z values corresponding to U substrate, AP-product, and template. Click on the peak and view the peak height in the upper left corner of the screen.\n\tNOTE: A spectrum of 1,600 width/1,200 unit is a reasonable dimension for inspection on a computer screen as well as for recordkeeping.\nTo save the spectrum for recordkeeping, right-click Export and select JPEG file type in the dropdown list. Click on Destination and Browse Disc to select the storage device in the dropdown list (e.g., flash disc E:). Type the file name (e.g., 0620_1-2.jpg) and click Export.",
    "If required, print out an exported JPEG file and measure the peak height manually using a ruler.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}