{
  "id": 17430,
  "origin_website": "Jove",
  "title": "Step-by-Step Stapedotomy through Transcanal Exclusive Endoscopic Approach",
  "procedures": [
    "This research has been conducted in accordance with ethical principles, including the World Medical Association Declaration of Helsinki (2002) and the institutional human research ethics committee's guidelines (Comitato Etico dell'Area Vasta Emilia Nord). The local ethical committee does not perform a formal ethical assessment for case reports.\n1. Preparation of the patient\nAfter oro-tracheal intubation and general anesthesia, position the patient supine with the head tilted toward the opposite side of the affected ear, and the chin slightly hyperextended. Pull down the same-side shoulder as much as possible, to create a wide angle between the head and the shoulder allowing easier access to the ear.\nUsing a 5 mL syringe with G25 0.50 x 42 mm needle, inject around 1-2 mL of local anesthetic diluted with a vasoconstrictor agent (e.g., 2% mepivacaine and epinephrine 1:200,000) in the four main points of the EAC skin (posterior wall, superior and inferior angle, retrotragal region).\n2. Preparation of the sterile surgical site\nUse an iodopovidone-soaked gauze to sterilize the whole external ear, to create an aseptic field.\nEnsure that iodopovidone enters the EAC and reaches the tympanic membrane.\n3. Preparation of the operating room and surgical instruments\nPlace the endoscopic tower or a high-resolution monitor when available, in front of the surgeon, at his/her eye level, at adequate distance to keep a comfortable position of the head and neck during the surgery.\nConnect a 3 mm diameter, 14 cm length, 0° rigid endoscope to the high-definition digital camera and xenon light source. Keep the light source at 50% intensity to prevent heat damage to the inner ear.\nPerform white balance by pushing the central button on the camera head and adjust the focus by turning its gray wheel before starting the surgery.",
    "Prepare a quality de-misting (anti-fog) solution to clean the endoscope tip. Dip a cotton pad in this solution and place it close to the external ear.\n\t​NOTE: The standard otological instruments set for stapes surgery is prepared on the instrument table, as shown in Figure 1.\n4. Surgical steps\nNOTE: Hold the endoscope with the non-dominant hand, leaning it against the posterior wall of the EAC, and the surgical instruments with the dominant one. Surgical instruments, if any, should be introduced in the EAC before the endoscope and moved toward the middle ear under endoscopic vision, to prevent accidental damage to the external and middle ear structures. It is advisable to keep any working instrument above the endoscope and stabilize its movement keeping the fourth and fifth fingers on the patient's head (Figure 2).\nUnder direct endoscopic vision, perform anesthesia by slowly injecting another 1-2 mL of local anesthetic diluted with a vasoconstrictor agent (e.g., 2% mepivacaine and epinephrine 1:200,000) in the subperiosteal plane of the posterior wall of the EAC.\nUse scissors to cut hair of the most lateral part of the EAC, to avoid contaminating the tip of the endoscope at each in and out passage of the canal.\nUse the monopolar (molecular resonance hook) with 15 W power to delineate the tympano-meatal flap (TMF) incision from 5 to 12 o'clock, about 8 to 10 mm far from the annulus (modified Rosen incision).\nUse the round knife to perform the actual skin incision following the previously marked line and raise the TMF with the help of epinephrine-soaked cottonoids.\nOnce the annulus is identified as a white thickening of the tympanic membrane, continue the dissection under it. Detach the pars flaccida from the short process of the malleus with Hartmann forceps, keeping the pars tensa adherent to the umbus.",
    "NOTE: During this step, identify the chorda tympani as a whitish string emerging from the chordal eminence, and leave it untouched.\nRemove the posterior wall of the EAC and the scutum through the curette to achieve a good exposure of the oval window region. In some cases, even if the oval window region is fully exposed, some curettage is necessary to create a favorable working area on the stapes. Displace the chorda tympani medially with a hook to further expose the footplate.\n\tNOTE: Take some time to inspect the middle ear anatomy to check the important anatomical landmarks, such as the facial nerve, which could be dehiscent and/or prolapsed onto the footplate, as in the present case.\nCheck the ossicular chain by gently pushing the stapes and the malleus with a hook, and confirm stapes fixation.\nUse the microdrill with a 0.6 mm diamond burr to perform posterior crurotomy. Then, create a hole in the mid or posterior portion of the footplate.\nCut the stapedial tendon with Bellucci scissors. Then, disarticulate the incus from the stapes with the help of a hook and remove the stapes superstructure.\n\tNOTE: Avoid using suction on the hole to prevent perilymphatic fluid removal and minimize post-operative vertigo or inner ear damage.\nUse the Fisch hook to regularize the footplate hole and check its adequate calibration, as well as to remove possible small bone fragments from the vestibule.\nInsert the stapes prosthesis (0.6 mm x 4.75 mm - total length 5.75 mm platinum/polytetrafluoroethylene prosthesis) into the EAC using the suction tube.\nGently position it into the footplate hole with the hook. Crimp the prosthesis hook after anchoring it to the long process of the incus.\nCheck the proper movement of the prosthesis, by gently pushing on the handle of the malleus.",
    "Replace the TMF and pack the EAC with resorbable hemostatic pledgets.\n5. Ear dressing\nCover the auricle with an adhesive plaster. No compression is needed.\n6. Post operative care\nAllow the patient to drink, eat, and stand up at least 8 h post-operatively, if no nausea or vomiting occurred.\nThe following day assess the facial nerve function, using the House-Brackman scale14 and the presence of spontaneous nystagmus with Frenzel googgles. Perform bone conduction pure tone audiometry to exclude sensorineural HL15.\n\tNOTE: A two week-follow up visit is planned to remove residual pledgets of hemostatic material and check the healing process. Complete audiometric evaluation and otoendoscopy are usually performed between 1 to 2 months post-operatively.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}