{
  "id": 13706,
  "origin_website": "Jove",
  "title": "Grafting of Beads into Developing Chicken Embryo Limbs to Identify Signal Transduction Pathways Affecting Gene Expression",
  "procedures": [
    "Ethics Statement: All these experiments follow the animal care and ethical guidelines of the University of Nottingham.\n1. Preparation of Heparin Beads for Grafting\nWash heparin beads thoroughly in PBS before use. Note: Beads can be stored at 4 °C as a slurry in PBS.\n\t\nSelect beads for grafting by removing them from the stock with a 20 µl pipette into a 1 ml drop of PBS. Then use a micropipette set to 2 µl to transfer beads into a 20 µl drop of PBS in a 3 cm petri dish. Choose beads based on size and, using a stereo dissecting microscope, transfer selected beads with a P2 pipette tip; those around 100 µm diameter are ideal.\nRemove the PBS from the beads. Remove most of the liquid with a 20 µl pipette and the residual liquid by capillary action with fine watchmakers forceps. Note: It is important to remove as much as possible so the growth factor is not diluted when it is added to the beads.\nPipette the growth factor directly onto the beads. For FGF18 add 0.5 µl of recombinant FGF18 reconstituted at 0.5 mg/ml in 0.1% BSA in PBS. Place several drops of water around the edges of the dish to prevent the liquid from evaporating.\nIncubate the beads for 1 hr at RT. Remove the drops of water from the dish with a Pasteur pipette and place on ice ready for grafting.\nIf required (for transparent beads) transfer 4-5 beads to 2% phenol red before grafting to help visualize them. Rinse in PBS before transferring to the embryo.\n2. Preparation of AG 1-X2 Beads for Grafting\nPrior to use derivatize beads with 0.2 N formic acid.",
    "To do this use a spatula to transfer beads to a 1.5 ml microcentrifuge tube. Add 1ml of 0.2 N formic acid and wash on a shaking platform for 1 hr.\nThen remove the formic acid with a p1000 pipette and replace with 1 ml of water. Wash for 1 hr and repeat six times to remove remaining formic acid.\nRemove remaining liquid with a p1000 pipette and store the beads at 4 °C. Note: It is not necessary to remove all the residual water at this stage.\nRemove a small pellet of beads of approximately 5-10 µl volume from the stock using a small spatula into a 3 cm petri dish and add 1 ml of DMSO (or whichever solvent the drug is dissolved in). Note: This should provide several hundred beads from which to select those of the right size.\nThen use a P2 pipette set to 2 µl to transfer beads of approximately 100 µm diameter to a 20 µl drop of solvent in another 3 cm petri dish.\nRemove solvent with a 20 µl pipette and any residual solvent with a 2 µl pipette. Replace with 20 µl of the drug to be applied.\n\tNOTE: For consistency dissolve the drug at a concentration of 100 µM in DMSO (or which ever solvent is used), aliquot into 20 µl and store at -80 °C as some small molecule inhibitors are unstable and it is best to avoid repeated freeze-thawing. If necessary then dilute the drug to the desired concentration before soaking beads. Effective concentrations may need to be determined empirically for each drug.\nIncubate for 1 hr. Protect from light as many of these molecules are light sensitive.",
    "Before grafting transfer 4-5 beads with a p2 pipette set to 2 µl into 20 µl of 2% phenol red dissolved in water. Perform this step using a stereo dissecting microscope to visualize the beads. Remove a single bead with fine watchmakers forceps or a wire loop and rinse in PBS before transferring to the embryo. Do not leave beads in 2% phenol red for more than 15 min before use as this can cause loss of activity.\n3. Preparing Tungsten Needles\nCut fine tungsten wire into 3-4 cm lengths. Insert one piece of wire into the end of a glass Pasteur pipette and melt in a Bunsen burner to fix in position. Prepare up to 10 needles to ensure that there are spares if they are damaged during use.\nPlace the end of the wire into a blowtorch flame and hold it there until the tungsten glows white and the tip is sharp (around 2-3 min). Note: During use the needle can be cleaned and re-sharpened in the blowtorch as needed.\n\tNOTE: These needles can also be used to make loops for transferring beads. Gently touch the needle to the bench and it will bend to form a loop.\n4. Preparing Embryos for Bead Grafts\nIncubate eggs with the blunt end up until they reach the desired stage (3-5 days for most limb bud manipulations). Using blunt forceps tap on the blunt end to break the shell and then use the forceps to remove the shell and expose the embryo. Ensure the eggshell membrane is also removed.",
    "NOTE: 1-2 ml of PBS can be added with a Pasteur pipette to assist with this if the membrane sticks to the yolk. Gently pipette the PBS onto the surface of the yolk, grasp the membrane with the forceps, taking care not to damage the yolk, and gently pull it away from the egg.\nRemove up to 5 ml of albumen from the egg with a 10 ml syringe and a 19 G needle. Take only as much as needed to ensure the embryo does not make contact with the tape used to seal the egg as removal of larger volumes can reduce embryo survival rates.\nTo visualize the embryo add a 5-6 drops of artists india ink to 15 ml of PBS containing 100 U penicillin and 0.1 mg streptomycin/ml. Inject 0.5-1 ml directly under the embryo with a 1 ml syringe and a 25 G needle.\nAdd 2-3 ml of PBS with 1% fetal calf serum and 100 U penicillin and 0.1 mg streptomycin/ml into the egg to ensure the embryo does not dehydrate. Using sharpened watchmakers forceps remove the vitelline membrane and open the amnion over the developing limb buds. Ensure the embryo does not dry out and, if needed, add more PBS / FCS.\n\tNOTE: The limb buds can be clearly seen as paired outgrowths on the flank of the embryo. At these stages the embryo will turn such the right side is normally uppermost. As a result it is normally easier to graft beads into the right limbs and use the left ones as contralateral controls.\nUse a sharpened tungsten wire to make an incision into the limb bud where the bead will be implanted. Avoid cutting all the way through the limb bud where possible although at younger stages this is difficult.",
    "NOTE: In older embryos (HH stage 22 and above) it is possible to select specific regions of the limb bud for grafting but at younger stages this is more difficult as the limb bud itself is small. It is also important to remember that the limb bud will grow past the grafted bead so, especially at younger stages, the bead will remain in the proximal limb.\nPick up a bead from either the growth factor or drug using either extra fine watchmakers forceps or a loop made from a tungsten needle. If the bead has been soaked in either DMSO or phenol red, rinse in PBS before applying to the embryo. Transfer the bead to the embryo with the forceps / wire loop. Then use the sharpened tungsten wire to insert the bead into the incision.\nAdd 1-2 ml of PBS/FCS to the egg ensuring that the embryo is kept hydrated but avoid applying directly onto the embryo itself as this can damage the embryos and cause the bead to be dislodged. Seal the egg with tape and return to the incubator.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}