{
  "id": 11957,
  "origin_website": "Jove",
  "title": "A Murine Ommaya Xenograft Model to Study Direct-Targeted Therapy of Leptomeningeal Disease",
  "procedures": [
    "The protocol was approved by the University of South Florida Institutional Animal Care and Use Committee (IS00005974).\n1. Injection of CTCs into CSF to generate a mouse LMD model\nPreparation of CTCs\n\t\nCalculate the number of CTCs needed for injection, and prepare a single-cell suspension at 1.0 × 104 cells/µL in sterile phosphate-buffered saline (PBS). Place the cell suspension on ice or at 4 °C throughout the procedure.\n\t\t​NOTE: When using cell lines that require trypsinization, be sure to wash cells twice with sterile PBS to remove trypsin. Perform cell count using a hemocytometer or an automated cell counter. If a large cohort (>50 mice) is used, recount the cells and validate cell viability between injections to ensure a consistent number of cells are administered per mouse.\nPresurgical procedure\n\t\nInject the mouse subcutaneously with 1 mg/kg buprenorphine sustained-release (Bup-SR).\n\t\tNOTE: Do not inject the area of proposed incision; choose an injection site well away from the scapula.\nAnesthetize the mouse with 2-3% isoflurane until it shows no signs of the righting reflex. In addition, check for tail and/or paw pinch reflex to confirm the state of anesthesia.\nPrepare the mouse for surgery in a location remote from the operating area. Clip the surgical site (i.e., the dorsal surface of the skull) with enough border area to keep fur from contaminating the incision site; then, saturate the site with germicidal skin antiseptic, working from the center of the site to the periphery, and then allow to dry. Apply either sterile drape or a sterile adhesive-backed plastic drape material to protect the surgical site from contamination.\n\t\t​NOTE: Instruments are to be autoclaved in advance and tips re-sterilized between animals using a glass bead sterilizer.\nShave the fur of the entire ventral surface of the head, and prepare the skin using sterile technique.",
    "Situate the nose with a modified L-shaped nose cone of the stereotactic apparatus, ensuring the nares remain clear and open. Using tape across the ventral surfaces of both pinnae, gently pull the skin forward to secure it to the nose cone, and bend the neck at an approximately 90° angle once secured. Administer 1.5% isoflurane to maintain anesthesia.\n\t\t​NOTE: Proper positioning will result in the incision area being presented in a manner that allows for the easy identification of the caudal ridge of the occipital bone.\nPosition the body to ensure the spine is kept level with the cisterna magna, and while applying slight traction to the tail, place tape at the tail base to secure.\nSurgical cisterna magna injection\n\t\nWith the neck in full extension, and beginning just between the pinnae, run the surgical scissor tips downward with slight pressure across the occipital bone.\n\t\tNOTE: While in this midline position, a small depression is noticeable when the scissor tips dip into the concave area over the cisterna magna.\nMake a small 3-5 mm midline incision just above the palpated concavity. Draw 5 µL of cell suspension at 1.0 × 104 cells/µL (total 5.0 × 104 cells) into a 30 G Hamilton syringe.\nUse blunt-tipped forceps with 1-2 mm tips to gently press down on the cisterna magna. Introduce tips in a closed position and open them while applying downward pressure on the dura.\nRepeat blunt dissection described in the previous step until the dural membrane is easily identified, and the associated blood vessels are visible in the exposed area.\n\t\t​NOTE: The resulting injection window ensures blood vessels are undamaged during needle insertion.",
    "While holding the forceps open to retract surrounding musculature, introduce a 30 G non-coring needle under the dura to visualize the bevel. Ensure the needle is only introduced just beyond the bevel itself. Slowly deploy a syringe plunger, and deliver cells just below the dura.\nProperly place the bevel to observe the injection beneath the dura. Carefully administer the technique, and use the 30 G non-coring needle to prevent damage to the membrane and ensure minimal leakage. If leakage is noted, apply gentle pressure with a cotton-tipped applicator.\nClose the skin by applying a wound clip or micro-drop of skin adhesive. Once the injection is successfully performed, allow the mice to recover from anesthesia on a warm blanket, observing them continuously until they can maintain sternal position and demonstrate purposeful movement.\nMonitor the mice daily after the surgery for the first week. If a mouse appears to be in pain or distress, treat it with 10 mg/kg subcutaneous injection of carprofen once every 12 to 24 h for up to 5 days based on veterinary consultation and directive. Allow mice to recover and monitor them for at least 48 to 72 h before proceeding to the next step.\n\t\tNOTE: Bup-SR, given preemptively, will last up to 72 h, so additional analgesics are not normally necessary. However, animals will be provided additional analgesic as necessary (if lethargic, not eating, ruffled). If a surgical site develops signs of postoperative infection (i.e., redness, swelling, tenderness, allodynia, hyperalgesia, hyperpathia, or suppuration), or if the mouse is guarding the affected area, euthanize the mouse. If cancer cells are successfully injected into the CSF, LMD and tumor progression will develop in the CNS within 1 or 2 weeks (depending on the types of CTCs or cell line used) (Figure 1).\n2. Murine Ommaya assembly and implantation",
    "Preparation of station\n\t\nDisinfect the station surface. Place a blue covering over the surface, and keep ready all sterilized tools and supplies indicated in Figure 2.\nPresurgical procedure\n\t\nApply analgesia (Bup-SR), and maintain sterile technique as described in section 1.2.\nSurgical implantation of Murine Ommaya\n\t\nAssemble the Murine Ommaya injection device using a 25 G (0.51 mm outer diameter) miniature injection port and a 1 mm spacer disc. Use a cyanoacrylate sterile adhesive to ensure the penetration of approximately 2.5 mm of the metal cannula into the right cerebral hemisphere (Figure 3A-C).\n\t\tNOTE: An MRI-compatible Mouse Ommaya prototype was developed in this laboratory, which already has both parts (miniature injection port and spacer) 3D-printed together as a single unit (Figure 3D). The single unit version was tested by MRI and can save time by eliminating the assembly step.\nAnesthetize the mouse with 2-3% isoflurane until there are no signs of the righting reflex. Further, check for tail and/or paw pinch reflex to confirm the state of anesthesia.\nShave the entire ventral surface of the head of fur, and prepare the skin according to the sterile technique, as previously described in step 1.2.3. Place the mouse in the stereotactic apparatus with a nose cone to continue isoflurane administration during the procedure; decrease the isoflurane to 1.5%. Gently tighten the ear bars to secure the head, and apply eye lubricant to to cover the eyes of the mouse.\nMake a small skin incision (3 mm), followed by blunt dissection of the underlying subcutaneous tissues to expose the skull. Dry the skull using hydrogen peroxide-soaked cotton-tipped applicator sticks.",
    "Drill a burr hole in the skull 0.5 mm posterior and 1.1 mm lateral of the bregma-the anatomical point on the skull where the coronal suture is intersected perpendicularly by the sagittal suture (Figure 3A)-as well as a 0.9 mm burr hole to expose the dura mater. Move the microdrill aside, and gently score the bone immediately surrounding the burr hole prior to inserting an injection port (depth of approximately 2.5 mm), affixed to the skull using a cyanoacrylate sterile adhesive. State suture around the injection spot using 4-0 no-absorbance nylon sutures in an interrupted stitch pattern or purse string suture11.\nHouse post-surgery mice in individual cages for surgery recovery.\n\t\t​NOTE: It is possible that the Murine Ommaya may come off when multiple surgery-recovered mice are housed in the same cage, possibly due to constant tampering interactions. It is recommended that Murine Ommaya-implanted mice are housed individually (or no more than 2 mice per cage) over the course of the drug efficacy trial.\n3. Murine Ommaya treatment\nDosing mice using the Murine Ommaya\n\t\nAnesthetize the mouse with 2-3% isoflurane, until there are no signs of righting reflex. Further, check for tail and/or paw pinch reflex to confirm maintenance of anesthesia.\nAccess the Murine Ommaya using a port injection adapter and a Hamilton syringe. Using forceps, hold the top of the miniature injection port and gently insert the port injector adaptor fully into the port's septum.",
    "NOTE: The port injector pierces the septum of the port in a manner that reduces dead space to a minimum and allows for controlled injection via a motorized syringe pump (Figure 4A). Targeted/novel treatments are injected at a flow rate of 1 µL/min while under anesthesia. The treatment is to be given at specified intervals (daily/weekly) for a set duration (weeks/months), according to the researcher's discretion.\n\t\t​A volume between 3 and 7 µL is optimal, as a volume < 3 µL is unreliable, and a volume > 7 µL may cause too much pressure. The size of the Hamilton syringe can range from 10 to 100 µL, depending on the number of mice in each treatment arm. Preloading the appropriate volume into the Hamilton syringe will prevent repeated replacement of the syringe, thereby minimizing errors. It is best to dedicate 1 Hamilton syringe per treatment arm.\nOnce the injection is made, detach the Murine Ommaya from the port injection adaptor using forceps, and return the mouse to the cage to recover from anesthesia, as described above in step 1.3.7.\nEuthanasia\n\t\nEuthanize the mice by inhalation of carbon dioxide (CO2) from a compressed tank source. Expose the mice to increasing concentrations of CO2 (i.e., a displacement rate from 10% to 30% of the chamber volume/min is to be used) to avoid or minimize discomfort or distress. Monitor the mice until assurance of cessation of cardiovascular and respiratory movements."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}