{
  "id": 15090,
  "origin_website": "Jove",
  "title": "Discovering CsgD Regulatory Targets in Salmonella Biofilm Using Chromatin Immunoprecipitation and High-Throughput Sequencing (ChIP-seq)",
  "procedures": [
    "1. Flask culture cell growth\nFrom frozen stocks, streak Salmonella serovar Typhimurium strains on LB agar (20 mL solid media in 100 mm Petri plate) with the appropriate antibiotic and incubate at 37 °C for 16–20 h to obtain isolated colonies.\nInoculate 5 mL LB broth containing the appropriate antibiotic in a 25 mm x 150 mm borosilicate culture tube with 1–3 colonies from streak plates from step 1.1. Incubate at 37 °C with shaking at 200 rpm for 7 h.\nMeasure OD600 of broth culture using a spectrophotometer. Dilute an aliquot of culture 1 in 4 in PBS in a 2 mL cuvette and measure the absorbance at 600 nm. We have found the most critical factor at this step to be the time of growth. The OD values are used to normalize the cultures to deliver the desired number of cells in step 1.4.\nAdd 1.0 OD600 volume equivalent of cell culture (i.e. ~109 cells) to an Erlenmeyer flask containing 100 mL of 1% tryptone with the appropriate antibiotic. Incubate at 28 °C with shaking at 200 rpm for 13 h.\n\tNote: Biofilm cells will appear as aggregated flakes and single planktonic cells are in the cloudy media.\n2. Collecting cell-free conditioned 1% tryptone\nCollect flask culture for cell-free conditioned 1% tryptone. Pipette flask culture several times to mix before adding to a centrifuge tube.\nCentrifuge at 12,000 x g for 10 min at 10 °C to pellet all cells.\nDecant supernatant into a 0.2 µm filter unit, vacuum filter, and dispense into a new tube.",
    "Note: Biofilm aggregates are adherent in conventional solutions (e.g. PBS) and will stick to the sides of tubes and pipette tips. Since it allows for easier manipulation, we use conditioned media (1% tryptone) to move biofilm initially and use warm PBS immediately before cross-linking (step 4.5) to remove any protein crosslinking substrates that could be present in the media.\n3. Separating biofilm and planktonic cells from flask cultures2\nUsing a sterile 25 mL pipette, aliquot flask culture into 15 mL tubes. Centrifuge at slow speed (210 x g) for 2 min, to separate the two cell types.\n\tNote: Biofilm cells should form a loose pellet at the bottom of the tube\nPipette the supernatant containing planktonic cells into two 40 mL centrifuge tubes for later (step 5). Remove all the remaining liquid, being careful not to disturb the pellet. Repeat until the cell types have been separated from all of the flask culture media.\n4. Preparing biofilm aggregates\nNote: Biofilm is harvested by wet weight to yield 25 µg of DNA, the recommended minimum starting material for ChIP. The Biofilm Conversion Factor (BCF) of S. Typhimurium is 1.73 x 108 CFU/mg2. Researchers preparing other biofilm types will need to empirically define the number of cells per unit weight of biofilm, which is used to find the weight of biofilm required for 25 µg of DNA starting material using this equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60736/60736eq1.jpg\nWeigh a 2 mL snap cap or screw cap tube accurately.\nResuspend the biofilm pellet in 1 mL of conditioned tryptone. Move the resuspended biofilm into a pre-weighed 2 mL snap cap or screw cap tube.\nCentrifuge for 1 min at 11 000 x g at 20 °C",
    "Carefully remove all supernatant from the tube and weigh the tube accurately. Subtract the tube weight from the weight of the tube with biofilm to find the weight of biofilm. It should be ±10% of the target biofilm weight.\nWash cells to remove remaining conditioned tryptone. Add 1 mL of warm PBS to the tube and vortex gently to resuspend the pellet. Centrifuge for 3 min at 8 000 x g to pellet biofilm and remove the supernatant. Add 1 mL of PBS to the tube and vortex to resuspend the pellet.\n5. Preparing planktonic cells\nRecord the volume and the OD600 of the planktonic supernatant from slow speed centrifugation (step 3.2) using a spectrophotometer\nCalculate the required volume for a final OD600 of 6.0:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60736/60736eq2.jpg\nCool the centrifuge to 10 °C and sediment planktonic cells by centrifugation (10,000 x g, 10 min at 10 °C)\nRemove the supernatant and resuspend the cell pellet in the final volume of PBS calculated in step 5.2.\nRe-measure OD600 of the planktonic cells using a spectrophotometer and dispense the volume of 6.0 OD600 planktonic cells into a 2 mL snap cap or screw cap tube.\nBring volume to 1 mL with PBS.\n6. Homogenizing cells\nAdd one sterilized 5 mm stainless steel bead to each of the tubes.\nHomogenize using a mixer mill for 5 min at 30 Hz. Observe aggregate tubes to confirm that biofilm has been broken apart.\nTransfer the homogenized cells to a new 1.5 mL tube, avoiding the metal bead. Bring the volume to 1 mL with PBS.\n\tNote: Perform serial dilutions to enumerate input cells and check that the final cell number is close to the desired or predicted number.\n7. Cross-linking of proteins to DNA",
    "Dispense fresh formaldehyde into sample tubes to a final concentration of 1%. Incubate for 30 min at room temperature on a rotating wheel.\n\tCaution: Formaldehyde is corrosive, a skin, eye, and respiratory irritant, and flammable. Dispense in a fume hood.\nAdd 1 M glycine to a final concentration of 125 mM to stop crosslinking. Incubate for 5 min at room temperature on a rotating wheel.\n8. Washing cells to remove excess crosslinker\nSediment the cells at 8,000 x g for 3 min and remove the supernatant\nResuspend the pellet in 20 µL of 25x protease inhibitors and 500 µL of filter sterilized PBS.\nCentrifuge tube for 3 min at 8000 x g and remove the supernatant.\n9. Lysing cells\nResuspend the pellet in 600 µL Lysis buffer (refer to Table 1) and incubate on ice for 10 min.\nAdd 1.4 mL of IP dilution buffer (refer to Table 1) to a sterile 15 mL tube and move lysed cells to the 15 mL tube. Keep the tube on ice for 1.5–2 h, and vortex gently and occasionally.\n\tNote: Some resistant cell material may remain in tubes. A long incubation period on ice with occasional vortexing will break apart material. The remainder will be broken up through sonication.\n10. Fragmenting DNA by sonication\nPlace the 15 mL tube in a beaker of ice and place the 3 mm probe inside the tube.\nPerform 5 sonication rounds of 30 s on at 20–40% of 400 W with 2 min cooling on ice between bursts.\nSediment precipitated material by centrifugation (8000 x g, 10 min at 4 °C). Transfer the supernatant to a new tube.",
    "Optionally, perform decrosslinking at 65 °C for 30–60 min and digest RNA and protein at 45 °C for 30-60 min before running on a 2% agarose gel to check for proper size fragments.\n\tNote: Immerse the probe into the cell lysate. Keep the solution on ice while sonicating and resting. Do not remove the tube while the sonicator probe is pulsing. The solution should appear cloudy pre-sonication and clear post-sonication.\n11. Immunoprecipitating DNA-protein-antibody complexes\nPreparation\n\t\nDispense one 1.35 mL aliquot for immunoprecipitation and one 200 µL aliquot as an input control. Store the input control at -80 °C until decrosslinking and digesting steps are performed.\nImmunoprecipitation with primary antibody\n\t\nAdd 10 µg of purified protein-specific primary antibody to the 1.35 µL aliquot. Incubate overnight at 4 °C on a rotating wheel.\n\t\tNote: The primary antibody can be a monoclonal antibody, high-quality polyclonal serum or commercial epitope antibody (i.e., anti-FLAG).\nAdd 50 µL of Protein G magnetic beads to the tubes from step 11.2.1 and incubate at 4 °C for 3 h on a rotating wheel.\nPlace IP wash buffer 1, IP wash buffer 2, and TE pH 8.0 (refer to Table 1) in an ice bucket. Warm elution buffer to 65 °C.\n\t\tNote: Do not put solution containing elution buffer on ice.\nBind the Protein G magnetic beads to the side of tubes using a magnetic stand\nPerform washes: wash 2x with 750 µL cold IP wash buffer 1, wash 1x with 750 µL cold IP wash buffer 2, and wash 2x with 750 µL cold TE at pH 8.0. Keep the tubes on the magnetic stand during washes.\nAdd 450 µL of IP Elution buffer (refer to Table 1) to each tube and incubate at 65 °C for 30 min with gentle vortexing every 5 min.",
    "Bind beads to the side of tubes using a magnetic stand. Wait at least 2 min until the solution is clear.\nDispense the cleared supernatant to a new 1.5 mL tube, being careful to not disturb the magnetic bead pellet.\n12. Decrosslinking DNA-protein complexes and digesting co-purifying RNA and protein\nAdd 2 µg RNase A and NaCl to a final concentration of 0.3 M to each tube.\nIncubate at 65 °C, for ≥6 h, or overnight.\nComplete protein digestion by adding 180 µg Proteinase K to each tube, then incubating at 45 °C for 3–5 h.\n13. Library preparation and sequencing\nPurify DNA using magnetic beads\n\tNote: Magnetic beads are preferred for isolating the small amounts of DNA usually recovered during ChIP with bacterial cells.\nPrepare libraries using a kit that is compatible with the selected sequencing platform.\nCheck library concentration with a fluorometer and a broad range dsDNA kit or a qRT-PCR library quantification kit.\n\tNote: In our experience, fluorometer measurements may overestimate DNA concentration.\nPool libraries, accounting for adequate coverage for each library sample. For Illumina sequencing with Salmonella, we pooled 10–12 libraries. Add Tris-HCl pH 8.0 to a final concentration of 1 mM.\nSequence according to the selected platform's specifications."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}