{
  "id": 12263,
  "origin_website": "Jove",
  "title": "Modified Terminal Restriction Fragment Analysis for Quantifying Telomere Length Using In-gel Hybridization",
  "procedures": [
    "1. Genomic DNA Extraction\nPerform a genomic DNA extraction from the cells (here, cell line BJ-hTERT) to be analyzed using a commercial DNA extraction kit, according to the manufacturer's instructions.\nMeasure the DNA concentration with a spectrophotometer. If the DNA concentration is less than 100 µg/mL, precipitate the DNA with ethanol and resuspend in a volume of TE buffer (10 mM Tris-Cl; 0.1 mM EDTA (Ethylenediaminetetraacetic Acid); pH 8.0), to ensure a DNA concentration of 100-600 µg/mL).\n2. DNA Integrity Assessment\nNOTE: This portion of the protocol outlines a DNA integrity assessment using a gel electrophoresis system with a 11 cm x 14 cm gel. Other systems and gel sizes can also be used, but the voltage and DNA migration time may vary.\nPrepare a 1% agarose gel by combining 1 g of electrophoresis grade agarose in 100 mL of 1x TAE buffer (40 mM Tris-base; 20 mM acetic acid; 2 mM EDTA; pH 8.5) and microwave until the agarose is dissolved and the solution is clear. Cool the solution at room temperature until it reaches 50 °C (approximately 15 - 20 min).\nWhile agarose solution is cooling, prepare gel casting tray by adding casting end gates to the casting tray. To prevent agarose leakage, cool the end gates to 4 °C prior to attaching to the casting tray.\nOnce the agarose solution has cooled to 50 °C, add 10 µL of ethidium bromide (10 mg/mL in dH2O) and pour the agarose solution into the gel casting tray. Add the comb to the casting tray.\nAllow the agarose solution to harden for 45 min at room temperature.",
    "Prepare DNA samples for electrophoresis by diluting 25 ng of genomic DNA using 1x TE buffer to a final volume of 9 µL and add 1 µL of 10x Loading Dye (0.25% (w/v) bromophenol blue, 0.25% (w/v) xylene cyanol FF, 30% (v/v) glycerol). Mix well.\nPrepare the gel electrophoresis system for DNA migration by filling the electrophoresis system with 1x TAE buffer so that the buffer level is several millimeters above the gel. Load the wells of the gel with the entirety of the DNA samples. Add 5 µL of a DNA ladder to a single well.\nRun the DNA migration at 100 V for approximately 2 h or until the bromophenol blue dye is approximately half way through the gel.\nImage the gel using an ultraviolet light transilluminator or equivalent.\n\tNOTE: DNA samples with good integrity have high molecular weight bands with no smearing (that is due to sheared or broken DNA). If the DNA bands are smeared, they have low integrity and are not suitable for the Southern blot analysis, and the DNA must be re-isolated with fresh cells.\n3. Genomic DNA Digestion\nPerform the digestion of the genomic DNA in a final volume of 20-40 µL.\n\tNOTE: Volumes greater than 40 µL will overflow the wells of the agarose gel.\n\t\nCombine 3 µg of genomic DNA and the appropriate amount of 10x DNA digest buffer (supplied with the restriction enzymes) so that the final concentration is 1x, in a microtube. Add 1 µL of RsaI restriction enzyme (10,000 U/mL) and 1 µL of HinfI restriction enzyme (10,000 U/mL) to each tube. Adjust the final volume using sterile, deionized H2O. Mix well. Centrifuge briefly (10 - 15 s at 16,000 x g) to ensure that all components are in the bottom of the tube.",
    "Incubate the digestions at 37 °C for ≥16 h. After the digestion, store the digested DNA at 4 °C or -20 °C for no longer than 2 days if needed17.\n4. Genomic DNA Gel Electrophoresis\nNOTE: This portion of the protocol outlines a procedure for using a 20 cm x 25 cm gel electrophoresis system. Different gel electrophoresis systems can be used, but several variables may need to be modified including voltage, time of migration and amount of electrophoresis buffer added to the system in order to yield optimal results.\nPrepare 0.6% agarose solution by combining 2.25 g of gel electrophoresis grade agarose with 375 mL of electrophoresis buffer, either 1x TAE or 0.5x TBE (110 mM Tris base; 90 mM boric acid; 2.5 mM EDTA; pH 8.3).\n\tNOTE: For telomeres less than 8,000 kB, 0.5x TBE is recommended whereas 1x TAE is recommended for telomeres between 8,000 kB and 20,000 kB1.\nMicrowave the solution until the agarose has dissolved and the solution is clear. Allow the solution to cool for 15 - 20 min at room temperature or until the agarose reaches 50 °C.\nWhile the agarose solution is cooling, prepare the gel electrophoresis system for gel casting as described in step 2.2. Pour the agarose gel solution into a gel casting tray. Place a comb into the gel. Allow the gel to harden for 45 min uncovered at room temperature.\nPrepare the digested DNA samples for electrophoresis. For a 40 uL reaction, add 0.4 µL of 10x loading dye into each sample of digested DNA. Briefly centrifuge (10-15 s, 16,000 x g) to ensure that all of the solution is at the bottom of the tube.",
    "Prepare the gel electrophoresis system for DNA migration. Remove the end gates and comb from the gel. Fill the gel electrophoresis system with 1x TAE or 0.5x TBE to the fill line, ensuring that the gel is completely submerged in the buffer.\nLoad the wells of the gel with the DNA samples such that there is a blank well between samples. Avoid causing bubbles or puncturing the gel. Add 10 µL of a DNA ladder into wells on the opposite ends of the gel.\n\tNOTE: The type of DNA ladder will depend on the length of the telomeres, which will vary from person to person and between cell sources.\nRun the gel electrophoresis at 150 V for 30 min to quickly move the DNA into the gel; then adjust the voltage to 57 V and run for 18-24 h.\n5. Gel Fluorescent Imaging and Hybridization\nAfter 18-24 h, turn off the gel electrophoresis power source. Remove the gel casting tray with the gel from the electrophoresis buffer. Slice off the top right corner of the gel to serve as a reference for the orientation of the gel.\nPrepare a piece of filter paper by cutting the paper to be a slightly larger size than the gel. Place the filter paper on top of the gel in the casting tray and allow the paper to soak up excess solution on the gel. Carefully remove the air bubbles between the filter paper and the gel using a pipette as a roller to squeeze the bubbles out through the sides.",
    "Remove the gel from the casting tray by flipping the gel and filter paper over so that the paper is underneath the gel. Transfer the gel with the filter paper to a gel dryer and cover the gel with plastic wrap. Remove all air bubbles between the plastic wrap and gel using a pipette as a roller.\nDry the gel for 2 h at 50 °C.\nOnce dried, remove the plastic wrap and transfer the gel and filter paper to a glass dish containing 250 mL of deionized water (sufficient to cover the gel). Carefully remove the filter paper and incubate the gel at room temperature for 15 min. The gel will be thin, firm and easy to manipulate without tearing.\nPrepare 5x SSC solution (750 mM NaCl; 75 mM sodium citrate) in deionized water.\nLay the gel on top of a nylon mesh (12 in x 12 in). Roll the nylon mesh and gel together making sure that the gel is not in contact with itself. Place the mesh and gel into a hybridization tube (e.g., 12 in tube with 1.5 in diameter).\n\tNOTE: When properly rolled up, the gel will be in contact with the nylon mesh on both sides.\nCombine 100 mL of 5x SSC and 12 µL of green fluorescent nucleic acid stain, and place into the hybridization tube. Protect the solution from light and incubate for 30 min at 42 °C in a hybridization oven with rotation.",
    "Remove the nylon mesh/gel from the hybridization tube, roll open and place flat into a glass dish containing 250 mL of deionized water, and gently remove nylon mesh. Image the gel using a phosphorimager. Use the fluorescent settings: 520 BP, 40 Blue and 488 nm. Set the photomultiplier tube (PMT) to 375, the focal plane to +3 mm and the sensitivity to normal. Save the image to a file.\n6. Hybridization\nPrepare the radioactive telomere probe.\nCombine 2 µL (2 ng) of telomere probe (5- (CCC TAA)4 3'), 2.5 µL of 10x polynucleotide kinase reaction buffer, 3 µL of γ32P-dATP (6,000 Ci/mmol), 4 µL of T4 polynucleotide kinase and DNase free, sterile deionized water to a final volume of 20 µL in a microcentrifuge tube.\n\t\tCaution: Follow facilities' radioactive safety and regulations when using radioactivity.\nBriefly centrifuge (10-30 s at 16,000 x g) and incubate in water bath at 37 °C for 1 h. Centrifuge for 10-30 s at 16,000 x g and incubate at 65 °C for 20 min to stop the reaction.\nUsing a G-25 chromatography microspin column, mix the contents of the column by vortexing, then centrifuge for 1 min at 700 x g at room temperature. Discard the filtrate.\nLoad the radioactive probe solution into the G-25 chromatography column and centrifuge for 2 min at 700 x g. Save the filtrate.\n\tNOTE: Retain the filtrate as this contains the radioactive telomere probe. The radioactive probe can be stored at 4 °C if needed.\nPrepare 250 mL of denaturing solution composed of 1.5 M NaCl and 0.5 M NaOH in sterile deionized water.",
    "Place the gel into a glass dish containing 250 mL of denaturing solution and incubate for 15 min at room temperature. Remove the denaturing solution and replace with 250 mL of sterile deionized water. Incubate for 10 min on an orbital shaker (40 - 50 rpm) at room temperature.\nPrepare 250 mL of neutralization solution composed of 1.5 NaCl and 0.5 M Tris-hydrochloric acid, pH 8.0 in sterile deionized water.\nRemove the deionized water and replace with 250 mL neutralization solution and incubate for 15 min at room temperature.\nDuring the incubation in the neutralization solution, prepare 50 mL hybridization solution composed of 5x SSC, 5x Denhardt's solution (0.1% non-ionic synthetic polymer; 0.1% polyvinyl pyrrolidine; 0.1% bovine serum albumin), 10 mM disodium phosphate (Na2HPO4) and 1 mM sodium pyrophosphate tetrabasic decahydrate (Na4P2O7 . 10 H2O) in sterile deionized water.\nRoll the gel into nylon mesh and place into the hybridization tube (step 5.7). Add 20 mL of the hybridization solution and incubate in a hybridization oven at 42 °C for 10 min with rotation.\nRemove the hybridization solution and replace with 20 mL of fresh hybridization solution. Add the entirety of the telomere probe and incubate in a hybridization oven at 42 °C overnight with rotation.\n7. Gel Washing, Phosphor Screen Exposure, and Radio Imaging\nPrepare 500 mL of 2x SSC solution (300 mM NaCl; 30 mM sodium citrate) in sterile deionized water.\nPrepare 250 mL of 0.1x SSC (15 mM NaCl; 1.5 mM sodium citrate) and 0.1% Sodium Dodecyl Sulfate (SDS) in deionized water.",
    "Remove the gel and mesh from the hybridization tube and place into a glass dish containing 250 mL of 2x SSC. Unroll and remove the nylon mesh from the dish. Place the glass dish onto an orbital shaker and incubate for 15 min at room temperature.\nRemove the 2x SSC and replace with 250 mL of 0.1x SSC and 0.1% SDS solution, and incubate for 15 min on an orbital shaker at room temperature.\nDuring the incubation, expose the Phosphor screen to the image eraser for 15 min.\nRemove the 0.1x SSC and 0.1% SDS solution and replace with 250 mL of 2x SSC. Incubate for 15 min on an orbital shaker.\nRemove the gel from 2x SSC solution and either wrap the gel in plastic wrap or place into a heat sealable pouch. Remove all bubbles and air pockets between the gel and the plastic wrap or plastic pouch. Place the gel into an exposure cassette with the Phopshor screen. Expose the Phosphor screen to the gel overnight.\nImage the exposed Phosphor screen using a phosphorimager.\n8. Telomere Length Quantification\nOpen the phosphorimager file containing the fluorescent image of the green fluorescent nucleic acid-stained gel (Figure 1).\nSelect 'Tools' and then 'Pixel Distance'. Using the mouse, draw a line from the bottom of the gel well to the middle of the first marker band and record the distance. Repeat this procedure for each marker band (Figure 2). These distances will be used in the graphing program as described below.",
    "Open the phosphorimage of the radiolabeled gel (Figure 3). Select 'Object Manager' and then 'Grid'. Set the Grid to 1 column and 150 rows. Adjust the grid so that it stretches from the top of the gel to the bottom of the gel. Adjust the width of the grid to equal the width of the lane, clicking on the edge of the grid and dragging the width of the grid to equal the width of the lane.\nCopy this grid (so that the width and height of the boxes remain the same) and move the second grid to an empty lane (for background purposes). Continue to copy and move additional grids for additional sample lanes.\n\tNOTE: When finished, there should be grids for each sample lane and one grid of an empty lane for background (Figure 4).\nSelect 'Analysis\" and then 'Volume Report'. Select all of the grids for the report. Once the volume report is displayed, double click on the report to activate the spreadsheet program. Save the spreadsheet file. The data for this file will be under the 'Volume' lane.\nOpen an appropriate graphing program and create a new data and table. Select 'Y: Enter and plot a single Y value for each point' then select 'Create'.\nLabel the first column (Column X) as 'Measured Distance' and label the second column (Column Y) as 'Molecular Weight'. Enter the marker molecular weights of each marker band in column Y. Enter the migration distances obtained in step 8.2 corresponding to each molecular weight marker.",
    "Go to 'Analysis' and select 'Analyze' and then 'nonlinear regression (curve fit)' and select 'OK'. At the next screen, select 'Exponential and then 'One phase decay'. Select 'Range' tab and enter '150' in 'number of points that define the curve' and check 'Create a table of XY coordinates to export or copy the curve to another program'.\n\tNOTE: The result, 'nonlinear fit of Data 1', contains the molecular weight for each distance in the Y row.\nFor analysis of the sample lanes, select an area of analysis that is above and below the actual telomere bands. Do not use the entire length of the lane (Figure 5). Determine the grid locations for the area of analysis of each lane.\nSelect 'File', 'New' 'Create new Table and Graph'. Select 'Y: Enter and plot a single Y value for each point' then select 'Create'. Copy and paste the background lane volume values (intensity values) from the spreadsheet file into the first column (X) and the volume values (intensity values) from the sample lane into the first column Y. If there are multiple sample lanes, copy each set of volume values from the spreadsheet file into additional Y columns in the graphing program file.\nDelete the values from the background column (X) and each sample lane (Y) that are outside the areas of analysis determined in step 8.8.\n\tNOTE: The data table should only contain values in those grid locations corresponding to the areas of analysis.\nSelect Analysis, then 'Analyze' and 'transform'. Click 'OK'. Select 'Transform Y values using Y=Y-X'. This will transform the data in Data 2 (transformed intensity value (Y) = sample intensity (Y) - background intensity (X)).",
    "Select Analysis then 'Analyze', 'Column Analysis' and 'Column statistics'. Select OK. The results tab 'Col. Stats of Transform of Data 2' shows under the 'Sum' row, ∑(Inti).\nSelect 'File', 'New', 'Create New Table and Graph'. Select 'Y: Enter and plot a single Y value for each point' then select 'Create'. Copy and paste the Y column data from the results page 'Nonlin fit of Data 1, Curve' into the new X column. Copy and paste the Y column data from the results page 'Transform of Data 2' into the new Y column. Select Analysis then 'Analyze' and 'Transform'. Click 'OK'. Select 'Transform Y values using Y=Y/X'.\nSelect Analysis then 'Analyze', 'Column Analysis' and 'Column statistics'. Select OK. The results tab 'Col. Stats of Transform of Data 3' shows under the 'Sum' row, ∑(Inti/MWi). MW=molecular weight.\nTo calculate the average telomere length (TL) for each sample, use the formula TL=∑(Inti)/ ∑(Inti/MWi).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}