{
  "id": 11960,
  "origin_website": "Jove",
  "title": "Enhanced Viability for Ex vivo 3D Hydrogel Cultures of Patient-Derived Xenografts in a Perfused Microfluidic Platform",
  "procedures": [
    "Tumor tissue was obtained with patient consent and according to an approved Institutional Review Board (IRB) protocol. Xenografts were implanted, grown, and harvested according to an accepted Institutional Animal Care and Use Committee (IACUC) protocol.\nNOTE: All work is to be performed in a sterile biological safety cabinet to maintain sterility. All steps should be conducted at room temperature unless otherwise specified.\n1. Preparation of materials for PDX processing\nAutoclave forceps and scalpel handle or razor blades.\nThaw dissociation enzyme solution at 4 °C overnight or at room temperature the same day as tissue dissociation.\n\tNOTE: Thawing at 37 °C is not advised, as this can inactivate some dissociation enzymes.\nPrepare at least 100 mL of PDX culture medium (Dulbecco’s modified Eagle medium-nutrient mixture F-12 [DMEM-F12] with 100 U/mL penicillin and streptomycin and 30% fetal bovine serum [FBS]), and at least 25 mL of PDX processing medium (DMEM-F12 with 100 U/mL penicillin and streptomycin and no FBS). Store at 4 °C until ready to use.\n2. PDX dissociation and initial purification of stromal component\nGather autoclaved utensils, 70 µm cell strainers (2−3), 60 mm round tissue culture dishes (2), 6-well tissue culture plates, sterile 50 mL conical centrifuge tubes, and sterile 1x phosphate-buffered saline (PBS). Warm culture medium to 37 °C and allow dissociation enzyme solution to come to room temperature.\nWhen PDX tissue has reached a diameter of 1.0−1.5 cm in a mouse host, surgically remove the tumor from the mouse by standard means (e.g., under accepted anesthesia) and store on ice in a 50 mL tube with PDX culture medium (Figure 2A). Process the tissue promptly, via the steps below, to maximize cell viability, preferably within 1−2 h after harvest.",
    "Transfer tumor tissue to a pre-weighed sterile 50 mL conical tube. Rinse 6x with 30 mL of sterile PBS to remove blood and contaminants. Remove as much liquid as possible and weigh the tumor tissue.\nTransfer tumor tissue to a 60 mm round tissue culture dish and mince into ~1 mm3 pieces using a sterile razor blade or scalpel.\nAdd 5 mL of PDX processing medium to collect tumor slurry and transfer to a new sterile 50 mL tube. Rinse the culture dish with another 5 mL of PDX processing medium, then with dissociation enzyme solution (10 mL/g tumor, at least 5 mL), adding all rinses to the 50 mL tube.\nIncubate 20 min at 37 °C with gentle shaking. Swirl the tube gently halfway through the incubation time.\nPipette up and down gently with a serological pipette to break up clumps. Filter cells with a 70 µm cell strainer placed over a new sterile 50 mL tube.\n\tNOTE: More than one strainer may be necessary.\nCentrifuge at 200 x g for 5 min to pellet cells. Remove supernatant and resuspend in 2−3 mL of PDX culture medium. Count cells using a hemocytometer or automated cell counter.\nUse Table 1 to estimate the required number of dissociated PDX-derived cells needed to achieve the desired cell density per chip.\n\tNOTE: The values in Table 1 are intended to be a starting point. Actual values will vary due to tissue viability/cellularity and cell loss from freezing/recovery. PDX tumors are individuals even within a given cancer type so these values should be adjusted empirically.",
    "Of the number calculated in step 2.9, plate 1−2 x 106 cells in 5 mL of PDX culture medium per well of a 6-well tissue culture plate. Incubate (37 °C, 5% CO2, 95% humidity) for 48 h with gentle shaking (50−55 rpm) to promote cluster formation (Figure 2B). After cluster have formed, proceed to section 3 for centrifugation.\nCryopreserve unused PDX cells from the initial dissociation in 50% FBS + 40% DMEM-F12 + 10% dimethyl sulfoxide (DMSO) or a commercially available primary cell freezing medium.\n\tNOTE: Adherent mouse stromal cells may also be recovered from the tissue plate surface, if desired, by rinsing briefly with culture medium and expanding by standard means.\nFor later use of cryopreserved PDX tumor cells/mouse stroma, thaw cells in a 37 °C water bath for 2 min. Count and plate in a 6-well tissue culture plate as described in step 2.10 before proceeding to section 3. Increase the number of PDX cells by ~20% to accommodate viability losses from cryopreservation.\n3. Density gradient centrifugation-based separation of PDX-derived clusters from single cells\nPrepare 20 mL of 100% density gradient solution by thoroughly mixing 18 mL of density gradient centrifugation solution with 2 mL of sterile 10x Hanks’ balanced salt solution (HBSS) in a sterile 50 mL conical tube. Make 10 mL each of 20%, 30%, 40%, and 55% density gradient solutions by diluting this 100% solution with sterile 1x HBSS and mixing well.\n\tNOTE: These volumes are sufficient for two 15 mL gradients which can be used to separate ~15 x 106 cells each. If separating fewer than ~15 x 106 cells, the second gradient should be used as a balance for centrifugation.",
    "Add 3 mL of 55% density gradient solution to the bottom of a 15 mL conical tube. Holding the tube at an angle, very gently layer 3 mL of 40% density gradient solution on top of the 55% layer, slowly dispensing the liquid onto the angled side of the tube to avoid mixing the layers. Repeat with the 30% density gradient solution.\nCollect the supernatant of PDX rotation cultures with a 5 mL serological pipette, rinsing plate surface gently. Centrifuge at 200 x g for 2 min to pellet cells.\nRemove supernatant and resuspend the cell pellet in 3 mL of 20% density gradient solution according to number of gradients needed to separate the cells. Carefully layer 20% density gradient solution with cells onto the top of the gradient(s). If only using one gradient tube for cells, top the balance gradient tube with cell-free 20% density gradient solution.\nCap the tubes and centrifuge in a swing bucket rotor centrifuge for 30 min at 4 °C, 2,000 x g, and 0 brake.\nAfter centrifugation, fractions will be visible (Figure 2C). Collect 2−3 mL of fractions into fresh 15 mL tubes. Add 3−4 volumes of sterile 1x HBSS to each fraction and invert to mix thoroughly.\nCentrifuge at 1,000 x g for 3 min to pellet cells. Remove supernatant and resuspend the cell pellet in 1−2 mL of PDX processing medium.\n\tNOTE: Viable PDX cell clusters are typically found at the 40−55% density gradient solution interface (Figure 2D) with single dead/dying cells accumulating at the 20−40% density gradient solution interface for most PDXs tested.\nRemove a small, representative aliquot (50−100 µL) for re-dissociation with an equal volume of dissociation enzyme solution to assess cell number in the clustered cell suspension. Count cells with a hemocytometer or automated cell counter.",
    "4. Hydrogel preparation and microfluidic plate seeding\nReconstitute HA hydrogel solutions (thiol-modified HA, HA-SH; thiol-reactive polyethylene glycol diacrylate, PEGDA) according to the manufacturer’s instructions.\nUsing a multichannel pipette, add 50 μL of HBSS to all wells in observation window columns (column 3, 7, 11, 15, 19, 23) of a 2-lane microfluidic plate to maintain culture humidity and optimal imaging conditions.\nCalculate the volume of cell suspension from section 3 needed for 50 μL of hydrogel at the desired cell density (i.e., 5,000 cells/μL). For seeding one microfluidic plate, aliquot the calculated volume into each of 4 sterile 1.5 mL centrifuge tubes.\n\tNOTE: HA hydrogels have a fixed time to gelation. Adjust the volume of gel solution aliquots for user efficiency at dispensing if premature gelation occurs.\nAdjust the pH of the HA-SH solution to 8.0 with 1 N NaOH immediately prior to use. Perform a test gelation by mixing 40 μL of HA-SH with 10 μL of PEGDA and monitoring gelation over time. Gelation typically begins 5−8 min after mixing HA-SH with the PEGDA crosslinker.\nCentrifuge cell suspension aliquots for 2 min (200 x g, room temperature) to pellet cells. Carefully remove the supernatant and resuspend cells in the appropriate volume of HA-SH.\n\tNOTE: Final hydrogel is a 4:1 HA-SH:PEGDA solution (by volume) so cells should be resuspended in 40 μL of HA-SH for a 50 μL final volume.\nAdd 10 μL of PEGDA to one aliquot of cells in HA. Mix well and wait 1−3 min (depending on gelation time from step 4.4) before seeding the microfluidic plate.\n\tNOTE: Allowing the gelation reaction of start before seeding helps to minimize cell settling.",
    "Affix a tip for dispensing 1.5 μL volumes to a single channel repeating pipette and load with cells in HA hydrogel solution. Remember to keep the hydrogel aliquot well-mixed to ensure even cell distribution.\nTo seed the microfluidic plate, align pipette tip perpendicular to the plate while gently placing the tip in the center of the gel inlet (columns 1, 5, 9, 13, 17, 21) to ensure contact but no pressure when dispensing the hydrogel solution. Working quickly to prevent premature hydrogel solidification, dispense 1.5 μL of gel solution into each gel inlet.\nObserve the fill status of the microfluidic channels by viewing from the top of the plate, bottom of the plate, or by microscope, and assess loading, using Figure 3 as a guide (successful loading in Figure 3A, pipet positioning guidance in Figure 3B, missed loading in Figure 3C, not filled to end in Figure 3D, overflow in Figure 3E). Identify any necessary adjustments in technique that may improve filling success for the next round of chips (see discussion for troubleshooting tips).\nRepeat steps 4.6−4.9 with the remaining 3 aliquots of cells in HA solution. Invert the plate while preparing the next aliquot (~1 min).\n\tNOTE: The 1 min wait time and inversion of the plate improve the 3D distribution of the cells by reducing cell settling as gelation occurs.\nAfter all chips are filled, incubate the plate at 37 °C in a humidified incubator until gelation is complete (~45 min).\nUsing the manual provided, ensure the perfusion rocker is installed in the cell culture incubator with the correct perfusion settings (14° angle, 4 min intervals).",
    "Add 50 μL of PDX culture medium to all medium inlets (columns 2, 6, 10, 14, 18, 22) and check if the channels filled properly by flipping the plate. Gently tap the plate against a surface to encourage the liquid to fill the microfluidic channels.\nAdd 50 μL of DMEM-F12 (10% FBS) for all medium outlets (column 4, 8, 12, 16, 20, 24). If any air bubbles are trapped in the perfusion channel, remove by gently tapping the plate against a surface.\nUsing a microscope and plate layout form (Supplemental Figure 1), record chip filling success. Exclude improperly filled chips from further experimental use.\nPlace plate on a tilting rocker set to a 14° tilt and a 4 min cycle to begin perfusion. Replace PDX culture medium every 2 days (first 50 μL in inlet, then 50 μL in outlet).\n5. Cell staining, imaging, and image quantification\nPrepare a cell viability assay solution containing three fluorescent dyes (Hoechst 33342, ethidium homodimer-1, calcein acetoxymethyl [AM]).\n\t\nPrepare stock solutions of each dye as follows: Hoechst 33342 at 1.6 mM (1 mg/mL) in deionized water; calcein AM at 4 mM in anhydrous DMSO; ethidium homodimer-1 at 2 mM in DMSO/H2O (1:4, v/v).\n\t\tNOTE: The stock calcein AM and ethidium homodimer-1 solutions are provided in the noted kit in Table of Materials.\nPrepare a single working solution in HBSS or phenol red-free medium, containing all three dyes. Optimize final working concentration for each cell type and matrix, within the ranges of 1.6−8.0 µM for Hoechst 33342, 0.1−10 µM for calcein AM, and 0.1−10 µM for ethidium homodimer-1.\nRemove culture medium and apply the working viability dye solution to desired microfluidic chips (75 μL in inlet, 25 μL in outlet) and place back on the perfusion rocker in the cell culture incubator for 1 h.",
    "Image the observation windows of the stained cultures using a manual or automated confocal microscope (Table of Materials) with fluorescent filters (listed as excitation/emission wavelengths, in nm) to observe all nuclei (Hoechst 33342, 350/461), dead cell nuclei (ethidium homodimer-1, 528/617), and live cell cytoplasm (calcein AM, 494/517).\nCapture 140 µm Z-stacks with a step size of ≤1 µm using a 20x air objective. Three fields of view are needed to image the entire microchannel with a small amount of overlap. To avoid double sampling, image only two fields of view per chip.\n\tNOTE: Imaging conditions should be optimized to ensure proper NyQuist sampling. In authors’ experience, a fast imaging system, based either on deconvolution of a conventional epi-fluorescence source or resonance scanning mode on a confocal, is necessary to fully assay a complete Z-stack, with three laser colors, across 96 chips on a plate within a reasonable amount of time (roughly 3.5 h with automated imaging, including setup).\nUsing image analysis software, assay the Z-stack images for the desired quantified data, such as morphology, aggregation state, or other features. To quantify cell viability, count the number of dead cells (red) and total cell nuclei (blue).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}