{
  "id": 17823,
  "origin_website": "Jove",
  "title": "Traditional Trail Making Test Modified into Brand-new Assessment Tools: Digital and Walking Trail Making Test",
  "procedures": [
    "The development of the dTMT and initial application was approved by The Seventh Medical Center of PLA Army General Hospital Review Board. Subjects signed approved informed consent documents prior to testing TMT.\n1. General Method Development\nUse a tablet (e.g., Microsoft Surface Pro 2) with high-quality inertial sensors embedded within the device and a compatible electronic pen (Figure 1).\nUse the Intelligent Device for Energy Expenditure and Activity (IDEEA) monitor, composed of five sensors (each 16 x 14 x 4 mm3, 2 g), with one attached over the sternum, two attached to the front side of each thigh, and the other two attached under each foot. Connect the sternum and thigh sensors via a solid cable to a small 32-bit microprocessor (70 x 44 x 18 mm3, 59 g), and wire the foot sensors (Figure 2).\n2. Design and Testing of the dTMT\nNOTE: As mentioned earlier, dTMT has two parts: dTMT-A and dTMT-B. These two tests should be performed sequentially (dTMT-A proceeding dTMT-B), without being reversed.\ndTMT-A procedure\nCarry out the dTMT-A in a quiet and comfortable environment.\nNOTE: Participants enrolled to complete dTMT should have the educational level of more than 2 years of preliminary school; otherwise, they might have difficulty in reading and recognizing Chinese characters in dTMT-B. Meanwhile, ensure that the participants have no obvious visual and upper limb disability.\nAsk the participants to sit in front of a desk, and adjust the computer position, background light, and the electronic pen.\nCheck the near visual acuity of participants to ensure that they can easily read the numbers on the screen.\nNOTE: Some aged subjects maybe need a pair of glass in case that the circles on the screen are too small for the subjects with presbyopia.",
    "Show the instructions of dTMT-A as follows: Please draw a line as rapidly as possible joining consecutive numbers (i.e., 1->2->3…9) in the circles randomly distributed on the screen. A pre-test trial (150 s maximum) is necessary because most participants need to familiarize how to draw on the surface of a computer.\nDemonstrate the major differences between dTMT-A and standard TMT-A. First, if the circle is correctly lined, its color can be changed. Second, if the circle is not correctly lined, its color remains unchanged, and the subjects need to re-line it from the last circle.\nNOTE: Connecting all the circles fluently with straight lines is encouraged.\nAdvise the participants to avoid errors and time wastage. Encourage the participants to draw the line fluently, but as accurately as possible; however, give no priority.\nAsk the participants to select PartA on the screen (Figure 1 lower panel) to complete dTMT-A without interruption. All the dTMT-A data are gathered on the computer automatically.\nNOTE: If data are collected for investigating intermanual differences, one more test needs to be carried out with the other hand. The sequence of left-/right- hand test is at random.\ndTMT-B procedure\nRepeat step 2.1.\nShow the instructions of dTMT-B as follows: Please draw a line as rapidly as possible joining the numbers and Chinese characters (i.e., 1->imgsrc://cloudfront.jove.com/files/ftp_upload/60456/img1.jpg->2->imgsrc://cloudfront.jove.com/files/ftp_upload/60456/img2.jpg…imgsrc://cloudfront.jove.com/files/ftp_upload/60456/img3.jpg) alternatively in the circles randomly distributed on the screen.\nNOTE: Make sure all the Chinese characters are recognized by subjects. A pre-test trial (150 s maximum) is also necessary because some participants need to familiarize how to draw in the numbers and Chinese characters alternatively on their own.\nAsk the subjects to select PartB on the screen (Figure 1 lower panel) to complete dTMT-B without interruption. All the dTMT-B data are gathered in computer automatically.",
    "NOTE: If data are collected for investigating intermanual differences, one more test needs to be carried out with the other hand. The sequence of left-/right- hand test is at random.\n3. Direct Data Collection and Definitions in dTMT\nDetermine the total time to completion: the time taken (ms) to draw a line connecting all circles in the correct order.\nDetermine the number of errors: the number of times a line is drawn to a circle in the incorrect order.\nDetermine the time to completion for each step: the time taken in milliseconds to draw each step.\nDetermine the time inside each circle: the time spent in milliseconds to draw inside circles.\nDetermine the inside circle percentage (%): time inside each circle divided by total time to completion.\nDetermine the time inside each tolerance circle: the time spent in milliseconds to draw inside tolerance circles.\nDetermine the inside circle tolerance percentage (%): time inside each tolerance circle divided by total time to completion\nDetermine the line canceling times in each step: the times a line is canceled in each step. The tolerance circle has a diameter five times more than that of a real circle.\nDetermine the optimal pathway of each step: the nearest line in millimeters of each step.\nDetermine the actual pathway of each step: the actual line in millimeters of each step.\nDetermine the pathway deviation of each step: the actual line in millimeters minus the nearest line in millimeters of each step.\nDetermine the variability of pathway deviation: Coefficient of the variation of the pathway deviation of each step.\nDetermine the velocity of drawing of each step: the actual line in millimeters of each step divided by the time to completion for each step.",
    "NOTE: The average value was calculated by summing up the values collected step by step. Indirect data reflecting different points between hands or parts were derived based on the direct data.\n4. Design and Testing of the WTMT\nNOTE: Similar to dTMT, WTMT also has two parts: WTMT-A and WTMT-B. These two tests should be performed sequentially (WTMT-A proceding WTMT-B), without being reversed.\nWTMT-A procedure\nCarry out WTMT-A in a quiet and comfortable environment. Ensure that there is room light. Randomly distribute coins with numbers at each of 15 positions in a 16 m2 area (4 x 4 m2). Draw a 30 cm diameter around each coin (Figure 3).\nNOTE: The participants enrolled to complete WTMT should have the educational level of more than 2 years of preliminary school; otherwise, they might have difficulty in reading and recognizing Chinese characters in WTMT-B. Meanwhile, ensure that the participants have no obvious visual and lower limb disability.\nConnect the Intelligent Device for Energy Expenditure and Activity (IDEEA) to the PC and enter the subject's anthropometric data.\nAttach five biaxial mini-accelerometers (16 x 14 x 4 mm3, 2 g) with medical tape over the sternum, to the front side of each thigh and under each foot (Figure 4). Connect all the accelerometers through thin, flexible cables to a microprocessor/storage unit (70 x 44 x 18 mm3, 59 g) attached with a clip to the clothes.\nNOTE: The IDEEA is a multiple accelerometer-based system comprising five biaxial accelerometers located on the upper trunk, thighs and feet. The IDEEA was initially developed to estimate energy expenditure during activities of daily living22,23, but has an additional capability to quantify many of the commonly used gait cycle parameters24.",
    "After the device is equipped, ask participants to walk up and down a walkway without any targets at a comfortable walking speed to warmup.\nShow the instructions of WTMT-A as follows: Please walk on numbered targets in a sequential order as rapidly as possible joining consecutive numbers (i.e., 1->2->3…15) in the coins randomly distributed on the floor.\nEncourage the participants to walk fluently, but as accurately as possible; However, no priority is given. Perform WTMT-A only once.\nEnsure the safety of the participants, because dual-task walking in a challenging environment may increase the risk of falling25. For both pre- and post- tests, a 5 s step pause is needed for IDEEA to discriminate walking from standing.\nNOTE: Either footstep on the coin is considered as on the target. If the participants walk in the wrong order, guide them until they walk in the right order. All the WTMT-A data are gathered in the IDEEA microprocessor/storage unit automatically.\nWTMT-B procedure\nRepeat the steps as in Section 4.1.1.\nShow the instructions of WTMT-A as follows: Please walk on numbered targets in a sequential order as rapidly as possible joining consecutive numbers (i.e., 1->imgsrc://cloudfront.jove.com/files/ftp_upload/60456/img4.jpg->2->imgsrc://cloudfront.jove.com/files/ftp_upload/60456/img5.jpg…imgsrc://cloudfront.jove.com/files/ftp_upload/60456/img6.jpg>8) in the coins randomly distributed on the floor. Make sure all the Chinese characters are recognized by the participants.\nPerform WTMT-B only once.\nEnsure the safety of the participants, because dual-task walking in a challenging environment may increase the risk of fallings25. For both pre- and post- tests, a 5 s step pause is needed for IDEEA to discriminate walking from standing.\nNOTE: Either footstep on the coin is considered as on the target. If the subjects walked in the wrong order, guide them until they walk in the right order. All the WTMT-B data are gathered in the IDEEA microprocessor/storage unit automatically.",
    "5. Direct Data Collection and Meaning Explanation in WTMT\nNOTE: As shown in Figure 5, the human gait cycle has been divided into different subphases. In detail, spatial and temporal parameters are defined and calculated as follows.\nDetermine the steps (n): the number of steps completed during level walking, including the right and left limbs.\nDetermine the swing duration (%): the phase percentage starting from toe-off until initial ground or stair contact for any given foot.\nDetermine the stance duration (%): phase percentage between the heel strike of one foot and the heel strike of the contra-lateral foot.\nDetermine the speed (m/s): the average velocity over two consecutive strides.\nDetermine the step length (m): the difference in length between the initial heel strike of the right or left foot and the heel strike of the contralateral foot.\nDetermine the stride length (m): the distance between the successive points of the initial contact of the same foot, right-left-right (R-L-R) or left-right- left (L-R-L).\nDetermine the gait variability of step length: coefficient of the variation of step length.\nNOTE: Completion time and errors are also collected and counted by the examiner, instead of IDEEA.\n6. Data Collection and Statistics\nUse one-way-ANOVA and Fisher’s LSD to compare the differences between the groups. The demographic data are listed in Table 1. dTMT-A, dTMT-B, WTMT-A, and WTMT-B data are shown in Tables 2-5 respectively. A P < 0.05 was considered to indicate a statistically significant difference.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}