{
  "id": 12198,
  "origin_website": "Jove",
  "title": "Therapy Testing in a Spheroid-based 3D Cell Culture Model for Head and Neck Squamous Cell Carcinoma",
  "procedures": [
    "All studies shown in this manuscript, namely the use of human tumor specimens, are protected under and in consent with prior decisions from University Medicine of Mainz/University of Munich Medical Center Ethics committee. Patients have given informed consent according to national legal guidelines agreeing to scientific use of excess biological material that was obtained in the course of their treatment. Research has been performed in compliance with all institutional, national and international guidelines for human welfare.\n1. Taking a Tumor Biopsy from Head and Heck Squamous Cell Carcinoma\nPerform general (propofol and/or sevoflurane, muscle relaxing agent) or local infiltration (2% ultracaine, adrenalin)/surface (xylocaine) anesthesia in the operating room or otolaryngology examination chair. Visualize the tumor mass in oral cavity/pharynx/larynx/other parts of the upper digestive and respiratory tract with standard operating instruments and, if needed, under the microscope.\nTake a fresh tumor biopsy from the periphery of the cancerous lesion with blunt or cutting instruments. Avoid the center of the lesion due to abundant necrosis in this area. Put the obtained tissue to a sterile container with isotonic sodium chloride solution.\nAfter the biopsy, perform hemostasis as needed, e.g., with a bipolar or monopolar coagulation device in addition to the use of vasoconstrictive substances.\nBring the tumor biopsy intended to be used for cell culture experiments directly to the adjacent laboratory tract. Send other tumor biopsies to the pathologist as usual to rule out cancer.\nMake sure that a laboratory technician is ready to process the specimen directly.\n2. Processing the Tumor Specimen\nPlace the tumor specimen on a suitable and sterile surface and cut it thoroughly with a sterile single-use scalpel into as little as possible pieces.",
    "Caution: Make sure the status of infectious and blood-borne diseases is well documented and the technician is in attention of the institutions standard protocols to prevent needle stick or cutting injury with potentially biohazard patient material and the protocols to follow after possible injury.\nAfter sufficient mechanical separation of the primary tissue, put the tissue into a vial containing Collagenase I/II and incubate for 1 h at 37 °C. Sieve through a 70 µm falcon cell strainer and wash the suspension with Hanks' Balanced Salt solution (HBSS).\nAfter successful separation and subsequent washing, place the suspension containing 1-2 × 106 cells into a T75 cell culture flasks (75 cm2) to grow to sub-confluency at 5% CO2 and temperature of 37 °C. This step may take up to 10 days.\nUse special keratinocyte culture medium consisting of the following: 125 mL of Dulbecco's modified eagles medium (DMEM), 250 mL of Keratinocyte complemented medium (complemented medium consisting of 500 mL of Keratinocyte SF Medium, 15 mg of bovine pituitary extract (BPE), 2.5 mL of penicillin/streptomycin, 150 ng recombinant human epithelial growth factor (EGF), 516 µL of 300 mM CaCl2, stock mix to be prepared in advance), 125 mL of F12 nutrient mix, 10 mg of BPE (0.75 mL), 75 ng recombinant human EGF (2 µL), 3.75 mL of 200 mM L-Alanyl-L-Glutamin-Dipeptide (Table of materials).\n3. Seeding the Cells into Ultra-low Adhesion Cell Culture Plates\nConfirm tumor cell growth under a microscope. Count the cells in culture (primary or cell culture) and seed 5,000 primary tumor cells or 1,000-2,000 cells of intermediate cell line/other cell line in 200-300 µL of media (step 3.2.) into an ultra-low adhesion plate with concave, round bottoms (96-well).",
    "Culture the cells at 5% CO2 at 37 °C and in equal parts DMEM and airway epithelial cell medium (BEGM), 10% fetal bovine serum, 1% penicillin/streptomycin, 1% sodium pyruvate, 1% non-essential amino acids, 1% L-glutamine (step 2.3.). If cell lines are being used, media on the basis of DMEM is sufficient.\nPerform media changes every other day. Pay attention not to aspirate the spheroid with the pipette during media changes. Culture the spheroids until the level of growth as descibed in 3.3 is reached (approximately 7-10 days).\nConfirm spontaneous spheroid formation under the microscope by looking for three-dimensional, spheroid-shaped cell conglomerates. Exclude the wells with irregular and/or multiple spheroid formation from further investigation.\n\tNOTE: Spheroids should be visible with the naked eye, too, facilitating further processing and media changes as described below.\n4. Exposing Spheroids to Multimodal Standard or Experimental Tumor Therapy\nChoose a desired therapy regimen. Design sufficiently large control groups that allow comparisons of treatments to untreated spheroids or spheroids receiving only partial therapy regimens, e.g. radiation alone. The size of control groups depends on the experimental group design and cannot be defined universally.\nExchange the media to media with additives, meaning media with chemotherapeutics and/or monoclonal antibodies at desired concentrations. Add Cisplatin at the concentrations of 2.5/5/10 µM or 5-fluoruracil (5FU) at 30 µM.\n\tNOTE: For high throughput experiments or large group sizes/large number of groups, one can use an automated pipetting robot as we are further establishing in the experiments.\nAlternatively, radiate the cell culture plates with spheroids at 2 Gy using a suitable radiation facility.\n\tCaution: Respect the institution's protocols regarding prevention of harmful radiation exposure of employees. Work only with designated and trained technicians according to radiation protection guidelines. If desired, add chemotherapeutics as described under 4.2. afterwards.",
    "Incubate the cells for 24 h in previously described culture conditions (37 °C, step 3.2).\nAfter the incubation, continue the cell culture for at least 6 days with media changes every other day.\n5. Assessment of Spheroid Size and Extent of Cellular Proliferation for Assay Read-out\nMeasure the spheroid size in terms of area after digital photo documentation on day 6 (day 10, day 16) with a graphic software (parameter 1).\nAfter centrifugation at 520 x g for 2.5 min of the plate, remove the supernatant. Wash the cells with sufficient amount of 1x PBS and centrifuge the plate again as described, followed by removing the supernatant (PBS).\nAdd 100 µL of enzymatic cell detachment solution to each vial to allow the spheroids to dissolve. Incubate the plate for 8 min at 37 °C.\nCheck for successful dissolving of the spheroid under the microscope. Add 100 µL of DMEM. Centrifuge the plate at 520 x g for 2.5 min. Remove the supernatant and suspend the cells in 100 µL of DMEM.\nPerform a commercially available colorimetric proliferation assay, in example WST-8 assay on each vial according to the manufacturer's instructions25. Read out the assay in an enzyme-linked immunosorbent assay (ELISA) reader (parameter 2).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}