{
  "id": 19550,
  "origin_website": "Jove",
  "title": "Isolation, Culture, and Characterization of Primary Schwann Cells, Keratinocytes, and Fibroblasts from Human Foreskin",
  "procedures": [
    "Acquisition and use of de-identified human foreskin tissue for research purposes was reviewed and received the determination of \"not human research\" by the Penn State College of Medicine Institutional Review Board (IRB #17574).\nNOTE: By following the protocol below, 2.4 x 106 keratinocytes, 4.4 x 106 fibroblasts and 1.1 x 106 SCs are obtained from a single foreskin. In general, these primary cells can be used for 3 passages, depending on the experimental conditions.\n1. Isolation of primary cells and culture conditions\nEpidermis and dermis separation procedure\n\t\nAcquire neonatal foreskin following standard of care procedures by a physician under approved hospital regulatory protocols. The physician determines the timing of circumcision after birth and the amount of skin removed.\nPlace the excised foreskin in a microcentrifuge tube containing 8-10 mL of ice-cold Dulbecco's Modified Eagle Medium (DMEM) basal medium and immediately transport the foreskin to the cell culture laboratory for cells isolation. Rinse the skin twice with 20-25 mL of 1x Dulbecco's phosphate-buffered saline (DPBS) containing 1x antibiotic/antimycotic.\n\t\tNOTE: For maximum cell viability, the excised foreskin should be placed at 4 °C until processing, and cells should be harvested within 24 h.\nAfter rinsing in DPBS/antibiotics, soak the foreskin in 25-30 mL of ice-cold DMEM basal medium for 10-15 min in a 10 cm tissue culture dish. Perform all processing steps in a tissue culture hood using sterile technique.\nUsing a scalpel, carefully slice the foreskin open and expose the dermis and subcutaneous adipose tissue.\nRemove the subcutaneous adipose tissue using forceps, scalpel blade, and scissors, as needed. Discard the adipose tissue. Cut the cleaned foreskin into three to five smaller pieces.\nTransfer skin pieces to a sterile conical tube containing 16-20 mL of dispase-I/DMEM medium (4 mg/mL in DMEM basal medium).",
    "Mix the skin pieces in the conical tube by inversion, intermittently, during the first 30 min of incubation with dispase-I. Then place the conical tube at 4 °C for 16-18 h, being mindful of immersing the skin pieces in dispase-I/media.\n\t\tNOTE: Dispase-I solution should be prepared just before addition using cold DMEM basal medium, filtered with a 0.22 µm strainer, and kept at 4 °C.\nAfter overnight digestion with dispase-I, remove the skin pieces and place them on a dry, sterile, culture dish. Unroll each piece of skin so that the outer epidermal layer is touching the culture dish.\nUsing two sets of forceps, carefully separate the epidermis from the dermis. Start on the edge of the tissue and peel the epidermis away from the dermis.\n\t\tNOTE: If the epidermis layer is difficult to separate from the dermis, the dispase-I digestion was not sufficient. Troubleshooting options: 1) return skin pieces to dispase-I/DMEM solution and incubate for an additional 2-3 h at 4 °C; 2) place skin pieces in fresh dispase-I/DMEM and incubate at 4 °C for 2-3 h more.\nUse the separated epidermis and dermis to isolate keratinocytes (epidermis) and fibroblasts and Schwann cells (dermis).\n\t\tNOTE: Follow the steps below for specific cell types isolation and culture conditions.\nKeratinocyte isolation from the epidermis\n\t\nAdd 5 mL of HEPES buffer saline (HBS) to a 10 cm culture dish and add the separated epidermis fragments. Incubate at room temperature (RT) for 10 min.\nAfter HBS incubation, collect the HBS solution in a 50 mL conical tube. Add 5 mL of trypsin neutralization buffer (TNB) (Table of Materials) in a 50 mL conical tube and set aside.\nAdd 3 mL of trypsin solution to the epidermal fragments. Incubate at 37 °C for 10 min.",
    "Gently agitate the epidermal fragments using forceps until the trypsin solution becomes turbid.\nAdd the trypsin solution/keratinocytes to the HBS and TNB containing tube in step 1.2.2.\nFor any remaining epidermal fragments that have not dissolved in the initial trypsin digestion, add 3 mL of 0.25% trypsin/Ethylenediaminetetraacetic acid (EDTA). Incubate at 37 °C for 10 min and repeat steps 1.2.4 and 1.2.5.\nAdd 2 mL of fetal bovine serum (FBS) to the trypsin/EDTA solution containing HBS and TNB solution tubes.\nCentrifuge the collection tube containing HBS/TNB/trypsin and keratinocytes at 870 x g for 5 min at 4 °C.\nAspirate the supernatant and resuspend the cell pellet in 3 mL of keratinocyte complete growth medium (Table of Materials).\nFilter the cell suspension with a sterile 100 µM filter into a sterile 50 mL conical tube to remove debris.\nQuantify the cell number and cell viability.\n\t\tNOTE: Here, a specialized cell sampling and staining device (Table of Materials) was used to quantify the cell number and viability following the manufacturer's instructions.\nSeed culture plates as needed for experiments. The recommended seeding density is ~45,000 cells/cm2.\nPlace the culture plates in an incubator at 37 °C in 5% CO2 for 2 days to allow keratinocytes to adhere to the dish.\nAfter 2 days, aspirate any non-adhered cells. Refresh the cell culture media every other day until keratinocytes reach desired confluence for passaging or downstream experiments (50%-80% confluence).\nIsolation of Schwann cells (SCs) and fibroblasts from the dermis\n\t\nPre-coat T25 flasks with poly-L-lysine (PLL, 0.01 µg/µL) using 5 mL of 1x DPBS. Place the pre-coated flasks at 37 °C for 3 h. Wash the PLL coating matrix twice using 1x DPBS (5 mL).\n\t\tNOTE: T25 flasks can be prepared ahead of time.",
    "Rinse the isolated pieces of the dermis with 5 mL of DMEM basal medium.\nMince the dermis into small pieces with scissors or a scalpel.\nDigest the minced dermis with 5 mL of collagenase (2 mg/mL in DMEM basal medium) at 37 °C for 2.5 h. Gently triturate the minced dermis with a pipette tip every 30 min until the dermis completely dissociates.\nFilter the cell suspension with a 70 µM cell strainer. It is necessary to apply mechanical force using a 1 mL syringe to fully filter the suspension.\nDilute the filtered cell suspension with 5 mL of complete DMEM medium (DMEM basal medium + 5% FBS + 1x of antibiotic) to stop the enzymatic activity of collagenase.\nCentrifuge the cell suspension at 870 x g for 5 min at RT to pellet the cells.\nFrom this cell pellet, both fibroblasts and SCs will be obtained. Resuspend the cell pellet in 2 mL of DMEM complete medium to divide the cells (1 mL cell suspension/tube) and centrifuge at 870 x g for 5 min at RT.\nFor SCs culture, follow steps 1.3.10-1.3.17 and for fibroblast culture, follow steps 1.3.18-1.3.22.\nFrom step 1.3.8, aspirate the supernatant. Resuspend the cell pellet in 5 mL of fresh DMEM complete medium.\nQuantify the cell number and viability.\n\t\tNOTE: Here, a specialized cell sampling and staining device (Table of Materials) was used to quantify the cell number and viability following the manufacturer's instructions.\nSeed the pre-coated T25 flasks with 5 mL of resuspended cells at a density 4.0 x 103 cells/mL. Incubate the flask at 37 °C in the presence of 5% CO2 overnight (~12-16 h incubation).\nAfter 16 h, confirm cell adhesion by microscopy (Table of Materials) at 10x magnification.",
    "Remove the non-adherent cells and wash the flask 3x with 5 mL of 1x DPBS.\nAdd 5 mL of 10 µM cytosine arabinoside (antimitotic agent, kills fibroblasts) in DMEM complete medium. Incubate the flask at 37 °C in the presence of 5% CO2 for 24 h.\nAspirate the cytosine arabinoside containing medium from the flask. Rinse the flask 3x with 5 mL of 1x DPBS.\nRefill the culture flask with 5 mL of SCs complete culture medium (Table of Materials) and incubate at 37 °C in the presence of 5% CO2 for 48 h. Refresh SC complete culture medium every other day until SCs reach 80% confluence.\nAspirate the supernatant from the dissociated dermal layer (step 1.3.8) and resuspend the cell pellet with 5 mL of fibroblast complete medium (fibroblast basal medium + 5% FBS + 1x antibiotic).\nQuantify cell number and cell viability.\n\t\t​NOTE: Here, a specialized cell sampling and staining device (Table of Materials) was used to quantify the cell number and viability following the manufacturer's instructions.\nPlate the fibroblasts at a cell density of 4.0 x 103 cells/mL in T25 culture flasks (not pre-coated) using 5 mL of fibroblast complete medium. Incubate at 37 °C in the presence of 5% CO2 overnight (~12-16 h incubation).\nAfter 16-24 h, confirm cell adhesion by microscopy (Table of Materials) at 10x magnification. Aspirate non-adherent cells from the flask and wash the flask twice with 5 mL of 1x DPBS.\nAdd 5 mL of fresh fibroblast complete medium and incubate at 37 °C in the presence of 5% CO2 for 48 h. Refresh the culture medium every other day until fibroblasts reach the desired confluence for passaging or downstream assays (50%-80% confluence).\n2. Verification of epidermal keratinocytes, dermal SCs and fibroblasts protein marker by immunofluorescence",
    "Day 1- Coat chamber glass slides and detach cells\n\t\nPre-coat 4-well chamber glass slides with collagen-I for keratinocytes, or PLL for SCs or, only 1x DPBS for fibroblasts (0.5 mL each well). Ensure to coat the entire surface. Incubate chamber slides at 37 °C for 2 h. During incubation, prepare the cells.\nAfter cultured cells reach 50%-80% confluence, wash the flasks with 1x DPBS 3x (1 mL for each well).\nDetach the adhered cells with 5 mL of 0.25% trypsin-EDTA (TE) solution by incubating at 37 °C in the presence of 5% CO2 for 2 min, until cells start to become round. Visualize cell detachment with microscopy (Table of Materials) at 10x magnification.\nAfter incubation, transfer TE solution containing cells to a conical tube with 5 mL fetal bovine serum (FBS).\nAdd 5 mL of trypsin neutralization buffer (TNB) to the culture flask and then transfer the contents to the above-mentioned centrifuge tube (cells with TE and FBS). Visualize cell detachment with microscopy (Table of Materials) at 10x magnification.\n\t\tNOTE: TNB or FBS or both can be used to neutralize trypsin activity.\nCentrifuge the conical tube containing cells/TE/TNB at 870 x g for 5 min. Transfer the supernatant to another tube and resuspend the cell pellet in the corresponding complete culture medium. Measure the cell viability as mentioned in step 1.2.11.\nRinse the pre-coated chamber glass slides (step 2.1.1) with 1x DPBS (1 mL for each well) 3x.\nSemi-dry the slides inside the tissue culture hood and seed keratinocytes, SCs, or fibroblasts at an appropriate density (30,000 cells/0.5 mL/chamber) in an appropriate complete cell culture medium.\nIncubate the chamber slides at 37 °C overnight to allow cells to adhere.\nDay 2- Blocking the chamber glass slide with Bovine Serum Albumin (BSA) and primary antibodies incubation",
    "Aspirate the cell media from the chamber slides and wash 3x with 1 mL of 1x DPBS.\nFix the adhered cells with 4% paraformaldehyde in 1x DPBS (1 mL for each well) and incubate for 15 min at RT inside the tissue culture hood.\nAspirate 4% paraformaldehyde from the chamber slides and wash the chamber slides 3x with 1x DPBS (1 mL for each well).\nPermeabilize the cell membranes with 1% TritonX-100 in 1x DPBS (1 mL for each well) and incubate for 15 min at RT.\nAspirate the blocking solution from the chamber slides, wash 3x with 1x DPBS (1 mL for each well) for 30 s and then aspirate 1x DPBS from the well.\nBlock the chamber slides with 5% BSA (0.5 mL for each well) and incubate for 45 min at RT.\nAspirate the blocking solution from the chamber slides, wash 3x with 1x DPBS (1 mL for each well) for 30 s each and then aspirate 1x DPBS from the well.\nDilute the primary antibodies with 5% BSA (0.2 mL for each well) (Primary antibodies dilutions: Keratinocytes: mouse cytokeratin 14 antibody (1:100) and, cytokeratin 10 antibody (1:100); Schwann cells: mouse S100 antibody (1:200), and rabbit nerve growth factor receptor (p75-NTR) antibody (1:500); Fibroblasts: rabbit vimentin antibody (1:200), and mouse alpha-smooth muscle actin (α-SMA) antibody (1:200)).\nAdd the primary antibodies to the corresponding cells on the chamber glass slide and incubate for about 15-16 h (overnight) at 4 °C in a humidified chamber.\nAspirate the primary antibodies from the chamber slides, wash 3 times with 1x DPBS (1 mL for each well) for 30 s each and then aspirate 1x DPBS from the well.",
    "Dilute the secondary antibodies (Goat anti-rabbit IgG Secondary Antibody-Alexa Fluor 488 (1:500) and Goat anti-Mouse IgG Secondary Antibody-Alexa Fluor 594 (1:500)) with 0.5% BSA. Add appropriate secondary antibody to each well (0.2 mL for each well). Incubate for 45 min at RT.\nAspirate the secondary antibody from chamber slides, wash 3x with 1x DPBS (1 mL for each well) for 30 s each and then aspirate 1x DBPS from the well.\nRemove the gasket on the 4-well chamber slide using gasket remover. Try not to leave any adhesive on the slide as this interferes with coverslip application. Add a drop of mounting medium with 4',6-diamidino-2-phenylindole (DAPI). Alternatively, counter-stain the wells with DAPI and use a non-label-containing mounting medium.\nCarefully place the coverslip on the glass slide by avoiding air bubbles and seal the end of the coverslip with glue. Observe immunofluorescence staining patterns by microscopy (Table of Materials) at 10x and/or 20x magnification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}