{
  "id": 19842,
  "origin_website": "Wiley",
  "title": "Negative-Stain Transmission Electron Microscopy of Molecular Complexes for Image Analysis by 2D Class Averaging",
  "procedures": [
    "With an EM grid prepared (see the Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-prot-0002]), the first milestone is to collect a large number of micrographs, containing approximately 50,000 particles in total. Towards this goal, the first step is to evaluate if the grid is good, or, at the least, better than previously acquired data. If the grid is not good, a new grid should be remade before continuing. A good grid has good contrast for individual particles, and good particle dispersion (see Critical Parameters and Troubleshooting). When a grid of suitable quality is made, the objective becomes to collect a much data as possible in a short amount of time. The data should be collected close to focus to minimize the importance of the contrast transfer function (CTF) correction, yet with enough defocus to properly fit the defocus value. Using a camera that supports motion correction can greatly reduce the dwell time for stage settling between camera shots, such as implemented in the OneView camera (Gatan, Warrendale, PA).\nClassically, a “micrograph” referred to the picture taken on film from the electron microscope. Now with digital cameras, the term “image” is commonly used, and often “image” and “micrograph” can be used interchangeably. “Micrograph” may be more appropriate when describing the immutable raw data for analysis, as compared to the processed images during analysis. Meanwhile “image” more commonly refers to everything coming from the electron microscope camera, especially data which is used only transiently while configuring the microscope.",
    "Generally, collecting more micrographs is better for data analysis, but available compute resources will impose a limit on the dataset size that can be efficiently processed. Looking forward to data processing, 2D classification in RELION may behave differently with when 2D classifying large numbers of particles, compared to the same data processed in smaller batches. Yet working with multiple batches of 2D classifications is primarily recommended for curating giant datasets for 3D reconstruction by cryo-EM, not necessarily negative stain. If more than 50,000 particles are used in a single 2D classification, it can become difficult to parameterize the classification to create the desired separation between classes. For the high contrast of negative stain, 20,000 particles can be very effective, and as few as 2,000 to 5000 particles in a dataset can sometimes reveal important insights beyond what is visible in single micrographs. While sample-specific factors will influence the count of micrographs desired, if one assumes 150 particles per micrograph and a target of 20,000 total particles, then roughly 130 micrographs are needed.\nThis article assumes the EM microscope alignments and the software package SerialEM (Mastronarde, 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0019]) have been properly parameterized previously. Many resources for SerialEM are available at varying levels of engagement (see Internet Resources). We note that in a context of EM software that typically fluctuate in stability as they are developed, SerialEM software and support has categorically exhibited sustained excellence.\nMaterials\nLiquid nitrogen\nNegatively stained sample prepared on an EM grid (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-prot-0002])\nFEI Tecnai 12 electron microscope (operated at 80, 100, or 120 kV), or equivalent TEM microscope\nDigital camera containing:\n               \nPreferably with a 4k sensor size, or larger, to maximize particles per micrograph\nPreferably with drift compensation, to avoid significant stage settling delays\nSerialEM installation (requires FEI scripting interface software add-on)\nPrepare the microscope",
    "1. Chill the microscope cold finger with liquid nitrogen.\nStarting and ending a microscope session should be well described by the operating protocol for the EM microscope at your facility. The microscope-specific steps are named here as a reminder, or to inspire the microscope operator to investigate their microscope documentation further if these steps are not already familiar to the operator.\n2. Turn on high voltage to the filament and ramp up the current to the filament to bring it to operating temperature.\n3. Wait 30 min to 1 hr for the microscope cold finger to chill.\n4. Open the column valves and confirm the electron beam is visible on the phosphor screen.\n5. Close the column valves in preparation to load an EM grid.\n6. Load EM grid in the microscope sample holder and insert the sample into microscope.\nAmong these microscope-specific steps, inserting the grid holder into the microscope is one of the most critical. Be sure to coordinate with the individual responsible for microscope maintenance that this step is executed according to the established practice for your facility.\n7. After the microscope vacuum recovers and stabilizes, open the column valves to reveal the electron beam.\n8. Find the electron beam.\nThe beam is commonly blocked by a copper crossbar of the EM grid, and the grid must be moved using the microscope stage control in order to see the beam on the phosphor plate.\nParameterize the sample\n9. Bring the sample to a Z-height previously known to be near eucentric for this microscope sample holder.\n10. Find a visible feature on the carbon surface of the grid at an intermediate magnification (e.g., 9.7 kX).",
    "Dust on the grid, a negative-stain aberration, or any visible feature at the current magnification can be used. Inserting the objective aperture in the path of the electron beam can increase contrast if needed.\n11. Set the proper eucentric height for this sample (e.g., use the alpha-wobbler on a FEI Tecnai 12).\nSetting the eucentric height can be easier if performed first at lower magnification, then increasing the magnification to approach the desired acquisition magnification.\n12. Find focus on the sample, using the visible feature on the carbon surface.\n13. Increase the magnification to that desired for acquisition [e.g., 59 kX at the phosphor screen, which becomes 67 kX (1.8 Å/pixel) at the camera for a bottom-mount Gatan OneView].\n14. Adjust the beam to a brightness appropriate to the camera.\nCAUTION: Exposing the camera to too much electron beam intensity can be detrimental to the camera.\nSelecting appropriate beam intensity is important, and involves these considerations: (1) a beam that is overly converged will become unfocused and resolution will decrease, (2) beam intensity is related to incident beam size on the grid, which is important for parameterizing low-dose mode, and (3) a more intense beam often provides more contrast, reduces exposure time, and reduces drift affects, as long as the beam intensity is within the camera's operating range.\nA beam size slightly smaller than the phosphor viewing screen is often a good choice, and then the microscope spot size can be used to tune brightness appropriate for the camera.\n15. Find focus on the molecules of interest using the camera.\nIf available, interactive mode on the acquisition camera is ideal for this step.\nSometimes molecular complexes can be seen on the phosphor screen, but sometimes the added sensitivity of the camera is necessary to visualize the particles.",
    "CTF fitting programs such as CTFFIND will be used to determine exact defocus but recognizing approximate defocus values directly at the microscope is important. An overfocus particle will have a halo (Fresnel fringe) of white signal, while an underfocus particle (the desired defocus offset) will have a halo of black signal. We show various defocus values for a micrograph series of the HA-441D6 complex stained with uranyl acetate (UA; Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0001]A-H), and defocus effects have been nicely illustrated previously for bacteriophage Basilisk (Belnap, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0001]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1c802d2f-971f-424b-a2a6-c4faebf16747/cpmc90-fig-0001-m.jpg</p>\nFigure 1\nMicrograph defocus series. Defocus values for micrographs acquired at 100 kV were fit with CTFFIND4. (A-H) Representative micrographs near focus were selected, and the CTFFIND4 defocus value is stated below the micrograph. While the effect of defocus is a function of microscope voltage, 100 kV images acquired at focus up to about −0.3 µm can have a granular appearance, since high-frequency noise is retained. Defocus values from −0.75 to −1.5 µm often appear crisp because the particles are well defined by a black halo, but high-frequency noise is suppressed as the increased size of the Fresnel fringes interfere destructively. At defocus values greater than −2 µm, particles may readily appear blurry as the outline of the particle is suppressed by destructive interference of the Fresnel fringes. Desired defocus values are likely to be between −0.1 and −0.4 µm, leaving for particle averaging to differentiate signal from noise, while retaining enough defocus for proper CTF fitting of Thon rings. Scale bar is 50 nm.\n16. Confirm distinct molecules of the samples are visualized.\nDetermine if the sample is too dense or too sparse, or if the stain is too dark (almost opaque) or too light (almost clear). Record an image to annotate this EM grid, even if the sample or grid is poor.",
    "If the sample density or the stain thickness is undesirable, first try other locations across the grid. Stain may be thicker where the grid was gripped by tweezers, and thinner at the point of blotting. Sample density may vary across the grid as well.\nIf numerous places across the EM grid have undesirable stain depth or sample density, remake the EM grid addressing the problem.\nEM imaging setup\n17. Confirm “tune” alignments of EM microscope.\nCheck beam astigmatism (condenser stigmator), rotation center, and image astigmatism using the Fourier transform of the live camera image (objective stigmator). Inaccurate alignments will blur micrographs and defeat the purpose of performing 2D class averaging to improve resolution.\n18. Open the software application SerialEM, if not already open.\nSome hardware configurations may not allow multiple acquisition software to be open simultaneously, therefore the manufacturer's camera software may need to be closed.\n19. Acquire a “Record” image (“Camera and Script Controls” Panel → “Record”) with SerialEM to confirm camera and SerialEM operability (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0002]A).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/acac4bb0-289e-476a-906c-ef58de791ca8/cpmc90-fig-0002-m.jpg</p>\nFigure 2",
    "SerialEM data acquisition. (A) Four preset acquisition types are offered in SerialEM (top panel). By toggling on the low-dose mode (bottom panel), special meaning is imparted to “View,” which is used for montages, and “Record,” which is used for data acquisition. (B) The “Navigator” window manages points for data acquisition, here showing the first 15 points to be acquired and stored in two distinct MRC stacks, annotated by the “F” for filename. (C) The electron beam can cause radiolysis of the negatively stained sample, with some grid preparations more susceptible than others. After acquiring the set of “Record” images, the lower-magnification montage “View” was reacquired, and the experimental acquisition locations were plainly visible where the beam impinged on the sample. The red labels indicated coordinates where images were marked to be acquired, and they correspond well with the circular beam footprint. The effect from a 1 s exposure illustrates the importance of low-dose mode to manage dose on the sample. Scale bar is 2 µm.\n20. Enable SerialEM low-dose mode (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0002]A).\nElectron dose can perturb negative stain and cause rounding of object edges in the micrographs, resulting in loss of resolution and creating artifacts in the sample. Low-dose mode “blanks” the beam (takes the beam off the sample) whenever an image is not being acquired, dramatically reducing the total dose to the region of interest on the EM grid.",
    "It is recommended that low-dose mode be initially configured at a time prior to production data collection. Considerations important to low-dose mode parameterization are discussed in steps 14, 23, and 29. Settings for each SerialEM low-dose acquisition mode can be adjusted by toggling “Continuous update of mag & beam” in the “Low-Dose Control” panel, choosing the desired acquisition mode in the “Go to area/show when screen down” region of the “Low-Dose Control” panel, and then lowering the phosphor screen and making the desired changes.\n21. Acquire a “Record” image with SerialEM in low-dose mode, performed as in step 19.\nLow-dose mode maintains its own image acquisition settings, which are recalled each time low-dose mode is enabled.\n22. Confirm the beam is centered on the camera, and beam intensity is correct by observing the beam on the phosphor screen at the “Record” settings.\nIf the beam is not correct, update the low-dose settings for “Record” as indicated in step 20.\nBeam intensity should lead to a beam size approximately covering the phosphor imaging plate. Beam brightness can be tuned with microscope spot size.\nAn over-condensed beam results in loss of high-resolution information, while an under-condensed beam causes radiolytic damage on an unnecessarily large grid area.\n23. Acquire a “View” image (“Camera and Script Controls” Panel → “View”) with SerialEM to acquire a lower magnification micrograph (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0002]A).\nThe “View” acquisition will be automatically used for the montage acquisition in low-dose mode. We use a “View” magnification of 2.7 kX, resulting in a micrograph with 40.4 Å/pixel. “View” settings are set by the toggle for “Go to area/show when screen down” to “View,” and adjust the beam parameters as in the annotation of step 20.",
    "Confirm that the appropriate lower magnification is selected, that the beam remains centered about the camera, and that very low-dose is applied to the grid by spreading the beam and/or increasing the spot size.\nAcquire the data\n24. Initiate a new montage in SerialEM by selecting “File” menu →”New Montage…”.\nA montage image is required for the navigator map and semi-automated data collection. For simplicity, we recommend using a montage of 1 image. Montaging multiple images can be powerful, but requires increasingly accurate alignments and microscope parameterization, and is likely to run in to the copper grid cross bars.\n25. Acquire the montage: “Montage Controls” Panel → “Start” button.\n26. Open the navigator window: “Navigator” menu → “Open”.\n27. Load the montage into the navigator: select “New Map” in the navigator window (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0002]B).\nNote that only montages, not regular images, can become “maps” in the navigator interface.\n28. Add locations for acquisition of “Record” images: “Navigator” menu → “Montaging & Grids” → “Add Grid of Points.”\n29. When prompted by the “Add Grid of Points” menu, enter the point spacing in micrometer, which is appropriate for your magnification and beam settings. This can be determined empirically, as shown in Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0002]C.\nFor a bottom mounted OneView Camera (15 µm detector pixel size), the following two choices have worked well: (1) 3.2 µm/shot spacing for 67 kX acquisition magnification (1.8 Å/pixel) from a 2.7 kX montage, and (2) 2.2 µm/shot spacing for 110 kX acquisition magnification (1.1 Å/pixel) from a 2.7 kX montage. The authors commonly use 1.8 Å/pixel acquisition settings, which corresponds to a theoretical maximum resolution of 3.6 Å.\n30. When prompted by the “Add Grid of Points” menu, enable acquisition for all points.",
    "Acquisition can be toggled on or off for each navigator point by selecting it in the navigator, then checking the box for “Acquire (A).”\n31. Set acquisition file names. In the navigator window, select the first point to be acquired, then check the box: “New file at item.”\nIf not all points have been assigned a filename, then images will be added to the previous image stack from this acquisition, which we recommend. If no output filenames have been set, the acquired data may not be written to a file, so the first point should always be assigned a filename.\nEnable optional output of *.mdoc files to log image acquisition parameters.\nEnsure that all points of interest have “acquisition” toggled on, as indicated by the “A” in the “Acq” field of each point in the navigator window.\n32. Start the acquisition: “Navigator” Menu → Acquire at points” → \"Just acquire and save image.\"\nThe “Record” image setting is used during automated acquisition. The beam settings should be high-dose for acquisition, within the constraints described in steps 14 and 23.\nInteractively adjust focus while the stage moves between image acquisitions, targeting a very slight negative focus (e.g., between −0.3 and −0.6 µm). This drastically saves time by skipping autofocusing. Autofocus, while appropriately rigorous, requires more accurate microscope alignments, and it must be properly parameterized within SerialEM. If the goal is to setup the microscope to acquire data independently, such as overnight, autofocus will be essential. If the microscope will be used interactively, such described here, autofocus may not be warranted. Autofocus may work within a certain range of offsets, but it may fail when those are exceeded, forcing the operator to manually intervene anyway.",
    "Without autofocus, some micrographs will be unusable because they are too far from focus, but most will be usable, and this is sufficient. Having a diversity of defocus values is helpful for averaging of particles during image analysis, since a particular defocus results in loss of information at a specific spatial frequency.\nRepeat data acquisition on a fresh area of the grid\n33. Pan the stage to a fresh location on the grid by acquiring a view image, then right-clicking and dragging the image in SerialEM to pan the stage.\nAs an alternative to using SerialEM to pan the stage, the microscope controls can be used to directly pan the stage.\nAcquire a new “View” image after panning to see the new area and repeat until a desirable area is found.\n34. Collect more data repeating from step 25.\nCollect a new Montage (Montage panel → start).\nAdd the montage as a new map (Navigator panel → New Map).\nAdd new acquisition points to the map using “Add Grid of Points” as described in step 28.\nSet new filenames for files to be saved.\nInitiate the acquisition, then observe and manually tune the defocus between acquisition of each micrograph.\n35. Collect as much data as possible during a fixed time interval, such as 30 min or 1 hr.\nEstimate how many particles per micrograph, then estimate how many micrographs are needed for a target particle count, such as 10,000 particles. For a particle less than 30 nm in diameter on a 4k detector, 100-200 pickable particles per micrograph would be anticipated when the particle density is favorable.",
    "A set of 5,000-20,000 particles is likely enough data to draw conclusions from the sample of interest. Up to 50,000 particles may be used to increase resolution of the class averages. Beyond 50,000 particles for a single negative-stain data collection, incremental gains in 2D class resolution may become negligible, but this can be sample dependent.\nFinish the EM session\n36. Close the EM column valves, retract the camera, remove the grid holder and store the EM grid, then replace the grid holder in the microscope. If the microscope is done for the day, remove the cold finger liquid nitrogen Dewar and cryo-cycle the microscope.\n37. Transfer images from the data acquisition computer to a location where data will be processed.",
    "Preparation of negatively stained sample is both an art and a science, and it has been described well elsewhere (Booth, Avila-Sakar, & Cheng, 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0003]; Burghardt & Droleskey, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0004]). A carbon-coating machine can be used to apply a carbon coat to a thin layer of plastic on the copper grids or pre-made carbon coated grids can be purchased as done in this protocol. Many approaches exist to apply sample and negative stain to an EM grid (Kastner et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0014]; Scarff et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0025]), but here we highlight a single method that has proved effective the majority of the time for the authors. The quality of the negatively stained EM grid determines the difficulty of the data analysis. Often, increased effort and computational resources during data analysis cannot compensate for a poorly stained EM grid. Thus, it is often desirable to screen several negatively stained grids before acquisition of a dataset, and when revisiting a sample, to collect data only on grids that offer an improvement to previous data collections.\nSample purity can be paramount to the success of a project. Some generalities about producing a pure sample and avoiding aggregation are described in Critical Parameters.\nMaterials\nDistilled water (dH2O)\n0.5% EM-grade UA, diluted in dH2O from a 2% stock (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-rec-0002])\n15-30 µg/ml sample, 5 µl per EM grid, “pure,” monodisperse\nFormvar/carbon (F/C) 300 mesh grids (e.g., Ted Pella, cat. no. 01753-F)\nGlass microscope slide\nFine-tipped self-closing tweezers (e.g., Electron Microscopy Sciences, cat. no. 0304-N1-PO)\nEM grid glow discharger (e.g., PELCO easiGlow model 91000, Ted Pella)\nParafilm\nImprovised cover for the EM grid and solutions: e.g., petri dish lid or plastic container for 96-well plate\nBlot paper (e.g., Whatman grade 1 qualitative filter paper, standard grade, 90 mm circle)",
    "EM grid storage box (e.g., Electron Microscopy Sciences, cat. no. 71150 or use empty boxes from purchased grids)\nGlow discharge the EM grid\n1. Select one formvar/carbon EM grid and place on the glass slide with the carbon side up (dark side of the grid up) using the fine tweezers.\nUsing the wrong side of the grid (formvar side) will result in terrible staining of the sample and uninterpretable results.\nGrip the grid at the edge with the tweezers to avoid tearing the carbon coating.\nThe formvar coating provides stability for the carbon, while adding a small amount of noise to the images. While pure carbon grids can be made or purchased, the added stability of formvar or collodion support is often a desirable tradeoff.\n2. Place the glass slide (containing the EM grid) in the PELCO glow discharger.\nNOTE: Operate the PELCO glow discharger in accordance with the manufacturer's instructions.\nMultiple grids can be glow discharged at once, but the sample should be applied to grids within 30 min of glow discharge.\n3. Place the glass bell over the sample pedestal.\nTake care to make a good seal on the rubber gasket to ensure a good vacuum.\n4. Run the PELCO easiGlow glow discharge program.\nParameters that have worked well include a 10 s hold equilibration time for vacuum stabilization, followed by a 15-mA glow for 25 s. The chamber should glow a purple/pink hue when using atmospheric gas composition. A successful glow discharge renders the EM grid hydrophilic, as judged by the spreading of sample on the grid (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0003]A and B).\nAllow the vacuum to fully dissipate before lifting the glass bell. Prematurely lifting the glass bell causes stress to the glass, leading to chipping of the bell.",
    "If a glow discharge machine is not available, the glow discharge step may be skipped, but sample deposition on the carbon surface will likely be less efficient and may require higher samples concentrations or a larger volume of sample.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a588a088-6c37-467d-9a7f-2b4f8569b5c8/cpmc90-fig-0003-m.jpg</p>\nFigure 3\nGrid preparation. (A) A thin carbon-film grid that has not been glow discharged is hydrophobic, and it will exhibit a high contact angle between the droplet of sample and the grid surface. (B) A successfully glow discharged carbon surface will be hydrophilic and yield a low contact angle of the sample droplet with the grid surface, causing the sample to fully wet the grid surface. Most molecular complexes adhere better to the hydrophilic carbon surface. (C) Rinsing the grid can be done by dipping the grid in 30-µl droplets of H2O arrayed on Parafilm rectangles. (D) Reproducible blotting of a wet grid can be done by touching the side of the grid to blotting paper. (E, F) Negative stain droplets containing 8 µl are small enough that they will adhere to the grid by surface tension, allowing the tweezers to be set on the working surface during the remaining incubation time.\n5. Pick up the EM grid with the self-closing tweezers and place the tweezers with the grid on the laboratory bench.\nPrepare EM grid rinsing and staining solutions\n6. Cut Parafilm into a square or rectangle and place on a working surface, such as the laboratory bench (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0003]C).\n7. For each EM grid: place two droplets of dH2O, approximately 30 µl each, and place one droplet of 0.5% UA negative stain, approximately 8 µl each.",
    "To minimize solid waste that has touched uranium, use a separate smaller Parafilm square for the uranium-based stain. Similarly, uranium-contaminated blotting paper can be minimized when staining multiple samples by using blot paper exclusively to blot the uranium stain droplets, touching each grid to a different region of the blot paper.\nCover the droplets to reduce evaporation. Be aware that evaporation from a single droplet can lead to significant changes in stain concentration. To cover the droplets, several simple options include the lid of a petri dish, the lid from a pipet tip box, or the lid of the sterile wrapping from a 24-well cell culture plate.\nConsult with your institute's appropriate office concerning the use and proper disposable of materials related to uranyl stains.\n8. Apply 5 µl sample to the carbon side (dark side) of the grid (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0003]B), and then cover the grid.\nThe amount of solution needs to be enough to prevent drying during the incubation period. For precious samples, less solution can be used, but it is critical that the grid does not dry.\n9. Allow sample to settle on the EM grid for 1 min.\nBoth shorter and longer times can work, resulting in slightly less/more sample deposited on the grid surface. Ensure the sample does not begin to dry on the grid.\nStain the EM grid\n10. Pick up the tweezers with the EM grid in one hand and blot paper in the other hand.\nHave all staining and rinsing droplets ready and immediately accessible and be prepared to move quickly between blotting and rinse steps to ensure that there is no intervening time for the grid to dry.",
    "The blot paper can be cut into 1/8 round wedges, for ease of handling. One wedge can be used per grid prepared, to avoid cross-contamination between different samples.\n11. Blot the sample from the grid by touching the grid to the blot paper briefly, approximately 0.5 s.\n12. Immediately touch the sample side of the grid to the first dH2O droplet to initiate the first rinse (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0003]C).\n13. Blot the first rinse from the grid by touching it to a fresh location on the blot paper (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0003]D).\nRinsing removes sample buffer from the EM grid, for example, preventing formation of uranium phosphate salt crystals on the grid.\n14. Immediately touch the sample side of the grid to the second dH2O droplet for the second rinse.\n15. Blot the second rinse from the grid by touching it to a fresh location on the blot paper.\n16. Immediately touch the sample side of the grid to the UA droplet (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0003]E and F).\nDue to the small size of the negative-stain droplet, it will completely adhere to the grid and be picked up from the Parafilm. This permits the tweezers and grid to be set down while the stain incubates with sample.\n17. Wait 1 min: allow staining of the sample by UA.\n18. Blot the excess negative stain from the grid by gently touching/sliding the side of the grid along fresh blotting paper for 0.5-1 s.\nThe amount of stain solution remaining on the grid during drying determines the darkness/thickness of the stain, which impacts how the particle is imaged.\nOther methods such as blotting the face of the grid can be utilized, but may best be paired with other protocol adjustments, such as using 1% UA rather than 0.5% UA.",
    "19. Initiate drying of the grid by gently waving the grid in the air, using the tweezers, for up to 5 s to promote initial drying.\nThis step is optional and does increase the risk of mishandling the grid.\n20. Set down the tweezers with the EM grid on the working surface and wait 10 or more minutes for the EM grid to completely dry.\nUsing a still-wet EM grid can cause difficulty during loading of the EM grid into the microscope grid holder, because the grid will stick to surfaces on the grid holder, and to the tweezers. In addition, a wet grid can contribute to the accumulation of contamination inside the EM microscope column.\nIf multiple grids are made at the same time, they may be “labeled” by placing them on labeled filter paper in a petri dish, which could be divided up into four quadrants by simply drawing lines between the areas. Beware that EM grids can become statically charged and may move about in a surprising fashion, particularly in low-humidity environments. A reliable way to keep grids identified is by placing them directly in an EM grid storage box with numbered slots. The grid box slot number is then recorded so that it can be associated with the corresponding sample description.\nA dry grid can be safely stored in an EM grid storage box for extended periods of time prior to imaging.",
    "While negative-stain EM of molecular complexes is a classic technique, substantial improvements in data analysis, recently driven by single-particle cryo-EM, can be leveraged to arrive at conclusions about molecular structure from large datasets that are far superior to conclusions drawn from single micrographs. By employing a contrast transfer function (CTF) correction to correct for varying micrograph defocuses, destructive interference during particle averaging can be minimized. By averaging across thousands of particles, less-common views and conformations can still be well defined. If multiple conformations are present, the relative proportions of these conformations can be estimated by the population of particles assigned to each of the different class averages. A foundational description of the interpretation of negative-stain EM micrographs and the impact of the CTF has been well described previously (Belnap, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0001]). This protocol focuses on RELION3 with assistance from other software such as EMAN2, yet we note that EMAN2 is itself a full package that itself could be used to complete all the steps described here, and as noted in the background section of this article, many other packages exist as well. Many software packages are freely available and provide example data sets and online tutorials.\nMuch or all of the analysis can be done with the graphical user interface (GUI) of these software packages, but the command line interface at the Linux (or macOS) command terminal must be utilized to explore the full set of runtime parameters. In addition to the GUI buttons, we describe the text-based terminal commands, some of which are provided in the appendix, with the goal of familiarizing a user with commands they may later elaborate on. A general familiarity with the Linux command line (see Internet Resources) facilitates organization of data between analysis steps, as well as troubleshooting of data analysis programs.",
    "One such Linux command line tool is “xargs.” While usages can be complicated, we use it in a single methodology, which is more straightforward. Given a command that creates a list of words, such as “ls”, which creates a listing of the files in the current directory, then this list of files can be “piped” into xargs with the Linux syntax of a vertical bar, “|“. The command xargs then runs a given command, provided as an xargs argument, on all the text piped into xargs. For example, “ls * | xargs -I{} cp {} {}.back” will first create a list of files with the list command, “ls”. The argument to “ls” is the wildcard, “*”, which matches all file names. The resulting filename list from “ls” is passed to “xargs” with the pipe command (vertical bar). Then “xargs” will use those filenames to substitute into the “{}” characters in the copy command, “cp”, and execute it. The result is each of those files being copied to a new file of the same name, but with “.back” appended to the destination filename. In this protocol, we use xargs to unstack all the MRC image stacks in a directory or make JPG thumbnails of all MRC files in a directory. It is essential to be capable of managing data as a batch rather than manually on a per-file basis when working with larger datasets, but batch operations open the possibility of errors going unnoticed. An important follow-up to each command issued in a batch format is to always spot-check a few results. This is to ensure the desired action indeed occurred.",
    "Terminal commands are listed as bold annotations under their respective steps. Commands spanning more than one line will be broken across lines as could be done at the Linux command line using the “\\“ character.\nMaterials\nDigital micrographs of negatively stained complexes (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-prot-0001])\nLinux system—(e.g., CentOS or Ubuntu): either remote or local access to a Linux operating system (macOS may also be used, but may require additional effort to compile software)\nData storage of 50-200 GB\nRELION3 software (e.g., RELION 3.0)\nCTFFIND4 software (e.g., CTFFIND 4.1.10)\nEMAN2 software (e.g., EMAN 2.12, although newer versions are likely a great choice)\nFIJI software (e.g., based on ImageJ 1.52i, but continually updated)\n3-button mouse, or capability to emulate a 3-button mouse\nReview raw micrographs\n1. Within a new (empty) project directory, make a “relion” directory, and a “data” directory. Copy the set of micrographs into the “data” directory.\nAn example directory hierarchy for data analysis is shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0004].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/da438099-6788-4617-aa8c-0966ae8087e8/cpmc90-fig-0004-m.jpg</p>\nFigure 4\nDirectory structure for RELION data processing. Directories made by the user are named in black, directories created by the RELION GUI are shown in gray, symbolic links are shown in blue, and micrograph files are shown in green. This directory structure permits multiple RELION analysis directories to sit within a project folder, while keeping the raw data outside of the “relion” processing folder. Critically important is that the path from the RELION processing directory to the micrograph's directory avoids a parent directory reference (“..”), which would otherwise cause havoc for RELION's auto-generated directory structures.\n2. Create a symbolic link from the “data” directory above the “relion” directory to inside the “relion” directory (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0004]).\n         \ncd relion\nln -s ../data ./data",
    "It is good to keep the micrographs outside the RELION directory so that multiple independent analyses be performed on a dataset. Having a reference to a parent directory (“..”) in RELION's relative path to the data can cause havoc for RELION's auto-generated directory structures. Therefore, the symbolic link is chosen to allow RELION to use the raw data as if it was inside the RELION directory hierarchy, even though it is not.\n3. If the micrographs exist as an MRC stack containing multiple micrographs per file, convert them to a single micrograph per file using EMAN2 as follows:\n         \nls *.mrc | xargs -I{} e2proc2d.py --threed2twod {} {}-split.mrc –unstacking\nAfter the individual micrographs are created, move the MRC stacks to another directory for archiving.\n4. Create a full set of JPG thumbnails using EMAN2, since it is commonly more practical to review a large set of JPGs than a large set of raw micrographs in MRC format as follows:\n         \nfind . -maxdepth 1 -name \"*.mrc\" | xargs -I{} e2proc2d.py --process normalize \\\n--scale 0.25 --clip 1024,1024 {} {}_THUMB.jpg\nmkdir jpg; mv *.jpg ./jpg/\nHere, we assume the original images are 4k resolution, thus a scale factor of 0.25 results in a 1k image (i.e., 1024 pixels).\nIf the “-maxdepth” argument is omitted from “find,” then thumbnails will be made for all MRC files in all subfolders of the current directory.\n5. Review the JPG files in their respective subdirectory, and discard or set aside corresponding raw micrographs that are excessively out of focus or exhibit negative staining artifacts.\nMicrographs that are undeniably blurry due to excessive defocus, or due to lateral stage drift, should not be included in the analysis. These micrographs will also exhibit fewer Thon rings than expected in the Fourier transform of the image.\nRELION micrograph processing",
    "6. Use the Linux command terminal to navigate into the “relion” directory, and start the RELION GUI:\n         \nrelion\nFor a given project, the RELION GUI needs to be started from the same directory each time. RELION terminal commands also must be run from the main RELION directory, since all references to image data are relative to this path.\nOnly one instance of the RELION GUI should be run at a time for a given project, otherwise the job tracking and “default_pipeline.star” can become corrupted.\nBy default, the RELION GUI will timeout and close after 1 hr of idle time. This timeout can be extended by starting RELION with the “–idle“ argument, such as the following that extends the timeout to 1 day.\n         \nrelion --idle 86400\n7. Import data into RELION. Select “Import” in the GUI, and the input files can be specified as “data/*.mrc”. Choose “Node type: 2D micrographs (*.mrc)”. (See Appendix[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-app-0001] for corresponding RELION terminal commands.)\nThe product of a successful run is an enumeration of all input micrographs in the “micrographs.star” text file, within the “Import” subdirectory.\nNote that every job submitted through the RELION GUI receives a job number that is incremented by one from the previous job in the project. Results for that job number are found inside the respective directory for that job class, such as “Import.”\n8. Run CTFFIND4 to fit defocus values. Select “CTF estimation” through the RELION GUI. Set the spherical aberration, voltage, and micrograph pixel size. Select “Yes” for “Use CTFFIND-4.1.” Default values are otherwise likely good enough to begin. (see Appendix[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-app-0001])\nThe spherical aberration (CS) is characteristic to each microscope model and can be found in the microscope specifications.",
    "An alternative software to CTFFIND4 that can also be run through the RELION GUI is gCTF, which is GPU accelerated (Zhang, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0033]).\nTo facilitate rapid testing of CTF fitting parameters, it is helpful to work with a subset of micrographs at first. Create a copy of the “micrographs.star” file named “micrographs-test.star,” then use a text editor to delete all but four micrographs listed within the copy and save the changes. Use this “micrographs-test.star” to validate CTF fitting parameters.\n         \ncd Import/job001/\ncp -i micrographs.star micrographs-test.star\ngedit micrographs-test.star\n“gedit” is a graphical text editor commonly available in Linux environments. For a text-based text editor, “nano” can be used instead, and is widely available on Linux environments.\n9. Review the CTF fitting results by checking for correspondence of actual and predicted Thon rings (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0005]A). Either (1) start “Manual picking” through the GUI using the same “micrographs.star” file, then select the “CTF” button for each micrograph to be examined, or (2) convert the CTFFIND output files to JPGs and review them directly: \t\n         \ncd CtfFind/job002/data\nls *.ctf | xargs -I{} e2proc2d.py {} {}.jpg\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e15c76ba-ff72-4526-bd60-2b6b5ecc0273/cpmc90-fig-0005-m.jpg</p>\nFigure 5",
    "Data processing. (A) Thon rings in the Fourier transform of the micrograph describe the defocus of that micrograph. The lower-left of the image overlays the predicted Thon rings from CTF fitting, while the remaining quadrants are derived from the raw micrograph. A proper CTF fit results in continuous Thon rings across the experimental and predicted quadrants. (B) A subset of particles were manually picked, to be used for initial 2D classification. (C) From nine classes of manually picked particles, a subset of the classes (red boxes), representing top, side, and oblique views, could be selected as templates for auto-picking. (D) From the original image at left, a series of search templates were generated by low-pass filtering to 20, 30, and 40 Å resolution, representing the actual templates employed by auto-picking. (E) Auto-picking results were visualized on the original micrograph for inspection. Representative micrographs should be manually inspected to evaluate proportion of false-positive and false-negative results. Scale bars are 50 nm in panels B and E, and 10 nm for panels C and D.\nRELION particle processing\n10. Manually pick 500 to 1000 particles (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0005]B). Select “Manual picking” in the GUI. Choose the input file as the CTFFIND result, micrographs_ctf.star. Input the particle diameter. Default values are otherwise a reasonable start. (see Appendix[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-app-0001])\nWith a three-button mouse, the left click picks a particle, the middle click erases a picked particle location, and the right click offers a menu that allows the current picked-particle list to be saved, which is critical.\nThe actual number of picked particles needed depends on your data, and on how rigorous you elect to make the initial classification to be. Once suitable templates are created for auto-picking, the initial set of manually picked particles is no longer needed.",
    "Center the particles as best as possible when picking them. If the particles are already centered, the 2D classification steps later on will not need to use compute power to figure out where center is.\n11. Extract particles. Select “Particle extraction” in the GUI. Choose the “micrographs_ctf.star” from the CTFFIND result, and the particle coordinates picked from manual picking. Choose a box size (in pixels) that is 1.5-2× the diameter of the particle. Choose “No” for “Invert Contrast.” Otherwise, default values are reasonable to start. (see Appendix[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-app-0001])\nLarger particle boxes allow for better background estimation during classification, but the resulting particle stack requires more disk space to store, and, to a lesser degree, more RAM to compute on. The particle diameter for classification can later be fine-tuned with an outer mask, but the mask can only make the particle size smaller, not bigger.\n“Invert Contrast” is set to “No” because RELION, and the majority of EM analysis programs, expect light particles on a dark background. Negative stain already presents light particles on a dark background. Cryo-EM datasets present dark particles on a light background, and therefore must be inverted to meet this convention.\n12. Run 2D classification to generate auto-picking templates (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0005]C). Select “2D Classification” in the GUI. Choose the “particles.star” produced from particle extraction. Set “Number of Classes” to between 4 and 10. Select a mask diameter in angstroms that is about half-way between the actual particle diameter, and the particle box size. Increase the number of threads to a reasonable number for the CPUs at your disposal. Default values are otherwise a reasonable start. (see Appendix[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-app-0001])\nNote that the effectiveness of 2D classification can be very sensitive to the mask diameter.",
    "Runtimes are dramatically affected by the sampling parameters. 2D classification for up to a few thousand particles should proceed rapidly.\nExpect at least one class to be a repository for particles that do not resolve into a homogeneous class. This class is often termed the “junk” class, and typically appears as a low-resolution blur. The junk class may contain many particles, some of which could make their own well-resolved class if there were more classes available, or if the search parameters were different.\n2D classification is likely the first processing step in RELION where there is any concern of crashing the computer due to memory use. Threads share memory while applying multiple CPUs to a computation. Multiple threads must reside on the same computer node. MPI processes don't share memory, so running two MPI processes will require twice the memory to engage two CPUs in a single computation. MPI processes can be run on different computer nodes, and MPI is the mechanism by which a large RELION computation is run on a computer cluster with many nodes. The RELION FAQ contains much useful information on managing a large RELION computation (see Internet Resources).\n13. If only a subset of classes from 2D classification will be used for auto-picking, such as when excluding a “junk” class, the subset needs to be generated explicitly. Select “Subset selection” and select a model.star file from the final iteration of the 2D classification. Use the RELION GUI to select the classes to keep (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0005]C). To save the particle selection, right click on the images and select “Save selected classes.” A “class_averages.star” file will be written that can be used as a reference for auto-picking.",
    "14. Auto-pick particles using templates from 2D classification. Select “Auto-picking” from the GUI. Choose the micrographs_ctf.star from CTFFIND. Select the 2D references as the mrcs file from the conclusion of 2D classification, or the “class_averages.star” from subset selection. The parameters “Picking threshold,” “Minimum inter-particle distance,” and “Maximum stddev noise” will need to be manually optimized. Otherwise, default values are reasonable to start. (see Appendix[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-app-0001])\nThe “Picking threshold” parameter relates to how well the template must match the picked particle. The “Minimum inter-particle distance” is used to avoid double-picking the same particle, as well as avoiding picking closely overlapping particles, which are inherently problematic for 2D classification. “Maximum stddev noise” sets a ceiling value for the standard deviation of the background for a picked particle. The noise in the background of a particle can be used for cryo-EM datasets to identify particles on carbon support which have a higher background noise than particles in carbon holes where background is purely frozen buffer. The utility of this parameter for negative-stain data is less clear, and it can prevent particles from being picked that otherwise would be desirable particles.\nIt is strongly recommended to make a subset of the total micrographs for testing of auto-picking parameters, before auto-picking the entire dataset. See step 8 in this protocol to make a “micrographs_ctf-test.star.”\nWhen troubleshooting auto-picking, it is best to start from conditions where too many particles are picked, and then refine the picking back to the ideal amount. If no particles are picked, it is difficult to judge if the revised picking parameters are an improvement, or not.",
    "Note that particles can readily be culled from a picked dataset, but auto-picked particles cannot be added to a picked dataset without the concern of double-picking particles. Thus, it is better to over-pick than under-pick particles. Still, if too many false-positive particles are picked, RELION may be unable to key in on features of the real molecular complex, resulting in ineffective 2D classification.\nRuntimes for auto-picking with RELION are linearly related to the number of templates. It is advisable to select just a few templates, then rely on low-pass filtering of the templates and sufficiently generous picking thresholds to capture the full spectrum of views presented by a molecular complex. Low-pass filtering facilitates fuzzy matching to chosen templates, so only a few views of the complex are needed (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0005]D).\n15. Confirm auto-picked particles are accurate by clicking on the auto-pick output via the RELION3 GUI. With the auto-picking job selected, select the output field indicated by “Display: out: coords_suffix_autopick.star.” The particle picking GUI will spawn, and the picked particles will be those resulting from auto-picking (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0005]E).\n16. Extract auto-picked particles. Proceed as in step 11 in this protocol, except select the particle coordinates from auto-picking.\nIf many particles are picked and the particle dataset will be unwieldly to perform 2D classification, it is advisable to start with 2× binned particles. For the extraction parameters, select “Rescale particles: Yes.” Choose a size in pixels to be half of the original box size. Later, a smaller, refined particle set can be extracted again at 1× to achieve the best possible resolution.\n17. Run 2D classification. Proceed as in step 12 in this protocol, except select the “particles.star” from the particle extraction from auto-picking. Set “Number of Classes” to be between 8 and 50 (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0006]A).",
    "The number of classes needed is highly dependent on the data. It can be good to try several different numbers of classes, such as 10, 20, and 40. Twenty classes may be a good place to start.\n2D classification of the full auto-picked particle set is the most compute intensive step of this protocol. If possible, utilize a computer cluster with MPI to run the computation on multiple computer nodes. GPUs can vastly accelerate this step, if available, although additional setup and command line arguments are required (see RELION in Internet Resources). The search parameters can be adjusted as well, such as coarsening the sampling, or reducing the number of classes, or working with higher binning of particles (i.e., 2× binned, or 1.5× binned, instead of 1×). If your dataset is giant, divide the “particles star” file into sets of 40,000 particles and classify each set separately. After “junk” particles have been removed, the dataset subsets can be merged for a final 2D classification run.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/db44a2d3-acfb-4bcc-b3ae-942f7e883e3b/cpmc90-fig-0006-m.jpg</p>\nFigure 6",
    "Arriving at final 2D classification results. For all panels, 2D classification results are at left, and class occupancy plots are shown at right. (A) Following preliminary particle curation, 2D classification was run with 50 classes to spread particles among unique classes. Classes in panel A were culled that appeared inconsistent with the HA-Fab complex, such as Fab alone in class #8. (B) In search of a representative minimal set of classes, culled particles from panel A were reclassified in 16 classes. Several classes have very similar views of the complex, suggesting 16 may be too many classes. (C) Culled particles from panel A were classified into nine classes. Class #9 appears to be a combination of top and side views, suggesting that nine classes may be too few. The ideal number of classes is sample dependent and is also at the author's discretion. Class indices increase left-to-right, then top-to-bottom. Scale bar is 10 nm.\n18. Cull the particles in poorly resolved classes from the particle set. Similar to step 13, select “Subset selection” and select a model.star file from the final iteration of the 2D classification, select the classes to keep, and then save the particle selection. Differing from step 13, the output that will be used for future 2D classification is the “particles.star” file.\nSome classes may be poorly resolved, not because the particles are outliers, but because the search parameters did not allow them to become a distinct class. Focus on culling the classes containing fewer particles. Often there are poorly resolved classes that have more particles than the well-resolved classes, and those classes should be retained because their constituents have not yet properly partitioned into a class.",
    "Particle culling is accomplished over multiple rounds, but the number of rounds required can be sample dependent. Sometimes a cautious approach yields a better final selection of particles, while other times a cautious approach is just slower but not better.\nParticle classification is imperfect, and each culling step removes some good particles with the bad. The RELION GUI can be used to display individual particles belonging to a class, and it is insightful to browse the diversity of particles within a class before choosing to cull or keep a class.\n19. Multiple rounds of 2D classification and subset selection can be repeated until the particle set consists of well resolved classes, and the classes are representative of the particles in the sample as best as possible.\n20. Perform a final 2D classification. The output becomes the final result for this sample (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-fig-0006]B and C).\nParticles should be extracted at 1× binning for this final step.\nThe number of classes, angular sampling, translation search, and particle diameter all may be tuned to arrive at an ideal partition of particles into distinct, well-resolved classes.\nPresentation of final 2D classification results can be made more clear if classes are sorted by an attribute such as percent of the particle contributing to the class (Gallagher, Torian, McCraw, & Harris, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0009]), or the diameter of the particle in a varied population (Gallagher & Harris, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0008]) , or other pertinent descriptors. Two software that provide tools to construct these sorted image stacks are IMOD (Kremer, Mastronarde, & McIntosh, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0016]), and FIJI (Schindelin et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.90#cpmc90-bib-0028]). Plots of class occupancy were generated using the “R Project for Statistical Computing” software package using data from the RELION star files of the final iteration.",
    "A full 3D reconstruction is possible from negative stain, but full 3D analysis is beyond the scope of this article. See Understanding Results for further discussion and an example of 3D analysis."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}