{
  "id": 3242,
  "origin_website": "Cell",
  "title": "Isolation and detection of extracellular vesicles from melanoma cells and liquid biopsies using size-exclusion chromatography and nano-flow cytometry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\n      This part of the protocol describes the collection and processing of\n      patient-derived melanoma cell line supernatants (conditioned media) as\n      well as blood liquid biopsies (plasma or serum). It is followed by a\n      detailed procedure for EV isolation from the above-mentioned samples. The\n      last part of the protocol outlines EV characterization by nano-flow\n      cytometry, which allows us to determine particle number and size. The\n      resulting isolated EVs can be used for further downstream processing such\n      as immunostainings, TEM-based visualization, RNA sequencing or proteomic\n      profiling.\n    \n      Culturing of patient-derived melanoma cell lines for EV collection (step\n      1)\n    \nTiming: 3–4 days\n        Prior to EV collection from patient-derived melanoma cell lines, test\n        the cells for mycoplasma contamination. For this protocol cells were\n        tested with PlasmoTest™ (see\n        key resources table[href=https://www.wicell.org#key-resources-table]), however there\n        are several other methods available to test for mycoplasma.13[href=https://www.wicell.org#bib13]\n        Culture the melanoma cells in a 150 cm2 flask (see\n        key resources table[href=https://www.wicell.org#key-resources-table]) in 25–30 mL of\n        pre-warmed “cell culture medium for maintenance” in a cell incubator\n        (37°C, 5% CO2) (One 150 cm2 cell culture flask\n        typically yields particles in the range of 109 particles/mL).\n      \n        Once cells have reached 50%–70% confluence, wash the cells with standard\n        phosphate-buffered saline (PBS) to remove traces of FBS originating from\n        the cell culture media:\n        \nAspirate cell culture medium.\nAdd 10 mL PBS and slightly sway the flask.\nImmediately remove PBS.\n            Repeat steps a.–c. two more times.\n            \nNote: The confluency depends on\n              the proliferation rate of cell lines. For slow growing cells aim\n              for confluency of 70%.\n            \nCritical: It is important to\n              wash off the “cell culture medium for maintenance” to avoid\n              carry-over of exosomes contained in the FBS\n            \n        Add 25–30 mL of “cell culture medium for EV collection” and grow the\n        cell in a cell incubator for 48–72 h.\n        \nCritical: Avoid cell confluency",
    "above 80% to avoid contamination with EVs from apoptotic cells.\n          Furthermore, maintain the same incubation time for EV collection\n          across experiments to ensure reproducibility.\n        \n        Collect the cell supernatant (containing the secreted EVs) by pipetting\n        it into a 50 mL conical tube. At this point, the cells can be discarded\n        or further cultured for other experiments.\n      \nNote: The collected supernatant contains\n      the EVs that were secreted by the melanoma cells into the “cell culture\n      medium for EV collection”. Further processing steps will be required for\n      cleanup and concentration before isolation of melanoma-derived EVs by SEC.\n    \n      Preprocessing and concentration of cell line supernatant (step 2a)\n    \nTiming: 1–2 h\n        Cool down centrifuge (Heraeus Multifuge) to 4°C prior to processing and\n        concentration of cell culture supernatants.\n      \n        Centrifuge the 50 mL conical tubes containing c.a. 25–30 mL of cell\n        culture supernatant (500 g, 5 min, 4°C) to remove cellular\n        debris.\n      \n        Carefully pipet the cell culture supernatant (containing the secreted\n        EVs) into a new 50 mL conical tube without touching the pellet.\n      \nCritical: Work as fast as possible to\n      avoid the cell pellet to dissociate. You may leave a minimal amount of\n      supernatant above the pellet to avoid disturbing the pellet.\n    \n        Centrifuge the collected cell culture supernatant (3000 g,\n        20 min, 4°C) to remove larger microvesicles (MVs) and enrich for smaller\n        MVs and exosomes.14[href=https://www.wicell.org#bib14]\n        Carefully pipet the cell culture supernatant into a new 50 mL conical\n        tube without touching the pellet.\n      \n        Filter the collected melanoma cell culture supernatant through a 0.45 μm\n        PES filter using a syringe.\n      \nNote: The cell culture supernatant is now\n      ready for concentration.\n    \n        For concentration of cell culture supernatants use Amicon Ultra-15\n        filter units with a cut-off of 100 kDa. Prior to concentration, wash the\n        Amicon Ultra-15 filter units with PBS:",
    "Add 15 mL of PBS in the Amicon Ultra-15 filter unit and centrifuge\n            until the PBS has passed through the filter into the collection tube\n            (4000 g, 3 min, 4°C).\n            \nCritical: It is essential to\n              accurately balance Amicon Ultra-15 filter units in the centrifuge.\n              An unbalanced rotor may cause damage to the surroundings and/or\n              the rotor of the centrifuge.\n            \n            After centrifugation remove the Amicon Ultra-filter unit from the\n            collection tube, decant the PBS, and immediately proceed to the\n            concentration of the cell supernatant.\n          \n        Put the Amicon Ultra filter unit back onto the same collection tube and\n        pipet 15 mL of processed cell culture supernatant onto the filter.\n      \n        Centrifuge (4000 g, 6 min, 4°C) until the cell culture\n        supernatant has flown through and 500 μL of concentrated melanoma cell\n        line supernatant remain in the filter unit.\n      \nNote: The centrifugation time depends on\n      the viscosity of the cell culture supernatant and the position of the tube\n      in the centrifuge, but typically ranges between 6–10 min (see\n      troubleshooting problem 1[href=https://www.wicell.org#troubleshooting]).\n    \nDiscard the flow-through by decanting.\n        Repeat step 13–16 with the rest of the cell culture supernatant to\n        obtain a final volume of 500 μL of concentrated cell line supernatant.\n      \n        Transfer 500 μL of the concentrated melanoma cell line supernatant into\n        a 1.5 mL centrifuge tube.\n      \nNote: The concentrated melanoma cell line\n      supernatant is now ready for EV isolation by SEC.\n    \nPause point: Concentrated melanoma\n      supernatants can be stored at −80°C until EV isolation by SEC.\n    \n      Collection and preprocessing of plasma or serum (step 2b)\n    \nTiming: 1–2 h\nNote: To reduce shear forces on the sample\n      use wide-bore (wide orifice) pipette tips. This is not required, but\n      recommended, when gentle handling of the sample is desired.\n    \n        Centrifuge blood collected in plasma and serum collection tubes",
    "immediately upon blood draw (1600 g, 10 min, 22°C). In our\n        biobank blood is routinely collected in 10 mL plasma or serum collection\n        tubes (see key resources table[href=https://www.wicell.org#key-resources-table]).\n        Since one EV isolation only requires 250 μL of blood, excess plasma or\n        serum can be stored at −80°C after preprocessing.\n      \nCritical: Temperature and time till\n      processing can have a profound impact on EV biology. To ensure\n      reproducibility, process blood samples immediately after blood draw.\n      Furthermore, the different coagulation agents inside collection tubes\n      influence EV production.15[href=https://www.wicell.org#bib15] When planning\n      your study, inform yourself on the best option for your experiment.\n    \n        Transfer the plasma or serum supernatants into a fresh 1.5 mL centrifuge\n        tube.\n      \nCritical: Avoid touching the buffy\n      coat layer\n    \n        Perform a second centrifugation step (3000 g, 10 min, 22°C) and\n        transfer the plasma or serum into a fresh 1.5 mL centrifuge tube. A\n        second centrifugation step is recommended by the International Society\n        on Thrombosis and Haemostasis (ISTH) to remove platelets.16[href=https://www.wicell.org#bib16]\nPause point: At this step plasma or\n      serum samples can be frozen at −80°C. However, it is recommended to reduce\n      freeze-thaw cycles to a minimum, as they affect EV structure and\n      stability.\n    \n        To prepare for the processing of the blood liquid biopsies cool a\n        microcentrifuge to 4°C.\n      \n        If plasma and serum were frozen, thaw the samples on ice for 30 min.\n      \n        Pipet 250 μL of the plasma or the serum into a 1.5 mL centrifuge tube.\n        It is possible that the plasma or serum is still cloudy after\n        preprocessing, in that case see\n        troubleshooting problem 2[href=https://www.wicell.org#troubleshooting].\n      \n        Centrifuge plasma or serum supernatants in a microcentrifuge (1500\n        g, 10 min, 4°C).\n      \n        Transfer the supernatant to a fresh 1.5 mL centrifuge tube without\n        touching the pellet.\n      \n        Centrifuge plasma or serum into a microcentrifuge (10,000 g,\n        30 min, 4°C).\n      \nNote: Centrifugation at 10,000",
    "g will remove larger MVs. Omit steps 26–27 if heterogenous EV\n      populations (e.g., containing larger MVs) are desired.17[href=https://www.wicell.org#bib17]\n        Transfer the supernatant into a fresh 1.5 mL centrifuge tube without\n        touching the pellet.\n      \nNote: The plasma and serum samples are now\n      ready for EV isolation.\n    \n      SEC-based EV isolation from cell lines and blood liquid biopsies (step 3)\n    \nTiming: 4–5 h\n      SEC isolates EVs based on their size by filtering them through a porous\n      resin. Here, we use a resin with a pore size of 70 nm that allows proteins\n      and particle below that cut-off to enter the pores, which reduces their\n      flow rates. In contrast, EVs are excluded from the pores and elute in\n      earlier fractions. Typically, EVs are enriched in fraction 7–10 (see\n      Expected Outcome).\n    \nNote: When working with a new (melanoma)\n      cell line, determine which fractions are enriched in EVs. For a given cell\n      line and condition, SEC is highly reproducible, thus fractions can be\n      collected in pools, once the elution range of EVs has been determined.\n    \n        If IZON columns are stored at 4°C, take out a column the night before EV\n        isolation and put it in a Styrofoam box to allow for slow equilibration\n        to the operational temperature range of 18°C–24°C.\n      \n        Before you begin, sterile filter DPBS through a 0.2 μm membrane filter\n        and degas the buffer with a vacuum pump (or alternatively a vacuum\n        chamber) for at least 1 h at room temperature.\n      \nNote: Gases that are dissolve in the\n      buffer can cause bubble formation at nucleation sites in the porous\n      matrix, which can negatively impact separation by SEC.\n    \n        Prepare an appropriate column holder/rack and align pre-labelled\n        1 mL/5.0 mL collection tubes in the order of elution.\n      \nRemove the top column cap.\nCritical: To ensure consistent elution",
    "profiles, do not remove the caps before the column has reached operational\n      temperature.\n    \n        Attach the IZON qEV original (70 nm) column to column holder, insert the\n        buffer reservoir on top of the column and prepare a container for the\n        collection of DPBS washes.\n      \n        Remove the bottom column cap and allow the buffer to run through the\n        column matrix. Let it flow into the collection container.\n      \n        As soon as the last drop has run into the filter, add 20 mL (i.e., fill\n        the entire buffer reservoir) of degassed DPBS on top of the column and\n        let the buffer flow into the collection container.\n      \nCritical: It is important to properly\n      wash columns with 20 mL of degassed DPBS as they contain sodium azide as a\n      bacteriostatic agent. Any remaining sodium azide may destroy eluted EVs\n      (see troubleshooting problem 3[href=https://www.wicell.org#troubleshooting]).\n    \n        Add the sample:\n        \n            Cell culture supernatants: Carefully pipet 500 μL processed and\n            concentrated cell culture supernatant onto the column and let the\n            void volume flow into a 1.5 mL centrifuge tube below the column.\n            or\n          \n            Plasma or serum samples: Carefully pipet 200 μL of processed plasma\n            or serum onto the column. As soon as the sample has run into the\n            frit, add 300 μL of degassed DPBS and let the void volume flow into\n            a 1.5 mL centrifuge tube below the column.\n            \nNote: Make sure the sample is at\n              room temperature before loading it onto the column.\n            \n        Wait until the entire sample volume has been absorbed by the column,\n        then add another 500 μl of degassed buffer onto the column and continue\n        to collect the void volume into a fresh 1.5 mL centrifuge tube (Figure 1[href=https://www.wicell.org#fig1]A).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2809-Fig1.jpg\n              Figure 1. SEC-based isolation of EVs from patient-derived melanoma\n              cell line supernatants\n            \n        Repeat step 36 collecting the eluting 500 μL fractions in separate",
    "1.5 mL centrifuge tubes (Figure 1[href=https://www.wicell.org#fig1]B).\n      \nNote: See left and right columns of\n      Table 1[href=https://www.wicell.org#tbl1] for guidance on the expected fraction content.\n    \ntable:files/protocols_protocol_2809_3.csv\n      However, it is recommended to determine the EV-containing fractions (by\n      nano-flow cytometry, nanoparticle tracking analysis (NTA) or similar\n      methods) for your specific experimental condition, as elution profiles may\n      vary depending on the sample type and experimental setup.\n    \n        When running more than one sample on a column wash with at least 20 mL\n        of DPBS between samples.\n      \n        Cleaning step: When required rinse the column with 5 mL of 0.5 M NaOH\n        and wash with 30–40 mL of DPBS (measure PH of elution to check whether\n        the wash was sufficient). IZON qEV original Columns can be used up to\n        five times.\n      \n        Pool the EV-containing (e.g., fractions 7–10) for further downstream\n        processing.\n      \nNote: If EV-containing fractions are\n      known, they can already be pooled during acquisition (Table 1[href=https://www.wicell.org#tbl1]). When working with a new (melanoma) cell line determine particle\n      concentration and size of the different fractions (see “Nano-flow\n      cytometry”) to identify fractions enriched in EVs.\n    \n        Store obtained EV-containing fractions at 4°C, when used for downstream\n        analysis (including nanoflow cytometry) within the next 24 h or freeze\n        fractions at −80°C for longer-term storage.\n      \nCritical: During the entire EV\n      isolation procedure it is important to never let the column run dry as\n      this will negatively impact the SEC performance.\n    \nNano-flow cytometry: Data acquisition (step 4)\nTiming: 2 h\n      This part of the protocol describes the quantification of single-particle\n      concentration and size. The NanoFCM Flow NanoAnalyzer (NanoFCM Co. Ltd.,\n      China) allows quantification of particles at the nanoscale between\n      40–1000 nm. EVs are quantified by means of a highly sensitive side-scatter\n      channel.\n    \nNote: In addition, the NanoFCM has two\n      in-built lasers that allow fluorescent-based detection of particles. Thus,",
    "EVs may be stained with antibodies of interest prior to data acquisition\n      on the NanoFCM.\n    \n        Prepare control samples, standards and cleaning samples:\n        \n            Prepare\n            NanoFCM Quality Control Nanospheres (QC bead) solution as a\n            concentration standard and for initial system alignment: Add 1 μL QC\n            beads in 99 μL deionized water (1:100 dilution) in a 0.6 mL\n            MaxyClear Snaplock microcentrifuge tube.\n          \n            Prepare Silica Nanospheres Cocktail (size bead) solution for\n            size calibration (68 nm, 91 nm, 113 nm, 155 nm). Add 1 μL in 99 μL\n            deionized water (1:100 dilution) in a 0.6 mL MaxyClear Snaplock\n            microcentrifuge tube.\n          \n            Prepare the cleaning solution for washing of the sample line:\n            Add 150 μL Nano FCM cleaning solution in a 0.6 mL MaxyClear Snaplock\n            microcentrifuge tube.\n          \n            Prepare a negative control a control for background\n            correction: Add 100 μL of DPBS in a 0.6 mL MaxyClear Snaplock\n            microcentrifuge tube.\n          \nNote: Keep the samples on ice when not\n      acquiring\n    \n        Thaw the experiment samples (single fractions or pooled EV fractions\n        (e.g., fractions 7–10)) on ice while performing the setup of the\n        nanoFCM.\n      \nStart-up and initialize the fluidics of the NanoFCM machinery.\nCritical: Make sure to use 0.6 mL\n      MaxyClear Snaplock microcentrifuge tubes that are compatible with nanoFCM\n      acquisition.\n    \n        Once the fluidics are initialized, switch on the single-photon counting\n        modules (SPCM) detector.\n      \n        Load the MaxyClear Snaplock microcentrifuge tube with the QC bead\n        solution into the machine and boost the QC bead solution for 45 s (see\n        Methods video S1[href=https://www.wicell.org#mmc1]).\n      \nCritical: To ensure proper\n      pressurization each sample needs to be boosted for 45 s prior to data\n      acquisition for 1 min.\n    \n        Align the lasers until optimal signal intensities/events for the side\n        scatter are achieved:\n        \nOptimal value for side scatter intensity: 1000–1500.\nOptimal number of events: ≥ 30.\nCritical: During optimal alignment\n      ensure that intensity histograms represent a uniform and narrow peak.",
    "Otherwise, manually adjust horizontal and vertical position of the optical\n      lenses or optimize laser focusing lens alignment turning the knobs of the\n      lasers.\n    \n        Once aligned, switch to “auto-sampling” to keep pressure stable\n        throughout use. The auto-sampling pressure range should be between\n        0.4–1.5 kPa.\n      \nAcquire QC beads for 1 min and save the data as NFA file.\nCritical: Once a sample is acquired on\n      the NanoFCM must be saved manually as an NFA file prior to boosting the\n      next sample, as otherwise the data is lost.\n    \n        Unload the MaxyClear Snaplock microcentrifuge tube with the QC bead\n        solution.\n      \n        Load the MaxyClear Snaplock microcentrifuge tube with the cleaning\n        solution and boost the cleaning solution for 45 s.\n      \n        Remove the MaxyClear Snaplock microcentrifuge tube with the cleaning\n        solution from the inlet.\n      \n        Briefly dip the inlet in a MaxyClear Snaplock microcentrifuge tube with\n        deionized water to clean the sample line.\n      \nCritical: Removal of remaining\n      cleaning solution from the inlet is important to avoid EV lysis in the\n      following samples.\n    \n        Load the MaxyClear Snaplock microcentrifuge tube with the size bead\n        solution and boost for 45 s.\n      \n        Acquire the size bead solution for 1 min and save the data as NFA file.\n      \n        Unload the MaxyClear Snaplock microcentrifuge tube with the size bead\n        solution.\n      \nRepeat the washing steps (51–53).\n        Load the MaxyClear Snaplock microcentrifuge tube with filtered DPBS and\n        boost for 45 s.\n      \nAcquire PBS for 1 min and save the data as NFA file.\nUnload the MaxyClear Snaplock microcentrifuge tube with PBS.\nRepeat the washing steps (51–53).\nNote: The NanoFCM is now ready for data\n      acquisition of your samples.\n    \n        Load the MaxyClear Snaplock microcentrifuge tube with the sample and\n        boost for 45 s.\n      \nAcquire the sample for 1 min and save the data as NFA file.\nCritical: event should not exceed",
    "12000 events/min otherwise swarming effects occur. You may need to dilute\n      your sample with DPBS to not exceed this limit (see\n      troubleshooting problem 4[href=https://www.wicell.org#troubleshooting]).\n    \n        Unload the MaxyClear Snaplock microcentrifuge tube with the sample.\n      \n        Repeat the washing steps (51–53) before measuring the next sample.\n      \nNote: if particle concentration is too low\n      this could mean that your sample is too diluted or that the sample line\n      has been clogged (for advice on the latter see\n      troubleshooting problem 5[href=https://www.wicell.org#troubleshooting]).\n    \n        After the last sample: Load again the MaxyClear Snaplock microcentrifuge\n        tube with the QC bead solution and boost for 45 s.\n      \n        Acquire the QC bead solution for 1 min and save the data as NFA file.\n      \nNote: Check that the recording of the QC\n      bead solution is comparable to the initial acquisition.\n    \nWhen done, shut down NanoFCM.\n        Your browser does not support HTML5 video.\n      \n          Methods video S1. Demonstration of sample loading (e.g., QC bead\n          solution), related to Step 4 (point 5)\n        \nNano-flow cytometry: Data analysis (step 5)\nTiming: 1–2 h\n      This part of the protocol describes the analysis of particle and size\n      measurements by nano-flow cytometry. Data analysis is performed with the\n      NanoFCM software NF Profession version 1.15/1.17 (see\n      Methods video S2[href=https://www.wicell.org#mmc2]).\n    \n        Load the data to be analyzed into the NanoFCM NF Profession software by\n        opening the entire folder.\n      \nNote: All files to be analyzed should be\n      located in the same folder.\n    \nCritical: The name of the folder with\n      data files should not include any dots, as otherwise the file will not be\n      opened.\n    \nOpen the file with the acquired QC beads.\n        Automatically set the side scatter threshold for the QC beads by\n        clicking on “AUTO” (Auto-threshold).\n      \nClick on “Count STD” to set the standard.\nNote: the QC beads serve as the\n      concentration standard for acquired particles.",
    "Open the file with the acquired size beads.\n        Automatically set the threshold by clicking on “AUTO”\n        (Auto-threshold).\n      \nNote: If required, manually alter the\n      baseline to reduce for background signals for each channel using the\n      “Signal Processing Control” tab. Usually the side scatter channel\n      intensity is set to 35 when blank level of the side scatter channel\n      intensity is ∼70.\n    \n        To generate a size calibration curve, open the calibration panel “Size MESF” and choose the S16M-exo standard to fit the curve. Click on “find\n        peak”.\n      \nOpen the file with the acquired DPBS sample.\n        Automatically set the threshold for DPBS by clicking on “AUTO”\n        (Auto-threshold).\n      \nNote: The DPBS sample serves as the blank\n      control and is used to subtract unspecific background.\n    \n        Click on “Count Blank” to set the background and save the DPBS\n        background (size distribution window “B”) to the settings.\n      \n        Open the file with sample data and subtract the saved DPBS background\n        from the sample with blank correction (size distribution window\n        “BC”).\n      \n        The quantified data is now present as a size and concentration report.\n      \n        There are different options for file export:\n        \n            Export the file as PDF report, which includes information about\n            sample size distribution (nm) and the particle concentration\n            (particles/mL).\n            \n                Make sure to adjust the concentration of the beads by the\n                concentration of the QC beads you used by clicking into the\n                window. Enter your sample dilution to get the final particle\n                concentration displayed.\n              \n            Save the files as FCS files, which allows you to import the files to\n            alternative programs such as FlowJo for subsequent analysis.\n          \nCritical: The FCS files are exported\n      with the threshold that has been applied to the data. Data points below\n      the threshold will be lost.\n    \nCritical: Samples including blank\n      control must be acquired with the same instrument settings and thresholds\n      set during analysis.",
    "Your browser does not support HTML5 video.\n      \n          Methods video S2. Overview of the analysis workflow, related to Step 5"
  ],
  "subjectAreas": [
    "Cell Separation/Fractionation",
    "Health Sciences",
    "Flow Cytometry",
    "Cancer",
    "Proteomics",
    "Cell Culture",
    "Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}