{
  "id": 2924,
  "origin_website": "Cell",
  "title": "Chromatin immunoprecipitation with mouse adipocytes using hypotonic buffer to enrich nuclear fraction before fixation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFixation of differentiated adipocytes\nTiming: 1 h\n      Many protocols suggest adding formaldehyde directly to the culture dish to\n      fix the cells. However, if the cells are differentiated adipocytes, this\n      will result in contamination of many lipid droplets in ChIP samples, which\n      will interfere with immunoprecipitation efficiency. To minimize the burden\n      of lipid droplets such as reduced sensitivity and increased non-specific\n      signals, the author developed a protocol to enrich the nuclear fraction\n      and reduce the lipid content by using hypotonic buffer before fixation.\n      Hypotonic buffer is commonly used for nuclear enrichment in many\n      experiments including ATAC-seq (Assay for Transposase-Accessible Chromatin\n      coupled with high-throughput sequencing).5[href=https://www.wicell.org#bib5]\n        Aspirate culture media, wash the cells with PBS (20°C–25°C), and\n        aspirate PBS.\n      \n        Add pre-warmed 0.05% trypsin to the dish (1 mL for a 10 cm dish),\n        incubate for 3 min in the incubator, and collect the cells into 50 mL\n        corning tubes with culture media (9 mL for a 10 cm dish).\n      \n        Count the cells with a hematocytometer. Usually, the author uses two to\n        five 10 cm dishes to obtain approximately 1 × 107 to\n        2 × 107 differentiated adipocytes.\n      \n        Centrifuge at 440 × g, 4°C, for 5 min. Adipocytes will form loose\n        pellet.\n      \nSuspend the cells in 5 mL of ice-cold PBS.\nCentrifuge at 440 × g, 4°C, for 5 min.\n        Suspend the cells in 5 mL of ice-cold hypotonic buffer with protease\n        inhibitor.\n      \n        Incubate at 4°C for 10 min. During the incubation, gently shake the\n        corning tube by hand a few times.\n      \n        Add 135 μL of 37% formaldehyde to achieve a final concentration of 1%\n        and incubate at 20°C–25°C for 7 min and 30 s on a rotary shaker. During\n        the incubation, gently shake the corning tube by hand a few times.",
    "To quench the fixation reaction, add 270 μL of 2.5 M glycine to achieve\n        a final concentration of 125 mM, then incubate at 20°C–25°C for 5 min on\n        a rotary shaker. During the incubation, gently shake the corning tube by\n        hand a few times.\n      \nCentrifuge at 440 × g, 4°C, for 5 min.\n        Transfer the pellet to a 1.5 mL tube with 500 μL of ice-cold PBS with\n        protease inhibitor.\n      \nCentrifuge at 5,800 × g, 4°C, for 5 min.\n        Discard the supernatant, then snap-freeze the 1.5 mL tube with liquid\n        nitrogen.\n      \nCritical: The fixation time is\n      critical for obtaining optimal results, and further optimization might be\n      required depending on your proteins and cell types of interest.\n    \nPause point: You can store the\n      sample at −80°C in a freezer and re-start the experiment at any time.\n    \nLyse the cells and isolate chromatin\nTiming: 30 min\n      In preparation for shearing the chromatin with the sonicator, lyse the\n      cells with two different buffers to isolate chromatin.\n    \n        Resuspend the pellet in 800 μL of ice-cold MC lysis buffer with protease\n        inhibitor, pipetting up and down 10 times but try not to be foamed. The\n        pellet will not dissolve completely.\n      \nIncubate for 10 min on ice.\nCentrifuge at 5,800 × g, 4°C, for 5 min.\n        Discard the supernatant and resuspend the nuclei in 600 μL of ice-cold\n        SDS lysis buffer with protease inhibitor. Pipetting up and down 10 times\n        but try not to be foamed. The pellet will not dissolve completely.\n      \n        Transfer to a new 1.5 mL tube. If you are going to compare different\n        samples with different cell counts upon sample harvesting (step 3 in\n        this protocol), adjust the count in this step by using ice-cold SDS\n        lysis buffer with protease inhibitor.\n      \nIncubate for 10 min on ice.\nSonication to shear chromatin",
    "Timing: 1 h\n      Successful sonication is critical for obtaining optimal results. Shearing\n      DNA to 300 to 600 base pairs is optimal for most proteins and cell types.\n      The settings shown below are the optimized parameters for the Branson\n      Digital Sonifier 450, but different sonicators will require different\n      parameters to obtain good results. Figure 1[href=https://www.wicell.org#fig1] shows the\n      arrangement of the sonicator, beaker and sample.\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2462-Fig1.jpg\n          Figure 1. An illustration showing the arrangement of the sonicator,\n          beaker, and sample\n        \n        Turn on the Branson Digital Sonifier 450. Use the following settings:\n        amplitude, 0.2; pulse on for 0.5 s; pulse off for 0.5 s; time, 20 s.\n      \n        Set the tube in a glass or plastic beaker filled with ice and water, and\n        insert the tip of the probe to approximately 0.5 cm from the bottom of\n        the 1.5 mL tube (the volume is 600 μL).\n      \n        Perform sonication for 5–7 cycles, depending on the proteins and cell\n        types of interest. Be careful not to be foamed.\n      \nCentrifuge at 20,400 × g, 4°C, for 5 min.\nTransfer supernatant to a 15 mL corning tube.\nDilute the sample 10-fold with ChIP dilution buffer.\nCritical: The sonication is critical\n      for obtaining optimal results, and further optimization might be required\n      depending on your proteins and cell types of interest.\n    \nOptional: The size distribution of the\n      sample can be analyzed by DNA electrophoresis using 2.0% agarose gel.\n    \nImmunoprecipitation\nTiming: 8–12 h\n      The authors usually use Protein A and/or G magnetic beads for ChIP\n      experiments. However, some antibodies yield more sensitive and specific\n      results when used in combination with Sepharose beads. If Sepharose beads\n      are used, the sample must be precleared before immunoprecipitation to\n      reduce non-specific binding of any proteins in the sample to the Sepharose\n      beads. Whichever beads are used, a mixture of protein A and G might yield",
    "better results. The author usually use 2–4 μg of antibody for each\n      immunoprecipitation reaction.\n    \nAlternatives: If you use sepharose\n      beads rather than magnetic beads, preclearing is required before\n      immunoprecipitation. Sepharose beads will tend to stick to the sides of\n      the tip upon pipetting, so cut the tip 5 mm from the end to minimize the\n      loss of beads. (1) Add 30 μL of Sepharose beads to the diluted sample in a\n      15 mL tube. (2) Rotate for 30 min at 4°C. (3) Spin at 700 × g for\n      2 min at 4°C. (4) Transfer the supernatant to a new 15 mL tube.\n    \nTake 10% input from the sample and store at 4°C.\n        Divide the sample between several 1.5 mL tubes. Usually, the author use\n        approximately 1400 μL of the sample for each immunoprecipitation\n        reaction in a 1.5 mL tube.\n      \nAdd the antibody of interest to each 1.5 mL tube.\nIncubate for 8–12 h on a rotator at 4°C.\nIncubation with beads\nTiming: 4.5 h\nIncubate the chromatin-antibody complex with magnetic beads.\nAdd 40 μL of magnetic beads to a new 1.5 mL tube.\n        Wash the beads by adding 500 μL of ChIP dilution buffer to the 1.5 mL\n        tube.\n      \n        Place the tube on a magnetic stand for 2 min to separate the beads from\n        the solution.\n      \nDiscard the supernatant.\n        Remove the tube from the stand and repeat the washing with 500 μL of\n        ChIP dilution buffer twice for a total of three washings.\n      \n        Transfer the immunoprecipitation product (incubated chromatin and\n        antibody in the 1.5 mL tube) to the 1.5 mL tube with the washed magnetic\n        beads.\n      \n        Incubate for 4 h on a rotator at 4°C.\n        \nAlternatives: If you use\n          sepharose beads rather than magnetic beads, the beads should be washed",
    "with a Spin-X column. Sepharose beads will tend to stick to the sides\n          of the tip upon pipetting, so cut the tip 5 mm from the end to\n          minimize the loss of beads. (1) Put 40 μL of sepharose beads into\n          Corning Costar Spin-X Centrifuge Tube Filters. (2) Wash the beads by\n          adding 500 μL of ChIP dilution buffer to the tube filter. (3) Spin at\n          700 × g for 2 min at 4°C. (4) Discard the waste, and repeat the\n          washing with 500 μL of ChIP dilution buffer twice for a total of three\n          washings. (5) Transfer the washed sepharose beads to a new 1.5 mL tube\n          with ChIP dilution buffer. (6) Transfer the immunoprecipitation\n          product (incubated chromatin and antibody in 1.5 mL tube) to the 1.5\n          mL tube with the washed sepharose beads. (7) Incubate for 4 h on a\n          rotator at 4°C.\n        \nWashing antibody-beads complex\nTiming: 2 h\n      Extensively wash the antibody-beads complex using multiple buffers with\n      different salt concentrations.\n    \n        Place the tube on a magnetic stand for 2 min to separate the beads from\n        the solution.\n      \nDiscard the supernatant.\n        Remove the tube from the stand and add 600 μL of ice-cold Wash buffer 1\n        (Low Salt Immune Complex Wash Buffer). Make sure that the beads are\n        well-mixed with the wash buffer.\n      \n        Place the tube on a magnetic stand for 2 min to separate the beads from\n        the solution.\n      \nDiscard the supernatant.\n        Remove the tube from the stand and repeat the washing with Wash buffer 1\n        twice for a total of three washings.\n      \n        Repeat steps 40–43 for ice-cold Wash buffer 2 (High Salt Immune Complex\n        Wash Buffer).\n      \n        Repeat steps 40–43 for ice-cold Wash buffer 3 (LiCl Immune Complex Wash\n        Buffer).\n      \n        Add 600 μL of ice-cold TE. Make sure that the beads are well-mixed with\n        the wash buffer.",
    "Place the tube on a magnetic stand for 2 min to separate the beads from\n        the solution.\n      \nDiscard the supernatant.\n        Remove the tube from the stand, transfer the beads to a new 1.5 mL tube\n        with 200 μL of elution buffer.\n      \nAlternatives: If you use sepharose\n      beads rather than magnetic beads, the beads should be washed with Spin-X\n      column instead of magnetic stand. Sepharose beads will tend to stick to\n      the sides of the tip upon pipetting, so cut the tip 5 mm from the end to\n      minimize the loss of beads.\n    \nDigestion and reverse-crosslinking\nTiming: 8–12 h\nPerform proteinase K digestion and reverse-crosslinking.\n        Add 2 μL of 5 mg/mL proteinase K to a final concentration of 50 μg/mL.\n      \n        Rotate both the ChIP sample and the input in a hybridization oven for\n        2 h at 42°C.\n      \n        Rotate both the ChIP sample and the input in a hybridization oven for\n        6–10 h at 65°C.\n      \nAlternatives: in step 52, you can\n      also use a heat block incubator instead of the hybridization oven.\n    \nRNase A treatment and DNA purification\nTiming: 1.5 h\nPurify the ChIP DNA for subsequent ChIP-qPCR and ChIP-seq.\n        Place the tube on a magnetic stand for 2 min to separate the beads from\n        the solution.\n      \nTransfer the supernatant to a new 1.5 mL tube.\n        Add 10 μL of 1 mg/mL RNase A to a final concentration of 50 μg/mL.\n      \nIncubate for 1 h at 37°C.\n        Purify DNA with a QIAquick PCR purification kit. Follow the\n        manufacturer’s instruction (Add 3 M NaOAc to adjust the pH and use 30 μL\n        of EB buffer).\n      \nEvaluation using Qubit, Bioanalyzer, and qPCR\nTiming: 3 h\n      Evaluate the sample using ChIP-qPCR and proceed to ChIP-seq if applicable.\n    \n        Check the concentrations of the samples with a Qubit fluorometer. Follow\n        the manufacturer’s instructions.",
    "Check the size distribution of DNA with a Bioanalyzer and Agilent High\n        Sensitivity DNA kit. The author usually use 1 ng of DNA for this\n        process.\n      \n        Run a qPCR to evaluate signal enrichment. Include the positive and\n        negative control primers.\n      \nOptional: If applicable, proceed to\n      ChIP-seq library preparation. The author usually use 1–2 ng of DNA as a\n      starting material and follow the manufacturer’s instruction of KAPA Hyper\n      prep kit KK8502."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Chromatin Immunoprecipitation (Chip)",
    "Metabolism",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}