{
  "id": 9026,
  "origin_website": "Jove",
  "title": "Utilizing 3D Printing Technology to Merge MRI with Histology: A Protocol for Brain Sectioning",
  "procedures": [
    "All animal handling and procedures described herein were performed in accordance with a protocol approved by the National Institute of Neurological Disorders and Stroke Animal Care and Use Committee. Brains were collected from common marmosets (Callithrix jacchus) induced to develop EAE.11 Brains were stored in 10% formalin for between 3 weeks and one year after euthanasia by transcardial perfusion of 4% paraformaldehyde.\n1. Postmortem MRI Preparation and Acquisition\nMarmoset Brain\nPrepare a workstation with cotton gauze, a 50 ml centrifuge tube, small spatulas, ~30 ml of a fluorinated oil, paraffin, and the marmoset brain.\nFill the tube with the fluorinated oil and gauze to the 20 ml mark. Compress the gauze to remove air bubbles along the way.\nGently dry formalin from the surface of the brain with a paper towel. Insert the brain with the frontal pole toward the bottom of the tube. Carefully secure the brain in the tube using more gauze around the sides to fix its position. Refer to supplementary section 11 for a method of creating an MRI brain cradle for setup of additional MRI scans.\nFill the rest of the tube with gauze and fluorinated oil. Carefully remove air bubbles along the way. Secure the cap and seal the tube with paraffin.\nMark the cap in line with the interhemispheric fissure. Wrap the tube in a paper towel and insert it into the coil with the mark top-center.\nAcquire 2D spin echo T2. Parameters are given in Table 1.\nOpen the 10 anatomical 150 micron T2-weigted acquisitions in Mipav and register to the 6th acquisition.",
    "NOTE: Registration is an optimized automatic registration 3.5D algorithm with 9 degrees of freedom, windowed sinc interpolation, normalized cross correlation cost function, with a Powell's calling Brent's search algorithm. Rotations were sampled from +10° to -10° with coarse rotations incrementing 5 degrees and fine rotations incrementing 1°. Then average the registered images: Utilities, Image calculator-Bulk images, Average.\nHuman Brain\nSeparate the forebrain from the brainstem using a cut at the level of the midbrain.10 The hemispheres can also be separated with a cut down the midline.\nPosition the forebrain in a cylindrical tube with a hemispheric dome at one end and a spout at the other end.\nFill the tube with a fluorinated oil through the spout. Remove air bubbles using gentle suction for ~30 min through the spout.\nAcquire 3D T1-MPRAGE. Parameters are given in Table 1.\n2. Extracting Brain Surface: Mipav 7.2\nOpen the MRI in the coronal orientation.\nSelect Algorithms, Transformation tools, Transform, Resample. Select User defined size and resample to isotropic voxels: 0.1 x 0.1 x 0.1 mm. Save the resampled MRI as Brain_MRI_Resampled. Human: Resample to isotropic voxels 0.3 x 0.3 x 0.3 mm.\nSelect Algorithms, Filters (spatial), Nonlinear noise reduction. Use the default settings, click on OK.\nSelect Displays lookup table and click on the dual threshold button. Drag the slider on the graph to cover the whole brain.\nSelect Algorithms, Segmentation, Threshold, Threshold using min/max. Enter the value located in the bottom left corner of the intensity graph (just below the scale) into the \"Lower limit\" box. Select \"binary\" in for the output image type and uncheck \"invert threshold.\"\nSelect Algorithms, Morphological, Fill holes. Check \"Process in 2.5D.\"",
    "Because this is an MRI of the full brain, there is some empty space between the hindbrain and cortex that needs to be filled. Human brain: skip this step.\n\t\nUsing line VOI, draw in a connection between the hindbrain and cortex on both sides of the brain at the most lateral point. Continue this through the brain.\nSelect VOI, VOI conversion, All to binary mask. Select Utilities, Image calculator. Select OR from the operator dropdown menu and select the brain mask. Select \"Promote destination image type\"\nSelect Algorithms, Morphological, Fill holes. Check \"Process in 2.5D\"\nSave the binary mask as Brain_Model.nii.\nSelect Algorithms, Extract surface (marching cubes). Select mask image, Save as Brain_Model.ply.\n3. Selecting Slice Locations: Mipav 7.2\nIdentify tissue of interest or starting position. Calculate the intended slab thickness. In marmoset brain, counting 30 MRI slices per section, and 5 MRI slices per blade gap, creates 3 mm sections with .5 mm blade gaps, resulting in ~3.5 mm slabs. Human brain: 20 MRI slices per section, and 4 MRI slices per blade gap, creates 6 mm sections with 1.2 mm blade gaps, resulting in ~7.2 mm slabs.\nAt the location of the first blade gap, click on \"box VOI\" and then draw a box over the brain. Click inside of the box to select it. Copy and paste the contour for each MRI slice corresponding to the blade gap.\nSkip ahead by the number of MRI slices corresponding to the section thickness and copy and paste the contour corresponding to the next blade gap. Repeat this process through the brain.\nSelect VOI, VOI Conversion, All to Binary Mask. Save as Blade_Gaps.nii.\nSelect Algorithms, Extract Surface (marching cubes), Mask image, Blade_Gaps.ply.\n4. Creating MRI Blade Map: Mipav 7.2\nOpen the Brain_MRI_Resampled and the Blade_Gaps.nii images.",
    "With the Blade_Gaps.nii image selected, select Utilities, Image Math. Select Promote image type and Multiply. Enter 10,000 as the value.\nSelect Utilities, Image Calculator. Select Add, and then select the Brain_MRI_Resampled image from the image dropdown box. Select Promote destination image type.\nSave this image as Brain_BladeMap.nii.\nBy clicking on the Triplanar view, the locations where the brain will be sliced can be seen in three orthogonal views.\n5. Importing Brain and Blade Gap Surfaces: Netfabb Professional\nSelect Part, Add part. Choose the files Brain_Model.ply and Blade_Gaps.ply\nSelect the brain and click on repair mode. In repair mode:\n\t\nClick on the shell selection button, and then click on the brain.\nClick on the toggle selection button to select the other meshes. Click on Remove to delete the other meshes.\nClick on Apply Repair, and remove the old part.\nRight click on the brain. Select move. Click on the To origin button. Record the XYZ parameters that appear. These translation parameters are needed to maintain the blade positioning set up in Mipav. Click on Translate. Then close the window. (Do not click translate more than once. It will translate again using the same parameters.)\nSelect the Blade_Gaps model. Right click on the part, and select Move. Enter the XYZ values recorded previously in the XYZ parameters boxes. Now click Translate and close the window.\nSelect the Brain_Model model and click on Repair mode. In repair mode:\n\t\nClick on the shell selection button, and then click on the brain.\nRight click and select Smooth Triangles. Enter 4-5 iterations. Check Prevent volume shrinking. Human brain: 1-2 iterations.\nRight click, select Reduce Triangles. Enter 200000 in the target triangle count and click Execute.\nClick on Automatic repair, Default repair. Then Click on Apply Repair\nRight click, Rename. Rename the smoothed brain as Smoothed_Brain_Model.",
    "Select Smoothed_Brain_Model. Right click, Export, STL.\n6. Editing Brain Contours: Meshmixer\nImport the Smoothed_Brain_Model into Meshmixer.\nUse the sculpting and selection tools to make adjustments to the mesh. Edits include:\n\t\nUse Sculpting tools, Robust smooth. Smooth the area corresponding to the line VOIs. Human brain: skip this step.\nSmooth the surface of the cortex that will be face down in the box.\nSmooth away small divots that might have been created in the meshing and editing process.\nSelect Analysis, Inspector, Autorepair all.\nExport the Smoothed_Brain_Model as Smoothed_Edited_Brain_Model.\n7. Creating the Brain Slicer Box: Netfabb Professional\nSelect Part, Add Part. Choose the file Smoothed_Edited_Brain_Model.\nSelect Part, Add Part. Then select the STL file Brain Slicer Parts_Marmoset and click open. Human brain: Brain Slicer Parts_Human (Supplemental code files).\nRight click on the part, and select Extended, Shells to parts. Select each part individually and right click to rename them. (Clicking on the eye next to an object hides it or makes it visible.)Rename the big box Main, the small box Sub, and the cutting box Box_Cutout, the Hexagon shape Blade_Holder_Main, the small flat box Microtome Blade, and the half-tube object Cradle. Human brain: no Blade_Holder_Main, Microtome Blade, or Cradle.\nHide Main, Sub, Blade, Blade_Holder_Main, Microtome Blade, and Cradle and use shift-select to select all six and the Box_Cutout. Only the Box_Cutout and the Smoothed_Edited_Brain_Model should be visible, but the Smoothed_Edited_Brain_Model should not be selected.\nClick and drag the selected parts to adjust the box position relative to the brain.\n\t\nPosition the brain in the center of the box. Postion the brain deep enough in the box to be tightly gripped, but not too deep to create overhangs that prevent proper placement.\nOnce positioned, the brain box contour can be tested for overhangs. Select the Box_Cutout and the Smoothed_Edited_Brain_Model. Select Boolean Operation.",
    "Click on the Smoothed_Edited_Brain_Model to turn it red.\nSelect Boolean Subtraction, and apply the calculations.\nCheck the brain box for overhangs that would prevent the brain tissue from being safely placed into the box. If these overhangs are present, adjust the brain so it is less deep within the box. If the brain is at the desired depth and overhangs are present, refer to supplementary section 10 for a solution for removing the overhangs.\nSelect the Blade_Gaps model. Right click, select Move. Record the position Z value, then close the window. This will be the position of the most posterior blade gap.\nSelect the Blade STL that came from the Brain Slicer Parts. Right click, select Move.\n\t\nSelect Absolute translation. Enter the Z value from the 7.8. For the X and Y Values, enter the corresponding value from the current position parameter boxes\nSelect the Blade STL. Right click, Click Duplicate.\n\t\nCheck Arrange parts. Enter the total number of blades in the total count. Enter the same number into the Z count box. Enter the slab thickness into the Z gap. Click on Duplicate. If the slab thickness was varied, the blades will need to be positioned individually. Duplicate each new blade from the previous (moving from posterior to anterior) with the z gap equal to the section thickness for that section.\nPosition the Microtome Blade parts at exactly the same intervals as the blades in the slicer by repeating step 7.9 and 7.10 for the Microtome Blade. Human brain: skip this step.\n\t\nSelect Microtome Blade along with the Blade_Holder_Main part and select Boolean Operation.\nSelect all the blades in Microtome Blade to highlight them red. Click on Boolean Subtraction, and apply the calculations.\nSelect Repair mode. Perform an Extended repair. Select apply the repair, and remove the old part.",
    "Rename the part Blade Holder. Export the part as STL.\nShift-select Smoothed_Edited_Brain_Model, all of the Blade models created in the previous step, and the Sub and Main. Click on Boolean operation.\n\t\nMake all of the parts except Main red by selecting them and clicking the arrow under the green box to move them to red.\nSelect Boolean Subtraction and then select apply calculations.\nClick on repair mode. In repair mode:\n\t\nCheck the box for overhangs and sharp points. These can be smoothed in Netfabb or Meshmixer.\nClick Automatic repair, Extended repair. Then apply the repair and remove the old part\nRight click on the repaired brain box and rename it Brain Slicer Box. Export as an STL.\n8. Printing the Brain Slicer Box on the Ultimaker 2\nMarmoset Brain: Cura\n\t\nImport the Brain Slicer Box into Cura.\nSelect Rotate and drag the circle to rotate the box so it is flat on the bed.\nAdjust the print settings: 0.1 mm layer resolution, 50% fill density, Raft.\nSelect Save Tool Path to SD card. (Print time ~12 h.)\nImport Blade Holder into Cura and rotate it so the slots are on the sides and the hexagon face is in the XZ or YZ plane.\nDuplicate the object.\nAdjust the print settings: 0.2 mm layer resolution, 20% fill density, Brim.\nSelect Save Tool Path to SD card. (Print time ~3 h)\nHuman Brain: Cura\n\t\nImport the Brain Slicer Box into Cura and rotate as in 8.1.2.\nAdjust the print settings: .2 mm layer resolution, 30-35% fill density, Raft.\nSelect Save tool path to SD card. (Print time ~70 h for single hemisphere box.)\nOn the Ultimaker 2\n\t\nApply a thin layer of glue stick glue to build plate.\nInsert the SD card. Select print and select the part.\n9. Cutting the Brain",
    "Marmoset Brain\n\t\nPrepare a workstation with the fixed brain, the brain slicer, two blade holders, microtome blades, 1 ml of fluorinated oil, flat tweezers, protective gloves, and embedding cassettes.\nPlace new microtome blades into the slots on the blade holders. Make sure the beveled edge of each blade is facing in the same direction. Wear protective gloves when handling microtome blades.\nRemove the brain from formalin and gently dry it.\nPlace the brain into the slicer. A few drops of fluorinated oil can be applied to the brain and slicer to allow for easy positioning. Make sure the brain is firmly in place.\nPosition the blade holders with the blades in the corresponding blade slots.\nPush down on the blade holders firmly and apply slow balance pressure to cut through the brain.\nRemove each slab, one at a time, starting from the front of the brain. It helps to remove the microtome blade in front of a slab before removing the slab itself. Pay close attention to the anterior/posterior orientation of each slab.\nTake pictures of the anterior and posterior surface of each slab. The posterior slabs will most likely contain separate pieces, so pay attention to the orientation of the pieces for embedding. Place each slab into an embedding cassette and put them all into a 10% formalin solution.\nHuman Brain\n\t\nCarefully test the fit of the brain in the box.\nSlice the brain starting from one end using an angled cut, slowly but firmly slicing. Cut the brain through each blade gap.\nRemove each slab one at a time, paying close attention to the number and anterior/posterior orientation of each slab.",
    "Take pictures of the anterior and posterior surface of each slab. Place slabs in sealed 10% formalin bags. Tissue blocks will be cut from the slabs and placed in cassettes for embedding.\n10. Removing Overhangs in Brain Box (Supplementary section)\nPulling out slices: Meshmixer\n\t\nImport the Smoothed_Edited_Brain_Model.\nSelect Edit, Make slices. In Make slices:\n\t\t\nSelect Stacked 3D, Z, enter 1-2 mm thickness. Click Compute. When the slices load, click Accept.\nSelect 1 or 2 slices with large perimeters near the bottom of the cortex. These slices should be below the level of the Sub box.\nExport each of these slices as Brain_Slice_#.\nExtending the slices up to remove overhangs: Netfabb Professional\n\t\nImport the Brain_Slice_# slices.\nDuplicate each Brain_Slice_# (uncheck arrange parts if checked).\nRight click on one copy of each Brain_Slice_# and select Scale.\n\t\t\nUncheck Fixed scaling ratio. Then scale up the brain slice in the Y direction so that it will reach the level of the bottom of the Sub box.\nRename these slices Brain_Slice_Big_#.\nCheck the Y position of the original Brain_Slice_# by right clicking on the part and selecting move. Record the Y position for each of the original Brain_Slice_# slices.\nPerform the calculation: Brain_Slice_# [y position] - (Brain_Slice_Big_# [y size] - Brain_Slice_#[y size])\nSelect each of the Brain_Slice_Big_# individually, right click and select move.\n\t\t\nEnter the value calculated from 10.2.6 in the Y translation parameter box. For the X and Z translation parameters, enter the values located in the current position parameter boxes. Select Absolute Translation. Click on Translate and close the window.\n\t\t\tNOTE: The Brain_Slice_Big_# slices will be subtracted along with the brain and blades when making the box.\n11. Marmoset Brain MRI Cradle for Additional Scanning\nCreating the Brain MRI Cradle",
    "Make sure that the top surface of the Cradle is at the same height as the Box_Cutout. The depth and position of the brain in the cradle should be setup just as it is for the slicer.\nShift-select to select the Smoothed_Edited_Brain_Model and Cradle.\nSelect Boolean operation. Select the brain to highlight it red, then select Boolean subtraction. Then apply the calculations. (Also select the Brain_Slice_Big_# slices if applicable.)\nEnter repair mode to remove any sharp points in the cradle contour as done previously for the slicer. Select Extended repair. Apply the repair, and remove the old part.\nRight click to rename the part MRI Brain Cradle. Select Export, STL.\nPrinting the cradle: Cura\n\t\nImport the MRI Brain Cradle into Cura and rotate it so that the flat part with the brain cutout is face up.\nAdjust the print settings: 0.1 mm layer resolution, 100% fill density, Raft.\nSelect Save tool path to SD card. (Print time ~10 h)\nPrint on the Ultimaker 2 as described in 8.3.\nAcquiring high resolution T2* MRI using the cradle\n\t\nGently dry formalin from the surface of the brain with a paper towel.\nPosition the brain in cradle as described for the slicer.\nSlide the brain and cradle into the 50 ml centrifuge tube. Fill it to the brim with fluorinated oil.\nGently squeeze the tube to allow air bubbles to escape from the brain. Insert the Cap Insert into the inset of the tube cap to prevent air bubbles from forming there. Secure the cap, and seal the tube with paraffin.\nPlace the tube into coil as previously described. 3D T2* parameters are given in Table 1.",
    "Open the 18 anatomical 100 micron T2*-weighted acquisitions in Mipav and register to the 10th acquisition. Registration parameters are the same as in 1.1.7. Average the registered images: Utilities, Image calculator-Bulk images, Average."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}