{
  "id": 12274,
  "origin_website": "Jove",
  "title": "Evaporation-reducing Culture Condition Increases the Reproducibility of Multicellular Spheroid Formation in Microtiter Plates",
  "procedures": [
    "1. Preparation of Agarose-coated Plates\nWeigh 0.75 g of low-melting point agarose and add it to 100 mL of McCoy's 5A medium (with or without phenol red) without serum. Heat the solution in a microwave and swirl every 1-2 min to completely dissolve the agarose. Autoclave the solution to sterilize it.\nCool the autoclaved agarose to about 70 °C and filter it through a 500 mL, 0.22 µm filter top by vacuum filtration in a laminar flow box. Aliquot the 0.75% filtered agarose solution (FAS) into smaller volumes if not using the entire solution at once. Store this ready-to-use agarose solution aseptically in a cold room or 4 °C fridge for up to 4 weeks.\nAttach a small tube with a plastic- or metal-tipped dispensing cassette to a Combi reagent dispenser and prime the cassette with 70% ethanol (EtOH) and then with sterile phosphate-buffered saline (PBS) in a flow box.\nPrior to use, heat a stored aliquot of FAS in the microwave to melt it. Prime the dispensing cassette with agarose solution and coat 384-well, tissue culture (TC)-treated \"special\" microplates with 15 µL of FAS. Allow the agarose in the plate to cool for 15-20 min before seeding the cells. Store the agarose-coated plates aseptically, wrapped in a polyethylene bag in a cold room or at 4 °C and away from direct light.\n\tNOTE: Avoid repeated heating of the 0.75% FAS to prevent a change in the concentration of agarose in the stock solution. Agarose-coated plates can be stored for up to 2 weeks when stored under the above-mentioned conditions. The FAS does not require heating during the coating of plates.\nClean the dispensing cassette by priming it with 70-80 °C sterile water to remove any remaining agarose in the cassette tips and tubes.\n2. Cell Culture and MCTS Formation",
    "Culture human colorectal carcinoma HCT116 cells, as described previously8.\nRemove the required number of agarose-coated, 384-well, TC-treated microplates from cold storage and equilibrate them to room temperature (RT) for 15 min.\nPrepare the Combi reagent dispenser for cell seeding by priming a standard tube dispensing cassette with 70% EtOH and sterile PBS. Adjust the seeding volume to the required µL and the dispensing speed to medium using the manual setting buttons on the dispenser.\n\tNOTE: The entire cell seeding process is performed under sterile conditions and in a laminar flow box.\nDissociate adherent cells from the tissue culture flask using a recombinant cell-dissociation enzyme. Make a cell suspension stock in a sterile beaker with seed cells at a density of 2.5 x 104 cells/mL per well in 50 µL of complete growth medium. When seeding more than one 384-WP, stir the cells using a magnetic stirrer to prevent them from settling to the bottom of the beaker.\nAllow the plates to rest for 30 min at RT and then centrifuge for 15 min at 4 x g.\nMeanwhile, take an evaporation-reducing environmental lid and fill it with 8 mL of sterile H2O or 5% dimethyl sulfoxide (DMSO) in the short sides (left and right) using a 5 mL pipette (Figure 1A). First, dispense 4 mL of filling liquid into the left-side trough by sweeping the pipette tip slowly up and down. Repeat this step with the right-side trough.\n\tNOTE: Ensure that the liquid added to the side troughs does not merge at the center of the lid, and leave a gap for gas exchange (Figure 1A). Adding an excess amount of H2O results in the seepage of H2O to the exterior of the lid and subsequently into the outer wells of the 384-well TC plates.",
    "Fill the liquid reservoir of the 384-well TC plate with sterile H2O and replace the regular plate lids with the liquid-filled environmental lids (Figure 2A).\nPlace the plates in a 37 °C rotary incubator with 95% humidity, 5% CO2, and 20% O2, and allow the cells to aggregate into MCTSes for 4 days. Avoid opening the incubator door for too long in the subsequent days in order to prevent the humidity level from dropping abruptly.\n3. Medium Exchange Using a Robotic System\nOn day 4 following MCTS formation, add 30 µL of pre-warmed medium per well using an automated microplate washer dispenser. Allow the MCTSes to grow for additional 3 days. Replace the medium regularly every 3 days, until they attain the desired size for experimentation.\nTo aspirate a defined volume of medium from each well, empirically adjust the z-height of the washer manifold. Aspirate 30 µL of medium per well and replace it with 30 µL of fresh, pre-warmed medium.\n\tNOTE: Set the dispensing speed and the speed at which the washer manifold travels down into wells at the lowest rate to minimize turbulence in the wells.\n4. High-content Imaging of MCTS and Semi-automated Image Analysis\nImage the MCTS in a high-content automated imaging system using a 4X air objective (N.A. 16).\nSet the exposure time to 11 ms and the binning to 4 x 4. Adjust the number and spacing of the z-stacks and the pixel binning as desired for the experiment to capture an entire MCTS per well.\nProcess the images stepwise, as described in the \"readme,\" using an in-house routine written in programming language.",
    "NOTE: The .m code and .txt readme files are available as supplementary code files (Figure 1B). The routine measures the MCTS area, major and minor axes, perimeter, and solidity from the 2D images.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55403/55403fig1.jpg\nFigure 1: Preparation of environmental lids and a flowchart of the semi-automatic routine. (A) Image of an evaporation-reducing environmental lid filled with the correct (left) and excess (right) amount of filling liquid (here, 5% DMSO). The arrow indicates the short-side trough for adding liquid. The asterisk shows the gap in the middle of the lid following the addition of the correct volume of DMSO. (B) A workflow showing the steps involved in the semi-automated image analysis routine. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55403/55403fig1large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}