{
  "id": 6676,
  "origin_website": "Bio",
  "title": "Quantification of Nitric Oxide and Reactive Oxygen Species in <em>Leishmania</em>-infected J774A.1 Macrophages as a Response to the <em>in vitro</em> Treatment with a Natural Product Compound",
  "procedures": [
    "In vitro quantification of nitric oxide production by Leishmania-infected J774A.1 macrophage treated with increasing concentrations of TPFPrepare a known concentration of the plant extract using the appropriate solvent. TPF is dissolved in 62.5% pure ethanol, 31.25% sterile distilled water and 6.25% DMSO.Note: The recovery of TPF from extra virgin olive oil was carried out by Centrifugal Partition Extraction (CPE) technique, which is an innovative solid support free separation technique derived from Centrifugal Partition Chromatography (CPC). Briefly, liquid-liquid chromatography was performed using a laboratory scale centrifugal partition extractor FCPE300®, which was equipped with a rotor composed of 7 stacked partition disks engraved with a total of 231 partition cells, while the total volume of the column was 300 ml (Angelis et al., 2017; Koutsoni et al., 2018). Cultivate J774A.1 macrophage in 25 cm2 cell culture flasks with filter cap containing 10 ml of complete RPMI-1640 medium (Recipe 1) at 37 °C under 5% CO2 humidified air.Allow macrophages to reach a high density population of about 70% confluence.Note: J774A.1 macrophages cultured in complete RPMI-1640 medium at 37 °C under 5% CO2 humidified air, usually reach 70% confluence within 3 to 4 days. Then, remove the majority of culture medium with a sterile disposable transfer pipette and leave about 2 ml medium in the flask and detach macrophage monolayer by scrapping cells gently and slowly with a cell scraper at 45° angle.Determine the number of macrophages per ml by differential counting of dead and live cells using the Trypan blue exclusion dye (Recipe 4) in a Malassez counting chamber under an optical microscope.Note: The final dilution of macrophages in Trypan blue dye depends on the density of the culture. Usually, a 1:20 final dilution of macrophages is suitable at the 3rd or 4th day of the in vitro culture.",
    "Seed 5 x 104 J774A.1 macrophages per well in a final volume of 100 μl of complete RPMI-1640 medium in a 96-well flat bottom tissue culture plate under a sterile biosafety cabinet.Incubate the plate for 18 h at 37 °C under 5% CO2 humidified air in order to achieve cell adhesion.Determine the number of Leishmania spp. promastigotes per ml (promastigotes must be in their stationary phase of growth) by differential counting of dead and live parasites using the Trypan blue exclusion dye in a Malassez counting chamber under an optical microscope.Notes:  Leishmania spp. promastigotes usually enter the stationary-growth phase after 3 to 5 days, depending on the Leishmania strain. For example, L. major, a commonly used strain, approximately enters the stationary growth phase at Day 4 when reaches the number of 3.5 x 107 parasites/ml (Nasiri et al., 2013). The final dilution of promastigotes in Trypan blue dye depends on the density of the in vitro parasite culture. Usually, a 1:20 final dilution of promastigotes is suitable at the 3rd or 4th day of the in vitro culture. Additionally, promastigotes have to be fixed with 2% v/v formalin before counting. Seed 7.5 x 105 Leishmania spp. early stationary phase promastigotes in each well (i.e., ratio of 15:1 parasites/macrophage) in a total final volume of 200 μl of complete RPMI-1640 medium.Incubate the plate for 48 h at 37 °C under 5% CO2 humidified air.Then, remove the non-internalized promastigotes by washing thrice with RPMI-1640 medium pre-warmed at 37 °C.Add various increasing concentrations of TPF (5-400 μg/ml) in triplicates and fill in the wells with complete RPMI-1640 medium until the final volume of 200 μl per well.Note: Concentrations of plant extracts may vary depending on the natural product. Add one reference drug (i.e.",
    ", one drug currently subscribed for the chemotherapy of leishmaniasis) in triplicate at the appropriate 50% inhibitory concentration (IC50). Hexadecylphosphocholine (HePC) is used at the concentrations of 0.6 μg/ml and 3.2 μg/ml for L. infantum and L. major respectively, as previously described (Koutsoni et al., 2018).Note: Control triplicates of the equivalent volumes of TPF solvents must also be included. Triplicate of a negative control group must also be included. More specifically, a triplicate of Leishmania-infected J774A.1 macrophages cultured only in the presence of complete RPMI-1640 medium without any drug influence, serves as a negative control group.Incubate the plate for 48 h at 37 °C under 5% CO2 humidified air.Collect culture supernatants and transfer 50 μl of each sample into a new 96-well flat bottom tissue culture plate, as designated in Figure 1. It is also recommended to use again triplicates for each sample.Note: Culture supernatants contain the secreted reactive nitrogen intermediates.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191204/20191204112146_5845.jpgFigure 1. Representative illustration of the 96-well flat bottom plate that Griess assay takes place A sodium nitrite standard curve is required. Place 100 μl of NaNO2 solution (Recipe 5) at concentration of 75 μg/ml at A1 and A2 wells, as designated in Figure 1.Place 50 μl of distilled H2O in B1, B2 etc. until H1 and H2 wells and perform serial dilutions by transferring 50 μl of NaNO2 solution from A1 and A2 to B1 and B2 respectively until H1 and H2, with the use of a multichannel pipette.Note: Discard the excessive 50 μl obtained from H1 and H2 wells. Place 100 μl of Griess reagent (Recipe 6) in both standards and samples subsequently.Notes: Griess reagent must be freshly prepared. When preparing Griess reagent, avoid contact with the bottleneck because this usually contains Griess-positive material that gives an increase in background absorbance.",
    "The final standard NaNO2 concentrations range from 0.195 μg/ml to 25 μg/ml. A quadruplicate that contains only 50 μl of distilled water that serves as blank is also included. Read the plate by using an absorbance microplate reader with excitation at 570 nm.Note: Color change from transparent to pink is immediately noticed. The intensity of the color is greater as nitrite concentration gets higher.In vitro quantification of reactive oxygen species production by Leishmania-infected J774A.1 macrophages treated with increasing concentrations of TPFPrepare a known concentration of the plant extract using the appropriate solvent. TPF is dissolved in 62.5% pure ethanol, 31.25% sterile distilled water and 6.25% DMSO.Note: The recovery of TPF from extra virgin olive oil was carried out by Centrifugal Partition Extraction (CPE) technique, which is an innovative solid support free separation technique derived from Centrifugal Partition Chromatography (CPC), as mentioned in Procedure section, Step A1. Cultivate J774A.1 macrophages in 25 cm2 cell culture flasks with filter cap, containing 10 ml of complete RPMI-1640 medium, as previously described in Step A2.Allow macrophages to reach a high density population of about 70% confluence, as mentioned in Step A3.Then, determine the number of macrophages per ml by differential counting of dead and live cells using the Trypan blue exclusion dye in a Malassez counting chamber under an optical microscope, as already described in Steps A4 and A5.Seed 5 x 105 J774A.1 macrophages per well in a final volume of 500 μl of complete RPMI-1640 medium in a 24-well flat bottom tissue culture plate under a sterile biosafety cabinet (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191204/20191204112218_3347.jpgFigure 2. Representation of the 24-well tissue culture plateIncubate the plate for 18 h at 37 °C under 5% CO2 humidified air in order to achieve cell adhesion.Determine the number of Leishmania spp.",
    "promastigotes per ml (promastigotes must be in their stationary phase of growth) by differential counting of dead and live parasites using the Trypan blue exclusion dye in a Malassez counting chamber under an optical microscope.Notes: Leishmania spp. promastigotes usually enter the stationary-growth phase after 3 to 5 days, depending on the Leishmania strain. For example, L. major, approximately enters the stationary growth phase at Day 4 when reaches the number of 3.5 x 107 parasites/ml (Nasiri et al., 2013). The final dilution of promastigotes in Trypan blue dye depends on the density of the in vitro parasite culture. Usually, a 1:20 final dilution of promastigotes is suitable at the 3rd or 4th day of the in vitro culture. Additionally, promastigotes have to be fixed with 2% v/v formalin before counting. Seed 7.5 x 106 Leishmania spp. early stationary phase promastigotes in each well (i.e., ratio of 15:1 parasites/macrophage) in a total final volume of 1,000 μl of complete RPMI-1640 medium.Note: Infection negative control group is included and is consisted of promastigote-free macrophages. Incubate the plate for 48 h at 37 °C under 5% CO2 humidified air.Then, remove the non-internalized promastigotes by washing thrice with RPMI-1640 medium pre-heated at 37 °C.Add various increasing concentrations of TPF (5-400 μg/ml) and fill in the wells with complete RPMI-1640 medium until the final volume of 1,000 μl per well.Note: Concentrations of plant extracts may vary depending on the natural product. Add one reference drug (i.e., one drug currently subscribed for the chemotherapy of leishmaniasis) in triplicate at the appropriate 50% inhibitory concentration (IC50). Hexadecylphosphocholine (HePC) is used at the concentrations of 0.6 μg/ml and 3.2 μg/ml for L. infantum and L. major respectively, as previously described (Koutsoni et al., 2018).Notes: Control of the equivalent volumes of TPF solvents must also be included.",
    "Three different control groups must be included i) Leishmania spp. infected-macrophages that will serve as treatment negative control, ii) Leishmania spp. infected-macrophages that will serve later as positive control for ROS production and iii) Leishmania spp. infected-macrophages that will serve later in the flow cytometry as the non-labeled sample. Incubate the plate for 48 h at 37 °C under 5% CO2 humidified air.Remove culture supernatants and add 500 μl of PBS 1x solution (Recipe 3) in each well except from the positive control for ROS production where you add 500 μl of 1 mM H2O2 solution (Recipe 7).Note: H2O2 is an inducer of ROS production by the macrophages and therefore is useful as positive control for the ROS production (Ogawa et al., 2004). Incubate the plate for 15 min at 37 °C under 5% CO2 humidified air.Remove the culture supernatant from the positive control group and replace with 500 μl of PBS 1x solution.Add 5 μM of the carboxy-H2DCFDA in each well.Note: In the non-labeled group, avoid adding the carboxy-H2DCFDA. Incubate the plate for 30 min at 37 °C under 5% CO2 humidified air.Remove the culture supernatants and add in each well 500 μl of PBS 1x solution.Detach cells with the use of a cell lifter.Collect one by one cell suspensions and transfer them into a 5 ml round bottom tube each.Note: Tubes containing cell suspensions should be placed on ice during the procedure of the flow cytometric data collection. Analyze the samples in the FACSCalibur."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}