{
  "id": 10637,
  "origin_website": "Jove",
  "title": "Optimized Setup and Protocol for Magnetic Domain Imaging with In Situ Hysteresis Measurement",
  "procedures": [
    "1. Preparation of Specimens for Domain Imaging with In Situ BH Measurement\nMachine two U-shaped parts (Parts A and B) from the steel of interest, as shown in Figure 1, by Electrical Discharge Machining (EDM). Note the difference between the two parts, i.e. 1 mm thicker horizontal part and the 1 mm chamfering in Part A, is designed to ensure a known and needed thickness (1.5 mm in this paper) after the sample (Part A) is mounted and ground (see Figure 1 for the dimensions and procedures 2.1 - 2.4 for more details).\n2. Preparation of Metallographic Samples\nHot-compression mount Part A, preferably using the compounds that produce a transparent mount.\n\tCAUTION: Use the correct amount of compounds to avoid damaging the sample during compression mounting. The final thickness of the mount should be 5 - 10 mm greater than the height of the sample. It is worth noting there might be residual stress caused by the compression mounting, which might then lead to some effects on the domain structure.\n\t\nPlace Part A, with the two legs facing upwards, into the mold of the compression-mounting machine.\nAdd about 20 mL of methyl methacrylate compound powder into the mold.\nStart a mounting cycle with the following parameters: heating time - 4.5 min, cooling time - 4 min, pressure - 290 Bar and temperature - 180 °C.\nTake out the mount when the cycle is finished and check the thickness. It should be between 20 - 25 mm.\nGrind the side of the mounted sample with the two legs of the U-shaped sample facing it using 320 grit SiC paper on a grinding machine until the base of the legs are revealed on the surface.",
    "NOTE: Automated grinding is recommended to ensure the two flat surfaces of the mount are parallel after grinding.\nGrind the other side of the mount and check frequently until the flat part of the U-shaped sample surface shows, grind until the rectangular surface is revealed.\nMeasure the length of the revealed sample using a caliper and continue grinding carefully and measure frequently. The revealed sample length will initially increase with grinding (typically slightly over 23 mm when the initial rectangular shape is revealed). Stop grinding as soon as the length reaches 25.05 ± 0.05 mm. At this point, the polished sample will have the same dimensions as the sensor part (Part B in Figure 1) i.e. 25 mm length and 1.5 mm thickness. This procedure, together with the designed chamfering of the sample (Part A Figure 1), gives the known and needed sample thickness, within a tolerance of about tens of microns, after grinding.\nPolish the sample according to the standard metallographic sample preparation procedures for soft steels 14.\n\tCAUTION: Do not re-grind the sample, as this will change the sample thickness and therefore cause inaccurate BH measurement.\nEtch the polished sample using a cotton swab with suitable reagent (e.g. 2% nital for pure iron or low carbon steel) for 1 - 5 s until the polished surface turns matte.\nCheck the sample under an optical microscope. An effective etching will reveal the microstructure of the sample clearly.\nPolish the sample again using 1 µm diamond polishing agent until the etched surface layer is completely removed. Check under the microscope if not sure.\nRepeat step 2.6 - 2.8 for 4 - 6 times. This removes any work hardened surface layer.\nFinish the polishing using alumina suspension for 2 min.\n\tNOTE: The experiment can be paused here.",
    "3. Preparation of the Flux Density (B) Measurement Coil\nMake the sensor using Part B, shown in Figure 1.\nWrap a layer of double sided tape along base of the U shape (i.e. longest side) of Part B.\nUsing 0.20 mm diameter enameled copper wire, wrap a single layer, 50 turn coil around the longest side of part B, leaving around 100 mm of wire at each end of the coil.\nRemove the enamel from the last 20 mm of each end of the wire using 800 grit sandpaper.\nCheck for electrical short circuits between coil and sample.\nTake a multimeter and set it to test for continuity. Touch one probe to Part B and the other to the end of one wire.\n\t\tNOTE: There should be no continuity between coil and sample, if there is continuity between coil and sample, the wire has shorted to the sample and the coil should be removed and re-applied.\n4. Set Up the Domain Imaging Rig\nInstall/fix the samples on the test rig shown in Figure 2.\nPlace the front plate shown in Figure 2(a) on a flat surface and fit the mounted sample into the hole in the front plate.\nApply hot melt from a glue gun around the circumference of the mounted sample to hold it in place.\nInsert Part B through the excitation coils into the bottom of the sample holder; the sample should protrude from the top of the sample holder by around 1 mm.\nFix the back plate onto the back of the sample holder and loosely tighten the bottom nuts, ensuring that the Hall sensor is aligned with the sample by visual inspection.\nApply exciting current to the excitation coil, which forms an electromagnet, for easy assembly and alignment.",
    "Align the top of Part A with the bottom of Part B, as in Figure 2, with the help of the magnetic force of the aforementioned electromagnet (maximum force felt at perfect alignment) as well as by visual inspection if the sample mount is transparent. Accurate coupling of the Part A and Part B is important to the accuracy of the BH loop measurement. See Discussion for a more detailed explanation.\nBolt the top plate to the sample holder.\nTighten the bottom nuts to apply pressure between Part A and Part B. It is worth noting that overtightening may cause stress within the materials and hence stress-induced effects on the domain structure. The test rig should now look like Figure 2b.\nLevel the sample for a consistently good focusing across the field of vision. This step is highly recommended if an objective lens of 50 times or higher is used and must be done before applying the ferro-fluid.\nPut a piece of modeling clay the size of a cherry onto a clean glass slide.\nPlace the test rig on top of the modeling clay with the sample approximately center aligning with the rig.\nPut three sheets of lens tissue on top of the sample surface for protection.\nLevel the whole test rig using a levelling press for microscopy with the sample approximately center aligned with the press.\n5. Magnetic Domain Imaging\nDilution of oil-based ferro-fluid.\nDraw 1 mL of oil-based ferro-fluid using a pipette and add it to a 5 mL vial.\nAdd 0.5 mL of the original solvent (hydrocarbon oil) for the ferro-fluid into the vial.\nShake for 10 s.\nApplication of ferro-fluid on the sample.\nDraw a single drop (about 0.25 mL) of the ferro-fluid using a pipette and apply on the sample surface.",
    "Put a clean microscope slide on the sample and slowly slide the glass slide off the sample surface to form a thin and uniform layer. A good finish should be semi-transparent with an amber color.\nStatic domain imaging\nObserve the domain pattern under a light microscope before the ferro-fluid dries out. Use ample lighting and a small aperture (by adjusting the aperture diaphragm) for optimal contrast.\n\t\tCAUTION: Avoid exposure of the ferro-fluid to strong light longer than necessary as this may dry the ferro-fluid.\nWipe or rinse with acetone to remove the ferro-fluid after domain imaging.\nClean the sample surface thoroughly and dry the sample after experiments.\nDynamic domain imaging\nAttach a high-speed video camera to the microscope.\nApply a magnetic field to the sample to make the DWs move. The present test rig can be used to apply a field of up to 4 kA/m in parallel with the sample surface. A perpendicular field can be applied using a coil with its axis perpendicular to the surface.\nSecurely fix the sample to the test rig. Apply hot melt around the sample using a glue gun if necessary. The solidified glue can easily be removed after the experiments.\n\t\tNOTE: Steps 5.1 - 5.2 also apply here.\n6. In Situ BH Measurements and Domain Imaging\nConnect up the in situ domain imaging system as shown in Figure 3.\nConnect the sensor excitation coils to the power output of the BH analyzer. We used an in-house BH analyzer developed by the University of Manchester. A detailed description can be found in our previous publication 15.\nConnect the Hall sensor to the H input channel of the BH analyzer.\nConnect the sensor B coils to the B input channel of the BH analyzer.",
    "Connect the H and B outputs of the BH analyzer to two analogue input channels of the Midas DA BNC Breakout box (referred to as DA box hereafter) respectively ensuring that both inputs are set to the ground source (GS).\nConnect the Sync In of the high-speed camera to the Sync Out of the DA box.\nConnect the Trigger of the high-speed camera to the Trigger of the DA box.\nInput the test parameters in the BH analyzer software. The cross sectional area of the sample should be entered in m2; in this case 6 x 10-6 m2.\nSet the data sync parameters as per the instruction of the DA software.\nSet the sync out rate (2,000/s) to be the frame rate (500 frame/s) of the high-speed camera multiplied by the number of data points per frame (4 per frame).\nSet the pre-trigger length (in percentage) to be same as that of the camera.\nSet the high-speed video camera ready for recording. That is, the camera will start waiting to be triggered.\nTurn on the BH analyzer and apply a 1 Hz excitation sinusoidal current to measure the major loop; an image of the BH loop will be displayed.\nCheck that the measured BH loop is roughly as expected in terms of coercive field, remanence, magnetic saturation, etc. If it is not, the mechanical coupling between Part A and Part B should be inspected.\nTrigger the camera either by sending a trigger signal from the BH analyzer or by clicking on the Trigger button on DA software interface.\nStop recording data and video after at least one BH loop cycle in the DA software.\nTurn off the BH analyzer.",
    "CAUTION: Do not keep the electric current running through the sample for a long time especially if a direct current (DC) is used, as the current will heat up the sample and quickly dry the ferro-fluid.\nClean the sample and refresh for future analysis."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}