{
  "id": 6236,
  "origin_website": "Bio",
  "title": "Soluble and Solid Iron Reduction Assays with <em>Desulfitobacterium hafniense</em>",
  "procedures": [
    "Biomass productionAn estimation of the volume of the medium and the number of serum bottles is needed according to the number of bacterial strains to investigate. Include always an abiotic control. To test the ability of the strains TCE1 and LBE of D. hafniense, prepare 3 different bottles of medium (abiotic control, strain TCE1 and strain LBE). For the composition, see recipe point B. Growth medium for D. hafniense.Prepare the inoculum using normal growth medium for D. hafniense and incubate the bacterial strains in standard conditions (30 °C under agitation at 100 rpm) for approximatively 3 days. Final OD600 of the inoculum should be in the range of 0.1-0.15. To verify the OD600, take a 1 ml sample from the culture using a sterile syringe and transfer it to a spectrophotometer cuvette. Measure OD600. Using a sterile syringe, add aseptically 40 ml of inoculum (5%) to 800 ml of growth medium. For this volume, a 1 L serum bottle is required (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180829/20180829032331_1458.jpgFigure 2. Scheme showing the inoculation procedure for the production of the bacterial biomass Incubate the cultures at 30 °C under agitation at 100 rpm until reaching an OD600 between 0.12 and 0.18 for both the strains.Incubation with iron sourcesPrepare the required number of empty 50 ml sterile serum bottles in N2 atmosphere (see Recipe 2). Include triplicates for each iron source, strain used, and abiotic controls. Autoclave.To seal standard serum bottles, insert rubber stoppers and cover them with metal caps with hollow opening. When sealed, the hollow opening allows sampling with syringes during the experiment. Finally, use the seal crimper to tie and fix the metal caps to the serum bottles. For the experiments with strains LBE and TCE1, prepare 18 empty 50 ml sterile serum bottles in N2 atmosphere.",
    "In 9 of the empty bottles add aseptically 1.5 ml of Fe(III)-citrate solution (see Recipes). In the other 9 bottles add aseptically 1.5 ml of akageneite suspension (see Recipes).To test bacterial reduction on corroded coupons, sterilize 9 corroded coupons by spraying a solution of ethanol 70% (v/v), followed by exposure to UV radiation (20 min each side at 254 nm) under sterile conditions. Perform the sterilization procedure inside a biosafety cabinet.Add the 9 coupons in serum bottles with large bottlenecks, seal the bottles, vacuum the headspace and replace the atmosphere using N2 Autoclave.Once all the bottles are autoclaved (Steps B1 and B6), add aseptically 20 ml of either, the sterile medium (abiotic control), or the biomass prepared in Procedure A. The procedure is done for the different iron sources (Fe(III)-citrate, akageneite, iron coupons). These proportions are calculated to obtain a culture with a starting concentration of 10 mM of soluble and solid Fe(III) phases. In the culture amended with the corroded coupons, iron concentration is unknown.To keep bacteria and the iron sources well mixed, incubate the serum bottles at 30 °C under agitation at 100 rpm. Incubate the bottles until a black precipitate is formed (7 days of incubation with D. hafniense). During incubation, the medium changes color from orange/green to black in the cultures amended with soluble Fe(III)-citrate and akaganeite suspension. The formation of black precipitates is an indication of iron reduction. The same phenomenon can be observed in the cultures amended with iron coupons, as the surface of the coupons and medium turn black.During the 7 days of incubation, collect daily 0.5 ml supernatant sample from each treatment and replicate. Make sure to take a representative sample. When the black precipitates form, insert the needle of the syringe in the rubber stopper of the serum bottle.",
    "Overturn the serum bottle. Shake gently and collect 0.5 ml of sample. Transfer the sample into a 1.7 ml Eppendorf tube. To all the tubes, add 50 μl of 5 M HCl.Mix by vortexing for 5 sec and incubate for 15 min at room temperature. This step will allow the dissolution of iron by the acid (HCl) and prevent the oxidation of Fe(II) ions.Freeze all the samples at -20 °C.Validation of iron reductionQuantification of Fe(II) by spectrophotometryThe Ferrozine® reagent will become violet upon reaction with Fe(II). Color intensity is proportional to the concentration of Fe(II). Performing a calibration curve will then allow to quantify Fe(II) content in the samples.Switch on the microplate reader and set the wavelength at 562 nm.Take the standard solutions for the calibration curve from the fridge (see Recipes). Thaw the frozen samples (Steps B9-B12) taken from the cultures before Fe(II) quantification at room temperature.Mix by vortexing for 5 sec.Transfer 10 μl of the reaction mixtures (standard solution or samples) to a 96-well microplate. Note: when taking the samples make sure to mix them well with a vortex before pipetting. Add 90 μl of Ferrozine® reagent to the microplate wells. Do not forget to perform blank samples using the standard growth medium of D. hafniense. Measure absorbance at 562 nm in the following 2 min using the microplate reader. If the absorbance values are higher than the value of the more concentrated sample in the calibration curve (in our case 0.239 nm for the 1000 μM standard), prepare a dilution of the corresponding sample starting from the original sample and repeat the measure from Step C1d. Measure each replicate and perform 2-3 measures for each sample.",
    "Characterization of Fe(II)-biogenic mineralsWhen the cultures become black and a precipitate is observed, remove the coupons from the culture and sterilize them by spraying a solution of ethanol 70% (v/v), followed by exposure to UV radiation (20 min on each side). With the bacterium D. hafniense, coupons can be removed from serum bottles after 7 days.Store the treated coupons under vacuum in a desiccator to avoid changes in the oxidation state of the biogenic minerals produced during the experiment.To study the morphology, the distribution and the elemental composition of the newly formed biogenic minerals, analyze coupons with SEM by simply positioning them inside the microscope chamber. To fix coupons to the sample holder use the carbon tape as illustrated in Figure 3. Observe samples in secondary electrons mode at an acceleration potential of 10-25 keV. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180829/20180829032353_0356.jpgFigure 3. Sample holder with coupons and carbon tape, prepared for the SEM analysis To study the molecular composition of the newly formed Fe(II)-biogenic minerals, perform a Raman spectroscopy analysis directly on the surface of the coupons. To do so, simply position the coupons under the lowest objective and focus on the area to be analyzed. Change the objective and make the focus again until reaching the 400x magnification. Use the following set-up to obtain good quality spectra and to avoid burning of the surface of the sample: laser at 532 nm at power lower than 1 mW (600 g/mm), spectral interval between 100 and 1,600 cm-1 and 1,000 μm hole, 100 μm slit and 5 accumulations of 100 sec."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}