{
  "id": 15219,
  "origin_website": "Jove",
  "title": "CRISPR/Cas9 Gene Editing to Make Conditional Mutants of Human Malaria Parasite P. falciparum",
  "procedures": [
    "Continuous culture of P. falciparum requires the use of human RBCs, and we utilized commercially purchased units of blood that were stripped of all identifiers and anonymized. The Institutional Review Board and the Office of Biosafety at the University of Georgia reviewed our protocols and approved all protocols used in our lab.\n1. Choosing a gRNA Sequence\nGo to CHOPCHOP (http://chopchop.cbu.uib.no/) and select 'Fasta Target'. Under 'Target', paste the 200 base pairs from the 3’ end of the open reading frame (ORF) of a gene and 200 base pairs from the start of the gene’s 3’-UTR. Under 'In', select 'P. falciparum' (3D7 v3.0), and select 'CRISPR/Cas9' under 'Using'. Next, click 'Find Target Sites'.\nSelect a gRNA sequence from the options presented, giving preference to the most efficient gRNA that is closest to the site of modification and that has the fewest off-target sites.\n\tNOTE: Potential gRNA sequences are identified because they are immediately upstream of a Protospacer Adjacent Motif (PAM), which is required for recruitment of Cas9 to DNA. The sequence that is cloned into pMK-U6, the vector that drives gRNA expression, is the 20 bases immediately upstream of the PAM. The PAM specific for S. pyogenes Cas9 is the nucleotide sequence NGG and should not be included in the sequence that is cloned into pMK-U6.\n\tNOTE: CHOPCHOP visually ranks the gRNA sequences, displaying the best options in green, the less ideal options in amber, and the worst options in red. CHOPCHOP gives each gRNA sequence an efficiency score that is calculated using the most up-to-date parameters found in the literature, and they predict off-target sites that could be recognized by the gRNA. Two or three gRNA sequences may need to be attempted to find the gRNA best suited to a particular gene.",
    "Purchase the gRNA sequence and its reverse-complement as Polyacrylamide Gel Electrophoresis-purified oligos. The gRNA sequence used to target PfHSP70x can be found in Figure 1B.\n\tNOTE: This oligo should include 15 base pairs homologous to the gRNA-expressing plasmid, which are necessary for sequence and ligation-independent cloning (SLIC) into the pMK-U6 vector16.\n2. Cloning the gRNA Sequence into pMK-U6\nDigest the pMK-U6 with BtgZI.\nDigest 10 μg of pMK-U6 with 5 μL of BtgZI enzyme (5,000 units/mL) for 3 h at 60 °C. Follow the enzyme manufacturer’s protocol for reaction conditions.\nAfter the 3 h incubation period, add an additional 3 μL of BtgZI to the reaction to ensure complete digestion of the plasmid. Digest for an additional 3 h, still following the manufacturer’s instructions for ensuring the correct reaction conditions.\nTo purify the digested pMK-U6 from the reaction, use a column-based PCR cleanup kit according to the manufacturer’s instructions.\nSeparate the digested DNA using a 0.7% agarose gel and extract the 4,200-base pair band.\nAnneal the oligos containing the gRNA sequence.\nReconstitute the PAGE-purified oligos to a concentration of 100 μM using nuclease-free water.\nCombine 10 μL of each oligo with 2.2 μL of 10x buffer 2 (see Table of Materials). Ensure that the total reaction volume is 22.2 μL.",
    "Run the gRNA annealing program in a thermocycler: Step 1: 95 °C, 10 min; step 2: 95 °C, 1 s, with a reduction in temperature of 0.6 °C/cycle; step 3: Go to step 2, 16 times; step 4: 85 °C, 1 min; step 5: 85 °C, 1 s, with a reduction in temperature of 0.6°C/cycle; step 6: Go to step 5, 16 times; step 7: 75 °C, 1 min; step 8: 75 °C, 1 s, with a reduction in temperature of 0.6 °C/cycle; step 9: Go to step 8, 16 times. Steps 10 to 21: Repeat the procedure used in Steps 4–9 until the temperature reaches 25 °C; step 22: 25 °C, 1 min.\nInsert the annealed gRNA oligos into the BtgZI-digested and gel-purified pMK-U6 plasmid.\nCombine 100 ng of digested pMK-U6 with 1 μL of 10x buffer 2.1 and 3 μL of annealed gRNA oligos. Increase the volume to 9.5 μL with nuclease-free water.\nAdd 0.5 μL of T4 polymerase and incubate the reaction at room temperature for 2.5 min.\nMove the reaction to ice and incubate for 10 min.\nImmediately transform 5 μL of the reaction into competent E. coli according to the bacteria supplier’s instructions. Plate the bacteria on Lysogeny Broth (LB) agar plates containing 100 μg/mL Ampicillin.\nAllow the transformed bacteria to grow at 37 °C overnight, then select colonies and extract DNA with a commercially available plasmid miniprep kit.\n3. Designing Homology Regions of the Repair Template\nDesign shield mutations within the homology repair template to prevent re-cutting of the DNA that is integrated into the genome.",
    "NOTE: A shield mutation typically consists of introducing a silent mutation to alter the PAM so that Cas9 will not induce a break in the repair template. The PAM required for the Cas9 used in this protocol is the nucleotide sequence “NGG”, where “N” is any nucleotide. If possible, change one of the G nucleotides to an A, C, or T.\n\t\nIf the PAM cannot be silently mutated, introduce at least 2 silent mutations into the 6 base pairs directly adjacent to the PAM7,8.\n\t\tNOTE: These mutations will prevent recognition of the repair template by the gRNA and prevent re-cutting of the repaired locus by the Cas9/gRNA complex. The shield mutations can be introduced into the homology region by amplifying the DNA with primers that contain the mutation.\nAmplify the ORF homology region for the repair template.\nUsing PCR, amplify 800 base pairs from the 3’ end of the target gene’s ORF. Design the primers that will be used to exclude the stop codon from this amplicon.\nDesign the primers for insertion of this amplicon into the pHA-glmS that has been digested with SacII and AfeI through either a DNA ligation reaction or SLIC16.\nAmplify the 3’-UTR homology region for the repair template.\nUsing PCR, amplify the 800 base pairs immediately following the stop codon of the target gene. Design primers for insertion of this amplicon into the pHA-glmS that has been digested with HindIII and NheI through either a DNA ligation reaction or SLIC16.\n\t\tNOTE: The high AT content of the P. falciparum genome can make amplification of regions such as UTRs difficult. An alternative approach to using PCR is synthesizing the homology regions.\n4. Cloning Homology Regions into the Repair Plasmid\nInsert the ORF homology region into the pHA-glmS.",
    "Digest the pHA-glmS with SacII and AfeI, according to the enzyme manufacturer’s instructions. Insert the ORF homology region PCR product into the digested plasmid using SLIC16.\nTransform into competent E. coli as performed in steps 2.3.4 and 2.3.5.\nInsert the 3’-UTR homology region into a pHA-glmS plasmid that already contains the ORF homology region (see step 4.1).\nDigest the plasmid with HindIII and NheI according to the enzyme manufacturer’s instructions. Insert the 3’-UTR homology region amplicon into the digested plasmid using SLIC16.\nTransform into competent E. coli and extract the plasmid DNA (steps 2.3.4 and 2.3.5).\n5. Precipitating DNA for Transfection\nAdd 40 μg each of pMK-U6, pUF1-Cas9, and pHA-glmS DNA (for a total of 120 μg of DNA) into a sterile 1.5 mL microcentrifuge tube.\nAdd 1/10th the volume of DNA of 3 M sodium acetate in water (pH 5.2) to the tube and mix it well using a vortex (e.g., if the volume in step 5.1 was 100 μL, add 10 μL of sodium acetate).\nAdd 2.5 times the volume of 100% ethanol to the tube and mix it well using a vortex for at least 30 s (e.g., if the volume in 5.1 was 100 μL, add 250 μL of 100% ethanol).\nPlace the tube on ice or at -20 °C for 30 min.\nCentrifuge the tube at 18,300 x g for 30 min at 4 °C.\nCarefully remove the supernatant from the tube. Do not disturb the pellet.\nAdd 3 times the volume of 70% ethanol to the tube and mix it briefly using a vortex (e.g., if the volume in 5.1 was 100 μL, add 300 μL of 70% ethanol).\nCentrifuge the tube at 18,300 x g for 30 min at 4 °C.",
    "NOTE: This step should be performed under sterile conditions in a biological safety cabinet.\nCarefully remove the supernatant from the tube. Do not disturb the pellet. Leave the tube open and allow the pellet to air-dry for 15 min.\nStore the precipitated DNA at -20 °C until it is needed for transfection.\n6. Isolating Human RBCs from Whole Blood in Preparation for Transfection\nAliquot fresh blood into sterile 50 mL conical tubes (approximately 25 mL per tube).\nCentrifuge the tubes at 1,088 x g for 12 min, with centrifuge brakes set to 4.\nAspirate off the supernatant and buffy coat. Resuspend the RBC pellet with an equal volume of incomplete RPMI.\n\tNote: Incomplete RPMI is prepared by supplementing RPMI 1640 with 10.32 μM thymidine, 110.2 μM hypoxanthine, 1 mM sodium pyruvate, 30 mM sodium bicarbonate, 5 mM HEPES, 11.1 mM glucose, and 0.02% (v/v) gentamicin.\nRepeat steps 6.2–6.3 twice. After the last wash, resuspend the RBCs in an equal volume of incomplete RPMI and store the tubes at 4 °C.\n7. Transfecting RBCs with the CRISPR/Cas9 Plasmids (To Be Done Aseptically)\nNOTE: P. falciparum cultures are maintained as described in other reports17. Maintain all the cultures at 37 °C under 3% O2, 3% CO2, and 94% N2 unless stated otherwise. Whenever blood is used in this protocol, it is referring to the pure red blood cells prepared in step 6. The blood used should not be older than 6 weeks, as there is typically a decrease in parasite proliferation in older blood. The following steps describe pre-loading RBCs with DNA and adding a parasite culture to the transfected cells. Other established transfection protocols are compatible with transfecting these constructs18,19.",
    "Prepare a 1x cytomix buffer in water (120 mM KCl, 0.15 mM CaCl2, 2 mM EGTA, 5 mM MgCl2, 10 mM K2HPO4, 25 mM HEPES, pH 7.6). Filter-sterilize the buffer using a 0.22 μm filter.\nAdd 380 μL of the 1x cytomix to the DNA precipitated in step 5, and vortex to dissolve. Allow the DNA to dissolve in the 1x cytomix for 10 minutes, vortexing every 3 min for 10 s.\nIn a sterile 15 mL conical tube, combine 300 μL of RBCs (50% hematocrit, from step 6) in the incomplete RPMI with 4 mL of 1x cytomix.\nCentrifuge the RBCs from step 7.3 at 870 x g for 3 min, and then remove the supernatant from the RBC pellet.\nResuspend the RBC pellet with the DNA/cytomix mixture from step 6.2 and transfer to a 0.2 cm electroporation cuvette.\nElectroporate the RBCs using the following conditions: 0.32 kV, 925 μF, capacitance set to “High Cap”, and resistance set to “Infinite”.\nFollowing electroporation, transfer the contents from the cuvette to a 15 mL conical containing 5 mL of complete RPMI (cRPMI). Centrifuge the tube at 870 x g for 3 min at 20 °C, and then decant the supernatant.\n\tNOTE: cRPMI is prepared through the same method as incomplete RPMI with the addition of 0.25% (w/v) lipid-rich bovine serum albumin.\nResuspend the pellet in 4 mL of cRPMI and transfer to one well in a 6-well tissue culture plate. Add 400 μL of a high-schizont culture (7–10% schizont parasitemia is ideal) to the transfected RBCs.\n\tNOTE: Parasitemia is defined as the percentage of parasite-infected RBCs.\nThe next day, wash the culture with 4 mL of cRPMI. Centrifuge the culture at 870 x g for 3 min and aspirate the supernatant. Resuspend the culture in 4 mL of cRPMI.",
    "48 h after completing step 7.6, wash the culture with 4 mL of cRPMI. Then resuspend the culture in cRPMI containing 1 μM DSM1 to select for the Cas9 plasmid.\nContinue washing the cultures each day with cRPMI until parasites are no longer visible by blood smear. After this point, replace the culture medium with fresh cRPMI plus 1 μM DSM1 every 48 h.\nTo make a blood smear, pipette 150 μL of culture into a 0.6 mL centrifuge tube. Pellet the cells by centrifugation at 1,700 x g for 30 s.\nAspirate off the supernatant. Use a pipette to transfer the pelleted cells to a glass slide. Using a second glass slide held at a 45° angle to the first slide, smear the blood droplet. Stain the slide using a commercially available staining kit according to the manufacturer’s protocol.\nView the parasites using a 100X oil immersion objective.\nBeginning 5 days post-transfection (step 7.6), remove 2 mL of the culture with RBCs resuspended in the culture medium. Add back 2 mL of fresh medium (cRPMI plus 1 μM DSM1) and blood at 2% hematocrit. Add fresh blood in this manner once a week until parasites reappear, as determined by thin blood smear (step 7.11).\n\tNOTE: If integration is successful, parasites generally reappear in the culture by one-month post-transfection.\nOnce parasites reemerge, remove DSM1 drug pressure. Alternatively, remove drug pressure after parasites have been cloned out.\n8. Checking Parasites for Integration of the Repair Template\nWhen parasites are visible again by thin blood smear, isolate DNA from the culture using an appropriate kit.\nUse PCR to amplify the modified region of the genome to determine if the targeted locus has been successfully altered and if the unmodified wild-type locus (indicative of wild-type parasites) is detectable.",
    "To detect parasites that have integrated the repair template, use a forward primer that sits at the beginning of the ORF, outside of the cloned homology region. Use a reverse primer that sits in the 3’-UTR.\n\t\tNOTE: As this amplification includes the sequences of the HA tags and glmS ribozyme, amplicons from integrated parasites will be longer than the same region amplified in wild-type parasites.\n9. Cloning Parasites by Limiting Dilution\nPerform serial dilutions of the parasite culture from step 7.13 to achieve a final concentration of 0.5 parasites/200 μL. Add 200 μL of the diluted culture to the wells of a 96-well tissue culture plate.\n\tNOTE: Because parasitemia is defined as the percentage of infected RBCs and the hematocrit is also a defined number (2%), the number of parasites per unit volume is easily inferred.\n\t\nPrepare 1 mL of culture in cRPMI at 5% parasitemia and 2% hematocrit (at these parasitemia and hematocrit levels, the culture contains 1 x 107 parasites/mL).\nDilute this culture 1:100 with cRPMI. Dilute again 1:100 with cRPMI.\nDilute 1:400. Perform this dilution by adding 62.5 μL of culture to 25 mL of cRPMI and 1 mL of blood. This dilution results in the desired concentration of 0.5 parasites/200 μL.\nMaintain the cloning plate until parasites are detectable in the wells.\nEvery 48 h, replace the medium in the 96-well plate with fresh medium.\nOnce a week, starting 5 days after beginning the cloning plate (step 9.1), remove 100 μL from each well and add back 100 μL of fresh medium + blood (2% hematocrit).\nIdentify any wells containing parasites.\nPlace the 96-well plate at a 45° angle for approximately 20 min, allowing the blood to settle at an angle within the plate.",
    "Place the 96-well plate on a light box. Notice that the wells containing parasites contain media that is yellow in color, compared to the pink media of parasite-free wells, due to acidification of the medium by the parasites.\nUsing a serological pipette, move the contents of the parasite-containing wells to a 24-well tissue culture plate to allow expansion of the parasitemia.\nUsing PCR analysis as described in step 8, check these clonal parasite lines for correct integration.\n10. Knockdown of the Protein by Treating Parasites with Glucosamine and Confirmation via Western Blot Analysis\nPrepare a 0.5 M GlcN (glucosamine) stock solution, which can be stored at -20° C.\nAdd GlcN to the glmS parasite cultures and allow them to grow in the presence of GlcN.\n\tNOTE: The final concentration and timing of GlcN treatment depends on the experiment and parasite line. GlcN can impact parasite growth, so the parental parasite strain should be exposed to a range of GlcN concentrations to determine its sensitivity to the compound. Often, a concentration of 2.0-7.5 mM GlcN is used13,14,20.\nIsolate protein samples from the GlcN-treated parasites13.\nUse protein samples for western blot analysis to detect reductions in the protein13.\nUse an anti-HA antibody according to the manufacturer’s instructions to detect the HA-glmS-tagged protein. Compare the HA band to a loading control, such as PfEF1α.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}