{
  "id": 10413,
  "origin_website": "Jove",
  "title": "Use of Micro X-ray Computed Tomography with Phosphotungstic Acid Preparation to Visualize Human Fibromuscular Tissue",
  "procedures": [
    "All cadavers utilized in this study were legally donated to the Surgical Anatomy Education Centre at Yonsei University College of Medicine.\n1. Obtaining samples\nDraw an incision line on the cadaver with a colored pencil to indicate the cutting area for sample harvesting. Check that the incision line drawn extends medially to a medial canthus, laterally to a lateral canthus, superiorly to a superior border of the lower eyelid, and inferiorly to 1 cm below the line from the orbital rim.\n\tNOTE: Consider the sample size based on the maximum scanning size of the micro-CT equipment (our equipment could acquire an image with a maximum object dimension of 7 × 7 cm). Here, a sample approximately 1 cm in width, 3 cm in length, and 1.25 g weight was harvested from the ORL region.\nCut the facial tissues following the incision line with a blade. Make sure the cut is deep such that the tip of the blade touches the bone. The sample must include the skin, subcutaneous tissue, muscle, fat, and periosteum.\nFix the sample in 10% formalin immediately and preserve it for 5 to 7 days at room temperature (Figure 1A).\n\tNOTE: Both embalmed and fresh cadavers can be used for this study. However, the fixation solution for cadavers might differ slightly from the solution used in a biological experiment. Therefore, we suggest fixing the sample with 10% formalin again even after obtaining the sample from embalmed cadavers.\n2. Preparation for staining\nAfter fixing, slice the sample into 3 pieces (5–7 mm in thickness). Do not lose the location and direction of each piece during this process.\n\tNOTE: The microCT scanner we use can cover a maximum size of 7 cm³, but the PTA solution cannot penetrate the sample successfully if it is too thick.",
    "Sew the superolateral side of each piece using a needle and black thread such that the direction of the sample can be checked later.\nDehydrate the sample in a series of 30%, 50%, and 70% ethanol solutions for 1 day each.\nPlace the sample in 70% ethanol until staining.\n3. PTA preparation\nBegin the PTA staining process 1 week before microCT scanning is scheduled.\nPrepare 210 mL of 70% ethanol solution and add 2.1 g of PTA power to it. Mix well using a shaker at 55-60 rpm.\n\tNOTE: The concentration of the PTA solution should be 1% in ethanol.\nPrepare three 70 mL plastic containers for each sliced piece. Fill the containers with the PTA solution. Soak the specimens into the containers and place them on a shaker for effective penetration. Leave the samples for 5–7 days (Figure 1B).\nWhen the staining is completed, store the sample in 70% ethanol to prepare for scanning.\n\tNOTE: The stained samples can be maintained for several months, but it is recommended that the samples be scanned as soon as possible to ensure full staining.\n4. MicroCT scanning\nWrap the sample with parafilm to prevent drying. Do not wrap the samples too tight, as that may lead to deformation.\nOpen the scanner and place the sample on the tray (Figure 2).\nSet the scanning parameters as follows: source voltage (kV) = 70, source current (μA) = 114, Al filter = 0.5 mm, image pixel size (μm²) = 20, pixels = 2240 × 2240, exposure (ms) = 500, rotation step (deg) = 0.3.\n\tNOTE: The parameters may be modified according to the samples and/or scanners used.\nStart scanning.\n\tNOTE: Scanning takes 30 to 60 min depending on the intended resolution and the speed of the scanner.\n5. Reconstruction and optimization of data",
    "Run the reconstruction software. Select Open Dataset on the Actions menu to launch the scanned files.\nSelect the Settings tab on the Reconstruction window. Set the parameters as follows: Ring artifacts reduction = 7, Beam-hardening correction (%) = 40.\n\tNOTE: The parameters can be modified according to the sample.\nBegin reconstruction by selecting Start on the Start tab. The final data will be stored in the designated folder.\nRun the file resizing software. Select Source data set to launch the reconstructed files.\nSelect jpg on the Destination data set tab.\nChoose the Resizing option 1/2 with a Quality option of No interpolation (fast).\nAdjust the slide bar to 100 (highest) in the Image compression tab. Start converting.\n\tNOTE: The resizing option is to avoid slowing down the computer speed when 3D rendered; however, it can result in lower resolution when resized extensively. We suggest resizing in half for acceptable resolution with better handling.\n6. 3D reconstruction\nRun the 3D volume rendering software.\nSelect Actions > Load volume data to launch the dataset.\nAdjust the brightness and contrast level by modifying shape transfer function in histogram in the Transfer Function Editor tab.\nSelect Options > Lighting.\nSelect Shadows and Surface Lighting icons. These effects provide a realistic modeling tone.\nFind the best view by moving (click and drag), rotating (right-click and drag), and zooming in or out of (scroll) the model.\nSlide the plane (shift + click and drag in the inner direction) to show the sectional images (Figure 3).\nTurn on Light icon. Adjust the lighting indication bar and find the best lighting for viewing. Then, turn off the icon and close the Lighting tab.\nSelect Options > Show > Clipping Box to hide the box for the final image.\nSelect Actions > Save image to store the image.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}