{
  "id": 6665,
  "origin_website": "Bio",
  "title": "<em>Leishmania</em> Parasite Quantification by Bioluminescence in Murine Models",
  "procedures": [
    "Preparation of luciferase-expressing transfectants of Leishmania guyanensis (Lgy) parasites Note: The parasites are derived from the parental strain Lgy M4147 (MHOM/BR/75/M4147) and express firefly luciferase (5 x 107 photons/sec/106 parasites) from a LUC gene integrated stably into the small subunit of the ribosomal RNA locus (Lye et al., 2010). Stock parasites are maintained in liquid nitrogen. When starting from a frozen vial, thaw the parasites quickly by immersing the vial in a water bath at 26 °C. Transfer the parasites to a 15 ml tube and add 5 ml of Schneider medium (incomplete), resuspend and centrifuge at 2000 x g for 8 min at 26 °C. Remove the supernatant, resuspend in 5 ml of complete parasite culture medium and transfer into a 25 cm2 flask. Incubate at 26 °C and 5% CO2. The parasites were passaged in culture for not more than five passages. The parasites are isolated from mouse footpads to maintain their virulence and avoiding purification of metacyclic promastigotes and thus diminishing the risk of LPS contamination which could occur during purification and would activate the innate immune response and possibly affect read-outs.Dilute 100 μl of parasites (around 5 x 106 parasites) in 10 ml of complete parasite culture medium using 25 cm2 flask (Recipe 1). Incubate the parasites for 6 days at 26 °C and 5% CO2.At Day 6 of culture, verify that the parasites are in stationary growth phase (Figure 1).Note: Parasites are counted every day, once they reach their stationary phase, they are used for mice infection. Count the parasites:Remove 10 μl of the parasite culture and transfer it to a 1.5 ml microcentrifuge tube containing 990 μl of parasite fixative solution (Recipe 5).Wait for 3 min.Take 10 μl and place in the counting chamber.Count the parasites using an inverted microscope with 20x objective.",
    "Adjust parasite number to 20 x 106/ml in DPBS.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191114/20191114002938_5173.jpgFigure 1. Lgy parasites after 6 days in culture. Representative images of parasites in stationary phase forming large clumps, also known as “rosettes”. A. 10x objective without zoom. B. 10x objective with 4x zoom. Bright-field images using confocal microscope. The scale bar represents 20 μm.Mice infection with Lgy parasitesNotes:All mice handling steps are performed in clean conditions under a laminar flow hood. We use C57BL/6 because they show a healing phenotype and therefore less gravity on the mice and even with a darker tissue, light transmission can be measured (Ives et al., 2011).  Parasites are directly inoculated into the mice after adjusting to 20 x 106 parasites/ml. Injection of parasites can be performed in one or both footpads without any difference. Slightly anesthetize the mice:Fill the isoflurane tank (Video 1, part 1). Switch on the O2 concentrator.Set the adjusting knob of the Combi-vet Anesthesia machine at 3% of isoflurane concentration.Switch on the flowmeter connected to the induction chamber.Transfer the mice to the induction chamber and slightly anesthetize them.Inject subcutaneously 50 μl of parasites at 20 x 106/ml in one, or both, hind footpads per mouse using U-100 insulin syringe (final Lgy concentration: 106 parasites per footpad). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Luciferin injection and image acquisition demonstration. The video demonstrates how to use the isoflurane anesthesia system, injection of luciferin in mice (Step C2), mice anesthesia and transfer to SPFC chamber (Step C3) and image acquisition using the In-vivo Xtreme II system (Step C4). (All animal protocols in this publication were approved by the Swiss Federal Veterinary Office (SFVO), under the authorization number 2113.",
    "Animal handling and experimental procedures were undertaken with strict adherence to ethical guidelines set out by the SFVO and under inspection by the Department of Security and Environment of the State of Vaud, Switzerland.)Parasite burden quantification by Bioluminescence using In-Vivo Xtreme IIParasite burden can be determined either immediately after parasite infection or along the time-course of the experiment. 5 mice at a time can be imaged.Start the In-Vivo Xtreme II system and set up the Bioluminescent protocol.Switch on the apparatus.Wait for 2 min before starting the computer.Once the computer is on, access the MI software and select Capture Xtreme BI 4MP.Allow the camera to reach its working temperature of -90 °C. The CCD Operating Temperature box will change from red to green when the camera is ready to use.Note: The duration of this step is approximate 10 min. Input predetermined capture parameters (Table 1) (see Note):Table 1. Capture values for the different modalities. Modality: imaging modes available in the In-Vivo Xtreme II (fluorescence, luminescence, X-Ray and reflectance). Exposure time: duration of time the camera collects light (seconds, minutes). Mode: way the camera captures the image. kVp: maximum tension applied across an X-Ray tube. Binning: process of combination of neighboring pixels on an image sensor into one “super pixel”. fSTOP: aperture of the diaphragm of the camera. FOV: Field of view. Focal plane: focus. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191114/20191114003328_8441.jpgSave the parameters in Step C1e as individual session files.Create a protocol by selecting the Create/Edit Protocols button from the system interface acquire window.Select the previously luminescence session file as Step C1. Next, select the corresponding X-Ray session file as Step C2. Finally, choose the reflectance session file as in Step C3. Keep–Do nothing–in both Before and After Image Capturer in the 3 Steps of the protocol.Save the protocol.",
    "Injection of luciferin solution in mice (Video 1, part 2)Inject intraperitoneally 200 μl of luciferin solution (Recipe 6) at a final dose of 150 mg/kg/ mouse using U-100 insulin syringe (see Note).Wait for 10 min after luciferin administration before starting image acquisition.Note: Mice are not anesthetized during luciferin injection. Light of the laminar hood is turned off during injection of luciferin in mice. Isoflurane anesthesia and transfer to the SPFC chamber (Video 1, parts 3, 4, 5 and 6) 6-7 min after injection of luciferin in mice.Repeat Procedure B for mice anesthesia using the induction chamber. Transfer the anesthetized mice to the individual nosecones of the SPFC chamber connected to the isoflurane system (Figure 2A). Introduction of SPFC chamber into the In-Vivo Xtreme system and image acquisition (Video 1, parts 6, 7 and 8) 10 min after injection of luciferin in mice.Switch on the isoflurane system connected to the imaging system.Insert the SPFC chamber to the In-Vivo Xtreme machine.Connect all the isoflurane pipes to the SPFC (Figure 2B).Execute the previously saved protocol (Step C1i) by clicking Execute Protocol button from the main acquire window interface. During the execution of the protocol, notice a status window providing real time report of the current capture, the exposure duration as well as the protocol step.After image capture, remove the SPFC chamber from the imaging system and switch off the isoflurane system.Transfer the anesthetized mice to their cage and monitor the animals until they are fully recovered. Open the acquired images in the MI software for visual inspection and region of interest (ROI) analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191114/20191114003422_7828.jpgFigure 2. SPFC chamber. A. SPFC chamber connected to the isoflurane system for introducing the anesthetized mice. B. SPFC chamber at the Xtreme II system connected to the isoflurane system."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}