{
  "id": 4692,
  "origin_website": "Bio",
  "title": "Human, Bacterial and Fungal Amplicon Collection and Processing for Sequencing",
  "procedures": [
    "Sample collection   Add 100 μl of yeast cell lysis buffer to a 2 ml safe-lock tube.    Open the swab pack, pre-moisten swab in lysis buffer, and then swab the selected skin site with the swab for 10 sec. For high-resolution skin sampling, a 4 cm2 skin area is swabbed. Then return the swab to lysis buffer and with sterile scissors, cut off the swab so that the top is even with the swab stem so that it will fit in the tube. If the swab is cut too short, recovery during the DNA extraction step is more difficult. Collect a negative control by waving a pre-moistened swab in the air, then placing into the lysis buffer.   Samples in lysis buffer can be stored at -80 °C prior to processing. While it is unknown whether samples are stable indefinitely, good results have been obtained from samples frozen for several years.      DNA extraction   Clean bench and centrifuge with 70% ethanol and 10% bleach. UV-treat pipettes and tube racks for 30 min prior to use.   Thaw tubes for 10 min at 37 °C on heated shaking block.   Short spin tubes, then open and add 1 μl of ReadyLyse and 250 μl of Yeast Cell Lysis Solution.   Incubate tubes for 60 min at 37 °C on heated shaking block.   During this time, UV-treat for 30 min an appropriate number of Promega IQ Spin baskets and stainless steel beads, for example by placing them in a sterile, covered petri dish. Also UV-treat a pair of tweezers.    After incubation, short spin tubes.    Pick up a Promega basket with tweezers one hand, open a tube with the other hand. Take the basket with the other hand and then use the tweezers to pick up the tip of the swab.",
    "While holding the swab, place the basket into the tube, then replace the swab into the tube+basket. Between samples, wipe the tweezers well with a paper towel soaked with 70% ethanol.   Place the open tube + basket + swab into a centrifuge and short spin to collect excess buffer. Remove basket + swab and discard.    With tweezers wiped down with 70% ethanol, open the tube and add two 5-mm stainless steel beads to each sample taking care not to touch the tweezers to the tube. Close tubes and load tubes into the QIAGEN bead beater adaptor and balance. Beat for 2 min at 30 Hz.   Removed tubes and incubate for 30 min at 65 °C on heated shaking block.    Place on ice for 5 min. Short spin tubes.    Add 150 μl Epicentre MPC Reagent. Vortex tube 10 sec, then spin 10 min. In the meanwhile, label a fresh set of 2 ml Eppendorf tubes.    Transfer the supernatant, being careful not to disturb the pellet at the bottom of the tube, to the fresh tube and add an equal volume of 100% EtOH. Mix by inverting several times.    Set up PureLink Genomic DNA Mini Kit genomic DNA extraction columns with their collection tubes according to manufacturer’s instructions. Apply sample to the extraction column. Spin at maximum speed for 1 min. Remove flow-through and repeat if sample remains. Place column into a fresh collection tube.   Wash column with 500 μl Buffer 1, spin at maximum speed for 1 min, discard flow-through, and place column into a fresh collection tube.   Wash column with 500 μl Buffer 2. Spin at maximum speed for 1 min, discard flow-through, and then spin at maximum speed for 3 min to dry the column.   Discard flow-through and place column in clean safe-lock PCR tube.",
    "Add 25 μl ultrapure PCR water and let stand for 3 min. Spin at maximum speed for 30 sec to elute. Discard column and store eluate at -20 °C.    Resultant genomic DNA is typically quantified according to manufacturer’s instructions with Qubit fluorometric quantitation. Regardless of concentration, 2 μl per sample is used for subsequent amplification.      16S amplification of V1-V3 region for 454 sequencing   Here, 2 μl of eluate per reaction is used, and reactions are performed in duplicate and combined prior to purification. The concentration of the eluate is highly variable depending on sample origin. For example, low abundance skin sites can yield under 1 ng/μl, while high abundance skin sites can yield greater than 50 ng/μl. Primer V1_27F: 5’-AGAG TTTGATCCTGGCTCAG-3’ Primer V3_534R w/ barcodes: 5’-ATTACCGCGGCTGCTGG-3’ Primers to other regions, and sample barcodes, are available online at http://www.hmpdacc.org. [href=http://www.hmpdacc.org/]   To create the premix for two 96-well plates, combine buffer, Taq, forward primer, and water into a 15 ml conical tube and vortex to mix. Keep on ice. All amounts are in μl.   table:",
    "﻿0,1,2\n,1 reaction,110x reactions\n10x Accuprime buffer II,2,220\nAccuprime taq,0.15,16.5\n100 μM Primer V1_27F,0.05,2.2\n2 μM Primer V3_534R with barcode,2,-\nDNA eluate,2,-\nWater (for PCR),13.8,1519.1\n    Aliquot 23 μl of premix into each well of two 96-well plates.    Add the barcoded reverse primer to each well.    Add DNA to each well.    Seal plates with thermofoil, and spin down.    Run the following PCR program:  95 °C, 2 min 30 cycles of: 95 °C, 20 sec 56 °C, 30 sec 72 °C, 5 min Then, 4 °C, forever      ITS1 amplification for 454 sequencing   Here, 4 μl of eluate per reaction is used, and reactions are performed in duplicate and combined prior to purification.  Primer ITS1F: 5’-CCTATCCCCTGTGTGCCTTGGCAGTCTCAGGTAAAAG TCGTAACAAGGTTTC-3’ Primer ITS1R with barcodes: 5’- GTTCAAAGAYTCGATGATTCAC-3’   To create the premix for two 96-well plates, combine buffer, Taq, forward primer, and water into a 15 ml concial tube and vortex to mix. Keep on ice. All amounts are in μl.     table:\n﻿0,1,2\n,1 reaction,110x reactions\n10x Accuprime buffer II,2.5,275\nAccuprime taq,0.2,22\n100 μM Primer ITSF,0.1,11\nWater (for PCR),16.2,2002\n,,\n2 μM Primer ITS1R with barcode,2,-\nDNA eluate,4,-",
    "Aliquot 19 μl of premix into each well of two 96-well plates.    Add the barcoded reverse primer to each well.    Add DNA to each well.    Seal plates with foil plate seals, and spin down.    Run the following PCR program:  95 °C, 2 min 32 cycles of: 95 °C, 30 sec 50 °C, 30 sec 72 °C, 2 min Then, 72 °C, 5 min 4 °C, forever      PCR Clean-up with Agencourt SPRI kit   Spin down plates, then combine V1-V3 reactions into one plate, and ITS reactions into one plate.   Add 72 μl Agencourt Beads to each well, pipetting up and down 10x.   Incubate at room temperature for 5 min to bind DNA to beads.   Place plate on magnet for 2 min to separate beads from solution.   Keeping the plate on the magnet, aspirate cleared solution from reaction plate (take care to avoid aspirating beads on the bottom of the wells), and discard.   Keeping the plate on the magnet, add 200 μl 70% ethanol to each well. Aspirate. Repeat.   Keep the plate open for 5 min to dry beads.    Remove the plate off the magnet and add 25 μl TE, pH 8.0 to the plate. Allow to elute for 1 min.    Place plate back on magnet and allow beads to separate for 1 min.   Transfer eluate to a new plate.      PCR product quantification using QuantIT dsDNA high-sensitivity assay kit   Bring kit components to room temperature.   For two plates, mix 40 ml of QuantIT buffer with 200 μl of QuantIT reagent in a 50 ml conical tube.    Aliquot 200 μl of buffer-reagent mix to each well of two 96 well microplates for fluorescence-based assays.   Add 10 μl of each standard from the kit (8 total standards at 0, 0.",
    "5, 1, 2, 4, 6, 8, and 10 ng/μl) to first two columns on each plate. Standards are read in duplicate and samples a single time.   Add 2 μl of PCR products to wells, leaving a column of blanks between the standards and samples.    Including a 10 sec shake step, measure fluorescence on Thermo plate reader with filter pair 485/538.    Generate standard curve from standards, subtracting background.   Calculate PCR product concentration from standard curve and equation.      PCR product pooling and purification   Pool approximately equal amounts of each PCR product into a single Eppendorf tube. The target ng per sample is determined by the lowest concentration sample (excluding controls). For the lowest concentration sample(s), add the entire PCR product, and for those with higher amounts, add an approximately equivalent amount.   Purify pool with QIAGEN minElute column according to manufacturer’s instructions. Briefly, add 5 volumes of buffer PB to 1 volume of the combined PCR pool.    Apply the sample to the MinElute column that has been placed in a 2 ml collection tube.   To bind DNA, centrifuge 30 sec at maximum speed. Discard flowthrough and place the column back in the same tube.   Wash with 750 μl buffer PE, discard flowthrough, then centrifuge for an additional 1 min.   Place the column into a fresh tube and elute in 30 μl TE (pH 8.0). This final product represents an approximately equivalent concentration of each of the 96 input samples. To ensure quality, one may then quantitate the pooled library according to manufacturer’s instructions with Qubit fluorometric quantitation, or by running 2 μl on an electrophoretic agarose gel or equivalent. For the V1-V3 amplicon, the product size should fall between 450-550 bp.",
    "Single, pooled amplicon libraries in an Eppendorf tubes can then be sent to a sequencing facility for sequencing on a 454 GS FLX (Roche, http://454.com/products/gs-flx-system/index.asp[href=http://454.com/products/gs-flx-system/index.asp]) instrument using titanium chemistry."
  ],
  "subjectAreas": [
    "Microbiology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}