{
  "id": 6082,
  "origin_website": "Bio",
  "title": "Infection Process Observation of <em>Magnaporthe oryzae</em> on Barley Leaves",
  "procedures": [
    "Preparation of M. oryzae (Figure 1)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180502/20180502015321_5064.jpgFigure 1. Preparation procedure for conidia suspension of M. oryzaeInoculate the M. oryzae strains into solid OTA (Recipe 1) plates (6 cm diameter) and incubate for one week in an illumination incubator at 28 °C.Add 2 ml sterile distilled water containing 0.025% Tween 20 (Recipe 2) to each OTA plate and scrape with a spreader to harvest conidia. Use two layers of sterile lens paper to filter and remove hyphal fragments. Upon filtering, brief vortex by pipetting to re-suspend conidia.Note: Tween 20 will help to increase water hydrophobic property, therefore promote the formation of the water drops without collapse.Determine the conidia concentration by using a hemocytometer under an optical microscope, and adjust the final concentration to 1 x 105 per ml of 0.025% Tween 20 sterile water.Preparation of barley leavesPut barley seeds (around 50 seeds) into a Petri dish with an appropriate volume of sterile water and place the Petri dish in an incubation chamber at 28 °C for 12 h.Remove the water, and wash the seeds for several times with sterile water, then hung up in one layer gauze to dry for 6 h.Put the seed into the Petri dish (9 cm diameter), and immerse the seeds with an appropriate volume of sterile water, then cover several layers of wet gauze. Place the Petri dish in an incubation chamber for 12-18 h at 28 °C.After the seeds germinate, transfer them into pots (10 cm in diameter and 15 cm in height) containing 80% volume of cultivated land soil (20-30 seeds per pot). Place the pots in a greenhouse for growth at room temperature. Water the pot every two days to keep the soil wet. After one week, the barley leaves can be used for inoculation (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180502/20180502015608_9442.jpgFigure 2. Procedure for inoculation of M.",
    "oryzae on barley leavesInoculation of barley with M. oryzae (Figure 2)Cut the barley leaves from the base with a scissor, then put them (back side up) in a Petri dish (9 cm diameter), which have been covered with two layers of water immersed absorbent paper. Fix the leaf base and tip with water immersed absorbent paper, and keep leaf flat (Video 1).Note: When fix the leaves base and tip with water immersed absorbent paper, keep the leaves dry and don’t touch the leaves with fingers or any other materials.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Put barley leaves into the Petri dish and fix with water immersed absorbent paper Drop the conidia suspension onto barley leaf beside the vein using a pipette (0.5-10 μl range) (Video 2). Note: Keep each drop with a diameter of around 2-3 μm and without collapse, if the drop is too large or collapsed, it may tend to the formation of aerial mycelium, but not appressorium. Keep the tips away from the epidermis could avoid collapse. Re-suspending conidia by shaking up and down of the tubes every time before absorbing the conidia suspension.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Drop conidia suspension onto the barley leaves Put on the lid, cover the Petri dishes with wetted absorbent papers, and place them into a sealed moist box. Then put the box in a dark incubator at 28 °C.Infection process observation (Figure 3)Takeout the barley leaves with a tweezer at different time points after inoculation. Use a blade to cross cut the leaf from up to down, at the tip side or base side. Keep the lower epidermis still connected, and subsequently tear down the lower epidermis (Figure 3A, Video 3).Note: During this process, try best not to touch the water drops, which could break the infection structures.",
    "Recommend observing penetration pegs and primary infection hyphae at 18 hpi, and secondary infection hyphae at 24-30 hpi.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Tear down the barley lower epidermis and put onto a glass slide Put the lower epidermis onto a glass slide, add some water to immerse the epidermis, then cover it with a coverslip.Observe the infection processes of M. oryzae in the cells of epidermis under a microscope, take images and calculate formation ratios of different infection structures (Figure 3A). For each time, more than 50 conidia should be calculated.Observe the subcellular localization of GFP-tagged proteins in infection structures under a fluorescence microscope (Figure 3B).Note: During observing, remember to add water when the sample is dried.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180502/20180502020144_1392.jpgFigure 3. Procedure for observing of different samples. A. Procedure of observing the infection process. B. Observation of protein subcellular localization. DIC, differential interference contrast; GFP, green fluorescent protein. Scale bars = 20 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}