{
  "id": 9900,
  "origin_website": "Jove",
  "title": "Method to Visualize and Analyze Membrane Interacting Proteins by Transmission Electron Microscopy",
  "procedures": [
    "1. Preparation of Nanodiscs\nExpression and purification of the membrane scaffolding protein8,35\nExpress the His-tagged MSP1E3D1 in the E. coli BL21 (DE3) T1R pRARE2 strain in flasks. Prepare a 50-mL overnight starter culture with LB medium supplemented with 50 µg/mL Kanamycin at 37 °C. Dilute the overnight starter culture in 2 L of terrific broth medium supplemented with 50 µg/mL kanamycin.\nGrow the cells at 37 °C until the optical density at 600 nm (OD600) reaches approximately 3. Induce the protein expression with 0.5 mM isopropyl β-D-1-thiogalactopyranoside (IPTG) for 3 h at 18 °C.\nPrepare the lysis buffer (100 mM Tris-HCl, pH 8.0; 100 mM NaCl; and 10% glycerol). Add 1 mM TCEP immediately before use.\nAfter 3 h of induction at 18 °C, harvest the cells by centrifugation for 10 min at 4,500 x g and 4 °C. Discard the supernatant, weigh the harvested cells, and re-suspend them in lysis buffer at a ratio of 2 mL of lysis buffer per g of cells.\nLyse the cells by pulsed sonication (repetition rate: 4 s ON, 4 s OFF) for 3 min at 80% amplitude.\nCentrifuge the lysates for 20 min at 49,000 x g and 4 °C. Discard the pellet from this centrifugation.\nInject the supernatant into a 5-mL Ni+ chelating column connected to an automated liquid chromatography system preferably kept at 4 °C.\nBefore the elution step (step 1.1.9), wash the column with buffers 1 - 3 below to remove all proteins except the His-tagged MSP. Monitor the protein content at 280 nm to follow the purification process; the UV recording at 280 nm should go back to baseline after each wash.\n\t\t\nWash with wash buffer 1: 40 mM Tris-HCl, 300 mM NaCl, 10 mM imidazole, and 1% Triton, pH 8.0.",
    "Wash with wash buffer 2: 40 mM Tris-HCl, 300 mM NaCl, 20 mM imidazole, and 50 mM sodium cholate, pH 8.0.\nWash with wash buffer 3: 40 mM Tris-HCl, 300 mM NaCl, and 50 mM imidazole, pH 8.0.\nElute the MSP with 40 mM Tris-HCl, 300 mM NaCl, and 500 mM imidazole, pH 8.0.\nChange the buffer to MSP standard buffer (20 mM Tris-HCl, pH 7.5; 100 mM NaCl; and 0.5 mM EDTA) by gel filtration8,35; the yield per batch should be around 7 mg L-1.\nPreparation of phospholipid stock solution\n\t\nAdd 305 µL of 1-palmitoyl-2-oleoyl-sn-glycero-3-phosphocholine (POPC) dissolved in chloroform at a concentration of 25 mg/mL to a glass beaker and evaporate the chloroform by purging it with a gentle stream of nitrogen. Dry the lipid overnight in a vacuum desiccator. NOTE: This step is performed to remove the solvent from the lipid, which leaves a thin film of lipid at the bottom of the glass beaker.\nResuspend the lipid cake in 200 µL of MSP standard buffer containing 100 mM sodium cholate by vortexing the tube until the solution becomes transparent; this will provide a solution with a POPC concentration of 50 mM.\n\t\tNOTE: In general, the molar ratio of lipid to detergent at this point should be 1:2 (lipid:detergent)8. This lipid-detergent mix can be stored at -80 °C for almost 2 months.\nPreparation of hydrophobic beads for detergent removal\n\t\nPlace 5 g of beads (dry-weight) in a 50-mL tube.\nWash the beads with 30 mL of 100% methanol and then with 40 mL of ultrapure water.\nWash the beads with 10 mL of MSP standard buffer. Finally, store the beads with 15 mL of MSP standard buffer at 4 °C.\nNanodisc reconstitution",
    "Dispense 190 µL of MSP1E3D1 (0.124 mM) into a microfuge tube and add 61.5 µL of phospholipid stock solution (50 mM POPC) to the same tube. Incubate the reconstitution mixture on wet ice for 1 h. NOTE: This equals a molar ratio of 1:130 (MSP1E3D1: POPC).\nAdd hydrophobic beads at a concentration of 0.5 g of beads per mL of reconstitution mixture to initiate the self-assembly process. Incubate in a rotary incubator for 16 h at 4 °C.\nAfter incubation, centrifuge for 10 min at 13,000 x g and 4 °C to remove the precipitates and aggregates. Discard the pellet and save the supernatant.\nEquilibrate the size exclusion chromatography column (mounted on an automated liquid chromatography system) with MSP standard buffer until the absorbance at 280 nm is stable. Inject the supernatant into the column and collect the peak fractions.\nMeasure the concentrations of nanodiscs in the peak fractions at 280 nm. Use the molar extinction coefficient of MSP1E3D1 (ε = 29,910 cm-1 M-1) for the calculation of the nanodisc concentration. NOTE: The number of lipids per nanodisc can be measured by a combination of radiolabeled lipids and phosphate analysis4 or by phosphate analysis alone.\n2. Preparation of the Monotopic Protein 5-Lipoxygenase35\nPrepare an overnight starter culture. Supplement 50 mL of LB medium with 100 µg/mL ampicillin. Inoculate the medium with E. coli BL21 (DE3) containing the plasmid of the 5-lipoxygenase gene (ALOX5). Dilute the overnight starter culture in expression medium containing 42 mM Na2HPO4, 24 mM KH2PO4, 9 mM NaCl, 19 mM NH4Cl, 1 mM MgSO4, 0.1 mM CaCl2, 0.2% D-glucose, 0.1%, 5 µM FeSO4, and 100 µg/mL ampicillin. Grow the cells until the OD600 is ~ 0.5 at 25 °C. Induce protein expression with 0.2 mM IPTG for 16 h at 20 °C35.",
    "Harvest by centrifugation for 10 min at 7,000 x g and 4 °C and discard the supernatant. Weigh the pellet found at the bottom of the tube containing the harvested cells and resuspend the harvested cells in lysis buffer (100 mM Tris-HCl, pH 8.0; 100 mM NaCl; 10% glycerol; and 1 mM TCEP) containing protease inhibitor and 0.5 mg/mL35 lysozyme at a ratio of 2 mL of lysis buffer per g of cells.\nLyse the cells by sonication for 5 x 15 s at 80% amplitude. Remove the cell debris by centrifugation for 10 min at 7,000 x g and 4 °C. Perform ammonium sulfate precipitation to 30 - 60% saturation to precipitate the proteins in the solution35. Centrifuge for 15 min at 16,000 x g and 4 °C. NOTE: The 5LO pellet can be rapidly frozen and stored at -80 °C for up to 6 months.\nResuspend the pellet with 20 mL of lysis buffer and centrifuge for 15 min at 40,000 x g and 4 °C.\nIncubate the supernatant on an ATP agarose column at 4 °C for 30 min. Wash the column once with one column-volume of lysis buffer containing 0.5 M NaCl. Elute the 5LO with 20 mM ATP in lysis buffer containing 10 µM FeSO4 and 20 µg/mL catalase. Perform gel filtration chromatography to remove the ATP35.\n\tNOTE: The 5LO is unstable and should be used immediately after purification. Otherwise, it is recommended to halt at the step of ammonium sulphate precipitation (see the note after step 2.1.3).\n3. Preparation of the Nanodisc-protein Complex",
    "Prepare a total volume of 100 µL of complex. Mix 0.8 µM ND and 0.8 µM 5LO with the 1 mM Ca2+ present in the MSP standard buffer (20 mM Tris-HCl, pH 7.5; 100 mM NaCl; 0.5 mM EDTA; and 1.5 mM CaCl2) and incubate for 10 min on ice. NOTE: The sample can be stored for up to one month at 4 °C35.\n4. Analysis of the Samples\nGel electrophoresis\n\t\nNon-denaturing electrophoresis\n\t\t\nMix 15 µL of the sample with 5 µL of loading buffer (50 mM BisTris, 6 N HCl, 50 mM NaCl, 10% (w/v) glycerol, and 0.001% Ponceau S, pH 7.2)49 and load it on a 4 - 16% Bis-Tris gel to perform electrophoresis.\nFill the cathode tank with light cathode buffer (50 mM Bis Tris; 50 mM Tricine, pH 6.8; and 0.002% Coomassie G-250) and the anode tank with running buffer (50 mM Bis Tris and 50 mM Tricine, pH 6.8). Start the separation by using a constant voltage at 150 V.\nStop the electrophoretic separation when the Coomassie front reaches the end of the gel.\nStain the gel with a standard Coomassie blue protocol.\nDenaturing electrophoresis\n\t\t\nMix 40 µL of the sample with 10 µL of loading buffer containing SDS (0.05% (w/v) Bromophenol blue; 0.2 M Tris-HCl, pH 6.8; 20% (v/v) glycerol; 10% (w/v) SDS; and 10 mM 2-mercaptoethanol) and load it on a 4 - 20% Tris glycine gel to perform electrophoresis.\nFill the cathode and anode tanks with running buffer (25 mM Tris-HCl, pH 6.8; 200 mM glycine; and 0.1% (w/v) SDS). Start the separation by using a constant voltage at 150 V.\nStop the electrophoretic separation when the loading dye front reaches the end of the gel.\nStain the gel with a standard Coomassie blue protocol.\nPreparation of the NaPT solution",
    "Dissolve 1 g of phosphotungstate sodium salt in 50 mL of water by agitation at room temperature to give a 2% (w/v) acidic solution.\nAdjust the pH to 7.4 with 1 M NaOH. Remove the particles using a 0.22-µm syringe filter. Store the solution at room temperature or at 4 °C.\nPreparation of the sample for TEM analysis\n\t\nGlow-discharge carbon-coated copper grids (400 mesh) for 20 s at 30 mA to render the grids hydrophilic before the adsorption of the sample. Place 3.5 µL of the sample (0.8 µM with respect to the nanodiscs) on the grid and incubate for 30 s. NOTE: The volume applied may vary between 2.5 and 5 µL, depending on the sample concentration. A suitable concentration range for nanodiscs is 0.5 - 1 µM.\nBlot off surplus solution using filter paper.\nImmediately stain the grid with a drop of 2% NaPT for 30 s. Blot off excess solution and leave the grid to air dry.\nEvaluate the grids by TEM. A microscope with 120-200 keV accelerating voltage suffices to estimate the extent of stacking. NOTE: For the present protocol, a calibrated transmission electron microscope was used, equipped with a 200-keV field emission gun.\nRecord the TEM images. For the images showing long stacks, do not process further; images show the complex of nanodiscs, with extrinsic protein that may contain a few short stacks, but most particles are in the complex. Record several images and process these according to standard methods to obtain class-averages and a low-resolution, 3 dimensional model of the complex.\n\t\tNOTE: For the collection of negative-stain data, grids were made on at least three different days. For each day, fresh sample incubations (as in step 3.1) were made before the negative stain was applied.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}