{
  "id": 11907,
  "origin_website": "Jove",
  "title": "Aqueous Humor as a Liquid Biopsy for Retinoblastoma: Clear Corneal Paracentesis and Genomic Analysis",
  "procedures": [
    "This research is conducted under Children's Hospital Los Angeles and University of Southern California Institutional Review Board approval, and it adheres to the tenets of the Declaration of Helsinki. Written informed consent is always obtained from the legal guardians of all participants.\nA schematic for the AH liquid biopsy workflow can be seen in Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62939/62939fig01.jpg\nFigure 1: Workflow for the AH liquid biopsy to accompany the protocol described herein. EUA, exam under anesthesia; LBX, liquid biopsy; cfDNA, cell-free DNA; CNA, copy number alteration; TFx, tumor fraction; IVM, intravitreal melphalan. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62939/62939fig01large.jpg]\n1. Surgical procedure:\nNOTE: This procedure is performed during routine examination under anesthesia (EUA) for clinical evaluation of patients with RB. The paracentesis procedure to extract AH should only be done by a trained ophthalmic surgeon who has completed standard training in ocular surgery.\nPatient selection and inclusion criteria are as follows.\n\t\nEnsure that the chamber is formed and clear without shallowing from the tumor, synechiae, or a cataractous lens.\n\t\tNOTE: In some advanced eyes, the chamber is too shallow at diagnosis to safely extract the AH. In these cases, it is recommended to wait until after the first cycle of systemic or intra-arterial chemotherapy. Once the main tumor shrinks, the chamber generally deepens, which allows for a safe approach.\nEnsure that there is a clear view of all structures and that the pressure is <22 mm Hg so that there is no rapid shallowing of the chamber due to pressure dynamics. This is true for all time points, but particularly critical when AH is taken at diagnosis.",
    "Ensure that there is no direct involvement of the anterior segment by the tumor, which is evaluated by direct visualization and ultrasound biomicroscopy. This inclusion criterion is usually identified during EUA.\nOnce the patient has been deemed appropriate and consented, bring the patient to the operating room. Allow the attending anesthesiologist to initiate anesthesia as is routine for EUA for the clinical care of patients with RB.\nOnce the patient is intubated and sedated, and all clinical examination, imaging, and any local therapeutic needs (e.g., laser or cryotherapy) pertaining to the EUA are complete, extract the AH for the liquid biopsy platform. Prepare and drape the eye in the usual sterile fashion. This can be completed by the circulating nurse or the operating surgeon.\n\t\nPrior to the EUA, place the dilating drops routinely used at the institution for an EUA in the surgical eye.\n\t\tNOTE: Here, combination eye drops consisting of 2.5% phenylephrine, 1% cyclopentolate, and 1% tropicamide are used. However, whatever standard drops are used for dilation for EUA are sufficient; the eye does not have to be dilated simply to extract the AH.\nPlace 5% betadine drop in the surgical eye and apply it using a sponge starting from the center and moving peripherally. Include superior and inferior eyelid margins in the surgical preparation. Complete the surgical preparation using betadine three times, and then wait at least two minutes before proceeding.\nPlace a sterile blue towel over the patient's head and tuck it under the head to keep it from falling. Dry the eyelashes and periorbital area with a sterile blue towel or gauze.\nLet the operating surgeon scrub in, don a gown, and don gloves.",
    "Cover the patient with sterile blue drapes, leaving the surgical eye exposed. Place a sterile lid speculum for optimal visualization of the sterile field.\n\t\tNOTE: Additional topical anesthesia is not required at our institution as the child is under general anesthesia for the EUA.\nPerform time out according to institutional protocol. Here, an initial time out is done for the EUA and a second time out to verify the eye(s) prior to the procedure.\nUsing an operating microscope, perform a clear corneal paracentesis with the extraction of 0.1 mL of AH with a 32 G needle on a 1 cc syringe.\n\t\nPrior to starting the procedure, wet the eye with a sterile balanced salt solution (each mL containing sodium chloride 0.64%, potassium chloride 0.075%, calcium chloride dihydrate 0.048%, magnesium chloride hexahydrate 0.03%, sodium acetate trihydrate 0.39%, sodium citrate dihydrate 0.17%, sodium hydroxide and/or hydrochloric acid (to adjust pH), and water for injection) to maintain corneal lubrication; this is a standard commercial preparation.\nEnsure the 32 G needle is luer-locked to the 1 cc syringe and that there is no pressure in the syringe (by moving the plunger of the syringe in and out several times before use).\nAfterward, pass the needle through the clear cornea at the limbus (perpendicular to it, as is standard for paracentesis) and stay within the anterior chamber over the peripheral dilated iris.\nKeep the needle tip bevel up anterior to the iris under direct visualization via the microscope during extraction. If preferred, stabilize the eye with 0.12 forceps as the needle passes through the cornea.\n\t\tNOTE: There should never be contact between the needle tip and any ocular structure; it should remain over the peripheral iris in the mid anterior chamber.",
    "Extract 0.1 mL of AH. Manipulate the syringe plunger with the surgeon's non-dominant hand (but with practice) or by a trained assistant without moving the needle. Do not lose direct visualization of the needle tip. Prioritize the anatomy of the eye and take less AH if necessary to ensure that the chamber remains formed.\nAfter extraction, gently remove the needle from the anterior chamber. Ensure that the chamber remains formed but slightly shallow; the pressure will be soft but physiologic. Once the needle is removed from the eye, bathe the eye copiously with sterile water; sterile water is preferred over a balaced salt solution at this step as a safety measure because water lyses cells.\n\t\nExamine the needle site for any leakage. If there is leakage, use a cotton tip applicator to apply gentle pressure at the injection site for 30 seconds before checking again for leakage. Repeat the process if needed.\n\t\tNOTE: Use of more invasive methods to stop any leakage were never needed with this approach. Sometimes this procedure is followed by intravitreal injection of chemotherapy; for this methods paper, the protocol focuses on AH extraction as a primary procedure.\nOnce there is no leakage, the procedure is considered complete. Remove the sterile drapes from the patient and clean the betadine from the face.\nCarefully remove the needle tip from the syringe, use a sterile cap to close the sample via luer lock to not lose any sample, and label the syringe appropriately.\n\tNOTE: This should be done by the clinical research coordinator or the surgeon while the child is being extubated.\n\t\nAfter specimen extraction, store the sample in a capped syringe at -80 °C; samples can be placed on dry ice to transport to an appropriate freezer from the operating room.",
    "Place a single drop of antibiotic eyedrops per surgeon preference onto the surface of the surgical eye before the patient is sent to recovery. Here, combination steroid-antibiotic eyedrops are used, and the eye is not patched.\nOnce the procedure is complete, the attending anesthesiologist ensures proper extubation. Bring the patient to recovery.\n\t\nDischarge the patient to home following institutional postoperative protocol.\nInform the patient that the eye need not be covered with any bandage or a protective covering.\nInform the patient not to completely immerse their head in either a bath or swimming pool for 24 hours, and the parents not to rub the patient's (child) eye; there are no other limitations on patient activity.\nInform the patient that he/she/they are unlikely to have pain from the paracentesis but could have pain from associated procedures during the EUA. The patient may take acetaminophen or ibuprofen in case of any discomfort, as suggested by the surgeon.\n2. cfDNA isolation and purification\nPerform DNA isolation and processing within 72 hours of AH extraction.\nThaw AH at room temperature. Check the sample frequently and move toward extraction immediately after thawing is complete.\nExtract cfDNA from AH and elute it into 50 µL of AVE solution (included in kit) using the cfDNA isolation and purification kit (see Table of Materials for details) per the manufacturer's instruction manual.\n3. Next generation sequencing (NGS) and quality control (QC)\nConstruct the DNA libraries for sequencing using the DNA library sequencing kit (see Table of Materials) per the manufacturer's instruction manual. Amplify the library DNA with 14 cycles of polymerase chain reaction (PCR) as detailed in the DNA library sequencing kit manual.\n\tNOTE: Final libraries can be stored at -20 °C up to 1 month before final sequencing for genomic analysis.",
    "Sequence the DNA libraries on the NGS platform (see Table of Materials) per the manufacturer's protocol following single-end 50 cycles or paired-end 150 cycles protocol.\n\tNOTE: Other NGS platforms will work in principle (although not tried here), with suitable adaptors for the sequencing flow cell.\nPerform QC for any AH samples that were taken at the time of diagnosis or primary enucleation.\n\tNOTE: QC cannot be performed for samples taken at other time points as the DNA mass will be too low and out of the detection range for the steps described below.\n\t\nUse 1 µL of the extracted DNA each for DNA quantification assay and size profiling assay (see Table of Materials) per the manufacturer's protocols.\n\t\t​NOTE: Peak should be around 300 bp. If it is shorter than 150 bp, the sample has been compromised. See Supplementary file 1A for an example of a sample that should pass QC and Supplementary file 1B for an example of one that should not.\n4. Somatic copy number alteration (SCNA) data analysis\nMap the reads obtained from NGS (section 3) to the human genome (hg19, Genome Reference Consortium GRCh37, University of California Santa Cruz Genome Browser database)24,25 with an aligner.\nRemove the PCR duplicates (samtools rmdup26).\nNormalize for guanine-cytosine content by computing the percentage of guanine and cytosine bases in each bin from the reference genome. A sample program is described in Baslan et al.27.\nTo obtain DNA segment copy numbers, divide the genome into 5000 variable-length bins and then calculate the relative number of reads contained in each bin.\n\t\nUse reference-free log2 ratios to determine copy-number estimates. Take the median window count of normal autosomal chromosomes.\nPerform segmentation using circular binary segmentation with DNAcopy (Bioconductor28).",
    "Define SCNAs as positive at 20% deflection from baseline (log2 ratio = 0), meaning losses at log2 ratios ≤ 0.2 (ratio of 0.87 or lower defines a deletion) and gains at log2 ratios ≥ 0.2 (ratio of 1.15 or higher defines an amplification).\n\t\t​NOTE: These thresholds are consistent with previously established liquid biopsy analyses27,29.\n5. RB1 mutational analysis of AH samples\nFurther, amplify the whole genome libraries to 500 ng each for capture-based targeted NGS for mutation detection per manufacturer's protocol.\nPerform NGS platform paired-end 150 bp or 50 bp single-end sequencing on the captured libraries to >100x per manufacturer's protocol.\nProcess the NGS data. In this study, an in-house pipeline based on the bcbio pipeline at the CHLA Center for Personalized Medicine is utilized30.\n\t\nTrim the raw fastq data off adaptors and low-quality bases with Atropos31 and align to human GRCh37 reference with BWA-MEM and NovoAlign (v3)32,33.\nMark duplicates with FreeBayes34 and then determine the germline variant.\n\t\tNOTE: In FreeBayes variant calling tools, each position of the sample genome is compared to the reference genome and the allele counts are mathematically modeled to obtain the genotype likelihood measures34.\nConduct variant annotation with Ensembl Variant Effect Predictor (v96)35 following steps 5.3.4-5.3.5.\nUse VarDict to determine somatic variants in the AH or tumor without the paired normal blood sample (i.e., blinded to germline variant)36.\nCall loss of heterozygosity if a region's continuous variants have ≤3% alternative alleles.\n\t\t​NOTE: Commercial genomic analysis software can also be used with the parameters indicated above.\n6. Determination of cfDNA TFx\nEstimate TFx for each sequenced AH cfDNA sample using ichorCNA software (CNA-based TFx estimation software)37.\n\tNOTE: This is the standard software used in blood-based liquid biopsies for determining cfDNA TFx38. The use of the software on AH has been previously published21,23.",
    "Individually review the genomic profiles and corresponding TFx solutions to verify that the TFx estimate for each sample is appropriate39."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}