{
  "id": 11954,
  "origin_website": "Jove",
  "title": "Discovery of Metastatic Regulators using a Rapid and Quantitative Intravital Chick Chorioallantoic Membrane Model",
  "procedures": [
    "All experiments were performed in accordance with the regulations and guidelines of the Institutional Animal Care and Use Committee at the University of Alberta. Avian embryos are not considered to be live animals by many research institutes and no animal protocols are required. It is, however, an accepted view that avian embryos can feel pain and, therefore, must be treated as humanely as possible. The local animal research authority must be contacted prior commencing of any research work to ensure that proper regulations are followed.\n1. Shell-less egg culture\nAcquire fertilized chicken eggs from the local provider. This experiment uses White Leghorn chicken breed; however, other breeds can be used as well.\n\tNOTE: It is recommended to acquire 10% more eggs than needed in case some of the embryos are damaged during the cracking and cannot be used in this protocol.\nTransfer the required number of eggs into a 60% humidified rocking incubator. The rest of the eggs can be stored for up to two weeks at 12 °C without loss of viability.\nIncubate the eggs in the humidified rocking incubator for four days.\n\tNOTE: Day 1 is when the eggs are transferred to the rocking incubator.\nPrepare the weighing dishes and plastic lids for the shell-less egg culture. Cut one of the corners of each of the weighing dishes to allow for efficient air access to the embryo (Figure 1A).\nArrange the prepared weighing dishes in rows in the flow hood. (Figure 1B).\nIn a separate weighing dish prepare 70% ethanol for egg rinsing.\nBriefly dip the egg in 70% ethanol, then use the electric rotary tool to carefully make four 2-3 mm cuts parallel to the largest latitudinal diameter of the egg (Figure 1C).",
    "Transfer the cut egg into a weighing dish and gently press the egg against the dish bottom until a crack forms in the eggshell (Figure 1D).\nPull the eggshell halves apart letting the embryo slip into the weighing dish. Discard the eggshell and cover the weighing dish with a lid.\nTransfer the embryos into humidified non rocking incubator (Figure 1E).\n\tNOTE: Weighing dishes containing the embryos are placed into separate plastic containers (12 embryos/container). This increases embryo viability and allows for experiment-specific embryo organization.\nIncubate embryos for 6 more days (until 10 days old). Check for dead or contaminated embryos daily and remove them from the incubator.\n\tNOTE: Embryos can be contaminated by airborne mold spores. Mold contamination initially manifests as white speckles on the embryo CAM surface. Remove the contaminated embryos immediately and wipe the incubator with 70% ethanol on weekly basis to prevent the contamination. In our experience contamination levels are very low ~1-3%.\nUse these embryos for cancer cell injection in the morning of day 10.\n2. Preparation of the cancer cells for injection\nNOTE: Metastatic colony selection is based on a phenotype established by fluorescent cancer cells, derived from an expression library or vector tagged with fluorescent protein such as green or red fluorescent protein (see the whole screen flow in Figure 2A). It is not recommended to use cells transiently transfected with fluorescent proteins or labeled with cell permeable fluorescent dyes due to rapid fading of signal caused by cancer cell proliferation and uneven staining.\nCulture cancer cells to 60-70% confluency at the time of injection. Using cancer cells at higher levels of confluency will decrease their viability, resulting in low efficiency of metastatic colony formation. Ensure that the cancer cells used are mycoplasma free since mycoplasma contamination may lead to decreased chicken embryo viability.",
    "Rinse cells twice with 1x PBS pH 7.4. Remove the remaining PBS, then add 0.5% Trypsin-EDTA and incubate at 37 °C for 2-5 min until all cells are lifted from the culture dish surface.\nTransfer the cell suspension into 15 mL conical tube and centrifuge cells at room temperature at 200 x g for 5 min.\nResuspend cells in 10 mL of PBS to and centrifuge the cells again as in step 2.3, to remove trypsin and other culture media components such as antibiotics.\n\tNOTE: Presence of trypsin or cell culture components such as antibiotics in the cancer cell suspension may result in decreased chicken embryo viability.\nCarefully aspirate the supernatant and resuspend cells with 1 mL of ice-cold PBS.\nCount the number of cells using a hemocytometer or any other cell counting equipment available.\n\tNOTE: This screening protocol requires that each metastatic colony be initiated by a single cell. When counting the cells make sure that the cells are fully trypsinized and exist as a single cell suspension (no cell clumps are present).\nFor intravenous (IV) injection concentrate cells to 0.5 x 106 to 1.0 x 106 cells/mL. Use ice cold 1x PBS to dilute and/or resuspend cell concentrates. Expect that approximately 1 mL of cells suspension will be needed for every ten embryos.\n\tNOTE: Necessary cell suspension concentration in suspension is mainly determined by the level of experimenter experience. Please see next section for more details.\n3. Intravenous injection of cancer cells for metastatic colony formation",
    "NOTE: Following this protocol as many as a hundred of embryos can be injected within one day. It generally takes longer time to isolate the metastatic colonies (Step 5) then to inject the cancer cells and, therefore, it is recommended to perform an initial experiment to estimate the time needed to complete all the steps. Using differential cancer cell fluorescent labels helps to reduce animal numbers and the time required for each experiment. For example, control cells can be labeled with RFP (red fluorescent protein) while mutant tumor cells can be alternatively labeled with GFP (green fluorescent protein). In this case, each experiment has a built- in control that corrects for inter-embryo variability.\nAssemble the injection apparatus as it shown on Figure 2B. First mount a needle onto the syringe and then extend the syringe needle with 3-5 cm long piece of tubing.\nBreak the tip of the borosilicate needle off using the fine forceps (~20-60 µL wide).\nLoad the syringe with the cancer cell suspension (50-200 µL) and insert the borosilicate needle into the tubing (Figure 2B).\nInspect the borosilicate needle for cell clogging and air bubbles. It is critical to inject cells as a single cell suspension to ensure that each metastatic colony is initiated by a single cell.\n\tNOTE: Cancer cells tend to aggregate in PBS within 1-2 h post trypsinization and, therefore, should be prepared immediately before injection. If necessary, cells can be resuspended periodically using the 1 mL syringe used for injections (without the borosilicate needle).\nIf cell clogging is observed within the capillary, remove the capillary, re-suspend the cells, and replace it with a new capillary. Use the plunger to push out any bubbles. If no cell clogging or bubbles are observed proceed to the next step.",
    "Remove the cover lid and transfer the embryo under the stereoscope. Identify the appropriate vein to be injected on the CAM surface. Veins and arteries form the intricate network within the CAM tissue (Figure 2C). Veins are distinguished by the brighter red color because they carry oxygen rich blood to the embryo.\n\tNOTE: For general embryo manipulation, cancer cell injection and metastatic colony excision, use a fluorescent stereomicroscope equipped with 0.8x and 1.5x objectives and 10x eyepieces for visualization. Less advanced microscope can also be successfully used for these procedures, depending on the users' experience level. Readers can contact the authors for more detailed recommendations.\nFind the ideal vein to inject cells which is normally only slightly wider (10-20%) than the diameter of borosilicate needle tip and located midway between the embryo and the weighing dish wall. It is generally easier to inject at the point immediately adjacent to the vein bifurcation.\n\tNOTE: Injection into a larger vein may appear easier but will lead to excessive bleeding and decreased embryo survival.\nPress the tip of the needle against the blood vessel wall and apply gentle pressure in the same direction as the blood flow. If necessary, use a cotton swab (held in other hand) to help anchor or stabilize the vessel that is being injected.\nGently depress the syringe plunger. One can visualize a successful injection by observing a \"clearing\" of the blood vessel when the cancer cell suspension enters the blood stream.\nContinue depressing the syringe plunger for 2-10 s until the desired suspension volume is injected into the blood stream of the vein. All together the injection of a single embryo may require 1-10 min depending on the experience level of the user. If excessive bleeding or clear liquid accumulation appears at the injection site, discard the embryo.",
    "NOTE: It is easy to \"over-inject\" an embryo. The general consideration that should be kept in mind is that metastatic colonies should not touch each other after a 4-5 days growth period. Ideally ~5-10% of terminal CAM vein capillaries should have cells immobilized in them after a successful injection (Figure 2D,E). As mentioned in the step 2, a range of cell concentration can be used (0.5 x 106 - 1.0 x 106 cells/mL). Lower concentrations will require longer injection time but will decrease the needle clogging. Higher concentrations will require shorter injection times but will increase the needle clogging. It is recommended to try several concentrations to find the one that is most comfortable for an operator. Generally, higher concentration (1.0 x 106 cells/mL) is preferred to decrease the injection time.\nRemove the needle from the CAM and gently dab the injection site with a cotton swab to remove any blood or excess cancer cells.\nCover the embryo in the weighing dish with a lid and return the injected chicken embryo into the incubator.\nRepeat the procedure with the next embryo until all embryos are injected.\n4. Embryo maintenance during the metastatic colony growth\nVisually inspect the embryos. If there are any that are dead, and/or contaminated with bacteria or mold remove them from the incubator, then autoclave and discard them according to laboratory disposal procedures.\n\tNOTE: It is recommended that embryos are inspected every other day (days 1, 3, 5 post cancer cell injection) for metastatic colony growth. Avoid moving the injected embryos unnecessarily since it may cause embryo damage and/or death.",
    "If cells display overgrowth (metastatic colonies overlap with each other) or uneven distribution within the CAM tissue (metastatic colonies located in small subarea of the CAM surface) remove that embryo from the experiment. Euthanize discarded embryos by freezing at -20 °C (or another approved method) immediately after removal from the experiment. The number of viable metastatic cells within the CAM tissue will decrease initially (days 1-2) and then increase (days 2-5).\n\tNOTE: Some embryos may \"reject\" the cancer cells, i.e., all the cancer cells will disappear from the CAM tissue. These embryos should be removed from the experiment. Normally, cancer cell colonies can be seen through the transparent lid under the fluorescent stereo microscope without opening the weighing dish.\nEnsure metastatic colonies appear uniform in shape (first 1-3 days post injection). Identify invasive or non-invasive metastatic colonies at days 4-5 post injection (see Section 5 for more details).\n5. Isolation of metastatic colonies\nAt day 5 post injection remove embryos from incubator and inspect the embryo CAMs for metastatic colony distribution. Identify the embryos with uniform colony distribution in which compact (or overly invasive) colonies are present.\n\tNOTE: The process of culturing chicken embryos is not sterile, therefore, all the screening steps must be performed under highly clean conditions to avoid future tissue culture contamination. Contamination it is quite rare and can be easily avoided by wearing gloves and a mask and using only sterile tools during cell injection and colony isolation procedures. It is recommended to inspect embryos one by one to decrease their exposure to the ambient laboratory temperature and to prevent contamination.",
    "Locate the metastatic colony of interest. A compact colony can be described as one with most of the cancer cells located within a limited area in the CAM tissue (cells appear \"clumped together\"). An invasive colony can be described as colony where cancer cells \"scatter\" in the CAM tissue (Figure 3A,B).\n\tNOTE: \"Compactness\" of the metastatic colony can be explained either by the inhibition of cancer cell invasion, inhibition of cancer cell proliferation, or both. Attention should be paid to all scenarios and contact colonies should be isolated (Figure 3A,B). A simple fluorescent stereomicroscope can be used to discriminate between compact and invasive metastatic colony phenotypes.\nUnder the dissection microscope gently pull the CAM tissue that contains the metastatic colony of interest upwards using fine forceps (Figure 3C).\nCut off the CAM tissue that contains the metastatic colony using surgical scissors.\nTransfer the CAM tissue that contains the metastatic colony into an empty, sterile 1.5 mL tube (on ice) and close the tube lid.\n\tNOTE: Isolated colonies can be kept on ice for up to 3 h without loss of viability.\nRepeat the excision procedure until all the colonies of interest are collected into separate tubes. To avoid animal suffering, do not excise more than 2-3 colonies from one embryo. Euthanize embryos by freezing at -20 °C (or another approved method) immediately after the colony excision.\nGently mince the CAM tissue in a microcentrifuge tube using a sterile 18 gauge needle. Use a separate needle for each colony.\nAdd 100 µL of 1x collagenase solution and incubate for 30 min at 37 °C.\nSpin down the cells and CAM tissue at 300 x g for 5 min at ambient temperature.\nAspirate the collagenase solution and resuspend cells in complete media used for the cell line of interest.",
    "NOTE: Normally CAM tissue is not completely dissociated after collagenase treatment and cancer cells will first proliferate within the pieces of CAM tissue and only later migrate onto the tissue culture dish.\nSpin the cells and CAM tissue again at 300 x g for 5 min at ambient temperature.\nResuspend cells and CAM tissue pieces in 1 mL of complete media plus selection factor (if any), then transfer into single 12 well tissue culture dish well.\n\tNOTE: Chicken CAM fibroblasts may persist in tissue culture for multiple passages inhibiting clonal expansion. Ability to expand the metastatic colonies in the presence of selection factor (i.e., if a vector that was used to render cancer cells fluorescent also encodes a mammalian antibiotic resistance gene) may greatly speed up clonal expansion. A kill curve experiment should be performed before the screening to ensure that proper concentration of antibiotic is used.\nFor the next 1-3 weeks monitor cancer cells daily for growth and contamination.\nWhen cells reach 70-80% of confluency transfer cells into a larger volume culture dish.\n\tNOTE: It is recommended to expand cells till at least two cryogenic vials of each clone can be frozen. Maintaining large amounts of tissue culture can be laborious and unnecessary.\nProceed to sequencing or next round of selection as soon as enough cancer cell numbers are reached. Generally, 1 x 106 of cancer cells are sufficient for modern high-throughput sequencing techniques.\nProceed to the clone reinjection and imaging and quantification of colony compactness or cancer cell-blood vessel contact (Figure 2A). Alternatively proceed to high throughput sequencing or repeat the colony selection.",
    "​NOTE: To decrease the number of false positives at least two rounds of selection is recommended. Two approaches have been successfully employed. 1) Expand each clone and reinject individually to confirm the colony phenotype. 2) Mix all the expanded clones in a 1:1 ratio each, reinject as a mixture and repeat the selection cycle.\n6. Injection of fluorescently tagged lectins into the CAM vasculature.\nIdentify the vein to be injected. It is easier to use the same injection site for lectin that was used for tumor cell injection.\nDilute fluorescent lectin stock solution (5 mg/mL) 50-100x with 1x PBS and load it into the same injection apparatus as used for cancer cell injection.\n\tNOTE: The amount of lectin that needs to be injected (normally 20-100 μL) for blood vessel visualization is dependent on microscope sensitivity and should be determined experimentally before screening.\nInject lectin using the same technique as for tumor cell injection (see steps 3.6.-3.10.).\nAfter the lectin injection, place the embryo into the incubator to recover for 5 min. Inject only one embryo at a time and immediately before imaging the embryo.\n\t​NOTE. Embryos that are 12 days or older generally recover well from the lectin injections and can be reinjected with lectin again next day for sequential imaging. Younger embryos are more sensitive and may display blood coagulation.\n7. Visualization of cancer cell-blood vessel contacts\nSet the temperature-regulated microscope enclosure to 37 °C approximately 6 h prior to imaging. This will stabilize microscope temperature and help minimize XYZ drift during imaging.",
    "NOTE. A specialized chicken embryo imaging chamber9,10,11,12,13 was used for this experiment. A simple fluorescent dissection microscope can be used for all the steps starting from cancer cell injection to clone selection and clone reinjection, and evaluation of the colony compactness. A confocal microscope that is equipped with an imaging chamber is necessary for imaging and quantification of cancer cell-blood vessel contacts. No heating is necessary for up to 1 h and generally embryos survive at least two sequential imaging sessions with no impact to their viability.\nEnsure that the necessary objective lens (20x or 25x water immersion objective lens is recommended) has been installed.\nApply a thin layer of vacuum grease to underside of the imaging chamber lid to create a secure seal with the coverslip.\nGently position a coverslip into the lid and wipe away any excess vacuum grease.\nTake the lectin injected embryo out of the incubator and cut the rims of the weighing dish if necessary.\nPosition the embryo in the imaging chamber with the coverslip lowered down directly onto the area of the CAM where the metastatic colonies of interest are located. Slowly lower the lid onto the embryo until the coverslip just contacts the CAM. Tighten the screws to secure the lid in place, ensure the lid is leveled and that the coverslip is not putting any downward pressure on the CAM.\nAcquire images of multiple, random colonies from control and experimental groups (10-20) from several (5-10) embryos.\n\t​NOTE. Acquiring random 3D stacks (1-5um Z-steps; 50-100um range; 25x) from each field is recommended.",
    "Use field-stitching option in the microscope acquisition software if available. Since images used for quantification will not be publication quality, use fast acquisition modes such as resonant scanning if available. Use 25x objective and 3 x 3 stitching with 5-10 µm Z-step, 100 µm total range. Image at least 100 cells (~20 colonies) per condition.\n8. Quantification of cancer cell blood vessel contacts\nOpen the 3D file as a Z-stack using the necessary software.\n\tNOTE. Specialized software must be used to acquire and analyze high resolution images in order to quantify cancer cell-blood vessel contact. Several software packages that are capable of 3D image analysis are available. Please see Table of Materials for more details.\nIf significant XY movement occurred during the image acquisition, align the Z-stack using the ImageJ StackReg plugin (http://bigwww.epfl.ch/thevenaz/stackreg). \nLocate the cell (s) of interest.\nScroll through the XYZ image in the Z direction and identify the optical section that contains the maximal length of the cancer cell blood vessel contact for the cell of interest (Figure 2E).\nMeasure the cancer cell-blood vessel contact using the \"manual length measurement function\".\nEnter the measurements into the data software package that is used for statistical analysis.\n\tNOTE: The ability of cancer cells to attach to the blood vessels can be measured either as the length of cancer cell-blood vessel contacts or the percentage of the cell in contact with the vasculature for particular cancer cell clone (or both).\nProceed to the next cell of interest.\nAnalyze the data for statistical significance comparing mutant clone (s) and control datasets.\n9. Colony compactness quantification\nReinject the cells from the expanded clone using the same technique as in step 2.\nFive days post injection acquire images of 10-50 random metastatic colonies for each clone.",
    "NOTE: No high-quality images are necessary for metastatic colony compactness quantification. Monochromatic, stereo microscope (10x magnification) images are sufficient. Attention should be paid to the brightness of the image (most of the cells within the colony should be seen) and contrast (difference between one or two cells).\nDigitally isolate the colony image (see Figure 2C,D) and proceed to colony compactness quantification using the stand-alone colony compactness quantification module or blind scoring13.\nProceed to the next colony of interest.\nAnalyze the data for statistical significance comparing mutant clone (s) and control (i.e. scramble shRNA) datasets.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}