{
  "id": 11103,
  "origin_website": "Jove",
  "title": "Continuous High-resolution Microscopic Observation of Replicative Aging in Budding Yeast",
  "procedures": [
    "1. Production and Preparation of a Silicon Wafer Mold\nMicrofluidic chips are created from a silicon wafer mold produced by soft lithography. These wafers can be reused many times to produce microfluidic chips. It is advisable that production of a respective wafer is performed by a group specialized in microfluidics6.\nThe wafer is made in a two-step photolithography process using two different layers of negative photoresist, SU-87. The bottom layer is used to generate the cell trapping area (SU-8 2002; height 3-4 μm), whereas the channels are made with the top layer (SU-8 2010; height 10 μm). An impression of the wafer production process can be found in Huang et al8. The drawings of the microfluidic chips can be obtained from the authors as well as advice on how to obtain a respective wafer.\nOnce the wafer is obtained, cut one piece of Tough-Tag into thin strips of about 0.5 mm by 3 mm with a scalpel and place them carefully on the wafer slightly on top of the channel structure between the inlet channels and the micropad array (Figure 2A). This will result in the formation of a large additional channel in each chip, which will not only be used during cell loading, but is also important for the stable operation of the microfluidic device.",
    "Cover the glass Petri dish with a double layer of aluminum foil and put the wafer in the Petri dish. The aluminum foil will prevent PDMS from running in between the wafer and the Petri dish. If PDMS does creep in between the wafer and the glass Petri dish, the wafer will become permanently fixed in the Petri dish. Although the wafer is still useable, it will not be possible to replace the glass Petri dish if it breaks and the PDMS will need to be cut out afterwards.\n2. Production of Microfluidic Chips\nPlace an empty plastic cup on the balance and tare the balance. Pour 40 g PDMS base into the plastic cup (for a 12 cm diameter glass Petri dish). Add PDMS curing agent with a disposable pipette in a w/w ratio of 1:10, i.e. about 4 ml.\nMix the PDMS and curing agent thoroughly for several minutes. This can be done with the disposable plastic pipette that was used to pipette the curing agent. It is important that the mixture is well mixed prior to pouring it on top of the wafer. Poor mixing will cause part of the PDMS not to polymerize.\nPour the PDMS on top of the wafer in the glass Petri dish.\nMixing of PDMS with the curing agent will lead to bubble formation in the PDMS mixture. These bubbles need to be removed before the PDMS polymerizes. The PDMS can be degassed after pouring it on top of the wafer by placing the Petri dish in a desiccator connected to a vacuum pump. With this setup, it takes about 30 min to remove all bubbles from the mixture.",
    "Polymerize the PDMS by placing the Petri dish with the wafer on top of a hot plate at 120 °C for 1 hr and then at 65 °C for another hour.\nRemove the aluminum foil together with the wafer and polymerized PDMS from the glass Petri dish. Peel off the aluminum foil and the thin residual layer of polymerized PDMS from the back of the wafer. The layer of PDMS on top of the wafer can then be separated from the wafer by lifting it up carefully.\nPlace the PDMS layer upside down (with the channels facing up) on the bench and cut out the single chip designs imprinted on the PDMS carefully with a scalpel. Try to retain about 3 mm of PDMS around the edges of the channels to improve attachment of the chip to the cover glass later on.\nPunch holes in the PDMS at the ends of the inlet, outlet and side channel (Figure 2A) by pushing a 20 Gauge Luer stub all the way through the PDMS in a straight manner.\nMake sure the PDMS chip is still lying upside down on the bench while punching the holes. This prevents PDMS from sticking to the inside of the channel, which could cause blockage of the channel.\nAfter punching each hole, remove the column of PDMS in the Luer stub with tweezers before pulling the stub out again. The PDMS column could otherwise stay behind and block the just punched hole.\nClean the surfaces of the chip from dust particles and residual PDMS by placing scotch tape on it and immediately removing the tape again. Similarly clean the cover glass to which the chip will be attached.",
    "Place the cleaned chip and cover glass below the UV lamp of the Benchtop UV-Ozone Cleaner. The sides that need to be bonded together must face the lamp.\nExpose the PDMS and cover glass to the UV light for 6-8 min and directly afterwards put the chip on the cover glass by placing the exposed surfaces on top of each other.\nGently tap around the sides of the chip to promote attachment of the PDMS to the cover glass and to remove any air bubbles. Do not tap on top of the channel structure as this may cause the micropads to get attached to the cover glass as well.\nPlace the newly made microfluidic setup on a hot plate at 100 °C for 60 min. Test the strength of the bonding between the cover glass and PDMS chip by trying to lift up the edges of the PDMS chip slightly. When the PDMS block cannot be lifted from the glass surface, the bonding is successful and the chip is ready for use.\n3. Preparing the Chip for Cell Loading",
    "Failure of a microfluidic device can potentially cause leakage of medium into the microscope. To avoid this, it is advisory to use a metal holder and/or seal the sides of the chip where the PDMS meets the glass with nail polish or epoxy glue. This prevents leakage of medium in case the PDMS chip is not bonded well enough to the cover glass. Also the tubing connections can be secured around the insertion points in a similar manner to avoid leakage of medium. A home-made water sensor that switches off the syringe pump in case of leakage can be used as an extra safety precaution. Drawings of the metal holder especially designed for the microfluidic chip can be obtained from the authors.\nPlace the microfluidic chip in the metal holder, with silicone gel between the glass of the chip and the metal parts of the holder to create a waterproof seal. Screw the nuts gently, not to break the glass.\nConnect thin tubes (ca. 5-15 cm long) to the side channel and the outlet channel of the chip. The use of tweezers makes it easier to insert the tubing in the punched holes.\nFill a 50 ml Luer-Lok syringe with culture medium, remove the air from the syringe and connect it sequentially to a syringe filter, a 20 Gauge Luer stub, a short thick tube (ca. 2 cm long) and a thin tube. Make sure that the thin tube is long enough to span the distance between the syringe pump and the microscope stage.\nPlace the syringe in the syringe pump, fast forward the pump until the thin tube is completely filled with medium.",
    "Push the thin tube connected to the syringe into the inlet channel of the chip and let the medium flow through the chip at 10 μl/min (Figure 2B). Collect the medium leaving the chip (e.g. in a Petri dish). The medium will run out via the side channel because of the resistance difference between the Tough-Tag made large side channel and the outlet channel.\nPlace the chip in the microscope stage and set the focus of the microscope on the pads.\nThe use of oil immersion objectives is preferred over that of water immersion objectives because oil will not dry out over the time-course of the experiment.\nDepending on the microscope there might be issues with retaining the focus during the initial hours of the experiment. It is therefore advisable to leave the chip for one to two hours in the microscope stage so it can settle down before loading cells and starting the experiment.\n4. Loading of Yeast Cells into the Microfluidic Chip\nConnect a 5 ml Luer tip syringe to a 20 Gauge Luer stub and a thick tube (ca. 3 cm).\nTake a sample of the cell culture to be loaded into the chip.\nThe preferred cell count for loading is between 1-5 x 106 cells per ml. Cultures with higher cell counts need to be diluted before loading. When culturing cells on YPD, cell loading efficiency can be improved many-fold if cells are first washed with and resuspended in minimal medium containing a similar glucose percentage before loading. During operation of the chip, YPD medium can again be safely used.\nLoad approximately 1 ml of the cell suspension into the syringe and remove all the air from the syringe.",
    "Decrease the flow rate of the syringe pump to 0.5 μl/min. The low and continued flow enforced by the syringe pump during loading (in step 4.5) will push non-attached cells out via the side channel (Figure 2C).\nConnect the syringe containing the cell suspension to the tube of the outlet channel. Load the cells by pressing on the plunger of the syringe gently. Observe the cells coming in and settling underneath the micropads via the ocular or via the computer screen.\nMaintain pressure on the plunger until sufficient cells settle underneath the pads. The optimum load is 1-3 cells per pad. As cells settle underneath the pads randomly, it is quite common that a few pads do not contain any cells and other pads are completely filled with cells.\nDisconnect the syringe used for cell loading and the thick tube connected to it from the thin tubing of the outlet channel, flush the side channel for a couple of minutes at higher flow rates (10 μl/min) to remove air bubbles and/or cells that did not yet exit the chip (Figure 2B). If cells are not removed from the side channel, they can start to grow in the side channel and interfere with the experiment later on.\nPut the flow of the syringe pump back down to 0.5 μl/min and close the side channel off by connecting it to a thick tube (ca. 5 cm long) containing a catheter plug at its end (Figure 2D).\nIncrease the flow to a final flow rate of 1-5 μl/min. Flow rates may vary depending on medium and yeast strain.",
    "Start a movie with the microscope and camera settings suitable for the goal of the experiment. Make sure that the speed of the microscope stage is set to such a low speed that the oil can follow. For determination of replicative lifespan, image cells every 10 min. To protect cells from the minute amounts of UV light emitted by the halogen lamp, which is used during DIC acquisition, it is advisable to place an additional UV filter in the light path. When using fluorescence microscopy, it is preferred to image the cells less frequently (e.g. every 20 min) to avoid phototoxic effects. The experiment is completed when all cells loaded at the start of the experiment are dead, which under normal conditions takes up to 5 days. It is recommended to regularly check the focus of the images during the experiment and if necessary adjust it.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}