{
  "id": 19303,
  "origin_website": "Jove",
  "title": "Vascular Occlusion Training for Inclusion Body Myositis: A Novel Therapeutic Approach",
  "procedures": [
    "1. Determination of full vascular occlusion pressure\nIn order to determine the blood pressure of vascular occlusion, in mmHg, a vascular Doppler is used\nThe patient lies in a supine position while a customized blood pressure cuff (180mm length x 80mm width) is fixed on his thigh.\nAfter detection of the tibial artery location, the Doppler's probe is then placed over the determined spot in the patient's leg.\nA sound signal is generated by the Doppler machine as it captures the artery pulse.\nThe customized blood pressure cuff is then inflated until it interrupts the ascultatory pulse of the tibial artery.\nThe pressure required for full vascular occlusion is registered for future use during training.\nFor safety reasons, arterial blood pressure is also monitored.\n2. Resistance training with vascular occlusion\nA brief warm-up on a treadmill (5 min walk at a comfortable pace) is recommended prior to exercise\nThe patient is then positioned on the strength training equipment. A conventional leg press machine is used\nTwo pressure cuffs are now positioned near the inguinal fold region on each thigh and inflated to the correspondent training pressure (50% of full vascular occlusion pressure).\nAt this time, it is important to keep the manometers facing forward, for fine tuning of the appropriate pressure.\nThe patient performs 3 sets of 15 repetitions, with 30 seconds rest periods between sets.\nNote that training pressure is maintained during the whole exercise session, including resting intervals.\nA conventional leg extension machine is also part of our exercise program. The same protocol is used on this equipment, and again, occlusion pressure is kept constant at all times.",
    "The last exercise is the half squat. A chair may be used for safety reasons, since the impaired strength ability of the IBM patient. Blood flow occlusion procedure follows the same pattern as the previous exercises\nTraining intensity is adjusted according to the gradual increase in strength so the patient would be able to perform no more than 15 repetitions. We recommend that training sessions are monitored by at least two investigators, each one controlling the occlusion pressure on each leg.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}