{
  "id": 18640,
  "origin_website": "Jove",
  "title": "Ultrasound Based Assessment of Coronary Artery Flow and Coronary Flow Reserve Using the Pressure Overload Model in Mice",
  "procedures": [
    "NOTE: All procedures were performed in mice in accordance with American Veterinary Medical Association (AVMA) guidelines and approved Institutional Animal Care and Use Committees (IACUC) protocols.\n1. Study Design\nUse 8-10 week old male C57BL/6 mice (BW~25 g) in the study.\nRandomize the mice (n = 11) into two groups, the study group selected for aortic banding (n = 8), and the control group (n = 3) to undergo sham operation via thoracotomy.\nPrepare the animal for imaging by removing hair from the chest using depilatory cream that is medical grade.\nPerform a first ultrasound (section 2) 24 hr prior to aortic banding to determine baseline parameters at Day -1, between a range of 1% and 2.5% isoflurane (mixed with 100% O2 via nosecone) induced anesthesia.\nChoose a medically approved anesthetic agent (i.e. isoflurane) and monitor the degree of anesthesia (2-3% to induce, and 1.0% to maintain).\n\tNOTE: Proper anesthesia is crucial in the maintenance of heart beat at normal physiological rates (about 500 beats/min).\nConfirm the depth of anesthesia by loss of motion from the animal in response to a pedal-withdrawal reflex. Use paralube vet ointment on the eyes to prevent dryness while under anesthesia.\nPerform surgery at Day 0 20,21.\nFor aortic banding, ligate the aorta using a 7-0 silk suture around a tapered 26 G needle placed on the arch.\n\tNOTE: Details regarding the experimental protocol, including the surgical aortic banding procedures, have been described previously 20,21.\nPerform post-surgery ultrasound imaging (section 2) at Day(s) 2, 6 and 13.",
    "Euthanize the mice on Day 14 and harvest the hearts for histological assessment. Euthanize the animals using an overdose of pentobarbital followed by removal of a vital organ such as the heart. Arrest the hearts in diastole and fix with formalin. Use the procedure of the heart harvesting that has been described previously 22.\nFix all heart tissues with buffered 10% formalin solution. For trichrome staining, embed tissues in paraffin before sectioning. Use the details of trichrome staining that have been well illustrated previously 14,23.\nAnalyze the data using offline software (section 3).\n2. Imaging Protocol\nLong and short axis images of septal coronary artery (SCA) (B- Mode)\n\t\nUsing MS550D probe with center frequency of 40 MHz connected to the active-port, set the application preset to “cardiac imaging”.\nWith the animal supine on the heated platform, and under anesthesia controlled via nose cone, position the probe using the rail system to obtain the parasternal long axis view (PSLAX) (Figure 1A). Always ensure that the animal is kept warm on the prewarmed platform and body temperature is maintained at physiologic levels. \nRotate the probe (with notch pointing caudally) clockwise such that the probe angle is 15° to the left parasternal line (long-axis view) (Figure 1B).\nAdjust the probe angle by tilting slightly along y axis of the probe to obtain a full-length longitudinal view of the SCA in the center of the screen (Figure 1B).\nOnce the proper landmarks (aortic valve and pulmonary artery) are viewed, cine store the image using the highest frame-rate possible.\nBy using the “xy” axes micro-manipulators (Figure 1D), adjust the probe position to obtain the clearest image of the SCA.\nRotate the probe 90° (with notch pointing caudally) clockwise such that notched end of the probe is to the left of midline (short-axis) (Figure 1C).",
    "Long and short axis images of SCA (Color-Doppler Mode)\n\t\nOnce a B Mode image is captured or cine-stored, click the color Doppler key on the keyboard to turn on color Doppler acoustic window (Figure 2).\n\t\tNOTE: This helps to isolate coronary artery (white arrow indicates SCA) either in the long (Figure 2A) or in the short axis (Figure 2C). Red color is as seen in real time and is indicative of the direction of flow (away from the aortic valve).\nEnsure that the focus depth (indicated by a yellow arrowhead on right of the image screen), lies in the center of coronary artery.\nEnsure that the data is recorded, using the cine-store key, at the highest possible frame rate (>100 frames/sec).\nPW Doppler Imaging of SCA (Pulsed-Wave or PW Mode)\n\t\nWhile in color-Doppler mode, click on the PW key to bring up a yellow-indicator line on the coronary artery (Figure 2, shown in red).\nPlace the yellow PW line in the middle of the coronary artery in view, at an angle that parallels the directionality of the flow. Note that velocity measurements are highly dependent on the angle of image acquisition.\nAdjust the angle of flow (PW angle key) and sample volume (SV key) such that the PW angle key is 60° or less and sample volume captures flow right in the center of the SCA.\nUse cine store to capture the wave forms that indicate the velocity of the coronary flow at peak systole (S) and diastole (D) (Figures 3A and 3B), using 1% and 2.5% isoflurane.\n3. Data Calculation and Analysis\nSelect the velocity time integral (VTI) tool to obtain the peak systolic and diastolic velocities from the images shown in Figures 3A and 3B.",
    "Calculate the coronary flow reserve index (CFR) as the ratio of hyperemic (2.5% isoflurane) peak diastolic flow velocity to baseline (1% isoflurane) peak diastolic flow velocity.\nCalculate the S/D ratio as the peak systolic coronary flow velocity/ peak diastolic coronary flow velocity. Determine the ratio at baseline (1% isoflurane) and at hyperemia (2.5% isoflurane).\nFor standard cardiac function parameters such as FS, FAC, LVM, refer to the manuals from the manufacturer to perform data analysis using proprietary software or refer to Cheng’s JoVE paper 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}