{
  "id": 5762,
  "origin_website": "Bio",
  "title": "Isolation and Quantification of Plant Extracellular Vesicles",
  "procedures": [
    "Preparing the plantsSterilize Arabidopsis seeds with 50% Bleach for no more than 5 min and wash three times with sterile dH2O. Each wash step should last 1-2 min. Plate the seeds on 0.5x Murashige and Skoog (MS) medium containing 0.8% agar (see Recipes).Wrap medical tape around the circumference of each MS plate and store the plates in the dark at 4 °C for 2 days.After 2 days, move the plates to short day conditions (9-h days, 22 °C, 150 μEm-2). Store the plates vertically and allow the seeds to germinate and grow for 7 days.Transfer the seedlings to PRO-MIX PGX. Cover the seedlings with a clear plastic dome for one week. On day 7, crack the dome. The next day, remove the dome completely. Water twice a week or as needed. Allow the plants to grow for 6 weeks total before harvest.Note: Growing seedlings on MS plates first and transferring them to soil later ensures an exact number of healthy plants for each experiment. A typical experiment requires ~36 plants for each genotype/treatment. We have found that six-week-old plants yield the optimal amount of intercellular wash fluid with the smallest risk of cellular contamination.Preparing tools for apoplastic wash collectionUsing metal forceps heated in a flame, melt 8 additional holes at the end of a 30 ml syringe (Figure 1 and Video 1). Note: These additional channels allow for the optimal collection of apoplastic wash and provide an alternate route should the primary hole become plugged.Use the heated forceps to perforate the cap of a 50 ml conical tube multiple times, creating a circle ~2.5 cm in diameter. Punch out the circle to create a hole in the middle of the cap. Soften the cap in a flame and slide it onto the 30 ml syringe until it is ~1.",
    "5-2 cm from the top. The syringe can now be screwed securely onto a 50 ml conical tube (Figure 1 and Video 1). Note: This prevents the end of the syringe from becoming submerged in the apoplastic wash.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170829/20170829184610_8096.jpgFigure 1. Tool for apoplastic wash collection. Apoplastic wash is collected by packaging whole Arabidopsis thaliana rosettes in a 30 ml syringe. Eight additional holes are melted into the end of the syringe with forceps to create channels for the wash to flow through. A 2.5 cm hole is punched out of a 50 ml conical tube cap. The cap is then slid onto the syringe 2 cm from the top. This allows the syringe to be screwed securely into a 50 ml conical tube. See Video 1.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. EV isolation demonstration. This video demonstrates how to prepare the syringe and conical tube apparatus shown in Figure 3, and the procedures for extracting apoplastic wash fluid from leaves and subsequent purification of EVs from this fluid.Collecting the apoplastic washNote: An overview of the workflow from apoplastic wash collection to DiOC6 quantification can be seen in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170829/20170829184848_7471.jpgFigure 2. General workflow. Apoplastic wash is collected by vacuum infiltrating full Arabidopsis rosettes with an isotonic buffer, washing out the infiltrated buffer using a low-speed centrifugation spin and filtering the wash to remove any large debris. The wash fluid is then processed using differential centrifugation to isolate EVs, which can be stained with the lipophilic dye DiOC6. After the EVs are washed and pelleted again to remove excess dye, DiOC6 fluorescence in the EV pellet can be measured to indirectly quantify the amount of EVs.Using scissors cut each Arabidopsis plant off at the root.Note: Leaving a little of the root will help later on with manipulating the rosettes. See Video 1.",
    "Collect the harvested rosettes in a 1 L plastic beaker and record the mass.Note: Include three biological replicates for each treatment/genotype. The replicates should all be the same volume and should not be less than 0.5 ml. It takes ~3 g of rosettes to collect ~0.5 ml of apoplastic wash.Rinse the rosettes 3 times with water to remove soil particles.Carefully place the rosettes in the French press with 300-500 ml of vesicle isolation buffer (VIB) (see Recipes). Place the lid on the French press and gently lower the plunger until the plants are fully submerged.Place the French press, plants and buffer in a vacuum chamber. Apply the vacuum for 20 sec.Remove the French press from the vacuum chamber, take the lid off and pour the VIB into a separate 1 L plastic beaker. Remove the rosettes from the French press.Note: The VIB can be reused multiple times on the same day, but, once used for vacuum infiltration, the VIB should not be stored for use on another day.Remove excess VIB from the plants by gently shaking them by the roots and then brushing the leaves across a paper towel.Place the rosettes root down on top of the opening of a 30 ml syringe (Figure 3A). Gently prod and coax the rosettes into the syringe without crushing or tearing the leaves (Figure 3B). Once the rosettes are in far enough, tapping the syringe on a hard surface will force them fully into the syringe (Figure 3C).Note: The rosettes can be inserted in stacks of 2 or 3. Typically, 4-6 six-week-old rosettes will fit inside a 30 ml syringe. The rosettes should not be so tightly packed as to damage the tissues or obstruct the flow of apoplastic wash out of the syringe. See Video 1.",
    "Screw the syringe into a 50 ml conical tube (Figure 3D) and place the tube and syringe in a 250 ml plastic bottle (Figure 3E). The cap secured around the top of the syringe should prevent the tube from falling into the bottle.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170829/20170829185106_1839.jpgFigure 3. Packaging rosettes for apoplastic wash extraction. A. The rosettes are placed root-down on the top of the syringe. B. The rosettes are gently prodded into the syringe. C. The syringe is tapped on a hard surface to force the rosettes into it. D. The syringe is screwed into a 50 ml conical tube. E. The rosettes, syringe and 50 ml conical tube is placed into a 250 ml plastic bottle, which is then placed into a JA-14 rotor for centrifugation. See Video 1.Place the syringe, 50 ml conical tube and bottle into the slot of a centrifuge rotor and centrifuge for 20 min at 700 x g, 4 °C.Note: This step is designed for a JA-14 fixed-angle rotor.Remove each syringe and conical tube from the centrifuge while carefully maintaining the tube’s angle. Unscrew the syringe and remove the apoplastic wash from the bottom of the tube. Make sure to avoid any pelleted soil particles. Transfer the apoplastic wash to a sterile 15 ml conical tube and keep the sample on ice.Using a 10 ml syringe, filter the apoplastic wash through a 0.45 μm filter into a new, sterile 15 ml conical tube.Note: The filtration step is a precaution meant to remove large pieces of debris. This step can result in the loss of apoplastic wash and can be skipped if the volume of apoplastic wash is small (~500 μl). In these cases, the 10,000 x g centrifugation should be enough to remove any debris.",
    "EV isolation and DiOC6 stainingTransfer each volume of apoplastic wash to ultracentrifuge tubes. Bring the volume in each tube up to the tube’s maximum volume using chilled VIB.Centrifuge for 30 min at 10,000 x g, 4 °C.Carefully, transfer the supernatants to new ultracentrifuge tubes using a pipet.Note: Maintain the position of the tube after centrifugation and be careful to angle the pipet away from any debris that may have pelleted.Centrifuge for 60 min at 40,000 x g, 4 °C.Decant the supernatant and remove any excess buffer from the opening of the tube with a pipet. Resuspend the pellet in 100 μl of 100 μM DiOC6 in 20 mM Tris-HCl pH 7.5 (see Recipes). Add 1% plant protease inhibitor cocktail (PIC) and 0.2 mM DPDS to the DiOC6 staining solution (see Recipes) if the EVs will be used for an immunoblot after DiOC6 quantification. Note: When using small volumes of apoplastic wash, the EV pellet is invisible. A thin, translucent pellet can appear when using large volumes of apoplastic wash (≥ 12 ml). To effectively resuspend the pellet, use a pipet to repeatedly wash the side of the tube containing the pellet with half the added DiOC6 solution.Transfer the resuspended vesicles to a PCR tube and heat at 37 °C for 10 min in a thermal cycler.Transfer the sample to a new, clean ultracentrifuge tube and bring the volume up to the tube’s maximum volume using chilled 20 mM Tris-HCl pH 7.5.Centrifuge for 60 min at 40,000 x g, 4 °C. Decant the supernatant and use a pipet followed by a Kim-wipe to remove excess buffer for the opening and upper regions of the tube.Note: It is important to wipe out remaining buffer immediately after decanting, while the centrifuge tube is still upside down.",
    "Carefully removing all excess buffer ensures that each pellet is resuspended in the same total volume.Resuspend the pellet in 52 μl of vesicle resuspension buffer (20 mM Tris-HCl pH 7.5, see Recipes).Note: Add 1% plant protease inhibitor cocktail (PIC) and 0.2 mM DPDS to the vesicle resuspension buffer if the EVs will be used for an immunoblot after DiOC6 quantification.Collecting fluorometric dataAdd 50 μl of each sample to wells in a black polystyrene, 96-well, half-area, flat-bottom EIA/RIA plate.Note: For a typical experiment, there are three kinds of samples: a negative control of buffer (20 mM Tris-HCl + 1% plant PIC and 0.2 mM DPDS) to account for background signal, a positive control to determine vesicle secretion under mock conditions or in a genetically wild-type background, and the test sample to determine the effect of a treatment or mutation on vesicle secretion. As previously stated, include three biological replicates for each sample.Insert the plate into the fluorometric microplate reader. Excite the samples at 485 nm and record fluorescent emissions at 535 nm. Take three readings of each plate.Note: After recording fluorescence, the samples remain useful for a number of different assays, including staining for transmission electron microscopy, fluorescent light microscopy and immunoblots.EV purificationNote: Differential centrifugation yields a crude EV preparation that may contain other components of the apoplast. In-depth studies of EV composition require a further purification. The following protocol is designed to separate EVs out from other contaminants using a discontinuous iodixanol density gradient. An overview of the purification process can be seen in Figure 4.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170829/20170829185733_1690.jpgFigure 4. Workflow for purification of EVs. Crude EVs are loaded on top of a discontinuous iodixanol gradient and centrifuged for 17 h at 100,000 x g, 4 °C. Following centrifugation, three EV-containing fractions are isolated.",
    "These fractions are washed and re-pelleted to remove the iodixanol. All three samples of EVs are then combined into a single tube, washed and pelleted to create one purified EV sample.Bring the volume of the isolated, crude EV preparation to 0.5 ml using sterile, cold VIB. Leave the sample on ice.Prepare iodixanol solutions of 40% (3 ml, v/v), 20% (3 ml, v/v), 10% (3 ml, v/v), and 5% (2 ml, v/v) using aqueous 60% iodixanol (OptiPrep) and sterile, cold VIB.Using a transfer pipet, add the iodixanol solutions to an ultracentrifuge tube. Carefully layer the solutions on top of one another, starting with the 60% solution and ending with the 5% solution. Lastly, add the 0.5 ml of crude EVs to the top of the gradient.Centrifuge in a swinging-bucket rotor for 17 h at 100,000 x g, 4 °C.Using a pipet, remove and discard the first 4.5 ml from the top of the gradient.Collect the next three volumes of 0.7 ml as individual samples.Transfer each sample to a fixed-angle ultracentrifuge tube. Bring each sample up to 3.5 ml using sterile, cold 20 mM Tris-HCl, pH 7.5.Centrifuge for 60 min at 100,000 x g, 4 °C.Decant the supernatant and resuspend and combine the three pellets in 3 ml of sterile, cold 20 mM Tris-HCl, pH 7.5.Centrifuge for 60 min at 100,000 x g.Decant the supernatant and remove excess buffer from the mouth of the tube using a Kim-wipe.Resuspend the pellet in 50 μl of sterile, cold 20 mM Tris-HCl.Notes: Purifying plant EVs requires a larger starting volume of apoplastic wash (~12-50 ml). A pale, milky pellet is visible when using larger volumes of apoplastic wash. However, a band is not visible in the discontinuous iodixanol gradient because the EVs are spread over a wider area."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}