{
  "id": 10547,
  "origin_website": "Jove",
  "title": "An Additive Manufacturing Technique for the Facile and Rapid Fabrication of Hydrogel-based Micromachines with Magnetically Responsive Components",
  "procedures": [
    "1. Fabrication Stage\nAssemble the fabrication (Figure 1) set-up consisting of an in-house built stage and PDMS chamber in which the hydrogel components are polymerized. The fabrication stage consists of an acrylic top, in which tracks and channels were machined to allow for vacuum connections, a holder for the fixture of a micrometer head within the vacuum-enabled stage, and threaded steel posts that allow the entire stage to be fixed onto steel base for stabilization.\nFix the head of the micrometer with an acrylic piece that is machined to have tracks for vacuum connection. Vacuum connections allow the user to hold down the PDMS chamber as well as move the flexible membrane within the PDMS chamber.\nPosition a UV light source (320 - 500 nm) above the fabrication stage such that the incident angle of the light is perpendicular to the horizontal plane of the stage (Supplementary Figure 1).\n2. Fabrication of PDMS Chamber and Determining its \"Zero\" Level\nMake a PDMS chamber in which the hydrogels will be polymerized (See Figure 1A, PDMS chamber). This chamber consists of a PDMS well with a flexible membrane onto which a glass coverslip is bonded. The glass coverslip that is bonded to the flexible PDMS membrane is further treated to prevent adhesion of hydrogels (step 2.1.7).\n\t\nPrepare a 9 part PDMS base to 1 part curing agent mixture (by weight).\nStir well with a glass rod to ensure that the base and curing agents are well mixed. Centrifuge at 1,000 x g to remove air bubbles.",
    "Carefully pour the PDMS mixture into two glass Petri dishes to yield a thick layer (~3 mm) and a thin layer (~0.2 mm). Place PDMS-filled Petri dishes on a flat, level surface and cure overnight at room temperature or for 30 minutes in an oven with temperature set at a minimum of 75 °C.\n\t\tNOTE: A thin layer of PDMS is required for the base of the PDMS chamber as it ensures the generation of a flexible layer that can be easily moved in the z-direction by the micrometer screw gauge. The PDMS layers have to be flat and level to ensure that the polymerized hydrogel layers are of uniform thickness.\nAfter the PDMS is fully cured, cut a 4 cm diameter circle into the thick layer using a scalpel blade or penknife. Peel the thick PDMS layer off from the glass Petri dish. Place the thick PDMS layer (bottom-side up) and the thin PDMS layer (still in the glass Petri dish) into a plasma oven.\nPlasma treat the two PDMS layers (30 s, air plasma) and bond the bottom side of the thick PDMS layer to the top-side of the thin PDMS layer. Remove the bonded pieces from the glass Petri dish to form a circular well with the thin layer forming a flexible membrane base.\n\t\tNOTE: Prior to removal of the bonded layers from the glass Petri dish, the two bonded layers can be placed on a hot plate at 95 °C to encourage bonding of the layers.",
    "Plasma bond a glass coverslip (no. 2, 22 mm x 22 mm) to the top-side of the flexible PDMS membrane; plasma treat both the glass coverslip and PDMS chamber from step 4 for 30 s (air plasma) and place the glass coverslip in contact with the top-side of the flexible membrane base to bond it to the membrane.\nVapor silanize the PDMS chamber with trichloro (1H, 1H, 2H, 2H -perfluorooctyl) silane (PFOTS) for at least 30 minutes; place the PDMS chamber in a vacuum desiccator along with a small Petri dish with 60 µL of PFOTS and connect the sealed desiccator to the central laboratory vacuum system. Leave the desiccator connected to the vacuum system for at least 30 minutes.\n\t\t\nEnsure that the vacuum seal of the desiccator is generated and that the droplet of PFOTS \"bubbles\" after 5 - 10 minutes. Vapor silanization of the PDMS chamber allows facile removal of formed hydrogel layers and prevents strong adhesion of polymerized PEG hydrogels to the glass surface after prolonged use.\nTo determine the \"zero\" level of the PDMS chamber, place it on a vacuum-enabled stage (connected to laboratory central vacuum system).\n\t\nApply negative pressure to hold the PDMS chamber down. The PEG hydrogel structures will be polymerized within this PDMS chamber (Figure 1A, Fabrication area).\nPlace an untreated glass coverslip on top of the PDMS chamber such that it covers the well. The distance between the top glass coverslip (top substrate) and the bottom glass coverslip (bottom substrate) defines the thickness of the hydrogel layer that is formed within the PDMS chamber.",
    "Using the micrometer head, push the bottom substrate upwards until it is in contact with the top substrate. Use the reading on the micrometer head as the \"zero\" level of the PDMS chamber and as a reference when defining the thickness of the polymerized hydrogel layers.\n3. Photomask Design for Photopolymerization of Hydrogel Microstructures\nTo design the photomasks, use CAD software.\nDesign each unique layer of the hydrogel structure that is to be fabricated. Refer to Figure 2 for the example device fabricated using this protocol. Figure 2 shows 3D schematic of this device, the corresponding layers to be fabricated as well as the photomasks that were designed for the fabrication of these individual layers.\nDesign photomasks in dark field; features to be polymerized should be transparent and the background is opaque (Figure 2C, Supplementary Figure 2).\nIncorporate alignment marks into the photomask designs to facilitate alignment of the photomasks during the fabrication process.\nPrint the designs as transparency photomasks at the highest resolution available and at high pixel densities.\n4. Treatment of Glass Coverslips to Prevent Adhesion of Hydrogels\nTo create surfaces that repel the polymerized PEG hydrogels, glass coverslips are coated with a thin layer of PDMS.\nPrepare PDMS (9:1 base to curing agent ratio) and centrifuge at 1,000 x g to remove air bubbles.\nApply a thin coat of PDMS to cleaned glass coverslips and leave to cure on a flat, level surface within an oven (>75 °C, 30 min).\n5. Layer-by-layer Fabrication of Hydrogels: Top Sealing Layer and Bottom Support Structures\nTo create a hydrogel layer that will subsequently be used to seal the formed device, use an untreated piece of glass coverslip (No.2) as a \"lid\" for the PDMS chamber. This \"lid\" is referred to as the top substrate.",
    "Starting from the \"zero\" level of the device, lower the bottom substrate using the micrometer head to the desired height. The distance between the top and bottom substrates defines the thickness of the first hydrogel layer (Z1, Figure 3A).\nDeposit a small volume of the PEGDA prepolymer (e.g., a mixture of 400Da PEGDA with 1% Darocur 1173), sufficient to cover the bottom substrate.\nPlace the top substrate onto the PDMS chamber.\n\t\tNOTE: It is important to ensure that there are no air bubbles trapped between the top and bottom substrates.\nPlace a photomask with desired design on top of the top substrate (Figure 2C (i)). Ensure that the mask is in full contact with the top substrate and aligned to the bottom substrate.\nExpose the hydrogel prepolymer to UV light through the photomask (Step 1, Figure 3A). Ensure that exposure is done within an enclosed space that prevents stray UV light exposure to the surrounding area.\n\t\tCaution: Wear UV protection (e.g., UV goggles) when operating the system.\n\t\tNOTE: The power and duration of exposure depends on the type of UV system and PEGDA prepolymer used.\nFor example, for a 200 W UV lamp and 99% PEGDA (400 Da PEGDA with 1% photoinitiator (v/v)) prepolymer solution, set the lamp power at 16% (corresponding to ~2.3 W/cm2) and fully cure the hydrogels within 4 seconds. The duration of exposure should be increased with decreasing lamp power and increasing PEG chain length of the prepolymer used.\nAfter the hydrogel layer has been polymerized, lift the top substrate off the PDMS chamber. The polymerized layer should be adhered onto the top substrate (inset for Step 1, Figure 3A). Reserve this adhered layer for use later to seal the assembled device. Shield this polymerized layer from light.",
    "NOTE: Keep this polymerized layer away from light and wet with excess uncrosslinked prepolymer to prevent the layer from drying out and cracking.\nTo create the bottom support structures, use PDMS-coated glass coverslips as the top substrate of the PDMS chamber.\n\t\nDeposit more hydrogel prepolymer onto the bottom substrate and cover the PDMS well with a PDMS-coated glass coverslip. This is to ensure that the polymerized layers remain on the bottom substrate, allowing the user to build layers upwards (Step 2, Figure 3A).\nRepeat steps 5.1.4 and 5.1.5 with the desired photomask design (Figure 2c (iii)).\nRemove the top substrate and add more PEGDA prepolymer and lower the bottom substrate using the micrometer head to the desired level. This level should correspond to the thickness of the 2nd layer of hydrogel to be polymerized (Z2, Step 3, Figure 3A).\nCover the PDMS well with the top substrate (PDMS-coated glass) and repeat steps 5.1.4 and 5.1.5.\nContinually build up layers of hydrogel as desired using steps 5.2.1 and 5.2.2 until the desired support structures are formed.\n6. Assembling and Sealing the Hydrogel-based Device\nTo assemble and seal the device, first remove the top substrate (PDMS-coated glass) and using a pair of tweezers, place pre-formed hydrogel components (e.g., gears, iron-doped components) onto the support structures (Part (i), Step 4, Figure 3A).\n\tNOTE: A permanent magnet may be used to align any iron-doped components (refer to iron oxide doping of hydrogel components for fabrication steps).\nTo seal the device, first bring the bottom substrate to the final desired height of the assembled device using the micrometer screw gauge. This should be the final height of the device, taking into account the thickness of the layers, interior components and any clearances given for moving components (Z4, Step 5, Figure 3A)",
    "Place the pre-formed hydrogel layer adhered onto the untreated glass coverslip from 5.1 onto the partially assembled device (Part (ii), Step 4, Figure 3A). Carefully place the pre-formed layer such that it is correctly aligned to the structures below it.\nPlace a photomask that allows for the sealing of the device but protects the interior moving components from UV exposure. Ensure that the moving components are not polymerized to the edges of the device, preventing their movement during actuation.\nExpose the entire structure to UV light (Part (i), Step 5, Figure 3A).\nLift the glass coverslip from the fabrication stage. The sealed device should adhere to the top substrate ((Part (ii), Step 5, Figure 3A).\n\t\tNOTE: If the device remains adhered to the bottom substrate, carefully lift the device with a pair of flat-tipped (non-serrated) tweezers or a flat spatula.\nCarefully remove excess unpolymerized PEGDA using vacuum suction and carefully lift the device off the glass coverslip using a pair of flat tweezers or flat spatula.\nPlace the device into saline solution or DI water. Hydrogels swell in solution. Leave the device in solution for at least 30 minutes to allow for stabilization and expansion of the device and the interior components.\n\t\tNOTE: If the device is to be used for in vivo implantation, it is important to rinse and leach off any uncrosslinked prepolymers. This can be done by changing the solution in which the device is incubated in every hour (at least 3 rinses) and leaving the device in solution overnight, and rinsing off with more solution.",
    "Remove air within the device by placing the device within a Petri dish filled with DI water or saline within a vacuum chamber (connected to central laboratory vacuum systems) for at least 30 minutes. This will result in degassing of the device and the device will be filled with solution once negative pressure is removed.\n\t\tNOTE: Keep the device hydrated/in solution at all times. The device may crack should it be left to dry out.\n7. Iron Oxide Doping of Hydrogel Components\nPrepare a PEGDA prepolymer solution with 1% photoinitiator (e.g., 99% (v/v) PEGDA (400 Da) with 1% Darocur 1173).\n\t\nUsing this prepolymer solution, make a 5% (w/v) solution of iron-oxide (II, III) nanoparticle solution. Weigh out 5 mg of iron oxide nanoparticles and add 100 µL of PEGDA prepolymer. Pipette up and down and vortex to ensure uniform mixing.\nEnsure that nanoparticles are homogenously dispersed within the PEGDA prepolymer before each use as the nanoparticles will sediment over time.\nPipette a small volume of the iron oxide - PEGDA prepolymer mixture onto the bottom substrate of the PDMS chamber.\nCover the PDMS well with the top substrate (PDMS-coated glass) to ensure that the formed hydrogels remain on the bottom substrate.\nBring the bottom substrate to the desired height using the micrometer head.\n\tNOTE: Thin layers (200 µm) of iron oxide-doped PEGDA should be polymerized with each single exposure. This is due to the decrease in depth of penetration of the UV light as the iron oxide nanoparticles are opaque and are able to absorb and block UV light.\nUsing a photomask that defines the shape of the segment to be doped with iron oxide within the moving component, expose the thin layer of iron oxide doped prepolymer to UV light (Figure 4(i)).",
    "NOTE: UV exposure time should be increased to ensure that the iron-doped segment is fully cross-linked (~10 seconds).\nLower the bottom substrate and repeat step 6, building the iron-doped segment in thin layers each time to the desired height (Figure 4(ii)). A total of 5 layers should be polymerized to yield a 1mm tall iron-doped segment.\nAfter the iron-doped segment is complete (Figure 4(iii)), remove any excess iron-doped prepolymer using vacuum suction. Do not remove the iron-doped segment from the fabrication stage.\nDeposit the PEGDA prepolymer (undoped) onto the polymerized iron-doped segment. Bring the bottom substrate to the final height of the component to be completed. Cover the PDMS well with the top substrate (PDMS-coated glass).\nUsing a photomask that defines the entire shape of the moving component, expose the PEGDA prepolymer, as well as the iron-doped segment, to UV light (Figure 4(iv)).\nRemove the top substrate and remove excess unpolymerized PEGDA prepolymer using vacuum suction. A PEG component with a doped iron-oxide segment should remain on the bottom substrate. Gently lift this component using a pair of tweezers.\nReserve this iron-doped component for assembly onto support structures of a PEG-based device (Part (i), Step 4, Figure 3A). Shield this component from light and ensure that it remains wetted with uncrosslinked prepolymer before use.\n8. Actuation of the Assembled Device\nNOTE: The iron-doped components within the assembled device can be actuated to move using a strong permanent magnet such as neodymium (N52 strength). Be careful to avoid pinching hazards as these magnets are very strongly attracted to ferromagnetic materials.\nPlace a neodymium magnet below or above the device within 1 - 2 cm away from the device. While moving the magnet, the movement of the iron-oxide doped components should shadow the movement of the magnet.",
    "NOTE: An actuator can be built using a motor that is attached with a magnet. The rotation of the motor should allow for rotational actuation of the iron doped component."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}