{
  "id": 7362,
  "origin_website": "Bio",
  "title": "Comprehensive Identification of Translatable Circular RNAs Using Polysome Profiling",
  "procedures": [
    "Preparation of sucrose gradient (Figure 1)Prepare 500 ml of 10× polysome buffer in nuclease free water and 500 ml of 70% (w/v) sucrose solution in 1× polysome buffer (see Recipes). Filter solutions with Vacuum Filtration Systems.Prepare 10% (w/v) and 50% (w/v) sucrose solution with 70% (w/v) sucrose solution (see Recipes).Add the 10% and 50% sucrose solution, in that order, into a Beckman polypropylene centrifuge tube at room temperature.Note: Add a half tube of 10% sucrose solution first and then the 50% sucrose solution to the bottom of the tube under the 10% solution using a needle. Load the centrifuge tube on the gradient master to make a 10-50% (w/v) sucrose gradient. Sucrose gradients can be used immediately or stored long-term at -80°C (no more than 2 weeks) (see Note 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4167/bioprotoc-11-18-4167-g001.jpgFigure 1. Protocol for Sucrose Gradient Preparation Sample preparationNote: Cool all the solutions and buffers before use. Keep the samples on ice all the time if possible. Seed the cells in 10 cm or 15 cm dishes one day before the experiment (see Note 2 and Table 1).Table 1. Recommend schedule of this protocol imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210915/20210915195828_2507.pngAdd 100 μg/ml cycloheximide into the culture medium and incubate cells at 37°C for 10 min.Discard the medium and wash the cells with 10 ml ice-cold PBS containing 100 µg/ml cycloheximide twice.Add 10 ml ice-cold PBS to cells and harvest the cells with cell scraper.Transfer the cell suspension into 15 ml centrifuge tube and centrifuge at 1,000 × g for 3 min at 4°C.Remove the supernatant and add 250 μl lysis buffer to 15 ml centrifuge tube.Lyse the cells by gently pipetting and transfer the lysate into a 1.5 ml Eppendorf tube.Keep cell lysate on ice for 10 min and centrifuge the lysate at 14,000 × g for 10 min at 4°C to remove cell debris.",
    "Transfer the supernatant into a new 1.5 ml Eppendorf tube.Dilute 1 μl samples with 999 μl water, and measure the approximate RNA concentration using a NanoDrop photo-spectrometer (see Note 3).Keep the samples on ice for immediate use or freeze them in liquid nitrogen immediately and store at -80°C until use (no more than one month).Polysome profilingRemove the same volume of solution as that of the loading sample from the top of the 10-50% sucrose gradient and then load the samples onto the sucrose gradient. The optimal loading volume is 200-500 μl (see Note 3). Keep 10% of lysates as an input.Centrifuge at 35,000 × g for 2.5h at 4°C using the SW41 rotor in a Beckman Ultracentrifuge.Set up the density gradient fractionation system while the samples are centrifuging. Fill the syringe with chasing solution [70% (w/v) sucrose with bromophenol blue], flush the line, and calibrate the ultraviolet spectrophotometer following the equipment instructions.Gently remove tubes from the rotor and put them into the density gradient fractionation system. Alternatively, keep them at 4°C until use (no more than 4 h).Load the sample under the UA-6 Detector and puncture the bottom of the tube, communicating the syringe pump and detector system (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4167/bioprotoc-11-18-4167-g002.jpgFigure 2. Protocol for Density Gradient Fractionation System Set-off Number the 2 ml Eppendorf tubes and place them onto the R1 Fraction Collector.Note: About 750 μl of sample will be collected in each tube. Set syringe pump at 1.5 ml/min flow rate and switch on remote model. Set the fraction collector by time.Turn on density gradient fractionation system using Peak chart software. Record the data with Peak chart (see Figure 3) and collect the fractions with the fraction collector.Store the samples at -80°C until use (no more than one month).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4167/bioprotoc-11-18-4167-g003.jpgFigure 3.Example of Polysome Profiling.",
    "The absorbance of OD254 (A254) that represents the abundance of RNA fragments was measured by UA-6 detector. The sucrose gradient was fractionated into 17 fractions with Density gradient fractionation system. The value of A254 was recorded by Peak Chart and plotted as shown.RNA-seq library preparationAdd 750 μl of TRIzol into each tube, and extract the RNAs according to the manufacturer’s instruction (use chloroform, isopropanol, and 70% ethanol to separate RNAs from samples and elute in about 30 μl water) or store at -80°C.Pool RNA samples in free, monosome, light polysome or heavy polysome fractions with equal volume, respectively (e.g., as shown in figure 3, fraction 1 was termed “free fraction,” fraction 6-7 was termed “monosome fraction,” fractions 8-10 were pooled with equal volumes and termed “light polysome fraction,” and fractions 11-16 were pooled with equal volume and termed “heavy polysome fraction”).Measure the RNA concentration of each RNA mixture with NanoDrop.Treat the RNAs with DNase I (RNase free) at 37°C for 15 min.2 μg of RNA                     x μlDNase I                             1μl10× DNase I buffer         5 μlWater                          44-x μlClean up the RNAs using the ZYMO RNA clean and concentrator kit according to the manufacturer’s instructions.Treat the DNase I treated RNAs with RNase R at 37°C for 30 min (see Note 4).1 μg of RNA                          x μlRNase R                               1 μl10× RNase R buffer           5 μlWater                              44-x μlClean up the RNAs using the ZYMO RNA clean and concentrator kit according to the manufacturer’s instruction (eluted RNAs in 20 μl water).Construct the RNA-seq libraries with the KAPA stranded RNA-seq kit with RiboErase according to the manufacturer’s instruction.Sequence the libraries using a 150 bp paired-end approach with a 100 million read depth per sample.Note: We recommend Illumina HiSeq® 3000/HiSeq 4000 Sequencing Systems for RNA-seq.",
    "Identification of translatable circRNAsPerform quality control on raw sequencing reads and trim the adaptor sequences. Discard the low-quality reads. Trim the adaptor sequences from the reads and map them to the genome.Align the reads to the reference genome with TopHat2, and map the unmapped reads with TopHat-Fusion.Annotate and assembly the circRNA transcripts using the CIRCexplorer2 pipeline (see details in GitHub: https://circexplorer2.readthedocs.io/en/latest/[href=https://circexplorer2.readthedocs.io/en/latest/]) (Zhang, X. O. et al., 2016)."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}