{
  "id": 17722,
  "origin_website": "Jove",
  "title": "External Cephalic Version: Is it an Effective and Safe Procedure?",
  "procedures": [
    "This study was approved by the Clinic Research Committee of the \"Virgen de la Arrixaca\" at the University Clinical Hospital. Written informed consent was obtained from all participants.\n1. Offer external cephalic version at consult (36 weeks)\nIdentify the fetal position with an ultrasound.\n\t\nApply ultrasound gel on the patient’s abdomen.\nPlace the abdominal probe on the hypogastric region.\nIdentify the fetal position.\nOffer external cephalic version.\nHave the patient sign informed consent.\n2. Admit in the obstetric emergency room (≥37 weeks)\nIdentify the fetal position with an ultrasound.\n\t\nApply ultrasound gel on the patient’s abdomen.\nPlace the abdominal probe on the hypogastric region.\nIdentify the fetal position.\nPrepare the patient and check requirements (blood test and informed consent).\n3. Admit in the obstetric delivery room\nPerform cardiotocography assessment for fetal well-being.\nAdd 10 mL of ritodrine in 500 mL of glucose solution.\n30 minutes before the procedure, administer 6 mg of ritodrine at 60 mL/h.\nInvite the patient to empty her bladder.\nStop ritodrine perfusion before moving to the obstetric operating room.\n4. External cephalic version procedure in obstetric operating room\nMove to the obstetric operating room.\nMonitor maternal vital signs (heartrate, EKG, temperature, noninvasive blood pressure, oxygen saturation).\nIdentify the fetal position with an ultrasound.\n\t\nApply ultrasound gel on the patient’s abdomen.\nPlace the abdominal probe on the hypogastric region.\nIdentify the fetal position.\nPosition the patient in Trendelenburg (15°).\nPerform analgesia.\n\t\nSedate the patient with 1-1.5 mg/kg propofol IV.\nAlternatively: Provide spinal anesthesia with 10 mL of 0.1% bupivacaine.\nExternal cephalic version procedure (2 attempts)\n\t\nApply an abundant quantity of ultrasound gel on the patient’s abdomen.\nPlace hands in the hypogastric region to identify the fetal buttocks (Obstetrician A).\nElevate fetal buttocks (Obstetrician A).\nPlace hands in the patient’s abdomen to locate the fetal head (Obstetrician B).",
    "Guide the fetal buttocks to the fundus (Obstetrician A).\nConsecutively direct the fetal head to the pelvis (Obstetrician B).\nIdentify the fetal well-being with ultrasound.\n\t\nPlace the abdominal probe on the abdomen.\nIdentify the fetal heart.\nObserve the fetal heart rate for at least a minute.\nCheck for vaginal bleeding.\nIdentify the fetal position with ultrasound.\n\t\nPlace the abdominal probe on the hypogastric region.\nIdentify the fetal position.\n5. Move to obstetric delivery room\nPerform cardiotocography assessment for fetal well-being for at least 4 hours.\nDischarge the patient.\n6. Admit in obstetric emergency room (24 h post-procedure)\nPerform cardiotocography assessment for fetal well-being for 30 minutes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}