{
  "id": 10937,
  "origin_website": "Jove",
  "title": "Generation and Grafting of Tissue-engineered Vessels in a Mouse Model",
  "procedures": [
    "Perform all animal experiments according to protocols approved by the Institutional Committee for Use and Care of Laboratory Animals.\n1. Preparation of Culture Media\nMake culture media for human fibroblast cell line CCL-153: F-12K Medium, 10% fetal bovine serum (FBS) and 100 U/ml penicillin and streptomycin.\nMake Reprogramming Media for PiPSC generation: Knockout Dulbecco’s modified eagle’s medium (DMEM) containing 20% Knockout Serum Replacement, 0.1 mM β-mercaptoethanol, 0.1 mM Minimum Essential Medium (MEM) Non-Essential Amino Acids, 10 ng/ml basic Fibroblast Growth Factor 2 (bFGF-2) and 100 U/ml penicillin and streptomycin. Add bFGF-2 freshly each time before using the media.\nMake Differentiation Media (DM) to induce smooth muscle cell (SMC) differentiation: α-MEM media containing 10% FBS, 0.1 mM β-mercaptoethanol, 100 U/ml penicillin and streptomycin and 25 ng/ml Platelet Derived Growth Factor (PDGF-ββ).\nMake Endothelial Differentiation Media (EC-DM) to induce endothelial cell (EC) differentiation: Endothelial growth media-2 (EGM-2) media containing 50 ng/ml Vascular Endothelial Growth Factor (VEGF) and 100 U/ml penicillin and streptomycin.\n2. Reprogramming Human Fibroblasts into Partially-induced Pluripotent Stem Cells (PiPSC)\nCulture human fibroblast cell line CCL-153 on 0.04% gelatin solution coated flasks in culture medium.\nPassage cells every 3 days at a ratio of 1:6. Use cells before passage 9 for optimal efficiency of PiPSC generation. Cells are ready for transfection upon reaching 80 - 90% confluency.\nLinearize polycistronic plasmid pCAG2LMKOSimO containing 4 reprogramming factors octamer-binding transcription factor 4 (OCT4), SOX2, Kruppel-like factor 4 (KLF4) and C-MYC (pCAG-OSKM). Digest 5 µg of plasmid with 5 units of PvuI restriction enzyme for 3 hr at 37 °C. Purify the plasmid with a commercial kit according to manufacturer’s protocol.",
    "Transfect 2 x 106 human fibroblasts with 4 µg of linearized pCAG-OSKM plasmid by electroporation with human dermal fibroblast (NHDF) nucleofection kit according to manufacturer’s protocol. Gently seed transfected cells onto pre- 0.04% gelatin coated T25 flask containing 5 ml of pre-warmed Reprogramming Media.\nAfter 24 hr, change medium with supplements of 25 µg/ml neomycin to select a pure population of transfected cells.\nChange medium every other day until day 4.\n\tNote: Human fibroblasts become PiPSC after 4 days of reprogramming.\n3. Differentiation of PiPSC into Endothelial and Smooth Muscle Cells\nSeed PiPSC on collagen IV pre-coated dishes containing DM for 4 days to induce differentiation into SMCs. Change medium every other day until day 4.\nSeed PiPSC on collagen IV pre-coated dishes containing endothelial-DM for 6 days to induce differentiation into endothelial cells. Change medium every other day until day 6.\n4. Decellularized Aorta Graft Preparation\nNote: All solutions and equipment should be sterile.\nSacrifice the mouse by cervical dislocation and fix the mouse in a supine position under dissection microscope.\nCut through the sternum and around the rib cage to open the thoracic cavity. Remove the heart, lungs and esophagus to expose the aorta. Gently remove the peri-aorta fat with forceps.\nCut the aorta from the anterior end with scissors and gently hold the end with blunt forceps. Detach the aorta from the spine column behind by blunt dissection. Carefully close all the branching arteries from the aorta by ligation with a bipolar electrocoagulator and cutting from the far end of the ligation with scissors.\nUse a 5 ml syringe to flush the aorta lumen with 3 ml of saline solution containing 100 U of heparin to prevent the formation of blood clots.",
    "Cut the posterior end of the aorta before it branches into the renal. Keeping the integrity of the aorta is very important during the whole procedure.\nFlush the aorta lumen with 5 ml of 0.075% sodium dodecyl sulphate (SDS) solution diluted in phosphate buffered saline (PBS).\nSoak the thoracic aorta in 0.075% SDS solution in a 10 cm Petri dish. Place the Petri dish on an orbital shaker for 2 hr at 150 rpm at RT.\nFlush the aorta lumen with 5 ml of PBS.\nSoak the aorta in PBS in a 10 cm Petri dish. Place the Petri dish on the orbital shaker for 2 hr at 150 rpm at RT. Refresh PBS every 20 min.\nFlush the aorta lumen with 5 ml of PBS.\nKeep decellularized aorta graft in PBS at 4 °C for up to one week.\n5. Dual Seeding of PiPSC and Bioreactor Conditioning\nNote: All solutions and equipment should be sterile. Perform all operations in a tissue culture hood.\nAssemble the bioreactor flow circuit as illustrated in Figure 1. Connect incubation chamber, media reservoir, peristaltic pump and compliance chamber with tubing. Minimal volume of medium needed for circulation is 40 ml.\nPre-condition the decellularized vessel with culture medium by soaking the aorta in DM medium in a 10 cm Petri dish. Place the Petri dish on the orbital shaker for 1 hr at 50 rpm at RT.\nInsert 1 cm length Nylon tubes (OD 0.9 mm, ID 0.75 mm) into both ends of the decellularized vessel under microscope. Tie the vessel and the tubes with 8-0 silk sutures.\nAssemble the decellularized aorta graft in the incubation chamber by connecting the Nylon tubes with the inlet and outlet ports (1/32” tubing) from the chamber wall. Maintain incubation chamber with 5mls of medium each time.",
    "Trypsinize PiPSC by adding pre-warmed trypsin to cover the culture dish and gently rock the dish 10 times. Discard the trypsin and leave the dish in incubator for 2 - 3 min. Add pre-warmed culture medium in the dish and mix the medium with the cells.\nCount cell number using a hemocytometer. Centrifuge two aliquots of cell suspensions containing 5 x 105 cells each for 5 min at 300 x g. Aspirate the supernatant completely.\nAfter aspirating the supernatant completely, resuspend 1 pellet of the PiPS cell pellets in 50 µl of DM. Inject this cell suspension into the decellularized vessel lumen.\nThen, resuspend the other PiPS cell pellet in 100 µl of Matrigel. Carefully pipette the mixture onto the decellularized aorta graft.\nWait for 10 - 15 min until the mixture turns into a gel-like state and evenly wraps around the vessel external surface. Fill the incubation chamber with DM.\nPlace the whole bioreactor setting in a 5% CO2 incubator at 37 °C. Manually rotate the decellularized graft 90° around the longitudinal axis every half an hour in the first 2 hr.\nKeep static culture for 12 hr to enable cell adhesion.\nDeliver DM through the lumen by the peristaltic pump to induce smooth muscle cell differentiation. Start initial flow rate at 5 ml/min and stepwise increase to 20 ml/min over 24 hr.\nKeep the circulating medium flow rate at 20 ml/min for 24 hr.\nStop the medium flow and move the bioreactor setting out of the incubator.\nRe-seed the lumen of the graft with PiPSC. Trypsinize, count and centrifuge 1 x 106 PiPSC as in steps 5.5 - 5.6. Resuspend the cells in 50 µl of EGM-2 medium containing 50 ng/ml VEGF. Inject the cell mixture into the lumen of the graft.",
    "Change the medium in the incubation chamber and whole circulation to EGM-2 medium containing 50 ng/ml VEGF to induce endothelial differentiation.\nMove the bioreactor setting back to the incubator. Manually rotate the graft 90° every 30 min in the first 2 hr and then keep a static culture for 12 hr.\nStart circulating flow from 5 ml/min and stepwise increase to 35 ml/min. Keep the flow rate at 35 ml/min for 5 days. Change circulating and chamber medium every other day.\nHarvest the engineered graft for further grafting to mouse.\n6. Grafting of Double-seeded PiPSC Graft into Mice\nUse NOD.CB17-Prkdcscid/NcrCrl male mice as vessel graft recipients. Always ensure that the mice are about 10 weeks old, weigh approximately 25 - 35 g, and are in good health conditions.\nAnesthetize recipient mouse by administering a combination of Hypnorm (25 mg/kg) and Hypnovel (25 mg/kg) intraperitoneally. Apply petrolatum ophthalmic ointment on eyes to prevent dryness while under anesthesia. Confirm efficient anesthetization by ensuring that mice have relaxed muscles and are breathing steadily.\n\t\nFix the mouse in a supine position with its neck shaved and extended. Administer atropine sulfate (1.7 mg/kg) in combination with the anaesthetics to ensure that the mouse respiratory tract remains clear.\nPrepare a midline incision from the mandible to sternum of the mouse. Under a dissecting microscope with 5- to 10-fold amplification, lift the right salivary glands laterally and remove the right cleidomastoid muscle to expose the right common carotid artery.\nGently remove attached tissues to mobilize the right common carotid artery from the distal end toward the proximal end. Ligate the middle portion of the common carotid artery twice with an 8-0 silk suture and dissect between the two ties.",
    "Pass through a cuff made of autoclavable nylon tube in each vessel end and fix each end with microhemostat clamps.\nRemove suture tie on one end and apply a drop of heparin (100 U/ml). Immediately after, invert the distal end of the artery to cover the whole cuff body and fix the inverted vessel with an 8-0 silk suture to the cuff.\n\t\nRepeat the same procedure to the other portion of the artery. Flush artery with saline solution to remove blood clots.\nImplant a decellularized vessel graft between two ends of the carotid artery by sliding the decellularized vessel ends of the over the artery cuffs and fixing it with 8-0 silk sutures. Remove vascular clamps from either ends before evaluating the pulsation of the graft.\nPlace the right salivary gland back to its original position. Close the skin on the surgical location with an interrupted suture using a 6-0 polyglactin suture.\nConsistently observe vital signs of mouse after the procedure is completed, until it resumes consciousness. Sacrifice recipient mice by cervical dislocation and harvest vessel grafts either 24 hr or 3 weeks later for further analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}