{
  "id": 12061,
  "origin_website": "Jove",
  "title": "In Vivo Imaging and Quantitation of the Host Angiogenic Response in Zebrafish Tumor Xenografts",
  "procedures": [
    "1. Preparation of Microinjection Needles\nTurn on a micropipette puller and set the following parameters (calibrated for the micropipette puller model listed in Table of Materials): Heat, 680; Pull, 75; Velocity, 40; Time, 55; Pressure: 530.\nSecure a borosilicate glass capillary into the micropipette puller and pull the capillary to make two needles. Repeat for as many needles as desired.\n2. Cell Culture for Implantation\nNOTE: When using this protocol, any mammalian cancer cell line can be used for implantation into zebrafish embryos as xenografts. However, there is much variation in the angiogenic response induced among different cell lines5,11,12. B16-F1 murine melanoma cells have been shown to induce a strong angiogenic response in zebrafish embryos11 and are therefore appropriate for use in this protocol.\nGrow B16-F1 cells at 37 °C in a 75 cm2 flask using MEM-α media supplemented with Fetal Bovine Serum (FBS) to a final concentration of 10% (v/v) and Penicillin /Streptomycin, each at a final concentration of 100 μg/mL.\nRemove the media from a 95-100% confluent 75 cm2 flask of B16-F1 cells and wash the cells in 5 mL of room temperature phosphate-buffered saline (PBS).\nRemove the 5 mL PBS, add 2 mL of room-temperature 0.25% Trypsin/ ethylenediaminetetraacetic acid (EDTA) and incubate at 37 °C for 60 s.\nTap the side of the flask to determine whether the cells are beginning to lose their attachment to the bottom of the flask.\nAdd 8 mL of room temperature MEM-α with 10% FBS into the flask, pipette against the inside of the flask to bring any cells that remain adhered to the bottom of the flask into suspension and pipette the cell suspension into a 15 mL tube.",
    "Centrifuge the cell suspension at 800 x g, 4-8 °C for 5 min, aspirate the media and proceed to labelling the cells with dye.\n3. Labelling B16-F1 Cells with Fluorescent Dye\nNOTE: In order to differentiate between the implanted tumor cells and other cells in the embryo, the tumor cells must be labelled with an appropriate fluorescent dye before implantation. This step can be skipped if the cells already express fluorescent reporters.\nIncubate 2 mL of serum-free MEM-α media at 37 °C.\nPrepare a stock solution of the chosen dye and dilute it in pre-incubated 2 mL of serum-free MEM-α media to make a workable concentration (examples of dyes and concentrations appropriate for B16 F1 cells are provided in Table of Materials).\nPipette 1 mL of the dye solution into the cell pellet (from step 2.6), mix thoroughly by pipetting, then add the other 1 mL of dye solution and mix.\nIncubate the cells and dye mixture at 37 °C for 40 min, mixing by gentle shaking at 20 min.\nCentrifuge the cell suspension at 800 x g, 4-8 °C for 5 min.\nAspirate the supernatant and wash the labelled cells by pipetting with 5 mL of PBS.\nCentrifuge the cell suspension again at 800 x g, 4-8 °C for 5 min, aspirate the supernatant and place the cells on ice until ready for implantation.\nNOTE: The final tumor cell pellet should have a volume of 20-40 μL.\n4. Preparation of Embryos for Implantation\nNOTE: Choose a transgenic zebrafish line that has fluorescently labelled blood vessels (e.g. kdrl:RFP, fli1a:EGFP, etc.)13,14.\nTwo days prior to implantation, spawn the zebrafish as previously described and collect the embryos15.",
    "NOTE: As we are not injecting these fish at an early stage, they do not need to be collected within 20 min of spawning as described by Rosen et al.15, but may be collected after a few hours of mating.\nPlace the embryos in 100 mm culture dishes at a density of approximately 100 embryos/dish.\nAdd 50 mL of E316 (supplemented with 5 μL of a 1% w/v aqueous stock solution of methylene blue to prevent contamination) to each dish, clean out any dead embryos or debris and keep the dish in a dark incubator at 28 °C until ready for injection.\nAt 1 day post fertilization (dpf), add 1-phenyl-2-thiourea (PTU) to each dish to produce a final concentration of 30 mg/L PTU in E3. PTU prevents pigmentation, which can interfere with the ability to view the tumor cells and blood vessels.\nAt 2 dpf, use needles or tweezers to manually dechorionate any embryos that are unhatched. Using a fluorescent microscope, select as many transgenic embryos as required for xenografting (50-200).\nPrior to implantation, anaesthetize the selected embryos in a solution of 300 μg/mL Tricaine in E3 in order to prevent movement during the injection procedure.\nFill a 35 mm dish with a 2% methylcellulose in E3 solution to a quarter of the volume of the dish.\nUse a transfer pipette to place approximately 50 embryos (minimizing the volume of E3 solution also transferred) onto the methylcellulose.\nUse a Microloader pipette tip to arrange the embryos so that they are all oriented vertically, with the heads to the top and with the left side facing up.\nNOTE: Steps 4.7-4.9 can also be carried out by arranging the embryos on an agarose block as previously described17, but in our experience, the embryos are more easily arranged when arrayed in methylcellulose.",
    "5. Perivitelline Injection of Mammalian Cancer Cells into 2 dpf Embryos\nNOTE: To ensure the cells clump together as a graft when implanted, the cells must be mixed together with an extracellular matrix mixture (ECM). We have described the steps of making such a cell/ECM mixture when using an ECM mixture referenced in the Table of Materials. If an alternative matrix is used, the steps should be adjusted accordingly.\nDivide a stock of ECM into 100 μL aliquots in 500 μL tubes and store at -20 °C until needed.\nThaw out an aliquot of ECM and add 100 μL of PBS to dilute the mixture to 50% (v/v).\nNOTE: Diluted 50% ECM can be stored at 4 °C for up to 1 month.\nMix the 50% ECM well with the B16-F1 cell pellet (from step 3.7) by pipetting and stirring, to produce a mixture of cells/ECM in a 2:1 ratio and store the mixture on ice.\nUsing a microcapillary pipette, take up 3-10 μL of cells.\nCarefully insert the pipette tip into a needle and eject the B16-F1/matrix mixture into the end of the needle.\nInsert the needle into the needle-holder and tilt at a 45° angle to the dish.\nBreak the tip of the needle using tweezers to make a hole large enough for the cells to be ejected from the needle without squeezing the cells.\nTurn on the pressurized air cylinder attached to the injection apparatus and turn the injector on “continuous” mode momentarily to push the cells to the tip of the needle.\nRemove the needle out of the dish and replace the dish with a hemocytometer.\nPlace a drop of oil on the hemocytometer and inject the needle once onto this drop.",
    "Count the number of cells ejected with a single pulse using the hemocytometer and calibrate the needle to eject approximately 150 cells per pulse by adjusting pulse duration.\nNOTE: Ejecting this quantity of cells per pulse will require several pulses in order to implant a successful xenograft. This will give the researcher more control over the final size of the tumor xenograft by allowing them to moderately adjust the number/location of pulses to make each xenograft larger or smaller as they see fit.\nPoint the needle towards the yolk sac of an embryo and push it through the yolk sac in a ventral direction until the tip of the needle has emerged from the yolk sac and is pushing the embryonic epidermis on the ventral side of the embryo just posterior to the heart.\nNOTE: Position the needle so that it enters the embryonic yolk sac anterior to the final location where the cells will be ejected. This will ensure that the cells will be ejected in a direction away from the heart, decreasing the likelihood of injecting the cells into the common cardinal vein.\nCarefully push the tip of the needle forward a little until it has created a space (perivitelline space) between the epidermis and the yolk sac membrane and then pulse the injector to eject some of the cell mixture into the perivitelline space.\nRepeat the pulses until 500-800 cells have been injected into the perivitelline space, creating a visible bulge that extends at least half of the way along the bottom of the yolk sac, then remove the needle from the embryo.",
    "NOTE: If the cells block the needle or are damaged during the injection, purge the needle by momentarily switching to “continuous” mode and then back to “pulse”. This should unblock the needle and allow the cells to be ejected freely and undamaged.\nContinue to do the same for all the embryos in the dish, loading a new needle with tumor cells when required.\nAfter injecting all the embryos, remove the needle and push all the embryos together using a microcapillary pipette tip so that they can be pipetted out with as little methylcellulose as possible.\nTransfer the embryos into a recovery dish containing E3 (with PTU and methylene blue) and wash them by gently pipetting E3 around the embryos.\nNOTE: At this point, the xenografted embryos can be treated with drugs by separating them into different dishes and adding a drug solution to one dish and a control solution (such as the drug vehicle) to the other dish.\nIncubate the embryos at 34 °C and perform twice daily checks to remove dead or oedematous embryos from the dish.\nNOTE: 34 °C was found to be the optimal temperature for xenograft vascularization and has also been used by other studies employing the zebrafish embryonic xenograft angiogenesis model18. The xenografts can be imaged any time up to 48 hpi (hours post-implantation).\n6. Live Imaging\nAt 48 hpi, identify 3-5 healthy embryos without oedema. Anaesthetize them in 150 μg/mL Tricaine and mount them laterally in 1% Low Melting Point (LMP) agarose as previously described19.\nNOTE: As the agarose is solidifying, use a microcapillary pipette tip to keep the embryos positioned laterally.\nTurn on the confocal microscope, the microscope controller, the lasers and the computer software for controlling the microscope.",
    "Place the dish on a confocal microscope. Using a 20x magnification, water dipping objective lens, position the xenograft in the center of the field using brightfield imaging.\nSelect excitation lasers that are appropriate for detecting the dye used to label the tumor cells and the fluorophore used to label the zebrafish blood vessels.\nAdjust the gain for each laser to a level that allows the detection of both the tumor cells and the blood vessels.\nNOTE: Once confocal settings have been established, ensure these are kept unchanged throughout the experiment so that comparisons can be made between xenografts.\nUsing the laser channel appropriate for the tumor cells, determine a volume to be imaged that includes the entire volume of the xenograft, allowing for at least one or two optical sections either side of the graft. Use section intervals that are around 5 μm apart to create a z-stack.\nNOTE: It is essential that the z-stack should contain the entire volume of the xenograft.\nUsing two channel imaging, image both the tumor xenograft and the blood vessels. Repeat steps 6.6-6.7 for each larva to be imaged.\n7. Time Lapse Imaging\nNOTE: This model is highly suited to imaging dynamic cellular processes due to its transparency and the availability of zebrafish transgenics that fluorescently label different cell types. This makes time-lapse imaging a key application of this model.\nTurn on the environmental chamber and set to 34 °C at least 2 h before imaging. If the chamber is not humidified, add dishes of water.\nAnaesthetize 3-5 embryos (using 120 μg/mL Tricaine at 2 dpf and 100 μg/mL Tricaine at 3 dpf) and mount them laterally in 0.8% LMP agarose for time-lapse imaging according to the previously described protocol19.",
    "NOTE: As the agarose is solidifying, use a microcapillary pipette tip to keep the embryos positioned laterally.\nSet up the equipment and image the xenograft as described in steps 6.2-6.7, acquiring z-stacks of the xenograft at 10 min intervals.\nNOTE: The embryo must be maintained at 34 °C as it is being imaged and the E3 on top of the larvae in agar must be checked and supplemented occasionally to ensure that it does not dry out.\n8. Quantitation of the Angiogenic Response to the Zebrafish Xenograft\nNOTE: The following steps use 3D image analysis software. Specific steps will vary depending on the software used.\nTransfer the z-stack confocal image files of a tumor xenograft to a new folder on the 3D Image Analysis software.\nNOTE: In order to quantitate the levels of tumor vascularisation, Measurement Protocols must be created with settings calibrated so that they can be used to measure either Tumor Volume or Vessel Volume for all xenografts.\nTo create the “Tumor Volume” protocol for measuring the volume of the tumor xenografts, go to the “Measurement” tab on the top menu and then drag the protocols named “Find Objects” from the list of protocols that appears on the left-hand side of the window to the space that is titled “Drag tasks here to make measurements”.\nEnsure that this protocol is set to measure objects in the tumor channel, and then drag the protocols named “Clip to ROIs” and “Make ROI from Population” from the list of protocols to the “Drag tasks here to make measurements” space. Ensure that these two commands apply to the objects identified by “Find Objects.”",
    "Prior to calibrating the settings of this protocol, go to the dropdown menu above the “Mode” label at the top left of the window and select the “Extended Focus” view. \nDeselect the non-tumor channels in the pane on the far right by clicking the black circle under each channel heading, so that only the tumor channel can be seen. Use the “Freehand” tool at the top of the window to draw a “region of interest” (ROI) around all of the tumor volume.\nNOTE: Take care to ensure that none of the tumor is left out of the ROI. This will provide a region on which to perform the protocol as you are calibrating the settings.\nSelect the “Summary” label in the panel below the image, and set the “Display” option to show “Population 2”. To calibrate, click on the asterisk on the Find Objects task, which will open the settings window. Adjust the “Threshold” using “Intensity” and determining the “Lower” threshold until only the tumor cells are selected and not the background fluorescence. \nNOTE: This is important so that only the fluorescence from the tumor cells in the selected ROI (drawn in 8.5) is detected and none of the background fluorescence is measured.\nDetermine the “Minimum object size” so that only intact cells are measured as opposed to smaller items of cell debris (e.g. by setting the “Minimum object size” as 100 μm3). Save this protocol as “Tumor Volume” by clicking the Measurements tab on the top menu and clicking “Save Protocol”, and use the same settings for measuring all xenografts.",
    "To measure the volume of the xenograft-associated blood vessels, you will need to make a new protocol. Go to the top menu, click on the Measurements tab and click “Clear Protocol”. Drag the “Find Objects” and “Clip to ROIs” tasks into the space that is titled “Drag tasks here to make measurements” for this protocol. \nEnsure that the first command is set to measure objects in the blood vessel channel and that the following command is set to apply to the objects identified by the first command. Then deselect the non-vessel channels in the far-right pane so that only the blood vessels can be seen.\nDetermine the settings for the “Vessel Volume” in a similar manner as for the “Tumor Volume” protocol and save this protocol as “Vessel Volume” (see 8.6-8.7).\nClear the protocol and draw an ROI around the xenograft, taking care not to include any non-tumor autofluorescence. Measure the sum of volume of the objects in the tumor channel inside this ROI by clicking the Measurements tab, selecting the “Restore Protocol” command and choosing the “Tumor Volume” protocol.\nUsing the new ROI made by the “Tumor Volume” protocol, use the “Vessel Volume” protocol to measure the total volume of objects in the vessel channel inside this ROI by clicking the Measurements tab, selecting the “Restore Protocol” command and choosing the “Vessel Volume” protocol.\nDivide vessel volume by the tumor volume and multiply the answer by 100 to obtain a percentage value of graft vascularisation.\nRepeat steps 8.11 to 8.13 for all the other xenografts.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}