{
  "id": 8203,
  "origin_website": "Bio",
  "title": "Isolation of Mouse Tumor-Infiltrating Leukocytes by Percoll Gradient Centrifugation",
  "procedures": [
    "Dissect Lewis Lung Cancer (LLC) tumors (tumor volume ~1,000 mm3/tumor, tumor weight: 0.5~0.8 g/tumor) grown on mice.    Place one tumor into a 100 mm Petri dish and add 5-10 ml HBSS at room temperature (RT).   Quickly mince tumors with scalpels into fragments small enough to be aspirated into a 5 ml pipette without getting stuck at RT.   Transfer tumor tissue suspension into 50 ml non-vented tissue culture flasks.   Rinse Petri dish with up to 40 ml HBSS and transfer the suspension into the flask. Total volume in the flask is 45 ml.   Add 5 ml 10x Triple Enzyme Mix to the flask, and shake the flask at 80 rpm at RT for 1-3 h on a shaker.   Repeatedly pipet the tumor cell suspension to further dissociate cells, centrifuge the cell suspension at 50 x g at RT for 10 min and collect the supernatant. Discard the bigger pellets in the bottom of the tube and centrifuge the supernatant at 200 x g for 5 min.   Wash cell pellets with 10 ml wash buffer at 200 x g for 5 min once.   Suspend the cell pellet with 2 ml ACK lysing buffer for 1 min to deplete red blood cells (observe the cell suspension under a microscope to determine whether red blood cells are depleted completely. If there are still too many red blood cells, add more ACK lysing buffer until there are very few red blood cells).   Centrifuge at 200 x g and remove the supernatant.   Re-suspend cells in 15 ml 40% Percoll and add into a 50 ml tube.   Lay slowly 15 ml 80% Percoll with a syringe and a long needle (#16 gauge) to the bottom of the above 50 ml tube.   Centrifuge at 325 x g at RT for 23 min (ascending rate: 5; descending rate: 5).",
    "Collect the cells at the interface between 40% and 80% Percoll, which should mostly be leukocytes and directly pass the cell suspension through a 40 μm nylon strainer. Wash the strainer with wash buffer and centrifuge the cell suspension at 425 x g at RT for 10 min.  Note: After centrifugation, approximately 1.5-2.0 x 105 leukocytes could be obtained from a total of 1 x 106 cells from tumor depending on the tumor type. By discontinuous Percoll isolation, tumor cells will be in the bottom layer after centrifugation (Figure 1).   Re-suspend the cells in desired buffer for further experiments, such as phenotyping with flow cytometry and measurement of functions.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130829/20130829185114_0220.jpg Figure 1. Schematic illustration of the isolation of tumor infiltrating-leukocytes by discontinuous Percoll gradient. Left tube shows that before centrifugation, 80% Percoll is laid under the total cells suspended in 40% Percoll. Right tube shows that after centrifugation, leukocytes are located at the interface between 40% and 80% Percoll, tumor cells are in the bottom of the tube."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}