{
  "id": 8471,
  "origin_website": "Jove",
  "title": "Culture of Brain Capillary Pericytes for Cytosolic Calcium Measurements and Calcium Imaging Studies",
  "procedures": [
    "1. Preparation of buffers and solutions for cell culturing\nPrepare collagen stock solution by dissolving 5 mg of collagen IV from human placenta in 50 mL of PBS overnight at 4 °C. Aliquot the stock solution into 5 mL portions and store at -20 °C.\nPrepare fibronectin stock solution by dissolving 5 mg of fibronectin in 5 mL of sterile water overnight. Store the fibronectin stocks in aliquots of 500 µL at -20 °C. When thawing, add PBS to a final volume of 50 mL to prepare the work solution and store it at 4 °C.\nPrepare Dulbecco's Modified Eagle Medium (DMEM) complete medium by adding 50 mL of fetal bovine serum (FBS), 5 mL of MEM nonessential amino acids and 5 mL of penicillin/streptomycin (0.1 g/L streptomycin sulfate and 100,000 U/L penicillin G sodium) to 500 mL of DMEM.\nPrepare 5 mg/mL heparin stock solution by dissolving heparin sodium salt in PBS and pass it through a 0.2 µm filter for sterilization. Store the stock solution at 4 °C.\nPrepare growth medium (GM) immediately before use; mix 10 mL of DMEM-comp and 250 µL of heparin stock solution per T75-flask.\n2. Isolation of capillaries from fresh bovine brain\nNOTE: Bovine brain capillaries are isolated and cultured as previously described (Helms et al.10).\nCollect brains from calves, no older than 12 months of age, from a slaughterhouse and bring directly to the lab on ice.\nRemove the meninges and collect all gray matter from the brain using a scalpel. Identify the meninges as the film covering the brain and the gray matter by its gray color.",
    "Use a 40 mL Dounce tissue grinder to homogenize the gray matter in Dulbecco's Modified Eagle Medium (DMEM). Fill the slim part of the tissue grinder 1/5 with gray matter suspension and add DMEM until the slim part is filled.\nSeparate the capillaries from free cells and smaller tissue pieces by filtration of the homogenate through a 160 µm nylon net filter. Flush the filters with DMEM-comp. Retrieve the capillaries and pool the suspensions into 50 mL centrifugation tubes.\nResuspend the capillaries in DMEM-comp and add an enzyme mix of DNase I (170 U/mL), collagenase type III (200 U/mL) and trypsin (90 U/mL). Leave the suspension for 1 h in a 37 °C water bath for digestion of the capillaries.\nRun the suspension through a 200 µm mesh filter and resuspend in FBS with 10% dimethyl sulfoxide (DMSO). Freeze the capillaries overnight at -80 °C and move them to liquid nitrogen the day after for long term storage.\n\tNOTE: The protocol can be paused here.\n3. Seeding and culturing of bovine capillaries\nDay 0: Mix 0.7 mL of collagen IV stock with 6.3 mL of PBS. Add the solution to a T75-flask and leave the flask for 2 h at room temperature (RT) or leave it overnight at 4 °C.\nRemove the collagen solution from the flask and wash three times with PBS.\nAdd 7 mL of fibronectin work solution and leave the flask for 30 min at RT. Then, remove the fibronectin solution and seed the capillaries immediately after.\nDuring the 30 min waiting time, thaw one vial of capillaries in a 37 °C water bath.",
    "When the capillaries are thawed, transfer immediately to a centrifugation tube with 30 mL of DMEM-comp and centrifuge for 5 min at 500 x g and RT. Remove DMEM-comp from the tube and re-suspend the capillary-pellet in 10 mL of fresh DMEM-comp.\nTransfer the 10 mL suspension to the coated T75-flask and leave the capillaries to adhere to the bottom of the flask for 4-6 h in a 37 °C incubator at 10% CO2.\n\tNOTE: The cell growth rate is higher at 10% CO2 rather than the conventional 5% CO2.\nAfter 4-6 h of incubation inspect the flask under a light microscope. Fractions of capillaries should now be attached to the bottom of the flask (Figure 1, day 0).\nPrepare GM and aspirate the DMEN-comp medium very careful from the capillaries and replace it with 10 mL of freshly made GM.\nDay 2: Remove GM from the capillaries and replace with 10 mL of freshly made GM. Cellular outgrowth from the capillaries should be visible under a light microscope at this point (Figure 1, day 2-3).\n4. Isolation of primary pericytes from bovine brain capillaries\nDay 4: Inspect the capillaries under a light microscope.\n\tNOTE: The flask should now be approximately 60-70% confluent to provide an appropriate amount of pericytes (Figure 1, day 4). If this is not the case; replace the GM with 10 mL of fresh medium and leave the flask in the incubator for another day.\nAspirate the medium and wash the cells gently in PBS.\nAdd 2 mL of thawed Trypsin-EDTA for endothelial cells and leave the flask in the incubator for 1-3 min. Take out the flask frequently and observe with the microscope during this time period.",
    "NOTE: The endothelial cells should round up and detach from the flask; pericytes should be visible as cells with a \"ghost\"-morphology and still be attached to the surface of the flask. This is a tricky and important step. It is essential to remove most endothelial cells to avoid contamination of the pericyte monoculture, but prolonged trypsinization can also detach the pericytes. The trypsinization time can vary slightly from time to time, and it is therefore of utmost importance to observe the flask frequently with the microscope during the treatment.\nGently tap the flask, when the endothelial cells have started to round up, to detach the loosened endothelial cells.\nTo stop the trypsinization, add 10 mL of DMEM-comp to the flask. Flush the flask carefully a few times with the medium to remove the endothelial cells. Aspirate the endothelial cell suspension from the flask. The endothelial cells can now be used for other purposes.\nAdd 10 mL of DMEM-comp to the flask. Look under the light microscope to assure the pericytes are still present and attached to the bottom. Put the flask back into the incubator to allow the pericyte-enriched culture to grow.\n\tNOTE: It is important to observe the culture during the following days. If there is still a fair amount of endothelial cells growing another trypsin-treatment can be performed.\nAllow the pericyte monoculture to grow with change of DMEM-comp. medium every second day. Check the growth of the cells under the light microscope (Figure 1, day 5-8).\n5. Generation and storage of a monoculture of primary bovine pericytes\nDay 8-9: Inspect the capillaries under a light microscope",
    "NOTE: The pericytes should now have reached 70-80% confluency and grow in islands in the flask (Figure 1, day 9). If the confluency of the pericytes is less than 70%, allow the cells to grow for another day. The pericytes will not form a complete monolayer as the endothelial cells would.\nAspirate DMEM-comp and wash the pericytes with 7 mL of PBS.\nAdd 2 mL of trypsin-EDTA to the flask and leave it in the incubator for 2-3 min. Place the flask frequently under the light microscope to observe when the pericytes round up and detach from the flask. When the pericytes have started to round up, the flask can be gently tapped to detach the cells.\nGently tap the flask, when the pericytes have started to round up, to detach the cells.\nAdd 10 mL of DMEM-comp to the flask to stop the trypsinization process. Flush the flask a few times with the medium to help detach the last pericytes.\nTransfer the 12 mL cell suspension to a 50 mL centrifugation tube and fill up to 30 mL with DMEM-comp.\nCentrifuge the cell suspension for 5 min at 500 x g and RT. Aspirate the DMEM-comp. carefully without touching the cell pellet. Resuspend the cell pellet in 3 mL of FBS with 10% DMSO.\nTransfer the cell suspension into cryovials; add 1 mL to each, so there will be a total of 3 vials per T75-flask of pericytes. Freeze the pericytes at -80 °C overnight and move them to liquid nitrogen the day after for long term storage.\n\tNOTE: Cells may be counted before freezing for a later estimate of survival percentage. The protocol can be paused here.\n6. Setting up a pericyte monoculture for experiments",
    "Coat a T75-flask with collagen IV and fibronectin using the same procedure as mentioned in section 3.1-3.4.\nWhile the flask is being coated with fibronectin, thaw one vial of pericytes in a 37 °C water bath.\nTransfer the now thawed pericytes from the cryovial to a centrifugation tube with 30 mL of DMEM-comp. Centrifuge the cell suspension for 5 min at 500 x g, RT.\nCarefully aspirate the medium, leaving the cell pellet at the bottom of the tube. Re-suspend the pellet in 10 mL DMEM-comp.\nCollect and transfer the cell suspension to the coated flask. Leave the flask with pericytes to grow in a 37 °C incubator at 10% CO2.\nEvery second day, refresh the medium with 10 mL of fresh DMEM-comp.\n\tNOTE: After 5 days of growth, the pericytes should have reached approximately 80% confluency. If the confluency is less, leave the cells to grow for another day or two. The cells should now be ready for seeding for further experiments.\n7. Seeding of pericytes in a coated 96-well plate\nDilute collagen IV as described in step 3.1. Add 100 µL to each well in a 96-well plate and incubate for 2 h at RT or overnight at 4 °C.\nAspirate the solution and wash the wells three times with PBS.\nAdd 100 µL of diluted fibronectin to each well and incubate at RT for 30 min. Remove the fibronectin solution and use the plate immediately.\n\tNOTE: Depending on how well the pericyte batch is growing, there should be enough cells for seeding two plates.\nTake out the pericytes from the incubator and aspirate the medium. Wash the cells with PBS.\nAdd 2 mL of trypsin-EDTA to the pericytes and follow same procedure as in step 5.3-5.6.",
    "Aspirate the medium, without harming the cell pellet and re-suspend the pellet in 1 mL of fresh DMEM-comp.\nTake out 12 µL of cell suspension and add to a counting chamber. Under the light microscope, count at least 3 of 3x3 grids and use the average cell count per grid.\nUse the equation below to calculate the volume of cell suspension that should be added to each well to seed 10.000 cells per well, in the 96-well plate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61253/61253eq1v2.jpg\nAdd DMEM-comp and the calculated volume of cell suspension in each well to reach a final volume of 200 µL.\nPlace the 96-well plate in a 37 °C incubator at 10% CO2. Leave the cells to grow for 4 days with a change of medium after 2 days.\n8. Preparation of buffers and solutions for Ca2+-imaging\nAutoclave coverslip cell chambers and coverslips.\nAssay buffer: Add 1.19 g of HEPES to 500 mL of HBSS buffer for a final concentration of 10 mM HEPES. Adjust the pH to 7.4.\nPrepare 20% (w/v) Pluronic F127 + 1% (v/v) polyethoxylated castor oil stock solution by dissolving 0.5 g of Pluronic F127 solution in 2.5 mL of anhydrous DMSO in a glass vial. Heat to 40 °C for approximately 30 min or until dissolved and vortex. Add 25 µL of polyethoxylated castor oil and store at RT. Do not freeze.\nPrepare 2 mM Fura-2 AM stock by dissolving 1 mg in 500 µL of anhydrous DMSO. Store in aliquots of 20 µL at -20 °C protected from light.",
    "Prepare 5 µM Fura-2 AM loading solution by mixing 20 µL of 20% Pluronic F-127 + 1% polyethoxylated castor oil stock solution with the 20 µL of 2 mM Fura-2 AM aliquot. Add 500 µL of assay buffer and vortex. Add assay buffer to a final volume of 8 mL. The solution should be prepared immediately before use and protected from light.\nPrepare 4 mM Cal-520 AM by dissolving 1 mg in 226.7 µL of anhydrous DMSO. Store in aliquots of 20 µL at -20 °C protected from light.\nPrepare 20 µM Cal-520 AM loading solution by mixing 20 µL of 20% Pluronic F-127 + 1% polyethoxylated castor oil stock solution with the 20 µL 4 mM Cal-520 aliquot. Add 500 µL of assay buffer and vortex. Add assay buffer to a final volume of 4 mL. The solution should be prepared immediately before use and protected from light.\n9. Loading of pericytes with Fura-2 AM calcium indicator dye in a plate-reader setup\nNOTE: All solutions should be at RT before the experiment starts.\nTake out the 96-well plate with cells from the incubator and aspirate the medium from the wells. Wash the cells twice with assay buffer.\nAdd 100 µL of loading solution to each well and wrap the plate with tinfoil, to avoid photo bleaching. Incubate for 45 min with 30 rpm shaking at RT.\n\tNOTE: Do not load Fura-2 AM at 37 °C, as it may load internal compartments. Remember to leave wells with cells in assay buffer instead of loading buffer; these are the \"blanks\" used for measuring background fluorescence.",
    "Aspirate the loading buffer and wash the cells with assay buffer twice. Add 100 µL of fresh assay buffer and leave the cells to incubate for 30 min at RT; this allows for continuous cleavage of the AM-ester and thereby trapping Fura-2 AM inside the cells.\nPrior to the Ca2+-imaging, wash and replace the buffer with 100 µL of fresh assay buffer.\n10. Well-plate fluorescence reading of pericytes in a plate-reader setup\nSet the temperature of the plate reader to 37 °C and transfer the 96-well plate with cells to the sample plate position. Place the reagent plate with agonist at the reagent plate position.\nStart by measuring loading of the cells to ensure equal loading of Fura-2 AM in all wells.\nPerform the measurements with excitation fluorescence wavelength at 340 nm/380 nm and the emission wavelength at 510 nm. Add 50 µL of agonist at speed 150 µL/s from the reagent plate to each well with cells in the sample plate position.\nSave the data and export as xlsx files for further analysis. Figure 2 shows the cytosolic Ca2+-response measured as the ratio between the two excitation wavelengths over time, where background fluorescence is subtracted.\n\tNOTE: The plate-reader need to be a dual microplate reader with room for a \"cell tray\" and a \"sample tray\" and an integrated pipettor system.\n11. Seeding of pericytes in a coated cell chamber for live imaging\nNOTE: Coverslips may also be placed in the bottom of culture wells, coated and seeded with pericytes as described above, and then mounted in the chamber prior to experiments.  \nMount a coverslip into the cell chamber and make it tight to avoid leakiness.",
    "Dilute collagen IV as described in step 3.1. Add 500 µL to each cell chamber and incubate for 2 h at RT or overnight at 4 °C.\nAspirate the collagen solution and wash the chambers three times with 500 µL of PBS.\nAdd 500 µL of diluted fibronectin to each well and incubate at RT for 30 min. Remove the fibronectin solution and use the cell chamber straight afterwards.\nIn the meantime, take out the flask with confluent pericytes and wash with 7 mL of PBS.\nAdd 2 mL of trypsin-EDTA to the pericytes and follow same procedure as in step 5.3-5.6.\nProceed by following the same steps as in step 8.6-8.7.\nUse the equation below to calculate the volume of cell suspension, which should be added to each chamber to seed 90.000 cells per chamber.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61253/61253eq2v2.jpg\nAdd DMEM-comp and the calculated volume of cell suspension in each chamber to reach a final volume of 500 µL.\nPlace the cell chambers in the incubator at 37 °C, 10% CO2. Leave the cells to grow for 6 days (or until confluent).\n\tNOTE: The pericytes grow slower on glass-slides compared to plastic; more days of growth are necessary.\n12. Loading of pericytes with Cal-520 AM calcium indicator dye for live imaging\nNOTE: All solutions should be at RT before the experiment starts.\nPrepare the 20 µM Cal-520 AM loading buffer: Mix 20 µL of 20% Pluronic F-127 + 1% polyethoxylated castor oil stock solution with the 20 µL 4 mM Cal-520 aliquot. Add 500 of µL assay buffer and vortex. Add assay buffer to a final volume of 4 mL. The solution should be prepared immediately before use and protected from light.\n\tNOTE: Protect solutions containing Cal-520 AM from light exposure.",
    "Take out the cell chambers from the incubator and aspirate the medium. Wash the cells twice with assay buffer.\nAdd 500 µL of loading buffer to each chamber and incubate at RT for 45 min.\nAspirate the loading buffer and wash the cells twice with assay buffer.\nAdd 500 µL of fresh assay buffer to each chamber and incubate for 30 min at RT to allow cleavage of the AM-ester.\nReplace the buffer with 500 µL of fresh assay buffer before performing the live imaging at a confocal microscope.\n13. Live imaging of intracellular Ca2+-levels\nNOTE: A variety of microscope types can be used for the imaging. Upright or inverted conventional fluorescence microscopes, as well as upright or inverted confocal laser scanning microscopes with appropriate excitation source (488 nm) and emission filters (510-520 nm) can be used. Objectives should be suited for fluorescence and be of a high quality and with high numerical aperture (NA).\nMount the cell chamber on the stage of the confocal microscope as gentle as possible, in order to avoid disturbance of the cells.\nSelect an excitation wavelength of 488 nm, emission at 515 nm, sequential image acquisition with 5 second intervals, an XY image size of 512 x 512 pixels and measure for 2 min to measure baseline calcium signals.\nAdd 3 µL of 100 mM ATP to the cell chamber with a pipette, and continue the sequential image acquisition. Perform the addition slowly and gently to not disturb the preparation and move the cells out of focus.\nObserve the degree of changes and increase the time interval over time as needed for approximately 18 min until no further morphological change is noted (Figure 3).\nSave time-lapse images and export them as TIFF and/or AVI files for further analysis.",
    "NOTE: One vial of pericytes should give enough cells for seeding in 1-2 96-well plates and several coverslips, meaning you can prepare cells for both types of calcium-measurements.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}