{
  "id": 9232,
  "origin_website": "Jove",
  "title": "Vibratome Sectioning Mouse Retina to Prepare Photoreceptor Cultures",
  "procedures": [
    "NOTE: The procedure was approved by the ethics committee Darwin from University Pierre and Marie Curie (Ce5/2009/048)\n1. Preparation of Gelatin Solution, Instruments, Vibratome, Culture Media and Culture Plate\nPrepare a 20% gelatin solution at least one day before the experiment.\n\t\nUnder the hood, add 500 µl of gentamycin [10 mg/ml] to a 500 ml bottle containing CO2 independent medium (CO2-i).\nIn a separate beaker, add 20 ml of CO2-I (from step 1.1.1) and heat at 95 °C on a heating block with constant stirring for 15 min. Observe a color change to yellow, indicating that the solution is ready for further use.\nWeigh 4 g of gelatin and gradually poor to the solution prepared above (step 1.1.2) with increased stirring and heating at 95 °C for 45 min, to obtain a yellow color solution. Allow the gelatin solution to cool under the hood for approximately 5 min.\nPour 4 ml of the gelatin solution into a 35 mm diameter culture dishes without introducing air bubbles. Keep the dish at 21 °C for 30 min. Cover the dishes with plastic film, and turn the dishes upside down. Optionally, store the dishes at 4 °C for up to 2 months before use.\nPrepare a 4% gelatin solution.\n\t\nUnder the hood, add 25 ml of CO2-i medium in a sterile plastic container, and heat at 42 °C on a heating block. Remove the medium from the heating block and gradually add 1 g of gelatin to the hot medium and stir. Quickly return the container on the heating block (42 °C) and keep it warm during the process.\nSetting-up the vibratome apparatus:",
    "Remove the dishes containing 20% gelatin solution stored at 4 °C. Cut the gelatin with a scalpel. Flip the gelatin slice and stick it on the black support disc of the vibratome using a drop of super glue.\nBreak a razor blade into two halves, and insert one half into the vibratome holding receptacle. Insert the black support disc onto the vibratome apparatus. Turn on the black knob to the right side. Fix the holding receptacle on the head of the vibratome. Add sufficient amount of CO2-i medium in the vibratome tank to cover the gelatin block.\nSwitch on the vibratome and cut three 100 µm slices of gelatin block. Keep the gelatin block for further use.\nPrepare 40 ml of culture medium:\n\t\nPrepare Dulbecco's modified Eagle medium (DMEM) with 10% of fetal calf serum (FCS) under the hood. Prepare 1 mg/ml Poly-D-Lysine using phosphate buffer saline (PBS) pH 7.4.\nIn a 96-well plate, add 2 µg/cm2 of Poly-D-Lysine to coat the bottom of the wells. Incubate the plate for 45 min at 37 °C within 5% CO2 incubator. Following incubation, remove PBS and replace with 200 µl / well DMEM and place again at 37 °C in 5% CO2 incubator before using.\n2. Dissection of Entire Retina\nEnucleate the mouse:\n\t\nSacrifice the mouse according to the European directive 2010/63: by cervical dislocation. Cut the head with curved-scissors and place it in a 100 mm diameter Petri dish after having disinfected the eye with disinfectant.\nRemove the eye after having detached the optic nerve by sectioning it very carefully using a curved grip. Then place both eyes in a 35 mm Petri dish containing sterile CO2-i medium at 21 °C.\nRemoving the retina:",
    "Make a hole at the level of the eye-limb with the help of a 18 G needle to be able to introduce the scissors into the eye globe. Introduce straight scissors inside the hole and carefully cut the sclera below the iris on all the perimeter of the ocular globe to remove ciliary body.\nRemove the cornea and the lens and keep the posterior chamber of the eye with the retina contiguous to the sclera. With two fine grips, remove the vitreous located inside the posterior chamber without damaging the retina. Perform four radial cuts (retina/sclera) to permit flattening of the retina.\nUpturn the ocular globe and peel it as an “orange”. Detach the retina from the sclera and retinal pigmented epithelium (RPE). Detach the retina still attached at the level of the optic nerve very carefully with fine curved-scissors.\nDetach the remaining vitreous from the periphery toward the centre of the retina with two fine grips. Make sure that all the vitreous is completely removed to allow the flattening of the retina.\nCut the extremity of a plastic pipette and transfer the retina to a 35 mm diameter Petri dish containing CO2-i medium with the plastic pipette.\n3. Sealing of Flat-mounted Retina onto Gelatin Block\nRemove 20 - 30 ml of CO2-i medium from the vibratome tank (the gelatin block is free) to permit the sealing of flat-mounted retina.\nTransfer the retina to a glass slide using a plastic pipette and add a drop of CO2-i medium before transferring to the gelatin slice with the photoreceptor facing down on the gelatin slice.\nAttach the retina to the gelatin block by gently injecting warmed 4% gelatin on one side of the block between the retina and the gelatin block and simultaneously expelling warm gelatin on the other side.",
    "Aspirate 4% gelatin with a pasteur pipette. Wait for 10 min to allow total sealing. Add CO2-i medium to immerse the block and the blade completely.\n4. Sectioning the Retina\nNOTE: This step is critical to obtain a layer of photoreceptor cells without the other retinal cells (Figure 1).\nStarting from the top on the gelatin block, cut 100 µm serial sections to reach the retina. Then cut 100 - 120 µm sections of the inner layer. Depending on the application, this layer may be discarded or stored in liquid nitrogen. Ensure that the speed of the vibratome is very slow (at 1 or 2) during the sectioning of the inner layer or photoreceptors layers.\nPerform intermediate 15 µm sections of the retina corresponding to the interface between the inner and the outer retina. Observe this section under a microscope. The absence of blood vessels indicates that the outer retina has been reached.\nCut 200 µm of the outer retina (the photoreceptor layer) with gelatin and transfer it to a 35 mm diameter dish filled with 3 ml of CO2-i medium. Keep it on ice until all the photoreceptor layer sections of all retinas are obtained.\n5. Dissociating Photoreceptor Cells\nTake the dish(es) containing the photoreceptor layer(s) and put it(them) in an incubator at 37 °C for 10 min.\nUsing forceps gently separate the photoreceptor layer from the gelatin and transfer it in a new dish filled with 3 ml of Ringer’s solution. Repeat this step (5.2) for each photoreceptor layer preparation.",
    "Incubate 2 units of papain with 25 µl of activator solution (1.1 mM EDTA; 5.5 mM L-cystein; 60 µM β-mercaptoethanol) in a 5 ml polypropylene sterile tube and incubate it 30 min at 37 °C within 5% CO2 incubator. The activation of papain is achieved at 37 °C. During this incubation, cut the photoreceptor layer into 2 mm2 pieces (not too small) and transfer these pieces into a 5 ml tubes.\nRinse the retina twice with 1.5 ml of solution Ringer’s solution followed by gravity sedimentation. Remove all remaining Ringer’s solution from the tube with the specimen.\nAdd 475 µl of Ringer’s solution to the tube containing activated papain and mix. Add this solution to the tube containing the retina.\nIncubate the tube with the retina for 20 min at 37°C within 5% CO2 incubator. Stop the reaction by adding 1 ml of 10% FCS in DMEM. Add 25 U of deoxyribonuclease I (DNAse I) to digested DNA from death cells. Carefully homogenize the cell suspension using a 1 ml-pipette. Spin at 50 x g for 6 min at RT.\nDiscard the supernatant to remove traces of serum and add DMEM medium with supplements (see table of specific reagents_equipment) to the cell-pellet and resuspend carefully the cell suspension with a 1 ml pipette. Spin at 50 x g for 6 min at RT. Repeat this step (5.7) once more.\n6 Culturing Photoreceptor Cells\nThe photoreceptor layer of a mouse at PN8 contains about 1 to 1.5 million cells using this technique. Seed the photoreceptor cells at 1 x 105 cells/cm2 in a culture plate with culture medium and culture the cells for 5 days at 37 °C within 5% CO2 incubator. On day 5, proceed to immunochemistry and western blotting study following methods provided by the antibody suppliers.",
    "NOTE: Steps to stop the culture and preliminary tests are described in reference 21."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}