{
  "id": 1696,
  "origin_website": "Cell",
  "title": "Simulating coxsackievirus B3 infection with an accessible computational model of its complete kinetics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBasic operations\nTiming: 1–2 min per simulation\n(Simulation time may vary with computer processing speed and non-default parameter sets.)\nThis protocol describes the basic model functions to provide a starting point for further simulations. The program runs simulations behind the GUI and stores the concentration of 59 output species as a function of time (e.g., virions, total single-stranded RNA, positive-sense RNA, viral protein, and interferon stimulated proteins). The user selects one species to be plotted on the main GUI figure. When multiple simulations are run sequentially, the data from previous simulations are saved until one of three things occurs: 1) the Clear Data/Plot button (General tab) is pressed, 2) the simulation mode is switched (Options tab), or 3) a sensitivity analysis is enabled or disabled (Options tab). All simulations that have not been cleared are referred to as active simulations.\nTo demonstrate basic operations, this protocol begins with a default infection for 16 h at a multiplicity of infection (MOI) of 10, with all parameters set to literature or experimental estimates (Lopacinski et al., 2021[href=https://www.wicell.org#bib14]). At the end of this outline, the reader should be able to simulate infections, change key parameters, and export results. Descriptions of all buttons on the main GUI page are found in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_1155_1.csv\nTo begin the default simulation, click Start. The median virion concentration over time is automatically plotted along with the upper quantile (default: 95%) and lower quantile (default: 5%) (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1155-Fig2.jpg\nFigure 2. Demonstration of a single simulation and sequential simulations\n(A) The graphical output is the result of running the model with default settings.",
    "(B) The graphical output of a second simulation (blue) using MOI 5 is overlaid on the first simulation (red). The blue box highlights changes made for the simulation. The solid lines show the median number of virions over time, and the dotted lines show the upper (95%) and lower (5%) quantiles.\nNote: The upper and lower quantiles are plotted because the CVB3 complete kinetics GUI performs multiple runs—determined by Number of runs (Options tab)—with slightly different parameter sets for a single simulation. See the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section for details on the variation between runs.\nTo infect with half as much virus, change the number in the MOI box to 5 and click Start. The new simulation is overlaid on the previous simulation in a new color (Figure 2[href=https://www.wicell.org#fig2]B, blue).\nNote: Ten unique colors are pre-loaded, and the colors will repeat if more simulations are overlaid.\nTo examine the effect of the host antiviral response, toggle the Antiviral Response switch off and click Start. For simulations at an MOI of 5, the median virion concentration is increased by toggling off the antiviral response (Figure 3[href=https://www.wicell.org#fig3]A, green compared to blue). Next, change the Results to Plot dropdown to Interferon Stimulated Proteins and uncheck the Log Scale Y button. The lack of interferon stimulated proteins confirms that the antiviral response is disabled (Figure 3[href=https://www.wicell.org#fig3]B, green).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1155-Fig3.jpg\nFigure 3. Turning off the antiviral response and plotting a different species\nThe graphical output is the result of running a third simulation (green) after the simulations shown in Figure 2[href=https://www.wicell.org#fig2] (red and blue). The third simulation was run at an MOI of 5 with the cellular antiviral response turned off.\n(A) Virion production increases without an antiviral response.",
    "(B) No interferon stimulated proteins are produced when the antiviral response is turned off. The green box highlights changes made for the simulation. The solid lines show the median number of virions over time, and the dotted lines show the upper (95%) and lower (5%) quantiles.\nThe model can also simulate the effect of adding exogenous IFN. To perform a simulation with exogenous IFN added 6 h after infection, toggle the IFN Stimulation switch on, and enter “6” in the Stimulation Time field. Next, toggle the Antiviral Response switch back on and click Start. To plot +ssRNA instead of virion concentration, change the Results to Plot dropdown to Total +ssRNA and check the Log Scale Y button. Uncheck the Show Quantile Lines button to reduce crowding and make the plot easier to interpret (Figure 4[href=https://www.wicell.org#fig4], cyan compared to blue).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1155-Fig4.jpg\nFigure 4. Adding exogenous IFN stimulation\nThe graphical output is the result of running a fourth simulation (cyan) after the simulation shown in Figure 3[href=https://www.wicell.org#fig3]. The fourth simulation was run at an MOI of 5 with exogenous IFN stimulation starting at 6 h post infection and the host antiviral response on. The plot shows total positive-sense single-stranded RNA (+ssRNA) on a logscale y-axis with the quantile lines turned off. The cyan boxes highlight changes made for the simulation. The solid lines show the median number of virions over time.\nNote: Entering a negative value in the Stimulation Time field simulates IFN pretreatment of cells prior to infection.\nNote: The Antiviral Response switch must be turned on for the exogenous IFN to stimulate an antiviral response. Otherwise, the model does not incorporate the exogenous IFN. The model simulation is the same with and without exogenous IFN if the Antiviral Response is off.",
    "To save the main figure plot as it is currently displayed, press the Export Plot button. To export another plot with a different species-of-interest, change the Results to Plot dropdown then press the Export Plot button again. Press the Export Results button to save all of the underlying data. Export Results saves 5 tables per active simulation (Median, Mean, Upper Quantile, Lower Quantile, and Run Parameters).\nNote: The Run Parameters table is used as a reference for the settings that went into each simulation.\nNote: To view many species without changing Results to Plot, press the Show All Plots button. Show All Plots will plot all 59 output species grouped into 7 windows per simulation rather than overlaying the data from multiple simulations. For example, clicking Show All Plots after two simulations will result in 14 windows. These plots can also be saved.\nIn addition to the parameters modified in the above steps, all other parameters in the General tab (Table 1[href=https://www.wicell.org#tbl1]), Options tab (Table 2[href=https://www.wicell.org#tbl2]), or Advanced Options tab (Table 3[href=https://www.wicell.org#tbl3]) can also be edited. Descriptions of all fields and their default values are listed in Tables 1[href=https://www.wicell.org#tbl1], 2[href=https://www.wicell.org#tbl2], and 3[href=https://www.wicell.org#tbl3].\ntable:files/protocols_protocol_1155_2.csv\ntable:files/protocols_protocol_1155_3.csv\nNote: All parameters can be reset to defaults values by clicking the Reset all Parameters to Default Values button in the Advanced Options tab. Resetting to default values does not clear the plot, remove active simulations, change simulation mode, or enable/disable sensitivity analysis.\nNote: Simulations that result in a median virion concentration greater than 326 nM will be truncated at the time point that 326 nM is reached. See the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] for the rationale and calculation of the threshold.\nPopulation mode\nTiming: 1–2 min per simulation\n(Simulation time may vary with computer processing speed and non-default parameter sets.)",
    "The default simulation mode is to model the infection of a single cell with the number of virions specified in the MOI box. The model is also able to simulate infection of an entire population of cells with the discrete number of virions for each run taken from a Poisson distribution around a mean specified by the MOI, as occurs in an actual infection (Ellis and Delbrück, 1939[href=https://www.wicell.org#bib6]). In population mode, each run involves a different number of virions; the mean and median for output species are plotted as the population-wide average without quantile lines.\nClick Reset all Parameters to Default Values under the Advanced Options tab to undo all changes made thus far and reset the model. Under the Options tab, turn the Simulation Mode knob from Single Cell to Population, which will clear all active simulations. Under the General tab, click Start. Both the median and the mean virion concentration are plotted without quantile lines (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1155-Fig5.jpg\nFigure 5. A simulation in population mode\nThe graphical output is the result of running a simulation in Population mode instead of Single Cell mode. In Population mode, the number of viral particles in each run is randomly selected from a Poisson distribution with the mean set at the input MOI. The plot shows the mean (dotted line) and the median (solid line) virions over time.\nNote: Quantile lines are disabled in population mode. No other GUI functionality is lost. Like in single cell mode, all other model parameters can be modified, and results can be exported.\nSensitivity analysis\nTiming: 2–4 min\n(Simulation time may vary with computer processing speed and non-default parameter sets.)",
    "The CVB3 computational model can run a sensitivity analysis. The sensitivity analysis shows changes in a user-defined output species when parameters are individually scaled up or down. Each parameter is scaled by the value in the Scaling factor box to a maximum/minimum set by the Max orders of magnitude to scale box. The coefficient of variation among runs is set to 0 so that the parameter being scaled is the only change between iterations. As a result, quantile lines are also disabled. The sensitivity analysis output is displayed as a heatmap showing the fold change in the output species-of-interest at the simulation endpoint.\nClick Reset all Parameters to Default Values under the Advanced Options tab to reset the model. Under the Options tab, check the Sensitivity analysis box, which will clear all active simulations. Under the General tab, click Start. The default sensitivity analysis shows changes in positive-sense CVB3 RNA (+ssRNA) (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1155-Fig6.jpg\nFigure 6. Performing a single-parameter sensitivity analysis\nThe graphical output is the result of running a sensitivity analysis for positive-strand RNA concentration at 16 h post infection. On the x-axis are parameters that were individually scaled up or down by the indicated multiplication factor on the y-axis relative to the base parameter set. The Hill constant was varied multiplicatively below one and additively above one, where 2 = base Hill coefficient + 1. Orange rectangles indicate parameter values that increased positive-strand RNA concentration compared to default, whereas blue rectangles indicate decreased positive-strand RNA concentration. The sensitivity analysis plot was processed in Adobe Illustrator.\nNote: A sensitivity analysis can be run in either single cell mode (as in Figure 6[href=https://www.wicell.org#fig6]) or population mode.",
    "Note: The sensitivity analysis output can either be a single species or the sum of any number of output species. Multiple species can be selected by selecting Other in the Output species dropdown menu and entering the output species to sum in the Other output box, separated by commas (no spaces).\nNote: Similar to running the model with the sensitivity analysis disabled, any model parameter can be modified, and the results can be exported. An additional table containing the results of the sensitivity analysis will also be exported.\nNote: In contrast to running the model with the sensitivity analysis disabled, virion concentrations exceeding 326 nM will not be truncated."
  ],
  "subjectAreas": [
    "Computer Sciences",
    "Microbiology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}