{
  "id": 17965,
  "origin_website": "Jove",
  "title": "A Plasma Sample Preparation for Mass Spectrometry using an Automated Workstation",
  "procedures": [
    "1. Programing for the automated liquid handler\nCreate a new method from File menu (File | New Method)\n\tNOTE: Complete the steps in the order given. The italic font denotes text to type in the Biomek software. Please contact the authors for information regarding pipetting techniques and templates.\nType Start step variables and their values in the start step as listed in Table 1.\nSet columns for selective tip pipetting. For the steps 1.3-1.7, click the Set Global step in the toolbar under Control Steps and drag it to the method.\n\t\nUsing the Set Global step, set value =FirstColumn to variable FirstColumn_Global, value =LastColumn to variable LastColumn_Global, value =LastColumn-FirstColumn+1 to variable Columns, and value =Columns*8 to variable Wells.\nSelect the Script step in the toolbar under Control Steps and drag it to the method. Type the VB script as indicated in Figure 2.\nSetting volumes for mixes Set Global and solutions.\n\t\nUsing the Set Global step, set the corresponding values to the volume mix variables as shown in Table 2.\nClick the If step in the toolbar under Control Steps and drag it to the method. Under conditions, type Autosampler.\nUnder Then, click the Set Global step in the toolbar under Control Steps and drag it to the method.\nUsing the Set Global step, set value =(MobilePhase*Columns)+10 to variable MobilePhaseWell.\nUnder Else, click the Set Global step in the toolbar under Control Steps and drag it to the method.\nUsing the Set Global step, set value =0 to variable MobilePhaseWell\nConfiguring Guided Labware Setup (GLS)\n\t\nClick the Deck Editor step in the toolbar under Utilities. Create a new deck to correspond with the deck layout in Figure 3 and label it as Deck 1.",
    "Click the Guided Setup step in the toolbar under Setup & Devices and drag it to the method. Drag and drop the labware types in the deck positions as indicated in Table 3. Thereafter, fill the tabs in the table as shown in Table 3 and Figure 4 (Setting up the Guided Setup).\nSetting up procedure for tip counting\n\t\nClick the Define Procedure step in the toolbar under Control Steps and drag it to the method. Name procedure as TipCount.\nClick the Script step in the toolbar under Control Steps and drag it to the method. Type the VB script as indicated in Figure 5 (Tip counting script).\nClick the If step in the toolbar under Control Steps and drag it to the method.\nUnder conditions, type TL5 = 0.\nUnder Then, click the Move Labware step in the toolbar under Setup & Device Steps and drag it to the method. Move labware from TL5 to TR3. Click the Move Labware step in the toolbar, under Setup & Device Steps and drag it to the method. Move labware from TL2 to TL5. Finally, click the Move Labware step in the toolbar under Setup & Device Steps and drag it to the method. Move labware from BC90 to TL2.\nDefining procedure for incubator\n\t\nClick the Define Procedure step in the toolbar under Control Steps and drag it to the method. Name procedure as Incubator.\nType in HalfTime as Variable Name and 1800 as Default Value.\nType in NextTemp as Variable Name and 22 as Default Value.\nType in temp as Variable Name and 60 as Default Value.\nClick the Enhanced Move Labware step in the toolbar under Setup & Device Steps and drag it to the method. Move labware from P11 to INHECO1.",
    "Click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Name procedure as TipCount.\nClick the INHECO Incubate step in the toolbar under Integrations and drag it to the method. Type in INHECO1 for use the device at position, =HalfTime for Incubate for, =Temp for °C and 3 for °C of target temperature. Select the Shake while incubating option and Orbital (clockwise) shake style. For settings, type in 1.00 mm side to side, 6.6 times a second, 1.00 mm forwards ad backwards and 6.6 times a second.\n\t\tNOTE: Make sure INHECO Incubator software is installed.\nClick the INHECO Incubate step in the toolbar under Integrations and drag it to the method. Type in INHECO1 for use the device at position, =HalfTime for Incubate for, =Temp for °C and 3 for °C of target temperature. Select the Shake while incubating option and Orbital (Counter-clockwise) shake style. For settings, type in 1.00 mm side to side, 6.6 times a second, 1.00 mm forwards and backwards at 6.6 times a second.\nClick the Pause step in the toolbar under Setup & Device Steps and drag it to the method. Pause the whole system for 1 s.\nClick the Define Procedure step in the toolbar under Control Steps and drag it to the method. Name procedure as Incubator.\nClick the INHECO Incubate step in the toolbar under Integrations and drag it to the method. Type in INHECO1 for use the device at position, 1 for Incubate for, =NextTemp for °C and 3 for °C of target temperature.\nDefining procedure for Orbital.\n\t\nClick the Enhanced Move Labware step in the toolbar under Setup & Device Steps and drag it to the method. Move labware from P11 to Orbital1.",
    "Click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure TipCount.\nClick the Device Action step in the toolbar under Setup & Device Steps and drag it to the method. Select Device OritalShaker0, Command TimedShake. Enter Shaking speed 1000, Time to reach full speed 2, Time to shake 30.\nClick the Enhanced Move Labware step in the toolbar under Setup & Device Steps and drag it to the method. Move labware Orbital1 to P11.\nSetting up the first mix\n\t\nClick the Select Tip step in the toolbar under Liquid Handling Steps and drag it to the method. Select rearrange position TL4.\nClick the INHECO Incubate step in the toolbar under Integrations and drag it to the method. Type in INHECO1 for use the device at position, 1 for Incubate for, 60 for °C and 3 for °C of target temperature.\nClick the Loop step in the toolbar under Control Steps and drag it to the method, within Select Tip step. Type col as variable =FirstColumn as Start, =LastColumn as End, and 1 as Increment.\nClick the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method, within loop step. Select BC90 Tips, TL5 Location and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in 1.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within loop step. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =FirstMix, Aspirate at column 1 and row 1. Select an optimized technique from the technique drop-down menu.",
    "Click the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within loop step. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =FirstMix, dispense at column =col and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within loop step. Select Unload tips to TR1.\nSetting up the samples\n\t\nClick the If step in the toolbar under Control Steps and drag it to the method. Type SamplePlate as the condition.\nUnder Then, click the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC90 Tips, TL5 Location and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in =tipcolumns.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within then. Select Greiner96RoundPS Labware Type and Samples Position. Type in volume =Sample, Aspirate at column =FirstColumn and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within then. Select BCDeep96Round Labware Type and Reaction Plate Position. Type in volume =Sample, dispense at column = FirstColumn and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within then. Select Unload tips to TR1.",
    "After the end of the If step, click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure Incubator. Type in HalfTime as Variable Name and 1800 as Default Value. Type in NextTemp as Variable Name and 22 as Default Value. Type in temp as Variable Name and 60 as Default Value.\nSetting up the Cysteine Block\n\t\nClick the Loop step in the toolbar under Control Steps and drag it to the method, within Select tip step. Type col as variable =FirstColumn as Start, =LastColumn as End and 1 as Increment.\nUnder Loop, click the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC90 Tips, TL5 Location and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in 1.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =CysteineMix, aspirate at column 2 and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reaction Plate Position. Type in volume = CysteineMix, dispense at column = col and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within then. Select Unload tips to TR1.",
    "After the end of the If loop, click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure Incubator. Type in HalfTime as Variable Name and 300 as Default Value. Type in NextTemp as Variable Name and 43 as Default Value. Type in temp as Variable Name and 25 as Default Value.\nSetting up the second mix\n\t\nClick the Loop step in the toolbar under Control Steps and drag it to the method, within Select tip step. Type col as variable =FirstColumn as Start, =LastColumn as End and 1 as Increment.\nUnder loop, click the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC90 Tips, TL5 Location and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in 1.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =SecondMix, Aspirate at column 3 and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reaction Plate Position. Type in volume = SecondMix, Dispense at column = col and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within then. Select Unload tips to TR1.\nAfter the end of the If the loop, click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure Orbital.",
    "Click the Pause step in the toolbar under Setup & Device Steps and drag it to the method. Pause the whole system for 1 s.\nSetting up Trypsin addition\n\t\nClick the Loop step in the toolbar under Control Steps and drag it to the method, within Select tip step. Type col as variable =FirstColumn as Start, =LastColumn as End and 1 as Increment.\nUnder Loop, click the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC90 Tips, TL5 Location, and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in 1.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =Trypsin, Aspirate at column 4 and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method within the loop. Select BCDeep96Round Labware Type and Reaction Plate Position. Type in volume =Trypsin, Dispense at column = col and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within then. Select Unload tips to TR1.\nAfter the end of the If loop, click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure Incubator. Type in HalfTime as Variable Name and 3600 as Default Value. Type in NextTemp as Variable Name and 25 as Default Value. Type in temp as Variable Name and 43 as Default Value.",
    "Click the INHECO Incubate step in the toolbar under Integrations and drag it to the method. Make sure INHECO Incubator software is installed. Type in INHECO1 for use the device at position, 1 for Incubate for, 25 for °C and 5 for °C of target temperature.\nSetting up quenching\n\t\nClick the Loop step in the toolbar under Control Steps and drag it to the method, within Select Tip step. Type col as variable =FirstColumn as Start, =LastColumn as End and 1 as Increment.\nUnder Loop, click the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC90 Tips, TL5 Location and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in 1.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =Quench, Aspirate at column 5 and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reaction Plate Position. Type in volume =Quench, Dispense at column = col and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within Then. Select Unload tips to TR1.\nAfter the end of the If the loop, click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure Orbital.",
    "Click the Pause step in the toolbar under Setup & Device Steps and drag it to the method. Pause the whole system for 1 s.\nClick the Pause step in the toolbar under Setup & Device Steps and drag it to the method. Select Pause the whole system and display this message. Type in the message ‘Continue after centrifugation’.\nSetting up the plate for Autosampler\n\t\nClick the If step in the toolbar under Control Steps and drag it to the method, within the Select Tip step. Type Autosampler as the condition.\nUnder Then, click the Loop step in the toolbar under Control Steps and drag it to the method. Type col as variable =FirstColumn as Start, =LastColumn as End and 1 as Increment.\nUnder Loop, click the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC230 Tips, TL6 Location and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in 1.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select BCDeep96Round Labware Type and Reagent Plate Position. Type in volume =MobilePhase, Aspirate at column 6 and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select Bio_RadPCR96 Labware Type and Autosampler Plate Position. Type in volume =MobilePhase, Dispense at column = col and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method, within Then. Select Unload tips to TR1.",
    "After the end of the If loop, click the Run Procedure step in the toolbar under Control Steps and drag it to the method. Select procedure TipCount.\nClick the Select Tips Load Tips step in the toolbar under Liquid Handling Steps and drag it to the method. Select BC90 Tips, TL5 Location, and TL2 backup Tips Location from the drop-down menu. Select Single Column(s) and type in =tipcolumns.\nClick the Select Tips Aspirate step in the toolbar under Liquid Handling Steps and drag it to the method within the loop. Select BCDeep96Round Labware Type and Reaction Plate Position. Type in volume =DigestTransfer, Aspirate at column =firstcolumn and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Dispense step in the toolbar under Liquid Handling Steps and drag it to the method, within the loop. Select Bio_RadPCR96 Labware Type and Autosampler Plate Position. Type in volume =MobilePhase, Dispense at column =FirstColumn and row 1. Select an optimized technique from the technique drop-down menu.\nClick the Select Tips Unload step in the toolbar under Liquid Handling Steps and drag it to the method within Then. Select Unload tips to TR1. The select tips step ends here.\nSave and name the method.\n2. Prepare specimen, labware, and reagents\nTransfer 5 µL of pooled healthy human plasma into to a Polypropylene, 96-Round Deep Well Plate.\n\tNOTE: See Table of Materials for reagents and supplies used in this protocol. TPCK Treated Trypsin was purchased and trypsin to substrate ratio and incubation time was optimized specifically. If a different grade of trypsin is used, such as sequence grade recombinant trypsin, the enzyme to substrate ratio and incubation time should be tested and optimized.\n3. Operating procedure\nDouble-Click the software icon.",
    "Under the Method tab, select Home All Axes to orient and prepare the automated liquid handler. Ensure all workstation syringes contain no visible air bubbles.\nUnder File, select Open | Method.\nSelect the method (Figure 6).\nStart the method by clicking the green triangle-shaped Run icon.\nTo have an autosampler plate prepared at the end of the method, enter the value ‘true’ in the Enter a value to use for ‘Autosampler’ prompt and then click OK. If an autosampler plate is not being prepared, enter the value ‘false’, and then click OK.\nEnter the value ‘1’ in the Enter a value to use for ‘firstcolumn’ prompt and then click OK.\nEnter the value ‘12’ in the Enter a value to use for ‘lastcolumn’ prompt, and then click OK.\n\tNOTE: This step and step 4.7 tell the workstation to perform a digestion on 12 columns of a 96-well plate, resulting in all wells of the plate being used for digestion\nIf a sample plate is being used with sample volumes of at least 20 µL, enter the value ‘true’ in the Enter a value to use for ‘SamplePlate’ prompt, and then click OK. If a sample plate is not being used, enter the value ‘false’, and then click OK.\n\tNOTE: If a sample plate is not being used, add 5 µL of sample to each corresponding well of the Reaction Plate.\nFollow the directions in the Guided Labware Setup window and click Continue.\n\tNOTE: The next window describes the layout for the “Reagent Plate” to be prepared (Figure 7, Supplemental Table 1). The following volumes will be aliquoted into each of the 8 wells of a single column in the 1 mL Deep Round 96-well plate:\n\tColumn 1: 540 µL of Reaction Mix 1.\n\tColumn 2: 50 µL of Cysteine Block.",
    "Column 3: 730 µL of Reaction Mix 2.\n\tColumn 4: 130 µL of Trypsin.\n\tColumn 5: 130 µL of Quench Solution.\n\tColumn 5: 1090 µL of Mobile Phase Solution (If the user entered ‘true’ in step 6).\nClick Next and the following window describes the minimum volume (20 µL) needed to be aliquoted into the Sample plate. If the user entered the value ‘false’ for the prompt involving the Sample Plate (step 9), the user will be prompted to add 5 µL sample to the Reaction Plate.\nClick Next.\n\tNOTE: The next window shows that an empty 90 µL tip box must be placed on the automated liquid handler deck.\nClick Next again, laying out the automated liquid handler’s deck as specified and illustrated (Figure 8) including the Reagent Plate, the Reaction Plate, the Sample Plate, the Autosampler Plate, 6 full 90 µL tip boxes, an empty 90 µL tip box, and a full 230 µL tip box.\nClick Finish to begin the method.\n\tNOTE: After clicking Finish, the user cannot reach into the automated liquid handler. This will ‘break the light curtain’ of the machine and stop the liquid handler as a safety precaution.\nAt the Continue after centrifugation prompt, retrieve the Reaction Plate and centrifuge it for 30 minutes at 3,000 rpm.\nAfter the centrifugation is complete, return the Reaction Plate to the automated liquid handler to the position it was in before the centrifugation, and click Continue.\n\tNOTE: The automated liquid handler will stop again when the method is complete. If the user entered ‘true’ for step 6, the Autosampler Plate can then be removed from the workstation and placed into the autosampler of a liquid chromatography instrument for analysis.\n4. LC-MSMS",
    "Resolve peptides on a high flow HPLC comprising of a C18 2.1 mm x 100 mm, 3.5 µm column with a flow rate of 0.25 mL/min and analyzed inline on a triple quadrupole mass spectrometer.\n\tNOTE: After peptide digestion, the targeted LC-MSMS method to quantify peptides from robotic prepared samples is described in detail1 following a brief description of LC-MSMS.\nSet the column oven temperature to 40 °C. Use buffer A (2% ACN, 98% water, 0.1% formic acid) and buffer B (95% ACN, 5% water, 0.1% formic acid) as the two mobile phases.\nEquilibrate the column with 5% B for 5 minutes after loading. Elute the peptides over 30 minutes with a linear 5% to 35% gradient of buffer B.\n\t\nRecycle the column before loading the next sample by washing with 98% B for 10 minutes and then 5% B for 5 minutes.\nFor the on-line diversion, divert the post-column eluent to waste before it entered the ion source using a two-phase switching valve.\nProcess the MRM data."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}