{
  "id": 10945,
  "origin_website": "Jove",
  "title": "Using Cell-substrate Impedance and Live Cell Imaging to Measure Real-time Changes in Cellular Adhesion and De-adhesion Induced by Matrix Modification",
  "procedures": [
    "1. General Endothelial Cell Culture\nCulture bovine aortic endothelial cells (passages 4–9) on gelatin-coated tissue culture flasks (coat tissue culture surface with 0.1% w/v gelatin in PBS at RT for 15 min) in EGM-2 media (with the EGM-2 bullet kit containing 5% fetal bovine serum, growth factors and all supplements provided by the manufacturer, except for hydrocortisone).\nWhen cells are near-confluent (ca. 3 days post seeding after a 1:4 split), harvest cells by treatment with 0.05% w/v trypsin / 0.02% w/v EDTA in PBS at 37 °C. After the majority of cells have detached, add complete EGM-2 media to quench the trypsin and then centrifuge (100 x g, 5 min).\nPrepare cells for studies on the de novo adhesion of endothelial cells to fibronectin (Experiment 1: Section 2) and the subsequent de-adhesion of endothelial cells with established adhesion on this substrate (Experiment 2: Section 3).\n\t\nWash harvested cells once with serum-free Medium 199 containing 1% w/v bovine serum albumin (BSA) and re-centrifuge (100 x g, 5 min).\nRe-suspend cells in serum-free Medium 199 containing 1% w/v BSA at 2.5 x 105 cells/ml (cell-substrate impedance measurements) or 5 x 105 cells/ml (live cell imaging analyses) and maintain at 37 °C prior to use.\n\t\tNOTE: The adhesion responses of cells are highly sensitive to temperature differences (e.g., due to convection effects) so all equipment and solutions used to handle and treat cells during the following protocols should be kept at a constant temperature of 37 °C.\n2. Experiment 1: Quantifying De Novo Endothelial Cell Adhesion on Native and MPO-oxidized Fibronectin (Cell-substrate Impedance)\nNOTE: Experiment 1 examines the degree to which MPO-mediated oxidation of fibronectin impairs its ability to support de novo adhesion of suspended endothelial cells.",
    "Coat fibronectin onto 96-well gold cell-substrate impedance microelectrode arrays. Add 80 μl/well of purified bovine fibronectin at 5 μg/ml in PBS, incubate for 2 hr at 37 °C and remove the solution.\nIncubate fibronectin-coated surfaces with MPO to allow the binding of MPO to the surface bound fibronectin. Add 80 μl/well of purified human neutrophil MPO at 20 nM in Hank’s balanced salt solution (HBSS) and incubate for 0.5 hr at 37 °C.\nWash surfaces twice with HBSS to remove any unbound MPO.\nAdd H2O2 (0-10 μM final concentration) to wells of the microelectrode array plate containing 80 μl/well HBSS to initiate MPO-catalyzed, HOCl-dependent fibronectin oxidation and incubate for another 0.5 hr at 37 °C.\nTo examine the effect of relevant inhibitors or modulators of MPO-catalyzed reactions (e.g., alternative MPO enzyme substrates, enzyme inhibitors or antioxidants; see9 for details), add these to the HBSS immediately prior to H2O2 addition.\nAfter 0.5 hr, treat surfaces with methionine to quench residual surface-bound oxidizing species; i.e., reactive protein-bound chloramines, which may exert confounding cellular activities. Add 10 mM methionine in 80 μl HBSS per well and incubate for 10 min at 37 °C.\nBlock surfaces with BSA. Add 80 μl/well of BSA at 0.2% w/v in PBS, incubate for 2 hr at 37 °C and remove the solution.\n\tNOTE: Residual uncoated surface regions will support cell adhesion and blocking these with a non-adhesive protein (i.e., BSA) ensures that cellular adhesion responses strictly depend on the purified cell-adhesive matrix employed, in this case fibronectin.\nWash surfaces twice with HBSS.\n\tNOTE: None of the preceding surface treatments appreciably affects cell-substrate readings.\nSeed suspended endothelial cells (add 200 μl/well at ca. 2.5 x 105 cells/ml, prepared in serum-free Medium 199 containing 1% BSA; see 1.3) onto the native or MPO-oxidized fibronectin coated surfaces.",
    "Immediately after seeding cells (i.e., prior to any cell attachment and spreading), mount the microelectrode array plate onto the incubator port (housed in a 37 °C incubator in the presence of 5% CO2).\n\t\nUsing the instrument software immediately take a ‘blank’ reading to normalize subsequent cell-substrate impedance (‘cell index’) values to the initial background values obtained in the absence of cell-adhesion.\nInitiate acquisition of continuous cell index data (minimum of one cell index reading/min).\nIncubate cells at 37 °C and 5% CO2 for 2 hr, a time period during which maximal cell attachment and spreading is achieved; this is reflected by a plateauing of the cell index values (see Figure 3A).\n\tNOTE: The preceding experiment (Experiment 1) examines how initial MPO-mediated oxidation of fibronectin limits the ability of endothelial cells to establish cell adhesion on this substrate. The following experiment (Experiment 2) examines how MPO-mediated fibronectin oxidation promotes decreases in cell-matrix adhesion (i.e., de-adhesion) in endothelial cells with established adhesion onto this substrate. The treatments in these two experiments are essentially identical, except for the timing of MPO-mediated fibronectin oxidation (i.e., before cell adhesion – Experiment 1; after cell adhesion – Experiment 2).\n3. Experiment 2: Quantifying Endothelial Cell De-adhesion from Fibronectin in Response to MPO-mediated Fibronectin Oxidation (Cell-substrate Impedance and Live Cell Imaging)\nCoat fibronectin onto 96-well gold microelectrode arrays for cell-substrate impedance measurements (add 80 μl/well of fibronectin at 5 μg/ml in PBS and incubate for 2 hr at 37 °C) or 35 mm glass-bottomed cell culture dishes for live cell imaging analyses (add 2 ml/dish of fibronectin at 5 μg/ml in PBS and incubate for 2 hr at 37 °C).\nBlock surfaces with BSA. Add BSA at 0.2% w/v in PBS at the volumes indicated in 3.1 and incubate for 2 hr at 37 °C.",
    "Incubate surfaces with MPO to allow the binding of MPO to fibronectin. Add 20 nM purified human MPO in HBSS at the volumes indicated in 3.1 and incubate for 0.5 hr at 37 °C.\nWash surfaces twice with HBSS to remove any unbound MPO.\nSeed suspended endothelial cells (prepared in serum-free Medium 199 containing 1% w/v BSA; see 1.3) onto the native or MPO-bearing fibronectin coated surfaces.\n\t\nAdd 200 μl/well at 2.5 x 105 cells/ml to 96 well cell-substrate impedance microelectrode arrays.\nAdd 2 ml/dish at 5 x 105 cells/ml to 35 mm glass bottomed cell culture dishes.\nImmediately after seeding cells (i.e., prior to any cell attachment and spreading):\n\t\nMount 96 well microelectrode array plates onto the cell-substrate impedance incubator port (housed in a 37 °C incubator in the presence of 5% CO2) and take ‘blank’ readings to initiate continuous acquisition of cell index data (cf. Section 2.10).\nTransfer 35 mm glass bottomed cell culture dishes to a 37 °C incubator in the presence of 5% CO2.\nIncubate cells at 37 °C for 2 hr to allow maximal cell attachment and spreading (cf. Section 2.11).\nBriefly remove the 96 well microelectrode array plate (pause cell index readings at this point) or 35 mm glass bottomed cell culture dish from the 37 °C incubator, remove cell supernatant and add warmed (37 °C) HBSS (volumes as per step 3.1).\n\tNOTE: HBSS is employed when studying MPO-catalyzed oxidative reactions instead of complete culture media as the latter contains oxidizable species that interfere with the oxidation reactions.\nTo examine the effect of inhibitors/modulators of MPO-catalyzed reactions (alternative enzyme substrates, enzyme inhibitors or antioxidants) or cell signaling inhibitors (e.g., 40 μM blebbistatin to inhibit actomyosin contractility), add these now.",
    "Immediately place the microelectrode array plate back into the 37 °C incubator port (re-commence cell index readings at this point) or the 35 mm glass bottomed cell culture dish back into the 37 °C incubator, and allow the cells to equilibrate in the HBSS for 0.5 hr.\n\tNOTE: After 0.5 hr equilibration in HBSS, cell index values stabilize at slightly lower values; when pre-incubating cells with enzyme substrates, enzyme and cell signaling inhibitors or antioxidants, first ensure that these do not significantly affect the values obtained after equilibration.\nInitiate MPO-catalyzed, HOCl-dependent fibronectin oxidation and de-adhesion.\n\t\nFor cell impedance studies using 96 well microelectrode array plates:\n\t\t\nRemove the microelectrode array plate from the incubator and pause cell index measurements.\nAdd H2O2 (final concentration of 0-10 μM) to the HBSS and gently mix by repeated pipetting.\nImmediately, re-mount the microelectrode array back onto the 37 °C incubator port and re-commence the acquisition of cell index readings.\nFor live cell imaging studies using 35 mm glass bottomed cell culture dish:\n\t\t\nRemove the culture dish from the incubator and mount onto a 37 °C heated stage of an inverted confocal microscope equipped with a 63X water objective lens with suitable DIC optics for recording live cell movies.\nFocus on cells and optimize DIC optics (Köhler illumination, bias retardation and camera offset/gain; for details, see13).\nInitiate DIC movie and record baseline readings of untreated cells for 1 min.\nAdd H2O2 (final concentration of 0-10 μM) and gently mix by repeated pipetting. Re-focus the microscope (if necessary) and continue recording DIC movies of the treated cells for the required time period.\n4. Data Analysis and Presentation\nCell-substrate impedance data\n\t\nExport raw data (cell index versus time) into a spreadsheet.",
    "For cell de-adhesion studies (Experiment 2: Section 3), normalize data by setting values recorded immediately prior to the initiation of MPO-mediated fibronectin oxidation at a value of 1 (i.e., immediately before the addition of H2O2 in 3.11.1.1).\n\t\tNOTE: This ensures that relative changes in cell index values elicited by MPO-mediated fibronectin oxidation are not masked by small initial differences in absolute cell index values between wells.\n\t\t\nPresent data as plots of normalized cell index (y-axis) versus time (x-axis).\nLive cell imaging data (cell de-adhesion studies in Experiment 2: Section 3)\n\t\nOpen DIC live cell imaging movies recorded immediately prior to and after the initiation of MPO-mediated fibronectin oxidation in a standard image analysis program (e.g., ImageJ software).\nIn at least two separate DIC movies randomly select multiple cells and measure their projected area in sequential frames (e.g., at 1 min intervals) by manually tracing their membrane edge and quantifying the number of enclosed pixels.\nExport raw data (projected cell area versus time) to an Excel spreadsheet and normalize cell area data by setting values recorded immediately prior to the initiation of MPO-mediated fibronectin oxidation at a value of 1 (i.e., immediately before the addition of H2O2 in 3.11.2.3).\nPresent data as a plot of normalized cell area (y-axis) versus time (x-axis).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}