{
  "id": 14109,
  "origin_website": "Jove",
  "title": "Tracking Sugar-Elicited Local Searching Behavior in Drosophila",
  "procedures": [
    "Adult male flies of the Drosophila melanogaster Canton-S (CS) wild-type strain were used for the present study.\n1. Experimental preparation\nFly rearing\n\t\nCollect adult male flies emerging within a 12 h period and maintain them on standard fly media (prepared in house) for 48 h at 25 °C with 75% relative humidity in a 12 h light/dark cycle.\n\t\tNOTE: The Drosophila media composition used was (for 1 L of media) corn flour (80 g), D-glucose (20 g), sugar (40 g), agar (8 g), yeast powder (15 g), propionic acid (4 mL), methyl 4-hydroxybenzoate (1.25 g in 3 mL of ethanol), and orthophosphoric acid (600 µL) (see Table of Materials). The initial feeding period ensures that the flies have access to sufficient food and nutrients before the starvation phase. While both male and female flies elicit the search behavior, but starvation time is more consistent among male flies. Additionally, female flies change their feeding preference after mating11.\nStarvation procedure\n\t\nAfter the feeding period, starve the flies of food but with access to water.\n\t\tNOTE: To standardize the hunger state across trials and strains, it is suggested to determine the duration of 90% survival of the population under food-starved conditions. Based on this result, CS flies were starved for 28 h (Figure 1A) as circadian rhythms and other factors can impact the search behavior12. Circadian changes of fly searching activities at different times of a day were also measured (Figure 1B). We noticed reduced relative search activity at night compared to light phase in flies.\nCalculate the food-starvation tolerance by depriving two- day old flies of food. Place 15-20 flies in a vial with soaked tissue paper at the bottom. This serves as a substrate and ensure that the flies have access to water throughout the starvation period.",
    "Count the number of flies during the food-starvation period at regular intervals of 1 h. The duration at which 90% of the starved flies survived was used as the starvation period (Figure 1A). Use multiple replicates (3-4 for each strain) to minimize the impact of individual variations and provide a more reliable assessment of starvation tolerance.\n\t\tNOTE: The food-starvation tolerance of each strain was determined in order to establish a standardized hunger state among different strains and experiments. By counting the surviving flies at these intervals, one can monitor the survival rate over time and determine how long each strain could tolerate food deprivation before succumbing to starvation.\nProcedure for recording the behavior\n\t\nTransfer individual starved flies in small tubes (Figure 2A). Do this in batches of 5-6 flies to minimize isolation time. By testing single flies, isolating each fly, any observed changes or actions can be attributed to the specific fly being observed, rather than being influenced by interactions with other flies.\nUse 90 mm Petri dishes as an arena for behavioral assays (bigger petri dishes can be used. There was no difference in behavior in Petri dishes with larger diameter). Illuminate the arena from the bottom by a panel of surface-mounted cool white LEDs (Figure 2B,C). To maintain a uniform visual environment and minimize external distraction, surround the experimental arena by a white polyvinyl chloride pipe (51.5 mm height, 114 mm inner diameter).\n\t\tNOTE: This pipe acts as a barrier, preventing any visual stimuli from outside the arena from influencing the fly's behavior. By reducing external distractions, one can focus solely on the fly's interaction with the food source, maintaining consistency throughout the experiment.\nUse light intensity of 320 lux at the center of the arena.",
    "Position 0.2 µL sugar solution in the center of the arena. 500 mM sucrose solution was used in the reported experiments but this can be varied. Introduce the fly to the arena using a 2 mL micro centrifuge tube (inner diameter 8.7 mm, length reduced to 5 mm by stuffing cotton at the bottom; Figure 2A) housing a single fly inverted over the sugar drop.\nOnce the fly starts ingesting the droplet, remove the fly container, giving the fly unrestricted access to the food source.\nFilm the 2D position of the arena with an overhead camera.\n\t\tNOTE: Flea3 (Point Grey, 1214 mm lens, see Table of Materials) was used for the present study and recorded at 40 frames per second (fps). However, any camera that provides good contrast with the background can be used. One can record at 30-60 fps, depending on the nature of the experiment. Record in .avi format since it is compatible with the tracking software.\nRecord the trial until the time the fly escaped from the arena. The flies were freely walking and there was no lid on the arena.\nBy allowing the fly to decide when to stop searching, fly away, or walk to the periphery of the arena, observe the fly's natural behavior and food search strategy.Wipe the Petri dishes with 70% ethanol between the trials and dry them completely or else use a new Petri dish.",
    "NOTE: It is important to conduct all experiments between 2 h and 6 h after lights are on when the flies exhibit consistently high activity levels. This time frame ensures that the flies are in an active state, maximizing the chances of observing their natural food searching behavior and reducing the impact of other factors that may affect their behavior, such as circadian rhythms. The behavioral set-up was housed inside a temperature and humidity- controlled room. The arena was placed on a vibration- free table. This experimental setup involved isolating and testing individual flies for their response to sugar. A sugar drop was provided to the starved flies and their behavior was video recorded (Figure 2B,C, Video 1). The experiments were conducted during a specific time frame when the flies exhibited consistent high activity levels.\nAnalyze the trajectories following step 2 to determine the search behavior.\n2. Analysis of trajectories for local search\nAnalyze the recorded videos using Ctrax software11 (see Table of Materials).\n\tNOTE: The software tracks and converts the fly's position in the video into x, y coordinates, enabling precise tracking and analysis of its movements. Refer to Supplementary File 1 for details on how to use Ctrax.\nDivide the trajectories into two phases: the initial feeding phase and the search phase. Define the end of feeding and start of walking as flies moving at a speed >4 mm s-1 in three consecutive frames.\n\tNOTE: After the feeding was over, the rest of the trajectory was used as the search response of the flies. This study used VirtualDub (see Table of Materials) to remove the feeding phase from the videos before tracking.\nQuantify the search by the following parameters:",
    "Path length: This parameter represents the distance walked by the fly from its starting point during the food search (in mm).\nStay time: The time spent by the flies walking during the search (in s). It indicates the duration of the search and fly's persistence in searching for food.\nMeander: Calculate this as a ratio by dividing the beeline (the distance between the first and the last point of the path) of the path to the total path length, and subtracting from 1. High values of meander indicate more tortuosity in the trajectory.\nNumber of returns: Use the developed algorithm to identify and count the number of returns using two concentric circles.\n\t\tNOTE: An inner circle indicating the origin of search, Rin (2.5 mm) and the outer circle indicating the minimum distance Rout (4 mm) that the fly had to move away from the origin. A return was defined as a movement out of the outer circle (Rout) and then coming back into the inner circle (Rin).\nActivity rate: Expressed as a percentage, calculate the activity rate by determining the time during food searching when the fly's walking speed exceeds 2 mm/s. This parameter reflects the fly's level of activity and engagement in the food search. It distinguishes active foragers from less active individuals.\n\t\tNOTE: MATLAB and Python were used in the present study for further analysis of the trajectories. The scripts can be accessed here: https://github.com/eagermeagre/sugar_elicited_search. The analysis procedure involves using the Ctrax software to track the fly's movements and determine parameters such as the duration of food search, total path length, search time, meander, number of returns and activity rate. These parameters provide valuable insights into the fly's behavior and foraging efficiency during the recorded food searching experiments.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}