{
  "id": 8602,
  "origin_website": "Jove",
  "title": "High Throughput, Absolute Determination of the Content of a Selected Protein at Tissue Levels Using Quantitative Dot Blot Analysis (QDB)",
  "procedures": [
    "All animal procedures were carried out in line with Binzhou Medical University Animal Use Directive and approved by the ethical review board of Binzhou Medical University.\n1. Sample Preparation\nTake 50 mg mouse tissue into a 1.5 mL Tube. Add 200 µL lysis buffer (50 mM Hepes, pH 7.4, 137 mM NaCl, 5 mM EDTA, 5 mM EGTA, 1 mM MgCl2, 10 mM Na2P2O7, 1% Triton X-100, 10% glycerol), supplemented with protease and phosphatase inhibitors (100 mM NaF, 0.1 mM phenylmethylsulfonyl fluoride, 5 µg/mL pepstatin, 10 µg/mL leupeptin, 5 µg/mL aprotinin).\nHomogenize the tissue with a homogenizer for 1 min on ice.\nCentrifuge for 10 min at 8 000 x g at 4 °C.\nCollect the supernatant into new tubes (1.5 mL) and take out 1 µL for protein concentration assay with BCA kit.\nNote: All the commonly used lysis buffers for western blot analysis and Dot blot analysis can be used for QDB analysis.\n2. Determining the Specificity of Antibody\nPrepare sample lysates (20 µg) in section 1.4, IgG free BSA (20 µg), standard protein (600 pg), for western blot analysis.\nNote: IgG free BSA is used as a negative control and the standard protein is used as a positive control. The specificity of the antibody is demonstrated by showing one band of right size using the western blot analysis.\n3. Defining the Linear Range of the QDB Analysis\nDissolve the standard protein with ddH2O. Dilute the protein to a concentration of 1,200 pg/µL.\nDilute the concentrated protein from the prepared samples in section 1.4 to 4 µg/µL.\nDissolve the BSA with ddH2O. Dilute the protein to a concentration of 1,200 pg/µL and 4 µg/µL.\nA series of dilution of standard protein and prepared samples were prepared with the guidance of Table 1 and Table 2.",
    "Mix 10 µL dilution standard protein or dilution prepared samples and 10 µL 2x loading buffer (120mM Tris-HCl pH 6.8, 20% Glycerol, 4% SDS, 0.2% Bromphenol Blue, 200 mM DTT) together.\ntable:\n﻿0,1,2,3,4,5,6\n,S1  (0pg/µl),S2 (33.3pg/µl),S3  (100pg/µl),S3  (300pg/µl),S5  (600pg/µl),S6  (1200pg/µl)\nstandard protein(1200pg/µl),0,1.39,4.17,12.5,25,50\nIgG free BSA  (4pg/µl),50,48.61,45.83,37.5,25,0\ntotal,50,50,50,50,50,50\nTable 1. Dilution Scheme for standard protein curve.\ntable:\n﻿0,1,2,3,4,5,6\n,X1  (0µg/µl),X2  (0.25µg/µl),X3  (0.5µg/µl),X4  (1µg/µl),X5  (2µg/µl),X6  (4 µg/µl)\nSample(4µg/µl),0,3.125,6.25,12.5,25,50\nIgG free BSA(4µg/µl),50,46.875,43.75,37.5,25,0\ntotal,50,50,50,50,50,50\nTable 2. Dilution Scheme for prepared samples\nHeat the mixtures at 85 °C for 5 min.\n4. Process of QDB Analysis\nSample application\nSupport the QDB plate to avoid the bottom of the plate touching the surface of the table. For instance, use an empty pipette tip box as support.\nLoad up to 2 µL of the sample to the center of the membrane at the bottom of the individual unit of the QDB plate.\nDrying the plate\nLeave the loaded QDB plate for 1 h at room temperate (RT) or as an alternative leave the loaded plate at 37 °C for 15 min in a well-ventilated space.\nBlocking the plate\nDip the QDB plate in the transfer buffer (0.039 M Glycine, 0.048 M Tris, 0.37% SDS, 20% methyl alcohol) and gently shake the plate for 10 s.\nRinse the QDB plate gently with TBST (Tris-buffered saline, 0.1% Tween 20) three times, and then wash the plate for 5 min in TBST under constant shaking.\nBlock the QDB plate with blocking buffer (5% nonfat milk in TBST (100 µL/well) for 1 h under constant shaking.\nPrimary antibody incubation",
    "Dilute the primary antibody in the blocking buffer at a chosen concentration (from 1: 500 to 1:5 000), and add 100 µL to each individual well of an ordinary 96 well plate. Insert the QDB plate into the 96 well plate and incubate the combined plates either for 2 h at RT or overnight at 4 °C under constant shaking.\nAlternatively, place the QDB plate inside a box, and fill the box with blocking buffer 2 to 3 mm above the membrane portion of the plate if the same antibody is used for the whole plate. Add the primary antibody at the chosen concentration, and incubate the plate either for 2 h at RT or overnight at 4 °C by under constant shaking.\nRinse the plate gently with TBST for three times before it is washed with TBST for three times, each time for 5 min under constant shaking.\nSecondary Antibody incubation\nDilute the secondary antibody in the blocking buffer at the chosen concentration (from 1:1, 000 to 1:50, 000), and either aliquot 100 µL/well into a 96 well plate or in a box as described in section 4.4.2, and then incubate the QDB plate inside either the loaded 96 well plate or the box for 1 h at RT under constant shaking.\nRinse the QDB plate gently 3 times with TBST, then wash the plate for 3 times, 5 min each with TBST under constant shaking.\nQuantification\nPrepare enhanced chemiluminescence substrate (ECL) by following the manufacturer's instructions.\nAliquot ECL substrate into a 96 well plate (100 µL/well) and insert the QDB plate inside the 96 well plate for 2 min under constant shaking.\nRemove the QDB plate from the 96 well plate and shake briefly to remove the excess liquid. Place the plate onto a white microtiter plate.",
    "Turn on the microplate reader, and select \"plate with cover\" on the user interface before placing the combined plates (QDB plate + white plate adaptor) inside the microplate reader for quantification.\nNote: Make sure to use the white, non-transparent microtiter plate as an adaptor to avoid any interference from the plate. Make sure to choose \"plate with cover\" to avoid jamming the machine when combined plates (QDB plate+ 96 well plate adaptor) are placed inside the microplate reader."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}