{
  "id": 18960,
  "origin_website": "Jove",
  "title": "5/6th Nephrectomy in Combination with High Salt Diet and Nitric Oxide Synthase Inhibition to Induce Chronic Kidney Disease in the Lewis Rat",
  "procedures": [
    "All experiments are executed in accordance to the animal experimental ethical guide lines of the Utrecht experimental animal committee. The protocol is performed under the guidance and approval of the author's institution's animal care and use committee.\nCKD is induced in male inbred Lewis rats (Charles River, Sulzfeld, Germany) at the age of 8 weeks. Rats are housed under standard conditions in a light-, temperature- and humidity-controlled environment.\n1. Surgery Preparation\nSterilize surgical instruments:\n\t\n1 student tissue forceps 1-2 teeth 12 cm\n1 student standard pattern forceps\n2 Semken forceps\n1 Mayo scissors\n1 student iris scissors\n1 Olsen-Hegar needle holder with scissors\nBlanket\nCheck inventory list:\n\t\nOperating table with warming pad and lamp\nO2, isoflurane\nTissues\nShaver\nScales\nSterile operating set\nSterile gauze 5x5 and 10x10\n70% alcohol\n0.9% NaCl solution\n1 ml syringe\nNeedles (25G)\nGel foam pads: spongostan\nVicryl 4.0 and 5.0\nBuprenorphine 0.03 mg/kg (1:10 diluted in physiological salt)\nClean cage for rats after surgery\n2. Right Side Uninephrectomy\nDisinfect the table with 70% alcohol.\nPlace rat in induction box and induce anesthesia with 4% isoflurane and 1 liter flow of O2. Note: depending on the rat strain used, pre- and perioperative analgesia are prescribed, this needs to be discussed with the local veterinarian.\nTransfer rat to table and place nose into cone. The rat and nose cone are placed on a heating pad to maintain the rat's body temperature. The rat is ventilated with a mixture of 2% isoflurane and 1 liter O2.\nShave the flank of the rat and disinfect with alcohol. Wash and disinfect hands and wear sterile surgical gloves. Wear a head cap and a mask. Make a 1- 1.5 cm incision parallel to the ribs using anatomical forceps and blunt scissors. Expose the kidney by blunt dissection of the back muscles.",
    "The lower pole of the kidney is visible, carefully use the small blunt forceps to grip the perirenal fat tissue. Externalize the kidney by gently pulling on the perirenal fat with forceps. Take care to not disturb the adrenal gland during this procedure. The adrenal gland can be easily removed by placing a forceps at the medial site in the fat tissue and gently moved upwards between the adrenal gland and the kidney as depicted in Figure 2.\nPlace kidney gently on gauze and clear of surrounding fat and connective tissue. Identify the renal artery and vein and place a ligature (5.0 vicryl) with a single knot around the vessels, but do not tie off the knot.\nMove the loose knot carefully along the vessels towards the aorta by approximately 0.5 cm, to create space between the kidney and the knot. This is done to prevent the ligature from slipping off after cutting.\nTie knot with two double knots. If perfusion is halted, the color of the kidney will immediately change to brown. Do not cut the ends of the ligature.\nCut the renal vessels close to the kidney and remove the kidney. Gently pull on the long ends of the ligature to check for bleeding of the renal vessels. The ligature should stay in place on the vessel. Cut the long ends of the ligature. Note, the remnant renal vessels will retract into the abdominal cavity immediately.\nBlot excised kidney dry and weigh it.",
    "Close the skeletal muscle incision with running sutures with Vicryl 5.0. Inject 0.10 ml (0.03 mg/kg) buprenorphine i.m in the hind limb. Close the skin with Vicryl 4.0 with intracutaneous sutures. This prevents the rats from opening the wound. Note: due to respiratory depression in Lewis rats, we only give post-operative analgesia just before switching off the isoflurane.\nHouse the rat in a clean solitary cage with easy access to food and water. Place the cage half on warming pad O/N and check the rat carefully the next day. When the wound is closed and the rat is active, which is normally between 6 and 12 hr after surgery, the rat can be placed back into group housing.\n3. Left Side Subtotal Nephrectomy\nSeven days later, the same preparations are made on the left side as for the right side as described from 2.1 to 2.5. Before surgery, the amount of renal tissue that needs to be removed corresponding to approximately 2/3rds of the weight of the right kidney is calculated. Prepare small pieces of gel foam (Spongostan, Johnson & Johnson, New Jersey) before surgery.\nPlace sharp scissors around the upper pole of the left kidney and resect the upper pole in one stroke (for scissor location, see Figure 3). Cover immediately with a piece of gel foam and exert mild pressure with sterile gauze.\nRepeat with the lower pole of the kidney as in 3.3.\nLift kidney to prevent clotting on skin. Maintain mild pressure on both gel foam pads with sterile gauze until the bleeding stops. When bleeding persists, add another foam pad.\nPlace remnant kidney with adherent gel foam pads inside the abdomen. Close the muscle and skin and follow 2.9-2.12.\n4. Sham Surgery",
    "Sham operated controls undergo the same procedure in order to expose the kidneys. Instead of extirpating the kidney or cutting the poles one week later, both the kidneys are decapsulated at a one week interval, taking care not to disturb the adrenal glands. Wound closure and post-operative care are identical to 2.11 and 2.12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}