{
  "id": 8785,
  "origin_website": "Jove",
  "title": "Adeno-associated Virus-mediated Transgene Expression in Genetically Defined Neurons of the Spinal Cord",
  "procedures": [
    "All animal experiments were approved by the Swiss cantonal veterinary office (Zurich) and are in accordance and compliance with all relevant regulatory and institutional guidelines.\nNOTE: All materials along with respective manufacturers and/or vendors are listed in the Table of Materials.\n1. Generation of Cre-dependent AAV Vectors\nNOTE: A variety of Cre-dependent vectors with different promoters can be purchased (see Table of Materials) or, if the desired expression construct is not available, it can be generated by modifying existing AAV constructs. Note, the promoter and serotype can have an impact on the spread of viral transduction (see 12). The first part of this protocol briefly describes the generation of two different Cre-dependent AAV vectors suitable for gain and loss of function experiments, respectively.\nPharmacogenetic Activation (Gain of Function)\nOrder pAAV.hSyn.flex.hM3D(Gq)-mCherry (see Table of Materials) for designer receptors exclusively activated by designer drugs (DREADD)-mediated activation.\nUpon receiving the bacterial stab culture, streak out bacteria on LB plates (bacteriological-grade agar dissolved in Luria-Bertani liquid medium) supplemented with the appropriate antibiotic. Incubate over night at 37 °C and pick a single colony on the next day.\n\t\tNOTE: Plasmids containing AAV vector genomes can be unstable and recombination of the viral genome, especially within the viral inverted terminal repeats (ITR), can occur during amplification in E. coli. We suggest using recA-deficient/-suppressed strains such as MDS42 or Stbl3 to avoid recombination within the plasmid containing the AAV genome.\nAmplify bacteria following the instructions given by the vendor of the chosen DNA-Maxi-Kit and prepare high quality plasmid DNA with a commercially available DNA-Maxi-Kit (e.g., see Table of Materials). Perform a quality control of the plasmid DNA preparation by verifying the integrity and identity of the plasmid DNA through restriction digest of an aliquot of the plasmid DNA.",
    "NOTE: There are recognition sites for the restriction endonuclease SmaI within the ITRs. Include a SmaI digest in the quality control to verify the integrity of the ITRs.\nSend the DNA to a viral vector core facility in order to produce high quality rAAV.\n\t\tNOTE: High titer, high quality viral preps are crucial for avoiding confounding phenotypes caused by contaminations in the viral prep. We therefore recommend having the rAAV of choice produced in an established vector core facility, unless the AAV production is well established in the laboratory.\nAblation (Loss of Function)\n\tNOTE: Bacterial toxins or toxin receptors can be used to mediate cell ablation or neuronal silencing. We have generated pAAV.EF1α.flex.DTA to express diphtheria toxin fragment A (DTA) in a Cre-dependent manner.\n\t\nTo generate a Cre-dependent viral vector, choose a Cre-dependent vector with a suitable promoter (e.g., pAAV.EF1α.flex.hChR2(H134R)-eYFP). Amplify the coding sequence of choice (e.g., DTA) by polymerase chain reaction with primers that include AscI and NheI or compatible restriction endonuclease recognition sites in their overhangs (see Foster et al.7)\nUsing standard molecular biology techniques, perform restriction digests of the vector DNA (pAAV.EF1α.FLEX.hChR2(H134R)-eYFP) and of the PCR-amplified insert (NheI-DTA-AscI) with the restriction endonucleases AscI and NheI. Ligate the purified fragments.\nTransform the ligation reaction into suitable bacteria, according to the protocol given by the supplier of the competent bacteria of choice, and plate the bacteria onto LB plates. Use recA-deficient/-suppressed strains, such as MDS42 or Stbl3, for cloning and subsequent amplification of the plasmid DNA.\nOn the day after transformation, pick clones and inoculate them in LB medium supplemented with the appropriate antibiotic overnight at 37 °C. On the next day, extract plasmid DNA from cultured bacteria. Verify successful cloning by restriction digests and sequencing of the extracted plasmid DNA.",
    "Amplify high quality, bacterial plasmid DNA (see step 1.1.3). Send amplified DNA to a viral vector core facility for virus production.\n2. Transduction of Spinal Cells\nPreparation of Virus Solution\n\tCaution: Viruses are infectious reagents and should be handled according to the relevant guidelines. In most cases, rAAVs can be handled at biosafety level 1 (BSL1).\n\t\nOn the day of injection, defrost a stock aliquot of the desired purified virus on ice and keep it on ice until directly before the injection. Avoid repeated freeze-thaw-cycles, as these will reduce the effective titer of the virus.\n\t\tNOTE: If necessary, the defrosted virus aliquot can be kept at 4 °C for up to 3 days.\nDilute the virus particles in sterile 0.9% NaCl or phosphate buffered saline (PBS).\n\t\tNOTE: The appropriate titer depends on the experimental aims and should be determined experimentally. A good total viral load to start with is 3x109 genome copies (3.33x1012 GC/mL, 3x300 nL injected). Taking excess and some loss while loading the capillary into account, about 2.5 µL of virus solution will be needed for each mouse.\nPreparation of Micropipettes for Intraspinal Injections\n'Pull' thin-wall glass capillaries (outer diameter 1 mm) on a micropipette puller to create a ~5.5 mm long, shallow shank. Use a 3.0 mm heater filament and settings of program 00 with P(A) adapted as in Table 1.\n\t\tNOTE: Pulling can be done in advance. The pulled capillaries should be stored in a closed container on modeling clay to avoid dust, which could later clog the micropipette. Autoclaving of micropipettes is not necessary.",
    "Clip the shank of the pulled capillary with laminectomy forceps to a length of about 4.5 to 5 mm to create a tip opening with an inner diameter of 25-35 μm. Using a microscope with a micrometer scale, measure the inner diameter of several micropipettes to get a feeling for how large the opening should be, or measure for every micropipette.\n\t\tNOTE: A smaller tip can lead to clogging; a larger tip might cause tissue damage and difficulties to penetrate the spinal cord.\nPreparation of Surgical Setup and Tools\nEnsure the equipment is clean and ready to be used. Disinfect the work area by wiping with 70% ethanol and sterilize tools by autoclaving or disinfecting them. Do not leave any disinfectant on the microliter syringe that would harm the viral vector to be used.\nAnesthesia and Preparation of the Animal for Surgery\n\tNOTE: The total duration of the surgery is 60-90 min.\n\t\nChoose 6- to 10-week old mice to facilitate the surgical procedure.\n\t\tNOTE: If the experimental design requires it, the injection of younger or older animals is possible. Any strain and both sexes can be used in principle, but use the same background strain (e.g., C57BL/6J) for comparison of behaviors between different transgenic mouse lines. If sex differences are expected or to be investigated, analyze males and females in separate groups.\nInduce anesthesia using ~5% isoflurane. Place the animal in the stereotaxic frame on a heat mat and maintain anesthesia at 1-2.5% isoflurane (air flow rate 900 mL/min). Monitor the respiration rate throughout the surgery.\nApply lubricant eye ointment to prevent corneal drying during the surgery.\nShave the animal's back and remove hair carefully with wet tissues. Disinfect the shaved skin with iodine solution and allow the skin to dry.\nGive analgesic treatment (e.g., 0.1-0.2 mg/kg buprenorphine subcutaneously).",
    "Exposure of the Vertebral Column at the Lumbar Spinal Cord Level\n\tNOTE: Due to the differential development of the spinal cord and the vertebral column, the respective levels are not aligned, but the lumbar spinal cord segment L4 is at the same level as the thoracic vertebra T13.\n\t\nLocate the most caudal rib pair by palpating along the vertebral column. Using a scalpel, make a 1.5-2.5 cm longitudinal cut into the skin starting from just rostral to the most caudal rib pair.\nLift the skin with forceps and detach it from the underlying muscle with scissors. Throughout the surgery, keep the exposed tissues moist with sterile 0.9% NaCl.\nUsing fine forceps and small scissors, make an incision into the next, thin membranous layer right next to the midline and cut it off from the spinous processes. It is separate from the underlying paraspinous muscle, but attached to the spinous processes.\nIdentification of the Vertebrae at the Lumbar Spinal Cord Level\n\tNOTE: Once the vertebral column is exposed, the intertransverse ligaments and the dorsal spinous processes should be visible. Several anatomical landmarks can aid in identifying the correct vertebra to target (Figure 1B).\n\t\nPull the skin back towards the tail to expose the iliac crest. At the same level, the most caudal pair of visible intertransverse ligaments joins the L6 spinous process. Count backwards in a caudal to rostral direction to identify the vertebra of interest.\nPalpate along the vertebral column. The most caudal rib pair is located just rostral to the T13 vertebra and the pelvic bone at hip level is at the level of the L6 vertebra.",
    "Locate the spot where the tendon along the side of the vertebral column is whitest and most medial. The T13 vertebra is located just rostral. The lumbar spinal cord segment L4 is located within this vertebra.\nFixation of the Vertebral Column and Exposure of the Lumbar Spinal Cord\nPlace the animal onto a cushion of rolled up tissues to elevate it to the spinal clamps of the stereotaxic frame.\nFix the target vertebra to avoid movements of the vertebral column due to breathing. For this aim, align the clamps adjacent to the target vertebra, fix one clamp in position and hold the vertebral column with Adson forceps while fixing the second clamp.\n\t\tNOTE: The column should be perpendicular to the injection plane and firmly fixed so that it does not move upon pressure from above. If necessary, a second pair of clamps can be fixed to the vertebral column. In this case, it is useful to fix the two pairs of clamps to the two vertebrae adjacent to the target vertebra.\nRemove the paraspinous muscle above the vertebrae of interest. Using a scalpel, make a parallel incision just medial to the tendons that are parallel to the vertebral column, as well as perpendicular incisions rostral and caudal to the target vertebra. Be careful not to cut too deep. Tear/cut away the muscle using rongeurs. Use forceps as needed to remove tissue remaining on the vertebra or above the dura in the intervertebral space.",
    "In the intervertebral space, the dorsal blood vessel should be visible marking the midline of the spinal cord. For unilateral injections, perform a partial laminectomy by drilling a hole into the middle of the target side of the vertebra. Use a fine dentistry drilling apparatus with a 0.5 mm spherical cutter and drill especially carefully when approaching the spinal cord. Remove any remaining bone fragments with a 26G beveled needle to expose the spinal cord.\nUsing a 26G beveled needle, perforate the dura in the drilled hole, and in the intervertebral space rostral and caudal to the target vertebra, all approximately 200 µm lateral to the dorsal blood vessel. Cerebrospinal fluid should be escaping from the holes and the spinal cord should be slightly bulging out.\nPreparation of the Injection Syringe\n\tNOTE: The injection syringe should be prepared immediately before the start of the injection to reduce the risk of dust particles clogging the micropipette.\n\t\nMount the glass capillary onto a microliter syringe using the removable needle compression fitting kit. Fasten the nut tightly to ensure a tight and secure fit.\nFill the microliter syringe with sterile distilled water and start pressing it out with the plunger.\n\t\tNOTE: If there is too much resistance so that the water does not easily come out of the tip, the micropipette is likely blocked and should be exchanged.\nMount the syringe onto a micromanipulator connected to an electronically controlled microinjector. Be careful not to touch anything with the micropipette.\nUsing the microinjector, draw up about 1 µL of air to create a bubble between the water and the virus.",
    "Place a 2.5 µL droplet of virus solution onto a piece of paraffin film, carefully move the tip of the micropipette into the droplet using the stereotaxic frame and draw it up. Then carefully press dispense until a bit of virus solution emerges at the tip.\nRetract the syringe and, using a pen, mark the micropipette with a scale and note the level of the virus solution; this will facilitate the monitoring of whether the infusion is progressing as programmed.\nIntraspinal Injections\nMove the tip of the micropipette above one of the holes in the dura and then down until a slight dent is noted in the dura. To target the injection to the spinal dorsal horn, move down 500 µm in 100 µm consecutive increments (speed 1 mm/s) and then 200 µm up to allow for mechanical stabilization of the tissue.\n\t\tNOTE: The final depth of the tip is 300 µm in this case, but can be adapted depending on the target area.\n\t\t\nIf the tissue is resistant to penetration, the micropipette might be catching on the dura. In this case, retract and move slightly to overlie the hole, or use the needle again to perforate the dura properly before repeating the penetration attempt.\nProgram the pump to a target injection volume of 300 nL at an injection speed of 50 nL/min and press the start button to begin the infusion.\nAfter the injection is completed, check the scale to see whether the virus level has dropped and leave the micropipette in place for an additional 3 min to allow the pressure to equilibrate before slowly retracting the syringe.\nRepeat step 2.9.1.-2.9.3. for the other two injection sites.\nSuturing and Recovery\nRemove the spinal clamps and the cushion below the mouse.",
    "Close the wound in layers with interrupted stiches, suturing the superficial tissue layers with absorbable sutures and the skin with non-absorbable sutures. Apply iodine disinfectant on the sutured wound.\nTerminate the anesthesia and leave the animal on the heat mat until it recovers before returning it to its home cage.\nPostoperative Care\nMonitor the health of the animal on the day of surgery, the next day, and then every 2-3 days. Ensure that the animal has a normal gait, a healthy appearance (weight, eyes, fur, and behavior), and that the wound is healing.\nContinue analgesic treatment (e.g., 0.1-0.2 mg/kg buprenorphine subcutaneously) as necessary, three times per day.\n3. Behavioral and Morphological Analyses\nBehavioral Analysis\n\tNOTE: Allow animals to accommodate to the respective setup for at least 30 min before commencing measurements to let them adapt to the new experimental environment.\n\t\nvon Frey Test\nPlace animals individually into individual compartments of about 10 cm x 10 cm on a metal grid floor.\nStimulate the plantar surface of the hindpaw ipsilateral to the injection site with a dynamic von Frey filament. Note the force at which the animal withdraws its paw from the stimulus.\nRepeat five times and calculate the average withdrawal threshold from the six measurements for each animal.\nPin Prick Test\nPlace animals into individual compartments of about 10 cm x 10 cm on a metal grid floor.\nStimulate the plantar surface of the hindpaw ipsilateral to the injection site with a blunted 26-G needle without penetration of skin. Score behavior as zero (no reaction) or one (reaction).\nRepeat 9 times with intervals of 3 min between stimulations and calculate percentage response from the 10 measurements for each animal.\nInjection of DREADD-ligand clozapine-N-oxide (CNO)",
    "Dissolve CNO in dimethyl sulfoxide (DMSO) to create a stock solution of 0.2 mg/µL, which can be stored at room temperature.\nOn the day of the experiment, dilute stock solution in sterile 0.9% NaCl to 0.2 µg/µL and inject 10 µL/g body weight intraperitoneally. Inject control animals with vehicle (0.2% DMSO in 0.9% NaCl).\n\t\t\tNOTE: According to experience, peak effects on behaviors can be expected 1-3 h after injection, and effects should completely subside after 24 h. In the case of activation of glycinergic neurons, observed behaviors include reduced pain and itch responses. Behaviors evoked by DREADD-mediated activation of neurons will depend on the targeted subset of spinal neurons.\nInjection of Pruritogens to Induce Itch\nDissolve pruritogens in 0.9% NaCl to solutions of 8 mg/mL (chloroquine) or 10 mg/mL (histamine). 2 h after CNO administration, inject 10 µL of pruritogen or vehicle solution subcutaneously into the plantar surface of the hindpaw ipsilateral to the spinal injection site. Alternatively, inject the pruritogen intradermally into the calf, which has been shaved one day before to reduce aversive behavior caused by the shaving itself.\nVideotaping to Analyze Spontaneous Nocifensive or Pruritogen-induced Itch Behaviors\nPlace animals individually into transparent compartments (about 10 cm diameter) with a bit of bedding from their respective home-cage on the floor.\nVideotape the animals for 5 min to record spontaneous and for 30 min to record pruritogen-induced behaviors. Analyze the videos off-line in bins of 5 min.\nPain Versus Itch Behaviors\nObserve and note flinching, licking, and biting behaviors.\n\t\t\tNOTE: Flinching and licking of the affected site are considered responses to pain, whereas biting is associated with itch.",
    "Analyze videos at normal speed, measure the time that the mouse spent licking or biting the affected site, or measure in slow motion for a more precise distinction between licking and biting reflexes. Alternatively, count the number of licking/biting/flinching bouts.\nMorphological Analysis\nPerform morphological analyses from one to three weeks after injection of the virus or at the end of a behavioral experiment.\n\t\tNOTE: We have detected eGFP expression as soon as 48 h after injection, but also found that expression increases significantly within the next days and even weeks. For cells with strong reporter expression, one week of incubation (from intraspinal injection until perfusion) may be enough. For cells with weak transgene expression, viruses with weak promoters or weaker fluorophores, a longer expression may be required to ensure detectable levels.\nTissue Fixation\nPerfuse each mouse transcardially, first with of 20 mL of ice-cold artificial cerebrospinal fluid (ACSF) solution (NaCl 125 mM, NaHCO3 25 mM, NaH2PO4 1.25 mM, D-glucose 20 mM, KCl 2.5 mM, and CaCl2 2 mM MgSO4 1 mM), then with 100 mL of 4% ice-cold paraformaldehyde (in 0.1 M sodium phosphate buffer, pH 7.4).\n\t\t\tCaution: Paraformaldehyde is toxic and must be handled with care.\nImmediately dissect the lumbar spinal cord, and post-fix the tissue for 2 h with 4% paraformaldehyde on ice. Briefly wash the post-fixed tissue with 0.1 M sodium phosphate buffer (pH 7.4) and then incubate it in 25% sucrose solution (in 0.1 M sodium phosphate buffer, pH 7.4) overnight at 4 °C.\nCut the cryoprotected tissue at 30 μm on a cryostat and mount the sections on microscope slides.\nImmunofluorescence Staining\nAfter brief washes in PBS, apply 300 μL of blocking solution (10% Normal donkey serum in 0.3% Triton-PBS) on the sections for 1 h at room temperature.",
    "Incubate the slides with 300 μL of the respective combinations of primary antibodies in blocking solution (see Table of Materials) over night at 4 °C. Wash the sections 3 times for 5 min each in PBS.\nIncubate the slides with the respective combinations of secondary antibodies in blocking solution for 1 h at room temperature. Wash the sections 3 times for 5 min each in PBS.\nBriefly rinse the slides in ddH2O, then mount the coverslips using fluorescent mounting medium.\nAcquire fluorescent images using a confocal microscope equipped with a 20x and a 40x objective.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}