{
  "id": 10274,
  "origin_website": "Jove",
  "title": "Rapid Assembly of Multi-Gene Constructs using Modular Golden Gate Cloning",
  "procedures": [
    "NOTE: The hierarchical cloning protocol offered in this toolkit can be divided into three major steps: 1. Cloning part plasmids; 2. Cloning transcription units (TUs); 3. Cloning multi-gene plasmids (Figure 1). This protocol starts from the primer design and ends with applications of the cloned multi-gene plasmid.\n1. Primer design for cloning the part plasmid (pYTK001):\nDesign the forward and reverse primers containing flanking nucleotides TTT at the 5' end,a BsmBI recognition site with an additional nucleotide (CGTCTCN), a 4-nucleotides (nt) overhang (TCGG) complementary to that of the entry vector, a BsaI recognition site with an additional nucleotide (GGTCTCN), and a 4-nt part-specific overhang, in addition to the template-specific sequence (Figure 2A). GoldenBraid 4.037 and GoldenMutagenesis38 are some of the online software that can be used for Golden Gate specific primer design.\nIf BsaI or BsmBI recognition sites are present in any part, use a domestication step to mutate these sites prior to Golden Gate assembly39. For integrative plasmids (see step 4), domesticate any NotI recognition site. To domesticate a part with one undesirable recognition site, divide the part into two subparts near the undesirable site (Figure 2A):\n\t\nDesign the forward primer of the first subpart in the same manner as in step 1.1. but design the reverse primer with the BsmBI site and a 4-nt gene-specific overhang only.\nDesign the second sub-part forward primer with the BsmBI site and the 4-nt gene-specific overhang only that overlaps with the reverse primer of the first sub-part. Design the reverse primer of the second sub-part in the same manner as in step 1.1.\nIntroduce the desired mutation(s) in either the reverse (for step 1.2.1) or forward primer (step 1.2.2) at the gene-specific region of the primer.",
    "NOTE: Alternatively, a BsmBI- and BsaI-free and codon-optimized part can be synthesized commercially. For coding sequences (CDS), a synonymous mutation can be readily incorporated at the third nucleotide of an amino acid codon. For promoters and terminators, however, checking the mutated promoter or terminator activity using a reporter assay is recommended39. If there is an undesirable restriction site toward the end of the sequence, it can be mutated using a longer reverse primer. If multiple undesirable sites are present, site-directed mutagenesis allowing mutating multiple sites may be performed40.\nOccasionally, fusing two proteins as a single part with a linker in between is desirable (Figure 2A). The linker helps to ensure the structural integrity of the two individual proteins41.\n\t\nThe forward primer for the first gene is the same as in step 1.1. In the reverse primer, include a BsmBI site, a 4-nt gene-specific overhang, and a linker sequence. The 4-nt overhang can be either the linker or second gene's first few nucleotides.\nFor the second gene, design the forward primer such that it has a BsmBI recognition site and a 4-nt overhang complementary to that of the reverse primer of the first gene. Design the reverse primer of the second gene as in step 1.1.\nTo amplify the parts by polymerase chain reaction (PCR)42, use a high-fidelity DNA polymerase to amplify the parts from either a genomic DNA, a cDNA, or a plasmid. Check the PCR product on a 1% agarose gel followed by gel-purification. Using purified DNA is strongly recommended, if gel purification is laborious, use at least a spin column to purify the PCR product.\n2. Cloning parts into the entry vector (pYTK001) to create part plasmids (Figure 2B)",
    "To set up the Golden Gate reaction mix, add 20 fmol of each PCR product and the entry vector (pYTK001), 1 μL of 10X T4 ligase buffer, 0.5 μL of Esp3I (a highly efficient isoschizomer of BsmBI), and 0.5 μL of T4 ligase. Add ddH2O to bring the total volume to 10 μL.\nTo set up the cloning reaction, run the following program in a thermocycler: 25-35 cycles of 37 °C for 5 min (digestion) and 16 °C for 5 min (ligation), followed by a final digestion at 50 °C for 10 min and enzyme inactivation at 80 °C for 10 min.\n\tNOTE: 35 cycles of digestion/ligation are recommended when cloning multiple DNA pieces into the entry vector simultaneously, for example, during the cloning of fusion genes or domesticating a gene.\nTransform the entire reaction mix into the DH5α strain or equivalent Escherichia coli chemically competent cells by heat shock. Transforming the entire 10 μL cloned product into 35 μL chemically competent E. coli cells (2 X 105 cfu/mL, cfu is calculated from transforming 5 ng pYTK001 into 100 μL of the competent cells) is recommended. Spread on a lysogeny Broth (LB) plate with 35 μg/mL chloramphenicol (Cm). Incubate at 37 °C overnight.\nAfter 16-18 h, take the plate out from the incubator and keep the plate at 4 °C for about 5 h to let the super folder green fluorescent protein (sfGFP) develop for a more intense green color.\nFor easier screening, place the plate on an ultraviolet (UV) or a blue light transilluminator. The sfGFP containing colonies will fluoresce under the UV light.",
    "The green colonies are negative because they contain the uncut pYTK001. The white colonies are likely positive. The cloning is usually successful if there are ~30-100% white colonies. Perform further screening of a few white colonies by either colony PCR or restriction digestions (suggested enzyme: BsaI-HFv2).\nPurify plasmids from a few of the potentially correct colonies and confirm the sequences by Sanger sequencing.\n3. Assembling part plasmids into \"cassette\" plasmids\nNOTE: A cassette plasmid contains a user-defined transcription unit (TU) consisting of a promoter, a CDS, and a terminator. A cassette plasmid allows the expression of a single gene. If the cassette plasmids will be assembled into a multi-gene plasmid, then the first step is to determine the number and the order of TUs in the multi-gene plasmid. These will determine which connectors to use in the cassette plasmids since connectors link TUs in the multi-gene plasmid. The first TU's left connector should be ConLS, and the right connector of the last TU should be ConRE. They will overlap with ConLS' and ConRE' of multi-gene plasmids. The rest of the connectors should be in the increasing numerical order. For example, if the multi-gene plasmid contains four TUs, the connector combinations would be ConLS-TU1-ConR1, ConL1-TU2-ConR2, ConL2-TU3-ConR3, and ConL3-TU4-ConRE (Figure 1).\nBefore assembling transcription units, assembling an intermediate vector with the following six parts is recommended: the left connector, the sfGFP dropout (pYTK047), the right connector, a yeast selection marker, a yeast origin of replication and the part plasmid with an mRFP1, an E. coli origin and the ampicillin-resistant gene (pYTK083) (Figure 3).",
    "Purify the above six plasmids. Record their concentrations using a UV-Vis spectrophotometer or a fluorescence-based assay and dilute each plasmid with ddH2O so that 1 μL has 20 fmol of DNA. Calculate the DNA molar concentration by using an online calculator.\n\t\t​NOTE: It is very important to measure the DNA concentrations accurately and to pipet precisely for the assembly to work, especially for assemblies with five to seven part plasmids. Small errors in the DNA concentration of each plasmid can cause a significant decrease in cloning efficiency.\nAdd 1 μL of each plasmid, 1 μL of 10X T4 ligase buffer, 0.5 μL of BsaI-HFv2 (a highly efficient version of BsaI), and 0.5 μL of T4 ligase. Make up the volume to 10 μL by adding ddH2O.\nTo set up the cloning reaction, run the following program in the thermocycler: 25-35 cycles of 37 °C for 5 min (digestion) and 16 °C for 5 min (ligation). Omit the final digestion and heat inactivation steps as the BsaI sites need to be retained in the intermediate vector (Figure 3).\nTransform the entire reaction mix into the DH5α strain or other E. coli competent cells. Spread on an LB plate with 50 μg/mL carbenicillin (Cb) or ampicillin. Incubate at 37 °C overnight.\n\t\t​NOTE: Carbenicillin is a stable analog of ampicillin.\nAfter 16-18 h, take the plate out of the incubator. The plate will contain both pale red and pale green colonies (Figures 6C and 6D). Keep the plate at 4 °C for about 5 h to let the mRFP1 and sfGFP mature. Use a UV or a blue light transilluminator to identify the green colonies, which contain the potentially correct intermediate vector.",
    "Streak out the green colonies on an LB + Cb plate and incubate at 37 °C overnight. The next day, streak out again on an LB + Cm plate and incubate at 37 °C overnight. The colonies growing on LB + Cm plates contain misassembled plasmids because Cm resistant part vectors are retained.\nPick the colonies that do not grow on the LB + Cm plate and perform restriction digestions (suggested enzymes: BsaI-HFv2, Esp3I) to confirm the correctly assembled plasmid. Alternatively, use colony PCR for screening.\nOnce the intermediate vector has been successfully assembled, the next step is to assemble transcription units. This a 4-piece assembly with the following parts: the intermediate vector, a promoter, a CDS, and a terminator.\n\t\nPurify the four part plasmids. Record their concentrations and dilute each of plasmid so that 1 μL has 20 fmol of DNA.\nTo set up the reaction mix, follow Step 3.1.2.\nTo set up the cloning reaction, follow Step 2.2.\nTransform the entire cloning reaction mix into the DH5α or equivalent E. coli competent cells and plate on LB + Cb. Incubate at 37 °C overnight.\nAfter 16-18 h, take the plate out from the incubator. White and pale green colonies will appear (Figures 6E and 6F). Keep the plate at 4 °C for about 5 h to let the sfGFP mature. Use a UV or a blue light transilluminator to identify the non-fluorescent white colonies. These contain the potentially correct transcription units.\nStreak out and grow 8-10 white colonies and perform a colony PCR. Purify plasmids from the colonies that test positive from colony PCR. Carry out restriction digestion (suggested enzyme: Esp3I) to further confirm the assembly.",
    "​NOTE: Sequencing transcription units is typically not necessary because the cloning involves only restriction digestion and ligation. All sequences of interest have been confirmed at the part plasmid level.\n4. Assembling cassette plasmids into \"multi-gene\" plasmids:\nNOTE: Multi-gene plasmids allow the expression of more than one gene. Depending on the downstream application, multi-gene plasmids could be replicative or integrative. Replicative plasmids have the yeast origin of replication; therefore, it can be stably maintained when yeast cell divides. Integrative plasmids do not have the yeast origin of replication. Instead, they have 5' and 3' homology arms allowing the integration of multiple genes into specific loci of the genome through homologous recombination.\nFor multi-gene plasmids, assemble an intermediate vector first.\n\t\nTo assemble replicative intermediate vectors (Figure 4A), assemble the following six parts: the left connector (ConLS'-pYTK008), the sfGFP dropout (pYTK047), the right connector (ConRE'-pYTK072), a yeast selection marker, a yeast origin of replication, and the part plasmid with mRFP1, an E. coli origin of replication, and the kanamycin-resistant gene (pYTK084).\n\t\t\nFor assembly, follow the steps from 3.1.1 to 3.1.3.\nTransform the entire cloning reaction mix into DH5α or equivalent E. coli competent cells, and plate on LB plus 50 μg/mL kanamycin (Km). Incubate at 37 °C overnight.\nFor red/green color-based screening, follow step 3.1.5.\nFor screening of misassemblies, streak and grow the green colonies on an LB + Km plate. Then follow step 3.1.6.\nFor integrative multi-gene vectors (Figure 4B), determine the genomic locus of interest first, then design approximately 500 base pairs of 5' and 3' homology arms for integrating to that locus.\n\t\t\nClone the 5' and 3' homology arms from yeast genomic DNA into the entry vector-pYTK001. Follow steps 1 and 2.",
    "Assemble the following seven plasmids: the left connector (ConLS'-pYTK008), the sfGFP dropout (pYTK047), the right connector (ConRE'-pYTK072), a yeast selection marker, the 3' homology arm, the part plasmid with mRFP1, E. coli origin of replication, and the kanamycin-resistant gene (pYTK090), and the 5' homology arm.\nFor assembly and screening, follow step 4.1.1.\nAssembly of the multi-gene plasmid\n\t\nPurify plasmids of the intermediate vector obtained in step 4.1 and the cassette plasmids from step 3. Record their concentrations using a UV-Vis spectrophotometer or a fluorescence-based assay. Dilute each in ddH2O so that 1 μL has 20 fmol DNA.\nAdd 1 μL of intermediate vector, 1 μL of each transcription unit, 1 μL of 10x T4 ligase buffer, 0.5 μL of Esp3I, and 0.5 μL of T4 ligase. Bring the volume to 10 μL of using ddH2O.\nTo set up the cloning reaction, follow step 2.2.\nTransform the entire cloning reaction mix into DH5α or equivalent E. coli competent cells, and plate on LB + Km. Incubate at 37 °C overnight.\nPerform the green/white screening as in step 3.2.5.\nPurify plasmids from a few white colonies and perform restriction digestions. Using the NotI-HF enzyme is recommended because there are two NotI sites at the E. coli origin and Km selection marker part, respectively (Figure 4B). If the assembled plasmid is very large, then another restriction site can be chosen for further confirmation. Alternatively, screen with colony PCR before proceeding to restriction digestion.\n5. Applying multi-gene plasmids for chromosomal or plasmid-based gene expression\nIntegrating multi-gene plasmid into the yeast genome for chromosomal gene expression (Figure 5)\n\t\nDesign a guide RNA (gRNA) for the desired locus. Using multiple online resources, such as Benchling, CRISPRdirect43, and CHOPCHOP44, are recommended to determine the maximum on-target specificity.",
    "Clone the synthesized 20-nt gRNA into the pCAS plasmid45 by Gibson cloning. Linearize the pCAS plasmid by PCR using a reversed primer pair binding to the 3' of the HDV ribozyme and the 5' of the tracrRNA respectively (Figure 5).Alternatively, clone the gRNA into the sgRNA dropout plasmid (pYTK050) and assemble the dropout plasmid into a cassette plasmid with linkers. Then assemble the Cas9 TU with the Cas9 part plasmid (pYTK036). Lastly, assemble the Cas9 TU and the sgRNA TU into a replicative multi-gene plasmid.\nLinearize 5-15 μg of integrative multi-gene plasmid with 1 μL of NotI-HF enzyme overnight. Transform 1 μg of pCAS-gRNA and the linearized integrative multi-gene plasmid into S. cerevisiae. Prepare competent cells using either a commercially available yeast transformation kit or following the protocol by Geitz and Schiestl, 200746.\n\t\t​NOTE: It is unnecessary to purify the linearized multi-gene plasmid after the NotI digestion.\nPellet the cells after recovery, discard the supernatant, wash with an equal volume of water. Plate yeast cells on the complete synthetic medium (CSM) dropout plate or the yeast extract peptone dextrose medium (YPD) plate with antibiotics, depending on the yeast selective marker. Incubate at 37 °C for two days for colonies to form. In case no colony is observed, incubate for an additional one to two days at 30°C.\nScreen yeast colonies for integration by colony PCR47.\nTo cure the pCAS, streak out the colony with the correct integration onto a non-selective YPD plate. Grow at 30 °C overnight. Streak one colony from the YPD plate onto a fresh YPD plate. Again, grow at 30 °C overnight. Streak a colony from the second YPD plate to a YPD plus 100 μg/mL nourseothricin, the selection marker of pCAS. Successful curing occurs when yeast cells fail to grow on the selective plate.",
    "​NOTE: If the pCAS plasmid is not cured in two rounds of non-selective YPD, streak again onto a fresh YPD for another 1-2 rounds.\nTransforming replicative multi-gene plasmid for plasmid-based gene expression\n\t\nTransform 100 ng-1 μg pure multi-gene plasmid into S. cerevisiae competent cells.\nPlate yeast cells immediately after transformation onto the CSM dropout plate or YPD plus antibiotic plate, depending on the yeast selection marker used. Incubate at 30°C for 2-3 days for colonies to form.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}