{
  "id": 15317,
  "origin_website": "Jove",
  "title": "High Fat Diet Feeding and High Throughput Triacylglyceride Assay in Drosophila Melanogaster",
  "procedures": [
    "1. HFD Feeding Protocol\nimgsrc://cloudfront.jove.com/files/ftp_upload/56029/56029table1.jpg\nTable 1. Fly food recipe.\nThis table summarizes the different ingredients used to prepare our control food. Once made, 10 mL of the food is poured into vials, cooled and stored at 4 °C for long term storage.\nHFD preparation\nTo make 1 kg of high fat food, weigh 700 g of pre-made normal fly food (see Table 1) and 300 g of coconut oil into two separate containers using an analytical balance.\nHeat each container individually in the microwave, until the contents melt completely. Pour the coconut oil into the fly food container. Stir using a whisk until the oil is well mixed into the fly food.\n\t\tNOTE: No chunks of food or oil should be visible. When the fly food is melting in the microwave, stop at intervals of 1 min to mix the food and prevent boiling over.\nRe-weigh the high fat food. If the total weight is less than 1 kg (700 g of food + 300 g of coconut oil), add water (around 10 mL) to compensate for evaporation during heating and to bring back the weight to 1 kg.\nPour about 10 mL well-mixed high fat food per vial (around 25% of vial volume). Next, cover with cheesecloth to prevent flies' contamination. Cool for 1 h at room temperature then transfer the vials to 4 °C for storage up to 4 weeks.\n\t\tNOTE: The Normal food (NF) is used as a control food. Also pour 10 mL (around 25% of vial volume) of NF per vial. For the HFD food, replace 30% of the NF food with coconut oil. For control and experimental conditions, the flies were given the same amount of NF and HFD (10 mL of food per vial).\nimgsrc://cloudfront.jove.com/files/ftp_upload/56029/56029fig1.jpg\nFigure 1. HFD feeding in Drosophila.",
    "The scheme shows the different feeding steps for flies on a control food (normal diet without addition of coconut oil-NF) or HFD (with the addition of coconut oil). The entire process takes 10 days after the initial collection of adult flies. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56029/56029fig1large.jpg]\nHFD feeding of D. melanogaster\n\tNOTE: This protocol includes control food and HFD feeding procedures that are compatible with any fly line. Control and experimental flies are put in vials containing the same amount food (NF or HFD).\n\t\nUse CO2 to anesthetize the flies.\n\t\tNOTE: For neophytes, please read reference21 for an overview on raising and handling D. melanogaster.\nCollect 0-5 day old flies from vials and transfer (by flipping) the flies into new vials containing NF (previously warmed at room temperature). Let the flies age for 5 additional days at 21 °C.\nAt the end of the 5 days, take out the vials containing HFD and NF from 4 °C.\n\t\tNOTE: As cold temperatures can stress living flies, let the vials sit for 30 min at room temperature to warm up before use.\nUsing wipes, clean and remove excess fluid from the sides of the vials.\nInsert a small piece of filter paper, about 1 cm x 3 cm, into the high fat food to absorb any surplus liquid.\n\t\tNOTE: This step is critical for preventing the flies from sticking to the HFD food.\nNext, transfer the flies onto the high fat food (by flipping). Lay the vials horizontally on their side, (not standing) at 21-22 °C for 5 days.\n\t\tNOTE: Avoid higher temperatures as this can partially melt the high fat food, causing the flies to stick to the food and die.",
    "After 5 days, transfer (by flipping) the flies from NF and HFD into new vials without food to allow their guts to empty for 30 min. Next, proceed to weighing the flies.\n\t\tNOTE: One of the critical steps in this HFD feeding protocol is to prepare a well-mixed HFD, free of any chunks of fly food or condensed oil. Homogenous mixing and cooling the HFD to 45-30 °C is advisable, before pouring into vials and storing the food at 4 °C. Proper age matching of control and experimental flies is important as well as controlled nutritional and environmental conditions prior to the HFD feeding. During the feeding phase, control and experimental flies must be given the same amount of NF and HFD. Never collect flies from overcrowded vials or bottles (to avoid transgenerational effects). Always put a maximum of 25 flies per vial during NF and HFD feeding to avoid dietary restriction or other crowding effects. The HFD is composed of 30% coconut oil, thus temperatures above 22 °C might partially melt the HFD, causing the flies to stick on the oily food and die. Before putting the flies on the HFD, clean the vials to remove any residual oil and insert a filter paper to absorb any excess fluid in the food. During the incubation of the flies on HFD, the vials are laid on their sides to provide a fat-free horizontal surface for the flies.\nWeighing the flies\nFor each genotype and gender to be tested, use an ultra-sensitive scale to record the weights of pre-labeled, empty 1.7 mL tubes.\nUsing fly anesthetic or CO2, anesthetize and collect 36 flies of the same genotype, gender, and feeding status with a brush into one pre-weighed 1.7 mL tube.\nWeigh the tube containing flies with the same ultra-sensitive scale.",
    "Determine the average fly weight following this formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56029/56029eq1.jpg\n\t\tNOTE: The number of flies in this protocol is 36.\nFlash freeze the 1.7 mL tubes containing flies by plunging into liquid nitrogen for 2 min. Collect and put the tubes into boxes. Next, transfer the boxes to -80 °C (preferable temperature) for storage until use with the TAG assay.\n\t\tCAUTION: Liquid nitrogen is at an extremely low temperature. Please use appropriate personal protective gear.\n2. TAG Assay\nPreparation of the TAG standard concentrations\nPrepare 500 mL of PBT (PBS 1X, 0.05% Triton).\nUsing 0.5 mL tubes and the TAG solution (Table of Materials), prepare 100 µL of blank (PBT only) and 100 µL of six standard TAG concentrations (2 µg/µL; 1 µg/µL; 0.5 µg/µL; 0.25 µg/µL; 0.125 µg/µL; 0.0625 µg/µL) with the PBT.\nPlace the tubes on ice and proceed with grinding the flies.\nGrinding the flies\nTake out the frozen flies from -80 °C (step 1.3). Transfer the tubes containing the flies on ice.\nFirst, place 2 mm metal grinding balls into a 96-well ball dispenser, use a small paintbrush to remove extra balls.\nPlace the 96-well grinding plate upside down on top of the ball dispenser and flip to transfer the metal balls directly into the grinding plate. There should be one ball per well.\nUsing a multi-channel pipette, add 600 µL of PBT into each row of the 96-well grinding plate.\nWith forceps, add 3 flies per well. Indicate the genotype, gender and food condition of the flies in each row/well of the 96-well grinding plate.\nTightly place the caps onto the 96-well grinding plate. Tape may be placed on top to ensure that there is no leakage.",
    "Properly place the 96-well grinding plates into the grinding machine. Set the machine to the highest speed and press \"run\" to grind the flies for 3 min.\nAfter 3 min, stop the grinding and proceed with plate centrifugation: centrifuge for 15 min at 4,000 x g, 4 °C. After centrifugation, manage the grinding plate carefully to avoid mixing the supernatant with the pellet.\nSample loading and TAG content determination\nTake a new 96-well spectrophotometer plate. Using a multi-channel pipette, load 200 µL of the TAG reagent into each row of the plate.\nLoad 20 µL of PBT into the first well of the first row, to create a blank. Mix by pipetting up and down. Avoid forming bubbles.\nLoad 20 µL of each standard dilution (from step 2.1.2) into the remaining wells of the first row and mix by pipetting up and down. Avoid forming bubbles.\nUsing a multi-channel pipette, transfer 20 µL of supernatant from each row of the grinding plate to the corresponding row in the 96-well spectrophotometer plate. Pipette up and down to mix well. Avoid forming bubbles.\nNext, place a gas-permeable foil over the top of the 96-well plate.\nIncubate the plate at 37 °C for 10 min.\n\t\tNOTE: If there are bubbles in the wells, centrifuge the plate for 2 min at 2,000 x g to remove all bubbles. The presence of bubbles will interfere with the absorbance reading.\nRead the absorbance of each well of the plate at 550 nm using a compatible microplate reader. Next, trace the standard curve and determine the concentration [µg/µL] of the unknown samples.\nTo determine the amount of TAG content per mean fly weight, use the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56029/56029eq2.jpg",
    "NOTE: In this protocol, 3 flies were minced in 600 µL of PBT; in consequence, the mean volume per fly is 200 µL.\nBradford assay and normalization of TAG content with protein content\nPrepare seven 100 µL of bovine serum albumin (BSA) standard dilutions (75 µg/mL; 100 µg/mL; 150 µg/mL; 200 µg/mL; 250 µg/mL; 500 µg/mL; 1,000 µg/mL) with the PBT.\nTake a new 96-well plate and load 200 µL of 1X Bradford reagent into each row of the plate.\nIn the first well of the first row, add 10 µL of PBT to create a blank. Mix by pipetting up and down. Avoid forming bubbles.\nAdd 10 µL of each standard dilution into the remaining wells of the first row and mix by pipetting up and down. Avoid forming bubbles.\nUsing a multi-channel pipette, transfer 10 µL of the fly supernatant from each row of the grinding plate into the corresponding row in the 96-well plate. Pipette up and down to mix well. Avoid forming bubbles.\nPlace a gas-permeable foil over the top of the 96-well plate.\nIncubate the plate at room temperature for 5 min. If there are bubbles in the wells, centrifuge the plate for 2 min at 2,000 x g to remove them.\n\t\tNOTE: The presence of bubbles will interfere with the absorbance reading.\nUse a spectrophotometer to read the absorbance of the blank, standards and unknown samples at 595 nm. Use the standard curve to determine the concentrations [µg/µL] of the samples in each row.\nNormalize the TAG content with protein level using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56029/56029eq3.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}