{
  "id": 18618,
  "origin_website": "Jove",
  "title": "Leprdb Mouse Model of Type 2 Diabetes: Pancreatic Islet Isolation and Live-cell 2-Photon Imaging Of Intact Islets",
  "procedures": [
    "NOTE: All present experiments were performed according to local animal ethics procedures of the University of Queensland (approved by the University of Queensland, Anatomical Biosciences Ethics Committee).\n1. Islet Isolation\nReagent preparation\n\t\nMixture of enzymes\n\t\t\nFor the pancreatic digestion, use a mixture of liberase and collagenase type IV. Dilute liberase TL (thermolysin low) 1 vial of 5 mg with 26 ml of DMEM (Dulbecco’s Modified Eagle Medium).\nPrepare collagenase type IV in Hank’s buffer at a concentration of 0.5mg/ml, supplemented with 5mM HEPES, 0.5mM CaCl2, 0.1mg/ml DNAse and 1mg/ml bovine serum albumin.\nMix the liberase TL and collagenase solutions in a ratio of 4:1 (by volume), i.e., 4 ml liberase TL + 1 ml collagenase. Aliquot the mixture of enzymes to 2.5ml each and store at -20 °C.\n\t\t\tNOTE: The tissue incubation times vary a bit between batches of enzyme (30 sec to 1 min difference). Therefore, a batch test may be required.\nRPMI Isolation Media\n\t\t\nDissolve one vial of RPMI 1640 powder in 1 L of water at RT and supplement with 2 g NaHCO3, 4.02 g HEPES.\nCombine the RPMI isolation media in a large conical flask, mix with magnetic stirrer, adjust to pH 7.4 with NaOH, filter sterilize and store at 4 °C.\nRPMI Culture Media\nUse RPMI culture media, with 10% fetal bovine serum and 1% antibiotics (i.e., penicillin 100 U/ml, streptomycin 100 μg/ml).\nIslet Isolation and Culturing\n\t\nAnimal Sacrifice\n\t\t\nSacrifice mice by cervical dislocation or CO2 asphyxiation according to the local institution’s ethics procedures. Spray the mouse body thoroughly with 70% ethanol.\nPancreatic Perfusion",
    "Use 2 long cuts laterally through the abdominal skin and peritoneum to make a V-shaped flap. Pull the flap of the skin up to uncover the entire abdominal cavity, put aside the bowel and keep the liver in place by a folded tissue paper to reveal the common bile duct (Figures 1 and 2). Put the animal so that the head toward the surgeon and the tail away from the surgeon.\nApply a vascular clamp at the ampulla on the duodenum wall to block the injected enzymes from entering the duodenum (Figure 1).\n\t\t\tNOTE: This is an important step as it determines whether the injected enzymes will go into the pancreatic duct and perfuse the pancreas or reflux to the injection site (over clamp) or go into the duodenum (under clamp).\nCannulate the common bile duct with a 31 G needle near the junction of the common hepatic duct and cystic duct (Figure 1) and leave room for a second injection if the pancreas fails to perfuse the first time. Slowly (over ~10 sec) inject about 2 ml of cold enzyme mixture into the mouse common bile duct.\n\t\t\tNOTE: The pancreas will be perfused quickly if the clamp is in the right position.\nAdjust the clamp position if the needle is inside the common bile duct but cannot perfuse the pancreas (i.e., move up the clamp a bit away from the liver if over clamped or move it down a bit to the liver if under clamped).",
    "NOTE: The needle sometimes goes into the surrounding capsule rather than the lumen of the duct. A useful sign to check whether the needle is inside the common bile duct is the dilation of the duct when injecting. If the pancreas fails to perfuse, an alternative is the enzyme mixture could be injected to multiple sites of the pancreas with lower yield expected. The perfusion of the left site of the pancreas (the splenic lobe) is important for maximization of the islet yield.\nAfter the pancreas is perfused, quickly remove the pancreas, put it into a vial (~20 ml, glass) and incubate for ~19 min in a 37 °C water bath.\n\t\t\tNOTE: The incubation time can vary a bit depending on the mouse strain and age.\nAfter the incubation time, stop the digestion process by adding ~20 ml of cold isolation media. Shake the vial gently to disrupt the pancreas and pour it through a normal tea sieve (pore diameter of 1 mm) into a sterile 50 ml tube. Top up the tube with isolation media and centrifuge at 400 x g for 1 min at 4 °C with brake off.\nDissolve the pellet in the isolation media again and transfer to two 15 ml tubes, then centrifuge at 400 x g for 1 min at 4°C with brake off. After aspiration the supernatant, mix the two pellets well with 6 ml of density gradient cell separation media (Histopaque 1077 solution) per tube by vortexing or pipetting up and down. Then gently add ~6 ml of the isolation media to the side of the tube on top of the density gradient separation media and centrifuge at 100 x g for 15 min at 4 °C with brake off.",
    "Collect the supernatant in the upper (isolation media), middle and lower (density gradient cell separation media) layer in 3 separate dishes. Handpick the islets in these 3 dishes, using a pipette under a dissecting microscope.\n\t\t\tNOTE: The middle layer contains most of the islets. Islets are recognized as compact structures of ~ 50 to 500 μm in size (Figure 3). We obtain ~200 islets in WT mice and 300- <100 islets in db/db mice.\nIslet Culturing\n\t\t\nTo help the islets recover from the enzyme digestion, culture groups of 40 islets in a 25 cm petri dish with 6ml RPMI culture media (10mM glucose) at 37 °C, 5% /95% CO2/O2 for 2 days before live-cell 2-photon imaging. Change the culture media daily. \n2. Live Cell 2-Photon Imaging\nReagent Preparation\n\t\nExtracellular Buffer\n\t\t\nPrepare the sodium rich extracellular buffer for the 2-photon assay with 140 mM NaCl, 5 mM KCl, 2.5 mM CaCl2, 1 mM MgCl2, 5 mM NaHCO3 and 10 mM HEPES.\nExtracellular Dye\n\t\t\nFor the 2-photon assay, prepare stock SRB 8 mM in extracellular buffer, aliquot into small tubes and store at -20 °C. Dilute the stock SRB 1:10 in fresh extracellular buffer to get a working concentration of 0.8 mM.\nphoton Imaging\n\t\nFirst, pre-incubate 2-day cultured islets in 3 mM glucose extracellular buffer for 30 min.\n\t\tNOTE: We use islets between 2 and 5 days in culture.\nThen, place a glass slide onto the thermo-control chamber mounted on the microscope stage. Use grease to prevent the leaking of solution.\nCover the chamber with 500 μl of extracellular buffer containing 0.8 mM SRB with different glucose concentrations (3 mM, 6 mM, 15 mM and 20 mM glucose).",
    "Next, place the pre-incubated islet into the middle of the chamber and focus at 3-4 cell layers into the islet where, in rodent islets, immunostaining for insulin shows that most cells are beta-cells.\n\t\tNOTE: The SRB will outline all the cell membrane of the islet quickly and the islet is ready to image.\nUse a 2-photon microscope with a 60X oil immersion objective (NA 1.42) and imaging software (e.g., ScanImage 11). Figure 4 illustrates a typical microscopy arrangement. Image exocytic events using SRB as a membrane impermeant fluorescent extracellular marker excited by femtosecond laser pulses at 880 nm, with fluorescence detected at 550-650 nm. Record the islet responses to stimulation.\nIdentify single exocytic events by the sudden appearance of a small fluorescent spot (resolution 10 pixels/µm) and confirm by the fast rising phase of the fluorescent signal over a region of interest (~0.78 μm2).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}