{
  "id": 6083,
  "origin_website": "Bio",
  "title": "Evaluation of the Condition of Respiration and Photosynthesis by  Measuring Chlorophyll Fluorescence in Cyanobacteria",
  "procedures": [
    "The goal of this protocolTo estimate the condition of both photosynthesis and respiration, we determine NPQ, a parameter representing non-photochemical quenching of chlorophyll fluorescence, which predominantly reflects the redox state of PQ pool. NPQ is calculated as (Fm - Fm’)/Fm’, where Fm is the maximum fluorescence level determined under fully oxidized PQ pool (i.e., State 1 condition), while Fm’ is that under reduced PQ pool conditions where State 2 is partly induced. In this protocol, Fm’ is determined both in the dark (Fm’Dark) and under illumination with low light (Fm’LL), and each value is used for calculation of NPQ in the dark (NPQDark = (Fm - Fm’Dark)/Fm’Dark) or that under illumination with low light (NPQLL = (Fm - Fm’LL)/Fm’LL), respectively. From these two parameters, we can collect information about the condition of photosynthesis and respiration.Culture of cyanobacteriaThe cyanobacterium Synechocystis sp. PCC 6803 is cultured at 30 °C in BG11 medium in a test tube (see in the “Recipes” section), bubbled with air for 24 h under continuous light (120 μmol m-2 sec-1) and served for the measurement. Photon flux density of growth light is determined by a spherical micro-sensor (WALZ, US-SQS/L) with a light meter (LI-250A, LI-COR Biosciences).Setting WATER-PAM for the measurementPrior to the measurement by WATER-PAM, set the levels of the measuring light, actinic light and saturating pulse in the <Settings> panel of the WinControl software. The levels should be set as follows:Measuring light frequency (<Freq.> setting) at the level 2 of 12 steps.Measuring light intensity (<Int.> setting) at the level 2 of 12 steps. Note: By these settings, measuring light is weak enough to avoid excitation of photosystems (see also the note below). Saturating pulse intensity (<Int.> setting) at the level 12 of 12 steps and saturating pulse width at 0.8 sec. Actinic light amplitude (<Ampl.",
    "> setting) at the level 10 of 12 steps and actinic light intensity (<Int.> setting) at the level that gives the necessary photon flux density of the actinic light.Note: We determine photon flux density of actinic light in a cuvette (WALZ, WATER-K) filled with MilliQ water by using a spherical micro-quantum sensor (WALZ, US-SQS/L) with a light meter (LI-COR Biosciences, LI-250A). Photon flux density of measuring light, saturating pulse and actinic light by the settings described above is < 0.01, > 4,000 or 100 μmol m-2 sec-1, respectively.  The procedure for recording chlorophyll fluorescence in cyanobacteria by WATER-PAMPreparation of a sample for the measurementCell cultures are adjusted to the optical density of 0.2 at 750 nm, which is approximately equivalent to 1 μg/ml of chlorophyll in Synechocystis sp. PCC 6803, when cells are grown under the condition described in the “Materials and Reagents” section. Notes:  Prepare > 4 ml of the sample. 2 ml of the sample will be used for the measurement of Fm’, and another 2 ml for the measurement of Fm.In the case of Synechocystis sp. PCC 6803, the sample is not necessary to be stirred during the measurement within about 15 min. If you deal with samples necessary to be stirred, the stirring device for CUVETTE Version of WATER-PAM (WALZ, WATER-S) is available for stirring cell culture during the measurement.Measurements of Fm’, the quenched fluorescence level, either in the dark (Fm’Dark) or under illumination with low light (Fm’LL)The sample (2 ml) is dark-acclimated for 10 min prior to the measurement in the sample chamber of the WATER-PAM.",
    "Note: Please make sure that checkboxes in the <Status> panel (circled by a yellow square in Figure 1, a screenshot of the software) at the bottom left of the window of the WinControl software are all cleared except for the <PM active> checkbox during the dark-acclimation. After the dark-acclimation, time course change in the level of chlorophyll fluorescence is determined in the <Chart> panel (circled by a red square in Figure 1) of the WinControl software as follows: First, start the recording of chlorophyll fluorescence by clicking <Start Onl. Rec.> button at the bottom right of the <Chart> panel (or checking <Rec. Online> checkbox at the top right of the <Chart> panel). Then, start illumination with measuring light by checking <Meas. Light> checkbox in the <Status> panel at the bottom left of the window. The level of chlorophyll fluorescence rises from zero to the Fo’ level (This is NOT the Fo level in the case of cyanobacteria. See Note described below), the minimum fluorescence level with reduced PQ pool already in the dark. Note: Please keep in mind that, unlike in the case of land plants, the chlorophyll fluorescence level is already quenched from original Fo level to Fo' level in the dark-acclimated cyanobacterial cells, due to the reduction of PQ pool by respiratory electron transport in the dark. Subsequent application of 0.8 sec pulse of saturating light by checking the <SAT-Pulse> checkbox in the <Status> panel at the bottom left of the window induces the increase of fluorescence level to Fm’ level in the dark (Fm’Dark).",
    "The value of this Fm’ level in the dark, which is used for calculating NPQDark = (Fm - Fm’Dark)/Fm’Dark, is displayed in the <Result> panel (circled by a blue square in Figure 1) at the right side of the window and can be always checked in the <Report> panel. Note: Please note that the peak height of the fluorescence increase triggered by the application of saturating light may not reach the level of Fm' (indicated by 'x' in Figure 1) because of the problem in pixel resolution of the screen. Subsequently, start illumination with actinic light by checking <Act. Light> checkbox in the <Status> panel. After the fluorescence level reaches the stable level under illumination, apply a saturating pulse to the sample to determine the Fm’ level under illumination with low light (the Fm’ level used for calculating NPQLL, which is calculated as (Fm - Fm’LL)/Fm’LL).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180502/20180502024936_3016.jpgFigure 1. The window of the PC software “WinControl”, displaying time course change in chlorophyll fluorescence in <Chart> panel. Black arrowheads represent the time of illumination with saturating pulse. In the measurement shown in Figure 1, effect of high light (HL) was examined following the routine determination of Fm’ in the dark and under low light.Measurement of Fm, the maximum fluorescence levelTo measure the Fm level, add 20 μM DCMU (final concentration) to 2 ml of the fresh sample prepared in Step D1.Note: Since the chlorophyll fluorescence in cyanobacteria is already quenched in the dark, the maximum fluorescence level (Fm) must be determined in the presence of DCMU in the light, which oxidizes PQ pool and thus brings the cells to State 1 to eliminate quenching of the fluorescence.",
    "It is possible to add DCMU to the sample after determining Fm’ levels as described above, but sometimes actinic illumination may change the condition of the sample to interfere the precise determination of Fm, especially in the case of gene-disruptants. Thus, it is advisable to determine Fm level in a separate fresh sample.Set the sample in the sample chamber of WATER-PAM, and then start recording with measuring light. To determine the Fm level, apply saturating pulse to the sample under different levels of actinic light. Actinic light should be changed from low level to high level by clicking the upward arrow at the right side of <Act. Int> value in <Basic> panel at the bottom of the window, and find the maximum level of fluorescence signal by confirming the value of Fm’ in the <Result> panel.Note: There is no need to dark-acclimate the sample prior to the measurement of Fm in this procedure. And note that the value of Fm is displayed in the <Fm’> Box but not in the <Fm> Box in the <Result> panel in this procedure, because the <Fo, Fm> button is not used (see the “Notes” section)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}