{
  "id": 4813,
  "origin_website": "Bio",
  "title": "Telomere-mediated Chromosomal Truncation via <em>Agrobacterium tumefaciens</em> or Particle Bombardment to Produce Engineered Minichromosomes in Plants",
  "procedures": [
    "In-Gel ligation Streak a LB plate containing 100 mg/ml spectinomycin with plasmid pWY82 and grow at 30 °C for 2 days.  Begin a 3 ml starter culture with a single colony of pWY82 in 2XYT media with 100 mg/ml spectinomycin and grow for 48 h at 30 °C and 250 rpm. Note: pWY82 is a slow growing plasmid.  Add 500 μl of starter culture to 125 ml 2XYT in a baffled culture flask. Shake at 250 rpm for 48 h at 30 °C until OD600 = ~2 when measured with a spectrophotometer. Extract plasmid DNA with the QIAprep Spin Miniprep kit, using 4 ml  of culture per spin column. Elute with 50 μl of nuclease free water preheated  to 50 °C.  Pool minipreps into a 1.7 ml tube and place into a vacuum concentrator until  the concentration is about 1 μg/μl when measured with a Nanodrop spectrophotometer.  Confirm the integrity of pWY82, target plasmid, and cut sites by digesting 1 μg of pWY82 and target plasmid with each enzyme individually and in tandem following the manufacturer’s instructions. Note: Due to the instability of telomere repeats, the telomere fragment will show multiple bands when subjected to agarose gel electrophoresis with the full 2.6 kb repeat not always visible (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150921/20150921010441_2659.jpgFigure 1. 1% (w/v) agarose gel of three different colonies of pWY82 cut with EcoRI and HindIII showing the range of telomere sizesDigest 10 μg of pWY82 and 5 μg of target plasmid with 10 units of each restriction enzyme for at least one hour.  Note: Total restriction digest volume should be no more than 50 μl.  Pour a 1% (w/v) low melting point agarose gel prepared with 1x TAE in a 4 °C cold room.",
    "Note: Use a comb large enough to fit each restriction digest fully in a single well. Treat target plasmid with 5 units of Antarctic phosphatase for 15 min at  37 °C.  Add 15 μl of 6x loading dye to each reaction.  Fill the electrophoresis chamber with cold 1x TAE and carefully insert the  gel.  Caution: Low melting point gels are extremely fragile.  Load each restriction digest completely into the gel.  Load 6 μl of GeneRuler 1 kb DNA Ladder next to each restriction digest lane. Run the gel in a 4 °C cold room at 100 V until the lower band of loading dye  has reached the bottom of the gel.  Carefully transfer the gel to a dish containing 1x TAE and 0.5 μg /ml ethidium bromide and stain for 30 min.  Visualize DNA with UV light and estimate concentrations by comparison to the reference DNA ladder. Note: Concentration is estimated by comparing sample UV intensity with ladder UV intensity. The amount of DNA present in the ladder is available in the literature.  Carefully excise the uppermost visible telomere band and the target plasmid backbone with a scalpel and place into separate 1.7 ml tubes (Figure 2).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150921/20150921010502_7784.jpgFigure 2. Example of gel to be used for ligation. pNG4 was the target plasmid for this ligation. The boxed sections were excised. Add 1 ml of nuclease free water to gel slices and allow to dialyze at 4 °C overnight to remove salts from agarose.  Remove water from tubes and place in a 70 °C water bath until completely melted (about 5 min). Note: Flick tubes each minute to ensure agarose melts completely.  Once melted, move tubes to 37 °C water bath.  Prepare ligase mixture in a separate 1.7 ml tube while agarose cools (Table 1). Table 1. Ligation reaction components  table:",
    "﻿0,1\nComponent,Amount\nLigase buffer,5 μl\nT4 DNA ligase,1 μl (400 units)\nTarget plasmid backbone,100 ng as estimated from gel\nTelomere,To 50 μl",
    "After cooling about 5 min, add target plasmid and telomere to ligation  mixture.  Note: Work quickly so agarose does not solidify in pipette tip. Mix by gentle pipetting and allow to return to room temperature.  Note: The reaction should solidify as it cools.  Incubate at room temperature overnight.  Dialyze reaction by adding 1 ml of water to tube and incubate at room  temperature for 15 min. Note: Flick tube until agarose is freely floating in water.  Begin to thaw Stbl4 cells on ice.Note: 40 μl of cells are needed per reaction.Completely remove water from dialysis and add 50 μl of fresh nuclease free  water. Place tube in a 70 °C water bath for 10 min, or until completely melted.  Note: Gently flick tube every minute to ensure gel is completely  melted.  Add 2 μl of ligation reaction to 40 μl of Stbl4 cells and electroporate following  manufacturers recommended settings for the electroporator. Resuspend electroporated cells in 500 ml of S.O.C media and shake in 15 ml culture tubes for 1.5 h at 250 rpm at 30 °C.  Plate 100 μl of the transformation preparation onto pre-warmed LB plates containing the appropriate antibiotic and incubate at 30 °C until colonies appear.  Note: Due to the lower temperature, colonies may take 2 days to  appear on plates.  Screen for positive colonies with either colony PCR or colony hybridization.  Note: Screening for positive colonies:   Due to the repetitive nature of the telomere, it is not advisable to screen colonies by amplifying across the telomere insertion site, as most PCR reactions will fail.",
    "Instead, colony PCR can be carried out using a forward primer that anneals 5’ to the insertion site in the target plasmid, and a reverse primer that anneals to a site 5’ to the telomere repeat in pWY82 that is also inserted into the target plasmid as shown in Figure 3 below. It is important to ensure good primer function in each plasmid before attempting colony PCR. The primer pWY82R with the sequence 5’ GTGGGACCCGAGGGAATC 3’ has been routinely used as the reverse primer in colony PCR. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917025032_7313.jpgFigure 3. Primers for colony PCR should be chosen that border the insertion point, and do not amplify the telomere repeat Alternatively, entire plates of colonies can be screened for the presence of telomere by colony hybridization (Sambrook et al., 1989). This method allows for rapid screening of hundreds of colonies at once, and is extremely sensitive. The oligonucleotide probe used for the hybridization consists of 10 units of the telomere repeat, either in the 5’ or 3’ direction. Finally, it is suggested to sequence into the telomere repeat to ensure that the insert is in the correct orientation. Detecting telomere insert size Once positive colonies have been obtained, it is important to screen colonies for telomere size. For most purposes, the colony with the largest telomere insert possible is desired for transformation. Telomere size estimation is best carried out through Southern transfer and hybridization (Southern, 1975). The target plasmid, as well as plasmid pWY82, is run alongside the tested colonies to serve as controls. Inoculate positive colonies, plus one culture of pWY82 and one culture of original target plasmid, into 3 ml of 2XYT media containing the appropriate antibiotics. Shake culture at 250 rpm at 30 °C for 8 h.",
    "Inoculate a fresh 5 ml 2XYT culture with 100 μl of starter culture of each colony containing the appropriate antibiotics and shake at 250 rpm for 16-18 h at 30 °C.   Note: It is sometimes useful to inoculate and grow larger (25 ml) cultures of colonies that have been chosen. An aliquot can be used for screening, and when a clone has been identified with the desired telomere fragment, the remaining culture can then be used for a larger scale plasmid preparation.  Using 4 ml of each culture, extract plasmid DNA with the QIAprep Spin Miniprep Kit. Elute plasmid extraction into 40 μl of warm (55 °C) nuclease free water.  Perform a restriction digest on 1 μg of each plasmid in a 20 μl total volume using enzymes that will cut as close to the telomere insert as possible on both ends so the telomere insert is excised. Additionally, cut pWY82 with enzymes that will also excise telomere insert for reference.  Pour a standard 1% (w/v) 1x TAE agarose gel using combs large enough to fit the entire restriction digest.  Once the restriction digest is complete, add 5 μl 6x loading dye to each reaction.  Load each digest into the agarose gel and run at 100 V until the lower band has reached the bottom of the gel.  Carefully transfer the gel to a dish containing 1x TAE and 0.5 μg/ml ethidium bromide and stain for 30 min.  Visualize DNA with UV light. Note: Due to the secondary structure of telomere, estimation of telomere size from a restriction digest will be unreliable.  Transfer the DNA to a nitrocellulose membrane by Southern transfer (Green and Sambrook, 2012).  Hybridize the membrane with a radiolabeled oligonucleotide and compare to the size standard to estimate telomere size (Green and Sambrook, 2012).",
    "Note: An oligonucleotide of sequence (TTTAGGG)10 is extremely sensitive for detecting the presence of telomere.   Telomere PCR protocol to generate telomere fragments Telomere fragments of varying sizes can be generated using PCR for use in the co-bombardment method of minichromosome production. With the primers noted below, and running the reaction as shown, will generate a variety of telomere conglomerates of differing sizes can be produced by cross annealing of the primers. These telomere lengths can be visualized by gel electrophoresis. Telomere DNA of a particular length can be obtained by cutting out the size of telomere desired from the agarose gel. These steps below will outline how to generate telomere fragments via PCR and how to utilize the DNA obtained. This protocol is adapted from a similar protocol used to make fluorescent probes that label telomere (IJdo et al., 1991). Develop PCR primersUse the sequences below for primer development. These will allow for the production of large telomere fragments. Telomere primer sense: 5’ (TTTAGGG)10 3’.Telomere primer antisense: 5’ (CCCTAAA)10 3’Primers can be diluted to the micromolar concentrations listed on the table below which result in differing telomere fragment sizes.table:",
    "﻿0,1\n1.25 micromoles of Forward Telomere Primer 1.25 micromoles of Reverse Telomere Primer,Produces Larger Fragments (see Figure 4)\n25 micromoles of Forward Telomere Primer 25 micromoles of Reverse Telomere Primer,Produces Shorter Fragments (see Figure 4)\nPCR reaction assembly Use a proofreading Taq polymerase, such as LongAmp Taq DNA Polymerase from New England Biolabs, and use the above concentration of primers. At least four reactions are recommended in order to obtain enough DNA for use after DNA gel extraction. PCR reaction assembly is as follows:PCR Reaction Assembly using LongAmp Taq Polymerase from NEB table:\n﻿0,1,2\nNuclease Free Water,12 microliters,24 microliters\n5x LongAmp Taq Buffer,4 microliters,8 microliters\nSense Telomere Primer,0.5 microliters,1 microliter\nAntisense Telomere Primer,0.5 microliters,1 microliter\n10mM dNTPs,2 microliters,4 microliters\nLongAmp Taq Polymerase,1 microliters,2 microliters\n,20 microliters per reaction,40 microliters per reaction\nThermocycler protocoltable:\n﻿0,1\n98 °C 10 sec 55 °C 20 sec 72 °C 5 sec,Repeat 5x\n98 °C 20 sec 55 °C 20 sec 72 °C 5 sec,Repeat 5x\n98 °C 20 sec 55 °C 20 sec 72 °C 10 sec,Repeat 5x\n98 °C 20 sec 62 °C 20 sec 72 °C 30 sec,Repeat 5x\n72 °C 5 min,\n4 °C ∞,",
    "Note: It is recommended that either large volume PCR reactions are used or several PCR reactions are prepared to increase the amount of telomere DNA available for use.Use gel electrophoresis to determine the size of fragments generated (Figure 4). Notes: The smears of stained DNA on the gel image in Figure 4 are telomere fragments of varying size. Figure 4 is the result of 40 microliter PCR reactions. Cutting out the smear associated with the desired size indicated by the ladder provides telomere fragments of that length. The smears of telomere fragments in Figure 4 vary in size based on the Taq polymerase used as well as the primer concentration. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917025109_4382.jpgFigure 4. Example of Telomere PCR product imaged after gel electrophoresis: L indicates the 1kb ladder used for this experiment. 1.25 micromoles and 25 micromoles indicate the concentration of PCR primer present in each sample. Follow the gel electrophoresis protocol (Sambrook and Russell, 2001).Gel extraction of telomere DNA Excise the piece of gel corresponding to the size of telomere desired, and extract the telomere DNA from this gel piece. For example, if a 2 kb telomere fragment is desired, cut out the gel smear closest in relation to the 2 kb mark on the ladder. Generally, larger fragments of telomere are desired if the goal is truncation of chromosomes because the larger the telomere fragment, the better chance that an insertion of the telomere fragment will be recognized by the telomere capping machinery as the new end for the chromosome. The minimum size of telomere fragment required for this recognition may vary from species to species (Teo et al., 2011). Use the Wizard SV Gel and PCR Clean-Up System for extracting DNA from agarose gels. Follow the manufacturer’s instructions for extracting DNA from the agarose gel piece.",
    "Notes: A significant amount of DNA will be lost when performing gel extraction. It is recommended to use a large volume PCR reaction or multiple reactions. It is recommended that elutions are performed using nuclease-free water, such as Nuclease-Free Water from Life Technologies, to allow for further use in cloning if desired. Using the extracted DNATelomere DNA fragments obtained can then be used in a cobombardment with a transgene.Preparation of telomere DNA as described in (Kikkert et al., 2005) can be used in a co-bombardment.Discussion Conceptually, minichromosomes can be created by either a bottom-up or a top-down strategy. A bottom-up strategy would require the artificial creation of centromere, telomere, and origin of replication sequences to create a viable chromosome. Currently, origins of replication and centromeres cannot be made artificially in most eukaryotes. The top-down approach utilizes an existing chromosome to create a minichromosome by truncating it with a telomere-containing construct. Telomere-mediated truncation is an effective means of creating top-down minichromosomes. The essential factor for telomere-mediated truncation, the telomere sequences, can be difficult to manipulate because of their constitution as a large array of repeats. The methods for creating and utilizing telomere DNA described here are the most effective. After cloning telomere into a vector, or preparing telomere for cobombardment, proceed normally with transformation protocols. Tissue regeneration is the same as for standard transformation. Selection for truncation events can be performed using cytological techniques, such as fluorescent in situ hybridization (Yu et al., 2007). These methodologies should allow for the creation of telomere DNA of desired size, inclusion into a vector if so desired, introduced into the species of choice, and selection for truncated chromosomes."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}