{
  "id": 4050,
  "origin_website": "Cell",
  "title": "Protocol for using TRIBE to study RNA-protein interactions and nuclear organization in mammalian cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell culture and transfection\nTiming: 1 day\nADAR fusion plasmids are introduced into cells by transient transfection.\nNote: The following steps were optimized for adherent mouse embryonic fibroblasts and human osteosarcoma cells but may need to be adjusted depending on cell type. We recommend transient transfection of 0.5–1 million cells and FACS sorting of 10k GFP+ DAPI– cells so that adequate amount of RNA (>100ng) can be acquired per sample before moving onto library preparation.\nFor each sample, prepare 10 cm dishes: 3×10 cm dishes for mCherry-ADAR control, 3× 10 cm dishes for RBP-ADAR fusions, and one dish of un-transfected or mock transfected cells as a negative control. This final dish is useful for FACS gating and for downstream analysis of SNPs present in the parental cell line.\nNote: RNA isolation is performed in triplicate for each sample, this serves as a backup in case one sample has low RNA integrity or if there is a failure during library preparation. While the extra sample can be omitted, we have found it to be helpful for those attempting the protocol for the first time.\nNote: All dishes should be passed in the same manner and for equal number of passages relative to one another, this will help minimize the dish-to-dish variability. This consistency allows for RNA editing and gene expression comparisons to confidently be made between dishes (and eventually RNA sequencing libraries).\nCulture the cells of interest using standard sterile tissue culture protocols, refer to American Type Culture Collection (ATCC) standards if needed. For our TRIBE experiments, mammalian cells are cultured and maintained in a humidified 37°C incubator with 5% CO2.",
    "Mouse embryonic fibroblasts (MEFs) and human osteosarcoma (U2OS) cells are cultured in DMEM 4.5 g glucose, glutamine, supplemented with 1% penicillin streptomycin (P/S) and 10% heat-inactivated fetal bovine serum.\nOnce cell lines have been thawed, it is advisable to passage the cells at least two times before using for experiments. Cell passages should be tracked and cells with minimal passage number should be used.\nFor each RBP of interest, transfect the appropriate number of cells (see above Notes). For adherent MEFs or U2Os cells we use triplicate 10 cm dishes (70–80% confluence gives best results). Follow best practices for transfection reagent of choice and refer to troubleshooting[href=https://www.wicell.org#troubleshooting] section, problem 1[href=https://www.wicell.org#sec7.1] if issues occur.\nOptional: Before beginning next step, check transfection efficiency of each dish using GFP fluorescence. Additionally, for mCherry ADAR control plasmids, check RFP fluorescence. The ADAR p2A GFP design helps check that the reading frame of the RBP upstream of ADAR is correct.\nOptional: If transfection efficiency is high (> 75%) it is possible to omit the following FACS sorting step and proceed directly to RNA isolation (Eg. HEK cell transfection). If the cells are not uniformly transfected, the WT unedited RNA will dampen the RNA editing levels below the threshold of detection.\nNote: Prolonged expression of RNA editing constructs can lead to increasing levels of cellular death. Therefore, transfection should be performed the day before RNA isolation and cells should be sorted within 24 h of transfection as editing reaches steady state within that period (Biswas et al., 2020[href=https://www.wicell.org#bib2]).\nAlternatives: The following transfection reagents have been tested to be effective:\nHEK293T cells (70–90% transfection efficiency) – Calcium Phosphate, Lipofectamine 2000, Lipofectamine 3000, JetPrime (Polyplus), JetOptimus (Polyplus)\nSV40 Mouse embryonic fibroblasts (5–10% transfection efficiency), Human U2OS (25–50% transfection efficiency) – JetPrime (Polyplus), JetOptimus (Polyplus)\nFACS sorting",
    "Timing: 4 h\nFor cell lines with lower transfection efficiency, FACS sorting allows isolation of live cells (DAPI negative) transfected with ADAR (GFP positive). Sorting is performed directly into TriZol or equivalent RNA isolation buffer.\nNote: The following steps were optimized for adherent mouse embryonic fibroblasts (MEFs) and human osteosarcoma cells (U2OS) but may need to be adjusted depending on cell type. We recommend FACS sorting of ∼10k GFP+ DAPI– cells so that >100ng of RNA can be acquired per sample.\nCritical: TriZol can cause serious chemical burns and is toxic upon inhalation, appropriate precautions should be taken, and reagent should be handled within chemical hood or class II biosafety cabinet.\nBefore removing cells (U2OS, MEFs) from incubator, prepare materials.\nPlace FACS buffer inside tissue culture hood.\nPre-warm tissue culture materials to 37°C (tissue culture media, DPBS, trypsin).\nPre-label 15 mL Falcon tubes, one corresponding to each FACS sample.\nPrepare sterile 1.5 mL Eppendorf tubes corresponding to the same number of FACS samples, place 500μL of TriZol in each tube, keep tubes on ice until ready to use.\nFor each 10 cm dish, place one sterile 15 mL Falcon tube in the tissue culture hood.\nDissociate cultured cells from their 10 cm plates.\nWash each plate twice with 7 mL pre-warmed DPBS.\nUse 1 mL pre-warmed trypsin to dissociate cells.\nPlace cells in incubator to complete dissociation, use gentle tapping of the dish to promote detachment.\nRe-suspend the dissociated cells in complete media (with FBS) to neutralize trypsin activity and place each sample into pre-labeled a 15 mL conical Falcon tube.\nPreparation of FACS samples: prepare three samples for each RBP-ADAR sample, three samples for the mCherry-ADAR control and one sample of un-transfected cells as a negative control (Figure 1[href=https://www.wicell.org#fig1]).",
    "Spin the re-suspended cells gently for 5 min at 500 g.\nRemove the supernatant from the pelleted cells being careful not to disturb the cell pellets.\nRe-suspend the cell pellets in 200–500μL of FACS buffer.\nPass the re-suspended cells through a mesh strainer to promote dissociation.\nNote: The density of cells and size of the cell pellet is dependent on cell type. It may be necessary to optimize the amount of FACS buffer to re-suspend in so that sorting can be expedited efficiently.\nPause Point: Cells can remain on ice for one hour prior to sorting. However, prolonged incubation on ice may cause increased death, decreasing RNA yield and quality.\nKeep FACS samples on ice and proceed immediately to FACS sorting, aim for 10,000 cells per sample with 1,000 cells as a minimum requirement.\nGate the cells using the negative sample to isolate un-transfected cells (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Fig2.jpg\nFigure 2. Representative FACS plots\nPlots show stepwise selection of DAPI negative, GFP positive cell population for downstream RNA isolation and library preparation. Top plots show gate definition; it is important to identify gates that will prevent un-transfected cells from being included in the final population. Associated population counts can also be used to estimate transfection efficiency.\nSelect single cells using forward scatter and side scatter ranges. Use cells that are DAPI negative (alive) and GFP positive (transfected).\nEnsure that the FACS solution is no more than 10% of total TriZol volume, start with at least 500uL of TriZol in each of the tubes and add more TriZol after sort if necessary.\nCap the tubes containing the samples in TriZol, mix well and store on ice until ready to proceed to RNA isolation.\nOptional: After sorting, TriZol containing cell lysates can be stored at −80 until ready to proceed with RNA isolation.",
    "RNA isolation and quality control\nTiming: 4 h\nHigh quality RNA is crucial to the process of library preparation. We routinely isolate RNA from TriZol, however other methods such as RNA minipreps, spin columns and direct lysis can be used to isolate total RNA. The protocol is also compatible with nascent RNA isolation (McMahon et al., 2016[href=https://www.wicell.org#bib16]).\nCritical: TriZol and chloroform can cause serious chemical burns, appropriate precautions should be taken, and reagent should be handed within chemical hood.\nRNA isolation using TRIZol is the preferred method when dealing with FACS sorted cells. If material is not limiting, RNA miniprep is an acceptable alternative.\nPerform RNA isolation according to manufacturer instructions.\nIsolated RNA should be placed into PCR tubes.\nPerform DNAse digestion of the RNA samples using Turbo DNA Free Kit (Ambion AM1907).\nAdd 0.1 volume of 10× DNAse buffer to the isolated RNA.\nAdd 1uL of DNAse to the RNA and mix gently.\nIncubate at 37°C (in thermocycler) for 30 min.\nWhile incubating – thaw out the DNAse inactivation resin.\nInactivate with 0.1 volumes of the inactivation resin (3.5uL resin for 30uL of RNA) and leave at RT for 2 min.\nSpin in PCR tubes for 30 s, careful not to disturb the resin.\nTransfer as much as possible to a fresh tube, use remainder for qubit (2uL into 500uL eppendorf tubes) and Bioanalyzer (3uL into PCR strip).\nNote: Measuring the concentration of RNA with a Nanodrop will overestimate the amount in the sample. It is highly recommended that more specific assays such as Qubit be utilized so that libraries can be prepared with equal amounts of RNA input.\nMeasure concentration of RNA using QuBit RNA high sensitivity assay according to manufacturer instructions.\nPerform RNA integrity analysis using RNA bio analyzer (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Fig3.jpg",
    "Figure 3. Examples of RNA integrity measured after RNA isolation\nHigh quality RNA is required (Left). RNA integrity is evaluated using ribosomal RNA peaks which constitute the majority of RNAs within the cell. Do not proceed with samples that have a low RIN score and are degraded (Right). X-axis, fragment size in nucleotides, y-axis, arbitrary fluorescence units (FU).\nAfter sending out samples for quality control (QuBit and Bioanalyzer) we are left with approximately 30uL of RNA. 100 ng of total RNA is ideal for library preparation, however as little as 10 ng can be used. Proceed using samples with RIN scores > 8 (Figure 3[href=https://www.wicell.org#fig3]).\nOptional: Tape station can also be used for RNA integrity analysis.\nPause Point: Once RNA samples have been purified, 2uL and 3uL aliquot can be made for qubit and Bioanalyzer, respectively. All aliquots can be stored at -80 until the next step.\nRNA sequencing library preparation\nTiming: 1–3 days\nCritical: Do not proceed with library preparation until sufficient, high quality RNA samples are available.\nNote: Library preparation times can vary widely depending on the number of samples and the individual pause points within the protocol.\nAlternatives: Stranded, paired end RNA seq library preparation kits are ideal and allow for accurate mapping of transcripts. When dealing with limiting input amounts, we have had satisfactory performance from kits that have a lower required input (such as the NEB ultra II directional RNA seq library prep kit which can use as little as 10ng of total RNA input).",
    "Either rRNA depletion or polyA selection can be used to purify total RNA before moving to library preparation. The decision to use rRNA depletion or poly-A selection should be guided by the model organism and biological question. Caveats of rRNA depletion include that the primers needed are often organism specific and finalized libraries may require increased sequencing depth to achieve an equivalent coverage.\nAlternative mRNA seq library preparation kits that have been used in the literature for TRIBE include the TruSeq stranded mRNA from Illumina and the KAPA Stranded mRNA-Seq Kit from Roche.\nDepending on the amount of RNA available, different library prep methods may be used. We have found that NEB provides robust kits and routinely use their Ultra II Directional RNA library prep kit. However, many other, equivalent kits are available.\nUsing the NEB Ultra 2 Kit with sample preparation beads – prepare stranded RNA seq samples according to manufacturer instructions. In addition to the kit, the following is required: NEB Index primers, polyA isolation module or rRNA depletion, a magnet appropriate for PCR tubes.\nIsolate mRNA with poly T-beads (or rRNA depletion).\nFragment the RNA.\nCritical: Fragmentation time is critical, be sure to follow manufacturer’s instructions for proper library size. If using PE 150bp reads, it is recommended that fragmentation aims for ∼300bp fragments. RNA fragment size can be checked using Bioanalyzer or Tape station.\nFirst and second strand synthesis (after this step the DNA is stable).\nPause Point: There are multiple pause points and the protocol can be split into two or three days. DNA can be stored after second strand synthesis, can also be stored after end prep and adapter ligation and finally is stable after library cleanup.\nEnd prep and adapter ligation, choose index primers for each sample.",
    "Note: NEB Index primers each contain a specific six nucleotide barcode sequence. Each index primer must be chosen as to not interfere with downstream de-multiplexing. If libraries are going to be sequenced in a single pool, each library within that pool must receive a unique index number for downstream demultiplexing of the sequence data. Library preparation kit manufacturers will sell index oligonucleotides in sets (of 12 or 24 indices).\nPCR amplification, double library cleanup to remove primer dimers.\nNote: We recommend using the minimal amount of PCR cycles necessary to minimize the amount of PCR duplicates that remain in the final library.\nCheck proper fragmentation and DNA library size using Bioanalyzer (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Fig4.jpg\nFigure 4. Proper cDNA library preparation\nDNA libraries should be correctly sized and absent of adapter dimer peaks X-axis, fragment size in nucleotides, y-axis, arbitrary fluorescence units (FU). See troubleshooting[href=https://www.wicell.org#troubleshooting], problem 2[href=https://www.wicell.org#sec7.3] for example of libraries requiring extra purification.\nOptional: Agilent TapeStation can also be used for DNA library size analysis.\nRNA sequencing and mapping\nTiming: 1 day\nThe major data generation step for any TRIBE experiment is RNA sequencing. We currently use Illumina next generation sequencers; in the future this approach may be extended to other platforms. For mammalian cells, it is important to achieve the requisite sequencing depth for high confidence SNP calling, we have found that individual lanes of a HiSeq4000 or NovaSeq equivalents running in PE150 mode provide sufficient depth (40Gb per library) at a reasonable cost for a single experiment, where a single experiment contains duplicate RBP samples, duplicate mCherry controls and an untransfected library. Please refer to Figure 5[href=https://www.wicell.org#fig5] for a summary of the downstream bioinformatic analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Fig5.jpg\nFigure 5. Overview of HyperTRIBE computational analysis",
    "Flow chart showing steps of data analysis and script paths that need to be changed throughout the protocol. Shell scripts are designated “.sh” and highlighted in bold.\nNote: The total number of bases output is important for TRIBE (with an ideal of 40Gb per mammalian library. Longer, paired-end reads and higher depth are both useful in performing mapping and SNP calling respectively. We recommend using no shorter than 100bp paired end reads for sequencing and analysis. Long paired end libraries that are sequenced to an appropriate depth will facilitate accurate RNA editing identification.\nNote: Sequencing depth should be at least 50 million 150bp PE reads per sample when working with human and mouse samples. More reads will be necessary if using 100bp or shorter read lengths.\nOperate the sequencer according to manufacturer’s instructions.\nDemultiplex the sequencing reads using index primers that were added during library preparation as per manufacturer instructions.\nConcatenate data from different lanes together, if applicable.\ncat data1_read1.fq.gz data data1_read2.fq.gz\nOptional: Multiple mCherry-ADAR control samples should be concatenated together to make a single, high coverage background file. When concatenated, control editing sites found in either sample are used to call background RNA editing events.\nQuality control and mapping of sequenced reads using STAR:\nKnow the path to the following previously downloaded genome annotations (refer to before beginning section).\nPrepare the shell scripts (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Mmc1.zip]) using the previously defined paths (refer to install and compile software dependencies[href=https://www.wicell.org#sec1.2] section).\nStar_indices\nTRIMMOMATIC_JAR\nPICARD_JAR\nGENOME_FAI_FILE\nMove the modified trim_and_align_PE.sh file (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Mmc1.zip]) into the directory with your paired end RNA seq data.\nUse the trim_and_align script to perform quality control, adapter trimming and mapping of the paired-end data using STAR. For each piece of data:\nnohup trim_and_align_PE.sh data1_read1.fq.gz data1_read2.fq.gz &",
    "Repeat the above command for each sample. Note that this process may be limited by the amount of system memory, for human or mouse samples ensure that the machine has 32GB of RAM per sample that is to be run.\nPlease refer to troubleshooting, problem 3[href=https://www.wicell.org#sec7.5] for common issues running shell scripts.\nWhile the alignment is running, the output will be stored in the newly created “nohup.out” file, you can track the progress of the alignment using the following command:\ntail nohup.out\nThe following files will be created from a successful alignment:\nLog.out – log of alignment process.\nLog.final.out – contains important mapping quality metrics.\nSort.bam – when used with the .bam.bai file can be loaded into IGV to visualize coverage.\nSort.bam.bai\nSort.sam – used for downstream TRIBE analysis.\nLoading alignments into MySQL database:\nnohup /path_from_root/HyperTRIBE/CODE/load_table.sh sam_filename mysql_tablename expt_name replicate/timepoint &\nexample: nohup /home/jbiswas/RNA/HyperTRIBE/hg38/load_table_hg38.sh wtRNA.sort.sam testRNA rnalibs 2 &\nWait for nohup.out file to be updated, this may take several hours depending on the machine resources and sequencing depth. Refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec7.5] if running into issues with script permissions.\nDetermination of RNA editing sites from alignments\nNavigate to your working directory and copy over the script (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Mmc1.zip]) to call RNA editing sites.\ncd /directory_of_choice/\ncp /home/jbiswas/RNA/HyperTRIBE/hg38/rnaedit_wtRNA_RNA_hg38.sh .\nModify the heading of the copied script file (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Mmc1.zip]) to direct the script to the appropriate path to the CODE as well as the path to the genome annotation.\nHyperTRIBE_DIR=\"/home/jbiswas/RNA/HyperTRIBE/hg38\"\nAnnotationfile=\"/home/jbiswas/RNA/index/Homo_sapiens/UCSC/hg38/Annotation/Archives/archive-current/Genes/refFlat.txt\"\nModify the script (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Mmc1.zip]) to include your choice of table name, control sample (wtRNA), and different experimental samples or timepoints.\nwtRNAtablename=\"testRNA\"\nwtRNAexp=\"rnalibs\"\nwtRNAtp=\"2\"\nRNAtablename=\"testRNA\"\nRNAexp=\"rnalibs\"\ntimepoint=(3 4 5)",
    "Optional: Editing thresholds can be changed within the script. Recommended thresholds are 1% for the control sample, and 5% for each of the experimental samples. This provides stringent filtering of RNA editing sites.\nRun the modified script to generate files containing output from a single replicate (Expected Outcomes, Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_762_3.csv\nAfter running the process_editing_sites.sh script, an excel file containing the background subtracted intersection of replicates from both samples is generated:\nnohup./rnaedit_wtRNA_RNA.sh &\nTRIBE analysis – Postprocessing of data output\nTiming: 1 day\nOnce mapped, the mapped files can be used for other standard quantification such as differential gene expression analysis. This section of the protocol will discuss further processing of the mapped data to identify SNPs specific to RNA editing events in both control and experimental samples.\nCopy the process_editing_sites.sh file into your current working directory.\ncp /home/jbiswas/RNA/HyperTRIBE/process_editing_results.sh.\nModify the location of the HyperTRIBE files and the file prefix.\nHyperTRIBE_DIR=\"/home/jbiswas/RNA/HyperTRIBE/\nfile_prefix=”MCP_TRIBE”\nUse process_editing_results.sh script to find the intersection of both experimental replicates and remove the background sites (Expected Outcomes, Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_762_4.csv\nThree inputs are required for the script:\nBedgraph file containing WT editing sites with 1% editing or more.\nBedgraph file containing Replicate 1 editing sites with 5% editing or more.\nBedgraph file containing Replicate 2 editing sites with 5% editing or more.\nAlternatively, bedtools intersect can be used to perform these functions:\nintersect replicates\nremove control editing sites\nVisualize the editing sites by importing the editing bedgraph files into IGV (Figure 6[href=https://www.wicell.org#fig6]). It is often useful to simultaneously visualize coverage using the .bam and .bam.bai files generated after alignment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/762-Fig6.jpg\nFigure 6. RNA editing can be visualized with IGV and occurs both at and adjacent to the site of RNA binding",
    "Figure modified with permission from Biswas et al., iScience 2020. β-actin gene, focusing on the MBS array (x-axis) showing (from top to bottom). MS2 sites at genomic locus (ground truth): blue boxes represent the known location of the MS2 stem loops. MCP-TRIBE alignment with multimapping: reads are depicted in gray (scale bar for number of reads on right), editing sites are depicted as red bars. Uniquely mapped read alignment: mRNA coverage without multimapping depicted in blue (scale bar for number of reads on right). MCP-TRIBE sites both replicates uniquely mapped: editing events as indicated by dark blue bars where height corresponds to the average editing percentage across both replicates at that nucleotide (scale to right). Light blue shading indicates location of the stem loop nucleotides.\nPlease refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 4[href=https://www.wicell.org#sec7.7] for issues with editing site discovery.\nDetermine intersections of gene symbols with other datasets (such as Hi-C, CLIP or RIP).\nThe gene symbols output from the TRIBE pipeline can be compared to gene symbols from other datasets using free online tools (http://genevenn.sourceforge.net/[href=http://genevenn.sourceforge.net/]).\nDetermine relative positions of TRIBE sites to known binding motifs or published CLIP peaks.\nThe .bedgraph files from the TRIBE experiment can be intersected with bed files output from published CLIP datasets (https://www.encodeproject.org/[href=https://www.encodeproject.org/]) using bedtools function “intersect” https://bedtools.readthedocs.io/en/latest/content/tools/intersect.html[href=https://bedtools.readthedocs.io/en/latest/content/tools/intersect.html].\nDistances can be measured using the bedtools function “closest” (https://bedtools.readthedocs.io/en/latest/content/tools/closest.html[href=https://bedtools.readthedocs.io/en/latest/content/tools/closest.html])."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Bioinformatics",
    "Flow Cytometry",
    "Molecular Biology",
    "Gene Expression",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}