{
  "id": 17303,
  "origin_website": "Jove",
  "title": "The Transition to an Anterior-Based Muscle Sparing Approach Improves Early Postoperative Function but is Associated with a Learning Curve",
  "procedures": [
    "An institutional review board approved this retrospective study (IRB 00060819) of deidentified prospectively collected data.The protocol followed the guidelines approved by the human institutional review board of Adventist Health Lodi Memorial. A written informed consent was obtained from the patients before the procedure.\nNOTE: As a representative patient, the clinical course of a 78-year-old male with left hip pain is described. His symptoms included a 2 year history of left groin pain aggravated by activity, night pain not adequately relieved by anti-inflammatory medication, and limitations of daily activities. The Oxford Hip Score at his initial clinic visit was 22 points, and the Hip Disability and Osteoarthritis Outcome Score (HOOS Junior) was 53 points. X-rays revealed primary left hip osteoarthritis (Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63948/63948fig01.jpg\nFigure 1: AP radiograph of the pelvis focused low on the symphysis. The left hip demonstrates typical characteristics of end-stage osteoarthritis. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63948/63948fig01large.jpg]\n1. Diagnosis, assessment, and plan\nLeft hip osteoarthritis\n\tNOTE: Due to failed conservative treatment, the patient was offered left total hip replacement using the ABMS approach.\n\t\nUse the AP-Pelvis x-ray with the 2.5 cm radiographic calibration marker for preoperative planning (Figure 2).\nMeasure the distance from the trochanteric fossa to the planned femoral neck resection to restore equal leg length. Fit adequate component sizes to the bony contours to restore femoral offset.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63948/63948fig02.jpg",
    "Figure 2: Planning THA. The planning of left THA begins with calibrating the radiograph to the metal ball of 2.5 cm diameter. Next, the preoperative leg length difference is measured (0.7 mm in this example). The appropriately sized acetabular component (blue) is positioned to restore the center of rotation. The appropriately sized femoral component with the ideal femoral offset (green) is positioned within the proximal femur to correct for any leg length difference. The distance between the trochanteric fossa and the planned femoral neck resection is measured (5.9 mm in this example). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63948/63948fig02large.jpg]\n2. Surgical preparation\nStarting 5 days before surgery, ask the patient to perform daily skin cleansing using chlorhexidine washing solution. Before surgery, meet the patient in the preoperative holding area and mark the correct hip side with a skin marker.\nAfter the induction of general anesthesia with inhalation anesthetics and the confirmation of its success by the maintenance of stable vital signs, position the patient in a lateral decubitus position with the operated hip facing up. Perform sterile prepping and draping. Cover the exposed skin with iodine-impregnated adhesive.\nWrap a sterile elastic bandage around assistant 1's waist to create a belt. The belt serves to hold a sterile mayo-stand cover, which is attached to the belt with two non-penetrating clamps (= kangaroo bag). The kangaroo bag maintains a sterile environment when the leg is dropped behind the patient.\nPosition the surgeon in front of the patient and assistant 1 and assistant 2 behind the patient. Position assistant 1 more distal than assistant 2 to maneuver the leg during surgery.\nMark the incision:",
    "Palpate and mark the proximal border or greater trochanter (GT) and the anterior border of the proximal femur. Palpate the anterior border of the gluteus medius (GM) fascia, which is tighter than the fascia overlying the tensor fasciae latae muscle.\nStarting 2 cm distal to the GT, make a line along the anterior border of the proximal femur and then slightly turn anterior along the anterior border of the GM fascia, stopping 6 cm proximal to the GT. The incision length is 8 cm.\n3. Surgical procedure\nInstruct assistant 1 to abduct the hip. Incise the skin sharply with a #10-blade following the previously made skin mark. Cut down to the fascia with a knife and use a clean lap sponge to expose the fascia.\nThe fascia is pierced by a bundle of vessels (= perforating vessels). Identify these perforating vessels as they pierce through the fascia. These vessels locate the interval between the GM and tensor fasciae latae (TFL). Distally open the fascia parallel to the orientation of the fascial fibers, and curve anteriorly at the mid-portion of the incision, staying posterior to the perforating vessels.\nUse finger palpation at the greater trochanter to dissect the muscle plane between the TFL anteriorly and the gluteus muscles posteriorly. Run a finger along the GM toward the GT. Then, let the finger drop anteriorly into the space between the GM and TFL. Once the finger is in the space, palpate the femoral neck and posterior portion of the femoral neck by elevating the gluteus medius and minimus posteriorly.",
    "While assistant 1 is holding the hip abducted, place a curved Hohmann retractor (Nr. 17) over the posterior neck outside the capsule to retract the glutei muscles. Then, place a straight Hohmann retractor (Nr. 7) over the anterior neck outside the capsule under the TFL and the reflected head of the rectus femoris tendon.\nInstruct assistant 1 to slightly externally rotate the hip and make an H-shaped capsulotomy using electrocautery with the bar of the H longitudinally along the femoral neck. Ensure that the distal line of the H is far lateral connecting the tip of the GT and medially around the neck to release the capsule and clean out the trochanteric fossa and intertrochanteric ridge.\nUsing electrocautery, go through the entire capsule proximally toward the head and acetabular rim, which is felt as a step with an electrocautery tip. At the acetabular rim, turn the electrocautery 90° and release the capsule along the acetabular rim medially and laterally.\nReposition the retractors underneath the capsule with the assistant holding the leg in abduction. While assistant 1 increases the external rotation and extension, make a subcapital femoral neck cut oblique from proximal to distal to facilitate the lift of the distal femur once the cut is complete.\nHold the anterior retractor (Nr. 7 retractor) and, with a key elevator positioned at the osteotomy site, level the femoral neck into the surgical field while assistant 1 hyperextends the hip to \"dislodge\" the osteotomy. Instruct assistant 1 to place the leg in the kangaroo bag and externally rotate the hip so that the patella is pointing upward and the tibia is perpendicular to the floor.\nReposition the Nr. 17 retractor over the GT and clean up the trochanteric fossa from the soft tissue using electrocautery.",
    "Instruct assistant 1 to adduct the hip so that the femoral neck is elevated more out of the wound. Identify the femoral neck cut at the planned level distal to the trochanteric fossa. Ideally, use a template to mark out the neck cut using electrocautery. Then, perform a neck cut using an oscillating saw.\nCut the medial neck first and then proceed to the lateral neck, paying attention not to violate the GT. Remove the free bone piece of the femoral neck with an osteotome and grasper.\nRemove the Hohmann retractors, and instruct assistant 1 to place the leg out of the bag in a neutral position on the mayo stand to allow hip abduction and slight flexion.\nPlace Nr. 15 or Nr. 17 retractors over the posterior acetabulum. The Nr. 15 retractor is wider than the Nr. 17 retractor but with comparable shape and curvature. Then, place the Nr. 7 retractor over the anterior acetabulum. Push through the capsule with the spike.\nRemove the femoral head with the Hohmann retractor and grasper. Push on the inferior part of the head to dislodge it superiorly. Then, use a grasper to remove the head. Remove the labrum using a long knife, and incise the inferior capsule if it is in the hemisphere of the acetabulum.\nReam the acetabulum to an appropriate size, starting 1 mm smaller than the planned cup diameter. Then, insert the final acetabular component in 40° abduction and 10°-15° anteversion. Insert the final polyethylene liner by manually placing it within the acetabular component and then impacting the liner in the acetabular component to engage the locking mechanism.",
    "While assistant 1 places the leg in the kangaroo bag and externally rotates the hip to 90°, place a two-prong retractor under the postero-medial aspect of the femoral neck and the Nr. 17 retractor over the GT. Then, instruct assistant 1 to extend and adduct the hip.\nIf needed, perform release along the anterior portion of the GT to deliver the femur out of the wound. Then, open the proximal femur with a box cutter and canal finder.\nBroach to an appropriate size and length and place the final stem with templated offset.\nPerform a trial reduction with a trial head. To reduce the hip, instruct assistant 1 to apply slight traction and internally rotate the hip while the surgeon uses a head-pusher to guide the ball into the socket. Check the hip for anterior and posterior stability. Place the Nr. 17 retractor over the posterior acetabulum to visualize the hip. Perform a shuck test in longitudinal and lateral traction.\nTo dislocate the hip, place a bone hook around the neck, and instruct assistant 1 to apply traction and external rotation. Remove the trial head. Irrigate the cup, insert the final head, and reduce the hip.\nReplace the Nr. 17 retractor outside the capsule. Reapproximate the capsule with a nonabsorbable suture.\nRepair the gluteal fascia with a synthetic braided absorbable suture while the leg is in slight abduction and external rotation. Close the subcutaneous tissue with a 2-0 braided absorbable suture and skin with sterile skin staples.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}