{
  "id": 8952,
  "origin_website": "Jove",
  "title": "Spinal Cord Neurons Isolation and Culture from Neonatal Mice",
  "procedures": [
    "The care and treatment of animals in this procedure were conducted in accordance with the guidelines of the Institutional Animal Care and Use Committee at the University of Colorado.\n1. Preparing Solutions\nPrepare and store all solutions at appropriate temperatures, as shown in Table 1.\n2. Coating Wells and Slides\nNOTE: Neurons do not adhere well to plastic or glass surfaces.\nOne day prior to the isolation of the neurons, coat the wells of a sterile 24-well culture plate with 0.5 mL of Poly-D-Lysine (PDL; Table 2) and leave it in a laminar flow hood O/N.\n\tNOTE: The preferred method is to use 24-well plates and to coat only the center wells, as evaporation from the peripheral wells tends to be more accelerated and to lead to inconsistent results. Additionally, glass slides can be placed inside the wells prior to coating. The neurons will attach to the coated glass slides and can be removed later for further microscopic imaging.\nOn the day of isolation, remove the PDL from the wells. Wash with sterile water for a few minutes before removing any remaining water and allowing it to dry for 1 h (see below).\nAfter drying, coat the slides with laminin (Table 2).\n\tNOTE: Approximately 10 μL of laminin (10 µg/µL) is enough to coat each well of a sterile 24-well plate. This is mixed with 340 μL of medium (total volume: 350 μL) in order to cover the entire well. Let this sit for 2 h at RT in a culture hood and then aspirate prior to coating the cells.\n3. Harvesting Spinal Cords\nNOTE: All instruments should be autoclaved (135 °C and 30 psi for 4 x 7 min cycles) for sterility.",
    "Euthanize 1-3 day-old C57BL/6 mouse pups in a chamber with isoflurane. Wait 30 s after the cessation of movement and pinch the leg to confirm a lack of response.\nSeparate the head from the body using scissors, with pup in the prone position.\nStabilize the hind legs or tail and arms on the procedure table, with dorsal side facing the user.\nCut the skin off using curved iris scissors.\nCut the spinal cord from the lumbar region just above the hips and proceed to cut both sides of the thorax to separate it from the body.\n\tNOTE: This requires the careful dissection of the spinal cord from visceral organs to avoid inadvertent damage to other organs (Figure 1a).\nWash sequentially for 10 s in 3 x 10 cm Petri dishes containing 5 mL of 0.2 μm filter-sterilized Phosphate-Buffered Saline (PBS) to remove excess tissue.\nInsert a 22 G needle and syringe filled with 5 mL of filter-sterilized PBS into the caudal end of the spinal column and flush cranially, allowing the cord to exit into a fourth Petri dish (Figure 1b).\nCollect the spinal cord in a 15 mL tube with 5 mL of HABG (Table 1) on ice. Use care to avoid crushing the spinal cord.\nRepeat steps 3.1-3.8 for each pup in the litter.\n\tNOTE: Ideally, this process should take less than 30 min per spinal cord to ensure healthy neuron isolation.\n4. Isolating Neurons\nNOTE: The following step should be performed in a laminar flow hood. Familiarity with basic sterile technique is expected.\nTissue Mincing\nTake the tube containing the spinal cords and shake lightly to suspend the tissue.\nPour tissue from the tube into a 60 mm glass Petri dish and dice with a razor blade to create fine pieces ~0.5 mm in size.",
    "Transfer the tissue with a wide-bore pipette into a 15 mL tube containing 5 mL of HABG.\nPlace it in a 30 °C water bath for 30 min to allow the cells to equilibrate at this temperature. Keep the cells on a shaker just enough to allow them to be suspended in the fluid.\n\t\tNOTE: This step is done to avoid shocking the cells upon transfer from ice to the digestion medium. Keeping the cells at 30 °C helps to decrease cell death associated with an otherwise increased metabolism at 37 °C.\nPrepare the digestion medium (Table 1).\nPrepare the density gradient (Table 1).\nPrepare each of the 4 layers in 4 separate 15 mL tubes, as outlined in Table 1.\nAdd 1 mL from each layer into a new 15 mL tube. Start with layer 1 at the bottom and sequentially add until reaching layer 4 at the top. Avoid disturbing the layers while adding.\nWash the PDL-coated plates from step 2.2. Wash with sterile water for a few minutes before removing any remaining water and allowing them to dry for 1 h.\nTransfer the tissue to digestion medium.\nRemove the tissue-containing tube from the shaker water bath at 30 °C and allow it to settle for a few minutes.\nRemove the digestion medium tube from the 37 °C water bath and aspirate it into a leur-lock syringe.\nAspirate off the excess HABG from the tissue-containing tube.\nUse a leur-lock 0.2 μm filter on the syringe to add digestion medium to the tissue-containing tube.\nPlace the tube in a 30 °C water bath for 30 min. Keep the cells shaking just enough to allow them to be suspended in the fluid.",
    "NOTE: It is important not to keep the cells in the digestion medium for too long or to let the temperature get too high, which could lead to excessive digestion and result in the tissue becoming suspended in a gelatinous mixture.\nDuring this period, coat the laminin as in step 2.3.\nPerform trituration (i.e. separating the cells from the tissue).\nRemove the tube from the shaking 30 °C water bath and allow it to settle for a few min.\nAspirate excess digestion medium.\nSuspend the tissue in 2 mL of HABG.\nUsing a narrow-bore pipette, triturate 10x for 45 s.\n\t\tNOTE: This is probably the single most crucial step and can significantly decrease the yield if not done properly.\n\t\t\nAspirate the tissue into the pipette and immediately empty the contents back.\nAvoid introducing air, as it will significantly decrease the viable yield.\n\t\t\tNOTE: The ideal pipette is a 9\" glass pipette. The tip of the pipette should be fire polished to smooth out rough surfaces. It should then be siliconized by placement in a 1:20 solution of dichlorodimethylsilane (DMDCS) in chloroform and left O/N. The pipette should then be removed and allowed to air dry. Subsequently, it should be autoclaved for sterilization.\n\t\t\tCaution: DMDCS and chloroform are highly flammable, and siliconizing should be carried out in a fume hood.\nAspirate the top 2 mL of supernatant and place it into a new 15 mL tube labeled \"collection.\"\nRepeat steps 4.7.3-4.7.5 two additional times (the cell collection tube should have 6 mL by the end).\nSlowly transfer the collection tube contents into the gradient tube prepared in step 4.2, avoiding the disruption of the gradient.\nAt this point, remove the previously prepared neurobasal medium (Table 1) from the refrigerator and allow it to warm in a 37 °C bath.",
    "Purify the neurons.\nCentrifuge the gradient tube for 15 min at 800 x g and 22 °C.\nCollect the desired layer(s) with a pipette (Figure 2) and place in a new 15 mL tube. For the highest-purity neuron isolation (i.e. >90%), collect layer 3. For more yield with less purity (i.e. >70-80%), collect layers 2 & 3.\nDilute out the density gradient by adding 5 mL of HABG to the newly collected layers.\nCentrifuge at 200 x g for 2 min at 22 °C.\nDiscard the supernatant, re-suspend in 5 mL of HABG, and flick the pellet to suspend the cells.\nCentrifuge at for 2 min 200 x g at 22 °C.\nDiscard the supernatant, resuspend in 3 mL of neurobasal medium, and flick the pellet to resuspend the cells.\nCount the cells.\nTake 10 μL of the solution, now with cells in neurobasal medium, and mix with 10 μL of Trypan blue.\nPlace 10 μL of this mixture in a glass counting chamber.\nUsing a standard glass counting chamber, count the number of cells in each of the four 4 x 4 quadrants. Add all of the cells counted (n), multiply by 2 (dilution factor), divide by 4 (number of quadrants counted), multiply by 3 (volume of neurobasal medium), and multiply by 104 to obtain the concentration of cells in cells/mL.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55856/55856eq0.jpg\nSeed the cells on culture plates\nDilute the cell suspension to 300,000 cells in 1 mL of neurobasal medium.",
    "NOTE: Based on the concentration of cells obtained in the above steps, additional neurobasal medium is added to obtain a final concentration of 3*105 cells/mL. The equation is C1V1=C2V2, where C1 is the initial concentration of cells obtained from the harvest; V1 is 3 mL; and C2 is 3*105 cells/mL, as discussed above. The equation is solved for V2. Add the volume of neurobasal medium necessary to make the total volume of cells in solution equal to V2.\nShake gently to distribute the cells in solution and add 1 mL to each well in the coated 24-well plates.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}