{
  "id": 11761,
  "origin_website": "Jove",
  "title": "High-Content Screening Assay for the Identification of Antibody-Dependent Cellular Cytotoxicity Modifying Compounds",
  "procedures": [
    "NOTE: Key steps of the assay workflow are presented in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64485/64485fig02.jpg\nFigure 2: Workflow of the ADCC screen. JIMT-1-EGFP target cells seeded into 96 well HCS plates are treated with drugs of the compound library. In turn, unstained NK (effector) cells and trastuzumab are added, and the plate is imaged at 0 timepoint and after 3 h of incubation. ADCC evaluation is based on the change in the number of viable (surface adherent) target cells. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64485/64485fig02large.jpg]\n1. Coating of the HCS plate\nCoat the 96 well high-content screening (HSC) plates with 50 µL/well JIMT-1 medium (DMEM/F-12 medium supplemented with 20% fetal bovine serum (FBS), 0.3 U/mL insulin (100 IU/mL, Humulin R, and 1% penicillin-streptomycin).\nPlace the plate into a CO2 incubator for 1 h.\n\t​NOTE: Coating is crucial for attaching JIMT-1 cells to the glass surface of the plate.\n2. Seeding of JIMT-1 Enhanced Green Fluorescent Protein (EGFP) cells\nNOTE: EGFP-expressing JIMT-1 cells were generated in our previous work18, and the cells were cultured in T25 tissue culture flasks in JIMT-1 media (see composition in step 1.1).\nWash the cells with 2 mL of sterile PBS.\nAdd 1 mL of trypsin-EDTA to the flask and put the flask back into a CO2 incubator for 10 min.\nAfter the incubation, tap the flask to check if JIMT-1 cells are detached.\nStop the digestion with 2 mL of JIMT-1 media and collect the cell suspension into a 15 mL tube.\nCount the cells with 0.4% trypan blue (80 µL of the dye + 20 µL of the cell suspension) in a Bürker chamber and adjust the cell number to 133, 000 cells/mL.\nAspirate the coating medium from the 96 well plate (step 1.2).",
    "Pipette 75 µL of the cell suspension to each well of the HCS plates (see Table of Materials).\nAllow cells to attach during an overnight incubation at 37 °C in a CO2 incubator.\n3. Pre-treatment of JIMT-1 EGFP cells with the compound library\nAspirate the medium from the JIMT-1 cells and add 50 µL/well fresh JIMT-1 medium to the wells. Transfer the plate to the high-throughput screening laboratory.\n\tNOTE: Using a liquid handling robot makes the addition of compound libraries more efficient and reproducible.\nTransfer the test compounds from the compound library plate to the assay plate with a pin tool calibrated to a 25 nL volume. Perform this four times. Four rounds of transfer give a final volume of 100 nL (and a 20 µM final concentration).\nBetween each step, wash the pin tool, first with 50% DMSO and then with 70% ethanol.\nIncubate the plates for 1 h in a CO2 incubator at 37 °C.\n4. Starting the ADCC assay by adding the effector cells\nNOTE: CD16.176V.NK92 cells (hereafter referred to as NK92 cells) were cultured in α-MEM supplemented with 20% FBS, 1% MEM-NEAA, 1% Na-pyruvate, 1% glutamine, 1% penicillin-streptomycin and 100 IU/mL IL-2.\nCount NK92 cells with trypan blue (80 µL of the dye + 20 µL of the cell suspension). Adjust the cell number to 400,000 cells/mL.\nCentrifuge 4 mL of the cell suspension at 150 x g for 3 min at room temperature.\nPrepare the ADCC medium by adding 20 µg/mL anti-HER2 antibody (trastuzumab) to the JIMT-1 medium.\nResuspend the NK cell pellet in 5 mL ADCC medium.\nPipette 20,000 NK cells in 50 µL of ADCC medium to the target JIMT-1 cells. The final volume is 100 µL, and the final trastuzumab concentration is 10 µg/mL.",
    "Place the assay plate into the high-content analysis equipment with a built-in incubator set at 37 °C.\n5. Imaging\nNOTE: The plates should be imaged at two time points, first, immediately after the addition of the effector cells to the target cells and second, at 3 h after the addition of NK cells. For imaging, the high-content analyzer and its software or suitable alternatives can be used (see Table of materials).\nSelect Plate type (96-well cell carrier ultra) from the list of plates.\nSelect the Two peak autofocus if the assay is carried out in plates.\nUse 10x objective in non-confocal mode.\nSelect Binning 2 to double the signal to noise ratio.\nTake brightfield images at 650-760 nm and fluorescent images of the EGFP-transduced JIMT-1 cells at 488 nm (excitation) and 500-550 nm (emission) wavelengths.\nSelect the number of fields and the number of timepoints for the imaging.\n6. Image analysis\nNOTE: To analyze the ADCC efficiency, the viable JIMT-1 cells are counted. Target cells killed by ADCC detach from the surface and move away from the focal plane of the microscope. Therefore, the difference between the number of viable cells at the beginning and at the end of the ADCC reaction corresponds to target cells eliminated by ADCC. To show how to build up the evaluation sequence, a control ADCC well is shown in the video.\nUse the Find cells module to detect regions on the image that correspond to cells.\n\tNOTE: Each cell is detected as a region on the image with a higher fluorescence intensity than its surrounding.\nSelect cells using the built-in M algorithm with a minimum of 80 µm in diameter.\nSet Splitting sensitivity, which parcels out a large object into smaller objects, to 0.5.",
    "Set the Common threshold (the lowest level of pixel intensity) to 0.\nExclude the detection of background area with high EGFP fluorescence intensity in two steps.\n\t\nFirst, use the Calculate Intensity Properties function to determine the EGFP fluorescence intensity in the previously selected Cells region.\nSet the minimum and maximum intensity threshold using the Select population option.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}