{
  "id": 11886,
  "origin_website": "Jove",
  "title": "An Automated Microscopic Scoring Method for the γ-H2AX Foci Assay in Human Peripheral Blood Lymphocytes",
  "procedures": [
    "This study was approved by the Biomedical Research Ethics Committee of The University of Western Cape Ethics Committee - Code BM18/6/12.\n1. Preparation of Solutions48\nCell fixation solution (3% PFA in PBS)\n\t\nWear the appropriate personal protective equipment (PPE) and working in a fume hood, add 20 g of paraformaldehyde to 200 mL of distilled H2O. Heat the mixture to 60 °C to aid dissolution.\nOnce the PFA is dissolved, add 40 drops of 5 N NaOH carefully over 30 minutes and to cool to room temperature. Adjust to pH 7 using 1 M HCl and make up to a final volume of 250 mL with distilled H2O (aliquots can be stored at -20 °C for 1 year). Add 25 mL from this solution to 41.7 mL PBS to afford a 3% PFA solution.\n1% Bovine Serum Albumin (BSA) solution: Add 10 g of BSA to 1000 mL of PBS and mix until dissolved. Store at 4 °C until use (maximum 72 hours).\nTriton-X Solution in a concentration of 1:500: Add 1 µL of Triton-X to 500 µL of PBS, store at 4 °C until use (maximum 24 hours).\nAntibody Solutions\n\t\nPrimary antibody - Anti-γ-H2AX in concentration of 1:500: Add 1 µL of anti-γ-H2AX to 500 µL of 1% BSA solution, store at 4 °C until use (maximum 24 hours).\nSecondary antibody - DAM-TRITC in concentration of 1:1000: Add 1 µL of DAM-TRITC to 1000 µL of 1% BSA solution, store at 4 °C until use (maximum 24 hours).\nComplete Roswell Park Memorial Institute (cRPMI) Media\n\t\nAdd filtered Fetal Bovine Serum (FBS) and Penicillin-Streptomycin to RPMI 1640 media in a sterile bottle to give a final concentration of 10% FBS and 1% Penicillin-Streptomycin.\n2. Preparation of Samples",
    "NOTE: For this protocol, peripheral whole blood samples are collected by venipuncture in lithium-heparin collection tubes from healthy adult volunteers (with informed consent - BM18/6/12 Biomedical Research Ethics Committee of The University of Western Cape Ethics Committee). Before beginning, ensure that the blood and the density medium of 1.077 g/mL are acclimated to room temperature.\nIn a prepared biosafety cabinet, dilute the peripheral whole blood in a 1:1 volume with PBS and gently layer the diluted blood on an equal volume to two-volumes of medium with a density of 1.077 g/mL. It is important to gradually layer the blood on the density medium by holding the tube slanted at 45°, ensuring that the blood and density medium do not mix.\nCarefully transfer the suspension to a centrifuge and spin at 900 x g for 20 minutes. Thereafter, pipette the 'cloudy' layer only to a new sterile conical tube and fill the tube with PBS and centrifuge for 10 minutes at 1000 x g. Thereafter, aspirate the supernatant with a pipette, being cautious to not disturb the pellet, resuspend the PBMC pellet carefully in 1 mL PBS and fill the tube with PBS.\nRepeat the above washing step two more times to get to a total of three washes.\nCount the number of PBMCs using a hemocytometer, aware that each mL of peripheral blood from an adult donor will result in a rough average of 1 - 1.5 x 106 PBMCs49. After counting, dilute the PBMC pellet to a concentration of 8 x 105 lymphocytes in 1 mL of cRPMI. Then add approximately 2 x 106 PBMCs or 2.5 mL from the isolated PBMC solution into a sterile, conical tube for irradiations.\n3. Sample irradiations",
    "CAUTION: Handle the radiation unit according to Radiation Protection guidelines and wear a physical dosimeter at all times. Ensure that the irradiation system used is calibrated and set up such that the correct expected doses are achieved.\nIrradiate PBMCs at room temperature using a 60Co source. Calibrate (TRS-398 protocol) with a Farmer 117 chamber for which a chamber calibration factor obtained from the National Metrology Institute of South Africa (NMISA)50.\n\t\nFor this assay, place the conical tubes between a 5 mm acrylic sheet (used for beam entry build-up) and 50 mm backscatter material with the current 60Co source dose rate of 0.57 Gy/min for a 300 mm × 300 mm homogenous field size at 750 mm Source to Surface Distance.\nIrradiate the PBMCs with graded doses of 0.125, 0.500, 1.000, 1.500 and 2.000 Gy, and maintain the sham-irradiated control samples, in the control room, receiving only ambient radiation exposure.\nIncubate the irradiated samples for 1 hour at 37 °C in a humidified 5% CO2 incubator in order to reach the maximum number of γ-H2AX foci.\n\t​NOTE: Incubation time can be modified according to experimental design.\n4. Slide preparation\nNOTE: See Figure 1 for slide setup.\nPrepare 3 slides (technical repeats) using slides coated with a positively charged surface to improve adhesion per irradiation condition (or per conical tube). Place the slide into the clip holder, add the filter card on top of it, and finally the funnel. Secure the slide clips and place into the cytocentrifuge.\nAdd 250 µL of the cell suspension to the funnel (200,000 cells/slide) and spin for 30 x g for 5 minutes using a cytocentrifuge.",
    "After cytocentrifugation, remove the slide from the clip holder and using a hydrophobic pen, draw a circle around the spot with the cells in order to retain the immunofluorescent stain on the bound cells during the staining process.\n5. Fixation and immunofluorescence γ-H2AX staining\nNOTE: All solutions are carefully added directly onto the cell area which is marked by a hydrophobic circle. Staining solutions are dispensed slightly above the slide without allowing the pipette tip to disrupt the cells. Solutions are NOT added to the whole slide.\nFix the slides in freshly prepared 3% PFA for 20 minutes.\n\tNOTE: The slides can be stored in PBS containing 0.5% PFA at 4 °C for a maximum of 2 days before immunostaining is performed. Thereafter, wash slides in a Coplin jar with PBS for 5 minutes, then cover the cells with 100 µL of the cold Triton-X solution for 10 minutes to allow permeabilization.\nTip the Triton-X solution off on tissue paper and wash the slides three times in 1% BSA solution for 10 minutes. This is done to prevent unwanted background by blocking nonspecific antibody binding.\nIncubate slides at room temperature with 100 µL of the 1:500-diluted primary anti-γ-H2AX antibody for 1 hour in a humidifying chamber, easily accomplished by adding wet tissue paper at the base of a rectangular slide storage box.\n\t\nTip the antibody solution off on tissue paper and perform three washes with 1% BSA solution for 10 minutes in a Coplin jar to remove unbound primary antibody and to prevent non-specific binding of the secondary antibody.\nIncubate slides with 100 µL of the 1:1000-diluted secondary DAM-TRITC antibody solution for 1 hour in the humidifying chamber. Tip the antibody solution off on tissue paper and wash the slides in PBS for 10 minutes three times.",
    "Finally dry the slides outside the hydrophobic circle with soft, dust-free tissue paper and add 1-2 drops of DAPI resolved in an aqueous mounting medium and gently cover the slide with a 24 x 50 mm cover slip, ensuring that there are no trapped air bubbles and place in the fridge at 4 °C overnight. Slides can be stored at 4 °C for a maximum of 2 weeks before scanning.\n6. Automated Scanning and Scoring of slides\nNOTE: The scanning system needs to have a fluorescent microscope, a high-resolution CCD (charged coupled device) camera connected to a frame grabber for real-time digitization of video images, a scanning stage, trackball for manual movements, 3D mouse, fast PC and monitor, and hard drive for archiving (Figure 2).\nClassifier setup\n\tNOTE: The classifier is a set of parameters defining how the system detects cells. It results from the training based on pre-classified image fields. A classifier is specific for a microscope magnification, cell type, and laboratory. Classifiers may therefore require modifications in the following parameters to adapt them to the current conditions. It is recommended to test the settings with a reference slide before evaluation.\n\t\nImage acquisition: Use a 40x dry objective for imaging. To achieve comparable image quality in all cells, set the camera integration time to automatic mode. Set the maximum integration time to at least 1 second for both color channels (camera gain 4.0). The signal channel is acquired with 10 focus planes and 14/40 µm between the planes.\nCell selection: PBMCs within a range of 20.00 µm2 and 76.00 µm2 are detected. Set the maximum concavity depth to 0.05 and the maximum aspect ratio to 1.4. Set the relative gray level threshold to 20%.",
    "Cell processing: Process the DAPI counterstain channel with a histogram maximum algorithm to reduce the background. The signal channel is processed with a TopHat filter (strength 7, smoothing factor 0) to reduce the background and to enhance the signals.\nSignal counting: Count foci using the Object Count feature of the device. To avoid false-positive evaluation of remaining background signals, only those signals which show at least 30% of the intensity when compared to the brightest object in the cell are counted.\nInsert/Place slides onto the automated scanning platform or slide stage, after gently cleaned with 70% ethanol, to remove any dust.\nSlide Setup - Open Slide Setup Dialogue Menu (Figure 3)\n\t\nSelect the correct Data Path, this specifies where the slide files resulting from the search are stored.\nGive the slide a name, each slide must be given a unique name. If a series of slides are entered in the form of an enumerated list, the '?' can be used as a wildcard for the slide number.\nSelect the appropriate classifier, as described in section 1.1 - 1.4 (Figure 4).\nSelect the Search Window and select Predefined if a search window definition matching the cytocentrifuge cell circle exists, select the respective definition in the Size column, or select Manual if there is no predefined search window definition available. In this case, the Size column does not have to be set.\nSelect Maximum Cell Count and add the maximum number of cells required to be scanned. The search is terminated even if the selected search window has not yet been scanned completely as soon as the Max Cell Count is reached. For biodosimetry applications, automated scoring of 1000 cells per slide is sufficient, considering that 3 slides per blood sample are prepared. Click OK to confirm the settings.\nSlide Scanning Setup",
    "Click the Search button on the side bar. If the setting Manual Search Window was selected in slide setup, a dialogue will open allowing for determination of the scan area (Figure 5). By using the 10x objective, select the rectangular search area on the slide interactively by fixing two corners of the search field by left click of the mouse. This can be confirmed with the OK button. If the search window is referring to a predefined search window, this step will be omitted.\nThe user is prompted to adjust a focus start position. A reference object will then be selected automatically, the software will prompt the user to focus and center a reference nucleus (using the 40x objective) for each slide and to confirm settings with OK. The system will automatically move to all slides sequentially. If necessary, adjust Live Image Setup - Integration Time for this step (Figure 5).\nCheck all microscope settings and confirm the system prompt with OK. The system will start the automated focusing and scanning procedure. Once scanning is completed the data is saved to the computer for analyses. The scanning system automatically switches off after the scan is complete.\n\t\tNOTE: Make sure that the lever of the microscope tube is in a position that diverts all light to the camera.\nSearch End, the search is terminated if the whole search has been scanned, if the maximum cell count has been reached or if the search has been canceled.\nSlide Analysis\n\tNOTE: The completed scan is represented in Figure 6.",
    "When the scan is completed, click the Gallery button on the side bar. Review the gallery, which consists of small images of detected cells. In this window (Figure 7), specify if the cells stored in the gallery by a criterion to be chosen from a drop-down menu. Cells are generally displayed in the order in which they have been detected.\nClick on Quality Histogram/Feature Value Diagram (Figure 8) to give the distribution of the quality measure for the detected cells, as well as the means, and the standard deviation of foci scored."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}