{
  "id": 15253,
  "origin_website": "Jove",
  "title": "Single Molecule Fluorescence In Situ Hybridization (smFISH) Analysis in Budding Yeast Vegetative Growth and Meiosis",
  "procedures": [
    "NOTE: All the buffers and the media used in this protocol are listed in Table 1. The vendor information for the reagents is listed in the Table of Materials.\nDay 1/Day 1-2:\nNOTE: For vegetative culture, grow cells to an OD600 of 0.4 to 0.6 in a preferred medium. For meiotic culture, induce cells to undergo meiosis using a preferred method (typically culturing in an OD600 of 1.85).\n1. Sample Fixation and Digestion\nFix a total of ~3.5 OD600 of cells in 3% formaldehyde.\n\t\nFor vegetative culture, add 5.52 mL of culture to 480 µL of 37% formaldehyde in 15-mL conical tubes.\nFor meiotic culture, add 1840 µL of culture to 160 µL of 37% formaldehyde in 2-mL microcentrifuge tubes. Invert ~5 times to mix.\n\t\tCAUTION: Formaldehyde is toxic. Handle and dispose according to institutional regulations.\nPlace tubes on a roller drum at room temperature for 20 min. For meiotic samples, after fixing at room temperature for 20 min, continue fixing overnight at 4 ˚C, rotating.\n\tNOTE: The overnight fixation increases the reproducibility and quality of the smFISH data obtained for meiotic samples. Fixation time should be optimized.\nWhile the samples are fixing, thaw 200 mM Vanadyl Ribonucleoside Complexes (VRC) at 65 ˚C for at least 10 min.\nPrepare digestion master mix in a 15-mL tube: for 1 sample, mix 425 µL of Buffer B with 40 µL of 200 mM VRC (warmed to 65 ˚C); for 5 samples, mix 2125 µL of Buffer B with 200 µL of 200 mM VRC (warmed to 65 ˚C). Vortex ~5 s to fully resuspend the VRC before adding to the master mix, which will appear light brownish green after VRC addition.",
    "NOTE: Addition of VRC during digestion improves the consistency of smFISH results, potentially by inhibiting the nuclease contaminant introduced by the zymolyase mixture, which is purified from crude extract. The amount of VRC required at this step should be optimized.\nFor vegetative samples, centrifuge the tubes at ~1057 x g for 3 min. For meiotic samples (after overnight fixation), centrifuge at 21,000 x g for 1.5 min. Decant or aspirate the supernatant to formaldehyde waste.\n\tNOTE: All the centrifugation steps are performed at room temperature.\nResuspend cells in 1.5 mL of cold Buffer B by pipetting up and down or by inverting the tubes and flicking to mix. Transfer vegetative samples to 2-mL tubes after resuspension.\nCentrifuge at 21,000 x g for 1.5 min. Remove the bulk of the liquid by vacuum aspiration or by pipetting, leaving behind ~100 µL.\nResuspend the cells in 1.5 mL of cold Buffer B.\nCentrifuge at 21,000 x g for 1.5 min. Remove the bulk of the liquid by vacuum aspiration or by pipetting, leaving behind ~100 µL.\nResuspend cells in 1.5 mL of cold Buffer B. Centrifuge at 21,000 x g for 1.5 min. Aspirate the liquid completely by vacuum or by pipetting.\nResuspend cells in 425 µL of digestion master mix, and briefly vortex to resuspend. Add 5 µL of 100T 10 mg/mL zymolyase to each tube.\n\tNOTE: Vortex the zymolyase every time before adding to the tubes. Add zymolyase to each tube individually, instead of adding to the master mix. Both steps help maintain digestion consistency among tubes because zymolyase precipitates quickly.",
    "Vortex 2-3 s to mix. Place the tubes on a roller drum, and digest at 30 ˚C for 15-30 min. For vegetative cells and early meiotic stages, it usually takes ~15 min, and for meiotic prophase and meiotic divisions, it usually takes ~30 min.\n\tNOTE: Check on the microscope every 5 min after 15 min, and stop the digestion when ~80% of cells appear non-transparent and non-refractive. From this point on, cells are very fragile. Handle cells gently and avoid using vacuum aspiration or vortexing.\nCentrifuge the tubes at ~376 x g for 3 min. Remove the liquid completely by pipetting.\nGently resuspend cells with 1 mL of Buffer B by pipetting up and down 1-2 times to mix.\nCentrifuge the tubes at ~376 x g for 3 min. Remove Buffer B liquid by pipetting. Gently resuspend cells in 1 mL of 70% ethanol (diluted with RNase-free water).\nIncubate at room temperature for 3.5-4 hours.\n2. Hybridization\nBring formamide to room temperature (for 50-mL aliquot, it takes ~30 min in water bath).\n\tNOTE: Do not open the formamide bottle until the bottle reaches room temperature to avoid oxidation of formamide.\n\tCAUTION: Formamide is toxic. Handle and dispose according to institutional regulations.\nPrepare 10% formamide wash buffer in a 15-mL conical tube.\nCentrifuge the tubes at ~376 x g for 3 min. Remove 500 µL of 70% ethanol by pipetting. Gently pipet up and down to resuspend the remaining cells, and then transfer the cells to low-adhesion tubes.\n\tNOTE: Using low-adhesion tubes greatly reduces cell loss during subsequent washes.\nCentrifuge the tubes again at ~376 x g for 3 min. Remove all the ethanol by pipetting.\nAdd 1 mL of 10% formamide wash buffer, and gently pipet up and down 2-3 times to resuspend the cells.",
    "Allow the cells to sit at room temperature for ~20 min while preparing the Hybridization Solution. For 1 sample, mix 50 µL of Hybridization Buffer (room temp.), 5 µL of 200 mM VRC (warmed to 65 ˚C), and 1 µL of each probe (200 nM final). For 5 samples, mix 250 µL of Hybridization Buffer (room temp.), 25 µL of 200 mM VRC (warmed to 65 ˚C), and 5 µL of each probe (200 nM final).\n\t\nThaw Hybridization Buffer (frozen at -20 ˚C) to room temperature before opening the tube to prevent formamide oxidation.\nAfter adding the 200 mM VRC, vortex for 5-10 s before adding the probes, which are designed and purchased commercially, and reconstituted according to the manufacturer's instructions.\nIf two probes are co-incubated, add 1 µL of the 1:10 dilution of the probe #1 stock, as well as 1 µL of the 1:10 dilution of the probe #2 stock, to make a final dilution of ~1:500 for either probe. The concentration needed for the best signal-to-noise ratio needs to be optimized (See Discussion for details).\nCentrifuge the samples at ~376 x g for 3 min. Remove the supernatant into hazardous waste by pipetting.\nAdd at least 50 µL of Hybridization Solution to each tube. Flick the tubes to mix.\nIncubate at 30 ˚C on a roller drum for at least 16 hours in the dark.\nDay 2/Day 3\n3. Washing and imaging\nBring formamide to room temperature.\nPrepare 10% formamide wash buffer (FWB) in a 15-mL conical tube.\nRemove the tubes from the roller drum and place them into a foil-covered box to protect from light. \nCentrifuge the samples at ~376 x g for 3 min. Remove the supernatant into hazardous waste by pipetting.",
    "Resuspend in 1 mL of 10% FWB by gently pipetting up and down 2-3 times.\nIncubate at 30 ˚C for 30 min (not rotating) in the foil-covered box.\nCentrifuge the samples at ~376 x g for 3 min. Remove the supernatant to hazardous waste by pipetting, and leave ~50 µL.\nMeanwhile, prepare DAPI/FWB in a 15-mL conical tube: For 1 sample, mix 1000 µL of 10% formamide wash buffer with 1 µL of 5 mg/mL DAPI. For 10 samples, mix 10 mL of 10% formamide wash buffer with 10 µL of 5 mg/mL DAPI. Resuspend in 1 mL of DAPI/FWB by gently pipetting up and down 2-3 times.\nIncubate at 30 ˚C for 30 min (not rotating) in the foil-covered box.\nThaw anti-bleach reagents on ice.\nCentrifuge the samples at ~376 x g for 3 min. Remove the supernatant completely by pipetting. If needed, centrifuge again to remove all of the supernatant.\nFor samples that are not imaged immediately, resuspend the pellet in 50 µL of GLOX Buffer without enzymes. Pipet up and down 3-4 times to mix.\n\t\nKeep all the unimaged samples in the foil-covered box at 4 ˚C until ready to image. When ready to image, centrifuge the samples at ~376 x g for 2 min and remove the supernatant completely by pipetting. Resuspend in GLOX with enzymes as below.\nFor samples being imaged immediately, add 15-20 µL of GLOX buffer with enzymes. Gently pipet up and down to mix.",
    "NOTE: The volume added can vary depending on the size of the cell pellet. We recommend resuspending the pellet in 15 µL of GLOX buffer with enzymes and check the cell density on microscope. If cells are too dense (cells clumping on top of one another), add extra GLOX buffer with enzymes. If cells are too sparse, centrifuge the sample and remove ~5 µL of buffer.\nPipet 5 µL onto a coverslip (18 mm x 18 mm, No. 1), and put the coverslip on a slide.\nPut a laboratory wipe on top of the slide where the coverslip is placed. Gently press on the laboratory wipe to set slide (should see liquid coming off from all four edges of the coverslip).\nTransfer the slide to the microscope room in a box covered by aluminum foil.\nImage using a wide-field fluorescence microscope with high magnification (60-100X) and high numerical aperture.\n\tNOTE: To collect the maximal number of photons emitted by the smFISH probes, confocal microscopes are not recommended, as they significantly limit the amount of light to be collected. Here, the data were collected on a microscope equipped with a 100X, 1.4 NA objective, using filters CY5 (EX632/22, EM679/34) imaged at 1.3 s, 100% T; TRITC (EX542/27, EM597/45), 1.3 s, 100% T; and DAPI (EX390/18, EM435/48), 0.05-0.1 s, 32%-50% T. A bright-field reference image should also be acquired. Acquire 15-25 slices with a step size of 0.1-0.2 µm, from entirely below the focus of the field of view to entirely above, in order to ensure that all of the RNA spots are accounted for.\n4. Image Analysis\nAnalyze the smFISH data with published smFISH analysis tools such as FISH-quant17 and StarSearch2, or with custom-made programs, depending on the exact requirements of the experiment.",
    "NOTE: A good analysis pipeline should allow the users to determine a threshold to separate the true RNA spots from the background, and output statistics such as the X, Y, and Z (optional) coordinates and the intensity of each spot, the number of spots in each cell, and possibly fitting parameters as a way to filter out false detections."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}