{
  "id": 4107,
  "origin_website": "Cell",
  "title": "A flow cytometry-based assay for serological detection of anti-spike antibodies in COVID-19 patients",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFlow cytometry-based assay to detect antibodies specific for SARS-CoV-2 S protein\nTiming: 2 h\nAll patients’ plasma/serum samples are diluted 1 in 100, while all secondary and tertiary antibodies are diluted 1 in 600.\nHarvest HEK293T cells expressing S protein.\nRemove spent media.\nWash with PBS.\nDetach with ice-cold 2 mM EDTA for 1–2 min.\nWash twice with PBS by centrifugation at 300 × g for 5 min.\nCritical: Avoid using trypsin to detach the cells. The S protein is sensitive to trypsin cleavage. Similarly, avoid using cell scrapper, as it might affect the expression of the S protein on the cell surface.\nSeed 0.15 × 106 cells into each well in 96 V-bottomed well plates.\nAll samples are analyzed in technical duplicates.\nPellet the cells down by centrifugation at 300 × g for 5 min.\nNote: The assay has been optimized for 0.1–0.25 × 106 cells/well. However, due to cell loss (through centrifugation), we recommend at least 0.15 × 106 cells/well.\nRe-suspend cells in diluted plasma/serum samples.\nDilute the samples at 1:100 in FACS buffer (10% FBS diluted in PBS) prior to addition to cells.\nEnsure that negative and positive control samples are also included. Eg. Anti-spike monoclonal antibody (e.g., Thermo Fisher Scientific #703958) can be used as positive controls and healthy control plasma/sera can be used as negative controls.\nIncubate at 4°C for 30 min in the dark.\nWash twice with PBS by centrifugation at 300 × g for 5 min.\nRe-suspend cells in diluted secondary antibody incubation.\nDilute the secondary antibodies at 1:600 in FACS buffer prior to addition to cells.\nFor IgG, IgM and IgA detection, the secondary antibody is anti-human IgG, anti-human IgM and anti-human IgA Alexa Fluor 647 antibodies in FACS buffer with 1 μg/mL propidium iodide.",
    "For IgG subclasses detection, the secondary antibody is mouse anti-human IgG1, IgG2, IgG3 and IgG4 antibodies in FACS buffer.\nNote: Other fluorophores, other than Alexa Fluor 647, can also be used. One other possible option is Alexa Fluor 405, which have little compensation issues with the GFP-positive cells and the propidium iodide staining. We have chosen Alexa Fluor 647 as there is also little compensation issues with the GFP-positive cells and the propidium iodide staining.\nNote: In place of propidium iodide, DAPI can also be used for staining to differentiate live/dead cells. Alternatively, other live/dead viability dyes may be used.\nIncubate at 4°C for 30 min in the dark.\nWash twice with PBS by centrifugation at 300 × g for 5 min.\nFor IgG and IgM detection, add 100 μL FACS buffer to the well. Re-suspend well and analyze by flow cytometry.\nFor IgG subclasses detection, re-suspend cells in diluted tertiary antibody incubation.\nDilute the secondary antibodies at 1:600 in FACS buffer prior to addition to cells.\nThe tertiary antibody is anti-mouse Alexa Fluor 647 antibodies in FACS buffer with 1 μg/mL propidium iodide (PI; Sigma-Aldrich #P4170).\nIncubate at 4°C for 30 min in the dark.\nWash twice with PBS by centrifugation at 300 × g for 5 min.\nAdd 100 μL FACS buffer to the well. Re-suspend well and analyze by flow cytometry.",
    "Cells were gated on: (1) FSC-A/SSC-A to exclude cell debris (Figure 2[href=https://www.wicell.org#fig2]A), (2) FSC-A/FSC-H to select for single cells (Figure 2[href=https://www.wicell.org#fig2]B), (3) FSC-A/PI to select for live cells (PI-negative population, Figure 2[href=https://www.wicell.org#fig2]C), (4) FITC/Alexa Fluor 647 (Figures 2[href=https://www.wicell.org#fig2]D–2H). Binding is determined by the percentage of GFP-positive S protein-expressing cells that are bound by specific antibody, indicated by the events that are Alexa Fluor 647- and FITC-positive (Gate 2). A sample is defined as positive when the binding is more than mean + 3SD of the healthy controls.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/873-Fig2.jpg\nFigure 2. FACS plot analysis\nCells were gated on: (A) FSC-A/SSC-A to exclude cell debris, (B) FSC-A/FSC-H to select for single cells, (C) FSC-H/PI to select for live cells (PI-negative population), (D, E) FITC/Alexa Fluor 647 for specific antibody binding. Binding is determined by the percentage of GFP-positive S protein-expressing cells that are bound by specific antibody, indicated by the events that are Alexa Fluor 647- and FITC-positive (Gate 2). (D) PBS control; (E) COVID-19 patient plasma, 1:100 diluted.\nNote: Cells are read on LSR4 laser (BD Biosciences), however, the cells can be read on any other cytometers with the following specifications (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_873_12.csv"
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Health Sciences",
    "Flow Cytometry",
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}