{
  "id": 13653,
  "origin_website": "Jove",
  "title": "Generation of Parabiotic Zebrafish Embryos by Surgical Fusion of Developing Blastulae",
  "procedures": [
    "This protocol was approved by Boston Children's Hospital Animal Care and Use Committee. This protocol is modified from a previously published method 15.\n1. Preparation of Reagents (Days or Weeks in Advance)\nPrepare 1.5% agarose-coated dishes. Add 1.5 g agarose to 100 ml Zebrafish E3 medium in an Erlenmeyer flask. Heat, dissolve the agarose, and then pour approximately 5 ml into 100 mm diameter x 20 mm deep petri dishes.\n\tNote: These are used for dechorionation of embryos (Step 3.1) and for the parabiotic surgery (Step 3.3). Store agarose-coated dishes at 4 °C for a few weeks; take them out of the fridge and warm to RT the morning of the day of parabiotic surgery.\nPrepare 4% methyl cellulose. Dissolve 4 g of methyl cellulose powder in 100 ml of E3 in an Erlenmeyer flask with a stir bar. Place the flask on a stir plate at 4 °C, set to the lowest speed, and let it mix for up to 2 days.\n\t\nIntermittently use a spatula to break up white clumps of methyl cellulose. The methyl cellulose crystals do not fully dissolve at this concentration. When the solution becomes clear and appears homogenous with no white clumps remaining, aliquot the solution into 1.5 ml microfuge tubes and freeze at -20 °C for long term storage.\n\t\tNote: Lower concentrations of methyl cellulose can be used; however, this higher percentage, more viscous methyl cellulose has yielded the best results.\nPrepare High Calcium Ringer (HCR) solution. To make 400 ml of HCR solution, mix 8 ml of 5M NaCl (116 mM final), 400 µl of 3M KCl (2.9 mM final), 800 µl of 5M CaCl2  (10 mM final), and 2ml of 1M HEPES (5 mM final) with 390 ml of E3 media.",
    "Note: Store HCR solution at 4 °C for a few weeks; warm to RT the morning of the day of parabiotic surgery.\nPrepare 5 - 6 modified Pasteur pipettes for transferring blastula pairs. Briefly heat the end of the pipette over a Bunsen burner. Then, using large forceps, bend the end of the pipette to approximately 45 °C while it is still hot.\n\t\nTo ensure there are no sharp edges that might damage embryos, hold the tip of the pipette briefly in the flame for around 3 sec. This will smooth/polish the end of the pipette. This modified glass Pasteur pipette is used in conjunction with a 10 ml pipette pump (Figure 1) in Step 3.5 below.\nPrepare glass needle tools for surgical stitching of blastula pairs. Pull 2 - 3 glass needles as done for microinjection of zebrafish embryos. Use lab-film to fix each glass needle to the end of a wood- or plastic-handled teasing needle (Figure 1A). Using forceps, break off the end of the needle at a diameter of approximately 20 - 30 µm. Use a stage micrometer to guide this step (Figure 1B).\n\tNote: The size of the needle tip is important. If the tip is too large it becomes difficult to control precisely and can cause excessive damage. If the tip is too small it is difficult to sufficiently wound the embryos.\n2. Setting up Breeding Pairs of Zebrafish and Collection of Embryos (Day -1 to Day 0)\nSet up breeding pairs of adult zebrafish. Set up fish the night before the parabiosis surgery is to be conducted. Use dividers to separate males and females. To increase the odds that the desired embryos will be obtained, set up several pairs of each line. We find that typically 20 - 50% of the pairs will spawn.",
    "The next morning, pull the dividers and allow mating. Collect any embryos using a fine-mesh tea strainer, then transfer them to a Petri dish containing E3 embryo medium18.\nMicro-inject embryos as desired (e.g., with 25 pg plasmid DNA, 200 pg mRNA, or with 1 - 6 ng morpholino) within 1 hr of collection. Allow them to grow until 256-cell stage. If the DNA expression construct is placed under the control of a heat shock promoter (e.g., hsp70, Figure 4B), control the timing of gene expression by heat shocking the parabionts at 37 °C at a later stage (e.g., at 36 hpf).\n\tNote: As an alternative to a fluorescent transgene, fluorescent dextran can be added to the DNA, RNA, or morpholino injection mix (e.g., dextran, cascade blue at 2 mg/ml). The dextran dye will not interfere with normal development and will allow for the injected embryo to be identified under the appropriate fluorescent light after parabiotic fusion. Alternatively, the parabiosis of a pigmented strain (e.g., AB) with a non-pigmented strain (e.g., Casper) could be used to identify the injected embryo at later stages.\nIncubate the embryos at 28.5 °C.Use a stereoscope to monitor their development periodically as they near the 256-cell developmental stage (approximately 2.5 hpf).\n\tNote: If needed, shift embryos to different temperatures to ensure stage matching between parabiotic partners (e.g., morpholino-injected embryos often develop slower than their un-injected counterparts. Shifting the un-injected embryos to RT while the morpholino-injected embryos are placed at 28.5 °C will result in their stages aligning after a couple hours of development).\n3. Generation of Parabiotic Zebrafish Embryos by Surgical Fusion of Developing Blastulae",
    "As the embryos approach the 256-cell stage (approximately 2.5 hpf), transfer the embryos from each genetic background (i.e., genetic mutant, transgenic lines and/or genetic manipulation) into separate agarose-coated dishes (e.g., one dish for morpholino-injected embryos and a second dish for control embryos). Alternatively, transfer the embryos to clean, scratch-free glass beakers or glass Petri dishes.\n\tNote: Avoid using uncoated plastic dishes as the embryos will stick to the plastic and be damaged once out of their chorions.\nDecant the E3 media until just enough liquid remains to cover the embryos (approximately 7 - 10 ml). Add 200 µl of 50 mg/ml mixture of proteases isolated from the extracellular fluid of Streptomyces griseus (proteases). Swirl the embryos gently every couple of minutes.\n\t\nWhen 50% of the embryos have come out of their chorions, which typically takes 5 - 10 min, rinse them three times with a generous volume (approximately 15 - 20 ml) of fresh E3 embryo medium.\n\t\t\nDechorionate any embryos remaining in their chorions by gently drawing them up into the modified glass Pasteur pipette and then gently dispelling them. Once the embryos have been dechorionated and washed, replace the E3 media with HCR solution. As an alternative to proteases, remove the chorions manually using a fine forceps. Aim to have 60 - 100 dechorionated embryos available for each experimental condition.",
    "Note: This is several fold more than will ultimately be used, but many embryos are likely to be damaged during handling or the surgery for parabiosis. Once the embryos are dechorionated, keep them submerged and do not allow them to touch the surface of the water, as the surface tension will cause them to be destroyed. Keep in mind that using a higher dose of proteases allows the embryos to come out of their chorions sooner and in a more synchronized fashion. When using a lower dose of proteases, the embryos take longer to emerge from their chorions and do so in a less synchronous fashion, which can result in a portion of the embryos being damaged by prolonged exposure to proteases.\nThaw the methylcellulose (made in Step 1.2 above) and centrifuge in a tabletop centrifuge on max speed for 10 min to pellet undissolved crystals which will damage the embryos or rupture their yolks.\n\t\nAfter centrifugation, use the clear upper fraction (approximately 75% of the volume). Transfer 1 - 1.5 cm diameter drops of methyl cellulose into a 1.5% agarose-coated Petri dish. Take care to avoid drawing up any of the pelleted crystals from the bottom of the tube.\nUse a marker to predetermine the position of each droplet on the bottom side of the dish. Place 12 - 15 drops (2 - 3 aliquots' worth) of methyl cellulose per 100 mm diameter petri dish. Prepare as many plates as needed per experiment.\n\t\tNote: Use each droplet for the fusion of a single blastula pair. The mark will designate the location of each droplet once the media is added-at which point the drops become nearly invisible.",
    "Prepare one 40 ml aliquot of antibiotic-supplemented HCR solution per agarose-coated dish prepared above in Step 3.3. To each 40 ml aliquot of HCR add penicillin-streptomycin at 50 U/ml, ampicillin at 50 U/ml, and kanamycin at 0.5 µg/ml.\n\t\nWhen ready to perform blastula fusions, carefully fill each of the dishes containing methyl cellulose droplets with 40 ml of the antibiotic-supplemented HCR solution. If the HCR solution is added too quickly, it can disrupt the droplets.\nAttach the modified glass Pasteur pipette (made in Step 1.4 above) to a 10 ml pipette pump. Under a stereoscope collect one dechorionated embryo from each background (e.g., one morpholino-injected embryo and one wild-type embryo).\n\t\nBefore dispensing the two embryos, use the Pasteur pipette to make a small depression in the middle of the methyl cellulose drop, then gently deposit both embryos into the depression.\n\t\tNote: During the transfer process, turn the Pasteur pipette slightly upwards so that the embryos settle into the bend of the Pasteur pipette so as to avoid their making contact with the surface of the liquid at the top or bottom of the pipette (which can lead to their rupture).\nImmediately after depositing the embryos into the methyl cellulose, use a wood- or plastic-handled teasing needle with a gel-loading pipet tip on the end (Figure 1A) to carefully reposition the embryos within the methyl cellulose such that their animal poles are directly touching one another.\n\t\nUtilize gentle sweeping motions through the methyl cellulose close to the embryos to reposition them without directly touching them. Let the embryos sit for 5 min so the methyl cellulose will settle in around them. During this time, load the next pair into another drop.",
    "Note: Avoid making direct contact with the embryos and take special care not to touch any part of the yolk sac, which will easily rupture.\nUsing the glass needle tool, carefully wound each embryo at their point of contact. With a gentle sewing motion, cells from the first embryo can be pulled into the second embryo and then back again. At the end of this motion, hold the needle in place for 2 - 3 sec and then draw it away very slowly.\n\tNote: There is a period of about 2 - 3 sec after the embryos are wounded where the two tissues seem to be more adhesive and more likely to attach to one another. Thus, we believe that holding the needle in place briefly after wounding helps to keep the wounded tissues of each embryo in contact for the initial period of time immediately after wounding.\nAllow these embryos to sit for 10 - 15 min at RT. In the meantime, continue to stitch new pairs in other drops of methyl cellulose. After 10 - 15 min, assess whether the first pair has remained attached (Figure 2A).\n\tNote: If the embryos are longer attached, repeat the stitching process for as long as the embryos are younger than around the 30% epiboly stage. Typically this allows for up to three attempts to stitch the embryos together. If the embryos appear to have maintained an attachment but the connection is not substantial, perform additional stitching at the edge of the connection to reinforce it. Avoid shaking or moving dishes during the parabiotic surgery and incubation periods.",
    "Note: Despite their early developmental stage and perceived fragility, the cell masses of the embryos can tolerate a substantial amount of manipulation (i.e., wounding and stitching), and still develop normally. The yolk, however, can rupture with only the slightest touch, killing the embryo. When stitching the two blastulae with the glass needle, do not to make contact with the interface between the cell mass and yolk of each embryo.\nIncubate the embryos O/N at 28.5 °C in the same dish and media (do not change the media). By the following morning, the embryos will have moved out of the mostly dissolved methyl cellulose droplets. Remove any embryos that were not successfully fused. Decant the media and replace with a fresh 25 ml E3.\n\tNote: If working with a pigmented strain, add 500 µl 0.15% (50x) phenylthiourea (PTU) to a final concentration of 0.003% to block pigmentation. Embryos will need to remain continuously in PTU to maintain suppression of pigmentation.\n4. Microscope Setup, Image Acquisition, Processing and Analysis\nPrepare 0.8% low melting point (LMP) agarose: Add 0.8 g LMP agarose to 100 ml E3 and heat until fully dissolved. While hot, aliquot 1 ml of LMP agarose into 1.5 ml microfuge tubes in a 37 °C heating block. The LMP agarose will remain molten at 37 °C. Add 40 µl of 4 mg/ml (25x), pH 7.0 tricaine to each 1 ml aliquot of LMP agarose at 37 °C. Note: If working with a pigmented strain, add 20 µl of 0.15% (50x) PTU to each 1ml aliquot.\n\t\nStore the remaining LMP agarose for several months in sealed 50 ml tubes at 4 °C.\nAnesthetize parabiotic embryos to be imaged by adding 1 ml of 4 mg/ml (25x), pH 7.0 tricaine to the 25 ml of E3 that the embryos are already in.",
    "Gently swirl the dish so that the embryos will pool in the middle. Then, using a wide-tipped plastic transfer pipette draw up the embryos in as little liquid as possible. Turn the pipette upright and gently bounce the embryos so that they settle to the very bottom of the pipette.\n\t\nWith the embryos at the bottom of the pipette, transfer them to a 1 ml aliquot of LMP agarose by lightly touching the pipette tip to the surface of the agarose. Avoid transferring excess liquid as this will dilute the agarose.\nAfter expelling the excess liquid from the pipette, use the pipette to gently mix the embryos within the agarose, then use the pipette to transfer all of the agarose and embryos to the well of a glass-bottom (No. 1.5 coverslip), 6-well plate.\n\tNote: Be sure to discard the pipette after transferring the embryos to the imaging plate. Residual agarose will set inside the pipette, rendering it ineffective for further use. Rather, use a new pipette each time.\nUnder a stereoscope, use a gel-loading pipette tip fixed on the end of a wood-handled teasing needle to position the embryos down towards the cover glass (to ensure they are within the working distance of the microscope objective) and in the desired orientation for imaging.\n\tNote: Reposition continuously until the agarose has fully set. Take care to mount the parabiotic embryos according to which embryo of the pair is to be imaged. Given the random orientation of the conjoined embryos, for some pairs it may be difficult to image both embryos. In this scenario, recover the embryos from the agarose using a forceps and a wide-tipped plastic transfer pipette and then remount for imaging from a different perspective.",
    "Once the agarose has set, cover with 2 - 3 ml of E3 supplemented with tricaine (and PTU if necessary).\nImage the embryos using an inverted wide-field epi-fluorescence, laser-scanning confocal, or spinning disk confocal microscope. Select the objective most appropriate for the desired imaging. For a whole-embryo field of view, use a 4x objective. Select a higher magnification, such as a 20x objective, to image a specific tissue16, 19.\n\tNote: If using an upright microscope, mount in LMP agarose (similar to above) on a glass cover slip. Invert the glass coverslip onto a glass microscope slide that has a ring of vacuum grease filled with the same E3-tricaine-PTU16, 19.\nProcess acquired images using free image analysis software packages such as NIH Image J/FIJI16, 19.\n\tNote: Count cell numbers and quantify dynamics such as cell migration and cell division using segmentation and tracking algorithms16, 19.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}