{
  "id": 10352,
  "origin_website": "Jove",
  "title": "In Vitro Model of Human Cutaneous Hypertrophic Scarring using Macromolecular Crowding",
  "procedures": [
    "1. Cell culture\nMaintain hHSFs and normal dermal fibroblasts derived from non-pathological tissue (hNSFs) in Dulbecco's modified Eagle's medium (DMEM) containing 10% fetal calf serum (FCS) and 1% v/v penicillin/streptomycin solution (P/S) at 37°C in an incubator with 5% CO2/95% air.\nPurchase Ficoll 70, Ficoll 400, and ascorbic acid from the appropriate companies.\n2. Construction of MMC hypertrophic scar model\nSeed the hHSFs or hNSFs (50,000/well) into a 24 well plate containing 1 mL of media in each well.\nPlace in a 37°C incubator at 5% CO2 and leave overnight.\nPrepare the MMC media. Based on the total volume required for the experiment, produce 10% FCS/DMEM media by mixing Ficoll 70 (18.75 mg/mL), Ficoll 400 (12.5 mg/mL), and ascorbic acid (100 μM).\nPlace the mixture into a 37°C water bath for 1 h to disperse the crowders into the solution, then sterilize the MMC media using a 0.2 μm filter.\nAspirate the spent media and replace with the freshly made MMC media.\nIncubate the cells for 6 days at 37°C and 5% CO2, changing the media every 3 days.\n3. Expression of the total amount of collagen\nPrepare Sirius red solution (0.1% w/v). Dissolve 0.2 g of Direct Red 80 powder in 200 mL of distilled deionized water (ddH2O) with 1 mL of acetic acid.\nAspirate the MMC media and add 300 μL of Sirius Red solution into each well. Incubate at 37 °C for 90 min.\nGently rinse the Sirius Red solution with tap water and allow the plate to air-dry overnight.\nExtract the Sirius Red stain by adding 200 μL of sodium hydroxide (0.1 M) into each well. Place the plate onto an orbital shaker for 5–10 min to fully extract the Sirius Red stain.",
    "Transfer 100 μL of the extracted Sirius Red stain into a 96 well transparent plate and measure the absorbance at 620 nm using a microplate reader.\n4. Expression of collagen I (immunostaining)\nWash the wells using 200 μL of phosphate-buffered saline (PBS, pH = 7.35).\nFix the cells using methanol (500 μL/well) at 4 °C for 10 min.\nBlock nonspecific interactions with 3% bovine serum albumin for 30 min at room temperature (RT).\nAspirate the blocking solution and incubate with 200 μL of anti-collagen I antibody (10 μg/mL) for 90 min at RT.\nAspirate the primary antibody and wash 3x with PBS for 5 min each.\nIncubate with 200 μL of Goat anti-Rabbit-FITC secondary antibody (1:400 dilution) and 4’,6-diamidino-2-phenylindole (DAPI; 1: 2000 dilution) for 30 min at RT. Cover the plate with aluminum foil.\nDiscard both the secondary antibody and DAPI and wash 3x with PBS for 5 min each.\nVisualize the fluorescence staining directly under a microscope.\n5. Western blotting\nWash the cells 2x with PBS.\nAdd 40 μL of lysis buffer into each well and scrape the cell layer with a pipette tip. The lysis buffer contains RIPA buffer, protease inhibitor cocktail (PIC), 2 mM sodium vanadate, and 10 mM sodium fluoride.\nTransfer the protein lysate into microcentrifuge tubes and measure the protein concentration using a protein assay as per the manufacturer's instructions16.\nLoad 10 μg of protein of each group into the wells of 4%–12% Bis-Tris protein gels. Perform sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) at 200 V for 30 min.\nTransfer the protein to nitrocellulose membrane by running a western blot at 90 V for 90 min. Avoid formation of air bubbles between the gel and nitrocellulose membrane.\nBlock the membrane with 10 mL of blocking buffer.",
    "Incubate with primary antibodies at 4°C overnight. Primary antibodies are: anti-collagen I, anti-collagen III, anti-collagen IV, anti-αSMA, anti-MMP-1, anti-MMP-2, anti-MMP-9, anti-MMP-13, and anti-glyceraldehyde 3-phosphate dehydrogenase (GAPDH).\nWash the membrane with 0.1% TBS-Tween 20 (5x for 5 min each). TBS/Tween 20 (1 L) contains the following: 50 mL of 1 M Tris (pH = 7.4), 30 mL of 5 M sodium chloride, 1 mL of Tween 20, and 920 mL of ddH2O.\nIncubate with a species appropriate secondary antibody at RT for 1 h.\nRepeat step 5.8 and visualize fluorescence using an imaging system.\n6. RT-PCR\nCollect the total RNA using the lysis buffer mixed with 2-mercaptoethanol included in the RNA extraction assay kit.\nPurify the RNA as per the manufacturer's instructions17.\nMeasure the RNA concentration using a microvolume spectrophotometer.\nPerform first strand cDNA synthesis using a cDNA synthesis kit as per the manufacturer's instructions.\nRT-PCR oligonucleotide primers are provided (precoated) in custom 96 well plates. Mix 100 ng of the cDNA samples with 10 μL of SYBR green supermix into the customized plate.\nIncrease the total volume to 20 μL/well using ddH2O.\nRun RT-PCR using a thermal cycler following the manufacturer's instructions: 40 cycles of denaturing at 98°C for 15 s and annealing/extension at 60 °C for 60 s. The genes tested in RT-PCR include: COL1A1, COL3A1, ACTA2, SMAD2, SMAD3, SMAD4, SMAD7, IL1A, IL1B, IL6, IL8, MMP1, MMP2, MMP3, TGFB1, and VEGF.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}