{
  "id": 4953,
  "origin_website": "Bio",
  "title": "Calculation of Microorganism Lag Times as a Measure of Adaptative Capability  between Different Growth Conditions ",
  "procedures": [
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205160324_3356.jpgFigure 1. Switch experiments procedure In the incubator, pre-warm one empty 5 ml syringe, two 5 ml syringes filled with 3 ml condition 2 medium, the flask filled with 30 ml of condition 2 medium, and the filter with a plastic adapter on the nozzle. Sterility of the media has to be maintained at this step. With the empty syringe (needle inner diameter: 0.8 mm), sample cells from the primary culture in condition 1. Notes: The volume depends on two factors. (i) It has to be maximized so that the absorbance when eluted in the condition 2 flask can be reproducibly measured at step 6 (for example, 2 ml of E. coli culture at OD600 nm = 3 in the primary culture provide a measurable OD600 nm = 0.2 in the secondary culture). (ii) It has to be minimized to avoid clogging the filter at step 3.From step 2 onward, the manipulations have to be performed as rapidly as possible to minimize the culture perturbation (i.e., in less than 2 min). As a control, we suggest performing the same experiment by replacing condition 2 medium by condition 1 and ensuring that the initial growth rate in the secondary culture is equal to the growth rate in the primary culture. Attach the filter to syringe filled with 3 ml of pre-warmed condition 2 medium and rinse the cells on filter (the flow-through is discarded). Replace the syringe by one of the two syringes filled with 3 ml of pre-warmed condition 2 medium and rinse the cells on the filter with medium 2. Attach the second 5 ml syringe filled with 3 ml of pre-warmed condition 2 medium on the other end of the filter using the plastic adapter.",
    "Elute the cells over the flask filled with 30 ml of condition 2 medium. Place the flask in the shaker incubator for 1 min to ensure homogeneity of the solution and measure the initial OD. Immediately place the flask back in the incubator. Monitor again the growth of the secondary culture when the cells reach their maximal growth rate on condition 2 (standardized by trial). For example, switching E. coli from a glucose to an acetate based mineral medium required measuring the OD at times 60 and 90 minutes after inoculation by spectrophotometry at OD600 nm (Enjalbert et al., 2015). The measure at 60 min allows to calculate the lag (see step 8), and the calculation of the growth rate between 60 and 90 min ensures that the cells reach their maximal growth rate (this maximum growth rate in condition 2 has to be previously determined). Use the following equation to calculate the lag time before maximal growth (see Figure 2 for justification):(t1-tm) = (t1-t0)-ln(X1/X0)/μmaximgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205160345_8636.jpgFigure 2. Theoretical growth profiles for the calculation of the lag in the switch experiments. tm is the theoretical time needed to increase the biomass from X0 to X1 if the growth rate is maximal (µmax) from t0. If there is a delay, X1 will be obtained at t1 (i.e., later than tm). From these elements, the lag can be determined as (t1-tm). By definition, Eq1: μmax = ln(X1/X0)/(tm-t0)From whichEq2: (tm-t0)= ln(X1/X0)/μmaxSince Eq3: (t1-tm)= (t1-t0)-(tm-t0)From Eq3 and Eq2, Eq41: (t1-tm) = (t1-t0)-ln(X1/X0)/μmax"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}