{
  "id": 19754,
  "origin_website": "Wiley",
  "title": "Chromosome Analysis and Sorting Using Conventional Flow Cytometers",
  "procedures": [
    "This protocol employs a human lymphoblastoid cell line, GM7016A. Suspension cell lines are sub-cultured to 50% with 50 ml fresh growth medium and grown for 24 hr before treatment with mitotic inhibitors, i.e., colcemid or demecolcine. This treatment results in mitotic arrest, which helps to accumulate the percentage of cells at metaphase.\nMaterials\nHuman lymphoblastoid cell lines, GM7016A\nRPMI 1640 medium with HEPES (Gibco, cat. no. 52400-025) supplemented with 15% FBS (Gibco, cat. no. 10270106) and antibiotics (Sigma, cat. no. G6784)\n10 µg/ml KaryoMAX Colcemid (Gibco, cat. no. 15212-012) or 10 µg/ml Demecolcine (Sigma, cat. no. D1925)\nT-75 cm2 sterile culture flasks (StemCell Technologies, cat. no. 200-0501)\n50-ml polypropylene centrifuge tube (Greiner Bio-one, cat no. 346370)\n2-ml Pasteur pipette (Greiner Bio-one, cat no. 612398)\nBenchtop centrifuge (Eppendorf or equivalent)\nCell culture incubator (Panasonic or equivalent)\nFluorescence microscope with 10× to 20× objective and PI filter set (Zeiss or equivalent)\n1. Culture cells in T-75 cm2 flasks with 50 ml RPMI 1640 cell culture medium at 37°C in a 5% CO2 incubator.\n2. The culture medium contains phenol red. When the medium turns yellow (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0001]), which is an indication that the cells need subculturing, remove half of the spent culture medium without disturbing the cell clusters and subculture the near-confluent cells at a ratio of 1:1 in two flasks.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/633082a6-2074-44c1-bd16-0e4e6528de3f/cpz1718-fig-0001-m.jpg</p>\nFigure 1\nThe near-confluent cell culture medium will turn yellow, indicating that the cell culture needs feeding and sub-culturing. In this example, the near-confluent cells are sub-cultured at a ratio of 1:1 in two separate flasks. The flasks are topped up with fresh medium, which is pink.\n3. Bring the volume in the flasks to 50 ml with fresh culture medium. Incubate at 37°C in a 5% CO2 incubator.",
    "4. After 24 hr, add colcemid to a final concentration of 0.1 µg/ml and then gently swirl the flask to mix well. Incubate for 6 hr.\nThe duration of incubation with the mitotic inhibitors varies according to the rate of cell growth. A high mitotic index can be achieved by optimizing treatment time for each cell type. The number of cells at metaphase can be assessed during cell swelling with hypotonic solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0003] and Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0002]).\n5. Collect cells suspended in the supernatant from both flasks (T-75 cm2), transfer them to two 50-ml polypropylene centrifuge tubes, and centrifuge at 289 × g for 5 min at room temperature.\n6. Carefully remove the supernatant without disturbing the pellet. Invert the tube on an absorbent paper and drain the excess medium.\n7. Proceed to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0003].",
    "This modification of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0001] applies to cell culture and metaphase harvest for adherent cell lines. The protocol made use of a swine fibroblast cell line that should be applicable to other adherent cell lines.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0001])\nSwine fibroblast cell line (Sanger Source)\nDMEM/F12 medium (Gibco, cat. no. 11330057) supplemented with 15% FBS (Gibco, cat. no. 10270106) and antibiotics mixture (Sigma, cat. no. G6784)\nSterile 1× PBS (Gibco, cat. no. 14190094)\nTrypLE Express (Gibco, cat. no. 12604013)\nT-150 cm2 sterile culture flasks (StemCell Technologies, cat. no. 38072)\nInverted light microscope with 10× or 20× objective (Zeiss or equivalent)\n1. Culture cells in T-150 cm2 flasks with 25 ml DMEM at 37°C in a 5% CO2 incubator.\n2. When the culture is near-confluent (∼75% surface coverage), remove the spent medium.\n3. Briefly rinse the cell layer with 5 ml sterile 1× PBS and then discard the buffer using a sterile 10-ml pipette.\n4. Add 3 ml TrypLE Express and ensure it covers the entire surface of the flask. Incubate at 37°C for 3-5 min.\n5. Tap the bottom of the flask gently to detach all of the cells. Add 5 ml fresh culture medium and mix well to obtain a single-cell suspension.\n6. Subculture the cell suspension at a ratio of 1:3 in four flasks. Bring the volume to 25 ml with fresh culture medium. Incubate at 37°C in a 5% CO2 incubator.\nIn this example, a total of 8 flasks are used during the chromosome harvesting process. The number of flasks required to obtain a sufficient number of chromosomes (at least 5 million chromosomes per ml) will vary according to the total number of metaphase cells achieved after colcemid treatment.",
    "7. After 24 hr, add colcemid to a final concentration of 0.1 µg/ml and gently swirl the flask to mix well. Incubate for 6-16 hr.\nThe duration of treatment with mitotic inhibitors varies according to the rate of cell growth. A high mitotic index can be achieved by optimizing treatment time for different cell types. Cells arrested at metaphase appear under the microscope as “rounded cells” loosely attached to the monolayer surface.\n8. Gently tap the bottom of the flasks to dislodge the cells at metaphase.\n9. Collect cells suspended in the supernatant from the four flasks (150 cm2) after mitotic shake-off and transfer them to two 50-ml polypropylene centrifuge tubes. Centrifuge at 289 × g for 5 min at room temperature.\n10. Remove the supernatant without disturbing the pellet. Invert the tube on absorbent paper and drain the excess medium.\n11. Proceed to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0003].",
    "In this protocol, the harvested colcemid-treated cells are treated with hypotonic solution. The cells swell, increasing in volume, and the chromosomes spread apart within the plasma membrane. The cells are then disrupted mechanically to release the chromosomes after treatment with a modified polyamine isolation buffer (Ng and Carter, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-bib-0011]).\nMaterials\nHypotonic solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0008])\nPolyamine isolation buffer (PAB, see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0014])\nTurck's stain (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0022])\n1 mg/ml propidium iodide (Sigma, cat. no. P4170) (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0015])\n50-ml polypropylene centrifuge tube (Greiner Bio-one, cat no. 346370)\n15-ml polypropylene centrifuge tube (Greiner Bio-one, cat no. 188171)\n5-ml BD Falcon tube (SLS, cat no. 352054)\n20-µm mesh filter (CellTrics, cat. no. 04-004-2325)\n2 ml Pasteur pipette (Greiner Bio-one, cat. no. 612398)\nVortex (Fisherbrand or equivalent)\n1. Resuspend the cell pellets from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0001] in hypotonic solution (∼5 ml per tube) with a Pasteur pipette. Combine the cell suspensions in a single 50-ml polypropylene centrifuge tube and incubate at room temperature for about 15 min.\n2. Mix 5 µl cell suspension with 5 µl Turck's stain on a microscope slide and directly monitor the cells for swelling under a light microscope.\nIf Turck's stain is not available, use 1 mg/ml PI and view under a fluorescence microscope.\nSwollen cells at metaphase should display a good spread of chromosomes within the plasma membrane (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0002]). Assess the cells for swelling and incubate for an additional 10 to 30 min if needed.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3c5efe79-fccb-4a72-b137-6e3509c25626/cpz1718-fig-0002-m.jpg</p>\nFigure 2\nImages of chromosome preparation. Swollen cells in metaphase (m) and interphase (i) stained with (A) Turck's solution and (B) PI. i, cells in interphase; m cells in metaphase.\n3. Centrifuge the swollen cells at 289 × g for 5 min at room temperature.",
    "4. Remove the supernatant without disturbing the pellet. Invert the tube on absorbent paper and drain the excess medium.\n5. Add 1 to 2 ml ice-cold PAB to the cell pellet and gently resuspend using a Pasteur pipette. Incubate on ice for 10 min.\n6. Disrupt the cells by vortexing for 10-20 s.\n7. Stain 5 µl suspension with 5 µl PI on a microscope slide and gently cover with a coverslip. View the stained chromosome suspension directly under the fluorescence microscope and check for single intact chromosomes (see Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0003]).\nContinue to vortex as needed if numerous chromosome clumps (chromosomes that bundle to each other) are observed in the stained suspension. Alternatively, draw up and expel the suspension several times using a 5-ml syringe attached to a 22.5 G needle.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b45c1073-c9d7-4eae-88d9-fa44c4d692d3/cpz1718-fig-0003-m.jpg</p>\nFigure 3\nImages of chromosome preparation. Released single intact chromosomes (s) and interphase nuclei (i) after treating the swollen cells with PAB containing 0.25% (v/v) Triton X-100, and staining with PI.\n8. Transfer the chromosome suspension to a 15-ml polypropylene centrifuge tube and spin at 201 × g for 2 min at room temperature. Collect the supernatant in a 5-ml Falcon tube after filtering through a 20-µm mesh filter.\n9. Proceed to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0004].",
    "The aim of this protocol is staining the chromosomes using DAPI and PI. This staining protocol is suitable for most conventional flow cytometers equipped with standard solid-state lasers and optics configuration.\nMaterials\n1 mg/ml DAPI (Sigma, cat. no. D9542)\n1 mg/ml PI (Sigma, cat. no. P4170)\n1 M MgSO4·7H2O (Sigma, cat. no. M2773)\n500 mM sodium sulfite (Sigma, cat. no. S8018)\n1 M sodium citrate (Sigma, cat. no. S4641)\n1. Per 1 ml chromosome suspension, stain overnight with 5 µl of 1 mg/ml DAPI (final concentration 5 µg/ml), 5 µl of 1 mg/ml PI (final concentration 5 µg/ml), 10 µl of 1 M MgSO4·7H2O (final concentration 10 mM), 10 µl sodium citrate (final concentration 10 mM), and 50 µl of 500 mM sodium sulfite (final concentration 25 mM). Store in the dark at 4°C overnight before flow analysis and sorting.\nSodium citrate and sodium sulfite have been used to improve flow karyotype resolution for most lymphoblastoid cell lines. The effect of both compounds on resolution can vary by cell line. Monitor the flow karyotype by reducing the concentration or excluding one or the other compound.\n2. Proceed to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0006] or Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0007].",
    "In this protocol, the chromosomes are stained using the conventional dye combination HO with CA3. This staining protocol is suitable for flow cytometers equipped with a laser wavelength set in the UV range (330-360 nm) and another in the indigo range (440-460 nm). Fluorescence detection of HO and CA3 is measured using a band-pass BP 450/50 filter and a long-pass LP 420 filter, respectively.\nMaterials\n1 mg/ml Hoechst 33258 (Sigma, cat. no. B2883)\n10 mg/ml Chromomycin A3 (Sigma, cat. no. C2659)\n1 M MgSO4·7H2O (Sigma, cat. no. M2773)\n1 M Sodium citrate (Sigma, cat. no. S4641)\n500 mM Sodium sulfite (Sigma, cat. no. S8018)\n1. For 1 ml chromosome suspension, stain overnight with 5 µl of 1 mg/ml HO (final concentration 5 µg/ml), 5 µl of 10 mg/ml CA3 (final concentration 50 µg/ml) and 10 µl of 1 M MgSO4·7H2O (final concentration 10 mM). Then add 10 µl sodium citrate (final concentration 10 mM) and 50 µl of 500 mM sodium sulfite (final concentration 25 mM). Store in the dark at 4°C overnight before flow analysis and sorting.\nSodium citrate and sodium sulfite have been used to improve flow karyotype resolution for most lymphoblastoid cell lines. The effect of both compounds on resolution can vary by cell line. Monitor the flow karyotype by reducing the concentration or excluding one or the other compound.\n2. Proceed to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0006] or Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-prot-0007].",
    "This protocol describes bivariate chromosome analysis on a cell analyzer after staining with DAPI and PI. This dye combination can be measured using a laser combination of 355 nm and 561 nm or 355 nm and 488 nm. The 5-laser BDLSR Fortessa cell analyzer used in this example requires filter replacement on the 488-nm blue laser optics configuration. The workflow described here is applicable to and compatible with other cell analyzer models.\nMaterials\nBD LSRFortessa cell analyzer equipped with the standard 5-laser system (355 nm, 405 nm, 488 nm, 561 nm, and 640 nm)\nLong pass LP 620 filter (optional)\nCell staining buffer (Biolegend, cat. no. 420201)\nBD FACSDiva CS&T Research beads (BD, cat. no. 655051)\n5-ml BD Falcon tube (SLS, cat no. 352054)\n20-µm mesh filter (CellTrics, cat. no. 04-004-2325)\n1. Briefly vortex the stained chromosome sample for 5 s.\n2. Centrifuge the chromosome suspension at 201 × g for 3 min at 4°C. Filter supernatant through 20-µm mesh into a 5-ml BD Falcon tube. Store on ice.\n3. Perform daily maintenance on the BD LSR Fortessa according to manufacturer instructions.\n4. Perform an instrument performance check using BD CST beads. Vortex beads thoroughly for 5 s. Mix 2 drops of beads with 500 µl cell staining buffer in a 5-ml Falcon tube. Verify that the cytometer performance check passed before proceeding to experiment set-up.\nSetting up parameters and plots for chromosome analysis\n5. Using the parameters specified below, set up the instrument for the chromosome analysis experiment as shown in Figure 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0004].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ff05bc45-a900-40e8-ba46-3a78a18922a2/cpz1718-fig-0004-m.jpg</p>\nFigure 4\nChromosome analysis setup on the BD LSRFortessa cell analyzer. (A) Setting up the required parameters (B) Label the selected parameters (C) Setting the threshold.\n6. Under Parameters Panel:\n         \nFor DAPI detection, select 450/50 (355). Set signal detection to Area and Width.",
    "For PI detection using the 561 nm laser, select 610/20 (561). Set signal detection to Area and Width.\nFor PI detection using the 488 nm laser, select 710/50 (488). Set signal detection to Area and Width. On the Octagon detection array for the 488 nm laser, replace the 685 DLP with a blank filter holder and swap the band-pass filter BP 710/50 with a band-pass filter BP 610/20 or a long-pass filter LP 620 (optional).\nDelete any unnecessary parameters.\n7. Label the parameters as shown in Figure 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0004].\n8. In the Cytometer Settings menu, set the Threshold level at 10,000 for 450/50 (355), as shown in Figure 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0004].\n9. Create the dot plots as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0005] for (A) DAPI 450_50 (355)-A versus DAPI 450_50 (355)-W, (B) DAPI 450_50 (355)-A versus PI 610_20 (561)-A, and (C) DAPI 450_50 (355)-A versus PI LP620 710_50 (488)-A.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1517749b-c27a-422b-9c15-dc816a389323/cpz1718-fig-0005-m.jpg</p>\nFigure 5\nData plots for chromosome analysis on a BDLSR Fortessa cell analyzer. (A) DAPI 450_50 (355)-A versus DAPI 450_50 (355)-W (B) DAPI 450_50 (355)-A versus PI 610_20 (561)-A (C) DAPI 450_50 (355)-A versus PI LP620 710_50 (488)-A.\n10. In the Cytometer fluid control panel, adjust the RUN to a data rate of 1000 events per second.\n11. In the Cytometer Settings menu, adjust the voltage for both detectors with the chromosome clusters displayed along a 45° angle as shown in the data plots (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0005] and 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0005]).\n12. Draw a region gate R1 on plot DAPI 450_50 (355)-A versus DAPI 450_50 (355)-W to gate out the debris and clumps (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0005]).",
    "13. In this example, both laser combinations (355 nm with 561 nm and 355 nm with 488 nm) are used simultaneously for chromosome analysis. Display gated events R1 on DAPI 450_50 (355)-A versus PI 610_20 (561)-A (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0005]) and DAPI 450_50 (355)-A versus PI LP620 710_50 (488)-A (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0005]).\n14. Acquire and save 50,000 to 100,000 events.\n15. Analyze and compare the collected chromosome data to the data obtained in Figure 17A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0017]. Verify if most chromosomes clusters can be identified. For further guidelines, refer to ‘Critical Parameters and Troubleshooting’.",
    "This protocol provides the procedure for bivariate chromosome analysis after staining with DAPI and PI on an Invitrogen Bigfoot spectral cell sorter. This dye combination can be measured using a laser combination of 355 nm with 561 nm or 355 nm with 488 nm. The workflow is applicable to and compatible with other cell sorters.\nMaterials\nInvitrogen Bigfoot spectral cell sorter equipped with 349 nm, 488 nm, or 561 nm lasers\n70-µm nozzle\nBigfoot Calibration Beads (Invitrogen, cat. no. PL00287)\n20-µm mesh filter (CellTrics, cat. no. 04-004-2325)\n5-ml BD Falcon tube (SLS, cat. no. 352054)\n1.5-ml Eppendorf tube, sterile, UV-treated\nChromosome sheath buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0002])\n1. Briefly vortex the stained chromosome sample for 5 s.\n2. Centrifuge the chromosome suspension at 201 × g for 3 min at 4°C. Filter supernatant through 20-µm mesh into a 5 ml tube. Store on ice.\nSetting up the cell sorter\n3. Replace the sheath tank with chromosome sheath buffer.\n4. Set the sheath pressure to 60 PSI.\n5. Install a clean 70-µm nozzle.\n6. Start up the cell sorter as directed by the manufacturer.\n7. Perform daily maintenance on the cell sorter as directed.\n8. Perform instrument laser alignment and drop delay calibration using Bigfoot calibration beads according to manufacturer instructions. Verify that the sorter passed daily QC and the drop delay is established before proceeding to experimental setup.\nThe Bigfoot cell sorter can perform both automated and manual laser alignment. Manual laser alignment is recommended for the chromosome application,. For other cell sorters, please use the recommended fluorescent beads and perform the daily QC laser check as directed by the manufacturer.\nSetting up parameters and plots for chromosome analysis\n9. Select ‘Quick Run’ and select the parameters used for the chromosome analysis experiment.",
    "10. In Flex Controls, select ‘Detection’ and relabel the selected parameters (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0006]).\n         \nFor DAPI detection, within 349 nm parameters select band-pass BP 455/14. Under ‘Optical Filters’, replace BP 455/14 with a long-pass LP 420 filter.\nFor PI detection, within 561 nm parameters select band-pass BP 625/15. Under ‘Optical Filters’, replace BP 625/15 with a long-pass LP 570 filter.\nThese long pass filters are supplied by the instrument manufacturer with the instrument at purchase.\n(Optional) If using a 488-nm laser for PI detection, select BP 615/24 in the 488 nm parameters.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/31be9ae0-bac7-4fc2-b24f-77402b97160c/cpz1718-fig-0006-m.jpg</p>\nFigure 6\nChromosome analysis on an Invitrogen Bigfoot spectral cell sorter. (A) Setting up DAPI detection with the 349-nm laser (B) Setting up PI detection with the 561-nm laser.\n11. In the Control Panel (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0007]), select 2D Trigger ‘ON’ and 2D Trigger mode ‘AND’. Optimize the level for both parameters selected for 349 nm and 561 nm or 488 nm (optional: if 488 nm laser is used for PI excitation).\nBigfoot is equipped with a dual parameters trigger. If using other cell sorters, set the trigger value on a single parameter such as PI or DAPI fluorescence.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/8eaa2b3c-2f26-45db-b6a4-9180a2a7fd13/cpz1718-fig-0007-m.jpg</p>\nFigure 7\nSet Trigger on parameters selected for 349 nm and 561 nm. Optimize the level to minimize background noise and debris.\n12. Create a single parameter histogram plot for 349 nm-DAPI LP420, 561 nm-PI LP570, and 488 nm-PI 614/24 (Fig. 8A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0008]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/10f7e896-1631-4eea-bce0-33cf2009468f/cpz1718-fig-0008-m.jpg</p>\nFigure 8\nHistogram plot for parameters from 349-, 561-, and 488-nm lasers. Set a region gate for each of the displayed histograms (A) Using the Nozzle Mover Panel control, align the lasers with minimum CVs for the DAPI and PI fluorescence channels (B).\nManual laser alignment\n13. Run a tube containing the Bigfoot calibration beads at a flow rate of 250 events/s.",
    "14. Under ‘Flex Controls’, select ‘Nozzle Mover’ (Fig. 8B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0008]). On the Nozzle Move Panel align the optical light path with minimum coefficient of variation (CVs) for both DAPI and PI fluorescent channels.\nSetting up bivariate plots for chromosome analysis\n15. Create the dot plots (Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0009]) for (A) 349 nm-DAPI LP420 (Area Linear) versus 349 nm-DAPI LP420 (Width Linear) and (B) 349 nm-DAPI LP420 Area Linear versus 561 nm-PI LP570 Area Linear.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/68c5bbf6-59b3-46e2-a7b8-9563e2eec978/cpz1718-fig-0009-m.jpg</p>\nFigure 9\nData plots for chromosome analysis on an Invitrogen Bigfoot cell sorter. (A) 349 nm-LP420 (Area-Linear) versus 349 nm-LP420 (Width-Linear) (B) 349 nm-LP420 (Area-Linear) versus 561 nm-PI LP570 (Area-Linear).\n16. Optimize the RUN with flow rate 1000-1500 events per second.\n17. Draw a region gate on plot 349 nm-DAPI LP420 (Area –Linear) versus 349 nm-DAPI LP420 (Width-Linear) to gate out the debris and clumps (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0009]).\n18. Display gated events in R1 on 349 nm-DAPI LP420 (Area-Linear) versus 561 nm-PI LP570 (Area-Linear). On ‘Detection’ (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0006]), adjust the voltage until the chromosome clusters are displayed along a 45° angle as shown in the data plot (Fig. 9B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0009]).\n19. Acquire and save 50,000 to 100,000 events.\n20. Analyze and compare the collected chromosome data to the data displayed in Figure 17B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0017]. Verify that most chromosome clusters can be identified. For further guidelines, refer to Critical Parameters and Troubleshooting.\nSorting chromosomes\n21. On the data plot, draw the region gate around the chromosome cluster of interest for sorting (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0010]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b7a03357-e5b0-4eb4-9d69-b03fdd8cd9f9/cpz1718-fig-0010-m.jpg</p>\nFigure 10\nDraw a region gate around the chromosomes of interest for sorting. In this example, chromosomes Y, 13, 17, and 19 have been selected for sorting.",
    "22. Within the Sort function, select sort media option ‘Tube1-5ml’ for sorting into 1.5-ml Eppendorf tubes. Calibrate and adjust the test sort stream to make sure the sort stream is aligned with the collection tube. Then set Sort Mode to ‘Purity’ and the required number of chromosomes to be sorted per Eppendorf tube (Fig. 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0011]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7d6e0416-5465-42c2-ad10-ee541c1f53dc/cpz1718-fig-0011-m.jpg</p>\nFigure 11\nSet Sort Mode to Purity and the required sorted chromosome numbers per tube.\n23. Position the collection tube in the sorting collection area (Fig. 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-fig-0012]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6bea8d48-2388-431c-a3a3-088c18d9df26/cpz1718-fig-0012-m.jpg</p>\nFigure 12\nPosition the empty 1.5-ml Eppendorf tubes in the sort collection area.\n24. Run the chromosome sample for a couple of minutes or until the chromosome clusters remain stable in their position as displayed in the data plot. Reposition the sort gate on the selected chromosome clusters if required.\n25. Proceed with the sorting process.",
    "This protocol provides the procedure for handling the chromosome material after sorting. In general, sorted chromosomes come in batches of approximately 250,000 copies per 1.5-ml Eppendorf tube. The chromosome purification method described here is suitable for downstream processes such as PCR, sequencing, microarray, or other genomics assays.\nMaterials\n20 mg/ml Proteinase K (Invitrogen, cat. no. 25530-015) (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0016])\nSARC/EDTA (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0017])\n20 mg/ml PMSF (Sigma, cat. no. P7626) (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0012])\n5 M NaCl (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.718#cpz1718-rec-0011])\nAbsolute ethanol (VWR, cat. no. 20821.321)\nPellet Paint NF Co-Precipitant (Sigma, cat. no. 70748)\nTris-EDTA buffer (Sigma, cat. no. 93283)\nMicro-centrifuge (Eppendorf or equivalent)\n1. Store the flow-sorted chromosomes at 4°C.\n2. Handle the Eppendorf tubes containing flow-sorted material gently. Each tube should contain 250,000 chromosome copies in a 300-µl volume.\n3. Add 15 µl SARC/EDTA and 2.5 µl proteinase K. Incubate overnight at 42°C.\nThe amounts of reagents required will vary according to the quantity of sorted sample.\n4. Dilute 20 mg/ml PMSF to 4 mg/ml with absolute ethanol. Add 2 µl to the sorted DNA tubes. Incubate 40 min at room temperature.\n5. Add 10 µl of 5 M NaCl (final 0.3 M including sheath buffer), 2 µl pellet paint, and 770 µl absolute ethanol. Mix gently by inversion. Store overnight at −20°C.\nThe sorted chromosomes can be stored at −20°C at this stage until needed.\n6. Pellet the sorted chromosomes at 15,700 × g for 15 min at room temperature.\n7. Remove most of the supernatant with a P1000 pipette tip. Remove the remaining solution with a P200 pipette tip without disturbing the pellet.\n8. Add 1 ml of 70% (v/v) ethanol without disturbing the pellet.\n9. Centrifuge again for 7 min at 15,700 × g, room temperature. Remove the supernatant as in step 6.",
    "10. Repeat 70% ethanol (v/v) wash one more time and allow the pellets to air-dry at RT for 10 min.\n11. Resuspend the pellet in 100 µl sterile Tris-EDTA buffer.\n12. Proceed to genomics assays, i.e., sequencing or microarray experiments."
  ],
  "subjectAreas": [
    "Cytometry"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}