{
  "id": 18477,
  "origin_website": "Jove",
  "title": "Scleral Cross-linking Using Riboflavin and Ultraviolet-A Radiation for Prevention of Axial Myopia in a Rabbit Model",
  "procedures": [
    "Animals were treated in accordance with the ARVO resolution on the use of animals in research. The study protocol was approved by the institutional Committee for Laboratory Animal Research (approval no. 022-4598-2; 021211).\n1. Preparation for Surgery #1\nWeigh and anesthetize a 13 day-old New Zealand white rabbit with an intramuscular injection of ketamine hydrochloride 100 mg/ml (100 mg/kg) and xylazine hydrochloride 25 mg/ml (12.5 mg/kg). Those doses are used due to the length of the surgical procedure.  Assure appropriate level of anesthesia by the lack of a pain reflex.\nUsing a sterile cotton swab, apply a small amount of ophthalmic ointment to the non-operated eye to prevent the cornea from drying out. Apply 0.9% normal saline drops onto the operated eye cornea during the operation to prevent the corneas from drying out.\nPerform three axial length measurements in each eye after topical anesthesia (oxybuprocaine hydrochloride 0.4%) using an ultrasound A-scanner and then average the measurements. Apply the probe perpendicularly to the central cornea.\n2. Surgery #1 - Pre Cross Linking Step\nUsing surgical ophthalmic forceps and scissors under an ophthalmic operating microscope, make a 360° conjunctival peritomy with surgical ophthalmic forceps and scissors.\nUsing an angled forceps or a muscle hook identify the four extraocular rectus muscles and isolate them with a 2-0 braided silk non-needled sutures.\n\tNOTE: The silk sutures will help with moving the globe in the desired direction. The eyeball is divided into quadrants between the four rectus muscles (four quadrants).\n\t\nMark with a skin marker two zones in each quadrant, one at the equatorial sclera and one at the posterior sclera. These are the irradiation zones.\nPrepare a 3 ml to 5ml syringe containing 0.1% dextran-free riboflavin-5-phosphate. Connect the syringe to a 26 G lacrimal cannula or 25 G tapered hydrodelineator.",
    "Prepare the irradiation device which includes a UV A (370 nm) light source connected to a beveled down custom-made fiber optic. Following the measurement of energy power and calibration (see NOTE below), set the device to 57 mW/cm².\n\tNOTE: Calibration was carried out commercially by the manufacturer. This method provides a total UVA light dose of 57 J/cm². (57 mW/cm2 on 0.2 cm2 is 11.4 mW/0.2 cm2 using 11.4 mW/0.2 cm2 for 200 sec is a cumulative load of 2.2 J per 0.2 cm2 spot)\n3. Surgery #1 – Cross Linking\nMove the eyeball by pulling the silk sutures in the opposite direction of the chosen quadrant to be treated (e.g., Pull up and nasal when treating the lower temporal quadrant). Perform the eyeball movement using a 2-0 braided silk non-needled suture which isolates each rectus muscle.\nApply photosensitizer solution containing 0.1% dextran-free riboflavin-5-phosphate onto the irradiation zone 20 sec before irradiation starts.\nIrradiate the irradiation zone using a beveled down custom made fiber optic for an irradiation period of 200 sec. Measure the area of each zone as 0.2 cm² with a radius of 4 mm.\nApply photosensitizer solution containing 0.1% dextran-free riboflavin-5-phosphate onto the irradiation zone every 20 sec during the 200 sec irradiation period.\n\tNOTE: Perform the irradiation and the dropping of riboflavin simultaneously by two surgeons.\nRepeat steps 3.1-3.4 for each of the four eyeball quadrants.\n4. Surgery # 1 - Post Cross Linking Step\nShave the fur around the eye. Trim the lid margins using surgical ophthalmic scissors and then gently suture the upper and the lower eyelids using 4-0 braided silk ivory color - 3/8 circle reverse cutting- 13 mm length C-3 needle (tarsorrhaphy). Apply a small amount of ophthalmic ointment on the lid margin at the end of the procedure (chloramphenicol 5%).",
    "5. Surgery #1 - Post Operative Care\nKeep the animals under a heating lamp during recovery. Do not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nPlace the animal in a clean cage with new bedding until it is fully recovered. After recovery, the animal will be returned to the animal room. Return the animal to his mother only when awake. \nDuring the first 48 hr, examine the animals concerning the general condition and signs of illness or infections. Administer analgesia as per section 1. Administer analgesia as needed if a change in the rabbit behavior is observed. (Metamizole drops 50mg/kg every 6 hr).\n6. Surgery #2\nFifty-five days after surgery #1, weigh and anesthetize the rabbit with an intramuscular injection of ketamine hydrochloride 100 mg/ml (100 mg/kg) and xylazine hydrochloride 25 mg/ml (12.5 mg/kg).\nUsing surgical ophthalmic scissors under an ophthalmic operating microscope, remove the tarsorrhaphy. Perform three axial length measurements on each eye after topical anesthesia (oxybuprocaine hydrochloride 0.4%) using an ultrasound A-scanner and then average the measurements. Apply the probe perpendicularly to the central cornea.\nEuthanize the rabbits with intraperitoneal phenobarbital sodium (200 mg/1.5 kg body weight).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}