{
  "id": 8313,
  "origin_website": "Jove",
  "title": "Breakfast Habits among Schoolchildren in the City of Uruguaiana, Brazil",
  "procedures": [
    "The research obtained authorization from the Research Ethics Committee of the University of Unipampa. During the whole process of data collection, children’s anonymity was guaranteed and the ethical principles for medical research in human beings described in the latest revision of the Declaration of Helsinki were applied23.\n1. Design of the research instrument\nDesign a first draft of the questionnaire to meet the objective of the study (Supplementary File 1). This questionnaire should contain questions about breakfast habits in schoolchildren. The objective is to know the relationship between breakfast habits and the sociodemographic characteristics of this population.\n\tNOTE: A transcultural adaptation of the abridged questionnaire on Eating Habits of the School Population of the “PERSEO” program is conducted, validated in the Spanish population24. The items related to breakfast are selected.\nCreate the draft using word editing software so that it can be easily shared and modified. Include different study variables such as the following: gender, age, family situation, parent’s occupation25. Variables on the breakfast habits include foods included in the daily breakfast, classification of breakfast (both according to the Spanish Society of Community Nutrition and to the recommendations of the WHO)26,27.\nSend a draft to external experts. Have them review the translated questionnaire whilst considering aspects such as item comprehension.\n\tNOTE: The experts were a teacher and psychologist familiarized with the use and translation of questionnaires. Both people were bilingual in Portuguese and Spanish.\nDesign a final version of the questionnaire (Supplementary File 2) and submit it to a scientific and ethical committee along with a research report of the project.\n\tNOTE: Positive evaluation was obtained both in scientific and ethical areas from the University of Unipampa committee (Supplementary File 3).",
    "Conduct a reliability analysis of the resulting questionnaire applying it at two different moments in time in order to analyze its consistency and reproducibility in a pilot group.\n2. Sampling method\nConduct a cross-sectional descriptive study to characterize the breakfast habits of the schoolchildren.\n\t\nHave the teacher ask for silence in the classroom.\nHave each student complete their questionnaire individually. They have fifteen minutes to complete it, approximately one minute per question.\nAsk students to be honest with their answers and select only one option for each question.\n\t\tNOTE: A random sampling was performed by using clusters of urban public schools of the city (Figure 1). In the random selection of clusters, 12 schools were included with a total of 558 boys and girls. To reach an acceptable confidence level of 95% and marginal error of 5%, the minimum sampling size should be 264 children.\nContact the leaderships of all the participating schools (directors or heads of studies) to report the date and time for completing the questionnaires.\nInform parents and obtain their informed consent. Children complete questionnaires individually but the consent of their patents is essential because they are minors.\n3. Statistical analyses\nAnalyze the data with a statistical analysis program (e.g., SPSS). Manually pass all written data to a database in a spreadsheet format. This format allows opening database in the statistical program. Analyze all parameters completed by the students. Select Analyze | Descriptive Statistics | Crosstabs | Statistics | Kappa | Accept (see Figure 2).",
    "NOTE: To evaluate the reliability and reproducibility of the transcultural adaptation of the questionnaire, the Kappa indexes of concordance of the dichotomic questionnaire items are calculated. For the polichotomic items, the summatory value of the scores obtained is used, generating a new variable called “sum of the items’ scores”, with values from 0 to 4. The interclass correlation coefficient is calculated to assess the numerical concordance between the first and the second measurements. Both for the Kappa index and for the aforementioned coefficient, values higher than or equal to 0.40 are considered acceptable, and those higher than or equal to 0.75 are considered excellent28. The accepted statistical significance level to calculate these coefficients was set at p < 0.05.\nPerform the descriptive analysis: calculate the frequency distributions of the main qualitative variables, as well as the measurements of central tendency and dispersion of the quantitative variables. Select Analyze | Descriptive Statistics | Explore | Confidence interval for the mean 95% | Accept (see Figure 3).\nPerform hypothesis contrast by using the Chi-square test and Student’s t-test, depending on the case. For the Chi-square test, select Analyze | Descriptive Statistics | Crosstabs | Statistics | Chi-square (see Figure 4). For Student’s t-test click Analyze | Compare averages | T test for independent samples (see Figure 5).\n\tNOTE: The accepted statistical significance level for the hypothesis contrast is set at p < 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}