{
  "id": 19966,
  "origin_website": "Wiley",
  "title": "Analysis of Tomato Post-Harvest Properties: Fruit Color, Shelf Life, and Fungal Susceptibility",
  "procedures": [
    "Tomato fruit color and uniformity play a pivotal role in consumer perception of fruit quality. Tomato fruits display various colors depending on the fruit ripening stage, the dominant carotenoids, and other phytochemicals produced in the fruits, as well as environmental factors. It is an esthetic parameter whereby the consumer associates color with a better tasting, more nutritious, and fresher product. The color value is also an important fruit quality indicator for breeders and industry for the selection of varieties and the monitoring of quality.\nIn general, fruit color can be measured by visual analysis or different instrumental methods such as colorimetry, spectrophotometry, or a computer vision system (for reviews see Pathare, Opara, & Al-Said, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0009]; Wu & Sun, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0013]). Most color measuring instruments use mathematically defined color spaces standardized by the International Commission on Illumination (Commission Internationale de l'Éclairage; CIE). The two-color space system named CIELAB (also known as CIE L*a*b*, L*a*b*, or Lab) is commonly used commercially for food color measurement as it closely approximates the color perception by humans. CIELAB, which is related to the alternative Lab color space Hunter Lab, mathematically describes all perceivable colors in three dimensions and measures three values: the achromatic component L* (light vs. dark) and two color descriptors, the a* (red vs. green) and b* (yellow vs. blue) values (Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0001]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/697c5fbd-c132-4f12-8a72-39b8f208af67/cppb20108-fig-0001-m.jpg</p>\nFigure 1",
    "Tomato fruit color measurement using the CIELAB color space system. (A) Diagram representing the CIELAB color scale. The L* axis indicates the degree of lightness or luminosity from black to white (L* = 0 to 100). The a* axis represents the redness or greenness on a scale from red (positive number) to green (negative number). The b* axis approximates yellowness and blueness on a scale from yellow (positive number) to blue (negative number). The center is achromatic (neutral or gray). The a* and b* values can be used to predict chroma (C*) and hue (hab). Chroma indicates the intensity or saturation level of a particular hue/vividness or dullness of a color. Hue indicates the perception of a color of an object (e.g., red, green, yellow, according to the color wheel). (B) NE 4000 colorimeter used to measure L*, a*, and b* values of a fresh tomato puree sample (indicated by black arrow).\nThis protocol is intended for researchers to rapidly become familiar with the method routinely used by industry and breeders to determine tomato fruit color.\nMaterials\n6 to 12 mature tomato fruits per genotype or tomato products (e.g., tomato puree or juice)\nCloth, to clean tomatoes\nKnife or razor blades, to cut tomatoes\nBlender (e.g., Panasonic MX-188) or homogenizer\nGauze fabric, 100% cotton, 20 S, non-sterile, unbleached without fluorescent chemicals (e.g., Charry Co. Ltd.)\n50-ml centrifuge tubes or glassware, to store tomato puree\nBenchtop colorimeter and accessories (e.g., Nippon Denshoku Industries Color Meter NE 4000 or ZE6000) or portable handheld colorimeter (e.g., Hunter Lab MiniScan EZ 4500)\nComputer and software for color data analysis and management (e.g., ColorMate 5)\nSample preparation\n1. Harvest tomato fruits at mature ripening stage, and transfer to the laboratory.",
    "For tomatoes, the degree of ripening is often estimated by color charts in an industrial setting (e.g., visual aid TM-L-1; United States Department of Agriculture, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0012]). It can also be specified by days post anthesis or post breaker stage (see Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0002] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0003]).\nAn undesirable yellowish fruit color can be observed in unripe or ripe fruits as a result of abiotic and/or biotic stress, such as high temperature, or can be caused by diseases during fruit ripening. Fruit color is also influenced by growing conditions such as light intensity, use of fertilizers (type and amount), and watering regimen.\n2. Select 6 to 12 fruits per tomato variety, depending on fruit size and sampling procedure of the study design.\n3. Remove fruit calyx and remaining stem parts. Clean fruits with a cloth to remove dirt.\n4. Cut each fruit into two to four pieces, and avoid juice loss as much as possible.\nAlternatively, a whole fruit can be used for color measurements.\n5. Put cut tomatoes in a blender, and blend for 1 to 2 min until pureed.\n6. Filter puree through a two-layered gauze cloth into 50-ml centrifuge tubes to remove seeds and skin debris.\n7. Stir tomato puree before color measurement (step 13).\nColor measurement\nThe specific procedure depends on the type and model of the instrument used. Steps 8 to 13 relate to the use of a desktop colorimeter (e.g., Color Meter NE 4000 or ZE 6000; Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0001]) and the measurement of L*, a*, and b* values for tomato fruit puree. For other colorimeter models follow the manufacture's guidelines for setting up the instrument, standardization, and reading samples.",
    "8. Preparing for measurements: Power on and set operating functions using the display menu. Set color space system to L*a*b* (six other color space options are available; e.g., Lab, XYZ, and RGB). Select light source mode/viewing angle for the CIE Standard Daylight Illuminant D65/10° (alternatives are CIE illuminant/observer angle C/2° or D65/2°), and set measurement mode to reflectance (the other selectable option is transmittance).\n9. Select sample type (i.e., powder/paste if using tomato puree or solid sample if using whole tomato fruits) from the drop-down menu.\n10. Select measuring area (6, 10, or 30 mm) and aperture (6, 10, or 30 Φ). Choose appropriate sample stage (holding/supporting the sample cell) corresponding to the measuring area (6, 10, or 30 mm) and sample type (solids, powder, or paste). For analyzing color of tomato puree, choose a wide aperture of 30 Φ, a 30-mm sample stage, and a round cell (i.e., sample cell/cuvette for powder and paste samples).\n11. Zero calibration: Place 30-Φ aperture, corresponding sample stage (30 mm) for standard calibration, and 30-Φ glass plate into the instrument. Cover with “ZERO box” (black box) to prevent light exposure, and press the “zero-calibration (0-CAL)” key (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-tbl-0001]).\nTable 1.\n                Colorimeter Setup for Calibration and Sample Readinga[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-tbl1-note-0001_17]\ntable:\n﻿Setup,Zero calibration,Standard calibration,Sample measurement\nUpper,ZERO box,Standard White Plate,ZERO box\n,30-Φ glass plate,30-Φ glass plate,30-Φ sample cell\n,30-mm sample stage for standard calibration,30-mm sample stage for standard calibration,30-mm sample stage\nLower,30-Φ aperture,30-Φ aperture,30-Φ aperture\na As described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0001] steps 11 to 13.\n12. Standard calibration: Remove “ZERO box,” and replace with the “Standard White Plate.” Press the “standard-calibration (S-CAL)” key (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-tbl-0001]).",
    "13. Sample measurement: Remove “Standard White Plate,” 30-Φ glass plate, and 30-mm sample stage used for calibration, and replace with 30-mm sample stage for sample measurement. Fill sample cell with tomato puree (from step 7) to the top, and place sample cell on top of the sample stage. Cover sample cell with “ZERO box” (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-tbl-0001]), and read L*, a*, and b* values.\nReadings can be saved and analyzed (see step 14).\nThe L* value indicates the level of lightness from black (L* = 0) to white (L* = 100); a low number indicates dark (L* = 0 to 50), while a high number indicates light (L* = 51 to 100). The a* value expresses greenness (negative number) or redness (positive number). The b* value indicates blueness (negative number) or yellowness (positive number). Neutral gray values are represented at a* = 0 or b* = 0 (Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0001]).\nThe CIELAB L*, a*, and b* values measured in this protocol can be converted to color values measured by other color space systems such as CIE XYZ and Hunter Lab using manual calculation or colorimeter software programs.\nData presentation\n14. Present color value as L*, a*, b*, and a*/b*.\nThe value of a*/b* is the most widely used reference parameter for color quality in commercial practice and scientific publications on tomato fruits and products.",
    "A true red reference color point has the coordinates L* = 50, a* = +60, and b* = 0; a green reference value has the coordinates L* = 50, a* = –60, and b* = 0 (López Camelo & Gómez, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0008]). For example, immature green tomatoes have an a*/b* ratio <0, which increases to 0 and above as the tomatoes ripen and turn redder (Hanson et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0007]); L* values decrease with darkening of the red fruit color (López Camelo & Gómez, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0008]).\nColor parameters such as tomato color index, chroma difference, total color difference, and hue angle can be determined using L*, a*, and b* values to express color changes and evaluate fruit quality (López Camelo & Gómez, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0008]; Yildiz & Baysal, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0014]). The fruit lycopene content can also be calculated based on the L*, a*, and b* color readings (Arias, Lee, Logendra, & Janes, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0002]).\nFruit color can also be measured by visual analysis using a standard color chart under controlled illumination conditions.",
    "Here we provide a detailed description of the analysis of shelf life properties of tomato fruits, including fruit texture (firmness/softness), weight, and rotting. We describe the scoring of fruit quality before and during storage, tomato fruit harvest, preparation of fruits for storage, and storage conditions, as adapted from Zhang et al. (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0015]).\nMaterials\n10 to 15 tomato fruits per tomato genotype\nSterile water\n10% (v/v) bleach (e.g., Parozone Thick Bleach Original)\n70% (v/v) ethanol (e.g., VWR, cat. no. 20821.330)\nLabels (e.g., colored paper clips, small paper pricing tags)\nClipboard, paper, and writing instrument\nComputer running spreadsheet analysis software\n15-cell and 40-cell plant potting trays, ∼6.5 cm × 6.5 cm per cell and ∼3.5 cm × 3.5 cm per cell, respectively (e.g., Desch Plantpak)\nPlastic plant propagator trays (e.g., Desch Plantpak)\nMasking tape\nScale (e.g., Sartorius Practum 612-1S)\nLint-free paper towel sheets (e.g., Kimberly-Clark WypALL or Kimwipes)\n500-ml containers (e.g., Phytatray II; Sigma-Aldrich, cat. no. P5929)\n50-ml centrifuge tubes, disposable, sterile (e.g., Corning, cat. no. 430290)\nZip-lock polythene bag, ∼33 cm × 45 cm (e.g., Allpack Packaging Supplies, cat. no. SS16)\n18°C, 70% humidity growth cabinet with 24-hr dark cycle (e.g., Sanyo, Fitotron)\n1. Monitor development and ripening of tomato fruits daily or every other day. When fruits have reached breaker stage (i.e., when skin color changes from green to pink, red, or yellow on ∼10% of the fruit surface), label and record breaker date. Label individual fruits with a paper tag annotated with the breaker date. For large-scale experiments (∼100 tomatoes per day), use colored paper clips or unique tags to represent a specific date. Log breaker date of each fruit in a spreadsheet to facilitate subsequent scheduling of fruit harvest for experiments and to monitor the number of fruits already available for a given genotype.",
    "It is recommended to use at least 10 tomatoes per genotype for shelf life tests considering background fruit-to-fruit variability. Tag at least 12 to 15 fruits per genotype to account for possible fruit damage or loss.\nIn large-scale experiments, color or shape coding of labels is necessary to identify specific fruits among hundreds without the need to read each fruit label individually.\n2. Harvest tomato fruits 2 weeks after breaker stage into labeled, clean containers, such as disposable 15-cell plant potting trays inserted into a plastic plant propagator tray; label individual cells using strips of masking tape. Collect only fruits that are in perfect condition. Avoid using wrinkled or damaged tomatoes, fruits with a dry calyx, or fruits grown on damaged or diseased branches or plants.\nFor large-scale tests (≥100 fruits per day), it is helpful to have a tick list of fruits to be harvested on the day before collection.\nIn large-scale experiments, fruits aged between 13 and 16 days after breaker can be used without significant deviation of performance compared with fruits aged 14 days after breaker. However, it is not recommended to use much younger or older fruits.\n3. Remove any remaining calyx, measure individual fruit weight, and record color. Assess fruit color according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0001] or using visual annotation (e.g., purple, dark red, red, yellow-red). Score fruit firmness using a scale of 1 to 5 (i.e., 1 = very firm, 2 = firm, 3 = medium, 4 = soft, 5 = very soft). Score fruit firmness by holding the fruit with both hands and moving the fingers around the whole equator of each fruit.",
    "Very firm tomatoes (1) have a totally rigid surface, while very soft fruits (5) have a \"water balloon–like\" feel all around. Tomatoes scored as (3) are in between. This method enables the quick and nondestructive assessment of fruit firmness as a whole, which is particularly important as tomato fruits can be heterogeneous in their maturation (i.e., some sectors or areas are more mature than others).\n4. Surface clean tomato fruits by rinsing twice with sterile water directly in the 15-cell potting tray previously used for harvest (step 2). To avoid handling fruits, pour water over fruits in the tray, and then remove carefully by tilting the tray. After rinsing, wipe dry the surface of each fruit with a lint-free towel sheet, and place fruits back into the tray on top of a clean paper towel pushed into the bottom of the cell. From this point onward, handle fruits with gloves to maintain semi-sterile conditions. Next, dip each fruit for 10 to 15 s into ∼400 ml of 10% (v/v) bleach, and briefly rinse in 400 ml sterile water placed in 500-ml containers. Replace bleach and water after ∼10 to 12 dips. Following rinsing, surface dry fruits with a clean paper towel. Finally, carefully wipe each fruit using a paper towel sheet sprayed with 70% ethanol.\nThe cleaning step with bleach can be omitted; however, some fruits may develop unwanted fungal growth, especially in cases of prolonged storage. This might produce an undesirable “batch” effect for the other fruits stored within the same container.",
    "5. Surface clean (e.g., spray) a 40-cell plant potting tray or any equivalent container with 70% ethanol. Divide tray into two parts that will be placed on top of each other to increase rigidity. Label each fruit with a permanent marker near the calyx attachment zone (optional), and place, top up, in a cell. Adjust the number of tomatoes per tray according to size (up to 12 tomatoes per tray). When using small fruits (like cherry tomatoes), add plastic caps from 50-ml centrifuge tubes (or equivalent support) on the bottom of the cell. Place each tray in a new, clean zip-lock polythene bag to prevent extensive water loss during fruit storage. Add one or two 50-ml centrifuge tubes into empty cell(s) as a “spacer” between the tomatoes and the bag to avoid direct contact between them (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0002]). Record the position of individual tomatoes in each tray (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0002]).\nTubes can also be used for labeling (e.g., tray identifier, experiment date).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/22ec75f4-e71a-47fb-a55e-4de40bb896e1/cppb20108-fig-0002-m.jpg</p>\nFigure 2\nShelf life test. (A) Storage of tomato fruits in a tray placed in a sealed bag. (B) Recording of individual fruit position. Shown is an example for storage of 10 fruits (A) and the corresponding log sheet (B).\n6. Incubate tomatoes at 18°C in the dark with 70% humidity in a controlled environment room or cabinet (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0003]) until the end of the storage test (step 7).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6c453c09-f32f-42df-9c8e-f467c4b1d4bb/cppb20108-fig-0003-m.jpg</p>\nFigure 3\nShelf life test. Storage of tomato fruits in a controlled environment cabinet.",
    "7. Each week, evaluate fruit weight and quality by scoring fruit softness on a scale of 1 (very firm) to 5 (very soft; see step 3) and by rating fruit surface integrity from 1 to 4 (D1 = little, D2 = medium, D3 = severe fruit shriveling or skin damage, D4 = split fruits or tomatoes presenting major necrosis or wounds). Wear clean gloves when handling or weighting fruits. Compile all data (i.e., genotype name, breaker date, date of fruit harvest [number of days after breaker]) and weekly fruit weight, softness, and surface integrity into a spreadsheet to enable data analysis. Collect data for at least 10 biological replicates (scattered in different trays according to their date of maturity), and compare to well-characterized, control genotypes.\nVery soft fruits (5) or tomatoes with severe surface damage or rotting (D3 or D4) are considered unsuitable for commercialization or consumption and are removed from each tray weekly. It can take several weeks (sometime months) until the last tomato is discarded.\nThe total weight loss of tomato fruits is the difference between the initial and the final weight at the time of its removal from the tray.\nAs an order of magnitude, 100% of fruits from S. lycopersicum cv. M82 are, on average, discarded after 4 weeks of storage at 18°C.",
    "Tomato fruit quality and shelf life properties are also greatly influenced by the susceptibility to diseases, especially fungal infections. B. cinerea is one of the most important post-harvest pathogens in tomato, although it can also cause significant damage and losses during plant growth and development. Here, we describe the analysis of fruit pathogen susceptibility with respect to B. cinerea, from harvest to wound inoculation of tomato fruits, which was adapted from Zhang et al. (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0015]). We also present a method for isolation of Botrytis spores used as an inoculum for wound inoculation (see Support Protocol).\nMaterials\n10 to 15 tomato fruits per tomato genotype\nSterile water\n70% (v/v) ethanol (e.g., VWR, cat. no. 20821.330)\n1 × 105 spores/ml Botrytis macrospore inoculum (see Support Protocol)\n10% (v/v) bleach (e.g., Parozone Thick Bleach Original)\nLabels (e.g., colored paper clips, small paper pricing tags)\nClipboard, paper, and writing instrument\nComputer running spreadsheet analysis software\n15-cell and 40-cell plant potting trays, ∼6.5 cm × 6.5 cm per cell and ∼3.5 cm × 3.5 cm per cell, respectively (e.g., Desch Plantpak)\nPlastic plant propagator trays and transparent lids (e.g., Desch Plantpak)\nMasking tape\nScale (e.g., Sartorius Practum 612-1S)\nLint-free paper towel sheets (e.g., Kimberly-Clark WypALL or Kimwipes)\n50-ml centrifuge tubes, disposable, sterile (e.g., Corning, cat. no. 430290)\n200-µl pipette tips, for wounding fruit (e.g., StarLab, cat. no. S1113-1810-C)\nParafilm, 50 mm × 76 mm (e.g., R&L Slaughter, cat. no. 291-1214)\n20°C, 70% humidity growth cabinet with 12-hr light/12-hr dark cycle, 70% light intensity (e.g., Sanyo, Fitotron)\nCaliper (e.g., Draper Dual Reading Digital Vernier Caliper)\nCAUTION: Perform all steps involving Botrytis macrospore inoculum in a laminar flow hood, dedicated incubator, or laboratory area suitable for working with biosafety level (BSL) 2 pathogens.\nProduction and preparation of tomato fruits",
    "1. Monitor development and ripening of tomato fruits daily or every other day. When fruits have reached breaker stage (i.e., when skin color changes from green to pink, red, or yellow on ∼10% of the fruit surface), label and record breaker date. Label individual fruits with a paper tag annotated with the breaker date. For large-scale experiments (∼100 tomatoes per day), use colored paper clips or unique tags to represent a specific date. Log breaker date of each fruit in a spreadsheet to facilitate the subsequent scheduling of fruit harvest for experiments and to monitor the number of fruits already available for a given genotype.\nIt is recommended to use at least 10 tomatoes per genotype for pathogen tests considering background fruit-to-fruit and inoculation variability. Tag at least 12 to 15 fruits per genotype to account for possible fruit damage or loss.\n2. Harvest tomato fruits 2 weeks after breaker stage into labeled, clean containers, such as 15-cell plant potting trays inserted into a plastic plant propagator tray; label individual cells using strips of masking tape. Collect only fruits that are in perfect condition. Avoid using wrinkled or damaged tomatoes, fruits with a dry calyx, or fruits grown on damaged or diseased branches or plants.\nFor large-scale tests (≥100 fruits per day), it is helpful to have a tick list of fruits to be harvested on the day before collection (e.g., Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0004]).\nIn large-scale experiments, fruits aged between 15 and 17 days after breaker can be used without significant deviation of performance compared with fruits aged 14 days after breaker. However, it is not recommended to use much younger or older fruits.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/055f2f8a-722b-4c33-add9-5440bf06ec5a/cppb20108-fig-0004-m.jpg</p>\nFigure 4",
    "Fungal susceptibility test. (A) Experimental setup for fruit wound inoculation. (B) Log sheet. Shown is an example of an inoculation tray for 16 fruits (A) and the corresponding log sheet (B).\n3. Remove any remaining calyx, measure individual fruit weight, and record color. Assess fruit color as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0001] or Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0002] (step 3; rapid method). Score fruit firmness using a scale of 1 to 5 (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0002] step 3).\n4. Surface clean tomato fruits by rinsing twice with sterile water directly in the 15-cell potting tray previously used for harvest (step 2). To avoid handling fruits, pour water over fruits in the tray, and then remove carefully by tilting the tray. After rinsing, wipe dry the surface of each fruit with a lint-free towel sheet, and place fruits back into the tray on top of a clean paper towel pushed into the bottom of the cell. From this point onward, handle fruits with gloves to maintain semi-sterile conditions. Finally, carefully wipe each fruit using a paper towel sheet sprayed with 70% ethanol.\nAn additional cleaning step with 10% (v/v) bleach (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0002] step 4) can also be performed; however, due to the short incubation time of the pathogen test (3 days), it is not essential. Omitting this step reduces the workload and saves time during large-scale experiments.",
    "5. Surface clean (e.g., spray) with 70% ethanol 40-cell plant potting trays, propagator trays, and lids or any equivalent containers in which inoculation and incubation will be subsequently undertaken. To maintain a highly humid environment during incubation (step 8), add two towel sheets soaked with 100 to 150 ml sterile water into the propagator tray, underneath the 40-cell tray inlay. Label each fruit with a permanent marker near the calyx attachment zone, and place, top up, in a cell. When using small fruits (like cherry tomatoes), add plastic caps from 50-ml centrifuge tubes (or equivalent support) on the bottom of the cell. Label each tray, and record the position of individual tomatoes on the tray (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0004]).\nTomatoes should be well spaced in the tray (16 to 20 fruits per 40-cell tray, depending on fruit size) to allow easy wounding and inoculation without touching other fruits (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0004]). It is also important to make sure that the tomatoes are stably positioned and cannot move to ensure that the inoculum droplets remain on the fruit surface (step 7). Rolled masking tape or double-sided tape can be placed at the base or on the side of each fruit to secure fruits into position.\nInclude control fruits in each experiment and/or tray. It may be useful to include genotypes with a known level of fungal susceptibility. Including standard genotypes such as S. lycopersicum cv. M82 or cv. MoneyMaker will enable accounting for potential experiment-to-experiment and year-to-year variations.\nPathogen test",
    "6. Wounding surface-sterilized tomatoes: Adjust the number of wounds according to tomato fruit size, and space wounds evenly around the upper half of the fruit. Wound large tomatoes (e.g., S. lycopersicum cv. M82 fruits; ∼40 to 50 cm high × 40 to 50 cm wide × 50 to 60 cm deep) four times at 0°, 90°, 180°, and 360° positions. Wound medium-sized tomato fruits (∼30 to 40 cm × 30 to 40 cm × 40 to 50 cm) three times, and wound small tomatoes (e.g., S. pennellii or S. lycopersicum cv. MicroTom fruits; ∼20 to 30 cm × 20 to 30 cm × 30 to 40 cm) only once or twice. Use a 200-µl pipette tip to pierce and wound (1 to 2 mm deep) fruit surface (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0005]). Change tip between genotypes to avoid sap cross contamination.\nAdjustments to the number of wounds are made to prevent lesions overlapping with each other and to ensure consistent levels of infection. As a rule of thumb, wounds should be separated by ∼20 mm. It is also important to wound fruits consistently.\nAfter wounding, fruit sap may come out of the wounds (especially for fruits that are very soft 2 weeks after breaker) and should be carefully dried off with a clean paper towel to prevent subsequent dilution or spillage of inoculum. Usually, tomatoes are wounded in batches of 16 to 32 tomatoes (i.e., one to two experimental trays of tomato fruits) before proceeding with wound inoculation (step 7).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/29b17a37-3e08-4a21-be7a-f1e01d98a0b9/cppb20108-fig-0005-m.jpg</p>\nFigure 5\nFungal susceptibility test. (A) Wounding of tomato fruit surface with a 200-µl pipette tip. (B) Inoculation of surface wound with a 5-µl spore inoculum droplet. (C) Medium-sized tomato fruit with one inoculation droplet (indicated by a white arrow) on each of the four wound sites.",
    "7. Inoculating wounded tomatoes: Following wounding of fruits, carefully inoculate 5 µl of 1 × 105 spores/ml pregerminated spore suspension on top of each wound (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0005]). Deposit inoculum onto wound surface; do not inject inside fruit. Shake spore suspension frequently (after every third or fourth fruit inoculation) to ensure that spores do not sediment. After all fruits have been inoculated, seal lid tightly onto the propagator tray using Parafilm (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0006]).\nInoculum usually remains visible as a droplet on top of the wounds up to 1 day post inoculation (DPI; Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0005]).\nSealing trays is important for biosafety reasons and to maintain high levels of humidity within the tray.\nHandle containers with inoculated tomatoes very carefully to ensure that spore suspension droplets remain on top of each wound. The less handling the better.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e03cee01-5f5e-4041-8949-113f69b6f0fe/cppb20108-fig-0006-m.jpg</p>\nFigure 6\nFungal susceptibility test. (A) Storage of inoculated tomato fruits in a controlled environment cabinet in sealed containers. (B) Optional adjustment of light intensity using sheets of white paper.\n8. Incubate trays with tomatoes for 3 days at 20°C and 70% humidity with a 12-hr light/12-hr dark cycle at 70% light intensity (∼270 µmol) in a controlled environment room or cabinet. Cover lid of each propagator tray with a sheet of white paper to reduce light intensity (Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0006]) if the lighting level of the incubator cannot be adjusted to ∼270 µmol.",
    "9. Measure and record lesion size (width and height) at 3 DPI using a caliper (Fig. 7A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0007]). Score and record lesion aspect (e.g., presence or absence of mycelium growth on fruit surface; Fig. 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-fig-0007],C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0007]). Combine data with information previously collected on fruit color, texture and softness, age (e.g., 14 to 17 days after breaker), and weight (see step 3). Analyze data and combine for at least 10 biological replicates. Compare to well-characterized, control genotypes.\nLesions are usually circular or ovoid soft tissue areas with a noticeable color change around the wounding point.\nFruit volume (height × width × depth) can be used as an alternative to weight, but determining fruit volume is more labor intensive.\nAs an order of magnitude, lesions of S. lycopersicum cv. M82 have a diameter of ∼15 mm at 3 DPI. Expect limited to no fungal growth for fruits from tolerant or resistant genotypes; expect lesions exceeding 20 mm for (very) susceptible genotypes.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ab57e772-da4b-4622-a665-8478f227c29b/cppb20108-fig-0007-m.jpg</p>\nFigure 7\nFungal susceptibility test. (A) Digital caliper used to measure fungal lesions. (B) Lesions on tomato fruits 3 days after wound inoculation. The width and height (white dotted arrows) of each lesion (white dotted circle) are measured. (C) Examples of lesions on different types of tomato fruits. Mycelium developing on certain wounds is indicated by a white arrow, and some lesions are highlighted with a dotted circle.\n10. Dispose of tomato fruits inoculated with Botrytis and other contaminated consumables (i.e., 40-cell plant potting tray) according to best laboratory practice (i.e., double bagged, treated as BSL 2 waste, and autoclaved). Treat propagator trays and lids that have not been in direct contact with tomatoes using bleach, and rinse with water.",
    "Experiments with the pathogen B. cinerea can be carried out only in designated laboratories holding a license approving work with BSL 2 pathogens.",
    "Here we report a protocol for the isolation of Botrytis spores used as an inoculum for fruit wound inoculations based on the methods described in Schoonbeek, van Nistelrooy, and de Waard (2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0010]); Stefanato et al. (2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0011]); and Zhang et al. (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0015]).\nMaterials\nB. cinerea strain B05.10 in 15% (v/v) glycerol, stored at −80°C (see Schoonbeek et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0010]; Stefanato et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0011]; Zhang et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0015])\nPotato dextrose agar (PDA) solid medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-rec-0002])\nMalt extract yeast agar (MEYA) solid medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-rec-0001])\nTween 80 (e.g., Sigma-Aldrich, cat. no. P4780)\nSterile distilled water\nPotato dextrose broth (PDB) liquid medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-rec-0003])\n20°C, 70% humidity incubator with 12-hr light/12-hr dark cycle, 70% light intensity\nScalpel with no. 11 blade (e.g., R&L Slaughter, cat. nos. 233-5454 and 233-5334)\nFine forceps, no. 5 (e.g., TAAB Laboratories Equipment, cat. no. T083)\nMicropore tape (e.g., 3M, cat. no. 1530-0)\nL-shaped spreader, sterile (e.g., StarLab, cat. no. E1412-1005)\n5-ml pipette tip (e.g., StarLab, cat no. E1070-2596) plugged with glass wool (e.g., Sigma-Aldrich, cat. no. 18421)\n15-ml centrifuge tube, disposable, sterile (e.g., Corning, cat. no. 430790)\nBenchtop centrifuge (e.g., Eppendorf Centrifuge 5810)\n1.5-ml microcentrifuge tube\nHemocytometer (e.g., Thoma cell counting chamber; 0.0025-mm2 mini squares, 0.1 mm-depth)\nCAUTION: Perform all steps involving Botrytis macrospore inoculum in a laminar flow hood suitable for working with BSL 2 pathogens.",
    "1. Culture a 15% glycerol stock aliquot of fungal pathogen B. cinerea strain B05.10 on PDA solid medium at 20°C with a 12-hr light/12-hr dark cycle. After 1 week, cut three small agar blocks (about 0.02 cm3) with B. cinerea mycelium from the PDA solid medium, and using fine forceps place blocks upside-down (i.e., mycelium against medium) onto MEYA solid medium. Incubate mycelium for about 10 to 14 days at 20°C with a 12-hr light/12-hr dark cycle until sporulation is observed. Plates are sealed with micropore tape.\nTo prepare a 15% glycerol stock of B. cinerea strain B05.10, use freshly isolated spores resuspended in water (see step 2), and add sterile glycerol to a final concentration of 15% (v/v). For example, add 150 µl sterile 100% glycerol to 850 µl spores suspended in water. Make several aliquots of the glycerol stock, and store at –80°C until use. Avoid freeze–thaw cycles.\nTo inoculate PDA plates, the glycerol stock aliquot needs to be completely thawed as spores sediment to the bottom of the tube.\n2. Isolate spores (macroconidia):\n         \nFlood B. cinerea mycelium developed on a MEYA plate (step 1) with 10 to 15 ml water containing 0.05% (v/v) Tween 80.\nCarefully scrape surface of mycelium with a sterile L-shaped spreader to detach spores.\nAt this point, a color change from light to dark gray is observed.\nPipette out crude spore suspension, and filter through a 5-ml pipette tip plugged with glass wool placed into a sterile 15-ml centrifuge tube.\nCentrifuge filtered suspension 5 min at 129 × g, 20°C, and then carefully discard supernatant.\nResuspend pelleted spores in 10 ml sterile water, and count spores using a 10-fold diluted aliquot in a hemocytometer.",
    "Centrifuge spores 5 min at 129 × g, 20°C, and resuspend in sterile water to adjust the concentration to 2.5 × 107 spores/ml (final stock solution) in 1.5-ml microcentrifuge tubes.\nSpore stocks can be kept in water at 4°C for about 2 weeks. Minimize exposure to room temperature to prevent spore germination in a non-nutrient solution.\n3. For fruit inoculum, dilute 2.5 × 107 spores/ml spore stock solution in 0.25× PDB liquid medium to 1 × 105 spores/ml (e.g., 40 µl spore stock suspension in 10 ml of 0.25× PDB).\nThe spore suspension concentration can be adapted to fruit size; that is, small fruits such as S. lycopersicum cv. MicroTom fruits can be inoculated with a half-strength suspension of 5 × 104 spores/ml (Zhang et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-bib-0015]). However, when a range of genotypes is compared, it is recommended to use the same spore concentration across the entire experiment.\n4. Preincubate B. cinerea spores in 0.25× PDB liquid medium for 1.5 to 2 hr at room temperature with occasional shaking (i.e., tilting inoculum tube every 30 min) to stimulate and synchronize spore germination.\nFollowing pregermination, the spore suspension can be used to inoculate surface-cleaned and wounded tomato fruits (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0003] step 7).\nFor small-scale experiments, there is generally enough time to clean and prepare fruits (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20108#cppb20108-prot-0003] steps 4 to 6) while the spores are pregerminating. For large-scale experiments, several batches of spore pregermination need to be timed to coincide with batches of fruit inoculation."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}