{
  "id": 7657,
  "origin_website": "Bio",
  "title": "TRACES: a Freely Accessible, Semi-automated Pipeline for Detection, Tracking, and Quantification of Fluorescently Labeled Cellular Structures",
  "procedures": [
    "Cell culturing and induction of protein expressionSeed approximately 6 × 104–9 × 104 cells to each chamber of a 35-mm glass bottom dish. Allow cells to attach onto the dish. Maintain cells with appropriate media in a humidified incubator supplied with 5% CO2 at 37 °C.Note: Tet-ON-GFP-PCNT (854–1960) cells, an RPE-1 derived cell line that expresses GFP-tagged PCNT (residues 854–1960) through doxycycline induction, are used in our study (Jiang et al., 2021). Tet-ON-GFP-PCNT (854–1960) cells also stably and constitutively express mScarlet-i-H2A and miRFP670-CETN2, which label the nucleus and centrosome, respectively. Cells are maintained in DMEM/F12 media supplemented with 10% tet-negative FBS and 1× penicillin-streptomycin solution. Allow cells to reach 40–60% confluency (12–18 h post seeding for most cultured human cells) before imaging.Note: For best object tracking results, seed cells at a low density and distribute them evenly on the coverslip to minimize overlapping of cells. Optional: for doxycycline-inducible cell lines, incubate cells with 1 µg/mL doxycycline hyclate (Dox) to induce transgene expression before the start of time-lapse microscopy (e.g., 3–4 h in our case).Time-lapse image acquisitionNote: When performing live cell imaging with multiple fluorophores, it is important to select appropriate wavelength ranges, emission filters, and dichroic mirrors to minimize spectral bleed-through artifacts. Appropriate laser power, exposure time, and acquisition intervals should also be empirically determined to maximize the signal-to-noise ratio while minimizing photobleaching, especially over a long period of time-lapse imaging. We also recommend centering the cell(s) of interest in the field of view to prevent them from moving out of the field during imaging. Below are the time-lapse image acquisition settings we use in our system (Andor Dragonfly spinning disk confocal system).",
    "Using our current algorithm, TRACES can track up to three fluorescently labeled object types simultaneously, if one of the objects can be used to define the location of the cell over time (e.g., a fluorescently labeled nucleus such as mScarlet-i-H2A in Figure 1; other markers that label the cell membrane or other organelles can also be used). We use a series of images captured during the formation and movement of PCNT condensates as an example to demonstrate the TRACES workflow in this protocol (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4479/bioprotoc-12-15-4479-g001.jpgFigure 1. Examples of live-cell image acquisition. Time-lapse micrographs of Tet-ON-GFP-PCNT (854–1960) cells. Imaging started around 4 h post Dox induction. The time when the first condensates formed is marked as time 0. Note that GFP-PCNT (854–1960) forms phase-separated condensates that coalesce and move toward the centrosome (denoted by the magenta arrowheads and enlarged in insets). Scale bars: 20 µm and 2 µm (insets).Environmental control: Mount cells in a humidified chamber supplied with 5% CO2 inside a wrap-around environmental incubator with temperature set at 37 °C (for most cultured mammalian cells).Note: Allow the microscope system to reach the desired temperature equilibrium before imaging. Camera: iXon Ultra 888 EMCCDNote: To minimize phototoxicity over long-term live imaging, we recommend empirically determining the lowest laser power and exposure time that can generate images with at least 2–3 signal-to-noise ratios for objects of interest. Using a highly sensitive camera, such as the one equipped with electron multiplying charge coupled device (EMCCD), is also desirable. Objective: 63×/1.40 (magnification/numerical aperture) coupled with a 1× motorized magnification changerLaser power: 1–10% of 50–100 mW lasersExposure time: 100–200 msGain: 200Pinhole size: 40 µmZ-stack interval: 0.6 µmFor assessing colocalization or analyzing relative spatial distribution between fluorescently labeled structures, acquire all channels for each z-stack from the longest to the shortest wavelength.",
    "Note: We also recommend setting a wide enough z-range, to account for the possibility that cells may drift out of focus during long-term imaging. Acquisition time interval: 2–4 minNote: Users need to optimize imaging parameters according to their specific imaging system, experimental design, and structure(s) of interest."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}