{
  "id": 9501,
  "origin_website": "Jove",
  "title": "Targeted Labeling of Neurons in a Specific Functional Micro-domain of the Neocortex by Combining Intrinsic Signal and Two-photon Imaging",
  "procedures": [
    "1. Surgical Preparation\nInduce anesthesia and continuously monitor heart rate, end tidal CO2, EEG, and temperature. All procedures were approved by the Institutional Animal Care and Use Committee of the Medical University of South Carolina and were based on those we previously published9,15.\nExpose the dorsal surface of the skull by cutting the skin with a scalpel blade. Dissect the connective tissues overlying the bone using a Brudon curette. Clean the bone using cotton tipped applicators and cotton gauze. Apply bone wax (as needed) to the skull, to stop occasional bleeding through small emissary veins.\nAttach a titanium or stainless steel head plate to the skull (over the region of interest where the craniotomy will be performed) by using dental cement mixed with black paint (see Materials). A rectangular opening in the center of the head plate provides access for the craniotomy and optical imaging. Attach a metal chamber on top of the head plate. This chamber will serve as a fluid reservoir for imaging with the water immersion objective lens.\nSecure the head plate to an xy stage using metal posts.\nThin a large area of the bone within the rectangular opening of the headplate by using a dental drill. The area to be thinned must extend well beyond the boundaries of the planned craniotomy. The thick skull of non-rodent mammals must be thinned if high-resolution images are to be acquired from the neocortex because at the craniotomy site, the thickness of bone will dictate the thickness of the agarose between the coverglass and neocortical surface (see below).",
    "Drill a 2 x 2 mm square outline in the bone for the craniotomy. Rinse the chamber periodically with fresh artificial cerebrospinal fluid (ACSF) to remove bone shards and minimize heat dissipation to the underlying cortex. Apply bone wax as needed, to stop occasional bleeding.\nLift the bone flap with a #3 forceps.\nRemove all but the bottom layer of dura using a fine forceps (#5CO) and Vannas spring scissors. The dura in non-rodent mammals is thick and opaque but can be removed in distinct layers. Bleeding is rare but can be stopped with Gelfoam and any blood residue should be gently removed from the remaining layer of dura using forceps and rinsing with ACSF. The final layer of dura is transparent and pial vessels should be clearly visible through it. Leaving this final layer of dura intact during intrinsic signal imaging will increase the success rate of bulk loading of fluorescent calcium indicators for the subsequent two-photon imaging phase of the experiment (see Discussion).\nApply a drop of warm 2% agarose (dissolved in ACSF) and immediately place a coverglass over the craniotomy. Check the craniotomy to ensure that respiratory and cardiovascular pulsations are minimal by using a surgical dissecting microscope or the oculars of the two-photon microscope in bright-field mode.\n2. Intrinsic Signal Optical Imaging\nAdd gel-foam soaked with ACSF around the outside of the coverglass to prevent the agarose from drying during intrinsic signal imaging.",
    "Attach the intrinsic signal imaging CCD camera to the standard C-mount port on top of the two-photon microscope (Figure 1). Place the illuminating light source on the air table near the xy stage (Figure 1A). Position and secure the light guides over the craniotomy and headplate/chamber (Figure 1B). Retract the primary dichroic and the mirror below the C-mount port so that the reflected red light needed for intrinsic signals will pass directly from the craniotomy to the CCD camera (Figure 1C-D). Using the 4x air objective (0.13 NA, 17 mm WD), a 2 x 2 mm field of view is available for intrinsic signal imaging.\nInsert a heat filter in the light path to prevent the cortex from heating. Use a filter that passes green light (546 nm center λ) and record a digital reference image of the cortical surface blood vessels.\nMove the z focus to 500 μm below the cortical surface. Use a red filter (630 nm center λ) to illuminate the cortex for measuring intrinsic signals. Position the light guides such that the cortical surface is uniformly illuminated. Shield the craniotomy from the light produced by the visual stimulus display. Present a sequence of visual stimuli and record reflectance data images. To generate an orientation map within 10 min, collect data corresponding to 4 repetitions of a sequence of 8 stimuli (4 orientations and two directions for each orientation).",
    "Analyze the intrinsic signal data to generate a false color orientation map. Select potential target regions for two-photon labeling of neurons, e.g., orientation pinwheel singularities - points in the map where all preferred orientations converge (Figure 2A). Overlay the orientation map and the image of the cortical surface vasculature (Figure 2B-C). Use the layout of functional domains and the location of large surface vessels to select a target, avoiding locations with large blood vessels and arterioles15.\n3. Bulk Loading of Fluorescent Calcium Indicators\nPrepare a solution of 20% Pluronic/DMSO by adding 1 g Pluronic in 5 μl DMSO. Heat the mixture at 60 °C for 10 min to completely dissolve the Pluronic. Allow the mixture to cool to room temperature. Add 4 μl of the Pluronic/DMSO mixture to a 50 μg vial of the fluorescent calcium indicator Oregon Green 488 Bapta-1 AM (OGB-1 AM). Then add 1 μl of a red dye (Alexa Fluor 594, 2 mM stock solution) and 35 μl of pipette solution (see Materials) for a final concentration of 1 mM OGB-1 AM. Sonicate the solution for ½ hr in a chilled water bath and then centrifuge with a 0.45 μm filter to remove impurities.\nPull a long taper pipette with an outer tip diameter of 2.0-2.5 μm. Load 5 μl of the dye mixture into the pipette.\nRemove the final layer of dura to facilitate pipette insertion and obtain the highest quality two-photon images.",
    "Determine the exact location on the cortical surface that the pipette must be placed in order to reach its target in cortical layer 2/3. Our predetermined cortical target is a pinwheel singularity in the orientation map (Figure 2). The pipette must be driven into the cortex at a 30° angle to pass between the chamber wall and the objective. Thus, to label the target region 200 μm below the cortical surface, the pipette entry position on the cortical surface will be approximately 350 μm lateral to the target position (Figure 3 A-B).\nMove the xy stage (on which the animal and the pipette micromanipulator are placed) to center the cortical surface entry position under the objective (Figure 3C). Use a 20x or 40x objective with a working distance (WD) of at least 3 mm (see Materials) to ensure that the pipette will easily enter the cortex without touching the objective or the bone along the wall of the craniotomy. Once the entry position is centered under the objective, raise the Z position of the objective by 2 mm (Figure 3D). With the green epi-fluorescence light turned on to visualize the red Alexa dye in the pipette, use the diagonal axis of the micromanipulator to move the pipette until its tip is centered (and focused) under the objective directly above the cortical surface entry position (Figure 3E).",
    "Lower the pipette vertically (along the z axis) until the pipette reaches the cortical surface (Figure 3F), while continuously viewing the pipette tip through the oculars of the microscope. Using bright-field illumination, the cortical surface blood vessels and remaining meningeal membranes (pia and arachnoid) are easily visible as the pipette approaches the cortical surface. If the pipette does not reach the desired entry position, raise the pipette and recalibrate targeting based on the vascular landmarks on the cortical surface.\nRemove the objective, wick excess cerebrospinal fluid from the craniotomy and dry the adjacent bone using lint-free absorption spears. Apply a drop of warm 3% agarose (dissolved in ACSF) to stabilize the cortex that is visible through the craniotomy (Figure 3G). In non-rodents, 3% agarose is necessary to dampen pulsations for successful uptake of fluorescent dyes by neurons. For intrinsic signal optical imaging only 2% agarose is needed because the combination of 2% agarose and the coverglass provides the necessary stability. Here, no coverglass is used for the dye-loading step so 3% agarose is necessary. After the agarose has solidified, insert a 40x objective (0.8 NA, 3.3 mm WD) and re-fill the chamber with ACSF.\nSwitch from bright-field to two-photon viewing and locate the pipette tip. Using the diagonal axis of the micromanipulator, move the pipette until its tip reaches the desired depth in the cortex (Figure 3H). Occasional pressure ejection puffs of the dye mixture (a few psi, each pulse 0.1 sec) will help prevent the pipette tip from clogging. Because OGB-1 AM only becomes visible upon entering cells, the red Alexa dye is critical for visualization of the pipette tip inside the cortex.",
    "Before attempting to load neurons in cortical layer 2/3 with the full dose of dye, re-focus the objective on the cortical surface to confirm the depth of the pipette tip and ensure that the tip is in the target location based on the layout of surface blood vessels. If the pipette is in layer 2/3, small puffs of the dye mixture should illuminate the extracellular space and reveal a dense assembly of circular cell bodies as dark shadows.\nFor loading neuronal cell bodies in a sphere of cortex 300-600 μm diameter, inject the dye mixture into the extracellular space using 30-90 pulses, each pulse 1.0 sec, 2-10 psi. The pulses of pressure should not be so strong that the tissue moves. After the injection is complete, wait a few min, then remove the pipette and objective. Wait for 1 hr to allow the OGB-1 AM to be fully taken-up by neurons.\nRemove the agarose used for the dye loading and rinse the recording chamber. Put a small drop of 2-3% agarose on the surface and quickly place a coverglass over the craniotomy. Because the fluorescent dyes are light-sensitive, avoid over-exposing the cortex to bright-field or epi-fluorescent light. Insert a high NA (1.0) 20x objective into the objective holder and re-center the labeled cortical region under the objective using the xy stage. Shield the craniotomy from extraneous light sources, e.g., visual stimulus display, using multiple layers of blackout material.\n4. Single-cell Electroporation of Fluorescent Dyes\nFor studying dendritic morphology, prepare a solution of 100 μM Alexa Fluor 594 (1:20 dilution in ACSF of 2 mM Alexa Fluor 594 stock). For functional imaging of dendrites an OGB salt may be used16,17.",
    "Pull a long taper pipette with a tip size of 1 μm and load 5 μl of dye into the pipette. All other steps of targeting a functional domain are identical to the bulk loading method (Figures 1-3). To position the pipette tip adjacent to a neuronal cell body membrane, monitor the increase in electrode impedance and apply pressure puffs of dye to illuminate the extracellular space and see cell bodies as shadows during two-photon imaging.\nWhen the pipette tip is adjacent to a neuronal cell body membrane, use the Axoporator 800A to apply 1-3 pulses (-8 to -10 V, 10 msec pulse). The immediate filling of the neuron with dye is readily visualized with two-photon microscopy. Remove the pipette and collect high-resolution images of dendrites and axons in vivo.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}