{
  "id": 12954,
  "origin_website": "Jove",
  "title": "The Treadmill Fatigue Test: A Simple, High-throughput Assay of Fatigue-like Behavior for the Mouse",
  "procedures": [
    "This procedure was approved by the National Institute of Diabetes and Digestive and Kidney Diseases Animal Care and Use Committee.\n1. Preparation\nTo allow for rapid identification of each mouse prior to testing, tattoo the tails of all mice to be trained and tested with identifying marks.\n\tNOTE: This step is optional. Permanent marker or other methods of identification can be used as an alternative to tattooing.\nPrior to training and testing mice, ensure that the treadmill is on a flat surface and set to the treadmill to desired angle of inclination (recommended angle of inclination: 10°, to be kept consistent throughout training and testing) and set the electric shock frequency and intensity appropriately (recommended: 2 Hz, 1.22 mA).\n\tNOTE: The electric shock used should produce no more than a mild tingling sensation when touched by an ungloved finger and should be delivered in a pulsatile fashion (with each shock lasting 200 msec).\nPlace a clean sheet of butcher's paper or an absorbent pad under the treadmill to collect fecal boli and urine during training and testing.\nPlace a sheet of paper or an absorbent pad over the third of the treadmill housing (i.e., the clear plastic lid that covers the treadmill lanes) furthest from the shock grid.\n\tNOTE: This step is optional, but will create a darker space and may provide additional encouragement to avoid the lower portion of the treadmill.\nIf planning to use a wire brush to provide additional motivation during training, ensure that one is readily available prior to beginning training sessions.\nEnsure that any drug or method for inducing and/or alleviating fatigue is available and can be prepared or performed during Step 2.14.\n2. Training Mice to Use the Treadmill",
    "NOTE: Training is necessary to ensure that mice are familiar with the treadmill and task and can perform appropriately when tested. If the majority of mice being trained are receiving frequent shocks or otherwise performing poorly during any training session, additional training sessions should be performed. On the first day, most mice will be shocked several times. By the second day of training, mice should be rarely making contact with the grid. If a mouse displays consistently poor training performance, it should be removed from the study. For female C57BL/6NCr mice, this is a rare occurrence (less than 1% have been removed from studies due to poor training performance), but it should be noted that other strains may perform differently during training.\nWith the treadmill off (and speed set to 0 m/min), individually lift the mice by the tail and place mice into separate lanes of a mouse treadmill. Promptly turn on the corresponding grid after placing each mouse on the treadmill. Ensure that mice are placed directly on the treadmill belt.\n\tNOTE: The amount of time and distance each mouse is held by its tail should be minimized by placing the cage near the treadmill prior to transferring mice to the treadmill and/or allowing mice to stand on a solid platform (e.g., a wire cage lid) until they are near the treadmill and the experimenter is ready to place them in the treadmill.\nAllow mice to freely explore the treadmill for 1-3 min or until each mouse has explored its lane and/or received at least one shock from the grid.",
    "Turn on the treadmill and slowly increase the speed until it begins moving (approximately 1.5 to 3.0 m/min). Monitor all mice to ensure that they begin walking. If a mouse does not begin walking or walks toward the shock grid, be prepared to intervene by tapping the mouse with a wire brush or tail tickling.\nSlowly increase the treadmill speed to 8 m/min. Start a timer and continue monitoring behavior.\nIncrease treadmill speed to 9 m/min at 5 min, 10 m/min at 7 min, and stop the treadmill at 10 min.\nAllow the mice to briefly explore the treadmill, then remove and return each to its cage.\nClean the treadmill and grid with alcohol and replace the paper or absorbent pad beneath the treadmill.\nTo train additional mice, repeat Steps 2.1 through 2.7.\n\tNOTE: Allow alcohol to dry prior to placing new mice on the treadmill.\nOn the second day of training, repeat Step 2.1. Turn on the treadmill and increase the speed to 10 m/min. Start a timer.\n\tNOTE: Treadmill speed can be increased more rapidly than on the first day of training.\nIncrease treadmill speed to 11 m/min at 5 min, 12 m/min at 10 min, and stop the treadmill at 15 min.\nRemove mice and return them to their cages.\nClean the treadmill and grid with alcohol and replace the paper or absorbent pad beneath the treadmill. To train additional mice, repeat Steps 2.9 through 2.12.\nPerform additional days (3 days) of training in the same manner as the second day.",
    "NOTE: This step is optional, but is strongly recommended if most or all mice (of the same sex and strain) being trained display difficulty with the task. Mice can generally perform well in Step 3 when they have been trained for 3 days (i.e., with one additional day of training), although additional or fewer days of training may be appropriate depending on their performance during the second training day and the duration of Step 2.14.\nAllow at least one full day to pass in which the mice have no exposure to the treadmill before proceeding to Step 3.\n\tNOTE: Any drug(s) used to induce and/or alleviate fatigue should be administered during this step.\n\tNOTE: This time period can be varied in length and used to induce fatigue and/or test interventions to reduce or eliminate fatigue. If testing mice more than 7 days after completing training, a pilot study is recommended to verify that the mice used will perform during testing.\n3. Treadmill Fatigue Test\nNOTE: In this test, fatigue-like behavior is defined as spending 5 consecutive seconds in the \"fatigue zone\". The fatigue zone is defined as the region encompassing the portion of the treadmill belt within approximately 1 body length of the shock grid as well as the grid, itself. Prior to testing, ensure that the point delineating this zone is clear to the experimenter, such as by applying a mark to the top or side of the treadmill lanes.\nSet the treadmill speed to 12 m/min. Do not start the treadmill. Ensure that shock grids are turned off.\nIndividually place mice into separate lanes of the treadmill. Turn on the corresponding grid immediately after placing each mouse on the treadmill.\nSimultaneously start the treadmill and a stopwatch.",
    "NOTE: Do not intervene during testing except to remove mice that meet the criterion for removal (see Step 3.5).\nIncrease treadmill speed as indicated in Table 1. Carefully observe all mice throughout the test.\n\tNOTE: The treadmill speeds listed in Table 1 were selected based on observations from adult female C57BL/6NCr mice. Higher treadmill speeds may be appropriate for larger (e.g., outbred CD-1 mice) or more athletic mice.\nIf a mouse remains in the fatigue zone for 5 continuous sec, promptly remove the mouse from the treadmill and record the duration and distance it ran.\nWhen no mice remain on the treadmill, stop the treadmill. Clean the treadmill and grid with alcohol and replace the paper or absorbent pad beneath the treadmill.\nTo test additional mice, repeat Steps 3.1 through 3.6.\n\tNOTE: This step is optional.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}