{
  "id": 15101,
  "origin_website": "Jove",
  "title": "Dissection of Drosophila melanogaster Flight Muscles for Omics Approaches",
  "procedures": [
    "1. Staging the Pupae\nRaise flies of the desired genotype in bottles (Figure 1E). Either make a fresh flip of the dissection stock or set a cross with at least 20 female virgin flies. Maintain bottles until the flies begin to pupate.\nCollect pre-pupae with a wetted paintbrush and transfer to wetted filter paper in a 60 mm Petri dish (Figure 1F).\nSex the pupae, collecting the appropriate gender for the experiment (Figure 1G). Males are identified by the presence of testes, which appear as translucent balls in the otherwise opaque pupa.\nLabel the Petri dish with the time, date, and genotype, then age the pupae to the desired stage (Figure 1H).\nNOTE: Maintain crosses/stocks and age pupae in a temperature-controlled incubator (i.e., 25 °C or 27 °C for RNAi crosses, as increased Gal4 activity at higher temperatures increases knock-down efficiency40). Ensure that the humidity is sufficiently high so pupae do not dry out when aging several days.\n2. IFM Dissection Before 48 h APF\nAssemble the necessary equipment including two #5 biology grade forceps, a pipette, pipette tips, dry ice, and (for RNA samples) isolation reagent (see Table of Materials). In addition, chill black dissecting dishes (see Table of Materials), 1x phosphate-buffered saline (PBS) buffer, and 1.5 mL microcentrifuge tubes on ice.\nUsing a wetted paintbrush, transfer staged pupae to a black dissecting dish filled about two-thirds with cold 1x PBS (Figure 2A,B). Move to a fluorescent dissecting microscope.\nNOTE: Use as many pupae as can be dissected within a 30 min time window. Depending on experience, this ranges from 3–15 pupae. See Supplemental Methods for discussion of alternatives to black dissecting dishes.",
    "Using #5 forceps, push one of the pupae to the bottom of a black dissecting dish and adjust the microscope zoom and focus to clearly see the pupa (Figure 2C).\nGrasp the anterior of the pupa with one forceps (Figure 2D), then poke the pupae with a single tip of the other forceps slightly off-center in the abdomen, just behind the thorax. This holds the pupa in place and prevents the IFMs from moving into the abdomen (Figure 2E).\nNOTE: Begin timing the length of dissection from this point, as soon as pupal integrity is disrupted. Use a defined length of dissection (for example 20–30 min) to minimize muscle death and associated transcriptomic and proteomic changes. Dissect as many flies as possible in this period of time.\nUsing the first forceps, remove the anterior half of the pupal case (Figure 2F).\nUse the same forceps to pinch the exposed pupae just behind the thorax, and separate the abdomen from the thorax (Figure 2G).\nUsing the forceps, gently squeeze the anterior part of the thorax (for <35 h APF) or rip open the thorax to expose the fluorescently labeled IFMs (Figure 2H). IFMs will easily detach from the epidermis, as tendon attachments at early timepoints are fragile. Discard the remaining carcass using forceps to push it to the opposite side of the dish.\nRepeating steps 2.3–2.7, dissect additional pupae.\nCollect the IFM fibers with forceps and organize them into a pile at the bottom of the black dissecting dish (Figure 2I,J). Remove any debris by pushing it out of the field of view using forceps.",
    "NOTE: With practice, forceps tips can be brought into close proximity without touching each other. This technique can be used to loosely grab IFMs without destroying them. Alternate methods include gently pushing or lifting the IFMs with a single tip or completely closed forceps, or taking some fat or other tissue with the IFM and removing the fat as described in step 2.10.\nQuality control the IFM muscle sample, using the forceps to remove non-IFM muscles, fat, cuticle, etc. from the sample (Figure 2K,L).\nNOTE: With Mef2-Gal4, IFM is labeled more strongly than other muscle types at early timepoints (Figure 2K,K'), allowing removal of jump muscle and larval muscles based on fluorescence intensity and muscle shape. Fat and cuticle tissue look different and are not labeled by a muscle-specific fluorescence label (Figure 2K,K'). See the discussion section for other Gal4 lines that label IFM.\nUsing a clipped pipette tip, transfer the pile of IFMs into a 1.5 mL microcentrifuge tube filled with 250 μL of chilled 1x PBS (Figure 2M-O). Proceed immediately to section 4.\nNOTE: IFM samples may be lost simply by sticking to the side of the pipette tip. Pipetting buffer up and down several times before collecting IFMs can make standard tips less sticky, and siliconized or perfluoroalkoxy (PFA) tips (see Table of Materials) with lower surface tensions can help prevent sample loss.\n3. IFM Dissection After 48 h APF\nAssemble necessary equipment including two #5 biology grade forceps, fine scissors, standard glass microscope slides, double-stick tape, pipette, pipette tips, dry ice, and (for RNA applications) isolation reagent (see Table of Materials). Chill the 1x PBS and microcentrifuge tubes on ice.",
    "Using a lightly wetted paintbrush, transfer the staged pupae to a strip of double-sided sticky tape mounted on a microscope slide (Figure 3A). Place the pupae in a line oriented in the same orientation (ventral down and anterior towards the bottom of the slide).\nNOTE: Be careful not to use too much water on the paintbrush or filter, or the pupae will not stick well. If pupae do not stick, dry them by first transferring to a dry filter or tissue paper. Mount as many pupae as can be dissected within a 30 min time window, ideally ~10 pupae.\nRemove the pupa from the pupal case. Use forceps to tease apart and open the pupal case above the anterior spiracles (Figure 3B).\nGently slide a pair of forceps dorsally towards the posterior, cutting the pupal case as the forceps move (Figure 3B'). Be careful not to rupture the underlying pupa. Liberate the pupa from the opened case and immediately transfer it to a drop of 1x PBS on a second microscope slide (Figure 3B\",C).\nRepeat steps 3.3 and 3.4 for all pupae in the line, then set the double-stick tape slide aside.\nUsing the fine scissors, cut the abdomen of the pupa away from the thorax and push it into a separate pile (Figure 3D,D'). Repeat for the remaining pupae.\nNOTE: Begin timing the length of dissection with step 3.6, as soon as pupal integrity is disrupted. Dissect as many flies as possible in 20–30 min to prevent cell death and associated transcriptomic and proteomic changes. When dissecting 1 d adults or >90 h pupae, it is often convenient for later steps to additionally remove the head with the fine scissors.",
    "Using a tissue paper, remove the majority of the 1x PBS (generally cloudy with suspended fat) as well as the pile of abdomens (Figure 3E). Add a drop of fresh, chilled 1x PBS to the remaining thoraxes.\nUse the scissors to cut the thorax in half (Figure 3F,F') by cutting from the head down the longitudinal body axis in a single motion. Alternately, if the head has been removed, first insert the scissors where the head was attached and cut the top half of the thorax longitudinally between the IFMs. Then, cut the ventral side of the thorax with a second cut in the same orientation.\nRepeat steps 3.7 and 3.8 for all pupae to be dissected, generating a pile of thorax hemisections near the center of the slide. Ensure there is enough chilled 1x PBS on the slide so that the hemisections do not dry out.\nNOTE: After 48 h APF, IFMs are large enough to be visible under a standard dissecting microscope to the trained eye. At this point in the protocol, muscles with a fluorescent label can be moved to a fluorescent dissecting scope to aid in IFM identification or for training purposes, but this is not necessary.\nDissect the IFMs out of the thorax. Isolate one of the hemisections using the #5 forceps (Figure 3G,H). Gently insert the tips of one forceps above and below the middle of the IFMs (Figure 3G',H'). While holding the first forceps still, use fine scissors to cut one end of the IFM away from the cuticle and tendons. Then, cut the other end of the IFM free from the cuticle (Figure 3G'',H'').",
    "NOTE: Depending on the orientation of the thorax after the first IFM cut, it is useful to rotate the thorax 180° so that the second IFM cut is easier to perform.\nRemove the IFM bundle from the thorax with forceps (Figure 3G''',H'''), transferring it to the edge of the PBS bubble to use water tension to hold it in place (Figure 3I). Push the carcass to the opposite side of the slide. Repeat for the remaining thorax hemisections, generating a collection of dissected IFMs.\nNOTE: If the IFMs do not stay in a neat pile, remove some of the 1x PBS with a tissue. Be careful not to let all of the PBS evaporate, and ensure that the dissected IFMs and hemithoraxes remain covered by buffer.\nAfter dissecting all IFMs, quickly perform a quality control on the dissected muscle. Using #5 forceps, remove any jump muscle or cuticle fragments that may have found their way into the sample (Figure 3J-K'').\nNOTE: Jump muscle appears different from IFM. If dissecting Mef2-Gal4 labeled muscle under fluorescence, jump muscle has a weaker fluorescence and a different shape and texture. Under normal light, it appears nearly translucent while the IFMs are an opaque, milky yellow (Figure 3J-J'',K).\nUsing water tension, capture (but do not squish) the dissected IFMs between a pair of forceps (Figure 3L). Transfer the IFMs to a 1.5 mL microcentrifuge tube pre-filled with 250 μL of chilled 1x PBS (Figure 3M). Proceed immediately with section 4.",
    "NOTE: When forceps tips are brought into proximity of each other and lifted out of a buffer solution, water tension causes a bubble of buffer to be captured between the forceps tips. If IFMs are also present in this bubble, they can be lifted out of the solution and easily transferred to another buffer-filled receptacle. It is important to squeeze the forceps to bring the tips near one another without touching each other, to avoid macerating the tissue captured in the buffer bubble.\n4. Pellet and Preserve the IFM Sample\nPellet the IFMs by centrifuging the 1.5 mL microcentrifuge tube for 3–5 min at 2,000 x g in a table-top centrifuge (Figure 4A,B).\nRemove the buffer using a pipette tip (Figure 4C).\nFor RNA applications, resuspend the IFM pellet in 50–100 μL of the desired RNA isolation buffer (see Table of Materials, Figure 4D). Otherwise, proceed to step 4.4.\nNOTE: IFMs can be dry-frozen after step 4.2 for mass spectrometry preparations or isolation of RNA with commercial kits (see representative results). For RNA applications, better results are obtained by immediately resuspending and freezing the IFM pellet in isolation buffer.\nFreeze sample on dry ice or snap freeze in liquid nitrogen (Figure 4E). Store at -80 °C until ready for subsequent steps in sample preparation for downstream analysis.\nNOTE: After cryopreservation, samples can be stored for several months before processing for downstream investigation."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}