{
  "id": 14087,
  "origin_website": "Jove",
  "title": "Early Metamorphic Insertion Technology for Insect Flight Behavior Monitoring",
  "procedures": [
    "NOTE: The source of the materials and reagents required to follow the protocol is provided in the “Reagents” Table below.\n1. Preparing Printed Circuit Boards (PCBs) for Recording Electrode Connection\nNOTE: In order to provide a practical experimental procedure, wire electrodes are soldered to a PCB to insert these electrodes into an FFC (flexible flat cable) connector.\nCut a 0.5x5 cm2 piece of copper clad laminate.\nUsing a fine tip marker, draw three 0.1x5cm2 rectangle pads as etching mask patterns.\nEtch the exposed laminate using a PCB etchant inside a ventilated area or fume hood. Cover about 1 cm of the laminate cutout’s length with non-reactive tape. Fill a graduated beaker with at least 100 ml of PCB etchant and tape the copper laminate cutout to the inside of the graduated beaker with scotch tape. Half of the copper laminate cutout should be submerged in the PCB etchant.\nPlace the beaker on a rotating platform for 20 min.\nRemove the cutout from the etchant and place it in a beaker filled with water for 10 min.\nUsing a tissue paper, apply isopropyl alcohol and remove the markings to expose the non-etched copper pads.\nCut the printed circuit board into smaller squares approximately 1 cm long.\nCut two pieces of coated, annealed, stainless steel wire (0.11” coated, 0.008” bare) using a sharp blade to lengths of 3 cm each. These pieces of stainless steel wire are the active electrodes that will be inserted into the thorax of the insect.\nUsing a blade, remove 4-5 mm of the plastic coating from each end of each wire. Use of a microscope is recommended.",
    "Cut one 0.7 cm piece of insulated stainless steel wire to create a tip extension for the ground electrode. Gently remove the coating with a blade or melt it with the heat of a soldering iron as performed in step 1.9.\nFor the ground connection, cut one piece of flexible (litz or inductor) wire to a length of 4.5 cm.\nSolder the 0.7 cm piece of stainless steel prepared in step 1.10 to the ground connection wire prepared in step 1.11. An exposed stainless steel tip should be at the end of the ground connection.\nTape the prepared electrode board firmly to the soldering workspace using a non-reactive tape. Use the tape to mask all but 1-2 mm of the pads on the board where the electrodes will be soldered. This masked, solder-free end of the pads will be inserted into the FFC connector described in step 4.1.\nAlign the three electrode wires such that one end of each can be soldered to the corresponding pads on the electrode board. Apply stainless steel flux across the electrode pads for easier soldering.\nSolder each of the exposed electrodes on the pads.\nImmerse the electrodes in acetone and isopropyl alcohol for 10 min each to clean the solder residues. Use of an ultrasonic bath improves the cleaning performance.\n2. Surgical Insertion to the Manduca Sexta Pupae\nNOTE: The insects will be most active during the transitions between day and night. Therefore, an artificial day/night cycle should be established within an insect chamber using automatic outlet timers. These should be set to simulate a 7 hr dark and 17 hr light cycle.\nExamine the Manduca sexta pupae daily to determine an appropriate insertion time. The pupae are ready for insertion approximately one day after the wings exhibit dark spots.",
    "To anesthetize the pupae, place them in the refrigerator (4C) for around 6 hr.\nPrepare the insertion workspace. The workspace should include isopropyl alcohol, sharp tweezers, blades, and a 30 G hypodermic needle. As an option, cyanoacrylate adhesive may be used to enhance the electrode fixation.\nSterilize the needle, tweezers, and the electrodes by dipping them into or wiping with isopropyl alcohol.\nRemove the pupa from the refrigerator and transfer it to the workspace.\nDetermine the location on the thorax that corresponds to the muscle group of interest. The focus of the work in this example is the dorsoventral muscles responsible for wing upstroke movement.\nUsing a sharp blade, gently scratch a 1x1 cm2 rectangle through the exocutical layer. Using the tweezers, slowly peel off these pieces.\n(Optional) Use a vacuum to remove wing hair from the exposed region of the thorax.\nSlowly insert the needle about 5mm into the mesothorax where the wings attach to the thorax to create two insertion points targeting the muscle group.\nUsing tweezers, guide the two recording electrodes into the two insertion points.\n(Optional) To enhance the mechanical durability, clean the hair around the electrodes and generously apply cyanoacrylate adhesive around each insertion point on the thorax with a wire applicator.\nPrepare a cage for emergence with proper material (rough and textured) covering the walls and ceiling so that the insect may climb upon emergence. Perforated cardboard boxes or packing paper may be used.\nPrepare a rigid fixation stick with around 6 cm length and 2 mm diameter. Plastic stirrers, a cotton swab, or metal wires can be used for this step.\nCarefully slide this stick through the hole underneath the protruding proboscis.",
    "Fix both sides of the stick on the cage surface such that the pupa cannot roll around. Position the pupa inside of the cage such that the mesothorax is facing up. Extensive movement may cause damage to the electrode, loss of hemolymph, or render the insertion useless.\n3. Inserting the Ground Electrode into Manduca Sexta\nNOTE: The ground (reference) electrode should be inserted into the abdomen or distal parts of the thorax to avoid signal coupling. This insertion can be done either during the later stages of the pupal development or after the insect emerges. The window for the ground electrode has to be prepared in the pupal stage for either a pupal or adult stage ground electrode insertion.\nFor pupal stage insertion: after peeling of the mesothoracic cuticle around the active electrode (see step 2.7), scratch another rectangle through the exocutical layer (around 0.5x0.5 cm2) on the dorsal abdomen close to the thorax using the 30 G hypodermic needle. Insert the ground electrode into this window using the technique described in section 2.\nFor adult stage ground electrode insertion: once the insect has emerged, place it in the refrigerator at 4 °C for 6 to 24 hr to immobilize.\n\tThe remaining steps are the same for both pupal and adult stage insertions.\nPrepare the insertion workspace including isopropyl alcohol, sharp tweezers, a 30 G hypodermic needle, cyanoacrylate adhesive, a piece of wire for application of glue, a thermal cauterizer (optional), and a dental wax stick (optional).\nLocate an insertion point approximately 1-2 cm away from the recording electrodes along the posterior abdomen.\nSlowly insert the needle to puncture the abdomen and provide an insertion site.",
    "Using tweezers carefully insert the ground electrode into the insertion site and apply pressure until it is 3-4 mm deep. Hold the electrode in place and use a wire to apply glue around the insertion site.\n(Optional) To enhance the mechanical strength, use the thermal cauterizer and collect a small (2-3 mm) bead of wax at the tip. Place the tip close to the insertion site and apply heat such that the wax surrounds the electrode and holds it firmly in place.\n4. Preparation of the Adapter Board\nNOTE: An adapter board is required to connect the electrode board to the wireless recording headstage through an FFC (Flat Flexible Cable) connector. For this, a board similar to the electrode board needs to be prepared by following steps 1.1 to 1.7.\nSolder a FFC connector to one end of the prepared board.\nSolder three 30 AWG (American Wire Gauge) hook up wires to three pads on the other end.\nSolder three mini connectors to the three pads on the adapter board for oscilloscope readings as described in the next stage.\nSolder the other end of these three wires to the headstage connector.\nSecure the headstage circuit board on top of the levitation frame.\n5. Prerecording with Oscilloscope (Optional)\nNOTE: In order to assess the reliability of the electrodes and observe the signal to noise ratio, tethered oscilloscope recordings can be obtained before deploying the wireless recording system. The mini wire connectors on the adapter board should be used for this.\nConnect the oscilloscope to an extracellular neural recording amplifier. Set the amplifier parameters to a high-pass cut-off frequency of 1 Hz, a low-pass cut-off frequency of 20 kHz, and a gain of 100.\nConnect each of the female mini wire connectors on the adapter board to the amplifier input channels.",
    "Remove the insect with the implanted electrode board from the cage when it is in an active state (during its dawn time). Place a piece of tissue paper under the insect for it to rest on before measurements are taken.\nUsing tweezers, slide the electrode board into the FFC receptor on the adapter board. Observe a flat and low voltage baseline when the insect is resting and the generation of electromyogram (EMG) spikes as the insect flaps its wings.\n\tNOTE: Refer to Section 6: Observing insect flight with the Wireless Recording System for representative oscilloscope results.\nAdjust the viewing parameters of the oscilloscope as needed. Capture the data on the oscilloscope and save the data.\n6. Observing Insect Flight with the Wireless Recording System\nNOTE: An electromagnetic levitation platform can be built for wireless recording of EMG signals during tethered Manduca sexta flight. The levitation platform consists of a frame designed to balance a tethering mechanism. The levitation allows the frame, and therefore the insect, to yaw during testing without the constraint of tethering wires. The frame can be rapid-prototyped using a fused deposition modeling (FDM) machine. A magnet needs to be attached to the bottom of this frame to be levitated by a series of magnets in the base platform. The insect is connected to the FFC connector suspended from the top of the frame. This levitating platform is located inside of the LED Arena which was constructed using 60 panels composed of an array of 5x7 individual LEDs. This system was based on established methods for developing an environment for visual stimulation of fruit flies15,16,17. The arena is controlled by a microcontroller allowing simulation of both clockwise and counterclockwise rotation as well as control of the rotational speed.",
    "Set up the wireless recording system by connecting the headstage to the adapter board connector on the levitation platform.\nRemove the insect from the cage when it is in an active state preferably during its dawn time.\nUsing tweezers, carefully insert the electrode board into the FFC receptor on the levitating frame such that the insect is suspended firmly within the setup.\nPlace the magnetic wand near the magnetic switch on the headstage to activate wireless data transmission. A blue light will come on indicating that the headstage is active.\nTurn off the lights in the room for complete darkness. A red lamp can be used to add lighting to the room. Open the telemetry data collection software on a computer and select the appropriate preloaded configuration file if provided. Start the data acquisition to begin viewing signals.\nSelect the relevant user interface for observation of EMG signals on the wireless recording system to ensure a reliable wireless connection and electrode operation.\nTurn on all the LED Arena components: Regulated DC power supply and microcontroller. The microcontroller can adjust the rotations per minute of the cyclic light pattern and can also control the direction of the light rotation.\nSlowly balance the levitation platform within the arena. Align the frame above the center of the levitation base carefully, otherwise the frame will be pulled quickly to the ground possibly injuring the insect.\nInitiate the video recording system.\nSelect the relevant recording tab of the software interface. Designate the recording time and file save destination. Choose the appropriate output settings to save the data. Click the start button to initiate a recording session within the software. This will save the data file which can be imported into numerical computing environments.",
    "Observe as the insect flies in the direction that corresponds with the movement of the LEDs. Reverse the direction of the LEDs and confirm that the insect reverses direction. Perform this as many times as desired.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}