{
  "id": 5052,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> mTORC1 Kinase Assay for Mammalian Cells Protocol",
  "procedures": [
    "Note: An overview of the whole procedure can be found in Figure 1. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160602/20160602183934_3022.jpgFigure 1. mTOR in vitro kinase assay. As described in the “Procedure”, preparation of (A) mTORC1 complexes, (B) Rheb-GTP and (D) drug inhibitors (rapamycin/FKBP12 and wortmannin) and incubation of mTORC1 substrate (4E-BP1) within the mTORC1 kinase assay (E).Generating mTOR/raptor complexes from HEK293E cellsHEK293E cells were cultured in Dulbecco's modified Eagle's medium (DMEM) supplemented with 10% foetal bovine serum (FBS) and 1%, 100 μg/ml penicillin and 100 µg/ml streptomycin.75 cm2 flasks of 80% confluent HEK293E cells were either co-transfected with 5 µg Myc-tagged mTOR and 5 µg HA-tagged Raptor constructs or transfected with a GST-tagged Rheb construct using the calcium phosphate transfection method (1 x 75 cm2 flask of HEK293E cells is sufficient for three mTOR kinase assays). Cells were harvested 36 h post-transfection. Cells are treated with 10 µg/ml insulin for 30 min prior to lysis. This dose is sufficient to stimulate mTORC1 signaling and ensure that the active complex is purified as previously demonstrated (Dunlop et al., 2009).Stimulate cells with 100 nM insulin for 15 min then lyse the cells in 1 ml of mTOR lysis buffer supplemented with protease inhibitors and 0.3% CHAPS (w/v).Centrifuge at 16,200 x g for 8 min at 4 °C (refrigerated mini centrifuge).Incubate lysates with 3 μl of Myc- or HA-antibodies (the mTORC1 complex can be purified with either HA-raptor or myc-mTOR immunoprecipitation) for 1.5 h at 4 °C with rotation.Make a 50% volume ratio mix of Protein G plus mTOR lysis buffer, add 40 μl to each tube and incubate for 1 h at 4 °C with rotation (StuartTM SB2 fixed speed rotator).Wash immunoprecipitates with 0.5 ml of the following buffers supplemented with protease inhibitors:1x low salt mTOR wash buffer (supplemented with 0.",
    "3% w/v CHAPS)2x high salt mTOR wash buffer (supplemented with 0.3% w/v CHAPS)2x mTOR wash bufferSplit immunoprecipitates equally into three Eppendorf tubes for the in vitro kinase assay.Preparing GTP-bound RhebHuman Rheb (Gene ID: 6009) cloned into pDEST27, which contains an N-terminal GST-tag. Transfect four 75 cm2 flasks of 80% confluent HEK293E cells with GST-Rheb-pDEST27 (10 µg DNA per flask), using standard calcium phosphate transfection procedures (Schalm et al., 2002).Grow HEK293E cells over-night in the presence of 10% (v/v) FBS till fully confluent (6-7 x 106 cells).Lyse HEK293E cells in 1 ml Rheb lysis buffer supplemented with 0.3% (w/v) CHAPS (plus protease inhibitors). Note: Reducing agents (such as DTT) should be omitted as this will interfere with GST-purification. Incubate lysates on ice for 30 min to facilitate lysis. Incubate pre-cleared lysates (after centrifugation at 16,200 x g for 10 min at 4 °C) with immobilized 40 μl of a 50% volume ratio mix of Rheb lysis buffer and glutathione-sepharose beads, incubate for 2 h at 4 °C with rotation.Wash the glutathione-sepharose beads twice with 0.5 ml Rheb lysis buffer and then once with 0.5 ml Rheb storage buffer supplemented with protease inhibitors.Elute GST-Rheb from the glutathione-sepharose beads in 50 µl Rheb storage buffer supplemented with of 10 mM glutathione (pH readjusted back to 8.0).Incubate eluted GST-Rheb protein at 30 °C for 10 min with either 10 mM EDTA and 1 mM GDP to generate inactive Rheb-GDP, or 10 mM EDTA and 0.1 mM non-hydrolysable GTPγS to generate active Rheb-GTP. To tightly bind the guanine nucleotide to Rheb, add MgCl2 to a final concentration of 20 mM. Incubate on ice until use. Generating dephosphorylated 4E-BP1 protein for positive control substrateTransform BL21 (DE3) pLys bacteria with GST-tagged 4E-BP1/pGEX plasmid (4E-BP1 GeneID, 1978) using standard transformation methods.Grow bacteria until OD600 is 0.6-0.",
    "8, add isopropyl-β D-thiogalactoside (IPTG) to give a final concentration of 0.5 mM and incubate for 3 h at 30 °C to induce expression. Pellet cells by centrifugation at 1,500 x g for 30 min at 4 °C.Lyse bacteria with a freeze/thaw cycle in 10 ml of PBS supplemented with 10 mM EDTA, 0.1% (v/v) Triton and protease inhibitors.Use pulse sonication to shear bacterial DNA [3 x 5 sec cycles on full power (30 μm)]. Centrifuge at 16,200 x g for 10 min at 4 °C, then purify GST-4E-BP1 from the bacterial supernatant using glutathione-sepharose beads.Dephosphorylate GST-4E-BP1 protein using 50 U shrimp alkaline phosphatase, washed in PBS, 10 mM EDTA, 0.1% (v/v) Triton X-100. Elute in 10 mM reduced glutathione in PBS (pH 7.6).Desalt the eluent using a HiTrap Desalting Column in accordance with manufacturer protocol.Resolve using SDS-PAGE and stain with Coomassie Brilliant Blue to check the purity and concentration against known bovine serum albumin (BSA) standards.Dephosphorylated 4E-BP1 can be stored at -80 °C in 10 µg/µl aliquots for future use.Preparing FKBP12/rapamycin drug/protein complexes to inhibit mTORC1Human FKBP12 protein can be expressed and purified using the same protocol to generate GST-4E-BP1 above (omitting the dephosphorylation step C5).FKBP12 can also be frozen in 10 µg/µl aliquots at -80 °C for future use.To generate FKBP12/rapamycin complexes: Make up 25 mM HEPES (pH 7.4), 10 mM MgCl2, 20 mM rapamycin and 0.5 µg FKBP12 in 10 µl final volume (dH2O). Incubate at room temperature in the dark for 5 min, and store on ice until needed.Performing mTOR kinase assaysMake up mTOR/Raptor immunoprecipitates in 3x mTOR kinase assay buffer and add 75 ng of Rheb-GTP and or 2 μl FKBP12/rapamycin as required.Incubate for 20 min on ice prior to starting the kinase assay.",
    "Add 10 μl of mTOR assay start buffer supplemented with 500 μM ATP (freshly added before use) plus 150 ng of purified GST-4E-BP1 or the test substrate to start the assay. Phospho-4E-BP1 (Thr 36/45) levels are used as a positive control and indicate mTOR kinase activity.Incubate at 30 °C for 30-60 min in thermomixer heating block, shaking at20 FCS.Stop reaction by adding 4x sample buffer.Analyse samples using SDS-PAGE and western blotting. An example of representative data is shown in Figure 2."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}