{
  "id": 17660,
  "origin_website": "Jove",
  "title": "In vitro Assessment of Myocardial Protection following Hypothermia-Preconditioning in a Human Cardiac Myocytes Model",
  "procedures": [
    "Information regarding commercial reagents and instruments are listed in the Table of Materials.\nThe AC16 human cardiomyocyte cell line was derived from the fusion of primary cells from adult ventricular heart tissue with SV40-transformed human fibroblasts17, which were purchased from BLUEFBIO (Shanghai, China). The cell line develops many biochemical and morphological features characteristic of cardiomyocytes. In addition, the cell line is widely used to evaluate myocardial damage and myocardial function in vitro18,19.\n1. Cell culture\nNOTE: The basal culture medium consists of serum-free Dulbecco’s modified Eagle’s medium (DMEM), 10% fetal bovine serum (FBS), 1% cardiac myocyte growth supplement, and 1% penicillin/streptomycin solution. Store the medium at 4 °C and prewarm to 37 °C before use.\nRemove the cryopreserved human cardiomyocyte (HCM) cells from liquid nitrogen and thaw them in a water bath at 37 °C.\nGently shake the vial (<1 minute) in a 37 °C water bath until only a small piece of ice remains in the vial.\nTransfer the vial into a sterile laminar flow hood. Wipe the outside of the vial with a cotton ball dipped in 70% alcohol.\nTransfer 4 mL of prewarmed complete growth medium dropwise into the centrifuge tube containing the thawed cells.\nCentrifuge the cell suspension at 200 × g for 10 minutes. After centrifugation, discard the supernatant and resuspend the pellet in 5 mL of complete medium.\nMaintain the cells at 37 °C in a humidified incubator under an atmosphere with 95% air and 5% CO2.\n\tNOTE: Before harvesting the cells for experiments, the cells are allowed to grow until reaching approximately 60-70% confluency.\n2. Establishment of an oxygen-glucose deprivation (OGD) model",
    "NOTE: Two hours before the study period, replace the growth medium with serum-free medium, and the cells were reincubated in a humidified incubator for 2 h at 37 °C under an atmosphere with 5% CO2.\nAspirate the medium from a 6-well plate and gently wash the cells three times with phosphate buffered saline (PBS).\nAdd 2 mL of fresh sugar-free DMEM per well.\nCulture the cells at a constant temperature in a three-gas incubator under an atmosphere with a mixture of 95% N2, 5% CO2, and 0.1% O2 at 37 °C for 1, 2, 4, 8, 12, or 16 h.\nAfter the hypoxia treatment, aspirate the medium from the 6-well plate and wash the cells with PBS (pH 7.4) three times.\nAdd 2 mL of complete DMEM per well.\nMaintain the cells at 37 °C in a humidified incubator under an atmosphere with 95% air and 5% CO2.\n3. Time-temperature protocol\nNOTE: A standard time-temperature protocol is used during cardiac surgery, as described previously by others20,21. Treat HCMs according to the following protocol (Figure 1): timepoint 1 (T1) indicates the end of induction, timepoint 2 (T2) indicates the end of maintenance and timepoint 3 (T3) indicates the end of rewarming. Analyze control cells maintained under continuous normothermic conditions (37 °C). The temperature conditions are created using a tri-gas incubator, which allows precise temperature regulation.\nTwo hours before the experiments, aspirate the culture medium from a 6-well plate and add 2 mL of fresh serum-free DMEM per well.\nRe-incubate the cells in a humidified incubator for 2 h at 37 °C under an atmosphere with 5% CO2.\nAfter 2 h, aspirate the medium from the 6-well plate and wash the cells with PBS (pH 7.4) three times.\nAdd 2 mL of fresh serum-free DMEM per well.",
    "Reincubate the cells in the tri-gas incubator.\n\tNOTE: Replace the medium to remove unattached cells and debris.\nImmediately change the temperature by placing the culture dishes a tri-gas incubator.\nAfter 1 h of cooling, quickly aspirate the medium from the 6-well plate and add 2 mL of fresh sugar-free DMEM per well.\nCulture the cells in a tri-gas incubator under an atmosphere comprising 95% N2, 5% CO2, and 0.1% O2 at 37 °C for 12 h to establish hypoxia.\nSet the temperature as described below.\n\tNOTE: The protocol starts with 10 h of a low-temperature treatment, followed by a rewarming phase for 2 h up to 37 °C, and 24 h of normothermia (37 °C). At every time point, three Petri dishes are removed for analysis.\nAfter low-temperature treatment, aspirate the medium from the 6-well plate and wash with PBS (pH 7.4) three times.\nAdd 2 mL of complete DMEM per well.\nMaintain the cells at 37 °C in a humidified incubator under an atmosphere with 95% air and 5% CO2.\n4. CCK-8 viability assay\nWarm the 0.25% trypsin-ethylenediaminetetraacetic acid (EDTA) solution and PBS to 37 °C prior to use.\nAspirate the medium, rinse the cells with 1 mL of PBS and then add 0.5 mL of 0.25% trypsin along the wall of the well. Incubate at 37 °C until almost all HCMs are detached (approximately 1 min).\nAdd 1 mL of DMEM complete medium to the wells to neutralize the trypsin.\nTransfer the cell suspension to a 15 mL centrifuge tube and pellet the HCMs by centrifugation at 500 × g for 3 min. Aspirate the supernatant without disturbing the pellet.\nDispense 100 µL aliquots of the cell suspension (5000 cells/well) into a 96-well plate. Preincubate the plate for 24 h in a humidified incubator (at 37 °C.)",
    "Use the cultured cells in the 96-well plates to generate different treatment groups.\nIncubate the plate for an appropriate length of time (16 h) in an incubator.\nAdd 10 µL of CCK-8 solution to each well of the plate.\nIncubate the plate for 1 hour in the incubator.\nMeasure the absorbance at 450 nm using a microplate reader.\n\tCAUTION: Be careful not to introduce bubbles to the wells, as they interfere with OD reading measurements.\n5. Flow cytometry for apoptosis analysis\nPerform trypsinization and centrifugation steps by following steps 4.2-4.4.\n\tNOTE: Cells are harvested with trypsin without EDTA. To assess apoptosis, both floating and adherent cells are collected.\nCentrifuge the cells for 5 min at 1000 × g. Discard the supernatant and resuspend the pellet in 1 mL of PBS.\nCount the cells using a hemocytometer. Using a pipette, transfer 100 µL of Trypan Blue-treated cell suspension to a hemocytometer. Using a hand tally counter, count the live, unstained cells in one set of 16 squares and then use PBS to generate a cell suspension at 1×107 cells/ml.\nObtain 200 µL of the cell suspension (5 × 105 -1 × 106 cells).\nCentrifuge for 5 min at 1000 × g and resuspend the pellet in Annexin V-FITC binding solution.\nAdd 5 µL of Annexin V-FITC to dye the cells.\nAdd 10 µL of propidium iodide into the cell suspension.\nGently mix the cells and incubate them for 20 minutes at room temperature in the dark.\n\tNOTE: The cells are resuspended 2-3 times during the incubation to improve staining.\nStart the flow cytometer and make sure the software is working appropriately.\nOpen two dot plot windows in the flow cytometry software.",
    "Select forward scattered light (FSC) on the X axis and side scattered light (SSC) on the Y axis to exclude cell debris and/or clumps in terms of their size and granularity, respectively.\nSelect the PE (590 mm) detection channel and FITC (530 mm), which is used to measure the fluorescence intensity of the cells.\nPlace the blank (HCMs that have not been dyed) sample tube on the flow cytometer.\nClick Record to collect particles from the suspension in the blank sample tube and then gate the cell population for further analysis in the first dot plot.\nPlace the single-stained samples on the tube support arm. Click Record to collect particles from the suspension and then gate the cell population for further analysis in the first dot plot.\nCollect the HCMs in other sample tubes and optimize the measurement by adjusting the voltages of the fluorescence channels.\n\tNOTE: Unstained and single-stained samples are used as compensation controls during the experiment.\nDisplay the statistics of each sample tube and calculate the rate of apoptosis of each sample.\n6. Mitochondrial depolarization assessment\nPerform trypsinization and centrifugation by following steps 4.2-4.4.\nResuspend the cells in 500 µL of complete medium, and then adjust the cell density adjusted to 1 × 105 - 6 × 106 cells\nAdd 0.5 mL of JC-1 working solution to each tube.\nIncubate the cells in a cell incubator at 37 °C for 20 minutes.\n\tNOTE: During the incubation period, add 1 mL of 5× JC-1 staining buffer to 4 mL of distilled water to prepare the JC-1 staining buffer.\nAfter incubation, centrifuge the cells at 600 × g for 3 min at 4 °C.\nDiscard the supernatant and resuspend the pellet in 1 mL of JC-1 staining buffer.\nRepeat steps 6.5 to 6.6 three times.",
    "Resuspend the HCMs in 1 mL of ice-cold staining buffer in a 1.5 mL centrifuge tube and use the cells for analysis within 30 min.\nSelect the PE (590 nm) detection channel and FITC (530 nm) to measure the fluorescence intensity of JC-1 dye in the cells.\n\tNOTE: Set up the flow cytometer by following steps 5.10-5.17.\n7. Reactive oxygen species assay\nPerform trypsinization and centrifugation by following steps 4.2-4.4.\nStain the cells in culture medium with 10 µM DCFDA and adjust the cell density to 1 × 106 - 1 × 107 cells\nIncubate for 30 minutes at 37 °C.\nGently pipette the cells up/down every 3-5 min.\nAfter the incubation, wash the cells three times with serum-free cell culture medium.\nAnalyze the cells on a flow cytometer by following steps 5.10-5.17.\n\tNOTE: DCF is excited at 488 nm and the emission intensity measured at 530 nm.\n8. Measurement of Caspase 3/ Caspase 8 Activity\nPerform trypsinization by following steps 4.2-4.4.\nCollect the cells by centrifugation at 600 × g at 4 °C for 5 minutes.\nAdd 100 µL of lysate buffer per 2 × 106 cells.\nLyse the cells for 15 minutes on ice.\nAfter incubating for 15 min in an ice bath, centrifuge the sample at 1.6 × 104 x g at 4 °C for 15 minutes.\nTransfer the supernatant to an ice-cold centrifuge tube for use.\n\tNOTE: The protein concentration in the sample should be at least 1-3 mg/mL.\nRemove Ac-DEVD-pNA (2 mM) and place it on an ice bath for use.\nAccurately add 40 µL of buffer solution to the enzyme-labeled plate, add 80 µL of the sample, and finally add 10 µL of Ac-DEVD-pNA (2 mM).\nIncubate the sample at 37 °C for 120 minutes.",
    "Measured the A405 value on a microplate reader according to the manufacturer's instructions.\n\tNOTE: The absorbance produced by the pNA generated by caspase-3/caspase-8 is calculated by subtracting the A405 value of the blank control from that of the sample.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}