{
  "id": 4434,
  "origin_website": "Bio",
  "title": "Fluorescence Microscopy for Cilia in Cultured Cells and Zebrafish Embryos",
  "procedures": [
    "Immunofluorescence labeling of cilia in cultured cellshTERT-RPE1 cells are cultured as described in the ATCC website (http://www.atcc.org/Products/All/CRL-4000.aspx#culturemethod[href=http://www.atcc.org/Products/All/CRL-4000.aspx#culturemethod]). Briefly, cells are grown in 10 cm Petri dishes with 10-12 ml complete growth medium (see Recipes) and media are changed every other day. Cells are subcultivated at 1: 5 ratio twice a week when cell concentration reaches between 2 x 104 and 4 x 104 cells/cm2. An inoculum of 4 x 103 to 6 x 103 viable cells/cm2 is recommended.Sterilize 18 mm diameter circle cover slips by immersing in 75% ethanol in a 100 ml beaker over night. Pick cover slips by using forceps and put slips into 12-well-plate, one slip per well. Rinse slips three times with 1 ml PBS per well each time. Add 1 ml complete growth medium to each well, and then add appropriate aliquots of the dissociated cell suspension. Culture for 1-2 days until cells reach 60-90% confluence. Wash three times with 1 ml PBS per well each time to get ride of serum, then add 1 ml serum free medium and culture for 48 h to induce cilia formation. The culture time and confluence should be determined by researchers themselves to get the best result for different experiments. Generally, a confluence higher than 60% is recommended for efficient cilia induction.Before fixation, place cells on ice for 30 min to destabilize microtubules and rinse once with 1 ml ice-cold PBS for each well.Fix cells with 1 ml of freshly prepared 4% PFA in PBS per well for 10 min at room temperature (RT).Briefly rinse cells three times with 1 ml PBS each time per well, and permeabilize cells with 1 ml 0.5% TritonX-100 in PBS per well for 15 min at RT. Note: PFA waste should be collected in an appropriate container for proper disposal.",
    "Briefly rinse cells three times with 1 ml PBS each time per well.Incubate cells with 1 ml 1% BSA in PBS each well for 1 h at RT.Make a humid chamber with a new 10 cm Petri dish by putting a piece of wet filter paper and a piece of parafilm on the top of the paper. Make sure the parafilm is flat. Transfer the cover slips with blocked cells by using forceps onto the parafilm. Add 100 µl diluted mouse anti-acetylated tubulin antibody (1: 1,000 in PBS with 1% BSA) onto each slip and incubate for 2 h at RT or overnight at 4 °C.Wash cells with 200 µl 1% BSA in PBS per slip three times for 5 min each.Add 100 µl diluted secondary antibody, Goat anti-mouse IgG (H+L) antibody conjugated with Alexa Fluor-546 (1: 1,000 in PBS with 1% BSA) for 1 h at RT in the dark. Wash cells with 200 µl 1% BSA in PBS per slip three times for 5 min each.To stain nuclei, dilute DAPI stock solution with PBS to 0.5 µg/ml, add 100 µl diluted DAPI onto each slip and incubate for 1 min at RT.Wash cells with 200 µl PBS per slip three times for 5 min each.Mount slides with 10-20 µl Dako mounting medium as shown in Figure 1 and dry them for at least 2 h at RT in the dark. Store slides at 4 °C. Samples are good for at least 1 month, but DAPI signals will diffuse and become dim after 1 week. It’s better to take images within 1 week.Take images on a Leica TCS SP5 confocal microscope with a 63x oil objective. Optical sections are captured at 0.5 µm intervals and z-stack images are obtained by maximum intensity projections.",
    "A typical image can be found in Figure 1j of Cao et al. (2012). Whole mount immunofluorescence of zebrafish embryosZebrafish (AB strain) were raised and maintained under standard conditions and staged as previously described in hours post fertilization (hpf) (please refer to The Zebrafish Book: http://zfin.org/zf_info/zfbook/zfbk.html[href=http://zfin.org/zf_info/zfbook/zfbk.html]). Dechorionate zebrafish embryos at the 8-somite stage or at the 24 hpf stage through pronase treatment or manually with forceps. For detailed method about dechorionation, please refer to Chapter 4 of The Zebrafish Book (http://zfin.org/zf_info/zfbook/chapt4/4.1.html[href=http://zfin.org/zf_info/zfbook/chapt4/4.1.html]).Transfer embryos with plastic transfer pipette into 2 ml EP tubes, up to 100 embryos each tube. Remove extra water and fix embryos with 1 ml embryo fixation buffer for 2 h at RT or overnight at 4 °C with gentle rocking at 15-20 times per minute on a shaker. All washings and incubations should be done with gentle rocking. All solutions are added and removed by using pipette with 1 ml tips. PFA and methanol waste should be collected in an appropriate container for proper disposal.After a brief rinse with 1 ml PBT, dehydrate embryos through a graded methanol/PBT series (25%, 50%, 75%, 100%). Rock the embryos gently at RT for 5 min at each step.Incubate embryos overnight in 1ml 100% methanol at -20 °C. Embryos can be stored at -20 °C for up to 1 month before further staining.Rehydrate embryos in a methanol/PBT graded series (75%, 50%, 25%, 5 min each at RT). Rinse three times with PBT for 5 min each at RT, and use 1 ml PBT each time per tube.Incubate embryos for 1-2 h in 1 ml embryo blocking buffer at RT.Incubate samples overnight at 4 °C with mouse anti-acetylated tubulin antibody diluted in 300-500 µl blocking buffer (1: 1,000).  Note: At least 300 µl is recommended for sufficient incubation.",
    "Wash three times for 10 min each, with 1ml 0.5% Triton X-100 in PBS each time.Incubate embryos with 300-500 µl secondary antibody, Donkey anti-mouse IgG (H+L) antibody conjugated with Alexa Fluor-488 diluted in blocking buffer (1: 1,000) overnight at 4 °C or for 2 h at RT.Rinse three times for 10 min each with 1ml 0.5% Triton X-100 in PBS each time.To stain nuclei, dilute DAPI stock solution with PBT to 0.5 µg/ml, and incubate embryos with 1 ml diluted DAPI each tube for 5-10 min at RT. Then wash embryos three times for 5 min each with 1 ml PBT. Embryos are now ready for embedding. Otherwise, please keep stained embryos in PBT at 4 °C for up to 1 week.Embed embryos in 1% low melting agarose. Briefly, prepare a 1% low-melting-point agarose solution in H2O by heating in a microwave oven. Keep the solution liquid in a tube in a 37 °C water bath. This solution remains liquid at 37 °C, but quickly hardens when cooled lower than 30 °C. Use 35 mm culture dishes for embryos mounting and imaging. First, add 1 ml agarose solution in each dish and let it gel at RT. Make sure the agarose is flat and covers the whole bottom of the dish. Transfer four embryos by using plastic transfer pipette onto the agarose gel of each dish. Quickly pipette a small drop of agarose onto the embryo, and position the embryo at the appropriate angle in the agarose using forceps and allow the agarose to harden. Make sure the embryos are distant from each other, so that you can mount one by one. 24 hpf embryos should be mounted laterally to show the pronephric duct, and 8-somite-stage embryos should be mounted to show the Kupffer’s Vesicle on the up side.",
    "Please refer to Figure 7a and b of the Reference 1 for correct orientations. Mounted embryos should be examined at the same day.Add 2-3 ml H2O into the 35 mm dishes with mounted embryos, and take images on a Leica TCS SP5 MP confocal microscope with a 63x NA1.2 water immersion objective. Optical sections are captured at 0.5-µm intervals and z-stack images are obtained by maximum intensity projections. A typical image can be found in Figure 7g and j of Reference 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140717/20140717001644_7770.jpgFigure 1. Mounting cells for microscopy"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}