{
  "id": 11866,
  "origin_website": "Jove",
  "title": "A Label-Free Segmentation Approach for Intravital Imaging of Mammary Tumor Microenvironment",
  "procedures": [
    "All experiments described were approved by the University of Wisconsin-Madison's Institutional Animal Care and Use Committee. The well-being and pain management in all animal experiments is paramount. Thus, every effort is made to make sure the animal is comfortable and well-cared for at each step of the procedure.\n1. Generation of the mammary imaging window (MIW)\nTo construct the mammary imaging window, fabricate a 14 mm ring from surgical grade stainless steel.\nClean the machined window frame using a hot solution of 5% cleaning detergent, rinse for 10 min under running deionized water (DI), soak in 100% ethanol for 10 min, and then dry under a heat lamp. Autoclave the dried MIW frame and store it for later use.\nPrepare MIW cover glass as follows: Soak the #1.5 12 mm round cover glass in 100% ethanol for 10 min, dry under a heat lamp, and then secure to the metal MIW frame using cyanoacrylate adhesive. Cure the adhesive overnight.\nClean the assembled MIW of excess adhesive using an acetone soaked swab, and cleanse by submerging it in 70% ethanol for 10 min. Allow the cleaned window to dry. Prepare the MIW in advance and store it in a sterile Petri dish prior to surgical implantation.\n2. Surgical implantation of the MIW\nAutoclave surgical tools and sanitize surfaces with 70% ethanol before beginning the surgery for the window implantation.\nPerform surgery on a sanitized tabletop using a warming blanket covered with a sterile field. Set the warming blanket such that the temperature measured on top of the sterile field is 40 °C.",
    "Use auxiliary cold lighting to help prevent tissue drying. Use magnifying glasses to facilitate the surgical procedure. Wear PPE consisting of a sterile, single-use lab coat, surgical sleeves, gloves, eye protection, and face mask as recommended by the surgical best practices.\nAnesthetize the mouse using an anesthesia vaporizer machine with an isoflurane setting of 2.0% and an oxygen flow rate of 2.0 L/min. Administer analgesic (10 mg/kg meloxicam) by subcutaneous injection.\n\tNOTE: Provide additional doses within the first 24 h, preferably every 8-12 h for the first 2 days after surgery.\nOnce anesthetized (confirmed by no response to toe-pinch), apply a moisturizing eye gel to prevent drying of the eyes. Use a depilatory cream to remove fur at the surgery site (4th inguinal mammary gland) followed by rinsing with sterile water-soaked gauze.\nPrepare the depilated surgical site for surgery by sanitizing the skin surface with 3 alternating betadine and ethanol scrubs.\nTo begin the surgery, gently lift the skin over the 4th mammary gland number 4 using forceps. Once the skin is pulled away from the body wall, remove a ~1 mm section of the dermal layer at the tip of the forceps with surgical micro-scissors. If bleeding occurs, apply gentle pressure with sterile gauze until the bleeding stops.\n\t​NOTE: In general, larger tumors have a greater potential to bleed than smaller tumors or normal tissues.\nDetach the mammary gland from the dermal layer with gentle movements of the forceps at the surgical opening to avoid cutting the underlying gland.\nCreate a 10 mm incision and release the mammary gland from the dermal layer at the periphery so that sutures can be placed without penetrating the mammary gland. Add PBS to cover the exposed gland/tumor and to prevent drying.",
    "Create a purse-string suture along the periphery of the opening using 5-0 silk braided suture. Insert an edge of the MIW so that the dermal layer engages into the receiving notch of the MIW.\nGently stretch the epithelium at the opposite side of the MIW and push the metal MIW into place such that the dermal layer fully engages the receiving notch around the entire MIW circumference. Cinch the purse string tight to draw the dermal layer into the notch and tie it off to fully secure the MIW.\nAdd a topical antibiotic to the dermal layer at the MIW, and continuously monitor the mouse until it has regained sufficient consciousness to maintain sternal recumbency. House the MIW-implanted mouse separately on soft bedding with an igloo placed in the cage, and allow the mouse to recover for 48 h before imaging.\n3. Positioning and maintaining mouse on the microscope stage for imaging\nSet up the heating chamber on the microscope stage. Use a forced-air system set to 30 °C or any other similar system. Use an objective heater to avoid drift in z focus. Allow the system to come to equilibrium for at least 1 h before imaging.\n\tNOTE: Anesthetized mice are incapable of properly maintaining their body temperature, and therefore, it is necessary to have a heated environment for any time-lapse acquisitions . The objective heater helps to combat the effects of thermal expansion, a phenomenon that causes drift in z focus as the objective lens and the tissue being imaged come to thermal equilibrium.\nOnce the heating chamber on the microscope has stabilized at 30 °C, anesthetize the recipient mouse with anesthesia machine settings of 2% isoflurane and oxygen flow rate of 2 L/min.",
    "After the mouse is sedated (confirmed by no-response to toe pinch), clean the outside of the MIW glass with a cotton applicator and glass cleaner, add eye ointment to prevent drying, and insert a tail vein catheter if necessary.\nTo maintain proper hydration, give an initial injection of 0.5 mL PBS sub-cutaneously or 100 µL through the tail vein catheter. Repeat every 2 h for the duration of the imaging session.\nOnce the mouse has been properly prepared, set up the microscope for imaging. To reduce evaporation during time-lapse measurements, use a water-based gel instead of water for the immersion media. This should be done before placing the mouse on the stage. Please see the Table of Materials for details of the optical components.\nLay the mouse on the microscope stage, fit the isoflurane hose and press the collar of the MIW into a 14 mm receiving hole in the stage insert to stabilize the images. Bring the imaging field into focus using the microscope oculars and use brightfield illumination to observe the vasculature with blood flow.\nCheck the stability of the field of view. If breathing movement artifacts are present, apply gentle compression to the backside of the gland with a small foam block and a cincture-like piece of adhesive tape. After compression is applied, verify that blood flow is maintained throughout the field of view.\nPeriodically adjust the isoflurane levels in 0.25% increments during the imaging session to maintain a proper level of sedation by manually counting animal respiration.",
    "Maintain a rate of 36-40 respirations per min (rpm) to improve animal longevity and optical imaging. Lower respiration rates can result in the mouse not surviving the experiment, whereas respiration rates over 60 rpm may result in poor sedation, which can increase breathing and motion artifacts in the image data.\n4. Set up for 4D, intensity-based, label-free intravital imaging of dynamic cell behavior\nOnce the mouse is sedated and securely positioned on the inverted microscope stage, start locating regions of interest.\nUsing a light source directed at the MIW, use the oculars of the microscope to identify potential areas for investigation. Add and save the x, y positions in the software to return to these positions.\n\tNOTE: The fine details of the tumor will not be readily visible with this type of illumination. The goal is simply to identify regions for further investigation. The focus is on seeing vasculature and blood flow.\nAfter several positions have been saved in the software, preview the chosen fields of view using 890 nm excitation and the FAD/SHG filter cube. Use a maximum dwell time of 4 µs with lower power and high PMT setting. The goal is to preview the fields of view without overexposing the tissue to excessive laser light.\nOnce appropriate power levels have been set, set up the z-stacks. Observe appearance of abundant collagen fibers (SHG) at 20-50 µm beneath the glass surface of the MIW. Collagen will become less prevalent as the microscope sections deeper into the tumor (Figure 1B). Voids in the SHG reveal the location of tumor masses.",
    "Set the top z-slice, beneath the layer of solitary cells where the first collagen fibers appear at ~50-100 µm. Set the bottom z-slice at ~250 µm, where the fibers fade out and the poor signal dominates. Repeat this for all x-y positions saved.\nOnce the z-stack range is set, increase the dwell time (up to 8 µs) and optimize the power and detector settings. Optimize the power levels as needed to excite the tissue for each experiment. Using powers up to 90 mW at 750 nm or 70 mW at 890 nm at the back aperture of the objective are within an acceptable range.\n\t​NOTE: The imaging depth, amount of scattering within the tissue, objective characteristics, and detector sensitivity will all significantly impact the amount of power needed to get an image.\nAdjust the time intervals according to experimental goals. Start with 10 min intervals between collection points for most intravital migration movies.\nEven though 2P excitation is gentle on cells and tissues, be cognizant of signs of phototoxicity, like cell blebbing or rapidly increasing autofluorescence, and excessive photobleaching. Reduce laser power or increase timelapse intervals as conditions indicate.\n5. Fluorescence lifetime imaging (FLIM) of NAD(P)H\nWhile preserving the x-y positions from the timelapse acquisitions, set up the microscope to collect a FLIM stack. Insert a 440/80 filter into a filter holder in front of the GaAsP detector, and set the GaAsP detector voltage to 800 in the software. Turn off the room lights when the detectors are on.\nIn the software, switch from the galvanometer-based intensity imaging to a FLIM imaging mode.",
    "For the purpose of identifying and masking the vasculature, set the resolution to 512 x 512 pixels. For collecting complementary metabolic information, set the resolution to 256 x 256 pixels to increase the temporal resolution of the lifetime signature. Set the dwell time to 4 µs and tune the laser to 750 nm.\nStart preview scanning and begin to adjust the laser power. Adjust the laser power until the readout for the constant fraction discriminator (CFD) is between 1 x 105 and 1 x 106. Do not exceed 1 x 106 as this will result in photon pileup and poor overall results.\nOnce the power level is set, set the integration time between 90 s and 120 s and start the FLIM collection. It will acquire photons from the field of view for the allotted time.\nOptional: After all necessary collections have been made and the mouse has been removed from the stage, collect an instrument response function (IRF). Measure the IRF by imaging the surface of commercially available urea crystals in a glass-bottom dish with the same parameters and set up used for imaging the tissue.\n\t​NOTE: The IRF accounts for any delays or reflections due to the electronic or optical setup. The IRF is convolved in all FLIM acquisitions, and deconvolving it from the data can improve the accuracy of calculated fluorescence decay curves. With that said, the calculated IRFs can often reasonably replicate the quality of the fluorescence decay curves from measured IRF. It is good practice to measure the IRF until it has been determined that the calculated IRF will yield equivalent fits of the decay curves and adequately approximate the results from the measured IRF.\n6. Analysis of NADH Lifetime images",
    "Open FLIM software and import the NAD(P)H lifetime image from the dataset. For more details on how to properly use the software, please consult the fluorescent lifetime handbooks (See Table of Materials).\nTo begin, define the model parameters in the software. In the menu bar, click Options > Model. Select the following boxes: Settings > Multi-Exponential Decay, Fit Method > MLE, Spatial Binning > Square, Threshold > Peak, and check Fix Shift Before Calculating Image.\nIn the menu bar, click Color > A1% from the drop-down menu. On the right side of the window, define it as a three-component fit. Set the Bin Size > 3.\nAdjust the Threshold > ~10. Re-evaluate threshold accuracy after the decay matrix has been calculated for the first time.\nFix the τ1 to 200 ps. This represents the short lifetime of red blood cells. Try to find the value that best matches multiple spots in the larger blood vessel, which can be seen in the intensity image. Fix the τ2 to 1200 ps. This represents the long lifetime of red blood cells.\n\tNOTE: The set values are just the starting point. The values will need to be optimized to bring out the vasculature more. In most cases, but not always, these values will decrease.\nUnder Calculate in the menu bar, select Decay Matrix. This will generate an initial A1% lifetime images with the vasculature having high values. Use the cursor (crosshairs) to hover over the vasculature. Systematically and one at a time, float (uncheck the Fix box) the τ1 and τ2. Record these values as they will help optimize the fixed parameters.",
    "​NOTE: The goal is not necessarily to get the most accurate values in the image, but rather to maximize the disparity between the vasculature and tissue without dramatically decreasing the area identified as vasculature.\nOnce the appropriate parameters for τ1 and τ2 have been identified, in the menu bar select Calculate > Batch Processing. Ensure that most settings are similar between z-slices.\nMake sure to verify that there is no one setting grossly different than the others. If so, adjust the shift first and try again. If the issue persists, refit using new parameters. An incorrect shift can be a large cause of noise in the fits and can increase A1% values in the adjacent tumor regions.\nIn the menu tab, save the files and then export A1% files. Upload these files in ImageJ for masking and segmentation.\n7. Image segmentation of the vasculature\nOpen ImageJ and import the A1% image as a text image. Repeat this for all images within the stack.\nWith all the A1% images opened, select Image > Stack > Z-Project. Use the Max Intensity Projection and save the images. See Supplemental Data 1 for a representative image.\nGo to Plugins > Segmentation. Select the trainable WEKA segmentation plugin38.\nOnce the WEKA window opens, use the default settings and begin to train the software by creating two classes and tracing lines over the vasculature (high A1% regions) and non-vasculature (low A1% regions).\nContinue to add new traces to the two classes until the software consistently identifies the high A1% regions of the vasculature while eliminating any higher regions of background noise. See Supplemental Model for representative classifier model.",
    "Once the classified image is produced, click on Image > Type > 8 Bit. Threshold the image and create a mask. If the thresholded image still needs to be cleaned up further, use the Analyze Particles function.\nAdjust the size and circularity until any smaller and circular regions of the thresholded image are excluded. A clean mask with only the vasculature and very little background is obtained.\nClick on Edit > Selection > Create Selection. Transfer the selection to the ROI manager by clicking on Analyze > Tools > ROI manager.\nDuplicate the classified image. Proceed to Process > Binary. To expand the mask and define the distance from the vasculature that will be included in the image segmentation, select Dilate. Repeat until the mask has expanded to the desired range. Record this region of interest (ROI) in the ROI manager.\n\tNOTE: The goal of this step is to quantify the amount or behavior within a certain proximity of the blood vessel (for example, the number of cells present within X µm of the blood vessels). The amount of dilation required is entirely determined by the scientific question.\nTo quantify the number of cells within the restrictive regions, select the window (image/channel) of interest. This can be any window that shares the same field of view as the vascular mask. Apply both ROI's using the XOR function from the drop-down menu.\n\t​NOTE: This operation will measure the items within the desired distance from the vasculature, excluding the vasculature itself. This combined ROI approach can then be used to measure a multitude of parameters, such as intensity, cell number, or migration.\n8. Image segmentation of the tumor nest\nOpen the NADH image from either a high-resolution intensity scan or FLIM collection in ImageJ.",
    "NOTE: This can be done on individual z-slices, full stacks, or applied to z-projections of a few slices.\nGo to Plugins > Segmentation. Select the trainable WEKA segmentation plugin.\nOnce the WEKA window opens, use the default settings and begin to train the software into two classes of NADH high regions and NADH low regions. The NADH-high regions will have a very discernable pattern of cells with nuclei and the software will easily identify it.\nContinue to toggle back and forth with the overlay to refine the algorithm with additional training until it recognizes all regions of the tumor as determined by eye and prior knowledge of tumor morphology. This is an iterative process.\nOnce the algorithm recognizes all the regions of the tumor, select the Create Result button. This will produce a new image. Duplicate this image.\nSelect the first duplicated image and convert it to an 8 bit image by selecting Image > Type > 8 Bit. Threshold this image to create a binary mask. Then create a selection and transfer it to the ROI manager. These ROIs will define the stroma.\nSelect the second of the duplicated image and convert it to an 8 bit image. Invert this image by selecting Image > Edit > Invert, and then threshold this image to create a binary mask. Once again create a selection and transfer it to the ROI manager. This ROI will define the tumor nest.\n9. Image segmentation by fiber organization or alignment\nTo begin, open the SHG images, prepare any z-projection, and assess the need for any pre-processing. For good results, high-quality images with discernable fibers and low noise are required.",
    "Optional: For preprocessing in ImageJ to increase signal-to-noise (SNR) of the SHG channel, subtract the background using a rolling ball subtraction. For most applications, use a rolling ball subtraction between 20 pixels and 50 pixels. Then smoothen the image and save it.\nOpen the OrientationJ plugin and set the processing parameters. In the OrientationJ window, define the size of the local tensor window. For a 20x image of this fiber density, set 10 pixels to 15 pixels as a starting point.\nSelect Cubic Spline as the gradient model and check the Color Survey Box. Define the color survey. Set both the Hue and Saturation as Coherency, and then define the Brightness as Original Image, hit Run.\nThe output file of the plugin is RGB colormap. Adjust the value of the local tensor window until aligned regions, as determined by the eye, are properly highlighted with blue and magenta hues.\nOnce the output image is satisfactory, separate this RGB image into 3 channels. Select Image > Color > Split Channel.\nTo enhance the appearance of aligned regions for the purpose of masking, use the image calculator by selecting Process > Image Calculator. Using this operator, subtract the green image from the blue image. For a more restrictive mask, subtract the green image from the red image. For random regions, subtract the blue channel from the green channel.\nThreshold the resulting image using the Moments algorithm. In most cases, this should not need further adjustments. However, adjust if needed. This will produce a binary image.",
    "Once the binary image is made, fill the holes by selecting Process > Binary > Fill Holes between fibers and round out the boundaries of the mask using a median filter. A median filter of 10 is a good starting point, adjust it to make a good fit for the data. Manually inspect the mask for agreement and remove any ROIs that are erroneous.\nOnce the mask is satisfactory, create a selection by selecting Edit > Selection > Create Selection. Transfer this selection to the ROI manager.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}