{
  "id": 19821,
  "origin_website": "Wiley",
  "title": "An Infectious Bursal Disease Virus (IBDV) Reverse Genetics Rescue System and Neutralization Assay in Chicken B Cells",
  "procedures": [
    "The rescue of a molecular clone of IBDV in the chicken B-cell line DT40 involves the electroporation of the DT40 cells with two reverse genetics plasmids, one encoding segment A and one encoding segment B. To evaluate the success of the rescue, cells should be fixed and stained with a primary antibody against IBDV and then a secondary antibody conjugated to a fluorophore to identify cells that are positive for virus antigen. Viral replication should be quantified by reverse transcription quantitative polymerase chain reaction (RT-qPCR). Quantification of virus should be performed over multiple passages to confirm a rising viral titer. An outline of the protocol is shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-fig-0001].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1bda72dd-1be4-486a-ab47-2d262c204351/cpz1639-fig-0001-m.jpg</p>\nFigure 1",
    "Overview of the chicken B-cell rescue system for IBDV. To rescue IBDV strains, electroporate reverse genetics plasmids for segments A and B into DT40 cells. Reverse genetics plasmids, in this example for the IBDV strain PBG98 (pRG-PBG98-A and pRG-PBG98-B), are constructed to contain an insert consisting of the self-cleaving hammerhead ribozyme (purple box) followed by the 5′ noncoding region (black box), the coding region of either segment A or B, the 3′ noncoding region (black box), and a self-cleaving hepatitis delta ribozyme (purple box), in an expression vector under the control of the CMV promoter. Then, plasmids pRG-PBG98-A and pRG-PBG98-B electroporated into DT40 cells and incubated for 48 hr at 37°C. Next, cells are passaged by the addition of fresh DT40 cells to the cultures in a 3:1 ratio and the cells are incubated for 72 hr at 37°C. After two such passages, an aliquot of the cell suspension is harvested, and virus rescue is confirmed through immunofluorescence staining of DT40 cells and RT-qPCR quantification of the cell pellet. Finally, the cells are passaged further and assessed to determine whether viral titers have increased with each passage by titrating the supernatant for viral titers and quantifying the cell pellet by RT-qPCR. The figure was created using templates from the Motifolio toolkit (Motifolio Inc., Ellicott City, MD, USA).\nMaterials\nSynthesized segment A and B from IBDV named as pIBDV-A and pIBDV-B (Gene Art; Thermo Fisher Scientific)\nNuclease-free water (Ambion, cat. no. AM9937)\nEscherichia coli DH5α (New England Biolabs: NEB® 5-alpha competent E. coli; C2984H, high efficiency)\nSOC medium (New England Biolabs: B9020S)\nLB agar plate supplemented with 5 μg/ml ampicillin\nLB broth supplemented with 5 μg/ml ampicillin (Gibco, cat. no. 10855-021)\nMaxi plasmid purification kit (Qiagen, cat. no. 12162)\nKpnI-HF® restriction enzyme (New England Biolabs, cat. no. R3142S)",
    "NheI-HF® restriction enzyme (New England Biolabs, cat. no. R3131S)\n1% (w/v) agarose/TBE gel\n6× DNA loading dye (New England Biolabs, B7024A, 10089404)\n10× TBE electrophoresis buffer (Thermo Scientific, 00786866)\n1 kb plus DNA ladder (New England Biolabs, N0550S, 10092850)\nGFX PCR DNA and Gel Band Purification Kit (Illustra, cat. no. 28903470)\npSF-CAG-KAN vector (Sigma-Aldrich, cat. no. OGS505)\nT4 DNA ligase (New England Biolabs, cat. no. M0202S)\nIce (Scotsman)\nMini plasmid preparation kit (Qiagen, cat. no. 27106)\npSF-CAG-KAN primers:\n               \npSF-CAG-KAN vector forward primer: 5′-CTACCATCCACTCGACACACC-3′ (10 μM stock; Integrated DNA Technologies)\npSF-CAG-KAN vector reverse primer: 5′-GTTGTGGTTTGTCCAAACTCATCA-3′(10 μM stock; Integrated DNA Technologies)\nOpti-MEM medium (Gibco, cat. no. 31985070)\nComplete DT40 medium (see recipe)\nDT40 cells (chicken bursal lymphoma transformed B-cell line; ATCC, cat. no. CRL-2111) grown in 75-cm2 (T75) cell culture flasks (TPP, 90076, cat. no. 20210105)\n10 mM 4dNTP mix (dATP, dCTP, dGTP, dTTP)\nGoTaq G2® Hot Start Master Mix (Promega, cat. no. M7422)\n4% (v/v) paraformaldehyde (Santa Cruz Biotechnology, cat. no. sc-281692)\nTriton™ X-100 (Scientific Laboratory Supplies, cat. no. T8787)\nPhosphate-buffered saline (PBS), pH 7.4\n4% BSA in PBS\nPrimary antibody: Mouse monoclonal raised against IBDV VP3 protein (Pirbright Institute; available on request)\nSecondary antibody: Goat anti-mouse antibody conjugated to Alexa Fluor 488 or 568 (Thermo Fisher Scientific, cat. no. A11029/A11004)\n4′,6′-Diamidino-2-phenylindole (DAPI; Thermo Fisher Scientific, cat. no. D1306)\nRNeasy mini kit (Qiagen, cat. no. 74104)\nSuperScript III Reverse Transcriptase (Thermo Fisher Scientific, cat. no. 18080044)\nTaqman Universal PCR Master Mix (Applied Biosystems, cat. no. 4352042)\nIBDV primers:\n               \nIBDV RT-qPCR forward primer 5′-GAGGTGGCCGACCTCAACT-3′ (10 μM stock; Integrated DNA Technologies)\nIBDV RT-qPCR reverse primer 5′-GCCCGGATTATGTCTTTGAAG-3′ (10 μM stock; Integrated DNA Technologies)\nIBDV Taqman Probe 5′- FAM-CCCCTGAAGATTGCAGGAGCATT-TAMRA-3′ (10 μM stock; Integrated DNA Technologies)\nRPLP0 RT-qPCR forward primer 5′-TTGGGCATCACCACAAAGATT-3′ (10 μM stock; Integrated DNA Technologies)",
    "RPLP0 RT-qPCR reverse primer 5′-CCCACTTTGTCTCCGGTCTTAA-3′ (10 μM stock; Integrated DNA Technologies)\nRPLP0 Taqman Probe 5′-FAM-CATCACTCAGAATTTCAATGGTCCCTCGGG-TAMRA-3′ (10 μM stock; Integrated DNA Technologies)\n20-, 200-, and 1000-µl LTS pipet tips (Rainin, cat. nos. 17014961, 30389276, and 17014967)\n1.5-ml microcentrifuge tubes (Sarstedt, cat. no. 1081721)\nIncubator, 37°C\nWater bath, 42°C\n15- and 50-ml sterile conical polypropylene tubes (Falcon, cat. nos. 352097 and 352070)\n5-ml sterile serological pipets (Costar, cat. no. 4487)\n10-ml sterile serological plates (Sterilin, cat. no. M420800)\n25-ml sterile serological plates (Fisherbrand, cat. no. 13-678-11)\nRotating incubator, 37°C\nAgarose gel electrophoresis apparatus\nUV transilluminator\nSurgical blades (Swann-Mortor, BS2982)\nSpectrophotometer (e.g., NanoDrop, Thermo Fisher Scientific)\nCell counting slides (Bio-Rad, cat. no. 1450011)\nAutomated cell counter (Bio-Rad, TC20)\nNEPA electroporation cuvettes (NEPA GENE, cat. no. EC-002S)\nElectroporator (NEPA GENE)\nHumidified culture incubator, 37°C ± 1°C, 5% ± 2% CO2 (Panasonic)\nMicroscope (Nikon-TMS, cat. no. 310563)\n0.5-ml PCR tubes (Sarstedt, cat. no. 9084411)\nThermal cycler (G-Storm)\n6-well plates, sterile\n96-well U-bottom plates (Thermo Scientific, cat. no. 163320)\n96-well clear, flat-bottom, polystyrene tissue culture plates, sterile (Thermo Scientific, cat. no. 167008)\nMultichannel pipet, 20-200 μl (Mettler Toledo, cat. no. 17013810)\nSterile reagent reservoirs (Star lab, cat. no. M0001636B0413)\nEpifluorescence microscope (Leica DM IRB)\nqPCR machine: e.g., QuantStudioTM 5 (Applied Biosystems)\nConstruction of full-length segment A and segment B\n1. Design the full-length sequences of segments A and B of the IBDV strain of interest, including the 5′ and 3′ noncoding regions flanked with self-cleaving ribozymes (a hammerhead ribozyme upstream and a hepatitis delta ribozyme downstream) and restriction enzyme sites (for example, KpnI-HF and NheI-HF). The constructs can be ordered from a gene synthesis service or company, for example GeneArt (Thermo Fisher Scientific), and typically arrive in a vector backbone, as lyophilized plasmids (pIBDV-A and pIBDV-B).",
    "2. Reconstitute the pIBDV-A and pIBDV-B plasmids in 50 µl each of nuclease-free water, and use them to transform competent E. coli by adding 1 µl of pIBDV-A or pIBDV-B to DH5α competent cells (50 µl) in a 1.5-ml microcentrifuge tube and incubating for 30 min on ice.\n3. Heat shock the bacteria for 45 s at 42°C and cool for 5 min on ice.\n4. Add 450 µl SOC solution to the transformation mixture and incubate 1 hr at 37°C with shaking at 300 rpm.\n5. Plate 100 μl of the mixture onto a LB agar plate supplemented with the antibiotic stipulated by the manufacturer and incubate overnight at 37°C.\n6. Pick one colony and inoculate into 5 ml of LB broth supplemented with antibiotic in a 15-ml polypropylene tube for 6 hr. Then transfer into 110 ml of LB broth supplemented with antibiotic in a conical flask.\n7. Grow the bacteria overnight in a 37°C rotating incubator.\n8. Isolate plasmids from the overnight culture using a maxi plasmid preparation kit following the manufacturer's protocol.\n9. Digest the plasmids with restriction enzymes (for example, KpnI-HF and NheI-HF) according to the manufacturer's instructions.\n10. Mix the restriction-digested product with a loading dye. Load the sample and DNA ladder into wells of a 1% agarose gel and run the gel with TBE electrophoresis buffer.\n11. Visualize the digested plasmids on a UV transilluminator: Positive clones will show two bands in each lane, one corresponding to the IBDV-A (3.4 kb) or IBDV-B (3.1 kb) and the other corresponding to the vector used by the gene synthesis company.\n12. Cut out the bands corresponding to the IBDV-A and IBDV-B genes using a surgical blade. Use a separate, new surgical blade for IBDV-A and for IBDV-B.",
    "13. Place the gel slice in a 1.5-ml microcentrifuge tube and perform a gel extraction of IBDV-A (3.4 kb) and IBDV-B (3.1 kb) using a DNA purification kit following the manufacturer's instructions.\n14. Determine the DNA concentration using a spectrophotometer.\n15. Digest the expression vector pSF-CAG-KAN (2 µg) with KpnI-HF and NheI-HF restriction enzymes. pSF-CAG-KAN carries a kanamycin-resistance gene.\nIn general, perform restriction digestion at 37°C for 3 hr, and subsequent heat inactivation at 65°C for 20 min.\n16. Mix the digest with loading dye, load the sample and DNA ladder on a 1% agarose gel and run the gel with TBE electrophoresis buffer. Confirm double digestion on the agarose gel by visualizing on a UV transilluminator, and cut out the digested bands (∼5.3 kb) using a surgical blade.\n17. Purify the digested pSF-CAG-KAN vector using a DNA purification kit following the manufacturer's instructions. Determine the DNA concentration using a spectrophotometer.\n18. Ligate the digested pSF-CAG-KAN vector with either the digested IBDV-A (3.4 kb) or the digested IBDV-B (3.1 kb), using T4 DNA ligase overnight at 4°C according to manufacturer's instructions, to prepare the reverse genetics (RG) plasmids: pRG-IBDV-A and pRG-IBDV-B.\nIn general, the ligation mixture should include a 3:1 molar ratio of DNA fragment (240 ng) to plasmid DNA (80 ng).\n19. The next day, transform E. coli by adding 5 µl of the pRG-IBDV-A or pRG-IBDV-B ligation mix to 50 µl DH5α competent cells in a 1.5-ml microcentrifuge tube and incubating 30 min on ice. Heat shock for 45 s at 42°C and then cool for 5 min on ice. Add 450 µl SOC medium to the transformation mixture and incubate for 1 hr at 37°C with shaking.",
    "20. Subsequently, plate the entire mixture (500 µl) on a LB agar plate supplemented with kanamycin and incubate overnight at 37°C.\nIn general, we use 50 µg/ml kanamycin from the 50 mg/ml stock.\n21. To screen for positive clones, pick individual colonies and inoculate into 5 ml LB broth supplemented with kanamycin in 15-ml polypropylene tubes. Grow overnight in a 37°C rotating incubator.\n22. Isolate plasmids from the overnight cultures using a mini plasmid preparation kit following the manufacturer's protocol and confirm pRG-IBDV-A- and pRG-IBDV-B-positive clones by sequencing using the pSF-CAG-KAN vector forward primer 5′-CTACCATCCACTCGACACACC-3′ and reverse primer 5′-GTTGTGGTTTGTCCAAACTCATCA-3′.\n23. Pick one positive colony for each of pRG-IBDV-A and pRG-IBDV-B, and inoculate into 5 ml of LB broth supplemented with antibiotic in a 15-ml polypropylene tube for 6 hr. Then, transfer into 110 ml of LB broth supplemented with antibiotic into a conical flask.\n24. Grow the bacteria overnight in a 37°C rotating incubator.\n25. Isolate plasmids from the overnight culture using a maxi plasmid preparation kit following the manufacturer's protocol.\nVirus rescue by electroporation of pRG-PBG98-A and pRG-PBG98-B into DT40 cells\n26. One hour before electroporation, prepare complete DT40 medium. Add 2 ml DT40 to each well of a 6-well plate and place plate in the 37°C incubator.\nIn general, keep a 6-well plate with DT40 medium at 37°C for 1 hr to pre-warm the medium.\n27. For electroporation, prepare DT40 cells (1 × 107 cells per well) in 100 µl Opti-MEM medium in electroporation cuvettes in a biosafety cabinet.\nTo count DT40 cells, we normally use cell counting slides and an automated cell counter. In general, after 3-4 days of passaging, DT40 cells are suitable for electroporation.\n28. Mix 10 µg each of pRG-IBDV-A and pRG-IBDV-B in in 100 µl Opti-MEM.",
    "29. Add the mixture of plasmids to the DT40 cells in Opti-MEM.\n30. Electroporate the mixture at 225 V with a pulse width of 2 ms poring pulse, and then transfer the electroporated mixture to 6-well plate containing complete DT40 medium. Incubate for 48 hr in the humidified 37°C, 5% CO2 cell culture incubator.\n31. At 48 hr after the electroporation, “feed” the cell cultures with fresh DT40 cells (∼1 × 106 cells).\n32. Every 72 hr, feed cultures with fresh DT40 cells in a 3:1 ratio of fresh to old cells.\n33. After two passages, confirm the presence of rescued virus by fluorescence microscopy and RT-qPCR.\nConfirmation of rescued virus in DT40 cells by fluorescence microscopy and RT-qPCR\n34. Harvest 500 µl (∼3 × 106 cells) of the DT40 cell suspension, in duplicate aliquots. Prepare a DT40 cell pellet from one aliquot by centrifugation for 5 min at 1200 rpm. Then, extract RNA from a DT40 cell pellet, and perform virus quantification by RT-qPCR (steps 49-54). Confirm the presence of the recovered virus by immunofluorescence staining of another aliquot of cells using a primary antibody against IBDV and a secondary antibody conjugated to a fluorophore, and imaging with a fluorescence microscope (steps 36-48).\n35. After confirming virus recovery, continue to passage the recovered virus in DT40 cells in a 6-well plate, and titrate to determine whether viral titers have increased.\nQuantification of rescued virus in DT40 cells by immunofluorescence microscopy\n36. Titrate the recovered virus using DT40 cells (1 × 105 cells/well) in a 96-well U-bottom plate, and incubate the plate for 3 days at 37°C.\n37. Add 180 µl DT40 cells (1 × 105 cells/well) in complete DT40 medium into each well of a 96-well U-bottom plate.",
    "38. Prepare a 10-fold serial dilution of recombinant recovered virus in complete DT40 medium by adding 20 µl of the undiluted recombinant recovered virus to the first column of the plate, in quadruplicate.\n39. Using a multichannel pipettor, mix the samples in each well at least five times, and then make a ten-fold dilution of the samples by transferring 20 µl to the second column (i.e., moving left to right across the plate).\nChange the tip for each dilution pipetting step.\n40. Repeat the dilutions from the second column to the third column, and continue until the last column. Discard 20 µl from the last column.\n41. Incubate the plate for 3 days at 37°C.\n42. After 3 days, remove the medium. Fix the cells in 4% paraformaldehyde diluted in PBS for 20 min at room temperature, permeabilize with 0.1% Triton X-100 diluted in PBS for 10 min, and block with a 4% BSA solution for 60 min.\n43. Incubate the cells with a primary antibody raised against IBDV, for example a mouse monoclonal antibody against the IBDV VP3 protein, for 1 hr at room temperature.\n44. Wash the cells with PBS and incubate with a secondary antibody conjugated to a fluorophore, for example Alexa Fluor 488 or 568, for 1 hr at room temperature in the dark.\n45. Wash cells and incubate for 10 min in DAPI solution.\nIn general, we use a 1 in 10,000 dilution of DAPI in PBS.\n46. Transfer cells to 96-well clear, flat bottom plates to calculate viral titers or image cells.\n47. Titrate or image cells using epifluorescence microscope such as a Leica DM IRB.",
    "48. The highest dilution of the virus in which 50% of the wells show a VP3 signal is considered to be the endpoint, and the virus titer is calculated from the tissue culture infective dose-50 (TCID50), according to the method of Reed and Muench, and expressed as TCID50/ml (Reed & Muench, 1938[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-bib-0025]).\nQuantification of rescued virus in DT40 cells by RT-qPCR of rescued virus cell pellet in DT40 cells\n49. Extract total RNA from the DT40 cell pellet (∼3 × 106 cells) using an RNeasy kit according to the manufacturer's instructions.\n50. Quantify the RNA samples using a NanoDrop or other spectrophotometer.\n51. Perform reverse transcription of the RNA to generate cDNA using SuperScript III Reverse Transcriptase, following the manufacturer's instructions in regard to reaction constituents and conditions.\n52. For virus quantification, perform qPCR using TaqManTM Universal qPCR Master Mix, according to the manufacturer's instructions.\n53. Quantify IBDV replication by qPCR using IBDV primers and a Taqman probe with a qPCR machine, such as a QuantStudioTM 5, with appropriate cycling conditions, for example: 95°C for 10 min followed by 40 cycles of 95°C for 15 s, 60°C for 1 min, 95°C for 15 s, 60°C for 1 min, 95°C for 30 s, and 60°C for 15 s (Dulwich et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-bib-0007], 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-bib-0020]).\n54. Normalize target genes expression to a housekeeping gene, such as RPLP0, using primers and a Taqman probe and compare to the mock controls using the comparative delta CT (2–ΔΔCT) method (Dulwich et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-bib-0007], 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-bib-0005]; Staines et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-bib-0028]).",
    "This protocol describes an in vitro neutralization assay in the chicken B-cell line DT40, to quantify the titer of antibodies present in polyclonal sera. Briefly, the IBDV is mixed with serial dilutions of heat-inactivated sera and incubated at 37°C for 1 hr. Then, DT40 cells are added. After 3 days of culture, the infected cells are fixed and stained with an anti-IBDV monoclonal antibody and secondary antibody conjugated to a fluorophore and wells are either scored or positive or negative for virus antigen and the virus neutralization titer (VNT) quantified. An outline of the neutralization assay is presented in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-fig-0002].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/bc925d9d-ae4f-46fa-924d-2da534b45232/cpz1639-fig-0002-m.jpg</p>\nFigure 2\nOverview of the chicken B-cell neutralization assay for IBDV. Antibodies in polyclonal serum samples can be assessed for their neutralization capacity against diverse IBDV strains. After serial dilution of the heat-inactivated serum samples, the virus to be tested is added at 103 TCID50/ml and incubated for 1 hr at 37°C. DT40 cells are added to the serum/virus mix and the combination is incubated for 72 hr at 37°C. Cells are then fixed and stained with a monoclonal antibody against an IBDV antigen to identify wells that are positive or negative for IBDV, and finally the viral neutralization titers (VNT) are determined. Sample VNT titers are shown in the table. The figure was created using templates from the Motifolio toolkit (Motifolio Inc., Ellicott City, MD, USA).\nMaterials\nComplete DT40 medium (see recipe)\nSerum samples to be tested\nPositive serum control samples with known neutralization activity\nVirus stock to be tested\nDT40 cells (chicken bursal lymphoma transformed B-cell line; ATCC cat. no. CRL-2111) grown in 75-cm2 (T75) cell culture flasks (TPP, 90076, cat. no. 20210105)\n0.4% trypan blue (Gibco, cat. no. 15250061)\nPhosphate-buffered saline (PBS)\nNegative control (PBS)",
    "15- and 50-ml sterile conical polypropylene tubes (Falcon, cat. nos. 352097 and 352070)\n5-ml sterile serological pipets (Costar, cat. no. 4487)\n10-ml sterile serological plates (Sterilin, cat. no. M420800)\n25-ml sterile serological plates (Fisherbrand, cat. no. 1367811)\n1.5-ml microcentrifuge tubes (Sarstedt, cat. no. 1081721)\n20- and 200-µl LTS pipet tips (Rainin, cat. nos. 17014961 and 30389276)\nCell counting slides (Bio-Rad, cat. no. 1450011)\nMultichannel pipet, 20-200 μl (Mettler Toledo, cat. no. 17013810)\nSterile reagent reservoirs (Star lab, cat. no. M0001636B0413)\n96-well U-bottom plates (Thermo Scientific, cat. no. 163320)\n96-well clear, flat-bottom, polystyrene tissue culture plates, sterile (Thermo Scientific, cat. no. 167008)\nAutomated cell counter (Bio-Rad, TC20)\nHumidified culture incubator, 37°C ± 1°C, 5% ± 2% CO2 (Panasonic)\nMicroscope (Nikon-TMS, cat. no. 310563)\nEpifluorescence microscope (Leica DM IRB)\nPrepare plates of serially diluted serum samples\n1. Prepare the number of 96-well U-bottom plates required for the assay, and label the lids.\nKeep four controls on each plate: (i) positive serum and virus, (ii) positive serum only, no virus, (iii) virus only, no serum, and (iv) no serum, no virus. Set up all controls in quadruplicates.\n2. Using a multichannel pipet, add 50 µl complete DT40 medium to each well in columns 2-12.\n3. Heat inactivate all the serum samples at 56°C for 30 min. Add 100 µl heat-inactivated serum, diluted to 1:20 in complete DT40 medium, to the first column in quadruplicate.\n4. Using a multichannel pipettor, mix the samples at least five times, and then make a two-fold dilution of serum by transferring 50 µl from the first column to the second column.\nChange tips for every dilution pipetting step.\n5. Repeat the dilutions from second column to third column, and continue until the last column. Discard 50 µl from the last column to make the volumes of plate equal.",
    "6. Dilute an IBDV stock to a titer of 103 TCID50/ml, and add 50 µl to each well of the serially diluted serum wells using multichannel pipet. Change tips after each virus adding step.\n7. Include four controls, setting up each one in quadruplicate:\n         \nPositive serum and virus;\nPositive serum only, no virus;\nVirus only, no serum;\nNo serum, no virus.\nPositive serum are samples with known neutralization activity. Positive virus is presence of virus with titer of 103 TCID50/ml.\n8. Incubate the plates at 37°C for 1 hr.\nCalculation of DT40 cell number and addition to virus and serum mixture\n9. Record the cell passage number and date of the most recent split DT40 cells in culture and grow cell stocks in T75 cell culture flasks.\nIn general, 0.4% trypan blue is used for calculation of DT40 cell viability.\n10. On the day of virus neutralization, dilute the DT40 cells to 1 × 106 cells/ml in complete DT40 medium, and add 80 μl to each well (8 × 104 cells per well) of a 96-well U-bottom plate using a multichannel pipet.\nEach plate requires ∼8 ml of cells.\nCalculation of neutralization titer\n11. Incubate the plates at 37°C for 72 hr.\n12. After 72 hr of incubation, follow the staining protocol described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-prot-0001], steps 42-45.\n13. Transfer cells to 96-well clear, flat bottom plates to calculate VNT.\n14. Calculate VNT based on the highest dilution of serum where there are no IBDV antigen positive cells, and express as log2 value.\nVNT are calculated under an epifluorescence microscope, and sample VNT values are shown in the table in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-fig-0002]. Sample VNT titers are shown in the table in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.639#cpz1639-fig-0002]."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}