{
  "id": 10459,
  "origin_website": "Jove",
  "title": "Transient Expression in Red Beet of a Biopharmaceutical Candidate Vaccine for Type-1 Diabetes",
  "procedures": [
    "1. Red beet and spinach cultivation\nGrow red beet (B. vulgaris cv Moulin Rouge) and spinach (S. oleracea cv Industria) plants in a growth chamber, using 150 µE of light intensity, 65% relative humidity, 12 h light/dark cycle at 23/21 °C, respectively.\nAfter seed germination, fertilize the plants twice a week with a 1 g/L solution of a commercially available fertilizer (Table of Materials). For agroinfiltration use five-week-old spinach and six-week-old red beet plants.\n2. Transient expression through the deconstructed plant virus-based technology\nConstruction of plant expression vectors\n\t\nIntroduce the vectors - the 5’ module (pICH20111), the 3’ modules (pICH31070.GAD65mut, pICH31070.∆87G65mut and pICH7410.eGFP), prepared as previously described1,2,7, and the integrase module (pICH14011) - in Agrobacterium tumefaciens GV3101 strain using standard techniques. Grow on LB medium containing 50 μg/mL rifampicin and appropriate vector-specific antibiotics (50 μg/mL carbenicillin for pICH20111, pICH14011 and pICH7410.eGFP, 50 μg/mL kanamycin for pICH31070) for 2 days at 28 °C.\nScreen the colonies by colony PCR using the following specific primers for each vector: 5’-ATCTAAGCTAGGGTACCTCG-3’ and 5’-ACACCGTAAGTCTATCTCTTC-3’ for both the 3’ modules pICH31070.GAD65mut and pICH31070.∆87G65mut, with an annealing temperature of 55 °C and an elongation time of 110 s, 5’-TGAAGTTCATCTGCACCAC-3’ and 5’-ACACCGTAAGTCTATCTCTTC-3’ for the third 3’ module pICH7410.eGFP, with an annealing temperature of 53 °C and an elongation time of 30 s, 5’-AATGTCGATAGTCTCGTACG-3’ and 5’-TCCACCTTTAACGAAGTCTG-3’ for the 5’ module, with an annealing temperature of 53 °C and an elongation time of 20 s and 5’-GGCAACCGTTATGCGAATCC-3’ and 5’-GATGCGTTCCGCAACGAACT-3’ for the integrase module with an annealing temperature of 57 °C and an elongation time of 45 s.",
    "Carry out the PCR reaction in a total volume of 20 μL using the following specific reaction cycle: 5 min initial denaturation at 95 °C, 35 cycles of 30 s at 95 °C, 30 s at the annealing temperature and the elongation step at 72 °C (annealing temperature and elongation time are specific for each primer couple) and a final elongation step of 7 min at 72 °C.\nSyringe agroinfiltration\n\t\nInoculate the three A. tumefaciens transformants in 50 mL of LB medium containing 50 μg/mL rifampicin and the following appropriate vector-specific antibiotics: 50 μg/mL carbenicillin for A. tumefaciens transformed with pICH20111, pICH14011 or pICH7410.eGFP, or 50 μg/mL kanamycin for A. tumefaciens transformed with pICH31070. Grow by shaking overnight at 28 °C.\nPellet overnight bacterial cultures by centrifugation at 4,500 x g for 20 min and resuspend them in 100 mL (or two volumes of the initial bacterial culture) of infiltration buffer containing 10 mM 4-morpholineethanesulfonic acid (MES; pH 5.5) and 10 mM MgSO4, without considering the OD600. Incubate the suspensions at room temperature (RT) for 3 h.\nMix equal volumes of bacterial suspensions containing one of the three modules, GAD65mut, ∆87GAD65mut or eGFP 3’ module, with 5’ module and integrase module. Use the suspension mix for syringe infiltration of red beet and spinach leaves.\nPlace 5 mL of the suspension in a syringe without the needle. Press the tip of the syringe against the underside of the leaf for both spinach and red beet plants, and meanwhile apply a gentle counterpressure to the other side of the leaf.\nInfiltrate the first three completely expanded leaves starting from the apex for each plant. Label the agroinfiltrated leaves with a paper tag on the leaf stem. Return the plants in a growth chamber under standard conditions.",
    "NOTE: For health and safety reasons, wear eye protection and gloves during infiltration process.\nCollect agroinfiltrated leaves from 4 to 14 days post infection (dpi) and freeze them in liquid nitrogen. Store plant tissue at -80 °C.\nVacuum agroinfiltration\n\t\nGrow separately the three A. tumefaciens transformants in 50 mL of LB medium containing 50 μg/mL rifampicin and appropriate vector-specific antibiotic by shaking overnight at 28 °C.\nPellet overnight bacterial cultures by centrifugation at 4,500 x g for 20 min. Resuspend the pellet in 1 L of infiltration buffer to an OD600 of 0.35 and incubate the suspensions at RT for 3 h.\nAdd 0.01% v/v of the detergent (polysorbate 20) to each suspension. Mix equal volumes of bacterial suspensions containing one of the three modules, GAD65mut, ∆87GAD65mut or eGFP 3’ module, with 5’ module and integrase module.\nInsert one plant (six-week-old red beet plant, see section 1) in the holder. Invert the holder and place on top of a beaker containing the infiltration bath (2 L) to submerge the leaves in the infiltration suspension.\n\t\tNOTE: Ensure that all the leaves are completely dipped in the bacterial suspension. Raise the level with the addition of extra infiltration suspension if required.\nTransfer the infiltration bath with the submerged plant to the infiltration chamber and close it. Turn on the vacuum pump and open the vacuum intake valve on the infiltration chamber.\nOnce the pressure in the infiltration chamber has reduced to 90 mbar, keep the vacuum for 3 min. Release the vacuum for 45 s. Once the infiltration chamber has returned to atmospheric pressure, open the chamber and remove the infiltrated plant from the bacterial bath.\nReturn the plants in a growth chamber under standard conditions.",
    "Collect agroinfiltrated leaves at the maximum expression dpi, depending on the recombinant protein, and freeze them in liquid nitrogen. Store plant tissue at -80 °C.\n3. Recombinant protein expression analysis\nTotal soluble protein (TSP) extraction\n\t\nGrind the syringe or vacuum infiltrated red beet and spinach leaves, collected in steps 2.2.6 and 2.3.8, to fine powder in liquid nitrogen using mortar and pestle. Transfer the powder into 15 mL plastic tubes and store the material at -80 °C.\nAdd 900 µL of extraction buffer (50 mM sodium phosphate pH 8.0, 20 mM sodium metabisulphite) to 300 mg of leaf powder.\n\t\tNOTE: The selected ratio between plant tissue weight (mg) to buffer volume (µL) is 1:3.\nHomogenize the mixture by vortexing for 1 min, then centrifuge at 30,000 x g for 40 min at 4 °C.\nCollect the supernatant in a clean tube and store it at -80 °C.\nPlant eGFP visualization and quantification\n\t\nLoad 100 µL of each TSP extract obtained from eGFP expressing leaves, in three technical replicates, on a 96-well plate.\nPut the 96-well plate in a fluorescence reader and start the measurement. Use the 485/535 nm filter set required for eGFP fluorescence detection.\nFor the absolute quantification, in the same plate prepare a calibration curve loading different quantities (62.5, 125, 500, 750 and 1,000 ng) of a purified eGFP.\nBicinchoninic acid (BCA) assay for TSP quantification\n\t\nMix 50 parts of Reagent A (Table of Materials) with 1 part of Reagent B (Table of Materials). Prepare sufficient volume of fresh BCA working solution for the samples to be assayed and the calibration standards.\n\t\tNOTE: The volume of BCA working solution required for each sample is 1.9 mL. For the standard procedure with 9 standards (including a blank), 17.1 mL of BCA working solution is required.",
    "Pipette 0.1 mL of each standard (including a blank), and TSP extracts into a labelled tube.\n\t\tNOTE: As calibration standards, prepare a fresh set of bovine serum albumin (BSA) standards in the 10-1,000 μg/mL range, preferably using the same diluent as samples, such as water. The blank consists of 0.1 mL of the diluent used for calibration standard and sample preparation.\nAdd 1.9 mL of BCA working solution and mix thoroughly. Cover the tubes and incubate at 37 °C for 30 min.\nCool the tubes to RT. Measure the absorbance at 562 nm of all the samples within 10 min.\n\t\tNOTE: Even at RT, the color development continues. No significant error will be introduced if the absorbance measurements of all tubes are done within 10 min.\nSubtract the 562 nm absorbance value of the blank from the readings of the standards and the TSP extracts.\nPlot the blank-corrected 562 nm reading for each standard on its concentration. Determine the protein concentration of each TSP extract.\nPerform Coomassie gel staining as previously described in Gecchele et al.8.\nWestern blot analysis\n\t\nPerform the western blot analysis as previously described in Gecchele et al.8.\nAfter the electrophoretic separation of proteins, transfer them onto a nitrocellulose membrane using standard techniques. Prepare the blocking solution by mixing 4% milk in phosphate-buffered saline (PBS) pH 7.4. Block the membrane with 10 mL of the blocking solution at RT for 1 h.\nPrepare the rabbit primary antibody at 1:10,000 for the anti-GAD65/67 and anti-LHCB2, and at 1:20,000 for the anti-eGFP in 5 mL of blocking solution with 0.1% detergent. Incubate the membrane with the prepared primary antibody solutions overnight at 4 °C or for 4 h at RT with constant agitation.",
    "Discard the primary antibody and wash the membrane 3 times for 5 min each with blocking solution containing 0.1% detergent.\nPrepare the horseradish peroxidase (HRP)-conjugate anti-rabbit antibody at 1:10,000 in blocking solution with 0.1% detergent. Incubate the membrane for 1.5 h at RT with constant agitation.\nDiscard the secondary antibody and wash the membrane 5 times for 5 min each with PBS-T (PBS supplemented with 0.1% detergent).\nIncubate the membrane with a commercially available luminol solution following the manufacturer’s instructions. Detect the signal using a chemiluminescence imaging system.\n4. Plant material processing\nHarvest the vacuum agroinfiltrated ∆87GAD65mut-expressing red beet leaves at the expression peak (11 dpi) and freeze them in liquid nitrogen.\nLyophilize the frozen leaves for 72 h at -50 °C and 0.04 mbar. Store them at -80 °C.\nGrind the leaves to fine powder and store it at RT in a sealed container with silica gel to exclude the moisture.\n5. Gastric digestion simulation and cell integrity analysis\nGastric digestion simulation\n\t\nWeigh 100 mg of grinded freeze-dried red beet leaves and resuspend it in 6 mL of PBS (pH 7.4).\nAdjust the sample pH to 2 with 6 M HCl.\nAdd 4 mg/mL pepsin from porcine gastric mucosa in 10 mM HCl to obtain a final pepsin concentration of 1 mg/mL or a ratio of 1:20 to total soluble proteins. Shake the sample at 37 °C for 120 min.\nAdjust the samples to pH 8 with 1 M NaOH to inactivate the pepsin.\nCentrifuge 750 µL aliquots of each sample at 20,000 x g for 20 min at 4 °C. Collect separately the supernatant and resuspend the pellet in one supernatant volume of loading buffer (1.5 M Tris HCl, pH 6.8, 3% SDS, 15% glycerol, and 4% 2-mercaptoethanol).",
    "NOTE: For health and safety reasons, wear gloves and work under fume hood for sample preparation.\nAnalyze both the supernatant and the resuspended pellet by western blot analysis8.\nCell integrity analysis\n\t\nPrepare two samples of 100 mg of grinded freeze-dried red beet leaves and resuspend both in 6 mL of PBS (pH 7.4).\nAdjust the pH of only one sample to 2 with 6 M HCl. Shake both samples at 37 °C for 120 min.\nCentrifuge 750 µL aliquots of each sample at 20,000 x g for 20 min at 4 °C. Collect separately the supernatant and resuspend the pellet in one supernatant volume of loading buffer.\nAnalyze both the supernatant and the resuspended pellet by western blot analysis.\n6. Bioburden assay\nWeigh 100 mg of freeze-dried red beet leaves. Resuspend the powder in 8 mL of sterile PBS (pH 7.4) and vortex for 1 min.\nPrepare the LB medium without antibiotics or containing (i) 50 µg/mL rifampicin, (ii) 50 µg/mL each of rifampicin and carbenicillin, (iii) 50 µg/mL each of rifampicin and kanamycin, or (iv) 50 µg/mL each of rifampicin, carbenicillin, and kanamycin.\nPlate 1 mL of each freeze-dried leaf homogenate in one of the 5 selective LB media.\nIncubate all the plates for 3 days at 28 °C.\nCount the Agrobacterium colonies grown on each plate.\nCalculate and define the residual bacterial charge as the number of colony forming units (CFU) per mL of the freeze-dried leaf homogenate (CFU/mL).\n7. Metabolite extraction\nPrimary metabolite extraction\n\t\nWeigh 30 mg of -80 °C stored, vacuum agroinfiltrated ∆87GAD65mut-expressing red beet leaf powder in a 2 mL plastic tube.\nAdd 750 µL of cold 70/30 (v/v) methanol/chloroform and vortex for 30 s. Incubate at -20 °C for 2 h.\n\t\tNOTE: All the solvents and additives must be LC-MS grade.",
    "Add 600 µL of cold water and centrifuge at 17,900 x g at 4 °C for 10 min. Collect and transfer the upper hydroalcoholic phase into a new 2 mL tube. Discard the lower chloroformic phase and the interphase.\nPut the samples into a vacuum concentrator for 3 h to evaporate the solvents.\nDissolve the pellet obtained from step 7.1.4 in 300 µL of 50/50 (v/v) acetonitrile/water and sonicate the samples for 3 min.\nPass the solutions through 0.2 μm membrane filters and put them into a transparent fixed 300 µL insert glass tubes.\nSecondary metabolite extraction\n\t\nWeigh 300 mg of -80 °C stored, vacuum agroinfiltrated ∆87GAD65mut-expressing red beet leaf powder in a 15 mL plastic tube.\nAdd 3 mL of methanol, vortex for 30 s, and sonicate at 40 kHz for 15 min.\n\t\tNOTE: All the solvents and additives must be LC-MS grade.\nCentrifuge the samples at 4,500 x g at 4 °C for 10 min and transfer the supernatants into new 15 mL tubes.\nDilute 100 µL of extract 1:3 (v/v) with water and pass the solution through a 0.2 μm membrane filter.\nPut the solution into a transparent fixed 300 µL insert glass tube.\nPolar lipid extraction\n\t\nWeigh 200 mg of -80 °C stored, vacuum agroinfiltrated ∆87GAD65mut-expressing red beet leaf powder in a 15 mL plastic tube.\nAdd 200 µL of water and then 2 mL of methanol, and then keep on ice for 1 h.\n\t\tNOTE: All the solvents and additives must be LC-MS grade.\nVortex for 30 s and sonicate at 40 kHz for 15 min.\nCentrifuge the samples at 4,500 x g at 4 °C for 25 min. Collect and transfer the chloroform phase into 2 mL tubes. Discard the upper hydroalcoholic phase and the interphase.",
    "Put the samples into a vacuum concentrator for 3 h to evaporate the solvent.\nDissolve the pellet obtained from step 7.3.5 with 600 µL of methanol.\nDilute 100 µL of extract 1:5 (v/v) with methanol and pass the solution through a 0.2-μm membrane filter.\nPut the solution into a transparent fixed 300 µL insert glass tube.\n8. Liquid chromatography mass spectrometry analysis and data processing\nSet up the LC-MS system as recommended by the supplier.\n\tNOTE: The LC section consists of an autosampler coupled with HPLC equipped with a C18 guard column (75 x 2.1 mm, particle size 5 µm) in front of a C18 column (150 x 2.1 mm, particle size 3 µm) for the analysis of secondary metabolites and polar lipids, whereas with a HILIC guard column (7.5 x 2.1 mm, 3 µm) in front of an HILIC column (150 x 2.1 mm, particle size 2.7 µm). The MS is an ion trap mass spectrometer provided with either an electrospray ionization (ESI) or an atmospheric pressure chemical ionisation (APCI) sources.\nPrepare the appropriate solvents for the HPLC gradients. For primary metabolite analysis, use 20 mM ammonium formate as solvent A; 95% acetonitrile, 5% water plus 10 mM ammonium formate as solvent B. For secondary metabolite analysis, use water plus 0.05% formic acid (A) and acetonitrile plus 0.05% formic acid (B). For polar lipid analysis, use water plus 0.05% formic acid (A) and 100% acetonitrile (B).\n\tNOTE: The solvents and additives must be LC-MS grade.\nUse the gradients reported in Table 1 for metabolite elution. Set the flow rate at 0.2 mL/min. Inject 10 µL of each sample for both secondary metabolites and polar lipids, whereas inject 5 µL for primary metabolites.",
    "Prepare a quality control (QC) sample by mixing equal portions of different samples to have a representative mixture of each experimental condition. Analyse the QC sample during the experiment to monitor instrument efficiency. Specifically, insert a QC sample analysis after each 10 sample-batch.\nRandomize the samples to avoid instrument-driven effects.\nAfter 9 analyses, insert a column cleaning method and a blank analysis immediately after.\n\tNOTE: Perform a slow gradient between the two solvents with an isocratic elution at high percentage of the strongest solvent. The blank consists of an injection of a pure methanol: water (50/50, v/v) to improve retention time reproducibility in the following analysis.\nSet up the instrument to acquire mass spectra in alternate positive and negative ionization modes using the parameters listed in Table 2.\n\tNOTE: Other parameters depend on the specific platform.\nPerform the next data processing as explained in Dal Santo et al.9.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}