{
  "id": 13390,
  "origin_website": "Jove",
  "title": "Thin Film Composite Silicon Elastomers for Cell Culture and Skin Applications: Manufacturing and Characterization",
  "procedures": [
    "Caution: Please consult all relevant material safety data sheets (MSDS) before use. Some of the chemicals used in this protocol are irritants, acutely toxic and/or carcinogenic. Please use all appropriate safety practices when handling these chemicals. This includes the use of engineering (chemical cabinet) and personal protective equipment (safety glasses, gloves, lab coat, full length pants and closed-toe shoes). Portions of the following procedures involve the culture of an animal cell line. Therefore, please follow the specific biosafety regulations. Chemical and biological waste needs to be disposed according to the specific national and institutional rules and recommendations.\n1. Preparation of Silicon Elastomeric Thin Film Composite Structures\nPreparation of polymers\nTo prepare 1.1 g of PDMS in the ratio 10:1, mix 1.0 g of compound A with 0.1 g of compound B.\nMix and degase the pre-polymers in a speed mixer at 2350 rpm under vacuum for 3 min.\nChange the mass ratios between compound A and compound B to 45:1 and 70:1. Prepare them similar to the method described in 1.1.2.\nPrepare 1 g of the soft skin adhesive (SSA) in the ratio of 50:50. Therefore mix 0.5 g of compound A and 0.5 g of compound B as described in 1.1.2.\nPreparation of poly-(vinyl alcohol) (PVA) coated PET foil\nPrepare a 18% (w/w) PVA solution in water by adding PVA to deionized water and mix overnight with a magnetic stirrer. Store this solution at 4 °C.\nPrepare thin films exhibiting an effective thickness of 15 µm with the doctor blade application machine, using 100 µm gap of the blade and a velocity of approx. 2.0 mm/s.\nPlace the films in an oven at 95 °C for 15 min.\nPreparation of the backing-layer of PDMS 10:1 mixing ratio by doctor blade technique",
    "Use an automatically controlled doctor blade application machine for the preparation of the thin films.\nClean the PET foil with 100% isopropanol and place it on the surface of the doctor blade application area.\nPlace the doctor blade on top of the foil and adjust the thickness with the micro positioning screws. For manufacturing of the wet layers, apply thicknesses of 60 µm, 100 µm, 200 µm and 500 µm.\nFill the PDMS 10:1 polymer prepared in step 1.1 into the reservoir of the doctor blade with a single use syringe. Start movement of the blade with a velocity of approx. 2.0 mm/s.\nRemove the PET film with the applied 10:1 coating from the machine and place it in an oven for 1 h at 95 °C, located in a room exhibiting humidity between 40% and 65%.\nClean the doctor blade with isopropanol and paper towels.\nRepeat this procedure for all required thicknesses.\nPreparation of the top layer of PDMS in different mixing ratios by doctor blade technique\nRemove thin stripes of the length sides of the underlying film with a scalpel or razor blade to allow placement and sliding of the doctor blade on the PET foil.\nFollow protocol steps 1.3.3 to 1.3.6. Wet thickness applied for the film is 160 µm.\nRepeat this procedure for the production of two independent films each with another mixing ratio of the PDMS components (45:1 and 70:1). Store the films at room temperature (approx. 22 °C and at a humidity between 40 and 65%) in square Petri dishes to prevent them from contamination and dust.\nPreparation of thin composite films exhibiting different thicknesses of the SSA 50:50 layer\nPrepare PDMS 10:1 films as a backing-layer, as described before in step 1.3.",
    "Follow protocol steps 1.4.1 and 1.4.2 to produce these films. Use SSA in the mixing ratio of 50:50 and manufacture a film with a wet thickness of 40 µm.\nRepeat the procedure for the additional wet thicknesses of: 120 µm, 300 µm, 500 µm.\n2. Normal Adhesion Measurements Using Substrates with Different Surface Roughness\nPreparation and characterization of glass substrates with different surface roughness\nUse a glass cylinder with 2 mm diameter as a 'smooth substrate'.\nTo manufacture the 'rough substrate' excise with a glass cutter a piece with the dimension of about 4x4 mm from a frosted glass slide. Use an abrasive diamond hand pad to obtain a circular area of approx. 3 mm diameter.\nAttach the glass to an aluminum cone with UV glue and illuminate it in the UV illumination chamber for 3 min.\nDetermine the radius of the surface area of the substrate with an optical microscope. Calculate the area according to the formula A = πr2.\nDetermine the roughness parameter Ra and Rz (according to: DIN EN ISO 4287, ASME B46.1) with a stylus profilometer.\nAffix the substrate on the sample stage of the profilometer and bring the tip (diamond, standard: 2 µm/60°) into contact with the sample.\nRecord the roughness profile with a velocity of 0.3 mm/s and a length of 1 mm.\nTo analyze the surface topography, measure an area of exactly 1 mm2 with a stylus profilometer, operated by the associated software.\n\t\tNOTE: The profilometer is operated by an external computer. The holder is shifted by 0.001 mm in y direction after a displacement of 1 mm is reached in x direction. The recorded .RS3 file is imported in Surfcom Map Expert Software to create 3D images.\nNormal adhesion measurement of thin films manufactured of PDMS or SSA",
    "Use a razor blade to cut the films on the PET foil into small pieces with an area of about 4.0 cm2 and place them on a glass slide with UV glue. Illuminate with UV light for 3 min.\nMount the polymeric sample on the sample holder.\nClean the substrate surface gently with ethanol and dry with nitrogen gas.\nAttach the glass substrate, mounted to the aluminum cone, to the load cell.\nUse the tiltable table (goniometer) to align the surfaces precisely by adjusting the tilt angle of the substrate approaching the polymeric film. In order to do this, bring the substrate manually in contact with the film. Change the tilt angle until a completely parallel alignment of both surfaces to each other, visualized by the cameras images, is obtained.\n\t\tNOTE: The load cell is connected to the tiltable table. A glass prism is located below the sample as shown in Figure 4, allowing visualization of the contact area with two cameras and enabling the alignment of the substrate on the polymer film.\nMove the substrate to the polymeric film surface until a preload stress of 13 ± 5 kPa is achieved (Figure 4).\nStart the custom programmed software package written in LabView to control the required measurement parameters such as hold time and approach/retraction velocity. The hold time thold is 1 second, the approach and detachment velocity is 30 µm/s and 10 µm/s respectively.\nPerform adhesion measurements on three independent manufactured samples and at six different locations on each film surface.\nData analysis and calculation of key mechanical factors: pull-off stress and work of separation.\nCalculate the stress imgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq1.jpg by dividing the recorded force by the substrate area AS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq2.jpg\nDetermine the pull-off stress, which is described as the maximum value of the normal stress.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq3.jpg",
    "Obtain the displacement Δs by subtraction of the start position of the tensile regimes0 from the sample position send where de-bonding has been completed. Define the start of the tensile regime as s0 = 0.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq4.jpg\nCorrect the measured values of the sample position by the system compliance C according to the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq5.jpg\nIntegrate the stress-displacement curve between s0 and send in order to calculate the work of separation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq6.jpg\nCalculation of key mechanical factors using mathematical computing software Origin.\nImport the recorded .dat file from a single adhesion measurement in an origin table. The parameters that are recorded are time, sample position and force. Insert these parameters in the columns A (time), B (sample position) and C (force).\nTo determine the blank value, average about 20 measurement values of the force before contacting the polymer film. Name this average value Foffset and paste it in column D.\nCalculate the background corrected force F* according to the following equation\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq7.jpg\n\t\tand insert this equation, as shown below, into column E.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq8.jpg\nDefine the start of the tensile regime as zero displacement, i.e., s0 = 0. Therefore, determine s0 and subtract it from the displacement in Column B and save it in Column F:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq9.jpg\nFurthermore, correct the sample position by the machine compliance. This correction is performed in column G. Insert the following equation into column G\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq10.jpg\nCalculate the stress in the next column H. Therefore, divide the force by the substrate area. Insert the following equation\nimgsrc://cloudfront.jove.com/files/ftp_upload/57573/57573eq11.jpg\n\t\twhere A is the surface area of the glass substrates in mm2 (determined in 2.1).",
    "Calculate the work of separation from the stress and displacement values. Therefore, plot the displacement along the x-axis and the stress along the y-axis. Integrate this graph from s0 to send where send is defined as the displacement at which tensile stress returns to zero, i.e. full detachment took place. To integrate the graph, choose the integrate function. Add the calculated values into columns I and J.\n3. Characterization of the Films by Scanning Electron Microscopy (SEM) and Optical Microscopy\nOptical microscopy\nWith a razor blade cut the polymeric film into small pieces (approx. 0.25 cm2) and attach them to the edge of a glass slide. Place the glass slide vertically orientated under an upright microscope and measure the thickness of the film cross-section.\n\t\tNOTE: Use a 20X objective (NA = 0.45, theoretical resolution at 800 nm of 1.1 µm) to measure film thickness values of approx. ≤ 20 µm. For a film thickness in the range of 20 µm up to 50 µm use a 10X objective (NA = 0.30, theoretical resolution at 800 nm of 1.6 µm) and for a film thickness ≥ 50 µm use a 5X objective (NA = 0.15, theoretical resolution at 800 nm of 3.3 µm).\nSEM investigation\nCut the PET foil and attach a sample of approx. 2 cm2 to a glass slide and place it vertically to the clamping mechanism inside the sample holder ≤ 2 mm below the top surface of the holder.\nSelect an acceleration voltage of 10 kV, the backscattered electron detector (BSD) and low vacuum conditions (60 Pa).\nAdjust the focus, magnification, brightness and contrast of the images.\nChoose an image acquisition time of 28 s with a resolution of 1024 x 2048 pixels.\nRemove the sample holder from the SEM.\n4. Biological Investigation",
    "Routine cell Culture of L929 cells\nUse the murine fibroblast cell line L929 for investigation. Culture the cells in Rosewell Park Memorial Institute (RPMI) 1640 basal medium, supplemented with 10% fetal bovine serum and penicillin und streptomycin at 37 °C, 5% CO2 in T75 cell culture flasks. Passage the cells at a confluence of approximately 70% to 80%.\nFor cell passaging, remove the medium by aspiration and wash with calcium- and magnesium free phosphate buffer (DPBS-/-) for 30 s under a laminar flow cabinet. Afterwards incubate the cells with 2 mL of Accutase, an enzyme solution with proteolytic and collagenolytic activity for up to 5 min at 37 °C, 5% CO2.\nVerify detachment of the cells from the cell culture flask surface with a phase contrast microscope.\nAdd 8 mL of serum-containing medium into the flask and transfer the cell suspension to a 15 mL reaction tube.\nTake a 10 µL sample from the cell suspension and mix with 10 µL of Trypan Blue.\nDetermine the cellular number with a Neubauer chamber and calculate the total number of cells.\n\t\tCAUTION: Trypan Blue is toxic, therefore consulting the MSDS, following the mandatory procedures described in the MSDS, wearing of appropriate personal safety protection and handling under a chemical cabinet is required. Collect waste for chemical waste deposition.\n\t\tNOTE: Trypan Blue positive cells are colored blue, indicating non-intact cellular membranes.\nFor the next passage, culture 5 x 105 cells in a new sterile cell culture flask with 10 mL of new medium. For experimental conditions, culture 3 x 105 cells in the 6 well plates and 6 x 104 cells in each well of the 24 well plate, containing polymeric samples (protocol step 4.2).\nPreparation of composite films for cell culture experiments.",
    "Excise single pieces of films of the desired dimensions manufactured in protocol step 1.4 and 1.5 from the PET supportive layer with a scalpel and place with tweezers onto the surface of glass cover slips exhibiting a diameter of 12 mm. Place the samples in the wells of a 24 well plate.\nFor cytotoxicity determination and cell counting, do not remove the films from the PET foil. Cut circular areas of approx. 9.4 cm2, fitting neatly into the single wells of a 6 well plate, from the films produced in 1.4 and 1.5 and place them into the wells of a cell culture plate.\nImmerse the polymer samples in deionized H2O for ≥ 30 min.\n\t\tNOTE: The polymeric samples might be sterilized by autoclaving. Therefore, remove all polymer containing samples from the cell culture dishes and place them inside a glass Petri dish. Sterilization is performed in an autoclave at 2.05 bar for 20 min at a temperature of 121 °C.\nPlasma treatment of polymers\nPlace the films which are attached on PET foil or on round glass cover slips (manufactured in 4.2.1) inside the reaction chamber of the plasma device.\nClose the lid and evacuate until a pressure of 1.6 x 10-2 mbar is reached.\nPerform plasma treatment for 3 min.\nVentilate the reaction chamber and place samples in either 24 well or 6 well dishes for further cell culture investigations.\nUse one sample for water contact angle determination with a goniometer. Therefore, move the syringe close to the polymeric surface, using the software package and place a drop of 3 µL water on top of the surface. Calculate the static water contact angle with the goniometer software.\nStaining and microscopy\nPrepare cells as described in step 4.1.7 and culture for 3 d at 37 °C and 5% CO2.",
    "Capture phase contrast pictures of cells cultured for three days on pristine- and plasma treated films shortly before fixation.\nPrepare PBS supplemented with 0.2% Triton-X-100. Slowly pipette 200 µL of the stock solution into 100 mL of PBS (PBS-T).\nPrepare a 4% paraformaldehyde/PBS solution (PFA/PBS-T).\n\t\tCAUTION: Paraformaldehyde is toxic, therefore consulting the MSDS, following the mandatory procedures described in the MSDS and wearing of appropriate personal safety protection and handling under a chemical cabinet is required.\nPrepare a 5% BSA/PBS-T solution.\nRemove the medium by aspiration under the lamina flow cabinet. Add PBS to the wells to remove medium residues.\nTransfer the plate to a chemical cabinet and replace PBS with 400 µL of the PFA/PBS solution for 25 minutes at room temperature.\nRemove the PFA/PBS solution from the single wells, carefully wash with PBS four times. Wait 3 min. between each washing step and collect the solutions for chemical waste disposal. Use the plate directly, or store it at 4 °C.\nAdd 5% bovine serum albumin (BSA)/PBS-T to the wells and incubate for 60 min at RT to block unspecific binding sites.\nAspirate the solution and replace it with a phalloidin conjugated to Alexa-488 (1:160 dilution)/PBS-T solution supplemented with 0.2% Triton-X-100.\n\t\tCAUTION: Phalloidin-488 is toxic, therefore consulting the MSDS, following the mandatory procedures described in the MSDS and wearing of appropriate personal safety protection and handling under a chemical cabinet is required.\nCover the plate with aluminum foil and incubate it for 3 h at RT or overnight at 4 °C.\nAspirate the solution and wash three times with PBS. Wait 3 min. between each washing step. Collect the solutions for chemical waste disposal.",
    "Prepare a solution of 1 µL of Hoechst Dye 33342 (stock solution 1 mg/mL). For a 1:1000 dilution pipette 1 µL of Hoechst Dye 3334 to 1 mL of PBS-T and mix well. Add 300 µL of the Hoechst dye 33342 solution to the wells and incubate for 10 min at RT in the dark.\n\t\tCAUTION: Hoechst Dye 33342 is a DNA intercalating reagent and therefore potentially mutagenic, therefore consulting the MSDS, following the mandatory procedures described in the MSDS and wearing of appropriate personal safety protection and handling under a chemical cabinet is required.\nAspirate the solution and wash the samples four times with PBS. Wait 3 min between each washing step. Collect the solution for chemical waste disposal.\nFor embedding, carefully remove the films from the culture surface and place them on a microscope glass slide. Add 20 to 40 µL of water soluble embedding medium to the film and attach a new circular glass cover slip on top using slight pressure.\nPerform imaging with a fluorescence microscope. Filters needed for illumination: Alexa-488 has an excitation maximum at 496 nm and maximum emission occurs at 519 nm. Therefore, the emission color is green. Hoechst dye 33342 trihydrochlorid trihydrate complexed with DNA has an excitation maximum at 355 nm and maximum DNA complex emission occurs at 465 nm.\nCytotoxicity determination and determination of cell number\nPerform the experiment with cells grown in the 6 well plates prepared in step 4.3 and cells prepared in step 4.1.7. Culture the cells for 3 days at 37 °C and 5% CO2. For the positive control, use cells that were grown on a cell culture treated polystyrene surface, containing no polymeric films. For background determination (negative condition), obtain medium from a well without cells.",
    "NOTE: Medium can also be taken from the well containing cells cultured on the cell culture treated polystyrene surface.\nAccording to the number of experimental samples label 15 mL tubes.\nAdd 40 µL of a 0.9% Triton X-100 containing PBS solution to the positive control and mix vigorously with a 1000 µL tip. Wait for approx. 3 min.\nWithout removing the cells attached to the surface, aspirate the medium from all samples, including samples prepared in 4.5.3 and transfer the medium to the 15 mL tubes. Add 3 mL of DPBS-/- to the single wells and store the plates under the laminar flow cabinet for determination of the cellular number as described in 4.5.9.\nCentrifuge at 200 x g for 3 minutes and remove 1 mL of the supernatant for the LDH activity determination. Store the 15 mL tubes containing cells and remaining medium under the laminar flow cabinet.\nFor the assay a black 96 well plates with flat bottom are used. Add 50 µL of CytoTox-ONE Reagent to 50 µL of the sample medium and mix well for 30 s.\nCover the plate with aluminum foil and store for 10 min at RT.\nAdd 25 µL of the stop solution to each well and record the fluorescence intensity with a fluorescence plate reader. Shake the plate for 10 s and detect the fluorescence signal with an excitation wavelength of 520 nm and an emission wavelength of 560 nm. Avoid air bubbles.\nFor determination of the cell number aspirate the DPBS-/- from the wells of the culture plate from protocol step 4.5.4 and add the solutions to the 15 mL reaction tubes containing the supernatants collected in protocol step number 4.5.5.",
    "Centrifuge the 15 mL reaction tube at 200 x g for 3 min and aspirate supernatant. Add 0.5 mL of Trypsin/EDTA and incubate for 10 min at 37 °C.\nAdd 2 mL of Trypsin/EDTA at to the wells of the plate and incubate for approx. 10 min at 37 °C to detach cells from the polymeric films.\nThe cell suspension is transferred to the 15 mL reaction tube from step number 4.6.10. Additionally, wash the plates vigorously with serum containing medium.\nCentrifuge the samples at 200 x g for 3 min, aspirate the supernatant and add serum containing medium to the tube.\nDetermine the cellular number as described in steps 4.1.5 and 4.1.6."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}