{
  "id": 19443,
  "origin_website": "Jove",
  "title": "Extraction and Analysis of Taiwanese Green Propolis",
  "procedures": [
    "1. Preparation of Ethanol-extracted Compounds\nWeigh 10 g of frozen Taiwanese green propolis, which was collected from beehives in Taiwan from May to July, and grind it using the spice grinder. Confirm that whole pieces of Taiwanese green propolis are ground into a fine powder without any large particles.\nAdd 100 mL of various concentrations of ethanol (60%, 70%, 80%, 95%, and 99.5%) and water to separate flasks and mix each concentration with 10 g of ground propolis.\nIncubate at 25 °C and shake the flask at 250 rpm for 48 h.\nFilter the ethanol extracts through filter paper with a 25 μm pore size.\nReconstitute the filtrates to their original volume (100 mL) with 95% ethanol using a volumetric flask.\nStore the ethanol extracts at -20 °C.\n\tNOTE: The protocol can be paused here.\n2. Preparation of Ethanol Extracts for HPLC\nConcentrate 10 mL of ethanol extracts by vacuum evaporation at 40 °C for 15 min.\nBake the dry matter at 45 °C for 24 h.\nReconstitute the dry matter with 10 mL of 95% ethanol.\nFilter 1 mL of ethanol extracts using a sterile syringe filter with a 0.45 µm pore size.\nRefilter the ethanol extracts using a sterile syringe filter with a 0.22 µm pore size. The filtrate is collected and can be directly analyzed using HPLC.\n3. Analysis of the Propolin Content Using HPLC\nEstablishment of standard curves of propolins\nPrepare 1 L of the mobile phase of 88.8:11.2 (v/v) methanol:water solution.\nPrepare serial dilutions of propolin standard (C, D, F, and G) concentrations (15.625 mg/mL, 31.25 mg/mL, 62.5 mg/mL, and 125 mg/mL, respectively) using the mobile phase solution as a solvent.\nInject 20 µL of propolin standard concentrations into the reverse-phase column, sequentially from the low concentration to the high concentration.",
    "Set the HPLC column at 30 °C and the flow rate to 1 mL/min.\nSet the wavelength of the UV detector to 280 nm and the recorder time to 20 min.\nAnalyze the standards at least 3x.\nPlot the measurement response (y-axis) against the concentration (x-axis) using calculation sheet software, and create a standard curve with the equation and R-square value.\nAnalysis of ethanol extracts\nInject 20 µL of the ethanol extracts obtained from step 2.5 into the reverse-phase column.\nSet the HPLC column at 30 °C and the flow rate to 1 mL/min.\nSet the wavelength of the UV detector to 280 nm and the recorder time to 20 min.\nAnalyze the standards at least 3x.\nCalculate the concentration of propolin in the ethanol extract, using the equation for the standard curve obtained from step 3.1.7 that uses the peak area for each propolin.\n4. Minimum Inhibitory Concentration and Minimum Bactericidal Concentration Analysis\nNOTE: The microdilution method is used to evaluate the antibacterial efficacy of ethanol-extracted propolins from Taiwanese green propolis.\nPreparation of test organisms\nThaw the bacterial strains, Staphylococcus aureus and Escherichia coli, and then, culture them in tryptic soy broth and nutrient broth, respectively, at 37 °C for 24 h.\nPassage the S. aureus using tryptic soy broth and E. coli using nutrient broth for two generations and, then, calculate colony-forming units by counting individual colonies on an agar plate.\nPreparation of ethanol extracts for antibacterial activity testing\nConcentrate the ethanol extracts obtained from step 1.5 by vacuum evaporation at 40 °C for 15 min.\nReconstitute the dry matter with dimethyl sulfoxide (DMSO) and adjust the concentration of the extract to 12.8 mg/mL.\nMake a serial dilution (concentrations: 5, 10, 20, 40, 80, 160, 320, and 640 µg/mL) of ethanol extracts using the broth.",
    "Minimum inhibitory concentration tests\nAdd 10 µL of diluted ethanol extracts ranging from 0.156 to 640.0 µg/mL into a 96-well plate.\nUsing broth, adjust the volume to 100 µL, and maintain 5% DMSO in all the dilutions.\nInoculate 100 µL of bacterial culture (1 x 106/mL) into the 96-well plate.\nCulture inoculum containing various concentrations of ethanol extracts at 37 °C for 48 h.\nAnalyze the bacterial growth according to turbidity and using optical density (microplate reader) at 590 nm to determine the minimum inhibitory concentration (MIC).\nMinimum bactericidal concentration tests\nInoculate 10 µL of liquid culture from each well of the MIC test that exhibited no growth onto an agar plate.\nIncubate at 37 °C for 24 h.\nDetermine the bactericidal activity by identifying the lowest concentration that revealed no visible bacterial growth. The concentration that completely eliminates cell growth is considered to be the minimum bacterial concentration (MBC).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}