{
  "id": 3657,
  "origin_website": "Cell",
  "title": "Evaluating cytokine production by flow cytometry using brefeldin A in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare bacterial inoculum\nTiming: 2–3 days\nFor this protocol, we will describe staining for in situ cytokine production by lymphocytes during Burkholderia thailandensis infection. The inoculation protocol should be adjusted to fit the infection or treatment protocol of interest.\nGrow a bacterial culture.\nTwo to three days prior to infection, streak out Burkholderia thailandensis from frozen stock onto a Luria-Bertani (LB) plate, and grow for one to two days at 37°C.\nNote: Plates of streaked B. thailandensis can be stored for up to a week at 4°C.\nInoculate a 1.5 mL liquid LB culture with a single colony and grow for 16 h at 37°C in a shaking incubator to achieve stationary phase.\nPause Point: If mice will not be infected immediately at the end of this 16 h incubation, place the bacteria on ice until ready to infect mice.\nPrepare the inoculum.\nPellet the 1.5 mL liquid culture of bacteria by spinning in a microcentrifuge at 3,000 × g for 1 min.\nRemove the supernatant and resuspend in 1 mL PBS to wash the bacteria. Spin at 3,000 × g for 1 min. Repeat for a total of two PBS washes. Resuspend in 1 mL PBS.\nEstimate the concentration of bacteria using an OD600 as determined using a spectrometer.\nAn OD600 of 1.00 is approximately 1 × 109 CFU/mL of B. thailandensis. The relationship between OD600 and CFU is approximately linear below OD600 of 1.00. Dilute the bacteria until its OD600 is less than 1.00.\nCalculate concentration using the following equation: Concentration (in CFU/mL) = OD600 × 1 × 109 CFU/mL x dilution factor\nDilute the inoculum with PBS to 2 × 107 CFU per 200 μL (the volume for each inoculum injection).\nVerify inoculum via spot dilution plating.",
    "Create a total of eight (including undiluted) 1:10 serial dilutions of the inoculum in PBS.\nPlate 10 μL of each dilution in triplicate on an LB plate using a spot plating method (or plate 100 μL if using a whole plate method).\nIncubate overnight (14–16 h) at 37°C.\nLooking at the dilution which has approximately 10–50 colonies per spot, count and average the number of colonies per spot.\nCalculate actual inoculum using the following formula: Inoculum (in CFU/mouse) = average # colonies x dilution factor x 20\nInfect and treat mice with brefeldin A\nTiming: 1 day\nWe next infect the mice and, after waiting enough time to allow immune responses to establish, treat mice with the Golgi blocker brefeldin A (BFA). Since most cytokines are processed and secreted through the classical secretory pathway that passes through the Golgi apparatus, BFA prevents the secretion of cytokines, causing their accumulation within the immune cells for eventual detection by flow cytometry. Thus, treating mice with BFA allows for the evaluation of in situ cytokine production without requiring the use of reporter mice. Consequently, mice of any genetic background can be used, allowing the evaluation of the effects of knocking out genes on cytokine production without prior crossing of knockout mice onto a reporter background. For example, we successfully evaluated cytokine production in both wild type and Rag1−/− mice (Kovacs et al., 2020[href=https://www.wicell.org#bib4]).\nOur timings for this experiment were based on known kinetics of B. thailandensis infection in wild type mice. The time point in each mouse model will vary, but the timing of injecting BFA 6 h prior to euthanizing the mice is important to allow for adequate accumulation of cytokines within cells.",
    "Inject mice intraperitoneally with 200 μL of the inoculum created in step 2. Uninfected control mice should be injected with 200 μL of PBS as a mock infection.\nTwelve hours after infection, treat mice with BFA.\nDilute BFA stock.\nBFA stock should be reconstituted in DMSO to a concentration of 20 mg/mL.\nNote: BFA stock can safely be stored at −20°C for at least a year.\nFurther dilute working solution to 0.5 mg/mL in PBS. Keep this solution at room temperature (RT; 25°C–27°C) in order to avoid injecting a large volume of cold liquid into the mice. Do not reuse working solution.\nInject 500 μL of working solution of BFA intravenously into the tail vein of both infected and uninfected mice.\nNote: This volume was used in the original publication by Liu et al. (Liu and Whitton, 2005[href=https://www.wicell.org#bib5]). We did not attempt to optimize the injection volume, as this volume worked for our studies. Considerations include whether the volume used enhances BFA exposure throughout the body or reduces cytotoxic effects by dilution of BFA (Troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nSix hours after injecting BFA, euthanize mice and promptly harvest spleens per your institution’s animal guidelines. Keep spleens in PBS and on ice until all samples are ready to process.\nAlternatives: While keeping the spleens in PBS is sufficient over a short duration when harvesting spleens and immediately proceeding to the next steps, consider keeping spleens in serum-free media such as DMEM for longer durations to avoid loss of cell viability. Cells can be maintained in this media until RBC lysis.",
    "Note: Until cells have been fixed, cells are still alive and actively producing cytokines, albeit in a manner no longer reflective of the in situ setting. While the cell populations and their cytokine productions are likely stable at this point for a short period, it is advisable to proceed to the next steps through cell fixation (step 27) as soon as possible.\nCritical: The exact timing of these injections will depend on the infection and model being tested. In this case, we have optimized the time points of our infection (18 h total infection time) to view cytokine production during innate immune responses to B. thailandensis with a infective dose of 2 × 107 CFU. Indeed, if the inoculum of B. thailandensis is lowered to 1 × 104 CFU in wild type mice, the infection is cleared faster and we think that cytokine production returns to baseline by 18 h post infection, resulting in a lack of staining (Figure 1[href=https://www.wicell.org#fig1], compared to robust IFN-γ signal in Figure 2[href=https://www.wicell.org#fig2]). Thus, it is important to optimize the timing of your BFA injections and tissue harvests for your specific model (Troubleshooting 1[href=https://www.wicell.org#sec7.1]).\nCreate a single cell suspension of splenocytes\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/344-Fig1.jpg\nFigure 1. Choosing correct experimental conditions and timing is essential for observing robust cytokine signal\nWhen infecting with a large bacterial inoculum (2 × 107 CFU), a robust IFN-γ signal is observed at 18 h post infection. When using smaller bacterial inoculum (104 CFU), IFN-γ signal is similar to background levels at 18 h post infection, a time point at which infection with this lower inoculum has already been cleared.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/344-Fig2.jpg\nFigure 2. Analysis of flow cytometric data\n(A) Gating strategy used to characterize what cell types constitute the IFN-γ-producing cells. Italicized labels indicate what cell population is being gated.",
    "(B) Representative results at 18 h post infection with 2 × 107 CFU B. thailandensis.\n(C) Representative results demonstrating gating of ILC1s within the CD3−NK1.1+ subset.\n(D) Representative results demonstrating TCRγδ and CD4 and CD8 subpopulations of the CD3+NK1.1− subset when including the optional CD4 and CD8 antibodies. Panels from this figure are reused with permission from all authors from our previously published paper (Kovacs et al., 2020[href=https://www.wicell.org#bib4]).\nTiming: 2 h\nWe next need to create a single cell suspension so that we can stain them for flow cytometry.\nPlace the spleen on a 70 micron cell strainer fitted on top of a 50 mL conical tube.\nUsing the plunger of a 1 mL syringe, gently press the spleen against the strainer to mechanically disrupt the tissue. Continue until the only remaining tissue on the strainer is white and fatty in texture, occasionally adding PBS to ensure that the tissue and cells do not dry out.\nWash the remaining cells off the strainer and into the underlying 50 mL conical using 10 mL of PBS. Dispose of the strainer and add PBS to the conical for a total volume of 30 mL.\nAlternatives: If you are interested in immune cells present in other organs, the processing protocol may differ. Analogous procedures can be used for immune cell-dense organs like lymph nodes; however, more fibrous organs will likely require additional steps such as more intense physical manipulations and/or treatment with proteases like collagenase. For example, see the methods section of (Weizman et al., 2017[href=https://www.wicell.org#bib10]) for descriptions of how to process mouse liver and lungs.\nSpin the cells at 800 × g, 4°C, for 10 min using a standard centrifuge.\nDiscard the supernatant and resuspend in 5 mL of ACK RBC lysis buffer. Incubate on ice for 5 min.",
    "Critical: The timing of incubating your cells for 5 min is important to avoid potential loss of cell viability (Troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nAdd 35 mL of PBS to stop lysis. Spin at 800 × g, 4°C, for 10 min using a standard centrifuge.\nDiscard the supernatant and resuspend in 5 mL of PBS.\nFilter through a new 70 micron cell strainer fitted on top of a new 50 mL conical to remove aggregates of dead cells that formed after lysis.\nKey step: Count cells using a cell counter or hemocytometer and record the data. These counts will be used to aliquot for staining in the next steps as well as for calculating absolute counts of subsets in the final analyses.\nAlternatives: If you desire to localize the cells that are producing cytokine within the organ, you can instead fix the spleen in 4% PFA and perform immunofluorescent staining using an analogous protocol published by Mazet et al (Mazet et al., 2019[href=https://www.wicell.org#bib6]).\nStain splenocytes and perform flow cytometric analysis\nTiming: 2 days\nWe next stain our cells for flow cytometry. Under normal circumstances (without BFA treatment), most cytokines are synthesized and promptly secreted by the cell. This causes the total pool of cytokine protein within the cell to be very low, despite high transcription and translation. Brefeldin A halts intracellular vesicle formation and transportation of proteins from the endoplasmic reticulum to the Golgi apparatus, inhibiting the secretory pathway and resulting in accumulation of translated proteins within the cell. This greatly increases the sensitivity of detection with antibodies specific for the cytokine of interest.\nPlate 1–2 × 106 cells in 200 μL PBS for each mouse into a well on a polypropylene, round-bottom 96-well plate.\nPrepare a well for a live/dead (L/D) compensation tube.",
    "Take 1 to 2 million splenocytes and split into two Eppendorf tube.\nHeat shock one of the tubes by heating it at 55°C for 5 min followed by 2 min on ice. The other tube should remain on ice the entire time.\nMix the cells from the two Eppendorf tubes together and plate onto the sample plate. This ensures that the compensation tube will have sizable populations of both live and dead cells to serve as positive and negative compensation controls.\nAlternatives: Instead of using cells for L/D compensation, you can use amine reactive beads (for example, see Arc Amine Reactive Compensation Bead Kit (cat# A10628) from Thermo Fischer). If using these beads, you can make this compensation tube alongside the other compensation tubes in step 34.\nCentrifuge the plate at 450 × g, RT, for 5 min. Discard the supernatant.\nResuspend each well with 200 μL of PBS. Centrifuge the plate at 450 × g, RT, for 5 min and discard the supernatant.\nResuspend each well with 100 μL of L/D stain in PBS for 20 min at RT in the dark\nTo make L/D stain, add 1 μL of L/D stock per 1 mL of PBS\nAdd 100 μL FACS buffer to each well. Centrifuge the plate at 450 × g, RT, for 5 min and discard the supernatant.\nResuspend each sample in 100 μL of extracellular staining master mix, and the L/D compensation well in 100 μL of PBS. Stain for 30 min at RT in the dark.\nAdd 100 μL of FACS buffer to each well. Centrifuge the plate at 450 × g, RT, for 5 min and discard the supernatant.\nResuspend each well with 200 μL of FBS buffer. Centrifuge the plate at 450 × g, RT, for 5 min and discard the supernatant.",
    "Add 100 μL of BD Biosciences Fix/Perm to each well. Incubate at 4°C for 20 min in the dark.\nNote: Depending on the cytokine being stained, this fix/perm step may need to be extended to 45 min to 1 h to get optimal intracellular staining of the cytokine. For IFN-γ, we found that 20 min was sufficient (Troubleshooting 1[href=https://www.wicell.org#sec7.1]).\nAdd 100 μL of BD Biosciences Perm/Wash buffer to each well. Centrifuge the plate at 1,250 × g, 4°C, for 5 min and discard the supernatant.\nResuspend each well with 200 μL of BD Biosciences Perm/Wash buffer. Centrifuge the plate at 1,250 × g, 4°C, for 5 min and discard the supernatant.\nResuspend each well with 200 μL of BD Biosciences Perm/Wash buffer.\nPause Point: Once all cells have been fixed, samples can be stored at 4°C in the dark overnight in the Perm/Wash buffer. Intracellular staining can be resumed the following day with no significant change in staining.\nCentrifuge plate at 1,250 × g, 4°C, for 5 min and discard the supernatant.\nResuspend each sample in 100 μL of intracellular staining master mix and the L/D compensation well in 100 μL of BD Biosciences Perm/Wash buffer. Stain for 1 h at 4°C in the dark.\nResuspend each well with 100 μL of BD Biosciences Perm/Wash buffer. Centrifuge the plate at 1,250 × g, 4°C, for 5 min and discard the supernatant.\nResuspend each well with 200 μL of FBS buffer. Centrifuge the plate at 1,250 × g, RT, for 5 min and discard the supernatant.\nResuspend in 200 μL of FACS buffer. Transfer to a flow tube with a filter.\nPrepare compensation tubes.\nAdd 1 μL of antibody to 1 drop of UltraComp eBeads Compensation Beads.",
    "Note: These beads can bind mouse, rat, and hamster-derived antibodies, which works with all antibodies used in the panel included in this protocol. However, if you use different antibodies in your panel, ensure that the beads are compatible with all antibodies being used. Beads compatible with antibodies derived from other species are also commercially available. Alternatively, if enough cells present the marker for the antibody, you can stain splenocytes with the antibody alone to use as a compensation tube.\nVortex briefly.\nIncubate at RT in the dark for 15 min.\nAdd 150 μL of FACS buffer and centrifuge at 450 × g.\nResuspend in 200 μL of FACS buffer and transfer to a flow tube.\nNote: For conventional flow cytometry (such as the flow we performed using an LSRII), beads offer an easy way to generate compensation samples that usually result in accurate compensation. However, if using a full spectrum flow cytometer, then the slight differences between fluorescent spectra of fluorophores on beads compared to cells could result in unmixing errors. Thus, these users will need to determine if there are any differences between single color controls using beads and cells, and they should use cells as compensations controls if there is a difference.\nKeep samples at 4°C in the dark until ready to run on a flow cytometer.\nRun samples through flow cytometer.\nAnalyze results using FlowJo."
  ],
  "subjectAreas": [
    "Immunology",
    "Model Organisms",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}