{
  "id": 3936,
  "origin_website": "Cell",
  "title": "Collecting mouse livers for transcriptome analysis of daily rhythms",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLiver dissection\nTiming: 2 days\nLiver dissection occurs over two days: on day one, collect livers from the three time-points in Room 1 (R1), and on day two, collect livers from the three time-points in Room 2 (R2). Alternatively, all samples can be collected in one day if the light schedules of the two rooms are staggered by 1 hr (e.g., R1: lights-on at 7:00 am, lights-off at 7:00 pm; R2: lights-off at 8:00 am, lights-on at 8:00 pm). This allows enough time to collect samples back-to-back for R1 ZT0 and R2 ZT12, R1 ZT4 and R2 ZT16, and R1 ZT8 and R2 ZT20. See Note below.\nTake mice cages one at a time to a dedicated dissection/collection room (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/658-Fig2.jpg\nFigure 2. Steps of liver dissection\n(A) Midline incision of the skin.\n(B) Midline incision of the muscle to expose organs.\n(C) Ribcage cut on each side of the mouse. The white arrow and outline indicate the liver piece to be placed in the 2 mL tube. Alternatively, the liver piece can be taken from any desired lobe, or whole liver can be homogenized after freezing.\n(D) Any generic dissection tools are suitable.\n(E) Left, foil for freezing the rest of the liver for other assays. Right, 2-mL tube containing small liver piece for RNA extraction and sequencing.\nEuthanize mouse by CO2 asphyxiation, cervical dislocation, or another approved method. For dark-phase time-points, euthanize mice in darkness.\nTiming: 60 s\nDecapitate mouse as a secondary confirmation. This is an important step when collecting dark-phase time-points.\nTiming: 10 s\nWith the mouse on its back, take small scissors and remove the layer of skin up the midline (Figure 2[href=https://www.wicell.org#fig2]A).\nTiming: 30 s",
    "Make a second cut of the muscle to expose the abdominal cavity and organs (Figure 2[href=https://www.wicell.org#fig2]B).\nTiming: 30 s\nCut down both sides, at the ribcage, to gain access to the entire liver (Figure 2[href=https://www.wicell.org#fig2]C).\nIdentify the different lobes of the liver. While gently holding the left lateral lobe with forceps, cut a small piece of liver (~0.5 cm, enough for RNA extraction) (Figure 2[href=https://www.wicell.org#fig2]C).\nTiming: 1 min\nPlace liver piece in a 2 mL tube and immediately snap-freeze in liquid nitrogen (Figure 2[href=https://www.wicell.org#fig2]E).\nTiming: 30 s\nRemove the remainder of the liver, taking care to avoid any non-liver tissue and connections. For example, while taking care to not spill its contents, remove the gallbladder and its connections with the liver. Wrap the liver in aluminum foil (Figure 2[href=https://www.wicell.org#fig2]E). Immediately snap-freeze foil in liquid nitrogen.\nTiming: 1 min\nStore samples at –80°C.\nPause Point: Livers can be stored long-term at –80°C.\nCritical: When collecting dark-phase time-points, do not expose mice to light at any point. While transporting mice to the dissection room, they can be covered with heavy black trash bags or a blackout curtain. Do not turn on dissection room lights until mice have been decapitated. If collecting brain, remove the eyes before turning on the lights.\nCritical: Ensure collection is complete within ±30 min of the time-point. Consider the number of mice, data gathering (e.g., blood glucose, body weight), and tissue dissection time. For instance, if there are 10 mice that each take 6-min to process, start the harvest at 30 min prior to the time-point in order to finish at 30 min post-time-point. If possible, share the work between several investigators to reduce the amount of time spent per mouse.",
    "Optional: In addition to liver, collect other tissues of interest. Be sure to factor in extra dissection time. Consider beforehand the downstream assays for those tissues and apply appropriate collection methods.\nRNA extraction and library preparation for total RNA sequencing (RNA-seq)\nTiming: 2 days\nExtract RNA from the piece of liver in the 2 mL tube using an RNeasy plus mini kit (Qiagen), in accordance with the manufactureŕs instructions (https://www.qiagen.com/us/shop/automated-solutions/sequencers/rneasy-plus-mini-kit/[href=https://www.qiagen.com/us/shop/automated-solutions/sequencers/rneasy-plus-mini-kit/])\nCritical: Before proceeding to sequencing, validity of the collection should be checked by qPCR for clock genes (e.g., Bmal1, Dbp, Cry1, Per2, Rorc, Reverbα). High-amplitude rhythms with distinct phases should be apparent in wild-type mice (Figure 3[href=https://www.wicell.org#fig3]; Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/658-Mmc1.xlsx]).\ntroubleshooting 2[href=https://www.wicell.org#sec7.3]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/658-Fig3.jpg\nFigure 3. Clock gene expression from RNA sequencing\nExamples of clock gene expression generated from this protocol, showing high amplitude rhythms with particular peak phases (n=3). In our hands, Dbp is a good indicator of robust circadian entrainment, with a daily fold induction of >100–300×. The other clock genes shown, including Per2, have lower amplitudes and are also good indicators.\nPrepare libraries for sequencing, in accordance with the manufactureŕs instructions of a total RNA library preparation kit (https://www.illumina.com/products/by-type/sequencing-kits/library-prep-kits/truseq-rna-v2.html[href=https://www.illumina.com/products/by-type/sequencing-kits/library-prep-kits/truseq-rna-v2.html]), and subsequently sequence the libraries. Sufficient depth is ~20 million reads/sample for single-end sequencing.\nNote: The type of sequencing, and library choice, should be directed by the hypothesis the researcher intends to test. Both paired-end sequencing and libraries enriched for specific RNA types (e.g., polyA-enriched) are compatible with this protocol.\nProcess the resulting sequencing data through a standard RNA-seq pipeline to quantify gene expression. FPKM, RPKM, and/or TPM values are compatible with downstream rhythmicity analysis.",
    "Critical: High-quality, correctly processed RNA-seq data is indispensable for identification of rhythmic transcripts using this protocol. Users are referred to bioinformatics-core-shared-training.github.io/RNAseq-R/[href=http://bioinformatics-core-shared-training.github.io/RNAseq-R/] and bioconductor.org/packages/devel/workflows/vignettes/rnaseqGene/inst/doc/rnaseqGene.html[href=http://bioconductor.org/packages/devel/workflows/vignettes/rnaseqGene/inst/doc/rnaseqGene.html] as references for standard good practice in quality control and processing of RNA-seq data.\nNote: Apply Principal Component Analysis, Hierarchical Clustering or more specialised tests (see: Chen et al., 2020[href=https://www.wicell.org#bib5]; George et al., 2015[href=https://www.wicell.org#bib11]) to the RNA-seq data, to identify outliers that could potentially compromise rhythmicity analyses."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Metabolism",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}