{
  "id": 8403,
  "origin_website": "Jove",
  "title": "Long-Term, Serum-Free Cultivation of Organotypic Mouse Retina Explants with Intact Retinal Pigment Epithelium",
  "procedures": [
    "Animal protocols compliant with §4 of the German law of animal protection were reviewed and approved by the Tübingen University committee on animal protection (Einrichtung für Tierschutz, Tierärztlichen Dienst und Labortierkunde; Registration No. AK02/19M). In this study, retinas were obtained from wild-type (WT) and rd1 mice, the latter being a well characterized model for hereditary retinal degeneration15. Mice were housed under standard white cyclic lighting, had free access to food and water, and were used irrespective of gender.\n1. Checklist\nTo ensure sterile conditions and avoid contaminations, clean, and disinfect the laminar air flow hood with 70% ethanol. Be sure to let the ethanol evaporate completely, to prevent intoxication of the retinal cultures.\nAutoclave tools (e.g., scissors, forceps, and ophthalmic microscope scraping spoon) before use.\nPrepare the following media in advance under a laminar-flow hood, under sterile conditions: Basal R16 medium (BM) (can be stored at 4 °C for 4 weeks), BM with 20% fetal calf serum (FCS) (same day use), BM with 0.12% proteinase K (44 mAnson U/mg) solution (same day use) and complete R16 medium with supplements (CM) as described by Romijn16 (can be stored at 4 °C for 3 weeks) (see Tables S1, S2, and S3).\nPreheat the proteinase K solution at 37 °C to activate it and use it in step 2.5.\n2. Preparation\nSacrifice rd1/WT animal at post-natal day (P) 5 by decapitation. For animals older than P11, use CO2 and/or cervical dislocation, as per the local animal protection regulations.\nDepending on the age of the animal, prior to enucleation, if needed, open the eye lids using forceps and very carefully separate the eye lids, without touching or scratching the eye below.\nRapidly enucleate the eyes under a stereoscope using curved forceps.\nIncubate the eyes in BM for 5 min at room temperature (RT).",
    "Incubate the eyes in preheated BM, with 0.12% proteinase K at 37 °C for 15 min.\nPerform the following steps inside a laminar air flow hood to ensure sterile conditions. To inactivate proteinase K, transfer eyes to BM containing 20% FCS and incubate for 5 min at RT.\nDissect the eyes under a stereoscope, aseptically, in a Petri dish containing fresh BM at RT. Initiate the dissection as soon as possible after the enucleation. The longer this time is, the harder it is to dissect the retina, the eyes becoming very soft.\n\t\nWith forceps, hold the eye from the optic nerve. Using fine scissors, make a small incision in the cornea creating 2 edges from where the cornea, the choroid and the sclera can be gently peeled using 2 pairs of fine forceps (Figure 1 steps A–C). Alternatively, use a narrow-gauge cannula to make a first incision into the cornea and then insert one of the scissor blades into the opening.\nGrasp the lens with fine forceps. Place a second pair of forceps perpendicularly to the first ones so that the first forceps are between the 2 shanks of the second one. Pull to extract the lens from the eye cup. If the vitreous and the ciliary body are still attached to the retina, remove them carefully (Figure 1 step D).\n\t\tNOTE: Steps 2.7.1 and 2.7.2 need practice and ensure caution to not damage the retina.\nCut the retina perpendicular to its edges in four points, creating a four-leaf clover shape (Figure 1 steps E–F).",
    "Using a pipette with broadly cut base of a 1 mL tip, hold the retina in a hanging drop of medium and transfer it to a culture dish filter insert placed in a 6-well culture plate. The RPE layer should face the membrane (Figure 1 step G).\nUsing a pipette, carefully remove the excess medium from the insert.\nFrom the sides of the well, add 1 mL of CM per well and incubate in a sterile incubator at 37 °C with 5% CO2. Do not submerge the retina in the medium as this will reduce oxygenation and cause tissue degeneration. The explant should remain at the interface between liquid and air, covered only by a thin film of liquid created by the surface tension of water.\nLeave the retinal explant undisturbed for the first 48 h to facilitate recovery after the explantation procedure.\nChange the medium every second day (48 h). Discard 700 µL of medium from each well and add 900 µL of fresh CM to the well. In this way, the amount of medium lost by evaporation is recovered and the retinal explant keeps some of the neuroprotective factors produced in the previous 48 h.\nIncubate the removed medium in a separate and closed microcentrifuge tube along with the cultures to control and evaluate possible contamination (i.e., change in color of the medium).\n\tNOTE: Retinal explants can be kept in culture for at least 2 weeks12.\n3. After culturing\nNOTE: Explants can be used for different experimental applications (western blot, histology, whole mounts, genetic analysis, electrophysiology). Depending on the application, organotypic retinal explants can be snap frozen, lysed, or prepared for cryosectioning. The steps below describe histological preparation.",
    "Perform a 45-min fixation with 4% paraformaldehyde (PFA), followed by gradual sucrose cryoprotection (10% sucrose for 10 min, 20% for 20 min and 30% for 2 h at room temperature (RT) or overnight (ON) at 4 °C). Add these buffers directly in the well.\nCut the membrane around the retinal explants.\nEmbed both the membrane and retinal tissue in the medium for frozen tissue.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61868/61868fig01.jpg",
    "Figure 1: Step-by-step procedure for the preparation of organotypic retinal explant cultures. (A) Mouse eyes are enucleated and transferred to a solution of proteinase K to allow separation of sclera and choroid from the retina and RPE. A small cut in the sclera/choroid layer is introduced. (B) Two forceps are used to peel the sclera/choroid layer. (C) The black choroid layer can be seen during the peeling. The underlining dark retinal pigment epithelium (RPE) remains attached to the eyeball. The sclera and choroid are removed along with the optic nerve. (D) The lens and vitreous are extracted with forceps.  Remaining ciliary body is removed. (E) The retina retains a bowl-like shape. (F) To flatten the retina for culturing in a dish, 4 cuts in equal distance around the retina are made with a scissor, giving it a clover-like shape. The retina culture is transferred to a membrane culture insert in a 6-well plate with the use of a cut 1 mL pipette tip. The retina still retains some of the bowl-shape. However, upon removal of the excess liquid surrounding the retina, it will unfold to a planar structure. (G) In the culture membrane setup, the retina culture is resting on a porous polycarbonate (PC) membrane on top of a solution of complete R16 medium. To ensure viability, the culture must be kept in a humidified sterile incubator at 37 °C with 5% CO2, and the medium should be replaced every 48 h. Please click here to view a larger version of this figure[href=https://www.jove.com/files/ftp_upload/61868/61868fig01large.jpg]"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}