{
  "id": 10608,
  "origin_website": "Jove",
  "title": "High Resolution 3D Imaging of the Human Pancreas Neuro-insular Network",
  "procedures": [
    "All experiments were conducted in accordance with University of Florida Institutional Review Board and Federal guidelines.\nCaution: Paraformaldehyde and acrylamide are toxic irritants. Handle reagents in a fume hood with appropriate personal protective equipment (lab coat, gloves, eye protection).\n1. Deparaffinization of Formaldehyde-fixed Tissues (If Working with Fresh Tissues, Skip to Step 2)\nUse a new razor blade or scalpel to cut through the paraffin perpendicular to the surface of the tissue. Cut the paraffin at the edge of the tissue to finish loosening it. Use forceps or a spatula to gently loosen and remove the tissue to be optically cleared. Gently scrape excess paraffin from the tissue using a spatula (Figure 1A).\nFill a glass container with xylene (about 30 mL for a 3 x 3 x 3 mm section of tissue) and incubate the tissue in this solution for 24 h at room temperature (RT).\nFill another glass container with fresh xylene with the same volume as 1.2.1. Transfer and incubate the tissue in this solution for 24 h at RT.\nPlace 100% ethanol into a conical tube with the same volume as 1.2.1. Transfer and incubate the tissue in this solution for 24 h at RT.\nPlace 95% ethanol into a conical tube with the same volume as 1.2.1. Transfer and incubate the tissue in this solution for 24 h at RT.\nPlace 70% ethanol into a conical tube with the same volume as 1.2.1. Transfer and incubate the tissue in this solution for 24 h at RT.\nRinse the tissue in 0.01 M phosphate buffered saline (PBS) and place in 0.01 M PBS in a conical tube to equilibrate for 24 h at RT. Ensure that the tissue is free of paraffin (Figure 1B, right panel).\n2. Prepare 4% Paraformaldehyde (PFA) Fixative",
    "Pipette 10 mL 16% PFA into a 50-mL conical tube, add 4 mL 0.1 M PBS, and add 26 mL distilled deionized water (ddH2O). Close the cap and mix briefly.\nLarger volumes of 4% PFA can be made ahead and frozen in aliquots. Aliquots are good for 1 day at room temperature (RT), one week at 4 °C, and 1 month at -20 °C.\n3. Pancreas Fixation\nFix the pancreas sample (≤ 1 x 1 x 2 cm) in freshly prepared 4% PFA at 4 °C for 48 h. If the sample is larger than 1 x 1 x 2 cm, use a scalpel or razor blade to dissect into smaller pieces no more than 1 cm thick. Wash tissue sample in three changes of 0.01 M PBS for at least 15 min each wash and store in 15 mL centrifuge tube in 0.01 % PFA/0.01 M PBS or 0.5 % sodium azide/0.01 M PBS until use.\nAfter fixation, section the tissue into 1 - 2 mm thick sections for further processing. Use a vibratome to assist in even sectioning.\n\tNOTE: The final number of sections will depend on the size of the starting sample.\n4. Embed Tissue in Hydrogel\nPrepare 200 mL of the 4 % acrylamide/1 % paraformaldehyde (A4P1) hydrogel monomer solution as follows:\n\t\nPlace a flask on the ice in a bucket on the top of a magnetic stir plate. Make sure the flask is sitting flat and add a magnetic stir bar.",
    "Add the following in order: 147.8 mL cold (4 - 8 °C) ddH2O, 20 mL 0.1 M PBS, 20 mL cold (4 - 8 °C) 40 % acrylamide solution, 12.2 mL 16 % PFA solution, and 250 mg VA-044 initiator. Mix the entire hydrogel solution with a magnetic stir bar for at least 10 min and leave the solution on ice for the next step.\nPlace a 15-mL conical tube in the ice next to the flask containing the hydrogel solution. Pipette 14 mL of monomer solution into the tube and add one piece of the 1 - 2 mm thick fixed tissue sample. Then cap the tube.\nIncubate the sample in monomer solution for 3 days at 4 °C and protect from light. Aliquot any remaining monomer solution and store at -20 °C for future use.\n5. Degas the Monomer Solution and Polymerize the Hydrogel\nRemove oxygen from the hydrogel monomer solution using gaseous N28.\n\t\nPrepare a bucket of ice and place the sample in the hydrogel monomer solution on ice.\nGather 2 - 3, 18-gauge hypodermic needles per sample, paraffin film, and a timer. Connect the tubing to the nitrogen tank so that the nitrogen can flow. While keeping the sample on ice, carefully pierce the cap of a conical tube containing the sample on one side and press one hypodermic needle through until it is under the surface of the liquid monomer solution.\nUse another hypodermic needle to puncture the opposite side of the cap, but do not allow it to become submerged.\n\t\tNOTE: The second needle will vent the tube.\nConnect the tubing from the nitrogen tank to the hypodermic needle submerged beneath the hydrogel and slowly turn on the nitrogen until it is bubbling steadily through the liquid.",
    "Allow the nitrogen to bubble through the liquid for 10 min.\nOnce the oxygen is removed, quickly remove both needles and cover the cap with a paraffin film to prevent any further exchange of gasses between the tube and the environment. Place the degassed sample in an incubator at 37 °C for 3 h to polymerize the hydrogel.\n6. Tissue Clearing\nPrepare 500 mL clearing solution (4 % SDS at pH 8.5). To ~300 mL of ddH2O, add 50 mL 0.1 M PBS and 20 g SDS powder while stirring with a magnetic stir bar. Adjust the solution using sodium hydroxide and hydrochloric acid to pH 8.5. Add ddH2O until the final volume is 500 mL.\nAfter polymerization, pour away excess hydrogel and discard it into a chemical waste container. Use a paper towel to gently wipe away hydrogel from the sample and discard into a chemical waste container.\nWash the sample in 3 - 5 exchanges of 0.01 M PBS (discard wash fluid into the chemical waste) for 15 min each wash step. Transfer the sample into a 50-mL conical tube with 40 mL of clearing buffer.\nIncubate the sample in the clearing buffer at 37 °C and change sample to fresh clearing buffer every other day.\n\t\nLeave the sample in the clearing buffer for 2 - 8 weeks depending on the sample size (~8 weeks for a 3 mm x 3 mm x 3 mm sample) to ensure proper clearing.\nMonitor tissue clearing and stop when complete. Ensure that the sample is adequately transparent by holding it up to the light to check for proper clearing (usually some tan coloring will remain in the exocrine regions).",
    "NOTE: An over-cleared sample will appear frayed at the edges and the texture will be very soft when picked up with forceps. It is common for the sample to clear unevenly. Also, the tissue will not be fully transparent until placed in mounting media (Insert, Figure 1C).\n7. Multiple Immunofluorescence\nWash the samples on a shaker at 60 rpm at RT for one day with 40 mL 0.01 M PBS changing to fresh buffer often (4 - 5 buffer changes in total, 40 mL each wash, changing every h until the final wash). Let the final wash continue overnight at RT.\nPrepare PACT staining buffer. To 500 mL 0.01 M PBS, add 50 mg sodium azide and 0.5 mL TritonX-100. Mix well.\nIncubate the sample with primary antibodies.\n\t\nAdd 2% normal serum (same species as the secondary antibody) to the base PACT staining buffer in a 2-mL flat bottom tube (at least 1 mL total volume is recommended per sample/tube).\nAdd primary antibody to the 2 % serum/PACT staining buffer. Use approximately 5x the amount of primary antibody for PACT staining as would be used for standard immunohistochemistry (i.e. if an antibody is diluted 1:500 for standard immunohistochemistry, use 1:100 for PACT staining).\nUse a spatula to remove the sample from the wash buffer and dab the excess buffer off onto a paper towel, then place in the tube with a primary antibody solution.\nIncubate 2-4 days at RT on a shaker at 60 rpm. Wash samples thoroughly at RT on a shaker at 60 rpm in 0.01 M PBS changing to fresh buffer 4-5 times and leaving the final wash on overnight as in step 7.1.\nIncubate samples with secondary antibodies.",
    "Add 2% normal serum (same species as the secondary antibody) to the base PACT staining buffer in a 2-mL flat bottom tube (1 mL total volume is recommended per sample/tube).\nAdd secondary antibodies at a concentration of 1:200 (5 µl in 1 mL buffer).\n\t\tNOTE: Small format antibodies are preferred, as well as highly cross-adsorbed antibodies if using more than one primary antibody.\nUse a spatula to remove the sample from wash buffer and dab the excess buffer off onto a paper towel, then place in the tube with a secondary antibody solution.\nIncubate at RT on a shaker at 60 rpm for 2 days and protect the sample from light.\nWash the samples thoroughly, as in step 7.1, at RT on a shaker at 60 rpm in 0.01 M PBS changing to the fresh buffer 4 - 5 times and leaving the final wash on overnight, protect from light during washes.\n8. Mounting Samples for Imaging\nPrepare the refractive index matched solution (RIMS) buffer.\n\t\nWeigh out 11 g of non-ionic density gradient medium (e.g., Histodenz) and carefully transfer to a 50-mL conical tube.\nAdd ~5 mL 0.02 M phosphate buffer (PB)8 using a spatula to release air from the powder non-ionic density gradient medium.\n\t\tNOTE: The solution will be very viscous, mix well.\nBring the volume to 10 mL using more PB, mix with a spatula and scrape the excess off the spatula into the tube.\nIncubate RIMS at 37 °C until dissolved, invert and gently mix as needed.\nTransfer samples into RIMS. To do so, pipette 1 mL RIMs into a 2-mL flat-bottom tube. Use a spatula to remove the sample from wash buffer and dab the excess buffer off onto a paper towel, then place in the tube with RIMS solution.",
    "Gently tap the tube to submerge the sample in RIMS. Place samples in RIMS on the bench protected from light at RT for 2 - 4 days before imaging.\nTo image, place a small amount of RIMs into an 8-well coverslip bottom chamber slide. Only add just enough to coat the bottom, more will cause the sample to float making it more difficult to image on an inverted scope. Add the sample to the well and cap the slide for imaging.\n9. Imaging\nConfocal microscopy and imaging software\n\t\nSelect appropriate lasers for the excitation and emission spectra of the fluorophores used to stain the PACT samples. Adjust the settings of the acquisition software so that any overlap between channels is eliminated. Use separate tracks if necessary (when two fluorophores have similar excitation spectra).\nSet up the image acquisition\n\t\t\nChoose maximum acquisition speed, 16 bit, 4 or more averages, and 1024 x 1024 resolution or better.\nZoom into the object to be imaged.\n\t\t\tNOTE: This will decrease acquisition time to reduce photo-bleaching and also decrease file size and downstream editing.\nSetup the z-stack.\n\t\t\nSelect the optimal sectioning for the objective being used. If deconvolution is desired later, use a z-step smaller than optimal such as 1 µm.\nUse the z-stack correction.\n\t\t\t\nBegin nearest the surface of the tissue and increase the gain as the objective focuses through the z-plane and add corrections. Do not change the laser settings for the correction!\nAcquire a test stack with one average, 512 x 512 resolution, and maximum acquisition speed. Check the image in 3D to make sure that there is equal brightness throughout the stack for each color before acquiring the final high-resolution z-stack.\nLightsheet Imaging",
    "Ensure that the samples have been equilibrated in RIMS for imaging for at least 24 h. Ideally, transfer the samples to fresh RIMS in the imaging chamber and allow to equilibrate in the chamber for at least a day.\nMount the sample for imaging\n\t\t\nSelect the smallest (black) capillary to mount the sample\nUse putty or a dish to hold the sample while applying super glue to the end of the capillary. Glue the tissue to the capillary touching as little a surface of the tissue as possible.\nInsert the sample for imaging.\nImage using 5X or 25X objectives suitable for optically cleared samples using the pivot scan option. If shadowing or blurring occurs, rotate the sample and try again, or let the sample continue to equilibrate in RIMS.\n\t\tNOTE: A 1 mm stack can generally be acquired in less than five minutes, depending on the settings.\nView and edit the image stacks using the image analysis software."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}