{
  "id": 18755,
  "origin_website": "Jove",
  "title": "Isolating and Using Sections of Bovine Mesenteric Artery and Vein as a Bioassay to Test for Vasoactivity in the Small Intestine",
  "procedures": [
    "Procedures used in this study did not require approval from the University of Kentucky Animal Care and Use Committee because no live animals were used. Prior to collection of any sample used herein, all animals were stunned with a captive bolt and exsanguinated. This was conducted at a federally inspected abattoir facility at the University of Kentucky. An official representative of the USDA Food Safety and Inspection Service observed all activities that dealt with the live animal and handling of the carcass.\n1. Preparation of Instrumentation\nTo minimize the amount of time between collections of tissue samples to the start of an experiment, set up equipment and prepare buffers prior to collecting experimental tissue (or if additional personnel are available, these tasks can occur simultaneously).\n\tNOTE: This not only provides the greatest amount of time that the tissue remains viable to conduct experiments, but some experiments can run for long periods of time (or there is a desire to complete multiple experiments in a day), therefore it is usually desirable to get started as early as feasible.\nPower up the associated computer, data acquisitions equipment, water bath (for buffer(s)) and myograph unit(s). Place the calibration equipment on the myograph unit(s) and turn on myograph heat (preset to 37.5 °C) and allow units and calibration equipment to warm to preset temperatures.\n\t\nOpen a previously created Chart software settings file on the computer and start a run (but not acquiring data).\nWarm up the equipment for 10 min.\n\t\nStart acquiring data.\nZero all channels.\nCheck, and conduct calibration (if necessary) on each channel (4 channels per multimyograph) to standardize the electric signal supplied from the respective force transducer associated with that channel to a 2-g force supplied by a certified weight.",
    "After calibration and a units conversion are completed, store all subsequent data as grams. Change accordingly based on desires of each separate laboratory; the equipment and software permit the use of other units, such as milliNewtons and volts.\nMake sure that the gas lines are clear of blockages and turn on gas supply (95% O2/5% CO2) to myograph(s) units. Continuously gas all buffers (in the myograph chambers) during the entire procedure.\nFill all myograph chambers with 70% ethanol and soak for 10 min, remove ethanol, and repeat for a second 10 min soak.\n\t\nAfter removing the ethanol, rinse three times with deionized water, followed by three rinses with prepared buffer (see Section 2 for buffer preparation), leaving the third addition of buffer in the chambers.\n\t\tNOTE: At this point the equipment can remain idle in this state until buffer and tissue are prepared and staff is ready to proceed with the experiment.\n2. Preparation of Buffers\nPrepare a 1 L Krebs-Henseleit buffer solution for use in transportation and processing of tissue samples to achieve final concentrations of 11.1 mM D-glucose; 1.2 mM MgSO4; 1.2 mM KH2PO4; 4.7 mM KCl; 118.1 mM NaCl; 3.4 mM CaCl2; 24.9 mM NaHCO3.\n\t\nMix 9.6 g of Krebs salts into approximately 900 ml of deionized water on a stir plate.\nMix in 0.373 g calcium chloride dehydrate followed by 2.1 g sodium bicarbonate per L of buffer desired.\nGas buffer solution for 20 min with 95% O2/5% CO2.\nAfter gassing, adjust pH to 7.05 (filtration of buffer increases pH; final target pH should be 7.4) and adjust volume to 1 L.\nFilter sterilize buffer into a clean autoclaved 1 L media bottle and store buffer at 4 °C until ready for use.",
    "Prepare separate Krebs-Henseleit buffer solution for use in myograph experiments as described in step 2.1 for the transportation Krebs-Henseleit buffer with additional compounds that pertain to the contractility experiments.\n\tNOTE: Typically 2 L will suffice for experiments described in this article, but this volume may need to be increased or reduced based on the length of the experiment, number of myograph chambers, and number buffer replacements (relative to treatment additions).\n\t\nPrior to the gassing step (step 2.1.3), add 9.1 mg (per L of buffer being prepared) of desipramine-HCl to buffer.\nPrepare a 1.0 μM solution of propranolol-HCl and add 1 ml (per L of buffer being prepared) of this solution to the Krebs-Henseleit buffer solution. Make this buffer on the day of use and keep at myograph operating temperatures (a temperature that yields a 37.5 °C temperature in the myograph).\n\t\tNOTE: The desipramine is added to inhibit the biogenic amine reuptake mechanisms and allow clearing of experimental additions from the buffer bathing the blood vessels to occur more rapidly. The addition of propranolol prevents the non-specific binding of treatment compounds to β-adrenergic receptors.\n3. Collection and Preparation of Vasculature\nAs soon as possible, remove the gastrointestinal tract from the carcass. Once the animal no longer exhibits any involuntary reflex, remove the head and hide and then raise the carcass vertically. Removal of the gastrointestinal viscera (esophagus to anus) from the carcass should be completed by approved abattoir personnel (<20 min from time of stunning).\n\tNOTE: How soon, is generally limited by the location/facility where the intestinal tract is being collected from and standard operating procedures or federally mandated procedures followed by the facility personnel.",
    "In most facilities, conduct manipulations of the gastrointestinal tract at a separate location from the processing of the carcass that is destined to enter the food supply. Use a nearby convenient location where the gastrointestinal tract can be taken and spread out for examination.\nOnce the gastrointestinal tract is spread out, identify the small intestine, the ileocecal fold connecting the small intestine to cecum, and the ileal flange extending proximal to the ileocecal fold (Figure 1A).\n\t\nUsing a scalpel or knife, very lightly make an incision in the mesenteric membrane in the center of the ileal flange. Using two index fingers, bluntly dissect away the fat and connective tissue exposing the mesenteric vasculature (Figure 1B).\nFrom this flange or bulge in the intestinal mesentery, dissect out multiple branches (~2 cm in length) of the exposed mesenteric artery and vein bundles that support this portion of the ileum (Figure 1C).\n\t\nIf using forceps to grasp tissue, take care to not grasp directly or pull on the blood vessels at all while removing them as any sort of stretching can damage and negatively effect tissue performance14. Blood vessel removal is best done, by cutting across each end of the section to be removed and then cutting alongside or parallel to the now isolated section. For ease, remove some of the surrounding tissue along with vessels to provide some tissue to grasp with a pair of forceps.\nWith a pair of forceps, submerge tissue sample in a tube containing ice cold Krebs-Henseleit buffer and store on ice until processing can occur in the laboratory.\nPlace tissue sample on a cutting surface or in a petri dish and partially submerge in ice cold Krebs-Henseleit.",
    "Using #5 jewelers forceps, Noyes iris scissors, and magnifying lamp or dissecting scope (2.5 to 5.0X magnification is sufficient), carefully dissect away the surrounding fat and connective tissues and separate the artery and vein. Identifying the vessel opening at one end of the section and carefully grasp the fascia surrounding the vessel with the forceps.\nMake a cut with the scissors parallel to the vessel by sliding the tip of the scissor underneath the raised fascia. After the initial incision, the fat and connective tissues can be further detached from the vessel by cutting down either side with the scissors. Ensure that the vessels are as clean as possible while minimizing the amount of time the vessels spend on the bench.\nReturn blood vessels to tubes of fresh Krebs-Henseleit buffer and store at 4 °C (samples can remain stored for up to 24 hr after collection and still produce valid contractility data).\nUsing a razor blade, slice vessel to be used in myograph into desired number of 2-mm sections (it is helpful to use a tissue slicer to obtain consistent cross-sections).\nExamine each section under a dissecting scope (12.5X magnification) to ensure that each section has no abnormalities, branches, valves, or superficial damage inadvertently done during dissection and cleaning. Replace the vessel section if there is any abnormality, branch, valve, or superficial damage.\nStore acceptable sliced vessel sections (submerged in Krebs-Henseleit buffer) on ice or at 4 °C until ready for mounting in myograph chambers (usually <30 min).\nGently mount the vessel on the myograph by inserting the supports through the lumen and increase the tension (using the micropositioner on the myograph) being careful to not stretch the vessels above a 2 to 3 g reading.",
    "Once all chambers are covered, vacuum the buffer from all chambers and refill with 5.0 ml of buffer and start a 15 min timer to begin the equilibration period and the experiment.\n4. Experiment\nEquilibrate all vessel sections for 1.5 hr to achieve a stable resting tension of 1.0 g.\n\t\nReplace the Krebs-Henseleit incubation buffer every 15 min.\nDuring the equilibration, constantly adjust the tension on the blood vessel sections up to 2 g and then allow to relax down to approximately 0.80 g. Try not to allow vessels to relax too much (they may slip off the mounts). Try to achieve a steady baseline tension, where the vessel holds 1 g tension without requiring adjustment.\nDuring the equilibration, prepare an aqueous 1.32 M solution of KCl to be used as a reference.\nFollowing the completion of a satisfactory equilibration, add 500 μl of the 1.32 M KCl solution to result in a 0.12 M solution in the 5.5 ml solution bathing the vessel.\n\t\nFollowing the addition of the 1.32 M KCl, do not adjust the tension manually as the maximal response from this addition is used to evaluate tissue viability and can be used to normalize treatment data (e.g. concentration responses to an agonist).\nReplace the buffer in 15-min intervals until tension has returned to the baseline value of 1.0 g.\nOnce baseline is reached, change the buffer and simultaneously begin a 1 min timer. Do this for all chambers simultaneously to avoid a staggering of start times.\n\t\nVortex the standard to be added and prepare a comment for chamber 1 during the 1 min countdown.\nAdd the standards in 25 μl aliquots to each chamber as the experiment dictates (this keeps the treatment below 0.5% of the total volume).",
    "When the last standard has been added, start a 9 min timer.\nAt the end of the 9 min standard incubation, remove the treatment-containing buffer from the chambers and add 5.0 ml of fresh buffer, and start the 2.5 min timer.\nRepeat step 4.4.4.\nAt the end of the second 2.5 min rinse, vacuum the chambers and add fresh buffer, and start a 1 min timer to countdown the commencement of the second standard addition.\nContinue this cycle for all of the day’s standard additions.\nDuring the final standard addition and subsequent 9 min incubation prepare the 1.32 M KCl reference compound for an end of run reference dose addition of 500 μl.\nFollowing the 1 min interval after the final treatment addition, add the KCl and start a 9 min timer.\n\tNOTE: The KCl addition is to confirm tissue viability at the conclusion of the experiment and is helpful if administering a treatment that results in negligible response.\nAt the conclusion of the final 9 min reference compound incubation, vacuum or remove buffer from all of the chambers. Do not add fresh buffer. Conclude the experiment.\nSave Chart file, remove blood vessel sections and dispose of properly, and follow the clean up protocol (provided by manufacturer and can be lab specific) for myograph equipment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}