{
  "id": 6015,
  "origin_website": "Bio",
  "title": "CRISPR-mediated Tagging with BirA Allows Proximity Labeling in <em>Toxoplasma gondii</em>",
  "procedures": [
    "Designing a Cas9/sgRNA plasmid targeting a specific gene for C-terminal tagging with BirA Note: The protocol described here is adapted from Shen et al., 2017. We recommend reading this review for a background of CRISPR genome editing in T. gondii before attempting this protocol. sgRNA selectionIn http://toxodb.org/toxo/[href=http://toxodb.org/toxo/], navigate to your gene of interest (GOI) webpage. This may be accomplished using a gene search based on expression or functional properties or simply by entering a known gene ID or keyword. Be careful to choose the correct T. gondii strain for your work. Download the genomic sequence from 500 bp upstream of the start codon to 500 bp downstream of the stop codon. Copy the first 200 bp following the stop codon and paste at http://grna.ctegd.uga.edu/[href=http://grna.ctegd.uga.edu/]. Enter a job name, select the T. gondii lineage database, and keep all other default settings. From the generated list of sgRNA sequences, select a 20 nt sgRNA sequence that has a 3’ NGG protospacer adjacent motif (PAM) motif. The sgRNA sequence can be either on the forward or reverse DNA strand. Generation of a Cas9/sgRNA plasmid containing the gene specific sgRNAOrder DNA oligos for PCR mutagenesis of pSAG1::CAS9-U6::sgUPRT (Addgene #54467). The reverse primer (5’-AACTTGACATCCCCATTTAC-3’) is universal for all mutagenesis reactions with this Cas9/sgRNA plasmid. The forward primer (5’-[20 nt sgRNA sequence in 5’ to 3’ direction]–GTTTTAGAGCTAGAAATAGC-3’) will be unique for every sgRNA. For example, if the desired protospacer + PAM site is 5’-GCTGGTCTATCGCTAGCTCGAGG, the forward primer would be 5’-GCTGGTCTATCGCTAGCTCGGTTTTAGAGCTAGAAATAGC. Specific examples for individual genes can be found in these recent papers (Brown et al., 2017; Long et al., 2017a and 2017b).Use Q5 site-directed mutagenesis Kit (New England Biolabs) to mutate the sgRNA sequence of pSAG1::CAS9-U6::sgUPRT (Addgene #54467). We recommend reactions consisting of 6.25 µl 2x Q5 Hot-start enzyme mix (included in kit), 0.",
    "625 µl of each primer (working stock 10 µM), 1 µl (1 ng) pSAG1::CAS9-U6::sgUPRT, and 4 µl ddH2O. For thermal cycling, we recommend 25 cycles of 95 °C for 30 sec, 60 °C for 20 sec, and 72 °C for 5 min. Resolve 1 µl of the PCR reaction on a DNA gel to confirm the successful reaction with a DNA band at about 10 kb. Ligate 1 µl of the Q5 PCR reaction with the KLD mix (included in kit) according to the manufacturer’s instructions. Transform 2.5 µl of the KLD reaction into the supplied E. coli competent cells in the kit and grow on LB agar plates containing 100 µg/ml ampicillin 37 °C overnight. Grow three single colonies of E. coli overnight in 3 ml LB broth containing 100 µg/ml ampicillin at 37 °C. Pellet the bacterial cultures using centrifugation 3,000 x g for 10 min. Extract the plasmids from the bacterial pellets using a Plasmid Extraction Kit (Macherey-Nagel). Send the three plasmids for Sanger sequencing to confirm the successful insertion of sgRNA in the Cas9/sgRNA plasmid using M13 reverse universal primer. Select sequence-confirmed plasmid for further editing.Generation of a BirA tagging line using CRISPR/Cas9 taggingGeneration of a gene-specific BirA tagging cassetteDesign forward and reverse primers for amplification of the BirA tagging cassette. The forward primer contains a 40 nt 5’ homology sitting right upstream of the stop codon (note that the stop codon was excluded), and follows with GCTAGCAAGGGCTCGGGC for anchoring at the linker in a tagging plasmid pLinker-BirA-HXGPRT-LoxP (Addgene #86668). The linker sits in front of the tag BirA and serves as a spacer between the tag and endogenous protein. It also works as an anchoring site for the forward primer.",
    "The reverse primer contains a 40 nt 3’ homology arm adjacent to the Cas9 cleavage site at the sgRNA sequence (3 bp upstream of the PAM site), and follows with ATAGGGCGAATTGGAGCTCC for anchoring at the end of the HXGPRT selection cassette in the tagging plasmid. Recommended scale of synthesis is 25 nmole DNA and oligos should be processed using a standard desalting procedure.Use the manufacturer’s protocol of Q5 DNA polymerase (New England Biolabs) to amplify a BirA cassette with the forward and reverse primers in a 90 µl PCR reaction (Figure 1). The tagging plasmid (1 ng in 90 µl of reaction) is used as a DNA template, and the annealing temperature is set at 60 °C for 2 min. Resolve 2 µl of the PCR reaction on a DNA gel to confirm the successful reaction to see if a PCR product of 3.5 kb is present.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180314/20180314021410_6863.jpgFigure 1. Diagram of CRISPR/Cas9 tagging strategy. The efficiency of Cas9 site-specific cleavage combined with integration using short regions of homology allows for rapid tagging of genes of interest. Gene-specific homology regions consisting of 42 bp flanking regions (denoted as HR1 (purple) and HR2 (blue)) are combined with conserved linker regions (L (red) and T (black)) to generate amplicons. The conserved linkers flank the central tagging construct containing a BirA tag (green), a stop codon (s), and a generic 3’ UTR (yellow). Primers HR1 and HR2 are used to amplify the gene-specific BirA amplicon from the tagging plasmid. The BirA tagging cassette is then cloned into a gene-specific pCas9/sgRNA plasmid and transfected into the RH∆ku80 line, followed by drug selection. Diagram was adapted from (Long et al., 2017a).Transfection into a T.",
    "gondii recipient line and screening clonal linesNote: Throughout this protocol, all manipulation of live host cells or parasites should be performed with aseptic technique in a BSL2 certified biosafety cabinet or hood. Purify the BirA cassette with a Gel Extraction and PCR Cleanup Kit (Macherey-Nagel), according to the manufacturer’s protocol.Elute the DNA cassette by adding 10-15 µl of the Cas9/sgRNA plasmid (10-20 µg of plasmid), and elute the column again with 5 µl ddH2O, to make a cassette-Cas9/sgRNA mixture. Heat the cassette-Cas9/sgRNA mixture at 75 °C for 10 min in a 1.5 ml Eppendorf tube, and centrifuge to collect liquid on the wall. Culture human foreskin fibroblasts (HFF) in T25 flasks with D10 medium (Recipe 1) in a 37 °C, 5% CO2 incubator until they reach confluency. Trypsinize HFF cells using standard cell culture techniques to passage the cells by splitting 1:4. Infect completely confluent HFF monolayer in T25 flasks with the T. gondii line to be tagged at the density of 2.5 x 106 parasites per T25 flask. Here, T. gondii RH∆ku80∆hxgprt is used. Grow the T. gondii line for ~2 days until natural egress from HFF monolayer has occurred. Fresh HFF flasks will be needed for following transfection.To harvest the parasites, scrape the monolayer to remove from the flask and collect 5 ml of culture medium containing parasites. Release any remaining intracellular T. gondii by passing through a 22 G needle with a 10 ml syringe, carefully remove the needle and safely discard into a sharps container, and filter the parasites by passing through 3.0 μm polycarbonate membranes to remove host cell debris.",
    "Centrifuge the parasites in the flow-through at 800 x g, 18 °C for 10 min, and wash the parasite pellet with 10 ml cytomix buffer (Soldati and Boothroyd, 1993; Recipe 2) once and centrifuge the resuspension again. The typical yield from a single T25 flask of HFF is ~5-8 x 107 parasites in total.Re-suspend the parasite harvested from one T25 in 2 ml cytomix buffer for transfection. Combine 200 µl of the parasite suspension (5-8 x 106 parasites), and the cassette-Cas9/sgRNA mixture (Figure 1) in a 4 mm electroporation cuvette (BTX), and perform the electroporation with the following protocol: 1,700 V, 176 μsec of pulse length, two pulses with 100 msec interval with a BTX ECM-830 electroporator. Immediate after the electroporation, transfer the parasite suspension into fresh T25 flasks with confluent HFF and incubate them at 37 °C, 5% CO2. Twenty-four hours after electroporation and recovery, begin drug selection with 25 µg/ml mycophenolic acid supplemented with 25 µg/ml xanthine. Passage parasites as needed in drug selection medium until a drug-resistant population emerges (~2-3 passages). Following natural egress, count parasites with a hemocytometer, and dilute parasites to 3 parasites/150 µl, and add this dilution of parasites in 150 µl D10 medium into 96-well plates with confluent HFF, and grow parasites at 37 °C, 5% CO2 for 6 days without movement.Visually looking for wells containing only one plaque in the 96-well plates under an inverted-phase contrast microscope. For wells containing only one T. gondii plaque, mix the parasites and medium in wells with 200 µl pipette. Keep growing the parasites for another 3 days until parasite natural egress. Protocols for plaque formation and expansion of T. gondii in microtiter well plates have also been thoroughly described previously (Roos et al., 1994).",
    "Pick 10 clones from wells and inoculate half of the culture in wells with HFF in a 96-well plate and another half in 24-well plates with coverslips and HFF monolayer. Let the parasites on coverslips grow for 24 h, and fixed with 4% formaldehyde in PBS (Recipe 3), and proceed with membrane permeabilization using 0.25% Triton X-100 in PBS containing 10% FBS, and followed with indirect fluorescence microscopy using primary antibodies against HA (mouse) and GAP45 (rabbit), and then secondary antibodies against mouse and rabbit conjugated with Alexa Fluor 488 and 594 respectively. Parasites are then imaged under a fluorescent microscope to look clones that are positive for HA staining (green channel).Diagnostic PCR for testing the insertion of BirA at the targeted locus is used to confirm the purity of clones using one primer sitting 200 bp upstream of the translational stop codon, and another primer sitting 300 bp downstream of the stop codon. Correctly tagged T. gondii clones do not produce the endogenous PCR product, which is only detected from the parental line RH∆ku80∆hxgprt.Western blot can also be performed to confirm the expression of endogenous BirA-3HA tagging line using commercial anti-HA antibodies and secondary antibodies used for detection. For Western blotting, we typically load 106 cell equivalents per lane and resolve by separation on 10% PAGE gels prior to transfer to nitrocellulose. Our preferred method of detection with LI-COR IR dye secondary antibodies; however, optimal loading conditions may vary depending on detection method. Protocols for detection of epitope tagged proteins in T. gondii have been detailed previously (Brown et al., 2017; Long et al., 2017a and 2017b). Once positive clones are confirmed, they should be transferred to T25 flasks and preserved in cryo-vials in liquid nitrogen storage.",
    "Five million parasites should be inoculated in a T25 flask and grown for 1 day. The infected HFF monolayers should be washed twice with warm PBS and trypsinized with 1 ml trypsin solution to detach the monolayers (diluted in an equal volume of PBS). The trypsinization should be stopped by adding 1 ml of 50% FBS in D10 medium followed by addition of 1 ml 20% DMSO in the D10 medium for preservation. Transfer the mixture into cryovials and put in an isopropanol container for freezing at -80 °C. Transfer the cryovials into a box in liquid nitrogen on the next day.Purification of biotinylated proteins for Mass-spectrometryConfirmation of BirA activity in vivo Grow RH∆ku80∆hxgprt line and the BirA tagging line in T25 flasks containing HFF monolayer (containing 5 ml D10 medium) for 24 h at 37 °C, 5% CO2 in incubator and add 50 µl of 16 mM D-biotin solution (Recipe 4) in DMEM to make a final concentration at 160 µM. Grow the parasites for another 20 h. Harvest the parasites by passing through 22 G needles and D3 polycarbonate membrane to remove HFF debris, and collect the flow-through and centrifuge at 800 x g, 18 °C for 10 min to pellet the parasites. Wash parasites with cold PBS to remove excess biotin, and centrifuge and resuspend the parasite pellets in 80 µl PBS, and add 20 µl SDS sample buffer. Boil the samples at 100 °C for 5-10 min.Resolve the parasite lysate using SDS-PAGE, and perform Western blot using Streptavidin-800CW (LI-COR) to detect biotinylated proteins in the parasite lines. The BirA lane should exhibit additional bands not found in the parental RH∆ku80∆hxgprt line, as shown in Figure 2A with CaM1-BirA and CaM2-BirA.",
    "RH∆ku80∆hxgprt line and the BirA line can also be grown on coverslips with HFF monolayer in 24-well plates with addition of 160 µM D-biotin for 24 h, and used for testing by indirect immune-fluorescence microscopy using streptavidin Alexa Fluor 488, to detect biotinylated proteins at the localization of BirA protein (Figure 2B). Purification of biotinylated proteins (Figure 2C)Inoculate the parental line RH∆ku80∆hxgprt line and the BirA tagging line in T175 flasks containing confluent HFF monolayer at the dosage of 2 x 107 parasites and grow for 24 h, and add D-biotin to the final concentration of 160 µM. Keep growing parasites in D-biotin for another 20 h until natural egress.Harvest parasites by passing through a 22 G needle and D3 polycarbonate membrane to remove debris, centrifuge and wash the parasite pellet with 50 ml cold PBS three times to remove excess D-biotin.Resuspend parasites in 2 ml cytoskeleton buffer (Recipe 5), and sonicate the resuspension with a microtip in Sonic Dismembrator 550 (Fisher Scientific) using a setting: 15 sec pulse, 15 sec interval time, and 2 min total pulse time. Incubate the parasite lysis on ice for 10 min, and transfer to 2 ml Eppendorf tubes, and centrifuge at 20,000 x g, 4 °C for 20 min. Transfer the supernatant to fresh tubes, and repeat the centrifugation to obtain clearer supernatant.Transfer the supernatant to 2 ml Eppendorf tubes containing 50 µl streptavidin magnetic beads (Pierce) that have been washed and balanced with cytoskeleton buffer for three times. Resuspend the supernatant and beads well and incubate at 4 °C overnight.Wash beads twice with 1.5 ml cytoskeleton buffer, and then wash once with 1.5 ml buffer 1 (Recipe 6), wash twice with 1.5 ml buffer 2 (Recipe 7), once with 1.5 ml buffer 3 (Recipe 8), twice with 1.",
    "5 ml buffer 4 (Recipe 9) and twice with 1.5 ml PBS. Each wash step needs to incubate for 5 min and the last two wash steps with buffer 4 and PBS should be performed to remove remaining SDS. The beads are pulled down by a magnetic stand, and supernatants are discarded.Transfer 10% of beads from the last wash step, and the beads are resuspended in 20 µl PBS and 5 µl 5x SDS sample buffer (Recipe 6) for SDS-PAGE and Western blot detection with streptavidin LI-COR C800. The remaining fraction of the beads (90%) can be stored temporarily at -80 °C. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180314/20180314023023_5065.jpgFigure 2. Strategy and examples of BirA tagging in T. gondii. A. Western blot detection of biotinylated proteins in the RH∆ku80∆hxgprt lines expressing CaM1-BirA or CaM2-BirA. IRDye 800CW streptavidin was used to detect biotinylated proteins. α-HA antibodies were used to detect BirA-3HA fusions, and α-aldolase was used as a loading control, and separately visualized by IRDye 680CW Goat anti-Mouse IgG and IRDye 680CW Goat anti-rabbit IgG. B. IFA detection of biotinylated proteins in the CaM1-BirA line. Streptavidin Alexa Fluor-488 was used to detect biotinylated proteins, and CaM1-BirA-3xHA detected by α-HA antibodies and visualized with anti-rabbit secondary antibodies conjugated with Alexa Fluor 599. Scale bar = 2 µm. C. Diagram of purification of biotinylated proteins from BirA-expressing T. gondii lines. Parasites were solubilized and biotinylated proteins were captured by streptavidin beads, as described in the Methods. This diagram is based on the original description in (Roux et al., 2012).Mass-spectrometry analysis of biotinylated proteins (performed by Dr. Michael Naldrett at the Proteomics & Metabolomics Facility, Center for Biotechnology, University of Nebraska, Lincoln (https://biotech.unl.edu/[href=https://biotech.unl.",
    "edu/])Sample preparationDissolve sample beads in 200 µl of 100 mM ammonium bicarbonate and reduce by adding 4 µl of 2 mM DTT for 1 h at 37 °C.Alkylate by adding 22 µl of 100 mM Iodoacetamide (IAM) for 20 min at 22 °C in the dark. Trypsin (5 µl of 0.1 mg/ml) is added per sample, and digestion is carried out overnight at 37 °C.LC-MS/MSRun 5 µl tryptic digest sample on a NanoLC-MS/MS using a 2 h gradient on a 0.075 x 250 mm C18 Waters CSH column feeding into a Q-exactive HF mass spectrometer. Spectral analysisUse Mascot to analyze results from the mass-spectrometry by searching the T. gondii ME49_20150114 (8322 sequences), cRAP_20150130 (117 sequences) and custom (containing a streptavidin sequence) databases assuming digestion by trypsin. Mascot is searched with a fragment ion mass tolerance of 0.060 Da and a parent ion tolerance of 10.0 PPM.Deamidated of asparagine and glutamine, oxidation of methionine, carbamidomethyl of cysteine and biotin of lysine and the N-terminus should be specified in Mascot as variable modifications. Use Scaffold version 4.6.1 to validate MS/MS based peptide and protein identifications. Peptide identifications are considered valid if they are supported by greater than 95.0% probability based on the Scaffold delta-mass correction (Keller et al., 2002). We generally accept protein identifications if they could be established at greater than 99.0% probability and contained at least 2 identified peptides. Lower cutoffs can also be used for exploratory work, but may lead to more false positive identifications.Validation of putative interactor proteinsNote: This step is suggested as a follow-up to BioID experiments but will likely take several months to complete. Some BioID experiments may only require a survey of bait-BirA ‘neighbors’ without validating specific interactors. Localization of putative interactor proteinsInteractors identified in the protein interactome may not have been previously localized.",
    "To verify the possible interactions at the right location, verifying their localization would be the first step. The candidate protein coding genes can be endogenously tagged by HA or Ty epitope tags using a CRISPR tagging strategy, as described above for the BirA tagging. The only difference is that the BirA tag is replaced by HA or Ty tags in the PCR template for generation of tagging cassette. Here we recommend the plasmids stored in Addgene pLinker-6HA-HXGPRT-LoxP (#86552) and pLinker-2Ty-HXGPRT-LoxP (#86664).Once the HA or Ty tagging strain is generated, the strains can be grown on HFF monolayer on coverslips in a 24-well plate for indirect immune-fluorescence microscopy.The interactors co-localized with the bait proteins will go on for bioinformatic analysis in ToxoDB, such as cellular compartment, molecular function.The stability and function of the protein complex can be determined by conditional depletion of individual substituents using an auxin inducible degron system (Long et al., 2017a; Brown et al., 2017). A detailed protocol for using the auxin-inducible degron system is also available at Bio-protocol (Brown et al., 2018). Interaction confirmation by another proximity approach–proximity ligation assay (PLA)The protein interaction can be further confirmed by tagging one gene with HA and another gene with Ty in the same line using the CRISPR/Cas9 tagging strategy described above. In this situation, the Ty tag plasmid is recommended to harbor another resistance marker DHFR not HXGPRT. The HA tag and Ty tag in one T. gondii line can be recognized by rabbit HA and mouse Ty antibodies, and followed with corresponding secondary antibodies conjugated with PLA probes. The PLA procedures can follow the manufacturer’s protocol with DUOlink In Situ Red Start Kit (Sigma-Aldrich).",
    "The PLA approach detects protein interactions within 30 nm distance, which is similar to the distance of BirA labeling (≤ 30 nm) (Soderberg et al., 2006)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}