{
  "id": 6231,
  "origin_website": "Bio",
  "title": "Human Endothelial Cell Spheroid-based Sprouting Angiogenesis Assay in Collagen",
  "procedures": [
    "Preparation of hanging dropsCulture human umbilical vein endothelial cells (HUVEC) in Endopan 3 medium containing supplements and FBS until cells are confluent. This protocol is adjusted to running the experiment under three conditions: basal, VEGF stimulation, FGF2 stimulation.Wash HUVEC twice with PBS.Detach cells from cell culture plate using trypsin-EDTA.Stop reaction using PBS containing 10% FBS, spin down cells at 200 x g for 5 min, discard supernatant and re-suspend cells in cell culture medium.Count cells using a hemacytometer. Note: Twenty thousand cells are needed per condition. Due to loss of cells during the whole procedure, calculate to ensure you have an extra 20,000 cells. In total, 80,000 cells are needed for the preparation of the hanging drops. Transfer 80,000 cells to a fresh 15 ml conical tube. Add cell culture medium (Endopan 3 medium plus supplements and FBS) to a total volume of 4 ml.Add 1 ml of methocel stock solution, which can improve spheroid formation.Note: Some researchers do not use methocel at this step, however in our hands, this improves spheroid formation, which was also reported elsewhere (Leung et al., 2015). Mix solution carefully and transfer it to a sterile multichannel pipette reservoir.Using a 12-channel pipette, pipet 25 μl drops of the solution onto a 10 cm square Petri dish. Take care to avoid air bubbles (Figure 2A) (Video 1). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Preparation of hanging drops. Endothelial cell-methocel-solution is pipetted on a square Petri dish for hanging drop formation.To form spheroids, incubate drops upside-down in a humidified cell culture incubator set at 37 °C and 5% CO2 for 24 h (Figure 2B).Note: Hereon prepare the methocel solution containing 20% FBS which is needed on the next day. Mix carefully the methocel stock solution with 20% FBS. Avoid air bubbles.",
    "In case air bubbles are formed, check whether they disperse on the next day. If not, use another batch. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828022759_3643.jpgFigure 2. Preparation of hanging drops for spheroid formation. A. Petri dish with hanging drops. B. Representative image of a spheroid in a hanging drop 24 h after upside-down incubation. Scale bar = 100 µm.Embedding of spheroidsNote: Before continuing with the protocol, check whether spheroids formed overnight. In case multiple small cell clumps have been formed, discard them.Place collagen stock solution, 10x Medium 199, 0.2 N NaOH and methocel containing 20% FBS on ice.Using a 10 ml serological pipette gently wash off the hanging drops (containing the spheroids) with 10 ml PBS by pipetting up and down. Transfer solution into a 15 ml conical tube (Video 2). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Transfer of spheroids. Hanging drops containing spheroids are washed off and solution is transferred to a 15 ml conical tube.Spin down spheroids at 200 x g for 5 min. Then aspirate supernatant and add 2 ml of methocel containing 20% FBS (Video 3). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Mixing of spheroids and collagen. Spheroids are suspended in methocel containing 20% FBS and mixed with collagen. Solution is added to wells of a 24-well plate.Prepare collagen medium: Mix 4 ml collagen stock solution with 0.5 ml 10x Medium 199 on ice. Adjust pH value by adding dropwise sterile ice-cold 0.2 N NaOH. Subsequently invert the tube carefully to ensure thorough mixing. Add NaOH until the pH indicator of the collagen medium changes the color from yellow to orange (approximately 250-500 µl). Important: Prepare the collagen medium on ice to prevent collagen polymerization. Add 2 ml of the collagen from Step B5 to the spheroids which were re-suspended in methocel containing 20% FBS. Note: Mix the solution carefully. Avoid air bubbles.",
    "Add 1 ml of the spheroid-collagen solution per well of a 24-well plate.Incubate the plate in a humidified cell culture incubator set at 37 °C and 5% CO2 for 30 min to allow polymerization of the collagen matrix (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828022817_1875.jpgFigure 3. Collagen matrices in which spheroids are embedded were added to wells of a 24-well suspension culture plateStimulate spheroids with 100 µl of basal medium, 25 ng/ml VEGF-A (in basal medium) and 25 ng/ml FGF2 (in basal medium) by adding it dropwise on the collagen matrix.Note: The volume of the added medium can be changed if necessary. Incubate collagen matrix for 24 h in a humidified cell culture incubator.Stop the sprouting assay by adding 1 ml of 10% paraformaldehyde and store plates at 4 °C (for up to 4 weeks)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}