{
  "id": 13630,
  "origin_website": "Jove",
  "title": "Isolation of Perivascular Multipotent Precursor Cell Populations from Human Cardiac Tissue",
  "procedures": [
    "1. Processing of Human Cardiac Sample\nEnsure that all fluids, containers, instruments, and the dedicated operational area are sterile.\nPlace the cardiac tissue sample (procured by the tissue bank or surgical team) in storage medium composed of chilled Dulbecco's modified Eagle medium (DMEM) containing 20% fetal bovine serum (FBS) and 1% penicillin-streptomycin (P/S) on ice for transportation3.\nRemove the cardiac sample from the storage medium and wash with a washing medium composed of phosphate-buffered saline (PBS) supplemented with 2% FBS and 1% P/S. When handling the sample, use fine tipped forceps to grasp large vessels or pericardium and minimise crushing of the myocardium.\nSubmerge the sample in washing medium in a petri dish and remove the pericardium, endocardium and large blood vessels with sterilized iris scissors and fine-tipped forceps as described3.\nCut the remaining myocardium into small pieces of approximately 1 mm3 using a single side razor blade or a pair of sharp iris scissors. Note: Highest cell yields will be obtained if samples are processed immediately. If a delay is unavoidable, storage of the processed cardiac tissue in the fresh storage medium (>5 ml per 1 cm3 tissue) at 4 °C for up to 72 hr is possible, however presumably with an associated decline in the cell yield.\n2. Digestion of the Tissue and Isolation of Cells\nFreshly make up the digestion solution comprising 1.5 ml each of collagenase I, collagenase II, and collagenase IV (all at 0.5 mg/ml in DMEM) and warm to 37 °C in a waterbath.\n\tNote:Volume and concentration of collagenases are suitable for samples of approximately 1 cm3.\nFilter the suspended tissue pieces through a 100 µm strainer and wash twice with PBS. Transfer the tissue pieces to a sterile 30 ml container with a tightly sealed lid.",
    "Note: Short wide pots rather than tall narrow tubes give better results. Alternatively, put tissue pieces in a sterile 50 ml tube and place horizontally if a 30 ml container is not available.\nAdd all the digestion solutions (4.5 ml total) and place the container within a sealed plastic bag in a 37 °C shaking water bath set to 120 rpm. Alternatively, seal the container with paraffin film and place in a heated orbital shaker set to 120 rpm.\nAfter 15 min, remove and invert the pot three times before replacing for a further 15 min. Remove and quench the collagenases with 5 ml of DMEM supplemented with 20% FBS and 1% P/S.\nTriturate the digest by gently pipetting ten to twenty times with a 10 ml serological pipette to break up any tissue clumps. Filter the suspension sequentially through 100 µm, 70 µm and finally 40 µm cell strainers to remove undigested materials and obtain a single cell suspension.\n\tNote: Do not rinse between cell strainers to avoid cell debrisgenerated by the enzyme digestion process.\nCentrifuge the cell suspension at 200 x g for 4 min, carefully decant the supernatant and re-suspend the pellet in 1 ml of red cell lysing buffer for 2 min at room temperature before diluting with 4 ml of washing medium.\nRepeat the centrifugation step and re-suspend the pellet in 1 ml of washing medium. Mix well and take 10 µl of the cell suspension for cell counting.",
    "Mix 10 µl of the cell suspension with 10 µl of Trypan blue stain and place 10 µl of the mixture on a standard hemocytometer for cell counting. Count the number of bright, round cells present in the four corner squares (each subdivided into sixteen small squares) and divide by 4 to get the mean per corner square. Multiply the mean by 2 to account for the stain dilution factor and then by 104 to obtain the total number of cells per 1 ml of sample.\n3. Cell Labelling and Sorting\nAdd 50 µl of mouse serum to the cell suspension and incubate at 4 °C for 20 min to block non-specific antibody binding.\nCentrifuge the cell suspension with mouse serum at 200 x g for 4 min, remove supernatant, and re-suspend in washing medium at a concentration of 1 x 106 cells per 100 µl.\nAliquot 50 µl each of the cell suspension for the isotype and unstained controls into two polystyrene round bottom flow cytometry tubes then place the remaining volume into a third tube for multi-color staining.\nAdd CD34-PE, CD45-APC-Cy7, CD56-PE-Cy7, CD144-PerCP-Cy5.5, and CD146-AF647 antibodies (all 1:100) to the single cell suspension for multi-color staining. For the isotype control, add equivalent volumes of PE-, APC-Cy7-, PE-Cy7-, PerCP-Cy5.5- and AF647-conjugated isotype antibodies. Gently pipette to mix the antibodies with the cells and incubate all tubes at 4 °C for 20 min in the dark.\nPrepare compensation control beads by adding one drop of positive beads to 100 µl of washing medium in five polystyrene round bottom flow-cytometry tubes. Add CD34-PE, CD45-APC-Cy7, CD56-PE-Cy7, CD144-PerCP-Cy5.5, and CD146-AF647 antibodies (all 1:100) individually to each of the 5 tubes. Incubate all tubes at 4 °C for 20 min in the dark.",
    "During the incubation, prepare cell collection tubes each with 500 µl of Endothelial Growth Medium-2 (EGM-2) culture medium and place at 4 °C.\nFollowing antibody incubation, add 5 ml of washing medium to wash cells and beads in order to remove unbound antibody. Centrifuge all tubes at 200 x g for 4 min. Repeat the washing and centrifugation step. Carefully decant the supernatant and pipette gently when re-suspending cells.\nRe-suspend in washing medium at a concentration of approximately 1 x 106 cells per 250 µl. Re-suspend the beads in 100 µl of washing medium.\nTransport all cell and bead suspensions to the cell sorter on ice in the dark. Add 1 drop of negative beads to the positive bead compensation control tubes and use these to set the fluorescence compensation.\nRun unstained control cells according to manufacturer's instructions to establish the background fluorescence and set the voltages to the following: FSC 150V; SSC 290V; V450/50 350V; V710/50 620V; B530/30 400V; B710/50 530V; YG780/60 460; R670/30 480V; R780/60 460V. Run isotypes controls according to manufacturer's instructions to establish the background fluorescence thresholds related to non-specific binding. Run the multi-color stained sample and collect the pericyte and adventitial cell populations into the collection tubes (Figure 1).\n\tNOTE: Optimal viable cell yields are approximately 3% of the total live cell dissociation for pericytes and 4% for adventitial cells.\n4. Cell Culture\nSelect suitable size culture plates according to the outcome of the FACS sorting. Add 100 µl of sterile 0.2% gelatin solution per cm2 of growth area and agitate manually to coat the entire wells. Incubate plates at 4 °C for 10 min and remove gelatin solution completely. Keep collected cells on ice whilst preparing culture plates.",
    "Note: Freshly sorted pericytes and adventitial cells grow well when seeded at a density of 30,000 to 40,000 cells/cm2 on gelatin-coated culture surface.\nCentrifuge freshly collected cells at 200 x g for 4 min and gently re-suspend the cell pellet in an appropriate amount of EGM-2.Seed the cells on gelatin-coated plates.\n\tNote: The actual number of cells to be seeded per well and the amount of EGM-2 to be added depend on the plate selection. For example, 0.5 ml and 1 ml EGM-2 are needed per well for 48- and 24-well plates respectively.\nExchange EGM-2 for perivascular cell growth medium (DMEM supplemented with 20% FBS and 1% P/S) for both pericytes and adventitial cells once cells have settled and adhered to the plate (after at least 72 hr). Change the media every 72 hr from then on. Carry out initial and all subsequent incubations in 5% CO2 and at 37 °C.\nDissociate cells using 0.05% Trypsin EDTA when pericytes and adventitial cells reach 80 to 90% confluence. Quench with 20% FBS in PBS, centrifuge at 200 x g for 4 min, re-suspend in perivascular cell growth medium, and then passage the cells at a 1:3 ratio onto uncoated polystyrene culture plates. From Passage 2 onwards, passage cells at a 1:5 ratio (or at approximately 7,000 cells/cm2) to uncoated polystyrene culture plates or flasks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}