{
  "id": 6716,
  "origin_website": "Bio",
  "title": "Isolation of Stem Cells, Endothelial Cells and Pericytes from Human Infantile Hemangioma",
  "procedures": [
    "IH specimens should be obtained under an institutional review board (IRB)-approved human subject protocol. The clinical diagnosis should be confirmed by histopathology. Biosafety Level 2 procedures for working with human tissue should be followed. Sterile technique and sterile solutions should be used at each step of tissue homogenization, antibody-mediated selection and cell culture.Tissue collection and digestionTransfer IH tissue into a sterile container filled with 5-10 ml Collection Medium as soon as possible after resection. Place the tissue on ice and bring it to the lab.Rinse the tissue twice with sterile PBS to remove surface blood.If necessary, use a sterile scalpel and forcep to separate the inner soft IH tissue from the outer rough epidermis.Mince the IH tissue into ~2 mm3 pieces with a sterile, disposable scalpel.Transfer minced IH tissue into a 50 ml conical tube and mix with freshly-made Digestion Buffer using gentle pipetting. Use 5 volumes of Digestion Buffer per gram of tumor tissue (i.e., 5 ml Digestion Buffer/1 gram of minced IH).Incubate mixture at 37 °C. Mix every 5-10 min by tapping the tube. The tissue should appear soft and the solution should become turbid after 40-50 min. Do not over-digest (i.e., longer than 1 h) because the sample will become viscous due to cell lysis and DNA release.Gently homogenize the IH tissue digest with a Teflon pestle. Move pestle up and down and twist while squeezing the 50 ml tube. Let tumor pieces settle to the bottom of tube and transfer the supernatant to a new tube on ice.Add 5 ml Collection Medium to the remaining tissue in the original tube and repeat the homogenization; repeat once more. Combine the three supernatants.Filter the combined supernatants through a 100 µm sterile cell strainer.Wash cell strainer with 5-10 ml Collection Medium to flush cells through the strainer.",
    "Centrifuge cell suspension at 282 x g, room temperature (RT) for 5 min.Carefully aspirate supernatant and re-suspend the cell pellet with 5-10 ml Buffer A.Centrifuge cell suspension at 240 x g, RT for 5min. Aspirate the supernatant carefully.Optional: Lysis of red blood cells (RBCs) for the very red (i.e., blood filled) specimenResuspend cells in 1 ml PBS and mix well with 7 ml ice-cold RBC lysis buffer.Incubate at 4 °C for 10 min with gentle shaking.Centrifuge at 240 x g, RT for 5 min. Aspirate the supernatant.Resuspend the cell pellet in 1 ml Buffer A. Determine cell number. Expect 1 x 106 -2 x 106 cells from 0.5 cm3 IH specimen. Use half of the cells for HemSC Purification (Procedure B) and the other for HemEC and HemPericyte Purification (Procedures C-E). See Figure 1 for a schematic of the cell purification strategy.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200107/20200107013251_3804.jpgFigure 1. Cell isolation using sequential antibody-coated magnetic beads. Schematic shows work flow for isolating four cell types from IH tissue.HemSC purification (see Miltenyi Biotec protocol for the additional information)Centrifuge cell suspension at 240 x g, RT for 5 min. Aspirate supernatant.Resuspend the cells in 300 µl ice-cold Buffer A.Add 100 µl human FcR blocking reagent, mix well by pipetting up and down 2-3 times.Add 100 µl CD133 Microbeads, mix well.Incubate for 30 min in the refrigerator (2-8 °C), gently tap tube every 5-10 min.Wash cells by adding 9.5 ml ice-cold Buffer A.Centrifuge cells at 240 x g, RT for 5 min. Aspirate supernatant.Resuspend cells in 500 µl ice-cold Buffer A.Pre-wash MS column by placing the MS column in the magnetic field and rinsing with 500 µl Buffer A. Wait until the column reservoir is empty.Place a 70 µm cell strainer on the top of column reservoir.",
    "Load cell suspension and let it run through cell strainer and enter MS column held in the magnet.Collect the effluent.Wash the MS column with 4x 500 µl Buffer A.Collect all effluent fractions and combine together; save as CD133-negative cells.Remove the column from the magnetic separator and place it on a 1.7 ml sterile microcentrifuge tube.Pipette 1 ml Buffer A onto the top of column and collect CD133-positive cells by firmly pushing the plunger (supplied) into the column.Optional: To increase the purity of CD133-positive cells, load the released cell fraction over a second MS column and repeat CD133 selection.Determine the number of cells in both CD133-positive and CD133-negative cell fractions. Centrifuge cell suspensions at 240 x g, RT for 5min. Remove supernatant. The number of CD133+ cells varies from 0.2% to 2% of total digested tumor cells, as reported by Yu et al., 2004. The yield depends on the size of the specimen, the enzyme digestion and batch of anti-CD133-coated beads.Resuspend CD133-positive cells in 1 ml EGM-2 media. Plate them in one-well of 24-well plate pre-coated with 1 µg/cm2 FN. The CD133-positive HemSC will start to grow rapidly in culture after 7-10 days and will exhibit a mesenchymal morphology (Figure 3) (Khan et al., 2008).Plate CD133-negative cells in one well of 6-well plate pre-coated with 1 µg/cm2 FN. After primary culture, cryopreserve cells for future use (Procedure H), for example the CD133-negative fraction can be used for selection of CD31+ and/or PDGFRβ+ cells.GLUT1-positive endothelial cell purification (see Pan mouse IgG Dynabeads protocol for the additional information)Centrifuge the other half of cell suspension at 240 x g, RT for 5 min.Resuspend cells (up to 106) in 80 µl ice-cold Buffer A.Add 20 µl human FcR blocking reagent.Incubate for 10 min in the refrigerator (2-8 °C).",
    "Add 1 µg of mouse anti-human GLUT1 antibody to 100 µl cell suspension–1 µg antibody/106 cells/100 µl buffer.Incubate for 30 min in the refrigerator (2-8 °C). Mix by gently tapping the tube every 5-10 min.Add 10 ml ice-cold Buffer A, mix well.Centrifuge at 240 x g, RT for 5min. Resuspend the cell pellet in 100 µl ice-cold Buffer B.Pre-wash Dynabeads: Transfer 5 µl of the Pan mouse IgG Dynabeads to a 1.7 ml sterile microcentrifuge tube. Add 1 ml ice-cold Buffer B and mix. Place the tube in a magnet for 1 min and aspirate supernatant.Remove the tube from the magnet and resuspend the washed Dynabeads with 5 µl ice-cold Buffer B.Add washed beads to anti-GLUT1 treated cells at 1.5 µl beads/106 cells/100 µl buffer. Mix well and incubate for 10 min in the refrigerator (2-8 °C). The bead to cell ratio can be increased to 2.5 µl beads/106 cells/100 µl buffer but avoid increasing the incubation time because this may increase non-specific binding.Add 1 ml ice-cold Buffer B. Place the tube in the magnet for 1 min. Anti-GLUT1-bound cells will move towards the magnet leaving the GLUT1-negative cells free in suspension. Gently collect the GLUT1-negative cell fraction into a new 15 ml conical tube.Remove the tube from the magnet. Add 1 ml ice-cold buffer B and mix well. Place the tube back to the magnet, collect and combine the un-bound cells in the same 15 ml tube.Repeat this wash step twice more.After the final wash, remove the tube from the magnet to release the bead-bound GLUT1-positive cells by adding 1 ml EGM-2 media to resuspend cells. Determine the cell number. Plate cells in one well of 24-well plate precoated with 1 µg/cm2 FN.",
    "The GLUT1-negative cells will be further purified using anti-CD31 magnetic beads selection as described in the next section.Optional: To increase the yield of GLUT1-positive cells, a second round of anti-mouse IgG beads selection can be applied in GLUT1-negative cell fraction. Repeat magnetic separation and plate cells in a new well of 24-well plate. Do not combine cells from the 1st selection. The GLUT1-positive endothelial cells will start to proliferate after 10-12 days in culture (Huang et al., 2015).Note: Almost all of GLUT1-positive cells in proliferating IH are endothelial cells (see Huang et al., 2015 Figure 1C), that is, they express endothelial markers CD31, VE-Cadherin and VEGRR2. After 2-3 weeks in vitro culture and expansion, the cells transition to a mesenchymal phenotype (Figure 3) (Huang et al., 2015).GLUT1-negative endothelial cells purification (see anti-human CD31 Dynabeads protocol for the additional information)Determine the number of cells in the GLUT1-negative fraction. Centrifuge cell suspension at 240 x g, RT for 5 min. Aspirate the supernatant.Resuspend the cells in 200 µl ice-cold buffer B.Pre-wash Dynabeads: Transfer 5 µl anti-human CD31 Dynabeads to a 1.7 ml sterile microcentrifuge tube. Add 1 ml ice-cold Buffer B and mix. Place the tube in a magnet for 1 min and aspirate supernatant.Remove the tube from the magnet and resuspend washed beads with 5 µl ice-cold Buffer B Add 2 µl washed anti-human CD31 Dynabeads to the cells and incubate for 10 min in the refrigerator (2-8 °C).Note: 5-8 beads per cell is optimal for selection (Figure 2). If too many beads bind, it will reduce endothelial cell attachment to the FN-coated dish. Do not incubate for longer than 10 min as this might result in non-specific binding and decreased purity.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200120/20200120172755_7339.jpgFigure 2. Anti-CD31-bead bound cellsAdd 1 ml ice-cold Buffer B.",
    "Place the tube in the magnet and hold for 1 min. Anti-CD31 Dynabead bound cells will move towards the magnet (accumulating on the wall of the tube) leaving the unbound cells, the CD31-negative cell fraction, free in suspension. Gently collect the CD31-negative cell fraction into a new 15 ml conical tube.Remove the tube from the magnet. Add 1 ml ice-cold buffer B and mix well. Repeat magnetic separation. Collect and combined bead un-bound cells into the same 15 ml tube.Repeat wash step two more times.After the final wash, remove the tube from the magnet and release the bead-bound CD31-positive cells in 1 ml EGM-2 media (Figure 2). Determine the cell number and plate cells in one well of 24-well plate precoated with 1 µg/cm2 FN.GLUT1-negative HemECs will require 7-10 days to begin rapid proliferation. If needed, repeat the anti-CD31 selection to increase the endothelial cell purity. GLUT1-negative HemEC show typical endothelial morphology (Figure 3).Optional: To increase the yield of CD31-positive cells, a second round of anti-CD31 beads selection can be applied in the CD31-negative cell fraction. Repeat magnetic separation and plate cells in a new well of 24-well plate. Do not combine cells from the first selection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200107/20200107013357_0966.jpgFigure 3. IH cells in the primary culturePDGFRβ-positive cell purification (see Dynabeads® M-270 Streptavidin protocol for the additional information)Determine the number of cells in the CD31-negative cell fraction. Centrifuge the cell suspension at 240 x g, RT for 5 min. Aspirate the supernatant.Resuspend the cells in 80 µl ice-cold buffer A.Add 20 µl human FcR blocking reagent.Incubate for 10 min in the refrigerator (2-8 °C).Add 1 µg of biotinylated anti-PDGFRβ antibody to the 100 µl cell suspension.Incubate for 30 min in the refrigerator (2-8 °C). Mix by gently tapping tube every 5-10 min.Add 10 ml ice-cold buffer A, mix well.",
    "Centrifuge cell suspension at 240 x g, RT for 5min. Aspirate supernatant and resuspend cells in 100 µl ice-cold Buffer B.Pre-wash Dynabeads: Transfer 5 µl Streptavidin-coupled Dynabeads to a 1.7 ml microcentrifuge tube. Add 1 ml ice-cold Buffer B and mix. Place the tube in a magnet for 1 min and aspirate supernatant. Remove the tube from the magnet and resuspend the washed beads with 5 µl ice-cold Buffer B.Add 1.5 µl washed Streptavidin-coupled Dynabeads to the cells, mix well and incubate for 10 min in the refrigerator (2-8 °C).Add 1ml ice-cold Buffer B. Place the tube in the magnet for 1 min. PDGFRβ-positive cells will move towards the magnet leaving the PDGFRβ-negative cell fraction free in suspension. Gently collect the PDGFRβ-negative cell fraction into a new 15 ml conical tube.Remove the tube from the magnetic field. Add 1 ml ice-cold buffer B and mix gently by pipetting. Place the tube back to the magnet, collect and combine the un-bound cells in the same 15ml tube.Repeat wash step two more times, collect and combine PDGFRβ-negative cells.After the final wash, collect PDGFRβ-positive cells in 1 ml EGM-2 media, determine cell number and plate into one well of 24-well plate precoated with 1 µg/cm2 FN. Note: PDGFRβ-positive cells–HemPericytes–will start to expand after 5-7 days (Figure 3).  Determine the number of PDGFRβ-negative cells. Plate cells into one well of 6-well plate precoated with 1 µg/cm2 FN and filled with 2ml EGM-2 media. These are stromal cells.Alternatively, the Hem Pericytes can be plated on a non-coated dish in 10% FBS-DMEM as described in Boscolo et al., 2013.Expanding bead-selected IH cellsForty-eight hours after plating, carefully remove media and non-adherent cells with a pipette. Add fresh EGM-2 media into each well. You should see attached single cells and/or cell clusters.Change the media every 2-3 days.",
    "Passaging IH-derived cellTo passage cells, first prepare FN-coated plates at concentration 0.1 µg/cm2.Note: This is 10 fold lower than the amount of FN coated on plates used for the initial plating. Wash plates with sterile PBS twice before use. The PBS from the 2nd wash should be removed right before the cells are ready to be plated.Wash cell monolayer with PBS twice.Aspirate PBS and add pre-warmed trypsin-EDTA (0.8 ml/p60, 1.5 ml/p100, 5 ml/p150). Gently rock the plates to evenly distribute the trypsin-EDTA.Incubate in the 37 °C incubator for 1-2 min. Gently tap the plates to detach cells.Inactivate the trypsin with quenching/thawing medium (5 ml/p60, 8 ml/p100; 15 ml/p150), transfer the trypsinized cells to a sterile tube.Recover remaining cells from the plate by adding quenching/thawing medium to rinse the plate. Collect the rinse and combine the cells into the same tube.Determine cell number, centrifuge the cell suspension at 240 x g, RT for 5min, and aspirate the supernatant.Resuspend the cells in EGM-2 media and plate cells on a FN-coated, tissue culture-treated dish at a cell density 5,000 cells/cm2 (sparse) or 10,000 cells/cm2.HemSC, GLUT1-positive HemEC and HemPericyte are usually plated at 5,000 cells/cm2. A 90% confluent p100 plate has 5 x 106-6 x 106 cells.GLUT1-negative HemEC are usually plated at 10,000 cells/cm2. A 90% confluent p100 plate has 3 x 106-4 x 106 cells.Freezing IH-derived cellsWhen cells are confluent, wash the monolayer twice with PBS.Trypsinize the cells, collect the cell suspension and determine cell number.Centrifuge cell suspension at 240 x g, RT for 5 min.Label a cryovial with the passage number (+1), cell number, and date.Suspend the cell pellet at 1 x 106-5 x 106 cells in 1 ml freezing medium and aliquot 0.5-1 ml per cryovial.Put cryovials into the “Mr. Frosty” and place at -80 °C overnight.",
    "The next day, move cryovials to the liquid nitrogen tank for long-term storage.Thawing IH-derived cellsPrepare FN-coated, tissue culture-treated plates (0.1 µg/cm2), pre-warmed EGM2 medium and quenching/thawing medium.Prepare 15 ml Falcon tubes. Add 5 ml quenching/thawing medium to each tube.Wash FN-coated plates with PBS twice.Quickly thaw frozen cells directly after removing from liquid nitrogen by placing in a 37 °C water bath for 1-2 min. Gently swirl the tube to facilitate thawing.Transfer cells into the 15 ml tube pre-filled with quenching/thawing medium (avoid vigorous pipetting). Determine cell number.Centrifuge cell suspension at 240 x g, RT for 5 min.Aspirate quenching/thawing medium. Resuspend cells in EGM-2 media and plate on FN-coated, tissue culture-treated dish (3 ml/p60; 10 ml/p100; 25 ml/p150).Label the coated plates with cell type, passage number, date, and initials.Cells should attach within 4-6 h after plating. Add fresh media every 2-3 days."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}