{
  "id": 8435,
  "origin_website": "Jove",
  "title": "Acute Mouse Brain Slicing to Investigate Spontaneous Hippocampal Network Activity",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee at Columbia University (AC-AAAU9451).\n1. Prepare solutions\nPrepare sucrose cutting solution for slicing as described in Table 1.\n\tNOTE: After preparing 1 L of sucrose solution, freeze a small amount (approximately 100–200 mL) in an ice tray. These frozen sucrose ice cubes will be blended into an icy slurry (see step 4.3).\nPrepare artificial cerebrospinal fluid (ACSF) for recording as described in Table 2.\nPrepare 1 M of NaCl for stimulation pipettes by dissolving 0.05844 g of NaCl in 1 mL of purified water that has been filtered to remove trace metals and other impurities.\n\tNOTE: Sucrose cutting solution and ACSF should be prepared fresh for each experiment.\n2. Prepare agar ramp\nPrepare 4% agar (e.g., 2 g of agar in 50 mL of water) by dissolving agar powder into purified water that has been filtered to remove trace metals and other impurities. Heat the mixture in a microwave until it just begins to boil (approximately 30–60 s). Pour the molten agar into a mold and allow it to cool and solidify at 4 °C in a fridge at an approximately 12° incline.\n\tNOTE: For a mold, one can use any glass or plastic container set at an angle, with enough molten agar poured in to form a ramp of 4 cm in length and approximately 0.8 cm in height.\n3. Stage the slicing area\nFill a 400 mL beaker containing a slice recovery chamber with approximately 250 mL of ACSF; place it in a water bath warmed to 32 °C and begin bubbling with carbogen (95% oxygen gas/5% carbon dioxide gas).",
    "NOTE: Fill the recovery beaker with just enough fluid to place the nylon mesh of the holding chamber at the very surface of the solution, so that slices will be held at the interface of the warm solution mixture and the air (Figure 1). Place small pieces of lens paper on the nylon mesh. The slices will lay on top of the lens paper, which can later be used to transfer slices individually to the recording chamber (see step 6.6).\nPlace a flask with the sucrose solution into an ice bucket to chill and begin bubbling with carbogen.\n\tNOTE: The recovery beaker and sucrose solution should be warmed and chilled, respectively, with carbogen bubbling for at least 30 mins before the mouse is placed in the isoflurane chamber.\nPull out the tray of premade, frozen sucrose solution ice cubes from the freezer and place on the bench to partially thaw.\nPlace one half of a clean double-edged razor blade into the microtome and calibrate if necessary. Set aside the other half of the razor blade for use during the dissection.\nRun a carbogen line and temperature probe into the slicing chamber and surround with ice to chill the chamber.\nPrepare a clean bench or table covered with two disposable absorbent pads. Lay out all dissection tools and three pieces of lab tape on the left pad, where the transcardial perfusion will be performed.\n\tNOTE: Dissection tools include small Bonn scissors, dissector scissors, large spatula/spoon, microspatula, scalpel with new blade, spatula, sharp/blunt surgical scissors, large tissue forceps, and small tissue forceps (see Table of Materials).",
    "On the other absorbent pad to the right of the perfusion area, place a circular piece of filter paper into the lid of a 100 mm diameter glass Petri dish. Place the bottom of the Petri dish next to the lid and place a carbogen line into both pieces of the dish.\nUse a razor blade or scalpel to cut a small ramp of agar (approximately 4 cm along the angled surface, 0.8 cm in height, 2 cm in width). Cut off a piece of the ramp from the tall end and reverse it to create a backing block of agar. Use cyanoacrylate adhesive to affix the agar ramp and backing block to the slicing platform and set aside.\n\tNOTE: The backing block of agar helps stabilize the brain during slicing and provides a surface on which to dissect away unnecessary tissues from each slice (Figure 1).\n4. Transcardial perfusion\nSuspend a 60 mL capacity syringe as a reservoir for sucrose cutting solution approximately 18 inches above the benchtop (e.g., using a three-pronged swivel clamp on a vertical post). Attach tubing to the bottom of the reservoir, run the tubing through a roller clamp, and connect the other end of the tube to a clean 20 G needle.\nFill the 60 mL reservoir with approximately 30 mL of chilled sucrose solution and direct a carbogen line into the sucrose reservoir to continually bubble the perfusate.\n\tNOTE: Ensure that the sucrose is flowing through the tubing and needle without any trapped bubbles. The flow rate should be just fast enough to have a steady, continual stream of dripping sucrose from the needle.\nUsing a blender, crush and blend the frozen sucrose into an icy slurry and use the large spatula/spoon to distribute the slurry.",
    "Place a small amount of sucrose slurry around the edges of the glass Petri dish lid. Add a small amount of sucrose slurry to the Petri dish bottom.\nAdd roughly 20–30 mL of sucrose slurry to the perfusion fluid reservoir, mixing it well with the 30 mL of chilled liquid sucrose until the reservoir contains a mixture of very cold, predominantly liquid sucrose with some remnant frozen solution.\nPlace the mouse into a chamber connected to an isoflurane vaporizer. With oxygen flowing at approximately 2 L/min, turn the dial of the vaporizer to deliver isoflurane at 5% concentration and start a timer.\n\tNOTE: Keep this timer going throughout the course of slicing to gauge how quickly the slices are obtained. The procedure should be done as quickly as possible, such that slicing is complete, and tissue is recovering in the interface chamber within 15–20 min of the animal entering the isoflurane chamber. Watch the mouse to ensure a state of deep anesthesia is achieved. After a minimum of 5 min, the mouse should be deeply anesthetized and unresponsive to toe pinches.\nImmediately before removing the mouse from the isoflurane chamber, fill the Petri dish lid with chilled sucrose solution to a depth of approximately 3–5 mm and fill the Petri dish bottom with chilled sucrose solution to a depth of approximately 1.0 cm.",
    "Quickly transfer the mouse to the left absorbent pad and use the 3 pieces of tape to secure the forelimbs and tail. Perform a hindlimb toe pinch to ensure that the mouse is unresponsive before any incision is performed. Using the large tissue forceps and surgical scissors, tent the skin and make a lengthwise incision from the bottom of the sternum to the top of the chest. Using the forceps pull up on the sternum and use the scissors to cut through the diaphragm.\n\tNOTE: The initial positioning of the mouse and first several incisions to sever the diaphragm should be performed as quickly as possible to ensure the mouse does not regain consciousness. To ensure an adequate depth of anesthesia throughout the procedure, a nose cone can be placed on the mouse to deliver isoflurane during the perfusion.\nUse the scissors to cut through the rib cage on each side, cutting in one large motion towards the point where the forelimb meets the body. With the forceps, swing the front of the rib cage away and up toward the head, and then fully remove it with a horizontal cut using the large scissors. Hold the heart in place using the large forceps and insert the 20 G perfusion needle into the left ventricle. Once the needle is positioned correctly, the left side of the heart should quickly pale as chilled sucrose solution fills the ventricle.\nUse the small dissector scissors to cut into the right atrium and allow the blood to flow out of the circulatory system. If the incisions are performed correctly, there should be minimal damage to the heart, and it should continue pumping throughout the perfusion.",
    "NOTE: Rolled-up pieces of tissue paper can be used to wick away blood and sucrose solution from the heart and maintain visibility of the perfusion needle during the procedure.\nEnsure that the perfusion needle stays in place and does not fall out of the left ventricle. With a proper flow rate and placement, the liver will start to pale to a light tan/beige color with 20–30 s.\nAfter 30–45 s, use the large scissors to decapitate the mouse. Holding the head in the left hand, push or peel the skin away from the skull. In a well-perfused animal, the skull should be very pale, and the brain should appear a very light pink color (approaching white) through the skull without clearly visible blood vessels.\n5. Extract the brain and cut slices\nUsing the small Bonn scissors, make two lateral cuts through the skull towards the midline at the front of the skull, near the eyes. Make two additional cuts on either side of the base of the skull.\nTransfer the head to the bottom of the glass Petri dish where it should be mostly immersed in chilled sucrose solution. Use the small Bonn scissors to cut down the midline along the length of the skull, pulling up with the scissors to minimize damage to the underlying brain tissue. Using the small tissue forceps, firmly grasp each side of the skull and swing it up and away from the brain, like opening a book.\nUse the fingers of the left hand to hold the flaps of skull open and insert the microspatula under the brain near the olfactory bulbs. Flip the brain out of the skull into the sucrose and use the microspatula to sever the brain stem. Wash the brain to remove any residual blood, fur, or other tissues.",
    "Use the large spatula/spoon to transfer the brain to the lid of the glass Petri dish. With the other half of the double-edged razor blade previously set aside, make two coronal cuts to first remove the cerebellum and then the most anterior portion of the brain, including the olfactory bulbs (Figure 1).\nApply cyanoacrylate adhesive to the agar ramp. Very briefly place the brain onto a piece of dry filter paper using the large tissue forceps and then immediately transfer it to the agar ramp, placing the ventral surface of the brain onto the adhesive.\n\tNOTE: For slices of the intermediate hippocampus, the brain should be oriented with the anterior facing up the slope of the ramp, and the posterior closer to the blade. For slices of the ventral hippocampus, orient the brain with the anterior end pointed down the slope of the ramp, with the posterior end at the top of the ramp, further away from the blade. In either case, the brain should be positioned at the top of the ramp, such that the coronally-cut surface of the brain contacts the agar backing block (Figure 1).\nPlace the slicing platform with the agar and brain into the slicing chamber of the microtome and completely immerse with chilled sucrose solution. Use the large spatula/spoon to transfer some sucrose slurry to the chamber, stirring to melt any frozen sucrose and rapidly bring down the temperature of the mixture to ~1–2 °C.\n\tNOTE: Watch the temperature gauge throughout the slicing. If the sucrose solution warms above 3 °C, add more slurry and mix to bring the temperature back down.",
    "Cut slices at a thickness of 450 μm with the microtome speed set to 0.07 mm/s. As each slice is freed, use the small tissue forceps and a sharp scalpel to first separate the two hemispheres, and then to cut away tissue until the slice consists primarily of the hippocampus and parahippocampal regions (Figure 1).\nUse a plastic transfer pipette to transfer the slices individually to the interface recovery chamber, ensuring that they are positioned at the interface of the ACSF and the air with only a thin meniscus of ACSF covering the slices. Tightly close the lid of the chamber and allow slices to recover at 32 °C for 30 min.\nAfter the initial recovery at 32 °C, bring the interface recovery chamber out of the water bath and place on a stirrer set to a slow speed such that the magnetic stir bar promotes circulation of ACSF within the chamber. Allow it to gradually cool to room temperature as the slices recover for an additional 90 min. Ensure that the recovery chamber is continually bubbled with carbogen and do not allow large bubbles to become trapped underneath the slices.\n6. Perform local field potential (LFP) recordings of spontaneous activity\nPrepare for LFP recordings by turning on all necessary equipment, including the computer running the acquisition software, the monitor connected to the computer, the stimulators, the micromanipulator, the temperature controller, the microscope light source, the microscope-attached camera, the microelectrode amplifier, the digitizer, and the peristaltic pump. If using a central vacuum system, open the wall valve to prepare the vacuum line that will remove ACSF from the recording chamber.",
    "Fill the heated reservoir with ACSF, then place one end of the tubing into the 400 mL beaker containing the bubbling ACSF. Turn on the peristaltic pump to direct ACSF from the 400 mL beaker to the heated reservoir, and from the reservoir onward to the recording chamber. Tap or pinch the tubing to release any trapped bubbles.\nAdjust the peristaltic pump to ensure that the ACSF flow rate through the recording chamber is fast (~ 8–10 mL/min). Use a temperature probe to ensure that the ACSF is 32 °C in the center of the recording chamber.\n\tNOTE: If ACSF is delivered to the recording chamber using a peristaltic pump, a high flow rate can result in a significant fluctuation in flow rate. Consistent flow rates can be achieved using a simple pulsation dampener consisting of a series of empty syringes integrated into the tubing (Figure 2).\nPrepare stimulation and recording pipettes from borosilicate glass capillaries using a heated filament puller. The puller protocol should be configured to yield pipettes with a resistance of 2–3 MOhm for stimulation or local field potential recording electrodes.\nFill stimulation pipettes with 1 M NaCl and LFP pipettes with ACSF.\nBriefly clamp the tubing and turn off the pump to pause flow of ACSF. Transfer a slice to the recording chamber using fine forceps to grasp a corner of the lens paper the slice is resting on-the slice will stick to the lens paper. Place the lens paper and slice into the recording chamber with the slice facing down, then “peel” away the lens paper leaving the slice submerged in the recording chamber. Secure the slice using a harp.\n\tNOTE: Harps can be purchased pre-made or made in-lab using a U-shaped piece of stainless steel or platinum and fine nylon filament.",
    "Place a NaCl-filled stimulation pipette in the manual micromanipulator and slowly advance the tip of the pipette into the surface of the slice (e.g., in the stratum radiatum layer) at an angle of approximately 30–45°. Once the tip of the pipette enters the tissue, advance the pipette forward slowly and refrain from large movements in the lateral or vertical direction that could unnecessarily damage axons within the slice. Place the tip of the pipette at least 50–100 μm deep into the slice to avoid cells near the surface that were damaged during slicing.\nPlace an ACSF-filled LFP pipette into the pipette holder attached to the motorized micromanipulator. Apply a very light positive pressure using either mouth pressure or a 1 mL syringe connected via a stopcock valve and a short length of tubing to the pipette holder.\n\tNOTE: Position LFP pipettes within the slice in order to record the signals of interest: in the case of sharp wave ripples, one LFP pipette should be placed in the stratum pyramidale (SP) and a second pipette in the stratum radiatum (SR). This configuration allows for simultaneous recordings of the negative sharp-wave in the SR and the high-frequency ripple oscillation in the SP (Figure 3).\nUsing the micromanipulator slowly advance the tip of the LFP pipette into the region of interest (e.g., the CA1 pyramidal cell layer) at an angle of approximately 30–45°. Place the tip of the pipette at least 50–100 μm deep into the slice to avoid cells near the surface that were damaged during slicing. While advancing the LFP pipette, continually deliver a small voltage test pulse using the acquisition software and watch for a sudden increase in electrode resistance. This may indicate that the pipette has been clogged or pressed up against a cell.",
    "Once the LFP pipette is positioned in the region of interest, carefully release the positive pressure by opening the valve on the tubing attached to the pipette holder.\nTo record the LFP in a second location simultaneously, repeat steps 6.8–6.10 with a second pipette and micromanipulator.\nUse the microelectrode amplifier in the current clamp configuration to record spontaneous activity in the local field potential after using the bridge balance function in the acquisition software to correct for series resistance of the pipette. Spontaneous SWRs will appear as positive deflections in the extracellular potential of the SP layer (Figure 3).\nIn order to record evoked field potentials, use the stimulators connected to the digitizer to deliver a short (200 us) square voltage pulse through the NaCl-filled stimulation pipette. Adjust the stimulation voltage dial to evoke a range of response amplitudes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}