{
  "id": 8320,
  "origin_website": "Jove",
  "title": "Targeting the Corticospinal Tract in Neonatal Rats with a Double-Viral Vector using Combined Brain and Spine Surgery",
  "procedures": [
    "All of the following surgical and animal care procedures have been approved by the Animal Care and Use Committee of Temple University. The protocol described is a survival surgery, and the animals were eventually euthanized by intraperitoneal injection of 100 mg/kg sodium pentobarbital at the completion of their time points.\n1. Pre-surgical preparation\nPrepare at least two pulled glass needles for viral injection using 3.5 nL glass capillary pipettes; one needle for the DREADD and one needle for the rCre. As a precautionary measure, prepare 4-5 needles in case they break intraoperatively.\nUsing microscissors, cut off 1-2 mm of excess glass from the needle.\nFor each needle, position it at 30°, use a micropipette beveller to create a tip with a 30-40 µm aperture and a 45° beveled angle.\nStore the needles in a covered Petri dish and then sterilize them by placing the Petri dish in a biosafety hood under UV light for 15 min.\nPrepare the necessary viruses by removing a suitable volume from the -80 °C freezer before the procedure, bearing in mind that each animal will require 3 µL of each virus.\n\tNOTE: Transport and store the virus on ice when not in use. This protocol was developed using AAV2-hM3Dq-mCherry and AAV2-retroCre to inject 3 µL of each virus per animal. The DREADD plasmid, pAAV-hSyn-DIO-hM3Dq-mCherry (see the Table of Materials), was used to make the anterograde AAV2 with a viral titer of 1.54 × 1012 genome copies (GC)/mL. The Cre plasmid, pAAV-CMV-scCre, was used to make the retrograde AAV2 with a viral titer of 4.27 × 1012 GC/mL.\nPlug the injector into the micropump and place it in a micromanipulator with a Vernier scale.",
    "To help visually confirm the presence or absence of virus in the needle, load colored dye, i.e., red oil, into the needle. Avoid bubbles in the needle.\nInsert the glass needle into the injector, ensuring that the needle fits correctly.\nIf available, repeat the entire process with a separate injecting pump for each virus. If there is only one available injecting pump, prepare two separate needles and replace the used needle when it is time to swap the viruses.\n2. Anesthesia and surgical site preparation\nWeigh the animal on a digital scale. Record the preoperative weight to determine the volume of anesthetic required.\n\tNOTE: This protocol found that the most reliable anesthetic technique to ensure a satisfactory anesthetic plane throughout the operative time is a combination of ketamine and hypothermia. Ketamine is insufficient to ensure anesthesia on its own, and supplementing it with xylazine has a narrow threshold before increasing intraoperative mortality. Hypothermia on its own is not sufficient for prolonged surgeries (dual spine and brain surgery likely require >1 h of steady anesthesia).\nAnesthetize the pup by injecting diluted ketamine (10 mg/mL) subcutaneously between the shoulder blades so that the animal receives a 100 mg/kg dose of ketamine; wait for 5 min.\n\tNOTE: For example, at postnatal day 5, a rat pup weighs 10 g and receives 0.1 mL of the diluted ketamine solution (10 mg/mL).\nPlace the pup on crushed ice for 6-8 min. Protect it against frostbite by placing the animal in a latex glove or parafilm to avoid direct contact with ice.\nPinch the foot firmly using forceps to confirm an appropriate anesthetic plane. If reflexive withdrawal occurs, leave for an additional 2 min on ice before proceeding.",
    "Broadly apply antiseptic to the animal's head and back area using sterile gauze soaked with a 5% iodine solution. Then, sterilize with gauze soaked in 70% ethanol. Apply the antiseptic wipes three times each, alternating between iodine and ethanol to soak the gauze.\n\tNOTE: There is no need for eye care as young pups only open their eyes at 14 days of age.\nIf an animal is to receive dual surgery (brain + spine), provide a normal saline bolus before surgery (0.02 mL/g) subcutaneously between the shoulder blades.\n\t​NOTE: if the animal becomes responsive during the surgery and further anesthesia is required, then replace the animal onto ice for 5 min.\n3. Surgical field and instrument preparation\nAutoclave the surgical tools that include a scalpel holder, rongeurs, hemostats, medium point curved forceps, and retractors\nReady the microscope and install the neonatal rat stereotaxic adaptor to firmly position it within the adult stereotaxic holder.\nConduct the surgery using sterilized gloves. Open a pack of prepackaged sterile surgical gloves and place the sterile glove wrap on the table, using the wrapper as an additional area to place used tools.\n\tNOTE: It is important to follow good surgical practice and maintain sterility throughout the procedure.\nSecure a 11- blade in the scalpel holder. Position sterile saline, 4.0 chromic catgut suture, 4.0 silk suture, and materials to control bleeding, e.g., sterile gauze, sterile cotton-tipped applicators, and triangles.\nSet up two surgical fields as described above, with one site assigned for craniotomy and the other site assigned for cervical laminectomy.\nRetrieve the animal and secure it in the stereotaxic adaptor: as the neonates are very cartilaginous, fix them gently by directing the earbars broadly towards the mandibular joints. Once horizontally stabilized, gently introduce the front mouthpiece.",
    "​NOTE: A nonbinding rule used to provide a \"flat\" surgical area is to fix the earbars at the same height and the mouthpiece at approximately 2-3 levels lower.\n4. Performing the craniotomy and exposing the somatomotor cortex\nIdentify the area where the incision will be made by pressing the forceps in the midline on the top of the scalp, feeling for the sagittal suture. Make a 1 cm incision along the sagittal suture plane, starting immediately above the eyeline. Hold the skin taut to ensure a clean, straight, and precise incision.\nIdentify bregma (the convergence of the coronal and sagittal sutures) by gently probing the forceps along the surface of the skull and paying close attention to the suture lines as well as any indentation caused by the forceps running along the parietal and frontal bones.\nMaintain the opening with the application of weighted hooks on the side of interest. Note that the spinal injection is made on the right side, the cranial injection is on the left side.\nClear the aponeurosis with a combination of the cotton tips and microscissors to maximize the exposure of bregma for increased accuracy. Ensure that the coronal suture is in clear view far enough laterally to provide a rough template for subsequent injections.\nUsing the microscissors, cut out approximately a 3 x 2 mm section of the left frontal skull bone immediately adjacent to bregma.\n\tNOTE: Once the bone flap has been carefully removed, there should be a clear window with exposed brain matter ready for injection. The remaining suture lines on the contralateral side of the brain will act as a visual guide for maintaining accuracy along the anterior-posterior (AP) axis.\nClear up any debris, cerebrospinal fluid (CSF), and blood with cotton tips.",
    "NOTE: It is normal for blood or CSF to slightly obscure the visual line, so it is advisable to clear the area with cotton tips regularly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62698/62698fig3v3.jpg\nFigure 3: A schematic illustration of the cranial injection coordinates (mm) relative to bregma. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62698/62698fig3v2large.jpg]\n5. Loading the virus and positioning the injector\nLoad the virus into the injector by pipetting ~5 µL onto a piece of parafilm, and position the needle so that the tip is resting atop the droplet of the virus.\nEnsure that extra virus is loaded into the injector to ensure smooth injection. For example, when injecting a total of 3 µL (1 µL for each injection site), withdraw 4 µL of the virus at a rate of 250 nL/s using the micropump.\nRemove the excess virus with a laboratory wipe.\nPosition the micromanipulator so that the Vernier scale is visible, and position the needle above the sagittal suture.\nLower the needle to just above the area representing bregma (Figure 3), and note down the AP and medial-lateral (ML) coordinates.\nGiven that the injections will be on the left-side, generate target coordinates by subtracting 1, 1.5, and 2.0 mm (ML: -1.0, -1.5, -2.0) from the ML coordinates for bregma.\n\tNOTE: The AP position will be +0.5mm from bregma for all three injections.\nMove the needle into position for the first injection. AP: +0.5, ML: -1.0\nLower the needle to the exposed brain until it is indenting the outer cortex. Note down the height of the needle and bring the needle down into position by subtracting 0.6 mm from the height of the surface of the brain. Depth of injection: cortical surface -0.6 mm.",
    "NOTE: It is important to note the depth of the surface for each injection as slight disruptions to the rat's positioning may occur.\n6. Injecting virus into the somatomotor cortex\nOnce the needle is in place, program the injector to inject 1 µL at a rate of 250 nL/min.\nOnce the injection is completed, allow the needle to rest in the cortex for 3 min.\nRepeat the injections for the other coordinates: a total of 3 injections along the cortex in relation to bregma, all at a depth of -0.6 mm: 1) AP: +0.5 mm, ML: -1.0 mm 2) AP: +0.5 mm, ML: -1.5 mm 3) AP: +0.5 mm, ML: -2.0 mm.\nAfter completion of the injections, refer to section 9 to suture, and transfer the animal to the other operating table for cervical laminectomy.\n7. Creating a spinal window for precise spinal cord injections\nIdentify the incision site by using fingers to palpate the base of the skull. At midline, begin the incision 1-2 mm posterior to the skull base using a #11 blade and extend the incision 1 cm posterior to expose the superficial muscle. Hold the skin taut by applying tension with the thumb and index finger to ensure a clean incision.\nUsing the sharp point of the blade, gently make a series of cuts along the midline of the superficial muscle to expose the spinal cavity and deep spinal muscles. Use a pair of forceps to spread open the muscle and visualize the surgical window.\n\tNOTE: The superficial muscle will appear light pink, while the deep spinal muscles will appear a light whitish-grey.",
    "Once the deep spinal muscles have been exposed, insert retractors into the surgical window. If necessary, use forceps to grab onto the lateral skin and muscles to stretch them around the teeth of the retractors. Retract the surgical window to 7-8 mm in width, allowing an unobstructed view of the spine.\nIdentify the second cervical (C2 or axis) vertebra by its prominent spinous process that projects dorsally and encapsulation in a large dome-shaped muscle. Use forceps or a blunt probe to feel for and identify this process, as this will be the guiding landmark.\n\tNOTE: The adjacent C3 vertebra is often slightly occluded by the large C2 muscle; therefore, gentle dissection of muscle at C3 with forceps or a bone scraper helps to define the vertebra and aid in vertebral counting.\nUsing the flat edge of a bone scraper, expose C3-C7 vertebrae by gently scraping away the deep spinal muscle to the sides. Start medial and scrape laterally along the direction parallel to the vertebral laminae to ensure proper exposure, which will allow clear distinction of vertebral laminae. Control any bleeding with cotton tips.\nUsing a pair of microscissors, carefully cut the lateral edges of the cartilaginous laminae at C6 and C7. Use C2 as a guide when counting vertebral levels.\nUsing a pair of fine forceps, carefully remove the dissected portion of the lamina to expose the spinal cord. Make sure the spinal window is large enough to accommodate the desired injection site. Remove any sharp or jagged parts of bone that may puncture the spinal cord with microscissors and forceps as described above.\nSet the animal up in the stereotaxic cranial holder as described in section 3.6. In addition, place a rolled-up piece of gauze under the animal's trunk to elevate its hindquarters.",
    "NOTE: Elevation of the animal's hindquarters effectively lifts the thorax off the surface of the holder to prevent respiratory movements from affecting the position of the needle during injection.\nBefore beginning injections, clear the spinal window of any blood or cerebrospinal fluid by gently applying cotton tips and Sugi triangles to the area without insulting the spinal cord. Further, create a barrier around the perimeter of the window to prevent occlusion of the injection site by continuous bleeding or CSF leakage. To do this, place a small piece of absorbable cotton in the lateral portions of the spinal window.\n8. Direct injections into the spinal cord targeting axon terminals\nUsing the tip of the glass injection needle, approximate the midline of the spinal cord by identifying the spinal artery. However, if the spinal artery is noticeably off-center or deviates in any way, approximate the midline by using the position of the C2 spinous process and extrapolating this down the length of the spine.\n\tNOTE: Refer to section 5.1 for instructions on loading the virus.\nOnce identified, situate the needle just posterior to the C5 lamina at the approximate midline and use this as the reference point. Then, using the micromanipulator, move the needle laterally to the right by 0.3 mm. Lower the needle until it just touches the surface of the spinal cord; from this depth, plunge the needle 0.6 mm into the spinal cord. If necessary, continue to plunge the needle until it punctures the spinal cord; then, retract or lower the needle to the appropriate depth.",
    "Inject 1 µL of retroAAV2-scCre at 250 nL/min. After the injection is complete, wait 2 min for the virus to diffuse into the spinal cord before slowly withdrawing the needle. Repeat the injections using the same lateral and depth coordinates at two more sites within the spinal window, one at the midpoint and the final just anterior to the T1 lamina.\n9. Wound closure and postoperative care\nRemove the animal from the stereotaxic holder and take out the retractors or hooks. Clear out the wound area with a few drops of sterile normal saline.\nSuture the scalp with 4.0 silk suture, two or 3 sutures in total.\nWhen suturing the cervical opening, use 4.0 chromic gut to tightly reattach the muscle layers (2 sutures should suffice). Suture the cervical skin opening with 4.0 silk (4 sutures expected).\nOnce the animal is closed up, judiciously apply liquid bandage across the sutures.\nPlace the animal under a heating lamp and monitor it closely until entirely re-awakened. Once the animal is awake, moving, and dry, gently clean the wounds with sterile gauze. Do not leave the animal unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nReturn the animal to the homecage with its mother. Take care to prevent neglect and infant cannibalization from the mother towards the pups:\n\t\nFamiliarize the investigators with the mother in anticipation of surgery through gentle handling (5-10 min) twice daily, beginning one week before surgery.\nReturn the pups to the homecage together to limit disruption to the mother.\nInject the mother with acepromazine 1.5 mg/kg q12 h subcutaneously on the day of surgery.\n\t\tNOTE: Pain management serves the dual purpose of providing analgesia for the pups and encouraging earlier return to activity, thus promoting reintegration with the mother.",
    "Inject buprenorphine 0.05 mg/kg subcutaneously q8 h starting after surgery for 3 days total (postoperative days 0, 1, 2).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}