{
  "id": 4917,
  "origin_website": "Bio",
  "title": "Neurite Outgrowth Assay",
  "procedures": [
    "Prepping coverslipsPlace 12 mm glass coverslips in a 24-well plate (1 coverslip per well).Coat the coverslips with poly-l-lysine (0.1 mg/ml; PLL) either overnight at room temperature or for 2 h at 37 °C.Remove PLL from the coverslips in the wells.Add ddH2O to each well to wash the coverslips.Remove ddH2O using a pipette or suction. Do not allow the coverslips to dry completely. Upon removing ddH2O from the coverslips, immediately move to the next step.Bath coverslips in laminin (5 μg/ml) in HBSS-CMF and incubate at 37 °C for 2 h before plating cells.Notes:This concentration of laminin can be varied to enhance or reduce outgrowth potential. While dissociated adult DRG neurons grow well at this concentration, longer outgrowth can be obtained with higher laminin concentrations, whereas growing neurons on lower laminin concentrations will provide a more challenging substrate for outgrowth.Laminin should remain on coverslips until cells are ready to plate. There is no need to wash the coverslips once the laminin is removed.Neurons may be plated directly on laminin-coated coverslips, or plated on a monolayer of cells to examine the effects of neurite outgrowth on a cellular substrate. Plating a monolayer of cellsA monolayer of cells can be created by densely plating a cell type of interest (astrocytes, stem cells, etc.) onto the coverslip after the laminin-coating has occurred. To create a monolayer, concentrate 60,000 cells/60 μl of media. (This concentration can be greater or less depending on the rate of cell division for a particular cellular population.)Remove laminin from the coverslips (step A6).Place the entire 60 μl drop of cells into the center of the coverslip and allow the plate to remain untouched at RT for 30 min. This will allow the cells some time to adhere to the coverslip.",
    "After the 30 min incubation, gently add an additional 1 ml of media down the side of the well so to minimize the dispersal or disruption of the cell solution in the center of the slip. Allow the cells to incubate overnight at 37 °C before adding DRG neurons.Dissociating DRG neuronsRemove all DRGs from an adult mouse or rat.Trim the central and peripheral roots.Place DRGs into a 1.5 ml microcentrifuge tube containing collagenase II (200 U/ml) and dispase II (2.5 U/ml) in HBSS-CMF. Dispase/collagenase helps to digest the dura surrounding the ganglia, allowing the cell bodies to fully dissociate from one another.Incubate for 1 h at 37 °C.Remove DRGs from the incubator and centrifuge the sample for 2 min, 5,600 RPM.Gently remove supernatant and discard. Be careful not to disturb the pellet containing the cells.Add fresh CMF solution (~1 ml) to the microcentrifuge tube containing the pellet, gently triturate, then centrifuge for 2 min, 5,600 RPM.Repeat steps B6-7 two more times (3 total washes).After the third wash, resuspend the dissociated neurons in 1 ml of Neurobasal-A media supplemented with B-27, GlutaMAX, and penicillin-streptomycin.Note: Once the cells have been dissociated (step B3), it is important to complete the subsequent steps in a timely fashion (it should take approximately 20 min) to minimize neuronal death during the washes. If necessary, keep the cells on ice during this process.Using a hemocytometer, count the number of neuronal cell bodies present in the sample.Plate neurons on coverslips at a concentration of 1,500-2,000 neurons per coverslip (in 1 ml Neurobasal-A per coverslip).Note: Neurons can be plated on laminin-coated coverslips 2 h after coating them. Typically adding laminin just before beginning the DRG isolation and dissociation will allow plenty of time for the substrate to adhere to the coverslip.Incubate at 37 °C for 24 h.",
    "Plating cells for neurite outgrowth24 h after DRG plating, remove the media from the wells.Add ~500 ml 4% PFA for 30 min at room temperature.Remove PFA.Wash 3 x 10 min with 1x PBS.Block coverslips overnight at 4 °C.Stain cultures with β-III tubulin (1:500 in block + triton) overnight at 4 °C or 2 h at room temperature. Wash cultures 3 times for 10 min each with 1x PBS. Stain with the appropriate secondary antibody overnight at 4 °C or 2 h at room temperature. Mount coverslips onto slides. To mount coverslips, use a pair of size 3 jeweler’s forceps to carefully lift the coverslip up the side of the well. Be sure to keep track of which side of the coverslip contains the cells.Carefully grab the edge of the coverslip with the forceps. Be careful not to grab the center of the coverslip or you will scrape off the cells.Flip the coverslip to be side down and set the coverslip onto the slide. Seal the edge of the coverslip with clear nail polish and allow the slides to dry.Image all neurons with processes.Measuring neurite outgrowthUsing MetaMorph software, measure the longest neurite per neuron. This can be done using either the traced line or multi-line tool.Open MetaMorph software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103173011_0132.jpgFigure 1. Open screenTo measure a neurite, open “Region Measurements.”imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103173052_9929.jpgFigure 2. Region measurements croppedThe “Region Measurement” window should open. Select “active region” to see the length of the most recent neurite measured.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103173403_5160.jpgFigure 3. Active regionGo to “Measure.” Click “Calibrate Distances.” imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103173910_2750.jpgFigure 4. Calibrate distanceNote: Distance may need to be calibrated based on the scope and magnification used to image the neurons. A calibration must be established for each objective used. These calibrations will vary based on scope. Therefore, for every scope and every objective, a calibration must be determined and added to the list.",
    "Select the calibration that corresponds to the appropriate microscope and objective used to image the neuron being measured.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174136_2912.jpgFigure 5. Calibrate distances screenOpen the image to be measured.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174442_3059.jpgFigure 6. Image openedUsing either the traced or multi-line tool, trace a process, beginning near the cell body, extending to the tip of the process. Processes often branch, so be sure to follow the appropriate path (the longest process).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174507_7496.jpgFigure 7. Traced toolimgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174529_8548.jpgFigure 8. Multi-line toolOnce the entire process is traced, double click. This will display the “region measurement” or the length of the neurite that has just been traced. It will be displayed both on the image, as well as on the region measurements window.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174550_1817.jpgFigure 9. Begin clickingBe sure “Active Region Measurements” is displayed in the “Region Measurements” window to see the measurement of the most recently measured neurite.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174633_7057.jpgFigure 10. Active regionimgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103174702_6750.jpgFigure 11. Finish measurement"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}