{
  "id": 13190,
  "origin_website": "Jove",
  "title": "Whole Animal Imaging of Drosophila melanogaster using Microcomputed Tomography",
  "procedures": [
    "1. Sample selection and cuticle preparation\nChoose the appropriate developmental timepoint (embryo, larva, pupa, or adult) for imaging.\n\t\nFor embryonic stages, cage females on grape juice agar plates smeared with yeast paste and collect eggs every 30-60 min. Leave these embryos to develop at 25 °C until the proper stage is reached.\nFor larval stages, collect first and second instars from timed embryo collection experiments. Directly pick wandering 3rd instars from the side of the food vial under non-crowding conditions.\nFor pupal timing, collect white pre-pupae (inverted spiracles) and make note of the time when the cuticle starts to brown. Animals will progress through 15 stages of pupal development at defined timepoints following cuticle browning and can be collected accordingly42.\nCollect adults as virgins following eclosion and allow to age in a food vial for a required amount of time (e.g., 5 days for complete gut development).\nTransfer 5-50 animals to a 1.5 mL microcentrifuge tube containing 1 mL of 0.5% Triton X-100 in 1x Phosphate Buffered Saline (0.5% PBST). While tapping the tube periodically on the benchtop, incubate for 5 min at room temperature (RT) to assist in the removal of the hydrophobic coating and allow animals to become fully submerged.\n\t\nFor embryonic, larval, and pupal stages, arrest further development by placing the tube in a heat block set to 100 °C for 20 s followed by cooling at RT for 5 min.\n\t\tNOTE: Animals can also be flash frozen in liquid nitrogen37.\n2. Fixation and staining\nRemove 0.5% PBST and add 1 mL of Bouin’s Solution. Tap tube to ensure animals are fully submerged.\n\tCAUTION: Bouin’s Solution contains formaldehyde. It may cause acute toxicity to skin and eyes if spilled and can be fatal if swallowed. Wear gloves, safety glasses and a lab coat when handling.",
    "NOTE: Additional fixation techniques can also be employed, such as the use of ethanol. The merits of other fixatives are described in detail in ref.1,30.\n\t\nFor embryo and adult samples, incubate on the benchtop for 16-20 h at RT.\nFor larval and pupal samples, fix animals for 2 h at RT. Discard Bouin’s solution and wash with 1x PBS for 5 min thrice. Transfer to a multi-well dissecting dish containing 1x PBS and use a small minutien pin attached to a holder to poke a hole in the anterior and posterior cuticle being careful to not disrupt any underlying soft tissue.\nTransfer larval and pupal samples back to a microfuge tube and add 1 mL of fresh Bouin’s solution. Incubate on benchtop for 24 h at RT.\nRemove Bouin’s Solution and wash sample for 30 min with 1 mL of μ-CT Wash Buffer (0.1 M Na2HPO4, 1.8% Sucrose) or 1x PBS thrice.\nAdd 1 mL of the appropriate staining solution and incubate on benchtop for 2-7 days.\n\tNOTE: Stain choice will depend on many factors, but is generally a balance between penetration, incubation time, and resolution. In general, phosphotungstic acid (PTA) provides superior contrast and resolution of soft tissue but requires mechanical disruption of the cuticle and longer incubation times. The merits of different stain types are described in detail in ref.1.\n\t\nFor iodine staining, use 1 mL of 0.1 N I2KI (Lugol Solution). Incubate for 2 days. No further disruption of the adult cuticle is necessary.",
    "For phosphotungstic acid (PTA) staining, use 1 mL of a 0.5% (w/v) solution diluted in water. Disrupt the adult cuticle, either by removing the mouthparts or poking holes in the thorax or abdominal cuticle with a small minutien pin attached to a holder. Incubate for 5-7 days, or longer if tissue staining appears non-homogenous.\nWash with 1 mL of ultrapure water or 1x PBS for 30 min. Repeat wash step. Store animals at RT in ultrapure water or 1x PBS for up to one month.\nIf animals are to be scanned while hydrated, proceed directly to section 4. If longer preservation of the sample is needed, proceed to section 3 of the protocol.\n3. Critical point drying (Optional)\nPerform an ethanol (EtOH) dehydration series on the sample: 10%, 25%, 50%, 75%, 100%, 100%. Add 1 mL of the EtOH solution and incubate on the benchtop for 1 h for each concentration in the order stated.\nAfter the final 100% EtOH soak, replace with fresh 100% EtOH and let sample incubate on the benchtop overnight.\nPerform critical point drying of samples following the manufacturer’s instructions.\n\tNOTE: Electron microscopy facilities generally have a critical point drying machine (see Table of Materials) that will perform the drying of the sample following EtOH dehydration.\n4. Sample mounting\nFor critically point dried samples, hot glue samples to an insect pin or other holder designed to fit within the chuck of the rotating stage or place it in a plastic or glass capillary tube (~1.0-1.25 mm inner diameter).\nFor hydrated samples, fill a P10 pipette tip with water and secure the narrow end by either heat sealing or paraffin film to prevent leakage.\n\tCAUTION: Be sure to wrap any connections tightly so that water does not leak into the scanner and cause damage.",
    "Transfer a single specimen to the pipette tip using forceps. Using a long, slender object, such as a dulled 20 G needle or another pipette tip, carefully push the specimen down the tip until it just contacts the wall of the pipet tip to hold it in place.\nCover the opening of the pipette tip with paraffin film to prevent evaporation of water during long scans.\nMount the P10 pipette using a holder designed to fit within the chuck of the rotating stage (Figure 1A-C).\n5. Scanning\nPerform any necessary calibrations of the machine prior to imaging for the day.\n\tNOTE: These will vary by manufacturer and it is recommended to consult with an application specialist to determine the proper steps. Please see the Table of Materials for specific information on the setup and software used in this protocol. Generally, calibrations such as a stage axis alignment to remove any ‘wobble’ associated with the chuck being off-axis relative to the rotating stage and performing flat-field corrections to ensure uniform background pixel intensities on the camera provide optimal imaging conditions for the best resolution and datasets that are comparable across multiple scans.\nOpen the scanner door to gain access to the rotating stage chuck by clicking on the ‘Open Door’ icon in the upper left corner of the software. Attach the sample by tightening the collar around the base of the sample holder.\n\tNOTE: Use gentle pressure when attaching the sample to the rotating chuck to maintain scanner alignment.\nSet scanning parameters in the software controlling the scanner for optimal resolution and contrast.",
    "NOTE: These will need to be determined empirically as the X-ray source, camera/detector, and geometry of each scanner will vary by manufacturer. Additional information for selecting the best parameters can also be found here43, as well as from the manufacturer’s application specialist.\n\t\nOpen the X-Ray source power control (Options | X-ray Source). Use the slider bars to set X-ray voltage to 30-40 kV and current to 100-110 μA to produce an X-ray beam with 3-4W of power and a small spot size for enhanced resolution.\nUse the Acquisition Modes dialog (Options | Acquisition Modes) to set camera exposure time to 500-800 ms.\nUse the slider bar located next to the magnifying glass icon at the bottom of the software to set the desired image pixel size (~700 nm to 4 μm), depending on camera settings and position. This determines the number of projection images that are acquired during the scan, with more projections leading to enhanced resolution but longer scan times (see Representative Results).\nClick and drag the slider bar located next to the rotating arrow at the bottom of the software to move the sample along its 360˚ rotation path. Ensure that the sample stays within the field of view.\nClick on the ‘Start Acquisition’ icon (blue circle arrow icon) at the top of the software. A dialog box appears that allows additional scanning parameters to be set, and the file and output folder where the scan will be saved to be named.\n\t\nSet the random movement to 10 and average 4-6 frames. The rotation step is automatically calculated depending on the camera settings used.",
    "Begin scan by clicking ‘OK’ on the Acquisition dialog box. A second progress bar dialog appears that shows the scan time. The scanner will now acquire a series of projection images (Figure 1D) of the specimen along the rotation path and does not need to be monitored.\n6. Reconstruction\nTo generate the tomograms, perform image reconstruction using the projection images.\n\tNOTE: While almost all reconstruction of images from cone beam geometry scanners rely on the Feldkamp algorithm16, individual parameters will vary depending on the software implementation and should be determined empirically. The following settings, specific for a commercially available software (see Table of Materials) can be used as a guide. Parameters such as misalignment compensation, ring artifact reduction, and beam hardening correction (0% for most fly samples) are performed in an iterative fashion to choose the best values for the final reconstruction. For advanced users who would like more control over the reconstruction process, see the MATLAB interface here44.\nPerform an initial image alignment by utilizing a shift-correction algorithm based on reference scans45 (Actions | X/Y alignment with a reference scan).\nFine tune each reconstruction parameter (Start | Fine tuning). This activates a ‘Parameter fine-tuning’ dialog box.\n\t\nFine tune the alignment by clicking ‘Next’ to ‘Post-Alignment’. Set the number of iterations to five and the parameter step to 1.0. Click the Start button to generate a series of previews. Select the image that is properly aligned.\n\t\tNOTE: A properly aligned image will not be blurry or display ‘shearing’ artifacts where an otherwise continuous structure (such as the cuticle) appears split.",
    "Fine tune the ring artifact reduction by clicking next to it. Set the number of iterations to five and the parameter step to 1.0. Click the Start button to generate a series of previews. Select the image that contains the fewest number of rings.\nOnce the above parameters have been optimized to give the best image, ensure that the selected values are properly represented in the Settings tab (Settings).\nAdjust any final brightness and contrast values using the histogram, file parameters such as bit depth and type, and utilize a Region of Interest (ROI) encompassing only the structures of interest (e.g., whole fly or head only) to reduce computational time (Output).\nBegin the reconstruction (Start | Start). If multiple reconstructions are required, add the current image to the batch manager (Start | Add to batch) and repeat steps 6.2-6.5 for the remaining images.\n7. Image analysis\nVisualize tomograms in two and three dimensions and perform further morphometric analysis with freeware or commercial software.\n\tNOTE: Details of the software used in this protocol is available in the Table of Materials. Other software packages that are capable of evaluating µ-CT datasets include freeware options such as FIJI46, Seg3D (www.seg3D.org)47, and ITK-SNAP48, plus commercial software (e.g., AMIRA). Other applications that employ machine-learning based algorithms to semi-automate the segmentation process can help speed workflows and reduce human bias (e.g., Biomedisa49).\nImport the tomogram file into the software (File | Import Image Files). The metadata associated with the file should automatically load into the window but can also be set manually to match the image properties.\nTo segment a structure of interest, click on the Segment tab on the left-hand side of the screen. Create a new Region of Interest (ROI) (Basic | New), give it a name and select an appropriate color.",
    "Define the threshold range that encompasses the structure of interest (Range | Define Range) using the slider bar.\nSelect an appropriate 2D or 3D ROI painter tool mode (ROI Painter | Paintbrush option).\nTo paint an area defined by the threshold; press and hold the Ctrl key while holding the left mouse key. To remove an area, press and hold the Shift key while holding the left mouse key.\n\tNOTE: To change the size of circular or square paintbrush, simply scroll the mouse wheel while holding either the Ctrl or Shift keys.\nContinue to paint the structure of interest throughout its entire Z-volume.\nConvert the ROI into a Mesh (Export | To a Mesh | Normal).\nHighlight the mesh overlay by clicking on it in the Data Properties and Settings panel in the upper right-hand corner.\nSmooth the mesh using an appropriate number of iterations (Smooth Mesh | Iterations).\n\tNOTE: Use the same mesh smoothing iteration value for all images that are to be compared.\nEnsure that the measurements of the mesh ROI (Surface Area, Volume and Feret Diameter) are displayed in the Information panel on the right-hand side of the screen for basic morphometric analysis. Additional analysis can be performed using the Object Analysis Module.\nRender the mesh object and the entire tomogram image and visualize in 3D. Use the built-in Movie Maker to generate a video of the object (Right Mouse Click | Show Movie Maker) using individual frames from the viewer (Add Key).\n\tNOTE: Several visual enhancements can also be applied to the movie using the visual effects tab in the right-hand panel to highlight certain features, etc.\nExport the video for viewing using the Export Animation button in the Movie Maker."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}