{
  "id": 17519,
  "origin_website": "Jove",
  "title": "Laparoscopic Repair of Para-Esophageal Hernia Using Absorbable Biosynthetic Mesh",
  "procedures": [
    "The protocol follows the guidelines of the authors’ institution’s human research ethics committee (South-Western Health District).\n1. Pre-operative preparation\nPlace the patient on low calorie high protein nutritional diet for a week to reduce the liver size and facilitate improved access to the hiatus hernia.\nUnder general anesthesia, place the patient in lithotomy and reverse Trendelenburg position.\nIntra-operatively, prescribe first-generation cephalosporin prophylactic (2 g) intravenous antibiotic and anticoagulation for deep vein thrombosis prophylaxis.\n2. Surgery\nPrepare the sterile field by shaving the patient’s abdomen, applying antiseptic solution to the skin and draping the patient. Ensure that the first surgeon stands between the patient’s legs and the assistant is on the left side.\nEstablish Pneumoperitoneum of 12 mm Hg via a left subcostal Veress needle at Palmer’s point9 (3 cm below the subcostal margin in the left mid-clavicular line). Using a direct bladeless optical access entry system, insert the ports which is supra-umbilical, one hand-span from the costal margin and to the left of the midline, for the camera.\nElevate the left lobe of the liver with a Nathanson liver retractor through a small left para-xiphoid incision.\nPlace two further 5 mm ports under direct vision alongside the camera port: one at the level of the right mid-clavicular line, the second port on the left anterior axillary line. Insert a 10 mm port that is more cephalad at the left mid-clavicular line to create an ideal working triangulation.\n\tNOTE: See Supplementary Figure 1 for port placement.\nAt this stage ensure that most of the stomach will be herniating into the mediastinum. Therefore, pull the incarcerated stomach back into the abdominal cavity with continuous traction from the assistant to view the gastro-esophageal junction.",
    "Enter the lesser curvature at the level of the pars flaccida of the gastrohepatic ligament, and progressively dissect, reduce and excise the hernia sac using cauterization. This will lead to the gradual exposure of both diaphragmatic crura. This is made of the inferior vena cava and the caudate lobe of the liver in relation to the right crus.\nMobilize the esophagus circumferentially by dividing all the congenital peri-esophageal adhesions within the hiatus. Continue mobilizing the hiatus hernia off the bilateral crura to assist in retracting the hernia sac into the abdominal cavity. Identify and preserve the vagus nerves and both pleurae.\nCreate a window posteriorly between the esophagus and thoracic aorta and place a tape around the distal esophagus to allow gentle traction.\nMobilize the distal esophagus proximally (≥10 cm distance), until there is adequate intra-abdominal esophageal length (3-4 cm) and so the esophagus lies free of tension.\nApproximate the diaphragmatic crura with 3 or 4 interrupted 1.0 non-absorbable braided sutures and reinforce the repair with a pre-shaped biosynthetic mesh that is introduced behind the esophagus in an onlay fashion.\n\tNOTE: The right edge of the mesh should slide under the caudate lobe of the liver. If necessary, divide the left triangular ligament to accommodate the mesh. No pledgets are required if the quality and the tension of the crura is adequate. The extent of the crural closure should not cause narrowing or compression on the lower esophagus. A rough guide to adequate closure is being able to pass a grasper through the remaining gap.\nSecure the biosynthetic mesh with 4 mL of fibrin glue.",
    "Perform a modified 180˚ anterior Dor fundoplication using 2.0 non-absorbable braided sutures by suturing the gastric fundus to the left crus, then sequentially fixing the folded greater curvature of the stomach anteriorly to the diaphragm, and all the way to the proximal right crus. Four sutures are usually required. Incorporate the mesh into the first suture. Take care not to injure the pericardium during the fundoplication. A bougie is not used.\nInsert a closed-suction drain.\nClose skin with subcuticular 3.0 synthetic, absorbable and monofilament sutures.\n3. Post-operative procedures\nPost-operatively, elevate the patient’s head to 30˚ to avoid aspiration.\nPerform early chest X-ray in recovery to exclude possible pneumothorax or atelectasis.\nCommence the patient on clear fluids on day one. Give regular anti-emetics for the first 24 h. Commence the patient on daily anticoagulation for deep vein thrombosis (DVT) prevention as per the hospital protocol.\nCommence the patient on puree diet on day two. Remove the drain after 24 to 48 hours.\nContinue puree diet for two weeks. Afterwards, place the patient on to a more solid but soft diet for three weeks.\nContinue DVT prophylaxis until the patient goes home. Extended course can be given at the surgeon’s discretion if deemed necessary.\nFollow-up the patient at 2 and 6 weeks for routine surgical review.\nPerform repeat gastroscopy at 4,12 and 24-months post-operative.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}