{
  "id": 10959,
  "origin_website": "Jove",
  "title": "Production and Targeting of Monovalent Quantum Dots",
  "procedures": [
    "1. Production of Monovalent Quantum Dots\nPhase transfer of QDs from organic to aqueous phase\n\t\nDilute 200 µl of a 1 µM solution of organic phase QDs with 400 µl of chloroform in a 5 ml glass vial.\nMix 400 µl of a 0.3 M tetrabutylammonium bromide (TBAB) chloroform solution with 36 µl of neat mPEG thiol (CH3O(CH2CH2O)6C2H5SH) and shake O/N.\nAdd 800 µl of a 0.2 M NaOH aqueous solution and shake for 30 sec. A phase transfer occurs within a few minutes, indicated by the transfer of the colored particles to the aqueous phase above the denser organic phase.\nIf the particles aggregate in a third phase between the aqueous and organic phases, increase the incubation time with the mPEG thiol. If the aqueous phase remains clear, the QDs did not phase transfer (see Figure 3A). Alternately, increase the concentration of mPEG thiol in step 2 to alleviate poor phase transfer.\nRecover the (colored) aqueous phase and then concentrate the collected QDs with a Centricon spin column (30 kDa molecular weight cut-off) to 1 ml.\nAdd the concentrated QD solution into a Sephadex NAP10 column pre-equilibrated with 10 mM Tris buffer containing 30 mM NaCl (pH 8.0). Elute the QDs with 1.5 ml of elution buffer by gravity flow.\nMeasure the concentration of QDs with absorption spectroscopy at 350 nm.\nPreparation of mQDs\n\t\nPurchase (or synthesize) ptDNA. This protocol uses the sequence 5’-AS50(CT)10(ACTG)5 -3’ (see Table 1).\ntable:\n﻿0,1\nDNA,Sequence\n5’-AS50(CT)10(ACTG)5-3',ASASASASASASASASASASASASASASASAS  ASASASASASASASAS ASASASASASASASASAS  ASASASASASASASASASASASASASASASASAS  CTCTCTCTCTCTCTCTCTCTACTGACTGACTGACTGACTG\n5’-NH2-(CT)10(CAGT)5-3',NH2-/C6spacer/ CTCTCTCTCTCTCTCTCTCTCAGTCAGTCAGTCAGTCAGT\nBG-DNA,BG-/C6spacer/ CTCTCTCTCTCTCTCTCTCTCAGTCAGTCAGTCAGTCAGT\nTable 1. DNA sequences used to produce and target mQDs.\nPrepare 1 ml of 100 nM QD solution in 10 mM Tris buffer containing 30 mM NaCl (pH 8).",
    "Add drop wise 500 µl of the 100 nM ptDNA solution to the aqueous QDs for 1 min while vigorously stirring. Stir or place on a shaker for an additional 9 hr.\n\tNote: This should theoretically produce a 1:2 ratio of ptDNA:QD. However, the actual stoichiometry is never perfect — usually the result is closer to 1:1.5. In order to produce a 1:1 ratio of ptDNA:QD, densitometry after gel electrophoresis is necessary to quantify the exact ratio of conjugation given the known volumes used above.\nRemove ~10 µl of the QD mixture to run on an analytical agarose gel. Also remove a similar concentration of unconjugated QDs in aqueous phase (from step 1.2.1).\n\t\nAdd ~2 µl of 6x Ficoll loading buffer (to increase solution density) and run these two samples together on a 0.8% wt/v agarose gel in sodium borate buffer for 15 min at 150 V. A single band in the unconjugated control lane migrating close to the well, and two bands in the lane with conjugated QDs are seen (see gels in Figure 2B).\nCalculate the unconjugated QD fraction using the relative intensity of the two bands (see the equation in Figure 2B). Then use that fraction to calculate the additional volume of 100 nM ptDNA solution required to match the number of QDs.\nRepeat steps 1.2.3 to 1.2.5 once more with this calculated volume or until the conjugated QDs collapse into a single band on the gel indicating complete conjugation of all QDs.\nAdd 100 µl of 10 mM (CO2H)CH2O(CH2CH2O)6C11H23SH (carboxy PEG6 alkane thiol) in 10 mM Tris buffer containing 30 mM NaCl (pH 8) to the conjugated mQDs produced above, and shake for 10 min.",
    "Note: These PEG ligands passivate the QD surface. A longer PEG will better-passivate the QDs, however, it will also increase their size. The hydrophobic alkane thiol functionality has a much higher affinity for the QDs, in aggregate, than the less hydrophobic PEG-thiol used for phase transfer. Therefore, do not allow this step to proceed too long or the ptDNA will be replaced by the alkane-PEG-thiol. After a ~30 min incubation, a significant fraction of DNA will have been displaced from the QDs (Figure 3B).\nTo remove excess alkane PEG-thiol, add 0.5 ml of the QD solution to a sephadex NAP5 column pre-equilibrated with elution buffer (10 mM Tris buffer containing 30 mM NaCl). Collect the mQDs with 1.0 ml of elution buffer by gravity flow.\nConcentrate the collected QDs with a Centricon spin column (30 kDa). Store these mQDs at 4 °C for months. Do not freeze them.\n\tNote: If a colored pellet in the bottom of the tube is seen, the dots have aggregated and are likely no longer useable.\n2. Production of Targeting (Benzylguanine-) DNA\nProduce or purchase amine-terminated DNA. This protocol uses the sequence 5’-NH2-(CT)10-(CAGT)5-3’ (see Table 1). The poly-CT linker increases accessibility to functionality buried deep in the glycocalyx but may not be needed for all applications. If there is access to a DNA synthesizer, produce amino-modified DNA using an appropriate 5’ amino-modifier (5’ amino-modifier C6).\nDissolve BG-N-hydroxysuccinimide (BG-NHS) in dry dimethyl sulfoxide (DMSO) at a concentration of 10 mg/ml.",
    "Note: BG-NHS will absorb water from the air and lead to hydrolysis of the reactive NHS-ester, particularly in hydroscopic solvents like DMSO and dimethylformamide (DMF). BG-NHS is best stored at -80 °C as a powder in its own vial within a secondary container containing desiccant. Warm to RT before opening the vial. Alternately, immediately aliquot for single use the BG-NHS ester into a dry polar solvent and freeze at -80 °C, or react fully with the amine DNA in step 2.2.\nReact by mixing the BG-NHS in DMSO from step 2.1 with amine-terminated DNA in HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid) buffered (pH 8.5) water. In a typical react 20 µl of 10 mg/ml BG-NHS in DMSO with 2 µl of 2 mM NH2-(CT)10-(CAGT)5 in 58 µl deionized water buffered with 20 µl 0.5 M HEPES pH 8.5. Carry out reactions in a 1.5 ml microcentrifuge tube. Mix quickly as the reaction proceeds rapidly and must compete with NHS-ester hydrolysis.\nSonicate for 5–10 min to ensure thorough mixing. Incubate ~1 hr at RT. The stoichiometric ratio of BG:DNA can be altered to drive the reaction to completion.\nDesalt the reaction using a standard NAP5 column into 100 mM triethylamine acetate (TEAA, pH 7).\nPurify the BG-DNA from the unreacted amine-DNA by reversed-phase HPLC running a 100 mM TEAA:acetonitrile (ACN) gradient between 8% and 95% acetonitrile over 30 min. The unreacted amine-DNA will elute before the BG-DNA. Collect the BG-DNA fraction in a conical tube.\n\t\nUse a C18 Zorbax column for standard oligonucleotide purification and the following gradient:\n\t\t0→15 min: 8→30% ACN;\n\t\t15→21 min: 30–90% ACN;\n\t\t21→25 min: 90→8% ACN;\n\t\t25→30 min: 8% ACN;",
    "Freeze in liquid nitrogen and lyophilize the collected fraction. Resuspend the DNA in deionized water. To be extra careful, lyophilize two more times to remove residual TEAA. Residual TEAA can be toxic to cells at higher concentrations.\nResuspend the lyophilized BG-DNA in water, making sure to wash the sides of the tube, and dilute to ~25 µM stock. Aliquot and store at 4 °C. Samples were stored for ~9 months without noticeable degradation.\n3. Labeling Live Cells with Monovalent Quantum Dots\nOptionally, passivate the mQDs just prior to an imaging experiment using reagents such as casein (0.5%) or bovine serum albumin (BSA, 1–3%).\nPlate cells expressing the SNAP-tagged protein on total internal reflection fluorescence (TIRF)-quality glass. In this experiment, we use a U2OS cell line expressing a SNAP-tagged Notch1 receptor and high quality glass surfaces.\nAfter the cells have attached to the glass (~24 hr), remove growth media, wash with PBS, and incubate the cells for 10–30 min at RT in ~100–150 µl of PBS or cell media containing ~1 µM BG-DNA from step 2.6 above.\nAfter incubation with BG, carefully wash the cells with PBS or cell media. Incubate the cells for ~5–10 min with the mQDs produced in step 1.2.9 (and optionally passivated in step 3.1).\nOptionally, wash the unbound mQDs and return the cells to a buffer/media suitable for both imaging and culture. For cells that were to be imaged in TIRF mode, a final wash step was often unnecessary as unbound mQDs in solution diffused so rapidly compared with bound mQDs as to be undetectable during analysis.\n4. Microscopy & Analysis\nImage the cells using a TIRF microscope.",
    "Note: The scope must have separable excitation and emission filters, or a custom QD filter cube. QDs are best excited with a low-wavelength laser (405 or 488 nm). QDs of different diameter have characteristic emission wavelengths, typically associated with a large Stoke’s shift.\nBecause of the brightness of mQDs, collect images at high frame rates in TIRF while imaging the basal side of a live cell.\n\tNote: Alternatively, single-molecule dynamics can be followed at other focal planes using a spinning disk confocal microscope. Automated single-particle tracking software is generally successful at accurately tracking the bright and photostable mQDs."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}