{
  "id": 6800,
  "origin_website": "Bio",
  "title": "Isolation, Purification and Characterization of Exosomes from Fibroblast Cultures of Skeletal Muscle",
  "procedures": [
    "Muscle excisionEuthanize the mouse following guidelines approved by the institution.Notes:Both male and female mice can be used. For this protocol a genetically engineered animal model of the lysosomal storage disease sialidosis (de Geest et al., 2002) crossed into C57Bl/6 or FVB background was used. The isolation of the hind limb muscles does not require the use of a biosafety cabinet. No sterile conditions are necessary.Pin the mouse down in a prone position (dorsal side up) to the dissecting pad (Figure 1A). Spray the mouse with 70% ethanol.Note: For the isolation of other muscle types, pin the mouse down in a supine position (ventral side up) to the dissecting board. Remove the skin from both hind limbs to expose the muscles and gently cut away the fascia of both hind limb muscles. Locate the Achilles tendon and separate it from the bone with a pair of forceps (Figure 1B).Notes: Shaving the fur is not necessary for this procedure. There is not a standard method for the removal of the fur/skin to expose the muscles. The procedure we use is as follows: Make a ~1 cm cut in the skin at the level of the hip joint and carefully pull the skin towards the ankle to expose the leg muscles. Cut the Achilles tendon and carefully pull the GA muscle upwards towards the knee joint and cut it loose at the tendon (Figures 1C and 1D).Note: As the tendons from the GA and soleus are interconnected (forming the Achilles tendon) it is not possible to separate them. Remove the soleus (darker red colored part of the muscle).",
    "When the GA and soleus muscles are cut at the knee joint, the soleus will detach from the GA muscle and can be lifted up and cut at the Achilles tendon to separate it from the GA muscle (Figures 1E and 1F).Note: The removal of the soleus allows for a purer fibroblast isolation from the remaining GA muscle. Weight a 50 ml tube containing 5 ml DPBS.Combine the GA muscles from both legs and transfer them to the pre-weighted 50 ml tube and weight the tube again. Place the tube on ice.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325192948_3482.jpgFigure 1. Dissection of GA muscle from the hind limb of adult mice. A. Picture presented here shows the mouse legs before removal of the fur/skin. B. The fur/skin is removed to expose the GA muscle (dashed lines) and the Achilles tendon, which is separated from the bone by a pair of forceps. C. The Achilles tendon is cut. D. The GA/soleus muscles are pulled upwards and cut at the knee joint. E. Isolated GA muscle is shown with the soleus (darker red and dashed lines) that is still attached. F. GA muscle is shown after removal of the soleus.Fibroblasts isolation from the gastrocnemius musclePrepare the biosafety hood by placing all necessary tools inside, including tube racks, pipets, dishes, tubes, tip boxes.Take two scalpels out of the sterile wrap and place them in the hood.Place a 10 cm dish open in the hood.Take out the sterile forceps and transfer the two GA muscles into the 10 cm dish.Note: The tissues contain residual amount of DPBS, which keeps the tissue moist during the procedure. Chop the muscles with the scalpels until it become a fine paste.Transfer the finely chopped muscle paste onto a 50 ml tube using the scalpels, cap the tube and place it back on ice.",
    "Notes:Additional DPBS is not required to transfer the minced muscle tissue with scalpels. If additional muscle samples need to be processed, repeat steps B4-B6 and transfer each chopped muscle paste to a new 50 ml tube. Add digestion mixture to each tube; 3.5x volume/mg tissue (see Recipes 1-4) and incubate at 37 °C for 45 min.Note: Alternatively, a tissue dissociator can be used to dissociate the muscles. During the 45 min digestion period, the tissue suspension needs to be mixed every 10 min by pipetting it up and down with a 5 ml pipet. This will promote the complete dissociation of the tissue.Add 20 ml complete medium to each tube to terminate the enzymatic digestion (see Recipe 5).Place a 70 μm cell strainer on a new 50 ml tube.Filter the tissue/cell suspension through the strainer, rinsing it with an additional 5.0 ml complete medium.Centrifuge the tissue/cell suspension at 300 x g at 4 °C for 10 min.Resuspend the pellet containing the cells in 10 ml complete medium.Seed the resuspended pellet in a 10 cm dish (Passage 0, P0) and incubate at 37 °C/5% CO2/3% O2.Note: The fibroblasts are cultured at a low oxygen level to keep the culture conditions as close as possible to the physiologic conditions, since the O2 level in skeletal muscle is around 2.5% (Mas-Bargues et al., 2019).Fibroblasts culture, trypsinization and expansionCulture the P0 fibroblasts until 100% confluency plus 1 day.Notes:Primary fibroblasts at P0 are routinely cultured until 100% confluency plus 1 day (and only for P0) to purge the cultures from any contaminating cells. The expected yield of fibroblasts (P0) from one pair of hind limb gastrocnemius muscles ranges from 1 to 5 x 106 cells, depending on the age and background of the mouse used.",
    "When cells are ready to be expanded, remove the culture medium and rinse the cells with 10 ml DPBS.Note: Be sure to remove all DPBS because it may interfere with the TrypLE express enzymatic activity. Add 1.0 ml TrypLE to the dish and incubate at 37 °C for 5 min.Tap the side of the dish and check under the microscope for complete detachment of the cells. If necessary, incubate another 5 min at 37 °C.Add 10 ml complete medium to inactivate the TrypLE and transfer the cells into a 50 ml tube.Centrifuge at 300 x g for 10 min at room temperature.Note: At this point P0 cells can be resuspended in freezing medium to be frozen for later use (see Recipe 6). Resuspend the cells in 10 ml complete medium.If needed, cells can be counted by mixing 10 μl cell suspension with 10 μl Trypan Blue and transferred to the Countess cell counter chamber.Note: Any type of cell counter can be used as long as it gives an accurate count of viable cells. Cells are seeded at a concentration of 1.0 x 105/ml, resulting in 2 x 106 cells (20 ml) per 15 cm dish.Culture the cells at 37 °C/5% CO2/3% O2 until 80%-90% confluency (Passage 1, P1).Repeat Steps C2 to C10 for additional passaging of the culture.Notes:The number of 15 cm dishes needed will depend on the total number of cells required; e.g., at P2 cells are seeded in 2-4, 15 cm dishes; at P4 they are seeded in 15-30, 15 cm dishes if a high yield of exosomes is required. The yield of exosomes from a 15 cm dish of primary fibroblasts is ~3-4 μg. We suggest seeding 20-25, 15 cm dishes to obtain enough exosomes for subsequent analyses.",
    "After P4, primary cells are discarded and not used for any further experiments as they change their characteristics.Crude Exosome isolationWash the 15 cm dishes containing fibroblasts (P2-P4) with 10 ml DPBS.Note: Be sure to remove all DPBS because it may interfere with the TrypLE express enzymatic activity. Add 2.5 ml TrypLE to each dish and incubate at 37 °C for 5 min.Tap the side of the dish and check under the microscope for complete detachment of the cells. If necessary, incubate another 5 min at 37 °C.Add 10 ml complete medium to inactivate the TrypLE and transfer the cells to a 50 ml tube.Centrifuge the cells at 300 x g for 10 min at room temperature.Resuspend the cells in 10 ml complete exosome free medium (see Recipes 7 and 8).Note: All vesicles/exosomes naturally present in FBS need to be removed prior to adding the FBS to the fibroblast culture medium, as they will interfere with further experimental analyses. If needed, cells can be counted by mixing 10 μl cell suspension with 10 μl Trypan Blue and transferred to the Countess cell counter chamber.Note: Any type of cell counter can be used as long as it gives an accurate count of viable cells. Seed the cells in the exosome free medium at the concentration of 1.5 x 106 - 2.0 x 106 per 15 cm dish and incubate at 37 °C/5% CO2/3% O2.Collect the conditioned medium in 50 ml tubes on ice after 16 to 24 h.Notes:The collected medium can be stored at 4 °C up to one week, if not processed immediately. If cells are not 80% confluent at the time of medium harvesting, fresh exosomal medium can be added and collected after an additional 16 to 24 h period. Combine the two batches of conditioned medium for further processing.",
    "Centrifuge the conditioned medium at 300 x g for 10 min at 4 °C and transfer it to a new 50 ml tube on ice (Figure 2.1).Note: This step is performed to eliminate viable cells. Centrifuge at 2,000 x g for 10 min at 4 °C (Figure 2.2).Note: This step is performed to eliminate dead cells. Transfer supernatant to a thin wall Polypropylene tube on ice and centrifuge in an ultracentrifuge at 10,000 x g at 4 °C for 30 min (Figure 2.3).Note: This step removes organelles, apoptotic bodies and membrane fragments. Centrifugation at 10,000 x g can also be performed using a Sorval centrifuge. Transfer the supernatant to an ultra-clear tube on ice and ultracentrifuge it at 100,000 x g at 4 °C for 1.5 h (Figure 2.4).Note: If exosomes need to be under sterile condition, the open ultra-clear tubes can be exchanged for sterile ultra-clear tubes with lids. Carefully discard the supernatant with a 10 ml pipette. Leave about 1.0 ml of liquid in the tube to avoid disturbance of the pellet.Add an additional 1.0 ml of ice-cold DPBS and resuspend the pellet using a P1000 pipette.Fill the tube up to 35 ml with ice-cold DPBS and ultracentrifuge at 100,000 x g at 4 °C for 1.5 h (Figure 2.5).Carefully discard the supernatant and leave the tube containing the pellet on ice.Note: The pellet should be translucent and may be hard to visualize, therefore the supernatant should be removed very carefully. Resuspend the pellet in an appropriate volume of ice-cold DPBS (~25 μl/15 cm dish).The exosomes can be kept at 4 °C up to one week. For long-term storage exosomes should be stored at -80 °C.Notes:Avoid freezing/thawing cycles, which can damage exosomes and reduce their numbers. The exosomes should be aliquoted if multiple experiments are performed.",
    "The crude exosomes can be used for a variety of analyses, including Western blots and in vitro uptake experiments. When needed, mass spec analysis can be performed on crude exosomes. Run fifty μg of crude exosomes on a 10% bis-tris gel for ~1 cm into the gel and cut 3 equal sized bands for in-gel digestion (sequencing grade modified trypsin solution) prior to LC-MS/MS. Quantification of crude exosomes for Western blot analysisNote: As an alternative, nanoparticle tracking analysis (NTA) as well as dynamic light scattering (DSL) can be used to characterize exosomes (Szatanek et al., 2017). Pipet 10 μl of each albumin standard dilutions (see Table 2) in duplicate into a 96-well plate to obtain the BCA standard curve.Table 2. BCA Standard Curve preparationimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325193106_5344.jpgPipet 5.0 μl 0.1% Triton X-100 in ddH2O in duplicate in a 96-welll plate (see Recipe 9).Add 5.0 μl of the exosomal samples to the wells containing 0.1% Triton X-100, resulting in a 1:2 dilution.Note: The resuspended exosomal pellet should be diluted further (1:5 or 1:10), depending on the final yield of the preparation. Add 200 μl BCA working solution to all wells (see Recipe 10).Incubate the plate at 37 °C for 30 min and read the protein concentration at OD562 using a plate reader.On average 1 x 106 primary fibroblasts will yield approximately 3-4 μg exosomes that can be resuspended directly into electrophoresis loading buffer (0.5 μl of 1.0 M DTT (Recipe 11), 5.0 μl Laemmli sample buffer (4x) and 14.5 μl of ddH2O).Sucrose density gradient for purification of exosomesPrepare all the solutions needed for the sucrose density gradient and keep them on ice (see Recipes 12-15 and Table 3).Table 3. Sucrose gradient solutionsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325193215_7646.jpg*SGWS: Sucrose Gradient Working Solution (see Recipe 13).Resuspend 30 to 100 μg of exosomes in 1.0 ml of 0.25 M sucrose solution.",
    "Prepare the gradient in a 13 ml ultra-clear tube by pipetting the sucrose solutions in sequence starting from the bottom of the tube with 1.5 ml of 2.0 M, 2.5 ml of 1.3 M, 2.5 ml of 1.16 M, 2.0 ml of 0.8 M, 2.0 ml of 0.5 M sucrose. Layer the gradient at the top with 1.0 ml sucrose solution containing exosomes (Figure 2.6).Centrifuge the gradient at 100,000 x g at 4 °C for 2.5 h, using a swinging bucket rotor (Figure 2.6).Carefully take the tubes out of the rotor and place them on ice.Collect 1.0 ml fractions starting from the top of the gradient and transfer them to 1.7 ml Eppendorf tubes on ice (Figure 2.7).Add 110 μl 100% TCA to each tube, mix well and incubate at room temperature for 10 min (see Recipe 16) (Figure 2.8).Centrifuge at 10,000 x g at room temperature for 10 min and discard the supernatant.Wash the pellets with 500 μl pre-cooled 80% ethanol, pipetting up and down, and place the resuspended pellets at -20 °C for 10 min (see Recipe 17).Centrifuge at 10,000 x g at 4 °C for 10 min.Remove carefully the supernatant and let the pellets air dry for 10-15 min.Resuspend the pellets in 15-30 μl ice cold DPBS.Notes:The volume of DPBS used to resuspend the pellets depends on the starting material and the size of the pellet. For Western blot analyses, resuspend each pellet in electrophoresis loading buffer (0.5 μl 1.0 M DTT (Recipe 16), 5.0 μl Laemmli sample buffer (4x) and 14.5 μl of ddH2O). Measure the protein concentration according to Steps E1 to E5.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325193303_5423.jpgFigure 2. Schematic presentation of exosomes isolation from cultured media. Removal of cells (1), dead cells (2) and cells debris (3) after sequential centrifugation steps.",
    "Ultra-centrifugation of exosomes (4) and washing of exosomal pellet in DPBS (5). Loading of exosomal pellet on a sucrose density gradient (6). Fraction collection (7) after ultra-centrifugation and precipitation with TCA (8).Western blot analyses of crude exosomes and purified sucrose gradient samplesPrepare the electrophoresis running buffer and the buffer for transferring the proteins from the gel onto a PVDF membrane (Recipes 18-21).For the protein transfer, cut filter papers and membranes according to the size the gels used.Note: Filter papers and PVDF membranes are cut 7 cm by 9 cm for mini gels and 9 cm by 14 cm for midi gels. Assemble the precast gel in the electrophoresis tank and fill the tank with running buffer.Notes:See instruction manual from Bio-Rad (https://www.bio-rad.com/[href=https://www.bio-rad.com/]) for “Mini-PROTEAN Tetra Cell Precast”. Gels with different percentage of polyacryamide are used depending on the molecular weight of the proteins that need to be resolved: 7.5% for proteins of 50-200 kDa, 10% for proteins of 15-100 kDa, 12% for proteins of 10-70 kDa and 15% for proteins of 12-45 kDa. Boil the exosomes (from crude exosomal preparations or purified sucrose density gradient fractions) resuspended in loading buffer for 5 min. Spin the samples at ~10,000 x g for 30 s prior to loading them on a precast gel.Before loading of the samples, rinse the wells of the gel with running buffer.Load the precast gel with the exosomal samples and the protein markers, using round loading tips.Note: Resuspend each sample thoroughly prior to loading the gel. Run the gel at 100 V until the dye of the loading buffer reaches the base of the gel.Carefully remove the gel from the cassette, placed it on the Chemidoc imaging tray containing 1.0 ml of transfer buffer and image it, using a Stain-Free program (Figure 3).",
    "Note: The stain-free gel is a handy tool to assess if the loading is equal in all samples.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325193357_8939.jpgFigure 3. Stain-free gel loaded with exosomes. WT and Neu1–/– crude exosomes run on a Criterion TGX Stain-Free precast gel and imaged using the chemidoc stain free program (Figure from van de Vlekkert et al., 2019).Equilibrate the gel in transfer buffer.Label the PVDF membrane with a pencil or pen and activate it in 100% methanol for 10 s (max 30 s).Briefly rinse the PVDF membrane in ddH2O and equilibrate it in transfer buffer.Soak the filter papers in transfer buffer.Assemble the gel, filter papers and PVDF membrane for transfer.Note: See instruction manual from Bio-Rad (https://www.bio-rad.com/[href=https://www.bio-rad.com/]) for “Mini Trans-Blot Electrophoretic Transfer Cell”. Transfer at 80 V for 1.5 to 2 h or overnight at 30 V at 4 °C.After transfer incubate the membrane in blocking buffer at room temperature for 1 h with agitation (see Recipes 22-24).Incubate the membrane (in a 50 ml tube) with the primary antibody (see Table 1) diluted in 3.0 ml 3% BSA-TBS-T overnight at 4 °C with gentle agitation (see Recipes 22-23, 25).Note: Dilute the primary antibody to the recommended concentration/dilution. Rinse the membrane 1 time with TBS-T and wash 3 times 10 min with TBS-T under gentle agitation (see Recipes 22-23).Incubate 1 h with a secondary antibody (see Table 1; 1:10,000 dilution) in blocking buffer at room temperature under gentle agitation.Rinse the membrane 1 time with TBS-T and wash 3 times 10 min with TBS-T under gentle agitation.Pipet 1.0 ml of SuperSignal west Femto developer solution on a plexiglass plate, making sure that the table/bench is leveled to avoid run off of the solution (Recipe 26).Remove excess of TBS-T and place the membrane face down on 1.0 ml developer solution.",
    "Incubate 30 s to 1 min, and place the membrane face up on the Blot/UV/Stain-Free sample tray.Image the membranes (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325193451_4166.jpgFigure 4. Immunoblot analyses of exosomes using canonical exosomal markers. A. Exosomes were purified from WT and Neu1–/– cultured (myo)fibroblasts and probed with anti-Alix, CD81, CD9, flotillin1, syndecan1 and syntenin1 antibodies. B. WT and Neu1–/– crude exosomes were subjected to sucrose density gradient and probed with anti-Alix, CD9 and CD81 antibodies. Exosomes sedimented in fractions 3-6 which correspond to the densities of 1.096-1.140 g ml-1 (figure from van de Vlekkert et al., 2019)."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}