{
  "id": 9975,
  "origin_website": "Jove",
  "title": "Bilayer Microfluidic Device for Combinatorial Plug Production",
  "procedures": [
    "1. Soft lithography\nNOTE: The microfluidic device is composed of two layers, flow layer and control layer (Figure 1A), and each layer is molded from individually patterned wafers using a positive and negative photoresist respectively (Refer to Table of Materials for details of photoresist and developers).\nPerform wafer fabrication for the flow layer as described below.\n\t\nDehydrate a silicon wafer (100 mm diameter, <1-0-0> oriented, 525) overnight (12-16 h) at 250 °C.\nAllow the wafer to cool before proceeding to spin-coating. Apply 3-4 mL of the positive photoresist to the center of the wafer.\nSpin for 40 s at 1400 rpm (344 rpm/s) to obtain a feature height of 45 µm.\nSoft bake on a hotplate using a temperature ramp, increasing at the rate of 450 °C /h, from 35 °C to 105 °C. This step can also be carried out on microfiber tissues to prevent direct contact and minimize the bubbling of the photoresist. Remove the wafer from the hotplate and allow it to cool on microfiber tissues.\nPlace the photomask (commercially produced) corresponding to the flow layer (emulsion side down) onto the resist-coated silicon wafer and expose it under a UV lamp, at 10 mW/cm2, until a total exposure of 200 mJ/cm2 is reached.\nUse two hotplates - one at 65 °C and the other at 95 °C - to perform a post-exposure bake - for 1 min and 7 min respectively - on the plates.\nDevelop the wafer by transferring it to a Petri dish filled with developer for positive photoresist. Agitate the Petri dish by shaking it on a benchtop shaker with the wafer completely submerged and refresh the developer solution periodically until the wafer is completely developed, and the features can be clearly seen.",
    "Use demineralized water to rinse off residual resist from the wafer and check under a stereo microscope for any residues inside the channels. Remove residues by returning the wafer to the developer solution or carefully adding the developer to the wafer with a micropipette. Once completed, dry the wafer using a nitrogen spray gun.\nReflow the wafer by placing it on a hotplate set to 110 °C for 25 min. This process results in rounded features.\nProceed to silanization of the wafer as detailed in step 1.3.\n\t\t​NOTE: Hexamethyldisilazane (HMDS) vapor deposition can also be carried out on the silicon wafers prior to application of the resist to improve adhesion between the resist and the wafer.\nPerform Wafer fabrication for the control layer as described below.\n\t\nTake another silicon wafer and dehydrate by placing it on a hotplate set at 110 °C for 15 min.\nRemove the wafer and allow it to cool to room temperature before proceeding with spin coating.\nApply 5 mL of the negative photoresist to the center of the wafer.\nUse the following spin protocol to obtain a feature height of 40 µm: 5 s at 500 rpm (100 rpm/s acceleration), 33 s at 1400 rpm (300 rpm/s), and finally decelerate to 0 rpm for 5 s at 300 rpm/s.\nSoft bake using two separate hotplates set to 65 °C and 95 °C for 1 min and 15 min respectively. Remove the wafer from the hotplate and allow it to cool on microfiber tissues.\nPlace the photomask (commercially produced) corresponding to the control layer (emulsion side down) onto the resist-coated wafer and expose the wafer under a UV lamp, set at 15 mW/cm2, until a total exposure of 250 mJ/cm2 is reached.",
    "Use two hotplates - one at 65 °C and the other at 95 °C - and perform a post-exposure bake of the wafer for 2 min and then 5 min respectively. Remove the wafer from the hotplate and allow it to cool on microfiber tissues.\nDevelop the wafer by transferring it to a Petri dish filled with developer for negative photoresist for 4 min. Refresh the developer and continue the process for 4 min more.\nRinse the wafer with isopropanol to remove residual photoresist and use a stereo microscope to check the wafer for any residue inside the channels.\nRemove residues by returning the wafer to the developer solution or carefully adding the developer to the wafer with a micropipette. Once completed, dry the wafer using a nitrogen spray gun.\nOnce fully developed, hard bake the photoresist by placing the wafer on a hotplate set at 95 °C for 10 min.\nProceed to silanization as detailed in step 1.3.\nCarry out silanization as described below.\n\t\nPlace the wafer in a desiccator. Place a glass bottle in the desiccator and add 4-5 drops of 1,1,3,3 tetramethyldisiloxane.\n\t\tCAUTION: 1,1,3,3 tetramethyldisiloxane is not toxic but is flammable. Other silanes can be used, but they might be toxic. It is recommended to carry out silanization in a fume hood while wearing necessary Personal Protective Equipment (PPE) such as lab coat, glasses, and nitrile gloves.\nPull the vacuum for 15 min and seal the desiccator for 12-16 h to allow the silane to deposit on the wafer.\nOpen the desiccator and dispose of the glass bottle. Place the wafer in a clean Petri dish.\nPerform microfluidic device fabrication as described below.\n\tNOTE: The following protocol has been adapted from previous works23.",
    "Prepare two separate PDMS solutions - one for the flow layer and one for the control layer. For each solution, mix the base agent and curing agent of the PDMS kit in a beaker and stir using a mixing rod. The control layer requires 10 g of base agent and 0.5 g of curing agent (20:1 ratio) while the flow layer requires 40 g of the base agent and 8 g of the curing agent (5:1 ratio).\nDegas the PDMS solutions in a desiccator until the solutions are gas-free.\nPlace the silanized flow layer wafer in a Petri dish covered with foil and pour the corresponding PDMS solution over the wafer. Place the Petri dish back in the desiccator and pull the vacuum to degas further (for approximately 20 min).\nSpin coat the silanized control layer wafer with its corresponding PDMS solution. Pour 3-4 mL of the solution onto the center of the wafer and spin for 20 s at 1500 rpm at 408 rpm/s. Place the wafer on a level surface in a closed Petri dish for 20 mins.\nPlace both the flow and control layers in an oven at 80 °C for 18-20 min. Periodically monitor the two layers to check if they are cured. The layers are ready when they are tough enough to be malleable yet slightly sticky, as this improves the bonding between the two layers.\nCut out the PDMS around each of the devices on the flow layer wafer with a scalpel. Make sure to not cut too close to the features and leave approximately 2 cm of space between the feature and the edges of the PDMS. Once detached from the silicon wafer, cover the PDMS block with tape on the feature side to avoid any dust contamination.",
    "Once all PDMS blocks have been cut out, place them one by one on the corresponding control layer wafer performing a rough alignment by eye.\nAfter all the blocks have been placed on their corresponding areas on the control layer, adjust the position of each of the blocks such that the control valves overlap over the corresponding flow channels to complete the alignment. This can also be carried out with the help of a stereo microscope.\nRemove air pockets between the two layers by applying pressure. If the air pocket is on or near a feature, take care to not collapse the channels while applying pressure.\nPlace the devices in the 80 °C oven and leave them to bond for 12-16 h. Place 100 g weights on each of the devices to improve the bonding between the two layers.\nTake the wafer out and cut out each individual device. Peel the devices off the control layer wafer and cover the feature side with tape.\nPlace each individual device on a cutting mat with the feature side facing upwards and punch a hole for each of the eight flow layer inlets, eight control layer channel inlets, the oil inlets, and the outlet using a 0.75 mm biopsy punch with the feature side facing upwards.\nLoad the plasma asher with a microscope slide and a single device with the tape removed and the feature side facing upwards. Perform the oxygen plasma ashing with a power of 30 W for a duration of 20 s.",
    "Take the device and the glass slide out as soon as the ashing is complete and place the device with the feature side downwards onto the slide. The adhesion between PDMS and glass should be immediately visible to the naked eye. Apply pressure to any regions with air pockets to squeeze the air out.\nPlace the devices on a hotplate set to 110 °C for 60 min with a weight on top to improve the bonding of the PDMS to the glass.\n2. Hardware setup\nNOTE: A schematic of the connections to the microfluidic device is shown in Figure 1B and a realization of such a scheme using the necessary hardware is shown in Figure 2.\nSet up the Pneumatic valves as described below.\n\tNOTE: Each control channel, which regulates a PDMS valve on the chip is in turn controlled by a single solenoid valve. The prototype presented here consists of eight control channels (Figure 1A), and hence eight solenoid valves are required.\n\t\nThe solenoid valves are controlled using a custom LabVIEW software program (Main Interface Program; Figure 3 and Supplementary File 1, Supplementary File 2, Supplementary File 3, Supplementary File 4). This program sends MODBUS commands via a TCP connection (Supplementary File 5, Supplementary File 6), to a WAGO controller. Connect the WAGO device to the computer with the LabVIEW program using an ethernet cable. Proceed to connect the solenoid valves sequentially to the ports on the WAGO controller. For a more detailed description, please refer to previously described protocols23.\nConnect the solenoid valve array to a compressed air source using 1/4 in tubing and set the pressure of the valve array to 3.5 bar. In this system, the eight valves marked 9-16 were used.\nSet up pressure regulators as described below.",
    "NOTE: A commercially available pressure pump is used to control fluid flow (Figure 2). An eight-port and a four-port pump set were used to accommodate eight aqueous inlets and two oil inlets in the device. The pressure of each port is regulated via software that is provided by the manufacturers.\n\t\nConnect the pressure pump to a compressed air source ensuring that the supplied pressure does not exceed the maximum pressure permitted by the pump (2.2 bar for both the eight-port and the four-port controllers).\nConnect the pressure pumps to a computer using a USB-connector.\nOnce the pumps are switched on, they should be visible in the corresponding software. Set the pressures to zero while setting up the pumps.\nConnect a male luer to 3/32 in barb connector to each of the 12 female luer lock output ports on the controllers.\nConnect a piece of soft tubing (OD: 3 mm, ID: 1 mm, L: 15 cm) to the barb. Connect another male luer to 3/32 in barb connector to the other end of the soft tubing.\nConnect a luer stub (23 G, 0.5 in) to the barb connector. At this point, the pressure regulator is set up and ready to be used.\n3. Microfluidic device setup\nConnect the control channel tubing as described below (Figure 2).\n\t\nFor each control channel, cut a length of PolyTetraFluoroEthylene (PTFE) tubing (OD: 0.042 in, ID: 0.022 in). Insert the pin of a 23 G, 0.5 in luer stub at one end.\nConnect the luer stub to a male luer to 3/32 in barb nylon connector. Insert the barb of the connector into a length of polyurethane tubing (OD: 4 mm, ID: 2.5 mm). Connect the other end of the polyurethane tubing directly to a solenoid valve.",
    "Fill a syringe with water and connect a 23 G, 0.5 in luer stub at the end.\nConnect the free end of the PTFE tubing to this syringe and inject water until approximately halfway through the tubing.\nDisconnect the tubing from the syringe and insert the free end of the tubing into a punched hole of the corresponding control channel (Figure 1A-C1-8). Repeat until each control channel has been connected to its corresponding solenoid valve.\n\t\tNOTE: In this paper, the solenoid valves 9-16 were connected to the control channels corresponding to C1 to C8, respectively. While these can be connected in any manner, it is important to remember the order and sequence of the connections, especially while operating the Main Interface program.\nUse the Main Interface program (Figure 3) to open all the solenoid valves (Pressurize all control channels). This will push the fluid from the tubing into the control channels of the microfluidic device and thereby filling it up. An example of pressurized and depressurized valves is shown in Figure 4.\nConnect reagents and prime the device as described below.\n\t\nEnsure that all control channels are pressurized by pressing the Pressurize all Control Channels button in the Main Interface program (Figure 3).\nFor each of the aqueous reagents, cut a segment of PTFE tubing (OD: 0.042 in, ID: 0.022 in) long enough to connect the pumps to the inlets of the microfluidic device inlets. Connect one of the tubing to the luer stub from step 2.2.6.\nFill a syringe with the required reagent and connect a 23 G, 0.5 in luer stub at the end.\nInject the reagent into the corresponding PTFE tubing until the tubing is full. Take care that the reagent does not enter the output port on the pump set.",
    "Insert the free end of the tubing into a corresponding inlet in the microfluidic chip.\nApply a pressure of 400 mbar to each of the inlet aqueous reagents using the software provided.\nSequentially depressurize the control channels individually using the Main Interface program (Figure 3) to ensure that all the reagents have reached the T-junction of the device. Actuate individual valves , if needed, by pressing the corresponding buttons on the program in the box Control Channels Manual Pressurization.\nRepeat steps 3.2.3 to 3.2.5 for the oil reagents. Apply a pressure of 400 mbar to each of the inlet oil reagents.\nSimultaneously depressurize all the control channels by pressing Depressurize All Control Channels (Figure 3) until all the air has been removed from the device. This is observable by the naked eye or under a microscope.\nPressurize all the control channels by pressing Pressurize All Control Channels button (Figure 3). At this stage, all reagents have been connected and the device is primed and ready to use.\nProgram and execute the experiment as described below.\n\t\nEncode the composition, sequence, and replicates of each plug population to be produced in a .csv file as shown in Supplementary File 7 which serves as the input for the Automatic Experiment in the Main Interface program (Figure 3). Mark the necessary control channels with a 0 if its corresponding to an inlet needs to be open and a 1 if it needs to be closed. Each row in the .csv file corresponds to one distinct plug population.\nLoad the .csv on to the Main Interface program by clicking on the Folder button in the Experiment File tab.",
    "Enter the relevant fields in the program such as Iterations of experiment (to determine how many times the given sequence of plugs are produced), Time of depressurization (to determine how long the inlet channels need to be open and the corresponding control channel needs to be depressurized in milliseconds), Time of pressurization (to determine how long the inlets need to be closed between sequences of plug population in milliseconds).\nSelect the inlet channel(s) corresponding to barcode production in the Barcode Inlets (up to 3 channels) section along with the duration for which they need to be open (Time for Barcoding (ms)). Alternatively, these barcodes can also be hardcoded into the input .csv file as shown in Supplementary File 7.\nReduce the pressure of the inlet oil reagents to 200 mbar.\nConnect a PTFE tubing (OD: 0.042 in, ID: 0.022 in) of the desired length at the outlet to collect the plugs. In order to ensure uniform plug production, use tubing of approximately 100 cm prefilled with plugs for collection. This is to neutralize the difference in pressure at the outlet which is exerted by the collection of plugs in the tubing.\nPress Run Experiment to start the program and plug production.\nPerform data recording and analysis as described below (see Figure 5).\n\tNOTE: This section specifically outlines a method for analyzing fluorescent plugs. Depending on the nature of the plugs generated, this section can be altered as required.\n\t\nFill a syringe with oil (either mineral oil or fluorinated oil) and connect a 23 G 0.5 in luer stub at the end. Fasten the syringe to a pump.\nConnect one of the ends of the filled collection tubing to the luer stub on the syringe. Affix the other end of the filled collection tubing above the objective lens of a microscope.",
    "Place a waste reservoir below the end of the tubing near the objective.\nFocus the microscope on a given region of the tubing and set it to record fluorescence in the desired channel(s).\nSet the pump to a flow rate of 50 µL/min.\nRecord the video of the fluorescent channel as an .avi file.\nAnalyze the .avi file using the provided python script (Supplementary File 8) to extract the average fluorescence in a predefined region of interest (ROI) per frame of the .avi file (an example of which is given in Supplementary File 9).\nUse the provided customized R script (Supplementary File 10) to extract the conditions and plot the raw data and the peak heights.\n\t\tNOTE: The R script in Supplementary File 10 was used for analysis in this paper. The custom-made R functions used in this script to cut data, detect conditions using barcodes, and analyze the peak heights for individual plugs and plotting are provided in Supplementary File 11."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}