{
  "id": 18962,
  "origin_website": "Jove",
  "title": "Utilizing Repetitive Transcranial Magnetic Stimulation to Improve Language Function in Stroke Patients with Chronic Non-fluent Aphasia",
  "procedures": [
    "1. Pre-Treatment Evaluation\nRecruit patients who meet the eligibility requirements for the study. These criteria include a single, unilateral, left hemisphere ischemic stroke that spares the supplementary motor area (SMA), mild to moderate non-fluent speech (defined as the ability to produce meaningful words and at least a 2-4 word length string), between the ages of 18 and 75 and at least six months post-stroke.\nAdditionally, all potential patients must be able to name at least three of the first 30 items on the Boston Naming Test15, an average of at least three pictures out of 20 when presented with ten sets of picture-naming stimuli taken from the Snodgrass and Vanderwart corpus16, and score at or above the 25th percentile on the subtests for word comprehension and commands on the Boston Diagnostic Aphasic Examination17.\nConduct a medical screening examination to ensure patients are healthy enough to participate in the study, and that there are no contraindications to undergoing a Magnetic Resonance Imaging (MRI) scan or TMS.\n2. Baseline Testing\nAdminister a battery of standardized tests on three separate days to assess the extent of each patient's language impairment and deficits in other cognitive domains. The tests include the Cookie Theft picture description subtest of the BDAE18, BDAE (2nd Ed.) Subtests for Word Comprehension (Basic Word Discrimination) and Commands, Boston Naming Test15, sets of 40 line drawing stimuli taken from the Snodgrass and Vanderwart picture database16, and the Cognitive Linguistic Quick Test19 (CLQT).",
    "Initiate a baseline BOLD-fMRI study in which the patient performs a picture-naming task with oral response. Collect high resolution whole-brain T1-weighted images with a MPRAGE sequence (RT = 1,620 msec, TE = 3.87 msec, FA = 15, FOV = 192 x 256, slices = 160, voxel sizes = 1 mm3). Acquire functional volumes using a whole-brain T2*-weighted BOLD echoplanar sequence (TR = 3,000 sec, TE = 35 msec, FA = 90, FOV = 128 x 128, slices = 31, voxel sizes = 1.875 mm2, slice thickness = 4 mm).\nRandomize patients into either a group receiving real repetitive TMS (rTMS) or a group receiving initial sham stimulation (sTMS), followed by rTMS (Figure 1).\n3. Identification of Optimal Sites of Stimulation\nIn order to target rTMS to cortical sites in a precise and accurate manner, use a neuronavigational system (e.g. Brainsight, Rogue Research, Montreal) to co-register high-resolution whole-brain T1-weighted images (see 2.2 above) with the location of the patient and coil. For the rTMS group, determine resting motor threshold (RMT) via stimulation to right motor cortex and subsequent visual inspection20.\nDuring real rTMS, orient the coil with the handle in a posterior and inferior direction approximately 45° clockwise from the downward position. For the sham group, administer sTMS with the coil perpendicular to the head so that only the outer rim of the lateral wing of the coil contacts the head. In this orientation, the peak magnetic field runs parallel to the skull and thus does not produce cortical stimulation.",
    "In six separate sessions conducted over five days (two sessions conducted on final day, with a 45-minute break in between sessions), administer ten minutes of either rTMS (600 pulses of 1 Hz at an intensity of 90% RMT) or sTMS to different sites in the right inferior frontal lobe: the primary motor cortex (M1) corresponding to the mouth, pars opercularis (BA 44), anterior pars triangularis (BA 45), dorsal posterior pars triangularis (BA 45), ventral posterior pars triangularis (BA 45), and pars orbitalis (BA 47; Figure 2). Randomize stimulation site order between patients.\nHave patients perform a 40-item picture-naming task immediately before and after each TMS session. Picture stimuli are taken from the Snodgrass and Vanderwart16 item set, the Peabody Picture Vocabulary Test21, and the International Picture Naming Project (IPNP) database22. The 40-item lists must be matched with respect to word length, frequency, and semantic category; in our item lists 20 items were novel while 20 were repeated throughout the testing sessions to assess for practice effects. Utterances should be counted as correct if they differ from the target by no more than one phoneme8. Word list order should be randomized across subjects and each subject should receive different word lists at every visit.\nDetermine the optimal site of stimulation by performing one-sample t-tests comparing the change in picture-naming performance at each site to the mean change in naming performance for all other sites. Next, compare the change in performance at the optimal site to the variance of performance across all six pre-rTMS sessions; if the change in performance after rTMS is greater than two times the standard deviation of mean pre-TMS performance, it is unlikely that the benefit in naming performance is attributable to test-retest variability9.",
    "For sham site-finding, administer sTMS over the pars triangularis. This location acts as the \"optimal site\" for the sham arm of the treatment phase, as described in Protocol section 4.\n4. Treatment Phase\nAdminister rTMS or sTMS to the optimal stimulation site for ten days in a twelve-day period (stimulation on every weekday with weekends off).\nOn the first day of stimulation, the order of events is as follows: have the patient undergo an fMRI (with concurrent picture-naming, as in baseline), administer the 40-item naming task, stimulate the optimal site using 20 min of either 1 Hz rTMS at 90% RMT or sTMS, administer the naming task again, and finally have the patient undergo a second fMRI with concurrent picture-naming.\nOn days two through nine, the protocol consists of a 20-minute rTMS session (1,200 pulses), using 1 Hz rTMS at 90% RMT or sTMS.\nOn day ten, stimulate the optimal site for 20 min with 1 Hz rTMS, preceded and followed by the picture-naming task. Of note, picture item lists shown on days one and ten should be different, but matched for frequency, word length, and semantic category as noted above.\n5. Two- and Six-month Follow-up Visits\nTwo months following day ten of either rTMS or sTMS, repeat baseline testing (step 2.1), as well as fMRI with concurrent picture-naming.\nPatients in the sham condition should then cross over to real TMS condition, beginning with the optimal site-finding phase (Figure 1).\nSix months following day ten of real rTMS stimulation, repeat baseline testing (as in step 2.1), and also have patients undergo another fMRI with a concurrent picture-naming task.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}