{
  "id": 5770,
  "origin_website": "Bio",
  "title": "Rearing of <em>Culex</em> spp. and <em>Aedes</em> spp. Mosquitoes",
  "procedures": [
    "Collection and hatching of eggsCulex spp. lay their eggs in rafts directly on the water surface, ideally 250-300 eggs per raft. Females settle carefully on still water and lay eggs one by one, arranging them into a head-down array that sticks together to form the raft, which must remain on the water surface to hatch. In the laboratory mosquito colony, collect Culex spp. egg rafts 3-7 days (d) after blood feeding, by placing a clear polystyrene 250 ml cup (oviposition dish) partially filled with distilled water in the mosquito cage overnight (Figure 1A). The egg rafts (Figure 2) are transferred to a larval flat filled with 1 L of distilled water and a pinch (approximately 0.2 g) of ground larval food. Transfer the intact egg rafts by gently picking them up with a wooden applicator stick and placing them on the water surface of the larval flat in the same orientation as in the oviposition cup. If the eggs have already hatched, pour the contents of the oviposition dish directly into the larval flat. Most eggs hatch into larvae within 48 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831010249_1557.jpgFigure 1. Oviposition containers for Culex (A) and Aedes (B)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831010430_1130.jpgFigure 2. Culex egg raft and enlarged view of eggsAedes spp. lay their eggs singly on damp substrates just above the water line. Their eggs can withstand long periods of desiccation and remain viable. In the laboratory colony, collect Aedes spp. eggs 3-5 d after blood feeding by placing an oviposition dish containing distilled water and a partially submerged fluted coffee filter, or seed paper in the mosquito cage (Figure 1B).",
    "After eggs are deposited, remove the paper with attached eggs from the oviposition dish, allow it to partially dry, place it into a plastic bag, and place the bag in a sealed air-tight plastic container for at least three days to allow the eggs to embryonate. Place a damp sponge in the container to maintain humidity. Under these conditions, the Aedes eggs will remain viable for 3-6 months (Ae. aegypti) or 1-2 months (Ae. albopictus). Ae. albopictus, unlike Ae. aegypti, will not tolerate extreme desiccation. Thus, regularly test viability by hatching a small section of the paper containing eggs. Once a month, check eggs for desiccation by observing under a microscope (Figure 3). If they are shrunken and deflated, they may have desiccated, or may not be embryonated.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831010518_1525.jpgFigure 3. Aedes eggs on paper (A) and enlarged view of eggs (B)To hatch Ae. albopictus eggs, place egg papers into a larval flat with 1 L of distilled water and a pinch (0.2 g) of ground larval food. After the papers are thoroughly wet, they will sink into the water. To hatch Ae. aegypti eggs, place egg papers in a 2-L side-arm flask containing 1 L of distilled water and place under laboratory house vacuum for 1 h to deoxygenate the water. After the deoxygenation step, pour the flask contents into an empty larval flat and add a pinch (0.2 g) of ground larval food.Note: For both species, examine the flats daily for hatched larvae, which are 1-1.5 mm long and tend to accumulate in corners of the flat, but will ‘wiggle’ and disperse if the flat is disturbed.  Larval rearingDuring this aquatic stage, the Culex and Aedes species larvae will feed voraciously. They often suspend head down, from the surface of the water breathing through siphon tubes.",
    "Larvae shed (molt) their exoskeleton four times (4 instar stages), growing larger after each molt. After the fourth instar, larvae metamorphose into pupae. The entire larval stage lasts from 6 to 8 days, depending on temperature, crowding, and nutrition. Larval body lengths range from approximately 1-1.5 mm for first instar, 1.5-3 mm for second instar, 3-5 mm for third instar, and 3.5-7 mm for fourth instar (Video 1 shows fourth instar larvae swimming and suspended at the water surface).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Culex larvae and pupae   After eggs have hatched, use 1-ml disposable transfer pipets to transfer the first instar larvae into flats containing 1 L of deionized water. Aim for a density of 250-300 larvae per flat (approximately 2-3 pipet squirts if removing larvae from a concentrated area of the hatching flat). The larval density is important because crowding leads to stress, competition for food, longer pupation times and smaller adults. Approximately six larval flats will be needed to fill a 30 cm3 mosquito colony cage and one flat with approximately 200 larvae for experimental use (Figure 4). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831011057_2480.jpgFigure 4. Covered larval flatsFeed the larvae daily with ground larval food. Always make sure that there is a small amount of food at the bottom of the pan. Food density should be assessed daily. The following approximations can be used as a guideline: first and second instar, 0.2 g per flat; third and fourth instar, 0.4 g per flat. A scum on the surface of the flat indicates overfeeding, which will affect larval fitness. The scum should be removed by skimming the surface with a paper towel. Do not change the water in the flats because larvae feed best in water conditioned during breakdown of food.",
    "If the larvae become too dense, they can be divided into new flats (resulting in slower development) or added to less dense flats from the same batch of eggs. The rearing process proceeds much more efficiently, if egg hatching, larval rearing, pupae, and adult development are as closely synchronized as possible. Keep flats covered with plastic lids to prevent emerging mosquitoes from escaping from the flats.PupaeAfter the fourth instar, larvae begin to pupate, approximately 6-8 days after hatching and rearing at 26-28 °C. Pupae have short curved bodies with a large head and flippers for swimming at the other end. They are lighter than water and rest at the surface, breathing through a pair of respiratory trumpets. When disturbed, they swim in jerky movements and then float back to the surface (see Video 1 that shows both fourth instar larvae and pupae). Pupation continues for 3-4 days, and the pupal stage lasts for 1-2 days, depending on species and temperature. During daily larval feeding, check the flats for pupae, which float at the surface and appear darker in color than the larvae. Since the pupal stage lasts only days, the pupae should be moved from the larval flats (Figure 5) to mosquito emergence jars as soon as detected to avoid emergence of adults into the larval flats. If mosquitoes are allowed to emerge in the flats, the covered flats must be transferred to a glove box, and the adult mosquitoes collected with an aspirator, as described in step 4b and Video 2. Separate pupae from larvae using one of the following methods and place them into an emergence jar with the bottom chamber half-full of deionized water (Figure 6). Label emergence jars with hatch date and mosquito species/strain.",
    "Place a sugar cube or other sugar source on the mesh top of the emergence jar to be available to adults after they emerge, but do not add food to the water, as pupae do not feed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831012944_0939.jpgFigure 5. Picking pupae from a larval flat    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 2. Transferring adult mosquitoes from emergence jar   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831013254_9545.jpgFigure 6. Mosquito emergence jar containing pupae and adultsPicking pupae manually.Cut off the tip of a 1 ml transfer pipet and draw in pupae one by one from the water surface and transfer to an emergence jar (Figure 7). This is the quickest method when there are < 20 pupae in the flat Separating pupae from larvae by the ice-water method.Pour the contents of the larval flat through a fish net with the drained water going into a clean flat. Using a small amount of distilled water, wash contents of fish net into a clear plastic cup. Fill the cup with icy cold water, swirl gently, which will cause larvae to sink to the bottom and pupae to rise to the top. Use a 1 ml transfer pipette to transfer pupae to the emergence jar. Pour the remaining larvae into the flat that contains strained rearing water. This is a good method to use when there are many pupae but still a substantial number of larvae in the flat. This method also allows one to easily combine larval flats to maintain an optimal density. Pupal separators also can be purchased or made, but because male and female pupae vary in size, the separators may be difficult to adjust so they work well.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831022723_0424.jpgFigure 7. Transfer pipets with tip cut off (A) and containing pupa (B)AdultsAdults will emerge from pupae in approximately 2 days.",
    "After emergence, the adult will sit on the water surface until its body dries and hardens. Most mosquitoes mate shortly after emergence from the pupal stage. The spermatozoa are passed by the male into the spermatheca of the female and usually serve to fertilize all eggs laid throughout the female’s lifetime. Males live for only 3-5 days after emergence, while females can live up to one or two months under laboratory conditions, typically laying as many as three sets of eggs before dying.Transfer the adults from the emergence jars into a mosquito colony cage (Figure 8) or into mosquito holding cartons for experimental use. Open the emergence jar within a glove box and use the battery-powered aspirator to collect adults (Figure 10 and Video 2). After aspirating the adults into the collecting tube, stopper the inlet tube, detach the collecting tube from the aspirator, and remove collection tube with attached inlet tube through the sleeve of the glove box. Expel mosquitoes into a colony cage or mosquito holding carton by inserting the inlet tube through the sleeve of the cage (Figure 8A) or the port of the holding carton (Figure 9) and gently blowing through the collection tube screen (Video 2). For the mosquito colony, all adults, both female and male, are transferred. For experimental use, one male is included for every ten females in the holding carton. Collecting the adults within the glove box provides an opportunity to sort female and males. Males are easily identified because they are smaller than females and have branched and feathery antennae (Figure 11). Before beginning transfer of adults within the glove box, clean the box with 70% ethanol in a spray bottle, wipe down, and allow the fumes to clear.",
    "After transfer is complete, check the glove box for loose mosquitoes and clean the box again. The 70% ethanol will also kill mosquitoes that may have hidden in corners and crevices. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831022849_3756.jpgFigure 8. Mosquito cage front (A) and top (B) viewsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831022916_0854.jpgFigure 9. Mosquito holding cartonsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831022937_1886.jpgFigure 10. Hand-held mosquito aspiratorimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831023010_4255.jpgFigure 11. Male and female mosquitoes Healthy mosquito colonies are maintained by regulating the population size and feeding larvae appropriately. For a 30-cm3 cage, a population of 2,000-3,000 is ideal; low populations result in bottlenecks, and overcrowding can decrease fitness. The population can be estimated by the number of newly emerged adults that are introduced. Place a sugar cube or other source of carbohydrate, such as cotton wad soaked in 10% sucrose, in the nylon feeding hammock on top of the cage and provide water by placing water-soaked white paper towels on the screened top of the cage, keeping them moist with a cotton coil stuffed into a T175 flask filled with deionized water (Figure 8B). Check the water daily (paper towels should be moist), and replace paper towels and cotton coils once every 2 weeks, or sooner if mold develops. Cover the cage with clear plastic to maintain moisture. Clean cages twice per week by removing the paper cage liner, aspirating dead mosquitoes, and replacing with a new liner. Mosquitoes placed in holding cartons are maintained by placing cotton pads soaked in 10% sucrose on the mesh top and covering with a Petri dish cover. The entire mesh top is then covered with plastic wrap and secured with a rubber band. Check the sucrose pads and moisten them daily.Blood feedingOnly female mosquitoes feed on blood, and all female mosquitoes, except those that are autogenous (such as Cx.",
    "pipiens form molestus), must take a blood meal in order to obtain nutrients necessary to develop eggs.For routine maintenance, mosquito colonies should be fed with blood every other week to select for longer-lived mosquitoes. Before feeding, remove the sugar cube and pre-warm a water bath to 45 °C. Prepare the blood meal by mixing 9.5 ml of defibrinated chicken blood (Culex spp.) or sheep blood (Aedes spp.) with 0.5 ml of 50% sucrose in a 15-ml conical centrifuge tube. Cut a 5-7 inch piece of sausage casing. Open the casing and rinse well inside and out. Knot one end and fill with water 3 times to check for leaks. Pour 5-10 ml of prepared blood meal into the casing and knot or tie off the other end (Figure 12). Warm the blood meal by placing the filled casing in a beaker with warm deionized water, and place the beaker in the 45 °C water bath. After 5 min, remove the blood meal, dab excess water on a paper towel, and place it in the feeding hammock of the cage for 1-2 h. After removing the blood meal, clean the hammock and replace the sugar cube. Collect eggs 2-7 days after blood feeding (see step 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170831/20170831023217_2177.jpgFigure 12. Sausage casing before and after filling with blood mealInsectary maintenanceThe temperature should be maintained at 24-28 °C and humidity should be 70-80%, or as high as can be achieved if that is not possible. Floor humidifiers can assist in maintaining humidity; they should be filled daily using deionized water.Room lights should be set to a 16-h light, 8-h dark cycle with 0.5-h crepuscular periods at dawn and dusk. Dawn: 6:00-6:30, Light: 6:30-21:30, Dusk: 21:30-22:00, or set to whatever environment you want to replicate.Clean all flats & lids, emergence jars, aspirator collection tubes, etc.",
    "by soaking for at least 15 min in 10% Bleach. Rinse well. Do not use soap. Make fresh 10% Bleach once per month.Wear gloves when working with mosquito colonies; wash hands.Mosquito cages should be emptied, cleaned with 70% ethanol and autoclaved 1-2 times/year.Complete weekly logs recording egg laying, blood feeding, flats, temperature range, and mosquito fitness.Do not discard live mosquitoes! Freeze adults overnight in mosquito cartons (kill cups: see Note 1) before disposal. Pour contents of containers with larvae or pupae through a fish net into a bucket so that larvae/pupae are trapped on the mesh. Rinse the net with very hot water, then wipe the mesh with paper towel and discard in stock pot. Check the bucket for larvae before discarding in the sink. Run hot water in the sink for several minutes."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}