{
  "id": 3959,
  "origin_website": "Cell",
  "title": "Establishment and Use of Patient-Derived Xenograft Models for Drug Testing in Head and Neck Squamous Cell Carcinoma",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nImplantation of Tumor Pieces\nTiming: ∼2 h\nThis step describes what is required to implant the primary patient samples into NSG mice to establish the patient-derived xenograft (PDX) tumors (Figure 1[href=https://www.wicell.org#fig1], Step 1). Five to ten pieces of the patient tumor are implanted subcutaneously into 5 to 10 mice (1 piece per mouse). Aim for 10 pieces, however, due to small patient samples a smaller number of tumor fragments may have to be implanted.\nNote: This first generation of PDXs (or passage 1, P1) is established to expand the initial tissue so that enough cells can be obtained for further experiments (Figure 1[href=https://www.wicell.org#fig1], Step 2-4). The growth of even 1 of 10 tumors implanted allows for further experiments to be performed. Of course, non-engrafting tumors cannot be tested further.\nCollect the patient tumor tissue from surgical pathology. Place the specimen in a 50 ml conical centrifuge tube containing 20 ml sterile PBS and store on ice until ready to process.\nCritical: The sample should be processed as soon as possible (i.e. within 1–4 h) to preserve cell viability.\nIn a laminar flow hood, place the patient tumor in a small petri dish and under sterile conditions cut into 2 x 2 mm pieces (5 to 10). One piece will be implanted per mouse. Add sterile PBS to the dish to prevent the tissues from drying out, seal the dish with paraffin film and place on ice.",
    "Optional: Extra tumor pieces can be cryopreserved. Place 5 pieces of tumor per cryovial and add 900 μl FBS + 100 μl DMSO to freeze down. Place the vials into a Mr. Frosty and then store the Mr. Frosty in a - 80 °C freezer for a minimum of 4 h. For long term storage transfer the vials into a liquid nitrogen freezer.\nBefore entering the mouse facility, put on personal protective equipment (sterile gown, mask, hair net, and double gloves).\nSpray and wipe down the inside of the biological safety cabinet first with Clidox (1:5:1) followed by 70% Ethanol.\nPlace the dish with the tissue pieces and the required materials in the biological safety cabinet to prepare for surgical implantation (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/68-Fig2.jpg\nFigure 2. Preparation for Surgical Implantation\nAfter disinfecting the biological safety cabinet prepare the following: (a) Isoflurane chamber, (b) electric clippers, (c) sterile gauze sponges, (d) isoflurane tube with nose cone, (e) sterilized surgical instrument pack, (f) sterile ear notcher, (g) autoclip applicator, (h) meloxicam, (i) human patient tumor pieces, (j) ethanol (70%), (k) clidox (1:5:1). Missing in picture but required: surgical scrub betadine, betadine solution, tear gel.\nPlace a warm heating pad under a new clean cage with sterile paper towel on top of the bedding to serve as the recovery cage.\nAnesthetize the mice in an isoflurane chamber using Isoflurane at 5% and an oxygen flow of 1.5 L/minute until breathing reaches thoraco-abdominal region. Reduce anesthetic to 2.5% for the remaining surgical procedure.\nOnce anesthetized, position the mouse in the nose cone in ventral recumbence.\nPlace tear gel in eyes, ear punch mice for identification and use electric clippers to shave the left (or right) flank for implant.\nInject mouse with meloxicam 5 mg/kg subcutaneously for pain management.",
    "Place the mouse back into the induction chamber to clean up shaved hair and area before surgical procedure.\nReplace sterile paper towels under nose cone and lay out sterile paper towels for surgical instruments. Open the sterile pack of instruments described in the “Before you begin” section.\nPosition mouse in the nose cone in ventral recumbence.\nScrub the surgical site with Scrub Surgical Betadine then wipe away surgical scrub with 70% Ethanol.\nSwab surgical site with Betadine Solution and allow it to dry.\nTest that the mouse is in surgical plane by performing a toe pinch. This is done by taking the toes of the back foot of the mouse and pinching between your thumb and index finger. The mouse should not retract its leg once it has reached surgical plane.\nNote: See Video S1[href=https://www.wicell.org#mmc1] for step 17 to 20\n        Your browser does not support HTML5 video.\n      \nVideo S1. Implantation of Tumor Pieces (Steps 17-20)\nThis video demonstrates where an incision is made in the mouse, a ‘pocket’ is formed, the piece is implanted, and the incision is closed by an autoclip staple.\nAt a 45-degree angle to the midline, with the scissors, make a 0.5 cm incision halfway between the knee and spine.\nPull up the cut skin using curved specimen forceps with one hand and use straight specimen forceps to blunt dissect the skin away from the abdominal wall towards the leg to form a pocket (See Video S1[href=https://www.wicell.org#mmc1])\nUsing the same straight forceps place the tumor fragment into the pocket. Make sure the tumor goes into the pocket as it can slip out. Use the curved forceps to bring the cut skin back together.\nStaple the opposed wound edges using the Autoclip staple applicator.\nPlace the mouse in recovery cage until fully mobile.",
    "Check the mice the following day to ensure staples are intact.\nRemove staples using the Autoclip removal forceps 7-10 days after surgery.\nPalpate for tumor growth after 2 weeks and up to 6 months.\nEnd point is either 6 months if NO tumor is palpable or once the xenograft tumor reaches the maximum size allowed (15 mm in diameter or 1, 755 mm3) (Figure 3[href=https://www.wicell.org#fig3]). The mouse must be euthanized, and the tumor extracted in a laminar flow hood under sterile conditions. See Step 2 for tumor extraction.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/68-Fig3.jpg\nFigure 3. Patient-derived Xenograft Tumor\nAt endpoint, the mouse is euthanized, and the tumor is extracted under sterile conditions.\nExtraction and Dissociation of PDX Tumor into a Single-Cell Suspension\nTiming: ∼ 5 h\nThis section describes the steps for extraction, viable tissue banking/cryopreservation and dissociation of the PDX tumor into a single cell suspension (Figure 1[href=https://www.wicell.org#fig1], Step 2).\nOnce the tumor reaches the maximum size allowed (15 mm in diameter or 1, 755 mm3) (Figure 3[href=https://www.wicell.org#fig3]), euthanize the mouse and extract the tumor in a laminar flow hood under sterile conditions\nPlace the tumor in a 15 ml conical centrifuge tube containing sterile PBS and place on ice.\nCritical: Dissociation of fresh tissue immediately after extraction results in optimal tumor cell viability. Keep tumor on ice or in fridge until ready to process.\nOptional: While not recommended, in cases where the tumor cannot be processed immediately, it can be stored at 4°C for up to 24 h and processed the next day.\nIn a laminar flow hood use sterile forceps to transfer the sample into a 10 cm petri dish.\nCritical: The sample size should be no bigger than 1, 755mm3 per 10 ml of 1X dissociation solution in a 10 cm plate to ensure efficient dissociation.",
    "Optional: Multiple tumors from the same PDX model (i.e. PDX tumors derived from the same patient sample; recall up to 5 to 10 mice were implanted) can be dissociated separately and then pooled together at the end if higher cell numbers are required.\nOptional: PDX tumor pieces (Passage 1, P1) can be viably banked by placing 5 pieces per cryovial (900 μl FBS + 100 μl DMSO). Place the vials into a Mr. Frosty and then store the Mr. Frosty in a -80°C freezer for a minimum of 4 hours. For long term storage transfer the vials into a liquid nitrogen freezer.\nNote: For steps 29-38, see Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/68-Fig4.jpg\nFigure 4. Dissociation Steps for Solid Tumor into a Single Cell Suspension\nA tumor piece of ∼1 cm3 or smaller is placed in a sterile 10 cm petri dish and cut into smaller pieces and then minced finely. Digestion solution (10 ml) is added to the minced tissue and incubated in the tissue culture incubator (37°C) for up to 3 hours. Every 15 min pipette the mixture to facilitate the digestion. Once the dissociation is complete transfer the digested solution through the 70 μm strainer into a 50 ml conical tube and wash with fresh 10 ml IMDM (+10 % FBS). Pellet, use lysing-buffer (ACK) to degrade red blood cells, wash and pellet. Pellet can be used immediately or cryopreserved.\nUse a sterile scalpel to cut the tumor into smaller pieces and then mince using a sterile razor blade.\nAdd 10 ml of the 1X dissociation solution. Agitate the dish gently by moving it side to side, back and forth to mix the minced tissue with the dissociation solution. Place the plate with the tumor mixture in a tissue culture incubator (at 37°C, 5 % CO2) for 15 min.",
    "Critical: FBS should NOT be included in the 1X dissociation solution as FBS inhibits dissociation.\nGently pipette the mixture up and down several times using a 25 ml and then a 10 ml serological pipette to aid in the dissociation process and place it back into the incubator.\nPipette every 15 min for up to 3 hours until a homogenous solution is obtained.\nCritical: If the tissue is very fibrous, there may be some small tissue pieces remaining. Do not incubate the tissue longer than 3 h as cell viability decreases with prolonged dissociation.\nOnce the dissociation is complete, place a 70 μm strainer into a 50 ml conical tube and pass the 10 ml of cell suspension through the strainer.\nWash the strainer by adding 10 ml of IMDM (+ 10 % FBS).\nCentrifuge the collected strained suspension of cells 300 x g  for 5 min to pellet the cells. Aspirate the media.\nAdd 1 ml of cold Ammonium-Chloride-Potassium (ACK) lysing buffer (to lyse the red blood cells) and incubate no more than 5 min on ice.\nCritical: Do not incubate cells with ACK lysing buffer for more than 5 min as it will negatively affect the viability of tumor cells.\nAdd 10 ml of PBS to wash and centrifuge again 300 x g for 5 min. Aspirate the PBS.\nResuspend the cell pellet in 10 ml of PBS and count the number of viable cells using Trypan Blue.\nThe cells are now ready for injection into mice (Step 3) OR for cryopreservation for storage.",
    "For cryopreservation, resuspend up to 10 x 106 viably counted cells in 900 μl FBS + 100 μl DMSO per cryovial and freeze down. Place the vials into a Mr. Frosty and then store the Mr. Frosty in a - 80°C freezer for a minimum of 4 hours. For long term storage transfer the vials into a liquid nitrogen freezer.\nPause Point: Bulk suspensions can be cryopreserved, however upon thawing, cell viability can decrease up to 50% and this varies between tumor samples. Be sure to count viable cells when frozen vials are thawed for recovery. Alternatively, proceed directly to injection of bulk suspensions to avoid freezing/thawing.\nInjection of Bulk Tumor Single-Cell Suspension into NSG Mice\nTiming: ∼ 2-3 h\nThis section describes the steps for preparation and injection of bulk tumor cells into a large cohort of mice (Figure 1[href=https://www.wicell.org#fig1]). Injecting a bulk cell suspension (rather than implanting pieces) allows for a more even distribution of tumor cells into each mouse and thus allows for a similar growth rate of tumors across all the mice. The following steps were used to establish the cohorts of mice from our recent publication that were treated with abemaciclib (Karamboulas et al, 2018[href=https://www.wicell.org#bib3]).\nPrepare a bulk suspension of fresh tumor cells or thaw a vial of previously cryopreserved cells.\nCount the total number of cells suspended in PBS and determine the number of cells to inject per mouse for a group of at least 10 mice. Typically, between 100, 000 to 250, 000 cells are enough to ensure engraftment across all mice and to produce an even growth rate. (However, some tumors may require higher cell numbers (i.e. 400, 000 to 500, 000).",
    "Critical: Preparation of larger cohorts of mice is suggested when possible depending on the number of cells available to ensure the sample size per treatment group is large enough to distinguish small changes in mean tumor volume between groups.\nCold Matrigel matrix will be mixed at a 1:1 ratio with cell suspension in cold PBS.\nNote: Matrigel matrix contains extracellular matrix components that allow for the cells to remain localized at the injection site.\nCritical: It is essential that the cell/Matrigel mixture be kept cool on ice as Matrigel forms a gel above 10°C.\nvolume of 100 μl total (50 μl Matrigel + 50 μl cell suspension) is injected per mouse.\nPrepare the cells plus Matrigel for all 10 injections in one tube in order to reduce variation from mouse to mouse. Be sure to prepare a few extra doses due to loss of sample in the needle hub.\nBefore filling the 1 ml (26-gauge needle) syringe, ensure Matrigel plus cells are mixed well by tapping the tube and/or inverting it a few times. Keep on ice.\nCritical: It is essential to thoroughly mix the cold cell/Matrigel mixture immediately before injections to ensure even distribution of cells as they will settle to bottom of tube.\nFill the syringe with cell/Matrigel mixture at the time the mice are ready to be injected. If the syringe is prepared with the cell/Matrigel mixture too far in advance, the cells will start to settle in the syringe and can get trapped inside the hub. It is critical to add the cell/Matrigel mixture right before you are ready to inject to ensure that the cells are evenly distributed in the syringe and that each mouse is injected with an equal number of cells.",
    "Wet a sterile gauze sponge with 70 % ethanol. Place the sponge on the floor of the laminar hood and gently drag the needle across the sponge to wipe off excess cells on the outside before proceeding with injection.\nHold the mouse in an Intraperitoneal (IP) hold and subcutaneously inject 100 μl into the left flank of each mouse.\nEar notch each mouse to identify.\nDrug Treatment of PDX Cohorts\nTiming: ∼2 h\nThis section describes the steps that were used to treat HNSCC-PDX mice with abemaciclib (LY2835219) in our recent paper (Figure 1[href=https://www.wicell.org#fig1]). This protocol can be used for treating with other drugs of interest, using the appropriate vehicle, dose and delivery route that is appropriate.\nMonitor the tumor growth of each mouse.\nUsing calipers measure and record the measurements for each tumor (length and width, mm).\nVolume = (L x W2) ∗ 0.52\nTreatment will begin when the volumes of the tumors reach approximately 80 to 120mm3\nCritical: It is important that all tumors are approximately of similar volume.\nRandomize the ten mice into two groups of 5 (Drug (abemaciclib) (5) vs Vehicle Control (sterile milli-q water) (5)).\nWeigh each mouse before treatment starts to determine the volume of abemaciclib to administer so that each mouse is receiving 100 mg/kg. Use this volume until the end of treatment.\nNote: Working concentrations should be determined such that you are administering an appropriate volume based on the method of delivery. Oral gavage is limited to 1% volume of total body weight, e.g., a 20 g mouse is given a maximum of 0.2 ml.",
    "The working concentration of drug must take into account the volume of drug that can be delivered safely. In our case, we used a working stock concentration of 25 mg/ml which gave a range of 70 - 130 μl depending on the body weight of the animal.\nExample calculation:\n0.025 kg (body weight of mouse) x 100 mg/kg (dose) x 1 ml/25 mg = 0.1 ml volume of drug\nMice are treated daily with abemaciclib or sterile water by oral gavage/feeding tubes and measurements are recorded twice a week (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/68-Fig5.jpg\nFigure 5. Record of Tumor Measurements during Treatment Study and Analysis\nAn example of a spreadsheet used to record tumor sizes with a caliper (LXW) during Abemaciclib study (A). At the end of the study a growth curve is generated (B) and average tumor weight is calculated (C).\nTreatment ends once the tumors in the control group reach the humane endpoint size of 1755 mm3 in volume and mice are euthanized.\nExtract tumors and weigh each for an endpoint weight (Figure 5[href=https://www.wicell.org#fig5]A).\nSee the “Quantification and Statistical Analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]” section for more detail into the analysis of the results between the two groups (Abemaciclib vs Control)."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Model Organisms",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}