{
  "id": 19758,
  "origin_website": "Wiley",
  "title": "Panel Optimization for High-Dimensional Immunophenotyping Assays Using Full-Spectrum Flow Cytometry",
  "procedures": [
    "This protocol is divided in two sections. The first is for preparation of SRCs and ensures generation of the high-quality controls required for accurate unmixing. The steps describe the staining of polystyrene compensation beads and cryopreserved PBMCs with surface-labeling antibodies. They can be adapted for other tissues or staining procedures such as intracellular staining. It is important to mention that the preparation procedure will also guide users to prepare a fully stained (FS) sample and fluorescence minus one (FMO) controls as the protocols are very similar; these will be used later for evaluating the unmixing of the FS sample (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004]). If preferred, FS and FMO samples can be stained separately, but treatment of samples should be kept identical. Importantly, to successfully complete this protocol, SS and FS cells should also be treated the same (antibody concentration, incubation time/temperature, fixed/unfixed, etc.).\nThe second section of the protocol is for evaluation. This aims first to check the quality of the acquired SRCs and then to evaluate whether there are any spectral mismatches between beads and cells for each fluorophore, which is accomplished by assessing how well the beads unmix the cells using N × N plots for all markers. Unmixing accuracy must be assessed on the actual sample (cells) to be used in the assay. In some cases beads will be acceptable as SRCs and in other cases it may be necessary to use cells. When this protocol is completed, the optimum SRCs (cells or beads) will be determined for future unmixing. If desired, well-characterized and high-quality controls can be stored for future use.\nMaterials\nCryopreserved PBMCs\nPhosphate-buffered saline (PBS; Gibco, cat. no. 14190-250)\nFetal bovine serum (FBS; Gibco, cat. no. 10091-148)\nPolystyrene compensation beads (e.g., UltraComp eBeads, Life Technologies, cat. no. 01-222-42)",
    "FACS staining buffer: PBS with 2% bovine serum albumin (BSA; MP Biochemicals, CAS no. 9048-46-8) and 0.2% sodium azide (Sigma-Aldrich, cat. no. S8032)\nZombie NIR Fixable Viability Kit (BioLegend, cat. no. 423106)\nHuman TruStain FcX (Fc Receptor Blocking Solution; BioLegend, cat. no. 422301)\nAntibodies (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-tbl-0001] for list; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0002] for titration)\nBrilliant Stain Buffer Plus (BD Biosciences, cat. no. 566385)\n37°C water bath (e.g., Julabo Ecotemp TW12)\nHemocytometer (e.g., Hawksley Counting Chamber) and coverslips\n96-well U-bottom plate (In Vitro Technologies, cat. no. 353077)\nFilters with 0.65-μm or smaller pore size (optional)\nSpectral cytometer (e.g., Cytek Aurora)\n5-ml polypropylene round-bottom flow tubes (In Vitro Technologies, cat. no. 352008)\nCytek SpectroFlo software\nData analysis software for analyzing FCS files (e.g., FlowJo or FCS Express)\nTable 1.\n                Antibodies Used in Example Spectral Flow Cytometry Panel\ntable:\n﻿Fluorophore,Marker,Supplier,Clone,Catalog number,Concentration (mg/ml)\nBUV395,HLA-DR,BD Biosciences,G46-6,564040,1.0\nBUV496,CD3,BD Biosciences,UCHT1,612940,1.0\nBUV563,CD27,BD Biosciences,M-T271,741336,1.0\nBUV737,CD45RA,BD Biosciences,HI100,612846,1.25\nBV421,CD28,BioLegend,CD28.2,302930,2.0\nPacific Blue,CRTH2 (CD294),BioLegend,BM16,350130,8.0\nBV480,CD127,BD Biosciences,HIL-7R-M21,566101,2.0\nBV510,TCRgd,BioLegend,B1,331220,15.0\nBV570,CD4,BioLegend,RPA-T4,300534,1.0\nBV605,CCR4 (CD194),BioLegend,L291H4,359418,0.6\nBV650,CCR6 (CD196),BD Biosciences,11A9,563922,1.0\nBV785,CD45RO,BioLegend,UCHL1,304234,1.0\nBB515,CD25,BD Biosciences,2A3,564467,8.3\nAF488,CCR10,R&D Systems,314305,RDSFAB3478G 0100,0.13\nAF532,CD8,Thermo Fisher Scientific,RPA-T8,58-0088-42,0.25\nPerCP-Cy5.5,CCR7,BioLegend,G043H7,353220,4.0\nPE,Hu CD1d tetramer,NIH Tetramer Core Facility,PBS-57 loaded,,0.81\nPE-CF594,PLZF,BD Biosciences,R17-809,565738,0.63\nPE-Cy7,CTLA4,eBioscience (TFS),14D3,25-1529-42,0.2\nAPC,Hu MR1 tetramer,NIH Tetramer Core Facility,5-OP-RU loaded,,0.18\nAF647,FoxP3,BioLegend,259D,320214,0.6\nAPC-Cy7,CXCR3 (CD183),Biolegend,49801.111,353722,0.13\nBV711,CD19,BD Biosciences,SJ25C1,563036,0.25\nPrepare and acquire samples\n1. Thaw PBMCs quickly in a 37°C water bath and add to 5 ml PBS with 2% FBS.\nAs the thawing procedure can be critical, we recommend user-specific optimizations to ensure high sample viability (>80%) (Disis, dela Rosa, Goodell, & Ling-Yu, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0006]).\nCAUTION: Steps 1-2 should be performed in a biosafety hood.\n2. Centrifuge 5 min at 500 × g, room temperature, and carefully flick off the supernatant.\n3. Resuspend cells in PBS with 2% FBS and count viable cells on a hemocytometer.\n4. Centrifuge as before and carefully flick off the supernatant.",
    "5. Resuspend cells in PBS with 2% FBS to a concentration of 5 × 106 viable cells/ml.\n6. Distribute 100 μl suspension per well of a 96-well U-bottom plate, allocating one well per fluorophore in the panel and one well for an unstained sample.\nA FS sample and appropriate FMO controls can be added but are not required for assessing the SRCs at this point. They will be used for assessing unmixing in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004].\nThe number of cells required will differ by tissue type; for PBMCs, ∼5 × 105 cells is sufficient.\n7. Add one drop of vortexed compensation beads plus 150 μl FACs staining buffer to a second set of wells, allocating one well per fluorophore in the panel except the viability dye.\nFigure 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002] shows a typical plate layout. At this stage, the plate should contain unstained and FS sample wells (fully stained beads are not needed) plus two wells per fluorophore in the panel: one with cells and the other with compensation beads (except for the live/dead reagent, which is typically only used on cells). FMO controls should also be included for fluorophores where marker expression is very low or where the positive population is dim and gate placement would be subjective.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ac8eb670-1fad-444d-a00a-f690194d6e94/cpz1222-fig-0002-m.jpg</p>\nFigure 2",
    "Evaluation of SRCs and selection of optimal control type. (A) Example plate plan. Shaded wells contain cells and unshaded wells contain compensation beads. (B) Expert gating of cells of interest and doublet exclusion plots. A well-optimized ASF can be visualized in the second pseudoplot. (C) BUV395 bead SRC gating of positive and negative populations and spectral signatures of gated events showing clear positive and negative signals. (D) SS cells unmixed with either BV711 CD19-stained compensation beads (top) or cells (bottom). Unmixing of BV711 CD19 is incorrect against certain parameters (e.g., Pacific Blue CRTH2) but not others (e.g., BUV496 CD3) when beads are used. This error is corrected through unmixing with cells with no negative impact to the plot with previously correct unmixing. Red line indicates equal median fluorescence intensity (MdFI) between positive and negative populations. (E) Comparison of brightness achieved using SS cells versus beads and the FS sample for BUV395 HLA-DR. Black line shows the maximum fluorescence of positive stained cells. In this example, cells should be used for unmixing as they are brighter than the beads. (F) Comparison of brightness achieved using SS cells versus beads as compared to the FS sample for PE-CF594 PLZF. In this example, beads are brighter than cells and should be used for unmixing. Black line shows the maximum fluorescence of positive stained beads is brighter than the FS sample. (G) Final decision of optimal SRCs (cells or beads) used for unmixing the panel.\n8. Centrifuge plate 5 min at 500 × g, 4°C, and flick off the supernatant.\nIt is recommended to centrifuge samples at 4°C to maintain high viability, but room temperature is acceptable if a refrigerated centrifuge is not available.",
    "9. Prepare viability stain in PBS according to the titration result (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0002]) and add 100 μl to the live/dead cell control and FS sample, if included. Resuspend remaining wells with 100 μl PBS. Incubate for 15-30 min at room temperature, protected from light.\n10. Centrifuge as above and flick off the supernatant.\n11. Block Fc receptors of the cell samples using 100 μl of 1:40 Fc block in FACS staining buffer. Add an equal volume of FACS staining buffer to the beads. Incubate for 10 min at 4°C.\nFc block should not be used on compensation beads, as all antibody binding sites will become occupied.\n12. Centrifuge as above and flick off the supernatant.\n13. Remove aggregates from antibody stocks by centrifuging 5 min at 16,000-18,000 × g, 4°C (Aass et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0001]; Ayers et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0003]; van der Vlist, Nolte-’t Hoen, Stoorvogel, Arkesteijn, & Wauben, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0025]) and/or by filtering using a pore size of 0.1-0.65 μm (Inglis et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0010]).\n14. Prepare SS, FS, and FMO control antibody mixes by diluting stocks in FACS staining buffer according to titration results (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0002]). Be sure to pipette from the top of the liquid to avoid centrifuged aggregates.",
    "Prepare enough volume of each antibody mix that two samples can be stained from the same mix. This will reduce differences due to antibody preparation when comparing bead versus cell SRCs. Allow for pipetting errors by making excess antibody mix (e.g., n + 1). Additionally, when more than one Brilliant polymer dye is used at the same time (FS and FMOs), Brilliant Stain Buffer Plus (or equivalent) should be added per manufacturer's instructions to decrease interaction between the dyes. Do not add Brilliant Stain Buffer Plus to compensation beads, as it is known to alter the spectral profile of some beads (Ferrer-Font, Pellefigues, et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0009]).\n15. Stain all cells and beads with 100 μl of the appropriate antibody mix and incubate in the dark using the incubation time and temperature that will be used in the final assay.\n16. Centrifuge as above and flick off the supernatant.\n17. Wash twice with 200 μl FACS staining buffer, centrifuging again after each wash.\nAt this stage, cells may be fixed (e.g., 1% paraformaldehyde) if required for biosafety or sample longevity. If cells are fixed, beads must also be fixed to ensure equal treatment of fluorophores and to mimic any change to the spectral signature caused by fixation. The fixative must be removed by washing twice with FACS staining buffer before acquisition.\n18. Resuspend in 200 μl FACS staining buffer.\n19. Acquire on a Cytek Aurora, taking care to meet the following acquisition criteria:\n         \nCytek assay settings are used as a starting point for instrument setup.\nThe scatter profiles of cells and beads are on scale and the FSC area scaling factor (ASF) is optimized (see example in Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002]).",
    "All fluorescence signals are on scale (<4 × 106). This can be assessed in the full-spectrum plot or in individual plots for every detector.\nAll tubes are recorded with the same fluorescence gain settings for each detector.\nSufficient events are recorded to find a clear positive signal.\nA minimum of 300 events is needed for each positive and negative population. A good starting point is 5000 total events for beads and 30,000-50,000 total events for cell controls, although it may be necessary to record >50,000 cells to get at least 300 positive events of similar fluorescence intensity for rare markers.\nEvaluate results (see Video 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002a])\n20. In the SpectroFlo software, check the raw reference control data and verify that the acquisition criteria in the previous steps have been met:\n         \nThe scatter profiles of the cells and beads are on-scale, clean, and easily gated, and the FSC ASF has been optimized (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002]).\nCytek assay settings or a close alteration (also see Critical Parameters discussion of Complex Samples and see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0003]) have been used, and all tubes have been recorded with the same settings.\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/657d968c-8dd4-4e5f-8f5c-21334a3e6fda/cpz1222-vid-0001.mp4]\nVideo\nEvaluation of optimal spectral reference controls (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001]).\n21. Ensure that the unstained sample has no contamination from other fluorophores.\nUnstained cells often have AF signal in the detectors off the UV and violet lasers, which should not be mistaken for contamination.\n22. In the SpectroFlo software, step through the Unmixing Wizard and select beads for all SRCs except for unstained and viability controls.\n23. Accurately place positive and negative gates for unmixing.",
    "When setting scatter gates on bead SRCs, it is common to see singlet and doublet populations. Set the scatter gate on the smaller-sized (lower FSC) or more abundant singlet population. Beads should show little variability in staining level when prepared as described above, and thus the positive gate may include the complete positive bead population. If multiple peaks are seen, verify that they are not contaminating fluorophores or sample carryover, and optimize the staining procedure where needed to achieve homogenous staining intensity across all positive beads.\n24. Perform quality control (QC) of all spectral signatures by verifying the following criteria:\n         \nThe peak channel matches that defined in Cytek's Full Spectrum Viewer (spectrum.cytekbio.com).\nThe spectral signature appears as expected based on Cytek's Full Spectrum Viewer, published Cytek fluorophore guidelines, or historical data.\nEach channel contains a tight population of events.\nAll fluorescent signals are on-scale (<4 × 106). This can be assessed in the full-spectrum plot or in individual plots for every detector.\nSufficient events have been recorded to find a clear positive signal.\n25. Iterating through each fluorophore, place the positive gate over the negative population to verify that there is no fluorophore contamination (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002]).\n26. Under the QC Controls tab, check Similarity Indices to ensure all spectral signatures are unique (i.e., all values within the matrix are ≤0.98).\n27. Select the Live Unmix button to generate unmixed FCS files.\n28. Create N × N plots on an unmixed worksheet (e.g., using software such as FlowJo or FCS Express).\n         \nCreate as many pseudocolor or dot plots as there are fluorophores in the panel.\nEnsure all x axes are set to the same fluorophore.\nSet each y axis to a different fluorophore in the panel.\nChange the x and y axes from manual scaling to autoscaling in the plot properties.",
    "Save this workspace as a template for use in later protocol steps.\n29. Select the first SS cell sample.\n30. Select all N × N plots. Then, in the Plot Properties window, change the x-axis option to the fluorophore matching the selected sample so all plots change simultaneously.\n31. Evaluate the unmixing accuracy of the marker on the x axis by visually inspecting whether the positive and negative populations are well aligned horizontally along the x axis. If unmixing errors are seen in the N × N matrix plots (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002], top), make a note of which control was being viewed.\n32. Repeat steps 29-31 until the unmixing of all fluorophores has been evaluated.\n33. Note which fluorophores require cells to be used for the SRC (i.e., those with identified unmixing errors in step 31). All other controls can remain as beads.\nThe most likely explanation for bead SRCs not unmixing the cell SRCs correctly is that the signature of the fluorophore on the beads did not match that of the cells. This phenomenon is known to happen but cannot be easily predicted. Another possible cause is that the bead SRC is dimmer than the cell SRC (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002],F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002]). If all recommendations for treatment of SS cells have been followed (i.e., identical treatment to FS cells, use of the same number of cells), then the cell SRC should have identical brightness to the FS cells and thus be an appropriate control.\n34. Go through the Unmixing Wizard a second time using the controls identified in step 33 as the optimal controls. Unmix again using live unmixing.\n35. Follow steps 23-26 for the modified controls to ensure the best unmixing outcome is achieved.",
    "When setting gates using cells as SRCs, the scatter gate should be placed only on the cells expressing the marker of interest for each control. In cases where there is no negative staining in this population, a universal negative may be used as a surrogate. To ensure the observed negative signal is due to AF rather than contamination, compare it to the matching unstained tube.\n36. Repeat steps 29-32 to evaluate the new unmixing for the fluorophores that did not unmix optimally before (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002], bottom) and note which fluorophores require cells or beads to be used for the SRC (Fig. 2G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0002]).\nEven with high-quality reference controls, unmixing errors may arise if incorrect gates are used in the Unmixing Wizard or if the spectral signatures have mismatches (see troubleshooting Tables 2-5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-tbl-0002] for more potential issues and how to fix them).",
    "Antibody titration is the crucial first step in developing high-dimensional flow cytometry panels. Using the incorrect antibody concentration can increase spread, decrease resolution, increase aggregation of reagents, and give rise to nonspecific binding (Stewart & Stewart, 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0023]), all of which result in poor panel performance and/or inaccurate results. Ideally, titrations should be carried out in the tissue that will be used in the assay. This is not always feasible, however, if the tissue in question is rare or difficult to work with, or the cells of interest are found at low frequencies within the tissue. In such cases, it is suggested to first add a lineage marker to the mix to help identify the cells that express the rarer marker or to use a surrogate tissue in which the marker is more abundant and simpler to process. Results from this type of titration should always be validated using the tissue of interest.\nIt is important that readout functional markers are titrated under the maximally activated conditions that will be used in the assay. Staining conditions should also be identical between titration and experiment to prevent spectral pattern mismatches and poor unmixing results.\nThis protocol describes the preparation of cryopreserved peripheral blood mononuclear cells (PBMCs) for titration of extracellular antibodies. It can be easily adapted and used as a general guideline for antibody titration using other tissues or staining procedures.\nMaterials\nCryopreserved PBMCs\nPhosphate-buffered saline (PBS; Gibco, cat. no. 14190-250)\nFetal bovine serum (FBS; Gibco, cat. no. 10091-148)\nZombie NIR Fixable Viability Kit (BioLegend, cat. no. 423106)\nHuman TruStain FcX (Fc Receptor Blocking Solution; BioLegend, cat. no. 422301)\nPolystyrene compensation beads (e.g., UltraComp eBeads, Life Technologies, cat. no. 01-222-42)\nAntibodies (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-tbl-0001])",
    "FACS staining buffer: PBS with 2% bovine serum albumin (BSA; MP Biochemicals, CAS no. 9048-46-8) and 0.2% sodium azide (Sigma-Aldrich, cat. no. S8032)\n37°C water bath (e.g., Julabo Ecotemp TW12)\nHemocytometer (e.g., Hawksley Counting Chamber) and coverslips\n96-well U-bottom plate (In Vitro Technologies, cat. no. 353077)\nFilters with 0.65-μm or smaller pore size (optional)\nSpectral cytometer (e.g., Cytek Aurora)\n5-ml polypropylene round-bottom flow tubes (In Vitro Technologies, cat. no. 352008)\nData analysis software for analyzing FCS files (e.g., FlowJo or FCS Express)\nPrepare and acquire samples\n1. Thaw PBMCs quickly in a 37°C water bath and add to 5 ml PBS with 2% FBS.\nCAUTION: Steps 1-2 should be performed in a biosafety hood.\n2. Centrifuge 5 min at 500 × g, room temperature, and carefully flick off the supernatant.\n3. Resuspend cells in PBS with 2% FBS and count on a hemocytometer.\n4. Centrifuge as before and carefully flick off the supernatant.\n5. Resuspend cells in PBS with 2% FBS to a concentration of 5 × 106 cells/ml.\n6. Distribute 100 μl suspension per well of a 96-well U-bottom plate, allocating six wells to each antibody being titrated. Include additional wells for unstained and live/dead controls (see example plate plan in Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0003]).\nThe number of titer points is based on the range of concentrations being tested. The number of cells required will differ by tissue type; for PBMCs, ∼5 × 105 cells is sufficient.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/86eaf6c4-ee62-4afd-8633-0c717157306a/cpz1222-fig-0003-m.jpg</p>\nFigure 3",
    "Antibody titration. Example titration of 1:2 serial dilutions for a range of marker subtypes, showing both concatenated flow cytometry data files and the calculated SI. The final dilution selected for the panel is indicated by black boxes. (A) Example plate layout. (B) T-cell co-receptor CD4 conjugated to BV570. (C) Transcription factor PLZF conjugated to PE-CF594. (D) Activation marker CTLA-4 conjugated to PE-Cy7 on cells with and without PHA stimulation (5 μg/ml, 2 days).\n7. Centrifuge plate 5 min at 500 × g, 4°C, and flick off the supernatant.\n8. Stain titration samples and live/dead controls with a viability dye that will not cause significant spillover into the fluorophore being titrated.\nViability dyes should also be titrated for use in high-dimensional spectral cytometry panels. When titrating a viability dye, skip steps 8-12 for that sample only (adding PBS instead if other samples are being processed simultaneously). If the viability dye has not yet been titrated, follow manufacturer guidelines for concentration and incubation procedures.\n9. Centrifuge as above and flick off the supernatant.\n10. Block Fc receptors by applying 100 μl of a 1:40 dilution of Human TruStain FcX and incubating 10 min at 4°C.\n11. Add one drop of vortexed compensation beads per well for the appropriate single stain (SS) controls.\n12. Centrifuge as above and flick off the supernatant.\n13. Remove aggregates from antibody stocks by centrifuging the vials 5 min at 16,000-18,000 × g, 4°C, or by filtering using a pore size of 0.65 μm or smaller.\n14. Create a dilution series for each antibody being titrated by diluting stock solutions in FACS staining buffer. Be sure to pipette from the top of the liquid to avoid the spun-down aggregates.",
    "A suggested dilution series is 1:50, 1:100, 1:200, 1:400, 1:800, 1:1600. This series is broad enough to ensure the likelihood of finding the optimal titer for a range of antibodies. For ease of preparation, concentrations are listed here only in terms of their dilution from stock; actual concentrations (in mg/ml) should be calculated once a titer is selected.\n15. Add 100 μl of each antibody dilution to the corresponding sample in the plate. Add FACS staining buffer to unstained and live/dead controls. For compensation beads, use 100 μl of the 1:100 dilution.\nThe dilution used for compensation beads should not fall off-scale when using Cytek assay settings, but should be brighter than the samples. A 1:100 dilution is a good starting point, but a lower dilution can be used if some antibodies are too bright.\n16. Incubate using the time and temperature that will be used in the final assay.\n17. Centrifuge as above and flick off the supernatant.\n18. Wash twice with 200 μl FACS staining buffer.\nIf fixation will be used for the final samples, titrations should also be determined using fixed samples. For additional details, see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001], step 17.\n19. Resuspend in 200 μl FACS staining buffer and acquire on a Cytek Aurora using Cytek assay settings.\nAnalyze data\n20. Open titration samples in a data analysis software used for analyzing FCS files.\n21. Generate median fluorescence intensity (MdFI) values for the positive and negative populations for each concentration.\n22. Generate standard deviation (SD) values for the negative population for each concentration.\n23. Calculate the stain index (SI) using the equation SI = (MdnFIpos – MdnFIneg) / (2 × SDneg).",
    "The stain index is a very useful metric of resolution, with a higher value indicating greater resolution. If a lower concentration of antibody produces a reduced positive population MdnFI compared to a higher concentration with no change to the negative population, its stain index is going to decrease, as the separation between the positive and negative populations will be reduced (see example in Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0003]). If a higher concentration of antibody gives rise to a similar positive population MdnFI compared to a lower concentration, but has a larger SD of the negative population, its stain index is going to be decreased, as spreading of the negative population reduces the resolution from the positive (see example in Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0003]).\n24. Select the concentration that gives rise to the best stain index without giving rise to a positive shift of the negative population.\nSuch a shift is best visualized by concatenating all FCS files and displaying them on a single plot (as shown in in Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0003]-D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0003]).",
    "In some cases an adjustment of fluorescent gain settings away from the optimized settings cannot be avoided, for instance, if a bright reporter protein (e.g., eGFP) is off-scale. Such adjustments must be carried out carefully to minimize impact on all spectral signatures within the panel. Adjustments can be made detector by detector or to a whole detector array at one time, where all detectors of a given laser line are changed simultaneously. Reduction of the whole array is the recommended approach, as manual alteration of single detectors is prone to distortion of spectral signatures, where the ratio of brightness from detector to detector is not maintained. Regardless, reducing whole detector arrays can lead to peak emissions of spectral signatures being shifted to an incorrect detector (potentially on a different laser line). Therefore, all changes must be checked to ensure that signatures remain as expected based on Cytek's Full Spectrum Viewer, published fluorophore guidelines, or historical data.\n1. Observe which fluorescent channel(s) has an off-scale signal.\n2. Use trial and error to determine the gain setting that is appropriate to bring the emission peak on-scale (i.e., <4 × 106 on the Aurora).\nRemember that gain and fluorescence have a linear relationship, so that a 50% reduction in gain will give rise to a 50% reduction in fluorescence signal.\n3. Reduce secondary detector arrays with off-scale signals by the same percentage as the reduction made in step 2.\n4. Use Cytek's Full Spectrum Viewer, published fluorophore guidelines, or historical data to check that the altered spectral signature retains the correct overall pattern and that the primary emission peak has not been reduced below any secondary emission peaks.",
    "If the overall pattern is correct, no further steps are required. Record all samples at these adjusted settings. If the overall pattern is not correct, continue to step 5.\n5. If adjustments to other laser lines are required, continue reducing the respective detector arrays by the same percentage as in step 2.\n6. Repeat steps 4 and 5 until the spectral signature appears as expected or all arrays have been reduced by the same percentage.\n7. Record all samples at the adjusted settings.",
    "Before any analysis can be undertaken, the FS sample must be checked to ensure that clean data can be obtained through removal of artefacts such as doublets, dead cells, and aggregates. It is also necessary to verify that there is positive staining for all markers in the panel, taking into consideration the biology of each marker. Once this has been asserted, it must be determined whether the SRCs selected (either beads or cells) successfully unmix the SS cells in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001] can also be used to successfully unmix the FS sample (Video 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0003a]).\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/666e7348-439f-43c8-a38a-b8f60fcdd95c/cpz1222-vid-0002.mp4]\nVideo\nUnmixing evaluation of fully stained sample (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004]).\nMaterials\nCytek SpectroFlo software\nFCS files generated in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001]\nN × N worksheet template\n1. In the SpectroFlo software, work through the Unmixing Wizard and select the SRCs chosen from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001].\n2. In the unmixed workspace, gate on time to remove any events collected during an unstable flow period by plotting time vs. scatter (e.g., FSC-A or FSC-H; Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7488de5c-ef2b-4b34-866e-adfd4a6208b6/cpz1222-fig-0004-m.jpg</p>\nFigure 4\nInspection of the FS sample. (A) Gating strategy to gate out inconsistent flow rate events (time gate), doublets, and dead cells and include only cells of interest (lymphocytes). (B) Example of aggregates and how to gate them out. (C) Dot plots of SSC-A vs. each marker in the panel. (D) Dot plots of SSC-A vs. rare/dim markers in the panel, overlaid with FMO controls to show true positive events. (E) N × N matrix used to evaluate marker positivity from core panel iteration unmixed using beads (left) or cells (right).\n3. Gate out doublets by sequentially plotting FSC-H vs. FSC-A and SSC-H vs. SSC-A, and include only the events found in the diagonal population (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).",
    "If working with whole blood or PBMC samples where incomplete RBC lysis was achieved, unlysed erythrocytes need to be excluded. One method is the blue/violet SSC gating method described by Petriz, Bradford, & Ward (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0018]).\n4. Exclude aggregates through inspection of N × N plots for incorrectly unmixed super-bright events and gate these out of all further analyses (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).\n5. Gate out dead cells by including only viability dye negative events (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).\nViability dyes also need to be titrated (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0002]).\n6. Gate on cells of interest using FSC-A vs. SSC-A, including only the events required for analysis (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).\nIf working with a sample that contains multiple cell types (such as PBMCs), include only the cells that will be involved in downstream analysis. For example, when analyzing a panel that contains only lymphocyte markers, gate out monocytes (validating that T cells are not excluded).\n7. Create as many pseudocolor or dot plots as there are fluorophores in the panel. Set the y axis to SSC-A and each x axis to a different fluorophore (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).\n8. Verify that a positive signal can be found for all markers (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]).\nFor rare or dim markers, FMOs can assist in determining the gating boundaries (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]). If no clear signal is observed, take note of that reagent and check the titer and staining protocol. For additional troubleshooting, see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-tbl-0003].\n9. Open the N × N worksheet template created previously and evaluate how well unmixing was performed for each marker. Inspect the FS sample by assessing whether super-negative events are present (example in Fig. 4E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004]), which can be an indication of unmixing issues.",
    "10. Select all plots making up the matrix. In the Plot Properties window, change the x axis option to the next fluorophore down the list so that all plots change simultaneously.\n11. Repeat steps 9-10 until all fluorophores have been checked.\n12. If there are no major unmixing errors (i.e., the positive and negative populations of each marker in the N × N plots are well aligned), continue to evaluation of marker resolution (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0005]).\n13. If there are unmixing issues, even once the unmixing has been performed correctly and optimally, it is possible to make small adjustments (<3%) to the compensation matrix (found in the Tube Properties window).\nAdjustments to the spillover matrix should be fully justified and the integrity of the data must not be impacted (made with clear knowledge of the biology, such as expression and pattern characteristics). Under-unmixing and over-unmixing issues can be manually adjusted (Ashhurst, Smith, & King, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0002]). It is unlikely that there would be a need for more than a 2% to 3% correction. If greater correction is needed, the unmixing accuracy needs to be re-evaluated.\nIf the samples are something other than PBMCs and significant unmixing issues are still present, more information on how to proceed can be found in the Commentary (see Critical Parameters, Complex Samples).",
    "Once the best possible unmixing has been achieved using Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004], the resolution of each marker in the FS sample must be compared to the SS cell controls. Assessing the spread of the negative population and/or shifts in the positive signal will provide an indication of whether there is any loss of resolution of markers in the panel when fully stained. This assessment is best achieved by overlaying each marker in the SS cell sample onto the FS sample. If any reduction in resolution is seen, the impact of this can be further investigated to identify if it will impact the ability to identify populations of interest using an established gating strategy. Ideally, the same number of cells from the same tissue type should be stained and acquired for all samples. In practice, however, this is not often feasible, and downsampling can be used to achieve identical cell numbers across samples during analysis. In theory, the only difference between the SS and FS cells should be the number of antibodies in the tube (Video 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004a]). Additionally, AF extraction should be tested to determine if marker resolution can be improved (Video 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0006a]).\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/78d5ed75-c0e7-41b2-a75f-028623a0b8b7/cpz1222-vid-0003.mp4]\nVideo\nEvaluation of marker resolution (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0005]).\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ddc3c397-d21e-4061-b45a-1fa5d3354603/cpz1222-vid-0004.mp4]\nVideo\nDeciding on an approach for mitigating autofluorescence (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0005]) and Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0006].\nMaterials\nData analysis software (e.g., FlowJo or FCS Express)\nCytek SpectroFlo software\nFCS files generated in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004]\nN × N worksheet template\nEvaluate marker resolution (Video 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0004a])\n1. Open the unmixed FS and SS cell samples in a data analysis software package for analyzing FCS files (e.g., FlowJo or FCS Express).",
    "2. Follow steps 2-6 of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004].\n3. Create a histogram for each fluorophore in the panel (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005]). If the positive population is rare, use a dot plot for visualization purposes instead of a histogram (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0df7527c-1bbf-4f07-9e17-e762f863bbd2/cpz1222-fig-0005-m.jpg</p>\nFigure 5\nEvaluation of marker resolution. (A) A histogram overlay of BV570 CD4 SS cells vs. FS sample (left) provides an example with no additional spread in the negative population, whereas a histogram overlay of AF532 CD8 (right) depicts spreading of the negative population in the FS sample (red) compared to SS cells (blue). (B) Histogram and dot plot overlays of Pacific Blue CRTH2. (C) Dot plot of BUV496 CD3 vs. BV510 TCRformula:\n${\\rm{\\gamma \\delta }}$\n before (left) and after (right) implementation of sequential staining (Park et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0017]).\n4. Overlay the same number of FS and SS cell sample events onto a histogram or dot plot (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005],B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005]).\nTo ensure that each sample contains equal events, downsample the cells of interest population from all samples to the same number of events based on the sample with the fewest cells of interest. In FlowJo, for example, select the population of interest, then go to the Workspace tab and select Plugins and then DownSample. Specify the number of events to be downsampled such that all samples can meet the criteria.\n5. Determine whether any spreading of the negative population has occurred in the FS sample (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005], right).\n6. Determine whether such spreading has impacted the resolution of positive and negative populations, either visually or by calculating stain index (SI; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0002], step 22).",
    "7. Create a spillover spreading matrix (SSM) to assess which fluorophores are likely to be introducing spread to the fluorophore of interest (in Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0006], find the SSM for the panel used to illustrate the protocol).\nIn FlowJo, for example, using the SS cells SRCs, navigate through the Compensation Wizard defining positive and negative populations for each fluorophore. The SSM will be automatically generated alongside the compensation matrix and can be displayed or exported from the SSM button.\nIf the spread of the negative population results in significant loss of resolution such that separation of positive and negative populations becomes difficult, and the marker is co-expressed in the same cell type as the marker causing the spread, the panel design should be reconsidered and a different fluorophore may be needed to improve resolution.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/63a0480a-ffcb-491c-968a-61857d1b1d0a/cpz1222-fig-0006-m.jpg</p>\nFigure 6\nSpillover spreading matrix for 24 unique-signature fluorophores used in combination on a panel used to illustrate the protocol. Spread is contributed by fluorophores listed in the rows, impacting the fluorophores listed in the columns. Spillover values are color-coded as follows: white, <3; shades of pink, 3–9; red, >9 (for example, BV480 spreads strongly into BUV496).\n8. Determine whether any loss in fluorescence intensity of given marker(s) has occurred in the FS when compared to the SS (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005]).\nAny reduction in positive signal should be investigated. An explanation is offered in Jalbert, Shikuma, Ndhlovu, & Barbour (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0011]) and Park et al. (2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0017]), where sequential staining of chemokine receptors was required to achieve positive signal in the FS sample comparable to that of the SS cell controls. Sequential staining can also be applied to non-chemokine receptors (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0005]).\nChoose approach for mitigating AF (Video 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0006a])",
    "Two scenarios should be considered regarding AF: homogeneous AF, where the whole unstained sample has a single low spectral signature (Fig. 7A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0007]) or single bright spectral signature (Fig. 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0007]), or heterogeneous AF, where there are multiple AF signatures (Fig. 7C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0007]). For PBMCs, where the unstained sample has a relatively low homogeneous AF signature, the Simple AF Protocol can be followed to assess whether AF extraction improves marker resolution. AF extraction is particularly helpful in resolving low-expressed markers by lowering the background of the negative population with minimal effect on the positive signal. If samples have heterogeneous or homogeneous but very bright AF, it is likely that AF extraction must be used to obtain unmixing that looks correct in Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004]. In this case, the decision to use AF extraction will be based on unmixing quality instead of improvement of marker resolution. The AF protocol for heterogeneous AF is explained in detail in Critical Parameters (under Working with Complex Samples) and in Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0006].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/56764a20-5430-4c19-9fa4-4215acaecbd3/cpz1222-fig-0007-m.jpg</p>\nFigure 7\nDetermination of AF signature type. AF signatures of (A) unstained PBMCs, (B) unstained JAWS cells (immortalized immature dendritic cell line), and (C) unstained skin cells. The latter shows a highly heterogeneous signature that can be split into three unique spectral signatures.\nExtract AF\n9. Open SpectroFlo and proceed to the Unmixing Wizard.\n10. Test the following options for unmixing:\n         \nUnmix without AF extraction first. Select live unmixing.\nRepeat steps of the Unmixing Wizard with AF extraction, placing the scatter gate on the population of interest only. Select Unmix, Save & Open to generate a separate set of FCS files from step 10a.",
    "11. If there are other cells of interest in the sample that have a brighter spectral signature, try to unmix with the scatter gate on this population in step 10b.\n12. Determine the best unmixing outcome comparing the N × N plots by evaluating changes in resolution for the dyes that overlap with the range of emission of AF (e.g., BUV496, BV510, Pac Orange, BV570, FITC, PE).",
    "The following protocol is divided into three sections: Discover, Distinguish and Designate.\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c67e64fe-d62e-4dc8-b1bb-eab331e425f0/cpz1222-vid-0005.mp4]\nVideo\nHeterogeneous autofluorescence (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0006]).\nDiscover\n1. Observe N × N plot permutations of raw channel data.\n         \nOn the Aurora, draw as many pseudocolor or dot plots as channels.\nLeave the x axis unchanged.\nSet each y axis to the different channels, so each plot shows a different raw combination.\nAn example of a SpectroFlo N × N raw template is shown in Figure 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0008].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/8af987a2-b85f-41f5-87ea-5a18bc9cc446/cpz1222-fig-0008-m.jpg</p>\nFigure 8\nExample of an N × N raw worksheet.\n2. Find a combination that separates the greatest number of populations from one another.\nPotential shortcut: Observe spectral plot showing ALL events and find one channel where there is obvious heterogeneity and one channel with similarity. This will immediately pull apart a minimum of two populations. Hint: Mid-range UV channels are most likely to show heterogeneity. If eosinophils are expected, YG1 will assist with isolating eosinophils from other populations.\nDistinguish\n3. Choose the plot with highest degree of separation.\n4. Place gates around all unique populations and observe the scatter properties and spectral signatures on adjacent spectral plots and select only the populations that have unique spectral characteristics.\n5. Find the peak fluorescent channel for each unique population and then display said population on a histogram using this channel.\n6. Gate the brightest 300-500 cells only, in order to derive the brightest AF SS control.\n7. Right-click on the gate and export events as a new FCS file.\n8. Repeat for all unique populations, producing an FCS file for each.\n9. Export an AF dim population (dimmest AF spectral signature found in the sample) to be used as the negative control for the previously exported populations.\nDesignate",
    "10. Designate these new AF signatures as fluorescence tags in the SpectroFlo Library.\n         \nCreate a new AF group.\nThis will facilitate filtering and exporting these fluorophores for offline analysis, as well as identification when designing experiments.\nAssign the AF tag a name, choose the excitation laser, and assign an emission wavelength (use the optical configuration in Figure 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0009] to determine wavelength based on peak emission channel).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2a07bbf9-6a91-4dac-95ff-4f8b40e40a0a/cpz1222-fig-0009-m.jpg</p>\nFigure 9\nAurora 5L detector array configuration.\n11. Open the experiment of interest and add the new AF tag(s) as if it were a fluorophore in the experiment.\n12. In the reference controls tab, add an additional negative for the AF tags that will be the AF dim.\n13. Import the populations exported during the Distinguish steps as SRCs for the corresponding tags, and import the AF dim population as an additional negative for the AF SRCs.\n14. Use the Unmixing Wizard QC tools to assess AF signature similarity.\nIn our experience, a similarity of 0.96 or less indicates that the AF signatures are generally considered to be unique.\n15. Unmix the experiment and evaluate the unmixed N × N matrix.\nIf unmixing errors are still present, refer to the troubleshooting guide in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-tbl-0003].",
    "Informed gating is a useful way to check panel quality. It is necessary to check that all populations of interest can be identified and to investigate how well they can be resolved (Fig. 10A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0010], Video 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0010b]). The biology of the sample should be considered to ensure that populations seen in the sample are as expected and that markers are expressed on all the expected cell types. This protocol indicates whether the panel is ready for use on experimental samples. Additionally, dimensionality reduction algorithms can be useful tools for investigating panel quality, as they simplify the data for visualization while also exposing artefacts that may be missed through expert gating. Using t-distributed stochastic neighbor embedding (t-SNE; van der Maaten & Hinton, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0024]; Fig. 10B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0010]), markers that are usually co-expressed should be checked to see they are found in similar regions of the t-SNE plot (Brummelman et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-bib-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2b435526-0c3e-42af-8aa4-4376e63a0a0a/cpz1222-fig-0010-m.jpg</p>\nFigure 10\nGating of the FS sample. (A) Gating strategy of the panel, including lineage, memory, and activation readouts. (B) t-SNE as a quality control tool. t-SNE analysis was performed with 1000 iterations and perplexity of 30 and displayed in 2D plots using the resultant t-SNE 1 and t-SNE 2 dimensions according to the per cell expression of 20 proteins. Expression levels of HLA-DR, CD27, CD28, CD45RA, CRTH2, CD127, TCRformula:\n${\\rm{\\gamma \\delta }}$\n, CD4, CCR4, CCR6, CD45RO, CD25, CCR10, CD8, CCR7, PLZF, CTLA-4, MR1tet, FoxP3, and CXCR3 are displayed. t-SNE scales are shown in each graph and visualized using a rainbow heat scale.\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2a34f727-2336-4ff7-ba38-d6b03a73db20/cpz1222-vid-0006.mp4]\nVideo\nAssessment of data quality using expert gating and dimensionality reduction algorithms (Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0007]).\nMaterials\nData analysis software (e.g., FlowJo, FCS Express, or any other software that allows gating of data)",
    "FCS files generated in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0005]\nPerform expert gating\n1. Open the unmixed FS sample in data analysis software used for analyzing FCS files.\n2. Follow steps 2-6 of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-prot-0004] to gate on live single cells of interest.\n3. Gate the rest of the markers based on panel design, prior knowledge, and published literature.\n4. Check the gating strategy for unexpected marker combinations or cell populations (Fig. 10A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0010]).\nFor example, when analyzing PBMCs, a CD3+CD19+ double-positive population is not expected. If one is found, the source of this staining must be investigated and corrected before the panel is ready for use.\n5. Evaluate whether all populations of interest have clear positive signals that can be easily resolved from the negative.\n6. Ensure readout markers (used for experimental readout) can be quantified in each of the cell types of interest.\nApply dimensionality reduction algorithm (t-SNE)\n7. Using the cleaned data from step 2, run a t-SNE at the default settings (iterations: 1000; perplexity: 30) utilizing all fluorescence parameters. Exclude non-informative parameters such as those used in the data cleaning steps (e.g., viability and phenotypic markers for identifying cells of interest).\n8. Assess marker co-localization one by one in viSNE plots by coloring the t-SNE based on the expression of each marker (Fig. 10B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0010]).\nviSNE is a visualization tool for high-dimensional single-cell data based on t-SNE.\n9. As in step 4, check for the appearance of unexpected marker combinations on specific cell types.\nSee Figure 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.222#cpz1222-fig-0011] for a simple checklist to help ensure that all steps have been followed to obtain a high-quality and reliable immunophenotyping panel.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/710f7d97-55cd-4438-be4b-9f1929fcffc9/cpz1222-fig-0011-m.jpg</p>\nFigure 11\nPanel optimization check list. To ensure the rigor and reproducibility of data acquired by spectral cytometry, the following steps are recommended for optimization and validation of each new panel."
  ],
  "subjectAreas": [
    "Cytometry"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}