{
  "id": 7793,
  "origin_website": "Bio",
  "title": "Detection of Zebrafish Retinal Proteins by Infrared Western Blotting ",
  "procedures": [
    "Pictorial methodology is illustrated in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4618/bioprotoc-13-04-4618-g001.jpgFigure 1. Western blotting workflow Eye dissection Place the fish in ice water at 1–2 °C at the desired time of the day.Leave the fish in the ice water for 2–5 min and decapitate the fish.Remove the eyeballs with a scoop (Figure 2B) and cut the white optic nerve using micro scissors (Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4618/bioprotoc-13-04-4618-g002.jpgFigure 2. Items used during western blotting. (A) BSA standards (1–7) and protein sample (*). (B) Eye scoop. (C) Incubator. (D) Transfer cassette. (E) Transfer module.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Zebrafish eye dissectionShock-freeze the eyes (3–4 eyes per sample) in liquid nitrogen.Notes:  In the original paper, western blot was used to evaluate protein level changes in a 24-h period. The eyes were collected every 3 h at eight different time points. Therefore, it was easier to store the eyes and perform the protein extraction for all the samples at once. Depending on the purpose of the experiment, the eyeballs can be collected directly in RIPA buffer and processed for the protein extraction right after the dissection. The dissection should be carried out under dim red light if light adaptive changes are to be avoided. Protein extraction Perform all steps on ice.Collect eyes and put them in 150 µL of cold RIPA buffer with 1× PIC, which is added right before the extraction.Homogenize eyes with sonicator three times for 3 s at 70% maximum power.Incubate on shaker at 4 °C for 2 h, centrifuge at 5,590 × g for 30 min at 4 °C, and transfer the supernatant to a fresh 1.5 mL tube.Perform BCA assay to determine the protein concentration:Use 1 ampule (1 mL, 2.0 mg/mL) of albumin standard from the PierceTM BCA Protein Assay kit to prepare BSA dilutions in RIPA buffer according to Table 1.Note: Duplicates are normally prepared.",
    "Prepare the BCA working reagents (WR) and calculate the total amount of WR according to sample to WR ratio (1:20). Prepare WR by mixing reagent A from the kit with reagent B (50:1).Mix well 15 µL of each standard with 300 µL of WR in separate 1.5 mL tubes. Mix well protein lysate with 300 µL of WR in another 1.5 mL tube. Incubate the tubes in a heating block at 37 °C for 30 min. Cool them down to room temperature (Figure 2A).Use a photospectrometer to determine concentration (we used a NanoDrop device).i. Input the number of replicates and concentrations of BSA standards according to Table 1.ii. Measure the protein concentration for each standard and replicate according to NanoDrop instructions.iii. Measure the sample concentration according to the instructions. The result will be shown on the screen and can be exported. Continue with the following steps or store the lysate at -80 °C until use.Table 1. Dilutions for preparing BSA standards table:",
    "﻿0,1,2,3\nVial,Volume of RIPA Buffer(µL),Volume of Source of BSA (µL),Final BSA Concentration (µg/ml)\n1,0,40 of Stock,2000\n2,10,30 of Stock,1500\n3,20,20 of Stock,1000\n4,20,20 from vial 2 dilution,750\n5,20,20 from vial 3 dilution,500\n6,30,10 from vial 5 dilution,125\n7,40,0,0",
    "Electrophoresis Mix lysates with 1× loading buffer containing 5% β-mercaptoethanol freshly added and place the samples on ice.Insert gel(s) into the electrophoresis cell, fill with 1× running buffer completely covering the gel, remove combs, and check/remove bubbles in each well.Load 10 µL of Precision Plus protein kaleidoscope marker and 20 µg of each sample.Note: An asymmetric loading scheme will make it easier to recognize the orientation of the membrane later. Run electrophoresis at around 100 V until the blue front band reaches the bottom of the separating gel.Note: The higher the voltage is applied, the faster the proteins travel. However, the bands sometimes do not run at the same height throughout the gel (“smile effect”). Remove the gel from electrophoresis cell.Blotting Work under the fume hood with good ventilation.Prepare the electroblotting system:For each gel, cut one piece of nitrocellulose membrane and two pieces of filter paper to the size of the gel.Equilibrate the membrane, filter paper, and two filter pads in 1× transfer buffer containing 20% MeOH in an incubator (Figure 2C).Mount the transfer cassette according to the scheme and remove air bubbles by gently pressing on the gel or membrane (Figure 2D).Cathode pole (black)Filter padFilter paperGelMembraneFilter paperFilter padAnode pole (white)Insert the transfer cassette into the Trans-Blot® module (Figure 2E), insert an ice block and a magnetic stir bar, and fill with 1× transfer buffer containing 20% MeOH completely covering the transfer module. Place the whole transfer module on a magnetic stirrer plate, which allows continuously stirring the buffer inside the module to keep the temperature low.Blot at 100 V/350 mA for around 40 min for protein Arrestin3a (Arr3a) and around 1 h for G-protein receptor kinase7a (Grk7a).Note: Blotting time varies according to protein size.",
    "In this protocol, we focused on Arr3a (around 41 kDa), Grk7a (around 63 kDa), and loading control β-Actin (around 42 kDa). In general, for proteins smaller than 50 kDa, blotting takes around 40 min. For proteins between 50 and 150 kDa, blotting takes around 1 h. For proteins larger than 150 kDa, blotting takes around 1 h in 1× transfer buffer without MeOH. Transfer the membrane into a dish with PBS and mark membrane on one of the corners to remember which side is the top side.Antibody staining Place the membrane in a container (Figure 2C) and rinse twice for 5 min with 1× PBST.Block for 1 h in blocking solution on the shaker and shake gently.Prepare the first antibodies (rabbit anti-Arr3a: 1:4,000 and mouse anti-β-Actin: 1:6,000, or rabbit anti-Grk7a: 1:3,000 and mouse anti-β-Actin: 1:6,000) in blocking solution at 4 °C and incubate the membrane overnight at 4 °C on the shaker.Note: The first antibody solution can be kept at 4 °C and reused later. Depending on the antibody, this solution may be reused five times. Wash for 5 min in blocking solution at room temperature.Wash three times for 10 min in 1× PBST.Prepare the secondary antibodies (IRDye® 800CW goat anti-rabbit IgG and IRDye® 680RD goat anti-mouse IgG, both at 1:20,000) in blocking solution and incubate the membrane for 1 h on the shaker. Protect from light by covering the container completely with foil or placing it in a black box from now on.Wash three times for 5 min in 1× PBST.Signal detection Clean the scanning area of the imager with water and place the membrane.Define the area of interest in the Image Studio software and scan.Acquire images at 700 nm to visualize the signal of Arr3a or Grk7a, and at 800 nm to visualize the signal of β-Actin.",
    "Note: A membrane image example is shown in Figure 3 (Zang et al., 2021)."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}