{
  "id": 8748,
  "origin_website": "Jove",
  "title": "A High-throughput Calcium-flux Assay to Study NMDA-receptors with Sensitivity to Glycine/D-serine and Glutamate",
  "procedures": [
    "1. Preparation of Cells\nNOTE: This protocol, including data generation, uses HEK293 cells transduced with a baculovirus encoding NR1 and NR2A cells.\nSeed the appropriate number of HEK293 cells and add the NR1 and/or NR2A virus at the appropriate final concentrations (1.00 µL each). For a 384-well plate, use 10,000 cells/well in a final volume of 30 µL.\nAlternatively, seed HEK293-NR1-NR2A cells at the appropriate cell number and volume (for a 384-well plate, use 10,000 cells/well in a final volume of 30 µL). Add tetracycline at a concentration of 2 µg/mL to induce NR2A expression and add the protection compound (100 µM MDL105,519 or 5 µM CGP07066724).\nNOTE: The baculovirus encoding NR1 and NR2 should have an approximate titer between 5 x 109 - 10 x 109 infectious unit per milliliter24.\n2. Measurement of NMDA-receptor Activity\nPrepare a 384-well plate with HEK293 cells transduced with NR1/NR2 or HEK293-NR1-NR2A cells in the presence of either protective compound. Use a clear bottom, black frame, poly-D-lysine coated plate.\n\tNOTE: Protection with 100 µM MDL105,519 is used to confer sensitivity to glycine, while 5 µM CGP070667 is used to confer sensitivity to glutamate.\nIncubate the plate at 37 °C and 5% CO2 for 16 hours (overnight).\nRemove the plate from the incubator and gently discard the cell media by slowing flipping the plate over a compatible biowaste container. Gently tap the plate on a paper towel to clean the media off edges of the plate and drain any remaining media.\nPrepare the calcium6-dye by solubilizing one vial of calcium6 dye (1 plate size) in 10 mL of incubation buffer (HBSS pH 7.5, 20 mM HEPES, 1 mM MgCl2, 1 mM probenecid). Incubate the plate for 2 hours at 37 °C and 5% CO2.",
    "Remove the plate from the incubator and let the cells adjust to room temperature for 10 minutes.\nGently pour out the calcium6-dye as described in step 2.3 and add 30 µL of assay buffer (HBSS pH 7.5, 20 mM HEPES, 1.8 mM CaCl2, 1 mM probenecid).\nRepeat step 2.6 twice for a total of 3 washes. Leave 30 µL of assay buffer on the cells after the last wash.\nLet the cells rest for 5 minutes at room temperature.\nPrepare the ligand plate by making a 4-fold stock of 400 µM glycine and 400 µM glutamate (final concentration of 100 µM; optimal concentration of ligands to be determined as described below). Transfer a minimum of 25 µL of ligand stock into a V-bottom 384-well plate.\nLoad the ligand plate and cell plate into the FDSS (Functional Drug Screening System).\nMeasure the baseline fluorescence (Fo) of the cell plate for 30 seconds. Transfer 10 µL of the ligand stock into the cell plate using the FDSS dispensing function and measure the calcium flux by recording calcium6-dye fluorescence for 5 minutes.\nCalculate the maximal fluorescence ratio by dividing the maximal fluorescence obtained by the baseline fluorescence (Fmax/Fo).\n3. Optimization of NMDAR Expression Levels\nTo determine the optimal amount of baculovirus to use, perform a titration of both NR1 and NR2A viruses. Prepare a 384-well plate with HEK293 cells (recommendation of 10,000 cells/well, 30 µL of media) and include the protection compounds as described in step 2.1.\nAdd varying amounts of the NR1 virus in different rows of the plate (for example: add 0 µL, 2 µL, 1 µL, 0.5 µL, 0.25 µL in rows A-E respectively). Add duplicates for data accuracy.",
    "Add varying amounts of the NR2A virus in different columns of the plate (for example: add 0 µL, 2 µL, 1 µL, 0.5 µL, 0.25 µL in rows A-E respectively). Add duplicates for data accuracy.\nIncubate the plate at 37 °C and 5% CO2 for 16 hours (overnight).\nDetermine the optimal ratio and amount of the NR1 and NR2A viruses by performing a calcium flux measurement on the FDSS (see above).\n4. Ligand Titration\nPrepare the cells as described in step 2.3.\nPrepare dilutions of each ligand in the presence of saturating concentrations (100 µM) of the other ligand as a 4-fold stock solution. For example: for a 10 µM final test concentration of glycine, prepare a 40 µM stock solution of glycine including 400 µM glutamate.\nProceed with the FDSS measurement as described in step 2.11.\n5. Compound Testing\nPrepare the cells as described in step 1.\nPrepare the ligand plate with a 5-fold stock of final ligand concentration in the assay buffer.\nPrepare the compounds plate with the 4-fold stock of desired final concentration of compounds in the assay buffer. For a final compound concentration of 10 µM in the assay buffer, prepare a 40 µM stock solution.\n\t\nKeep the concentration of the dimethyl sulfoxide (DMSO) constant across all samples by preparing a pre-dilution of the compound in DMSO before further dilution into the assay buffer.\nFor a dose response of the compound in the final assay ranging between 3 and 30 µM, prepare a pre-dilution of the compound in DMSO ranging from 1 to 10 mM. Dilute those in the assay buffer to the 4-fold stock concentration. The final concentration of the DMSO should not exceed 0.5%.\n\t\tNOTE: It is recommended to test each sample in triplicates.\nLoad the ligand, compound, and cell plate into FDSS.",
    "Measure the baseline fluorescence for 30 seconds.\nAdd 10 µL of compound stock and measure the fluorescence for 5 minutes.\nAdd 10 µL of ligand stock and measure the fluorescence for 5 minutes.\nDetermine the integral of the fluorescence ratio by calculating the area under the curve of the fluorescent ratios during the last 5 minutes of the measurement.\n\tNOTE: Alternatively, the maximal ratio of fluorescence after ligand addition can be used for analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}