{
  "id": 18036,
  "origin_website": "Jove",
  "title": "Handheld Metal Detector Screening for Metallic Foreign Body Ingestion in Children",
  "procedures": [
    "The protocol follows the guidelines of Institutional Human Research Ethics committee. The central institutional review board provided the ethics approval for the study.\n1. Participant Screening\nRecruit patients who present to the pediatric emergency department with history of foreign body ingestion.\nExclude the patients who are in respiratory distress and has implanted devices like pace makers.\n2. Prepare the Patient\nDress the patient in a hospital gown.\nRemove all items that may contain metallic objects such as clothes, eye glasses, earrings, pendants, and ornaments prior to the examination to avoid interference with the HHMD screening.\nPlace the patient in the center of the room away from other potential metallic interferences.\n3. Prepare the Examiner and Caregivers\nRemove all metallic accessories such as jewelry and watch.\nRequest the caregiver to remove all metallic accessories such as jewelry and watch.\n4. Metal Detector Screening\nUse the HHMD (Figure 1) to conduct the screening.\nConfirm the working status of the HHMD by eliciting a positive audio-visual signal by waving over a piece of metal.\nPerform the HHMD scanning in a standing position for bigger children.\nPerform the HHMD scanning in an erect position for infants by having the caregiver hold the patient appropriately.\nHold the hands of the patient up and away from the body.\nPosition the head of the patient in extension to expose the neck.\nScan from the level of the chin to the level of hip joint to cover the anatomical areas from neck to pelvis.\nPerform the scan in a zig-zag manner across the body to ensure that every area has been scanned.\nScan both anteriorly and posteriorly as the thickness of patient must be taken into consideration.\nCarefully note the positive audio-visual signal during the scanning for the presence of MFBs.\n5. Perform the Relevant Radiograph",
    "Order the relevant radiograph of the neck, chest, or abdomen, as per the area detected by the HHMD screening for the MFBs.\nProceed with all the X-ray views (neck, chest, and abdomen) if the MFB was not detected during HHMD screening and the clinical index of suspicion for foreign body ingestion is high.\n6. Record the Test Results\nRecord the test results in the logbook (Figure 2) specifically created based on the workflow (Figure 1).\nCorrelate the positive audio-visual HHMD signal with the underlying bony landmark on the body, by palpating the following prominent bony landmarks - sternal notch, xiphisternum, pubic symphysis, and bilateral Iliac crest.\nRecord the landmark on the logbook's anatomical reference outline before proceeding with the X-ray examination.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}