{
  "id": 4356,
  "origin_website": "Bio",
  "title": "Quantification of T Cell Antigen-specific Memory Responses in Rhesus Macaques, Using Cytokine Flow Cytometry (CFC, also Known as ICS and ICCS): from Assay Set-up to Data Acquisition",
  "procedures": [
    "Note: Please see Figures 1 and 2 for the flow chart of the CFC set up process and the CFC tube staining process, respectively. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140412/20140412003507_5474.jpgFigure 1. Flow chart of the CFC set up processimgsrc:https://en-cdn.bio-protocol.org/attached/image/20140412/20140412003530_9006.jpgFigure 2. Flow chart of the CFC tube staining process Part I. Culture setup, incubation, chillingPre-start preparationSee QA/QC notes.Make fresh medium (or begin warming to room temperature).Label PP tubes.Begin thawing peptides in DMSO (if applicable).Obtain cellsFreshly-harvested WBC (Notes 2-5).PBMC (peripheral blood mononuclear cells) from blood. (Other protocols explain how to isolate PBMC from blood. It is also possible to use whole blood that has been treated with a hypotonic saline like ACK to burst red blood cells.)BAL (bronchoaveolar lavage, sieved).Solid tissue, mechanically processed (LN, spleen, bone).Solid tissue, enzymatically processed (gut, liver, vagina).Cryopreserved WBC harvests.Thaw (Note 20).Rest (Note 20).Determine viability (Note 20).Adjust suspension density to approximately 2 x 106 Ly/ml, in fresh-made R10 (Note 21)e.g. 1 x 106 Ly/500 μ.R10 un-supplemented by antibodies or antige.Set suspension aside at room temperature until use.Prepare R10 supplemented with costimulating MAb anti-CD28, anti-CD49d (Note 11)Determine the total volume needed for the assay setup: (# tubes) x (500 μl/tube) x 1.2 (i.e., increase by 20%).Measure R10 into vessel labeled 'costim-R10'.Add anti-CD28 and anti-CD49d: Presuming [stock] = 0.5 mg/ml.Use 1 μl/500 μl (i.e., 2 μl/ml R10).Mix (vortex or inversion).Prepare substocks of R10 + costim, supplemented with antigensDetermine the total volume needed for a particular antigen (# tubes) x (500 μl/tube) x 1.1 (i.e., increase by 10%).Measure R10 + costim into vessel labeled by antigen.Briefly vortex the stock antigen is mixed and homogenous.Ensure that the measurement is accurate (Note 22).Mix (vortex or inversion).Dispense 500 μl of R10 + costim + Ag into all appropriately-labeled tubesUse the tube labels to consistently orient the tubes in a reproducible way in the holding rack(s).",
    "Vortex the solution immediately before using (it is convenient to use a repeater for this dispensing).Dispense the 500 μl/tube, aiming down to a particular 'side' the tube (that side is now a possible cause of cross-contamination when using a repeater, so subsequent steps should orient the tubes differently, to avoid cross-contamination).Put the tube-holding rack(s) in a 37 °C, 5% CO2 incubator until use (these tubes can be prepared up to 2 h before adding cells).Dispense 500 μl of cell suspension into all racked tubesBe attentive to the label orientation on the tubes; orient the tubes such that dispensed suspension goes down an opposite side of the tubes (to minimize the risk of cross-contamination).It is convenient to use a repeater for this step.Always dispense into 'Negative' control tubes first.Always dispense into 'SEB' positive control tubes last.This step should take place as quickly as possible, since it is combining cells with antigen. At room temperature, however, the cells are not yet very metabolically active.It is not necessary to individually vortex tubes after this combination.Transfer the racks to an incubator stably at 37 °C, 5% CO2 Ensure that a humidifying tray contains water (or else evaporation from the tubes will concentrate cells, Ag, and salts, changing the assay outcome).Place the rack on its side, resting the rack top on a cosmetic wedge. The sharp angling of the tubes makes the medium more shallow, making gas diffusion easier. This orientation also makes it so that the cells settle over a larger area, with less cell-cell contact. This seems to improve response sensitivity, for reasons that remain unclear.Set a timer for 1 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140412/20140412003719_3988.jpgFigure 3. How to angle a rack of ICS tubes during incubationAfter 1 h of incubation,add Brefeldin A to all tubes (Note 24)Prepare a dilute cocktail, to be used at 50 μl/tube.",
    "If (BfA stock) is 10 mg/ml, use 1 μl/tube.Dilute the BfA into unsupplemented R10. 1 part BfA into 39 parts R10; deliver 40 μl of this mix into each ICS tube. A 40 μl drop will reliably slide down the wall of a PE tube.Using a repeater, shoot the BfA downward into the tube.Orient the labels to minimize cross-contamination.Dispense in a way to minimize the disruption of the settled cell pellets in each tube.40 μl produces a heavy enough drop toreliably run down the side of the tube.Do not vortex or further mix the tube contents.The tubes should be uncapped (or with loosely-applied 'snap caps'. It is important that easy gas exchange is allowed. The pen/strep is typically very effective at preventing bacterial and fungal growth during the short incubation period.Return the racks to the incubator (humidified, 37 °C, 5% CO2)Incubate tubes for an additional 5-8 h (with rack angled as in Figure 3) (Note 25).At the end of the incubation, the racks should be cooledThe simplest way to accomplish this is to transfer the racks to a refrigerator at 4 °C.Tritech Research sells novel incubators that can, by computer-clock control, cool rapidly (37 °C to 15 °C, in less than 20 min; eventually to 4 °C) (Note 19).Part II. StainingSamples should be processed to fixation within 12 hAlthough the mammalian cells are metabolically nearly inert at 4 °C, they remain alive. Left too long, the CFC signal will change. Transfer the culture tubes from the incubation racks to centrifuge bucket inserts.WashUsing a bottletop pump dispenser, fill all tubes with PAB wash buffer.Centrifuge 800 x g, 10 min (sufficient to produce a tight cell pellet in a 5 ml tube).",
    "The temperature of the run doesn't matter much, so long as it is well below metabolically-active 37 °C; the cells will soon be fixed.Remove supernatant (Note 26)Method 1: Wand vacuum-aspiration (Note 27).Method 2: Wand vacuum-aspiration with stop (Note 28).Method 3: Decanting (Note 29).Method 4: Decanting with insert gasket (Note 30).Resuspend pellets (Video 1) (Note 31).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Hand-decanting wash supernatant from polypropylene tubes used in CFC (ICS) assay Stain with Aqua LIVE/DEAD discriminator dye (optional, esp. for thawed cells)Wash the cells with ice-cold 1x PBS.Aspirate to remove supernatant (leaving minimal residual fluid).Resuspend cells (as in Part II, step B4) in 100 μl ice-cold 'Staining Solution' (100 μl/1 x 106 Ly).Incubate 20 min in dark, on ice.Wash (see Part II-B) to stop.Apply surface antibody cocktail (Note 32)Cocktail can be made hours ahead of time, in PAB.Formulate cocktail at 50 μl/tube Example: CD45, CD4 (Note 44).Dispense with a repeater.Vortex the tubes after adding the cocktail to the tubes.Incubate at room temperature for 30 min (in the dark) (Note 33). If the surface stain includes a two-stage biotin-streptavidin stain, the first cocktail should include the biotinylated reagent. After the 30 min incubation, add the streptavidin reagent to the tubes (no pre-washing is needed). It is convenient to put the streptavidin in a 50 μl/tube PAB dilution, which allows for repeater dispensing.Wash (see Part II-B)Apply 1 ml 'Lyse' per tube (Notes 17 and 34)Set a lab timer for 10 min.Ensure all the pellets are effectively disrupted.Have a plan figured out that will allow vortexing within two minutes of when you start to dispense Lyse, and that ensures the tubes get vortexed in the same order the Lyse was added.Fill an appropriately-sized repeater.Dispense quickly into tubes.Start the timer before adding to the first tube.Aim the repeater towards the midpoint wall.",
    "Begin vortexing tubes within 2 min of receiving Lyse.How Lyse is added is one of the most important details in this entire process. If the cells are not well-resuspended prior to adding Lyse, they will be fixed together, degrading data quality. If you do not mix the cells and Lyse quickly after combining them, you might get poor rupture of RBCs, degrading data quality. It is important to vortex soon and vigorously after adding the Lyse.If time allows, vortex the tubes again (this is especially valuable if the samples contain RBC contamination).Incubate ten full minutes at room temperature, in the dark.Wash (see Part II-B)Adding PAB reduces the hypotonicity of the Lyse reagent, slowing the osmotic swelling of the cells, and diluting the paraformaldehyde chemically fixing the cellular proteins. The residual fluids will match those dilutions (Note 35).Apply 0.5 ml 'Perm' per tube (Note 18)Basically, repeat the same method used for 'Lyse', but with 0.5 ml/tube.Wash (Note 36)Wash (Note 37) Apply intracellular antibody cocktail (Note 32)Cocktail can be made hours ahead of time, in PAB. Formulate cocktail at 50 μl/tube Example: CD3, CD8, CD69, cytokines (Note 44). Dispense with a repeater.Vortex the tubes after adding the cocktail to the tubes.Incubate at room temperature for 30-45 min (at room temperature, in the dark) (Note 33).If the cocktail includes Ki67, the incubation should be lengthened to 45 min (Note 38). Wash (Note 39)Remove as much fluid as possible, to ensure fast acquisition times.Part III. Data AcquisitionSee Notes about QA/QC.Samples should be acquired within 72 h (Notes 46 and 47)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}