{
  "id": 3182,
  "origin_website": "Cell",
  "title": "Protocol for purification of cells in their native state using reversible aptamer-antidote pairs",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAptamer-mediated isolation of cells from blood or other cell suspensions\nTiming: 1 day\nAfter verifying that the aptamer can selectively stain cells expressing the aptamer’s receptor target in an antidote-reversible manner, the aptamer-antidote pair can be used for aptamer-based magnetic-activated cell sorting (MACS) to isolate target cells from blood or other complex cell mixtures. Immobilizing biotinylated aptamers on streptavidin-coated magnetic beads enables binding and magnetic pulldown of target cells, which can be separated from complex cell mixtures by removing the supernatant containing nontarget cells. Washing the beads removes remaining weakly-bound nontarget cells and other particles. Subsequent incubation with antidote displaces bound target cells from the aptamer-coated beads, resulting in a population of label-free target cells in the supernatant. Isolated cells will be in a native, unlabeled state and can then be used for receptor signaling studies, sequencing, culturing or other downstream applications. See Figures 5[href=https://www.wicell.org#fig5], 6[href=https://www.wicell.org#fig6] and 7[href=https://www.wicell.org#fig7] for illustrated flowcharts.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2755-Fig5.jpg\nFigure 5. Illustration of the aptamer-bead preparation portion of the aptamer-MACS protocol\nA solution of biotinylated aptamers is incubated with streptavidin-coated magnetic beads and allowed to incubate for 15 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2755-Fig6.jpg\nFigure 6. Illustration of the Cell Isolation portion of the aptamer-MACS protocol\nDepending on the application, the sample containing the target cell type is pretreated with RBC Lysis Buffer in the case of blood or directly resuspended in blocking PBS+. After a 30-min incubation at 4°C, the target cells bound to the aptamer-coated beads are separated from the rest of the sample by repeatedly using a magnet to partition the target cell-coated aptamer-magnetic beads.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2755-Fig7.jpg\nFigure 7. Workflow of the Cell Binding and Antidote Treatment sections of the protocol",
    "(Left-to-right) The antidote is added to the suspension and mixed by pipetting. Following a 10-min incubation at 37°C, the supernatant containing the target cell type is removed and the cells are washed to collect all of the target cells.\nAptamer-bead preparation\nTiming: 30 min\nVortex the vial of Dynabeads™ MyOne™ Streptavidin C1 beads for 30 s and transfer 12 μL of beads to a 1.5 mL tube.\nWash beads:\nAdd 375 μL 1× SB1T buffer, placing the tube in the magnetic rack for 1–2 min to pellet the beads.\nRemove the supernatant, taking care to aspirate carefully with the pipette, holding the tip to the bottom of the 1.5 mL tube and drawing the supernatant up gradually and steadily.\nRemove the tube from the magnet and resuspend beads in 120 μL 1× SB1T buffer and pipetting up and down 3–5 times.\nPlace the tube on a magnet for 1–2 min to pull the beads out of solution.\nRepeat steps b, c, and d 2 times, then aspirate the supernatant with a pipette.\nRemove the tube from the magnet and resuspend the beads in 48 μL of 1× SB1T buffer + 1 mg/mL ssDNA (so that bead concentration is 2.5 μg/μL).\nPrepare targeting aptamer solution by resuspending 12.5 pmol of aptamer in 20 μL solution of PBS+/+. Vortex to mix.\nFold aptamer:\nDenature aptamer solution by heating at 65°C for 5 min.\nLet sit at room temperature for 3 min to allow the aptamer to renature and fold.\nImmobilize folded aptamers on streptavidin beads:\nVortex the beads for at least 30 s.\nAdd 40 μL of the bead solution to the renatured aptamer solution from step 5.\nVortex to mix.",
    "Incubate at room temperature for 15 min with gentle rotation to allow the folded aptamers to bind to the surface of the beads.\nPlace tubes on the magnet for 2–3 min to separate the beads and supernatant and remove the supernatant by pipetting gently, taking care to avoid aspirating any beads with the pipette.\nWash the aptamer-coated beads 3 times:\nRemove the tube containing the beads from the magnet rack.\nResuspend the beads with 50 μL 1× SB1 buffer + 1 mg/mL ssDNA.\nPlace the tube on the magnet for 2–3 min until the beads have been pulled out of solution.\nRemove the supernatant gently with a pipette.\nRepeat steps a, b, c, and d 2 more times.\nremove the tube from the magnet and then resuspend in buffer.\nAfter the 3rd wash in step 9, remove the tube from the magnet and resuspend beads in 40 μL of PBS+.\nPlace beads on ice until it is time to incubate with cell sample of interest.\nAlternatives: As a control for aptamer-specific isolation of cells, beads should also be coated with a control nontargeting aptamer following the same protocol described above for the receptor-specific aptamer.\nRed blood cell (RBC) lysis\nTiming: 30 min\nTo isolate cells from whole blood:\nDraw at least 1 mL of whole blood into a citrated collection tube to prevent clumping.\nCombine 10 mL of 1× RBC Lysis Buffer with 1 mL of the citrated whole blood in a 15 mL conical and mix thoroughly by pipetting up and down 3–5 times.\nIncubate the sample for 15 min at room temperature in a sample rotator. (See key resources table[href=https://www.wicell.org#key-resources-table] / manufacturer’s recommendations for more details).",
    "Centrifuge the sample at 300–400 × g for 5 min at room temperature. The blood should separate into a dark-red pellet and a lighter supernatant.\nRemove supernatant with a pipette, taking care not to disturb the cell pellet.\nWash cells by resuspending in 10 mL PBS +, centrifuging at 300–400 × g for 5 min to pellet and removing supernatant.\nAfter washing, resuspend pellet in 1 mL PBS+ and keep on ice.\nImmobilize aptamer-beads (prepared in “aptamer-bead preparation[href=https://www.wicell.org#sec2.2]” section above) on the magnetic rack, remove supernatant and replace with cell mixture, mixing well by pipetting up and down. Then leave at 4°C for 30 min with gentle rotation to allow target cells to bind to aptamer-beads.\nAlternatives: Depending on the amount of blood available, the volumes of aptamer-labeled beads and RBC Lysis Buffer can be scaled up or down in direct proportion to the volume of blood used.\nAlternatives: This protocol can be adapted for liquid cell suspensions other than blood, provided the substance does not cause clumping of the beads. For isolation of target cells from other mixtures such as cultured cell suspensions or homogenized tissue samples, pellet 5 × 106 cells, resuspend in 1 mL Blocking media+ or Blocking PBS+, and add to magnet, as in steps 5 and 6 above, then continue to Cell Binding and Antidote Treatment section below.\nCell binding and antidote treatment\nTiming: 30 min\nNote: The following steps should be performed at 4°C unless otherwise noted to ensure that the aptamer binds but does not internalize into cells.\nPlace cell and bead mixture on the magnetic rack for 3–5 min to pellet the beads.\nRemove the supernatant by gently aspirating with a pipette.\nWash cell-bead mixture with 1 mL of Media+ or PBS+:",
    "Resuspend cell-bead mixture in the buffer, placing the beads on the magnet for 3–5 min to pellet the beads and removing the supernatant to a 2nd tube.\nTo recover residual beads from the supernatant and optimize cell yield, place this 2nd tube on the magnetic rack and wait another 3–5 min for the beads to aggregate.\nRemove the supernatant from the 2nd tube to a 3rd tube.\nPlace this 3rd tube on the magnetic rack and wait 3–5 min to again recover any residual beads from the supernatant.\nRepeat the washing process from step 3 as needed until there are no beads visible in the supernatant.\nCritical: It is important to wash the beads thoroughly while pipetting gently, as this washing step is meant to remove cells binding nonspecifically to the beads before adding the antidote solution to nullify the specific aptamer-receptor interactions targeting the desired cell type.\nRepeat step 2 twice more to wash the cell-bead mixture,\nAfter the last wash, remove the tubes containing beads from the magnet and combine all the beads into a final volume of 40 μL of Media+ or PBS+ with a 100-fold molar excess of antidote (1.25 nmol antidote for the 12.5 pmol of aptamer on the beads). Pipette up and down to mix. Take care to avoid making bubbles.\nPlace at 37°C with gentle rotation for 10 min to allow the antidote to bind to the aptamer and the cells to detach from the aptamer beads.\nImmediately place cells back at 4°C following antidote incubation. Then add 1 mL of Media+ or PBS+ buffer, mix by pipetting up and down and place tube on magnet for 3–5 min to draw beads out of solution, leaving detached cells in supernatant.",
    "Critical: Unlike previous washes containing nontarget cells, the supernatant remaining after antidote incubation will contain the purified population of target cells and thus should be handled gently, taking care to pool the supernatant and separate it completely from the beads.\nCollect the eluted target cells:\nGently aspirate the supernatant containing the detached target cells with a pipette and move it to a new Eppendorf tube.\nPlace the tube containing the supernatant on the magnet for 3–5 min to draw any beads that may remain;\nTransfer the supernatant to a 2nd tube, and repeat steps a and b until there are no beads remaining in the supernatant.\nDiscard the tubes with the residual beads, and wash the original beads 2 more times with 1 mL of PBS+ using the same technique described in step 9 to collect cells washed off the beads\nPool the supernatants to collect all the eluted cells:\nCombine the eluate from steps 9 and 10 into two Eppendorf tubes\nSpin the tubes containing the pooled eluted cells down at 300 × g for 5 min\nGently remove the supernatant from the pellets of the purified target cells.\nResuspend cell pellets in Media+ or other desired buffer.\nAssess recovery by flow cytometry and proceed to other downstream applications.\nQuality control of eluted cells",
    "If desired, a portion of the recovered cells can be evaluated to ensure that they are viable and to ensure the presence of a target biomarker via flow cytometry. Viability can be assessed via Hoescht 33342 staining, as described below, or by using another commercially available viability dye, such as the Zombie dyes from BioLegend™, following the manufacturer’s recommendations. Target biomarkers can also be assessed using biomarker-specific antibodies or biotinylated aptamers. Antibody staining for biomarkers can be performed according to manufacturer’s recommendations immediately downstream of the “cell binding and antidote treatment[href=https://www.wicell.org#sec2.4]” section above. Aptamer staining can be performed as described in the “aptamer cell staining assay[href=https://www.wicell.org#sec1.3]” section above.\nStain a sample of eluted cells with appropriate targeting aptamer as described in aptamer cell staining assay[href=https://www.wicell.org#sec1.3] or with corresponding biomarker-targeting antibody according to manufacturer’s recommendations.\nPrepare a solution of 1 ng/mL Hoescht 33342 staining solution in Hanks Balanced Salt Solution containing 1.3 Ca2+, 0.9 mM Mg2+, 1% BSA, and 0.1% sodium azide.\nCritical: The specific wavelength of the dye conjugated to the targeting reagent will depend on the channels available on your flow cytometry instrument. Any wavelength that does not interfere with the signal of the Hoescht live/dead stain should be suitable to avoid interference.\nAlternatives: If the use of Hoescht 33342 would be impractical due to wavelength interference or some other reason, amine-reactive fluorescent dyes such as the Zombie™ line of dyes work well in conjunction with a targeting ligand conjugated to a noninterfering dye.\nResuspend the cells eluted from the beads in cell binding and antidote treatment[href=https://www.wicell.org#sec2.4] in 100 μL of the Hoescht staining solution.\nAssess sample purity and viability via flow cytometry, according to manufacturer specifications.",
    "Note: In order to do a thorough evaluation of the viability and purity of eluate, it is recommended that you prepare a dead cell control of the same type as the target cell type. For most cell lines, incubating for 2 min in a solution of 70% ethanol in water should be enough to kill the cells. However, in applications where sufficient quantities of viable target cells cannot be obtained easily, such as the isolation of rare cell types, a similar immortalized cell line may be used for the dead cell control, or the dead cell control may be omitted entirely."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biotechnology And Bioengineering",
    "Cell Isolation",
    "Molecular/Chemical Probes"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}