{
  "id": 10136,
  "origin_website": "Jove",
  "title": "Fabrication of Size-Controlled and Emulsion-Free Chitosan-Genipin Microgels for Tissue Engineering Applications",
  "procedures": [
    "All animal procedures were approved by the University of Colorado Denver Institutional Animal Care and Use Committee. 6-week old male Sprague-Dawley rats were used for the present study. The rat growth plate injury model was created following a previously published report30.\n1. Preparation of the chitosan polymer\nObtain purified and lyophilized low molecular weight (LMW) chitosan from commercially available sources (see Table of Materials).\nAdd 495 mL of double-distilled water (ddH2O) and a stir bar to a 1 L beaker. Add 5 g of chitosan (Step 1.1.) and mix well.\n\tNOTE: Chitosan is only sparingly soluble in an aqueous solution at physiological pH, so the chitosan will not dissolve easily at this step.\nAdd 5 mL of glacial acetic acid to the above-prepared chitosan solution.\nStir covered at 300 rpm for 18 h with the beaker set in a water bath held at 50 °C.\nUsing a Büchner flask and funnel, filter the chitosan solution through decreasing sizes of filter paper: 22 µm, 8 µm, and 2.7 µm (see Table of Materials).\nAdd the filtered chitosan solution to cellulose dialysis tubing (see Table of Materials) and allow to dialyze in ddH2O at room temperature for 4 days, changing the ddH2O every day.\n\tNOTE: Use ultrapure ddH2O water for the last change.\nTransfer the dialyzed chitosan solution to a beaker and adjust the pH to 8.0 using 1 M NaOH.\nAliquot the chitosan into centrifuge tubes and centrifuge at 4000 x g for 5 min at room temperature.\nDecant the supernatant to a waste stream and resuspend the chitosan in ddH2O, repeating 2x.\nFreeze and then lyophilize the chitosan pellet.\n\t\nEach day, remove the lyophilized product and record the mass.",
    "​NOTE: When the mass of the lyophilized product is no longer changing, the product is fully dried and can be stored at -20 °C until ready for use.\n2. Fabrication of chitosan hydrogel\nAdd 2 mL of 6% acetic acid and 120 mg of purified chitosan (Step 1) to a 10 mL Luer-lock syringe to form a 6% w/v chitosan solution.\nConnect the Luer-lock syringe to another identical syringe using a female-female Luer-lock connector and mix the solution back and forth for 30 s, or until the chitosan has fully dissolved in the acetic acid.\nBefore crosslinking, add any therapeutic or bioactive agent to the chitosan solution (if needed). For the present study, 200 ng of SDF-1a and TGF-b3 (see Table of Materials) were added to the microgels.\n\tNOTE: SDF-1a and TGF-b3 are bioactive agents relevant to growth plate tissue regeneration. SDF-1a promotes migration of mesenchymal stem cells to the defect site, and TGF-b3 serves as a chondrogenic factor to induce differentiation of these stem cells down the chondrogenic lineage31. \n\tNOTE: Mix the chitosan again between the syringes to fully incorporate the therapeutic.\nPrepare 100 mM of stock crosslinker solution of genipin (see Table of Materials) in 100% ethanol.\nAdd 100 µL of the prepared genipin solution (Step 2.4.) to the chitosan-containing syringe, and again mix back and forth between syringes for 30 s.\nExtrude the mixture from the syringe onto a 35 mm Petri dish, cover it with paraffin film, and incubate it at 37 °C overnight in a humidified atmosphere.\n\tNOTE: The solution will turn dark blue, indicating that the crosslinking reaction between chitosan and genipin has occurred, leading to the formation of chitosan microgel.\nFilter the prepared chitosan microgel following the steps below.\n\t\nGently break the hydrogel into smaller pieces using a spatula.",
    "NOTE: The pieces should be small enough to be transferred to the back of a 10 mL syringe, ~1-2 cm in diameter.\nPlace a filter of desired mesh size into the back of a clean 10 mL syringe.\n\t\tNOTE: The typical size range for microgels is between 50-200 µm.\nTransfer the broken gel pieces into the syringe fitted with the filter and add 6 mL of ddH2O.\n\t\t​NOTE: The chitosan gel will swell significantly in the aqueous medium, so a large change in the gel volume is expected.\nConnect the syringe via a Luer-lock connector to another clean 10 mL syringe.\nForce the gel + water mixture through the syringe with the filter to create microgels with a specified maximum diameter.\n\t\t\nAfter the first filtration, open the back of the syringe containing the filter and extrude the mixture back into this syringe.\nReplace the back of the syringe and force the mixture through the filter again.\nRepeat the filtration 5-6x or until there is little resistance through the filter.\nRinse and purify the filtered microgels.\n\t\nTransfer the filtered gel mixture to a 50 mL conical tube, bring the total volume up to 20 mL with ddH2O, and then vortex the mixture to ensure homogeneous dispersion.\nCentrifuge the microgels at 100 x g for 5 min at room temperature and decant the upper aqueous phase.\nResuspend the microgels in 10 mL of 70% ethanol, vortex, and place under UV light for 1 h to sterilize.\nCentrifuge the microgels at 1,000 x g for 5 min at room temperature, discard the ethanol, and rinse 3x with ddH2O.\n3. Preparation of microgels for in vitro or in vivo applications\nNOTE: For the present study, cartilage regeneration in growth plate injuries was studied in a rat model. For details, see reference31.",
    "Resuspend the microgel pellets 1:1 in ddH2O. Microgels can be stored for up to 1 month suspended in ddH2O at 4 °C. If a bioactive agent is used, the microgels must be used immediately.\nCreate the injury site in the animal following a previously published report30.\nFlush the injury site with saline and either keep the animal untreated (for control study) or inject the chitosan microgels only or the microgels loaded with the bioactive agents (Step 3.2.).\nClose the wound in the animal and administer post-surgical analgesics30.\nAt days 7 or 28 post-surgery, euthanize the rat by CO2 overdose, excise the limbs and perform histology to assess the tissue repair at the injury site31.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}