{
  "id": 19065,
  "origin_website": "Jove",
  "title": "Proteome-wide Quantification of Labeling Homogeneity at the Single Molecule Level",
  "procedures": [
    "1. Cell preparation\nCultivate HeLa cells in a 10 cm dish at 37 °C under 5% CO2 in Dulbecco’s modified Eagle’s medium containing 10% fetal bovine serum.\nCollect exponentially growing cells once they have reached 70% confluency, following ATCC instructions17.\n\t\nRinse cells with 5 mL of 1x phosphate buffered saline (PBS) (pH 7.4). Remove PBS.\nAdd 1 mL of 0.1% trypsin-ethylenediaminetetraacetic acid (EDTA). Incubate 5 min at 37 °C.\nMonitor the progression of cell dissociation by microscopy.\nOnce cells become round and are detached from the dish, add 4 mL of growth medium, and break cell agglomeration by pipetting.\nCount the number of cells using a cell counter.\nCentrifuge at 150 x g for 10 min in a centrifuge tube. Remove the medium and resuspend the cell pellet with 5 mL of 1x PBS (pH 7.4).\nRepeat step 1.2.6. Resuspend cells in 1x PBS (pH 7.4) to a final concentration of 106 cells/mL using the count number in step 1.2.5.\n\t\tNOTE: The cell suspension can be aliquoted and stored at -80 °C for several months. Repeating a freeze/thaw cycle should be avoided.\n2. Cell lysis and fluorescent labeling\nMake 10 mL of lysing buffer (0.1 M borate, 1% sodium dodecyl sulfate (SDS) and 1% Tween 20). Adjust to pH 12 using 2 M NaOH.\n\tCAUTION: Concentrated NaOH is corrosive. Wear suitable gloves and glasses when preparing this solution.\n\tNOTE: Lysing buffer can be stored for up to one week at room temperature.\nMix 100 μL of lysing buffer with 1 μL of 1 M dithiothreitol (DTT) and 4 μL of 50% 3-[(3-cholamidopropyl)dimethylammonio]-1-propanesulfonate (CHAPS).",
    "Mix 1 μL of the cell culture (approximately 1,000 cells) with the mixed lysing buffer from step 2.2. Homogenize the solution by slowly pipetting to avoid bubbles. Incubate in the dark at room temperature for 5 min with gentle agitation. Re-homogenize the solution by pipetting slowly.\nAdd 1 μL of 2 μg/mL Cy3 NHS-ester dye. Homogenize the solution by slowly pipetting to avoid bubbles. Incubate for 5 min in the dark at room temperature with gentle agitation.\n\tNOTE: The high pH of this buffer causes neutralization of lysine residues in proteins, leading to a higher reactivity.\nRepeat the addition of 1 μL of 2 μg/mL Cy3 NHS-ester dye. Homogenize the solution by slowly pipetting to avoid bubbles. Incubate for 10 min in the dark at room temperature with gentle agitation.\n\tNOTE: This repeated addition of NHS-ester dye can increase the labeling efficiency because some of the Cy3 NHS-ester dye is hydrolyzed and deactivated by the high pH of the reaction buffer.\nAdjust to pH 7.2 by adding 100 μL of 0.8 M 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES)-NaOH pH 7.2 to quench the reaction. Homogenize the solution by slowly pipetting to avoid bubbles.\nAdd 20 μL of 19 mg/mL biotin-(polyethylene glycol (PEG))2-amine and 5 μL of 20 mg/mL 1-ethyl-3-(3-dimethylaminopropyl)carbodiimide (EDC). Homogenize the solution by slowly pipetting to avoid bubbles. Incubate for 1 h in the dark at room temperature with gentle agitation.\n\tNOTE: This biotinylation step is necessary to fix the protein molecules on a microscope coverslip at a fixed density and with no bias for protein species.\nRemove unreacted labeling reagents and concentrate the sample using an ultrafiltration column with 10 kDa cut-off, following the manufacturer's instructions.\n\tNOTE: The protocol can be paused here. The sample can be stored at -80 °C for several weeks.\n3. Proteome separation and recovery",
    "Add 4x SDS sample buffer (200 mM Tris-HCl pH 6.8, 4% SDS, 4% glycerol and 0.4% bromophenol blue).\n\tNOTE: To avoid dye damage, the protein sample should not be heated as done in standard SDS-PAGE, and should be kept at room temperature.\nPerform standard SDS-PAGE for the protein sample and a molecular ladder, using 20% acrylamide gel. Migrate the sample in the gel at a constant voltage (160 V) until the migration front just exits the gel.\nImage the gel to identify the location of the protein bands (Figure 3).\nCut out the gel portions including protein fractions of interest using a sharp blade, based on the band locations. Fractioning at 16, 23, 55 and 120 kDa peaks, and at 19–25, 25–32, 32–42, 42–54, 54–69, 69–97, 97–136 and 136–226 kDa regions are shown in Figure 3.\nExtract proteins using a dialyzer by electroelution with a pore size of 6–8 kDa, following the manufacturer's instructions.\n\tNOTE: The extracted sample can be stored at -80 °C for several weeks.\n4. Microscope coverslip preparation\nPrepare 200 μL of avidin buffer (5 mM HEPES-NaOH pH 7.2, 10 ng/mL avidin and 2 mg/mL bovine serum albumin (BSA)) for each sample.\nPrepare coverslips of 22 mm x 22 mm and 0.15 mm thickness. Expose the coverslips to air plasma using a plasma cleaner for 1 min to clean and activate their surfaces.\nCoat the coverslips with avidin by spin-coating 200 μL of avidin buffer using a spin coater for 5 seconds at 500 rpm, followed by 30 seconds at 1,000 rpm. Incubate the coverslips for 15 min at room temperature to let them dry.\nPrepare coverslips for the protein sample.\n\t\nDilute the protein sample (from 3.5) 100 times in 5 mM HEPES-NaOH pH 7.2.",
    "Place 100 μL of the diluted sample on the surface at the center of the avidin-coated coverslip (from step 4.3).\nIncubate in the dark for 15 min at room temperature.\nPrepare the positive control.\n\t\nPlace 100 μL of 10 ng/mL purified fluorescent biotin in 5 mM HEPES-NaOH pH 7.2 at the center of the avidin coated coverslip (from step 4.3).\nIncubate in the dark for 15 min at room temperature.\n\t\tNOTE: This positive control coverslip provides the density of avidin binding spots, which is used to calculate the LO.\nPrepare the negative control.\n\t\nSpin-coat the plasma cleaned coverslip with 200 μL of 5 mM HEPES-NaOH and 2 mg/mL BSA (without avidin).\nIncubate for 15 min at room temperature to dry.\nAdd 100 μL of 10 ng/mL purified fluorescent biotin in 5 mM HEPES-NaOH pH 7.2.\nIncubate in the dark for 15 min at room temperature.\n\t\tNOTE: This negative control coverslip provides the amount of non-specific binding of fluorescent biotin to the coverslip without avidin.\nRinse each coverslip with 200 μL of distilled water by pipetting at the edges of the coverslip so as not to touch the middle of the coverslip with the tip. Repeat this wash three times.\n\tNOTE: After aspirating water on the coverslip, water should be immediately placed back on the coverslip to prevent it from drying out completely.\nExpose air plasma to the same number of coverslips as in step 4.2.\nPlace the cleaned coverslip on the sample-bound coverslip from step 4.7 to avoid drying.\n5. Observation with single molecule fluorescence microscopy\nStart up a wide-field or evanescent field fluorescence microscope.\n\tCAUTION: Direct or scattered laser radiation can cause eye or skin damage. Wear suitable protective goggles and shield the laser light path.",
    "NOTE: For the microscope setup, please refer to our previous publication16. Briefly, a wide-field or evanescent field fluorescence microscope equipped with a high-power 488 nm laser excitation, a high numerical aperture objective lens and a high sensitivity camera can be used for this measurement. Further, for an automated measurement, a computer-controlled XY translational sample stage, mechanical shutters for laser excitations and an auto-focusing system are recommended to be installed.\nSet the coverslip on the microscope and find the focus.\nPerform a tile scan to obtain at least 100 images.\n\tNOTE: The laser illumination should be controlled with mechanical shutters to be exposed to the sample only when recording images with the camera, to minimize photobleaching. If there are many samples, automated measurement using a computer program to control the microscope devices is recommended. Each image typically includes 100–500 single molecule spots when using a 60x objective lens.\n6. Image analysis and extraction of information\nIf the image has unevenness due to the laser illumination pattern, carry out image processing to correct it18.\n\t\nAcquire a reference image by measuring with a coverslip sample consisting of uniformly-spread dyes using a camera setting the same as in step 5.3.\nAcquire an offset image by measuring with no laser excitation using the same camera setting.\nSubtract each pixel value in every sample image and the reference image with the value of the offset image.\nDivide each pixel value in the subtracted sample images by the value in the subtracted reference image.\nCollect properly acquired images and remove the image background.\n\t\nRemove images containing large fluorescent aggregates manually.\nRemove the image background by applying the rolling-ball algorithm19 with a ball radius of 50 pixels using ImageJ20.\nSharpen images by subtracting blurred images using ImageJ (sharpen image function).\nFind and analyze single molecule spots in images.",
    "Identify single molecule spots with the Yen threshold algorithm21 using ImageJ.\nFilter spots with less than two pixels to exclude dark noise of the camera and spots more than 20 pixels to exclude aggregations of proteins using ImageJ (ROI manager).\nCount the number of spots in each image. Using the illumination corrected images (step 6.1.4), analyze total intensities within pixels for every spot using ImageJ.\nCalculate the labeling occupancy (LO) using the following formula:\n\tLO = (number of counts in the sample / number of counts in the positive control) x 100\nCalculate the average number of fluorescent dyes bound to a single protein molecule (n̄dye).\n\t\nAnalyze a histogram of intensities of every spot.\n\t\tNOTE: The histogram usually has several peaks, and every peak represents a different number of dye molecules bound to a protein. The first, second and third peak in the histogram corresponds to 1, 2 and 3 molecules, respectively.\nCalculate the average intensity from the histogram. Also calculate the peak intensity of the first peak by applying a Gaussian fitting.\nCalculate n̄dye by dividing the average intensity with the peak intensity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}