{
  "id": 18948,
  "origin_website": "Jove",
  "title": "Diffusion Tensor Magnetic Resonance Imaging in the Analysis of Neurodegenerative Diseases",
  "procedures": [
    "Analysis Methods: Pre- and Postprocessing\nThe task of the following protocol is to analyze diffusion properties voxelwise within white matter tracts which could be - due to the voxelwise detection - either isotropic or anisotropic, resulting in prolate or oblate diffusion tensors for the respective voxels. The parameterization of the voxel tensors is used for either the calculation of FA-maps or the identification of fibertracts (Figure 1).\nIn order to obtain analysis results as shown in the following, use the software package Tensor Imaging and Fiber Tracking (TIFT) 17. TIFT provides analysis tools for the following requirements:\nanalysis in terms of DTI metrics, e.g. FA-maps,\nstereotaxic normalization\ngroup comparison in terms of FA or other DTI metrics\nvarious analysis approaches of FT\nFT on group averaged DTI data and the corresponding statistical analysis.\nThese features allow a variety of analyses in one software environment 17,29,30,31. The TIFT software is constantly under development for new options in DTI data analysis.\nFigure 2 gives a schematic overview how to analyze DTI data at the group level after spatial normalization by two complementary approaches, i.e. both by WBSS and by TFAS to finally obtain differences between subject samples at the group level, e.g. diseased brains versus healthy controls. Here, WBSS aims at a voxelwise unbiased detection of areas with differences at the group level, whereas TFAS is based upon pre-defined fibertracts; the TFAS starting areas can either be freely chosen or can be derived from the WBSS results (`hotspots` of significantly altered FA).\nIndividual longitudinal comparison of FA-maps is performed by detecting differences in FA-maps of measurements at different timepoints after affine stereotaxic alignment (Figure 2).\nQuality check (QC) including correction for corrupted gradient directions",
    "In case of motion disturbances during the acquisition, i.e. in case of corrupted volumes, an SNR increase is obtained by omitting single gradient directions (GD) for tensor calculation. For that purpose, a quality check (QC) algorithm 32 was developed. In brief, for scans that contained corrupted volumes, an SNR increase is achieved by omitting single gradient directions one at a time before tensor estimation: for each GD, the weighted variance is computed from all remaining directions in the sequence by weighting with the angle in which they differed from the index GD.\n\t\nPerform an artifact correction by detecting GD with at least one slice showing decreased intensity, i.e. motion artifacts caused by spontaneous subject movement (Figure 3, upper panel). For any diffusion weighted volume, compute the mean intensity for each slice and compare its intensity with the same slice in all other volumes by using a weighted average approach - the weighting factor is the dot product of vectors of two GD imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq8.jpg:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq9.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq10.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq11.jpg denotes the arithmetic average intensity of the slice under observation and imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq12.jpg a slice for comparison. The relative average intensity deviation imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq13.jpg is weighted by the dot product of the GD. Thus, in order to define a global parameter:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq14.jpg\n\t\treflects the minimum of slicewise comparisons of all slices.",
    "If Q is under a certain threshold (in the example, a threshold of 0.8 is used for this purpose), eliminate that whole volume, or GD. A threshold of 0.8 is considered a stable solution 32. Figure 3 illustrates motion artifacts visible in sagittal reconstructions and detected by the QC algorithm. In this example, out of the total number of GD (blue dots in Figure 3c), 17 were below the red line which corresponds to Q = 0.8 and should be eliminated. An example of a volume elimination statistics for a whole study is presented in Figure 3d. In this exemplary study, DTI data of 29 presymptomatic HD subjects were compared to DTI data of 30 controls. Further details of this algorithm are presented in 32, 33.\nPreprocessing and spatial normalization\nPerform the correction of eddy current-induced geometric distortions of the echo-planar imaging data sets by the method proposed by 34.\nFor the stereotaxic normalization, create a study-specific (b = 0) - template and an FA-template as previously described 17,28,31. Basically, a complete non-linear stereotaxic normalization consists of three deformation components. Consequently, the resulting diffusion tensor imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq15.jpg of each voxel i has to be rotated according to all the rotations listed above (Figure 4):\n\t\t\nFigure 4a shows a rigid brain transformation to align the basic coordinate frames. The rotation imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq16.jpg resulting from the aligning to the basic coordinate frame has to be applied\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq17.jpg\nFigure 4b shows a linear deformation according to landmarks. The components of the Eigenvectors imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq5.jpg have to be adapted according to the six normalization parameters of S (dependent on the brain region sa,, a=1...6) of the linear deformation.\n\t\t\tvw,j'''=savw,j'''\nw=1,2,3 and j=x,y,z.",
    "Figure 4c shows a non-linear normalization equalizing non-linear brain shape differences. The 3-D vector shifts are different for each voxel leading to a separate transformation for each voxel of the 3-D voxel array imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq18.jpg). Standard trigonometry gives a rotation matrix independently for each voxel, resulting from the 3-D vector shifts following the concepts of 16 in order to preserve the directional relations between Eigenvectors of neighbored voxels. Thus, different shifts of two neighbored voxels result in rotations of the corresponding Eigenvectors. Use the dilation matrices for the alignment of the tensor imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq15.jpg of each voxel to the surrounding voxels.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq19.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq20.jpg are the components of imgsrc://cloudfront.jove.com/files/ftp_upload/50427/50427eq18.jpg\n\t\tThe whole normalization process is iterative, i.e. create a scanner- and sequence-specific (b = 0) - template for this study in the first step by arithmetically averaging the (b = 0) - volumes of all subjects after linear transformation according to manually set landmarks. After this first normalization, create improved templates in order to optimize the normalization matrices. The following steps 1.2.3 up to 1.2.5 are schematically visualized in Figure 5a.\nAfter this individual normalization procedure (step (i) - DTI-data I0), use all individual DTI data sets for creating a study-specific (b = 0) - template and an FA-template (step (ii) - templates T1). As the non-affine registration to an FA-template has the advantage that it provides more contrast in comparison to (b = 0) images 10, define an FA-template by averaging all individually derived FA-maps of the patients and the controls.",
    "In a second step, following the basic ideas of Ashburner and Friston 35, perform a non-linear MNI normalization (step (iii)) of the DTI data sets by minimizing the mismatch between regional intensities of the FA-map to be fitted and of the FA-template according to the squared differences (X2) - that way, you obtain DTI data I1.\nBased on these data, new templates T2 are derived (step (iv)). Repeat this iterative process until the correlation between individual FA-maps and the FA-template is > 0.7. Usually this is reached after two iterations.\nWhole brain-based spatial statistics\n\tThe following steps 1.3.1 up to 1.3.5 are visualized schematically in Figure 5b.\n\t\nCalculate FA-maps from normalized DTI data with respect to normalization procedure of 1.2. in order to preserve directional information (step (i)).\nAs a preprocessing step before voxelwise statistical comparison, apply a smoothing filter (step (ii)) to the individual normalized FA-maps. For smoothing, the fact that the filter size influences the results of DTI data analysis 36 requires application of the matched filter theorem which states that the width of the filter used to process the data should be tailored to the size of the expected difference, as detailed in previous applications to DTI data of patients with neurodegenerative disorders (e.g. 28).\nPerform statistical comparison between the patient groups and the corresponding control group voxelwise by Student´s t-test, i.e. compare FA values of the patients' FA-maps with the FA values of the controls' FA-maps, for each voxel separately (step (iii)). FA values below 0.2 are not considered for calculation since cortical grey matter shows FA values up to 0.2 37.",
    "Statistical results have to be corrected for multiple comparisons using the false-discovery-rate (FDR) algorithm at p < 0.05 38 (step (iv)). Further reduction of the alpha error has to be performed by a spatial correlation algorithm (clustering - step (v)) that eliminated isolated voxels or small isolated groups of voxels in the size range of the smoothing kernel, leading to a threshold cluster size of 512 voxels.\nTo display the results on a morphological background (step (v)), normalize the 3-D T1 weighted data sets to MNI space and average arithmetically. Perform this normalization procedure by use of a study-specific template in analogy to the normalization applied to the DTI data sets 17.\nFigure 6 shows results of the whole brain-based spatial statistics (WBSS) of ALS patients vs. controls. Figure 6a shows the local maximum of decreased FA values in a sagittal, coronar and axial view (thresholded at p < 0.01, corrected for multiple comparisons). Figure 6b shows projectional FT with starting points in the corticospinal tract used as basis for TFAS. Figure 6c shows group differences in FA-maps detected by whole brain based spatial statistics (WBSS) between a sample of ALS patients and matched controls in a slicewise visualization.\nTractography and tractwise fractional anisotropy statistics (TFAS)\nFigure 7 illustrates the process of group-based FT including TFAS as described in 1.4.1 up to 1.4.4.\n\t\nIn order to apply group-based FT algorithms, generate averaged DTI data sets from the patients' data and from the controls' data together according to the methods previously described 17. This averaging requires careful treatment of the orientational information which is preserved during the normalization process according to techniques described by 16 - for details see 30.",
    "Perform tractography in averaged DTI data sets of subject groups by application of a streamline tracking technique 31. Identify manually defined seed points adjacent to the local maxima by the whole brain-based FA analyses which are the basis for the consecutive FT analysis. After identification of the seeds, perform tractography and define the voxels of the delineated fibers as a group-specific mask for the following TFAS 30.\nIn order to quantify the tractography results, apply the technique of TFAS by using the fiber tracts that were created on the averaged DTI data sets of all subjects of each group (patient data and control data together) for the selection of the voxels that contribute to a comparison between the patients' and the controls' FA-maps.\nConsider all resulting voxels with an FA value above 0.2 for statistical analysis by Student's t-test.\nIf desired, the TFAS technique could be applied to any derived DTI metrics, such as mean diffusivity (MD), radial anisotropy, axial anisotropy, etc. (for an example, see 28).\nThe results are displayed on a morphological background consisting of the MNI-normalized 3-D T1-weighted data sets.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}