{
  "id": 17217,
  "origin_website": "Jove",
  "title": "Laparoscopic Common Bile Duct Exploration in Patients with a Previous History of Biliary Tract Surgery",
  "procedures": [
    "A total of 177 patients with a history of biliary tract surgery who underwent LCBDE between September 2010 and December 2021 were included. This study was approved by the institutional review board in The First Affiliated Hospital of Jinan University. All patients provided written informed consent.\n1. Inclusion criteria\nInclude patients with more than two stones in the common bile duct (CBD).\nInclude patients with CBD stones that have a total diameter of ≥20 mm.\nInclude patients with a CBD diameter of ≥10 mm.\n2. Exclusion criteria\nExclude patients with hepatolithiasis.\nExclude patients with acute obstructive suppurative cholangitis.\nExclude patients with a Child-Pugh liver function of class B or class C.\nExclude patients with scheduled simultaneous biliary anastomosis.\nExclude patients with an intolerance to general anesthesia due to a poor general condition.\n3. Preoperative preparation\nAdminister preoperative blood tests including a complete blood count, liver and renal function test, and coagulation function test.\nAdminister preoperative hepatobiliary color Doppler ultrasound, upper abdominal computed tomography (CT), and magnetic resonance cholangiopancreatography (MRCP).\n4. Establishment of pneumoperitoneum and trocar placement under general anesthesia with tracheal intubation\nUse a Veress needle to establish pneumoperitoneum routinely (Veress method)11.\n\t\nMake a 10 mm long incision on the skin below the umbilicus, then clamp and lift up the skin on both sides of the incision. Insert the Veress needle into the abdominal cavity through the incision. Then, inject carbon dioxide gas and maintain a pneumoperitoneum pressure of 12 mmHg.\nIf the Veress method fails, change to the open method (Hasson method)11.",
    "Using the conventional laparotomy method, incise the abdominal wall layer by layer to the depth along the skin incision made by the Veress method to reach the abdominal cavity. Place the observation port into the abdominal cavity through this incision. Inject carbon dioxide gas and maintain a pneumoperitoneum pressure of 12 mmHg.\nPlace the observation port (the first trocar) around the umbilicus as far as possible to fully explore the abdominal cavity. At the same time, keep the first trocar at least 5 cm away from the previous open incision, or at least 2 cm away from the previous laparoscopic incision, to avoid damage to the intestine adhered to the abdominal wall.\nAccording to the adhesion situation observed in abdominal cavity exploration, arrange the trocars typically in a triangular shape with the surgical area as the target. At the same time, take the separation of adhesions, choledochoscopic lithotomy, and T-tube and drainage tube indwelling into consideration.\n5. Surgical approaches\nHepatic round ligament approach: Separate and release the abdominal adhesions along the hepatic round ligament to the inferior liver margin, and then to the hepatic hilum in order to expose the CBD.\nAnterior hepatoduodenal ligament approach: Separate the duodenum from the hepatic hilum downward to expose the CBD anterior to the hepatoduodenal ligament.\nRight hepatoduodenal ligament approach: Separate the hepatic flexure of the colon, adhered to the hepatic hilum, from the hepatic hilum, starting from the right lateral side of the hepatoduodenal ligament downward to expose the area between the right subhepatic space and the omental foramen, thereby determining the position of the CBD.\nHybrid approach: Combine two or three of the above approaches.\n\tNOTE: This mainly depends on the location of adhesion.\n\t\nIf there is adhesion in the middle of the anterior abdominal wall, use the hepatic round ligament approach.",
    "If there is adhesion in the front and on both sides of the CBD, use the anterior hepatoduodenal ligament approach.\nIf there is adhesion in the right upper abdomen, use the right hepatoduodenal ligament approach.\nIf there is extensive adhesion in the abdominal cavity, use the hybrid approach. The hybrid approach is the most commonly used method in this study.\nUse the above three approaches flexibly and alternately, and start the separation from near to far, from simple to complex, and from loose tissues to adhered and dense tissues.\n6. Adhesion separation and CBD exposure based on anatomical landmarks\nParietal peritoneum and gastrointestinal serosa: Use noninvasive grasping forceps to clamp and pull the gastrointestinal tract adhering to the abdominal wall with appropriate traction tension, and separate and release the adhesions close to the parietal peritoneum and away from the gastrointestinal serosa.\n\t\nSeparate the loose adhesions with a blunt dissection or ultrasonic scalpel, and release the dense adhesions or adhesions involving intestines with scissors to avoid thermal damage (Figure 1).\nHepatic round ligament: In patients with a history of biliary tract surgery, there are often mutual adhesions between the gastric antrum, duodenum, liver, and abdominal wall. Find the inferior liver margin by separating the adhesions upward along the hepatic round ligament, and expose the gastric antrum and the duodenum (Figure 2 and Figure 5).\nInferior liver margin: After exposing the inferior liver margin through the hepatic round ligament, separate the adhesions downward along the visceral surface of the liver, and further expose the gastric antrum and the duodenum. Separate the adhesions at this location close to the liver, under the principle of injuring the liver rather than the gastrointestinal tract if injury is unavoidable (Figure 3, Figure 4, and Figure 5).",
    "Gastric antrum and duodenum: The gastric antrum and the first and second segments of the duodenum tend to move up and seal the first hepatic hilar region through adhesions. Separate the adhesions downward along the visceral surface of the liver from the inferior liver margin and expose the gastric antrum and duodenum. Then, lower the gastric antrum and duodenum to further expose the CBD (Figure 4, Figure 5, and Figure 6).\nHepatic flexure of the colon: Separate the adhesions between the omentum, intestine, and abdominal wall of the right upper abdomen, and find the hepatic flexure of the colon. Separate and lower the hepatic flexure of the colon from the right inferior liver margin. Expose the CBD by separating the adhesions from the right subhepatic space to the omental foramen (Figure 3).\n7. Sequential lithotomy\nLaparoscopic lithotomy with forceps: Push the lower segment of the CBD using noninvasive grasping forceps, and squeeze the large stones toward the incision of the CBD. Take out the stones directly using forceps.\nLaparoscopic lithotomy via blind basket extraction: Insert the stone basket into the CBD and open it. Then, pull the basket up and down repeatedly without choledochoscopic assistance. Take out the stones that cannot be squeezed toward the CBD incision via blind basket extraction, which substantially shortens the time of choledochoscopic lithotomy.\nStone removal by flushing the CBD with saline: Insert a silicone tube into the CBD. Use a 50 mL syringe to inject saline into the CBD through the silicone tube and flush out the small stones.",
    "Choledochoscopic lithotomy: Insert the choledochoscope into the CBD, and continuously inject saline through the choledochoscope flushing channel. Put the stone extraction basket into the CBD through the instrument channel of the choledochoscope and open it, then take out the stones under the direct vision of the choledochoscope.\nLithotripsy: According to the diameter of the CBD, insert the sheath of the nephroscope of appropriate size into the CBD through the abdominal puncture port. Then, insert the nephroscope into the common bile duct through the sheath, and continuously inject saline.\n\t\nPerform pneumatic ballistic lithotripsy or holmium laser lithotripsy under the direct vision of the nephroscope.\n8. T-tube indwelling or CBD primary suture\nPrimary suture the CBD for patients with a definite effect after lithotomy, a CBD diameter of ≥10 mm, and no evident stenosis of the lower segment of the CBD.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}