{
  "id": 8689,
  "origin_website": "Jove",
  "title": "Cochlear Implant Surgery and Electrically-evoked Auditory Brainstem Response Recordings in C57BL/6 Mice",
  "procedures": [
    "All procedures were carried out according to Basel University, Switzerland, animal care and guidelines. They were licensed by the Veterinary Office of the Canton of Basel, Switzerland.\nNOTE: C57BL/6 adult mice, aged 8–12 weeks (weight 20–30 g), were used in this study.\nThe left ear is used as the experimental ear. The right ear serves as an intra-animal control and is not surgically altered.\n1. Preoperative Procedures\nAnaesthetize the animal 30 min prior to surgery via intra-peritoneal (i.p.) injection of ketamine/xylazine (80 mg/kg ketamine, 16 mg/kg xylazine, i.p., volume injected at 10 μL/g body weight).\nSupplement anesthesia as necessary, as judged by a positive pedal and palpebral (toe-pinch) reflex and movement of the whiskers, with a lower dose of ketamine (45 mg/kg, i.p., injected at 10 μL/g body weight). Agents and dose regimes can be substituted per institutional guidelines.\n\t\tNotes: In general, the animal will need an injection every 45–60 min with this agent and dose regime. The average time from initial incision to closure around the implanted electrode array is typically 1-1.5 hours.\nCheck for full sedation of the animal marked by a regular breathing rate and a lack of toe-pinch reflexes. Maintain this level of anesthesia.\nMaintain the animal's body temperature at 36.6 °C with a closed-loop heating pad. Apply eye ointment to avoid dehydration of the cornea. This will also suppress the animal's blink reflex, which can add noise to the recoding.\nAdminister local analgesic via subcutaneous injection (s.c.) of bupivacaine/Lidocaine (0.1 mg/mL bupivacaine and 0.4 mg/mL lidocaine, 0.1 mL administered s.c.) along the intended incision line to minimize any surgical discomfort. Agents and dose regimes can be substituted per institutional guidelines.",
    "Administer the muscarinic antagonist atropine (atropinesulfate amino, 0.1 mg/mL, 20 μL administered s.c., dissolved in PBS) in the neck to reduce mucus secretion and to facilitate breathing. Agents and dose regimes can be substituted per institutional guidelines.\n2. Pre-deafening Acoustic Auditory Brainstem Response (aABR)\nNOTE: aABR is used to measure the status of hearing before and after deafening. Testing is performed on the left ear and in a soundproof electrically shielded booth. We recommend to test and later implant the left ear for a right-handed person. Further details on ABR in mice can be found in13,14. Tucker Davis Technologies (TDT) hardware and software (BioSig) are used to record ABR but other systems can be used.\nBlock the contralateral (right) ear with acoustic foam to isolate the ABR response from the ipsilateral (left) ear. Put the foam in a 1 mL syringe and inject it into the right ear canal of the mouse to cover the whole ear canal with foam (0.1–0.2 mL of foam). Make sure the syringe seals closely to the ear so that the foam gets all the way into the ear canal.\nPlace the speaker 10 cm from the left ear.\nNOTE: The speaker for this setup was calibrated using a PCB microphone as described in refefence15.\nClean the ABR electrodes with 70% ethanol solution. Place the electrodes under the skin: active (Ch1) on the vertex, reference (-) below the pinna of the ipsilateral ear, and ground in the hind leg (Figure 1).\nConnect the head-stage and pre-amplifier to the auditory processor via the optic fiber port.\nCheck the impedance of the active and reference electrode.\nIf the impedance is over 3 Ohm, re-arrange them and re-take the measurement. The best recordings are obtained when the electrodes have the same impedance. Close the sound-proof booth.",
    "Present click stimulation and record ABR in a free-field condition with a complex auditory processor and software. Standardize the click stimulus in the software: 0.1 ms single-channel monophasic clicks are presented at 21 Hz; Click level decreases from 90 dB SPL to 10 dB SPL in 10 dB steps; 10 ms recording window. Average a total of 512 responses at each dB level.\nApply a 2,000 Hz lowpass filter and a 300 Hz highpass filter offline to reduce noise in the recording using a custom-made Matlab script.\nDetermine the ABR threshold as the lowest dB level with a recognizable ABR wave response (Figure 2, Figure 3).\n3. Surgery\nNOTE: Typical instruments used include a scissor, a scalpel, a pair of metallic forceps with straight or curved tips, a tissue retractor tool, several suction wedges and absorbable paper points. The surgery is performed on the left ear.\nPut the mouse on its right side. Avoid undue torsional stress on the cervical vertebrae. Make sure to keep the body straight to keep the airways open.\nCut the fur behind the left ear with a scissor (or shave it with a shaver) to expose the skin. Sterilize the skin with 70% ethanol solution and betadine (povidone/iodine).\nUnder microscopic magnification (16x), make a 1–1.5 cm post-auricular incision with the scalpel.\nSwitch to higher microscopic magnification (25x).\nPerform blunt dissection through the subcutaneous fat layer, which can be of variable thickness, with forceps.\nNOTE: Be careful when dissecting as the external jugular vein traverses this area. Damage to this structure can cause excessive bleeding.",
    "Retract the sternocleidomastoid muscle to reveal the tympanic bulla periosteum. Use the facial nerve as a key anatomical landmark to aid identification of the auditory bulla. The facial nerve wraps around the posterior/dorsal edge of the sternocleidomastoid muscle and runs rostrally along the ear canal towards the pinna. Gently place the self-retaining retractor tool in the incision to ease access to the bulla (Figure 4).\nRemove the tissue overlying the medio-dorsal area of the bulla to allow clear visualization of the ridge between the bulla and the mastoid process.\nGently rotate a 30 G needle to pierce the bulla and make a hole (bullostomy) on the posterior-superior side of the ridge (the bone is thinner on this side). Alternatively, use a dental surgical drill.\nNOTE: This and the following steps can be done with even higher microscopic magnification (40x) if preferred. Also, change the position of the microscope if needed. It is important to maximize the surgical view of the middle ear space.\nWiden the bullostomy by pinching small bone pieces using fine tipped forceps to expose the middle ear cavity. Extend the bullostomy dorsally towards the mastoid process until the round window niche is clear of overlying bone. The stapedial artery, a branch of the internal carotid artery, runs ventral to the round window niche.\nBe careful not to damage the vessel as excessive bleeding may be fatal. Small bleeds can be stopped by pressing a small piece of spongostan in the inner ear cavity.\nExtend the bullostomy toward the anterior-superior direction to visualize the stapes, the middle ear bone connected to the oval window.\nRemove the stapes with forceps to expose the oval window.\n4. Round Window Application of Ototoxic Agent",
    "Gently perforate the round window and oval window membranes using a blunted 30 G needle. Check that perilymph runs out.\nSlowly perfuse 0.05% weight/volume neomycin dissolved in PBS (adjusted to pH 7.4) through the oval window. Liquid should flush out of the round window. Repeat the same procedure on the round window. Be careful not to damage the window bone structures with the needle used to perfuse.\nPlace a small piece (1 mm2) of spongostan soaked in neomycin within the round window and oval window niche.\nRemove the retractor tool, close the incision and wait 30 min.\n5. Post-deafening Acoustic ABR\nRecord aABR in a similar way as before deafening (Steps 2.2 to 2.8) (Figure 2b, Figure 3).\n6. Insertion of CI Electrode Array\nNOTE: The intracochlear electrode array consists of four platinum bands (Ø0.2 mm) with platinum/iridum parylene insulated wire shielded in a silicone tube (Figure 5).\nPlace the retractor tool in the incision to re-access the bulla.\nInsert the electrode array into the round window (scala tympani) at a depth where the 4th platinum ring is located just inside the round window. This gives an insertion depth of ~2 mm, corresponding to an intracochlear position at ~30 kHz16.\nCoil the lead wire inside the bulla and glue the wire to the tissue above the bulla. Coiling the wire helps to keep the array in place throughout the experiment.\nCarefully remove the retractor and close the insertion with tissue glue.\nMake a small incision (0.5 mm) in the neck perpendicular to the line between where the active and reference ABR electrodes will be using a tissue scissor. Place the platinum ground ball in the subcutaneous pocket and close the small incision with tissue glue (Figure 6).\nConnect the electrode array board to the Animal Stimulator Platform.",
    "7. Electric Auditory Brainstem Response (eABR)\nNOTE: An Animal Stimulator Platform (ASP) is used to electrically stimulate the electrode array. Other current sources and software systems can be used.\nPlace the ABR electrodes as before (Steps 2.3 to 2.5) (Figure 6).\nOpen the ASP software and define the electric pulse stimulation paradigm. We use a charge-balanced biphasic pulses with 50 μs/phase and 10 μs interphase gap presented at 23.3 pulses per second (pps). The electric stimulation is delivered in monopolar electrode configuration with increasing current levels. A total of 400 responses are averaged at each current level.\nPresent the electric pulse trains and record the evoked eABR response continuously via the TDT headstage, pre-amplifier and auditory processor.\nPlot and analyze the eABR data via a custom-made matlab script (Figure 7). The script and an example of a recording are provided in the Supplementary.\n8. End of Experiment\nAt the end of the experiment, euthanize the animal according to institutional guidelines.\nCarefully open the incision and remove the implant.\nUltra-sonicate the electrode array in distilled water for 10 min to remove tissue debris.\nNOTE: The implant can be reused several times if the electrodes are intact and properly conducting. To check this, measure the impedance of the electrodes with a multimeter when the array is dry.\nStore the electrode array in a dry place."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}