{
  "id": 8065,
  "origin_website": "Bio",
  "title": "Metabolic Labeling of Yeast RNA with Radioactive Uracil",
  "procedures": [
    "Inoculate yeast single colony in SD medium (or SD with appropriate dropouts). Shake 300 rpm at 30 °C overnight. Dilute overnight culture in 50 ml conical tubes to 10 ml, OD600 =0.1 with SD-1/3 uracil and continue shaking until OD600 =0.4 (note: Reduction in cold uracil will allow hot uracil to be taken up by cells easily).Cells were treated with drug and control vehicle, for example 100 nM rapamycin (final concentration) and its solvent methanol, continue shaking 300 rpm at 30 °C for desired time. In this specific experiment, rapamycin were added for 30 min.Collect yeast cells by spinning down at 1,000 x g for 1 min at room temperature, remove supernatant (critical: Avoid putting yeast cells on ice. This is because ice will slow down growth, which will reduce significantly the uptake of hot uracil in the step 8 below).Re-suspend yeast cells in 1 ml SD-Ura- (critical: Pre-warm medium to 30 °C), transfer to 1.5 ml eppendorf tube. Spin down briefly by a bench top centrifuge at 5,000 x g, 15 sec, remove supernatant. Re-suspend yeast cells in 1 ml pre-warmed SD-Ura-. Repeat 6 for 2 times and with the final re-suspension in 0.5 ml pre-warmed SD-Ura- (from the next step, collect radioactive liquid and solid waste in all steps, dispose according to environmental regulation).Carefully add [5, 6-3H]-Uracil into each tube to the final concentration of 15 μCi/ml, vortex to mix, then put on a rack at 30 °C for 5 min. Briefly spin down by a bench top centrifuge at 5,000 x g, 15 sec, remove supernatant.Wash cells with SD-Ura-3 times as in step 5, ready to extract total RNA. Total RNA was extracted by hot phenol method described in Wei (2012).RNAs can be stored at -80 °C for up to 6 months.",
    "Prepare ''small RNA separating gel'' on a large gel set (around 20 x 30 cm, mini gel did not work well).Pre-run the gel for about 1 h at constant 450 V until the gel is heated to 50 °C. Note: I found this step to be critical. One reason could be that pre-running the gel to this temperature could help get rid of excessive Urea in the gel, making RNA possible to go through. I usually attached a thermometer to ensure that the temperature has reached 50 °C.Mix RNA samples with ''2x Formamide loading dye'' and heat at 70 °C for 2 min, then put samples on ice.Turn off power. Rinse the wells with 1x TBE using a syringe with needle, make sure all urea is rinsed out from the wells. Note: Urea is very dense and it will be impossible to load samples if urea is not rinsed out. If residual urea remains in the well, the resulting bands will be waving.Load RNA samples (25 μg) with appropriate RNA marker and run gel at constant 450 V for about 2 h (BPB runs around 12 nt and cyanol around 55 nt). Stain the gel with EtBr and take picture under UV light. This is total RNA which served as controls for newly synthesized RNA.Sandwich the gel with autoclaved filter paper on one side and Saran-Wrap on the other side, put on a gel-dryer with filter paper side attach to the vacuum surface. Dry the gel at 80 °C for at least 2 h. Sometimes gels get cracked, may be because of insufficient drying or leaky vacuum.The dried gel will stick to the filter paper. Wrap them in Sara-Wrap. 3H autoradiography in an exposure cassette with appropriate intensifying screen, for example Sigma Transcreen.Develop after 4-7 days of exposure."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}