{
  "id": 19448,
  "origin_website": "Jove",
  "title": "Assessing Corticospinal Excitability During Goal-Directed Reaching Behavior",
  "procedures": [
    "All methods detailed here were performed in compliance with IRB protocol and approval (University of Oregon IRB protocol number 10182017.017). Informed consent was obtained from all subjects.\n1. Reaching apparatus\nPlace a large graphics tablet flat on a desktop.\nUse an adjustable 80-20 aluminum frame to position the task monitor 6-8 in above the tablet in parallel, with the screen facing upward (for a blueprint, check here: https://github.com/greenhouselab/Reach_TMS and Supplementary Figure 1).\n\tNOTE: This setup allows for participants to reach across the tablet and acquire targets presented on the task monitor while occluding vision of their reaching arm.\nUse the setup described in Kim et al.3 as a reference.\n2. Machine interfaces\nConnect the tablet to the computer via a USB port. Connect the task monitor to the computer via the HDMI port. Connect the rear TMS port to the computer via a DB-9 cable.\nConnect the EMG system to the computer via a PCI-6220 card DAQ. Connect the photodiode to the EMG system via a BNC cable.\n3. Photodiode sensor\nAttach a photodiode sensor to the BNC cable. Secure the photodiode sensor with tape to the top-right corner of the task monitor, with the sensor facing the screen, ≤ 1 cm away.\n\tNOTE: This will record the timing of stimuli presented on the task monitor as analog data in an independent input channel.\n4. Software\nDownload VETA Toolbox26 (https://github.com/greenhouselab/Veta) for MATLAB 2018 to interface with the hardware for data collection.\nDownload the reaching task code (https://github.com/greenhouselab/Reach_TMS) developed for the control of experimental parameters and interfacing with the tablet.\n5. Participant screening and informed consent",
    "Screen the subject for contraindications to TMS. Exclusion criteria include a personal or family history of seizure, headache, brain trauma, fainting, chronic stress or anxiety, problems with sleep, and any neuroactive medication. Additional exclusion criteria include any metal implants in the brain or skull and any recreational drug or alcohol use in the 24 h prior to testing. Inclusion criteria included right-handedness and age between 18 and 35 years.\nProvide a written explanation of the procedure and associated risks, clarifying any further questions the participant may have.\nObtain informed consent from participants.\n6. Subject setup\nPosition the subject in a comfortable chair facing the tablet. Ensure that the knees are flexed to 90° with the legs under the desk.\nPrepare the skin and place EMG electrodes.\n\t\nUse fine-grain sandpaper to gently abrade the skin at the site of the right first dorsal interossei (FDI), extensor carpi radialis, and anterior deltoid muscles, as well as the C4 prominence at the base of the neck, to detect electrical artifacts produced by the TMS pulse.\n\t\tNOTE: Muscle recording sites can be adapted based on user needs.\nSwab each abraded area with an alcohol prep pad once per electrode site to clean.\nPlace one EMG electrode on each site. Ensure that the electrodes run perpendicular to the muscle fibers. Place the ground electrode on the bony prominence of the right elbow.\nSecure each electrode with medical tape.\nCheck the quality of the EMG recording. Use the VETA toolbox to visualize all EMG traces and ensure they are free of artifacts. If EMG traces are noisy, ensure the ground is properly placed and that all electrodes make proper contact with the skin.\n7. Transcranial magnetic stimulation\nTurn on the TMS machine.",
    "Find the TMS hot spot of the right FDI muscle via stimulation of the left M1.\n\t\nPlace the coil ~5 cm lateral and 2 cm anterior to the vertex of the head, oriented ~45° off the midline.\nAdminister TMS pulses once every 4 s while repositioning the coil in increments of approximately 5 mm in the anterior-posterior and medial-lateral plane.\nBeginning at 30% maximum stimulator output, gradually increase the TMS intensity by 2% increments until MEPs are observed.\nOnce the optimum location is identified, at which MEPs can be reliably elicited on the majority (~75%) of pulses at the lowest possible stimulator intensity, determine the resting motor threshold (RMT) by finding the intensity level that produces MEPs with a peak-to-peak amplitude of >50 µV on five out of 10 pulses.\nMark the position by gently placing thin strips of reflective tape on the participant's head along the perimeter of the coil. Maintain coil positioning either by manually holding the coil or using a stand to support it.\n8. Reaching task setup\nPut a Velcro glove on the right hand of the participant to facilitate a relaxed power grip posture.\nAttach the stylus to the glove and advise the subject to keep the hand relaxed between reaching movements.\nCommunicate the task instructions, which are as follows: Guide the cursor to the home position on the bottom of the screen. You will see a cue at one of two target locations. When the target fills in with color, reach through the target as fast and as accurately as possible. Then return to the home position. Indicate locations of home positions, cues, and targets (Figure 1A).",
    "Coach the participant to slice through targets with the stylus as quickly and as accurately as possible. Turn off the lights in the task room to obscure the participant's vision of arm movements and improve the visibility of the task monitor.\n9. Task design\nControl visual stimulus presentation with Psychtoolbox 3.0 in Matlab 2018 (Supplementary Coding File 1).\nUse the following parameters to match the current data: 20 practice trials; 270 test trials; TMS on 4/5 of test trials; TMS either coincides with the preparatory cue onset (baseline TMS) or 100 ms before the imperative cue (delay TMS) with equal frequency; 1/10 of total trials are catch trials, in which the imperative cue does not appear; the home position is a circle with a 2 cm radius positioned in the bottom center of the workspace; two circular targets with 1 cm radius are positioned 15 cm from the home position at +45° and -45° away from the midline.\nSet the event order and durations as follows: preparatory cue at 900 ms and imperative cue at 900 ms.\n10. TMS administration\nThe VETA toolbox concurrently administers TMS and records EMG https://github.com/greenhouselab/Veta.\nControl the timing of the TMS pulses with the VETA toolbox to coincide with the chosen behavioral events (i.e., the onset of the preparatory cue or 100 ms preceding target onset).\nDeliver TMS with sufficient frequency to ensure a sufficient number of MEPs for analysis.",
    "NOTE: As written, the task code will deliver a TMS pulse on 4/5 of total trials either at the onset of the preparatory cue-to elicit baseline MEPs-or 100 ms before the imperative cue-to elicit delayed MEPs. Parameters can be adjusted in the code according to user needs. Trials without TMS can be used to evaluate behavioral performance in the absence of TMS. This is useful for determining any possible influence of TMS on performance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}