{
  "id": 5389,
  "origin_website": "Bio",
  "title": "Extracellular Axon Stimulation",
  "procedures": [
    "Figure 1 illustrates the experimental setup and electrode placement. To stimulate an axon, a section of the nerve of interest will be electrically isolated from the rest of the nervous system by using a petroleum jelly well. The success of the stimulation will be monitored by extracellularly recording the elicited AP on a spatially distant part of the axon.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301082837_9641.jpgFigure 1. Schematic of the experimental setup and electrode placement. Illustrated is a Petri dish that contains the nerve. The blue cylinders represent petroleum jelly wells, the black lines illustrate electrode placement and their connection to stimulation and recording equipment.Preparing petroleum jelly syringesTransfer petroleum jelly to a glass beaker.Place glass beaker on heating plate and warm petroleum jelly up until it is fully melted.Note: The melting point of petroleum jelly is between 45 °C and 60 °C. Avoid boiling! Boiling will create air bubbles. Take the 5 ml Luer lock syringe and fill it with the melted petroleum jelly by pulling the jelly up through the tip.Note: Wear gloves to protect yourself from burns.Let the filled syringe sit at room temperature until petroleum jelly is solidified.Note: To prevent air bubbles, place the filled syringe upwards (with the tip towards the ceiling) until the petroleum jelly solidifies.Cut off the tip of a 20-gauge injection needle using the wire-cutting pliers. Note: Use sand paper to smoothen the sharp edges.Bend the front part of the injection needle by an angle of ~70° (Figure 2).Add the needle to the syringe.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301083127_6775.jpgFigure 2. Petroleum jelly filled syringe used for preparing the extracellular stimulation/recording wellsPreparing stimulation and recording electrodesNote: Repeat the following steps to create all necessary electrodes including the stimulating, recording, and grounding electrodes. The stimulating and recording electrodes require both a red and black wire, while the ground only needs a single wire.",
    "Cut the electrical wires to the desired length.Use the wire stripper to remove 5 to 10 mm of the insulation on each side of each red/black wire.Take the pre-heated soldering iron and coat the stripped part of the cable with tin-solder (Figure 3A).Take needle-nose pliers and bend the tin-solder covered wire part into a loop (Figure 3B).Pass the stainless steel wire through the loop.Note: Instead of stainless steel wire, minutien or sewing pins can be used as well.Fill the loop with tin-solder to attach the stainless steel wire to the black/red wire (Figure 3C).Use a voltmeter to check if the stainless steel wire has the proper electrical contact with the wire.Solder a suitable plug onto the other side of the cable to attach it to the stimulator/amplifier.Use heat shrink tubing to insulate the blank solder joints. In addition to stimulation and recording electrodes, a single ground electrode is necessary to reduce recording noise and stimulation artifact. Repeat the above steps using a black wire to build a single electrode.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301083308_5198.jpgFigure 3. Preparation of extracellular stimulation/recording electrode. A. Electrical wire with insulated and tin-solder coated front part B; Same wire, bent into a loop; C. Stainless steel wire attached to loop with tin-solder.Dissect the nerve of interestNote: For a detailed protocol how to dissect the stomatogastric nervous system of C. borealis please review (Gutierrez and Grashow, 2009). Transfer the nervous system to a silicone lined Petri dish.Note: The silicon elastomer should coat the bottom ~5 mm of the Petri dish.Place the nervous system in the middle of the dish.Fill the Petri dish with physiological saline (see Table 1 for C. borealis saline). Use minutien pins to mount the nervous system by either directly pinning through the end of nerves or by pinning through connective tissue still attached to the nervous system.",
    "Note: Do not pin through the section of nerve being recorded as this will damage axons.Secure the dish from displacement by attaching it to the work surface with modeling clay (Figure 4).Place the ground electrode into the bath. Use the modelling clay to prevent the ground electrode from displacement. Connect the ground wire to the amplifier ground.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301083544_7059.jpgFigure 4. Petri dish with isolated stomatogastric nervous system. The photo shows the placement of the stimulation and recording wells along a stomatogastric nerve, saline inflow and outflow, and ground wire. The Petri dish is attached to the work surface with modelling clay. For extracellular stimulation and recording, no vibration isolation laboratory tables are needed. For better visualization, nerves have been retraced (gray and pink lines). Prepare the extracellular stimulation/recording wells.With the use of a stereomicroscope make two concentric circles at two locations on the nerve of interest with the petroleum jelly filled syringe as shown in Figure 5. One well will serve as stimulation well, the other will serve as recording well. Add layers of petroleum jelly until the wells extend above the saline level (Figures 5A and 5B). Note: The well isolates a small section of the nerve from the rest of the bath as petroleum jelly is nonconductive.Ensure that the wells are tight and not leaky. Note: Add one or two drops of saline to the inside of the well. If the level of saline does not decrease, the well is sufficiently tight and isolates the nerve section from the rest of the dish (Figure 5C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301083727_8090.jpgFigure 5. Petroleum jelly well preparation. A. An initial concentric circle was formed around a small section of the nerve of interest. B. Finished well. Petroleum jelly layers were added until the top most layer extended out of the saline. C. Leak test.",
    "Saline was added inside the well to test if it is sufficiently isolating the nerve section from the rest of the bath.Place stimulation electrodes.Connect the stimulation cable with the stimulator (red wire = cathode, black wire = anode). Use forceps to place the steel wire (cathode) inside the stimulation well (Figure 6). Firmly press the wire into the silicone. Note: Avoid puncturing nerve or well. Place the end of the electrode deep enough into the silicone so the wire will not become dislodged at any point during the remainder of the experiment. Use forceps to place the anode outside of the well, but still close to it. Note: Wires must not touch each other since this will create a short circuit and axons will not be stimulated. Secure the wires using modelling clay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301084003_8946.jpgFigure 6. Arrangement of stimulation wires in the petroleum jelly wellRepeat step 8 for the recording wires. Turn the extracellular amplifier on and check if spontaneous APs are visible on the extracellular recording. Notes:  For C. borealis, the amplifier filter settings should: amplification: 10,000; high pass filter: low cut-off 100 Hz; low pass filter: high cut-off 500 Hz. Detected AP waveforms do not directly reflect membrane potential changes. APs are detected using a differential recording between the inside and the outside of the recording well.Stimulate the nerve extracellularly.Initially, set the stimulation parameters on the Master8 to 1 ms stimulation pulse duration, 1 Hz stimulation frequency, and 0 nA/Volt. After the stimulation threshold has been determined, more physiological parameters may be used.Use the extracellular recording to first identify the stimulus artifact (Figures 7A and 7B).Note: Stimulation artifacts can be easily distinguished from APs because the size of the artifact increases linearly with stimulus amplitude. If the stimulation artifact is too large, the polarity of the cables should be reversed.",
    "The stimulation artifact will be smallest when the cathode (and not the anode) is placed inside the stimulation well. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301084203_6347.jpgFigure 7. Adjustment of the extracellular stimulation threshold. Shown are extracellular recordings of a nerve in the stomatogastric nervous system during subthreshold (A, B), threshold (C) and suprathreshold stimulation (D). A. During subthreshold stimulation with low stimulus amplitude only the stimulation artifact can be observed, but no AP. The artifact occurs simultaneously with the stimulus pulse. B. Increasing stimulation amplitude below threshold will not elicit APs, but increase the stimulation artifact amplitude. C. Increasing stimulus amplitude to threshold elicits an AP. Its waveform appears with a fixed time delay after the stimulation artifact (gray box). The axon with the largest diameter in a nerve will be recruited first. Note that the AP waveform does not represent the different phases of an AP, but rather the potential difference between the inside and outside of the petroleum jelly well as the AP enters and leaves the well. D. Increasing the stimulation amplitude above threshold recruits additional, smaller diameter axons. Note that the shape and amplitude of the detected waveform changes when other axons are recruited (compound AP). For better visualization, the artifact amplitude was cropped (indicated by *).Determine the stimulation threshold by slowly increasing the stimulation amplitude until an AP becomes visible (Figure 7C).Note: The AP should appear with a time delay after the stimulation artifact. APs can be distinguished from the artifact because they occur only after stimulus threshold is reached, and their time of occurrence and amplitude does not increase linearly with the stimulus amplitude.",
    "Note that if stimulus amplitude is further increased, APs from other axons may be recruited, which will change the size and shape of the detected signal (compound APs during suprathreshold stimulation, see Figure 7D and Video 1).If the recording software has a trigger function, use it to control the sweeps of the extracellular recording to permit a fast time base, and a comparison of stimulus artifact and AP shapes.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Video clip illustrating subthreshold, threshold and suprathreshold stimulation"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}