{
  "id": 12621,
  "origin_website": "Jove",
  "title": "New Variations for Strategy Set-shifting in the Rat",
  "procedures": [
    "All procedures for the use of animals were approved by the Animal Care and Use Committee at the Okinawa Institute of Science and Technology.\n1. Animals\nObtain male Long-Evans rats (250-300 g on arrival).\nUpon arrival, house a group of two or three rats together for a week and later separate them into individual cages. Note that this experimental design involves food-restriction and needs to hold an animal in each cage to control the amount food consumed.\nProvide all animals with food and water ad libitum, and house them under standard conditions (12 hr/12 hr light/dark cycle, at 23 °C).\n5 days before the beginning of behavioral experiments, food-restrict animals at approximately 85% of their average weight with free access to water throughout experiments.\nHandle animals for 5 min a day for a minimum of 5 days before the beginning of experiments in order to familiarize them with an experimenter.\n2. Hardware and Software for Behavioral Tests and Analyses\nHardware\nUse an operant chamber equipped with a sound attenuating box.\nThe chamber is incorporated with several additional attachments: two receptacle levers on the front panel, two light cues just above the levers, a magazine spot with a sensor for detection of head entry between two levers, a food dispenser, a pure tone generator and a house light on the rear panel.\nSoftware\nControl all the behavioral events under a programmed code written by Trans IV software. Use Med-PC IV software to signal and detect all the behavioral events during training and a test.\nUse Trans IV for writing code for behavioral testing. Open a new file for writing.\nOnce the program is written, translate and compile it within the software. Modify the code if errors are detected and retry.",
    "Upon successful debugging of a program, check if user's code works properly by conducting a trial-run before actual initiation of experiments.\nUsing MED-PC IV, run behavioral experiments. Open the software, click \"open session\" and assign a single program to each box.\nAfter all the programs have been properly assigned to each box, send signals necessary to start experiments.\nAfter the completion of the task, save data as clicking \"Save Data\" or write code to automatically save data (for details, see programmer's manual for MED-PC IV).\nOnce data is exported to a designated folder, rename the data as acquisition date and animal ID numbers for later use. The collected data is imported into Matlab for behavioral analyses described below (Protocol, 3.7).\n3. Behavioral Training and Testing\nHabituation and Magazine training.\nPresent no levers to animals during those phases.\nDuring the habituation phase, place animals in an operant chamber for 20 minutes a day. On the same day, give 10 sucrose pellets (45 mg) to animals in their home cage, which familiarize them to the sucrose reward.\nNext, begin magazine training. Place animals in the chamber and give 20 sucrose pellets (1 pellet per a minute) to the animals, providing an opportunity to learn the location of the food tray and acquisition of the pellets.\n\t\tNOTE: Those phases can be skipped due to potential confusion of animals on obtaining a pellet without an operant response, even though we adopted them to make animals familiarized with a chamber and eating from a food tray.\nContinuous reinforcement schedule\nTrain animals on a continuous reinforcement schedule to obtain a reward by pressing a lever. A session of this training lasts until 60 pellets have been received (60 lever-presses) or 40 min has elapsed.",
    "Present either the left or right lever throughout the first half of a session (until 30 pellets are obtained), followed by the presentation of the opposite lever during the second half. The order is alternated on a daily basis.\nContinue this reinforcement schedule until animals have successfully obtained 60 rewards for at least 2 consecutive days. Note that there may be high variability among animals of how quickly they make the first lever-press and this may affect the progress of reinforcement. In this case, put a few sucrose pellets on a presented lever to motivate them to approach toward the lever when no response has been made over the first session.\n\t\tNOTE: A possible alternative is to put sucrose pellets when the lever is first presented to animals in order to make the completion of this phase faster.\nTime schedule for a trial in lever-press training and testing.\nStart a single trial with a 3 sec (s) tone.\n2 sec after the termination of tone, present two levers and allow animals to press either lever within 10 sec. In case that no response is made within 10 s, retract both levers and count this trial as an omission trial.\nIn the case of the lever press training, present only a single lever on either side.\nIn most of experimental conditions, there was a light stimulus above one of levers. Turn the light cue on immediately after the tone ceases and turn off when animals have either made a response or in 10 sec after lever insertion when no response has been made.\nSet inter-trial intervals at 20~30 sec.\nLever-press training\nIn this training phase, present no light to animals.\nTrain animals under lever-press training for 5-8 sessions with the same time schedule for a trial as testing sessions described below.",
    "In this training, present either left or right lever randomly, and the lever has to be pressed within 10 sec after the lever is presented, or the trial is counted as an omission without a response. A session for the lever press training comprised of 80 trials.\nOnce the animals have scored fewer than 10% of omissions out of 80 trials, move them to the following side-bias test.\nSide-bias test\nPerform a side-bias test to determine the animal's preference to either left or right lever1. A trial entails two lever-presses on both sides.\nPlace animals in an operant chamber and allow them to choose either lever. In the next attempt, animals have to select the opposite lever in order to obtain a reward. If animal's second attempt is on the same side of the first response, give no reward and continue the trial until a response is made on the opposite side.\nConduct a total of 7 trials to determine animal's side preference.\nTesting.\nA daily session consists of 80 trials.\nPrepare three different conditions for set-shifting procedures as shown in Figure 1.\nAll the three conditions require animals to similarly change behavioral strategies from choosing one lever that is consistently on the same side (Phase 1, response strategy) to following a light cue that indicates a correct side (Phase 2, visual cue strategy).\nBegin with initial learning of a response strategy (Phase 1) for 4 sessions, in which animals have to press a lever based on the location of levers. In this phase, set the correct side to the lever opposite to their preference based on a preliminary side-bias test as mentioned above.",
    "Next, commence visual cue learning (Phase 2) for 10 sessions. A light cue illuminated above either lever indicates a correct lever. In this shifting phase, three different patterns of attentional shifts can be compared among three experimental conditions as described below (3.3.6-3.3.8).\nIn set-shift condition 1 (Figure 1A), give no light in phase 1, but a light cue indicates the correct side in phase 2. In condition 1, therefore, animals need to attend to a novel stimulus.\nIn set-shift condition 2 (Figure 1B), present a light cue above the correct lever in phase 1, and again in phase 2. In this condition, the light cue had been relevant, but not necessarily required for making a choice in phase 1. Thus animals have to attend to a previously relevant cue.\nIn set-shift condition 3 (Figure 1C), turn on a light cue randomly above either left or right lever in phase 1. Thus it has to be ignored. In phase 2 animals are required to pay attention to the light stimulus that has been previously irrelevant.\nBehavioral analysis.\nThroughout sessions, measure the percentage of correct responses on a daily basis, excluding omission trials.\nCount errors accumulated during 10 sessions of visual cue learning and classify them into perseverative, regressive or never-reinforced errors as described in a previous study1. There, a detailed analysis of error types suggests separate functions in set-shifting.\nDefine perseverative errors as incorrect responses to the previously correct lever while animal's performance was still below chance level4,6,13,14,15. Similar criteria have been used in previous studies1,3,7,11.",
    "Based on a principled way, determine the criterion to separate between perseverative and regressive errors as the point at which the animal first scored fewer than 8 out of 10 incorrect responses (probability of making 8/10 errors or more = 0.054, based on cumulative binomial distribution) in a moving window of 10 trials.\nIn order to find this point, start calculating a moving average of the 10 trial window from 1st trial and then advance it by one trial at a time until <8/10 errors are measured. Conduct this analysis across all trials in which a light cue is illuminated above the previously incorrect lever during visual cue strategy.\nDefine all the subsequent errors committed after this point as regressive errors.\nDuring visual cue learning, count never-reinforced errors when animals responded to a previously incorrect lever on which the light cue was not illuminated. Divide them into an early or late portion based on the learning phase; errors made in the first half of 10 sessions (session 1-5) are considered early and those in the second half (session 6-10) are regarded as late ones.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}