{
  "id": 6949,
  "origin_website": "Bio",
  "title": "The Peak Interval Procedure in Rodents:  A Tool for Studying the Neurobiological Basis of Interval Timing and Its Alterations in Models of Human Disease",
  "procedures": [
    "Food or water deprivation of the subjectsGet the animal’s ad libitum weight by weighing them over three subsequent days during which they have full access to chow and water. Use a growth chart from the animal’s vendor to estimate its growth over the course of the experiment; this can be important if the animals are younger, and still growing. If one cannot be obtained, create one with a pilot group of animals. No prior handling of the animals is required as testing takes place in the operant box.Restriction Protocols:Water restrictionThree days prior to the start of the first training session, water is restricted while maintaining the animal at 85% of its ad libitum weight. In mice, this is achieved by providing full access to an average of 4 ml water through a mash. Subjects will also be receiving liquid during testing. During water restriction, subjects have full access to food in the home cages. If the weight of an animal falls too quickly, or falls far below the 85% criterion, put the animal on ad libitum water for at least a day before starting a less restrictive water schedule for that animal.Food restrictionThree days prior to the start of the first training session, chow is restricted to maintain the animal at 85% of its ad libitum weight. This is achieved by providing chow once a day about an hour after the testing session. Subjects will also receive food during testing. During food restriction, subjects have full access to water in the home cages. If subjects are young, their normal growth curves should be factored into the updating of ad lib weight. These can be obtained from the animal’s vendor.",
    "If the weight of an animal falls too quickly, or falls far below the 85% criterion, put the animal on ad libitum food for at least a day before starting a less restrictive food schedule for that animal.It is often helpful to introduce the reinforcement before testing begins. Drop some of the reinforcement in their home cage a few days in a row before testing starts to minimize the effect of neophobia.Test the equipment before testing the animalTest each component of the operant box prior to bringing the animals in the test room. If there is any component that is malfunctioning, fix it or replace it prior to testing. Make sure that the pellet dispenser or the dipper (whichever is used) functions appropriately. It is recommended to have a number of additional units available in the lab to be able to replace the broken ones. This box test is repeated for each box every testing day. If pellet dispensers are used, make sure to collect the pellets dropped in the hopper during testing of the equipment before moving to testing the next subject. If there is a problem with one or more units that cannot be fixed or replaced on the same day, test the corresponding animal on the next day and record this event in the lab notebook.  The most straightforward way to test an operant chamber is to carefully design and write a test protocol using the software that controls the boxes (e.g., MedPC). For example, write a protocol that turns on each output sequentially when some input is triggered. This way, one can distinguish faulty input from output.Training Phase 1Place the animal in the operant box and close the doors.",
    "Before closing the door, make sure the animal’s tail is not near the latches to prevent injury to the animal. This step is repeated on each test day. At the beginning of testing, animals might be reluctant to get into the operant chamber when the cage is tilted toward the opening of the operant box. Carefully pick the animal up by its tail and place it in the operant chamber.  Below, we provide two methods for training the animal on a Peak Interval procedure. The first is simpler and usually results in very clean data. The second is more involved, but more safely guards against those few animals who need more, or more careful, training.  The goal of the simpler method is to start as close to the Peak Interval task as possible, minimizing both the number of training phases and the differences between phases.  Training starts with Delay Conditioning: A long exponentially distributed intertrial interval begins the session. Longer intertrial intervals, relative to the trial duration, will lead to faster learning (Gibbon and Balsam, 1981; Ward et al., 2013). The trial starts with the onset of a stimulus, usually a light or a tone. The light or tone lasts for the FI used during the eventual peak interval task, then it turns off and a reward is immediately delivered. If the eventual FI is very long (say, several minutes), it may be a good idea to start with a shorter delay and adjust toward the long FI over a few days. Wherever possible, it is better to start with the final FI.   Then, transition to the Peak Interval task (Step B8 below). Some may want to start with a few days of FI training without peak trials, but it is not strictly necessary.",
    "The benefit of starting with a Delay conditioning procedure is twofold: first, it teaches the animal the true FI interval right away, rather than asking the animal to learn it through trial-and-error. Second it allows the researcher to measure anticipatory entries into the food cup as a measure of acquisition.Fixed Time 60 s concurrent scheduleThe goal of the less simple method is to take smaller and more incremental steps toward the final peak task. In doing so, it ensures that each animal has completed each step before moving to the next one. This is helpful in a few cases in which the animal is slower to learn, or in cases where the researcher is uncertain about how slow acquisition will be, for example, if working with an unfamiliar strain of mice.Magazine training Deliver reward in the corresponding hopper every 60 s (called an FT60 procedure). If the reward is delivered via a dipper, then the dipper stays up for 60 s and the cup is refilled and presented again to the animal. If the liquid reward is presented through peristaltic pump or if it is in pellet form, the reward can accumulate over trials until it is consumed by the animal. This magazine training will last for at least one 20-minute-long session. Note that 0.7 ml of sucrose water indicated in Gür et al., 2019b; 2019c (that were used as the reference studies for this protocol) was the approximate total amount of water received during a Magazine Training session (it was mistakenly expressed as the amount delivered every 40 s).  If reward is delivered via dipper, it should be presented long enough for the animal to notice and move to the dipper from the Lever (in subsequent the Lever Press Training, the animal will need to do this).",
    "If an animal does not spend time in the magazine where dipper is raised, the reinforcement presentation time can be extended. If there are infra-red beam detectors at the feeding hopper, the dipper can be kept available for a fixed duration after the detection of a nose poke.  After the termination of the session, check for any pellets or liquid reinforcement accumulated in the feeding hopper and remove them (this is not an issue for reward deliveries via dipper). Then check how many times the animal has entered the feeding hopper.At the end of the session, use a cumulative record to chart the animal’s responses over the session, steeper slopes indicate higher response rates. It is often very clear if (and when) the animal acquired a response. After experience, the researcher can usually tell more quickly and easily by the total number of responses in the session (but a cumulative record is still important to catch inconsistencies in their behavior throughout the session). If needed, repeat the magazine training for that animal on the subsequent day.Lever Press Training The lever is inserted in the operant box and it is retracted either after 60 s or after it is pressed (detected by mechanical switches or break of infrared beam). When one of these events take place, the lever is retracted and the reward is delivered. If the reward is delivered via a dipper, then make sure to leave enough time for the animal to reach it (e.g., 3 s) or rely on the head entry to the feeding hopper as described in Step B3. Stationary levers can also be used, in which case it will be available at all times. The lever press training continues typically for 60 min.",
    "A crucial point is that lever press training should continue until the animal is reliably pressing the lever. This may be done by examining a raster plot or cumulative record; it may be done by a statistical test, say, on the difference in the number of responses per trial against the number of responses in the intertrial interval; or it may be done with a simple criteria: continue until the animal presses the lever for at least a number of times (e.g., 40 or 60), or obtains a certain amount of food, in an hour-long session for two subsequent sessions.  Some subjects may take longer to train than others. There are a few simple techniques for helping them along. First, remove the FT component, and introduce a Fixed Ratio schedule in which every lever press is reinforced (FR1). If this doesn’t help, try shaping the lever press response by hand while the FR1 schedule is in effect. If this fails, it may be time to exclude the animal from the study; it may be an outlier. In this case, record the details in a laboratory notebook, and remember to report it in the paper. In our experience, subjects rarely need more than 2-3 sessions of FR training, and rarely need more than 2 sessions of shaping.Nose poke training The nose-poke hopper is lit and it is turned off either after 60 s or after the subject makes a nose-poke (detected by the break of infrared beam). When one of these events take place, the light is turned off and the reward is delivered. If the reward is delivered via a dipper, then make sure to leave enough time for the animal to reach it (e.g.",
    ", 3 s) or rely on the head entry to the feeding hopper as described in Step B3. The nosepoke training continues typically for 60 min. The nose-poke training continues until the animal nosepokes a number of times (e.g., 40 or 60) in a session for two subsequent sessions. Either Step B5 or Step B6 will be realized based on the choice of the experimenter regarding the form of response.Fixed Interval (FI) Training A trial is initiated with the presentation of the discriminative stimulus. The stimulus stays for a minimum of the FI and it is turned off contingent upon the first response following FI. The first response following the FI is reinforced (some also require that the response occur earlier than 3xFI). The experimenter might choose to present the stimulus longer than 3xFI, but this typically not necessary. After each trial, an exponentially distributed inter-trial interval (ITI) is introduced. This is important to reduce how predictable the next trial is. This training phase, including only simple Fixed Interval trials, is usually conducted daily for at least 5 sessions before introducing peak trials. Use raster plots to track their acquisition. The data should be studied on a daily basis with simple visual or statistical summaries that showcase the most raw form of the data possible. If a scalloped responding is not observed in any of the subjects, FI training can be extended. Figure 2A illustrates the typical pattern of responding observed in FI trials.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902235515_6657.jpgFigure 2. Illustration of fixed interval and peak interval trials and the typical form of responding that is observed in these two different trial typesPeak Interval (PI) Testing Peak Interval (PI) trials are randomly mixed with FI trials.",
    "In PI trials, the stimulus lasts at least three times longer than the FI and the reinforcement is omitted, regardless of the animal’s behavior. The proportion of FI to PI trials can change between 1:1 to 1:3. A lower proportion of peak trials will facilitate the acquisition of peak interval responding but because we typically focus on PI trials in analysis, this will also result in less data per session (Kaiser, 2008 and 2009). The duration of the PI trials can also be varied between trials or sessions (but at least 3xFI). Figure 2B illustrates the typical pattern of responding observed in PI trials.After each session, gently remove the animal from the operant box and place it promptly either in the holding case or the home cage available nearby. Wipe the grid with a 70% ethanol solution to minimize olfactory cues between different sessions. Provide supplemental food or water about an hour after the test session.Figure 3 summarizes the key steps of the PI procedure in the form of a decision-tree to be used during the implementation of the protocol.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902235545_1528.jpgFigure 3. An example illustration of the peak interval testing steps and contingenciesNote: The criteria for switching between different states can be decided on by the experimenter. This figure will appear as an animation when viewed here[href=https://os.bio-protocol.org/attached/image/20200720/20200720214429_9479.gif] through a web browser."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}