{
  "id": 17542,
  "origin_website": "Jove",
  "title": "Isolated Lung Perfusion System in the Rabbit Model",
  "procedures": [
    "The isolated perfusion system in the rabbit model has been widely used in the Bronchial Hyperresponsiveness Laboratory at the Instituto Nacional de Enfermedades Respiratorias. The protocol includes New Zealand rabbits with an approximate weight of 2.5-3 kg. All animals were kept in standard vivarium conditions and ad libitum feeding in compliance with the official Mexican guidelines for laboratory animals (NOM 062-ZOO-1999) and under the Guide for the Care and Use of Laboratory Animals (8th edition, 2011). All the animal procedures and animal care methods presented in this protocol were previously approved by the Ethics Committee of the Instituto Nacional de Enfermedades Respiratorias.\nNOTE: The preparation of the isolated lung perfusion system involves the deliberate death of an animal under anesthesia and via euthanasia.\n1. Equipment and preparation of apparatus.\nEquipment arrangement:\n\t\nSet up an operating table with size according to the weight of the rabbit.\nMount the cover of the artificial thorax on the steel column with the glass chamber underneath and the ventilator with a roller pump by the sides.\nEnsure that the cover is easily inclined to have the tracheal cannula in line with the trachea to allow a faster connection.\nArtificial thorax:\n\tNOTE: It is an essential part of the system. It consists of a water-jacketed glass chamber sealed by a special cover. The cover works as the organ holder with the connections to cannulate the trachea and vessels embedded in it.\n\t\nSet up a venturi jet operated by compressed air to generate the negative pressure inside the artificial thorax.\n\t\tNOTE: The ventilation control module (VCM) allows separate adjustments of inspiratory and end-expiratory pressures as well as respiration rate and the ratio of inspiratory duration to total cycle duration.\nApparatus:",
    "Ensure that a normally working apparatus consists of a main steel column mounted on a base plate holding the artificial thorax, with the pneumotachometer and weight transducer located above it and behind the preheating coil with a bubble trap.\nConnect one differential pressure transducer to the pneumotachometer and another to the chamber pressure. Set a different couple of pressure transducers behind the thorax to measure perfusion and venous pressures.\nConnect the changeover stock below the oxygenator with a level electrode and the ventilation system beside the apparatus.\n2. Surgical extraction of the cardiopulmonary block.\nAnesthesia:\n\t\nUse a combination of a sedative (xylazine) and a barbiturate (pentobarbital).\n\t\tNOTE: Different anesthetic cocktails can be used with no effect on experimental outcomes.\nFirst, sedate the healthy New Zealand rabbits with a single intramuscular injection of xylazine hydrochloride (3-5 mg/kg). Ensure that the rabbits remain calm and relaxed to allow further manipulation after a few minutes of the injection.\nFollowing sedation, use the marginal (lateral) ear veins as access to anesthetize the rabbits with an intravenous injection of pentobarbital sodium (28 mg/kg).\nMonitoring:\n\t\nTo avoid insufficient anesthesia or excessive depression of cardiac and respiratory functions, monitor the following parameters. To assess the depth of anesthesia, perform a toe pinch test.\nEnsure that the mucous membrane is pink. Blue or gray shades indicate hypoxia.\nEnsure that the heart rate is between 120-135 beats/min, and that the body temperature does not drop below 36.5 °C.\nAnimal placement:\n\t\nShave the rabbit's torso and place the animal on the operating table in supine position. Place the ventilation system near the table, behind the rabbit's head, to permit connecting the cannulae quickly after tracheotomy to avoid tissular damage.\nIncision and tracheotomy:",
    "Dissect the skin with a ventral median line incision of 3-5 cm from the diaphragm up to the neck.\nWith the operating scissors, cut the anterior 2/3 of the trachea between two cartilage rings to insert the tracheal cannula through the tracheal fibrous membrane.\nInsert a 5 mm (outer diameter; OD) tracheal cannula through the tracheal fibrous membrane and use a 4-0 silk suture to fix it carefully.\nPlace either forceps or tweezers underneath the trachea to ensure the cannula did not bend against the trachea.\nPositive-pressure ventilation:\n\t\nAs long as the lungs remain outside the artificial thorax, use a small species respiration pump to ventilate a positive pressure in order to avoid lung collapse during the surgery.\nInitiate ventilation through the tracheal cannula connected to the respiration pump quickly after tracheotomy and before the thorax is opened.\nSet the tidal volume at 10 mL/kg.\n\t\tNOTE: Depending on the experiment setup and artificial thorax model, provide positive-pressure ventilation by either the same ventilation pump used to provide negative-pressure or a different one, granting a quick re-cannulation.\nThoracotomy and exsanguination:\n\t\nTo access the thoracic cavity, use a scalpel or scissors to open the thorax wall and perform a medial sternotomy up to the upper third of the thorax.\nHold the thorax halves open by two retractors. Several lung flaps usually surround the heart.\nLocalize the superior and inferior vena cava and refer them with threads.\nPrior to the exsanguination of the animal, identify the right ventricle and inject 1000 UI/kg of heparin.\nImmediately after the injection, ligate the superior and inferior vena cava with the pre-looped thread and perform exsanguination.\nHeart-lung harvest:\n\t\nHarvest the cardiopulmonary block gently and quickly. Use direct digital dissection or spring scissors to separate the connective tissue so as to remove the lungs from the thorax.",
    "Dissect the vasculature in the area, as well as the esophagus.\nCut through the manubrium sterni to extend the medial sternotomy towards the tracheal cannula, releasing the trachea on both sides from connecting tissue.\nNow, resect the trachea above the tracheal cannula. Gently pull up the cannula in a craniocaudal axis as the dorsal fixation of the trachea and lungs is resected.\nCannulation:\n\t\nLift the isolated lungs out of the thorax and carefully place them over a sterile gauze on a petri dish.\nTo prevent atelectasis, ventilate the lungs using positive-pressure ventilation with positive end-expiratory pressure (PEEP) set at 2 cmH2O.\nRemove the ventricles by cutting them off the heart at the level of the atrioventricular groove.\nAfter opening the two ventricles, introduce the OD 4.6 mm pulmonary artery cannula for the rabbit with a basket through the pulmonary artery and introduce the OD 5.9 mm left atrium cannula for the rabbit with the basket through the mitral valve into the left atrium.\nUse a 4-0 silk suture in the pulmonary artery and left atrium to fix the cannulaes. Include the surrounding tissues in the ligatures of the pulmonary artery and left atrium to avoid the distension of these structures.\nInject 250 mL of saline isotonic solution through the arterial cannulae to flush the remaining blood from the vascular bed.\n3. Perfusion technique.\nSetup:\n\t\nPlace the isolated lungs carefully into the lung chamber.\nAttach the trachea to the transductor on the cover of the chamber.\nConnect the cannulated vessels to the perfusion system.\nClose the chamber and secure it with the rotary lock.\n\t\tNOTE: The recirculating perfusion circuit consists of an open venous reservoir, a peristaltic pump, a heat exchanger, and a bubble trap.",
    "At this point, attach the chamber lid and switch over a stopcock to switch from positive to negative pressure ventilation. To check the negative pressure ventilation of the lungs and airtight closure of the chamber, inspect the respiratory excursion of the lung and chamber pressure on the pressure gauge.\nPerfuse the lungs with 200 mL of artificial blood-free perfusate (a Krebs-Ringer bicarbonate buffer containing 2.5% of bovine albumin).\nStart the perfusate flow at 3 mL/min/kg, then slowly step up the flow over a 5-min period to 5 mL/min/kg. Reach a flow of 8 mL/min/kg over the next 5 min and then after another 5-min period reach a maximum flux of 10 mL/min/kg. Take care of avoiding air from getting into the circuit.\n\t\tNOTE: Maintain the pH and the temperature of the perfusate within physiological ranges (pH 7.4-7.5; temperature, 37 °C-38 °C). To adjust the pH, add NaHCO3 (1N) or increase the flow of carbon dioxide. Alternatively, use HCl (0.1N) to acidify.\nParameters:\n\t\nCheck whether the predetermined perfusion and ventilation parameters are set as required.\nVentilate the lungs with humidified air at a frequency of 30 bpm, a tidal volume of 10 mL/kg, and an end-expiratory pressure (Pe) of 2 cmH2O.\n\t\tNOTE: The pulmonary arterial pressure (0-20 mmHg) corresponds to the height of the liquid level in the oxygenator or reservoir in centimeters above the pulmonary trunk, while the pulmonary venous pressure corresponds to the height of the pressure equilibration chamber above the left atrium. Both values can be modified. Note that left atrium pressure is also 0-20 mmHg.\nAchieving zone 3 conditions:\n\t\nUse the two catheters connected to side ports of the cannulae secured in the pulmonary artery, left atrium, and pressure transducers to measure the arterial (Pa) and venous (Pv) pressures.",
    "Set the baseline pressures at the level of the lung hilum (Zero-reference).\nConduct the experiments under zone 3 ventilation conditions. To achieve this, wait for 10-15 min to obtain an equilibrium characterized by an isogravimetric state.\nEnsure that the venous pressure is higher than the alveolar pressure (Palv) and the arterial pressure remains higher than both (Pa > Pv > Palv) for Zone 3 conditions to occur.\nEnsure that the lungs' weight remains constant and arterial and left atrial pressures are stable to achieve zone 3 conditions to open up a maximum number of pulmonary vessels and maintain the microvascular bed content during the experiment.\n\t\tNOTE: The measurement of Kfc as an indicator of pulmonary edema has no variation between a manual and an automatic perfusion system.\nElectronic control and signal processing: Ensure that the respiratory flow, weight changes, microvascular pressure, tidal volume, vascular resistance, among others, are registered on a multiple central electronics unit that integrates signals coming from the transducers and displays them on the evaluation system.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}