{
  "id": 3392,
  "origin_website": "Cell",
  "title": "Attachment culture of cortical organoids at the microwell air-liquid interface",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCortical organoid slices transplantation (seed) & air-liquid interface generation\nTiming: 3 h\nHere we place sliced cortical organoids in microwells to adhere to the bottom surface (e.g., confocal plates) while also being in contact with air, creating a relatively stable fluid environment conducive to neuronal migration and organization.\nCortical organoid slices transplantation (seed).\nTransfer cortical organoids from step 3 to a 1.5 mL microfuge tube, aspirate supernatant then replace with complete medium.\nAspirate 180 μL of coating solution from the microtiter wells, use a 200 μL pipette tip with a cut tip (widen the opening over 1500 μm in diameter to keep single cortical organoid undamaged) to aspirate 100 μL of medium containing a single cortical organoid, then pipette into a single microwell.\nNote: Ensure that the bottom of the microwell is kept moist during the transfer process to prevent the coated bottom surface from drying up.\nUse a 1000 μL pipette tip nested with a 10 μL pipette tip, then gently push the cortical organoid into the center of the microwell.\nNote: Push with contact on the side of the cortical organoid, do not push perpendicular to the cortical organoid. Do not touch or scratch the coated microwell bottom when moving the cortical organoids.\nAir-liquid interface generation.\nUse a 100 μL pipette to slowly aspirate medium at the edge of the microwell until the cortical organoids emerge from the liquid surface and are also attached to the bottom surface (Graphical abstract).\nWhile aspirating, constantly adjust the position of the pipette tip at the edge of the microwell, thereby adjusting the position of the cortical organoid in the microwell, keeping it approximately in the center.",
    "Monitor the amount of liquid in the microwells to prevent drying up and exposure of the coated bottom surface to the air caused by long-time operation or excessive aspiration.\nCheck that the cortical organoids in all microwells attach to the bottom surface while also in an air-liquid interface environment.\nMove slowly to an incubator for static culture. Troubleshooting 3[href=https://www.wicell.org#troubleshooting], Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nDaily medium change\nTiming: 4 h\nSince the medium volume in the microwell is only about 50 μL, it is necessary to change medium daily and give sufficient medium for incubation during a period of time. Repeat this step every 24 h (change medium 1 time in 24 h) to maintain the culture of cortical organoids at the air-liquid interface.\nWarm complete medium at 27°C.\nUse a 200 μL pipette to slowly drop 100 μL of the complete medium onto the cortical organoids.\nNote: When adding the complete medium, drip droplets one by one; do not create a continuous jet. Avoid blowing off attached cortical organoids.\nMove slowly to an incubator for 2 h of static culture.\nPause point: There is a pause point between step 5 and step 6 for 2 h.\nRepeat step 2 to create the air-liquid interface again. Then move slowly to an incubator for static culture for the remaining 22 h till the next medium change. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nCalcium imaging on cortical organoid external neural networks\nTiming: 6 h (excluding imaging time)\nUse the change medium method from step 4 to change 100 μL BrainPhys Neuronal Medium with 5 μM Flou-4. Then move slowly to an incubator for 3 h of static culture.\nPause point: There is a pause point between step 7 and step 8 for 3 h.",
    "Use a 200 μL pipette to slowly drop 200 μL of the BrainPhys Neuronal Medium onto the cortical organoids.\nAdd 500 μL of the BrainPhys Neuronal Medium from the outside of the PDMS ring and use the stable liquid environment in the microwell to protect the cortical organoid from the impact of the liquid flow. Then aspirate the media outside the microwells.\nRepeat step 9 for 3 times. Then move slowly to an incubator for 1 h of static culture.\nPause point: There is a pause point between step 10 and step 11 for 1 h.\nUse a confocal microscope for calcium imaging. If drug experiments are required, use the methods described in steps 9–11 to add and wash drugs.\nImmunohistochemical staining on confocal plates\nTiming: 12 h (excluding imaging time)\nAfter step 6 (no calcium imaging) or step 11(calcium imaging), use the change medium method from step 4 to add 1 mL of 4% Paraformaldehyde for 15 min.\nUse the methods described in step 10 to wash samples with 5 mL Phosphate-buffered saline (PBS) 3 times.\nUse tweezers to remove the PDMS ring vertically. Surround the sample with an immunohistochemistry pen, then followed by membrane permeabilization and blocking with 0.1% (w/v) Triton X-100 in normal donkey serum for 1 h at 27°C.\nSamples were incubated with primary and secondary antibodies (see Key resources table) over 8 h at 4°C, respectively.\nNote: The calcium ion indicator will flow away under membrane permeabilization, and will not affect the imaging and analysis of immunofluorescence.\nTreatment with DAPI for 30 min, then use FOCM8[href=https://www.wicell.org#bib8] tissue clearance reagent for 30 min. Finally, the samples were covered with glycerol for storage at −20°C."
  ],
  "subjectAreas": [
    "Organoids",
    "Tissue Engineering",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}