{
  "id": 17069,
  "origin_website": "Jove",
  "title": "Mimicking Ding's Roll Method on Notexin-Induced Muscle Injury in Rats",
  "procedures": [
    "Procedures involving animals have been approved by the Institutional Care and Use Committee at Hunan University of Chinese Medicine.\n1. Assembly of the rolling massager\nSelect a massager that consists of a rubber roller, fork holder, spring, limit baffle, adjustment splint, screw, and acrylic handle (Figure 1). Ensure the rubber roller measures 3 cm long and 1.6 cm in diameter, the spring measures 3 cm long and 0.9 cm in diameter, the limit baffle is 3 cm long and 2 cm wide, and the handle measures 12 cm long and 0.9 cm in diameter.\nForce control: According to the literature results23, Ding's roll method downward pressure was found to be about 10% of the body weight, so the pressure applied during the design of forward rolling is about 10% of the rat's body weight (0.2-0.3 N). Test the maximum pressure of the massager on the weighing controller to be about 0.3 N by adjusting the angle of the limit baffle. This pressure requirement meets the needs of the rat.\nEnsure the minimum pressure is about 0.08 N when rolling back (Figure 2). Ensure the pressure is precisely in conformity with the requirement of Ding's roll method that the ratio of the forward and backward forces is 3:1.\nBefore treatment, ask the operator to work with the metronome software to control the rolling frequency to 140 rolls/min and practice this more than 3x in the pre-experiment to ensure the operation is standardized.\n2. Establishment of a rat model of skeletal muscle injury",
    "Randomly divide 24 male, Sprague-Dawley rats (weighing 200-250 g) into three groups of eight rats each, including control (C), notexin (NTX), and notexin with Tuina (NTX + Tuina), and feed on a standard diet. Maintain on a 12 h light/12 h dark cycle, house at 20-25 °C and 50%-70% humidity.\nRemove hair from the right lower limb with hair removal cream and then anesthetize with 1% pentobarbital sodium (40 mg/kg) by intraperitoneal injection. Confirm adequate anesthesia by toe-pinch response. Apply ophthalmic ointment to moisturize the eyes if the rat's eyes are open under anesthesia.\nAlternate skin disinfection for the right lower limb with iodophor disinfecting solution and 75% alcohol before injection. Touch a cotton swab soaked in iodophor disinfecting solution to the center of the skin of the lower extremity and apply in a circular motion outward. Repeat with an ethanol-soaked cotton swab.\nEstablish skeletal muscle injury models according to the reference method24. Inject notexin in only one leg (to prevent double notexin injection). Draw 200 µL of notexin solution (10 µg/mL notexin solution prepared by adding 100 µg of notexin to 10 mL of normal saline in a 15 mL centrifuge tube) into a 1 mL syringe with a 30G needle and inject the notexin solution intramuscularly into the gastrocnemius muscle to produce muscle injury.\nInject the notexin slowly and wait for 3 s before pulling out the needle (to be fully injected).\n\tCAUTION: Notexin is a toxic chemical that requires immediate flushing with plenty of water upon contact with an open wound and prompt medical attention if necessary.",
    "Inject the rats in the control group with 200 µL of saline solution. Move anesthetized rats to empty cages with clean bedding. Visually observe the tissue color, body temperature, and respiratory rate at the end of the injection until the rats regain sufficient consciousness.\nReturn rats to the home cage and typically rear them for 24 h.\n3. Tuina therapy\nPlace an SD rat in a prone position with its head covered with a black cloth on the experimental platform to expose the gastrocnemius muscle. Do not cover too tightly.\nUsing the Tuina massager for the NTX+Tuina group: Hold the massager and place the roller on the gastrocnemius muscle of the rat and roll forward until the spring contacts the limit baffle. Then retract the force and return to its original position, thereby reciprocating movement (Figure 3).\nRoll the massager at a speed of 140 rolls per min, and perform each operation for 3 min. Perform the massages once in the morning and once in the afternoon for 3 consecutive days.\nReturn rats to the home cage after each treatment and fast without water for 24 h after the last treatment.\n4. Collecting blood and tissues from rats after the experiment\nAccording to the requirements of the relevant animal experiment ethics committee, anesthetize rats by intraperitoneal injection of pentobarbital sodium. Confirm adequate anesthesia by toe-pinch response. Apply ophthalmic ointment to keep the eyes moisturized while under anesthesia.\nAlternate skin disinfection with iodophor disinfecting solution and 75% alcohol before injection. Touch a cotton swab soaked in povidone-iodine to the center of the abdominal skin and apply in a circular motion outward. Repeat with an ethanol-soaked cotton swab. Repeat disinfection 3x.",
    "Ask the assistant to use two hemostats to lift the skin in the middle of the abdomen. As the operator, use a scalpel to cut through the abdominal skin and muscles from the raphe to the pubic symphysis.\nAfter opening the abdominal cavity, separate the bowel with sterile cotton balls to expose the abdominal aorta in the posterior abdominal wall.\nLocate the abdominal aorta, take 5 mL of rat blood into blood collection tubes, and obtain the plasma into 1.5 microtubes by centrifuging at 3000 x g for 10 min after standing blood for 1 h. Store plasma at -80 °C.\nCut open the skin with surgical scissors along the lower abdominal opening toward the lateral aspect of the right lower limb, exposing the lower limb muscles, and after carefully separating the fascia with forceps, cut the scalpel to remove the intact gastrocnemius muscle.\nWash the gastrocnemius muscle in sterile saline to remove adhering hair and blood.\nPlace the removed gastrocnemius muscle into a 15 mL centrifuge tube containing 4% paraformaldehyde.\n5. Detection of plasma CK and FABP 3 levels by ELISA\nCalculate and determine the number of pre-wrapped plates required for one experiment. Remove the required plates, place them in the 96-well frame, put the remaining microplates back into the aluminum foil bag for sealing, and store them at 4 °C.\nEquilibrate the kits and samples at room temperature (25-28 °C) for 120 min, fully equilibrate to room temperature.\n\tNOTE: Equilibration of the kit and the sample is critical and must be equilibrated to sufficient time.\nSet standard, sample, and blank wells. Add 50 µL of CK or FABP3 standard at different concentrations (100, 50, 25, 12.5, 6.25, 0 ng/mL) to the standard wells. Repeat each standard once, occupying a total of 12 wells.",
    "Fill sample wells with 40 µL of sample diluent (0.8 g NaCl, 0.02 g KH2PO4, 0.29 g Na2HPO412H2O, 0.02 g KCl, 0.01 g NaN3in 100 mL of double distilled water, pH 7.4), followed by 10 µL of the sample to be tested. Repeat each sample once, occupying 48 wells in total.\nExcept for the blank wells located two wells behind the last sample well, add 100 µL of HRP-labeled anti-human CK or FABP3 antibody (enzyme-labeled antibody) to each standard and sample well.\nSeal the wells with sealing film and incubate in a 37 °C water bath or thermostat for 60 min.\nDiscard the liquid, pat dry on absorbent paper, fill each well with washing liquid, leave for 20 s, shake off the washing liquid, pat dry on blotting paper, and repeat washing the plate 5x (or use a plate washer).\nAdd 50 µL of chromogen solution A (20 mg tetramethylbenzidine 10 mL ethanol in 100 mL of double distilled water) and 50 µL of chromogen solution B (0.1 M/L citric acid, 0.2 M/L sodium dihydrogen phosphate buffer, pH 5.0-5.4) to each well. Keep away from light for 15 min at 37 °C.\nFor standard wells, sample wells, and blank wells, add 50 µL of termination solution to each well, and measure the optical density value of each well at 450 nm within 15 min.\n6. Histological analysis of notexin-induced gastrocnemius muscle injury in rats\nPrepare 5 µm thick paraffin sections stained with hematoxylin and eosin for light microscopic examination as described in25.\n7. Image processing and data analysis\nRead and analyze the images captured by the imaging system with analysis software. Move the selected image field of view to the center of the screen with the mouse, click 40x, and then click Take Snapshot.",
    "Record the OD values from the ELISA in a spreadsheet and calculate the rat CK and FABP3 levels in the samples using the standard curve.\nUse statistical analysis software for the statistical analyses. Express measurements as mean ± standard deviation (imgsrc://cloudfront.jove.com/files/ftp_upload/65820/65820eq01.jpg), and analyze the comparisons between groups by one-way ANOVA, with the LSD test when the variance was uniform, and the Tamhane T2 method when the variance was not uniform. The difference was considered statistically significant at a p-value less than 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}