{
  "id": 11130,
  "origin_website": "Jove",
  "title": "Micro-particle Image Velocimetry for Velocity Profile Measurements of Micro Blood Flows",
  "procedures": [
    "1. Microchip Fabrication\nThe first step is to create or purchase your microchannel. There are many options for microchip material.\nOne of the most common materials chosen is poly(dimethylsiloxane) (PDMS). There are many publications on directions for PDMS fabrication through soft lithography 16,17,18.\nOnce the PDMS channel is fabricated, there are several surface treatments available to reverse its natural hydrophobicity. Oxygenated plasma treatment is a common option.\nZhou, Ellis, and Voelcker (2009) give a review of surface treatments and how they affect PDMS. These results are for water however, and blood has different properties. A study on what that surface treatment means for blood has been done by Pitts et al. (2012a).\nFor the results presented here, microchip surfaces and the glass slides they were bonded to were both exposed to oxygenated plasma for 45 seconds and then pressed together firmly resulting in a permanent bond.\n2. Blood Preparation\nCollect blood samples from an accredited facility. For example porcine blood can be used with ethylenediaminetetraacetic acid (EDTA) as an anticoagulant. Add 1 g EDTA with 4 ml of water, and then add the solution to 1 L of whole blood, mixing gently 10x.\nWhen picking up blood samples, allow them to cool slowly to RT. Blood samples should be fresh, and ideally used the day they are collected to conserve the rheological properties of the blood.\nSamples may be refrigerated once at RT; however whole blood without anticoagulant will be unusable after refrigeration. Depending on the anticoagulant, RBCs can be kept refrigerated for up to 42 days, and whole blood can be kept refrigerated for 35 days, but contamination would be possible in a non-medical facility 21.\nAdditionally, be careful of the collection method with bovine or porcine samples, and avoid contamination by bone marrow.",
    "Centrifuge the blood samples 3x at 3,000 rpm for 10 min each time. After the first centrifugation, remove the plasma and buffy coat, discard. It is generally easiest to remove the plasma first, and then discard or keep for future use, then to remove the buffy coat alone.\nIntroduce the pipette slowly, so as to not mix the buffy coat back into the blood. After removing the buffy coat, add about 20 ml of phosphate buffered saline (PBS) and mix gently, recentrifuge. Repeat last step. After the third centrifugation, remove the PBS and remaining buffy coat, discard.\nIt is also possible to use the native plasma instead of PBS if you wish to keep the aggregating properties of the blood. Make sure to not mix any buffy coat or white blood cells into the plasma.\nTake cleaned red blood cells (RBCs) and suspend in PBS or plasma at desired concentrations (hematocrits). Check hematocrits with a microcentrifuge (CritSpin FisherSci, USA).\nBlood at 10 to 20% hematocrit should be easier to visualize than 40 or 50% (physiological hematocrit). In the microcirculation, the blood is generally half the hematocrit of the macro circulation, so H=20 is adequate 15.\nAdd fluorescing tracer particles at the desired concentration to the blood samples. A general rule is to have 10 particles in a correlation window, which can be calculated ahead of time.\nFor example, 30 μl of particles are added to 1 ml of blood solution for the set-up depicted in the video. Alternatively, the RBCs themselves could be fluorescently tagged.\nAdditionally, make a calibration solution with water and fluorescing particles. It will be necessary to calibrate the system with a Newtonian solution.",
    "For example, when using a 10X objective with a channel on the scale of 100 μm, a suitable concentration is 300 μl of particles mixed with 15 ml of distilled water. Another option is to use glycerol diluted with distilled water to a viscosity of 3cP, which is closer to blood's macro viscosity.\n3. μPIV Measurements\nLaser safety: Check temperature and humidity. Wear appropriate laser safety glasses. Close the laser curtain or turn on the laser sign on the lab door on to prevent people not protected from being exposed.\nProcedure with Davis software is shown in the video. For more details refer to the user manual of a specific system.\nBefore taking data, the camera scale needs to be calibrated using a micrometer.\nTo reduce the compliance of the system, use the shortest amount of tubing and the smallest rigid syringe possible, such as a 15 or 50 μl Hamilton Gastight syringe. To reduce leakage of blood or air intake into the system, seal the tubing to the syringe and to the chip. This can be done with glue, PDMS or Vaseline (being careful not to contaminate the blood).\nTo fill the micro-syringe with water laced with tracer particles use backflow method because the volume of the micro-syringe is usually much smaller than the volume to fill.",
    "Our backflow method consists to fill the micro-syringe and channel together via the output of the channel using a secondary plastic syringe. For that, first remove the micro-syringe plunger, then push the liquid using the classical plastic syringe attached to the outlet of the channel, let the liquid flow out the micro-syringe until all microbubbles are out of the micro -syringe, tubing or chip, finally put the plunger back, and unplug the plastic syringe. The presence or absence of microbubbles can be verified with a microscope.\nLevel the syringe pump to achieve horizontal tubing. Program the syringe pump to desired flow rate.\nBe aware of the possible transitory effects, like the \"bottleneck effect\", for rigid system or the compliance of the system that modify the actual flow rate. Characteristic times of a system can be estimated as a function of the materials and dimensions of the system. (Chapter 2, pp. 77-81, Tabeling, 2005)\nPlace microchip on microscope stage and start the pump. Use the water with particles to calibrate the system to the middle velocity profile and calibrate the dT (the time between pulsed images).\nThe particles should move between 5 and 10 pixels between frames for a good correlation 11. When calibrating, be careful to measure in the middle of the channel. The focus plane in the middle has the highest velocity 8.\nIf using a round channel, be careful of shadowing effects.\nA sample image is shown in Figure 2, using a pulsed camera, whereas the top image is the first pulse and the bottom image is the second pulse. It can be seen in the figure that the brightest points (fluorescing particles) are the most in-focus.",
    "OPTIONAL: By taking data at different heights a 3D velocity profile can be reconstructed by adding the different vectors into a single image. The video presents a routine that was developed for the automation of the process.\nWhen taking data with the blood, fill syringe with desired quantity of blood in the same method as the water. Program the syringe pump to the desired flow rate, and take desired data. An example of raw images obtained is presented Figure 2. Be careful of RBC sedimentation as well. Refilling the syringe every run or every other run will reduce the settling of the RBC.\nAfter acquiring images, cross correlation is performed on the image pairs to obtain velocity vector fields between images. It is important to have good images to have a good correlation. Before correlating, pre-processing can be done to remove background noise.\nCross correlation is done between windows in the adjacent images, which can be varied in size and shape to affect the correlation. After cross correlation, image post processing can be done to remove erroneous vectors or outliers.\nA detailed description of the different available options and their accuracies can be found in Pitts et al. (2012b), where the best processing for blood was found to be the method of \"image overlapping\" with windows extended in length and aligned with the flow. These operations can be done manually in a program like MATLAB, or within the software package with your system. The software is not important, the math behind the operations is more important and each operation can affect the accuracy of the final velocity profile.",
    "The resulting vectors can be averaged in space across the channel to obtain instantaneous velocity profiles, and then averaged again in time to obtain an average, representative velocity profile. Kloosterman et al. (2011) give an explanation of the error in μPIV measurements where the depth of field is large. Discussions on the error of the data processing presented here can be found in Pitts et al. (2012b) for the pulsed measurements and Chayer et al. (2012) for the high speed measurements.\nExamples of velocity profiles are presented in Figures 3 and 4. Figure 3 presents a single velocity profile for the centerline of a 10 μl/hr flow of RBC at H=10 in a 140 μm wide channel.\nThis single profile is achieved by averaging the correlated vectors across the channel to get a velocity profile, and then averaged in time to get a representative measurement. In this case, 100 pairs were averaged in time across the field of view.\nAn example of the 3D reconstructed profile taken for a water calibration flow in a 100 μm square channel with a programmed flow rate of 30 μl/hr is found in Figure 4. In Figure 4, the profiles are measured at 1 μm intervals.\nOPTIONAL: In the depicted set-up high speed images can be taken at the same conditions by switching cameras (and data acquisition systems). This can be useful for visualizing the cell-free layer in the channel, and for quantifying aggregation. The data analysis is slightly different (Chayer et al., 2012).",
    "Examples of white light images with and without RBC aggregation are presented in Figure 5 at H=20. The top images shows H=20 in PBS, which removes the ability of the RBC to aggregate, at 1 μl/hr. The bottom image is H=20 in native plasma at 0.5 μl/hr. In the bottom image, aggregation is visible.\nShut down the system in a safe manner when measurements have been completed. Use proper laser safety procedures until laser power source is completely shut down.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}