{
  "id": 3157,
  "origin_website": "Cell",
  "title": "Protocol to prepare mouse spinal cord for patch-clamp and histology experiments",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSpinal cord preparation (for patch-clamp and histology experiments)\nTiming: 15–30 min\nThis step will isolate spinal cords from a fully anesthetized mouse. We used ChAT-IRES-Cre::tdTomato reporter mice to identify the SPNs using a fluorescence microscope attached to a patch-clamp setup or a confocal microscope. For histology experiments, SPNs of wild-type mouse can be labeled with immunofluorescence staining with anti-ChAT antibodies.\nAnesthetize the mouse with 5% isoflurane until righting reflex and pedal withdrawal reflex are absent.\nAfter fixing the four limbs to the surgery table in a supine position, expose the liver and heart with Y-incision from midline abdomen to chest.\nTranscardial perfusion troubleshooting 1[href=https://www.wicell.org#sec6.1]\nMake a small incision at the right atrium.\nUse a 30 mL disposable syringe and a 23-gauge beveled syringe needle to perfuse fluid into the left ventricle at the apex (Figure 2[href=https://www.wicell.org#fig2]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2732-Fig2.jpg\nFigure 2. Dissection of mouse spinal cord\n(A) A schematic illustration of transcardial perfusion.\n(B) Laminectomy is performed by gently cutting laminae at 3 and 9o’clock directions from cervical to lumbar level.\n(C) Oblique cutting of the lumbar vertebra (and the spinal cord).\n(D) A schematic illustration demonstrating the level of oblique cutting.\n(E) Gentle cutting of spinal nerve roots on both sides and removing the spinal cord from spinal canal.\nFor patch-clamp experiments, perfuse 20 mL of ice-cold modified ACSF solutions.\nFor histology experiments, perfuse 20 mL of normal saline followed by 20 mL of 4% PFA.\nNote: Transcardial perfusion is successful if the color of the liver turns from deep brown to beige.\nPreparation of the mouse spinal cord.\nLay the mouse in a prone position and fix the four limbs to the surgery table.",
    "Decapitate to expose a cross section of the cervical spinal cord within the spinal canal. It is recommended to cut the cervical vertebra (and the spinal cord) orthogonally.\nNote: The spinal canal lies dorsal to the vertebral body, medial to the pedicle and the transverse process, and ventral to the lamina and the spinous process.\nMake an incision in the midline of back skin from the level of decapitation to the rostral end of the tail.\nPull the skin apart to both sides.\nRemove the interscapular brown adipose tissue and adjacent muscles covering the thoracic vertebrae.\nGently cut both laminae of the vertebrae with micro-dissecting scissors from cervical to upper lumbar level. Perform laminectomy to upper lumbar level while grabbing resected dorsal part including spinous process and laminae with forceps in the other hand (Figure 2[href=https://www.wicell.org#fig2]B).\nMake an oblique cut of the lumbar vertebra (and the spinal cord) at the level between the origin of the 2nd and the 3rd ribs from the caudal end. Oblique cutting helps to distinguish lumbar ends from cervical ends (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nNote: IML containing SPNs is found in spinal cord levels from T1 to L1. The L1 level lies within the spinal canal of the T11 vertebrae which is the origin of the 3rd rib from the caudal end.\nTo remove the spinal cord out of the spinal canal, gently grab and lift up the cervical end of the spinal cord with forceps. Cut spinal roots at both sides with micro-dissecting scissors and proceed to the L1 level (Figure 2[href=https://www.wicell.org#fig2]E).\nPlace the spinal cord in a 100 mm Petri dish filled with either modified ACSF (ice-cold, for patch-clamp experiments) or 4% PFA (at 15°C–25°C, for histology experiments).\nTrimming the spinal cords",
    "Under a stereomicroscope, peel off the spinal meninges and spinal nerve roots covering the spinal cord using fine forceps (Methods video S1[href=https://www.wicell.org#mmc1]).\nGrab the cervical end with fine forceps to find and peel off meninges and nerve roots. The cervical end will be cut off in the next step.\nCritical: Spinal meninges are tough membranes that can cause strangulation injury to the spinal cord. To prevent strangulation, tear the meninges at the cervical end and peel off longitudinally as shown in Methods video S1[href=https://www.wicell.org#mmc1]. If the spinal cord is strangulated while peeling spinal meninges off, the meninges at the area of strangulation must be eased off with fine forceps.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. How to remove meninges, related to step 5 of spinal cord preparation (for patch-clamp and histology experiments)\n    \nMaking acute spinal cord slices with a vibratome (for patch-clamp experiments)\nTiming: 60 min\nThis step prepares acute spinal cord slices for patch-clamp recording. To reliably obtain slices of constant thickness from this fragile tissue, attach the spinal cord to an agarose block.\nPrior to this step, the lattice-shaped storage chamber should be filled with storage solutions and the VibroCheck should be performed, as described in “before you begin[href=https://www.wicell.org#before-you-begin]” section.\nPlace trimmed spinal cord submerged in ice-cold modified ACSF (from step 3 of “before you begin[href=https://www.wicell.org#before-you-begin]” section) in a dry Petri dish. Make sure the spinal cord lies straight and remove excess water from the surface with filter paper.\nCritical: Use the tip of paper towel or filter paper so that the papers may not adhere to the spinal cord. Removing excess water from the surface is an important step to ensure that glue attaches the spinal cord tightly to the agarose block.",
    "Apply glue on the concave edge of the agarose block (Figure 3[href=https://www.wicell.org#fig3]A), and gently place the spinal cord on the glued edge of the block (Figure 3[href=https://www.wicell.org#fig3]B). During this step, grab both ends of the spinal cord with fine forceps. Wait 5 min after placing the spinal cord on the agarose block (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2732-Fig3.jpg\nFigure 3. Making acute spinal cord slices using a vibratome\n(A) Applying glue on the concave edge of the agarose block.\n(B) Laying down the spinal cord on the agarose block using fine forceps.\n(C) A schematic illustration of cervical and lumbar enlargements of mouse spinal cord.\n(D) Oblique view of agarose block with spinal cord. Inset shows a different view of agarose block with spinal cord.\n(E) Cutting of the agarose block to remove cervical and lower lumbar ends of the spinal cord. The ∼1.8 cm-long thoracolumbar spinal cord in the center is used for making spinal cord slices.\n(F) Agarose block is glued upright on the specimen plate. Black arrow indicates the V-shaped incision line (black line).\n(G) The specimen plate and the agarose block with spinal cord is placed in the buffer tray. Black arrow indicates the V-shaped incision line (black line).\n(H) Acute spinal cord sections collected in the storage chamber.\nCritical: Proper amount of glue is another key point. Excessive amount of glue not only requires more time to dry but also produces sticky ends, which makes it difficult to slice with a vibratome. Insufficient amount of glue will lead to detachment of the spinal cord from the agarose block.",
    "Cut off the cervical and lumbar ends of the spinal cord using razor blades, leaving ∼1.8 cm spinal cord and agarose block. To preserve the T1 level of spinal cord, the remaining spinal cord must include the narrowing part of the cervical enlargement (Figures 3[href=https://www.wicell.org#fig3]C–3E). The orientation of spinal cord should be maintained before cutting the spinal cord and agarose block.\nNote: Spinal cord has cervical and lumbar enlargements. In the rostral to caudal direction, the narrowing of the spinal cord means the beginning of the thoracic spinal cord, and the widening of spinal cord means the beginning of the lumbar spinal cord.\nPlace the agarose block upright with the lumbar part facing down and glue it to the specimen plate.\nWait for 5–10 min for attachment.\nPrior to sectioning, make V-shaped incision along the longitudinal axis of the agarose block to minimize the moving distance of blade (Figure 3[href=https://www.wicell.org#fig3]F).\nPlace the specimen plate in buffer tray of the vibratome and pour ice-cold modified ACSF into the buffer tray (Figure 3[href=https://www.wicell.org#fig3]G).\nObtain spinal cord sections following the manufacturer’s instruction[href=https://www.leicabiosystems.com/sites/default/files/media_product-download/2021-03/Leica_VT1200S_IFU_1v7J_en.pdf]; speed 0.10–0.20 mm/s, thickness 250 μm. When the blade reaches the V-shaped incision, use forceps to gently push the agarose from the other side of block against the blade so that the agarose block and spinal cord slices can be easily released. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nTransfer sections immediately to storage chambers filled with oxygenated ACSF (Figure 3[href=https://www.wicell.org#fig3]H).\nAllow 1 h for recovery in the storage solution at 34°C before starting patch-clamp experiments. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2732-Fig4.jpg\nFigure 4. Spinal cord section at level T1\n(A) Brightfield image of spinal cord (10X). Scale bar, 200 μm.\n(B) Expression of tdTomato fluorescence in the same section. The rectangles highlight sympathetic preganglionic neurons located within the IML. Scale bar, 200 μm.",
    "Note: Based on MRI image of the mouse spinal cord, it is 18.2 mm from T1 to L1 level. The length of the T1 level is half the length of each of T2 to L1 levels.3[href=https://www.wicell.org#bib3] Theoretically, 18.2 mm-long spinal cord would contain 72.8 slices when cut in sections with 250 μm thicknesses. Therefore, we assumed that the slices consist of 2.7 sections of T1, and 5.4 sections of each of T2 to L1. The IML region of the ChAT-IRES-Cre::tdTomato reporter mouse was explored in the rostral to caudal direction, and the first slice where the tdTomato-positive neurons were found was regarded as T1 (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nPreparation of spinal cord for cryosectioning (for histology experiments)\nTiming: 3 days\nThis step fixes, dehydrates, and embeds the spinal cord tissue prior to cryosectioning. Make sure that the spinal cord lies straight in a Petri dish during these steps.\nPlace trimmed spinal cord prepared in 4% PFA in a 60 mm Petri dish. Make sure the spinal cord lies straight, remove excess PFA from the surface with paper towel, and wait at least 10 min to attach the spinal cord to the Petri dish.\nGently pour 4% PFA to fill the Petri dish, and leave the spinal cord submerged at 4°C for 12 h.\nNote: Mouse brain is usually post-fixed with 4% PFA for 16–24 hours. However, spinal cords are relatively thin and require less time for post-fixation (e.g., 2 h,4[href=https://www.wicell.org#bib4] 4 h,5[href=https://www.wicell.org#bib5] or 6–8 h6[href=https://www.wicell.org#bib6]). In this protocol, we chose 12 hours of post-fixation, and performed antigen retrieval for ChAT immunofluorescence staining. The optimal time and the requirement of antigen retrieval needs to be determined case-by-case, and it is recommended to perform pilot experiments under various conditions.",
    "Cryoprotection: After 12 h, remove the 4% PFA and fill the Petri dish with PBS-based 30% sucrose solution. Store it at 4°C for 48 h.\nAfter 48 h, detach the spinal cord from the Petri dish and remove moisture.\nEmbedding: Cut off the cervical and lumbar ends of the spinal cord using razor blades, leaving ∼1.8 cm spinal cord in the center. To preserve the T1 level of spinal cord, make sure the spinal cord includes the narrowing part of the cervical enlargement. Store the spinal cord in the embedding medium at −80°C.\nPause point: Once the embedded spinal cord is frozen, it can stably be stored at −80°C for up to 6 months.\nFollowing the manufacturer’s instruction[href=https://www.leicabiosystems.com/sites/default/files/media_product-download/2022-05/Leica_CM1950_IFU_2v6W_US_en.pdf], collect serial cryosections (40 μm thickness) of the spinal cord in PBS-filled 24-well plates, placing 5 slices per 1 well. Complete sections of one mouse spinal cord require four 24-well plates.\nStore the plates at 4°C. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nNote: Spinal cord slices stored in PBS should be used for immunofluorescence staining within 3 days after cryosection for good quality. If you need more time before immunofluorescence staining, you can use cryoprotectant solutions instead of PBS. In this case, make sure you wash the sample with PBS before mounting the slices on slide glasses.\nAntigen retrieval and immunofluorescence staining (for histology experiments)\nTiming: 2 days\nIn this protocol, the heat-induced antigen retrieval method was used for better visualization of ChAT immunofluorescence.\nMount the spinal cord slices on the slide glass, 1 of 5 slices from 1 well, starting from rostral sections and proceeding to caudal sections. Mounting in 4 rows (12 pieces per row) onto a slide glass requires 2 slide glasses to accommodate spinal cord sections from 1 mouse. Fully dry the mounted sections at 15°C–25°C.",
    "Note: Serial mounting of spinal cord slices (from rostral sections to caudal sections) on slide glasses facilitates tracking of the spinal cord levels.\nNote: It is helpful to use a small brush for transferring the slices to the slide glass and 23-gauge syringe needles to align slices within the slide glass before drying.\nPreheat the 10 mM sodium citrate buffer to 60°C using a water bath during slice mounting.\nWashing: immerse the slide glasses in a PBS-filled jar and place it on the gently working rocker for 5 min. Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nAfter one cycle of washing, immerse the slide glasses to a heated 10 mM sodium citrate buffer for 30 min.\nAfter 30 min of antigen retrieval, repeat 3 cycles of washing with PBS to remove antigen retrieval buffer.\nAfter washing, dry the slide glasses at 15°C–25°C and draw edge lines with liquid blocker pen.\nCritical: Drawing the edge lines with liquid blocker pen should not be performed prior to heat-induced antigen retrieval.\nPause point: When the slices are fully dry on the slide glass, you can store the slide glass at –80°C for 5–6 months, before or after heat-induced antigen retrieval.\nWhen the liquid blocker is dry, proceed to immunofluorescence staining starting from blocking and permeabilization step as described in Table 1[href=https://www.wicell.org#tbl1].\nNote: Theoretically, 18.2 mm-long spinal cord (T1 to L1)3[href=https://www.wicell.org#bib3] would contain 91 x 5 slices when cut in sections with 40 μm thickness. Therefore, we assumed that level T1 has 3.4 slices, and each of levels T2 to L1 has 6.8 slices when mounted on the slide glass. The level T1 was determined as described in Figure 4[href=https://www.wicell.org#fig4]."
  ],
  "subjectAreas": [
    "Metabolism",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}