{
  "id": 8890,
  "origin_website": "Jove",
  "title": "Müller Glia Cell Activation in a Laser-induced Retinal Degeneration and Regeneration Model in Zebrafish",
  "procedures": [
    "All experiments adhered to the Statement for the Use of Animals in Ophthalmic and Vision Research of the Association for Research in Vision and Ophthalmology (ARVO) and respect the related regulations of the governmental authorities.\n1. Animals\nMaintain TgBAC (gfap:gfap-GFP) zebrafish 167 (AB) strain aged between 6 - 9 months under standard conditions in water with a temperature of 26.5 °C and a 14/10 h light/dark cycle18.\nFollow the animal care guidelines of the involved institutions for the animal experiments after approval by the governmental authorities.\n2. Reversible Systemic Anesthesia\nPrepare the stock solution of ethyl 3-aminobenzoate methanesulfonate salt (tricaine) by dissolving 400 mg of tricaine powder in 97.9 mL of tank water and 2.1 mL of 1 M of Tris buffered saline (TBS). Adjust to pH 7.0 with 1 M Tris (pH 9) and store at 4 °C in the dark up to one month.\n\tNOTE: Tricaine should be prepared in water like the natural living conditions of the animal, preferably original tank water should be used.\nDilute the stock solution 1:25 in tank water and use immediately.\nPlace the zebrafish into a 10 cm Petri dish containing 50 mL of anesthesia solution until they become immobile and do not respond to external stimuli (approximately 2 - 5 min, depending on weight and age).\nTransfer each fish by hand to a custom-made silicone pin holder for laser treatment (Figure 1A).\n\tCAUTION! The fish can remain anesthetized outside of the tank for up to 10 min only.\nTo reverse anesthesia after the treatment and/or imaging, place the zebrafish in container containing tank water.\nTo support recovery, create a flow of fresh tank water over the gills by moving the zebrafish back and forth in the water.\n3. Laser Focal Injury on Retina",
    "NOTE: A 532 nm diode laser is used to create focal light damage on the retina of the zebrafish. The experimental set-up of the laser enables the establishment of a reproducible focal retinal injury in adult zebrafish.\nSet up the output power of the laser: 70 mW; aerial diameter: 50 µm; pulse duration: 100 ms.\n\tCAUTION! The use of laser light requires appropriate personal protection and labelling of the area.\nApply 1 - 2 drops of 2% hydroxypropylmethylcellulose topically in the eye before treatment and use a 2.0 mm fundus laser lens to focus the laser-aiming beam on the retina.\n\tCAUTION! hydroxypropylmethylcellulose drops are viscous and may cause problems in breathing if it goes on the gills.\nPlace four laser spots around the optic nerve on the left eye and use the right, untreated eye as internal control.\n4. In vivo Imaging of the Retinal Morphology\nOn day 0, visualize the zebrafish retina directly after the laser induction without reviving them from anesthesia. At all other time points, employ general anesthesia (see Section 2: Reversible systemic anesthesia). Place the immobilized zebrafish on a custom-made silicone pin holder (Figure 1B, B.1).\nTo obtain optimal images, cut a commercially available hydrogel contact lens to fit the zebrafish eye (Ø = 5.2 mm, r = 2.70 mm, center thickness = 0.4 mm) by means of a hole punch. Fill the concave surface of the lens with methylcellulose and place it over the cornea.\nEquip the OCT system with a 78D non-contact slit lamp lens.\nFocus the infrared (IR) image in the IR + OCT mode (Figure 2A) to visualize the fundus of the eye and take the IR pictures by clicking the \"Acquire\" button (Figure 2B) to localize the laser spots on the retina using the system's software.",
    "Visualize a three-dimensional section of the retinal layers in the IR + OCT mode and take the pictures by clicking the \"Acquire\" button (Figure 2B). Observe the severity of injury in the outer nuclear layer (ONL) (see Section 3: Laser focal injury on retina) in these images.\nTo reverse anesthesia after the treatment and/or imaging place the zebrafish in a container containing tank water.\nTo support recovery, create a flow of fresh tank water over the gills by moving the zebrafish back and forth in the water.\nPerform similar in vivo imaging of retinal morphology on day 1, 3, 7, 14 and week 6.\n5. Hematoxylin & Eosin (H&E) Staining\nEuthanize zebrafish by submersion into cold (4 °C) anesthesia solution on ice for at least 10 min and enucleate the eyes immediately by means of small curved forceps.\nFix the whole eyes in 4% paraformaldehyde (PFA) in phosphate buffered saline (PBS) at 4 °C for 20 h and then dehydrate the samples in a graded alcohol series (xylene 100% for 5 min twice, ethanol 100% for 5 min twice, ethanol 96% for 3 min twice and ethanol 70% 3 min once).\n\tCAUTION! PFA can be irritating to the eyes, nose, and upper respiratory track. PFA is a known human carcinogen and a suspected reproductive hazard.\nEmbed the samples in paraffin, cut 5 µm sections at the level of the optic nerve head and mount them on glass slides.",
    "Stain the deparaffinized sections with 0.1% acid hematoxylin solution for 5 min and dip the slides two times in distilled water after dipping the slides in hydrochloric acid mix (2 mL 25% HCl in 250 mL distilled water) and ammonia mix (2 mL 25% ammonia in 250 mL distilled water). Stain the sections with eosin G aqueous solution 0.5% for 3 min after development of the hematoxylin staining by tap water for at least 10 min.\nMount the dehydrated slides in acrylic resin mounting medium and observe the slides under the light microscope.\n6. Immunohistochemistry for the MC Activation\nHeat the deparaffinized sections in antigen retrieval buffer (Tris-EDTA + 0.05% non-ionic detergent, pH 9.0) for 3 min in an appropriate steamer or a microwave for 10 - 15 min and wash three times with TBS for 5 min each.\nCircle the sections with a silicone pen and add 100 µL blocking solution (TBS + 10% goat normal serum + 1% bovine serum albumin, pH 7.6) at room temperature for 1 h.\nStain with anti-glial fibrillary acidic protein (GFAP) rabbit polyclonal antibody and with anti-glutamine synthetase (GS) mouse monoclonal antibody, both in a 1:200 dilution (40 µL per sample). Incubate the slide in a humidified chamber at 4 °C overnight. Wash three times with TBS + 0.1 % Tween 20 for 5 min each.\nFinish visualization with the appropriate secondary antibodies. This protocol used a goat anti-rabbit IgG H&L green secondary antibody for GFAP and a goat anti-mouse IgG H&L bright red for GS, both in a 1:500 dilution at room temperature for 1 h.\nMount the slides with mounting medium containing DAPI and observe the slides under the fluorescence microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}