{
  "id": 9180,
  "origin_website": "Jove",
  "title": "Using the Electroretinogram to Assess Function in the Rodent Retina and the Protective Effects of Remote Limb Ischemic Preconditioning",
  "procedures": [
    "This protocol follows the animal care guidelines of University of Sydney.\n1. Making Electrodes\nConstruct the positive electrode (the one which will contact the cornea) from a short (5 cm) length of platinum wire 1-2 mm in diameter. Fashion it into a loop a few mm in diameter. Connect this loop to a conventional lead, long enough to reach the input stage of your amplifier (see Figure 4).\nConstruct the negative electrode (which will go in the animal’s mouth) using an Ag/AgCl pellet 1-2 mm in diameter, also connected to a convention lead (see Figure 4).\nAs a reference electrode (which will go into the animal’s rump), use a clean hypodermic needle (23 G), also connected to a lead of appropriate length (see Figure 4).\nIdeally, use three-lead cables provided by instrument manufacturers, to connect the three electrodes (positive → cornea, negative → mouth, reference → rump) to the amplifier.\n2. Connection and Calibration of Light Stimulus and ERG Set-up\nCreate (or locate) a small recording laboratory, which can be made dark. Equip with either or both of an over-the-bench light made red or a red head-lamp.\nUse a lux meter to confirm that red light illuminance reaching the rat’s eye during setup does not exceed 1 lux.\n\tNote: A neutral density filter can be used to reduce lamp brightness and the source of lamp light must specifically emit red light. Dark adaption will be compromised if light sources emit lower (visible) wavelengths.\nSeal off all stray light entering the recording laboratory (this often requires persistence with opaque tape) and prepare a neutral density filter (this can be purchased in sheets) large enough to fit over, and so dim, any computer screen you will have in the lab.",
    "Note: Stray light and the light of a screen are sufficient to prejudice dark adaptation of the rat eye.\nConnect the amplifier to data acquisition hardware. Connect positive, negative and reference leads to the amplifier. Make sure the computer and the LED Ganzfeld power supply unit are securely connected to a ground source.\n\tNote: Some labs have specialised grounding points, connected to a building ground; a water pipe is an effective alternative.\nCalibrate the LED light source with a research-quality radiometer. Fix the meter’s sensor in the position at which the animal’s eye will be located during an experiment.\nProgram the Ganzfeld LEDs to run a full-field ERG protocol with step-wise increases in flash energy, flash duration, flash repetition and time between flashes, termed interstimuls interval (ISI), settings. For an example full-field protocol see Table 1.\n\tNote: The full-field ERG flashes increase from repetitive dim flashes to bright flashes in a step wise fashion. The twin flash program follows on from the full-field protocol and enables isolation of rod and cone responses.\n3. Day Prior to ERG Experimentation\nDark adapt Sprague-Dawley rats for 12 hr before recording. It is convenient to do this in the recording laboratory, once stray light has been eliminated.\n4. Day of ERG Experimentation\nArrange for the animal to be gently heated while recording. We use a light metal platform built so that the animal’s head can rest at the correct point at the entry to the Ganzfeld. The platform has inbuilt tubing through which we pump water preheated to 40 °C in a water bath.\n\tNote: Experience shows that this keeps the animal’s core temperature at 37 °C.",
    "Weigh the rat under dark conditions. Record weight and make up correct ketamine (60 mg/kg) and xylazine (5 mg/kg) dose. Restrain the rat gently and inject anaesthetic intraperitoneally.\nNote time of injection. Once the animal is unconscious (usually within 5 min) check depth of anaesthesia by lightly pinching one foot pad, to see if a reflex response is present. It is best to wait until this reflex is absent or weak, before proceeding.\nApply a single drop of atropine and another of proxmethacaine to cornea.\nCut a 10 cm length of black thread. Make a loop with a simple knot and slip the loop over the equator of the eye. Tighten it slightly; the effect is to draw the eyeball slightly forward, with minimal pressure. This keeps the cornea clear from the eyelids.\nApply carbomer eye drops to the cornea surface. Ensure carbomer remains on corneal surface and does not spill onto the eyelids or the face.\nPlace absorbent bedding on top of heated platform.\nPosition rat on the bedding, with the head in the recommended place in the opening of the Ganzfeld.\nInsert internal temperature probe into the rectum. Secure temperature probe in position by taping probe cord to the tail.\nInsert the reference electrode (the 23 G needle) subcutaneously into the rear leg, and connect to amplifier.\nPlace the negative electrode (the Ag/AgCl pellet) securely in the mouth. To prevent this slipping out the mouth, affix the connecting lead to a stable surface.\nPosition the positive electrode over the centre of the cornea. Using a micromanipulator, ensure that the electrode touches the cornea gently.\nCheck body temperature is at 37.0 - 37.5 °C.",
    "Once the animal is properly positioned and electrodes are in place, drape the whole setup (Ganzfeld and animal) with an opaque material (to preserve dark adaptation). We use a soft black cloth.\nIn the acquisition software set at a 2 KHz sampling rate with a collection time of 100-1000 msec with 5 msec of pre-collection sampling. Set the band pass filters to 1-1,000 Hz and ensure that sampling is triggered to sample the period of ~250 msec following a flash.\nCheck the recording baseline. It should be free of extraneous noise, but show some amplifier noise and a respiratory oscillation.\nIf the baseline shows extraneous noise, begin troubleshooting. Most problems are related to slippage in electrode position, or grounding. Use a faraday cage to ensure recordings are free of extraneous noise.\nRun a test flash, 0.4 log scot cd.s.m-2. An ERG waveform similar to Figure 2A should appear. In our laboratory typical responses for a 0.4 log scot cd.s.m-2 flash are (a-wave: -474 ± 39 µV and b-wave: 1,512 ± 160 µV, n = 11).\nAllow animal to dark re-adapt for 10 min. It is convenient to use these 10 min to recheck the baseline.\nFollowing confirmation of stable signal begin recording.\nAt the end of the recording session, check that body temperature was maintained. Remove electrodes. Reapply carbomer polymer to corneas. Allow the animal to recover on a heat pad until it is fully mobile and active, before returning to animal housing.\n5. Remote Ischemia\nPerform remote ischemia in either awake or anesthetised rodents.\nIf the animal is anaesthetised, lay it on a heated platform (above) and slip the sphygmomanometer cuff over the upper part of the hind-limb, clear of the knee.",
    "If the animals are used to being handled, it is possible to perform this procedure without anaesthesia; this requires two people. One person restrains the animal gently and the second applies the sphygmomanometer cuff and operates the sphygmomanometer.\nFor awake animals, use a piece of towel ~15 cm x 30-50 cm to gently wrap the animal, with one hindlimb free. Lay the animal on its back on (say) the left forearm, with its head tucked between the holder’s arm and torso, and place the cuff as just described.\nDeflate the cuff and ensure the air pressure valve is closed. Pump the cuff to 160 mmHg in anesthetised animals, and to 180 mmHg in awake animals. This exceeds systolic pressure (usually 140 mmHg and 160 mmHg respectively).\nMaintain these pressures as required, using the hand-held pump.\nAfter the planned time for ischemia (we use 2 periods of 5 min separated by 5 min reperfusion), deflate the cuff pressure by loosening the air pressure valve.\nConfirm the effect of remote ischemia with a skin temperature probe attached to the footpad. Skin temperature typically falls from 32-30 °C, over 5 min and recovers on reperfusion.\n6. Light Damage\nEnsure that rats are in a dark-adapted overnight, before the light damage procedure.\nAt the appropriate time following limb ischemia (in our experiments without delay), each animal is placed singly into a plexiglass boxes, with water and food in floor-based containers.\n\tNote: Light-induced damage can only be undertaken in albino animals.\nSwitch on a pre-calibrated 1,000 lux white light at a standard time (usually 9 am) and maintain this condition for 24 hr.\n7. ERG Data Extraction and Analysis\nAcquire averaged wave forms of the ERG. If required, correct for a non-zero baseline, by subtraction.",
    "Measure the amplitude of the a-wave (presented at mid- to high stimulus intensities), as the voltage difference between the baseline and the first (<30 msec latency) trough (Figure 1).\nMeasure the b-wave amplitude as the voltage difference between the peak of the a-wave and the positive of the following wave, typically occurring at a latency of 80-100 msec (Figure 1).\nIsolate oscillatory potentials by using a Fourier transform to filter data from 60-235 Hz, with a 90 Hz transition band7. If required the isolated oscillatory potential signal can then be subtracted from the unfiltered waveform to confirm the identity of the a-wave trough.\nThe implicit time (latency) of the a- and b-wave peaks can also be a useful measure (Figure 1). Use the twin flashes to isolate the rod response. Subtract the cone response (flash 2) from the mixed response (flash 1) to isolate the rod response (Figure 2).\nNormalize individual light intensity a-wave and b-wave amplitudes (post-treatment/post-treatment-baseline) or averaged for treatment groups. Intensity-response curves plot the group amplitudes and error against flash energy.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}