{
  "id": 6690,
  "origin_website": "Bio",
  "title": "Preparation of <em>Actinoplanes missouriensis</em> Zoospores and Assay for Their Adherence to Solid Surfaces",
  "procedures": [
    "Preparation of A. missouriensis zoosporesInoculate A. missouriensis cells from a glycerol stock on YBNM agar medium and cultivate them at 30 °C in an incubator for 2 or 3 days (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194723_8482.jpgFigure 1. A YBNM agar plate (diameter, 9 cm) on which A. missouriensis mycelia are grown for 4 days at 30 °CUsing a sterilized toothpick, cut the agar medium to prepare an agar piece (approximately 1 cm square), on the surface of which A. missouriensis mycelium has proliferated (Figure 2). Put the agar piece into PYM broth (100 ml) in a shaking flask to inoculate the mycelium, and cultivate the A. missouriensis cells by shaking at 120 rpm at 30 °C for 2 days (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194744_1034.jpgFigure 2. Preparation of an agar piece for the inoculation of A. missouriensisimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194803_7450.jpgFigure 3. Liquid culture of A. missouriensis in a shaking flask (at 30 °C for 2 days)Collect the cells by centrifugation at 2,330 x g for 10 min at RT.Suspend the cells in 0.75% NaCl solution (50 ml) and centrifuge them at 2,330 x g for 10 min at RT.Resuspend the cells in 0.75% NaCl solution (10 ml; Figure 4) and inoculate a portion (0.1 ml) of the cell suspension on one HAT agar plate.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194827_9127.jpgFigure 4. A. missouriensis mycelia suspended in 0.75% NaCl solutionSpread the cell suspension and completely dry the surface of the HAT agar medium.Incubate the plate at 30 °C for at least 7 days (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194904_6067.jpgFigure 5. A HAT agar plate (diameter, 9 cm) on which A. missouriensis are grown for 7 days at 30 °C. Many sporangia are produced on substrate mycelium.Pour 25 mM NH4HCO3 solution (10 ml) onto the HAT agar plate (Figure 6) and incubate it at 30 °C for 1 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194925_4309.jpgFigure 6.",
    "Pouring of NH4HCO3 solution onto HAT agarCollect the poured solution, which contains swimming zoospores (approximately 104-105 cells/μl; Figure 7). Keep the solution at RT until the use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215194946_4568.jpgFigure 7. A. missouriensis zoospore-containing solutionZoospore adhesion testAttach a coverslip to a hydrophobic polystyrene dish or a hydrophilic glass dish by using two pieces of double-sided tape. Make a tunnel chamber by arranging the tape as parallel lines and making open slits on both sides of the coverslip (Figure 8). This arrangement enables a reproducible distance between the coverslip and dish, ensuring the fixed volume of the tunnel chamber, and also enables a replacement of the solution inside the chamber using a filter paper. The protocol using a similar tunnel chamber has already been published by Kasai and Miyata (2013).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215195010_8440.jpgFigure 8. Illustration of a tunnel chamber(Optional; BSA-coating on the surface of a hydrophobic polystyrene dish) Using a micropipette, pour 1% BSA solution into the space between the dish and coverslip. Keep it at RT for 1 min. Absorb 1% BSA solution from a side of the chamber using a filter paper. By a similar procedure, wash the chamber with 25 mM NH4HCO3 solution. The BSA-coating treatment renders the dish surface hydrophilic. Through the treatment, the average proportion of the zoospores that adhered to the dish surface decreased from 41% (non-treated dish surface) to 0.2% (BSA-treated dish surface; Kimura et al., 2019).Using a micropipette, put the zoospore-containing solution (12 µl) carefully into the space between the dish and coverslip without introducing air bubbles. Incubate the chamber at RT for 10 min.Record the zoospores that adhered to the dish surface and the swimming zoospores in the tunnel by using a phase-contrast microscope equipped with a 20x objective lens. A lab recorder system and a CMOS camera enable the high-speed (200 frames per second) imaging.",
    "Scan the microscopic fields along the vertical direction for the analyzing region of the tunnel chamber in 3 s (600 images in total).Using a micropipette, put the 25 mM NH4HCO3 solution (150 μl) on one side of the tunnel and absorb the zoospore-containing solution from the other side using a filter paper to completely exchange the solution for 25 mM NH4HCO3 solution for the removal of the zoospores that did not adhere to the solid surface.Photograph the zoospores that adhered to the dish surface by using the microscope.Data analysisConvert the movie files recorded in Step B4 into AVI files. Convert the 8-bit images recorded in Step B6 into TIF files without compression using ImageJ, an image analysis software.Count the total number of swimming zoospores and those adhered to the dish surface in the analyzing region of the tunnel chamber by ImageJ using the microscopic images recorded in Step B4. The Color_FootPrint macro for ImageJ (http://www.jaist.ac.jp/ms/labs/hiratsuka/images/0/09/Color_FootPrint.txt[href=http://www.jaist.ac.jp/ms/labs/hiratsuka/images/0/09/Color_FootPrint.txt]) enables the visualization of the zoospore swimming trajectories (Hiratsuka et al., 2006).Open a movie file by using the command “File > Open”. Check off the boxes for “Use Virtual Stack” and “Convert to Grayscale”.Start the Color_FootPrint macro by using the command “Plugins > Macros > Color Footprint Rainbow”. The macro visualizes zoospore swimming trajectories (Figure 9B).Count the number of the stationary cells on the dish surface (Figure 9A) and the number of the colored trajectories, which represents the number of swimming zoospores, in the analyzing region of the tunnel chamber scanned in Step B4, by visual inspection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215195059_2846.jpgFigure 9. Counting the number of zoospores in the tunnel chamber by ImageJ. A. Input image; the first image of the total 600 scanning images is shown as a representative. B. Output image; colored trajectories are shown. Scale bar = 50 μm.",
    "Count the number of zoospores that adhered to the dish surface using the microscopic images recorded in Step B6 by ImageJ.Open an image by using the command “File > Open”.Select the analyzed region of the microscopic field scanned in Step B4 by using the “Rectangle” tool and clip the field by using the command “Image > Crop”.Set a threshold level by using the command “Image > Adjust > Threshold”.Count the number of zoospores by using the command “Analyze > Analyze Particles”. Set appropriate values of the parameters “Size” and “Circularity” (Figure 10).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191215/20191215195124_0655.jpgFigure 10. Counting the number of zoospores on the dish surface by ImageJ. A. Input image. Scale bar = 20 μm. B. Output image. A part of the original image is enlargedly shown.Calculate the adhesion ratio, i.e., the proportion of adhesive zoospores to whole zoospores: C3/C2. Correction values per unit area should be used for the calculation."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}