{
  "id": 3507,
  "origin_website": "Cell",
  "title": "Protocol for Microbiome Transplantation in Suckling Mice during Vibrio cholerae Infection to Study Commensal-Pathogen Interactions",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nPreparation of Suckling Mice for Gavage\nTiming: 1 h on day 0\nCritical: Specific-pathogen free (SPF) mice need to be pre-treated with oral antibiotics for 24 h prior to introduction of bacteria. Gavage procedures for antibiotics and bacteria cultures or human fecal specimens are identical.\nNote: All 30°C steps are in incubator with open water pan to maintain humidity.\nMice should be 4 days old at time of antibiotic administration. CD-1 suckling animals were purchased from Charles River Laboratories. Germ-free suckling animals were obtained from the UCR gnotobiotic animal facility. Similar results have been obtained with C57/BL6 background suckling animals, and specific mouse backgrounds may be more appropriate depending on the pathogen of interest.\nFast infants (separate them from the lactating dam) for 1.5 h before gavage. Place pups in 50 mL plastic beaker lined with paper-towel or Kimwipe in 30°C incubator with open water pan to maintain humidity.\nDuring fasting period, prepare materials needed for gavage including isoflurane, 30-gauge plastic tubing, glycerol, 30G × 1 needles, and 1 mL syringe.\nTarget antibiotic dosing is 1 mg/g body weight streptomycin. Based on the average weight of 4 days old suckling mice, concentration of streptomycin in 50 μL gavage would be 75 mg/mL in ddH2O. Gavage procedure for streptomycin is identical to that described in steps 6–12.\nPreparation of Bacterial Gavage\nTiming: 2 h on each day 1 and day 2\nPlace the 50 mL beaker containing fasted animals in 500 mL plastic jar (wide-mouth polypropylene jar with lid) lined with tissue paper or Kimwipe (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/308-Fig1.jpg\nFigure 1. Preparing the Container Setup and Mice for Gavage\n(A) A large container is lined with paper to absorb isoflurane.\n(B) Measure and mark the gavage tube length needed to reach the stomach for intra-gastric gavage.",
    "(C) Place 1–2 pups in a small container and place inside a large container to isolate from isoflurane.\n(D) After absorbing the tissue in the outer container with isoflurane, place lid loosely and wait 30 s to anesthetize pups.\nTake a representative animal, place the plastic tubing to be used for gavage parallel to their body, and mark on the tube using permanent marker the distance from the tubing end represented by the snout to the stomach measurement (Figure 1[href=https://www.wicell.org#fig1]B). During gavage, tubing will need to be inserted until this mark reaches the snout of the animal to ensure intra-gastric inoculation (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/308-Fig2.jpg\nFigure 2. Gavage of Pups\nAbsorb 150 μL of isoflurane into tissue paper in jar.\nCritical: This prevents direct exposure of skin to isoflurane, which can cause pain/discomfort.\nCritical: Work inside chemical fume hood when working with isoflurane.\nPlace suckling mouse to be inoculated in small interior container (Figure 1[href=https://www.wicell.org#fig1]C), re-place the lid on the outer container, and wait 30 s (Figure 1[href=https://www.wicell.org#fig1]D).\nNote: For anaesthetization of 2 mice, use ∼300 μL isoflurane.\nCritical: Be careful not to tighten the lid of the outer container.\nTake the bacterial mixtures (either complex or cultured microbiomes with V. cholerae, see steps 8 or 15, and step 9 in Before you Begin[href=https://www.wicell.org#before-you-begin]) that have already been prepared by syringe from the vial. Place the tubing on the needle using forceps sterilized with 70% vol/vol ethanol (see Methods Video S1[href=https://www.wicell.org#mmc1]), and dip the marked area of the tubing in sterile 50% glycerol to lubricate tubing.\nCarefully insert tubing into the mouth of the suckling mouse, aligning the trajectory of the tubing to match the esophagus (Figure 2[href=https://www.wicell.org#fig2]).",
    "Once the mark on tubing reaches the snout, inject 50 μL of the inoculum into stomach. For example of complete gavage procedure, see Methods Video S2[href=https://www.wicell.org#mmc2].\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. Procedure for Tubing Preparation (Step 3 in Step-by-Step Method Details Section)\nAfter each gavage, place mouse back in 30°C incubator.\nAfter 15 min to disperse any residual isoflurane, place infants with dam.\nThe next day, after preparing the cultures for gavage, fast the suckling mice in 30°C for 1.5 h.\nRepeat the gavage with bacteria cultures/human fecal samples.\nPlace inoculated mice separated from dam in 30°C incubator for 15–16 h.\n        Your browser does not support HTML5 video.\n      \nMethods Video S2. Procedure for Mouse Gavage (Steps 6–11 in Step-by-Step Method Details Section)\nMouse Dissection and Intestinal Homogenization\nTiming: 4–5 h\nAnesthetize the mice using the two-container method as described above for gavage, but add 1 mL isoflurane and close the outer lid tightly.\nAfter 4–5 min, remove mice from container. Perform cervical dislocation to euthanize, and prepare for dissection.\nCritical: Disinfect all the forceps and scissors by ethanol (let them dry by air).\nSpray 70% vol/vol ethanol on the surface of the body and allow it to air dry.\nMake initial incision in the abdominal wall with dissection scissors (Figure 3[href=https://www.wicell.org#fig3]). Continue excision laterally, taking care not to cut the intestine. Gently cut fascia binding the intestines so that they can be removed intact.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/308-Fig3.jpg\nFigure 3. Mouse Dissection\nOnce the intestines are moved out of the body cavity, cut at the proximal end where duodenum joins the stomach and at the distal end of the ileum.",
    "Place the small intestine on the clean dissection tray. Divide the small intestine to three equal sections by length (Figure 4[href=https://www.wicell.org#fig4]). For example of complete dissection procedure, see Methods Video S3[href=https://www.wicell.org#mmc3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/308-Fig4.jpg\nFigure 4. The Small Intestine Is Spread Out to Three Equal Sections Based on Length\nPlace each section in 5 mL sterile PBS.\nUse tissue homogenizer to fully break the tissue.\nInitially pulse the homogenizer in sterile water for 30 s.\nMove to 100% vol/vol ethanol, and repeat.\nPulse in third container of sterile water, and then homogenize tissue at full power for 60 s.\nNote: Repeat these steps (a, b, and c) after each homogenization.\nTo extract DNA from the homogenate sample.\nTransfer 500 μL of homogenate to 2 mL screw-cap tube with ∼500 μL 0.1 mm zirconia/silica beads (autoclaved).\nAdd 210 μL 20% wt/vol SDS.\nAdd 500 μL phenol:chloroform:isoamyl alcohol (25:24:1).\nBead beat on high speed for 2 min to disrupt tissue and lyse cells.\nCentrifuge 16,000 × g at 4°C for 15 min.\nRemove aqueous phase into new tube.\nAdd 500 μL phenol:chloroform:isoamyl alcohol, mix by inversion for 15 s.\nCentrifuge 16,000 × g at 4°C for 15 min.\nRemove aqueous phase into new tube.\nAdd 600 μL of −20°C isopropanol, 60 μL (1/10 volume) 3 M sodium acetate and mix by inversion.\nPlace in −20°C for 16 h or −80°C for 1 h.\nCentrifuge at 16,000 × g for 30 min at 4°C.\nDecant supernatant.\nAdd 500 μL 100% ethanol.\nDecant supernatant.\nAir dry at 37°C for 8–10 min.\nSuspend pellet in 50 μL water by pipetting.\nFor CFU enumeration of V. cholerae in homogenate:\nAdd 10 μL of intestinal homogenate to 90 μL sterile PBS.\nSerially dilute 10-fold until 10−4 dilution.",
    "Plate 50 μL of the 10−3 and 10−4 dilution on the LB agar containing 200 mg/mL streptomycin.\nIncubate plates at 30°C 16–18 h and count colonies to determine colonization level of V. cholerae (see Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/308-Fig5.jpg\nFigure 5. CFU Enumeration of V. cholerae by Serial Dilution and Plating\nTop, 10−1 dilution; middle, 10−2 dilution; bottom, 10−3 dilution.\n        Your browser does not support HTML5 video.\n      \nMethods Video S3. Procedure for Mouse Tissue Dissection (Steps 19–22 in Step-by-Step Method Details Section)"
  ],
  "subjectAreas": [
    "Model Organisms",
    "Molecular Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}