{
  "id": 6402,
  "origin_website": "Bio",
  "title": "Isolation of Multipotent Mesenchymal Stem Cells from Human Extraocular Muscle Tissue",
  "procedures": [
    "Isolation of extra ocular muscle derived MSCs (EOM-MSCs)Collect excised EOM tissue (approximately 3-8 mm3) from the patient and transfer it to a vial with 3-4 ml of collection media (see Recipes). Use ice packs to maintain the tissue at low temperature during transportation.Note: The following steps are to be performed inside a biosafety level 2 cabinet following aseptic culture techniques.Before processing the tissue sample, coat the isolation dish with fibronectin at a concentration of 20 ng/cm2. To a 35 mm cell culture dish, add 500 μl of fibronection solution (400 ng/ml; see Recipes) and incubate the dish at 37 °C in a CO2 incubator for 1 h. Remove the excess fibronectin and rinse the dish once with 3 ml of 1x PBS (see Recipes). Using sterile forceps, transfer the tissue to an aseptic Petri dish containing 10 ml of PBS with 1x antibiotic (see Recipes). Incubate the tissue at room temperature for 5 min to disinfect and remove excess blood.Carefully transfer the tissue to a sterile 35 mm cell culture dish coated with fibronectin and tear it into small pieces using sterile forceps or if required cut the tissue into small pieces with a sterile scalpel. Add 500 μl of warm fresh MSC growth medium (see Recipes) to the dish and allow the tissue pieces to attach by incubating the dish for 2 h in a CO2 incubator maintaining 5% CO2 and 37 °C. After 2 h, add additional 2 ml of warm MSC growth medium without disturbing the tissue pieces and return the dish to the incubator (Figure 1).Note: Handle the plate gently during this time since the tissue can be dislodged easily by excessive shaking.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214232213_7092.jpgFigure 1. Procedure of processing EOM tissueAfter 48 h, carefully aspirate the medium and replenish with 1.",
    "5-2 ml of fresh MSC growth medium (see Recipes) without disturbing/dislodging the tissue. Note: MSC growth medium has to be replaced every 72 h thereafter.  After 7-10 days, check for attached cells around the explants using an inverted microscope (Figure 2). Ensure that the culture is free of any contamination at this point. Once a sufficient number of attached cells (200-300 cells) are observed around the tissue pieces, gently remove the tissue explants using a fine tipped forceps without scrubbing the tissue over the dish surface (Figure 2).Notes:Since most of the MSCs attach below the explants, care must be taken not to disturb the cells while removing the tissue. Discard the tissue in a bio-hazard waste container. All the liquid waste should be appropriately disposed of after treatment with sodium hypochlorite.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214232229_2125.jpgFigure 2. Microscopic image of isolated EOM-MSCs. A. Phase-contrast image showing the emergence of MSCs from the tissue explant within one week of isolation. White arrows represent the cells that have migrated out of the tissue. B. Phase contrast image of EOM-MSCs at passage 0. Scale bars: 200 μm.Maintenance of cultureOnce the cell colonies reach 50%-80% confluence, sub-culture them as follows.Aspirate the medium (spent medium) and collect it in a sterile 15 ml centrifuge tube. Wash the cells twice with PBS. Add 500 μl of 1x trypsin (see Recipes) to the dish and incubate at 37 °C for 5-7 min.Notes: Keep trypsin at room temperature for 5-10 min after retrieving from 4 °C before use. Monitor the cell detachment intermittently under the microscope. Gentle taps on the side of the dish might be required to dislodge the rounded cells. Do not leave the cells in trypsin for more than 10 min.",
    "Add 1-2 ml of spent medium to neutralize trypsin and transfer the cells to a labeled 15 ml centrifuge tube. Centrifuge at 300 x g for 5 min at 4 °C to obtain the cell pellet. Discard the supernatant and re-suspend the pellet in 1 ml of fresh MSC growth medium. Aliquot a small volume (~50 μl) of cells and add an equal volume of 0.4% trypan blue. Mix properly and count the viable cells using a hemocytometer. Seed cells at 1-2 x 103 cells/cm2 in a tissue culture dish and add 2 ml of fresh MSC growth medium. Incubate the dish in 5% CO2 incubator at 37 °C. Change the MSC growth medium every 72 h until the cells attain 70%-80% confluence. Cells can be passaged up to 10-12 times by repeating the Steps B1-B6. Freezing and thawing of EOM-MSCsAfter Step B5, re-suspend 1 x 106 cells in 0.5 ml of pre-chilled sterile FBS (see Recipes). Transfer the cell suspension to a labeled cryo-vial and add an equal volume of pre-chilled freezing media (see Recipes). Gently mix and transfer the vial immediately to a cryo-cooler.Keep the cryo-cooler in a -80 °C freezer for 24 h before transferring the vial to a cryogenic cell storage container with liquid nitrogen for long-term storage.For reviving the cells, thaw by placing the cryo-vial immediately into a water bath at 37 °C for 45-60 s.Add 0.5 ml of fresh warm MSC growth medium to the vial and transfer the cell suspension to a sterile 15 ml centrifuge tube. Add additional 4 ml of MSC growth medium drop-wise.Centrifuge the cells at 300 x g for 5 min at 4 °C. Re-suspend the cell pellet in 1 ml of fresh MSC growth medium to remove any remaining DMSO.",
    "Count the viable cells as described in Step B5 and seed 2-3 x 105 cells in a 35 mm cell culture dish with 2 ml fresh MSC growth medium. Replace the growth medium after 12 h and maintain the cells according to Step B7 thereafter. Cell surface marker staining and flow cytometryTrypsinize and count the EOM-MSCs as described in Procedure B.Note: Keep the cells on ice during the whole procedure to maintain viability and reduce internalization of surface markers. For each marker to be analyzed, distribute 1 x 105 cells per FACS tube for staining with fluorophore-labeled antibody. For each type of antibody used, keep additional FACS tube to be stained with a non-specific isotype control antibody as control.Centrifuge the cells and wash the pellet twice with 3 ml PBS.Note: All centrifugation steps are to be done at 300 x g for 5 min at 4 °C. Resuspend the cells in 50 μl of FACS buffer (see Recipes). Add 2 μl of diluted antibody (refer to antibody details in Table 1) followed by short gentle vortexing at low RPM. Incubate the tubes at 4 °C for 30 min in the dark. Wash the cells with 1 ml of FACS buffer and re-suspend in 300 μl of propidium iodide staining buffer (see Recipes). Analyze the samples in a flow cytometer using proper gain/amp settings for the channels (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214232251_3083.jpgFigure 3. Cell surface marker expression of EOM-MSCs. A. Plots showing the gating for flow cytometry analysis; live cells were gated (G1) on the basis of propidium iodide (PI) negative (FL3 low) population in FL3 vs. FSC plot followed by gating (G2) in FSC vs. SSC plot to remove the cell debris. Cells in gate (G2) were further analyzed for their fluorescence intensity. B.",
    "EOM-MSCs were stained with fluorescently conjugated antibodies against CD29, CD34, CD44, CD49E, CD73, CD90, CD105 and HLA class I, and the expression was analyzed by flow cytometry. The histogram in red represents the isotype control and blue represents the stained sample. Y-axis represents the number of events/counts and X-axis represents the fluorescence intensity of the mentioned cell surface marker.Osteogenic and adipogenic differentiation Trypsinize and count the EOM-MSCs as described in Procedure B.Seed EOM-MSCs at a density of 5,000 cells/cm2 for osteogenesis and 20,000 cells/cm2 for adipogenesis induction in a 96-well plate with adequate MSC growth medium (see Recipes).After 24 h, add osteogenesis or adipogenesis induction media (see Recipes) to the osteogenic and adipogenic conditions respectively. Replace the induction media every 3-4 days and allow the cells to differentiate for 14-21 days. Alizarin red staining for assessing calcium deposition during osteogenesisAspirate the medium and wash the cells twice with PBS.Fix the cells in 4% formaldehyde solution (see Recipes) for 1 h at room temperature. Wash the cells twice with dH2O.Stain with freshly prepared Alizarin red staining solution (see Recipes) for 10 min at room temperature. Wash cells five times with dH2O followed by a wash with PBS for 15 min to remove excess stain. Add PBS to the cells to prevent them from drying. Proceed to imaging the cells under an inverted microscope with a camera (Figure 4A). Oil red O staining for assessing lipid accumulation during adipogenesisNote: Prepare Oil Red O staining solution (see Recipes) at least 1 h prior to staining. Aspirate the medium and wash the cells twice with PBS.Fix the cells in 4% formaldehyde solution (see Recipes) for 1 h at room temperature. Remove the fixing solution and rinse cells with 60% isopropanol in dH2O. Stain the cells with Oil Red O staining solution for 10 min.",
    "Wash cells five times with dH2O. Add PBS to the cells to prevent them from drying. Proceed to imaging the cells under an inverted microscope with a camera (Figure 4B). Chondrogenic differentiation Trypsinize and count the EOM-MSCs as described in Procedure B.Re-suspend the pellet in an appropriate volume to generate a cell suspension of 1.6 x 107 cells/ml. Add a 5 μl droplet of this cell suspension to the center of each well in a 96-well plate and allow cells to attach by incubating the plate for 2 h in a 5% CO2 incubator at 37 °C.After 2 h, add adequate (100 μl) chondrogenic differentiation media (see Recipes) to the wells without disturbing the cell micromass and return the plate to the incubator.Replace the chondrogenic media every 2 days and allow cells to differentiate for > 14 days.Safranin O staining for detection of cartilage, mucin and mast cell granulesAspirate the medium and wash the cells twice with PBS.Fix the cells with 4% formaldehyde solution (see Recipes) for 1 h at room temperature. Wash the cells twice with dH2O.Stain with 0.1% safranin O solution (see Recipes) for 5 min at room temperature.Wash cells with dH2O. Add PBS to the cells to prevent them from drying. Proceed to imaging the cells under an inverted microscope with a camera (Figure 4C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214232309_4163.jpgFigure 4. Differentiation of EOM-MSCs into osteogenic, adipogenic and chondrogenic cells. EOM-MSCs were seeded in the respective cell density and induction media for differentiation into osteogenic, adipogenic and chondrogenic lineage cells. The differentiated cells were stained with (A) alizarin red, (B) oil red o (C) safranin o for determining osteogenic, adipogenic and chondrogenic differentiation respectively. Scale bars: 100 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}