{
  "id": 13606,
  "origin_website": "Jove",
  "title": "Drug Treatment and In Vivo Imaging of Osteoblast-Osteoclast Interactions in a Medaka Fish Osteoporosis Model",
  "procedures": [
    "All experiments were performed in accordance with approved Institutional Animal Care and Use Committee (IACUC) protocols of the National University of Singapore (R14-293).\n1. Fish Husbandry and the Collection of Embryos\nRaise WT, ctsk:nlGFP24, RANKL:HSE:CFP24, and osx:mCherry21 single- or compound-transgenic medaka fish at 26 °C under a controlled light cycle (14 h light, 10 h dark) to induce spawning.\nDaily spawning takes place during the first 30 min after the light is switched on. The eggs stick together through filaments and attach to the female's abdomen for several hours. Use a fine-meshed net to catch a female adult carrying an egg cluster. Let the fish briefly rest in the net and then gently massage the fish’s abdomen to carefully strip the fertilized egg cluster from the abdomen of the female.\n\tNOTE: A healthy medaka female can produce 10 - 20 eggs each day for approximately 5 months.\nPlace the eggs into a 60 mm plastic Petri dish. Use a plastic pipette to rinse the embryos with 5 - 10 mL of 0.3x Danieau's solution (fish medium; 19.3 mM NaCl, 0.23 mM KCl, 0.13 mM MgSO4, 0.2 mM Ca(NO3)2, and 1.7 mM HEPES, pH 7.0). Add 1 mL of a 0.25% (w/v) methylene blue stock solution to 2.5 L of fish medium to prevent fungal growth.\nGently roll egg cluster to form a knot of attachment filaments. Use forceps to carefully remove the attachment filaments from the fertilized egg clusters to obtain individual embryos (Figure 1A).\nStage the embryos according to Iwamatsu 200413.\nCulture 20 - 30 embryos per 60 mm plastic Petri dish in a 28 °C incubator. Change the medium daily to ensure normal development of the embryos.",
    "NOTE: The time around the hatching stage (8 - 9 d postfertilization, DPF) is especially critical for survival. Remove free-floating chorions to keep the medium clean and to ensure good larval survival rates.\n2. Transgenic Embryo Screening\nUse a stereomicroscope equipped with a mercury lamp for fluorescence imaging and GFP, RFP, and CFP filters to screen transgenic embryos for fluorescent reporter expression using 40X magnification.\nVisually identify osx:mCherry embryos by mCherry reporter expression in the early-forming cranial bones, such as the cleithrum, on both sides of the posterior head (Figure 1B, arrow), and the parasphenoid, at a central position in the ventral cranium (Figure 1B, arrowhead).\n\tNOTE: Reporter expression starts from 5 DPF onwards21.\nIdentify ctsk:nlGFP embryos by strong nlGFP expression in the head (Figure 1C, arrow) and tail (Figure 1C, arrowhead), starting from 6 DPF.\n\tNOTE: Endogenous osteoclasts only form after 21 DPF. nlGFP-expressing cells at this early stage (6 DPF) are not osteoclasts but other, so far uncharacterized, ctsk-positive cells24.\nIdentify RANKL:HSE:CFP transgenic embryos by ubiquitous CFP expression after a short heat shock treatment for 20 min at 39 °C, conducted at 2 DPF or later for screening purposes.\n\tNOTE: The RANKL and CFP transgenes are under the control of the same bidirectional Heat Shock Element (HSE). CFP expression indicates successful RANKL induction24.\nPerform a 1.5 - 2 h heat shock treatment at 9 DPF or later to induce large numbers of ectopic osteoclasts in the trunk region, which consequently results in an osteoporosis-like phenotype24.",
    "NOTE: Transgenic RANKL expression induced at 9 DPF results in an ectopic activation of dormant osteoclast progenitor cells, which endogenously is not triggered before 21 DPF. Use a water bath to obtain stable 39 °C conditions. Let the Petri dish containing medaka embryos float on the water surface. Make sure the lid of the petri dish is dry to prevent the sinking of the dish.\nScreen embryos from compound lines, such as RANKL:HSE:CFP/ctsk:nlGFP double-transgenic and osx:mCherry/RANKL:HSE:CFP/ctsk:nlGFP triple-transgenic, according to the expression pattern of each individual transgene.\n\tNOTE: Hemizygous and homozygous transgenic embryos were distinguished by different fluorescence levels of the reporter transgene. Homozygous embryos had a fluorescence intensity that was approximately doubled compared to that of hemizygous transgenics. Compound lines that were homozygous for both RANKL:HSE:CFP and ctsk:nlGFP were obtained by repeated incrossing over several generations. For triple-transgenic osx:mCherry/RANKL:HSE:CFP/ctsk:nlGFP fish, homozygous RANKL:HSE:CFP/ctsk:nlGFP fish were crossed with homozygous osx:mCherry carriers. The resulting heterozygous triple-transgenic progeny were raised and incrossed to obtain embryos homozygous for RANKL:HSE:CFP. The RANKL:HSE:CFP transgene must be homozygous in order to obtain the efficient induction of ectopic osteoclasts.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55025/55025fig1.jpg\nFigure 1: WT and Transgenic Medaka Embryos at 7 D Postfertilization (DPF). A. WT embryos observed with brightfield illumination. B. Transgenic embryos showing osx:mCherry expression around the cleithrum (arrow) and parasphenoid (arrowhead). C. Transgenic embryos showing ctsk:nlGFP expression in the head (arrow) and tail (arrowhead). Scale bars: 500 µm. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55025/55025fig1large.jpg]\n3. Bisphosphonate Treatment of Medaka Larvae\nPrepare solutions containing different concentrations of bisphosphonates (BPs) for dose-response studies.\n\tNOTE: The exemplary BP used in this protocol is alendronate.\n\t\nDissolve alendronate in fish medium at a concentration of 100 µg/mL to prepare a stock solution.\nUse a vortex mixer to ensure complete dissolution. Store the stock solution at 4 °C.",
    "Prepare different working solutions by diluting the stock solution with fish medium to a series of concentrations (i.e., 25, 37.5, 50, 62.5, and 75 µg/mL).\n\t\tNOTE: Different drugs may have different Absorption, Distribution, Metabolism, and Excretion (ADME) parameters, which must be considered during testing using this medaka larvae system. Also, drug solubility and stability may vary when applied as an aqueous solution. Less water-soluble compounds might need to first be dissolved in organic solvents, such as DMSO. In this case, a stock solution is prepared in DMSO, which is then further diluted in fish medium. Note that the working solutions in water (fish medium) can be stored in the refrigerator for several wk. However, solutions containing DMSO must be stored at RT to prevent crystallization.\nTransfer medaka larvae into six-well plates (six larvae/well) for subsequent BP (alendronate) treatment.\nRemove the fish medium carefully using a clean plastic pipette and add a small volume (approx. 0.5 mL) of alendronate solution to each well.\nAvoid leftover fish medium, as the added BP solution might be diluted, which is especially critical for less-concentrated alendronate solutions.\nRemove a small volume of alendronate solution (up to 0.5 mL) from each well with a clean plastic pipette and replace it with a larger volume (4 mL) of alendronate solution.\nChange medium daily to ensure normal embryos development.\n4. Live Staining of Mineralized-bone Matrix\nDissolve 0.5 g of Alizarin complexone (ALC; alizarin-3-methyliminodiacetic acid) or 0.05 g of calcein in 50 mL of fish medium to prepare 1% and 0.1% stock solutions, respectively. Use a vortex mixer to ensure complete dissolution.\n\tNOTE: Fish medium without the addition of methylene blue is used in this and the subsequent steps to reduce autofluorescence in the larvae.",
    "Use a syringe and single-use filter (0.2 µm) to filter the staining solution. Store the filtered solution in the dark at RT.\n\tNOTE: The color of the filtered, clear ALC staining solution is dark yellow to orange. The color of the filtered, clear calcein solution is bright yellow. Solutions can be used for several months.\nDilute the filtered ALC or calcein stock solution 1:10 in fish medium and incubate the medaka larvae for 1.5 - 2 h (0.1% ALC solution) or 2 - 2.5 h (0.01% calcein solution) in a 28 °C incubator if larvae between 9 and 17 DPF are used. Keep the samples in the dark.\nTransfer the larvae to fresh fish medium using a clean plastic pipette.\nRemove the fish medium with a clean plastic pipette and add fresh fish medium. Repeat this step for 3 - 4 times until no red- or yellow-stained solution (ALC or calcein, respectively) is left over. Leave the larvae in fish medium for 30 - 60 min before mounting them for imaging to avoid epifluorescence from the medium.\n\tNOTE: 0.1% ALC staining solution is harmful to medaka larvae for extended exposure times. Incubation times of longer than 2 h affect the survival of the larvae. Concentration and staining time therefore need to be optimized for different stages in order to achieve optimal embryo survival and staining results.\n5. Live Fluorescence Imaging\nAnesthetize the medaka larvae with 0.01% Tricaine (ethyl 3-aminobenzoate methanesulfonate) in fish medium.\n\tNOTE: Anesthetized larvae become immobilized after 5 - 10 min in Tricaine solution and usually are lying either on their sides or their backs.\nUse a plastic microloader to orientate the larvae according to the region of interest. The orientation of the larvae used in this protocol is lateral.",
    "Use a stereomicroscope with fluorescence illumination for imaging. Use high magnification when taking images, focusing on different parts of the larvae (head, anterior trunk, posterior trunk, and tail). Stitch individual images together at overlapping regions using a suitable image-processing software (insets in Figure 3G).\n\tNOTE: This helps to improve the image quality of all relevant body parts in the correct focal plane.\nReturn the larvae to the fish medium for recovery after imaging.\n6. Live Confocal Imaging\nAnesthetize the larvae with 0.01% Tricaine in fish medium for 5 - 10 min until they become immobilized.\nDissolve low-melting agarose to 1.5% in fish medium by heating it in a microwave oven. Cool this solution to approximately 30 °C.\nAdd 0.5 - 1 mL of liquid 1.5% low-melting agarose in fish medium to a glass-bottomed Petri dish. Transfer the anesthetized larvae into the solution using a clean plastic pipette.\n\tNOTE: Take special precaution that the temperature of the liquid low-melting agarose is low enough to not harm the larvae.\nBefore the agarose solidifies, use a plastic microloader to push the larvae to the bottom of the Petri dish and orientate the larvae according to the region of interest. The orientation of the larvae used in this protocol is lateral.\n\tNOTE: The samples are ready for confocal live imaging after the agarose completely solidifies.\nUse a confocal microscope to acquire images.\nUse a 543 nm laser line for mCherry and ALC staining analyses. Use a 488 nm laser line for nlGFP and calcein staining analyses.\nAfter imaging, add fish medium to the Petri dish and use a pair of fine syringe needles (27 G x 1½\") to carefully remove the larvae from the agarose. Transfer the larvae with residually attached agarose to a Petri dish with fish medium to recover.",
    "Process the images using an image analysis software27.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}