{
  "id": 9208,
  "origin_website": "Jove",
  "title": "Electroretinogram Analysis of the Visual Response in Zebrafish Larvae",
  "procedures": [
    "Animal upkeep and experimental protocols were approved by the Institutional Animal Care and Use Committees of the University of North Carolina at Chapel Hill, and meet all requirements of the NIH Office of Laboratory Animal Welfare and the Association for Assessment and Accreditation of Laboratory Animal Care International.\nNOTE: To obtain larvae for ERG analysis, published protocols for standard zebrafish husbandry and maintenance were employed18. Larvae are obtained through natural breeding and housed under a 14 hr light/10 hr dark cycle. This protocol has been optimized for larvae at 5-7 days post-fertilization (dpf), but could ideally be performed on older fish with small modifications to the procedure. Here, use the TL strain of wild-type zebrafish larvae at 5 dpf.\n1. Micropipette Production\nPull several micropipettes using 1.5 x 0.86 mm (outer diameter by inner diameter) fire-polished borosilicate glass capillaries with filament (melting temperature, 821 °C) and a P-97 Flaming/Brown Micropipette Puller fitted with box heat filament. Use the program for fashioning micropipettes described in Table 1.\nCheck each micropipette under a microscope with an appropriate graticule ruler to ensure that tips are 10-15 µm in diameter and has a smooth tip opening (i.e., no jagged edges).\nCarefully store micropipettes to prevent tip damage and exposure to dust. Storage options include Petri dishes with lab tape, foam-lined boxes, or commercially available micropipette storage containers.\n\tNOTE: Other micropipette pullers and glass capillaries can be used as long as the correct diameter of the micropipette and a high-quality tip is achieved.\ntable:\n﻿0,1,2,3,4\nPressure,Heat,Pull,Velocity,Time\n500,560,-,30,200\n500,450,-,30,200\n500,410,55,40,200\nTable 1: Program for the production of micropipettes using a P-97 Flaming/brown Micropipette Puller fitted with a box heat filament. Micropipettes are made using 1.5 x 1.0 mm2 (outer diameter by inner diameter) fire-polished borosilicate glass capillaries with filament (melting temperature, 821 °C).\n2. Buffer Preparation",
    "Use filtered, oxygenated goldfish Ringer's buffer19 in the microelectrode capillary and to saturate the polyvinyl alcohol (PVA) sponge onto which the larvae are placed for experiments. Alternatively, use E3 embryo media or Hank's Balanced Salt Solution.\nPrepare 10x goldfish Ringer's solution as described in Table 2. Adjust to pH 7.8, and sterilize using a 0.22 µm filter and store the 10x stock at 4 °C.\nCreate a working solution on the day of the experiment by diluting the 10x Ringer's solution to 1x with deionized, distilled water. Filter using a 0.22 µm filter system. Oxygenate by bubbling with 95% O2/5% CO2 gas for 10 minutes. Cap tightly afterwards to ensure that the solution remains oxygenated.\ntable:\n﻿0,1\nNaCl,1.25 M\nKCl,26 mM\nCaCl2,25 mM\nMgCl2,10 mM\nglucose,100 mM\nHEPES,100 mM\nTable 2: Preparation of 10x goldfish Ringer’s solution.\n3. Electroretinogram Platform\nPerform ERG experiments on an anti-vibration table inside a Faraday cage to improve the signal to noise ratio. Attach a custom steel platform to the anti-vibration table using hex nuts. Place a movable plastic platform with a viscoelastic urethane polymer shock-absorbing bottom on the table under the light source.\nPosition the camera with a magnetized stand, aimed down at the movable plastic platform. Position the micromanipulator (which will hold the recording microelectrode) with a second magnetized stand to the right of the movable plastic platform. Ensure that the camera and micromanipulator will not be disturbed by the movement of other equipment and that they do not block illumination from the light source.\nConnect the camera to a video monitor and position it to view the eye of the larva for placing the electrode in the proper position.",
    "Ensure that the setup is properly grounded with copper wire. To check the noise, place the reference electrode and tip of the recording microelectrode in a 35 mm Petri dish filled with Ringer's solution. Check the electrical noise levels of the setup with an oscilloscope or a built-in feature of the ERG apparatus. Noise levels should be no more than ±10 µV from baseline.\n4. Sponge Preparation\nCut a small rectangle of dry PVA sponge that will fit snugly in a 35 mm Petri dish. The thickness of the sponge should not be greater than the depth of the dish. Use a utility knife with a clean razor blade for cutting.\nMake an additional cut into the sponge to accommodate the reference electrode (either a shallow cut lengthwise on the bottom of the sponge or a butterfly cut vertically through one of the smaller ends).\nUse a chemically resistant marker to mark a small dot on the sponge (where the larva will be placed) that can be used for positioning the camera.\nSoak the PVA sponge in Ringer's solution until saturated. Remove and blot quickly on a paper towel 2-3 times. Place the sponge in a clean 35 mm Petri dish.\nPosition the Petri dish containing the sponge on the plastic platform such that the mark can be visualized by the camera.\n5. Electrode Preparation\nNOTE: The zebrafish setup consists of a reference electrode in contact with the Ringer's solution-saturated PVA sponge and a recording electrode in contact with the cornea. The reference electrode consists of an Ag/AgCl pellet. The recording electrode is a pulled glass micropipette filled with Ringer's solution and held by a microelectrode holder containing an Ag wire.",
    "Chloride the electrodes by soaking them in 6-9% sodium hypochlorite (bleach) for 5 min (the recording microelectrode wire) or 15 min (the reference electrode). Air dry on a Kimwipe for 5 min.\n\t\nDepending on the style of cut made in Step 4.2, place the Ag/AgCl pellet of the reference electrode into (for the vertical butterfly cut) or under (for the shallow cut lengthwise on the bottom) the sponge. Attach the reference electrode lead to the recording system.\nAlternatively, if the ERG setup has space constraints or there are particularly strong photovoltaic artifacts from the Ag/AgCl electrode, connect the reference electrode to the sponge via an agar salt bridge to move the electrode out of the light path.\nAttach ~40 cm of appropriately sized tubing to a 5 ml non-Luer lock syringe. Fill the syringe with Ringer's solution. Microelectrode holders possessing pressure ports typically ship with adaptors to accommodate tubing with inner diameters of 1/16”, 3/32”, 1/8” or 5/32”.\nFill a 1 ml non-Luer lock syringe with Ringer's solution and, using a Micro-fil, carefully fill the microelectrode holder. Prevent the formation of bubbles.\nAttach the 5 ml syringe to the pressure port of the microelectrode holder with tubing and use it to ensure that the microelectrode holder is full of Ringer's solution. Using the Micro-fil and 1-ml syringe filled with Ringer's solution, fill the micropipette glass from the tip and ensure that no bubbles are present.",
    "Attach the glass micropipette to the microelectrode holder, being careful to keep the electrode wire straight. Once secured, use the 5 ml syringe to carefully force Ringer's solution through the microelectrode until a tiny amount of solution is visible on the tip. Occasional application of pressure to the syringe (when not applied to cornea) will prevent formation of air bubbles, as well as occlusions due to dust or salt accumulation, in the micropipette tip.\n\t\nIf the solution comes out as a stream, replace the glass micropipette, as the tip opening is too large or is damaged.\nCarefully place the recording microelectrode in the micromanipulator and attach the lead to the recording system.\n6. Electroretinogram Analysis\nNOTE: Due to the cone dominance of the larval retina, high quality ERG results can be obtained when preparations for recording are performed under low levels of indirect white light (<1 lux) or with short periods (<1 min) of higher intensity (≤250 lux) working light. A short period of dark adaptation is still required prior to recording (see step 6.7). However, experiments can be performed under dim red or infrared light using an infrared-sensitive camera. All experiments were performed in filter-sterilized (0.22 µm) system water from the UNC Zebrafish AquaCulture Facility but alternative embryo media can be used.\nCut paper towel squares measuring approximately 1 cm2.\nIf measuring isolated cone mass receptor potential, incubate 3-5 larvae in system water with 500 µM (±)-2-Amino-4-phosphonobutyric acid (APB) for 5 min.\n\tNOTE: While APB is a racemic mixture of the active (L) and inactive (R) forms of AP4, it is as effective as L-AP4 and is less expensive.\nAnesthetize 3-5 larvae in system water with 0.02% (w/v) Tricaine until unresponsive, about 1-2 min.",
    "Use a Pasteur pipette and pipette pump to carefully transfer individual larvae onto paper towel squares under a dissecting stereoscope using minimal illumination (≤250 lux for <1 min). Check the position of each larva and choose a candidate that is dorsal side up with an unoccluded eye.\n\t\nFor extended recordings (>30 min), keep the larva moist by glazing the body up to but not including the head with 3% methylcellulose using a fine camel-hair brush.\nUsing forceps, transfer the paper towel square with the larva to the damp PVA sponge.\n\t\nFor extended recordings (>30 min), apply a continuous stream of water-saturated 100% O2 gas over the larva by bubbling the gas through an airstone in a side-arm flask containing distilled water. Position the tubing exiting the flask side-arm that conveys the humidified oxygen near the larva's head.\n\t\tNOTE: Step 6.4.1 and step 6.5.1 will prolong the life of the fish16.\nUnder minimal illumination, use the micromanipulator and camera to position the microelectrode tip at the midpoint between the nasal and caudal ends of the eye and gently press onto the dorsal limit of the cornea.\n\tNOTE: Misplacement of the electrode tip to the far distal areas of the cornea can result in ERG waveforms of reversed polarity.\nAllow larva to dark-adapt for 5-10 min.\nRecord test flash responses to light provided from an LED light source or optical stimulator using the available stimulation and recording equipment. Adjust protocol parameters such as flash intensity, flash length, flash color, background intensity and color and filter settings to fit the experiment.\nWhen finished with the experiment, euthanize larvae according to AVMA/IACUC guidelines.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}