{
  "id": 9023,
  "origin_website": "Jove",
  "title": "An Alternative and Validated Injection Method for Accessing the Subretinal Space via a Transcleral Posterior Approach",
  "procedures": [
    "Animals: Wild type C57Bl/6J mice bred at the University of California at Los Angeles (UCLA). All animals were between 11 - 17 weeks old, and included male and female mice. All mice were group-housed, maintained in a 12:12 light/dark cycle with food and water ad libitum. All experiments were performed in accordance with the institutional guidelines of UCLA and the Association for Research in Vision and Ophthalmology Statement for the Use of Animals in Ophthalmic and Vision Research.\nNOTE: All drugs and injectable agents are United States Pharmacopeia (USP) grade.\n1. Surgical Preparation\nAnesthetize the mouse with an intraperitoneal injection of 100 mg/kg ketamine and 8 mg/kg xylazine in a saline mix. Administer anesthesia to a depth such that the mouse has no toe pinch or corneal touch reflexes.\nMaintain body temperature at 37.0 °C with a circulating water pad.\nDilate pupils with 2.5% phenylephrine eye drops and trim whiskers to facilitate visualization. Whiskers provide significant sensory input to the mouse, therefore, whisker trimming should remove only the portion that blocks clear access to the eye, and not to the base of the whisker. In our experience, mice show normal recovery after this procedure. Apply methylcellulose eye drops to prevent dryness and minimize anesthetic induced transient cataracts13.\nSterilize instruments prior to surgery (i.e., betadine and ethanol or hot beads).\nPrepare diluted fluorescein (0.01% using 0.9% saline) in a sterile environment (i.e., biosafety cabinet) if visualization will be performed (see section 3 below).\n2. Injection Site Preparation\nPrepare a syringe (e.g., 5 µl syringe) with the appropriate injection volume (e.g., 0.3 to 1.0 µl).\nPosition the mouse so the eye is facing up and clearly visible in the dissecting microscope.\nGently pinch the temporal conjunctiva with fine tipped forceps. Make a circumferential incision of approximately 90 degrees using curved Vannas scissors.",
    "Repeat step 2.3 with the underlying Tenon's capsule.\nResect the surrounding connective tissue with fine tipped forceps while rotating the globe nasally. Work towards the injection site approximately 0.5 mm temporal to the optic nerve. Use great care to avoid disrupting the retro-orbital sinus.\n3. Sclerotomy and Subretinal Injection\nNOTE: It is recommended that the injection of 0.01% fluorescein in 0.9% Saline be used to assist with visualization while learning this procedure. The topographic distribution of fluorescein can be effectively documented with fundus imaging (see section 4 below).\nMake a small scleral incision at the injection site by gently scratching the eyecup with a 22.5-degree ophthalmic blade. This incision should only be large enough to allow the tip of the needle to pass through the sclera.\nInsert the beveled 33 G needle (angled 5 - 10° into the sclerotomy with the bevel facing and angled parallel to the retina. Inject desired volume (e.g., 0.3 to 1.0 µl of 0.01% Fluorescein for learning purposes).\n\tNOTE: Maintain sterility of the syringe by thoroughly cleaning with successive washes of a suitable solvent and DI water before each injection.\nDepress the plunger slowly (over ~ 3 sec) without moving the needle and with even pressure.\n\tNOTE: When the needle is in the subretinal space, a slight resistance will be felt while depressing the plunger. There will be no to minimal resistance if the needle punctures the retina, and high resistance if the needle does not penetrate the sclera or RPE.\nWait several seconds before withdrawing the needle to minimize backflow.\nRinse the eye with sterile buffered saline and ensure the eye has rotated back to its normal position.\n4. Assessment of Retinal Detachment by OCT and Fundus Imaging",
    "Perform OCT imaging immediately after injection to evaluate the quality of the injection and at appropriate time points post-injection as needed to evaluate retinal structure.\n\tNOTE: Examples of the use of OCT in similar studies has been previously described7,14.\n\t\nAdjust and align the OCT image to target the site of injection. The injection site should be midline and 0.5 mm temporal to the optic nerve head. Repeat as needed if the detachment is out of frame or not optimally centered.\nVisualize retinal detachment and dye injection area with en-face fundus imaging7,14.\n\tNOTE: If an OCT imaging system is not available, injection of a small amount of fluorescein with a vector for practice will allow visualization with any fundus camera that performs fluorescein angiography using the same excitation wavelengths and blocking filters. Localized areas of hyper-fluorescence will appear underneath the vasculature and the vasculature will have sharp and distinct boundaries if the subretinal space is targeted correctly. The edge of the bleb from the injection will be demarcated by the transition from hyper- to hypo- fluorescence. Several instruments provide this capability for the mouse; the instrumentation used here is described elsewhere14.\n5. Post-operative Care\nApply a thick coat of triple antibiotic ophthalmic cream to the corneal surface of the injected eye.\nPlace mice in clean solitary cages for recovery. Do not combine mice that have undergone surgery until they are fully recovered.\nMonitor respiration and temperature during anesthesia recovery. Monitor animals until they can maintain sternal recumbency.\nPerform additional appropriate post-operative monitoring and treatment, including a sub-cutaneous injection of carprofen (5 mg/kg) for post-surgical pain management.\n6. Assessment of Retinal Function by Electroretinography (ERG)",
    "Perform ERG analysis pre-injection and at appropriate times post-injection as needed to evaluate retinal function. If the injection was made into the subretinal space, the retinal detachment should resolve within 72 hr.\n\t\nUse standard ERG techniques to evaluate retinal function before and after injection as previously described14,15.\n7. 3D Reconstruction and Bleb Volume Quantification\nNOTE: OCT scans with high contrast encompassing the entire detachment within the frame of view are optimal for use. ImageJ/Fiji17,18 and Imaris were used, but other software can be used.\nExport the b-scan of interest, import to ImageJ/Fiji and crop (Image > Crop) the portion of the OCT scan to be modeled using the rectangular selection tool.\n\t\nAdjust contrast (Image > Adjust > Brightness/Contrast) and delineate any missing boundaries by connecting two sections with a line.\nDraw a straight line with the line tool (holding shift) that spans the RPE to the photoreceptor layer. Measure (Analyze > Measure) the length of the line to obtain size of maximum detachment for step 7.8.\nImport cropped frames to the 3D-reconstruction software (See Table of Materials) using the \"RGB to Gray\" plugin and MATLAB Compiler Runtime.\nSet the voxel size (under Image Properties) using the calibration parameters from the OCT scan (x,y,z).\nExecute the \"RGB to Gray\" plugin (under Image Properties), with equal weighting to each channel, to create a fourth channel. Delete original Red-Green-Blue channels.\nInvert the gray channel using contrast change. Store Image.\nClick the \"add a new surface\" button in the 3D-View tab, and begin the guided 4 step process of creating the surface.\n\t\nSet the surface level detail (step 1 of 4).\n\t\tNOTE: In our experience 8.0 to 12.0 was the most effective range.",
    "Set the maximum sphere size (under Background Selection) to slightly less than the maximum detachment size measured in 7.1.2. Create the surface and undo gray channel inversion (step 2 of 4).\nSet the threshold to the maximum value so the surface of the negative spaces outside of the retina and the detachment do not come in contact (step 3 of 4).\nSet the filter type to the number of voxels and isolate the negative space in the detachment site by size. Finish the surface (step 4 of 4).\n\t\tNOTE: The volume of the detachment surface is located under volume in the statistics tab.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}