{
  "id": 5944,
  "origin_website": "Bio",
  "title": "Determination of Boron Content Using a Simple and Rapid Miniaturized Curcumin Assay",
  "procedures": [
    "Harvest the yeast/protoplasts samples in a 50 ml Falcon tube by centrifugation at 4,000 x g (for yeast)/100 x g (for protoplast) for 5 min. Wash the pellet with 25 ml ice cold water to remove boric acid from the pellet. Resuspend the pellet in 400 µl of Milli-Q water in a 1.5 ml tube. Heat the samples at 90 °C for 30 min and vortex to release intracellular B into solution. Centrifuge at maximum speed for 2 min at room temperature and collect 300 µl of supernatant for B quantification.  For detailed boron uptake assay in yeast, users may refer to Takano et al., 2002 ; and to process the protoplasts from plant tissue please refer to Yoo et al., 2007.  Note: We recommend that users test the assay with their own buffers/solvents if they do not use water to solubilise their samples.   Prepare standards containing 0, 0.02, 0.05, 0.10, 0.19, 0.39, 0.77 mg boric acid/L using Milli-Q water in a 15 ml Falcon tube (refer to Table 1).  Table1. Boric acid standards presented in different units imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116003817_7153.jpg    Aliquot 300 µl (which is equivalent to 0.1, 0.2, 0.5, 0.9, 1.9, 3.7 nmole B) of each standard and samples into 1.5 ml tubes.   Acidify the samples and standards by adding 100 µl of 0.1 N HCl. Mix well by vortex and incubate for 5 min at room temperature. Note: From Step 3 onwards perform all the reactions in chemical fume hood.   Add 70 µl extraction solution (see Recipes), mix vigorously by vortexing for 30 sec. After 2 min, repeat the vortex for another 30 sec.   Centrifuge the samples at 15,000 x g speed for 5 min to facilitate clear separation of organic phase.    Pipette 50 µl of lower organic phase (Figure 1A) into a new 1.",
    "5 ml tube containing 200 µl of acid mix (see Recipes) and mix well by vortexing. Notes:    Be aware that the lower phase contains chloroform and that chloroform leaks out from plastic pipette tips. To avoid pipetting errors, make sure that the tip is tightly attached to pipette and transfer liquids quickly.    The mixture of sulphuric acid and acetic acid is a viscous solution. Therefore, care must be taken while pipetting to avoid pipetting errors and hazards to users from corrosive solutions. We recommend cutting the tip of the 1 ml tip and pipette slowly in a fume hood.    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116002707_5685.jpg Figure 1. Steps showing phase separation and colour development in the absence (-B) or presence (+B) of boron    Add 250 µl of curcumin solution (see Recipes) and shake well until it forms homogenous dark purple colour (Figure 1B).    Centrifuge the tubes at 15,000 x g for 1 min and incubate the reaction mixture at room temperature for 1 h.   After 1 h, stop the reaction by adding 500 µl of Milli-Q water and mix well by inverting the tubes.   Centrifuge the tubes at 15,000 x g for 1 min to facilitate clear phase separation.   Carefully pipette 200 µl of upper phase (Figure 1C) into a 96-well UV Microplate and measure the absorbance at 550 nm using a microplate reader. Note: Chloroform in the reaction mixture melts many types of plastic microplates and interferes in absorbance reading. Therefore, it is very important to use microplates resistant to organic solvents (for example, Thermo ScientificTM 96-Well UV Microplate or a quartz microplate).   Plot the absorbance against the quantity of B and prepare the calibration curve as shown in Figure 2.",
    "To obtain calibration curve, plot the absorbance values (A550 nm) against the quantity of boron (nmole B) using a spreadsheet (left panel of Figure 2). Note: Jennings et al., 2007 have used both curcumin method and ICP-MS to quantify boron in yeast cells. They found that using the two methods the results were indistinguishable.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116002900_2826.jpg Figure 2. Calibration curve for the determination of boron concentration. Absorbance measured at 550 nm (A550 nm).    Use the obtained calibration curve to determine the quantity of B in unknown samples."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}