{
  "id": 2541,
  "origin_website": "Cell",
  "title": "Native protein purification of ferroxidase LPR1 from leaf extracts of a transgenic Arabidopsis thaliana line",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol aims to purify overexpressed AtLPR1 in a native form from frozen leaf material. The purification process includes protein extraction, size exclusion and cation exchange chromatography to obtain pure and active LPR1 protein for further biochemical analysis.\nProtein extraction\nTiming: 1 h\nProtein extraction from plant material is dependent on homogenization degree of the frozen plant material with the extraction buffer.\nTo extract whole leave proteins, vortex 15 g frozen plant material in a 50 mL Falcon tube with 40 mL pre-cooled extraction buffer for a minimum of 1 min, followed by incubation on ice for 5 min.\nVortex suspension again for 1 min and incubate at 4°C for a minimum of 30 min on a rotating wheel (20 rpm) or shaker (800 rpm). Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nCentrifuge at 500 × g for 30 min at 4°C.\nDiscard the pellet (cell fragments) and filter supernatant through a nylon mesh (100 μm mesh size) to remove residual plant fragments. Take 40 μL of the supernatant as sample for Western blot analysis, this sample refers to “crude extract (E)”.\nCritical: The extraction process is crucial, therefore effective vortexing increases protein yield.\nProtein concentration by differential ammonium sulfate precipitation\nTiming: 3–5 h\nAmmonium sulfate precipitation is one of the most commonly used first steps for classical protein purification. Pre-fractionation is used to enrich LPR1 from whole plant extract based on its chemical properties. Hereafter, work at 4°C on ice and store protein preparations on ice when transported.\n40 mL of supernatant are subjected to a beaker glass with magnetic stirrer.\nSlowly add 10.56 g (NH4)2SO4 to the supernatant while moderately stirring (aliquots of ca. 2 g will be helpful). Make sure ammonium sulfate is dissolved before adding the next aliquot. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].",
    "After dissolving the ammonium sulfate, stir the solution for one hour at 4°C on ice.\nCentrifuge (4,500 × g) for 45 min at 4°C (precooled).\nTransfer supernatant to a fresh beaker glass with magnetic stirrer and solubilize greenish (40% pellet, Figure 1[href=https://www.wicell.org#fig1]F) protein pellet in extraction buffer to take 40 μL sample for Western blot analysis, this sample refers to “pellet 1 (P1)”. Discard the rest of the pellet and continue working with the supernatant from the precipitation reaction before.\nSlowly add another 10.56 g (NH4)2SO4 to the supernatant while moderately stirring (aliquots of ca. 2 g will be helpful). Make sure ammonium sulfate is dissolved before adding the next aliquot. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nAfter dissolving the ammonium sulfate, stir the solution for one hour at 4°C on ice.\nCentrifuge (4,500 × g) for 45 min at 4°C (precooled).\nDiscard supernatant (take 40 μL for Western blot analysis, this sample refers to “80% supernatant”), solubilize pellet in 2 mL extraction buffer (Figure 1[href=https://www.wicell.org#fig1]G) and take 5 μL for Western blot analysis, this sample refers to “pellet 2 (P2)”.\nPause point: The solubilized protein pellet obtained can be stored at −80°C for 1 week.\nSize exclusion chromatography and cation exchange chromatography\nTiming: 7 h\nTo desalt, enrich and concentrate LPR1, size exclusion chromatography followed by cation exchange chromatography is performed, which yields pure LPR1 protein with high ferroxidase activity. Before you start, make sure that all buffers and solution used are filtered and degassed.\nThaw protein pellet on ice and centrifuge (>15,000 × g) for 20 min at 4°C to clear precipitates.\nAttach a HighLoad Superdex 200 gel filtration column (HL 16/60, GE Healthcare) to an FPLC-system.",
    "Use a 5 mL loop for online sample application. Before loading, wash the loop with 5 mL water followed by 5 mL NaOH (1 M) followed by 5 mL water and 10 mL Buffer A.\nEquilibrate the column with 2 column volumes of Buffer A at 1 mL/min flow rate or according to the column manufacturer’s instructions before sample application at 0.5 mL/min flow rate.\nElute proteins at a flow rate of 0.5 mL/min with 1.5 column volumes Buffer A.\nStart sampling 1 mL fractions after 20% of the column volume.\nAfter completion, combine fractions corresponding to the “F3” in Figure 2[href=https://www.wicell.org#fig2]A (in our system fraction E4-F4) and dilute with 10–20 mL Na2HPO4-NaH2PO4 (0.02 M, pH 7) to a final volume of 25–30 mL. Take 40 μL sample for Western blot analysis, this sample refers to “size exclusion (SE)”. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2046-Fig2.jpg\nFigure 2. Purification of AtLPR1\n(A) A representative size-exclusion chromatogram for 50%–80% ammonium sulfate pellet from a Superdex 200 HL 16/60 column using a flow rate of 1 mL/min. UV absorbance at 260 nm and 280 nm are shown as solid and dotted line respectively. The insert shows a representative silver stained SDS-PAGE run of the F3 elution peak fractions (marked with red box).\n(B) A representative cation-exchange chromatogram for LPR1. Increasing buffer-C concentration (0%–100%) are indicated as linear straight line. Note, LPR1 elutes in the shoulder (marked with red box) of the main peak at 350 mM NaCl.\n(C) A representative Western blot and Coomassie stained membrane. 40 μL sample loaded per lane. E: Extraction; P1: 40% ammonium sulfate pellet; P2: 40% ammonium sulfate pellet; SE: combined size exclusion fractions; C1-C4: cation exchange elution fractions 1–4.\nAttach a carboxymethyl-sepharose column (HiTrap CM FF, 1-mL, GE Healthcare) to the FLPC-system and equilibrate it with 10 mL Buffer B.",
    "Load the sample at 0.5 mL/min and continue to run Buffer B at 1 mL/min through the system until the baseline returns to zero.\nWash the column with 10 mL of Buffer B at 1 mL/min flow rate.\nElute the bound proteins with Buffer B and increasing concentrations of Buffer C up to 100% Buffer C at 1 mL/min flow rate and collect 1 mL fractions. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nAnalyze the fractions by SDS-PAGE and use the desired fractions.\nCritical: Size exclusion chromatography and cation exchange chromatography must be performed on the same day. Longer storage of the combined fractions after size exclusion chromatography results in complete loss of LPR1 protein.\nOptional: To identify protein samples that contain LPR1, you should use either Western blot analysis followed by Coomassie-staining or silver-staining to visualize protein abundance.\nPause point: The protein fractions can be stored at −20°C for 2 weeks.\nTracking LPR1 purification by immune blot analysis\nTiming: 6–7 h\nPurification success of LPR1 is validated by SDS-PAGE and Western blot analysis.\nThaw the frozen samples collected at the different purification steps.\nAdd 10 μL 5× SDS loading buffer to 40 μL sample and incubate for 5 min at 95°C.\nRun the samples on an SDS-PAGE gel. We use self-casted 10% polyacrylamide gels in the BioRAD-system.\nAssemble the chamber with the gel according to the manufacturer’s instructions and fill up the chamber with SDS Running Buffer.\nLoad 45 μL of each sample in each well of the gel including the protein ladder (5 μL pre-stained 1 kb protein ladder; Thermo Fisher).\nRun the gel at 85 volts (constant) for 15 min.\nRun the gel at 130 volts (constant) for another 45 min.",
    "Transfer the protein bands from the gel to a PVDF (Amersham Hybond 0.45 PVDF) blotting membrane. We use a PowerBlotter system (Thermo Scientific).\nBlock the membrane with 5% (w/v) dry milk in TBST for 1 h at 22°C–25°C or 12 h at 4°C.\nIncubate with primary epitope-specific anti-LPR1 polyclonal antibody (1:1,000 in TBST with 3% dry milk) for 1 h at 22°C–25°C or 12 h at 4°C.\nWash the membrane 3 × 10 min with TBST.\nIncubate the membrane with a suitable horseradish peroxidase (HRP)-conjugated secondary antibody (1:5,000 in TBST with 3% dry milk) for 1 h at 22°C–25°C or 12 h at 4°C.\nWash the membrane 5 × 10 min with TBST.\nFor detection, add ECL Select Western Blotting Detection Reagent (Life Technologies) to the membrane following the manufacturer’s protocol (https://www.thermofisher.com/order/catalog/product/32109[href=https://www.thermofisher.com/order/catalog/product/32109]).\nAnalyze chemiluminescence with X-ray films (incubation time 2–10 min).\nStain PVDF membrane with Coomassie for 5 min (we use PageBlue protein-stain from Thermo Fisher Scientific).\nFerroxidase activity assay\nTiming: 15–30 min\nThe assay used to determine protein activity is an end-point determination as the substrate and 3-(2-pyridyl)-5,6-bis(2-[5-furylsulfonic acid])-1,2,4-triazine (ferrozine) as a specific Fe2+-chelator to scavenge the remaining substrate after the reactions. The rate of Fe2+ oxidation can be calculated from the decreased absorbance at 560 nm using a molar extinction coefficient of ε560=25,400 M-1 cm-1 for the Fe2+-ferrozine complex.\nUse a 96 flat-bottom multi-well plate and add 14 μL ferrozine solution to 5 wells per reaction tube.\nPrepare 1.5 mL tubes with 1,191 μL acetate-buffer, prepare at least 3 technical replicates per sample.\nAdd 1 μg total protein to the tube. LPR1 protein purification normally yields 2–3 mL protein solution with a LPR1 concentration from 0,02–0,08 μg/μL. The final assay volume will be between 1287.5 μL and 1,325 μL in total. Troubleshooting 6[href=https://www.wicell.org#troubleshooting].",
    "Reaction starts with addition of 84 μL substrate-solution to the tube, invert 2 times, take 200 μL from the reaction and add it to the first well with ferrozine solution (time point “0”).\nPlace the tube in an incubator at 25°C until time point 1 (e.g., 2 min).\nReaction amount serves for six different time point elucidations. We normally take samples at the start of the reaction (e.g., 0 min) and further 2, 5, 7, 10 and 15 min after substrate addition (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2046-Fig3.jpg\nFigure 3. Ferrozine assays in 96-well plate format\nDisplayed 12 of 96 wells of 96-well plate.\nMeasure absorbance of each well at 560 nm in a microplate reader.\nDisplay decreasing absorbance at 560 nm in a linear regression curve and calculate ΔE =     Δ A  t    based on the following formular:   y =    Δ A  t  x + n  .\nTo calculate the specific enzyme activity based on the Lambert-Beer law, make sure to know the diameter of the well plate or cuvette used to measure absorbance (“d”).\n  E = c∗d∗ϵ  Δ C =   |  Δ E  |  d∗ϵ   d = 0, 52  cm  ϵ = 0, 0254    L  μ m o l ∗ c m      \n  Δc =   | ΔE |   0,52  c m ∗ 0,0254  L  μ m o l ∗ c m     ∗  1  m i n   =    | ΔE |    1  m i n     0,52  c m ∗ 0,0254  L  μ m o l ∗ c m     =    | ΔE |    0,013208     μ m o l   L ∗ m i n    \n  Δn = Δc∗V =    | ΔE |    0,013208   μmol  L ∗ m i n   ∗  (  1191 + 84 + V  ( p r o t e i n )  )   ∗  10  − 6",
    "A  s p e c   =   Δ n    m  P r o t e i n   60    \nE: Extinction.\nc: concentration (Fe2+).\nd: diameter of the cuvette/well used.\nε: extinction coefficient.\nn: amount of substance.\nV: (reaction) volume.\nAspec: specific enzyme activity."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Plant Sciences",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}