{
  "id": 11019,
  "origin_website": "Jove",
  "title": "Manufacturing Of Robust Natural Fiber Preforms Utilizing Bacterial Cellulose as Binder",
  "procedures": [
    "1. Preparation of Bacterial Cellulose-sisal Fiber Suspension\nDetermine the wet-to-dry mass of BC by measuring the wet mass of BC, followed by vacuum drying of wet BC at 80 °C overnight (O/N). Once dried, measure the dry mass of BC.\nMeasure the amount of wet BC pellicle equivalent to 18 g of dry BC from the pre-determined wet-to-dry mass of BC.\nCut the wet BC pellicles into small pieces of ~1-2 cm using a pair of sharp scissors. After cutting, soak the BC pellicles in 1 L of water to allow for the hydration of cut pellicles.\nFeed the cut BC pellicle into a blender and add an appropriate amount of water into the blender such that the blending process will go smoothly.\nBlend these BC pellicles for 2 min.\nPour the blended BC into a 15 L container and add water until the total water volume is 14 L, making up a BC concentration in water of 0.1 (g/ml)% (percentage mass of bacterial cellulose per unit volume of water). The BC pellicles might need to be fed into the blender in batches for blending.\nCut 72 g of loose sisal fibers (or any source of short natural fibers) into 1-2 cm long fibers and add them into the BC suspension. Gently stir the suspension to ensure a homogenous dispersion of sisal fibers in the BC suspension.\nSoak the sisal fibers in this suspension O/N.\n2. Manufacturing of Sisal Fiber Preform\nOpen sheet mold and close the drainage valve.\nFill the system with DI water until the water level reaches the backing wire.\nPlace a 100 mesh metal forming wire on the backing wire, centered within the sheet mold base.\nClose and latch the sheet mold. Add additional fresh water until the forming wire is submerged in water.",
    "Pour the prepared sisal fiber-BC suspension into the sheet mold. Gently stirring the suspension to ensure that the sisal fibers are homogenously distributed throughout the mold.\nOpen the drain valve to drain the water, which will result in the formation of a wet filter cake of sisal fibers and BC on the forming wire. Immediately after the water drains, open the sheet mold and remove the forming wire.\nPlace the forming wire on a piece of blotting paper. Additional blotting papers are placed on the top of the filter cake, followed by a metal plate.\nFlip the filter cake around. With the forming wire now facing the top, remove the forming wire and place additional blotting paper directly on top of the filter cake, followed by a metal plate.\nPlace a 10 kg weight on top of the metal plate to press the water out. When the blotting paper is fully soaked, replace the blotting papers with fresh blotting papers and press the filter cake again using a weight of 10 kg.\nReplace the blotting papers 1 final time and perform a final pressing of 1 ton in a hot press to consolidate the fiber preform.\nHeat the hot press up to 120 °C to aid the evaporation of residual water. This should take approximately 4 hr. Reduce the temperature of the hot press to room temperature (RT) and allow the preform to cool down prior to removal from the hot press.\n3. Scanning Electron Microscopy (SEM) of the BC-sisal Fiber Preform\nCut a 2 × 2 cm2 BC-sisal fiber preform.\nStick this cut preform onto SEM stub using carbon tabs.\nCoat the sample in a Cr sputter coater operating at 75 mA for 1 min.",
    "Image the BC-sisal fiber preform with field emission gun SEM in in-lens mode using a beam energy of 5 kV.\n\tNote: Do not try to image the sisal-fiber preform without gluing the preform onto the SEM stub using conductive adhesive. The loose fibers will be sucked away during the evacuation of the SEM chamber and damage the electron gun.\n4. Composite Manufacturing using Vacuum Assisted Resin Infusion (VARI)\nPlace the preform on top of the tooling side, which consists of a non-porous PTFE coated glass release fabric.\nCover the preform with a porous PTFE coated glass release fabric, also known as a peel ply, followed by a porous flow medium. Both the peel ply and the flow medium should be larger that the preform (see Figure 2 for a process schematic).\nPosition the omega tubes at the intended resin inlet and outlet of the VARI set up. Ensure that the omega tubes are placed on top of the porous flow medium to allow the resin to distribute into the VARI set up during infusion. The length of omega tubes should be as wide as the flow medium.\nPlace pressure sensitive tapes around the periphery of the set up.\n\t\nEnsure that the paper backing of the pressure sensitive tapes is still left on the tapes at this point.\nInsert the resin feed and outlet tubes into the openings of the omega tubes and cover the set up with a fluoroethylene polymer based bagging film and seal it using pressure sensitive tapes.\nSeal the resin feed tube. Position the other end of the resin outlet tube on top of the breather cloth.",
    "Place a metal plate on top of the inner bag where the fiber preform is, followed by a piece of breather cloth. The metal plate should be the size of the preform.\nIdentify the position where the through bag vacuum valve should be and place the bottom piece of the valve on top of the breather cloth.\nPlace the vacuum sealant tape around the internal bag and place a vacuum bagging film on top of it and seal it. The excess vacuum bagging film will form pleats.\nPlace the sealant tape inside the pleat to complete the seal.\nCut a small 'x' on the vacuum bagging film where the bottom piece of the valve is and screw in the top piece to complete the through bag vacuum valve. It is important to avoid wrinkling of the vacuum bagging film under the top piece as this could cause a leak path.\nConnect the quick connect fitting and pull a vacuum. During this process, the vacuum bagging film can be moved around and place where excess is needed. Check for vacuum leaks.\nPrepare the resin by mixing the epoxy and hardener at a weight ratio of 100 to 19. Degas the resin at a reduced pressure to remove all the air bubbles trapped during the mixing of the epoxy resin and hardener.\nOnce the VARI set up is determined to be leakage-free, feed the resin via the tubing connected to the omega tube.\nEnsure that the resin is fed slowly such that it has time to impregnate into the fiber preform. Allow the resin to flow out from the resin outlet tube and soak into the breather cloth until no air bubbles can be observed coming out from the outlet tube.",
    "Seal the outlet tube and allow the resin to cure for 24 hr at RT, followed by a post-curing step at 50 °C for 16 hr.\n\tNote: (1) The curing cycle is resin dependent. (2) It is very important that maximum vacuum is achieved within the VARI set up and there is no vacuum leak within set up. A poor VARI set up (not achieving maximum vacuum or a leak) will result in pores within the manufactured composites and significantly reduced fiber volume fraction within the composites. (3) The epoxy-to-hardener ratio is resin dependent. Please check the product datasheet of the resin for the epoxy-to-hardener ratio prior to mixing."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}