{
  "id": 5567,
  "origin_website": "Bio",
  "title": "A Method to Convert mRNA into a Guide RNA (gRNA) Library without Requiring Previous Bioinformatics Knowledge of the Organism",
  "procedures": [
    "Total RNA preparationLyse 108 cells with 10 ml of TRIzol by repetitive pipetting. Incubate for 5 min at room temperature.Add 2 ml of chloroform. Shake by hand for 15 sec. Incubate for 2-3 min at room temperature. Centrifuge at 12,000 x g for 15 min at 4 °C.Transfer the aqueous phase to a fresh tube. Add 5 ml of isopropyl alcohol and mix well. Centrifuge at 12,000 x g for 10 min at 4 °C.Remove the supernatant. Wash the pellet once with 80% ethanol. Air dry the pellet for 5-10 min.Dissolve RNA in 1 ml of RNase-free water by pipetting, then incubate the sample for 10 min at 55-60 °C.PolyA RNA preparation (see Note 1)Use the Oligotex mRNA Midi Kit. Heat the Oligotex suspension to 37 °C. Heat buffer OEB to 70 °C on a heating block. Mix buffer OBB well.Pipet 500 µg of total RNA into an RNase-free 1.5-ml microcentrifuge tube and adjust the volume with RNase-free water to 1 ml. Add 500 µl of buffer OBB and 30 µl of the Oligotex suspension.Incubate for 3 min at 70 °C. Remove from heat.Incubate for 10 min at room temperature.Centrifuge for 2 min at 15,871 x g. Remove supernatant by pipetting.Add 250 µl of RNase-free water and 250 µl of buffer OBB. Mix the contents thoroughly by pipetting.Incubate for 3 min at 70 °C. Remove from heat.Incubate for 10 min at room temperature.Centrifuge for 2 min at 15,871 x g. Remove supernatant by pipetting. Resuspend the pellet in 400 µl of buffer OW2. Pipet the mixture onto a small spin column placed in a 1.5-ml tube. Centrifuge for 1 min at 15,871 x g.Transfer the spin column to a new RNase-free 1.5-ml tube. Apply 400 µl of buffer OW2. Pipet onto a small spin column placed in a 1.",
    "5-ml tube. Centrifuge for 1 min at 15,871 x g.Transfer the spin column to a new RNase-free 1.5-ml tube. Pipet 25 µl of hot (70 °C) buffer OEB onto the column. Pipet up and down 3-4 times to resuspend the resin. Centrifuge for 1 min at 15,871 x g.Pipet another 25 µl of hot (70 °C) buffer OEB onto the column. Pipet up and down 3-4 times to resuspend the resin. Centrifuge for 1 min at 15,871 x g.Linker preparationCombine the following reagents in a 1.5-ml microcentrifuge tube: 10 µl of 100 µM linker forward oligo, 10 µl of 100 µM linker reverse oligo, and 2.2 µl of 10x T4 DNA ligase buffer (New England Biolabs). Place the tubes in a glass beaker containing 2 L of boiled water and incubate the tubes until the water cools down to room temperature naturally. Dilute the annealed oligos with 77.8 µl of TE buffer (pH 8.0) and use as 10 µM linkers.First-strand cDNA synthesisCombine the following reagents in a 0.2 ml PCR tube: 200 ng of poly(A) RNA (from step A2), 0.6 µl of 25 µM semi-random primers, and RNase-free water in a 4.75 µl volume. Incubate the tube at 72 °C in a hot-lid thermal cycler for 3 min, cool on ice for 2 min, and further incubate at 25 °C for 10 min. Increase the temperature to 42 °C and add a 5.25 µl mixture of the following reagents: 0.5 µl of 25 µM 5’ SMART tag, 2 µl of 5x SMART Scribe buffer, 0.25 µl of 100 mM DTT, 1 µl of 10 mM dNTP mix, 0.5 µl of RNaseOUT (Invitrogen), and 1 µl SMART Scribe reverse transcriptase (100 U) (Clontech).",
    "Incubate the first-strand cDNA reaction mixture at 42 °C for 90 min and then at 68 °C for 10 min. To degrade RNA, add 1 µl of RNase H (Invitrogen) to the mixture and incubate the mixture at 37 °C for 20 min.Double-stranded (ds) cDNA synthesis by primer extensionMix 11 µl of the prepared first-strand poly(A) cDNA (from step C4) with 74 µl of MilliQ water, 10 µl of 10x Advantage 2 PCR buffer, 2 µl of 10 mM dNTP mix, 1 µl of 25 µM 5’ SMART PCR primer, and 2 µl of 50x Advantage 2 polymerase mix (Clontech). Incubate a 100 µl volume of the reaction mixture for primer extension at 95 °C for 1 min, 68 °C for 20 min, and then 70 °C for 10 min. Purify the prepared ds cDNA using a QIAquick PCR Purification Kit (QIAGEN) and elute the DNA with 40 µl of TE buffer (pH 8.0).3’ linker I ligationMix ds poly(A) cDNA (from step D3) with 0.5 µl of 10 µM 3’ linker I and 1 µl of Quick T4 DNA ligase (New England Biolabs; NEB) in 1x Quick ligation buffer. Incubate the ligation reaction mixture at room temperature for 15 min, then purify it using a QIAquick PCR Purification Kit and elute it with 80 µl of TE buffer.EcoP15I digestionDigest the 3’ linker I-ligated DNA (from step E2) with 1 µl EcoP15I (10 U/µl, NEB) in 1x NEBuffer 3.1 containing 1x ATP in a 100 µl volume at 37 °C overnight. Purify the EcoP15I-digested DNA using a QIAquick PCR Purification Kit and elute the DNA with 40 µl of TE buffer.5’ linker I ligation and BglII digestionMix the digested DNA (from step F2) with 0.",
    "5 µl of 10 µM 5’ linker I and 1 µl of Quick T4 DNA ligase (NEB) in 1x Quick ligation buffer. Incubate the ligation reaction mixture at room temperature for 15 min, purify it using a QIAquick PCR Purification Kit, and elute it with 80 µl of TE buffer. Digest the DNA with 1 µl of BglII (10 U/µl, NEB) (see Note 2) in 1x NEBuffer 3.1 in a 100 µl volume at 37 °C for 3 h. Purify the EcoP15I/BglII-digested DNA using a QIAquick PCR Purification Kit and elute the DNA with 50 µl of TE buffer.First PCR optimization (see Note 3)To determine the optimal number of PCR cycles, prepare a 0.2 ml PCR tube containing 5 µl of the ds cDNA ligated with 5’ linker I/3’ linker I (from step G4), 0.5 µl of 25 µM 5’ linker I forward primer, 0.5 µl of 25 µM 3’ linker I PCR primer, 5 µl of 1x Advantage 2 PCR buffer, 1 µl of 10 mM dNTP mix, 1 µl of 50x Advantage 2 polymerase mix, and MilliQ water in a 50 µl volume. Perform PCR with the following cycling parameters: 6 cycles of 98 °C for 10 sec and 68 °C for 10 sec. After the 6 cycles, transfer 5 μl of the reaction to a clean microcentrifuge tube. Perform PCR with the rest of the PCR reaction mixture for 3 additional cycles of 98 °C for 10 sec and 68 °C for 10 sec. After these additional 3 cycles, transfer 5 μl to a clean microcentrifuge tube. In the same way, repeat additional PCR until reaching 30 total cycles.",
    "Thus, prepare a series of PCR reactions of 6, 9, 12, 15, 18, 21, 24, 27, and 30 cycles and analyze by 20% polyacrylamide gel electrophoresis to compare the band patterns (Figure 2; PCR optimization 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170512/20170512232059_9741.jpgFigure 2. The first PCR cycle optimization and size fractionation (Arakawa, 2016). PCR products were run on 20% polyacrylamide gels. A 10-bp ladder was used as the size marker. Bands of the expected sizes are marked by triangles. (see Note 4)Determine the optimal number of PCR cycles as the minimal number of PCR cycles yielding the greatest quantity of the 84-bp product (typically around 17 cycles). Repeat two 50-µl PCR reactions with the optimal number of PCR cycles. Purify the PCR product using a QIAquick PCR Purification Kit and elute with 50 µl of TE buffer.AcuI/XbaI digestionDigest the PCR product (from step H8) with 2 µl of AcuI (5 U/µl, NEB) and 2 µl of XbaI (20 U/µl, NEB) (see Note 2) in 1x CutSmart buffer containing 40 µM S-adenosylmethionine (SAM) in a 60 µl volume at 37 °C overnight.The crush and soak procedureRun the AcuI/XbaI-digested DNA (from step I1) on a 20% polyacrylamide gel (Figure 2; size fractionation 1). Cut the 45-bp fragment out of the gel and transfer it to a microfuge tube. Crush the gel slice against the wall of the microfuge tube with the disposable pipette tip. Add 1-2 volumes of TE to the gel slice. Incubate the tube at room temperature overnight on a rotating wheel. Centrifuge the sample at 21,130 x g for 1 min at 4 °C. Transfer the supernatant to a fresh microfuge tube, being careful to avoid transferring fragments of polyacrylamide. Add 0.5 volumes of TE to the polyacrylamide pellet. Vortex the tube briefly.",
    "Centrifuge the sample at 21,130 x g for 1 min at 4 °C. Combine the two supernatants and then centrifuge at 21,130 x g for 1 min at 4 °C. Transfer the supernatant to the new microcentrifuge tube in order to remove the small PAGE debris.Mix the sample with 0.1 volume of 3 M sodium acetate and 1/400 volume of 20 µg/µl of glycogen. Add 2.5 volumes of cold ethanol to the sample and mix briefly. Store the solution on ice for 30 min. Centrifuge the sample at 21,130 x g for 20 min at 4 °C.Discard the supernatant. Rinse the pellet once with 70% ethanol.Dissolve the pellet into 20 µl of TE buffer.3’ linker II ligationMix the digested DNA (from step J9) with 2 µl of 10 µM 3’ linker II and 1 µl of Quick T4 DNA ligase (NEB) in 1x Quick ligation buffer.Incubate the ligation reaction mixture at room temperature for 15 min, purify it using a QIAquick PCR Purification Kit, and elute it with 100 µl of TE buffer.Second PCR optimization (see Note 3)To determine the optimal number of PCR cycles, prepare a 0.2-ml PCR tube containing 5 µl of the ds cDNA ligated with 5’ linker I/3’ linker II (from step K2), 0.5 µl of 25 µM 5’ linker I forward primer, 0.5 µl of 25 µM 3’ linker II PCR primer, 5 µl of 1x Advantage 2 PCR buffer, 1 µl of 10 mM dNTP mix, 1 µl of 50x Advantage 2 polymerase mix, and MilliQ water in a 50 µl volume.Perform PCR with the following cycling parameters: 6 cycles of 98 °C for 10 sec and 68 °C for 10 sec. After the 6 cycles, transfer 5 μl of the reaction to a clean microcentrifuge tube.",
    "Perform PCR with the rest of the PCR reaction mixture for an additional 3 cycles of 98 °C for 10 sec and 68 °C for 10 sec. After these additional 3 cycles, transfer 5 μl of the reaction to a clean microcentrifuge tube. In the same way, repeat additional PCR cycles until 18 total cycles are reached. Thus, prepare a series of PCR reactions of 6, 9, 12, 15, and 18 cycles and analyze by 20% polyacrylamide gel electrophoresis to compare the band patterns (Figure 3; PCR optimization 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170512/20170512232558_5635.jpgFigure 3. The second PCR cycle optimization and size fractionation (Arakawa, 2016). PCR products were run on 20% polyacrylamide gels. A 10-bp ladder was used as the size marker. Bands of the expected sizes are marked by triangles. (see Notes 4 and 5)Determine the optimal number of PCR cycles as the minimal number of PCR cycles yielding the greatest quantity of the 72-bp product (typically around 9 cycles). Repeat five PCR reactions, each containing 50 µl, with the optimal number of PCR cycles. Purify the PCR product using a QIAquick PCR Purification Kit and elute it with 100 µl of TE buffer.BsmBI/AatII digestionDigest the PCR product (from step L9) with 10 µl of BsmBI (10 U/µl, NEB) in 1x NEBuffer 3.1 in a 100 µl volume at 55 °C for 6 h, and then add 5 µl of AatII (20 U/µl, NEB) (see Note 2) to the solution; leave the solution at 37 °C overnight. Run the BsmBI/AatII digested DNA on a 20% polyacrylamide gel. Typically, 3 bands, corresponding to 25, 24, and 23 bp, are visible (Figure 2; size fractionation 2).",
    "Cut the 25-bp fragment out of the gel to purify by the crush and soak procedure as described in step K, and dissolve the fragment into 50 µl of TE buffer. Measure the concentration of the purified DNA by a Qubit dsDNA HS Assay Kit (Thermo Fisher Scientific).CloningDigest the lenti CRISPR ver. 2 (lentiCRISPR v2) (Sanjana et al., 2014) (Addgene) with BsmBI, treat with calf intestine phosphatase, extract with phenol/chloroform, and purify by ethanol precipitation. Mix 5 ng of the purified 25-bp guide sequence fragment (from step M5) with 3 µg of lentiCRISPR v2 and 1 µl of Quick T4 DNA ligase (NEB) in 1x Quick ligation buffer in a 40 µl volume. Incubate the ligation reaction mixture at room temperature for 15 min and then purify by ethanol precipitation. Electroporate the prepared gRNA library into STBL4 electro-competent cells (Invitrogen) using the following electroporator conditions: 1,200 V, 25 µF, and 200 Ω.Deep sequencingTo amplify the guide sequences, prepare a 0.2-ml PCR tube containing 1 µl of 100 ng/µl of lentiviral plasmid library (from step N4), 0.5 µl of 25 µM lentiCRISPR forward primer, 0.5 µl of 25 µM lentiCRISPR reverse primer, 5 µl of 1x Advantage 2 PCR buffer, 1 µl of 10 mM dNTP mix, 1 µl of 50x Advantage 2 polymerase mix, and MilliQ water in a 50 µl volume.Perform PCR with the following cycling parameters: 15 cycles of 98 °C for 10 sec and 68 °C for 10 sec. Purify the 100-bp PCR fragment containing the guide sequence from the 2% agarose gel using a QIAquick Gel Extraction Kit (QIAGEN). Prepare the deep sequencing library using a TruSeq Nano DNA Library Preparation Kit (Illumina).Deep sequence using Miseq (Illumina) (see Note 6)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}