{
  "id": 10697,
  "origin_website": "Jove",
  "title": "Preparation and Characterization of Novel HDL-mimicking Nanoparticles for Nerve Growth Factor Encapsulation",
  "procedures": [
    "NOTE: The animal studies included in all procedures have been approved by the Institutional Animal Care and Use Committee at the University of North Texas Health Science Center.\n1. Preparation of NGF HDL-mimicking Nanoparticles\nDissolve the excipients, phosphatidylcholine (PC), sphingomyelin (SM), phosphatidylserine (PS), cholesteryl oleate (CO), and D-α-tocopheryl polyethylene glycol succinate (TPGS), in ethanol to prepare stock solutions at 1 mg/mL.\n\tNOTE: The stock solutions were aliquoted and stored at -20 °C. The cholesteryl oleate was stored in dark bottles. The PC, SM, PS, and CO stock solutions were stable for up to 6, 3, 12, and 12 months, respectively, at -20 °C. The TPGS solution was stable for at least 12 months at -20 °C.\nMix 10 µL of NGF (1 mg/mL in water) with 10 µL of protamine USP (1 mg/mL in water) in a 1.5 mL microcentrifuge tube and let it stand for 10 min at room temperature to form the complex.\n\tNOTE: The NGF and protamine stock solutions were aliquoted and stored at -20 °C. Repeated freezing and thawing is not recommended for the NGF stock.\nAdd 59 µL of PC, 11 µL of SM, 4 µL of PS, 15 µL of CO, and 45 µL of TPGS to a glass vial. Mix and evaporate the ethanol under a gentle nitrogen stream for about 5 min; all excipients should form an oily, thin film at the bottom of the glass vial.\nAdd 1 mL of ultrapure (type 1) water to the vial and homogenize at 9,500 rpm (8,600 x g) for 5 min at room temperature to form the prototype NPs.\nAdd the complex prepared in step 1.2 to the prototype NPs and incubate at 37 °C for 30 min with stirring by using a small stirring bar in the glass vial.",
    "Cool the NPs down by stirring at room temperature for another 30 min. After this cools, add 106 µL of Apo A-I (1.49 mg/mL) and stir at room temperature overnight to form the final NGF HDL-mimicking NPs.\n2. Characterization of NGF HDL-mimicking Nanoparticles\nMeasure the particle size and zeta potential using a particle analyzer (see the Materials Table) as per the manufacturer's instructions.\nUse a cross-linked agarose gel filtration chromatography column to separate the unloaded NGF from the NGF HDL-mimicking NPs and determine the entrapment efficiency of the NGF.\n\t\nFor the column preparation, transfer 15 mL of Sepharose 4B-CL suspension to a 50-mL beaker. Stir the bead suspension using a glass rod and pour some into a column (30 cm length × 1 cm diameter, with a glass frit at the bottom). Gently tap the column to get rid of bubbles. Allow the solvent to drain and the beads to settle for a few min.\nContinue to add the remaining suspension. Rinse the inside wall of column to clean the beads. Drain the solvent until the solvent level is slightly above the top of the stationary phase. Wash and condition the column with 20 mL of 1x phosphate-buffered saline (PBS, containing 137 mM NaCl, 2.7 mM KCl, 8 mM Na2HPO4, and 2 mM KH2PO4).\nTo determine the fractions containing unloaded NGF, load 200 µL of NGF solution (10 µg/mL) onto the gel filtration column (25 cm length x 1 cm diameter) and elute with 1x PBS.\nCollect a total of 12 fractions (1 mL for each fraction) and measure the concentration of NGF in each fraction using a Sandwich ELISA kit for NGF.",
    "Detect NGF from fractions 6 to 10 using the Sandwich ELISA kit. Obtain a chromatogram of unloaded NGF on the column. Wash the column with 20 mL of PBS.\nTo determine the fractions containing NGF HDL-mimicking NPs, load 200 µL of the NPs onto the column and elute with 1x PBS. Collect a total of 12 fractions (1 mL for each fraction) and measure the intensity of particles in each fraction using the particle size analyzer. Detect the NGF NPs from fractions 2 to 4.\n\t\tNOTE: The intensity is a parameter measured by the particle analyzer, which tells how many nanoparticles may exist in the test solution. The more NPs exist in solution, the higher the intensity is. By this approach, we can confirm that the column can separate NGF NPs from unloaded NGF.\nTo measure the entrapment efficiency of NGF, load 200 µL of NGF HDL-mimicking NPs onto the column and elute with 1x PBS. Collect a total of 12 fractions (1 mL for each fraction).\nMeasure the unloaded NGF concentration from fractions 6 to 10 using the Sandwich ELISA kit.\nAdd the NGF amounts measured from fractions 6 to 10 together as the unloaded NGF and calculate the entrapment efficiency of NGF using the following equation.\n\t\t%EE = (1 - unloaded NGF/total NGF added into NP) x 100% Equation (1)\n3. In Vitro Release of NGF HDL-mimicking Nanoparticles\nStudy free NGF (10 µg/mL in water; n = 4) and NGF HDL-mimicking NPs (10 µg/mL; n = 4) in parallel.\nPre-treat 8 dialysis tubes (molecular weight cutoff: 300 kDa) by following the manufacturer's instructions.",
    "Prepare 5% bovine serum albumin (BSA) in PBS as the release medium. Add 30 mL of release medium to a 50-mL centrifuge tube and warm it up to 37 °C in a shaker with a 135 rpm shaking speed. Place another 50 mL of release medium in the shaker for replacement.\nAdd 400 µL of release medium into the dialysis tube and quickly add 200 µL of the tested sample to make enough volume for dialysis.\nClose the tube and quickly put the dialysis tube into the release medium (the centrifuge tube). Quickly withdraw 100 µL of the release medium from the outside dialysis tube as the sample for time 0. Immediately put the sample into -20 °C for later analysis. Add 100 µL of fresh release medium into the centrifuge tube to replace the withdrawn sample. Start the timer.\nAt 1, 2, 4, 6, 8, 24, 48, and 72 h, withdraw 100 µL of the release medium and replace it with 100 µL of fresh medium. Immediately put the withdrawn samples into -20 °C for later analysis.\nAfter 72 h, take out all samples from -20 °C and thaw them at room temperature. Measure the NGF concentrations of the release samples using the Sandwich ELISA kit.\n4. Bioactivity of NGF HDL-mimicking Nanoparticles (Neurite Outgrowth Study)\nCulture PC12 cells in RPMI-1640 medium supplemented with 10% heat-inactivated horse serum, 5% fetal bovine serum, 100 µg/mL streptomycin, and 100 units/mL penicillin. Maintain the cells in a humidified incubator at 37 °C and with 5% CO2.",
    "When the cells reach ~70-80% confluence, remove the culture medium and wash the cells with 1x PBS (approximately 2 mL per 10 cm2 culture surface area). Remove the wash solution. Trypsinize the cells by adding 0.25% Trypsin-EDTA solution (0.25% trypsin and 1 mM EDTA; 0.5 mL per 10 cm2 culture surface area) to the flask and incubate at 37 °C until most cells are detached.\nAdd two volumes of culture medium and spin down at 180 x g for 5 min. Remove the supernatant and resuspend the cell pellet in 5 mL of culture medium. Filter the cells through a 22 G, ½ inch needle to break cell clusters.\nSplit the cells at a ratio of 1:3 into a new cell culture flask. After incubating overnight, remove unattached PC12 cells. Allow the attached cells to remain for further growth.\nRepeat this procedure for 3 passages to select the subculture of PC12 that has a strong adhesion property. Pre-coat a 6-well plate with 800 µL/well of rat tail collagen type I (100 µg/mL).\nTrypsinize the selected PC12 cells as described in step 4.2 and filter them through a 22 G, ½ inch needle to break the cell clusters. Count the cells with a hemocytometer. Seed the cells overnight at a density of 10,000 cells/well in the pre-coated 6-well plate in step 4.5 to allow the cells to attach to the plate.\nDilute free NGF (10 µg/mL) and NGF HDL-mimicking NPs (10 µg/mL) with the culture medium (described in step 4.1) to prepare 0.5, 1, 5, 10, 50, and 100 ng/mL concentrations. Remove 2 mL of medium from each well and replace with 2 mL of the diluted free NGF or NGF HDL-mimicking NPs. Culture for 4 days.",
    "On day 4, change the medium to fresh medium (described in step 4.1) containing the corresponding treatment and continue the treatment for another 3 days.\nOn day 7, visualize the cells with an inverted light microscope and image each well at random spots under 10X magnification.\n5. Biodistribution of NGF HDL-mimicking Nanoparticles\nUse adult BALB/c mice (male, 25-30 g) to test the tissue distribution of NGF NPs. Randomly divide the mice into three groups of 3 mice per group. Use a cone-shaped plastic restraint (e.g., decapicone) to restrain a mouse and wipe the tail with ethanol to promote vasodilation and the visibility of the vein.\nInject 100 µL of either saline, free NGF, or NGF HDL-mimicking NPs to each group of mice (3 groups) through the tail veins at a dose of 40 µg/kg of NGF. Use a 30½ G needle attached to a 1 mL syringe.\nAt 30 min after the injection, anesthetize the mice using 3% inhaled isoflurane (in oxygen at flow rate of 2 L/min). Perform a tail and toe pinch to determine the depth of anesthesia. Collect blood by cardiac puncture.\nWithdraw approximately 1 mL of blood from the heart. Euthanize each mouse by cervical dislocation.\nPlace the mouse carcass in dorsal recumbency. Open the abdomen using surgical scissors and move fat and intestine aside using a cotton swab to expose the liver, spleen, and kidney. Harvest these tissues and rinse them in 1x PBS to clean the blood.\nImmediately centrifuge the blood samples at 3,400 x g and 4 °C for 5 min to obtain the plasma. Store the plasma and tissues at -80 °C until the analyses.",
    "To analyze the tissue samples, move the samples from -80 °C to 4 °C and suspend 100 mg of tissue sample in a 10x volume of extraction buffer (0.05 M sodium acetate, 1.0 M sodium chloride, 1% triton X-100, 1% BSA, 0.2 mM phenylmethanesulfonyl fluoride, and 0.2 mM benzethonium chloride). Homogenize at 10,000 rpm and 4 °C for 5 min.\nSacrifice two untreated mice to collect blank plasma and tissues, as described in steps 5.3 and 5.4. Prepare NGF standard solutions using blank plasma or blank tissue homogenates.\nDetermine the concentrations of NGF in the plasma and tissue homogenates using the Sandwich ELISA kit, as described above.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}