{
  "id": 19880,
  "origin_website": "Wiley",
  "title": "Generating Single Cell–Derived Knockout Clones in Mammalian Cells with CRISPR/Cas9",
  "procedures": [
    "In order to clone in gRNA sequences in later steps of the protocol (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0004]), it is necessary to first purify sufficient quantities of the gRNA plasmid backbone (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-tbl-0001]). These plasmid backbones can be obtained from Addgene.\nTable 1.\n                CRISPR Plasmids\ntable:\n﻿Plasmid(s),Addgene no.,Purpose\nOne-plasmid knockout systems,,\nLenti-Cas9-gRNA-GFP,124770.0,\"Coexpress Cas9, a gRNA, and GFP\"\nLenti-Cas9-gRNA-TagBFP2,124774.0,\"Coexpress Cas9, a gRNA, and TagBFP2\"\nTwo-plasmid knockout systems,,\nLentiV_Cas9_puro,108100.0,Expresses Cas9 with puromycin resistance\nLRG2.1,108098.0,Expresses a gRNA with GFP\nLRCherry2.1,108099.0,Expresses a gRNA with mCherry\nLenti_sgRNA_EFS_BFP,120577.0,Expresses a gRNA with eBFP\nLRG2.1-mOrange,124772.0,Expresses a gRNA with mOrange\nLRG2.1-CyOFP1,124771.0,Expresses a gRNA with CyOFP1\nLRG2.1-TagBFP2,124773.0,Expresses a gRNA with TagBFP2\nMaterials\nPlasmid(s) of interest (Addgene)\nAppropriate Escherichia coli strain\nLB + 100 µg/ml ampicillin medium\n50% (v/v) glycerol\nGeneJET Plasmid Maxiprep Kit (Thermo Fisher Scientific; cat. no. K0491)\nNanoDrop spectrophotometer or equivalent\n1.5-ml freezing tubes\n1.5-ml microcentrifuge tubes\n1. Obtain the desired plasmid(s) from Addgene.\n2. After receiving the stab culture of E. coli, inoculate the bacteria in 2 ml of LB + 100 µg/ml ampicillin medium overnight at 37°C.\n3. The next day, prepare glycerol stocks by resuspending 500 µl of the bacterial culture in 500 µl of 50% glycerol and store at in 1.5-ml freezing tubes −80°C. Additionally, transfer 1 ml of the overnight culture into 250 ml of LB + 100 µg/ml ampicillin medium and allow to grow for an additional 12-18 hr at 37°C.\n4. Isolate the plasmids from the E. coli stock using the GeneJET Plasmid Maxiprep Kit according to the manufacturer's instructions. Quantify the DNA concentration and purity using a NanoDrop spectrophotometer and store aliquots of the plasmid-bearing stock in 1.5-ml microcentrifuge tubes at −20°C for later use.",
    "The repetitive sequences in the lentiviral CRISPR plasmids may be unstable when the plasmids are propagated in E. coli. We therefore recommend transforming the cloned plasmids constructed in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0004] into the recombination-deficient Stbl3 strain of E. coli to maximize vector stability (Al-Allaf, Tolmachov, Zambetti, Tchetchelnitski, & Mehmet, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0003]). Although purchasing premade competent Stbl3 is very expensive, we generate our own batches of competent Stbl3 cells using the Zymo Research Mix & Go Transformation Kit.\nMaterials\nOne Shot™ Stbl3™ Chemically Competent E. coli (Invitrogen; cat. no. C737303)\nMix & Go E. coli Transformation Kit and Buffer Set (Zymo Research; cat. no. T3001)\n1. Prepare fresh batches of competent Stbl3 E. coli by following the Mix & Go Kit's instructions.\n2. Store aliquots of cells at −80°C for later use.",
    "Guide RNAs are cloned into expression vectors by BsmBI digestion. After a suitable 20-bp guide RNA sequence is identified, BsmBI restriction sequences should be added to each strand of the gRNA sequence, as shown here:\nGuide RNA post-annealing schematic:\n         \nForward oligo: 5′-CACCG–20-bp gRNA sequence-3′\nReverse oligo: 3′-C–20-bp gRNA sequence–CAAA-5′\nGuide RNA oligo 5′-3′ sequences:\n         \nForward oligo: 5′-CACCG–20 bp gRNA sequence-3′\nReverse oligo: 5′-AAAC–20 bp gRNA sequence–C-3′\n“CACCG” and “AAAC” are added to the oligos to ensure compatibility for cloning using a BsmBI digestion. The single C at the 3′ end of the reverse oligo is needed to anneal the sequence to the additional G added to the forward oligo. Guide RNAs are generally 25 bp long after these modifications are added to the sgRNA sequence.\nSynthetic oligos of the designed guides can be purchased commercially from Integrated DNA Technologies (IDT; https://www.idtdna.com[href=https://www.idtdna.com]) or any commercial source. Generally, 25 nmol of DNA oligos from IDT prepared with standard desalting provides more than enough material for gRNA cloning (see Strategic Planning for guidelines for gRNA design). Although we have provided a list of gRNA-expressing vectors that we commonly use in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-tbl-0001], a number of other gRNA vectors can be found on Addgene, and these plasmids may require the use of alternative restriction enzymes.",
    "The gRNA oligos can be cloned into either the gRNA vector (two-vector system) or the “all-in-one” vector (one-vector system) by restriction digestion and ligation. If the two-gRNA approach is chosen, each gRNA can be cloned into a vector with different fluorescent markers to allow downstream sorting of cells that harbor both gRNAs. The gRNA cloning protocol consists of five overall steps: (1) linearization of the plasmid backbone, (2) 5′ phosphorylation and annealing of the oligonucleotides, (3) ligation of the annealed oligonucleotides into the linearized vector, (4) transformation of the ligation product into Stbl3 cells, and (5) sequence verification of the gRNA.\nMaterials\ngRNA plasmid backbone or all-in-one vector (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0001])\nCompetent Stbl3 cells (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0002])\nBsmBI restriction endonuclease and NEB buffer 3.1 (NEB; cat. no. R0580)\nNuclease-free distilled, deionized water (ddH2O)\nAlkaline phosphatase, calf intestinal (CIP) stock (10,000 U/ml; NEB; cat. no. M0290)\nNucleoSpin® Gel and PCR clean-up (Macherey-Nagel; cat. no. 740609.50)\n100 µM gRNA oligos (IDT or other DNA synthesis manufacturer; see Strategic Planning and Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0003])\nT4 polynucleotide kinase (NEB; cat. no. M0201)\nT4 DNA ligase and appropriate buffer (NEB; cat. no. M0202)\nLB + 100 µg/ml ampicillin culture plates\nLB + 100 µg/ml ampicillin medium\n50% (v/v) glycerol\nQIAprep Spin Miniprep Kit (Qiagen; cat. no. 27106)\nU6 sequencing primer 5′-GAGGGCCTATTTCCCATGATTCC-3′ (IDT or other DNA provider)\n1.5-ml microcentrifuge tubes\nHeat block\nDNA NanoDrop spectrophotometer or equivalent\n0.2-ml thin-walled PCR tubes\nThermocycler\n1.5-ml freezing tubes\nAdditional reagents and equipment for agarose gel electrophoresis (Current Protocols article: Voytas, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0054])\n1. To linearize the guide RNA plasmid backbone, mix the following in a 1.5-ml microcentrifuge tube:\n         \n8 µg gRNA backbone\n2 µl BsmBI enzyme\n5 µl NEB buffer 3.1\nNuclease-free ddH2O to 50 µl final.\nIncubate for 3 hr at 55°C.",
    "2. After 3 hr of digestion, add 1 µl 10,000 U/ml CIP stock solution to each reaction and incubate 1 hr more at 37°C.\n3. Run the digestion mixture on a 1% agarose gel. Two bands should be observed (bands around 11 and 2 kb for the all-in-one vector and bands around 7.5 and 2 kb for the vector backbone of the two-plasmid system). Using the NucleoSpin® Gel and PCR Clean-up Kit, cut out and extract the larger band. Determine the DNA concentration of the extracted vector using a NanoDrop spectrophotometer, and store the linearized vector at −20°C.\n4. To anneal and phosphorylate the 5′ end of the gRNA-containing oligos, set up the following reaction in a 0.2-ml PCR tube:\n         \n1 µl forward oligo (100 µM)\n1 µl reverse oligo (100 µM)\n1 µl 10× T4 ligase buffer\n6.5 µl nuclease-free ddH2O\n0.5 µl T4 PNK enzyme.\n5. Place the reaction tube in a thermocycler and run the following program:\n         \ntable:\n﻿0,1\n30 min,37°C\n5 min,95°C\n5 min,90°C\n5 s,80°C (ramp 0.1°C/s)\n30 s,70°C (ramp 0.1°C/s)\n30 s,60°C (ramp 0.1°C/s)\n1 min,50°C (ramp 0.1°C/s)\n2 min,40°C (ramp 0.1°C/s)\n2 min,30°C (ramp 0.1°C/s)\nHold at 4°C.,Hold at 4°C.\n6. After the PCR program is completed, dilute the reaction 1:200 with nuclease-free ddH2O and store at −20°C.\n7. To ligate the sgRNA into the linearized guide RNA backbone, set up the following reaction and incubate 30 min at room temperature. A reaction excluding the gRNA oligos from step 6 should be included the first time a new batch of digested vector is used to confirm the efficiency of the digestion. No colonies above background levels should be seen on Stbl3 cells transformed with only digested vector.\n         \nX µl (25 ng) digested vector from step 3",
    "Y µl ddH2O to 10 µl total volume\n1 µl phosphorylated and annealed oligo duplex from step 6\n1 µl 10× T4 ligase buffer\n1 µl T4 ligase.\n8. To transform the sgRNA vectors into Stbl3 E. coli cells, add 5 µl of the ligation reaction from step 7 to 50 µl Stbl3 cells. Allow the mixture to rest on ice for 5 min.\n9. Plate appropriate dilutions of the Stbl3 E. coli cells on LB + 100 µg/ml ampicillin plates and allow to grow overnight at 37°C.\n10. Pick three to five colonies per gRNA and allow to grow in 3 ml LB + 100 µg/ml ampicillin medium overnight at 37°C.\n11. After overnight growth, make 1 ml glycerol stocks of each of the colonies by mixing the LB culture 1:1 with 50% glycerol and storing at −80°C.\n12. To verify the sequence of the sgRNA plasmid, generate a glycerol stock (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0001], step 3), purify the vectors from the bacteria in the liquid culture using the QIAprep Spin Miniprep Kit, and sequence the plasmids with the U6 primer.\nThe U6 primer will initiate sequencing at the promoter region upstream of the location where the sgRNA should be inserted.\nCRISPR Delivery\nThe CRISPR system described in this protocol can be introduced into the cells of interest in a number of ways, including:\n         \nTransfection of the all-in-one CRISPR plasmid (Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0008]);\nTransfection of a gRNA plasmid into a Cas9-expressing cell line (cell line generation: Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0005] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0006]; transfection: Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0008]);\nTransduction of the all-in-one CRISPR plasmid (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0005] and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0007]);\nTransduction of a gRNA plasmid into a Cas9-expressing cell line (cell line generation: Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0005] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0006]; transduction: Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0005] and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0007]).",
    "In general, transient expression of the CRISPR components may lead to fewer off-target effects while also decreasing on-target efficiency. Suitable strategies will depend on the researchers’ particular experimental goals and the system(s) in which they are working. Below, we describe various protocols for transfection and transduction to introduce the CRISPR plasmids into the cells of interest.",
    "All lentiviruses used in this protocol (viral particles containing plasmids that express Cas9, a guide RNA, or the all-in-one vector) are generated in HEK293T cells via calcium phosphate transfection (Chang, Marran, Valentine, & Hannon, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0010]). This transfection protocol involves the use of two viral packaging plasmids (PsPAX2.0 and VSVG). If the two-vector approach is used, separate lentiviral pools should be generated for each vector.\nMaterials\nHEK293T cells (ATCC CRL-3216)\nCRISPR plasmid DNA (“all-in-one” plasmid or gRNA/Cas9 plasmids from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0004])\npsPAX2.0 plasmid (Addgene plasmid no. 12260)\nVSVG plasmid (Addgene plasmid no. 12259)\n2 M CaCl2\nSolution B (2× HEPES-buffered saline; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-rec-0001]).\n100 mM chloroquine (Cayman Chemical; cat. no. 14194)\nDMEM medium supplemented with 10% FBS, 1% Pen/Strep, and glutamine (Life Technologies; cat. no. 11995-073)\n10-cm tissue culture plates with preferred culture medium for DMEM/10% FBS with 1% Pen/Strep and glutamine HEK293T cells\n5-ml polystyrene tubes\n0.45-µM filter\n1. Prior to transduction, split HEK293T onto a 10-cm plate to obtain cells that are 70-80% confluent at the time of transfection.\n2. In one tube, prepare solution A (total volume 500 µl) by adding, in the following order:\n         \n20 µg CRISPR plasmid DNA\n25 µg psPAX2.0 plasmid\n4 µg VSVG plasmid\nddH2O as required for a 500 µl total volume\n62.5 µl 2 M CaCl2\n3. Pipet 500 µl solution B into a separate tube.\n4. Use a pipet to blow bubbles into solution B while adding solution A to solution B dropwise.\nBubbles will aid the even formation of precipitants, which is a crucial step in determining the success of a transfection.\n5. Incubate this mixture 15 min room temperature.\n6. During the incubation, add 2.5 µl 100 mM chloroquine to the 10-cm plate of HEK293T cells from step 1.",
    "7. After the 15-min incubation is done, add the transfection mixture dropwise around the 10-cm plate and then return the plate to a tissue culture incubator at 37°C.\n8. At 8-14 hr after transfection, replace the medium on the HEK293T cells with fresh 10% FBS DMEM medium.\n9. Start collecting virus 24 hr after transfection. To harvest virus, collect all the old medium on the HEK293T cells using a syringe. Separate cell debris from viral supernatant using a 0.45-µM filter, and either store the supernatant at −80°C or add it to a recipient cell line immediately. Typically, virus can be collected three times within the 24- to 72-hr window after transfection. To perform multiple harvests, add an equal volume of the medium back to the cells and repeat the collection protocol the next day. The protocol can also be scaled up (to 15-cm plates) or down (to 6- or 12-well plates) as needed.\nSeveral of the CRISPR plasmids described in this protocol contain a fluorescent marker and can be easily titered. To determine viral titer, add increasing volumes of virus to a recipient cell line using the transduction protocol listed below. Three days after transduction, quantify the fraction of fluorescent cells for each volume of virus to determine the number of infectious particles per microliter of solution. However, titration is often unnecessary, as the above transfection protocol is highly efficient. If titration is required for a nonfluorescent viral plasmid, a qPCR kit can be used instead (Clontech; cat. no. 631235).",
    "When using the two-vector system, a stable cell line that expresses Cas9 must first be generated. The cell line can then be reused in multiple knockout experiments. Alternatively, a number of vendors offer Cas9-expressing cell lines, some of which have inducible Cas9 expression (https://www.genecopoeia.com[href=https://www.genecopoeia.com]).\nMaterials\nCas9 lentiviral supernatant from lentivirus generated using the calcium phosphate transfection protocol (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0005])\nRecipient mammalian cell line\nPolybrene (Santa Cruz Biotechnology; cat. no. sc-134220)\nAppropriate selective agent for the plasmid used\nAdditional reagents and equipment for cell culture and trypsinization (Current Protocols article: Phelan, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0044])\n1. Trypsinize the target cells and plate them so that they will be ∼50% confluent.\n2. Mix supernatant from the lentiviral culture into cells 1:1: e.g., add 5 ml viral supernatant to 5 ml cell culture.\n3. Add polybrene to 8 µg/ml final.\n4. Change medium 24 hr after transduction.\n5. At 48 hr after transduction, select for Cas9 expression.\nThe Cas9 lentiviral plasmid most commonly used in our lab (Addgene plasmid no. 108100) harbors a puromycin-resistance marker, and we select for Cas9-expressing cells using 1-4 µg/ml puromycin (Thermo Fisher Scientific; cat. no. A11138-03). In some cell lines, sufficient Cas9 expression can be generated by a single round of transduction followed by 3-5 days of selection. In other cell lines (particularly those that silence viral transgenes), optimal Cas9 expression requires multiple rounds of lentiviral transduction followed by 1-2 weeks of drug selection. Cas9 expression can be checked in the population using qPCR, western blot analysis, or by transduction with a guide RNA with known biological activity.",
    "Guide RNA or all-in-one vectors can be permanently introduced into a recipient cell line by the transduction protocol described below.\nMaterials\nRecipient mammalian cell line (use cell line from Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0006] for two-vector system)\nSupernatant with lentiviruses carrying cloned gRNA vector or all-in-one vector (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0005])\nPolybrene (Santa Cruz Biotechnology; cat. no. sc-134220)\n6-well culture plates\nAdditional reagents and equipment for cell culture and trypsinization (Current Protocols article: Phelan, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0044])\n1. Trypsinize the target cells and plate them in 6-well plates so that they will be ∼50% confluent.\nTypically, plating one well more than the number of transduction reaction is sufficient. The extra well can be used as an untransduced control when monitoring transduction efficiency.\n2. Mix lentiviral supernatant into culture medium in 1:1 (or using an appropriate amount determined by titration).\n3. Add polybrene to 8 µg/ml final.\n4. Change medium 24 hr after transduction.\n5. Monitor transduction efficiency based on the fluorescent marker present on the gRNA or all-in-one vector using a fluorescence microscope.",
    "Guide RNAs or all-in-one vectors can be temporarily introduced into a recipient cell line by a variety of transfection methods. We have found that transfection efficiency can vary greatly for different methods with different recipient cell lines. In general, we find that Lipofectamine 3000 is most likely to produce the highest transfection rates with the least amount of optimization required. However, in specific circumstances, other reagents (Lipofectamine 2000, TransIT-LT1, etc.) may yield superior results. In general, we recommend starting with Lipofectamine 3000 and then testing other reagents if necessary.\nTo introduce CRISPR plasmids with Lipofectamine 3000, we use the following protocol (slightly modified from the manufacturer's protocol).\nMaterials\nRecipient mammalian cell line (use the cell line from Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0006] for the two-vector system)\nLipofectamine 3000 (Thermo Fisher Scientific; cat. no. L3000001)\nP3000 Reagent (supplied with Lipofectamine 3000)\nOpti-MEM Reduced Serum Media (Thermo Fisher Scientific; cat. no. 31985088)\nCloned gRNA vector or all-in-one vector\nPen/Strep-free medium\n5-ml polystyrene tubes\nCell culture materials\n6-well tissue culture plates\nFluorescence microscope\n1. Plate the target cell line so that it will be 60-80% confluent in a 6-well plate the next day.\n2. Warm transfection reagents to room temperature.\n3. Add 7.5 µl Lipofectamine 3000 reagent to 125 µl Opti-MEM medium (called “tube A”).\n4. Add 5 µg plasmid DNA (gRNA or all-in-one vector) and 10 µl P3000 Reagent to 125 µl medium (called “tube B”).\n5. Mix the contents of tube A and tube B and incubate the mixture at room temperature for 5 min.\n6. Change the medium on the recipient plate to Pen/Strep-free medium.\n7. Add the transfection mixture to the recipient cells dropwise.\n8. Change the medium 24 hr after transfection.",
    "9. Confirm transfection efficiency by assessing the fluorescent marker under a fluorescence microscope. Although higher transfection efficiencies will allow for easier knockout enrichment by FACS, even low transfection rates will allow you to proceed with the protocol.\nClonal Expansion of Knockout Cell Lines\nMultiple approaches can be used to isolate potential knockout clonally derived populations.",
    "After introduction of the gRNA(s) by transduction or transfection, single cells must be isolated in order to generate clonal lines that can be verified as complete knockouts. Two common methods for this are dilution cloning and fluorescence-activated cell sorting (FACS) of single cells (Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0010]). Although both approaches can yield single cell–derived clones, FACS sorting is often more effective given its ability to specifically isolate double-positive cells. However, dilution cloning is cheaper and may cause less cellular stress than sorting.\nMaterials\nAppropriate cell culture medium\nStandard cell culture plates:\n               \n10-cm plates (VWR: cat. no. 25382-701)\n96-well flat-bottom plates (VWR: cat. no. 29442-056)\nMicroscope\nAdditional reagents and equipment for cell culture and trypsinization (Current Protocols article: Phelan, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0044])\n1. Harvest the transduced cells by trypsinization.\n2. Count the cells and dilute to a concentration of 20 cells per 100 µl.\n3. Using a multichannel pipette, pipette 200 µl of the diluted cells into the first row of a 96-well plate.\n4. Pipette 100 µl of the appropriate culture medium into all remaining wells in the plate.\n5. Take 100 µl from the first row of the plate containing cells and mix it with the 100 µl of appropriate medium in the row below. This will result in a two-fold dilution of the cell concentration for the second row.\n6. Repeat this process down the rows of the plate, resulting in a series of two-fold dilution down the rows. This will result in some proportion of the wells containing a single cell.\n7. Check by microscopy for wells that contain a single cell that are single or double-positive for the gRNA marker(s). This can be done immediately following dilution or 12-24 hr later, after the cells have settled. Circle these wells.",
    "8. Wells with single cells should be expanded: allow the cells to grow to form microcolonies (∼50-100 cells). Split the microcolony into a fresh well of a 96-well plate. Once that well is near confluence, split to a well of a 48-well plate. Continue expanding the line until a sufficient number of cells can be harvested for the validation assays described below.",
    "FACS can be used in multiple ways to isolate single cells. When using the two-gRNA approach, FACS can be used to isolate cells that express both gRNAs by sorting for both fluorescent markers. Depending on your choice of system and the setup in your FACS facility, there are several approaches for this, listed below.\n1. Double-positive single cells can be sorted directly by FACS and plated into 96-well plates.\n2. Bulk populations of double-positive cells can be isolated by FACS and plated into 96-well plates by dilution plating, as described in Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0009].\n3. Bulk populations of double positive cells can be isolated by FACS and plated on 10-cm plates at a low concentration to allow single cells to form colonies:\n         \nPlate 100-200 cells from the FACS-sorted sample of double-positive cells onto a 10-cm plate.\nUse a microscope to identify isolated microcolonies that begin to grow.\nUse cloning cylinders (Chemglass; cat. no. CLS-1777-02) to isolate and trypsinize the individual microcolonies, and then move them to a 96-well or 48-well plate for clonal expansion.\nClones can be expanded by plating to progressively larger plates until there are enough cells to freeze and take DNA and protein lysates for knockout verification.\nValidation of Gene Knockout",
    "The cornerstone of any strategy to verify that a protein of interest has been ablated is demonstrating its absence by western blot analysis. However, single western blots may be misleading, and characterizing the precise alterations caused by CRISPR at the DNA level may provide additional useful information. The options for knockout validation also differ slightly depending on whether the one-guide or two-guide approach was used. In particular, if a gene was targeted by two independent guide RNAs, a PCR-based screening strategy can be applied to rapidly assess the knockout status of dozens of potential clones. Alternatively, the presence of indel mutations can be verified at each cut site, though this becomes more challenging if the resultant mutations are heterozygous. No single technique is perfect, and we recommend that researchers apply a combination of the methods described below to characterize the CRISPR-induced lesions and identify valid knockout clones. Figures 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-fig-0002] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-fig-0003] show representative results of different validation experiments to confirm knockout of the MELK kinase from cancer cell lines (Giuliano, Lin, Smith, Palladino, & Sheltzer, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0019]; Lin, Giuliano, Sayles, & Sheltzer, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0036]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f07dc431-1735-4b5f-8c56-046a1a6eb9d5/cpmb100-fig-0002-m.jpg</p>\nFigure 2",
    "Two-guide knockout validation. (A) Schematic illustrating the domain structure of MELK and sites targeted by guide RNAs. (B) Diagram showing the exons of MELK targeted by each gRNA. Half-arrows indicate the deletion or cut-site primers used to verify the presence of recombination events. (C) Sample results from PCR amplification verifying multi-exon deletions in three independent MELK knockout (MELK-KO) clones transduced with two guide RNAs. (D) Sample results from Sanger sequencing of deletion PCR products from three MELK-KO clones. Clones transduced with the g1/g3 and g1/g4 combinations have homozygous deletions in MELK, whereas the clone transduced with the g2/g3 combination contain a heterozygous recombination event. If necessary, the heterozygous alleles could be further analyzed using TOPO cloning. The highlighted region in each chromatogram indicates the base pairs recognized by a guide RNA. (E and F) Sample results from validation of MELK knockout through western blotting using two antibodies that bind to two different epitopes. Clones transduced with guide RNAs targeting Rosa26, a nonessential and noncoding gene, were used as a control. (Reprinted from Lin et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0036], with permission of eLife.)\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/272eaa8c-7fcd-49d5-9577-eeb5277f44ac/cpmb100-fig-0003-m.jpg</p>\nFigure 3",
    "One-guide knockout validation. (A) Schematic illustrating the domain structure of MELK and sites targeted by guide RNAs. (B) Diagram showing the exons of MELK targeted by each gRNA. Half-arrows represent cut-site primers used to verify the presence of indels. (C) Sample results from Sanger sequencing of cut-site PCR products or single alleles isolated by TOPO cloning. MELK-KO c1 has heterozygous cut-site mutations, whereas MELK-KO c2 has a homozygous mutation. Highlighted regions indicate base pairs recognized by each guide RNA. (D and E) Sample results from validation of MELK knockout through western blotting using two antibodies that bind to two different epitopes. Clones transduced with guide RNAs targeting Rosa26, a nonessential and noncoding gene, were used as a control. (Reprinted from Giuliano et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0019], with permission of eLife.)",
    "To confirm gene knockout by PCR (Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0012]), mutation sequencing (Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0013]), or TOPO cloning (Basic Protocol 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0014]), genomic DNA must first be prepared from control and potential knockout cell lines.\nMaterials\nPotential knockout cells\nDNeasy Blood & Tissue Kit (Qiagen; cat. no. 69506)\nCell culture materials\n6-well tissue culture plates\n15-ml tubes\n1.5-ml microcentrifuge tube\nNanoDrop spectrophotometer or equivalent\n1. Plate ∼300,000 cells in one well of a 6-well plate for each putative knockout clone.\nIf the number of clones need to be screen is large and plating 300,000 cells per clone is not optimal, cells can be plated in smaller well plates and QuickExtract kits can be employed instead of DNeasy kits. However, for high-quality genomic DNA and clean sequencing results in later steps, we do recommend plating ∼300,000 cells.\n2. The next day, follow the manufacturer's protocol from the DNeasy Blood & Tissue Kit to isolate the genomic DNA.\n3. Quantify the concentration and purity of the DNA with a NanoDrop spectrophotometer. A DNA yield of ∼1 µg is ideal.",
    "To screen for genomic knockouts, design two sets of PCR primers: one that spans the putative deletion and one that spans either cut site. The primers should recognize a sequence that is ∼100-200 bp from the CRISPR cut site, as larger sequences are more difficult to amplify. Suitable primers can be designed using NIH Primer Blast (https://www.ncbi.nlm.nih.gov/tools/primer-blast/[href=https://www.ncbi.nlm.nih.gov/tools/primer-blast/]) and ordered from IDT (https://www.idtdna.com[href=https://www.idtdna.com]).\nMaterials\nGenomic DNA (Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0011])\nPrimers\nTaq 2× Master Mix (NEB; cat. no. M0270)\nNuclease-free distilled, deionized water (ddH2O)\nThermocycler\n0.2-ml thin-walled PCR tubes\nAdditional reagents and equipment for agarose gel electrophoresis (Current Protocols article: Voytas, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0054])\n1. For each genomic DNA sample, set up one reaction with primers amplifying a single cut site and another reaction with primers spanning the deletion. As controls, set up a PCR reaction with genomic DNA from a wild-type population and a PCR reaction with genomic DNA from a mixed population transduced/transfected with the two guides. Follow the manufacturer's instructions to perform PCR with the Taq 2× Master Mix.\n2. After the PCR reactions are complete, run the PCR products on a 2% agarose gel.\nIf the DNA region between the cut sites was removed, then a PCR product would be expected in the reactions with deletion primers and not in the reactions with the cut-site primers. The presence of a reaction product in the cut-site primer lane indicates that not all copies of the intervening genetic material have been excised.",
    "If the researcher chooses the single-guide knockout approach, then demonstrating the presence of an indel mutation at the guide RNA cut site is strong evidence that the targeted gene has been knocked out. (Note that this approach is also appropriate if two gRNAs are used but no full deletions are detected.) Cut-site analysis can be performed by PCR-amplifying the region targeted by the guide RNA and then subjecting the amplicon to Sanger sequencing. In the event that the lesion is found to be heterozygous, then TOPO cloning can be applied to sequence individual alleles found within the clone.\nFor this approach, first isolate genomic DNA from each putative knockout clone and design PCR primers to amplify a ∼200- to 400-bp region around the cut site, as described above. Then, perform PCR and sequence the amplicon:\nMaterials\nGenomic DNA (Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0011])\nPrimers\n2× Taq Master Mix (NEB; cat. no. M0270)\nNucleoSpin® Gel and PCR Clean-up (Macherey-Nagel; cat. no. 740609.50)\nNuclease-free water\nGel electrophoresis equipment\nThermocycler\n0.2-ml thin-walled PCR tubes\n1.5-ml microcentrifuge tube\nAdditional reagents and equipment for agarose gel electrophoresis (Current Protocols article: Voytas, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-bib-0054])\n1. To set up a PCR reaction, follow the manufacturer's protocol for PCR guidelines and thermocycler settings for the 2× Taq master mix. As a control, set up a PCR reaction using the genomic DNA from a wild-type population.\n2. Run the PCR product on a 2% gel. Verify that a band of the correct size is present.\n3. Using the NucleoSpin® gel and PCR clean-up, isolate the PCR fragments from the mixture.\n4. Set up Sanger sequencing reactions according to the sequencing facility's guidelines. The forward and reverse primers used for PCR can also be applied for sequencing.",
    "5. Compare sequences between the wild-type population and each clone using standard chromatogram analysis software. Indels should be observed at or near the nuclease-targeted site.",
    "If Sanger sequencing reveals that the CRISPR-induced lesion is heterozygous (as evidenced by the presence of overlapping bases in the chromatogram; Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-fig-0003]C), the alleles can be deconvolved by TOPO cloning and sequencing. First, the individual alleles are cloned into the TOPO vector and transformed into E. coli. Next, single colonies are picked and the plasmids are reisolated by miniprep and then sequenced individually. In this way, researchers can confirm the presence of indel mutations in each allele in a targeted cell line.\nNote that the Taq polymerase used for PCR in this protocol leaves an adenine overhang at the 3′ end of the PCR product. As a result, the TOPO TA kit (Thermo Fisher Scientific; cat. no. 450071), in which the vector contains a T overhang, should be used for TOPO cloning of these amplicons. If a different polymerase with proofreading activity is used for PCR, then the TOPO blunt-end kit (cat. no. 450159) should be used instead.\nMaterials\nPCR products from cut-site PCR reactions (Basic Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0013])\nTOPO™ TA Cloning™ Kit for Sequencing, without competent cells (cat. no. 450071)\nCompetent Stbl3 E. coli cells (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.100#cpmb100-prot-0002])\nNuclease-free water\nLB + 50 µg/ml kanamycin culture plates\nLB + 50 µg/ml kanamycin medium\nQIAprep Spin Miniprep Kit (Qiagen; cat. no. 27106)\n0.2-ml thin-walled PCR tubes\nThermocycler\n1. Ligate the products from cut-site PCR into TOPO plasmids according to the manufacturer's guidelines.\n2. Add 2-3 µl of the ligation product to an aliquot of Stbl3 E. coli cells. Incubate the cells on ice for 5 min and then plate the E. coli cells on LB + kanamycin plates. Allow the plates to grow at 37°C overnight.\n3. The next day, pick 15 colonies from the plates and grow each of them in 2 ml LB + kanamycin medium.",
    "4. Isolate the plasmids from the E. coli cells using the QIAprep Spin Miniprep Kit.\n5. Set up Sanger sequencing reactions according to the sequencing facility's guidelines. The forward primer or M13 forward primer from the TOPO cloning kit can be used to sequence the plasmids. Set up a sequencing reaction using the PCR product from the wild-type population as well.\n6. Analyze the resulting alleles using standard chromatogram analysis software. Indels should be observed at or near the nuclease targeted site."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}