{
  "id": 18077,
  "origin_website": "Jove",
  "title": "Oral Biofilm Formation on Different Materials for Dental Implants",
  "procedures": [
    "This study was approved by the Institutional Review Board of the School of Dentistry of Ribeirão Preto, and the volunteer participant signed the written consent (Process 2011.1.371.583).\n1. Biofilm Formation in Situ\nSelection of participants\nSelect patients based on the following inclusion criteria: a healthy individual with a complete dentition and no clinical signs of oral diseases.\nExclude patients based on the following exclusion criteria: pregnancy, lactation, dental caries, a periodontal disease or antibiotic treatment in the last 3 months, smoker, or any systemic disease that could influence the periodontal status.\nPreparation of intraoral device\nRecord the maxillary arch by means of an alginate impression.\nPrepare type IV stone by adding 19 mL of water to 100 g of stone powder. Pour the stone into the alginate mold to make a model of the maxillary arch.\nDesign and fabricate an acrylic intraoral device to support the test specimens (titanium and ceramic disks).\n\t\t\nFabricate retentive clasps from NiCr wire (0.7 mm in diameter) using orthodontic pliers #139 and position them on the model. To position the clamp between the upper premolars, bend one end of each wire so that they form a loop.\n\t\t\t\nAdapt the loop in the region of the interdental papilla. In the occlusal, insert a gentle curvature so as not to interfere with the points of contact and with the occlusion. Make a 90° fold at the end of the clamp for a retention in the acrylic.\nTo fit the clamp in the upper second molar, adapt the curvature of the wire in the cervical third (vestibular) to contour the tooth (distal) and make a 90° fold at the end of the clamp for a retention in the acrylic.",
    "NOTE: In order to provide adequate retention/stability to the intraoral device, the retentive clasps were positioned between the upper premolars and distal aspect of the second molar on both sides of the dental arch.\nManipulate the self-curing acrylic resin according to the manufacturer's instructions and press the acrylic resin between 2 glass plates (with a 3 mm thick spacer interposed) during the plastic phase, to make a 3 mm thick sheet.\nLay the acrylic sheet on the palatal region of the model, according to the device's design, and trim off the surplus acrylic resin with a carver, before polymerization.\nFabricate wax disks using a metallic matrix [10 mm in diameter, 2 mm in thickness (surface area of 78.5 mm2)] by placing molten wax in the matrix and waiting for the wax to solidify. Manually embed 4 wax disks into the acrylic resin, 2 of them between the premolars and the other 2 next to the second molars.\nLet the acrylic resin polymerize in a pressure pot under 20 psi of compressed air for 20 min.\nFinish the intraoral device with an electric dental lab handpiece and cutter and polish it with abrasive rubber.\nAdjust the device for a proper fit in the mouth using the equipment described above.\nPreparation of the titanium and zirconia specimens\n\tNote: Specimens (n = 14) are 10 mm in diameter and 2 mm in thickness and have a surface area of 78.5 mm2.\n\t\nPolish the specimens' surfaces with water-cooled sandpapers of decreasing abrasiveness (600, 1200, and 2000 grit), for approximately 20 min.\n\t\tNOTE: The polishing of the specimens was performed to standardize the surface roughness at 0.2 µm.",
    "Clean and disinfect the specimens and intraoral device with liquid detergent and tap water, and then use an isopropyl alcohol ultrasonic bath for 15 min. Dry them with absorbent paper towels.\nFix the specimens in the intraoral oral device with about 0.1 mL of non-toxic hot melt adhesive (Figure 1).\nInstall the device containing the specimens in the oral cavity.\n\t\tNOTE: The intraoral device containing the specimens should be worn for 48 h. The device was removed and stored in phosphate buffered saline (PBS) while the patient was eating and performing oral cleaning.\n2. Assessment of Bacterial Viability\nNote: The sample size n = 10.\nPrepare a dyeing solution by adding 3 µL of SYTO9 (green fluorescent nucleic acid dye) and 3 µL of propidium iodide (red fluorescent nucleic acid dye) to 1 mL of sterile distilled water.\n\tNOTE: Prepare solutions protected from light.\nTransfer the specimens to a 24-well plate and wash them thoroughly with PBS to remove any non-adherent cells.\nAdd the appropriate volume (1 mL) of fluorescent dye solution to cover the biofilm-containing specimen. Add the dye very carefully so as not to disorganize the biofilm.\nIncubate the specimen for 20 - 30 min at room temperature, protected from light.\nGently wash the biofilm sample with sterile distilled water to remove any excess dye.\nPlace the specimen in a glass bottom dish and perform multiphoton laser scanning microscopy for the biofilm analysis.",
    "NOTE: The analysis of the bacterial cells viability was carried out using a multiphoton microscopy system. The fluorescence of propidium iodide was detected using a filter with an excitation/emission wavelength of 546/680 nm and 477/600 nm for SYTO9. The size of the images obtained was 5.16188 x 5.16188 mm, which corresponds to 26.64 mm2 of the total area of each specimen (78.5 mm2) or 33.94% of the total area. The images were made from the most central portion of the sample, with a resolution of 1,024 x 1,024 pixels. The red channel and green channel images were analyzed separately using Fiji software31. Each cell was selected using a selection tool and the intensity of the fluorescence was measured through the integrated density of the pixels, subtracting the image background.\n3. Analysis of the Specimens' Chemical Composition by Energy Dispersive Spectroscopy (EDS)\nNote: The sample size n = 3.\nSelect 3 specimens of each biofilm-free test material, and assess the chemical composition in 2 different areas of each specimen using a scanning electron microscope coupled to a dispersive energy spectrometer, with an electron beam voltage of 10 kV32.\n4. Morphological Analysis of the Bacterial Biofilm by Scanning Electron Microscopy\nNote: The sample size n = 1.\nFix the biofilm by immersing the specimens in 2.5% glutaraldehyde diluted in 0.1 M sodium cacodylate buffer, pH 7.0 - 7.3, for 24 h.\nWash the sample in PBS buffer (pH = 7.6).\nPostfix the biofilm with 1% osmium tetroxide for 1 h.\nWash the sample in PBS buffer (pH = 7.6).\nDehydrate the biofilm samples carefully, keeping them immersed in increasing concentrations of ethanol solutions (50%, 70%, 90%, 95%, and 100%).\n\tNOTE: Perform 3 exchanges of ethanol at a 100% concentration. The total dehydration step takes about 2 h.",
    "Transfer the specimens to the critical point dryer and make several substitutions with carbon dioxide (CO2) until the specimens are dry.\nRemove the dried specimens from the apparatus and mount them onto the scanning electron microscope holders.\nSputter-coat a 20 nm layer of gold onto the specimen's surface for 120 s.\nInsert the gold-coated discs in the scanning electron microscope chamber. Obtain images from 5 different areas of each specimen, at 20 - 30 kV under variable pressure and at 650X magnification12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}