{
  "id": 8813,
  "origin_website": "Jove",
  "title": "Generation of Native, Untagged Huntingtin Exon1 Monomer and Fibrils Using a SUMO Fusion Strategy",
  "procedures": [
    "1. Expression of Recombinant Httex1 23Q and 43Q\nPrepare the required buffers and solutions. Prepare 1000x ampicillin (AMP, 100 mg/mL) stock solution, filter (0.2 µm), aliquot and store at -20 °C. Prepare lysogeny broth (LB) medium (25 g LB Miller per 1 L H2O), autoclave. Prepare 1 M Isopropyl ß-D-1thiogalactopyranoside (IPTG) stock solution, filter (0.2 µm), aliquot and store at -20 °C.\nTransform chemical competent E. coli B ER 2566 with a pTWIN1 vector, containing human Httex1 fused to an N-terminal His6-SUMO tag with the heat shock method34.\n\tNOTE: The E. coli BL21 DE3 strain has also been used. However, in this case an increased amount of truncations was observed.\nInoculate 200 mL of LB-medium with 1x AMP in a 1 L conical flask by adding a single colony from the agar plate with a sterile pipette tip. Incubate the culture at 30 °C and 180 rpm for 20 h (overnight) in a bacterial incubator.\nTake a 1 mL sample of the culture with a sterile pipette. Measure the optical density at 600 nm (OD600) of the sample with a disposable plastic cuvette and a photometer (respect the measurement range between 0.1 and 1, dilute with LB-medium if necessary). Calculate the amount of preculture that will result in a starting OD600 of 0.05 in a 3 L culture (with a preculture of OD600 = 3 that would mean 50 mL).\nInoculate four cultures (each 3 L of LB-medium with 1x AMP in a 5 L flask), by adding the calculated amount of preculture with a sterile pipette. Incubate the cultures at 37 °C and 180 rpm in a bacterial incubator.",
    "Every 30 min, take a 1 mL sample of the culture with a sterile pipette. Measure the OD600 of the sample with a disposable plastic cuvette and a photometer. When OD600 has reached 0.1 (typically after 1-2 h), set the temperature of the bacterial incubator to 14 °C and continue the incubation while cooling. Every 30 min, take a 1 mL sample of the culture with a sterile pipette. Measure the OD600 of the sample with a disposable plastic cuvette and a photometer.\n\t​NOTE: The time to cool the cultures may vary with the incubator used, so the time to begin cooling might have to be adapted depending on the type of incubator used. However, changing the temperature gradient should only have a small impact on the yield as the SUMO fusion protein appears to be quite stable.\nWhen OD600 has reached 0.3-0.4 (typically after 1-2 h), take a pre-induction sample of the culture for SDS-PAGE analysis of the overexpression. Calculate the sample size that gives a comparable amount of cells and a good signal on Coomassie stained SDS-PAGE: For a 10 well gel: volume = 0.2 mL/OD600; take half for a 15 well gel.\n\t\nFor a bacterial culture with an OD600= 0.4, take 500 µL. Take the calculated volume of bacterial culture with a sterile pipette. Spin down the sample (18000 x g, 4 °C, 2 min) and discard the supernatant. Keep the pellet at -20 °C until ready to use for analysis (step 1.11).\nInduce protein expression by pipetting 1.2 mL of a 1 M IPTG stock solution to each 3 L culture solution (final concentration 0.4 mM). Continue incubating the culture at 14 °C for 16 h (overnight).",
    "NOTE: The temperature will typically have reached ~20 °C by the time IPTG is added, depending on the performance of the incubator.\nTake a post-induction sample of the culture for SDS-PAGE analysis of the overexpression, following the procedure described in step 1.7.\nHarvest the cells by centrifugation in 1 L tubes (3993 x g, 4 °C, 10 min). Discard the supernatant, keep the cell pellet on ice and proceed directly to the purification.\nAnalyze the overexpression by SDS-PAGE35,36. Resuspend the pre- and post-induction samples in 20 µL of running buffer and 20 µL of 2x loading dye. Heat the samples for 5 min at 95 °C in a heat block and load 20 µL on a 15% gel while still hot. Run the gel for 90 min at 180 V. Stain the gel with Coomassie dye according to the instructions of the manufacturer. Compare results with representative results in Figure 1C.\n\tNOTE: The protocol can be stopped here, the cell pellet can be frozen and stored at -80 °C for several weeks. For optimal results, it is recommended to use the fresh bacterial pellet and avoid freezing. Freeze-thaw might lead to lysis of the cells and degradation of Httex1. This might reduce the yield and the quality of the protein.\n2. Cell Lysis and Purification of His6-SUMO Httex1 Fusion Protein by Immobilized Metal Affinity Chromatography (IMAC)",
    "Prepare 2 L of buffer A in a glass bottle (50 mM Tris(hydroxymethyl)-aminomethan (Tris), 500 mM NaCl, 15 mM imidazole). Prepare 1 L of buffer B (50 mM Tris, 500 mM NaCl, 500 mM imidazole pH 7.4) in a glass bottle. After dissolving the salts, adjust the pH with 10 N HCl and filter the solutions into fresh bottles with a bottle top filter (0.65 µm). Prepare a 1000x phenylmethylsulfonyl fluoride (PMSF, 0.3 M) stock solution, aliquot to 100 µL and store at -20 °C.\n\tNOTE: The protocol is designed to enable completing all the steps from lysis of the bacterial pellets to reversed-phase high performance liquid chromatography (RP-HPLC) purification and lyophilization within 8-9 h. To limit aggregation and proteolysis, it is recommended to work rapidly without pausing and perform all steps at 4 °C or on ice.\nAdd 100 µL of PMSF stock solution and five tablets (1 per 30 mL of final volume) of protease inhibitor to 100 mL of pre-chilled buffer A. Add the bacterial pellet to the buffer and homogenize the suspension by stirring with a magnetic stir bar and by pipetting up and down with a sterile 10 mL pipette (~30 min).\nDivide the bacteria suspension into aliquots of 40 mL in 50 mL disposable plastic tubes. Sonicate each aliquot in a water/ice batch for cell lysis (70% amplitude, total sonication time 5 min, intervals of 30 s sonication, 30 s pause).",
    "NOTE: It is important that the sample does not heat up during the sonication step. It is recommended to add some water to the ice bath to improve heat dissipation during sonication. The sonication procedure might have to be adapted if a different instrument is used. Other lysis methods like a French Press or a microfluidizer should work as well and might be beneficial to avoid heating of the sample and protein aggregation. These devices were not available in our laboratory and we obtained good results with our sonication protocol.\nTake a sample of 50 µL of the lysate for sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) analysis. Centrifuge the sample (18000 x g, 4 °C, 2 min) and pipette the soluble fraction in a new test tube. Resuspend the insoluble fraction in 50 µL of buffer A with a pipette. Keep the samples on ice until SDS-PAGE analysis (step 2.6).\nClarify the lysate by centrifugation (39191 x g, 4 °C, 60 min).\nDuring the centrifugation step, analyze the cell lysis step by SDS-PAGE. Add 50 µL of 2x loading dye to the soluble and insoluble fraction of the lysate respectively. Heat for 5 min at 95 °C and load 2 µL on a 15% gel while still hot. Run the gel for 90 min at 180 V. Stain the gel with Coomassie dye according to the instructions of the manufacturer. Compare results with representative results in Figure 1C.\nFilter the supernatant (0.45 µm, syringe filters). Take a sample of 20 µL of the filtered supernatant for SDS-PAGE analysis (step 2.11).\n\t​NOTE: Typically, a volume of 90 to 100 mL of clarified and filtered supernatant is obtained. Typically, 3 syringe filters are sufficient. If the filtration is cumbersome, try to increase the centrifugation speed and/or time.",
    "Isolate the His6-SUMO Httex1 fusion protein from the clarified bacterial lysate by immobilized metal affinity chromatography (IMAC) on a fast performance liquid chromatography (FPLC) system at 4 °C37.\n\t\nFill the clarified lysate into a superloop and load onto the Ni-NTA column (stripped, cleaned and reloaded according to the manual of the manufacturer, a previous blank run is recommended) at 2 mL/min. Pass 10 column volumes (CV, 200 mL) of buffer A at 10 mL/min to wash out the unbound proteins.\nElute the fusion protein with 2.5 CV (50 mL) of 100% of buffer B at 2 mL/min. Use a fraction size of 50 mL for loading and washing and 5 mL for elution. Compare results with representative results in Figure 1D.\nTake a sample of each fraction for SDS-PAGE analysis (20 µL) and pool the fractions containing the fusion protein according to the peak of the IMAC chromatogram. Add (2S,3S)-1,4-Bis(sulfanyl)butane-2,3-diol (DTT) and L-cysteine (final concentration 100 mM each) as a powder and dissolve by gently inverting the tube.\n\tNOTE: In our experience the purity of the fusion protein in the different fractions is comparable. As a precaution, the fractions of the purified fusion protein should be pooled quickly after IMAC to prevent aggregation of the highly concentrated fractions. In addition, it is recommended to proceed directly to the cleavage of the SUMO tag and HPLC purification. If necessary, the protocol can be stopped here. The diluted solution of the fusion protein was frozen in liquid nitrogen, stored at -80 °C and purified after thawing without a significant reduction in yield. Storage of the diluted solution of the fusion protein at 4 °C for 24 h also gives similar results.",
    "Analyze the IMAC by SDS-PAGE. Add 20 µL of loading dye to each sample. Load 2 µL of the crude material (2.7), the unbound fraction, the wash fraction and each fraction of the elution peak on a 15% gel. Run the gel for 90 min at 180 V. Stain the gel with Coomassie dye according to the instructions of the manufacturer. Compare results with representative results in Figure 1D.\n3. Cleavage of the His6-SUMO-tag and HPLC Purification\nCaution: Trifluoroacetic acid (TFA) is a volatile liquid and can cause severe burns so handle with care. Carry out all handling in a fume hood and wear adequate personal protective equipment (i.e., disposable nitrile gloves, safety glasses and a lab coat).\nIn a 5 L bottle, add 5 mL of TFA with a plastic syringe to 5 L of water (solvent A: H2O, 0.1% (TFA). Add 2.5 mL of TFA with a plastic syringe to a 2.5 L bottle of acetonitrile (solvent B: acetonitrile, 0.1% TFA).\nPrepare the HPLC system as suggested by the manufacturer. Perform a blank run to ensure a clean column.\nTake a sample of 100 µL of the fusion protein before the addition of ULP1 to monitor the cleavage reaction by UPLC (step 3.5).\nTransfer 20 mL of the fusion protein to a new 50 mL tube and add 0.4 mL of ULP1 stock solution, incubate on ice. Keep the remaining fusion protein on ice.\n\tNOTE: The His-tagged catalytic fragment 403-621 of the Ubiquitin-like-specific protease 1 (here referred to as \"ULP1\") was used to cleave the SUMO tag. The fusion protein is more stable than the cleaved Httex1. It is recommended not to cleave the SUMO tag of the whole batch. Instead, continue with aliquots of a size that can be directly and completely applied to the HPLC column.",
    "Every 10 minutes, take a sample of 100 µL of the cleavage reaction to monitor the progress by ultra-performance liquid chromatography (UPLC). Centrifuge the samples (18000 rpm, 4 °C, 2 min) and analyze 2 µL of the supernatant by UPLC (gradient from 10% to 90% solvent B in A for 0.25 to 3 min, 10% B for 1 min, refer to the instructions of the manufacturer for instrument usage). Compare the chromatograms obtained for the sample before addition of ULP1 and the samples taken after. Compare the results with representative results in Figure 2B.\nOnce the SUMO-cleavage is complete (the peak of the fusion protein has disappeared in the UPLC chromatogram and is fully converted to the newly appearing SUMO and Httex1 peak), filter the sample with a syringe filter (0.22 µm).\n\tNOTE: The SUMO cleavage is typically very fast (10-20 min at 4 °C) therefore UPLC analysis with a run time of 4 min is a valuable tool to monitor the reaction. Filtering the sample before HPLC purification is mainly a preventive measure to increase the lifetime of the column. The sample should not turn turbid.\nPurify the filtered sample by RP-HPLC (gradient of 25-35% solvent B in solvent A, over 40 min at 15 mL/min. (0-10 min: 5%; 10-12.5 min: 5 to 25%; 12.5-52.5 min: 25 to 35%; 52.5-57.5 min 35 to 95%; refer to the instructions of the manufacturer for instrument usage). Compare results with representative results in Figure 2C.\n\tNOTE: Httex1 and His6-SUMO separate well by RP-HPLC. However, there can be small amounts of truncated Httex1 in the beginning and end of the peak. Collect small fractions to obtain the maximum amount of pure material.\n\t​Caution: Use the appropriate safety equipment (i.e., lab coat, insulated gloves and a face shield) when handling cryogenic fluids.",
    "Analyze the HPLC-fractions by electro-spray ionization mass spectrometry (ESI-MS, autosampler, inject 10 µL, flow 0.6 mL/min, solvent: 20% B in A, no column, refer to the instructions of the manufacturer for instrument usage) and UPLC (gradient from 10% to 90% solvent B in A for 0.25 to 3 min, 10% B for 1 min, refer to the instructions of the manufacturer for instrument usage). Pool fractions of similar purity in 50 mL plastic tubes, freeze in liquid nitrogen and lyophilize. Weigh and transfer the lyophilized protein into 2 mL plastic tubes and store at -20 °C.\nCharacterize the purified material by UPLC, ESI-MS and SDS-PAGE. Dissolve 100 µg of lyophilized Httex1 in 8 µL of neat TFA in a 1.5 mL tube and incubate for 20 min at room temperature in the closed test tube. Carefully evaporate the TFA under a fume hood with a stream of nitrogen or argon. Use low pressure of nitrogen/argon to avoid loss of the sample.\n\t\nDissolve the protein in 100 µL of H2O. Analyze 2 µL by UPLC and 5 µL by ESI-MS as in step 3.8. Mix 20 µL of protein solution with 20 µL of 2x loading dye.\nAnalyze amounts of 1 µg to 10 µg by SDS-PAGE. Run the gel for 90 min at 180 V. Stain the gel with Coomassie dye according to the instructions of the manufacturer. Compare results with representative results in Figure 2D.\n4. Disaggregation and Resolubilization of Httex1 Proteins\nCaution: TFA is a volatile liquid and can cause severe burns so handle with care. Carry out all handling in a fume hood and wear adequate personal protective equipment (i.e. disposable nitrile gloves, safety glasses and a lab coat).",
    "Prepare 10 mL of Dulbecco's phosphate buffered saline (DPBS) (137 mM NaCl, 2.7 mM KCl, 10 mM Na2HPO4, 2 mM KH2PO4, pH 7.4) from the premixed powder in a 50 mL tube. Filter the DPBS solution through a 0.2 µm filter before each use.\nDissolve 150 µg of lyophilized Httex1 in 12 µL of neat TFA in a 1.5 mL tube and incubate for 20 min at room temperature in the closed test tube. Carefully evaporate the TFA under a fume hood with a stream of nitrogen or argon. Use low pressure of nitrogen/argon to avoid loss of the sample38.\n\tNOTE: In general, use 4 µL TFA to dissolve and disaggregate 50 µg of protein. This procedure will create a film of protein on the inside walls of the test tube. To prevent immediate aggregation of Httex1 in the following steps, work with pre-cooled buffers, keep the protein always on ice and avoid high concentrations.\nDissolve the disaggregated protein in 1 mL of pre-cooled DPBS and adjust the pH to 7.2-7.4 with 1 M NaOH. Filter the protein solution through a 100 kDa centrifugal filter into 1.5 mL plastic tubes (20000 x g, 4 °C, 20 minutes).\n\tNOTE: The calculated theoretical concentration of Httex1 is higher than the desired final concentration to account for possible loss. The filtration step is necessary to remove any aggregates that might have formed during dissolution of the protein.\nDetermine the concentration of Httex1 using a UPLC calibration curve based on amino acid analysis (detection at λ214) and send 2 µg of the protein to amino acid analysis to validate the concentration10. Calculate the amount of DPBS that needs to be added to obtain a concentration of 3 µM Httex1.",
    "Dilute the protein to 3 µM by adding the calculated amount of DPBS to the test tube. Keep the tube on ice until the initiation of the aggregation protocol.\n\tNOTE: Httex1 43Q should not be stored in solution. Always prepare a fresh protein solution based on the protocol above.Httex1 proteins are best stored as a lyophilized powder at -20°C.\n5. Monitoring of the Aggregation Kinetics of Httex1 43Q using UPLC and circular Dichroism (CD) Spectroscopy and Characterization of the Aggregates by Transmission Electron Microscopy (TEM)\nPrepare uranyl formate solution for TEM as previously reported39.\nInitiate the aggregation of Httex1 43Q by incubating a 3 µM solution in DPBS at 37 °C (use 1 mL of solution prepared as described above in the disaggregation protocol).\n\tNOTE: The aggregation of Httex1 can be performed at higher concentrations depending on the needs and aims of the experiment.\nQuantify the amount of soluble protein using UPLC at indicated time points (at 0, 1, 2, 4, 6, 8, 12, 24, 48 and 120 h). To do that, take an aliquot of 35 µL and remove the insoluble aggregates by centrifugation (20000 x g, 4 °C, 20 min). Inject 4 µL of the supernatant into the UPLC. Calculate the proportion of soluble monomer based on the change of the peak area using the instrument software 40. Compare results with representative results in Figure 3A.",
    "Characterize the changes in secondary structure using CD spectroscopy at 0 and 48 h. Take an aliquot of 100 µL and measure the ellipticity (1 mm quartz cuvette, 195 nm to 250 nm, 20 °C, data points every 0.2 nm, speed 10 nm/min, digital integration time 2 s, bandwidth of 1.0 nm). Acquire 6 spectra of the sample and average and smooth using a binomial filter with convolution width of 99. Plot the spectra as the mean residue molar ellipticity (θMRE)41. Compare results with representative results in Figure 3B.\nCharacterize the structural and morphological properties of the aggregates by TEM. Put 3 µL of the protein solution onto a Formvar/carbon-coated 200-mesh, glow-discharged copper grid for 1 min. Wash the grid twice with 15 μL water, once with 15 μL of 0.7% (w/v) uranyl formate and stain for 30 s with 15 μL of 0.7% w/v uranyl formate. Perform a TEM analysis of the grids. Compare results with representative results in Figure 3C."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}