{
  "id": 17496,
  "origin_website": "Jove",
  "title": "Myocardial Infarction by Percutaneous Embolization Coil Deployment in a Swine Model",
  "procedures": [
    "This study was approved by the Animal Experimentation Unit Ethical Committee of the Germans Trias i Pujol Health Research Institute (IGTP) and Government Authorities (Generalitat de Catalunya; Code: 10558 and 11208), and complies with all guidelines concerning the use of animals in research and teaching as defined by the Guide for the Care and Use of Laboratory Animals25.\n1.﻿ Preprocedural preparation of animals\nUse crossbred Landrace X Large White pigs (30-35 kg) of either sex.\nKeep the animals in a fasting state for 12 h prior to the procedure.\n2. Sedation, anesthesia, and analgesia\nSedate the animal with an intramuscular (IM) injection of ketamine (3 mg/kg), midazolam (0.3 mg/kg), and dexmedetomidine (0.03 mg/kg). Wait for approximately 10-15 min.\nOnce the pig is sedated, ventilate it with an oxygen (90-100%)-isoflurane (1-2%) mixture and a face mask to ensure optimal sedation.\nPlace vet ointment on the pig's eyes to prevent dryness.\n\tNOTE: Repeat every 20 min.\nPlace intravenously (IV) a 20 G catheter in a lateral ear vein. Administer propofol (1-2 mg/kg) to induce anesthesia.\nOnce the pig has no swallowing reflex, intubate the animal using an endotracheal tube (size 6.5-7.0 for 30-35 kg).\n\tNOTE: Adjust the size of the endotracheal tube according to the size of the pig. Intubation should be carried out rapidly to prevent a deeper anesthetic plane and prolonged apnea.\nAdminister IV buprenorphine (0.01 mg/kg) for intra-surgical analgesia. Use a fentanyl transdermal patch (100 µg/h) for post-operative analgesia.\n\tNOTE: The fentanyl patch is applied to the inguinal skin, and it is active for 72 h to limit postoperative pain. Its pharmacological effect does not start immediately after delivery, thus apply it before starting the procedure.\nPerform airway mask bag unit-ventilation (20 inflations/min) during the transport of the pig to the vascular interventional radiology (VIR) room.",
    "Connect the endotracheal tube to the anesthesia machine equipped with an airway sensor and capnography recording.\nStart mechanical positive pressure ventilation with FiO2 0.50, using a tidal volume of 10 mL/kg and a frequency of 16-20 breaths/min. Maintain the anesthesia with isoflurane (1-3%).\n\t​NOTE: To confirm the correct surgical anesthetic plane, the animal should not be respiring spontaneously nor have corneal or pupillary light reflexes.\n3. Hemodynamic monitoring and preparation of the surgical area\nPlace the animal on the operating table in the supine position and fix the limbs to the table with tape or bandage.\nPlace electrocardiogram (ECG) probes subcutaneously in the animal's extremities for recording changes in ST-segment, T-waves, and heart rate during the experimental procedure.\nPlace a pulse oximeter on the tongue or a corner of the lip of the animal and the non-invasive pressure cuff on the forelimb.\nMeasure the rectal/esophageal temperature with a probe.\nClean the right femoral area with surgical soap followed by alternating antiseptic povidone-iodine solution and alcohol 3 times under sterile conditions.\nEnsure that the surgeon performs surgical handwashing and wears a sterile gown and sterile gloves.\nCover the animal with a sterile surgical drape.\nPrepare and flush with heparinized saline solution the needle, a 6F vascular sheath, a 0.035-inch J-tipped wire, a 6F JR4 90-cm guiding catheter, a 0.014-inch 200-cm guidewire, a 150-cm length/0.017-inch inner diameter microcatheter, and the contrast medium injection manifold kit.\n4. Vascular access\nPuncture the right femoral artery via a percutaneous approach with ultrasound-guided puncture. Locate the bifurcation between the superficial femoral artery and the deep femoral artery.\nPosition the transducer 2-3 cm proximal to the bifurcation, in the common femoral artery, and align the center of the transducer with the common femoral artery.",
    "Position the needle in the center of the transducer and puncture the artery at an angulation of approximately 45°. Subsequently, insert a 6F vascular sheath using the modified Seldinger technique26.\n\tNOTE: In case of significant spasm or hematoma, crossover to the contralateral femoral artery.\nFlush the catheters with heparinized saline solution. (5000 IU unfractionated heparin/1000 mL of 0.9% NaCL).\nAdminister heparin through the sheath (300 IU/kg).\n5. Coronary angiography\nInsert the J-tip wire into the JR4 guide catheter and advance the wire through the sheath into the ascending aorta, and then place the catheter up over the valvular surface.\nRemove the wire and connect the catheter to the injection manifold system. Purge the entire system.\nUnder fluoroscopy, engage the catheter into the left main coronary artery and inject 10 mL of iodinated contrast medium to visualize the left coronary system (Figure 1A, C).\n\tNOTE: It is important to ensure that the arterial pressure waveform is not damped before injecting to avoid the risk of coronary dissection.\nPerform angiograms in two orthogonal views: left anterior oblique 40° and right anterior oblique 30° projections.\nAdvance a 0.014-inch guidewire pre-assembled on the microcatheter to the middle left anterior descending (LAD) or distal left circumflex (LCX) coronary artery under fluoroscopic guidance.\n6. Coil implantation\nUnder fluoroscopic guidance, advance the microcatheter through the wire to the desired location where the coil implant should be deployed. In the case of LAD occlusion, place the coil distal to the first diagonal branch, and for LCX, place the coil distal to the first marginal branch.\n\tNOTE: Proximal approaches (before the first diagonal or first marginal branches) have very low survival rates.\nRemove the wire and select the coil.",
    "NOTE: It is important to select the optimal coil size and length. A small or short coil may not position well in the vessel lumen and has a very high risk of distal migration due to contrast injections or spontaneous, resulting in smaller infarct size. A large or long coil may prolapse proximal to the vessel and produce a larger infarct than desired. The choice of the correct coil is especially important if non-detectable coils are used, as they cannot be removed. The optimal size is 1-2 mm larger than the lumen of the vessel to be embolized, and the length between 20-60 mm is usually adequate for 30-40-kg pigs.\nDeliver the coil via microcatheter and slowly inject 5 mL of iodinated contrast medium under fluoroscopy to visualize the correct position of the coil.\nRemove the microcatheter inside the guide catheter and place the guide in a side branch to perform control injections and to ensure access to the artery in case a second coil needs to be implanted.\nWait for the coil to thrombose and occlude the artery.\n\t​NOTE: When the artery is occluded, changes in the electrocardiogram can be observed. Another way to check complete arterial occlusion is to perform slow injections of iodinated contrast every 10 min (Figure 1B, D). If the artery does not occlude within 20-30 min, another coil implant may be required.\n7. End of procedure\nOnce the artery is occluded, administer a continuous IV infusion of lidocaine (50-100 µg/kg/min) for at least 1 h to prevent arrhythmic episodes.\nPerform an angiogram to ensure that there is no flow distal to the occlusion.\nRemove the wire, microcatheter, and guiding catheter.\nRemove the sheath and perform manual compression for 20 min.\n8. Postoperative procedure and animal recovery",
    "Monitor the animal until it is fully recovered, using ECG, rectal temperature, pulse oximetry, and capnography.\n\tNOTE: In case of ventricular arrhythmias, administer a bolus of lidocaine (1.5-3.5 mg/kg).\nAdminister an IM injection of tulathromycin (2.5 mg/kg) as prophylactic postoperative antibiotic therapy. For post-surgical analgesia, a transdermal fentanyl patch is administered before the surgical procedure (step 2.6).\nTurn off the isoflurane and maintain mechanical ventilation until the animal begins to breathe spontaneously.\nWhen the pig recovers the swallowing reflex, remove the endotracheal tube. NOTE: Check if the animal has a good SpO2 (more than 95%) before and after extubation.\nTransport the animal to an individual cage. Position the animal over a hot water blanket and cover it with a thermal drape to avoid post-surgical hypothermia.\n\tNOTE: Do not return the pig to the company of other animals until it has fully recovered.\nMonitor the animal until it has regained sufficient consciousness to maintain sternal recumbency.\n9. Postoperative pain assessment and monitoring \nDuring the post-surgical follow-up, monitor the general condition of the animals, including the respiratory rate, food and water intake, activity and interaction with the other individuals, appearance and coloration of the skin, and the evolution of the surgical wound.\nApply a daily supervision protocol according to the following scoring criteria: - Weight:\n\t0: Normal\n\t1: <10% weight loss\n\t2: 10-20% weight loss\n\t3:> 20% weight loss\n\t- Body condition:\n\t0: Good: non-prominent vertebrae, pelvic or spinal bones\n\t2: Regular: evidence of spinal segmentation, palpable pelvic bones\n\t3: Emaciation: extremely marked skeleton, little or no meat to cover\n\t- Behavior:\n\t0: Normal: Active and interactive in your environment\n\t1: Slight decline in activity and less interactive\n\t2: Abnormal: pronounced decline in activity, isolated\n\t3: Abnormal: Immobile or hyperactivity, possible self-harm\n\t- Physical appearance:\n\t0: Normal: skin/hair shiny and eyes bright",
    "1: Disappears embalming, skin/hair without shine\n\t2: Poor skin/nasal secretions\n\t3: Poor skin, abnormal or hunched posture\n\t- Behavioral disorders:\n\t0: None\n\t1: Inability to move normally\n\t2: Unable to reach food/drink, isolated from other animals\n\t3: Intention to hide/corner, does not respond to stimuli (dying)\n\t- Clinical signs:\n\t0: None\n\t1: Hypothermia, fever, mild respiratory failure\n\t2: Infection of the surgical wound, moderate respiratory failure with muco-bloody secretions\n\t3: Heart failure, severe respiratory failure (cyanosis, open mouth)\n\tScore:\n\t- 1-5: Supervise the animals once a day.\n\t- 6-12: Provide supportive therapy if necessary.\n\t- Any animal with a score of 3 in any of the above parameters or with a total score >12 will be euthanized.\n\tNOTE: The animals should be monitored daily by the animal care staff and twice a week by the research and veterinary team.\nAlthough no pain and distress are expected from the procedure, if any animal shows signs of pain, give analgesic therapy (tramadol, oral, 2-4 mg/kg, daily). If any animal does not respond to analgesic medication and shows signs of chronic pain (very low probability), euthanize the animal with an anesthetic overdose (sodium thiopental, IV, 200 mg/kg).\nIf the surgical wound shows signs of infection (low probability) despite the antibiotic therapy administered, treat the wound daily and initiate a new antibiotic regimen (cefquinome sulphate, IM, 2 mg/kg, daily).\n10. Euthanasia method\nUnder previous sedation and anesthesia, as previously described, administer an IV sodium thiopental overdose (200 mg/kg).\nConfirm cardiorespiratory arrest and death by monitoring vital signs (electrocardiogram, blood pressure, capnography).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}