{
  "id": 9433,
  "origin_website": "Jove",
  "title": "Applications of EEG Neuroimaging Data: Event-related Potentials, Spectral Power, and Multiscale Entropy",
  "procedures": [
    "1. EEG Acquisition\nExplain the experimental procedures to the participant and obtain informed consent.\nApply drop-down electrodes. Clean area on the face where drop-down electrodes will be located using an alcohol swab.\nPlace electrode cap on the participant's head. Measure participant's head circumference and choose the appropriate cap size. Following the internationally recognized 10-20 system for electrode placement, measure the distance from nasion to inion along the midline and divide by 10%. Using that number, measure up from nasion and mark. Align the electrode cap position Fp with this mark and pull the cap back. Make sure that the center of the cap is in line with the nose. Measure nasion to Cz, and confirm that this distance is half the distance from nasion to inion. Tighten the chinstrap.\nPlace gel-filled blunt-point syringe in the electrode holders. To create a conductive column of gel, start in contact with the scalp, then squeeze and pull back. Note that the application of too much gel may bridge the signals of neighboring electrodes.\nFix active electrodes into the electrode holders.\nPosition the subject in front of the monitor at the appropriate distance for the experiment. Ask the participant to remain still, emphasizing the importance of minimizing eye movements and blinks for a clean recording.\nExamine the electrode connections and EEG signal quality on the acquisition computer. Verify that all electrode offsets are low (< 40 mV) and stable. If there is a problem with a particular electrode, take out that electrode and reapply gel to adjust impedances at that site.\nSave the file and start the experiment.\n2. EEG Analysis",
    "After experimentation, but before extracting the particular statistic of interest, preprocess the continuous EEG data to remove artifacts using standard procedures of filtering and artifact rejection. Cut the continuous EEG into epochs corresponding to each discrete event, such as the presentation of photograph. In each epoch, include a 100 msec pre-stimulus window as a baseline.\nEvent-related potentials (ERP) analysis captures synchronous brain activity that is phase-locked to the onset of the event. Average across trials to separate the evoked responses from the \"noisy\" (i.e. non-phase locked) background activity. The variability across trials and between-subjects presents a major challenge for the ERP method of analysis. To achieve a good signal-to-noise ratio the experimental protocol should include many discrete events with definable onsets. Time locking the brain's response to the onset of a salient event and then averaging over many like events helps to reduce some of this noise; however, the temporal synchrony created by this procedure typically dissolves within 1 sec. Identify ERP component peak amplitudes and latencies for each subject (for more detailed guidelines on ERP analysis, see Picton et al., 2000).\nUsing Fourier analysis, transform the EEG signal from the time domain to the frequency domain and decompose the signal into its composite sine waves of varying frequencies 6.",
    "Multiscale entropy (MSE) is an information theoretic metric that estimates the variability of the neuroelectical signals over time and across multiple timescales. To provide a conceptual depiction of MSE analysis, consider two simulated waveforms, a regular waveform and a more stochastic one. Sample entropy values are near zero for the regular waveform and ~2.5 for the more variable waveform. An increase in sample entropy corresponds to an increase in signal complexity, which, according to information theory, can be interpreted as an increase in the amount of information processing capacity of the underlying system 7,16. Remember that the capacity of a brain is not fixed but changes depending on the neural context 2, i.e. the brain regions that happen to be functionally connected at a particular point in time.\nTo calculate MSE, use the algorithm available at www.physionet.org/physiotools/mse/[href=http://www.physionet.org/physiotools/mse/], which computes MSE in two steps.\nFirst, the algorithm progressively down-samples the EEG time series per trial and per condition. Down-sample the original time series to generate multiple time series of varying timescales. Time series 1 is the original time series. To create the time series of subsequent timescales, divide the original time series into non-overlapping windows of the timescale length and average the data points within each window. Down-sampling is similar to low-pass filtering; dividing the sampling frequency by the timescale will approximate the frequency at which the signal is low-pass filtered for that particular timescale. The application of MSE to a particular frequency range (e.g., alpha: 9 Hz to 12 Hz) can be interpreted as representing the composition of rhythms within that range as well as the interaction between those frequencies.",
    "Second, the algorithm calculates the sample entropy for each coarse-grained time series 14. Sample entropy estimates the complexity of a time series. In a nonlinear analysis of EEG, one assumes that an individual time series represents the manifestation of an underlying multi-dimensional non-linear dynamic model (see Stam, 2005 for a review). In this example, m (the pattern length) is set to two, which means that the variability of the amplitude pattern of each time series will be represented in two-dimensional versus three-dimensional space by considering the sequence pattern of two versus three consecutive data points, respectively. Parameter r (the similarity criterion), reflects the amplitude range (denoted by the height of the colored bands) within which data points are considered to \"match\". For a typical EEG time series with more than 100 data points, set the parameter m equal to 2 and the parameter r equal to a value between 0.5 and 1 (see Richman and Moorman, 2000; for a detailed procedure on selecting parameters refer to Lake et al., 2002).",
    "To calculate sample entropy for this simulated time series, begin with the first two-component sequence pattern, red-orange. First, count the number of times the red-orange sequence pattern occurs in the time series; there are 10 matches for this two-component sequence. Second, count the number of times first three-component sequence pattern, red-orange-yellow, occurs in the time series; there are 5 matches for this three-component sequence. Continue with the same operations for the next two-component sequence (orange-yellow) and the next three-component sequence (orange-yellow-green) of the time series. The number of two-component matches (5) and three-component matches (3) for these sequences are added to the previous values (total two-component matches = 15; total three-component matches = 8). Repeat for all other sequence matches in the time series (up to N - m) to determine the total ratio of two-component matches to three-component matches. Sample entropy is the natural logarithm of this ratio. For each subject, compute the channel specific MSE estimate as the mean across single trial entropy measures for each timescale."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}