{
  "id": 8638,
  "origin_website": "Jove",
  "title": "Purification of the Dendritic Filopodia-rich Fraction",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee of RIKEN Wako.\n1. Culture of Hippocampal Neurons\nPreparation of culture medium\nPreparation of 200x Vitamin mix. Dissolve 100 mg of D-pantothenic acid hemicalcium salt, 100 mg of choline chloride, 100 mg of folic acid, 180 mg of i-inositol, 100 mg of niacinamide, 100 mg of pyridoxal HCl, and 100 mg of thiamine HCl in 500 mL of ultrapure water using a magnetic stirrer. The solution is not completely dissolved. Carefully mix, aliquot in 50 mL tubes and store at -20 °C.\nPreparation of Riboflavin solution. Dissolve 100 mg of Riboflavin in 500 mL of ultrapure water using a magnetic stirrer. The solution is not completely dissolved. Carefully mix, aliquot in 50 mL tubes and store at -20 °C.\nPreparation of 1 M CaCl2. Dissolve 7.35 g of CaCl2·2H2O in 50 mL of ultrapure water using a magnetic stirrer.\nPreparation of Minimum essential medium (MEM). Dissolve 400 mg of KCl, 6800 mg of NaCl, 2,200 mg of NaHCO3, 158 mg of NaH2PO4·2H2O, 7000 mg of D-glucose, and 200 mg of MgSO4-7H2O in 950 mL of ultrapure water using a magnetic stirrer.\nTitrate 1.8 mL of 1 M CaCl2 to the MEM in a drop-by-drop manner using a 1 mL pipet with a constant agitation on a magnetic stirrer. Adjust the pH of the MEM to pH 7.25 with 1 mol/L HCl.\nAdd 5 mL of 200x Vitamin mix and 200 μL of Riboflavin solution to the MEM. Adjust the volume of the solution to 1,000 mL with ultrapure water. Filter the solution using a 0.22 μm filter system and store it at 4 °C.",
    "Preparation of 10x DNase-I stock solutions. Dissolve 100 mg of DNase-I in 12.5 mL of Hanks' Balanced Salt Solution (HBSS), filter through a 0.22 μm filter, aliquot in 1.5 mL tubes, and store the tubes at -20 °C.\nPreparation of cytosine β-D-arabinofuranoside (Ara-C) stock solution. Dissolve 25 mg of Ara-C in 8.93 mL of ultrapure water (final concentration of 10 mM), filter through a 0.22 μm filter, aliquot in 1.5 mL tubes and store at -20 °C\nPreparation of Plating medium. Mix 1 mL of MEM amino acid solution, 750 μL of 1 M HEPES, 1 mL of B27, 125 μL of 200 mM glutamine, 250 μL of penicillin/streptomycin, 2.5 mL of fetal bovine serum (FBS), and 44.375 mL of MEM in a 50 mL tube.\nPreparation of Stop medium. Mix 1 mL of MEM amino acid solution, 750 μL of 1 M HEPES, 5 mL of FBS (final 10%), and 43.25 mL of MEM in a 50 mL tube.\nPreparation of poly-L-Lysine-coated dishes\nCoat 35 mm plastic cell culture dishes with 0.2 mg/mL of poly-L-lysine hydrobromide for 1 day at 25 °C.\nNOTE: Poly-L-lysine should not be used instead of poly-L-lysine hydrobromide.\nWash the dishes with 2 mL of ultrapure water 3 times. Incubate the dishes with 1.5 mL of Stop medium at 25 °C until use.\nDissection of hippocampal neurons from mouse embryo\nTissue source of hippocampal neurons. Dissect the hippocampus from wild-type and TLCN-deficient C57BL6/J mice on the embryonic days 16-17 according to the method of Lu et al.19.",
    "Incubate dissected hippocampi in 0.25% trypsin and 1x DNaseI in HBSS containing 15 mM HEPES, pH 7.2 for 15 min at 37 °C with agitation every 3 min. Remove the solution. Incubate the hippocampi in 10 mL of STOP medium to inactivate trypsin at 4 °C for 5 min.\nMove the hippocampi into 10 mL of fresh STOP medium and incubate at 4 °C for 5 min. Move the hippocampi into 10 mL of fresh STOP medium and incubate at 4 °C for another 5 min. Move the hippocampi into 900 μL of STOP medium and 100 μL of 10x DNaseI in a 15 mL tube. Dissociate the hippocampi into isolated neurons by pipetting 20 times using a 1 mL pipet.\nNOTE: The tip of the 1 mL pipet slightly touches the bottom of the 15 mL tube during dissociation of the hippocampi.\nAdd 9 mL of plating medium, and filter through a 70 μm cell strainer into a 50 mL tube. Count the number of cells using a hemocytometer and adjust to 3.5 x 104 cells/mL in plating medium.\nAspirate STOP medium from poly-L-lysine-coated dishes. Plate the cells on poly-L-Lysine-coated dishes at 7 x 104 cells/dish (2 mL/dish).\nAfter 60-64 h of incubation under 5% CO2 at 37 °C, add 2 μL of Ara-C stock solution (final 10 μM) to the neurons, and shake the dish slowly. Keep the culture dishes in a humidified box without changing the culture medium under 5% CO2 at 37 °C.\n2. Purification of Dendritic Filopodia-rich Fraction",
    "After 13 days in vitro (DIV), add magnetic polystyrene microbeads (3 x 106 particles/dish) to 20 dishes containing the cultured neurons. After 1 day, wash the neurons in 1 mL of PBS with agitation 3 times to remove the medium and unbound microbeads. After removing PBS, lyse the neurons with 500 μL/dish of lysis buffer (PBS containing 0.01% Triton X-100, EDTA-free protease inhibitor cocktail, and phosphatase inhibitor cocktail).\nCollect the lysate with a cell scraper and move the lysate to low protein-binding microtubes (10 tubes). Set the tubes on a magnet separator and wait for 1 min. Collect the supernatant and use it as the unbound fraction for silver staining and Western blot analysis.\nTransfer the beads to a new low-protein-binding microtube, set on a magnetic separator, and completely remove the supernatant. Add 500 μL of lysis buffer and wash the beads using a vortex mixer for 15 s. Set the tube on a magnet separator, wait for 1 min, remove the supernatant, and add 500 μL of lysis buffer. Repeat the washing of the beads 10 times and remove the supernatant.\nElute proteins bound to the beads (the bound fraction) by the addition of 50 μL of 1x SDS sample buffer (62.5 mM Tris HCl, pH 6.8, 2.5% SDS, and 10% glycerol) and boil the tube at 98 °C for 5 min. Centrifuge the tube at 860 x g for 10 s and set the tube on a magnetic separator for 1 min. Collect the supernatant and use it as the bound fraction.\nNOTE: The protocol can be paused here.\nMeasure protein concentrations of the unbound and bound fractions by the BCA protein assay. Visualize protein solutions with bromophenol blue and adjust the concentration to 5 ng/μL for SDS-PAGE.\n3. Silver Staining and Western Blot Analysis",
    "Separate the bound and unbound fractions (50 ng) by SDS-PAGE using a 5-20% gradient gel. Silver-stain the gel.\nWestern blot using anti-TLCN-C (1/3,000), anti-bovine vitronectin (1/5,000), anti-actin (1/1,000), and anti-α-tubulin (1/1,000) as primary antibodies and HRP-conjugated goat anti-rabbit IgG (1/5,000) as the secondary antibody. Visualize the antigens using chemiluminescent Western Blotting Detection Reagent and a chemiluminescence imager.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}