{
  "id": 3874,
  "origin_website": "Cell",
  "title": "Protocol for RNA-seq library preparation starting from a rare muscle stem cell population or a limited number of mouse embryonic stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMuscle dissection, antibody staining, and flow activated cell sorting (FACS)\nTiming: ∼6 h\n200 MuSCs cells are isolated from skeletal muscle tissue following tissue digestion and FACS protocols.\nThe starting material consists of at least one muscle, such as the tibialis anterior (TA), from one mouse, and can be scaled up to additional muscles and biological replicates. Digestion of one TA muscle is sufficient to obtain 200 MuSCs after the completion of this protocol; however, other hindlimb and forelimb muscles can be included, such as gastrocnemius, soleus, quadriceps, extensor digitorum longus (EDL) and triceps, to isolate higher numbers of MuSCs.\nIn order to obtain an unicellular suspension of skeletal muscle ready for FACS, the muscle tissue is isolated from previously euthanized mice and digested following the protocol described below. The following steps should be performed in a tissue culture hood to avoid contamination.\nDissect muscle tissue with small scissors and collect it in cold Dulbecco’s Modified Eagle Medium (DMEM) with 1% penicillin/streptomycin (P/S) into 50 mL Falcon tubes. Decant muscle into a petri dish and remove DMEM 1% P/S completely. Mince the muscle using small scissors and razor blades until small pieces are achieved and place them into new 50 mL Falcon tubes with the digestion mix, composed by Ham’s F10 medium containing 5 mg/mL of liberase (Roche, #177246), 0.4 mM CaCl2, 5 mM MgCl2 and 0.3% dispase (Gibco, #17105-041). We recommend using 5 mL of digestion buffer per 1 g of initial muscle tissue material, which can be increased up to 10 mL for larger samples (1–2 g) or more fibrotic samples (for example, muscle tissue from very old mice).",
    "Incubate the samples in a shaking water bath at 37°C for 1–2 h. Centrifuge the cells at 50 g for 10 min at 4°C, collect the supernatant and discard the pellet.\nOptional: wash the pellet and collect the supernatant again to improve cells’ recovery.\nConsecutively filter the supernatant through 100 μm and 70 μm strainer filters into new 50 mL Falcon tubes. Following a centrifuging step at 670 g for 15 min at 4°C, remove the supernatant, gently resuspend the cells in 2 mL of lysis buffer (BD Pharm Lyse, #555899) to lyse red blood cells following the manufacturer’s recommendations and incubate for 10 min on ice. Next, add 40 mL of cold FACS buffer, composed by PBS supplemented with 2.5% fetal bovine serum (FBS), filter the sample through a 40 μm strainer filter into new 50 mL Falcon tube and count the cells. Centrifuge at 670 g for 15 min at 4°C, remove the supernatant and resuspend the cells at 1×106 cells/mL concentration in the FACS buffer.\nConsecutively filter the supernatant through 100 μm and 70 μm strainer filters into new 50 mL Falcon tubes. Following a centrifuging step at 670 g for 15 min at 4°C, remove the supernatant, gently resuspend the cells in 2 mL of lysis buffer (BD Pharm Lyse, #555899) to lyse red blood cells following the manufacturer’s recommendations and incubate for 10 min on ice. Next, add 40 mL of cold FACS buffer, composed by PBS supplemented with 2.5% fetal bovine serum (FBS), filter the sample through a 40 μm strainer filter into new 50 mL Falcon tube and count the cells. Centrifuge at 670 g for 15 min at 4°C, remove the supernatant and resuspend the cells at 1×106 cells/mL concentration in the FACS buffer.",
    "Stain the sample with PE-Cy7-conjugated anti-CD45, PE-Cy7-conjugated anti-Sca-1, PE-Cy7-conjugated anti-CD31, Alexa Fluor 647-conjugated anti-CD34 and PE-conjugated anti-ITGA7 antibodies for 30 min on ice, protected from light (see Key Resources Table for details). Finally, wash the cells with 40 mL of cold PBS, centrifuge at 670 g for 15 min at 4°C, remove the supernatant and resuspend the sample in 0.5 mL of cold PBS (add more PBS if digestion yields are >1M of cells). Filter through a test tube with cell strainer cap to eliminate cell aggregates and stain with DAPI (final concentration 1 μg/mL) 5 min prior to FACS (Sousa-Victor et al., 2014[href=https://www.wicell.org#bib4]) (Garcia-Prat et al., 2016[href=https://www.wicell.org#bib1]).\nBased on the relative expression of different markers (in this case CD34 and ITGA7), collect 200 cells of distinct MuSCs populations from the same sample (Garcia-Prat et al., 2020[href=https://www.wicell.org#bib2]). For this purpose, we employ a FACS Aria II sorter (BD) with 4-way purity precision mode that allows simultaneous separation of a maximum of 4 populations. Employ cell granularity (side scatter, SSC-A), cell size (forward scatter, FSC-A) and DAPI staining to exclude cell aggregates, debris, and dead cells. PE-Cy7+ events (corresponding to CD45+, Sca-1+ and CD31+ cells) are used for lineage-negative selection and Alexa Fluor 647+ and PE+ (which identify CD34+ and ITGA7+ populations respectively) for double positive staining of MuSCs (Figure 1[href=https://www.wicell.org#fig1]). Sort MuSCs directly into PCR tubes pre-filled with 10 μl of Reaction buffer to avoid unnecessary transferring steps and loss of material.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/596-Fig1.jpg\nFigure 1. Gating strategy employed to isolated MuSCs by FACS\nReverse transcription of RNA derived from FACS-sorted MuSCs\nTiming: ∼3 h",
    "We employ the Takara “SMART-Seq v4 Ultra Low Input RNA Kit for Sequencing” (Cat. Nos. 634888, 634889, 634890, 634891, 634892, 634893, and 634894) to generate full-length cDNAs directly from 200 FACS-isolated MuSCs. The protocol allows direct cell lysis and retrotranscription without prior RNA extraction.\nNote: The following steps are conducted as described in the TAKARA protocol accompanying the kits with minor changes listed below (Figure 2[href=https://www.wicell.org#fig2]). This is the link to the detailed protocol:\nhttps://www.takarabio.com/a/114896[href=https://www.takarabio.com/a/114896]\nPrepare a stock solution of 10× Reaction Buffer by mixing 19 μL of the 10× Lysis Buffer with 1 μL of the RNase inhibitor.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/596-Fig2.jpg\nFigure 2. Schematic representation of MuSC FACS isolation, direct cell lysis, and cDNA synthesis\nPrepare a solution of 1× Reaction Buffer by mixing nuclease-free water and the 10× Reaction Buffer. Place 10 μL of the 1× Reaction Buffer directly into an individual 0.2 mL RNase-free PCR tube.\nNote: We estimated that the amount of FACS flow buffer coming from droplets with 200 MuSCs leads to approximately 0.4–0.5 μl with 4-way purity precision mode and 85 μm nozzle size, and therefore, adjusted the 1× Reaction Buffer volume accordingly. We recommend running prior tests to determine volume increase resulting from FACS flow buffer to avoid Reaction Buffer dilution. This volume depends on the sorting machine and parameters employed, such as nozzle size and precision mode.\nResuspend stained cells in PBS and directly sort 200 MuSCs into an RNase-free PCR tube with 9 μL of 1× Reaction Buffer.\nNote: Avoid using FBS or other serum, which are usually placed into FACS buffer, during sorting since it may interfere with the following RNA transcription steps.\nIncubate the cell:reaction buffer mix at ∼25°C for 5 min.",
    "Place the samples on ice and add 2 μl of 3′ SMART-Seq CDS Primer II A. Mix by gentle vortexing and then spin the tube(s) briefly to collect the contents at the bottom of the tube.\nNote: Bring the final volume to 12.5 μl by adding additional Nuclease-Free Water if necessary\nIncubate the tubes at 72°C in a preheated, hot-lid thermal cycler for 3 min. Immediately place the samples on ice for 2 min.\nNote: Prepare the First Strand Master Mix\n(See Buffer preparation instructions in the manufacturer’s protocol while the samples are incubating. https://www.takarabio.com/a/114896[href=https://www.takarabio.com/a/114896])\nPreheat the thermal cycler to 42°C.\nAdd 2 μL per reaction, plus 10%, of the SMARTScribe Reverse Transcriptase to the Master Mix.\nNote: Add the reverse transcriptase to the Master Mix just before use, making sure to gently mix the reverse transcriptase tube without vortexing before adding it.\nNote: Mix the Master Mix well by gently vortexing and then spin the tube(s) briefly in a minicentrifuge to collect the contents at the bottom of the tube.\nAdd 7.5 μl of the Master Mix to each reaction tube. Mix the contents of the tubes by gently pipetting and spin them briefly to collect the contents at the bottom of the tubes.\nPlace the tubes in a thermal cycler with a heated lid, preheated to 42°C, and run the following program:\ntable:files/protocols_protocol_596_1.csv\nPause Point: The tubes can be stored at 4°C for 12–18 h.\nThaw all the reagents needed for PCR (except the enzyme) on ice. Gently vortex each reagent tube to mix and spin down briefly. Store on ice.\nPrepare PCR Master Mix combining the following reagents in the order shown:\nAdd 30 μl of PCR Master Mix to each tube containing 20 μL of first-strand cDNA product from step 11.",
    "Place the samples in a preheated thermal cycler with a heated lid and run the following program. Refer to manufacture instructions to determine the optimal number of cycles (N). https://www.takarabio.com/a/114896[href=https://www.takarabio.com/a/114896]\ntable:files/protocols_protocol_596_2.csv\nPause Point: The tubes may be stored at 4°C for 12–18 h.\nPurify the amplified cDNA using the Agencourt AMPure XP Kit (Beckman Coulter, Cat# A63881) according to Takara instructions https://www.takarabio.com/a/114896[href=https://www.takarabio.com/a/114896].\nNote: The appropriate volume ratio of beads/samples is reported in the Takara instructions https://www.takarabio.com/a/114896[href=https://www.takarabio.com/a/114896].\nRNA extraction by TRIzol\nTiming: ∼2 days\nAs an alternative to the Takara SmarterSeq v4 kit, when direct lysis of cells is not possible, we suggest extracting RNA by collecting cells directly in a 1.5 mL Eppendorf tube with 250   μ  l of Trizol. The following protocol has been optimized using mouse embryonic stem (E14 ESCs) (Juan et al., 2016[href=https://www.wicell.org#bib3]).\nThe following protocol allows recovering of sufficient RNA to generate a library from 5,000 to 10,000 cells (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/596-Fig3.jpg\nFigure 3. RNA isolation and retrieval\n(A) Schematic representation of RNA isolation by Trizol.\n(B) Identification of RNA pellet following isopropanol precipitation and centrifugation.\n(C) Residual ethanol to be left following RNA precipitation.\nNote: All the reagents used are certified as DNase and RNase free.\nCritical: Trizol is a phenol-based reagent and must always be used in a biochemical hood. Eyes and skin exposure should be avoided. Follow the safety data sheet when handling Trizol.\nPause Point: Cells can be stored in Trizol at −80°C for long-term storage.\nThaw Trizol samples at ∼25°C, if frozen.\nLet samples stand at ∼25°C for 5–10 min.\nDuring this time, pre-spin the 5PRIME Phase Lock Heavy Gel tubes (QuantaBio, Cat # 2302830) at 1,600 g for 45 sec to collect gel on tube bottoms.",
    "Note: 5PRIME Phase Lock Heavy Gel tubes facilitate the recovery of the aqueous phase and minimize potential carry-over from the the phenol-chloroform phase. Alternatively, the two phases can be separated following the Trizol manifactures’s protocol.\nAdd cells already lysed in Trizol to the 5PRIME Phase Lock Heavy Gel tubes and incubate for 5 min at ∼25°C.\nExamine phasing.\nNote: Clear, aqueous phase should be entirely at the top of the 5PRIME Phase Lock Heavy Gel. The phenol-chloroform phase and cloudy interphase should be below 5PRIME Phase Lock Gel's layer.\nAdd 100 μl Chloroform\nManually invert the tubes 5 times.\nNote: Do not vortex.\nIncubate at ∼25°C for 10 min.\nCentrifuge at 12,000 g at 4°C, for 15 min.\nNote: Examine the Eppendorf tube. A transparent, aqueous phase should be located at the top of the 5PRIME Phase Lock Heavy Gel. The phenol-chloroform phase and a cloudy interphase should both be below the Phase Lock Gel layer.\nCentrifuge at 12,000 g at 4°C for 15 min.\nRecover and transfer the rest of the aqueous phase with a 20 μl pipette.\nCritical: Samples with a high content of fat, protein, polysaccharides, or extracellular material may require additional clean-up steps. (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0016385_TRIzol_Reagent_DNA_Isol_UG.pdf&title=VXNlciBHdWlkZSAtIFRSSXpvbCBSZWFnZW50IC0gRXhwZXJpbWVudGFsIHByb3RvY29sIGZvciBETkEgaXNvbGF0aW9u[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0016385_TRIzol_Reagent_DNA_Isol_UG.pdf&title=VXNlciBHdWlkZSAtIFRSSXpvbCBSZWFnZW50IC0gRXhwZXJpbWVudGFsIHByb3RvY29sIGZ]).\nAdd 10 μg of molecular grade Glycogen (or GlycoBlue).\nAdd 250 μl of molecular grade isopropanol.\nInvert tube 10 times to mix (or vortex on a 'low' setting for 15 sec)\nLet samples precipitate at −20°C for 12–18 h.\nNote: Precipitation can be shortened to 60–90 min, however, for maximum recovery yield we recommend performing this step for 12–18 h.\nCentrifuge at 12,000 g, 4°C, for 30–45 min\nGently discard the supernatant leaving approximately 10–15 μl behind.\nNote: The RNA pellet may detach from the tube and float.",
    "Note: When starting with less than 100,000 cells a pellet cannot be visualized by eye. We suggest removing the tubes from the centrifuge very slowly and identifying the side of the tube where the pellet is located after centrifugation (Figure 3[href=https://www.wicell.org#fig3]B).\nAdd 500 μl of freshly prepared 75% EtOH, mix 10 times by inversion.\nCentrifuge at 7,500 g, 4°C for 5 min.\nGently discard the supernatant leaving approximately 10–15 μl behind without disturbing the pellet.\nNote 1: The RNA pellet may detach from the tube and float.\nNote 2: When starting with less than 100,000 cells a pellet cannot be seen by eye. We suggest removing the tubes from the centrifuge very slowly and identifying the side of the tube where the pellet is located after centrifugation.\nSlowly remove most of the residual EtOH with a p10 pipette leaving 2–5 μl of EtOH (Figure 3[href=https://www.wicell.org#fig3]C).\nAir dry the RNA pellet for about 15–20 min.\nRe-suspend the RNA pellet in 15 μL of RNAse/DNAse free water. Keep the resuspended RNA on ice and immediately proceed to the next step.\nCritical: Remove as much ethanol as possible using a 10 μL pipette before air-drying the pellet for approximately 5 min. Do not over-dry the pellet. Over-drying will decrease RNA solubility. Air-dry the pellet in a clean, RNase-free location.\nProceed with DNase treatment using a commercially available kit. We used the Turbo-DNA free kit from Invitrogen, following manufacturer instructions with no modifications (http://tools.thermofisher.com/content/sfs/manuals/cms_055740.pdf[href=http://tools.thermofisher.com/content/sfs/manuals/cms_055740.pdf]).\nPerform polyadenylation enrichment, cDNA conversion, and fragmentation RNA quality assessment and quantification.\nRNA quantification and quality control\nTiming: ∼30 min\nQuantify the amount of total RNA recovered using a Qubit instrument (See Materials and Equipment section for alternatives)",
    "Note: RNA at this stage can also be quantified by Nanodrop but the limited sensitivity of this instrument leads to imprecise quantification for low amounts of RNA.\nAnalyze the quality of the RNA using a Fragment Analyzer.\nNote: Degraded RNA (RNA integrity number, RIN <7) will decrease the efficiency of cDNA conversion and library preparation.\ncDNA conversion\nTiming: ∼2 h\nFollowing RNA quantification, 10–250   μ  g of RNA is enriched for mRNAs by polyadenylation selection, converted to cDNA, and fragmented.\nThe steps are performed using NEB buffers and enzymes. Currently, all the required reagents are part of the “NEBNext Poly(A) mRNA Magnetic Isolation Module” (E7490) and “NEBNext Ultra II RNA Library Prep Kit for Illumina” (E7770, E7775).\nNote: The following steps are conducted exactly as described in the NEB protocol accompanying the kits. This is the link to the extended protocol:\nhttps://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn\nThe same steps described in the protocol are reported here:\nPrepare First-Strand Reaction Buffer and Random Primer Mix according to manufacture instructions in a nuclease-free microcentrifuge tube. (https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn[href=https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn]).\nNote: Keep the mix on ice until mRNA is purified.\nDilute the total RNA with nuclease-free water to a final volume of 50 μl in a nuclease-free 0.2 mL PCR tube.\nPrepare and wash oligo-dT beads according to manufacturer instructions (https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn[href=https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn])\nAdd 50 μl beads to each RNA sample. Mix thoroughly by pipetting up and down six times.\nIncubate at ∼25°C for 5 min.\nMove the samples onto a magnetic rack to separate the beads and discard the supernatant.\nWash the beads twice according to manufacturer’s instructions (https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn[href=https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn]).\nAdd 50 μl of Tris buffer (provided in NEB #E7490 kit) to each tube. Gently pipette up and down 6 times.\nPlace the tube on the thermocycler with the heated lid set at ≥ 90°C and run the following program:\ntable:files/protocols_protocol_596_3.csv",
    "Note: Remove the tube from the thermocycler only when the temperature reaches 25°C.\nAdd 50 μl of RNA Binding Buffer (2×) to the samples. Mix by gently pipetting up and down six times.\nIncubate the tube at ∼25°C for 5 min.\nPlace the tube on the magnetic rack at ∼25°C until the solution is clear.\nRemove and discard the supernatant from the tube.\nNote: Do not disturb the beads.\nRemove the tube from the magnetic rack.\nWash the beads by adding 200 μl of Wash Buffer. Gently pipette the entire volume up and down 6 times.\nSpin down the tube briefly to collect the liquid from the wall and lid of the tube.\nNote: It is important to spin down the tube to prevent carryover of the Wash Buffer in subsequent steps.\nPlace the tube on the magnet at ∼25°C until the solution is clear (∼2 min).\nRemove and discard all of the supernatants.\nNote: It is important to completely remove the supernatant to successfully fragment the mRNA in the subsequent steps.\nRemove the tube from the magnetic rack.\nAdd 11.5 μl of the First-Strand Synthesis Reaction Buffer and Random Primer Mix, pipette six times to resuspend the beads.\nIncubate the sample in a thermal cycler with the heated lid set at 105°C and run the following program:\ntable:files/protocols_protocol_596_4.csv\nNote: Immediately transfer the tube on ice for 1 min as soon as it is cool enough to handle (∼65°C)\nCollect the fragmented mRNA by transferring 10 μL of the supernatant to a nuclease-free 0.2 mL PCR tube.\nNote: If the volume recovered is less than 10 μl bring the volume up to 10 μL by adding the First-Strand Synthesis Reaction Buffer and Random Primer Mix\nPlace the tube on ice and proceed directly to First Strand cDNA Synthesis.",
    "Add to the samples 8 μL of Nuclease-free Water and 2 μL of NEBNext First-Strand Synthesis Enzyme Mix and pipette up and down 15 times.\nPut the samples in a preheated thermocycler with the heated lid set at ≥ 80°C and run the following program:\ntable:files/protocols_protocol_596_5.csv\nImmediately perform Second Strand cDNA Synthesis.\nNote: Assemble the second strand cDNA synthesis reaction on ice.\nAdd to the samples 8μL of “NEBNext Second Strand Synthesis Reaction Buffer” and 48 μL of Nuclease-free Water. Mix by pipetting the reaction up and down 15 times.\nPut the samples in a thermocycler set for 1 h at 16°C with the heated lid at ≤ 40°C (or off).\nPurify the obtained cDNAs using SPRIselect Beads according to NEB instructions (https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn[href=https://international.neb.com/protocols/2017/03/04/protocol-for-use-with-nebnext-poly-a-mrna-magnetic-isolation-module-e7490-and-nebnext-ultra-ii-rn]).\nLibrary preparation\nTiming: ∼3 h\ncDNAs synthesized following “SMART-Seq v4 Ultra Low Input RNA Kit for Sequencing” are quantified by Qubit or Picogreen and further converted into a library using the “NEBNext Ultra II DNA library prep for Illumina” kit (New England Biolabs, E7645L) following manufacturer’s instructions (https://www.neb.com//media/nebus/files/manuals/manuale7645.pdf?rev=8b4c7f67ccca4b4a805ceed982ef49b6[href=https://www.neb.com//media/nebus/files/manuals/manuale7645.pdf?rev=8b4c7f67ccca4b4a805ceed982ef49b6]).\nAdapters are diluted 25 times and 9 cycles of PCR are used for libraries amplification.\nmRNAs enriched by polyadenylation selection (step 42, RNA Extraction by Trizol) are converted to cDNA, and fragmented using NEB buffers and enzymes included in the “NEBNext Ultra II RNA Library Prep Kit for Illumina” (E7770, E7775).\nThe final libraries are quantified by Picogreen (Invitrogen) and size distribution is determined on a Fragment Analyzer.\nSequencing\nTiming: ∼18–20 h\nLibraries are equalized to the same molarity and pooled for sequencing on a NextSeq500 (Illumina) or NovaSeq3000 (Illumina). Following ENCODE’s recommendations, samples are sequenced at a depth of ∼40 M reads/sample. Libraries are also compatible with sequencing on other Illumina instruments with minor adjustments during library preparation as described in the manufactured protocols (https://www.neb.com/-/media/nebus/files/manuals/manuale7645.pdf?rev=8b4c7f67ccca4b4a805ceed982ef49b6[href=https://www.neb.com/-/media/nebus/files/manuals/manuale7645.pdf?rev=8b4c7f67ccca4b4a805ceed982ef49b6])."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Stem Cells",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Differentiation",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}