{
  "id": 16443,
  "origin_website": "Jove",
  "title": "Evaluation of the Cognitive Performance of Hypertensive Patients with Silent Cerebrovascular Lesions",
  "procedures": [
    "The study protocol was approved by the Institutional Review Board of the University of Hong Kong / Hospital Authority Hong Kong West Cluster (HKU/HA HKW IRB) for human research.\n1. Participants\nRecruit otherwise healthy elderly Chinese subjects (from 65 to 99 years old, mean age 72) with a history of hypertension for at least 5 years.\nExclude participants with any disease affecting the cognitive function and/or with any disability hindering the completion of the required assessment, including but not limited to stroke, dementia, encephalitis, depression, diabetes mellitus and coronary heart diseases.\nInform the participant of the scope of the study before obtaining the written consent.\n2. Neuropsychological assessment\nArrange an interview for each participant to administer a battery of neuropsychological tests focusing on six cognitive domains (Table 1) and to collect the demographic and clinical data. Review the participant's medical records to ensure the reliability of relevant information.\nForward/Backward digit span tests\n\t\nPrepare groups of random digit sequences of increasing length (Figure 1A). Start with a three-digit sequence. Read out the digit sequence aloud at a rate of one digit per second. Ask the participant to immediately recall the digit sequence verbally in the Forward digit span test10.\nHave the participant recall progressively longer digit sequences with one more digit each time the participant has successfully recalled the digit sequence without any error.\nGive a different digit sequence of the same length if the participant has failed in the first trial of a specific length. End the test if the participant has failed again. Discontinue the test also when the participant has failed up to three times in total.\nRecord the longest length of the digit sequence the participant has successfully recalled without any error.",
    "Start with a three-digit sequence and ask the participant to recall the digit sequence in a reverse order in the Backward digit span test. Follow the steps of Forward digit span test otherwise.\nMoCA\n\t\nAdminister MoCA using the validated version. Use the Cantonese version to measure global cognitive function in our protocol and to construct compound domain scores11,12.\nMoCA verbal learning task: Read five words from different categories (imgsrc://cloudfront.jove.com/files/ftp_upload/61017/61017char1.jpg as Chinese characters for face, cloth, church, daisy and red color in our protocol, respectively) to the participant. Ask the participant to immediately recall the words. Repeat the reading and immediate recall a second time. Remind the participant about a delayed recall 5 minutes later. Assign one point to each correct word during the delayed recall.\nMoCA naming task: Show pictures of three animals (lion, rhinoceros and camel in our protocol) and ask the participant to tell their names. Assign one point to each correct name.\nMoCA repetition task: Read a simple sentence to the participant and ask the participant to immediately repeat it. Repeat the procedure with a more complex sentence. Assign one point to each correct repetition.\nMoCA drawing a cube task: Ask the participant to copy a cube printed on a sheet of paper in nearby blank space. Assign one point if the cube is copied correctly.\nMoCA drawing a clock task: Ask the participant to draw a clock face with time at 11:10. Assign one point each for accurate completion of the clock face, numbers and pointers, respectively.\nStroop test\n\t\nUse the Chinese Translated Victoria Version of the Stroop test in our protocol13.",
    "Inform the participant to finish three sessions each with 24 stimuli printed in four different colors in 6 rows within a sheet of paper (Figure 1B). Start with dots (color naming subtask), next with four Chinese characters (of meaning not related to any color; neutral color subtask), and finally with four Chinese characters (of meaning related to a color but in another color different from their meaning, e.g., imgsrc://cloudfront.jove.com/files/ftp_upload/61017/61017char2.jpg as a Chinese character for \"red\" printed in green; interference subtask). Remind the participant to name the color of the printed stimuli (i.e., green, blue, yellow or red) and disregard their meaning.\nAllow the participant to use the first 4 stimuli in each session as a practice to ensure a full understanding of the rules. Point out any error during the practice stage and encourage the participant to correctly name the color.\nRemind and encourage the participant to complete the remaining 20 stimuli as quickly and accurately as possible. Record the time used by the participant to complete each session (excluding the practice stage).\nSDMT\n\t\nPair 1 to 9 digits in the numeric order with nine unassociated symbols14.\nPrint a list of the nine symbols in a random order without the corresponding digits (Figure 1C). Ask the participant to fill in the blank with the correctly paired digit below each symbol. Allow the participant to check back and forth the printed pairs for reference at any time of the test.\nAllow the participant to try filling the first 10 blanks as a practice to ensure a full understanding of the rules. Point out any error during the practice stage and encourage the participant to be correct.",
    "Remind and encourage the participant to fill in the blank as quickly and accurately as possible in the next 90 seconds. Record the number of correct responses in the written-SDMT.\nContinue the test but ask the participant to provide the correctly paired digit verbally. Record the number of correct responses in the oral-SDMT.\nVerbal fluency\n\t\nAsk the participant to provide a verbal list of names belonged to each of the three categories (i.e., animals, vegetables and fruits) separately in one minute for each category15.\nRecord the total number of names for each category.\n3. MRI acquisition and Visual rating of SCLs on MRI\nPerform a multi-sequence 3-Tesla MRI scanning for the participant using the parameters and including the sequences summarized in Table 2. Complete the MRI scanning within one month of the neuropsychological assessment.\nIdentify and visually rate SCLs on MRI according to standard criteria by experienced raters in an anonymous manner. Ensure good intra- and inter-rater reliability.\nUse T1-weighted and fluid-attenuated inversion recovery (FLAIR) images to identify SLs (as hypointense foci of 2-15 mm diameter on both sequences, usually with a hyperintence rim on FLAIR images) and their locations (Figure 2A). Re-confirm the SLs on T2-weighted images (as hyperintense foci at the same locations).\n\t\nSearch all brain regions in a pre-specified order from anterior to posterior and from one side to the other to avoid any omission (i.e., starting from frontal lobe, island lobe, basal ganglion, thalamus, temporal lobe, parietal lobe, occipital lobe, cerebellum and finally to brain stem, and starting from the left side and then to the right side).",
    "Use susceptibility-weighted imaging (SWI) to identify CMBs (as punctuate or small round/oval hypointense foci of 2-10 mm diameter) and their locations (Figure 2B). Divide the whole brain region into 7 anatomical locations (i.e., cortex and grey-white junction, subcortical white matter, basal ganglia grey matter, internal and external capsule, thalamus, brain stem and cerebellum) according to the Brain Observer MicroBleed Scale (BOMBS)16.\nLabel SLs and CMBs as strictly lobar SLs and CMBs, respectively, when they are confined to the lobar white matter. Label them as deep SLs and CMBs, respectively, when deep or infratentorial lesions are observed with and without additional lobar lesions17,18.\nUse T2-weighted and FLAIR images to identify WMHs (bilateral, almost symmetrical hyperintense areas) (Figure 2C). Re-confirm WMHs on T1-weighted images (as isointense or hypointense areas at the same locations). Recognize PVHs and DWMHs separately. Use the Fazekas scale to rate the severity of WMHs19.\nRate PVHs appearing as \"caps\" or pencil-thin lining, smooth \"halo\" and irregular signal extending into the deep white matter as grade 1, 2 and 3, respectively. Rate DWMHs appearing as punctate foci, small confluent areas and large confluent areas as grade 1, 2 and 3, respectively.\n4. Statistical analysis\nPerform all analyses using the statistical package SPSS 22.0 for MacBook.\nTransform the participant's score for each test using z transformation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61017/61017eq1.jpg\nInvert the Stroop test scores so that a higher score represents better performance.\nCalculate a compound score for each cognitive domain by averaging the mean z score of all component tests under the same domain8,9:\nThe compound score for executive function = (z score of backward digit span + z score of Stroop interference + z score of verbal fluency) / 3",
    "Use linear regression models to explore the association between each type of SCLs and cognitive function, adjusting for age, sex, and educational level. Perform further analyses after adjusting for vascular risk factors if significant associations are identified.\nConduct additional analyses after further adjustment for the other types of SCLs in order to assess the independence of the association between the load of a specific type of SCLs and cognition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}