{
  "id": 1701,
  "origin_website": "Cell",
  "title": "Convenient Protocol for Production and Purification of Clostridioides difficile Spores for Germination Studies",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\ntable:files/protocols_protocol_116_1.csv\nNote: Taurocholic acid and L-cysteine are separately sterilized by passage through Millipore 0.2 μm filters and added to autoclaved medium cooled to approximately 65°C. Plates are stored at 4°C for up to 2 months.\ntable:files/protocols_protocol_116_2.csv\nNote: See Fimlaid et al. (2013)[href=https://www.wicell.org#bib2] for details on 70:30 medium\nNote: L-cysteine is sterilized by passage through a 0.2 μm Millipore filter and added to autoclaved medium cooled to approximately 65°C. Plates are stored at 4°C for up to 1 week.\nIsolation of Single Colonies from C. difficile Spores\nTiming: 1 h\nC. difficile spores are germinated on BHI+TCA plates to provide single colonies of vegetative cells.\nCritical: All plates must be pre-reduced in an anaerobic environment, such as that provided by a BD GasPak™ EZ Incubation System containing a GasPak™ anerobic sachet, for at least 2 h prior to use. See Before You Begin[href=https://www.wicell.org#before-you-begin] section for complete details.\nNote, if starting from frozen C. difficile spore stocks (Sorg and Dineen, 2009[href=https://www.wicell.org#bib4]), follow steps 1–3; for liquid stock, follow steps 4–7.\nIn an anaerobic environment, place approximately 20 μL of frozen spore stock on BHI+TCA plate with a sterile inoculating loop.\nStreak plates for single colony isolation.\nIncubate plates anaerobically at 37°C for 1 to 2 days.\nAlternatives: from liquid C. difficile spore stock\nPrepare a 1:10 dilution of spore stock in sterile ddH2O (final volume will depend on how many plates will be streaked).\nHeat spores in a water bath at 65°C for 20 min to prepare spores for germination.\nVortex heated spore dilution.\nIn an anaerobic environment, pipette 20 μL of heated spore stock dilution onto BHI+TCA plates.\nStreak for isolation of single colonies with a sterile inoculating loop.\nIncubate plates anaerobically at 37°C for 1–2 days.",
    "Note: Excessive heat will lead to degradation of the spore coat, resulting in decreased germination. Do not let water bath exceed 65°C to prevent destroying spores.\nNote: This method also works well when using frozen vegetative stock cultures.\nNote: For best results use a C. difficile strain known to be an efficient spore former. The C. difficile strain ATCC 1382 can be used as a positive control during experimentation.\nNote: C. difficile spores are hydrophobic and anionic and will adhere to plastic surfaces such as pipette tips and microcentrifuge tubes. To retain as many spores as possible, vortex before pipetting, and pipette up and down several times when transferring spores or making dilutions. Store spores in glass vials or tubes to minimize adhesion.\nNote: To achieve an anerobic environment while working with spore cultures, a Spilfyter® bag is flushed with N2 several times, filled with N2 and sealed. All materials necessary are placed inside the bag before flushing with N2. Plates are incubated anaerobically in a BD GasPak™ EZ Anaerobic Container System with an anaerobic atmosphere created by using a GasPak™ EZ Anaerobic Sachet.\nSporulation of C. difficile Vegetative Cells\nTiming: 1 h\nA single vegetative C. difficile colony is streaked onto a 70:30 sporulation plate and incubated anaerobically to encourage vegetative cells to sporulate.\nCritical: All plates must be pre-reduced in an anaerobic environment, such as that provided by a BD GasPak™ EZ Incubation System containing a GasPak™ anerobic sachet, for at least 2 h prior to use. See Before You Begin[href=https://www.wicell.org#before-you-begin] section for complete details.\nIn an anaerobic environment, using a sterile inoculating loop, pick one vegetative colony from the BHI+TCA plate and transfer to a 70:30 sporulation plate.\nStreak the colony down the center of the plate.",
    "Spread the colony for confluent growth over the entirety of the plate with a sterile inoculating loop.\nIncubate plates anaerobically at 37°C for 4–5 days.\nNote: In our hands, most strains produce more spores on 70:30 sporulation medium than on BHI medium plates.\nNote: Strains do not need to be precultured in liquid medium prior to inoculation onto 70:30 sporulation medium. A single colony from a BHIS+TCA plate can be transferred to sporulation plate and spread-inoculated for confluent growth.\nNote: Different strains will require different incubation times on the 70:30 plates for optimal spore production.\nNote: Three 70:30 sporulation plates generally produce ~ 1 mL of final purified spore preparation containing 1 × 109 to 4 × 109 spores/mL, depending on the strain.\nNote: Sporulation of cells after growth on 70:30 (or other) medium can be directly assessed by examination of cells via phase contrast microscopy. Cells do not need to be immobilized prior to examination.\nHarvesting C. difficile Spores from Sporulation Plates\nTiming: 1–2 h\nSpores are scraped from the surface of a 70:30 sporulation plates and incubated at 4°C to encourage spore release from mother cells.\nNote: At this point, vegetative cells have sporulated and spores can be exposed to an aerobic environment. Continue work in a BSL2 Safety Cabinet using aseptic techniques.\nPipette 1.5 mL sterile ddH2O onto the surface of the 70:30 sporulation plate containing confluent cell growth.\nUsing a sterile inoculating loop, scrape cell debris and spores free from surface of plate.\nTilt plate to one side to collect suspended spore suspension and cell debris.\nPipette solution with cell debris and spores into a sterile 1.5 mL microcentrifuge tube.\nVortex to resuspend.\nRepeat steps 12–16 for each 70:30 sporulation plate used.",
    "Incubate at 4°C for 24 h up to 1 week to facilitate spore release from mother cells.\nNote: Cells do not need to be incubated at −20°C in step 18 to release spores.\nNote: Centrifugation and washing of spores in ice-cold ddH2O before incubation at 4°C can result in the spores clumping together.\nNote: The use of ethanol (final concentration = 47.5%) to kill or lyse vegetative cells is described in previously published protocols. At this stage, ethanol treatment will not significantly increase numbers of isolated spores and will result in cell clumping and production of excessive cell debris, limiting spore recovery. The ethanol step should not be used if a sucrose gradient is used for purification (see below).\nNote: Different C. difficile strains sporulate to different degrees. To determine the degree of sporulation in a strain, enumerate spores before purification with sucrose gradient.\nIsolation and Purification of C. difficile Spores\nTiming: 3–4 h\nUse of a density gradient to remove cell debris and vegetative cells and retain spores. Spore pellet is washed to remove sucrose.\nNote: The following steps can continue be done aerobically because the spores are aerotolerant.\nNote: Work in a BSL2 safety cabinet using aseptic technique.\nPre-cool the swinging bucket rotor to 4°C in the centrifuge instrument.\nFill 15 mL conical tubes with 10 mL 50% (w/v) sucrose solution.\nRemove 1.5 mL microcentrifuge tubes with spores and cell debris from 4°C storage and vortex to resuspend.\nNote: Do not wash spores in ice-cold ddH2O before or after sucrose gradient centrifugation.\nUsing a pipette, carefully layer about 1.5 mL of spore prep onto the top of the 10 mL of 50% w/v sucrose solution in the 15 mL conical tubes.",
    "Three tubes containing spore preps can be combined and 1.5 mL applied to each of two 15 mL conical tubes containing sucrose solution.\nCentrifuge 15 mL conical tubes at 3,600 rpm for 20 min to separate the cell debris from the spores. The cell debris will remain at the top of the 50% w/v sucrose suspension, while the heavier spores will form a pellet at the bottom of the conical tube.\nCarefully pipette upper cell debris layer on top of the sucrose solution and at the interface.\nUse a pipettor to remove the remaining sucrose solution without disturbing the spore pellet at the bottom of the conical tube.\nResuspend the spore pellet in 500 μL sterile room temperature ddH2O in the 15 mL conical tubes.\nCombine resuspended spore pellets from two 15 mL conical tubes into one 1.5 mL microcentrifuge tube and vortex.\nPlace 1.5 mL tubes in microcentrifuge and centrifuge 14,000 × g for 5 min at room temperature.\nRemove supernatant with pipette, resuspend spore pellet in 1 mL sterile ddH2O, and vortex.\nNote: If spore pellet is difficult to resuspend, pipette up and down to encourage resuspension. Only use room temperature sterile ddH2O, use of ice-cold water can make the pellet difficult to resuspend.\nCentrifuge at 14,000 × g for 5 min.\nWash pellet as described above for a total of 5 washes.\nAfter the final wash, resuspend spore pellet to a final volume of 1 mL with sterile ddH2O.\nStore purified spore preparation at 4°C in a glass vial.\nDirect Enumeration of Spores\nTiming: 1 h\nA phase contrast microscope is used to enumerate and determine purity of spore preparation (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/116-Fig1.jpg\nFigure 1. Image of Partially Purified Spores from C. difficle Strain RPRE2",
    "Light micrograph produced on a Zeiss Standard 15 microscope by using phase contrast microscopy. Each side of the small squares (in Neubauer ruling) is μm in length. The entire image was slightly darkened to enhance contrast for printing.\nNote: If there are too many spores to count in a 1:10 dilution, further dilute and adjust calculations accordingly.\nNote: If clumps of spores are seen via phase contrast microscopy, add 1% BSA in PBS as indicated in the Troubleshooting[href=https://www.wicell.org#troubleshooting] section below. Diluting in PBS alone may also help with the aggregation issue.\nMake a 1:10 dilution of spores in sterile ddH2O.\nVortex to distribute spores.\nPlace 5 μL of dilution on a Petroff-Hauser counting chamber (depth 0.02 mm).\nPlace a drop of immersion oil on top of the cover slip.\nUsing phase contrast microscopy and 100× magnification lens, count spores, vegetative cells, and spores in mother cells.\nSpores will be small, phase-bright rods, vegetative cells will be long, phase-dark rods, and spores in mother cells with be rods with a bright oval at the end.\nCalculate spores per mL:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/116-Si1.jpg\nCalculate spore preparation purity\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/116-Si2.jpg\nEnumeration of Viable Spores\nTiming: 2 h\nTo determine the number of viable spores per mL of spore stock.\nNote: Dilution factors for spore stocks depend on the viability and number of spores. Countable plates contain between 30 and 300 colonies. Plating a range of dilutions is necessary to obtain countable plates.\nNote: BHI+TCA plates must be pre-reduced in an anaerobic environment such as a BD GasPak™ EZ Incubation System containing a GasPak™ anerobic sachet for at least 2 hr prior to use.",
    "Note: To achieve an anerobic environment while working with cultures spores, a Spilfyter® bag is flushed with N2 several times, filled with N2 and sealed. All materials necessary are placed inside the bag before flushing with N2. Plates are incubated anaerobically in a BD GasPak™ EZ Anaerobic Container System with an anaerobic atmosphere created by using a GasPak™ EZ Anaerobic Sachet.\nMake serial dilutions of spore stock in sterile ddH2O in 1.5 mL microcentrifuge tubes.\n10−1, 10−2, 10−3, etc.\nHeat the centrifuge tubes containing spore dilutions in a water bath at 65°C for 20 min.\nIn an anaerobic environment, plate 100 μL of spore dilution on reduced BHI + TCA plates and spread evenly over the entirety of the plate with a sterile inoculating loop.\nIncubate anaerobically at 37°C for 1–2 days.\nCount the number of colonies on plates that have between 30 and 300 colonies.\nDetermine the number of colony forming units (CFUs):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/116-Si3.jpg"
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cell Isolation",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}