{
  "id": 5368,
  "origin_website": "Bio",
  "title": "Enriching Acidophilic Fe(II)-oxidizing Bacteria in No-flow, Fed-batch Systems",
  "procedures": [
    "Sediments are collected from the bottom of pools along the anoxic Fe(II)-rich artesian AMD flow paths. Sediments are collected downstream of the artesian discharges where the AMD have become well aerated (Figure 1A). Sediments are collected by carefully cutting and prying out intact pieces from the top 2 cm of the stream bed (Figure 1B). These samples are preserved in sterile plastic containers closed with lids, transported to the lab with dry ice, and stored in the 4 °C refrigerator for no longer than one week before use.Water is collected for microbial enrichments (Figure 1C). Water is collected from the anoxic artesian springs into acid washed plastic containers (completely filled with little or no headspace). Polypropylene carboys ranging in size from 12-40 L are used to transport the water to the lab. Immediately upon arrival to the lab, all water is filtered (0.45 μm sterile bottle-top filters) into plastic containers, purged with N2, wrapped in Al foil, and stored at 4 °C. Water is stored for no longer than one week before use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170204/20170204022102_7063.jpgFigure 1. Photographs of a typical Fe(II)-rich artesian AMD site (A), sediment collection (B) and water collection (C)To develop enrichment cultures, 100 g of moist sediment is mixed with 1 L of 0.1% (m/v) sodium pyrophosphate (adjusted to pH of natural AMD water with sulfuric acid) in a sterile bottle (Figure 2A). For 30 min, this mixture is stirred at 400 rpm on a magnetic stirrer to separate cells from the sediment. The suspension is allowed to settle for 30 min and then 900 ml of the cell-containing supernatant is poured into a sterile 3 L chemostat reactor vessel (Eppendorf BioFlo®/Celligen® 115 fermentor) (Figure 2B). The reactor vessel is able to accommodate the low pH values (2 < pH < 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170204/20170204022135_4664.jpgFigure 2.",
    "Photographs of enriching natural-occurring sediment microbes in a sterile chemostat reactor vessel. A. Cell separation step; B. Bioreactor vessel; C. Bioreactor in use.The volume of the liquid in the chemostat reactor vessel is increased to 2 L by adding filtered (0.45-μm) site AMD water (Figure 2C).The chemostat is then operated in a no-flow, fed-batch mode for 4 to 6 weeks. Automated control components of the bioreactors maintained a constant pH, temperature and mixing speed, and continuously recorded dissolved oxygen. Feedback controls between the pH meter in the reactor and two peristaltic pumps delivering either 0.1 M H2SO4 or 0.2 N NaOH are used to maintain any desired pH set-point (Figure 3). A one-pass, tap water-fed, cooling coil within the reactor and a thermal jacket around the reactor are used to maintain the reactor temperature. Air is continuously pumped into the bottom of the reactor vessel to assure unlimited dissolved oxygen. During the enrichment period the pH set-point of the chemostat is same to the field water, the stirring rate is 50 rpm, the temperature is 20 °C and dissolved oxygen is unlimited (e.g., > 3 mg/L) (Sheng et al., 2016). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170204/20170204022220_6597.jpgFigure 3. Photograph of bioreactor system including feedback system, peristaltic pumps and stirrerFerrous sulfate (FeSO4·7H2O) is discontinuously added to the reactor as the primary substrate to enrich for autotrophic Fe(II)-oxidizing microbes. Ferrous sulfate is added to yield 300 mg L-1 dissolved [Fe(II)] and added whenever the dissolved [Fe(II)] decreases below 30 mg L-1. After Fe(II) oxidation and total Fe removal rate have reached a pseudo-steady state condition (within ± 5% standard deviation), biofilms containing abundant Fe(II)-oxidizing microbial communities are clearly and evenly attached to the reactor wall (Figure 2C).",
    "After less than a month, the enrichment cultures required daily doses of Fe(II) because the microorganisms are oxidizing the Fe(II) at a fast rate.SamplingSamples for Fe(II) measurement are collected at the top of the liquid level inside the reactor vessel using sterile pipette. An unused port in the top of the vessel closed with a screw cap can be opened to take the sample. A total of 2 ml water is collected each time for Fe(II) and total Fe measurement. Dissolved Fe(II) and dissolved total Fe(T) (after reduction by hydroxylamine-HCl) are determined using the ferrozine assay (1 g/L ferrozine in 50 mM HEPES [pH 7.0]) with samples preserved with 0.1 N HCl (Stookey, 1970). The frequency of the sampling depends on the rates of Fe(II) oxidation. The bioreactor has to be sampled daily for the first two weeks and less often after. Biofilm samples are collected from the reactor wall and water samples are collected from the suspension to determine the biomass concentrations. The lid of the reactor vessel is opened and water is poured into a sterile container. After using sterile pipet to scrape the biofilm from the reactor wall, the water is poured back to the reactor vessel with closed lid. Biomass concentrations are determined based on protein (Bio-Rad Protein Assay Kit that uses Coomassie® Brilliant Blue G-250 dye). An area of at least 1 cm2 of biofilm is scraped from the wall of the reactor to use for the protein assay. A ruler is used as reference substance (Figure 4). Photographs of the scraped zone are used with Adobe® Photoshop® software to determine the exact area that is removed each time. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170204/20170204022304_8078.jpgFigure 4.",
    "Exemplary Photographs of the scraped biofilm using a ruler as reference substance for area calculationThe collected biofilm is dissolved in 3 ml of 10% (w/v) oxalic acid. Once dissolved, the cells are lysed by placing 1 ml of this mix with 2 ml of 0.2 N NaOH, and then performing two freeze-thaw cycles on the sample in a -20 °C freezer for at least 6 h and 37 °C water bath for about 10-15 min. The protein colorimetric assay is then performed using the mixture containing the lysed cells. For the suspension, 135 ml of reactor liquid is centrifuged (13,000 x g for 10 min) to pelletize the cells. The masses of the Falcon® tubes used for centrifugation are measured before and after to determine the mass of each pellet. The liquid is then decanted and the cell pellet is analyzed exactly as the scraped cells described above."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}