{
  "id": 9929,
  "origin_website": "Jove",
  "title": "Examining Proteasome Assembly with Recombinant Archaeal Proteasomes and Nondenaturing PAGE:  The Case for a Combined Approach",
  "procedures": [
    "1. Bacterial Expression.\nNote: Expression plasmids used in this study are described in Table 1. Solutions, media, and buffers used in this study are described in Table 2. The cloning of archaeal proteasome subunit genes and the generation of expression plasmids are described elsewhere18,20. In brief, plasmids for recombinant coexpression of subunits employ a bicistronic operon strategy which helps in obtaining comparable expression levels of individual subunits18,20. The expression parameters listed below were empirically determined to be optimal for the proteasome subunits in this study. It may be necessary to optimize expression for other proteasome mutants, for proteasomes from other archaeal species, or for other recombinant protein complexes (see Discussion).\nTransform expression plasmid of interest into chemically competent E.coli BL21(DE3) cells.\nAdd 1 - 2 μL of plasmid (typically 50 - 100 ng) to an aliquot of DE3 cells that were freshly thawed on ice, and continue to incubate on ice for 20 min.\nHeat shock the cells at 42 °C for 45 s and return tube to ice for additionl 2 min.\nAdd 1 mL of LB medium and incubate at 37 °C with shaking (150 rpm) for 1 h.\nSpread 100 - 200 μL of the transformation mixture onto LB-kan plates (plates containing solid LB media, supplemented with kanamycin (all plasmids used in this study encode resistance to this antibiotic)). Incubate plates at 37 ºC O/N.\nNext morning, inoculate a single colony from the LB-kan plate into 3 mL of liquid LB-kan media in a glass culture tube. Incubate at 37 ºC with shaking (150 rpm) for approximately 2.5 - 3 h, or till turbidity is observed.",
    "Measure the optical density of the culture at 600 nm (OD600) in a spectrophotometer. Dilute the cell culture with an appropriate amount of prewarmed LB-kan media to an OD600 of 0.4 in a final volume of 6 mL. Resume shaking at 37 ºC for 40 min.\nInduce protein expression in the liquid cultures by adding IPTG from a stock solution to a final concentration of 1 mM. Incubate at 37 ºC with shaking (150 rpm) for approximately 6 - 7 h.\nHarvest bacterial cell cultures in their entirety into 1.5 mL microcentrifuge tubes.\nAdd 1.5 mL of a culture into microcentrifuge tube. Centrifuge at 10,000 × g for 1 min.\nDiscard the supernatant and add another 1.5 mL of the same culture to the pellet. Centrifuge at 10,000 × g for 1 min.\nRepeat step 1.11 until the entire culture is harvested into the microcentrifuge tube.\nStore the induced pellets at -80 °C until lysis.\n2. Bacterial Lysis and Lysate Mixing.\nNote: For samples studied via coexpression, follow section 2.1 (and its subsections). For samples requiring lysate mixing, follow section 2.2 (and its subsections). The TSP (Total, Soluble, Pellet) analysis that is included in the protocol is useful in optimizing protein expression which can help ensure that approximately equal amounts of α and β subunits are combined during lysate mixing (see Discussion). It also provides an important control if downstream results are not as expected (i.e. it verifies that protein was expressed and soluble). Thus, we highly recommend including TSP analysis initially. Once an optimal protocol has been achieved for a particular subunit combination, TSP analysis is not strictly required which is why it is described as optional below.\nLysis of bacterial cells and preparation of soluble fractions.",
    "Thaw the induced cell pellet on ice for 5 min. Resuspend the pellet in 600 µL of lysis buffer.\nIncubate the suspension at 30 ºC with shaking (150 rpm) for 30 min to generate total crude lysate.\nNote: The following step and the subsection that follows are optional.\nRemove two 25 μL aliquots from the total crude lysate into separate 1.5 mL microcentrifuge tubes and carry out TSP analysis as follows.\n\t\t\nTo one of the two 25 μL aliquots, add 5X SDS sample buffer to a final concentration of 1X. Label the tube with \"T\" for \"total crude lysate\".\nIncubate the \"T\" sample at 100 ºC for 5 min to completely denature proteins.\nMeanwhile, take the second 25 μL aliquot and centrifuge it at 10,000 × g for 10 min. Carefully remove the supernatant without disturbing the tiny pellet, and transfer it to a new 1.5 mL microcentrifuge tube. Label this new tube \"S\" for \"soluble fraction\".\nTo the tiny pellet left behind in the previous step, add 25 μL of lysis buffer and vortex to resuspend. Label this tube \"P\" for \"pellet fraction\".\nAdd 6 μL of 5X SDS sample buffer to the \"S\" and \"P\" tubes and incubate at 100 ºC as described above.\nNote: If the TSP samples will not be used that day to analyze expression, they may be frozen at -20 ºC until needed. Once thawed, they must be reincubated at 100 ºC, as described above, immediately prior to loading on a 12% and/or 15% standard SDS-PAGE gel.",
    "While the TSP analysis is carried out, centrifuge the remaining 550 μL of total crude lysate (or the entire 600 μL of total crude lysate if TSP analysis is not carried out) at 10,000 × g for 10 min. Collect the supernatant in a fresh 1.5 mL microcentrifuge tube. This is the soluble lysate that will be used for purification.\nLysate mixing.\n\t\nCarry out lysis as described in steps 2.1.1 and 2.1.2 above.\nMix 600 µL of total crude lysate from bacteria expressing the desired α subunit with 600 µL of total crude lysate from bacteria expressing the desired β subunit. Incubate at 37 ºC with slow shaking for 30 min.\nNote: It may be necessary to optimize incubation time to achieve maximum assembly during lysate mixing (see Discussion). The time and temperature presented here are optimal for the recombinant proteins in this study and were determined elsewhere18.\nCentrifuge the mixed lysate at 10,000 × g for 10 min to separate soluble material from insoluble pellet. Transfer the supernatant to a new 1.5 mL microcentrifuge tube. Use this mixed soluble lysate for protein purification.\n3. Protein Purification via Immobilized Cobalt Affinity Resin (ICAR).\nEquilibrate the resin.\n\t\nThoroughly resuspend the resin by inverting the bottle and transfer 50 µL of the slurry to a 1.5 mL microcentrifuge tube. Centrifuge at 700 × g for 2 min to pellet resin. Carefully aspirate supernatant.\nNote: We carry out pipette aspiration using a blue 1 mL pipette tip to remove the bulk of the liquid. A white 2 μL tip is used for fine control of removal of the remaining supernatant, leaving a very thin layer of liquid covering the beads.",
    "Add 1 mL of Buffer A. Mix gently to resuspend resin and centrifuge at 700 × g for 2 min to pellet resin. Carefully aspirate the supernatant and repeat this wash step one more time.\nApply soluble lysate obtained previously in section 2.1 or 2.2 to the equilibrated resin. Incubate the tube with gentle rotation at 4 ºC for 60 min. Centrifuge the tube at 700 × g for 5 min and carefully aspirate the supernatant.\nWash the resin as follows to remove nonspecifically bound proteins.\n\t\nResuspend resin with 1 mL of Buffer A and incubate with gentle rocking at 4 ºC for 10 min. Centrifuge the tube at 700 × g for 5 min and carefully aspirate the supernatant. Repeat this wash step one more time.\nResuspend resin with 1 mL of Buffer B (Buffer A with 5 mM Imidazole) and incubate with gentle rocking at 4 ºC for 5 min. Centrifuge the tube at 700 × g for 5 min and carefully aspirate the supernatant. Repeat this wash step one more time.\nResuspend resin with 1 mL of Buffer C (Buffer A with 10 mM Imidazole) and incubate with gentle rocking at 4 ºC for 5 min. Centrifuge the tube at 700 × g for 5 min and carefully aspirate the supernatant.\nElute the protein by adding 400 µL of Buffer E (Buffer A with 200 mM Imidazole) to the resin. Incubate with gentle rocking at 4 ºC for 5 min. Centrifuge at 700 × g for 5 min.\nTransfer supernatant containing purified protein to a new 1.5 mL centrifuge tube.\nDesalt the purified protein by serial centrifugation as follows.",
    "To 400 μL of purified protein, add 100 μL Buffer A (this reduces Imidazole concentration from 200 mM to 160 mM). Apply purified protein to 0.5 mL ultracentrifugal filters with a 10 kDa molecular weight cut-off. Centrifuge at 14,000 × g for 5 min.\nDiscard the filtrate and add 400 μL Buffer A to dilute the retentate and centrifuge again. Continue the cycles of centrifugation/dilution until imidazole concentration falls below 4 mM. As an example, if each centrifugation concentrates 500 μl down to ~70 μl (or approximately 7-fold), then two cycles will reduce the starting 160 mM imidazole concentration (7×7 = 49-fold) to approximately 3.3 mM.\nMeasure the protein concentration of the desalted sample using the BCA assay21.\nNote: Desalting is required to reduce Imidazole levels below the tolerance limit for the BCA assay, as described in the manufacturer's instructions. Our lab prefers the BCA assay because it is sensitive, has a large dynamic range, and exhibits much less protein-to-protein variation. However, other methods to determine protein concentration can be substituted for the BCA assay. The key is to be aware of each method's advantages and limitations.\nAdd 5X native sample buffer to a final concentration of 1X and proceed to electrophoresis. Alternatively, store samples at -20 ºC for later analysis.\n4. Nondenaturing Polyacrylamide Gel Electrophoresis (PAGE).\nCaution: Unpolymerized acrylamide is a neurotoxin. Wear appropriate protective gear.\nPrepare the nondenaturing PAGE gel as follows.\n\t\nPrepare the gel cassette for casting using clean glass plates and casting stand. Place gradient maker on top of a small magnetic stirrer and place a tiny stir bar into each chamber.",
    "Using 40% (w/v) acrylamide and 2% (w/v) bisacrylamide stock solutions, prepare 5% and 10% (w/v) acrylamide gel solutions in a native resolving buffer. Ensure that the ratio of total acrylamide to bisacrylamide is 37.5:1. Chill on ice prior to pouring.\nNote: The nondenaturing PAGE system used here is essentially identical to the Laemmli SDS-PAGE system, with SDS omitted22.\nAdd Ammonium Persulfate (from a 10% (w/v) stock solution prepared in water) to the acrylamide solutions to initiate polymerization. Final concentration of Ammonium Persulfate is 0.1% (w/v).\nPour the acrylamide solutions into the two chambers of the gradient maker. With the outlet tubing inserted between the plates of the gel cassette, activate the magnetic stirrer and open the gradient maker valves. Pour the 5 - 10% nondenaturing gradient gel.\nOnce poured, overlay the gel with a thin layer of Isopropanol and allow the gel to polymerize for 30 min. During this time, prepare fresh 5% acrylamide gel solution in native resolving buffer. After the gel sets, pour off Isopropanol and rinse the top of the gel with deionized water from a squirt bottle.\nTo the 5% gel solution prepared above, add Ammonium Persulfate (exactly as described in 4.1.3) and pour on top of the polymerized gel until glass plates are full. Insert gel comb. Allow the overlaid gel to polymerize for an additional 30 min.\nOnce gel is polymerized, assemble gel cassette into electrophoresis apparatus. Alternatively, store the gel at 4 ºC, wrapped in moistened paper towels and plastic wrap until ready for use.\nOnce nondenaturing PAGE gel is assembled into electrophoresis apparatus, fill the tank with 1X native running buffer prepared fresh from a 10X native running buffer stock.\nLoad 10 μg of purified protein, obtained at the end of section 3, into each well using a glass syringe.",
    "Load 2 μL of high molecular weight native protein standard (diluted in 1X native running buffer) into one of the wells.\nRun gel at 55 V and 4 ºC until the dye front runs off the gel (approximately 4 - 4.5 h).\nIn addition to the nondenaturing gel, analyze aliquots of the purified protein by standard SDS-PAGE22.\n\t\nMix aliquots (10 μg) of the purified protein samples, obtained at the end of section 3, with 5X SDS-sample buffer to a final concentration of 1X.\nIncubate at 100 ºC for 5 min and load onto standard 12% and/or 15% SDS-PAGE gels22.\nRun at 80V for 20 min and then at 120 V until the dye front runs off the gel (this is approximately an additional 75 min for a 12% gel, and 120 min for a 15% gel).\n5. Visualizing Activity and Protein Staining.\nFollowing electrophoresis, carefully separate glass plates and transfer the nondenaturing gel to a gel tray containing 50 mL of deionized water. Rinse gel with gentle rocking for 5 min. Discard water and repeat this wash step three times.\nPerform substrate overlay assay as follows.\n\t\nAdd 1 mL of developing buffer containing the fluorogenic peptide substrate Suc-LLVY-AMC and spread uniformly over the gel. Incubate at 37 ºC for 30 min.\nNote: A glass rod or a gel releaser (small wedge of plastic used to separate glass plates) can be used to spread the liquid over the gel.\nCarefully transfer the gel onto the UV transilluminator of the gel imaging system and observe fluorescence due to the cleaved peptide substrate. Record image. Carefully transfer the gel back to the gel tray.\nRinse the gel twice with 50 mL of deionized water for 5 min with gentle rocking.",
    "Stain the gel with 10 mL of a colloidal coomassie stain reagent for 60 min with gentle rocking. Destain gel with 50 mL water until background becomes clear. This staining step applies to the standard SDS-PAGE gels as well.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}