{
  "id": 9426,
  "origin_website": "Jove",
  "title": "Whole Cell Patch Clamp for Investigating the Mechanisms of Infrared Neural Stimulation",
  "procedures": [
    "1. Culture of Spiral Ganglion Neurons\nSterilize small round (e.g. 10 mm diameter) glass coverslips and curved forceps in an autoclave. Transfer the sterilized coverslips into individual wells of a sterile 4-ring 35 mm petri dish or 4-well plate, using the sterilized forceps. Apply 150 μl of poly-L-ornithine (500 μg/ml) and mouse laminin (0.01 mg/ml) to the top surface of the coverslip and place in an incubator (37 °C) for up to 48 hr. Ensure that the coverslips do not float away from the bottom of the well.\nPrepare 50 ml sterile Neurobasal media (NBM) for each neural culture: 47.5 ml neurobasal A, 0.5 ml N2 supplement, 1 ml B27 supplement, 0.5 ml L-glutamine, and 0.5 ml penicillin-streptomycin. Note: Supplements can be frozen, stored at -20 °C and added to the media on the day required.\nDissociate spiral ganglion neurons from post-natal day 4-7 rat pups as previously described 20,21, using both enzymatic (0.025% trypsin and 0.001% DNase I) and mechanical techniques. Refer to Whitlon et al. 22 and Vieira et al. 23 for detailed procedures of spiral ganglion neuron culture, or Parker et al. 24 for a demonstration of modiolus isolation.\nAspirate any remaining poly-L-ornithine/laminin solution from the coverslips and wash briefly with NBM.\nAdd 150-200 μl of the dissociated spiral ganglion neuron suspension to the coverslips and place into an incubator (37 °C, 10% CO2). Note: up to 20 coverslips can be prepared from an average litter of 8 rat pups.\nFour hours after plating neurons, aspirate the solution to remove cell debris and replace with 150-200 μl warmed fresh NBM. Note: media may require daily replenishment to avoid dehydration.",
    "Return coverslips to the incubator until required for electrophysiological recordings. Note: dissociated spiral ganglion neuron cultures can be used for electrophysiological experiments four hours after dissociation and for up to two days thereafter. Time in vitro should be taken into account during analysis of results. Replenish NBM every 24-48 hr.\n2. Preparation for Patch Clamp Recordings\nPrepare solutions\n\t\nIntracellular (micropipette) solution: 115 mM K-gluconate, 7 mM KCl, 10 mM HEPES, 0.05 mM EGTA, 2 mM Na2ATP, 2 mM MgATP, 0.5 mM Na2GTP (adjust to pH 7.3 with KOH; adjust to 295 mOsmol/kg with sucrose). Pass the solution through a sterile filter (0.2 μm) and divide into 200 μl aliquots to be stored at -20 °C until the day of recording.\nExtracellular (bath) solution: 137 mM NaCl, 5 mM KCl, 2 mM CaCl2, 1 mM MgCl2, 10 mM HEPES, 10 mM glucose (adjust to pH 7.4 with NaOH; adjust to 300-310 mOsmol/kg with sucrose). This solution is made on the day of recording.\nPrepare recording micropipettes with a resistance of 2-6 MΩ. We use a CO2 laser puller (P-2000; Sutter Instruments) and borosilicate glass (1.0 mm outer diameter; 0.58 mm inner diameter; 75 mm length).\nPrepare the laser. This protocol is intended for use with a fiber-coupled laser, such as the 1,870 nm Infrared Nerve Stimulator from OptoTech P/L. The optical fiber used for light delivery in our experiments is a 200/220 μm core/cladding diameter silica fiber with a numerical aperture of 0.22 and FC-PC connectors at both ends (AFW Technologies MM1-FC2-200/220-5-C-0.22). The patch cords were cut in half to produce two fiber pigtails (i.e. connectorized at one end and cleaved at the other). The effects of fiber core diameter and numerical aperture on laser induced temperature changes have been discussed in detail by Thompson et al. 25",
    "Cleave the tip of the light delivery fiber using standard techniques and ensure that the resulting tip is of high quality by observation with an optical microscope (i.e. the tip should be perpendicular to the fiber axis and appear flat upon visual inspection). Connect the light delivery fiber to the fiber-coupled output of the stimulation laser using an appropriate through connector (e.g. Thorlabs ADAFC2).\nMeasure the output laser power from the cleaved tip of the light delivery fiber using an appropriate instrument (e.g. Coherent FieldMate with LM-3 detector head). It is recommended to check the laser power every time the light delivery fiber is cleaved or a significant adjustment is made to the laser (e.g. transportation from one lab to another).\nInsert light delivery fiber into a fiber chuck or equivalent device and affix the chuck to the appropriate micropositioner. It is important to be able to accurately determine the angle θ that the optical fiber makes with the coverslip. This angle can be measured by taking a photograph of the experimental arrangement and using image processing software (e.g. ImageJ) to obtain the angle. The angle θ (or range of possible angles) is primarily constrained by spatial limitations of the experimental arrangement - in particular the microscope. Typical values of θ in our experiments (based on an upright microscope) are around 36°, however the optimal angle may differ significantly for alternative setups (e.g. those using an inverted microscope).",
    "Make connections between the laser and the patch clamp data acquisition system (e.g. Digidata 1440A, Molecular Devices) as shown in Figure 2. The digital output from the patch clamp data acquisition system should be connected to the laser via an external function generator, making it possible to specify laser pulse parameters independent of the data acquisition system. Alternatively this output can be connected directly to the laser driver (requiring the pulse length and repetition rate to be set by the data acquisition software). In either case, the signal used to trigger the laser should be connected back to an input of the data acquisition system to ensure that the timing and length of the laser pulses can be recorded concurrently with the electrophysiological signal.\n3. Patch Clamp Recordings for Investigation of INS\nFill the appropriate container of the perfusion system with extracellular solution and adjust the flow rate to provide perfusion of the bath at a rate of 1-2 ml/min. We use a gravity-fed system (aspirator bottle, pinch valve, and PE tubing) with an in-line heater to enable rapid heating of the solution, and a peristaltic pump to remove spent solution by suction.\nPlace a coverslip with cultured cells into the recording chamber (bath) of an upright microscope. Using a high magnification water-immersion objective (e.g. 40X) and phase-contrast (e.g. differential interference contrast or Dodt gradient contrast), visually locate the spiral ganglion neurons within the culture. A typical spiral ganglion neuron is phase-bright, round and approximately 15 μm in diameter with a prominent nucleus, as shown in Figure 1a.\nOnce a neuron has been located, switch to a lower magnification objective (e.g. 10X) and locate the target neuron within the visual field.\nMove the light delivery optical fiber into position using the following procedure (or equivalent):",
    "Use the micropositioner to move the output fiber until the tip is close to the target neuron in both the horizontal and vertical planes. The vertical position of the fiber tip can be verified by moving the objective up and down (scanning the focus).\nSwitch back to the high magnification objective and position the tip of the optical fiber in its intended position next to the neuron (see Figure 2 inset). When adjusting the vertical position of the fiber, it is important that the bottom edge of the fiber is resting on (i.e. just touching) the coverslip, to minimize uncertainty in the location of the fiber. Optimal alignment in the horizontal plane will depend on the angle θ that the fiber makes with the coverslip and the radius of the fiber r. In order to position the fiber so that the center of the target neuron lies along the fiber axis, the horizontal distance between the upper edge of the fiber and the target cell should be\n\t\tΔtarget = r (cosec θ - 2 sin θ),",
    "where negative values would indicate that the optical fiber overhangs the cell. When aligning the fiber, a distance of Δtarget between the top edge of the fiber and the center of the neuron can be approximately achieved by visual inspection. However Δtarget is designed to serve as a rough guideline only. Positioning the fiber such that the actual distance Δ between the upper edge of the fiber and the center of the neuron differs measurably from Δtarget (as in Figure 1) can provide insight into the effect of both radial displacement (i.e. from the center of the beam) and axial displacement (i.e. along the fiber axis) of the beam relative to the target neuron. For example, setting Δ ≈ 0 would be expected to increase the local temperature in the vicinity of the cell - i.e. since the beam profile for typical multimode fibers is well approximated by a top hat distribution 26, the decrease in locally absorbed energy (temperature) due to displacement from the center of the beam is minimal compared to the increase in absorbed energy from moving the fiber end face closer to the cell.",
    "While care should be taken to position the fiber as accurately and repeatably as possible using visual cues, precise measurement of the fiber location relative to the target neuron (e.g. Δ) is of greater importance than positioning it a predetermined distance away. Δ can be determined (with an estimated maximum uncertainty of ±3 μm) by image analysis as described in step 3.8.2 of the protocol. In some experiments 5,8, white light sources have been coupled through the fiber in order to target the desired cell. This approach was found to be ineffective in the upright microscope setup, as the intensity of light scattered from the target region was relatively low at these shallow angles (θ).\nOnce the fiber is in position, move it out by a known amount to enable straightforward positioning of the micropipette. The fiber can then be returned to the original position when a neural recording is achieved.\nFill the micropipette with intracellular solution and securely fit into place on the headstage of the amplifier (e.g. Multiclamp 700B, Molecular Devices). Using tubing attached to the side of the microelectrode holder, apply a small amount of positive pressure to prevent clogging of the micropipette.\nUsing a micromanipulator, move the micropipette into position just above the target neuron.\nProtocol for whole cell recordings:\n\t\nApply a 10 msec, +10 mV square wave pulse (e.g. Seal Test) in voltage-clamp mode of the amplifier and adjust the micropipette potential (pipette offset) of the baseline signal to 0 nA. The seal test should also be used to determine whether the resistance of the microelectrode is within the desired range (e.g. 2 - 6 MΩ).",
    "While monitoring the resistance, use fine adjustments of the micromanipulator to gently position the micropipette onto the surface of the target neuron. When the micropipette is in contact with the neuron, the resistance will increase (by ~ 0.5 to 1 MΩ). Immediately following the resistance increase, remove the positive fluid pressure and apply a small negative pressure. Once resistance has passed 10 - 20 MΩ, fix the membrane potential to a holding level (e.g. around -60 mV).\nThe electrode resistance should continue to increase until it exceeds 1 GΩ, signifying that an effective seal (termed 'gigaseal') has been formed between the cell membrane and micropipette. At this point, remove all fluid pressure from the micropipette.\nOnce the gigaseal has been formed, use short current pulses (25 to 100 μsec; +1 V) or brief pulses of negative fluid pressure to rupture the cell membrane and achieve whole cell configuration.\nRecord the membrane capacitance, series resistance and input resistance as determined from the exponential curve fitted to the current during the seal test pulse. Minimize the capacitance transients by adjusting the CpFast and CpSlow controls on the amplifier, then switch the amplifier into whole cell mode, and compensate capacitance and resistance until a flat current is observed during the seal test. Apply series resistance compensation (~70% correction; 70% prediction), adjusting capacitance and resistance controls to maintain a flat test seal response.\nSwitch to current-clamp mode in the amplifier. Take note of the resting membrane potential (in the absence of current injection). Set a holding current to stabilize the membrane potential at the desired level (e.g. -60 mV). Neutralize the pipette capacitance and adjust the bridge balance to balance the voltage drop.",
    "Check the firing properties of the neuron by stimulating with depolarizing current (+10 to +200 pA in +10 pA steps; 300 msec duration).\nMove the optical fiber back into position next to the neuron. Using imaging software coupled to a CCD camera, capture images of the position of the fiber with respect to the target neuron, focusing on the plane of the neuron initially, and then on the top edge of the optical fiber (see Figure 1).\nBy subsequent analysis of the resulting images (e.g. Figures 1b and 1c) it is possible to precisely determine Δ (the position of the upper edge of the optical fiber relative to the center of the target neuron). Once Δ is known, parameters such as the distance from the fiber end face to the target neuron (along the fiber axis) z and the radial displacement of the neuron from the center of the beam δr can be calculated using simple trigonometric relations:\nz = r sin 2θ + Δ cos θ\n\t\tδr = ((r cos 2θ - Δ sin θ)2 + δy2)1/2,\n\t\twhere δy is the distance between the fiber axis and the center of the neuron as seen from above (e.g. see Figure 1).\n\t\tAnalysis should take into account positional variations from cell to cell, as accurate knowledge of these location parameters may be required to resolve possible differences between stimulation processes 25.\n4. INS Experiments",
    "While recording electrophysiological data in either current clamp or voltage clamp configurations, run the stimulation laser at the desired parameters (e.g. power, pulse length, repetition rate etc.). With our laser, the optical power is controlled via a direct input to the laser driver and is specified manually before each recording. Pulse length and repetition rate can be controlled by either an external signal generator or the data acquisition software (as described in step 2.3.4). Ensure that data are recorded from both the patch clamp channel and the laser trigger channel.\nLaser pulses with lengths ranging from around 500 μsec to 15 msec and energies of ~0.25-5 mJ per pulse typically yield measurable electrical responses. Setting the repetition rate of laser pulses to be 1 Hz or less may be useful for initial experiments, since it will minimize the effects of this parameter. Typical results showing the change in the recorded signal are presented in the following Section.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}