{
  "id": 8746,
  "origin_website": "Jove",
  "title": "Calibration-free In Vitro Quantification of Protein Homo-oligomerization Using Commercial Instrumentation and Free, Open Source Brightness Analysis Software",
  "procedures": [
    "1. FKBP12 F36V -mVenus Purification\nTransform (DE3) pLysS cells with pET22b vector containing monomerized human FKBP12F36V12 and N-terminal His6 and mVenus tags (vector available on request). Plate cells onto LB agar supplemented with 50 µg/mL Ampicillin and 34 µg/mL Chloramphenicol.\nTransfer transformed colonies into 100 mL LB starter culture and grow for 16 - 20 hours at 37 °C with shaking.\nDilute dense starter culture (OD600 >1) 1:100 in LB medium (2 x 500 mL batches) and grow for 2 - 3 hours to OD600 = 0.6 - 0.8 (37 °C, 200 rpm ).\nCool cultures on ice. Induce with 250 µM IPTG and grow for 16 - 20 hours at 21 °C, 200 rpm.\nHarvest cells by centrifugation at 2,000 x g for 20 minutes.\nResuspend pellet in 40 mL of IMAC buffer A (20 mM sodium phosphate pH 7.5, 500 mM NaCl, 3 mM imidazole, 1 mM β-mercaptoethanol) supplemented with EDTA-free protease inhibitors (1 tablet per cell pellet).\nSonicate cells (500 Watts, 20 kHz, 40% amplitude, 9 s on, 11 s off for 15 min) on ice and harvest soluble material by centrifugation at 20,000 x g.\nTransfer soluble lysate to a conical flask and add 2 mL of resin (see Table of Materials). Incubate for 1 hour with 105 rpm rotation\n\tNOTE: Nickel sepharose may also be used for this IMAC step.\nHarvest resin and wash with 250 mL of IMAC buffer A followed by 500 mL of IMAC buffer B (20 mM sodium phosphate pH 7.5, 500 mM NaCl, 7 mM imidazole, 1 mM β-mercaptoethanol).\n\tNOTE: Increase to 50 mM imidazole if using Nickel sepharose resin.\nElute His6-tagged protein using IMAC buffer C (20 mM sodium phosphate pH 7.5, 500 mM NaCl, 300 mM imidazole, 1 mM β-mercaptoethanol).",
    "Inject onto a size exclusion column (see Table of Materials) equilibrated in 10 mM HEPES pH 7.5, 150 mM NaCl, 1 mM DTT. FKBP12F36V has its peak elution at 87.71 mL on the column we used.\nAssess purity via SDS-PAGE and pool and concentrate as required.\n2. Preparation of Multiwell Plate Array\nThaw the purified FKBP12F36V (or labeled protein of interest) from -80 °C.\nPrepare a solution of 100 nM purified FKBP12F36V (medium, 10 mM HEPES pH 7.5, 150 mM NaCl, 1 mM DTT). Sonicate and centrifuge (quick spin of 13,000 rpm) to prevent the formation of aggregates.\nPipette 100 - 200 µL into an 8 well observation chamber with a glass bottom.\nAdd the BB dimerizer to final concentrations of 10, 20, 40, 80, 100, 150, 300, and 500 nM12,13.\nAs a reference, prepare a solution of 100 nM of mVenus alone to evaluate potential aggregation and precipitation effects and recover a brightness value for the monomer with the same acquisition settings.\n3. Calibration-free Confocal Acquisition\nStart the confocal system (Figure 1). Any light scanning microscope confocal system equipped with digital detectors or well-characterized analog detectors8, and capable of keeping a constant dwell time for every pixel acquired would work.\nSet the excitation beam path:\n\t\nTurn on the 514 nm laser and set it at 20 - 100 nW Power at the exit of the objective (for FKBP12F36V-mVenus).\nSelect the 63X1.4NA objective or a collar correction water immersion objective designed for FCS.\nTurn on one HyD, APD or calibrated PMT detector. Detectors capable of photon-counting are preferable, as in this case, calculation of S, offset and σ02 are unnecessary.\nSelect the emission window from 520 - 560 nm\nSet the pinhole at 1 Airy unit for the corresponding emission ~545 nm.",
    "Set the acquisition mode at 16 x 16 pixels\nSet the pixel dwell time tdwell such that it satisfies tframe >> TD >> tdwell, where D is the residence time of the diffusing protein and tframe is the frame rate. This corresponded to setting the dwell time to ~13 µs.\n\t\tNote: Some commercial manufacturers had scanners that were not keeping the dwell-time per pixel constant. This constancy is crucial for the method to work.\nSet the pixel size at ~120 nm.\nSelect the xyt acquisition mode and select the number of frames to be acquired per acquisition and well (for example 5,000).\nIf the system is equipped with high-throughput mode, introduce the coordinates of each well and the number of acquisitions per well to automate the process.\n\t\tNote: Be careful to ensure the presence of a water dispenser for if using an immersion objective.\nIf the system is equipped with a perfusion system, load the BB solution and program the perfusion to start right-after the 5000th frame to evaluate the kinetics of dimerization while acquiring e.g., 10,000 images.\nAdd a drop of oil into the oil immersion objective / water if utilizing a collar correction water immersion objective designed for FCS.\nMount the 8 well observation chamber into the stage.\nSelect the correct well and focus on the solution.\n\tNote: IMPORTANT: Avoid focusing close to the bottom glass to avoid reflection and scattering. When focusing deeper into the solution, disconnect the automated focus option.\nStart the acquisition and save the resulting stack of images in TIFF format.\n4. Detrend and Brightness Analysis using the R Package nandb",
    "As a preprocessing quality check, use ImageJ14 to take a look at the images and recover the intensity profile, as shown in Figure 2a. This is useful to determine whether or not too much photobleaching has occurred. If there is too much bleaching, the data is not suitable for further analysis.\n\tNote: ImageJ can also be useful to convert images to TIFF from commercial formats. The nandb software described below can only work with TIFF files.\nDownload and install R and RStudio15,16. It is best to download and install R first, then RStudio.\n\t​NOTE: What follows is a description of how to use the nandb R package. Knowledge of the R language is not required to use nandb, however it will make life easier.\nInstall the nandb package.\n\t\nOpen RStudio and in the console, type install.packages(\"nandb\") and wait for the installation.\nGet to know nandb\n\t\nReview the manual17.\nReview the built-in RStudio help for various functions. The most likely function to be used will be using will be brightness(). View the help file for this function by typing ? brightness() at the console.\nCalculate brightness\n\t\nSay one has an image file on the desktop called img001.tif (note that `nandb` only works with TIFF files). One can calculate the brightness of that image:\n\t\t​b <- brightness(\"~/Desktop/img001.tif\", tau = \"auto\")\n\t\t\nThis assigns the brightness of the image to the variable b in R. The tau = \"auto\" ensures that the image is correctly detrended prior to brightness calculation. The most common thing to do from here is to calculate the mean or median brightness of the image. One can do this by typing mean(b) or median(b). One can also write the brightness image to the desktop using\n\t\t\tijtiff::write_tif(b, \"~/Desktop/whatever_img_name\")",
    "Say one has folder full of images images_folder on the desktop and one needs to calculate the brightnesses of these images and write the brightness images as TIFF files. Then see ?brightness_folder(). This function processes a whole folder all at once:\n\t\tbrightness_folder(\"~/Desktop/images_folder\", tau = \"auto\")\n\t\tThis is particularly good for those who have a software they prefer to R, because all of the files are processed in one single command, and then one can go on working with the output brightness TIFF images in their chosen software, be it ImageJ14, Python or something else.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}