{
  "id": 17259,
  "origin_website": "Jove",
  "title": "Developing and Testing Methylated Nano-Structured Dipeptides that Inhibit Src Kinase Activity In Vitro for Anti-Cancer Applications",
  "procedures": [
    "1. Synthesis of peptides\nNOTE: The synthesis of W-R is described as a representative example (Figure 2).\nWeigh 566 mg (0.3 mmol) of H-Arg(Pbf)-2-chlorotriryl resin and add it to the peptide synthesis vessel (see Table of Materials), according to the procedure used by Mandal et al20. Perform peptide synthesis using the well-established solid phase peptide synthesis (SPPS) strategy21.\n\tNOTE: Methylated or dimethylated dipeptides containing unnatural amino acids were assembled on a rink amide resin (loading capacity of 0.3 mmol/g), while dipeptides containing natural amino acids were assembled on a resin that had the first amino acid attached to it, such as the H-Arg(Pbf)-2-chlorotriryl resin (loading capacity of 0.3 mmol/g). Importantly, the rink amide resin produces a peptide capped with a C-terminal NH2.\nSwell the dry resin for 1 h in 5 mL of N,N-dimethylformamide (DMF) under nitrogen gas pressure connected with the peptide vessel.\n\tNOTE: Perform the entire synthesis process in a fume hood. Goggles, gloves, and a lab coat need to be worn throughout the experiment. A timer is also essential to keep track between chemical reagent addition steps.\nRemove excess DMF using nitrogen gas pressure connected with the peptide synthesis vessel throughout the synthesis process.\nWeigh 473.9 mg of Fmoc-trp(Boc)-OH (0.9 mmol) and 341 mg of 2-(1H-Benzotriazole-1-yl)-1,1,3,3-tetramethyluronium hexafluorophosphate (HBTU) (0.9 mmol) as coupling reagents. Add the powders to a test tube and dissolve them in 5 mL of dry DMF.\nAdd 313.4 µL (1.8 mmol) of N,N-Diisopropylethylamine (DIPEA) as an activating agent into the test tube (step 1.4) and mix by shaking the tube.\nAdd the contents of the test tube to the resin and allow the reaction to proceed for 1 h under nitrogen gas at room temperature. Then, drain the excess DMF using nitrogen gas pressure and wash the resin 3x with DMF.",
    "Deprotect the N-terminal Fmoc using 5 mL of 20% piperidine in DMF (v/v) for 20 min under nitrogen gas. Wash the resin 3x with DMF (3 x 5 mL).\nDry the resin by adding 5 mL of dichloromethane (DCM) and keep it under nitrogen gas for 5 min, then drain the DCM using nitrogen gas pressure. Add 5 mL of methanol under nitrogen gas for 5 min to increase the dryness of the resin.\nAdd 10 mL of a freshly prepared cleavage cocktail of TFA/thioanisole/dithiothreitol/anisole (90:3:5:2 v/v/w/v) for 2.5 h to deprotect all of the side chains and cleave the dipeptide from the resin.\n\tCAUTION: The cleavage cocktail needs to be added in a glass measuring cylinder as TFA is acidic and dangerous; take care when using it.\nAfter 2.5 h, drain the reaction solution from the peptide vessel using nitrogen pressure into a round bottom flask. Add 250 mL of cold diethyl ether (Et2O) to the round bottom flask containing the crude peptide to precipitate the peptide.\nFilter the precipitated peptide using a filter paper in a conical funnel with one side arm that is connected with water (so that the filtration occurs due to the water pressure), and collect the precipitate (the peptides) to completely remove the ether. The crude peptide precipitates within 10 min.\nPurify the crude peptide on a reverse phase high-performance liquid chromatography (HPLC) column (see Table of Materials) using a gradient system. Use a gradient of 0%-100% acetonitrile containing 0.1% TFA in water containing 0.1% TFA for 30-60 min at a flow rate of 1 mL/min.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64256/64256fig02.jpg\nFigure 2: Solid-phase peptide synthesis of W-R. Abbreviations: HBTU = 2-(1H-Benzotriazole-1-yl)-1,1,3,3-tetramethyluronium hexafluorophosphate; DIPEA = N,N-Diisopropylethylamine; TFA = trifluoroacetic acid; DMF = dimethyl formamide. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64256/64256fig02large.jpg]",
    "2. Determination of cell toxicity of the synthesized peptides\nPlate 2,000 cells/well of SK-OV-3 cells, 5,000 cells/well of MDA-MB-231 cells, or 5 × 106 cells/well of CCRF-CEM cells (in a total volume of 100 µL/well) into a 96-well microplate. Incubate the cells in a humidified atmosphere of 5% CO2, 95% air at 37 °C till they reach 75%-80% confluency.\n\tNOTE: RPMI-16 media is used for culturing CCRF-CEM cells and Eagle's minimum essential medium (EMEM) for both MDA-MB-231 and SK-OV-3 cell lines. Both media are supplemented with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin (10,000 units/mL of penicillin and 10 mg/mL of streptomycin in 0.9% NaCl). Place all media and supplements in a 37 °C water bath for 30 min before starting the experiment. The experiment should be performed in a biosafety hood, wearing gloves and a lab coat.\nAspirate the medium using a pipette and add 100 µL of the 50 µM peptide or 10 µM doxorubicin (Dox) used as a positive control in triplicate into wells containing the three different types of cancer cells plated in the 96-well plate. Return the plate to the incubator for 72 h (under the same conditions as mentioned in step 2.1).\nAfter 72 h, add 20 µL of 3-(4,5-dimethylthiazol-2-yl)-5-(3-carboxymethoxyphenyl)-2-(4-sulfophenyl)-2H-tetrazolium (MTS) into the 96-well plate. Wrap the plate with aluminum foil and incubate the plate for 1-4 h at 37 °C in a humidified atmosphere.\n\tNOTE: MTS is a dye used to visualize live cells (untreated or treated with the peptides), since only the live cells convert MTS tetrazolium into colored formazan dye that can be measured at 490 nm.",
    "Measure the absorbance of the formazan product at 490 nm (A490) on a microplate reader (see Table of Materials). Include medium mixed with MTS as a blank for the experiment. Use water alone (as the peptides are water-soluble) and 0.1 N HCl (as WCH3 requires HCl for dissolving) as negative controls.\nMeasure the percentage of cell survival using the following equation (Eq 1), using a spreadsheet program (see Table of Materials). The procedure is the same as that used by Mandal et al20.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64256/64256eq01.jpg    Eq (1)\n3. c-Src kinase activity assay\nNOTE: The Src kinase activity assay was performed using a commercial assay kit (see Table of Materials) in triplicate, according to the procedure of Chhikara et al.22. Use WCH3 and RCH3 alone as controls to compare the effect of the methylated amino acid alone on kinase and with another methylated or unmethylated amino acid.\nIn a 384-well low volume black non-binding surface round bottom microplate, add 2.5 µL of the reaction cocktail containing 0.7 nM His6-Src kinase domain in kinase buffer, which is a part of the assay kit, to 2.5 µL of prediluted peptides dissolved in 10% DMSO (4x target concentration). Incubate for 10 min at room temperature using a microplate shaker (5 rpm) following the manufacturer's protocol.\n\tNOTE: The reaction cocktail consists of the kinase buffer (200 mM HEPES, pH 7.5), MgCl2 (16 mM), DMSO (4%), EGTA (8 mM), 2-mercaptoethanol (43 mM), and Brij-35 (0.04%). The optimal substrate of the kinase reaction of this experiment is (AEEEIYGEFEAKKKK).\nAdd 5 µL of the ATP/substrate (40 µM/600 µM) cocktail to the plate and incubate for 30 min on a microplate shaker at room temperature.",
    "Meanwhile, prepare the 1x ADP detection mixture containing 8 nM of ADP tracer and 10 µg/mL of dye-conjugated ADP2 antibody (see Table of Materials) to the stop and detect buffer B (1x) from the kit. Stop the kinase reaction (step 3.2) by adding 10 µL of the 1x ADP detection mixture and incubate for 1 h at room temperature.\nMeasure the fluorescence intensity using a microplate reader, with excitation at 580 nm, emission at 630 nm, and 10 nm band width. Obtain relative fluorescence units (RFUs) from the instrument to obtain the percentage of enzyme inhibition, according to Eq (2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64256/64256eq02.jpg    Eq (2)\nCalculate the IC50 value as listed on the company's website23.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}