{
  "id": 18932,
  "origin_website": "Jove",
  "title": "Real-Time, Semi-Automated Fluorescent Measurement of the Airway Surface Liquid pH of Primary Human Airway Epithelial Cells",
  "procedures": [
    "Primary non-CF (n = 3 donors, age 34, 27 and 23 years old) and CF (n = 3 donors, all F580del/F508del; age 40, 41, unknown) hAECs were a kind gift from Dr. Scott H. Randell (Marsico Lung Institute, The University of North Carolina at Chapel Hill, United States) and were obtained under protocol #03-1396 approved by the University of North Carolina at Chapel Hill Biomedical Institutional Review Board. The cells were grown according to previously published methods using the growth and differentiation media described by Fulcher and Randell35,36.\n1. Sample preparation\nGrow primary hAECs on 6.5 mm diameter semi-permeable supports (Table of Materials) at air-liquid interface for at least 28 days, as previously described35,36.\nPrepare 50 mL of sterile solution of HCO3- containing Krebs buffer solution (HCO3- KRB, concentrations are given in mM NaHCO3 (25) NaCl (115), KCl (5), CaCl2 (1), MgCl2 (1), D-glucose(5)) and filter-sterilize using a 0.2 μm syringe filter.\nChange the basolateral medium to fresh differentiation medium as described in 1.135,36.\n\tNOTE: It has been shown that basolateral glucose concentration affects ASL pH33. At this stage, the glucose content of the basolateral compartment can be controlled by replacing the medium by buffered solutions of known glucose concentrations.\nWash the apical surface of the cells by adding 150 µL of HCO3- KRB and incubate for 20 min at 37 °C, 5% CO2.\nRemove the apical wash without disrupting the epithelium by aspirating it carefully using a sterile glass Pasteur pipet and a sterile P200 pipet tip linked to an aspiration pump that creates a vacuum in the collection bottle. At this stage, there should be as little liquid remaining on the apical surface as possible to restore the air-liquid interface.\nIncubate the cells for a further 30 min at 37 °C, 5% CO2.\n2. Background measurement",
    "Turn on the plate reader and the computer.\nOpen the dashboard.\nClick on Spark 10M, open the temperature control and set to 37 °C. Open the gas control and set the CO2 to 5%.\nWait until temperature and CO2 have reached their targets.\nOpen the plate reader drawer, insert the humidity cassette filled with 6 mL of dH2O on each side. Ensure the lid and bottom of the plate are clean – if not, clean with 70% of ethanol on a piece of tissue - and place the plate in the humidity cassette.\n\tNOTE: Throughout the experiment, the tissue culture plate lid is kept on the plate and only removed when adding drugs or changing the basolateral medium, which are performed in a tissue culture laminar flow hood to keep the cultures in a sterile environment.\nOpen the Spark Method editor and set up the parameters on the software as follows:\n\t\nSelect the appropriate plate template (for 6.5 mm diameter semi-permeable supports, select the 24 well plate) and the wells that will be monitored during this experiment.\nAdd a temperature and CO2 control panel and set them to 37 °C and 5%, respectively. Tick the wait for temperature/gas boxes.\nAdd a kinetic loop panel and select the Duration as the Loop type and set it to 5-10 min. Choose Not Defined as the Interval type to enable continuous reading.\n\t\tNOTE: The timing of continuous reading depends on the number of wells/conditions. 5 min is long enough for 6-12 wells whereas a full plate containing 24 conditions will require 10 min of continuous measurements.",
    "Within the kinetic loop, add two “Fluorescence intensity” panels, using the drag and drop function, that will be set up for the pH-sensitive and the pH insensitive fluorescent dyes respectively. Set excitation and emission wavelengths to 560 and 590 nm, respectively, for the pH-sensitive dye and 495 and 520 nm, respectively, for the pH-insensitive dye.\nSet the number of flashes to 30 and the z-position to 33200 for each fluorophore.\n\t\tNOTE: The z-position and gain settings are dependent on the characteristics of the plate reader. Set the gain manually to a value that will give high enough counts so that differences between samples will be picked up but low enough so that the addition of an agonist will not generate values out of the range of detection.\nSet the multiple read per well to user defined as a circle type of 3 × 3 size with a border of 4750 µm. \nClick the start button to make a background measurement and OK to confirm the lid of the humidity cassette is in place.\nAt the end of the measurement, open the plate reader drawer, take the plate out and Pplace the cellsit back in the incubator while preparing the fluorescent dye mix solution.\nPrepare the fluorescent dye mix solution by adding 2 µL of 1 mg/mL dextran-coupled pH-sensitive (pHsens) fluorescent dye to 0.2 µL of 10 mg/mL dextran-coupled pH-insensitive (pHins) fluorescent dye and 0.8 µL of sterile HCO3- KRB for a final volume of 3 µL per condition.",
    "NOTE: The total volume of dye mix solution should be prepared for n wells + 1 if there are between 1 and 10 samples, or n wells + 2 if there are between 11 and 24 samples. Dextran-coupled dyes are reconstituted in filtered-sterile HCO3- KRB solution, aliquoted and stored at -20 °C. Any chemical can be added at this stage for a 16-24 h incubation period37 on the apical surface. Chemicals should be prepared as 0.1x, as the final volume, after absorption of the excess fluid by the culture, will be around 0.3 µL for a 6.5 mm diameter semi-permeable support.\nCarefully add 3 µL of dye mix (see 2.8) to the apical surface of the cells and incubate overnight at 37 °C, 5% CO2.\n3. Kinetic measurement\nRepeat steps 2.1 to 2.4 to prepare the plate reader.\nClick on the Open icon and select the method file used for the background measurements\nIn the kinetic loop panel, keep the loop type as Duration and set it to 08 hours. Change the Interval type to Fixed and set it to 5 minutes. Keep the Fluorescence Intensity panels the same as for the background measurements\n\tNOTE: Interval type for background measurements is set to “not defined” in order to allow continuous reading. For kinetic as well and calibration experiments, the interval type is set to “fixed” with an interval of 5 min. This can be adjusted according to the design of the experiment and the number of conditions.\nOpen the plate reader drawer; insert the humidity cassette filled with 6 mL of dH2O on each side. Ensure the lid and bottom of the plate are clean – if not, clean with 70% ethanol on a piece of tissue - and place the plate in the humidity cassette, with its cover.",
    "Start fluorescence readings by clicking on Start. Click OK after ensuring the lid of the humidity cassette is in place.\nAfter n cycles, usually between to 12 and 24, which is equivalent to 1 to 2 hours, click Pause to interrupt the experiment. Take the plate out and apply any drugs/agonists basolaterally to the different samples.\n\tNOTE: When the cells are taken out of the plate reader, CO2 escapes and this will induce an increase in ASL pH as shown by a drop in pH-sensitive dye fluorescence. This CO2-induced pH change reverses within 10-15 min after placing the cultures back in the plate reader.\nPut the plate back in the humidity cassette on the tray, reposition the humidity cassette lid and click Continue in order to further record ASL pH and monitor the effect of the drugs/agonists on ASL pH.\n4. In situ pH calibration\nTake the plate out of the plate reader.\nAspirate the basolateral medium/solution.\nAdd 750 µL and 1 µL of highly buffered standard curve solutions to the basolateral compartment and apical surface, respectively.\n\tNOTE: Highly buffered standard curve solutions contain (in mM) NaCl (86), KCl (5), CaCl2 (1.2), MgCl2 (1.2), NaHEPES or MES or Tris (100 mM). Use MES to buffer solutions with a pH lower than 7, NaHEPES for solutions of pH 7-7.5 and Tris for solution with pH 8. Clamp the pH to the desired value using HCl.\nSwitch the CO2 off on the plate reader or set it to 0.1% and place the plate back in the humidity cassette.\nSet up the plate reader with the same parameters as described previously but with no CO2 as in step 3.2.\nStart fluorescence readings, every 5 min for 1-1.5 h.\n5. Evaluation of the effect of dye concentration and suspension volume on calibration data",
    "Prepare enough pH-sensitive and insensitive dye mixture to record the fluorescence at a minimum of 4 different pH values in 3 different volumes.\n\tNOTE: Here, mix 1 was prepared with 26 µL of pH-sensitive (1 mg/mL) and 2.6 µL of pH-insensitive (10 mg/mL) and mix 2 with 13 µL of pH-sensitive (1 mg/mL) and 1.3 µL of pH-insensitive (10 mg/mL).\nDistribute 2.2 µL or 1.1 µL of mix 1 or mix 2, respectively, into 12 wells of a 96 well plate and add enough calibration solutions to obtain final volumes of 50, 100 or 200 µL and mix well.\n\tNOTE: In this set up, fluorescence counts will be recorded for concentrations of dyes of 5 µg/mL (in 200 µL), 10 µg/mL (in 100 or 200 µL), 20 µg/mL (in 50 or 100 µL) or 40 µg/mL (in 50 µL).\nTurn the plate reader on, set the temperature to 37 °C and insert the plate in the plate reader. Do not turn the CO2 controller on.\n\tNOTE: As this is a short experiment and only requires enough time to equilibrate the temperature, the humidity cassette is not required.\nAdjust the z-position and gain for the 96 well plate and use the same parameters as for the experiment done on semi-permeable supports.\n6. Data analysis\nSave all data to spreadsheets and create a new file.\nIn the background file, select all mean data for each sample/condition for both wavelengths, copy and paste to the new file. Calculate the mean background for each well and each wavelength.\nRepeat this with the calibration and kinetic data and subtract the background from each data point for each wavelength.\nFor each time point and every sample, calculate the ratio between pH-sensitive and pH-insensitive fluorescence",
    "If all the samples were obtained from an individual donor, calculate the mean of the ratios at each time point of the calibration curve\n\tNOTE: It is important to generate as many calibration curves as donors or basolateral solutions. Indeed, these parameters can affect the background readings or the rate of absorption of the fluid, which in turn will affect the dye concentration and therefore the calculated pH.\nFor each time point, generate a standard curve from the ratios, plotting the known pH values on the x-axis and the ratios on the y-axis.\nDetermine the time point at which ratios are stable, fit a linear regression line and obtain the equation for this line.\nFrom the kinetic data, calculate the pH for each time point and plot the pH on the y-axis and the time on the x-axis\n\tNOTE: Resting/basal pH can be calculated by averaging data points over the stable measurement of pH before addition of any agonist or any other intervention. The effect of an agonist can be characterized by calculating the difference in pH before and after (a certain amount of time) the treatment or by fitting a non-linear curve to the data points directly after the intervention. This will give additional information about the t1/2 and the maximal value. Finally, the rates of acidification or alkalinization can also be obtained from the slope of a straight line fitted to the first points after the intervention."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}