{
  "id": 15170,
  "origin_website": "Jove",
  "title": "HOX Loci Focused CRISPR/sgRNA Library Screening Identifying Critical CTCF Boundaries",
  "procedures": [
    "​1. CTCF sgRNALibrary Design Using an Online Tool\nDesign the sgRNA targeting CTCF binding sites in the human HOX loci using the genetic perturbation platform (GPP) designer tool (https://portals.broadinstitute.org/gpp/public/analysis-tools/sgrna-design).\nSynthesize a total of 1,070 sgRNAs consisting of sgRNAs targeting 303 random targeting genes, 60 positive controls, 500 non-Human-targeting controls, and 207 CTCF elements or lncRNA targeting genes (Figure 1, Table 1). Each targeting DNA element is targeted by 5-10 different sgRNAs.\n2. sgRNA Library Cloning\nClone the synthesized oligonucleotides into the CRISPR lentiviral backbone vector (lentiCRISPRv2).\nDigest the LentiCRISPRv2 vector with BsmBI restriction enzyme at 37 °C for 2 h.\nLook for the presence of the larger band (around 12,873 bp) on the gel after BsmBI digestion, and then purify it with the gel extraction kit.\nNOTE: A 2kb small filler piece is also present on the gel after digestion, but this should be ignored.\nLigate the synthesized oligonucleotides and digested LentiCRISPR vector with 150 ng of digested LentiCRISPR DNA, 1 µL of 10 µM oligos, 2 µL of 10x T4 ligase buffer, 1 µL of T4 ligase, and then incubate them at 16 °C overnight.\nTransform the lentiviral CRISPR/sgRNA library into electro-competent cells for amplification.\nPrepare the electroporator at 1.8 kV, 200 Ω and 25 µF. Then pre-warm the recovery SOC media in a 37 °C water bath, and pre-warm LB ampicillin antibiotic plates at 37 °C.\nThaw the competent cells on ice for 10 min.\nPrepare 1.5 mL micro-centrifuge tubes and 1 mm electroporation cuvettes on ice.\nMix 1 µL of a 10 ng/µL library plasmid DNA into 25 µL of competent cells in a 1.5 mL micro-centrifuge tube, and gently mix by flicking the bottom of the tube a few times manually.",
    "Once the cuvette is cold enough, transfer the DNA/competent cell mixture to it. Tap twice on the countertop and wipe any water droplets from the exterior of cuvette with a tissue paper. Then place the cuvette in the electroporation module and press pulse.\nImmediately add 975 µL of 37 °C pre-warmed SOC media. Mix by pipetting up and down and transfer to a 15 mL tube.\nRotate and incubate at 37 °C for 1 h.\nDilute 100 µL cells into 900 µL of SOC media and place 100 µL on a LB ampicillin antibiotic agar plate. Incubate overnight at 37 °C.\nExtract the plasmid DNA from the combined colonies using a maxi-prep column as detailed in the manufacturer's protocol.\nScrape all the colonies from the LB agar plate and inoculate a starter culture of 2 mL of LB ampicillin antibiotic medium and incubate overnight at 37 °C with vigorous shaking (~200 x g).\nDilute the starter culture 1:500 into 100 mL of LB ampicillin medium and incubate at 37 °C for 12-16 h with vigorous shaking (~200 x g).\nHarvest the bacterial cell pellet by centrifugation at 6,000 x g for 15 min at 4 °C.\nRe-suspend the bacterial pellet in 10 mL of suspension buffer.\nLyse the suspended pellet with 10 mL of the lysis buffer, and vigorously invert 4-6 times. Incubate the lysate for 5 min at room temperature.\nNeutralize the lysate with 10 mL of chilled Neutralization Buffer. Mix by gently inverting the tubes 4-6 times and incubate it for 20 min on ice.\nSpin down at 13,500 x g for 30 min at 4 °C. Promptly transfer the supernatant containing the plasmid DNA to a new tube.\nRepeat step 2.3.7, and promptly transfer the supernatant containing the plasmid DNA to a new tube.",
    "Equilibrate the column by applying 10 mL of equilibration buffer and allow the column to empty by gravity flow.\nAdd the supernatant to the column and allow it to enter the resin by gravity flow.\nWash the column with 2x 30 mL of washing buffer.\nElute the DNA with 15 mL of elution buffer.\nPrecipitate the DNA with 10.5 mL of room-temperature isopropanol to the eluted DNA. Mix and spin down immediately at 15,000 x g for 30 min at 4 °C, and gently decant the supernatant.\nWash the DNA pellet with 5 mL of 70% ethanol, centrifuge DNA pellet at 15,000 x g for 10 min and discard the clear supernatant.\nRepeat step 2.5.14 twice more.\nCentrifuge DNA pellet at 15,000 x g for 10 min, and gently decant the supernatant without disturbing the DNA pellet.\nAir-dry the pellet for 5-10 min, and dissolve the DNA in a required volume of buffer (TE buffer, pH 8.0).\n3. The High Titer sgRNA Library Lentivirus Generation\nCell preparation: Culture HEK293T cells in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% (vol/vol) fetal bovine serum (FBS) and 1% (vol/vol) penicillin-streptomycin (PS) antibiotic in T-25 flasks. Place them in the incubator at 37 °C and 5% CO2.\nPackage lentivirus: Co-transfect HEK293T cells with 20 µg of purified library vectors from step 2, 15 µg of the package plasmid (psPAX2) and 10 µg of the envelope plasmid (pMD2.G) for 48 h before harvesting the viruses.\nVirus collection: After 48 h, collectthe virus supernatant and filter the virus supernatant through a 0.45 µm low protein binding PVDF membrane.\nVirus concentration: Concentrate the lentiviral supernatant by 50-fold using the concentrator and test the virus MOI in step 5.\nVirus storage: Aliquot the concentrated viruses and store in a -80 °C freezer.\n4. Optimized Puromycin Concentration",
    "Leukemia cell culture: Culture MOLM13 AML cells in RPMI 1640 supplemented with 10% (vol/vol) fetal bovine serum (FBS) and 1x penicillin-streptomycin (PS) antibiotics in a T-125 flask. Place them in an incubator at 37 °C and 5% CO2.\nNOTE: Cells are typically passed every 4-5 d at a split ratio of 1:4 or 1:6, never allowing cells to reach more than 70% confluency.\nSet up MOLM13 cells in a 12-well plate with a density of 1.0 x 104 cell/mL, at a total volume of 2 mL per well (2.0 x 104 cells).\nTime-course assay: Treat MOLM13 cells with puromycin for 7 days in increasing concentrations (0.1 µg/mL, 0.2 µg/mL, 0.5 µg/mL, 1.0 µg/mL and 2.0 µg/mL)\nSet up MOLM13 cells without puromycin treatment on day 0 and set up 3 replicate wells without puromycin treatment as a control from day 0 to day 7.\nTreat MOLM13 cells with 0.1 µg/mL, 0.2 µg/mL, 0.5 µg/mL, 1.0 µg/mL and 2.0 µg/mL, separately, with each experimental condition containing 3 replicate wells.\nCount the live cell ratio and make a survival curve from day 0 to day 7 containing all conditions.\nSurvival curve: Stain cells with Trypan blue and count viability daily to obtain the survival curves for each puromycin concentration.\nOptimizing minimal puromycin concentration: Determine the minimal puromycin concentration through Trypan blue staining, in which all MOLM13 cells are killed between 5-7 days.\n5. Titration of Lentiviral Library in MOLM13 Leukemia Cells\nAML cells preparation: Collect MOLM13 AML cells with the transduction medium (RPMI 1640, 10% FBS, 1% PS, and 8.0 µg/mL coating medium) at a density of 1.5 x 106 cells /mL.\nPlace MOLM13 cells in the 12-well plate with 1.5 x 106 cells in each well.",
    "Thaw the lentivirus: Remove the concentrated lentivirus from the -80 °C freezer and thaw it on ice.\nMix MOLM13 cells with a different dose of the concentrated lentivirus in separate wells, including 0, 1, 2.5, 5, 7.5 and 10 µL (total 6 groups).\nImmediately centrifuge these mixtures at 1,000 x g for 2 h at 33 °C and transfer the 12-well plates back to the incubator at 37 °C and 5% CO2 for 4 h.\nAfter 4 h, spin down the infected cells at 400 x g for 5 min at room temperature.\nGently aspirate the supernatant without disturbing the cell pellet, and re-suspend the transduced cells with fresh media (RPMI 1640, 10% FBS and 1% PS), and then transfer them to T-25 flasks and incubate at 37 °C for 48 h without puromycin.\nAfter 48 h, split these cells into 2 flasks (2 groups): an experimental group treated with 1 µg/mL puromycin for 5 days, and a control group without puromycin treatment for 5 days.\nCarry out puromycin selection for 5 days with 1 µg/mL puromycin according to the step 4 until all the non-transduced control cells are dead. Exchange for fresh media every 2 days.\nMeasure the optimized MOI value for transduction by dividing the number of live cells treated with puromycin with the number of cells without puromycin treatment.\n6. Transduction of the Pooled CRISPR-Cas9 KO Library\nTransduction with lentivirus: Infect 1.5 x 106 MOLM13 cells with 0.3 MOI of sgRNA pooled lentivirus in medium (RPMI 1640, 10% FBS, 1% PS, and 8 µg/mL coating medium) in 6-well plate and use the cells without the lentivirus infection as a control.",
    "Immediately centrifuge the 6-well plate at 1,000 x g for 2 h at 33 °C to spinfect the cells and transfer the plates back to the incubator at 37 °C and 5% CO2 for 4 h.\nSpin down the infected cells at 400 x g for 5 min at room temperature.\nGently aspirate supernatant without disturbing the cell pellet, and re-suspend the transduced cells with fresh media (RPMI 1640, 10% FBS and 1% PS), and then transfer them to T-25 flasks and incubate at 37 °C for 48 h without puromycin.\nAfter 48 h, treat cells with 1 µg/mL puromycin for 5 days. Exchange for fresh media after 2 days and keep at an optimal cell density.\nSeed the single clone in 96-well plates with limiting dilution methods and incubate these single clones at 37 °C and 5% CO2. Culture them for 3-4 weeks.\nAfter a single cell grows up into a population, transfer half of the cells into 24-well plates for further culture under puromycin selection and verify these clones in the next step. Keep the rest of the cells.\n7. Screening of the Pooled CRISPR-Cas9 KO Library with One-step RT-qPCR\nDetermine the effectiveness of the sgRNA integrated clone screening by evaluating the expression of the marker gene HOXA9 with one step reverse-transcriptase polymerase chain reaction (one-step RT-qPCR).\nNOTE: HOXA9 are highly expressed in MOLM13 AML cells in leukemogenesis22,23.\nCount the sgRNA integrated MOLM13 cell and transfer 1 x 104 cells per well to a 96-well PCR plate.\nCentrifuge the tube at 1,000 x g for 5 min, and then thoroughly remove and discard the supernatant with a pipet without disturbing the cell pellet.",
    "Wash cells with 125 µL of PBS buffer, and centrifuge the tube at 1,000 x g for 5 min. Then remove 120 µL of the supernatant using a pipette and retain approximately 5 µL of PBS in each well.\nAdd 50 µL of the cell lysis master mix containing 48 µL of cell lysis buffer, 1 µL of proteinase K solution (10 mg/mL) and 1 µL of DNase solution (1 mg/mL) to each well. Then pipet up and down 5 times to re-suspend the cell pellet.\nIncubate the mix for 10 min at room temperature, followed by 5 min at 37 °C, and then 75 °C for 5 min.\nStore the cell lysate at -80 °C freezer.\nThe preparation of one-step RT-qPCR reaction: Thaw the one-step reaction mix and other reaction components to 4 °C. Then spin down briefly to collect solutions at the bottom of tubes, and place on ice without light. Mix and spin gently.\nAdd 1 µL of cell lysate to the PCR wells with the RT-qPCR reaction mix, including 1 µL of the marker gene's forward primer (300 nM) and reverse primer (300 nM), 0.125 µL of reverse transcriptase (10 U/µL), and 5 µL of one-step reaction mix (2x).\nSeal wells with optically transparent film, and gently vortex and mix the reaction components.\nPlace the 96-well PCR plate on a real-time PCR instrument.\nRun the reverse transcription reaction for 10 min at 50 °C, followed by polymerase inactivation and DNA denaturation for 1 min at 95 °C.\nPerform RT-PCR with 40 cycles of PCR reaction: denaturation for 15 s at 95 °C, annealing/extension and plate fluorescence reading for 20 s at 60 °C, and then melt curve analysis at 65-95 °C via 0.5 °C increments at 2-5 s/step.",
    "Set up upregulated, downregulated and no change groups according to the expression levels of HOXA9 gene by comparison to the control, separately. Use β-actin gene as a housekeeping gene control.\n8. Verification of Integrated sgRNAs Positive Clones through Genotyping and Sanger Sequence\nVerify the HOXA9 decreased expression clones through Sanger sequencing and perform PCR with 50-100 ng MOLM13 genome DNA, 5 µL polymerase reaction buffer (10x), 1 µL forward primer (10 µM) (AATGGACTATCATATGCTTACCGTAACTTGAAAGTATTTCG) and 1 µL reverse primer (10 µM) (TCTACTATTCTTTCCCCTGCACTGTTGTGGGCGATGTGCGCTCTG), 1 µL dNTP (10mM), 1 unit polymerase (5 U /µL). Perform the PCR reaction with the initial denaturation at 94 °C for 30 s, and then more denaturation at 94 °C for 20 s, annealing at 56 °C for 20 s, extension at 68 °C for 20 s (total 30 cycles), final extension at 68 °C for 10 min, and then holding at 4 °C.\nExtract and purify the PCR products (size 285 bp) with a PCR Purification Kit.\nLigate the purified PCR products into the T vector with 2 µL T4 ligation buffer (10x), 50 ng T vector DNA (50 ng/µL), 25 ng purified PCR DNA (285 bp), 1 µL T4 ligase (3 units/µL), and place the ligation mix into an incubator at 16 °C overnight.\nTransfer the ligation mix into DH5α competent cell, grow on a LB ampicillin antibiotic agar plate, and incubate overnight at 37 °C.\nPick the single clones from the LB plate and verify them by genotyping and Sanger sequencing.\n9. Detection of sgRNAs Induced Indel Mutation by Nuclease Digestion Assay\nDetect the sgRNA integrated single clone induced Indel rates by a nuclease test assay.",
    "Separately prepare PCR amplicons with 50-100 ng Indel mutant (test) and wild-type (WT, reference) DNA as PCR template, 5 µL polymerase reaction buffer (10x), 1 µL dNTP (10mM), 1 unit polymerase (5 U/µL), 1 µL forward primer (10 µM)( 5'-GAGATGGCGGCGCGGAAG-3'), and 1 µL reverse primer (10 µM) (5'-AAATATAGGGCGGCTGTTCACT-3'). The PCR reaction was performed with initial denaturation at 98 °C for 30 s, and then denaturation at 98 °C for 20 s, annealing at 56 °C for 20 s, extension at 72 °C for 30 s (total 30 cycles), and final extension at 72 °C for 10 min, and holding at 4 °C.\nSet up the heteroduplex mixture group with 200 ng of the \"reference\" (20 ng/µL) and 200 ng of \"test\" (20 ng/µL) PCR amplicons in 0.2 mL PCR tube, and the homoduplex mixture group with only 400 ng of \"reference\" PCR amplicons as a control.\nSeparately incubate the heteroduplex and homoduplex mixture at 95 °C for 5 min in a 1 L beaker filled with 800 mL of water and then cool down gradually to room temperature to anneal and form heteroduplex or homoduplexes.\nSeparately digest 400 ng of the annealed heteroduplex and homoduplex mixture with 1 µL indel mutation detection nuclease (2.5 U/µL) and 2 µL nuclease reaction buffer (10x) at 42 °C for 60 min.\nAnalyze the digested samples with agarose gel electrophoresis, the heteroduplex mixture DNA should be cut into small fragments (70-250 bp), and the homoduplex DNA (320 bp) should not be cut.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}