{
  "id": 4236,
  "origin_website": "Cell",
  "title": "Using piggyBac transposon gene expression vectors to transfect Zscan5b gene into mouse pluripotent stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol is aimed at isolating mouse pluripotent stem cells (mESCs and miPSCs) transfected with a target gene constitutive expression plasmid. Following mESCs/miPSC isolation, the cells are transfected with green fluorescent protein (GFP)-tagged plasmid constitutively expressing Zscan5b. Subsequently, GFP-positive cells are picked using a glass pipette. As an alternative approach, fluorescence-activated cell sorting (FACS) can be used to enrich for GFP+ cells. Once an optimal stable cell clone showing high GFP signals was identified, these cells were expanded.\nPreparation of MEF plates: Gelatinization of dishes\nTiming: 20 min\nNote: All steps should be performed in sterile conditions in a biological hood (i.e., biosafety cabinet). Prepare cell culture plates; 12-well, 6-well, and 10 cm plates are suitable for mESCs/miPSC plating.\nNote: Gelatin-coated plates can be prepared days in advance, provided they are stored under sterile conditions in the incubator to prevent drying for up to a week (Conner, 2001[href=https://www.wicell.org#bib1]).\nAdd 2 mL 0.1% gelatin (Sigma G1890) into the well of 6-well plate, and swirl to cover the entire surface with the gelatin solution.\nNote: The plate should be of cell attachment type. Please ensure that the surface is completely covered with gelatin.\nNote: 0.1% gelatin solution was made with cell culture grade water and sterilize by autoclaving. Filter the gelatin solution using a 0.22 μm polyethersulfone filter for sterilization after cooling. Gelatin solution can be stored up to 1 year at 4°C.\nLeave the plate for at least 20 min in the incubator.\nNote: Gelatin-coated plates can be stored in the incubator for up to a week.\nJust before plating the MEF containing media, aspirate the gelatin in a laminar flow hood.\nNote: It is imperative to observe sterile techniques and to work only in a laminar flow hood.\nPreparation of MEF plates: MEF preparation",
    "Timing: 4 h (plus incubation overnight [12–24 h])\nTake the frozen inactivated MEF vial (3 × 106 cells/vial) from the liquid nitrogen tank.\nNote: MEFs were mitotically inactivated prior to the addition of mESCs/miPSCs by treatment with mitomycin C.\nImmediately after that, put the vial on dry ice and bring it to the culture room.\nThaw the vial in the 37°C thermo heater.\nBefore completely dissolving MEF (with a small ice block), remove the vial from the water bath, spray the outside of the vial with 70% ethanol to sterilize and place it in hood.\nAdd the pre-warmed 1 mL FM10 media (the formulation is shown in the key resources table[href=https://www.wicell.org#key-resources-table]) into the MEF and pipet the thawed cells gently.\nTransfer the mixture into a 15 mL Falcon tube.\nNote: You can use a 10 mL pipette here and a 15 mL Falcon tube.\nSubsequently, add another 8 mL FM10 medium (total 10 mL) and mix well.\nRemove 100 μL of cell suspension for counting the cell number.\nCentrifuge at 200 × g for 4 min.\nCount the cell number during centrifuge.\nNote: Add an equal volume (100 μL) of Trypan Blue (dilution factor = 2) and mix by gentle pipetting. Fill both sides of the counting slide with cell suspension (approximately 10 μL) and count cells using automated cell counter, which can calculate the total cell number and concentration of viable and non-viable cells.\nAspirate the supernatant.\nAdd 1 mL pre-warmed FM10 medium.\nTransfer the mixture into a 50 mL Falcon tube.\nAdd another pre-warmed FM10 medium (usually 23 mL: final cell concentration is 1.2 × 105 cells/mL).\nNote: You can use a 10 mL and/or 25 mL pipette here and a 50 mL Falcon tube.",
    "Aspirate the gelatin from the 6-well plate (prepared as described above), and add 2 mL MEF containing FM10 media (2.5 × 105 cells/well).\nIncubate overnight to attach the cells (leave the plate for at least 4 h up to 24 h) in the incubator (Figures 1[href=https://www.wicell.org#fig1]A–1D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/992-Fig1.jpg\nFigure 1. Mouse embryonic fibroblast (MEF) plating\nInactivated MEFs should be plated at a density of 0.3 × 105/cm2 for at least 4 h (A and B), preferably 24 h (C and D) to 48 h (E and F) till 72 h (G and H) before plating embryonic stem cells (ESCs) or induced pluripotent stem cells (iPSCs). MEFs should not be used 4 days after plating (I and J).\nNote: A density of 0.25 × 105 cells/cm2 is a good density for MEF plating (Figure 1[href=https://www.wicell.org#fig1]). This number should be optimized to provide full coverage without being too dense. If there are too many MEFs, there will be no foothold for mESCs/miPSCs to adhere to. Conversely, too little MEF will not provide adequate conditioning of the medium.\nNote: Plating densities of MEFs are listed in Table 1[href=https://www.wicell.org#tbl1]. Inactivated MEF feeder cells should be plated for at least 4 h (Figures 1[href=https://www.wicell.org#fig1]A and 1B) or 1 day (Figures 1[href=https://www.wicell.org#fig1]C and 1D) before the mESCs/miPSC plating to allow for attachment and spread of the MEF layer to completely cover the dish surface. The MEF feeder layer should not be used after 4 days of seeding (Figures 1[href=https://www.wicell.org#fig1]I and 1J).\ntable:files/protocols_protocol_992_3.csv\nThaw and plate mESCs/miPSC frozen vials\nTiming: 20 min for step 20\nTiming: 24 h for step 29\nNote: mESCs and miPSCs are isolated from C57BL6 strain.\nGelatinize the plate with 0.1% gelatin made with cell culture grade for at least 20 min in the incubator.\nTake the frozen vial from the liquid nitrogen tank.",
    "Immediately after that, put the vial on dry ice and bring it to the culture room.\nThaw the vial in the thermo heater.\nBefore completely dissolving (with a small ice block), add the pre-warmed 1 mL FM10 media (the formulation is shown in the key resources table[href=https://www.wicell.org#key-resources-table]) into the mESCs/miPSCs and pipet the thawed cells gently.\nNote: You can use a 5 mL pipette here and a 15 mL Falcon tube.\nNote: Usually, naive mouse ESCs can be efficiently cultured on gelatin coated plates without feeders.\nCentrifuge at 200 × g for 4 min.\nAspirate the supernatant.\nAdd 2–3 mL pre-warmed t2i/L media.\nAspirate the MEF media from the prepared 6-well plate.\nNote: You need to leave the MEF plate for at least 4 h in the 37°C, 5% CO2 incubator.\nNote: Please ensure that the MEFs are 50%–60% confluent (Figures 1[href=https://www.wicell.org#fig1]C and 1D). If it is not confluent, you need to thaw another vial.\nNote: For mESCs/miPSCs derivation, 2i medium containing 15% FBS and feeders were used at p0 for better attachment of blastocysts. After derivation, naive mESCs/miPSCs can be efficiently cultured in serum-free 2i medium on gelatin coated plates without feeders.\nAdd the t2i/L media containing mESCs/miPSCs.\nLeave it in a 37°C, 5% CO2, and 95% humidity incubator for 24 h.\nCulture mESCs/miPSCs\nTiming: 2–3 days\nAfter 24 h of incubation, observe the status of mESCs/miPSCs under a microscope (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/992-Fig2.jpg\nFigure 2. Mouse induced pluripotent stem cells (miPSC) plating\nmiPSCs are plated and observed at 24 h (A), 48 h (B) and 72 h (C) after passage.\nNote: Check to see if mESCs/miPSCs are viable. Small, evenly sized colonies should be evenly attached with good spacing.\nAspirate the t2i/L media.\nAdd 2–3 mL t2i/L media.",
    "Every 24 h, it is necessary to check the cell conditions and change the t2i/L medium with 2–3 mL fresh t2i/L medium (Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nWhen the cells reach 80%–90% confluence, you can passage the cells into another well (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: Usually it takes about 2–3 days to reach confluency.\nNote: If the cell concentration of mESCs/miPSCs is too high and the colonies contact each other, or if the cells are cultured for a long period, they will begin to differentiate. In that case, the edges of the colony become steep, and the center of the colony appears to turn brown.\nPassage mESCs/miPSCs\nTiming: 1–2 h for step 36\nTiming: 24 h for step 52\nNote: Usually, frozen mESCs/miPSCs need to be passaged for 2–3 times for recovery.\nAspirate the t2i/L media.\nAdd 2 mL pre-warmed PBS and washout the culture medium completely in one step. Aspirate the PBS.\nAdd 1 mL pre-warmed 0.25% trypsin.\nNote: Most protocols for culturing and splitting naive mESCs/miPSCs mention the use of Accutase (Gibco A1110501). Accutase is a mixture of natural enzymes with proteolytic and collagenolytic activity, free of mammalian and bacterial components. Accutase is more effective than the combined treatment of trypsin and collagenase in dispersing cells in a less toxic and more gentle manner.\nLeave it for 4 min in the incubator.\nNote: Check trypsin digestion by tapping the plate every 4 min and observing the mESCs/miPSCs break apart the cells under microscope. If the cells do not detach, return the plate to the incubator and tap again after another minute.\nWhile waiting, perform the following steps\nTake the MEF-plated well (not yet plated with mESCs/miPSCs).\nAspirate the FM10 media.\nAdd 2–3 mL pre-warmed t2i/L media.\nAfter 4 min, take the trypsinized mESCs/miPSCs well from the incubator.",
    "Add 1 mL t2i/L media.\nPipette with a 1000 μL Pipetman thoroughly and separate each cell.\nTransfer the cell mixture into a 15 mL Falcon tube.\nAdd another 8 mL FM10 medium (total 10 mL) and mix well with a 10 mL pipette.\nCentrifuge at 200 × g for 4 min.\nAspirate the supernatant, leaving a small amount of medium.\nPipette with a 200 μL Pipetman thoroughly and separate each cell.\nAdd 1 mL pre-warmed t2i/L medium.\nPipette with a 1000 μL Pipetman thoroughly.\nCount the cell number.\nTake the cell-containing media (1 × 105 cells) and transfer into the MEF-plated 6-well plate.\nNote: To identify how each cell line proliferates, we usually try to passage with different cell concentrations of 1:10 to 1:100 (thus, at least 2–3 × MEF-plated wells are needed for each cell line).\nGently move the wells approximately twice in forward-backward and left-right while maintaining a horizontal position to allow the mESCs/miPSCs to be evenly distributed.\nLeave the well in the incubator overnight (12–24 h).\nReplace the medium with t2i/L medium.\nTransfection (electroporation)\nNote: You may use other alternative electroporators such as Nucleofector® (Lonza), Neon® Transfection System (Thermo Fisher Scientific) or Gene Pulser Xcell™ complete system (Bio-Rad).\nDissociation\nTiming: 10–20 min\nNote: After 2–3 passages after thawing, mESCs/miPSC usually recover to a good status. mESCs/miPSCs grow as a three-dimensional colony, not a single layer. Undifferentiated colonies have a rounded appearance with sharp fractal edges. It is difficult to identify the boundaries of individual cells in the colonies. These cells can then be used for transfection.\nAdd 2 mL pre-warmed PBS and washout the culture medium in one step. Aspirate the PBS.\nAdd 1 mL pre-warmed 0.25% trypsin.\nLeave it for 4 min in the incubator.\nDissociate cells into a single-cell suspension by vigorous pipetting.",
    "Add 1 mL t2i/L media.\nCount the cell number.\nTake the cell-containing media (1 × 106 cells) for transfection.\nNote: Make sure the cells are dissociated into single cell completely. The 30–40 μm strainer might be helpful.\nTransfection\nTiming: 20–30 min\nPrepare the pellets by mixing with 3 μg of transposase-expressing vector and 3 μg of the piggyBac transposon gene expression vector (pPB-CAG-mZscan5b-P2A-EGFP) (Niwa et al., 1991[href=https://www.wicell.org#bib3]) purchased from VectorBuilder (VB181015-1188bhq) in 100 μL Opti-MEM media (NEPA Gene) (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/992-Fig3.jpg\nFigure 3. Transfecting transposon-expressing vector with mouse induced pluripotent stem cells (miPSCs) by electroporation\n(A) miPSCs are dissociated into pieces by trypsin.\n(B) Pellets are mixed with transposase-expressing vector and the piggyBac transposon gene expression vector (pPB-CAG-mZscan5b-P2A-EGFP) (Niwa et al., 1991[href=https://www.wicell.org#bib3]) in 100 μL Opti-MEM.\n(C–E) The vectors are transfected to miPSCs by electroporation using NEPA21 (NepaGene) under the following conditions: Poring pulse: 125 V, 5ms-pulse width, 50-ms pulse interval, two pulses, 10% attenuation rate, +; Transfer pulse: 20 V, 50-ms pulse width, 50-ms pulse interval, five pulses, 40% attenuation rate, +/−. The piggyBac transposon gene expression vector in t2i/L medium is then moved into the cytoplasm with a few transfer pulses with a low voltage and long duration after the poring pulse.\n(F) The electroporated cells are plated onto a 6-well MEF plate in mouse t2i/L medium.\nNote: For mESCs/miPSCs transfection, CAG-promoter is recommended. CAG-promoter is reported to be highly active and stable over the long term in the expression of transgenes in mESCs (Hong et al., 2007[href=https://www.wicell.org#bib2]).\nNote: Do not whisk the cell suspension.\nNote: NEPA21 does not need special buffers for transfection.",
    "Transfer the cell suspension to a cuvette. The electroporation conditions were as follows: Poring pulse: 125 V, 5 ms-pulse width, 50-ms pulse interval, two pulses, 10% attenuation rate, +. Transfer pulse: 20 V, 50-ms pulse width, 50-ms pulse interval, five pulses, 40% attenuation rate, +/− (Figures 3[href=https://www.wicell.org#fig3]C–3E).\nThe electroporated cells were plated onto a 6-well MEF plate in a mouse t2i/L medium (Figure 3[href=https://www.wicell.org#fig3]F).\nColony picking of GFP-positive mESCs/miPSCs for single-cell cloning\nTiming: 24 h\nPurpose: To perform initial colony picking of GFP-positive ESCs/iPSCs and maintain master stocks.\nFeeder cells: Inactivated mouse embryonic fibroblast (MEF) feeder cells (Reprocell RCHEFC003).\nTools: Glass tools (World Precision Instruments Inc., TW150-4) or syringe needles can be used for microdissection of colonies for passaging. It is also possible to pick mESC/miPSC colonies using a pipette tip or cell lifter. However, for fine control of dissection when initially isolating good areas of ESC/iPSC colonies from undesirable regions of the colony, glass tools are optimal. For glass tools, Pasteur pipettes are pulled hair thin. Fine glass needles with hooked ends are forged in two steps over a micro burner, as follows:\nWhile holding the two ends of a long Pasteur pipette, place the thin end of the pipette at a distance of about half to two-thirds of the distance away from the tip into the orange part of the flame until the glass melts into a solid constriction (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/992-Fig4.jpg\nFigure 4. Procedure to prepare glass tool",
    "Grasp both ends of the glass capillary and scald it with fire (A). Pull it to both ends after leaving it for 1–2 s (B). When the capillary is stretched, heat it and cut the center (C). The tip of the needle to curl into a hook shape caused by the force of the rising heat (D). Cut it with a ruby pen by making a slit at the end (E). The final product after cut with a ruby pen (F).\nIn a single motion, upon removing the pipette from the flame, pull on each end of the pipette gently and quickly to draw out a thin filament before the glass hardens (Figure 4[href=https://www.wicell.org#fig4]B). This is done without breaking the connection between the two ends of the pipette.\nBeginning several inches above the flame and slowly moving the thin drawn part of the filament down towards the flame, pull a very fine filament, as previously described. The two ends of the pipette should separate, this time forming a fine needle end on the tip of the pipette (Figure 4[href=https://www.wicell.org#fig4]C and 4D).\nIf the tip remained straight after the second pull, pass the fine end a few inches quickly over the top of the flame. The force of the rising heat will curl the tip of the needle into the hook. The hooked end should be thin enough for the microdissection of the colonies but thick enough to withstand some pressure during the dissection (Figures 4[href=https://www.wicell.org#fig4]E and 4F).\nCritical: Glass tool safety precautions – Do not hold glass tool near the sharp (thinner) end.\nCritical: Be careful not to stick yourself with this end of the tool. To guide the tool, the opposite hand can be used to guide the thicker end of the tool.",
    "Note: Be sure to make the appropriate number of tools. Limit to one or two tools per cell line.\nNote: Avoid manual dissection for multiple lines at a time.\nCritical: Be sure to discard tools immediately after use in an appropriate glass tool waste receptacle.\nNote: Set the pore size of the pipette to less than 100 μm (50–70 μm).\nColony picking: For mESC/miPSC colony picking after transfection, identify GFP-positive colonies under a fluorescence microscope. Transfection efficiency of electroporation should be around 20% (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/992-Fig5.jpg\nFigure 5. Green fluorescent protein (GFP)-positive colony picking\nAfter transfecting transposon-expressing vector with mouse induced pluripotent stem cells (miPSCs) by electroporation, around 20% of colonies are GFP-positive (A and B). After colony picking and fluorescence-activated cell sorting (FACS), the ratio of GFP-positive colony gradually increases (C and D).\nBefore microdissection, change the medium in the well to be passaged and on the feeders.\nWash the new feeders once, and add 2 mL t2i/L medium (6-well plate) on them.\nKeep the feeders in the incubator during dissection.\nNote: Please take care while maintaining the temperature, pH, and osmotic pressure of the culture medium by working quickly.\nNote: Utilizing a humidified 5% CO2/20% O2 mixed gas source and a warm plate will help maintain an optimal environment even when the cultured cells are outside the incubator.\nUse fluorescence microscopy to find an ideal colony consisting of small, round, random organized cells with a high ratio of nucleus to cytoplasm that have not yet begun to form structures within the colony.\nCircle the bottom of the dish with the colony to be labeled with a pen.\nBring a stereomicroscope into a laminar flow hood.\nPeel off the whole colony, and incubate those cells in a small amount of 0.25% trypsin (100 μL drop).",
    "Pipet and microdissection of the chunks of approximately 100 cells using the glass hooks (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nNote: If you make a grid of cuts in the colony at the back of the hook, each piece can be easily pulled away from the colony.\nAfter micro-dissection, the cell chunks are swirled into the center of the dish, and 20 to 50 chunks are transferred to the new feeder wells (a small-diameter 4-well dish) using 1 mL micropipettes.\nNote: Pre-coat the micropipette tip with the t2i/L medium so that the cells do not stick (a regular sterile pipette or a Pasteur pipette can also be used).\nLeave the dishes for 24 h to allow the chunks to attach to the dish.\nExchange medium 0.5 mL/well.\nNote: The size of the piece should be sufficiently large to survive the cutting and adhere to the feeder layer. An excessively large piece will tend to form an embryoid body-like structure on the feeder layer as it takes too long for the entirety of a large colony to come into contact with the feeders. The resulting colony will have an area of differentiation in the center arising from the embryoid 24 body-like structure.\nAlternate protocol based on FACS sorting\nPrepare cells for FACS analysis\nTiming: 1–2 h\nAspirate t2i/L culture media from mESC/miPSC culture dishes.\nAdd 0.5 mL (12-well) or 1 mL (6-well) of 0.25% Trypsin.\nIncubate for 5 min at 37°C.\nNeutralize with an equal volume of FM10 media.\nTransfer the dissociated cells to a 15 mL Falcon tube and bring up to 10 mL with FM10 media.\nCentrifuge at 200 × g for 4 min.\nAspirate the supernatant carefully.\nResuspend the cell pellet in PBS medium (volume depends on the cell number).\nSort the transfected stem cells\nTiming: 48–72 h",
    "Check the resolution and sensitivity of the instrument using a standard particle.\nIf you have a control sample, measure them to check the reagents and process.\nAnalyze the cells.\nIsolate and collect cell populations that emit relatively more fluorescence at a specific excitation wavelength (488 nm excitation) (Figures 6[href=https://www.wicell.org#fig6]A–6C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/992-Fig6.jpg\nFigure 6. Sorting purified green fluorescent protein (GFP)-positive mouse induced pluripotent stem cells (miPSCs) by fluorescence-activated cell sorting (FACS)\n(A–C) (A) A representative negative control for FACS plot using miPSCs (A). Sorting GFP+ miPSCs after single-cell picking (B) and FACS (C).\nAfter the GFP-expressing cells have been sorted, plate the cells onto MEF coated plates.\nClosely follow/watch the cells every day for 2–3 days (Figures 5[href=https://www.wicell.org#fig5]C and 5D).\nNote: To improve the recovery rate of transfected cells, we tried both colony picking with glass tools and then further sorting by FACS.\nMEF preparation\nTiming: 4 h (plus incubation overnight)\nSee the MEF preparation step shown above (steps 4–19).\nPassage transfected mESCs/miPSCs\nTiming: 4 h (plus incubation overnight)\nAspirate the t2i/L media.\nAdd 2 mL pre-warmed PBS and washout the culture medium in one step. Aspirate the PBS.\nAdd 1 mL pre-warmed 0.25% Trypsin.\nLeave it for 4 min in the incubator.\nWhile waiting, perform the following steps\nTake the MEF-plated well (not yet mESCs/miPSCs plated).\nAspirate media.\nAdd 2–3 mL pre warmed t2i/L media.\nAfter 4 min, take the trypsin-plated well from the incubator.\nAdd 1 mL FM10 media.\nPipette with a 1000 μL Pipetman thoroughly and separate each cell.\nNote: Use filter tip to prevent bacterial contamination.\nTransfer the mixture into a 15 mL Falcon tube.\nAdd another 8 mL FM10 medium, and mix well with a 10 mL pipette.\nCentrifuge at 200 × g for 4 min.\nAspirate the supernatant.\nAdd 1 mL pre-warmed FM10 medium.",
    "Pipette with a 1000 μL Pipetman thoroughly and separate each cell.\nCount the cell number.\nTake 100 μL (1:10) cell-containing medium (1 × 105 cells) and transfer into the MEF-plated well of a 6-well plate.\nNote: Usually, I performed 1:5, 1:10, and 1:20 passages into the different wells of a 6-well plate (accordingly, at least 2–3 × MEF-plated wells per cell line are needed).\nShake the mESCs/miPSC well so that cells can be plated into the whole well.\nIncubate the well overnight (12–24 h).\nReplace the medium with t2i/L medium."
  ],
  "subjectAreas": [
    "Genomics",
    "Stem Cells",
    "Flow Cytometry",
    "Cell Culture",
    "Cell Biology",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}