{
  "id": 6003,
  "origin_website": "Bio",
  "title": "Intravenous Labeling and Analysis of the Content of Thymic Perivascular Spaces",
  "procedures": [
    "Note: All animal procedures must be approved by your institution’s ethics committee. Intravenous labeling and sample preparationNote: Perform Steps A6-A8 in a class-II biosafety cabinet/laminar flow hood with exhaust. Figure 1 shows an outline of the procedure up to the tissue collection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228013100_5701.jpgFigure 1. Outline of IV labeling and tissue collection. Experimental procedures prior to magnetic cell sorting are depicted as explained in the text. It is important to work quickly and do one animal at a time, such that the time from injection to single cell suspension does not vary greatly between samples.Prepare anti-CD45-PE/PBS solution (1 μg/200 μl): Dilute 5 μl anti-CD45.2-PE in 195 μl PBS in a 1.5 ml microcentrifuge tube, vortex, place on ice, covered with aluminum foil.Note: It is advisable to prepare 5-10% more solution than needed to account for solution loss within the syringe dead space. Prepare a 6-well plate with 5 ml FACS buffer (see Recipes) and a 70 μm cell strainer per well for collection of thymi, place on ice.Prepare 1.5 ml microcentrifuge tubes with 20 μl heparin for blood collection, place on ice.Working one animal at a time, warm up mice with a heat lamp until tail vein is dilated (usually ~5 min), constantly monitoring mice to avoid overheating or burning. Set timer 3 min. When tail vein is dilated, inject 200 μl of the anti-CD45-PE/PBS solution into the tail-vein, using a 1 ml insulin syringe. Immediately after injection, start the timer.Note: Include mice injected with 200 μl PBS as negative controls.",
    "While the timer is running, prepare a glass jar inside a class-II biosafety cabinet with exhaust for the isoflurane drop method: Place a folded tissue soaked with 2 ml isoflurane into the bottom part of a 2,000 ml drop glass jar, and place insert on top, ensuring physical separation of isoflurane-soaked tissue and the mouse. When the timer goes off 3 min after the injection, place the mouse inside the prepared glass jar and close the lid.After 1 min (mouse should be anesthetized), euthanize mouse by cervical dislocation.Open the chest of the animal and collect blood by cardiac puncture, using a 1 ml insulin syringe: Insert the needle about 5 mm into the heart, and gently pull the plunger (Figures 2A and 2B). Empty the syringe content (usually around 0.2-0.5 ml) into a heparinized 1.5 ml microcentrifuge tube, and place the collection tube with blood on ice. Cover samples with aluminum foil to protect from light until further processing.Collect the thymus and remove blood vessels attached to the outside of the thymus (Figures 2C-2E). Suspend in 5 ml cold FACS buffer (6-well plate with 70 μm cell strainer) on ice, and immediately dissociate the tissue by mashing it with the plunger of a 3 ml syringe and pressing it through the cell strainer into the well. Discard the strainer with the remaining connective tissue. Repeat for each thymus. Cover samples with aluminum foil to protect from light until further processing.Blood samples: Transfer blood into 5 ml flow cytometry tubes, add 2 ml ACK lysis buffer (see Recipes), keep at room temperature (RT) for 2 min, spin for 3 min at 524 x g (1,500 RPM), 4 °C, discard supernatant.",
    "Repeat 2 times (resuspending pellets in ACK lysis buffer) and finally resuspend cells in 1 ml cold FACS buffer and place on ice.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228013158_8433.jpgFigure 2. Outline of cardiac blood and thymus collection. A. The thymus is localized right above the heart. B. Blood is drawn from the heart with an insulin syringe. C. To remove the thymus, tweak it at the base with a curved forceps and gently pull. D. The thymus is covered with blood vessels, which should be removed with a curved forceps as best as possible. E. Thymus after removal of lining blood vessels.MACS enrichment of i.v.-labeled (IV+) cells from thymic samplesDetermine cell count of each sample by hemacytometer (usually 150-250 x 106).Resuspend cells to 1 x 107/80 μl MACS buffer (see Recipes).Set 40 μl (5 x 106) of each sample aside as an untouched control, and fill up to 1 ml with FACS buffer, keep on ice. Cover with aluminum foil.In accordance with the Miltenyi protocol (included with the anti-PE MicroBeads), add 20 μl anti-PE beads per 80 μl to the remaining suspensions. Note: In our experience, this protocol also works with lower amounts of beads. E.g., resuspend cells to 1 x 107/40 μl MACS buffer and add 10 μl beads. Further reduction of beads might be possible. If looking at abundant cells, a fraction of the thymic sample could be sufficient for enrichment.Mix, and incubate in the refrigerator (4 °C) for 15 min, protected from light.Wash samples 2 x with 1 ml MACS buffer (spin for 5 min at 524 x g (1,500 RPM), 4 °C, discard supernatant, resuspend in MACS buffer).After the second wash step, resuspend the samples at up to 1 x 108 in 500 μl MACS buffer.Perform magnetic separation using LS columns and according to the Miltenyi protocol.",
    "Collect the magnetically-labeled (IV+) fractions in 15 ml centrifuge tubes. Note: We use untouched fractions of samples as controls. The flowthrough from the magnetic separation step can also be collected as a negative control. We generally observed no differences between the untouched and flowthrough IV- fractions when analyzed.Antibody- and tetramer-labeling for flow cytometryDetermine cell count of each IV+ eluted sample (and IV- flowthrough sample, if collected)Spin samples (including untouched fractions) for 5 min at 524 x g RPM (1,500), 4 °C, discard supernatant, resuspend in 200 μl FACS buffer and transfer each sample into a well of a 96 round-bottom well plate, place on ice.Note: We stain samples at up to 5 x 106 cells per 50 μl master-mix (see below). The IV+ fraction per thymus, and the untouched fractions are generally within this range. If collecting flowthrough fractions, we recommend to determine the cell number and stain 5 x 106 cells.Determine cell numbers of the blood samples and transfer 5 x 106 cells per sample into individual wells.Live/Dead discriminator: In our lab we frequently use Live/Dead Fixable Aqua kit. We use this kit prior to labeling with markers of interest, and stain cells for 20 min on ice in PBS (without added protein) with 1:1,000 Live/Dead discriminator. This amine-binding discriminator stains cells that have lost their membrane integrity, and positively stained (dead) cells should be excluded when analyzing the FACS data.Wash samples 3 x with 200 μl FACS buffer (spin for 5 min at 524 x g (1,500 RPM), 4 °C, discard supernatant, resuspend in FACS buffer).Prepare master mix for labeling for FACS. We use most antibodies at 1:200 μl and CD1d-tetramer at 1:400 in FACS buffer, 50 μl per 5 x 106 cells.",
    "We typically include the following set of antibodies to analyze CD4+CD8α- (CD4 single-positive, SP), CD4-CD8α+ (CD8 SP), CD4+CD8α+ (double-positive, DP) and IEL-precursor (CD1d-tetramer-CD25-CD4-CD8α-CD5+TCRα+CD122+H-2Kb+ PD-1+ or PD-1-NK1.1+) T cells (panel 1), or B cells (CD19+I-Ab+), dendritic cells (CD11c+I-Ab+) and CD11b+GR-1+ myeloid cells (panel 2), and these panels can be extended/substituted according to the cells of interest: Panel 1: CD1d-tetramer, CD25 TCRβ, CD4, CD8α, CD5, CD122, H-2Kb, PD-1, NK1.1; Panel 2: CD11c, I-Ab, CD19, CD11b, GR1.Note: If B cells or myeloid cells are the specific focus of investigation, it is advisable to include an Fc receptor blocker (anti-CD16/32).Spin 96-well plate with samples for 5 min at 524 x g (1,500 RPM), 4 °C, discard supernatant, resuspend in 50 μl master mix per 5 x 106 cells. Keep on ice, covered with aluminum foil, for 20 min.Wash samples 3 x with 200 μl FACS buffer (spin for 5 min at 524 x g (1,500 RPM), 4 °C, discard supernatant, resuspend in FACS buffer).After the final wash step, resuspend each sample in 200 μl FACS buffer and transfer into polystyrene FACS tubes. Keep on ice and cover with aluminum foil until acquisition.Flow cytometrySet up compensation on a flow cytometer.Acquire samples."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}