{
  "id": 18728,
  "origin_website": "Jove",
  "title": "Automated Measurement of Microcirculatory Blood Flow Velocity in Pulmonary Metastases of Rats",
  "procedures": [
    "NOTE: All animal related procedures described in this protocol have been previously approved by the Duke University Institutional Animal Care and Use Committee (DUIACUC).\n1. Cancer Cell Culture and Injection\nCultivate fluorescently labeled metastatic cancer cells (e.g. human MDAMB231-GFP breast cancer cells, gift from Dr. Patricia Steeg, NCI, and YFP-labeled mouse sarcoma cells, gift from Dr. David Kirsch, Duke University Medical Center, Department of Radiation Oncology) in appropriate culture medium (e.g. Dulbecco’s Modified Eagle Medium (DMEM) with 10% fetal bovine serum and 1% penicillin/streptavidin) at 37 °C until approximately 90% confluent.\nTrypsinize cells, wash them 2 times with PBS, count, and then inject them into the tail veins of isoflurane-anesthetized 10 weeks old female nude rats at 5 million cells per animal, using a syringe with a 27 G needle. Surgical level anesthesia is verified by the lack of reaction to toe pinch.\n2. Monitoring of Metastases Using MicroCT\nExamine rats once a week using a micro-CT/micro-Irradiator, to detect the presence of metastases above approximately 2 mm in diameter in diameter. The micro-CT is commissioned as previously described12.\n\t\nSubject rats to 3% isoflurane anesthesia prior to imaging. Confirm deep anesthesia by toe pinch.\nAfter onset of anesthesia, quickly transfer rats to the imaging cradle in the imaging chamber and connect via a nose-cone to an isoflurane-air mixture at 2.5-3%. Adjust the position of the rat in the cradle in a way that its thorax is positioned in the photon beam of the MicroCT scanner, using the external position controls and laser delimiter on the imaging cradle. Ensure the door to the imaging chamber is closed, to shield the investigator from the gamma rays.",
    "Control the position of the animal again using the color video camera. Perform a low-resolution CT imaging test run, and use the resulting image to adjust the field of view to the xyz dimensions of the thoracic cavity.\nImage the rat thorax using a 2 mm Al filter at 40 kVp, 2.5 mA, and 0.008 voxel at 7 FPS and return the animal to its cage. Imaging of one animal should take not more than 15 or 20 min. Do not return an animal that has undergone surgery to the company of other animals until fully recovered. Do not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nConfirm metastases by the appearance of relatively radio-opaque objects that cannot be explained by intrathoracic blood vessels (Figure 1A)\n3. Window Chamber Surgery\nAnesthesia, vital signs and tail vein catheterization\n\t\nSelect animals with presence of metastatic disease. Inject animal with an intraperitoneal dose of 50 mg/kg pentobarbital. Confirm surgical-level anesthesia by toe pinch before proceeding.\n\t\t Note: Anesthesia protocols should be matched to the respective experimental setup. Pentobarbital was chosen here as a long-acting anesthetic, in order to induce deep anesthesia for lengthy procedures, while offering the option of facile re-dosing. However, loss of animals to overdosing is a common problem with pentobarbital anesthesia. Another option that preserves autonomic reflexes to a larger degree than pentobarbital is ketamine in combination with sedatives such as xylazine or medetomidine, which however permits only for a single re-dosing cycle.\nShave animals on the side of the body that has the metastatic disease, and in the neck area, using a clipper. Wipe off all remaining loose hair from the skin. After loose hair is removed, apply veterinary ointment to the eyes, to prevent them from drying out.",
    "NOTE: Athymic nude rats may have residual hair that requires removal before proceeding with surgical procedures. It is very important to remove all hair thoroughly, as it may interfere with surgical procedures and imaging.\nFix the animal in a supine position on a metal plate that is placed on a 37 °C water circulated heating pad. The front and hind extremities are fixed on the plate with tape.\n\t\tNOTE: It is useful to control and record vital signs, such as heart rates and arterial blood oxygenation by using a pulse oximeter, throughout surgical and experimental procedures.\nTracheal intubation\n\t\nIn order to place a catheter for ventilation of the animal, first make a transversal cervical skin incision, followed by the median separation of the longitudinal musculature ventral to the trachea.\nUse repeated opening-to-closing action with a sharp forceps to create a passage for the suture through the dorsal side of the trachea.\nMake a small incision into the trachea on the ventral side, not more than semi-circular, approximately between the second and third tracheal ring. Leave a sufficiently long portion of the trachea exposed on the dorsal surface, to enable fixation of the tracheal catheter.\nInsert a 2.5 to 3.0 mm “Y” tracheal cannula into the trachea, and tighten with a 4-0 monofilament suture. Ensure the cannula is connected to a pressure cycled ventilator with a bottle connected to the expiration duct that is filled with 6 cm of water, to maintain positive pulmonary pressure. Inflowing gas should be 100% oxygen, unless experimentally desired otherwise.\nInsert a catheter with a 25-27 G needle, and filled with heparinized saline into one of the tail veins of the rat, and fix in place with tape.",
    "NOTE: Ensure patency of the tail vein catheter throughout the procedure by repeatedly injecting a small amount of heparinized saline into the tail vein. Also, oro-tracheal intubation, i.e. the guidance of a tracheal tube via the mouth of the anesthetized animal and past the larynx into the trachea, is a possible alternative to the tracheotomy procedure that is described here. However,this method requires special training and experience, to avoid damage to the trachea, and also to preclude the accidental cannulation of the esophagus. \nApplication of pulmonary window\n\t\nRemove the skin from the side of the chest where the metastatic disease is located, by creating an incision, and then detaching the skin using blunt dissection.\n\t\t Note: The skin can be excised and removed subsequent to detachment\nProceed by dissecting the two layers of overlaying musculature (pectoralis, serratus, and latissimus dorsi), but leaving the intercostal muscles intact. Create a perforation in the chest cavity of approximately 1.5 cm in diameter, by removing portions of typically two adjacent ribs. Ideally, locate the perforation in of the region of the sixth and seventh ribs.\nOsteotomy:\n\t\t\nTo minimize bleeding and damage to the lung surface, tightly hold the rib to be cut with a toothed surgical forceps during cutting. Using surgical scissors, cut the medial side of the rib first, at an angle of approximately 45°, leaving the pointed side of the remaining rib bone pointing outside.\nSubsequently, cut the lateral side of the rib bone in a similar manner, again leaving the pointed side of the rib bone pointing outwards, to prevent damage to the lung surface.",
    "Repeat the procedure for the adjacent rib, then cut the intercostal muscles and remove the excised piece. During this procedure, maintain lung pressure in a way that mechanical interaction between the lung surface and the rib cage is minimized. Do this by appropriately regulating inspiration pressure on the ventilator.\nInsertion of the window:\n\t\t\nInsert a custom made lung window, consisting of a coverglass that is attached to a Plexiglas socket (Figure 1B). Attach the window to the socket by gluing, or by applying a very small amount of vacuum grease. Insert the window in a way that surface metastases are located close to the center of the window. If necessary, adjust the inserted hole to bring the micrometastasis to the center of the window by enlarging the hole slightly to the respective side.\n\t\t\tNOTE: Metastatic disease on the pleural surface can be identified as clearly recognizable white dots or areas within the otherwise pink-to-salmon colored healthy parts of the lung surface that appear predominantly along the fissures. While micrometastases can occur on other areas of the pleural exterior, the investigated cell lines almost always display surfacing micrometastases in the perforated area, once metastatic disease can be radiologically detected.\nAfter inserting the socket into the perforation, and creating direct contact with the visceral pleura of the lung, suture the edges of the window frame to the surrounding intercostal muscle, using 4.0 monofilament suture (Figure 1C). Use a slight increase of inspiration pressure on the ventilator to help residual air to escape and to create a seal.",
    "Note: The respiration rate of rats can vary greatly, depending on the status of anesthesia, status of excitement or anxiety, oxygen concentration of inspired air (FiO2), etc. It is recommendable to adjust the respiration rate between 70 and 90 bpm. The inspiration pressure should be adjusted with caution and not be set to more than approx. 8 cm H2O (0.6 mmHg), to avoid damage to the lung surface.\nPosition the animal in a custom designed restrainer that is designed to eliminate Z-directional movement (Figure 1D) on a steel plate that is positioned on a thermostatic (electrical) heating blanket, under a fluorescence microscope. Control the animal’s body temperature using a rectal thermistor. Adjust the screws of the animal restrainer, and the inspiration pressure on the ventilator to achieve optimal control of lateral movement.\n\t\t Note: Natural breathing in mammals involves all three directions of lung movement and chest extension: bilateral, dorso-ventral, and cranio-caudal. In order to preserve the natural breathing movement as much as possible, it is important to minimize Z-directional compression to the necessary extent. Because the Z-dimensional restraint has the potential to introduce artifacts that may affect blood flow and other parameters, it is advisable to keep conditions constant during series of repeated measurements in the same animal.\n4. Imaging and Measurement of Microcirculatory Blood Flow\nCollect red blood cells via cardiac puncture and label them with DiI (1,1=-dioctadecyl-3,3,3=,3=-tetramethyl-indocarbocyanine perchlorate), as described previously 10.\nInject 300 µl of labeled red blood cells into the tail vein of the rat before the window chamber surgery is done, to avoid first pass adhesion effects to the glass window. Eliminate any air bubbles in the syringe or catheter, as introduction of air into the vein will inhibit any further injections.",
    "Image blood flow with a microscope CCD camera at -40 °C chip cooling temperature, and approximately 100X overall resolution (i.e. with a 10X microscope objective, and 10X pre-camera ocular). Use standard Rhodamine/ TRITC filter sets (excitation 450-490 nm, emission >515 nm). Record the actual frame rate and pixel resolution of the resulting image sequences. Record at least 200 (ideally around 300) images per stack, to ensure successful analysis of flow velocity.\nReplenish fluid loss in the animal by injecting approximately 1 ml of saline i.p. every hr.\n\tNOTE: Experimental settings that involve an intervention, e.g. a drug that modifies the blood flow velocity in a pulmonary cancer metastasis, requires repeated measurements of blood flow velocity in pulmonary metastatic cancer. For these extended experiments, it is important to replenish the animal with sufficient fluid.\nEuthanize the animals by infusion of 3 ml of 3N KCl into the tail vein\nEvaluate the image stacks using a published, publically available Matlab-based computer algorithm that will create flow velocity grayscale and color encoded maps for all blood flow traces 10,11. Subsequently evaluate the resulting grayscale images by using commercial or publicly available image analysis software, such as Image J, after thresholding off values that indicate no movement of blood cells, i.e. no active vasculature.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}