{
  "id": 8457,
  "origin_website": "Jove",
  "title": "Double In Utero Electroporation to Target Temporally and Spatially Separated Cell Populations",
  "procedures": [
    "The procedure herein described has been approved by the ethical committee in charge of experimentation, the animal welfare of the Universidad de Valencia and the Conselleria de Agricultura, Desarrollo Rural, Emergencia Climática y Transición Ecológica of the Comunidad Valenciana, and adheres to the guidelines of the International Council for Laboratory Animal Science (ICLAS) reviewed in the Real Decreto 53/2013 of the Spanish legislation as well as in the Directive 2010/63/EU of the European Parliament and of the Council.\nNOTE: This protocol involves two different purposes: 1) the first study, referred to as “strategy A”, allows the analysis of the interactions between Cajal-Retzius cells (CR-cells) and early-born cortical projection neurons within the same brain hemisphere; 2) the second study, “strategy B”, is carried out in order to examine the innervation of the upper layer callosal projection neurons to the contralateral side of the neocortex.\n1. Presurgery preparation\nDNA preparation\n\t\nTransform chemically or electrocompetent E. coli DH5α cells with the plasmids of interest, plate them on LB agar plates with the appropriate antibiotic, and incubate them overnight at 37 °C.\n\t\tNOTE: All plasmids used here contain the general promoter for chicken β-actin (CAG) driving the expression of a fluorescent-reporter protein (CAG-mCherry and CAG-EGFP for strategy A and CAG-BFP and CAG-nEGFP-2A-mtdTomato for strategy B). All of them contain resistance to ampicillin (AMP).\nPick individual colonies from each plasmid transformation and initiate a starter liquid culture in 2 mL of Luria broth + ampicillin (LB+AMP) in bacterial culture tubes during 3−4 h at 37 °C with vigorous shaking (200 rpm). After, set a larger bacterial culture in a 500 mL Erlenmeyer flask adding 200 mL of LB+AMP and 1 mL of the starter culture. Incubate overnight at 37 °C in the orbital shaker at 200 rpm.",
    "Use an endotoxin-free maxi-prep kit (Table of Materials) following the manufacturer’s instructions to obtain pure and concentrated plasmid DNA from the liquid cultures. Resuspend the DNA in ~50−100 µL of endotoxin-free Tris-EDTA (TE) buffer to obtain concentrations of at least 5 µg/µL.\nFor each surgery, prepare a solution with a final volume of 10 µL containing 1 µL of fast green dye, plasmid DNA solution of interest for a final concentration of 1 µg/µL for each plasmid, and endotoxin-free TE buffer. For example, mix 1 µL of fast green dye, 2 µL of a 5 µg/µL plasmid DNA solution, and 7 µL of TE buffer.\nPipette pulling\n\t\nPull borosilicate glass capillaries (1/0.58 mm outer/inner diameter) in a vertical micropipette puller until the tip reaches a length of 1−1.5 cm and trim it using dissecting forceps at an angle of approximately 30° under a dissecting scope.\nSurgery room setup\n\t\nPut all the equipment on the operating table (i.e., tweezers, scissors, forceps, micropipettes, needle, and needle holder). Turn on the heating pad and cover it with a sterile surgical absorbent pad. Ensure that the reservoir in the machine for inhalation anesthesia is filled with isoflurane, the oxygen tank contains enough oxygen, and the system functions properly.\n\t\tNOTE: The surgery room and the resistant material must be kept as sterile as possible (i.e., all the material must be autoclaved before the surgery and surfaces must be sanitized with 70% ethanol). Platinum electrodes need to be carefully disinfected first with germicidal soap and second with 70% ethanol prior the surgery.\nPrepare 100 mL of 0.9% (w/v) sterile saline solution containing penicillin-streptomycin 1:100 and fill a 10 cm Petri dish. Place the plate on top of the heated pad to warm up the solution.",
    "Fill a 1 mL syringe with 150 µL of an analgesic solution (e.g., 0.1 mg/kg buprenorphine).\nLoad the pulled pipette with 5 µL of the final plasmid DNA solution prepared in step 1.1.4. Connect the capillary to a mouth-controlled aspirator tube.\n2. First in utero electroporation surgery\nPlace an E11.5 (strategy A) or E13.5 (strategy B) C57BL/6 pregnant mouse inside a closed induction chamber with 2.5% (v/v) isoflurane at 0.8 L/min and wait until it is anesthetized. Transfer the mouse to the heating pad and put its nose into a mask for constant delivery of isoflurane. Check for the absence of a pedal reflex as an indicator of proper anesthesia.\nNOTE: Embryonic age is determined based on the day when the vaginal plug is observed (E0.5).\nInject the pregnant female with the analgesic solution (0.1 mg/kg buprenorphine) subcutaneously. To prevent the eyes from drying during the procedure, apply one drop of eye ointment in each eye using a cotton swab.\nShave the mouse abdominal area with an electric razor and wash it 2x with 70% (v/v) ethanol wipes, once with iodine wipes, and one last time with an ethanol wipe.\nUse scissors to make a 30 mm long incision through the skin in the right side of the animal and carefully separate the adjacent skin from the muscle with a blunt spatula. Afterwards, make a second incision in the abdominal wall.\nCover the abdomen with a piece of folded tissue paper previously disinfected with 70% ethanol containing a 40 mm long slit in its center. Carefully pull the uterus out of the abdominal cavity with ring forceps.\n\tNOTE: The uterus must be kept wet with the warm saline solution prepared in step 1.3.2 during the whole procedure.",
    "Preload the pulled pipettes with the DNA solution prepared in step 1.1.4. Inject ~0.5 µL of the DNA solution per embryo into the lateral ventricle of the selected hemisphere using the mouth-controlled aspirator tube until the fast green dye is noticeable inside the ventricle.\nPlace forceps-type platinum electrodes laterally around the head of the injected embryo (as shown in Figure 1A and Figure 2A). Orient the electrodes to target the desired brain region. Direct the positive pole towards the medial wall to electroporate the cortical hem (strategy A) or towards the lateral cortex (strategy B) to label cells generated in that area.\n\tNOTE: In all cases, the heart and placenta must be avoided to ensure embryonic survival.\nApply the specific sequence of electric pulses with a square wave electroporator following the indications shown in Table 1 (strategy A E11.5 embryos: four pulses of 25 V and 40 ms, separated by 950 ms intervals; strategy B E13.5 embryos: five pulses of 35 V and 60 ms, with 950 ms intervals).\nCarefully place the uterus back into the abdominal cavity with forceps, fill it with warm saline solution, and close the abdominal wall with a needle 6-0 suture. Join the two sides of the initial incision made in the skin either using a needle 6-0 suture or suture clips.\nMaintain the animal on the heating pad and monitor it until its recovery from anesthesia. Provide an extra dose of analgesia (150 µL) in a hydrogel solution placed in its home cage.\n24 hours after surgery, administer an extra dose of analgesia (150 µL). Continue daily monitoring by visual inspection for possible pain and distress. Observe the animal’s behavior, test its normal hind limb reflexes, and inspect the suture for possible signs of damage due to licking or scratching of the wound.",
    "3. Second in utero electroporation\nTwo days after the initial surgery, repeat steps 2.1−2.3. Although the recovery of pregnant females after the surgery is very good, check that they show normal behavior and present no signs of pain or distress before performing the second surgery (E13.5 embryos for strategy A and E15.5 for strategy B).\nMake a 30 mm long incision through the skin as in step 2.4 and a second incision at the abdominal wall, this time in the left side of the animal. Carefully expose the uterus on top of a disinfected tissue as described in step 2.5.\n\tNOTE: Be careful not to interfere with the incision previously made in the other side.\nInject around 0.5 µL per embryo of the DNA solution into the lateral brain ventricle of the hemisphere previously electroporated in the case of strategy A and in the lateral brain ventricle of the contralateral hemisphere for strategy B.\n\tNOTE: Use only embryos showing normal development and no signs of reabsorption.\nPlace the electrodes around the embryo’s head as described in step 2.7, directing the positive electrode towards the lateral cortex and apply the appropriate pulses following the indications shown in Table 1 (strategy A E13.5 embryos: five pulses of 35 V and 60 ms separated by 950 ms intervals; strategy B E15.5 embryos: five pulses of 50 V and 80 ms separated by 950 ms intervals).\nContinue and finish the surgery as described in steps 2.8−2.10.\n4. Tissue harvesting and sectioning\nStrategy A\n\t\nFour days after the second electroporation (E17.5), perform cervical dislocation of the pregnant female and place it in a supine position.\nUsing scissors, make a ventral incision to extract the uterine horns and with forceps place them in a Petri dish filled with 1x phosphate-buffered saline (PBS) placed on ice.",
    "NOTE: The low temperature makes the anesthetization of the embryos possible.\nUsing tweezers, extract the embryos out of the amniotic sac and transfer them with forceps to a new PBS-filled Petri dish under a dissecting scope. Carefully hold the head of the embryos using forceps and conduct brain dissection with tweezers to first remove the skin over the head and then the skull. Use a spatula to pull out the exposed brains.\nCollect the brains with a spoon and deposit them in a 48 well plate filled with the fixative solution (4% [w/v] paraformaldehyde [PFA] in 1x PBS). Test immediately for the successful outcome of both electroporations by examining the brains using an inverted epifluorescence microscope, for example.\nFixate the embryonic brains overnight at 4 °C in an orbital shaker. Wash with 1x PBS to eliminate traces of PFA. Then transfer them to PBS with antifungal preservatives (1x PBS-0.05% (w/v) sodium azide).\n\t\tCAUTION: PFA and sodium azide are cytotoxic compounds that require special precaution during their utilization.\nEmbed the fixated brains in 4% (w/v) low melting point agarose in 1x PBS and wait ~10 min until it solidifies. Stick them to the vibratome tissue holder using cyanoacrylate glue with the olfactory bulbs facing upwards to obtain coronal sections.\nInitiate the vibratome and select the desired parameters: 100 µm width, 0.60 µm/s speed, and 0.60 mm of amplitude.\nSecure the brain inside the vibratome container, fill it with 1x PBS solution, and begin collecting coronal serial sections with the help of a brush in a 48 well plate filled with 1x PBS-0.05% (w/v) sodium azide to have a complete depiction of the brain (e.g., around seven sections per well and six wells per embryo).",
    "Mount the desired sections in microscope glass slides using a fine brush. Cover them with glass coverslips. For long-term storage add mounting medium, which prevents photobleaching and photooxidation. Observe the slides under an upright epifluorescence microscope to assess electroporation efficacy.\nStrategy B\n\t\nLet the pups previously electroporated at E13.5 and E15.5 be born and wait until P15 to perform transcardial perfusion using the same fixative solution used in step 4.1.4.\nJust before perfusion, intraperitoneally administer a dose of 75/1 mg/kg ketamine/medetomidine. When the pedal reflex is lost, secure the mouse in a supine position and make a ventral incision following the middle line using scissors to expose both the rib cage and diaphragm.\nCut the diaphragm and open the rib cage to gain access to the heart. Hold the rib cage using a hemostat and make an incision in the right atrium with fine scissors.\nPenetrate the left ventricle with a needle connected with a flexible tube to a peristaltic perfusion pump. Start transcardial perfusion, delivering at least 25 mL of 4% PFA at a constant flux of 5.5 mL/min (total time ~5 min).\nDissect the brain of perfused animals. First, remove the skin over the head with scissors and forceps. Start cutting the skull using scissors and carefully pull off sections of the skull bones until they are completely removed. Finally, extract the brain with the help of a spatula.\nTransfer the brains to a 24 well plate and fix them with 4% PFA overnight at 4 °C on an orbital shaker. Stop fixation by replacing PFA with 0.05% (w/v) sodium azide in PBS.\n\t\tNOTE: As indicated in step 4.1.5, it is advisable to carry out an intermediate wash with 1x PBS.",
    "Repeat steps 4.1.6−4.1.9, changing the vibratome parameters for postnatal brains (40 µm width, 1.20 µm/s speed, and 0.5 mm of amplitude).\n\t\tNOTE: Immunohistochemistry or immunofluorescence can be carried out to detect specific cell markers or enhance the signal of fluorescent proteins used in electroporation.\n5. Confocal fluorescence imaging and analysis\nTurn on the confocal microscope, place the microscope slides containing the mounted brain sections onto the microscope slides holder and select the channels at which fluorescence images will be taken (i.e., 420−460 nm for BFP, 490−540 nm for GFP, and 570−620 nm for mCherry and tdTomato).\nPerform sample scanning to obtain map images of each brain section at two different wavelengths for a general view of the double electroporation output. Once finished, select the 10x lens and the multi-area-Z-stack-timelapse observation mode. This will allow programming the automatic acquisition of fluorescence images at different XYZ localizations within brain sections.\nIn each of the chosen regions (XY), set proper imaging parameters (i.e., laser intensity, photomultiplier sensitivity, and a minimum resolution of 1,024 x 1,024), as well as the depth of the scanning (Z) according to the planes of the sample where fluorescence is visible.\nObtain low magnification (10x) images of all the chosen regions and export them from OIF to TIFF format using the microscope viewer software.\nChange to the 60x lens, repeat step 5.3 and capture high magnification images to observe the cell-cell interactions in a more detailed manner. Export them as indicated in step 5.4.\nOpen the acquired images with any imaging software (e.g., Fiji) for further analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}