{
  "id": 8538,
  "origin_website": "Jove",
  "title": "Functional MRI in Conjunction with a Novel MRI-compatible Hand-induced Robotic Device to Evaluate Rehabilitation of Individuals Recovering from Hand Grip Deficits",
  "procedures": [
    "All experiments were approved by the Institutional Review Board at Massachusetts General Hospital and performed as approved at the Athinoula A. Martinos Center for Biomedical Imaging.\n1. Subject Preparation\nNOTE: Inclusion criteria are: (i) right hand dominance, (ii) ability to give written informed consent. Exclusion was implemented on the basis of screening for contra-indicators in the magnetic resonance environment such as the following: (a) Routine MRI exclusion criteria, such as the presence of a pacemaker or cerebral aneurysm clip and metal implants or metal content in body; (b) history of seizures (c) claustrophobia; (d) pregnancy.\nTo obtain informed consent, read the consent form to the volunteer. Both the volunteer and investigator sign in the appropriate locations on consent form in duplicate. Leave one signed copy of consent form in an appropriate location for the investigator records. Keep the second copy of consent form for the participant’s records.\nScreen the volunteer for MRI (magnetic resonance imaging) contra-indications. Fill out the MRI contra-indications list and inquire about each item on the list, checking off boxes as appropriate.\nDo not proceed with the scan if participants have (or potentially have) any contra-indications, including surgical aneurysm clips, cardiac pacemaker, prosthetic heart valve, neurostimulator, implanted pumps, cochlear implants, metal rods, plates, screws, hearing aid or transdermal patch.\n2. Setup\nPerform initial setup in the scanner room.\n\tNOTE: All necessary training must be obtained by the investigator in advance of the procedure. Precautions relevant to the MR facility must be taken at all times.\n\t\nBring the MR_CHIROD (Magnetic Resonance-Compatible Hand Induced Robotic Device) into the MRI scanner room and place it near the penetration panel. Insert the 3/8-inch pneumatic tube into the pass-through tube in the panel into the adjacent MRI support room.",
    "Connect the MRI scanner room force sensing and encoder cables to the 9-pin D-shaped (DSUB) connector on the scanner room side of the panel.\nSetup the MRI support room.\nPlug the air compressor into a 110VAC wall outlet. With the compressor’s internal regulator turned to the off/minimum pressure position and the ball valve in off-position, turn on compressor and allow it to come to full internal pressure (~4 min).\nConnect the support room force sensing and encoder cables to the DSUB connector on the external side of the penetration panel.\nConnect the 3/8-inch pneumatic tube fitting, emerging from the penetration panel pass-through to the outlet of the interface/power unit pressure regulator outlet. Connect the 4 mm pneumatic tube to the outlet of the compressor and the inlet of the air filter on the interface/power/regulator unit.\nConnect the interface/power/regulator unit to the micro-USB connector of the USB cable/repeater assembly and lay the repeater cable out to the host PC/laptop in the MRI control room. Plug the interface/power/regulator unit into a 110VAC wall plug in the support room, and then turn on power switch.\nPosition MR_CHIROD v3 with the patient.\nFully extend and lower the MR scanner bed. Attach the bottom half of the head coil and guide the volunteer to lay down, making sure that the volunteer is resting comfortably and has extended their arms comfortably.\nProvide ear plugs to the volunteer for acoustic noise reduction.\nAttach the head coil and small foam pads to immobilize the head.\nAttach pillows around the volunteer’s gripping arm at the level of the arm and elbow, to minimize vibrational coupling to volunteer’s own body and to the walls of the MR scanner.",
    "Attach the communication ball on the volunteer’s chest, instruct them on how to use it and confirm that the communication ball works well before starting the scans.\nLoosely install the MR_CHIROD on the side of the patient opposite to that of their brain lesion using the corresponding bed-slot. With the volunteer’s elbow resting on the table to support the weight of their arm, move the MR_CHIROD handle to the webbing between thumb and forefinger and guide the volunteer to grab the handles of the MR_CHIROD.\nIf the MR_CHIROD is on the opposite side of the table from the penetration panel, position the cables and the pneumatic tube so that they pass under the table rather than over the patient.\nMake sure that the grip position is proper for squeezing. Instruct the volunteer to squeeze and push or pull the MR_CHIROD until they have the most comfortable position for squeezing.\nSecure the MR_CHIROD firmly in place by tightening the plastic nuts using an MR-compatible wrench.\nNOTE: No scan is being performed at that time. When positioning the MR_CHIROD, the volunteer is resting comfortably on the MR scanner bed outside the magnet. The door to the magnet room may be open.\nSet up the control laptop in the MR control room (adjacent to scanner and support rooms), confirm connection and set for patient force level​.\nTurn on the laptop and start the data acquisition/analysis software. Connect the USB cable/repeater assembly to laptop. Turn on the MR scanner room projector. Connect the laptop video output port to the projector connector and set monitor to extend screen onto projector. Connect scanner USB HID trigger cable to the laptop to receive trigger signals from the scanner.",
    "Run the custom user interface (UI) / control / stimulus program for the MR_CHIROD. Automatically set MR_CHIROD pressure to the (minimal) “setup” level to push the handle to the end-stop, verifying display of motion and force waveforms.\nInstruct the volunteer that the next few squeezes will be to calibrate for maximum strength of squeezing and hence will be difficult.\nSet force level, for example, to 30 N and instruct the volunteer to completely squeeze 2-3 times with a period of approximately 2 s. Observe whether the volunteer can complete a squeeze at that force level.\nGradually increase the force level and repeat squeeze attempts until the volunteer cannot complete a squeeze. This measurement serves as a maximum of the volunteer’s grip strength. The UI automatically calculates 60%, 40%, and 20% of maximum force levels for use during testing.\n3. Enter Volunteer Data and Calibrate the MR Scanner\nEnter the volunteer’s de-identified data as per hospital policy in accordance with HIPAA (United States Health Insurance Portability and Accountability Act of 1996) regulations on the scanner console.\nMove the table and the participant into the scanner and position at isocenter.\n4. Run fMRI Session\nObserve the volunteer through the window between the control and scanner rooms and communicate with the volunteer to obtain the participant’s permission to start the fMRI protocol. Instruct them not to hold the MR_CHIROD handle to allow it to rest at the fully open position.\nShim the magnet and run a localizer scan. Open the fMRI protocol and set slices to cover the volunteer’s brain.\nInstruct the volunteer that the fMRI session is about to begin.",
    "Using the UI, set the MR_CHIROD to apply the first force level (20% of maximum). The UI program will display a set of instructions on the video projector for the volunteer to remind them how to respond to the visual stimulus. The UI will wait for the scanner to provide a trigger signal to continue.\nStart an echo-planar-imaging protocol for fMRI. Use imaging program MR_CHIROD from folder USERS. Acquisition and reconstruction parameters are already set in the imaging program and should not be changed. The following parameters are employed: in-plane 192 x 192 or 256 x 256 acquisition matrices; TR (repetition time) in the range of 2-3 s; a 30 ms TE (echo time); 5 mm slice thickness, and a spatial resolution of ~1 mm x 1 mm.\nNOTE: The UI/data acquisition/stimulus program will wait to receive a trigger pulse from the scanner corresponding with initiation of pre-fMRI scans in the scanner program. The visual stimulus will remove the instructions and show a “fixation cross” that the volunteer will focus on. When the fMRI scan TRs begin, a visual metronome display, in the form of a growing and shrinking circle will be displayed. The volunteer will completely squeeze and release the handle synchronously with the stimulus. Rest periods will separate stimulus periods, during which time the fixation cross will be redisplayed.\nDuring execution of a task, monitor force output and whether the participant is performing the task correctly (i.e., fully completing grips and releases and maintaining synchrony with the visual metronome) by observing live plots of force and displacement on the UI.",
    "Once the first run is over, confirm continuation of the experiment on the UI, which will change force level to second of three levels. Repeat from step 4.5. Similarly, when the second run is over, confirm continuation to run the final run at the third force level.\nAfter the third run, the UI will automatically set MR_CHIROD pressure to the low “setup” level.\n5. Complete the MRI Session\nInstruct the participant to relax and to let go of the handle. Collect a series of anatomical scans.\n6. Take-down\nRemove the participant from the MR scanner room, follow the setup steps in reverse, and proceed to shut down and disconnect the parts of the MR_CHIROD. Transfer MR data to the database and to disk and close the session.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}