{
  "id": 17821,
  "origin_website": "Jove",
  "title": "TMT Sample Preparation for Proteomics Facility Submission and Subsequent Data Analysis",
  "procedures": [
    "The Institutional Animal Care and Use Committee from University of Florida approved all animal studies.\n1. Preparation of reagents\nPrepare CHAPS Lysis Buffer (150 mM KCl, 50 mM HEPES pH = 7.4, 0.1% CHAPS, and 1 protease inhibitor cocktail tablet per 50 mL of buffer). Buffer without protease inhibitors can be stored at 4 °C for up to 6 months or buffer with protease inhibitor stored at -20 °C up to 1 year.\nPrepare 100 mM triethylammonium bicarbonate (TEAB): Add 500 µL of 1 M TEAB to 4.5 mL of ultrapure water.\nPrepare 200 mM tris (2-carboxyethyl) phosphine hydrochloride (TCEP): Add 70 µL of 0.5 M TCEP, a denaturing reagent, to 70 µL of ultrapure water. Then add 35 µL of the 1 M TEAB.\nPrepare 5% hydroxylamine: Add 50 µL of 50% hydroxylamine to 450 µL of 100 mM TEAB.\n2. Protein extraction\nIsolate quadriceps muscle from a euthanized mouse according to an IACUC approved protocol. Freeze and maintain at -80 °C or continue with the protocol for immediate use.\nCut to isolate approximately 10 mg of fresh or frozen quadriceps mouse tissue. Separate fibers using tweezers when working with skeletal muscle. Alternatively, if working with cell cultures, resuspend ~3 x 106 cells in 300 µL of CHAPS lysis buffer and skip to step 2.4.\nHomogenize tissue using a bead disrupter using 2 mL tubes filled with approximately 200 µL of 1 mm zirconia/silica beads and 500 µL of CHAPS lysis buffer. Scale up or down as appropriate (e.g., 5 mg of tissue in 250 µL of CHAPS lysis buffer).",
    "Perform sonication (10x for 10 s each with 50% amplitude and 30 s intervals on ice) to release protein bound to DNA. The same DNA degradation results can be achieved either with syringe lysis by passing the lysate 10x through a 21 G needle attached to a 1 mL syringe, or by benzonase incubation (44 U/mL) at 37 °C for 30 min.\nCentrifuge the lysate at 16,000 x g for 10 min at 4 °C and transfer the supernatant to a new centrifuge tube.\n3. Protein measurement\nDetermine the protein concentration of the supernatant using established protocols (see Table of Materials).\n\tNOTE: It is best to use samples at ≥2 µg/µL, but less concentrated samples may also be used. If a less concentrated sample is used it will be necessary to appropriately adjust the volumes of the reducing/alkylating reagents in step 5.1.\nPrepare a BSA standard curve dilution using CHAPS lysis buffer.\nFollow the manufacturer's instructions, and after 15 min, read the absorbance at 750 nm.\n4. Reducing/alkylating reagent treatment\nTransfer 200 µg of protein per condition into a new centrifuge tube and adjust to a final volume of 100 µL using CHAPS lysis buffer. It is possible to scale up to 200 µL when the protein concentration is too low, but do not forget to appropriately adjust the volume of reducing/alkylating reagent.\nAdd 5 µL of the 200 mM TCEP and incubate samples at 55 °C for 1 h.\nImmediately prior to use, prepare 375 mM iodoacetamide by dissolving one tube of iodoacetamide (i.e., 9 mg) into 132 µL of 100 mM TEAB. Protect this solution from light.\nAdd 5 µL of 375 mM iodoacetamide to the sample and incubate for 30 min at room temperature (RT) protected from light.\n5. Methanol/chloroform precipitation20",
    "Add 400 µL of methanol to each 100 µL of protein and briefly vortex samples.\nCentrifuge at 9,000 x g for 10 s at RT. This is to incorporate liquids deposited on the sides of the sample tube.\nAdd 100 µL of chloroform to the mixture and briefly vortex. Use 200 µL of chloroform if the sample has a high concentration of phospholipids.\nCentrifuge at 9,000 x g for 10 s at RT. This is to incorporate liquids deposited on the sides of the sample tube.\nAdd 300 µL of water and vortex vigorously. It is important to obtain a homogenous solution.\nCentrifuge at 9,000 x g for 1 min at RT. Be extremely careful to avoid disturbing the layers when transferring the tube to a rack.\n\tNOTE: The tube should now contain three phases: 1) Top layer (i.e., supernatant), a mixture of water and methanol; 2) Middle layer (i.e., interphase), white precipitated protein; and 3) Bottom layer (i.e., bottom phase), chloroform.\nCarefully remove the supernatant.\nAdd 300 µL of methanol to the remaining interphase and bottom phase. Vortex vigorously.\nCentrifuge at 9,000 x g for 2 min at RT. Be extremely careful to avoid disturbing the layers when transferring the tube to a rack.\nCarefully remove the supernatant.\nGently aspirate as much liquid as possible under a stream of air (e.g., using a vacuum concentrator) at RT until the pellet is just a bit moist (~10 min). As the necessary time may be different for each sample, check every 2 min to assess. Store the pellet at -80 °C until further processing.\n6. Protein digestion\nResuspend the precipitated protein pellet in 100 µL of TEAB lysis buffer.\n\tNOTE: It is optional to measure the protein concentration at this step.",
    "Immediately prior to use, prepare 1 µg/µL trypsin by adding 100 µL of the trypsin storage solution (50 mM acetic acid) to the bottom of the 100 µg trypsin glass vial and incubate for 5 min at RT. Store remaining reagent in single-use doses at -80 °C.\nAdd 2.5 µL of trypsin per 100 µg of protein. Digest the sample overnight at 37 °C. This step is crucial for complete solubilization of the protein; do not modify these conditions. Following the digestion, it is optional to measure the protein concentration using standard protein assays.\n7. Peptide labeling\nImmediately prior to use, equilibrate the TMT label kit reagents to RT.\nDissolve each of the 0.8 mg TMT tag vials through the addition of 41 µL of anhydrous acetonitrile to each tube. Incubate the reagent for 5 min at RT with occasional vortexing. Briefly centrifuge the tubes.\n\tNOTE: A concentration of 0.8 mg of TMT tag is usually enough to label two sets. Other investigators, however, have demonstrated that this concentration can be reduced further and still yield reliable data15.\nCarefully add 41 µL of the TMT label reagent to each 100 µL sample.\nIncubate the reaction for 1 h at RT.\nAdd 8 µL of 5% hydroxylamine to the sample and incubate for 15 min to quench the reaction.\nSplit the samples into equal amounts in a new centrifuge tube and store at -80 °C.\n\tNOTE: In this step the samples are stable and can be submitted for mass spectroscopy. It is optional to measure concentration at this point using standard protein assays.\n8. Mass spectroscopy\nSubmit the samples to a proteomics facility (this study used the UF ICBR Proteomics Core facility), where all samples are combined and purified using C18 spin columns.",
    "NOTE: Discuss with the core facility how to submit the samples prior to preparing them to confirm the exact steps they prefer for submissions.\nRequest the following procedures per combined multiplex sample: solid phase extraction, HPLC (SCX, SE), zip tip, and LC-MS/MS (2 h gradient for protein ID, if >10QE Plus).\nOnce the data are collected, the core facility will process RAW files using vendor-supplied software for protein identification.\n9. Data analysis\nData are typically delivered from the core back to the user in the 7z format, which can require approximately 16 GB of disk space per each dataset (in this case 11 samples). For data processing, make sure a computer is available that is at least 3.4 GHz.\nExtract files using 7-Zip File Manager. These extracted files contain RAW data, pdStudy format file, and pdResultView format file. Save all files for further analyses.\nOpen file using Proteome Discovery 2.2 Software.\n\tNOTE: The file format is \"File name.pdStudy\". If the \"File name.pdResultView\" is opened it is not possible to select the control sample.\nSelect control samples on \"Samples\" panel.\nOpen Result by selecting ID on \"Analysis Results\" panel.\nExport to spreadsheet software.\nSave raw data (all proteins identified).\nOpen the spreadsheet software file. This will contain all proteins that have been identified.\nIn the spreadsheet software file use the \"Filter\" function to screen \"Protein FDR Confidence: Combined\" in high (column B), \"#Unique Peptides\" higher than 2 (column K), and either one of \"Abundance Ratio\" blank exclusively (column S up to W).\nInsert a column for \"p-value\" calculation with the function\n\t=TTEST(control group,experimental group, tails, type)\nInsert a column for \"Statistical Significance\" with the function\n\t=IF(p-value<0.05, \"Significance\",\"NS\")",
    "Use the \"Filter\" function to screen \"Statistical Significance\" showing \"Significance\". The result shows the analyzed proteins with the statistical significance in the control group and experimental group.\nDetermine significantly higher or lower protein expression abundance in the experimental group compared to the control group, insert a column for \"Regulation\" with the function\n\t=IF(AVERAGE(controlgroup)>AVERAGE(experimentalgroup),\"Upregulated\",\"Downregulated\")\n10. Methods to evaluate significant hits\nTo identify protein-protein interactions between the significant hits identified in the TMT studies, use Search Tool for the Retrieval of Interacting Genes/Proteins (STRING) version 11.021: https://string-db.org/[href=https://string-db.org/]\nTo classify by groups (i.e., molecular function, biological processes, and protein classes) use Protein Analysis through Evolutionary Relationships (PANTHER) ontology classification software22: http://www.pantherdb.org/[href=http://www.pantherdb.org/]\nTo identify protein interactions in a variety of pathways, use pathway analysis software23.\n11. Proteomic data upload to a repository bank\nTo submit proteomic data to the Proteomics IDEntificantions Database (PRIDE) or Mass Spectrometry Interactive Virtual Environment (MassIVE) include the following information: the peak list files (processed mass spectrum files in a standard format such as mzXML, mzML, or MGF), result files (spectrum identifications in a standard format such as mzIdentML or mzTab), and raw spectrum files (raw mass spectrum files in a nonstandard or instrument-specific format such as .RAW files or .WIFF files).\nTo submit, create an account and include information such as affiliation and project details. Then, select the files listed in step 11.1 and upload them.\nTo create an official dataset, run a submission workflow on these uploaded files.",
    "NOTE: Following submission, the dataset will be private in the repository bank. With the private option, the data are only available to authorized users. There are two additional options: 1) Shared dataset, which gives access to journal reviewers and collaborators; or 2) Public dataset, which will show up in public dataset searches. Another important feature of these repositories is the ability to update the uploaded data and associate subsequent publications with the existing dataset."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}