{
  "id": 7099,
  "origin_website": "Bio",
  "title": "Histological and Immunohistochemical Examination of Stem Cell Proliferation and Reepithelialization in the Wounded Skin",
  "procedures": [
    "Mouse skin wounding, skin collection and embedding in OCT compound without pre-fixationAnesthetize mice with 3-5% isoflurane and 1 L/min O2 inside an anesthesia chamber or as the protocol approved by Institutional Animal Ethics committee (Figure 1C). The anesthetized mouse can be maintained with exposure to the anesthesia via a nose cone (Figure 1D).Shave the mouse back skin with a fine trimmer to remove all the back skin hair (Figure 1E).Hold the skin in the interscapular region between shoulders using blunt-ended forceps such that there is a space of about 10 mm between the two wounds (Figure 1F). 5 mm full-excisional wounds are created on the dorsal skin using a circular sheet punch (Figures 1G-1I).The size of the wound can be uniformly measured by taking the images of the wounds with a ruler near the wound to keep the scale constant in every imaging session (Figure 1J). For the day 0-timepoint, take the image 3-4 h post wounding. This allows the tension of the skin to be fully released and gives a more accurate measure of the starting wound size.    To monitor the wound-closure kinetics, calculate the wound area on day 0 post wounding and normalize the subsequent time points by dividing the wound area to that of the wound area at day 0. Express this fraction in percentage to plot the wound closure kinetics.    Wound area can be measured in ImageJ as follows: Go to ImageJ > select line tool > Draw a 1.0 cm line parallel to/on the ruler (Use ruler as reference) > Analyse > Set image scale: enter “Known distance” as “1.0” and “unit of length” as “cm” > Select OK to apply settings. (Note: The line tool basically measures the length of scale in pixels.",
    "The set scale option equates/defines how many pixels are equal to a known distance (such as 1.00 cm in our case) > Select the polygon selection tool and mark the outer edge of the wound (Start at any point on the edge of the wound and left click to add intermediate points. Once the edges are marked, right-click to complete the polygon selection) > go to Analyse > Measure. A new window will appear where the area of the polygon (i.e., the wound) will be given.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3894/bioprotoc-11-02-3894-g001.jpgFigure 1. Generation of full excisional skin wounds in mice. A. Biosafety class-II cabinet setup for mouse wounding procedure: 1. Isoflurane chamber to anesthetize mice; 2. Thermal pad; 3. Isoflurane outlet with nose cone; 4. Light source; 5. Spray bottles containing 70% Ethanol or H2O2 solution; 6. Heat sterilizer for forceps and scissors; 7. Supporting stand for surgery. B. Dissection tools, biopsy punch and trimmers required for the wounding procedure. C. Mouse is anesthetized using isoflurane (3-5%) mixed with oxygen within an anesthetic chamber and is maintained via a nose cone adjusted to the supporting/surgery stand (D). E. Dorsal back hairs are shaved using hair trimmers. F. Dorsal skin is held using blunt forceps such that there is a gap of about 10 mm between the two wounds. G-I. 5 mm sheet hole puncher is used to generate full excisional wounds. J. Wounds were photographed with a ruler as a scale to measure wound area.After wounding, the skin can be harvested at desired time points of an experiment. Before proceeding for skin dissection, mice are euthanized in a CO2 chamber followed by cervical dislocation. The euthanization protocol must be approved by the institute’s animal ethics committee.",
    "Before beginning the skin dissection, draw a reference line on the dorsolateral side, about 1 cm away from the wound using a marker to demarcate the anterior/posterior (A/P) axis. Then cut a rectangular piece of skin approx. 2.5 cm x 1 cm around the wound. Start the incision from the posterior side of the wound and proceed on the lateral sides. Cut the skin along the A/P axis such that cut lines are parallel to the direction of the straightened tail, which enables subsequent sectioning of full hair follicle longitudinally (Figures 2A-2C).When embedding the wounded skin tissue, there should be around 3 mm unwounded skin left while embedding, which can act as an internal control for comparison.Place the cut skin on a piece of notebook paper, which helps to support the skin and prevent it from curling. Align the reference line on the cut skin parallel to the straight line on the paper to achieve optimal hair follicle orientation (Figures 2D-2E).For wounded skin, cut the wounds into two equal halves by cutting the wound along the midline with a sharp scissor. Maintain the A/P orientation of the skin while embedding to preserve the longitudinal profile of hair follicles while sectioning the skin (Figure 2F). After dividing the wounded skin into equal halves, each part can be either fixed in Bouin’s fixative (Figure 2G) or processed for OCT compound embedding.Submerge the cut skin in OCT compound at room temperature for 15 min (Figure 2H).Using fine forceps, move the air bubbles away from the skin surface (Figure 2H).Optional: Flatten the skin on aluminum foil and transfer it on the glass slides. Put OCT compound on top and freeze it on a cube of dry ice.",
    "Once OCT compound solidifies after freezing, lift the frozen skin (it would look like a thin chip of ice), then embed it in an OCT block. This way is easier to get rid of bends and twists in the skin and also prevents excessive bubbles around the tissue.Orient the skin in the mould so that the wounded edge is towards the bottom. Incubate the OCT mould with skin on dry ice to freeze and solidify the OCT compound by holding the skin tissue perpendicular to the mould with the wound side down (Figure 2I)Top up the mould with more OCT compound such that the skin tissue is entirely covered in OCT compound (Figure 2J).After freezing, the OCT blocks should be kept at -80 °C at least overnight before sectioning on a cryostat. Adjust OCT block sectioning orientation such that the full length of hair follicles is visible along the entire section (Figure 2K). Haematoxylin and eosin (HE) staining of skin sections allows one to distinguish regions of unwounded and wounded skin as shown in Figures 2L and 2M, respectively.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3894/bioprotoc-11-02-3894-g002.jpgFigure 2. Extraction and embedding of wounded skin. A. Wounds were photographed with a ruler to measure the wound closure. B-C. Orientation of the wound relative to the body of the mouse. The anterior/posterior (A/P) axis is defined by marking a line on dorsal-lateral skin away from the wound. The skin around the wounded region is carefully cut in the order depicted in the panel. D-E. The excised skin is aligned parallel to the anterior-posterior (A/P) reference line drawn on the paper (shown in red). E. The excised skin is trimmed to a distance of 1cm away from the wound edge in the A/P axis. F. Left and right wounds are cut in half parallel to anterior/posterior axis. G.",
    "Wounded skin is fixed in Bouin's fixative for paraffin embedding. Alternatively, the skin is placed in OCT immediately after dissection (H). The wounded edge is placed towards the bottom of the OCT mould (I) and kept on dry ice for freezing the tissue (J). K. Representative skin section from the OCT embedded tissue. The proper sectioning angle can be assessed by visualization of the entire hair follicle. Asterisks (*) marks the hair follicle. Representative images of haematoxylin and eosin (HE) stained skin sections from unwounded (L) and wounded mouse skin (M). The repaired epithelium is seen as a thickened epidermis in the wounded mouse skin. (E = epidermis, D = dermis, scale bars = 50 μm)Sectioning of OCT blocks has been described by Fischer et al. (2008), CSH Protocols.Immunostaining of the skin section has been described by Reuter et al. ( 2011), Bio-protocol.Notes: Be careful while doing cervical dislocation of wounded skin to avoid the damage to the wound region. Given the geographical heterogeneity throughout the skin, it is important to analyze the same region consistently so as to not confound experimental results due to variability in hair growth cycle at different regions in the skin. Ensure that the air bubbles near the skin are removed completely while embedding the skin. Any air bubbles can prevent the appropriate penetration of the OCT compound into the tissue and result in tearing while sectioning due to lack of sufficient matrix support. Straighten any bends or curls in the skin when it is placed in the OCT compound while embedding. This step is important to maintain the correct orientation of hair follicles while sectioning. Do not let the OCT compound with tissue thaw once it is frozen. Freeze-thawing compromises tissue integrity even after one cycle of freeze-thawing.",
    "If commercial plastic moulds are not available, an alternative is to make moulds out of aluminum foil by shaping the foil around the cap of a small bottle or a 15 ml centrifuge tube. Quantitative data analysisImmunostaining of Ki67 and CD34: Prepare a humidifying chamber by using an empty tip box by filling the bottom chamber of the tip box with ~1 cm of water so that blocking solutions and antibodies do not dry on the section during incubation (Figures 3B and 3C). Cover the box with aluminum foil if staining is to be performed in the dark.Remove the frozen slide with OCT skin section from -80 °C freezer and wait for 1 min to thaw. Make a hydrophobic barrier surrounding the tissue section using a hydrophobic ink pen (Figure 3A). Then add 250 µl of 4% PFA per section for fixation. Incubate the slide in the humidifying chamber for 10 min at room temperature as shown in Figure 3B.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3894/bioprotoc-11-02-3894-g003.jpgFigure 3. Set up used for immunofluorescence staining of skin sections mounted on a slide. A. Hydrophobic barrier is placed around skin tissue using PAP-pen, denoted by the dotted circle. B and C. A pipette tip box is used to provide humid conditions for the immunostaining protocol. The lower chamber of the box is filled with water (or a tissue saturated with water) and slides are kept on a top shelf in a tightly closed box for antibody incubation.After 10 min, thoroughly remove the fixative by soaking slides in PBS for 10 min and repeat this step at least two more times.Block nonspecific binding of proteins on the tissue using the blocking solution containing goat serum and 0.1% Triton X-100 for 1 h at room temperature.",
    "Incubate the section with primary antibody (diluted in blocking buffer) for 2 h at room temperature or overnight at 4 °C.Remove the primary antibody by soaking slides in PBS for 5 min and repeat this step at least two more times.Incubate the section with secondary antibody (diluted in blocking buffer) for 20 min at room temperature.Remove the secondary antibody by soaking slides in PBS for 5 min and repeat this step at least two more times.Stain the sections with DAPI solution (0.1µg/ml) made in 0.1% Triton-X containing PBS for 10 min at room temperature.Mount the section with a mounting media such as Vectashield and cover the tissue with a coverslip.Observe the stained skin section with a fluorescence microscope.Notes: While thawing the section DO NOT dry the section completely. It may cause nonspecific binding of the antibody leading to nonspecific background staining. DO NOT incubate skin section in fixative for longer than 10 min. Over incubation can affect the epitope and inhibit the optimal detection of the antigen with the antibody. For some specific antibodies, 100% methanol stored at -20 °C is used as fixative where fixation is done at -20 °C. Follow fixation guidelines as per antibody datasheet. Measurement of stem cell proliferation at the site of the wound: Stem cells resident in the bulge region of the hair follicle are quiescent under normal conditions and activated in a window of anagen growth during the hair cycle. In addition, these stem cells rapidly divide in response to injury and migrate to the wound site to restore the epidermal barrier. In our studies, we found that the damage repair activity of stem cells is restricted within a range of first 3 hair follicles adjacent to the wound site (Lee et al., 2017).",
    "We define this region as wound proximal and the area 2 cm away from the wound edge is considered distal. We did not detect any stem cell activity in response to injury at the wound distal site. To measure stem cell proliferation in the wound proximal region, bulge stem cells are detected by CD34 staining which is a surface glycoprotein widely used in combination with alpha6 integrin to detect and isolate this stem cell population (Trempus et al., 2003). The cellular interactions involving bulge resident stem cells and soluble cytokines are restricted to a region of approx. 100 μm (Lee et al., 2017). Consequently, we analyzed the proliferation as an outcome of such interactions. We identify proliferating CD34+ hair follicle stem cells as those which are double-positive for both CD34+ and Ki67+ proliferation markers (Figures 4A-4D). The arrector pilli muscle (which can be marked by α-smooth muscle actin) attaches to the hair follicle at the bulge area and can be used as a landmark to outline ROI around this niche of hair follicle stem cells within a region of interest (ROI) that is approximately 150 μm wide, which encompasses the entire bulge region of telogen stage hair follicle, and the number of Ki67+ dividing bulge stem cells are counted within this ROI (Figure 4C). A 150 μm box (or a box of any size) can be specified on microscopy images by following these steps in ImageJ: (1) set image scale, (2) Draw a rectangle of any size from the main toolbar, (3) Go to edit on the main menu > selection > specify > enter the desired length and width of the box. The number   of Ki67+ proliferating cells were counted by using ImageJ as follows: Main menu > Plugin > Analyse > Cell counter.",
    "The number of proliferating cells in hair follicles can be compared between the wound proximal and wound distal regions as shown in Figures 4E-4G.    Likewise, epidermal cell proliferation is measured by counting Ki67+ cells in a region of 300 μm x 150 μm rectangular box covering interfollicular epidermis (Figure 4F) by ImageJ as mentioned above. The number of proliferating cells can be compared between the wound proximal and wound distal region (Figures 4E-4F, and 4H). Since the immunohistological procedure retains the tissue architecture, the quantitative analysis described here enables comparison of the regenerative capabilities of stem cells residing in different niches. Specifically, this method can be used to examine whether hair follicle stem cells respond differently to wound-induced signals as compared to progenitor cells residing in the interfollicular epidermis.    Alternative methodology: Stem cell activity is regulated by a variety of other cell types, such as immune cells, adipocytes, fibroblasts, blood vessels, lymphatic vessels and peripheral nerves, which collectively form the stem cell niche. In order to understand how each of these cell types impacts the stem cells, CD34 staining of stem cells can be multiplexed with lineage marker staining of other cell types. This strategy would reveal whether the other cell types in the skin environment are within proximity to stem cells to affect their activity. In addition, using mouse genetics to knock-out specific cell types, the functional role of the depleted cells in modulating stem cells can be studied. We combined this approach of using immunostaining and mutant knock-out mice to study the role of skin resident γδ T cells in regulating stem cell activity in wounded skin (Lee et al., 2017).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3894/bioprotoc-11-02-3894-g004.jpgFigure 4. Quantification of stem cell proliferation at distinct sites in the skin.",
    "(A-B) Bulge stem cells are stained for CD34 (green) and proliferating cells are marked by Ki67 (red) within a defined region of interest. Panel C is a merged image and panel D is a magnified view of the inset of figure C. Staining of skin sections (E) proximal and distal (F) to the wound site (denoted by the arrow) for CD34 (green) and Ki67 (red). The yellow boxes represent the fixed region of interfollicular epidermis that is between the hair follicles (marked by the white lines) in panel E. (G) Quantification of proliferating hair follicle stem cells that are double positive for CD34 and Ki67 in the regions adjacent to the wound bed (proximal) and distant to the wound (distal). (H) Quantification of proliferating (Ki67+) cells in the basal layer of the epidermis at proximal (first yellow box from wound site) and distal sites from the wound. Nuclei are stained with DAPI dye (blue). Scale bar is 50 μm. (Images have been taken from Lee et al., 2017)Measurement of epidermal reepithelialization of wound: Upon sensing the wound, hair follicle stem cells are activated to divide and home to the wound site. This coordinated process results in re-epithelialization, which involves the formation of new skin epithelium and restoration of the epidermal barrier. Due to massive cell proliferation, the epidermis over the wounded bed is substantially thicker than the unwounded skin. Using a genetic model of wound healing, which simulates the wound healing response throughout the entire skin of the mouse, we have previously documented that increased keratinocyte proliferation results in a thickened epidermis (Lee et al., 2009). Thus, the thickness of the epidermis at the wound edge is an indirect measure of the magnitude of proliferation in keratinocytes lining the wound edge and surrounding hair follicle stem cells.",
    "We measured epidermal thickness by calculating the shortest distance between the bottom of keratin-5+ basal layer and the top of the loricrin+ granular layer. This can be done by drawing a line in ImageJ starting from the base (close to the basement membrane) of the lowermost layer of cells expressing keratin-5 to the topmost edge of the layer expressing loricrin (Figure 4A). The measurement of the lengths of these lines can be accomplished on ImageJ as follows: Main menu > Length tool > Draw length > Measure. Optional: the basement membrane below the keratin-5+ layer could be stained using antibodies against collagen IV or laminin protein to detect the base of keratin-5+ cells. The line used to measure the distance between the keratin5+ and the loricin+ layer should be drawn perpendicular to the basement membrane. 50 μm-wide windows are drawn starting from the wound edge up to a maximal distance of 600 μm (Figure 5A). Measurements of epidermal thickness in each window are quantified in Figure 5B.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3894/bioprotoc-11-02-3894-g005.jpgFigure 5. Measurement of epidermal thickness near the wound edge. A. The epidermal basal layer is detected by keratin 5 staining (red) and the granular layer is labeled by loricrin staining (green). Nuclei are stained with DAPI (blue). 50 μm windows can be drawn in ImageJ as follows: Go to ImageJ > set image scale > Draw a rectangle of any size from main toolbar > Go to edit on the main menu > selection > specify > enter the desired length and adjust the width of the box to 50 μm.",
    "Length of lines perpendicular to the basement membrane and joining the bottom of the keratin 5 staining of the basal layer to the topmost region of the loricrin staining in the granular layer are measured to determine epidermal thickness in each 50 μm wide window. The yellow arrow denotes the wound edge where K5 is first expressed. B. Quantification of epidermal thickening adjacent to the wound edge. (Images have been taken from Lee et al., 2017)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}