{
  "id": 13210,
  "origin_website": "Jove",
  "title": "Event-related Potentials During Target-response Tasks to Study Cognitive Processes of Upper Limb Use in Children with Unilateral Cerebral Palsy",
  "procedures": [
    "Approval for different experiments using this experimental design was obtained from the local Ethical Committee of the Faculty of Social Sciences (ECSW) from the Radboud University Nijmegen as well as by the regional Medical Research Ethics Committee, the CMO Arnhem-Nijmegen (Registration number: 2012/049; NL nr.: 39607.091.12).\n1. Participants\nOnly include children that are diagnosed with unilateral CP as diagnosed by a medical specialist (i.e., neurologist, pediatrician).\n\tNOTE: The ERP protocol to assess cognitive aspects underlying upper limb motor control has been developed for children with unilateral CP, but is not restricted to this group only.\nOnly include children older than 5 years old10,11.\n\tNOTE: Younger children might not be able to pay attention to the task during the whole procedure.\nExclude children with severe visual and auditory impairments.\n\tNOTE: It is recommended to include children who only have slight visual and auditory impairments if they are able to perform the task and show no differences with respect to response speed or accuracy compared to children participating without visual impairments. However, possible impairments need to be specified in a later report and possibly controlled for in the final analyses.\nFinally, exclude children that are unable to comply to the task due to possible cognitive impairments and/or behavioral disorders.\nPrior to the EEG measurement, have a trained occupational therapist and/or physiotherapist assess the children with respect to the manual ability (MACS) of the affected hand 13 as well as the possible presence of DD.",
    "To assess DD, calculate an index comparing the typical amount of use of the affected hand and arm during spontaneous daily activities (performance) with the quality of hand/arm skill under ideal conditions (capacity) 14,15. To do so use valid and reliable tests for assessing hand capacity and hand performance 16.  Recommendation: Use indices that have previously been used and preferably validated14,15. The use of the VOAA-DDD-R for determining DD is highly recommended, as the psychometrics of this task have been published 14.\nSince manual ability as well as DD may change over time (e.g., due to therapy results), schedule this assessment shortly before or after the EEG measurement (preferably within the same week).\nFurthermore, collect demographical data of the children (e.g., age, gender, medication and seizure history) to be able to take these variables into account (e.g., when matching groups or interpreting results).\n2. Developing the Visual Target-response Task\nWrite a script for the computerized visual target-response task. See Supplemental Code Files for an example script.\n\t\nTo present the visual stimuli on a computer screen, use a stimulus delivery and experimental control program that is time accurate enough to send time-locked markers to the EEG signal whenever a stimulus is presented. For registering responses, use a device that registers time accurate (1 msec) button presses and delivers related stimulus markers to the EEG computer (see Table of Materials).\nFor visual stimuli use clear shapes presented on a white background that are easy to recognize (examples are shapes or simple objects) and easy to distinguish (e.g., based on color, shape, size). Recommended are simple graphic designs instead of complex stimuli like photographs.",
    "Follow the recommendations below to design ERP experiments for children. Note: Designing ERP experiments for children is often challenging, because children may have a limited capacity to comply to long repetitive experiments.\n\t\t\nPresent stimuli that are big enough to be easily recognized by the child (recommended size: 7 x 7 cm).\nFurthermore, preferably use stimuli that are attractive for the children to keep children's attention to the task (e.g., smiley's). Figure 1 displays an experimental protocol that can be used in young children to study different cognitive processes during simple hand movements.\nMake sure to include clearly different stimuli for right vs. left hand movement initiation. This allows comparing the distinct processing stages involved in movements of both the affected and the less affected hand in children with unilateral CP. This within-subject design allows participating children to serve as their own control participant (affected vs. less affected hand).\n\t\t\nRecommendation: Present stimuli to the left or the right side of the screen to respectively induce left or right hand movements. To control for stimulus lateralization, include a background-stimulus to the other side of the screen.\nPresent the same amount of stimuli to the affected as to the less affected side. Use a minimum of 20 repetitions per stimulus-category to allow averaging of the event-related potentials 11. However, ensure that the length of the experiment does not exceed 10 min as children might not be able to attend to a longer task procedure. Earlier ERP studies in children with CP report protocols between 4.5 and 10 min 10,11,17,18. If a longer protocol is used, allow the child to take a break after 10 min and continue afterwards.",
    "For recording the responses to the presented stimuli, provide two big response buttons (recommended: diameter: 9.5 cm; height: 5.5 cm) with very low response force requirements to make sure that even children with substantial movement restrictions are easily able to respond.\nAdapt the study paradigm to measure cognitive processes of interest and rule out possible alternative explanations of the data.\nExample of experimental design: Cued Go/Nogo Task (Figure 1)\n\t\nFor a cued go/nogo task to study response selection, response preparation as well as response inhibition, present four different types of visual stimuli: background-stimuli (implemented as a baseline measure of visual stimulus processing), cue-stimuli for the left and the right side (implemented to study stimulus selection processes), go/target-stimuli for the left and the right side (implemented to study response preparation processes) and nogo-stimuli for the left and the right side (implemented to study response inhibition processes).\nRecommendation: Present background- and cue-stimuli for 1,000 msec. Present target-stimuli until a response is made. Present nogo-stimuli for 1,500 msec. Keep the inter-stimulus interval (ISI) between cue- and target/nogo-stimuli fixed (recommended: 1,000 msec). Keep the ISI after each correct response following target or go stimuli random (recommended: between 1,000-1,500 msec).\nIn order to avoid confounding oddball activity, present target- and nogo-stimuli in an equiprobable manner.\n\t\tNOTE: Although this paradigm diminishes effects of inhibition on the nogo-stimuli 19, it allows a more direct comparison of the ERPs elicited by both the target- and nogo-stimuli.\nAfter each correct response to a target-stimulus or a correct inhibited response to a nogo-stimulus, present some form of motivating feedback (e.g., a short laughing sound).\n3. The Data Acquisition System",
    "NOTE: For measurements with children a mobile EEG lab is highly recommended. A mobile lab allows conducting the study in an environment that is familiar to the child (e.g., school, rehabilitation centre, home). If a mobile EEG setup is not available, ensure that the child is comfortable with the testing environment. During EEG preparation it is recommended to have some distraction/ entertainment for the child (e.g., watching a film).\nUse two computers: one presenting the stimuli and a second computer to record and digitize the EEG. Connect the computers so that event codes can be sent to the EEG digitization computer whenever an event of some sort occurs (e.g., stimulus, response).\nWhen choosing the electrode-amplifier system use an active electrode system (highly recommended) to reduce the signal to noise ratio.\n\tNOTE: Active electrodes improve the signal to noise ratio, because the first step of amplification is conducted at the site of the electrode, thus minimizing the impact of intervening noise signals. A great benefit of this active electrode system is that an electrically isolated chamber is not necessary during EEG recording allowing to measure in almost every environment.\n\t\nEven with an active electrode system, be careful not to measure close to electrical or mechanical devices.\nChoose the number of the electrodes based on the research question and study population. A 32-channel electrode system (together with a 32-channel EEG amplifier) is sufficient for studying most cognitive processes related to different processing stages of upper limb control in children.\n4. Electrophysiological Recordings\nStart with cleaning the skin at the position where the reference electrode is placed to reduce the impedance (recommendation: place the reference electrode on the left mastoid bone and another active electrode on the right mastoid bone for offline re-referencing to linked mastoids).",
    "Clean the skin at the reference electrode placement by gently applying scrub cream to remove dead skin cells and clean it with alcohol to remove oily substances.\nIn addition, clean the forehead and the skin surrounding the eyes for the EOG (electro-oculogram) electrodes (more information on EOG recordings in step 4.6). Be careful when scrubbing the face, the skin here may be very sensitive.\nBefore putting the cap on the participants head, measure the head circumference to determine the cap size. To determine the circumference, place a measuring tape around the widest part of the head, just above the ears.\nApply the cap with the corresponding size and check whether it is in the right position.\n\t\nTo do this, measure the distance between Inion (bulging part of the occipital bone at the back of the skull) and Nasion (point where the top of the nose meets the ridge of the forehead) and between the left and right inter-aural indentations. Place the Cz electrode at exactly 50% of these distances. Using a cap ensures that if Cz is correctly located over the central vertex, all the other electrodes are automatically positioned at the standard locations according to the international 10-20 system 20.\nPlace the electrodes according to the International 10-20 system20 by using the numbers on the cap and electrodes.\n\t\nLocate electrodes at five midline sites (Fz, FCz, Cz, Pz and Oz) and 24 lateral sites (FP1/2, F7/8, F3/4, FC5/6, FC1/2, C3/4, CP5/6, CP1/2, P7/8, P3/4, T7/8, O1/2) to allow estimations of scalp distributions for finding spatial maxima of the ERP components of interest during the offline data processing (see Figure 2).",
    "If the reference electrode is placed on the left mastoid bone, place one more electrode on the right mastoid bone for linked-reference recording. Place the Ground electrode on AFz (see Figure 2 for schematic of electrode placement).\nFill the electrodes with conductive gel by inserting a blunt needle through the electrodes. The gel maximizes skin contact and acts as a malleable extension of the electrodes. In order to lower the impedance, gently abrade the skin under the electrode. Be careful to not apply too much conductive gel as gel might get in contact with gel of an adjacent electrode, thus distorting the signal. \nCo-register an EOG to correct the EEG signal for eye movements during the offline data processing.\n\tNOTE: Especially with children it is difficult to avoid eye movement artifacts through instruction only. Co-registering this EOG signal to subsequently correct for the electrical activity produced by the eyes, therefore is highly recommended for these participants.\n\t\nFor this purpose, place EOG electrodes around the eyes of the children.\nAs children's skin is very sensitive, try to avoid the placement of four EOG electrodes. Instead, place only two EOG electrodes by using one of the active electrodes below the right eye and one on the outer canthus of the right eye. When applying an ocular correction during the offline data processing, use F7 and FP2 electrodes as reference electrodes for EOG recording.\nKeep the electrode impedance below 20 kΩ by using an impedance meter while attaching the electrodes.\n\tNOTE: It is recommended to use an amplification system that has this as a built-in function.\nUse digitization software to digitize and record the EEG signal according to the manufacturer's instructions. Use the following recommended settings for the recording: digitize at 1,000 samples/sec and online filter between 0.016 and 250 Hz.",
    "5. Executing Target-response Task During EEG Recording\nPlace the laptop or computer screen approximately 40 cm in front of the child. Locate the two red buttons next to the laptop keyboard, one at the right side and one at the left side. Keep the distance between the buttons at 30 cm to obviate the possibility that the wrong hand is used to press the button. Locate children's hands slightly above the two red buttons with elbows resting on the table.\nInstruct the child to respond as quickly as possible to the target-stimuli by pressing the red button on the side of the target-stimulus (right button for right stimulus presentation, left button for left stimulus presentation). If nogo-stimuli are included, instruct the child to inhibit their response whenever a nogo-stimulus is presented.\nConduct a short trial session. Make sure that all stimuli that are used in the experiment appear at least once during this trial session. However, keep this trial session as short as possible (approximately 1 min without unnecessary repetitions) to prevent inducing fatigue later in the protocol.\n6. Offline Data Processing\nBehavioral data processing\nDefine behavioral variables (e.g., errors, reaction times) before processing the EEG data. It is important that ERP data correspond to the behavioral data (e.g., that only trials with correct responses are used for averaged ERPs).\nRecommendations: Define errors as false hits (e.g., response following cue- and nogo-stimuli within 2,000 msec), omissions following target-stimuli (recommended: no response within 2,000 msec) as well as erroneous responses (wrong button or both buttons pressed simultaneously). Depending on the research question, researchers may wish to exclude these errors in the RT and ERP data.\nElectrophysiological data processing for ERP analyses (recommended steps)",
    "NOTE: Choose a data analysis system that is suitable for analyzing the data aiming at answering the specific research question. Different systems are better suitable for different analyses purposes (e.g., ERP analyses vs. frequency analyses). It is possible to independently program this software as well as using a commercial EEG analysis system. The instructions provided below are specific for BrainVision Analyzer. Using BrainVision Analyzer is only one out of many available options to analyze ERP data.\n\t\nIf a linked-reference recording was chosen (reference electrode placed on one of the mastoid bones and another active electrode placed on the other mastoid bone), re-reference the signal of every EEG electrode to linked mastoids. Select the channel placed on the right mastoid bone as a new reference channel and include the implicit reference into calculation of the new reference (Transformations--> Channel Preprocessing--> New Reference).\nApply an ocular correction by using the signal recorded from the vertical and horizontal EOG channels (e.g., Gratton & Coles 21). If only two EOG channels were used, use F7 and Fp2 electrodes as reference electrodes for the EOG channels (Transformations--> Ocular Correction).\nApply an appropriate filter (Transformations--> Data Filtering--> IIR Filters). For ERPs recorded in children it is recommended to use a high-pass filter with a cutoff of 0.5 Hz and a low-pass filter that does not exceed 40 Hz.\nSegment the signal related to the different stimuli into equal segment epochs based on the different marker positions (Transformations--> Segment Analysis Functions --> Segmentation--> Create new Segments based on a marker position). For ERPs following the presentation of visual stimuli use segments from 250 msec prior to the stimulus till at least 750 msec after the stimulus (recommended). Furthermore, exclude the epochs of incorrect trials (false hits & omissions) by means of Boolean selection.",
    "Detrend the signal to correct for drifts in the signal (Transformation--> Segment Analysis Functions--> DC Detrend).\nApply an artifact rejection to screen each segment for motor and ocular artifacts such as high frequency muscle activity and remove segments containing artifacts exceeding ±150 µV. Recommendation: use the semiautomatic mode to have more insight into what data is removed (Transformations--> Artifact Rejection--> Semiautomatic Segment Selection).\nApply an appropriate baseline correction (Transformations--> Segment Analysis Functions--> Baseline Correction). Recommendation: For ERPs following the presentation of visual stimuli use a baseline correction from -250 msec until the presentation of the stimulus.\nAverage the segments per stimulus type and hand (affected vs. less affected) (Transformations--> Segment Analysis Functions --> Average).\nFinally, export mean amplitudes for various peaks of interest (Export --> Area Information). Recommendation: To allow blind scoring, define the averaged value within a fixed latency window. To determine the appropriate latency window for the studied group, find the maximum of the peak of interest in the grand-averaged ERPs of all children and define a window reaching 50% of this value before and after the peak. Use this window to export the averaged value of this component window for all individual participants 22.\nRecommendation: As the current research protocol is directed at studying differences in information processing and cognitive abilities, include data from midline electrodes. Endogenous components reflecting differences in information processing and cognitive abilities are clearly visible and identifiable over the vertex due to the widespread activity and smeared scalp topography of the signals.\n\t\tNOTE: In prior studies using this protocol, data from Fz, FCz, and Cz electrodes were used for data analyses 10,11."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}