{
  "id": 2101,
  "origin_website": "Cell",
  "title": "An in vivo orthotopic serial passaging model for a metastatic renal cancer study",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEx vivo bioluminescence imaging\nTiming: 1 h\nThis section describes how to visualize luciferase-expressing cancer cells in resected organs.\nEuthanize mice with an approved protocol.\nResect the tumor-bearing kidney from three or more mice.\nIncubation of the kidney with D-Luciferin.\nPlace all the resected tumor-bearing kidneys on a 10 cm plate or an according size of plate.\nAdd 12.5 mg/mL of D-Luciferin potassium salt - PBS solution directly onto the kidney on the plate by a pipet. The volume of luciferin - PBS solution needed will be almost 200 μL per kidney.\nIncubate for 5 min.\nVisualize and quantify bioluminescence by in vivo bioluminescence imaging.\nNote: This protocol is also applicable to visualizing luciferase-expressing cancer cells in the lungs in cases where lung metastasis is of interest.\nDissociation of tumor-bearing kidney\nTiming: 2–3 h\nThis section describes the preparation of a single cancer cell suspension from the resected kidney (Methods video S2[href=https://www.wicell.org#mmc2]). This protocol is also applicable for metastatic lung tumors in cases where lung metastasis is of interest.\nCritical: Process of dissociation is individually performed for each tumor-bearing kidney.\nSeparate tumor from the kidney.\nMince the collected kidney with scalpel to be smaller than 1 mm cubic.\nNote: To avoid contamination, samples are sprayed with 70% Ethanol.\nDissociate with collagenase.\nCollect the minced kidney in 400 unit/mL of type-I collagenase dissolved in native cell culture media (without any additives like FBS) used for the cell lines of interest.\nIncubate at 37°C for 30 min.\nFilter cell suspension through cell strainer.\nPass tumor chunk through 40-μm nylon cell strainer placed on 50 mL tube and transfer cell suspension in a 15 mL tube.\nCentrifuge at 400 × g at 10 min.\nRemove the supernatant.\nWash with PBS.\nAdd 5 mL of PBS.",
    "Centrifuge at 400 × g at 10 min.\nRemove the PBS.\nRed blood cell lysis.\nAdd 1 mL of ACK lysing buffer.\nIncubate at room temperature (18°C–25°C) for 5 min.\nAdd 9 mL of PBS.\nCentrifuge at 400 × g at 10 min.\nRemove the supernatant.\nCritical: If this is the last step of repeated in vivo passaging, cells can be suspended in the culture media and returned to normal cell culture conditions. Cancer cells can be purified using a cell sorter based on the fluorescent protein.\nMyeloid cell characterization by flow cytometry analysis.\nDead cell staining with Zombie Aqua Fixable Viability Kit.\nAdd 1 mL of 1:500 Zombie Aqua Fixable Viability Kit diluted in PBS.\nIncubate at room temperature (18°C–25°C) for 10 min.\nAdd 9 mL of 2% FBS-PBS.\nCentrifuge at 400 × g at 10 min.\nRemove the supernatant.\nFixation with 4% PFA-PBS.\nAdd 1 mL of 4% PFA-PBS.\nIncubate at room temperature (18°C–25°C) for 10 min.\nAdd 9 mL of 2% FBS-PBS.\nCentrifuge at 400 × g at 10 min.\nRemove the supernatant.\nPause point: After fixation, samples can be stored in 2% FBS-PBS at 4°C.\nBlocking with FcR Blocking Reagent.\nAdd 100 μL of 1:10 FcR Blocking Reagent diluted in 2% FBS-PBS.\nTransfer samples into a U-bottom 96 well plate.\nNote: When preparing samples stained with control isoform antibody, each sample is split into 2 wells with 50 μL each.\nAlternatives: A V-bottom plate will be a good alternative if cell pellet will not be packed well at the time of centrifuging a U-bottom plate.\nIncubate at room temperature (18°C–25°C) for 10 min.\nCentrifuge at 110 × g at 10 min.\nDiscard the supernatant.\nAntibody staining.\nAdd 100 μL of antibody cocktail.\nIncubate at room temperature (18°C–25°C) for 30 min.\nAdd 100 μL of 2% FBS-PBS.",
    "Centrifuge at 110 × g at 10 min.\nDiscard supernatant.\nWash with 2% FBS-PBS.\nAdd 200 μL of 2% FBS-PBS.\nCentrifuge at 110 × g at 10 min.\nDiscard the supernatant.\nAnalyze with a flow cytometer.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Dissociation of tumor-bearing kidneyThis video demonstrates the methods shown in steps 5 to 8 of Step-by-step method details.\nIn vivo passage\nTiming: 1–2 h\nThis section describes the preparation and re-injection of the cancer cells into the next mouse.\nWash with HBSS.\nMerge dissociated cells from each mouse into 10 mL of HBSS.\nCentrifuge at 400 × g at 10 min.\nRemove the supernatant.\nCell preparation for inoculation (troubleshooting 4[href=https://www.wicell.org#sec5.7]).\nSuspend cells into HBSS.\nCount cell number and adjust the concentration of cancer cells to be 2.0 × 106 cells/mL.\nNote: Both the cancer and stromal cells are included in samples of different cell sizes. In general, cancer cells are larger than stromal cells, with a diameter between 5 and 20 μm. It is good to separately count the cancer cells from the stromal cells based on their size. Repeated renal subcapsular inoculation can be performed with the mixed population of the cancer cells and the stromal cells.\nCritical: To avoid exceeding clonal selection, prepare three or more tumor-bearing mice.\nRenal subcapsular inoculation. Please follow the protocol shown above. Inoculate 1.0 × 105 cells of cancer cells suspended in 50 μL.\nWhile considering humanitarian endpoints, the mice were kept. Once the survival time of derivative-bearing mice reaches almost half that of those bearing parental cells, cells can be established as highly malignant derivatives.\nEvaluate activity of Luc2 in highly malignant derivatives. Please follow the protocol shown in step 1 before you begin[href=https://www.wicell.org#before-you-begin] (troubleshooting 5[href=https://www.wicell.org#sec5.9]).\ntable:files/protocols_protocol_1585_1.csv"
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Model Organisms",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}