{
  "id": 17901,
  "origin_website": "Jove",
  "title": "Preclinical Model of Hind Limb Ischemia in Diabetic Rabbits",
  "procedures": [
    "Studies involving animals were performed with the approval of the University of Texas at Austin and the UTHealth Science Center at Houston Institutional Animal Care and Use Committee (IACUC), the Animal Care and Use Review Office (ACURO) of The United States Army Medical Research and Materiel Command Office of Research Protections, and in accordance with NIH guidelines for animal care.\n1. Induction of diabetes and hyperlipidemia\nTransition the New Zealand rabbits (4–6 months old) from one cup of standard alfalfa chow to 0.1% cholesterol chow over the course of four days. For days 1–5, use standard chow to cholesterol chow ratios of 1:0, 3:1, 1:1, 1:3, and 0:1, respectively. After two weeks on 0.1% cholesterol chow, induce rabbits to have diabetes using alloxan injection as described in the following steps\nSedate the rabbits using 35–75 mg/mL ketamine and 1–2 mg/mL acepromazine via subcutaneous injection and prep for an IV injection by introducing a catheter into the marginal left ear vein using a 22 g catheter.\nCollect a drop of blood from the rabbits via hub of the ear vein catheter for the baseline blood glucose level (BGL) measurement. Any standard glucometer can be used. Normal glucose levels for a rabbit are typically in the range of 80 to 150 mg/dL.\nInject alloxan at 100 mg/kg reconstituted in saline to a volume of 8 mL through the ear catheter slowly over an 8-minute period using a syringe pump.\nCheck the BGL every hour for the next 12 h using a standard glucometer to monitor for hypoglycemia.\n\t\nPlace the rabbit in a restrainer.\nAnesthetize the ear with 2.5% lidocaine/2.5% prilocaine cream.\nTake blood from the lateral ear vein using a 27 G needle and measure BGL using a standard meter.",
    "Measure the BGL two times a day for the first 7 days. Give the rabbits an injection of insulin if the BGL reaches or exceeds 350 mg/dL.\nPrepare a 3-mm stainless steel ball for implantation as a size marker during angiograms prior to the day of surgery.\n\t\nCut a 10-mm circular piece of silastic sheeting out of a larger sheet using a biopsy punch.\nMount the ball in the center of the sheet using clear silicone sealant.\nCompletely cover the ball with the sealant. Allow the sealant to cure for a minimum of 24 h.\nPlace the ball in an open 2 inch x 3 inch low density polyethylene bag and place it into a sterilization bag to be sterilized with ethylene oxide gas.\n2. Preparation of rabbit for surgery\nAnesthetize the rabbit using 20–40 mg/kg ketamine and 2 mg/kg midazolam via subcutaneous injection. Place the rabbit on 1.5%–3% isoflurane (typically 2%) throughout the initial sedation using a mask. Give an injection of alfaxalone to maintain anesthesia via an intramuscular injection of 3 mg/kg.\nOnce anesthetized, remove the mask and insert a cuffed endotracheal tube, into the airway and connect to a ventilator. Continue to administer isoflurane at 1.5%–3%.\nCollect blood from the central artery from either ear for a baseline chemistry panel.\nPlace a 22 G ear vein catheter in the lateral ear vein for Lactated Ringer's Solution drip throughout the surgical procedure. Alternatively, normal saline (0.9% sodium chloride) can be used.\nUsing the lateral vein in the opposite ear, place a catheter in the vein and deliver alfaxalone at 6 mg/kg/h. Gradually increase the alfaxalone to 8 mg/kg/h while decreasing isoflurane to 0.6% during the prep period.",
    "To limit pain and risk of infection, administer buprenorphine (0.01 mg/kg) and enrofloxacin (5 mg/kg) using a subcutaneous injection with a 25 G needle.\nTrim the hair on the neck, right and left inner thighs, and back using clippers (#40 blade). Hair is removed from the back to maintain contact with the grounding pad.\nPlace a blood pressure cuff on each of the hind limbs and measure initial blood pressure. Place the cuff just below the knee with the probe just above the hock on the lateral surface.\nPosition the rabbit on the surgery table on its back and scrub and drape the surgery sites. This includes the neck for carotid artery access and inner right thigh for femoral artery access. Perform the sterilization scrub with alternating scrubs of 2% chlorhexidine and 70% ethyl alcohol. Repeat this three times, then apply a final spray with 2% chlorhexidine solution.\nPlace a 3-mm stainless steel ball that has been sterilized inside a low density polyethyene bag on top of the right (scrubbed) leg near the upper part of the thigh to serve as a size reference during angiogram measurements. Place a sterile drape over the leg until the time of surgery. Leave the ball inside the sterile plastic bag during the first angiogram.\n3. Angiography\nExpose the right common carotid artery\n\t\nMake a 4–5 cm long incision just lateral to the trachea using a scalpel with a #15 blade.",
    "Use blunt dissection to expose the carotid artery and open the incision using small Weitlaner retractors. Carefully isolate the carotid artery from the jugular vein and vagus nerve. Typically, a curved Metzenbaum scissors and a curved mosquito hemostat are used for the blunt dissection. Be sure to get full separation of the carotid artery from the nerve and jugular vein to make the ligatures only ligate the artery.\nPlace a ligature using a 4-0 silk suture at the proximal and distal ends of the exposed artery. Tie off the distal end of carotid with a surgeon’s knot followed by four square knots. On the proximal end, use a ligaloop to allow it to be tightened or loosened as needed. The use of a ligaloop placed at the proximal end of the exposed artery can help secure the introducer and catheter.\nAdminister 500 IU of heparin through the IV. Use approximately 0.5 mL of 1% lidocaine applied along the exposed carotid to dilate the vessel. One treatment is usually sufficient, but it can be repeated as needed. Cut approximately half way through the carotid artery using a scalpel or iris scissors, then place the 4-inch wire insertion tool into the artery.\nFeed a 0.014 inch x 185 cm guidewire through the insertion tool to the aortic bifurcation at the iliac crest in the descending aorta. Remove the insertion tool and insert a 3F pigtail angiographic catheter over the wire.\nAdvance the pigtail catheter to be 2 cm proximal to the aortic bifurcation at the iliac crest in the descending aorta.\nPosition the tip of the catheter between the seventh lumbar and first sacral vertebrae. Test the location of the catheter by manually injecting a 2–4 mL of contrast agent.",
    "Administer an intra-arterial injection of 100 μg nitroglycerin through the catheter to increase vasodilation.\nAdminister 0.8 mL of 1% lidocaine to the rabbit through the catheter to assist with vasodilation during the angiogram. Attach the tubing for the injector to the catheter and remove any air bubbles in the line. Inject 8-9 mL of contrast media using automated angiographic injector through the catheter.\nRecord serial images of the hind limbs using angiography.\n\t\nSet the power injector to inject contrast at 3 mL/sec for a total of 8-9 mL. Perform digital subtraction angiography at 6 frames per second.\nSelect the serial images created and alter a photo of each angiogram using approximately -40% setting to minimize appearance of bone and capture a complete picture of the vessel perfusion with contrast. An example angiogram of the vascular flow after femoral artery ligation/excision is shown in Figure 1.\n4. Isolation of the femoral artery\nMake a longitudinal incision in the skin over the right femoral artery using a scalpel (#15 blade). Ensure that the incision extends inferiorly from the inguinal ligament ending at the area just proximal to the patella (approximately 6 cm).\nUse blunt dissection with curved Metzenbaum scissors or a curved mosquito hemostat to expose the femoral artery.\nUse Weitlaner retractors to hold the incision open.\nAdd 0.5 mL of 1% lidocaine locally to reduce nerve irritation and promote vasodilation.\nContinue blunt dissection of the tissues to free the entire length of the femoral artery along with all branches of the femoral artery, including the inferior epigastric, deep femoral, lateral circumflex, and superficial epigastric arteries (Figure 2A).",
    "Dissect further along the popliteal and saphenous arteries as well as the external iliac artery (Figure 2A). Periodically moisten the area with saline to protect from tissue damage. If the blunt dissection is performed along the femoral groove (between the muscles) there is no need to cut the muscle.\nCarefully separate the artery from the vein and nerve as shown in Figure 2B,C. Ligate the arteries indicated by the diagram with 4.0 silk sutures by placing two ties with enough space between them to cut the artery. These ties are performed with a Surgeon’s knot followed by four square knots.\nCut between the two ties on the ligated arteries using the small Metzenbaum scissors. Excise the femoral artery from its proximal origin as a branch of the external iliac artery to the point distally where it bifurcates to form the saphenous and popliteal arteries.\n5. Repeat angiography\nUse 4-0 silk suture to attach the silastic sheet, with 3-mm stainless steel ball to the upper part of the quadriceps muscle. Pull the skin over the ball after it is in place.\nAdminister an intra-arterial injection of 100 μg nitroglycerin through the catheter to increase vasodilation.\nIf needed, administer another 0.8 mL of 1% lidocaine to the rabbit through the catheter to assist with vasodilation during the angiogram.\nInject 8-9 mL of contrast media using an automated angiographic injector.\nPerform angiography as described in step 3.9.\n6. Wound closure and recovery\nRemove the catheter from the right artery. Tie off the artery using the 4-0 silk suture that is already in place around the artery.",
    "Suture both wounds closed. Close muscle and subcuticular layers using 4-0 polydioxanone or 3-0 polyglactin 910 on a taper needle (see Table of Materials) in a continuous suture pattern. Close the skin using 4-0 polydioxanone or 4-0 polyglactin 910 on a reverse cutting needle (see Table of Materials) in a buried continuous subcuticular suture pattern.\n\tNOTE: If available, polydioxanone is preferred for both.\nAdminister intradermal injections of 0.25% bupivacaine near the incisions using a syringe with a 25 G needle. Insert the needle and inject 0.5 mL while the needle is pulled back. Give one injection per side of the wound for the incision on the neck (two injections on the neck) and two injections per side of the wound for the incision on the leg (four injections on the leg; six injections in total). The total volume injected is 3 mL (0.5 mL x 6 injections).\nAdminister subcutaneous injections of 0.5 mg/kg meloxicam and sustained release buprenorphine at 0.12 mg/kg.\nMonitor the rabbit as it recovers from anesthesia. The rabbit will automatically start to swallow as it wakes up from anesthesia. Once the swallowing response occurs, remove the endotracheal tube. Provide close monitoring and thermal support until the rabbit is able to maintain cardiovascular function and body temperature. Return the rabbit to its enclosure once it is able to ambulate.\nEmploy fresh vegetables and/or syringe feeding of a critical care diet along with subcutaneous saline injections if the rabbit does not tolerate chow after the surgery. Cabbage, broccoli, cauliflower, carrots, or other in seasonal vegetables can be used. Shred the vegetables and mix them together to aid in the rabbit returning to eating.\n7. Monitoring",
    "Anesthetize the rabbits every two weeks to acquire blood pressure on both legs as described in step 2.8. Harvest blood from the central artery of the ear for use in blood chemistry assays. Alternatively, take blood from the saphenous vein or cephalic vein. Take approximately 2 mL at each time point. Use a standard blood chemistry panel for analysis. If needed, add tests for low density lipoprotein (LDL), high density lipoprotein (HDL), or hemoglobin A1c (HbA1c).\nTake a very small amount of blood for BGL measurements.\n8. Treatment\nPrepare ten syringes with treatment, carrier, and crosslinker. Fill each syringe just prior to use with 100 μL of calcium sulfate slurry and then 100 μL of 2% sodium alginate with growth factors or other treatments such that the alginate is nearest the tip of the syringe.\nAdminister one prepared injection into the muscle before preparing the next. This reduces the time that the alginate interacts with the calcium sulfate in the syringe. Space the injections evenly along both sides of the femoral artery on the thigh. To achieve uniform injections, create a silicone sheet with holes to guide the injection, as described in other studies19. This can be easily prepared by using a biopsy punch to create holes in commercially available silicone sheeting.\n9. Endpoint angiography, euthanasia, perfusion fixation and tissue harvest\nAt the endpoint date, perform angiography as described in step 3 but use the left carotid artery for access.\nAfter angiography, move the animal to the necropsy table and perform perfusion fixation to preserve the hind limb tissues:\n\t\nIncrease the isoflurane to 3%–4% and perform a toe pinch to confirm the anesthesia is sufficiently deep.\nAdminister 1000-2000 IU of heparin intravenously.",
    "Create an incision along the midline of the ribcage and spanning the length of the diaphragm using a scalpel with a #20 blade.\nWith the rib cage exposed, cut the ribs just left of the midline using rib cutters. Use Weitlaner retractors to expose the heart.\nSet up the pump with output tubing with an inner diameter of 1/8 inch and a 18G needle at the end. Preload the line with saline and have at least 600 mL of saline and formalin prepared in separate containers for the perfusion.\nInsert the 18 G needle connected to the pump into the left ventricle via the apex of the heart. Insert another 18 G needle (unattached to anything) into the right atrium and allow blood to flow out into the downdraft of the necropsy table.\nUse a perfusion pump to control the flow of approximately 500 mL of saline into the heart. Use a pump setting to flow 110 mL/min.\nOnce the fluid coming from the heart is clear, move the tubing from the saline reservoir to one filled with a 10% formalin solution. Twitching will occur in all four limbs if the perfusion is working properly. Pump approximately 500 mL of formalin solution into the left ventricle.\nTurn the pump off and remove the needles from the heart.\nRemove both hind limbs at the hip by cutting around the hip joint with a scalpel with #20 blade. Use a small rib cutter to remove the limbs. Use the non-ischemic limb as a control.\nStore the limbs in formalin for 24 h at 4 °C and then stored in 70% ethanol at 4 °C.\nFor histological analysis, take multiple biopsies from the limbs. We have used eight 6-mm biopsies taken at regions across the thigh and calf in both limbs.",
    "NOTE: While ankle blood pressure measurement and angiography are the most commonly used methods for measuring recovery of blood flow, other methods can be used to track recovery of the animals including Doppler ultrasound, laser Doppler imaging, infrared thermography62, microsphere determined perfusion63,64, computed tomography (CT) imaging, and magnetic resonance imaging (MRI)65.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}