{
  "id": 2678,
  "origin_website": "Cell",
  "title": "Using Machine Learning and Targeted Mass Spectrometry to Explore the Methyl-Lys Proteome",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPredicting Lys-Methylation Sites with MethylSight\nTiming: negligible for indexed human sequences (with a valid Uniprot ID), and approximately 1 s per lysine for non-indexed sequences\nThis step allows one to identify the most promising Lys-methylation sites for subsequent validation via targeted mass spectrometry or immunoblotting with methyl-specific antibodies. The researcher can then make an informed decision as to which proteins/sites are most likely to generate hits.\nNavigate to https://www.methylsight.com[href=https://www.methylsight.com], and proceed to the “predictor” page (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/217-Fig1.jpg\nFigure 1. Predictions Output by MethylSight\n(A) Once the user’s query has been completed, the MethylSight web server displays a results page outlining the predictions made by the predictor.\n(B) User-adjustable operating threshold for the predictor (i.e., to adjust the score cut-off above which predictions are considered to be positive and displays the anticipated accuracy of the predictions).\n(C) Graphical display of prediction results along the length of the protein, showing predictions, along with other validated post-translational modifications.\n(D) The user is offered the option to consult the predictions in a table format and to download a tab-separated value (tsv) file.\nSubmit your proteins of interest in the submission form (Figure 1[href=https://www.wicell.org#fig1]A).\nIf the proteins are indexed in the SwissProt database, stay in the “Lookup” tab of the submission form select a .txt file containing the Uniprot ID.\nIf the proteins are not indexed, select the “Custom sequence” tab, and select the FASTA file containing the sequences.\nClick on “Submit” (individual ID) or “Upload” (ID list or FASTA file) and wait for the prediction results to be generated.\nNote: Uploading non-indexed sequences may lead to longer wait time – particularly if the FASTA file contains numerous sequences, as the MethylSight server needs to pre-process the sequences and to run the prediction algorithm.",
    "Critical: Do not close the browser tab while MethylSight is generating predictions.\nThe “results” page will automatically load once predictions are complete. In this page, set an operating threshold based on your preference for sensitivity and precision of the predictions (Figure 1[href=https://www.wicell.org#fig1]B). “Permissive” and “conservative” parameter presets are provided.\nNote: Sensitivity and precision should be considered by the user. These parameters and the trade-off between them are described in greater detail in Quantification and Statistical Analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] – Interpreting the Predictions Made by Methylsight[href=https://www.wicell.org#sec5.1].\nSelect candidates among the sites labeled as positives or with the highest prediction scores for experimental validation (Figures 1[href=https://www.wicell.org#fig1]C and 1D).\nCritical: The decision threshold is the value that discriminates between positive and negative predictions. Sites with prediction scores below the threshold are labeled as negative, while those with scores greater or equal to the threshold value are considered positive. Setting an appropriate threshold drastically affects the predictions and how they should be interpreted – a topic discussed in Quantification and Statistical Analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] – Interpreting the Predictions Made by Methylsight[href=https://www.wicell.org#sec5.1]. It is advised to set the threshold parameter (Figure 1[href=https://www.wicell.org#fig1]B) before consulting the predictions.\nTargeted Validation of Lysine Methylation Sites\nTiming: 2–3 days\nIn this step, we discuss one approach to validate MethylSight predicted lysine methylation sites. To validate the status of predicted methylation sites, we suggest the use of a targeted mass spectrometry approach, such as parallel reaction monitoring (PRM-MS). Further, it is best to proceed with a quality source of semi-purified protein of interest, such as an immunoprecipitation preparation from a relevant cell line or tissue. PRM-MS can differentiate and relatively quantify peptides with isobaric post-translational modifications (PTMs). In yeast, in which the histone H3 K4 mono-methyltransferase SET1 was lacking, PRM-MS was used to quantify several newly identified methyl modifications (Lee et al., 2020[href=https://www.wicell.org#bib3]).",
    "Building a PRM-MS isolation list.\nDownload and install a local copy of Skyline software (MacLean et al., 2010[href=https://www.wicell.org#bib4]).\nNavigate to “Settings” and select “Peptide settings.”\nUnder the “Digestion” tab, select your protease of interest (e.g., Trypsin) and max missed cleavages (e.g., 1 missed cleavage).\nUnder the “Modifications” tab, select Carbamidomethyl (C) if iodoacetamide was used. Close the “Peptide Settings” window.\nNext, enter the FASTA protein sequence of your target to the “Targets” window (copy & paste directly in the “Targets” panel, or File>Import>FASTA>select the desired FASTA file). The Skyline software will automatically perform an in silico digest of your protein and select the most likely proteotypic peptides and optimal transitions.\nNote: Peptides and transitions can also be manually selected by right clicking the peptide ion and selecting “Pick Children.”\nNote: Skyline software currently has a large and active user group. Please refer to the Skyline Support Board for up to date information and assistance in developing your isolation list.\nNavigate to peptide(s) containing the candidate methylation site in the “Targets” panel. Right click on the peptide sequence and select “Modify” from the drop-down list to add a variable modification to lysine. A new “Modify” window will appear, on the modified lysine select either mono-, di-, and tri-methylation modifications representing the addition of 14.01565, 28.03130 and 42.04695 Da, respectively.\nNote: Peptides can be copied and pasted within the Skyline program to maintain any manually selected transitions. This allows users to include several variants in the isolation list that represent several PTM m/z and maintain comparable transition lists.",
    "Note: We apply validation criteria that are specific for methylated peptides when confirming modification sites identified by Methylsight. This criteria includes the inclusion of fragment ions that are diagnostic of a methylation event and that constrain the methyl group to a specific amino acid. Importantly, methylation differs from other modifications as any amino acid could be considered a potential site of methylation if exchanged for another amino acid by the addition of a methyl group (e.g., glycine, serine, etc.).\nExport your isolation list for PRM-MS analysis. Navigate to “File” and select “Export.”\nTroubleshooting[href=https://www.wicell.org#troubleshooting] - Difficulty in selecting peptides that are diagnostic of the methyl-Lys site of interest\nSample preparation for mass spectrometry. Digest your isolated protein sample using mass-spec grade Trypsin (i.e., serine protease that specifically cleaves at the carboxylic side of lysine and arginine except when followed by a proline).\nDissolve target protein (e.g., immunopurified) in 50 μL of denaturation buffer. Scale volume, as necessary, up to a protein concentration of 1 mg/mL.\nHeat at 95°C for 20 min and allow to cool.\nAdd iodoacetamide to a final concentration of 55 mM in darkness and incubate at room temperature for another 30 min.\nAdd 50 mM NH4HCO3 (pH 7.8) (such that the final concentration of guanidine-HCl is below 1 M).\nAdd trypsin protease to a final protease:protein ratio of 1:50 (w/w) and incubate at 37°C overnight.\nPause Point: At this stage, samples can be stored short-term (1–2 days) at 4°C and long-term (months) at −80°C. Dried protein digests can be stored at −80°C for years without compromising sample quality.",
    "Note: Other proteases can be used other than Trypsin to create ionizable proteotypic peptides that contain your methylation site of interest. To determine an appropriate protease for use, perform an in silico digestion with Trypsin or other proteases using the ExPASy PeptideCutter webserver (https://web.expasy.org/peptide_cutter/[href=https://web.expasy.org/peptide_cutter/]) (Gasteiger et al., 2003[href=https://www.wicell.org#bib2]). Follow recommended manufacturer guidelines for digestion reactions.\nSample preparation and desalting.\nPre-treat sample: Adjust sample from step 6e such that they contain approximately 0.1% formic acid (FA). Samples should be below 4.0 (check with pH paper). If needed, adjust the pH using formic acid.\nCondition tip: Securely attach a Bond Elut OMIX C18 tip (Agilent; Cat# A57003100) and set pipettor to 100 μL. Aspirate 100 μL of tip equilibration solution and discard. Repeat 4 times. Keep plunger depressed and move to the next step.\nEquilibrate: Aspirate 100 μL of tip wash solution and discard. Repeat 4 times. Keep pipette plunger depressed and move to the next step.\nBind: Aspirate 100 μL of pretreated digested sample into tip and cycle the sample across the C18 column bed 3 to 5 times to increase peptide binding efficiency. Depress pipette plunger and move to the next step.\nWash: Aspirate 100 μL of tip wash solution and discard solution to waste. Cycle 2–4 times. Keep plunger depressed and move to the next step.\nElute: Carefully draw 100 μL of peptide elution solution into the top.\nCritical: Do not repeat this step or expel pipette plunger as your peptides will elute into your peptide elution solution.\nElute the sample directly into a clean microcentrifuge tube and cycle the elution solution up to ten cycles across the C18 column bed to improve elution efficiency.\nRepeat steps f and g, eluting your sample into the same microcentrifuge tube.",
    "Dry samples using a Thermo Scientific Savant SpeedVac (or similar) to evaporate the sample solution.\nResuspend in 20–30 μL of tip wash solution for mass spectrometry analysis (step 9).\nPause Point: Dried peptides may be stored at 4°C for 1 week or at −20°C for 1 month.\nNote: Your MS facility will have guidelines on the optimal peptide amount to be injected into their particular LC-MS/MS system. Generally, 1 μg/μL is optimal but affinity purified samples are likely to be much lower.\nMass spectrometry analysis. Analyze each sample collected in step 8j. Analysis of proteins is routine for most mass spectrometry facilities, but the sample preparation and procedure for LC-MS/MS analysis depends on the configuration of the mass spectrometer and liquid chromatography system. We analyze each fraction by using a Thermo EASY nano liquid chromatography (EASYnLC) system on a Thermo Q Exactive mass spectrometer (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/217-Fig2.jpg\nFigure 2. Validation of MethylSight Predicted Methyl-Lys Sites by Targeted Mass Spectrometry\nBriefly, a target precursor ion containing the methylation site of interest is (1) isolated in the quadrupole analyzer and (2) fragmented in the HCD cell. The fragment ions are then (3) detected in the Orbitrap mass analyzer. A (4) MS/MS spectrum (representative) is used for the confident identification of the peptide, and (5) peak areas of fragment ions (representative) can be integrated across the elution profile for quantification.",
    "Peptides are first concentrated on a trapping-column (EASY-Column, 100 μm 2 cm, Thermo Scientific) using 0.1% formic acid at a flowrate of 20 μL/min and subsequently separated on a reverse phase main-column (EASY-Column, 75 μm 10 cm, Thermo Scientific) using a binary gradient consisted of A: 0.1% formic acid and B: 84% acetonitrile, 0.1% formic acid at a flowrate of 250 nL/ min. The gradient increased linearly from 3% A to 29.7% B over 75 min.\nThree washing steps at 95% of B at the end of the gradient are then applied to prevent carry-over into the next run.\nEach MS1 survey scan in the Orbitrap is followed by data-dependent MS/MS scans that is guided by the isolation list (designed in step 6) in the ion trap using collision-induced dissociation (CID) fragmentation.\nObtain results in RAW file format."
  ],
  "subjectAreas": [
    "Proteomics",
    "Mass Spectrometry",
    "Sequence Analysis",
    "Bioinformatics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}