{
  "id": 2736,
  "origin_website": "Cell",
  "title": "An Improved Protocol for the Production of Lentiviral Vectors",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nSeeding HEK293T Cells for Transfection\nTiming: ∼2–3 days\nPrior to transfection, the HEK293T cells must be seeded.\nStart new HEK293T cell culture. Seed low passage HEK293T cells into a 100 mm tissue culture plate. Grow cells at 37°C with 5% CO2 in a standard tissue culture incubator.\nNote: Low passage cells are used to ensure quality and adequate cell growth speed. It is recommended to not use cells that have been passaged more than 15 times, or less than 2 times, or if growth has slowed.\nOnce cells reach 90%–95% confluent growth, prepare and collect cells for reseeding.\nAspirate media from the confluent 100 mm tissue culture plate and gently rinse the cells with ∼3.0 mL of sterile 1× PBS.\nIncubate cells with 1.0 mL of dissociation reagent (e.g., Trypsin-EDTA) for 3–5 min until cells have detached from each other and from the bottom of the plate.\nAdd 8 mL of media prepared with FBS to inactivate the dissociation reagent.\nTriturate the cells against the bottom of the plate 10–15 times to create single cell suspension with a cell density of approximately 5 × 107 cells/mL.\nNote: The following measurements and calculations of the protocol are for a single 150 mm tissue culture plates. Scale accordingly to experimental needs.\nOptional: To enhance cell adherence to the tissue culture plate, pre-coat tissue culture plates by adding 5 mL of 0.2% gelatin per plate. Spread the gelatin evenly across the surface of the plate, incubate at 20°C–22°C for 10 min, and then siphon off the liquid.\nDay 0: Reseed HEK293T cells into 150 mm plates for production.\nAdd 22.5 mL of warm (37°C) FBS containing media to each 150 mm plate.",
    "Seed 2.5 mL of cells from step 2 into each plate (total ∼4 × 106 cells/plate).\nIncubate the plates 12–18 h or until 70%–80% confluence is reached.\nNote: For concentrated lentiviral vectors, up to six 150 mm plates can be used in a single production run, with capacity being limited by ultracentrifuge space. One 100 mm plate can seed approximately four 150 mm plates, and one 150 mm plate can produce ≥2.5 × 107 vg/mL for non-concentrated lentivirus and ≥2.5 × 109 vg/mL for concentrated lentivirus.\nTransfecting HEK293T Cells Using Calcium Phosphate-Based Technique\nTiming: ∼4 days\nOnce the HEK293T cells in the 150 mm tissue culture plates have reached 70%–80% confluence, they are ready for transfection.\nCritical: The calcium phosphate transfection (Day 1) should be performed in the afternoon, and it is crucial to replace the media the following morning (Day 2) as it affects cell viability.\nDay 1: Aspirate the old media from the 150 mm plates and gently replace with 20 mL of freshly prepared media without FBS by pipetting the media against the sidewall of the plate. The lack of serum stunts cell growth and enhances uptake of the transfection mixture.\nPrepare transfection mixture in a 15-mL conical tube following the volumes for each reagent listed in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_225_5.csv\nAdd 2× BBS Solution. Set tabletop vortex to ∼4–5 speed. While vortexing the 15-mL conical tube, slowly add 1.25 mL of 2× BBS solution dropwise to the plasmid mixture (total transfection mixture volume is 2.5 mL). Once completed, incubate for 30 min at 20°C–22°C.",
    "Critical: Adding 2× BBS solution dropwise while vortexing can help ensure maximum mixture of 2× BBS solution with the transfection mixture. The transfection mixture must be clear prior to its addition onto the cells to ensure smaller size of CaPO4 precipitates, which is crucial for transfection efficiency. If the mixture becomes cloudy, repeat steps 5 and 6, and prepare fresh 2× BBS if needed.\nAdd transfection mixture to cells.\nFollowing 30 min incubation, immediately add the transfection mixture dropwise to 150 mm tissue culture plate.\nSwirl plates gently and incubate for 1 h.\nCheck size of CaPO4 precipitates in transfected cells under light microscope.\nAdd 2.5 mL (10%) pure FBS to the plate and incubate 12–18 h.\nNote: The calcium phosphate precipitates should be small for ideal transfection.\nNote: Some labs use 3% CO2 incubators to stabilize media pH. However, we do not observe any difference in transfection efficiency between 3% and 5% CO2.\nCritical: It is crucial to replace the media the morning following transfection as it affects cell viability.\nDay 2: 12–18 h post-transfection replace media with fresh FBS containing media to remove CaCl2 and 2× BBS solution.\nObserve cells to ensure that they are near 100% confluency with little to no cell death.\nGently aspirate old media.\nAdd 25 mL prepared media with FBS, and continue incubating for an additional 48 h.\nNote: If using more than four 150 mm tissue culture plates for production, adjust volume of media per plate to ∼20–22 mL (refer to step 19 Note of protocol for rationale).\nHarvesting Virus\nTiming: ∼30 min\n48 h after replacing media, the virus is ready to be harvested.\nDay 4: Without disturbing the transfected cells, carefully collect the supernatant from the 150 mm tissue culture plate into a new, sterile 50-mL conical tube.",
    "Centrifuge the 50-mL conical tube at 400–450 × g for 5 min using a tabletop centrifuge to separate any detached cells from the supernatant. Filter the supernatant through a 0.45 μm vacuum filter unit to remove large cellular debris.\nPause Point: The filtered supernatant can be stored at 4°C for up to 4 days prior to the concentration of viral particles.\nPause Point: The filtered supernatant is the non-concentrated lentiviral vector which can be used for certain in vitro experiments, or aliquoted and stored at −80°C. It is recommended to avoid subjecting lentiviral preparations to multiple freeze-thaw cycles, since each cycle can result in a 10%–20% loss in functional titers.\nIf not concentrating viral particles, prepare a 1:10 dilution of the samples for subsequent estimation of viral titers as shown in Table 2[href=https://www.wicell.org#tbl2] using ELISA method in step 35. ELISA samples can be stored at −20°C for an extended period of time.\ntable:files/protocols_protocol_225_6.csv\nConcentration of Viral Particles by Ultracentrifugation (In Vitro)\nTiming: ∼3 h\nUsing ultracentrifugation and a sucrose filter, the lentiviral particles are concentrated for in vitro use.\nAdd 4 mL of 20% sucrose dissolved in 1× PBS to the bottom of the conical ultracentrifuge tube. Without disturbing the sucrose, carefully load the filtered supernatant on top of sucrose layer dropwise as shown in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/225-Fig1.jpg\nFigure 1. Graphical Depiction of Sucrose Layer for Concentration of Lentiviral Vectors for In Vitro\nCritical: Distribute the viral supernatant evenly among the tubes, leaving at least 10% headspace to prevent spillage resulting in possible loss of sample and/or damage of equipment.",
    "Note: Each conical ultracentrifugation tube has a volume capacity of up to 30 mL. When using four or more 150 mm tissue culture plates during transfection, use all six ultracentrifugation tubes per spin to process the full volume of the filtered viral supernatant. If producing more than four 150 mm plates, adjust the changed media with serum volume (from step 8) to ∼20–22 mL/plate to accommodate the six ultracentrifuge tube limit.\nBalance the ultracentrifuge tubes to within a difference of 0.01 g using sterile 1× PBS solution.\nSpin down the tubes in the ultracentrifuge for 2 h at 70,000 × g at 17°C.\nNote: To prevent disruption of the sucrose layer during acceleration and deceleration of the centrifuge spin, set rotor to slowly accelerate to 10 × g during the first 3 min of the spin, and then slowly decelerate from 10 × g to 0 × g during last 3 min of the spin.\nOnce the spin is complete, gently extract the conical ultracentrifuge tubes and isolate the pellet.\nAspirate all media and sucrose. Be careful not to disturb the pellet.\nUse a sterile paper towel to carefully wipe the sides of the tubes, without touching the pellet.\nSet the tubes inverted on sterile paper towel to dry at 20°C–22°C for 10 min.\nNote: The lentivirus pellets should be visible as a small translucent dot at the bottom of the conical ultracentrifuge tubes.\nResuspend the pellet with cold 1× PBS solution using half the total desired volume and transfer to a sterile microfuge tube. Repeat to get desired final volume and store at −80°C (e.g., If a total volume of 100 μL of 1× PBS solution is used, first resuspend with 50 μL, then wash with another 50 μL and combine).",
    "Note: The final viral mixture should appear clear, however, the mixture may appear cloudy due to cellular impurity remnants. Typically, 25 μL of 1× PBS solution per 150 mm tissue culture plate is sufficient to resuspend and wash the pellet.\nPause Point: The concentrated lentiviral vector can be stored at −80°C for an extended period of time. Avoid subjecting viral preparations to multiple freeze-thaw cycles, since each process results in a 10%–20% loss in functional titers.\nPrepare a 1:100 dilution of the samples for estimation of viral titers as shown in Table 3[href=https://www.wicell.org#tbl3] using ELISA Method in step 35. Store ELISA samples at −20°C.\ntable:files/protocols_protocol_225_7.csv\nConcentration of Viral Particles by Ultracentrifugation (In Vivo)\nTiming: ∼6 h\nUsing two ultracentrifuge spins, a sucrose gradient filter, and a sucrose cushion step, the lentiviral particles are concentrated for in vivo use.\nCreate a sucrose gradient in the following order in the conical ultracentrifuge tube, which is also shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/225-Fig2.jpg\nFigure 2. Graphical Depiction of Sucrose Gradient for Purification of Lentiviral Vectors for In Vivo\nAdd dropwise 0.5 mL 70% sucrose.\nAdd dropwise 0.5 mL 60% sucrose.\nAdd dropwise 1 mL 30% sucrose.\nAdd dropwise 2 mL 20% sucrose.\nBeing careful not to disturb the sucrose gradient, load the filtered supernatant on top of sucrose gradient dropwise.\nCritical: Distribute the viral supernatant evenly among the tubes, leaving at least 10% headspace to prevent spillage resulting in possible loss of sample and/or damage of equipment.",
    "Note: Each conical ultracentrifugation tube has a volume capacity of up to 30 mL. When using four or more 150 mm tissue culture plates during transfection, use all six ultracentrifugation tubes per spin to process the full volume of the filtered viral supernatant. If using more than four 150 mm plates, adjust the changed media with serum volume (from step 8) to ∼20–22 mL/plate to accommodate within six ultracentrifuge tubes.\nBalance the ultracentrifuge tubes to within a difference of 0.01 g using sterile 1× PBS solution.\nFirst spin. Spin down the tubes in the ultracentrifuge for 2 h at 70,000 × g at 17°C.\nNote: To prevent disruption of the sucrose layer during acceleration and deceleration of the centrifuge spin, set rotor to slowly accelerate to 10 × g during the first 3 min of the spin, and then slowly decelerate from 10 × g to 0 × g during last 3 min of the spin.\nNote: After spin down the viral particle should be concentrated between the 30% and 60% sucrose layers.\nOnce the first spin is complete, gently extract the conical ultracentrifuge tubes and aspirate all the media and most of the 20% sucrose layer. DO NOT touch the 30% sucrose layer.\nUse a P1000 pipette to gently extract the 30% and 60% sucrose layers and collect into a new 50-mL conical tube.\nAdd 15 mL of sterile cold 1× PBS solution to the 50-mL conical tube for each ultracentrifuge tube collected and resuspend well. (e.g., if the 30%–60% sucrose layers were collected from four ultracentrifuge tubes, resuspend in 60 mL of cold 1× PBS solution.)",
    "Add 4 ML of 20% sucrose to the bottom of a new conical ultracentrifuge tube. Being careful not to disturb the sucrose layer, load the resuspended viral-PBS mixture from step 24 on top of the sucrose layer dropwise.\nBalance the ultracentrifuge tubes to within a difference of 0.01 g using sterile 1× PBS solution.\nSecond spin. Spin down the tubes in the ultracentrifuge for 2 h at 70,000 × g at 17°C.\nOnce the second spin is complete, gently extract the conical ultracentrifuge tubes and isolate the pellet.\nAspirate all media and sucrose. Be careful not to disturb the pellet.\nUse a sterile paper towel to carefully wipe the sides of the tubes.\nSet the tubes inverted on sterile paper towel to dry at 20°C–22°C for 10 min.\nNote: The lentivirus pellets should be visible as a small translucent dot at the bottom of the conical ultracentrifuge tubes.\nResuspend the pellet with cold 1× PBS solution using half the total desired volume and transfer to a sterile microfuge tube. Repeat to get desired final volume and store at −80°C. (e.g., If a total volume of 100 μL of 1× PBS solution is used, first resuspend with 50 μL, then wash with another 50 μL and combine.)\nNote: The final viral mixture should appear clear. Typically, 25 μL of 1× PBS solution per 150 mm tissue culture plate is sufficient.\nPause Point: The concentrated lentiviral vector can be stored at −80°C for an extended period of time.\nPrepare a 1:100 dilution of the samples for estimation of viral titers as shown in Table 3[href=https://www.wicell.org#tbl3] using ELISA method in step 35 Store ELISA samples at −20°C.\nEstimation of Viral Titers Using ELISA method\nTiming: ∼3 days",
    "Estimation of viral titers is performed using the p24-enzyme-linked immunosorbent assay (ELISA) method. This protocol follows the instructions for the NIH AIDS Vaccine Program for HIV-1 p24 Antigen Capture Assay with slight modifications.\nCoat the 96-well Costar Assay plate using 80 μL of monoclonal anti-p24 antibody diluted 1:600 in 1× PBS solution per well. Incubate 12–18 h at 4°C.\nThe next day, wash the 96-well plate three times with 200 μL/well of 0.05% PBS-T solution.\nTo avoid non-specific binding, block the plate with 200 μL/well of 1% BSA in 1× PBS solution. Incubate for 1 h at 20°C–22°C.\nPrepare HIV-1 standards using a 2-fold serial dilution as shown in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_225_8.csv\nDilute prepared samples from harvesting (step 11) or concentration (step 17 or 30) as shown in Table 5[href=https://www.wicell.org#tbl5].\ntable:files/protocols_protocol_225_9.csv\nDilute non-concentrated lentiviral samples in SD solution to establish 1:500 and 1:2,500 dilutions.\nDilute concentrated lentiviral samples in SD solution to obtain 1:10,000, 1:50,000, and 1:250,000 dilutions.\nFollowing incubation with blocking solution, wash the 96-well plate three times with 200 μL/well of PBS-T solution. Apply 100 μL/well of controls (one empty well and one with SD buffer only), standards, and samples on the plate in duplicates as shown in Figure 3[href=https://www.wicell.org#fig3] and incubate 12–18 h at 4°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/225-Fig3.jpg\nFigure 3. Graphical Example of 96-Well Plate (8 × 12) with Each Box of the Table Representing a Well of the Plate\nThe above example displays the position of the controls, standards, and four diluted concentrated samples in duplicates.\nThe next day, dump the samples and wash the plate six times with 200 μL/well of PBS-T solution.\nAdd 100 μL/well of polyclonal rabbit anti-p24 antibody diluted 1:600 in PD Buffer. Incubate at 37°C for 4 h.",
    "Dump the polyclonal rabbit anti-p24 antibody and wash the plate six times with 200 μL/well of PBS-T solution.\nAdd 100 μL/well of goat anti-rabbit horseradish peroxidase IgG diluted 1:5,000 in secondary solution. Incubate at 37°C for 1 h.\nDump the goat anti-rabbit horseradish peroxidase IgG and wash the plate six times with 200 μL/well PBS-T solution.\nAdd 100 μL/well of SureBlue TMB peroxidase substrate. Incubate at 20°C–22°C for 10–30 min.\nNote: A gradient of blue should appear across wells A to F containing standards, reflective of sample concentration, with tube A being the most intense blue and tube F being the most diffuse.\nCritical: Do not allow the reaction to proceed for too long or samples will become saturated and gradient visibility will be lost.\nAdd 100 μL/well of 1 N HCL solution to stop the reaction. Once HCl is added, the wells will turn yellow.\nMeasure sample absorbance at 450 nm wavelength and 5 s mix time using plate reader."
  ],
  "subjectAreas": [
    "Crispr",
    "Cell Biology",
    "Neuroscience",
    "Genetics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}