{
  "id": 4314,
  "origin_website": "Bio",
  "title": "Cellular Translational Reporter Assay",
  "procedures": [
    "Subcloning of Luc2 cDNA   Prepare the polymerase chain reaction mix. Mix following components on ice: 0.2 μl of rTaq DNA polymerase 5 μl of 10x Buffer (+Mg) for rTaq 5 μl of dNTPs (2 mM each) 4 μl of primers (10 mM each of Forward and Reverse primers) 1 μl of vector pGL4.14 (100 ng) 35 μl of water   Run the polymerase chain reaction. Place the reaction mix to the GeneAmp PCR system 9700. PCR program: Step 1: 94 °C 5 min Step 2: 94 °C 30 sec  Step 3: 60 °C 2 min Step 4: 74 °C 1 min (repeat steps 2-4 for 35 times) Step 5: 74 °C 10 min   Purification of PCR amplified fragments.   Electrophorese the PCR products on 1% of agarose gel.   Stain Gel with Ethidium Bromide.   Cut the gel region including an amplified DNA fragment (approximately 1.6-kbp).   Purify PCR amplified DNA from gels using illustra GFX PCR and Gel Band Purification Kit. Note: In this process, we elute DNA fragment with 30 μl of Nuclease-free Water (8 μl aliquots of the eluent are used as a template DNA for following in vitro transcription).        In vitro transcription of Luciferase mRNA under the control of T7 promoter   Prepare the in vitro transcription mix.  Mix following components at room temperature: 8 μl of Template DNA 2 μl of 10x Reaction Buffer 2 μl of 10 mM ATP 2 μl of 10 mM CTP 2 μl of 10 mM UTP 2 μl of 10 mM GTP 2 μl of T7 Enzyme Mix  Mix thoroughly with pipetting.   Incubate at 37 °C, 4 h.   Add 2 μl of TURBO DNase (a component of MEGAScript) to digest the rest template DNA and incubate 15 min at 37 °C on the block incubator.   RNA extraction with lithium chloride (LiCl) precipitation.",
    "Add 30 μl of nuclease-free water and 30 μl of LiCl precipitation solution to the in vitro transcription products.   Mix thoroughly with vortex mixer. Chill for 1 h at -20 °C.   Centrifuge at 4 °C for 15 min at 15,000 rpm.   Discard the supernatants, and wash the pellet with 1 ml of 80% ethanol.   Centrifuge at 4 °C for 15 min at 15,000 rpm.   Discard the supernatants, and dry the pellet with centrifugal concentrator CC105 for 5 min.    Resuspend the RNA in 20 μl of Nuclease-free Water, and stored at -80 °C.        Enzymatic modification of RNA 5’ end   Add m7G cap, or m7G cap and 2’-O methylation to the in vitro-transcribed RNA with ScriptCap system.   Adjust the volume of transcribed RNA (50 μg) to 67 μl with Nuclease-free Water.   Denature the RNA at 65 °C for 10 min, then transfer the tube immediately to ice.   While the RNA is denaturing, mix following components. 10 μl of 10x ScriptCap Capping Buffer 10 μl of 10 mM GTP 2.5 μl of 20 mM SAM 2.5 μl of ScriptGuard RNase Inhibitor 4 μl of ScriptCap 2’-O-Methyltrasferase (100 U/μl) for 2’-O methylated 5’ capped RNA or Nuclease-free Water for 2’-O unmethylated 5’ capped RNA   Add 4 μl of ScriptCap Capping Enzyme (10 U/μl) and 67 μl of denatured RNA to the reaction cocktail from step C1c.   Incubate at 37 °C for 2 h.   Reaction products were purified with an RNeasy Mini Kit.        RNA transfection with mouse embryonic fibroblasts   Seed a 35 mm diameter dish with 2 x 105 mouse embryonic fibroblasts in 1 ml DMEM, and incubate 24 h.   Transfect RNA using Lipofectamine 2000.   Dilute 10 μl of Lipofectamine 2000 DNA Transfection Reagent in 240 μl of Opti-MEM medium per sample.   Dilute 2 μg of luciferase RNA in 250 μl of Opti-MEM medium.",
    "Add 250 μl of diluted Lipofectamine 2000 DNA Transfection Reagent to 250 μl of diluted Luciferase RNA. Mix thoroughly.   Incubate at room temperature for 15 min.   Add RNA-lipid complex to the mouse embryonic fibroblasts, and incubate for 6 h.        Luciferase translational reporter assays   Preparation of cell lysates.   After incubation for 6 h, wash the RNA-transfected mouse embryonic fibroblasts with D-PBS(-) twice.   Add 100 μl of 1x passive lysis buffer and harvest cells with cell scraper.   Centrifuge at 4 °C for 15 min at 15,000 rpm.   Determine the protein concentration in 5 μl aliquots of the supernatants by BCA Protein Assay.   Add equal protein amount (determined by BCA protein assay) of aliquots of the supernatants to 50 μl of Luciferase Assay Reagent II (LAR II).    Immediately, measure the relative luciferase units (RLUs) on Lumat LB 9507 Luminometer according to the manufacturer’s instruction.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140312/20140312023223_9936.jpg Figure 1. Luciferase activity of introduced RNAs. Wild-type and Ifit1-deficient (Ifit1-/-) mouse embryonic fibroblasts were transiently transfected with three different types of luciferase mRNAs (5’-uncapped, 5’ capped but 2’-O unmethylated; 5’ cap+/2’-O Me-, 5’ capped and 2’-O methylated; 5’ cap+/2’-O Me+). Luciferase activities are shown as relative light units (RLU), and the numbers of RLU were normalized by the concentrations of proteins determined in step E1d. Data are shown as means ± SDs of triplicate samples. These data show that Ifit1 selectively inhibits the translation of 5’ capped but 2’-O unmethylated (5’ cap+/2’-O Me-) luciferase mRNA."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}