{
  "id": 15016,
  "origin_website": "Jove",
  "title": "Chromosome Screening of Human Preimplantation Embryos by Using Spent Culture Medium: Sample Collection and Chromosomal Ploidy Analysis",
  "procedures": [
    "Ethical permission was acquired from the Ethics Committee of Peking University Third Hospital.\n1. Preparation\nNOTE: The required materials and equipment are listed in Table of Materials.\nReagents\n\t\nPrewarm and equilibrate (balanced) 20-30 µL of gamete medium/fertilization medium and cleavage/blastocyst-stage culture medium (covered with mineral oil) and hyaluronidase (in a tightly capped tube) at 37 °C, 5% CO2 and 5% O2 in a Tri-gas incubator overnight before use.\nPrewarm hyaluronidase to 37 °C on a working surface in a fume hood.\nPrepare vitrification buffer and sample collection reagents according to the manufacturer's instructions.\nTools\n\t\nPrepare sample collection and transfer pipettes (inner diameter of ~200 to 250 µm), denudation/stripper pipettes (inner diameter of ≥150 µm, ~130-140 µm, and ~120 µm), and pipettes for washing (inner diameter of ~150 µm) by pulling glass Pasteur pipettes to generate fire-polished open fine tips.\n\t\t​NOTE: The pipettes used for sample collection/transfer, denudation, and washing can be purchased directly. The holding needles and injection needles can also be purchased directly.\n2. Protocol 1: Sample collection\nPretreatment of oocyte-corona-cumulus complex (OCCCs) before digestion with hyaluronidase\n\t\nAchieve ovarian stimulation with both follicle stimulating hormone (FSH) and human menopausal gonadotropin (hMG) preparations. When the lead follicle is >18 mm, use 10,000 IU of chorionic gonadotropin (hCG) for final oocyte maturation.\nPerform oocyte retrieval 36 h after trigger shot. Pick up and transfer oocytes into tissue culture dishes with 2.5 mL of prewarmed m-HTF covered by mineral oil.\nRapidly transfer the OCCCs to the central well of an organ culture dish containing 1 mL of Fertilization Medium using a transfer pipette and then incubate with the oocytes at 37 °C in a 5% CO2 and 5% O2 incubator for 2-4 h.",
    "Digest OCCCs with hyaluronidase by adding 1 mL of 37 °C prewarmed hyaluronidase (80 IU/mL) to the central well of an organ culture dish containing OCCCs (step 2.1.3). Keep the final concentration of hyaluronidase at 40 IU/mL and mix thoroughly.\n\t\nIncubate the OCCCs on a 37 °C thermal platform for 2 min. Observe the changes under a microscope every 30 s until only 1-2 layers of granulosa cells remained.\nDenudation of granulosa cells\n\t\nRapidly transfer the digested OCCCs in the culture dish for oocyte handling and cover with mineral oil in each well.\nObserve the separated granulosa cells under a microscope. Gently aspirate and release the oocytes 5 times to remove residual granulosa cells around the oocytes.\nRepeat the previous step in the remaining 3 wells to completely remove the granulosa cells.\n\t\tNOTE: The above steps (2.1-2.3) can be performed according to the routine operation of each laboratory.\nEvaluation of the oocyte\n\t\nEvaluate the completeness of granulosa cell removal using a microscope. If the cells could not be completely removed, then the retention of 5 or fewer granulosa cells is acceptable at this time.\n\t\tNOTE: If cumulus cells are still attached to the oocyte, the remnant can be removed later on day 3 before the embryo is transferred from cleavage-stage culture medium to blastocyst-stage culture medium.\nAfter performing intracytoplasmic sperm injection (ICSI)26, transfer the oocytes into 20-30 µL cleavage embryo culture medium microdroplets (one oocyte corresponds to one microdroplet) using transfer pipettes and incubate in a 37 °C, 5% CO2 and 5% O2 incubator.\n\t\nRecord the day of ICSI as day 0. Check the embryos and score according to the Istanbul consensus workshop on embryo assessment of day 1 for fertilization (approximately 18 h), day 2 (approximately 45 h) and day 3 (approximately 68 h) for embryo cleavage27.\nEmbryo washing",
    "Prepare 20-30 µL of blastocyst culture medium microdroplets for each embryo covered with mineral oil in tissue culture dishes at day 2 in a 37 °C, 5% CO2 and 5% O2 incubator.\nPrepare another three microdroplets covered with mineral oil, and label the new tissue culture dishes for washing No. 1-3.\nTransfer the day 3 embryos into the washing microdroplets. Gently aspirate and release the embryos 3 times in each droplet using denudation pipettes.\n\t\tNOTE: This procedure can also help remove the residual granular cells attached to the embryo.\nObserve and evaluate the embryos under a microscope on day 3 before the medium was changed from cleavage-stage culture medium to blastocyst culture medium for morphological scoring. If cumulus cells were still attached to the embryo, appropriately pipette up and down in another prewarmed and equilibrated blastocyst culture medium droplet covered with mineral oil with a stripper pipette until the cumulus cells were completely removed.\n\t\tNOTE: All attached cumulus cells had to be removed completely on day 3 before the embryo was transferred from the cleavage-stage culture medium plate to the blastocyst-stage culture medium plate. Any remaining cumulus cells will interfere in the final analysis and give false negative results.\nTwo options for culture medium collection\n\tNOTE: The IVF center can choose from one of two methods for culture medium collection based on the center's resources, demands, and preferences.\n\t\nOption 1: Embryo wash and culture\n\t\tNOTE: This option is for IVF labs that perform vitrification on the morning of day 5.\n\t\t\nTransfer the embryo into prewarmed (37 °C) microdroplets of culture medium, and gently wash each embryo serially in 3 microdroplets by pipetting at day 4 afternoon.",
    "Transfer each embryo into a unique prewarmed (37 °C) single microdroplet of culture medium for sample collection. The volume of a single droplet of culture medium cannot exceed 25 µL.\nPerform blastocyst embryo culture on day 5/day 6 at 37 °C, 5% CO2, and 5% O2.\nOption 2: Embryo wash and culture\n\t\t​NOTE: This option is for IVF labs that perform vitrification on day 5 afternoon or day 6.\n\t\t\nTransfer the embryo into prewarmed (37 °C) microdroplets of 10-15 µL culture medium, and gently wash each embryo serially in 3 microdroplets by pipetting on day 5.\nTransfer each embryo into a unique prewarmed (37 °C) single microdroplet of culture medium for sample collection. The volume of a single droplet of culture medium cannot exceed 15 µL.\nPerform blastocyst embryo culture on day 5/day 6 at 37 °C and 5% CO2.\nSample Collection\n\t\nGently adjust the ICM at a considerable distance from the targeted point of the laser beam, which focuses on the cell junction of the trophectoderm to generate a small hole in the trophectoderm to release the fluid from the blastocoel cavity. Then embryos are moved to freezing solution for cryopreservation  according to the conventional process.\nTransfer culture medium from each cultured embryo into an RNase/DNase-free PCR tube containing 5 µL of cell lysis buffer.\nCollect the same amount of culture medium without being used for embryo culture as a negative control. Freeze all collected samples immediately in liquid nitrogen and then store at −80 °C after being collected until subjected to the NICS assay.\nPerform vitrification as described in the protocol.\n3. Protocol 2: Library Construction\nCulture medium lysis",
    "Dilute 1 µL of positive control (10 ng human gDNA) with 199 µL of fresh culture medium. Mix thoroughly and centrifuge the tube briefly (200 x g for 5 s).\nTransfer 10 µL of day 5-day 6 blastocyst culture medium, diluted positive control, and fresh culture medium to new 0.2 mL PCR tubes.\nAdd 1 µL of MT Enzyme Mix to each PCR tube and mix thoroughly by pipetting and centrifuge immediately for 2-3 s at 200 x g.\nPut the PCR tube(s) from step 3.1.3 in a preheated NICS Sample Prep Station and run the lysis program as follows: 10 min at 75 °C; 4 min at 95 °C; hold at 22 °C.\n\t\tNOTE: The sample prep station is comparable to a standard PCR machine.\n\t\t\nClick the Lysis icon to enter the setup screen.\nSelect Tube for Control mode; input 10 µL for Sample volume; select On for Hotlid control and enter 105 °C for the temperature. Select No for Pause at the first seg. Click OK to proceed.\nWait until Remain time shows --:--:--, which indicates the end of the program, and then click Stop to terminate the program.\nStop the program after the process is complete. Proceed to the next step immediately.\nPre-Library Preparation\n\t\nThaw the Pre-Lib Buffer to RT. Mix thoroughly by pipetting and centrifuge immediately for 2-3 s at 200 x g.\nPrepare a master mix for prelibrary reaction as follows: add 2 µL of Pre-Lib Enzyme Mix to 60 µL of Pre-Lib Buffer, mix the reaction thoroughly and centrifuge briefly.\nAdd 60 µL of prelibrary reaction mix into each pretreated medium sample from the previous step. Mix thoroughly by pipetting and centrifuge immediately for 2-3 s at 200 x g.",
    "Place the PCR tube(s) from step 3.2.3 in the Sample Prep Station and run the prelibrary program as follows: 95 °C for 2 min; 12 cycles of 15 °C for 40 s, 22 °C for 40 s, 33 °C for 30 s, 65 °C for 30 s, 72 °C for 40 s, 95 °C for 10 s and 63 °C for 10 s; and hold at 4 °C.\n\t\t\nClick the Pre_Lib icon to enter the setup screen.\nSelect Tube for Control mode; input 70 µL for Sample volume; select On for Hot lid control and enter 105 °C for the temperature. Select No for Pause at the first seg. Click OK to proceed.\nWait until Remain time shows --:--:--, which indicates the end of the program, and click Stop to terminate the program.\nStop the program when the process is complete. Proceed to the next step immediately.\nLibrary Preparation\n\t\nThaw the Library Buffer to RT. Mix thoroughly by pipetting and centrifuge immediately for 2-3 s at 200 x g.\nPrepare a master mix for library reaction as follows: add 1.6 µL of Library Enzyme Mix to 60 µL of Library Buffer, mix the reaction thoroughly and centrifuge briefly.\nAdd 60 µL of library reaction mix and 2 µL of Barcode Primer to each prelibrary product from step 3.2.3. Mix the reaction thoroughly and centrifuge briefly.\nPlace the PCR tube(s) from step 3.2.3 in the thermal cycler and run library preparation program as follows: 94 °C for 30 s; 17 cycles of 94 °C for 25 s, 62 °C for 30 s, and 72 °C for 45 s); and then hold at 4 °C.\n\t\t\nClick the Lib_Prep icon to enter the setup screen.",
    "Select Tube for Control mode; input 130 µL for Sample volume; select On for Hotlid control and enter 105 °C for the corresponding temperature. Select No for Pause at the first seg. Click OK to proceed.\nWait until Remain time shows --:--:--, which indicates the end of the program, and click Stop to terminate the program.\nLibrary Purification\n\t\nRemove Magbeads from storage at 2-8 °C for at least 20 min before the purification step. Vortex and mix the Magbeads for 20 s. Dispense enough beads for the purification step into a new 1.5 mL microcentrifuge tube and warm beads to RT.\nAdd 1x Magbeads into each library. Mix by pipetting up and down ≥10 times and incubate at RT for 5 min.\n\t\tNOTE: For example, add 100 µL of Magbeads to 100 µL of library sample.\nAfter incubation, centrifuge the tube briefly and place on a magnetic stand.\nWait for approximately 5 min until the solution becomes clear. While keeping the tube on the magnetic stand, carefully aspirate the solution and discard.\nAdd 200 µL of freshly prepared 80% ethanol to the tube. Incubate at RT for 30 s and carefully remove the supernatant. Repeat one more time.\nRemove the ethanol as completely as possible. Air dry the beads on the magnetic stand for approximately 5-10 min at RT.\nRemove the tube from the magnetic stand, add 17.5 µL of elution buffer, and vortex the tube to resuspend the beads. Centrifuge the tube briefly and incubate at RT for 5 min.\nPlace the tube onto the magnetic stand and wait until the solution becomes clear. Carefully transfer 15 µL supernatant to a new tube.\nLibrary quantification",
    "Quantify purified libraries by using the fluorometer according to the user guide of the qubit dsDNA HS Assay kits28. The yield of the libraries ranges from ~15 to 300 ng.\nLibrary Pooling\n\t\nUse 10 nanograms of each library sample for pooling.\nSequencing\n\t\nRefer to the sequencing user guide (15027617 v01)29.\nPurified library sequences of 50 bp at a single end on the platform yielded approximately 2 million reads for each sample, and a 0.03 × sequencing depth was recommended.\nData analysis\n\t\nEnter the users' Name and Password in the login page\nAfter logging into the system, click Analysis and a new page will appear. Click Create Submission under the NICS-A tab. Then, choose NGS for the platform, select corporation, choose NICSInst for the reagent, enter the project information in the box under Project ID, set the analysis preferences and upload the files. Once all sequencing files are successfully uploaded, click Submit to start the analysis (Figure 3A).\nClick View Submissions to show the list of submitted projects. Once the analysis is complete, the status of a project will become Completed and a Show button will appear in the report field. Click the Show button to view the summary table of NICS analysis (Figure 3B).\nClick the Export report button to save the reports (Figure 3C).\n\t\tNOTE: Three types of files will be exported for each analysis. A graphic file that includes all copy number variation (CNV) plots for each chromosome and whole genome, which will be stored under the \"graph\" folder; a spreadsheet that contains the sample QC details of this analysis run; a document file that contains the NICS reports customized by the user; and a spreadsheet that contains the sample summary information of this analysis run.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}