{
  "id": 5789,
  "origin_website": "Bio",
  "title": "Acetyl-coenzyme A Synthetase (Acs) Assay",
  "procedures": [
    "Protein extraction procedureHarvest the cells at the phase of culture of interest, e.g. for E. coli, 50 ml of a culture in exponential growth phase (OD600=0.8) or 20 ml of a culture in stationary phase (OD600=2.0). Cool the cells in a water-ice bath for 1-2 min.Centrifuge the cells for 15 min (10,000 x g, 4 °C).Discard the supernatant.Resuspend the cells in ice-cold phosphate buffer (in order to ensure proper washing of cells, use the same initial volume of sample).Centrifuge the cells for 15 min (10,000 x g, 4 °C). Discard the supernatant.Resuspend the cells in ice-cold phosphate buffer. Use an appropriate volume of buffer, calculated according to the following equation; this will result in a concentrated cell suspension of OD600 of 50:ml (phosphate buffer)=(OD600 x Vol (ml culture volume))/50Where OD600 is considered as readout of the concentration of cells in the sample (Castano-Cerezo et al., 2011).Disrupt the cells using an ultrasonic homogenizer as follows. Transfer the cell suspension to a 1.5 ml conical tube and place it in an ice bucket. Subject the cell suspension to 3 sonication pulses (20 sec each, 21% amplitude, 3-mm diameter probe, 50% power input). Respect 60 sec intervals between sonication cycles in order to avoid over-heating of samples.Centrifuge the disrupted cells for 30 min (20,000 x g, 4 °C). Collect the supernatant (cell-free extract) and transfer it to a clean 1.5 ml conical tube. Inspect the cell-free extract for suspended particles. If necessary, centrifuge again.Use the cell- free extract immediately for acetyl-CoA synthetase assay or store the supernatant at -70 °C for long term use.",
    "Acetyl-coenzyme A synthethase assayFor proper determination of enzyme activity, the optimal dilution of the protein extract has to be determined for each sample, since the activity of extracted enzyme is influenced by the physiological state and the extraction yield of the cells.Thaw the protein extracts and reagent stocks on ice. Dilute the Mdh and Cs enzyme stocks as explained in the Materials and Methods section and keep them on ice.Connect the plate reader and allow it to reach 37 °C.Prepare a \"Master Mix\" according to the number of samples to be analyzed. The \"Master Mix\" should contain all the reaction components except for sodium acetate (the substrate of Acs) and the protein extract. Remember to consider sample triplicates. Keep the \"Master Mix\" on ice. \"Master Mix\" per reaction:100 mM Tris-HCl buffer (pH 7.8): 70 μl50 mM L-malate : 10 μl20 mM ATP : 10 μl50 mM MgCl2 : 10 μl2 mM CoASH : 10 μl60 mM NAD+ : 10 μl50 U/ml Mdh : 10 μl25 U/ml Cs : 10 μlPrepare several dilutions of the protein extract in phosphate buffer. Choose dilutions in a wide enough range (e.g.: 1:1, 1:10, 1:100 and 1:1,000).In a 96 well flat bottom, transparent plate, add 140 μl of the Master Mix to each well.Add 40 μl of each of the protein dilutions. Pipet up and down in order to mix the reaction components properly. Tip: Avoid the formation of air bubbles.Start the reaction by adding 20 ul of 1 M sodium acetate into the sample and mix well by pipetting up and down.Incubate at 37 °C in the plate reader and record the continuous increase in absorbance at 340 nm (due to the reduction of NAD+) for 5-10 min. Recording should start immediately after starting the reaction.",
    "Adjust the reader to get an absorbance value each 10-20 sec. Calculate the maximum slope in the OD over time plot (ΔOD/min) for each dilution of the protein extract. For subsequent measurements, select the 2-3 dilutions of the extract to yield a ΔOD/min=10-200. If necessary, assay other dilutions (the typical optimal dilution for Acs activity in cell extracts of glucose-limited stationary phase cultures of E. coli extracts with a protein concentration of approx. 15 mg/ml is 1:20).Repeat steps 4-10 with the dilutions selected. Perform the assay, at least, in triplicate. To ensure proper determination of enzyme activity in the extract, ΔOD/min should be proportional to protein content.Calculate the Enzyme Activity Units for the protein extract assayed using the following equation:Acs Activity (U/ml) = (ΔOD (/min)*Vr*Df) / (ε *l*Ve)Where:ΔOD (/min) = maximum slope in the OD vs. t plot (/min)Vr = reaction volume (μl)Df = dilution factorε NADH 340 nm = 6.22 ml*/μmol*/cml = optical path length (cm)aVe = protein extract volume (μl)baTo determine the optical path length, refer to the specifications of your 96 well plates to get the diameter of the well. Calculate the optical path length from the total liquid volume used in the assay and the diameter of the well.bThis volume refers to the volume of diluted extract added to the assay. Determine the protein concentration of the extracts assayed [e.g. using the Lowry (Hartree, 1972) or the Bicinchoninic Acid method (Smith et al., 1985)].Determine the specific Acs activity for each extract using the following equation:Acs Specific Activity (U/mg) = Acs Activity (U/ml) / Protein concentration (mg/ml)"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}