{
  "id": 15076,
  "origin_website": "Jove",
  "title": "Oxygen-Independent Assays to Measure Mitochondrial Function in Mammals",
  "procedures": [
    "1. Proliferation assays to measure the activity of complex I, dihydroorotate dehydrogenase (DHODH), and complex V activities\nSeeding cells for proliferation assays\n\tNOTE: This protocol uses the human osteosarcoma cell line 143B purchased commercially from ATCC. This cell line was used under the guidelines of our approved Institutional Biosafety Committee (IBC) protocol.\n\t\nRemove the plates from the tissue culture incubator. Aspirate the medium from the plates, and wash with 1x phosphate-buffered saline (PBS) to remove any leftover medium. Aspirate the PBS, and cover the dish with 0.05%-0.25% trypsin to lift the cells from the bottom of the plate.\nWait 3-5 min for the trypsin to release the cells from the plate, and then quench the trypsin with 10 mL of the desired growth medium containing 10% fetal bovine serum (FBS).\nCollect the cells in a conical tube, and centrifuge at 1,000 × g for 5 min to pellet the cells.\nAspirate the medium from the tube without disturbing the pellet. Resuspend the pellet with complete medium.\nCount the cells, and quantify the volume needed to seed between 10,000 and 25,000 cells in a 6-well plate.\n\t\tNOTE: Each cell line will need to be optimized for the number of cells to be seeded. The ideal confluence achieved is ~10% at the beginning of the experiment and ~80% at the end of the experiment.\nPipette the cells into a 6-well plate, and add 2 mL of complete medium to the wells. Let sit for 24 h before changing to the experimental medium conditions.\n\t\tNOTE: Seed at least three replicates per condition and enough wells to test the untreated control condition, inhibitor-treated control condition, untreated experimental condition, and inhibitor-treated experimental condition.\nMedium change to assess complex V activity by proliferation",
    "​NOTE: Cells proliferating in a medium with galactose are dependent on complex V activity for ATP synthesis9,10. Unlike glucose, which yields net two ATP from glycolysis, galactose yields none, forcing the cells to be dependent on complex V for ATP synthesis (Figure 1). The complex V inhibitor oligomycin is used as a control.\n\t\nMake 10 mM glucose-containing medium (see Table 1).\nMake 10 mM galactose-containing medium (see Table 1).\nChange the medium in each well to either glucose-containing DMEM or galactose-containing DMEM. Add 5 µM oligomycin (the complex V inhibitor) to the relevant wells and the same volume of DMSO to the untreated wells. The oligomycin stock is 10 mM resuspended in DMSO. Put the plate back into the tissue culture incubator for 2 days.\nMedium change to assess complex I activity by proliferation\n\tNOTE: Cells proliferating in a pyruvate-free medium are more reliant on complex I activity11,12. Without pyruvate, the cultured cells require complex I to facilitate the majority of NADH reoxidation back to NAD+ (Figure 2). The complex I inhibitor rotenone is used as a control.\n\t\nMake pyruvate-free DMEM medium supplemented with 10% FBS and 1% penicillin-streptomycin.\nMake a 1 M solution of pyruvate (see Table 1).\nChange the medium in each well to either pyruvate-free medium or pyruvate-containing medium. Add 2 µM rotenone (the complex I inhibitor) to the treated wells and the same volume of DMSO to the untreated wells. The rotenone stock is 25 mM resuspended in DMSO. Put the plate back into the tissue culture incubator for 2 days.\nMedium change to assess DHODH activity by proliferation\n\tNOTE: Cells proliferating in a uridine-free media require dihydroorotate dehydrogenase (DHODH) activity11,12,13. In the absence of exogenous uridine, the cultured cells synthesize pyrimidines through the de novo pathway. The DHODH inhibitor brequinar is used as a control.",
    "Make uridine-free DMEM supplemented with 10% FBS and 1% penicillin-streptomycin.\nMake a 10 mg/mL uridine stock solution, and then prepare a 100 µg/mL uridine medium (see Table 1).\nChange the medium in each well to uridine-free medium or uridine-containing medium. Add 5 µM brequinar (the DHODH inhibitor) to the treated wells and the same volume of DMSO to the untreated wells. The brequinar stock is 10 mM resuspended in DMSO. Put the plate back into the tissue culture incubator for 2 days.\nCounting the cells for proliferation assays\n\t\nFor all the experiments, replenish the medium every 2 days. If the medium becomes yellow in color, increase the frequency of the medium changes. Allow the cells to proliferate for up to 7 days, and stop the experiment if any of the wells begin to look overgrown. Wells are considered overgrown when the confluence exceeds 80%.\nAspirate the medium, wash with 1x PBS, and cover the bottom of the well with 0.25% trypsin (500 µL for a 6-well dish).\nWait 5 min until the cells have lifted off the dish. Check this under a microscope.\nQuench the trypsin with 1 mL of complete DMEM containing 10% FBS.\nPipette up and down to break apart the cell clumps.\nPrepare Coulter counter cups by filling each with 10 mL of isotone buffer (one cup per well). Count the cells on a cell counter, and record the data. If the readout is cells per milliliter (cells/mL), multiply the recorded value by 1.5 to get the total number of cells per well.\n\t\tNOTE: Other cell counting methods such as a hemocytometer will suffice if the lab does not have a Coulter counter.\n2. 13C4-Aspartate stable isotope tracing and LC-MS analysis to measure DHODH activity\n13C4-aspartate stable isotope tracing in adherent cells",
    "NOTE: DHODH activity can be directly monitored by measuring the incorporation of 13C4-aspartate into 13C3-UMP. Brequinar is used as a control for DHODH activity (Figure 3). The resulting levels of 13C3-UMP are a measure of DHODH activity.\n\t\nSeed between 250,000 and 500,000 cells in a 6-well dish to achieve 75% confluence the next day.\nPrepare a stock solution of 250 mM 13C4-aspartate and 10 mM 13C4-aspartate medium (see Table 1).\nChange the medium in each well to medium containing 10 mM 13C4-aspartate. Incubate for the appropriate number of hours to achieve a steady state for labeling the cells of interest.\n\t\tNOTE: The steady state is defined as the time frame in which the percent labeled metabolite plateaus over time14. For 143B osteosarcoma cells, 13C4-aspartate achieves a steady state by 8 h. It is best practice to determine this time frame prior to the experimentation by doing a time course experiment with the stable isotope of interest.\nMetabolite isolation from the adherent cells\n\t\nPrior to beginning, prepare a bucket of dry ice, and prepare 80% HPLC-grade MeOH in HPLC-grade water. Cool this buffer in a −80 °C freezer overnight or place it directly on dry ice.\nTaking one plate out at a time from the incubator, aspirate the medium from the wells, and wash 2x with 1x PBS. Remove all the residual PBS from the wells before moving on to the next step.\n\t\tNOTE: Make sure to tilt the plate during the aspiration and pipette against the wall of the dish to prevent the disruption of the adherent cells.\nPlace the plate on dry ice, and immediately add 800 µL of 80% LCMS-grade MeOH in 20% LCMS-grade water to each well.\nIncubate the plate for at least 15 min in a −80 °C freezer to facilitate cell lysis.",
    "NOTE: At this point, the next plate can be taken out of the incubator and steps 2.2.1-2.2.4 repeated. Continue this until all the plates are incubating in the −80 °C freezer.\nTaking one plate out at time from the freezer, scrape each well on dry ice using a cell lifter, and transfer the lysate to a 1.5 mL microcentrifuge tube. Keep the tube on dry ice until the next step.\nVortex all the tubes for 10 min at 4 °C, and then centrifuge at 4 °C for 10 min at maximum speed (at least 17,000 × g).\nTransfer the supernatant to a 1.5 mL microcentrifuge tube, and dry down in a 4 °C vacuum concentrator equipped with a −105 °C cold trap on a high vacuum setting for approximately 6 h or until the samples have evaporated. Once the lysate is dried down, store the metabolite pellets at −80 °C until ready to prepare them for liquid chromatography paired with mass spectrometry (LCMS).\nLiquid chromatography-mass spectrometry (LC-MS) measurement of polar metabolites\n\tNOTE: Any chromatographic and mass spectrometry workflow that allows for the detection of aspartate, the intermediates in de novo pyrimidine biosynthesis, and UMP will suffice14.\n\t\nPrepare the samples for LCMS on ice by adding 100 µL of HPLC grade water to the dried pellets and vortex for 10 min at 4 °C.\nCentrifuge the samples at 4 °C for 10 min at maximum speed (at least 17,000 × g) and move 25 µL into each LC-MS vial.\nInject 2 µL of lysate into the LC-MS system. A commonly used methodology is given below:\n\t\t\nPrepare mobile phase A comprising 20 mM ammonium carbonate (LC-MS grade) and 0.1% ammonium hydroxide (LC-MS Grade) dissolved in LC-MS grade water.\nChoose 100% acetonitrile (LC-MS Grade) as mobile phase B.",
    "For the chromatography, choose a 5 µm, 150 mm x 2.1 mm analytical column equipped with a 2.1 mm x 20 mm guard column for hydrophilic compounds (see the Table of Materials). Set the column oven to 25 °C.\nUse the following liquid chromatography settings: a constant flow rate of 0.15 mL/min; a linear gradient from 80% to 20% Mobile Phase B for 20 min, followed by a linear gradient from 20% to 80% Mobile Phase B for 0.5 min, followed by a hold at 80% Mobile Phase B for 7.5 min.\nChoose the following mass spectrometer settings: a full scan between m/z 70 Da and 1,000 Da; a resolution of 70,000; an AGC target of 1 × 106; and a maximum injection time of 20 ms. Operate the source in polarity switching mode. Set the spray voltage at 3.0 kV, the heated capillary at 275 °C, the HESI probe at 350 °C, the sheath gas flow at 40 units, the auxiliary gas flow at 15 units, and the sweep gas flow at 1 unit.\nPerform the data analysis using any software that interfaces with the LCMS workflow.\n\t\tNOTE: The software used with the above workflow are XCalibur (Thermo) and TraceFinder (Thermo). Key considerations for data analysis are outlined below:\n\t\t\nExpected retention times: Determine the retention time of each metabolite by running the standards for each metabolite of interest using the chromatographic method prior to the experiment.\n\t\t\tNOTE: The retention times of UMP and its isotopologues, including 13C3-UMP, are the exact same.",
    "Expected M/Z for metabolites: If a metabolite ionizes in the negative ion mode (such as UMP), calculate the expected exact mass using the molecular formula of UMP minus a proton [C9H14N2O9P]. For metabolites that ionize in positive ion mode, calculate the exact mass by using the molecular formula plus a proton.\nMass accuracy: When using an orbitrap mass spectrometer, the metabolite of interest and its isotopologues are expected to have a mass accuracy ±5 mmu. Use software to calculate this, accounting for the expected M/Z and the actual detected M/Z.\nNatural abundance correction: All tracing data are expected to undergo natural abundance correction to account for the ~1% 13C and ~0.5% 15N-isotopes in nature15.\n3. 13C5-glutamine stable isotope tracing to measure SDH activity\n13C5-glutamine stable isotope tracing in adherent cells\n\tNOTE: SDH activity can be directly monitored by measuring the interconversion of certain isotopologues of fumarate and succinate upon 13C5-glutamine tracing7,16,17. The complex III inhibitor antimycin is used as a control to alter the net directionality of the SDH complex (Figure 4).\n\t\nSeed between 250,000 and 500,000 cells in a 6-well dish to achieve 75% confluence the next day.\nPrepare a stock of 50 mM 13C5-glutamine (see Table 1).\nPrepare tracing medium containing 2 mM 13C5-glutamine (see Table 1).\nChange the medium in each well to medium containing 2 mM 13C5-glutamine. Incubate for the appropriate number of hours to achieve a steady state of labeling the cells of interest (see the note in step 2.1.3).\nIsolate the metabolites following the protocol in step 2.2.\nAnalyze the samples on LC-MS following the workflow described in step 2.3.\nAnalyzing the SDH activity based on labeling patterns",
    "​NOTE: The succinate oxidation activity of the SDH complex can be monitored by assessing the ratio of 13C4-fumarate to 13C4-succinate upon 13C5-glutamine tracing. The fumarate reduction activity of the SDH complex can be monitored by assessing the ratio of 13C3-succinate to 13C3-fumarate upon 13C5-glutamine tracing.\n\t\nCalculate the percent labeling of 13C3-fumarate, 13C4-fumarate, 13C3-succinate, and 13C4-succinate. For example, to determine the percentage of 13C3-fumarate, sum up all the integrated peak areas for the fumarate isotopologues (unlabeled fumarate, 13C1-fumarate, 13C2-fumarate, 13C3-fumarate, and 13C4-fumarate), and divide the peak area for 13C3-fumarate by the total isotopologue area. Multiply by 100.\nTo calculate the succinate oxidation, divide the percentage 13C4-fumarate by the percentage 13C4-succinate.\nTo calculate the fumarate reduction, divide the percentage 13C3-succinate by the percentage 13C3-fumarate.\n4. Direct complex I activity assay\nNOTE: DCPIP is an artificial electron acceptor; it changes to its reduced form when accepting electrons from ubiquinol. In this assay, ubiquinone is reduced to ubiquinol via the complex I-mediated oxidation of NADH to NAD+. Thus, measuring the turnover of oxidized DCPIP in this cell-free assay is a proxy for complex I activity7,18.\nPurifying and quantifying the mitochondria from cells\n\tNOTE: Any mitochondrial purification protocol can be utilized for this assay19.\n\t\nExpand the cells until 25-100 million cells are obtained. Aspirate the medium off the dishes, wash with 1x PBS, aspirate the PBS, and tryspinize the cells with 0.25% trypsin. Quench the trypsin with culture medium, and pellet the cells at 1,000 × g for 5 min.\nWash the cell pellets 2x in 5 mL of 1x PBS, and repeat the centrifugation at 1,000 × g for 5 min to pellet the cells. Store the washed pellets in a −20 °C freezer until mitochondrial purification.\n\t\tNOTE: Do not freeze-thaw the cell pellets more than once.\nPrepare mitochondria isolation buffer (see Table 1).",
    "NOTE: Sodium-containing reagents such as NaOH should not be used to prepare mitochondria isolation buffers, as sodium tarnishes the mitochondrial membrane potential20 and disrupts mitochondrial calcium homeostasis21.\nResuspend the cell pellets to 10 million cells per 1 mL of mitochondria isolation buffer. For example, resuspend 100 million pelleted cells in 10 mL of mitochondria isolation buffer.\n\t\tNOTE: Make sure to disrupt the cell clumps without introducing bubbles into the buffer.\nMove 2 mL of cell suspension into a precooled glass homogenizer with a working volume of 3-8 mL that is compatible with a Potter-Elvehjem PTFE pestle. Homogenize the cells with 10-20 strokes, monitoring the cells under a microscope to confirm cell lysis throughout the homogenization process. Increase the number of strokes if needed to ensure efficient cell lysis.\n\t\tNOTE: If homogenizing the cells with the above method is not effective for lysing the cells, switch to a syringe lysis method22.\nTransfer 2 mL of the cell lysate into a microcentrifuge tube on ice, and repeat the above steps until the entire cell suspension is homogenized.\nPellet the nuclei and cell debris at 650 × g for 10 min in a 4 °C centrifuge.\nMove the supernatant to a new 2.0 mL tube, and repeat the above centrifugation at 650 × g for 10 min at 4 °C.\nMove the supernatant to a new 2.0 mL tube, and pellet the crude mitochondria at 7,000 × g for 10 min in a 4 °C centrifuge.\nDiscard the supernatant, and resuspend the pellet in 1 mL of mitochondria isolation buffer. Move 50 µL into a new tube for protein quantification. Repeat the above centrifugation step on the two aliquots of the sample (the 50 µL sample and the remaining ~950 µL).",
    "Discard the supernatant, and store the pellets in a −80 °C freezer until ready to use.\nAdd 200 µL of RIPA buffer to the pellets from the 50 µL aliquot to extract the protein, vortex for 10 min, and centrifuge at 21,000 × g to isolate the protein. Quantify the amount of protein in the 50 µL aliquot, and use this number to quantify the remaining protein in the 950 µL sample. For example, if the protein quantification for the 50 µL aliquot is 1 µg/µL, the total protein in the remaining mitochondrial pellet is 950 µg (1 µg/µL × 950 µL).\nPerforming the complex I activity assay\n\tNOTE: The 143B osteosarcoma cell line was utilized for this assay, but the protocol can be adapted for any cultured cells.\n\t\nResuspend purified mitochondria in the mitochondria resuspension buffer (see Table 1) to a final concentration of 5 mg protein/mL.\nPerform five freeze/thaw cycles in a −20 °C freezer to permeabilize the mitochondria.\nMake the complex I activity assay buffer (see Table 1).\nMix 50 ug of the 5 mg/mL mitochondria stock with 90 µL of complex I activity buffer. Prepare five untreated replicates and five rotenone-treated (5 µM) replicates to control for complex I activity.\nRead the baseline absorbance at 600 nm in a plate reader set to 37 °C.\nInitiate the reaction by adding NADH to a final concentration of 2 mM, and track the absorbance (600 nm) over the span of 1 h, measuring at least every 2 min throughout. The decrease in absorbance is indicative of a reduction of DCPIP via complex I activity.\n\t\t​NOTE: The NADH should be added using a multichannel pipette to ensure that all the samples are initiated at the same time.\n5. LC-MS-based assay to measure the superoxide levels",
    "NOTE: The fluorescence properties of MitoSox Red can change independently of its reaction with superoxide23. This LC-MS-based assay directly measures the product from superoxide reacting with MitoSox Red. The following assay is slightly modified from Xiao et al.24. 2-Hydroxy-mitoethidium (2-OH MitoE2+) is the product of the superoxide reaction (Figure 5). The Caki1 cell line was utilized for this assay, but the protocol can be adapted for any cultured cells.\nTreating adherent cells with MitoSox Red\n\t\nSeed between 250,000 and 500,000 cells in a 6-well dish to achieve 75% confluence the next day. Be sure to seed a set of plates for the LC-MS assay and a duplicate set of plates for cell count normalization.\nPrepare complete DMEM containing 10% heat-inactivated FBS and 1% penicillin-streptomycin in Dulbecco's modified Eagle medium.\nRefresh the medium in all the wells for all the conditions with 2 mL of complete DMEM. Make sure to add in any drugs or treatments of interest at this point.\nIncubate the cells in a tissue culture incubator for 1 h.\nPrepare positive and negative controls. Prepare a 50 mM stock of tert-butyl hydroperoxide diluted in PBS and a 250 mM stock of N-acetyl cysteine (NAC) diluted in DMSO (see Table 1).\n\t\tNOTE: Tertbutyl hydroperoxide (tBuOOH) is a potent reactive oxygen species that will act as a positive control and increases the amount of the 2-OH MitoE2+. NAC is a potent antioxidant that will act as a negative control and neutralize the superoxide production caused by tBuOOH.\nAdd 1 µL of tBuOOH to the positive control wells and 1 µL of tBuOOH + 100 µL of NAC to the negative control wells.\n\t\tNOTE: Using a P2 pipette (0.1-2 µL range) is the optimal way to transfer 1 µL.\nIncubate for 1 h in a tissue culture incubator.",
    "Prepare 1 mM MitoSox Red stock (see Table 1), and add 2 µL of 1 mM MitoSox Red to each well to achieve a final concentration of 1 µM. Incubate for 30 min in a tissue culture incubator.\nDuring this final incubation, count one of the duplicate plates to acquire the cell counts to normalize the final LC-MS data.\nIsolation of the oxidized Mitosox Red product from the adherent cells\n\t\nGet a bucket of dry ice, and place cool HPLC-grade isopropanol on the dry ice prior to beginning the isolation.\nTaking one plate out at a time, aspirate the medium from the wells, and wash 2x with 1 mL of 1x PBS. Aspirate all the residual PBS from the wells before moving on to the next step.\n\t\tNOTE: Make sure to tilt the plate during the aspiration and pipette against the wall of the dish to prevent disruption of the adherent cells.\nPlace the plate on dry ice, and add 800 µL of HPLC-grade isopropanol to each well.\nIncubate the plate for at least 15 min in a −80 °C freezer to facilitate cell lysis.\n\t\t​NOTE: At this point, the next plate can be taken out of the incubator and steps 5.2.1-5.2.4 repeated. Continue this until all the plates are incubating in the −80 °C freezer.\nTaking one plate out at a time from the freezer, scrape each well on dry ice using a cell lifter, and transfer the lysate to a 1.5 mL microcentrifuge tube. Keep the tube on dry ice until the next step.\nVortex all the tubes for 10 min at 4 °C, and then centrifuge at 4 °C for 10 min at maximum speed (at least 17,000 × g).",
    "Transfer the supernatant to a 1.5 mL microcentrifuge tube, and dry down in a vacuum concentrator. Once the lysate is dried down, store the metabolite pellets at −80 °C until ready for LC-MS.\nLC-MS measurement of MitoSox Red and 2-hydroxy-mitoethidium (2-OH MitoE2+)\n\t\nPrepare the samples for LCMS on ice by adding 100 µL of a 3:3:1 mixture of HPLC-grade MeOH:chloroform:water. Vortex for 10 min at 4 °C.\nMove 25 µL into each LC-MS vial. Store the remaining sample in the −80 °C freezer.\nPrepare the following liquid chromatography buffers: i) buffer A: HPLC grade water with 0.1% formic acid; ii) buffer B: HPLC grade acetonitrile with 0.1% formic acid.\nOpen the Thermo XCalibur Instrument Setup app to begin developing the method.\nLook for two boxes on the left sidebar of this window-the first box allows chromatography method development, and the second box allows mass spectrometry method development.\nLiquid chromatography method development:\n\t\t\nSet a flow rate of 0.25 mL/min, and start the method at 20% B, rising to 95% B over the span of 12 min. Over the next minute, drop buffer B back down to 20% B, and maintain that level for the next 2 min.\n\t\t\tNOTE: The last 2 min of flow at 20% B is critical for the column pressure to drop back down to the initial pressure and to equilibrate the column with the appropriate buffer ratios. Not including this equilibration step will cause the retention times to shift for all the subsequently run samples.\nCreate a Tune File with the following parameters:\n\t\t\nOpen the Tune App, and create a new tune file.\nApply any overlapped settings from the Method Setup module (see step 5.3.9.3) to this tune file as well, including the scan range, resolution, polarity, AGC target, and maximum IT.",
    "Set the Sheath gas to 30, the Aux gas to 3, and the Sweep gas to 3 as well. Set the Spray voltage to 3 kV, the Capillary temp to 300, and the S-lens RF level to 60.\nMass spectrometry method development:\n\t\t\nFrom the bottom left list of potential scans, drag and drop Full MS to the center of the window. Make sure to click on the Full MS square after the drop to adjust the settings. The total MS method duration is 13 min.\n\t\t\tNOTE: The LC method is longer than the MS method because the final 2 min are for column reconditioning and not metabolite quantification.\nOn the right side of the module, under Properties of the method, make sure the Method duration and Run time are set to 13.00 min.\nRun this full scan in positive mode at a Resolution of 70,000 and an AGC target of 1 × 106. Set the Maximum IT to 100 ms and the Scan range from 300 m/z to 700 m/z.\nUnder Tune Files toward the top of the module, observe that the tune file that was just created is linked to this method.\nRun the method for MitoSox Red detection with 2 µL sample injections."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}