{
  "id": 6089,
  "origin_website": "Bio",
  "title": "Nab Escaping AAV Mutants Isolated from Mouse Muscles",
  "procedures": [
    "The generation of a new AAV shuffling libraryNote: There are multiple methods that can be used to generate DNA shuffling library, and a handful of kits available from manufacturers. DNA shuffling library can be generated using JBS DNA shuffling kit. The process of generation of AAV shuffling library is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180503/20180503032452_1873.jpgFigure 1. Flow chart for generation of AAV shuffling libraryAmplify the capsid genes by PCR assay using AAV serotypes 1, 2, 3, 6, 8 and 9 mixed in equal ratios as templates. The primers sequences were shown in Table 2 of Li et al. (2008).Treat a total of 4 μg of the DNA templates by 0.4 U of DNase I at 37 °C for 5 min. Stop DNase activation by adding 1 μl 25 mM EDTA, and then heat inactivation at 75 °C for 10 min. Purify DNA fragments in size of 100-300 bp using DNA purification Kit following standard procedures. Denature, re-anneal and repair the purified DNA fragments by Pfu Ultra High-Fidelity DNA polymerase to reassemble random capsid genes in 0.2 ml PCR tube. Run the PCR assay using the program in Table 1 (Li et al., 2008; Yang et al., 2009).Table 1. PCR cycling parameterimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180503/20180503032839_3220.jpgClone the capsids from DNA shuffling library into wild-type AAV2 plasmid psub201 to generate AAV capsid DNA library (Li et al., 2008; Li et al., 2016).Produce AAV shuffling library in HEK293 cells by co-transfection of two plasmids: pXX6-80 and AAV capsid DNA library.Purify single-stranded AAV with CsCl gradient ultracentrifugation and measure virus titer of shuffled AAV by quantitative PCR (Xiao et al., 1998).Isolation of Nab escaping AAV mutants from mouse musclesMix 1 x 1010 particles of the AAV shuffling library virus in 50 μl PBS with 50 μl undiluted patient serum at 4 °C for 2 h.",
    "Inject the AAV/serum mixture using insulin syringes via intramuscular (i.m.) route into the hind leg muscle of 6-week-old female BALB/c mice (injection volume 100 μl). Three days post-treatment, inject 107 virus particles (vg) of adenovirus (Adv) dl309 via i.m. into the same muscle to amplify AAV genomes in vivo. Note: Any replicable Adv can be used in this step.Collect muscles from injected mice at 2 days post Adv administration, and extract total DNA using DNeasy Blood and Tissue Kit.Note: There are several methods that can be used to isolate DNA from tissues, and a handful of kits available from many manufacturers to do it. Here, we performed a genomic DNA isolation from mouse muscle using DNeasy Blood and Tissue Kit. In this protocol, the isolation of genomic DNA from muscle relies upon the columns and spin steps. Please follow the protocol of the manufacturer.Amplify AAV mutant capsids by PCR assay using the genomic DNA from the muscle as templates. The sequences of the primers are F1 5’-CAACTCCATCACTAGGGGTTC and R1 5’-CATGGGAAAGGTGCCAGA, which are localized at the AAV2 rep and AAV2 ITR, respectively. Run PCR assay using PfuUltra High-Fidelity DNA polymerase, following the program in Table 2.Table 2. PCR cycling parametersimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180503/20180503033219_8013.jpgPurify PCR products by the QIAquick PCR Purification Kit. Digest with SwaI and XbaI and ligate into pXR2 digested with the same endonucleases. Transform the constructed plasmids into a culture of DH10b competent cells.Note: The plasmid pXR2 can be any expression plasmid with Rep gene of AAV for further AAV package. Sequence clones and generate AAV/luc mutant vectors (Xiao et al., 1998).Nab escaping ability of AAV mutants in vitroNote: Cell lines that can be transduced by AAV can be used for neutralizing assay. Add the serum/AAV mixture when the cells are suspended.",
    "Seed Huh7 cells into a 48-well plate at a density of 105 cells for each well.Incubate two-fold dilutions of the serum (from 1:4 to 1:1,024) with AAV-Luc (1 x 108 vg) for 1 h at 37 °C. Add the mixture (diluted serum and AAV) into Huh7 cells and incubate for 48 h at 37 °C. Discard the culture media.Lyse cells with 100 μl 1x of passive lysis buffer for 30 min.Transfer the 20 μl lysed medium into 96-well black plate. Add luciferase substrate (100 μl) into 96-well black plate and briefly mix with lysed medium.Measure luciferase activity using luminometer reader (VICTOR Multilabel Plate Reader).Define Nab titers as the highest dilution for which luciferase activity is 50% lower than serum-free controls.Nab escaping ability of AAV mutants in miceIncubate 1 x 1010 vg of AAV/luc mutants isolated from muscles with the 5-fold diluted patient serum or PBS for 2 h at 4 °C. Inject the AAV/serum mixture (total volume 100 μl) in the legs of six-week-old female BALB/c mice via i.m.Image luciferase expression in mice at 3 weeks post-injection. Anesthetize mice using an isoflurane vaporizer and inject with 120 mg/kg of D-Luciferin substrate intraperitoneally 5 min before imaging. Place the mice inside the camera box of the IVIS system. Start imaging with an exposure capturing in mice."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}