{
  "id": 8954,
  "origin_website": "Jove",
  "title": "Loading a Calcium Dye into Frog Nerve Endings Through the Nerve Stump: Calcium Transient Registration in the Frog Neuromuscular Junction",
  "procedures": [
    "Experiments were performed on isolated nerve-muscle preparations of the musculus cutaneous pectoris from the Rana ridibunda frog. The size of animals of both genders was about 5-9 cm. The experimental procedures were performed in accordance with the guidelines for the use of laboratory animals of the Kazan Federal University and the Kazan Medical University, in compliance with the NIH Guide for the Care and Use of Laboratory Animals. The experimental protocol met the requirements of the European Communities Council Directive 86/609/EEC and was approved by the Ethical Committee of the Kazan Medical University.\n1. Preparation of the Solutions\nPreparation of Ringer's solution.\nPrepare Ringer's solution: 113.0 mM NaCl, 2.5 mM KCl, 3.0 mM NaHCO3, and 1.8 mM CaCl2. Adjust the pH to 7.2-7.4.\nPrepare Ringer's solution with a low Ca2+ and high Mg2+ content: 113.0 mM NaCl, 2.5 mM KCl, 3.0 mM NaHCO3, 6.0 mM MgCl2, 0.9 mM CaCl2. Adjust the pH to 7.2-7.4.\nPreparation of the dye-loading solution.\nPrepare the water-based solution containing HEPES-Na at 10 mM (pH 7.2-7.4).\nAdd 14 µL of the HEPES solution to a vial with the dye30.\n\t\tNOTE: the Ca2+ indicator dye comes in a 500-µL vial with 500 µg of powder.\nVortex and spin down to mix thoroughly.\nDilute the solution to bring the final concentration of the Ca2+ indicator down to 30 mM. Avoid exposure to light and store at -20 °C.\n2. Dye-loading Procedure\nDissect the cutaneous pectoris muscle with a piece of the pectoralis proprius nerve.\n\tNOTE: The dissection procedure is available in a free download of the paper by Blioch et al., 196831.",
    "For the dissection procedure, use two fine forceps and corneal scissors (see the Table of Materials). Transfer the dissected tissue into a silicon elastomer-coated Petri dish pre-filled with Ringer's solution and fix the tissue with fine stainless-steel pins such that it is slightly stretched in the dish.\nRe-fill the Petri dish with a fresh aliquot of the Ringer's solution. Remove the connective tissues. Do not damage the nerve.\nPrepare the filling pipette: using a razor blade, cut out a ~2 mm-long piece of the conical part of a standard plastic 10 µL pipette tip.\nPrepare a piece of modeling clay to mount the filling pipette on the Petri dish.\nConnect the back of the filling pipette to a plastic syringe via silicone tubing and plastic connecting adapters made from pipette tips.\nBefore the dye loading procedure, remove the Ringer's solution from the Petri dish using a plastic pipette. Dry the muscle-nerve preparation using a fine syringe; this will prevent the dilution of the Ca2+ dye upon the subsequent loading of the filling pipette.\nRemove the Ca2+ indicator vial from the freezer and allow it to thaw at room temperature in a dark place.\nUnder stereomicroscope control with low magnification (10×), detect the junction between the muscle and the nerve. With fine tweezers and scissors, cut the pectoralis proprius nerve close to the muscle surface (see step 2.1). Leave a nerve stump about 2 mm long.\nFix the filling pipette attached to tubing and the syringe on the Petri dish using modeling clay.\nMove the tip of the pipette close to the nerve stump.\nWithout pinching it, gently aspirate the nerve stump into the tip of the filling pipette.\nRemove the suction tubing from the blunt end of the filling pipette.",
    "Carefully remove the excess solution from the filling pipette using a syringe with a long needle (see the Table of Materials). Do not pinch the nerve stump.\nVertically elevate the tip of the filling pipette slightly, keeping the nerve stump aspirated in the tip.\nInsulate the aspirated part of the nerve stump from the outside of the filling pipette tip using petroleum jelly.\nDry up the nerve stump insulated in the filling pipette if necessary: gently aspirate the excess of solution from the filling pipette using a syringe with a long needle.\nDraw 0.5 µL of the dye-loading solution (see step 1) using a pipette with a long pipette tip.\nGently insert the pipette tip with loading solution into the filling pipette. Eject the mixture directly onto the nerve stump.\nSeal the open end of the filling pipette with petroleum jelly.\nAdd a small aliquot of Ringer's solution to the Petri dish to keep the preparation wet.\nIncubate the preparation at room temperature under dark and wet conditions for 5 h.\nRemove the filling pipette with loading solution, rinse the preparation with the Ringer's solution, and keep it overnight in the refrigerator at 8 °C.\n3. Preparing the Tissue for Microscopy\nMount the preparation into the silicon elastomer-coated chamber and fix it with steel micro-needles such that it is slightly stretched.\nRinse the tissue with an aliquot of fresh Ringer's solution.\nUse a suction electrode to stimulate the nerve; construction of the electrode is available from the free download of the paper by Kazakov et al., 201532. Position the electrode tip close to the cut end of the nerve and aspirate the nerve stump into the electrode orifice.\nMount the preparation chamber on the microscope stage. Place the temperature probe and the inlet and outlet firings in the chamber.",
    "Connect the power cord to the Peltier element.\nTo superfuse the preparation, use a simple gravity-driven system. To remove the excess solution, turn on the perfusion suction pump.\nSwitch on the thermo-controller unit.\nSet the temperature control to 20 °C.\nMount the ultraviolet protection shield.\nConnect the stimulating wire electrode to the electric stimulator and observe the muscular contractions under the microscope with a 4x objective lens.\nFill up the perfusion system with the Ringer's solution with low-Ca2+ and high-Mg2+ content.\n\tNOTE: This solution is used to prevent muscular contractions. A decrease in the concentration of external calcium and an elevation of external magnesium result in the reduction of the amplitude of Ca2+ transients.However, based on previous experience, 0.9 mM CaCl2 and 6 mM MgCl2 are still sufficient to reliably resolve the amplitude of Ca2+ transients. It is worth mentioning that there exist some other ways to diminish muscular contractions without reducing the Ca2+ concentration.For example, the use of d-tubocurarine or alpha-bungarotoxin, specific blockers of nicotinic acetylcholine receptors, would completely or partially block muscle twitches17,27,28,30.However, the addition of these toxins can also affect presynaptic calcium entry33. To avoid this, µ-conotoxin GIIIA can be used27.\nSwitch on the pump and start the superfusion of the preparation with the Ringer's solution with low Ca2+ and high Mg2+.\nSwitch to the 40× objective lens on the microscope.\nSwitch on the monochromator (see the Table of Materials).\nSelect an emission wavelength of 488 nm and a continuous mode of illumination in the monochromator control software.\nUnder high magnification in fluorescence mode, ensure that the nerve terminals were loaded with the dye.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55122/55122fig1.jpg",
    "Figure 1: Nerve and terminals with loaded Ca2+ indicator. (A) Nerve filled with Ca2+ indicator after the loading procedure. Scale bar = 200 µm. (B) Nerve endings filled with Ca2+ indicator. Scale bar = 20 µm. (C) Ca2+-indicator fluorescence is clearly visible in the nerve ending. Scale bar = 20 µm. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/55122/55122fig1large.jpg]\nAllow the preparation to equilibrate for at least 30 min in the low-Ca2+ and high-Mg2+ solution.\n4. Video Capture with the Digital CCD Camera\nNote: The details of capturing fluorescence signals are specific for each microscope and camera type, but the key consideration is the image capturing speed.\nUse 1 kHz as the minimum capture frequency for recordings of single Ca2+ transients in the NMJ.\n\tNOTE: Fast digital CCD cameras are necessary for fluorescence imaging (see the Table of Materials). The data acquisition system and software (see the Table of Materials) were used here for the synchronization of the camera, monochromator, and stimulator. In brief, this protocol permits the generation of synchronization pulses on digital outputs of the data acquisition system to open the shutter, capture the video signal, and initiate stimulation. All temporal parameters can be set in the protocols and/or on the apparatuses. A typical protocol is a series of 500 frames acquired at 1 kHz (80 x 80 pixels). Illumination with excitation light can bleach out the Ca2+ indicator and photodamage the cell tissue. Thus, avoid long exposures to excitation light. In this protocol, the shutter is open only for the time needed to capture the video. Acquire twenty series per specific nerve terminal. The aim here is to monitor the same sites in the control group and after drug delivery.",
    "Under the 4X objective lens of a microscope, use the bright-field regime to visualize the muscle and nerve branches.\nSwitch to the 40X objective lens and, using the epifluorescence regime and an excitation wavelength of 488 nm, search for dye-loaded nerve endings. Identify a nerve-ending region of interest.\nOn the trinocular tube of the microscope, select the light path exchange levels: 100% light to camera.\nStart the acquisition software for the CCD camera.\nUnder \"Live\" mode, find the ROI and adjust the focus.\nSelect the menu \"Change\" settings.\nUse the \"Basic Configuration\" at 1,000 frames per second (fps), with a resolution of 80 x 80.\nSet the number of input frames to 500.\nEnter the name of the experiment.\nChoose \"External Trigger.\"\nSet the pre-trigger time to 10 ms.\nSet the number of repeats to 20.\nIn the monochromator control software, select an emission wavelength of 488 nm and \"external trigger illumination\" mode.\nRun the data acquisition software.\nLoad the stimulation protocol.\nBefore recording the video, capture the dark frame using the video acquisition software.\nRun the stimulation protocol.\nSelect the ROI and check the recorded signal.\n5. Data Analysis\nNoOTE: For data analysis, use the CCD camera software and ImageJ; the data is represented as a curve in a spreadsheet program. In the CCD camera software, average 20 repeats and export the results to an ImageJ support file. In ImageJ, select the ROI and background. Subtract the background from the ROI. Represent the data as a ratio: (ΔF/F0 -1) x 100%, where's ΔF is the intensity of fluorescence during stimulation and F0 is the intensity of fluorescence at rest.\nIn the acquisition software for the CCD camera, click on File > Average Files. Select the files and average them.",
    "Save the averaged file as a .fit file by clicking \"Save as Fit file.\"\nRun the ImageJ software. Perform the following steps:\nClick Image > adjust > brightness/contrast.\nClick Image > stacks > tools > stack sorter.\nClick Analysis > tools > ROI manager.\nDrag and drop the averaged .fit file into the ImageJ window.\nZoom in on the window for a better view.\nBy moving the cursor, select the last frame and delete it (this is the dark frame)\nSelect a rectangular ROI over the area believed to be the background. Add it to the ROI manager\nMeasure the background by clicking More > Multi Measure. Note the MEAN. Copy the data, export it to a spreadsheet program, and calculate the average value of the threshold for a ratio.\nSubtract the threshold from the stacks by clicking Process > Main > Subtract. Enter the averaged value of the threshold.\nSelect a rectangular ROI around a nerve terminal. Add it to the ROI manager.\nMeasure by clicking More > Multi Measure. Note the MEAN. Copy and export it to a spreadsheet program.\nAverage the offset of the signals.\n\tNOTE: Use the first several dozen points demonstrating base dye fluorescence without stimulation; this is the fluorescence at rest.\nDivide the signals by the fluorescence at rest.\nSubtract \"1\" and multiply by 100%.\nPlot the signal and calculate the amplitude of the Ca2+ transient."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}