{
  "id": 15198,
  "origin_website": "Jove",
  "title": "High-Throughput Screening to Obtain Crystal Hits for Protein Crystallography",
  "procedures": [
    "1. Preparation or purchase of cocktails for sixteen 96-well deep well blocks\nPrepare in-house-generated chemical cocktails by dispensing into 96-well deep well (DW) blocks. Use a robotic liquid handler to dispense and mix stock solutions of salts, buffers, polymers, and water.\nPrepare in-house-modified chemical cocktails by using a robotic liquid handler or multichannel pipette to add additional components to 96-well DW block screens that have been commercially purchased.\nPurchase commercially available DW blocks.\nStore labeled 96-well DW blocks at −20 °C for 12-18 months.\n\t​NOTE: The cocktails prepared in step 1.1. and 1.2. fill 10/16 96-well DW blocks, and 5/16 96-well DW blocks are used as purchased. One 96-well DW block in the screen is set up at the time of the 1,536-well plate dispensing to avoid precipitation of the additive screen (see section 3).\n2. Dispensing the cocktails to 384-well plates\nThaw the 96-well DW blocks at 4 °C overnight. Bring to room temperature (20-23 °C) before beginning the preparation of the 384-well plates.\n\tNOTE: Room temperature is suitable for preparing the cocktail plates. The main concern in preparing these plates is to avoid precipitates, which can clog liquid-handling devices and lead to unpredictable changes in the concentrations of the cocktail ingredients.\nMix the blocks thoroughly by inversion as needed to dissolve any persistent opaque precipitate. If any wells contain precipitate, warm the blocks to 30 °C to dissolve.\nDeliver 50 µL of cocktail solution from four 96-well DW blocks to one 384-well plate using a liquid handling robot equipped with a 96 syringe or pipettor head. The four 96-well DW blocks are stamped out into the 384-well plate such that quadrants are filled (e.g., A1 of 96-DW1 to A1 of 384-plate1, A1 of 96-DW2 to B1 of 384-plate1, etc.) (Figure 3).",
    "Deliver 15 of the 16 96-well DW blocks to 384-well plates for storage.\nStore the 384-well plates at −20 °C for up to 6 months for use in preparing the 1,536-well plates.\n3. Preparing the 1,536-well plates with oil and crystallization cocktails\nDeliver 5 µL of paraffin oil to each well of a 1,536-well plate using a robotic liquid handling system with the capacity for slow aspiration and delivery. Store the oil plates at 4 °C for up to 6 months.\nThaw the 384-well plates from section 2 at 4 °C overnight. Invert the plates to mix the solutions and dissolve the precipitate. Incubate the plates at 30 °C to dissolve persistent precipitates.\nTo prepare the additive screen components, use the final 96-well DW block containing 0.1 M HEPES pH 6.8, 30% PEG3350 to mix with the commercial additive screen by using either a liquid handling robot or a multichannel pipette.\nPrepare the additive screen solutions by dispensing a 1:1 mixture of the buffered PEG3350 solution prepared in step 3.3 and the additive screen to a final volume of 50 µL in the appropriate 384-well plate.\nUse a liquid handling robot equipped with a 384 syringe or pipettor head to deliver 200 nL of cocktail solution into each well of the 1,536-well plate. Stamp out four 384-well plates into the 1,536-well plate such that quadrants are filled (e.g., A1 of 384-plate1 to A1 of the 1,536-well plate, A2 of 384-plate1 to A3 of the 1,536-well plate, etc.) (Figure 3).\nCentrifuge the plates at 150 × g for 5 min before storing at 4 °C for up to 4 weeks.\n4. Sample submission",
    "To submit a sample, send a reservation email prior to the reservation deadline for the upcoming screening run. Include the number of screening experiments, the name, the PI, and the institution, as well as any special handling requirements for the sample. Screening runs are conducted approximately once monthly, resulting in 12 runs yearly.\nComplete a sample submission form prior to shipping the sample.\n\t\nFor new users, choose a password that will be used to download the crystallization images in section 7.\nFor established users, use an existing password or change the password at this step.\nSubmit the sample in a 1.5 mL tube. Ensure the macromolecule is homogeneous and adequately concentrated to promote crystallization. Use a pre-crystallization test, typically composed of ammonium sulfate or PEG 4,000, to investigate the appropriate sample concentration by observing whether the tested sample concentrations result in clear drops or precipitate34.\n\tNOTE: Suitable quality tests that may be undertaken prior to sample submission to check for purity and homogeneity include SDS-PAGE, gel filtration, and dynamic light scattering (DLS), amongst others. Crystallization can be affected by the presence of even minor impurities. A sample volume of 500 µL is currently required to set up one 1,536-well plate. Testing is underway to decrease the sample volume requirement.\n\t\nAvoid using buffer concentrations greater than 50 mM, as well as phosphates, which may crystallize within the screen.\nAvoid excessive solubilizing agents, including glycerol concentrations greater than 10% w/v.\nPackage the sample to safely maintain an appropriate temperature using dry ice, wet ice, or cooling packs in a sealed container.\nShip sample priority overnight on a Monday-Wednesday during the run.\nEmail the tracking number once the sample has been shipped.\n5. Sample setup in the prepared 1,536-well plates\nUnpack samples and immediately incubate at the temperature the user has requested.",
    "Once thawed, centrifuge the sample at 10,000 × g for 2 min at room temperature. Visually observe the sample to identify precipitation, color, and condition of the sample prior to setup.\nWarm 1,536-well plate to 23 °C and centrifuge at 150 × g for 5 min. Image the cocktail-only plate using brightfield imaging as a negative control.\n\tNOTE: All plates are imaged with brightfield imaging prior to sample setup, which enables the identification of wells that already have crystals or debris in them prior to sample addition as a negative control. Further, it enables the identification of wells in which the crystallization cocktail has not been delivered. Warming the plate to room temperature eliminates condensation on the plate surface, leading to clear images.\nDispense 200 nL of sample to each well in the 1,536-well plate using a liquid handling robot. Centrifuge plate at 150 × g and incubate plates at 4 °C, 14 °C, or 23 °C.\n\t​NOTE: Microbatch under-oil-experiments can be set up by hand by dispensing the protein and cocktail under the desired oil. However, it is recommended to use no less than 1 µL of each protein and cocktail to achieve reproducible results.\n6. Monitor 1,536-well plates for crystal formation\nAfter the sample has been added to the 1,536-well plates, image with brightfield imaging at day 1 and week 1, week 2, week 3, week 4, and week 6.\nPerform SONICC imaging with SHG and UV-TPEF at the 4 week time point for plates being incubated at 23 °C and at the 6 week time point for plates being incubated at 14 °C or 4 °C.",
    "​NOTE: The timing for the SONICC imaging is scheduled at the 4 week and 6 week time points for the high-throughput 1,536 microassay plate because, typically, crystals will appear by those time points. For modification to a 96-well microbatch under oil or vapor diffusion experiments, it is advisable to perform the SONICC imaging earlier in the time window.\nAccess the experimental images that have been automatically transferred to the user account using an internal LIMS system. Notify the users via an automated htslab email daemon that imaging has occurred.\n7. Image analysis\nRetrieve the screening images from the HWI ftp site for each .rar file.\n\tNOTE: The image output from the 1,536 screen results in a number of files containing brightfield images, SHG images, and UV-TPEF images. Each imaging modality or time point is a separate .rar file. Each .rar file, when unpacked, contains an image from each well of the 1,536-well plate at a specific time point using a specific imaging modality.\n\t\nUse the FileZilla Client or other options to access the ftp data.\n\t\tNOTE: The FileZilla Client is the recommended way to manage the large file transfer volume to minimize computational crashes.\n\t\t\nIf FileZilla Client needs to be installed on the user computer, download the FileZilla software.\nIf FileZilla Client is already installed or upon installation, click the FileZilla icon to open the software.\nLog in to the remote ftp server from FileZilla by entering the host ftp website, username, and password.\nDownload the .rar files to the desired directory.\nUse the AI-enabled open-source GUI to view, score, and analyze the crystallization images.",
    "NOTE: The GUI can be used on most Windows, Mac, and Linux operating systems (OS), and OS-specific instructions for download are located on the GitHub site. MARCO Polo is an open-source GUI that incorporates metadata from the high-throughput 1,536 crystallization screen implemented at the HTX Center. It is available for anyone to download from GitHub for modification to reflect the specific needs of other laboratory groups.\n\t\nOpen the .rar file in the GUI after the file has been downloaded (see Supplementary Figure S1).\n\t\t\nClick on Import, select Images from the dropdown menu, and then select From Rar Archive/Directory.\nClick on Browse for Folder in the popup window, and then navigate to the folder containing the images.\nSelect the desired file(s), and import into the GUI by clicking on Open. Wait for the file(s) to appear in the Selected Paths window. Select one or more files to download into the GUI, and click on Import Runs.\nView the image for the first well in the window of the Slideshow Viewer in the GUI by clicking on the > symbol to the left of the sample name and then selecting the appropriate read by double-clicking on it (reads are listed by the date and type of image-brightfield, UV-TPEF, or SHG).\nEnlarge the image by resizing the whole window. The Image Details box includes information about the image, including the scoring information (empty until the read has been scored). The Cocktail Details box contains metadata about the cocktail components.\nMove to the next well by clicking on the Next button in the Navigation panel or pressing the right arrow key on the keyboard. Navigate to a specific well by entering the well number in the By Well Number window.",
    "View all the reads (of those imported into the GUI) by checking the Show All Dates box.\nView all the spectra (of those imported into the GUI) by checking the Show All Spectra box. Click on the Swap Spectrum button to view each spectrum image individually.\nScore the crystal images using the MARCO algorithm by first highlighting a specific run from the list on the left side of the window. Next, click on the Classify Selected Run button. View the MARCO scoring information in the Image Details window once an imaging read has been scored for all 1,536 wells.\n\tNOTE: Classification will typically take between 2-5 min, depending on the computer speed and memory available. The algorithm generates scores that classify the contents into \"crystal\", \"clear\", \"precipitate\", or \"other\" classes. The numeric values associated with each well's classification reflect the likelihood of the well containing objects of that class.\n\t\nView a subset of the scored images by ticking the desired box(es) in the Image Filtering panel and clicking on the Submit Filters button. For example, view only the images classified by MARCO as crystals by ticking the Crystals and the MARCO boxes and clicking on Submit Filters.\nManually score the crystal images to generate the \"human scored\" set. Assign a score to a well by clicking on the appropriate button (the \"crystal\", \"clear\", \"precipitate\", or \"other\" buttons are located in the Classification panel at the bottom of the window). Alternatively, use the number pad on the keyboard to assign the score (1 = \"crystal\", 2 = \"clear\", 3 = \"precipitate\", 4 = \"other\"). Designate a human-scored image as a \"favorite\" by ticking the Favorite? box.",
    "NOTE: View only the images classified by a human as crystals by ticking the Crystals and the Human boxes and clicking on Submit Filters. Clicking on the Favorites box in the Filtering panel further narrows down the returned images, returning only the human-scored crystal images that are also favorites.\nUse the Plate Viewer tab to view multiple wells at one time. On the second Plate Viewer tab in the Controls panel, select 16, 64, or 96 images from the dropdown menu in the Images Per Plate section. Use the Image Filtering Tab to gray-out images that are not of interest. Select the Apply Filter box to filter the images.\n\tNOTE: For example, select the \"human\" and \"crystal\" boxes, and only those wells that were scored as a crystal by a human will be easily visible.\n\t\nNavigate in the Plate Viewer tab, by clicking on the Next button to view the next set of 16/64/96 images. By default, images scored as crystals are red, those scored as clear are blue, those scored as precipitate are green, and those scored as other are orange. Change the colors by using the dropdown menus.\nSelect the information to be displayed on the wells by ticking various boxes on the Labels tab.\nClick on Save View to save an image file of the current view.\nClick on Swap Spectrum to toggle between brightfield, SHG, and UV-TPEF images for the multiple-well image.\nClick on Export, and select the appropriate file type from the dropdown menu to export the scored files for use in other programs.",
    "NOTE: CSV (comma-separated values) files are compatible with spreadsheet programs such as Microsoft Excel or Google Sheets. JSON (JavaScript Object Notation) files can be opened with most text editors. PPTX (PowerPoint Presentation) can be used to display images from Polo, including a comparison of brightfield, UV-TPEF, and SHG images. Files are saved in .xtal format to be reopened in the MARCO Polo GUI.\n\t\nSave an .xtal format file by clicking on File at the top of the page and then selecting either Save Run or Save Run As. Provide a file name and directory location.\nOpen .xtal format files by clicking on Import and selecting Images and then From Saved Run. Browse for the appropriate file location, click on the file name, and then click on Open."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}