{
  "id": 7325,
  "origin_website": "Bio",
  "title": "Neutral Comet Assay to Detect and Quantitate DNA Double-Strand Breaks in Hematopoietic Stem Cells",
  "procedures": [
    "Cell preparationEuthanize a C57Bl6/J mouse, dissect out the hind limbs, and remove the extra tissue from the bones to separate the femur and tibia.Flush the bone marrow cells into a 50-ml polypropylene tube using autoclaved 1× PBS and a 26 G needle with a 1-ml syringe until the bones are cleared inside.Mix the cells to make a single cell suspension and strain through a 40-μm nylon strainer. Centrifuge at 600 × g for 5 min at 4°C.Lyse the RBCs by adding 500 µl 1× RBC lysis buffer (diluted in 1× PBS) to the pellet and neutralize the reaction after 2 min by adding 2 ml 1× PBS. Centrifuge at 600 × g for 5 min at 4°C.Resuspend the cell pellet in 1 ml 1× PBS and count the cells using a hemocytometer.Incubate the cells with the required antibodies (2 µl/5 million cells for Lin APC and 1 µl/5 million cells for c-Kit PE and Sca-1 PerCP-Cy5.5) to stain hematopoietic progenitor cells (Lin APC cocktail, c-Kit PE, Sca-1 PerCP-Cy5.5) for 30 min.Centrifuge at 600 × g for 5 min at 4°C. Wash the cells with 1× PBS and transfer to a 5-ml FACS tube for sorting.Sort the pure LSK (Lineage– Sca-1+ ckit+) population into 1× PBS and store at 4°C until further use.Note: Alternatively, MACS sorting can be used to isolate less pure HSC progenitor populations. Slide preparationWeigh 1 g agarose and dissolve in 100 ml 1× PBS using a microwave oven.Place the comet slides inside a plastic container in a slanted position (Figure 1A). Pipette out 1 ml agarose and evenly coat the slides and, leave to solidify for 10-15 min at room temperature (Figure 1B).Freshly prepare 0.75% low-melting (LM) agarose using 1× PBS in a 100-ml beaker. Dissolve using a microwave oven.Note: Transfer the molten 0.",
    "75% LM agarose to a storage bottle for further use. Before use, re-melt in a beaker containing hot water. Allow the hot LM agarose to cool for at least 20 min at 37°C.Add 1 × 105 cells/ml to the molten LM agarose at a ratio of 1:10 (v/v).Note: If you take 500 µl molten LM agarose, add 50 µl cells in 1× PBS (Ca2+ and Mg2+ free) at 1 × 105 cells/ml. Immediately pipette 50 µl suspension onto the comet slide. Use the tip of the pipette to spread the mixture uniformly over the surface area and allow to solidify (Figure 1C).Note: If the sample mixture is not dispersing uniformly on the slide, heat up the LM agarose at 37°C before suspending the cells, and prepare the sample mixture again. Keep the slides at 4°C for 10 min in the dark (e.g., place in a refrigerator).Note: A clear 0.5 mm ring appears at the edge of the well (Figure 1D). To increase the adherence of the sample to the slide, the gelling time and humidity should be increased. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4130/bioprotoc-11-16-4130-g001.jpgFigure 1. Preparation of a comet slide. A. A clean Trevigen® CometSlideTM HT is placed inside a plastic container. B. The comet slide is pre-coated with molten 1% agarose. This ensures that cells adhere to the slide efficiently. After pre-coating with agarose, allow the gel to solidify. C. The 0.75% LM agarose containing the cells is added gradually to the slide. Allow the gel to solidify at 4°C. D. The comet slide after solidification of the gel.Lysis and ElectrophoresisPrepare the lysis solution (see Recipes) and place on ice for at least 20 min before use.Pour the required amount of pre-chilled lysis solution in a tray and immerse the slides. Place the tray on ice or at 4°C for 1 h.",
    "Take the slides from the lysis solution and drain the excess.Wash the slides by placing them in 50 ml pre-chilled 1× neutral electrophoresis buffer (see Recipes) at 4°C for 30 min.Pour 950 ml pre-chilled 1× neutral electrophoresis buffer into the Comet Assay® ES tank. Place the slides in the electrophoresis slide tray and cover with the slide tray overlay (Figure 2A).Set the power supply to 21 volts and perform electrophoresis for 1 h at 4°C.For other electrophoresis units, align the slides equidistant from the electrodes, add 1× neutral electrophoresis buffer not exceeding 0.5 cm above the slide (Figure 2B), and apply voltage for 30 min at 1 volt per cm, measuring the distance between the two opposite electrodes of the electrophoresis tank (e.g., If the distance is 21 cm then apply 21 V).Run the electrophoresis unit either in a cold room or over an ice tray containing enough ice to partially cover the unit (Figure 2C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4130/bioprotoc-11-16-4130-g002.jpgFigure 2. Electrophoresis under neutral conditions. A. After lysis, the comet slide is placed in the electrophoretic unit and neutral electrophoresis buffer is added to the buffer tank. B. The neutral electrophoresis buffer should not exceed 0.5 cm above the slide. C. Perform electrophoresis at 21 volts for 1 h at 4°C.Staining and visualization of slidesDrain the excess neutral electrophoresis buffer and immerse the slides in DNA precipitation solution for 30 min at room temperature (see Recipes).Remove the slides and immerse them in 70% ethanol for 5 min at room temperature.Allow the samples to dry for 10-15 min at room temperature.Note: Drying the samples will allow the cells to settle in a single plane, making visualization, recording, and quantitation easier. Samples can be stored with desiccant at room temperature before scoring. Add 100 µl diluted SYBR® Gold onto each sample and incubate for 30 min.",
    "Note: Trevigen provides the CometAssay® Silver Staining Kit designed for comet staining. Silver staining helps in the visualization of comets on any transmission light microscope and permanently stains the samples for long-term storage. It is recommended that samples are dried before silver staining. Tap the slides gently to remove excess SYBR® Gold solution. Allow the slide to dry completely at room temperature in the dark.View the slides using epifluorescence microscopy and obtain unbiased images for every cell that could be visualized.Note: The efficiency of the method can be tested using cells challenged with genotoxic stress as a positive control. Here, hematopoietic stem and progenitor cells from young adults (8 weeks old) (Figure 3A) were compared with cells from aged mice (2 years old) (Figure 3B). Comet tail formation in cells from aged mice is clearly visible. Comparison between the two cell types for the proportion of genomic DNA in the head versus the tail can be used as a reliable quantitation of the extent of DNA damage. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4130/bioprotoc-11-16-4130-g003.jpgFigure 3. Staining and visualization of cells. A. HSC from young mice; the nucleus in the cell is intact, indicating that there is no DNA damage. B. HSC from old mice; the nucleus in the cell is not intact and is forming a head and a comet tail, indicating that there is DNA damage.Scoring and analysis of the cellsScoring of the comet is performed in the ImageJ plugin – Open Comet. Launch the plugin in ImageJ (Figure 4A).Input your image files to the Input files option by clicking on the Browse button (Figure 4B).Choose an Output directory where the output files will be stored, along with the name of the file that it should be saved under (Figure 4C and 4D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4130/bioprotoc-11-16-4130-g004.jpgFigure 4. Comet scoring using ImageJ. A.",
    "Open the ImageJ software and click on Plugins. Select OpenComet_src_v1.3.1 and click on OpenComet. B. A dialogue box will open, where you need to browse the Input files and Output directory. C. Select the images for scoring the input file. D. Choose the Output directory.Choose the default analysis option and Click RUN.The analyzed output data will appear in the Output directory.The Output file consists of an Output Image and an Output Spreadsheet. Review all the Output images for false analysis and outliers. Note the Number given specifically for each image (Figure 5A).Open the Spreadsheet and manually delete the outlier numbers.Obtain the values for Olive moment and Tail moment from the Spreadsheet and graphically represent the data using GraphPad PRISM (Figure 5B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4130/bioprotoc-11-16-4130-g005.jpgFigure 5. Results of comet scoring. A. Identification of the comet head and tail. B. Excel spreadsheet containing the computed comet parameters."
  ],
  "subjectAreas": [
    "Stem Cell",
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}