{
  "id": 17654,
  "origin_website": "Jove",
  "title": "Single Cell Analysis Of Transcriptionally Active Alleles By Single Molecule FISH",
  "procedures": [
    "To ensure optimal results, the wet lab portion of this protocol requires standard RNase-free precautions at all steps. For example, the use of filtered pipette tips, sterile vessels and RNase-free buffers is highly encouraged. Using RNase inhibitors such as vanadyl ribonucleoside complexes is also suggested, especially for low abundance target RNAs.\n1. Cell culture and experimental setup\nMaintain adherent MCF-7 breast cancer cells (ATCC #HTB-22) in a T75 tissue culture flask with phenol-red free (only required for hormone stimulation experiments) Dulbecco’s modified Eagle’s medium (DMEM) supplemented with 10% fetal bovine serum (FBS), 2 mM L-glutamine, 1 nM sodium pyruvate, 50 I.U./mL penicillin and 50 µg/mL streptomycin.\nPlace acid-etched, poly-D-lysine coated round coverslips (0.16 to 0.19 mm thick, 12 mm diameter) into a 24 multiwell tissue culture plate.\n\tNOTE: Use 1 M HCl to acid-etch the coverslips and coat with a 1 mg/mL solution of poly-D-lysine reconstituted in sterile PBS (phosphate-buffered saline without Ca++ and Mg++) according to standard protocols.\nRemove the growth media from the cells and wash once with 5 mL of sterile PBS (phosphate-buffered saline without Ca++ and Mg++). Detach MCF-7 cells using 2-3 mL of Trypsin-EDTA 0.25% solution. Once cells are detached, neutralize the Trypsin-EDTA 0.25% solution with an equal volume of growth media.\nTransfer the cells in the media suspension to a 15 mL conical tube, spin down at 391 x g for 1 minute to pellet out the cells. Carefully remove the media from the conical tube without disturbing the cell pellet and resuspend the cells in an appropriate amount of treatment media.",
    "NOTE: Treatment media is phenol-red free DMEM supplemented with 5% charcoal-dextran stripped and dialyzed FBS, 2 mM L-glutamine, 1 nM sodium pyruvate, 50 I.U./mL penicillin and 50 µg/mL streptomycin. This media is essential for steroid hormone stimulation experiments as the serum component is largely depleted of steroids by charcoal stripping the media, and has reduced growth factors via dialysis.\nSeed the cells onto coverslips in the 24 multiwell plate at 60,000 to 70,000 cells per well in 500 µL of treatment media. For this experiment, cell confluency should be around 70-80% at treatment initiation. Optimize cell seeding density depending on cell type, growth rate and length of the experiment to avoid confluency, which complicates image analysis.\n\tNOTE: For best imaging and image analysis, avoid cell clumping. For this purpose, mix the aliquot of cells thoroughly by pipetting (or briefly vortex) the cells a few times before dispensing into the wells. Before placing the plated cells back into the incubator, letting the cells settle in the tissue culture hood for about 20 minutes helps reduce cell clumping.\nIncubate cells for at least two days prior to treatments to ensure cell cycle synchronization and background reduction due to any signaling molecules that remain in the stripped/dialyzed serum of growth media.\nAfter a 48 hour incubation in treatment media, treat MCF-7 cells with 10 nM 17β-estradiol (E2) and vehicle control (DMSO), diluted in treatment media for 24 hours. This treatment uses a saturating dose of E2 to induce a maximal response. Perform time course and dose-response experiments to empirically determine conditions for different target genes, cell models and type of treatments. As an example, see our recent publication7.\n2. Preparation of buffers",
    "To prepare the fixation buffer, dilute purified, monomeric formaldehyde (sold by electron-microscopy suppliers as 16% paraformaldehyde) to 4% in sterile PBS Ca++/Mg++ (phosphate-buffered saline plus Ca++ and Mg++). Add vanadyl ribonucleoside complexes (VRC) to the fixation buffer for a final concentration of 2 mM to delay RNA degradation.\n\t\nCalculate the total amount of fixation buffer based upon requiring 300-500 µL of fixative per well of a 24 multiwell plate. Store the 4% formaldehyde on ice until required in the fixation step.\n\t\tNOTE: Make the fixation buffer fresh for each experiment.\n\t\tCAUTION: Formaldehyde is a teratogen that is absorbed through the skin. Use this chemical in a fume hood along with appropriate PPE according to your institutional regulations.\nFor the permeabilization step, prepare 70% ethanol in nuclease free water. An alternative option is 0.5% Triton-X100 in sterile PBS Ca++/Mg++ plus 2 mM of VRC. Calculate the total amount of permeabilization buffer needed by utilizing 500 µL of buffer per well.\nTo prepare 9 mL of the hybridization buffer, add 2 mL of stock 50% dextran sulfate, and 1 mL of 20x SSC (saline sodium citrate) buffer to 6 mL of nuclease free water. Vortex to thoroughly mix the hybridization buffer. This buffer can be stored at 4 °C for up to one week.\nThere are five separate wash steps that require 2x saline sodium citrate (SSC) buffer. Calculate the final volume of 2x SSC buffer needed by anticipating 500 µL of buffer per coverslip per wash step. Dilute the required amount of stock 20x SSC buffer in nuclease-free water. 2 mM VRC can be added to wash steps as an extra precaution. This buffer can be stored at room temperature for the duration of the processing steps.\n3. Fixation for RNA FISH",
    "Following treatment, remove the media from the wells and wash once with sterile, cold PBS Ca++/Mg++. If a low adherence cell model is utilized, do not use a vacuum to aspirate liquid; use manual pipetting to carefully remove media from the side of the well and omit the initial wash step. Add 500 µL fixation buffer for 30 minutes on ice.\n\tNOTE: If the sample is prone to RNA degradation, use sterile PBS with 2 mM VRC for the wash step at this point.\nRemove fixative and dispose it in chemical waste according to institutional regulations. Wash the cells twice with cold sterile PBS Ca++/Mg++ for 3 minutes.\nRemove PBS and add 500 µL of 70% ethanol to each well. Seal the 24 well plate with a paraffin plastic film. Place on a rotator at 4 °C for a minimum of four hours. It is best to leave the samples in 70% ethanol overnight. The protocol can be paused at this point and the samples can be stored for up to a week in 70% ethanol.\n\tNOTE: A 0.5% Triton-X100 in PBS with 2 mM VRC solution may be used as alternative. Incubate the samples in 500 µL of this permeabilization buffer for 20 minutes at room temperature on a rotator. If utilizing this permeabilization buffer, the protocol cannot be paused at this point and must continue through the hybridization step.\n4. Hybridization for RNA FISH\nRemove the permeabilization buffer and wash one time in 500 µL of 2x SSC buffer plus 10% formamide for 5 minutes at room temperature on a rotator.",
    "Prepare the complete hybridization buffer. Calculate approximately 30 µL of complete hybridization buffer per coverslip. Add formamide to the hybridization buffer to reach the percent needed. For example, if 500 µL of complete hybridization buffer is needed, then it would consist of 450 µL of the previously made hybridization buffer plus 50 µL of molecular grade formamide to reach 10% vol/vol. Vortex briefly to mix.\n\tCAUTION: Formamide is a teratogen that is absorbed through the skin. Use this chemical in a fume hood along with appropriate PPE according to institutional regulations.\nDilute the GREB1 intron (labeled with Atto 647N) and GREB1 exon (labeled with Quasar 570) probes 1:300 in hybridization buffer. Mix via pipetting. Protect this buffer from light and use immediately.\n\tNOTE: The probes were designed and manufactured as detailed in Stossi et al7. The probes are usually provided as a dried oligonucleotide probe pool that must be reconstituted in RNAse-free TE buffer according to the manufacturer protocol14. The stock solution for these probes was 12.5 μM, therefore; the working concentration of the probes is 42 nM.\nPrepare a humidifying chamber for the overnight hybridization step. Lay down a piece of paraffin plastic film, unexposed side up, into a glass Petri dish cleaned with a surface decontaminant to remove RNases. Saturate two paper towels with sterile water and place them along the edges of the Petri dish to provide humidity, as drying can destroy specific labeling.\nAliquot the probes by dotting 30 µL of probes in hybridization buffer onto the clean side of the paraffin plastic film. Distribute the aliquots of probes so that the coverslips do not come into contact with each other.",
    "Using sterilized forceps, gently flip the coverslips cell side down onto the probes in the glass Petri dish. Avoid air bubbles and do not apply pressure to the coverslips.\n\tNOTE: Do not discard the tissue culture plate with the 2x SSC buffer, as it will be needed for subsequent steps.\nSeal the glass Petri dish with paraffin plastic film and cover the plate with foil to prevent light exposure to the fluorophores. Incubate overnight, up to 16 hours, at 37 °C on a flat non-rotating surface. Time of incubation can be varied empirically, however a minimum of 4 hours is recommended.\n\tNOTE: The coverslips are susceptible to sliding around when incubating in the hybridization buffer, which can lead to dry spots on the coverslip and damage the sample.\n5. Preparing samples for imaging \nThe next day, remove the coverslips from the humidifying chamber using forceps and return them to the 24 well plate with the cell side up. Add 500 µL of fresh 2x SSC buffer plus 10% formamide to wash out excess probe and non-specific hybridization.\n\tNOTE: Protect the samples from light from this point onwards.\nWash the cells twice with 500 µL of 2x SSC buffer plus 10% formamide for 15 minutes each at 37°C on a heated rotator.\nCounterstain DNA with DAPI at 1 µg/mL in 2x SSC buffer for 10 minutes at room temperature on a rotator.\nWash one time with 2x SSC buffer for 5 minutes at room temperature.\nMount the coverslips onto glass slides using non-hardening mounting media after removing any excess 2x SSC buffer with a paper towel and a quick wash in nuclease free water to eliminate excess salts. Finally, seal the coverslips with clear nail polish.\n6. High resolution microscopy and image processing",
    "Image the samples on a wide-field epifluorescence microscope using a 60x or 100x oil objective and a sCMOS camera. See the table of materials for the specific microscope and objective used for this experiment.\n\t\nComplete imaging as soon as the samples are fully processed to avoid time-dependent degradation of the signal.\n\t\tNOTE: Immersion oil with a refractive index (RI) of 1.516 is used in this experiment. Empirical testing should be performed to match the oil RI to specific samples, as RI mismatches will result in aberrations of the point spread function that will affect image deconvolution.\nImages are captured with a lateral pixel size of 0.10827 µm.\nOptimize the amount of illumination from the light source (i.e., percent transmittance) and exposure times for each channel (DAPI, TRITC, CY5 filters in this particular example) using the sample that is expected to have the highest intensity (i.e., positive controls). In this experiment, the E2-treated sample is expected to have higher intensity for both GREB1 probe sets. Generally, the percent transmittance for GREB1 intron and exon probes is 50 – 100%, and the exposure times range from 0.25 – 0.60 seconds.\nAdditionally, acquire images under conditions that avoid photobleaching and/or any saturation of camera pixels. In our experience, there should be a minimum ~ten-fold difference between the background and the signal intensity. Saturation of few pixels/field can occur due to non-specific signals in the sample (i.e., dirt on the coverslip, probe aggregates outside the cell), which can be acceptable, but only if saturated regions are not included in quantitation.",
    "To set acquisition of a z-stack, focus on the sample in the DAPI channel. Select the top and the bottom of the z-stack at the distances where the DAPI stained nuclei become out of focus. The z-stack step size we used is 0.25 µm per slice and the total z-stack should span the whole cell (about 10 µm in MCF-7 cells). However, the z-stack step size will change according to the objective used and should follow the Nyquist sampling criterion.\n\tNOTE: Introns are usually present only in the nucleus; however, exons are both in the nucleus and the cytoplasm. Therefore, setting the z-stack as described above will capture most of the intron and exon labeling as the z-stack encompasses the whole cell.\nTypically, image a minimum of 200 cells for quantitative analysis in preliminary experiments to capture a snapshot of the magnitude of response and variation between cells.\nSome imaged cells are excluded from the final analysis (i.e., drop-out rate) because they will be filtered out by the analysis pipeline (i.e., cells touching the border of the image, apoptotic/mitotic cells).\n\tNOTE: When selecting image areas, there are a few factors to keep in mind. Choose areas with evenly spread, non-overlapping cells as defined by DAPI-labeled, nuclear fluorescence. Additionally, try to select areas that have the least number of nuclei along the edges of the image area to avoid counting partial cells. Automated, unbiased imaging is always preferred for experiments requiring statistical analysis.",
    "After acquisition, deconvolve images using an aggressive restorative algorithm using 10 cycles (i.e., number of iterations). Generate max-intensity projections for image analysis (omit this step if specific 3D analysis is required). Save all projection images according to the bit depth of the camera used; in our case 16-bit TIFF grayscale images were saved. RGB images have a reduced bit depth resulting in a loss of information; therefore, RGB images are not suitable for image analysis.\n7. Image analysis \nRead the instructions and download the jupyter notebook from github (https://github.com/pankajmath/RNA_FISH_analysis).\nInstall Python anaconda distribution (https://www.anaconda.com/distribution/) version 3.6 or higher.\nOpen anaconda prompt and type in the installation command to Install Simple ITK for anaconda (https://anaconda.org/SimpleITK/simpleitk).\nOpen anaconda navigator and launch jupyter notebook. It will open a web browser showing directories and files. Browse through the directory structures to reach the directory containing the downloaded jupyter notebook from github.\nOpen the notebook and run each cell by pressing Shift and Enter simultaneously.\nFollow the details of each function and step provided in the notebook. For a different set of images, one may have to change some parameter values.\n\tNOTE: In brief, nuclei are segmented from the DAPI channel using local thresholding with a block size of 251 pixels, holes were filled and objects smaller than 100 pixels removed. Touching nuclei were split using a watershed algorithm. The nuclear mask was then dilated by 100 pixels and watershed was used to separate touching objects using nuclei as basins. To identify steady state RNA (exons), Otsu thresholding was used; for transcriptional active alleles (intron), first a Gaussian blur (sigma=1) was applied and then max entropy thresholding was used.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}