{
  "id": 17809,
  "origin_website": "Jove",
  "title": "Robot-Assisted Radical Antegrade Modular Pancreatosplenectomy Including Resection and Reconstruction of the Spleno-Mesenteric Junction",
  "procedures": [
    "The procedure described herein was conducted in compliance with the guidelines set out by the Ethics Committee of Pisa University Hospital for robotic operations, including regulations on research activity.\nNOTE: The patient is a 70-year-old female with a 3 cm pancreatic ductal adenocarcinoma located in the body of the pancreas close to the neck of the gland. The patient presented with abdominal pain. Her past medical history demonstrated arterial hypertension and appendectomy. Total-body contrast-enhanced computed tomography (CT) showed a hypoenhancing pancreatic tumor strictly adherent to the spleno-mesenteric junction, with associated upstream dilation of the main pancreatic duct (Figure 1). No distant metastasis was identified making the tumor potentially resectable with curative intent.\n1. Experimental pre-operation\nPatient selection\n\t\nEstablish a diagnosis of pancreatic cancer, by either biopsy or unequivocal imaging findings.\nRule out distant metastasis by total-body contrast-enhanced CT scan. Perform the scan within 4 weeks of surgery14.\nAssay tumor markers (CEA and Ca 19.9).\n\t\tNOTE: High preoperative levels of Ca 19.9 have prognostic implications15, but low levels do not call into doubt the indication for surgery16.\nEnsure that the patient is fit for surgery and eligible for a minimally invasive approach17,18.\nDo not perform RAMPS during the learning curve19.\nDo not accept patients with tumors clearly involving the large peripancreatic vessels, until proficiency is achieved with standard RAMPS.\nPatient preparation\n\t\nProvide standard pre-surgical preparation.\nProvide vaccination against encapsulated bacteria (Streptococcus pneumoniae, Neisseria meningitidis, Haemophilus influenza type B) to prevent overwhelming post-splenectomy sepsis20.\nEquipment\n\t\nEnsure the availability of a robotic system.\n\t\tNOTE: So far, only one robotic system (Table of Materials) has been used for pancreatic resections18. Herein a last generation robotic system is used. The docking technique and the targeting procedure are those specific to this system.",
    "Ensure that standard laparoscopic equipment and the following robotic instruments are available: small and medium hem-o-lok clip appliers, Maryland bipolar forceps, monopolar curved scissors, harmonic shears, and large needle drivers.\nIn case of vein resection, ensure that the following instruments are available: robotic black diamond micro forceps and laparoscopic bulldog clamps.\nEnsure that all necessary sutures and consumables (Table of Materials) are available.\nEnsure that a laparoscopic stapler is available.\n2. Surgical preparation\nAnesthesia17\nAssess operative risk by providing a grade according to the American Society of Anesthesiologists' (ASA) classification of Physical Health.\nPlace at least one large bore (14 G or 16 G) intravenous cannula in a peripheral vein. Place a central venous line in patients with limited possibility of peripheral vein cannulation.\nMonitor electrocardiogram, arterial pressure (cannulation of radial artery), capnography, pulse oximetry, urinary volumes, and body temperature.\nProvide general anesthesia.\n\t\tNOTE: Both inhalation and intravenous anesthesia can be used.\nProvide deep neuromuscular blockade (rocuronium bromide: 0.075-0.1 mg/kg).\nInsert a nasogastric tube.\nDuring surgery, perform blood gas analysis to verify blood gases and pH.\nAt the end of the procedure, reverse anesthesia and remove the nasogastric tube.\nOperation setting\n\tNOTE: A schematic view of the operating room setup is provided in Figure 2.\n\t\nHave the main surgeon operate from the robotic console.\nHave a laparoscopic surgeon (first assistant) stand between the patient's legs. He or she operates suction, introduces and withdraws sutures, helps with retraction, and fires staplers.\nHave an assistant surgeon stand on the left side of the patient. He or she exchanges robotic instruments and assists the laparoscopic surgeon.\nHave a scrub nurse stand on the right side of the patient.\nPlace the patient supine, with the legs parted (French position) on an operating table equipped with a thermic blanket (Figure 3A).",
    "Place intermittent pneumatic compression cuffs around the legs (Figure 3B), for prophylaxis of deep vein thrombosis.\nSecure the patient to the operating table with wide bandings (Figure 3C).\nPrep the patient as to widely expose the abdomen (Figure 3D). Include the suprapubic region to permit a Pfannenstiel incision for specimen extraction.\n\t\tNOTE: For all the other aspects the patients have to be prepared as for major laparoscopic surgery in cooperation with the anesthesia team17.\n3. Preparatory surgical maneuvers and docking of the robotic system\nEstablish a pneumoperitoneum, using either a Veress needle or an open technique. Maintain pneumoperitoneum at approximately 10 mmHg.\nPlace the 8 mm robotic camera port just below or just above the umbilicus, depending on individual abdominal configuration.\n\tNOTE: The camera port should be approximately 10−15 cm from the closest boundary of the target anatomy.\nInsert the robotic laparoscope and explore the abdomen searching for occult metastatic deposits. Biopsy any identified nodule and send it for frozen section histology. If no metastasis is discovered, place the other ports.\nPlace all ports along the transverse umbilical line. Place the 12 mm assistant port along the right pararectal line. Place the remaining robotic ports along the anterior axillary line, on either sides, and along the left pararectal line (Figure 4).\n\tNOTE: Ideal port spacing is 6−8 cm. A minimum space of 4 cm can be accepted. Ensure 2 cm space between ports and bony prominences.\nAdjust the operating table in reverse Trendelenburg position (15−20°) and tilt it towards the patient's right side (5−8°) (Figure 5). Position the robotic tower where staff will not be walking or standing to maximize patient access from the bedside.\nTo begin docking, align the laser crosshair of the boom over the camera port (Figure 6A). Use robotic arm number 2 for the camera.",
    "Direct the camera arm between L and E on the FLEX icon at the base of the robotic arm (Figure 6B).\nClutch and point the camera to target the operative anatomy (Figure 6C). Execute targeting by pressing the dedicated button on the camera head.\n\tNOTE: Targeting automatically adjusts height, translation, and rotation of the overhead boom to maximize the range of motion of the robotic arms. The remaining arms are docked (Figure 6D), and the robotic instruments are inserted under vision.\n4. Pancreatectomy\nOpen the lesser sac by dividing the reflection of colon and omentum. Do not go through the gastrocolic ligament as this could result in omental infarction21.\nStart dissection midway along the transverse mesocolon and extend to the right until the hepatic flexure of the colon is reached, and to the left until the splenic flexure of the colon is fully mobilized. Once the lesser sac is fully open, the pancreatic body and tail become clearly visible.\nBegin dissection of the peritoneum along the inferior margin of the pancreas, to allow mobilization of the body-tail of the pancreas.\nIdentify the superior mesenteric vein.\n\tNOTE: The superior mesenteric vein is a key landmark to proceed safely with further dissections.\nIn preparation for the creation of a tunnel behind the pancreatic neck, identify the common hepatic artery and the portal vein above the pancreatic neck. Resect lymph node number 8A to bring the common hepatic artery in clear view.\nSeal as many lymphatic vessels as possible using either hem-o-lok clips or ligatures. Once the course of the common hepatic artery is clearly defined, dissect the lymphatic tissue laying between the artery and the superior margin of the pancreatic neck to bring the portal vein in clear view.",
    "Tag the common hepatic artery with a vessel loop to increase visibility and facilitate handling of the vessel during the procedure.\nPerform dissection around the major arteries using cold scissors as the use of energy devices may result in thermal injury to the vessel walls, thus potentially increasing the risk of delayed bleeding22. Peel off the common hepatic artery, the celiac trunk and the first portion of the splenic artery by the surrounding lympho-neural tissues to have a clear picture of the vascular anatomy.\n\tNOTE: In the accompanying video, an injury occurs to the dorsal pancreatic artery. The bleeding was fixed with a 5/0 polypropylene suture. Ligature and division of the dorsal pancreatic arteru would have been required anyway as this maneauver improves exposure of the origin of the splenic artery and offers more room for safe ligature of this large artery.\nDivide the splenic artery between ligatures or clips. Apply two ligatures proximally and divide the vessel between two hem-o-lok clips. Whenever possible, divide the splenic artery before dividing the splenic vein, as this prevents the occurrence of sinistral portal hypertension, thus reducing blood pooling in the spleen and the amount of backwards bleeding.\n\t\nAlternatively, use a stapler, loaded with a vascular cartridge.\n\t\tNOTE: A tunnel behind the neck of the pancreas is developed at this stage. However, as suspected at pre-operative imaging, the tumor was strictly adherent to the spleno-mesenteric junction, making it preferable to further mobilize the specimen in order to achieve wider control of all vascular pedicles, before proceeding with vein resection and reconstruction.\nIdentify the superior mesenteric artery, to the left side of the superior mesenteric vein. Peel off the superior mesenteric artery 180° on its left aspect.",
    "Identify the inferior mesenteric artery and save to be used as a vascular patch at the time of vein reconstruction. During perivascular dissections, clip large lymphatics to reduce the amount of lymphatic leak.\nBegin dissection medial to lateral in a posterior plane to remove a large amount of the retroperitoneal soft tissue en-bloc with the specimen. Identify the left adrenal gland during this stage. Further to the left, remove the Gerota fascia covering the upper pole of the left kidney en-block with the specimen, thus uncovering the anterior surface of the upper renal pole. The left renal vein and the left adrenal vein are clearly identified.\nDivide the inferior mesenteric vein between clips. Spare a segment of the vein for vascular reconstruction. Dissect the splenic vein free proximal to the site of the tumor adherence to achieve upstream vascular control.\nPlace a transfix suture at the inferior margin of the gland to occlude the transverse pancreatic artery. Divide the neck of the pancreas. When enough room is available, use a laparoscopic or robotic stapler. Alternatively, divide the neck using harmonic scissors.\n\tNOTE: For the patient shown in the video, the pancreas was divided using harmonic shears because of the limited space available.\nIdentify, dissect, and ligate the main pancreatic duct. Close the transection surface in a fish-mouth configuration using interrupted sutures of 4/0 expanded polytetrafluoroethylene (e-PTFE).\nWhen possible, send the pancreatic margin for frozen section histology. Delay freezing the section of pancreatic margin after specimen extraction if the margin is perceived to be so close to the tumor that intracorporeal sampling appears troublesome.\n\tNOTE: In this patient, the transection margin was assessed after removal of the specimen because of the proximity of the tumor to the neck of the pancreas.\nDivide the splenic vein.",
    "NOTE: The vein should not be divided now if tumor proximity to the spleno-mesenteric junction poses concerns about the radicality of the procedure. In these instances, vein resection and reconstruction are required to achieve an R0 resection.\n5. Vein resection and reconstruction\nPlan for the most appropriate type of vein resection and prepare accordingly for reconstruction. If needed, identify a vascular segment suitable for reconstruction.\nAchieve control of all vascular pedicles.\nCross-clamp the splenic vein upstream to the site of the tumor involvement.\nCross-clamp the superior mesenteric artery to reduce the amount of blood pooling in the intestines during venous cross-clamping.\nCross-clamp the superior mesenteric vein and the portal vein.\nExcise the involved venous segment en-bloc with the specimen. Carry out a side-wall resection of the portal-mesenteric junction. Harvest the inferior mesenteric vein. Place an e-PTFE suture between the inferior mesenteric vein graft and the upper corner of the vein defect.\nIf a vascular patch is needed for closure of the vascular defect, suture the vascular patch using two half-running sutures of 6/0 e-PTFE.\nBefore releasing the clamps, flush the vein with saline solution containing sodium heparin using a ureteral catheter connected to a syringe.\n\tNOTE: The laparoscopic surgeon performs vascular flushing.\nRemove the bulldog clamps. Remove first the bulldog on the portal vein to check for bleeding sites at a lower pressure.\n6. Completion of dissection\nComplete clearance of retroperitoneal vessels. Dissect along the periadvential plane of the superior mesenteric artery in a cephalad direction.\nSkeletonize the right side of the superior mesenteric artery and remove the right celiac ganglion, if the tumor is located close to the neck of the pancreas, because of lymphatic drainage23 and path for neural invasion24.\nOnce the aortic plane is reached on the right side, perform the same dissection on the left side.",
    "Complete the posterior dissection. Remove the left celiac ganglion en-bloc with the specimen. When using harmonic shears, pay attention to the active blade that is opposite to the artery. When finer dissection is required, use cold scissors.\nDivide the short gastric vessels along the posterior surface and the upper margin of the pancreas.\nMobilize the spleen.\n7. Protection of retroperitoneal vessels\nMobilize the round and falciform ligaments.\nCover the naked retroperitoneal vessels with round and falciform ligaments.\n8. Specimen extraction and wound closure\nMake a Pfannenstiel incision (~5 cm).\nExtract the specimen and load in an endoscopic bag.\nClose the incision in layer and insufflate the abdomen for final exploration.\nClose the fascia of the 12 mm assistant port.\nPlace a 14 Fr pigtail catheter close to the pancreatic stump.\nDeflate the pneumoperitoneum.\nClose all incisions."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}