{
  "id": 13084,
  "origin_website": "Jove",
  "title": "FACS-Isolation and Culture of Fibro-Adipogenic Progenitors and Muscle Stem Cells from Unperturbed and Injured Mouse Skeletal Muscle",
  "procedures": [
    "All animal experiments performed were conducted in compliance with institutional guidelines approved by the Animal Care and Use Committee (ACUC) of the National Institute of Arthritis, Musculoskeletal, and Skin Diseases (NIAMS). Investigators performing this protocol must adhere to their local animal ethics guidelines.\nNOTE: This protocol describes in detail how to isolate FAPs and MuSCs from hind limb and injured tibialis anterior (TA) muscles of adult male and female mice (3-6 months) and provides guidelines for coculturing FAPs and MuSCs. An overview of the experimental procedure is shown in Figure 1. All steps of this protocol should be performed in sterile conditions and at room temperature (RT) unless otherwise specified.\n1. Reagent setup\nWash Medium (WM): Prepare this solution by adding 10% (vol/vol) horse serum and 1x penicillin/streptomycin to Ham's F-10 Nutrient Mix cell media. WM can be prepared in advance and stored at 4 °C.\nMuscle Dissociation Buffer (MDB): Prepare this buffer by dissolving Collagenase II in WM. If collecting whole hind limb muscles, dissolve 1000 U/mL Collagenase II in 10 mL of WM for each mouse (to be prepared into a 50 mL conical tube). If collecting TA muscles, dissolve 800 U/mL Collagenase II in 7 mL of WM for each mouse (to be prepared into a 15 mL conical tube). For TA muscles, this will help to better visualize cell pellets and obtain a higher yield of FAPs and MuSCs. Prepare MDB fresh before collecting the muscles and keep it on ice until needed.\nCollagenase II solution stock: Prepare this solution by dissolving Collagenase II in sterile 1x phosphate-buffered saline (PBS) to a final concentration of 1000 U/mL. Filter the solution through a 0.45 μm syringe filter and aliquot into 1 mL stocks. Store the solution at -20 °C.",
    "Dispase solution stock: prepare this solution by dissolving Dispase in sterile 1x PBS to a final concentration of 11 U/mL. Filter the solution through a 0.45 μm syringe filter and aliquot into 1 mL stocks. Store the solution at -20 °C.\nPrepare FAP's culture medium by supplementing DMEM with 10% (vol/vol) fetal bovine serum, 1x penicillin/streptomycin, and 2.5 ng/mL FGF. Store the medium at 4 °C.\nPrepare MuSC's culture medium supplementing F10 with 10% (vol/vol) horse serum, 1x penicillin/streptomycin, and 2.5 ng/mL FGF. Store the medium at 4 °C.\nPrepare the coculture medium by supplementing DMEM with 10% (vol/vol) fetal bovine serum, 10% (vol/vol) horse serum, 1x penicillin/streptomycin, and 2.5 ng/mL FGF. Store the medium at 4 °C.\n2. Hind limb muscle harvesting\nAdd 2-3 mL of WM in a 6 cm dish (one dish per mouse) and place it on ice.\nPerform euthanasia by asphyxiation: place the mouse in a CO2 chamber and introduce 100% CO2. Use cervical dislocation to confirm death.\nPlace the mouse supine on a dissection pad and spray it with 70% (vol/vol) ethanol to avoid contamination.\nUse forceps to pinch the center of the mouse belly skin and cut a ~1 cm opening horizontally. Grasp the wound edges and deskin the mouse by pulling the opening in opposite directions to uncover the muscles underneath. Expose one side of the mouse's hind limb at the time.\nBefore collecting muscles, remove intermuscular fat between the hamstrings and the proximal end of the quadriceps. This will improve the isolation of FAPs and MuSCs.\nWithout damaging the tissue, use sharp forceps to break and peel off the fascia to expose the underneath TA and extensor digitorum longus (EDL) muscles. Run the sharp tip of the forceps underneath the TA/EDL muscles to detach the muscles from the tibia.",
    "Cut off the tendons attaching the TA/EDL to the ankle and, while holding it with forceps, trim the muscles with scissors along the longitudinal line of the TA/EDL. Cut the tendons around the knee to detach the whole TA/EDL muscles. Place the muscles in a 6 cm dish kept on ice.\nProceed to isolate the gastrocnemius and soleus muscles by cutting all tendons at the ankle and detaching the muscles from the tibia and fibula. Cut around the knee and transfer the muscles to the 6 cm dish.\nPeel off the fascia around the quadriceps and separate it from the femur by running the sharp tip of the forceps between the muscle and the bone. Cut the tendons around the knee and, while holding the quadriceps with forceps at the distal end, trim the rest of the muscle by cutting along the femur. Place the muscles in the 6 cm dish.\nDetach the hamstrings and remaining muscles around the femur and transfer those to the 6 cm dish. Collect the hind limb muscles in a 6 cm dish kept on ice.\n\tNOTE: Avoid damaging blood vessels, when possible, to prevent formation of blood clumps that could interfere with the downstream isolation. If bleeding occurs, blot the excised vessel immediately with a sterile gauze to absorb the blood.\nCollect TA, EDL, gastrocnemius, soleus, quadricep, and hamstring muscles from the contralateral limb.\n\t​NOTE: When isolating the whole hind limb muscles, do not pool two or more mice. If isolating TA muscles, up to three TA muscles can be pooled.\n3. Mechanical and enzymatic muscle digestion\nAspirate WM from the 6 cm dish and add 1-2 mL of MDB to keep the muscles moist.",
    "Mince the muscles thoroughly until obtaining a slurry paste of well-minced tissue. To do so, use forceps to hold one end of a piece of muscle, then use a scalpel to tear and slice the muscle until less tight.\nUsing scissors, keep cutting the muscle into small pieces for 1-2 min. Repeat this step for each group of muscles until obtaining a well-minced muscle sludge.\n\tNOTE: This is a very critical step to maximize the yield of FAPs and MuSCs. It is recommended to spend 8-10 min (4-5 min if isolating TA muscles only) in this step to ensure a proper muscle mincing.\nTransfer the minced muscles from each mouse to the conical tube containing MDB.\nSeal the tubes with laboratory film and incubate in a 37 °C water bath with agitation (75 rpm) for 1 h. Place the tubes horizontally along the shaking path and use weights to keep the tubes submerged in water.\nThaw 1 mL of Collagenase II stock and 1 mL of dispase stock per mouse. Before use, spin the dispase stock in a swinging bucket rotor at 10,000 x g for 1 min at 4 °C. Use only the supernatant.\nIf whole hind limb muscles were collected, proceed as follows:\n\t\nAfter 1 h, remove the tube from the shaker and fill it to 50 mL with WM. Gently invert a couple of times to ensure mixing.\nCentrifuge the cells in a swinging bucket rotor at 250 x g for 5 min at 4 °C. Transfer 42 mL of supernatant into two new tubes (~21 mL in each tube) and leave ~8 mL in the original tube.",
    "Fill the new tubes containing 21 mL of the supernatant up to 50 mL with WM. Centrifuge the cells again in a swinging bucket rotor at 350 x g for 8 min at 4 °C. Aspirate all the supernatant and keep the pellets on ice.\nAdd 1 mL of collagenase II stock and 1 mL of dispase stock in the original tube containing ~8 mL of MDB.\nUsing a 5 mL serological pipette, resuspend the pellet 10 times without clogging. Eject the solution toward the wall of the tube, avoiding the formation of bubbles. If clogging occurs during resuspension, push the tip of the pipette against the bottom of the tube to mechanically disrupt the muscle chunks. Proceed to step 3.9.\nIf TA muscles were collected, proceed as follows:\n\t\nAfter 1 h, remove the tube from the shaker and fill them to 15 mL with WM. Gently invert a couple of times to ensure mixing.\nCentrifuge the cells in a swinging bucket rotor at 250 x g for 5 min at 4 °C. Transfer 13 mL of supernatant into one new 15 mL tube and leave ~2 mL in the original tube.\n\t\t\nFill the new tube containing 13 mL of the supernatant up to 15 mL with WM. Centrifuge the cells again in a swinging bucket rotor at 350 x g for 8 min at 4 °C. Aspirate all the supernatant and keep the pellet on ice.\nUsing a 1000 µL pipette tip, resuspend the pellet in the original tube up and down without clogging.\nAdd 1 mL of Collagenase II stock and 1 mL of dispase stock in the original tube containing 2 mL of MDB and fill up to 10 mL with WM. Proceed to step 3.9.",
    "Seal the tubes with laboratory film and incubate in a 37 °C water bath with agitation (75 rpm) for 30 min. Place the tubes as in step 3.5.\n4. Generation of mononucleated cells\nNOTE: If working with TA muscles collected in a 15 mL conical tube, transfer the suspension into a 50 mL conical tube before proceeding with step 4.1.\nAfter 30 min, remove the tube from the shaker. Aspirate and eject the muscle suspension through a 10 mL syringe with a 20 G needle successfully 10 times.\n\tNOTE: Eject muscle suspension toward the wall of the tube to avoid bubbles and foaming. Small pieces of undigested tendons or cartilages might clog the needle during the first rounds of aspiration. If clogging occurs, use sterile forceps to remove the clog from the tip of the needle.\nFill each tube up to 50 mL with WM and gently invert a couple of times to ensure mixing.\nCentrifuge the cells in a swinging bucket rotor at 250 x g for 5 min at 4 °C. Transfer supernatant into a new tube (~42 mL) and leave ~8 mL in the original tube.\n\t\nFill the new tube containing 42 mL of the supernatant up to 50 mL with WM. Centrifuge the cells again in a swinging bucket rotor at 350 x g for 8 min at 4 °C. Aspirate all the supernatant and keep the pellet on ice.\nPlace a 40 μm nylon cell strainer in the original 50 mL conical tube containing 8 mL of WM and pre-wet the cell strainer with 1-2 mL of WM.\nWhile holding the 40 μm nylon cell strainer, use a 10 mL pipette to gently resuspend the pellet 5-10 times. Filter the pellets through the cell strainer back into the same tube to minimize cell loss.",
    "At this step, ensure that there are additional tubes with cell pellets on ice. Filter those pellets back into the original tube by adding 4-5 mL of WM to each tube to resuspend the pellets and transfer the solution to the cell strainer positioned in the original tube. Allow filtering by gravity.\nAfter collecting all the pellets into the original 50 mL conical tube, rinse the cell strainer with another 4-5 mL of WM. Use a 1000 μL pipette to collect all the liquid from the underside of the cell strainer.\nFill each tube with WM up to 50 mL and gently invert a couple of times to ensure mixing.\nCentrifuge the cells in a swinging bucket rotor at 250 x g for 5 min at 4 °C. Immediately aspirate all the supernatant after centrifugation without disturbing the pellet.\nResuspend the pellet in 600 μL of WM and transfer it to a 2 mL microcentrifuge tube.\n5. Antibody staining for flow cytometry\nNOTE: For each experiment, set up the following controls: i) unstained control, ii) viability control to select for the live cell population, iii) single stained compensation controls to correct for fluorochrome emission spillover, and iv) fluorescence minus one (FMO) controls to set gating boundaries by accounting for spillover spread. Refer to Table 1 for a full list of staining controls.\nTo prepare unstained control, transfer 10 μL of the cell suspension into a 2 mL microcentrifuge tube containing 190 μL of WM. Resuspend the cell suspension and filter through a 5 mL polystyrene round-bottom tube with a 35 μm cell-strainer cap. Allow the suspension to filter by gravity.\nUse a 200 μL pipette to collect all the liquid from the underside of the cell strainer. Seal with a cap and leave it on ice, protected from light.",
    "Prepare viability, FMO, and single stained controls: label 10 2 mL microcentrifuge tubes and add 190 μL of WM into each tube and 10 μL of cell suspension. Refer to Table 1 for a full list of controls. Add antibodies to the appropriate tube depending on the experimental control. Refer to Table 1 for information regarding antibody combination and concentration.\nTransfer the rest of the cell suspension (500 μL) into a 2 mL microcentrifuge tube (experimental tube) and add the following antibodies: CD31-APC, CD45-APC, Sca1-Pacific Blue, VCAM-1-biotin, and α7-Integrin-PE. Refer to Table 1 for information regarding antibody combination and concentration.\nGently mix well each tube to ensure uniform distribution and incubate the cells in a rotating shaker at 4 °C for 45 min protected from light.\nAfter 45 min, fill all microcentrifuge tubes up to 2 mL with WM. Gently invert the tubes a couple of times to ensure complete mixing. Centrifuge the tubes in a refrigerated centrifuge with a fixed angle rotor at 250 x g for 5 min at 4 °C. Aspirate the supernatant without disturbing the pellet.\nResuspend the cells in all microcentrifuge tubes in 300 μL of WM.\nAdd streptavidin antibody into appropriate tubes. Refer to Table 1 for information regarding antibody combination and concentration. Gently mix well each tube to ensure uniform distribution and incubate the cells in a rotating shaker at 4 °C for 20 min protected from light. Leave the remaining tubes on ice, protected from the light.",
    "After 20 min, fill microcentrifuge tubes containing streptavidin antibody to 2 mL with WM. Gently invert the tubes a few times to ensure complete mixing. Centrifuge the tubes in a refrigerated centrifuge with a fixed angle rotor at 250 x g for 5 min at 4 °C. Aspirate the supernatant completely and resuspend cells in 300 μL of WM. \nPre-wet the 35 μm cell strainer cap of 10 5 mL polystyrene round-bottom tubes with 200 μL of WM. Filter cells from control tubes through the appropriate 5 mL polystyrene round-bottom tubes. Use a 200 μL pipette to collect all the liquid from the underside of the cell strainer. Seal with caps, leave the tubes on ice, and protect them from light.\nResuspend the cells in the experimental tube with an additional 200 μL of WM for a total of 500 μL of WM. Pre-wet a cell strainer cap of a 5 mL polystyrene round-bottom tube with 200 μL of WM. Transfer the cell suspension from the experimental tube into the 5 mL polystyrene round-bottom tube and allow it to filter by gravity.\nRinse the 2 mL microcentrifuge tube containing the experimental sample suspension with 300 μL of WM and pass it through the same strainer cap.Use a 200 μL pipette to collect all the liquid from the underside of the cell strainer. Seal with a cap, leave tubes on ice, and protect them from light.\n\tNOTE: If clogging of the 35 μm cell-strainer cap occurs, gently tap the tube on the bench to facilitate flow-through.",
    "Prepare and label the collection tubes for FAPs and MuSCs. If isolating cells from whole hind limb muscles, sort the cells in 5 mL polypropylene round-bottom tubes with up to 1 mL of either FAPs or MuSCs culture medium supplemented with 2x serum. If isolating cells from TA muscles, sort FAPs and MuSCs in 2 mL microcentrifuge tubes containing up to 400 μL of culture medium supplemented with 2x serum.\n6. Fluorescence-activated cell sorting (FACS)\nNOTE: This protocol employs a compact benchtop research flow cytometer equipped with a 100 μm nozzle and featuring a three-laser configuration (488 nm, 640 nm, 405 nm) with the capability to analyze up to nine different fluorochromes (11 parameters including the forward and side scatter). The fluorochromes used in this protocol and their associated detector bandpass filters are as follows: PE 586/42; PE-Cy7 783/56; APC 660/10; Pacific Blue 448/45; 7-Aminoactinomycin D (7-AAD) 700/54, GFP 527/32. Cells are sorted at 4 °C and remain on ice following the sort. Before operating this instrument, ensure that the user is properly trained by a technical applications specialist.\nSet up and performance check the cell sorter according to the manufacturer's specifications.\nSet up a hierarchical gating strategy to identify FAPs and MuSCs (Figure 2).\n\t\nIsolate FAPs based on the following scheme: i) forward cell scatter area vs side cell scatter area (FSC-A vs. SSC-A) to separate cells versus debris, ii) side cell scatter height vs side cell scatter width (SSC-H vs. SSC-W) to discriminate singlets from doublets in the SSC range, iii) forward cell scatter height vs forward cell scatter width (FSC-H vs. FSC-W) to discriminate singlets from doublets in the FSC range, and iv) 7-AAD area vs SSC-A to distinguish live versus dead cells.",
    "If isolating FAPs through the antibody-based method, use the following scheme: v) APC-CD45/CD31 area vs Pacific Blue-Ly-6A/E (Sca1) area to exclude CD31+ and CD45+ cells from further analysis, and vi) PE-Cy7-VCAM-1 area vs PE-α7-Integrin area from the CD31-/CD45-/Sca1+ population to distinguish FAPs. FAPs are identified as CD31-/CD45-/Sca1+/VCAM-1-/α7-Integrin- events.\nIf isolating FAPs through endogenous GFP reporter method, use the following scheme: v) APC-CD45/CD31 area vs GFP-PDGFRα area to exclude CD31+ and CD45+ cells from further analysis and isolate GFP+ cells. FAPs are identified as CD31-/CD45-/PDGFRα+/VCAM-1-/α7-Integrin- events.\nIsolate MuSCs based on the following scheme: i) forward cell scatter area vs side cell scatter area (FSC-A vs. SSC-A) to separate cells versus debris, ii) side cell scatter height vs side cell scatter width (SSC-H vs. SSC-W) to discriminate singlets from doublets in the SSC range, iii) forward cell scatter height vs forward cell scatter width (FSC-H vs. FSC-W) to discriminate singlets from doublets in the FSC range, iv) 7-AAD area vs SSC-A to distinguish live vs dead cells, v) APC-CD45/CD31 area vs Pacific Blue-Ly-6A/E (Sca1) area to exclude CD31+ and CD45+ cells from further analysis, and vi) PE-Cy7-VCAM-1 area vs PE-α7-Integrin area from the CD31-/CD45-/Sca1- population to distinguish MuSCs. MuSCs are identified as CD31-/CD45-/Sca1-/VCAM-1+/α7-Integrin+ events.\nRun the unstained control and viability control to ensure that the cell population is properly positioned in the SSC-A vs FSC-A plot and to properly gate on live single cells.\nAcquire all single stained controls and generate the spillover compensation matrix.\nRun all FMO controls and determine the cut-off point between background fluorescence spread and the positively stained population.\nApproximately 5-10 min before acquisition of the experimental sample, add 7-AAD viability dye and mix gently.\nOnce all controls have been processed, set the sort gates in accordance with the FMO controls; acquire and sort the experimental samples.",
    "After all samples have been processed, clean the cytometer according to the manufacturer's specification. Export all .fcs data for analysis.\n7. Culture of FAPs and MuSCs\nNOTE: Sorted cells should be cultured immediately after sorting, in an appropriate medium on collagen I coated plates.\nCentrifuge the collection tubes in a fixed angle rotor at 250 x g for 5 min at 4 °C.\nAspirate the supernatant without disturbing the cell pellet.\nFor MuSC's culture, resuspend the cells in an appropriate volume of MuSC culture medium and incubate them in standard conditions at 37 °C and 5% CO2.\n\t\nPlate freshly isolated MuSCs at a density of 20,000 cells/cm2 and activated MuSCs at a density of 15,000 cells/cm2.\nAfter plating, cells appear small, spherical, and translucent. Within 36 h, MuSCs adhere to the surface of the plate and slowly increase their size for the first 48 h.\nReplace the medium every 2 days.\n\t\tNOTE: MuSCs are very sensitive to cell density. To keep MuSCs in their proliferating state, grow them until they are 60%-70% confluent. Passage the cells into new collagen I coated dishes or plates and add new fresh medium every 2 days. If MuSCs are kept in the same dish or plate for longer than 3-4 days, they will acquire an elongated form and will align with neighboring cells until fusing together.\nFor FAP's culture, resuspend the cells in an appropriate volume of MuSC culture medium and incubate them in standard conditions at 37 °C and 5% CO2.\n\t\nPlate the FAPs isolated from unperturbed muscle at a density of 15,000 cells/cm2 and FAPs isolated from injured muscle at 9,000 cells/cm2.",
    "NOTE: After plating, FAPs completely adhere to the surface of the plate within 48 h, while activated FAPs attach to the plate within a few hours. Once they are attached, FAPs acquire their characteristic shape, with a small cell body and elongated cell processes, and they rapidly proliferate.\nReplace the medium every 2 days.\n\t\tNOTE: FAPs are very sensitive to cell density. Seeding FAPs at low densities can lead to poor cell growth and cell death. On the contrary, plating FAPs at high seeding density will boost cell survival and improve their expansion. FAPs deriving from damaged muscle usually require lower cell density than undamaged muscle, as they are already activated. It is recommended to adjust FAP plating density based on one's experimental conditions and on the source of the samples.\nFor coculture, resuspend FAPs and MuSCs in the coculture medium at a ratio of 1:1 and incubate those in standard conditions at 37 °C and 5% CO2. Allow the cells to attach for 48 h and replace the medium every 2 days.\n8. Immunofluorescence analysis of cultured FAPs and MuSCs\nAspirate the cell medium and perform two or three washes with 1x PBS.\nFix the cells with 2% paraformaldehyde (PFA) in 1x PBS for 15 min at RT.\nAspirate 2% PFA and quickly wash the cells two or three times with 1x PBS.\nPerform cell permeabilization and blocking:\n\t\nFor immunostaining of freshly isolated FAPs, perform cell permeabilization and blocking by incubating cells with 1x PBS + 0.1% Triton X-100 (PBST) + 1% bovine serum albumin (BSA) + 5% Normal Donkey Serum (NDS) for 30 min at RT.\nFor immunostaining of freshly isolated MuSCs, perform cell permeabilization and blocking by incubating cells with PBST + 1% BSA + 5% Normal Goat Serum (NGS) for 30 min at RT.",
    "Apply primary antibodies:\n\t\nFor immunostaining of freshly isolated FAPs, apply goat anti PDGFRα primary antibody (1:300) diluted in PBST + 1% BSA + 5% NDS overnight at 4 °C.\nFor immunostaining of freshly isolated MuSCs, apply mouse anti Pax7 primary antibody (1:10) diluted in PBST + 1% BSA + 5% NGS for 45 min at RT.\nWash the cells two or three times with 1x PBS to remove the primary antibody solution.\nApply secondary antibodies:\n\t\nFor immunostaining of freshly isolated FAPs, apply donkey anti-goat IgG (H+L) Alexa Fluor 488 secondary antibody (1:500) diluted in PBST + 1% BSA for 1 h at RT.\nFor immunostaining of freshly isolated MuSCs, apply goat anti-mouse IgG1 Alexa Fluor 555 secondary antibody (1:500) diluted in PBST + 1% BSA for 45 min at RT.\nWash the cells two or three times with 1x PBS to remove the primary antibody solution.\nPerform nuclear counter-staining by incubating cells with DAPI in PBST (1:1000) for 5 min at RT.\nWash the cells three times with 1x PBS to remove the DAPI solution.\n\tCAUTION: DAPI is toxic and hazardous; handle it with care and dispose it in the hazardous waste bottle.\nStore the cells at 4 °C protected from the light.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}