{
  "id": 9686,
  "origin_website": "Jove",
  "title": "Single Drosophila Ommatidium Dissection and Imaging",
  "procedures": [
    "1. Dissection of the Drosophila retina\nFill a one well of a 3-Well Glass Slide with phosphate buffered saline (PBS 1X), and then anesthetize flies by CO2. Both males and females can be used for this experiment.\nOnce the flies are anesthetized, pick up a single fly using forceps and drop it into the small dish of PBS.\nUnder a dissecting scope, pinch the proboscis with forceps, and then detach the head from the body by severing the neck using a second set of forceps.\nHolding the fly head from the proboscis, cut in half along the left/right midline the fly head with microscissors to reveal the brain.\nUse a cut pipette tip to pick up the retina, and transfer to a second well of the 3-Well Glass Slide filled with Schneider medium.\nFirst, peel away most of the head cuticle and then remove the brain with forceps.  Keep the retina sandwiched between the lamina and the cornea.\nNext, transfer the retina onto a drop (50 μl) of fresh Schnieder medium placed directly of the glass slide.\n2. Dissection of the ommatidia\nDepending on the final purpose of the dissection (whether immediate imaging or culture) and on the optics of the fluorescent microscope (direct or inverted), this step can take place either on a microscope slide or in a 24-well plate. For the final purpose of this dissection, the ommatidia will be dissected directly onto the glass slide.\nGrasp either the most dorsal or ventral end of the retina with forceps.  Using microscissors, cut the retina in half along the dorsal/ventral midline to expose the ommatidia in the middle of the eye.",
    "Continue to grasp the retina such that the cornea is facing down and the lamina is facing up. Using a fine tungsten needle, detach the ommatidia from the lamina and the cornea.\nSingle ommatidia and groups of ommatidia will collect on the bottom of the well or slide. Remove any larger debris that may have collected before proceeding.\n3. Treatment, staining and imaging\nTo analyze autophagy, dilute 1:1000 Lysotracker in the Schneider drop (first dilute 1:10 in Schneider and then add 0.5 μl to the drop on the slide), mix and wait 10 seconds.\nRemove the excess liquid from the slide, being careful to leave the ommatidia behind. This is done best with a fine gel loading tip.\nAdd a drop of Vectashield to cover the ommatidia, apply a coverslip and seal with nailpolish.\n4. Representative Results: \nThe good execution of the protocol should leave a number of single ommatidia and of small groups of ommatidia kept together by fragments of lamina but nicely separated on the corneal side. These can be imaged as in this example to visualize Atg8:GFP and Lysotracker, showing autophagosomes, lysosomes and autophagolysosomes (Fig. 3). The method can be used for live imaging, however in this case it is to be noted that autofluorescence of the Schneider’s medium will make it difficult to distinguish low intensity fluorescent signals. An additional issue is that the pigment granules that remain attached to the photoreceptors are intensely fluorescent, especially in the red channel. A brightfield picture may be required to distinguish them from genuine organelles.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2882/2882fig1.jpgFigure 1. Flow chart of the dissection procedure to obtain single ommatidia or small groups of ommatidia from the fly retina.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2882/2882fig2.jpgFigure 2. Possible variations of the simple protocol here describe that involve fly genetics and ageing upstream of the dissection and staining or culturing for up to 24 hours and drug administration downstream of the dissection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2882/2882fig3.jpgFigure 3. Confocal scan of autophagosomes and lysosomes in a single ommatidium dissected from a w; GMR-Gal4, UAS-Atro75QN; UAS-GFP::Atg8/+ fly, expressing a polyglutamine Atrophin mutant and aged 12 days at 29°C. The brightfield panel (top right) displays the almost intact structure of the ommatidium and the frame indicates the scanned area. Red marks Lysosomes, green the autophagosomes, auto-lysosomes, resulting by the fusion of the two organelles, appear yellow. The arrowheads indicate two ongoing fusion events between autophagosomes and lysosomes. Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}