{
  "id": 19234,
  "origin_website": "Jove",
  "title": "Gene Transfer for Ischemic Heart Failure in a Preclinical Model",
  "procedures": [
    "1. Myocardial infarct creation\nFemale Yorkshire pigs (20kg) from Animal Biotech Industries (Doylestown, PA) are pre-medicated using Telazol (tiletamine/zolazepam) (8.0 mg/kg) and Buprenorphine (0.6 mg).\nAnimals are intubated and then ventilated with 100% oxygen. General anesthesia is maintained with Propofol (5-8mg/kg/hr) throughout the procedure.\nThe femoral site is prepared with 70% isopropyl alcohol followed by povidone iodine. A percutaneous puncture provides access to the artery and for sheath placement. After sheath insertion, 3000-5000 IU of heparin is administered IV to maintain an activated coagulation time of 250-300 seconds.\nA bolus dose of Amiodarone (75 mg) is administered intramuscularly. Intravenous injection of a 1000 ml saline bag with  Amiodarone (75 mg), Atropine (2 mg), and Potassium Acetate (20 mEq) is started and maintained using a rate of 150 ml/hr throughout the procedure.\nA 7 Fr hockey-stick catheter (Cordis; Miami, FL) is advanced to the left coronary artery and a coronary angiography is performed. A 0.014-inch guide wire (Abbott, Park, IL) is advanced into the left anterior descending coronary artery (LAD). An 8-mm-long, 4.0-mm VOYAGER over-the-wire balloon (Abbott, Park, IL) is advanced and positioned at the proximal LAD, and the coronary balloon is inflated to 3 atm. Occlusion of the LAD is confirmed by angiogram.",
    "With continuous electrocardiogram and hemodynamic monitoring, the occlusion is maintained for 90 minutes. Malignant ventricular arrhythmias may occasionally occur within the first 40 minutes, in which case immediate delivery of direct current shocks from 200 J to 300 J are administered. Usually there are two peak time frames of arrhythmia, one between 2 and 10 minutes and the other between 25 and 35 minutes after the balloon inflation. Diligent monitoring and immediate defibrillation are key to the successful myocardial infarct creation, since there are more than 95% incidence of entering ventricular fibrillation within the time frames indicated. If the immediate and appropriate defibrillation is performed, survival rate is very high. If the blood pressure drops under 80 mmHg, volume load is accomplished with rapid intravenous saline infusion.\nThe balloon is deflated and all the devices are removed.\nThe sheath is removed from the femoral artery, anesthesia is withheld, and the animal is monitored during recovery. Intravenous saline with Amiodarone, Atropin and Potassium Acetate infusion is decreased at 50 ml/hr and is given overnight. An intramuscular injections of Nitroglycerline and Furoscemide is administered. Then the animal is allowed to recover and careful ECG monitoring is continued for at least 3 hours.\nAspirin (200mg) PO will be given for five days.\nCommon complications during and after the myocardial infarct creation procedure are coronary dissection, puncture site hematoma, arrhythmia, and heart failure. A refine technique and thorough monitoring is required to prevent and manage these complications.\n2. Virus Injection\nThe animals are prepared as indicated above in the myocardial infarct creation steps1-3. The same dose of heparin should be given to prevent thrombosis during the virus injection.",
    "A 5Fr hockey stick catheter (Cordis; Miami, FL) is advanced to the left coronary artery. After the angiogram, two of 0.014-inch guide wires are advanced, one into the LAD and one into the left circumflex coronary artery (LCX) to fix the position of the catheter.\nArterial blood (-20 ml) is drawn from the catheter. To prevent the ischemia during the infusion, half diluted blood is used for solution. The virus is mixed with 10 ml blood and diluted to 20 ml with saline. The remaining 10 ml is also diluted to 20 ml and used deliver residual virus within the catheter lumen.\nIntravenous nitroglycerin (20 μg/min) is started through the ear vein.\nThe catheter tip is placed at the proximal left main tract. The pressure through the catheter is monitored to ensure that the catheter is not wedging.\nThe virus mixed blood (15 ml) is injected through the catheter over 15 minutes using an infusion pump into the left coronary artery. After 15 minutes, the syringe is exchanged to the flush, and infusion is continued for 10 minutes.\nA wire and a catheter are fixed to right coronary artery the same way as left coronary artery.\nThe remaining 5 ml of blood mixed with virus  is injected into the right coronary artery for 5 minutes followed by 10 minutes of flush.\n3. Representative Case",
    "Figure 1 shows the left ventriculography at 1 month after the myocardial infarct creation. The left ventricular wall motion is significantly impaired with an ejection fraction (EF) of 31%. Figure 2 shows the cross sections of the left ventricle at 1 month. A large scar from the base to the apex of the anterior wall is seen. The average EF at 1 month after myocardial infarction in this model is 36% and the average end diastolic volume is 83 ml, whereas the average of those in the same sized animal without a myocardial infarction is 68% and 42 ml, respectively. Figure 3 shows the expression of beta-gal in the left ventricular border zone area 1 month after the injection of adeno-associated virus (2 x 1012 DNAse resitant particles of rAAV1 CMV Lac-Z). An enhanced expression was found in the virus injected area.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2778/2778fig1.jpg\nFigure 1. Ejection fraction measured from left ventriculography 1 month after myocardial infarct creation. Left ventricle is dilated to 92.5 ml and anterior wall motion is significantly impaired.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2778/2778fig2.jpg\nFigure 2. The cross sections of the left ventricle at 1 month after myocardial infarct creation, stained by triphenyl tetrazolium chloride to delineate the scar area. A large scar from the base to the apex of the anterior wall is seen.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2778/2778fig3.jpg\nFigure 3. Beta-gal expression induced by adeno-associated virus (2 x 1012 DNAse resistant particles of rAAV1 CMV Lac-Z). An enhanced expression is found at the border zone area between the infarction and the normal tissue, 1 month after the intracoronary virus injection. Right lower picture shows the negative control, where only normal saline was injected in the coronary arteries using the same protocol.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}