{
  "id": 6972,
  "origin_website": "Bio",
  "title": "Expression and Purification of <em>Arabidopsis</em> Transmembrane Protein BCM1 in  <em>Saccharomyces cerevisiae</em>",
  "procedures": [
    "Transformation of S. cerevisiae with pDR296-His-BCM1 plasmidThe nucleotide sequences encoding mature BCM1 (amino acid 55-382) with depletion of N-terminal chloroplast transit peptide from Arabidopsis is cloned into the yeast expression vector pDR296. The construct contains an N-terminal histidine (His) tag to facilitate purification of BCM1 by means of immobilized nickel-affinity chromatography (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200921/20200921230009_0057.jpgFigure 1. Plasmid map of pDR296-BCM1. Unique restriction sites and important features in the plasmids are indicated. PMA1 promoter, transcription promoter for the S. cerevisiae plasma membrane ATPase 1 (PMA1) gene. ADH1 terminator, transcription terminator for the S. cerevisiae alcohol dehydrogenase 1 (ADH1) gene. 2μ ori, yeast 2μ plasmid origin of replication. TRP1, tryptophan biosynthesis protein. AmpR, the gene encoding β-lactamase, which confer resistance to ampicillin.Streak out a glycerol stock of S. cerevisiae L40ccua on a YPDA agar plate and incubate the plate at 30 °C for two days.Inoculate 5 ml of YPDA medium with 1 colony of S. cerevisiae L40ccua in a 14 ml Falcon tube and grow at 30 °C and 250 rpm overnight.Transfer the overnight culture to 100 ml YPDA medium in a 250 ml Erlenmeyer flask and continue to grow at 30 °C and 250 rpm for 2-4 h until the optical density at 600 nm (OD600) of the culture reaches between 0.4-0.6.Harvest cells by centrifugation at 1,000 x g for 5 min at room temperature using rotor JA-25.50.Resuspend cells in demineralized water by vortexing for 5-10 s and harvest then cells by centrifugation at 1,000 x g for 5 min at room temperature using rotor JA-25.50.Resuspend cells in 1.5 ml TE/LiAc buffer (the cell titer is ~3 x 109 cells/ml). These are now yeast competent cells.Add 0.1-0.2 μg pDR296-His-BCM1 plasmids, 10 μl of denatured salmon sperm DNA, and 100 μl of yeast competent cells to a 1.",
    "5 ml Eppendorf tube and mix them well by pipetting for 2-3 times.Add 600 μl of freshly prepared PEG/LiAc buffer to the tube and mix them well by vortex for 5 s.Incubate the mixture at 30 °C for 30 min with shaking at 200 rpm.Add 70 μl of DMSO to the culture and mix well by gentle inversion.Heat the tube in a 42 °C water bath for 15 min, do not shake.Place the tube on ice for 1-2 min.Pellet cells by centrifugation at 12,000 x g for 5 s at room temperature using rotor FA-48-45-11.Resuspend cells in demineralized water and harvest then cells by centrifugation at 12,000 x g for 5 s at room temperature using rotor FA-48-45-11.Resuspend cells in 200 μl of 1x TE buffer and spread 100 μl of the transformation mixture on a SD/-Trp agar plate.Incubate the agar plate at 30 °C for 2-4 days until emergence of colonies. Pick a single colony from the transformation plate using a sterile pipette tip and inoculate 5 ml of YPDA medium in a 14 ml Falcon tube at 30 °C and 250 rpm overnight.Add 250 μl of 80% (v/v) glycerol to 750 μl of the overnight culture in a 1.5 ml Eppendorf tube and mix well by vortexing for 5 s.Flash freeze the tube in liquid nitrogen and store the glycerol stock at -80 °C for future use.Large scale expression of His-BCM1 in S. cerevisiae Streak out a glycerol stock of transformed S. cerevisiae L40ccua on a SD/-Trp agar plate and incubate the plate at 30 °C for two days.Inoculate 50 ml of SD/-Trp medium with 2-3 colonies of S. cerevisiae L40ccua from Step B1 in a 200 ml Erlenmeyer flask and grow at 30 °C and 250 rpm overnight.",
    "Transfer the overnight culture to 1 L of SD/-Trp medium in a 2 L Erlenmeyer flask and grow at 30 °C and 250 rpm for 3-4 h until the OD600 of the culture reaches between 0.4-0.6.Harvest cells by centrifugation at 1,000 x g for 5 min at 4 °C using rotor FA-48-45-11.Flash freeze the pellet in liquid nitrogen and store at -80 °C for future use.Analyze the expression of His-BCM1 in S. cerevisiae cells by immunoblotting (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200921/20200921225924_1364.jpgFigure 2. Immunoblotting analysis of His-BCM1 expression in S. cerevisiae. Lane 1: total lysate of untransformed S. cerevisiae cells. Lane 2: total lysate of transformed S. cerevisiae cells. Total yeast proteins were stained with Coomassie Brilliant Blue (CBB, upper panel) and probed with BCM1 antibody (lower panel), respectively. The immunoblotting analysis was conducted as described previously (Wang et al., 2020).Purification of His-BCM1 from total yeast membrane extractsThaw the S. cerevisiae cell pellet obtained in Step B5 on ice.Resuspend the cells in chilled 20 ml of 1x phosphate-buffered saline (PBS) buffer supplemented with 2 tablets of protease inhibitor.Add 3 g chilled glass beads and vortex at maximum speed 5-7 times for 1 min, each time keeping the cells on ice for 1 min between vortexing.Remove unbroken yeast cells and glass beads by centrifugation at 1,000 x g for 5 min at 4 °C using rotor JA-25.50.Transfer supernatant to a clean 14-ml ultracentrifuge tube using a plastic pipette and pellet total yeast membranes by ultracentrifugation at 40,000 x g for 30 min at 4 °C using rotor SW 40-Ti.Resuspend the yeast membrane pellet in 10 ml of chilled solubilization buffer by gentle pipetting for 5-10 times.Incubate the suspension on ice at 100 rpm for 30 min.",
    "Pellet insoluble debris by centrifugation at 40,000 x g for 30 min at 4 °C using rotor SW 40-Ti and transfer the supernatant to a clean 50 ml tube.Add 1 ml of the Ni-NTA agarose resin (pre-equilibrated with solubilization buffer) in the supernatant and mix on a roller mixer at 4 °C for 1 h.Transfer the suspension to a 10 ml disposable plastic spin column and let the suspension run through by gravity.Wash the Ni-NTA agarose resin with 10 ml of wash buffer and let the wash buffer run through by gravity.Incubate Ni-NTA agarose resin with 2 ml of elution buffer on ice for 1-2 min and collect then flow through.Remove aggregates in the elute by centrifugation at 20,000 x g for 10 min at 4 °C using rotor FA-48-45-11.Dialyse the elute against 1 L of dialysis buffer at 4 °C for 1 h. Change the dialysis buffer and dialyse at 4 °C overnight.Transfer the elute to clean 1.5 ml Eppendorf tubes.Add 50 μl of glycerol to 1 ml of the elute and mix them well by gentle pipetting for 3-5 times.Divide the protein solution into 100 μl aliquots on ice.Flash freeze the aliquots in liquid nitrogen and store at -80 °C for future use.Analyze the purified His-BCM1 protein using 12% SDS-PAGE (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200921/20200921225716_7628.jpgFigure 3. SDS-PAGE analysis of purified His-BCM1. Lane M: protein marker; Lane 1: Purified His-BCM1 (approximately 36.5 kDa) indicated by the arrow; Lanes 2-4: 0.5, 1, and 2 μg bovine serum albumin standard."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}