{
  "id": 8154,
  "origin_website": "Bio",
  "title": "Retrovirus Mediated Malignant Transformation of Mouse Embryonic Fibroblasts",
  "procedures": [
    "Retroviral supernatants are prepared as previously described, at a titer of 106 to 107 viral particle per ml of viral supernatant (Pear et al., 1993).Note: Do not freeze/thaw supernatant, and use within 6 months. Primary MEFs are generated from embryonic day 13.5 (E13.5) embryos by passing the embryonic body (excluding head, liver and intestines) through a 21-gauge needle and syringe followed by repeated pipetting into a 10-cm tissue culture dish (1 embryo per dish) in 1 ml of DME medium containing 10% (v/v) FCS (DMEM/FCS). It is not necessary to obtain a single cell suspension at this stage, as trypsinisation at later stages will produce a single cell suspension and excessive manipulation at this stage promotes cell death. Add 9 ml of DMEM/FCS and mix to combine.Primary MEFs are then incubated in 10% CO2 incubator at 37 °C for 2-3 days undisturbed. MEFs are washed once in PBS, trypsinised, trypsin inhibited with DMEM/FCS and pelleted at 485 g for 5 minutes. MEFs are split ~1:2 into a T75 tissue culture flask and incubated in 10% CO2 incubator at 37 °C overnight so that cells are ~60-70% confluent the following day. On the next morning, aspirate the supernatant and wash once with PBS. Combine the retroviral supernatant containing LMP-p53.1224 shRNA, DMEM/FCS and polybrene using the following recipe: Retroviral supernatant          1.5 ml (i.e., ~1:7 dilution)DMEM/FCS                          8.5 mlPolybrene (1,000x stock)     10 μl (4 μg/ml)Total                                     10 mlAfter ~7-8 h of infection, repeat step 6, and leave the fresh retroviral supernatant overnight. On the next day, aspirate the supernatant, wash cells once with PBS, replace with fresh DMEM/FCS, and incubate at 37 °C overnight. On the following day, replace medium with fresh DMEM/FCS containing 5 μg/ml puromycin (LMP-p53.1224 shRNA construct has a puromycin selectable marker), and leave for 2 days, if not confluent.",
    "Otherwise, split as necessary. At the end of puromycin selection on day 3, cells are washed once with PBS, trypsinised and seeded so that cells are ~60-70% confluent in a T75 flask the following day. Culture cells in DMEM/FCS without puromycin and incubate overnight at 37 °C. On the next day, repeat steps 6-8, but with retroviral supernatant containing pWZL-HRasV12 cDNA. The two tranductions should be performed sequentially, as suggested, so that p53 knockdown and immortalization precedes HRasV12 overexpression. This ensures the best efficiency of transformation since HRasV12 overexpression with inefficient p53 knockdown results in senescence.On the following day, replace medium with fresh DMEM/FCS containing 300 μg/ml hygromycin (pWZL-HRasV12 cDNA construct has a hygromycin selectable marker) for 6 days. Replace with fresh hygromycin after 3 days, and split cells when necessary. At the end of hygromycin selection on day 7, replace with fresh DMEM/FCS without hygromycin. Passage cells as necessary for another 10-14 days to allow HRasV12 to drive cell proliferation. These transformed cells can now be used for in vitro or in vivo experiments. For example, cells can be injected subcutaneously into the flank of nude mice to assess tumour growth rate in vivo. The cells can be frozen and stored in liquid nitrogen, or can be continuously passaged, however extended passaging will result in additional genetic aberrations based on the knockdown of p53."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}