{
  "id": 13375,
  "origin_website": "Jove",
  "title": "Defined Xeno-free and Feeder-free Culture Conditions for the Generation of Human iPSC-derived Retinal Cell Models",
  "procedures": [
    "The protocol described in this paper follows the guidelines of the Institut de la Vision's research ethics committee. The Institut de la Vision has been allowed the manipulation of human specimen according to the current French regulation. Specimen handling follows patient data protection in accordance with the Tenets of Helsinki, and national regulations after the ethical approval of the \"Comité de Protection des Personnes (CPP) Ile-de-France V\".\n1. Preparation of Culture Media and Dishes\nCulture media\nUse iPSC medium, a chemically defined medium dedicated to pluripotent stem cell culture in feeder-free conditions16. Prepare 500 mL of medium according to the manufacturer's protocol.\nUse Basal iPSC (Bi) medium, the iPSC chemically defined medium without fibroblast growth factor 2 (FGF2) or transforming growth factor Beta (TGFß).\nPrepare 500 mL of Bi medium supplemented with 1% N2 supplement (BiN2 medium), 10 units/mL of penicillin, and 10 mg/mL of streptomycin.\nPrepare 500 mL of proneural N2-based medium (ProN2 medium) composed of DMEM:Nutrient Mixture F-12 (DMEM/F12, 1:1, L-Glutamine), 1% MEM nonessential amino acids, 1% N2 supplement, 10 units/mL of penicillin, and 10 mg/mL of streptomycin.\nPrepare proneural B27-based medium (ProB27 medium) composed of DMEM:Nutrient Mixture F-12 (DMEM/F12, 1:1, L-Glutamine), 1% MEM nonessential amino acids, 2% B27 supplement, 10 units/mL of penicillin and 10 mg/mL of streptomycin.\nCulture vessel preparation\nFor human iPSC culture\nPrepare 10 mL of a vitronectin solution containing 5 μg/mL of vitronectin in 1x PBS. In 10 mL of 1x PBS, add 100 µL of the thawed vitronectin stock solution (100x).\nDistribute 2 mL of the vitronectin solution per 6-cm culture dish corresponding to 0.5 µg/cm2. Incubate it for 1 h at room temperature (RT). Remove the vitronectin solution by aspiration using a vacuum-aspiration system or a 5 mL pipette.\nAdd 4 mL of iPSC medium per 6-cm dish.",
    "Incubate the dishes in a cell culture incubator at 37 °C and 5% CO2 for a minimum of 30 min before use.\nFor human iPSC-derived RPE (hiRPE) cell culture\nUse a pluripotent stem cell-qualified matrix or substrate to coat wells according to the manufacturer's protocol. Add sufficient matrix or substrate to cover the entire growth surface area. For example, put 300 µL of matrix per well in 24-well plate and 3 mL of matrix in a T-25 cm2 flask.\nIncubate the coated culture vessels for a minimum of 1 h at 37 °C. Remove the matrix using vacuum-aspiration systems or a 5 mL pipette.\nAdd 1 mL of ProN2 medium per well on 24-well plates and return the culture vessel to the incubator for a minimum of 30 min to warm and equilibrate the medium. For T-25 cm2 flasks, see step 5.2.\n2. Maintenance and Expansion of Human iPSCs\nMaintenance of human iPSCs\nPrepare 3 mL of iPSC medium in a 15 mL tube and keep it at RT for a minimum of 15 min before use. Prepare a coated 6-cm dish as described in 1.2.1.\nThaw a cryogenic sample of human iPSCs from a liquid nitrogen tank or a -150 °C freezer by incubation in a water bath at 37 °C for 30 s.\nCarefully disinfect the cryogenic vial using a disinfectant solution spray. Transfer the thawed human iPSCs from the cryotube to the 15 mL tube containing 3 mL of iPSC medium pre-warmed at RT.\nCentrifuge the tube at 110 x g for 3 min. Remove the supernatant by aspiration using a vacuum-aspiration system or a 5 mL pipette.",
    "Resuspend the cell pellet with 1 mL of iPSC medium from a vitronectin-coated 6-cm culture dish using a 2 mL pipette and transfer the cells back to the dish. Return the dish to the incubator at 37 °C and 5% CO2 for a minimum of 24 h before changing the medium.\n\t\tNOTE: A ROCK inhibitor, such as Y-27632 at 10 µM, can be added to the iPSC medium in the 6-cm culture dishes to reduce apoptosis.\nChange the medium daily and pass the human iPSCs every week.\nPassaging of human iPSCs\nPass the human iPSC at a 70 - 80% confluence, classically after 7 days in culture.\nPrepare 6-cm dishes for the passaging as described in step 1.2.1. Remove the iPSC medium from the dishes with confluent iPSCs and add 2 mL of a dissociation solution for 6 min at RT.\n\t\tNOTE: The incubation time depends on the iPSC clones. Try a 6 min incubation as a start.\nRemove the dissociation solution using vacuum-aspiration systems or a 5 mL pipette and add 2 mL of iPSC medium pre-warmed at RT. Resuspend the iPSC colonies by pipetting them up and down 5 - 10x with a 1,000 µL pipette.\n\t\tCAUTION: Avoid single cell dissociation from excessive pipetting.\nTransfer 30 to 200 µL of resuspended cell clumps in a new 6-cm culture dish. Return the dishes to the cell culture incubator at 37 °C and 5% CO2 for a minimum of 24 h before changing the medium.\n\t\tNOTE: The volume of resuspended cell clumps needed for the passaging depends on the iPSC clones.\nChange the medium daily and pass the human iPSCs every week.\n3. Generation of Retinal Organoids\nStart the iPSC differentiation following the protocol schematized in Figure 1A when the colonies reach a 60 - 70% confluence (Figure 1B).",
    "Prepare 4 mL of Bi medium per 6-cm dish. Warm the Bi medium to 37 °C. Change the iPSC medium to Bi medium. Note this time as day 0 (D0).\nAt D2, switch the cultures in the Bi medium to a BiN2 medium, previously warmed at 37 °C. Change the medium every 2 - 3 days.\nIdentify emergent self-forming retinal organoids by neuroepithelium buds, as shown in Figure 1C - 1E.\n\tNOTE: These early retinal organoids, corresponding in their developmental stage to the optic cup, can be manually isolated for downstream experimentation.\n4. Maturation of Retinal Organoids\nAt D28, prepare 6-well plates containing 4 mL/well of ProB27 medium initially supplemented with 10 ng/mL of FGF2 (Figure 1A).\n\tNOTE: Add FGF2 immediately before the media is added to the plates.\n\tCaution: Do not filter FGF2.\nRecover the retinal structures from the 6-cm dishes manually. To do this, isolate the structures making perpendicular striations with the needle around the neuroepithelial bud, as shown in Figure 1E, and detach the organoids by gently scratching them with the needle.\nAspirate 10 - 15 organoids using a 1,000 µL pipette and transfer them in a single well of the 6-well plate containing ProB27 medium.\nKeep the retinal organoids in floating culture conditions in ProB27 medium in a cell culture incubator at 37 °C and 5% CO2. Change half of the medium every 2 - 3 days.\n\tNOTE: Treat the organoids with FGF2 until D35.\nAt D35, remove half of the medium and add fresh prewarmed ProB27 medium at 37 °C without FGF2.\nChange half of the medium every 2 - 3 days during the time required to obtain the desired retinal cell types according to the emergence of retinal cell types, as depicted in Figure 2.",
    "5. Generation and Amplification of Human iPSC-derived RPE (hiRPE) Cells\nGeneration of human hiRPE cells\nEngage the iPSCs in differentiation when the colonies reach a 60 - 70% confluence, following the protocol schematized in Figure 3A.\nPrepare 4 mL per 6-cm dish of Bi medium and warm the Bi medium at 37 °C. Change the iPSC medium to Bi medium. Note this time as day 0 (D0).\nAt D2, switch the cultures in the Bi medium to a BiN2 medium previously warmed at 37 °C. Change the medium every 2 - 3 days.\nAt D28, change the medium to a fresh ProN2 medium previously warmed at 37 °C as depicted in Figure 3A.\n\t\tNOTE: This step can be done after the organoid picking described in step 4.\nChange the ProN2 medium every 2 - 3 days.\nAt D42, identify emergent hiRPE cells by the observation of pigmented patches as shown in Figure 3B.\n\t\tNOTE: The pigmentation of hiRPE cells appears between D35 to D56 depending on the iPSC clones.\nAmplification of hiRPE Cells\nAt D42, prepare a 24-well plate previously coated with the matrix as described in step 1.2.2 and containing 1 mL of ProN2 medium per well. Place the plate for 15 min in the incubator at 37 °C and 5% CO2 before use.\nRecover the hiRPE patches from the 6-cm dish manually. To isolate patches, make a perpendicular striation with the needle around the pigmented epithelium and detach the sheet by gently scratching it with the needle. Aspirate 10 pigmented patches using a 1,000 µL pipette and transfer them in a single well of the 24-well plate.",
    "Keep the hiRPE patches in ProN2 medium in a cell culture incubator at 37 °C and 5% CO2 for 48 h before changing the medium. Note this hiRPE cell passage as 0 (hiRPEp0). Change the medium every 2 - 3 days with ProN2 medium.\nPass the hiRPEp0 cells when the cells are confluent.\n\t\t\nRemove the medium using vacuum-aspiration systems and wash each well 1x with 1 mL of PBS using a 5 mL pipette.\nDiscard the PBS using vacuum-aspiration systems, add 200 µL per well of 0.25% trypsin, and incubate it for a minimum of 15 min in an incubator at 37 °C. Add 800 µL of ProB27 medium to inactivate the trypsin.\n\t\t\tNOTE: The use of ProN2 medium to stop the trypsin activity is not recommended.\nDissociate the sheet of hiRPE cells by pipetting it up and down. Place the cell suspension in a 15 mL tube and centrifuge it for 5 min at 110 x g.\n\t\t\tNOTE: An additional wash can be done with ProN2 medium to remove the excess of ProB27 medium.\nRemove the supernatant and gently resuspend the cell pellet in 2 mL of ProN2 medium pre-warmed at 37 °C. Count the cells with a cell counter.\nTake 1.25 million cells and place them in a matrix-coated T-25 cm2 flask (see step 2.2.2) containing 5 mL of ProN2 medium pre-warmed at 37 °C. Note this hiRPE cell passage as 1 (hiRPEp1).\nKeep the hiRPE cells in the ProN2 medium in a cell culture incubator at 37 °C and 5% CO2 for 48 h before changing the medium.\nChange the media every 2 - 3 days. When the hiRPEp1 cells reach confluence, perform the next passage or cryopreservation.\n6. Cryopreservation of Retinal Organoids and hiRPE Cells\nFor whole retinal organoids",
    "Select 5 to 20 retinal organoids using a transfer pipet and place them in a cryogenic vial. Remove any excess medium with a 1,000 µL pipette without touching the organoids at the bottom of the tube and add 250 µL of cold cryopreservation medium (see Table of Materials).\nFreeze the vials in an isopropanol-based freezing container at -80 °C for a minimum of 4 h. Transfer the frozen vials to a -150 °C freezer or liquid nitrogen tank for long-term storage.\nFor hiRPE cells\nAt passage 1, dissociate the hiRPE cells when the cells are confluent.\n\t\tNOTE: A cryopreservation of hiRPEp0 cells is not recommended.\nAspirate the medium from the T-25 cm2 flask using vacuum-aspiration systems and wash it 1x with 3 mL of PBS using a 5 mL pipette.\nRemove the PBS using vacuum-aspiration systems, add 1 mL of 0.25% trypsin, and incubate it for a minimum of 15 min in an incubator at 37 °C. Add 5 mL of ProB27 medium to stop the trypsin activity.\n\t\tNOTE: The use of ProN2 medium to inactivate trypsin is not recommended.\nDissociate the sheet of hiRPE cells by pipetting it up and down using a 10 mL pipette. Count the cells with cell counter. Place the cell suspension in a 15 mL tube and centrifuge it for 5 min at 110 x g.\n\t\tNOTE: An additional wash can be performed with ProN2 medium to remove the excess of ProB27 medium.\nAspirate the supernatant using vacuum-aspiration and gently resuspend cells to obtain 2 million cells in 250 µL of cryopreservation medium.\nTransfer 250 µL of cell suspension per cryogenic vial. Freeze the vials in an isopropanol-based freezing container at -80 °C for a minimum of 4 h.",
    "Transfer the frozen vials to a -150 °C freezer or a liquid nitrogen tank for long-term storage.\n7. Thawing of Retinal Organoids and hiRPE Cells\nThawing of whole retinal organoids\nWarm ProB27 medium at 37 °C (2 mL will be required for each cryogenic vial).\nFrom the liquid nitrogen tank or -150 °C freezer, thaw a cryogenic vial containing retinal organoids in a water bath at 37 °C for 30 s. Disinfect the cryogenic vial carefully using a disinfectant solution spray.\nOpen the vial and add 1 mL of pre-warmed ProB27 medium. Transfer the organoids to a 1.5 mL tube with a transfer pipette. \nRemove the medium gently by pipetting it without touching the retinal structures at the bottom of the tube. Wash the organoids 1 more time with 1 mL of the pre-warmed ProB27 medium.\nAspirate the organoids with a transfer pipet and place them in 1 well of a 6-well plate containing ProB27 medium pre-warmed and equilibrated in an incubator at 37 °C and 5% CO2.\n\t\tNOTE: Place 10 - 15 retinal organoids per well of a 6-well plate.\nChange half of the medium every 2 - 3 days during the time required to obtain the desired retinal cell types according to their emergence, as described in Figure 2.\nThawing of hiRPE cells\nWarm ProN2 medium at 37 °C (8 mL will be required for each cryogenic vial).\nFrom the liquid nitrogen tank or -150 °C freezer, thaw a cryogenic sample of hiRPEp1 cells by an incubation into a water bath at 37 °C for 30 s. Disinfect the cryogenic vial carefully using disinfectant solution spray.",
    "Open the tube and add 1 mL of pre-warmed ProN2 medium and transfer the cell suspension to a 15 mL tube containing 2 mL of pre-warmed ProN2 medium. Centrifuge it for 5 min at 110 x g.\nRemove the supernatant and gently resuspend the cell pellet in 2 mL of ProN2 medium pre-warmed at 37 °C.\nCount the cells with a cell counter.\nTake 1.25 million cells and place them in the matrix-coated T-25 cm2 flask (see step 2.2.2) containing 5 mL of ProN2 medium pre-warmed at 37 °C. At this stage, note the passage as 2 (hiRPEp2).\nKeep the hiRPEp2 cells in ProN2 medium in the cell culture incubator at 37 °C and 5% CO2 for 48 h before changing the medium.\nChange the media every 2 - 3 days. When the hiRPE cells reach confluence, perform the next passage or cryopreservation.\n\t\tNOTE: After 2 weeks in culture, 8 - 10 million hiRPE cells can be collected for further experimentations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}