{
  "id": 19380,
  "origin_website": "Jove",
  "title": "Use of a Foot-Induced Digitally Controlled Resistance Device for Functional Magnetic Resonance Imaging Evaluation in Patients with Foot Paresis",
  "procedures": [
    "All the experiments were approved by the Institutional Review Board at Massachusetts General Hospital and performed as approved at the Athinoula A. Martinos Center for Biomedical Imaging. Subject consent for the use and sharing of de-identified data was obtained.\nNOTE: In the current study, the inclusion criteria were as follows: (1) right or left hemiparesis with residual leg movement from an ischemic/MCA stroke incurred ≥6 months earlier; (2) a Functional Ambulation Category (FAC) score30 of 4-5 (subject ambulates with an assistant to navigate stairs/uneven surfaces or without the help of an assistant); (3) a National Institutes of Health Stroke Scale (NIHSS)31 score of 5-14 (mild/moderate); (4) the ability to stand for 5 min and walk 10 m; (5) aged 18-80 years old. Following initial testing, an additional criterion was included, which involved verifying that the subjects could move the pedal through at least 5° of motion with the paretic foot. Data were collected on demographics, stroke risk factors, the duration of physical/occupational therapy, the length of the hospital stay during the acute stage, medication use, intercurrent infections, and complications.\n1. Subject screening and preparation\nDuring recruitment, meet with the potential subjects, and test their ability to move the device's pedals with their paretic foot.\n\t\nCheck the fit of each subject's foot in the device's foot pedals. For subjects with smaller feet, test the fit of their feet when wearing sneakers or similar footwear that are MR-safe.\nSubjects who cannot exert sufficient force to move the pedal through at least a 5° range of motion with the device un-energized should be excluded from the study.\nPrior to arrival, instruct the subjects to bring the tested footwear if this was determined to be necessary during the pre-screening. Record the subject information, and obtain informed consent according to the institutional protocol.",
    "On each testing day, screen the subjects for contraindications as specified by the MR facility policy. Obtain signed waivers in cases of subjects with tattoos with the potential for irritation and/or burning sensations and any other facility-specific waivers.\nInstruct the subject to change into a facility-approved gown/pants and to wait to be called into the scanner room. Store the subject's belongings as per facility policy. If determined to be needed, instruct the subject to put on the footwear.\n2. Setup of the controlled-resistance foot device\nNOTE: It is recommended that the completion of steps 2.1-2.3 occurs prior to the subject's arrival.\nSetup in the MRI support room\n\t\nPlace the HV amplifier unit with the attached DAQ module on the floor close to the penetration panel. Plug the AC power cord into the wall outlet, plug the HV coaxial cable into the HV amplifier terminals and into the MHV coaxial plug on the penetration panel, and plug the sensor cable into the corresponding plug on the penetration panel. Turn on the main power switch of the HV amplifier.\nPlug the USB B plug of the USB cable into the DAQ module and the USB A plug of the cable into the USB repeater cable. Lay the USB repeater cable out from the MRI support room to the MRI control room, and fasten the cable to the floor using adhesive tape as necessary to prevent dislodgement by staff or subject ambulation about the facility.\nActivate scanner room projector.\nSetup in the MRI control room\n\t\nPlace the foot-device host laptop adjacent to the MRI scanner interface, plug in the power supply, and power up the laptop. Start the MATLAB application, and load the user interface (UI) program.",
    "Plug the MRI scanner button box/trigger signal USB cable, the scanner room projector cable, and the USB repeater cable into the laptop.\nIf not previously set up, adjust the laptop monitor settings so that the main window is extended onto the projector screen to the right of the main laptop window. Move the mouse pointer off the right side of the main laptop window, and confirm that it moves into the field of view of the projector screen. Move the mouse pointer back to the main window.\n\t\tNOTE: The trigger signal and projector cable formats may differ between facilities. Video adapters or similar units may be necessary.\nSetup in the scanner room\n\t\nVerify that the scanner table is fully outside of the scanner bore and lowered completely.\nMount a head coil into its corresponding slot on the scanner table. Remove the top section of the coil, and place it to the side. Cover the scanner table cushions and the lower section of the head coil with a hospital bed sheet.\nMount the projector screen into the bore at the opposite end from the scanner table.\nInsert two pairs of brass mounting screws into the coil mounting slots toward the foot end of the scanner table, and place the foot device between the screw pairs. Loosely attach plastic retaining brackets to the screws and alignment holes in the base plate of the foot device (Figure 1A).\nAttach the sensor and HV cables to the plugs on the penetration panel. Ensure the cables are not looped around the table or otherwise at risk of pinching or tangling when the table is moved into the scanner bore. Ensure that the sensor and HV cables are extended without loops between the foot device and the penetration panel.",
    "Start the UI program in the control room (run the m-file script), and verify that communications have been established between the host laptop and the DAQ module by observing the confirmation message in the UI (Figure 3).\nAccept the default force level proportions on the initial UI dialog by clicking on the OK button. Wait for confirmation dialogs to appear and dismiss themselves and for the initial force and displacement live graph window to appear.\nEnsure that, while one staff member moves the pedal of the foot device through its range of motion and another staff member observes the force and displacement traces, the displacement trace moves from −35° to +18° and back and that the force trace shows positive forces for motions in the dorsiflexion direction, negative forces for motions in the plantar flexion direction, and returns to zero at rest. This confirms the function of the sensors, DAQ module, HV amplifier, and ERF actuator (Figure 3A).\nIf the signals appear normal, click on Continue on the live graph window, and then the Shutdown button on the confirmation dialog. If not, check the cable connections and power connections, and redo the setup steps as necessary.\nSubject and foot device alignment\n\t\nEscort the subject from the waiting room into the scanner room. Perform metal screening as per facility policy to check for unreported objects or implants. Provide the subject with protective ear plugs.\nInstruct the subject to sit on the table and then to lie supine with their head nestled in the lower section of the head coil. Provide assistance as needed. Fit padding between the subject's head and the walls of the head coil to ensure that head motion is prevented during imaging.",
    "Instruct the subject to straighten their legs. Move the foot device toward/away from the subject until their heels (or the heels of their shoes) rest in the foot seats of the foot device. Adjust further to align the main pivot of the pedals with the subject's ankles.\nFasten the foot device in place using the plastic retaining brackets and plastic wing nuts.\nInstruct the subject to remove the foot not being tested from its pedal and rest it slightly proximal from the foot device. Support the non-tested leg with pillows as necessary. Fasten the tested foot into its foot device pedal with hook-and-loop retaining straps, ensuring the ball of the subject's foot (or the front of the subject's shoe) is in contact with the pedal.\n\t\tNOTE: In the current study, with the non-control (stroke) subjects, the stroke-affected foot was tested first. After the testing of the affected foot was complete, that foot was removed from the pedal, and the non-affected foot was mounted in the corresponding pedal using the same process as in step 2.4.5.\nProvide a squeeze-bulb alarm device to the subject, instruct them to squeeze the bulb to test it, and remind the subject that, at any time, they may squeeze the bulb to communicate with the technicians.\nRaise the MR table to full height so the subject can see the projection screen through the mirror assembly.\nInstall the upper section of the head coil, and mount the viewing mirror assembly over the head coil. Verify that the subject can see the projector screen clearly in the mirror.\n3. Subject strength testing",
    "Restart the UI. Accept the default force level proportions, or adjust them if required by the study protocol, and click on the OK button as above. When the force/displacement traces have appeared, instruct the subject to move the tested foot as far as possible in the dorsiflexion direction and return to full plantar flexion three times. Verify that the displacement and force traces appear normal as above. This establishes the range of motion for testing, which may be less than that of the full range of the foot device (Figure 3A).\nIf the results are acceptable, click on Continue on the live graph window and Yes - Proceed on the confirmation dialog; click on No-Retry if the subject did not follow the flexion instructions correctly; or click on Go to Shut down if there are other problems, and troubleshoot as necessary.\nWhen presented with the date/time confirmation dialog, click on Yes - Proceed on the dialog, or click on other options if a different filename or shutdown is desired.\nInstruct the subject to move their tested foot to full plantar flexion, and click on OK on the confirmation dialog. An instruction/metronome window will appear (labeled in Figure 3). Using the mouse, drag this window into the field of view of the projection screen, and click on OK to confirm that this has been completed.\nVerify that the instructions for the subject are displayed on the projector. Verify that the subject's foot remains in full plantar flexion, and click on OK on the corresponding dialog. The UI graph changes to the dynamometer display with indications of the resistance force set points.",
    "The visual metronome described above appears on the projection screen with a solid, target circle moving up or down on the screen at a constant speed and an open circular cursor controlled by the foot device pedal position. Instruct the subject to move their foot to cause the cursor to follow the motion of the target closely. If the subject can successfully move through their full range of motion while following the target, click on (Fd, Fp) + 10 on the live graph to increase the force set points for both dorsiflexion and plantar flexion (Figure 3B).\nObserve whether the subject continues to track the metronome motion accurately.\n\t\nIf so, click on (Fd, Fp) + 10 again to increase both the force set points. If dorsiflexion cannot be completed but plantar flexion continues to follow the target motion, click on (Fd, Fp) - 10 once and click on Fp + 10 twice to reduce the dorsiflexion resistance force by one step and increase the plantar resistance by one step.\nIf the dorsiflexion force has been set but the subject can no longer track the metronome in plantar-flexion, click on Fp - 10 once, and then click on Continue in the live graph window. The current force levels are used by the UI program as reference points for the proportionally reduced forces applied during the testing phase.\nIf the plantar flexion force set point has reached the maximum setting of the foot device, press Continue in the live graph, and proceed.\n\t\tNOTE: Step 3.7.3 generally occurs for control subjects with normal leg strength and for the unaffected limb in stroke subjects due to them exceeding the capabilities of the device, which is designed to focus on the strength in the affected limb.",
    "Record the force set points (shown on the right of the force trace plot) for future reference. Click on Yes - Proceed to continue, No - Test Again to repeat, or Shutdown if there are other problems. Instruct the subject to move the tested foot to full plantar displacement and then to relax.\nReview the use of the squeeze bulb, the scanning sequence, and the task with the subject, and answer any questions the subject may have prior to the initiation of the scans.\nInstruct the subject to close their eyes during this step. Use the scanner's landmarking laser line to locate the head coil/subject's head position. Move the table to center the subject's head within the scanner bore. Have the staff leave the scanner room and close the door.\n4. Running the MRI scan session and foot device task\nPerform facility-specific registration of the subject, and load the scan protocol. Notify the subject that the anatomical scan sequence will begin and that they may relax during this portion of the protocol, and instruct them to squeeze the bulb to verify their understanding. Initiate the anatomical scan, and wait for completion.\nAs directed by the dialog window provided by the UI, notify the subject that the fMRI and foot-device portion of the study will begin, and instruct them that they should ensure that their foot under testing is in full plantar flexion, that they should return their foot to full plantar flexion when a fixation cross appears on the screen, and that they should follow the visual metronome when it appears. Click on OK on the instruction dialog.",
    "Follow the instruction that directs the operator to prepare the scanner control computer to initiate the fMRI portion of the protocol. Click on OK in the instruction dialog window, and start the fMRI sequence. The UI program automatically sends the desired force settings to the DAQ module.\n\tNOTE: In the current study, the visual metronome task was performed three times each for the stroke-affected and unaffected limbs at force levels of 60%, 40%, and 20% of the maximum levels set in step 3.7. The force levels are updated automatically for each repetition of the test.\nThe subject views their instructions displayed on the projector screen. A \"+\" sign (fixation cross) appears, during which, as previously instructed, the subject rests.\nThe visual metronome target is displayed with the solid circle moving up and down at constant speed. As previously instructed, the subject moves their tested foot in dorsiflexion and plantar flexion to cause the open circular cursor to track the target.\n\tNOTE: In the current study, the rest (fixation cross) and active (metronome) phases were of equal length, and the cycle was repeated seven times. During the metronome phase, there were two cycles of dorsiflexion and plantar flexion through the range of motion. These parameters may be adjusted in the UI script for other studies. Each fMRI/metronome phase lasted approximately 5 min 40 s.\nRepeat step 4.4 and step 4.5 for a total of seven cycles, after which the fixation cross is displayed and the subject rests.\nRepeat steps 4.2-4.6 for a total of three cycles.\nEnter the MRI scanner room, and switch the foot mounted in the foot device as per step 2.4.5. Repeat protocol section 3 for the second foot.\nRepeat protocol section 4, bypassing step 4.1 and step 4.8 (registration, anatomical scan, switching foot).",
    "Notify the subject that the DTI portion of the scan will commence and that they may relax during this phase of the study, and instruct them to squeeze the bulb to confirm their understanding. Initiate the DTI scan, and wait for completion.\n5. Post-test operations\nMove the table and subject out of the scanner bore, and lower the table. Remove the mirror assembly, the upper head coil section, and the padding about the subject's head. The ear protection may be discarded at this time.\nAssist the subject to a sitting position and to move to the changing area if necessary. The subject may now change back into their regular clothing.\nTalk to the subject, address any post-test questions they may have, arrange the scheduling of future appointments, and complete the stipend payment forms prior to the subject's departure.\nDisassemble and pack the hardware, and unmount the ankle device from the scanner table. Detach the HV and sensor cables from the penetration panel. Detach the button box and monitor cables from the host laptop. Pack the ankle device and supporting hardware into carry cases.\nPerform facility-specific sanitation of the scanner table and relevant work surfaces and equipment.\nExtract the data from temporary folders on the scanner system for offline analysis. Perform log-out procedures.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}