{
  "id": 7342,
  "origin_website": "Bio",
  "title": "Isolation and Quantification of Mouse γδT-cells <em>in vitro</em> and <em>in vivo</em>",
  "procedures": [
    "Isolation, maintenance, and proliferation of DETCsGiven the important roles of DETCs, methods to investigate the regulation and function of these cells are required. This is facilitated by the ability to isolate and establish primary cultures of DETCs and reconstitute their intercellular crosstalk with different cells in vitro.Isolation and culture of DETCsIsolation of DETCs from the skin via FACS (Kashem and Kaplan, 2018)Euthanize C57BL6 pups of postnatal days 0 to 5 via decapitation or a method approved by the Institutional Animal Ethics Committee. Three to four pups are required for a 3.5 cm dish of cultured DETCs.Clean the surface of the pup using 70% ethanol to decrease the chances of microbial contamination.Remove the limbs and tail of each pup as close to the core body as possible using sharp scissors. Insert the scissors through the hole made by the removal of the tail and cut the skin along the dorsal midline of the body all the way to the neck.Using forceps, grasp the skin and peel the whole skin off of the body, taking care not to tear the skin into pieces. Rinse the peeled skin by placing it in a tube with 10 ml of sterile PBS containing 2× antibiotics (see Recipe 1) for 10 min. Then remove excess PBS by blotting the skin on a tissue.In a new 10 cm Petri dish containing 10 ml of 0.25% trypsin, place the skin with the dermis side down making contact with the solution. Avoid submerging the epidermis in the trypsin solution to prevent over-digestion of the epidermis. Spread out the curled edges using fine forceps to maximize contact of the entire dermis with the trypsin solution.Incubate the skin in trypsin for one hour at 37°C or overnight at 4°C.Note: Steps A7 to A9 are performed at room temperature.",
    "Separate the epidermis from the dermis using fine forceps. The separated epidermis will appear as a thin opaque sheet. The dermis can be used to isolate dermal cells such as fibroblasts (Kashem and Kaplan, 2018). To view a detailed protocol and video of epidermal cells isolation, refer to Li et al. (2017). Cut the epidermis into small pieces with scissors. Transfer the epidermis and trypsin mixture to a new 50 ml tube.Using a 10 ml serological pipette, repeatedly pipette the mixture of epidermis and trypsin up and down to facilitate the dissociation of the tissue into individual cells. The serological pipette might get blocked due to clumps of tissue. Tap the pipette to remove the clumps from the pipette.Keep on pipetting until it becomes easy to pipette up and down without tapping. Pipette the solution around 10 to 15 times slowly to properly remove the clumps.Pass the cell suspension through a 70 µm cell strainer into a new 50 ml tube. Also, pass 5 ml of E media without calcium (see Recipe 2) through the cell strainer to remove any cells that are trapped in the strainer, which would also inactivate the trypsin.Centrifuge the cell suspension at 250 × g for 10 min in a swing bucket rotor at 4°C.Remove the supernatant carefully using an aspirator. Wash the cells once with PBS by resuspending the cell pellet in 5 ml of PBS and centrifuging at 250 × g for 5 min each at 4°C.Resuspend the cells in 1 ml of staining buffer (see Recipe 3) for FACS sorting.Note: For Staining Buffer, use chelated fetal bovine serum since the presence of calcium might lead to the formation of cell clumps. Count the number of viable cells using trypan blue staining (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4148/bioprotoc-11-17-4148-g001.jpgFigure 1. Preparation of cells for counting.",
    "Bright-field image of the cell suspension under the microscope for automated counting. Scale bar: 50 μm.To prevent the nonspecific binding of antibodies, incubate the cells with anti CD16/CD32 (1 µg/million cells) for 5 min at 4°C. CD16/CD32 incubation prevents nonspecific binding of immunoglobulins to FcγIII, FcγII, and possibly FcγI receptors.From this epidermal cell suspension, make five aliquots of 50 µl each in five different FACS tubes. Add 50 µl of staining buffer to each 50 µl aliquot to match the volumes listed in Table 1 and label samples as indicated.Note: At least 100,000 cells are required to calibrate the flow cytometer. Table 1. Summary of control and analyte samples required for FACS analysis.  To calibrate the flow cytometer, various controls are required: unstained control (#1) and single stained and isotype controls (#2-5). For samples that are to be used to isolate DETCs (#6/analyte sample), cells are stained with all antibodies and resuspended in a staining buffer with 5 µl of 7AAD (Fluorochrome used to stain non-viable cells). Samples used for isolating DETCs might need to be diluted such that the event rate on the FACS machine is between 1,000-4,000 event/s (it is ideal to start with a higher concentration and dilute it later based on the event rate).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210901/20210901001009_2254.png After incubating the cells for 30 min in the dark, pellet the cells by centrifuging the tubes in a swing bucket rotor at 250 × g for 5 min at 4°C. Remove the supernatant carefully with an aspirator. Wash the cell pellet three times by resuspending it in 1 ml of staining buffer and centrifuging at 250 × g for 5 min at 4°C.DETCs can then be isolated using FACS, as explained in detail in Badarinath et al. (2019) and Nielsen et al. (2014).",
    "Other than primary DETCs, there is also a 7-17 DETC cell line, which can be used to study the effects of various factors on DETCs and their interactions with other cutaneous cells. The 7-17 cell line was originally established from FACS-purified DETC from AKR mice and expanded by repeated stimulation with concanavalin A (1 µg/ml) supplemented with rIL-2 (Edelbaum et al., 1995; Nielsen et al., 2014).Notes: Preparation of samples for flow cytometry and usage of the machine are complex processes and beyond the scope of this chapter. Before planning the FACS experiment, one should be familiar with the general background and theory of flow cytometry (Shapiro, 2003). For more details on the gating strategy while sorting, please refer to Wohn et al. (2014) and Havran et al. (1989). Culture of primary DETCs and 7-17 DETC cell lineBoth primary DETCs isolated by FACS and 7-17 DETC stable cell lines are cultured in RPMI 1640 media at 37°C, 5% CO2. The RPMI medium is supplemented with 10% FBS, 2 mM glutamine, 500 µl of Penicillin-Streptomycin (100×), 50 µM β-mercaptoethanol, 25 mM HEPES, 1 mM Na pyruvate, 100 µM nonessential amino acids, and 20 U/ml recombinant human IL-2 (Sharp et al., 2005; Nielsen et al., 2014).Primary DETCs and DETC cell lines can be cultured as suspension cultures by using ultra-low attachment culture plates. Every two days, remove half of the media by tilting the dish gently, allowing the cells to settle down and replenish with fresh media.Once cells become 70% confluent, passage them by collecting the total cell suspension into a 15 ml tube and centrifuge the cells at 300 × g for 5 min at room temperature. Remove the supernatant gently and resuspend the cells in 1 ml of fresh media.",
    "From this, add 200 µl to a new 10 cm dish containing 10 ml of fresh growth media and culture them in the same way as described above.In vitro cultures of DETCs are a useful platform to study their interactions with different cell types and the effect of various soluble factors. For example, DETCs can be activated by either cytokines secreted from neighbouring cells or by direct cell-cell interactions. It has also been observed that DETCs are activated by co-culturing them with hair follicle stem cells (Badarinath et al., 2019).Note: While culturing different cell types in co-culturing experiments, we should always be careful about the growth conditions of different cell types as inappropriate conditions for culturing any of the cell types can affect the cells in various ways such as stress, proliferation, and apoptosis. We can study the effect of various soluble secreted factors on the activation of DETCs. One method utilizes conditioned media from skin explants in which researchers examined the effect of IL-1α secreted from wounded keratinocytes on the activation of DETCs and is explained in detail in Lee et al. (2017) and Badarinath et al. (2019). Controls required for this experiment are DETCs treated with recombinant IL-1α and isolated DETCs from IL-1 receptor KO animals treated with IL-1α. The isolated cells can be utilized in experiments to determine the soluble and intercellular signals that affect both DETC behaviour (such as proliferation and activation) as well as its impact on neighbouring cells in the skin.Notes: For conditioning, use the same medium in which the subsequent culture experiments will be performed. Avoid serum in media for these experiments as serum will have its own effect on the cells.",
    "As an alternative control for DETC activation, these cells can be treated with recombinant IL-23 (10 ng/ml), recombinant IL-1beta (10 ng/ml), anti-CD3 (1 μg/ml), or combinations of these and scored for activation by measuring the expression of IL-17, FGF7, TNFα, and IFN-γ by ELISA or transcript levels as mentioned above. Proliferation assays for activated DETCs in vitro Elevated proliferation is one of the hallmarks of activated DETCs and can thus be used as a readout for activation. In addition to proliferation, other biomarkers of activated DETCs include the expression and secretion of various cytokines such as IL-17, FGF-7, TNFα, and IFN-γ. These secreted cytokines can be detected after 48 h using an ELISA kit (Nielsen et al., 2014) or are evident at the transcript levels after 24 h of treatment (Lee et al., 2017).Effect of secreted factors on DETCsFor proliferation assays, culture DETCs as explained earlier. When cells are 70% confluent, collect the cells in a 15 ml Falcon tube and centrifuge at 300 × g for 5 min at room temperature.Dilute the control and test conditioned media 1:3 with fresh RPMI media.Note: Preparation of conditioned media is explained in detail in Badarinath et al. (2019). Resuspend the cells in 100 µl of respective conditioned media and, from those, plate 30,000 cells in each well of a 96-well dish.Incubate the cells in 100 µl of conditioned media for 24 to 48 h at 37°C.After incubation, remove the media containing DETCs and quantify proliferation at different time intervals such as 24, 48, and 72 h.There are various assays available by which you can count the number of cells for proliferation assays after treatment with various stimuli such as the MTT cell proliferation assay, WST-1 cell proliferation assay, and trypan blue cell counting.",
    "Effect of various factors secreted by DETCs on hair follicle stem cellsNote: Isolate primary hair follicle stem cells as previously described in Nowak and Fuchs (2009). Treat DETCs with conditioned media from control or test skin/epidermal explants animal for 16-24 h.Collect the suspension culture in a 15 ml Falcon tube and centrifuge at 300 × g for 5 min. Collect the supernatant and discard the cell pellet.Dilute the conditioned media 1:5 with fresh E-media.Incubate hair follicle stem cells with diluted conditioned media for 24-48 h at 37°C, 7% CO2.Count the cells at different time intervals over the 24-48 h time period.In vivo analysis of DETC activationThe tissue microenvironment strongly dictates the regulation and function of DETCs. Under homeostatic conditions, DETCs have a distinctive dendritic morphology, but after injury or stress, DETCs proximal to the wound site acquire a rounded morphology and transiently lose their dendrites. In addition to morphological changes, another marker of DETC activation is an increased proliferative index. Upon activation, DETCs release certain cytokines that play a significant role in maintaining the protective physical and immune barrier of the murine skin. A variation in DETC function can aggravate skin-related autoimmune diseases, impede tumour eradication, or disrupt proper wound healing (Cruz et al., 2018). Hence, in vivo analysis of DETCs advances our understanding of the function of these cells in both physiological conditions such as wound healing and a variety of pathological scenarios including fibrosis, inflammatory diseases, and carcinomas."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}