{
  "id": 4552,
  "origin_website": "Bio",
  "title": "Assay of Ornithine Decarboxylase and Spermidine/Spermine N<sup>1</sup>-acetyltransferase Activities",
  "procedures": [
    "Sample preparation   Cell or tissue samples   Cell samples Resuspend cell pellets to ice-cold buffer A by pipetting up-and-down until cell suspension is homogenous; keep the samples on ice (Note 3, Note 4).   Tissue samples Weigh tissue and homogenize it on ice to 2-3x vol of buffer A by using Potter-Elvehjem homogenizer or other suitable homogenizer (Notes 3-4). For example, use 100 mg tissue and 200-300 µl of buffer A. Homogenize the sample until no tissue clumps remain. Transfer the homogenate to clean microcentrifuge tube with pipette.     Incubate tubes for 20 min on ice.   Centrifuge at 15,000 x g for 30 min at +4 °C.   Transfer the supernatant to a clean microcentrifuge tube and discard the pellet. Keep the samples on ice.      ODC activity assay   Calculate the amount of tubes and reaction mixture needed. Each sample should be assayed in duplicate. Include also two blank reactions and two “total counts” (for determing the total radioactivity in the reaction mixture).   Label the needed amount of glass tubes and assemble them into the tube rack. Place the rack on ice-waterbath.   Prepare reaction mixture (Table 1) on ice.   Table 1. Reaction mixture (one reaction) for ODC activity assay table:\n﻿0,1\nComponent,Amount\n1 M Tris-HCl (pH 7.4),25 µl\n200 mM EDTA,5 µl\n100 mM DTT,10 µl\n10 mM or 25 mM L-ornithine (Note 5),10 µl\n100 µCi/ml [14C]-L-ornithine,2 µl\n20 mM PLP,5 µl\nddH2O,143 µl\nTotal,200 µl",
    "Pipet 200 µl of reaction mixture carefully to the bottom of the test tube, taking care not to touch the walls of the tubes with pipet tip (Note 6).    Add 50 µl of sample or blank (buffer A) to the bottom of the tube.   Pipet 25 µl of SOLVABLE onto 3 MM folded paper (Note 7), put it to the top of a glass tube and close with rubber cap (Figure 1B).    Incubate tubes (upright) at +37 °C water bath with gentle rocking for 30 min (tissue samples) or 60 min (cell samples).   Take the tube rack back on ice-waterbath.    In the fume hood, add 1 ml of 2 M citric acid to the wall of the tube by using long 18-21G needle attached to a 10-ml syringe (Note 2, Note 8) (Figure 1C, D).    Continue incubation at +37 °C water bath with gentle rocking for 15 min.    Put the folded papers into 4-ml scintillation vials using forceps (see also Figure 2C).    Include also two “total count” vials-pipet 100 µl of reaction mixture to a folded paper and put it into a scintillation vial.   Add 3 ml of scintillation cocktail to each vial and close with caps (see also Figure 2D-E).   Measure [14C]-radioactivity with liquid scintillation counter (Note 9).",
    "Calculating results (see also Table 3):   Check the label of [14C]-L-ornithine for specific activity and calculate the total molar amount of L-ornithine (labelled + unlabelled) in the reaction mixture (200 µl): Labelled L-ornithine: clabelled = radioactive c (mCi/ml)/specific activity (mCi/mmol) nlabelled = clabelled*Vlabelled ntotal = nlabelled+nunlabelled   Next calculate how many cpm correspond to one pmol of L-ornithine: Relative specific activity (RSA) (pmol/cpm) = ntotal/[(average “total count” cpm)*2]   Then calculate the result:   For cells [(average sample cpm - average blank cpm) * RSA]/(mg protein per 50 µl sample) = pmol/h/mg protein   For tissue {[(average sample cpm - average blank cpm) * RSA]/(mg protein per 50 µl sample)}/0.5 h = pmol/h/mg protein Activity can be expressed as per mg protein, mill. cells, µg DNA or mg tissue.       For tissue and cell samples, dilution of the sample is generally needed when cpm-values exceed ~15,000.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141119/20141119181705_6895.jpg Figure 1. ODC activity assay. A. Folded Whatman 3 MM filter papers. B. ODC reaction tubes with folded papers in place. C. Stopping the reaction with the addition of 2 M citric acid, using needle-penetrable rubber caps and D normal rubber caps.      SSAT activity assay   Calculate the amount of tubes and reaction mixture needed. Each sample should be assayed in duplicate. Include also two blank reactions and two “total counts” for determing the total radioactivity in the reaction mixture.   Label the needed amount of 0.5-ml microcentrifuge tubes and place them on ice.   Prepare reaction mixture (Table 2) on ice.   Table 2. Reaction mixture (one reaction) for SSAT activity assay table:",
    "﻿0,1\nComponent,Amount\n1 M Tris-HCl (pH 7.8),10 µl\n100 mM Spd,3 µl\n100 mM DTT,1 µl\n(20 µCi/ml) [14C]-AcCoA,2.5 µl\nddH2O,73.3 µl\nTotal,90 µl",
    "Pipet 90 µl of reaction mixture to each tube.    Pipet 10 µl of sample or blank (buffer A) to each tube.   Incubate in a thermal cycler for 10 min at +37 °C (Note 10).    Cool to +4 °C and add 20 µl of 1 M hydroxylamine.   Heat at +100 °C for 3 min.   Centrifuge tubes at 15,000 x g for 5 min at RT.   Place P81 paper squares onto Parafilm and number them with pencil (Figure 2A).   Pipet 40 µl of sample supernatant to each paper square and let dry at RT. Include also two “total counts”- pipet 45 µl of reaction mixture to filter paper.    Place the “total count” paper squares into 4-ml scintillation vials using forceps, add 3 ml of scintillation cocktail to each vial and close them with caps (Figure 2C-E).   Put sample and blank paper squares to 1 L Erlenmeyer flask.    Wash paper squares with dH2O for 3 x 5 min and 1 x 10 min (500 ml each wash), shaking on a horizontal shaker at ~200 rpm (Notes 11-12) (Figure 2B).   Wash paper squares once with 400 ml of 96% ethanol for 5 min, shaking on a horizontal shaker at ~200 rpm (Note 11).   Pour paper squares with ethanol to a large container, pick them with forceps onto a big sheet of filter paper and let dry.   Put the paper squares into 4-ml scintillation vials (Figure 2C).    Add 3 ml of scintillation cocktail into each vial and close them with caps (Figure 2D-E).   Measure [14C]-radioactivity with liquid scintillation counter (Note 9).",
    "Calculating the results (see also Table 3):   Check the [14C]-AcCoA batch label for specific activity and calculate its molar amount in the reaction mixture (90 µl): c = radioactive c (mCi/ml)/specific activity (mCi/mmol) n = c * V    Next calculate how many cpm correspond to one pmol of AcCoA: Relative specific activity (RSA) (pmol/cpm) = n/[(average “total count” cpm)*2]   Then calculate the result: {[(average sample cpm - average blank cpm) * RSA] * (120 µl/40 µl)/(mg per 10 µl sample)} * 6 = pmol/h/mg  Activity can be expressed as per mg protein, mill. cells, µg DNA or mg tissue.     For tissue and cell samples, dilution of the sample is generally needed when cpm-values exceed ~6,000.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141119/20141119181733_0987.jpg Figure 2. SSAT activity assay and preparing the samples for liquid scintillation counting. A. Numbered P81 paper squares for samples, blanks and total counts. B. Washing the paper squares. C. Placing the paper squares to liquid scintillation vials. D. Adding scintillation cocktail with dispenser. E. Capped and uncapped vials and the cassette cover."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}