{
  "id": 19820,
  "origin_website": "Wiley",
  "title": "Hepatitis E Virus: Isolation, Propagation, and Quantification",
  "procedures": [
    "HepG2/C3A is the most frequently used cell line for persistent propagation of the HEV Kernow-C1 strain, and the virus can persist in the cells for up to six passages without significant titer drop (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-tbl-0001]). Clinical fecal specimens to be tested should be kept at 4°C if processing within 48 hr is possible. For long-term storage, the specimens should be kept at –80°C for up to 1 year. Primary HEV specimens require the addition of antibiotics prior to inoculation of the cultured cells (Tanaka et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0034]).\nMaterials\nComplete growth medium (see recipe)\nHepG2/C3A cells (ATCC #CRL-10741)\n75% (v/v) ethanol\n0.05% trypsin-EDTA (e.g., Corning, cat. no. 25-053-CI)\nClinical HEV fecal specimen\n10 mM Tris·Cl, pH 7.5 (see Current Protocols article: Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0020])\n37°C water bath\n15-ml centrifuge tubes\nCentrifuge\n25-cm2 and 75-cm2 tissue culture flasks\n37°C, 5% CO2 humidified incubator\nInverted phase contrast microscope\nVortex\n0.22-μm microfilter (e.g., Millipore Millex-GV)\nAdditional reagents and equipment for reverse-transcription quantitative PCR (RT-qPCR; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0002])\nPrepare cell culture\n1. Prewarm complete growth medium in a 37°C water bath.\n2. Add 5 ml growth medium to a 15-ml centrifuge tube.\n3. Remove a vial of HepG2/C3A cells from liquid nitrogen storage Dewar, and immediately thaw in a 37°C water bath. Remove the vial from the water bath when there is tiny piece of ice left in the vial.\n4. Wipe the vial with 75% ethanol. Transfer the cell suspension from the vial to the warm growth medium (5 ml) in the 15-ml centrifuge tube, one drop at a time.\n5. Centrifuge the tube 5 min at 200 × g, room temperature. Decant supernatant.\nThis step is done to remove DMSO from the cell-freezing medium.",
    "6. Resuspend the cell pellet with 5 ml warm complete growth medium, and transfer the cells to a 25-cm2 flask. Incubate the flask in a humidified incubator at 37°C with 5% CO2 for 24 to 48 hr.\n7. Observe cell confluence daily through an inverted phase-contrast microscope. When cell monolayer reaches near complete confluence, detach the cells using trypsin incubation at 37°C for 3 to 5 min, and transfer the cells to a 75-cm2 flask for expansion of culture.\nIsolate and propagate HEV from clinical specimen\n8. For isolation of HEV, suspend 1.5 g stool sample in 2 to 3 ml of 10 mM Tris·Cl in a 15-ml tube, and vortex for 30 s (also see Tanaka et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0034]).\n9. Centrifuge the specimen 10 min at 6200 × g, 4°C. Aliquot the supernatant as virus stocks, and store at –80°C.\n10. Determine the HEV RNA copy numbers of the virus stock using RT-qPCR as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0002]. Culture the HepG2/C3A cells at 37°C with complete growth medium until the cell confluence reaches 60% to 70%.\n11. Purify the virus stock by passaging through 0.22-μm microfilters. Assess the concentration of the filtered HEV stock by RT-qPCR as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0002]. Inoculate the cells with the specimen at 10,000 HEV genomes/cell, and incubate the flask for 5 hr at 37°C. Decant the inoculum and add fresh medium. Allow the virus to proliferate for 5 days.\n12. Expand the cells to a 75-cm2 flask and monitor the virus release into the medium by RT-qPCR as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0002].",
    "Notably, the progeny virus released from cells is predominantly quasi-enveloped, while the virus within the cells is mostly non-enveloped (Yin, Ambardekar, Lu, & Feng, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0040]). The enveloped virus has lower infectivity compared to the non-enveloped virus; therefore, it is better to harvest the infected cells to get higher titer of infectious virus by freezing and thawing the cells (Yin et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0040]).\nTo improve the virus infection rate, substitute the culture medium of HEV-infected cells with plain Dulbecco's Modified Eagle Medium (DMEM) for 4 hr, and then replace the plain DMEM with DMEM supplemented with 5% (v/v) fetal bovine serum (FBS) for 2 more days before passaging the cells. In addition, treatment with 10 nM rapamycin for 72 hr can also increase virus replication by ∼2-fold (Zhou et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0042]).",
    "Because HEV infection does not produce cytopathic effects in cultured cells, a plaque assay for virus quantitation is not feasible. Due to the slow growth rate and low production of HEV, indirect immunofluorescence assays for virus quantification may need a relatively long period. In contrast, RT-qPCR is considered a convenient and quick tool frequently used for virus quantification (Nan et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0021]; Zhou et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0042]).\nMaterials\nHepG2/C3A cells infected with HEV (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0001])\nTRIzol Reagent (e.g., Thermo Fisher Scientific, cat. no. 15596018)\nChloroform\nIsopropanol\nNuclease-free 75% (v/v) ethanol\nNuclease-free water\nRevertAid First Strand cDNA Synthesis Kit (e.g., Thermo Fisher Scientific, cat. no. K1691)\nRandom hexamer primers\nHEV forward and reverse primers (HEV-F and HEV-R)\nSYBR Green I master mix (e.g., Thermo Fisher Scientific, cat. no. 4309155)\nCentrifuge\n1.5-ml microcentrifuge tubes, nuclease-free\nLow profile 8-strip PCR tubes\nThermal cycler\nReal-time PCR detection system\nRNA isolation\n1. For detection of virus copies in infected HepG2/C3A cells, remove the growth medium and add 0.3 to 0.4 ml TRIzol Reagent per 1 × 105 to 1 × 106 cells directly to the culture dish to lyse the cells.\nThe cell number in a 6-, 12-, and 24-well plate is about 1.2 × 106 cells/well, 4 × 105 cells/well, and 2 × 105 cells/well, respectively, when the cells reach full confluence.\n2. Add 200 μl chloroform per 1 ml sample harvested by TRIzol and shake vigorously for 15 s. Keep the mixture standing for 5 min at room temperature, and then centrifuge 15 min at 14,000 × g, 4°C.\n3. Transfer the top layer supernatant to a new 1.5-ml microcentrifuge tube. Add the same volume of cold isopropanol, and then mix thoroughly. Centrifuge 15 min at 14,000 × g, 4°C. Carefully decant the supernatant.",
    "4. Add 1 ml cold 75% ethanol, and then centrifuge 5 min at 14,000 × g, 4°C. Decant the supernatant carefully, and aspirate remaining liquid in the tube. Let the RNA pellet dry for 1 min.\n5. Add 20 μl nuclease-free water to dissolve the RNA.\nThe RNA can be stored at –80°C for up to 1 month.\nReverse transcription and real-time PCR\n6. Using 5 μl RNA as the template, perform reverse transcription using RevertAid First Strand cDNA Synthesis Kit (according to kit instructions) with a random hexamer primer or a specific primer (i.e., HEV-R; Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-tbl-0002]).\nTable 2.\n                Primers for HEV Real-Time PCR\ntable:\n﻿Primer,Sequence\nHEV-Fa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-tbl2-note-0001_43],5′-CGTGTCGCTATCTCCACCTA-3′\nHEV-R,5′-TGTCCTCAAGAACAGCAAGG-3′\na F, forward; HEV, hepatitis E virus; R, reverse.\n7. Mix the reaction of the reverse transcription in a PCR tube. Perform the reverse transcription reaction on a thermal cycler using the following protocol:\n         \ntable:\n﻿0,1,2\n1 cycle,5 min,25°C\n,60 min,42°C\n,5 min,75°C\n,5 min,4°C\nThe cDNA can be used directly in the following PCR or stored at –20°C for up to 2 weeks.\n8. Dilute the product of reverse transcription (step 7) at a ratio of 1:10, and use the diluted product as a template for real-time PCR with primer HEV-F and HEV-R (Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-tbl-0002]). Add the following components to a PCR tube:\n         \n7 μl SYBR Green I master mix\n1 μl of 2.5 μM primer HEV-F\n1 μl of 2.5 μM primer HEV-R\n5 μl diluted reverse transcription product.\n9. Dilute DNA of linearized HEV cDNA infectious clone in a 10-fold series from 108 to 1 copies/μl for a standard curve in the real-time PCR. Compose the reaction volume as described in step 8.\n10. Perform the real-time PCR using the following protocol:\n         \ntable:\n﻿0,1,2\nPre-denature,5 min,95°C\n40 cycles,10 s,95°C\n,40 s,60°C",
    "Melting curve,5 s each,0.5°C increments from 65°C to 95°C\nFinal step,,20°C\nThe RT-qPCR standard curve is shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-fig-0001]. The linear correlation (R2) value for HEV was 0.998, and the reaction efficiency was 95.2%. The cDNA copy numbers of HEV for unknown samples, in this case, were calculated using the equation Y = –3.442X + 35.935, where Y is the cycle threshold (Ct) and X is the log starting quantity. For example, if the sample Ct readout is 20.46, according to the equation, X = (35.935–20.46)/3.442 = 4.50, then the cDNA copy number of the HEV is 104.5 copies × 10 (dilution factor) = 105.5 copies/μl.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/670a0a3d-7932-4d14-a074-f10943dcc62d/cpz1642-fig-0001-m.jpg</p>\nFigure 1\nAmplification curve and a standard curve of RT-qPCR. (A) Amplification curve of ten-fold dilutions of linearized HEV cDNA templates. The cycle number of the reaction is shown on the x-axis, and the corresponding fluorescence intensity is shown on the y-axis. (B) Standard curve of the linearized HEV cDNA templates. The log values of template concentrations are indicated on the x-axis, and the corresponding cycle threshold (Ct) values are shown on the y-axis.",
    "Infectious cDNA clones of HEV have been established for recovery of the virus and study of its biology (Emerson et al., 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0008]; Shukla et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0030]). Here, the Kernow-C1 p6 clone containing the full-length cDNA of the HEV Kernow-C1 strain (GenBank accession number JQ679013) is used as an example in the following protocol (Shukla et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0031]; Xu et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0038]). For purification of the virus, density gradient centrifugation can be used (Emerson et al., 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0007]).\nMaterials\ncDNA clone of Kernow-C1 p6 (see Shukla et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0031])\n20 U/μl MluI with 10× reaction buffer (e.g., New England BioLabs, cat. no. R0198S)\nNuclease-free water\n6× DNA loading dye (e.g., Thermo Fisher Scientific, cat. no. R1151)\n1% (w/v) agarose Tris-acetate-EDTA (agarose-TAE) gel (see recipe)\n1× TAE buffer (see recipe)\nGeneJET PCR Purification Kit (e.g., Thermo Fisher Scientific, cat. no. K0701)\nmMESSAGE mMACHINE T7 Transcription Kit (e.g., Thermo Fisher Scientific, cat. no. AM1344)\nTRIzol Reagent (e.g., Thermo Fisher Scientific, cat. no. 15596018)\nChloroform\nIsopropanol\nNuclease-free 70% (v/v) ethanol\n2× RNA loading dye\nHepG2/C3A cells infected with HEV (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0001])\nComplete growth medium (see recipe)\n0.05% trypsin-EDTA (e.g., Corning, cat. no. 25-053-CI)\nOpti-MEM Reduced Serum Medium (e.g., Thermo Fisher Scientific, cat. no. 51985091)\nTNE buffer (see recipe)\n15%, 20%, 30%, 40%, and 50% sucrose buffer solutions (see recipe)\n37°C, 5% CO2 incubator\n75°C incubator\nCentrifuge\n1.5-ml microcentrifuge tubes, sterile\nSpectrophotometer\n25-cm2 flask\n4-mm electroporation cuvette\nGene Pulser Xcell Electroporation System (e.g., Bio-Rad)\n37°C, 5% CO2 humidified incubator\nUltracentrifuge with swinging bucket rotor (e.g., SW41 rotor)\nCentrifuge tubes suitable for ultracentrifugation\nSyringe with long needle\nRNeasy Micro Kit (Qiagen, cat. no. 74004)\nAdditional reagents and equipment for gel electrophoresis (see Current Protocols article: Voytas, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0036])\nPlasmid preparation",
    "1. Linearize the Kernow-C1 p6 plasmid with MluI restriction enzyme by adding the following components to a 1.5-ml tube:\n         \n10 μg Kernow-C1 p6 plasmid\n20 U MluI enzyme\n2 μl 10× reaction buffer\nNuclease-free water to a final volume of 20 μl.\n2. Incubate the reaction at 37°C for 4 to 8 hr.\n3. After the incubation, take 2 μl of the reaction mixture and add 1/6 vol of 6× DNA loading dye. Load the mixture onto a 1% agarose-TAE gel, and then run the gel in TAE buffer. Include the same amount of undigested DNA plasmid as a control.\nIf digestion is complete, all digested DNA should be converted into a single linear fragment of ∼10 kb, distinguishable from the circular DNA form of the undigested plasmid. In this case, proceed to step 5.\n4. Optional: If the plasmid is not fully linearized, add an additional 10 U MluI, and continue the digestion.\n5. Purify the linearized plasmid DNA with GeneJET Purification Kit following the manufacturer's instructions.\nIn vitro transcription and purification\n6. Use the purified linear plasmid as the template to conduct in vitro transcription using the mMESSAGE mMACHINE in vitro RNA transcription kit according to the manufacturer's instructions to generate capped HEV RNA.\n7. After RNA generation, digest the DNA in the reaction mixture with 2 μl DNase provided in the kit for 15 min.\n8. For purification of the RNA, add 900 μl TRIzol Reagent to the RNA product, and invert the tube four times. Next, add 200 μl chloroform, and shake vigorously for 15 s. Keep the mixture standing for 5 min at room temperature, and then centrifuge 15 min at 14,000 × g, 4°C.",
    "After centrifugation, there will be three phases: a red organic phase containing the protein, an interphase (usually white) containing the DNA, and a colorless upper aqueous phase containing the RNA.\n9. Transfer the top liquid layer to a new 1.5-ml microcentrifuge tube. Add the same volume of cold isopropanol, and mix thoroughly.\n10. Centrifuge the mixture 15 min at 14,000 × g, 4°C. Carefully decant the supernatant.\n11. Add 1 ml cold 70% ethanol, and then centrifuge 5 min at 14,000 × g, 4°C.\n12. Decant the supernatant carefully, and aspirate any liquid residue. Let the RNA pellet dry for 1 min.\n13. Add 50 μl nuclease-free water to dissolve the RNA.\nThe RNA can be aliquotted and stored at –80°C.\nAlternatively, the RNA can be purified with RNeasy Micro Kit (Qiagen, cat. no. 74004) according to the manufacturer's protocol.\n14. To 3 μl RNA, add 3 μl of 2× RNA loading dye containing the denaturing agent. Incubate the mixture for 5 min at 75°C, and then allow it to cool for 2 min on ice. Perform electrophoresis of the RNA product using a 1% agarose-TAE gel to test the integrity of the RNA. Add an RNA ladder to allow for size measurement of the purified RNA. Assess the concentration and purity of RNA using a spectrophotometer at OD260/280.\nThe RNA product should yield one bright band around 7.2 kb without any smear in the gel. Smear might indicate degradation of the RNA product. The OD260/280 of the purified RNA should be between 1.8 and 2.1. Lower OD260/280 indicates protein contamination.\nCell electroporation with the HEV RNA",
    "15. Culture the HepG2/C3A cells with complete growth medium in a 25-cm2 flask until the cells reach confluence, and then detach the cells using trypsin and incubation at 37°C for 3 to 5 min.\n16. Rinse the cells three times with Opti-MEM by centrifugation, and then resuspend the cell pellet in 200 μl Opti-MEM.\n17. Mix the cells with 10 μg p6 full-length HEV RNA (from step 13), and then transfer the mixture to a 4-mm cuvette. Keep the mixture on ice before the electroporation.\n18. Conduct electroporation of the HepG2/C3A cells in the 4-mm cuvette using the Bio-Rad Gene Pulser Xcell Electroporation Systems (Bio-Rad).\nThe pulsing conditions are 600 V, pulse length 0.5 s, 1 pulse, and 0 intervals.\n19. Add 5 ml complete growth medium to a 25-cm2 flask. Transfer the cells from the cuvette after electroporation to the flask. Incubate the flask at 37°C with 5% CO2 for up to 1 week. Check for HEV-infected cells by immunofluorescence assay as described in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0004].\n20. Expand the culture or inoculate fresh cells to propagate the virus as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0001].\nConcentration of the virus\n21. Collect the supernatant that contains HEV viral particles from HEV-infected cells, and then centrifuge 30 min at 8000 × g, 4°C, to remove cell debris.\n22. Subject the supernatant to ultracentrifugation 2 hr at 100,000 × g, 4°C, to concentrate HEV virus particles.\n23. Decant the supernatant carefully. Resuspend the pellet with 1 ml TNE buffer.\nThe virus suspension at this stage is appropriate for long-term storage at –80°C.\nPreparation of a sucrose gradient\n24. Prepare five sucrose solutions (15%, 20%, 30%, 40%, and 50%).",
    "This is for discontinuous sucrose centrifugation. If a gradient maker is available, a sucrose gradient can be prepared and used in the purification. Other gradient solutions such as CsCl can also be used.\n25. Divide the total volume of a centrifuge tube by 5.\nHere we use an SW41 rotor bucket of a Beckman ultracentrifuge as an example. The total volume per tube is 13.2 ml. As 1 ml virus suspension will be added on top of the sucrose gradient, a total of 12.2 ml will be for sucrose solutions. Therefore, 1/5 vol will be 2.44 ml.\n26. Add 2.44 ml of the 15% sucrose buffer solution to every centrifuge tube.\n27. Inject 2.44 ml of the 20% sucrose buffer solution underneath the 15% solution using a syringe with a long needle.\n28. Repeat step 27 for the 30%, 40%, and 50% sucrose buffer solutions.\nPurification of the virus\n29. Add 1 ml of concentrated virus suspension (from step 23) carefully on top of the gradient. Balance the tubes by weight to within 1 mg using TNE buffer.\n30. Insert the tubes carefully in the buckets and hang the buckets in the correct orientation in their appropriate place on the SW41 rotor.\n31. Centrifuge 5 hr at 100,000 × g, 4°C.\n32. After centrifugation, carefully remove the centrifuge tubes from each bucket.\n33. Collect the band(s) in the tubes with a disposable syringe and needle. To do so, slide the needle along the tube wall to just below the band, and withdraw the band slowly into the syringe. Then, add the collected bands to separate tubes.",
    "34. Dilute the virus with 35 ml TNE buffer, and centrifuge 2 hr at 100,000 × g, 4°C, to remove the sucrose from the virus suspension. Remove the supernatant and resuspend the pellet in 1 ml TNE buffer.\n35. Analyze 10 μl for the presence of the virus using RT-qPCR as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0002].\n36. Dilute the virus with TNE buffer to 1 × 107 copies/ml. Aliquot and store at –80°C.",
    "It was previously reported that HepG2/C3A cells can be infected by the HEV Kernow-C1 strain at high efficiency (Shukla et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-bib-0030]). Here, infected HepG2/C3A cells are used to illustrate determination of HEV infectivity using an immunofluorescence assay.\nMaterials\nHepG2/C3A cells infected with HEV (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0001])\n0.05% trypsin-EDTA (e.g., Corning, cat. no. 25-053-CI)\nComplete growth medium (see recipe)\n1:1 methanol:acetone\nPhosphate-buffered saline (PBS; see recipe)\nMouse monoclonal antibody against HEV open reading frame 2 (ORF2; e.g., Millipore, cat. no. MAB8002, RRID: AB_11212382)\nGoat anti-mouse IgG (H&L) antibody, Dylight 549–conjugated (e.g., Rockland Immunologicals, cat. no. 610-142-002, RRID: AB_11182796)\nSlowFade Gold antifade reagent containing DAPI (e.g., Thermo Fisher Scientific, cat. no. S36939)\n12-well cell culture plate\nCircular cover glass (12 mm diameter)\n37°C, 5% CO2 humidified incubator\n37°C microbiological incubator\nGlass microscope slides\nFluorescence microscope with 63× oil immersion lens\nInoculate HepG2/C3A cells with HEV\n1. Prepare HepG2/C3A cells as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-prot-0001].\n2. Detach confluent cell monolayer using trypsin and incubation at 37°C for 3 to 5 min, and plate cells into 12-well culture plates with a cover glass. Incubate the plate at 37°C with 5% CO2 in a humidified incubator overnight.\n3. Incubate cells with HEV samples to be tested at 37°C with 5% CO2 for 5 hr, and replace the medium with complete growth medium. Incubate the plate for 5 to 6 days at 37°C.\nIndirect immunofluorescence assay\n4. Fix cells with cold 1:1 methanol:acetone for 15 min.\nThe methanol/acetone solution should be stored at –20°C.\n5. Rinse the cover glass with PBS once and add anti-HEV ORF2 antibody diluted with PBS (at a working concentration recommended starting 1:200). Incubate the plate at 37°C for 35 min.",
    "6. Rinse the cover glass three times with PBS, each time for 5 min, and add Dylight 549–conjugated goat anti-mouse IgG antibody diluted with PBS at 1:1000. Incubate the plate at 37°C for 35 min.\n7. Rinse the cells three times with PBS, each time for 5 min. Mount the cover glass onto a slide with 5 μl SlowFade Gold antifade reagent.\n8. Observe the cells under a fluorescence microscope with an oil-immersion lens.\nThe number of positive foci for ORF2 proteins can be counted. Because of low virus replication in HepG2/C3A cells, a 63× objective is recommended to better observe the TRITC-conjugated secondary antibody (i.e., positive cells) with low background. The immunofluorescence assay image should look like that shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.642#cpz1642-fig-0002].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/66042f76-f613-4413-8b7b-edbb14b24c5d/cpz1642-fig-0002-m.jpg</p>\nFigure 2\nIndirect immunofluorescence assay of HepG2 cells infected with the HEV Kernow-C1 strain. Images were taken with a 63× objective lens. The left image shows the ORF2-specific cells as red fluorescence. The middle image is DAPI staining of nuclear DNA. The right image is an overlay of both the red and blue fluorescence."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}