{
  "id": 9825,
  "origin_website": "Jove",
  "title": "Assaying Locomotor Activity to Study Circadian Rhythms and Sleep Parameters in Drosophila",
  "procedures": [
    "The overall design of the protocol is illustrated in Figure 1. The setup for monitoring locomotor activity using devices housed in environmentally controlled incubators located in a darkroom needs to be assembled first. Once that is completed, the system can be used in all subsequent locomotor activity rhythm measurements. For each experiment, one has to (i) prepare experimental animals, which might include generating transgenic animals or setting up necessary crosses, (ii) prepare glass activity tubes containing a food source, (iii) load flies into activity tubes and connect activity monitors to the data collection system, and (iv) record and analyze the data using different software depending on what circadian or sleep parameters one wants to examine. Herein, we define the \"start\" of the experiment as the time when flies in monitoring devices are first exposed to the desired light/dark conditions in environmental incubators.\n1. Setting up the Locomotor Activity Monitoring System\nThe monitoring system involves numerous equipment items such as specialty monitoring devices, environmental incubators that have the capacity for diurnal light control, data collection devices, computers and peripheral materials such as wiring to connect the monitoring devices to the data collection devices (Figure 2). Instructions for installing the Drosophila Activity Monitoring (DAM) data collection system are provided by the manufacturer (Trikinetics Inc.).",
    "To house the locomotor activity monitoring system, choose a well-ventilated room, preferably equipped with temperature control system, to be a dedicated darkroom. With all the electrical systems involved (e.g. computer and incubators) running for an extended period of time within a small and confined room, excessive heat can be generated leading to rapid increases in the room's temperature. Consequently, incubators will be burdened with extra workload to maintain temperature and more likely to fail in temperature control.  We find that even for well-ventilated rooms, the transition from air-conditioning in the summer to heat in the fall/winter can make it difficult to maintain room temperature.  In such cases additional ventilation might have to be installed in the dark room to reduce the risk of overheating.  Also, it is best to turn off incubators that are not in use to minimize the production of unnecessary heat.",
    "Seal the room from external light sources. Entrance can be sealed off with a revolving door or black curtain. We prefer a revolving door as this minimizes the chances of unwanted light entering the darkroom. Inside the darkroom, it is not necessary to work completely in the dark as the fruit flies circadian system is not sensitive to infrared light (and is much less sensitive to red light compared to green/blue light). In cases where we need to see in the darkroom but still want to maintain overall darkness (e.g., quickly removing or adding a monitoring device in an incubator that is in its dark phase), we simply use a standard flashlight that is covered with a red filter.  Alternatively or in addition to, if your darkroom has fluorescent lights, cover them with red filter paper or have a stand-alone incandescent desk light covered with such filter paper. It is highly unlikely that exposing flies in the dark to very brief exposures (few seconds) of red light will affect their circadian clocks.  Also, although the circadian system of Drosophila is very sensitive to visible light, we do not think small creaks of light in the darkroom will be consequential; in any case, a good practice is to keep the incubator doors that house the monitors open only when necessary.  Also, only open up one incubator at a time as this will minimize the possibility of an incubator on its dark phase being exposed to light from an incubator on its light phase.",
    "Purchase an Uninterrupted Power Supply (UPS) emergency backup unit that has enough wattage capacity to power the components of the activity monitoring system in case of surge, spike, or power failure in the building. Connect the UPS emergency backup unit to the emergency backup circuit of the building if available.  Be aware that even if your equipment is plugged into an emergency outlet during a power outage there can be a short transition period as the system switches to emergency power.  During that transition, loss of power for even a few seconds can lead to computers shutting down and the lights in the incubator being turned off.  Thus, it is important to ensure that the computers being used to gather the activity data and the system controlling lights in the incubator are not only hooked into emergency power but also a UPS.  If the system controlling lighting in the incubator is not directly regulated by the incubator (in most cases it is), then it is sufficient to plug the incubator into the emergency power without a UPS, as loss of power for a few seconds will not affect the chamber temperature.  Note that in general a UPS device will only keep your equipment running for 5-30 min in the absence of power; its main purpose is to protect against temporary loss of power during the transition from regular to emergency power.",
    "Set up a computer, PC or Macintosh, fully dedicated for data collection and/or for light control of the incubators. Since the DAM system will be running all the time and unattended, it is recommended that this computer have minimal software installed, preferably no network connection to minimize the risk of crashing. In addition, the system needs portable data storage, e.g. zip drive, CD/DVD writer, or USB, to allow for downloading of data collected for subsequent analysis.\nManually arrange the telephone line network neatly around the shelving of the environmentally controlled incubators to allow ease of plugging/unplugging of activity monitors. Standard telephone lines, adapters, and splitters can be purchased in commercial electronic stores and used. Set up multiple telephone lines in a way such that they will converge into one main line and extend out of the incubator to connect to the computer.\nConnect the monitoring devices inside the incubators to the computer via a power supply interface unit (aka Blue box from Trikinetics Inc.), which serves to power the activity monitor (Trikinetics Inc.) via the telephone line. This power supply interface unit also acts as an interface for data transfer switching from telephone line to USB cable. Optional light controller in the same unit in which the power line cord of the incubator light system can be connected to, is available to allow control of circadian incubator lighting schedule via the computer.\nMask possible light sources from LED of electronic device or improperly seal incubator door with duck tape or black cloth to ensure free-running rhythms are measured in the absence of unwanted light.\n2. Preparation of Experimental Animals",
    "Behavioral phenotypes in fruit flies such as circadian rhythmicity and sleep/rest activity are very sensitive to genotypic and age differences of the test animals (Koh et al. 2006). Therefore, it is crucial to assess these phenotypes using proper control animals that are reared in the same environmental conditions and of the same age.  In addition, there is sexual dimorphism in circadian rhythmicity (Helfrich-Föster 2000).  The general practice is to use adult male flies that are reared in 25°C and between 1 to 5 day old for locomotor activity assays. Male flies instead of female flies are traditionally used because egg-laying activity will affect true measurement of locomotor activity. Because of sexual dimorphism, sometimes assaying female flies might be informative.  Food consisting of simply 5% sucrose and 2% bacto agar will prevent eggs of non-virgin females from developing and movement of hatched larvae from causing erroneous activity counts. Alternatively, virgin female flies can be used although there might be differences in activity profiles between mated and virgin females (Helfrich-Forster, J. Biol. Rhythms 2000).",
    "When examining circadian and sleep/rest parameters of specific mutant flies of interest, it is prudent to outcross the mutant stock with the wild-type strain of the same genetic background, e.g. w1118 or yw. This will remove second site genetic modifiers that might potentially mask circadian or sleep/rest phenotype. Since there is no crossing-over in Drosophila males, it is better to perform the outcross by crossing mutant females with wild-type males. The wild-type strain will also serve as the appropriate control for the experiment. Seed both the wild-type control and mutant flies at the same time in standard Drosophila food about 10 to 14 days before the locomotor activity rhythm experiment (see Bloomington Drosophila Stock Center for food recipe; http://flystocks.bio.indiana.edu/). Upon eclosion of the progeny, collect 1 to 5 days old male flies and set them aside to be used for the experiments.",
    "With the numerous genetic tools and resources such as overexpression, RNAi, and tissue-specific GAL4 driver fly lines available from different stock centers worldwide, it is possible to dissect the effects of overexpressing or knocking-down specific genes in tissue- and temporal-specific manner (Brand and Perrimon 1993; McGuire et al. 2004; Osterwalder et al. 2001). To examine circadian and sleep/rest parameters using this approach, flies carrying transgenic constructs with tissue-specific or drug-inducible GAL4 driver (e.g. males) are crossed to flies carrying transgenic constructs with target genes attached to the UAS responder (e.g. virgin females) around 14 days before the start of locomotor activity experiments. Upon eclosion of the progeny, collect 1 to 5 days old male flies and set them aside to be used for the experiments. The parental lines used for the cross are routinely used as controls for the experiments. Progeny from crosses of UAS responder and GAL4 driver lines with wild type flies of the same genetic background are also appropriate controls.\nAs indicated in steps (2) and (3), the length of time needed for the preparation of experimental animals varies greatly depending on the nature and design of the experiment.  In the case where transgenic animals need to be generated or if crossing schemes need to be executed, more time will obviously be needed. For logistical reasons, it takes about 14 days at 25°C for Drosophila to develop from eggs to adult flies.\n3. Preparation of Activity Tubes",
    "Activity tubes represent the fly habitat during the experiment. They are thin (about 5 mm in diameter; note, Trikinetics offers different sizes depending on the Drosophila species to be assayed) 5 mm glass tubes that contain food substance at one end and plugged with yarn or plastic plug at the other end. Since glass activity tubes can be reused multiple times, we will describe the preparation procedures by using used/uncleaned activity tubes from previous experiments as the starting point. If you are using new activity tubes, simply skip to step (11).\nIt is preferable to use activity tubes that are freshly made since the food inside the tubes has a tendency to dry up and gets contaminated with fungi overtime even when stored at 4°C. They are generally prepared a few days to a week ahead of the start of the experiment.  It is therefore important to assess the number of tubes needed for each experiment before preparing them.\nRemove plugs (yarn or plastic plug) from used activity tubes and put them into large glass beaker.  The tubes should only fill up to half the beaker.  Fill the beaker with tap water, making sure to submerge the tubes.\nMicrowave the beaker filled with glass tubes until the water comes to full rapid boil to melt the wax and agar food.\nTake caution that the water is hot. Remove the beaker from the microwave and stir the tubes with a spatula or plastic 10 mL pipette to allow trapped wax to float to the top.  Then repeat step (4).\nRemove the beaker from the microwave and wait for it to cool down. Putting the beaker in the cold room (if it is available) will speed up the process.",
    "As the water cools down, the wax will collect on the surface of the water and gradually solidifies.  Simply remove the solidified wax by hand. This should get rid of most of the wax on the tubes.\nTransfer the activity tubes to a new beaker with fresh tap water and repeat steps (4) and (5).\nSince most of the wax has been removed in step (7), it is not necessary to wait for the wax to solidify. Simply pour the water out of the beaker and transfer the tubes into another new beaker.  Take caution that the water is still hot.\nRepeat steps (4) and (5) for the last time. Pour the water out of the beaker and wait for the activity tubes to cool down.\nLoad them vertically into 250 mL or 500mL glass beakers. Make sure they are not too tightly packed.  Sterilize them by using an autoclave with a dry cycle or simply use a drying oven to dry the tubes.\nSeparately, to prepare food to load into the activity tubes, make a solution of 5% sucrose (Sigma) and 2% Bacto agar (BD) in distilled water or tap water. Autoclave to sterilize the solution. The autoclaved food can be used immediately or stored in 4°C for an extended period of time.  Once the food solidifies, one will need to microwave and liquefy it in order to fill the tubes. Unused portion of food can be stored and used at a later date.",
    "The food should ideally be around 65°C when used for filling activity tubes. If it is too hot, too much condensation will accumulate inside the tubes.  If it is not hot enough, the food will solidify before the tubes are evenly filled. To fill the activity tubes with food, use a 10 mL pipette to pipette the liquid food solution along the inside wall of the glass beaker, allowing the food solution to fill the activity tube from the bottom up, until the tubes are one-third filled with solution. Swirl the beaker around gently to make sure all the tubes, especially the ones in the middle of beaker, are evenly filled with food solution. Wait for the food to solidify completely either at room temperature or 4°C. Proceed to the next step once condensation inside the glass tubes dissipate.\nTo remove the activity tubes from the beaker, push the tubes towards the bottom of the beaker and twist the tubes at the same time so that the solidified food inside the tubes and the bottom of the beaker will separate. Take the tubes out of the beaker, preferably as a single bunch.\nClean the tubes one by one with paper towels to remove excess food on the outer surface of the tubes. Set the tubes aside in a clean container.\nTake a general laboratory block heater without the tube holder and cover the heating well carefully with several layers of strong aluminum foil. Add paraffin (wax) pellets into the aluminum-lined heating well to melt.",
    "Hold the tubes at the non-food end and dip the food end into the melted wax. Dip the waxed portion into a glass beaker filled with cold water to speed up wax solidification. Repeat once.  Dipping the waxed tubes into water will prevent the tubes from sticking together.\nThe tubes can be used right away, or stored in an airtight container at 4°C for use within a week. Prolonged storage will lead to excessive drying of the food. If the tubes are stored at 4°C, make sure to warm them up to ambient temperature by leaving them on bench top prior to use.\n4. Loading Flies into Activity Tubes and Locomotor Activity Monitoring System\nPrior to loading flies into activity tubes, turn on the incubators that will be used to house the activity monitors.  Adjust the temperature using the incubator controls and set the light/dark regime using the DAM System light controller OR the incubators own light control system according to the desired experimental design. The time necessary to load flies into activity tubes should be sufficient for the temperature to stabilize.\nAnesthetize the flies with carbon dioxide.\nUse a fine paintbrush to gently transfer a single fly into an activity tube.\nGrab the middle of a single piece of yarn that is around half an inch with fine forceps and insert the yarn into the non-food end of the activity tube to plug the opening and prevent the fly from escaping during the experiment, while at the same time allowing airflow into the tube. Alternatively, plastic caps with small holes (Trikinetics, Inc.) can be used to close the opening.\nMake sure the tubes are laid on their sides until the fly awakens, or else there is the risk of the fly getting stuck to the food.",
    "Insert the tubes into the activity monitors.  With the newer, more compact model of the Trikinetics monitors (Trikinetics DAM2 and DAM2-7), it is necessary to hold the tubes in place with rubber bands to ensure that the infrared beam passes the tube at the center position.\nPut the activity monitors into the incubators and hook them up to the data collection system via the telephone wires. Check using the DAM System collection software to make sure all the monitors are hooked up properly and data is being collected from each of them. The monitor emits infrared light beam across the center of each glass activity tube. The locomotor activity of the flies are recorded as raw binary data where \"one\" is recorded each time the infrared beam is broken or a  'zero' is recorded in which the infrared beam is not broken.\n5. Experimental Design to Record Data for Determination of Circadian Periodicity and Amplitude",
    "Flies are synchronized and entrained by exposing them to the desired light/dark (LD) and temperature regime for 2-5 full days.  The most commonly used entrainment condition is a light/dark cycle of 12 hrs light/ 12 hrs dark (12:12 LD) at 25°C.  This generally accepted standard condition is essentially based on the thought that Drosophila originated from Afro-equatorial locations.  When studying circadian rhythms there is some phraseology that one needs to become familiar with.  Relevant to this protocol, the time when the lights go on in the incubator is defined as zeitgeber time 0 (ZT0) and all other times are relative to that value (e.g., in a 12:12 LD cycle, ZT12 is the time when the lights are turned off).  Under standard 12:12 LD conditions, wild type Drosophila melanogaster typically exhibit two bouts of activity; one centered around ZT0 termed \"morning\" peak and another around ZT12 termed \"evening\" peak (Figure 3A).  The morning and evening bouts are controlled by the endogenous clock but there are also \"startle\" responses that are transient bursts of activity in response to the light/dark transitions.  Two days of entrainment is the minimum and could be used, for example, in large screens that are more time-consuming and are geared towards measuring free-running periods in constant darkness (see below, step 2).  However, if you are interested in studying the activity patterns during a daily light-dark cycle, it is preferable to maintain the flies for 4-5 days in LD so as to obtain more data.  Essentially, increasing the number of flies or the number of LD days in the final data analysis (e.g., pool data from the last two days worth of LD locomotor activity) will generate more reliable diurnal activity profiles and measurements (e.g., timing of morning or evening peak).",
    "Furthermore, the daily distribution of activity varies as a function of day-length (photoperiod) and temperature.  A major reason for altering the photoperiod or temperature from the standard is if one wanted to study how daily activity patterns undergo seasonal adaptation (e.g. Chen et al. 2007). Drosophila can also be entrained to daily temperature cycles (e.g. Glaser and Stanewsky 2005; Sehadova et al. 2009).  Temperature cycles that vary by only 2-3°C are sufficient to entrain activity rhythms.",
    "Free running locomotor activity rhythms are measured under constant dark and temperature conditions after the entraining period is finished (see above, step 1).  The setting for the light cycle can be changed anytime in the dark phase on the last day of LD such that the subsequent day of the experiment represents the first day of DD. Seven days of DD data collection is sufficient to calculate the circadian period and amplitude (e.g., power or strength of rhythm) of flies. In general, a sample size of at least 16 flies is necessary to obtain reliable free-running periods for a particular genotype.  Even if one is only interested in measuring diurnal activity, it is still best to measure the flies' free-running periods in DD as changes in endogenous period can alter the daily distribution of activity in LD.  For example, flies with long endogenous periods usually exhibit delayed evening peaks in LD (e.g., see Figure 4).\nAt the conclusion of the experiment, raw binary data collected using the DAM System software is downloaded onto a portable data storage device, e.g. USB key.\nThe raw binary data is processed using DAM Filescan102X (Trikinetics, Inc.) and summed into 15 and 30 minute bins when analyzing circadian parameters, or 1 to 5 minute bins when analyzing sleep/rest parameters. Currently, five contiguous minutes of inactivity is the standard definition of sleep/rest in Drosophila (Hendricks et al. 2000; Ho and Sehgal 2005).",
    "There are many different ways to analyze the data collected on the DAM System but we will only provide those methods routinely used in our lab.  Microsoft Excel is used to assign genotype to different sample groups. FaasX software (M. Boudinot and F. Rouyer, Centre National de la Recherche Scientifique, Gif-sur-Yvette Cedex, France) or Insomniac (Matlab-based program; Leslie Ashmore, University of Pittsburgh, PA) are used to examine circadian (e.g. period and power) or sleep/rest (e.g. percentage sleep, mean rest bout length) parameters respectively.\n6. Representative Results\nUpon the completion of this protocol, one can use the same data set to examine both circadian and sleep parameters of the experimental animals in relation to the control animals.",
    "Analysis of circadian parameters: Eduction graphs illustrating daily locomotor activities or average activities of flies over several days in LD or DD conditions can be generated using FaasX (Figure 3). Drosophila melanogaster generally exhibit two bouts of activity; one centered around ZT0 (or CT) termed \"morning\" peak and another around ZT12 (CT 12) termed \"evening\" peak.  These two bouts of activities are controlled by the endogenous clock, and can even be observed in free-running DD conditions (Figure 3B). Changes in the timing of these activity peaks can easily be observed in eduction graphs and may indicate a change in the properties of the endogenous clock. Another property that is indicative of proper clock function is the anticipatory increase in locomotor activity observed in LD cycles that occurs prior to the actual dark-to-light or light-to-dark transitions (Figure 3A, arrows). This behavior is clearly observed in wild type flies (Figure 3A), but is absent in arrhythmic mutants such as per0 (Figure 3C) (Konopka and Benzer, PNAS, 1971). In the case of the per0 mutants, the observed \"morning\" and \"evening\" peaks in LD are purely startle responses due to abrupt changes in light/dark conditions (i.e. 'clockless' flies do not anticipate environmental changes but merely react to them). Loss of behavioral rhythmicity is much more pronounced in DD and generally manifests into the total loss of morning or evening peaks of locomotor activity (i.e. random bouts of activity and inactivity), as seen in per0 flies (Figure 3D). In addition to eduction graphs, locomotor activity data can be represented as double-plot actogram (FaasX), where two days of data are plotted sequentially on each line, but the last day's profile begins the next line of two days worth of activity (Figure 4). For example, LD1 and 2 are plotted on the first line of the actogram.",
    "The next line begins with a repeat of LD2 and is followed by LD3 and so on. Following this format, the locomotor activity data spanning the entire experiment is illustrated in the actogram. Actograms can be plotted for each individual fly, or for each fly genotype. One advantage of actograms over eduction graphs is that a change in the period length of daily activity rhythms is easily observable (Figure 4). Besides generating eduction graphs and actograms, locomotor activity data from DD condition can be submitted to FaasX to calculate the period length using a number of different programs, including Cycle-P.",
    "Analysis of sleep/rest parameters: By using the current definition of sleep/rest in Drosophila (Hendricks et al. 2000), which is five contiguous minutes of inactivity, one can analyze data recorded from locomotor activity assays and examine multiple sleep parameters using Insomniac (L. Ashmore), a Matlab-based program. The percent of time that flies spend sleeping can be calculated at different time intervals, e.g. percent sleep every hour (Figure 5A), or 12 hours (Figure 5B). Other more common sleep parameters that can be examined include mean rest bout length (Figure 5C) and wake activity count (Figure 5D). Mean sleep/rest bout length is a measure of how consolidated the sleep is and can illustrate the quality of sleep. Wake activity, as its name suggests, is a measure of the activity rate when the flies are awake. This parameter helps to differentiate between flies that are truly affected in sleep/rest behaviors vs. those that are either sick or hyperactive.  For example, flies that are simply sick may seem to sleep more because they are not as mobile. For these flies, their wake activity will be lower in relation to control animals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2157/2157fig1.jpg\nFigure 1: Flowchart outlining the major steps for assaying locomotor activity rhythms in Drosophila. The procedures are presented on the left while helpful comments are provided on the right. The amount of time required to perform necessary crosses and genetic manipulations to obtain flies with the right genotype for specific experiments is variable depending on the nature and design of the experiment. The two steps marked with asterisks (*) provide the time frame for when adult flies need to be seeded/mated to generate progenies of the appropriate age (1 to 5 days old) for the experiment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2157/2157fig2.jpg",
    "Figure 2: Wiring diagram illustrating the connections between the different components for Drosophila locomotor activity data collection using the DAM System. A dedicated computer is used to record the locomotor activity counts of Drosophila. Activity monitors are housed inside incubators equipped with temperature and lighting (On/Off) control. The computer can also be used to control the timing of light On/Off in incubators if the power source of the lighting system can be hooked up to the Power supply unit (optional). Communications between the computer and activity monitors/ incubators are managed by the Power supply interface unit. The computer, Power supply unit and incubators (if the lighting control is independent of the computer) are connected to the AC power outlet via the UPC to ensure uninterrupted monitoring of activity and continuous lighting during the light phase. It is recommended to connect all the electrical appliances to the emergency backup circuits in the facility, if available.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2157/2157fig3.jpg",
    "Figure 3: Eduction graphs generated using FaasX showing daily locomotor activity rhythms of rhythmic wild type flies (w per0 flies carrying a per+ transgene) (A and B) vs. arrhythmic w per0 mutants (C and D). Male flies were kept at 25°C and entrained for 4 days in 12:12 LD (light: dark) cycles followed by seven days in DD (constant darkness).  For each fly line, the locomotor activity levels of individual flies (n>32) were measured in 15-minute bins and then averaged to obtain a group profile representative for that line. A and C show the activity data generated from averaging the second and third days in light/dark cycle (LD 2-3) while B and D show the activity data generated from averaging the second and third days in constant darkness (DD 2-3). Vertical bars represent the activity (in arbitrary units) recorded in 15-minute bins during the light period (light grey) or the dark period (dark grey).  Horizontal bars at the bottom of LD eduction graphs; white, lights on; black, lights off.  ZT0 and ZT12 represent the start and end of the photoperiod respectively. For DD eduction graphs; CT0 and CT12 represent the start and end of the subjective day in constant dark conditions, denoted by the grey bar. In panel A, M = morning peak; E = evening peak.  The arrows in panel A represent anticipatory behavior of morning and evening peaks observed in wild type flies, which are absent in w per0 arrhythmic flies.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2157/2157fig4.jpg",
    "Figure 4: Double-plot actogram generated using the FaasX software illustrating locomotor activity data of flies with wild type, short, or long period. Male flies were kept at 25°C and entrained for 4 days in 12:12 LD cycles followed by eight days in constant darkness (DD) for the calculation of the free-running period (t) using Cycle-P in FaasX. Three fly lines with wild type period [w per0; per+; per0 mutant carrying per+ transgene], long period [w per0; per(S47A); per0 mutant carrying per(S47A) transgene], and short period [w per0; per(S47D); per0 mutant carrying per(S47D) transgene] are shown here (Chiu et al. 2008). X-axis represents ZT or CT time in LD or DD respectively, and Y-axis represents activity counts (arbitrary units) summed into 15-minute bins. The red dotted lines connect the evening peaks for each day of the experiments. Note that during LD the evening peak is 'forced' to maintain synchrony with the 24-hr LD cycle, whereas in DD the free-running period can deviate from 24 hr.  For example, for flies with short periods the timing of the evening activity will occur earlier on each successive day in DD (when plotted against a 24 hr time scale, as shown here), whereas a shift to the right is observed for flies with long periods.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2157/2157fig5.jpg",
    "Figure 5: Quantifying sleep parameters in Drosophila. Flies (Canton-S; CS) were exposed to standard 12:12 LD cycle at 25°C. Insomniac (L. Ashmore) was used to process the data and Microsoft Excel was used to generate the charts shown here. At least 70 flies were pooled to obtain the group averages and error bars (standard error of the mean) shown. (A) Baseline sleep calculated every hour; shown is a representative daily cycle. (B) Baseline sleep of representative daily cycle calculated every 12 hours. (C) Average length of each rest bout calculated in 12-hour increments. (D) Rate of waking activity calculated every 12 hours."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}