{
  "id": 18347,
  "origin_website": "Jove",
  "title": "Quantitative 3D In Silico Modeling (q3DISM) of Cerebral Amyloid-beta Phagocytosis in Rodent Models of Alzheimer's Disease",
  "procedures": [
    "Statement of research ethics: All experiments involving animals detailed herein were approved by the University of Southern California Institutional Animal Care and Use Committee (IACUC) and performed in strict accordance with National Institutes of Health guidelines and recommendations from the Association for Assessment and Accreditation of Laboratory Animal Care International.\n1. Rodent Brain Isolation and Preparation for Immunostaining\nDAY 1:\nPlace aged TgF344-AD rats (14-month-old) or APP/PS1 mice (12-month-old) under continuous deep isoflurane anesthesia (4%). Assess the depth of anesthesia by toe pinch and the absence of withdrawal reflex.\nCut through both sides of the rib cage and lift to expose the heart. Insert a 23 G needle into the left ventricle of the heart and make a small incision into the right atrium. Proceed to exsanguination by transcardial perfusion with ice-cold phosphate-buffered saline (PBS) using a peristaltic pump (30 mL for mice; 150 - 200 mL for rats).\nMake a caudal midline incision into the skin and move the skin and muscle aside. Cut through the top of the skull along the midline and between the eyes. Remove the bone plates and isolate the whole brain from the skull.\nPlace the brain into a coronal rodent brain matrix and slice it into quarters. Incubate posterior quarters O/N (16 h) in paraformaldehyde fixative (4% PFA in PBS) at 4 °C. Wash 3x in PBS, and then transfer to 70% ethanol. Caution: PFA is toxic and should be handled under a chemical hood with appropriate personal protection equipment.\nDAY 2:\nPlace brain quarters into embedding cassettes and progressively dehydrate tissue in successively more concentrated 1 h ethanol baths (70%, 80%, 95%, and 100% x3).",
    "Clear ethanol from the tissue with three successive 100% xylene baths (1 h each). Caution: Xylene is toxic and should be handled under a chemical hood with appropriate personal protection equipment.\nEmbed tissue in paraffin blocks after two molten paraffin wax baths (56 - 58 °C, 90 min each).\nDAY 3:\nCut 10 μm-thick sections of paraffin-embedded brains using a microtome. Dip sections into a water bath (50 °C for 1 min) and apply to microscope slides. Leave the slides to dry O/N, ensuring tissue adhesion to the slide.\n2. Immunostaining\nNote: Different combinations of antibodies can be utilized for the staining procedure described below. Antibody cocktails compatible with brain tissue from rats and mice are listed in Table 1.\nDAY 4:\nDeparaffinize brain sections using 2x 100% xylene baths (12 min each).\nRehydrate brain sections in successive ethanol baths — 100% for 10 min, 95% for 5 min, 80% for 10 min, and finally 70% for 15 min — followed by 3x PBS washes [5 min at RT, with light agitation]. Meanwhile, heat antigen retrieval solution to 95 - 97 °C on a hot plate with magnetic bar stirring.\nIncubate brain sections in antigen retrieval solution at 95 - 97 °C for 30 min. Then, wash 3x in PBS (5 min at RT, with light agitation).\nQuickly dry slides using delicate task wipers to avoid tissue drying, and draw a hydrophobic barrier around the tissue area with a hydrophobic barrier pen. Fill the encircled tissue region with blocking buffer [PBS containing 0.3% Triton X-100 and 10% Normal Donkey Serum (NDS)], and incubate at RT for 1 h in a humidified chamber.",
    "Replace blocking buffer with Iba1 primary antibody (diluted in blocking buffer) to label mononuclear phagocytes, and incubate O/N at 4 °C in a humidified chamber. For antibody hosts and working dilutions, see Table 1 and the Table of Materials.\nDAY 5:\nRinse primary antibody with 3x PBS baths (5 min at RT with light agitation). Incubate with fluorescent secondary antibody (conjugated with a 594 nm emission fluorophore) for 1 h (in blocking buffer at RT in the dark) followed by 3x PBS baths (5 min at RT with light agitation). At this time, maintain sections in the dark to avoid fluorescent signal bleaching.\nDAY 6 - 7:\nRepeat steps 2.5 & 2.6 with CD68 (rat brains) or LAMP1 (mouse tissue) antibodies and appropriate secondary antibodies (coupled with a 488 nm emission fluorophore) to label phagolysosomes.\nDAY 7 - 8:\nRepeat steps 2.5 & 2.6 with OC (rat tissue) or 4G8 (mouse brains) antibodies and appropriate secondary antibodies (coupled to a 647 nm fluorophore) to label Aβ deposits.\n\tNOTE: Alternatively, 6E10 antibody can be used successfully both on mouse and rat tissue. For appropriate antibody combinations, see the Table of Materials.\nAllow sections to completely dry O/N at RT in the dark. Then, cover specimens with a cover slip sealed by fluorescence mounting media containing DAPI.\n3. Acquisition of Large Z-stack Confocal Datasets\nNote: This protocol requires a fully automated laser scanning confocal microscope equipped with a 60X objective and 405 nm, 488 nm, 594 nm, and 647 nm lasers. All equipment is computer controlled by imaging and laser control software. Prior to beginning the imaging protocol, power on the computer, epifluorescent lamp, microscope, lasers and camera.\nDAY 9:",
    "Select the 60X microscope objective. Add immersion oil to the lens, and place the sample onto the microscope stage slide holder. Raise the objective until the oil makes contact with the slide. Adjust the focal plane to locate amyloid plaques in the hippocampus or cerebral cortex using epifluorescent illumination through the oculars.\nAcquire confocal images of activated mononuclear phagocytes surrounding amyloid deposits in the hippocampus or cortex of rodents by confocal microscopy (60X magnification, z-stack steps: 0.25 μm < z < 0.40 μm, number of steps 25 < n < 35).\n4. q3DISM\nNote: In order to yield significant results, we suggest analyzing a minimum of 3 images per animal/region of interest. For each image, the abundance of cells to analyze may vary depending on experimental paradigms. In the representative results shown in this report, we analyzed 3 cells/condition (e.g., mononuclear phagocytes distant from or associated with plaques; see Figures 1C - D and 2C - D).\nDAY 10:\nAnalyze confocal datasets with scientific 3D image processing and analysis software colocalization (coloc) module for spatial proximity of Iba1/CD68 (rat tissue) or Iba1/LAMP1 (mouse tissue) staining in all z-planes simultaneously. Create Iba+/CD68+ or Iba+/LAMP1+ colocalization channels that correspond to phagolysosomes within activated mononuclear phagocytes.\n\t\nSelect TRITC for channel A (corresponding to Iba1 staining coupled with 594 nm fluorophore) and FITC for channel B (corresponding to CD68 or LAMP1 staining coupled with 488 nm fluorophore). On the right-hand side of the software window for 'mode check,' select 'threshold,' and for 'coloc intensities,' select 'source channels'.\nClick 'Edit' to select 'coloc color' on the right-hand side of the software window.",
    "For each channel independently, adjust thresholds to include specific staining and exclude background/non-specific signals. Once adjusted, do not change thresholds between images to ensure an unbiased analysis. The colocalized voxels (pixels from all z-stacks) will appear in the color selected in step 4.1.2 in all z-stacks simultaneously.\nClick 'build coloc channel'. The colocalization channel created will appear in the display adjustment window.\nClick on the coloc channel to open channel statistics. The '% of volume/material A above threshold colocalized' represents the % of Iba1 signal (voxels corresponding to the 594 nm fluorophore) colocalized with LAMP1 or CD68 signal (voxels corresponding to the 488 nm fluorophore). More simply, this is the monocyte volume occupied by phagolysosomes (see Figures 1C and 2C).\n\t\tNOTE: '% of volume/material B above threshold colocalized' corresponds to % of LAMP1 or CD68 signal colocalized with Iba1. This should be close to 100%, as phagolysosomes are intracellular structures. Values are based on ratio of signal from all z-stacks above threshold colocalized.\nUsing the coloc module, analyze the coloc channel created in step 4.1 for spatial proximity with OC (rat tissue) or 4G8 (mouse tissue) Aβ signals. This allows for quantitation of Aβ encapsulated within phagolysosomes.\n\t\nSelect the channel A coloc dataset (corresponding to the Iba1/CD68 or Iba1/LAMP1 coloc channel created in step 4.1) and Cy5 for channel B (corresponding to OC or 4G8 staining coupled with 647 nm fluorophore).\nBuild a coloc channel as described in steps 4.1.2 to 4.1.5.",
    "Click on the coloc channel to open channel statistics. The '% of volume/material A above threshold colocalized' represents the % of Iba1/LAMP1 or Iba1/CD68 (voxels corresponding to the coloc channel built in step 4.1.5.) colocalized with OC or 4G8 signal (voxels corresponding to the 647 nm fluorophore). This is the phagolysosomal volume occupied by Aβ (see Figures 1D and 2D).\n\t\tNOTE: '% of volume/material B above threshold colocalized' corresponds with % of total Aβ signal colocalized with phagolysosomes. This can be used to evaluate the fraction of total Aβ deposits encapsulated within phagolysosomes (not shown in the present representative results).\nUse the surpass module to reconstruct the confocal image stacks and generate 3D models of Aβ encapsulated within monocyte phagolysosomes.\n\t\nIn the 'display adjustment' window, select TRITC (to show only Iba1 staining). In the 'volume properties' window, click 'add new surface'.\nIn step '1/5 algorithm', in 'settings,' select 'surface.' Also, in 'color,' select color type in palette or RGB and adjust transparency (red is set at 60% transparency in Figures 1B and 2B). Check box 'select region of interest'. Click next.\nIn Step '2/5 region of interest,' draw a window around the cell of interest by adjusting x, y and z coordinates (see white boxes in Figures 1A and 2A). Click next.\nIn Step '3/5 source channel', select the TRITC source channel. Check the box 'smooth,' and set surface area detail level to 0.4 μm. For 'thresholding,' select absolute intensity. Click next.\nIn Step '4/5 threshold,' adjust threshold so that the volume created overlaps perfectly with the TRITC channel signal. Click next.\nIn Step '5/5 classify surfaces,' in section 'filter type,' select objects depending on their size to be included or excluded from the volumes to be created. Click finish, execute all creation steps, and exit the wizard.",
    "Repeat steps 4.3.1 to 4.3.6 to create a 3D surface for the FITC channel (LAMP1+ or CD68+ phagolysosomes).\nRepeat steps 4.3.1 to 4.3.6 to create a 3D surface for the Cy5 channel (OC+ or 4G8+ Aβ deposits).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}