{
  "id": 5621,
  "origin_website": "Bio",
  "title": "A Novel Mouse Skin Graft Model of Vascular Tumors Driven by Akt1",
  "procedures": [
    "Important: Appropriate Institutional Animal Care and Use Committee (IACCU) approval must be obtained prior to performing the skin graft procedure in animals. Anesthetize donor and recipient mice with isoflurane anesthetic gas. The donor animal is typically sedated for 5-10 min while the punch biopsy and removal of donor skin is performed. The recipient animal is typically sedated for 20-30 min while the two skin grafts are sutured in place. Animals are adequately sedated when they do not display a response to pinching of the foot pad.For the donor mouse, chose a skin area from where the skin will be taken. In our study, we selected the back skin because the skin would be grafted at the same anatomic site on the back of the recipient mouse. Shave the hair over the skin area from where the skin graft will be taken. Be careful to avoid scratching or injuring the skin surface (Figure 3 and Video 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626194631_9565.jpgFigure 3. Procedure for removing a punch of skin from donor mouse. A-B. Shave the hair over the skin area from where the skin graft will be taken. C. Hold the skin stretched slightly and position the 10-mm punch instrument vertically on top of the stretched skin. D. Gently rotate the punch instrument until the punch cuts through the skin. E. Once the punch cuts through the skin, remove the punch. F-G. Cut out the piece of punched skin and underlying subcutaneous tissue, and place the skin on a piece of sterile gauze soaked in sterile phosphate buffered saline to keep the skin moist. A close-up photo of the host skin punch with the skin dermis side up is shown in panel G.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Skin graft procedure Place the animal onto a clean surface covered with a sterile surgical drape.",
    "Clean the shaved skin of the donor animal thoroughly with 70% alcohol wipe pads. Hold the skin stretched slightly, and position the 10-mm punch instrument vertically on top of the stretched skin. Gently rotate the punch instrument with a smooth 360° turn motion while applying downward pressure until the punch cuts through the skin (also see video demonstration of the technique by Levitt et al., 2013). Once the punch cuts through the skin and reaches its maximum depth of approximately 1-2 mm through the dermis and subcutaneous tissue, remove the punch. Cut out the piece of punched skin and underlying subcutaneous tissue with sterile fine surgical scissors. Gently remove the skin fragment with sterile fine forceps. The forceps are sterilized by autoclaving. Please note, when removing the skin, be careful to avoid crushing it by picking up the tissue piece at the edge with fine single-toothed forceps. Save the punched-out skin in order to graft it onto the back of the recipient mouse. Keep the skin graft moist by placing it onto a piece of sterile gauze soaked in 1x sterile phosphate buffered saline (PBS) solution. Hemostasis can be achieved by applying gentle pressure over the cut area with a dry sterile surgical gauze. Once this step is completed, the donor animal can be immediately euthanized per approved Institutional Animal Care and Use Committee (IACCU) protocol.Repeat the same punch biopsy procedure for the recipient mouse. Punch out a 10-mm circular piece of skin from the back of the recipient mouse. Cut out the skin fragment and the underlying subcutaneous tissue and discard it (Figure 4 and Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626194825_5787.jpgFigure 4. Procedure for suturing donor skin onto recipient mouse. A-B. Remove a piece of skin from the back of the recipient mouse using a punch device as described in Figure 3. C.",
    "Take the donor skin fragment and put it into place in the punched out area on recipient mouse. D-G. Suture donor skin fragment into place.Apply gentle pressure over the cut area with a sterile surgical gauze to stop any bleeding. Take the donor skin fragment and put it into place in the punched out area on the back of the recipient mouse. To help position the skin graft in place, use the circular skin punch as a clock face. First, place a suture stitch at 12, 3, 6 and 9 o’clock positions. Then add a suture stitch at 1:30, 4:30, 7:30 and 10:30 o’clock positions. Suture the skin fragment in place with non-absorbable nylon suture. Perform double tie knots to secure suture thread in place.When completed, clean the sutured area by gently wiping it with a sterile gauze soaked in sterile PBS solution.Keep the animal under observation on a warming plate at 37 °C until it is fully awake and moving, which typically takes about 10-15 min. Animal usually awakens and starts moving soon after anesthesia is withdrawn, so there needs to be constant observation until the animal is fully awake. Once the animal is fully awake and can move, it can be placed back into the cage with clean cage bedding, water and food (place a few food pellets on the cage floor so the animal can feed easily during the first 1-2 days post procedure). Monitor the animal daily for signs of wound infection and for evidence of healing and wound closure (Figure 5D).Sutures can be removed 10-14 days after the surgical procedure, which is approximately the time frame needed for complete skin wound healing.Successful skin engraftment is evident as the grafted donor skin becomes pink with hair growth in the skin graft (Figure 5D).",
    "Note: Detailed demonstration of the entire procedure can be viewed in our video that is included with this paper. Additional information on how to perform a skin punch biopsy can also be obtained from the video reference in Levitt et al., 2013."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}