{
  "id": 1793,
  "origin_website": "Cell",
  "title": "Detection of SARS-CoV-2 spike protein binding to ACE2 in living cells by TR-FRET",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHEK293T cells seeding – Day 1\nTiming: 30 min\nTo obtain HEK293T cells expressing SNAP-ACE2, cells are transiently transfected using transfection reagents.\nAlternatives: stable cell lines expressing SNAP-ACE2 can be used.\nFrom the stock culture of HEK293T cells, remove the cell culture medium and add 5 mL of sterile PBS to wash the cells.\nRemove the PBS and add 1 mL trypsin/EDTA solution.\nIncubate at 37°C in the cell culture incubator for 2–5 min.\nAdd 9 mL of complete DMEM medium and resuspend the cells.\nNote: Pipette the medium with cells up-and-down using a 10 mL pipette to better detach and dissociate the cells.\nCollect the cell suspension in a 15 mL conical tube.\nTake an aliquot of 10 μL of the cell suspension in a microcentrifuge tube to count the number of cells.\nSpin down the 15 mL tube containing the cells at 180×g for 5 min.\nMeanwhile, mix the 10 μL cell suspension aliquot with 10 μL trypan blue solution and transfer the 20 μL into a cell counting slide.\nCount live cells manually with a hemocytometer or with an automated cell counter to determine the cell density.\nExclude from the counting trypan blue-stained dead cells.\nCalculate the required volume of cell suspension to obtain 2 × 106 cells / mL.\nFollowing the centrifugation, aspirate the supernatant.\nResuspend the cell pellet in the proper volume of complete DMEM medium calculated to obtain 2 × 106 cells / mL.\nSeed 1 mL of cell suspension solution in a new 10 cm cell culture dish containing at least 9 mL of complete DMEM medium.\nIncubate cells for 18–24 h at 37°C in a CO2 (5%) incubator to allow cells to recover and attach to the plate.",
    "Note: Transfection can also be done in cells seeded in smaller dishes (i.e. 6-well plates) if the experimental design does not require a high number of cells (low number of data points).\nCell transfection – Day 2\nTiming: 30 min\nNote: This step is skipped if a stable cell line expressing SNAP-ACE2 is used.\nAlternatives: The protocol shown here is for the JetPEI transfection reagent following the manufacturer’s instructions (Polyplus-transfection; Ilkirch, France). Other transfection reagents can be used and the respective manufacturer’s protocol should be followed. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nPrepare the transfection solution containing the SNAP-ACE2 plasmid.\nPrepare one microcentrifuge tube per well to be transfected and mix 250 μL 150 mM NaCl with 5 μg plasmid DNA coding for SNAP-ACE2.\nIn another microcentrifuge tube, add 15 μL of JetPEI reagent to 250 μL NaCl (ratio 1:3 DNA: JetPEI). If several plates are to be transfected, multiply the volume by the number of plates.\nTransfer 250 μL of the JetPEI-NaCl solution into the microcentrifuge tube containing the DNA.\nIncubate for 15 min, at 20°C–22°C.\nDistribute the 500 μL of transfection solution, dropwise, all over the cells that are to be transfected.\nPlace the plate back in the incubator (37°C, 5% CO2) and allow cells to incubate for 48 h.\nCritical: Cells should not exceed 70% confluency before transfecting to assure an optimal transfection rate. We found that an incubation time of 48 h (post-transfection) is optimal for the expression and plasma membrane translocation of membrane proteins.\nNote: If performing the TR-FRET assay in the low-throughput format or with adherent cells, the transfected cells can be plated 24 h post-transfection (Day 3) into white 96-well plates at a density of 0.5 × 105 cells/well. Cells are then incubated for another 24 h before starting the TR-FRET assay (Day 4).",
    "Fluorescent labelling of SNAP-ACE2 – Day 4\nTiming: 1.5 h\nThis step consists in the covalent labelling of the N-terminal SNAP-tagged human ACE2 expressed at the cell surface of transfected cells with the TR-FRET-compatible terbium (Tb) fluorophore. The Lumi4-Tb SNAP substrate is a suicide substrate of the SNAP enzyme labelled with a terbium fluorophore (Keppler et al., 2003[href=https://www.wicell.org#bib4]).\nPrepare Lumi4-Tb SNAP substrate solution at 100 nM by adding 5 μL of the stock solution (0.1 mM) into 5 mL of Tag-Lite buffer 1×.\nRemove the cell culture medium and add 5 mL sterile PBS to wash the cells.\nRemove the PBS and add the 5 mL Lumi4-Tb SNAP substrate solution.\nIncubate the plate at 20°C–22°C for 1 h.\nRemove the labeling solution and add 3 mL sterile PBS to wash the cells.\nNote: PBS solution used for the washing steps can be supplemented with 1 mM CaCl2 and 0.5 mM MgCl2 to prevent detaching the cells.\nRemove the PBS and repeat the washing step with PBS.\nRemove the PBS and repeat the washing step with TagLite buffer 1×.\nRemove TagLite buffer and add 1 mL of cell dissociation solution.\nDetach and dissociate the cells by pipetting up-and-down and collect them in a 1.5 mL microcentrifuge tube.\nSpin down the 1.5 mL tube containing the cells at 1500×g for 5 min.\nRemove the supernatant and add 1 mL of TagLite buffer 1× to resuspend the cell pellet.\nVerify successful SNAP labeling\nAdd 10 μL of the cell suspension per well in two wells (duplicate) of a white 384-well plate.\nRead the plate in a plate reader using the filter configuration compatible with the excitation and emission spectra of the Terbium fluorophore. Settings in the TECAN F500 plate reader to read the Tb donor signal are shown in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_1243_9.csv",
    "Note: The Tb fluorophore emits at multiple wavelengths and it is, therefore, suitable as a donor fluorophore also for acceptors emitting at the green spectrum (see Cisbio website - https://fr.cisbio.eu/content/htrf-technology/[href=https://fr.cisbio.eu/content/htrf-technology/]). In both cases, the Tb (donor) signal is measured at 620 nm.\nCritical: ACE2 labeling is essential for the TR-FRET assay. Only proceed to the next step if successful labeling of ACE2 is obtained. Use mock-transfected cells to access the background of Tb signal. From our experience, 5 to 10-fold signal-to-background ratio indicates successful SNAP labelling. An example of Tb donor signal in SNAP-ACE2-expressing cells and in mock-transfected cells is shown in Figure 2[href=https://www.wicell.org#fig2]. Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1243-Fig2.jpg\nFigure 2. Example of Tb donor signal\nTb donor signal (at 620 nm) obtained in SNAP-ACE2-expressing cells and in mock-transfected cells, in two replicates of each group (well 1, well 2). In this experiment, HEK293T cells were transfected with 500 ug of SNAP-ACE2 construct in one well of a 6-well plate. Forty-eight hours post-transfection, cells were labelled with Lumi4-Tb substrate as described, and 10 μL of the cell suspension was used to measure the resulting Tb donor signal in the Tecan F500 plate reader. Gain was set to “optimal” and corresponded to a value of 92 in this experiment.\nTR-FRET assay\nTiming: 2–3 h\nDistribute 10 μL per well of the Tb-labeled SNAP-ACE2 cells into a white 384-well plate. It is recommended to use an electronic pipette to increase speed and accuracy.",
    "Note: Labelled cells can be diluted by a factor of 3–5 in TagLite buffer if high Tb signal is obtained. Optimal cell density and/or Tb signal will depend on the cell surface expression of SNAP-ACE2 and can be tested in advance to define the best conditions to obtain a low background signal and high signal-to-noise ratio. For example, in the experiment shown in Figure 2[href=https://www.wicell.org#fig2], cells could be used at a dilution of 3.5 times, which would result in a Tb signal still 20-fold higher than background (i.e. mock-transfected cells).\nOptional: Remaining labeled cells can be frozen and stored (−20°C) to be used later, within 2 weeks. Cell suspension solution should be divided into aliquots to avoid repeated freeze-thaw cycles.\nAdd 2 μL of test compound at the desired concentration to the “test” wells.\nNote: Working solution should be 7× concentrated.\nIn the “NSB” wells, add 2 μL of 3.5 μM non-labeled RBD (final concentration of 0.5 μM).\nIn the “BKG” and “TB” wells, add 2 μL of 1× TagLite buffer.\nSeal the plate with a plate sealing film and incubate at 20°C–22°C for 15 min.\nAdd 2 μL of Tag-lite buffer to “BKG” wells.\nAdd 2 μL of 35 nM RBD-d2 solution to all wells (final concentration of 5 nM), except in the “BKG” wells.\nIncubate the plate at 20°C–22°C for 2 h.\nNote: An overview of the order of TR-FRET reagents to be added to the different wells is shown in Table 2[href=https://www.wicell.org#tbl2].\nRead the plate in a TR-FRET-compatible plate reader. Settings in the TECAN F500 plate reader to read the TR-FRET signal are shown in Table 3[href=https://www.wicell.org#tbl3].\ntable:files/protocols_protocol_1243_10.csv\ntable:files/protocols_protocol_1243_11.csv",
    "∗When reading TR-FRET multiple times (every hour or in a kinetics mode, for example) the Gain of the donor signal should be set to a fixed value corresponding to the value obtained in the first reading.\nCritical: Perform at least triplicates for each data point (see Figure 1[href=https://www.wicell.org#fig1] for an example of plate template).\nAlternatives: other TR-FRET-compatible plate readers, such as EnVision (PerkinElmer) can also be used.\nOptional: The TR-FRET signal being stable, several reads can be performed at different time points, once every hour, for example, until equilibrium is reached. In this case, it is important to fix the “Gain” setting of the donor channel (620 nm) to a fixed value in order to be able to compare the different readings.\nAlternatives: Kinetics parameters can also be determined with slight changes in the protocol, as previously shown (Cecon et al., 2021[href=https://www.wicell.org#bib2]). To determine association kinetics parameters, read the TR-FRET signal continuously during 2 h, starting immediately after adding RBD-d2. To determine dissociation kinetics parameters, allow binding of RBD-d2 to reach equilibrium (2 h incubation) and only then add excess of non-labelled RBD to displace bound RBD-d2 and read the TR-FRET signal continuously during 2 h, starting immediately after adding non-labelled RBD.\nData analysis\nTiming: 30 min\nOnce the reading is finished, export the results file as .csv file.\nCalculate the TR-FRET signal, which is the ratio of the acceptor (RBD-d2, measured at 665 nm) over the donor (Tb-ACE2, measured at 620 nm) signals for each well. For convenience, the ratio is multiplied by 10000. An example of a TR-FRET data sheet result is shown in Table 4[href=https://www.wicell.org#tbl4]. The specific signal for each well can be obtained by subtracting the NSB signal from the TR-FRET signal.\ntable:files/protocols_protocol_1243_12.csv\n TR-FRET  signal =   Signal  665  nm    Signal  620  nm   ×  10 4",
    "Specific  Signal   ( for  each  well )  = TR - FRET  signal  −  NSB  \nNote: By performing the ratio, the TR-FRET is normalized to the donor signal, counteracting thus any potential differences in the number of cells per well. Some plate readers allow to integrate the calculation equation, providing thus the final TR-FRET signal data.\nNote: the raw data value are arbitrary units and, therefore, it is not possible to perform direct comparison of raw data between different plate readers. If such comparison is envisioned, the fold-change of the specific signal should be used.\nUse a spreadsheet or statistics software package to calculate the arithmetic mean of the triplicates.\nNote: Check that the Tb signal is homogeneous between wells to identify potential outliers. Troubleshooting 3[href=https://www.wicell.org#sec6.5]\nNormalize the data to 0–100% scale by setting the mean of the “TB” group as 100% and the mean of the “NSP” group as 0 % using a statistics software package like GraphPad Prism.\nNote: As the raw values (fluorescence signal) are given in arbitrary units, the normalization to a percentage scale allows to pool together independent repetitions of the experiment.\nUse a statistics software package like GraphPad Prism to calculate standard deviations and statistical significance and to plot the data in a graph."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Molecular Biology",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}