{
  "id": 18213,
  "origin_website": "Jove",
  "title": "Optimized LC-MS/MS Method for the High-throughput Analysis of Clinical Samples of Ivacaftor, Its Major Metabolites, and Lumacaftor in Biological Fluids of Cystic Fibrosis Patients",
  "procedures": [
    "Approval for ethics was obtained from Monash University Human Research Ethics Committee (MUHREC).\n1. Application of the Assay: Patient Sample Collection\nRecord the time when the patient takes their standard dose of either 150 mg ivacaftor or ivacaftor 125 mg /lumacaftor 200 mg.\nNote down the exact time when the patient blood sample is collected.\n\tNOTE: We recommend collecting 4-5 samples over a 24 h time course. If the collection of only one sample is possible, the indicated time point is 2.5-4 h post ivacaftor or ivacaftor-lumacaftor combination dosing as Cmax concentrations at steady state will be achievable after >5 days of consecutive treatment.\nCollect 4-5 mL of blood in commercially available untreated blue tubes.\nAfter collection of the whole blood, allow the blood to clot by leaving it undisturbed at room temperature.\n\tNOTE: This usually takes 15-30 min.\nRemove the clot by centrifuging at 1,000-2,000 x g for 10 min at 4 °C in a refrigerated centrifuge. Designate the resulting supernatant as plasma.\nFollowing centrifugation, immediately transfer the supernatant (plasma) into a clean polypropylene tube using a Pasteur pipette. Label the plasma tube with the Patient ID (e.g., Patient 1), the administered drug (e.g., ivacaftor-lumacaftor combination), and time the patient sample was collected (e.g., 2.5 h post-dosage).\nMaintain samples at 2-8 °C during handling. Once handling is completed, store samples at –20 °C.\nIf necessary, ship samples with an approved courier to the analyzing institute.\n\tNOTE: Samples are to be shipped on dry ice until arrival and should be kept at –80°C until analysis.\n2. Preparation and Processing of Incurred Samples and Standards",
    "NOTE: Plasma from healthy donors naïve to ivacaftor/lumacaftor therapy was obtained from the Australian Red Cross. To ensure the integrity, all samples/standards should be kept at 2-8 °C during collection and processing. Once handling is completed, store samples at –20 °C.\nWeigh out IVA, IVA-carboxylate, hydroxymethyl-IVA, and LUMA which will serve as a reference for the internal standards.\nPrepare two independent stock solutions of each analyte (IVA, M1, M6 and LUMA) in LC-MS grade methanol at 100 µg/mL and at 10 µg/mL.\n\tNote: Compounds will expire after 10 days on the benchtop.\nFreshly prepare LC-MS calibration standards prior to each analytical run by dilution of the calibration standards stock solutions into human plasma to achieve following concentrations: 0.01, 0.025, 0.05, 0.1, 0.2, 0.5, 1.0, 2.5, 5.0, and 10.0 µg/mL. These samples are referred to as standards.\nTo precipitate proteins, prepare 0.1% formic acid (FA) in acetonitrile (ACN, LC-MS grade) and leave in the refrigerator until needed.\n3. Pre-treatment of Incurred Samples and Standards\nAllow both patient and blank plasma samples to equilibrate to room temperature.\nVortex to mix each plasma sample for 15 s per sample.\nTransfer a 100 µL aliquot of either blank plasma for standards or patient samples for analysis into a 1.5-mL polypropylene microcentrifuge tube.\nAdd the internal standard IVA into each of the standard tubes (e.g., 0.01, 0.025, 0.05, 0.1, 0.2, 0.5, 1.0, 2.5, 5.0, and 10.0 µg/mL to cover the potential concentration range), close the lid, and vortex for 2-3 s. Note that internal standard is only added to the blank plasma and no internal standard is added to the patient samples.\nRepeat step 3.4. for the other internal standards M1, M6, and LUMA.\nSpin down each tube briefly to ensure that there are no droplets on the lid.",
    "Add 200 µL of the mix of 0.1% FA in ACN into each tube to precipitate plasma proteins.\nVortex the mixture vigorously for about 15 s.\nAllow tubes to stand for 10 min in the refrigerator.\nCentrifuge at 10,000 x g for 10 min at 4 °C, if possible.\nFilter a 200 µL aliquot of the supernatant through a 13 mm syringe filter into a 1.5 mL HPLC vial.\nTransfer 100 µL of the supernatant into the LC-MS vial for the HPLC-MS analysis.\n4. HPLC-MS Analysis\nNOTE: The HPLC-MS analysis was performed on an LC-MS system coupled with the triple quadrupole mass spectrometer (Table 1).\nTurn on the LC-MS system, place the tray with the samples in the auto-sampler.\nAttach the column to a guard column and connect to the LC-MS system.\nAttach both bottles of mobile phases (bottle A: 100% ACN; bottle B: 0.1% formic acid in water) and equilibrate the LC-MS system.\nIncorporate the following parameters into the LC-MS protocol.\nSplit the mobile phase flow before entering the mass spectrometer in a 2:1 ratio (waste: MS inlet).\nPerform a gradient elution at a flow rate of 0.5 mL/min using a mobile phase consisting of 100% ACN and 0.1% formic acid in water (starting point at 40:60, v/v). Note that the volume percent of the mobile phase changes throughout analysis.\nOperate the mass spectrometer in a positive electrospray ionization mode.\nMake sure that the LC-MS settings are as follows: ion spray voltage 4.5 kV, collision energy 295.9 V, nebulizing gas: nitrogen at 3 L/min; collision gas: argon; drying gas flow 20 L/min, lens voltage Q3: - 22 V, desolvation temperature 250 °C with a heat block temperature of 400 °C.\nInject 10 µL volume per sample.",
    "Detect analytes using multiple reaction monitoring (MRM). Monitor the ion transitions of m/z 392.49 → 393, m/z 408.49 → 409, m/z 422.47 → 423 and m/z 452.40 → 453 for IVA, IVA-M1, IVA-M6 and LUMA, respectively.\n\t\tNOTE: The newly optimized method has yet to be fully validated according to FDA standards.\n5. Calibration Curves\nConstruct the LC-MS calibration curves before each analytical run using the relationship between the peak area ratios of each of the four analytes to internal standard and the calibration standard nominal concentrations of ivacaftor (IVA-M1, IVA-M6 or LUMA) within the LC-MS settings program.\n\tNOTE: The exact steps for the construction of the calibration curve is dependent on the model of LC-MS equipment being used. This information may be available in the equipment manual.\nPerform linear least-squares regression analysis by weighting 1/C2 according to the reciprocal of concentrations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}