{
  "id": 15024,
  "origin_website": "Jove",
  "title": "Microinjection Method for Anopheles gambiae Embryos",
  "procedures": [
    "1. Preparing mosquitoes for microinjection\nSeed a cage13 (~5000 cm3) with ~100 male and 200-300 female 1-2 day adult post-eclosion mosquitoes and allow them to mate for 2 days.\nAfter the mating period, provide mosquitoes a blood meal using either 2 mL of blood with an artificial feeding device or live anesthetized animals depending on insectary practices14. The following day provide mosquitoes a second blood meal to ensure that all mated females have had an opportunity to feed and that partially-fed mosquitoes have become fully-engorged.\nUtilize the mosquitoes for embryo collections 2-4 days after the second blood meal.\n\t​NOTE: Larval nutrition is important for adult robustness and reproductive fitness. See Benedict et al. (2020) for information about how to rear healthy insects14. No significant differences in egg laying have been observed when mosquitoes are fed on an artificial feeder or live anesthetized animals. Use whichever method is routinely used for Anopheles gambiae in the insectary.\n2. Embryo preparation\nUse an aspirator to place 20-30 females in a transparent 50 mL conical tube that has been cut (with a band saw) to be open at both ends and is covered with latex dental film at one end and nylon mesh and filter paper at the other (Figure 1).\n\tNOTE: The mosquitoes will deposit their eggs onto the filter paper and the nylon mesh will keep the filter paper securely in place. Mosquito eggs are cylindrical in shape, ~500 µm in length, ~200 µm in diameter at their widest point, and tapering at the anterior and posterior ends (Figure 2).\nPlace the mosquito-filled tube in a small (60 mm x 15 mm) Petri dish filled with double-distilled water (ddH2O). Place the tube and dish in an incubator at 28 °C for 45 min (Figure 3).",
    "Remove the tube from the incubator and insert the tube into an empty cage. Gently tap the tube to allow mosquitoes to fly out and remove the tube from the cage once all mosquitoes have flown out.\nWhen the tube is free of mosquitoes, unscrew the bottom ring, remove the nylon, and use forceps to carefully remove the filter paper with the eggs from the tube. Place the filter paper in a plastic Petri dish (100 mm x 15 mm) containing a layer of filter paper moistened with ddH2O.\nObserve the eggs. Eggs that have aged to the point where they are light gray in color (Figure 4) are ready for alignment.\n\t\nIf eggs are still white, return them to the incubator and check the color every 5 min. White eggs are fragile, rupture easily, and do not survive well after the injection process resulting in low hatching.\nEggs that are dark gray or black have aged too much. Do not use them.\n3. Embryo alignment\nCut a piece of nylon blotting membrane (2 cm x 1 cm) with a razor blade, making sure that the edge is neatly trimmed.\n\tNOTE: If the edge is not straight, the eggs will not stay affixed to the membrane properly during the injection process.\nPut a membrane on a glass slide and cover the membrane with a piece of filter paper (2 cm x 2 cm), leaving ~1 mm of the membrane filter uncovered (Figure 5).\n\tNOTE: Ensure microscope slides are clean before use and use clean forceps to manipulate the membrane filter.\nWet the filter paper with deionized H2O as eggs will die if desiccated for prolonged periods of time.",
    "NOTE: Do not put too much water on the paper because the embryos will move during the injection process, but make sure that there is enough to prevent the embryo from drying (Figure 6A, B). Excess water can be removed by absorbing it with a piece of filter paper.\nGently transfer 30-50 embryos to the edge of the membrane with a paintbrush (size #0). Use the brush to align the eggs vertically along the membrane by gently rolling them over on the slide so that the ventral side (convex) is facing upward.\nOrient all the eggs in the same direction so that when the eggs are observed under the microinjection microscope, the posterior end (more pointed, Figure 6A, B) is in a down position and forms an angle of ~15° with the needle (Figure 6C). Line the entire edge of the membrane with eggs (30-50) and place the slide under the microscope for injection.\n\tNOTE: Choose the eggs carefully. Discard those that are white (too young or undeveloped) or dark gray (too old and will break the needle), and the abnormal ones (Figure 7). Make sure the filter paper remains moist at all times.\n4. DNA preparation\nPurify plasmid DNAs for injection, at the minimum, with an endotoxin-free DNA plasmid maxiprep kit following the manufacturer's protocols.\nResuspend the DNA in PCR-grade water and centrifuge at 17,100 x g in a refrigerated centrifuge for 30 min at 4 °C. Then, transfer the supernatant to a new, clean 1.5 mL conical tube. Carefully micro-pipette to avoid transferring undesired particulate matter from the column.\nPerform a second precipitation of DNA using one-tenth volume of 3M sodium acetate and a two-fold volume of 100% ethanol.",
    "Resuspend the DNA in 300-500 µL of PCR-grade water for a final plasmid concentration of 1000 ng/µL. Mix the plasmid cocktail in the injection buffer for a final plasmid concentration of 300-400 ng/µL and make 10-20 µL aliquots.\n\t​NOTE: DNA can be stored at -20 °C. DNA microinjection aliquots can be stored at -20 °C, or at -80 °C if using RNA components. Do not exceed 800 ng/µL of DNA in the injection mix because viscosity will cause the needles to clog.\n5. Needle preparation\nMake the needles by pulling 10 cm quartz capillaries using a programmable micropipette puller.\nExamine the needle under microscope to ensure that the tip is formed well. Ensure that the needle setting on the programmable puller yields a tip that starts to taper ~0.5 mm from the terminal end and ends in a fine point (see Figure 6). Needles that break easily usually have too long of a taper.\n\tNOTE: Conditions might differ depending on the needle puller (The authors will make available on request the settings for the programmable puller they use. Journal restrictions prevent us from citing a specific brand). Needles can be pulled by hand, but this requires a skill-set not available in most laboratories.\n6. Embryo microinjection\nUse a micro-loader tip to fill the needles with 2 µL of DNA mixture. Insert the needle into the needle holder and connect the automated pressure pump tubing (Figure 8).\nImportant: Align the needle so that it makes an angle of 15° with the plane of the slide (Figure 8).\nOpen the needle tip by carefully touching the first egg and inject it by inserting the tip of the needle ≤ 10 µm in the posterior pole. A successful injection will lead to a small movement of the cytoplasm within the egg.",
    "Use the microscope coaxial stage controls to move to the next egg to continue injection.\n\t\nTo ensure that the needle tip remains open and has not clogged, press the Inject button before entering another embryo and visualize the small droplet at the opening of the needle.\nIf the needle gets clogged, press the Clear button to clear the needle and repeat the droplet visualization test. Adjust the pressure as needed if the needle tip opening gets slightly bigger to ensure that the size of the droplet stays small.\nInject ~40-50 eggs with one needle.\n\t\tNOTE: Make sure the filter paper stays moist at all times. Keep sufficient back-pressure on the needle to keep it cleared. A needle that cannot be unclogged must be replaced with a new needle. Embryo placement, needle insertion and injection are made easier with microscopes that have coaxial controls for horizontal movement of the stage (Figure 9).\nAfter injections are complete, rinse the eggs off into a glass container lined with filter paper and filled with 50 mL of deionized H2O (Figure 10).\n\tNOTE: Embryos will start hatching 2 days post-injection and may take as long as 3-5 days. Hatched first instar larvae must be transferred immediately (check 2 times daily) to a clean container with water and food.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}