{
  "id": 8846,
  "origin_website": "Jove",
  "title": "Leaf Spray Mass Spectrometry: A Rapid Ambient Ionization Technique to Directly Assess Metabolites from Plant Tissues",
  "procedures": [
    "1. Modifications to Nanospray Source for Leaf Spray MS\nUse a modified nanospray source for leaf spray MS. As no fluidic components are necessary for leaf spray MS, modify the source by removing the LC probe from the source.\nAssemble the leaf spray MS wire that will apply the voltage to the plant tissue with the appropriate pin for plugging into the source. Solder the pin to one end of an insulated wire; solder a clamp to the opposite end of the wire.\n\tNOTE: The clamp (alligator clip type) may or may not have teeth. For small tissue, a clamp without teeth is preferred. An optional flex arm with a clamp may be added to the nanospray source to assist in positioning the plant tissue. Note that this protocol specifically describes how to perform leaf spray MS on a hybrid quadrupole ion trap mass analyzer MS system (see the Table of Materials); however, other MS systems may be altered to perform this technique6. Coupling leaf spray MS with a portable mass spectrometer real-time chemical analysis can be performed on-site without the need to transport the plant material to the laboratory19,20.\nPosition an anti-static floor mat on the floor below the source to reduce the electrical discharge that may occur from the source when using high voltages.\n2. Preparation of the MS System for Leaf Spray MS\nIf the system has recently been in use, allow it to cool to the touch and remove any alternative source and the sweep cone. Attach the nanospray leaf spray MS source.",
    "Create a tune file with the appropriate ionization parameters set as follows: sheath, auxiliary, and sweep gas to 0; the spray voltage to 2 - 5 kV; the capillary temperature to 150 - 250 °C; and the S-lens RF level to 50. Save the tune file with the desired parameters8,13. Optimize the voltage and temperature for the best ionization of the tissue and compound(s) of interest.\n\tNOTE: Good starting points are 4 kV and 200 °C.\nMake a method file including the leaf spray MS tune file with: positive and negative full MS; a resolution of 70,000; an AGC target of 1 x 106; a maximum IT of 200 ms; and the desired scan range m/z. Alternatively, use only 1 polarity.\n3. Preparation of Instrument, Solvents, and Plant Tissue\nNOTE: Always wear gloves, and do not use plant tissue that has been handled with bare hands. Otherwise, contaminant ions such as polyethylene glycol will dominate the spectra.\nBring the plant tissues for the analysis to the same room as the MS system to allow for a rapid sampling.\nFor plant tissue that does not have a naturally pointed tip, use a razor blade on a glass slide to cut a tapered point (Figure 2). Determine the amount of tissue needed for the analysis based on the instrument sensitivity, tissue type, and compound(s) of interest (e.g., a young S. tortuosum leaf that is ~5 mm in length).\n\t\nCut S. tortuosum leaves at 10 weeks post-germination into thin strips, each with a tapered end to form a point.\nUse forceps to gently select the plant tissue at the end that will be clamped. Holding the tissue with forceps, carefully transfer it to the clamp.\n\tCAUTION: Do not touch the instrument source if the voltage is on.",
    "Adjust the flexible arm and the wire with the clamp to position the tissue in line with the MS inlet so that the distance between the plant tissue and the ion inlet of the MS is 5 - 10 mm for the triple quadrupole (e.g., TSQ) and linear trap quadrupole (LTQ) and 10 - 50 mm for the ion trap mass analyzer (e.g., orbitrap)8.\n\t\nPlug the opposite end of the wire into the source. If the first attempts produce a low signal intensity, move the plant tissue closer to the ion inlet (refer to the Discussion for optimization).\nLoad the method file; name the data file and set the file storage location. Then turn on the MS system by clicking Play and click on Start to begin acquiring data.\nApply a solvent (e.g., methanol) using a pipet with a gel-loading tip to maximize the distance between the hands and the high voltage to protect the user.\n\tNOTE: The solvent volume required depends on the size, dryness, and texture of the tissue, typically ~2 - 20 µL. S. tortuosum leaves do not require any solvent to be added. Carefully apply the solvent and do not touch the instrument source when the voltage is on. Use LC-MS grade solvents and glassware that has been acid washed and is free of detergents. In some tissues, a signal may be observed without the addition of a solvent due to the natural water content of the plant tissue. However, a greater signal intensity and reduced S/N is typically achieved by applying a solvent to the tissue.",
    "Acquire data as long as the signal persists or until the adequate spectra have been collected, typically 30 - 60 s. If needed, apply additional solvent to maintain a high signal intensity for a longer amount of time. Stop the data acquisition and pause the MS system.\nRemove the tissue and wash the clamp with 100% methanol and a lint-free wipe. Clean the MS ion inlet after approximately 1 - 2 h of the acquisition by leaf spray MS according to the vendor's specifications. Also, clean the MS ion inlet between analyses of different tissue types.\n4. Data Quality Assessment\nOpen the data file and visually inspect the base peak mass chronogram. Check that the signal intensity is ~1.0 x 107 to 5.0 x 108. If the signal is lower, move the tissue closer to the ion inlet. If higher, the front end of the MS system will become dirty, so move the tissue further from the ion inlet.\nBased on the presence or absence of the ions of interest in the mass spectra produced, alter the parameters.\n\tNOTE: The protocol can be paused here.\n5. Tandem Mass Fragmentation\nDecide what ions are of interest for the tandem mass fragmentation (MS/MS); a mass spectra signal that is > 1.0 x 105 is sufficient for the selection of ions for MS/MS.\nMake a new method file with an inclusion list of m/z out to 4 decimal places. Click on Global lists and Inclusion. Under properties of PRM, select the fragmentation energy [e.g., normalized collision energy (NCE) of 30 - 50 is a good range to start with] and other MS/MS parameters.\n\t\nTo obtain MS/MS data for mesembrine alkaloids, fragment the following ions, 276.1583 m/z, 290.1742 m/z, and 292.1897 m/z, at NCE 35.",
    "NOTE: The MS/MS data acquisition can be performed immediately after the MS or at a later time. The same tissue can often remain clamped after a full MS and can be reused to acquire MS/MS data. However, if a respraying does not provide a sufficient signal, use a new tissue.\nLoad the MS/MS method file and a named data file. Turn on the MS system, and start acquiring data, adding a solvent if necessary. When adequate spectra have been collected, typically after 30 - 60 s, stop the acquisition.\nCollect fragmentation at many different energies when assigning fragment ions.\n\tNOTE: Since leaf spray MS lacks a chromatographic separation, the fragmentation spectra are likely to contain many ions, and fragmenting at different energies will help bring clarity.\n6. Putative Identifications by Accurate Mass and Tandem Mass Fragmentation\nMake putative identifications by referencing accurate mass measurements from publicly available metabolite databases such as Metlin21, Human Metabolome Database22, Mass Bank23, Lipid Maps24, National Institute of Standards and Technology MS Search25, ReSpect for Phytochemicals26, or GNPS27.\nAs these databases are not exhaustive, perform an additional literature review on the plant species chemically characterized as necessary.\nMatch fragmentation ions from leaf spray MS/MS to the aforementioned databases when MS/MS information is available, or to the literature. Alternatively, use a manual interpretation of MS/MS fragment ions or a fragmentation of an authentic standard performed by the direct injection or LC-MS/MS.\n7. Data Analysis\nConvert the MS raw files to mzXML files with the msConvert tool from Proteowizard28.\nUse the XCMS software package implemented in R for peak picking. Use a direct infusion processing method for the leaf spray MS analysis.\n\tNOTE: The well-annotated scripts used for data processing can be found at https://github.com/HegemanLab/Leaf-Spray-Code.",
    "To obtain semi-quantitative measurements, accounting for the experimental variability, normalize the intensity of each metabolite by the total ion current (TIC), as the leaf spray MS signal intensity can vary, in part due to slight variations in the positioning of the leaf in the source and the differences in leaf shape and size.\nAlternatively, use vendor-provided software for the data analysis or MZmine2 (to be found at http://mzmine.github.io/)29.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}