{
  "id": 9940,
  "origin_website": "Jove",
  "title": "Directed Protein Packaging within Outer Membrane Vesicles from Escherichia coli: Design, Production and Purification",
  "procedures": [
    "1. Preparation of Plasmids\nPrepare a plasmid (e.g., pET22) containing the anchor protein (OmpA) fused to a biorthogonal linkage domain (referred to in this protocol as anchor-ST), epitope tag (such as 6xHis, myc or FLAG tags for purification and identification), periplasmic localization tag, antibiotic resistance, and appropriate origin of replication based on the selected bacterial strain7.\n\t\nExtract plasmid DNA from overnight cultures using a commercially available DNA isolation kit following the manufacturer's protocol.\nPrepare a plasmid (e.g., pACYC184) containing the enzyme/protein (PTE) to be packaged within the OMV fused to the complementary bioorthogonal linkage domain to that of the anchor protein (referred to in this protocol as enzyme-SC), epitope tag, periplasmic localization tag, antibiotic resistance that is different than the anchor protein plasmid, and appropriate origin of replication based on the selected bacterial strain7.\n\t\nExtract plasmid DNA from overnight cultures using a commercially available DNA isolation kit following the manufacturer's protocol7.\n2. Generation of an OMV Packaging E. coli Culture\nPlasmid Isolation\n\t\nPurify plasmids encoding the enzyme-SC construct and anchor-ST constructs from separate maintenance cell lines using a commercial plasmid isolation kit as per manufacturer's protocol7. Determine DNA concentration and purity by measuring absorbance at 260 nm and 280 nm.\nCo-transformation\n\t\nSelect an E. coli strain that is commercially available to facilitate protein expression.\n\t\tNOTE: BL21(DE3) cells were utilized here. The T7 lysogen is required for expression of the anchor-ST construct, which relies on the T7 promoter and T7 RNA polymerase for protein expression. Use of other bacterial strains requires either the presence of the T7 lysogen gene or the use of a plasmid other than pET227.\nDilute purified plasmid DNA to equivalent molar concentrations then transform them into competent bacterial cells via either heat shock transformation or electroporation following the manufacturer's protocol for the competent cells chosen.",
    "Plate transformed cells onto antibiotic-containing Luria-Bertani (LB) agar plates with both ampicillin (pET22) and chloramphenicol (pACYC184); both present at final concentrations of 25 µg/ml.\nPlace the culture dish at 37 °C overnight to isolate only clones containing both plasmids.\n\t\tNOTE: Colonies that survive antibiotic selection will be used for all future OMV preparations. Antibiotics (ampicillin and chloramphenicol) will be added to all liquid cultures to maintain selective pressure and ensure the presence of both plasmids.\n3. OMV Production\nColony Expansion\n\t\nInoculate 5 ml of culture media (typically Terrific Broth (TB) or LB) containing antibiotics at the aforementioned concentrations (step 2.2.3) with a single colony from the selection plates described in 2.2.4.\nPerform a 1:100 fold dilution of the overnight starter culture into baffled culture flasks.\n\t\tNOTE: Use a volume of media between 250-500 ml.\nMaintain the culture at 37 °C shaking at 250 rpm to ensure that sufficient aeration of the culture is attained.\nInduction of Each Plasmid\n\t\nAllow the bacterial culture to grow to an OD600 of 0.6-0.8, approximately 3 hr of growth after inoculation of the primary growth flask.\nTo improve the final yield of PTE-SC loaded vesicles, centrifuge the entire culture at 7,000 x g for 15 min. Resuspend the cell pellet in pre-warmed, fresh culture media.\n\t\tNOTE: This optional step helps to remove any empty OMV that are present in the culture media prior to PTE-SC induction.\nMake a 20% stock solution of L-arabinose in water and sterile filter using a 0.22 µm filter. Store L-arabinose solution at 4 °C for 2-4 weeks.\nAdd the L-arabinose solution to the culture flask to a final 0.2% concentration to initiate PTE-SC production.\n\t\tNOTE: This helps to preload the periplasmic space with PTE-SC prior to promoting increased vesiculation through induction of the mutant OmpA-ST.",
    "Make a 1 M Isopropyl β-D-1-thiogalactopyranoside (IPTG) solution in water and sterile filter using a 0.22 µm filter.\n\t\tNOTE: IPTG must be used immediately once hydrated. Aliquots of IPTG can be stored frozen for 3-6 months and can be thawed immediately prior to use.\nAdd IPTG after an additional 3 hr incubation period to a final concentration of 0.5 mM to initiate production of the OmpA-ST.\nAllow the culture to grow for an additional 8-14 hr at 37 °C while shaking.\n4. OMV Purification\nRemoval of Intact Bacteria\n\t\nCentrifuge the bacterial culture media for 15 min at 7,000 x g at 4 °C to pellet intact bacteria.\nDecant, and save, the media off the top of the cell pellet post centrifugation being careful to not disturb the cell pellet.\nRepeat steps 4.1.1 and 4.1.2 for one additional centrifugation cycle to ensure all intact bacteria are removed from the culture media being sure to decant and save the media.\nRemoval of Protein Aggregates\n\t\nFurther purify the bacterial culture media using a 0.45 µm membrane filter to remove residual bacteria and undesired large cellular material.\n\t\tNOTE: Use a biologically compatible membrane material for higher recoveries and lower protein adsorption such as cellulose acetate (CA) or polyvinylidene difluoride (PVDF). Syringe filter volumes less than 100 ml and vacuum filter volumes greater than 100 ml.\n\t\t\nTo syringe filter, draw culture medium into sterile 10-50 ml syringe. Attach 0.45 µm filter to Luer end of syringe. Depress plunger and collect flow-through in a new vessel.\nTo vacuum filter, transfer culture medium to a sterile filtration apparatus. Attach unit to vacuum pump or sink aspirator to generate suction. Transfer filtered medium to new vessel.\nIsolation of OMV via Ultracentrifugation\n\t\nAdd the filtered culture media into centrifugation tubes being careful to balance opposing tubes in the centrifuge.",
    "Pellet at ~150,000 x g for 3 hr at 4 °C in an ultracentrifuge using the corresponding rotor matching both the instrument and tubes being utilized.\nDecant the OMV depleted culture media from the OMV pellet, being careful not to disturb the OMV pellet, immediately at the completion of centrifugation as allowing the OMV pellet to remain in the media will soften the pellet reducing OMV recovery.\n\t\tNOTE: This pellet will be slightly brown and depending on the starting amount of bacterial culture may or may not be visible by eye. Aspirating the media directly from the top of the centrifugation tube is also an option keeping in mind that the more media removed from the OMV pellet the more pure the final OMV sample will be.\nSave the centrifuged supernatant for later dynamic light scattering (DLS) testing to verify that the OMV particles were fully depleted from the media.\nAdd 0.5-1 ml of sterile filtered Phosphate Buffered Saline (PBS) pH 7.4 or 100 mM N-Cyclohexyl-2-aminoethanesulfonic acid (CHES) buffer at pH 8.0 to the OMV pellet allowing it to incubate for 30 min at RT. Ensure that the pellet does not dry.\n\t\tNOTE: Extremes in solution ionic strength, pH, and temperature may result in reduced OMV solubility and promote aggregation.\nCarefully pipet the purified OMV solution from the centrifuge tube, mixing gently to ensure the entire pellet has been solubilized.\n5. OMV Characterization\nUse any commercially available DLS or nanoparticle tracking software following the provided manufacturer's protocols unique to each instrument to determine OMV size distribution and particle concentration.\n\tNOTE: Here, OMV size distribution and concentration was determined utilizing NanoSight LM10 Nanoparticle Tracking and NTA 2.3 Analysis software.\n\t\nOpen the software.\nTurn on microscope and clean all surfaces on the microscope and nanoparticle tracking unit.",
    "Add ~0.5 ml of OMV sample directly to the viewing window of the particle tracking device through the Luer fitting with a 1 ml sterile syringe being sure to cover the entire viewing window without injecting any air bubbles into the system.\nPlace the nanoparticle tracking unit on the microscope stage and turn on the laser.\nClick \"Capture\" in the software.\nAdjust the microscope focus and stage to visualize the particles on the preview screen present in the software window.\nAdjust the \"Camera Shutter\" and \"Camera Gain\" until bright particles are clearly visualized on a dark background.\nAdjust capture duration to 60 sec.\nClick \"Record\".\nWhen prompted, input the sample/device temperature, label the sample, and save the video data at the completion of the each run into a user designated folder.\nKeep all analysis parameters (Detection Threshold, Blur, Min Track Length, Min Expected Particle Size) on auto detect mode and click \"Process Sequence.\"\n\t\tNOTE: Consult the manual for how each parameter can be adjusted independently to fine tune analysis results.\nRecord particle size distribution and particles/ml concentration as determined by the software.\n\t\tNOTE: A typical OMV hydrodynamic size range is between 30-200 nm with a particle/ml concentration of ~10 x 108.\nDetermining OMV Protein Content\n\t\nUse standard SDS-PAGE and Western blot protocols to assess OMV purity, enzyme production, and the SC-ST crosslinking efficiency7.\n\t\tNOTE: Crosslinking efficiency will not be 100%7.\n6. Verification of Enzyme Packaging\nPTE Activity Assay\n\t\nPerform all enzymatic assays in a suitable buffer such as 100 mM CHES buffer (pH 8) at 25 °C in either a cuvette or multiplexed in a 96/384 well plate.",
    "Add 5 µl of a 1:1,000 dilution of paraoxon in CHES buffer to 90 µl of CHES and 5 µl of purified OMV (~36-fold concentrated compared to the OMV concentration present in the culture media).\n\t\tCaution: Paraoxon is a toxic pesticide and must be handled per manufacturer and institutional guidelines.\nTake absorbance readings at regular intervals (every 20 sec for ~2 hr total reaction time) at 405 nm (ε = 18.1 mM-1cm-1) and at 348 nm (isosbestic point ε = 5.4 mM-1cm-1) to monitor the reaction progression of the chromogenic paraoxon breakdown product, p-nitrophenol.\n\t\tNOTE: At pH values above 8 the dominant deprotonated form of p-nitrophenol is present allowing for accurate monitoring at 405 nm. In all other complex or lower pH solutions it is necessary to utilize the isosbestic point of 348 nm as multiple forms of the p-nitrophenol will be present.\nCalculate initial reaction velocities by determining the slope of the linear portion of the progress curves from step 6.1.3 to compare the relative quantity of PTE in each sample, packaging efficiency, and total PTE production.\nPerform standard enzymatic assay protocols to determine KM, Vmax and kcat for the OMV encapsulated PTE.\n\t\tNOTE: A Lineweaver-Burk analysis can be utilized for determination of these kinetic parameters where the y-intercept = 1/Vmax and slope = KM/Vmax20.\nTransmembrane Substrate/Product Diffusion.\n\t\nPerform the same kinetic assay analysis as described in step 6.1 utilizing increasing concentrations of Triton X-100 in CHES buffer from 0-3% by volume.\n\t\tNOTE: The addition of Triton X-100 to the solubilized OMV functions to disrupt the lipid bilayer allowing for the contents of the OMV to be freely accessible to the reaction solution.",
    "Calculate and compare the initial velocities at each Triton X-100 level to verify transmembrane passage of the substrate/product indicated by minimal change in enzyme activity (initial velocities) compared to enzyme activity in the absence of Triton X-100. If a substantial increase in enzyme activity is observed in the presence of Triton X-100 it is likely that the substrate does not freely diffuse into the OMV.\nAssay free enzyme activity (as described above in section 6.1) in the presence of Triton X-100 to verify that enzyme activity is not inhibited by the surfactant itself.\n\t\tNOTE: If activity is greatly impacted by Triton X-100, alternative additives, such as saponins or various polysorbate/tween surfactants may be more suitable to rupture the OMV membrane.\n7. OMV Storage\nFreezing\n\t\nPlace ~100 µl aliquots of purified OMV directly into liquid nitrogen to snap freeze the aliquots being sure not to fully submerge the vials or contact any liquid nitrogen with the sample itself.\n\t\tNOTE: Purified OMV can be snap frozen directly in the buffer that was selected for solubilizing the OMV pellet during the purification process with no additional cryoprotectants necessary7.\nStore the snap frozen aliquots at -80 °C.\nThaw frozen aliquots from step 7.1.1 by placing them at RT being sure not to heat the samples.\nPrior to preparing all samples for storage in this manner perform the enzyme assay described in step 6.1 comparing initial velocities before and after freezing to verify that there is no significant loss in enzyme activity post freeze-thaw.\n\t\tNOTE: Store purified OMV at 4 °C if a reduction in enzyme activity is observed due to freezing.\nLyophilization\n\t\nLyophilize the snap frozen purified OMV aliquots utilizing commercially available lyophilization equipment21.\nStore lyophilized aliquots at RT for weeks or at -80 °C for many months.",
    "Add the same volume of purified water to the lyophilized OMV as prior to lyophilization and let stand at RT for 30 min to rehydrate the sample. Mix gently when necessary being sure not to vortex or sonicate the OMV.\nAdd lyophilized OMV powder directly to point-of-care for applications where prior dilution/solubilization is not necessary.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}