{
  "id": 4149,
  "origin_website": "Cell",
  "title": "A protocol to examine the learning effects of ‘multisystem mapping’ training combined with post-training sleep consolidation in beginning readers",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Training\n“Multisystem mappings” training\nParticipants in the T, T+S, and AC groups receive daily (weekdays) training sessions of 30 min for 3 weeks. We suppose that the distribution of the training time across the three weeks (instead of compressing it into a few days of training) is important for its efficiency, but future studies should probe the efficiency of different training regimes. Perform training in the morning, to precede nap time (that is performed after lunch). If only one researcher performs the training for all groups, he/she should do it serially in sequential 30 min time slots. In our case it was practical for the school to have the training time at 09:00, 09:35, and 10:10 but future investigations should determine it would be physiologically better if the training is placed closer to the lunch time, i.e., late morning, to reduce the gap between the training and its consolidation. It is important to counterbalance the order of the three training groups for each time slot across days by using a Latin square procedure.",
    "A typical training session comprises a sequence of short (a few minutes) multisensory-motor activities presented as games. Perform the training in reduced groups (between 8 to 15 children), for up to 2 h always with an equivalent (initial) number of participants across the T, T+S and AC groups per replica. Use only one pair of letters in each session. T and T+S groups play with opposed mirror-letters while the AC group plays with symmetrical letters. The training is built based on our “multisystem mapping” hypothetical mechanism of mirror discrimination learning for letters (Pegado et al., 2014c[href=https://www.wicell.org#bib11]). We created activities aiming to maximize mappings between systems representing letters and used pairs of mirror-letters in the training groups in order to improve the discrimination between them. The results revealed that mirror discrimination learning for letters generalises to the other assymetrical letters (non mirror-letters) : see Figure 4[href=https://www.wicell.org#fig4] of the original work). Beyond the three systems traditionally involved in letter representations at school, i.e., auditory, visual and writing gestures systems, we also included tactile perception and ‘perception for action’ activities to expand the possibilities of mappings towards the somatosensory and the dorsal system respectively.",
    "To reduce the influence of vision and to increase attention to other sensory and motor representations, for around 70% of the session time, children have their eyes closed (except for ‘perception for action’ activities, as explained below). The training sessions should typically start by blocking visual inputs with eye-masks. Three types of activities (described below) are proposed with eyes closed: 1) “air-writing”; 2) writing on paper; and 3) “perceiving letters on hands”. Closer to the end of the session (∼ 30% of the remaining time), the children open their eyes and perform the same activities again (for a shorter duration). The aim of this phase is to map the auditory, tactile, vocal and writing representations with visual representations of letters. Further, at this phase, introduce one additional activity with eyes opened: “perception for action” (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/912-Fig2.jpg\nFigure 2. Additional examples of “multisystem mapping” training activities\nAfter performing several multisensory-motor activities (e.g., writing letters on a paper) while blindfolded (A), which represents about 70% of the training time, participants remove the eye-masks and perform the same activities (for a shorter period of time) but now with eyes open (B). In this second phase of the training, a ‘perception for action’ activity is included, by asking participants to indicate, as fast as possible, parts of letters (e.g., the round part of letters ‘d’ or ‘b’) by using the left (C) and right (D) hands (simulating actions upon the letters, such as grasping), in the T and T+S groups. AC groups are requested to indicate parts of symmetrical letters (e.g., central part of letter A or letter X) with either hand. Figure reprinted with permission from Torres et al., 2021[href=https://www.wicell.org#bib14].\nExperimental training: “Multisystem mapping” for mirror letters",
    "Timing: 20/30 min (20 min of effective training + 10 min for bringing, installing and instructing the participants)\nTraining Group: the two experimental groups, i.e., Training (T) and Training + Sleep Group (T+S)\nNote: Use opposed mirror-symmetric letter pairs in this training.\nLetters included:\nMonday and Wednesday: Distinction between letters ‘b’ and ‘d’\nTuesday and Thursday: Distinction between letters ‘p’ and ‘q’\nFriday: Distinction between letters ‘s’ and ‘z’\nBlindfold activities. Sitting on their chairs, children receive a fold, which they place on their eyes at the beginning of the session. The aim is to reduce the dominance of the visual system over other systems (Rock & Victor, 1964[href=https://www.wicell.org#bib12]), eventually confusing them with visual mirror confusion) and, at the same time, to favor attention focused on the other sensory-motor systems. They also have a paper and a pencil in front of them.\nNote: Propose the activities for one letter first, then to the other letter. Finally, invite the participants to find out which of the two is being written.\nThe experimenter announces the beginning of each activity to the group.\nAir writing. Guide each child to make movements in the air with their index finger of preferred hand. Initially, these movements mimic some elementary shapes (circles, semicircles, vertical and horizontal lines), to 'warm up' (familiarisation). Then, guide the participant to make movements following the written gestures of the proposed letters (mirror-letters in this case).\nFirst, use a hand to guide the participant to passively perform the movement. Then, ask the participant to actively perform it (without the guidance of the experimenter’s hand, only by verbal instruction). After that, ask the participant to ‘guess’ a letter being traced (passively). Different sizes of letters are proposed, with the aim to create a more abstract size invariant representation of letters.",
    "Note: During the activity, pronounce the sound of the letter (letter name) continuously, either the researcher or the participant (alternating). The aim is that auditory and vocal representation of letters could map to writing gestures of letters.\nWriting on paper. This activity is similar to the previous one, but this time using the pencil and the sheet of paper placed in front of the participants. The difference here is that participants feel the resistance of the pencil on the paper when tracing the letters and the writing gestures are smaller. Apply the same principles here: an initial warming-up with elementary shapes and then starting letter gestures with 1) passive movements first, then active movements and finally guessing the letter proposed by the experimenter; 2) the use of different letter’s sizes; and 3) concomittant pronunciation of the letter name (by the researcher or by the participant, alternatively) during the activity, showing the child that when we hear or pronounce the letter “b” for instance it is different from when we do the same for the letter “d”.\n“Perceiving letters on hands”. This activity consists in tracing a letter in the hand of a participant using the researcher’s finger and asking the participant to say out loud the letter name (Figure 1[href=https://www.wicell.org#fig1]), using the same principles as described above. This activity aims to map tactile representations with articulatory and auditory representations of letters.\nNote: Conduct each of these three training activities described in steps 1b–1d with each child in a group by taking turns, moving through the group, one child at a time, while the other children wait.\nEyes-open activities",
    "Repetition of previous activities but now performed with eyes-open. After the activities with eyes closed, repeat the same activities with eyes open (but this time for a shorter period). The aim is to map the visual representations of letters with all the letter representations on the other systems.\n“Perception for action”. Here we introduce a new activity: “perception for action”. The game consists to indicate, as fast as possible, parts of letters (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nAsk participants to indicate, as fast as possible, parts of letters (e.g., the round part of letters ‘d’ or ‘b’) by using the left and right hands ((Figures 2[href=https://www.wicell.org#fig2]C and 2D); simulating action upon the letters such as grasping.\nNote: The aim is to map the dorsal visual system (\"perception for action\") with the ventral visual system (\"perception for recognition\"), as even illiterates, that did not adquire mirror discrimination (for recognition), are able to perform visual tasks where ‘action upon the images’ can be simulated (e.g., to handle a cup of tea with the correct hand) (Kolinsky and Verhaeghe, 2017[href=https://www.wicell.org#bib5]).\nControl training: “Multisystem mapping” but for symmetrical letters\nTiming: 20/30 min (20 min of effective training + 10 min for bringing, installing and instructing the participants)\nControl Group: Active Control (AC)\nNote: Symmetrical letters are used in this training.\nLetters included:\nMonday and Wednesday: Distinction between letters ‘A’ and ‘X’\nTuesday and Thursday: Distinction between letters ‘M’ and ‘U’\nFriday: Distinction between letters ‘T’ and ‘H’\nBlindfold and eyes-open activities. Apply the exact same activities performed by the experimental group (steps 1 and 2) with the active control (AC) group, but with the critical difference to use letters that are all symmetrical letters (across the vertical axis) to avoid any mirror discrimination learning.\nPart 2 : Sleep\nPost-training sleep consolidation",
    "Timing: Up to 2 h duration, starting closely after the morning training (but after lunch)\nInvite participants in the T+S group and sleep control groups to have post-training nap sessions, immediately after lunch, during the 3 weeks of the intervention, within the school setting. Participants should nap for up to 2 h a day in a quiet room of the school on mats and wearing eye masks.\nNote: while it is interesting to measure neural activity and other physiological correlates of sleep, our naturalistic experimental design does not include devices to gauge activity. Instead, the experimenter records the amount of time that each participant remains still during the nap opportunity, as a proxy of the amount of post-training sleep, for each day of intervention.\nNote: A previous school-based study (Cabral et. al, 2018[href=https://www.wicell.org#bib1]) has shown the importance of nap duration, with children receiving 30 minutes or more of sleep presenting a clear advantage relative to children receiving less than 30 minutes of sleep. We recommend long nap time (2 hours window) but future studies should determine the minimum amount for optimal effects.\nNote: even though we could hypothesize that the best timing to apply sleep would be immediately after the training, we realize during a previous piloting that this is physiologically unfeasible and it is much more natural to apply naps after lunch (see troubleshooting[href=https://www.wicell.org#troubleshooting])."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Neuroscience",
    "Behavior",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}