{
  "id": 13626,
  "origin_website": "Jove",
  "title": "Using Touch-evoked Response and Locomotion Assays to Assess Muscle Performance and Function in Zebrafish",
  "procedures": [
    "1. Touch-evoked Response Assay\nPreparation of 2 dpf Embryos for Touch-evoked Response Assay\n\t\nEnsure that the time of day at which the test is conducted is consistent between experiments because activity can vary dramatically throughout the day17,18.\n\t\t​NOTE: The experiment should be performed blinded and the order of testing randomized to minimize experimental artifacts.\nAssign the fish strains a number, which is unknown to the individual carrying out the experiment. Following this, using freely available online tools generate a random list that dictates the order of testing.\nAt least one hour prior to testing, dechorionate embryos by ripping a hole in the chorion and gently pulling the chorion apart using a pair of fine tweezers. Remove any debris from the petri dish before returning to the 28 °C incubator.\nPerforming Touch-evoked Response Assay\n\t\nHeat stage to 28 °C at least 15 min prior to starting the testing.\n\t\t​NOTE: This stage is temperature controlled and will remain at 28 °C for the duration of the testing. Temperature will affect activity and it is therefore important to maintain a constant temperature. If a heated stage is not available then the temperature of the water should be monitored and all experiments should be conducted at the same temperature.\nPlace a petri dish filled with embryo medium (5 mM NaCl, 0.17mM KCl, 0.33 mM CaCl2, 0.33 mM MgSO4 in water) onto an illuminated stage and mount the high-speed camera over the petri dish.\nLaunch the video camera recording software (such as Stream Pix 5, described here) and under the \"workspace\" tab select 1,000 frame per sec (1,000 fps) as the capture speed to ensure that fast swimming action of the fish is recorded.",
    "Working with one embryo at a time, place the embryo in the middle of the petri dish with the zebrafish clearly visible in the field of view.\n\t\t​NOTE: If the embryo swims away prior to commencement of the experiment replace it with another, as recapturing and positioning of the embryo may result in it becoming desensitized to the stimulus and repeated burst responses may promote muscle weakness in some disease models.\nBegin recording by clicking on the \"record\" button and, deliver the mechanosensory stimulus to the embryo by touching it gently with a blunt needle on the top of the head.\nStop the recording after the embryo has swum out of the field of view or returned to rest.\n\t\t​NOTE: The acceleration peaks within the first 0.2 sec of the burst escape response following the mechanical stimulus. Therefore, ensure that at least during the first 0.2 sec of the escape response recording the fish is in the field of view. Using the software described in step 1.2.3, the data will automatically be saved as a .avi video file. Alternative video capture software such as Free Video Capture or Softonic, both of which are freely available for download, could also be used.\nReturn the embryo to a new petri dish and select another embryo for testing. Perform testing on a minimum of 15 fish.\nQuantification of Swimming Behavior\n\t\nTo quantify the swimming behavior, launch the software and select the \"Single Larvae Locomotion without background subtraction\" module to open the saved .avi video file.",
    "Using the \"freehand\" or \"polygon\" tool from the menu bar select areas of the movie to be used for the analysis. Ensure that the region encompasses both the original position of the fish and the area that the fish will swim into. Make sure that the probe is excluded from the area to be analyzed. The software will automatically track the trajectory of the fish within the desired area.\nTo perform the analysis, click on \"experiment\" from the menu bar and select \"execute\". When prompted save the raw data analysis file (.phr format) in the desired location. Once saved, click on \"start\" to begin the analysis. End the analysis by clicking on \"stop\" under the \"experiment\" drop down menu. A window containing the results will be displayed.\nScroll to the right to obtain the \"maximum acceleration\" value. If desired, export this data by closing the results window and clicking on the \"export instantaneous results\" button under the \"results\" drop down menu. Select the appropriate raw data analysis file and click on open. A text file that can be opened in a spreadsheet program will be saved in the destination folder.\nRepeat this process for each individual fish and average to obtain the mean maximum acceleration for each strain (see Figure 1).\n\t\tNOTE: As an alternative to using the software described here, similar packages such as the freely available ImageJ software can be used to extract the relevant movement data. The 3D Particle Tracker plugin can be used to track swimming trajectories.\n2. Locomotion Assay — 10-min Swim Test\nPreparation of 6 dpf Embryos for Swimming Analysis",
    "If required, sort embryos for the required genotype, for example by examining expression of a fluorescent protein or by phenotype, and place into a separate petri dish (25-30 embryos per dish). Alternatively, the genotype can be determined following completion of the locomotion assay.\nAt 3 dpf, re-examine petri dishes and remove any unhatched embryos and debris. Return petri dishes to 28 °C incubator until 6 dpf.\nPerform testing of all strains between 9 am and 12 pm, which is the time at which zebrafish larvae are most active. Randomize the order of testing and position in the plate of wildtype and mutant samples to minimize the effects of circadian differences and other experimental bias.\n\t\t​NOTE: It is important that the testing time is consistent between experiments because activity can vary dramatically throughout the day.\nAt least 30 min prior to testing, place larvae into a 48-well plate with one larva per well. After transfer, fill the wells so that the water surface is just below the top of the well, ensuring there are no bubbles. Return plates to 28 °C incubator.\nTake plates out of the incubator and acclimatize in the light for five minutes prior to testing.\nPerforming Locomotion Assay\n\t\nPlace the 48-well plate into the recording chamber, which is equipped with an infrared digital camera, capturing up to 60 frames/sec, so that larvae can be detected in the dark. Check that all of the wells are placed inside the circular grid on the locomotion software and that all larvae are clearly detectable.",
    "Launch the software and select the “tracking” module. Under “file” click on “generate new protocol” and edit the number of wells used for the experiment. Set both the experiment duration and the integration period to 10 min by clicking on the \"parameters\" drop down menu and selecting the \"protocol parameters\" and subsequently the \"time\" tab. On the same \"protocol parameters\" dialogue box click on the \"options\" tab and ensure the \"Numeriscope\" checkbox is clicked following which, the \"protocol parameters\" dialogue box can be closed.\nTo set the recording areas highlight the entire grid and double click on one of the wells. Click on the “draw areas” button and draw around the top left, top right, and bottom left wells and click “build”, which allows the software to automatically determine the position of each well. Also draw in a scale bar and click on “apply to group”. Once completed, click on the “draw areas” button.\nVisually determine the detection threshold by sliding the \"detection threshold\" bar to a level at which only the fish movements are highlighted with no background signals.\n\t\t​NOTE: The detection threshold will vary between strains and thus the thresholds have to be determined whenever a new strain is tested. In the representative data presented a detection threshold of 25 mm/sec was used.\nBefore commencing testing enter movement thresholds for detection of inactivity, and small and large movements.",
    "NOTE: In the representative data presented an inactivity threshold of 6 mm/sec and an activity burst threshold of 30 mm/sec was used. The thresholds determine the minimum movement to be considered active and the level required to be considered burst activity and allow classification of activity into small (active but below burst activity thresholds) and large (greater than the burst activity threshold) movements. The thresholds can be altered depending on the activity of the particular fish strains analyzed.\n\t\t​NOTE: Although the assay can be performed in either light or dark conditions, zebrafish larvae have been shown to be more active in the dark18.\nSet the light intensity inside the chamber to be at 0% by clicking on the \"light driving settings\" button under the \"parameters\" drop down menu. On the resulting dialogue box, add the required light settings.\n\t\t​NOTE: The light intensity inside the chamber can be triggered to turn on and off during the testing time to stimulate larval activity\nClose the door of the recording chamber and start video recording.\nQuantification of Swimming Behavior\n\t\nAfter the experiment is complete, click on \"stop\" under the \"experiment\" drop down menu. A dialogue box with all the results will be displayed.\nTo access these results in excel click on \"open containing folder\" and open the excel file that appears in the resulting folder. The important parameters are \"smlct\" (small movement count), \"larct\" (large movement count), \"smldist\" (total distance covered by the fish in small movements) and \"lardist\" (total distance covered by the fish in large movements).",
    "NOTE: Following the recording, the software also returns two additional output files in the form of an .avi file (containing a video of the 10 min recording) and a .png image file (containing a visual representation of the locomotion during the 10-min experiment; see Figure 2).\nOnce the locomotion values are calculated, replay the .avi and .png files to review whether the locomotion values calculated accurately depict the swimming movements of the fish (see Figure 3).\n\t\tNOTE: As an alternative to using the software described here, packages such as the freely available ImageJ software can be used to track the locomotory behavior."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}