{
  "id": 1649,
  "origin_website": "Cell",
  "title": "CRISPR deactivation in mammalian cells using photocleavable guide RNAs",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFormation of Cas9/pcRNA ribonucleoprotein (RNP) complex\nTiming: 15 min\nThis step forms the ribonucleoprotein (RNP) complex composed of Cas9 in complex with the light-deactivatable pcRNA and tracrRNA. This RNP is allowed to stably form before direct delivery into the cell.\nAnneal light-deactivatable pcRNA with tracrRNA.\nCombine 1.2 μL pcRNA targeting DNMT3B with 1.2 μL tracrRNA (both at 100 μM in Nuclease Free Duplex Buffer) in PCR tube to form 2.4 μL of 50 μM annealed gRNA. Mix by pipetting up and down 5–10 times.\nHeat at 95°C in thermocycler for 3 min, then cool on benchtop (room temperature; 20°C) for 5 min.\nCritical: Cover tubes with aluminum foil whenever possible and be sure to avoid direct sun exposure. This would minimize unintended deactivation of pcRNA.\nFormation of RNP complex and Lonza nucleofection mixture.\nAdd Cas9 to annealed gRNA, mix by pipetting up and down 5–10 times, add PBS, then mix by pipetting again.\ntable:files/protocols_protocol_1112_3.csv\nCover the formed RNP complex with aluminum foil and leave at benchtop in room temperature (“RNP” in Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1112-Fig1.jpg\nFigure 1. Cas9 electroporation protocol into HEK293T cells\n(A) Individual reagents necessary for electroporation, including Cas9/pcRNA RNP, EP enhancer, SF mix, and cuvette.\n(B) Dissociating the cells using Trypsin, and the cells after mixing to the required single cell suspension before electroporation.\n(C) After pelleting single cell suspension and resuspending in 1 mL PBS.\n(D) After mix cell pellet with RNP solution.\n(E) Electroporation settings on the Lonza electroporator.\n(F) Beginning the electroporation after placing the cuvette in the machine.\n(G) Zoom-in of the cuvette placement in the holder from panel f. Note the visible yellow pin that is visible only with the correct orientation (red box).\n(H) Screen display a successful electroporation.",
    "Open the Lonza SF kit (Figure 1[href=https://www.wicell.org#fig1]A), which includes a cuvette, SF nucleofection reagent, and Supplement 1. In a separate tube, combine 16.4 μL of SF nucleofection reagent with 3.6 μL of Supplement 1 to form 20 μL of mixed nucleofection reagent (“SF mix” in Figure 1[href=https://www.wicell.org#fig1]A). Mix by pipetting up and down 5–10 times.\nProceed to prepare cells for electroporation in cell culture hood.\nRNP delivery into HEK293T cells\nTiming: 1 h\nThis step delivers the Cas9/pcRNA RNP into HEK293T cells using electroporation (Liu et al., 2020[href=https://www.wicell.org#bib3]). The RNP is first mixed thoroughly with the cells, then an electric pulse of optimal voltage is applied. Nanometer-scale holes in the cell membrane are formed, allowing the charged RNP particles to enter the cell. All steps are performed inside a tissue culture hood unless stated otherwise.\nPrepare 48-well plates with collagen.\nPrepare 1 mL of 1:100 collagen solution by mixing 10 μL of collagen with 1 mL of ice-cold PBS.\nAdd enough of 1:100 collagen to cover three wells of a 48-well plate (approximately 0.3 mL per well). Make sure the three wells are as spaced out as possible if on one plate. Incubate in 37°C cell culture incubator for 10 min.\nNote: To better ensure that deactivation light does not affect more than the intended well, we suggest using one well each in different 48-well plates. Here, we use multiple wells in one 48-well plate for ease of presentation. Other options include using black plates that prevent deactivation light penetration or reflection.\nTake out the plate from the incubator, move to inside the cell culture hood, remove the collagen solution, then let it dry in the cell culture hood with lid slightly ajar.\nCritical: Collagen-coated plates allow for rapid cell adherence after electroporation.\nPrepare 800,000 HEK293T cells for electroporation.",
    "Heat DMEM complete, PBS, and 0.05% Trypsin-EDTA in 37°C water bath until the solutions reach 37°C (usually takes at least 10 min).\nAspirate medium of cell culture (cells most easily grown on 1:100 collagen-coated 6-well or 10 cm plates).\nNote: 60%–90% confluency is recommended for electroporation. A fully confluent well of a 6-well plate holds around 1 million HEK293T cells. A fully confluent 10 cm plate holds around 10 million HEK293T cells.\nAdd enough pre-warmed 0.05% Trypsin-EDTA into the culture flask to completely cover cells (0.6 mL to a well of a 6-well plate, or 3 mL to a 10 cm plate).\nIncubate for 5 min in 37°C cell culture incubator to fully dissociate cells (Figure 1[href=https://www.wicell.org#fig1]B).\nCritical: Efficient transfection requires single cell suspension, which is attained with sufficiently long exposure to Trypsin.\nAdd equal volumes of DMEM complete, gently mix by pipetting 5–10 times to single cell suspension, then collect the cell suspension into a 15 mL centrifuge tube.\nCount the number of cells using hemocytometer (Weber Scientific). Load 12 μL of cell suspension into hemocytometer and visualize using a light microscope. There are four square regions to count cells. Ensure at least 30 cells are in each region for accurate cell counts. After counting all four regions, determine the average number of cells in each square region. Multiply that number by 10,000 to yield the estimated number of cells per mL.\n800,000 cells are required for each reaction. Add the volume of cell suspension that contain 800,000 cells into a separate 15 mL tube, centrifuge at 200 × g for 3 min.\nCarefully aspirate the supernatant using a pipette, removing as much as possible without disturbing the pellet. Resuspend with 2 mL PBS to wash cells (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Centrifuge at 200 × g for 3 min. Remove as much supernatant as possible using a pipette without disturbing the pellet.\nCritical: PBS wash is required to completely remove DMEM and trypsin before addition of Cas9/gRNA.\nElectroporation of HEK293T cells using Lonza nucleofector.\nTransfer the 20 μL mixed nucleofection reagent into the cell pellet to form ∼25 μL cell suspension. Mix well by pipetting up and down 5 times.\nMake sure that the cell culture hood lights are turned OFF. Then, move RNP mixture into hood and remove aluminum foil covering.\nTransfer ∼25 μL cell suspension to the 5 μL RNP mixture; add 1 μL Cas9 EP enhancer (Figure 1[href=https://www.wicell.org#fig1]D). Mix well by pipetting up and down 10 times.\nTransfer all (∼30 μL) to one unused well of the 16-well electroporation cuvette using a P20 pipette.\nCritical: Carefully add the liquid to avoid formation of bubbles. One or two bubbles is not a problem.\nGo to 4D-Nucleofector and enter settings: select the cuvette well intended for electroporation in the machine touchscreen. Next, select “Cell Line SF” from the list of options. For the electroporation code, use CA-189 for HEK293T cells (Figure 1[href=https://www.wicell.org#fig1]E). Press “OK” on touchscreen.\nThis brings up the next screen (Figure 1[href=https://www.wicell.org#fig1]F). The 4D-Nucleofector opens a slot that allows placement of the cuvette. After placing the cuvette in the holder, confirm the settings and touch “START” on touchscreen to electroporate.\nCritical: Ensure that the cuvette is placed in the right orientation in the nucleofector. The yellow pin must be visible on the side closest to the nucleofector body (Figure 1[href=https://www.wicell.org#fig1]G). If the strip is mounted in the wrong orientation, the yellow pin is hardly visible because the cuvette will not be flush in the holder.",
    "Critical: Use some method of labeling which wells have already be used for electroporation. This can be done by labeling the cuvette cap accordingly, but please ensure that the orientation of the cuvette cap is consistent relative to the cuvette.\nNote: White precipitate may appear after electroporation and is not cause for concern. If anything, it is a visual cue that the electroporation worked.\nAppearance of a green ‘+’ indicates successful electroporation (Figure 1[href=https://www.wicell.org#fig1]H). After electroporation, go back to culture hood with lights OFF, add 50 μL of PBS into cuvette, transfer all to 250 μL PBS in an Eppendorf tube for ∼330 μL total.\nAdd 50 μL each to three wells of 48-well plate (A, B, C) (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_1112_4.csv\nAdd 300 μL “DMEM complete” media only to wells B and C (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1112-Fig2.jpg\nFigure 2. Light illumination for deactivation of Cas9/pcRNA\n(A) Sample A has 50 μL of PBS. Sample B and C have 50 μL PBS + 300 μL DMEM complete.\n(B) Sample A is illuminated by the LED flashlight for 1 min. The flashlight is balanced and centered on the well. To avoid unintended illumination of multiple wells, we suggest separating each well into different 48-well plates. For this protocol, multiple wells were used in the same plate for ease of presentation in the figure.\n(C) Cells in Sample A one hour after electroporation and light illumination. Cells are healthy and already adhering to the well. Scale bar corresponds to 100 μm.\nDeactivation of Cas9/pcRNAs using light illumination\nTiming: 30 min\nDeactivation right after electroporation to well A (containing 50 μL cells in PBS).\nTurn on 365 nm LED flashlight, hold it 2 cm above well A for 1 min (Figure 2[href=https://www.wicell.org#fig2]B). Cells in well A are now deactivated.",
    "Add 300 μL “DMEM complete” media to well A. Cover plate with aluminum foil, move back to incubator.\nDeactivation at 1 h after electroporation to well B.\nBy 1 h after electroporation, HEK293T cells should be adherent if collagen is coated properly (Figure 2[href=https://www.wicell.org#fig2]C).\nFirst carefully remove most of the media from well B using a pipette. Be sure to not disturb the recently adhered cells.\nTurn on 365 nm LED flashlight, hold it 2 cm above well B for 1 min.\nCritical: DMEM complete can partially block the light, which greatly reduces deactivation efficiency.\nAdd back 300 μL fresh “DMEM complete” media. Cover plate with aluminum foil, move back to incubator.\nHarvest genomic DNA (gDNA) and detect indel mutations via sanger sequencing\nTiming: 3 h\nGenomic DNA from HEK293T cells exposed to various conditions are purified, then subject to PCR to amplify ∼400 bp product that includes the edited region of the genome. Approximately 10 ng of genomic DNA input is sufficient for high quality PCR that accurately quantifies editing efficiency using Sanger Sequencing.\nHarvest genomic DNA (gDNA) from HEK293T cells.\n3 days after electroporation, wash cells off 48-well plates with 200 μL PBS, using pipette or cell scraper.\nNote: Between 10,000 to 1 million cells should be sampled to yield enough gDNA and properly estimate the frequency of indels. In this experiment, there are approximately 100,000 cells initially plated to each 48-well after electroporation, which increases to approximately 300,000 after 3 days of cell growth and division.\nFrom cells suspended in 200 μL PBS, purify genomic DNA (gDNA) using DNeasy Blood & Tissue Kit following manufacturer’s protocol. Elute in 100 μL AE supplied with kit. Store gDNA in −20°C.",
    "Optional: Measure DNA concentration using the NanoDrop 2000 UV-Vis spectrophotometer. Estimation of DNA concentration should be greater than 10 ng/μL.\nPause point: continue with PCR any time.\nPerform PCR to amplify region around Cas9 target site. The forward and reverse primers used are HEKs4_F and HEKs4_R, respectively, from Table 1[href=https://www.wicell.org#tbl1].\nCombine for PCR reaction. Mix by pipetting up and down 5–10 times.\ntable:files/protocols_protocol_1112_5.csv\nStart thermocycling protocol (for HEKs4_F/HEKs4_R primer set)\ntable:files/protocols_protocol_1112_6.csv\nExtract PCR-amplified target DNA with QIAquick PCR Purification Kit following manufacturer’s protocol[href=https://www.qiagen.com/us/resources/resourcedetail?id=e0fab087-ea52-4c16-b79f-c224bf760c39]. The following reagents except 3 M sodium acetate (NaAc) are supplied with the kit. Briefly, adding 50 μL PB (binding buffer), 10 μL of 3 M NaAc, mix using a pipette, then loading a spin column. Spin in microcentrifuge at 17,900 × g for 1 min, decant the collection tube, then load 750 μL PE (wash buffer). Spin with same protocol, decant the collection tube, then spin again to dry spin column membrane. Elute in 30 μL EB.\nOptional: Measure DNA concentration using the NanoDrop 2000 UV-Vis spectrophotometer. Estimation of DNA concentration should be greater than 1 ng/μL.\nOptional: Run PCR product on gel electrophoresis. We use E-Gel® EX Gel, 2% pre-cast gels on the E-Gel® iBase™ Power System/E-Gel™ Safe Imager™ Real-Time Transilluminator. Running PCR product on gel electrophoresis should yield a band of the expected size.\nSubmit 10 μL for Sanger Sequencing, using the Fwd and/or Rev PCR primer as the sequencing primer. We use GeneWiz or a core facility at our institution.\nAlso sequence wild type HEK293T cells for a “negative control” sample with no genome editing.\nPause point: continue with Sanger sequencing analysis any time.\nEvaluate genome editing efficiencies from Sanger sequencing results using TIDE: Tracking of Indels by DEcomposition (Brinkman et al., 2014[href=https://www.wicell.org#bib1]).\nObtain Sanger sequencing reads in .ab extension format.",
    "Directly visualize the Sanger sequencing traces using a program such as SnapGene.\nVisit the TIDE website.\nEnter GGCACTGCGGCTGGAGGTGG as the guide sequence for HEK site 4.\nEnter the .ab sequencing file for the negative control under “Control Sample Chromatogram (.ab1 or .scf)”\nEnter the .ab sequencing file for the intended sample under “Test Sample Chromatogram (.ab1 or .scf)”\nPress the blue “Update View” button. The results will automatically update on the main website panel."
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular/Chemical Probes",
    "Biotechnology And Bioengineering",
    "Crispr",
    "Cell Biology",
    "Cell-Based Assays",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}