{
  "id": 18078,
  "origin_website": "Jove",
  "title": "Endoscopic Septoplasty with Limited Two-line Resection: Minimally Invasive Surgery for Septal Deviation",
  "procedures": [
    "This procedure, which involved human subjects, was approved by the Institutional Review Board of the Eye and ENT Hospital, Fudan University, China. All the enrolled patients provided written informed consent.\n1. Preparation for Surgery\nBefore surgery, examine the patient's nasal cavity with anterior rhinoscopy, endoscopy, and computed tomography (CT) scans to confirm and locate the deviations and to identify the indications15.\nAsk the patient to assess the patency of their nose as a whole and to indicate this on a visual analog scale (VAS) before surgery.\n\tNOTE: The total length of the scale was 10 cm, with one extreme being an entirely clear nose (i.e., 0 cm scoring 0%), the other extreme a completely blocked nose (10 cm scoring 100%), and the center a nose with a 50% blockage.\nRemove the vibrissae in both nasal vestibules 1 day before surgery.\nOn the day of the surgery, administer general anesthesia to the patient after placing them on the operating table16.\n\tNOTE: Induce anesthesia with 2 - 2.5 mg/kg of propofol, 0.2 µg/kg of sulfentanyl, and 0.6 of mg/kg rocuronium. Maintain the anesthesia with a continuous intravenous infusion of remifentanil of 0.1 µg/kg/min and an inhalation of sevoflurane (0.8 minimal alveolar concentration).\nTilt the operating table 30° (to the dorsal elevated position) and put the patient's head in a neutral position (neither flexed nor extended).\n2. Surgical Procedure\nNOTE: Use a 0-degree endoscope during the entire operation.\nSteep 8 pieces of gauze (6 cm x 60 cm) with a mixed solution of 20 mL of 1% tetracaine and 4 mL of 0.1% epinephrine. Put 1 soaked piece of gauze into each nasal cavity for 5 min to shrink the nasal mucosa.\nPut the inferior turbinate toward the lateral wall of the nasal cavity with the elevator at the end of the procedure.",
    "Infiltrate the septum using a needle attached to a 5 mL syringe with several milliliters of a mixed solution of 20 mL of 0.9% NaCl and 0.05 mL of 0.1% epinephrine in the subperichondrial and subperiosteal planes of both sides of the septum.\n\tNOTE: If the septum was deviated to both sides, we defined the convex side as the side of the anterior deviation.\nMake a Killian incision at the mucocutaneous junction ipsilaterally on the side of the maximal deviation (i.e., the convex side) of the septal cartilage with a No. 15 blade. Start the vertical incision on the septum as high as possible, continue to the floor of the nasal cavity, and curve posteriorly as it reaches the floor of the nasal cavity.\n\tNOTE: The incision needs to penetrate the mucous-perichondrium of the nasal septum.\nRaise the mucosal flap in the subperichondrial plane with the suction elevator in case of bleeding. Without bleeding, raise the flap with a 2 mm or 5 mm elevator. Extend the elevation as high as possible upwards and to the floor of the nasal cavity downwards to fully expose the cartilaginous and bony septum on the convex side.\nMake a vertical incision using the sharp end of the 2-mm elevator or a number 15 blade on the cartilage inferior to the dorsum and anterior to the junction of the quadrangular cartilage and perpendicular plate of the ethmoid bone (i.e., the first line of the 2LoRs). Likewise, make a horizontal incision on the cartilage superior to the junction of the quadrangular cartilage, vomer bone, and maxillary crest (i.e., the second line) (Figure 2A).\n\tNOTE: In this way, the septal cartilage is mobilized from its posterior and inferior attachment to the bony septum, and the anterior and superior attachment is kept intact.",
    "Elevate the contralateral mucoperiosteum to expose the bony septum bilaterally with the suction elevator.\nResect two strips of the posterior and inferior margins of the septal cartilage and the adjacent bony septum (Figure 1B).\n\t\nResect 1/4 to 1/3 (occasionally 1/3 to 1/2) of the original width of the cartilage in the anteroposterior dimension on the first line (Figure 2B).\nResect 1/4 to 1/3 (occasionally 1/3 to 1/2) of the original height of the cartilage in the vertical dimension on the second line (Figure 2C).\nRemove the thickening bony septal deviations and perform a partial fracture displacement to move the deviation back to the midline. \n\tNOTE: The extensive removal of the posterior and inferior bony septum is to clear all of the thickness and deformities in this region.\nControl any intraoperative bleeding by electrocoagulation.\nApproximate the mucosal flaps by two interrupted sutures with absorbable materials (Figure 2D).\n\t\nStart the sutures posterior to the incision, pass them through the septum to the opposite side, and then pull them back from the skin anterior to the incision site.\nKnot the sutures on themselves, respectively. Place the two sutures parallel, one above the other.\n3. Procedure and Assessment After Surgery\nPack the nasal cavity with nasopore.\nReview the patient 1 week after the surgery to check if there is a hematoma or infection of the septum.\nExamine the nasal cavity with anterior rhinoscopy and 0-degree endoscopy and ask the patient to assess the patency of their nose with VAS 6 months after the surgery.\nRecord postoperative septum hematoma, transient dental pain, hypesthesia, synechiae, epistaxis, septum abscess, septum swing, septal perforation, and dorsum collapse as surgical complications.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}