{
  "id": 3181,
  "origin_website": "Cell",
  "title": "Using the single-cell imaging system and orthotropic footpad injection to establish mouse models for experimental and spontaneous melanoma metastasis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProtocol for a single-cell imaging system to track metastatic cell survival in vivo\nTiming: 2 days\nThis section describes the protocol of the single-cell image system to track the fate of fluorescently labeled single tumor cells reaching the lung. Upon completing the section, the early survival of metastatic tumor cells arriving in the lung has been determined and quantified. The protocol can be applied to any tumor cells.\nLabel B16F1 tumor cells: 2 h.\nNote: Before labeling tumor cells, dissolve the lyophilized CMFDA in DMSO to a stock concentration of 10 mM. Dilute the stock solution to a working concentration of 5 μM in a serum-free medium.\nTumor cell line preparation.\nCulture tumor cells to a confluency of 60%–70% (3 dish-175 cm).\nNote: Make sure to have enough cells for in vivo injections the next day.\nRemove the cultural media.\nWash cells with Phosphate-Buffered Saline (PBS) 2 times.\nGently add 5 mL of 5 μM CMFDA working solution in a 175 cm dish.\nIncubate for 30 min under growth conditions of 37°C and 5% CO2 in a cell culture incubator.\nGently remove the CMFDA working solution, and wash with PBS 2 times.\nAdd cell culture media and incubate for another 30 min in the same cell culture condition in a cell culture incubator.\nImage labeled cells as a pre-labeled in vitro group using green (emission 517 nm and excitation 492 nm) filters under fluorescence microscopy.\nCollect the labeled cells in 5 × 106 cells/mL in serum-free media and keep them on ice for tail vein injection into mice.\nInjection of labeled tumor cells: 30–45 min",
    "Note: After labeled cells are collected, 1 × 106 cells (200 μL of 5 × 106 cells/mL) are immediately delivered to mice (5 mice per condition group) by tail vein injection using a 27 1/2-GA needle.\nPrepare the mice: place mice under a heating light to maintain body temperature.\nLoad the syringe with a 27/ 1/2-GA needle and draw the tumor cells into a sterile syringe.\nLocate the vein.\nGently restrain the mouse by holding its tail using a mouse restraining device.\nNote: The tail vein can usually be seen through the skin as a thin blue line.\nGrasp the tail firmly just below the area where you will be injecting and disinfect the area with alcohol.\nInsert the needle into the vein at a shallow angle (less than 30 degrees) and advance it about 1–2 mm (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2754-Fig1.jpg\nFigure 1. Diagram of the single-cell imaging system to track the survival of metastatic cells reaching the lung\n(A) Tail vein cell delivery.\n(B) Lung insufflation.\n(C) Representation of images of labeled tumor cells reached the lung at 1-, 6- and 24-h time points after injection. The total number of labeled tumor cells at the 1-h time point was presented 100%. The percent of metastatic survival was determined by normalizing the mean number of cells at 6 or 24 h with the mean number of cells at 1 h for each mouse lung. Scale bars: 200 μm.\nAspirate to confirm that the needle is in the vein, then slowly inject 200 μL of cells into the vein of the mouse. Be sure to inject slowly and avoid causing damage to the vein.\nNote: Aspiration is tricky. A gently negative pressure applies to the plunger to avoid introducing possible bubbles.",
    "Remove the needle gently and apply pressure to the injection site with a sterile gauze pad to stop any bleeding. Continue until all groups of mice are completed (10–20 mice per group).\nMonitor the mice closely for any signs of distress or adverse effects following the injection.\nNote: Tail vein injections should only be performed by trained personnel with appropriate ethical approval and in compliance with institutional and regulatory guidelines.\nEuthanize the mice at 1, 6, or 24 h after injection. Five mice were injected per cell line per time point.\nNote: Euthanize the mice by CO2 inhalation with an initial 30%–60% flow rate for 2–3 min to minimize stress to the mouse breathing and lungs, then increase the CO2 flow rate by 70%–90% for an extra 2 min. The euthanasia steps are critical to prevent any lung hemorrhage and alveoli breakage caused by a high flow rate of CO2.\nLung insufflation (Figure 1[href=https://www.wicell.org#fig1]B). 10–30 min.\nSet up the insufflation apparatus using a 20 mL syringe connected to a 35 mL Extension Set Priming Volume, DEHP-Free and Latex-Free Male and Female luer locks with Slide Clamp to monitor PBS volume and flow rate.\nConsistency of insufflation of the lungs to the right size without under or over insufflation with PBS (approximately volume per lung 0.75–1.0 mL).\nSpray the mice with 70% alcohol before placing them in the tissue culture hood for lung extraction.\nA mid-transverse skin incision is made at the mid-abdominal area and the skin should be pulled over in opposite directions (cranial-caudal) to expose the thoracic and abdominal cavities.\nMake an incision on the ventral midabdominal line alba close to the xiphoid process, then follow with an incision into the abdominal cavity to expose the mouse diaphragm.\nCut into the mouse diaphragm without lacerating the lungs.",
    "Make a bilateral incision along the sternum to the first rib cage.\nPull the sternum cranially to expose the trachea.\nCanulate the trachea at the intercartilaginous ligament with a 20G × 1″ IV Angio-catheter approximately 1/2 inch.\nRemove the stylet needle and advance the catheter.\nPlace a single loose suture with 2-0 Vicryl underneath the proximal trachea and leave the suture loose.\nConnect the extension IV set primed with PBS into the IV catheter and hold it in place.\nNote: the lungs will be expanded approximately 30–45 seconds after insufflation is completed.\nLock the IV set with the slide clamp.\nSlightly pull IV catheter.\nGently tie up the distal trachea with 2-0 Vicryl suture without rupturing it to avoid any leakage of insufflated PBS.\nNote: This will prevent the mouse lung from collapsing.\nDissect the mouse lungs surgically.\nCut the trachea distally without compromising the suture on the trachea.\nUse the trachea or hold the mouse heart with a thumb dressing forceps to dissect the lungs out using straight iris scissors.\nCut the lung mediastinal ligamentum.\nCut the attachment of the diaphragm that connects to the mouse liver and gently remove the lungs.\nPlace and rinse the mouse lung in cold PBS for 30–45 s to get rid of any blood debris.\nThe lungs (L1, L2. L3, L4, L5) are then immediately transferred into a 50 mL conical tube containing 35 mL PBS at 4°C supplemented with penicillin 100 U/mL/streptomycin 10 μg/mL for surface fluoresce microscopy imaging on a Leica DM IRB Widefield Fluorescence Microscope equipped with a filter set appropriate for imaging green fluorescent protein (GFP).",
    "Note: Each mouse lung was imaged one time only per each time point at 1 h, 6 h, and 24 h by taking 10 random surface fluorescent pictures of each single mouse lung (L1, L2, L3, L4, L5) using Improvision's Openlab 3.1 scientific image acquisition software, then all lung pictures were saved until ready to be analyzed and quantified. In addition, Improvision's Openlab 3.1 scientific image acquisition software was programmed to read and analyze each event at a size of 10 photons or greater, any event smaller than 10 photons was not read or analyzed; this was considered an artifact or background noise (Figure 1[href=https://www.wicell.org#fig1]C).\nAfter imaging each timepoint (1 h, 6 h, 24 h), place all five lungs in a 50 mL conical tube filled with 35 mL of 10% formaldehyde buffered for H&E analysis.\nImages analysis.\nUse Improvision's Openlab 3.1 scientific image acquisition software to analyze and quantify the total sum of the surface fluorescent area in the 10 images of each single mouse lung (L1, L2, L3, L4, L5) per timepoint.\nUse Microsoft Excel to graph the average number of all five-lung surface fluorescent events (L1, L2, L3, L4, L5) at 1 h, 6 h, 24 h.\nSubtract the average number of each timepoint at 6 h, 24 hr from the average baseline number at 1 h timepoint.\nNote: Quantification of lung fluorescent events was validated using both enumeration of surface fluorescent event counts and mean fluorescent area.",
    "Statistical analysis: Nonparametric t-test and ANOVA were used for image analysis. Statistical analyses were performed using GraphPad Prism version 3.0 for Macintosh (GraphPad Software). The percent metastatic survival is determined by normalizing the mean number of cells at 6 h or 24 h with the mean number of cells at 1 h for each mouse lung (Figure 1[href=https://www.wicell.org#fig1]C). Statistical significance was defined as P ≤ 0.05.1[href=https://www.wicell.org#bib1],5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7]\nEstablishment of experimental melanoma metastasis model by tail vein injection\nTiming: 3 weeks\nThis section describes the procedure to develop the experimental metastasis model by tail vein injection. Upon completion of the section, the metastatic potential of tumor cells has been measured quickly and easily. The protocol can be applied to any tumor cells.\nTumor cells preparation: 1 h.\nNote: Tumor cell lines should be cultured to a 70%–85% confluency.\nTrypsinize tumor cells, and centrifuge down with 1200 rpm for 5 min.\nWash the tumor cells with 10 mL serum-free media.\nResuspend the tumor cells in serum-free media at a concentration of 2.5 × 106/mL for B16F1, and 5 × 106 for A375 cells and keep the cells on ice for injection as soon as possible.\nTumor cells injection: 1–2 h.\nPrepare the mice: place mice under a heating light to maintain body temperature.\nLoad the syringe with a 27/ 1/2-GA needle and draw the tumor cells into a sterile syringe.\nLocate the vein.\nGently restrain the mouse by holding its tail using a mouse restraining device.\nNote: The tail vein can usually be seen through the skin as a thin blue line.\nGrasp the tail firmly just below the area where you will be injecting and disinfect the area with alcohol.\nInsert the needle into the vein at a shallow angle (less than 30 degrees) and advance it about 1–2 mm (Figure 2[href=https://www.wicell.org#fig2]A).",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2754-Fig2.jpg\nFigure 2. Diagram of experimental metastasis model by tail vein injection\n(A) Tail vein injection of 5 × 105 B16F1-PTENΔLP tumor cells.\n(B) Lung metastases 3 weeks after injection.\n(C) Images of a lung section with micrometastases. Scale bars: 1 cm.\nAspirate to confirm that the needle is in the vein, then slowly inject 200 μL of cells into the vein of the mouse.\nNote: Be sure to inject slowly and avoid causing damage to the vein.\nRemove the needle gently and apply pressure to the injection site with a sterile gauze pad to stop any bleeding.\nNote: Continue until all groups of mice are completed (10–20 mice per group).\nMonitor the mice closely for any signs of distress or adverse effects following the injection.\nCheck tumor metastasis.\nThree weeks after the transplantation of tumor cells, euthanize the mice with CO2.\nDissect the mouse from the ventral side.\nInject the fixing solution of 10% Buffered Formalin Phosphate into the lung through the trachea.\nVisually count the number of macro-metastases in the lung.\nTransfer the lung with tumor metastasis in the 10% Buffered Formalin Phosphate fixing solution.\nNote: The fixed lungs should also be paraffin-embedded and sectioned for H&E staining for counting micro-metastasis under the microscopy (Figure 2[href=https://www.wicell.org#fig2]).1[href=https://www.wicell.org#bib1],8[href=https://www.wicell.org#bib8]\nNote: Tail vein injections should only be performed by trained personnel with appropriate ethical approval and in compliance with institutional and regulatory guidelines.\nEstablishment of the spontaneous metastasis model by an orthotropic footpad injection\nTiming: 6 weeks\nThis section describes that the spontaneous metastasis model by the orthotropic footpad injection can more completely mimic the actual complexity of the metastatic process and is more relevant to assess distant metastases.\nTumor cells preparation: 1–2 h.\nNote: Tumor cell lines should be cultured to a 70%–85% confluency.",
    "Trypsinize tumor cells, collect the tumor cells in 10 mL culture media, and centrifuge down with 1200 rpm for 5 min.\nWash tumor cells with 10 mL serum-free media, resuspend in serum-free media at a concentration of 5 × 107 cells/mL, and keep on ice for the next step as soon as possible.\nFootpad injection: 1–2 h.\nFill a syringe with a 30-GA needle with the appropriate amount of cells to be administered.\nNote: The amount that can be injected into a footpad is 20 μL per mouse.\nPlace the mouse in a restraining device with one hind foot isolated and extended by gently grasping the skin above the stifle.\nWipe the foot with alcohol to sterilize and remove debris before injecting.\nHold the toes of the extended foot before releasing the skin at the stifle.\nInject 20 μL tumor cells subcutaneously into the center of the hind footpad at a shallow angle (less than 30 degrees) and slowly advance it about 2–3 mm (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2754-Fig3.jpg\nFigure 3. Diagram of the orthotropic spontaneous metastasis model by footpad transplantation\n(A) 1 × 106 A375p ENTPD5 tumor cells were delivered by footpad injection.\n(B) Representative image of mice with the local foot tumor (white arrow) at 6 weeks after footpad injection.\n(C) Representative lung metastases of tumor cells at 6 weeks after footpad injection.\n(D) Image of lung section with micrometastases.\n(E) Image of liver metastases.\n(F) Image of the liver section with micrometastases. Scale bars: 1 cm.\nNote: This is the critical step; any leakage will affect the result (Figure 3[href=https://www.wicell.org#fig3]A).\nRemove the needle and observe for bleeding.\nApply light pressure to the puncture site if bleeding occurs.\nReturn the animals to the cage.",
    "Monitor the animal: Watch the animal closely for any signs of distress or adverse effects following the injection.\nCheck the metastasis (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2754_1.csv\nSix weeks after injection, euthanize the mice with CO2.\nLay the ventral side up of the mouse and dissect it.\nInject the fixing solution of 10% Buffered Formalin Phosphate into the lung through the trachea and visually count the number of macro-metastases in the lung.\nCount the number of metastases in other organs.\nFix the organs with tumor metastasis in the 10% Buffered Formalin Phosphate fixing solution.\nNote: The organs with metastatic tumors can also be sectioned for H&E staining for counting micro-metastasis under a microscope (Figure 3[href=https://www.wicell.org#fig3]).1[href=https://www.wicell.org#bib1],2[href=https://www.wicell.org#bib2],9[href=https://www.wicell.org#bib9]\nNote: Footpad injections should only be performed by trained personnel with appropriate ethical approval and in compliance with institutional and regulatory guidelines. Also, note that the volume of injection should be limited to no more than 50 μL to avoid overloading the footpad, which can cause tissue damage and pain to the animal.\nAnalysis of the metastasis\nTumor numbers are obtained by visual inspection of tissues in mice euthanized 3 weeks (tail vein injection) or 6 weeks (footpad injection) post-transplantation. Micrometastases should be counted by a pathologist's evaluation after the dissection of the lung. Statistical analyses can be performed as follows: unpaired t-test (two-tailed) for all column datasets. The p-values of less than 0.05 are considered statistically significant."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}