{
  "id": 4126,
  "origin_website": "Cell",
  "title": "A protocol for whole-mount immuno-coupled hybridization chain reaction (WICHCR) in zebrafish embryos and larvae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample preparation\nTiming: 2 days\nIn this step, zebrafish embryos/larvae are sorted and collected at the time points required for the analysis the researcher wishes to carry out. In this protocol, zebrafish larvae were collected at 3 days post fertilization (dpf).\nNote: All incubations in this section are carried out at 20°C–25°C without agitation, unless otherwise described in the protocol.\nRecently fertilized zebrafish embryos are collected and cultured in 1× E3 culture media and switched to 0.0045% 1-phenyl 2-thiourea (PTU)/E3 solution after 22 hpf to maintain transparency, which allows better imaging of older embryos/larvae. PTU has been shown at this concentration to not exhibit developmental effects (Karlsson et al., 2001[href=https://www.wicell.org#bib7]).\nEmbryos can be dechorionated as early as 16 hpf by adding 100 μL of Pronase stock and incubating for 30 min. Swirl plates occasionally to facilitate chorion removal, once chorions are removed rinse embryos with 1× E3 culture media 3 times, to remove any residual Pronase and chorion debris.\nAlternatives: embryos can be manually dechorionated by using a pair of fine tweezers.\nAt the desired developmental stage, sort and collect previously dechorionated zebrafish embryos/larvae into 1.5 mL microcentrifuge tubes, between 15 and 20 specimens per tube are recommended. Sex characteristics are indistinguishable in embryonic and larval zebrafish. Both sexes are typically represented in a clutch.\nAdd 1 mL of freshly thawed 4% PFA per tube, to fix samples for ∼16 h at 4°C.\nNote: The fixation in 4% PFA should be performed for at least 16 hours to a maximum of two days at 4°C. We have seen that over fixation leads to higher background, especially in the fluorescent range similar to the GFP emission spectra.\nAlternatives: Samples can also be fixed at 20°C–25°C for 4 hours without affecting WICHCR signal.",
    "Wash samples with 1 mL of 1× PBS 3 times for 5 min per wash.\nCritical: Discard the liquid waste according to the PFA handling specifications.\nDehydrate and permeabilize the samples with a series of methanol (MeOH) washes (1 mL each):\n100 % MeOH for 10 min\n100% MeOH for 10 min\nStore samples at −20°C for ∼16 h before use.\nPause point: Samples can be stored for up to six months at −20°C after this step. If relying on endogenous fluorescence for the detection of one marker, the embryos should be as freshly prepared as possible due to loss of endogenous fluorescence.\nSample rehydration and permeabilization\nTiming: ∼4 h (depending on the embryo/larvae stage)\nAfter samples have been dehydrated and chilled in methanol, in this section the tissue is rehydrated and permeabilized for easy access of the HCR probes and antibodies inside of the embryo/larvae.\nNote: All incubations in this section are carried out at 20°C–25°C without agitation, unless otherwise described. The volume added in each step is 500 μL, except where specified volumes are used.\nRehydrate with a series of graded MeOH/PBST for 5 min each:\n75% MeOH/ 25% 1× PBST\n50% MeOH/ 50% 1× PBST\n25% MeOH/ 75% 1× PBST\n2 times in 100% 1× PBST\nIncubate samples for 12 min at −20°C in 100% acetone to further permeabilize embryos.\nNote: The acetone permeabilization is performed, irrespective of the developmental stage of the samples collected, to improve permeability. Acetone must be pre-chilled at −20°C.\nWash 3 times for 5 min each in 1× PBST.\nIncubate with 10 μg/mL Proteinase K diluted in 1× PBST. The incubation time depends on the embryo/larvae age, measured in either hours post fertilization (hpf) or days post fertilization (dpf). Optimal times for Proteinase K digestion per stage are depicted in Table 1[href=https://www.wicell.org#tbl1].",
    "table:files/protocols_protocol_891_13.csv\nCritical: PK stock aliquots should be thawed a maximum of 4 times before discarding. We have found that many cycles of freeze/thaw decrease the enzyme efficiency, thus affecting embryo permeability.\nWash samples 3 times with PBST without incubation.\nFix samples with 4% PFA for 20 min.\nWash samples 5 times for 5 min each with 1 mL 1× of PBST.\nNote: If you are validating a new antibody for the first time in this protocol, we recommend that you do so first in a pilot assay in wild-type tissue staged similarly to your planned experimental assay without completing the HCR step. Please proceed directly to step 28 and continue the protocol as written.\nPause point: If the protocol cannot be immediately continued, samples can be left in PBST at 4°C before moving on to next step for up to 4 days. However, the HCR hybridization step is recommended to be started the same day the permeabilization is performed.\nHCR hybridization\nTiming: 1 h + 12–16 h hybridization\nIn this step, zebrafish embryos/larvae are equilibrated in probe hybridization buffer and then incubated with HCR probe sets for hybridization with its target mRNA. Here, 3 dpf zebrafish larvae were hybridized with probe sets against elavl3 and phox2bb (for the 3-marker experiment), or with sox10, barx1, and mitfa (for the 5-marker spectrally deconvolved experiment), for more specifics on marker combinations please see the expected outcomes[href=https://www.wicell.org#expected-outcomes] section. Details on probe hybridization buffer are listed in the key resources table[href=https://www.wicell.org#key-resources-table].\nPre-warm probe hybridization buffer to 37°C.\nCritical: Probe hybridization buffer contains formamide, careful handling is recommended.\nPre-hybridize samples with 250 μL of probe hybridization buffer for 30 min at 37°C.\nThaw all the HCR probe sets that will be used for the experiment while the samples are pre-hybridizing.",
    "Prepare HCR probe mixture solution by adding 2–3 pmol of each probe set (2–3 μL of each 1 μM probe set stock) into 250 μL of probe hybridization buffer. Mix gently by pipetting up and down.\nNote: Larger volumes of probe mixture solution may be prepared if analyzing multiple tissue conditions (multiple tubes of embryos/larvae) with identical probe set combinations. For example, if analyzing three different experimental conditions of embryos with the same markers, prepare 6–9 μL of each probe set into 750 μL of probe hybridization buffer, allotting 250 μL of probe solution per condition.\nNote: Some HCR probe sets, especially the ones with smaller probe set sizes, have been found to work better at higher concentrations. Using 4–5 μL with such probes has given us great results.\nPre-warm the probe mixture solution at 37°C for 15 min, before adding to the samples. This can be done in parallel with sample pre-hybridization.\nReplace pre-hybridization solution with probe mixture solution and incubate the samples for 12–16 h at 37°C.\nHCR probe washes and HCR amplification\nTiming: 2 h + 12–16 h HCR amplification\nThe goal of this step is to remove unbound HCR probes and initiate HCR signal amplification by choosing the correct amplifier for the wavelength desired for detection. For more details on amplifiers used for the 3-marker experiment and 5-marker experiment performed for this protocol, go to expected outcomes. Details on probe wash buffer and amplification buffer are listed in the key resource table[href=https://www.wicell.org#key-resources-table].\nNote: All incubations in this section are carried out at 20°C–25°C without agitation, unless otherwise described.\nNote: Preheat probe wash buffer to 37°C before use. Additionally, let amplification buffer equilibrate at 20°C–25°C while washing samples.",
    "Remove probe mixture solution and wash excess probe 4 times for 15 min each wash with 250 μL of pre-warmed probe wash buffer. Maintain samples at 37°C during washes.\nNote: Probe mixture solution can be saved at −20°C for reuse, however it is possible to see reduced signal with repeated use. Label tube containing probe mixture solution with probe sets used and number of times used.\nWash larvae 2 times for 5 min each with 500 μL 5× SSCT.\nNote: Make sure the amplification buffer has warmed up to 20°C–25°C before proceeding.\nPre-amplify larvae with 250 μL of 20°C–25°C probe amplification buffer for 30 min.\nThaw all the amplifier hairpins that will be used for the experiment while the samples are pre-amplifying.\nAdd 3–5 μL of the first amplifier hairpin h1 (3 μM stocks), per tissue condition, in a sterile tube. In a separate tube add an equal volume of amplifier hairpin h2. Repeat this step for each different B isoform that was used during probe hybridization, taking care such that each amplifier corresponds to only one B isoform. Carefully label each tube for the corresponding hairpin number and B isoform, as well as detection wavelength.\nCritical: Make sure to select both hairpins h1 and h2 for the correct B isoform and wavelength desired.\nCritical: Amplifier hairpins should be protected from light as much as possible.\nNote: If analyzing multiple tissue conditions (multiple tubes of embryos/larvae) with identical probe set combinations, the amount of amplifier hairpins should be scaled accordingly. For example, if analyzing three different experimental conditions with the same markers, prepare 9–15 μL of amplifier hairpin h1 and an equal volume of amplifier hairpin h2 in separate tubes for each B isoform used in the experiment.",
    "Snap cool the amplifier hairpins by heating all amplifier hairpin tubes at 95°C for 90 s and then let them cool to 20°C–25°C in a dark drawer for 30 min.\nPrepare amplifier hairpin mixture solution by adding the snap cooled h1 and h2 hairpins to 250 μL of amplification buffer per tissue condition.\nReplace pre-amplification buffer with amplifier hairpin mixture solution, adding 250 μL of solution per tube. Incubate all samples for 12–16 h at 20°C–25°C protected from light.\nCritical: From now on samples should be covered with an opaque cover, such as aluminum foil, and protected from light at all times. We have found desk drawers work well for incubations. Carry out the sample manipulations very carefully but as fast as possible to minimize light exposure.\nHCR amplification hairpin washes and antibody detection\nTiming: 3 days\nIn this step, we finish the HCR component of the WICHCR protocol by removing excess amplifier hairpins and prepare the samples for primary antibody detection. For more details on antibodies and their respective concentrations used for the 3-marker experiment and 5-marker experiment performed for this protocol, please review the expected outcomes section.\nNote: All incubations in this section are carried out at 20°C–25°C without agitation, unless otherwise described. The volume added in each step is 500 μL, except where specified volumes are used.\nCritical: Continue to keep samples protected from exposure to light, such as with aluminum foil covers and storage in a dark drawer during incubations. Additionally, we recommend working quickly to minimize prolonged light exposure when manipulating samples.\nWash excess amplifier hairpins by washing with successive 5× SSCT as follows:\n2 washes for 5 min each\n2 washes for 30 min each\n1 final wash for 5 min",
    "Remove 5× SSCT to wash tissue with 1× PBST 3 times for 5 min per wash.\nCheck fluorescence under a fluorescence macroscope (Olympus MVX10 Macroview Stereo Fluorescence Microscope or similar) to confirm correct HCR pattern.\nCritical: Visually confirm that HCR signal is detectable every time you reach this step before moving on to the following steps. HCR signal may be faint for some fluorophore combinations, requiring close examination. Minimize exposure of tissue to high intensity lasers to reduce photobleaching. If no signal is detected please see the troubleshooting[href=https://www.wicell.org#troubleshooting] section.\nNote: If you are validating a new HCR probe for the first time in this protocol, we recommend that you do so first in a pilot assay in wild-type tissue staged similarly to your planned experimental assay without completing the antibody detection step. Please proceed directly to step 36 and continue the protocol as written.\nPause point: Samples can be left in 1× PBST for a few hours up to 12–16 hours, if needed, before moving on to next step.\nDispense 5% goat block solution to samples for 1–2 h at 20°C–25°C or for 12–16 h at 4°C.\nPause point: Samples can also be blocked at 4°C for 12–16 hours, due to experimental time constraints. We have not observed any notable benefit to 12–16 hours blocking with the antibodies tested in our lab.\nNote: Animal serum used for the block solution should be carefully selected based on the antibody combinations that will be used. Sterile technique is encouraged when working with animal serums to avoid bacterial contamination of tissue samples. We have successfully carried out WICHCR protocol with goat and donkey serums.\nPrepare primary antibody solution by diluting the appropriate antibodies with the previously confirmed working concentration in block solution.",
    "Remove blocking solution and replace with diluted primary antibody solution. Incubate tissue with primary antibody solution for ∼16 h at 4°C.\nNote: Some antibodies may demonstrate higher specificity with longer primary incubation times. We highly recommend performing optimizations for concentration, incubation time, and secondary antibody compatibility prior to starting a WICHCR protocol. Volume of antibody solution added may vary based on dilution constraints. The volume should always be enough to cover the embryos, which is typically between 100–500 μL per tissue condition.\nWash excess primary antibody 6 times for 30 min with 1× PBST.\nPrepare secondary antibody solution by diluting the corresponding secondary antibodies with the previously confirmed working concentration in block solution.\nIncubate samples in secondary antibody solution for ∼16 h at 4°C.\nNote: Some antibodies may demonstrate improved signal with longer secondary incubation times. We highly recommend performing optimizations for concentration, incubation time, and primary antibody compatibility prior to starting a WICHCR protocol. Volume of antibody solution added may vary based on dilution constraints. The volume should always be enough to cover the embryos, which is typically between 100–500 μL per tissue condition.\nWash out excess secondary antibody 6 x 30 min with 1× PBST.\nCheck antibody and HCR signal under a fluorescence macroscope (Olympus MVX10 Macroview Stereo Fluorescence Microscope or similar) to confirm retained HCR signal and correct antibody staining.\nCritical: Always confirm antibody signal is detectable before moving on.\nImaging preparation and photodocumentation\nTiming: 1 day + Imaging time\nIn this stage, finished WICHCR samples with confirmed signal are prepared for imaging by glycerol clearing and then mounting them for high resolution imaging.\nAlternatives: This imaging prep protocol can be adapted or substituted according to each lab’s imaging preparations.",
    "Critical: Continue protecting samples from ambient light by covering with foil and storing in a dark drawer during incubations to reduce photobleaching.\nClear embryos in serial glycerol solutions at 20°C–25°C by sequentially adding 500 μL of:\n25% glycerol/ 75% 1× PBST\n50% glycerol/ 50% 1× PBST\n75% glycerol/ 25% 1× PBST\nNote: Embryos/larvae should fall to the bottom of the tube before moving on to the next glycerol concentration.\nNote: Samples can be stored in 75% glycerol/ 25% 1× PBST, covered from light for up to one week at 4°C. However, it is highly recommended to image them as soon as possible.\nMount embryos in 75% glycerol/ 25% 1× PBST for imaging in confocal microscope, to achieve a high resolution image. Image using the settings required to capture the signal in the regions of interest.\nAfter imaging, process and analyze the data according to the experimental outline and using the image analysis software of preference."
  ],
  "subjectAreas": [
    "Antibody",
    "Microscopy",
    "In Situ Hybridization",
    "Developmental Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}