{
  "id": 4784,
  "origin_website": "Bio",
  "title": "Character-State Reconstruction to Infer Ancestral Protein-Protein Interaction Patterns",
  "procedures": [
    "Compilation of the character matrixA character matrix is constructed that contains the names of the proteins and their interaction properties. This can be done using an Excel spreadsheet. Alternatively, data may be entered directly in Mesquite (Figure 1). It is possible to collate information for several interacting partners in separate columns. To conduct a likelihood character-state reconstruction with Mesquite (see below) data have to be coded categorically, i.e. ‘0’ for no interaction and ‘1’ for an interaction. Combinations for which the interactions status is unknown are left blank. Theoretically, one may also introduce three or more categories, e.g. ‘0’: no interaction; ‘1’: weak interaction; ‘2’ strong interaction. However, one needs to be aware of the fact that the categories are still discrete and do not follow a hierarchy (e.g. there is no constraint such that evolution has to proceed from ‘no’ to ‘weak’ to ‘strong’ interactions).Coding of interactions can be complicated by the phylogenetic history of the interaction partner. Consider an example in which protein A interacts with protein B in a certain model organism. In another organism, one ortholog of A, termed A’ here, may exist, but two co-orthologs of B, (B’ and B’’) occur. If A’ interacts with B’ but not with B’’ it is difficult to assign an interaction status to A’ (Figure 2). One compromise is to designate A’ as interacting as long as an interaction with either B’ or B’’ is observed (Melzer et al., 2014). The situation gets more complicated if only incomplete data sets are available. Assume, for example, A’ is not interacting with B’’, but information on the interaction between A’ and B’ is not available. In this case, one may designate the interaction status of A’ as unknown to avoid the inclusion of false negatives in the dataset (Melzer et al.",
    ", 2014). It is difficult to estimate how frequently these problems will appear in a particular dataset. It is therefore important to consider the phylogenetic history of the interaction partner in character-state reconstructions.If the interaction data gathered rely on different methods it is helpful to also collect data for each method separately (Figure 1). This will later reveal whether the results of the character-state reconstruction depend on the method used to obtain the interaction data.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150821/20150821174337_3229.jpgFigure 1. Screenshot from a character matrix in Mesquite. Protein names are listed in the second (coloured) column. Interaction characteristics are listed in subsequent columns. Data on homodimerization as well as on heterodimerization with other proteins and data obtained with different techniques (Y2H: yeast two-hybrid; EMSA: electrophoretic mobility shift assay) are collated in separate columns.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150821/20150821065733_8601.jpgFigure 2. Duplications can complicate coding interactions. Proteins A and B interact in species 1 (as indicated by the double arrow). In species 2, A’ interacts with B’ but not with B’’. This raises the question as how to code the interaction status of A’. Phylogenetic reconstructionA phylogeny covering all of the proteins under study needs to be constructed using one of the many software tools available (e.g. MrBayes, MEGA 6, Bali-Phy, PhyML, see also Table 1). For an overview of basic concepts and methods in phylogeny reconstruction see De Bruyn et al. (2014). The phylogeny can be constructed using the sequences of the proteins under study. However, in principle every tree can be used as long as each protein is assigned to a specific position in the tree. Protein names in the character matrix described above and in the phylogenetic tree have to be identical to be later able to connect the two datasets.",
    "Mesquite also offers the possibility to manually draw trees; this may be used for cases in which a computational phylogenetic reconstruction is not feasible. The phylogeny may contain proteins for which interaction data are not available. These will later be ignored by the character-state analysis. Character-state reconstructionThe character-state reconstruction is done using Mesquite. For general instructions on how to handle Mesquite one may visit the ‘Mesquite ProjectTeam’ YouTube channel (https://www.youtube.com/channel/UCfSmgC0O_dWLI0PEoXZbS4Q[href=https://www.youtube.com/channel/UCfSmgC0O_dWLI0PEoXZbS4Q]).Import/generate tree:Mesquite allows to import trees from other files in several ways (http://mesquiteproject.wikispaces.com/Trees[href=http://mesquiteproject.wikispaces.com/Trees]). If trees are read from NEXUS files note that Mesquite cannot handle some special characters (e.g. dash) if present in protein names. When importing a phylogenetic tree, the branch lengths will later be taken into consideration for the character-state reconstruction. If a manually drawn tree is used, all branch lengths will by default be set to 1. This may work well in a number of cases, but it should be kept in mind that proteins from early diverging taxa may possess artificially short branches under this setting (Figure 3). However, Mesquite also allows editing branch lengths (https://mesquiteproject.wikispaces.com/Trees[href=https://mesquiteproject.wikispaces.com/Trees]). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171219/20171219194255_3669.jpgFigure 3. Screenshot of a manually drawn tree in Mesquite. A. Branches are by default displayed so that all tips reach the same level. However, branch lengths are by default set to one, as can be seen in B, where branches of the same tree are displayed proportional to length (see scaling on the right side of the tree). This reveals that some branches (e.g. that leading to Amborella trichopoda AmAP3) might be unreasonable short.Import/generate data matrix: There are several ways to generate or import a data matrix implemented in Mesquite (http://mesquiteproject.wikispaces.com/Characters+%26+Matrices[href=http://mesquiteproject.wikispaces.com/Characters+%26+Matrices]). A straightforward approach is to generate a new blank data matrix with the required number of characters and copy/paste the interaction data from the original data source (i.e.",
    "from the Excel spreadsheet). The matrix needs to be specified as categorical to be used for the character state reconstruction.Model specification and character reconstruction:Mesquite provides an extensive documentation on the different settings for the character-state reconstruction: http://mesquiteproject.wikispaces.com/Ancestral+States[href=http://mesquiteproject.wikispaces.com/Ancestral+States]. In our analyses we employed likelihood reconstruction methods (Melzer et al., 2014), but parsimony reconstructions are also available (Li et al., 2015). Two general models can be used for likelihood reconstructions: The ‘Markov k-state 1 parameter model’ (Mk1) and the ‘Asymmetrical Markov k-state 2 parameter model’ (AsymmMk). The principal difference between these two models is that the 2 parameter model allows ‘forward’ and ‘backward’ rates to be different, i.e. the probabilities for gaining and losing an interaction can be different. In the 1 parameter model, gaining and losing an interaction is equally probable. Biologically, it would in most cases make more sense to apply the 2 parameter model, as one may assume that it is more likely to lose an interaction than gaining it. However, several reports have shown that 2 parameter models can lead to implausible results if small to medium sized datasets (data on less than 100 protein-protein interactions) are being used (Mooers and Schluter, 1999; Pagel, 1999). A likelihood ratio test can be used to infer whether the 2 parameter model significantly improves the fit of the model to the data as compared to the 1 parameter model (Pagel, 1999; Ree and Donoghue, 1999). This test is performed by subtracting the - log probability values derived from the two models and multiplying the absolute value of the result by 2 (|(-logLMk1)-(-logLAsymmMk)|•2). The resulting number can be used as test statistic for a Chi-square test with one degree of freedom.",
    "The test is also integrated in Mesquite an can be conducted via Analysis: Tree > Values for Current Tree > Asymmetry Likelihood Ratio Test.In the Mk1 and AsymmMk models, the rate of a character’s evolution is estimated by Mesquite (http://mesquiteproject.wikispaces.com/Processes+of+Character+Evolution#param[href=http://mesquiteproject.wikispaces.com/Processes+of+Character+Evolution#param]). However, it is also possible to create own models with specific parameters (http://mesquiteproject.wikispaces.com/Ancestral+States#editingModels[href=http://mesquiteproject.wikispaces.com/Ancestral+States#editingModels]). This can be useful if, for example, the probability of gaining vs. losing an interaction is known from prior experimental evidence. Evaluation of the results: Results are best visualized using pie charts at the internal nodes of the tree (Figure 4). Mesquite offers the possibility to conduct the character-state reconstruction simultaneously over different phylogenetic trees. Also, several characters can be traced at once. This facilitates comparison of character-state reconstructions of one protein with different partners or comparison of character-state reconstructions based on different methods used to assay protein-protein interactions.Export options: Mesquite can export trees and character matrices in numerous ways (http://mesquiteproject.wikispaces.com/Interactions+with+Other+Programs[href=http://mesquiteproject.wikispaces.com/Interactions+with+Other+Programs]). For a graphical representation of the character state reconstruction results we recommend to export the tree as PDF and use this file for further post-processing with graphics software such as Adobe Illustrator. For a direct comparison of the character state evolution of two different traits one may utilize the mirror tree function (Figure 4)."
  ],
  "subjectAreas": [
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}