{
  "id": 13225,
  "origin_website": "Jove",
  "title": "Analysis of Congenital Heart Defects in Mouse Embryos Using Qualitative and Quantitative Histological Methods",
  "procedures": [
    "All animals used in the experiments referenced in this paper were treated using the animal care guidelines of the Michigan State University Institutional Animal Care and Use Committee (IACUC).\n1. Timed mating of C57BL6/J mice for embryo production\nOnce mice have reached breeding age (6-8 weeks), put them together in harem breeding format (i.e., two females per one male). Set them up for breeding sometime in the afternoon or evening.\n\tNOTE: Mice often breed within 1 h after lights have been turned off within their housing facility. Females should be retired from breeding at about 6-8 months and males should be used no later than 12 months of age.\nIf using the weigh-in method to determine fertilization, breed mice in large groups, because the weigh-in method causes timed mating to proceed at a slower pace than methods in which only copulation plugs are monitored.\nThe next morning, check for copulation plugs sometime between 8 AM-12 PM. Ensure that this is done at the correct times. If the plug assay is performed earlier than 8 AM, there is a risk that the plug is too deep in the vaginal canal to be observed. If the plug assay is performed later than 12 PM, there is a risk of the plug having fallen out.\n\t\nGrab the female by the base of the tail and investigate the opening to the vaginal canal with the use of a micropipette tip. A copulation plug will look like a mucosal barrier (Figure 1A), which might be a bit difficult to see in some cases. Crustiness also is an indication that a copulation plug is or was present. If there is no mucosal barrier (Figure 1B) then the female likely has not mated or the copulation plug could have already fallen out.",
    "Refer to the morning of copulation as e0.5.\n\t\tNOTE: With C57BL6/J mice, copulation plugs can be difficult to identify. Therefore, sometimes the mice mated even though no plug was observed. Copulation does not always lead to conception. This is often more likely in C57BL6/J mice. Therefore, monitor weight progression to confirm pregnancy (see step 1.4). The weigh ins can help identify females that are pregnant and confirm that plugs led to conception. Take caution when mating females for consecutive nights. If a particular male is observed to be good at producing a copulation plug, that male can be trusted to mate for consecutive nights with the same female.\nKeep in mind that the chances of pregnancy are higher with mice that are proven breeders, as they have successfully been bred before. To increase the chances of having proven breeders, the males used should not be too old.\nFollowing the plug assay, weigh the females. This weighing should be followed up 7-10 days later. If weight gain exceeds 1.73 g, then the mouse is likely pregnant20. If weight gain is below 1.73 g, it is likely unrelated to pregnancy and the mouse should be reintroduced to the breeding population.\n\tNOTE: C57BL6/J mice produce small litters (five to six embryos on average). Weigh in methods to determine pregnancy are accurate for the majority. Using this method provides a 12.8% false positive rate and will exclude 3% of females that are actually pregnant20. If the researcher is worried that the desired gestational time is later, proceed to step 1.5",
    "Optional: The day when the dissection is going to take place, ensure that pregnancy has progressed by physical inspection. Grab the female by the base of the tail and stretch the body out. This is easiest to do by placing the mouse on the wrist and gently pulling the base of the tail. If the female is pregnant, then there likely will be weight gain specifically in the lower torso, and it will appear as small lumps.\n\tNOTE: Pregnancy can be palpable as early as e12.5 and will be palpable by e14.5 in most cases. C57BL6/J mice have small litter sizes, therefore the female might be pregnant even if there are no physical signs.\n2. Dissection of females and embryos for heart recovery\nPrior to the start of the dissection, prepare the following solutions at room temperature.\n\t\nDissolve ethylenediaminetetraacetic acid (EDTA) into phosphate buffered saline (PBS) at a 0.5 mM concentration.\n\t\tNOTE: Once prepared, it is preferable to keep the solution on ice and only use it at 4 °C. If contamination is a concern, it should be autoclaved prior to use.\nDissolve paraformaldehyde (PFA) into PBS at a 4% concentration.\n\t\tNOTE: Once prepared, it is preferable to keep the solution on ice and only use it at 4 °C. Store at 4 °C or colder for long-term storage. The concentration of the PFA solution can vary depending on the downstream applications of the tissue samples. This percentage is used for hematoxylin and eosin staining, immunohistochemistry, and immunofluorescent staining.",
    "Once the female has reached the desired gestational stage, the mouse should be euthanized at the correct time of day according to the approved guidelines of animal use. If timings are on the half day (e.g., e15.5) they should be sacrificed close to 12 PM. If timings are on whole days (e.g., e15.0) they should be sacrificed close to 12 AM.\n\tNOTE: Conception is assumed to occur near midnight during the night the mice are paired. However, it is difficult to determine the exact time of conception. Due to this, timing is estimated, not exact.\nAfter pinning the four limbs down, carefully make an I-shaped incision along the torso, starting from around the urethra up towards the sternum.\nThe uterus will likely be located just above the pelvic region. The mouse uterus is Y-shaped; therefore, it will likely be very long and wrapped around the torso. Remove it by gently lifting it. Do this using the sides of fine forceps in a scooping motion. The superficial tissues of the uterus can be grabbed very carefully by the tips of the fine forceps when initially pulling the uterus out. Use scissors to cut the uterus from the body.\n\tNOTE: Keeping in mind the unusual Y-shaped of the uterus, make sure the entire uterus is removed.\nSoak the uterus in ice-cold PBS. Pin one end of the uterus down and stretch it out into a single line.\nCut the uterus into sections, each section containing a separate embryo. Gently peel out the embryo with fine forceps. This is easiest to do with a pair of forceps in each hand. Once removed, place the embryo immediately into a new Petri dish filled with PBS-EDTA solution at 4 °C.",
    "NOTE: Normal PBS solution can also be used, but the EDTA prevents coagulation in the samples.\nStage the embryos using Theiler Staging21. Because staging can vary between embryos within a single litter, stage each individual embryo.\n\tNOTE: This can also provide foresight into the possible congenital heart defects in the embryos. Typically, symptoms of a congenital heart defect can be observed in the embryonic morphology. Other major defects often associated with certain heart conditions can be present.\nThe heart may be removed in a variety of ways depending on the age of the embryo.\n\tNOTE: If it is unclear whether or not the outflow tract will remain intact during removal, either remove more tissues than solely the heart (keeping the outflow tract intact and minimizing direct contact between the heart and the forceps) or analyze the whole embryo.\n\t\nUsing a dissection scope and two pairs of fine forceps, position the embryo on its back and stabilize access to the chest. This can be done by either pinning the arms down with the forceps or removing the arms and holding the torso in position.\nUse the sharp point of a second pair of fine forceps to make an incision along the sternum of the embryo and extend between the clavicles to the navel. Start by making very fine and superficial incisions while gradually working towards the inside of the chest cavity. The heart should just barely become visible. Do not contact it with the forceps during these superficial incisions.",
    "Peel the rib cage open using the first pair of forceps to gently squeeze on the torso of the embryo, slightly caudal to the rib cage. The heart should pop out or become apparent. The heart might require some gentle coaxing to come out. Use the side of the forceps, making sure that the point of the forceps never comes in contact with the heart. To keep the workspace and forceps clean, keep a lint-free wipe nearby.\nGently grab the pulmonary blood vessels with the sides of the forceps, making sure to not sever the tissue, and pull the heart out of the chest cavity. Then, clean the heart.\n\t\tNOTE: For embryos e13.5 and younger the heart is covered by the pericardium. This must be removed in order to reach the heart.\nUsing a stereoscope, take a photograph of the heart for later reference.\nRinse the hearts in PBS-EDTA solution for 1-2 min, and then place them into 4% PFA solution for approximately 45-60 min to fix them. If analysis of the whole embryo is desired, soak overnight. The volume of the PFA solution should be 5-6x the volume of the tissue being fixed.\n\tNOTE: This incubation time can vary depending on the later studies. This incubation time is used for hematoxylin and eosin staining, immunohistochemistry, and immunofluorescent staining.\nWash 5-10 min with PBS-glycine 3x and place back in PBS. Sodium azide or penicillin/streptomycin can also be added to minimize bacterial growth and preserve intact tissues. The hearts can now be stored short-term at 4 °C.\n3. Tissue preparation\nNOTE: Tissues can either be prepared using OCT (optimal cutting temperature) embedding or paraffin embedding. There are advantages and disadvantages to either method and the goal of the analysis should be considered when deciding which embedding method should be used.",
    "OCT embedding\n\tNOTE: This method may be preferable to formalin/paraffin embedding because cryosections preserve antigen reactivity, can still be used for hematoxylin and eosin staining, and produce slices faster.\n\t\nPrepare a solution of sucrose dissolved into PBS at a 30% (w/v) concentration.\nTransfer the tissues to a new 15 mL conical tube or 1.5 mL microcentrifuge tube containing PBS-30% sucrose. Initially, the tissue will float.\nPlace it at 4 °C in the fridge. The tissue will be ready for OCT embedding when it sinks to the bottom of the tube, usually in 24-40 h.\n\t\tNOTE: Muscle tissues suffer significantly during freeze/thaw cycles and lose their native morphology. Sucrose is absorbed by the tissue and works as a cryopreserving agent that allows improved preservation of the morphology. Make sure there is enough solution in the tube for the floating of the tissues to be sufficiently monitored. PBS-sucrose is easily contaminated with bacteria, so check the solution frequently for cloudiness, which indicates either fungal or bacterial overgrowth. To minimize the risk of contamination either penicillin/streptomycin or sodium azide can be added to the PBS-sucrose solution.\nRemove the hearts with a Pasteur pipette, make sure the opening of the pipette is wide enough to not tear the tissue. Cut the pipette with scissors if necessary. If working with whole embryos, use forceps to retrieve the sample.\n\t\tNOTE: Do this gently. Even if the pipette opening is wide enough to retrieve the hearts, the edges of the pipette can still tear the tissues. Forceps can indent tissue samples if used too aggressively.",
    "Briefly allow the tissue to air dry on a lint-free wipe. Place the sample in an OCT mold in the desired position for cutting (i.e., sagittal, transverse, coronal). Add OCT compound until the sample is completely submerged, making sure there are no bubbles in contact with the tissue.\nPlace the mold at -20 °C overnight or several days and then move the mold to -80 °C. After 24 h the mold is ready for cryosectioning. Tissues in this format can be stored long-term.\nParaffin Embedding\n\t\nUsing ethanol, dehydrate the tissues in this succession: 50% ethanol for 10 min, 70% ethanol for 10 min, 80% ethanol for 10 min, 95% ethanol for 10 min, 100% ethanol for 10 min (do this 3x).\nSoak the tissues in a series of ethanol/xylene solutions in this succession: 2:1 ethanol/xylene solution for 10-15 min, 1:1 ethanol/xylene solution for 10-15 min, 1:2 ethanol/xylene solution for 10-15 min, 100% xylene for 10-15 min (do this 3x).\nTo replace the xylene with paraffin, soak the tissues in a vacuum oven (set between 54-58 °C) in this succession: 2:1 xylene/paraffin solution for 30 min, 1:1 xylene/paraffin solution for 30 min, 1:2 xylene/paraffin solution for 30 min, 100% paraffin for 1-2 h, 100% paraffin for 1-2 h or overnight.\n\t\tNOTE: Heating the tissues beyond 60 °C for extended periods of time will cause the paraffin polymers to degrade and the tissue to become brittle.\nUsing fresh paraffin, embed the tissues in the desired position.\n4. Cryostat sectioning for OCT embedded tissues\nAt the cryostat, place all samples inside for a minimum of 1 h if the samples were previously stored in the -80 °C freezer. They should remain there until all of the sections have been collected.",
    "Make sure the cryostat is set at the correct temperature settings. The environmental temperature inside the cryostat chamber should be at about -20 °C and the arm of the cryostat should be at about -24 °C.\n\tNOTE: This temperature can vary depending on how the block responds to slicing. If inconsistent slicing is an issue, the temperature of the environment could be lowered.\nRemove the OCT block from its mold by pulling at the edges of the open side of the mold to loosen it and then pinching the block at the closed end, where the mold narrows.\nTo mount the OCT block, place the room temperature OCT on the chuck, starting from the middle and working to the edge. The entire chuck does not need to be covered.\nPlace the OCT block (see step 3.1) on the mold. The edge of the block that was against the closed side of the mold should be facing up on the chuck. Allow the OCT on the chuck to freeze until it is opaque white, about 5-10 min.\nPlace the chuck on the arm for another 5-10 min for the block to come to the arm temperature. To get a parallel slice, adjust the arm until the edge of the block is parallel to the stage and there is an even distance between the stage and the bottom edge of the block is the same as the stage and the top edge of the block.\nInsert the blade and adjust the distance of the block from the blade to take sections.\nTake slices at a thickness of 10 µm. Keep slicing until the point of interest is reached either manually or using the trim function.",
    "To collect slices, use a small flat paintbrush and a detail brush. When the mold begins to be cut, use the flat brush to gently pull the slice against the stand. When cutting through the sample, the movement must be continuous and without pause, although the speed can depend on the firmness of the sample.\nWhile slicing, use the flat brush to gently guide the slice as it is made. The slice does not need to be flush with the stage at this point, so allow it to billow to not cause tears or pulls and affect histology.\n\tNOTE: When slicing whole embryos, this part can be especially difficult, especially when changing tissue types. Make sure the slices are made with no pauses and the brush does not pull on the slices too aggressively. When tissue types change, the slice can break, so keeping the temperature cold is key. If breaking is an issue, decrease the temperature or increase the thickness of the sample.\nPause the movement of the block once the sample is completely cut through, but the slice is not free from the block yet. Without moving the flat brush from the slice, use the detail brush to pat the slice down to make it flat and freeze against the stage.\nHold the slice there for ~10 s before removing the detail brush and finishing the slice. Use the two paint brushes to gently flatten the slice against the stage, prevent any rolling, and hold it against the stage for ~20-30 s.\nFlip the slice and flatten against the stage again. Move an electrostatically charged slide close enough for the slice to be attracted and adhere to the slide without having to touch the slide to the stage. Label the slides with a pencil.",
    "Store the slides in an airtight box to protect the tissues from ice buildup during storage. For short-term storage, slides should be stored at -20 °C before staining. For long-term storage keep them at -80 °C.\n5. Microtome sectioning for paraffin embedded tissues\nPlace the blocks on ice prior to sectioning in order to chill the samples. When cool, paraffin slices more easily and can produce thinner slices.\nPrepare a 40-45 °C water bath using ultrapure water.\nPut the blade in the holder within the microtome. Ensure it is secure and then set the clearance angle. Make sure the clearance angle is correct. This can be checked following the manufacturer's instructions.\nPlace the paraffin block into the microtome. Make sure it is correctly oriented so that the blade will cut straight across the block.\nEnsure the blade is oriented correctly with the block by making a couple of slices. Do this carefully so that adjustments can be made.\nTrim the block until the point of interest is reached.\nMake slices at the desired thickness. Take into account that the first few slices will likely be discarded.\nPick up the sections and move them into the water bath using forceps. This should make the sections flatten out. Use the forceps to adjust them as needed.\nMove an electrostatically charged slide close enough for the slice to be attracted and adhere to the slide. Label the slides with a pencil.\nPlace all collected slides into a slide rack. Allow the slides to dry overnight at 37 °C.\n6. Deparaffinization of tissues\nWash the slides in the following sequence: 3 min in xylene (2x), 3 min in a 1:1 xylene/100% ethanol solution, 3 min in 100% ethanol (2x), 3 min in 95% ethanol, 3 min in 70% ethanol, 3 min in 50% ethanol.",
    "7. Hematoxylin and eosin staining\nPrepare the slides for staining.\n\t\nIf using OCT prepared tissues, soak in distilled water for ~4 min until OCT is dissolved and let dry.\nIf using paraffin embedded tissues, they must be deparaffinized. See step 6.1.\nPlace the slide in filtered 0.1% hematoxylin for 10 min. Place the slide in distilled water, changing the water 1x immediately and then again after 3 min.\nPlace the slide in 0.5% eosin for 10 s or dip 12x. Dip the slide in distilled water until the eosin no longer streaks, about 2-3 dips.\nDehydrate the slide by soaking in 50% ethanol for 10 s, 75% ethanol for 10 s, 95% ethanol for 30 s, and 100% ethanol for 1 min. Dip in xylene until xylene comes out smooth, ~5-7 dips.\nAllow xylene to evaporate and mount with a quick drying mounting medium that has a refractive index close to glass.\n8. Qualitative analysis of common heart defects\nTake images of all samples using an inverted or stereo microscope and its respective camera. Take macroscopic and microscopic images, depending on the types of defects being analyzed. Macroscopic images can be taken with any magnification below 10x. Microscopic images should be taken at 40x magnification or higher. The photos taken in this paper were taken with 5x magnification using a stereo microscope and a 40x air objective (lens N.A. of 0.55) using an inverted microscope.\n\tNOTE: Macroscopic images are a good starting point because they provide a view to the entire heart (Figure 3). As patterns become identified, specific areas can be focused on and further investigated.",
    "Line up all of the images side by side on a computer screen. Have all of the images of control samples on one side of the screen and all of the images of experimental samples on the other side of the screen. It is best to analyze one treatment group at a time.\nLook for differences in phenotypes between treatment groups, starting at key areas where common heart defects take place. This will vary depending on whether the images are macroscopic, which portray gross anatomy of the heart, or microscopic, which portray microscopic anatomy of the heart tissue.\nBegin searching for common macroscopic heart defects, such as ventricular septal defects (Figure 2A), atrial septal defects (Figure 2B), and patent ductus arteriosus (Figure 2C). All of these defects are most easily seen in the transverse view of the heart.\nTo identify septal defects, consider looking at multiple slices, because they might be observed in one plane of the tissue and not another.\n\tNOTE: Sometimes a defect is not the lack of a septum, but a hole in the septum. Therefore, pay careful attention to not mistake a tear for a septal defect. Looking for consistencies between nearby slices in a specific region can confirm if this is actually a defect or a tear from slicing.\nTo identify defects in the outflow tract, such as the patent ductus arteriosus, use multiple slices to follow the major blood vessels as they leave the heart. Create an image of the major blood vessels relative to one another. An example is featured in Figure 2C.",
    "NOTE: Some irregularities may be due to an embryo's developmental stage (e.g., the patent ductus arteriosus closes postnatally, soon after birth; the ventricular septum does not completely close until ~e14.5). Some other common macroscopic heart defects that are not included in the figures include persistent truncus atereriosus, which can be detected most easily at e16.5 and later; double outlet right ventricle (DORV), which can be detected in slices in which the heart enters the outflow tract; and an overriding aorta22. A common microscopic heart defect includes decreased muscle compaction (Figure 4).\n9. Quantitative analysis of cardiac muscle compaction using hematoxylin and eosin stained tissues\nUsing the macroscopic view of the stained tissue samples (Figure 4A), identify a region of interest to image at a 40x magnification (Figure 4B). For this paper, the wall of the left ventricle was used. Save the image in the desired format. For this paper, images were saved as .tif files.\nOpen the image in ImageJ software.\nSet the image to 8-bit. This allows the image to utilize the threshold tool in the next step23,24. To do this, select \"Image | Type | 8-bit\".\nSet the threshold of the photo. The purpose of this step is to select only the pixels that represent the background, excluding the pixels that represent the tissues23,24.\n\tNOTE: This surface area will be subtracted later on. A correct threshold will select the pixels that the researcher wants to exclude from muscle tissue surface area. Therefore, the ending result should include the tissue in grayscale and the background will be selected.\n\t\nClick on \"ImageJ | Image | Adjust | Threshold\". Move the top bar to make threshold adjustments. Close out the threshold adjustments window without making any other changes once the desired sections are selected21.",
    "Use the Polygon Selections tool to select the space that the tissue occupies. Carefully make sure the outlines trace the tissue borders, because loose tracings will provide false measurements.\nAdjust the measurement settings on ImageJ so that the software only measures the area of pixels that were selected using the threshold tool in step 9.423. \"ImageJ | Analyze | Set Measurements | Area and Limit to Threshold\". Select only Area and Limit to Threshold.\nMeasure the area of the highlighted pixels. \"ImageJ | Analyze | Measure\". This value represents the area of the negative space.\nMeasure the area of the entire region of interest. This is the area that was selected using the Polygon Selections tool. \"Image J | Analyze | Set Measurements | Area\". Select only Area and deselect Limit to Threshold. Then measure, selecting \"Image J | Analyze | Measure\".\nCalculate the area the actual muscle tissue is occupying within the region of interest. Subtract the area of the negative space from the area of the entire region of interest. This value is the area of the muscle tissue.\nCalculate the Muscle Compaction Index (MCI). Divide the area of the muscle tissue by the area of the region of interest.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60926/60926eq1.jpg\n\tThe larger the MCI value, the more compacted the muscle is. These MCI values can then be used for statistical analysis to test for significant changes in muscle compaction between treatment groups (Figure 4C).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}