{
  "id": 18833,
  "origin_website": "Jove",
  "title": "In Vivo Optical Imaging of Brain Tumors and Arthritis Using Fluorescent SapC-DOPS Nanovesicles",
  "procedures": [
    "Ethics statement of animal use. All animal studies were approved by the Institutional Animal Care and Use Committee of the University of Cincinnati (IACUC Protocol Number: 11-05-05-02) and the Cincinnati Children's Hospital Research Foundation (Animal Welfare Assurance Number A3108-01). All experiments involving mice followed the animal care guidelines of the University of Cincinnati and the Cincinnati Children's Hospital Research Foundation.\n1. Prepare Animal Models\nNote: Three different animal models outlined below have been used in our prior studies:\nOrthotopic brain tumor mouse: Use Nu/Nu athymic female mice that have been intracranially injected with human U87-ΔEGFR-Luc cells. These mice develop an aggressive tumor showing typical features of human glioblastoma.\nGenetically engineered brain tumor mouse models13: Breed Mut3 (GFAP-cre; Nf1loxP/+; Trp53-/+) male mice with Trp53loxP/loxP; PtenloxP/loxP females to generate Mut6 mice (GFAP-cre; Nf1loxP/+; Trp53-/loxP; PtenloxP/+). Maintain Mut3 mice in B6CBAF1/J strain by breeding male Mut3 mice with female B6CBAF1/J mice. Genotype the mice between P9 and P12 and confirm the genotypes after harvesting their tissues.\nK/BxN arthritis: Use C57Bl/6J mice that have been intraperitoneally administered with 150 µl sera from KRN x NOD F1 mice. These mice develop arthritis 24 to 48 hr following sera injection. Imaging of the arthritic mice is performed on day 7 following sera administration, a time point at which mice exhibit overt macroscopic arthritis. Mice should be evaluated using the criteria outlined in the next step.",
    "Evaluation of mice for macroscopic arthritis using an arthritic index macroscopic scoring system as follows: 0 = no detectable arthritis, 1 = swelling and/or redness of paw or one digit, 2 = two joints involved, 3 = three joints involved, and 4 = severe arthritis of the entire paw and digit. The arthritic scoring system is used to determine the number of joints affected and the severity of arthritis in the mouse paws. Even mice with the highest possible arthritic score rarely show signs of immobility.  However, arthritis is monitored 3x/week and mice in excessive pain (such as severe immobility from swollen paws that inhibits food and water consumption) are sacrificed.  \nNote: Fluids injected IV into the mouse tail vein have sterility maintained throughout the experiment. Clean, sterile, disposable syringes and vials are used for study solution preparation and administration.\n2. Preparation of Fluorescently-labeled SapC-DOPS Nanovesicles\nSapC protein production: Recombinant SapC protein with exact human SapC sequence was produced in E. coli cells as previously described with modifications4. SapC was precipitated by ethanol followed by high performance liquid chromatography purifications. After lyophilization, dry SapC was used and its concentration was determined by its weight.\nMix SapC protein as previously described7,10,11. Mix DOPS (0.18 mg) and CVM (0.03 mg) in a glass tube and use nitrogen gas to evaporate lipid solvents.\nAdd SapC protein powder (0.32 mg) to the mixture, suspend the dry mixture in 1 ml of PBS buffer and bath sonicate for about 15 min as previously described7,10,11. Then pass the suspension through a Sephadex G25 column (PD-10) to remove free CVM dye. Excitation and emission maxima of the final product, i.e. SapC-DOPS-CVM nanovesicles, are 653 nm and 677 nm, respectively.\n3. Imaging",
    "Use brain tumor and arthritis mouse models (described above in Step 1) to test the MAROI system. Anesthetize mice to effect with 2% isoflurane. 1-2% isoflurane is maintained for the duration of the imaging procedure. Warm air is continuously and gently delivered into the imaging chamber for the duration of imaging. A small bead of sterile artificial tears ointment is applied to each eye of the mouse so as to cover and lubricate the eye.  Place mice into the MARS system by positioning the mice in a supine position with their spine initially directed towards the camera (Figure 1). Calibrate the MARS 380° support film and position the mouse using the rotation software in the Bruker MI protocol tab. Obtain baseline images of mice prior to SapC-DOPS-CVM administration in the manner described below.\nInject 200 µl of SapC-DOPS-CVM intravenously into the tail vein of the mouse. Administer to control mice and arthritic or brain tumor-bearing mice.\nImage mice 24 hr post injection and again at 7-9 days post injection by taking fluorescence (25 sec exposure time) and X-ray (10 sec exposure time) images at 10° increments over a course of 380°, creating a slight overlap to ensure there are no gaps in the rotational dataset. Using Bruker MI software, superimpose fluorescent onto X-ray images for anatomical localization.\n4. Image Analysis",
    "Draw a rectangular ROI encompassing the width of the field of view (FOV) of the disease site (tumor and arthritis). The ROI must be large enough to keep the disease feature within the FOV as the animal moves in the course of the 380° rotation. For brain tumor mice (orthotopic and transgenic models), use the same rectangular ROI on each tumor model and its three (3) respective control mice for all time points (baseline, 24 hr, and 9 days). The positioning of the rectangular ROI for each mouse is preserved over all time points by utilizing anatomical landmarks on each animal's corresponding X-ray images. The anatomical landmark(s) identified on the tumor model must also be used to place identical rectangular ROIs on each model's respective controls. Anatomic landmarks identified on the X-ray images allowing for consistent ROI placement include the base of the skull and the posterior aspect of the zygomatic arch. They are visualized on the right and left lateral skull in the posterior-anterior (PA) image.\nAfter automatic background subtraction, determine mean fluorescence intensity for every image. Convert the fluorescence images to photons/s/mm2 using Bruker MI imaging software. Plot the fluorescence values as a function of the imaging angles, and apply as error bars the standard deviation of the averaged fluorescence values obtained from control mice using Excel or other graphing software."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}