{
  "id": 17537,
  "origin_website": "Jove",
  "title": "Design and Development of a Model to Study the Effect of Supplemental Oxygen on the Cystic Fibrosis Airway Microbiome",
  "procedures": [
    "This study received approval from the Partners Institutional Review Board (Protocol # 2018P002934). Inclusion criterion included adult patients with cystic fibrosis who provided written informed consent for the study. There was no exclusion criterion. According to protocol guidelines, all sputum samples were collected from patients with cystic fibrosis during a scheduled outpatient visit with their clinical provider.\n1. Artificial Sputum Medium Preparation\nNOTE: Quantities listed here are for the production of 1 L of final artificial sputum medium, and assume the specific reagents listed in the Materials Table. Numbers must be adjusted for other volumes or for the use of different reagents to ensure the same final product. See Table 1 for target concentrations.\nArtificial sputum chemical mix (ASCM)\n\tNOTE: ASCM makes up 25% of the final medium volume. It is shelf-stable and can be prepared in bulk or in advance. If being prepared for later use, autoclave the chemical mix and safely store it at room temperature.\n\t\nMix the constituent chemical stock solutions.\n\t\t\nPrepare 1 M NaCl stock: Add 58.44 g of NaCl per liter of sterile water.\nPrepare 1 M KCl stock: Add 74.55 g of KCl per liter of sterile water.\nPrepare 1 M MgSO4 stock: Add 246.47 g of MgSO4·7H2O per liter of sterile water, or 120.37 g of anhydrous MgSO4 per liter of sterile water.\nPrepare 1 M glucose stock: Add 180.16 g of glucose per liter of sterile water.\nAutoclave sterilize the chemical stock solutions, as well as an empty 250 mL bottle. Perform the autoclaving steps to at least standard values of 121 °C and 15 PSI for 30 min.\nAdd 80.59 mL of sterile water to the empty 250 mL bottle.\nAdd 152.30 mL of 1 M NaCl stock to the mix.",
    "Add 15.8 mL of 1 M KCl stock to the mix.\nAdd 610 µL of 1 M MgSO4 stock to the mix.\nAdd 700 µL of 1 M glucose stock to the mix.\nArtificial sputum mucin mix (ASMM)\n\tNOTE: ASMM makes up 50% of the final medium volume. Ensure that it is prepared on the same day as the final medium batch.\n\t\nAdd 450 mL of sterile water to an empty 1 L bottle.\nAdd 50 mL of 10x Phosphate-Buffered Saline (PBS) to the bottle.\nAdd a disposable magnetic stir bar to the bottle.\nAutoclave the bottle containing PBS and the stir bar.\nMeasure out 10 g of mucin powder and add it to the PBS.\nShake the bottle vigorously for preliminary mixing.\nPlace the bottle onto a hot plate with a magnetic stirrer. Set heat to medium-high targeting 50 °C and stirring speed to 1100 rpm. Ramp up the speed gradually so that the bar does not fly off the magnet.\n\t\t\nAllow to heat and stir for 15 min.\nPick up the bottle with heat-resistant gloves. Observe to check if mucin powder settles out of the solution.\nIf mucin powder is not fully dissolved, return the bottle to heat/stirrer for 5-min intervals until it is completely dissolved.\nAllow the mucin mix to cool to room temperature.\nArtificial sputum biological mix (ASBM)\n\t​NOTE: ASBM is 25% of the final medium volume. Prepare it on the same day as the final medium batch, and unlike the other mixes, do not expose its components to any heat.\n\t\nThaw the 100x vitamin stock in a 4 °C fridge or on ice.\n\t\t​NOTE: Pre-portion the vitamin stock into 10 mL aliquots to minimize the number of freeze/thaw cycles.\nAdd 124.24 mL of sterile water to the empty autoclaved 250 mL bottle.",
    "Add 25.76 mL of 50x essential amino acid stock to the mix.\nAdd 80.14 mL of 100x non-essential amino acid stock to the mix.\nAdd 10 mL of (thawed) 100x vitamin stock to the mix.\nAdd 1 mL of 1000x trace metals stock to the mix.\nAdd 8.33 mL of 30% egg yolk emulsion to the mix.\nAdd 400 µL of 10 g/L ferritin stock to the mix.\nMix the solution well via manual shaking.\nArtificial sputum medium (ASM)\n\t\nAdd 250 mL of ASCM to the 1 L bottle containing ASMM.\nAdd 250 mL of ASBM to the medium bottle.\nTitrate the medium with basic MOPS buffer (1 M) to reach a pH of 6.3 on a narrow range pH paper. Prior to titration, the medium mix will be too acidic.\nRefrigerate the resulting artificial sputum medium at 4 °C until it is ready for filtration.\nTo start the filtration process, transfer 200 mL of unfiltered artificial sputum medium to a vacuum filtration system with a 0.22 µm pore size filter.\nConnect the filtration system to the vacuum pump, turn on the vacuum pump, set it to 70 mbar, and then place the chamber on an orbital shaker shaking at 90 rpm in a cold room at 4 °C.\n\t\t\nTop off with an additional 150 mL of the medium as an appreciable amount is filtered. It takes 1-2 days to filter 1 L of medium completely.\nRepeat with additional chambers until all the media is filtered.\n\t\t\tNOTE: Try not to filter more than 350 mL of the medium through the same 0.22 µm filter since mucin will plug the filter over time.\nRefrigerate filtered artificial sputum medium at 4 °C until ready for use. Use ASM within one month of preparation for best results.\n2. Oxygen Sparging\nSparging station setup",
    "NOTE: This protocol should only need to be done in full once, after which point the setup can be maintained through simple maintenance as necessary. See Figure 1 for a visual schematic of the oxygen sparging system.\n\t\nObtain and properly secure the compressed air and oxygen tanks.\n\t\tCAUTION: High pressure makes the tanks extremely dangerous when mishandled. Ensure that the tanks are completely sealed and secured, there are no leaks when the tank is closed, and that all handling personnel is fully trained in their use.\nAttach an air regulator to the compressed air tank with a wrench. For optimal flow reading on the regulator, attach the regulator as close as possible to an upright position.\nAttach an oxygen regulator to the compressed oxygen tank, attaching as close as possible to an upright position. Depending on the oxygen tank, one may need to invert the direction to tighten.\nConnect the tubing from the regulators to a Y-connector to combine the gas flow from the two tanks.\nConnect the output of the Y-connector to the central T-junction valve.\nConnect one side of the central T-junction valve to a gas pressure gauge.\nConnect the other side of the gas pressure gauge to a 25 mm diameter sterile syringe filter with a 0.22 µm pore size.\nAttach a second 25 mm diameter syringe filter to a syringe without a plunger to be used as a gas release during sparging.\nConnect the final side of the central T-junction valve to a second T-junction valve for the oxygen monitor.\nConnect a 25 mm diameter syringe filter to one side of this second T-junction valve, along with tubing to attach 18 G needles.\nConnect the final side of the second T-junction valve to the oxygen monitoring apparatus.",
    "Connect a cut-off tube to the other side of the oxygen monitoring apparatus to be used as a gas release during monitoring.\n\t\tCAUTION: When testing/using the oxygen sparging system, take careful note of the position of the T-junctions and ensure it matches the intended path through the system. Failure to do so will result in pressure buildup inside the system and cause components to fail and come apart .\nFor the maintenance of the system and to keep it working at optimal performance, the following practices are beneficial.\n\t\t\nReinforce the connections with liberal amounts of Teflon tape to greatly improve their seal and reduce the chance of components coming apart from the internal pressure.\nKeep combined flow rate under 10 L/min to mitigate maximum pressure and prevent failures.\nIf a leak is suspected, use a detergent solution such as commercially available liquid leak detectors to identify its location easily, as it will bubble above any gas leaks. Patch leaks using a Polytetrafluoroethylene tape (e.g., Teflon).\nReplace the 25 mm diameter syringe filters in the oxygen sparging system bi-weekly, but this varies with use frequency. Over time, particles caught in the filter reduce the gas flow rate and cause pressure buildups.\nCalibrate the oxygen monitor to 21% oxygen compressed air prior to carrying out measurements.\nUpon completion of the system use, turn off the tanks and bleed the excess gas from the regulators until the flow completely stops.\nSerum bottle culture sparging\n\t\nLabel 500 mL autoclaved serum bottles with sample identifiers, date/time of inoculation, and target oxygen percentage.\nIn a biological hood, add 24 mL of the artificial sputum medium to each serum bottle being set up.",
    "Add 1 mL of the patient sputum homogenized with an 18-G needle (diluted with sterile saline if necessary to obtain sufficient volume of sample for each culture condition) to each serum bottle.\nUsing sterile tweezers, place the autoclaved rubber stoppers onto the top of each serum bottle.\nPress down the rubber stoppers, take care not to touch the underside of the stopper with hands.\nRemove the bottles from the hood, apply and crimp the aluminum seals. Remove the center piece from the seals.\nWipe down the top of bottles with an alcohol wipe and pass them through a Bunsen burner flame.\nAffix a sterile 18-G needle to a plunger-less syringe with a filter. Insert this gas release into the bottle first.\nAffix a sterile 18-G needle to the gas output from the system and insert the gas output needle into the bottle as well.\nRoute the T-junctions from the tanks through the oxygen monitor. Verify that the target oxygen concentration is flowing through the system. Target approximately 5 L/min of gas flow.\nReroute the T-junctions from the tanks through to the gas output. The gas starts to flow through the serum bottle.\n\t\tCAUTION: Pay close attention to the pressure gauge during oxygen sparging. If pressure increases unexpectedly, shut the system off immediately.\nRun oxygen sparge through the serum bottle for 1 min. At 5 L/min, this allows for 10 air exchanges and ensures the internal atmosphere reaches the desired partial pressure.\nRemove the gas release 18-G needle.\nAllow the pressure in the serum bottle to build to +1 atmosphere (2 atmospheres at sea level) and then immediately remove the gas output needle.\n\t\tNOTE: Maintaining pressure aids retention of hyperoxic conditions over time.",
    "Place the serum bottle into a 37 °C incubator shaker at 150 RPM. Incubate the samples for three 24-h intervals. At each 24-h interval, take an aliquot for downstream analysis, re-sparge the samples and return them to incubation for a total incubation time of 72 h.\nOutflow oxygen measurement\n\t\nCalibrate the oxygen meter to 21% compressed air, and then turn off the tank.\nRoute the serum bottle intake through the oxygen monitor and affix a sterile needle to the end.\nInsert the needle through the rubber stopper into the serum bottle.\nWait for the outflow reading to stabilize. A low flow rate out of the serum bottles means this may take up to 2 min. Report the peak difference from room air (number furthest from 21%).\nIf performing multiple readings, flush the system with compressed air between readings.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}