{
  "id": 7239,
  "origin_website": "Bio",
  "title": "Visualization and Quantitation of Wg Trafficking in the <em>Drosophila</em> Wing Imaginal Epithelium",
  "procedures": [
    "Setting up Drosophila crosses to obtain third instar larvaeChoose an appropriate genetic system for the gene manipulation of interest.Note: We recommend using the UAS/Gal4-system to drive RNAi or protein expression alongside GFP specifically in posterior WID under an engrailed promotor (enGal4, UAS-GFP). In this way, the posterior half of the WID epithelium (marked by GFP) suffers the desired genetic manipulation, while the anterior WID serves as an internal control. Using this set-up enables a direct and reliable comparison of signal strength and distribution between the anterior control and posterior treatment side of the same WID. It therefore reduces the variability associated with immunofluorescence-based detection and quantitation of phenotypes in an in vivo model system. Prepare vials for Drosophila culture (see Recipes). Let fly vials come to room temperature (RT) before use.Collect males and virgin females of the desired fly strains.Set up crosses of 20 virgin females and 10-20 males in fresh food vials.Keep crosses at 18°C, 20°C, or 25°C. As UAS/Gal4-mediated expression is temperature-dependent, with a minimal Gal4 activity at 16°C and a maximal activity at 29°C, the temperature can be adjusted to obtain the required expression level.Transfer flies to fresh food vials every 48 h to obtain synchronized larval populations.Culture vials at the desired temperature until wandering third instar larvae emerge. At 25°C, wandering third instar larvae can be collected on days 5 and 6.Dissection of Wing Imaginal Discs (Part 1)Collect third instar larvae of the required genotype in PBS (see Recipes) using a brush or forceps.Notes: Depending on the fly strains used, larvae of the correct genotype may have to be selected based on marker expression. If using EnGal4, UAS-GFP/CyO x UAS-RNAi/UAS-RNAi, GFP-positive larvae have to be selected using a fluorescence stereomicroscope. If desired, larvae can be sexed based on the visibility of testis in males.",
    "Transfer larvae to fresh PBS to wash off food or dirt remnants.Keep larvae in PBS on ice to anesthetize the animals and slow their movement.Transfer one larva to a drop of PBS or Schneiders medium on a clean glass slide.Use a dissection microscope and two pairs of fine forceps for WID dissection.Position the larva in your field of view with the mouth-hooks toward the right and the tail toward the left (Figure 3A).Note: The following protocol describes an easy method for WID dissection from the perspective of a right-handed person. If your left hand is dominant, mirroring the following description may increase your precision. Grab the larva with both pairs of forceps at 1/3 to 1/2 of its body length (Figure 3B).Firmly pull on the posterior larval end to tear the larva apart (Figure 3C). Discard the posterior half of the larva and reposition the anterior half in your field of view (Figure 3D). If large organ parts of the gut and fatbody have spilled out and occlude your view, carefully remove them.Hold on to the mouth-hooks with your right pair of forceps and insert the left pair of forceps into the body opening (Figures 3E and 3F).Carefully push with the left pair of forceps toward the mouth-hook to gently slip the larva onto the right pair of forceps, thereby turning it inside-out (Figure 3G). The anterior larval half should now be fully inverted and pulled over the right pair of forceps with the internal tissue, including the WID exposed (Figures 3H1 and 3H2).Grab the inverted mouth-hooks with the left pair of forceps and slide it off the right forceps. Carefully remove the gut, salivary gland, and fat body (Figure 3I1). Be careful not to accidentally remove the WID, especially if you remove strands of the trachea.",
    "The WID should remain attached to the larva.Note: Internal tissues do not have to be fully removed at this step, as a second dissection will be performed before mounting the samples. Do, however, make sure that WID are not covered by remaining tissue parts to ensure uniform staining and fixation. Try to identify the two WID, one on either side of the larva. They are translucent teardrop-shaped structures and are often hanging on the trachea, sometimes floating at a distance to the larval main body (Figures 3I2 and 3I3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4040/bioprotoc-11-11-4040-g003.jpgFigure 3. Dissection of anterior larvae for WID isolation. The anterior half of third instar larvae is isolated (A-D) and inverted onto one pair of forceps (E-H). Subsequently, WID (encircled in yellow) are retained at the anterior larval half, while other organ parts are removed (I). The resulting samples are transferred to medium before further staining and fixation.Transfer the inverted anterior larval parts including WID to an Eppendorf tube containing Schneider’s or M3 medium on ice, depending on the downstream application (Figure 2).Collect at least 15-20 WID samples per condition.Note: Do not keep WID on ice for more than 30 min before proceeding with the next step in order to minimize tissue degradation. Wing Imaginal Disc StainingVisualization of steady state extracellular WgCollect WID samples in 200 µl M3 medium without FBS in an Eppendorf tube.Add 100 µl mouse anti-Wg antibody (DSHB 4D4 supernatant), corresponding to a dilution of 1:3, and incubate on ice for 60 min.Remove staining solution carefully and rinse three times with 1 ml ice-cold PBS. This is best achieved by aspirating the medium with a 1,000 µl pipet doubled-tipped with a 1,000 µl and 200 µl pipet tip.",
    "Note: Due to their attachment to the anterior body part, WID samples will quickly settle down in the Eppendorf cup, thus allowing the removal and exchange of staining and washing solutions by pipetting. Remove PBS and fix in 500 µl 4% PFA in PBS for 5 min on ice, followed by 15 min at RT with gentle agitation/on a rocker.Remove fixing solution and wash three times for 10 min in 1 ml PBS.Remove PBS and block in 500 µl PBS + 5% FBS for 30 min.Incubate with secondary antibody diluted in 5% FBS in PBS overnight at 4°C or 2 h at RT (anti-mouse-A568 + Hoechst 1:500).Remove staining solution and wash three times for 10 min in 1 ml PBS.Visualization of Wg endocytosis and traffickingCollect WID samples in 200 µl S2 medium + 10% FCS.Add 50 µl mouse anti-Wg antibody (DSHB 4D4, dilution 1:5) and incubate at 22°C for 5-90 min with gentle agitation.Note: For visualization of the endocytic pool of Wg in combination with total Wg, endogenously tagged GFP-Wg on the cell surface can be labeled by an anti-GFP antibody. Counterstaining with an A568-labeled secondary antibody (under C2.10) allows subsequent discrimination between (dual-color) GFP-Wg after endocytosis and (single-color) GFP-Wg that has not been present on the cell surface during Step C1. Remove staining solution carefully and rinse twice with 1 ml PBS.Remove PBS and acid wash WID samples with 0.1 M Glycine-HCl buffer (pH 3.5, see Recipes) for 30 s at RT to remove extracellularly bound antibody.Remove Glycine-HCl buffer and rinse three times with 1 ml PBS.Remove PBS and fix in 500 µl 4% PFA in PBS for 20 min at RT with gentle agitation/on a rocker.Remove fixing solution and rinse once with 1 ml PBS.",
    "Wash twice for 15 min with 1 ml PBTx (see Recipes) to permeabilize the tissue.Note: Permeabilization in this step enables the secondary antibodies used in Step C2j to access the cell and bind to the intracellular pool of anti-Wg-labelled, and thus endocytosed Wg. Remove PBTx and block 30 min in 500 µl 5% FBS in PBTx.Incubate with secondary antibody diluted in 5% FBS in PBTx overnight at 4°C or 2 h at RT (anti-mouse-A568 + Hoechst 1:500).Remove staining solution and wash thrice for 10 min in 1 ml PBTx.Visualization of Wg recyclingCollect WID samples in 200 µl M3 medium.Add 100 µl mouse anti-Wg antibody (dilution 1:3) and incubate at 22°C for 45-60 min with gentle agitation.Remove staining solution carefully and rinse three times with 1 ml PBS.Remove PBS and fix in 500 µl 4% PFA in PBS for 20 min at RT with gentle agitation/on a rocker.Remove fixing solution and wash three times for 10 min in 1 ml PBS.Remove PBS and block in 500 µl PBS + 5% FBS for 30 min.Incubate with secondary antibody diluted in 4% FBS in PBS overnight at 4°C or 2 h at RT (anti-mouse-A568 + Hoechst 1:500).Remove staining solution and wash thrice for 10 min in 1 ml PBS.Dissection of Wing Imaginal Discs (Part 2) and MountingTransfer WID samples with 1-2 drops of PBS onto a glass slide using a Pasteur pipet.Use a dissection microscope and two pairs of fine forceps for WID dissection.Try to locate the WID on the sample. Ideally, two WID per sample can be spotted approximately where a larval “shoulder” would be expected (at around 1/3 of the length of the anterior sample), sometimes attached to the trachea (Figure 4A).Note: After fixation, the WID appear more white than translucent and are usually easier to spot.",
    "Carefully detach the WID from the remaining anterior larval body part. Do not hold on to the WID tissue directly with your forceps. Instead, hold on to the main specimen part with your left-hand forceps and find the tissue strands attaching the WID to the larva. Then shear them off in a scissor-like fashion or detach the WID without pulling on it directly.Proceed with all WID samples, then remove all remaining tissue parts except for the WID from the glass slide (Figures 4B and 4C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210701/20210701222240_9310.jpgFigure 4. Dissection of WID for mounting. WID are transferred to a glass slide. All larval parts except for WID are removed without disturbing the integrity of the WID tissue.Soak up PBS from the glass slide with the tip of a thin and soft tissue.Note: The capillary force may move your WID toward the tissue. Try not to pick up WID with the tissue. Add 60 µl Mowiol (see Recipes) to the glass slide with a cut-off pipet tip.Carefully mount with a cover slip, placing one edge of the cover slip over the sample and lowering down the other side with forceps. Try to avoid mounting air bubbles.Note: Air bubbles trapped under the cover slip can be carefully pushed aside by applying gentle pressure. Let Mowiol dry at 4°C for at least 12 h before imaging. Store slides at 4°C.Imaging acquisitionUse a confocal microscope equipped with 10× and 63× magnification objectives that are capable of acquiring z-stacks.Identify appropriate WID using the 10× objective. Take an overview image if wanted (not needed for quantitation).Aquire z-stacks from the apical WID surface (just below the peripodial membrane) to the basal WID surface with a step size of 0.5-1 µm using the 63× objective.Image at least 5-10 WID per condition.",
    "Keep laser intensity and detector gain constant (see Figure 5 for representative examples of all three staining protocols).Note: If using the enGal4 system, laser intensity and detector gain can be adjusted for optimal illumination, as downstream signal analysis will involve normalization of the anterior to the posterior WID. Save image data in a file format compatible with the use of Fiji/ImageJ [such as .czi for Zen (Zeiss)].imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4040/bioprotoc-11-11-4040-g005.jpgFigure 5. Example Wg staining using the different approaches. Extracellular Wg staining of enGal4>UAS-GFP, UAS-Ykt6 RNAi (A), as well as Wg uptake assay (B) and Wg recycling assay (C) of enGal4>UAS-GFP, UAS-Klp98A RNAi. While Ykt6 knockdown interferes with Wg secretion and therefore with extracellular Wg levels (Gross et al., 2012), Klp98A knockdown interferes with apicobasal Wg transport and promotes apical accumulation of Wg inside endosomes as well as apical Wg recycling (Witte et al., 2020). The posterior knockdown compartment is marked by the coexpression of GFP. The anterior compartment serves as a control. Maximum intensity projection of apical to basal z-stack (A) or individual apical sections the WID epithelium (B, C). Scale bars, 20 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}