{
  "id": 10675,
  "origin_website": "Jove",
  "title": "Microfluidic Bioprinting for Engineering Vascularized Tissues and Organoids",
  "procedures": [
    "The neonatal rat cardiomyocytes used in this protocol were isolated from 2-day-old Sprague-Dawley rats following a well-established procedure56 approved by the Institutional Animal Care and Use Committee at the Brigham and Women's Hospital.\n1. Instrumentation of the Bioprinter\nInsert a smaller blunt needle (e.g., 27G, 1 inch) as the core into the center of a larger blunt needle (e.g., 18G, ½ inch) as the sheath to construct the dual-layer, concentric microfluidic printhead; make sure that the core needle is protruding slightly (~1 mm) longer than the outer shell (Figure 1A). The alignment is usually adjusted manually, but if necessary spacers of proper sizes can be temporally sandwiched in between the inner/outer needles at both the tip and the barrel sides to assist concentric alignment. Seal the junction of the barrels with epoxy glue and remove the alignment spacers from the tip side when applicable.\nInsert another needle (23G) in the barrel of the central needle in the reverse direction.  Then generate a hole on the side of the barrel of the outer needle and insert a metal connector of matching size into the hole, followed by sealing with epoxy glue.\nConnect the inlets of the printhead to a dual-channel syringe pump for injection of the bioink and the crosslinking solution, individually, through two PVC tubes. Mount the extruder onto the head of a bioprinter using a plastic holder made of poly(methyl methacrylate) (PMMA).\n\tNOTE: Bioprinter selection depends on availability. In our case, we have successfully tested this setup on several commercially available bioprinters. However, any bioprinter that features an x-y-z motorized stage should, in principle, enable integration of this microfluidic printhead.\n2. Bioprinting the Microfibrous Vascular Bed",
    "Make the bioink using a mixture of alginate (4 w/v%, low viscosity), gelatin methacryloyl (GelMA, 1-2 w/v%)57,58, and photoinitiator Irgacure 2959 (0.2 - 0.5 wt.%) dissolved in 25 mM 2-[4-(2-hydroxyethyl) piperazin-1-yl] ethane sulfonic acid (HEPES buffer, pH 7.4) containing 10 vol.% fetal bovine serum (FBS).\nMake a solution of 0.3-M CaCl2 in HEPES buffer containing 10 vol.% FBS as the crosslinking carrier fluid.\nImmediately before bioprinting, dissociate human umbilical vein endothelial cells (HUVECs) from the flasks using treatment by 0.05 w/v% trypsin for 5 - 10 min, and resuspend the cells in the bioink at a concentration of 5 - 10 × 106 cells/mL. Pipette the suspension slowly 5 to 10 times to ensure homogenous distribution.\nStart the injection of the bioink/crosslinking fluid using a dual-channel syringe pump at the same flow rates of 5 µL/mL. The flows can be allowed to continuously run for up to 1 min until they stabilize. Subsequently, initiate the movement of the printhead by controlling the bioprinter at a deposition speed of approximately 4 mm/s (Figure 1B). These speeds may need fine tuning with each new setup to ensure optimal bioprinting. The bioprinting process is usually conducted at room temperature (21 - 25 °C) but this temperature may be altered. The bioprinting process should allow for fast ionic gelation of the alginate component and deposition of a microfibrous scaffold (Figure 1B).\nAfter the scaffold is bioprinted, achieve chemical gelation by further photocrosslinking the GelMA component, at approximately 5 - 10 mW/cm2 of UV light (360 - 480 nm) for 20 - 30 s (Figure 1C).",
    "Following the bioprinting and crosslinking, gently rinse the scaffold with phosphate-buffered saline (PBS) to remove the excess CaCl2. Culture the HUVECs-laden microfibrous scaffold in endothelial cell growth medium (EGM) in an incubator at 37 °C and 5 vol.% CO2 for up to 16 days with medium changed at least every 2 days. Monitor the morphologies of the HUVECs under a microscope during the culture period.\n3. Constructing the Vascularized Tissues\nOnce the HUVECs have migrated to the peripheries of the microfibers in the scaffold to form the lumen-like structures (Figure 1D), retrieve the scaffold and gently place it on the surface of a hydrophobic surface (e.g., a slab of polymethylsiloxane [PDMS]). Use a piece of sterile filter paper to carefully remove all the medium from the interstitial space of the scaffold with capillary force.\nImmediately add a drop (approximately 20 - 40 µL) of suspension of a secondary cell type (e.g., cardiomyocytes) in medium at a density of 1 - 10 × 106 cells/mL on top of the scaffold, which should infiltrate the entire interstitial space of the scaffold (Figure 1E). Incubate such a configuration in an incubator (37 °C, 5 vol.% CO2, 95% relative humidity) for 0.5 - 2 h to allow the cells to adhere onto the individual microfibers. Monitor the droplet size over the period to ensure that no noticeable evaporation is observed.\nGently wash the scaffolds by shaking in a PBS bath to remove any non-adherent cells and culture the construct in relevant medium until the desired vascularized tissue is formed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}