{
  "id": 8192,
  "origin_website": "Bio",
  "title": "Heterologous Production and Anaerobic Purification of His- and StrepII-tagged Recombinant Proteins ",
  "procedures": [
    "Anaerobic expression of pyruvate: ferredoxin oxidoreductase (Noth et al., 2013)   Electroporation (Sambrook et al., 2006) of 100 μl E. coli BL21 (DE3) ΔiscR (Akhtar et al., 2008) with ~100 ng expression vector (pASK-IBA).   Inoculation of 200 ml LB and aerobic growth of a preculture over night at 37 °C (180 rpm).   Inoculation of 4 L Vogel Bonner medium (8 x 500 ml; 2,000 ml Erlenmeyer flasks) supplemented with 100 μg/ml ampicillin, 50 μM thiamin hydrochlorid and 0.2 μM resazurin using 15 ml preculture each.   Aerobic growth at 37 °C and 180 rpm until the culture reaches the anaerobic phase at A600 of 0.6. At that point, the redox indicator resazurin within the medium turns from blue to pink.   Each 2 L of culture are induced by adding 0.2 μg/ml anhydrotetracycline and transferred into sterile 2 L Schott flasks containing 50 ml 20% glucose (5 g/L).   Protein expression is carried out over night at 8 °C without stirring.   Cells are anaerobically harvested by centrifugation for 20 min at 7,500 x g, resuspended in Tris-HCl (pH 8.0), 10% glycerol and stored at -20 °C until purification.      Anaerobic purification of pyruvate: ferredoxin oxidoreductase (His-tag)   For purification the pellet (2 L of culture) is thawed at room temperature and lysed by sonication while keeping the cells cooled on ice.  Note: Five times for 30 sec; output, 25; Branson Sonifier 250.   Sedimentation of cell debris at 200,000 x g for 60 min and 4 °C in an ultracentrifuge.   The soluble fraction is filtered using a pore size of 0.2 μm to get rid of unwanted material which clogs the column.   Then, the sample is loaded on a pre-equilibrated (100 mM Tris-HCl, pH 8.0, 10 mM imidazole, 0.5 mM thiamine pyrophosphate) gravity flow Ni-NTA fast-flow column with a bed volume of 4 ml.",
    "Protein purification is achieved via increasing the imidazole concentration from 10 to 20 mM during washing each with 40 ml buffer.   The His-tagged PFR1 protein is eluted from the column with 10 ml buffer containing 100 mM imidazole. Nine elution fractions each 1.1 ml are collected.   The protein concentration of the brownish main elution fractions 3 and 4 are immediately determined using A280.       Aerobic expression of [2Fe2S] ferredoxins (Jacobs et al., 2009; Winkler et al., 2009) with minor changes   E. coli BL21 (DE3) ΔiscR containing the expression plasmid pASK-IBA7-FDX is grown in Vogel Bonner minimal medium for 4 h after induction at A600 of 0.6.    Cells are harvested, washed in Tris-HCl (pH 8.0), sedimented again and stored at -20 °C until purification.      Anaerobic expression of HydA1 (Girbal et al., 2005; von Abendroth et al., 2008)   Expression plasmid containing C. acetobutylicum ATCC 824 strain is grown in CGM-medium and a glucose concentration of 60 g/L anaerobically in a batch fermenter over night at 35-37 °C and 100 rpm.   Cells are harvested in an anaerobic tent analog to E. coli, resuspended in Tris-HCl (pH 8.0), 10% glycerol containing 10 mM sodium dithionite and stored at -20 °C until purification.      Anaerobic expression of bacterial 2[4Fe4S] ferredoxin analog to HydA1 (Girbal et al., 2005; von Abendroth et al., 2008, Noth et al., 2013)   Expression plasmid containing C. acetobutylicum ATCC 824 strain is grown in CGM-medium and a glucose concentration of 60 g/L anaerobically in a batch fermenter over night at 35-37 °C and 100 rpm.   Cells are harvested in an anaerobic tent analog to E. coli, resuspended in Tris-HCl (pH 8.0), 10% glycerol containing 10 mM sodium dithionite and stored at -20 °C until purification.     Anaerobic purification of StrepII-tagged proteins (C-E)   All buffers used contain 2 mM sodium dithionite.",
    "For purification the cell pellet is thawed at room temperature and lysed by sonication while keeping the cells cooled on ice.  Note: Five times for 30 sec; output, 25; Branson Sonifier 250.   Sedimentation of cell debris at 200,000 x g for 60 min and 4 °C in an ultracentrifuge.   Supernatant (40 ml) is incubated for 1 hour with 3.5 mg Avidin (Stock 50 mg.ml-1) at 4 °C.   The soluble fraction is filtered using a poresize of 0.2 μm to get rid of biotinylated, complexed proteins and unwanted material which clogs the column.   Then, the filtered solution is loaded on a Tris-HCl (pH 8.0) equilibrated 2 ml strep tactin gravity flow column.    The unbound proteins are washed from the column using 80 ml Tris-HCl (pH 8.0).   Elution is performed with 10 ml Tris-HCl (pH 8.0), d-desthiobiotin (0.8 mg/ml) in fractions of 1 ml."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}