{
  "id": 3408,
  "origin_website": "Cell",
  "title": "Protocol for high-sensitivity western blot on murine hematopoietic stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of murine bone marrow cells\nTiming: ∼ 2.5 h\nThis protocol describes the process for isolating mouse HSCs from a pooled sample of bone marrow obtained from tibias, femurs, humerus, pelvises, and vertebrae8[href=https://www.wicell.org#bib9],9[href=https://www.wicell.org#bib10] (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2988-Fig1.jpg\nFigure 1. Schema for bone isolation and marrow digestion\n(A) The euthanized mice were pinned to a dissection plate, and the surgical sites were sterilized with 70% (v/v) ethanol.\n(B) The mice were dissected along the dorsal and ventral midline and length of the limbs to expose the underlying skeletal structures.\n(C) The bones were cleaned and presented. V (vertebrae), P (pelvis), F (femur), T (tibia), and H (humerus).\n(D) The bones were minced by scissors in 2 mL cell isolation buffer.\n(E) The bone fragments (left) are crushed by pestle and mortar for 3–4 rounds to release bone marrow cells until the bone fragments turn white (right).\nTissue collection.\nCritical: We crushed long bones and flat bones to collect bone marrow cells. We recommend removing the bone fragments after standing for 5 min and filtering the bone marrow cells with 40 μm cell strainers.\nEuthanize mice with a method approved by the supervisory institution.\nSterilize the dissection areas and the external fur of the surgical sites with 70% (v/v) ethanol to reduce the risk of contamination.\nUse scissors and scalpels to make a midline incision through the skin to expose the forelimbs (axillary to forefoot), hindlimbs (inner thigh to hindfoot), ilium, pelvises, and vertebras.\nUse curved forceps to dislocate the tibias, femurs, humerus, pelvises, and vertebras in cold cell isolation buffer (1× PBS with 2% FBS).\nWash the bones with 70% (v/v) ethanol for 3–5 s and then transfer them into 2 mL of cold cell isolation buffer.",
    "Use sterilized surgical instruments and tissues to remove muscle tissue from the bones.\nCritical: The number of mice required per replicate may vary based on the number of proteins to be detected and the sensitivity of antibodies. Typically, one to three 3–4-month-old mice are used for a single replicate.\nCollecting bone marrow cells.\nMince the tibias, femurs, humerus, pelvises, and vertebrae into bone fragments.\nGently crush using a pestle and mortar with 2 mL of cold cell isolation buffer.\nTransfer the supernatant to a 50 mL conical tube.\nRe-suspend the bone fragments in 2 mL cold cell isolation buffer and repeat the steps 2b and 2c for 3–4 times until the bone fragments turn white.\nStand the 50 mL conical tube on ice for 5 min to allow the bone fragments to settle.\nCarefully pipette the cell suspensions into a 15 mL conical tube passed through a 40 μm cell strainer (Falcon, Cat#352340) to obtain single cells.\nStand the 15 mL conical tube for 5 min to allow the bone fragments to settle.\nCarefully collect the supernatant containing the bone marrow cells into a new 15 mL centrifuge tube, leaving 50–200 μL leftover with the bone fragments in the bottom of the original tube.\nCritical: The spinal cord should be removed from the vertebrae. To harvest bone marrow cells from bone fragments, we recommend crushing instead of grinding to obtain higher cell viability.\nLysis of red blood cells.\nCentrifuge the bone marrow suspension at 550 g for 5 min at 4°C.\nCarefully discard the supernatant and add 2 mL of ACK lysis buffer to the cell pellet. Incubate the suspension for 2 min at 25°C–30°C to lyse any remaining red blood cells.\nAdd 10 mL cold cell isolation buffer to stop the lysis.",
    "Filter the cell suspension into a 15 mL conical tube through a 40 μm filter strainer to remove any remaining cell clumps or debris.\nCritical: Remove the supernatant with 50–200 μL leftover after 5-min-stand to help remove the bone fragments.\nCentrifuge the cell suspension again at 550 g for 5 min at 4°C.\nDiscard the supernatant carefully not to disturb the cell pellet.\nDiscard the supernatant and resuspend bone marrow cells in 500 μL cold cell isolation buffer. Count cell numbers for antibody staining.\nCritical: The total nuclear bone marrow cells from one 3–4 month-old mouse is ∼1.5×108. The cell numbers were counted by Flow Cytometer Attune NxT (Thermo Fisher Scientific).\nAntibody staining\nTiming: ∼ 1.5 h\nHSCs are Lineage–Sca1+c-Kit+ (LSK) CD48–CD150+ cells. The lineages cocktails include anti-CD3, anti-CD4, and anti-CD8 for T cells, anti-B220 and anti-IgM for B cells, anti-CD11b and anti-Gr-1 for myeloid cells, and anti-Ter-119 for erythroid cells. The color compensation and isotype controls were used to set up the instrument and gating strategies in a standard way.\nResuspend the cells in cell isolation buffer at a 1×105 cells per μL, and aliquot 500 μL cells in each 1.5 mL microcentrifuge tube.\nAdd 20 μL of lineage (PE-Cy5) antibody mix, 10 μL of anti-Sca-1 (PE-Cy7), 10 μL of anti-c-Kit (APC), 10 μL of anti-CD48 (APC-Cy7), and 10 μL of anti-CD150 (PE) antibodies into each tube.\nIncubate the tubes at 4°C on a shaker in the dark for 1 h.\nOptional: The Annexin V (FITC), DAPI, and anti-Ki67 (FITC) may be added in the HSC staining panel for cell cycle and apoptosis analysis.\nAfter staining, add 1 mL cell isolation buffer to each tube, and centrifuge them at 550 g for 5 min at 4°C.",
    "Discard the supernatant, and resuspend the cells in cell isolation buffer to a final concentration of 5 × 107 cells per mL. The stained cells can be stored at 4°C in the dark before sorting.\nAdd 7-AAD at final concentration 0.5 μg per mL, detected in the PE-1 Cy5 channel, for 5 min to 2 exclude dead and lineage-positive cells before sorting.\nOptional: Lineage cell depletion or c-Kit+ cell enrichment can be performed to save sorting time. However, the cell enrichment may result in up to 30% cell loss.\nCell sorting\nTiming: 2–3 h per sample\nStart the sorter (BD FACS Aria III) for a standard quality control setup. Set the sorter with a 70 μm nozzle, a sorting speed of 20,000–30,000 events per second, sheath pressure at 70 pounds per square inch (psi), and drop drive frequency (ddf) set to 89 kHz, with a threshold rate maintained at 1/5–1/3 of ddf. Sort precision mode set to Purity Precision Mode.\nTransfer 1 mL cell suspension to a 5 mL Polystyrene tube and filter the cells right before sorting. Turn on Sample Agitation to 100 g to prevent cell clumping. Use the sample temperature command to set the temperature inside the sample injection chamber at 4°C.\nUse a 200 μL PCR tube as a collection tube during sorting. Coating the collection tube with FBS or BSA before adding the cell isolation buffer is recommended. Each collection tube can acquire up to 5×105 cells in 30 μL collection buffer (Figures 2[href=https://www.wicell.org#fig2] and 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2988-Fig2.jpg\nFigure 2. Gating Strategy for HSCs\nThe bone marrow Lineage–Sca1+c-Kit+ (LSK)CD48–CD150+ HSCs were gated. TNC, Total Nucleated Cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2988-Fig3.jpg\nFigure 3. Schema for cell sorting\n(A) The parameters used for cell sorting (BD FACS Aria III) were shown.",
    "(B) A 200 μL PCR tube containing 30 μL of cell isolation buffer is used as a collection tube for cell sorting.\n(C) The collection tubes were numbered from 1 to 5 and received 100, 500, 1,000, 5,000, and 10,000 HSCs, respectively.\nCritical: It usually takes 1–1.5 h to start and setup the sorters. Cell viability is critical for successful cell sorting; therefore, it is essential to sort the stained cells immediately. EPPENDORF PCR cooler 0.2 mL rack (Catalog no. 022510525) is recommended for holding the PCR tube and keeping the sample cool. Sorting 1.5 × 108 bone marrow cells from one 3–4-month-old mouse takes approximately 1.5 h, and the frequency of HSCs is around 0.015%. Typically, (2–2.5) × 104 HSCs are collected from one 3–4-month-old mouse. Always keep cells on ice or on a cooling rack during sorting. To maintain a high cell yield rate, it is crucial to aliquot the cell suspensions, filter them right before sorting, and turn on the sample agitation mode. If the sample agitation mode is unavailable for the sorter, the cells must be resuspended manually.\nPost sort analysis\nTiming: 10 min\nThe isolated HSCs were reanalyzed by Attune NxT (Thermo Fisher Scientific). The purity of sorted HSCs is typically over 90% (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2988-Fig4.jpg\nFigure 4. Post-sort analysis for isolated HSCs\nLow-input cells western blotting\nTiming: ∼ 20 h\nThis step describes a western blot protocol suitable for low numbers of HSCs (100–10,000 cells) (Figures 5[href=https://www.wicell.org#fig5] and 6[href=https://www.wicell.org#fig6]). Typically, 10,000 cells are used for one analysis, but highly abundant proteins can be detected with as few as 500 HSCs.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2988-Fig5.jpg\nFigure 5. Schema for protein extraction\n(A) The parameters of centrifugation for HSC preparation after sorting.\n(B) HSC pellets in a 200 μL PCR tube with 4 μL leftover collection buffer.",
    "(C) Add 4 μL of 2× lysis buffer to each collection tube.\n(D) Add 2 μL of 5× loading buffer to each collection tube.\n(E) Heat the protein samples at 100°C for 3 min.\n(F) The collection tubes with heated protein samples from 100, 500, 1,000, 5,000, and 10,000 HSCs were numbered 1 to 5, respectively.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2988-Fig6.jpg\nFigure 6. Schema for protein loading\n(A) Homemade 1.5 mm width comb.\n(B) Protein sample loading.\nCritical: Equal cell numbers are used for normalization.\nSample preparation and western blot.\nInsert the PCR tube with sorted 10,000 HSCs in a PCR tube holder and spin down the cells at 550 g in a swinging bucket rotor for 5 min at 4°C without a break.\nGently remove the supernatant with a 10 μL pipette until ∼ 4 μL cell suspension left.\nAdd 4 μL of 2× lysis buffer and leave the 8 μL 1× lysis buffer on ice for 10 min 10,000 cells were lysed with 8 μL 1× lysis buffer.\nAdd 2 μL 5× loading buffer into the 8 μL cell lysate, and heat the lysate on a heat block at 100°C for 3 min.\nPause point: The samples can be immediately used for western blot or stored at -80°C freezer after snap-freezing in liquid nitrogen.\nModify the teeth of a Mini-PROTEAN 10-well 1.0 mm comb by cutting the width from 5 mm to 1.5 mm (Figure 6[href=https://www.wicell.org#fig6]). Each well can accommodate up to 10 μL of cell lysate for loading.\nCritical: This is a critical step to increase the sensitivity of western blot for cells in small number. The 1.5 mm comb is a homemade creation in the lab.\nAfter electrophoresis, transfer the protein bands from the gel to a polyvinylidene difluoride (PVDF) membrane with standard protocol.\nAntibody staining and detection.",
    "Incubate with primary antibodies (1:1000 in Primary antibody dilution buffer, Cat#P0023A, Beyotime) on a shaker at 4°C for 12–16 h.\nWash the membrane 3 times and incubate the membrane with HRP-conjugated secondary antibodies for 1 h at 25°C–30°C.\nUse Western Chemiluminescent HRP Substrate with high sensitivity (WBKLS0050, Millipore) and Ultra-high sensitivity chemiluminescence imaging system(Bio-Rad ChemiDoc Touch) for western blot detection."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Protein Biochemistry",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}