{
  "id": 4121,
  "origin_website": "Cell",
  "title": "Live-cell imaging of microglial interactions with radial glia in transgenic embryonic mouse brains using slice culture",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis section lists the major steps involved in the embryonic mouse brain slice culture protocol and provides step-by-step details and timing.\nMouse embryo dissection and brain extraction\nTiming: 15–20 min\nThe goal of this step is to dissect embryos from a pregnant dam and remove several intact embryonic brains in a timely manner.\nAnaesthetize the pregnant dam using isofluorane and immediately euthanize the animal using cervical dislocation.\nMake an incision along the abdomen of the pregnant dam and remove the E15.5 embryos from both uterine horns.\nPlace the embryos in ice-cold PBS in a Petri dish sitting on ice.\nOne at a time, place a single embryo into a second Petri dish filled with ice-cold PBS under a dissecting microscope on the benchtop.\nCut off the embryo head and discard the body.\nCarefully harvest the E15.5 brain from the head using forceps and a dissecting spoon.\nPlace the E15.5 brain in a Petri dish filled with ice-cold PBS and place back on ice.\nSample preparation and vibratome slicing\nTiming: 15–20 min\nThe goal of this step is to mount the embryonic brain in agarose for stability and section the brain into thick sections in preparation for culturing and live-cell imaging.\nMicrowave the 4% LMP agarose until the agarose powder has dissolved and the solution is a clear homogenous liquid.\nPlace the bottle of 4% LMP agarose on ice with a thermometer in the agarose to measure the temperature (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/886-Fig3.jpg\nFigure 3. Embedding embryonic brains in LMP agarose",
    "The bottle of 4% LMP agarose is placed on ice with a thermometer in the agarose to measure the temperature (A), and the Peel-A-Way disposable plastic tissue embedding molds are placed individually on ice (A′). Once at the appropriate temperature, the 4% LMP agarose can be poured into the plastic molds (B) and the embryonic brains can be transferred to (C) and appropriately positioned within (D) the agarose.\nPlace the plastic tissue embedding molds on ice (i.e., molds used to set the embryonic brains into the agarose; Figure 3[href=https://www.wicell.org#fig3]A’).\nPour the 4% LMP agarose into the plastic molds once the temperature is between 45°C to 55°C (Figure 3[href=https://www.wicell.org#fig3]B).\nPlace the E15.5 mouse brain into the 4% LMP agarose within the plastic molds once the temperature is at 40°C (Figure 3[href=https://www.wicell.org#fig3]C).\nUse a pipette tip to quickly orient (e.g., the ventral aspect of the embryonic brain should face the bottom of the plastic mold if coronal sections are preferred) the brain in the 4% LMP agarose before it solidifies (Figure 3[href=https://www.wicell.org#fig3]D).\nCritical: When the embryonic brain is transferred from the PBS to the 4% LMP agarose using a dissecting spoon, make sure that excess PBS is not transferred into the agarose alongside the brain. Once the embryonic brain is placed within the agarose, use the pipette tip to swirl the agarose around the brain to dilute any PBS that was adhering to the brain. Also, remove or pop any nearby bubbles. These steps are important to achieve the solid seal between the brain and the agarose that prevents the brain from detaching from the surrounding agarose during vibratome sectioning.\nOnce the agarose has solidified, carefully tear apart the plastic mold and place the agarose embedded sample on a Petri dish on ice.",
    "Cut the excess agarose surrounding the embryonic brain using a razor blade (Figure 4[href=https://www.wicell.org#fig4]A).\nUse a super glue such as Krazy Glue® to adhere the agarose-embedded brain onto the metal vibratome plate used for sectioning (Figures 4[href=https://www.wicell.org#fig4]B–4D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/886-Fig4.jpg\nFigure 4. Sample preparation and vibratome Sectioning\nKrazy glue is used to adhere the agarose embedded sample onto the metal vibratome sectioning plate (A–D), which is then placed into the vibratome tray containing ice-cold PBS (E and F).\nAttach the metal vibratome plate with the glued sample to the vibratome such that the sample is submerged in the vibratome reservoir containing ice-cold PBS and surrounded by ice (Figures 4[href=https://www.wicell.org#fig4]E and 4F).\nUse the vibratome to trim and section through excess agarose surrounding your sample and brain regions that are not of interest (e.g., section through a significant proportion of the embryonic cortex to reach the embryonic hypothalamus).\nOnce you reach your brain region of interest, begin collecting the 300–350 μm vibratome slices using a brush and metal spatula (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/886-Fig5.jpg\nFigure 5. Placement, treatment and culturing of embryonic brain slices\nSliced embryonic brain sections are transferred from the vibratome sectioning chamber to a cell culture dish using a brush and spatula (A and B), where up to three embryonic brain sections can be placed on the cell culture insert (C). Excess PBS that was transferred from the vibratome chamber is aspirated using a pipette (D) and slice culture medium is added to the top of each embryonic brain slice (E). AAV viral transduction can be achieved using a pipette and localized application (F). Scale bar represents 10 mm (A).\nPlace the 300–350 μm vibratome slices on the cell culture insert within the glass bottom Petri dishes containing the medium (Figures 5[href=https://www.wicell.org#fig5]B and 5C). Troubleshooting 1[href=https://www.wicell.org#sec5.1]",
    "Use a pipette to remove any PBS that was transferred from the vibratome sectioning chamber to the cell culture insert (Figure 5[href=https://www.wicell.org#fig5]D).\nAdd 20–40 μL slice culture medium to the top of each embryonic brain section (Figure 5[href=https://www.wicell.org#fig5]E).\nSlice culture, viral transduction, and treatments\nTiming: 2–48 h\nThe goal of this step is to culture the embryonic brain slice in a cell culture incubator for 2 h or longer, in order to allow the slice to rest and normalize following the trauma experienced during the slicing procedure. At this stage during the protocol, embryonic brain slices can be exposed to virus, treated with Annexin V or other compounds, or stained with Hoechst, for example.\nPlace the embryonic brain slices atop the culture insert within the glass bottom Petri dish into a cell culture incubator with ambient oxygen and 5% CO2 at 37°C for at least 1–2 h prior to imaging.\nNote: Embryonic brain slices can remain in the incubator for up to 48 h prior to imaging; however, the slice culture medium should be changed daily.\nOptional:\nAAV Viral Transduction\nIn order to label radial glia and/or other cells with GFP (as per Rosin et al., 2021[href=https://www.wicell.org#bib13]), 1–2 μL Adeno-associated virus (e.g., AAV2-GFP control virus) can be diluted in 5 μL slice culture medium and applied to the surface of the Cx3cr1CreERT2; Rosa26tdTomato vibratome-sectioned embryonic brain tissue in the region of interest (e.g., hypothalamus, Figure 5[href=https://www.wicell.org#fig5]F), and placed in a cell culture incubator with ambient oxygen and 5% CO2 at 37°C for 24–48 h before imaging.\nAnnexin V Treatment",
    "Vibratome sectioned embryonic brain slices atop cell culture inserts within glass bottom Petri dishes can be treated with Annexin V to block externalized phosphatidylserine (Brelstaff et al., 2018[href=https://www.wicell.org#bib1]; Rosin et al., 2021[href=https://www.wicell.org#bib13]) after removing the slice culture medium. By blocking externalized phosphatidylserine, interactions between microglia and radial glia that result in radial glia breakage and phagocytosis by microglia, can be reduced (Rosin et al., 2021[href=https://www.wicell.org#bib13]). Annexin V can also be used to detect apoptotic cells. Once the slice culture medium has been aspirated, a solution containing 7.5 μL Annexin V conjugated to Alexa Fluor 647 diluted in 1,132 μL HBSS and 375 μL 10 mM CaCl2 can be placed in the glass bottom Petri dish and incubated at room temperature (∼20°C–22°C) for 15 min in the dark. Following the incubation, the glass bottom Petri dish should be washed with slice culture medium twice, whereby the final solution added to the glass bottom Petri dish is 1.5 mL slice culture medium containing 5.4 μL Annexin V (100 μg/100 μL). The vibratome sectioned embryonic brain slices can then be placed in a cell culture incubator with ambient oxygen and 5% CO2 at 37°C for 2–48 h before imaging.\nHoechst staining",
    "Vibratome sectioned embryonic brain slices can be stained with Hoechst in order to visualize the nuclei of individual cells in the sliced brain during imaging, if visualizing the movement and interactions of all cells in the slice is of interest. Once the slice culture medium has been aspirated, 1.5 mL of a solution containing 1 μL Hoechst diluted in 7.5 mL of PBS can be applied to the glass bottom Petri dish, with at least 50 μL of the solution added to the brain slice itself, and incubated for 10–15 min in the dark. Following the incubation, the glass bottom Petri dish should be washed with PBS three times. Fresh slice culture medium can be added to the glass bottom Petri dish and the vibratome sectioned embryonic brain slices can then be placed in a cell culture incubator with ambient oxygen and 5% CO2 at 37°C for 2–48 h before imaging.\nLive-cell imaging and analysis\nTiming: Up to 20 h\nThe goal of this step is to visualize microglial interactions with radial glia. Microglial dynamics and/or their interactions with other cell types can also be visualized in embryonic brain slices using this protocol by modifying the transgenic mouse lines and labeling tools employed.\nFor live-cell imaging, glass bottom Petri dishes containing the embryonic brain slices atop cell culture inserts can be placed in a 37°C heated and humidified imaging chamber and exposed to 5% CO2/40% O2 balanced with nitrogen (Praxair) via a gas bubbling system (Figures 7[href=https://www.wicell.org#fig7]A–7C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/886-Fig7.jpg\nFigure 7. Confocal microscope setup\nThe glass bottom Petri dish containing the vibratome sectioned embryonic brain samples is placed in the confocal microscope incubation chamber (A) and the glass imaging chamber lid is placed on top of the chamber bottom (B) before imaging on the confocal microscope (C) can begin.",
    "Live-cell imaging can be achieved using a Zeiss LSM 700 inverted confocal microscope equipped with a 20× long working distance objective (air / 0.4 numerical aperture).\nZ-stacks should be taken from the center (e.g., 30–100 μm) of the 300–350 μm slice using a pinhole of 1–2 AU, depending on the microscope being used and the fluorescent signal observed, with a Z-step size of 3–7 μm, again depending on the total Z-plane size.\nEach Z-stack requires between 5–15 min to acquire, depending on the microscope being used and the parameters listed above; therefore, the slices should be given 5 min to rest between Z-stack acquisitions.\nLaser power should be maintained around 2% to prevent photobleaching and toxicity.\nImaging can be set to continue for any length of time, up to 20 h, depending on the conditions and parameters listed above.\nIf the live-cell imaging experiment is performed on a Zeiss microscope, the resulting live-cell imaging videos can be analyzed using ZENBlack software. Troubleshooting 2[href=https://www.wicell.org#sec5.3]\nIf the time-lapse live-cell imaging video is acquired on a Zeiss microscope, ZENBlack software can be used to convert the resulting .czi file to a maximum intensity projection to merge the Z-stacks to generate a video that can be viewed and from which stills can be obtained (Rosin et al., 2021[href=https://www.wicell.org#bib13]).\nIn the ZENBlack software program, the 3D function can be used on the original .czi video acquired to generate 3D renderings of microglial-radial glia interactions (Rosin et al., 2021[href=https://www.wicell.org#bib13]).\nMicroglia numbers and microglial-radial glia interactions were quantified manually using the original .czi file acquired in ZENBlack using the Ortho function, which allowed for visualization of microglia wrapping their processes around radial glial projections (Rosin et al., 2021[href=https://www.wicell.org#bib13]).",
    "Critical: Given the slice culture setup and distance between the glass bottom Petri dish and the embryonic brain slice atop the cell culture insert (Figure 5[href=https://www.wicell.org#fig5]C), it is important to image the tissue on an inverted microscope that is equipped with a long working distance objective. Imaging with an objective that is not equipped to account for this additional distance will result in poor imaging quality and suboptimal resolution of the cells of interest. It is possible that these issues could be bypassed by imaging the embryonic brain slices using two-photon microscopy.\nNote: While every effort should be used to maintain the laser power around 2% to prevent slice photobleaching and toxicity, fluorescence from the GlastGFP transgene often appears fairly weak in embryonic brain slices, therefore, the laser power was set between 6%–8% during these experiments (Rosin et al., 2021[href=https://www.wicell.org#bib13]), which did not show any obvious signs of impacting slice health. Again, it is possible that this issue could be bypassed by imaging the embryonic brain slices using two-photon microscopy."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience",
    "Developmental Biology",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}