{
  "id": 7746,
  "origin_website": "Bio",
  "title": "Cell-derived Matrix Assays to Assess Extracellular Matrix Architecture and Track Cell Movement ",
  "procedures": [
    "Under sterile tissue culture conditions, prepare tissue culture glass bottom dishes   Note: Although this step is not strictly necessary, it is recommended to stabilize the anchoring of the matrices to the glass surface of the dish.  Coat glass bottom dishes (in a 12-well plate) with 1 mL of 0.2% sterile gelatin and incubate for 60 min at 37 °C.Wash dishes twice with warm (37 °C) PBS.Crosslink gelatin layer with 1 mL of 10% neutral buffered formalin and incubate for 30 min at room temperature.Wash twice with warm (37 °C) PBS.Quench the formalin crosslinker by the addition of 1 M sterile glycine and incubation for 20 min at room temperature.Wash twice with warm (37 °C) PBS.Add growth media to the dishes and incubate for 30 min at 37 °C.Use immediately or store in supplemented PBS with 2.5 µg/mL fungizone and 5% pen/strep sealed with parafilm to prevent evaporation for up to four weeks.After storing the coated dishes:Wash twice with warm (37 °C) PBS.Add growth media to the dishes and incubate for 30 min at 37 °C before proceeding to Procedure B. Plating fibroblasts and matrix production   Note: This will vary depending on cell type.  Detach and harvest fibroblasts as per established protocols for the specific cell line.Dilute fibroblasts and plate as appropriate:This will vary depending upon fibroblast type and if the cell line has overcome contact inhibition of proliferation. For lines that stop growing upon contact, such as TIFs, appropriate cell numbers should be plated to reach 90%–100% confluence in 12–24 h. For lines that continue to grow upon contact, such as pancreatic cancer CAFs (Vennin et al., 2019), appropriate cell numbers should be plated to reach 30%–40% confluence in 12–24 h. This should be determined prior to the experiment for each fibroblast cell line.",
    "For example, TIFs should be seeded at 2.5 × 105  cells per well of a 12-well plate the day prior to ascorbic acid supplementation to then obtain a CDM after six days (please also seeFigure 1e).Culture fibroblasts overnight at 37 °C. The oxygen content is dependent on the specific cell line being used.Replace media with fresh growth media supplemented with 50 µg/mL ascorbic acid and appropriate drug if applicable.Treatment timing will vary depending on fibroblast type: for lines that stop growing upon contact, wait until the cells are confluent to begin treatment. If cells continue to grow upon contact, then commence treatment when cells are 30%–40% confluent. This should be determined for each fibroblast cell line.For some fibroblast cell lines, it is beneficial to treat with 100–500 µg/mL of ascorbic acid on Day 1 of supplementation, switching to 50 µg/mL to increase matrix thickness. This should be determined individually for each cell line prior to the experiment.Change ascorbic acid media every second day. If treating cells with a pharmacological agent, refresh both drug and ascorbic acid at the same time.For cell lines that require conditioned media, remove and replenish half of the media volume with fresh media supplemented with 100 µg/mL of ascorbic acid to achieve a final concentration of 50 µg/mL.Culture for 6–10 days depending on the rate of matrix production.The longer matrices are left to develop the more likely they are to detach. The ideal culturing and matrix production should be determined for each independent fibroblast cell line prior to the experiment. Time course assays are recommended to determine this timeframe.From here, CDMs can either be used for the analysis of ECM ultrastructure (see  Data analysis  for further detail) or denuded to remove fibroblasts (Figures 1, 2). ECM ultrastructure analysis is discussed in step B7.",
    "We recommend leaving the fibroblasts intact to ensure that cell–matrix interactions of both fibroblasts and matrix are upheld.For analysis of the ECM by imaging or histological staining:Second-harmonic generation (SHG) imaging: perform on unfixed matrices with fibroblasts intact to visualize fibrillar collagen I.Picrosirius red staining/birefringence imaging: fix matrices with intact fibroblasts overnight in 10% neutral buffered formalin, then change to 70% ethanol prior to picrosirius red staining (as per manufacturer’s instructions, see steps i.–v. below) and imaging. CDMs should be imaged immediately.Incubate CDMS in 0.02% phosphomolybdic acid for 2 min.Rinse three times with Reverse Osmosis (RO) water.Stain CDMs with 0.1% picrosirius red solution for 1 h.Rinse twice with acidified water (10 s for wash 1 and 2 min for wash 2).Rinse three times with 70% ethanol (store in 70% ethanol for imaging and do not let the CDMs dry out).For analysis of cancer cell interactions with CDMs, proceed to  Procedure C  and  D  . Denuding fibroblasts  Aspirate media and wash cells twice with PBS.Gently add pre-warmed extraction buffer, sufficient to cover the cell/matrix layer.Lyse for roughly 2 min.Cell lysis is virtually instantaneous but can vary depending on matrix thickness. Leave the extraction buffer on until no intact cells are visible by transmitted light microscopy.It is not recommended to lyse for more than 5 min as the CDM is delicate and extended incubation time in extraction buffer can cause detachment. From this point onwards, it is also recommended not to use suction for media and buffer changes anymore.Aspirate extraction buffer and wash twice with supplemented PBS (see Recipes).Incubate in supplemented PBS with 10 mg/mL DNase I to minimize DNA debris in the CDMs.Aspirate DNase and wash twice with supplemented PBS.Use immediately or store at 4 °C in supplemented PBS with antibiotics and antifungals (pen/strep 5% and 0.",
    "25 µg/mL fungizone) sealed with parafilm to prevent evaporation for up to two weeks. Preparation of denuded matrix for plating of cancer cells  If matrices have been stored, allow them to acclimatize to room temperature before washing twice with supplemented PBS. Otherwise, continue directly to step D3.As per instructions from Franco-Barraza et al. (2016), if you are performing antibody staining following the seeding of cancer cells, it is recommended to block the matrices with BSA. Otherwise, continue to step D3.Incubate matrices in appropriate growth media for the cancer cells for 30 min at 37 °C.Remove media and seed cancer cells at the appropriate density:For example, using KPC pancreatic cancer cells from the KPC (Kras  G12D/+; p53  R172H/+; Pdx-1Cre) mouse model of pancreatic cancer, seed at a density of 2.5 × 104  for migration assays or 1 × 105  for biochemical assays per well of a 12-well plate.For analysis of cell migration, seeding density may have to be further optimized to track single cell or collective cell migration; we recommend tracking cells for 72 h."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}