{
  "id": 10164,
  "origin_website": "Jove",
  "title": "In Vitro Preparation of Actively Maturing Bovine Articular Cartilage Explants for X-Ray Phase Contrast Imaging",
  "procedures": [
    "All methods described here have been approved by the Ethical Research Committee of Swansea University and biopsy materials were acquired under license from the Department for Environment, Food & Rural Affairs (DEFRA), UK. This protocol follows the animal care guidelines of our institutions.\n1. Explant Cultures\nPreparation of the explants from bovine legs scalp\n\t\nPrepare absorbent protector and a scalpel, standard surgical scalpel with #10 scalpel blade.\nSpray all the materials with 70% ethanol solution.\nSoak the bovine leg (7 days-old male bovine steers obtained from the slaughterhouse with veterinary approval) with water to remove all blood and mud.\nClean the leg with soap and scrub with a brush.\nWhen adequately clean, spray the leg with 70% ethanol.\nPut it on an absorbent paper.\nCut around the feet with a scalpel.\nTrace a delicate line along the length of the leg.\nTake extra care in the joint zone.\nRemove the skin of the leg carefully along the lengthwise scalpel line.\nPut the waste (skin, used tissue, paper and gloves) in a clinical waste bag.\nClean/brush the leg with soap and sterilize with ethanol again when the skin has been removed.\nDo not damage the region close to the joint cavity. If the cavity is opened or damaged with blood infiltration, it is not sterile anymore and the leg cannot be used.\nPlace the leg in an Al-foil that have been sprayed with 70% ethanol.\nPlace the appropriately sized latex gloves over the ends of the leg to prevent blood egress from the proximal end or possible contamination from the hoof.\nDispose of the waste materials in the appropriate manner following institutional rules.\nExplant extraction and culture",
    "NOTE: The explants must be obtained from the internal part of the joint (Figure 2, two first stages). To be of comparable conditions, four (or six) explants must be punched from the same zone in order to apply the four (or six) different treatments on samples possessing almost the same shape and characteristics.\n\t\nOpen the laminar flow hood 25 min before use, clean with alcohol 70%.\nPut the culture medium to warm in a water bath.\nPrepare a 24 well plate with 1.5 mL of basic medium, DMEM-F12 only (washing medium) in each well.\nPrepare another well plate with 1.5 mL of complete culture medium. Store in culture incubator at 37 °C until use\nPrepare the material on a rack: one universal tube with 70% ethanol and another universal tube with washing medium.\nPrepare a scalpel and a 4 or 6-mm biopsy punch (placed in the alcohol universal tube).\nPut the tubes and the materials under the hood.\nPut an absorbent protector sprayed with 70% ethanol under the hood.\nPrepare some tissues sprayed with 70% ethanol.\nTake a dissection plate, cover it with Al-foil.\nTake the same, previously prepared, feet out of the fridge (4 °C) and spray them with 70% ethanol.\nDispose hazardous and clinical bags near the hood to autoclave the waste later.\nSpray the foot with 70% ethanol.\nMove the joint to find the midline of the joint where the incision should be made. Do this under the hood.\nTake the sterile scalpel.\nCut carefully along the midline following the contour of the joint edges. Do not touch the metacarpophalangeal joint medial condyle cartilage.\nCarefully cut the ligament when the joint is opened.\nThrow away the lower part of the feet in an autoclave bag.",
    "Remove all the other tissues in order to expose all the cartilage of the joint (Figure 2).\n\t\tNOTE: Be careful not to touch anything with the feet.\nPlace the scalpel and biopsy punch in alcohol and then in the washing medium.\nMake some circles with this punch (4-5 per face) with some force along the internal faces of the bones.\nPlace the bio-punch in alcohol when finished to clean it.\nTake a scalpel and cut (trace a line) between each circle and along the central line of the bone.\nTo take out the cartilage explant cut vertically on one of the borders of the circle biopsy, then cut horizontally on the subchondral bone very carefully.\nTo remove the cartilage explant cut horizontally below the punch line along the subchondral bone and calcified cartilage, the explants will pop out.\n\t\tNOTE: Explants should have a uniform thickness, if possible.\nPlace the explant in the well plate filled with 1.5 mL of washing medium.\n\t\tNOTE: Always perform experimental control and treatment of explants coming from the same location in the joint.\nCheck that the explant is well orientated correctly. The surface of the explant should be facing up and the subchondral bone part of the explant should face the bottom of the well plate.\nKeep the well plate closed in between each biopsy.\nRemove the washing medium.\nWash again with wash medium. Leave in wash medium for 2-3 h. Bone residues, blood will have time to flux out in the medium.\nTransfer the explants in a new well plate containing the complete culture medium. Be careful: don't touch anything with the pipette.\nCheck that explants are still in the right position (bone facing the bottom part of the well-plate).\nClean everything and throw away the clinical waste in adequate place.",
    "Once the explants are placed in culture in an incubator at 37 ˚C with 5% CO2, change the explant culture medium every two days with warm fresh medium to sustain to the diverse needs of the cells/tissues. Check that explants are still in the right position (bone facing the bottom part of the well-plate).\nSample fixation (optional)\n\tNOTE: Perform this step after only at the end of the cell culture which means after 3 weeks of culture. The explants have then reached at maturated stage.\n\t\nWash the explants with DMEM-F12 with a pipette under the tissue culture hood.\nWash the explants twice with PBS with a pipette under the tissue culture hood.\nFix them overnight at 4 °C by soaking in 10% NBFS (Neutral Buffer Formalin Saline).\nPlace the fixed explants in PBS in a microcentrifuge tube\nStore the explants at 4 °C. Fixed explants can stay in these conditions up to 6 months.\n2. Sample preparation for the imaging session\nUse conical plastic tips of an appropriate size (usually 1 mL tip) with the respect to the sample and the camera field of view.\nSeal the cone tip (by heating it with a flame) in order to have a water-proof sample container.\nFill the tip with PBS. Hold the sample with tweezers and insert it into the tube. Remove air bubble by slow shakes.\nMount the tube on the tomography stage and align it by taking simple radiographs.\n3. X-ray Phase Contrast imaging session\nPlace the detector at 2.5 m from the sample\nSet the X-ray photon energy to 17 keV using a double Silicon crystal system within a Bragg-Bragg geometry.\nMount Imaging detector consisted of a scientific CMOS camera22 on an optic with a resulting isotropic voxel size of 3.5 µm in the 3D image.",
    "Use a 60 µm thick Gadolinium Oxysulfide scintillator screen to convert the X-ray to visible light\nData collection: Acquire 2000 projections during a 360˚ scan of the sample with an exposure time of 2 s for each projection.\nUse a the phase retrieval algorithm to extract the phase signal as described in ref.23. The algorithm uses an a priori knowledge of the complex refractive index distribution within the sample. The main hypothesis, not verified here, is that there is one material to reconstruct. In this particular case, the ratio between the refraction and the absorption index set to 1,200 which was experimentally observed to the best compromise for bone and cartilage visualization.\nUse the standard filtered back projection CT reconstruction algorithm using an open-source, Graphics Processing Unit (GPU)-based implementation of the PyHST2 code24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}