{
  "id": 8431,
  "origin_website": "Jove",
  "title": "Intracerebroventricular Treatment with Resiniferatoxin and Pain Tests in Mice",
  "procedures": [
    "All of the experimental protocols used here were approved by the Animal Care and Use Committee of Musashino University. Male ddY mice (SLC, Shizuoka, Japan) were kept for at least 7 days under a 12-h light/dark cycle before experiments with water and food ad libitum. 5- or 6-week-old mice were used for the experiments.\n1. Preparation of Drugs\nRTX\n\tNOTE: Alcoholic RTX solution can cause severe skin burns and eye damage. Make sure to use rubber gloves and glasses for protection when handling. This stock solution can be used for 6 months.\n\t\nAdd 500 µL of ethanol to 1 mg of RTX.\nAdd 500 µL of polyoxyethylene (20) sorbitan monooleate to the solution above and vortex well.\nAdd 4 mL of physiological saline to the mixture and vortex well.\nAliquot 40 µL of the solution into 1.5-mL screw cap tubes, and store them at -40 °C.\nAcetaminophen\nAdd 20% w/v propyleneglycol solution to acetaminophen at a concentration of 30 mg/mL, and dissolve with a sonicator. Since acetaminophen may precipitate at room temperature several hours after dissolution, prepare just before use or keep the solution warm until use.\n2. Subcutaneous or Intracerebroventricular Injection of RTX\nThaw the stocked solution prepared in 1.1. above and dilute it to 20 µg/mL in saline or artificial cerebrospinal fluid (ACSF) consisting of (in mM): 119 NaCl, 2.5 KCl, 1 NaH2PO4, 26 NaHCO3, 11 glucose, 1.3 MgSO4, 2.5 CaCl2 equilibrated with 95% O2 and 5% CO2 (pH 7.2).\nAnesthetize mice with pentobarbital sodium salt (60 mg/kg, intraperitoneally), and check for loss of the righting reflex.",
    "For s.c. treatment, inject RTX (20 µg/mL) into the back of the neck at a volume of 0.1 mL/10 g body weight. For the control group, inject the vehicle (10% ethanol, 10% polyoxyethylene (20) sorbitan monooleate and 80% saline) in the same way.\nFor i.c.v. treatment, inject 5 µL of RTX (20 µg/mL) into the right lateral ventricle. For the control group, inject the vehicle (10% ethanol, 10% polyoxyethylene (20) sorbitan monooleate and 80% ACSF) in the same way.\n\t\nPass a disposable 27-G needle through a metal tube (0.8 mm I.D.) to expose the 3.0-3.5 mm tip of the needle (Figure 1A).\nDisinfect the head of mouse with 70% alcohol, and hold the squamosal bones of the mouse firmly with the fingers (Figure 1B).\n\t\tNOTE: Pay attention to the positions of the squamosal protrusions, since these protrusions will serve as landmarks for injection.\nMove the needle laterally on the scalp, and find the sagittal suture as the needle tip is hooked on the suture.\nMove the tip about 1 mm to the right, then move the tip rostrally, and find the coronal suture as with 2.4.3. (Figure 1B).\nInsert the needle slowly and vertically, inject the RTX solution in about 10 seconds, and hold it for about 10 seconds.\nWithdraw the needle slowly, and return the mouse to its home cage. Bleeding is usually minimal or absent. If major bleeding occurs, use of another mouse should be considered.\nAssign the pretreated mice as subjects for the RTX test or the tail pressure test (Step 3 and 4, respectively).\n3. RTX Test\nNOTE: Testing is performed between 10:00 AM and 5:00 PM. The testing room is maintained at 200 lux and 24-26 °C.",
    "One week after pretreatments with RTX (Step 2.), transfer mice to the testing room at least 60 min prior to starting the test.\nWeigh and place each mouse individually in a plexiglass cage (29.5 × 17.5 × 13.5 cm3 height) at least 30 min prior to starting the test in order to allow it to acclimate to the environment.\n\tNOTE: The order of tests should be counterbalanced across pretreatment groups.\nAdminister acetaminophen (300 mg/kg) to the mouse intraperitoneally 20 min before the test.\nHold the mouse loosely in a small cloth bag, and insert a 30-gauge needle into the heel of the right hind paw. Advance the needle subcutaneously to near the walking pads, and inject 20 µL of RTX solution (0.05 µg/mL).\nMeasure the period of licking/biting behavior in theglabrous region of the affected paw in each 5-min block.\n4. Tail Pressure Test\nNOTE: A Randall-Selitto-type pressure meter is used to assess the threshold for acute mechanical nociception. Testing is performed between 10:00 AM and 5:00 PM. The testing room is maintained at 200 lux and 24-26 °C.\nOne week after pretreatments with RTX (Step 2.), transfer mice to the testing room, and weigh and place each mouse individually in a plexiglass cage.\nMark the spots at 1.5 and 2.5 cm from the base of the tail.\nHold the mouse loosely in a small cloth bag, and apply pressure to the spots with a blunt probe.\n\tNOTE: A cutoff pressure of 250 g is imposed to avoid tissue damage.\nDetermine the pressure required to elicit escape behavior (tail whisking, twisting, and squeaking), and calculate the nociceptive threshold by averaging the pressure determined at the two spots.\nRepeat steps 4.3. to 4.4. every 15 min.",
    "After obtaining the baseline, administer acetaminophen (300 mg/kg) to the mouse intraperitoneally. After administration, repeat steps 4.3. and 4.4 every 15 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}