{
  "id": 11861,
  "origin_website": "Jove",
  "title": "Manual Construction of a Tissue Microarray using the Tape Method and a Handheld Microarrayer",
  "procedures": [
    "All donor blocks were deidentified during collection and used for TMA construction in compliance with approved Mayo Clinic IRB protocols (PR16-000507 and PR2207-02).\n1. Pathology review\nRetrieve the FFPE tissue donor blocks to be used in the TMA construction.\nSubmit a freshly generated hematoxylin and eosin (H&E) stained slide13 for each FFPE tissue donor block selected for histological review by a board-certified pathologist to confirm the diagnosis and annotate the tissue.\n\tNOTE: H&E staining may be performed in house or sent to a pathological core services lab for staining, as was the case in this protocol. One of the most important concepts to remember when constructing TMAs is that the tissues in the FFPE donor blocks are 3-dimensional (3D) structures whose shape, tumor content, and tissue viability can change significantly with increasing block depth. The pathologist must determine, based on the review of the H&E stained tissue section, which is a 2-dimensional representation of the 3D tissue, the best region to extract the tissue core from.\nDuring histological review, ensure that the pathologist identifies and annotates the tissues of interest/not of interest on the H&E stained slides. To annotate the slide, follow the steps below.\n\t\nUse a slide marking pen to circle the tissue of interest.\nUsing the same marking pen, blot out areas within the circled region that should be avoided.\nUse the marking pen to mark the areas deemed to be ideal for core sampling and extraction.\n\t\tNOTE: It is important to remember that the tissue shape and composition may change with tissue depth in the block. Thus, the composition of the tissue core may change depending on where the core was extracted, which emphasizes the need for continued pathological guidance.",
    "Submit additional tissue for disease specific immunohistochemical stains alongside the H&Es, if needed, to assist the pathological review. Examples of such stains include ERBB2 staining for HER2 positive breast cancer14, HHV-8 for Kaposi sarcoma15, CD20 for B-cell lymphomas16, U6 as a global marker for RNA quality17, EBER to determine Epstein-Barr virus positivity18, and Vimentin as confirmation of mesenchymal origins and tissue quality control marker19,20.\n2. Preparation for TMA construction\nOnce the pathology review is complete, compile the final list of donor blocks to be used in the TMA construction and create a TMA map (Figure 1A). The TMA map is a schematic outlining where the cores will be located in the completed TMA and slide mounted tissue samples obtained from the resulting TMA.\nFor orientation purposes, ensure that the TMA map avoids placing cores in an even matrix such as a 3 x 3 or 4 x 4 matrix and includes at least 1 orientation marker.\n\t​NOTE: Orientation cores can be cores taken from tissue free colored orientation tools21, or tissue blocks containing distinctly different tissues from the theme of the TMA. Unlike the recipient method where upright cores are inserted into a pre-cast wax mold, the tape method creates a TMA by pouring molten wax around inverted, erect cores. This inversion of the construction process requires a second map known as the construction map.\nCreate the construction map by creating a mirror image of the TMA map (Figure 1B). The construction map shows where each core must be placed during construction in order to appear in the correct location in the completed TMA. Save the construction map.\nOnce the maps have been created, prepare the metal TMA base mold. Use a disposable paper checkered grid to guide core placement and regulate core separation.",
    "NOTE: A 6 x 7 (42 spot) template grid for a max of 40 cores (plus for two orientation cores/gaps) for use with commercially available metal base molds with internal dimensions of 26 mm x 20 mm is provided in the supplementary pdf. Print and cut out the paper grid.\nCut the checkered grid to size and affix a piece of double-sided stick tape (DSST) to the back of the grid. Place the grid and DSST tape into the metal tray and add a second piece of DSST on top of the grid, i.e., on top of the paper grid in the metal base mold (Figure 2A).\n3. Core placement\nOverlay the pathologically reviewed H&E onto its corresponding tissue block and use the pathologist markings to identify where the tissue block is to be punched (Figure 2B).\nPunch the FFPE donor block using a manual core punch (Figure 2C) at the appropriate place.\n\tNOTE: Core punches are available in a variety of diameters. This method employs a 2 mm diameter handheld core punch.\n\t\nIf using a reusable core punch, ensure that it is cleaned before and after each tissue punch.\nEject the core from the core punch and use a needle pick to place the ejected core on the crosshairs of the DSST covered grid (Figure 2D). Make sure that when the core is placed on the grid, it is inverted and upright such that the tissue end of the core contacts the DSST (tissue-face-down). Also ensure that the core is placed at the appropriate position on the grid as denoted by the construction map.\nRepeat until all donor blocks are cored and the cores are placed at their appropriate positions.\n4. Completing the TMA",
    "Turn on the bench-top oven, set to 78 °C, and allow sufficient time to get to temperature.\nFor each TMA to be constructed, melt 45 g of paraffin pellets in an oven-proof container.\nLabel a plastic cassette and place it on top of the metal base mold containing the cores (Figure 2E). The height of the cores should not exceed the depth of the metal tray as tall cores will be tilted or toppled when the cassette is put in place.\nPlace the mold with the cassette onto a tray to catch overflow and gently pour the melted paraffin through the cassette into the tray of cores (Figure 2F).\nAllow the molten paraffin to overflow to ensure there are no air bubbles in the body of the TMA. Ensure that the paraffin fills to the top of the cassette so that it is embedded in and firmly bound to the paraffin block once the paraffin has solidified.\nDo not move or disturb the block and allow it to cool at room temperature for 30 min. Then, refrigerate at 4 °C for an additional 30 min to completely solidify.\nOnce completely solidified, gently separate the metal base mold from the cassette bound paraffin block of cores.\n\t​NOTE: The DSST retains its adhesiveness through the construction process and is frequently attached to the newly formed paraffin block. If applicable, gently remove the DSST and grid from the top of the now completed TMA block.\n5. Validating the TMA\nOnce the TMA is constructed, use a microtome to section the newly completed TMA. Cut one or more full-faced tissue section.\nTransfer the sections to the prewarmed water bath and slide mount the sections.",
    "NOTE: Newly constructed blocks often require block facing (cutting away of excess paraffin) in order to obtain full face tissue sections that contains all cores.\nOnce dry, submit a freshly cut slide-mounted TMA section for H&E staining13 and any additional immunohistochemical staining, if needed.\nSubmit the stained TMA H&E sections for pathological review.\n\tNOTE: During TMA pathology review, a board-certified pathologist, preferably the same pathologist who reviewed the TMA donor blocks, reviews the TMA H&E stained cores to ensure the desired tissues of interest are indeed present. If any additional tissue or disease-specific immunohistochemical stains were submitted for donor block review in step 1.3.4, these stains should be repeated on TMA sections and submitted alongside the TMA H&E for pathological review.\nRecord the results of the TMA pathological validation review."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}