{
  "id": 9589,
  "origin_website": "Jove",
  "title": "Retrograde Loading of Nerves, Tracts, and Spinal Roots with Fluorescent Dyes",
  "procedures": [
    "Fluorescent dextrans have been used as anatomical tools and for imaging neuronal activity1-4. Fields et al., (2009)4 published a protocol for applying ion- and voltage-sensitive dyes to axonal tracts with a focus on the spinal cord as a model system. Here we describe a more detailed procedure for applying fluorescent and/or ion-sensitive dye to the cut ventral roots, dorsal roots or any neuronal tract of the spinal cord for in-vitro optophysiological and morphological studies.\n1. Type-I and Type-II Pipettes\nStart by pulling two short sections of polyethylene tubing (PE90, Clay Adams Brand) over the flame of an alcohol lamp7 to produce pipettes with tapered tips. One pipette (Type-I) should be short (3-7 mm) with a small tip that can tightly hold the target root or tract (Outer Diameter: 0.2-0.4 mm; Inner Diameter: 0.1-0.3 mm). Then pull a second pipette (Type-II) with a longer (8-12 cm) thinner, shaft and a very fine tip (Outer Diameter: 0.2-0.3 mm; inner Diameter: 0.1-0.2 mm) that can be inserted into the Type-I pipette as far as its tip. The second thinner pipette will be used to aspirate and introduce artificial cerebrospinal fluid (aCSF) and dye solution respectively from the Type-I pipette.\n2. Positioning of Type-I Pipette\nDissect and isolate the spinal cord8,9 and place it in a bath, superfused with chilled aCSF (~16 °C) throughout the loading process. Place the Type-I pipette on an electrode holder (H1/12 electrode holder, Narishige) so that its back opening can be easily connected to a syringe (1ml U-100 Insulin syringe, Becton Dickenson or comparable) via a flexible tubing (PharMed BPT, Cole-Parmer, #AY242002; 10 cm) (Fig.1A-B).\n \n3. Dye Application",
    "Using the syringe, first draw aCSF into the Type-I pipette (Fig.1B; 2A) followed by the axonal tract or root to be filled (Fig. 2B). The flexible tubing should then be removed from the back opening. The Type-II pipette is attached to another syringe and inserted into the Type-I pipette holding the axonal tract or root. Using the syringe attached to the type-II pipette, aspirate aCSF so that the residual aCSF just covers the axonal tract (Fig.1C; 2C-D). Then withdraw the type-II pipette from the type-I pipette. Monitor the aCSF level for a few minutes to verify a good seal on the axonal tract or nerves (see Section 3 in Troubleshooting for \"good seal\").\nDissolve the dye in aCSF or 0.2% triton X-100 in double distilled water and draw it into the Type-II pipette while paying attention not to include air bubbles. Insert the Type-II pipette containing the dye into the Type-I pipette and into the residual aCSF solution (Fig. 2E). Slowly release the dye into the aCSF using gentle positive pressure (Fig. 2F). Be careful not to introduce any air bubbles or to cause displacement of the target tissue from inside the tip. Withdraw the type-II pipette after sufficient amount of dye has been released (3-5 μL of dye solution).\n4. Incubation\nIncubate the tissue in the dark between 6 to 20 hours depending on the type of experiment. Once sufficient time has been allowed for filling, gently pull away the electrode from the tissue leaving the tissue ready for imaging or histology.\nTroubleshooting\nIf the target tissue does not enter easily into the tip of the Type-I pipette or is loose once inside, then the tip diameter is the wrong size. If this occurs, pull and use a different pipette.",
    "Before adding the dye to the aCSF in the type-I pipette, make sure that enough aCSF remains so that it can be reached with the Type-II pipette tip (Fig. 2D). Otherwise, an air gap will exist once the dye is added. If this happens, do not add the dye and remove the axonal tract from the pipette and then draw it back in with sufficient aCSF to be reached by the Type-II pipette.\nIf the aCSF level in the Type-I pipette increases after it was aspirated with the Type-II pipette, it means that the seal with the tissue is not good. Use a different electrode, otherwise the dye will be diluted during the labeling procedure.\nIf an air bubble is introduced into the Type-I pipette while injecting the dye, drain out the bubble by advancing the Type-II pipette tip close to the bubble and gently applying a weak negative pressure using the attached syringe.\n5. Representative Results\nTo illustrate an application of the method, we simultaneously loaded motoneurons, sensory afferents and spinal interneurons with three different dextran-conjugated fluorescent dyes (Fig. 3A). As illustrated in Fig. 3B, three classes of neuron are labeled; sensory afferents (red), interneurons projecting into the ventral funiculus (green) and motoneurons (blue).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4008/4008fig1.jpg\nFigure 1. Schematic showing Pipette Type-I and Type-II assembly. (A) A Type-I pipette (light blue) is placed on an electrode holder so that it's back opening can be easily connected to the flexible elastomer tubing (B) and into which a Type-II pipette can be inserted (C).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4008/4008fig2.jpg",
    "Figure 2. Schematic showing the loading process of motoneurons with fluorescent dyes. (A) A Type-I pipette is placed near the ventral root to be filled. (B) Suction is applied to the pipette to draw aCSF into the pipette followed by the root. (C-D) Disconnect the flexible elastomer tubing from the backend of Type-I pipette and reduce the amount of aCSF by applying suction to the Type-II pipette. (E) Insert the tip of the Type-II pipette containing the dissolved dye into the remaining aCSF in the Type-I pipette. (E-F) Slowly fill the Type-I pipette with the dye and then remove the Type-II pipette.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4008/4008fig3.jpg\nFigure 3. Application of the filling procedure to the isolated mouse spinal cord. (A) Schematic showing the three Type-I pipettes used to fill different neuronal classes in the spinal cord. Motoneurons (blue; Cascade Blue dextran) and sacral sensory afferents (red; Texas-Red dextran) were backfilled through the ventral and dorsal roots, respectively. Fluorescein dextran was used to load spinal interneurons (green) whose axons ascend through the ventral funiculus (VF). 1 mg of each dextran dye (10,000MW; Molecular Probes) was dissolved in 6 μL distilled water containing 0.2% Triton X-100 (B). Confocal image of a section from the sacral cord of a spinal cord in which the neurons were back-labeled as described in A. Note that the labeled sensory afferents are primarily ipsilateral with a few contralateral projections. The labeled motoneurons are ipsilateral to the filled ventral root whereas the labeled interneurons are contralateral to the side of the fill (arrow head). Calibration bar 200 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}