{
  "id": 19280,
  "origin_website": "Jove",
  "title": "Modeling Stroke in Mice - Middle Cerebral Artery Occlusion with the Filament Model",
  "procedures": [
    "To guarantee high quality and reproducibility, we recommend the use of Standard Operating Procedures (SOP). In this video, published SOPs as developed and used in our laboratory are applied. 1\n1. Middle Cerebral Artery  Occlusion\nMice are anaesthetized with   an appropriate anaesthetic regime in consult with veterinary staff.  (E.g. induction with 1.5 - 2 % Isoflurane and maintainance with   1.0 - 1.5 % Isoflurane in 2/3 N2O and 1/3 O2 using a vaporizer).\n          \nBody temperature of the    mice is maintained at 36.5°C ± 0.5°C during surgery with a    heating plate. A feedback controlled heating pad, which warms    according to the rectal temperature of the mouse, is highly    recommended.\nDisinfect the skin and surrounding fur with an appropriate agent (e.g. 70%    ethyl alcohol) and dry it afterwards.\nA midline neck incision is made   and the soft tissues are pulled apart.\nThe left common carotid   artery (LCCA) is carefully dissected free from the surrounding   nerves (without harming the vagal nerve) and a ligature is made   using 6.0/7.0 string. 5.0 string can also be used.\nThe left external carotid   artery (LECA) is then separated and a second knot is made.\nNext, the left internal carotid   artery (LICA) is isolated and a knot is prepared with a 6.0   filament.\nAfter obtaining good view of   the left internal carotid artery (LICA) and the left   pterygopalatine artery (LPA), both arteries are clipped, using a   microvascular clip. \nA small hole is cut in the   LCCA before it bifurcates to the LECA and the LICA. A monofilament   made of 8.0 nylon coated with silicon hardener mixture (see below)   is then introduced into the LICA, until it stops at the clip.   Attention has to be paid not to enter the occipital artery. (Figure   1)",
    "The clipped arteries are   opened while the filament is inserted into the LICA to occlude the   origin of the LMCA in the circle of Willis.\nThe third knot on the LICA is   closed to fix the filament in position.\nThe mice receive saline 0.5  mL   subcutaneously as volume replenishment. For pain relief, Lidocaine   gel is topically applied in the wound.\nIf reperfusion is intended, mice stay for 30 - 90   min occlusion in a heated cage, the wound could be closed with a   small suture clip. Afterwards, a second anaesthesia is performed,   the third knot on the ICA is momentary opened and the filament   withdrawn. \nThe remaining sutures   are shortened and the skin is adapted with a surgical suture.\nAll animals receive a second   volume replenishment as described above.\nAnimals are put in a heated   cage for two hours to control for body temperature.\n\t\nThe animals must be checked    daily after surgery for signs of discomfort. The mice could show    some post surgical weight loss. They receive mashed food in a    petri-dish placed on the floor to encourage eating. The food is    replaced daily for seven days.\n2. Sham Operation\nFor sham operations the  filament is inserted to occlude LMCA and withdrawn immediately to  allow instant reperfusion (1.8). The subsequent operation is  identical to that performed on the animals undergoing cerebral  ischaemia (1.9 - 1.14) including a second anaesthesia.\n3. Preparation of the Filament",
    "Sterility of the filament   should be considered. The use of sterilized equipment as well as an appropriate handling of the filament afterwards is a   prerequisite for a sterile surgery. Disinfection of the filament is   difficult, since many of the common sterilization methods may   worsen the quality of the filament. However methods such as   radiation, for example with UV light or γ rays, or chemical sterilization, for example with highly reactive   gases such as ethylene   oxide, are   applicable.\n8.0 nylon filament is cut   into lengths of 11 mm   under the microscope\nThe   filament tip must be coated completely and evenly over a length of   8 mm with a hardener mixture of Xantopren M Mucosa and Activator NF   Optosil\n4. Representative Results\nDepending on the duration of blood flow restriction, different motor and behavioural deficits result. Both after 30 and 60 min of cerebral ischaemia, animals in most cases show decreased resistance to lateral push and circling due to disturbance in locomotion. Milder lesions manifest as a flexor position in the front limbs. These easily observable signs can be used as a basic score for the success of the operation.2 \nMorphologically the lesion can be assessed using either histology or Magnetic Resonance Imaging (MRI). Sixty minutes occlusion of the middle cerebral artery produces tissue pannecrosis in an area including both the striatum and the neocortex, whereas 30 minutes of ischaemia cause mainly neuronal cell death limited to the striatum. 3 ( Figure 2) In terms of infarct volume, we expect a standard deviation lower than 30% in a set of operations. Mortality depends on the occlusion time with around 5 % after 30 min of ischaemia and 10 - 20 % after 60 min.",
    "Another minimal invasive possibility is the use of Laser Doppler flowmetry (LDF) during the operation, which allows a direct control of its success. In an individual animal, reduction to 10 - 20 % of preocclusion values clearly indicates successful induction of focal cerebral ischemia. 4 However, LDF cannot be used as a method for interindividual comparisons, since LDF can only measure quantitative changes (in percentages) of blood flow within a small and limited tissue sample volume. It does not give information about the spatial extent of blood flow reduction. 5\nThere are several tests to assess behavioural aspects after stroke, including gait analysis 6,7, Rotarod 8, Pole test 9,10, adhesive removal test 11,12, staircase test 13,14, ladder rung test15,16 and Morris water maze17. In all these tests, mice subjected to MCAo perform less successfully than control animals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2423/2423fig1.jpgFigure 1. Scheme of the vessel architecture supplying the brain (depicted in background) in the mouse. Different strains may show variations, for example the occipital artery sometimes leaves from the internal carotid artery.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2423/2423fig2.jpgFigure 2. Schematic illustration of typical lesion sizes after different time points of reperfusion in the proximal MCAo model. In the middle, the typical course of functional activity and cerebral blood flow after MCAo are depicted. (MCAo: Middle cerebral artery occlusion, LDF: Laser Doppler flow measurement)"
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}