{
  "id": 5891,
  "origin_website": "Bio",
  "title": "Oral Microbiome Characterization in Murine Models",
  "procedures": [
    "Oral and gingival sample collectionOral mucosal microbiome samplingNote: This procedure allows for comprehensive evaluation of microbiome from all oral mucosal areas.Aseptically add 150 µl of TE buffer to 1.5 ml Safe-lock Biopur tubes. Include one per mouse to be sampled and one negative control.Clean work surface with 70% ethanol and RNase AWAY reagent. UV-treat tubes, racks, scissors for 30 min. Anesthetize or euthanize a mouse according to ARAC guidelines.Note: For anesthesia, we prepare a liquid solution consisting of Ketamine (100 mg/kg) and Xylazine (10 mg/kg), which is administered via intraperitoneal injection. We recommend that each mouse is weighed prior to injection, for dosing calculation.Wipe gloved hands with a tissue wipe previously moistened with RNase AWAY reagent.   Open swab envelope and have it ready (one hand), grab the mouse pulling the skin of the neck area so the mouth opens without touching it (other hand) (Figure 1A). Swab the oral cavity for 30 sec, starting on the tongue, then buccal areas, gingiva, palate and finish with the gingiva on the lower incisors (Figure 1B). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214010230_7158.jpgFigure 1. Oral swab sample collection. A. Hand positioning when handling the mouse for sampling, opening its mouth without touching it. B. Swab placement in the oral cavity, sampling tongue and buccal surfaces.Place the swab in TE buffer and cut the swab handle with scissors, to allow for the tube to close, but not leaving it too short. Place the tube immediately on dry ice. Collect a negative control swab, by taking a swab and exposing it to the air and then placing it into a tube with TE buffer.After collecting all samples, store them at -80 °C until processing.Gingival tissue sample collectionNote: This procedure allows for evaluation of the oral microbiome at the gingiva and may be most useful in studies of periodontitis.",
    "Steps A2a-A2b as A1a-A1b.Euthanize a mouse according to ARAC guidelines.Note: For euthanasia, we expose the mice to CO2 in an appropriate chamber, following the guidelines established by the Institutional Animal Care and Use Committee, NIDCR/NIH.    Wipe gloved hands with a tissue wipe previously moistened with RNase AWAY reagent.   Perfuse the mouse and dissect tissues to expose the oral cavity (Figure 2A). These procedures are explained in detail in Dutzan et al. (2016).Using a #10 blade, dissect the palatal gingiva around the maxillary molars (Figure 2B). Remove gingival tissue with forceps and place it in a tube with TE buffer, which is directly transferred on dry ice. As a negative control, dip an unused pair of forceps in another tube with TE buffer.After collecting all samples, store them at -80 °C until processing. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214010419_1355.jpgFigure 2. Gingival tissue collection. A. Dissection of palatal gingival tissue around molar teeth from mouse maxilla. B. Enlarged view of the excised gingival tissue.DNA isolationClean work surface with 70% ethanol and then RNase AWAY reagent. UV-treat a plastic tube rack, pipettes, sterile forceps and spin baskets (consider one pair of forceps and one basket per sample).Thaw previously collected samples by placing the tubes at 37 °C for 10 min on a heated shaking block at moderate speed.Briefly, spin sample tubes and add 1 µl of ReadyLyse per tube. Incubate for 60 min on a heated shaking block (37 °C) at moderate speed.Briefly spin tubes before opening.Add 25 µl of Proteinase K and 200 µl of buffer AL (both from the DNeasy Blood and Tissue Kit).Mix by vortexing briefly.Incubate overnight at 56 °C on a heated shaking block at a moderate speed.Next day, briefly spin tubes before opening.If samples are gingival tissues, continue to Step B12.",
    "If samples were collected with swabs, pull up the swab by grabbing it from the upper end with a pair of forceps, place a spin basket into the tube and now leave the swab into the basket.Take the tube with the basket and swab on top and proceed to briefly spin, to drain any liquid on the swab. Discard basket and swab.Add 200 µl of ethanol and mix well by vortexing.Briefly spin tubes before opening.Pipet the mixture into DNeasy mini spin column that was previously placed in a 2 ml collection tube (from now on all reagents are provided in the DNeasy Blood and Tissue Kit). Centrifuge at ≥ 6,000 x g for 1 min. Discard flow-through and collection tube.Place column in a new collection tube and add 500 µl of Buffer AW1.Centrifuge at ≥ 6,000 x g for 1 min. Discard flow-through and collection tube.Place column in a new collection tube and add 500 µl of Buffer AW2.Centrifuge at 20,000 x g for 3 min to dry column membrane. Discard flow-through and collection tube.Make sure column is dry before proceeding to next step, if it became wet, repeat Step B19 using a new collection tube.Place column in a new 1.5 ml Safe-lock Biopur tube (not included in the kit) and pipet 53 µl of Buffer AE directly onto the center of the membrane.Incubate for 5 min at room temperature.Centrifuge at ≥ 6,000 x g for 1 min.Measure DNA concentration in Spectrophotometer (Nanodrop, ND-1000). 16S rRNA gene amplificationDNA concentration from oral murine samples (in health/steady state) is low, particularly when using the oral swab procedure (typically around 2-3 ng/µl of total DNA). Therefore, we modified our protocols for the subsequent PCR reactions adding 4 µl per reaction regardless of their DNA concentration.",
    "We also adjusted amplification conditions by increasing the number of PCR cycles (from 25 to 35) and decreasing the annealing temperature (from 52.5 °C to 50 °C). Importantly, our non-template controls and water alone did not amplify with this modified protocol. All PCR reactions per sample are performed in duplicate, then PCR products are pooled before purification.Clean work surface with 70% ethanol and then RNase AWAY reagent. Assemble master mix in a 2 ml LoBind tube, combine the required amounts of PCR water, dNTPs, MgSO4, Taq polymerase and buffer, according to the volume described below (per tube).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214013914_4982.jpgMix well by vortexing and add 13.6 µl of this mixture to each PCR tube.Add to each PCR tube the desired forward and reverse primer (both come with their own index sequence, for ‘dual indexing’).Add DNA template to each PCR tube.Place the tubes in a thermal cycler and run the following PCR conditions:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171214/20171214013957_2427.jpgMerge the duplicated PCR products from one sample in a DNA low-bind 1.5 ml tube. Then, run a 1.2% agarose gel using a 100 bp ladder, stain it with ethidium bromide or the DNA dye of your preference and visualize the PCR products in a gel imager. The expected amplicon size is ~528 bp.PCR product clean-up using the Agencourt AMPure XP systemClean work surface with 70% ethanol and then RNase AWAY reagent. Equilibrate AMPure XP Magnetic Particle Solution to room temperature (15-30 min).During that time prepare fresh 70% ethanol, aliquot the required amount of EB buffer (consider 40 µl per PCR product) and have ready a set of DNA low-bind 1.5 ml tubes.Measure the volume of each PCR product.Mix by vortexing the AMPure XP Magnetic Particle Solution, to re-suspend any magnetic particles that may have settled.",
    "According to the measured PCR product volume, add the appropriate amount of bead solution based on the following ratio (DNA:beads = 1:0.65).Vortex briefly and carefully, keeping the mixture in the bottom of the tubes. Incubate for 5 min at room temperature, for binding of DNA to beads.Place the tube onto a DynaMag-2 Magnet for 2 min or until beads separate from solution.While keeping the tubes in the magnet, carefully remove supernatant.Remove tubes from magnet and dispense 200 µl of 70% ethanol and pipet up and down to mix.Repeat Steps D8 and D9.Remove tubes from magnet and dispense 200 µl of 70% ethanol and pipet up and down to mix.Repeat Steps D8 and D9.While keeping the tubes in the magnet, open the tube lids and allow the beads to dry for approximately 5 min, making sure that the bead surface does not start to crack as this results in low DNA yield.Remove tubes from the magnet, add 40 µl of EB to each tube and mix well by pipetting.Place the tubes back in the magnet and wait for 2 min or until beads clearly separate from solution.Transfer ~35 µl of the supernatant to a new DNA low-bind 1.5 ml tube.PCR product quantification using the Qubit dsDNA HS Assay KitEquilibrate kit solutions to room temperature (15-30 min).Set up the required number of Qubit assay tubes for samples and standards (2 tubes for standards).Label the tube lids.Prepare working solution by diluting HS reagent 1:200 in HS buffer. Prepare the desired amount considering that each sample will require 198 µl and the standards 190 µl.Add 190 µl of working solution to the standard tubes and add 10 µl of each standard to the appropriate tube. Mix by vortexing 2-3 sec, avoiding bubble formation.",
    "Add 198 µl of working solution to the sample tubes and add 2 µl of each sample to the appropriate tube. Mix by vortexing 2-3 sec, avoiding bubble formation.Incubate for 2 min at room temperature in the dark.Calibrate Qubit Fluorometer with the standards and proceed to read samples.Note: It is important to mention that the Qubit dsDNA HS Assay Kit detection range goes from 0.5 to 100 ng/µl. Samples below that detection range can be quantified, but their concentration may not be accurate.PCR product quantification and visualization using the Experion DNA 1K KitWe perform this step to confirm the purity of the PCR products after cleaning procedures. The size of the target DNA should correspond to a single peak at 528 bp.Equilibrate kit reagents to room temperature (15-30 min).While waiting, make sure that the DNA concentration of the PCR products doesn’t exceed 50 ng/µl, if it is above this value dilute to 50 ng/µl. For our samples, DNA concentration is usually below this value.Vortex briefly and short spin all reagents.Prepare gel-stain solution (GS) by adding 12.5 µl of stain (ST) to gel tube (G).Vortex for 10 sec and transfer the GS solution to a spin-filter tube (provided in the kit).Centrifuge spin-filter tube at 2,400 x g for 15 min.Discard filter. Date the tube as this GS solution lasts for 1 month. This solution needs to be protected from light and stored at 4 °C.Prime the DNA chip by adding 9 µl of GS to priming well, then select C3 on priming station and press Start. Visually inspect for bubbles or incomplete priming.Pipet 9 µl of GS to other GS wells (3) in the DNA chip.Pipet 5 µl of loading buffer into L well and each sample well (11).Pipet 1 µl of DNA 1K ladder into well L.",
    "Pipet 1 µl of DNA into each sample well. Add 1 µl TE buffer or DNase-free water in wells that were not used.Place chip in the Experion vortex station and press mix.Run the chip in the Experion electrophoresis station.PCR product pooling and sequencingCalculate the concentration in nM of each purified PCR product. Consider the amplicon size (528 bp) from Experion analyses and DNA concentration obtained from the clean PCR product using the Qubit.Dilute each PCR product to 4 nM using EB buffer. It is very important that PCR product concentrations and dilutions are accurate in order to obtain approximately equal number of reads per sample.Add 5 µl of each diluted PCR product to a 2.0 ml DNA low-bind tube, so samples are pooled in equimolar amounts. Measure library DNA concentration using Qubit assay as described before. Store at 4 °C.Pooled PCR products are ready to be sequenced on a MiSeq Instrument using the PhiX Control libraries and the MiSeq Reagent Kit v3 from Illumina, following the manufacturer’s standardized sequencing protocols. Prepare MiSeq reagents according to MiSeq® Reagent Kit v3 Reagent Preparation Guide[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/system_documentation/miseq/miseq-reagent-kit-v3-reagent-prep-guide-15044983-b.pdf]. Considering DNA concentration measured in Step G4, proceed to denaturation and dilution steps described in MiSeq System Denature and Dilute Libraries Guide[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/system_documentation/miseq/miseq-denature-dilute-libraries-guide-15039740-01.pdf]. For our samples, we diluted the library to 9 pM and combined it with 20 pM PhiX in a ratio that allows us to obtain a spike of PhiX of 14%."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}