{
  "id": 19858,
  "origin_website": "Wiley",
  "title": "Detection and Quantitation of DNA Damage on a Genome-wide Scale Using RADAR-seq",
  "procedures": [
    "This protocol describes how to create a reference genome utilizing PacBio SMRT-sequencing. A reference genome is required to analyze RADAR-seq data. We demonstrate the protocol using E coli to generate a reference genome for use in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002]. The steps include growing and harvesting E. coli cells, extracting and shearing E. coli genomic DNA, constructing a large-insert PacBio library (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-fig-0002]), sequencing the library with PacBio SMRT sequencing, and utilizing PacBio software to assemble a complete genome. This protocol can be used to assemble any genome (e.g., T. kodakarensis for use in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0003]), provided the organism can be grown and genomic DNA can be extracted. Other DNA sequencing platforms such as Oxford Nanopore Technologies sequencing or Illumina sequencing (Minei, Hoshina, & Ogura, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0024]) can be utilized to create a reference genome; however, we use PacBio sequencing here because RADAR-seq utilizes PacBio sequencing for DNA damage detection.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b135f5b1-e4e7-4d11-855d-948e1663bbe9/cpz1595-fig-0002-m.jpg</p>\nFigure 2\nPacBio library construction. (A) Diagram of library construction. Extracted genomic DNA is sheared into 20-kb fragments (for genome assembly) or 2-kb fragments (for RADAR-seq). The fragments are DNA damage and end repaired, resulting in dA tails, and then PacBio SMRTbell adapters are ligated onto the fragments. (B) Agilent DNA TapeStation gel showing high-integrity extracted genomic DNA from E. coli (lane 2), E. coli genomic DNA sheared into 20-kb fragments using a Megaruptor for genome assembly to construct a reference genome (lane 3), and E. coli genomic DNA sheared into 2-kb fragments using Covaris sonication for RADAR-seq (lane 4). A DNA ladder is shown in lane 1.\nMaterials\nE. coli MG1655 (E. coli Genetic Stock Center, cat. no. 6300))\nLB agar plate (Sigma-Aldrich, cat. no. L5542)\nLB medium (Sigma-Aldrich, cat. no. L3522)\nMonarch Genomic DNA Extraction Kit (New England Biolabs, cat. no. T3010)",
    "Qubit dsDNA Broad Range (BR) and High Sensitivity (HS) Assay Kits (Thermo Fisher Scientific, cat. nos. Q32850 and Q33230)\nGenomic DNA Reagents (Agilent Technologies, cat. no. 5067-5366)\nTE light buffer (see recipe)\nAMPure PB beads (Pacific Biosciences, cat. no. 100-265-900)\n80% (v/v) ethanol (Sigma-Aldrich, E7023) in water, freshly prepared\nSMRTbell Express Template Kit 2.0 (Pacific Biosciences, cat. no. 100-938-900)\nSequel Binding Kit 3.0 (Pacific Biosciences, 101-626-600)\nSequel Sequencing Kit 3.0 (Pacific Biosciences, cat. no. 101-597-900)\nSequel SMRT Cell oil (Pacific Biosciences, cat. no. 100-621-300)\nSMRT Cells (1M v3 LR Tray, Pacific Biosciences, cat. no. 101-531-001)\nLiquid nitrogen\n37°C incubator\n37°C incubator shaker\n18-ml culture tubes (VWR, cat. no. 47729-578)\n15-ml conical tubes (VWR, cat. no. 89401-566)\nQubit Fluorometer and assay tubes (Thermo Fisher Scientific, cat. nos. Q33238 and Q32856)\nAgilent 4150 or 4200 TapeStation (Agilent Technologies, cat. no. G2992AA or G2991BA)\nGenomic DNA ScreenTape (Agilent Technologies, cat. no. 5067-5365)\n1.5-ml DNA LoBind tubes (Eppendorf, cat. no. 022431021)\nHydro Tube (Diagenode, C30010018)\nMegaruptor 2.0 (Diagenode, B06010002)\nLong Hydropores (Diagenode, E07010002)\nMagnetic rack (Thermo Fisher Scientific, cat. no. 12321-D)\n37°C heating block (VWR, cat. no. 75838-278)\n0.2-ml PCR tubes\nThermal cycler\nSample plate for PacBio sequencing (Pacific Biosciences, cat. no. 000-448-888)\nPlate sealer (Thermo Scientific, cat. no. AB-1443A)\nSequel sample plate foils (Pacific Biosciences, cat. no. 100-667-700)\nPacific Biosciences Sequel Instrument (Pacific Biosciences)\nTube septa (Pacific Biosciences, cat. no. 100-667-700)\nSequel Mixing Plate (Pacific Biosciences, cat. no. 100-667-500)\nSequel Pipet Tips v2 (Pacific Biosciences, cat. no. 100-667-601)\nGrow E. coli and prepare genomic DNA\n1. Streak MG1655 E. coli on an LB agar plate for single colonies. Incubate overnight in a 37°C incubator.\n2. Pick a single colony and inoculate 10 ml LB medium in a test tube. Incubate overnight in a 37°C incubator shaker at 250 rpm.",
    "3. Transfer the 10-ml culture to a 15-ml conical tube and centrifuge 20 min at 2000 × g, 4°C.\n4. Pour off the supernatant and extract genomic DNA using the Monarch Genomic DNA Extraction Kit according to manufacturer's instructions.\nAlternative genomic DNA extraction kits (e.g., Zymo Quick-DNA Microprep kit or Qiagen QIAamp DNA kit) can be utilized provided they produce high-molecular-weight genomic DNA\n5. Quantitate extracted genomic DNA using a Qubit fluorometer with Broad Range Qubit reagents.\nThe typical yield from 10 ml culture is 6-10 µg DNA.\n6. Assess the quality of the genomic DNA using an Agilent TapeStation, Genomic ScreenTape, and Genomic DNA Reagents (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-fig-0002]).\nIt is important that the extracted genomic DNA be of high molecular weight. If the genomic DNA is highly fragmented (fragments <20 kb), begin again and take care not to vortex or heat the DNA.\n7. Add 3 μg genomic DNA to 200 μl TE light buffer in a 1.5-ml DNA LoBind tube.\nDNA LoBind tubes are important during PacBio library preparation to minimize nonspecific binding of the DNA to the tube and maximize library yield.\n8. Transfer to a Hydro Tube and then shear the genomic DNA to 20-kb fragments using a long Hydropore and Megaruptor 2.0 according to manufacturer's instructions (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-fig-0002]).\nA Hydro Tube is required for shearing using the Megaruptor.\n9. Transfer sheared genomic DNA to a 1.5-ml DNA LoBind tube.\n10. Isolate the 20-kb fragments by adding 90 μl (0.45× volume) of AMPure PB beads and placing on the benchtop for 5 min.\n11. Place the tube on a magnetic rack, allow solution to clear, and then pipette off the supernatant and save in a new DNA LoBind tube.",
    "At this point, genomic DNA should remain bound to the beads, but it is beneficial to save the supernatant in case the DNA did not bind to the beads properly. To minimize sample loss, it is important to pipette the supernatant after all visible beads are stuck to the magnet.\n12. With the tube still on the magnetic rack, wash the beads twice by adding 1 ml freshly prepared 80% (v/v) ethanol and then removing it.\n13. Remove tube from the magnetic rack and centrifuge for 5 s using a minicentrifuge.\n14. Return tube to the magnetic rack and pipette off any residual ethanol.\n15. Remove tube from the magnetic rack and place on the benchtop with the cap open for 1 min to dry off any remaining ethanol.\n16. Elute genomic DNA from the beads by adding 46 μl TE light buffer and heating for 15 min in a 37°C heat block.\n17. Place tube on the magnetic rack, allow solution to clear, and pipette the supernatant to a new 1.5-ml DNA LoBind tube. Discard the tube containing beads.\nThe extracted genomic DNA can be stored up to 2 years at −20°C.\nConstruct PacBio library\nThe following steps require the PacBio SMRTbell Express Template Kit 2.0, which contains the necessary reagents to construct PacBio libraries, including end repair and adapter ligation reagents. This protocol is adopted from PacBio's “Procedure and Checklist – Preparing gDNA Libraries Using the SMRTbell Express Template Preparation Kit 2.0” (https://www.pacb.com/wp-content/uploads/Procedure-Checklist-Preparing-gDNA-Libraries-Using-the-SMRTbell-Express-Template-Preparation-Kit-2.0.pdf[href=https://www.pacb.com/wp-content/uploads/Procedure-Checklist-Preparing-gDNA-Libraries-Using-the-SMRTbell-Express-Template-Preparation-Kit-2.0.pdf]).\n18. Make a 1:5 dilution of DNA Prep Additive by adding 1 μl to 4 μl DNA Enzyme Dilution Buffer in a 1.5-ml DNA LoBind tube.\n19. Prepare a single-stranded digestion removal reaction in a 0.2-ml PCR tube as follows:\n         \n46 μl 20-kb genomic DNA (step 17)\n7 μl DNA Prep Buffer\n1 μl NAD+",
    "1 μl diluted DNA Prep Additive (step 18)\n1 μl DNA Prep Enzyme\n20. Mix gently by pipetting and place in a thermal cycler for 15 min at 37°C.\nThis step removes any large single-stranded 3′ overhangs from the 20-kb fragments.\n21. Place on ice. Add 2 μl DNA Damage Repair Mix v2, mix gently by pipetting, and place in a thermal cycler for 30 min at 37°C.\nThis step repairs DNA damage from the sheared genomic DNA, including nicks, gaps, AP sites, oxidative, UV, and deaminated bases.\n22. Place on ice. Add 3 μl End Prep Mix, mix gently by pipetting, and incubate in a thermal cycler for 10 min at 20°C, followed 30 min at 65°C.\nThis step creates DNA fragments with 5′ phosphates and 3′-dA tails required for ligation of SMRTbell sequencing adapters the next step.\n23. Place on ice.\n24. Prepare the PacBio SMRTbell adapter ligation reaction in a 0.2-ml PCR tube as follows:\n         \n5 μl Overhang Adapter v3\n61 μl dA-tailed DNA fragments (step 22)\n1 μl Ligation Additive\n1 μl Ligation Enhancer\n30 μl Ligation Mix\nThis step ligates the SMRTbell adapters required for PacBio sequencing.\n25. Incubate in a thermal cycler for 1 hr at 20°C.\n26. Isolate the DNA library as in steps 10-15, but use 44 μl AMPure beads.\n27. Elute the library from the beads as in steps 16-17, but use 11 μl TE light buffer.\n28. Quantitate the DNA library as in step 5.\nA typical library yield for 3 µg genomic DNA input is 1000 ng (or 10 μl at 100 ng/μl).\n29. Prepare 10 μl of sample at 20 ng/μl in a new DNA LoBind tube by diluting with TE light buffer.",
    "For example, if the library is 100 ng/μl, mix 2 μl library with 8 μl TE light to obtain 10 μl at 20 ng/μl.\nThe completed PacBio library can be stored for ∼6 months at –20°C.\nPerform sequencing and assemble reference genome\nThe next steps require access to the Pacific Biosciences SMRTlink Web portal. This site is used to determine sequencing conditions, enter sequencing run parameters, initiate post-sequencing analyses (such as genome assembly), and perform data management. The steps below describe (1) “Sample Set-up”, to determine primer and sequencing polymerase binding steps, (2) “Run Design”, to enter sequencing run parameters, and (3) “SMRT Analysis”, to assemble the sequencing reads into a reference genome.\n30. Go to the SMRTlink 8.0 website.\nThe SMRTlink address will be specific to the user's PacBio sequencing facility.\n31. Click on “Sample Set-Up” and then on “New Calculation”, taking care to ensure that “Sequel” is selected as the desired sequencing instrument.\n32. Enter the following parameters into the “New Calculation” worksheet:\n         \ntable:\n﻿0,1\nSample Comment,E.coli Genome Assembly (or desired sample name)\nApplication,Microbial Assembly\nAvailable Volume,10\nSample Concentration (ng/μl),20\nInsert Size (bp),20000\nInternal Control,\nCleanup Anticipated Yield,50%\nSpecify Concentration on Plate,10 pM\nCells to Bind,1\nSequencing Primer,Sequencing Primer v4\nBinding Kit,Sequel Binding Kit 3.0\nOnce the parameters have been input, the software will provide directions for primer and polymerase binding.\n33. Dilute 1 μl Sequencing Primer v4 in 29 μl of 1× Elution Buffer in a 0.2-ml PCR tube. Condition the sequencing primer by heating in a thermal cycler for 2 min at 80°C, followed by a hold at 4°C.\nThe reagents for steps 33-46 are found in the SMRTbell Express Template Kit 2.0 and Sequel Binding Kit 3.0.",
    "34. Bind the sequencing primer to the SMRTbell adapters by combining the following in a PCR tube and incubating for 60 min at room temperature:\n         \n1.7 μl 10× Primer Buffer\n5.4 μl genomic DNA library (step 29)\n1 μl conditioned sequencing primer (step 33)\n35. Dilute 1 μl Sequel Polymerase with 9 μl Sequel Binding Buffer in a PCR tube.\n36. Perform a second dilution by mixing 1 μl diluted polymerase with 1 μl Sequel Binding Buffer another PCR tube.\n37. In a new PCR tube, combine the following reagents and mix by pipetting:\n         \n2.1 μl Sequel Binding Buffer\n1.7 μl ddH2O\n1.5 μl DTT\n1.5 μl Sequel dNTPs\n7.4 μl primer-bound DNA library (step 34)\n1 μl diluted Sequel polymerase (step 36)\n38. Incubate in a thermal cycler for 240 min at 30°C to bind the polymerase to the primer-bound DNA libraries.\n39. Add 84.8 μl Complex Dilution buffer to the tube and transfer mixture to a 1.5-ml DNA LoBind tube.\n40. Add 120 μl AMPure beads and place on the benchtop for 5 min.\n41. Place on the magnetic rack, allow solution to clear, and remove the supernatant.\n42. Immediately add 25 μl Complex Dilution buffer and incubate on the benchtop for 15 min.\n43. Place on the magnetic rack, allow to clear, and pipette the supernatant to a new DNA LoBind tube. Discard the tube containing beads.\n44. Quantitate the primer/polymerase-bound library on a Qubit fluorometer using the Qubit dsDNA HS Kit.\n45. Input the volume (49 μl) and the concentration (step 44) into the “New Calculations” worksheet from step 31.\nOnce this is done, directions for “Final Loading Dilution” will be populated.\n46. Using the directions provided in step 45, make the final loading dilution in a new 1.5-ml DNA LoBind tube.",
    "For example, if the volume was 49 μl and the concentration was 0.5 ng/μl, you would be instructed to combine 53.4 μl Sequel Complex Dilution Buffer, 22.1 μl prepared sample (step 43), 8.5 μl DTT, and 1.0 μl Sequel Additive.\n47. Place a Sequel sample plate on ice and pipette the sample (step 46) to well A1 of the sample plate.\n48. Remove the Sequel sequencing kit from the freezer and place on the benchtop to thaw (∼1 hr).\n49. Turn on the plate sealer and allow to come to temperature (∼15 min).\n50. Seal the plate (step 47) using the plate sealer and Sequel sample plate foil.\n51. On the SMRTlink Web portal, click on “Run Design” then “Create New Design”, ensuring that the Sequel instrument is selected.\n52. On the left-hand side, input the Run Name (e.g., “Ecoli Genome Assembly-DDMMYYYY”).\n53. Under sample information, input the following parameters, then hit “Save”: \n         \ntable:\n﻿0,1\nApplication,Microbial Assembly\nWell Sample Name,Ecoli Genome Assembly (or desired ID)\nSample Well,A01\nTemplate Prep Kit,SMRTbell Express Template Prep Kit 2.0\nBinding Kit,Sequel Binding Kit 3.0\nSequencing Kit,Sequel Sequencing Plate 3.0 (4rxn)\nDNA Control Complex:,Leave blank\nInsert Size (bp),20000\nOn-plate Loading Concentration,10 pM\nMovie Time per SMRT-cell,20 hr\nUse Pre-extension,Yes\nPre-Extension Time,2 hr\n54. At the PacBio Sequel instrument, click “Select Existing Run”, then select the run name designated above (“Ecoli Genome Assembly-DDMMYYYY”) and click “Continue”.\n55. Remove cap from the Sequel sequencing oil tube and place a tube septum onto the tube.\n56. Unlock the instrument door by selecting the “Locked” button in the bottom right-hand corner of the Sequel screen, then pull open the instrument door.\n57. Load the following into the Sequel Instrument:\n         \nsample plate (step 50)\nmixing plate\nsequencing oil (step 55)\nsequencing reagent plate (step 48)\nSequel SMRT Cells",
    "three boxes of sequencing pipettes\n58. Click “Load” on the Sequel screen, followed by “Scan”, and “Empty”. Ensure the Sequel trashcan (in the black bucket in the instrument) is empty. If it is not, empty contents into a sharps bucket and place back in the instrument.\n59. Ensure that there is an appropriate amount of liquid nitrogen to run the instrument. Once confirmed, click the “Check Nitrogen” button.\nThe Sequel instrument requires liquid nitrogen to prevent oxygen-induced DNA damage. For a large liquid nitrogen dewar, >30% liquid nitrogen is sufficient.\n60. Click “Start” at the top right portion of the screen to initiate the sequencing run.\nA 20-hr sequencing run takes ∼24.5 hr from start to finish due to instrument warm-up and downtime.\n61. Once the run is done, go to the SMRTlink Web portal and click “SMRT Analysis” and “Create New Analysis”.\n62. Input the following:\n         \ntable:\n﻿0,1\nAnalysis Name,“Ecoli Genome Assembly”\nData Type,“Continuous Long Reads”\nSequencing Data Set,“Ecoli Genome Assembly-DDMMYYYY”\n63. Click “Next” and then set the following:\n         \ntable:\n﻿0,1\nAnalysis Application,“Microbial Assembly”\nGenome Length,4700000\n64. Click “Start” to initiate assembly of the E. coli genome.\n65. Once the assembly is finished, download the assembled genome by going to ‘“SMRT Analysis” in the SMRTlink Web portal, clicking on “Ecoli Genome Assembly”, “Data”, and “Final Polished Assembly”.\nA single polished contig will be obtained in FASTA format.",
    "Here, the user will use RADAR-seq to locate and quantitate thymine dimers in bacteria (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-fig-0003]). To exemplify the approach, MG1655 E. coli cells are exposed to varying levels of UV radiation and then RADAR-seq DNA libraries are constructed to allow detection and quantitation of thymine dimer formation catalyzed by UV radiation on a genome-wide scale. First, E. coli cells are grown and then exposed to varying levels of UV radiation. Second, genomic DNA is extracted, sheared, and used to construct PacBio libraries. Third, in vitro BER steps are performed to convert thymine dimers into patches of modified nucleotides. Finally, libraries are sequenced by PacBio SMRT sequencing and downstream patch detection analysis is carried out to quantitate and map modified patch sites, where each patch corresponds to a single thymine dimer lesion. Once completed, the user will have quantitated the number of thymine dimers detected per million bases sequenced and know the genomic location of each thymine dimer. Here, we utilize RADAR-seq to quantitate thymine dimers in E. coli genomic DNA, but the same protocol can be followed for any tissue or organism that can be exposed to UV radiation in a controlled environment and from which high-quality genomic DNA can be extracted. The steps outlined are for one experimental replicate, but a total of three experimental replicates should be performed to measure variability.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d8211929-6e19-44b5-8818-7bde22964ca0/cpz1595-fig-0003-m.jpg</p>\nFigure 3",
    "Genome-wide thymine dimer detection using RADAR-seq. (A) Thymine dimers in PacBio libraries (created from genomic DNA purified from E. coli exposed to UV radiation) were replaced with a patch of methylated nucleotides using (1) T4 pyrimidine dimer glycosylase (PDG) to remove the thymine dimer lesion, (2) Tth endonuclease IV to nick the DNA backbone, (3) gap repair using full-length Bst DNA polymerase together with methylated dNTP (mdNTP), and (4) gap closure by ligation using Taq DNA ligase and NAD+, as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002]. (B) Bar graph displaying the average number of thymine dimers detected (per million bases sequenced) by RADAR-seq in E.coli cells exposed to UV light (254 nm). Error bars indicate standard deviation for at least three biological replicates. (C,D) Location of thymine dimers on a genome-wide scale for no UV exposure or UV exposure at 200 J/m2. Circular plots were generated using Circos software (Krzywinski et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0021]). Red and blue line plots correspond to frequency of observed patches (per million bases sequenced) on the top and bottom strand, respectively. Frequency of patches was computed using a rolling average with a 10-kb window size. Figure adapted from Zatopek et al. (2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0030]).\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001])\n5× M9 minimal-salts bacterial growth medium (Sigma-Aldrich, cat. no. M6030)\nPreCR Enzyme Mix lacking T4 PDG (available upon request from New England Biolabs)\nPacBio Barcoded Adapters (Pacific Biosciences, cat. no. 101-628-400, 101-628-500, or 102-009-200)\n10× rCutSmart Buffer (New England Biolabs, cat. no. B6004)\nExonucleases III and VII (New England Biolabs, cat. nos. M0206 and M0379)\n10× ThermoPol Buffer (New England Biolabs, cat. no. B9004)\n1 mM methylated dNTP mix (see recipe)\n50 mM NAD+ (New England Biolabs, cat. no. B9007)\nT4 pyrimidine dimer glycosylase (PDG, New England Biolabs, cat. no. M0308)",
    "Tth Endonuclease IV (New England Biolabs, cat. no. M0294)\nBst DNA polymerase, full length (New England Biolabs, cat. no. M0328)\nTaq DNA ligase (New England Biolabs, cat. no. M0208)\nE. coli reference genome (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001])\n500-ml Erlenmeyer flask (VWR, cat. no. 10536-926)\n250-ml centrifuge bottle (VWR, cat. no. 47735-688)\n150 × 15–mm Petri dishes (Fisher Scientific, cat. no. FB0875714)\nSpectrolinker X-1000 (Spectro-UV)\n50-ml conical tubes (VWR, cat. no. 89401-562)\nCovaris miniTUBEs, clear (Covaris, cat. no. 520064)\nCovaris ME220 Focused-ultrasonicator (Covaris, cat. no. 500506)\nTools and scripts for data analysis (available at https://github.com/potapovneb/CP-RADAR-seq;10.5281/zenodo.6914938[href=https://github.com/potapovneb/CP-RADAR-seq;10.5281/zenodo.6914938])\nGrow E. coli and expose to UV\n1. Streak MG1655 E. coli on an LB agar plate for single colonies. Incubate overnight in a 37°C incubator.\n2. Pick a single colony and inoculate 250 ml LB medium in a 500-ml Erlenmeyer flask. Incubate overnight in a 37°C incubator shaker at 250 rpm until an OD600 of 0.8 is reached.\n3. Transfer culture to a 250-ml centrifuge bottle and pellet cells by centrifuging 20 min at 10,000 × g, 4°C.\n4. Pour off the supernatant and resuspend cell pellet in 250 ml of 1× M9 minimal medium.\nM9 minimal medium is sold as a 5× solution and should be diluted to 1× using ddH2O in a sterile bottle.\n5. Pipette 15 ml resuspended E. coli onto an empty 150 × 15–mm Petri dish.\n6. Place the dish in a Spectrolinker XL-1000 and expose cells to 10 J/m2 UV radiation at 254 nm.\nChoose the “Energy” option on the Spectrolinker XL-1000 keypad. The units on the instrument are in ×100 μJ/cm2. Therefore, to deliver 10 J/m2 UV radiation, type “10” on the keypad followed by “Enter”.\n7. Pipette the 15-ml cell suspension into a 50-ml conical tube and place on ice.",
    "8. Repeat steps 5-7 on four additional 15-ml aliquots of culture, exposing them to increasing levels of radiation at 25, 50, 100, and 200 J/m2.\nUse a new Petri dish and serological pipette for each sample.\n9. Remove another 15-ml aliquot of culture and place in a 50-ml conical tube on ice to serve as the no-exposure control.\nThere are now six 15-ml aliquots of cells on ice ranging from 0 to 200 J/m2 exposure.\n10. Pellet all samples by centrifuging 20 min at 2000 × g, 4°C.\n11. Remove M9 medium supernatant from each tube and discard.\n12. Proceed immediately to genomic DNA extraction or store samples in a –20°C freezer until use.\nCells can be stored for up to 6 months at −20°C\nExtract and shear genomic DNA\n13. Extract, quantitate, and assess the integrity of genomic DNA from UV-irradiated cells as described (see Basic Protocol 4-6).\nThe typical yield from each 15-ml aliquot of cells is 6-8 µg genomic DNA.\n14. Add 2 µg genomic DNA to 200 μl TE light buffer and pipette into clear Covaris miniTUBEs.\nTake care to avoid air bubbles at the bottom of the Covaris tube, as the presence of air bubbles can negatively affect DNA shearing.\n15. Shear genomic DNA into 2-kb fragments using the Covaris ME220 Focused-ultrasonicator with the following settings:\n         \ntable:\n﻿0,1\nTreatment,900.0 s\nPeak Power,10.0\nDuty Factor,20.0%\nCycles Burst,1000\nAverage Power 2.0,\nDo not shear genomic DNA in water, as this facilitates oxidative DNA damage (Chen, Liu, Evans, & Ettwiller, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0003]).\n16. Pipette sheared genomic DNA into a 1.5-ml DNA LoBind tube. Then, centrifuge the miniTUBE for 20 s in a minicentrifuge to remove additional sample.\nIt is rare to recover the full 200 μl from the Covaris miniTUBE.",
    "17. Isolate the 2-kb DNA fragments as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 10-17), but use 0.6× volume of AMPure beads in step 10, and use 47 μl TE light buffer to elute the DNA in step 16.\nFor example, 200 μl sample × 0.6 = 120 μl AMPure beads.\n18. Quantitate the genomic DNA and confirm that the DNA is sheared into 2-kb fragments (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 5-6; Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-fig-0002]).\nConstruct PacBio libraries\n19. Construct PacBio libraries from all DNA samples as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 18-25) with the following modifications:\n         \na.During DNA repair (step 21), use 2 μl PreCR lacking T4 PDG in place of DNA Damage Repair Mix v2.\nb.During DNA ligation (step 24), use 5 μl PacBio Barcoded Adapter instead of Overhang Adapter v3.0.\nIn this way, each sample (i.e., DNA from each UV exposure level) gets a unique SMRTbell barcoded adapter that allows for sample pooling during PacBio sequencing.\n20. Isolate libraries as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 10-17), but use 59 μl AMPure beads in each tube, and use 44 μl TE light buffer to elute the DNA.\n21. Add 5 μl of 10× rCutSmart Buffer to each tube, followed by 0.5 μl Exonuclease III and 0.5 μl Exonuclease VII. Mix by pipetting and incubate 30 min at 37°C.\n22. Place on ice and remove the exonucleases by repeating the AMPure cleanup using 30 μl beads per tube and 21 μl TE light buffer for elution.\n23. Quantitate each library as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], step 5).\nStarting with 2 µg genomic DNA, a typical library yield is ∼500 ng DNA.\n24. Proceed immediately to the next step to avoid introduction of nicks into the genomic DNA.",
    "These nicks can arise spontaneously or as a result of freeze-thaw cycles.\nPerform RADAR-seq BER for thymine dimer replacement\n25. Bring 500 ng of each library to a final volume of 20 μl using dH2O.\n26. To nick the DNA at thymine dimer sites, combine the following in a PCR tube for each library:\n         \n20 μl DNA library\n5 μl 10× ThermoPol Buffer\n5 μl methylated dNTP mix\n1 μl 50 mM NAD+\n16.5 μl ddH2O\n1 μl T4 PDG\n27. Mix well by pipetting and incubate 1 hr at 37°C.\n28. While the nicking reactions are incubating, prepare the following master enzyme mix and mix well by pipetting:\n         \n3 μl Tth Endonuclease IV\n3 μl full-length Bst DNA polymerase\n6 μl Taq DNA ligase\n29. When the incubation is complete, add 1.5 μl enzyme mix (step 28) to each nicked sample, mix well by pipetting, and incubate 25 min at 55°C.\nIn this step, a patch of methylated bases is incorporated and ligated into each DNA library, replacing the excised thymine dimers.\n30. Place reactions on ice and isolate libraries as described, using 30 μl AMPure beads and 44 μl TE light buffer to elute the DNA.\n31. Treat with exonucleases as described in steps 21-23, but use 11 μl TE light buffer to elute the library from the beads.\nSamples are now ready for PacBio SMRT sequencing. Ideally, samples will be >10 ng/μl, but samples as low at 3 ng/μl can be sequenced. If a large sample loss occurs during RADAR-seq BER and DNA is not recovered, see Troubleshooting.\nRADAR-seq libraries can be stored for up to 6 months at −20°C.\nPool samples and perform setup and sequencing",
    "The next steps describe how to pool samples for PacBio sequencing and then modify the sequencing protocol from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001] (steps 30-60) for this protocol. The six libraries are pooled into two samples to limit the sequencing cost. For more information on pooling of samples, see Strategic Planning.\n32. Pool the libraries into two samples, each containing three libraries, with a final volume of 1-15 μl and a pool concentration of 5-20 ng/μl.\nFor example, if the libraries are each at 10 ng/μl, combine 4 μl each from the 0, 10, and 25 J/m2 samples to make pool 1, and combine 4 μl each from the 50, 100, 200 J/m2 samples to make pool 2. This will give two 12-μl pools at 10 ng/μl. The actual pooling will vary depending on the library concentrations determined in step 31.\n33. Perform “Sample Set-Up” calculation for both library pools as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 30-32), but enter the following parameters into the “New Calculation” worksheet:\n         \ntable:\n﻿0,1\nSample Comment,UV DNA Pool 1\nApplication,Continuous Long Reads\nAvailable Volume (μl),12 (may differ based on pool created)\nSample Concentration (ng/μl),10 (may differ based on pool created)\nInsert Size (bp),2000\nInternal Control,\nCleanup Anticipated Yield,50%\nSpecify Concentration on Plate,10 pM\nCells to Bind,1\nSequencing Primer,Sequencing Primer v4\nBinding Kit,Sequel Binding Kit 3.0\nIt is critical to use these parameters and not those in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], as the directions provided from this calculation will differ from the previous calculation.\n34. Proceed with sample preparation for both pools (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 33-50) using the directions provided by the Sample Set-Up calculator (step 33 above) to bind the PacBio sequencing primer and polymerase.",
    "The first UV DNA pool will go into well A1 of the sample plate and the second pool will go into well B1.\n35. Perform “Run Design” and input sample information for the first pool as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 51-53) with the following information:\n         \nUse the Run Name “Ecoli UV RADAR -DDMMYYY” in step 52.\nUse the following parameters in step 53:\ntable:\n﻿0,1\nApplication,Continuous Long Reads\nWell Sample Name,UV DNA Pool 1\nSample Well,A01\nTemplate Prep Kit,SMRTbell Express Template Prep Kit 2.0\nBinding Kit,Sequel Binding Kit 3.0\nSequencing Kit,Sequel Sequencing Plate 3.0 (4rxn)\nDNA Control Complex,Leave blank\nInsert Size (bp),2000\nOn-plate Loading Concentration,10 pM\nMovie Time per SMRT-cell,20 hr\nUse Pre-extension,Yes\nPre-Extension Time,1 hr\nBarcoded Sample Options,Yes (from pop-up input barcodes)\n36. Click “Add Sample” and then input information for UV DNA Pool 2. Save the run information.\n37. Sequence the libraries (see Basic Protocol 1, steps 54-60), making sure to choose “Ecoli UV RADAR -DDMMYYYY” as the run name in step 54.\nPerform patch detection analysis\nFollowing sequencing, the sequencing data and the following set of scripts are used to extract \"patches\" of modified bases from each DNA library. Details regarding the initial methodology of patch detection can be found in Zatopek et al. (2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0030]). A detailed description of the RADAR-seq computational workflow, with all necessary custom processing scripts, is available on GitHub at https://github.com/potapovneb/CP-RADAR-seq;10.5281/zenodo.6914938[href=https://github.com/potapovneb/CP-RADAR-seq;10.5281/zenodo.6914938]. Below, we provide a summary of the steps involved and advise users to follow the workflow on GitHub.\n38. Demultiplex the DNA pools to create individual BAM subreads for each DNA library.\nThis produces a PacBio BAM subreads file containing sequencing reads for a given barcode.\n39. Align sequencing reads to the E. coli reference genome using the PacBio pbmm2 tool.\nThis produces a BAM file with aligned sequencing reads.",
    "40. Perform single modification detection analysis on the aligned reads using the PacBio ipdSummary tool and the custom scripts.\nThis produces a set of single-molecule PacBio CSV modification detection files organized into a set of directories. To speed up computations, sets of non-overlapping single molecules are processed together.\n41. Process the modification detection files using custom scripts to identify stretches of modified bases (patches) in the sequencing data.\nThis produces a table providing the genomic strand, the start and stop locations of the detected patch, and the DNA sequence of the detected patch. An example RADAR-seq output table ‘radarseq_patches.csv’ is available on Zenodo in the ‘example/’ folder.",
    "Here, wildtype and a ribonucleotide excision repair (ΔRNaseH2) mutant of the archaeon T. kodakarensis are grown and then RADAR-seq DNA libraries are prepared to detect and quantitate ribonucleotides embedded in their genomic DNA on a genome-wide scale (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-fig-0004]). During DNA replication, a DNA polymerase must choose the correct dNTP over the corresponding rNTP. Because the intracellular concentration of rNTPs is typically orders of magnitude higher than dNTPs (McElhinny et al., 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0023]), DNA polymerases often spuriously incorporate rNTPs, and their persistence in the genome leads to genome instability (Joyce, 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0016]). Importantly, enzymes such as RNaseH1 and RNaseH2 initiate the ribonucleotide excision repair (RER) pathway to remove rNTPs from the genome (Kochiwa, Tomita, & Kanai, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0019]; Kellner & Luke, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0017]). To understand the contribution of RNaseH2 to ribonucleotide repair in T. kodakarensis, RADAR-seq is used here to locate and quantitate rNTPs in wildtype and ΔRNaseH2 strains. First, the ΔRNaseH2 strain must be created by the user. This is detailed in Gehring et al. (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0010]) and is not included in the steps below. Next, wildtype and ΔRNaseH2 T. kodakarensis are grown and genomic DNA is extracted from both strains. PacBio libraries are then constructed and in vitro BER steps are performed to convert rNTPs into patches of modified nucleotides. Finally, the libraries are then sequenced by PacBio SMRT sequencing, and downstream analysis is performed on the sequencing output to detect patches of modified bases. Once completed, the user will have quantitated the number of rNTPs detected per million bases sequenced and know the genomic location of each rNTP. Here, we utilize RADAR-seq to quantitate rNTPs in T. kodakarensis genomic DNA, but the same protocol can be followed for any organism in which genetics are available for strain construction and high-quality genomic DNA can be extracted.",
    "The steps outlined are for one experimental replicate, but a total of three experimental replicates should be performed to measure variability.",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/570f7a42-b9f6-4943-811e-ef60b07fd0ae/cpz1595-fig-0004-m.jpg</p>\nFigure 4\nGenome-wide ribonucleotide detection using RADAR-seq. (A) Ribonucleotides (rN) in PacBio libraries created using genomic DNA from WT and ΔRNaseH2 T. kodakarensis were replaced with a patch of methylated nucleotides using RNaseH2 to nick at the ribonucleotide sites. This was followed by gap repair using full-length Bst DNA polymerase and methylated dNTPs to incorporate methylated bases at each nick site, and gap closure by ligation using Taq DNA ligase and NAD+, as described in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0003]. (B) Bar graph displaying the average number of ribonucleotides detected by RADAR-seq per million bases sequenced. Error bars represent standard deviation for three biological replicates. (C,D) Frequency of ribonucleotides is visualized on a genome-wide scale for wildtype and ΔRNaseH2 T. kodakarensis. Circular plots were generated using Circos software (Krzywinski et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0021]). Red and blue line plots correspond to frequency of observed patches (per million bases sequenced) on the top and bottom strand, respectively. Frequency of patches was computed using a rolling average with a 10-kb window size.\nAdditional Materials (also see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002])\nWildtype T. kodakarensis (ATCC, cat. no. BAA-918)\nΔRNaseH2 T. kodakarensis (Gehring et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0010])\nWildtype and ΔRNaseH2 T. kodakarensis reference genomes (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001])\nRNaseH2 (New England Biolabs, cat. no. M0288)\nGrow cells, extract genomic DNA, and construct libraries\n1. Grow the wildtype and ΔRNaseH2 T. kodakarensis strains as described in Gehring et al. (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-bib-0010]).\n2. Extract genomic DNA from both cultures using the NEB Monarch Genomic DNA extraction kit according to the manufacturer's instructions for Gram-negative bacteria.\n3. Shear genomic DNA into 2-kb fragments as described (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002], steps 14-18).\n4. Construct PacBio libraries as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 18-25), but use 5 μl PacBio Barcoded Adapter instead of Overhang Adapter v3.0 in step 24.",
    "In this way, the two samples will have unique SMRTbell barcoded adapters to allow for sample pooling during sequencing.\n5. Remove any unligated/nick-containing PacBio fragments from the libraries as described (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002], steps 20-24).\nPerform RADAR-seq BER for ribonucleotide replacement\n6. Bring 500 ng of each library to a volume of 20 μl using ddH2O.\n7. To replace ribonucleotides with a patch of modified nucleotides, combine the following in a PCR tube:\n         \n20 μl DNA library\n5 μl 10× ThermoPol Buffer\n5 μl methylated dNTP mix\n1 μl 50 mM NAD+\n16.5 μl ddH2O\n8. Prepare the following enzyme master mix and mix well by pipetting:\n         \n2 μl RNaseH2\n1 μl full-length Bst DNA polymerase\n2 μl Taq DNA ligase\n9. Add 2.5 μl enzyme mix to each reaction in step 7, mix well by pipetting, and incubate 5 min at 37°C, followed by 25 min at 55°C.\nIn this step, ribonucleotides are replaced with a patch of methylated bases that are then ligated into the DNA fragments.\n10. Clean up libraries as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 10-17), but use 30 μl AMPure beads in step 10 and use 44 μl TE light buffer to elute the libraries in step 16.\n11. Treat with exonucleases as described (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002], steps 21-22), but use 11 μl TE light buffer to elute the libraries from the beads.\n12. Quantitate each library as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], step 5).\nPool samples and perform setup and sequencing\nThe next steps describe how to pool the two libraries into one sample for PacBio sequencing and then modify the sequencing protocol from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001] (steps 30-60).\n13. Pool the libraries into a single sample with a final volume of 5-15 μl and pool concentration of 5-20 ng/μl.",
    "For example, for WT and ΔRNaseH2 libraries at 10 ng/μl, pool 4 μl of each library to give 8 μl at a final pool concentration of 10 ng/μl. The actual pooling will vary depending on the library concentrations determined in step 12.\n14. Perform “Sample Set-Up” calculation for the pooled library as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 30-32), but enter the following parameters into the “New Calculation” worksheet:\n         \ntable:\n﻿0,1\nSample Comment,T. kodakarensis RNaseH2 Pool\nApplication,Continuous Long Reads\nAvailable Volume (μl),8 (may differ based on pool created)\nSample Concentration (ng/μl),10 (may differ based on pool created)\nInsert Size (bp),2000\nInternal Control,\nCleanup Anticipated Yield,50%\nSpecify Concentration on Plate,10 pM\nCells to Bind,1\nSequencing Primer,Sequencing Primer v4\nBinding Kit,Sequel Binding Kit 3.0\nIt is critical to use these parameters and not those in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], as the directions provided from this calculation will differ from the previous calculation.\n15. Proceed with sample preparation (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 33-50) using the directions provided by the Sample Set-Up calculator (step 14 above) to bind the PacBio sequencing primer and polymerase.\n16. Set up the sequencing run as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0001], steps 51-60) with the following modifications:\n         \nUse the Run Name “T. kodakarensis RNaseH2 RADAR DDMMYYYY” in steps 52-54.\nUse the following parameters in step 53:\ntable:\n﻿0,1\nApplication,Continuous Long Reads\nWell Sample Name,T. kodakarensis RNaseH2\nSample Well,A01\nTemplate Prep Kit,SMRTbell Express Template Prep Kit 2.0\nBinding Kit,Sequel Binding Kit 3.0\nSequencing Kit,Sequel Sequencing Plate 3.0 (4rxn)\nDNA Control Complex,Leave blank\nInsert Size (bp),2000\nOn-plate Loading Concentration,10 pM\nMovie Time per SMRT-cell,20 hr\nUse Pre-extension,Yes\nPre-Extension Time,1 hr\nBarcoded Sample Options,Yes (from pop-up input barcodes)",
    "17. Save the run. Sequence the libraries (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002], steps 54-60), being sure to choose “T. kodakarensis RNaseH2 RADAR DDMMYYYY” as the run name in step 54.\n18. Perform patch detection analysis as described (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.595#cpz1595-prot-0002], steps 37-40) to obtain a table providing the genomic strand, the start and stop locations of the detected patch, and the DNA sequence of the detected patch."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}