{
  "id": 13406,
  "origin_website": "Jove",
  "title": "Three-dimensional Organotypic Cultures of Vestibular and Auditory Sensory Organs",
  "procedures": [
    "All methods described here have been approved by the Animal Care and Use Committees of Rockefeller University and of the University of Southern California.\n1. (Optional) Preparation of Collagen I Solution from Mouse-tail Tendons\nNote: Collagen I solutions are available commercially. Follow the manufacturer's instructions for gel preparation.\nEuthanize 5 - 10 young adult (3 - 5 weeks old) mice of any wild type strain with carbon dioxide in accordance with the protocol approved by the relevant Institutional Animal Care and Use Committee16. Collect the tails and disinfect them by submerging in 70% ethanol for a minimum of 4 h at room temperature.\nNote: Incubation for over 48 h should be avoided, as it results in excessive tissue dehydration and impedes the tendon extraction process.\nRemove the skin from each tail by introducing a longitudinal cut with a scalpel blade and retracting the whole skin with forceps. Transfer the skinned tails to a 100-mm Petri dish filled with clean 70% ethanol and cut them into 10-mm segments.\nNote: Discard the thinnest parts of the tails, which are difficult to manipulate.\nUsing forceps, secure each segment of the tail to the bottom of the Petri dish and use a second pair of fine forceps to extract the tendons from the tail one at a time. Individual tendon fibers should emerge with minimal resistance.\nNote: Old, dull #5 forceps work well for this step.\nPrepare 100 mL of a 0.1% solution (by volume) of acetic acid in sterile, molecular-grade water and add 10 mL of that solution to a sterile 100-mm Petri dish. Transfer the tendons to the Petri dish and leave for 1 h at room temperature to denature the collagen I.",
    "Use a sterile scalpel or iridectomy scissors with blunt, curved tips to mince the tendon into 1 - 2 mm fragments. Transfer the minced tendons to a sterile 50-mL tube and add 0.1% acetic acid to bring the volume to 50 mL.\nNote: Use four or five tails for each 50 mL of acid to achieve a collagen I concentration of 2.0 - 2.5 mg/mL.\nRefrigerate the collagen I solution at 4 °C for a minimum of 48 h to facilitate complete protein denaturation. Vortex with a tabletop vortex set to the maximal speed for 1 min twice a day.\nMeasure the protein concentration of the solution using the bicinchoninic acid assay, adjust the collagen I concentration to 2.0 - 2.5 mg/mL by adding 0.1% solution of acetic acid, and store at 4 °C.\nNote: Collagen I solution can be stored for one to two years.\n(Optional) Centrifuge the collagen I solution at 2,000 x g for 1 h at 4 °C and use the translucent top fraction (approximately half of the volume), to achieve optically clear collagen gels in Section 4.\n2. Dissection of Vestibular and Auditory Organs\nEuthanize pregnant mice of any strain with carbon dioxide in accordance with the protocol approved by the relevant Institutional Animal Care and Use Committee16. Extract and decapitate the embryos.\nNote: Lfng-CreERT2/tdTomato mice can be used to allow permanent labeling of supporting cells upon exposure to 4-hydroxytamoxifen17.\nSterilize all the working surfaces and dissection instruments, including two pairs of #5 forceps and a hair knife18, by cleaning them with 70% ethanol.",
    "Split each head in two halves by introducing a longitudinal cut with a sterile scalpel blade or by using two pairs of #5 forceps. Extract the temporal bones, which contain the inner ears19, and place them into 15 mL of ice-cold Hank's balanced salt solution (HBSS) in a 60-mm Petri dish. Keep the dish on ice.\nNote: Embryos at a range of stages from E13.5 to E18.5 have been used successfully.\n(Optional) Wash the inner ears by gently shaking them in a 50 mL conical tube containing 30 mL ice-cold HBSS and replacing the HBSS three or four times. Keep the tube on ice.\nNote: This step limits possible contamination of the tissue culture and quickly brings the temperature to 4 °C, which prevents tissue degradation and cell death.\nUsing two pairs of fine #5 forceps, separate the inner ears from the temporal bone and transfer the ears, three or four at a time, into a 60-mm Petri dish filled with ice-cold HBSS.\nDissect the vestibular sensory organs.\n\t\nOrient the ears medial side up and locate the utricle. With two pairs of #5 forceps, remove the cartilage surrounding the vestibular organs. Gently sever the vestibular nerve, the connection between the utricle and saccule, and the semicircular canals, as shown in Figure 1. Gently pull the utricle and the attached ampullae of the superior and horizontal semicircular canals from the ear.\nNote: This method can be used on inner ears of stages E16.5 - E18.5. Preserve the cartilage fragments for Section 3 below.\nDissect the cochlea.\n\t\nRemove the cartilaginous tissue surrounding the hearing organ with two pairs of #5 forceps. Gently sever the connection between the cochlear base and the saccule as shown in Figure 1.",
    "Note: For stages E13.5 - E14.5, soften the cartilage prior to dissection by treating the inner ears with 0.25% collagenase I in phosphate-buffered saline (PBS) solution for 5 min at room temperature. Preserve the cartilage fragments for Section 3 below.\nUsing a 200-µL pipet fitted with a wide nonstick tip, transfer the utricles and cochleae to a 30-mm Petri dish filled with growth medium comprising DMEM/F12 supplemented with 33 mM Dglucose, 19 mM sodium bicarbonate, 15 mM 4(2hydroxyethyl)-1piperazineethanesulfonic acid (HEPES), 1 mM glutamine, 1 mM nicotinamide, 20 mg/L epidermal growth factor, 20 mg/L fibroblast growth factor, 10 mg/L insulin, 5.5 mg/L transferrin, and 5 µg/L sodium selenite.\nMaintain the utricle preparations for up to 3 h at 37 °C in a tissue-culture incubator gassed with 5% carbon dioxide to allow healing of the cuts in the epithelium introduced during the dissection. Cochlea preparations should be transferred to the collagen gel 10 min after the dissection.\nNote: Because the dissection is performed in ice-cold HBSS, there is no need to pre-warm the growth medium to 37 °C.\n3. (Optional) Adjust Collagen I Gel Stiffness by Adding Varying Concentrations of Chondrocytes\nNote: The method for chondrocyte isolation was modified from Gosset et al.20\nPrepare a 1% solution of collagenase I in sterile 1x PBS and store 100 - 200 µL aliquots at -80 °C. Defrost on ice when needed, avoiding multiple freeze-thaw cycles.\nUse fine forceps to collect the pieces of cartilage left over from the dissection of the vestibular and auditory organs from 10 - 12 ears. Separate connective and inner ear tissues from the cartilage. Transfer the cartilage to a 30-mm Petri dish and add 300 µL of sterile growth medium.",
    "Use a sterile scalpel blade or iridectomy scissors with blunt curved tips to mince the tissue to achieve cartilage pieces approximately 0.5 mm in length.\nAdd collagenase I to the medium with cartilage to achieve a final enzyme concentration of 0.25%. Transfer the dish to a tissue-culture incubator at 37 °C gassed with 5% carbon dioxide. Pipet vigorously using a 1,000 µL pipet every 20 min until pieces of cartilage dissociate and are no longer distinguishable in the solution, then incubate for an additional 20 min.\nNote: In case of the utricle preparations, chondrocyte isolation can be performed during step 2.9; it takes approximately 2 h (3 - 4 pipetting rounds).\nCollect the cell suspension in a 15 mL conical tube and adjust the volume to 10 mL with sterile 1x PBS. Centrifuge at 800 x g for 5 min at 4 °C. Remove the supernatant and resuspend the cells in 10 mL of sterile 1x PBS. Centrifuge at 800 x g for 5 min at 4 °C and remove the supernatant.\nNote: It is critical to wash the cells twice; any remaining collagenase I will digest the collagen I gel.\nUsing a 200-µL pipet, add 100 µL of culture medium to the cell pellet and pipet gently to resuspend. Count the cells using a hemocytometer and maintain them on ice prior to use.\nTo increase gel stiffness, add chondrocytes to the neutralized collagen I gel solution (Section 1) and mix rapidly to distribute the cells throughout the gel prior to solidification.",
    "Note: The elastic modulus of the collagen I gel (a measure of stiffness), increases linearly with the number of chondrocytes added11. The relationship is described by the experimentally determined linear function E = 206·Nc + 15, in which E is the elastic modulus in Pascals and Nc is the number of chondrocytes in millions. For a detailed protocol for gel stiffness measurements please refer to the original article11.\n4. Place the Vestibular or Auditory Sensory Organ in a Collagen I Gel\nIn a sterile 1.5-mL tube, prepare collagen I polymerization solution by mixing 160 µL of 10x PBS with phenol red pH indicator, 133 µL of 0.34 M sodium hydroxide, 70 µL of 0.9 M sodium bicarbonate, and 40 µL of 1 M HEPES. Keep the tube on ice.\nNote: This recipe provides the polymerization solution needed to prepare 2 mL of collagen I gel, but can be scaled as needed.\nMix 100 µL of polymerization solution and 400 µL of collagen I solution on ice by gently pipetting up and down in a chilled 1.5-mL tube. To increase gel stiffness, add 50 µL of growth medium containing chondrocytes and mix gently as described in Section 3.\nTransfer 500 µL of the neutralized collagen I solution to a chilled 30-mm Petri dish with a 10-mm glass-bottom insert or to a well of a four-well plate.\nNote: It is critical to keep all the reagents on ice to prevent rapid and uneven polymerization of the collagen I.\nQuickly transfer the cochleae or utricles to the neutralized collagen I solution and adjust the organs to their desired positions with a sterile hair knife18 or pair of fine forceps.\nNote: Collagen I polymerization becomes noticeable after 1 - 2 min as the solution becomes turbid.",
    "After the solution around the tissue has polymerized, place the Petri dish or four-well plate for 20 min at 37 °C in a tissue-culture incubator gassed with 5% carbon dioxide to ensure complete polymerization.\nAdd 3 mL of growth medium supplemented with 0.5% fetal bovine serum (FBS) per Petri dish or 500 µL of the same medium per well of a four-well plate. Maintain the culture at 37 °C in a tissue-culture incubator gassed with 5% carbon dioxide. If desired, supplement the growth medium with 10 µM 5-ethynyl-2´-deoxyuridine (EdU) to label proliferating cells.\nNote: Higher FBS concentrations can be used if desired.\n5. Viral Injections in Three-dimensional Cultures of Vestibular and Auditory Sensory Organs\nDefrost the desired virus on ice and mix with trypan blue solution in a 0.5 mL conical tube to achieve a final dye concentration of 0.05%. Use 10 - 20x dye to avoid substantial dilution of the virus. Keep on ice.\nNote: Adenovirus serotype 5 works best for infecting supporting cells in the utricle19, whereas adeno-associated virus Anc80 can infect both hair cells and supporting cells in the utricle and the cochlea21.\nBreak the tip of a glass needle prepared on a micropipette puller with clean fine forceps while observing it at the highest magnification of a binocular dissecting microscope.\nNote: It is important to optimize the settings on the needle puller. Needles with 9 - 12-mm shanks and 20 - 30-µm openings work best.\nRemove a sensory-organ culture from the incubator. Attach the needle to the microinjector and fill it with 2 - 3 µL of dye and virus mixture. Advance the needle into the sensory organ while observing it under the binocular dissecting microscope.",
    "Gently drive the needle tip through mesenchymal and epithelial layers of the roof of a three-dimensional utricular culture. Inject the viral mixture until the cavities of the utricle and ampullae fill with the blue dye.\nNote: Because it allows easy access to sensory organs, a 10-mm glass-bottom Petri dish is optimal for the injections.\nIncubate at 37 °C in a tissue-culture incubator gassed with 5% carbon dioxide.\nNote: When green or red fluorescent protein is used in the viral construct, the fluorescence is apparent 24 h after viral transduction.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}