{
  "id": 19830,
  "origin_website": "Wiley",
  "title": "Modified Cross-Linking, Ligation, and Sequencing of Hybrids (qCLASH) to Identify MicroRNA Targets",
  "procedures": [
    "The steps for qCLASH are illustrated in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-fig-0001]. Briefly, Ago and its associated RNAs are covalently bound by UV crosslinking of live cells. Ago is immunoprecipitated from the resulting cell lysates and the RNA ends are trimmed with RNase. Intermolecular ligation between the two species of RNA bound to each Ago is carried out through treatment with RNA ligase. Ago is digested so that the RNA can be purified, reverse-transcribed, and sequenced. Since this protocol involves prolonged handling of small quantities of RNA, extra care should be taken to maintain a clean, RNase-free work area and equipment.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/68a06a61-ab67-41fd-b745-043d758e6ff0/cpz1257-fig-0001-m.jpg</p>\nFigure 1\nSchematic of the qCLASH protocol. Reproduced in part from Kozar et al. (2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-bib-0010]).\nMaterials\nProtein G Dynabeads, 30 mg/ml (Invitrogen, cat. no. 10004D)\n1× PBS-T, pH 7.2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0006])\n2.4 µg/ml AffiniPure Rabbit Anti-Mouse IgG, Fc Fragment Specific (bridging antibody; Jackson ImmunoResearch, cat. no. 315-005-008)\n0.5 µg/ml anti-pan Ago, clone 2A8 (Millipore Sigma, cat. no. MABE56)\n1× PXL buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0011])\nCells of interest\n1× Dulbecco's phosphate-buffered saline (DPBS; Corning, cat. no. 21-030-CV)\nLysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0005])\nRQ1 DNase, 1000 U (Promega, cat. no. M610A; reconstitute per manufacturer's instructions)\nRNase T1, 100,000 U (ThermoFisher Scientific, cat. no. EN0541; reconstitute per manufacturer's instructions)\n5× PXL buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0012])\nHigh-stringency buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0004])\nHigh-salt buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0003])\n1× and 10× PNK buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0009])\nRNasin Plus, 40 U/µl(Promega, cat. no. N2615)\nATP, 100 mM (ThermoFisher Scientific, cat. no. R0041)\nT4 polynucleotide kinase (PNK), 10,000 U/ml (NEB, cat. no. M0201S)\nT4 RNA ligase buffer, 10× (packaged with T4 RNA Ligase)\nPEG 8000 (50% w/v; packaged with T4 RNA ligase)\nT4 RNA ligase 1, 10,000 U/ml (NEB, cat. no. M0204L)\n4 M KCl (Sigma, cat. no. P9541)\nDephosphorylation buffer, 10× (packaged with alkaline phosphatase)\nAlkaline phosphatase, 1 U/µl (Roche, cat. no. 10713023001)",
    "1× PNK-EGTA buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0010])\nT4 RNA ligase 2, truncated K227Q, 200,000 U/ml (NEB, cat. no. M0351L)\n3′ adapter, 10 µM (custom order from IDT, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0001])\n500 mM NaHCO3\nSDS (Fisher, cat. no. BP166-100), 10% (w/v)\n5× PK buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0008])\nProteinase K (Roche, cat. no. 03115887001; prepare according to manufacturer's instructions)\nPhenol/chloroform/isoamyl alcohol, 25:24:1, pH 5.2 (Fisher, cat. no. BP1753I-400)\n3 M sodium acetate (NaOAc), pH 5.2\nGlycoBlue (Invitrogen, cat. no. AM9516)\nEthanol/isopropanol (1:1)\n80% and 70% ethanol, ice-cold\nBovine serum albumin (BSA), 20 mg/ml (NEB, cat. no. B9000S)\n5′ RNA adapter, 100 pm/µl (custom order from IDT, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0001])\nRNA RT primer, 10 µM (custom order from IDT, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0001])\nDeoxynucleotide (dNTP) solution mix, 10 mM each (NEB, cat. no. N0447S)\n5× Super Script RT Buffer (supplied with enzyme)\n0.1 M DTT (packaged with SuperScript IV)\nSuperScript IV Reverse Transcriptase, 2000 U (ThermoFisher Scientific, cat. no. 18090010)\nMagnesium chloride hexahydrate (Fisher, cat. no. BP214-500)\n2× Phusion High Fidelity PCR Master Mix with HF Buffer (NEB, cat. no. M0531S)\nRP1 universal primer, 10 µM (custom order from IDT, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0001])\nRPI1, RPI2, or RPI3 barcoded primers, 10 µM (custom order from IDT, see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0001])\nTE buffer: 10 mM Tris⋅HCl/1 mM EDTA\nAgarose PS 1200 (Agarose Unlimited, http://www.agaroseunlimited.com[href=http://www.agaroseunlimited.com])\nTAE buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0014])\n6× DNA loading buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0001])\n6× DNA loading buffer, xylene cyanol only (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0001])\n50-bp DNA Ladder (NEB, cat. no. N3236)\nQIAquick Gel Extraction Kit (Qiagen, cat. no. 28704)\n2× SDS Loading Buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-rec-0013])\nPrecision Plus Dual Color Color Standard (Bio-Rad, cat. no. 1610374)\nAnti-Ago2 Antibody, clone 11A9 (Millipore-Sigma, cat. no. MABE253)\nPeroxidase-conjugated AffiniPure Goat Anti-Rat IgG, Fcγ Fragment-Specific (Jackson ImmunoResearch, cat. no. 112-035-008)\nTable 1.\n                Adapters and Primers\ntable:\n﻿Name,Sequence\nRNA 3′ Adapter (RA3)a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl1-note-0001_38],5′/5rApp/TGGAATTCTCGGGTGCCAAGG/3ddc/3′\nRNA 5′ Adapter (RA5)b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl1-note-0002_39],5′/5InvddT/rGrUrUrCrArGrArGrUrUrCrUrArCrArGrUrCrCrGrArCrGrArUrC3′",
    "RNA RT Primer (RTP),5′ GCCTTGGCACCCGAGAATTCCA 3′\nRNA PCR Primer (RP1),5′ AATGATACGGCGACCACCGAGATCTACACGTTCAGAGTTCTACAGTCCGA3′\n\"RNA PCR Primer, Index 1 (RPI1)\",5′ CAAGCAGAAGACGGCATACGAGATCGTGATGTGACTGGAGTTCCTTGGCACCCGAGAATTCCA3′\n\"RNA PCR Primer, Index 2 (RPI2)\",5′ CAAGCAGAAGACGGCATACGAGATACATCGGTGACTGGAGTTCCTTGGCACCCGAGAATTCCA3′\n\"RNA PCR Primer, Index 3 (RPI3)\",5′ CAAGCAGAAGACGGCATACGAGATGCCTAAGTGACTGGAGTTCCTTGGCACCCGAGAATTCCA3′\na /5rApp/ = 5′ adenylation; /3ddC/ = 3′ dideoxy-cytidine.\nb /5InvddT/ = 5′ inverted dideoxy-thymidine; lowercase r indicates nucleotide is RNA.\nForma Class II A2 Biological Safety Cabinet (Thermo Electron Corporation or equivalent)\nDNA LoBind Tube, 1.5-ml (Eppendorf, cat. no. 022431021)\nSorvall Legend Micro 21R Centrifuge (Thermo Scientific or equivalent)\nLabquake rotisserie for microcentrifuge tubes (Thermo Scientific)\nSorvall Legend RT Centrifuge (or equivalent)\nBright-Line Hemacytometer (Hausser Scientific or equivalent)\n100-mm TC-treated Culture Dishes (Corning, cat. no. 430167)\nHL-2000 HybriLinker (UVP Laboratory Products or equivalent)\n50-ml polypropylene centrifuge tubes, conical bottom (Corning, cat. no. 430828)\n1.5-ml microcentrifuge tubes (USA Scientific, cat. no. 1615-5510)\nThermomixer R heat block (Eppendorf or equivalent)\nPCR thermal cycler\nAgilent Tape Station\nAdditional reagents and equipment for counting cells (see Current Protocols article: Phelan & May, 2015)\nDay 1\nPart 1: Bead preparation and antibody conjugation\n1. Transfer 600 μl Protein G Dynabeads to a 1.5-ml LoBind tube. Use LoBind tubes throughout the protocol.\n600 µl of Protein G Dynabeads should bind approximately 150-180 µg human IgG from a solution containing 20–200 µg IgG/ml (https://www.thermofisher.com/order/catalog/product/10003D#/10003D[href=https://www.thermofisher.com/order/catalog/product/10003D#/10003D]).\n2. Wash beads three times, each time with 950 μl cold 1× PBS-T, pH 7.2. Invert tube to resuspend. Microcentrifuge briefly between washes at <775 × g. Carry out all wash steps in this manner throughout the protocol.\nThe PBS-T lacks calcium and magnesium ions because these interfere with the action of detergents. Tween-20 (the “T” of PBS-T) is a nonionic (non-denaturing) detergent that reduces nonspecific protein-protein interactions.\n3. Add 428 μl 1× PBS-T, pH 7.2, and 72 μl AffiniPure Rabbit Anti-Mouse IgG (bridging antibody) to tube. Resuspend beads.",
    "The concentration of the rabbit anti-mouse bridging antibody is 2.4 µg/µl. For a final concentration of 200 µg/ml (high end of range noted above), 42 µl antibody in 500 µl is needed. Therefore, the antibody is present in excess. Using a bridging antibody, rather than coating the beads directly with 2A8, has been experimentally found to result in more efficient pulldown.\n4. Rotate 50 min at room temperature.\n5. Wash three times, each time with 950 μl cold 1× PBS-T, pH 7.2.\n6. Add 490 μl PBS-T and 10 μl of anti-pan Ago 2A8 antibody. Resuspend beads and rotate 4 hr at 4°C.\nThe concentration of anti-pan Ago 2A8 is 0.5 µg/µl. Assuming the beads have been coated at a concentration of 25 µg of bridging antibody per 100 µl of beads, and that the binding ratio of bridging antibody to 2A8 is 1:1, the capacity of 600 µl of beads should be 150 µg of 2A8 antibody. 10 µl of 2A8 is only 5 µg, however, experimentally, this is sufficient for >90% pulldown in our system.\n7. Wash 2A8-conjugated beads four times, each time with 950 μl cold 1× PXL buffer.\nThe recipes for 1× PXL, 5× PXL, 1× PNK, high-salt buffer, and high-stringency buffer are taken from the Cold Spring Harbor protocol for CLIP (http://cshprotocols.cshlp.org/content/2018/12/pdb.prot097956.full#sec-1[href=http://cshprotocols.cshlp.org/content/2018/12/pdb.prot097956.full#sec-1]).\n8. Resuspend in 620 μl 1× PXL and make three aliquots of 200 µl. Store at 4°C until lysates are ready.\nPart 2: UV crosslinking of cells\nThis step can be completed in advance. Crosslinked cells can be stored at −80°C indefinitely.\n9. Prepare a single-cell suspension.",
    "qCLASH has been used successfully on numerous different cell types. These include both adherent and suspension cell lines as well as primary cells. In our original qCLASH experiments, we used 50 million cells per biological replicate; however, it is also possible to use fewer cells. Please see Critical Parameters for a discussion on cell numbers.\n10. Centrifuge 5 min at 200 × g, 4°C.\n11. Aspirate supernatant and resuspend cells in 10 ml of cold DPBS. If there are multiple cell pellets, they can be combined.\nDPBS should be kept cold throughout the UV crosslinking process.\n12. Centrifuge 5 min at 200 × g, 4°C, remove supernatant, and resuspend pellet in 10 ml of DPBS. Perform this step twice.\n13. Count cells with a hemacytometer or automated cell counting device (see Current Protocols article: Phelan & May, 2015) before transferring the cell suspension to a 10-cm plate on ice.\n14. Place the ice tray and plate (with the lid removed) into the HL-2000 HybriLinker. Crosslink once at 400 mJ/cm2, rotate plate 180°, swirl, and crosslink once at 200 mJ/cm2.\n15. Swirl plate and transfer cells to a 50-ml conical tube. Rinse the plate with an additional 10 ml of DPBS and add this to the tube. Keep the tube on ice.\n16. Centrifuge 5 min at 200 × g, 4°C. Resuspend the cells in an appropriate volume of DPBS and make aliquots of 50 million cells in 1.5-ml tubes.\n17. Centrifuge 5 min at 200 × g and 4°C. Remove DPBS and freeze the cell pellets at −80°C if not proceeding directly to immunoprecipitation.\nPart 3: Lysate preparation\n18. Prepare 2 ml complete lysis buffer (containing the protease inhibitor mixture and DTT as described in Reagents and Solutions).",
    "Lysis buffer contains NP-40, a nonionic detergent, which disrupts cell membranes while leaving proteins intact. It also contains HEPES, to stabilize the pH, and salts, which raise the ionic strength (solute concentration) of the solution. DTT protects proteins from oxidative damage.\n19. Take three aliquots of 5 × 107 cells that were previously UV-crosslinked (see step 17) and thaw them on ice. Resuspend in 500 μl complete lysis buffer per aliquot.\n20. Lyse 15 min on ice.\n21. Add 10 μl RQ1 DNase to each tube.\n22. Incubate 5 min at 37°C while shaking at 1000 rpm.\n23. Spin lysates 15 min at 21,000 × g, 4°C.\n24. Transfer supernatants to new tubes and discard pellets.\n25. Add 0.5 μl RNase T1 to each tube and incubate for 15 min at 22°C.\nThe RNase T1 treatment is intended to trim the ends of the Ago-bound RNA. Overly long sequences make it more difficult to determine the site of Ago/miRNA binding and may interfere with hybrid formation. RNase T1 is also expected to degrade RNA which is free in solution. Digestion with RNase T1 leaves a 5′ OH (https://www.thermofisher.com/order/catalog/product/EN0541#/EN0541[href=https://www.thermofisher.com/order/catalog/product/EN0541#/EN0541]).\nPart 4: Immunoprecipitation\n26. Transfer 5 μl of each lysate to new tubes and store at −20°C.\nThese will be the “input” samples for the optional Western blot to confirm the IP.\nThe optional Western blot to confirm the success of the Ago IP is described in Part 17 (steps 108-110, below).\n27. Remove buffer from beads and add lysates. Rotate overnight at 4°C.\nDay 2\n28. Shortly before ending the 4°C incubation, prepare 14 ml complete lysis buffer (containing the protease inhibitor mixture and DTT as described in Reagents and Solutions).\nLysis buffer is used again to keep the buffer for the first and second RNase treatments consistent.",
    "29. Transfer supernatants to new tubes and store at −20°C.\nThese will be the “flow-through” samples for the optional Western blot to confirm the IP.\n30. Wash three times (950 μl per wash) with complete lysis buffer. Resuspend beads in 1000 μl complete lysis buffer.\n31. Add 0.5 μl RNase T1 to each tube and incubate for 12 min at 22°C, shaking continuously at 700 rpm.\nThe second RNase T1 treatment is intended to further ensure that any RNA not bound to Ago is degraded. This step is based on Moore et al. (2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-bib-0011]).\n32. Wash three times (950 μl per wash) with each of the following ice-cold buffers: 1× PXL, 5× PXL, high-stringency buffer, high-salt buffer, and 1× PNK buffer. After first wash with high-stringency buffer and high-salt buffer, incubate tubes on ice 1 min.\n1× PXL and 5× PXL are detergent solutions. High-stringency buffer contains detergents, sodium, potassium, EDTA (a calcium chelator), and EGTA (a magnesium chelator). EDTA and EGTA should inhibit/inactivate RNase T1. High-salt buffer is the same as high-stringency buffer, but with a much higher concentration of NaCl. The addition of salt further increases stringency in order to reduce background.\n33. Leave beads in final wash buffer and incubate on ice while preparing the T4 PNK mixture.\nPart 5: Phosphorylation\n34. Prepare T4 PNK mix, adding the T4 PNK enzyme last (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nPNK buffer (10x),28 μl\nRNasin Plus (40 U/μl),7 μl\nATP (100 mM),2.8 μl\nH2O,228.2 μl\nT4 PNK enzyme (10 U/μl),14 μl\nTotal,280 μl\nPolynucleotide kinase (PNK) catalyzes the transfer of a γ-phosphate from ATP to the free 5′ hydroxyl end of DNA or RNA.\n35. Remove wash buffer and add 80 μl to each tube.",
    "36. Incubate at 10°C for 40 min, shaking every 2 min for 15 s at 1000 rpm.\nPart 6: Intermolecular ligation\n37. Wash three times, each time with 950 μl of 1× PNK buffer.\n38. Leave beads in final wash buffer and incubate on ice while preparing the ligation mix (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nT4 RNA ligase buffer (10x),175 μl\nPEG 8000 (50% w/v),210 μl\nKCl (4 M),4.38 μl\nRNAsin Plus (40 U/μl),43.75 μl\nATP (100 mM),17.5 μl\nH2O,1124.4 μl\nTotal,1575 μl\n39. Remove wash buffer and add 450 μl ligation mix followed by 50 μl T4 RNA ligase 1 to each tube.\nT4 RNA Ligase 1 will join the phosphorylated 5´ ends of the RNA with the 3´ hydroxyl-terminated ends left by RNase T1. This reaction requires ATP (https://www.neb.com/products/m0204-t4-rna-ligase-1-ssrna-ligase#Product%20Information[href=https://www.neb.com/products/m0204-t4-rna-ligase-1-ssrna-ligase#Product%20Information]).\n40. Resuspend beads and rotate overnight at 4°C.\nDay 3\nPart 7: Dephosphorylation\n41. Wash three times, each time with 950 μl of 1× PNK buffer.\n42. Leave on ice in buffer from last wash and prepare the dephosphorylation mix (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\n10x Dephosphorylation buffer,28 μl\nRNasin Plus (40 U/μl),7 μl\nH2O,234.5 μl\nAlkaline phosphatase (1 U/μl),10.5 μl\nTotal,280 μl\nThe 5′-terminal phosphates added in Part 4 will now be removed by alkaline phosphatase. This will ensure that the 5′ ends do not attach to the 3′ adapter or any extraneous RNAs during the ligation reaction in Part 7 (https://www.sigmaaldrich.com/US/en/product/roche/apmbro?context=product[href=https://www.sigmaaldrich.com/US/en/product/roche/apmbro?context=product]).\n43. Remove wash buffer and add 80 μl dephosphorylation mix to tube.\n44. Incubate at 10°C for 40 min, shaking every 2 min for 15 s at 1000 rpm.\nPart 8: 3′ adapter ligation\n45. Wash twice, each time with 950 μl 1× PNK-EGTA buffer. After the first wash, incubate 1 min on ice.\nAlkaline phosphatase is inactivated by EGTA.",
    "46. Wash three times, each with 950 μl of 1× PNK buffer.\n47. Leave samples on ice in the last wash buffer and prepare the ligation mix (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nH2O,147 μl\nT4 RNA ligase buffer (10x),28 μl\nPEG 8000 (50% w/v),56 μl\nRNAsin Plus (40 U/μl),7 μl\n3’ adapter (10 μM),28 μl\n\"T4 RNA ligase 2, truncated, K227Q\",14 μl\nTotal,280 μl\nThe 3′ adapter used here, which has the same sequence as the RNA 3′ Adapter (RA3) from the Illumina TruSeq® Small RNA Sample Prep Kit, is ordered from IDT as a custom oligo. It is adenylated at the 5′ end, enabling truncated T4 RNA ligase 2 to ligate the 5´ end of the 3′ adapter to the 3´ OH end of the RNA. This process does not require ATP. Truncated T4 RNA ligase 2 cannot ligate the phosphorylated 5´ ends to the 3´ ends of the adapter or other RNAs. In addition, the 3′ adapter has a 3′ dideoxy-cytidine, which also serves to prevent the 3′ end of the adapter from binding to the 5′ end of the RNA. The K227Q mutation further reduces unwanted ligation products (https://www.neb.com/products/m0351-t4-rna-ligase-2-truncated-k227q#Product%20Information[href=https://www.neb.com/products/m0351-t4-rna-ligase-2-truncated-k227q#Product%20Information]).\n48. Remove wash buffer and add 80 μl ligation mix to each tube.\n49. Resuspend beads and incubate overnight at 16°C, shaking every 2 min for 15 s at 1000 rpm.\nDay 4\nPart 9: Complex elution\n50. Wash three times, each time with 950 μl 1× PNK buffer.\n51. Leave on ice with buffer from last wash while preparing the elution buffer (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nNaHCO3 (500 mM),130 μl\n\"SDS (10%, w/v)\",65 μl\nH2O,455 μl\nTotal,650 μl\nSDS enhances the activity of Proteinase K in part 10.",
    "52. Add 100 μl of elution buffer to beads and incubate at room temperature for 15 min, shaking continuously at 1400 rpm. Transfer supernatant to new tube.\n53. Repeat previous step, this time adding supernatant to that from previous step.\n54. Transfer 2 μl of eluate to new tube and store at −20°C.\nThese will be the “eluate” samples for the optional Western blot to confirm the IP.\nPart 10: Proteinase K treatment/RNA extraction\n55. During the incubation steps with elution buffer, prepare 1× PK buffer containing 4 mg/ml proteinase K (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nPK buffer (5x),35 μl\nProteinase K,35 μl\nH2O,105 μl\nTotal,175 μl\n56. Pre-incubate proteinase K solution 20 min at 37°C.\nPre-incubation of the proteinase K solution is intended to inactivate RNases.\n57. Add 50 μl of 1× PK buffer with proteinase K to each tube of eluate and incubate at 37°C for 20 min.\nPK buffer contains EDTA, which inhibits nucleases.\n58. Add 250 μl phenol/chloroform/isoamyl alcohol (25:24:1) and incubate at room temperature for 8 min, shaking continuously at 1400 rpm.\nDuring phenol/chloroform extraction, proteins are retained in the phenol phase due to their many hydrophobic side chains. In contrast, nucleic acids are polar, so they remain in the aqueous phase. Isoamyl alcohol is added to reduce foaming and stabilize the boundary between the organic and aqueous phases.\n59. Centrifuge for 10 min at 18,000 × g, 4°C.\n60. Remove approximately 200 μl of the aqueous layer and transfer to a new tube. To this add 20 μl 3 M NaOAc, pH 5.2; 2 μl GlycoBlue; and 500 μl of a 1:1 mixture of ethanol/isopropanol.",
    "Sodium acetate is added in order to neutralize the charge of the sugar phosphate backbone, making the RNA less hydrophilic, thereby causing it to precipitate out of solution. GlycoBlue, which is a glycogen product, is a co-precipitant that makes the RNA pellet more readily visible. Ethanol and isopropanol facilitate the interaction between Na+ ions from sodium acetate and the PO3- groups on the RNA.\n61. Incubate overnight at −20°C.\nDay 5\nPart 11: Phosphorylation\n62. Centrifuge for 30 min at 21,000 × g, 4°C.\n63. Wash 1× with 900 μl ice cold 80% ethanol and centrifuge for 10 min at 18,000 × g, 4°C.\n64. Wash 1× with 200 μl ice cold 80% ethanol and centrifuge for 10 min at 18,000 × g, 4°C.\n65. Air dry for approximately 10 min, checking often.\nPellets should become translucent when dry.\n66. Add 10.5 μl ddH2O and incubate on ice for 15 min.\n67. Prepare T4 PNK mix, adding the T4 PNK enzyme last (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nT4 RNA ligase buffer (10x),5.25 μl\nRNAsin Plus (40 U/μl),1.75 μl\nATP (10 mM),5.25 μl\nT4 PNK enzyme (10 U/μl),3.5 μl\nTotal,15.75 μl\nThe 5′ ends are phosphorylated here in order to prepare the RNA for the ligation of the 5′ adapter in the next step.\n68. Add 4.5 μl to each tube.\n69. Incubate 40 min at 10°C.\nPart 12: 5′ adapter ligation\n70. Prepare a ligation solution, adding the T4 RNA ligase last (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\nT4 RNA Ligase Buffer (10x),1.75 μl\nBSA (1 mg/ml),7 μl\nATP (10 mM),1.75 μl\n5’ RNA adapter (100 pmol/μl),3.5 μl\nT4 RNA ligase 1 (10 U/μl),3.5 μl\nTotal,17.5 μl",
    "The 5′ RNA adapter, which has the same sequence as the RNA 5′ Adapter (RA5) from the Illumina TruSeq® Small RNA Sample Prep Kits, is ordered from IDT as a custom oligo. It has a 5′ inverted dideoxy-thymidine to prevent the 5′ end of the adapter from binding to the 3′ end of the RNA.\n71. Add 5 μl ligation solution to each tube. Mix by pipetting.\n72. Incubate overnight at 16°C.\nDay 6\n73. Add 200 μl ddH2O and 250 μl phenol/chloroform/isoamyl alcohol to each tube.\n74. Vortex 8 min at 1400 rpm at room temperature.\n75. Centrifuge 10 min at 18,000 × g, 4°C.\n76. Remove approximately 200 μl of the aqueous layer and transfer to a new tube. To this add 20 μl 3 M NaOAc, pH 5.2; 1 μl Glycoblue; and 500 μl of a 1:1 mixture of ethanol/isopropanol.\n77. Incubate overnight at −20°C.\nDay 7\nPart 13: Reverse transcription\n78. Centrifuge 30 min at 21,000 × g, 4°C.\n79. Wash twice, each time with 200 μl ice-cold 80% ethanol. Centrifuge 10 min at 18,000 × g, 4°C, after each wash.\n80. Air dry and resuspend in 11 μl ddH2O.\n81. Add to each tube:\n         \ntable:\n﻿0,1\nRT primer (RTP) (10 μM),1 μl\ndNTPs (10 mM),1 μl\n82. Incubate at 65°C for 5 min, then chill on ice and centrifuge briefly.\n83. Prepare an RT mix (amounts are for 3.5 reactions):\n         \ntable:\n﻿0,1\n5× Super Script RT Buffer,14 μl\nDTT (0.1 M),3.5 μl\nRNasin Plus (40 U/μl),3.5 μl\nSuper Script Enzyme (200 U/μl),3.5 μl\nTotal,24.5 μl\n84. Add 7 μl of the RT mix to each tube of RNA.\n85. Incubate at 50°C for 45 min, 55°C for 15 min, and 95°C for 5 min.\n86. Chill on ice while preparing PCR mix.\nPart 14: PCR",
    "87. Prepare a PCR mix (amounts are for 7.5 reactions):\n         \ntable:\n﻿0,1\n2× Phusion High Fidelity Master Mix,75 μl\n\"RPI1, 2, or 3 (10 μM)\",7.5 μl\nRP1 (10 μM),7.5 μl\nWater,45 μl\nTotal,135 μl\n88. Add 18 μl of the PCR mix to 2 μl of each RT product. Set up two reactions for each biological replicate and include a water control. Store the remaining RT product at −80°C.\n89. Preheat PCR thermal cycler block to 98°C. Place tubes in block and run the following cycle:\n         \n98°C for 30 s\n98°C for 10 s\n52°C for 30 s\n72°C for 30 s\n72°C for 5 min\n4°C hold.\nPart 15: Size selection (option 1)\nThis optional size-selection step is intended to eliminate excess adapters. Protocol users may choose to perform this step, or its alternative described in Part 16.\n90. Prepare a mixture of 30% PEG 8000/29.25 mM MgCl2:\n         \ntable:\n﻿0,1\n\"PEG 8000 (50%, w/v)\",240 μl\nMgCl2 (1 M),11.8 μl\nH2O,148.2 μl\nTotal,500 μl\n91. Add 60 μl of TE buffer to each PCR product, followed by 40 μl of the PEG 8000/MgCl2 mixture.\n92. Vortex and incubate 10 min at room temperature.\n93. Centrifuge 15 min at 10,000 × g, room temperature.\n94. Transfer supernatants to new tubes and add 12 μl 3M NaOAc, 300 μl 100% ethanol, and 1 μl Glycoblue.\n95. Incubate overnight at −20°C.\n96. Centrifuge 30 min at 21,000 × g, 4°C.\n97. Wash twice with 900 μl and once with 200 μl of 70% ice-cold ethanol. Centrifuge 10 min at 18,000 × g, 4°C after each wash.\n98. Air dry and resuspend in 15 μl ddH2O.\nThis is now the final qCLASH library for next-generation sequencing.\nPart 16: Agarose gel purification (option 2)",
    "This optional gel purification step is intended to eliminate excess adapters. Protocol users may choose to perform this step, or its alternative described in Part 15.\n99. Prepare a 2% agarose gel by dissolving 200 × g of agarose in 100 ml of 1× TAE buffer.\n100. Add 2 μl of 6× DNA loading buffer with xylene cyanol to each PCR product.\nBromophenol blue runs at approximately the same position as the PCR products and may obscure their presence.\n101. Run products on gel at 100 V for approximately 1 hr alongside 50-bp ladder, prepared by combining 1 µl of 6× DNA loading buffer (containing both xylene cyanol and bromophenol blue), 5 µl of NEB 50-bp DNA Ladder, and 4 µl of water. Stop gel when bromophenol blue marker is approximately 2 cm from the bottom.\n102. Excise regions from gel corresponding to approximately 175-300 bp and transfer gel slices to low-bind tubes.\n103. Perform gel extraction with Qiaquick Gel Extraction Kit according to the provided protocol. Do not skip optional steps.\nThe final, gel-purified PCR products are the libraries which will be used in next-generation sequencing. These libraries can be stored at−80°C indefinitely.\nPart 17: Western blot (optional)\n104. Prepare 300 μl of 2× SDS Loading Buffer with DTT (60 μl 1 M DTT, 240 μl 2× SDS Loading Buffer).\n105. Prepare samples by combining volumes specified in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0002]. Each lane will contain the equivalent of 500,000 cells. M = Precision Plus marker, I = input, FT = flow-through, E = eluate.\nTable 2.\n                Western Blot Sample Preparation\ntable:\n﻿Unnamed: 0,M,I,FT,E\nSample (µl),5,5,5,2\nH2O (µl),10,10,10,13\n2× Buffer (µl),15,15,15,15\nTotal (µl),30,30,30,30\n106. Incubate at 95°C for 5 min, vortex briefly, and centrifuge briefly at room temperature.",
    "107. Proceed with a standard Western blot. Use Anti-Ago2 11A9 diluted 1:1000 as the primary antibody and peroxidase-conjugated goat anti-Rat IgG diluted 1:5000 as the secondary antibody. See Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-fig-0002] for a representative Western blot.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7a2089a6-41dc-42ce-85b9-24b37889589b/cpz1257-fig-0002-m.jpg</p>\nFigure 2\nRepresentative Western blot of samples taken during the immunoprecipitation stage. Input = cell lysate prior to immunoprecipitation, Flow-thru = supernatant after immunoprecipitation, Eluate = bead-bound fraction after immunoprecipitation. Experiment was performed in duplicate.\nPart 17: Quality control and sequencing\n108. Accurately quantify the newly prepared qCLASH libraries.\nThis can be accomplished in several ways, such as using the Qubit fluorometer (ThermoFisher). Most next-generation sequencing facilities offer this service. The volume and concentration of DNA required for sequencing will most likely vary depending on the sequencing facility.\n109. Assess the size distribution of the qCLASH libraries on an Agilent TapeStation.\nThis is another service usually offered by next-generation sequencing facilities. qCLASH libraries often display a distinctive peak around 170-180 bp in size followed by a larger, broader peak (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-fig-0003]). Once the libraries are deemed to be the right size and concentration, they are ready to submit for sequencing.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/85e0d3ef-bd98-44ad-b72e-c9f38b26fe3e/cpz1257-fig-0003-m.jpg</p>\nFigure 3\nRepresentative TapeStation (Agilent) electropherograms of qCLASH sequencing libraries. The approximately 170 to 180-bp peak is expected to be unligated single miRNAs, while the larger peak should contain hybrids as well as unligated RNA of various types. BR1, biological replicate 1.\n110. Perform next-generation sequencing. At a minimum, 100 cycles should be used. Sequencing can be single or paired-end, depending on the bioinformatics analysis to be performed.",
    "This Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-prot-0002] is a scaled-down version of the immunoprecipitation portion of the qCLASH protocol, using only 500,000 cells per replicate. It is intended to be completed prior to starting the main protocol in order to optimize the conditions of the immunoprecipitation. We have found that different cell lines may have different pulldown efficiencies, and therefore it is important to determine the most appropriate conditions for each cell line. The main factor that can be adjusted here is the concentration of the anti-Ago antibody. As indicated in the annotations of the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-prot-0001], the amount of anti-Ago 2A8 used is not fully saturating, so it should be possible to increase its concentration without adjusting the concentration of beads or bridging antibody used.\nFor materials, see Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-prot-0001].\nDay 1\nBead preparation and antibody conjugation\n1. Transfer 120 μl Protein G Dynabeads to a Lo-Bind 1.5-ml tube.\n2. Wash beads three times, each time with 450 μl cold 1× PBS-T, pH 7.2. Invert tube to resuspend. Microcentrifuge briefly between washes at <775 × g. Carry out all wash steps in this manner throughout the protocol.\n3. Add 485 μl 1× PBS-T, pH 7.2, and 15 μl rabbit anti-mouse bridging antibody to tube. Resuspend beads.\n4. Rotate 1 hr at room temperature.\n5. Wash three times, each time with 450 μl cold 1× PBS-T, pH 7.2.\n6. Resuspend in 620 µl PBS-T and divide into six aliquots of 100 µl.\n7. Prepare the six tubes as indicated in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0003].\nTable 3.\n                Antibody Volumes\ntable:\n﻿Unnamed: 0,Tube 1,Tube 2,Tube 3,Tube 4,Tube 5,Tube 6\n2A8 (µl),2,2,3,3,4,4\nPBS-T (µl),398,398,397,397,396,396\n8. Rotate 4 hr at 4°C.\n9. Wash 2A8-conjugated beads four times, each time with 450 μl cold 1× PXL buffer.",
    "10. Resuspend each aliquot in 200 μl of 1× PXL. Store at 4°C until lysates are ready.\nPart 2: Lysate preparation\n11. Prepare 500 µl complete lysis buffer containing the protease inhibitor mixture and DTT as described in Reagents and Solutions.\n12. Take one aliquot of 3 × 107 cells and thaw on ice. Resuspend in 300 μl complete lysis buffer.\n13. Lyse 15 min on ice.\n14. Spin lysate 15 min at 21,000 × g, 4°C.\n15. Transfer supernatant to new tube and discard pellet.\nPart 3: Immunoprecipitation\n16. Transfer 10 μl of lysate to new tube and store at −20°C.\nThis will be the “input” sample for the Western blot.\n17. Remove buffer from beads and transfer 48 µl lysate to each of the six tubes. Add 252 µl complete lysis buffer to each tube. Rotate overnight at 4°C.\nAdditional lysis buffer is added to bring the total volume to 300 µl, which is the minimum required for the beads to remain in suspension while rotating.\nDay 2\n18. Transfer supernatants to new tubes and store at −20°C.\nThese will be the “flow-through” samples for the Western blot.\n19. Wash three times (450 μl per wash) with each of the following ice-cold buffers: 1× PXL, 5× PXL, high-stringency buffer, high-salt buffer, and 1× PNK buffer. After first wash with high-stringency buffer and high-salt buffer, incubate tubes onice 1 min.\n20. Leave beads in final wash buffer and incubate on ice while preparing 400 μl of 1× SDS loading buffer with DTT (40 μl 1 M DTT, 160 μl 2× SDS loading buffer, 200 μl H2O).\n21. Remove wash buffer and add 50 μl of 1× SDS loading buffer to each tube.\n22. Store samples at −20°C if not proceeding directly to Western blot.",
    "These will be the “eluate” samples for the Western blot.\nPart 4: Western blot\n23. Prepare 300 μl of 2× SDS loading buffer with DTT (60 μl 1M DTT, 240 μl 2× SDS loading buffer).\n24. Prepare samples by combining volumes specified in Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-tbl-0004]. Each lane will contain the equivalent of 250,000 cells. M = Precision Plus marker, I = input, FT = flow-through, E = eluate.\nTable 4.\n                Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-prot-0002]: Western Blot Sample Preparation\ntable:\n﻿Unnamed: 0,M,I,FT,E\nSample (µl),5,2.5,15,2.5\nH2O (µl),10,12.5,0,12.5\n2× Buffer (µl),15,15.0,15,15.0\nTotal (µl),30,30.0,30,30.0\n25. Incubate at 95°C for 5 min, vortex briefly, and centrifuge briefly at room temperature.\n26. Proceed with a standard Western blot. Use anti-Ago2 11A9 diluted 1:1000 as the primary antibody and peroxidase-conjugated goat anti-rat IgG diluted 1:5000 as the secondary antibody. See Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.257#cpz1257-fig-0002] for a representative Western blot."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}