{
  "id": 7437,
  "origin_website": "Bio",
  "title": "A Retro-orbital Sinus Injection Mouse Model to Study Early Events and Reorganization of the Astrocytic Network during Pneumococcal Meningitis ",
  "procedures": [
    "Pneumococcal cultureStreak PN serotype 4 wild-type strain TIGR-4 from a glycerol stock onto a THY 5% blood agar plate. Incubate for 16-24 h in a 10% CO2 incubator at 37°C.Inoculate 2 ml of THYE pre-culture in a 15 ml sterile Falcon tube with one single colony. Incubate for 16H in a 10% CO2 incubator without agitation.Inoculate 5 ml of THYE culture with a 1:100 dilution of pre-culture. Incubate in a 10% CO2 incubator until 0.2 < OD600nm < 0.4. Because of its capacity to undergo quorum sensing-dependent autolysis, growing PN cultures can be tricky. In particular, the lag phase preceding growth may be of variable duration, sometimes extending over several hours. However, once bacterial growth exceeds OD600nm > 0.15, the doubling time may be as short as 15 min. The incubation time for this step will vary but in general should not last more than 4 h.Centrifuge the culture at 21°C for 5 min at 7,000 × g, and discard the supernatant.Resuspend the pellet in 5 ml of sterile PBS.Determine the bacterial density by reading the OD600nm. Because of its capacity to undergo quorum sensing-dependent autolysis, growing PN cultures can be tricky. In particular, the lag phase preceding growth may be of variable duration, sometimes extending over several hours. However, once bacterial growth exceeds OD600nm > 0.15, the doubling time may be as short as 15 min.Centrifuge the culture at 21°C for 5 min at 7,000 × g, and discard the supernatant.Adjust the PBS volume to obtain final OD = 1.0 (ca. 2 × 108 CFUs/ml). Note that the OD–CFU correspondence may vary depending on the PN strain and may need to be determined empirically.Mice RO injection and sampling (Figure 1)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4242/bioprotoc-11-23-4242-g001.jpgFigure 1. Flow chart of PN meningitis analysis following RO injection in mice.",
    "Major steps are indicated by numbers and are performed in sequential order. Besides step 7, all other steps are performed in a P2 environment. Steps 3-6 are performed in a laminar flow sterile hood.If mice are not bred on site but delivered from an external supplier, allow mice to adjust in local animal facilities for 3 days prior to experimentation. The day of the experimentation, isolate the mouse subjected to manipulation in the P2 environment from other mice. These measures are to limit potential variations linked to animal stress.Anaesthetise C57/BL6 mice with a intraperitoneal injection of 100 µl of 10% (vol:vol) ketamine (100 mg/ml) and 2% xylazine in PBS. Use tuberculin syringes with a 27-gauge needle for injections.Inject mice with 50 µl (107 CFUs) of the PN suspension in the RO. The procedure for RO injection is described in detail in reference (Yardeni et al., 2011), with many tutorial videos available online (e.g., https://www.research.psu.edu/animalresourceprogram/training/videos/retro-orbital-injection-in-the-mouse[href=https://www.research.psu.edu/animalresourceprogram/training/videos/retro-orbital-injection-in-the-mouse]). Briefly, the mouse right eyeball is mildly exorbited by applying gentle pressure on the skin dorsal and ventral to the eye. A drop of ophthalmic anesthetic such as 0.5% proparacaine hydrochloride may be added to prevent eye desiccation. To limit potential damage to the eyeball, the needle is inserted bevel down. Injection and removal of the needle are performed slowly to favor diffusion of the bacterial suspension in the RO sinus.Mice are returned to their cage for the incubation period. Upon awakening, mice are usually active and show few symptoms during the first hours post-infection. Piloerection and slowed activity are clearly detected 9 h post-infection, with prostration and labored breathing after 24 h, time at which mice are sacrificed, then wiped with 70% ethanol.Pin the mouse paws with needles to a board.Cut the skin over the diaphragm.Cut the diaphragm to reveal the thoracic cage.",
    "While holding the xiphoid process, cut the ribs on both sides of the thoracic cage.Perform cardiac sampling of blood first for CFU determination [Figure 1 (6)].Perform intracardiac perfusion with 20 ml of sterile PBS to wash away contaminated blood in the organs’ vessels. This procedure is described in detail in         Wu et al. (2021)        .To this aim, cut the right atrium to allow the flow through of perfused PBS.Insert the 22G-blunt perfusion needle filled with PBS into the left ventricule, towards the aorta.Flow PBS in the tubing using the peristaltic pump until a drop is visible at the tip of the Luer lock connector, to avoid bubbles.Connect the perfusion needle to the Luer lock connector.Flow PBS at 2.5 ml/min for 8-10 min. The mice should become exsanguinated.Open the skull with a scalpel and remove the brain.Pre-weigh empty sterile Eppendorf tubes. Separate the brain hemispheres, transfer each hemisphere to an Eppendorf tube, and weigh immediately. Calculate the weights of the hemispheres.Use immediately for CFU determination. Alternatively, flash-freeze for qRT-PCR or process for confocal microscopy analysis of immunofluorescent labeling of brain slices, as described below.CFU counting (Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4242/bioprotoc-11-23-4242-g002.jpgFigure 2. PN translocation across the blood brain barrier occurs under controlled bacteremia during the first hours of infection. C57/BL6 6-8-week-old mice were injected intravenously with 107 PN equivalent CFUs via the RO sinus. At various time points post-infection, mice were sacrificed. A. CFU determination from brain and blood samples. Note that during the first 13 h post-infection, bacteremia remains constant (ca. 105 CFUs/ml) while brain CFUs increase exponentially. B. qRT-PCR analysis of total RNAs from brain samples (N > 3 mice per determination). Endothelial and astroglial inflammation assessed by mRNA transcripts of ICAM-1 and GFAP, respectively, show a significant increase at 13 h post-infection.Homogenize the brain hemisphere in 2 ml of sterile PBS.",
    "Perform serial 10-fold dilutions of the brain homogenate in PBS. Conveniently, dilutions are performed by serially transferring 10 µl of homogenate in sterile Eppendorf tubes containing 90 µl of PBS.Plate 50 µls of each dilution on a THYE blood agar plate.Incubate for 16-48 h in a 10% CO2 incubator at 37°C.Count CFUs and normalize to the dilution factor and brain weight.qRT-PCR (Figure 2)Hemispheres are either processed immediately or flash-frozen in liquid nitrogen and stored at -80°C until processing for qRT-PCR of inflammation markers on total RNA extracted using a commercial kit (e.g., RNeasy Lipid Tissue, Qiagen).Add a glass bead to the hemisphere in 1 ml of Trizol in a 1.5 ml Eppendorf tube.Homogenize samples using a TissueLyser device.Add 200 µls of chloroform to homogenate and mix at 21°C.Centrifuge at 14,000 × g for 15 min at 4°C.Transfer 500 µl of the supernatant to a fresh Eppendorf tube and add 500 µl of 70% ethanol.Process for total RNA extraction, following the manufacturer’s instructions[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/rna-purification/total-rna/rneasy-lipid-tissue-mini-kit/]. Determine the RNA concentration of the sample eluted in RNAse-free water using a Nanodrop device.Perform reverse transcription using the Reverse Transcription kit, and quantitative PCR using the SYBR Green PCR master Kit, following the manufacturer’s instructions, with the the QuantiTect Primer assays or the following primers for GFAP: 5’-GGGGCAAAAGCACCAAAGAAG-3’and 5’-GGGACAACTTGTATTGTGAGCC-3’. Results are typically expressed as a ratio relative to values obtained for 18S RNA control (Figure 2).Brain slice preparation, immuno-fluorescence staining, and analysis with confocal fluorescence microscopy (Figure 3)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4242/bioprotoc-11-23-4242-g003.jpgFigure 3. Confocal microscopy analysis of GFAP-labeled brain slices. C57/BL6 6-8-week-old mice were injected intravenously with 107 PN equivalent CFUs via the RO sinus. Brains were excised at 6 h post-infection, and 20 μm thick brain slices were cut with a cryostat for immunofluorescence staining. A. Representative maximal projections of confocal planes. Arrows: PN-associated GFAP fragmentation.",
    "Green: PN capsule; blue: GFAP; red: Isolectin IB-4; gray levels: nuclear DNA. B. Right: higher magnification of insets shown in the left panel. Dotted outline: area corresponding to PN microcolony and capsular remnants (PN-CS) associated with fragmentation of the GFAP filament network. Right panels: GFAP fragments are detected using the particle analysis plug-in of Fiji (Methods). C. Quantification of GFAP fragments per μm2 in PN-CS (PN) or control area (CTRL) (N = 2, > 10,000 fragments). Mann and Whitney. *: P < 0.05. Scale bar = 5 μm.Emmbed freshly dissected hemispheres in OCT, frozen in isopentane at -25°C, and stored at -80°C or sectioned.Perform sequential 20 μm coronal sections of the frozen hemispheres in a cryostat.Lay slices in an orderly manner onto slides, so as to keep track of the corresponding brain area. These records are subsequently used to analyze whether PN crossing of the BBB occurs at specific sites.Fix brain slices in 4% paraformaldehyde diluted in PBS for 15 min at 21°C. All subsequent steps are performed at 21°C.Permeabilize samples for 60 min in PBS containing 0.25 % Triton X-100 and 5% newborn goat serum (NGS), then wash three times in PBS. The use of a slide holder enabling the simultaneous dipping of samples in successive beakers is convenient for the processing of multiple samples.Perform incubation with the primary antibodies at the following dilutions: anti-GFAP (1:500); anti-PN capsular (1:300); AlexaFLuor 568-IB4 (1:100), in PBS containing 5% NGS, for 60 min in a humid chamber or staining tray. Minimizing incubation volume can be conveniently performed by carefully draining excess PBS after the last wash by capillarity, placing the slide orthogonally with the slide edge contacting a paper towel. The slide is placed face-up, and 20 µls of the primary antibody solution is placed on each brain slice.",
    "A piece of parafilm or 13 mm – diameter coverslip is placed on top of the drop to enable antibody distribution over the slice and limit evaporation.Remove parafilm or coverslip.Wash samples three times in PBS.Perform incubation with the secondary Alexa-conjugated secondary antibodies, Phalloidin used at a 1:200 dilution, and DAPI used at 100 μg /ml final concentration for 60 min in a humid chamber or staining tray.Wash samples three times in PBS.Add 20 µl of DAKO fluorescence mounting medium above each slice and place a 13 mm-diameter coverslip.Allow DAKO to polymerize for at least 30 min in the dark. Samples should be stable to store in the dark for several weeks.Samples are analyzed using Eclipse Ti inverted microscopes equipped with a 60× oil immersion objective, a CSU1-W1 spinning disk confocal head, and an ORCA Flash 4.0 CMOS camera controlled by the Metamorph 7.7 software. The large chip of this camera (2,048 pxl × 2,048 pxl) enables visualization of large regions of brain slices, facilitating the analysis of rare events such as PN translocation across the BBB at early time-points. For example, at 6 h post-infection, we detected a PN translocation in the brain cortex in about 1 field out of one hundred 60× objective fields.Image acquisitionThe anti-PN capsular staining provides a clear contrast enabling the unambiguous detection of bacteria in brain slices (Figure 3). However, this unambiguous detection requires the 3D-analysis of the slice, and therefore acquisitions of Z-planes covering the 20 µm width of the brain slice. The procedure can become challenging when several fluorophores are analyzed because of the lengthening of the acquisition procedure and potential bleaching linked to repeated sample illumination; thus, particular basic care should be taken as for all quantitative acquisitions.",
    "We will not discuss here automation procedures enabling the 3D-acquisition of adjacent fields that can be advantageously applied when a programmable motorized microscopy stage is available.To limit oversampling of focal planes, and because PN roughly corresponds to 1 µm diameter cocci, an inter-plane spacing of 400 nm secures bacterial detection along the slice width.Acquisition parameters need to be determined empirically for each fluorophore. Because the acquisition parameters cannot be changed during the analysis of a given sample, they should be determined for each fluorophore and fixed prior to the beginning of large-scale acquisition. Ideally, a preliminary sample analysis on the dimmest and brightest object is used to set up the optimal exposure time while preventing saturation.When fluorescence intensity is limiting, favor increasing exposure time over laser power to help limit photobleaching. Acquisitions for fluorophores for which quantification of intensity is sensitive should be performed first.When the laser power and exposure time are set for each fluorophore, proceed with the acquisition of adjacent planes. Usual exposure time for average intensity fluorescent signals ranges between 200 and 400 ms for a C-MOS camera. If 50 focal planes are acquired for four different fluorophores, acquisition of each field may take from 2-4 min.Image analysisIn our analysis, we focus on PN translocation across brain parenchymal blood vessels and its effects on the astrocytic glial fibrillary acid protein (GFAP) intermediate filament network. Specifically, the parameters analyzed are the association of PN clusters with blood vessels and the fragmentation of GFAP associated with translocated PN clusters. For these parameters, while care is taken to preserve fluorescence to detect stained structures, quantification of fluorescence intensity is not performed. These considerations are important when converting the acquired Z-stacks into 2D-image maximal projections. GFAP staining shows a typical filamentous network, corresponding to astrocytic processes.",
    "Fragmentation of GFAP filaments is observed at the levels of processes contacting bacteria (Figure 3A, arrows). For bigger PN clusters, GFAP fragmentation is also observed at the distant vicinity of the bacterial cluster. We therefore quantified PN-induced GFAP fragmentation in the area associated with PN clusters delimited by the staining of capsular shedding (Figure 3B, dotted area).Perform maximal projections of stacks for all fluorophores in ImageJ. In the “Image” menu, select “Stacks,” then “Z project,” then “maximal projection.”Combine corresponding images by adjusting the luminosity/contrast display for each fluorophore. As shown in Figure 3A, PN clusters are clearly detected extruding from brain vessels into the brain matter at 6 h post-infection. An association of 100% with blood vessels labeled with isolectin IB-4 is established for all PN clusters detected at 6 h and 13 h post-infection (Figure 3).The GFAP channel image is converted into a 8-bit image.A binary mask of the image is performed by setting a threshold. In doing so, pay attention that the overlaid structures faithfully match the detected GFAP fragments (Figure 3).Use the PN capsular staining channel to delimit the area corresponding to capsular shedding.Transfer this area to the image corresponding to the GFAP channel.Run the particle analysis Fiji plug-in with the following parameters: particle size > 0.05 µm2 and a circularity index > 0.9.Normalize the number of detected GFAP fragments to the area.Statistical difference between animal groups is evaluated with a non-parametric test."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}