{
  "id": 19713,
  "origin_website": "Wiley",
  "title": "UniProt Tools: BLAST, Align, Peptide Search, and ID Mapping",
  "procedures": [
    "The UniProt website provides BLAST (UniProt Consortium, 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-bib-0005]), which finds regions of local similarity between sequences. This can be used to infer functional and evolutionary relationships between sequences as well as to help identify members of gene families. The BLAST tool page can be reached from a link in the header on all pages of the UniProt website.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Click on the “BLAST” link.\nThe link is on the left-hand side of the header bar on all UniProt pages, as shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0001]. Alternatively, BLAST can be accessed by clicking on the corresponding tile in the “Analysis Tools” section on the home page.\nYou will see the BLAST input page as shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0002].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/bb3df2fb-a85e-4ea2-91d3-5b5f7d02b503/cpz1697-fig-0001-m.jpg</p>\nFigure 1\nTools link in the UniProt website header.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c8844fa6-b686-4413-9530-ea4fa668b753/cpz1697-fig-0002-m.jpg</p>\nFigure 2\nBLAST query input page.\n3. To run a BLAST search, enter either a UniProt identifier into the first input box or a protein or nucleotide sequence into the second input box provided.\nFor example, enter “MTMR1_CAEEL” in the first input box.\nThese are the only mandatory input fields. You can choose to change parameters from a number of advanced options, as shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-tbl-0001].",
    "One of these options is the ability to select the target database to run your search against. Choosing the most appropriate target database allows you to tailor your BLAST search to the type of results you are interested in and to speed up the search. The drop-down menu allows you to restrict your BLAST query to 10 different datasets. The option “UniProtKB reference proteomes + UniProtKB/Swiss-Prot entries” is selected by default. In this case, the BLAST will run against proteins that belong to reference proteomes as well as proteins that have been reviewed (UniProtKB/Swiss-Prot).\nIf you would like to find similar proteins to your query that are well annotated in order to infer a potential function for your protein of interest, you can restrict your target database to “UniProtKB Swiss-Prot” to search only reviewed entries (UniProtKB/Swiss-Prot) from UniProtKB. If you would like to retrieve closely related proteins for which a PDB 3D structure is available, you can select “UniProtKB with 3D structure (PDB)” as the target database to run your BLAST search against.\nIf you would like to speed up the BLAST search, you can choose to search UniProt Reference Clusters (UniRef), which reduces redundancy by grouping sequences based on identity (Suzek et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-bib-0004]). There are three clusters, namely UniRef100, UniRef90, and UniRef50, that contain protein entries with 100%, 90%, and 50% sequence identity, respectively. For example, if you would like to find representative proteins that closely match your query, you can choose to run your search against UniRef90. For more information about UniRef clusters, see https://www.uniprot.org/help/uniref[href=https://www.uniprot.org/help/uniref]. You can also choose to search against the sequence archive UniProt Archive (UniParc), which is a repository of all known protein sequences, including those that have been removed from UniProtKB if highly redundant or of dubious provenance.",
    "If you are looking for sequence similarity matches from a particular taxonomy group or species, you can use the “Restrict by taxonomy” box. For example, you can find out if a human protein has orthologs in other mammals or specifically in mouse by restricting your target data to UniProtKB entries belonging to the group “Mammals” or the species “Mus musculus,” respectively. Either you can start typing the species or the group name, which will open a drop-down menu with suggestions, where you can select your group or species, or you can enter the NCBI taxonomic identifier for your group or species of interest. You can restrict the search to more than 800,000 different taxa.\nOther parameters that you can change are the E-threshold, matrix, filtering, gapped (yes or no), number of hits, and high-scoring segment pair (HSP) per hit. A brief description of each parameter is provided in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-tbl-0001]. To better understand the effects of E-threshold, matrix, and gapped search changes, refer to the Current Protocols article by Ladunga (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-bib-0002]).\nTable 1.\n                BLAST Advanced Options\ntable:\n﻿Advanced option,Significance\nDatabase,\"Database against which the search is performed; UniProtKB or clusters of sequences with 100%, 90%, or 50% identity.\"\nRestrict by taxonomy,Select a specific taxon against which the search is performed.",
    "E-threshold,\"The expectation value (E) threshold is a statistical measure of the number of expected matches in a random database. The lower the E-value, the more likely the match is to be significant. E-values between 0.1 and 10 are generally dubious and over 10 are unlikely to have biological significance. In all cases, those matches need to be verified manually. You may need to increase the E-value threshold if you have a very short query sequence, if you need to detect very weak similarities or similarities in a short region, or if your sequence has a low-complexity region and you use the “filter” option.\"\nMatrix,\"The matrix assigns a score for each position in an alignment. The BLOSUM matrix assigns a score based on the frequency at which that substitution is known to occur among consensus blocks within related proteins. BLOSUM62 is among the best of the available matrices for detecting weak protein similarities. The PAM set of matrices is also available. If “Auto” is set, the matrix will be selected depending on the query sequence length.\"\nFiltering,\"Low-complexity regions (e.g., stretches of cysteine in Q03751 or, in some cases, hydrophobic regions in membrane proteins) tend to produce spurious, insignificant matches with sequences in the database that have the same kind of low-complexity regions but are unrelated biologically. If “Filter low complexity regions” is selected, the query sequence will be run through the program SEG, and all amino acids in low-complexity regions will be replaced by an X.\"\nGapped,This will allow gaps to be introduced in the sequences when the comparison is done.\nHits,\"This limits the number of returned alignments. The user can limit the number of returned alignments to 50, 100, 250, 500, 750, or 1000. By default, the limit is set to 250.\"",
    "HSPs per hit,\"This limits the number of high-scoring segment pairs (HSPs), each of which has local alignment with no gaps that achieves one of the highest alignment scores in a given search.\"\n4. Click on the “Run BLAST” button to execute the query.\nThis will take you to the Tool results page, as shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0003], where you can see the progression of your BLAST search. Once the search is finished, click on “completed” to open the BLAST results page, which is shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0004].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/26268920-11ad-4a35-9c60-9f64d3e12623/cpz1697-fig-0003-m.jpg</p>\nFigure 3\nTool results dashboard page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/8903ce14-b674-4a69-92c1-fa4323303ca9/cpz1697-fig-0004-m.jpg</p>\nFigure 4\nBLAST results page.",
    "As an alternative to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0001], queries can be submitted to the BLAST tool directly through UniProt search results pages and when you come across a sequence you would like to analyze using a sequence similarity search. This allows for a flexible workflow between browsing data and analyzing data.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Choose the search dataset using the drop-down menu to the left of the search box. Select “UniProtKB,” “UniRef,” or “UniParc.”\n3. Enter a query in the search box, for example “insulin,” and click on the “Search” button.\nBefore seeing the results, you will be asked how you would like to view them. There are two display options, “Cards” or “Table,” which offer different levels of information. The “Table” view provides the list of protein entries matching your query, with the protein name(s), gene name(s), species, and protein length in a table format. The “Cards” view contains the same information, but in addition, it provides an overview of the type of annotation in the entry, for example the number of publications or how many 3D structures are associated with the entry. Both views provide checkboxes to select entries.\nFigure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0005] shows the search results page in a table format.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e49e9ed4-be7c-4e7c-8456-3977a3ad887d/cpz1697-fig-0005-m.jpg</p>\nFigure 5\nUniProtKB search results page.\n4. To run a BLAST search for a protein in the search results, click on the checkbox in the left-hand column for that protein row.\n5. Click on the “BLAST” button just above the search results table, as shown in Figure 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0006], which will open the BLAST page, from where the BLAST can be launched as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0001], steps 3 and 4.",
    "Alternatively, click on a UniProt entry in the results table to be taken to the entry page, which also provides a “BLAST” button for direct submission, as shown in Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0007].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a2ae16d1-a0b4-49a8-8c35-66f77b0a1227/cpz1697-fig-0006-m.jpg</p>\nFigure 6\nSelecting a protein to BLAST from the results page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ca56ce48-9855-4a80-a1fe-53809f6f731d/cpz1697-fig-0007-m.jpg</p>\nFigure 7\nRunning BLAST on a protein from the protein entry page.",
    "As an alternative to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0002], queries can be submitted to the BLAST tool directly through the UniProt basket feature. The UniProt basket allows you to store entries from UniProtKB, UniRef, or UniParc. You can use the basket to build a set of your proteins across different searches. The basket then allows you to download your dataset to access analysis tools (i.e., BLAST, Align, and Retrieve/ID Mapping). Your basket is saved as long as you do not clear your cookies.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Choose the search dataset using the drop-down menu to the left of the search box. Select “UniProtKB,” “UniRef,” or “UniParc.”\n3. Enter a query in the search box, for example “insulin,” and click on the “Search” button.\nYou will see a search results page as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0005].\n4. For the entry of interest, click on the checkbox to the left of its accession and then click on “Add” next to the basket icon button at the top of the results table, as shown in Figure 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0008].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0444dd83-6e4c-4185-8321-94bf1a357af5/cpz1697-fig-0008-m.jpg</p>\nFigure 8\nAdding protein entries to the basket.\n5. When ready to analyze the entries in the basket, click on the basket to open it.\nYour entries will be under their dataset tab (UniProtKB, UniRef, or UniParc).\n6. Click on the checkbox to the left of the entry of interest and then click on “BLAST,” as shown in Figure 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0009].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d6184d11-b9bc-45aa-b965-bb0c09f3306b/cpz1697-fig-0009-m.jpg</p>\nFigure 9\nRunning BLAST from the basket.",
    "The UniProt website provides a multiple sequence alignment tool for proteins called “Align.” This tool runs the Clustal Omega algorithm to find areas of similarity in the entries being aligned. This can be used to find conserved residues and regions that can help infer evolutionary and functional relationships (see Current Protocols article: Simossis, Kleinjung, & Heringa, 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-bib-0003]).\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Click on the “Align” link.\nThe link is available in the header bar on all UniProt pages as shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0001]. Alternatively, “Align” can be accessed by clicking on the corresponding tile in the “Analysis Tools” section on the home page.\nYou will see the Align input page as shown in Figure 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0010].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6cfd18e4-134e-4d56-8e09-b680e7700a83/cpz1697-fig-0010-m.jpg</p>\nFigure 10\nAlign query input page.\n3. To execute the multiple sequence alignment, enter either the UniProt identifiers into the first input box or the protein sequences in FASTA format into the second sequence input box provided and click “Align sequences.”\nFor example, paste the UniProt identifiers “MTMR1_HUMAN,” “MTMR1_MOUSE,” and “MTMR1_CAEEL” into the first box.\nThese are the only mandatory input fields.\nFor each UniProt identifier entered, the corresponding sequence in FASTA format is retrieved and appears in the second box, as shown in Figure 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0011].",
    "In the advanced parameters, you have two options that allow you to choose the output sequence order or change the number of iterations. The iteration parameter refers to the number of guide-tree/HMM iterations that can be performed after the initial alignment. It involves re-running the alignment while removing and adding back sequences to see if the alignment score can be improved. It is appropriate to increase the number of iterations when the default number of iterations (here, 0) does not produce a satisfactory alignment; however, it is time consuming. Whereas for protein sequences that are similar in length and identity, often, no iteration is sufficient to generate an accurate alignment, when aligning a large number of sequences or sequences with low similarity, increasing the number of iterations may help to improve accuracy.\nThis will take you to the Tool results page, as shown in Figure 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0012], where you can see the progression of your alignment.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3be0871b-d685-41c8-89a4-1f1ee682a0fc/cpz1697-fig-0011-m.jpg</p>\nFigure 11\nAlign query input page with entries in FASTA format.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ac202cca-0d41-43f5-a393-0c9f45ad395d/cpz1697-fig-0012-m.jpg</p>\nFigure 12\nTool results dashboard page.\n4. Once the alignment is finished, click on “completed” to open the Align results page, which is shown in Figure 13[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0013].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/792d5a16-a04f-4b26-adf4-7fae1975a70a/cpz1697-fig-0013-m.jpg</p>\nFigure 13\nAlign results page.",
    "As an alternative to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0004], queries can be submitted to the Align tool directly through UniProt search results pages.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Select “UniProtKB” as the search dataset using the drop-down menu to the left of the search box.\n3. Enter a query in the search box, for example “insulin,” and click on the “Search” button.\nYou will see a results page as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0005].\n4. Click on two or more checkboxes to align these protein entries, as shown in Figure 14[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0014].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/fb7b81b8-05e1-46b2-85f7-db2f1350c19b/cpz1697-fig-0014-m.jpg</p>\nFigure 14\nAlign multiple protein sequences from the UniProtKB results page.\n5. Click on the “Align” button just above the search results table.\nThis will take you to the Align input page as shown in Figure 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0011].\n6. Click the “Align sequence” button.\nThis will take you to the Tool results page as shown in Figure 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0012], where you can see the progression of your alignment.\n7. Once the alignment is finished, click on “completed” to open the Align results page.",
    "As an alternative to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0004], queries can also be submitted to the Align tool directly through the UniProt basket feature.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Select “UniProtKB” as the search dataset using the drop-down menu to the left of the search box.\n3. Enter a query in the search box, for example “insulin,” and click on the “Search” button.\nYou will see a results page as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0005].\n4. For entries of interest, click on the checkboxes to the left of their accession numbers in the results table and then click on “Add” next to the basket icon at the top of the results table.\nYou can store UniProt entries in a basket over multiple search sessions and then align them later.\n5. When ready to analyze the entries in the basket, click on the basket to open it, as shown in Figure 15[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0015].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f0d81767-60d5-4918-bbdc-a0d9e8c271ed/cpz1697-fig-0015-m.jpg</p>\nFigure 15\nAligning proteins from the basket.\n6. Click on the checkboxes to the left of the entries to be aligned and then click on “Align.”\nThis will take you to the Align input page as shown in Figure 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0011].\nYou need to select two or more entries to be able to create a multiple sequence alignment.\n7. Click the \"Align sequence\" button.\nThis will take you to the Tool results page as shown in Figure 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0012], where you can see the progression of your alignment.\n8. Once the alignment is finished, click on “completed” to open the Align results page.",
    "The UniProt website provides a tool that allows you to upload short peptide sequences of at least three residues and find all UniProtKB sequences that have an exact match to the query sequence. These peptide sequences can come from proteomics experiments or from the design of peptides for antibody production, for example.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Click on the “Peptide search” link.\nThe link is available in the header bar on all UniProt pages, as shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0001]. Alternatively, “Peptide search” can be accessed by clicking on the corresponding tile in the “Analysis Tools” section on the home page.\nYou will see the “Peptide search” input page as shown in Figure 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0016].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/de0eeb24-cf5e-465c-b28e-86f726bc2530/cpz1697-fig-0016-m.jpg</p>\nFigure 16\nPeptide Search query input page.\n3. Enter the peptide(s) of interest into the input box as shown in Figure 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0017] and click on the “Run Peptide search” button.\nIn the “Peptide search” input page, you have the option to restrict your search to a specific species using the “restrict by taxonomy” box. For example, in Figure 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0017], the search has been restricted to mouse entries.\nIn the advanced parameters section, you can also specify whether you would like the tool to treat isoleucine and leucine as equivalent or to restrict the search to Swiss-Prot reviewed entries only.\nThis will take you to the Tool results page as shown in Figure 18[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0018], where you can see the progression of your peptide search.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3bb04fa8-a2a7-4d00-83c4-caa255bd403e/cpz1697-fig-0017-m.jpg</p>\nFigure 17\nTaxonomy restriction in the Peptide Search query input page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/fd872b83-2bd2-42f8-9c73-c501c56a57ef/cpz1697-fig-0018-m.jpg</p>\nFigure 18\nTool results dashboard page.\n4. Once the search is finished, click on “completed” to open the results page, which is shown in Figure 19[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0019].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a32ff39a-988d-4f61-b99a-2401af50e674/cpz1697-fig-0019-m.jpg</p>\nFigure 19\nPeptide Search results page.",
    "The UniProt website provides a tool that allows you to upload a list of UniProt identifiers and batch-retrieve all the corresponding UniProt entries. It allows you to convert or “map” your identifiers from UniProtKB to over 100 external databases that UniProt is cross-referenced to and vice versa (e.g., Ensembl, PDB, RefSeq; Huang et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-bib-0001]). This covers a number of databases from different categories, including databases covering sequence, 3D structure, protein-protein interaction, protein family and group, chemistry, post-translational modification, and genome annotation, among others. This tool is called “Retrieve/ID Mapping.”\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Click on the “ID Mapping” link.\nThe link is available in the header bar on all UniProt pages, as shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0001]. Alternatively, “ID Mapping” can be accessed by clicking on the corresponding tile in the “Analysis Tools” section on the home page.\nYou will see the “Retrieve/ID Mapping” input page, as shown in Figure 20[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0020].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/462772c0-8e86-49dd-badf-38c971cdba41/cpz1697-fig-0020-m.jpg</p>\nFigure 20\nRetrieve/ID Mapping query input page.\n3. To retrieve functional information or look at the sequences for a list of UniProt IDs (for example, Q9VR99, Q9VEZ5, Q03017, and P48607), paste the list into the input box provided or upload a file.\n4. Leave “From” and “To” as “UniProtKB” and click the “Map IDs” button.\nThis will take you to the Tool results page as shown in Figure 21[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0021], where you can see the progression of your mapping.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/bb628042-1fea-409f-ac61-1dd062d48f66/cpz1697-fig-0021-m.jpg</p>\nFigure 21\nTool results dashboard page.\n5. Once the mapping is finished, click on “completed” to open the results page as shown in Figure 22[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0022].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/46864d23-f619-43aa-8189-a0450557ba12/cpz1697-fig-0022-m.jpg</p>\nFigure 22\nUniProtKB ID mapping results page.",
    "6. To map a list of UniProt IDs to IDs from an external database such as Ensembl, RefSeq, or one of the model organism databases (or vice versa), upload or paste in the IDs. Then, select the source database in the “From” drop-down menu and the target database in the “To” drop-down menu.\nFor example, if you would like to retrieve the corresponding IDs from the FlyBase database for the four Drosophila melanogaster proteins mentioned above, paste the UniProt IDs Q9VR99, Q9VEZ5, Q03017, and P48607 in the input box and select “FlyBase” in the “To database” drop-down menu as shown in Figure 23[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0023].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e9fa4a63-d293-44cb-9c63-ca6f54608f80/cpz1697-fig-0023-m.jpg</p>\nFigure 23\nMapping UniProtKB IDs to an external database and ID Mapping results page.\n7. Click the “Map IDs” button as shown in Figure 23[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0023].\nYou will get a results page with a table showing the mapping between your input IDs and their corresponding IDs from your selected database, as shown in Figure 23[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0023].",
    "As an alternative to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0008], queries can be submitted to the “Retrieve/ID Mapping” tool directly through UniProt search results pages, BLAST results pages, or Align results pages.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Select “UniProtKB” as the search dataset using the drop-down menu to the left of the search box.\n3. Enter a query in the search box, for example “insulin,” and click on the “Search” button.\nYou will see a results page as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0005].\n4. Click on two or more checkboxes as shown in Figure 24[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0024].\nSimilarly, proteins can be selected in the BLAST or Align results pages.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2b2169c3-5876-4074-a8ba-bcecc1040b76/cpz1697-fig-0024-m.jpg</p>\nFigure 24\nMapping UniProtKB IDs from the results page.\n5. Click on the “MapIDs” button just above the search results table.\nThis will take you to the “Retrieve/ID Mapping” page as described in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0008], step 2.\nSimilarly, the “MapIDs” button is available from the BLAST or Align results pages.",
    "Queries can be submitted to the “Retrieve/ID Mapping” tool directly through the UniProt basket. The UniProt basket allows you to store entries from UniProtKB, UniRef, or UniParc. You can use the basket to build a set of your proteins across different searches. The basket then allows you to download your dataset to access analysis tools (i.e., BLAST, Align, and Retrieve/ID Mapping). Your basket is saved as long as you do not clear your cookies.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Choose “UniProtKB” for the search dataset using the drop-down menu to the left of the search box.\n3. Enter a query in the search box, for example “insulin,” and click on the “Search” button.\nYou will see a results page as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0005].\n4. For entries of interest, click on the checkboxes to the left of their accession numbers in the results table and then click on “Add” next to the basket icon at the top of the results table, as shown in Figure 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0008].\n5. When ready to analyze the entries in the basket, click the basket to open it.\n6. To map the UniProt IDs to an external database from the basket, click on the checkboxes to the left and click on the “Map IDs” button in the basket, as shown in Figure 25[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0025].\nThis will take you to the “Retrieve/ID Mapping” page as described in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0008], step 2.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c313e905-4706-4de5-8e29-a1d4507eae85/cpz1697-fig-0025-m.jpg</p>\nFigure 25\nMapping UniProtKB IDs from the basket.",
    "As an alternative to Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-prot-0008], queries can be submitted to the “Retrieve/ID Mapping” tool directly through the UniProt search box.\nNecessary Resources\nAn up-to-date web browser\n1. Go the UniProt home page at http://www.uniprot.org/[href=http://www.uniprot.org/] using an up-to-date web browser.\n2. Click on “List” on the left-hand side of the general search box as shown in Figure 26[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.697#cpz1697-fig-0026].\nThis will open the “Retrieve/ID Mapping” box, where you can paste the IDs that you would like to map.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/67a18f76-4aa1-4cf3-a171-3783bf9e8d8a/cpz1697-fig-0026-m.jpg</p>\nFigure 26\nMapping UniProtKB IDs from the text search box."
  ],
  "subjectAreas": [
    "Bioinformatics"
  ],
  "bigAreas": [
    "Bioinformatics & Computational Biology"
  ]
}