{
  "id": 8448,
  "origin_website": "Jove",
  "title": "Delivery of Antibodies into the Brain Using Focused Scanning Ultrasound",
  "procedures": [
    "All animal experiments were approved by the animal ethics committee of the University of Queensland.\n1. In-house microbubble preparation\nWeigh out a 9:1 molar ratio of 1,2-distearoyl-sn-glycero-3-phosphocholine and 1,2-distearoyl-sn-glycero-3-phosphoethanolamine-N-[amino(polyethyleneglycol)-2000] (ammonium salt). 0.5 mg of lipid mixture is required per 1 mL of microbubble solution. Alternatively, lipids can be bought already in chloroform, if using pre-dissolved lipids proceed to step 1.3.\nDissolve the lipid in a small volume of chloroform in a glass beaker.\nEvaporate the chloroform with an evaporator or a nitrogen stream.\nRehydrate the dried lipid film with 10 mL of PBS + 10% glycerol + 10% propylene glycol solution that has been filtered through 0.22 µm filter.\nPlace the rehydrated lipid solution in a water bath sonicator set to 55 ˚C (above the melting temperature of the lipids) and sonicate until fully dissolved.\nAliquot lipid solution into autoclaved 1.5 mL HPLC vials and screw on the septa caps.\nAspirate all of the air in the vial with a 5 mL syringe equipped with a 27 G needle and create a vacuum in the vial.\nAdd octofluoropropane to the vial with the included syringe, drawing up the gas from the canister. Fill the vial with 1-2 mL of octafluoropropane by reading the volume in the syringe.\nSeal each vial with paraffin film and refrigerate.\nOn the day of the experiment, bring the vial to room temperature, add 0.5 mL of 0.9% NaCl solution to the vial, then place the vial in an amalgamator and agitate for 45 s (preset time) to produce the microbubbles.\n2. Microbubble quality control using a coulter counter\nTake the microbubble solution out of the amalgamator and vent the gas from the vial by piercing the septa with a 19 G needle.",
    "Dilute the microbubble solution by performing two-step 1:5,000 serial dilutions by adding 100 µL of microbubble solution into 5 mL of filtered flow solution using a 1 ml syringe with 19 G needle, and then taking 100 µL of 1:50 diluted microbubble solution and pipetting into 10 mL filtered flow solution in a cuvette using a pipette.\nCheck that the electrolyte tank has sufficient flow solution and that the waste tank is empty.\nPlace the cuvette in the coulter counter platform and lock it into place. Use a 30 µm aperture for sample acquisition.\nIn the software, load the standard operating method (SOM), then select Edit SOM | concentration. Enter 5000x dilution.\nIn the software, choose a suitable file name. For example, microbubble_1_date.\nLoad and secure the cuvette into the platform.\nIn the software select Run| Preview and verify that the sample concentration is less than 10%. If this number is higher than 10%, perform a new dilution of the microbubbles with a higher dilution factor.\nSelect 'Start' to begin an acquisition of the sample to obtain the initial readout.\nRinse the aperture of the Coulter counter with filtered flow solution after each measurement. Repeat steps 2.2-2.9 to obtain 3 replicates.\nPlace a cuvette with diluted microbubble solution into a sonicator water bath and sonicate for 30 s.\nMeasure the solution with sonicated microbubbles and label as blank.\nIn the software, subtract the final readout from the initial readout. This subtracts any particles that are not microbubbles and do not contain gas.\nSelect Display Results in the software, to display the microbubble concentration, size distribution, average size, and volume concentration.\n3. Fluorescent antibody labeling\nObtain a 1 mg/mL solution of mouse IgG in PBS without any additives.",
    "Label 1 mg of mouse IgG with AlexaFluor 647 in 0.1 M sodium bicarbonate buffer by following the manufacturers' instructions located in the kit. This amount of fluorescently labeled IgG is sufficient to perform this procedure on 5-7 adult mice where a 5 mg/kg dose of antibody is administered.\nAdd the dye to the solution of IgG in 0.1 M sodium bicarbonate buffer and incubate for 15 min at room temperature.\nPurify the fluorescently labeled antibody by pipetting the antibody solution into a spin column and centrifuging at 1,000 x g for 5 min. Free dye will remain in the column bed.\nUse a spectrophotometer to measure the protein concentration. Measure the absorbance of the conjugate solution at 280 nm and 650 nm (A280 and A650). Calculate the concentration of protein in the sample using the equation:\nProtein concentration (M) = [A280 - (A650 x 0.03)] x dilution factor / 203,000.\nUse a spectrophotometer to calculate the degree of labeling using the equation:\nmoles dye per mole protein = A650 x dilution factor / 239 000 x protein concentration (M).\n\tNOTE: An acceptable degree of labeling is 3-7 moles dye per mole protein and typically obtained degree of labeling is around 6.\n4. Ultrasound set-up\nUsing the focused ultrasound system, add the 5 mm spacer to the water bolus to position the ultrasound focus 9 mm below the bottom of the water bolus.",
    "Fill the water bolus with approximately 300 mL of deionized water that has been degassed with an inline degasser for 20 min (oxygen content should be below 3 ppm). Place the annular array into the filled water bolus and use a dental mirror to check that there are no air bubbles on the surface. If present on the surface, remove the annular array and replace it in the water bolus.\nLaunch the application software. In the waveform menu, select Set waveform duty cycle. Settings are PRF (Hz) 10, duty cycle 10%, focus 80 mm, center frequency 1 MHz, amplitude (MPa peak negative pressure) 0.65 MPa, mechanical index = 0.65. Press Set to define the waveform and store it in memory.\n\tNOTE: The focused ultrasound system is pre-calibrated by the manufacturer from measurements taken by a calibrated hydrophone.\nIn the focused ultrasound system software, define a treatment plan. This requires defining a treatment region consisting of multiple individual treatments sites, and defining actions to be taken at each of those treatment sites. In this case, the treatment zone is one hemisphere of the mouse brain.\nIn the motion controller window, go to the Scan tab and Enter start, stop and increment value for motion in the x dimension, and start, stop and increment value for motion in the y direction. Enter values for X: start -4, stop 3.50 and Y: -3.00, stop 3, Increment 1.5, # loops: 1.",
    "Define the actions for treatment sites. In the motion controller window, select the Event button. In the Script Editing Window, select a list of actions that will be executed in the order selected at each treatment site. Set Movement Type to raster grid at the top of the script window. In the events tab select Add Actions to move them to the script panel, and add Move Synchronously, Start trigger arb, wait, Stop trigger arb. Click on the wait action and select a wait time of 6, 000 ms.\n\tNOTE: These settings will make the treat a 6 x 5 grid of treatment spots spaced 1.5 mm apart, with each spot having a treatment duration of 6 s. The total duration to sonicate a mouse brain is approximately 3 min. This size treatment grid is suitable for adult C57/Bl6 mice weighing approximately 30 g. The size of the grid of treatment spots can be adjusted up or down depending on the size of the mouse.\n5. Animal preparation\nWeigh the mouse with a balance accurate to 0.1g.\nAnesthetize mouse with 90 mg/kg ketamine and 6 mg/kg xylazine intraperitoneally. Test for absence of reflexes with a toe pinch. Alternatively, mice can be anesthetized with isoflurane using an appropriate inhalational anesthetic apparatus with an appropriate face mask. If using isoflurane, the mouse should be placed on a heat pad during the ultrasound to prevent hypothermia.\nUse an electric razor to shave the hair from the head of the animal, then apply hair removal cream with a cotton bud, leave on for 2-3 min or until the hair is wiped away clean with a damp piece of gauze. Take care that the hair removal cream does not get in the eyes of the mouse.",
    "Mark the center of the mouse’s head with a permanent marker. The transducer has a hole in its center and the transducer focus and focal spot can be aligned visually.\nFill a small weigh boat that has previously had the bottom cut off and replaced with plastic wrap glued to the bottom of the weigh boat with ultrasound gel. This serves as an 8 mm spacer and provides good coupling to the head of the mouse and allows visual inspection of the focus of the transducer aligned with the head of the mouse.\n6. Microbubble preparation\nWarm a microbubble vial to room temperature. To activate, add 0.5 mL of 0.9% NaCl solution to the vial and place in an amalgamator to agitate for 45 s to produce the microbubbles.\nVent the vial by piercing the septa with a 27 G needle.\n7. Ultrasound treatment\nInvert the vial of microbubbles and gently draw up 1 µL/g bodyweight of the solution. To this add solution of fluorescently labeled antibody and mix gently in the syringe. The maximum volume injected is 150 µL.\n\tNOTE: In-house prepared microbubbles are approximately 60-fold less concentrated than the clinically used (e.g., Definity microbubbles). Adjust the volume or concentration such that the number of microbubbles injected are similar to those clinically used (ie. Definity 1.2 x 108 microbubbles/kg body weight).\nInject the microbubble and antibody solution retroorbitally, taking care to inject gently and slowly. Then, apply ophthalmic ointment to the mouse's eyes.\nPlace the mouse in the head holder (see Table of Materials) and fix the nose of the mouse. Then place the ultrasound gel-filled small weigh boat on top of the head.\nLower the water bolus until it sits on top of the ultrasound gel in the weigh boat.",
    "Use the joystick to move the transducer focus to the center of the head. Select Reset Origin in the motion tab.\nSelect complete scan. Steps 7.3-7.6 will take 2 min.\nFor consistency, set a timer to ensure a 2 min delay between injecting microbubbles and selecting complete scan.\nAfter the treatment is complete, apply ophthalmic ointment to the eyes and place mouse in a warmed recovery chamber. If hypothermia is observed during the procedure, a warming pad can be placed under the mouse to provide supplemental heat during the procedure.\n8. Tissue harvesting and processing\nAt the timepoint of interest after ultrasound delivery (at least 1 h to detect high levels of antibody in the brain) deeply anaesthetise the mouse with an overdose of Pentobarbitone solution (100 mg/kg) and transcardially perfuse the mouse with 30 mL PBS. A good perfusion is required to specifically detect fluorescently-labelled antibodies that have been delivered to the brain.\nCollect the brain and fix by immersion in 4% PFA for 24 h at 4 °C, then wash with PBS.\nImage the brain in an infrared scanner by placing the brain on the tray and by acquiring an image in the 700 nm channel.\n\tNOTE: After fixation, the brain is removed from the PFA, washed in PBS and sectioned. Alternatively, it can be placed in ethylene glycol cryoprotectant solution for 24 h at 4 °C or until submerged, and then moved to a new cryoprotectant containing vial and placed at -20 °C for long term storage.\nSection the brain cold in PBS using a vibratome. Glue the brain to the platform and cut 30-40 µm sections and collect into PBS.",
    "NOTE: Lysosomal autofluorescence (prevalent in sections from animals older than about 12 months) should be bleached by overnight illumination of the sections in a light chamber box, at room temperature and in PBS containing azide (0.02%) to block bacterial growth.\n9. Tissue staining and image acquisition\nTransfer sections to blocking solution (5% BSA in 0.2% Triton/PBS) for 2 h at room temperature, then wash the sections 3x by replacing the solution with 0.2% Triton/PBS.\nIncubate sections at 4 °C overnight with the primary antibodies against Iba1 (dilution 1:1,000) and CD68 (dilution 1:500), in 0.2% Triton/PBS, followed by 3x washes with 0.2% Triton/PBS.\nIncubate sections for 2 h at room temperature with fluorescent secondary antibodies (dilution 1:500), followed by 3x washes with 0.2% Triton/PBS only.\n\tNOTE: The nuclei can also be stained using DAPI solution (0.5 µg/mL).\nTransfer the sections to a slide and coverslip with hard-set mounting media. Allow sufficient time for the mounting medium to solidify before visualization and image acquisition (overnight).\nWith a confocal microscope obtain z-stack images (at least 10 µm depth and 0.3 µm step size, 10 images per animal) of the ultrasound targeted brain area by using a confocal microscope and an objective of at least 40x magnification.\n\tNOTE: Be careful to acquire images within the signal dynamic range, avoiding under-/over-exposure. Save the image files in the corresponding software format used by the microscope.\n10. Image analysis\nConvert the z-stack microscopy files using the image analysis software file importer.\nOpen the converted files into the software and adjust the intensity of the Iba1 channel to observe microglial cells.\nCrop a single microglial cell by drawing a box around it, select ‘crop’ and save the new file.\nBuild the 3D surface rendering of the IBA1 signal by:",
    "Open the single cell Imaris file generated in the previous step.\nAdd a surface to the file.\nSelect the channel corresponding to the Iba1 staining.\nApply a threshold that should overlap the Iba1 staining\nSelect only the structure of interest that is forming the microglial cell of interest\nFinalize the process\n\t\nObtain and record the volume of the Iba1 staining\nBuild the 3D surface rendering of the CD68 staining\nInside the IBA1 surface subfile, mask the CD68 channel and remove the voxels outside of the IBA1 staining\nAdd a new surface to the file\nSelect the channel corresponding to the CD68 staining\nApply a threshold that should overlap the CD68 staining and is as closely as possible matching the staining volumes\nFinalize the process, as only the intra-microglial CD68 structures will be present in this file and, thus, they do not require another threshold filtering step\nObtain and record the number and average volume of the CD68 positive structures\nCalculate the relative volume of CD68 structures per its corresponding IBA1 structures as a measure of microglial activation in a phagocytic state.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}