{
  "id": 9808,
  "origin_website": "Jove",
  "title": "Ultrasound-Guided Microinjection into the Mouse Forebrain In Utero at E9.5",
  "procedures": [
    "Part 1. Prepare the Surgical Area\nIf working with biohazardous reagents (e.g. retroviral vectors), the surgery should be performed inside a Biosafety II cabinet (BSC).  The ultrasound backscatter microscope (UBM) should sit next to the BSC, with the transducer inside the BSC, and held in place by a motor controlled support on a specially designed surgical stage.  The components needed to construct the stage shown in the video are listed on line.  This list, together with images of the stage from several angles (available on request), should permit construction.\nThe opening and closing of the laparotomy (surgical procedure in which the abdominal cavity is cut open to permit access to the internal organs) is usually performed on an absorbent pad with plastic backing.  Prior to surgery all of the necessary tools (e.g. razor, surgical scissors, forceps, loaded autoclip applier, etc), and materials (e.g. PBS, sutures, anesthetic, the mouse holder and overlying plate, etc) should be sterilized and placed in the surgical area.  Limiting the amount of time the incision is open is important for maximizing the chances of success with the surgery.  All animal handling should be performed with gloves that have been disinfected with MB-10 solution, or the equivalent.  Repeated disinfection should be performed as needed to assure that the gloves are sterile.\nPart 2. Mouse Anesthesia\nFill a 1 cc syringe with the anesthetic solution containing 1 part Nembutal (50 mg/ml pentobarbital) to 4 parts filtered sterilized 25 mg/ml magnesium sulfate in PBS.  This will result in a solution that is 10 mg/ml pentobarbital and 20 mg/ml magnesium sulfate.  Each mouse should be weighted individually, and injected with 90 mg of pentobarbital per kg of bodyweight (e.g., a 28 gm mouse would be injected with 250 μL).",
    "Inject into the abdomen (intraperitoneal, IP) of a pregnant mouse at embryonic day (E) 9.5 (can use other ages as needed) penetrating both the skin and abdominal muscle.  Allow 8-12 minutes for the mouse to become non-responsive.  Adequate anesthesia should be confirmed by the relaxed posture of the animal, and lack of movement in response to tail and toe pinches.  Gently pinching between the finger nails is highly sensitive, and lack of any response to such pinching indicates that the animals is sufficiently anesthetized.  Note even animals that are completely unresponsive to tail and toe pinches may some times twitch slightly in response to the initial surgical incision.  However, this is a reflexive response and does not indicate inadequate anesthesia.  Petroleum-based ophthalmic balm should be applied to the eyes of the mouse to avoid drying during surgery.\nSet-up the surgical area and the ultrasound machine while waiting for the mouse to become anesthetized.  Since the use of retrovirus or lentivirus requires BSL2 containment, as stated above the viral injections should be performed in a Biosafety II Cabinet.  In addition, all solutions and disposable materials that comes into contact with the virus should be decontaminated with a 10% bleach solution.  The surgical tools and ultrasound equipment should be treated with a sterilizing solution such as MB-10 (http://www.quiplabs.com/mb10.htm[href=http://www.quiplabs.com/mb10.htm]), or an equivalent used by the facility in question.\nPart 3. Exposure of the Embryos",
    "If possible (depending upon the constraints of the given animal facility and available space) it is preferred to have the surgical preparation area in a separate location from the surgical area.  This will minimize the chances for cross-contamination between animals.  To initiate the surgery, place the animal onto its back on a sterile absorbent surface and wash the abdominal area thoroughly with 70% ethanol.  More extensive presurgical treatments can be employed (e.g., successive rounds of Betadine and 70% ethanol washes), but in our experience this is not necessary for this type of rodent survival surgery.  Using a double edge razor, shave the hair from the abdomen in an area of approximately 1 inch wide and 1.5 inches long.  Use short quick motions with the razor at approximately a 45° angle.  It is important that the surgical area be suitably treated, but not subjected to excessive wetting, as this can result in needless chilling of the animal, and possibly even hypothermia.\nUsing fine surgical scissors make a 1\" longitudinal incision through the skin first, and then through the abdominal muscle of the animal (cutting through connective tissue holding the skin to the muscle will help with the second incision).  Note that throughout the procedure care should be taken to assure that the surgical tools remain sterile, and treatment with disinfectant should be performed as needed (i.e. if the tool tips come in contact with non-sterile material).",
    "Using forceps carefully draw out uterine horns, and record the number of embryos on each side.  While leaving two adjacent embryos exposed (selection of which two will depend upon the configuration on each side), place most of the uterine horns back into the animal. In this context, two embryos will be exposed at a given time and bathed in PBS, while the mother remains on her back.\nPlace the animal on its back into the plexiglass holder where it will be during the surgery (Figure1A)*.  Next, lower the 10cm tissue culture dish** (which should be disinfected with MB-10 prior to use) down over the mother, with a pair of forceps placed slightly through the green silastic membrane (made using L RTV silicone rubber base, and curing agent; Dow-Corning product numbers 3142761 and 2156946, respectively).  As you lower the plate down over the animal, use the forceps to grip the uterine tissue between the two embryos to be injected, and gently pull them through the membrane.  At the same time, the plate is lowered completely down onto the holder, and the thumbtacks are pushed in to hold it in place.  Pre-warmed (to 37°C) PBS is then added to the dish to completely cover the embryos.\nPlace the injection stage containing the animal and exposed embryos under the ultrasound probe (Figure1A) to create real-time imaging of the exposed embryos through the uterine wall (Figure1B).  The probe is then lowered (using the motorized controls) into the PBS bath directly over the embryos to be imaged.  Images can be obtained when the probe is approximately 2-3 mm away from the embryos.  It is very important to make sure that the probe head does not hit the embryos as it oscillates back and forth to collect images.",
    "* The holder the mother rests in during surgery can easily be made by a machine shop. It should include a wide plexiglass base, with two plexiglass sides glued on top, and a space in between them (wide enough for the mouse to fit while lying on its back).  The sides should have a valley ground out of them, which is then filled with black wax (e.g. from a dissection tray).  That wax serves as the material into which thumbtacks will be pressed to hold down the plate of PBS that the embryos are bathed in during injection.\n** 10cm bacterial dishes should have a hole (approx. 2cm in diameter) punched out of the center of the bottom (this can be done with a Heavy Duty Portable Punch and a 13/16th inch circular die: http://roperwhitney.com/punching/2-1011.cfm[href=http://roperwhitney.com/punching/2-1011.cfm]).  In addition, two small holes on either side of the center hole (about 1.5cm away) should be burned out with a flame-heated needle (or they could be made with a drill of course).  These holes are then covered with vacuum grease and will be where the thumbtacks that hold the plate onto the holder push through into the black wax.  The vacuum grease is to prevent the PBS from leaking out.\nPart 4. Loading Virus into a Microinjection Needle",
    "Fashion a microinjection needle by beveling a 1mm (inner diameter) pulled glass capillary.  The sharpness of the needle is critical, and working with an insufficiently sharp needle can seriously compromise penetration of the uterine wall and the amnionic sac, and can lead to experimental failure.  The sharpened needle is then placed into the pipette holder, which is connected via tubing to a 25 μL microsyringe mounted in a manual infusion/withdrawal pump (other devices can be used to regulate the loading and discharging of the needle, but this is what is shown in the video).  For optimal responsiveness (to avoid the expansion and compression associated with an air filled system), the microsyringe, tubing, and needle should be filled with mineral oil.",
    "Prior to loading the needle make sure there are no air bubbles in the system from the syringe all the way to the tip of the needle.  Then draw back a small air bubble (1-2 mm in length) into the needle prior to starting to load virus.  This air pocket helps maintain separation between the virus and the mineral oil.  The viral stock to be injected should contain polybrene at a final concentration of 0.08 mg/ml (for more information on virus production please refer to references 1, 2).  Note that concentrated retroviral stocks generally contain a significant amount of particulate matter, which contains the majority of the infectious material, and so cannot be filtered out without a 5- to 10-fold drop in titer.  Also, depending upon the preparation, the viral stock may be viscous from the genomic DNA of lysed packaging cells (especially true if using 293 cells to generate MLV/VSV pseudotyped virus).  If the aliquot of virus is viscous, a small amount of DNAse I can and should be added to loosen the stock, or loading the needle will be extremely difficult.  A droplet of the viral stock (8-10 μL) should be placed on a sterile piece of parafilm in preparation for needle loading.  Then, using the withdrawal pump, carefully load the needle paying attention to avoid clogs.  Place the loaded needle into the micromanipulator position in the injection area, being careful not to break the needle on the embryos, or the ultrasound probe.  Note that if for some reason the needle is loaded significantly before the injection is to occur it can be helpful to draw a small amount of air into the tip, which can be discharged prior to starting the injections.",
    "This air pocket can protect against the viral stock drying at the tip of the needle (an occurrence that will almost always render that loaded needle useless).",
    "Part 5. Ultrasound Guided Viral Injection\nThe real-time image created by the ultrasound probe is visualized on the video monitor, and can be used to guide the microinjection needle into the embryo. Using this system virus can be injected into the amniotic sac at E8.5 or either the amniotic sac or the ventricular system from E9.5-E11.5 (Figure1B).  This is the most difficult part of the procedure and requires a significant amount of hands on experience to master (on the order of 5-20 hours depending upon the investigator).  The needle tip is evident in the ultrasound image as the brightest spot on the screen, and should be seen moving in accordance with the adjustments of the probe position (using the motorized controls in the y and z planes, and the manual control in the x plane).  It is critically important that the oscillation direction of the probe be parallel to the length of the needle.  This will assure that the needle tip remains in the image plane during movements to position it for injection into the embryo.",
    "The embryo should be positioned such that the target region (in this case the forebrain ventricle) is readily visible and is accessible to the needle with the least amount of uterine material in the injection path.  In addition, it is critical not to inject through the placenta.  Once the target brain region is lined up with the direction of needle advancement (using the knob on the micromanipulator), the needle should be just touching the uterine wall, and then a short quick jab forward should penetrate the tissue.  A similar approach is used to penetrate the amnionic sac and then the brain.  In some cases, and experienced investigator can hit the ventricle in one motion, especially if the needle is very sharp.  The mechanics of moving the probe, the needle, and the embryos (by moving the mother on the stage), require hands-on practice to master.\nOnce the desired number of embryos has been injected, close the abdominal wall with 5.0 silk sutures.  The mechanics of suturing are not specific to this type of surgery. Finally, use veterinary autoclips to staple the skin together over the stitches in the abdominal muscle.  Suturing the skin is not recommended because the mouse will chew out the stitches.   Analgesia should be applied to the incision area to reduce the amount of pain experienced by the mouse as it awakens.  It is recommended that a 0.25% Bupivacaine solution be injected (0.8 ml/kg, or 2 mg/kg) subcutaneously every few millimeters along the incision site.",
    "While the mouse recovers gently lay the animal on absorbent paper in a clean cage containing a gel pack (to facilitate feeding and hydration). Place the cage onto a slide warmer set at 37°C to maintain body temperature. When awakened, place the mouse and the gel pack into a clean cage and return to the animal rack.\nThe following day check the mouse for any vaginal bleeding, abdominal contractions, and/or an overall distressed look, all of which indicate abortion. If this is the case, euthanize the mouse immediately.  Well groomed hair and an overall healthy appearance indicate successful recovery from surgery. The injected embryos can be sacrificed embryonically or postnatally for further analysis. If the virus expresses a reporter gene, such as human alkaline phosphatase (PLAP) or GFP, a staining will reveal areas of positive viral infection (Figure1C). \nRepresentative Results\nInjected embryos can be sacrificed 1-2 days post injection all the way through to adulthood. If the virus expresses a reporter gene, such as PLAP or GFP, then reporter expression serves to identify virally infected cells and clones of those cells. For example, shown in Figure 1C is a tissue section of a postnatal brain that was infected in utero at E9.5 with a retroviral vector expressing PLAP.  Infected cells are visualized as purple clusters after histochemical staining.  In addition to identifying virally infected cells, reporter expression allows one to examine cell morphology and position, as well as gene expression status.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2047/2047fig1.jpg",
    "Figure 1.  Viral injection into the E9.5 mouse forebrain ventricles.  A. The anesthetized animal is placed on the injection stage.  Two embryos would be exposed and positioned under the ultrasound probe where indicated (arrow).  The microinjection needle filled with virus is located near the embryos and lined up with the ultrasound probe.  B. Screen capture of an real-time ultrasound image from an E9.5 mouse embryo. V, ventricle; AS, amniotic sac; UW, uterine wall.  C. Embryos were injected with a PLAP-expressing virus at E10.5.  Histochemical staining for PLAP reveals the location of viral infection events."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}