{
  "id": 19971,
  "origin_website": "Wiley",
  "title": "Mass Spectrometry-Based Untargeted Plant Metabolomics",
  "procedures": [
    "Extraction is a vital step in determining which metabolites are present in a sample. A multitude of different protocols are available that allow for the enrichment of specific classes of metabolites such as lipids and phytohormones (Giavalisco et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0011]; Lisec, Schauer, Kopka, Willmitzer, & Fernie, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0018]; Tohge & Fernie, 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0029]). Extraction protocols should ideally be as simple as possible to avoid introduction of unnecessary error while being selective to the classes of metabolites of interest, thus reducing sample complexity to the minimum necessary. Sample composition will also have a significant impact on system reproducibility and robustness, which are of great relevance for the high-throughput analysis of the large datasets often performed in metabolomics. Plants produce a particularly rich repertoire of polar to medium polarity metabolites, including amino acids and secondary metabolites. Here, we provide a simple protocol for the extraction of such classes of metabolites that can be easily applied in a high-throughput pipeline as required for metabolomics.\nMaterials\nPlant material\nLiquid nitrogen\nMethanol ULC/MS grade (Biosolve, cat. no. 13684102)\nWater, ULC/MS grade (Biosolve, cat. no. 23214102)\nExtraction buffer 1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0005])\nMixer mill (Retsch, MM 300)\n1.5- and 2.0-ml, safe-lock, polypropylene microcentrifuge tubes, round bottom\nVortex\nCentrifuge (Eppendorf, cat. no. 5409000535)\nGlass vial (Chromacol, cat. no. 02-CTVG)\nScrew cap for glass vial (Chromacol, cat. no. 8-SC-ST15)\nVA 5-mm steel balls, (Geyer Berlin, cat. no. 9738870)\n1. Harvest leaves from the plants, place inside a 2-ml tube, and freeze in liquid nitrogen.\nAvoid allowing liquid nitrogen to get inside the tube as it can cause the tube to burst.\n2. Grind frozen materials to a fine powder using the mixer mill for 2 min at 25 Hz.\n3. Aliquot frozen powder (50 mg) into a 2-ml tube and keep in liquid nitrogen.",
    "Use tubes and spatula pre-cooled in liquid nitrogen and aliquot as fast as possible to avoid material from thawing.\n4. Add 250 µl extraction buffer 1 to each sample, vortex, and keep on ice before proceeding to the next step.\n5. Homogenize sample at room temperature using mixer mill, 4 min at 25 Hz.\n6. Centrifuge samples at room temperature 10 min at 20,000 × g.\n7. Transfer as much of the supernatant as possible, keeping the volume constant across all samples, to a new 1.5-ml tube.\n8. Centrifuge new sample tube 5 min at 20,000 × g.\n9. Transfer supernatant to a glass vial for LC-MS analysis (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0003]).",
    "As mentioned in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001], the extraction procedure is crucial in determining the classes of compounds that can be analyzed within a sample. As such, we provide an alternative protocol that despite being more complex than Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001], allows for a broader coverage of metabolites from a single sample (Giavalisco et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0011]). The protocol results in additional samples to be analyzed by LC-MS-based lipidomics as well as GC-MS platforms.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001])\nLiquid nitrogen\nExtraction buffer 2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0006])\nExtraction buffer 3 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0007])\nResuspension buffer 1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0011])\nResuspension buffer 2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0012])\nMixer mill (Retsch, MM 300)\n1.5- and 2.0-ml, safe-lock, polypropylene microcentrifuge tubes, round bottom\nSpatula\nCentrifuge (Eppendorf, cat. no. 5409000535)\nSpeed vac\nGlass vial (Chromacol)\nScrew cap for glass vial (Chromacol)\nVA 5-mm steel balls (Geyer Berlin)\nTips for pipet, fine quality\nUltrasonic bath (Bandelin Sonorex RK100, cat. no. 301)\n1. Prepare samples following Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001], steps 1-3.\n2. Add 1 ml pre-cooled (−20°C) extraction buffer 2, vortex, and keep samples on ice throughout steps 2-9.\n3. Shake 10 min at 4 °C.\n4. Sonicate for 10 min.\nAdd ice to the sonication bath to avoid samples from heating.\n5. Add 500 µl extraction buffer 3, pre-cooled on ice, and vortex well.\n6. Centrifuge 5 min at room temperature and 15,000 × g.\n7. Transfer as much as possible (∼500 µl) from upper phase (lipophilic phase) into a fresh 1.5-ml tube.\n8. Remove the rest of upper phase by pipetting.\n9. Take two aliquots of 150 µl each (for GC-polar phase and a back up) and 300 µl (for LC-polar phase) from the lower phase (polar phase) and place in fresh 1.5-ml tubes.",
    "10. Dry samples from both aliquots in a speed vac (∼3 hr to overnight) and store at −80°C or proceed to the next step.\n11. Dissolve upper phase (lipophilic phase) in 200 µl resuspension buffer 1 and transfer to a glass vial for LC-MS analysis.\n12. For the LC-MS lower dry phase (polar phase), dissolve in 200 µl resuspension buffer 2 and transfer to a glass vial for LC-MS analysis (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0003]).",
    "A variety of systems for LC-MS are available, each with particularities that make them more suitable for some applications compared to others. Untargeted metabolomics will often rely on systems providing high resolution, and MS2 capabilities, for metabolite annotation together with relatively fast scan rates to provide enough data points within the short spans of ultra performance liquid chromatography (UPLC) peak elution. Currently, Orbitrap and QTOF-based systems are by far the most popular choices for such applications (Glauser, Veyrat, Rochat, Wolfender, & Turlings, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0012]). We describe here a general method used for analyzing polar to medium polarity metabolites within a Waters ACQUITY UPLC (Waters) coupled to a Q-Exactive Orbitrap-focus system (Thermo Finnigan) via an electrospray ionization (ESI) interface. Samples are run in both positive and negative ionization modes to provide the broadest coverage of the metabolome.\nMaterials\nAcetonitrile\nElution buffer A (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0001])\nElution buffer B (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0002])\nUltra performance liquid chromatography (UPLC; Waters ACQUITY UPLC system)\nReverse phase, analytical column, HSS T3 C18 (100 × 2.1 mm i.d., 1.8-µm particle size; Waters)\nQ-Exactive Orbitrap-focus mass analyzer (Thermo Finnigan)\nPC machine with Windows operating system\n1. Set machine parameters according to Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-tbl-0001].\nTable 1.\n                Parameters for LC-MS Analysis of Polar Metabolites\ntable:\n﻿Parameter,Values\nInjection volume,2 μl\nColumn temperature,40°C\nFlow rate,0.4 ml/min\nElution gradient,\"1 min: 99% A, 1% B\"\n,\"11 min: 60% A, 40% B\"\n,\"13 min: 30% A, 70% B\"\n,\"15 min: 1% A, 100% B\"\n,\"16 min: 1% A, 100% B\"\n,\"17 min: 99% A, 55% B\"\n,\"20 min: 99% A, 1% B\"\nSpectra acquisition time in MS,1-19 min\nMS mode,All ion fragmentation (AIF)\nResolution,25000\nMaximum injection time,100 ms\nAutomatic gain control value,1.00E+06\nHCD energy,30.0 eV\nScan range MS,100-1500 m/z\nScan range MS2,100-1000 m/z\nCapillary voltage,3 kV\nSheath gas flow,60 au\nAuxiliary gas flow,20 au\nCapillary temperature,200°C",
    "Drying gas temperature,350°C\nSkimmer voltage,25 V\nTube lens voltage,130 V\n2. Start equilibrating system by injecting 3-5 blank samples (vial with MeOH).\n3. Place samples from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001] (step 10) or Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0002] (step 12) in the autosampler.\n4. Make sure to add samples in a randomized order and include QCs at regular intervals (∼every 5-8 samples).\n5. Analyze each sample in positive ionization mode, immediately followed by the same sample analyzed in negative ionization mode.\n6. Start batch analysis.",
    "GC-MS systems show significantly higher chromatographic resolution in comparison to LC-MS and a much more stable ionization provided by the interface with mass spectrometry (MS) via electron ionization (EI; Lisec et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0018]). Consequently, deconvolution of the highly fragmented spectra signals into analyte mass spectra is facilitated and high scores can be achieved for spectral matching against standard libraries. Compound identification is facilitated even further with the use of retention time indexes to compare compound retention across different runs. The great limitation, however, is that GC-MS can only be applied to compounds that are stable under the conditions necessary to volatilize or derivatize them. That said, GC-MS represents an invaluable complement to LC-MS in order to expand metabolome coverage. In the following protocol, we provide the steps necessary for the derivatization and analysis of plant samples by GC-MS.\nMaterials\nPlant samples\nReagent 1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0009])\nReagent 2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0010])\nHelium\nGas chromatograph coupled to a time-of-flight mass spectrometer (Leco Pegasus HT TOF-MS)\nAutosampler, GERSTEL MultiPurpose\n30 m DB-35 column\nPC with Chroma TOF 4.5 software (Leco)\n1. Add 40 µl reagent 1 and shake 2 hr at 37°C.\n2. Spin down quickly the drops on the cover, add 70 µl reagent 2, and shake 30 min at 37°C.\n3. Spin down quickly the drops on the cover and transfer derivatized sample into a glass vial for GC-MS.\n4. Set machine parameters according to Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-tbl-0002].\nTable 2.\n                Parameters for GC-MS Analysis of Polar Metabolites\ntable:\n﻿Parameter,Value\nCarrier gas,\"Helium, 2 ml/s\"\nInjection temperature (T),230°C\nTransfer line T,250°C\nIon source,250°C\nOven T0,85°C\nOven gradient rate,15°C/min\nOven Tfinal,360°C\nSolvent delay,180 s\nScan rate,20 scans/s\nScan range,70-600 m/z\n5. Start equilibrating system by injecting 3-5 blank samples.\n6. Place samples from step 3 in the autosampler.",
    "7. Make sure to add samples in a randomized order and include QCs at regular intervals (approximately every 5-8 samples).\n8. Start batch analysis.",
    "Lipidomics is often treated as a special type of metabolomics, in part due to the greater regularity across metabolites belonging to these classes, which allows for the application of specialized post-processing steps for the identification of these metabolites (Hummel et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0015]). Despite using the same equipment used for polar metabolites, lipidomics analysis represents a notable example of LC-MS system flexibility. By simply changing the chromatographic system stationary phase (column) and mobile phase (buffers), it is possible to analyze a completely different set of metabolites than with traditional C18-based elution systems.\nAdditional Materials (also see Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0002])\nAcetic acid, ULC/MS grade (Biosolve, cat. no. 01074131)\nAmmonium acetate, ULC/MS grade (Biosolve, cat. no. 01244156)\nElution buffer C (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0003])\nElution buffer D (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-rec-0004])\nWaters ACQUITY UPLC system\nAnalytical column, Waters BEH C8 (100 mm length × 2.1 mm i.d. × 1.7-µm particle size)\nQ-Exactive Orbitrap-focus mass analyzer (Thermo Finnigan)\nPC with Windows operating system\n1. Set machine parameters according to Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-tbl-0003].\nTable 3.\n                Parameters for LC-MS Analysis of Lipids\ntable:\n﻿Parameter,Values\nColumn temperature,60°C\nFlow rate,0.4 ml/min\nGradient,\"1 min: 45% C, 55% D\"\n,\"4 min: 25% C, 75% D\"\n,\"12 min: 11% C, 89% D\"\n,\"15 min: 0% C, 100% D\"\n,\"19.5 min: 45% C, 100% D\"\n,\"24 min: 45% C, 55% D\"\nSpectra acquisition time in MS,1-20 min\nMS mode,MS\nResolution,50000\nMaximum injection time,100 ms\nAutomatic gain control value,1.00E+06\nHCD energy,30.0 eV\nScan range,150-1500 m/z\nCapillary voltage,3 kV\nSheath gas flow,60 au\nAuxiliary gas flow,20 au\nCapillary temperature,200°C\nDrying gas temperature,350°C\nSkimmer voltage,25 V\nTube lens voltage,130 V\n2. Start equilibrating system by injecting 3-5 blank samples (vial with MeOH).\n3. Place samples from Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0002] (step 11) in the autosampler.",
    "4. Make sure to add samples in a randomized order and include QCs at regular intervals (approximately every 5-8 samples).\n5. Start batch analysis.",
    "Data processing consists of several procedures to identify mass features, integrate those features across the chromatographic dimension, and align them across different samples. As such, there are several tools available for performing one or a combination of several of these steps (Perez de Souza, Naake, Tohge, & Fernie, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0023]). This protocol focuses on the use of some procedures we consider among the most user friendly, namely processing data independent tandem MS experiments with the MS-DIAL software (Tsugawa et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0030]) and analyzing the results within the MetaboAnalyst web platform (Chong et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0005]). These by no means represent the only or best options; we chose to use these tools because they both provide an easy user interface that can be readily learned by the novice and they require no prior knowledge of programming, unlike other popular alternatives.\nMaterials\nStandard computer with Internet access\nRaw data files (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0003])\nSoftware Abf converter\nMass spectrometry-data independent analysis (MS-DIAL) software\nFeature detection and alignment with MS-DIAL\n1. Convert vendor format files to .abf using Abf Converter (http://prime.psc.riken.jp/Metabolomics_Software/MS-DIAL/index.html[href=http://prime.psc.riken.jp/Metabolomics_Software/MS-DIAL/index.html]) and transfer all files into a project folder.\nThe training dataset provided with this protocol is already converted to .abf format.\n2. Start MS-DIAL software and a new processing batch in Menu → File → New project.\n3. Add path for the project folder and select Soft ionization. In Method type, you will have to select between the multiple options of data-dependent and independent MS/MS acquisition. For our exemplary dataset, samples were run using a conventional All-ions method. The Experiment file is a tab-delimited file containing MS1 scan range and precursor window (Supplementary dataset 1).",
    "4. Select appropriate data type for MS1 and MS/MS, which can be easily verified by zooming in on some of the signals on the raw MS spectra, ion mode, and experiment type.\nThese settings are profile data for both MS1 and MS/MS, negative ion mode, and Metabolomics for our training dataset.\n5. Load and identify all samples. It is useful to keep a sample list with all necessary metadata in a spreadsheet (Supplementary dataset 2). We recommend that only a small subset of representative samples be processed initially in order to optimize parameters.\n6. On the Data collection tab, set mass accuracy according to the machine. For our training dataset, run on an Exactive Orbitrap (Thermo Fisher Scientific); we leave the default values of 0.01 (MS1) and 0.025 (MS2).\n7. In the same tab (Advanced), remove initial and final portions of the chromatogram in case of a high concentration of co-eluting peaks and to eliminate possible monitoring during column cleaning and stabilization steps often included in a run. For the training dataset, we set the retention time to begin at 2.5 min and end at 12 min. Additionally, set the appropriate mass range of the experiment to be processed (e.g., 100-1,500), and the number of threads you want to use according to your processor.\n8. Check the intensity of a chromatogram/mass spectra region without any eluting peaks to select an appropriate intensity threshold that should be set on the Peak detection tab.\nFor our Exactive Orbitrap we find 30,000 is a good compromise but this varies between different instruments.\n9. MS-DIAL automatically matches deconvoluted spectra to an .msp library that should be loaded in the identification tab.\nMultiple libraries are available from different resources including the MS-DIAL website and they can be easily updated with newly identified compounds and standards.",
    "10. Check raw data with sample preparation and analysis information in mind (e.g., extraction procedures, mobile phase composition) and check which are the relevant adducts to be searched for; this will potentially facilitate further interpretation of detected features.\n11. We recommend initially performing peak spotting without aligning the samples by unchecking the box in the bottom left, Together with Alignment.\nThis will make the initial processing faster and you can readily evaluate the results of feature detection for individual samples.\n12. In case you run a subset of representative samples to optimize processing parameters, MS-DIAL allows you to plot all extracted ion chromatograms for a sample.\nThis is useful to quickly visualize peak shapes and be certain that the selected parameters are not integrating an excessive amount of bad peaks/noise.\nSelect the sample in the File navigator and click Show ion table on the top right of the peak spot viewer.\nFigure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-fig-0001] shows a comparison between data processed using optimal and suboptimal parameter settings.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9c4bd032-cc14-4629-9ad6-c0b035e3017d/cppb20100-fig-0001-m.jpg</p>\nFigure 1\nRepresentative data processing results produced using (A) suboptimal and (B) optimal parameters for peak picking.\n13. Once feature detection results are acceptable, align all chromatograms in Menu → Data processing → Alignment.\nWe recommend setting one of the QCs as the reference sample when available.\nQuality check\n14. Before starting the quality assessment, remove blank samples to facilitate interpretation. Go to Menu → Option → File property setting and uncheck boxes in the column Included for the blank samples.\n15. Normalize data according to your dataset.\nWe perform normalization based on the QC samples using LOWESS (span: 0.33) in Menu → Data visualization → Normalization.\n16. Plot a principal component analysis (PCA) in Menu → Data visualization → Principal component analysis, as a quick way of checking data quality.",
    "It is recommend that auto scaling and log values are used.\n17. Within our exemplary data, observe sample 23_neg (IL 10-3) is a clear outlier(Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-fig-0002]A).\nDouble checking the original total ion chromatogram (TIC) by selecting the specific file in the File navigator tab followed by Menu → View → Display total ion chromatogram (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-fig-0003]), and comparing with other samples from the same group, we can confirm the issue is with the sample rather than the peak picking process. Compromised samples may be present for a variety of reasons and should be excluded from further analysis. This can be easily performed as described in step 14.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/19464554-9482-436f-9431-8d01b70a3e93/cppb20100-fig-0002-m.jpg</p>\nFigure 2\nInitial data quality check using principal component analysis (PCA). (A) before and (B) after outlier removal.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c87608de-ceb9-408d-9e34-a9f64fb5a342/cppb20100-fig-0003-m.jpg</p>\nFigure 3\nTotal ion chromatogram (TIC) of samples from IL 10-3 comparing normal samples with the outlier (23_neg).\n18. Observe that a new PCA after exclusion of sample 23_neg (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-fig-0002]B) displays a clear separation between different genotypes represented by different colors.\n19. Export raw data for peak areas in Menu → Export → Alignment result. Be sure to select options for filtering data based on blank samples and replacing zero values by one tenth of the minimum. Change export format to text and Spectra type to centroid.",
    "Data analysis varies significantly according to the biological question of the experiment. Several traditional statistical models are commonly used to characterize metabolic changes and to identify variables relevant to differentiate treatments. On top of that, heteroscedasticity, high dimensionality, and a large range of concentrations characterize most untargeted metabolomics datasets. Therefore, data transformation and feature selection are as important as the choice of appropriate statistical models. In this protocol, we describe how to upload data exported from MS-DIAL into the MetaboAnalyst web platform and how to perform some general steps of data analysis including data transformation, feature selection, normalization, and identification of important variables by partial least square discriminant analysis (PLS-DA). MetaboAnalyst provides a rich set of utilities in a user friendly platform that can be applied to data obtained from any platform with little adjustment (Chong et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0005]; Current Protocols article: Chong, Wishart, & Xia, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0006]; Chong, Yamamoto, & Xia, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0007]).\nMaterials\nStandard computer with Internet access\nProcessed data (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0006])\nFeature filtering and data normalization with MetaboAnalyst\n1. Format data matrix exported from MS-DIAL for MetaboAnalyst input format by deleting all columns except for alignment ID and the sample areas. Also delete rows 2-4, leaving only sample names in the first row and sample classes in the second row (Supplementary dataset 3).\n2. Open MetaboAnalyst in your browser (https://www.metaboanalyst.ca/MetaboAnalyst/faces/home.xhtml[href=https://www.metaboanalyst.ca/MetaboAnalyst/faces/home.xhtml]) and select Welcome >> click here to start << → Statistical Analysis.\n3. Upload and submit your data matrix: For Data Type, select Peak intensity table; for Format, select Samples in columns (unpaired).\n4. Skip missing values estimation.",
    "5. Initial data processing steps usually result in an overwhelming number of features, many of which are uninformative, and may jeopardize the integrity of the statistical models. MetaboAnalyst provides several (cumulative) options for data filtering that are quickly performed in series for testing the most appropriate filtering preferences. For the training dataset, filtering features based on high QC relative standard deviation (RSD; >25%) and low standard deviation (SD) proved to be the most effective. Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-fig-0004] shows a PCA comparison of unfiltered versus filtered data.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0ea3c6a1-c375-489a-9ce7-c669a3ff5133/cppb20100-fig-0004-m.jpg</p>\nFigure 4\nPrincipal component analysis (PCA) data comparison. (A) before and (B) after filtering out uninformative features.\n6. Several options for data normalization, transformation, and scaling are available under the Normalization tab.\nFor our dataset, we selected normalization by pooled sample from group, specifying QC. It is usually helpful for data visualization and comparison across multiple features to log transform (glog) and auto scale data.\n7. Visualize sample distribution on the PCA tab → 2D Scores Plot.\nIdentify variables important for projection in PLS-DA\n8. Select the PLSDA tab.\nPLS-DA is a practical approach to identify variables important for group distinction.\n9. Verify that group separation is consistent in the 2D Scores Plot.\n10. In the Imp. Features tab, visualize features exhibiting the top variable importance in projection (VIP) scores as well as their relative values across different groups.\n11. Alternatively, plot a heatmap of these variables in the tab Heatmap by selecting the Use top box with the PLS-DA VIP option.",
    "Metabolite annotation is one of the major challenges in MS-based metabolomics with the vast majority of metabolite features remaining unannotated in most experiments (da Silva, Dorrestein, & Quinn, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0008]; Fernie et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0010]). Mass spectra provide relevant structural information through molecular masses, fragmentation patterns, and isotopic composition. Despite that, the unambiguous identification of analytes requires the comparison with authentic standards or the analysis of a purified compound by other techniques, most commonly nuclear magnetic resonance (NMR). There are, however, an ever-growing repertoire of strategies to obtain putative structures or compound classes that can significantly assist data analysis and hypothesis generation (Perez de Souza et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0023]). MS-DIAL offers a practical interface with some of these commonly used strategies. MS-FINDER provides functionalities for database matching and molecular formula calculation based on stable isotope patterns and can be queried directly from MS-DIAL. Additionally, molecular networking can be applied to the dataset, generating a network based on spectra similarity and feature correlation to identify structurally related compounds.\nMaterials\nStandard computer with Internet access\nMass spectrometry-data independent analysis (MS-DIAL; see Tsugawa et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0030])\nMS-FINDER (see Tsugawa et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0031])\nSpectra data curation and standard matching\n1. Repeat Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0006] and Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0007] for both positive and negative ionization modes.\n2. Combine results by opening one analysis in MS-DIAL and merging both peak lists in Menu → Post processing → Amalgamation of different polarity peak list.\n3. Check which is the actual molecular ion for metabolites of interest.\nIt is often the case that the molecular ion is not evident in one of the ionization modes. For instance, [M − H]− often is present only as [M + Na]+ in the positive mode.",
    "4. MS-DIAL will automatically match the second order spectra against the uploaded library. The results can be observed in the top right corner of the graphical user interface (GUI) in the Peak and compound information window.\nAlternatively, it is possible to check other close matches as well as their respective scores by clicking in the bottom Compound search.\nMolecular networking\n5. To visualize the network in the browser, set Firefox as the default browser.\n6. Proceed with generating the network in Menu → Data visualization → Molecular spectrum networking.\n7. To include correlation across multiple samples, select Alignment spots on Search viewer and select the option Export ion abundance correlation among samples.\nIt is also possible to export the results to table format using Menu → Export → Molecular spectrum networking. This can be further analyzed in depth within Cytoscape or the preferred network software.",
    "Following data normalization, a major task is to (putatively) annotate mass features as metabolites in the dataset. Many software packages exist that guide the annotation of mass features (Perez de Souza et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0023]). Here, we will describe the approach from Breitling, Ritchie, Goodenowe, Stewart, and Barrett (2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0003]) using metabolic transformation that was recently integrated as the R/Bioconductor package MetNet (Naake & Fernie, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0022]). In addition to the chemical transformation approach, MetNet includes information from statistical association to construct metabolic networks based on the guilt-by-association principle. The protocol here describes the functionality from MetNet (version 1.3.0). As an example, we will describe the functionality of MetNet using a dataset from Solanum pennellii introgression lines (Alseekh et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0002]) obtained in negative ionization mode. The analysis will focus on the selection of mass features from the dataset relating to hydroxycinnamates and their derivatives and their putative annotation.\nMaterials\nComputer with Internet access\nR (available for download at https://www.r-project.org/[href=https://www.r%E2%80%90project.org/])\nMetNet (see Naake & Fernie, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0022])\n1. MetNet is written in the R programming language; ensure that R (version ≥3.5.0) is installed. Install MetNet from Bioconductor and load to the R environment by entering:\n         \nif (!requireNamespace(“BiocManager”, quietly = TRUE))\n install.packages(“BiocManager”)\nBiocManager::install(“MetNet”)\n library(MetNet)\n2. Read the table with normalized values (Supplementary dataset 4) into the R environment and convert it to a matrix in mode numeric. Assign row names to a vector derived from m/z (column mz) and retention time values (column rt).\n         \npeaklist <- read.csv(“./path_to_data_normalized.csv/data_normalized.csv”, stringsAsFactors = FALSE, header=TRUE, row.names=1)\n## convert to matrix and set mode to numeric\npeaklist <- as.matrix(peaklist)\nmode(peaklist) <- “numeric”\n## set rownames to mz/rt, use rounded m/z and retention time values\nrownames(peaklist) <- paste(round(peaklist[, “mz”], 2), round(peaklist[, “rt”], 1), sep=“/”)\n3. Define the transformations that are queried for in the dataset.",
    "Here, we will target hydroxylations, malonylations, rhamnosylations, glucosylations, and additions of two or three glycosyl units because we expect that these transformations will occur for hydroxycinnamates and their derivatives. Depending on the pathway in focus, the transformation search space will differ and preliminary knowledge is required to target the correct transformations. Alternatively, an extended list of common metabolic transformations can be supplied that will result in more dense networks. MetNet accepts the information on metabolic transformations in a data.frame object. The data.frame might optionally include information on how the polarity of the compound will change given the type of transformation. The function createStructuralAdjacency will return a list containing an adjacency matrix with links if one of the transformations were observed between two mass features in the dataset.\n         \ntransformation <- rbind(c(“Hydroxylation (-H)”, “O”, 15.9949146221, “-”),\nc(“Malonyl group (-H2O)”, “C3H2O3”, 86.0003939305, “+”),\nc(“Rhamnose (-H2O)”, “C6H10O4”, 146.0579088094, “-”),\nc(“Glucose (-H2O)”, “C6H10O5”, 162.0528234315, “-”),\nc(“Disaccharide (-H2O) #1”, “C12H2OO10”, 324.105649, “-”),\nc(“Disaccharide (-H2O) #2”, “C12H2OO11”, 340.1005614851, “-”),\nc(“Trisaccharide (-H2O)”, “C18H30O15”, 486.1584702945, “-”))\ntransformation <- data.frame(group=transformation[, 1],\nformula=transformation[, 2], mass=as.numeric(transformation[, 3]), rt=transformation[, 4])\nadj_struct <- createStructuralAdjacency(peaklist, transformation, ppm=20)\n4. Optionally, query the adjacency matrix created in step 3 if the predicted transformation aligns with the expected change in polarity. Links between instances that do not agree with the expected polarity change (column rt in transformation) will be removed from the adjacency matrix. The function rtCorrection will correct for the expected changes in retention time.\n         \nadj_struct_rt <- rtCorrection(struct_adj=adj_struct, peaklist, transformation=transformation)\n5. Combine information from mass differences and changes in retention time with statistical associations between mass features based on the guilt-by-association principle.",
    "MetNet implements several statistical models to detect associations between features. Here, Pearson correlation, Spearman correlation, context likelihood of relatedness (CLR; Faith et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0009]), and the algorithm for the reconstruction of accurate cellular networks (ARACNE; Margolin et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-bib-0020])) will be used. MetNet will return a consensus adjacency matrix with information from all specified statistical models.\n         \npeaklist_cut <- peaklist[, !colnames(peaklist) %in% c(“mz”, “rt”)]\nadj_stat <- createStatisticalAdjacency(peaklist_cut,\nmodel = c(“pearson”, “spearman”, “clr”, “aracne”), correlation_adjust = “BH”)\n6. Combine the two data sources (structural and statistical information) to an adjacency matrix that only contains those links that are reported by both sources.\n         \nadj_comb <- combineStructuralStatistical(adj_struct_rt[[1]], adj_stat)\n7. Further analyze the adjacency matrix of step 6: We will use the igraph framework for analysis and visualization. The function graph_from_adjacency_matrix creates an igraph network from the adjacency matrix of step 6. In the following, the components of the network are retrieved and components that have five or more vertices (corresponding to mass features) will be used for visualization.\n         \nlibrary(igraph)\nnet <- graph_from_adjacency_matrix(adj_comb, mode=“undirected”)\ncomp <- components(net)\n## retain only components which have 5 or more vertices for visualization\ncomp_red <- names (comp$membership[comp$membership %in% which(comp$csize >= 5)])\nadj_comb_red <- adj_comb[comp_red, comp_red]\nnet <- graph_from_adjacency_matrix(adj_comb_red, mode=“undirected”)",
    "8. In our study, we use coumaric acid (C9H8O3, exact mass: 164.047345 u, in negative ionization mode: 163.039520 m/z) as bait to find co-regulated metabolites that share structural similarity based on the metabolic transformation. In the dataset, four mass features correspond to coumaric acid that located to the same component. Highly connected features in the component might correspond to caffeic acid (C9H8O4, exact mass: 180.042260 u, negative ionization mode: 179.034435 m/z), coumaric acid glucoside (C15H18O8, exact mass: 326.100170 u, negative ionization mode: 325.092345 m/z), caffeic acid glucoside (C15H18O9, exact mass: 342.095085 u, negative ionization mode: 341.087260 m/z), and other derivatives that can be inferred by mass difference calculation (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6ea70614-6170-496f-9efb-b64a11637f70/cppb20100-fig-0005-m.jpg</p>\nFigure 5\nMetNet: Network obtained by MetNet targeting the metabolic transformations hydroxylation, malonylation, rhamnosylation, glucosylation, and addition of two or three glycosyl units. In total, 16 components with ≥5 mass features were obtained. The whole network contained 154,528 undirected links (derived from statistical association) and 536 undirected links (derived from structural mass differences) of which 343 links were shared. Highlighted is a component (component #6) that contains (putative) hydroxycinnamates and derivatives. The m/z value of cinnamic acid, [M − H+]− 163.039520 m/z, was used as bait to find putative hydroxycinnamates. Component #6 contained 301 and 172 undirected links derived from statistical association and structural mass differences, respectively. The heatmap shows the normalized intensities of mass features of component #6, indicating strong co-regulation between the mass features of component #6.",
    "All metabolite annotation approaches described so far can at best provide strong evidence of metabolite identities, which can be enough depending on the context but for ultimately determining compound structure by MS, experiments of co-injection should be performed using the authentic standards for the proposed compound. This also can serve as an approach to verify the quantification of a protocol because the standard plus the extract should be quantitatively equal to the sum of both of their own concentrations. Alternatively, well-characterized samples can be mixed with less well-characterized samples and the quantitative recovery assessed.\nAdditional Materials (also see Basic Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0003])\nOriginal standard of proposed compound\n1. Prepare a stock solution of the authentic standard of the expected metabolite at a concentration of 100 µM.\n2. Prepare samples according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001] (steps 1-9).\n3. Following Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0001], step 9, pipet two 100 µl aliquots of the samples and one of resuspension buffer to new 1.5-ml tubes.\n4. Spike one sample and resuspension buffer with 10 µl standard stock solution and the other sample with 10 µl resuspension buffer.\n5. Transfer all samples to a glass vial for LC-MS analysis and analyze samples according to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20100#cppb20100-prot-0003]."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}