{
  "id": 10417,
  "origin_website": "Jove",
  "title": "Production of E. coli-expressed Self-Assembling Protein Nanoparticles for Vaccines Requiring Trimeric Epitope Presentation",
  "procedures": [
    "1. Expression of the SHB-SAPN Protein in E. coli BL21(DE3)\nMix 95 mL of component A and 5 mL of component B of the media in a 2 L sterile glass Erlenmeyer flask as per the manufacturer’s instructions (see the Table of Materials). Add ampicillin to a final concentration of 100 μg/mL.\nInoculate the media with E. coli from a previously established glycerol stock culture. Incubate culture at 30 °C with shaking at 200 rotations per minute (rpm) for 48 h.\n\tNOTE: The used E. coli BL21 (DE3) stock contained the ampicillin resistant expression vector23 with the SHB-SAPN gene. Although the general protocol of the media recommends 24 h of incubation at 37 °C, 48 h of incubation at 30 °C gave higher yield for SHB-SAPN.\nTransfer the culture to two 50 mL conical tubes. Centrifuge the tubes at 4,000 x g for 10 min with a fixed angle rotor at 4 °C. Remove the supernatant and save the pellet to harvest cells.\n\tNOTE: The cell pellet can be either processed immediately or frozen at -80 °C until use.\n2. Lysis of E. coli BL21(DE3) by sonication\nNOTE: Use nonpyrogenic plasticware and glassware baked at 250 °C for at least 30 min. Tris(2-carboxyethyl)phosphine (TCEP) as a reducing agent breaks the disulfide bonds within and between proteins. TCEP is necessary in the buffers during this protocol if the displayed antigen contains S-S bonds. For SHB-SAPN core only, the presence of TCEP in the buffers is not essential.\nPrepare imidazole-free buffer (8 M Urea, 50 mM sodium phosphate monobasic, 20 mM Tris base, 5 mM TCEP) pH 8.0 (adjusted with 5 N NaOH) and filter it using a 0.22 µm vacuum bottle filtration unit.",
    "Resuspend the pelleted cells (from step 1.3) with 40 mL of imidazole-free buffer in one 50 mL conical tube. Sonicate the resuspended cells with a probe on ice for 5 min (4 s of sonication, 6 s of rest) with a sonication output of 150 W.\nCentrifuge the cellular lysate (40 mL) at 29,000 x g at 4 °C for 25 min in a fixed angle rotor to generate clarified supernatant. Transfer the supernatant to a 150 mL sterile flask and discard the pellet. Dilute the supernatant to 100 mL using the imidazole-free buffer (later in the protocol referred to as “sample”).\n\tNOTE: This dilution step is needed to prevent the FPLC system pressure from becoming too high during lysate loading on the column.\n3. Protein purification using a His-column\nNOTE: This protocol was performed using an FPLC instrument, but it can be adapted to gravity flow.\nPrepare the following buffers and filter them using a 0.22 µm vacuum bottle filtration unit: (i) imidazole-free buffer “Buffer A” (8 M Urea, 50 mM sodium phosphate monobasic, 20 mM Tris base, 5 mM TCEP) pH 8.0; (ii) 500 mM imidazole buffer “Buffer B” (8 M Urea, 50 mM sodium phosphate monobasic, 20 mM Tris base, 5 mM TCEP, 500 mM Imidazole) pH 8.0; and (iii) isopropanol wash (20 mM Tris, 60% isopropanol) pH 8.0.\n\tNOTE: pH for each buffer was adjusted with 5 N NaOH.\nEquilibrate the His-column.\n\tNOTE: For lab scale production, this protocol uses a 5 mL prepacked His-column, but any larger sized column can be used.\n\t\nOpen the FPLC software and click on the New method option. It will immediately open to the Method settings menu. Under the drop-down menu for column position choose C1 port 3.",
    "On the Shown by technique drop down menu choose affinity. On the Column type drop-down menu choose others, Histrap HP, 5 mL. The column volume and the pressure boxes will be automatically set to the appropriate values.\nClick on the Method outline button. Drag the following buttons from the Phase library popup menu: equilibration, sample application, column wash, and elution next to the arrow in that exact order. Close the Phase library menu.\nClick on the equilibration button. The values listed in the table should be “initial buffer B” (4%), “final buffer B” (4%), and “volume (CV)” 5.\nClick on the Sample application box. In the sample loading box click the radio button for Inject sample on column with sample pump. Make sure the box next to the Use flow rate from method settings is checked in the sample injection with system pump box. Next to the volume box on the right side of the screen change the value to 20 mL.\nClick on the Column wash button. The values listed in the table should be “initial buffer B” (4%), “final buffer B” (4%), and “volume (CV)” 5. Next to the fraction collection scheme unclick the Enable box.\nClick on the elution button. The values listed in the table should be “initial buffer B” 0%, “final buffer B” 100%, and “volume (CV)” 5. Next to the fraction collection scheme click on the Enable box. Unclick the Use fraction size from method settings and adjust fraction size to 4 mL in the fill-in box below.\nClick the save as button on the top of the of the software. Name the file “equilibration”.",
    "Connect a 5 mL prepacked His-column to the corresponding column port 3 on the FPLC. Both pump A and pump B tubing as well as the sample pump tubing should be placed into 0.22 µm filtered deionized water. Run the equilibration program.\nPlace both pump A and pump B as well as the sample pump tubing into the imidazole-free buffer (Buffer A) and run the equilibration protocol again.\nBind the sample to the column and purify the protein.\n\t\nOpen the FPLC software and click on the New method option. It will immediately open to the Method settings menu. Under the drop-down menu for Column position choose C1 port 3. On the Shown by technique drop down menu choose affinity. On the column type drop-down menu choose others, Histrap HP, 5 mL. The column volume and the pressure boxes will automatically be set to the appropriate values.\nClick on the Method outline button. Drag the buttons from the Phase library popup menu: equilibration, sample application, column wash (Wash 1), column wash (Wash 2), column wash (Wash 3), and Elution next to the arrow in that exact order. Close the Phase library menu.\nClick on the Equilibration button. The values listed in the table should be “initial buffer B” 4%, “final buffer B” 4%, and “volume (CV)” 5.\nClick on the Sample application box. In the sample loading box click the radio button for Inject sample on column with sample pump. Make sure the box next to the Use flow rate from method settings is checked in the sample injection with system pump box.",
    "Next to the volume box on the right side of the screen change the value to 100 mL. Next to the fraction collection scheme click the Enable button. Unclick the Use fraction size from method settings box and then change the fraction size to 4 mL.\nClick on the first column wash button (Wash 1). The values listed in the table should be “initial buffer B” 4%, “final buffer B” 4%, and “volume (CV)” 10. Next to the fraction collection scheme click the Enable box. Unclick the Use fraction size from method settings and then change the fraction size to 4 mL.\nClick on the second column wash button (Wash 2). The values listed in the table should be “initial buffer B” 0%, “final buffer B” 0%, and “volume (CV)” 5. Next to the fraction collection scheme click the Enable box. Unclick the Use fraction size from method settings and then change the fraction size to 4 mL.\nClick on the third column wash button (Wash 3). The values listed in the table should be “initial buffer B” 0%, “final buffer B” 0%, and “volume (CV)” 5. Next to the fraction collection scheme click the Enable. Unclick the Use fraction size from method settings box and then change the fraction size to 4 mL.\nClick on the Elution button. In the table right click the information listed and, on the menu that comes up, click Delete step. Drag the isocratic gradient button onto the table twice, so that there are two entries.",
    "The value for the first entry should read “initial buffer B” 30%, “final buffer B” 30%, and “Volume (CV)” 10. The value for the second entry should read “initial buffer B” 100%, “final buffer B” 100%, and “volume (CV)” 10. Next to the fraction collection scheme click the Enable button. Click the box next to Use fraction size from method settings.\nClick the Save as button on the top of the of the software. Name the file “purification”. Pump A tubing of the FPLC should be placed into the imidazole-free wash buffer while pump B tubing should be placed into the 500 mM imidazole buffer. The sample pump tubing should be placed into the 100 mL sample.\nRun the “purification” program and wait for the time when the 60% isopropanol is needed (Wash 2). Pause the program, move pump A tubing from the imidazole-free wash into the 60% isopropanol wash. Restart the program.\nOnce the isopropanol step is completed, pause the program again and move pump A tubing back into the imidazole-free wash buffer. Restart the purification program (the rest of the run is automated).\n4. Purity assessment and protein identification by SDS-PAGE\nCombine all the fractions corresponding to (i) flow-through (the cell lysate that did not bind to the His column), (ii) Wash 1, (iii) Wash 3 (60% isopropanol wash), and (iv) Wash 3 in separate 50 mL conical tubes. Do not combine the 2 mL fractions from the elution steps.\nMix 15 µL from each of the pooled fractions and all fractions from elution steps with 2x Laemmli sample buffer in a 0.5 mL microcentrifuge tube and denature them at 95 °C for 10 min.\nWhile the protein denatures, set up the gel running apparatus with 3 stain-free 4–20% precast polyacrylamide gels in 1x Tris-glycine SDS-PAGE running buffer.",
    "Load 8 µL of molecular weight marker to the first well and 30 µL of denatured sample to the other wells of the gel. Run the gels at 200 V until the dye front hits the bottom of the gel (about 30 min). Remove the gels from the apparatus and briefly rinse with deionized water. Image the gel immediately using the stain-free imaging system.\nIdentify the fractions that contain protein bands with the correct size (18.07 kDa). Pool all these fractions.\n5. Protein identification by western blot\nRun a western blot using an His-specific antibody (anti-6x HisTag) and a SHB-specific antibody (167-D-IV) to identity the purified full-length protein. The anti-6x HisTag antibody recognizes the N terminus of the protein and the 167-D-IV antibody recognizes the C terminus demonstrating the presence of the full-length protein.\nDetermine the protein concentration of the (i) flow-through, (ii) Wash 1, (iii) Wash 2 (60% isopropanol wash), (iv) Wash 3, and all fractions from the elution steps with the spectrometer instrument at an absorbance of 280 nm. Generate dilutions that contain 100 ng of protein in 15 µL of imidazole-free buffer for each of these groups.\nAdd 15 µL of 2x Laemmli sample buffer to each 15 µL of the samples and denature them as in step 4.1. Once the denaturing is completed spin down the tubes to ensure all the protein can be transferred.\nLoad samples and the pre-stained marker into a stain-free 4–20% precast polyacrylamide gel. Run the electrophoresis at 200 V until the dye front reaches the bottom of the gel.\nWhile the gel runs, make 1 L of TBS-T (20 mM Tris, 150 mM NaCl, and 0.1% Tween 20) and 200 mL of 5% non-fat milk in TBS-T.",
    "Use a western blot transfer system to transfer protein onto a nitrocellulose membrane. Use a pre-assembled transfer stack and place the gel on it. Set up the system to run at 25 V for 7 min. Check for the presence of the pre-stained marker on the nitrocellulose membrane indicating a complete transfer.\n\tNOTE: All the subsequent steps are performed on an orbital shaker set at 100 rpm at room temperature (RT).\nOnce the transfer is completed, wash blots two times with TBS-T for 10 min each.\nBlock the nitrocellulose membranes (blot) with 5% non-fat milk in TBS-T for at least 1 h. Wash blots two times with TBS-T for 10 min each.\nDilute the primary 167-D-IV and anti-6x HisTag antibodies to 1 mg/mL in TBS-T (stock Ab). Dilute the stock Abs of the 167-D-IV 10,000-fold and the anti-6x HisTag 5,000-fold by adding 2 µL of the stock 167-D-IV and 4 µL of the stock anti-6x HisTag antibodies to two different tubes containing 20 mL of TBS-T. Add the total 20 mL volume of primary antibodies, one to each blot, and incubate blots for 1 h. Wash blots two times with TBS-T for 10 min.\nDilute 4 µL of 1 mg/mL of the mouse anti-human secondary antibody conjugated with alkaline phosphatase in 20 mL of TBS-T (1:5,000 dilution). Dilute 4 µL of 1 mg/mL of the goat anti-mouse secondary antibody conjugated with alkaline phosphatase in 20 mL of TBS-T (1:5,000 dilution). Add secondary antibodies to corresponding blots.\n\tNOTE: The anti-human secondary antibody binds to 167-D and the anti-mouse binds to the anti-6x HisTag. Wash blots two times with TBS-T for 10 min.",
    "Add enough BCIP/NBT alkaline phosphatase substrate to cover the blots. Develop the blots for about 10 min until bands appear. Rinse blots with cold tap water and let them dry before scanning with a flatbed scanner.\n6. Refolding the SHB-SAPN\nAdd the pooled protein (10‒20 mL total) to a 10 kDa molecular weight cut off dialysis cassette and dialyze it into 8 M urea, 20 mM Tris, 5% glycerol, 5 mM TCEP pH 8.5 at RT (18‒26 °C) overnight.\nSlowly dialyze the urea off the sample by decreasing the urea concentration in the dialysis buffer stepwise by 2 M every 2 h. At a urea concentration of 2 M, move the dialysis apparatus to 4 °C (do not use TCEP in the dialysis buffer from this step). Finish the refolding by dialyzing the sample into 120 mM urea, 20 mM Tris, 5% glycerol, pH 8.5 at 4 °C overnight.\nRemove the refolded protein (SHB-SAPN) from the dialysis cassette. Filter the SHB-SAPN using a 0.22 µm polyvinylidene fluoride (PVDF) syringe filer. Aliquot SHB-SAPN into sterile tubes and freeze them at -80 °C, leaving at least 100 µL at RT for subsequent analyses.\n7. Validation of particles by size and appearance\nDynamic light scattering (DLS)\n\t\nMeasure the mean particle size of the SHB-SAPN by the following parameters: select protein as the material, create a complex buffer for 120 mM urea, 20 mM Tris, 5% glycerol 25 °C for temperature, select disposable cuvettes for the analysis, select automatic measurement, set for 5 runs.\nAdd 45 µL of SHB-SAPN to a disposable cuvette and run the software by clicking on the green arrow. Select the percentage volume for the readout.\nNanoparticle tracking analysis (NTA)\n\t\nDilute the sample by 1:20 in the refolding buffer. Make 10 mL of diluted sample.",
    "Using 3 mL syringes, flush the NTA instrument with the refolding buffer and load about 1.5 mL of sample to equilibrate the instrument. Use rest of the sample for the analysis.\nCreate a new SOP in the NTA software by clicking on the SOP tab. Under the tab change the number of captures to 3 and change the capture time to 30 s. Press the autofocus button on the left side of the screen to bring the sample into focus. Use the manual focus knob on the side of the machine to fine tune the focus.\nRun the created SOP, when the system prompts load a small volume of sample with the syringe. After the system has taken all the captures it will automatically bring up the analysis screen. Slide the detection limit bar so that all the real particles are marked with red crosses. Press the run analysis button and the analysis will automatically begin.\nTransmission electron microscopy (TEM)\n\t\nGlow discharge formvar/carbon 400 mesh copper TEM support films.\nAdd 3 µL of sample at a 0.075 mg/mL concentration to the grid for 30 s. Wick off the liquid using a filter paper.\nWash the grid with 3 µL of deionized water three times, each time wicking off the water with filter paper.\nAdd 3 µL of 0.5% uranyl acetate to the support film and allow it to sit for 30 s. Wick off most of the uranyl acetate but leave a thin film on the surface. Allow the samples to dry before imaging them on the transmission electron microscope.\nImage samples at 80 kV on a TEM.\n8. Determination of endotoxin levels in the samples using a kinetic limulus amoebocyte lysate (LAL) assay\nRemove the kit and samples from the refrigerator and allow to equilibrate to RT.",
    "To perform this assay, a plate reader with a heat block and the ability to read the samples for 40 reads at a wavelength of 405 nm at 37 °C is required. Write a program template so that wells are read every 150 s to identify the onset time point (the OD increased by 0.2 in comparison with the first read).\nDilute the sample to the immunization dose concentration in PBS.\n\tNOTE: The pH of the refolding buffer is outside the range of the LAL assay. The dilution of the sample in PBS will set the pH to the acceptable range.\nResuspend the control endotoxin in the appropriate volume of endotoxin-free LAL water as determined by the certificate of analysis to generate 50 EU/mL. Vigorously vortex the vial for 15 min to ensure complete resuspension of the endotoxin.\nGenerate the endotoxin standard curve by preforming a 10-fold serial dilution in glass vials in the range of 50 EU to 0.005 EU/mL. For each dilution, add 0.1 mL of the previous dilution to 0.9 mL of LAL water. Vortex vigorously after combination for 1 min.\nAdd standard curve dilutions and SHB-SAPN samples in duplicate to a 96-well plate. Use LAL water as a negative control in duplicate as well. Preincubate the plate at 37 °C for 15 min.\nTowards the end of the incubation, resuspend the assay reagent vial with 2.6 mL of LAL water. Gently mix content with a serological pipette.\nAdd 100 µL of the assay reagent to each well of the 96-well plate. Quickly move the plate to the plate reader and run the program template written in step 8.2.",
    "Once the program is completed, generate a standard curve using the log value of the controls versus the log value of the onset time. Use the formula generated from this curve to calculate the endotoxin concentration in the samples."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}