{
  "id": 1574,
  "origin_website": "Cell",
  "title": "Assessing the Wnt-reactivity of cytonemes of mouse embryonic stem cells using a bioengineering approach",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMeasuring cytoneme-mediated communication between ESCs or primed ESCs and TSCs\nTiming: 2 days\nThis protocol describes how to set up and image a co-culture of ESCs or primed ESCs (expressing Ftractin-mRuby3) and TSCs to measure their interaction, using a spinning disk confocal microscope. Variations of this protocol include the pre-treatment of TSCs with Porcupine inhibitors IWP2 (inhibitor of Wnt secretion) (Chen et al., 2009[href=https://www.wicell.org#bib1]) or Wnt-C59 (Cayman Chemicals, cat. num. 16644). We exemplify the use of IWP2 below. Alternatively, Kainate (100 μM), CNQX (10 μM) or other drug treatments can be added to the media after step 3 (below) (Junyent et al., 2020[href=https://www.wicell.org#bib6]). Additionally, ESCs expressing GCaMP6s or other fluorescently tagged constructs, or ESCs knock-out (KO) for Wnt/β-catenin pathway components and ionotropic glutamatergic receptors have been used in our experiments (Junyent et al., 2021b[href=https://www.wicell.org#bib8]). KO ESCs can be generated following published protocols (Ran et al., 2013[href=https://www.wicell.org#bib14]). In these cases, construct-expressing or KO ESCs should be used from step 2 onwards.\nPrepare a suspension of MEF-free TSCs\nOptional: 24 h before, add 2 μM IWP2 (or 1 μM Wnt-C59) to the media of one well of TSCs (IWP2-treated TSCs).\nAspirate culture media from one well (or more) of TSCs, and rinse once with PBS.\nAdd 0.5 mL 0.05% Trypsin-EDTA and return the plate to the incubator.\nIncubate for <4 min at 37°C, 5% CO2 until cells are detached. Aim to obtain a suspension of small TSC clusters (2–3 cells per cluster) mixed with single MEFs.\nCritical: Do not incubate cells with 0.05% Trypsin-EDTA for longer than 5 minutes to minimize the possibility of cleaving the receptors of interest. Troubleshooting 2[href=https://www.wicell.org#troubleshooting]",
    "With a 5 mL serological pipette, use 2 mL TSC media to resuspend the cells. Transfer cell suspension to a 15 mL Falcon tube. For IWP2-treated TSCs, add 2 μM IWP2 to the media.\nPellet cells by centrifugation at 1.2 × 103 rcf, 4 min at RT.\nAspirate supernatant, carefully avoiding the pelleted cells.\nResuspend pelleted cells in 1 mL TSC media by repeatedly pipetting up and down.\nTo separate MEFs from TSCs, transfer cell suspension to a clean 6-well plate and return to the incubator.\nIncubate for ∼15 min at 37°C, 5% CO2 to allow MEFs to attach.\nCarefully, pipette out the TSC-containing supernatant without disturbing the attached MEFs. Transfer to a 15 mL Falcon tube.\nPellet cells by centrifugation at 1.2 × 103 rcf, 4 min at RT.\nAspirate supernatant, carefully avoiding the pelleted cells.\nResuspend pelleted cells in 1 mL TSC media by briefly pipetting up and down.\nUsing a glass hemocytometer, estimate the concentration of cell clusters in the suspension.\nPrepare a suspension of ESCs or primed ESCs (see culture of mouse embryonic stem cells (ESCs)[href=https://www.wicell.org#sec1.1] and ESC transition to an early primed ESC stage[href=https://www.wicell.org#sec1.2])\nAspirate culture media from a well of ESCs or primed ESCs stably expressing Ftractin-mRuby3 (or expressing other fluorescently-tagged construct, or a KO ESC/primed ESC line), and rinse once with PBS.\nAdd 0.5 mL 0.25% Trypsin-EDTA and return the plate to the incubator.\nIncubate for <4 min at 37°C, 5% CO2 until cells are detached.\nCritical: Do not incubate cells with 0.25% Trypsin-EDTA for longer than 5 minutes to minimize the possibility of cleaving the receptors of interest. Troubleshooting 2[href=https://www.wicell.org#troubleshooting]\nWith a 5 mL serological pipette, use 2 mL ESC basal media to resuspend the cells. Transfer cell suspension to a 15 mL Falcon tube.",
    "Pellet cells by centrifugation at 1.2 × 103 rcf, 4 min at RT.\nAspirate supernatant, carefully avoiding the pelleted cells.\nResuspend pelleted cells in 1 mL ESC basal media by repeatedly pipetting the whole volume up and down.\nUsing a glass hemocytometer, estimate the concentration of cell in the suspension.\nPrepare ESC-TSC or primed ESC-TSC co-culture.\nPrepare a 1.5 mL Eppendorf tube, following:\ntable:files/protocols_protocol_1013_13.csv\nCritical: Cell density should be optimized. In densities that are too low, ESC/primed ESC and TSCs will not be close enough to initiate the interaction. Densities that are too high will impede proper analysis as cells will be too close together and non-cytoneme mediated contacts (e.g. non-specific contact/collisions via cell motility) may occur (Figure 2[href=https://www.wicell.org#fig2]) troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig2.jpg\nFigure 2. Representative images of the distribution of TSCs (green) and ESCs (imaged with brightfield, gray)\nExamples are shown for too low, good and too high seeding densities. Scale bars, 50 μm.\nMix cells gently and transfer 200 μL mix to one well of a black-walled, clear-bottomed TC-treated, 96-well plate (e.g., Corning, cat. num. 3916). Return to the incubator.\nIncubate for 1 h at 37°C, 5% CO2 to allow cell attachment.\nSet up imaging of ESC/pESC-TSC interaction in a spinning disk confocal microscope\nOptional: Transfer cells to a pre-warmed polystyrene box for transport between incubator and microscope.\nPre-stabilize the incubation box of the spinning disk microscope at 37°C, 5% CO2\nPlace the imaging 96-well plate in the motorized stage.\nSelect the 20×/0.75 objective (or equivalent).\nPerform Kohler illumination adjustment of the transmitted light following standard procedures.",
    "Choose representative positions in which ESCs or primed ESCs and TSCs are closely located, but not contacting. Use the mRuby3 channel to visualize ESCs or primed ESCs and the thin structures in their cytonemes; use the GFP channel to localize TSCs. Choose ∼20 positions/well.\nAdjust laser intensities and exposure times to be as low as possible, to avoid phototoxicity (e.g., 30 ms for brightfield, 200 ms and 20% laser power for RFP-561 nm laser and GFP-488 nm laser with 4x bining in a Nikon Eclipse Ti Inverted microscope with a Yokogawa CSU-X1 disk head and Andor Neo sCMOS camera).\nSet up 3 z-positions to sample the full volume of the cell (approximately 3–5 μm apart). Center the Z-stack to the position with a higher resolution of the cytonemes.\nSet up the time-lapse imaging protocol: image each position every 10 min, for 12 h, for the following channels: brightfield, mRuby3 (RFP) and GFP.\nOptional: Image a one-cycle loop to check that the setup is correct.\nCritical: Choose enough positions to achieve a good representation of the ESC-TSC or primed ESC-TSC dynamics throughout the well, but few enough so a cycle of imaging can be performed within the 10 min interval.\nImage ESC/primed ESC-TSC interaction overnight.\nRun automated imaging overnight (∼12 h).\nPerform reactivity analysis in the images obtained (see quantifying cytoneme reactivity to sources of Wnt[href=https://www.wicell.org#sec3.3]).\nMeasuring cytoneme-mediated recruitment of Wnt-beads by ESCs or primed ESCs\nTiming: 14 h",
    "This protocol describes how to set up and image a plate of ESCs or primed ESCs co-cultured with Wnt3a-beads or control-beads (e.g., iWnt3a-beads) to measure cytoneme-mediated localized Wnt recruitment, using a spinning disk confocal microscope. Variations of this protocol include adding Kainate (100 μM), CNQX (10 μM) or other drug treatments to the media (added after step 7, below). Additionally, cells expressing GCaMP6s or other fluorescently tagged constructs, or cells KO for Wnt/β-catenin pathway components and ionotropic glutamatergic receptors have been used in our experiments. In these cases, construct-expressing or KO ESCs/primed ESCs should be used from step 6 onwards.\nPrepare a suspension of ESCs or primed ESCs\nFrom a 6-well plate culture of ESCs or primed ESCs stably expressing Ftractin-mRuby3, aspirate culture media and rinse once with PBS.\nAdd 0.5 mL 0.25% Trypsin-EDTA and return the plate to the incubator.\nIncubate for ∼4 min at 37°C, 5% CO2 until cells are detached.\nCritical: Do not incubate cells with 0.25% Trypsin-EDTA for longer than 5 minutes to minimize the possibility of cleaving the receptors of interest. Troubleshooting 2[href=https://www.wicell.org#troubleshooting]\nWith a 5 mL serological pipette, use 2 mL ESC basal media to resuspend the cells. Transfer cell suspension to a 15 mL Falcon tube.\nPellet cells by centrifugation at 1.2 × 103 rcf for 4 min at RT.\nAspirate supernatant, carefully avoiding the pelleted cells.\nResuspend pelleted cells in 1 mL ESC basal media by repeatedly pipetting up and down.\nUsing a glass hemocytometer, estimate the concentration of cell in the suspension.\nPrepare ESCs/primed ESCs cultured with Wnt3a-beads or control beads.\nDilute ESCs/primed ESCs to 3,000 cells per 100 μL in ESC basal media, for each well required.\nAdd 0.3 μg of Wnt3a-beads or control beads per 3,000 cells.",
    "Add ESC basal media such that the final concentration is 3,000 cells and 0.3 μg beads per 200 μL.\nCritical: Cell and bead density should be optimized. In low densities the Wnt-beads and the cells will be too far apart, and cells cannot initiate the interaction. Densities that are too high will impede proper analysis by increasing the non-specific (i.e., not cytoneme-mediated) interactions between cells and Wnt-beads, as well as the contact between cells (Figure 3[href=https://www.wicell.org#fig3]) Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig3.jpg\nFigure 3. Representative images of the distribution of ESCs (red) and Wnt3a-beads (imaged with brightfield, gray)\nExamples are shown for too low, good and too high seeding densities. Scale bars, 50 μm.\nTransfer 200 μL of the mix to the wells of a black-walled, clear-bottomed TC-treated, 96-well plate (e.g., Corning, cat. Num. 3916).\nReturn to the incubator and incubate for 1 h at 37°C, 5% CO2 to allow cell attachment.\nSet up imaging of ESC/primed ESC-bead interactions in a spinning disk confocal microscope\nOptional: Transfer cells to a pre-warmed polystyrene box for transport to the microscope.\nPre-stabilize the incubation box of the spinning disk microscope at 37°C, 5% CO2\nPlace the cell-containing 96-well plate in the motorized stage.\nSelect the 20×/0.75 objective (or equivalent).\nPerform Kohler illumination adjustment of the transmitted light following standard procedures.\nChoose representative positions in which ESCs and Wnt-beads or control-beads are closely located, but not already contacting. Use the mRuby3 channel to visualize ESCs or primed ESCs and the thin structures in their cytonemes. Choose ∼20 positions/well.",
    "Adjust laser intensities and exposure times to be as low as possible to avoid phototoxicity (e.g., 30 ms for brightfield, 200 ms and 20% laser power for RFP-561 nm laser with 4x bining in a Nikon Eclipse Ti Inverted microscope with a Yokogawa CSU-X1 disk head and Andor Neo sCMOS camera).\nSet up 3 z-positions covering the full volume of the cell (approximately 3–5 μm apart). Center the Z-stack to the position with better resolution of the cytonemes.\nSet up the time-lapse imaging protocol: image each position every 10 min, for 12 h, for brightfield and mRuby3 (RFP channel).\nOptional: Image a one-cycle loop to check that the setup is correct.\nCritical: Choose enough positions to achieve a good representation of the ESC-TSC dynamics throughout the well, but few enough so a cycle of imaging can be performed within the 10 min interval. In our experience, a maximum of 20–25 positions can be imaged at a time.\nImaging ESC/primed ESC-bead interactions\nImage for 12 h using the automated imaging protocol.\nPerform reactivity analysis in the images obtained (see quantifying cytoneme reactivity to sources of Wnt[href=https://www.wicell.org#sec3.3]).\nQuantifying cytoneme reactivity to sources of Wnt (Wnt3a-beads or TSCs)\nTiming: 3–6 h\nAll image quantification is performed in Fiji (ImageJ), and the step-by-step pipeline of analysis is described below (exemplified in Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5]). Raw data processing is performed in Excel, and an example of the layout is shown below (Figure 6[href=https://www.wicell.org#fig6]). Once processed, data representation and statistical analysis is performed in Prism version 8 or later (GraphPad).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig4.jpg\nFigure 4. Representative frames of a time-course imaging showing ESCs (magenta) contacting Wnt3a-beads (black spheres, highlighted with dashed yellow circles) with a cytoneme",
    "Examples are shown for a “Reactive” (left) and a “Non-reactive” (right) interaction. Yellow lines or boxes indicate the measurements performed. Note that the distance between Wnt3a-bead and cell is reduced following contact in the “Reactive” interaction, but not in the “Non-reactive” one. Time is displayed in minutes. Scale bars, 25 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig5.jpg\nFigure 5. Representative frames of a time-course imaging showing ESCs (magenta) contacting TSCs (green) with a cytoneme\nExamples are shown for a “Reactive” (top) and a “Non-reactive” (bottom) interaction. The first frame shows the initial distance between the cells. The last frame shows retention of contact for “Reactive” interactions but not for “Non-reactive” interactions. Yellow lines or boxes indicate the measurements performed. Note that the distance between ESC and TSC is reduced following contact in the “Reactive” interaction, but not in the “Non-reactive” one. Time is displayed in minutes. Scale bars, 25 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig6.jpg\nFigure 6. Example of reactivity quantification\nColumns indicate specific measurements performed in the protocol and in Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5].\nIdentifying cells of interest and initial quantification:\nUsing the Ftractin-mRuby3 signal, identify ESCs or primed ESCs that interact with a bead or TSC via a cytoneme.\nOptional: Crop these cells of interest from the larger field of view for ease of analysis and minimizing storage requirements.\nNote: Exclusion criteria: apoptotic/non-adherent cells, non-cytoneme-mediated interactions resulting from cell or bead movement, and interactions through cytonemes that are already in contact with a bead or TSC at the start of video are excluded from the analysis at this stage.\nQuantification of the interactions between ESC/primed ESC cytonemes and sources of Wnt (Wnt-beads or TSCs) (Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5], specific measurements are indicated in the figures).",
    "Observe the interaction between the ESC/primed ESC and the source of Wnt. Aim to identify the first contact between the cell and the source of Wnt, usually mediated by thin cytonemes (most clearly seen using the mRuby3 signal).\nFor all measurements listed below, record the values in an Excel sheet, one row per interaction analyzed (Figure 6[href=https://www.wicell.org#fig6], columns indicate specific measurements listed below).\nOnly for ESC/primed ESC-TSC interactions: Using the “Line” tool in Fiji, measure and register the initial distance between the ESC/primed ESC and the TSC (“Initial Distance”).\nRecord the frame in which the initial interaction occurs (“Time of contact”). Additionally, use the “Line” tool and measure the distance between the center of the ESC/primed ESC and the source of Wnt (the Wnt bead or the center of the TSC) at the time of interaction (“Distance at contact”).\nFramewise, determine if contact is maintained, resulting in either the bead being recruited towards the soma of the ESC/primed ESC, or in ESC/primed ESC-TSC pairing. This is categorized as a “Reactive interaction”. Record the frame where recruitment/pairing occurs (“Time of recruitment”).\nIf contact is not maintained, or if no subsequent recruitment/pairing occurs, the interaction is categorized as “Non-reactive interaction”.\nFor both “Reactive” and “Non-reactive” interactions, use the “Line” tool to measure and register the distance between the ESC/primed ESC and the source of Wnt in frames after contact: For ESC/primed ESC-Wnt-bead interaction measure the distance 3 frames (30 min) after contact (“Distance at contact+30”); for ESC/primed ESC-TSC pairing, measure the distance 5 frames (50 min) after contact (“Distance at contact+50”).",
    "Note: We find that 30 min (for ESC/primed ESC-Wnt-bead interaction) and 50 min (for ESC/primed ESC-TSC pairing) are enough to reliably capture the approximation between the ESC/primed ESC and the source of Wnt following initial contact (in “Reactive interactions”), or lack thereof (in “Non-Reactive Interactions”).\nContinue monitoring the interaction between the ESC/primed ESC and the source of Wnt. If ESC/primed ESC-Wnt source contact is lost, register the time of loss of contact (“Time of loss of contact”). If contact is maintained until the end of the video, register that time.\nAnalyze each interaction following these criteria, aiming to analyze at least 30 cells from each experiment (i.e., each video).\nRaw data processing, post-analysis and data representation (Figure 6[href=https://www.wicell.org#fig6]).\nPool cells from ≥ 3 independent experiments for post-analysis.\nCalculate the percentage of “Reactive Interactions” and the percentage of “Non-Reactive Interactions” of the total observed interactions.\nCalculate the “Change in distance after contact” by subtracting the “Distance at contact” from the “Distance at contact+30” (ESC/primed ESC-Wnt-bead interaction) or “Distance at contact+50” (ESC/primed ESC-TSC pairing).\nFor “Reactive interactions” only, calculate the “Time of Reaction” (time required for a cell to pair with or uptake the source of Wnt after initial contact) by subtracting the “Time of contact” from the “Time of pairing”.\nCalculate the “Time of Retention” by subtracting the “Time of contact” from the “Time of loss of contact”.\nFor all frame-based measurements, convert the values to minutes (1 frame = 10 min).\nRepeat analysis and post-analysis for all conditions examined (e.g., ESCs or primed ESCs interacting with control TSCs vs ESCs or primed ESCs interacting with IWP2-treated TSCs) and use Prism (GraphPad) for data presentation and comparison between conditions by statistical significance (described under “quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]”).\nImaging Wnt-mediated Ca2+ transients in the cytonemes of ESCs or primed ESCs",
    "Timing: 10–12 h\nThis protocol describes how to set up and image a slide of GCaMP6s-expressing ESCs or primed ESCs contacting Wnt3a-beads with cytonemes. For this, GCaMP6s-expressing ESCs or primed ESCs are pre-seeded in imaging slides for 4–6 h and transferred to a microscope. Wnt3a-beads are added whilst cells are in situ, to capture the initial stages of Wnt3a-bead interaction with the cytonemes. Imaging is performed every 5 s for 20 min for the same cell. The resulting images are used to measure the generation of Wnt-mediated localized Ca2+ transients in the cytonemes of ESCs. Variations of this protocol include adding Kainate (100 μM), CNQX (10 μM) or other drug treatments to the media (added after step 14, below), or the use of control-beads (e.g., iWnt3a-beads).\nPrepare a suspension of GCaMP6s-expressing ESCs or primed ESCs.\nStarting from a 6-well plate culture of ESCs or primed ESCs stably expressing GCaMP6s (prepared as described under “before you begin[href=https://www.wicell.org#before-you-begin]”), aspirate culture media and rinse once with PBS.\nAdd 0.5 mL 0.25% Trypsin-EDTA and return the plate to the incubator.\nIncubate for ∼4 min at 37°C, 5% CO2 until cells are detached.\nCritical: Do not incubate cells with 0.25% Trypsin-EDTA for longer than 5 minutes to minimize possible receptor cleavage.\nWith a 5 mL serological pipette, use 2 mL ESC basal media to resuspend the cells. Transfer cell suspension to a 15 mL Falcon tube.\nPellet cells by centrifugation at 1.2 × 103 rcf for 4 min at RT.\nAspirate supernatant, carefully avoiding the pelleted cells.\nResuspend pelleted cells in 1 mL ESC basal media by repeatedly pipetting up and down.\nUsing a glass hemocytometer, estimate the concentration of cell in the suspension.\nSeed GCaMP6s-expressing ESCs or primed ESCs for imaging.",
    "Dilute ESCs or primed ESCs to 7,000 cells per 250 μL in ESC basal media.\nTransfer cell mixture to a well of an ibiTreat μ-Slide 8 well slide (IBDI, cat. Num. 80826). Prepare several wells.\nReturn to incubator and incubate for 4–6 h at 37°C, 5% CO2 until cells are attached and generate cytonemes.\nInitial setup to image GCaMP6s-expressing ESCs or primed ESCs contacting Wnt3a-beads.\nOptional: Transfer cells to a pre-warmed polystyrene box for transport to the spinning disk microscope.\nPre-stabilize the incubation box of the spinning disk microscope at 37°C, 5% CO2\nPlace the cell-containing slide in the motorized stage.\nSelect the 20×/0.75 objective (or equivalent).\nPerform Kohler illumination adjustment of the transmitted light following standard procedures.\nAdd Wnt3a-beads (or control-beads, e.g., inactivated Wnt3a-beads, Wnt5a-beads or BSA-beads) to the slide. See Preparation of Wnt3a-beads and control beads and Wnt/β-catenin pathway activation assay[href=https://www.wicell.org#sec1.6] and (Habib et al., 2013[href=https://www.wicell.org#bib4]; Lowndes et al., 2017[href=https://www.wicell.org#bib10])\nPrepare a tube with 25 μL ESC basal media.\nTransfer 1 μg Wnt3a-beads (or control-beads, such as inactivated Wnt3a-beads, Wnt5a-beads or BSA-beads) to the tube with media and mix.\nCritical: to ensure homogenization and single-bead suspension, triturate stock Wnt3a-bead solution by pipetting up and down for >100 times using a ∼100 μL volume. This point is critical, as if skipped, beads will clump together in big clusters.\nAdd the diluted Wnt3a-bead solution to the well of GCaMP6s-expressing ESCs or primed ESCs, dropwise.\nIncubate for ∼15 min to allow the Wnt3a-beads to reach the bottom of the well.\nImage GCaMP6s-expressing ESCs or primed ESCs contacting Wnt3a-beads",
    "Using brightfield, chose a cell that is contacting a Wnt3a-bead with a cytoneme. Use the GCaMP6s channel to visualize the ESCs or primed ESCs and find an optimal z-plane that allows stable imaging of the interaction. Only one position containing one or a few cells is imaged at a time.\nAdjust laser intensities and exposure times to be as low as possible to avoid phototoxicity. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nSet up the time-lapse imaging protocol: one image every 5 s, for 20 min.\nOptional: Image a one-cycle loop to check that the setup is correct.\nRun imaging pipeline, capturing images for brightfield and GCaMP6s (GFP channel) at every loop.\nOnce finished, choose another cell/position and repeat imaging.\nAfter 4–5 cells/positions (approx. 1 h), change to a new well and repeat steps 16 and 17. This way the initial interaction between Wnt3a-beads and ESCs or primed ESCs will be observed.\nPerform analysis in the images obtained (see Quantifying localized Ca2+ transients on ESC or primed ESC cytonemes during interaction with a Wnt source[href=https://www.wicell.org#sec3.5]).\nQuantifying localized Ca2+ transients on ESC or primed ESC cytonemes during interaction with a Wnt source\nTiming: 3–6 h\nAll image quantification is performed in Fiji (ImageJ), and the step-by-step pipeline of analysis is described below. Raw data processing is performed in Excel, and an example of the layout is shown below (Figure 7[href=https://www.wicell.org#fig7]). Once processed, data representation and statistical analysis is performed in Prism (GraphPad).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig7.jpg\nFigure 7. Representative frames of a time-course imaging showing an ESC contacting a Wnt3a-bead (white arrowhead) with a cytoneme (dashed box & blue asterisk)",
    "Dashed box & orange asterisk designates the non-localized portion of the cell. GCaMP6s intensity is displayed using the “Fire” LUT (Fiji, ImageJ). Examples are shown for a cell that generates a localized Ca2+ transient in the cytoneme (Cell 1, top), a cell that generates a non-localized Ca2+ transient (Cell 2, middle) and a cell without a Ca2+ transient (Cell 3, bottom). Example signal intensity plots for the localized (dashed box, blue asterisk and plot) and non-localized (dashed box, orange asterisk and plot). Time is displayed in seconds and minutes. Scale bars, 25 μm.\nIdentifying cells of interest\nUse the GCaMP6s signal to identify single ESCs or primed ESCs that contact Wnt-bead with a cytoneme. Following Imaging Wnt-mediated Ca2+ transients in the cytonemes of ESCs or primed ESCs[href=https://www.wicell.org#sec3.4]), at least one cell per position should be contacting a Wnt3a-bead.\nOptional: Crop these cells of interest from the larger field of view for ease of analysis and minimizing storage requirements.\nInteractions resulting from cell motility or bead movement (i.e., non-cytoneme mediated interactions) are excluded from the analysis.\nNote: apoptotic/non-adherent cells are also excluded from the analysis.\nQuantifying localized Ca2+ transients on ESC/primed ESC cytonemes\nView the GCaMP6s signal using a high-contrast LUT, such as ‘Fire’ in ImageJ.\nCa2+ transients are identified qualitatively as a sharp increase in GCaMP6s signal, typically over the course of <30 s, which then diminishes to the basal level.\nCytoneme-localized transients (referred to as ‘localized transients’) are manually distinguished from whole-cell transients or those emanating from the cell-soma (see expected outcomes[href=https://www.wicell.org#expected-outcomes]). Localized transients arise from the contact area between cytoneme and Wnt-source, and may emanate to the rest of the cell, or remain in the cytoneme (Figure 7[href=https://www.wicell.org#fig7]).",
    "For each localized transient, record the start (“Start”, GCaMP6s signal increases) and end (“End”, GCaMP6s signal returns to basal level) time points.\nFrom this data, the duration of each localized transient (“Duration”), the mean duration of all transients occurring within each cell (“Mean Duration”) and the number of localized transients per cell (“Transients (#)”) can be calculated (see Figure 8[href=https://www.wicell.org#fig8] for an example of data organization).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1013-Fig8.jpg\nFigure 8. Example of localized Ca2+ transient quantification\nColumns indicate specific measurements performed in the protocol.\nWith the total recorded time of cytoneme-Wnt-source contact (“Total duration”), the mean number of transients per cell per minute (“Mean transients/min”) can be calculated.\nFrom the total number of cells included in the analysis (“Sample size (n)”), and the number of cells with >0 transients (“Cells with transients (#)”), the “Cells with transients (%)” can then be calculated (Figure 8[href=https://www.wicell.org#fig8])."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Biotechnology And Bioengineering",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Signal Transduction",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}