{
  "id": 9947,
  "origin_website": "Jove",
  "title": "Characterization of Multi-subunit Protein Complexes of Human MxA Using Non-denaturing Polyacrylamide Gel-electrophoresis",
  "procedures": [
    "NOTE: This protocol is based on the previously published non-denaturing PAGE protocol 12. In that study, the oligomeric state of the MxA protein was assessed using either Vero cells overexpressing MxA or IFN-α-stimulated A549 cells expressing endogenous MxA. The protocol described below can be used to analyze the oligomeric state of any protein in addition to MxA. However, further optimization may be required.\n1. Preparation of Cell Lysate for Non-denaturing PAGE\nNOTE: To analyze the oligomeric state of the human MxA protein in either Vero or A549 cells, 1.0 x 106 cells were harvested. Depending on the cell type or the abundance of the protein to analyze, the cell number should be adjusted. It is also important to protect the lysis buffer from light exposure, as soon as the light-sensitive iodoacetamide is added.\nSeed 0.3 x 106 A549 or Vero cells per well into 6 well-dishes. Keep the cells in 2 ml growth medium per well (see Table 1). Incubate cells overnight in a cell culture incubator (37 °C, 5% CO2).\nHarvest the cells by washing with 1 ml of phosphate buffered saline (PBS) and detach by adding 0.5 ml of 0.25% trypsin-ethylenediaminetetraacetic acid (EDTA) 1x solution for approximately 5 min at room temperature.\nAs soon as the cells detach from the dish, add 0.5 ml growth medium and carefully mix by pipetting up and down.\nTransfer the cells of each well into one 2 ml tube and pellet them using a table top centrifuge (5,000 x g, 4 °C, 5 min).\nCarefully remove the supernatant by pipetting without disturbing the cell pellet.\nWash the cells with 1 ml ice-cold PBS by carefully pipetting the cell suspension up and down.\nPellet cells in a table top centrifuge (5,000 x g, 4 °C, 5 min).",
    "Carefully remove the supernatant by pipetting without detaching the cell pellet.\nResuspend cells in 200 μl ice-cold lysis buffer (see Table 1) by pipetting up and down and put on ice.\nImmediately, protect lysate from light by covering the tubes using tin foil and incubate for 30 min on ice.\n\tNOTE: After incubation for 30 min on ice, it is no longer essential to protect the lysate from light exposure, since the protection of the free thiol groups is irreversible.\nRemove cell debris by centrifugation in a pre-chilled table top centrifuge (13,000 x g, 4 °C, 20 min).\nEquilibrate dialysis columns in dialysis buffer (Table 1) in the cold room at 4 °C for 20 min during the centrifugation step. Use a column with a molecular weight cut off of 10,000.\n\t\nAttach the columns to a float buoy and put them into a beaker filled with dialysis buffer. To ensure gentle stirring, use a magnetic stirrer. Do not touch the membrane.\n\t\tNOTE: Dialysis columns can be purchased or prepared from 1.5 ml tubes according to the protocol described by Fiala and coworkers 19.\nRemove the columns from the dialysis buffer and the float buoy. Transfer the cleared lysates into the prepared dialysis column by pipetting without touching the membrane. Attach the columns to a float buoy and put them back into the beaker filled with dialysis buffer.\nDialyze the lysate in a beaker containing ice-cold dialysis buffer (Table 1) for at least 4 hr (or preferably overnight) at 4 °C while carefully stirring using a magnetic stirrer. Use at least 100 ml dialysis buffer for a 200 µl lysate.",
    "Transfer the dialysed sample into a 1.5 ml tube. Remove precipitates by centrifugation in a table top centrifuge (13,000 x g, 4 °C, 20 min). To prevent the dissociation of the oligomeric protein complexes continue with the protocol (section 2) immediately after dialysis. Do not freeze the prepared lysates.\n2. Electrophoresis\nNOTE: Electrophoresis was performed as described before with some modifications 22. In the protocol described below, pre-cast gradient gels were used (4-15% gradient). Alternatively, the gels can be prepared in the laboratory. It is very important to exclude any denaturing agent such as SDS to prevent the dissociation of the oligomeric protein complexes. Time of electrophoresis was optimized for the different oligomeric states of the human MxA protein. However, it can vary for other proteins, depending on the size of the oligomeric complex as well as the range of separation that is supposed to be achieved to analyze the complex. Therefore, the optimal time of electrophoresis should be determined empirically. For optimal resolution of the oligomers to be analyzed the current should not exceed 25 mA.\nAssemble the non-denaturing PAGE gel in the gel chamber. Fill the inner and outer chamber with pre-chilled running buffer (Table 1).\nPre-run the gel with pre-chilled running buffer at 25 mA per gel for 15 min in the cold room at 4 °C.\nMix 15 µl of the above prepared lysates with 5 µl of 4x sample buffer (Table 1). Do not boil the sample.\nLoad 15 µl of sample and a native protein standard of choice on the gel. Run the gel at 25 mA for 4 hr in the cold room at 4 °C.",
    "NOTE: For semi-quantitative analyses, a protein quantification protocol (e.g. a Bradford protein assay 23) can be performed in order to ensure loading of equal amounts of total protein per lane.\n3. Western Blot\nNOTE: Described below is the protocol of a wet western blot system. Any blotting membrane can be used. Activate polyvinylidene fluoride (PVDF) membranes in 100% methanol before equilibration in blotting buffer. The Semi-dry western blot technique can be used alternatively, but has to be optimized for large oligomeric complexes.\nDisassemble the gel and carefully transfer it into SDS buffer (Table 1).\nIncubate for 10 min at room temperature while gently shaking.\nPrepare 2 sponges, 4 cellulose filter paper sheets and a blotting membrane per gel. Soak them in blotting buffer (Table 1).\nAssemble the sandwich as follows (bottom to top): 1 sponge, 2 cellulose filter paper sheets, membrane, gel, 2 cellulose filter paper sheets, 1 sponge.\nPut the sandwich into the blotting tank. Make sure that the membrane faces the plus pole while the gel faces the minus pole.\nFill the blotting tank with pre-chilled blotting buffer.\nBlot at 90 mA overnight at 4 °C for best protein transfer results.\nDisassemble the sandwich and visualize the protein standard by incubating the membrane in Ponceau S solution for 5 min at room temperature.\nDestain the membrane by carefully washing off the Ponceau S with deionized water until you can clearly see the bands of the protein standard.\nMark the bands of the protein standard using a pen.\n\tNOTE: Residual Ponceau S can interfere with the immunostaining. To avoid this, the membrane can be destained further by incubation in 0.1 M NaOH for 1 min and subsequent washing with deionized water.",
    "Block the membrane with Blocking buffer (see Table 1) for at least 1 hr at room temperature or overnight at 4 °C.\nVisualize protein(s) of interest by immunostaining using antibodies directed against the protein to be analyzed.\n\tNOTE: The human MxA protein was visualized using the rabbit polyclonal antibody specific for human Mx1 diluted 1:1,000 in Blocking buffer (Table 1). The antibody solution was incubated overnight at 4 °C. Alternatively, the monoclonal anti-MxA antibody (clone 143) can be used (data not shown) 24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}