{
  "id": 13075,
  "origin_website": "Jove",
  "title": "Zygote Microinjection for Creating Gene Cassette Knock-in and Flox Alleles in Mice",
  "procedures": [
    "All animal experiments were conducted humanely with approval from the Institutional Animal Experiment Committee of the University of Tsukuba, according to the Regulations for Animal Experiments of the University of Tsukuba and the Fundamental Guidelines for Proper Conduct of Animal Experiments and Related Activities in Academic Research Institutions under the jurisdiction of the Ministry of Education, Culture, Sports, Science, and Technology of Japan. C57BL/6J mice of both sexes, 10-25 weeks old, were used as the zygote donor. ICR mice (older than 10 weeks) were used as the recipient mice. The mice were obtained from commercial sources (see Table of Materials).\n1. Confirmation of crRNA cleavage activity in a cell-free system\nDissolve 2 nmol of crRNA (dry) and 20 nmol of tracrRNA (dry) in 25 µL and 250 µL of RNase-free water, respectively (see Table of Materials).\n\tNOTE: CRISPR target sequences that were predicted to have high cleavage activity and as few off-targets as possible are selected using CRISPOR (see Table of Materials). In the case of gene cassette knock-in, target the sequence across the insertion site. The exon(s) to be floxed were selected using the KOnezumi (see Table of Materials).\nAmplify the DNA fragment (approximately 0.5-1 kb) containing the target site by genomic PCR9. Purify this PCR amplicon with the common PCR product extraction kit (see Table of Materials).\nPrepare 10 µL of CRISPR mixture (100 ng/µL of crRNA, 150 ng/µL of tracrRNA, and 1 ng/µL of Cas9 in the Cas9 Nuclease Reaction Buffer, see Table of Materials). To construct the CRISPR-Cas9 complex, place the CRISPR mixture in a heat block at 37 °C for 30 min.",
    "Add the total volume (10 µL) of CRISPR mixture to the PCR product (10 µL, 20 ng/µL) described in step 1.2 and incubate at 37 °C for 1 h. Add 1 µL of RNase (500 ng/µL) to degrade the crRNA and tracrRNA at 37 °C for 30 min, as RNAs must be absent during electrophoresis. Perform electrophoresis of the above samples using loading dye containing sodium dodecyl sulfate (2% w/v).\n\t​NOTE: In rare cases, crRNAs with no cleavage activity are observed. In such cases, it is recommended to redesign the genome editing design.\n2. Preparation of the mixture of crRNA, tracrRNA, Cas9 protein, and donor DNA for zygote microinjection\nPrepare CRISPR solution (50 ng/µL of crRNA, 200 ng/µL of tracrRNA, and 200 ng/µL of Cas9 in RNase-free water). Prepare a donor DNA solution (20 ng/µL of self-constructed plasmid DNA vector).\n\t\nFilter the donor DNA solution through a sterile syringe filter with a 0.22 µm pore size. Mix equal volumes of CRISPR solution and filtered donor DNA solution. Ensure that the final concentration of each is 25 ng/µL of crRNA, 100 ng/µL of tracrRNA, 100 ng/µL of Cas9, and 10 ng/µL of donor DNA. This mixture will hereafter be referred to as RNPD.\n\t\tNOTE: When cutting two sites, such as during floxed mice production, the concentration of each crRNA must be 25 ng/µL. The donor DNA is a circular plasmid DNA and can be purified with a common mini prep spin column kit (see Table of Materials). The prepared solution must be placed on ice and used for micro-injection as soon as possible.\n3. Obtaining mice zygotes by natural mating",
    "Inject 5 IU of pregnant mare's serum gonadotropin (PMSG, see Table of materials) subcutaneously into C57BL/6J female mice (10-25 weeks old) 3 days before microinjection. Approximately 46-48 h later, administer 5 IU of human chorionic gonadotropin (hCG, see Table of materials) intraperitoneally. Co-house the PMSG- and hCG-treated female mice with male C57BL/6J mice and check the vaginal plugs the following morning.\n\tNOTE: Approximately 15-25 zygotes can be obtained from one female C57BL/6J mouse. The timeline is shown in Figure 1.\nPrepare two 35 mm Petri dishes for zygote culture, as shown in Figure 2. Place them in the incubator (37 °C, 5% CO2) until use. These can be stored overnight.\nEuthanize the female mice with confirmed vaginal plugs by cervical dislocation and, using small scissors, incise through the abdominal skin and muscle layer from the midline of the lower abdomen to below the ribs.\n\tNOTE: Follow local animal ethics committee recommendations for euthanasia.\nCollect the oviducts and place them in a 20 µL drop of M2 medium containing 0.75 mg/mL of hyaluronidase (see Table of Materials) on the lid of the Petri dish. Pick up one oviduct with fine tip forceps and perfuse about 50 µL of M2 medium with hyaluronidase through the fimbriae.\n\tNOTE: At this time, the zygotes are loosely surrounded by numerous cumulus cells.\nAfter 30 s, pick up morphologically normal zygotes with a small amount of medium using a glass capillary and wash them by transferring them to fresh M16 medium droplets. Transfer the washed zygotes into a Petri dish (Figure 2) for pooling.\n\tNOTE: The timeline is shown in Figure 1. Morphologically normal zygotes have a male and female pronucleus and two polar bodies that have not severely compromised the spherical shape15. The morphology of the zygote varies considerably among strains and species.",
    "Repeat steps 3.3 and 3.4 until all zygotes are retrieved. About 100 zygotes can be pooled in one M16 drop in the culture dish. Store the dish in the incubator (37 °C, 5% CO2) until microinjection.\n4. Preparation of the microinjection needle\nPull some glass pipettes using the programmable pipette puller (see Table of Materials).\n\tNOTE: Microinjection needles must have a thin tip and long taper. If the puller has a program for making needles for intracytoplasmic sperm injection, the same program can be used to make needles for microinjection.\nBreak the tip of the microinjection needle by hitting the glass ball attached to the microforge tip. Ensure that the tip size of the microinjection needle is around 1 µm in diameter. Check the tip size under a microscope at 1000x magnification.\nBend the microinjection needle at about 2-3 mm from the tip using a microforge.\n\t​NOTE: The angle of the bend depends on the setup of the micromanipulator. Too much bending will reduce the effectiveness of the piezo pulse.\n5. Zygote microinjection\nInject 1-1.5 cm of the operation liquid (inertia body that is needed for the piezo effect to make holes as an alternative to mercury, see Table of Materials) into the center of the microinjection needle and attach it to the manual microinjector holder with the piezo actuator.\n\t\nFurther, attach the holding needle to the opposite manual microinjector holder. Move the operation liquid to the microinjection needle tip with gradual pressure. Fix both the manual microinjector holders on the micromanipulator.",
    "NOTE: The operation liquid coming out of the tip of the microinjection needle can be observed under a microscope at 50x magnification. After adjusting the amount of liquid emitted, the splashing of liquid can be observed when the piezo pulses are applied, confirming that the piezo pulses are effective. If this cannot be confirmed, re-prepare the microinjection needle.\nPrepare an injection chamber with three droplets: (1) 10 µL of M2 medium; (2) 5 µL of 12% polyvinylpyrrolidone (PVP) in M2 medium; and (3) a 5 µL mixture of crRNA, tracrRNA, Cas9 protein, and the Donor DNA (RNPD) solution. Cover the droplets with mineral oil in the same manner as step 3.2 and set the injection chamber on the inverted microscope stage.\n\t\nUnder the inverted microscope at a 50x magnification, lower the microinjection pipette into the 12% PVP drop. Aspirate and dispense 12% PVP to clean the inside of the microinjection needle tip and transfer it to the RNPD droplet.\nPut the manual microinjector under negative pressure and suck up the RNPD solution into the microinjection needle. Wait for a few minutes until a sufficient volume is aspirated; under a microscope magnified 50x, fill the entire inside of the microinjection needle with liquid.\n\t\nStop the intake and allow the RNPD solution to be expelled gradually by setting the manual microinjector to positive pressure. Move the tip of the microinjection needle into the oil.\n\t\tNOTE: Turn the knob of the manual microinjector counterclockwise for inhalation. To stop inhalation, rotate the knob clockwise and gradually increase the pressure while observing under a microscope. The RNPD solution will be gradually drained. Liquid level movement in the microinjection needle allows confirmation of the outflow.",
    "Put 50 zygotes in the M2 droplet and gently lower the holding pipette into the same droplet. Transfer the microinjection needle to the M2 drop containing zygotes. Switch to a 20x objective and focus on the tip of the microinjection pipette.\n\tNOTE: Put as many zygotes that can be injected in 10 min.\nHold a zygote and focus on the pronucleus by moving the micromanipulator. Insert the microinjection needle into the zygote and bring the tip close to the pronucleus. Once the tip reaches the pronucleus membrane, apply the piezo pulse (intensity: 6-10, speed: 1) to pierce.\n\t\nWhen the microinjection needle punctures the pronucleus, inject the RNPD solution, and observe the swelling of the pronucleus. Once the pronucleus is fully inflated, quickly pull out the needle. Perform the same procedure on both the female and male pronuclei.\n\t\tNOTE: The inflation of the pronucleus by injection can be clearly seen under the microscope. The degree of this inflation is difficult to verbalize but can be confirmed by referring to previous reports15.\nMove the injected zygote to another location within the M2 droplet to identify the zygotes before and after injection.\nRepeat steps 5.5-5.6 until all the zygotes in the M2 droplet have been injected. After the injection, transfer the zygotes into a fresh M16 dish.\nSelect the survived zygotes 10 min after injection. Remove the lysed zygotes which are damaged by the injection and distribute survived zygotes to each droplet in the M16 dish. Each droplet must contain 20-24 zygotes for one pseudopregnant female. This reduces the time the M16 dish is exposed to the environment outside the incubator during embryo transfer.",
    "​NOTE: Under optimal injection conditions, the survival rate is 90%-95%. This depends on the size of the needle tip, the strength of the piezo pulse, and the outflow pressure of the RNPD solution.\n6. Embryo transfer into the oviduct\nFor obtaining pseudopregnant mice, mate each female ICR mouse in the proestrus phase with a vasoligated male ICR mouse. Check the plugs the following day.\n\tNOTE: Approximately 15 pseudopregnant mice are obtained from 20 mating pairs.\nAdminister three types of mixed anesthetic agents (0.2 mg/kg of medetomidine, 4.0 mg/kg of midazolam, and 2.5 mg/kg of butorphanol, see Table of Materials) subcutaneously to the pseudopregnant female mice. Confirm appropriate anesthesia by a decrease in respiratory rate and disappearance of the tail-pinch and hindlimb pedal withdrawal reflexes. Apply ophthalmic ointment to lubricate the eyes as per local animal ethics committee recommendations.\nAfter razor-shaving the dorsal region of the mouse in the prone position and disinfecting the surgical area three times, alternating between an iodine or chlorhexidine-based scrub and alcohol, incise the dorsal skin approximately 1 cm along the spine with small dissecting scissors.\nShift the dorsal incision wound to one side ventrally, incise the muscle layer through which the ovary can be seen, grasp the fat above the ovary with tweezers, and withdraw the ovary, oviduct, and uterus.\n\t\nSecure the fat with a serrefine clamp (see Table of Materials). Place the reproductive tissues on sterile gauze to avoid direct contact with the coat.\nIn the following order, place a small amount of culture medium (M2 or M16), some air bubbles as a marker, and the zygotes in a pipette for transfer.\n\tNOTE: Transfer approximately 10-12 zygotes per oviduct.",
    "Make an incision using a micro shear (see Table of Materials) between the ampulla and the fimbriae of the oviduct (just long enough to allow the glass pipette to enter), introduce the zygotes into the incision, and simultaneously confirm that the air bubble has been introduced.\nPerform the implantation into the other oviduct similarly (step 6.6).\nSuture the outer skin with autoclips (see Table of Materials).\n\t​NOTE: Do not suture the incised muscle layer unless the incision wound is unavoidably large. The ideal size of the incised muscle layer should be less than 2-3 mm. If the incision is greater than 5 mm, the muscle layer should be sutured using a sterilized suture needle and thread (see Table of Materials).\n7. Animal recovery\nAdminister atipamezole hydrochloride (0.3 mg/kg) subcutaneously to mice.\n\tNOTE: Follow local animal ethics committee recommendations for post-operative analgesia.\nThen, place the mice in cages and keep them warm on a hot plate at 37 °C.\nAfter the mice are awakened, keep them warm for about 2 h. After confirming no abnormal behavior of the mice, return the cages to the breeding rack."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}