{
  "id": 2191,
  "origin_website": "Cell",
  "title": "A modified surgical procedure using minimally invasive ileocolic vein perfusion in a mouse intrahepatic islet transplant model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInduction of diabetes by streptozotocin\nTiming: 30 min\nOn day -4, measure the body weight of C57BL/6J mice (7–10-week-old) using a digital scale.\nPrepare 20 mg/mL solution of streptozotocin (STZ) in 0.9% saline.\nNote: STZ-saline should be prepared fresh just prior to injection to avoid STZ degradation.\nInject STZ solution into a mouse via tail vein at dose of 200 mg/kg using a 27G needle.\nNote: Prior to injection, warm animals for 5–10 min to dilate the veins to facilitate injection.\nMeasure the blood glucose level (BGL) and body weight on day -1 post STZ injection. Measure BGL at fixed time frame, such as between 9:00–10:00 a.m.\nNote: Weight loss and polyuria are hallmarks of diabetes and may help to predict the onset of diabetes. In general, excessive weight loss (>10% of initial body weight within 4 days) is an indication of STZ toxicity, which is expected.\nMice with non-fasting blood glucose >300 mg/dl on day -1 and day 0 with respect to islet transplantation are considered diabetic and used for transplantation.\nNote: Mice with non-fasting blood glucose levels greater than 400 mg/dl on days -1 and 0 can be given 2 U of exogenous insulin on days 0–3 post transplantation to alleviate diabetic stress.\nNote: We use EVENCARE G2 Blood Glucose Meter system for blood glucose monitoring. Other brands also can be used.\nIsolation of pancreatic islets\nTiming: 2.5–3 h (for 4 mice) for steps 6–9\nTiming: 20 min for step 10\nPancreas perfusion and removal.\nEuthanize islet donor using short CO2 inhalation followed by secondary physical method of cervical dislocation or anesthetic reagents to confirm euthanasia.\nClean the mouse dorsal and ventral external surfaces area with 70% alcohol to prevent fur contamination during dissection.",
    "Lift the lower abdominal skin with forceps and make a small (10 mm) cut through the epidermis and dermis leaving underlying membrane intact with scissors.\nUsing forceps, carefully peel the skin away from the abdominal cavity, exposing the entire abdominal cavity to the extremities.\nTo reveal the abdominal cavity, make a horizontal cut (∼1 cm) where the diaphragm/rib cage ends without damaging the liver.\nThen make vertical cut toward the limb on both sides.\nOpen the abdominal cavity and spray viscera with saline solution.\nUnder the dissecting microscope, locate the common bile duct until it reaches the small intestine (Figure 1[href=https://www.wicell.org#fig1]A). Clamp the bile duct close to the sphincter of Oddi with a bulldog clamp to prevent the collagenase solution from entering the intestine during pancreas inflation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1668-Fig1.jpg\nFigure 1. Pancreas perfusion\n(A) Close-up image of the bile duct. The abdominal cavity showing the pancreas before inflation.\n(B) The inflated pancreas after collagenase injection through the bile duct. BD, bile duct; GB, gallbladder; P, pancreas; S, stomach; Sp, spleen; LI, large intestine; Du, duodenum; SO, sphincter of Oddi.\nInflate the pancreas with 2.5–3 mL of cold Liberase solution using 3 mL syringe with 31G needle. Inflation is complete when the entire pancreas (including the tail section adjacent to the spleen) became engorged and appears gelatinous (Figure 1[href=https://www.wicell.org#fig1]B).\nNote: Other collagenases can also be used to isolate islets from the pancreas. Collagenase V and collagenase P, for example, but the time required for digestion varies depending on the enzyme and animal source. Prior to conducting batch experiments, enzyme should be titrated to determine the optimal concentration and incubation time.",
    "First remove clamp then carefully separate the pancreas from the surrounding tissues and place it in a petri dish to remove the lymph nodes and fat tissue, if needed, before placing it in a 50 mL Conical Falcon tube on ice.\nCritical: Try to puncture pancreas as close to the hepatic hilum as possible. In case of failure, you can continue to re-puncture distally. Try to clamp the sphincter of Oddi. If the clamp is incomplete, the perfusate will enter the small intestine; if too much is clamped, the pancreas will be under perfused.\nCritical: Pancreas harvest must be completed within 1 h to prevent excessive enzymatic digestion.\nPancreas digestion.\nTransfer the tubes to a 37°C water bath and incubate for 11–12 min without agitation.\nCritical: Optimization of incubation time may be necessary as Liberase activity may vary from batch to batch. Examine islets under a microscope to assess if they are under-or over-digested.\nUse a disposable 10 mL pipette to pipet up and down the pancreatic tissue until becomes homogeneous.\nStop the enzymatic reaction first by adding 2 mL of FBS, after thoroughly mixing to achieve a homogenous suspension, then add 20 mL cold wash medium. Followed by closing the 50 mL falcon tube cap and shaking the tube until a fine sand-like consistency is obtained.\nSpin at 150 × g for 1 min at 4°C with 9 g acceleration and deceleration.\nDecant the supernatant and resuspend the pellet in 10 mL wash medium using a pipet.\nFilter the suspension through a 500 μm woven mesh filter. Rinse the tube with an additional 10 mL of wash medium and pass through a 500 μm filter.",
    "Let the cells settle for 3 min at 18°C–25°C. Aspirate the supernatant off with a 10 mL pipette until only 5 mL of solution remains, being careful not to disturb the pellet. This wash step should be repeated three times.\nIslet purification.\nTransfer the islet suspension in a STERILE, 14 mL polypropylene round-bottom tube, which is coated with 30% FBS solution (2–3 pancreases/tube).\nRinse the 50 mL falcon tube with 2–3 mL additional wash medium and transfer it to a 14 mL polypropylene tube, maintaining the final volume at 12 mL.\nCritical: Coat 14 mL polypropylene round-bottom tube with coating media (Coating media is 30% FBS -wash media).\nSpin for 2 min at 4°C at 200 × g with 9 g acceleration and deceleration. Decant the supernatant (SN) and then drain the access of SN by tilting the tube at a very low angle to remove remaining SN.\nNote: At this point, the islet pellet will be loose; keep an eye on it while removing the remaining wash media to avoid a change in Ficoll density.\nTurn off the light, add 4 mL of 25% Ficoll over the pellet by using the low-speed pipetting technique, and then vortex the tubes to mix well the islet pellet with Ficoll. Overlay 2 mL of 23%, 20.5%, and 11% Ficoll sequentially.\nChange the centrifuge settings to minimal acceleration with no brake and spin the tubes at 750 × g for 20 min. The islets will migrate to the 11%–20.5% and 20.5%–23% interface (Figure 2[href=https://www.wicell.org#fig2]A). Use a disposable plastic pipette to transfer the islets into two FBS-coated 15 mL Falcon tubes with 5 mL of wash media and 1 mL of FBS. Transfer each interface to a different 15 mL tube.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1668-Fig2.jpg\nFigure 2. Islet purification and handpicking",
    "(A) Pancreatic islets were purified by discontinuous density centrifugation with Ficoll solution. Majority of islets locate to the 11%–20.5% interface, while less pure islets are at the 20.5%–23% interface.\n(B) Representative image of isolated islets from 8-week-old female BALB/cJ mouse before handpicking. Arrow shows exocrine acinar cells in the islet preparation.\n(C) Almost 100% pure islets after handpicking. Images were taken under an inverted microscope at 10 × magnification.\n(D) Islets can be easily distinguished from exocrine tissue by DTZ that stains islets as crimson red.\nNote: Islets with higher purity are at the 11%–20.5% interface, while those with lower purity are at the 20.5%–23% interface.\nAlternatives: While Ficoll-400 is the most widely used density gradient medium, other solutions such as Histopaque-1077 are also frequently used for islet separation (McCall et al., 2011[href=https://www.wicell.org#bib6]) based on the principle that islets are separated by centrifugal force due to their distinct density from the exocrine tissue.\nBring the volume to 12 mL with wash media and spin at 250 × g for 1 min at 4°C.\nAspirate off the supernatant and add 12 mL of complete medium to wash the islets. Repeat this wash step for a total of three times.\nIslet culture.\nResuspended islet pellet in 10 mL medium and transfer it to a 100 mm petri dish. Rinse the tube with an additional 5 mL of complete medium and transfer to the petri dish.\nCarefully handpick islets with a 10 μL pipette tip using a stereo microscope with bottom lights (Figures 2[href=https://www.wicell.org#fig2]B and 2C) and transfer them to a 15 mL tube with 2 mL of complete medium.\nOnce all the islets are collected, transfer islets to a sterile 60 mm petri dish and incubate overnight (14–16 h) at 37°C and 5% CO2.",
    "Critical: To avoid islet loss during transferring, ensure all the tubes, pipet, and dishes are coated with 30% FBS coating buffer. Petri dishes are not tissue culture-treated to maintain islets in suspension.\nCritical: To avoid islet hypoxia, do not culture more than 300 islets in a 60 mm petri dish with the 8–10 mL medium. Distribute islets evenly throughout the dish to avoid aggregation.\nIslet counting.\nSamples are taken and stained with DTZ. Islets are measured and counted under the microscope. Islets are calculated as Islet Equivalent (IEQ) per the following table.\ntable:files/protocols_protocol_1668_4.csv\nNote: Add 1–2 drops of iDTZ stock solution into 100 μL of islet solution. Allow islet staining with DTZ 1–2 min at 18°C–25°C. Islets can be distinguished from exocrine tissue due to scarlet staining (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: This IEQ counting formula is also used in the clinic. It is more accurate to apply IEQ for islet transplantation due to the different sizes of islets that facilitates standardization of islet transplantation to accomplish comparison of data among different laboratories.\nIslet intrahepatic transplantation\nTiming: 30 min per transplantation\nTransfer viable islets by excluding those with darker core is greater than 50% of the total area of the islet (Figure 4[href=https://www.wicell.org#fig4]) (damaged due to hypoxia) to 15 mL tubes and wash with PBS 2 times.\nTransfer islets into the 6 cm petri dish containing PBS.\nIslets are collected in the center of the dish by swirling the petri dish and aspirated into the 1 mL syringe under a stereomicroscope (Methods video S1[href=https://www.wicell.org#mmc1]: Islet intrahepatic transplantation, related to step 13).",
    "Invert the syringe to allow the islets to settle and attach a homemade needle (Figure 3[href=https://www.wicell.org#fig3]A) to remove excess air bubbles and fluid, retaining approximately 200–300 μL solution. The syringe is then inverted with the needle facing downwards and held in place to allow the islets to settle near the needle (Methods video S1[href=https://www.wicell.org#mmc1]: Islet intrahepatic transplantation, related to step 14).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1668-Fig3.jpg\nFigure 3. Preparation and perfusion of islets into the liver by the ileocolic vein, which is a terminal branch of portal vein\n(A) Islet perfusion set built in-house, including loading tip, butterfly needle, and 1 mL syringe. This instrument ensures that islets settle down to the needle, allowing for a complete islet injection into the portal vein.\n(B) The ileocolic vein can be easily exposed without disturbing other abdominal organs.\n(C) Schematic diagram of the anatomy of the portal vein system in the mouse.\nCritical: Petri dish and syringe should be pre-washed with 30% FBS coating buffer to prevent islet adhesion. It is important to allow the islets to settle down in the needle to inject all islets into the bloodstream without a loss. This step is especially critical when marginal islet numbers (such as 100–200 IEQ/Tx) are used for transplantation.\nThe recipient is anesthetized, shaved, and the abdomen is sterilized with 70% ethanol. A midline 1–1.5-cm abdominal incision is made to localize the ileocecal region and fully expose the ileocolic veins (Figures 3[href=https://www.wicell.org#fig3]B and 3C) and (Methods video S1[href=https://www.wicell.org#mmc1]: Islet intrahepatic transplantation, related to step 15).\nPierce into the Ileocolic vein with 25G needle distally and infuse the islets slowly. Then press the hemostatic sponge against the puncture point, retract the needle, and compress to stop bleeding using absorbable gelatin sponge for 2–3 min, (Methods video S1[href=https://www.wicell.org#mmc1]: Islet intrahepatic transplantation, related to step 16).",
    "Note: The injection volume should not exceed 300 μL as excess fluid may cause circulatory overload in the mouse.\nCarefully incorporate the intestine back into the abdominal cavity and close the abdomen. Post-surgery, provide analgesia, place the mouse on a heating pad at 37°C and observe until the mouse is awake and active (Methods video S1[href=https://www.wicell.org#mmc1]: Islet intrahepatic transplantation, related to step 17). Provide postoperative analgesia to effectively deliver pain relief based on the time and dose specified.\nCritical: To avoid post-transplant bleeding, do not pull too hard on the injected vessel.\nMeasure the blood glucose levels at least twice a week for up to 30 days and then weekly afterward.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Islet intrahepatic transplantation, related to Islet intrahepatic transplantation (steps 13–17)"
  ],
  "subjectAreas": [
    "Health Sciences",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}