{
  "id": 2781,
  "origin_website": "Cell",
  "title": "Protocol for wireless deep brain stimulation in freely behaving mice with infrared light",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStereotaxic injection of AAV\nTiming: 1 h\nThis section describes the procedures for stereotaxic injection of AAV into the VTA of the mouse brain. The surgery procedure was adapted from a previous report with revisions (Cetin et al., 2006[href=https://www.wicell.org#bib1]).\nTake out the aliquoted AAV from the −80°C freezer. Thaw the virus on ice.\nSterilize all surgical tools with an autoclave. Put the sterilized tools on a sterile gauze pad.\nAnesthetize a mouse.\nWeigh and anesthetize a mouse with intraperitoneal injection of ketamine (80 mg/kg) and dexdomitor (1 mg/kg) cocktail.\nPut the mouse on a heating pad of a homeothermic monitoring system with the temperature set to 37°C to prevent hypothermia.\nVerify the degree of anesthesia through toe pinch before starting the surgery.\nApply vet ointment on both eyes of the mouse to keep them moist throughout the surgery.\nSubcutaneously inject buprenorphine SR (1 mg/kg) for analgesia.\nSubcutaneously inject 0.2 mL of prewarmed saline to prevent dehydration.\nRemove the hair using the hair removal lotion.\nUse an alcohol pad to gently moisturize the hair, then apply the hair removal lotion using a cotton-tipped applicator.\n1–2 min later, remove the lotion with a clean cotton-tipped applicator (troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nSterilize the exposed skin with betadine and 70% ethanol, alternating three times.\nNote: We recommend thorough depilation of the head and the neck to prevent accidental NIR-II illumination on the fur in later procedures.\nFix the animal in the stereotaxic frame.\nFix the left ear bar, and gently move the mouse head forward so that the ear canal is close to the ear bar.\nHold the mouse head still, then gradually put the right ear bar in place. The fixing is appropriate if no lateral movement of the head is possible.",
    "Fix the mouth into the anterior adaptor by first pulling down the lower jaw with forceps and then putting the maxillary incisors into the opening of the adapter.\nCheck the status by gently pressing the head with a cotton-tipped applicator. If no head movement is observed, the fixing is appropriate.\nUse a sterile scalpel to make a 1-mm incision on the scalp, then use sterilized spring scissors to gradually elongate the incision to expose the skull. Make sure that both bregma and lambda are exposed (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nAdjust the angle of the head to make it horizontal.\nFix a blunt needle onto the stereotaxic frame and use it to measure the DV positions of bregma and lambda on the skull.\nAdjust the angle of the head to make sure bregma and lambda have the same DV positions.\nMark the position of VTA on the skull using a sterilized pencil.\nNote: The stereotaxic coordinate of VTA with respect to bregma is AP: -3.5 mm, ML: 0.4 mm.\nGently drill a hole (0.5-mm in diameter) on the marked position on the skull. Use a stereoscopic microscope for better visualization and control of the drilling process (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nLoad ∼ 3 μL of AAV solution into the Hamilton syringe and fix the syringe onto the stereotaxic frame.\nNote: For TRPV1 (-) control experiments, a blank AAV solution of the same serotype and titer should be loaded into the syringe instead.\nPlace the tip of the syringe on the bregma and zero the positioning system (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nRaise the syringe by 5 mm, then move it to AP: -3.5 mm, ML: 0.4 mm. The syringe should now be over the burr hole in the skull.\nSlowly lower the heel of bevel of the needle to the DV location of VTA (-4.2 mm).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2290-Fig1.jpg",
    "Figure 1. DV positions of the needle\n(A) Microscopic image of the needle tip of a Hamilton syringe. The scale bar represents 0.2 mm.\n(B and C) The incorrect (B) and correct (C) DV positions of the inserted needle tip.\nCritical: Since the needle is beveled, there is a distance between the tip and the heel of bevel of the needle (Figure 1[href=https://www.wicell.org#fig1]A). Make sure the heel of bevel of the needle is lowered to the position of VTA for more precise viral transduction (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nWait for 5 min after the needle has advanced to the target, and then inject 2.5 μL of AAV solution at a rate of 0.1 μL/min.\nNote: The injection rate can be controlled by the Nanojet stereotaxic syringe pump.\nAfter the injection is finished, wait for 2 min before withdrawing the needle to prevent the backflow of the virus.\nRelease the mouse from the stereotaxic frame.\nPut the incised scalp back in place to cover the exposed skull.\nApply Vetbond tissue adhesive to seal the skin.\nApply antibiotic ointment around the wound with a cotton-tipped applicator to prevent infection.\nNote: The Vetbond tissue adhesive acts as an effective means for sealing the scalp, thus requiring no suturing.\nSubcutaneously inject atipamezole (1 mg/kg) to help accelerate the recovery process.\nPut the mouse back to the cage, with half of the cage placed on top of the heating pad set to 37°C.\nStereotaxic injection of MINDS\nTiming: 1 h (3–4 weeks after completion of stereotaxic injection of AAV)\nThis section describes the procedures for stereotaxic injection of MINDS into the VTA of the mouse brain. This step is similar to the previous step “Stereotaxic injection of AAV”, and identical procedures will only be briefly described.",
    "Prepare the surgical tools as described in step 2. Anesthetize the mouse and fix it in the stereotaxic frame as described in steps 3–11.\nFind the burr hole in the skull drilled for the previous stereotaxic injection.\nNote: Make sure the burr hole is accessible and large enough for needle insertion. If not, enlarge the hole using a drill according to step 13. Use the stereoscopic microscope for better visualization and control if additional drilling is needed.\nLoad ∼ 3 μL of MINDS solution (1.8 mg/mL) into the syringe and inject 2.5 μL into the VTA as described in steps 15–22.\nNote: For MINDS (-) control experiment, 1× HHBS should be injected instead.\nConditioned place preference test\nTiming: 5 days (2 days after completion of stereotaxic injection of MINDS)\nThis section describes the procedures for conditioned place preference test in mice with NIR-II photothermal neuromodulation in the VTA. The timeline of these procedures is adapted from a previous report (Kim et al., 2013[href=https://www.wicell.org#bib7]). Experiments have shown that MINDS largely stayed near the injection site, remaining functionally stable over 2 weeks after stereotaxic injection (Wu et al., 2022[href=https://www.wicell.org#bib11]). Therefore, a waiting period of 2 days prior to the conditioned place preference test is acceptable.\nPrepare the Y-maze for conditioned place preference test.\nCover the bottom of the Y-maze with mouse cage bedding. Make sure that the bedding thickness is similar to that in a regular housing cage.\nPrint black grating patterns on white paper with 5-mm grating width and 1-cm center-to-center interval between neighboring gratings (Figure 2[href=https://www.wicell.org#fig2]A). Print the grating patterns in both horizontal and vertical directions (Figure 2[href=https://www.wicell.org#fig2]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2290-Fig2.jpg\nFigure 2. Setup of a Y maze for the conditioned place preference test",
    "(A–C) Schematics showing the vertical strip (A), horizontal strip (B), and blank pattern (C) taped on the three arm terminal walls of the Y maze.\n(D) Schematic showing the Y maze with patterns in (A–C) in the three arm terminals.\nTape the horizontal and vertical grating patterns on the wall of two arm terminals.\nFor the third arm terminal, tape blank white paper on the wall (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: It is important to also tape blank white paper on the third arm terminal wall, so that all the terminal walls are covered with the same material. Under rare circumstances where the animals damage or scratch the paper, replace the paper immediately after the current session finishes. The paper can be cleaned by gently wiping it with dry Kimwipes for three times between animals.\nSet up a video camera over the Y maze with sufficient field of view covering the entire Y maze.\nSet air conditioning to a stable ambient temperature at 25°C.\nOn Day1, run a 30-min pretest.\nPlace the mouse in the central triangle of the Y maze.\nTurn on the video camera to record the trajectory and behavior of the mouse.\nRemove the three doors that separate the central triangle and the three arms simultaneously. Let the mouse freely explore the entire Y maze for 30 min.\nAfter the pretest is finished, remove the mouse from the Y maze and put it back to its home cage.\nCritical: Make sure that the environment of the room (including temperature, lighting, humidity, sound, and odor) is stable throughout the pretest. A significant cue of the environment (e.g., loud sound) affects the animal’s behavior. We recommend an ambient lighting intensity of ∼ 750 lux and a background noise level of ∼ 45 dB.",
    "Note: The Y maze can be cleaned with Virkon-S followed by 70% ethanol between animals.\nOn Day2 to Day4, run a 30-min contextual training session with NIR-II neuromodulation each day. The training session and pretest should be performed at roughly the same time of the day.\nConnect a fiber collimator to the 1,064-nm laser output fiber.\nAdjust the distance between the collimator and the targeted arm terminal of the Y maze to be ∼ 1 m, so that the laser spot is circular with a diameter of 1 cm. This 1-m distance also facilitates tracking of the animal with the laser beam.\nFix the fiber collimator on a locking ball and socket mount. Make sure that the angle of the collimator can be freely adjusted to cover a 5 cm × 5 cm area at the end of the targeted arm terminal.\nSet up the function generator to output a high voltage (5 V) pulse train with 20 Hz repetition rate and 30% duty cycle.\nConnect the output of the function generator to the trigger input of the laser control box via a BNC cable.\nTurn on the laser and monitor its output power using a power meter. Adjust the temporal average output power density of the laser spot to be 10 mW/mm2.\nSet up a thermal camera to monitor the temperature of the mouse in the targeted arm terminal of the Y maze.\nPlace the mouse inside the Y maze, turn on the video camera, and remove the three doors, as described in step 29.",
    "When the mouse enters the 5 cm × 5 cm area at the end of the targeted arm terminal, aim the laser beam to manually track the head of the mouse. Under rare circumstances where the head titling of the mouse prevents aiming the laser beam on the scalp, the laser should be temporally turned off until the head returns to its horizontal position. The 1,064-nm light is invisible to human eyes but can be visualized through an IR viewer.\nIn the meantime, monitor the temperature on the mouse head through the thermal camera. The laser output is turned down to 0 whenever the scalp temperature is above 39°C and turned back to 10 mW/mm2 whenever the scalp temperature is below 38°C. The temperature in VTA is estimated to be 39.5°C–39.8°C when the scalp temperature is 39°C (Wu et al., 2022[href=https://www.wicell.org#bib11]).\nEvery time when the mouse leaves the 5 cm × 5 cm area in the targeted arm terminal, turn off the laser.\nCritical: Make sure to always wear appropriate laser safety goggles when working with lasers.\nCritical: Avoid aiming the laser beam on the fur as this may cause damage to the mouse.\nNote: The laser should target the same arm terminal throughout the three training sessions.\nOn Day5, run a 30-min posttest. The procedures for the posttest are identical to those for the pretest, as described in step 29.",
    "Critical: As multiple components (e.g., NIR-II light, MINDS and TRPV1) are involved in this NIR-II neuromodulation technique, appropriate and comprehensive control experiments are needed to rule out artifacts and other confounding factors. We recommend that a control group of mice without TRPV1 transduction (i.e., TRPV1(-), MINDS (+)) and another control group of mice without MINDS injection (i.e., TRPV1(+), MINDS(-)) should go through the same conditioned place preference test, as detailed above. The comparison of the place preference behavior between the pretest and the posttest serves as an internal control for NIR-II light.\nNote: The posttest should be performed at roughly the same time of the day as the training sessions and the pretest.\nImmunohistochemical studies of the mouse brain\nTiming: 4 days (1 week after completion of conditioned place preference test)\nThis section describes the procedures for immunohistochemical studies to assess the TRPV1 transduction efficiency and thermal damage associated with the NIR-II neuromodulation. Mice with failed viral transduction (i.e., no TRPV1 expression in VTA) should be excluded from the analysis of data in the conditioned place preference test.\n1 week after the posttest of the conditioned place preference test, perform transcardial perfusion to the mouse.\nDeeply anesthetize the mouse with intraperitoneal injection of ketamine (120 mg/kg) and dexdomitor (1 mg/kg) cocktail.\nEuthanize the mouse through sequential transcardial perfusion of 12-mL 1× PBS and 24-mL 4% PFA (rate: 5 mL/min).\nNote: The perfusion rate is controlled by a syringe pump.\nDissect the brain from the skull and immerse it in 15-mL of 4% PFA at 4°C for 24 h.\nRemove the brain from 4% PFA.\nCut a 3–5 mm thick coronal tissue block including VTA using a brain slicer.\nImmerse the brain tissue block into 10-mL of 30% sucrose solution and keep it at 4°C overnight (12–20 h) (troubleshooting 5[href=https://www.wicell.org#sec6.9]).",
    "Fill a cryomold with O.C.T. compound and transfer the brain tissue block into it. Wait for 30 min.\nIn the meantime, prepare dry ice/methanol slurry in a 10 cm petri-dish.\nMake sure to put the petri-dish on top of a foam box cap to keep the temperature low.\nWait until the system equilibrates and add more dry ice if needed.\nNote: At equilibrium, adding new dry ice will cause no or little bubbling.\nCritical: Make sure to wear thermally-insulated gloves when working with dry ice.\nTransfer the brain into a new cryomold filled with O.C.T. compound.\nNote: It is important to make sure there are no air bubbles surrounding the brain tissue, otherwise the quality of cryopreservation may be compromised. In the case of any air bubbles, remove them with blunt tweezers. Be careful not to damage the tissue during this step.\nFreeze-embed the brain tissue.\nUse long forceps (12″) to grasp the mold with the tissue and gently place the mold into the dry ice/methanol slurry. Make sure that methanol does not directly contact the O.C.T. compound or tissue.\nThe O.C.T. compound should freeze and turn white, starting from the bottom up and from the sides to the center within 1–2 min.\nAfter the O.C.T. compound fully turns white, transfer the mold on dry ice.\nPause point: The embedded brain tissue block can be stored at −80°C for several months and the procedure can be paused here.\nObtain 20-μm brain sections using a cryostat.\nPut the O.C.T.-embedded brain tissue inside the chamber of the cryostat and wait until it equilibrates at −20°C.\nMount the tissue block onto a sample holder using a thin layer of O.C.T. compound.\nAdjust the angle of the tissue block and the anti-rolling plate so that a flat section can be obtained.",
    "Trim extra tissue until VTA is exposed. Cut 20-μm sections and transfer them to ice-cold 1× PBS solution using a small brush (troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nPause point: The brain sections can be stored at 4°C for 1 day.\nRinse the brain sections 3 times in 1× PBS for 10 min each on a shaker at 450 rpm and 4°C.\nPerform blocking to prevent non-specific binding.\nPrepare the blocking solution by adding 5% normal goat/donkey serum and 0.3% Triton X-100 in 1× PBS.\nPlace the brain sections in the blocking solution for 1 h at room temperature (20°C–25°C) on a shaker at 150 rpm.\nNote: Use serum from the same species in which the secondary antibody is made to make the blocking solution. For example, if the secondary antibody is made in goats, then goat serum should be used in the blocking solution. If secondary antibodies from two or more species are used, use a mixture of serum from each species.\nOptional: When performing mouse-on-mouse staining (e.g., mouse is the host species for the primary antibody), an additional blocking step may be adapted to block the endogenous mouse IgG to eliminate non-specific binding. Specifically, incubate the brain sections with AffiniPure Fab Fragment Goat Anti-Mouse IgG (H+L) at a dilution ratio of 1:65 in 1× PBS for 1 h at room temperature (20°C–25°C) on a shaker at 150 rpm. Then rinse the brain sections 3 times in 1× PBS for 10 min each on a shaker at 450 rpm and 4°C.\nDuring blocking, prepare the primary antibody solution. Dilute primary antibodies in the blocking solution (5% normal goat/donkey serum and 0.3% Triton X-100 in 1× PBS) with appropriate dilution ratios (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2290_3.csv",
    "After the blocking finishes, transfer the brain sections from the blocking solution to the primary antibody solution. Incubate the brain sections overnight (12–20 h) at 4°C on a shaker at 150 rpm.\nThe next morning, rinse the brain sections 3 times in 1× PBS with 0.05% Triton X-100 for 10 min each on a shaker at 450 rpm and 4°C.\nPrepare the fluorescent secondary antibody solution by diluting the antibodies with their appropriate dilution ratios in 1× PBS supplemented with 5% normal goat/donkey serum and 0.1% Triton X-100 (Table 1[href=https://www.wicell.org#tbl1]).\nNote: Fluorophores conjugated to secondary antibodies are light-sensitive. Therefore, starting from step 45, caution should be taken to minimize light exposure.\nCritical: Make sure that the fluorophores conjugated to secondary antibodies used for the same section are spectrally separated, otherwise they will not be distinguished in imaging.\nTransfer the brain sections from the rinsing solution in step 44 to the secondary antibody solution. Incubate the brain sections for 1.5 h at room temperature (20°C–25°C) on a shaker at 150 rpm.\nRinse the brain sections 3 times in 1× PBS for 10 min each on a shaker at 450 rpm and 4°C.\nMount the brain sections onto glass slides.\nAdd a few droplets of 1× PBS on a Superfrost Plus glass slide.\nGently pick up a brain section and transfer it to the PBS droplet on the glass slide.\nUse Kimwipes to dry the PBS, and the brain section will gradually adhere to the glass slide. Make sure there are no wrinkles or folds in the brain section.\nMount up to 2 brain sections per glass slide.\nAdd 4–5 μL of Prolong Gold Antifade Mountant to the brain section and mount a coverslip on top by slowly lowering the coverslip to touch the mounting solution.",
    "Note: Make sure to minimize the formation of bubbles near the tissue.\nUse clear nail polish to seal the edges of the coverslip to prevent the brain section from drying. Allow the nail polish to dry in dark and keep the slides horizontal at room temperature (20°C–25°C) for 24 h.\nStore the slides in a light-tight container wrapped with aluminum foil before imaging.\nPerform fluorescence imaging of the brain sections using a confocal microscope."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Biotechnology And Bioengineering",
    "Microscopy",
    "Behavior",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology",
    "Bioengineering & Technology"
  ]
}