{
  "id": 6802,
  "origin_website": "Bio",
  "title": "Spectrophotometric Assessment of Heme Oxygenase-1 Activity in <em>Leishmania</em>-infected Macrophages",
  "procedures": [
    "Preparation of microsomal fraction containing HO-1 enzymeInfect 80% confluent macrophage cells (RAW 264.7 or BMDM) in T25 flasks with Leishmania donovani promastigotes with a parasite to macrophage ratio (10:1) for the indicated time points (0, 0.25, 0.5, 1, 2 and 4 h).After incubation,discard the media and carefully wash the cells with 1 ml PBS solution and the steps were carried out by placing all the flasks on ice throughout.Add 1 ml potassium phosphate buffer to each of the flasks and gently scrape the cells using scrapers.Transfer the scraped cells in a 50 ml Falcon pre-chilled by placing on ice.Add 2 ml more potassium phosphate buffer.Incubate the cells for 15 min on ice.Briefly sonicate the cell suspensions at 80% amplitude for 15 s at 5 min interval for 3 times keeping on ice.Add sucrose solution to the cell lysate to obtain the final concentration 0.25 M sucrose.Centrifuge the solutions at 1,000 x g for 10 min at 4 °C.Note: The pellet will contain the nuclei. Centrifuge the supernatant at 12,000 x g for 15 min at 4 °C.Note: The pellet will contain the mitochondria. Ultracentrifuge the supernatant at 105,000 x g for 1 h at 4 °C.Discard the supernatant.Note:The pellet is the microsomal fraction containing HO-1 enzyme. Resuspend the pellet in 500 µl of 0.1 M potassium phosphate buffer.Store at -20 °C until use.Estimation of protein concentration (Bradford, 1976)Prepare 6 dilutions of bovine serum albumin (BSA) (10 mg/ml) as standard with a range of 0 to 50 µg protein in 995 µl diluted Bradford assay reagent (1:5) in duplicate and adding 5 µl from each of the test samples in 995 µl diluted Bradford assay reagent (1:5) in triplicate.Mix all the samples by gently inverting 2 to 3 times.",
    "Incubate all at room temperature for 5 min and read absorbance at 595 nm.Note: Do not keep the prepared solutions for more than 1 h at room temperature.Isolation of rat liver cytosolic fraction containing biliverdin reductaseEuthanize a Sprague Dawley rat.Perfuse the liver with 0.9% NaCl solution in situ via hepatic portal vein until fully blanched.Excise out the blanched liver and mince it completely with help of scissors.Homogenize the liver sample in 5 ml of 0.1 M sodium citrate buffer using tissuelyzer (Bio-Rad)Centrifuge the homogenate at 10,000 x g for 20 min at 4 °C.Carefully pipette out the supernatant and ultracentrifuge the sup at 105,000 x g for 1 h at 4 °C.The supernatant serves as the source of biliverdin reductase.A portion of the obtained supernatant was tested for biliverdin reductase activity by assessing the amount of bilirubin produced from biliverdin via measuring the absorbance at 464 nm (bilirubin) and 670 nm (biliverdin). Five µg of protein from the obtained supernatant was incubated with 10 µM biliverdin (Sigma) and 400 µg/ml bovine serum albumin (BSA) in 100 mM potassium phosphate buffer (pH 7.4) at 37°C for 5 min in a total volume of 200 µl. The reaction was initiated by addition of 1 mM NADPH. The protein concentration of the supernatant was around 10 mg/ml.Store at -80 °C until use.Note:Use the solution as early as possible as the enzymes lose their activity upon storage.Assessment of heme oxygenase-1 activityIncubate 600 µg of microsomal protein with a reaction mixture containing 1 mM NAD(P)H, 2 mM glucose-6-phosphate, 1 U glucose-6-phosphate dehydrogenase (Sigma-Aldrich), 25 µM hemin, 2 mg of rat liver cytosolic protein, and 100 mM potassium phosphate buffer (pH 7.4).Adjust the final volume to 400 µl with potassium phosphate buffer (pH 7.4).Place the tubes in the dark for 1 h at 37 °C.",
    "After 1h, terminate the reaction by placing the tubes on ice for 2 min.Determine HO-1 activity by measuring bilirubin concentration by spectrophotometer.Spectrophotometric detection of bilirubinDetermine bilirubin concentration by the difference in absorption between 464 and 530 nm (extinction coefficient, 40 mM-1 cm-1 for BL).Express HO-1 activity in picomoles of BL formed per milligram microsomal protein per hour (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200325/20200325010944_0501.jpgFigure 2. HO-1 activity was measured in Leishmania donovani infected RAW 264.7 macrophages for the indicated time periods (0-4 h)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}