{
  "id": 6397,
  "origin_website": "Bio",
  "title": "Assessing Spatial Working Memory Using the Spontaneous Alternation Y-maze Test in Aged Male Mice",
  "procedures": [
    "Note: Institutional animal ethics protocol approval is required for carrying the experiment described in this protocol. Habituate mice to handlingA minimum of one to two weeks prior to testing on the y-maze, experimenters should remove animals from cages and handle them (Crawley, 2007). Each week, the animals should be handled daily for 5 out of the 7 days. Each mouse should be handled for at least 5 min.On the day of y-maze, habituate testing animals to the testing room 30 min prior to beginning behavioral testing (Rutkowsky et al., 2018). Animals should not be able to see the y-maze prior to testing.Conduct behavioral testing at the same time each day. We tested animals in the afternoon during their light cycle. It is important to remain consistent in testing time parameters.If possible, the lights in the testing room can be dimmed to increase exploration of the y-maze during testing. There should be indirect and homogenous illumination (150-200 Lux) in the center of the y-maze.Place each mouse, naive to the maze, at the same end of one arm and allow each mouse to move freely through the maze during an 8-min session (Sarter et al., 1988; Maurice et al., 1994; Holcomb et al., 1998; Li et al., 2010; Lee et al., 2017; de Sousa et al., 2018). Video record the whole process. Record the number of arm entries by two individuals blinded to the experimental groups. If animals are being tested over multiple days, then the orientation of the y-maze should be the same each day. Notes:If there are loud noises (e.g., construction) during testing, a white noise machine can be used. Animals should be habituated to the white noise prior to testing. In our study, we did not use any white noise during testing.",
    "Modifications can be made to the above testing protocol, these modifications are summarized in Table 1–Changes to testing time and paradigm (Mihalick et al., 2003; Võikar et al., 2004; Tchantchou et al., 2005; Barakat et al., 2018) as well as the number of trials per animal (Mihalick et al., 2003). Other modifications include object recognition (Romberg et al., 2013; Ibi et al., 2018) and the two-trial y-maze, which assess short-term memory (Dellu et al., 2000). and the two-trial y-maze, which assess short-term memory (Dellu et al., 2000). In the first trial, one arm was blocked, allowing the mouse to explore only two arms of the maze for 5 min. In the second trial, after a 60 min inter-trial interval, the block to the third arm was removed and the mouse was able to explore all three arms for a period of 5 min. The amount of time spent in the novel arm was calculated within the first minute.  After each trial, the y-maze should be cleaned, disinfected, and dried prior to placing the next mouse. Alternatively, saw dust or bedding can be added to the y-maze and mixed between animals (Ma et al., 2007).Table 1. Summary of changes that can be made to spontaneous alternation y-maze testing protocol and apparatusimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190130/20190130014242_5214.jpg"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}