{
  "id": 6463,
  "origin_website": "Bio",
  "title": "Quantification of Cutaneous Ionocytes in Small Aquatic Organisms",
  "procedures": [
    "An overview of this protocol is shown below (Figure 1). The time necessary to finish this procedure varies with the size of each sample. At the minimum, this procedure will take at least 3 days.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024159_4992.jpg Figure 1. Procedural Overview. Schematic showing the major steps of this protocol.Sample fixationEuthanize specimen in accordance with an approved animal care protocol.Incubate samples in fixative solution (see Recipes 1 and 2) in any water-tight container (e.g., borosilicate glass vial) on a rotator/shake table overnight (8-12 h) at 4 °C.Notes: All samples should be fully immersed in the fixative. Multiple samples can be fixed together. In Kwan et al., 2019, 6-10 fish larvae (ranging from 3-25 mm in length) were fixed in 10 ml of fixative within a 20 ml borosilicate glass vial. Adjust container, volume, and fixative according to your specimen of interest. Rinsing the samples prior to fixation is not required. The ethanol washes (Steps A3 and A4) can be replaced with three 10 min PBS washes if the samples are to be immediately processed for immunohistochemistry. Remove fixative, then incubate samples in 50% ethanol on a shake table overnight (8-12 h) at 4 °C.Remove 50% ethanol, then incubate samples in 70% ethanol for long-term storage at 4 °C.Whole-mount immunohistochemistryBegin rehydrating samples by transferring onto a Petri dish with tap water for 1 min.After initial rinse, transfer samples into a plastic tube (e.g., 0.2 ml PCR tube or 1.7 ml microcentrifuge tube depending on larval size) with tap water (filled to max volume) and further incubate for 10 min at room temperature on a rotator/shake table.Notes: All samples should be fully immersed in solution. In Kwan et al., 2019, fish larva (< 20 mm in length) were incubated in a 1.7 ml microcentrifuge tube and immersed in ~1 ml of solution.",
    "Larger samples will require a larger container and more solution (and vice versa). Adjust container and solution volume accordingly. During solution changes, it is preferable to remove the solution from the container–as opposed to moving the sample to containers with different solutions. This minimizes damage to the sample. This applies to all solution changes. If changing solution with a plastic transfer pipette becomes problematic, consider using a more appropriately sized pipette (P200 pipette with a 200 μl tip for 0.2 ml PCR tube and P1000 pipette with a 1,000 μl tip) for changing solutions. Adjust according to your sample and/or container. Remove water, then incubate samples in freshly prepared 3% hydrogen peroxide (see Recipe 3) for 10 min at room temperature on a rotator/shake table. Notes: During solution changes, it is preferable to remove the solution from the container–as opposed to moving the sample to containers with different solutions. This minimizes damage to the sample. This applies to all solution changes. This step may be extended to 1 h if there is intense pigmentation and/or non-specific background staining. Remove 3% hydrogen peroxide solution, then incubate samples in normal horse serum (NHS) blocking solution for 15 min at room temperature on a rotator/shake table.Prepare primary antibody solution (e.g., α5 NKA antibody: 20 ng/ml in NHS blocking solution).Remove NHS, then incubate samples in primary antibody solution and leave on a rotator/shake table overnight (≥ 8 h) at room temperature or (preferably) at 4 °C.Note: This step may be modified for various antibody validation controls. See Procedure K for details. Remove primary antibody solution, then rinse samples in 1x PBS (see Recipe 4) for 5 min at room temperature on a rotator/shake table. Repeat two more times for a total of three rinses.",
    "Remove 1x PBS wash, then incubate samples in pan-specific secondary antibody solution for 30 min at room temperature on a rotator/shake table.Remove pan-specific secondary antibody solution, then rinse samples in 1x PBS for 5 min at room temperature on a rotator/shake table. Repeat two more times for a total of three rinses.Remove 1x PBS wash, then incubate samples in streptavidin peroxidase solution for 15 min at room temperature on a rotator/shake table.Remove streptavidin peroxidase solution, then rinse samples in 1x PBS for 5 min at room temperature on a rotator/shake table. Repeat two more times for a total of three rinses.Prepare the DAB substrate working solution (see Recipe 5) according to the manufacturer’s instruction in a separate container (e.g., 15 ml centrifuge tube).Remove 1x PBS wash, then incubate samples in DAB substrate working solution for 20 s at room temperature.Notes: The sensitivity of this portion is highly dependent on the tissue sample and antibody of interest. Because DAB staining is irreversible, start with 20 s and increase incubation time if darker staining is necessary. Optimal incubation time should be determined by the investigator(s). Incubating samples for a longer duration may result in darker background staining. If this becomes an issue, consider diluting the DAB substrate working solution with DI water. Remove DAB substrate working solution, then rinse samples in DI water for 10 min at room temperature on a rotator/shake table. Repeat two more times for a total of three rinses.Store in DI water at 4 °C until imaging.For long-term storage (1 week or longer), store in PBS + 0.02% sodium azide (see Recipes 6 and 7).Note: Sodium azide is very toxic. Samples incubated within sodium azide should be given multiple DI water washes before handling and imaging.",
    "Light microscopy and imagingCarefully transfer sample onto a microscope slide, concave microscope slide, or a glass bottom dish for examination under a light microscope.Add DI water to keep sample from drying out, and secure sample with a coverslip to prevent unintentional movement.Switch on the live feed option on the DSLR camera.Switch off the autofocus option on the DSLR camera.Set camera to manual or aperture priority mode. Adjust the following parameters until image is optimal: camera ISO, camera aperture, microscope aperture, light source brightness.For optimal imaging, use a wireless remote controller to trigger shutter release.Note: Avoid bumping into the entire camera apparatus. Because the exposure time of each photograph will likely require ~1 s per image, any movement of the microscope, sample, camera, and surrounding can cause blurriness. Starting at one end (e.g., head of fish specimen), photograph sample at each focal plane (Z-stack) within the field of view. Manually adjust the focus until the entire Z-stack is finished (Figures 2A-2E). Be careful to not move the image in the X or Y-dimension.Notes: The image may differ between the microscope lens and camera (shown on the live feed monitor). Always use the camera’s focal plane and image accordingly. Shooting the Z-stack in consecutive order (front to back or vice versa) is preferable as it may help during post-processing. Ensure that your sample does not drift in the x or y plane between images for proper post-processing. An exact Z-step (distance between each image) ranges greatly amongst samples. After each image, turn the fine focus until the next plane is in focus. In Kwan et al., 2019, most images took around 6-8 images per Z-stack. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024254_9654.jpgFigure 2. Example of Z-stacks and focus stacking.",
    "After photographing a Z-stack on the ventral body (A-E), the focused portions of each image were stacked together via focus stacking (F).Move to the next unphotographed area, taking care to overlap consecutive Z-stacks by at least ~20% to ensure photo stitching accuracy (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024321_7145.jpgFigure 3. Overlap of Z-stacks are necessary for proper photo-stitching. Each Z-stack (A, B) should have ~20% of overlapping area for optimal photo-stitching (C).Continue imaging Z-stacks until the entire sample has been photographed.Photograph the microscope standard at a height equal to approximately half of the sample’s thickness.Note: The same scale bar can be applied across multiple samples as long as the magnification of the microscope has not changed and the sample thickness is relatively similar. Focus-stacking and photo-stitchingNotes: A video tutorial explaining the focus-stacking process can be found at youtube–Quick Start with Helicon Focus[href=https://youtu.be/p8JQlIYyVwM] (published by HeliconSoft). A video tutorial explaining the photo-stitching process can be found at youtube–How to Stitch Multiple Photos Together Automatically with Photomerge in Photoshop[href=https://youtu.be/dAk_aw0IYjU] (published by Photoshop Video Academy). Import each stack of images into Helicon Soft and render focus-stacking.Notes: Begin with Method C (pyramid).  If the edge of the image becomes distorted (halo effect), troubleshoot with Method A (weighted average) or Method B (depth map)–and increase the “radius” value. Read more about the different methods here: https://www.heliconsoft.com/helicon-focus-main-parameters/[href=https://www.heliconsoft.com/helicon-focus-main-parameters/]. Other focus-stacking software (e.g., Adobe Photoshop) may be used, though the processing speed and quality of results may vary. Repeat for each stack of images. Save images.Open all focus-stacked images in Adobe Photoshop and check for processing artifacts (Figure 4). If artifacts exist, use the “Crop” tool (hotkey: C) to discard the artifact. Save all changes before proceeding.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024508_5692.jpgFigure 4. Example of artifacts created during focal stacking.",
    "Artifacts such as blurred areas along the edge of the Z-stack may appear (black arrow) and should be cropped out of the image.With all focus-stacked images opened in Adobe Photoshop and vetted for artifacts, use the photo-stitching tool (File > Automate > Photomerge …).Select “Add Open Files” (all files must be already saved), select “Auto”, then “OK”.Note: If there are many stacks to stitch together, this step may take a while. If computer crashes, try using a computer with more RAM and stronger processor. Check for artifacts or unphotographed areas. Save image.Open the image containing microscope standard taken back in Step C10. Using the “Rectangle Marquee” tool (hotkey: M) to measure a known width (e.g., 1 mm). Use the “Brush” tool (hotkey: B) to fill in the rectangle with a color that contrasts well with the background.With the colored rectangle still in selection, copy (Windows hotkey: Ctrl + C; Mac hotkey: Cmd + C) the scale bar and paste (Windows hotkey: Ctrl + V; Mac hotkey: Cmd + V) onto the photo-stitched image of the sample. Save image.Calibrating measurement tools for image analysis/ionocyte quantificationNote: A video tutorial explaining this process can be found at Youtube–Set calibration in ImageJ (published by remotelab PloyU). Open the photo-stitched image in FIJI/ImageJ.Using the “magnifying glass” tool or by pushing the “+” key, zoom in on the scale bar.Note: Hover the mouse cursor over the area you want to zoom in before pushing “+”. You can also push “-” to zoom out. Using the “straight line” tool, draw a line across the scale bar–holding shift to lock the line at a 90° angle. At the top of the window (screen for Mac), click on Analyze > Set Scale. The distance in pixels should already be filled in as that is the line you just drew.",
    "Fill in the “Known Distance” and “Unit of Length” (e.g., 1 mm), then click “OK”.Note: If the same scale bar is being used across multiple samples, then select the box next to “Global”. In doing so, the pixel to mm ratio will be remembered across windows (samples). To ensure accuracy, open up the microscope standard image previously taken during “Step C10”. Using the “straight line” tool, draw a line across the imaged scale bar and measure (hotkey: M). If done properly, the difference between the imaged scale bar and the “measured” distance should be negligible.Note: From this point forward, this protocol will regard the sample as a fish specimen. Other samples could be similarly quantified, though some modifications to this protocol may be necessary. Surface area estimationUsing FIJI/ImageJ’s “straight line” tool, measure (hotkey: M) the standard length of the fish larva. Record this value.Note: The “segmented line” tool (right click (Mac: command + click) on the “straight line” tool) can be used if the fish larva was fixed or placed in a curved position. With the “Freehand Selection” tool, trace the fish larva to measure (hotkey: M) its surface area. Record this value.Note: If freehand drawing using a mouse proves difficult, try using a tablet and stylus. Using the “Freehand Selection” tool, trace regions of interest where ionocyte distribution may differ (in this example we use head, body, and fins) and measure (hotkey: M). Record these values.Counting cutaneous ionocytesNotes: This technique is suitable for smaller fish specimens (< 5 mm standard length) and samples with a non-homogenous distribution of ionocytes. A video tutorial explaining this process can be found at Youtube–Count Items in ImageJ (published by Timothy Spier). Open FIJI/ImageJ.If using ImageJ, be sure the “Cell Counter” plugin has been installed (see Software).Open the photo-stitched image in FIJI/ImageJ.",
    "Go to Plugin > Analyze > Cell Counter > Cell Counter.In the Cell Counter window, click “Initialize”, select “Type 1”, and zoom (“+”) in on the area of interest. Using your mouse, left click to denote a cell at that location. The count will be updated next to “Type 1” in the Cell Counter window. Record this value.To remove an erroneous count, check the box next to “Delete Mode”. Next, click on the point you would like to remove. Uncheck the box to proceed with counting.Use the “Save Markers” option in the Cell Counter window to save your work.Estimating number of cutaneous ionocytesNote: This technique is suitable for larger fish specimens with a homogenous ionocyte distribution. Because there is likely species-specific variation in ionocyte distribution, this estimation technique needs to be ground truthed with manual cell counts (Procedure G) before utilizing. Open the photo-stitched image with scale bar in Adobe Illustrator.Notes: To zoom in, use the zoom tool (hotkey: Z) and click. To zoom out, use the zoom tool (hotkey: Z), hold ctrl (Mac: hold Cmd) and click. Adjust the artboard (hotkey: Shift + O) to fit the photo-stitched image. If the photo-stitched image is larger than the maximum artboard size, scale down the image size by 1) clicking on the image, 2) hovering over a corner anchor point, 3) holding “shift”, and 4) dragging to reduce image size.Change the name of this layer to “image”, and lock it. Create four additional layers and arrange them in this order: fin count, body count, head count, grid, image (from top to bottom) (Figure 5).Notes: You may have other areas of interest requiring additional layers A layer is only editable when it is 1) visible, 2) unlocked, and 3) selected. Layer(s) at the top will cover the layer(s) at the bottom. imgsrc:https://en-cdn.",
    "bio-protocol.org/attached/image/20190429/20190429024537_9395.jpgFigure 5. Key buttons within the layers window. The eye symbol (A) controls the visibility of that layer, whereas the lock symbol (B) controls whether that layer is editable. To change the name of the layer, double click on the name (C). To select everything in that layer, click on the circle in the layer of interest (D). To add another layer, click “create new layer” (E).Toggle the “Ruler” option (Window: Ctrl + R; Mac: Cmd + R). Right click on the ruler and change to “pixels”.Using the rectangle tool (hotkey: M), drag a rectangle across the scale bar (Figure 6A).On the second row from the top towards the right side of the window, find and click the orange “Transform”. Record the value listed next to “W” (Figure 6B). This value will assist you in converting between pixels and the measured metric unit.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024604_7923.jpgFigure 6. Finding the conversion between digital pixels and measured metric units. Draw a rectangle across the scale bar (A). The width of the rectangle should then appear in the “Transform” window (B). Use this value to convert between the computer pixels and the metric system.Using the standard length that was calculated back in Step F1, calculate the value equal to 2% of the fish specimen’s standard length.Using the rectangle tool, click (not drag) to create a shape with custom width and height dimensions. Input the 2% standard length value into both the “Width” and “Height” dimension (make a square).Note: For example, if the standard length of specimen = 8.80 mm, then 2% of the standard length is 0.176 mm. Copy and paste the squares until a grid overlays the entire fish (Figure 7).",
    "Note: To expedite this process, below are some helpful shortcuts: Select All: “Windows: Ctrl + A, Mac: Cmd + A” Copy: “Windows: Ctrl + C; Mac: Cmd + C” Paste in place: “Windows: Ctrl + Shift + V; Mac: Cmd + Shift + V” While dragging newly pasted cells, hold “Shift” to lock the squares in the X or Y plane. By default, illustrator should “auto-snap” your selection to place. If this is turned off, go to Preferences > Selection and Anchor Display and check the box “Snap to Point”. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024630_3871.jpgFigure 7. Example of an overlying grid over a photo-stitched yellowfin tuna specimen. Each square’s length is equal to 2% of the larva’s standard length.Number the grid’s x and y axes.Calculate the area of an individual square. Record this value.Note: For example, if the standard length of specimen = 8.80 mm, then the area of each square is 0.031 mm2. Using the measurements from Steps F2 and F3, calculate how many squares will require counting to cover 10% of each region of interest (e.g., head, body, fins). Record the number of squares necessary to cover at least 10% of each region.Notes: If the area of the head region = 4.9 mm2 and each square is 0.031 mm2, then: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024734_7477.jpg. Round up and count 16 squares to adequately cover at least 10% of the head region. Separation of different body regions is necessary as variation in regional ionocyte density may occur due to species-specific or developmental stage-specific differences. Open R. Copy and paste in the provided codes (see Note #1 below). Adjust the number for the X and Y coordinates accordingly before using.",
    "Note: Step-by-step instruction for using this R below:### Note #1### Beginning of code# Generating random coordinates# Step-by-step instruction## Objective: this will randomly generate 500 (x,y) coordinates # Step 1) In line 15, replace \"59\" with the number of squares on the x-axis# Step 2) In line 16, replace \"17\" with the number of squares on the y-axis# Step 3) highlight everything (Windows: ctrl + A; Mac: cmd + A)# Step 4) hold \"Shift\" and hit \"enter\"# Step 5) see output in the R Console window.# Note 1: Some coordinates may be repeated; skip if repeated.# Note 2: If 500 (x,y) coordinates is not enough, repeat until the quota for each region is reached.x.coord = sample(1:59, replace=T, 500) y.coord = sample(1:17, replace=T, 500) rand.coords <- data.frame(x.coord,y.coord)rand.coords### End of codeFor each randomly generated coordinate, disqualify for counting if the square contains any of the following:Background space, glare, or other photography artifacts (Figure 8A).Folding, invaginations, pigments, which prevent accurate counts (Figure 8B).More than one region of interest: head, body, fins (Figure 8C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024922_7080.jpgFigure 8. Example of squares unsuitable for cell counting. Randomly generated coordinates must not contain the following features: background space (A), foldings, invaginations, pigments, or other dark space (B), and space inclusive of more than one region e.g., box containing both body and fin (C).If the square meets the above criteria, then mark for counting.Notes: To quickly designate the square for counting, use the “Pencil tool” (hotkey: N) to scribble a marking. To avoid accidently moving the grid or the underlying image, be sure to lock both the grid and image layer (see Figure 5B). Count the cells within Adobe illustrator. For each region, record the number of ionocytes present in the randomly-chosen grid squares.",
    "Note: To quickly record the number of cells in the square, use the “Type tool” (hotkey: T) and click within the square, then type the number of counted cells. Hit “Esc” to exit this mode. If the grid lines happen to overlap the immunostained cells, count only the cells intersecting with the top and right sides of the square. This will ensure no double-counting of the cells if two squares were randomly chosen next to each other.Note: If the grid lines are too thick or the cells are located directly underneath the lines, try selecting the grid layer (hit the rightmost circle in the grid layer; Figure 5D) and reducing the “stroke” value to “0.5”, or reducing the opacity to 50% for better viewing. Continue until at least 10% of each region (head, body, fins) have been counted (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429024951_4714.jpgFigure 9. Method for quantification of cutaneous ionocytes in yellowfin tuna specimen and early stage juveniles (> 5 mm standard length). Ionocytes were identified by their intense Na+/K+-ATPase immunostaining and counted within randomly sampled boxes of the overlaid grid within the head (green), body (pink), and fin (blue) regions. Dashed white lines outline regions that were not sampled due to heavy pigmentation preventing accurate ionocyte counts. The estimated ionocyte count (15,342 cells) was ground truthed with manual ionocyte count (colorless regions; 14,795 cells). The estimated relative ionocyte area for this larva is 3.75%. Figure from Kwan et al., 2019.Calculate the estimation using the following equation:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429025041_1286.jpg Notes: Areahead, body, or fins = measured area of head, body, or fins region (Step F3). Ionocytehead, body, or fins = sum of ionocytes counted per region (Step H17). Squarehead, body, or fins = number of squares counted per region (Step H13). Areasquare = size of each square = (standard length*0.02)2 (Step H12).",
    "Quantifying ionocyte sizeOpen up ImageJ and set scale bar as discussed in Procedure E.With the “Freehand Selection” tool, zoom in (hotkey: +) and trace individual cutaneous ionocytes to estimate their relative surface areas.Note: If freehand drawing proves difficult, try using a tablet and stylus. Repeat Step I2 until you have measured 20 cells from different regions of interest (e.g., head, body, and fins).Calculate the average ionocyte size using the following equation:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429025126_3265.jpgAreahead, body, or fins were calculated in Step F3.Areatotal was calculated in Step F2.Quantifying relative ionocyte areaimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429025206_6282.jpgEstimated total ionocytes were calculated in Step H20.Average ionocyte size were calculated in Step I4.Total surface area were calculated in Step F2.Method controls and antibody validationNon-specific secondary and tertiary antibody binding control: designate several fish specimens as negative controls by omitting the primary antibody during Step B6 (leave in NHS blocking solution overnight at 4 °C). Fish specimens incubated with the primary NKA antibody should result in positive staining (Figure 10A). In contrast, fish specimens without the primary antibody should result in the absence of staining (Figure 10B).Notes: Performing this negative control step is a great way to identify and avoid the natural pigments present on the organism of interest (Step H15). If necessary, the negative-control fish specimens can be re-incubated and utilized. Simply repeat all of Procedure B to re-immunostain said sample(s). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429025245_7459.jpgFigure 10. Negative control for immunohistochemistry. The difference between a yellowfin tuna specimen incubated with (A) and without (B) Na+/K+-ATPase (NKA) antibodies. The brown precipitate seen in the top larva denotes NKA presence on the cutaneous surface, whereas the absence of brown staining on the bottom larva serves a successful negative control. Note the areas containing naturally occurring pigment in both specimens should be avoided during estimation.",
    "Primary antibody specificity via western blotting: flash frozen tissue (-80 °C) should be sampled along with the fixed tissue for western blotting, which should yield a single band close the predicted size of your protein of interest (Figure 11). See supplementary material 2 in Kwan et al. (2019) for protocol and additional details.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190429/20190429025312_7019.jpgFigure 11. Western blot of Na+/K+-ATPase (NKA) in yellowfin tuna tissue. Western blot with anti-NKA monoclonal antibodies on yellowfin tuna tissue yielded a single ~108 kDa band, which matched the predicted size of the protein. Figure adapted from Kwan et al., 2019."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}