{
  "id": 19113,
  "origin_website": "Jove",
  "title": "DNA Vector-based RNA Interference to Study Gene Function in Cancer",
  "procedures": [
    "1. Generation of shRNA Constructs\nIdentify a siRNA-target sequence (20-23 nucleotides) based on previously published criteria6 or use a web-based algorithm server, such as \"siRNA Target Finder\" from Ambion and GenScript.\nSynthesize oligonucleotides based on the design of Figure 1 and example sequences in Table 1. Carry out PCR amplification using the oligonucleotides P1 and P2 (30 cycles of denaturing at 94 °C for 30 sec, annealing at 60 °C for 30 sec, and elongating at 72 °C for 30 sec) and a plasmid carrying the U6 or H1 promoter as a template. Purify the PCR product using a PCR purification column. Digest it by BamHI and HindIII and purify the digested DNA using a PCR purification column. Anneal the oligonucleotides P3 and P4 (2.5 pmol/μl of each in 100 μl of 50 mM Tris•HCl, pH 8.0) by boiling for 5 min and slowly cool down to ambient temperature. Digest a lentiviral vector, such as the one described in Figure 2A, by BamHI and EcoRI, and perform gel-purification.\nCarry out a 3-fragment ligation with the BamHI/EcoRI-digested vector, a BamHI/HindIII-digested PCR fragment and one pair of annealed oligonucleotides (forming HindIII and EcoRI sites at the two ends) at a 1:10:10 molar ratio (Figure 1).\nTransform highly efficient competent E. coli DH5α cells using the ligated product. Screen the colonies using the oligonucleotides P5 (in the vector) and P6 (in the H1 or U6 promoter).7\nPrepare plasmid DNA from the positive colonies with a commercial kit and confirm the presence of the insert by BamHI/EcoRI digestion and DNA agarose electrophoresis. Sequence the region containing the promoter and shRNA using oligonucleotide P5.",
    "Use plasmid DNA Midi- or Maxi-preparation kits (endotoxin-free is preferred) to prepare the lentivirus DNA carrying the shRNA expression cassette. Determine the DNA concentration by measuring the absorption at 260 nm. Check the DNA purity using the 260 nm/280 nm ratio and make sure it falls in the range of 1.8 to 2.0. Check the lentivirus plasmid integrity using agarose gel electrophoresis. DNA for transfection should be super-coiled.\n2. Lentivirus Transfection\nPrecautions: Lentiviral vectors are derived from the human immunodeficiency virus-1 (HIV-1) genome and replication incompetent. They have been widely used in gene delivery due to the capability of infecting both dividing and non-dividing cells. However, two major risks exist in the studies using lentivirus. (1) The potential for generation of replication-competent lentivirus. This risk can be greatly reduced if the third generation lentiviral system is used. (2) The potential for oncogenesis. This risk can be exacerbated if the carried inserts are oncogenic or repress tumor suppressors. Research activities involved in HIV-based lentivirus should follow the \"Biosafety Considerations for Research with Lentiviral Vectors\" of the NIH (http://oba.od.nih.gov/rdna_rac/rac_guidance_lentivirus.html[href=http://oba.od.nih.gov/rdna_rac/rac_guidance_lentivirus.html]) and require an approval from the Biosafety Committee of a researcher's institution. Generally, enhanced Biosafety level-2 (BSL-2) containment is required for the laboratory setting if lentiviral vectors are used.\nPlate 4 × 106 HEK 293T cells with complete DMEM medium (DMEM supplied with 10% fetal bovine serum (FBS), 2 mM L-glutamine, 100 units/ml penicillin, 100 μg/ml streptomycin) in 10 cm dishes and culture overnight at 37 °C in a 5% CO2 incubator. Replace the medium with 5 ml of pre-warmed Opti-MEM I Reduced Serum Media (Invitrogen).",
    "Prepare Solution A: 10 μg of shRNA-containing lentiviral vector, 5 μg each of the third generation lentivirus packaging plasmids (prepared with high purity; the three packaging plasmids include VSV-G: for an envelope protein, pRSV-Rev: for rev, and pMDLg/pRRE: for gag/pol, which are essential for lentivirus packaging), 36 μl of 2M CaCl2, and 300 μl of sterile water.\nPrepare Solution B: 300 μl of 2× Hepes Buffered Saline (281 mM NaCl, 100 mM HEPES, 1.5 mM Na2HPO4, pH adjusted to 7.12 by 0.5 N NaOH and sterilized by 0.22 μm filter).\nSlowly drop Solution A into Solution B while bubbling air through Solution B with a pipette. Leave the tube at ambient temperature for 30 min.\nSlowly drop the mixed solutions A/B into the HEK 293T cell culture dish prepared in step 2.1 and incubate at 37 °C in a 5% CO2 incubator for 4-6 h.\nReplace the medium with 7 ml of complete DMEM medium. After 24 h, add an additional 5 ml of the complete DMEM medium. Harvest the medium containing the lentivirus after another 24 h of culture.\nSpin the medium at 1,500 rpm, ambient temperature for 10 min. Filter the supernatant using a 0.45 μm filter and spin the flow-through medium containing the lentivirus by ultracentrifugation at 25,000 rpm (equal to 125,000 ×g with a SW28 swinging bucket rotor, Beckman Ultracentrifuge XL-90), 4 °C for 90 min. Decant the supernatant to a container with 5% bleach (final concentration).\nResuspend the lentivirus pellet in 0.5-1.0 ml of cold PBS and make lentivirus aliquots into 50-100 μl per tube. Store them at -80 °C.",
    "The titer of the lentivirus can be determined by commercial kits (such as QuickTiter Lentivirus Quantitation Kit from Cell Biolabs, Inc.), by a real-time PCR protocol8, or by determining the co-expressed fluorescent marker using fluorescence microscopy or flow cytometry. Typically, one 10-cm culture dish can produce about 0.5-1.0×108 infectious units (IU).\n3. Infection and Characterization of Infected Cells\nSeed the cells to be infected in 2 ml of complete medium in a 6-well plate with 30-40% confluency (about 5-8 × 105 cells, depending on cell sizes). Culture the cells overnight at 37 °C in a 5% CO2 incubator.\nReplace the medium with 1 ml of fresh medium containing 8 μg/ml of polybrene (Sigma, Cat# H9268) or 5 μg/ml of protamine (Sigma, Cat# P4020).\nDetermine a suitable multiplicity of infection (MOI) range9 for a particular cell line using lentivirus with fluorescent marker. Calculate or empirically determine the amount of lentivirus to be used to infect the cell line. Slowly drop the lentivirus into the plate and gently shake it for 10 sec.\nIncubate the plate at 37 °C in a 5% CO2 incubator for 6 h and then replace the medium with normal complete medium.\nAt least two days after infection, check the cells using fluorescence microscopy for lentivirus expressing fluorescent markers and/or add the corresponding antibiotic to the medium for lentiviral vectors expressing antibiotic resistance genes. For an inducible vector, such as a Tet-On system (Figure 2), culture the cells in medium prepared with tetracycline-free FBS. Split the cells 2-3 days post infection. Take a portion of the cells to test inducible gene knockdown by culturing them in medium supplied with and without 1.5 μg/ml doxycycline (Dox) for ≥2 days.",
    "Check the gene knockdown by Western blot, Real-Time PCR or immunostaining ≥2 days after infection, 2 days after antibiotic selection, or (for a Tet-On inducible system) ≥ 2 days after Dox addition.\nUtilize different approaches (such as cell proliferation assays, soft agar culture studies, migration assays, invasion assays and tumor formation studies) to determine the effects of the target gene knockdown on the malignancy of the cells.\n4. Xenograft Mouse Model Study\nClean all surfaces for mouse anesthetization and injection by 70% ethanol to prevent infection of mice. Anesthetize athymic nude mice (NCI-Frederick) using 2% isoflurane mixed with oxygen in an anesthesia induction chamber 10 min prior to cell inoculation. Maintain the anesthesia using 1% isoflurane mixed with oxygen through a nose cone. Carry out this step in a room with excellent ventilation and attach isoflurane scavenger filters to the induction chamber.\nPropagate the cells carrying shRNAs. Use tetracycline-free medium for Tet-On inducible vectors. Trypsinize the cells and resuspend them in complete medium containing 50% Matrigel. Position the nude mice on a heating pad (30 °C) and inject 200 μl of the cells (1-10 × 106, depending on the malignancy of the cells) into the mice with 1-2 injection sites per mouse. Use syringes with 25.5-gauge needles for subcutaneous injections, and 28-30 gauge needles for orthotopic injections.\nFor constitutive shRNA vectors, utilize 2 groups of mice injected with the cells expressing the target gene shRNA and a scrambled shRNA. For Tet-On inducible shRNA vectors, utilize 4 groups of mice injected with cells carrying the target gene shRNA and a scrambled shRNA, supplied with normal water and Dox (1.5 mg/ml) containing water (2 shRNAs × 2 treatments = 4 groups). Replace the Dox-containing water twice a week.",
    "Monitor the length and width of the tumors weekly or biweekly by a digital vernier caliper and calculate tumor volumes (V) by the formula V = 1/2(length × width2)10. Ensure that tumor volume does not exceed the guidelines of the institutional ACUC (such as, 10% of the body weight). Euthanize any mouse using a protocol approved by the institutional ACUC if it shows any sign of extensive ulceration or necrosis, obvious infection, uncontrolled bleeding or end-stage illness.\nTumor growth and metastasis can be monitored for the inoculated tumor cells expressing a bioluminescent marker11, such as Firefly luciferase. Clean all surfaces for mouse anesthetization and imaging by 70% ethanol to prevent infection of mice. Anesthetize the mice as described in step 4.1. Inject luciferin (150 mg/kg) intraperitoneally. Place the mice into a disinfected imaging chamber of a commercial imaging system, such as an IVIS Imaging System (Caliper Life Sciences, Inc.). Turn on the anesthesia lever to maintain anesthesia by 1% isoflurane mixed with oxygen. Conduct this step in a room with excellent ventilation.\nTake the first image by exposing 5 min and check its signal intensity. Adjust the exposure time to obtain images with optimal signal versus background. Determine the imaging time empirically, which is generally 1-5 min for subcutaneous tumors.\nEuthanize the mice by a protocol approved by the institutional ACUC when tumor sizes reach about 1,000 mm3, or as specified by the ACUC guidelines. Excise the xenograft tumors, weigh them and take pictures. Process the tumor samples for different studies, such as pathological analyses to determine tumor cell morphology, and Western blot and Real-Time PCR studies to test gene expression.\n5. Representative Results",
    "This protocol was used to study the effects of YY1 knockdown on xenograft tumor formation of Firefly luciferase- expressing MDA-MB-231 cells (human breast adenocarcinoma cells; Caliper Life Sciences) in athymic nude mice. The shRNA target sequence of human YY1 is \"GGG AGC AGA AGC AGG TGC AGA T\". A scrambled sequence \"GGG ACT ACT CTA TTA CGT CAT T\" was also created for a control (cont) shRNA, which did not have significant similarity to any known transcript. The oligonucleotides used to make Tet-On inducible shRNA constructs, with YY1 as an example, are shown in Table 1. As a result, two lentiviral vectors, pLu-Puro-Indu-YY1 shRNA and pLu-Puro-Indu-cont shRNA, were constructed and they were used to produce lentiviruses. We used these lentiviruses to individually infect two MDA-MB-231 cell clones (clones 1 and 3) expressing both tetracycline regulator (tetR) and Firefly luciferase. Polyclonal cell populations were obtained after puromycin selection. Figure 3A shows Dox-induced YY1 knockdown in these MDA-MB-231 cells infected by pLu-Puro-Indu-YY1 shRNA lentivirus. We then used the polyclonal cells of clone 3 infected individually by these inducible YY1 shRNA and cont shRNA lentiviruses and observed that YY1 depletion reduced invasiveness of MDA-MB-231 cells (Figure 3B). Western blot analyses confirmed Dox-induced YY1 silencing in MDA-MB-231 cells with the indu-YY1 shRNA, while the cells containing indu-cont shRNA did not show this effect (Figure 3C). We then used these cells for the xenograft mouse model study. Compared to the control groups, the mice implanted by the MDA-MB-231 cells with indu-YY1 shRNA and supplied with Dox-containing water showed reduced tumor formation, when visualized by bioluminescence (Figure 4A) and determined by tumor weights (Figure 4B). YY1 silencing in these xenograft tumors was confirmed by Western blot studies shown in Figure 4C.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4129/4129fig1.jpg",
    "Figure 1. Schematic diagram for the generation of a shRNA construct and shRNA transcription. The primers P1 to P6 are shown (see Table 1 for example sequences). Pol III: RNA polymerase III. (d): digested end. Drawing is not to scale.  Click here to view larger image[href=http://www.jove.com/files/ftp_upload/4129/4129fig1large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4129/4129fig2.jpg\nFigure 2. Schematic diagrams of (A) a lentiviral vector and (B) the mechanism of the Tet-On inducible H1 promoter used for gene silencing. The lentiviral vector was reconstructed based on pLL3.714 . H1-Pr: H1 promoter; Ubc-Pr: Human ubiquitin C promoter; Puro: puromycin; TRE: Tetracycline responsive element; Dox: doxycycline. TetR: tetracycline regulator. 5'LTR, 3'SIN-LTR and WRE are essential components of a lentiviral vector14 .\nimgsrc://cloudfront.jove.com/files/ftp_upload/4129/4129fig3.jpg\nFigure 3. Dox-induced YY1 silencing and its effect on invasiveness of MDA-MB-231 cells. A. YY1 levels in two polyclonal cell populations derived from TetR-expressing clones 1 and 3 infected by pLu-Puro-Indu-YY1 shRNA lentivirus and cultured in the absence and presence of Dox. B. Boyden chamber assay of MDA-MB-231 cells with inducible shRNAs. (* P < 0.05 versus other three groups). C. Representative Western blots of YY1 expression in these four cell populations.\n \nimgsrc://cloudfront.jove.com/files/ftp_upload/4129/4129fig4.jpg\nFigure 4. Effects of induced YY1 silencing on xenograft tumor formation by MDA-MB-231 cells. A. Schematic diagram of cell implantation (left) and representative bioluminescent images captured by the IVIS Imaging System at 4 weeks (right) post cell inoculation. B. Xenograft tumor weights at 4 weeks. * P ≤ 0.05. C. Western blots of YY1 and β-actin expression in xenografts of MDA-MB-231 cells with indu-YY1 shRNA in the absence and presence of Dox. Labels on the top are the names of individual mice.\ntable:\n﻿0,1,2\nOligonucleotide,Sequence (5' - 3'),Usage and location\nP1 (Tet-On H1),cagt GGATCC CGA ACG CTG ACG TCA TCA ACC C,PCR; at 5'-end of the H1 promoter",
    "P1 (U6),cagt GGATCC GAC GCC GCC ATC TCT AGG,PCR; at 5'-end of the U6 promoter\nP2 (for YY1 with Tet-On H1),cagc AAGCTT GAA atc tgc acc tgc ttc tgc tcc c GGG ATC TCT ATC ACT GAT AGG GAA C,PCR; at 3'-end of the Tet-On inducible H1 promoter\nP2 (for YY1 with U6),cagc AAGCTT GAA atc tgc acc tgc ttc tgc tcc c aaa caa ggc ttt tct cca agg gat a,PCR; at 3'-end of the U6 promoter\nP3 (for YY1),agc tt atc tgc acc tgc ttc tgc tcc c ttttt g,To be annealed with P4\nP4 (for YY1),aattc aaaaa ggg agc aga agc agg tgc aga t a,To be annealed with P3\nP5 (for pLL3.7),ggg tac agt gca ggg gaa aga ata g,\"For PCR screening, used with P6\"\nP6 (for Tet-On H1),GAT TTC CCA GAA CAC ATA GCG AC,\"For PCR screening, used with P5\"\nP6 (for U6),AGG GTG AGT TTC CTT TTG TGC TG,\"For PCR screening, used with P5\"\nTable 1. Synthesized oligonucleotides used in generating shRNA constructs.  P1 and P6 sequences for the mouse U6 and Tet-On inducible human H1 promoters are provided. Human YY1 is used as an example with a shRNA target sequence of GGG AGC AGA AGC AGG TGC AGA T. The sequences specific to YY1 are highlighted. Two P2 sequences of YY1 are designed for the two promoters, respectively. The constitutive U6/YY1 shRNA was described previously15, while the Tet-On H1/YY1 was used in this protocol. P5 is vector-specific and the sequence for pLL3.714 is shown. The sequences of restriction enzymes are underlined, while the sequences to anneal to the promoters during PCR amplification are italicized.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}