{
  "id": 12266,
  "origin_website": "Jove",
  "title": "Creating and Applying a Reference to Facilitate the Discussion and Classification of Proteins in a Diverse Group",
  "procedures": [
    "1. Determine the Defining Features of the Protein Group of Interest\nConsult previous publications to determine if there is a consensus regarding the features that are necessary to be considered part of the group. Take note of any inconsistencies or differences in opinion between research groups, and include characteristics that may serve to differentiate one subgroup from another.\nIf previous literature does not address defining characteristics, use sequences that are considered representative of the group as a starting point to identify conserved features.\n2. Collect Relevant Sequences\nIf reviews have been written that include analyses of sequences that are representing the group, include these sequences in the raw dataset. Retrieve sequences using accession numbers referenced in the literature and save in a standard sequence editing program (e.g., EditSeq in the Lasergene suite or one of many available for free online).\nIf the group in question has been defined in one of the structural databases, include the sequences the database lists as being part of the group. Retrieve sequences using accession numbers provided in the database and save in a standard sequence editing program, as above.\n\tNOTE: For example, the sequences categorized in the CS-αβ (scorpion toxin-like) superfamily in the SCOP database can be found here: http://scop.mrc-lmb.cam.ac.uk/scop/data/scop.b.h.c.h.html. \nPerform Basic Local Alignment Search Tool (BLAST)14 searches of public, online databases available through the National Center for Biotechnology Information (NCBI) to find sequences that may have not been included in the literature or structural databases. For the most complete results, use both the protein BLAST (blastp) and translated blast with protein query (tblastn) programs; these are both available at: https://blast.ncbi.nlm.nih.gov/Blast.cgi.",
    "Use sequences known to be part of the group of interest as query sequences. Copy and paste the sequence into the search box at the top, or provide a GenBank accession number or gi identifier, if available.\nChoose the database from the dropdown menu. Choose non-redundant protein sequences (nr) for blastp and expressed sequence tags for tblastn.\nSearch for results in specific taxa in the organism setting by typing the organism or taxon name and choosing from the list that appears while typing. To add additional organisms or taxa to exclude, click the \"+\" button and another field will appear. Exclude any unwanted taxa in the organism box by typing the organism or taxon name, choosing from the list that appears while typing, and checking the \"Exclude\" box on the right.\nAccess additional parameters by clicking on \"Algorithm parameters\" near the bottom of the page. Leave at default unless there is a rationale for changing a parameter.\nClick the \"BLAST\" button to run the analysis; it may take some time for the results to appear. In general, retrieve hits with an expect value (or e-value) of \"-05\" or better and save in a standard sequence editing program.\n\t\t\nIf all hits are above this threshold, rerun the search with an increased number of target sequences (in the algorithm parameters section) to obtain all relevant sequences.\nIf necessary, trim the sequences to exclude irrelevant information (e.g., the CS-αβ fold only applies to the mature peptide). Identify signal peptides and pro-peptides for removal using ProP15 (available online), or SignalP for more sophisticated signal peptide prediction16 (available online).\n3. Generate a Reference in a Spreadsheet Based on the Important Features That Were Identified",
    "Identify the defining characteristics of the group of interest. For example, use the CS-αβ fold definitively established by the solution structure of insect defensin A from Phormia terraenovae (Figure 1)8.\nThis fold includes a smaller motif called the cysteine-stabilized helix (CSH)17; identify this motif by a CXXXC (where X is any amino acid) upstream of a CXC that form two disulfide bonds (Figure 1, solid pink lines).\n\t\tNOTE: To complete the CS-αβ motif, a third disulfide bond is formed from additional cysteines placed before each half of the CSH motif (Figure 1, dotted pink lines).\nEnter these defining features into a spreadsheet. See Figure 2.\nUse columns for the conserved features and to represent the spaces between these features. Keep the columns wide enough to fit numbers and ensure that they have a consistent width. Set the width using the \"Format| Column Width\" function (Figure 2, pink arrow).\nUse the rows for the sequence names.\nWhen a sequence has the feature, fill in the box using the fill function (Figure 2, pink square). For spacing between features, enter the number of amino acids in the box between and leave it unfilled. For example, using the insect defensin sequence gives a reference that includes six cysteines, with defined spacings between C2 and C3 and between C5 and C6.\nAdd representative sequences that have been previously established as members of the group based on the structural databases and literature.",
    "NOTE: For example, previous literature and the SCOP database identify several groups for inclusion: insect defensins, short-chain scorpion toxins, long-chain scorpion toxins, MGD-1, plant defensins, nematode ABFs, drosomycins from Drosophila, and macins. The literature also identifies a bacterial sequence with only four cysteines that might represent the ancestor of this superfamily18. Adding these sequences increases the number of cysteines in the reference from six to ten but maintains the alignment of the important structural features (Figure 3).\n\t\nTo add a feature that is likely to define a subgroup of sequences (for example, an extra cysteine), use the \"Insert\" function (Figure 3, pink arrow).\nIf there are features missing from a given sequence, leave the box unfilled and combine it with boxes representing intervening amino acids. If necessary, merge the cells using the merge and center feature (Figure 3, pink box).\nContinue adding sequences to the groups to gain a better picture of the variation in each group of the larger superfamily. Summarize the group characteristics to facilitate comparisons (Figure 4).\nWhen the number of amino acids between major features varies, use a hyphen to indicate a range, such as 6 - 12 (6 to 12 amino acids), and a slash to indicate either/or, such as 7/10 (7 or 10 amino acids).\nChoose a way to annotate features of sequences that may be relevant but do not occur often enough to include in the reference. For example, since cysteines are important in this superfamily, label additional cysteines (Figure 4, pink boxes).\nAdd newly-identified sequences to the spreadsheet using the established sequences as a guide. For example, adding sequences from tardigrades (yellow) shows that the tardigrade sequences fall into several different groups of the superfamily (Figure 5 shows summaries instead of a row per sequence for space purposes).",
    "Show variability within a taxonomic group by rearranging the rows (Figure 6).\n4. Use the Reference to Refine Amino Acid Alignments\nNOTE: There are many programs that can be used for multiple sequence alignments, but this demonstration will use Molecular Evolutionary Genetics Analysis (MEGA6)19 because it is available to download for free.\nDownload and install the software.\nBegin a new alignment in MEGA by selecting \"Edit/Build Alignment\" under the Align tab. Select \"Create a new alignment\" in the box that appears and click \"OK.\" Then select \"Protein.\"\nSelect \"Insert Sequence from File\" in the \"Edit\" menu to import the sequences.\n\tNOTE: Sequences will need to be in FASTA format for import into MEGA. Background colors that reflect different amino acid types are used by default, but this option can be turned off under the \"Display\" menu.\nOnce all sequences are entered, click the flexing arm icon and then \"Align Protein\" to align the sequences using the MUSCLE algorithm20.\n\tNOTE: ClustalW is also available.\n\t\nIf a message saying that nothing has been selected pops up and asks to select all, click \"OK.\"\nNOTE: This opens a window that allows one to change some parameters, but they should only be changed there is reason to do so. This analysis uses a subset of the sequences analyzed in a previous paper12.\nCheck the alignment based on the important features; note that the top bar above the sequences will show any columns where the amino acid is completely conserved (*). See Figure 7. See that the initial alignment shows only three of the four conserved cysteines (Figure 7, pink boxes); looking down the column, the AlCRP sequence is clearly misaligned (Figure 7, pink arrow).",
    "To get rid of the large gap between the I and the conserved C, highlight the dashes and press the \"delete\" key. Do not highlight any amino acids, or they will be deleted as well.\nTo move amino acids to the right, highlight and press the space bar.\nNote that the AlCRP now has the structural cysteines aligned and that the last C of the CXXXC motif is conserved throughout the alignment (Figure 8). Adjust the alignment as necessary to prioritize the most important features of the sequences.\n5. Compare the Groups Identified Using the Reference with Results from Phylogenetic Analyses\nFrom preliminary alignments, determine which sequences should be included in a phylogenetic analysis; for a small number of sequences, this step may be unnecessary.\nKeep an alignment file that includes all sequences, but for a phylogenetic analysis, remove redundant sequences (Figure 9, pink boxes show pairs of redundant sequences).\nIf the data set includes a large number of sequences, run a preliminary analysis and select representatives from groups that always form a clade.\nDetermine the best amino acid substitution model.\nExport the alignment in MEGA format (under the data tab).\nGo to the Models menu and select \"Find Best DNA/Protein Model.\" Choose the file just saved and open it; this will open a window that has some parameters that can be changed.\nUse the default parameters unless there is a reason to change them. Click \"Compute\" to begin the analysis.\nRun a maximum likelihood (ML) analysis in MEGA.\nChoose \"Construct/Test Maximum Likelihood Tree\" from the Phylogeny menu.\nChoose the model determined to be the best fit for the data from step 5.2 (the output will give the substitution model as well as the best \"rates among sites\" parameter).",
    "Choose 1,000 bootstrap replicates to obtain the measures of support for the tree.\nClick \"Compute\" to run the analysis; MEGA has a \"Tree Explorer\" to visualize the tree.\nRun a Bayesian analysis in MrBayes open-source software21.\n\tNOTE: A MrBayes manual is also available from this site. This is intended to provide basic steps and is not a comprehensive guide to conducting Bayesian phylogenetic analysis.\n\t\nExport the MEGA alignment in PAUP (Nexus) format to the same folder as the MrBayes program.\nOpen MrBayes and type \"exe Filename\" (e.g., \"exe Alignment.nex\").\nSpecify the model and analysis parameters. Choose either the model specified in step 5.2 or choose the \"mixed\" setting that will try various models and report the frequency of the model in the trees with the best posterior probabilities (prset aamodelpr=mixed). Type \"showmodel\" to report the current model settings and \"help mcmc\" to show current parameter settings, with a brief explanation of each.\nSet the number of generations using the \"mcmcp ngen=\" command (1 million is typical).\nType \"mcmc\" to begin the analysis.\nWhen the number of generations has completed, the program will ask to add more generations. If the average standard deviation of split frequencies is less than 0.1, type no. If it is above 0.1, the analysis should be allowed to continue, or some parameters should be changed (see the manual).\nUse the \"sumt\" command to generate the tree files.\nAfter the analysis is complete and a consensus tree is generated, the tree can be viewed in FigTree (available online).\nCompare the trees to see if the methods generate consistent results.\n\tNOTE: Some sequences do not provide a lot of information: the trees may not be well resolved and the branches may have minimal support (Figure 10).",
    "Compare trees to the groups identified using the reference to see if the phylogenetic analyses support these groups.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}