{
  "id": 4591,
  "origin_website": "Bio",
  "title": "Mitochondrial Biogenesis Assay after 5-day Treatment in PC-3 Cells",
  "procedures": [
    "PC-3 cells were plated at a density of 2.5 x 103 cells per well in a final assay volume of 100 μl per well in a collagen coated 96-well plate one day before the treatment.   On the treatment day, three-fold serial dilutions of compounds in DMSO were prepared in duplicate in 96-well plates starting at a concentration close to the general cytotoxicity 5-day CC50 value of the compound. The CC50 value was measured by monitoring changes in the cellular ATP level. For compounds with general cytotoxicity CC50 value ≥ 100 μM, the starting concentration was at 100 μM. A representative 96-well plate map is shown in Figure 1.    Outer-wells, labeled as Blank in Figure 1, were treated with 0.5% DMSO and used as a background for future data analysis.   0.5% DMSO treated cells, labeled as DMSO control in Figure 1, were used as a non-drug treated control.     Compounds were mixed with medium to make 2x compound-medium solution, and then 100 µl/well of 2x compound-medium solution was added to the relevant wells in a 96-well cell plate. The final volume of the well was 200 µl. The final DMSO content was 0.5%.   After 5-day incubation, the cells were fixed with 50 µl/well of 4% paraformaldehyde for 20 minutes at room temperature. After fixing, the cells were washed with 1x PBS twice (prepared from dilution of 10x PBS).   At this point the plate could be stored at 4 °C up to a week with 100 µl/well of 1x PBS.",
    "The cells were analyzed with the MitoBiogenesisTM In-Cell ELISA Kit, which uses quantitative immunocytochemistry to measure protein levels of Complexes II (SDH-A) and IV (COX-1) in cultured cells, which involved the following steps:    The cells were permeabilized with 100 µl/well of 1x permeabilization buffer (prepared from dilution of 100x Triton X-100 with 1x PBS) for 30 min at room temperature with gentle agitation on a titer plate shaker at constant speed (setting 2 on a Lab-line Instrument). The same speed setting was used in all of the following steps when a shaker was used.   After removing the permeabilization buffer from the cell plate, the cells were incubated with 2x blocking buffer (200 µl/well) for 2 h at room temperature with gentle agitation on a titer plate shaker.   2x blocking buffer was prepared from dilution of 10x blocking buffer with 1x PBS.     After removing the blocking buffer, the cells were incubated with 1x primary antibodies in 1x blocking buffer (100 µl/well) overnight at 4 °C with gentle agitation on a titer plate shaker.   1x blocking buffer was prepared from dilution of 10x blocking buffer with 1x PBS.   1x primary antibodies was prepared from dilution of 200x primary antibodies with 1x blocking buffer.    The outer-wells were treated with 1x blocking buffer without antibodies.     On the following day, the cells were washed three times with 1x PBS-Tween buffer (300 µl/well, 3 times).   1x PBS-Tween buffer was prepared from dilution of 400x Tween-20 with 1x PBS.     After washing, the cells were incubated with 1x IRDye®-labeled secondary antibody in 1x blocking buffer (100 µl/well) for 2 h at room temperature with gentle agitation on a titer plate shaker.   1x blocking buffer was prepared from dilution of 10x blocking buffer with 1x PBS.",
    "1x IRDye®-labeled secondary antibodiys was prepared from dilution of 1,000x IRDye®-labeled secondary antibodies with 1x blocking buffer.   The outer-wells were treated with 1x blocking buffer without antibodies.     The cells were washed with 1x PBS-Tween buffer (300 µl/well) for 5 times and kept in 1x PBS-Tween buffer (200 µl/well) till imaging.   1x PBS-Tween buffer was prepared from dilution of 400x Tween-20 with 1x PBS.     IR imaging and quantitation were performed using a LI-COR® Odyssey instrument using both 700 (SDH-A) and 800 (COX-1) according to the manufacturer’s instructions (Figure 2). Export data for analysis.     The data were analyzed using GraphPad Prism software:   Background-corrected resulted were obtained by subtracting the average background value which was calculated using all of the outer-wells that contained no compound treatment or antibodies as stated in the previous steps.   0.5% DMSO treated cells were used as a 100% (untreated) control.   Individual protein levels were expressed as a percentage of the 0.5% DMSO control.    In cases where cell viability was severely affected, the data for mitochondrial biogenesis were excluded from the analysis due to significant errors associated with low signals.    Chloramphenicol was used as a positive control for the assay and a representative dose-response is shown in Figure 3.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119173856_0005.jpg Figure 1. A representative 96-well plate map  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119173916_0153.jpg Figure 2. A representative 96-well plate IR image. The photo was adapted from the MitoSciences website on Jan 2012.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119173940_0862.jpg Figure 3. Inhibition of mitochondrial biogenesis by chloramphenicol in PC-3 cells after 5-day culture. The % levels of COX-1 and SDH-A were shown in (•) and (▼), respectively. The cell viability, shown in (■), was monitored in parallel using another 96-well plate of PC-3 cells using CellTiter Glo. The data plotted were averages ± standard error from duplicate measurements. The CC50 values were 2.4, 13.",
    "4, and 88 µM for COX-1, ATP, and SDH-A levels, respectively."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}