{
  "id": 11326,
  "origin_website": "Jove",
  "title": "Fabrication of Micro-tissues using Modules of Collagen Gel Containing Cells",
  "procedures": [
    "1) Preparation of Tubing\n\tCut 2 to 3 m lengths of polyethylene tubing (0.76 mm I.D. x 1.22 mm O.D.).\n\tThread a 20 G1 needle into one end of the tubing.\n\tCoil the tubing and place in a convertors self-seal pouch (7 1/2\" x 13\").  The two ends of the tubing should be placed at the unsealed end of the bag and taped in place with gas sterilization tape.\n\tSeal bag and gas sterilize.\n2) Neutralization of Collagen\nNote: 1 ml of collagen fills about 2 m of polyethylene tubing.\n Place the necessary amount of collagen needed for the desired length of tubing into a 15 ml conical tube and keep on ice. \n Add 128 uL of 10x α-MEM per mL of collagen to the tube and mix by repeatedly pipetting the solution.  Note: (1) The solution should turn yellow as the α-MEM is mixed into the acidified collagen and (2) try to minimize bubbles when mixing.\n Neutralize the collagen by adding 0.8 M sodium bicarbonate until the collagen has a pH of 7.4.  For a general estimate of the pH add sodium bicarbonate until the yellow collagen solution turns a light pink color.  Note:  It typically takes 30 to 60 μL per each mL of collagen.\n Keep neutralized collagen on ice until ready to use as the neutralized collagen will gel if not kept at 4°C.\n3) Embedding of Cells (Optional)\nNote: Depending on the cell type the cells can be embedded at a concentration of between 1 million cells per mL to 20 million cells per mL.  Use the medium required for the cells that you want to embed.\n Remove media from cells and wash with 5 mL PBS.\n Remove PBS and add 3 mL trypsin-EDTA.\n Incubate the cells in trypsin-EDTA for 5 min at 37°C.",
    "Resuspend cells in 7 mL media.\n Count cells.\n Transfer the required number of cells for embedding to a 15 mL conical tube.\n Pellet the cells at 300 x g for 5 min.\n Aspirate media off the cell pellet.\n Resuspend the cells in the neutralized collagen and keep on ice.\n4) Gelling of Collagen\n In a biological safety cabinet cut off the sealed end of the bag containing the polyethylene tubing.\n Attach a 3 ml syringe to the 20G needle in the one end of the tubing using sterilized tweezers.  Keep the tubing in the bag.\n Insert the other end of the tubing into the neutralized collagen until the tip is at the bottom of the conical tube using sterilized tweezers.  Keep the conical tube on ice.\n Pull the collagen into the polyethylene tubing by retracting the plunger of the syringe slowly.\nNote: If the collagen is pulled into the tubing to quickly then bubbles will form in the collagen.\n After pulling the collagen through the tubing, pull the 20G needle out of tubing and put both ends back into the bag.  Tape the bag shut.\n Incubate the bag at 37°C for 60 min.  If the collagen contains cells then flip the bag over every 15 min. so that the cells do not settle to one side of the module.\n5) Cutting of Tubing Containing the Gelled Collagen\n Autoclave headers and blade for the cutting device and tray to hold tubing.\n Assemble the cutting device.\n Place tubing in a sterile tray in front of cutting device and load the tubing into the \ncutting device.\n Set up a 50 mL conical tube containing 25 mL of media at the outlet of the cutting \ndevice to collect the cut modules.",
    "Note: Use media containing FBS even for collagen-only modules as the modules do not separate from the tubing without FBS in the media. If the modules contain cells use the media required for the embedded cells.  If there are no embedded cells in the modules use the media for the endothelial cells.\n Set the cutting device to cut 2 mm lengths of tubing and cut the tubing.\n Incubate cut modules at 37°C for 60 min in the 50 mL conical tube.\n6) Removing Collagen Modules from Tubing\n Vortex 50 mL conical tube containing modules in the tubing for 10 sec.\n\tNote: Be gentle when separating modules embedded with high cell density to avoid breakage. \n Let modules settle to the bottom of the tube.  Takes about 5 min.\n Using a wide mouth 10 mL serological pipette transfer the settled modules to a 15 mL \nconical tube.\n Repeat steps 6.1 to 6.3 twice.\n Go to step 7 to coat modules with endothelial cells or transfer modules to a non-tissue \nculture treated plate.\n7) Coating the modules with endothelial cells\n Settle modules into the bottom of a 15 mL conical tube with 5 mL of media for the embedded \ncells.\n Remove media from the endothelial cells and wash with 5 mL PBS.\n Remove PBS and add 3 mL trypsin-EDTA.\n Incubate the cells in trypsin-EDTA for 5 min at 37°C.\n Resuspend cells in 7 mL media.\n Count cells.  Need 5x106 endothelial cells per mL of packed modules at the bottom of \nthe conical tube.\n Pellet the cells at 300 x g for 5 min and resuspend in 5 mL endothelial cell media.\n Add the 5 mL of the media containing endothelial cells to the modules.",
    "Note: This gives a 50:50 ratio of the two media types which we have found to work for the survival and function of both cell types. Test the use a co-culture medium formulated to ensure proper maintenance of phenotypes of the two cells types before using it. \n Incubate the modules with the endothelial cells both statically and dynamically.\n For static incubation mix modules with endothelial cells by inversion and set the tube upright at 37°C for 15 min. Repeat.\n Dynamically seed the endothelial cells by gently rocking the tube at 37°C for 60 min.\n Repeat static incubation twice.\n Place the modules in a non-tissue culture treated plate and incubate overnight at 37°C.\n The next day place the modules in a new non-tissue culture treated plate with fresh media (50:50 mix if using co-culture system) to remove unattached endothelial cells.\n Incubate modules that are coated with endothelial cells until they cover 100% of the surface of the modules.  This usually takes about 7 days.\n8) Representative Results:\nThe modules will look cylindrical when they first are removed from the tube.  If the modules contain embedded cells and/or are coated with endothelial cells they can contract up to 50% in volume and develop an oval shape (Figure 1).  The modules will also become denser and more opaque when viewed by light microscopy (Figure 1).  Also when the endothelial cells are confluent on the surface of the modules there is a formation of tight junctions which can be seen by immunofluorescence staining of VE-Cadherin (Figure 2).  Mass transfer analysis has demonstrated that modules are capable of supporting high cell densities (8x107 cells/cm3) without developing a necrotic core due to inadequate oxygen transport, which is often problematic in larger tissues (e.g. modules of large diameter, D = 1.4mm) (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig1.jpg",
    "Figure 1:  Module fabrication and contraction. Module contraction occurred during the three days following HUVEC-C (endothelial cell line) seeding results significantly smaller module diameter and length (p < 0.001) (A). Embedded HepG2 cells were uniformly distributed within modules at time of fabrication and retained high viability (B). [Live cells   green; dead cells   red]  [adapted from Corstorphine 2010]\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig2.jpg\nFigure 2:  VE-Cadherin immunofluorescent staining of EC tight cell junctions 10 days after RAEC where coated on the surface of a module.  Scale bar = 50 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig3.jpg\nFigure 3:  Masson's trichrome staining of typical modules (0.76 mm initial diameter) and large modules (1.4 mm initial diameter) demonstrate the effect of oxygen diffusion limitations.  Seven days following fabrication, a large number of dead cells had formed within the core of the large modules (lower right panel), leaving only a thin rim (~200μm thick) of viable cells.  Conversely, the small modules retained a uniform and high distribution of live cells. [Modules embedded with HepG2 cells and coated with endothelial cells.]  [Taken from Corstorphine 2010]\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig4.jpg\nFigure 4: (A)  HMEC-1 seeded on poloxamine - collagen modules.  After Day 1 of seeding the poloxamine-collagen modules retain their cylindrical shape and there is limited cell attachment properties compared to collagen only modules. Scale bar = 200 μm.  (B) Light microscope image of a collagen module containing PLGA-based biodegradable microspheres. Scale bar = 500 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig5.jpg\nFigure 5:  Examples of in vitro assays. (A)  Angiogenesis assay: capillary-like formations on the module seeded with endothelial cells can be easily detected and quantified after 5 days of incubation with adipose-derived stem cells.  (B)  Confocal microscopy images of a live/dead assay on modules where the staining for live cells is green and for dead cells is red.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig6.jpg",
    "Figure 6: Collagen modules containing embedded mesenchymal stem cells and a surface layer of endothelial cells.  Modules were exposed to shear stress (~0.64 dyn/cm2) for 7 days in a microfluidic chamber and begin to show fusion at points of contact.  Endothelial cells are stained with vWF (brown) and mesenchymal stem cell nuclei appear blue (H&E).  Scale bar = 100μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2177/2177fig7.jpg\nFigure 7:  Hundreds of collagen modules containing Adipose-Derived Stem cells (ASC) and coated with Human Microvascular Endothelial Cells (HMEC) are implanted under mouse skin to study ASC/HMEC interaction in vivo for fat regeneration applications.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}