{
  "id": 2549,
  "origin_website": "Cell",
  "title": "Non-canonical inflammasome activation analysis in a mouse model of Citrobacter rodentium infection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOral infection of mice with C. rodentium\nTiming: 17 days\nThis section describes procedures for oral infection of mice with C. rodentium.\nOne day before infection (at day −1).\nPrepare the required number of mice.\nNote: In this protocol, 5-week-old male C3H/HeJ mice (Figure 2[href=https://www.wicell.org#fig2]A) were chosen for normal C. rodentium infection. The 8-week-old female C57BL/6J mice (Figure 2[href=https://www.wicell.org#fig2]B) were used for infection with Cr transformants carrying the plasmid encoding VF and ampR genes (In this article, we used Cr-SubABwt as Cr-VF transformants; Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2053-Fig2.jpg\nFigure 2. Oral administration of C. rodentium bacteria to C3H/HeJ and C57BL/6J mice\n(A) C3H/HeJ mouse. Male, 5-week-old mice were used for infection with normal C. rodentium (Cr).\n(B) C57BL/6J mouse. Female, 8-week-old mice were used for infection with VF-expressing Cr transformants.\n(C) Disposable syringe and feeding needle used for this protocol.\n(D−F) Oral administration of C. rodentium bacteria. Simulation of insertion position of the feeding needle (D). Insertion into the mouth (E). Injection of the bacterial solution (F). (Upper panel: C3He/J mouse, Lower panel: C57BL/6J mouse).\nWeigh the mice and divide them into the required number of groups.\nStop food intake for 8–12 h before infection.\nAt day 0.\nPrepare the bacterial solution according to the section “preparation of the C. rodentium inoculum for mouse infection[href=https://www.wicell.org#sec1.3]” in “before you begin[href=https://www.wicell.org#before-you-begin]”.",
    "Note: In this article, we infected C3H/HeJ mice with 2.5 × 108 CFUs of C. rodentium and the C57BL/6J mice with 5 × 109 CFUs of Cr-VF transformants via oral gavage with a disposable 1-mL syringe (e.g., Terumo) and a flexible plastic feeding needle (e.g., Fuchigami, 5202K) (Figure 2[href=https://www.wicell.org#fig2]C). Before the feeding needle is inserted, hold the mouse and confirm the insertion position of the feeding needle from the mouth to the stomach of the mouse from the outside (Figure 2[href=https://www.wicell.org#fig2]D).\nIntroduce the bacterial solution into the syringe, attach the feeding needle, and remove air bubbles as much as possible. Insert the feeding needle from the side of the mouth to avoid teeth and slowly push inward, so that the needle is parallel to the upper jaw, and advance into the throat (Figure 2[href=https://www.wicell.org#fig2]E).\nKeep the mouse head vertically aligned with the body as much as possible by holding the needle and syringe vertical. Once the needle has entered the esophagus, gently push the needle down until the needle of the confirmed length is inserted (Figure 2[href=https://www.wicell.org#fig2]F).\nGently inject 100 μL of bacterial solution without overflow from the mouth.\nAfter 1–2 h of infection, resume food intake. See problem 2[href=https://www.wicell.org#sec7.3] in troubleshooting[href=https://www.wicell.org#troubleshooting].\nAt day 1 to day 16.\nRecord the body weight of the mice daily and analyze the weight change according to the initial weight at day –1 or 0 (Figure 3[href=https://www.wicell.org#fig3]). See “CRITICAL” below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2053-Fig3.jpg\nFigure 3. Analysis of daily weight change and intestinal tissue collection of mice\n(A) Time schedule of experimental design including oral administration of C. rodentium to mice and analysis for non-canonical inflammasome activation.\n(B) Body weight monitoring of C3H/HeJ mice that received C. rodentium. Data are means ± SD (Mock: n = 3, Infection: n = 6). ∗∗p< 0.01.",
    "(C) Survival curve of C3H/HeJ mice that received C. rodentium (Mock: n = 3, Infection: n = 6). ∗p< 0.05.\n(D) Representative images of gross colon specimens from C3H/HeJ mice that received C. rodentium at 8–10 dpi.\n(E) Body weight changes in C57BL/6J mice that received PBS (Mock), Cr-SubABwt, or Cr-SubABmt, expressed as relative changes from 0 dpi. Data are averages (± SD) of 5 mice per group. ∗∗p< 0.01 (figure reprinted with permission from Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]).\n(F) Representative images of gross colon specimens from C57BL/6J mice that received PBS (Mock), Cr-SubABwt, or Cr-SubABmt at 15–16 dpi (figure reprinted with permission from Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]).\nTo analyze inflammasome activation in the intestine and the CFUs of bacteria in feces, euthanize mice at 8–10 days post infection (dpi) (C3H/HeJ mice) and 4–16 dpi (C57BL/6J mice).\nCollect intestinal tissue segments and feces into sterile microcentrifuge tubes. Prepare a homogenate of the mouse intestine and examine the activation and expression of inflammasome-related proteins, according to the protocol sections “collection of intestines and feces from euthanized mice[href=https://www.wicell.org#sec3.2]” and “analysis of non-canonical inflammasome activation in the mouse intestine[href=https://www.wicell.org#sec3.3].” Determine the CFUs of Cr-VF transformants (e.g., Cr-SubABwt) in the feces as in the protocol ‘‘determination of the CFUs in feces of C. rodentium transformants carrying the plasmid encoding VF and ampR genes (Cr-VF)[href=https://www.wicell.org#sec3.4].”",
    "Note: Intestinal tissue can be stored at −80°C for approximately 1 month. Tissues may dry out and lose weight if stored for longer than a month. We recommend homogenizing the tissue and storing it as a lysate at −80°C. Solubilized samples can be used for IL-18 analysis by ELISA for at least 1 month and for caspase-1 and caspase-11 analysis by Western blotting for at least 1 year. On the other hand, mouse feces must be fresh for the CFU assay. Do not freeze feces as freezing kills fecal bacteria.\nNote: The disposable feeding needle is made of a plastic material and is 38 mm long, straight but flexible. Flexibility of the tip reduces the chance of traumatic injury to the esophagus. Stainless steel feeding needles are also available (Wang et al., 2020[href=https://www.wicell.org#bib9]).\nCritical: If mice lost 20% of their body weight in a few days, or more than 25% of their body weight in a week, euthanize them as a humane endpoint and score the mice as dead. Construct survival curves by using the Kaplan-Meier method, and analyze the statistical significance via the log-rank (Mantel-Cox) test with GraphPad Prism 7.0 (GraphPad Software) (Figures 3[href=https://www.wicell.org#fig3]B and 3C). See problem 3[href=https://www.wicell.org#sec7.5] in troubleshooting[href=https://www.wicell.org#troubleshooting].\nCollection of intestines and feces from euthanized mice\nTiming: 3 h\nThis section describes the procedures to collect intestines from infected mice and to prepare tissue homogenates. In order to measure fecal CFUs, feces must also be collected at this step.\nEuthanize mice and collect intestines.\nEuthanize the mice with isoflurane or cervical dislocation.",
    "Note: In this article, we euthanized C3H/HeJ mice that received C. rodentium at 8–10 dpi. In our previous article, we euthanized C57BL/6J mice that received Cr-VF transformants (e.g., Cr-SubABwt) in a time-dependent manner at 4, 6, and 11 dpi for assay. In addition, for pathological analysis of the intestine, we euthanized Cr-SubABwt-infected mice at 14–15 dpi as the endpoint, and we euthanized mock (PBS)-infected and Cr-SubABmt-infected mice at 16 dpi (Figures 3[href=https://www.wicell.org#fig3]E and 3F).\nNote: Bacterial CFU in feces increased gradually until about 11 dpi. This increase pattern is consistent with other reports (Wang et al., 2020[href=https://www.wicell.org#bib9]).\nCollect intestines and place them in a clean Petri dish containing chilled PBS. Wash the outside of the intestines with PBS and transfer the intestines to a clean Petri dish.\nAfter removing the excess PBS, measure the length of the intestines (from the cecum to the rectum) and take pictures on a clean white paper (Figures 3[href=https://www.wicell.org#fig3]D and 3F).\nCut open the intestines longitudinally. Wash them by swirling in a clean Petri dish with fresh chilled PBS. Wipe off excess PBS with a paper towel and cut the intestines (from distal colon region) into segments. See problem 4[href=https://www.wicell.org#sec7.7] in troubleshooting[href=https://www.wicell.org#troubleshooting].\nNote: In the protocol with the C57BL/6J mice that received Cr-SubAB transformants, we assessed fecal CFUs (Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]). After cutting open the intestines longitudinally, collect feces and put them into a sterilized 1.5-mL tube, measure the fecal weights, and prepare fecal homogenates for determination of CFUs of Cr-SubAB transformants in the feces. (See the section below “determination of the CFUs in feces of C. rodentium transformants carrying the plasmid encoding VF and ampR genes (Cr-VF)[href=https://www.wicell.org#sec3.4].”).\nPrepare tissue homogenates.",
    "Weigh tissue segments and add 5–10 × volume of RIPA buffer containing protease inhibitor. If the tissue weight is 50 mg, add 500 μL of the buffer. Homogenize the segments with the Polytron homogenizer (Kinematica) on ice for 3 min (at intervals of 30 s ON/30 s OFF).\nSonicate samples with the Bioruptor UCD-250 (Tosho Electric) for 2 min (at high power, at intervals of 10 s ON/10 s OFF). Centrifuge at 15,000 × g for 15 min at 4°C.\nCollect supernatants as protein samples for inflammasome activation analysis.\nMeasure protein concentrations by using BCA methods (Protein Assay BCA Kit, FUJIFILM Wako Pure Chemical Corp.).\nSubject the samples to the enzyme-linked immunosorbent assay (ELISA) for IL-18, SDS-PAGE, and Western blotting for inflammasome-related protein expression and activation according to the section “analysis of non-canonical inflammasome activation in the mouse intestine[href=https://www.wicell.org#sec3.3]” below (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2053-Fig4.jpg\nFigure 4. Evaluation of non-canonical inflammasome activation in mice intestine\n(A) Intestinal IL-18 production in C3H/HeJ mice infected with C. rodentium (Cr) at 8–10 dpi. Intestinal proteins were analyzed by using a mouse IL-18 ELISA kit. Data are means ± SD (Mock: n = 3, Infection: n = 5). ∗∗p< 0.01.\n(B) Representative Western blotting images of caspse-1 activation (upper panel), caspase-11 expression (middle panel), and IL-1β production (lower panel). Intestinal proteins from C3H/HeJ mice were analyzed by means of Western blotting by using anti-caspase-1, anti-caspase-11, and anti-IL-1β antibodies. Actin served as the loading control.\n(C) Representative Western blotting images of IL-1β production (upper panel). Actin served as the loading control (lower panel). Intestinal proteins from C57BL/6J mice that received Cr-SubAB transformants (Cr-SubABwt or Cr-SubABmt) were analyzed by means of Western blotting by using anti-IL-1β antibody (figure reprinted with permission from Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]).",
    "(D) Intestinal IL-18 production. Intestinal proteins from C57BL/6J mice were analyzed by means of a mouse IL-18 ELISA kit. Data are averages (± SD) of 3 mice per group. ∗p< 0.05 (figure reprinted with permission from Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]).\n(E) Representative Western blotting images of caspase-1 activation (upper panel), BiP cleavage (middle panel), and caspase-11 expression (lower panel). Actin served as the loading control. Intestinal proteins from C57BL/6J mice that received Cr-SubAB transformants were analyzed by means of Western blotting by using anti-caspase-1, anti-BiP, and anti-caspase-11 antibodies (figure reprinted with permission from Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]).\nNote: Solubilized samples can be used for IL-18 analysis by ELISA for at least 1 month and for caspase-1 and caspase-11 analysis by Western blotting for at least 1 year.\nAnalysis of non-canonical inflammasome activation in the mouse intestine\nTiming: 2 days\nThis section describes the ELISA procedure for IL-18, and the procedure for SDS-PAGE and Western blotting to analyze IL-1β production and caspase-1 activation.\nELISA for IL-18.\nNote: IL-18 is a member of the IL-1 cytokine family. Production of the activated form (mature IL-18) via processing by caspase-1 is inflammasome-dependent. In this article, mouse intestinal IL-18 levels were determined by using ELISA according to manufacturers’ instructions. A mouse IL-18 ELISA kit is commercially available from different manufacturers (e.g., MBL Cat#7625, https://ruo.mbl.co.jp/bio/dtl/dtlfiles/7625_220301_ver9.pdf[href=https://ruo.mbl.co.jp/bio/dtl/dtlfiles/7625_220301_ver9.pdf]).\nDilute each sample (1:20–1:200) with the Assay diluent included in the ELISA kit (e.g., corresponding to a protein concentration of 0.03–0.3 mg/mL).\nTransfer 100 μL of each sample to mouse IL-18 antibody-coated microwells and allow a reaction to proceed for 1 h at room temperature (approx. 25°C).",
    "Prepare Wash solution by diluting Wash concentrate included in the kit to 1:10 with ddH2O prior to use. Discard the well contents, and fill each well with a Wash solution (approx. 300 μL). Repeat this washing step for a total of four times.\nAfter removing the Wash solution, fill the wells with 100 μL of Conjugated antibody solution and incubate for another 1 h at room temperature.\nWash the microplate again as in step c. After removing the Wash solution, fill the wells with 100 μL of Substrate reagent and incubate for 30 min in the dark at room temperature.\nAdd 100 μL of Stop solution to each well. After the reaction stops, immediately (within 30 min) measure the absorbance at 450 nm with a microplate reader (e.g., iMarkTM Microplate Absorbance Reader, Bio-Rad).\nCalculate the IL-18 concentration (pg/mL) of each sample as well as the standard. Plot a standard growth curve and calculate IL-18 with the results shown as ng per mg of protein (ng/mg protein) using the protein concentration determined by means of the BCA method.\nCritical: If sample concentration is outside the dynamic range of the assay, further dilute the samples with the appropriate diluent and repeat the assay.\nSDS-PAGE and Western blotting for IL-1β production and caspase-1 activation.\nNote: Production of activated IL-1β via processing by caspase-1 is inflammasome-dependent. Caspase-1 activation occurs by auto-processing of pro-caspase-1 (p50) to activated forms of caspase-1 (p10 and p20 subunits). In this article, intestinal levels of activated IL-1β and caspase-1 (p20) were evaluated as biomarkers of inflammasome activation by Western blotting. The endoplasmic reticulum chaperone BiP, a SubAB substrate protein, was also analyzed for its cleavage type as a marker showing SubAB activity (Figure 4[href=https://www.wicell.org#fig4]E).",
    "Note: Western blotting (also known as immunoblotting) is generally used in research to identify and detect proteins. STAR Protocols provides excellent articles explaining Western blotting (Burckhardt et al., 2021[href=https://www.wicell.org#bib1]; Ziman and Oviedo, 2021[href=https://www.wicell.org#bib10]). See those articles for more details.\nPrepare 12% acrylamide gel (for the activated form of caspase-1, actin, and BiP) and 15% acrylamide gel (for the activated form of IL-1β). Load appropriate amounts of protein samples to each well.\nRun electrophoresis with a constant current of 30 mA per gel for approximately 60–90 min until the blue dye in the sample buffer reaches approximately 5 mm from the bottom of the gel.\nTransfer the separated proteins onto a PVDF membrane (e.g., Immobilon-P PVDF membrane, Merck Millipore) under wet transfer conditions at 100 V for 1 h on ice.\nBlock the membrane with 5% skim milk in TBST[href=https://www.wicell.org#sec2.3] with gentle shaking for 1 h at room temperature (approx. 25°C). Wash the membrane with TBST with gentle shaking. Incubate it with primary antibody overnight (12–18 h) at 4°C.\nNote: Use Can get signal (Toyobo) solution 1 (for primary antibody) and solution 2 (for secondary antibody) as antibody dilution buffer.\nWash the membrane 5 times for 5 min with TBST and then incubate it with secondary antibody for 1 h at room temperature.\nWash the membrane 5 times for 5 min with TBST. Prepare chemiluminescent reagent according to the manufacturer’s protocol (e.g., Immobilon Western Chemiluminescent HRP Substrate, Merck Millipore, https://www.merckmillipore.com/JP/en/product/Immobilon-Western-Chemiluminescent-HRP-Substrate,MM_NF-WBKLS0050[href=https://www.merckmillipore.com/JP/en/product/Immobilon-Western-Chemiluminescent-HRP-Substrate,MM_NF-WBKLS0050]).\nDetect the band with an image analyzer (e.g., ChemiDocTM XRS System with Image Lab Software for PC Version 6.0.1, Bio-Rad).",
    "Note: When comparing caspase-1 activation quantitatively, quantify the band intensity of activated caspase-1 (p20) detected around 20 kDa (Arrowhead in Figures 4[href=https://www.wicell.org#fig4]B and 4E) by densitometry. Also quantify the band intensity of actin as a loading control. Divide the p20 band intensity by the actin band intensity for each lane, and use the p20/actin value for evaluation.\nCritical: Mouse tissue homogenates usually contain endogenous immunoglobulin. Secondary antibody against mouse monoclonal antibody binds to the endogenous immunoglobulin and causes inaccurate blotting images. To reduce the signals from the immunoglobulin light chain (25 kDa) and heavy chain (50 kDa), use a conformation-specific secondary antibody (e.g., Anti-mouse IgG Veriblot for IP secondary antibody (HRP) ab131368, Abcam). See problem 5[href=https://www.wicell.org#sec7.9] in troubleshooting[href=https://www.wicell.org#troubleshooting].\nDetermination of the CFUs in feces of C. rodentium transformants carrying the plasmid encoding VF and ampR genes (Cr-VF)\nTiming: 2 days\nThis section describes the procedure to prepare fecal homogenates and the calculation of intestinal CFUs of Cr-VF with the ampR gene.\nPrepare fecal homogenates.\nAfter euthanasia of C57BL/6J mice that received Cr-SubAB transformants, collect intestines into clean Petri dishes.\nCut open the intestines longitudinally. Collect feces randomly into sterilized 1.5-mL tubes and weigh the feces.\nAdd 50 μL of PBS for every 10 mg of feces (20% w/v in PBS). Dissolve the feces by vigorous vortexing. Prepare serial dilutions of fecal slurries as shown in Figure 5[href=https://www.wicell.org#fig5]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2053-Fig5.jpg\nFigure 5. Fecal CFU assay for C. rodentium colonization\n(A) Serial dilution procedure for the mouse fecal CFU assay.\n(B) Colony formation of fecal Cr transformants on MacConkey agar plates containing ampicillin. Purple (or reddish purple) colonies formed on agar plates inoculated with diluted fecal homogenates from Cr-SubABwt-infected C57BL/6J mice.",
    "(C) Fecal bacterial CFUs of mice that received Cr-SubAB transformants (figure reprinted with permission from Tsutsuki et al., 2022[href=https://www.wicell.org#bib7]). Mouse feces were collected at 11 dpi from intestines of three mice (three feces per mouse). The number of viable bacteria was determined by CFU analysis of the plates; results are given as log10 CFUs per gram of feces. Data are means ± SD (n = 9 per group). ∗p< 0.05; ∗∗p< 0.01.\nPlate the serial dilutions onto MacConkey agar plates containing ampicillin (100 μg/mL) and incubate the plates overnight at 37°C.\nNote: Mouse feces must be fresh for the CFU assay. Do not freeze feces as freezing kills fecal bacteria. Diluted samples should preferably be spread on agar plates immediately after preparation.\nNote: After this incubation, Cr transformants such as Cr-SubAB form purple (or reddish purple) colonies on MacConkey agar plates containing ampicillin; they are resistant to ampicillin because of the ampR gene on the pET23b plasmid. This color change is due to lactose metabolism (Figure 5[href=https://www.wicell.org#fig5]B). See problem 6[href=https://www.wicell.org#sec7.11] in troubleshooting[href=https://www.wicell.org#troubleshooting].\nCalculate intestinal CFUs of Cr-VF (e.g., Cr-SubABwt) with the ampR gene.\nCount the colonies on the agar plates and determine the number of viable bacteria by means of the CFU method (Figure 5[href=https://www.wicell.org#fig5]).\nCalculate intestinal bacterial CFUs with the results shown as CFUs per gram of feces (CFUs/g). CFUs/g = (CFUs in the diluted solution) × 10 × (dilution factor) × 5.",
    "Note: For example, for the samples shown in Figure 5[href=https://www.wicell.org#fig5]C, the CFUs of Cr-empty = 430 (approx. average of CFUs in 1:103 dilution) × 10 × 103 (dilution factor) × 5 = 2.15 × 107 CFUs/g; the CFUs of Cr-SubABwt = 1558.9 (approx. average of CFUs in 1:104 dilution) × 10 × 104 (dilution factor) × 5 = 77.9 × 107 CFUs/g; the CFUs of Cr-SubABmt = 570 (approx. average of CFUs in 102 dilution) × 10 × 102 (dilution factor) × 5 = 0.29 × 107 CFUs/g."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Health Sciences",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}