{
  "id": 14388,
  "origin_website": "Jove",
  "title": "Quantitative Assessment of Cortical Auditory-tactile Processing in Children with Disabilities",
  "procedures": [
    "1. Assessment of Response to Light Touch\nPlace the electrode net (e.g. 128-channels geodesic sensor net) on child or infant's head. Adjust sensors for full contact using warm saline solution. If on a child, ensure child is sitting comfortably in parent or caregiver lap. If on an infant, ensure that infant is lightly swaddled and either held in caregiver's arms or in a supine position in an open crib.\nPosition a 1 mm nozzle 0.5 cm below the tip of the index finger of the tested hand. Place finger for a young child or palm for an infant in a mold holder and secure with Velcro tape proximal and distal to joint to ensure consistent distance from nozzle to the finger or hand. It is absolutely essential that the child maintains the proper finger position throughout the testing session. Ensure this by periodically assessing finger and hand placement and having child with caregiver if young. If testing an infant, stop protocol if infant cries and provide comfort before restarting. If testing young child, ask caregiver to provide comfort and reassurance throughout the short testing period.\nStart air compressor at 40 psi through regulator to supply valve inputs for tactile stimuli.\nRun stimulus delivery program.\n\t\nFor the tested hand, present 60 puff stimuli randomly interspersed with 60 sham trials (an air puff delivered via a separate nozzle pointed away from the finger).\nDo not present more than two repetitions of a puff or sham in a row. Vary the inter-trial intervals randomly between 2,000-2,500 msec. The purpose of this is to reduce habituation, where a stimulus is no longer perceived. The total time for a sequence of 120 trials should be 4.5-5 min.\nRun the identical protocol again for the other hand if studying asymmetrical somatosensory disorders.",
    "For protocols not requiring attention to stimulus no further set up is needed. This applies to infant testing. For enhancement of attention in young children (which results in larger specific ERP peaks in recording), provide a task.\n\t\nTask example for 5-year-olds: Describe air puffs as \"bubbles\" blown by \"fish\" in a \"fish tank\" (a decorated box concealing the puffer apparatus). Ask children to guess whether each \"bubble\" is delivered by a blue or a red \"fish\". Tell the child that they do not need to and should not say anything while they are performing this task (see set up with mock aquarium in Figure 1).\n2. Assessment of Response to Multisensory Protocol (Auditory-tactile Simultaneous vs. Summed Individual Responses)\nRun through steps 1.1-1.3 as described above. Stimuli are described in Table 1.\nRun the stimulus delivery program (e.g. in E-Prime software). For the tested hand, an auditory-tactile paradigm can present the following 4 stimuli randomly, with 60 trials/ stimulus: puff , puff-/ga/, /ga/-sham, sham. Again, to limit the possibility of habituation, do not present more than two repetitions of a puff or sham in a row in any condition, and vary the inter-trial intervals randomly between 2,000-2,500 msec. Each sequence of 240 trials should take between 9-10 min.\nRun identical protocol over for the other hand.\nProvide a soundless age-appropriate cartoon at initiation of protocol and continue it throughout the procedure to prevent increase in motor artifacts from restlessness, and to decrease the background from large patient-generated delta waves when they are bored. For example, in 5-year olds, we used a loop of 20 min of a purchased video, played on mute and restarted before each subject was tested. No attention to stimulus is needed, therefore the looped cartoon provides a visual background disconnected from the stimuli.",
    "3. Software and Equipment Set Up\nTo program the software, set up two serial commands sent by the stimulus control application. One identifies the puff, the other the sham. Have the stimulus control application send the commands to a microcontroller.\nHave the microcontroller generate a TTL pulse (e.g. 20 msec duration) to the corresponding digital output channel. This output must be split into two lines, one for the digital input to the EEG recording system and one to the solenoid-gated air valves. Mark the opening of both valves in the EEG data stream.\nMeasure the pulse to puff latency for both real and sham conditions with an oscilloscope and a microphone. These should be uniform, and in the order of 10-15 msec. Adjust for the latency post-recording.\nCalculate the force exerted at the nozzle in PSI using a manometer and by measuring the nozzle diameter. Use the formula F(N) = Pressure*Area. For example, the force exerted from a 1 mm radius nozzle at 6 psi yields F(N) = 0.03 lbs.\nTo modify the control application for the multisensory protocol, send two serial commands identifying a real puff or sham to the microcontroller as well as a recorded speech sound or silence. Note: In our paradigm we have used the computer generated, accent-neutral /ga/ sound, among others such as /da/, /du/, /bu/, etc.\nPresent auditory stimuli through a speaker placed at midline, 2 ft in front of the subject.\nAlign the sound onset timing to be simultaneous with the onset of the puff or with the delay measured in step 3.3, depending on which condition is desirable to the tester.\n4. Data Acquisition and Preparation",
    "Choose filters and references settings to sample data based on standard ERP methodologies. Here, use a 1,000 Hz with filters set to 0.1-400 Hz. During data collection, refer all electrodes to Cz and rereferenced them offline to an average reference.\nTo segment the data, filter the recorded data with desired filters and segmenting. For this study use a 0.3-40 Hz bandpass filter and segment the ongoing EEG based on the stimulus onset to include a 200 msec prestimulus baseline and a 500 msec post-stimulus interval.\nPerform quality control of the data. Screen each segment for motor and ocular artifacts such as high frequency muscle activity, using computer algorithms included in the ERP software. Follow this screen by a manual review.\nThe automated screening criteria are set as follows in this protocol but can be modified: for eye channels, voltage >140 µV = eye blink and voltage >55 µV = eye movements.\nCorrect data from contaminated trials using an ocular artifact correction tool. Note: Any channel with voltage >200 µV is considered of poor quality. If >15 channels are of poor quality, we chose to discard the entire trial for reproducibility reasons.\nAverage ERPs. Rereference them to an average reference and then perform baseline-correction based on criteria chosen in step 4.2. Extract mean amplitude and peak latencies for various peaks, extrapolated from grand average waveforms of predefined populations. Note: In our case, we based the following on established literature of older children's response to median nerve stimulation10-14. We used P50 (30-80 msec), N70 (50-100 msec), P100 (80-150 msec), N140 (130-230 msec), and P2 (250-350 msec) peaks.\nInclude only data from electrodes overlapping preset locations (Figure 2). Derive data for individual electrodes and average within each cluster.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}