{
  "id": 7467,
  "origin_website": "Bio",
  "title": "Chronic Daily House Dust Mite Exposure in Mice is an Effective Model to Quantify the Effect of Pharmacologic Agents on Discrete Stages of Artery Remodeling in Pulmonary Hypertension",
  "procedures": [
    "AnimalsThe standard HDM vascular remodeling time course was generated using eight to ten-week-old BALB/c female mice (Charles River, strain 028). This protocol has been tested and validated in both adult male and adult female mice (>10 weeks old) of multiple genotypes, ages, and body weights, and with multiple lab personnel. No consistent differences in the degree or rate of vascular remodeling in each case have been noted. Before initiating a large-scale experiment, we recommend confirming the timeline of artery remodeling within a lab’s particular experimental set up (using mice of the same genetic background, same lab personnel, same HDM lot, etc. that will be used in the larger experiment) with a small number of animals (2-3 per end point). Production of an artery remodeling time course (as shown in Figure 2B) and medial thickness and neointimal lesion quantitation plots at each time point (as shown in Figure 2C) will allow for precise staging of windows of vascular remodeling, tailored for each lab’s particular conditions and experimental questions.House Dust Mite Preparation and Intranasal AdministrationHDM preparationDilute lyophilized house dust mite extract from Stallergenes Greer (XPB70D3A25) with sterile PBS, to 50 µg Derp1 protein per 120 µL, for 4× stock concentration.Divide HDM stock into 120 µL aliquots in 1.5 mL Eppendorf tubes with locking caps, and store at -20°C.Thaw aliquots on day of planned use, and add 350 µL of sterile PBS to reach the final 470 μL working solution, which will be sufficient for 9 doses.Tips:  i) After stock is thawed and diluted, do not refreeze aliquot. Excess dust mite solution can be stored at 4°C and used for up to 48 h. ii) Because HDM lots vary in both Derp1 concentration and overall protein concentration, preparing sufficient HDM stock for the entire experiment from a single lot is recommended.",
    "HDM intranasal administrationAnesthetize animals with isoflurane inhalation (2.5% isoflurane nebulized in 2 L per minute 100% oxygen) in an anesthesia induction chamber.Tips:  i) Up to 5 animals can be anesthetized at a time. ii) Animals are sufficiently anesthetized when they no longer react when the induction chamber is gently tipped on its side, but maintain a near normal respiratory rate, approximately 45 s in isoflurane. Avoid heavy or prolonged anesthesia, as this will suppress breathing, and impair HDM inhalation. iii) Because this protocol involves daily anesthesia for a period of weeks, researchers may wish to include both the suggested “no HDM” controls (see step g, below, where an equal volume of sterile PBS is administered, following the same frequency and anesthesia regimen as in HDM-exposed animals) and additional “no anesthesia” controls (where animals are never anesthetized and receive neither PBS nor HDM). For all parameters we have assessed, including RVSP and artery remodeling, we have detected no differences between “no HDM” and “no anesthesia” controls, suggesting repeated anesthesia is not a factor in either of those processes. Draw up 50 µL of HDM working solution (5 µg Derp1 protein) in a 200 µL pipette fitted with a fresh disposable tip.Remove one mouse from the anesthesia chamber, scruff the loose fur behind its neck, and position the mouse with its nose up and its belly facing the researcher.Apply individual droplets (each approximately 10 µL in volume) of HDM working solution to the surface of one nostril allowing the sedated mouse to breath in each droplet prior to administration of next droplet, shown in Figure 3A-3B.",
    "Tip: Avoid applying large droplets or placing droplet centrally on the mouse’s nose (rather than over an individual right or left nostril) to prevent the solution draining into the mouth via the philtrum, as shown in Figure 3C. After 50 μL of HDM working solution has been administered, place the anesthetized mouse on its back in its home cage, and allow it to wake from anesthesia. Animals should be moving about the cage normally within 20-30 s.Repeat for all animals daily for 5 consecutive days, allowing a two-day break each week.Administer 50 µL of sterile PBS via 200 µL pipette with a disposable tip to “no HDM” control mice in the same manner, and following the same schedule as HDM animals.After all animals in a cage are awake and behaving normally, the cage is returned to the rack.Tip: Dose animals five days per week (for example, Monday through Friday) at approximately the same time each day for 2 to 8 weeks, depending on the stage of vascular remodeling desired (Figure 2B). It is important to allow for a two-day break (for example, Saturday and Sunday), as mice dosed for more than 5 consecutive days can develop outward signs of illness, most commonly a ruffled coat and lethargy. Animals dosed following a “5 days on, 2 days off” schedule, show no outward signs of illness, and behave normally. Throughout this protocol, a “week” of HDM exposure refers to this pattern of five days of daily exposure, followed by 2 days of no exposure, repeated for the indicated number of weeks. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4273/bioprotoc-12-01-4273-g003.jpgFigure 3. Intranasal administration of HDM extract dissolved in PBS. HDM solution droplets are placed on the nostrils of isoflurane-anesthetized mice (A-B). Avoid placing the droplets centrally on the nose (C) as solution may drain into the mouth via the philtrum.",
    "Staged Pharmacologic ModulationThe precise and reproducible timing of artery remodeling seen in this mouse model of PH permits staged pharmacologic modulation at discrete stages of arterial vascular remodeling: medial thickening (0-2 weeks HDM), neointimal establishment (2-4 weeks HDM), neointimal expansion (4-6 weeks HDM), and testing of neointimal regression (6-8 weeks HDM), as shown in the schematic in Figure 4. Though the precise experimental design of staged pharmacologic trials will depend on the drug in question, the mode of drug delivery, the drug pharmacokinetics, and which remodeling stages are to be examined in the experiment, the following general guidelines should assist in designing a trial.Administer daily (5 days on 2 days off) intranasal HDM (or PBS) throughout the period of drug or vehicle administration.Experimental animals: Dissolve desired drug in appropriate vehicle solution and dose at suitable intervals based on drug specific pharmacokinetics during the 2-week remodeling window for which the researchers are querying the effect of the drug.Control animals: Dose with vehicle alone following the same administration technique and schedule as experimental animals.Tip: Multiple modes of drug delivery can be used with this staged pharmacologic approach, and the optimal mode of drug delivery (intravenous injection, intraperitoneal injection, osmotic pump infusion, oral gavage, treated water) and the frequency of administration must be determined for each compound, ideally based on prior in vivo studies in mice. Harvest animals on day of completion of the two weeks drug/vehicle exposure window.Complete hemodynamic measurements, tissue collection, and vessel remodeling quantitation (detailed protocols below). This staged pharmacologic modulation allows quantitative comparison of remodeling parameters between drug-treated animals and vehicle controls.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4273/bioprotoc-12-01-4273-g004.jpgFigure 4. Staged drug treatment during discrete windows of pulmonary arterial remodeling allows quantitative comparison of drug effect on specific stages of artery remodeling. Specific molecules or pathways of interest can be modulated with administrable agents (e.g.",
    ", small molecule drugs, antibodies, viral vectors, tamoxifen or tetracycline to alter gene function) during each of the stages of artery remodeling defined in Figure 2, through appropriate timing of drug administration (“Treatment windows”). Comparing drug vs. vehicle treatment groups at each time point, using the quantitation methodology presented in Figure 2, allows identification of a drug’s effect on precise steps in the artery remodeling process.Hemodynamic Assessment of Pulmonary HypertensionImmediately prior to harvest, mice are evaluated for hemodynamic evidence of pulmonary hypertension through right heart catherization and measurement of right ventricular systolic pressure (RVSP), under isoflurane anesthesia following standard protocols (Ma et al., 2016). In the HDM model, significant increase in RVSP is noted after 2 weeks of HDM administration, and this elevation is maintained through 8 weeks of HDM administration (Steffes et al., 2020).Tissue Collection and HandlingPreparation for tissue collectionPlace a water bath near the dissection station and preheat it to 45°C.Melt prepared 2% LMP agarose solution in a microwave, swirling often until agarose particles are fully dissolved and the solution is clear.Tip: Be careful not to concentrate the solution by overboiling. Equilibrate 2% LMP agarose solution to 45°C in the water bath and hold there in preparation for lung inflation.Chill Heparin/NaCl solution on ice.Prepare 4% PFA solution, aliquot into 50 mL conical tubes (40 mL 4% PFA per tube), and chill on ice. 40 mL is needed per heart-lung block collected.Prepare collection tubes needed for any planned preparations not fixed with 4% PFA:Paraffin sections: Aliquot 10 mL of 10% neutral buffered formalin into 15 mL conical tubes and chill on ice. Per lobe collected, 10 mL is needed.RNA or protein collection: Sterile nuclease-free 1.5 mL tube, chilled on ice. One tube is needed per lobe collected.",
    "Follow an appropriate RNA or protein isolation protocol for whatever downstream experiments are planned.Cover Styrofoam dissection board with fresh aluminum foil and secure foil with lab tape.Assemble dissection tools and supplies in easy reach of dissection station: Stack of c-folded paper towels, 70% ethanol in spray bottle, sharp and blunt curved forceps, dissection scissors, butterfly needle attached to 50 mL syringe, blunt cannula attached to 5 mL syringe, suture thread, ice bucket with aliquoted fixatives, and a lab marker for labeling tubes.Dissection for visualization of heart, lungs, and tracheaFollowing hemodynamic assessment, euthanize animals by severing the descending aorta while still under isoflurane anesthesia.Tip: If hemodynamic measurement is not required, euthanize animals by carbon dioxide administration (or whatever approved method is preferred). Since inhaled anesthetics, 100% oxygen, and carbon dioxide alter vascular tone, for quantitative assessment of vessel remodeling parameters (detailed in “Vessel Remodeling Quantification”, below) all animals to be compared should be euthanized in the same manner. Place the euthanized mouse on several stacked paper towels on a dissecting board, ventral side up, with limbs extending laterally and secured with pins.Spray the ventral surface with a spray bottle filled with 70% ethanol to wet the fur and decrease shedding into the thoracic cavity during dissection.Lift the skin below the ribs with blunt serrated forceps and make a horizontal cut through the skin with dissection scissors, revealing the peritoneum.Make a vertical cut through the skin from the original incision to the sternum and pull the skin to the sides, to reveal the chest and anterior abdomen.Lift the peritoneum with blunt serrated forceps and again cut horizontally, allowing visualization of the abdominal organs.Lift the liver and bisect the hepatic artery and portal vein, to serve as outflow during lung perfusion.",
    "Grasp the xyphoid process, lift with forceps, and make a shallow incision with dissection scissors in the diaphragm (take care to avoid inadvertent laceration of the lungs). Allow the lungs to collapse with release of negative intrathoracic pressure.Cut the ventral rib cage approximately 0.5 cm lateral to the sternum on both sides, to allow full visualization of the heart and the lungs (Figure 5A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4273/bioprotoc-12-01-4273-g005.jpgFigure 5. Lung perfusion and inflation. Following hemodynamic assessment and euthanasia, the chest is opened to reveal the heart and lungs (A), and saline is slowly injected into the right ventricle (RV) of the heart (B) to remove blood from the pulmonary circulation. To inflate the lungs with LMP agarose, the skin of the ventral throat is dissected open to reveal the trachea. A small cut is made in the trachea, an LMP agarose-filled syringe fitted with a blunt cannula is inserted (C), and suture thread is tightened around the trachea and cannula to make a seal (blue arrowhead in C). Inflation is considered complete when the lobe tips are rigid (white arrowhead in C). D, Heart-lung block removed from the chest following perfusion and agarose inflation.Lung perfusionDraw up 20 mL of Heparin/NaCl solution into a 50 mL syringe, attach a 27-gauge butterfly needle, and flush air from tubing.Insert the needle into the right ventricle of the heart (Figure 5B) and perfuse at <100 μL per second, to wash blood from the pulmonary vascular bed for 2-3 min.Tip: In healthy animals, the lungs will turn completely white as blood cells are flushed from the pulmonary circulation; perfusion will be notably less effective in animals with remodeling in the pulmonary arteries. Lung inflationUsing blunt forceps and dissection scissors, make a vertical cut through the ventral skin of the neck, revealing the trachea.",
    "Cut a 4-inch piece of suture thread, lace under the trachea with sharp-tipped curved forceps at the level of the manubrium, and tie into a loose surgical knot (to be tightened later around the intra-tracheal cannula).Make a small incision in the ventral trachea above the level of the knot, just wide enough to allow for the insertion of the cannula.Tip: If RNA or protein are to be prepared from individual lobes (see “Tissue fixation and handling”, below, and Figure 6), ligate the primary bronchus leading to those lobes with suture thread prior to agarose inflation. Remove the bottle of 2% LMP agarose from the 45°C water bath, draw 3 mL of solution into a 5 mL syringe fitted with a 20-gauge blunt tip cannula.Tip: Work quickly so agarose does not have time to polymerize inside the cannula. Insert the cannula into the tracheal incision and advance down the trachea, until the cannula tip is approximately 3 mm above the level of the carina.Tips:  i) Confirm that the 2% LMP agarose solution is still liquid by squirting out a small amount from the tip of the cannula prior to inserting it in the trachea. Once the suture is tightened around the intra-tracheal cannula, replacing the cannula is difficult. ii) If LMP agarose solution routinely polymerizes before it can be used for inflation, 1) raise the temperature of the water bath very slightly (~2°C), or 2) squirt out a small volume from the filled cannula onto a paper towel every ~10 s, to eject cooled agarose from the cannula tip and replace it with warm agarose from the syringe chamber. Tighten the surgical knot, making a firm seal between the trachea and the cannula, and gently inject molten LMP agarose into the trachea to inflate the lungs (Figure 5C).",
    "Monitor lung inflation carefully, and stop when the distal tip of the accessory lobe is rigid (Figure 5C-5D).Tip: Take care not to over-inflate the lungs, which will damage parenchymal morphology. Remove the cannula and immediately tighten the tracheal ligature to prevent outflow of agarose.Tip: Cannulae can be reused several times if they are immediately flushed with sterile PBS or water, to remove residual LMP agarose. Wait until the LMP agarose has solidified, approximately 2-4 min, before continuing the dissection.Removal of heart-lung blockWith dissecting scissors cut and remove the ventral clavicle.Using blunt serrated forceps, grasp the esophagus just above the level of the liver, and pull gently upward, lifting the heart-lung block from the chest cavity.Clip and dissect away any adhesions binding the heart and lung tissue to the dorsal chest wall up to the level of the trachea.Cut the trachea above the ligature and rinse the heart-lung block briefly in cold PBS in a Petri dish on ice.Tissue fixation and handlingNote: Multiple tissue preparations can be prepared from the heart-lung block of each animal, if desired. A possible example of how a heart-lung block can be divided between multiple preparations is shown in Figure 6. In addition to reserving a lobe for recovery of bulk RNA or protein (see “Lung inflation”, above), it is practical to prepare paraffin sections, cryosections, vibratome sections, and dehydrate the remaining tissue in methanol for long term storage at -20°C. Both fresh and methanol-dehydrated hearts can be dissected to calculate the Fulton Index (Ma et al., 2016). We have never observed differences in the rate or extent of remodeling between different lung lobes within the same animal, and find that dividing the lung between multiple preparations allows more efficient use of precious animals.",
    "If paraffin sections are required, remove one lobe prior to fixation and immerse it in the prepared tube of 10% neutral buffered formalin for 48 h at RT. Then, transfer it to a biopsy tissue cassette, wash in 70% ethanol, paraffin embed, and section following standard protocols.Tip: This tissue is suitable for histological stains (H&E, Movat’s pentachrome, etc.), immunohistochemistry (Hofman and Taylor, 2013), or RNA in situ hybridization protocols, including RNAscope (Wang et al., 2012). Immerse all remaining portions of the heart-lung block in the prepared tube of ice cold 4% PFA and fix for 4 h with gentle shaking at 4°C.After PFA fixation, divide the lung into individual lobes for the desired staining preparations:Prepare lobes for cryosectioning by immersing them in 30% sucrose in PBS (10 mL per lobe in a 15 mL Falcon tube). Incubate overnight at 4°C with gentle shaking.Transfer lobes for vibratome sectioning into cold PBS, store at 4°C, and section within 24 h. Further information on whole mount staining and deep tissue imaging of vibratome sections can be found in Steffes et al. (2020) and Gillich et al. (2020).Dehydrate the remaining lobes, trachea, and heart through a methanol series (25%, 50%, and 75% methanol in diH2O, 30 min each), and transfer to 100% methanol for long term storage at -20°C in well-sealed 50 mL conical tubes. Lobes stored in methanol can be rehydrated and sectioned as needed, or stained as whole mount preparations (Metzger et al., 2008).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4273/bioprotoc-12-01-4273-g006.jpgFigure 6. Multiple tissue preparations can be prepared from the heart-lung block of a single animal. After perfusion, airways of individual lobes can be ligated prior to agarose inflation for RNA or protein extraction (Left lobe; ligation indicated with dotted line).",
    "Lobes intended for paraffin sections are removed after inflation and fixed with 10% neutral buffered formalin (Right caudal lobe). All other preparations (cryosections, vibratome sections, long term storage in methanol, etc.) are completed on tissue fixed with 4% paraformaldehyde and subsequently divided for individual treatments. Schematic illustrates one possible plan for dividing a heart-lung block between six different preparations. We have observed no difference in the degree of pulmonary arterial remodeling between different lobes of the lung from the same mouse.Cryosections and immunohistochemistry panel to highlight vessel compartments relevant for quantitationRemove lobes from sucrose, blot briefly on paper towels.Position lobes in OCT-filled cryomolds and cover lung completely with OCT.Freeze lungs in cryomolds on a bed of dry ice.Store blocks in air-tight bags at -80°C until ready to section.Cut 20 µm sections using a cryostat.Collect the sections on Superfrost+ glass microscope slides.Air dry for 10 min, and store in slide boxes at -80°C.To stain, thaw individual slides on the lab bench and allow condensation to fully evaporate.Draw boundary around sections with a hydrophobic pen.Remove OCT with two 5-min washes in PBST.Tip: We find that damage to sections is minimized by using a “pool and tip method” (Figure 7) for solution incubation and washing. Pool solution directly onto horizontal slides with a disposable transfer pipette (Figure 7A).Incubate at RT in a humid chamber (Figure 7C) on lab bench without coverslipping for the indicated length of time.Remove solutions by tipping the liquid off slide onto a dry paper towel without touching the slide surface (Figure 7B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4273/bioprotoc-12-01-4273-g007.jpgFigure 7. Pool and tip staining method minimizes damage to sections. A. Draw barrier around tissue sections with hydrophobic pen and gently pool solutions directly on horizontal slides without coverslipping. B. Remove solution after required incubation period by tipping onto a clean paper towel. C.",
    "A homemade humid chamber – made from a 241 × 241 × 20 mm square bioassay dish with 5 mL disposable pipettes cut to length as slide rests, water-saturated paper towel cut to size to keep the atmosphere moist, and covered with foil to protect from the light – holds up to 14 slides. Staining is effective even without large volume washes or agitating slides during washes, and section loss or damage is minimal.To block sections, pool ~300 µL of freshly made preblock solution for 30 min-4 h at RT in a humid chamberTip: Serum species should be adjusted to match the species in which the secondary antibodies have been raised. Remove preblock via tip method and apply the primary antibody solution diluted in preblock pooled on horizontal slide.Incubate overnight in a humid chamber at RT protected from light.Tip: A simple staining panel is shown in Table 1 that allows visualization of multiple relevant vessel compartments important during vascular remodeling and facilitates remodeling quantitation measurements (see Figure 2B). Wash slides with PBST three times for 5 min each, using the pool and tip method.Apply secondary antibody solution diluted in preblock pooled on horizontal slide.Incubate for 45 min at RT in a humid chamber protected from light.Wash slides with PBST three times for 5 min each using the pool and tip method.Coverslip with a firm-setting aqueous mounting medium (e.g., ProlongGold) and 60 mm coverslips.Tips:  i) Allow at least 2 h for the mounting medium to polymerize prior to imaging to avoid damaging the tissue sections. ii) Image slides within 48 h of coverslipping for optimal image quality. Table 1.Staining panel to highlight major vessel compartments and image remodeling. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20211228/20211228233957_7924.",
    "jpg Vessel Remodeling QuantificationBlind the researchers carrying out image collection and quantitation by having another lab member obscure the slide labels with opaque tape coded with random identifiers.Using a confocal microscope, scan lung sections at low magnification to identify arteries between 20 μm and 200 μm in diameter for further inspection.Tip: Cross-sectional views are preferred as they simplify quantitation. Longitudinal cuts can be quantitated, if necessary, but significant tissue thickness (or access to serial sections) is required to identify the true center plane of the artery.Increase magnification (to 25-40×) once an appropriate artery cross section is locatedCollect a high-resolution image containing the most comprehensive view of the medial smooth muscle layer, neointimal lesion and endothelial cells.Collect images of all arteries within the 20-200 μm size range found within each section without selection for degree of remodeling, position in the lobe, etc.Tip: Arteries can be distinguished from veins by both location and vessel anatomy (Figure 8):  i) Arteries are found with an accompanying airway, and contain both inner and outer elastic laminae, which will be marked by hydrazide (Figure 8A-8B). ii) Veins are located far from airways, and have a single elastic lamina (Figure 8A-8C). Using image analysis software (Zen Blue, Zen Black, or ImageJ) obtain two orthogonal sets of measurements for each vessel (Figure 2B). Measurements should include:External vessel diameter (outside margin of external elastic laminae).Media thickness (inside margin of external elastic lamina to outside margin of internal elastic lamina). There will be two media thickness measurements for each of the two orthogonal measurement axes. Media thickness is reported as an absolute measurement (μm).Neointima thickness (inside margin of internal elastic lamina to the edge of the endothelium). There will be two neointima thickness measurements for each of the two orthogonal measurement axes.",
    "Neointimal thickness can be reported as an absolute measurement, or a percentage of vessel diameter: sum the two neointima measurements for each measurement axis, divide by vessel diameter, and multiply by 100.Collect measurements from at least 50 arteries per mouse, to assure a broad survey of arteries, and allow for meaningful statistical analysis.Record measurements into a spreadsheet (GoogleSheets or Excel).Unblind the samples after measurements have been recorded from all samples, and add mouse number, drug treatment group, and length of HDM exposure for each measurement to the spreadsheet, to facilitate downstream statistical analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4273/bioprotoc-12-01-4273-g008.jpgFigure 8. Arteries and veins can be distinguished by location and elastin staining. A. Arteries run close to airways while veins are positioned far from airways. B. Arteries have both an internal and external elastic lamina, while veins (C) have only a single elastin layer. Elastin visualized with hydrazide staining (green); smooth muscle cells highlighted by SMA antibody staining (red); nuclei stained with DAPI (blue). Arrowheads, elastic laminae."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}