{
  "id": 17780,
  "origin_website": "Jove",
  "title": "Posterior Approach for Debridement of the Psoas Abscess",
  "procedures": [
    "The use of deceased human specimens, for the purposes of developing this method, has been approved by the WellStar Research Institute's institutional review board and conforms with the ethical guidelines established by the institution's ethics committee. The specimens used in this method were all formalin-fixed, transected at the T12 vertebral body, and had their abdominal organs and viscera removed.\n1. Preparation of the cadaveric specimen and surgical field\nPlace the previously thawed cadaveric specimen on the surgical table in the supine position and illuminate the field with surgical lights. Cover the specimen with a blanket, sparing the upper and lower abdomen.\n2. Isolation and identification of key anatomical structures using a ventral approach\nBeginning with a ventral approach, use a blade to make a midline incision, cranial to caudal, down to the hypogastric region and directly perpendicular to the anterior-superior iliac spines. Make a transverse cut between the ASIS and proceed to use a surgical blade and scissors to reflect and remove the abdominal musculature and fascia. This will improve visualization and aid in measurement accuracy.\nIdentify the transverse processes, lamina, pars interarticularis of lumbar vertebrae L1–L5, psoas muscles, and the nerve roots of the LP exiting the neuroforamina. Ensure that they are intact and undamaged (Figure 1). If any obvious damage to the hemivertebrae or transverse process is found, do not use the specimen.\nOnce all key anatomic structures are identified, carefully turn over the specimen to begin the dorsal approach.\n3. Further isolation of the transverse processes and obtaining digital photographs for analysis\nWith the specimen now in the prone position, use a surgical blade, scissors, cobb elevator, and other surgical tools to resect the latissimus dorsi and paraspinal muscles, starting sequentially from the posterior spinous process until reaching the transverse processes.",
    "Use the cobb elevator and other surgical tools to isolate the TPs from any remaining soft tissue attachments to aid in visualization and accurate measurements.\nWith the paraspinal muscles now removed, turn the specimen back to the supine position. Place a surgical ruler parallel to the surgical field and take digital photographs of the intact psoas muscle to demonstrate its relationship to the TP at each vertebral level.\nOnce all photographs are taken and deemed of good quality, use a surgical blade to strip the psoas muscle from its medial attachment at each lumbar body and perform a blunt dissection using blunt edged scissors or hemostats to carefully expose the entire lumbar plexus and reflect the psoas muscle laterally.\nWith the surgical ruler placed parallel to the surgical field, take additional photographs to capture the relationship of the lumbar plexus to the transverse process at each level.\nFinally, turn the specimen on its side and take additional photographs to demonstrate the relationship of the TP to the LP in the sagittal plane.\n4. Calibrating and taking measurements using ImageJ software\nIn the File tab in ImageJ (1.48v, National Institute of Health), select Open and, in the new window that appears, select the photograph to be analyzed.\nWith the desired image now open, use the \"magnifying glass\" tool to zoom in on the surgical ruler in the photograph. Use the line drawing tool to carefully draw a straight line between the margins of a 1-millimeter segment on the ruler.",
    "Within the Analyze tab in ImageJ, select Set scale…. In the Set Scale window, set the known distance to 1.00 and the unit of length to mm. Place a check in the box next to Global and click OK. Your measurements will now be calibrated according to the number of pixels per millimeter on the ruler.\n5. Calculating the \"safe zone\" for maximal I&D\nUsing the \"line drawing\" tool in ImageJ, draw a straight line between the lateral superior tip of each TP to the lateral edge of the psoas at the same level.\nOnce the lines are drawn, under the Analyze tab, select measure. A new Results window will open.\nThe measurements, in millimeters, will appear in the new window under the Length column in the order taken. Record these numbers.\nRepeat steps 5.1–5.3 to obtain the following measurements:\n\t-Lateral inferior tip of each TP to the lateral edge of the psoas muscle\n\t-Lateral superior tip of each TP to the most lateral region of the lumbar plexus at the same level\n\t-Lateral inferior tip of each TP to the most lateral region of the lumbar plexus at the same level\n\t-Width of the lumbar plexus\n\t-Depth of the lumbar plexus from the superior tip of each TP to the lumbar plexus at the same level using the lateral photographs\n\t-Depth of the lumbar plexus from the inferior tip of each TP at the same level using the lateral photographs\n6. Calculating the safe zone for maximal irrigation and debridement using the measurements obtained in Section 5",
    "The safe zone for lateral to medial debridement is defined by the distance from the lateral edge of the lumbar plexus to the lateral edge of the psoas at the same level. To calculate this distance, subtract the distance from the superior and inferior tips of the TP to the lumbar plexus from the distance of the superior and inferior tips of the TP to the lateral edge of the psoas muscle. These values will correspond to the safe zone for lateral to medial debridement, in the coronal plane, at each corresponding level.\nDefine the zone of maximal irrigation and debridement in the sagittal plane as the depth of the lumbar plexus, in relation to the TP, at the corresponding level.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}