{
  "id": 10885,
  "origin_website": "Jove",
  "title": "Engineered 3D Silk-collagen-based Model of Polarized Neural Tissue",
  "procedures": [
    "The brain tissue isolation protocol was approved by the Tufts University Institutional Animal Care and Use Committee and complies with the National Institutes of Health Guide for the Care and Use of Laboratory Animals (Institutional Animal Care and Use Committee B2011-45).\n1. Silk Scaffold Preparation\nPreparation of silk solution from Bombyx mori cocoons as described previously19,20.\n\t\nCut each cocoon into 8 equal pieces using scissors. Use about 11 cocoons for 5 g of fragmented cocoons. (15 min)\nPrepare 2 L of 0.02 M Na2CO3 solution and bring it to boil using a hot plate. (15 min)\nWeigh 5 g of fragmented cocoons and boil them in Na2CO3 solution for 30 min. Stir the boiling silk every couple of minutes with a spatula. This step, also called de-gumming, purifies silk fibroin from hydrophilic proteins, sericins. (30 min)\nWring the fibroin out by hand and rinse it in distilled water at least three times to wash out any remaining sericin and chemicals. (5 min)\nPlace the wet fibroin on a petri dish and dry the fibroin extract in the flow hood O/N.\nThe next day weigh the dry fibroin mass and place the fibroin in a glass beaker. (15 min)\nIn order to dissolve the fibroin in 9.3 M LiBr solution, calculate the required volume (in ml) of LiBr by multiplying the mass of dry fibroin by 4. Slowly pour LiBr solution over the silk fibroin and immerse all the fibroin fibers using spatula. Cover the beaker to prevent evaporation and place it at 60 °C for 4 hr to allow the fibers to dissolve. (15 min)\nUsing the syringe, collect the fibroin solution from the beaker and load it into the MWCO 3,500 dialysis cassettes. Perform dialysis against distilled water for 48 hr. Change the water every couple of hours.",
    "Using the syringe, collect the fibroin solution from the cassettes into 50 ml conical tubes and centrifuge twice at 9,000 rpm (~12,700 x g) at 4 °C for 20 min. Pour the supernatant into a fresh tube after each centrifugation step and discard the pellet. (40 min)\nMeasure the concentration of the fibroin by estimating the dry weight. Pour 1 ml of silk solution into a weigh boat. Dry the sample in the oven at 60 °C for 2 hr. Weigh the dry silk fibroin and calculate the concentration of silk fibroin solution by multiplying the obtained weight by 100. The expected concentration of silk solution is 6-9% (w/v).\nAdjust the silk concentration to 6% (w/v) by diluting it in distilled water.\n\t\tStopping point: The liquid silk fibroin can be stored at 4 °C for up to one month in a closed container.\nPreparation of porous scaffolds from silk solution.\n\t\nSieve the granular NaCl to separate the granules sized 500-600 µm, which will be used in later steps. Discard the granules sized below 500 µm and above 600 µm. (15 min)\nPour 30 ml of 6% silk solution into the polytetrafluoroethylene (PTFE) mold (Figure 1). Gently scatter 60 g of sieved NaCl over the silk. Tap the container to obtain a uniform layer of salt. Incubate 48 hr at RT to polymerize the silk.\nPlace the scaffold-containing PTFE mold in the oven at 60 °C for 1 hr to finalize the polymerization and evaporate any remaining liquid.",
    "Place the content of the PTFE mold in a beaker containing 2 L of distilled water for 48 hr to leach out the salt. Change the water 2-3 times per day. Remove the sponge scaffolds from the molds when the salt is completely leached out. Stopping point: The sponges can be stored immersed in water at 4 °C in a closed container to prevent the scaffolds from dehydration.\nWhen ready, cut out the scaffolds with 5 mm diameter biopsy punch. Pre-cut the scaffolds to reach about 2 mm in height. Punch out the center of the scaffold with the 2 mm diameter biopsy punch (Figure 2A). (1 hr)\nAutoclave the scaffolds immersed in water to sterilize them (wet cycle, 121 °C, 20 min). Stopping point: The sponges can be stored immersed in water at 4 °C in a closed container to prevent the scaffolds from dehydration.\nBefore the planned cell seeding, immerse the scaffolds in sterile 0.1 mg/ml poly-D-lysine (PDL) solution. Incubate for 1 hr at 37 °C.\nWash the scaffolds 3x with phosphate buffered saline (PBS) to remove non-bound PDL. (30 min)\n2. Isolation of Rat Cortical Neurons\nDissect cortices from embryonic day 18 (E18) Sprague-Dawley rats as previously described by Pacifici and Peruzzi27after approved animal protocol is obtained. (2 hr)\nIncubate 10 cortices in 5 ml of 0.25% trypsin with 0.3% DNase I (from bovine pancreas) for 20 min at 37 °C.\nInactivate the trypsin by adding equal volume of 1 mg/ml soybean protein.\nTriturate the cortices using 10 ml Pasteur pipette by pipetting up and down 20 times until a single cell suspension is generated. Be gentle and avoid air bubble formation. (10 min)\nCentrifuge the cell suspension at 127 x g for 5 min.",
    "Re-suspend the cell pellet in 10 ml of culture medium (Neurobasal medium, 1x B27 supplement, 1x Glutamax, 1% penicillin/streptomycin). Count the cells. The expected cell concentration is about 2x107/ml. (20 min)\n3. Construct Assembly and Culture\nScaffold seeding with cells.\n\t\nMove the sterile scaffolds and all the required utensils inside a cell culture hood. Using sterile forceps place the scaffolds in a 96-well cell culture plate allocating one scaffold per well. (10 min)\nImmerse the scaffolds in cell culture medium to equilibrate them prior to cell seeding. Incubate for 1 hr at 37 °C. (10 min)\nAspirate the excess of the medium from the scaffolds.\nApply 100 µl of cell suspension/scaffold. (10 min)\nIncubate the cells at 37 °C O/N to allow for cell attachment to the scaffold.\nThe following morning aspirate the non-attached cells and apply 200 µl/well of fresh culture medium. (10 min)\nScaffold embedding with collagen matrix. (2 hr)\n\t\nPlace 10x PBS, water, 1 N NaOH and rat tail I collagen on ice. Prepare a working solution of collagen as per the manufacturer instructions. Maintain on ice until the cell-seeded constructs are ready (up to 1 hr).\nRemove the cell-seeded silk constructs from the incubator and aspirate the excess of medium.\nUsing sterile forceps transfer the scaffolds to the empty wells on the well plate and immerse each scaffold in 100 µl of 3 mg/ml collagen solution. Place the tissue culture plate back in the incubator for 30 min to allow polymerization of collagen.\nApply 100 µl of pre-warmed cell culture medium/well. Culture the constructs for one week changing the medium every day by replacing only half the volume of the medium.\n4. Microscopy Analysis\nLive/dead staining (1 hr)\n\t\nPrepare stock solution of propidium iodide (PI) 1 mg/ml (1.5 mM) in distilled water.",
    "Prepare stock solution of fluorescein diacetate (FDA) 2 mg/ml in acetone.\nPrepare working solution containing 10 µM PI and 0.15 µM FDA diluted in PBS. Pre-warm the solution to 37 °C in a water bath.\nWash the cells with pre-warmed PBS to remove the serum esterases. Aspirate the PBS.\nApply the pre-warmed working solution on the cells for 2 min and wash it with PBS.\nUse epifluorescent microscope to image the cells (PI ex λ=490 nm, em λ=570 nm; FDA ex λ=490 nm, em λ=514 nm). The stain remains stable over 40 min. Prolonged staining may result in unspecific staining resulting from PI uptake by the cells and co-localization of PI/FDA in cells.\nImmunostaining\n\t\nAt the desired time point of culture fix the cells with 4% paraformaldehyde (PFA) for 30 min at RT. Due to the toxicity of the PFA fumes the fixing step should be performed in the chemical fume hood.\nWash scaffolds with 3x PBS. Stopping point: The PFA-fixed constructs can be stored in PBS at 4 °C for several days before proceeding with further steps.\nIncubate the scaffolds in 0.2% Triton, 0.25% bovine serum albumin (BSA) in PBS containing primary antibody O/N at 4 °C.\nThe following day discard the staining solution and wash the scaffolds 3 x 30 min with PBS to remove the unbound primary antibody.\nIncubate the samples with secondary antibody diluted in 0.2% Triton, 0.25% BSA in PBS for 2 hr at RT.\nRemove the staining solution and wash the scaffolds 3 x 30 min with PBS to remove the unbound secondary antibody.\nImage the scaffolds using a confocal microscope with 20X objective by taking 100 µm z-sections of the sample with 1 µm step. To visualize the thin neurites the image resolution should be of minimum 1,024 x 1,024 pixels.",
    "RNA, DNA and protein isolation\n\tNote: RNA, DNA and protein isolation is performed using a commercial AllPrep DNA/RNA/Protein Mini Kit according to the manufacturer instructions.\n\t\nUsing sterile forceps transfer the scaffolds out of culture plate to a 2 ml sterile tube. Place one scaffold per tube.\nAdd 200 µl of RLT buffer to each tube.\nDisrupt the construct by fragmenting it with sterile microscissors.\nTo homogenize the disrupted tissue, transfer the content of the tube to the spin column. Spin for 2 min at full speed in a microcentrifuge. The lysate is homogenized as it passes through the spin column.\nCollect the flow through and use it immediately to isolate RNA, DNA and protein following the manufacturer protocol.\nQuantify the yield of the nucleic acids any other compatible method (e.g., NanoDrop).\nQuantify the protein yield using BCA Protein Assay according to the manufacturer instructions. Measure the outcome of assay using microplate reader at wavelength 562 nm.\n\t\tNote: The expected yield of nucleic acids and protein per construct in relation to the cell density is shown in Figure 4."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}