{
  "id": 17611,
  "origin_website": "Jove",
  "title": "Preparation of Decellularized Kidney Scaffolds in Rats",
  "procedures": [
    "This study was approved by the administration of Pusan National University of Medicine and was conducted in accordance with ethical guidelines for the use and care of animals. (certificate no. 2017-119). Prior to any animal studies, institutional approval should be obtained.\nNOTE: All surgical and anesthetic instruments/equipment and reagents recommended for successful surgical presentation and imaging of abdominal organs are detailed in Table 1.\n1. Preparation procedures for harvesting of rat kidneys\nIn preparation for surgery, place 8-week-old Sprague-Dawley rats (weighing 200–250 g) on a warming pad. Place a rectal thermometer probe in the rectum to monitor core temperature.\nAnesthetize the rat with a 5% mixture of isoflurane gas (induction: 5%, maintenance: 3%).\nTo start the operation, place the rat in a supine position after administration of anesthesia. Mount the four limbs of the rat on the operation table with tape.\nShave and clean the abdomen of the donor rat with germicidal soap. Apply 2% betadine for at least 1–2 min, and wipe with a 70% ethanol solution. Repeat this sequence three times.\nCover the operative field with a sterile fenestrated drape.\nMake a vertical abdominal incision and expose the left kidney, ureter, abdominal aorta, and inferior vena cava.\nVisualize and dissect the left kidney, ureter, abdominal aorta, and inferior vena cava just before cutting the pedicle.\n2. Transcardial perfusion\nBefore surgery, prepare the perfusion solution.\n\t\nMake 50 mL of perfusion solution per rat.\nMix 1x PBS with approximately 10 U/mL heparin (1 25 kU vial will make 2.5 L of PBS+Hep).\nMix equal volumes of 8% paraformaldehyde with 1x PBS to make the 4% PFA/1xPBS solution.",
    "NOTE: 8% PFA made in water can be stored at 4 °C for up to 2 months. However, 4% PFA diluted in PBS is only stable for 1 week at 4 °C. Make the dilution fresh.\nExtend the vertical abdominal incision cranially. Be sure to draw the scissors away from the organs when cutting to avoid damaging the internal organs.\nContinue the incision through the rib cage, and then cut through the diaphragm by lifting the sternum.\nPin the loose flap of skin out of the way, and free the heart by tearing any connective tissue with the forceps.\n\tCAUTION: Do not use the scissors to free the heart and this could result in unwanted bleeding.\nOpen the phosphate-buffered saline (PBS) line and ensure that the line is flowing before placing the needle into the left ventricle. Hold the heart gently with blunt forceps, and use a hemostat to control the needle. The needle should be inserted no more than 1/4 inch.\n\tNOTE: Insertion greater than 1/4 inch may result in perforation to the other side of the tissue.\nWhile supporting the heart with the needle and hemostat, locate the right atrium and snip through it with iridectomy scissors. Rest the hemostat on the rat’s body, and make sure the needle is still positioned inside the heart.\n\tNOTE: If the cut is sufficient, there should be blood in the body cavity as the pressure from the PBS flowing into the rat is relieved.\nCarefully unpin the front feet and skin flap.\nContinue perfusing PBS for 4 min or longer if there is still blood visible in the kidney and liver.\n3. Kidney harvesting and decellularization\nHarvest the left kidney with the abdominal aorta and inferior vena cava.",
    "Ligate the ureter, thoracic aorta, superior vena cava, and branches of the abdominal aorta.\nKeep the organ hydrated in Dulbecco’s PBS (DPBS) in a 10 cm Petri dish.\nCannulate the abdominal aorta and inferior vena cava with a 23 Gauge catheter. To remove residual blood, connect the cannula with a peristaltic pump, and wash with DPBS (500 mL) and 16 U/mL heparin for 90 min at a rate of 5 rpm at 37 °C.\nTo decellularize the kidney, perfuse the kidney with 1% Triton X-100 (1 L) for 3 h and then with 0.75% sodium dodecyl sulfate (SDS) solution (2 L) for 6 h at a constant pressure of 40 mmHg.\n\tNOTE: The kidney will become transparent after 8 h.\nTo remove residual SDS, perfuse the sample with 1% penicillin in distilled water (6 L) for 18 h (overnight) and then with sterile DPBS (500 mL) and 16 U/mL heparin for 90 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}