{
  "id": 7006,
  "origin_website": "Bio",
  "title": "Understanding Docking Complexes of Macromolecules Using HADDOCK: The Synergy between Experimental Data and Computations",
  "procedures": [
    "Submitting a HADDOCK calculation:HADDOCK calculation can be launched from the web-sever available at: https://haddock.science.uu.nl/services/HADDOCK2.2[href=https://haddock.science.uu.nl/services/HADDOCK2.2].Note: In the representative case described in this protocol, the “Guru interface” is used to run HADDOCK since it allows to specify/modify more parameters to fine tune the docking settings. Access to this interface does require “guru” level, which can be requested by users in their own registration page. Fill in the HADDOCK input page (Figure 2):Provide a name for the job.Provide the input data, i.e., the 3D coordinates and the lists of the active and passive residues as a comma-separated list of residue numbers for each components of the complex.It is possible also to personalize the docking run by modifying several default parameters, if needed:Histidine protonation state for each component.Semi-Flexible and Fully Flexible segments.Additional restraints such as, for example, distance restraints, dihedral and hydrogen bonds restraints, noncrystallographic symmetry restraints, residual dipolar coupling.Sampling parameters.Parameters for clustering.Energy and interaction parameters.Scoring parameters.Advanced sampling parameters.Solvated docking parameters.Analysis parameters.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201014/20201014111748_4753.jpgFigure 2. Example view of an input page of the HADDOCK2.2 web-serverNote: A detailed description of the various parameters of the HADDOCK scoring function and of the details about the HADDOCK molecular docking process can be found in the online manual here[href=http://www.bonvinlab.org/software/haddock2.2/manual]. By default, HADDOCK generates 1,000 models in the initial rigid body docking. This parameter can be changed by unfolding the tab named “Sampling parameters” (Figure 3).Note: In the specific case of CNBD-TRIP8bnano complex the number of structures is increased by a factor of five. The default number of structures further subjected to the semi-flexible simulated annealing (it1) and final refinement in water (itw) is 200.Note: In the specific case of CNBD-TRIP8bnano complex this parameter is increased by a factor of two (Figure 3, “Sampling parameters” tab). The final water-refined models are clustered and ranked based on HADDOCK score value.",
    "Clustering is performed based on pairwise Root Mean Square Deviations (RMSD, the default value is set to a 7.5Å cutoff) and a minimum number of members to define a cluster (default value is set to four) (Figure 3, “Parameter for clustering” tab). The clusters are then ranked based on the average HADDOCK score of their top four members. The RMSD cut-off value is crucial for a proper clustering of the structures and different clustering cutoffs might be tried.Note: In the specific case of the CNBD-TRIP8bnano complex the RMSD cut-off was kept to the default value.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201014/20201014111730_8048.jpgFigure 3. The sampling parameters and the parameters for clustering can be changed by the user in the Guru Interface levelIt is recommended to set the “Advanced sampling parameters” (Figure 4) according to the specific protein-peptide docking calculation following the settings reported in Trellet et al., 2013.Note: In the representative case described in this protocol, we have quadrupled the default number of molecular dynamics integrations steps for the rigid body dynamics at high temperature and the subsequent cooling stages with flexibility at the interface (from 500/500/1,000/1,000 to 2,000/2,000/4,000/4,000) (Figure 4, “Advanced sampling parameters” tab). The decision to increase the values is based on the fact that for one of the two component of the complex, TRIP8bnano, the number of the active residues was significantly limited (4 residues out of 40 forming TRIP8bnano). This can affect the sampling of the conformational space during the rigid body docking calculation phase. Furthermore, because CNBD contains a disordered C-terminal tail, which is necessary for the binding (Saponaro et al., 2014), the number of MD steps is also increased to allow the protein to adapt its conformation during the flexible refinement stage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201014/20201014111715_6460.jpgFigure 4. Advanced sampling parameters used for CNBD-TRIP8bnano complexProvide both username and password to submit a job."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}