{
  "id": 17648,
  "origin_website": "Jove",
  "title": "Avoiding Ischemia Reperfusion Injury in Liver Transplantation",
  "procedures": [
    "This protocol was reviewed and approved by the ethics committee of The First Affiliated Hospital of Sun Yat-sen University, Guangzhou, China. Informed consent was obtained from all the participants. All the procedures in studies involving human participants were performed in accordance with the 1964 Helsinki Declaration and its later amendments or revisions.\n1. Preparation of the perfusion solution and device\nNOTE: The total volume of the perfusion solution prepared for NMP according to this protocol is approximately 3,000 mL, as reported previously1, and the final hemoglobin concentration is 6–10 g/L. The components of the perfusion solution are listed in Table 1.\nAdd the components of the perfusate to the organ reservoir of artificial hepatic assist device (Table of Materials) through the connector at the top of the oxygenator and remove all bubbles from the pipeline.\nTurn on the venous pump according to the manufacturer’s instructions, which is displayed on the screen. Turn on the arterial pump in a similar manner. Null the pressure according to the instructions on the device screen. Click on the Pressure button to set the HA pressure within the range of 50–60 mmHg and PV pressure within the range of 5–10 mmHg during the whole process of normal temperature mechanical perfusion.\nStart oxygenation using a mixture of O2 and air (30% O2) at a combined flow rate of 400 mL/min. Warm the perfusion solution to 37 °C.\nObtain a sample of perfusate solution from the T-branch pipe of arterial perfusion line for microbial culture (8 mL), blood gas analysis (0.5 mL) and liver function test (3 mL) after the device has been primed (pO2, pCO2, pH and electrolyte within normal range, and temperature near 37 °C), and monitor the biochemical parameters accordingly.",
    "NOTE: The perfusate should be prepared fresh before use in a laminar flow operating room. Bicarbonate or insulin is added, if necessary.\n2. Ischemia-free procurement of donor liver\nConduct the abdominal cruciate incision as follows: vertical, from the sternal notch to the symphysis pubis, and transverse, laterally to both flanks at the level of umbilicus. When procurement of the lung or heart is needed, a sternotomy can be utilized. Use a large C-shaped retractor to provide exposure.\nPerform a detailed inspection of the abdominal viscera. Take a liver biopsy specimen for histological observation and clinical research. Mobilize the liver with a precision technique.\nPlace a cannula in the common bile duct for bile drainage and ligate the cystic duct. Cut a full-circumference tissue sample (width: 3–5 mm) from the end of the common bile duct for histological observation and clinical research.\nDissect the celiac artery (CA), gastroduodenal artery (GDA), splenic artery (SA), inferior vena cava (IVC), and PV. Insert an 8 Fr/12 Fr arterial cannula into the GDA or SA. Ensure that there is no interruption of the arterial supply for the liver from the CA. \nHarvest a 3 cm-long right external iliac vein and anastomose the vessel to the PV in end-to-side fashion with partial blockage of the PV for making an interposition vein.",
    "Place a 32–34 Fr caval cannula in the infrahepatic inferior vena cava (IHIVC) for outflow to the organ reservoir of the device. Connect a straight 24 Fr cannula to the PV perfusion line of the device and then, via the interposition vein, completely insert into the PV. Block the suprahepatic inferior vena cava (SHIVC) thereby blocking the venous drainage to the right atrium. Connect the arterial cannula to the HA perfusion line of the Liver Assist device. Then, start NMP, and establish the circuit in situ.\nHarvest the liver and transfer to the organ reservoir under continuous NMP. Immediately after the liver is removed from the abdominal cavity, cold-flush the kidneys via the preplaced cannula within the abdominal aorta and procure the kidneys in the conventional manner.\n\tNOTE: In the process of procurement, fully isolate the common hepatic artery (CHA), ligate the left gastric artery (LGA), and isolate the CA to the abdominal aorta. In the case of the accessory HA, bypass the artery in situ before NMP starts.\n3. Ischemia-free preservation of the donor liver\nTransfer the liver to the perfusion device. Remove the caval cannula immediately when the liver is moved to the organ reservoir. Continuous ex situ NMP the liver graft until allograft revascularization. \nSet the PV perfusion pressure at 6–10 mmHg with a targeted flow rate higher than 500 mL/min. Set the HA pressure at 50–60 mmHg with a targeted flow rate higher than 150 mL/min. During the NMP, ensure that the perfusion parameters are stable, and monitor the pressure and flow rate within an appropriate range.\nRemove redundant tissues from the liver and blood vessels. Transiently block the overall IVC to examine SHIVC and IHIVC for leaks. Cover any dry surfaces with wet sterile gauze to prevent dehydration.",
    "Collect the bile tubing into a 15 mL collection container. Place the opening of the bile drain below the liver to allow bile to run out freely. Record the amount of bile production, and monitor the biochemical parameters every 30 min.\nObtain a perfusion sample (0.5 mL) for blood gas analysis every 10–20 min, liver function tests (3 mL) every 30 min and monitor the biochemical parameters accordingly.\nAssess the viability of the liver by blood gas analysis and liver function tests of the perfusate, as well as bile biochemical parameters as previously reported2.\n\tNOTE: For patient safety, confirm the graft viability during NMP before initiation of the recipient surgical procedures. Add 1 mL of papaverine to reduce vascular resistance, if necessary.\n4. Ischemia-free implantation of the donor liver\nResect the recipient’s diseased liver using a conventional technique. Recannulate the donor IHIVC a 32–34 Fr caval cannula, remove the diseased liver and block the SHIVC with a clamp. Then, move the donor liver from the reservoir to the recipient’s abdominal cavity so that an NMP circuit in situ can be re-established.\nSuture the donor SHIVC to the recipient counterparts using 3–0 non absorbable polypropylene sutures with a bi-caval or piggy-back technique.\nSuture the donor PV and HA to the recipient’s counterparts in an end-to-end fashion using 5–0 and 7–0 non absorbable polypropylene sutures, respectively. Perform these anastomoses under continuous NMP of the allograft as both HA and PV contains branches both native and artificial in nature.",
    "Collect the liver biopsy specimen before reperfusion. Afterward, release the clamps on the PV and HA in order to re-establish the native dual blood supply for the liver. At the same time, cease the NMP after removal of the HA and PV cannula. Then, flush out approximately 200 mL perfusate within the liver form IHIVC cannula. Block IHIVC cannula and release of the clamp on the SHIVC. The anhepatic phase is over. Obtain a perfusate sample (8 mL) for microbial culture again.\nRemove of the cannulas in the SA or GDA, and interposition vein. Ligate the donor SA or GDA and interposition vein. Withdraw the cannula in the IHIVC and anastomose the donor’s IHIVC to the recipient IHIVC (bi-caval) or ligate it (piggy-back) according to the surgical procedure. Collect the common bile duct specimen again after withdrawal of the bile drainage cannula.  Anastomose the donor’s common bile duct to the recipient’s common bile duct with end-to-end fashion after withdrawal of the draining tube.\nCollect liver biopsy specimen again after meticulous hemostasis. Close the abdominal wall in the routine procedure.\n\tNOTE: During the implantation process, monitor the portal and arterial cannula closely to avoid twisting or bending, and scrutinize the flow rate parameters in real time to ensure the blood supply of the HA and PV. Increase the perfusion pressure slightly when necessary to ensure that the flow rate is sufficient to the liver. During the anastomosis of the SHIVC, PV, or IHIVC, shorten the venous stump as much as possible to avoid postsurgical obstruction of the venous flow.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}