{
  "id": 9211,
  "origin_website": "Jove",
  "title": "Closed-loop Neuro-robotic Experiments to Test Computational Properties of Neuronal Networks",
  "procedures": [
    "1. Preparation of Neuronal Culture over a MEA\nPlate neuronal cultures on MEA chips, as described 29. The description of a similar procedure is also provided 9 and in the Discussion section.\nTurn the MEA heating system on 5-10 min before starting the recording to minimize the thermal stress experienced by the cells: set temperature target of the temperature controller to 37 °C and switch on the heating plate below the MEA itself (provided in most commercial MEA systems) and, if available, a heated cover in order to significantly reduce evaporation.\nSterilize gas-permeable caps before each use in an autoclave with humid-heat (30 min, 130 °C). To avoid evaporation and prevent changes in osmolarity, keep the cultures covered with caps during recording.\nPlace the neuronal culture in the amplifier 30 min before actually starting the recording.\n\tNOTE: Simply moving the cultures from the incubator to the amplifier will significantly disrupt spontaneous activity for about half an hour. During this time, culture medium temperature will stabilize.\nIf a carbair circuit is available, start circulation of carbair (a mixture of 5% CO2 and 95% O2 + N2) for experiments longer than a couple of hours: cultures will require it in order to maintain both oxygen and pH levels stable.\n2. Selection of Recording Parameters for MEA Acquisition\nSelect software filter bandwidth to detect spikes (i.e., Multi-Unit Activity – MUA) 30: in the RawDataDisplay form mark the ‘300 Hz-3 kHz’ checkbox .\nStart the acquisition of data: press the ‘Start’ button in the RawDataDisplay form.\nSet Threshold Gain for spike detection in the RawDataDisplay to 7.\n\tNOTE: Depending on the desired specificity/selectivity tradeoff and on the adopted detection algorithm, this threshold can be set between 6 and 10 times the computed standard deviation .",
    "Set Threshold Memory to 2 sec and press the ‘Lock’ button when no spiking activity is visible on the display (both commands are in the RawDataDisplay form). Mark the ‘Estimate SD from median’ to compute noise standard deviation from the median of the absolute value of the observed signal 31,32, if it is difficult to provide even short time windows without spiking activity. Remove the checkmark from this option after pressing the ‘Lock’ button, as the underlying algorithm is computationally intensive and might cause the PC to lag.\nTurn on spike detection routine (‘Spike Detection’ checkbox in the RawDataDisplay form). If spike detection is already running (i.e., the checkbox is already marked), discard spikes detected up to this moment by clicking the ‘Reset’ button in the Data Recording form.\n3. Selection of MEA Electrodes to Stimulate the Neuronal Culture and Response Map Computation\nRecord spontaneous activity of the neuronal cells cultured over the MEA for 30 min: save data to file by clicking the ‘Record’ button, in the ‘Spikes’ box of the DataRecording form, after the desired amount of time has elapsed (30 min, in this case).\nIdentify the 10 most active channels (i.e., 10 channels with highest spike count), then select those channels in any of the MEA layouts (either in the Coding, Decoding or Connection Map forms) by dragging the mouse cursor over the desired areas. Once the channels are selected, right click anywhere on the MEA layout and select ‘Add to left sensory area’ in the pop-up menu: these electrodes will be used to deliver electrical stimulation in step 3.5.",
    "Verify that stimulator and MEA amplifier are correctly connected: all configurations require two wires per desired stimulation channel, while an extra coaxial cable will be required to carry the synchrony signal (please refer to the manuals of the specifics instruments for connection diagrams). Proceed then to turn the stimulator on.\nDefine stimulus parameters in the Connection Map form. All the stimulations delivered to the culture are biphasic square voltage waves. Set half-duration to 300 µsec and amplitude to 1.5 Vpp33 .\n\tNOTE: Stimuli large enough to reliably evoke neural responses will very likely compromise the recording of activity from the same sites. In the rest of the paper, electrodes used for stimulation delivery should not be selected for recording any relevant information.\nRecord response to stimulation: press the Start button in the ConnectionMap form. A series of 30 stimuli, with an interval of 5 sec is, in turn, automatically delivered from each one of the selected electrodes, while responses are recorded from the remaining 59 electrodes.\nCompute a connection map (i.e., the probability of observing a response from an electrode within a time slot after delivery of stimulus from a different electrode) for each stimulating channel through any math software or SpyCode, an application developed in the past (and freely available upon request) to perform computations on neural data 28.\nFrom the connection maps, select best electrodes: discard all stimulating electrodes that did not evoke responses (i.e. in the time window following stimulation, firing rates are not significantly higher than during spontaneous firing).",
    "Select, among the remaining electrodes, the pair with the least overleap in responses. Specifically for each stimulating electrode, compute the average spike count in each recording electrode, then compute the difference between corresponding electrodes for all stimulating electrodes pairs. Select the couple for which the sum of absolute values of response differences over all recording channels is highest.\nSelect one of these electrodes to code sensory information from the left side of the robot and the other to code readings from the right side: in order to do this, drag the mouse cursor over one electrode, right-click on the MEA layout then select ‘Add to left sensory area’ (or ‘Add to right sensory area’).\n4. Interfacing the Neuronal Culture with the Robot: Selection of Coding and Decoding Schemes\nSet ‘Coding Type’ in the Coding form to Linear.\nDefine minimum and maximum stimulation rates in the Coding form. Use the default range of 0.5-2 Hz.\nSet the ‘Jitter’ parameter in the Coding form to 0.\nSet the decoding algorithm parameters in the Decoding Form (weight and extinction coefficient) to 1, for a moderately active culture (~1 spike/sec per channel). Define a new parameter pair if firing rates strongly and constantly deviate from this value. See discussion for the exact function of decoding parameters.\nSet the decoding algorithm burst parameters in the Decoding Form. Set weight to 0 (decay time is then irrelevant), unless distinction between spikes and bursts is the subject of study.",
    "NOTE: The values suggested in step 4.4 will produce smooth robot movements and speeds compatible with robot reaction times for moderately active rat primary cultures. The burst parameters have exactly the same function as those described in the step 4.4, but the triggering event is the detection of a burst instead of a spike: the actual speed of each wheel is simply the sum of the contributions of detected spikes and bursts.\n5. Design of Navigation Arena for the Robot\nIn the Virtual Arena Designer form, choose between bounded (the boundaries of the arena are visible to the robot and impassable) or boundless (if the robot exits from one side of the arena, it will instantly re-enter from the opposite one) arena and set the arena size in pixels.\n\t\nDo not use bounded arenas smaller than 100 x 100 pixels, in order to allow significant movement. Do not use obstacles with a radius smaller than 5 pixels as they can simply fall between the lines of sight of the robot.\nKeep in mind that very large arena sizes might cause computer performance to degrade: if a large arena is required, test software performance with the desired arena before starting hard-to-repeat experiments.\nSet robot starting position either manually (click the ‘Manual Selection’ button in the Virtual Arena Designer form, then the desired location) or by specifying the coordinates of the robot at experiment start in the ‘Robot Starting Position’ fields.\nAdd any number of impassable obstacles within the arena. Either place them manually in the arena after clicking the ‘Add Obstacle Manually’ button or set number and size range.\nClick the ‘Generate Arena’ button to generate the arena with the selected features. No changes will occur until this button is pressed.",
    "Save the designed arena and load the relative file, before use in an experiment, with the command buttons in the lower part of the Virtual Arena Designer form.\n6. Selection of MEA Electrodes to Record Neuronal Activity from the Culture\nSelect as temporary recording electrodes those on which different responses, in step 3.8, have been observed: electrodes that showed larger responses following stimulation from the ‘left’ (or ‘right’) electrode will constitute the ‘left’ (or ‘right’) recording electrodes. Do not use electrodes that did not show significant responses to either stimulating electrode to control the robot. From the MEA layout pop-up menu, select ‘Add to left motor area’ (or ‘Add to right motor area’) to define recording electrodes.\nSelect features to record in the Experiment Manager form. At this stage, spikes and stimulation time stamps are the only relevant information.\nPerform a 10 min test drive: start the robot run by clicking the Start Experiment button in the Experiment Manager form, click it again after 10 min have elapsed.\n\tNOTE: Once all the parameters have been set (coding and decoding, robot arena, stimulating and recording electrodes, features to record), a file name selection will ask for recorded files name and destination, then the robot will start moving in its arena, following the defined rules. All the selected features are automatically saved in real time.\nRepeat steps 3.6 and 6.1 on data acquired in step 6.3, in order to select recording electrodes from data collected during an actual robot run (see Discussion for the rationale of this two-step approach).\n7. Performing a Neuro-robotic Experiment\nSelect in the Experiment Manager form the data to be recorded: mark the Spike, Robot and Stimuli Data checkboxes.",
    "Launch a pre-learning robot run: click the ‘Start Experiment’ button in the Experiment Manager form. Select new file names for data files when prompted. When 30 minutes have elapsed, click the ‘Start Experiment’ button again to stop the robot run.\nSwitch on the learning protocol (mark the ‘Deliver Tetanic Stimulation After Hit’ check box in the Experiment Manager form) and perform the training robot run, of the same length as the pre-training phase (i.e., 30 min). Remember to input different file names when prompted to avoid overwriting data from step 7.2.\nSwitch off the learning protocol again (unmark the ‘Deliver Tetanic Stimulation After Hit’ check box) and perform the post-learning robot run. Once again, remember to change file names to prevent overwriting.\n8. Second Response Map Computation\nRepeat steps 3.1-3.6. Use data from these recordings to test if any changes have been induced either in the spontaneous or evoked activity patterns by the learning protocol."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}