{
  "id": 18598,
  "origin_website": "Jove",
  "title": "Encapsulation Thermogenic Preadipocytes for Transplantation into Adipose Tissue Depots",
  "procedures": [
    "The study protocol was approved by The Ohio State University Ethics Committees. Animal experiments were approved by IACUC protocol. All procedures were performed under the level 2 biosafety cabinet with laminar flow. We followed all standard safety requirements and procedures. The microencapsulation technique for preparation of microcapsules has been performed as described17,18.\n1. Preparations of Materials\nPrepare 10 ml of 2% sodium alginate solution in autoclaved physiological saline (0.9% NaCl in water). Prepare 0.05% PLL solution in physiological saline. Prepare these solutions the day before and stir overnight. Filter the solutions with 0.22 μm filter before use.\nPrepare 50 mM sodium citrate and 100 mM CaCl2 in 0.9% NaCl solutions and autoclave them.\nAutoclave all solutions, needles, electrodes, and beakers. Thoroughly clean needles with wires to avoid clogging.\nDetermine the appropriate amount of cells to use for the capsules (102 microcapsules are needed for every cm2 of well and there are approximately 500 cells per capsule18). Use 1 ml of sodium alginate per two million cells.\nPrepare a ‘Fibroblast Growth Medium’ containing 10% calf serum, and 100 U/ml penicillin/streptomycin in a high glucose (4,500 mg/l glucose) Dulbecco's Modified Eagle's medium (DMEM).\n\t\nPrepare a ‘Differentiation Medium I’ containing 10% fetal bovine serum, 10 µg/ml insulin, 1 µM dexamethasone, 0.5 mM 3-isobutyl-1-methyl xanthine, and 100 U/ml penicillin/streptomycin in DMEM.\nPrepare a ‘Differentiation Medium II’ containing 10% fetal bovine serum, 10 µg/ml insulin, and 100 U/ml penicillin/streptomycin in DMEM.\nPrepare lysis buffer containing one protease inhibitor tablet per 10 ml Radio-Immunoprecipitation Assay buffer (RIPA buffer).\n2. Alginate Microbeads Preparation (Figure 1A)\nRemove old medium from cell culture flask. Rinse cells with 10 ml of PBS. Bring cells in suspension with 0.25% trypsin-EDTA (2 ml per one confluent T175 flask).",
    "Count cells in cell suspension using a hemocytometer. Use 10 ml aliquot from the cell suspension and count cells according to manufacturer’s instructions. Centrifuge the remaining cells in centrifugation medium at 480 x g at room temperature for 5 min.\nSuspend the cell pellet in sodium alginate as described in step 1.4. Transfer the sodium alginate-cell solution to a 5 ml syringe.\nRemove air bubbles in the solution, add a 23-gauge needle and invert the syringe to create a 1 ml pocket of air.\nPlace a small beaker (180 ml) containing 144 ml of 100 mM CaCl2 solution under the needle spout of the encapsulator. Attach the electrode to the encapsulator with the tip approximately 2.5 cm above the surface of the 100 mM CaCl2 solution.\nPlace tightly the syringe containing the sodium alginate-cell solution in the syringe pump. Attach the rubber tube to the opening of the syringe. Push the plunger until the sodium alginate-cell solution enters halfway through the tube. Adjust the voltage to 5.4 kV. Set the 12.06 mm diameter on the syringe pump. Adjust the speed to 3 ml/hr. Start the pump. Turn on the encapsulator and maintain the voltage at 5.4 kV.\nClose the window of the hood and avoid any unnecessary vibration till the end of formation of the alginate microbeads. After all solution passes through the needle, solidify the alginate ball-shaped microbeads in the 100 mM CaCl2 solution for additional 20 min before coating with PLL.\n3. Coating Microbeads with PLL (Figure 1B)\nRemove the beaker containing the sodium alginate-cell ball-shaped microbeads and transfer these microbeads into a 50 ml centrifugation tube. Remove CaCl2 solution from the microbead pellet.",
    "Wash the alginate-cell ball-shaped microbeads by adding 30 ml of 0.9% NaCl. Shake the tube by hand gently. Remove 0.9% NaCl with 25 ml pipette after the microbeads have precipitated by gravitation. Repeat two more times for a total of 3 washes.\nUse 10 ml of 0.05% PLL solution for every 1 ml of sodium alginate solution. Add the 0.05% PLL and vortex at 1,000 rotations per min for 10 min.\n\tNote: Usually, 10 min is sufficient for PLL coating.\nAfter PLL coat is formed, remove the PLL solution and wash the capsules 3 times as described in 3.2.\n4. Removal of Alginate Core (Figure 1C)\nAdd 30 ml of 50 mM sodium citrate solution. Wait 5 min or until all the sodium alginate is dissolved. Wash capsules three times as described in step 3.1.1.\nRemove the 0.9% NaCl, add 20 ml of culture medium to the 50 ml tube and transfer all capsules containing the cells to a cell culture flask. Handle encapsulated cells under standard cell culture conditions18.\n5. In Vitro Applications to Study Xenograft and Host Cell Interactions or Kinetics of Metabolite Influx/Efflux between Cells (Figure 2)\nCulture host cells on 24 well plate until confluent for co-cultures. Use the ‘Fibroblast Growth Medium’ for culturing preadipocytes.\nTransfer microcapsules into 24 well plate containing confluent host cells. Add microcapsules to achieve a monolayer (102 microcapsules/cm2 of well).\nInduce pre-adipocyte differentiation with Differentiation Medium I. Every 48 hr, change media to Differentiation Medium II  for six days. Lyse cells in RIPA buffer. Use 50 µg protein per condition to analyze protein expression using Western blot.\n6. In Vivo Application for Treatment of Obesity (Figure 3)",
    "Mix 4% isoflurane with oxygen for induction of anesthesia and 2% isoflurane with oxygen for maintenance of anesthesia. Confirm adequate anesthetic depth by toe pinch.\n\t\nApply anti-itch ointment on eyes to protect the corneas from drying out.\nUse encapsulated cells that are permanently labeled with artificial fluorescence protein, such as green fluorescence protein (GFP).\nUse a 3 ml syringe and a 20 gauge needle to inject encapsulated cells.\n\t\nInject 0.5 x 106 cells suspended in 0.2 ml of PBS into each iAb fat depot that is located in the intraperitoneal area between a gonad and kidney as shown in Figure 3. Use this volume of PBS and cell number for mice with an average weight of 40 g. Adjust cell number and volume in mice that have different weight or for determination of dose-dependent effects.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}