{
  "id": 10014,
  "origin_website": "Jove",
  "title": "Differentiation of Human Induced Pluripotent Stem Cells to Brain Microvascular Endothelial Cell-Like Cells with a Mature Immune Phenotype",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/65134/65134fig01.jpg\nFigure 1: Overview of the protocol. The manuscript presents a step-by-step protocol for differentiating hiPSCs into EECM-BMEC-like cells. The right schemes depict the cell populations at each step. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65134/65134fig01large.jpg]\nThe hiPSC line, HPS1006, was provided by the RIKEN BRC through the National Bio-Resource Project of the MEXT/AMED, Japan.\n1. Induction of hiPSC differentiation into endothelial progenitor cells (EPCs)\nExtracellular matrix (ECM)-coated plates and reagents\n\t\nPrepare basement membrane matrix-coated 12-well plates by aliquoting 2.5 mg of matrix gel into 50 mL centrifuge tubes for storage at -20 °C for up to 6 months. Add 30 mL of cold Dulbecco's modified Eagle's medium/nutrient mixture F-12 (DMEM/F12), which has been kept in a refrigerator (4 °C), into the tube. Mix gently by pipetting until the gel has thawed and then add 500 µL of the solution to each well of the 12-well plate. Place the plate in an incubator (37 °C, 5% CO2) for at least 1 h.\n\t\tNOTE: The basement membrane matrix gel is temperature-sensitive and should be handled according to the manufacturer's instructions for aliquoting and plate coating. The concentration of extracellular matrix proteins can vary between batches. To ensure accuracy, the exact concentration should be referred to on the quality certificate sheet for the specific batch, using the lot number. For instance, if the exact concentration is 10.0 mg/mL, use 250 µL of gel for a total of 2.5 mg.\nPrepare rho-kinase (ROCK) inhibitor stock solution by dissolving the ROCK inhibitor in sterile water to a concentration of a 10 mM (Table 1). Aliquot the stock solution in 100-200 µL volumes and store at -20 °C to avoid freeze-thaw cycles.",
    "Make a 100 mg/mL stock solution of L-ascorbic acid by dissolving 5 g of L-ascorbic acid in 50 mL of sterile water and store at -20 °C (Table 1). Add 6.25 mL of glutamine and 305 µL of L-ascorbic acid stock solution into 500 mL of advanced DMEM/F12 to make an LaSR medium24 (Table 1). Store at 2-8 °C for up to 2 weeks.\nPrepare CHIR99021 solution by dissolving CHIR99021 in undiluted dimethyl sulfoxide (DMSO) to a final concentration of 10 mM (Table 1). Aliquot the solution into 100-200 µL volumes to avoid freeze-thaw cycles and store at -20 °C for up to 1 year. Store working aliquots of the stock solution at 4 °C for up to 1 month.\nPrepare DMEM/F12-10 medium by adding 50 mL of heat-inactivated fetal bovine serum to 450 mL of DMEM/F12. Store the medium at 2-8 °C for up to 1 month (Table 1).\nPrepare flow buffer-1 by adding 33.3 mL of 7.5% bovine serum albumin (BSA) to 467 mL of Dulbecco's phosphate-buffered saline (PBS) (Table 1). Store at 2-8 °C for up to 6 months.\nSeeding of singularized hiPSCs and expansion for EPC differentiation (Day -3 to Day -1)\n\t\nBegin differentiation when the hiPSC colonies in a 6-well plate show no spontaneous differentiation and have the appropriate density for passaging, typically around 80% confluency (2.5-3.5 x 106 cells). Carefully monitor spontaneously differentiated cells under the microscope to ensure whether multiple passages are required to eliminate non-differentiated cells. Refer to the note provided below step 1.4.15 for information regarding cell culture medium and extracellular matrix.",
    "Aspirate the medium and add 1 mL of dissociation reagent to the wells and incubate for 5-7 min at 37 °C. Dissociate and singularize the cells by pipetting the dissociation reagent solution gently over the surfaces of the wells two or three times.\nTransfer the detached cells into a 15 mL tube containing 4 mL of hiPSC maintenance medium and resuspend the cells thoroughly. Reserve a 10 µL aliquot for cell counting.\nPellet the cells by centrifuging for 5 min at 200 x g at 20-25 °C. Count the cells and calculate the required volume to achieve an appropriate density of hiPSCs (75-400 x 103 per well) in a basement membrane matrix-coated 12-well plate (step 1.1.1).\nAspirate the coating solution from the wells and add 1 mL of hiPSC medium containing 10 µM ROCK inhibitor into each well (1:1,000 dilution). After centrifuging, aspirate the supernatant and dissociate the pellet in 1 mL of hiPSC medium.\nAdd the required volume of hiPSC, determined in step 1.2.4, to each well of the 12-well plate. Two to four 12-well plates may be sufficient for differentiating a hiPSC clone. Refer to step 1.2.4 to determine the number of plates required for seeding cells.\nPlace the plate in an incubator (37 °C, 5% CO2). Evenly distribute the cells by gently sliding the plate back and forth and then side to side in the incubator.\nOn the following day (i.e., Day -2), exchange the medium with 2 mL of hiPSC maintenance medium lacking ROCK inhibitor. On the next day (Day -1), exchange the medium with 2 mL of fresh hiPSC maintenance medium.\nInduction of EPCs with the glycogen synthase kinase 3 (GSK-3) inhibitor CHIR99021 (Day 0 to Day 5)",
    "On Day 0, replace the hiPSC maintenance medium in each well with 2 mL of LaSR medium containing 8 µM CHIR99021.\nOn Day 1, aspirate the medium and add 2 mL of fresh LaSR medium containing 8 µM CHIR99021.\nOn Days 2, 3, and 4, replace the medium with 2 mL of fresh LaSR medium lacking CHIR99021.\nMagnetic activated cell sorting (MACS) to purify CD31+ EPCs (Day 5)\n\t\nOn Day 5, aspirate the medium and then add 1 mL of dissociation reagent to each well, before incubating for 6-8 min at 37 °C.\nDissociate and singularize the cells with a micropipette and pass through a 40 µm cell strainer to filter the suspension into a 50 mL tube containing 10 mL of DMEM/F12-10 medium. Filter the cell suspension collected from more than two 12-well plates into at least two 50 mL tubes.\nStop the digestion reaction by adding DMEM/F12-10 medium (up to 50 mL). Pipette thoroughly and reserve 10 µL for counting cells. Pellet the cells by centrifuging for 5 min at 200 x g at 20-25 °C.\nAfter removing the supernatant, add 10 mL of DMEM/F12-10 medium and transfer the cell suspension into fresh 15 mL tubes. Pellet the cells by centrifuging for 5 min at 200 x g at 20-25 °C.\nAspirate the supernatant and resuspend into flow buffer-1 at a density of 1.0 x 107 cells per 100 µL of buffer.\nAdd FcR blocking reagent at a ratio of 1:100 and incubate for 5 min before adding the fluorescein isothiocyanate (FITC)-labeled CD31 antibody diluted 1:200. Incubate the suspension for 30 min in the dark at 20-25 °C.\nAdd 10 mL of flow buffer-1, reserving 10 µL of the suspension for flow cytometry analysis to determine the fraction of CD31+ cells (Figure 2).",
    "Pellet the cells by centrifuging at 200 x g for 5 min at 20-25 °C. Then, remove the supernatant and resuspend to a density of 1.0 x 107 cells per 100 µL of flow buffer-1 solution. Add the FITC selection cocktail (5 µL per 100 µL of cell suspension). Mix thoroughly by pipetting and incubate in the dark for 15 min at 20-25 °C.\nAdd 5 µL of magnetic nanoparticles per 100 µL of cell suspension, pipette well, and incubate in the dark for 10 min at 20-25 °C.\nTransfer the cell suspension to a 5 mL flow cytometry tube and add flow buffer-1 to achieve a total volume of 2.5 mL. Place the flow cytometry tube in the magnet for 5 min.\nIn a continuous motion, invert the magnet and decant the cell suspension containing cells that were not labeled with the FITC-CD31 antibody. Maintain the magnet and tube in the inverted position for 2-3 s and then remove the remaining liquid. Aspirate any droplets on the tube edge before returning the tube to an upright position.\nPick up the flow cytometry tube from the magnet and add 2.5 mL of flow buffer-1 to wash the remaining CD31+ cells. Resuspend the cells by gently pipetting the cells up and down two or three times. Place the flow tube into the magnet for 5 min.\nRepeat steps 1.4.11-1.4.12 three times and then step 1.4.11 once more for a total of four washes.",
    "Remove the flow tube from the magnet and add the indicated amount of a suitable medium (e.g., human endothelial serum-free medium [hECSR] for extended EC culture or freezing medium for freezing) to the tube to resuspend the purified CD31+ cells. Reserve two 10 µL aliquots of the suspension, one for cell counting and the second to carry out flow cytometry analysis to assess the purity of CD31+ cells in post-MACS samples (Figure 2). If a flow cytometer is not available immediately, store the aliquot at 4 °C until analysis.\nIf the next steps (through step 2) cannot be immediately carried out, freeze the CD31+ EPCs at this point. For expansion and selective passaging of EPCs, proceed to step 2.\n\t\t​NOTE: Vitronectin25-coated 12-well plates and the more stable hiPSC maintenance medium (mTeSR plus) can be used in place of basement membrane matrix-coated plates and hiPSC maintenance medium (mTeSR1). To prepare vitronectin-coated 12-well plates, dilute vitronectin with dilution buffer to a final concentration of 10 µg/mL and then transfer 500 µL of the diluted solution to each well of the 12-well plates. Leave the plates at 20-25 °C for at least 1 h. The seeding density of singularized hiPSCs is comparable to that used for basement membrane matrix-coated plates. Changing the culture medium or the matrix composition may impact the proliferation and spontaneous differentiation of hiPSCs, which typically require 1-2 weeks to adapt to new culture conditions. If the more stable hiPSC maintenance medium is used for hiPSC maintenance, this medium can be used for EPC differentiation instead of the hiPSC maintenance medium. In this case, the more stable hiPSC maintenance medium should be changed at Day -2 to remove ROCK inhibitor, and the exchange on Day -1 can be skipped.",
    "2. Extended endothelial cell culture method (EECM) to differentiate brain microvascular endothelial cell-like cells (BMEC-like cells) and smooth muscle-like cells (SMLCs)\nPreparation of collagen-coated plates and reagents\n\t\nPrepare collagen-coated 6-well plates by dissolving 5 mg of crystalized collagen type IV in 5 mL of sterile water. Incubate overnight at 4 °C before aliquoting and storing at -20 °C. Dilute collagen IV aliquots 1:100 in sterile water to produce 10 µg/mL solutions and add 1 mL of 10 µg/mL collagen IV solutions to each well of the 6-well plates. Incubate the plates for at least 30 min at 37 °C. The plates can be stored at 37 °C for up to 1 week.\nPrepare a stock solution of human fibroblast growth factor 2 (FGF2) by dissolving 500 µg of FGF in 5 mL of Dulbecco's PBS, add 7.5% BSA to a final concentration of 0.1%, and aliquot the stock solution into 20-200 µL volumes. These can be stored at -20 °C for up to 3 months (Table 1). Stock solutions can be stored at 4 °C for up to 1 month; avoid freeze-thaw cycles. Prepare hECSR medium by adding 2 mL of B-27 supplement and 20 µL of FGF2 into 98 mL of hECSR medium (Table 1). The hECSR medium may be stored at 2-8 °C for up to 2 weeks.\nPrepare freezing medium for the EPCs, EECM-BMEC-like cells, and SMLCs by adding 15 mL of fetal bovine serum, 5 mL of DMSO, and 25 µL of ROCK inhibitor solution to 30 mL of hECSR medium (Table 1). The freezing medium may be stored at 2-8 °C for up to 2 weeks.\nSeeding EPCs for extended endothelial cell culture",
    "Remove collagen solution from the 6-well plates. Then, transfer 1.0-2.0 x 105 purified CD31+ EPCs in 2 mL of hECSR medium containing 5 µM ROCK inhibitor (1:2,000 dilution). Place the plate in an incubator (37 °C, 5% CO2). Evenly distribute the cells by gently sliding the plates back and forth, then side to side.\nThe next day, remove the hECSR medium containing ROCK inhibitor and add 2 mL of fresh hECSR medium without ROCK inhibitor. Exchange the hECSR medium every other day until 100% confluence is reached.\n\t\tNOTE: If a regular feeding schedule cannot be maintained over a weekend, the medium can be replaced in the evening of the last working day of the week and again early in the morning after the weekend.\nSelective passage to purify EECM-BMEC-like cells and SMLCs\n\t\nRemove the hECSR medium from the 6-well plates containing a mixture of ECs and non-EC populations. Add 1 mL of dissociation reagent to each well.\nMonitor the cell morphology carefully under a microscope. When the ECs (but not non-ECs) appear bright and round (typically within 2-5 min), detach them by tapping the edge of the plate. Most non-ECs remain attached to the plate.\nCollect the detached ECs using a micropipette, taking care to avoid resuspending the non-ECs. Transfer the ECs to a 15 mL or 50 mL centrifuge tube containing 4 mL of DMEM/F12-10 per 1 mL of dissociation reagent.\nAdd 2 mL of hECSR medium to the wells containing the remaining attached non-ECs to establish SMLCs. Place the plate in the incubator.",
    "Pipette the EC suspension in the centrifuge tube to mix thoroughly and reserve 10 µL of the suspension for cell counting. Centrifuge the remaining cells for 5 min at 200 x g at 20-25 °C. Remove the supernatant from the pellet and add 2 mL of hECSR medium per 1.0-2.0 x 105 ECs.\nUpon removal of the collagen IV solution from a new 6-well plate, add 2 mL of EC suspension to each well, followed by incubation at 37 °C with 5% CO2. To evenly distribute the cells in the plate, gently move it in a back and forth and side to side motion on the incubator shelf.\nReplace the hECSR medium every other day until the ECs reach 100% confluency.\nRepeat steps 2.3.1-2.3.7 until a pure EC monolayer is obtained. If the following steps cannot be carried out, freeze the CD31+ ECs (see step 2.4.2). To analyze EC functions, proceed to step 3.\n\t\tNOTE: In general, two or three selective passages are needed to obtain nearly pure cultures of ECs that are suitable for functional analyses, and we consider these cells as EECM-BMEC-like cells. After more than five or six passages, cell proliferation typically slows, although this variable depends on the hiPSC line.\nTo culture SMLCs, replace the hECSR medium every other day. To collect SMLC-conditioned medium (CM), pass the collected medium through a 0.22 µm filter upon each medium change. The CM can be used to upregulate the VCAM-1 expression of EECM-BMEC-like cells. Pool the SMLC-CM until the SMLCs reach 100% confluency.\nEPC, EECM-BMEC-like cell, and SMLC cryopreservation and thawing",
    "To freeze EPCs, following the final MACS wash (step 1.4.13), resuspend the EPCs in freezing medium rather than hECSR medium at a density of 1.0-2.0 x 106 cells/mL. Distribute 1 mL of the cell suspension into cryotubes. Place the cryotubes into a controlled rate freezing device and quickly transfer them to -80 °C. For long-term storage, move the tubes to a liquid nitrogen tank 24 to 48 h after freezing.\nTo freeze EECM-BMEC-like cells and SMLCs, after removing the medium from wells, add dissociation reagent (1 mL/well) and incubate the plate at 37 °C with 5% CO2 until the cells detach (5-7 min and 20-30 min for EECM-BMEC-like cells and SMLCs, respectively). Collect the cells in a 15 mL or 50 mL centrifuge tube containing 4 mL of DMEM/F12-10 per 1 mL of dissociation reagent.\nPipette thoroughly to mix and reserve 10 µL of the cell suspension for cell counting. Pellet the cells by centrifuging at 200 x g for 5 min at 20-25 °C. Remove the supernatant and thoroughly resuspend the cells in freezing medium to a density of 1.0-2.0 x 106 cells/mL. Distribute 1 mL of the cell suspension into fresh cryotubes.\nPlace the cryotubes in a controlled rate freezing device and immediately transfer them to -80 °C. For long-term storage, the tubes can be transferred to a liquid nitrogen tank 24 to 48 h after freezing.",
    "For thawing EPCs, EECM-BMEC-like cells, and SMLCs, roll vials of cryotubes between the hands or incubate in a 37 °C water bath until the cells are nearly completely thawed. Add 500 µL of DMEM/F12-10 and gently transfer the cell suspension to a 15 mL tube containing 4 mL of DMEM/F12-10 medium. Wash the cryotube once by adding 1 mL of DMEM/F12-10 and then centrifuge the cells at 200 x g for 5 min at 20-25 °C.\nAspirate the supernatant and resuspend the pellet in 2 mL of hECSR medium containing 5 µM ROCK inhibitor (1:2,000 dilution) to a density of 1.0-2.0 x 105 cells per 2 mL for EPCs, and 2.0-3.0 x 105 cells per 2 mL for EECM-BMEC-like cells and SMLCs. Distribute the cell suspension among the wells of the collagen-coated 6-well plates after aspirating the collagen solution.\nGently move the plates back and forth, then side to side, on the shelf of an incubator at 37 °C, 5 % CO2 to evenly distribute the cells in the wells.\nThe next day, exchange the medium with fresh hECSR medium lacking ROCK inhibitor. Exchange the hECSR medium every other day until 100% confluency is achieved. Then, proceed to selective passaging for EPCs (see step 2.3) and functional analyses for EECM-BMEC-like cells (see step 3). Before performing molecular characterization and functional assays, EECM-BMEC-like cells should be 100% confluent, which is typically achieved 2-3 days after thawing.\n3. Validation of EECM-BMEC-like cells and SMLCs\nPermeability assay for small molecule tracers\n\t\nAssess the EECM-BMEC-like cell barrier integrity by measuring sodium fluorescein permeability, as described by Nishihara et al.26. Seed the EECM-BMEC-like cells on filter inserts to develop complete monolayers and measure the permeability of sodium fluorescein.\nImmunofluorescence staining to assess key molecules.",
    "For immunofluorescence staining to monitor the expression of junctional molecules, adhesion molecules, or cytoskeletal proteins of EECM-BMEC-like cells in monolayers or of SMLCs, use chamber slides, 96-well plates, or membranes with insert filters. Assess the EECM-BMEC-like cell expression of cell surface adhesion molecules with or without inflammatory cytokine stimulation, as described by Nishihara et al.26.\nFlow cytometry to analyze the expression of cell surface adhesion molecules on EECM-BMEC-like cells\n\t\nUse flow cytometry to assess the semi-quantitative expression of cell surface adhesion molecules involved in immune cell migration into the CNS, including ICAM-1, ICAM-2, VCAM-1, P-selectin, E-selectin, CD99, and platelet endothelial cell adhesion molecule-1 (PECAM-1), as described by Nishihara et al.26. Culture the EECM-BMEC-like cells with SMLC-conditioned medium in the presence and absence of inflammatory cytokines for 16-18 h.\nImmune cell adhesion assay under static conditions to assess the expression of functional adhesion molecules\n\t\nUse the method described by Nishihara et al.26 to determine whether the cell surface adhesion molecules of the EECM-BMEC-like cells are functional.\nBriefly, seed the EECM-BMEC-like cells onto a chamber slide at 5.5 x 104/cm2 and grow to confluence. Approximately 24 h later, change the culture medium to SMLC-conditioned medium in the presence or absence of pro-inflammatory cytokines, and incubate the EECM-BMEC-like cells for an additional 16 h.\nOn the day of the experiment, thaw cryopreserved immune cells (e.g., T cells or peripheral blood mononuclear cells [PBMCs]) with T-cell wash buffer (Table 1) and label with fluorescent dyes (e.g., cell tracker dyes) in T-cell medium (Table 1). Optimization of the culture medium for the immune cells should be tailored to the specific type of immune cells being studied.",
    "In a 16-well chamber slide, add 2 x 104 Th1 cells to the EECM-BMEC-like cells. Specifically, when working with effector T cells such as Th1 cells, it has been observed that they exhibit greater attachment to EECM-BMEC-like cells as compared to PBMCs (Nishihara. et al. [2022]). Consequently, the number of PBMCs to be added to the EECM-BMEC-like cells needs to be higher compared to pure effector T cells.\nIncubate the immune cells with the monolayer of EECM-BMEC-like cells for 30 min in migration assay medium (Table 1). After 30 min, wash the slide gently, twice by immersing in a jar containing Dulbecco's PBS and subsequently fix with 2.5% glutaraldehyde solution at 4 °C for 2 h.\nAfter fixation, wash the slide twice by immersing in a jar containing Dulbecco's PBS and mount with a coverslip. Subsequently acquire fluorescence microscopy images of the center of the monolayer on the slides for counting immune cells attached to EECM-BMEC-like cell monolayers."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}