{
  "id": 18318,
  "origin_website": "Jove",
  "title": "Evaluation of Drug Sorption to PVC- and Non-PVC-based Tubes in Administration Sets Using a Pump",
  "procedures": [
    "1. Preparation of Tubes in Administration Sets\nNOTE: Precisely perform the cutting step to eliminate the effect of differences in tube length on drug sorption.\nLabel the end of the tubes with the tube type (e.g., PVC, polyurethane (PU), and polyolefin (PO)) using a marker.\nRemove all detachable accessories, such as connectors and needle covers.\nUsing a sharp razor to ensure clean edges, cut the tubes to 1 m in length from the connection of the drip chamber.\n2. Dilution of Drug Injections\nNOTE: Use a glass bottle (1 L) as the container for the injected drug solution. Perform the dilution step precisely. Verify the composition of the marketed drug product and use the same batch number for a whole experimental set.\nLabel bottles with the drug names (e.g., diazepam or tacrolimus).\nDilute the drug injections with 5% dextrose solution, from 5 mg/mL to 100 µg/mL for diazepam injections (2 mL of diazepam injection in 100 mL of 5% dextrose solution) and from 5 mg/mL to 10 µg/mL for tacrolimus injections (200 µL of tacrolimus injection in 100 mL of 5% dextrose solution).\n\tNOTE: Set up the tested concentrations of drugs and solvents based on the clinical usage.\nGently mix the diluted solutions in the bottle by swirling to obtain homogenous drug solutions.\nCollect diluted solutions (1-10 mL) in amber vials using a glass graduated cylinder.\nVerify the concentration, as described in step 4.\n\tNOTE: Use these concentrations of drugs as concentrations at the starting points.\n3. Kinetic Sorption Study Using an Infusion Pump",
    "NOTE: Confirm the tube-dependent flow rate using a pump prior to the sorption test due to the hardness of tubes. Collect samples at precise time points and use glass bottles and vials to prevent additional drug sorption during storage. Perform the test as shown in Figure 2. Protect the drug solution against light if the drug has photosensitivity. Perform the experiments in triplicate.\nWithout creating air bubbles, preload a diluted solution of the drug into the tube using a syringe.\n\t\nConnect one end of the tube to a syringe.\nPut the other end of the tube into the bottled drug solution.\nPull back the syringe plunger until the tube is completely filled with the drug solution.\nInstall the tube into an infusion pump.\n\t\nOpen the door of the infusion pump and push the release lever.\nInsert the preloaded tube into the infusion pump and keep it straight.\nRemove the syringe at the end of the tube after installation.\nPut the end of tube into a chemically resistant borosilicate glass graduated cylinder to collect the drug solution after it passes through the tube.\nSet the flow rate based on the type of tube in the administration set (PVC, PU, or PO) and the drug (e.g., 1 mL/min for diazepam and 10 mL/h for tacrolimus).\nCollect samples into amber vials at various time points, at room temperature.\n\t\nCollect 1-mL diazepam samples at 0.05, 0.30, 0.55, and 1.05 h.\nCollect 10-mL tacrolimus samples at 1.05, 2.05, 3.05, and 4.05 h.\n4. Analysis of Drug Using High-performance Liquid Chromatography (HPLC)\nNOTE: Recommended HPLC methods for drug analysis are described in references 1, 8,9. Use tandem mass spectrometry (MS/MS) and immunoassay after sample preparation as alternative methods10, 11. Perform the experiments in triplicate.",
    "Weigh the drugs and dissolve them in organic solvents at a concentration of 1 mg/mL as stock solutions.\n\t\nUse methanol as a solvent for diazepam stock solution due to the low solubility of diazepam in 5% dextrose.\nUse acetonitrile as a solvent for tacrolimus stock solution due to the low solubility of tacrolimus in 5% dextrose.\nPrepare standard solutions by diluting the stock solutions.\n\t\nDilute diazepam stock solutions with methanol to 0.3125, 0.625, 1.25, 2.5, 5.0, 10.0, and 20.0 µg/mL.\nDilute tacrolimus stock solutions with 5% dextrose to 2.5, 5.0, 10.0, 15.0, and 20.0 µg/mL.\nAnalyze standards using the HPLC method with UV detection1, 8, 9.\n\tNOTE: Use an appropriate detection method (UV, fluorescence, etc.) for drug analysis.\n\t\nInject 10 µL of standards into an HPLC system with UV detection equipped with a C18 column (1.5 mm × 250 mm, 5 µm). See Table 1 for analysis conditions.\nConfirm the specificity and linearity1, 8, 9.\n\t\t\nFor specificity, monitor the drug peak (i.e., whether it was separated from other peaks in the chromatogram) to identify the drug.\nConfirm linearity at the calibration range (i.e., whether the peak area results are directly proportional to the concentrations).\nObtain calibration curves.\n\t\t\nCreate graphs based on concentration versus peak area value from chromatograms of the standards1, 8, 9.\nObtain linear regression equations with R2 for the calibration curves (e.g., y = ax + b, x: concentration of drug, y: peak area)1, 8, 9.\nDilute the samples from the sorption study with methanol for diazepam or 5% dextrose for tacrolimus as appropriate so that they fall within the calibration range and directly inject 10 µL of diluted sample into the HPLC system.\n5. Calculation of Drug Concentration and Sorption Level\nCalculate the drug concentrations of the samples using calibration curves (unknown x and known y).",
    "Calculate the sorption levels of the drugs using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55086/55086eq1.jpg\n\twhere S: Sorption level (%)\n\tCo: Drug concentration after the dilution of the injections (µg/mL)\n\tCp: Drug concentration passed through the tubes (µg/mL)\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}