{
  "id": 17343,
  "origin_website": "Jove",
  "title": "Fixed Target Serial Data Collection at Diamond Light Source",
  "procedures": [
    "1. Preparing and loading a chip\nNOTE: The process occurs within a humidity-controlled environment (Figure 1), typically between 80% and 90% or higher relative humidity, to prevent protein crystals from drying out. Once loaded and sealed, crystals can survive for upwards of 24 hours. However, this is can vary greatly between crystal systems. Within the chamber a low powered vacuum pump attached to a loading stage to hold a silicon chip (Figure 1), a silicon chip, a chip holder with polyester foil (Figure 2), a p200 pipette, 200 µL pipette tips, tweezers, filter paper and the protein crystal slurry are required.\nPrepare a chip holder.\n\t\nCut two sheets of polyester foil into squares approximately 6 cm x 6 cm.\nLay the polyester sheets over the two base plates (large and small).\nFix the polyester sheets in place using the metal sealing rings.\nCarefully pull on the excess polyester foil to remove any creases to make visualizing and centering samples easier later.\nSelect a silicon chip with appropriately sized apertures (7-30 μm) relative to the size of the crystals.\nGlow discharge the chip for 25 seconds at 0.39 mBar and using a current of 15 mA to enable easy spreading of micro crystals on the chip.\nPlace the silicon chip on the chip loading stage using tweezers with the raised bars facing down.\nApply 200 μL of the micro-crystal slurry to the flat side of the chip using a pipette.\nSpread out the crystal slurry to cover all the \"city-blocks\" of the chip.\nIf the chip is damaged, cover any holes with a small piece of polyester foil or filter pipette tip to ensure an even vacuum can be applied.\nApply a gentle vacuum until all excess liquid has been sucked through the chip.",
    "Remove the chip from the chip loading stage with tweezers.\nCarefully blot the underside of the chip with filter paper to remove excess liquid.\nPlace the loaded chip on the larger half of the chip holder between the guide marks flat side down.\nSeal the chip by placing the small half of the chip holder on top.\n\t\nThe two halves of the chip holder will snap into place. If the second half does not sit flush, spin the holder 180° to properly align the magnets.\nScrew the chip holder closed with hex bolts to fix the chip securely in place.\n\t​NOTE: Alternatively, a \"chipless\" chip can be loaded in a similar fashion, with a smaller volume of crystal slurry (~15 µL) sandwiched between the two layers of polyester foil in the chip holder 37, or a smaller volume can be loaded using a 50 µm thick double-sided adhesive spacer applied directly to the polyester foil as described previously 38. The use of adhesive spacers also allows multiple samples (or variants of samples such as ligand soaks) to be loaded on each chipless chip. A complementary loading approach exploiting acoustic drop ejection (ADE) to load silicon chips can also be used at Diamond39. ADE allows chips to be loaded using smaller volumes of crystal slurry than pipette loading. It is a particularly useful technique when samples are scarce, though the chemical composition and viscosity of the slurry must be taken into consideration.\n2. GUI and setup at the beamline",
    "Perform all chip alignment and setup for data collection through a simple EPICS Display Manager (edm) graphical user interface (GUI) (Figure 3a). This provides a point-and-click interface to beamline instrumentation and provides input parameters for Python-based data collection. Sub windows provide additional control for collecting from sub regions of a sample holder (Figure 3b) or laser/LED pump-probe experiments (Figure 3c).\n3. Aligning the chip\nPlace the loaded chip on the XYZ stage at the beamline (shown in Figure 4a) using the kinematic mounts.\n\t\nTake care to avoid pulling the stages along their direction of travel. The magnets in the kinematic mounts are quite strong so this can be done quite easily by accident.\nWhen approaching the mount, the chip holder should be held at a slight angle (±30°). When the magnets make contact allow the chip holder to rotate parallel to the floor (0°) and the chip holder will click into place (Figure 4b).\nWhen unloading a chip follow a reverse path. Rotate and angle the chip away from the stages before pulling the chip holder away.\nUsing the beamline's on-axis viewing system and the chip alignment GUI, locate the top left fiducial of the chip. Fiducials are three squares, two small and one large, at right angles to one another (Figure 5a). The chip is back illuminated so the chip will appear dark with apertures as white squares.\nCenter on fiducial zero in X, Y, and Z (Figure 5b). Align X and Y by moving left/right and up/down, respectively. Align Z by moving the chip in and out of focus.\nClick Set Fiducial Zero.\nRepeat step 3.2 for fiducial one (top right, Figure 5c) and fiducial two (bottom left, Figure 5d) to align all fiducials with the X-ray beam.",
    "Generate a co-ordinate matrix by pressing make co-ordinate system, this calculates the offset, pitch, roll, and yaw of the chip relative to the stages allowing all subsequent movements to be done in the chip co-ordinate frame.\nClick Block Check to move the XYZ stage to the first well of each city block for visual confirmation that the chip is well aligned.\nIf the X-ray crosshair lines up with the apertures the chip is aligned. If not, repeat steps 3.2-3.3.\n\t​NOTES: In case of difficulty aligning (broken fiducials), different apertures on the chip can be used for alignment using the \"alignment type\" pull-down menu. Many different types of chip are available for fixed target data collection. Different chip types are accommodated through use of the 'chip type' pull-down menu. The most common chip types used at I24 are 'Oxford' and 'custom' chips. The number and the spacing of apertures and fiducials on the chip are read from a chip dictionary defined via the pull-down menu. Custom chip allows the aperture spacing to be defined on-the-fly, which is particularly useful for thin-film sheet-on-sheet or other 'chipless' type chips where crystals are randomly located across the holder37. A new Python GUI, offering move-on-click functionality and automated chip alignment is currently under development, but is not yet ready for routine use at the time of the writing of this manuscript.\n4. Setting up data collection\nNOTE: Data collection setup will depend on the system being studied, and the experiment to be performed. This can range from the simplest SSX experiment, collecting a low dose structure, to a time-resolved experiment using lasers or rapid mixing to initiate a reaction which will require multiple complete datasets at different time delays. To set up a data collection the following parameters need to be defined.",
    "Experimental variables: Fill in the folder, filename, exposure time, transmission, detector distance, and number of shots per aperture in as appropriate.\nChip type: As described above, match the chip type to the chip in use.\n\t\nIf a thin film or 'chipless' chip is being used, then set the chip type to None.\nDefine the number of steps and step size in both x and y in the GUI.\nSet the map type: this allows subsections of a chip to be selected for data collection (Figure 3b). 'None' means data are collected from every aperture on a chip. 'Lite' means data are collected from selected city blocks on the chip (Figure 3b). This can be useful if, for example, a region of a chip is known to be poorly loaded or empty. 'Full' allows individual apertures to be selected for data collection. In this case a correctly formatted text file must be provided. Details and a template can be obtained from beamline staff.\nPump-probe: Select the type of pump probe experiment and the desired time delay. The triggering of the pump (usually a LED or laser) is often specific to a particular experiment, so will not be described in detail here.\n\t\n'Short' delays refer to experiments when there is a dwell at each aperture between the pump and the probe (i.e., pump, probe, 'move to the next sample.) Delays are typically on the order of 1 second or tens of milliseconds.\nLong' delays refer to an excite and visit again (EAVA) strategy, where apertures are visited twice, with a defined time delay between visits (i.e., pump, move, pump, move, probe, move, probe, etc.). The time delay is calculated and X-ray exposure times (Figure 3c) and it is typically ~1 second or more.\n5. Common data collection methods",
    "NOTE: The following are the key parameters that define the type of experiment being carried out. This section assumes that the other settings from protocol 3 \"Setting up Data Collection\" have been defined.\nScenario 1: Low-dose data collection. Collection of a single diffraction image from every selected aperture on the sample holder.\n\t\nSet number of shots per aperture to 1.\nSet pump probe to None.\nScenario 2: A dose series, collecting n images sequentially from every selected aperture on the sample holder. The chip is stationary at each aperture while each set of n images is collected.\n\t\nSet the number of shots per aperture to 'n'. Note that processing is simplified if n=5, 10, 20 or another multiple of 10. It is difficult to establish trends if n < 5. It is useful to consider the total time required to cover a chip and the number of image files produced when n is increased.\nSet pump probe to None.\nScenario 3: Pump-probe methods\n\t\nSelect a method from the Pump Probe pull-down menu to open the Laser Excitation Control Centre.\nFor a pump probe experiment fill in the Laser Dwell at each aperture option.\nFor EAVA fill in the Laser Dwell at each aperture and X-ray exposure and click Calculate.\nSelect the appropriate Repeat option in the edm GUI pump probe drop-down menu for the desired delay time.\nIf the experiment requires a pre-illumination step fill in the Laser 2 Dwell section.",
    "After all experimental variables are defined press Set parameters and create short list. This loads experimental variables onto the geobrick controller. After this is done pressing Start will move the detector in, the backlight out, and start data collection. At all points in setting up data collection it is useful to have a terminal window open where feedback on the status and outcome of each of the steps is printed.\n6. Data processing\nNOTE: Broadly speaking data processing can be divided into three groups based on the urgency with which feedback is required. Fast feedback is required to show if crystals are present and diffract, and if so, in what numbers. This should keep up with data collection. Performing data indexing and integration which can be slower but should still be performed on comparable time scales with data collection. Merging and scaling of reflection intensities into an mtz file for structure solution and the generation of electron density maps represents the final step and can be slower still. Here starting pipelines at I24 for the first two stages only will be discussed, as they are required for real-time feedback to guide your experiment, though note that metrics such as hit-rates and scaling statistics are not a substitute for inspecting electron density, which may provide the only confirmation that a ligand has bound, or a reaction occurred, in crystallo.\nFast feedback\n\t\nTo load the data processing modules type module load i24-ssx into the terminal on any beamline workstation.\nTo run the hit-finding analysis type i24-ssx /path/to/visit/directory/ into the terminal: i24-ssx /dls/i24/data/2020/mx12345-6/\n\t\tNOTE: This opens three terminal windows and, once data has been written to disk, a graphical representation of spot finding results from Diffraction Integration for Advanced Light Sources (DIALS) 40,41(Figure 6a).",
    "Default settings scores every 10th image and refreshes every few seconds to minimise the computational load.\nChange the default by adding an argument to the end of the command above. For example, 'i24-ssx /dls/i24/data/2020/mx12345-6 2' i24-ssx would run hit finding on every other image. However, this can put undue strain on the cluster (a shared resource!) and slow down processing times. The graph is color coded based on the likelihood of successful indexing, red shows at least 15 Bragg spots have been found (good chance of indexing), blue shows little to no useful diffraction.\nView diffraction images of interest in the DIALS image viewer by clicking on the spots on the spot finder interface.\nIndexing and integration feedback\n\tNOTE: Indexing and integration of diffraction data are performed with DIALS using the dials.still_process function 40,41. As such, specific information relating to your crystal (expected crystal space group, unit cell, and an experiment geometry) should be put into a .phil text file.\n\t\nLoad DIALS modules by typing module load dials in a terminal.\nTo begin processing a dataset type dials.still_process /path/to/images/ /pathto/phil- file.phil. The progress of all still processing datasets can be monitored by running the stills_monitor script by typing monitor_stills_process.py (after performing module load i24-ssx and changing directory to the current visit) (Figure 6b).\nThe unit cell distribution of indexed diffraction data (Figure 7a) can be monitored using the command ctbx.xfel.plot_uc_cloud_from_experiments/path/to/dials/output/*refined.expt combine_all_input=true This is particularly useful to identify and resolve unit cell polymorphs as discussed previously 42.\n'Visualzie' if, and how, this distribution varies across a fixed target by producing a 2D plot (Figure 7b) using the command python pacman.py /visit/processing/_hit_finding/chip.out.\nProduce stereographic projections of all indexed diffraction data (Figure 7c) using the DIALS command dials.stereographic_projection hkl= 0,0,1 expand_to_P 1 =True /path/to/dials/output/*refined.expt.",
    "NOTE: It is a common pathology when processing stills data from crystals where the symmetry of the Bravais lattice is higher than the space group symmetry that merged data appear as a perfect twin. Data processing algorithms have evolved to resolve this pathology 43,44,45,46 but users should be mindful of this while processing their data."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}