{
  "id": 18371,
  "origin_website": "Jove",
  "title": "An Intramedullary Locking Nail for Standardized Fixation of Femur Osteotomies to Analyze Normal and Defective Bone Healing in Mice",
  "procedures": [
    "All procedures were IACUC-approved and followed institutional guidelines (Landesamt für Verbraucherschutz, Zentralstelle Amtstierärztlicher Dienst, Saarbrücken, Germany). Analgesia and infection prevention should be in agreement with the respective guidelines of the country and institution where the experiments are to be performed.\n1. Preparation of Implants and Surgical Instruments\nSelect a scalpel blade (size 15), small preparation scissors, fine forceps, dressing forceps, small pincers, 24 gauge (G) and 27 G needles, a non-resorbable 5-0 suture, and a needle holder from the microsurgical instrument box.\nUnpack the intramedullary nail, the interlocking pins, the special aiming device, the Gigli saw, the template for the Gigli saw, the centering drill bit (1 mm diameter), the drill bit (0.3 mm diameter), and the hand drill (Figure 2; see List of Materials).\n\tNOTE: The intramedullary nail (0.8 mm diameter, 15.7 mm length) is an intramedullary locking nail made of medical-grade stainless steel for retrograde implantation into the femur. The nail has a proximal thread (4 mm length) and two holes for the insertion of the interlocking pins (0.3 mm diameter) to achieve axial and rotational stability (Figure 1).\nExpose the implants and all surgical instruments to a disinfecting solution (e.g., 96% alcohol) for 5 min or sterilize them (steam sterilization, 130 °C, 25 min). After disinfection or sterilization, place the instruments on a sterile operation cloth. Position the sterile operation cloth directly adjacent to the small animal operation table.\n2. Animals, Anesthesia, and Analgesia\nChoose the strain, age, and sex of the mice as necessary for the study and the question to be addressed.\n\tNOTE: For this study 12- to 14-week-old male CD-1 mice were used. For nail implantation, the ideal body weight of the animals is 25 - 35 g.",
    "Anesthetize the mice with an intraperitoneal injection of 15 mg/kg xylazine and 75 mg/kg ketamine. Confirm the anesthetization by toe pinch. Apply eye lubricant to protect the animals' eyes from drying during anesthesia. After induction of anesthesia, place the mouse under a heat lamp to keep the body temperature constant.\nApply tramadol-hydrochloride in the drinking water (2.5 mg/100 ml) for analgesia from day 1 before the surgery until day 3 after the surgery.\n3. Surgical Procedure and Nail Implantation\nBefore surgery, shave the entire right hind leg and apply a depilatory cream. After 5 min, remove the cream and clean the leg with water. Expose the implants and all surgical instruments to a disinfecting solution (e.g., 96% alcohol) or sterilize them (steam sterilization,130 °C, 25 min).\nUnder aseptic conditions, place the mouse in the supine position on the small animal operation table. Bend the right knee to allow for an anterior approach to the condyles of the knee. Perform a 5 mm medial parapatellar incision at the right knee using the scalpel blade.\nLift the patellar ligament with the fine forceps and mobilize the ligament carefully with the scalpel blade. Then, shift the patella laterally with the scalpel blade to expose the intercondylar notch of the femur.\nOpen the intercondylar notch by drilling until the intramedullary cavity is reached.\n\t\nStart drilling with a 45º offset to the femur axis using the 1 mm centering drill bit. Slowly change the direction of the drill bit during drilling until it parallels the bone axis of the femur. Stop drilling if the intramedullary cavity is reached.",
    "After opening the bone at the intercondylar notch, insert the 24 G needle into the intramedullary cavity over the whole length of the femur. Ream the intramedullary cavity of the femur manually through rotary motions of the 24 G needle. Remove the 24 G needle and insert the thinner 27 G needle into the intramedullary cavity. Push the needle forward to perforate the cortical bone of the femur proximally at the greater trochanter.\nRemove the 27 G needle from the femur. Using the hand drill, implant the intramedullary nail through the intercondylar notch under continuous rotation and axial pressure until the distal end of the nail reaches the level of the condyles.\n\tNOTE: The distal end of the nail can be identified with a small mark.\nPlace the mouse in the left lateral position. Perform a longitudinal skin incision using the scalpel blade along the diaphyseal part of the lateral femur from the knee joint to the hip joint in order to surgically expose the midshaft of the femur.\nUsing small preparation scissors, split the fascia and spread the muscles in the direction of the femur axis from the lateral side. Spread the muscles until the diaphyseal part of the femur is exposed. Preserve the sciatic nerve.\n\t\nPrepare the whole circumference of the femur by undermining the bone with the dressing forceps. Then, retract the muscles by spreading the dressing forceps and expose the femur.\nMount the aiming device to the distal end of the nail. Advance the device until it attaches to the adapter flange of the nail and turn the aiming device in anterolateral position to the femur.\nInterlock the nail with a proximal and a distal interlocking pin.\n\t\nStart with the proximal interlocking pin.",
    "Insert the centering drill bit (1 mm diameter) into the hand drill. Countersink the bone at the proximal interlocking hole position.\n\t\tNOTE: By countersinking, a small cavity is created in the facing cortical bone without drilling through the bone. This cavity allows for improved centering and guiding of the thinner drill bit (0.3 mm diameter), used later.\nInsert the drill bit (0.3 mm diameter) into the hand drill. Using the aiming device, drill the hole through both the facing and the averted cortical bone (bicortical). Insert the first interlocking pin through the aiming device. The interlocking pin drive shaft shears off as soon as the interlocking torque is achieved.\nRepeat this procedure for the distal interlocking pin.\nPerform the diaphyseal osteotomy.\n\t\nAttach the saw guide to the aiming device on the lateral side between the two interlocking pins. Then, saw the bone with the Gigli saw under continuous irrigation with saline. After the osteotomy is completed, cut the saw at one end, close to the bone. Remove the saw carefully to avoid causing damage to the soft tissue.\nRemove the aiming device and, with the small pincers, clip off the remaining shaft of the intramedullary nail at the marked line.\nClose the muscle layers at the lateral site of the femur and perform the skin closure with single sutures. At the anterior site of the knee, reposition the patella and fix the patella tendon to the muscles with one single suture. Use single sutures to close this wound as well.\nKeep the animals under the heat lamp until they recover from anesthesia. Do not leave the animals unattended until they have regained sufficient consciousness to maintain ventral recumbency. Return the animals to single cages in the animal facility.",
    "Monitor the animals carefully every day. Maintain postoperative analgesia during the first three days. Continue analgesia if, on day 4 after surgery, the animals still show evidence of pain, as indicated by vocalization, restlessness, lack of mobility, failure to groom, abnormal posture, and lack of normal interest in surroundings. Terminate analgesia when the animals are pain free.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}