{
  "id": 6429,
  "origin_website": "Bio",
  "title": "Primary Embryonic Rat Cortical Neuronal Culture and Chronic Rotenone  Treatment in Microfluidic Culture Devices",
  "procedures": [
    "Prepare in advance of dissection and platingPrepare Borate Buffer solution, the Dissociation Media and the HBSS Dissection Media according to the Recipes below.Prepare the necessary amounts of Seeding Media and Feeding Media according to the Recipes below. The amount prepared will depend on the size of the planned experiment. Each full neuronal preparation needs approximately 25 ml of Seeding Media, and each device needs approximately 5 ml of Feeding Media for plating and maintenance.Prepared media can be kept for up to 10 days, and could be used for subsequent neuronal preparations. It is therefore reasonable to make enough media for subsequent uses. Prepare 2-days before dissection and platingThaw Poly-D-LysinePull the necessary number of aliquots of 2.5 mg/ml Poly-D-Lysine Stock Solution (400 µl) from -80 °C.Place on ice, and thaw overnight at 4 °C.Acid-wash and sterilize coverslipsIn a sterile culture hood, place the required number of coverslips (1 per device to be plated, plus 2 extras) into a glass slide staining jar.Fill with 50 ml of 1 N HCl (prepared in sterile cell culture water). Place the cover on the staining jar, and place the jar on a shaker plate outside the hood. Agitate the coverslips gently on a shaker plate for 1 h.Return the jar to the sterile culture hood and remove the HCl from the jar via pipette or aspiration.Add sterile cell culture water to the jar, cover, and place the jar on a shaker plate outside the hood. Repeat this water rinse 3 x 10 min.Remove final water wash via pipette or aspiration, and add 50 ml of 70% ethanol solution to sterilize coverslips. Cover the jar and agitate gently on a shaker plate for 30 min.Remove ethanol wash via pipette or aspiration, and add 50 ml of sterile culture water to the coverslips.",
    "Cover the jar and agitate gently on a shaker plate for 10 min.In the sterile culture hood, remove coverslips from the staining jar, and rest in an open 10 cm Petri dish to air dry. Prop the edges of the coverslips up on the sides of the petri dish–do not let the coverslips lay flat.Once dry, sterilize the coverslips by exposing them to the ultraviolet (UV) light of the sterile culture hood for 20 min.After UV exposure, place the coverslips inside the Petri dish and cover with the lid. Store overnight in a closed container or in the sterile culture hood without the UV light on.Prepare 1-day before dissection and platingCoat coverslips with Poly-D-LysineCarry this procedure out in a sterile culture hood.Arrange coverslips, so they are lying flat, not overlapping, on the bottom of a 10 cm Petri dish.Prepare 6 ml of 100 µg/ml Poly-D-Lysine Coating Solution per 10 cm dish by adding the 2.5 mg/ml Poly-D-Lysine Stock Solution to sterile 0.1 M Borate Buffer in the ratio of 400 µl, 2.5 mg/ml Poly-D-Lysine stock to 9.6 ml, 0.1 M Borate Buffer.Mix and sterile filter the 100 µg/ml Poly-D-Lysine Coating Solution.Cover the coverslips with the 100 µg/ml Poly-D-Lysine Coating Solution, place the lid on the Petri dish, and allow the solution to coat coverslips overnight at 4 °C.Sterilize microfluidic devicesWorking in a sterile culture hood, remove devices from packaging.Place devices groove-side up (i.e., upside-down) in a sterile 10 cm Petri dish.Submerse the devices in 100% ethanol for 30 min.Remove ethanol, and submerse devices in 70% ethanol for 30 min.Remove devices from ethanol, and submerse in a dish of sterile cell culture water.Set devices at an angle on the edge of a sterile Petri dish and allow to fully dry in the sterile culture hood.",
    "Place in the Petri dish and cover. Store overnight in a closed container or in the sterile culture hood in the dark, without either UV light or the fluorescent light on.Do not expose the devices to UV light at any time.Day of dissectionPrepare papain solution and inhibitor solutions according to the Recipes below.Place Feeding Media, Seeding Media, the Papain Digestion Solution, and the papain inhibitor solutions in a 37 °C water bath.Place HBSS Dissection Solution on ice. Aliquot approximately 150 ml HBSS to be used at the bench, and 25 ml HBSS to remain sterile for use in the hood.Rinse and dry coverslipsWorking in a sterile culture hood, use sterile forceps to remove coverslips from the Poly-D-Lysine solution and place angled on the edge of a sterile Petri dish to dry.Once dry, dip each coverslip 3 x in sterile culture water to rinse, allowing water to drip off between dips.Dip the coverslip in sterile 1x PBS, let solution drip off, and return to the Petri dish, propped up against the edge of the dish and allowed to dry fully. Do not expose to UV light.Attach microfluidic devices to coverslips and prime with Feeding Media–see Figure 1 for device placement and orientationCarry this procedure out in a sterile culture hood.Using sterile forceps, place a single Poly-D-Lysine-coated coverslip onto the bottom of a sterile 6 cm Petri dish, making sure to have the Poly-D-Lysine-coated side up.Using a second set of sterile forceps, lift a microfluidic device and place it, microgroove-side-down, onto the center of the coverslip. (Figure 1A)Use the blunt end of the forceps to gently press the device onto the coverslip, making sure to gently press out any air bubbles to ensure a tight seal.",
    "Place the lid on the Petri dish to maintain sterility, and examine the device assembly under a light microscope to ensure a tight seal around the microgrooves and feeding reservoirs. Return to the sterile culture hood and prime the device with warmed Feeding Media as follows (Figures 1B and 1C):Add 100 µl of warm Feeding Media to the top-left reservoir. Watch to make sure the media enters and fills the channel connecting the two left reservoirs.Wait 2 min to ensure the media has filled the axonal channel and the microgrooves.Next, add 100 µl of warm media to the top-right reservoir.Wait 2 min to ensure the media has filled the somal channel.Add 100 µl of warm media each to the bottom-left and bottom-right reservoirs.Place the lid on the Petri dish holding the device, and place in a cell culture incubator (37 °C, 5% CO2) for at least 1 h before plating neurons.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190314/20190314233859_4194.jpgFigure 1. Schematic of microfluidic device mounting, orientation, and priming with culture media. A. Placement of microfluidic device on coverslip. B. Device features and orientation. C. Order of media addition to prime device.Primary cortical neuron dissection and cell preparationAt the benchAn E18 pregnant female rat is humanely sacrificed and embryonic rat primary cortices dissected (meninges removed) per established lab methods and according to an approved animal protocol adhering to the requirements of the University of Pittsburgh Department of Laboratory Animal Research (DLAR) and Institutional Animal Care and Use Committee (IACUC). These requirements will vary between institutions. Our methods were adapted from previous work as described by Ghosh and Greenberg (1995), and as previously described by our lab (Arnold et al., 2011). Cell yield varies and is approximately 0.5-1.0 x 106 cells per embryo.",
    "Gently transfer all cortices to a 15 ml conical tube on ice containing 9 ml HBSS dissection media.After the dissections are complete, move to a sterile culture hood to continue the procedure.In sterile culture hoodGently remove HBSS from cortices using a transfer pipette and discard HBSS.Gently wash cortices 3 x using 5 ml cold HBSS for each wash. After each wash, gently remove HBSS from cortices using a transfer pipette and discard.After the last HBSS wash, promptly add 5 ml of pre-warmed Enzyme Solution to the cortices and incubate at 37 °C for 20 min.Remove Enzyme Solution using a transfer pipette and immediately add the pre-warmed Light Inhibitor Solution (10 ml) to cortices for 1 min.Remove the Light Inhibitor Solution using a transfer pipette and immediately add the Heavy Inhibitor Solution (5 ml) to cortices for 2 min at 37 °C.Remove the Heavy Inhibitor Solution using a transfer pipette and gently wash the cortices 3 x using 5 ml of 37 °C Seeding Media for each wash. After each wash, gently remove media from cortices using a transfer pipette and discard.Add fresh 5 ml Seeding Media to the cortices and use a P1000 (1 ml) mechanical pipette and triturate by pipetting up-and-down approximately 20 times to break up the tissue and cell clumps into a homogeneous cell suspension. You may need to triturate for longer (5-10 more times) if the cells are still in clumps, but do not triturate excessively. The cell suspension should look cloudy and there should be no obvious large particles or cell clumps remaining. Alternatively, the cells can be run through a 40 µm sterile cell strainer sieve after the 20-times trituration.Count cellsCombine a 10 µl aliquot of suspended cells with 90 µl of Seeding Media.Use hemocytometer to count cells and calculate cells/ml in suspension.",
    "Plating microfluidic devicesPrimary cortical neurons are plated at 50,000 cells per device for standard 2-compartment microfluidic neuron devices with 450 µm- or 900 µm-width microgroove barriers (Xona microfluidics). To help ensure that the plating doesn’t result in cells being forced through the microgrooves to the axonal, non-cell side of the device, proceed as follows (Figure 2):Adjust cell suspension to 2.5 x 106 cells/ml in Seeding Media. Prepare enough for 20 µl of cell solution per device to be plated. Set aside.Remove the Petri dishes holding mounted microfluidic devices from the incubator, and place them in the sterile culture hood.Remove all of the media used to prime the device from all reservoirs.Add 100 µl of Feeding Media to the top-left reservoir (axonal side) of each device.Add 100 µl of Feeding Media to the connected bottom-left reservoir (axonal side). Wait 1 min for media to equilibrate on the axonal side of the device. (see Notes)On the somal side of the device, add 10 µl of cell suspension to the top-right reservoir (somal side).Note: Place the 10 µl cell suspension at the junction of where the reservoir joins the channel (see Figure 2). Cover the Petri dish holding the device, and examine under a light microscope to ensure that cells are entering the channel between the top-right and bottom-right reservoirs. (see Notes)After 1 min, Add another 10 µl of cell suspension to the connected bottom-right reservoir (somal side).Place the lid on the Petri dish holding the device and return it to the incubator. Allow 10 min for the cells to attach.After 10 min, remove the device from the incubator and return to the sterile culture hood.Gently add an extra 100 µl of Feeding Media to the top-left reservoir (axonal side).",
    "Gently add an extra 100 µl of Feeding Media to the connected bottom-left reservoir (axonal side).Immediately after Step E12, gently add 200 µl of Feeding Media to the cell-side top-right reservoir (somal side). Immediately following, gently add 200 µl of Feeding Media to the connected bottom-right reservoir (somal side). Notes:Be slow and gentle when adding media; adding media forcefully or too fast will wash the cells out of the channel. Now each reservoir on the left has 200 µl of Feeding Media, and each reservoir on the right has 210 µl of Feeding Media. Place the lid on the 6 cm Petri dish holding the device. Place the covered 6 cm Petri dishes holding devices into a 10 cm Petri dish. Up to three 6 cm dishes will fit into one 10 cm dish. Place the lid on the 10 cm Petri dish and return devices to the incubator. This dish-within-a-dish system is used to help reduce evaporation and maintain media levels in the devices during the culture period.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190314/20190314233955_4990.jpgFigure 2. Schematic of seeding neurons into the microfluidic device Feeding maintenance and rotenone treatmentMaintain cellsAfter plating, add 10 µl of Feeding Media to each of the four reservoirs on each device every 3-4 days to maintain media levels. Add warmed media to devices in the sterile culture hood.No media changes occur until the initial treatment.Chronic rotenone and DMSO vehicle treatmentOn day in vitro 7 (DIV7), add the initial treatment with rotenone or DMSO vehicle control, via a ½ media change in both the axonal side and somal side reservoirs as follows: Prepare a 2x concentration of the desired final rotenone concentration in warm Feeding Media (see Recipes for solution preparation).",
    "In parallel, prepare warm Feeding Media with a corresponding 2x concentration of DMSO as a vehicle control (see Recipes for solution preparation).Remove the Petri dish holding microfluidic devices from the incubator.In the sterile culture hood, remove 100 µl of media from each of the four reservoirs on each device.For each device, add 100 µl of the 2x rotenone or 2x DMSO solution to each of the four reservoirs.The final concentration will be 1x rotenone or 1x DMSO throughout the device.Treatments continue for 1-2 weeks with ½ media changes every 3-4 d using 1x concentration media.Prepare a 1x concentration of the desired final rotenone concentration and a 1x concentration of DMSO vehicle control each in warm Feeding Media (see Recipes for solution preparation).Repeat the ½ media change for each reservoir as described above.Fixing neurons (Figure 3)At the end of the experiment, remove media from all reservoirs.Immediately add 100 µl of warm 1x PBS to the top-left and top-right reservoirs.Allow PBS to flow to bottom reservoirs for 1 min.Immediately remove all PBS.Add 100 µl of warm 4% PFA into each top reservoir.Allow cells to fix for 20 min at room temperature.Remove all PFA, and dispose of properly. Add 200 µl of PBS to each top reservoir.Rinse for 5 min.Remove PBS rinse.Repeat PBS rinse 2 x.Fill each reservoir with PBS.Cover device, and store at 4 °C until use for further analyses. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190314/20190314234035_5801.jpgFigure 3. Schematic of fixing neurons in the microfluidic device Reusing microfluidic devicesIn the event that a culture dies before experimental treatments begin, the device was not appropriately mounted and cells entered the non-cell-body side of the device, or the culture is otherwise unusable for experiments, we have found that the device can be reused successfully.",
    "Do not reuse devices that have been exposed to experimental treatments, such as drugs or toxicants (see Notes). Starting from a mounted microfluidic device with an active culture, follow the following steps for device reuse:Remove the media from the device reservoirs using a pipette. Place a finger on the corner of the coverslip, then use forceps to gently grip the edge of the device at a reservoir and gently pull up at an angle until the device is free from the coverslip.Rinse the device gently with distilled water, then place groove-side-up in a Petri dish.Submerge the device in 1x RBS detergent solution. Cover the dish, and gently agitate on a shaker overnight at room temperature.Remove the RBS detergent and wash the device using culture grade water 3 x for 1 h each, with gently agitation on a shaker at room temperature.After the final wash, with the device still submerged in water, examine the device under a light microscope to verify that all cellular debris has been removed from the reservoirs and grooves.Remove the final wash, and carry out the remaining procedure in a sterile culture hood.Transfer the device, groove side up, to a sterile Petri dish, then submerge the device in sterile culture grade water. Cover the dish, and gently agitate on a shaker overnight at room temperature.In the sterile culture hood, remove the device from the sterile wash and either air dry in a sterile culture dish to store for future use, or carry out the sterilization procedure as listed above under Step C2 for immediate use."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}