{
  "id": 13491,
  "origin_website": "Jove",
  "title": "The C. elegans Intestine As a Model for Intercellular Lumen Morphogenesis and In Vivo Polarized Membrane Biogenesis at the Single-cell Level: Labeling by Antibody Staining, RNAi Loss-of-function Analysis and Imaging",
  "procedures": [
    "1 . Labeling the C. elegans intestine\nNote: See the accompanying paper by the authors on the analysis of excretory canal tubulogenesis2 for the construction of tissue specific fluorescent marker plasmids and the generation of transgenic animals, including discussions on transcriptional and translational fusion proteins (the latter required for the subcellular localization of a molecule of interest). These procedures can be adapted by using specific promoters to drive the molecule of interest to the intestine. See Table 1 for examples of molecules proven useful for visualizing C. elegans intestinal endo- and plasma membranes and their junctions, Table 2 for examples of promoters for driving expression to the intestine, and Table 3 for resources for more comprehensive collections of intestinal markers and promoters.\nAntibody staining of the C. elegans intestine27,28\nFixation\nTake a clean glass slide and use poly-L-lysine to generate a thin film for worms to stick on. Place 30 µL 0.1-0.2% poly-L-lysine on the slide and place a second slide on the poly-L-lysine drop to make a \"sandwich\". Then rub the slides gently a few times to wet the entire surfaces of both and let them air dry for 30 min. Label the frosted side of the slides with pencil.\n\t\t\tNote: 0.2% poly-L-lysine aliquots of 200 µL were made by dissolving the powder in dH2O; this can be stored at -20 °C. Use high molecular weight poly-L-lysine for improved sticking of the worms. The concentration of poly-L-lysine is also critical. Too low concentrations will not allow worms to stick but too high concentrations may generate fluorescence background signal. A too thick film may loosen up in its entirety.\nPlace a flat metal block firmly on the bottom of a container (e.g. a polystyrene container) filled with liquid nitrogen.",
    "NOTE: One can use dry ice instead, but liquid nitrogen keeps a metal block more stable on the container bottom and chills well.\nCollect worms either by washing them off their plates with M929 or pick different stage worms (either eggs, L1, L2, L3, or L4 larval stage worms) onto each slide. Typically, pick ~100 larvae and embryos or ~20 adults to each slide. Place 10 µL washed off worms onto the middle of the slide or pick eggs/worms into 10 µL M9 or 10 µL 1x PBS27 (phosphate buffered saline).\n\t\t\t\nUse a pipette to spread out large numbers of worms to avoid clumping.\n\t\t\t\tNote: Mixed populations of washed off worms, due to crowding and different thickness of stages, do not stick well and are less effectively freeze-cracked (see below), therefore picking stage-specific worms (or synchronized populations) gives superior results. Larvae stick better than adults and more animals can be placed per slide.\nBefore picking worms onto slides, transfer them to a Nematode Growth Medium (NGM) plate29 without OP50 bacteria. Excess bacteria adherent to the worms can also interfere with sticking. Take care that worms do not dry out.\nGently place (drop) a 22 mm × 22 mm coverslip cross-ways on top of the collected worms such that its edges hang over on at least one side of the slide. Press straight down gently but firmly with one or two fingers on the coverslip. Avoid shearing that will damage tissue integrity.\nImmediately and gently transfer the slide to the metal block in liquid nitrogen and let it sit for about 5 min to freeze. Then \"flick off\" the coverslip in one swift move by using the overhanging edge.",
    "Note: This step must be done decisively and while the slide is frozen to achieve \"cracking\" of the cuticle. Caution: Please follow the PPE (Personal Protection Equipment) guidelines when working with liquid nitrogen.\nImmerse the freeze-cracked slides into a methanol-filled glass Coplin jar for 5 min at -20 °C. Then transfer to an acetone-filled glass Coplin jar for another 5 min at -20 °C.\n\t\t\tNote: Methanol and acetone should be stored in -20 °C for at least 30 min before use. After fixation, slides can be stored at -20 °C. CAUTION: methanol and acetone are toxic.\nRemove slides from jar and let them air dry at room temperature (RT) before use.\nStaining\nSurround area of fixed worms with a thin layer of petroleum jelly on the slide. Draw a circle around this area on the underside of the slide to mark the spot.\n\t\t\tNote: It is critical that the jelly circle remains intact throughout the staining procedure to prevent leakage of the staining solutions.\nPrepare a \"wet chamber\" in a plastic bin with lid by placing wet paper towels into it. Place the slide onto a rack in this \"wet chamber\" to prevent the drying of the slides during staining.\n\t\t\tNote: Slides should not be in contact with water or with each other.\nGently pipette approximately 50 µL 1x PBS into the jelly circle, enough to cover the area. Close the \"wet chamber\" with the lid. Incubate at RT for 5 min.\n\t\t\tNote: To avoid losing worms at this step, do not pipette PBS directly onto the worms. Gently place pipette tip at the edge of the circle and allow fluid to smoothly disperse over the worms.",
    "Tilt the slide and slowly aspirate the PBS with a pipette. Place the slide back flat onto the rack and add 50 µL (or the required amount to cover the spot) blocking solution carefully. Incubate this in the wet chamber at RT for 15 min. While waiting, dilute the primary antibodies in blocking solution (see Table of Materials for examples of primary antibodies and concentrations).\nNote: Freshly prepare blocking solution using 1x PBS (10 mL), 10% tween (50 µL), and powdered milk (0.2 g). The amount of detergent and concentration of milk may vary depending on antibodies used and may need to be empirically determined. Aspiration of fluid from the slide is another step to easily lose worms. Check progress by examining the slide under the dissecting scope, but take care that the slide does not dry out.\nTilt the slide and aspirate away the blocking solution, using the same precautions as described above. Place slide back flat onto rack and slowly add 50 µL diluted primary antibody, using the same precautions. Close the \"wet chamber\" and incubate at 4 °C overnight or for shorter periods at RT.\n\t\t\tNote: Incubation time may need to be empirically determined for a specific antibody.\nAspirate off the primary antibody solution as done for the other solutions. Then wash the slides with blocking solution for 10 min, 3 times, adding and removing the solution in the same fashion as described above.\nAdd secondary (fluorescently-labeled) antibody diluted in blocking solution, incubate at RT for 1 h. See Table of Materials for examples of secondary antibodies and concentrations.\nRemove the secondary antibody and wash, as above, with blocking solution 2 times and, to clear off the blocking solution, with 1x PBS, for 10 min each.",
    "Aspirate away as much PBS as possible without permitting the specimen to dry out and carefully remove the jelly around the specimen.\nAdd one drop mounting medium onto the specimen, and place a coverslip gently on top. Seal the edges of the coverslip with nail polish. Place slides in a dark slide box to preserve staining and store in 4 °C.\n\t\t\tNote: Keep slides in the dark because of light sensitivity (fluorescence may fade with time) and prevent air exposure by keeping them sealed, for the same reason. Slides may be stored for extended periods of time at 4 °C or -20 °C.\n2. Interference with the function of essential tubulogenesis genes in the C. elegans intestine. Example: RNAi.\nNote: C. elegans strains are cultured on OP50 bacteria seeded on NGM plates according to standard protocols29. For RNAi, C. elegans feed on HT115 RNAi bacteria on RNAi plates supplemented with 25 µg/mL carbenicillin and 2 mM IPTG (isopropyl beta-D-1-thiogalactopyranoside) for induction of the bacterial promoter that generates the double stranded RNA (dsRNA) from the introduced C. elegans gene. Antibiotics and IPTG concentration may vary according to RNAi clone/library and desired RNAi strength, resp. Specific RNAi clones can be obtained from commercially available genome-wide RNAi feeding libraries (see (26,30,31) for background on feeding RNAi in C. elegans and Table of Materials for materials/reagents and RNAi libraries).\nStandard RNAi by feeding26,31\nTake out RNAi library plate from -80 °C and put it on dry ice. Remove the sealing tape and use sterile pipette tip to transfer adherent bacteria of clone of interest to LB (Luria Broth) agar plates29 supplemented with 100 µg/mL ampicillin and 15 µg/mL tetracycline. Streak out bacteria onto agar plate. Seal the RNAi library plate with a new sealing tape. Grow the bacteria overnight at 37 °C.",
    "Note: These agar plates can be stored at 4 °C for several weeks. New bacteria can be cultured directly from them to protect the original RNAi library.\nNext day, inoculate RNAi bacteria from LB agar plate into 1 mL LB liquid medium29 containing 50 µg/mL ampicillin each and shake for 14 (8-18) h or overnight at 37 °C.\n\t\tNote: For optimal results use fresh bacteria each time. See reference (30) for comparison of different culture conditions (e.g. timing of culture).\nNext day, seed 200 µL per clone of the cultured RNAi bacteria on separate RNAi plates. Let the plates dry and leave at RT overnight for induction of the bacterial promoter.\nTransfer 4 - 6 L4-stage larvae onto each RNAi plate. Incubate the seeded RNAi plates at RT or 22 °C for 3-5 days.\nNote: Pick L4 larvae first onto an NGM plate without bacteria to remove adherent OP50 that will interfere with RNAi, or serially transfer them to a new NGM plate without OP50 three times. Make sure strains are not contaminated, as contaminating bacteria - like OP50 preferred food for the worms - will also interfere with RNAi. Adjust temperature as needed: e.g. development accelerates with higher temperature; strains may be temperature sensitive.\nFor developmental studies, check phenotypes of the F1 progeny from day 2 onwards.\n\t\tNote: It is critical to check animals frequently to avoid missing the appearance or progression of a phenotype (e.g. marker displacement) when assessing polarized membrane biogenesis during development. Enrichment of the F2 population for strong phenotypes (e.g. by picking parent hermaphrodites to a new RNAi plate on day 2 to select for the most strongly affected mid portion of their progeny) is rarely necessary, since a spectrum from mild to strong phenotypes is desirable.\nConditional RNAi",
    "NOTE: RNAi conditions can be modified to reduce severe, or increase mild effects, or to interfere stage-specifically; modifications are helpful for the full evaluation of phenotypic effects of the often lethal tubulogenesis genes.\n\t\nLarval RNAi - evaluation of RNAi effects in the same generation (mild, stage-specific RNAi)\n\t\tNote: To overcome sterility or embryonic lethality, or to disrupt gene function at a specific stage post embryogenesis, RNAi is induced in larvae, post embryonically. Either place untreated eggs (2.2.1.1), gravid adults (2.2.1.2) or synchronized L1 (or, if desired, later stage) larvae (2.2.1.3) on RNAi plates; evaluate the RNAi effects in the same generation, e.g. two days later and onwards, in larvae and/or adults.\n\t\t\nPick 30-50 gravid adults into one drop bleaching solution (a 1: 4 solution of 10 M NaOH and household sodium hypochlorite) placed to the edge of an RNAi plate. Let dry and allow L1s to hatch and move into the bacterial lawn.\n\t\t\tNote: Bleaching solution, generally used for decontamination, will kill everything but embryos in their egg shells. Therefore, do not place the bleaching solution onto or close to the RNAi bacteria.\nPick or seed ~20 young gravid adults on RNAi plate and let them lay eggs for 2-3 h, or until there are around 300 eggs on the plate, then pick off the adults.\n\t\t\tNote: This method may cause contamination of the RNAi bacteria by OP50. To reduce this risk, first transfer adults onto a NGM plate without bacteria to remove OP50 adherent to the worms. Take care that adults do not stay too long on RNAi plates to avoid RNAi effect on embryos.\nPick or place L1 stage worms directly on RNAi plates (see reference (29)-for synchronization protocols).",
    "Note: One can use an abbreviated synchronization protocol (e.g. for a moderately large scale set-up) by washing worms from densely populated plates with M9 for several times until only eggs remain. After 2-3h hatching L1s can then be collected in M9 from these plates, cleaned by additional washes to remove bacteria (3x in M9), and seeded onto RNAi plates.\nDilution of RNAi bacteria with empty vector RNAi bacteria (mild RNAi)\n\t\tNote: Reduction in the amount of dsRNA by diluting the amount of RNAi bacteria may suffice to induce milder effects and may also reduce embryonic lethality without abolishing all embryonic effects. Dilution of RNAi bacteria is also used for double RNAi experiments and to titrate conditions for genetic interaction experiments (e.g. to generate mild effects for the assessment of enhancement and strong effects for the assessment of suppression).\n\t\t\nGrow up RNAi and empty vector HT115 RNAi bacteria in 1 mL LB medium with 50 µg/mL ampicillin, as done for standard RNAi conditions.\nDilute the RNAi bacteria with empty vector RNAi bacteria to achieve a range of different concentrations, for example, of 5%, 15%, 30%, 50%, 70%. Mix the bacteria well by pipetting up and down. Pipette 200 µL mixed bacteria onto an RNAi plate.\nPick 4-6 L4 larvae on each RNAi plate. Check the phenotype from day 2 onward.\nRNAi sensitive strains (strong RNAi)\nUse available RNAi-sensitive strains, for example, eri-1 (mg366), rrf-3 (pk1426) or eri-1 (mg366) lin-15B (n744) (the latter supersensitive), and follow standard RNAi procedures described in 2.131,32,33.\n\t\t\tNote: RNAi sensitive strains (e.g. rrf-3and eri-1) may have lower brood sizes than wild-type animals and be sterile at 25 °C. They may also have a low background of own phenotypes, e.g. low penetrant embryonic lethality, which has to be taken into account when evaluating specific RNAi effects.",
    "3. In vivo imaging of the C. elegans intestine by fluorescence dissecting microscopy\nBefore visualizing animals under the fluorescence light, check RNAi plates under bright light on any dissecting microscope. Assess (and potentially record) phenotypes visible under bright light that may affect the analysis, such as lethality, sterility (lower number of progeny), developmental (e.g. larval arrest) and other visible phenotypes that may help characterize the function of a gene involved in polarized membrane biogenesis and lumen morphogenesis.\n\tNote: Only score plates that have sufficient progeny for evaluation (at least 50), otherwise try alternative RNAi conditions. For quantitative evaluation make sure that plates are not contaminated or grow OP50 (that interfere with RNAi).\nTo visualize animals under fluorescent light, remove the lid and place the RNAi plate directly under the dissecting fluorescence microscope.\n\tNote: To detect subtle intestinal phenotypes one will need a dissecting microscope with a higher power stereo fluorescence attachment that allows for a sufficient range of magnification. This protocol describes the use of a scope with a 1.5 and 10 x objective and a zoom range from 3.5 to 45.\nFirst find animals under bright light to focus. Next, examine animals under fluorescent light at low magnification (e.g. under the 1.5x objective), using the appropriate filter. Examine plate systematically from upper left to lower right to scan entire plate for phenotypes.\nSelect animal of interest and change to 10x objective. Focus on the intestine and use zoom to assess tubulogenesis/lumen morphogenesis phenotype. See section 5 for scoring of phenotypes. First, take images at low magnification. Then switch to high magnification.",
    "Note: Since healthy animals move fast, work swiftly, with one hand on computer mouse for image acquisition while focusing the microscope with the other hand. Slowing animals (e.g. by transient placement of the plates to 4 °C) may not be required when working with tubulogenesis phenotypes in mostly arrested embryos and early larvae. The images can be captured by a microscope-mounted CCD camera and image capture software.\n4. Imaging the C. elegans intestine at higher resolution by laser scanning confocal microscopy 34,35\nMounting and immobilization\nUse fingertip to thinly spread a small amount of grease or petroleum jelly in a circle on a glass slide (~6-8 mm in diameter).\n\t\tNote: Thickness of grease circle is critical for mounting. For best imaging results, image only one or several larvae at a time and use an ultrathin grease circle with as little liquid as possible such that the animal is directly stuck between the glass slide and cover slip (if done perfectly, animal will be immobilized without anesthetic). Mounting of eggs and of older animals require a somewhat thicker circle to avoid destruction of sample when adding cover slip.\nAdd a drop of typically 3.5 µL 10 mM sodium azide solution into the middle of the circle and pick worms into it under the dissecting microscope.",
    "Note: Prepare a 1 M sodium azide stock solution by dissolving 65.01 mg NaN3 in 1 ml dH2O; add 200 µL of this 1M solution into 20 mL M9 buffer. Pick worms swiftly into drop of sodium azide solution to avoid solution to dry out. Pick stages separately for optimal mounting, aiming at about 50 embryos per slide and about 20 larvae when examining larger populations. One can use M9 instead of sodium azide solution when picking embryos. If using sodium azide, animals must be imaged within 30 min to avoid tissue damage of this toxic chemical.\n\t\tCAUTION: sodium azide is toxic.\nGently place a 22 mm × 22 mm coverslip on slide. Be careful not to crush the worms. Use mild pressure and check under dissecting microscope to make sure the worms are fixed well between slide and cover slip. Label the slide.\n\t\tNote: The correct amount of pressure is critical to avoid damaging the specimen (too much pressure) and not fixing it well (too little pressure: animals float instead of sticking to the slide). Floating animals essentially preclude appropriate imaging.\nImaging\nPlace slide under the confocal microscope.Search for worms with 10x objective and focus.\n\t\tNote: Use bright light to focus where possible to avoid photobleaching.\nChange to 60x or 100x objective and focus on the intestine.",
    "NOTE: The intestine can be easily identified under bright light by its lumen running through the middle of the animal, from the pharynx to the anus near the tip of the tail. Be careful when applying oil for the 60x or 100x oil objective. Mixing different types of oils may interfere with further imaging. Place small drop of oil onto slide when using an upright microscope or onto the objective when using an inverted scope, taking care not to contaminate other objectives or parts of the microscope.\nEstablish Kohler DIC/Nomarski illumination for the objective to be used for scanning36. Inspect animal under fluorescent light with appropriate channel to check labeling of the intestine and/or to check phenotype, in order to select suitable specimen for imaging. Work swiftly to avoid bleaching.\nSwitch to laser scanning to restrict prospective image to the intestine by setting scanning boundaries at its dorsal and ventral side.\n\t\tNote: Bracketing the intestine in this way is critical if fluorophore also labels structures outside the intestine. During this pilot scan, work with fast scanning conditions to avoid photobleaching.\nStop scanning to select scanning parameters for the experiment. Set 6-20 sections for intestinal scanning along the z axis, e.g. at 0.2 µm intervals, depending on inquiry, stage of animal and/or technical considerations. Set frame averaging per image depending on complexity of labeling and required resolution to reduce noise.\n\t\tNote: Setting details vary depending on microscope and experiment. One may need to reduce the amount of sections to avoid bleaching if performing sequential scanning of three different fluorophores. Adjust number of frames to number of sections (should be lower than number of sections to avoid image distortion; also weigh in the increase in photobleaching). 4-6 frames are usually sufficient.",
    "Go back to scanning with definitive (slow) laser scanning conditions and adjust: brightness (use minimum gain to reduce background); laser power (as high as required, as low as possible - increases photobleaching; usually minimum setting is adequate); pinhole (avoid opening if not required, to maintain resolution).\n\t\tNote: Scanning conditions depend on specimen and need to be empirically determined at the beginning of the scanning session. Make sure that brightness does not exceed saturation (will limit ability to modify image subsequently by imaging software). When setting scanning conditions, also consider that identical conditions must be used for all imaging in experiments that compare experimental animals with controls.\nCapture image series. Merge images into a single projection image.\n\t\tNote: May have to save projection images and/or overlays separately depending on microscope.\nWhen taking multi-channel images use sequential scanning to avoid bleed-through between channels (critical for co-localization studies).\n\t\tNote: Image settings may need to be changed given increased photobleaching connected to longer scanning time.\nAlways acquire corresponding DIC/Nomarski images (sections) for landmarks and overall state of morphology of scanned animal.\n5. Quantification of polarized membrane biogenesis defects in the C. elegans intestine\nNote: Example: Basolateral displacement of apical ERM-1::GFP and ectopic lateral lumen formation induced by let-767and aps-1RNAi.\nScoring phenotypes under the dissecting microscope (Figure 5 A, D, E)\nDefine categories for scoring. Example: (i) wild-type (WT), (ii) basolateral displacement of ERM-1::GFP (polarity defect), and (iii) ectopic lumen formation (develops subsequent to basolateral displacement).",
    "NOTE: A low magnification visual analysis lends itself to scoring numbers of animals with or without a specific phenotype. Here, we selected an example of three qualitatively different phenotypic categories that are at the same time indicative of a worsening of the polarity phenotype that is analyzed. However, a variety of different qualitative and quantitative phenotypes can be scored, such as lumen morphogenesis defects, absence/presence (or numbers) of GFP positive cytoplasmic vacuoles, lumen diameter and size or numbers of intralumenal cysts (see Figure 3 for examples).\nDepending on magnitude of expected differences, score approximately 100 live worms on their agar plates under the dissecting microscope in a duplicate or triplicate set of experiments.\n\t\tNote: One must score every animal that comes into view when scanning plates systematically, e.g. from upper left to lower right of the plate (make sure worms have populated plates evenly).\nRepeat this for 3 independent sets of experiments. Generate bar graph and evaluate significance of results.\nScoring phenotypes under the confocal microscope (Figure 5 B)\nDefine categories for scoring, e.g. number of ectopic lumens per animal\n\t\tNOTE: A higher magnification visual analysis lends itself to scoring a quantifiable marker or phenotype per animal and allows scoring of subcellular markers that may not be discernible by dissecting microscopy. The present example of counting ectopic lumens per animal in a subset of worms of the same experiment previously evaluated by dissecting microscopy (5.1.1, category 3) refines the evaluation of the worsening polarity phenotype that is examined here. However, a variety of other phenotypes or parameters can be scored, e.g. number of vesicles, presence/absence or number of subcellular components that co-localize, fluorescence intensity (the latter quantified by ImageJ; see accompanying paper on the excretory canal)2.",
    "Depending on magnitude of expected differences, quantify phenotypic marker (here, ectopic lumens) in approximately 20 animals in a duplicate or triplicate set of experiments under the confocal microscope.\nRepeat for 3 independent sets of experiments. Generate bar graphs and evaluate significance of results.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}