{
  "id": 17714,
  "origin_website": "Jove",
  "title": "Biventricular Assessment of Cardiac Function and Pressure-Volume Loops by Closed-Chest Catheterization in Mice",
  "procedures": [
    "All experiments were performed in accordance with Queen’s University biosafety and ethical guidelines (ROMEO/TRAQ#6016826). The procedures followed were performed in accordance with institutional guidelines. This is a terminal procedure. Due to the invasiveness of the right and left catheterization, the animals should be euthanized immediately after data acquisition. Euthanasia should be performed according to the institution’s animal studies guidelines.\n1. Experimental preparation and setup\nPut the catheter in a 10 mL syringe with saline/heparin, at room temperature 30 min before starting the experiment (Figure 1A).\nAfter 30 min, calibrate the catheter (e.g., baseline and acquisition system) according to the manufacturer's recommendations. The acquisition system displays high and low calibration values that are used to calibrate the acquisition system before starting an experiment. Output these values and make sure that they match.\n\t\nUse the button “Pressure Balance Control”, “Coarse +/- “, or “Fine +/-“ to set up the baseline pressure value at zero.\nPerform a two point calibration for high and low signal.\n\t\t\nOn the control console press “System Setting” in the “Catheter Menu”.\nPress “Send Calibration Signal” in the “System Setting Menu” to send the low signal. Ensure that the pressure, volume, phase, and magnitude are at 0 mm Hg, 0 µL, 0˚, and 0 µs respectively.\nPress “Enter” to send the high signal. Ensure that pressure, volume, phase, and magnitude are at 100 mm Hg, 150 µL, 20˚ and 5,000 µs respectively.\nPress “Enter” to return to the “System Setting Menu”.\nPress “6” to return to the “Catheter Menu”. Then press “Acquire Data”.\nBend a 30 G needle to approximately 90˚ (Figure 1B,C). This bent needle will be used to puncture the jugular and carotid vessels.\n2. Anesthesia and body temperature control",
    "Place the mouse (28 g, C57BL/6 in this protocol) into an anesthesia chamber containing anesthetic gas (i.e., oxygen 100%, isoflurane 3–4% for induction).\nWhen the animal is anesthetized, not responding to paw or tail pinch, place the mouse supine on the heating pad set at 37 ˚C.\nConnect the mouse to the respirator through a nose cone providing a mixture of 100% oxygen and 2% of isoflurane. To automatically calculate the recommended ventilation settings, enter the animal’s weight into the ventilator’s proprietary software using the touch screen. The calculations use the following formula:\n\tTidal volume = 6.2 x animal mass1.01 (kg),\n\tRespiration rate = 53.5 x animal mass-0.26 (kg).\nTurn on the anesthetic line from the anesthesia chamber to the nose cone.\nInsert the temperature feedback probe into the rectum, and the pad probe between the pad and the back of the mouse, setting the desired body temperature to 37 °C–37.5 °C. Control the animal’s temperature on the monitor screen (Figure 2A,B).\nTape down the front paws and one distal paw of the mouse to the heating blanket using surgical tape, leaving one hind paw free to monitor the depth of anesthesia.\n3. Surgical Site Access\nPerform a 2 cm H-shape ventral midline cervical incision from the manubrium to the level of the hyoid bone.\n\t\nReflect the skin away from the underlying muscles. If needed, these muscles can be excised for better visualization. \nGently move the submandibular gland aside.\nDissect the cervical soft tissue and expose the sternocleidomastoid and the sternohyoid muscle with forceps using the blunt dissection method.\nSplit the fascia in the middle, overlying the paired sternohyoid. Allow the paired sternohyoid to retract laterally to expose the trachea. Be careful to not damage the carotid arteries and the vagus nerves, which run alongside the trachea.",
    "Pass forceps underneath the trachea to elevate it. Then, pass a 4.0 surgical silk suture underneath the trachea and make a potential knot in the middle of the suture, which will later be tightened to secure the endotracheal tube (Figure 3A).\nUsing scissors, make a small cut between the cartilage rings of the trachea below the level of the larynx. Insert the endotracheal tube (Figure 3B).\nConnect the tracheostomy tube to the respirator and begin ventilation with 100% oxygen and 2% isoflurane. Tighten the knot around the trachea to secure the endotracheal tube and tape the respirator tubing to the operative table. Ensure that the trachea is not obstructed or collapsed (Figure 3C).\n4. Right jugular and right carotid isolation\nRight carotid isolation\n\t\nUsing blunt dissection, displace the sternohyoid muscle laterally to expose and isolate the right carotid artery.\nIsolate the carotid artery from the vagus nerve by blunt dissection using forceps.\nPass three surgical sutures (4.0) underneath the carotid artery, excluding the vagus nerve.\nRight jugular vein isolation\n\t\nDisplace the submandibular and parotid gland laterally to visualize the right jugular vein. Bluntly dissect and expose the right jugular vein using forceps. Carefully dissect the vein and remove the surrounding fascia.\nPass forceps underneath the jugular vein.\nPass one surgical suture underneath the jugular vein, then tie it at the cranial side of the vein. Apply gentle traction on this suture in the direction of the head using a hemostatic clamp.\nPass two additional sutures underneath the jugular vein. Gently pull the most distal suture in a caudal direction using a hemostatic clamp. Make a loose, potential knot in the middle suture.\nPut several drops of warmed, physiological saline on the vessel at the site of anticipated venotomy.\n5. Surgical procedures for right ventricular and left ventricular catheterization",
    "Right ventricular catheterization (Figure 4 A–D).\n\t\nUsing the stereomicroscope, identify the jugular vein.\nGently apply superior traction on the vein. Perform a venotomy by inserting a 30 G curved needle between the cranial suture and the middle suture. Insert the needle at a 140˚ angle relative to the vein to ensure it enters in a coaxial manner.\nWhen inserted, dilate the venotomy by moving the needle. Insert the catheter tip in the venotomy, underneath the needle. Then gently tie the middle suture, securing the catheter.\n\t\tNOTE: Take extreme care not to tie the suture too tightly, because excess force can damage the catheter.\nRelease the caudal suture, and advance the catheter into the right ventricle, detecting the classical right ventricular pressure waveform on a continuous monitor.\nStabilize the right ventricular pressure. Ensure the correct positioning of the catheter in the right ventricle to generate an optimal PV loop.\n\t\t\nStabilize the magnitude, which reflects the blood and muscle, to generate pressure-magnitude loops (i.e., Y axis pressure, X axis magnitude). If required, gently rotate the catheter shaft to achieve optimal placement of the catheter along the axis of the right ventricle.\n\t\t\tNOTE: The maximal phase value, which reflects the muscle, should be below 7°.\nWhen the pressure-magnitude loop signal is optimal, press “Enter” on the console during the acquisition to perform a baseline scan. Ensure that the heart rate reported on the monitor screen in beats per minute (bpm) is in a physiologic range (i.e., 400–600 bpm).\nGenerate the PV loops. Change “Magnitude” to “Volume” as a parameter for the X axis and keep the pressure as the Y axis. When the PV loops signal is optimal, record for 30 s.",
    "Stop the recording. Pull back the catheter and gently wipe with gauze. Put the catheter in heparin/sodium chloride solution and tie the caudal suture to stop bleeding from the jugular vein.\nLeft ventricular catheterization (Figure 5 A–D).\n\t\nGently elevate the right carotid, which was previously isolated (5A) by sliding curved forceps underneath the artery.\nTie the previous suture, thereby occluding the artery. Then, gently apply cranially directed traction using a hemostatic clamp.\nPull the most distal suture in a caudal direction using a hemostatic clamp. Make a loose potential knot on the middle suture.\nPut several drops of warmed, physiological saline on the vessel at the site of the anticipated arteriotomy. Focus on the cranial section, between the caudal and the middle suture, using the stereotaxic microscope.\nGently apply superior traction on the artery. Perform an arteriotomy, by inserting a 30 G curved needle between the cranial suture and the middle suture. Insert the needle at 140˚ relative to the artery to ensure it enters in a coaxial manner.\nInsert the catheter tip into the arteriotomy and then tighten the middle suture to secure the catheter. Simultaneously, release the distal suture and advance the catheter into the aorta to start recording. Ensure that the pressure channel shows a typical aorta trace.\nAdvance the catheter retrograde across the aortic valve into the left ventricle. Entry into the left ventricle will be evident from the sudden marked drop in diastolic pressure from the aorta.\nStabilize the left ventricular pressure. Ensure the correct positioning of the catheter in the left ventricle to generate an optimal PV loop.",
    "Stabilize the magnitude, which reflects the blood and muscle, to generate pressure-magnitude loops (i.e., Y axis pressure, X axis magnitude). If required, gently rotate the catheter shaft to achieve optimal placement of the catheter along the axis of the left ventricle.\n\t\t\tNOTE: The maximal phase value, which reflects the muscle, should be below 7°.\nStop the recording. Pull back the catheter and put it in heparin/sodium chloride solution. Then tie the caudal suture.\nClean the catheter with an enzymatic detergent (e.g., endozime).\n\t\tNOTE: After the surgery, euthanize the animal according to the institution’s animal studies guidelines. \n6. Data analysis \nPerform the PV loop analysis according to established recommendations.\n\t\nSelect the optimal pressure-volume trace (ideally an entire, stable 30 s recording). On the software, click “Advance”, click “Loops”, and then click “Offline Calculation”.\nSelect volume as a volume channel and pressure as pressure channel.\nFor consistent results a minimum of 20 loops is necessary."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}