{
  "id": 11065,
  "origin_website": "Jove",
  "title": "Isolation and Characterization Of Chimeric Human Fc-expressing Proteins Using Protein A Membrane Adsorbers And A Streamlined Workflow",
  "procedures": [
    "1. Verify the Affinity for Protein A\nVerify that the Fc-expressing protein (recombinant fusion protein or IgG antibody, heretofore referred to as \"protein\") has acceptable affinity for protein A14-17 prior to using the protein A membrane adsorber, and test for the presence of the protein in the stock solution (e.g. cell culture supernatant clarified by centrifugation at 1,000 x g for 5 min to pellet suspended cells). Use flow cytometry, Western blotting, ELISA, etc. to detect protein function and/or presence of Fc, based on lab preference. Ideally, quantify the protein in the cell culture supernatant (step 6) to avoid exceeding protein A membrane adsorber capacity. Proceed if protein is detected.\n2. Prepare Protein A Membrane Adsorber and Cell Culture Supernatant\nFollow the manufacturer's instructions for preparing the membrane adsorber. Never let air enter the membrane adsorber. All solutions perfused through the membrane adsorber should be at room temperature and prefiltered using a 0.22 µm filter. Fill a 10 ml syringe with 0.22 µm-filtered Dulbecco's phosphate buffered saline (DPBS) or buffer of choice and discharge air bubbles. Perfuse DPBS to remove the storage solution and to equilibrate the membrane adsorber immediately before use.\nFilter the cell culture supernatant immediately before perfusion through the membrane adsorber, using a vacuum-driven 0.22 µm sterile filtration unit.\n3. Load the Protein A Membrane Adsorber\nAspirate cell culture supernatant into a Luer Lock syringe (30 ml or larger), and discharge any air bubbles.\nAssemble materials and equipment as shown in Figure 1. Connect the syringe to the inlet of the membrane adsorber. Attach flexible tubing to the membrane adsorber outlet. If desired, place a 0.22 µm syringe filter between the syringe and the membrane adsorber. Use a flask or bottle to catch flow through (also known as filtrate), from the adsorber.",
    "Set the syringe pump to the desired volumetric flow rate, but do not exceed the manufacturer's recommended flow rate (e.g. 10 ml/min). Perfuse the cell culture supernatant through the membrane adsorber, collecting flow through in a beaker or other container. Reload the syringe with supernatants needed.\nIf desired, test the flow through for the presence of protein using flow cytometry, Western blotting, ELISA, etc. based on lab preference. It is typically unnecessary to reperfuse the flow through.\n4. Elute Protein from the Membrane Adsorber\nWash the membrane adsorber with 10 ml DPBS to remove any nonbound protein.\nElute protein from the membrane adsorber at the desired flow rate (e.g. 1 ml/min) using 10-15 ml of elution buffer (e.g. amine-based elution buffer (pH 2.8)). Catch eluate in a tube containing neutralizing buffer (e.g. 1 M Tris (pH 9.4)) at 10% of elution volume (1.0-1.5 ml).\nAlternatively, elute protein in one ml increments into tubes containing 100 µl of neutralization buffer, using a total volume of 10-15 ml elution buffer. Use the preferred characterization method to test each fraction for the presence of protein.\nRegenerate the membrane adsorber according to the manufacturer's instructions. Perfuse 10 ml of 0.22 µm-filtered DPBS or buffer of choice, then 10 ml of 0.22 µm-filtered 50 mM NaOH in 1 N NaCl, and finally 10 ml of 0.22 µm-filtered DPBS. Fill the membrane adsorber with 20% ethanol in DPBS for long-term storage at 4 ºC.\n5. Concentrate and Dialyze the Protein\nDeposit all eluate (or elution fractions containing protein as determined in step 4.3) in a 10 kDa molecular weight cut-off centrifugal filter unit. Follow the manufacturer's instructions for centrifugation.",
    "Dialyze the retentate in a small volume dialysis unit (10 kDa molecular weight cut-off) against the buffer of choice, following the manufacturer's instructions. Buffer may need to be added to dialyzed material if protein precipitation is a concern. If desired, the dialyzed material can be refrigerated until step 6 can be performed, but long term storage without preservatives is not recommended.\n6. Quantify and Characterize Purified Product in an Expedited Western Blotting Procedure\nResolve purified protein and Fc standards on the gel of choice by SDS-PAGE, under reducing or nonreducing conditions as desired18-20. Use a mini gel rather than midi gel to minimize run time.\n\t\t\nIf not already known, determine the Fc standards range over which band signal varies linearly with respect to quantity of loaded (e.g. 0.1-1 mg). Use the same gel, running conditions, transfer conditions, and reagents that will be used to quantify and characterize purified protein.\nLoad multiple sample amounts of purified protein, including samples diluted with DPBS, to ensure that the purified protein band signals are within the linear signal range of Fc standards in image analysis.\nTransfer proteins from the gel to a polyvinylidene fluoride (PVDF) membrane in a discontinuous buffer system using a semidry blotter13, following the blotter manufacturer's instructions. Transfer time is typically 5-10 min. If desired, Coomassie stain the gel after transfer to verify transfer efficiency21.\nPerform immunoblotting with anti-Fc or anti-IgG conjugated to alkaline phosphatase (AP) or horse radish peroxidase (HRP), based on lab preference, using a vacuum-assisted protein detection system. Immunoblotting time is typically less than 1 hr.\nDevelop immunoblot using the substrate and method of choice (e.g. AP substrate and enhanced chemiluminescence).",
    "Quantify purified protein by image analysis. Perform a linear regression on the band signals from Fc standards. If R2>0.90, use the equation for the line to calculate protein quantity from its band signal(s). Account for sample dilution if necessary. Since quantification of the protein is performed on the basis of Fc, adjust the value for molecular weight differences between the protein and Fc. If R2<0.90, repeat step 6 in its entirety.\nValidate protein using functional assays or methods to detect Fc via flow cytometry, Western blotting, ELISA, etc. based on lab preference.\nDilute protein to desired concentration and/or add any desired preservatives or stabilizers to the purified protein solution before aliquoting for long-term storage, frozen or otherwise.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}