{
  "id": 2359,
  "origin_website": "Cell",
  "title": "In situ detection of protein-protein interaction by proximity ligation assay in patient derived brain tumor stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBrain tumor stem cell (BTSC) culture and maintenance\nTiming: ∼1 h\nThis section describes the passaging and maintenance of BTSC spheres. Incubation and growth time may vary depending on the number of cells required for a specific assay or experiment.\nMaintain patient derived BTSCs in 5% CO2 at 37°C in BTSC growth medium and in T-75 culture flasks for cells in suspension as spheres.\nCollect BTSC spheres by gently mixing the flask to ensure collection of as many spheres as possible, and transfer the content to a 15 mL falcon tube using a 10 mL pipette.\nCentrifuge for 10 min at 200 × g at room temperature (22°C–25°C).\nUsing a vacuum pump, carefully aspirate media as to not disturb the pellet.\nAdd 200 μL Accumax cell dissociation solution to the pellet. Using a P200 pipette gently triturate the sample.\nIncubate at 37°C for a total of 10 min. After 5 min of incubation, gently flick the tube 3–5 times to prevent the settling of the BTSC spheres at the bottom of the tube.\nFollowing the incubation period, add 800 μL of BTSC growth media.\nTriturate the cell suspension using a 1000 μL pipette followed by a 200 μL pipette to complete dissociation if required.\nCount the number of viable cells using an exclusion dye such as trypan blue.\nNote: If extra cells are obtained, BTSCs can be cryopreserved. Following Accumax dissociation, centrifuge the cells to discard the media. Resuspend the cell pellet in 500 μL of BTSC growth media containing 10% DMSO, transfer to a cryogenic tube and store at −80°C over night (12–16 h). Transfer to a liquid nitrogen storage box for long term storage.",
    "Seed cells at a density of ∼0.5 × 106 cells in a T-75 flask in 10 mL BTSC growth medium.\nNote: BTSC lines can be seeded at variable densities based on their growth rate. The growth rate is variable from one BTSC line to another depending on the co-occurrence of oncogenic mutations that each cell line harbors. For example, BTSC lines that harbor the EGFRvIII mutation have a higher proliferation rate than those that lack the mutation. Typically, BTSC lines must be passaged every week.\nMaintain cells up to 7 days in culture. This will yield around ∼7 × 106 cells. If BTSC spheres are less than 150 μm in diameter and the media has become acidic, recognized by a yellow color, then add 3 mL of fresh BTSC media to the flask until next passage.\nPreparation of BTSCs\nTiming: ∼1–2 h\nThis section describes the procedure required to prepare BTSCs for proximity ligation assay (PLA). The following details are described for a Lab-Tek II, CC2-treated chamber slide 0.7 cm2 sample well. However, cell density can be adjusted according to the chamber slide in use.\nNote: The quality of chamber slides is very important. Various brands were tested but Nunc Lab-Tek II CC2 Chamber Slide System has given us the best results. Chamber slides with a synthetic base should be avoided. In general, an optically clear glass base works optimally.",
    "Critical: If you are using other chamber slides with low adhesive properties, a 10 μg/mL poly-D-lysine-coating (PDL) solution may be required prior to use. The working PDL solution can be made from a 2 mg/mL stock (Fisher Scientific, # CB-40210) using sterile water. PDL coating solution should be left on the slide overnight (12–16 h) in an incubator at 37°C and washed thoroughly (3 times) with sterile water prior to addition of cell suspension. If you are using serum free media, the chamber slides should be coated first with a 10 μg/mL PDL solution overnight (12–16 h) at 37°C followed by a 10 μg/mL laminin solution for 3 h at 37°C and washed once with PBS prior to use. Laminin solution can be made from a 1–2 mg/mL stock (Sigma-Aldrich, #L2020) with sterile water.\nWarm BTSC plating medium in a water bath at 37°C for ∼10 min.\nIncubate wells with 300 μL of warm BTSC plating media in a biological safety cabinet.\nTake 3–4 days old BTSCs from step 11. BTSCs spheres will be around 250 μm in diameter.\nUsing a 10 mL serological pipette, collect media and cells by gently mixing and pipetting all the BTSC spheres and transfer them to a 15 mL polypropylene conical tube.\nCentrifuge for 10 min at 200 × g at room temperature (22°C–25°C) and discard the media by aspiration.\nAdd 200 μL of Accumax solution and mix gently using a P200 micropipette and incubate at 37°C for 10 min in the incubator or in a water bath.\nNote: During the incubation, the large spheres have the tendency to settle at the bottom of the tube. After 5 min of incubation, gently flick the tubes 3–5 times to prevent the spheres from settling down and allow an efficient cell dissociation by Accumax.",
    "Remove the cell-Accumax containing tubes from the incubator and triturate gently 10 times using a P200 micropipette and low retention filtered long pipette tips to homogenize.\nNote: Certain BTSC lines require a shorter Accumax incubation time to be dissociated into single cell suspensions. The incubation time is the amount of time needed to effectively dissociate the BTSC spheres.\nCritical: It is important to obtain a single cell suspension. Cell clumps will result in a non-homogenous culture leading to overlapping PLA puncta and preventing the quantification of PLA signals at single cell resolution.\nAdd 800 μL of BTSC plating media to the 200 μL Accumax-cell suspension.\nCritical: Maintain BTSCs in serum-free medium. Following cell counting, if the remaining cell-suspension is being passaged for future use, take the cells needed for maintenance before adding the serum-containing plating medium for PLA experiments. In this case adjust the volume of the plating medium being added to obtain a total volume of 1 mL.\nCount the number of viable cells using an exclusion dye such as trypan blue.\nPrepare a cell suspension of 105 cells/ mL in BTSC plating medium and homogenize by pipetting up and down using a P1000 micropipette set at 800.\nRemove the media from the wells from step 13.\nPlate BTSCs at a density of ∼ 28 × 103/ cm2 by distributing 200 μL of the cell suspension to each 0.7 cm2 well.",
    "Critical: Cell density is an important parameter that impacts the quantification of PLA signal. The confluency of cells for PLA assay should be within 50%–70% to allow quantification of PLA signal at a single cell resolution. The optimal number of cells to be plated should be tested. When using different cell lines, perform a serial dilution of cell numbers. For most of BTSC lines 28 × 103 in 0.7 cm2 well is an optimal cell density.\nIncubate the newly plated cells under the biological hood for 5 min with minimum vibrations to allow the cells to attach to the bottom of the wells. Incubate cells for 1 h at 37°C with 5% CO2 in an incubator.\nCritical: Ensure that the BTSC spheres are well dissociated and there are no apparent cell aggregates in the cell suspension. It is important to check the wells before incubating at 37°C to ensure a homogeneous distribution of the cells in each well. When this is confirmed, avoid shaking the plate until the cells are attached to the wells. Cell aggregates will lead to overlapping PLA signals and high background.\nAfter 1 h of incubation, move to the fixation and permeabilization step.\nCritical: Following the incubation period, it is highly recommended to check the cells under the microscope before continuing the assay. This is to make sure that the cells have adhered to the bottom of the well and to verify that cell distribution is homogeneous and that there are no cell aggregates.\nCell fixation\nTiming: ∼20 min\nThis section describes the method used to fix BTSCs for subsequent processing. Other cell lines may require optimization of fixation parameters to obtain optimal results.",
    "Aspirate media and wash cells by gently distributing 200 μL 1× PBS to each chamber. Immediately remove the PBS and repeat the wash one more time.\nNote: A low speed aspirator is used, but pipette aspiration also works to aspirate the solution.\nAspirate PBS and fix the cells by adding 100 μL of room temperature (22°C–25°C) 4% PFA in 1× PBS to each well.\nCritical: Protein-protein interaction could be modulated by different stress signals. Therefore, rapid fixation of the cells is recommended to avoid any impact of experimental procedures on the protein-protein complexes.\nIncubate for 15 min at room temperature (22°C–25°C).\nAspirate PFA and wash the cells twice with room temperature (22°C–25°C) 1× PBS.\nNote: PFA should be handled under a certified chemical fume hood. Perform the preparation of PFA, fixation of cells and washing steps after PFA incubation under the hood.\nCritical: Choosing the right fixative is very important because it can impact the efficiency of the antibody binding to its substrate thereby reducing the expected signal.\nPause point: The experiment can be stopped at this step and the fixed cells can be stored at 4°C for later processing. Fixed cells can be stored up to ∼ 1 month at 4°C. If storing fixed cells for a short period (less than 1 week), ensure that the well is filled with 1× PBS and wrapped with parafilm to avoid drying of the wells. If storage for more than 1 week is required, store sample at 4°C with 0.01% sodium azide in 1× PBS.\nPermeabilization and blocking of cells\nTiming: ∼40 min",
    "This section describes the method in which cells are permeabilized at the level of the cellular membrane and the nuclear membrane. Once permeabilization is completed, subsequent reagents can move freely between compartments. For this reason, blocking of non-specific binding sites is essential to achieve a quantifiable and accurate signal.\nGently remove the PBS solution with a vacuum pump.\nCritical: PFA fixation will not permeabilize the samples, thus a separate permeabilization step is needed. Permeabilization allows antibodies to access intracellular structures while leaving the morphological characteristics of the cells intact. Triton, and saponin are examples of permeabilization reagents which act by disrupting the cellular membrane (Jamur and Oliver, 2010[href=https://www.wicell.org#bib6]). If alcohol fixative is used (e.g., 70% ethanol, methanol) no permeabilization reagent is needed (Jamur and Oliver, 2010[href=https://www.wicell.org#bib6]).\nTo permeabilize fixed cells, add 100 μL of permeabilization solution (0.5% Triton X in 1× PBS) and incubate for 20 min at room temperature (22°C–25°C).\nCritical: Protein-protein interaction may occur in the various cell compartments (e.g., cytoplasmic, nuclear, mitochondrial). Epitope access in the different cell compartments may require different levels of permeabilization. In our experiments, 0.5% Triton X-100 in 1× PBS was efficient to permeabilize the nuclear membrane to assess HOXA5-galectin1 interaction in the nucleus.\nRemove the permeabilization solution with a vacuum pump.\nWash twice with room temperature (22°C–25°C) 1× PBS.\nMix the blocking solution and add 100 μL of the blocking solution to each well.\nAlternatives: The blocking buffer is commercially available in the Duolink PLA kit however, a homemade solution can be prepared (See section – Materials and equipment).\nIncubate the chamber slides in a heated humid chamber for 1 h at 37°C under gentle agitation on a up/down rocking shaker (2 rpm).",
    "Critical: Ensure that the entire well/sample is covered with the blocking solution. Avoid drying of the samples as this will increase the background.\nPause point: The wells with sample containing blocking solution can be stored overnight at 4°C in a humid chamber.\nPrimary antibody hybridization\nTiming: overnight (12–16 h)\nThis section describes the method in which permeabilized and blocked cells are incubated with diluted primary antibodies against the desired proteins to achieve an antibody-antigen reaction. This reaction is critical as it will determine the sensitivity of the assay.\nIn one Eppendorf tube, dilute the primary antibodies (specific to the proteins of interest) to the optimal dilution in the antibody diluent buffer, as described above. In the current protocol, mouse galectin-1 and rabbit HOXA5 antibodies are used at a dilution of 1:400 in the diluent buffer.\nAlternatives: The antibody diluent buffer is commercially available in the Duolink PLA kit, however, it can be prepared in-house (See section - Materials and equipment).\nCritical: Multiple negative controls can be used. Omitting the primary antibodies provides a negative control for the PLA signal. An ideal negative control, however, is to generate knockout (KO) cells for the protein of interest and run the procedures in parallel. In our experiment, we probed the LGALS1 CRISPR KO BTSCs (negative control 1) and HOXA5 CRISPR KO BTSCs (negative control 2) with the pair of galectin-1 and HOXA5 primary antibodies. Additionally, a combination of a primary antibody with an anti-IgG control can be used as a negative control. For example, a combination of mouse anti-galectin-1 and rabbit anti-IgG or a combination of rabbit anti-HOXA5 and mouse anti-IgG can be used as negative controls.\nFollowing blocking, add 100 μL of 1× PBS to each well without removing the blocking solution and rapidly aspirate using a vacuum pump.",
    "Alternatives: Aspiration can be done using a micropipette. However, when the assay is performed on multiple samples, it is recommended to use a vacuum pump to move quickly to the next step and avoid drying of the samples.\nAdd 40 μL of primary antibody-diluent solution and incubate overnight (12–16 h) at 4°C.\nCritical: Incubate samples overnight (12–16 h) at 4°C in a humid chamber to avoid sample drying and on an up/down rocking shaker to ensure an even distribution of the solution. Fill unused wells with 1× PBS.\nPrimary antibody washing\nTiming: ∼ 20 min\nThis section describes the method used to wash samples following the antibody hybridization step. Efficient washing is essential as the PLA secondary antibody probes will hybridize only with antibodies that remain after washing.\nRemove buffer A from the fridge (4°C) and bring it to room temperature (22°C–25°C) before use (∼1 h).\nAlternatives: Although the wash buffer A is commercially available (Duolink In Situ Wash Buffer A in starter kit), a homemade wash buffer A can be prepared in the laboratory (See section - Materials and equipment).\nWithout removing the primary antibody-diluent buffer solution, add 300 μL of wash buffer A in each well and rapidly aspirate using a vacuum pump.\nAdd 300 μL of wash buffer A to each well and incubate for 5 min at room temperature (22°C–25°C) in a humid chamber on an up/down rocking shaker at low speed (2 rpm).\nAspirate the wash buffer A and repeat washing twice.\nNote: During the washing step, prepare PLA Probes for the next step (PLA probe incubation).\nPLA probe incubation\nTiming: ∼1 h",
    "This section describes the method of how PLA probes are prepared and incubated with the sample. The PLA secondary antibody probes are conjugated to oligonucleotides that will give rise to a circular product if in proximity, indicative of a protein-protein interaction.\nWhile the samples are being washed, take the PLA Plus and Minus probes out of the fridge (4°C) and vortex briefly.\nDilute the 5× PLA probes in antibody diluent buffer at a dilution of 1:5. For each sample, prepare 40 μL of 1× PLA probes as follows:\ntable:files/protocols_protocol_1848_5.csv\nNote: To ensure efficiency, prepare a master mixture for multiple samples and mix well before applying to the wells. Also prepare a master mixture for the negative controls.\nAspirate the wash buffer A from last washing using a vacuum pump.\nAdd 40 μL of 1× PLA probe mix to each sample, including the negative controls and incubate in a preheated humid chamber for 1 h at 37°C on an up/down rocking shaker at low speed (2 rpm).\nPLA probe washing\nTiming: ∼ 20 min\nThis section describes the method used for washing sample following PLA probe incubation. Efficient washing is essential as the ligase will ligate secondary antibody conjugated oligonucleotides that remain bound to the primary antibody.\nWithout removing the PLA probe, add 300 μL of wash buffer A to each well and rapidly aspirate using a vacuum pump.\nNote: The commercial or the homemade wash buffer A can be used.\nAdd 300 μL of wash buffer A to each well and incubate for 5 min at room temperature (22°C–25°C) in a humid chamber on an up/down rocking shaker at low speed (2 rpm).\nAspirate the wash buffer A and repeat washing twice.\nNote: During the washing step, prepare the ligation solution for the next step (Ligation).\nLigation\nTiming: ∼45 min",
    "This section describes the method in which the ligation mixture is prepared and how the incubation is conducted to allow for maximal ligation of the oligonucleotide probes. The ligase enzyme will hybridize the two oligonucleotides of the two PLA probes and form a closed DNA circle if the two proteins of interest are in proximity (less than 40 nm).\nDuring the last wash, thaw the 5× ligation buffer (stored at −20°C) before use.\nPrepare 1× ligation buffer by diluting the 5× ligation buffer in Milli-Q water. For each sample, prepare 40 μL of 1× ligation buffer as follows:\ntable:files/protocols_protocol_1848_6.csv\nCritical: Make sure the ligation buffer is completely thawed and well homogenized prior to use. Keep the prepared 1× ligation buffer at room temperature.\nRetrieve the ligase (1 U/μL) from the freezer using a freezer block (−20°C). Prepare 40 μL of 1× ligase solution per reaction as follows:\ntable:files/protocols_protocol_1848_7.csv\nCritical: Add the ligase to the 1× ligation buffer immediately prior to addition to the sample. Ligase mix should remain on the freezer block.\nNote: For maximum efficiency, prepare a master mixture for multiple samples and mix well before applying to the wells, do the same for the negative controls.\nGently remove the wash buffer A from last wash using a vacuum pump.\nAdd 40 μL of the ligation reaction mixture into each well including negative controls.\nIncubate for 30 min at 37°C in a humid chamber under gentle agitation on a up/down rocking shaker (2 rpm).\nLigation washing\nTiming: ∼ 20 min\nThis section describes the method used for washing sample following ligation. Efficient washing is essential as amplification will take place based on the DNA circle formed in the ligation step.",
    "Without removing the ligation-ligase solution, add 300 μL of wash buffer A to each well and rapidly aspirate using a vacuum pump.\nAdd 300 μL of wash buffer A to each well and incubate for 5 min at room temperature (22°C–25°C) in a humid chamber on an up/down rocking shaker at low speed (2 rpm).\nAspirate wash buffer A and repeat washing twice.\nNote: During this washing step, prepare the rolling circle amplification (RCA) solution for the next step.\nRolling circle amplification (RCA)\nTiming: ∼ 100 min\nThis section describes the method in which the amplification mixture is prepared and incubated with sample. The circular DNA probe will be amplified via rolling circle amplification. The rolling circle amplification reaction occurs in the presence of DNA polymerase and the nucleotide mixture present in the amplification buffer. The amplification buffer contains fluorescently labeled oligonucleotides which will hybridize to a specific sequence in the rolling circle amplification product and the signal will be easily visible as a distinct fluorescent spot by a fluorescence microscope.\nDuring the last wash, thaw the 5× amplification buffer (stored at −20°C).\nPrepare 40 μL of amplification buffer per reaction as follows:\ntable:files/protocols_protocol_1848_8.csv\nCritical: The amplification buffer contains fluorescent dyes and should be protected from the light. Ensure the amplification buffer is completely thawed and mixed prior to using.\nKeep the prepared 1× amplification buffer at room temperature (22°C–25°C) and protected from light.\nRetrieve the polymerase enzyme (10 U/μL) from the freezer using a freeze block (−20°C). Prepare 40 μL of polymerase solution per reaction as follows:\ntable:files/protocols_protocol_1848_9.csv\nCritical: Add the polymerase to the 1× amplification buffer immediately prior to addition to the sample. Polymerase should stay on the freezer block while the prepared mix stays at room temperature (22°C–25°C) protected from light.",
    "Note: To maximize efficiency, prepare a master mixture for multiple samples and mix well before applying to the wells. Also prepare a master mixture for the negative controls.\nGently remove the wash buffer A from last wash with a vacuum pump.\nAdd 40 μL of the amplification mix into each well including negative controls.\nIncubate for 100 min at 37°C and protected from light in a humid chamber under gentle agitation on an up/down rocking shaker (2 rpm).\nCritical: Follow the recommended amplification time as extended amplification duration can cause signal coalescence.\nRolling circle amplification washing\nTiming: ∼ 20 min\nThis section describes the method used for washing sample following amplification.\nBring the wash buffer B (stored at 4°C) to room temperature (22°C–25°C) before use (∼1 h).\nAlternatives: Although the wash buffer B is commercially available (Duolink In Situ Wash Buffer B – available in the starter kit), a homemade wash buffer B can be prepared in the laboratory (See section - Materials andequipment).\nWithout removing the amplification-polymerase solution, add 300 μL of wash buffer B to each well and rapidly aspirate using a vacuum pump.\nAdd 300 μL of wash buffer B to each well and incubate for 10 min at room temperature (22°C–25°C) in a humid chamber on an up/down rocking shaker at low speed (2 rpm).\nAspirate the wash buffer B and repeat the washing for another 10 min.\nAspirate the wash buffer B and wash with 300 μL of the 0.01× wash buffer B for 1 min.",
    "Note: At this step, the PLA-stained samples can be further immunostained using classical immunofluorescence or probe-based methods. In this case, avoid to use primary antibodies raised in the same species as those used for the PLA assay. Ensure that the probes or secondary antibodies are conjugated to different fluorophores than those of the PLA to be able to identify each signal. It is possible to co-stain the PLA signals with dyes that stain live cells such as labeling the mitochondria with MitoTracker. In this case, the mitochondria should be labeled with the MitoTracker dye in live cells before fixing the cells for the PLA assay (Sharanek et al., 2020[href=https://www.wicell.org#bib10]).\nMounting the slides for imaging\nTiming: ∼ 30 min\nThis section describes the method used to prepare slides and mount slides using a mounting solution containing DAPI to subsequently visualize the nucleus and PLA puncta using fluorescent microscopy. Effective mounting of slides is important for the quality visualization and to ensure samples can be stored if needed.\nAspirate the 0.01× wash buffer B using the vacuum pump.\nUsing the removal tool provided with the Lab-Tek chamber slides, carefully separate the chamber from the slide.\nRemove any additional liquid remaining on the slide by holding the slide horizontally on a filter paper or a paper towel.\nAir-dry the slide for 3 min at room temperature (22°C–25°C) and protect from light.\nAdd 3 μL of mounting medium with DAPI (Duolink In Situ Mounting Medium with DAPI- available in the starter kit) on each sample slide section.\nAlternatives: Duolink In Situ Mounting Medium with DAPI can be replaced by ProLong Gold antifade reagent with DAPI (Life Technologies, # P-36931), or other mounting media with DAPI.",
    "Place a rectangular cover glass on the slide and make sure that the mounting medium is spread evenly over the samples.\nNote: Avoid forming air bubbles under the coverslip.\nSeal the edges of the coverslip to the slide with clear nail polish.\nKeep the slides under the fume hood for 30 min and protected from light to allow the nail polish sealing to dry.\nPause point: One can store the slides at −20°C for later acquisition of the microscopic images. Mounted slides can be stored at −20°C and protected from light for up to 6 months.\nImage acquisition and quantification\nTiming: ∼ 3 h\nThis section describes the parameters used to visualize the PLA signal and to compare this signal with other conditions (ex. wild type vs. knockout cells). Following visualization, PLA puncta can be quantified as described in this section and statistical analysis can be carried out to determine the presence of the signal and in which compartment the signal is originating from.\nVisualize and capture images using a fluorescence microscope with the appropriate filters for the detection of DAPI and the used fluorophore with 40–60× objective. In our experiment, PLA signals were captured using a 63× oil objective lens (Figure 2[href=https://www.wicell.org#fig2]) on a laser scanning confocal microscope (ZEISS LSM 800). It is critical that the acquisition parameters for the images in the experimental and control conditions be kept the same in order to ensure proper comparison.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1848-Fig2.jpg\nFigure 2. Detection of galectin1-HOXA5 protein interaction by proximity ligation assay in brain tumor stem cells (BTSCs)\nControl BTSCs, LGALS1 CRISPR KO and HOXA5 CRISPR KO BTSCs were subjected to PLA, as described above.\n(A) Each red spot represents a single interaction between HOXA5 and galectin1 molecules.",
    "(B–D) Controls include the omission of primary antibodies (B), PLA in LGALS1 CRISPR KO (C) and PLA in HOXA5 CRISPR KO (D). Nuclei were stained with DAPI. Scale bar, 10 μm.\n(E) The number of PLA dots per nucleus was quantified in control BTSCs and LGALS1 CRISPR KO. Data are presented as the means ± SEM, n = 7 images. Each dot represents the number of PLA dots per nucleus in each image. Unpaired two-tailed t test, p < 0.0001.\nCount the number of PLA dots and nuclei in each image. Divide the number of PLA dots by the number of nuclei in each image to obtain the number of PLA dots per nucleus. To enable statistical analysis a minimum of n=3 biological replicate images should be assessed. Plot data as shown in Figure 2[href=https://www.wicell.org#fig2]E.\nNote: In this protocol we performed manual quantification of the PLA dots. However, automated analysis can be performed using the ImageJ software (https://imagej.nih.gov/ij[href=https://imagej.nih.gov/ij]).\nPreform statistical analysis by means of a student t-test to determine the significance between the mean values of the two conditions that are being compared (number of PLA dots per nucleus in control versus LGALS1 CRISPR KO).\nNote: A student t-test can be used when comparing the means of two different conditions, however one way ANOVA for multiple comparisons may be employed to compare three or more conditions."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Stem Cells",
    "Microscopy",
    "Cancer",
    "Cell Biology",
    "Neuroscience",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}