{
  "id": 11527,
  "origin_website": "Jove",
  "title": "A Method for Investigating Change Blindness in Pigeons (Columba Livia)",
  "procedures": [
    "The procedure described here is in accordance with the Office of Laboratory Animal Welfare and with US Public Health Service Policy on Humane Care and Use of Laboratory Animals, and was approved by Whitman College's Institutional Animal Care and Use Committee.\n1. Reduce Pigeons' Weights\nNOTE: Pigeons' weights are reduced to 80 - 85% of their free-feeding weight33 to ensure that the birds are healthy and adequately motivated to work for food.\nHouse naïve birds in individual cages with unlimited access to water, grit, and food.\nWeigh each pigeon at approximately the same time each day for 2 to 4 weeks, or until each bird's free-feeding weight has stabilized.\nCalculate a target weight for each pigeon equal to 85% of its stable free-feeding weight.\nRestrict food to gradually reduce each pigeon's weight until the target weight is reached34. Pigeons should still have unrestricted access to water and grit.\n\tNOTE: Published experiments using this protocol29,30,31,32 have yielded significant results using between 4 and 6 pigeons per condition. Similar numbers should be adequate for a direct replication or subtle variation. Variations that reduce the magnitude of the change blindness effect could require a larger sample.\n2. Train Pigeons to Peck Stimuli Displayed on the Response Keys in the Operant Chamber and to Eat Grain from the Food Hopper\nNOTE: Training and experimental sessions require precise computer control, with temporal resolution of less than 1 ms. Use a flexible programming language (see Table of Materials) to control operant chambers via an I/O relay.",
    "At the beginning of each day's session, weigh pigeons and place them into operant chambers (see Table of Materials). Naïve pigeons may need time to acclimate to handling, weighing, and transport to and from the operant chamber.  Until then, take extra care to handle birds gently and monitor them for signs of stress.\nRun 100 trials per daily session. For each trial:\n\t\nRandomly select a visual stimulus element (such as a color or line) and one of the three keys (see Table of Materials) in the operant chamber. Illuminate the selected stimulus element on the relevant key using a compatible stimulus projector (see Table of Materials).\n\t\tNOTE: The onset and offset times of the incandescent bulbs that are standard in many operant chambers are too slow to be appropriate for this method. Replace any incandescent bulbs in the operant chamber with a faster LED equivalent, and then confirm that the displays appear as intended and that the onset of stimuli is crisp (less than 1 ms from onset to peak brightness).\nWait until a pigeon pecks the key on which the stimulus is displayed. Do not acknowledge pecks to any other keys.\n\t\tNOTE: Experienced pigeons may immediately know to peck illuminated response keys. Naïve or less experienced birds' pecking can be shaped using handshaping or autoshaping35 procedures as they would be for other laboratory tasks.\nFollowing a single peck to the proper response key, clear the stimulus display and provide access to grain from the food hopper for 2 - 3 seconds.\nAt the end of each session, remove pigeons from operant chambers and weigh them before returning them to their home cages. Adjust food access time between sessions to maintain birds' individual running weights at 80 - 85% of their free-feeding weights.",
    "Continue pre-training sessions until pigeons respond quickly and consistently to all of the individual stimulus elements to be included in the experiment, on all three response keys.\n3. Train Pigeons to Search for and Peck Changes Presented on Response Keys\nAt the beginning of each day's session, weigh pigeons and place them into operant chambers.\nAt the beginning of each of 100 trials in a daily session, determine the details of the upcoming stimulus display. Details for each trial can be randomly selected by the experimental control software. A sample program to run a daily experimental session is included as a supplemental file (change.cpp); elements present there could also be used to perform the simpler actions in step 2.\n\t\nRandomly choose an Inter-Stimulus Interval (ISI) of either 250 ms or 0 ms (with p = 0.5 for each).\nRandomly determine the number of change repetitions to present, either 1, 2, 4, 8, or 16 (with p = 0.2 for each).\nDefine an original stimulus display consisting of one or more elements (the colors or lines presented during pretraining) on each response key.\nChange the original stimulus display to define a modified display by adding, deleting, or changing one element on one key. See Figure 1 for examples of original and modified stimulus displays.\nEnsure that pigeons will not see all possible stimulus displays during training. If necessary, designate a subset of displays for transfer (step 4) and refrain from presenting them during training.\nPresent a 5 s Inter-Trial Interval (ITI), with the houselight on and all response keys dark to separate each trial from the immediately preceding trial.\nPresent a stimulus display using the values determined for the current trial in step 3.2.\n\t\nIlluminate the stimulus elements that compose the original display for 250 ms.",
    "Clear the stimulus display and wait for an ISI of either 0 or 250 ms.\nIlluminate the stimulus elements that compose the modified display for 250 ms.\nClear the stimulus display and wait for an ISI of either 0 or 250 ms.\nRepeat steps 3.4.1 to 3.4.4 until completion of the number of repetitions previously determined for the current trial. Present all repetitions in their entirety and ignore any keypecks during stimulus presentation.\nIlluminate all three response keys with white light and wait until a pigeon pecks one of the three response keys. Consider the first peck on any response key after stimulus presentation is complete to be the response for that trial. See Figure 2 for a schematic description of trials with or without an ISI.\nClear all keys and conclude the trial with either reinforcement or an error signal:\n\t\nIf a bird's response was on the key that displayed a change, provide access to grain from the food hopper for 2 - 3 s.\nIf a bird's response was not on the key that changed, switch the houselight between on and off every 0.5 s for 10 seconds to indicate an incorrect response.\nAt the end of each session, remove pigeons from operant chambers and weigh them before returning them to their home cages. Adjust food access time between sessions to maintain birds' individual running weights at 80 - 85% of their free-feeding weights.\nContinue daily training sessions until the accuracy of pigeons' responses is stable, and reliably better than chance accuracy of 33%. A sample file is provided (change.xlsx) that analyzes raw data to show the effects of ISI presence and number of repetitions.\n4. Present Novel Transfer Trials Within Daily Sessions",
    "Follow the procedure exactly as outlined in step 3, but without any potential displays excluded (see step 3.2.5).\n\tNOTE: With large numbers of potential stimulus displays, it is not necessary to exclude potential displays during training and introduce them later. In those cases, simply continue training as normal, as never-before-seen displays will occur naturally.\nAnalyze accuracy on novel, never-before-seen stimulus displays, excluding any displays pigeons have previously encountered. Better than chance accuracy will confirm that pigeons have learned a general change detection rule and are not relying on memorization of familiar stimulus displays.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}