{
  "id": 9246,
  "origin_website": "Jove",
  "title": "Mouse Adipose Tissue Collection and Processing for RNA Analysis",
  "procedures": [
    "Care of the mice used in the procedures complied with standards for the care and use of experimental animals set by the Canadian Council for the Protection of Animals. All procedures were approved by the University Animal Care and Use Committee at the CHUM Research Center.\n1. Necropsy and Adipose Tissue Collection from Male Mice\nMake experimental groups according to study objectives. In this study, samples were collected from two groups of male mice on a C57Bl/6 background (n=12-14/group). Ensure that mice used here are 12-15 weeks of age and are maintained on 12-h light/dark cycle with access to either normal (N) or high-fat (HF) diet and water ad libitum for a period of 10 weeks11.\nEuthanize a mouse by placing the mouse in a sealed chamber where it is exposed to 6 % CO2 during 10 min.\nPerform cardiac puncture by slowly inserting a 1 mL syringe mounted with a 26G 1/2po needle just to the left of the animal's sternum and slowly pulling the piston to remove most of the animal's blood. Make sure that the syringe is parallel to the animal's body. Rotate the syringe slowly while pulling the piston if blood does not come into the syringe.\nNote: Successful cardiac puncture (between 0.8 and 1 mL blood volume) will decrease contamination of adipose tissue with blood.\nLay the mice on its back and pin each paw on the pad using 22G needles as shown in Figure 1.\nWith a gauze, rub the skin of the mouse with alcohol several times starting from the neck all the way down to the genital organs by following a unidirectional motion as this ensures that hair remains flat and reduces the hair contamination of adipose tissue samples without hair removal.",
    "Using clean but not sterile forceps and surgical scissors, elevate the central skin near the genital organs and make a small 0.3 mm incision.\nInsert the scissors horizontally into the opened hole and detach the abdominal skin from the abdominal wall.\nNote: This is done by blunt dissection in the space between the skin and the abdominal wall and not by cutting the membranes found in this space.\nUsing the forceps, elevate the central skin near the opened hole and cut the skin over the linea alba until you are near the rib cage (~4 cm depending on the mouse size).\nNote: Avoid cutting the abdominal muscle as this might expose the visceral adipose tissue to the air and lead to drying of the fat pads which may alter the integrity of the tissue and its content.\nFrom the middle of the rib cage, cut the skin towards the right arm on ~2 cm. From near the genital organs, cut the skin above the right hind limb on ~2 cm.\nStretch one corner of the opened skin and pin it down on the pad using a 22G needle. Repeat with the other corner.\nNote: The adipose tissue exposed on the skin is the abdominal subcutaneous fat (SCF) (Figure 1A).\nCollect the SCF by blunt dissecting and cutting it from the skin using surgical scissors positioned as flat as possible against the skin. Once collected, put the SCF on the pre-identified aluminum foil.\nNote: Collecting or contaminating adipose tissue with skin or hair will alter sample quality and RNA yield due to RNases. If too much time is spent collecting the adipose tissue, the sample may also dry which can also alter the quality of the sample.",
    "Repeat steps 1.9 to 1.11 on the left side of the animal. Pool both left and right fat pads in the aluminum foil and freeze the sample in liquid nitrogen.\nTo get access to the visceral adipose tissues, cut the abdominal muscle using clean but not sterile surgical scissors and forceps along the linea alba, on ~4 cm, depending on the mouse size, from the genitals to the rib cage. Then make an incision in the abdominal muscles from the genitals toward the back of the mouse on ~2.5 cm to have access to the side of the abdominal organs.\nThe fat around the reproductive organs is the peri-gonadal fat (PGF) (Figure 1B). As PGF is attached to the epididymis, the testis and the ductus deferens, detach carefully the left fat pad from those structures and put on the pre-identified aluminum foil. Repeat for the right-hand side. Once both PGFs are collected, freeze the sample in liquid nitrogen.\nStarting with the left-hand side, expose the kidneys by moving the gut away from the abdominal cavity to the right-hand side. The adipose tissue surrounding the kidney is the peri-renal fat (PRF) (Figure 1C). PRF also surrounds the adrenal glands (Figure 1D).\nIsolate and remove the adrenal glands before collecting PRF. This can be tedious as they are just a bit pinker than the adipose tissue.\nNote: Kidneys should not be removed during this step as blood may contaminate the adipose tissue and make it more difficult to identify the adrenal glands within this fat pad.",
    "Isolate the PRF from the back muscular wall, ending by cutting the ureter, the renal artery, and vein which separates the PRF and kidney from the rest of the body. Isolate the PRF from the kidney by cutting and removing the renal capsule. The PRF stays attached to the capsule.\nRepeat steps 1.15 and 1.17 for the right-hand side. Put both PRF in the aluminum foil and freeze the sample in liquid nitrogen.\nRepeat the procedure from steps 1.2 to 1.18 for all mice to be collected.\nAt this point, proceed with adipose tissue grinding or store samples in a -80 °C freezer for later extraction. Samples can be stably stored at -80 °C for several years4.\n2. Preparation of Ground White Adipose Tissue for RNA Isolation\nNote: Wear gloves for each step as skin contains RNases which can promote RNA degradation and as such, alters sample quality and RNA yield after isolation.\nPrepare and identify three RNase-free 1.5 mL conical screw cap tubes per mouse, one for each type of white adipose tissue, and place them on a rack.\nNote: Obese animals may require additional tubes as they have increased fat masses. This is particularly true for SCF for which up to 7 tubes for one mouse was obtained.\nClean the bench with 70% ethanol and put a clean and new bench paper on the surface.\nWhether adipose tissues were freshly collected from mice or stored beforehand in a -80 °C freezer, gather all samples in one liquid nitrogen-filled container until the beginning of the procedure.\nFreeze the mortar, pestle, and spatula by placing them in the liquid nitrogen container. When the liquid nitrogen stops to ''boil'', grinding of adipose tissue can be started.",
    "Note: From this step, the mortar, spatula, conical tube and adipose tissue need to stay chilled during the entire process. Any heat will melt the adipose tissue and make it harder to extract the RNA. Also, if using a ceramic mortar and pestle, one may use dry ice and/or liquid nitrogen to keep it cold.\nPlace all RNase-free 1.5 mL conical screw cap tubes prepared at step 2.2 on dry ice to cool them down.\nTo avoid frostbites on the hands, use a few layers of brown paper to lift the mortar from the liquid nitrogen and put it on a working bench.\nUse the forceps to collect an adipose tissue sample from the liquid nitrogen and put it in the mortar. Quickly unwrap the aluminum foil and drop the sample on the center of the mortar.\nNote: If the adipose tissue sample is too big, as is the case with obese mice, break the samples in smaller parts in the aluminum foil using your thumbs and pulverize each part separately.\nUse a few layers of brown paper to lift the pestle from the liquid nitrogen and fit it into the mortar. While holding the pestle with brown papers, use the hammer to hit the top of the pestle once or twice. Press the pestle down against the mortar with rotating motions to grind the sample until a fine powder is obtained.\nNote: This step is critical to obtain adequate RNA isolation. Indeed, the presence of larger fragments will impede RNA isolation and reduce yield.\nOnce a fine powder is obtained, remove the pestle and pick up the spatula from the liquid nitrogen and use it to transfer the sample into the corresponding pre-chilled 1.5 mL conical tube.",
    "Note: Dip the spatula back into liquid nitrogen from time to time to prevent the sample from melting. Also, keep the conical tube in dry ice always to prevent the sample from thawing. A conical tube filled with ground sample to about 2/3 capacity (~1 mL) is required for adequate RNA yield and quantity.\nOnce filled to about 1 mL, close the tube and drop it into the other liquid nitrogen-filled container.\nNote: Excess samples can be put in separate pre-chilled RNase-free 1.5 mL conical tubes and stored in a -80 °C freezer for later use.\nClean the mortar, pestle, and spatula with brown papers to avoid carry-over into the next adipose tissue sample. Put pestle and spatula back into the liquid nitrogen to chill. Even though the brown paper is not RNase-free, we use a freshly opened pack of brown paper for each day of RNA isolation.\nRepeat steps 2.4 to 2.11 with the next sample.\nOnce all samples are processed, start RNA isolation or store samples in a -80 °C freezer for later use.\nNote: To prevent the tubes from bursting, freeze a sample box by completely submerging it into the liquid nitrogen container. When cool enough remove the excess nitrogen from the box and let it float on top of the liquid nitrogen. Sort the samples into the box and put it in a -80 °C freezer.\n3. RNA Isolation from Ground Adipose Tissue\nCaution: Phenol solution is harmful to the skin. Wear a lab coat, gloves, safety glasses and execute the procedure under a chemical hood. A step-by-step flowchart is shown in Figure 2.\nPrepare and identify two sets of RNase-free 1.5 mL conical tubes and put them in a rack.",
    "Whether adipose tissues were freshly ground or pre-stored in a -80 °C freezer, gather all samples in a liquid nitrogen-filled container until the start of the procedure which is mostly done at room temperature.\nUse forceps to select a ground adipose tissue sample from the liquid nitrogen and put it in a tube rack. The tubes should contain ~1 mL of powder, which corresponds to around 100 mg of tissue powder.\nSlowly open the tube.\nNote: Leaving a closed tube at room temperature or opening the tube's lid too quickly might lead to sample loss or injury as pressure from the nitrogen tends to escape from the tube.\nAdd 500 µL of phenol solution to the sample (1:2 ratio of phenol solution: tissue powder).\nClose the lid of the tube and vortex at maximum speed for about 5 s. Slowly and carefully open the tube to release the pressure from the nitrogen (a sound of air coming out of the tube can be heard).\nRepeat steps 3.5 and 3.6. The final phenol solution volume added to the sample is 1 mL.\nRepeat step 3.6 until the sample is completely dissolved.\nNote: It is important to release all the pressure from the tube before proceeding further to prevent the tube from bursting.\nLet the sample stand at room temperature while repeating steps 3.4 to 3.8 for the next samples.\nOnce all samples are processed, briefly vortex at maximum speed and incubate all samples 5 min at room temperature.\nCentrifuge 10 min at 12 000 x g at 4 °C. Bring the tubes back to room temperature.\nNote: After centrifugation, 3 phases are present as shown in Figure 2: fat (top), RNA (middle) and pellet (bottom).",
    "For each sample, transfer as much RNA (middle pink layer) as possible into the first set of corresponding tubes with a P1000 pipette using a filtered tip. Change tips between samples.\nTo ensure minimal contamination of RNA (middle layer) by the lipid (top layer), pierce the top phase with the tip near the side of the tube. Dispense the RNA into the new conical tubes without touching the sides of the new tube to prevent transferring lipids that may be on the outside of the tip.\nAdd 200 µL of pure chloroform to each sample and mix by inversion for 15 s. Incubate 10 min at room temperature.\nCentrifuge 15 min at 12 000 x g at 4 °C and bring the tubes back to room temperature.\nNote: After centrifugation, 3 phases are present: RNA (top), interphase which contains DNA (middle) and red phenol-chloroform which contains proteins (bottom).\nFor each sample, transfer as much aqueous transparent RNA-containing phase (top phase) as possible to the second set of corresponding conical tubes with a P1000 pipette using filtered-tips. Change tips between each sample.\nNote: The interphase is fragile and can contaminate the top phase if aspiration is done too quickly. As an alternative, use a P200 pipette to reduce the chances of disturbing the interphase.\nAdd 500 µL of 100% isopropanol to each sample and mix by inversion for 15 sec.\nIncubate 10 min at room temperature\nCentrifuge 10 min at 12 000 x g at 4 °C and bring the tubes back to room temperature. Discard the isopropanol by inverting each tube.\nNote: A small white RNA pellet can usually be seen but on occasion may not.\nAdd 1 mL of 75% ethanol (prepared from 100% ethanol and RNase-free water) to each sample and briefly vortex each tube at maximum speed.",
    "Centrifuge 5 min at 7 500 x g at 4 °C and bring the tubes back to room temperature.\nDiscard the 75% ethanol by inverting each tube and lightly tap against a brown paper to remove any leftover.\nNote: If required, use a filtered-tip to remove alcohol near the RNA pellet. Change tip between samples.\nLeave the lid open and air dry the RNA pellet for about 15-20 min.\nNote: RNA pellets might become translucent during this step.\nAs RNA solubilization from the pellet is size-dependent, evaluate the size of the pellet to determine the volume of RNase-free water to be used to solubilize the RNA. Write down the volume (10 to 25 µL) for each sample.\nNote: This step is merely qualitative. If RNA pellet cannot be seen, add 10 µL of RNA-free water to the sample.\nAdd 10-25 µL of RNase-free water to each sample (pre-determined volume at step 3.24).\nIncubate the sample 5 min in a heat block set at 60 °C. Briefly vortex the tubes.\nIncubate the sample for an additional 5 min in the same heat block at 60 °C.\nQuick-spin all samples in a mini spin centrifuge and immediately put on ice.\nDetermine the RNA concentration and purity. Perform reverse transcription (RT) to obtain cDNA or store samples in a -80 °C freezer for later use.\nNote: Avoid multiple freeze/thaw cycles as this degrades RNA samples.\n4. Determination of Adipose Tissue RNA Concentration and Purity\nWhether adipose tissue RNA samples were freshly extracted and solubilized or pre-stored in a -80 °C freezer, gather all samples and allow them to thaw on ice until the start of the procedure. This should be done just before the start of the next step or at the end of the isolation to avoid multiple freeze/thaw cycles.",
    "Prepare and identify two sets of RNase-free 1.5 mL conical tubes and put them in a tube rack.\nWhen all the RNA samples are fully thawed, vortex a sample for 1 s and put back on the ice.\nDilute your RNA 100-fold in 1x TE solution in the first set of RNase-free 1.5 mL conical tubes using filtered RNase-free tips (put 99 µL of 1x TE solution and 1 µL of RNA to the tube).\nRepeat for each sample.\nNote: The volumes might be different for each spectrophotometer depending on the cuvette used.\nOnce all samples are processed, vortex each diluted sample.\nFollow the protocol of the spectrophotometer to calibrate the instrument by using a blank (1x TE) before processing the diluted RNA samples.\nTransfer the diluted RNA samples to the quartz cuvette and determine the concentration of each sample at 260 nm.\nNote: If the spectrophotometer does not provide the final RNA concentration, use this formula to calculate: RNA (µg/µL) = OD260 x dilution factor x (40 µg RNA/1 000 µL).\nDetermine the RNA purity of each sample by calculating the ratio OD260/OD280.",
    "Note: A ratio OD260/OD280 around 2.0 is generally considered as pure for RNA12. It is highly recommended that the RNA quality is verified. In order to do so, put 1 µg of RNA on a 1% agarose bleach gel made with 1x TBE buffer (89 mM Tris base, 89 mM boric acid and 2 mM EDTA, pH 8.0) and 1% bleach solution13 (Figure 3). RNA of very good quality shows both 28S and 18S rRNA bands and the 28S band should be more intense than the 18S. RNA quality is acceptable when both rRNA bands are visible at a similar intensity. RNA quality becomes deficient the moment the 18S band is more intense than the 28S band, and when a smear is visible, indicative of RNA degradation.\nFor each sample, prepare 10 µL of 0.5 µg/µL of RNA from the stock in the second set of RNase-free 1.5 mL conical tubes using RNase-free water to dilute the samples as needed. These samples are used for RT to obtain cDNA.\nOnce all samples are processed, start RT or store samples in a -80 °C freezer for later use.\n5. Reverse-transcription (RT)\nWhether adipose tissue RNA samples were freshly diluted to 0.5 µg/µL or pre-stored in a -80 °C freezer, gather all samples, and reagents and allow them to thaw on ice until the start of the procedure.\nPut the PCR tube strip rack on ice. Once cold enough prepare and identify one set of RNase-free PCR tube strips and put them on the rack. Include a blank.",
    "Prepare the reaction for DNase treatment of the RNA: Make a master mix (for the required amount of sample + 1 sample) of the following (quantities for 1 sample): 1 µL of 10X reaction buffer with MgCl2, 0.5 µL of DNase I (1 U/µl) and 7.5 µL of RNase-free water using filtered-tips. Dispense 9 µL in each tube.\nAdd 1 µL of 0.5 µg/µL of RNA from each sample to the corresponding tube, put the caps on each strip and quick-spin all strips in a mini spin centrifuge to bring the sample to the bottom of the tube. Add 1 µL of RNA-free water for the blank.\nIncubate all tube strips in a thermal cycler or a heating block at 37 °C for 30 min. Put the tube strip back on the rack on ice.\nAdd 1 µL of EDTA (50 mM) to each tube and incubate all tube strips in a thermal cycler or a heating block at 65 °C for 10 min. Put the tube strip back on the rack on ice.\nMake a master mix (for the required number of samples plus 1 sample) of the following (quantities for 1 sample): 1 µL of random hexamers (0.2 µg/µL) and 1 µL of dNTP mix (contains each of the four deoxynucleotides at a concentration of 10 mM). Dispense 2 µL of the master mix in each tube using filtered-tips. Change tip between samples.\nIncubate all tube strips in a thermal cycler or a heating block at 65 °C for 5 min. Put the tube strip back into the rack on ice.",
    "Make a master mix (for the required number of samples plus 1 sample) of the following (quantities for 1 sample): 4 µL of 5x RT buffer, 1 µL of RNase inhibitor (20 U/µL), 0.25 µL of reverse transcriptase (200 U/µL) and 1.75 µL of nuclease-free water. Dispense 7 µL in each tube using filtered tips. Change tip between samples.\nPerform RT in a thermal cycler by setting the following program: 10 min at 25 °C, 30 min at 50 °C, 5 min at 85 °C. Put the tube strips back on the rack on ice.\nPrepare and identify one set of RNase-free PCR tube strips and put them on the rack.\nFor each sample, prepare the desired volume of 1:5 diluted cDNA from the stock in the new tube strips using ultrapure water. The 1:5 diluted cDNA samples will be used for real-time PCR.\nOnce all samples are processed, start real-time PCR or store samples (stock and diluted samples) in a -20 °C freezer for later use.\n6. Real-time PCR for Gene Expression in Adipose Tissue\nNote: Avoid exposing the fluorescent dye to light. The protocol below describes the amplification of the reference gene s1614. The primers and the PCR conditions should be modified according to the gene of interest.\nWhether cDNA samples were freshly diluted 1:5 or pre-stored in a -20 °C freezer, gather all samples and reagents and allow them to thaw on ice until the start of the procedure.\nPut the rack for real-time PCR tube strips on ice. Once cold enough prepare and identify one set of real-time PCR tube strips and put them on the rack. Prepare each sample and the blank in duplicate.",
    "Make a master mix (for the required number of samples plus 1 sample) of the following (quantities for 1 sample): 1.9 µL of ultrapure water, 5 µL of fluorescent dye (e.g. SYBR green) and 0.3 µL of a forward primer and 0.3 µL of the reverse primer. Dispense 7.5 µL in each tube.\nAdd 2.5 µL of 1:5 diluted cDNA from each sample to the corresponding tube. Add 2.5 µL of ultrapure water for the blanks. Put the caps on each strip.\nFollow the manufacturer's instructions to set up the following program on the real-time PCR: 10 min at 95 °C and 40 cycles of 15 s at 50 °C, 30 s at 60 °C, 30 s at 70 °C. Put the sample strips into the rotor of the real-time PCR machine and start the program.\nNote: Thermal cycler conditions may vary depending on the apparatus used and the gene of interest. mRNA expression results presented in Figure 3 show leptin mRNA amplification normalized by the reference gene S16 mRNA amplification14,15.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}