{
  "id": 11243,
  "origin_website": "Jove",
  "title": "Soft Lithographic Functionalization and Patterning Oxide-free Silicon and Germanium",
  "procedures": [
    "1A. Primary Monolayer Formation on Silicon\nCut silicon wafer into 1cm2  substrates, dust and rinse with water and filtered ethanol.\nRemove organic contamination by submerging the  silicon substrates in a glass dish containing Nano strip at 75ºC. After 15  minutes, rinse each substrate with deionized, filtered water.\nPlace each substrate in a 5% HF solution  (Warning: HF is an extremely dangerous material) to remove the native oxide  layer. After 5 minutes dry the oxide-free silicon with nitrogen\nTo produce a chlorinated substrate, immediately submerge each oxide-free silicon piece in a scintillation vial containing 2 ml of saturated PCl5 in chlorobenzene. This solution should be filtered to 0.2 μm. \nAssemble a vial condenser on top of each vial and place them in a heatblock set to 112°C for one hour. \nAfter reaction is complete, let vials cool and rinse each surface with chlorobenzene and dry under filtered nitrogen.\nTo form a propenyl-terminates substrate, place each chlorinated silicon surface in a pressure vial containing 4 ml of propenyl magnesium chloride. Place each pressure vial in a heatblock at 130 °C for 24 hours. \nTake each pressure vial out of the heatblock and let cool.\nRinse each surface quickly with DCM and ethanol and dry under filtered nitrogen.\n1B. Primary Monolayer Formation on Germanium\nCut germanium wafer into 1cm2 substrates, dust and rinse with water and filtered ethanol.\nRemove organic contamination by submerging the surfaces in a glass dish containing acetone for 20 minutes\nPlace each surface in a 10% HCl solution for 15 minutes. This process simultaneously removes the native oxide layer and chlorinates the surface. After 5 minutes dry the substrates with nitrogen.",
    "To form an octyl-terminated substrate, place each chlorinated germanium surface in a pressure vial containing 4 ml of octyl magnesium chloride (2 mM). Place each pressure vial in a heatblock at 130 °C for 48 hours. \nTake each pressure vial out of the heatblock and let cool to room temperature.\nRinse each surface quickly with DCM and ethanol and dry under filtered nitrogen.\n2. NHS Substrate Functionalization on Silicon and Germanium\nPrepare a filtered 0.1 M NHS-diazirine solution in carbon tetrachloride. Warning: Keep light exposure to a minimum. \nPipet a few drops of the solution onto the methyl terminated surfaces. Allow solution to spread across the entire surface.\nPlace the surfaces under a UV lamp (☐=254 nm, 4400/cm2 at 0.74 inches). Allow the surfaces to react under UV light for 30 minutes, then add more NHS-diazirine to the surface and let the reaction proceed for an additional 30 minutes. \nRinse the NHS modified surfaces with DCM and ethanol and dry under filtered nitrogen.\n3. Small Molecule Functionalization\nReact NHS-modified substrates in a 20 mM tert-butyl carbamoyl (Boc-) ethylenediamine solution in dichloromethane (DCM) for two hours at room temperature. \nAfter the reaction, rinse the Boc-modified substrate with DCM and ethanol. \nDeprotect the Boc modified substrate using 25% trifluoroacetic acid (TFA) in DCM for one hour at room temperature. \nRinse the resulting surface with DCM, ethanol and 10% (w/v) potassium bicarbonate in water and dry under filtered nitrogen. \nAnalyze all surfaces by XPS to determine the elemental composition. \n4. Acidic Polyurethane Acrylate Stamp (PUA) Preparation\nDilute acrylate A by 30% with trimethylolpropane ethoxylate triacrylate B to reduce viscosity. Add photoinitiators C and D to the reaction mixture (Figure 6).",
    "Add sodium 2-mercaptoethanesulfonate (0.2 g, 1.22 mmol) to a 4N HCl solution in dioxane (10 ml) and stir at room temperature for 2 minutes.\nFilter off the sodium chloride first through a fine glass filter and then through a 0.2 μm PTFE membrane syringe filter to afford a clear solution of 2-mercaptoethanesulfonic acid  in dioxane. \nEvaporate dioxane under reduced pressure \nReact the resulting sulfonic acid with 2 ml of the polyurethane-acrylate prepolymeric mixture at room temperature and then under vacuum at 50 °C. Be sure to completely free the mixture from trapped air bubbles.\nCool the resulting solution to room temperature and polymerize between two glass microscope slides or a glass slide and a master by exposure to UV light for 2 hours at room temperature. \nAfter polymerization, carefully peel the stamp off the master and wash the stamp with ethanol and water and dry with filtered nitrogen. \n5. Catalytic Printing and SEM/AFM Analysis\nPlace the corresponding polyurethane-acrylate stamp on top of the NHS-modified substrate at room temperature for one minute with no external load to hold them together. \nAfter the reaction, separate the stamp and substrate.\nRinse the substrate with ethanol, water, and ethanol then dry with filtered nitrogen. \nRinse the stamp with ethanol, water, and ethanol then dry with filtered nitrogen.\nKeep stamps at room temperature before the next application.\nAnalyze the produced pattern using contact mode lateral atomic force microsopy (AFM) and scanning electron microscopy (SEM)\n6. Protein Patterning and Fluorescent Microscopy\nSubmerge the NHS-patterned bifunctional substrate in Lysine-N,N-diacetic acid (20 mM) and Et3N (100 mM) in DMF:H20 (1:1) at room temperature for 1 hr and then rinsed with water and ethanol. \nIncubate the substrates in a 50 mM NiSO4 solution for 5 min at room temperature.",
    "Rinse the chelated substrates excessively with water and binding buffer (20 mM NaP, 250 mM NaCl, 10mM imidazole, pH 7.5) and submerge in a filtered GFP solution (˜40 μM) for 1 hr at 0°C. \nImmediately rinse the substrates with binding buffer followed by PBS (pH 7.4). \nKeep substrates hydrated in PBS at 0°C until they were ready for fluorescence microscopy analysis.\n7. Protein Patterning and Fluorescent Microscopy\nSubmerge the NHS-patterned bifunctional substrate in Lysine-N,N-diacetic acid (20 mM) and Et3N (100 mM) in DMF:H20 (1:1) at room temperature for 1 hr and then rinsed with water and ethanol. \nIncubate the substrates in a 50 mM NiSO4 solution for 5 min at room temperature. \nRinse the chelated substrates excessively with water and binding buffer (20 mM NaP, 250 mM NaCl, 10mM imidazole, pH 7.5) and submerge in a filtered GFP solution (˜40 μM) for 1 hr at 0°C. \nImmediately rinse the substrates with binding buffer followed by PBS (pH 7.4). \nKeep substrates hydrated in PBS at 0°C until they were ready for fluorescence microscopy analysis.\n8. Representative Results: \nAn example of soft-lithographic catalytic nano patterning is shown in Figure 7. The approach creates chemoselective patterns on oxide-free silicon and germanium, which can be orthogonally functionalized with dissimilar chemical and biological moieties. The reaction between the NHS-functioanlized substrate and the catalytic patterned stamp leads to the hydrolysis of NHS moieties in areas of conformal contact, yielding a patterned bifunctional substrate bearing regions of NHS activated and free carboxylic acids. Due to the diffusion free nature of our method, we achieve resolution close to that of photolithography. For example, Figure 7 shows 125 nm features, which were uniformly reproduced across the entire silicon substrate surface. Remarkably, the catalytic stamp can be reused multiple times without losing efficiency.",
    "Chemoselective functionalization of patterned semiconductors with biomolecules opens up the prospect of integrating traditional electronic materials with highly selective biological substrates for applications in sensing, diagnostic, and analytical areas of research. An example of such functionalization is shown in Figure 8, where NHS-patterned silicon was selectively functionalized with protein molecules. By exploiting the differential reactivities of activated and free carboxylic acids, we first affixed nitrilotriacetic acid-terminated (NTA) heterobifunctional linkers to the NHS-functionalized regions, and then used the resulting NTA-patterned surface as a template for the selective attachment of hexa-histidine-tagged GFP. Figure 8b clearly shows differential fluorescence intensity between GFP-modified and hydrolyzed free carboxylic acid regions. The size and shape of the replicated features are consistent between both NHS patterned surface (Figure 8a) and GFP-modified surface (Figure 8b), confirming the remarkable stability of carbon-passivated surfaces and the selectivity of the stamping approach. The protocol is not limited to His-tagged protein, and can be used to pattern other biomolecules including DNA and antibodies.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig1.jpgFigure 1. General scheme representing catalytic microcontact printing\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig2.jpgFigure 2. Structure of bi-layered molecular system on Ge and Si. Primary alkyl monolayer forms stable Ge-C or Si-C bonds with the substrate and provides a chemically inert and close packed system that protects the underlying surface from degradation.(b) Secondary overlayer forms stable C-C bonds with primary protective layer and provides terminal functional groups\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig3.jpgFigure 3. Reaction schemes representing formation of primary protective monolayers on Si (A) and Ge (B)\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig4.jpgFigure 4. Chemical functionalization of the primary protective monolayer with a heterobifunctional carbene donor\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig5.jpgFigure 5. Reaction scheme demonstrating small molecule modifications of NHS-functionalized substrates and the corresponding XPS spectra\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig6.jpgFigure 6. Composition of the catalytic pre-polymeric mixture, polymerization conditions, and SEM images of the patterned sulfonic acid-modified stamp and the corresponding PMMA-Si master",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig7.jpgFigure 7. SEM and AFM friction images of patterned SAMs on Si and Ge with an acidic stamp\nimgsrc://cloudfront.jove.com/files/ftp_upload/3478/3478fig8.jpgFigure 8. Soft-lithographic patterning and functionalization of passivated silicon with organic and biological molecules. a: SEM image of the patterned NHS-modified substrate. b: Fluorescent micrograph of GFP modified substrate."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}