{
  "id": 12043,
  "origin_website": "Jove",
  "title": "Prostate Organoid Cultures as Tools to Translate Genotypes and Mutational Profiles to Pharmacological Responses",
  "procedures": [
    "All work described in this protocol has been performed with previously established murine organoids and patient-derived organoids. All animal work was performed in compliance with the guidelines of Research Animal Resource Center of Memorial Sloan Kettering Cancer Center (IACUC: 06-07-012). All patient-derived tissues were collected in compliance with rules and regulations of Memorial Sloan Kettering Cancer Center (IRB: 12001).\n1. Medium and buffer preparation\nThaw basement membrane matrix (e.g., Matrigel) at 4 °C overnight before starting the experiment. Keep it on ice during use.\nPlace culture plates at 37 °C for 24 h prior to experiments. This will help the basement membrane matrix dome (hereafter referred to as matrix dome) to polymerize. Plating organoids is described in step 2.1.2.\nPrepare the organoid medium according to the established protocol5.\nPrepare the organoid medium without the addition of epidermal growth factor (EGF; see Table of Materials for components). EGF suppresses the AR transcriptional output and confers anti-androgen resistance5.\nPrepare Dulbecco's Modified Eagle medium (DMEM) with 10% fetal bovine serum (FBS).\n\tNOTE: This media is used to inhibit the enzymatic digestion with trypsin replacement in sections 2-4.\nPrepare drug solutions according to the manufacturer's protocol. For enzalutamide/mdv3100 (hereafter referred to as second generation anti-androgen), prepare a stock solution of 100 µM in dimethyl sulfoxide (DMSO). Stock can be stored at -20 °C for up to 6 months and does not have to be made fresh.\n2. Isolation, enzymatic digestion, and establishment of organoids\nIsolate prostate organoids from mouse or human tissue according to the previously established protocols5,7. A brief description is provided below.\n\t\nMince and enzymatically digest prostate tissue to produce a single cell suspension. In this experiment, 1 mL of 5 mg/mL collagenase type II in ADMEM/F12 was used for the digestion of 50 mg of prostate tissue.",
    "Collect cells by centrifugation at 300 x g for 5 min, count the cells, resuspend them in the basement membrane matrix, and plate at the appropriate density5,7 in the matrix domes on pre-warmed organoid culture plates (plating method is shown in Figure 1A).\nAllow the domes to solidify and add media onto the tops of the domes so that they are completely covered.\nGrow organoids to the desired quantity for downstream applications. Cell number can be determined by standard counting methods. See the application-specific section of the protocol for additional details on density.\nUsing a P1000 pipette, draw up the medium and pipette up and down to disrupt. When basement membrane matrix is fully disrupted, transfer the suspension to a 15 mL conical tube. Do not place more than 10 domes per single 15 mL conical tube. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and wash the cell pellet with 5 mL of PBS. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and resuspend the pellet in 4 mL of trypsin replacement. Digest for 5-10 min with shaking at 37 °C. Add an equal volume of organoid medium + 10% FBS to inhibit the trypsin replacement. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and resuspend in 1 mL of PBS.\nFilter the suspension with a 40 µm filter to ensure a single cell suspension. Quantify the cell number using a hemocytometer or equivalent counting device.\n\tNOTE: If obtaining viable single cells is difficult, use flow sorting to obtain a single cell solution.\n3. Assessing organoid formation capacity",
    "NOTE: To determine the percentage of cells that can generate an organoid, a seeding assay can be performed as a proxy for the stem/progenitor potential. The organoid formation capacity is also important for defining a cell seeding number for the viability assays.\nDilute the cell suspension obtained in step 2.7 to 100 cells per 10 µL of the suspension using organoid medium containing 10 µM Rho kinase inhibitor Y-27632.\nTransfer 1,100 cells (110 µL of suspension) to a new conical tube.\nAdd 285 µL of basement membrane matrix and resuspend the cells. This will result in a ~70% matrix concentration.\n\tNOTE: Dilution of the basement membrane matrix during seeding greatly reduces the variation in dome size, caused by the viscosity of the protein matrix.\nSeed cells in 35 µL of matrix domes in a pre-warmed 24 well plate, resulting in 200 cells/well. Plate 3-5 replicates per sample (also see plating method in Figure 1A and step 2.1.2).\nTo ensure that the cells remain within the matrix dome, flip the plate and place it in a cell incubator to solidify the basement membrane matrix.\nAfter 10 min, remove the plate from the incubator and add medium containing the Rho kinase inhibitor.\nRefresh the medium every 2 days. After 7 days, quantify the number of organoids. Keep the Rho kinase inhibitor in media throughout the experiment.\nCount the number of organoids established per dome and calculate the percent of organoids formed out of the total number of cells plated (200 cells).\n\tNOTE: Organoid establishment ratios vary from 3%-60% depending on the cell type and genotype.\n4. Determining pharmacological responses of organoids\nContinuing from step 2.7, seed 1,000-10,000 cells in a matrix dome. Use the organoid formation efficiency and growth speed as a proxy for determining the final cell number.",
    "NOTE: Recommended cell numbers are provided in Table 1. Use three to five replicates per condition per analysis. Use a final concentration of 70% basement membrane matrix to reduce pipetting errors induced by the viscosity.\nSeed 35 µL of matrix domes in a 24 well plate and let the domes solidify as done in section 3 (also see plating method in Figure 1A and step 2.1.2). Add medium containing the Rho kinase inhibitor and drug of choice. This method can be applied to all drugs, but in this protocol, a second-generation anti-androgen is used at 10 µM for an example. To determine half maximal inhibitory concentration (IC50), perform a log10 incremental, and as a control, use the vehicle in which the drug was dissolved.\nRefresh the medium every two or three days and analyze the organoids on day 7 to determine the pharmacological response of the drug. The timepoints may vary among the choice of experiment and drug.\n\tNOTE: Organoids do not have to be trypsinized to perform these assays.\nTo keep organoids intact, using a P1000 pipette, draw up the medium and pipette up and down to disrupt the basement membrane matrix.\nWhen the basement membrane matrix is fully disrupted, transfer the suspension to a 15 mL conical tube. Do not transfer more than 10 matrix domes per 15 mL conical tube.\nCentrifuge at 300 x g for 5 min. Draw off the supernatant and wash with 5 mL of PBS.\nResuspend organoids in 1 mL of PBS and disrupt the organoids using trituration and a glass Pasteur pipette.\nQuantify the number of organoid fragments. Seed 5 replicates containing 100 organoid fragments as described in step 2.1.2.\nPerform the cell viability assay as described below in section 7.\n5. RNA isolation from organoids",
    "NOTE: Commercially available column-based methods yield good quantity and quality of RNA. To ensure good quantity RNA, use a minimum of one dome per sample; however, using three domes is recommended, which can be seeded in a single well of a 12 well plate.\nAdd ß-mercaptoethanol (1%) to the glutathione lysis buffer in the RNA isolation kit.\nDraw off the medium from the basement membrane domes containing organoids and add 750 µL of this buffer. Pipette up and down using a P1000 pipette. Check that all the basement membrane matrix has been dissolved.\nAdd 750 µL of 70% ethanol and mix by pipetting. Subsequently transfer 700 µL of the mixture to the column, centrifuge at 12,000 x g for 1 min, and repeat with the remainder of the lysate.\nPerform washes and on-column DNase treatment according to manufacturer's instructions. Elute RNA in 30-50 µL of RNAse-free water.\nMeasure the concentrations using a fluorometer at OD = 260 nm and 280 nm and store at -80 °C or continue with downstream applications.\n6. Protein isolation from organoids\nNOTE: For protein isolation, prepare standard RIPA buffer containing phosphatase and protease inhibitors (Table of Materials). Using at least three domes is recommended, which can be seeded in a single 12 well.\nUsing a P1000 pipette, draw up the medium from the cell with the basement membrane domes containing organoids and pipette up and down to disrupt the basement membrane matrix.\nWhen fully disrupted, transfer the suspension to a 15 mL conical tube. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and wash with 5 mL of ice-cold PBS. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and resuspend the pellet in 4 mL of trypsin replacement. Digest for 5-10 min while shaking at 37 °C.",
    "Add an equal volume of organoid medium + 10% FCS to inhibit the trypsin replacement. Centrifuge at 300 x g for 5 min.\n\tNOTE: Post-centrifugation, no basement membrane matrix should be visible in the pellet.\nDraw off the supernatant and wash with 5 mL of ice-cold PBS. Draw off the supernatant and resuspend the cell pellet in 300 µL of lysis buffer using a P1000 pipet, then transfer to a 1.5 mL microcentrifuge tube.\nIncubate on ice for 10 min and subsequently sonicate 2x for 30 s each at cooled water with a temperature of 4 °C. Place the tube back on ice and perform protein quantification using standard methods.\nDenature the protein by adding sodium dodecyl sulfate (SDS) containing loading dye and boil for 5 min at 95 °C. Store lysates at -80 °C or continue with downstream applications.\n7. Cell viability assay with organoids\nNOTE: Cell viability can be assessed using the commercially available cell viability assay kit and a luminometer. Prepare buffers according to the manufacturer's instructions. Five replicates per condition is recommended: one replicate consisting of one 35 µL basement membrane matrix dome in one well of a 24 well plate.\nDraw off the medium of the organoid culture, being careful to leave the matrix domes intact.\nAdd 65 µL of PBS and pipette up and down to disrupt the matrix dome.\nAdd 100 µL of the cell viability assay kit buffer and resuspend by pipetting.\nIncubate at room temperature (RT) for 10 min with shaking.\nTransfer 100 µL of mixture to a non-translucent plate suitable for the luminometer and perform reading according to the manufacturer's instructions for the cell viability assay kit.\n8. Preparation of organoids for xenografting",
    "NOTE: Organoids are also amenable for subcutaneous grafting in both immune compromised animals, as well as, isogenic mice. To ensure injected organoids are distinguishable in vivo, label organoids with a constitutively expressing fluorophore5. It is recommended to perform a pilot experiment for grafting using 5 x 105 cells to 2 x 106 cells per injection, with increments of 5 x 106 cells, as grafting efficiency varies between organoid lines.\nUsing a P1000 pipette, draw up the medium and pipette up and down to disrupt the basement membrane matrix. When fully disrupted, transfer the suspension to a 15 mL conical tube. Centrifuge at 300 x g for 5 min.\n\tNOTE: Do not transfer more than 10 matrix domes per 15 mL conical tube.\nDraw off the supernatant and wash with 5 mL of PBS. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and resuspend the pellet in 4 mL of trypsin replacement. Digest for 5-10 min while shaking at 37 °C.\nAdd equal volume of organoid medium + 10% FBS to inhibit trypsin replacement. Centrifuge at 300 x g for 5 min.\nDraw off the supernatant and resuspend in 1 mL of PBS. Filter the suspension with a 40 µm filter to ensure a single cell suspension. Quantify cells using standard methods.\nSpin down and resuspend the cells in PBS + Rho inhibitor to a concentration of 2 x 106 cells per 100 µL (see Table 2 for cell concentrations and absolute cell number needed for varying concentrations). Use an equal volume of basement membrane matrix to generate a 1:1 suspension. Place the suspension on ice.\nInject cells according to standard protocols and monitor xenograft growth using standard methods8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}