{
  "id": 17707,
  "origin_website": "Jove",
  "title": "In Vitro Assessment of Cardiac Function Using Skinned Cardiomyocytes",
  "procedures": [
    "All animal experiments comply with the Guide for the Care and Use of Laboratory Animals (NIH Publication no. 85-23, revised 2011) and the Portuguese law on animal welfare (DL 129/92, DL 197/96; P 1131/97). The competent local authorities approved this experimental protocol (018833).\n1. Stock solution preparation (Table 1)\nPrepare 1,000 mL of relaxing solution for cardiomyocytes' isolation (RELAX-ISO) by following instructions in Table 2. Dissolve the reagent above in ≈500 mL and adjust the pH to 7.0 with KOH. Adjust the final volume to 1000 mL.\n\t\nDistribute RELAX-ISO in 50 mL tubes. Store at -20 °C.\nPrepare 250 mL of activating solution by following the instructions in Table 3. Dissolve the reagents above in ≈100 mL of ultra-pure water. Adjust the pH to 7.1 with 5 M KOH at 15 °C.\n\tNOTE: Usually, it is necessary to add a significant amount of KOH to reach the desired pH. Put the volumetric balloon in a box with ice to cool down the solution to 15 °C.\n\t\nAdjust the final volume to 250 mL. Agitate this solution continuously with a magnetic stirrer until the moment of mixing it with the relaxing solution.\nPrepare 100 mL of relaxing solution by following the instructions in Table 4. Dissolve the reagents above in ≈50 mL of ultra-pure water. Adjust the pH to 7.1 with KOH 5 M at 15 °C.\n\tNOTE: Usually, it is necessary to add a significant amount of KOH to reach a pH of 7.1. Place the volumetric balloon in a box filled with ice to cool down the solution to 15 °C. The ionic strength of the solutions used during the measurements amounted to 180 mM.\n\t\nAdjust the final volume to 100 mL. Agitate this solution continuously with a magnetic stirrer until the moment of mixing it with activating solution.",
    "Mix activating and relaxing solutions in the proportions presented in Table 5 to obtain pCa solutions between 5.0 and 6.0.\n\t\nAlways keep relaxing and activating solutions agitating while mixing both.\nAliquot each mixture to 2 mL microtubes. Store all the microtubes at -20 °C.\nPrepare a different batch of pCa solution (4.5 to 6.0) for each protocol.\n2. Calibration of the force transducer\nNOTE: The calibration of the force transducer is a routine procedure that should be performed every couple of months or whenever it is suspected to be uncalibrated. The force transducer is highly sensitive and is easily broken. It should be gently handled in every step of its usage, including calibration, gluing of the cardiomyocyte and cleaning.\nDetach the force transducer from the rest of the apparatus.\nWith the help of a clamp, place the force transducer horizontally in such a way that the needle points downward in the same orientation that the cardiomyocyte will develop force. This will facilitate hanging a series of masses with known weights (elastic band, suture or pin).\n\tNOTE: Check the characteristics of the force transducer before proceeding to this step to check the scale factor [mg/volt] and to avoid excessive weight on the transducer. For the force transducer model, the scale factor is 50 (50 mg correspond to 1 volt) and we use 5 weights between 12.5 and 250 mg.\nTurn the force transducer on and let it warm up for 30 min.\nStart by hanging the lighter mass on the force transducer and registering the corresponding voltage measured at FORCE OUT.\n\t\nRepeat this procedure for up to five weights.\nPlot force applied to the force transducer (load) versus voltage and check for linearity.",
    "If there is no linearity, adjust the zero and gain potentiometers in the circuit board of the transducer. Check its specific instruction for further information.\n\t\nTurn the zero potentiometer until the output voltage reads 0.0 V.\nHand a medium weight on the transducer needle and adjust the gain potentiometer to read the corresponding voltage (for instance, 50 mg correspond to 1 V). Remove the weight and re-adjust the zero potentiometer to 0.0.\nRepeat step 2.6.2 until the output with and without the weight are correct.\nMount the force transducer back into the apparatus.\n3. Setting the experimental apparatus\nThaw one vial of each of the activating, 4.5, 5.0, 5.2, 5.4, 5.6, 5.8, 6.0 and relaxing solutions and maintain them on ice.\n\tNOTE: ATP and PCr are labile compounds that should be maintained at cold temperatures.\nPrepare the microscope, testing apparatus and associated computer for use (Figure 1).\nAdjust the temperature so that the in-chamber thermometer reads 15 °C. Perform all experiments at this temperature except for kinase and phosphatase incubations (20 °C).\nTurn on the force-transducer and the motor.\n4. Extraction and permeabilization of skinned cardiomyocytes\nDefrost 50 mL of RELAX-ISO solution.\nTurn on the centrifuge and fast cool it up to 4 °C.\nThaw 3-5 µg of a myocardial sample in a Petri dish containing 2.5 mL of RELAX-ISO solution.\nCut the tissue in small pieces with a scalpel blade (Figure 2). Cut the sample in a precise way to avoid unnecessary cells damage.\nTransfer the 2.5 mL of RELAX-ISO solution with the tissue to a Potter-Elvehjem glass using a cut pipette tip.\nMechanically disrupt the tissue with a grinder at a rotation speed of 30-40 rpm. Press the tissue 3 times for 2 s each to obtain a good cell suspension.",
    "Prepare 10% Triton in RELAX-ISO solution (250 µL of Triton with 2.25 mL of RELAX-ISO) in a 15 mL tube and add this solution to the cell suspension.\nGently mix by inverting the tube 3 times.\nIncubate at room temperature for 1 min and 4 min on ice.\nWash out the Triton by adding RELAX-ISO up to the top of the 15 mL tube; gently mixing (inverting 3 times the tube) and finally spinning down the cells in an angled centrifuge (1 min at 348 x g). Remove the supernatant up to 3 mL above the cell pellet.\n\tNOTE: Remove the supernatant gently to avoid disturbing the cell pellet. Still, some cells in supernatant will be inevitably lost.\nRepeat the step 4.10 at least 4 times or until no more bubbles produced by Triton residues are observed.\n\tNOTE: The more wash-out steps are made, the more cells are lost with the discarded supernatant.\nIn the last wash-out, remove the supernatant up to a volume of 5-10 mL of cell suspension.\n5. Selecting and gluing the skinned cardiomyocyte\nPut a cell suspension drop on a coverslip on top of a glass slide in the microscope slide holder (Figure 1).\nSelect a single rod-shaped cardiomyocyte with a good striation pattern and size (Figure 2).\nFind the needle tips of the force-transducer and the motor using the lowest magnification of the inverted microscope.\nRotate the coverslip to position the selected cardiomyocyte horizontally so that its ends are aligned with the needle of the force transducer and the motor (Figure 2).\nPlace a thin line of glue on the side of the coverslip with the help of a swab tip (Figure 2).",
    "Immerse the needle tips of the force transducer and the motor into the glue line to create a glue halo around both tips.\n\tNOTE: Steps 5.6 - 5.10 are accomplished through careful use of the motorized micropositioners.\nQuickly move the needle tips close to the focal plane of the cardiomyocyte.\nMove the needle tip of the force transducer down so that it glues to one edge of the cardiomyocyte.\nRepeat this procedure with the tip of the motor and the other extremity of the cell.\n\tNOTE: This procedure must take less than 2-3 min as the glue starts to cure very fast.\nAfter 5-8 min, lift the needles ≈15 µm to avoid gluing the cell to the coverslip. This is done by moving up both micromanipulators simultaneously.\nLet the glue cure. This procedure can last from 15 to 45 min, depending on the type of glue. In our case, the cardiomyocyte is adequately glued after ≈15 min.\n6. Recording force measurements of active, passive and Ca2+ sensitivity\nFill the first experimental well with the relaxing solution (55-100 µL in the experimental apparatus) and the second experimental well with activating solution.\nUsing the camera software, place the region of interest (ROI) in an area of the cardiomyocyte with a clear pattern of striation.\n\tNOTE: For cardiac myocytes, the operating sarcomere length varies between 1.8 and 2.2 µm, and the optimal sarcomere length is around 2.15 µm.\nMeasure the distance between the two extremes of the cardiomyocyte (from the motor to the transducer glue halo, Figure 3) after the optimal sarcomere length has been set (2.2 µm). Record the value as myocyte length in the software.\nMeasure cardiomyocyte width and depth, the latter with the aid of a prism mirror placed perpendicular to the cell.",
    "NOTE: A powerful, external light source will be required to visualize the cell through the prism. In case there is no prism, and assuming that cardiac cells have an elliptical shape, cardiomyocyte depth can be inferred as 70% of cardiomyocyte width.\nCalculate cross-sectional area (CSA, mm2) assuming an elliptical shape of the cardiomyocyte.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60427/60427eq1.jpg\nGently move the microscope stage so that the cell moves from the coverslip to the well containing relaxing solution on the back of the stage.\n\tNOTE: This procedure can easily damage the cell. Before moving the cell, gently move the needles up a bit more. Avoid removing the cell out of the solution.\nSelect the protocol in software that contains two cell shortening (80% of its initial length), that will occur when the cell is emerged in Ca2+ solution and in relaxing solution, respectively (Figure 1, Supplementary File).\n\tNOTE: First \"Slack\" of the cell will be performed within activating solution and the second \"Slack\" within relaxing solution. By doing this, the user will be able to calculate the total force (Ftotal) of the cell from the 1st and the passive force (Fpassive) of the cell from the 2nd. Use the formula to calculate active force, Factive = Ftotal - Fpassive. The cell is shortened 80% in order to detach all cross-bridges record force.\nElicit isometric contraction by moving the microscope stage so that the cardiomyocyte moves from the relaxing to the activating solution (pCa=4.5(1)).\n\tNOTE: If the cell is functional, it will immediately contract.\nUpon reaching force plateau, start recording the force data.\n\tNOTE: The tests can be done individually. Depending on software there is the possibility to create a sequence of tests that will correspond to the different Ca2+ solutions within a Ca2+-sensitivity protocol (Figure 1, Supplementary File).",
    "Wait ~10 s and then switch the cell immersed in activating solution.\n\tNOTE: It is important to wait 10 s before immersing the cell in relaxing solution. If the cell is moved too early, important data to calculate the redevelopment force of the cell (ktr value) might be lost.\nQuickly move the stage so that the cardiomyocyte immerses in the relaxing solution.\nWait until the test stops.\nRepeat steps 6.8 - 6.12 so that the cell is activated twice in activating solution (pCa=4.5(2)).\n\tNOTE: Typically, after the first activation, cardiomyocyte ends can slightly detach from the needle tips, changing the cardiomyocyte length, CSA and/or the sarcomere length. Readjust to the desired sarcomere length and introduce the corrected dimensions in the software.\n\t\nContinue to step 6.13.2 for Ca2+ sensitivity protocol or save the data, if values of passive and active force of the cell are the only parameters needed and detach the cell from needles and clean them with acetone to remove the glue.\nAdjust the sarcomere length of the cell to 2.2 µm by slightly stretching it again, if necessary.\nReplace the activating solution by the next Ca2+ solution (55-100 µL here). Repeat steps 6.8 - 6.12.\nReplace the activating solution by the next Ca2+ solution (55-100 µL here) and repeat steps 6.8 - 6.12 until all solutions have been tested (5.0, 5.2, 5.4, 5.6, 5.8, 6.0).\nLastly, re-activate the cell with activating solution (pCa4.5(3)). Repeat steps 6.8- 6.12.\n7. Incubation with kinases and phosphatases\nAfter performing the selected baseline protocol, dilute the kinase/phosphatase in Relaxing solution at the recommended concentration.\n\tNOTE: It is recommended to carry out a dose-response curve prior to the experiment.\nSet the temperature of the experimental wells to 20 °C.\nFill the experimental wells with kinase/phosphatase, relaxing solution and activating solution (55-100 µL).",
    "Gently move the microscope stage so that the cell becomes immersed in the well containing kinase/phosphatase.\nIncubate the cardiomyocyte with the kinase/phosphatase for at least 30 min or according to the manufacturers' instructions.\nRepeat the selected baseline protocol.\n8. Finalizing the experiment\nUnglue the cardiomyocyte from the tips of the force transducer and motor by stretching the cell.\nCarefully remove the glue halo from the needle tips using a cotton swab soaked in acetone.\nShut down the equipment.\n9. Analyzing the data\nCollect all files from each cardiomyocyte tested.\n\tNOTE: Each test will correspond to one file. This means that for each Ca2+ solution or sarcomere length, there will be a corresponding file.\nCalculate active and passive forces of a single cardiomyocyte.\n\t\nOpen the file corresponding to first activation (pCa=4.5(1)) using a spreadsheet (Figure 3A, Appendix A in Supplementary File).\n\t\tNOTE: We used a custom-made program to perform the analysis. Please see Appendix A in the Supplementary File.\nAverage ≈60 values before and average ≈60 values after the 1st slack of the cell (when the cell is immersed in Ca2+ solution). These 2 values correspond to a and b, respectively.\nRepeat the same analysis for the 2nd slack of the cell (when the cell is immersed in relaxing solution). These 2 values correspond to c and d, respectively.\nCalculate the difference between a and b (total force, Ftotal).\nCalculate the difference between c and d (passive force, Fpassive).\nCalculate active force, Factive = Ftotal - Fpassive.\nNormalize all force values to CSA (see formula above) to obtain the total tension (Ttotal), passive tension (Tpassive) and active tension (Tactive).\nRepeat step 9.2.1 to 9.2.5 for the 2nd activation (pCa=4.5(2)).\nConsider these values as those representing Ttotal, Tactive and Tpassive of the cardiomyocyte under analysis.",
    "NOTE: The first activation of the cell with pCa4.5(1) is usually associated with alterations in cell dimensions. For this reason, the 2nd activation with pCa4.5 is more accurate and is the one to be used.\nRepeat the steps 9.2.1 to 9.2.5 for each file/pCa tested solutions (5.0, 5.2, 5.4, 5.6, 5.8, 6.0, 4.5(3)).\nCalculate pCa50 and nHill of a single cardiomyocyte.\n\tNOTE: For this analysis, use the non-normalized Factive values from the files 4.5(2), 5.0, 5.2, 5.4, 5.6, 5.8, 6.0 and 4.5(3).\n\t\nPlace in a spreadsheet file all non-normalized values of Factive for each Ca2+ solution tested (4.5(2),5.0, 5.2, 5.4, 5.6, 5.8, 6.0, 4.5(3)).\nCalculate the correction factor = Factive [4.5(2)] - Factive [4.5(3)] / 7.\nCalculate the corrected values of Factive for each Ca2+ solutions (5.0, 5.2, 5.4, 5.6, 5.8, 6.0) by subtracting Factive - correction factor.\nCalculate the relative force (Frelative) for each Ca2+ solutions by normalizing each Factive values by the corresponding corrected value.\n\t\tNOTE: The Frelative [4.5(3)] should equal 1. Each experimental protocol begins and ends with a control activation at saturating Ca2+ concentration (pCa 4.5(2) and 4.5(3)). This allows force normalization and assessment of the rundown of the preparations through the comparison of changes in maximal Ca2+-activated force (Fmax). If at the end of the experimental protocol, the cardiomyocyte produces less than at least 70% of the maximum force of the first contraction, that cell/measurement should be excluded from the analysis.\nUse the Frelative and the corresponding pCa values to fit to a sigmoidal curve with the following equation F(Ca) = CanHill/ (Ca50nHill + CanHill).\nExtrapolate pCa and nHill values from the equation above mentioned.\nCalculate the rate of force redevelopment (ktr) of a single cardiomyocyte.\n\t\nPerform a fit to the curve that corresponds to the values immediately after the 1st cell slack.",
    "Calculate the slope of the curve and this value will correspond to the rate of force redevelopment.\nRepeat step 9.4.1 and 9.4.2 for each Ca2+ solution.\n\t\tNOTE: A poor curve fit will be obtained for the lowest Ca-solutions (R squared≤0.90)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}