{
  "id": 11906,
  "origin_website": "Jove",
  "title": "Analysis of Lymph Node Volume by Ultra-High-Frequency Ultrasound Imaging in the Braf/Pten Genetically Engineered Mouse Model of Melanoma",
  "procedures": [
    "All methods described here have been approved by the Italian Ministry of Health (animal protocols #754/2015-PR and #684/2018-PR).\n1. Melanoma induction\nNOTE: Six-week-old Tyr::CreER+,BrafCA/+,Ptenlox/lox mice [B6.Cg-Braftm1Mmcm Ptentm1Hwu Tg(Tyr-cre/ERT2)13Bos/BosJ (Braf/Pten)] were used in this study (see the Table of Materials).\nTreat the mice with 4-hydroxytamoxifen (4-HT) by applying 3 µL of 5 mM 4-HT on ~1 cm2 of shaved skin of the upper back, as described previously11,16,17, for 3 days in a row.\n\tNOTE: This will activate the Cre enzyme and cause a switch from wt Braf to BrafV600E and the loss of Pten. These two hits are enough to induce melanoma formation.\nObserve that primary tumors develop at the site of the skin painting in 2-3 weeks and reach a volume of 50-100 mm3 in 4 weeks. Also, observe metastases to other skin sites, lymph nodes, and lungs at this time point (t0).\nUse calipers to measure the volume of the primary tumor and of subcutaneous metastases, and ultrasound imaging to measure the volume of the inguinal lymph nodes. Repeat these measurements after one week (t1, 5 weeks after skin painting) and after two weeks (t2, 6 weeks after skin painting).\nAt the last time point, euthanize the mice by overdosing with gaseous sevorane.\nAnalyze the primary tumor and lymph nodes by visual inspection, then excise them for histological studies, as reported in16.\n2. Imaging procedure\nPlace the mouse in an induction chamber for gas anesthesia and supply 3% isoflurane in pure oxygen until the animal is fully anesthetized. Verify the depth of anesthesia by lack of response to paw pinch.",
    "Transfer the animal to a heated board - a constitutive part of the UHFUS imaging station - holding the animal in a supine position. Use a rectal probe lubricated with petroleum jelly to measure the body temperature. Adjust the board temperature to maintain the mouse's body temperature in the physiological range (36 ± 1°C).\nMoisten the mouse's eyes with vet ointment to prevent dryness during anesthesia. Supply narcotic gas (1.5% isoflurane in pure oxygen) through a mouse's nose mask. Adjust the percentage of isoflurane to maintain the correct depth of anesthesia.\nCoat the fore and hind paws with conductive paste and tape them to the ECG plate electrodes embedded in the board. Check that the physiological parameters (heart rate, respiration signal, and core body temperature) are correctly acquired and displayed.\nRemove hair from both inguinal areas by applying a depilatory agent and coat them with an acoustic coupling medium.\nClamp the UHFUS linear probe (40 MHz center frequency) into a specialized 3D motor embedded in the UHFUS imaging station, allowing automated and stepwise movement of the probe.\nProperly orient and adjust the position of the ultrasound probe to obtain short-axis images of the inguinal lymph node (left/right), and place the region of interest in the focal zone.\nScan the entire volume of the inguinal lymph node as a sequence of 2D B-mode images, as described previously18. Acquire images at multiple levels of the lymph node by linear movement of the transducer with step sizes on a micrometer scale, to generate 3D data in terms of automatically respiration- and cardiac-gated cine loops.",
    "Set the image recording with the following parameters: scan distance ranging between 2 and 5 mm (depending on lymph node size); step size 44 µm, with an outcome of 46-114 scan steps/lymph node slices and an acquisition time of 1-3 min per animal. Digitally store the acquired images in raw format (DICOM) for further offline analyses.\nAt the end of the imaging session, discontinue the gas anesthesia and allow the animal to recover on the heating board in sternal recumbency. Take care of the animal until it has regained sufficient consciousness to maintain the prone position.\n3. Post-processing of ultrasound images\nOpen the dataset of DICOM 3D images of the left/right inguinal lymph node in the software platform for ultrasound image post-processing.\nSegmentation:\n\t\nSelect Multi-slice Method to visualize both the current frames and thumbnails of all frames corresponding to each image captured during the 3D acquisition.\nSelect the thumbnail of the first frame to load it into the contouring view. In the contouring view, left-click on the mouse to drop points along the border of the lymph node. Once the desired number of points has been set (range 10-15), right-click to complete the contour.\nAfter the first contour is completed, use the thumbnail view to select the next image for contouring. If required, skip over several images (average of 3 frames) between contours to reduce the number of manual traces needed for each 3D volume.\n\t\tNOTE: The software platform for ultrasound image post-processing will automatically generate contours between manual traces, thereby reducing the time of analysis.\nRepeat this process until the entire volume has been outlined. Once complete, click on Finish.\nGeneration of the 3D wireframe and volume measurement:",
    "While in the 3D mode window workspace, click on the Volume measurement icon beneath the image display area to activate the surface view.\n\t\tNOTE: The surface view creates a compilation view that maps the user-generated volume to the acquired image. The surface view can be rotated into any desired position.\nTake note of the volume measurement listed in the lower left-hand corner of the cube view.\n\t\tNOTE: Segmentation and 3D volume generation can also be obtained using custom-developed software and/or freely available/commercial software for general image processing. Starting from manual segmentation, the software should provide a mathematical and/or pixel-level description of the lymph node contours. These contours would be combined in a 3D space to render the external surface of lymph nodes. All steps described in the imaging procedure and the post-processing of ultrasound images are summarized in Figure 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}