{
  "id": 15357,
  "origin_website": "Jove",
  "title": "Genome Editing and Directed Differentiation of hPSCs for Interrogating Lineage Determinants in Human Pancreatic Development",
  "procedures": [
    "This protocol is based on our work with hPSC lines H1, HUES8, and MEL-1 in the chemically defined and feeder-free condition (Please see the Material and Equipment Table). For other hPSC lines or hPSCs maintained in different culture conditions, further optimization is recommended.\n1. hPSC Culture in the Chemically Defined and Feeder-free Condition\nAdapt the hPSC culture on iMEF feeders to the feeder-free condition. In cases where frozen cells do not survive well when directly recovered in the feeder-free condition, recover cells in iMEF condition first and then adapt to the feeder-free condition.\n\tNOTE: In general, it takes 2 passages for hPSCs cultured on iMEF feeders to be adapted to the feeder-free condition.\nChange the medium every day and passage the hPSCs when the cells have reached ~80% confluency. In general, passage hPSCs at ~ 1:6 - 1:15 ratios every 4 - 6 days. Add 10 µM ROCK inhibitor Y-27632 when thawing or passaging the cells.\nPrior to seeding the hPSCs, pre-coat culture dishes with 5 µg/mL (1 mL/10 cm2) truncated recombinant human form of vitronectin (VTN) for at least 1 h at room temperature (RT). Also, prepare complete chemically defined medium by adding supplement into the basal medium.\nRemove the culture medium, wash the cells once with PBS without Ca2+ and Mg2+, and treat the cells with 0.5 mM EDTA for ~ 2 - 5 min at RT.\nAspirate the EDTA before the colonies have detached. With gentle pipetting, disperse the hPSC colonies into small pieces and resuspend the cells in complete medium.\nCollect the dissociated hPSCs and spin down the cells at 200 x g for 5 min. Resuspend the pelleted hPSCs in the complete medium and seed the cells on VTN-coated plates.\n2. Generation of iCas9 hPSC Lines",
    "Order and amplify the following plasmids: AAVS1-TALEN-L, AAVS1-TALEN-R, AAVS1-Neo-M2rtTA, and AAVS1-Puro-iCas9.\n\tNOTE: To avoid unexpected recombination events, use recombination-deficient Stbl3 competent cells for the transformation and amplification of plasmids at 30 °C.\nTypically, prepare the hPSCs in one 10-cm dish (~ 1 x 107 cells if ~ 80% confluent) for one targeting experiment.\n\tNOTE: Since electroporation usually causes significant cell death and TALEN-mediated gene targeting in the AAVS1 locus requires antibiotic selection, a relatively large number of cells need to be seeded to identify correctly targeted cells. Optimization for the drug concentrations is recommended for each cell line and each culture condition.\nOn Day -1, (the day before electroporation), add 10 µM ROCK inhibitor during the media change.\nOn Day 0, (the day of electroporation), prepare VTN-coated plates in advance.\nDissociate the hPSCs into single cells using 1x dissociation reagent (please see the Material and Equipment Table). Briefly, remove the culture medium, wash the cells once with PBS without Ca2+ and Mg2+, and treat the cells with 1x dissociation reagent at 37 °C for ~ 3 min. Aspirate the dissociation reagent before the cells have detached. With gentle pipetting, disperse the hPSCs into a single-cell suspension in 10.5 mL of complete medium.\nTake 0.5-mL cell suspension to count the cell number using an automated cell counter. Pellet the hPSCs at 200 x g for 5 min and resuspend the cells in cold (4 °C) PBS at 12.5 x 106 cells/mL.\nAdd the plasmids (see Table 1) into 800-µL hPSC suspension (12.5 x 106 cells/mL) and mix well. Transfer the mixture to a 0.4-cm electroporation cuvette and keep on ice for ~ 5 min.\nElectroporate the cells using an electroporation system at 250 V and 500 µF; the time constant observed after electroporation is typically 9 - 13 ms.",
    "After electroporation, transfer the cells to a 15-mL conical tube with 5 mL of pre-warmed complete medium. Critical for successful targeting: Use healthy proliferating hPSCs and handle the cells very gently when transferring, resuspending, and plating the cells after electroporation.\nPellet the cells at 200 x g for 5 min. Resuspend the cells in 10 mL of complete medium with 10 µM ROCK inhibitor and plate 1, 2.5, and 5 x 106 cells onto each of the three VTN-coated, 10-cm dishes; this ensures that at least one of the plates will have sufficient colonies at single-cell clonal density for colony picking.\nOn Day 1 (the day after electroporation), change the medium.\nOn Days 2 - 5, start neomycin selection when the cells are ~ 60% confluent. Change the medium daily with 500 µg/mL G418 sulfate; significant cell death due to selection is typically observed 2 days after G418 selection.\nOn Day 6, change the medium without antibiotic selection.\nOn Days 7-9, start puromycin selection. Change the medium daily with 1 µg/mL puromycin dihydrochloride; significant cell death should be observed the next day.\nOn Day 10, start changing the medium daily without antibiotic selection until the hPSC single-cell colonies reach 1 - 2 mm in diameter.\n\tNOTE: Typically, 50 colonies in a 10-cm dish are observed with 2.5 x 106 hPSCs plated on Day 0.\nPick 12 - 24 colonies under a stereomicroscope. Mechanically disaggregate the hPSC colonies into small pieces (~ 10 pieces per colony) using a 23-G needle (a 200-µL pipet tip is also fine) and transfer the cells directly into VTN-coated 24-well plates.\nChange the medium daily until the cells become confluent. Passage the cells in each well of the 24-well plates into duplicate wells of 6-well plates.",
    "When the cells become confluent in the 6-well plates, use one well for a frozen stock and the other well for genomic DNA extraction for further characterization.\nCharacterize and validate the established iCas9 lines by PCR genotyping, Southern blotting, RT-qPCR analysis, karyotyping, and pluripotency assay. Refer to Zhu et al.21 for detailed experimental procedures.\n3. Generation of hPSC Mutant Lines Using the iCRISPR System\nGeneration of hPSC knockout lines\ngRNA design and production\nChoose target regions in the gene of interest to maximize the possibility of disrupting wild-type protein function. For well-annotated genes, choose a target region upstream of an essential functional domain. Alternatively, design gRNAs to target a region downstream of the start codon. Choose at least 2 different regions for a gene of interest.\nDesign gRNAs using the online CRISPR design tool (http://crispr.mit.edu). For each target region, design 3 gRNAs with low potential off-targets and use the one with the highest targeting efficiency for generating clonal mutant line22.\n\t\t\tNOTE: In order to achieve high genome editing efficiency, it is recommended to deliver gRNA as RNA oligos instead of as plasmid DNA because of the higher transfection efficiency of small RNAs compared to plasmids in past experience.\nOrder 120 nucleotide (nt) DNA oligos containing the T7 promoter sequence, the variable 20-nt crRNA recognition sequence (N)20 (do not include the PAM sequence), and the constant chimeric guide sequence. Dilute the oligos to 100-µM stock solution in ddH2O and prepare 250-nM as working solution.\n\t\t\tNOTE: TAATACGACTCACTATAGGG (N)20GTTTTAGAGCTAGAAATAGCAAGTTAAAATAAGGCTAGTCCGTTATCAACTTGAAAAAGTGGCACCGAGTCGGTGCTTTT\nPCR-amplify the oligos using the T7F and TracrR primers (see Table 2) to produce the double-stranded DNA (dsDNA) template for gRNA in vitro transcription (IVT). Use 50 µL of PCR reaction mixture (see Table 3) and PCR cycle conditions (see Table 4).",
    "Use a high-yield T7 transcription kit for in vitro gRNA transcription with the PCR-amplified template in 20 µL, in vitro gRNA transcription mix (see Table 5) as per the manufacturer's instructions. Purify the gRNA products using the transcription clean-up kit as per the manufacturer's instructions.\nElute gRNAs following the high-throughput purification protocol as per manufacturer's instructions (typically ~ 50 - 100 µg) in 100 µL of elution buffer. Adjust the concentration to 320 ng/µL (10 µM) when possible and store at -80 °C until use.\nPCR and Sanger sequencing primer design\nDesign and validate PCR primers amplifying the target region, with product sizes typically ranging from ~ 500 - 1,000 bp.\nDesign Sanger sequencing primers binding internally to the PCR products to allow direct sequencing of the PCR products without purification.\ngRNA transfection in iCas9 hPSCs\nOn Day -1, treat iCas9 cells with 2 µg/mL doxycycline 24 h before gRNA transfection.\nOn Day 0 of gRNA transfection, prepare VTN-coated plates in advance.\nDissociate iCas9 cells into single cells using 1x dissociation reagent, as described in step 2.5.\nPellet the hPSCs at 200 x g for 5 min and resuspend the cells at ~ 0.5 x 106 cells/mL in complete medium supplemented with 2 µg/mL doxycycline and 10 µM ROCK inhibitor.\nPlate 0.5 mL of the resuspended cells into individual wells of 24-well plates. Prepare additional wells to serve as non-transfected controls.\nFor each gRNA, make the following transfection mixtures: Mix A, 50 µL of reduced serum medium + 1 µL of gRNA (10 µM); Mix B, 50 µL of reduced serum medium + 3 µL of transfection reagent.",
    "Combine Mix A and B to make 100 µL mixture. Incubate for 5 min at RT. Add 50 µL of the mixture to cells in the duplicate wells of the 24-well plates and mix well.\nOn Day 1, perform a second transfection if needed to further increase the targeting efficiency. Otherwise, change the medium without doxycycline.\nOn Days 2 - 3, change the medium daily.\nOn Day 4, extract genomic DNA from one well of each transfected and non-transfected control cell using a DNA extraction kit. Adjust the concentration to 50 ng/µL.\nPCR-amplify the target regions flanking the gRNA targeting sequences and estimate the editing efficiency using T7 endonuclease I (T7EI) digestion or the restriction fragment length polymorphism (RFLP) assay, as described previously5.\nT7EI assay\nPCR-amplify the target region using the primers designed and validated in step 3.1.\nPrepare the mixtures (see Table 6) and perform DNA denaturation and hybridization of the PCR products using conditions outlined in Table 7.\n\t\t\tNOTE: Based on our experience, it is generally not necessary to purify PCR products for the T7EI assay when using our PCR condition. However, purification could be beneficial in other conditions.\nPerform a T7EI digestion at 37 °C for 30 min using 10 µL of denatured and hybridized PCR product and 0.2 µL (2 U) of T7E1 (10 U/µL).\nResolve the T7E1-digested PCR samples by gel electrophoresis. Use ImageJ to determine the relative band intensities of cut and uncut DNA. Calculate the indel frequency using the formula: (1 - (√(1-(b+c))/(a+b+c))) x 100, where a is the intensity of the undigested PCR product and b and c are the intensities of the T7E1-cleaved products.\nRFLP assay",
    "NOTE: In cases where a restriction site is in close proximity (< 5 bp) to a Cas9 cleavage site (3 bp 5' of the PAM sequence), an RFLP assay can be performed to quantify the indel frequency.\n\t\t\nUse the same PCR products as described in step 3.1.4.1.\nDigest the PCR product with a restriction enzyme that contains a restriction site in close proximity to the Cas9 cleavage site.\nResolve the digested PCR samples by gel electrophoresis. Use ImageJ to determine the relative band intensities of cut and uncut DNA. Calculate the indel frequency using the formula: a / (a+b+c) x 100, where a is the intensity of the undigested PCR product and b and c are the intensities of the digested products.\nEstablishment of clonal mutant lines\n\t\tNOTE: Genome editing in hPSCs using the iCRISPR system with gRNA transfection is highly efficient, and no antibiotic selection is needed. To establish clonal lines, it is necessary to seed cells at a relatively low density to ensure the formation of single-cell-derived colonies.\n\t\t\nIdentify gRNAs with the highest editing efficiency (using the T7EI or RFLP assay) and with good cell survival. Use the corresponding duplicate well for clonal mutant line establishment.\nDissociate the hPSCs into a single-cell suspension using 1x dissociation reagent, as described in step 2.5. Replate 500, 1,000, and 2,000 cells onto each of the three VTN-coated, 10-cm dishes.\nChange the medium daily until the single-cell colonies reach ~ 2 mm in diameter.",
    "Pick 24 - 48 colonies for each gRNA, depending on the estimation of targeting efficiency by the T7EI and/or RFLP assay. Mechanically disaggregate each colony into small pieces (~ 10 pieces per colony) using a 23-G needle (a 200-µL pipet tip is also fine) and replate the cells in duplicate VTN-coated, 96-well plates. Use one plate for genomic DNA extraction and Sanger sequencing and the other plate for further expansion.\nWhen the cells in the 96-well plates have become confluent, extract the genomic DNA (without phenol/chloroform extraction) using a simple protocol, as outlined below.\nRemove the medium and wash the cells once with PBS without Ca2+ and Mg2+. Add 50 µL of lysis buffer (5 µL of Proteinase K (10 mg/mL), 5 µL of PCR buffer 10x, and 40 µL of ddH2O) to each well of a 96-well plate. Seal the plate using an adhesive film and incubate overnight at 55 °C.\nThe next day, transfer the cell lysates into a 96-well PCR plate and incubate for 10 min at 99 °C in a thermocycler to inactivate the Proteinase K.\nPCR-amplify the target region using the same primers as for the T7EI or RFLP assay, using 1 µL of cell lysate as a template.\nUse 1 µL of the PCR product for Sanger sequencing with a primer binding internally to the PCR product.\nAmplify the clones with frameshift indel mutations for frozen stocks. Also, amplify a couple of wild-type clones from the same targeting experiment to serve as isogenic control lines for further experiments.\nGeneration of mutant lines with precise nucleotide alterations",
    "NOTE: Compared with knockout mutants generated by non-homologous end joining (NHEJ), precise nucleotide alteration can be achieved through homology-directed repair (HDR) in the presence of DNA repair templates. Such precise nucleotide alterations allow for the generation of patient-specific mutations in wild-type hPSCs and for the correction of mutations in patient-derived iPSCs.\n\t\nDesign of ssDNA as an HDR template\nDesign and produce 2 - 3 gRNAs in close proximity to a patient-specific mutation, as described in step 3.1.1.\nDesign a single-stranded DNA (ssDNA) containing the patient-specific mutation flanked by ~ 40 - 80 nt of homology on each side as an HDR template.\nTo reduce additional cutting after the correct repair, introduce a silent mutation to the ssDNA template in the region within the gRNA recognition sequence and in close proximity to the PAM sequence or in the PAM sequence itself, if possible.\nIf possible, design the silent mutation to introduce a novel restriction digestion site as well so that it can be used to estimate the repair efficiency using the RFLP assay.\ngRNA/ssDNA co-transfection and the establishment of clonal lines\nPerform the co-transfection of gRNA/ssDNA into iCas9 cells, as described in step 3.1.3, with transfection mixtures A and B. For each gRNA and non-transfected control, transfect the cells in duplicate wells of 24-well plates. Mix A: 50 µL of reduced serum medium + 1 µL of gRNA (10 µM) + 2 µL of ssDNA (10 µM). Mix B: 50 µL of reduced serum medium + 3 µL of transfection reagent.\nAfter transfection, extract genomic DNA from one well of each transfected and non-transfected control cell and estimate the repair efficiency using the T7EI and/or RFLP assay.\nIdentify the gRNA/ssDNA mixture with the highest repair efficiency and good cell survival. Use the corresponding duplicate well for clonal mutant line establishment.",
    "Pick 48 - 96 colonies, depending on the estimation of the targeting efficiency by the T7EI and/or RFLP assay. In general, the efficiency of HDR-mediated mutation is lower than knockout mutation and thus more colonies need to be picked.\nSequence, expand, and validate clonal lines, as described in step 3.1.6.\n4. In Vitro hPSC Differentiation into Glucose-responsive Pancreatic β Cells\nNOTE: In vitro differentiation of hPSC mutants into disease-relevant cell types provides a platform for disease modeling in a dish. The following protocol focuses on the in vitro differentiation of hPSCs into glucose-responsive pancreatic β cells for pancreatic developmental and diabetic studies9,16,17.\nhPSC differentiation into definitive endoderm\nMaintain hPSC mutants and wild-type control lines in the chemically defined and feeder-free condition, as described in step 1.\nTo prepare the hPSCs for differentiation, dissociate the hPSCs using 1x dissociation reagent and disperse them into single-cell suspension in complete medium.\nPellet the cells at 200 x g for 5 min and re-suspend the cells in complete medium with 10 µM ROCK inhibitor. Count the cell number and seed the cells at ~ 1.4 x 105 cells/cm2 on VTN-coated plates.\nChange the medium 24 h after seeding.\nOn Day 0, start the differentiation after 48 h, when the cells have reached ~ 80% confluency.\n\t\tNOTE: To achieve high pancreatic differentiation efficiency, optimizing the seeding density and level of confluency at 48 h is recommended for each individual line.\nAspirate the hPSC medium and rinse the cells once with PBS without Ca2+ and Mg2+.\nChange the medium to differentiation day 0 (d0) medium.\nOn Days 1 - 2, change the differentiation medium daily, according to the recipes in Table 8.\nOn Day 3, examine the definitive endoderm markers SOX17, FOXA2, and CXCR4 by immunofluorescent staining and flow cytometry analysis.",
    "Definitive endoderm differentiation into pancreatic progenitor\nOn Days 3 - 9, continue definitive endoderm differentiation toward the pancreatic lineage by changing the medium daily, according to the recipes in Table 9.\nOn Day 7, examine the early pancreatic progenitor (PP1) marker PDX1 by immunofluorescent staining and flow cytometry analysis.\nOn Day 10, examine the later pancreatic progenitor (PP2) markers PDX1 and NKX6.1. Meanwhile, prepare to transfer PP2 cells to air-liquid interface for further differentiation into pancreatic endocrine cells.\nPancreatic endocrine differentiation in air-liquid interface\nTreat the PP2 cells with 10 µM ROCK inhibitor 4 h before dissociation.\nRemove the medium and rinse the cells once with PBS without Ca2+ and Mg2+.\nAdd 2 mL of 1x dissociation reagent to PP2 cells in one 10-cm dish and incubate at 37 °C for 2 - 3 min.\nAspirate the dissociation reagent before the cells have detached. Add 10 mL of BLAR medium and disperse the PP2 cells into single cells by gently pipetting up and down.\nCollect the single-cell suspension. Count the cell number and pellet at 200 x g for 5 min.\nResuspend the cell pellet at ~ 0.5 x 105 cells/µL in S5 differentiation medium and spot 5 - 10 µL of cells per spot on a transwell insert filter. Place 10 - 15 spots in one 6-well insert and ~ 100 spots in a 10-cm insert.\nAdd S5 medium to the bottom of each transwell insert, ~ 1.5 mL for 6-well inserts and ~ 8 mL for 10-cm inserts.\nChange the medium daily with the recipes in Table 10.\nExamine pancreatic endocrine markers PDX1, NKX6.1 NEUROD1, NKX2.2, INSULIN, and GLUCAGON on day 34 by immunofluorescent staining and flow cytometry analysis17.\nExamine hPSC-derived β-like cell function with a glucose-stimulated insulin secretion (GSIS) assay16,17."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}