{
  "id": 4930,
  "origin_website": "Bio",
  "title": "A Reliable Method for <em>Phytophthora cajani</em> Isolation, Sporangia, Zoospore Production and <em>in Planta</em> Infection of Pigeonpea",
  "procedures": [
    "Pathogen isolation Collect pigeonpea plants exhibiting Phytophthora blight symptoms (brown to dark brown lesions distinctly different from healthy green portions on main stem, branches and petioles) from infected field (Figure 1). Place symptomatic plant materials in labelled plastic bags for transportation in cooler box (4 °C) and store in 4 °C until fungal culture were isolated and purified from the samples in the laboratory. Select stem tissues with typical Phytophthora blight lesions for isolation of the pathogen Phytophthora (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119181429_0436.jpgFigure 1. Phytophthora blight lesions on pigeonpea stemCut symptomatic tissues in small pieces and surface sterilise with 1% sodium hypochlorite for 1 min followed by 2-3 times washing in sterile distilled water. Place the surface cleaned tissues onto sterilized V8 juice agar media in a Petri-plate (Figure 2) (V8 juice supplemented with L-Asparagine, CaCO3, glucose, yeast extract and agar) amended with PARP antibiotics (pimarcin 400 μl; ampicillin 250 mg; rifampicin 1,000 μl; and pentachloronitrobenzene 5 ml.L-1 media) (see Recipes for detail). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119181455_6105.jpgFigure 2. P. cajani (indicated with red circle) colony isolated from infected stem tissue of pigeonpea on V8 juice agar mediaIncubate plates at 25 °C in the 12 h/12 h day-night photoperiod for 3-4 days. Transfer putative Phytophthora colonies (indicated with red circle in Figure 2) to 20% tomato extract agar (tomato extract 200 ml, CaCO3 2 g and agar 20 g.L-1 , see Recipes for detail) and again incubate at 25 °C in the 12 h/12 h day-night for 7 d (Figure 3).Further subculture is done after every 15-20 days. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119181514_8297.jpgFigure 3. Purified P. cajani isolate on tomato extract agar mediaIdentify the culture based on morphological characters like mycelial type and sporangia shape as well as molecular level using ITS region sequencing. Maintain cultures under in vitro at 18 ± 1 °C in darkness.",
    "To maintain the pathogen virulence, prepare new cultures every 2-3 months by passing the pathogen through the host and reisolating from infected plants.Note: All the steps have to be performed under aseptic conditions in horizontal laminar air flow system. Sporangia and zoospore productionChoose virulent isolate of P. cajani for sporangia and zoospore production. Place one piece (5 mm) of mycelial bit from actively growing pure culture (5-7 day old culture) in 100 ml conical flask containing 25 ml of 20% tomato extract broth and incubate at 25 °C under dark condition for 72 h for mycelial growth (Figure 4A-B). After 72 h of incubation, decant tomato extract broth from flask and wash the mycelial mat with sterilized water and replace with 25 ml of sterilized pond water. Incubate again at 25 °C for 4 h in the darkness (Figure 4C). Decant the sterilized pond water and replace again with sterilized pond water and incubate for 3 h in the darkness.Repeat step 4 for one more time and incubate flask containing the mycelia again at 25 °C for approximately 20 h in the darkness (Figure 4D). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119181529_7745.jpgFigure 4. P. cajani sporangia and zoospore production. A. Inoculated tomato extracts broth with P. cajani mycelial bit. B. Mycelial mat after 72 h post incubation. C. Replacement of tomato extracts broth with sterilized pond water. D. Mycelial mat in sterilized pond water.Observe sporangial initiation after 6 h during an incubation period and abundant sporangial production (mature sporangia) after 15-16 h under the light microscope (Figure 5A). Numerous swimming zoospores were noted within 16-20 h (Figure 5B-C). Zoospore concentration was determined using a haemocytometer and adjusted to desired concentration (1.5 x 105 ml-1) via dilution with sterilized deionized water and used for in planta infection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119181545_0937.jpgFigure 5. Sporangia and zoospore of P. cajani isolate ICPC 1.",
    "A. Mature sporangia after 15-16 h incubation. B. Zoospore release from mature sporangia. C. Swimming zoospores after 16-20 h incubation.In planta infection with zoosporeTake apparently healthy seeds of any susceptible variety to P. cajani, in our case ICP 7119 (HY3C). Surface sterilize the seeds in sodium hypochlorite (1% v/v) for 2-3 min and then wash in sterile distilled water 2-3 times.Sow the sterilized seeds in plastic trays (35 x 25 x 8 cm) filled with a mixture of sterilised river sand and vermiculite (10:1 v/v) in a greenhouse maintained at 25-28 °C under natural light conditions for 7 day. Ten rows were sown in each tray and each row consisted of eight seeds (Figure 6A).Saturate the 7 day old seedlings grown in trays containing mixture of sand and vermiculite with sterilized water. Inoculate seedlings with diluted zoospore suspension usually containing 1.5 x 105 zoospores/ml (approximately 2 ml of zoospore suspension per plant) (Figure 6B).Trays with inoculated seedlings were kept in greenhouse at 28 ± 2 °C under ambient light conditions. Similar number of seedlings inoculated with only sterilized water served as un-inoculated control.After zoospore inoculation, flood the trays with sterilized water for 48 h and maintain saturation thereafter till completion of experiments (Figure 6C). After 5-7 day of infection, count the infected plants and calculate the disease incidence by estimating the percentage of plants infected with Phytophthora blight (Figure 6D). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171012/20171012041833_8327.jpgFigure 6. In planta infection of pigeonpea with P. cajani zoospore. A. Seven days old seedlings on sterilized sand and vermiculite mix. B. Inoculation of pigeonpea seedlings with P. cajani zoospore. C. Inoculated seedlings tray flooded with sterilized water. D. Phytophthora blight infected seedlings with lesions (indicated with circle)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}