{
  "id": 7985,
  "origin_website": "Bio",
  "title": "Fluorescence in situ Localization of Pri-miRNAs in Isolated <em>Arabidopsis thaliana</em> Nuclei",
  "procedures": [
    "Nuclei isolation Note: Nuclei isolation was performed according to the method described in Pontvianne et al. (2007 and 2012). Collect 2–3 leaves from 4-week-old A. thaliana plants and fix them for 20 min at room temperature in 4% formaldehyde solution in Tris buffer (10 mM Tris-HCl at pH 7.5, 10 mM EDTA, 100 mM NaCl). Leaves should be completely immersed.Notes:  For 4% fixative preparation, dilute 10 mL of 16% methanol-free formaldehyde in 30 mL of Tris buffer. Nuclei can also be isolated from seedlings, following the same protocol. WARNING:  Formaldehyde is a volatile and toxic carcinogen and should only be used in a fume hood. Gloves, safety glasses, and protective clothing should also be worn when working with it.Wash the leaves twice for 10 min in Tris buffer.Chop the leaves with a razor blade in 0.5 mL of LB01 buffer to obtain a soup in a Petri dish.Filter the resulting lysate through a 30 μm cell strainer.Add 12 μL of sorting buffer per 3 μL of filtered nuclei suspension obtained in step 3.Spread the mixture on adhesion slides covered with Polylysine using a pipette and leave to dry at room temperature (can be kept overnight).Probe preparation Dissolve DNA oligonucleotides with double-distilled H2O to a final concentration of 100 μM.Prepare terminal transferase (TdT) working solution: 5 mM CoCl2, 1× TdT Reaction buffer, 0.1 mM DIG-11-dUTP, 0.1 mM dATP, and 400 U of TdT per reaction in PCR tube.Notes:  Optionally, you can supply a reaction buffer additionally with Alexa Fluor 5-dUTP (final concentration: 0.2 mM). Instead of DIG-11-dUTP, Biotin-11-dUTP could be used. Combine 1 μL of DNA oligonucleotide with 9 μL of TdT working solution and incubate it for 40 min at 37 °C in a PCR tube.Notes:  Incubation is performed without shaking.",
    "After incubation, the reaction mixture could be stored at -20 °C. In our studies, probes were working after three months of storage. For our studies, the probes were provided by Metabion company (Planegg, Germany). Fluorescence in situ hybridization (FISH) Prepare permeabilization buffer: 0.1% Triton X-100 in 1× PBS.Incubate the sample in permeabilization buffer for 10 min at room temperature. The buffer should cover the whole sample area.Wash the sample twice with 1× PBS.Prepare hybridization buffer (Niedojadlo et al., 2012).For FISH, dilute 1 μL of the probe mixture (section B) in 100 μL of hybridization buffer (final probe concentration: 100 pM/μL).Note: The final probe concentration in hybridization buffer may vary for different RNAs and should be adjusted experimentally. Add 100 μL of hybridization buffer to the sample on the slide and cover with a slide cover.Place the slide in a humid hybridization chamber in the 28 °C incubator and leave overnight. The slides should be prevented from drying during hybridization. To obtain this, a small volume of PBS or water should be placed inside the chamber to keep a stable humidity.Note: Incubation is performed with a gentle shaking (0.6 rpm) After incubation, wash the slide using the following order: 4× SSC for 5 min, 2× SSC for 5 min, 1× SSC for 5 min, and 1× PBS for 10 min.Immunolabeling Dilute primary anti-digoxigenin antibody in 1× PBS containing 0.05% acetylated BSA diluted 1:100.Cover the sample with 100 μL of antibody diluent (containing anti-digoxigenin antibody from step 1) and place the slide cover. Incubate the sample in a humid chamber overnight at 10 °C.Remove primary antibody from the sample and wash with 1× PBS for 5 min.Dilute the secondary antibody labeled with fluorescence dye in 1× PBS containing 0.05% acetylated BSA (diluted 1:1,000).",
    "Place 100 μL of secondary antibody solution on the sample, cover it with a slide cover glass, and incubate in a humid chamber for 3 h at 37 °C.Remove the secondary antibody from the sample and wash it two times with 1× PBS for 5 min.Note: The time and temperature of incubation, as well as antibody concentration, should be defined experimentally for different antibodies used. Nuclei labeling and sample mounting Dilute Hoechst 33342 at 1:1,000 in 1× PBS and add 100–200 μL to the sample. Incubate for 10 min at room temperature.Note: For nuclei labeling, DAPI (4′,6-diamidino-2-phenylindole) diluted 1:1,000 in 1× PBS buffer can also be used. Remove the Hoechst 33342 solution from the slide and wash it once with 1× PBS for 5 min.Cover the sample with 20 μL of ProLong Gold Antifade reagent, carefully place the coverslip, and press down firmly with the finger to remove air bubbles and uniformly distribute the antifade reagent over the samples.Leave the sample to dry at room temperature, protecting it from the light."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}