{
  "id": 19172,
  "origin_website": "Jove",
  "title": "Hyperinsulinemic-euglycemic Clamps in Conscious, Unrestrained Mice",
  "procedures": [
    "1. Preparation of catheters and Mouse Antenna for Sampling Access (MASAtm)\nPrepare arterial catheter by inserting a 1.3 cm piece of PE-10 (0.011 inch inner diameter) into a 6 cm piece of silastic tubing (0.012 inch inner diameter) as shown in Figure 1A. Bevel the tip of the PE-10 with a scalpel so the length from the end of the silastic to the tip of the bevel is 0.9 cm.\nPrepare venous catheter by sliding a 1 mm piece of silastic tubing (0.020 inch inner diameter) 1.1 cm from the beveled end of a 6 cm piece of silastic tubing (0.012 inch inner diameter) as shown in Figure 1B. The 1 mm piece of silastic is used as a restraining bead.\nTo prepare a MASAtm, insert each of two 1.3 cm pieces of 25 gauge stainless steel connectors into each of two 3 cm pieces of PE-20 (0.015 inch inner diameter).\nSecure the PE-20/connectors to each other by sliding a 5 mm piece of silastic tubing (0.040 inch inner diameter) over the area where the steel tubes and PE-20 meet.\nBend the steel tubes to a ˜120° angle and separate each tube by ˜ 45°.\nPlace completed rig in a dollop of medical silicone adhesive such that the PE-20 tubing is vertical and the ends of the stainless steel tubes extend beyond the adhesive (Figure 1C). Allow this to set for 24h.\n2. Surgical catheterization\nPrior to surgery, sterilize catheters with 70% ethanol, fill them with heparinized saline (200 U heparin/ml saline) and insert stainless steel plugs.\nAnesthetize mouse, preferably using a method that continuously delivers the anesthetic agent (e.g. inhaled isoflurane).",
    "Using sterile technique, remove hair from the incision sites using clippers and/or a depilatory cream and disinfect the skin with alcohol followed by a betadine scrub. For catheter insertion, remove hair on the region extending from the lower jaw to the top of the rib cage and between the clavicles. For externalization of the catheters behind the head, remove hair in the area between the base of the skull and the interscapular region and disinfect the skin with alcohol followed by a betadine scrub.\nLay the mouse on its back on a warming surface and under the viewing area of a surgical microscope. Secure the tail and extremities with surgical tape. Secure the head in the nose cone delivering the anesthesia.\nMake a small vertical midline incision 5 mm cephalic to the sternum. Using forceps, blunt dissect the tissue to expose the left sternomastoid muscle. Reflect this muscle to expose the left carotid artery. Gently tease off connective tissue from the artery. It is important at this point to isolate the vagus nerve from the artery without damaging either the artery or the nerve.\nIsolate the artery and ligate the cephalic end with silk suture. Loosely knot another piece of suture on the caudal end of the exposed vessel.\nClamp vessel with a micro-serrefine clamp on the caudal end and cut just below the ligated end with spring scissors. Carefully insert catheter as far as the clamp. Carefully release the micro-serrefine clamp and advance the catheter to the silastic-PE junction.\nTie both ligatures securely to the catheter and confirm that the catheter samples by connecting the free end of the catheter to a sampling syringe.",
    "Make another incision 5 mm to the right of midline and about 2 mm caudal to the first incision. Using forceps, blunt dissect the tissue to expose and isolate the right jugular vein.\nCarefully ligate the cephalic end with silk suture and loosely tie another piece of suture at the caudal end.\nCut just below the cephalic ligature with spring scissors and insert the catheter up to the restraining bead. Tie a suture behind the bead and confirm that the catheter samples.\nTurn the mouse over and make a small incision between the shoulder blades.\nTunnel a 14-gauge needle under the skin from the incision for the arterial catheter, on the front of the mouse, to the interscapular incision on the back. Thread the arterial catheter through the needle to exteriorize it at the back of the mouse. Repeat this for the jugular vein catheter by tunneling the 14-gauge needle under the skin on the right side of the mouse from the incision site on the front to the interscapular incision on the back.\nClamp the arterial catheter with a micro-serrefine clamp at the incision site between the shoulder blades. Cut the catheter ˜1 cm above this clamp. Place the MASAtm with the stainless steel connectors facing towards the head of the mouse. Connect the arterial catheter to the stainless steel connector pointed towards the left side of the mouse. Take care to ensure there are no holes or kinks in the catheter. Repeat for the venous catheter, connecting it to the stainless steel connector pointing to the right side of the mouse.",
    "Insert the MASAtm into the incision between the shoulder blades. The PE-20 tubing corresponding to the jugular vein catheter should be to the right side of the mouse and the PE-20 tubing corresponding to the arterial catheter should be to the left.\nClose ventral and dorsal incisions with nylon suture. For the dorsal closing, the suture can be run through the hardened silicone of the MASAtm to secure it in place. Confirm patency of the catheters using a flushing solution containing heparinized saline and an antibiotic to minimize the risk of infection. Place mouse in a warmed, clean cage for immediate recovery. Figure 2 shows the finished product.\nAllow the mouse to recover for at least 5 days. Monitor weight and overall health. Utilize the appropriate post-operative analgesic regimen as approved by the institution's Animal Care and Use Committee.\n3. Hyperinsulinemic-euglycemic clamp\nFast the mouse for 5-6h. As a reference, the time t = 0 min refers to the end of the fast and the beginning of the insulin and glucose infusion (i.e. the clamp period).\nThe setup and time line for a typical experiment are shown in Figure 3. Use Micro-Renathane or equivalent tubing for infusion and sampling lines. Suspend a dual-channel swivel above the mouse. This serves as a hub between the mouse and infusion/sampling syringes. During the experiment, the mouse remains in a home cage or similar container and is tethered to the swivel.\nPrior to connecting the mouse, fill the arterial sampling line with heparinized saline (10 U heparin/ml saline) and place a stainless steel connector at the bottom end of the line. Leave a syringe with heparinized saline (clearing syringe) connected to the top of the sampling line. This will be used to draw up blood samples.",
    "Fill the venous infusion line with non-heparinized saline starting from the infusion port of the swivel (Segment A in Figure 3A) all the way to the bottom of the line. Plug the top end of the line and place a stainless steel connector (or a Y-connector if a bolus is to be administered) at the bottom end of the line. If an isotopic glucose tracer (e.g. [3-3H]glucose) is being infused, secure a 1 ml syringe containing the tracer to an infusion syringe. Fill the venous infusion line with tracer instead of saline (Figure 3B).\nThree hours into the fast, weigh the mouse and connect the PE-20 for the jugular vein and arterial catheters to the infusion and sampling lines, respectively.\nIf administering [3-3H]glucose tracer, begin a primed-continuous tracer infusion at t = -90 min (Figure 3C). A typical priming dose is 1 μCi. Prepare a 0.05 μCi/μl [3-3H]glucose solution in non-heparinized saline. Load the solution into a 1 ml syringe and secure the syringe in an infusion pump. Administer the priming dose by infusing 20 μl/min for 1 min. Follow with a continuous infusion of 0.05 μCi/min (1 μl/min) for a 90 min equilibration period.\nPrepare infusates of insulin and glucose. Insulin is prepared in non-heparinized saline containing 3% plasma as a carrier (an appropriate concentration of BSA can also be used). Glucose infusates are commercially available in a variety of concentrations (5, 20 and 50%).",
    "Prepare saline-washed erythorocyte infusate by obtaining whole blood from a donor mouse, preferably of the same strain background as the experimental mouse. Typically 1 ml of whole blood is needed per study mouse. Centrifuge blood to separate erythrocytes. Wash erythrocytes with 10 U/ml heparinized saline and centrifuge to discard the saline. Determine the volume of erythrocytes and resuspend in an equal volume of 10 U/ml heparinized saline.\nDraw each infusate into a 1 ml syringe and secure each syringe to an individual infusion pump. Connect each syringe to a 4-way connector (Figure 3).\nAt t = -15 min take a blood sample by slowly drawing up 50-100 μl of blood into the clearing syringe. Clamp the arterial sampling line and remove the clearing syringe. Using a hand-held glucose meter, take a blood glucose reading by removing the clamp on the arterial sampling line and allowing blood to flow into the glucose meter strip.\nOnce the glucose measurement is taken, clamp the arterial sampling line and insert a blunt-needle syringe (sampling syringe) into the arterial sampling line. Remove the clamp and draw a volume of blood (see Note) into the sampling syringe. Clamp the arterial sampling line and remove the sampling syringe. Insert the clearing syringe back into the arterial sampling line. Draw up on the plunger to remove any air bubbles and re-infuse the 50-100 μl of blood that was originally drawn.\nNote: The volume of blood sampled depends on the analysis being performed. For example, analysis of [3-3H]glucose concentration requires 10 μl of plasma, so 50 μl of blood are drawn. This yields 20-30 μl of plasma, which is sufficient for the analysis plus additional plasma if needed. Measurements of hormones and other metabolites (e.g. insulin, free fatty acids) require sampling of additional blood.",
    "Dispense the blood in the sampling syringe into an EDTA-coated microtube. Centrifuge and collect the plasma. Keep the plasma on ice until the end of the study or immediately store at -20°C.\nRepeat steps 3.10 through 3.12 at t = -5 min. Obtain additional blood (50 μl) for measurement of baseline plasma insulin levels. Measure baseline hematocrit by drawing blood into a heparin- or EDTA-treated capillary tube. The measurements obtained from plasma samples at t = -15 and -5 min represent baseline (i.e. fasting) values.\nAfter the sample at t = -5 min, fill the infusion lines for glucose, insulin and saline-washed erythrocytes up to the 4-way connector. Connect the 4-way connector to the tubing attached to the swivel infusion port (or the tubing connected to the Y-connector if infusing [3-3H]glucose) as shown in Figure 3.\nBegin infusing the saline-washed erythrocytes first. Set the rate of infusion to replace the total volume of blood being sampled over the duration of the study (e.g. if a total of 500 μl of blood are sampled over 120 min of the study, set the infusion rate to 4.2 μl/min). In contrast to the other infusates, the erythrocyte solution is red. Infusing this solution first allows for any potential resistance or obstructions in the infusion lines to be identified and corrected.\nOnce the erythrocyte infusate reaches the mouse, begin the insulin and glucose infusions. This is now t = 0 min. Insulin is infused at a constant, pre-determined rate. An insulin infusion rate of 4 mU•kg-1•min-1 will typically suppress endogenous glucose production by 80-100% and stimulate glucose disappearance by 2-3 fold. The initial glucose infusion rate (GIR) is estimated based on the baseline blood glucose levels and previous experience.",
    "If infusing [3-3H]glucose, one may elect to increase the tracer infusion rate to match the estimated increase in glucose turnover (typically a 2-3 fold increase).\nConsidering the high rate of glucose turnover in the mouse, blood samples should be obtained from the arterial line no less than every 10 min for the measurement of glucose concentration over the duration of the experiment. Adjust the GIR to achieve and maintain target euglycemia (Figure 3C). This target can vary depending on the model or the aims of the study. A good target glucose concentration is 150 mg•dL-1 since this is a typical 6h fasted glucose level for a chow-fed C57Bl/6J mouse.\nThe goal is to achieve euglycemia quickly, ideally within the first 40-50 min, and to have glucose and GIR stable by the beginning of the steady-state period (t = 80 min).\nIf infusing [3-3H]glucose, obtain additional blood at t = 80, 90, 100, 110 and 120 min for the measurement of plasma [3-3H]glucose specific activity.\nCollect additional blood at t = 100 and 120 min for measurement of plasma insulin and any other hormone(s) or metabolite(s). At t = 110 min, draw blood into a heparin- or EDTA-treated capillary tube for measurement of clamp hematocrit.\nAfter the sample at t = 120 min is taken, 2[14C]deoxyglucose can be administered for the measurement of tissue-specific glucose uptake. Administer a 12 μCi bolus into the bolus line connected to the jugular sampling line (Figure 3B).\nObtain blood samples (50 μl) from the arterial sampling line at t = 2, 15, 25 and 35 min after administration of the bolus for the measurement of plasma 2[14C]deoxyglucose levels.",
    "After the last sample, anesthetize the mouse with an infusion of pentobarbital given directly into the arterial line. Quickly dissect any tissues required for the assessment of glucose uptake (e.g. skeletal muscles of various types, adipose tissue, heart, brain) and any other tissues (e.g. liver, spleen, kidneys). Snap freeze tissues in liquid nitrogen and store at -80°C until analyzed. Tissue glucose is analyzed by measuring the accumulation of phosphorylated 2[14C]deoxyglucose in the frozen tissues and the disappearance of 2[14C]deoxyglucose from the plasma.\n4. Representative Results",
    "An example of results obtained from an insulin clamp experiment is shown in Figure 4. This example shows the ability of a high fat diet to precipitate insulin resistance in mice. All presentations of insulin clamp results must include the following to be interpretable: a time course of blood glucose levels, a time course of the GIR and plasma insulin levels (baseline and clamp). As shown here, fasting glucose (Figure 4A) and insulin (Figure 4C) levels are higher in mice fed a high fat diet, indicative of insulin resistance. Presenting a time course of glucose levels throughout the clamp study (Figure 4A) allows the reader to assess how well euglycemia was maintained, which is indicative of the quality of the clamp. Similarly, a time course of the GIR (Figure 4B) allows the reader to determine how quickly a steady-state was achieved. Showing these data as time courses is significantly more informative than the conventional practice in the mouse insulin clamp literature of presenting a 2-hour experiment as a single datum point representing average values from an undefined \"clamp\" period (4-13). In the present example, glucose levels were equal between the control and high fat-fed groups, but the GIR was significantly lower in the high fat-fed group (Figure 4B). This is indicative of an impairment in whole-body insulin action. Clamp insulin levels were also higher in the high fat-fed group (Figure 4C), further supporting the presence of an insulin resistant phenotype in these mice. The use of isotopic tracer infusions allows for the assessment of insulin action in specific tissues. [3-3H]glucose is used to estimate the rate of endogenous glucose appearance (endoRa), which is an index of hepatic glucose production (HGP) and the rate of whole-body glucose disappearance (Rd).",
    "Whereas insulin completely suppresses HGP in control mice, this is impaired in mice fed a high fat diet (Figure 4D). Similarly, the ability of insulin to stimulate Rd in control mice is compromised in mice fed a high fat diet (Figure 4E). 2[14C]deoxyglucose is used to assess the glucose metabolic index (Rg), a measure of tissue-specific glucose uptake. As seen in this example, insulin-stimulated glucose uptake into skeletal muscle is impaired in mice fed a high fat diet (Figure 4F).",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/3188/3188fig1.jpg\nFigure 1: Preparation of arterial (A) and (B) venous catheters and (C) MASAtm. Arterial catheters are prepared by inserting a 1.3 cm piece of PE-10 about 3 mm into a 6 cm piece of 0.012\"ID silastic. The PE-10 tip is beveled such that the length from the bevel to the silastic is 0.9 cm. Venous catheters are made by sliding a small piece of 0.020\"ID silastic 1.1 cm from the beveled end of a 6 cm piece of 0.012\"ID silastic. The 0.020\"ID silastic piece acts as a restraining bead to secure the catheter to the jugular vein. For assembly of the MASAtm, each of two 1.3 cm 25-gauge connectors is inserted into each of two 3 cm pieces of PE-20. These are held together by a small piece of 0.040\"ID silastic. The connectors are bent to a 120° angle and separated at a 45° angle. The entire assembly is immersed in medical silicone adhesive.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3188/3188fig2.jpg\nFigure 2: Catheterized mouse. Catheters are surgically implanted in the left carotid artery and the right jugular vein. The free ends of the catheters are externalized behind the head and connected to a MASAtm. The MASAtm is inserted subcutaneously between the shoulder blades. This allows for vascular access during insulin clamp experiments without the need to restrain, handle or anesthetize the mouse.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3188/3188fig3.jpg",
    "Figure 3: Depiction of the setup and time line for an insulin clamp experiment. The mouse is tethered to a dual-channel swivel that acts as a hub for infusion and sampling syringes. Typical setups for experiments not using tracer infusions (A) and using both [3-3H]glucose and 2[14C]deoxyglucose (B) are shown. A time line of procedures for setting up and performing the insulin clamp (C) is also shown. During the clamp, blood samples (imgsrc://cloudfront.jove.com/files/ftp_upload/3188/3188icon1.jpg) are taken every 10 min to measure blood glucose. The GIR is adjusted accordingly to maintain euglycemia. Samples for baseline blood glucose, plasma insulin, and plasma [3-3H]glucose are taken at t = -15 and -5 min. Samples for clamp plasma [3-3H]glucose are taken at t = 80, 90, 100, 110 and 120 and for clamp insulin at t = 100 and 120 min. 2[14C]deoxyglucose is administered after the sample at t =120 min and blood is collected at t = 2, 15, 25 and 35 min after. Tissues are taken after the t = 35 min sample.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3188/3188fig4.jpg\nFigure 4: Results from an insulin clamp experiment comparing mice on a control diet (Chow) to mice on a high fat diet (HFD). Time course of arterial glucose (A) and GIR (B), baseline and clamp insulin (C), EndoRa (D), and Rd (E) and skeletal muscle (gastrocnemius and vastus lateralis) Rg (F) are shown. All results indicate the effect of high fat feeding to induce insulin resistance."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}