{
  "id": 13685,
  "origin_website": "Jove",
  "title": "Differentiation of Atrial Cardiomyocytes from Pluripotent Stem Cells Using the BMP Antagonist Grem2",
  "procedures": [
    "1. Preparation of Cell Culture Media, Solutions, and Reagents.\nPrepare 500 ml of Mouse embryonic stem cell (mESC) media by mixing and sterile filtering (0.2 μm pore size) 445 ml Glasgow Minimum Essential Medium (GMEM), 50 ml heat inactivated fetal bovine serum (FBS), 5 ml 100X concentrated L-Glutamine replacement, 5 µl recombinant mouse Leukemia Inhibitory Factor (LIF) at 1 x 107 units per ml, and 1.43 µl ß-Mercaptoethanol (final concentration is 50 µM). Store at 4 ˚C until ready to use.\nPrepare 500 ml of Embryoid Body (EB) differentiation media by mixing and sterile filtering 391 ml Iscove's Modified Dulbecco Medium (IMDM), 100 ml heat inactivated FBS, 5 ml 100X concentrated L-Glutamine replacement, 5 ml 100X concentrated Non-essential amino acids (NEAA), and 2.86 µl ß-Mercaptoethanol (final concentration is 100 µM). Store at 4˚ C until ready to use.\nPrepare 0.2 % w/v solution of Gelatin by mixing 1 g porcine skin gelatin powder with 500 ml of filtered, distilled H2O. Sterilize by autoclaving. Note that the gelatin may not be completely soluble in water at RT. After autoclaving the gelatin should be completely dissolved. Store at RT until ready to use.\nPrepare Grem2 recombinant protein aliquots by dissolving 50 µg pellet of lyophilized Grem2 in 100 µl phosphate buffered saline (PBS) supplemented with 0.1 % BSA to make a 0.5 µg/µl stock solution. Aliquot 20 µl of this stock solution into five sterile 1.5 ml centrifuge tubes and store at -80˚ C until ready to use.",
    "Prepare PBS according to published protocols or purchase as a 10X stock and dilute 1:10 with filtered, distilled H2O to make a 1X working dilution19. Sterilize PBS by autoclaving prior to use. Store at RT until ready to use. In some steps, DPBS without Ca2+ and Mg2+ is used. This is purchased as a 1X solution. Ordering information is included in the table of reagents.\n2. Preparation of Gelatin Coated 10 cm Tissue Culture Dishes\nIn a sterilized tissue culture hood add 5 ml of 0.2 % gelatin solution to each 10 cm tissue culture dish for coating. Place dishes in incubator at 37 ˚C for at least 30 min or up to 4 days.\n3. Preparation of Gelatin Coated 6-Well Tissue Culture Plates\nIn a sterilized tissue culture hood add 1 ml of 0.2 % gelatin to each well of a 6-well tissue culture plate. Place plates in incubator at 37 ˚C for at least 30 min or up to 4 days.\n4. Embryonic Stem Cell Culture\nThawing mESCs\n\t\nPrepare mESC media by warming to RT in a sterilized tissue culture hood. Add 10 ml RT media to a gelatin-coated 10 cm dish.\nRemove 1 vial of mESCs containing approximately 1 x 106 cells from cryostorage. Holding cryovial with tongs, place in a 37 ˚C water bath. Gently swirl until cell suspension has thawed and only a small ice crystal remains in the center of the vial. Dry off vial with a disposable lint-free wipe and sterilize with 70% EtOH.\nIn a sterile tissue culture hood remove thawed cells using a P1000 tip from cryovial and transfer to 10 cm dish prepared in 4.1.1).",
    "Place 10 cm dish into 37 ˚C humidified cell culture incubator with 5% CO2 and evenly distribute cells by gently moving the plate front to back, then side to side. Allow cells to attach to plate O/N or at least 6 hr.\nFirst thing the next morning check cells for attachment using a bright field microscope. Some cell debris and dead cells will be observed in the media. This is normal. Aspirate media from dishes and replace with 10 ml fresh mESC media.\nContinue to change media on cells every day to prevent differentiation.\nPassaging mESCs\n\t\nPassage cells when 60-70% confluent. Prepare cells for passaging by aspirating media and rinsing with 5 ml sterile 1X DPBS without MgCl2 and CaCl2. Add 2 ml 0.05% trypsin-EDTA solution. Place in incubator at 37 ˚C for 5 min.\nWhile cells are incubating, prepare new 10 cm dish by aspirating gelatin solution and adding 10 ml of RT mESC media. After 5 min check the cells for detachment. If cells remain attached, continue to incubate at 37 ˚C for 2 min at a time until completely detached.\nQuench trypsin-EDTA by adding 3 ml of mESC media. Transfer cell suspension to a 15 ml centrifuge tube and spin at 200 x g for 5 min to pellet. Aspirate media from pellet and re-suspend in 10 ml mESC media.\nDepending on desired split ratio, add 0.5-1.0 ml of cell suspension to each dish prepared in step 4.2.2). Place dish in incubator and evenly distribute cells by gently moving back to front then side to side. Allow cells to attach O/N or for at least 12 hr.",
    "NOTE: A split ratio of 1:10 - 1:20 is common for most mESC lines. This ratio may vary depending on the line used, passage number, and desired confluence on the new dish. For a 1:10 split ratio transfer 1 ml of cell suspension into 9 ml mESC media and plate in a freshly prepared gelatin-coated 10 cm dish.\n5. Preparation of Embryoid Bodies\nNOTE: All steps except centrifugation are performed in a sterile tissue culture hood.\nPreparation of Cell Suspension in EB Media\n\t\nUpon 70 % confluency (usually 24-48 hr post-passage), use the cells for EB formation. Prepare cells for EB formation by detaching and pelleting according to sections 4.2.1) - 4.2.3).\n\t\tNote: It is best to passage cells at least one time post-thaw and check for health (e.g., very little cell death, no contamination, proper morphology) and robust growth (e.g., population doublings occurring every 24-48 hr) prior to use for making EBs.\nRe-suspend pellet in 5 ml EB media. Count cells using a hemocytometer or automated cell counter.\nDilute cell suspension in required volume of EB media to make a final concentration of 25 cells/µl (or 2.5 x 104 cells/ml). Note that each lid of a petri dish holds about 60 EBs and requires about 1.3 ml of cell suspension. At this step, prepare sufficient volume of cell suspension to generate the desired number of EBs. For example, if 240 EBs are required for experiment, prepare 5.2 ml at 2.5 x 104 cells/ml.\n\t\tNOTE: mESCs that are not used for EB formation can be used for future experiments by spinning down, re-suspending in mESC media and plating as described in section 4.2.\nCreation of Embryoid Bodies\n\t\nPrepare sterile 10 cm bacterial petri-dishes for hanging drop formation by adding 2 ml of 1X PBS to the bottom of each.",
    "Transfer EB suspension from step 5.1) to a sterile solution basin.\nRemove lid from prepared petri dish and carefully deposit sixty, 20 µl drops of EB suspension onto the inner surface. Accomplish this efficiently using a multi-channel pipet fitted with 6 tips. Each 20 µl drop now has 500 cells.\nGently replace lid onto bottom half of the bacterial petri-dish, being careful not to dislodge hanging drops. Place dishes into cell culture incubator at 37˚ C. After 2 days, cells are ready to wash down as described in 5.3).\nWash-down of Embryoid Bodies\n\tNote: All wash-down steps are performed in a sterile tissue culture hood.\n\t\nAfter 2 days EB's are ready for washing down and transfer to 6 cm bacterial petri dishes. Pre-warm 3 ml of EB media per petri dish to RT. Each 6 cm bacterial petri dish can effectively hold 2 lids worth of hanging drops.\n\t\tNote: Be sure to use a non-coated petri dish for this step (see materials table). Do not use a tissue culture dish or any other surface that encourages cell adhesion. EBs should remain suspended in media until ready to be plated as described in section 6.\nRemove 10 cm petri dishes from incubator and place into sterile tissue culture hood. Carefully remove lid with EBs and tilt at a 45 degree angle.\nUsing a 5 ml serological pipet containing 3 ml of RT EB media, gently wash EBs into a pool at the bottom of the lid. Carefully inspect the lid for EBs that are stuck to the surface and re-rinse if necessary.\nAfter washing all EBs transfer to a 6 cm petri dish.",
    "Repeat steps 5.3.2)-5.3.4) for all EBs. Each 6 cm petri dish should contain EBs from two 10 cm lids. Place all dishes back into incubator at 37 ˚C for two more days.\n\t\tNOTE: EBs that are too close together in suspension may stick together and form large aggregates. This can negatively impact cardiac differentiation efficiency as well as significantly reduce the numbers of available EBs. To prevent aggregation, EBs should be checked each day and separated by gently moving back and forth, then side to side. The use of bacterial dishes in the early differentiation steps is necessary to prevent EB attachment to the dish and allow EBs to grow in suspension.\n6. Plating and Treatment of EBs With Grem2\nPrepare Grem2 treatment medium by adding sufficient volume of stock (0.5 µg/µl) Grem2 to RT EB medium for a final dilution of 1-5 µg/ml.\n\tNOTE: The effective concentration for treatment of EBs varies depending on the cell line and specific activity of the current lot of Grem2. It is recommended that prior to use the dose is titrated to find maximal effectiveness. For the CGR8 mESC line we routinely use 3-5 µg/ml of Grem2. Effective concentrations of Grem2 for atrial myocyte generation will produce rapidly contracting cells between days 7-8 that are widespread throughout each well. If contracting phenotype is not observed in treated cultures it is recommended that the Grem2 dose be titrated within the range indicated.\nPrepare 6-well tissue culture plates by aspirating gelatin coating solution from each well and adding 2 ml of RT Grem2 treatment media. Remove EBs from incubator and place into sterile tissue culture hood.",
    "Using a P1000 set to 100 µl transfer 30 EBs from 6 cm petri dishes to each well. Place EBs into incubator and evenly disperse by gently moving plate back to front then side to side.\n\t\nAfter EBs have attached to gelatin coated wells, replace Grem2 media every two days until day 10. After day 10, discontinue the Grem2 treatment and add fresh EB media every two days to maintain healthy cells.\n\t\tNOTE: After attaching, EBs will flatten out along the surface of the coated plate.\n7. Cell Dissociation for RT-qPCR Analysis\nCell Dissociation with Trypsin-EDTA\n\t\nAspirate media from each well and rinse twice with 1 ml per well of sterile DPBS minus Ca2+ and Mg2+.\nAdd 0.5 ml 0.25% sterile Trypsin-EDTA solution to each well from which cells will be collected.\nPlace plate in incubator at 37 ˚C for 5 min.\nAfter 5 min check cells for dissociation. If cells still remain attached to bottom of the well tap gently to loosen. If tapping does not loosen cells, place back into incubator and monitor every 2 min until cells are completely detached.\nNeutralize Trypsin-EDTA solution by adding 0.5 ml EB media to each well.\nTransfer entire 1 ml of cell suspension to a 1.5 ml micro centrifuge tube.\n Pellet cells by spinning in a table-top centrifuge for 5 min at 300 x g.\nAspirate media from pellet and move on to lysis immediately or store pellet at -70 ˚C until ready for lysis. Long-term storage of pellets is not recommended as this can lead to degradation of RNA.\nCell Lysis and Molecular Analysis",
    "At this point cells are ready for RNA isolation using a commercial column extraction kit or using RNA extraction reagent according to the protocols supplied by the manufacturers (see table of materials). Once isolated, reverse transcribed RNA and use cDNA for RT-qPCR analysis using standard techniques20, 21.\n\t\tNOTE: Primers used by this lab for RT-qPCR are listed in Table 1. Atrial identity is confirmed using a combination of RT-qPCR to look at expression of atrial and ventricular genes and electrophysiology to record action potential duration (see section 8). A selection of genes is included in this protocol as an example of reliable atrial and ventricular markers. Further information about atrial and ventricular gene expression in the context of pluripotent stem cell differentiation is found in reference 14.\n8. Electrophysiological Analysis\nCell Dissociation with Collagenase\n\t\nAspirate media from each well and rinse twice with 1 ml per well of sterile PBS.\nAdd 0.5 ml of 1 mg/ml collagenase solution to each well.\nPlace plate in incubator at 37 ˚C for 10 min.\nAfter 5 min check cells for dissociation. If cells still remain attached to each other or the bottom of the well tap gently to loosen. Further dissociate the cells by gentle trituration with a P1000.\n\t\tNOTE: To facilitate patch clamp recordings cells should be triturated until a single-cell suspension is achieved.\nAdd 0.5 ml EB media to each well and mix by pipetting.\nTransfer entire 1 ml of cell suspension to a 1.5 ml micro centrifuge tube.\nPellet cells by spinning in a table-top centrifuge for 5 min at 300 x g.\nAspirate media from cell pellets.\nRe-suspend cells in 500 µl PBS with 10% FBS, being sure to triturate into a single cell suspension.\nElectrophysiological Characterization.",
    "NOTE: Many excellent protocols have been published in this journal on using single cell patch clamp to measure cell membrane potentials. For detailed information on how to perform single cell patch clamp the novice reader is referred to these protocols21-24. The following contains specific information for this protocol that will help the experienced electrophysiologist prepare and handle mESC derived CMs for subtype characterization.\n\t\nPrepare intracellular recording solution composed of the following: 10 mM HEPES buffer, 5 mM MgATP, 2 mM EGTA, 110 mM potassium glutamate, 10 mM KCl, and 10 mM NaCl. Adjust solution to a pH of 7.2 using NaOH.\nPrepare extracellular recording (bath) solution composed of the following: 2 mM HEPES, 10 mM glucose, 1 mM MgCl2, 2 mM CaCl2, 5.4 mM KCl, and 137 mM NaCl. Adjust solution to a pH of 7.4 using NaOH.\nPrepare a glass pipet that measures 2-5 MΩ resistance when backfilled with recording solution using standard borosilicate glass with filament.\nTransfer 100 µl of suspended cells into recording chamber containing extracellular recording solution using a P200.\n\t\tNOTE: Cells may be patched in suspension or, to facilitate handling and use for drug treatment and/or perfusion assays, may be seeded onto a gelatin coated coverslip as outlined in 8.2.5).\nPrepare gelatin coated glass coverslips by placing a 10 mm diameter glass coverslip into each well of a 6-well plate and covering with gelatin solution as described in section 3.1) of this protocol.\n\t\t\nAfter at least 30 min aspirate gelatin solution and add 100 µl of suspended cells directly to coverslip and place entire 6-well plate into incubator for at least 2 hr or until cells have attached. After cells have attached, remove cover slip and place in recording chamber with extracellular recording solution.",
    "NOTE: If using the αMHC-DsRed fluorescent cardiac reporter mESC line, CMs may be identified by their red fluorescent nuclei. If not using a cardiac reporter line, spontaneously contracting cells can be observed and isolated for measurements. Pluripotent stem cell derived CMs are usually smaller and more rounded, lacking the characteristic rectangular morphology of fully formed adult cardiac myocytes.\nMake all recordings at 37 ˚C. Patch single cells using whole cell clamp in current-clamp mode with a borosilicate glass pipet of 2-5 MΩ resistance. Use gentle negative pressure to achieve gigaohm seal prior to gaining whole cell access. Apply rapid negative pressure to rupture membrane and gain whole cell access prior to recording membrane potentials.\nEvoke action potentials using 4 msec depolarizing current injections.\n\t\tNOTE: For PSC-derived CMs the amount of current required to reproducibly trigger action potentials may vary. In order to find optimal threshold current, start at a relatively low current and increase triggering current amplitude in a stepwise fashion until reproducible action potentials are obtained.\n\t\tNOTE: Action potential durations for Grem2-induced atrial myocytes are usually in the range of 20-40 ms and lack a plateau phase (Figure 6B).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}