{
  "id": 4246,
  "origin_website": "Bio",
  "title": "EMS Mutagenesis of <em>Clostridium difficile</em> to Identify Strains with Germination-null Phenotypes",
  "procedures": [
    "Mutagenesis   In the anaerobic chamber, inoculate 5 ml BHIS medium with a colony of C. difficile and grow overnight at 37 °C. Note: The use of 15 ml or 50 ml conical screw cap tubes will facilitate washing steps and incubation steps. However, they are not absolutely required for the protocol to work.   The next day, back dilute the overnight culture into 5-ml BHIS medium to OD600 = 0.05 and grow at 37 °C to an OD600 = 0.5. Note: OD600 = 0.5 is mid-log phase growth. A log phase culture is necessary to ensure that the introduced mutations are passed efficiently to each generation.   Add EMS to 1% (v/v) and grow for 3 h. Notes:     Be sure to properly suspend the EMS, it can form globules at the bottom of the tube.    EMS is a powerful DNA mutagen. Dispose of waste in accordance with your institutions protocols.     Wash the culture, twice, by centrifuging for 10 min at 3,000 x g and at room temperature with 10 ml BHIS medium to remove the EMS.   Resuspend the pellet in 40 ml BHIS medium.   Recover the cells overnight in the BHIS medium at 37 °C. Note: The frequency of rifampin resistance in this population will help determine if the mutagenesis of the cells was successful. Typically, an approximately 1,000 x increase in rifampin resistance is observed.      Isolation of germination-null phenotypes   Spread 50 μl of the recovered, mutagenized C. difficile cells onto each of 20 BHIS agar petri plates. Note: C. difficile sporulates most efficiently on agar medium. Addition of more cells to the plate results in fewer spores generated. We have found that a lower inoculum (e.g. 50 μl) results in a larger spore yield.",
    "Incubate plates at 37 °C in the anaerobic chamber until spores are formed (approximately 4-7 days, depending on the C. difficile strain used).   Using a sterile loop or a pipette tip, scrape the growth from the plate and suspend the growth from each plate in a 1.5-ml microcentrifuge tube containing 1 ml of sterile water/plate. Note: All C. difficile manipulations outside of the anaerobic chamber should be done in accordance with your institutions IBC (e.g. in a biosafety cabinet).   Incubate overnight at 4 °C without agitation. Note: Overnight incubation at 4 °C in water aids in the release of spores from the mother cell.   Wash with 1-ml sterile water five times by centrifuging for 1 min at 14,000 x g in a microcentrifuge at room temperature. Note: As the vegetative cells/mother cells lyse, a white layer of cell debris is often seen. This layer appears on top of the spore layer and can be safely removed during washes.   Combine the spore pellets into 3 ml water.   Carefully layer the spore suspension on top of 7 ml 50% sucrose.   Centrifuge for 20 min at room temperature and 4,000 x g.   Remove the water layer and sucrose from the tube.  Note: Spores form a pellet at the bottom of the tube. Vegetative cells and cell debris remain at the interface or dispersed within the sucrose fraction.   Wash the purified spores, as described above in step B5, five times in sterile water.   Suspend the purified spores in 40 ml BHIS medium supplemented with 10% (w/v) taurocholic acid. Notes:     Taurocholic acid is a germinant for C. difficile spores.   Filter sterilize the BHIS + 10% taurocholic acid medium before use.     Incubate overnight at 37 °C with gentle agitation (e.g. rocking).",
    "Note: This condition will stimulate the germination of those spores that are still able to respond to taurocholic acid as a germinant. Because this protocol selections for germination-null phenotypes, the conditions at which the spores are germinated (i.e. aerobic vs. anaerobic) do not matter.   Centrifuge the solution at room temperature for 10 min at 3,000 x g to pellet the spores and germinated spores.   Resuspend the pellet in 10 ml BHIS medium and incubate aerobically at 65 °C for 60 min. Note: Only dormant spores will survive this condition.   Centrifuge the solution as step B13.   Resuspend the pellet in 250 mM thioglycollate. Note: Because this method selects for germination-null phenotypes, spores must be artificially germinated to recover the mutants as colonies (Kamiya et al., 1989).   Incubate for 30 min at 50 °C.   Centrifuge the solution as step B13.   Resuspend the pellet in water supplemented with 4 mg/ml lysozyme.   Incubate for 15 min at 37 °C.   Spread 25 μl aliquots on 20 BHIS agar plates. Note: To enrich for germination-null phenotypes, repeat steps B1–B21."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}