{
  "id": 9742,
  "origin_website": "Jove",
  "title": "A Filtration-based Method of Preparing High-quality Nuclei from Cross-linked Skeletal Muscle for Chromatin Immunoprecipitation",
  "procedures": [
    "Animal care was performed under Institutional Animal Care and Use Committee (IACUC) guidelines, and the procedures were conducted according to an animal protocol approved by the University of Texas Health Science Center at Houston.\n1. Nuclei Isolation from Cross-linked Skeletal Muscle\nWeigh and mince hind limb skeletal muscle, isolated from approximately 20-week old C57BL/6 male mice, in ice-cold phosphate buffered saline (PBS) as described in detail previously22.\n\tNOTE: We usually obtain 1.0 - 1.5 g of skeletal muscle from one mouse.\n\t\nPlace minced skeletal muscle tissue in a 50-mL conical tube containing 10 mL PBS on ice.\nCentrifuge at 300 x g at 4 °C for 5 min.\nCarefully remove PBS supernatant by aspiration.\nEstimate pellet volume in each 50-mL tube by using reference tubes with 1, 2, 3 and 4 mL of water.\nAdd 7 volumes of ice-cold 1% formaldehyde in PBS and homogenize the samples on ice using a probe tissue homogenizer (see Table of Materials).\n\tNOTE: Optional: The homogenization procedure can be conducted in a cold room.\nCross-link the sample by incubating at room temperature for 10 min.\nQuench the cross-linking reaction by the addition of 1 M glycine to a final concentration of 0.125 M and incubate for 5 min at room temperature.\nCentrifuge the samples at 3,000 x g for 5 min at 4 °C. Remove the supernatant via aspiration.\nRinse with 10 mL of ice-cold base buffer (10 mM HEPES-KOH at pH 7.3, 10 mM EDTA, 10 mM KCl, 5 mM MgCl2, 0.5 mM DTT) containing freshly added protease inhibitors (0.2 mM phenylmethylsulfonyl fluoride (PMSF), and 10 µg/mL leupeptin). Centrifuge at 3,000 g for 5 min at 4 °C and carefully remove the supernatant by aspiration.",
    "Resuspend the pellet in 6 mL of lysis buffer (10 mM HEPES-KOH at pH 7.3, 10 mM EDTA, 10 mM KCl, 5 mM MgCl2, 0.5 mM DTT, 1% Triton X-100) containing freshly added protease inhibitors (0.2 mM PMSF, and 10 µg/mL leupeptin).\nTransfer the sample to a prechilled 15 mL Dounce homogenizer and incubate for 10 min on ice.Dounce homogenize each sample on ice with 15 slow strokes using loose pestle followed by 15 strokes with tight pestle to release the nuclei.\nFilter the homogenate (6 mL) through cell strainer (pore size: 100 µm) and rinse with 4 mL of lysis buffer. Centrifuge the samples at 1,000 x g for 10 min at 4 °C. Resuspend into 5 mL of ice-cold base buffer and dounce 10 times with tight pestle to release nuclei.\n\t\nRemove an aliquot of 20 µL for DNA concentration measurement with a spectrophotometer (OD260/OD280) and microscopic observation with trypan blue if necessary (see below) (Figure 1A).\nFilter the suspension through a cell strainer (Pore size: 70 µm), rinse the tube and filter again with 2 mL base buffer as above.\nRepeat the filtration as in step 1.13 with cell strainers of gradually reduced pore size (40 µm, 30 µm, 20 µm and 10 µm).\n\tNOTE: In total, strainers of 6 pore sizes were used in steps 1.12-1.14.\nCentrifuge at 1,000 g at 4 °C for 10 min. Remove supernatant and resuspend the pellet in 500 µL base buffer.\nMeasure DNA concentration as above.\n\tNOTE: Approximately 200 µg of nucleic DNA was obtained from combining both hind limbs from one animal. Optionally, save 20 µL for microscopic observation with trypan blue staining (stock concentration 0.4%, 1:5 dilution); nuclei will stain blue (Figure 1B).",
    "Centrifuge at 1,000 g at 4 °C for 10 min, and discard the supernatant. Store pellet at -80 °C.\n2. Sonication\nThaw samples in 500 µL of SDS lysis buffer and resuspend with gentle pipetting.\nTransfer the nuclei DNA suspension to a glass vial on ice.\nRun the sonication with focused bursts of ultrasonic acoustic energy from a dish-shaped transducer. See Table of Materials for equipment details. Use the following setting: cycles per burst: 200; intensity: 5; duty cycle: 20; temperature 4 - 6 °C; 30 s on/off.\n\tNOTE: An example for evaluating sonication efficacy is shown in Figure 2.\nTransfer the sonicated chromatin to a 1.5 mL tube. Centrifuge at 12,000 x g for 15 min and transfer the supernatant to a new tube. Transfer 50 µL of sonicated samples (~ 7 - 10 µg/muscle sample) into a new 1.5 mL tube for reverse crosslinking overnight at 65 °C. Freeze the remaining samples at -80 °C.\n3. Evaluation of Sonication and Quantitation\nAdd 1.0 µL of RNase A (500 U/mL RNase A: 20,000 U/mL RNase T1) to the saved 50 µL sonicated samples and incubate for 30 min at 37 °C.\nAdd 8 µL of protease K (10 mg/mL) and incubate 30 min at 55 °C.\nHarvest the DNA by using a DNA extraction kit.\n\t\nAdd 5 volumes of binding buffer, apply it to spin column, and centrifuge at 4,000 x g, 10 min.\nApply the pass-through onto the same column and centrifuge again.\nWash with washing buffer two times at 13,000 x g, 1 min.\nCentrifuge again at 13,000 x g, 1 min to dry the column.\nAdd 50 µL of H2O and centrifuge at 13,000 x g, 1 min to elute DNA.\nApply the pass-through onto the same column and centrifuge again.",
    "Quantify the amount of DNA with a spectrophotometer (OD260/OD280). Run samples on 0.8% gels to evaluate the size and amount (1 µg) of the sonicated products (Figure 2).\n\tNOTE: The average chromatin yield is approximately ~ 20%.\n4. ChIP\nThaw the previously saved chromatin at -80 °C and aliquot the chromatin to ~ 100 - 120 µg per tube. Dilute 1:10 with radioimmunoprecipitation assay (RIPA) buffer (20mM Tris-HCl (pH 7.4), 150mM NaCl, 1mM EDTA, 1mM NaF, 1mM Na3VO4, 1mM PMSF, 1x Protease inhibitor cocktail (PIC), 0.1% Na-deoxycholate (w/v), 1% Triton X-100).\n\t\nIf there are multiple samples in each group, combine equal amounts of chromatin DNA to the final amount of ~ 100 - 120 µg/sample. Save 10% as input.\nAdd 40 µL (50% v/v slurry in RIPA buffer) of BSA-pre-blocked (~ 2 h, 4 °C) Protein A/G agarose (non-Chicken antibody) or IgY beads (Chicken antibody) and incubate on a rotator for 3 h at 4 °C.\nCentrifuge at 1,000 x g, 10 min and carefully transfer the supernatant to new tubes.\nAdd antibodies at 1 µg antibody per ~ 25 - 100 µg chromatin DNA.\nRotate gently at 4 °C overnight at approximately 15 rpm.\nAdd 10 µL of BSA-pre-blocked (~2 h, 4 °C) Protein A/G agarose (non-Chicken antibody) or IgY beads (Chicken antibody) mix and rotate in the cold room for 2 h.\nWash beads as follows. Wash with 1 mL of RIPA buffer for 3 min twice, wash with 1 mL of high salt buffer (20mM Tris-HCl (pH 7.4), 500mM NaCl, 2mM EDTA, 1mM PMSF, 1% Triton X-100) for 3 min twice, wash with 1 mL of LiCl buffer (20mM Tris-HCl (pH 7.4), 250mM LiCl, 2mM EDTA, 1mM PMSF, 1% Na-deoxycholate, 0.5% NP40) for 3 min twice.",
    "Wash with 1 mL of Tris-EDTA (TE) buffer (10mM Tris-HCl (pH 7.4), 1mM EDTA) for 3 min once. Then elute DNA with elution buffer (20 mM Tris-HCl, 5 mM EDTA and 0.5% SDS).\nCentrifuge at 1,000 g, 1 min and carefully remove the supernatant.\nResuspend the bead with 50 µL of elution buffer.\nIncubate for 10 min at 65 °C.\nCentrifuge at 12,000 g for 5 min.\nTransfer the supernatant to a new tube, add another 50 µL and centrifuge once again at 12,000 g for 5 min. The final elution volume will be 100 µL.\nReverse crosslinking and DNA elution.\n\t\nIncubate the eluted chromatin overnight at 65 °C.\nAdd 1.0 µL of RNase A and incubate for 30 min at 37 °C.\nAdd 8 µL of protease K (10 mg/mL) and incubate 30 min at 55 °C.\nHarvest the DNA by using a PCR cleanup kit with elution volume at 50 µL according to the manufacturer's protocol.\nAnalyze the profiles by Real-time qPCR as previously described25,26.\n\tNOTE: The primer sequences are listed in Figure 3 Legend. Data are presented as mean ± SEM (Figure 3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}