{
  "id": 18420,
  "origin_website": "Jove",
  "title": "Kinase Inhibitor Screening In Self-assembled Human Protein Microarrays",
  "procedures": [
    "1. Common buffers and solutions to be used\nPrepare TB medium: Terrific broth (24 g/L yeast extract; 20 g/L tryptone; 4 mL/L glycerol; 0.017 M KH2PO4; and 0.072 M K2HPO4). The 0.017 M KH2PO4 and 0.072 M K2HPO4 solutions can be purchased as a 10x phosphate buffer (0.17 M KH2PO4 and 0.72 M K2HPO4).\nPrepare LB medium: Luria-Bertani (5 g/L yeast extract; 10 g/L tryptone; and 10 g/L NaCl). Adjust the pH to 7.0 with 5 M NaOH.\nPrepare 1x TBS: Tris-buffered saline (TBS: 50 mM Tris-Cl, pH = 7.5; 150 mM NaCl).\nPrepare 1x TBST: TBS supplemented with 0.1% Tween 20.\n2. DNA preparation\nNOTE: The DNA utilized for NAPPA arrays must be highly pure; therefore, commercial DNA mini-preps are not recommended. Currently, two protocols for DNA preparation are used: in house high-throughput mini-prep (described here) or commercial Midi- or Maxi-prep. The average throughput of the in-house mini-prep protocol is 1,500 samples a day per person.\nBacterial growth for in-house high-throughput mini-prep\nPrepare LB/Agar omni plate. Pour 30–40 mL of LB agar (1.5 % bacteriological agar in LB media supplemented with antibiotic for selection of positive clones) into each single well plate.\nSpot glycerol stock on LB/agar plate. Dilute glycerol stock in LB media (1:300, usually 2 µL in 600 µL of LB). Shake for 10 min. Spot 3 µL of the diluted stock onto the LB/agar plate. Incubate at 37 °C, upside-down, overnight.\nInoculate cultures. Using the 96-pin device that was sterilized in 80% ethanol and flame, inoculate the culture from the agar plate in a deep-well block with 1.5 mL per well of TB medium supplemented with antibiotic.\nIncubate cultures. Cover the block with a gas permeable seal and incubate for 22–24 h at 37 °C, 300–800 rpm depending on shaker.",
    "NOTE: Shakers set at 800 rpm are optimal for this incubation. Use of a slower speed shaker may result in less dense cultures and lower DNA purification yields.\nPellet cultures. Spin blocks at 3,800 x g and 4 °C for 30 min. Discard supernatant.\nIn-house high-throughput mini-prep\n\tNOTE: Multi-channel pipettors or automatic dispensers can be used to perform the in-house high-throughput mini-prep. If using an automatic dispenser, make sure to clean the system prior to use and in between solutions.\n\t\nPrepare all the solutions used during the mini-prep:\n\t\t\nPrepare Solution 1: TE resuspension buffer (50 mM Tris, pH = 8.0; 10 mM EDTA, pH = 8.0; 0.1 mg/mL RNAse). Store at 4 °C.\nPrepare Solution 2: NaOH/SDS lysis buffer (0.2 M NaOH; 1% SDS). For better results, a freshly made solution should be used.\nPrepare Solution 3: KOAC neutralization buffer (2.8 M KOAc). Adjust the pH of the solution to 5.1 with glacial acetic acid. Store at 4 °C.\nPrepare Solution N2: equilibration buffer (100 mM Tris; 900 mM KCl; 15% EtOH; 0.15% Triton X-100). Adjust the pH of the solution to 6.3 with phosphoric acid.\nPrepare Solution N3: bash buffer (100 mM Tris; 1.15 M KCl; 15% EtOH). Adjust the pH of the solution to 6.3 with phosphoric acid.\nPrepare Solution N5: elution buffer (100 mM Tris; 1 M KCl; 15% EtOH). Adjust the pH of the solution to 8.5 with phosphoric acid.\n\t\t\tNOTE: Successful control of the DNA binding, washing, and elution during anion exchange is highly dependent on buffer KCl concentration and pH values. Careful buffer component measurements and pH adjustment are essential. Small deviations from the described measurements can result in significant loss of yields.",
    "Re-suspend pellet. Add 200 µL of solution 1 and shake at 2,000 rpm for 5 min at RT. Complete re-suspension of the pellet is necessary for successful lysis. Vortex the block if necessary.\nLyse bacteria. Add 200 µL of solution 2, seal the plate with an aluminum seal and invert 5x. Carefully time this step from the beginning of solution 2 addition. Do not exceed 5 min.\nNeutralize solution. Add 200 µL of solution 3, seal the plate with an aluminum seal and invert 5x. The seal may be loose due to the lysis/neutralization buffers, so use caution when inverting. A partial inversion, in which the solution never touches the seal, is recommended to prevent cross-contamination among samples.\nClear lysate. Centrifuge the plates at 3,800 x g and 4 °C for 30 min.\nPrepare anion exchange resin slurry during the lysate pelleting centrifugation step. Using a 1 L bottle, fill it with the anion exchange resin until it reaches the 300 mL mark, then add solution N2 up to 900 mL.\n\t\tCAUTION: This step should be done in the hood to protect against silica inhalation.\nPrepare anion exchange resin plates. Stack the filter plates on top of a deep well block to act as a waste collection vessel. Mix the anion exchange slurry until it is homogeneous, then pour into a glass trough. Using wide-bored P1000 tips, transfer 450 µL of the slurry into each well of the filter plates.\nCentrifuge stacked plates (resin plate/deep well plate) at slow acceleration for 5 min at 130 x g and RT. Discard the flow through.\nTransfer lysate supernatant to the resin plate/deep well block stacks. Spin the stacked plates for 5 min at 30 x g with slow ramp-up speed.",
    "Wash column. Add 400 µL of solution N3 (wash buffer) to each well. Transfer the resin plate to vacuum manifold to remove the wash buffer. Repeat the washing steps 3x. On the last wash, make sure all wells are properly emptied. Spin the stack plates at 150 x g for 5 min to remove any residual buffer.\nElute DNA. Place the resin plate onto a clean 800 µL collection plate. Add 300 µL of solution N5 to each well. Let it sit at RT for 10 min, then spin the stacked plates for 5 min at 20 x g with slow ramp-up speed. Spin the stacked plates for 1 min at 233 x g.\nQuantify DNA and store plates at -20 °C until further use or proceed straight to DNA precipitation.\n\t\tNOTE: A minimum of 30 µg of DNA per sample is necessary. If the DNA yield is low, it is recommended to repeat the DNA mini-prep, or alternatively combine two plates during the precipitation step (section 2.3).\nDNA precipitation\nThaw out plates, vortex to homogenize the DNA solution, and spin at 230 x g for 30 s to collect all solution in the bottom of the well.\nAdd 40 µL of 3 M NaOAc and 240 µL of isopropanol to each well. Cover the plate with an aluminum seal and mix by inverting 3x.\nCentrifuge the plates at for 30 min at 3,800 x g and 25 °C. Carefully discard the supernatant.\n\t\tNOTE: To combine two plates, transfer the DNA from the second plate into the pellet from the first plate and repeat steps 2.3.2–2.3.3.",
    "Wash and precipitate the DNA. Add 400 µL of 80% ethanol to each well. Seal plates with aluminum seal and shake at 1,000 rpm for 30 min. Centrifuge at 3,800 x g for 30 min at 25 °C. Discard the supernatant.\nDry the DNA pellets. Place the plates upside-down at an angle on paper towels and let them dry for 1–2 h, until no alcohol is present at the bottom of the well. Seal and centrifuge at 230 x g for 2 min to bring any pellets down.\nOnce plates are dry, either seal with aluminum seal and freeze at -20 °C for later use or continue to resuspend the DNA (step 4.1).\n3. Aminosilane slide coating\nPlace the glass slides in metal rack. Visually inspect each slide to assure no scratches or imperfections are present.\nSubmerge slides in coating solution (2% aminosilane reagent in acetone) for 15 min while rocking. The aminosilane solution can be used to coat two racks of 30 slides each before it needs to be discarded.\nRinse step. Submerge the slide rack in acetone wash (99% acetone), shake back and forth, then up and down quickly 5x. Tilt to one corner to drip off, then submerge in Ultrapure water up and down quickly 5x. Tilt to drip off, then place on napkins.\n\tNOTE: Acetone wash can be used twice, while the ultrapure water must be changed each time.\nDry slides using pressured air, blowing on them from all angles for about 3 min until all water droplets have been removed. Store the coated slides at RT in a metal rack inside a tightly sealed box.\n4. Array sample preparation",
    "Resuspend the DNA pellet from the in-house mini-prep (step 2.3.6) in 20 µL of ultrapure water and shake at 1,000 rpm for 2 h. For midi/max prep DNA, dilute each sample to a final concentration of 1.5 µg/µL and transfer 20 µL to an 800 µL collection plate.\nPrepare printing mix. For one 96 well plate, prepare 1 mL of printing mix [237.5 µL of ultrapure water; 500 µL of poly-lysine (0.01%); 187.5 µL of BS3 (bis-sulfosuccinimidyl, 50 mg/mL in DMSO); and 75 µL of polyclonal anti-flag rabbit antibody)].\n\tNOTE: The chemicals should be added in the specified order to avoid precipitation.\nAdd 10 µL of printing mix to each sample, seal plates with aluminum foil, and shake at RT for 90 min at 1,000 rpm. Store the plates overnight (~16 h) at 4 °C.\nOn the printing day, briefly vortex and spin the plates. Transfer 28 µL of each sample to a 384 array plate. This transfer can be done using automation or a multi-channel pipette. It is crucial to keep track of the position of the samples in the 384 array plate.\nSpin the plate down briefly to remove any bubbles. Seal the plates with foil.\n5. Generation of NAPPA arrays: microarray printing\nNOTE: All the printing conditions were optimized for the instrument listed in Table of Equipment and Materials. If using a different array, further optimization may be required.\nArrayer clean up. Before starting, empty all waste tanks and refill the reservoirs with ultrapure water or 80% ethanol, if needed. Clean pins one-by-one with lint-free wipes and ultrapure water. Dry the pins with lint free wipes and carefully place them back into the arrayer head.",
    "Arrayer set up: printing specifications [maximum number of stamps per ink: 1; number of stamps per spot: 1; multi-stamp timing: --; stamp time (ms): 0 ms; inking time (ms): 0 ms; print depth adjustment: 90 microns; number of touch-offs: 0]. Then, follow the sterilization protocol: ultrapure water wash for 2,000 ms with 0 ms of drying time and 500 ms of waiting time; repeat these steps 6x; followed by washing with 80% ethanol for 2,000 ms with 1,200 ms of drying time and 500 ms of waiting time; repeat these steps 6x.\nSlide design: set up the arrayer with the desired arraying pattern. The design should take into consideration several factors [i.e., the number of replicas for each sample, location and number of the control features, array layout (one block, several identical blocks), number of arrays to be printed, length of the run, etc.].\nPlace the aminosilane coated slides (step 3.4) on the arrayer deck. Check to see if the vacuum is holding all the slides securely in place. Start the humidifier (it should be set at 60%).\nPlace the 384 well plate on arrayer deck. Start the program.\nLabel the microarrays. When printing is done, place slide labels on the bottom (non-printed) side of each slide. Maintain the slides printing order on the deck in numerical order.\nStore the printed arrays at RT in a metal rack inside a tightly sealed box with a silica packet. Slides kept in a dry environment have a shelf life to up to one year.",
    "(Optional): a second batch of 90 slides can be printed using the same samples. To do so, remove the 384 well plate from the arrayer deck as soon as the printing of the plate is done. Seal and store the plate at 4 °C. After the first batch of arrays are completely done, remove them from the deck, place new aminosilane coated slides and start a new run. Make sure each 384 well plate is at RT for 30 min prior to its use. If more than four replicas per sample are printed in a batch of slides, it is recommended to split the 384 well plates into two plates to decrease sample evaporation by decreasing the amount of time spent on the arrayer deck.\n\tNOTE: Check all reservoirs prior to the beginning of the second run.\n6. Detection of DNA on NAPPA slides\nBlock the slides. Place the slides in a pipette box and add 30 mL of blocking buffer. Incubate at RT for 1 h on a rocking shaker.\nStain the slides. Discard the blocking solution and add 20 mL of blocking buffer and 33 µL of fluorescent DNA-intercalating dye. Incubate for 15 min with agitation. Then, quickly rinse the slides with ultrapure water and dry with pressured air. Proceed with the scanning (section 11).\n7. Expression of NAPPA slides\nBlock the slides with blocking buffer on a rocking shaker at RT for 1 h. Use approximately 30 mL in a pipette box for four slides.\nRinse slides with ultrapure water and dry with filtered compressed air. Apply sealing gasket to each slide per the manufacturer’s instructions.",
    "Add IVTT mix. Each slide will require 150 µL of IVTT mix. Dilute 82.5 µL of HeLa lysate in 33 µL of DEPC water and supplement with 16.5 µL of accessory proteins and 33 uL of reaction mix. Add IVTT mix from the non-label or non-specimen end. Pipette the mix in slowly (it is acceptable if it beads up temporarily at the inlet end). Gently massage the sealing gasket so that the IVTT mix spreads out and covers the whole area of the array. Apply the small round port seals to both ports.\nPlace the slides on a support and transfer them to the programable chilling incubator. Incubate for 90 min at 30 °C for protein expression, followed by 30 min at 15 °C for immobilization of the query protein.\nWash and block the slides. Remove the sealing gasket and immerse slides in a pipette box with approximately 30 mL of 1x TBST supplemented with 5% milk for protein display (section 8) or 1x TBST supplemented with 3% bovine serum albumin (BSA) for kinase assays or drug screening (section 9). Incubate at RT with agitation for 20 min and repeat this step 2x.\n8. Detection of proteins on NAPPA arrays\nAdd primary antibody. Remove the slides from the blocking solution (step 7.5) and gently dry the back side (non-printed side) using a paper towel. Place the slides on a support and apply 600 µL of primary antibody (mouse anti-flag) diluted 1:200 in 1x TBST + 5% milk. Incubate for 1 h at RT.\nWash the slides with 1x TBST + 5% milk on a rocking shaker (3x for 5 min each).",
    "Add secondary antibody. Remove the slides from the washing solution and gently dry the back side using paper towel. Place the slides on a support and apply 600 µL of secondary antibody (cy3-labbeled anti-mouse antibody) diluted 1:200 in 1x TBST + 5% milk. Protect the slides from light and incubate for 1 h at RT.\nWash the slides with 1x TBST on a rocking shaker (3x for 5 min each). Quickly rinse the slides with ultrapure water and dry using pressured air. Proceed with the scanning (section 11).\n9. Tyrosine kinase inhibitor screening on NAPPA arrays\nNOTE: Multiple slides can be processed in the same experiment, however, make sure that in each step, one slide is processed at a time and that they do not dry between steps. Add all solutions to the non-label or non-specimen end of the slide.\nPrepare all the solutions used during the drug screening:\n\t\nPrepare phosphatase/DNase solution by combining the following: 1x protein metallo-phosphatases buffer (50 mM HEPES, 100 mM NaCl, 2 mM DTT, 0.01% Brij 35 at pH = 7.5); 1 mM MnCl­­2; 8,000 units of lambda protein phosphatase; and 2 units of DNase I. Prepare 400 µL of the solution for each microarray. Add phosphatase and DNase just prior to use.\nMake the drug dilution. Drugs are reconstituted in DMSO to a final concentration of 10 mM. To assure that all drug concentrations tested on the array, ensure that the same volume of DMSO (a 10,000x stock in DMSO) is created for each concentration and kept at -80 °C. At the time of use, drugs are diluted 1:100 in water.",
    "Prepare drug/kinase solution by combining the following: 1x kinase buffer (25 mM Tris-HCl of pH = 7.5); 5 mM beta-glycerophosphate; 2 mM DTT; 0.1 mM Na3VO4; 10 mM MgCl2; 500 µM ATP; and 2 µL of drug (diluted 1:100 in water). Prepare 200 µL of the solution for each microarray.\nPerform the phosphatase and DNase treatment. Remove slides from the blocking solution (step 7.5) and gently dry the backside using paper towel. Place the slides on support and apply 200 µL of phosphatase/DNase solution. Place a microarray coverslip to avoid evaporation. Incubate at 30 °C for 45 min in the oven.\nPhosphatase and DNase treatment II: remove arrays from the oven, discard the coverslip, remove excess solution, and apply 200 µL of freshly made phosphatase and DNase solution. Cover microarrays with coverslip and incubate for another 45 min at 30 °C in the oven.\nWash slides with 1x TBST + 0.2 M NaCl on a rocking shaker (3x for 5 min each).\nPerform the drug treatment and kinase reaction. Remove slides from the washing solution and gently dry the backside using a paper towel. Place the slides on support and apply 200 µL of drug/kinase solution. Place a coverslip on top to avoid evaporation. Incubate for 1 h at 30 °C in the oven.\nWash slides with 1x TBST + 0.2 M NaCl on a rocking shaker (3x for 5 min each).\nRepeat steps 8.1–8.4 using as primary antibody anti-phosho-Tyr antibody diluted 1:100. Replace 1x TBST + 5% milk in all steps with 1x TBST + 3% BSA.\n10. Automated hybridization protocol\nNOTE: Alternatively, a hybridization station can be used to automate all hybridizations and washes on the NAPPA arrays (sections 7–9) and the protocol is provided as Supplementary File 1.\n11. Image acquisition",
    "NOTE: Microarray images should be acquired at a resolution of 20 microns or higher.\nLoad microarrays into the slide holder magazine with the proteins facing up. Load the magazine into the microarray scanner.\nSelect the green laser with a 575/30 nm emission filter to scan the signal from the cy-3 labelled secondary antibody. If a different fluorophore is used, select the correct laser/wavelength to detect the signal from the fluorescent dye.\nDefine the name for each image and the location that they will be saved.\n(Optional): for each new fluorophore, optimization of the scanning conditions are recommended to detect the linear range of the signal intensity. To do so, scan a microarray using a range of photomultiplier (PMT) and gain until a clear image is obtained with non-saturated signal and low background.\nScan all microarrays with the optimized settings and remember to turn the autogain off.\n\tNOTE: For data analysis, all microarrays should be scanned using the same scanning settings. For kinase assays using cy3 as a fluorophore, the images are scanned with a 20% PMT, laser intensity of 25%, and 10 microns of resolution, using the scanner listed in the Table of Equipment and Materials.\n12. Data processing and analysis\nNOTE: Several software packages are available for the quantification of microarray data with similar capabilities. The procedure described here was designed for the software listed in the Table of Equipment and Materials.\nLoad the TIFF files to be quantified, design the grid to match the microarray layout and adjust the size of the spots to incorporate the entire signal with the minimum area possible. Neighboring spots should not overlap. Visually inspect how well the software is performing and adjust the grid manually, if necessary.",
    "Quantify the signal intensity of the microarray. Visually inspect the spots for any abnormality (non-specific binding, dust, etc.) and remove them from the data analysis.\nCorrect the background locally using the signal of neighboring areas on the array in which no spot is present.\nNormalize data. To compare the signal across different arrays, the signal intensity of each microarray must be normalized. To exclude any outliers, normalize the data using the trimmed mean 30% of the signal from the positive control (IgG spots) of the dephosphorylated microarrays.\n\tNOTE: The signal from the IgG spot does not change during the phosphorylation and dephosphorylation of the microarrays and is suitable for the normalization.\nIdentify active kinases. For each feature displayed on the microarray, calculate the ratio between the normalized signal intensity in the autophosphorylated and dephosphorylated arrays. Set a threshold of 1.5-fold change for the identification of the active kinases and mark all the other features as unable to undergo autophosphorylation (N/A).\nCalculate the activity of each kinase identified in step 12.5 as a percentage of adjusted signal (signal intensity of the normalized positive control array (DMSO) subtracted by the signal intensity of the normalized negative control array (dephosphorylated)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}