{
  "id": 6878,
  "origin_website": "Bio",
  "title": "Quantitative Nucleocytoplasmic Transport Assays in Cellular Models of Neurodegeneration",
  "procedures": [
    "A summary of the protocol is shown in Figure 1. The first part of this protocol describes the generation of three different reporter cell lines (Figure 2), which allows us to investigate the import pathways involved in ALS pathology. The protocol can be easily adapted to investigate other transport pathways by simply changing the nuclear localization or nuclear export signal in the constructs. The second part describes how to measure and analyze nucleocytoplasmic transport.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204559_4487.jpgFigure 1. Workflow summaryimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204621_8791.jpgFigure 2. Generated reporter cell lines. Using CRISPR-Cas9 technology three different reporter cell lines were generated that stably express the indicated constructs. This allows us to investigate the import pathways that are involved in ALS: (1 + 3) KPNB1/KPNAx-mediated import pathway (pathway used by TDP43) and (2) the TPNO1-mediated pathway (pathway used by FUS). In cell line 1, the reporter mainly localizes into the cytoplasm. This allows, in combination with an XPO1-inhibitor, to induce a time-dependent transport from the cytoplasm into the nucleus and as such to measure KPNB1/KPNAx-mediated import over time. Cell lines 2 and 3 allow measuring a shift in the balance between import and export in a simple way.Generation of cell lines to study nucleocytoplasmic transportThe reporter constructs, driven by a CMV promotor, were integrated in the AAVS1 safe harbor locus of Hela Kyoto cells using a CRISPR-Cas9 knock-in protocol. Three different CRISPR-Cas9 knock-in protocols were used.CRISPR-Cas9 knock-in protocols for creating nucleocytoplasmic transport cell linesProtocol 1 (Sakuma et al., 2016):Use classical PCR to insert the nucleocytoplasmic transport reporter cassette of interest into a pcDNA3.1 plasmid. When designing the insert, make sure the 5' and 3' ends contain two identical targeting sites and micro-homology sequences. The CRISPR-Cas9 targeting sites are needed to cut the insert out of the plasmid in the following step.",
    "The microhomology sequences are needed to specifically insert the cassette into the AAVS1 safe harbor site. Here, we cloned a cassette expressing the NLSSV40-mNeongreen2x-NESpki and fused it with P2A-PuromycinR (Figure 3A).Protocol 2 (Geisinger et al., 2016):A PuromycinR-P2A-NESpki2-mNeongreen2x-NLSFUS reporter was cloned into a pcDNA3.1 plasmid (Figure 3B) that serves as a template for a PCR reaction with 5′ phosphorothioate modified primers (fw primer: T*C*C*CCTCCACCCCACAGTGGGGCC ACTAACGGGCCAGATATACGCG; rv primer: T*C*C*CCTCCACCCCACAGTGGGGCCACTA CTGGTTCTTTCCGCCTCAGAA, with * denoting a phosphorothioate modified nucleotide). This PCR product is used as the donor for the CRISPR knock-in protocol. The PCR primers contain the 5′ end microhomology sequences to enable specific integration of the insert into the AAVS1 safe harbor site (similar as for protocol 1).Protocol 3 (Schmid-Burgk et al., 2016):NLScMYC-AcGFP2x-NESikb2 was cloned into a pGL4-plasmid that contains at the 5′ end the CRISPR-Cas9 targeting side, to linearize it for insertion into the AAVS1 safe harbor site using the CRISPaint knock-in protocol (Figure 3C).Notes: Pay attention to the final size of your reporter protein. If your goal is to study active transport, use a fusion protein of two or three times your fluorescent protein reporter (approximately 27 kDa). We used two copies of mNeonGreen to exceed the limit for passive transport (± 50 kDa). NESpki2 contains a K to P mutation (MSLNELALPLAGLDI) which weakens the original NESpki export signal. As such, the equilibrium between import and export is shifted towards import and the reporter is localized mainly inside the nucleus. Because the Schmid-Burgk protocol is not based on microhomology (Schmid-Burgk et al., 2016), in contrast to 1 and 2, this is the least efficient knock-in protocol. Moreover, the full donor plasmid is integrated in the Hela Kyoto AAVS1 locus in this protocol. The Sakuma protocol (Sakuma et al.",
    ", 2016) has the highest knock-in efficiency, but is the most difficult one to clone.Stable cell line generation (for used plasmids see Figure 3)Cell culture medium used in all steps consists of Gibco DMEM medium supplemented with 10% fetal bovine serum (FBS) and 50 µg/ml gentamicin.Day 1: Seed 100,000 Hela Kyoto cells in a 6-well plate.Day 2:Protocol 1: Co-transfect these cells using Lipofectamine 3000 (Thermo Fisher Scientific). Add 500 ng of the respective pcDNA3.1-donor plasmid (Figure 3A), 1,000 ng of a plasmid expressing Cas9 plus a gRNA targeting the AAVS1 locus (GTCACCAATCCTGTCCCTAG) (Figure 3D) and 500 ng of a plasmid expressing a gRNA (GCCAGTACCCAAAAAGCGGG) that cleaves the reporter plasmid at two sites to excise the cassette (Figure 3E).Protocol 2: Co-transfect these cells using Lipofectamine 3000 (Thermo Fisher Scientific). Add 500 ng of the cassette PCR donor product (Figure 3B) and 1,000 ng of a plasmid expressing Cas9 plus a gRNA targeting the AAVS1 locus (GTCACCAATCCTGTCCCTAG) (Figure 3D).Protocol 3: Co-transfect these cells using Lipofectamine 3000 (Thermo Fisher Scientific). Add 500 ng of the respective pGL4-donor plasmid (Figure 3C), 1,000 ng of a plasmid expressing Cas9 plus a gRNA targeting the AAVS1 locus (GTCACCAATCCTGTCCCTAG) (Figure 3D) and 500 ng of a plasmid expressing a gRNA (GCCAGTACCCAAAAAGCGGG) that cleaves the reporter plasmid at one site to linearize the donor plasmid (Figure 3E).Tip: Include a negative control condition by omitting the donor plasmid expressing Cas9/gRNA in one well. Day 3: Change medium to limit toxicity caused by the transfection reagents.Day 4: Trypsinize transfected cells and select with puromycin (1 µg/ml).Analyze plates in the next days for discrete colonies that start to appear.Tip: To exclude falls positives: make sure to only continue when all cells are dead in the negative control (without donor plasmid).",
    "In addition, keep cells under selection with antibiotics in the following days. When the 6-well is completely confluent with this polyclonal cell mixture, monoclonal cells can be grown. Therefore, seed cells in a 96-well plate at a density of 0.5 cell/well. This can be achieved as follows:Take off medium and wash cells with 1 ml of 1x PBS.Remove PBS and add 500 µl of 0.05% trypsin per well. Return to the incubator for 5 min.Confirm that cells are detached. If not, place the cells again in the incubator for several minutes until they do.Add 1.5 ml medium per well. It is important to pipette up and down to mix and obtain single cells. Measure the obtained cell number.Make a 1/100 dilution (10 µl to 990 µl of medium) to facilitate the next step. Mix well.Add a volume that contains 50 cells to 10 ml of medium (10 ml is sufficient for one 96-well plate).Add 100 µl per well to obtain a concentration of 0.5 cells/well. As such, the majority of wells will have zero or one cells, with a small number containing two or more cells.Tip: Seed a higher density (e.g., 1,000 cells/well) in the left upper corner. As such, it will be easier to find the right focus on the microscope when you search for colonies. Scan the plate five days later for the formation of monoclonal colonies. Do not include wells that contain two (or more) separate colonies, as they most probably arose from more than one cell and will therefore not result in a monoclonal culture.Tip: Pay attention to the sides of the wells, as cells tend to attach there. When the 96-well is completely full, expand the monoclonal culture.Tip: Expand gradually by starting with a T-25 culture flask.",
    "Freeze cells at -80 °C before long-term storage in liquid nitrogen. This can be achieved as follows:Prepare freezing medium (for a total of 10 ml: 8.2 ml culturing medium + 800 µl DMSO + 1 ml FBS). Place the medium on ice, as DMSO is toxic to your cells at room temperature.Label Cryotubes and pre-chill them on ice.Take off medium and wash cells with 1x PBS.Remove PBS and add 0.05% trypsin. Return to the incubator for 5 min.Confirm that cells are detached. If not, return cells to the incubator for several minutes until they do.Add medium to inhibit the trypsin and bring everything into a 50 ml tube.Count cells.Spin off for 5 min at 500 rcf.Remove supernatant and resuspend pellet in pre-made freezing medium. Add 1 ml per 1.5 x 106-2 x 106 cells.Pipette 1 ml of the freezing medium in each pre-chilled cryotube.Place tubes at -80 °C with the help of a Mr. FrostyTM freezing container.For long-term storage, move your samples the next day to a liquid nitrogen container.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204701_4097.jpgFigure 3. Plasmids used to generate reporter cell lines. A. Donor plasmid containing the reporter NLSSV40-mNeongreen2x-NESpki used in protocol 1. B. Plasmid containing the reporter NESpki2-mNeongreen2x-NLSFUS, which served as a template for the PCR reaction performed in protocol 2. NESpki2* contains a K to P mutation. C. Donor plasmid containing the reporter NLScMYC-AcGFP2x-NESikb2 used in protocol 3. D. Plasmid expressing Cas9 plus a gRNA targeting the AAVS1 locus (Schmid-Burgk et al., 2016) used in protocols 1, 2 and 3. E. Plasmid expressing a gRNA to cleave the donor plasmid containing the reporter (Schmid-Burgk et al., 2016) used in protocols 1 and 3.ValidationNote: It is important to validate your reporter. This can be done by:1) Treating your cells with available compounds e.g., leptomycin B to inhibit XPO1-mediated export (Kudo et al.",
    ", 1999) or importazole to inhibit KPNB1-mediated import (Soderholm et al., 2011). 2) Transfecting your cells with appropriate constructs e.g., M9M expression to inhibit TPNO1/TPNO2 (Cansizoglu et al., 2007). 3) Knock down of targeted transport receptors e.g., siRNA against KPNB1 or KPNA2. Note: Cell culture medium used in all steps consists of Gibco DMEM medium supplemented with 10% FBS and 50 µg/ml gentamicin. Validate XPO1-mediated export with leptomycin BDay 1: Seed NLSSV40-mNeongreen2x-NESpki reporter cells at a density to obtain 60-70% confluency the next day.Day 2: Change half of the medium in the wells to obtain a final concentration of 50 nM of the XPO1-inhibitor leptomycin B (Kudo et al., 1999).Return cells to the incubator for 30 min.Fix cells with 4% PFA for 15 min.Wash cells three times with 1x PBS.Stain nuclei using NucBlue Live Cell Stain reagent (Invitrogen).Image cells to confirm increased nuclear localization of the reporter in the leptomycin B treated cells (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204733_6427.jpgFigure 4. Validation of XPO1-mediated export. Representative images of cells expressing the reporter NLSSV40-mNeongreen2x-NESpki. A. In steady state, the reporter localizes in the cytoplasm of cells. B. Addition of the XPO1-inhibitor leptomcyin B (LMB) results in nuclear localization of the reporter. Scale bars = 20 µm.Validate KPNB1/KPNAx-mediated import with importazoleDay 1: Seed NLSSV40-mNeongreen2x-NESpki reporter cells at a density to obtain 60-70% confluency the next day.Day 2: Incubate the cells for 2 h with 50 µM of the KPNB1-inhibitor importazole (Soderholm et al., 2011).Change half of the medium in the wells to obtain a final concentration of 50 nM leptomycin B.Note: The reporter localizes steady state in the cytoplasm of the cells (due to XPO1-mediated export) and serves therefore, in combination with an XPO1-inhibitor (leptomycin B), as an import-reporter for KPNB1/KPNAx-mediated import. Return cells to the incubator and fix cells with 4% PFA after 30 min.",
    "Wash cells three times with 1x PBS.Stain nuclei using NucBlue Live Cell Stain reagent (Invitrogen).Image cells to confirm a decreased nuclear localization of the reporter in the importazole-treated cells (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204757_7096.jpgFigure 5. Validation of KPNB1/KPNAx-mediated import. Representative images of cells expressing the reporter NLSSV40-mNeongreen2x-NESpki. A. Addition of leptomycin B results in nuclear localization of the reporter, due to KPNB1/KPNAx-mediated import. B. Pre-incubation with importazole partially abolishes KPNB1/KPNAx-mediated import. Scale bars = 20 µm.Validate TPNO1/TPNO2-mediated import through M9M expressionDay 1: Seed NESpki2-mNeongreen2x-NLSFUS reporter cells at a density to obtain 60-70% confluency the next day.Day 2: Transfect cells with a plasmid expressing the peptide M9M (Cansizoglu et al., 2007) using lipofectamine 3000 (Thermo Fisher Scientific).Note: Express M9M in fusion with a fluorescent protein (e.g., Red fluorescent protein) to identify transfected cells. Change medium 4 h after transfection to reduce toxicity.Incubate cells overnight.Day 3: Fix cells with 4% PFA for 15 min.Wash three times with 1x PBS.Stain nuclei using NucBlue Live Cell Stain reagent (Invitrogen).Image cells to confirm decreased nuclear localization of the reporter in the M9M-expressing cells (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204823_5246.jpgFigure 6. Validation of TPNO1/TPNO2-mediated import. Representative images of cells expressing the reporter NESpki2-mNeongreen2x-NLSFUS. A. In steady state, the reporter localizes inside the nucleus, caused by TPNO1/TPNO2-mediated import. Reporter cells were transfected with an mCherry-plasmid as negative control. B. Reporter cells transfected with an RFP-M9M-plasmid, which inhibits TPNO1/TPNO2-mediated import and results in cytoplasmic redistribution of the reporter. Scale bars = 20 µm.Validate KPNB1/KPNAx-mediated import through KPNB1/KPNA2-knock downDay 1: Seed NLScMYC-AcGFP2x-NESikb2 reporter cells at a density to obtain 60-70% confluency the next day.Day 2: Electroporate cells with siRNA against KPNB1 or KPNA2 (Horizon Discovery siRNA resuspension buffer, Bio-Rad: 230V, 950 µF, ∞Ω, 10,000 ms, #1 pulse).Incubate cells for 48 h.Fix cells with 4% PFA for 15 min.Wash three times with 1x PBS.",
    "Stain nuclei using NucBlue Live Cell Stain reagent (Invitrogen).Image cells to confirm decreased nuclear localization of the reporter (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204850_5809.jpgFigure 7. Validation of KPNB1/KPNAx-mediated import. Representative images of cells expressing the reporter NLScMYC-AcGFP2x-NESikb2. A. The reporter localizes steady state in the nucleus of the cells, due to KPNB1/KPNAx-mediated import. B. Expression of siRNA targeting KPNB1 or KPNA2 results in cytoplasmic localization of the reporter. Scale bars = 25 µm.Optimization of the NLSSV40-mNeongreen2x-NESpki reporterIn steady state, the NLSSV40-mNeongreen2x-NESpki reporter localizes in the cytoplasm of the cells (caused by XPO1-mediated nuclear export) and serves therefore, in combination with an XPO1-inhibitor (leptomycin B; LMB), as an import-reporter for KPNB1/KPNAx-mediated import.Note: Because the nuclear intensity results from the balance between export and import, it is important to optimize LMB concentrations to maximize the sensitivity of the assay to measure import deficits. In addition, to minimalize variability it is recommended to work with a LMB concentration that induces a gradual import of the reporter and allows import measurements to occur over longer periods (30 min). Moreover, it is recommended to measure at least two different time points to assure that your measurement falls within the dynamic range of the nuclear import process and saturation is not yet reached.Note: Cell culture medium used in all steps consists of Gibco DMEM medium supplemented with 10% FBS and 50 µg/ml gentamicin. Day 1: Seed NLSSV40-mNeongreen2x-NESpki reporter cells in a 96-well plate at a density to obtain 70% confluency the next day.Note: Keep in mind that you will need three different time points and this in duplicate or triplicate per condition. Day 2: Replace old medium with 100 µl of medium containing 25 µM of the KPNB1-inhibitor importazole.Return cells to the incubator for 1.5 h.",
    "Note: The importazole concentration was chosen with the aim to induce average import inhibition, to not miss potential small import deficits induced by poly-PR. Meanwhile, prepare different dilutions of LMB (dissolved in ethanol) in pre-warmed medium at a final concentration of 0 nM, 15 nM, 30 nM, 45 nM, 60 nM, 75 nM and 90 nM. Vortex.Note: Keep in mind the dilution in the next steps. Therefore, prepare twice the final concentration, e.g., 120 nM for a final concentration of 60 nM. Treat the cells intended for the 30 min time point with the different concentrations of LMB, by adding 100 µl of medium containing LMB to the 100 µl of medium already in the wells.Return cells to the incubator for 15 min.Treat the cells intended for the 15 min time point with the different concentrations of LMB by adding 100 µl of the medium containing LMB.Return cells to the incubator for 15 min.Fix with 4% PFA for 15 min.Wash cells three times with 1x PBS.Stain nuclei using NucBlue Live Cell Stain reagent (Invitrogen).Cells can be analyzed automatically by the CellInsight CX5 high content screening platform (Thermo Fisher Scientific) to determine the LMB concentration that induces the largest difference between control cells and importazole-treated cells (Figure 8).Note: Use a multichannel pipette to reduce variability.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204914_8097.jpgFigure 8. Optimization of KPNB1/KPNAx-mediated import of the NLSSV40-mNeongreen2x-NESpki reporter measured over time. A-B. Import of importazole-treated cells relative to import of DMSO-treated cells for different concentrations of leptomycin B (LMB). A-15 min; B-30 min. A. 45 nM of LMB results in the strongest difference between control cells and cells-treated with importazole. B. Lower concentrations allow measuring import-inhibition, as import becomes saturated at this later time point for higher concentrations of LMB. C. Left graph: lower concentrations (e.g.",
    ", 30 nM) of LMB result in less overall import and make it therefore harder to observe disturbed import after 15 min. Import defects can be observed at later time points (30 min). Middle graph: 45 nM of LMB revealed import deficits at both time points. Right graph: higher concentrations of LMB (e.g., 90 nM) can push import too hard to observe a minimal impediment of import. A-B. Dot represents the average of one experiment with 2,500-7,000 cells per experiment. Mean + S.D. C. Dot represent the average of one experiment with 2,500-7,000 cells per experiment.Measuring nucleocytoplasmic transport in the presence of mutant C9orf72-related peptidesProduction of lentiviral vectors expressing mutant C9orf72-related peptidesDPR100-plasmids were a kind gift of Dr. Daisuke Ito (Department of Neurology, Keio University, Tokyo, Japan). Classical PCR was used to clone mCherry-DPR100 constructs into lentiviral vector plasmids (LentiCrisprV2_Puro from Addgene) (Figure 9). Production of lentiviral vectors was done using HEK-293T cells as previously described (Hart et al., 2017).Note: We strongly advise to use transduction instead of transfection to express desired disease-related constructs. Transfection is more stressful which can influence nucleocytoplasmic transport measurements.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617204942_2024.jpgFigure 9. Lentiviral vector plasmids used to express mCherry or mCherry-PR100. A. Lentiviral vector containing mCherry. B. Lentiviral vector containing mCherry-PR100.AssayNote: Cell culture medium used in all steps consists of Gibco DMEM medium supplemented with 10% FBS and 50 µg/ml gentamicin. Passage cells and seed onto cover glassesDay 0: Place a single cover glass into each well of a sterile 24-well polystyrene tissue culture plate with the use of sterile forceps.Notes:1) Pre-coating coverslips with poly-L-lysine and poly-L-ornithine or other cell-surface treatments may be necessary to adhere other cell types to glass. Hela Kyoto cells adhere to glass without additional coating. 2) For high throughput screens, cells can be seeded into 96-well plates or other formats.",
    "3) Keep in mind that you will need three different time points and this in duplicate or triplicate per condition. Seed at a density that will result in 70% confluency at the day you plan to perform the nucleocytoplasmic transport assay.Incubate cells overnight in a tissue culture incubator (37 °C with 5% CO2).Transduction of cells to express C9orf72-related peptidesDay 1: Dilute polybrene in medium at a final concentration of 10 µg/ml. Add lentiviral particles to each well. Leave the viral particles overnight on the cells (about 18 h).Day 2: Remove the lentivirus-containing medium and replace with fresh DMEM medium.Incubate cell for an additional two days in a tissue culture incubator (37 °C with 5% CO2).Note: Addition of polybrene can significantly improve transduction efficiency. However, first confirm that polybrene is not toxic to your cells as it can induce cell death in certain cell types (e.g., iPSC-derived neurons). Measure nucleocytoplasmic transportDay 5: Prepare a desired volume of pre-warmed medium containing 45 nM LMB.Treat the cells intended for the 30 min time point with the medium containing LMB.Return cells to the incubator for 15 min.Treat the cells intended for the 15 min time point with the medium containing LMB.Return cells to the incubator for 15 min.Fix cells by adding 4% PFA (final concentration) to the medium for 15 min.Stain nuclei using NucBlue Live Cell Stain reagent (Invitrogen).Use a 20 µl pipette to place a drop of mounting medium on a slide, before placing the cover glass upside down on the slide using forceps. Remove excess mounting medium with a paper towel and seal the slides using nail polish.Image cells using a confocal microscope (Figure 10).Notes: 1) Keep in mind to maintain the same setting between different conditions and to focus on the middle of the nuclei (nucleoli are clearly visible).",
    "2) For high-throughput screens, intensity can be automatically analyzed by using a high content analyzer (e.g., CellInsight CX5 high content screening platform from Thermo Fisher Scientific).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617205010_0493.jpgFigure 10. Measuring KPNB1/KPNAx-mediated import over time in a neurodegenerative-associated context. Representative images of cells expressing the reporter NLSSV40-mNeongreen2x-NESpki. The reporter localizes steady state in the cytoplasm of the cells, as a consequence of XPO1-mediated nuclear export. Addition of an XPO1-inhibitor (leptomycin B; LMB) allows to measure KPNB1/KPNAx-mediated import over time. A. Reporter cells were transduced with a mCherry-lentiviral vector as control. B. Reporter cells transduced with a poly-PR100-mCherry-lentiviral vector. Poly-PR dipeptides have been linked to the neurodegenerative disease amyotrophic lateral sclerosis. Scale bar = 20 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}