{
  "id": 3435,
  "origin_website": "Cell",
  "title": "A protocol for whole-brain Ca2+ imaging in Astyanax mexicanus, a model of comparative evolution",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMicroscope and sample preparation\nTiming: 15 min\nThis section describes the steps necessary to prepare the equipment and samples prior to live imaging of A. mexicanus.\nBring LMP agarose to ∼45°C in a dry bath/heating block.\nPrepare the microscope\nPower on the laser\nActivate the laser lines.\nStart the confocal image acquisition software\nConfigure appropriate laser settings for the imaging conditions.\nNote: For imaging tectal light response in larva expressing GCaMP6s, the following equipment and settings were used: Nikon AXR confocal microscope, 25× water immersion objective, 1.5× digital zoom, Galvano scanner, resolution 512 × 512 pixels, for an effective frame rate of 2 Hz.\nPrepare larvae for immobilization in agarose by sedation or paralysis.\nNote: Sedation in cold water is considered less aversive than paralysis, and is usually sufficient to maintain immobility for short periods. For longer experiments (>15 min), or when total immobility is required, paralysis is preferred, as cavefish are especially prone to attempt movement even when immobilized in agarose. In both cases, experiments should be performed immediately following immobilization, to minimize stress on the larvae. Additionally, while sedation on ice is reversible, paralysis in mivacurium chloride is a terminal treatment and requires euthanasia following experiment completion. Although mivacurium is considered a reversible neuromuscular junction blocker, at the concentrations used, larvae are not expected to recover from paralysis. In our hands, larvae remained healthy for up to 1 h after paralysis; longer imaging times were not attempted.\nPreparation for imaging paralyzed larvae.\nDefrost mivacurium to room temperature prior to isolating experimental animals.\nTransfer a single larva to a petri dish or similar container.\nNote: Remove as much water as possible to limit the dilution of the paralytic to less than 10%. Then add ∼100 μL of 0.5 mg/mL mivacurium chloride.",
    "Maintain larva in mivacurium chloride for 1 min.\nRemove larva from mivacurium chloride and place them in a Petri dish containing system water. A.\nAllow 2–3 min after removal from paralytic for larvae to cease movement.\nImmediately transfer larva to a mounting plate with a disposable 3 mL pipette and begin mounting procedures.\nSedation of un-paralyzed larvae:\nFill an insulated bucket with ice and position a 250 mL bowl in the center, submerging the sides of the bowl in ice.\nAdd chilled system water (maintained at 4°C) to the bowl, and wait ∼5 min for additional chilling.\nTransfer a single larva to water bowl immediately prior to the initiation of mounting. Sedation should take effect within 1–2 min.\nTransfer the larva to the imaging dish and begin mounting procedures after larva has ceased movement for at least 30 s. Prolonged chilling can lead to death; larvae should be sedated immediately prior to mounting and removed as soon as sedation is achieved.\nInitiation of mounting procedure.\nTransfer sample to the imaging dish using a disposable 3 mL pipette.\nRemove as much liquid as possible using a P200 Pipette.\nUsing the P200 pipette, immediately embed larva in a small drop (∼50–200 μL) 2% LMP agarose that is warmed to 45°C.\nNote: The volume of agarose added should be adjusted to the mounting and imaging conditions. Larger volumes enable easier manipulation of the larva into position, but care must be taken to ensure the larva brain is near the surface of the agarose, especially when using objectives with a short working distance.\nMount larvae dorsal side up for upright microscopes and dorsal side down against the cover slip for an inverted scope (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3012-Fig2.jpg\nFigure 2. Functional imaging of light response in the tectum",
    "(A) The visual imaging system. Inset: a larva mounted in agarose, with white light LED system arranged in the field-of-view of the larva.\n(B) Results of post-processing of visual imaging; a surface fish optic tectum, with individual neurons programmatically segmented (left); representative fluorescence traces of neurons during visual stimulation, with significant Ca2+ transients highlighted in red (right).\nGently orient the sample using two pairs of forceps. Maintain this position with the forceps until the agarose begins to solidify. This step should take 10–30 s.\nAlternatively, use a single pair of forceps, or a gentle instrument such as a thread from a toothbrush, to nudge the larvae into position until the agarose starts to solidify, then remove forceps tip.\nOnce fully solidified (appearing slightly opaque after approximately 30 s), add a small amount (<1 mL) of system water on top of sample, affix LEDs to imaging chamber using a temporary adhesive (e.g., tape) and place under microscope.\nCritical: The mounting instrument should be removed after the larva is stable, but before the agarose has fully solidified. Removing the instrument too late will lead to a gap in the agarose, which can contribute to unwanted movement of the larva.\nPlace sample on microscope.\nFor in vivo GCaMP imaging, be sure to prepare the confocal microscope (e.g., Nikon AX R) prior to mounting to minimize the time between immobilization and data acquisition.\nNote: The protocol described can be used for confocal or two-photon microscope.\nNavigate to your region of interest (e.g., the optic tectum) and collect time-lapse, and, optionally, volumetric images.",
    "Note: The scanning speed, resolution, zoom and laser power should be optimized for the brain region under investigation and microscope used for acquisition. Most confocal microscopes are equipped with Galvano scanners, which are typically capable of imaging at a rate of 2–4 Hz. Resonant scanners are capable of imaging at frame rates of up to 30 Hz or higher, although averaging may need to be used to achieve single-cell resolution. In general, for measuring Ca2+ using GCaMP6s imaging at speeds of 2–4 Hz is sufficient.\nImaging response to visual stimuli\nTiming: 10–60 min\nThis section describes the process of imaging neural activity in A. mexicanus in response to visual stimulation.\nBegin imaging, recording at a rate of ≥2 Hz.\nImage for 60 s to establish baseline fluorescence of neurons.\nNote: The excitation laser will cause some inherent visual stimulation. Laser power should be kept as low as possible while maintaining sufficient signal-to-noise ratio to visually resolve individual neurons. In our hands, a period of 30 s was sufficient in all cases for neuronal fluorescence to return to a stable baseline.\nTo identify functional cell types, immediately apply a whole-field light stimulus for a period of 30 s.\nNote: Although structured stimuli may be presented with the use of a projector, a single LED light strip, placed directly in the field of view of the larva, will be sufficient to identify an array of functional neuronal responses (Figure 2[href=https://www.wicell.org#fig2]B).\nRepeat the stimulus up to ten times to establish response probability of neurons, with each stimulus separated by at least 30 s of image acquisition with no stimulation (Figure 2[href=https://www.wicell.org#fig2]B).",
    "Critical: To ensure accurate identification of cell responses, the stimulus must be precisely timed, and the time points and duration of the stimulus logged accurately. This may be achieved either through manual logging, or through the use of hardware synchronization.15[href=https://www.wicell.org#bib15]\nImaging response to olfactory stimuli\nTiming: 10–60 min\nThis section describes the process of imaging neural activity in A. mexicanus in response to olfactory stimulation.\nFor olfactory imaging, mounting should be performed as described above, but the larva should be mounted in a perfusion chamber (e.g., Science Products, OAC-1), which allows for the inflow and outflow of liquid in a controlled manner (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3012-Fig3.jpg\nFigure 3. Functional imaging of olfactory response in the olfactory bulb\n(A) The olfactory imaging system. Inset: a close-up view of the larvae, mounted in agarose, with odor inflow on the left, and outflow chamber on the right.\n(B) Results of post-processing of olfactory imaging; a cavefish olfactory bulb with individual neurons programmatically segmented (left); representative fluorescence traces of neurons during olfactory stimulation, with significant Ca2+ transients highlighted in red (right).\nNote: The larvae may be fully embedded in agarose without the need to clear the head area, because agarose is a gel matrix which permits water flow along with any dissolved molecules.\nBegin perfusion of system water over the larva, and then begin imaging, at a rate of ≥2 Hz (Figure 3[href=https://www.wicell.org#fig3]B).",
    "Note: Flow rate of the water will vary based on multiple factors including inner diameter and orientation of the perfusion hose, height of the system relative to the perfusion chamber, etc. These conditions should be standardized across all imaging sessions. The flow rate may affect the duration of stimulus required to elicit a response, as well as effective washout periods. The timing of these experiments was designed with a flow rate of approximately 10 mL per minute.\nImage for 60 s to establish baseline fluorescence of neurons.\nPerfuse the L-Serine over the larvae for 60 s.\nNote: A short delay in response is to be expected, the timing of which will be dependent on the flow rate and chamber size, both of which should be standardized to allow comparison across trials.\nRepeat the stimulus three or more times to establish probability of response (Figure 3[href=https://www.wicell.org#fig3]B). Alternatively, apply a range of concentrations (e.g., 10 μM, 100 μM, 1 mM), or a series of different odorants, interspersed with a 60 s washout period of system water.\nPost-experiment procedures\nTiming: 10–45 min\nThis section describes how to handle larvae following imaging procedures.\nParalyzed larvae should be euthanized immediately following your experiment, according to your institution’s approved guidelines (e.g., immersion in ice-cold water, followed by secondary euthanasia).\nNote: Paralyzed larvae are stable for up to one hour post-paralysis, but are not expected to recover from paralysis at the concentrations used.\nSedated larvae may be carefully removed from the agarose using forceps and transferred to system water for recovery.\nNote: Time under sedation post-chilling may vary; in general, larvae can be expected to begin normal swimming behavior approximately 30–45 min post-sedation.\nImage analysis\nTiming: 30–60 min\nThis section describes how to analyze functional imaging data.",
    "Motion Correction: Prior to extraction of fluorescence time courses of individual neurons, unwanted subject motion in the X and Y planes may be eliminated through the use of ImageJ/FIJI (https://imagej.net/software/fiji/[href=https://imagej.net/software/fiji/]) and the “moco” plugin (https://github.com/NTCColumbia/moco[href=https://github.com/NTCColumbia/moco]).\nSeveral freely available programs exist for post-processing and analysis of fluorescence time courses such as those acquired with genetically encoded calcium indicators (GECIs). Post-processing analyses may include number of cells, spike rate, peak ΔF/F, correlation of activity, etc.\nThe MATLAB toolbox published by Romano and colleagues (https://github.com/zebrain-lab/Toolbox-Romano-et-al[href=https://github.com/zebrain-lab/Toolbox-Romano-et-al]) provides a pipeline and a step-by-step explanation for automated motion correction, segmentation of individual neurons, extraction of fluorescence time courses, spike estimation, and other post-processing analyses.16[href=https://www.wicell.org#bib16]\nCaImAn (https://github.com/flatironinstitute/CaImAn[href=https://github.com/flatironinstitute/CaImAn]) represents an alternative method that provides many of the same functions, within the python environment.17[href=https://www.wicell.org#bib17]"
  ],
  "subjectAreas": [
    "Evolutionary Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}