{
  "id": 19060,
  "origin_website": "Jove",
  "title": "Repair of a Critical-sized Calvarial Defect Model Using Adipose-derived Stromal Cells Harvested from Lipoaspirate",
  "procedures": [
    "1. Cell Isolation & Expansion\nAll patient consent and experimental protocols were reviewed and approved by Stanford University Institutional Review Board (Protocol #2188 and #9999).\nObtain human subcutaneous adipose tissue from elective lipoaspiration procedures under local/general anesthesia.\nThere will be two layers in the lipoaspirate (Figure 1A). The supernatant contains the vast majority of the processed cellular material. The bottom layer is mostly injected saline. Adipose-derived stromal cells can be harvested from either layer, but the yield is much greater from the supernatant.\nTo isolate the stromal vascular fraction (SVF), wash the lipoaspirate extensively with equal volumes of 1X phosphate-buffered saline (PBS) containing 2.5% betadine (x2), followed by equal volume of 1X PBS (x1) without betadine. Allow the wash to precipitate.\nBe careful to maintain sterile technique throughout the process as contamination with processed human tissue can happen.\nAspirate the bottom layer and discard after each wash.\nAliquot 15 ml of adipose tissue into 50 ml BD Falcon conical tubes.\nDigest the adipose tissue with an equal volume (15 ml) of filtered 0.075% Type II collagenase in Hank's Balanced Salt Solution (HBSS) at 37 °C in a water bath for 60 min under constant agitation (approx. 180 shakes/min) - ventilate each tube every 15 min.\nNeutralize enzyme activity with 15 ml PBS containing 10% (Fetal Bovine Serum) FBS, and centrifuge at 1,000 rpm for 5 min at 4 °C to obtain a high-density SVF pellet. The pellet will be a mix of adipose-derived stromal cells and erythrocytes.\nDiscard the supernatant without disrupting the pellet.\nResuspend the pellet in 10 ml of traditional growth media (Dulbecco's Modified Eagle Medium [DMEM]/10% FBS/1% penicillin-streptomycin solution).\nFilter suspension through a 100 μm nylon cell strainer to remove cellular debris.",
    "Combine 3 tubes into one clean 50 ml conical. Centrifuge at 1,000 rpm for 5 min at 4 °C.\nDiscard the supernatant without disrupting the pellet.\nResuspend the pellet in 5 ml of traditional growth media\nCombine two 50 ml conicals per one 10 cm plate or five 50 ml conicals for one 15 cm plate.\nEstablish primary cultures overnight at 37 °C/21% O2, 5% CO2 .\nFollowing overnight incubation, wash the plates extensively with PBS to remove residual non-adherent red blood cells. The resulting cell populations are adipose-derived stromal cells.\nMaintain the cells at sub-confluent levels to prevent spontaneous differentiation at 37 °C/21% O2, 5% CO2 in growth media. The cells generally need to be split every three to four days in regular growth media when plated at 50% confluence.\n2. Scaffold Preparation\nScaffolds were made by Dr. Min Lee at University of California, Los Angeles - School of Dentistry.\nPLGA scaffolds were fabricated from 85/15 poly(lactic-co-glycolic acid) (inherent viscosity = 0.61 dl/g, Birmingham Polymers) by solvent casting and a particulate leaching process.\nPLGA/chloroform solutions were mixed with 200-300 μm diameter sucrose to obtain 92% porosity (volume fraction), and compressed into thin sheets in a Teflon mold.\nAfter freeze-drying overnight, scaffolds were immersed in three changes of double-distilled (dd) H2O to dissolve the sucrose, and gently removed from the Teflon plate with a fine-tip spatula.\nAfter particulate leaching, all scaffolds were disinfected by immersion in 50%, 60% and 70% ethanol for 30 min each, followed by three rinses of ddH2O.\nAll scaffolds were dried under a laminar flow hood.\nAfter scaffold fabrication, scaffolds were coated with apatite.",
    "SBF (simulated body fluid) solution was prepared with ion concentrations that were 5 times that of human blood plasma. All solutions were sterile filtered through a 0.22 μm PES membrane (Nalgene). Immediately before the coating process, dried PLGA scaffolds were subjected to glow discharge, argon-plasma etching (Harrick Scientific) to improve wetting and coating uniformity.\nEtched PLGA scaffolds were then incubated in SBF at 37 °C inside a water-jacketed incubator for 12 hr, followed by Mg2+and HCO3--free SBF 2 for another 12 hr at 37 °C under gentle stirring.\nCoated PLGA scaffolds were rinsed gently with sterile ddH2O to wash away excess sodium chloride solution, dried in a laminar flow hood and disinfected with 70% ethanol.\nIntegrity of the apatite coating was analyzed with a scanning electron microscope (SEM). Apatite-coated scaffolds were mounted on SEM stubs (Ted Pella) and coated with carbon to improve conductivity. The secondary electron mode was applied during SEM (FEI/Phillips XL-30) observation. Energy dispersion X-ray spectrum was obtained to confirm elemental composition of the apatite structures.\n3. Cell Seeding\nUpon reaching sub-confluence levels, wash the cells with PBS (x2) and trypsinize.\nCount the cells to quantify for seeding\nSeed onto pre-cut 4.0 mm diameter scaffolds with 1.5 x 105 cells.\n \nPlace individual scaffold into a well of a 96-well plate\nRe-suspend cells in regular growth media with a concentration of roughly 1.5 x 105 cells per 20 μl of media\nPipet 20 μl directly onto the scaffold and place into cell culture incubator for 30 min.\nAfter 30 min, add 200 μl of media and allow cells to incubate on the scaffold overnight prior to surgery",
    "It is not necessary to ensure adhesion of the cells onto the scaffold as seeding a sufficient number of cells will ensure that a majority will attach onto the scaffold. This has been validated in our lab in vivo with bioluminescence and histological analysis.\n4. Creation of Calvarial Defects and In Vivo Implantation\nAnesthetize adult (60 day-old) CD-1 nude mice with anesthetic cocktail. (ketamine/xylazine/acepromazine) at 50% concentration (1:1 dilution with 0.9% NaCl) or per recommended anesthetic regimen per institution protocols. These mice are athymic so the hASCs will not cause an immune reaction.\n \nDosage: Ketamine hydrochloride (80 mg/kg), Xylazine (2.5 mg/kg) Acepromazine (2.5 mg/kg)\nDuration of effect: approximately 30 min\nSurgically drape the animal and sterilize the surgical site with betadine and alcohol (x3) and cover the mouse eyes with ointment prior to making a midline sagittal incision in the scalp of the animal to expose the right parietal bone. Remove the pericranium from the right parietal bone with blunt scraping (Figure 1B).\nCreate a unilateral 4-mm full-thickness defect in the right non-suture associated parietal bone using a sterile diamond-coated trephine drill bit.  Extreme caution must be taken not to disturb the underlying dura mater (Figure 1B) as the mouse calvarial thickness is <.3 mm.\nBefore implantation, rinse scaffolds with sterile PBS to prevent transfer of medium-derived growth factors.\nPlace the scaffold into the defect.\nFinally, suture the skin closed and monitor the animal per established postoperative protocols.\nUse established analgesia as directed by your animal care protocols as needed post-operatively- e.g. buprenorphine 0.1 mg/kg.\n5. Quantification of Osteoid Formation\nAfter MicroCT was performed on the mouse, the three-dimensional image was reconstructed using MicroView software as previously described1.\nUsing Adobe Photoshop, the images were sized to a standard height.",
    "Using the Magic Wand feature, pixels were measured of the calvarial defect.\nPercentage healing of the defect was determined by subsequent CT scans measuring the calvarial defect area and determining pixel number and dividing it by the original defect's pixel number\nConsequently, if the MicroCT is unavailable, an alternative is using Adobe Photoshop and harvesting the calvaria at determined time points for histology.\nUsing histological stains like Aniline Blue and Pentachrome that denote osteoid formation, multiple sections along the span of the defect should be stained\nUsing Adobe Photoshop, crop out all the areas that are not in the calvarial defect\nUse the magic wand feature and determine pixel numbers of de novo bone formation in the area of the defect and compare to controls or other variables.\n6. Representative Results\nAdipose tissue has the potential to serve a vital role in the generation of progenitor cells for clinical application. Adipose tissue has a unique advantage in that there is a readily available supply that can be harvested in a relatively simple procedure that involves minimal morbidity and mortality. Once the tissue is harvested and collected, our protocol is outlined in Figure 2. Adipose-derived stromal cells are isolated through a series of washing steps, collagenase digestion, and centrifugation. Once the cells are plated in culture, they can be expanded, placed into various differentiation protocols in vitro, or placed directly in vivo.",
    "The creation of the 4 mm critical-size calvarial defect provides a easily accessible and reproducible in vivo model to test the osteogenic differentiation ability of our adipose-derived stromal cells. Through the use of MicroCT, we are able to follow the formation of skeletal tissue in vivo and track the progress of our interventions (Figure 3). The critical-size calvarial defect will not heal within the lifetime of the animal and we see roughly 90% of the defect remain patent around 8 weeks. The scaffold itself (see discussion) has osteogenic inductive properties and has shown the ability to induce some bony regeneration. The typical results of scaffold placement without cells shows that around a one-third of the defect will have de novo bone formation at 8 weeks. With the augmentation of adipose-derived stromal cells, fully two-thirds or more of the defect will show osseous regeneration at around 8 weeks although there is variability between each animal and surgery. The formation of skeletal tissue can be quantified through histology and typical results show increased osteoid formation in samples with ASCs through Aniline Blue and Pentachrome staining (Figure 3C). In addition, we show that the implanted human cells contribute to the underlying de novo osseous formation through the use of GFP-labeled hASCs that show staining in vivo  at 2 weeks near the area of de novo  bone formation in the calvarial defect (Figure 3D). In addition, we use immunohistochemistry with human specific antibody to show human cell survival and contribution in the area of the defect (Figure 3E).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4221/4221fig1.jpg",
    "Figure 1. A - The lipoaspirate has two layers. The top layer contains the adipocytes and the majority of the processes cellular material while the bottom layer contains the saline used during the lipoaspiration procedure. B - the creation of the calvarial defect through a midline incision over the pericranium to isolate the right parietal bone, subsequent creation of a 4 mm critical sized calvarial defect without disruption of the underlying dura mater.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4221/4221fig2.jpg\n Figure 2.  Overview of the harvesting and application of lipoaspirate from the isolation of adipose-derived stromal cells to their expansion, differentiation and use in vitro  and in vivo.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4221/4221fig3.jpg\n Figure 3.  A -MicroCT showing in vivo  healing of the critical size calvarial defect with the application of ASCs through a hydroxyapatitie scaffold (Bottom Row). Controls include no scaffold and defect (Top row) and defect with placement of the scaffold without cells (Middle Row) B - Quantification of osseous healing from the MicroCT showing significantly increased healing in the ASC group. C - Histology showing increased osteoid formation of the ASC group (bottom row) through Aniline Blue and Pentachrome staining. For Aniline Blue, the osteoid stains dark blue and for Pentachrome, the osteoid stains yellow. D - hASCS labeled with GFP were seeded onto a scaffold and placed into a calvarial defect and sacrificed at 2 weeks. Staining was done with a GFP labeled antibody to show the human cells contributing to regeneration in the area of the defect. E - Human nuclear antigen immunohistochemistry showing prevalence of human cells in the area of the defect at 2 weeks.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4221/4221fig3large.jpg].Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}