{
  "id": 4823,
  "origin_website": "Bio",
  "title": "5’ Rapid Amplification of cDNA Ends (5’ RACE) of Agrobacterial T-DNA Genes within Transformed Plant Sample",
  "procedures": [
    "Crown gall tumor induction   Overnight culture of A. tumefaciens was obtained from colonies grown on KB agar plates. Colonies were transferred into 3-5 ml KB liquid medium in 13 ml culture tubes with assembled two-position ventilation cap (with position 1: Cap lightly pushed on, ventilated) and incubated at 140 rpm in a rotary shaker at 28 °C for overnight.   Overnight A. tumefaciens cells were centrifuged at 8,000 rpm for 1 min and suspended in 3 ml agromix buffer. Suspended cells were cultured at 28 °C, 140 rpm again for 2-3 h. OD600 was measured by spectrophotometer and adjusted to OD600 = 0.5.    Young inflorescence stems (3 to 10 cm) of Arabidopsis were injected near the bottom with a 5 ml syringe two times at one direction and two times at another perpendicular direction (Figure 1). The syringe needle was injected completely through the stems. One drop of A. tumefaciens cells was used for one injection.     imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150916/20150916044125_6595.jpg Figure 1. Schematic image of Arabidopsis influrecence stem. Young inflorescence stems were injected with a syringe in the injection zone (marked). The original Arabidopsis image is from website (http://www.lookfordiagnosis.com/mesh_info.php?term=Arabidopsis&lang=1[href=http://www.lookfordiagnosis.com/mesh_info.php?term=Arabidopsis&lang=1]).    The stems were injected eight times in total, so usually eight blocks of tumors were generated at 25 days after inoculation (Figure 2). The tumors were cut from the stems with a scalpel and tweezer under a dissecting microscope Leica MZ6 and weighed in the balance.    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150916/20150916044225_0488.jpg Figure 2. Arabidopsis crown gall tumors. The crown gall tumors were generated from the Arabidpsis stems at 25 days after inoculation. The tumors (marked by red circle) were cut with a scalpel and tweezer and weighed.    Poly-A-mRNA extraction Approximately 50 mg crown gall tumor was used for mRNA extraction. Poly-A-mRNA was isolated by the oligonucleotide Poly-dTTP (25) bound to polystyrene beads. Dynabeads Oligo-[dT] 25 kit was used.",
    "The plant tissue was frozen in liquid nitrogen and homogenized in a ball mill, and then 1 ml Lysis Buffer was added and the samples were further homogenized for 1-2 min at room temperature until the tissue was completely lysed. The lysate was centrifuged for 30 sec at 10,000 rpm.    The manufacturer’s protocol of Dynabeads Oligo-[dT] 25 kit was performed. The supernatant was incubated for 30 min with 20 µl Dynabeads at room temperature in an overhead rotor. The tubes were place on the MagneSphere® Technology Magnetic Separation Stands for 2 min and removed the supernatant. The manufacturer’s protocol for the magnetic stand was performed.   The first washing step: The Dynabeads were washed twice with 200 µl Washing Buffer A, and twice with 200 µl Washing Buffer B. The magnet was used to separate beads and supernatant for each washing. The Dynabeads were washed by gently ﬂicking the bottom of the tube until all beads were resuspended, and then the beads were captured by magnetic stand. The supernatant was removed without disturbing the beads.   In order to exclude DNA contaminations, the mRNA was eluted from the beads by 50 µl Elution Buffer and incubation at 75 °C for 2 min.    The second washing step: 50 µl 2x Binding Buffer was added to the eluted mRNA, and the 100 µl of mixture was again incubated 20 min at room temperature in an overhead shaker.     After two washing steps with 200 µl Washing Buffer B, the mRNA was eluted from the magnetic beads with 22 µl Elution Buffer at 75 °C for 2 min. The concentration of mRNA was quantified by NanoDrop 2000c UV-Vis Spectrophotometer. The mRNA was directly used for first-strand cDNA synthesis for 5’ RACE assay or stored at -80 °C.",
    "5’- rapid amplification of cDNA ends (5’ RACE) assay 5’ ends of the oncogenes cDNA were amplified by SMARTer™ RACE cDNA Amplification Kit. First-Strand cDNA was generated by SMARTScribe™ Reverse Transcriptase and primed using SMARTer II A Oligonucleotide and 5'-CDS Primer A.    The following reagents were added in one tube 2.75 µl        mRNA 1.0 µl 5'-CDS Primer A The reagents were mixed well by pipet and incubated the tubes at 72 °C for 3 min, and then 42 °C for 2 min.    The following reagents were to the mixture from step a for a total volume of 10 µl 1.0 µl         SMARTer II A Oligonucleotide 2.0 µl         5x First-Strand Buffer 1.0 µl        DTT (20 mM) 1.0 µl         dNTP Mix (10 mM) 0.25 µl       RNase Inhibitor (40 U/μl) 1.0 µl         SMARTScribe™ Reverse Transcriptase (100 U) The reagents were mixed well by pipet and incubated the tubes at 42 °C for 90 min.   The reaction mixture was heated at 70 °C for 10 min to terminate the reaction and the first-strand reaction product was diluted with 10 folds ddH2O. Samples were stored at -20 °C or used for next step directly.     Amplification and sequencing of 5’ ends of the oncogenes cDNA   The fragments of 5’ ends of the oncogenes cDNA were amplified by DreamTaq DNA Polymerase and primed using Universal Primer A Mix (UPM) and specific target primer (Table 1) as shown in the following reaction mixture. PCR reaction (a total volume of 50 µl): cDNA from step 3.3.1                                1 µl 5x Buffer                                                     10 µl 10x Universal Primer A Mix                       5 µl Specific target reverse primer (10 µM)       1 µl dNTP (10 mM)                                            1 µl DreamTaq DNA Polymerase                    0.",
    "5 µl ddH2O      to a final volume of                       50 µl PCR program: Step 1: 95 °C                    1 min Step 2: 95 °C                   30 sec Step 3: 55 °C                   30 sec Step 4: 72 °C                   15 sec  Step 5: repeat step 2-4 for 30 cycles Step 6: 72 °C                    5 min Step 7: 4 °C                      Store    Table 1. Specific oncogene reverse primer table:",
    "﻿0,1\nGene name (Accession No.),Primer sequence (5’ → 3’)\n\"IaaH (pTiC58, AE007871)\",CCCCGATTGCTAACAGACG\n\"IaaM (pTiC58, AE007871)\",CAAGAGTGTTCGAGAGG\n\"Ipt (pTiC58, AE007871)\",TCCCATGAATCAACTTAT\n    The PCR products were purified by QIAquick PCR Purification Kit.   The purified PCR products were inserted into pGEM-T Easy Vector by TA cloning. 2x Rapid Ligation Buffer                        5 µl  pGEM-T Easy Vector (50 ng/ µl)           0.5 µl  PCR product                                      3.5 µl T4 DNA Ligase                                     1 µl  The reagents were mixed by pipet and incubated for 1 h at room temperature.   The resulting recombinant vectors from step 4c were transformed into E. coli strain MRF’ using the heat shock method.    More than three independent colonies were sequenced for 5’ end of the PCR products, which were the transcription start sites of oncogene."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}