{
  "id": 7308,
  "origin_website": "Bio",
  "title": "Purification of Recombinant Wild Type and Mutant Ryanodine Receptors Expressed in HEK293 Cells",
  "procedures": [
    "Purification of the vesicle fractionCulture HEK293 cells, expressing the RyR construct with an inducible doxycycline promoter, on 150 × 20 mm dishes (~30-40 plates) in Dulbecco’s Modified Eagle’s Medium supplemented with fetal bovine serum (FBS, 2%), bovine growth serum (BGS, 7%), and penicillin-streptomycin. Fast and robust growth of HEK293 cells requires FBS containing growth hormones; a more cost-effective combination of FBS-BGS can be used. At 80-90% confluence, add doxycycline (2 µg/ml) and incubate for 3 days.Harvest cells in PBS (~3 ml/plate) with the aid of a cell scraper, and create a single-cell suspension by pipetting up and down with a 5-ml serological pipette. Depending on the volume generated, collect cells in one or two 15-ml centrifuge tubes.Centrifuge at 573 × g (Beckman Coulter Avanti J-E centrifuge, rotor F10BCI-6 × 500) for 10 min.Discard the supernatant. Resuspend the pellet in Homogenization Buffer and homogenize using an ultrasonic probe (98% amplitude, around 3 pulses of 20 s in a Qsonica Q125 sonicator).Centrifuge the homogenized pellet at 4,400 × g (Beckman Coulter Avanti J-E centrifuge, rotor F10BCI-6 × 500) for 10 min.Transfer the supernatant to 3.5-ml centrifuge tubes.Centrifuge at 100,000 × g (Beckman Coulter Optima MAX-TL ultracentrifuge, rotor TLA 100.3) for 60 min.Discard the supernatant. Resuspend the resulting pellet in Homogenization Buffer using a Dounce homogenizer.Determine the concentration of protein in the purified vesicles (i.e., typically ~40-60 mg/ml) by performing a Bradford assay on two 10-µl fractions and computing the average.Freeze using liquid nitrogen and store at −80°C for subsequent protein purification.Purification of recombinant RyR from vesicles using sucrose gradient centrifugation and ion-exchange chromatographyIf starting from frozen purified vesicles (see Section A: Purification of vesicle fraction), thaw ~100 mg vesicles in a 37°C bath.Add 9 ml Solubilization Buffer I without CHAPS to a 25-ml beaker.",
    "Add the thawed vesicles to the beaker containing Solubilization Buffer I (without CHAPS).Stir the solution at 300 rpm using a magnetic stirrer.Carefully add 5 ml 5% CHAPS to the solubilization mixture while continuing to stir.Cover the beaker with parafilm and continue stirring at 300 rpm for 25 min.Centrifuge the solubilized protein at 100,000 × g (Beckman Coulter Optima MAX-TL Ultracentrifuge, rotor TLA 100.3) for 60 min.Discard the pellet. The supernatant is ready for further RyR purification.Prepare the following solutions: 10%, 12%, 14%, 16%, 18%, and 20% (w/v) sucrose in Solubilization Buffer I containing 0.5% (w/v) CHAPS-0.125% PC instead of 5% CHAPS-1.25% PC.Pour 5 ml 20% sucrose into an Ultraclear Beckman centrifuge tube (25 × 89 mm).Carefully add 6 ml 18%, 6 ml 16%, 6 ml 14%, 6 ml 12%, and 5 ml 10% sucrose solutions using a peristaltic pump, making sure that the liquid layers do not mix (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4112/bioprotoc-11-15-4112-g001.jpgFigure 1. Schematic showing a discontinuous sucrose gradient with layers of sucrose of decreasing concentrations. The solubilized RyR sample is added on top of the 10% sucrose solution. Ultracentrifugation results in separation based on density, with RyR sedimenting near the bottom of the tube. The sucrose gradient is dismounted in 2-ml fractions starting from the bottom (denser) sucrose layer.Layer the solubilized RyR sample (up to 3.5 ml) on top of the 10% sucrose solution using the peristaltic pump (Figure 1).Lift the tubes slowly and place them gently in a swing bucket rotor. Centrifuge at 120,000 × g (Beckman Coulter Optima LE-80K Ultracentrifuge, rotor SW32 Ti) for 23 h under no braking and low acceleration conditions.Unmount the gradient (2.0-ml fractions) starting from the bottom using the peristaltic pump (Figure 1).",
    "Analyze each fraction on a 10% SDS-PAGE gel stained with Coomassie Brilliant Blue or western blotting with a generic anti-RyR antibody (34C) to identify fractions containing pure RyR (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4112/bioprotoc-11-15-4112-g002.jpgFigure 2. SDS-PAGE and western blot showing the sucrose gradient fractions and positive identification of the RyR. A. SDS-PAGE gel stained with Coomassie Brilliant Blue of the sucrose gradient fractions (Fra#9 represents a mixture of all the remaining fractions). Fractions 1-6, containing pure RyR, were pooled. The unusual high molecular weight of RyR (565 kDa per monomer) places its band well above the top molecular weight marker, a distinguishing trait that in most scenarios suffices for positive identification. B. Western blot of fractions #3 and #4 of a sucrose density gradient using an anti-RyR antibody (34C) to confirm the identity of RyR.Once identified, pool the fractions containing pure RyR.Add DTT at a final concentration of 1 mM to the pooled purified RyR sample (to compensate for DTT decay).Dilute the sample 5-fold with Dilution Buffer.Connect a 1-ml HiTrap Heparin HP column (Amersham Biosciences) to a peristaltic pump (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4112/bioprotoc-11-15-4112-g003.jpgFigure 3. Image showing the assembly of the sample, the peristaltic pump, the 1-ml HiTrap Heparin HP (or 1-ml StrepTrap) column, and the tubes to collect the fractions. Wash the column with 20 ml deionized water (Milli-Q) (1 ml/min).Equilibrate the column with 20 ml Wash Buffer I (1 ml/min).Load the RyR sample on the column (0.5 ml/min).Wash the column with 20 ml Wash Buffer I (1 ml/min).Wash the column with 10 ml Wash Buffer II (1 ml/min).Elute the sample with 10 ml Elution Buffer I (0.5 ml/min).Manually collect eluted fractions in aliquots of 4 drops (~100 μl) in plastic 1.5-ml centrifuge tubes (Figure 3).",
    "Determine the protein concentration of each fraction in a NanoDrop 2000 spectrophotometer using absorbance at 280 nm (extinction coefficient 2,271,320 M−1cm−1 for RyR).Assess the purity and quality of the purified RyR by 10% SDS-PAGE (Figure 4) and negative staining EM (Figure 5).Flash-freeze aliquots in liquid nitrogen and store at −80°C for subsequent cryo-EM grid preparation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4112/bioprotoc-11-15-4112-g004.jpgFigure 4. SDS-PAGE gel stained with Coomassie Brilliant Blue showing RyRs eluted from a StrepTrap affinity column (RyR2 WT) and from a Heparin-agarose affinity column (RyR2 R176Q and RyR1 R164C). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4112/bioprotoc-11-15-4112-g005.jpgFigure 5. Micrograph of negatively stained RyRs purified from HEK293 cells (representative RyRs encircled in green). Negative staining was performed to check the quality of the purified proteins using established protocols (Ohi et al., 2004). Copper grids coated with a thin layer of carbon (CF300-Cu 300 mesh, Electron Microscopy Sciences) were first glow-discharged at 25 mA for 20 s. Purified RyRs (3.5 µl) were adsorbed onto the grid for 40 s, washed with deionized water, and stained with 0.75% uranyl formate; the excess stain was blotted off. Images were collected on an FEI Tecnai F20 TEM equipped with a GATAN Ultra Scan 4000 UHS (4k × 4k) camera at a magnification of 50,000×. Finer structural details of the RyR can be discerned in the enlarged images of individual RyRs corresponding to those highlighted in the micrograph.Purification of recombinant RyR from vesicles by one-step affinity chromatographyIf starting from frozen purified vesicles (see Section A: Purification of vesicle fraction), thaw ~20-30 mg vesicles using a 37°C bath.Add 1 ml Solubilization Buffer II without CHAPS to a 10-ml beaker.Add the thawed vesicles to the beaker containing Solubilization Buffer II (without CHAPS).Stir the solution at 300 rpm using a magnetic stirrer.Carefully add 0.5 ml 2% CHAPS to the solubilization mixture while continuing to stir.",
    "Cover the beaker with parafilm and stir at 300 rpm for 20 min.Centrifuge the solubilized protein at 100,000 × g (Beckman Coulter Optima MAX-TL Ultracentrifuge, rotor TLA 100.3) for 60 min.Discard the pellet. Dilute the supernatant 5-fold with Dilution Buffer.Centrifuge the solution at 16,000 × g (Eppendorf Centrifuge, Model 5415 C) for 10 min and discard the pellet.Filter the supernatant using a 0.45-μm filter attached to a syringe.Connect a 1-ml StrepTrap column (Cytiva) to a peristaltic pump (Figure 3).Wash the column with 20 ml deionized water (Milli-Q) (1 ml/min).Equilibrate the column with 20 ml Wash Buffer I (1 ml/min).Load the recombinant SBP-FKBP12.6 (1:10 RyR: FKBP12.6 molar ratio) on the column (0.5 ml/min).Wash the column with 20 ml Wash Buffer I (1 ml/min).Load the filtered solubilized RyR sample on the column (0.5 ml/min).Wash the column with 20 ml Wash Buffer I (1 ml/min).Wash the column with 2 ml Wash Buffer III (1 ml/min).Elute the sample with 5 ml Elution Buffer II containing 5 mM desthiobiotin (0.5 ml/min).Manually collect eluted fractions in aliquots of 4 drops (~100 μl) in plastic 1.5-ml centrifuge tubes (Figure 3).Determine the protein concentration of each fraction in a NanoDrop 2000 spectrophotometer using absorbance at 280 nm (extinction coefficient 2,271,320 M−1cm−1 for RyR).Assess the purity and quality of the purified RyR by 10% SDS-PAGE (Figure 4) and negative staining EM (Figure 5).Flash-freeze aliquots in liquid nitrogen and store at −80°C for subsequent cryo-EM grid preparation."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}