{
  "id": 17857,
  "origin_website": "Jove",
  "title": "Lung Fixation under Constant Pressure for Evaluation of Emphysema in Mice",
  "procedures": [
    "The following methods have been approved by the Animal Care and Use Committees of Juntendo University School of Medicine. The Guidelines for Proper Conduct of Animal Experiments, Science Council of Japan, June 1, 2006 were followed. There are three main steps in this method: 1) mouse dissection, 2) lung exsanguination, and 3) fixation of lung tissues assisted by specialized equipment. Typically, lung specimens are processed to embedment after 48 h of fixation12,15,16,17,18.\n1. Mouse dissection\nMeasure the body weight of the mouse, then determine the amount of pentobarbital to administer.\nInject pentobarbital intraperitoneally at a dosage of 70 mg/kg of body weight and confirm anesthesia by the absence of reaction to toe pinch.\nInject the needle at a 45° angle until it penetrates the skin and muscle. Draw the plunger and confirm an air vacuum, then inject the pentobarbital.\nConfirm anesthesia by the absence of reflex motion.\n\tNOTE: Using anesthetized mouse as opposed to a euthanized mouse is recommended for fully lung exsanguination.\nCut the mouse skin and abdominal muscle at the medial line, aiming for the cephalic area.\nCut laterally to provide a wider working space.\n2. Lung exsanguination\nExpose the diaphragm layer and puncture it with forceps.\nOpen the thoracic space and cut the sternal area, allowing the lungs and heart to be seen clearly.\nCut the heart in left atrium and right ventricle.\nInsert a cannula (24 G) into the right ventricle area and direct it to the cephalic area until it reaches the pulmonary artery, as shown in Figure 1.\nTurn on the pump and allow the 1x phosphate-buffered saline (PBS) to circulate (approximately 200 mL/h) until all lung tissue changes to a white color.\n3. Fixation of lung tissue\nRemove the trachea, lungs, and heart.\nFree all three organs by cutting the surrounding connective tissues.",
    "Tie the right main bronchus with a suture thread and cut all lobes of the right lung.\n(Optional): the lobes of the right lung consist of four parts. Cut these parts from the right main bronchus and divide the parts for processing as frozen tissue samples.\nInsert the heart and the lobes of the left lung into fixing agents, located inside a 10 mL syringe.\n\tCAUTION: Fixing agents are hazardous. Wear proper protective equipment (e.g., long rubber gloves) and work in a well-ventilated room.\nCreate a vacuum condition using a 10 mL syringe to inflate the lung, as shown in Figure 2.\nInsert a cannula (20 G) into the trachea and tie a knot.\nInflate the lung with fixing agents to check with for leaks, using a 1 mL syringe.\nTransfer to lung fixation pressure equipment, as illustrated in Figure 3.\nAfter fixing periods, remove the lung sample tying the trachea off with a knot.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}