{
  "id": 6911,
  "origin_website": "Bio",
  "title": " Metabolomic and Lipidomic Analysis of Bone Marrow Derived Macrophages",
  "procedures": [
    "Isolation of Bone Marrow Cells and Differentiation into Macrophages (Figure 1)See additional resource for helpful demonstration of bone marrow isolation (Ying et al., 2013).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200714/20200714233625_5734.jpgFigure 1. Timing of BMDM Differentiation Protocol. TC treated: tissue culture treated; BMDM: bone marrow derived macrophages.Euthanize mice by rapid cervical dislocation.Thoroughly spray mouse with 70% ethanol and bring into sterile hood.Using aseptic technique, isolate femur and tibia from each leg of mouse.Using a sharp scissors soaked in ethanol, sever bone proximal to each joint.Using a 27½ G needle attached to a 10 ml syringe, flush bones with cold, sterile BMDM Differentiation Media into a 10 cm dish, until bone cavity appears white. Use as much media is required to fully flush the bone.Pipette cell suspension thoroughly to fully resuspend bone marrow cells.For removal of any muscle or bone fragments, filter cells through 70 µm filter, into a sterile 50 ml conical centrifuge tube.Centrifuge cells for 3 min at 500 x g, 4 °C.Discard supernatant and resuspend cell pellet in 100 ml of BMDM Differentiation Media.Plate 10 ml of cell suspension onto each Petri-dish (non tissue culture treated plates are important here as macrophages will attach too strongly to treated plates)Place in cell culture incubator for 3 days.Four days post plating aspirate media from cells and replace with 10 ml fresh BMDM Differentiation Media. Repeat on day 5 and day 6.Seven days post plating aspirate media from cells and add 4 ml of Accutase per plate. Place back in incubator for approximately 5 min.Using pipette, gently dislodge cells from plate and combine all cells in a 50 ml conical tube.Spin down (1,000 x g, 5 min) and resuspend into 20 ml BMDM Maintenance media.Count cells by staining 1:1 with 0.4% Trypan Blue.Resuspend cells to 2.",
    "5 x 105 cells per ml in BMDM Maintenance Media and plate on TC treated cell culture plates (2 ml per well of 6-well plate). Three replicates (e.g., 3 wells of a 6-well plate) are recommended for each condition. Additional wells should be designated for protein or cell count normalization.Cell will adhere to plate with in a matter of a couple hours. After adherence, cells are ready for stimulation and/or extraction. To stimulate macrophages, treat with 50 ng/ml of LPS and 10 ng/ml IFN-γ, or other stimuli of interest, for desired duration.Isolation of Polar Metabolites and Lipids (Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200714/20200714233716_1872.jpgFigure 2. Work flow for extraction of lipids and small polar metabolites. ACN: acetonitrile, IPA: isopropanol.Before beginning, make the following solutions:3:1 1-butanol:methanol (LC-MS grade), with 1% SPLASH LipidoMIX Internal Standard (SPLASH)3:1 heptane:ethyl acetate (LC-MS grade)1% acetic acid (LC-MS grade)65:30:5 Acetonitrile:Isopropanol:Water (LC-MS grade, ACN:IPA:H2O)Chill 3:1 butanol:methanol (+SPLASH) and 3:1 heptane:ethyl acetate in the -20 °C and 1% acetic acid in the 4 °C for at least an hour prior to beginning.Aspirate media from cells.Wash cells twice with room temperature PBS.Add 300 µl of -20 °C 3:1 butanol:methanol (+SPLASH) to each well, place plates immediately on ice.While keeping cell plate on ice, scrape cells using cell scraper, and transfer solution from each well to a separate 1.5 ml plastic microcentrifuge tube. Place samples on ice.Note: Also perform procedural blanks (N > 2) by performing the same Steps B1-B5 with an empty tube/plate. Vortex each tube for 1 min, place back on ice.In the fume hood, add 300 µl -20 °C 3:1 heptane:ethyl acetate to each sample.Vortex all tubes for 3 min, place back on ice.In the fume hood, add 300 µl 1% acetic acid to each sample.Vortex all tubes for 3 min, place back on ice.",
    "Centrifuge all tubes (20,000 x g, 10 min, 4 °C)–two separate layers should form.Using a pipette, transfer a set volume (~400 µl) of the top organic layer to a glass vial (this is the lipid and fatty acid fraction) (perform in fume hood)Using a pipette, transfer a set volume (~300 µl) of the bottom aqueous layer to a 1.5 ml plastic tube (this is the polar metabolite fraction) (perform in fume hood)Completely dry down all samples by nitrogen stream using a N2 sample concentrator in the fume hood. Samples typically dry within 2h at room temperature. Retrieve samples immediately after drying.Resuspend the metabolite fraction in LC-MS grade water (50 µl) and the lipid fraction in 65:30:5 ACN:IPA:H2O (50 µl).Transfer metabolite fraction to polypropelyne LC-MS vials and the lipid fraction to glass LC-MS vial, cap and place in LC-MS autosampler for analysis.Liquid-chromatography Mass spectrometryLC-MS vials should be placed in sample trays in randomized order. Sample runs should start with injection of an equal volume of at least three appropriate blanks: LC-MS H2O for polar metabolites, 65:30:5 ACN:IPA:H2O for lipids. Blanks should additionally be run throughout, between at least every 10 samples.Analyses of both the polar metabolite and lipid fractions were performed on a Thermo Q-Exactive mass spectrometer coupled to a Vanquish Horizon UHPLC.Polar metabolite samples were separated on a 100 x 2.1 mm 1.7uM Acquity UPLC BEH C18 Column (Waters) coupled to a 130Å, 1.7 µm, 2.1 mm x 5 mm Acquity UPLC BEH C18 VanGuard Pre-column (Waters). A gradient of solvent A (97:3 H2O:methanol, 10 mM TBA, 9 mM acetate, pH 8.2) and solvent B (100% methanol) was used at a 0.2ml/min flow rate. The gradient is: 0 min, 5% B; 2.5 min, 5% B; 17 min, 95% B; 21 min, 95% B; 21.5 min, 5% B (Figure 3A).",
    "Five µl of each metabolite sample was injected for analysis. Data was collected on a full scan negative mode. Detailed MS parameters are laid out in in Table 1.Lipid samples were separated on a 100 x 2.1 mm 1.7uM Acquity UPLC CSH C18 Column (Waters) coupled to a 130Å, 1.7 µm, 2.1 mm X 5 mm Acquity UPLC CSH C18 VanGuard Pre-column. A gradient of solvent C (70:30 ACN:H2O, 10 mM NH4Ac) and solvent D (90:10 IPA:ACN, 10 mM NH4Ac) was used at a 0.4 ml/min flow rate. The gradient is: 0 min, 2% D; 2 min, 2% D; 5 min, 30% D; 19 min, 85% D; 20 min 99% D; 27 min, 99% D; 28 min, 2% D; 32 min, 2%D (Figure 3B). Five µl of each lipid sample was injected for analysis. Samples were run twice, once in negative mode and once in positive mode both using data dependent MS2 (ddMS2) analysis. Detailed MS parameters are laid out in in Table 1.Table 1. Mass Spectrometry Parametersimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200714/20200714233806_2340.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200714/20200714233848_9964.jpgFigure 3. Solvent gradients and elution profiles. A. Solvent gradient and example elution profile for LC-MS polar metabolite method. B. Solvent gradient and example elution profile for LC-MS lipid analysis, profiles from both negative and positive ionization runs are shown."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}