{
  "id": 10233,
  "origin_website": "Jove",
  "title": "Quantification of Mouse Heart Left Ventricular Function, Myocardial Strain, and Hemodynamic Forces by Cardiovascular Magnetic Resonance Imaging",
  "procedures": [
    "The described animal experiments are conducted in accordance with European Union guidelines for the welfare of laboratory animals (Directive 2010/63/EU) and were approved by the Academic Medical Center Animal Ethics Committee.\n1. Setup and animal preparation\nPrior to starting the experiment, make sure there is sufficient isoflurane anesthesia for at least 2 h, and that the battery available for ECG and respiratory monitoring is sufficiently charged. Make sure the scanner area is equipped with a working fume extraction tube to remove excess isoflurane.\nPrepare the mouse cradle (Figure 1A), and turn on the animal heating system with the temperature set to 40 °C. Prepare the ECG/respiratory interface module and battery setup (Figure 1B), and start the software for real-time monitoring of ECG and respiratory signals (Figure 1C).\nRemove the mouse from its housing cage and measure body weight.\nPlace the mouse in an anesthesia induction chamber under a fume hood extraction arm, and provide 3-4% isoflurane in a mixture of 0.2 L/min O2 and 0.2 L/min medical air. After the animal is fully anesthetized, apply a small drop of eye ointment to each eye, and close the eyelids of the mouse.\nPlace the mouse in the supine position on the mouse cradle. Hook the incisors of the mouse in the bite bar on the mouse cradle, and adjust the nose cone to fit properly (Figure 1A). Visually check if the breathing is stable below 100 breaths/min, and reduce the isoflurane to ~2% during animal preparation.\nMove the mouse cradle such that the heart is located in the part of the cradle holder that will end up in the center of the RF coil and iso-center of the magnet.\nUse petroleum jelly to insert the rectal temperature probe, and tape the fiber-optic cable of the temperature probe to the mouse cradle.",
    "Place the respiratory balloon on the lower abdomen of the mouse and secure it with tape. Insert two ECG electrode needles subcutaneously in the thorax at the height of the forepaws and gently tape them down to prevent movement (Figure 1A).\nCheck whether respiration and ECG signals are of sufficient quality, and whether correct trigger points are detected by the software (Figure 1C).\n\t\nMake sure the respiratory rate is 50-80 breaths/min, heart rate ~400-600 beats/min, and body temperature around 37 °C. Adjust the isoflurane administration when the respiratory rate is outside of this range, and reduce the temperature of the animal heating system if the body temperature tends to exceed 37 °C.\nPlace the RF coil over the mouse.\n\tNOTE: Depending on the system, this might require temporary disconnection of the ECG electrodes and respiratory balloon plugs from the ECG/respiratory interface module.\nConnect the coil cables, and place the cradle in the magnet bore. Check if the ECG signal is still stable.\n\t\nIf the ECG signal is suboptimal, reposition the ECG electrodes for a better signal, as this cannot be done at a later stage without significantly changing the orientation of the animal.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62595/62595fig01.jpg",
    "Figure 1: Animal preparation and equipment setup for CMR imaging of the mouse heart. (A) Fully anesthetized mouse in the supine position, placed in the heated mouse cradle with a respiratory pneumatic pillow placed on the abdomen, rectal fiber-optic temperature sensor, and subcutaneous ECG leads in the chest near the forepaws. (B) Mouse body coil placed over the mouse cradle, with ECG leads and respiratory pillow reconnected to the ECG and respiratory interface prior to placing the holder in the MRI magnet. (C) Depiction of the ECG and respiratory signals in dedicated small animal monitoring software. The R-peak of the ECG signal is detected and used as starting point for MRI signal acquisition. A blanking period between R-peaks can be manually adjusted based on the period of a heartbeat. Triggering can only occur during the respiratory plateau (green line in middle panel) for which the beginning delay and maximum width can be manually adjusted. Abbreviations: CMR = cardiovascular magnetic resonance imaging; ECG = electrocardiogram; MRI = magnetic resonance imaging. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62595/62595fig01large.jpg]\n2. MRI scan calibration and triggering\nAdjust the ECG and respiratory gating parameters within the signal monitoring software such that trigger points are generated at the R-peaks and only during the flat portion of the respiratory signal. To minimize ECG gating errors, set a blanking period that is 10-15 ms shorter than the R-R interval.\n\tNOTE: This blanking period should be adjusted during the entire experiment if changes in heart rate occur.",
    "Perform a center frequency calibration and a standard (ungated) SCOUT scan with zero offset to determine the position of the mouse in the scanner in coronal, axial, and sagittal directions. If the heart is not positioned within 0.5-1 cm of the field-of-view (FOV) center, adjust the position of the cradle accordingly, and redo the SCOUT scan.\nPerform a manual shim and RF calibration using available vendor methods. \n3. Scan planning and acquisition\nNOTE: See Table 1 for detailed scan parameters of the following scans.\nBased on the initial SCOUT, perform a gated single-frame Gradient Echo (GRE) scout scan (Table 1, scan 1) with 5 slices in 3 orthogonal directions, and position each stack of slices on the approximate location of the heart to locate the exact position of the heart (Figure 2A).\nPerform a gated single-frame multi-slice SA scout scan (Table 1, scan 2).To this end, use the previous GRE scout to position 4-5 slices in a mid-left ventricular position, perpendicular to the long axis of the heart to find an initial estimate of the midventricular SA view, which is needed to plan the long-axis 2-chamber scout (Figure 2B).\nFor the following prospective scans (steps 3.4-3.6), adjust the number of cardiac frames (Nframes) such that Nframes × TR is ~60-70% of the R-R interval.\n\tNOTE: Acquisition for 60-70% of the R-R interval is enough to capture the end-diastolic phase of the cardiac cycle, while allowing additional T1 relaxation during end-diastole for improved SNR and preventing disturbance of the following R-peak by gradient switching.",
    "Perform a gated single-slice GRE scan to generate the long-axis 2-chamber (2CH) scout, which combined with the SA scan, is needed to plan the 4-chamber (4CH) (Table 1, scan 3). To this end, position a slice perpendicular to the previous SA views running parallel to the connection points between the left and right ventricle. Move this slice to the middle of the left ventricle, and check in the coronal image of the GRE scout if the slice is aligned with the LV long axis such that it is placed through the apex (Figure 2C).\nPerform another gated single-slice GRE scan to generate the 4-chamber (4CH) scout scan, which is needed to plan the multi-slice SA and the 3-chamber scan (Table 1, scan 4). To this end, position a slice perpendicular to the 2CH scout scan, and align to the center of the long axis such that the slice goes through the mitral valve and the apex. In the SA views, adjust the slice such that it is placed parallel to the posterior and anterior ventricular wall and between the two papillary muscles (Figure 2D). Check if the slice remains in the center of the ventricle throughout the entire cardiac cycle.\nPerform a gated sequential multi-slice SA GRE scan (Table 1, scan 5) for systolic function measurements. To this end, position a midventricular slice perpendicular to the LV long axis in the 2CH and 4CH views in the center of the heart, and increase the number of slices (typically an odd number, e.g., 7 or 9 slices, no gap between the slices) to cover the heart from base to apex (Figure 2E).",
    "For the following retrospectively gated scans (steps 3.8-3.9), turn off all prospective cardiac and respiratory gating functionality. Make note of the cardiac and respiratory rate before and after each retrospectively gated scan, and use these values for reconstruction purposes later (step 5.2.2).\nPerform three sequential single-slice retrospectively gated GRE scans in the midventricular SA view (for quantification of the E'/A' ratio), 2CH, and 4CH view, the latter two which are necessary for the quantification of the myocardial strain and HDF values (Table 1, scan 6-8). If needed, optimize the final 2CH and 4CH slice orientations based on the multi-slice SA views as well as the available 2CH and 4CH scout scans.\nPerform an additional retrospectively gated single-slice GRE scan in a 3-chamber (3CH) view, which combined with the 2CH and 4CH view from step 3.8 is necessary for the quantification of the myocardial strain and HDF values (Table 1, scan 9). To this end, position a slice perpendicular to the midventricular SA view similar to the position of the final long-axis 4CH view, and turn the slice 45° to pass from the anterior wall to the papillary muscle closest to the posterior wall. Inspect the basal SA slice to see if the slice passes through the mitral and aortic valve. Inspect in the final long-axis 4CH view if the slice is going through the apex (Figure 2F).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62595/62595fig02.jpg",
    "Figure 2: Slice planning for CMR imaging in a mouse. (A) GRE SCOUT planning through the heart in 3 orthogonal views using initial scout scan. (B) Short-axis scout planning on the GRE SCOUT coronal and sagittal slices. (C) Planning of 2CH scout view using the short-axis scout and the GRE SCOUT coronal slice. (D) Planning of 4CH scout view using the short-axis scout and the 2CH scout. (E) Planning of the multi-slice short-axis view using 2CH and 4CH scouts. (F) (left) Planning of final 2CH, 3CH, and 4CH views using the midventricular short-axis and 2CH/4CH scout views. Abbreviations: CMR = cardiovascular magnetic resonance imaging; GRE = Gradient Echo; CH = chamber. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62595/62595fig02large.jpg]\ntable:\n﻿0,1,2,3,4,5,6\nScan number(s),1,2,3,4,5,6-9\nScan name(s),GRE scout,multi-slice SA scout,2CH scout,4CH scout,multi-slice SA,\"SA, 2CH, 4CH, 3CH\"\ntotal slices,15 (3 x 5)*,4-5,1,1,7-9,1\nThickness (mm),1,1,1,1,1,1\nFOV (mm),60,35,30,30,35,30\nFOV Ratio,1,1,1,1,1,1\nFlip Angle,40,20,20,20,20,15\nTE (ms)**,3.8,3.4,2.5,2.5,2.5,3.6\nTR (ms),200,1 R-R,7,7,7,8\nNframes,1,1,12-14,12-14,12-14,32 ***\nMatrix Size,192 x 192,192 x 192,192 x 192,192 x 192,192 x 192,192 x 192\nECG triggering,no,yes,yes,yes,yes,retrospective\nRespiratory triggering,yes,yes,yes,yes,yes,retrospective\nAverages,1,3,5,5,5,retrospective ****\nTotal imaging time (estimated *****),2 min,2min,3-4 min,3-4 min,20-25 min,13 min / scan",
    "Table 1: Acquisition parameters for each sequence used during the CMR protocol. * Scans are performed in three different orthogonal orientations (axial, coronal, sagittal). **The shortest possible TE, given all other parameters are used, which depends on the specific scanner configuration. ***This is the number of cardiac frames after retrospective binning. **** The effective averaging depends on the random k-space filling during the total acquisition time. In total, 400 repetitions of all k-lines were performed. ***** Including ECG/respiratory triggering delays. Abbreviations: CMR = cardiovascular magnetic resonance imaging; ECG = electrocardiogram; GRE = gradient echo; FOV = field-of-view; TE = echo time; TR = repetition time; Nframes = number of cardiac frames; SA = short axis; CH = chamber. Please click here to download this Table.[href=https://www.jove.com/files/ftp_upload/62595/Table1_sequences-revised.xlsx]\n4. Finalization of the experiment and data storage\nRemove the mouse from the cradle after detaching all other measurement equipment, and turn off the anesthesia. In the case of longitudinal experiments, place the mouse in a pre-warmed housing cage at 37 °C for recovery until the animal is awake and active.\nClean all equipment that has been used with cleaning wipes or 70% alcohol.\nGenerate Digital Imaging and Communication in Medicine (DICOM) files for the prospectively gated MRI data, and copy these together with the MRI raw data files of the retrospectively gated scans to a secure server for subsequent data analysis.\n5. Offline reconstruction of the retrospectively acquired scans\nNOTE: For the reconstruction of the retrospectively gated scans, a custom-built open-source software was used (Figure 3). Perform the following steps for each of the retrospectively triggered data separately.\nOpen the reconstruction software Retrospective, and load the raw data file corresponding to a retrospectively gated MRI scan.",
    "Inspect the Raw navigator signal, and note that the higher signal peaks represent the respiratory frequency and the lower signal peaks represent the heart rate.\n\t\nIf the peaks are registered upside down, flip the signal with the up/down switch.\nAdditionally, check whether the automatically detected heart rate corresponds to 10% of the observed values during each scan. If not, manually adjust these values because automated detection failed.\nChoose an appropriate window percentage for exclusion of data during respiratory movement, usually 30%.\nPress Filter to perform the navigator analysis, and separate the heart navigator from the respiratory navigator.\nSet the number of CINE frames to 32 (value used in this study), and press sort k-space.\nChoose appropriate settings for compressed sensing (CS) regularization, and press reconstruct. Use the following typical regularization parameters: wavelet regularization parameter in the spatial (x, y, and z) dimensions (WVxyz) 0.001 or 0; total variation constraint in the CINE dimension (TVcine) 0.1; total variation constraint in spatial dimension (TVxyz) 0; and total variation constraint in the dynamics dimension (TVdyn) 0.05.\nOnce the reconstruction is finished, preview the CINE movie to evaluate the reconstruction. Export DICOM images for further analysis with Export DCM.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62595/62595fig03.jpg\nFigure 3: 'Retrospective' triggering graphical user interface. 'Retrospective' is a custom-built reconstruction application for retrospectively triggered cardiac magnetic resonance imaging scans. In the user interface, it is possible to evaluate the navigator signal, adjust the number of CINE frames to be reconstructed, adjust the compressed sensing parameters to improve reconstruction, preview the CINE images as a dynamic movie, and export the reconstructed data. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62595/62595fig03large.jpg]\n6. Image analysis software",
    "NOTE: The image analysis software (Figure 4) requires the use of DICOM images and has multiple plugins for different cardiovascular analysis applications, such as the plugin for volumetric measurements and the plugin for strain and HDF analysis.\nFor volumetric assessment of the LV, select the multi-slice SA scan, and load it into the plugin for volumetric measurements.\n\t\nAssign end-systolic (ES) and end-diastolic (ED) labels to the corresponding cardiac frame.\nUse the contour tools to segment the endomyocardial borders in the ES and ED frames.\n\t\tNOTE: The analysis software, used for this protocol, automatically displays the LV EF, EDV, ESV parameters when all necessary annotations have been made.\nFor diastolic measurements, select the midventricular SA CINE images, and load these into the plugin for volumetric measurements.\n\t\nAssign the ED and ES labels to the corresponding cardiac frames.\nUse the contour tools to segment the endocardial border for all frames. Compare the segmentation of neighboring frames to ensure smooth transitions of the segmentation throughout the cardiac cycle.\nExport the time evolution from all cardiac frames and corresponding LV endomyocardial volumes (LV ENDO). Apply a custom-built script (see Supplemental Material) to calculate the E'/A' ratio.\n\t\t​NOTE: The script applies a Savitzky-Golay filter for robust calculation of the dV/dt curves and uses semi-automatic peak detection to find the E' and A' peaks.\nFor strain and HDF calculations, select the 2CH, 3CH, and 4CH long-axis CINE images, and load them into the plugin for volumetric measurements.\n\t\nAssign the ED and ES labels to the corresponding cardiac frame in each slice orientation.\nUse the contour tools to segment the endocardial border for all frames in all 3 orientations. Compare the segmentation of neighboring frames to ensure smooth transitions of the segmentation throughout the cardiac cycle.",
    "Once the contours are drawn in the plugin for volumetric measurements, run the plugin for the strain and HDF analysis.\nAssign each of the acquired datasets to the corresponding labels for 2CH, 3CH, and 4CH views, and execute the strain analysis.\nFor HDF analysis, draw the diameter of the mitral valve at the end-diastolic frame in all 3 orientations, and draw the diameter of the aorta in the 3-chamber long-axis image.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62595/62595fig04.jpg\nFigure 4: Image analysis software graphical user interface. The plugin for volumetric measurement in the image analysis software, which is used for contouring of the endomyocardial border. For each dataset, the end-diastolic and end-systolic cardiac phases are selected, and the endomyocardial border is segmented for all frames. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62595/62595fig04large.jpg]"
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}