{
  "id": 5518,
  "origin_website": "Bio",
  "title": "CRISPR/Cas9 Editing of the <em>Bacillus subtilis</em> Genome",
  "procedures": [
    "Construction of plasmid containing spacer used to target the B. subtilis genomePrepare pPB41 digested with the restriction endonuclease BsaI (Figure 1)Assemble 50 μl restriction digest reaction: 1x Cutsmart buffer (NEB), 2 μl BsaI-HF (20,000 U/ml; NEB), and 5 μg pPB41. Incubate reaction at 37 °C in an incubator for 3 to 6 h. Add 1 μl of calf intestinal phosphatase (CIP; 10,000 U/ml; NEB), and incubate at 37 °C for 1 h. Perform 1% agarose gel electrophoresis in 1x TAE buffer (see Recipes), followed by gel extraction of the digested plasmid.Notes: The plasmid pPB41 is typically used, but we also generated a derivative, pPB105, wherein the spectinomycin resistance cassette was replaced with a chloramphenicol resistance cassette (see Figure 1). All steps of the procedure are identical for pPB105, except for E. coli clones are selected using LB agar plates containing 100 μg/ml ampicillin or 20 μg/ml chloramphenicol (chloramphenicol selection works but colonies grow slower), and B. subtilis transformants are selected using LB agar plates containing 5 μg/ml chloramphenicol.Gel extractions are performed by excising the appropriate DNA band from the agarose gel from two 50 μl PCR reactions and placing in a microfuge tube. The gel slice is dissolved by adding 350 μl QG buffer (see Recipes) and incubating at 65 °C in a heat block. After the gel slice is fully dissolved, 200 μl of isopropanol is added and mixed by pipetting. The entire gel extraction is loaded onto a silica spin column. The flow-through is collected via centrifugation (12,000 x g for 1 min at room temperature) and discarded. The column is washed and the flow-through discarded first with 500 μl PB buffer (see Recipes), then with 750 μl PE buffer (see Recipes). The column is dried by centrifugation as above.",
    "The DNA is eluted from the column with 75 μl ultra-pure H2O via centrifugation as above.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417201047_9776.jpgFigure 1. Digestion of pPB41 or pPB105 with BsaI-HFPrepare phosphorylated proto-spacer (Figure 2)The proto-spacer is designed by searching the B. subtilis genome for a proto-spacer adjacent motif (PAM) site, consisting of the nucleotide sequence 5’-NGG-3’ (where N stands for any nucleotide), at the location that the edit is to be made (Figure 2A). The thirty nucleotides 5’ of the PAM site are used for the proto-spacer (Figure 2A). Oligonucleotides for the proto-spacer are ordered from Integrated DNA Technologies (IDT) as shown in Figure 2B. The two oligonucleotides are reverse complementary to each other with the exception of the overhangs (Figure 2B). Prepare oligonucleotide stocks at a concentration of 100 μM using ultra-pure distilled H2O (Invitrogen Life Technologies).Assemble annealing reaction: 1x annealing buffer (see Recipes), 10 μM oligonucleotide 1, 10 μM oligonucleotide 2. Incubate reaction at 100 °C in a heat block for 5 min. The reaction is transferred to a beaker of water, pre-heated to 100 °C. The entire beaker is placed at room temperature and allowed to cool slowly to room temperature.Prepare phosphorylation reaction: 1x T4 DNA ligase buffer (NEB), 1 μl T4 polynucleotide kinase (PNK; 10,000 U/ml; NEB), 1 μM annealed oligonucleotides from above. Incubate at 37 °C in an incubator for 30 min, and then heat inactivate T4 PNK at 65 °C in a heat block for 20 min. Store annealed and phosphorylated oligonucleotides at -20 °C until ready to use in ligation reaction.Notes: Although we typically phosphorylate the proto-spacer using T4 PNK, it is also possible to order the oligonucleotides with a 5’-phosphate modification from IDT.Given that the T4 PNK inactivation is carried out at 65 °C, it is possible that the proto-spacer could denature.",
    "Although we have not had a need to change the order of the protocol (and we have not tried), T4 PNK is active on both single stranded and double stranded DNA, and therefore, we see no theoretical concern with reversing the order, and phosphorylating prior to annealing.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417201334_9491.jpgFigure 2. Proto-spacer design and preparation. A. A proto-spacer (highlighted blue and capital letters) and proto-spacer adjacent motif (PAM site; highlighted red); B. Oligonucleotides with proper overhangs (lower case letters) necessary to ligate into pPB41 (Jiang et al., 2013; Burby and Simmons, 2017); C. Annealing and phosphorylation reaction to prepare a dsDNA proto-spacer for ligation into pPB41.Ligate proto-spacer and pPB41 and isolate new plasmid (Figure 3)Assemble 20 μl ligation reaction: 1x T4 DNA ligase buffer (NEB), 40 to 100 ng pPB41 (digested with BsaI-HF and CIP in previous step), 25 nM proto-spacer (annealed and phosphorylated in previous step), 1 μl T4 DNA ligase (400,000 U/ml NEB). Let reaction stand at room temperature for 2-3 h. Use 10 μl of ligation reaction to transform 100 μl of chemically competent TOP10 Escherichia coli. Clones can be selected using LB agar plates (see Recipes) containing 100 μg/ml ampicillin or 100 μg/ml spectinomycin. Clones are verified via Sanger sequencing using oPEB253.Note: The first cloning step, wherein the proto-spacer is ligated into pPB41, does not require a certain E. coli strain. We use TOP10 cells as our general cloning strain.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417201552_2207.jpgFigure 3. Ligation of phosphorylated proto-spacer and pPB41 to generate a ‘targeting plasmid’Construction of editing plasmidPCR amplify pPB41 to linearize (Figure 4A)Amplify pPB41 via PCR using Q5 DNA polymerase (NEB) and primers oPEB217 and oPEB218. Perform 1% agarose gel electrophoresis in 1x TAE buffer (see Recipes) followed by gel extraction. PCR product is stored at -20 °C until used.",
    "Notes:  The template used for this step could be either pPB41 or the plasmid containing the spacer generated in step B1. The PCR program used to linearize pPB41 is: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417223832_2629.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417201844_9336.jpgFigure 4. Construction of editing plasmid. A. Schematic representation of pPB41 PCR amplicon; B. Schematic representation of CRISPR/Cas9 PCR amplicon; C. Schematic representation of upstream and downstream portions of editing template PCR amplicons; D. Gibson Assembly of editing plasmid using PCR products from A-C.PCR amplify CRISPR/Cas9 using plasmid generated in step B1 (Figure 4B)Amplify plasmid generated in step B1 (pPB43 in the example) via PCR using Q5 DNA polymerase (NEB) and primers oPEB232 and oPEB234. Perform 1% agarose gel electrophoresis in 1x TAE buffer (see Recipes) followed by gel extraction. PCR product is stored at -20 °C until used.Note: The PCR program used to amplify CRISPR/Cas9 is the same used in step B1 above.PCR amplify editing template (Figure 4C)Amplify upstream and downstream portions of editing template separately via PCR using Q5 DNA polymerase (NEB) (primers used in the example are oPEB237/oPEB238 and oPEB239/oPEB240 for the upstream and downstream portions, respectively). Primers are designed using the online tool Primer3 (Koressaar and Remm, 2007; Untergasser et al., 2012) and Oligocalc (Kibbe, 2007). The primers specific to the editing template are combined with the overhangs for pPB41 (upstream forward primer starts 5’-GCATGCTGAATTCGTAATGAGGTTC, followed by the editing template specific sequence; downstream reverse primer starts 5’-GCATAACCAAGCCTATGCCTACAGC, followed by editing template specific sequence), which will allow the editing template to be incorporated into the editing plasmid. The editing template is designed to be approximately 2 kilobases, with the upstream and downstream portions consisting of about 1 kb each. The critical aspect of editing template design is ensuring that the guided Cas9 can no longer target the genome after the desired mutation is introduced.",
    "For deletions, the entire sequence of the spacer and the PAM site can be removed. For point mutations, it is more complicated. In Jiang et al. (2013), it was found that mutating the PAM site or the first few bases of the spacer is optimal (Jiang et al., 2013). The overlap at the center of the editing template should be 25 bases on each portion of the template (the result is that there are 50 bp that overlap in total). After PCR, perform 1% agarose gel electrophoresis in 1x TAE buffer (see Recipes) followed by gel extraction. PCR products are stored at -20 °C until used.Notes: Editing template primers are designed using the online tool Primer3 (Koressaar and Remm, 2007; Untergasser et al., 2012). Approximately 250 bp is selected at least 750 bp from the center of the editing template and a primer list is generated using default parameters with the following exceptions: 1) primer size used is min: 22, opt: 24, max: 28; 2) primer GC% min: 35; 3) Max Self Complementarity: 6.0; and 4) Max 3’ Self Complementarity: 2.0. A primer is then selected and cross examined using a second online tool, Oligocalc (Kibbe, 2007). The purpose is to ensure that potential hairpin formation, 3’ complementarity, and self-annealing are all undetectable using this program.The editing template used in the example in the figures is 3 kb (about 1.5 kb each for upstream and downstream portions of the editing template), but we routinely use 2 kb. We also present four different gene deletions made using editing templates of about 2 kb.The PCR program used to amplify each portion of the editing template is:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417223932_4033.",
    "jpgConstruct editing plasmid using Gibson Assembly (Gibson, 2011) (Figure 4D)Assemble 10 μl Gibson Assembly reaction: 1x Gibson master mix (see Recipes), 40-100 ng of linearized pPB41 from above, 40-100 ng of CRISPR/Cas9 PCR product containing spacer from above, and 20-40 ng of each portion of the editing template. Incubate reaction at 50 °C in a thermocycler for 90 min. Use 5 μl of Gibson Assembly reaction to transform 80 μl chemically competent E. coli strain MC1061. Clones can be selected as in step A3. Clones are sequenced using primers oPEB253, oPEB227, and editing template specific primers.Notes:  It is absolutely critical to use a cloning strain that is recA+, because transformation of naturally competent B. subtilis is much more efficient using plasmids that are multimeric. The E. coli strain we use for plasmid propagation is MC1061. We have also encountered difficulties in obtaining certain editing plasmids in MC1061 for reasons that are not clear. In these instances, we scaled up the Gibson Assembly reaction to a total volume of 20 μl and we used 20 μl to transform B. subtilis as in Procedure C. The efficiency of this procedure was lower, with some spectinomycin sensitive isolates retaining the wild-type genotype, so typically at least twelve isolates were screened.The editing template is sequenced using oPEB227, which sequences from the 5’ end of pPB41. Additional primers are designed within the editing template to verify the remaining sequence. Editing genome of B. subtilisTransform B. subtilis with editing plasmid obtained from previous stepPrepare naturally competent B. subtilis cultures (Burby and Simmons, 2017) (Figure 5A).Streak out strain from frozen 20% glycerol stock on LB agar plate for single colonies using a wooden stick and incubate plate at 30 or 37 °C overnight in an incubator.",
    "In the morning, inoculate 2 ml LM media (see Recipes) in a 14 ml disposable, round-bottom culture tube. Incubate culture at 37 °C on a roller drum in an incubator until the OD600 is between 0.8 and 1.5 (approximately 2 h growth). Transfer 20 μl of LM culture to 0.5 ml pre-warmed MD media (see Recipes). Incubate MD culture at 37 °C for 4 to 6 h on a roller drum. Add editing plasmid DNA (approximately 200 to 600 ng) and incubate at 37 °C on roller drum for 60 to 90 min. Transformants are selected by plating 200 μl on LB agar plates containing 100 μg/ml spectinomycin and incubated at 30 °C overnight. Notes:  We have found 5 h in MD media to work very well, and is used most often, but adding DNA up to an hour early or an hour late is also successful. Plating 90 min after DNA addition works very well, but plating at 60 min will also yield transformants. Several isolates (6-12) are established by colony purifying transformants (Figure 5B)Colony purifying refers to restreaking isolated colonies three to four consecutive times for single colonies.Single colonies from preceding step are re-streaked on LB agar plates for single colonies containing 100 μg/ml spectinomycin and incubated at 30 °C overnight in an incubator.Cure isolates of plasmid (Figure 5C)Single colonies from preceding step are re-struck on LB agar plates for single colonies and incubated at 42-45 °C overnight.Note: We have an incubator set to 45 °C, but we have used 42 °C successfully.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417202457_4066.jpgFigure 5. Outline of genome editing procedure in B. subtilis (Adapted from Figure S2 [Burby and Simmons, 2017]). A. The first step is to transform B. subtilis with the editing plasmid. Inset shows wild-type mutS2 locus. B.",
    "After establishing isolates using colony purification, the isolates are cured of the editing plasmid. Inset depicts homology directed repair using the editing template on the plasmid. C. The final step is to verify loss of the editing plasmid and genotype isolates to verify the mutation was successfully introduced. Inset shows edited mutS2 locus.Screen isolates for loss of plasmidSingle colonies from preceding step are re-streaked onto LB agar plates containing 100 μg/ml spectinomycin, and then onto LB agar plates for single colonies. Plates are incubated at 45 °C overnight in an incubator. If the isolates lost the plasmid, there would be no growth on the LB agar plates with spectinomycin.Screen for intended mutation (Figure 6)The isolates that were unable to grow on plates containing spectinomycin are further screened for the presence of the desired mutation. In the case of a point mutation, a primer can be designed to anneal at the point mutation (Figure 6A), or the genetic locus may be amplified using primers outside the editing template as done for a deletion (see below), followed by Sanger sequencing to verify the point mutation is present and no other mutations were introduced. In the case of a gene deletion, PCR primers that anneal outside of the recombination template within the genomic DNA are used to PCR amplify the genetic locus (Figure 6B). The migration of the PCR product will be faster relative to the product from wild-type locus.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170417/20170417202638_4658.jpgFigure 6. PCR based verification of genome edit. A. A schematic representation showing the locations of PCR primers used in panel B; B. Agarose gel stained with ethidium bromide of amplified PCR products using primers specific to the point mutation (H743A, for which we changed CAC→GCT) and the B. subtilis chromosome (left panel), and using primers specific to the editing plasmid (right panel).",
    "Of twelve isolates screened all were found to have the predicted point mutation, and two of twelve retained resistance to spectinomycin (asterisks). The slow migrating band in the PY79 lane corresponds to nonspecific PCR amplification in the wild type background. The editing plasmid was detectable in spectinomycin resistant isolates, but not in the remaining ten. C. Agarose gel stained with ethidium bromide of PCR reactions using primers specific for deletion of four B. subtilis genes. Primers were designed outside of the editing template, and are therefore specific to chromosomal DNA. For all four deletions, all isolates were found to be spectinomycin sensitive, and PCR genotyping of three isolates for each deletion found that all isolates tested had the intended deletion. Note that for the control reaction for ponA, the PCR product is faint because the amplicon is approximately 5 kb and the extension time of the PCR was 3 min, which is near the limit for complete extension for Q5 DNA polymerase; the other three control amplicons are no larger than 3.4 kb.Save frozen stock of new strainSeparate LB cultures of at least two isolates that are confirmed to have the intended mutation are grown to an OD600 of approximately 1 to 1.5. A frozen stock is saved by adding glycerol to a final concentration of 20% in a cryo-vial. A cryo-vial cap is added to the lid and labeled appropriately. Cryo-vials are placed directly into a freezer at -80 °C."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}