{
  "id": 15033,
  "origin_website": "Jove",
  "title": "Direct Reprogramming of Human Fibroblasts into Myoblasts to Investigate Therapies for Neuromuscular Disorders",
  "procedures": [
    "All experiments and biopsies were carried out following the ethical rules of the institutions involved under the approval of the Nationwide Children's Hospital Institutional Review Board.\n1. Initiation of dermal fibroblasts culture\nEstablishment of fibroblasts culture\n\t\nAliquot 10 mL of fibroblast medium (Table 1) in 15 mL conical tubes. The skin biopsy should be placed and transported in this medium. The biopsy can be stored at 4 °C until it is processed, preferentially on the same day.\n\t\tNOTE: Use the skin biopsy within 24-36 hours to avoid potential growth of contamination.\nAspirate the media from the tube and rinse the biopsy with 10 mL 1X PBS (room temperature) three times. After the third wash, leave the PBS in the tube.\nPour out the PBS and the skin onto a 10 cm2 dish.\nUsing sterile scalpels, cut the biopsy into as small as possible fragments.\nUsing a pipette, transfer an individual skin fragment and drop it into a clean 10 cm2 dish. Place 10 to 12 fragments per dish.\nAspirate the excess of PBS from around each fragment. Be careful to not aspirate the fragment.\nCover the dishes partially with the lid and allow the skin fragments to dry for 5-20 min. Do not allow the fragments to dry excessively.\nOnce the fragments are dry, tilt the dish at 45 degrees and slowly add 12 mL of fibroblast medium to the corner. Lower down the dish, carefully distributing the media so the fragments do not lift by the media.\nPlace the dishes into the incubator (37 °C, 5% CO2). Replace the media in 5-7 days, and once a week after.",
    "Observe the fibroblasts emerging from the fragment (Figure 2) and, once confluent, passage the cells into 75 cm2 flasks. Remove the medium, rinse the cells with PBS and add 1 mL 0.25 % trypsin. Incubate at 37 °C for 5 min or until all cells are lifted. Add 10 mL fibroblast growth medium to inhibit the trypsin and transfer the cells to a new flask.\n\t\t​NOTE: For passage number nomenclature, P1 is established when the first fibroblasts that emerged from the skin biopsy are transferred to a new flask for proliferation.\nCryopreservation of primary fibroblast lines\n\t\nOnce the 75 cm2 flask is confluent, rinse it with 10 mL 1X PBS and aspirate PBS.\nAdd 3 mL of 0.25 % trypsin to the cell surface. Place the flask in the incubator for 5 min. Check the flasks under the microscope to see if the cells are lifted. If not, place the flask back in the incubator for an additional 5 min.\nOnce the cells are detached, add 7 mL of fibroblast media to the flask and pipette up and down to resuspend the cells. Collect the cells into a 50 mL conical tube.\nPrepare 100 µL aliquot of trypan blue, and remove 100 µL from the sample being cryopreserved, mix with the trypan blue. Load the mix on the hemocytometer to count. Count the cells in four different fields of the hemocytometer under the microscope. To calculate the total number of cells, use the formula: (counted cells/100) * volume of culture.\nSpin the conical tubes at 300 x g for 10 minutes at room temperature or 4 °C.",
    "Aspirate off the medium and resuspend the cells in the adequate volume of freezing medium: 1 mL per each 1 million cells/vial. Pipette up and down to homogenize and distribute 1 mL to each labeled cryovial.\nPlace the vials into the freezing box, and allow the vials to freeze at a rate of 1 °C/min at -80 °C freezer overnight.\nThe following day transfer the vials to a liquid nitrogen tank or -150 °C freezer.\n2. Establishment of FibroMyoblasts (FM) cell line\nSeed primary fibroblasts at approximately 30% of confluency in two wells of a 12-well plate (2 x 104 cells/well) in order to have about 50% of confluency the next day.\nFor lentiviral transduction, add 2 to 5 x 109 vg (viral genome particles) of hTERT-puromycin lentivirus in 400 µL of fibroblast medium. To the second well, add just 400 µL of fibroblast medium. Add 1 mL of media the following day.\n\tNOTE: Plasmids for lentivirus production were obtained from the group that published the Chaouch et al, 2009 paper. They are also described individually in Aure et al, 200713 for hTERT plasmid and Barde et al, 200614 for the Tet-on system utilized for the design of MyoD plasmid. They were obtained thanks to a Material Transfer Agreement with Genethon, France (please contact Dr. Vincent Mouly to obtain these plasmids - vincent.mouly@upmc.fr). Briefly, the hTERT consists of hTERT variant 1 driven by a CMV promoter while the puromycin is driven by a PGK promoter. The MyoD plasmid contains a MyoD variant 1 driven by a CMV promoter under the control of the repressor rtTA2. This plasmid also contains the hygromycin selection expressed thanks to the SV40 promoter.",
    "Lentiviruses were produced using regular lentiviral production (see Wang and McManus JoVe protocol15). Briefly, MDL-helper, Rev-Helper, SVS-G-helper were transfected via calcium chloride precipitation also of either hTERT or MyoD plasmids. After 48 h, the supernatant was collected, and then for additional three days. All supernatant was then concentrated by ultracentrifugation. The pellet was then resuspended into Tris-HCL+NaCl+EDTA buffer. Titer estimation was evaluated by standard lentivirus qPCR assay.\nOne or two days later, transfer the cells into a 6-well plate and grow them until reaching 60-70% confluence.\nSupplement the fibroblast medium with 1 µg/mL of puromycin and add 2 mL to each well.\nKeep the cells under selection until all cells in the control well are dead (up to 12 days), changing media every 2-3 days. Passage the cells from the 6-well plate into two 10 cm2 dishes for further proliferation.\nFreeze vials of fibroblasts after selection. Label as F(hTer).\nSeed hTERT-expressing fibroblasts (F(hTer)) at about 30% confluence in fibroblast medium, in two wells of a 12-well plate, to have about 50% confluence the next day.\nFor lentivirus transduction, mix 2 to 5 x 109 vg of MyoD-hygromycinB lentivirus in 400 µl of fibroblast medium and add to respective wells; to the third well add 400 µl fibroblast medium. Add 1 mL of medium the next day.\nOne or two days later transfer the cells into a 6-well plate and grow until 60-70% confluence.\nSupplement the fibroblast growth medium with hygromycin B (400 µg/mL) and add 2 mL to each well.\nKeep the cells under selection until all cells in the control well are dead (up to 12 days), changing media every 2-3 days.\nFreeze vials of fibroblasts after selection. Label as FM followed by the cell identification number/name.\n3. Transdifferentiation protocol",
    "Seed transduced FM onto 10 cm2 dishes with 30-40% confluence. In a 12-well plate, seed 6 x 104 cells (this is dependent on the individual cell line).\n\tNOTE: For immunostaining, seed cells onto glass coverslips or chamber slides coated with Matrigel. Dilute Matrigel at 1:10 in DMEM medium, add a volume enough to cover the surface, and let the slides sit at room temperature for one hour. Aspirate off right before seeding the cells.\nFor myoblasts induction, when the fibroblasts reached 70% confluence (Figure 3A), rinse the cell surface with PBS and add fresh myoblast media supplemented with fresh 8 µg/mL doxycycline.\n\tNOTE: The success of differentiation is compromised past 80% confluence.\nAfter two to three days later, cells are 90-95% confluent and their morphology will have changed (Figure 3B). Rinse the cell surface with PBS and add fresh differentiation media supplemented with fresh 8 µg/mL doxycycline.\nContinue to change media every 2-3 days without passaging until myotubes are established (confirm via morphology) (Figure 3C).\nSeven to ten days after starting myotube differentiation, cells should be fully differentiated and may start to detach or die. Before this happens, harvest myotubes for further analysis.\n\tNOTE: The time course of myotube formation depends on the cell line. Mutations in muscle-related proteins may interfere in the myogenic potential. When myotubes start to appear bright and look white at the borders it is a signal they are starting to detach (Figure 4).\nTo harvest myotubes, collect media and transfer it to a 50 mL conical tube. The medium may contain myotubes that have detached.\nRinse the myotubes with 5 mL PBS and transfer PBS to the 50 mL tube.",
    "Add 3 mL of 0.25 % trypsin to the cell surface. Place the dish in the incubator for 5 min. Check the dish under the microscope to see if the cells are lifted. If not, place it back in the incubator for an additional 5 min.\nOnce the cells are detached, add 7 mL of fibroblast media to the dish and pipette up and down to resuspend the cells. Collect the cells to the 50 mL conical tube.\nCentrifuge at 1,200 x g for 7 min at 4 °C.\nCarefully aspirate off the liquid, without disturbing the pellet. Store the pellets at -80 °C until further processing.\n4. Immunostaining of differentiated myotubes\nNOTE: For immunostaining, grow the cells in glass coverslips or chamber slides as noted above.\nOnce myotubes are fully differentiated, aspirate off media and carefully rinse the slides with PBS. Aspirate PBS off.\nAdd fresh 4% PFA (500 µL per well of a 12-well plate) and incubate at room temperature for 10 min. Aspirate PFA off.\nRinse with 1 mL PBS.\nIncubate with 0.2 M glycine at room temperature, for 10 min. Aspirate glycine off.\nPermeabilize with PBS 0.5% TritonX-100 (300 µL/well of a 12-well plate), for 10 min with gentle agitation.\nBlock with 300 µL/well of blocking solution, for 10 min with gentle agitation.\nIncubate with primary antibody diluted 1:50 in 300 µL of blocking solution, for 2 hours at room temperature, with gentle shaking.\nRinse three times with 1 mL/well of PBS for 5 min, with gentle shaking.\nIncubate with secondary antibody diluted 1:500 in 300 µL of blocking solution, for 1 hour, at room temperature, with gentle shaking. Cover the plate with aluminum foil.\nRinse three times with 1 mL/well of PBS for 5 min, with gentle shaking.",
    "Incubate with DAPI diluted in PBS for 10 minutes. Rinse three times with 1 mL/well of PBS.\nAdd a drop of mounting medium to a glass slide. Remove the coverslip with forceps and place it face down on the drop of mounting medium.\nInvert slide onto a paper towel and gently press to remove bubbles and excess of mounting medium.\nSeal the slides with nail polish and store at 4 °C until imaging.\n5. Antisense oligonucleotide transfection\nNOTE: The protocol below is for transfection of a 6-well plate. Adjust volumes accordingly for smaller or bigger plates. The transfection is done in 100% confluent myoblasts when the cells are ready for the differentiation step.\nAspirate the myoblast growth media and rinse the cells with 1 mL PBS.\nAdd 500 µL/well of OptiMEM media and incubate at 37 °C for 1 hour.\nDilute the antisense oligonucleotide (AON) in 100 µL of OptiMEM to the desired final concentration (i.e. 50 nM, 100 nM, 200 nM, 500 nM). Incubate at room temperature for 5 min.\n\tNOTE: This protocol is optimized for 2'omethyl-phosphorothioate AONs.\nMix the lipofectamine with OptiMEM (final volume of 100 µL) to give a final ratio of 1:1 (µg DNA: µL lipofectamine). Incubate at room temperature for 5 min.\nCombine the diluted lipofectamine with the diluted AON. Mix gently by pipetting and incubate for 20 min at room temperature to allow complex formation. Avoid air bubbles.\nAdd 200 µL of lipofectamine and AON mix to respective wells. Incubate the cells overnight at 37 °C, 5% CO2.\nThe following day remove the transfection mix and add 2 mL of warm differentiation media supplemented with doxycycline.\nCollect cells at least three days later for RNA extraction or seven to 21 days in case of protein analysis.",
    "​NOTE: The days of differentiation necessary to detect RNA and/or protein expression may vary accordingly to the gene of interest or the cell line. In the case of DMD, it's possible to detect its mRNA within three days. Dystrophin protein detection requires at least seven days. This will vary depending on the cell line. High concentrations of AON and transfection reagent can impact the transdifferentiation.\n6. AAV1-U7 transduction\nNOTE: This protocol was optimized for 6-well plates. Adjust the volumes proportionally to the culture surface area. The transduction is done in 100% confluent myoblasts when the cells are ready for the differentiation step. AAV1 is the AAV serotype with the best transduction capacity of cultured myoblasts.\nAspirate off the myoblast growth medium and rinse the cells with 1 mL PBS.\nDilute 0.5-1 x 1011 viral particles of AAV1-U7 in 700 µL of warm differentiation media supplemented with doxycycline.\n\t​NOTE: We use qPCR to determine the viral concentration. The amount of virus to be used may vary depending on the quantification method and should be determined previously using a reporter assay.\nAdd the viral mix to the well by dropping it homogenously.\nThe following day, add 1.3 mL of warm differentiation media supplemented with doxycycline.\nCollect the cells at least three days later for RNA extraction or seven to 21 days in case of protein analysis.\n7. RNA extraction\nNOTE: All material used during this step should be RNase free.\nAdd 500 µL of TRIzol per pellet and pipet up and down several times to ensure that cells are homogenously lysed.\nTransfer the cell lysate in a 1.5 mL tube and incubated for 5 min at room temperature.\nAdd 100 µL of chloroform and shake manually for 15 s. Incubate for 5 min at room temperature.",
    "Centrifuge at 12,000 x g for 15 min at 4 °C. Collect the aqueous phase (upper one) and transfer it to a new 1.5 mL tube.\nFor 1 volume of the aqueous phase, add 1 volume of ethanol 100% and mix by pipetting.\n\tNOTE: We recommend column purification and concentration.\nTransfer the sample to a Zymo-Spin IC column in a collection tube and centrifuge at 12,000 x g for 30 s. Discard the flow-through.\nFor in-column DNase I digestion, pre-wash the column with 400 µL RNA Wash Buffer. Centrifuge at 12,000 x g for 30 s. Discard the flow-through.\nPrepare 40 µL of DNase reaction mix per sample. Mix 5 µL DNase I with 35 µL DNA Digestion Buffer.\nAdd the mix directly to the column matrix. Incubate at room temperature for 15 min.\nAdd 400 µL RNA Prep Buffer to the column and centrifuge at 12,000 x g for 30 s. Discard the flow-through.\nAdd 700 µL RNA Wash Buffer to the column and centrifuge at 12,000 x g for 30 s. Discard the flow-through.\nAdd 400 µL RNA Wash Buffer to the column and centrifuge at 12,000 x g for 2 min to ensure complete removal of the wash buffer. Transfer the column carefully into an RNase-free 1.5mL tube.\nAdd 15 µL nuclease-free water directly to the column matrix. Incubate for 5 min and centrifuge at 12,000 x g for 1 minute.\n\tNOTE: Collect the eluted RNA and apply it again to the column to increase yield. Centrifuge at 12,000 x g for 1 minute.\nPlace samples on ice and quantify the samples in a Nanodrop.\nStore samples at -80 °C.\n8. RT-PCR analysis",
    "NOTE: In this step, we present a suggestion of reagents to detect the expression of dystrophin mRNA, but it can be easily adapted to other reagents of choice.\nReverse transcription\n\t\nThaw all the reagents and keep them on ice.\nPrepare a mix with 4 µL of 5x Reaction Buffer, 2 µL of dNTP Mix (10 mM), 1 µL of RiboLock RNase Inhibitor, and 1 µL of RevertAid RT.\nMix the tube gently and centrifuge briefly.\nIn 0.2 mL PCR tubes, add the adequate volume of RNA in order to have 1 µg per reaction. Add nuclease-free water q.s.p 12 µL. Include one tube without the reverse transcriptase as a negative control and one tube with nuclease-free water instead of RNA.\nDistribute 8 µL of reaction mix per tube. The total volume is 20 µL.\nPlace tubes in a thermocycler and incubate for 5 min at 25 °C followed by 60 min at 42 °C. Stop the reaction by heating at 70 °C for 5 minutes.\nPlace the tubes on ice or at -20 °C for longer storage.\nPCR\n\tNOTE: Design primers at exons junctions preferably.\n\t\nVortex reagents and spin down before use.\nPrepare a master mix using 0.5 µL forward primer (25 µM), 0.5 µL reverse primer (25 µM), 12.5 µL 2x PCR Master Mix, and 8.5 µL of nuclease-free water per sample.\nAliquot 22 µL of master mix into a tube for each sample.\nAdd 3 µL of cDNA (150 ng) to its respective PCR tube. Add 3 µL of nuclease-free water to the PCR negative control tube.\nVortex and spin down the PCR tubes.\nIncubate the tubes in a thermocycler at 95 °C for 3 min, 95 °C for 30 s, (Tm-5) °C for 30 s, 72 °C for (1 min/kb) 34 times, 72 °C for 5 min.",
    "NOTE: The optimal annealing temperature may be determined empirically. For the suggested master mix, subtract 5 °C from the primer melting temperature.\nLoad 12 µL of the PCR reaction on an agarose gel and freeze the samples at -20 °C.\n9. Detection of dystrophin expression by Western Blotting\nNOTE: This protocol is optimized for dystrophin, a large membrane protein. Specific conditions may be needed for different proteins.\nProtein extraction\n\t\nAfter 7-21 days of differentiation, collect cells with 5 mL of PBS with 100 µL 0.5 M EDTA, and 50 µL protease inhibitors. Incubate at 37 °C until cells detach. Centrifuge at 1,200 x g for 5 min at 4 °C. Snap freeze the pellet by dipping the tube in liquid nitrogen. Store the pellet at -80 °C or proceed to the lysis step.\nPrepare lysis buffer by adding 1% of digitonin, 1% protease inhibitor, 10% phosphatase inhibitor, and base buffer to total volume (60 µL per cell pellet).\nAdd 60 µL of lysis buffer to the cell pellet, on ice. Sonicate for 5 s. Let sit on ice for 8 s. Repeat sonication and rest steps twice.\nIncubate samples on ice for 30 min.\nCentrifuge at 14,000 x g for 20 min at 4 °C.\nTransfer the supernatant to clean tubes.\nQuantify samples by bicinchoninic acid (BCA) assay, following manufacturer instructions.\nMix the protein solution with the appropriate volume of Laemmli buffer. Make aliquots of 100 µg. If necessary, adjust the volume to 25 µl with base lysis buffer. Store samples at -80 °C.\nWestern blotting\n\t\nThaw samples on ice.\nDenature the samples at 100 °C for 5 min, then cool them down in ice, spin down.\nDilute the 20X Tris-acetate SDS running buffer in 200 mL dH2O and add 500 µL antioxidant.",
    "Prepare the 3-8% Tris-acetate polyacrylamide gel by removing the comb and rinsing with dH2O. Assemble the gel in the electrophoresis apparatus. Fill the inner chamber with running buffer.\nLoad 5 µL of protein ladder and 25 µL of sample in the gel. Fill the outer chamber with running buffer.\nRun at 80 V for 1 h at 4 °C. Then, at 120 V for 2 h at 4 °C.\nPrepare 3 L of 1X transfer buffer with 150 mL of 20X methanol, 150 mL of 20X transfer buffer, and 2,700 mL of dH2O. Cool it down to 4 °C.\nCut 4 pieces of filter paper and one piece of nitrocellulose membrane. Soak the paper filter and membrane in a tray with transfer buffer.\nGently remove the gel from the case and assemble it in the transfer apparatus with filter paper, membrane and sponges. The gel is placed on the negative side and the membrane on the positive side.\nRun transfer at 300 mA, stirring, at 4 °C, overnight.\nBlock the membrane in 10 mL of blocking buffer for 1 h with gentle agitation, at room temperature.\nPrepare primary antibody solution with 10 mL of blocking buffer and 50 µL of dystrophin antibody (1:200).\nDiscard the blocking buffer and add the primary antibody solution. Incubate with gentle agitation for at least 2 h at room temperature or overnight at 4 °C.\nRinse the membrane three times with 0.1% Tween PBS, for 5 min with gentle agitation.\nPrepare secondary antibody solution using 10 mL of blocking solution, 2 µL of anti-rabbit antibody (1:5000), and 20 µL of 0.2% Tween.\nAdd the secondary antibody solution to the membrane. Incubate for 1 h with gentle agitation, covered with aluminum foil to protect from light.",
    "Discard the antibody solution and rinse the membrane 3 times with 0.1% Tween PBS, for 5 min with gentle agitation, protected from light.\nExposure and image the membrane on an imaging device.\nStain the membrane for total protein with Revert 700 Total Protein stain, following manufacturer instructions.\n\t\tNOTE: Dystrophin detection by western blotting depends on the age/mutation of the patient and the cell's ability to fuse and stay attached enough time to accumulate enough dystrophin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}