{
  "id": 1739,
  "origin_website": "Cell",
  "title": "Protocol for scChaRM-seq: Simultaneous profiling of gene expression, DNA methylation, and chromatin accessibility in single cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe scChaRM-seq could be applied to various types of mammalian cells (if a cell contains poly-A tailed mRNA, DNA methylation modification and chromosomes), including cell lines and tissue cells. In this protocol, we took use of mouse embryonic stem cells (ES cells or ESCs) as an example cell line to describe step-by-step method details.\nPreparation single-cell suspension of mouse ESCs\nTiming: 3 days\nRoutine culture of mouse ES cells follows the published protocol (Samuelson and Metzger, 2006[href=https://www.wicell.org#bib8]) under either 2i- or serum- containing media (Ficz et al., 2013[href=https://www.wicell.org#bib4]). Single-cell suspension is prepared during propagation after cell detachment by using trypsin. The viability of mouse ES cells should be above 95% (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1194-Fig2.jpg\nFigure 2. Typical morphology and viability of mouse ES cells\n(A) Clone morphology of mouse ES cells.\n(B) Examination of cell viability by trypan blue staining (CountessTM 3 FL Automated Cell Counter).\nSingle-cell lysis and in vitro GpC methylation\nTiming: 1–2 h\nNote: All the buffer and reaction mixtures should be prepared on ice.\nPrepare lysis & in vitro methylation buffer (LM buffer) for individual cell.\nAdd 2.5 μL LM buffer to each 0.25-mL PCR tube and place the tube on ice.\nManually pick individual cell under the stereo-microscope with mouth-pipette, and transfer single cell into 0.25-mL PCR tube containing ice-cold LM buffer.\nNote: One needs practice to perform step 3. For how to use mouth-pipette to manually selecting single cells, please refer to Lipovsek et al. (2020)[href=https://www.wicell.org#bib7] as a learning example (Lipovsek et al., 2020[href=https://www.wicell.org#bib7]).\nVortex briefly and centrifuge at 1,000× g for 1 min at 4°C, then immediately place the tube back on ice.\nIncubate single cell sample in a thermal cycler at 37°C for 15 min.",
    "After incubation, centrifuge at 7,500 × g for 1 min at 4°C and put the sample back on ice.\nAdd 5 μL of Buffer RLT Plus to each single cell sample.\nVortex briefly and incubate the mixture at 25°C for 5 min.\nQuickly centrifugation (7,500 × g for 30 s) and proceed to the next step, or transfer samples to a −80°C freezer.\nPause point: The in vitro methylated cell samples can be stored at −80°C for several days.\nCritical: Because PMSF is toxic, wear protective gloves, eye/face protection and protective clothing to avoid accidentally inhalation while handling.\nSeparation of mRNA from lysate\nTiming: 0.5–1 h\nFor each barcoded oligo-dT-C1 beads: transfer 10 μL of oligo-dT-C1 beads to a 0.25-mL PCR tube, and place it on a magnetic rack for 1 min, and then remove and discard the supernatant.\nRemove tube from magnetic rack, re-suspend the beads with 10 μL of re-suspend buffer and keep it on ice.\nAdd 10 μL of oligo-dT-C1 beads to the 7.5 μL of single cell lysate.\nVortex briefly and incubate for 10 min at 25°C.\nBriefly spin down the sample on a benchtop mini centrifuge, place the tube on a magnetic rack for 1 min and transfer the supernatant to a new 0.25-mL PCR tube, keep it on ice.\nWash the beads on the magnetic rack once with 30 μL of DNA wash buffer for 5 min and transfer the supernatant to the same tube containing gDNA from a single cell.\nCollect the released gDNA from a single cell (47.5 μL in total) on ice and keep it at −80°C until further processing.\nPause point: The gDNA can be stored at −80°C for several weeks.\nCritical: The mRNA captured on the oligo-dT-C1 beads needs to be processed to the next step immediately.\nReverse transcription",
    "Timing: 2 h\nPrepare the reverse transcription reaction buffer (RT reaction buffer).\nAdd 5 μL of RT reaction buffer to the remaining beads containing mRNA from a single cell.\nVortex briefly and spin down quickly.\nIncubate the reaction in a thermal cycler with a heated lid (105°C), as detailed below:\ntable:files/protocols_protocol_1194_16.csv\nPCR preamplification\nTiming: 3 h\nCentrifuge the RT sample at 7,500 × g for 1 min.\nPrepare the PCR preamplification mixture for a single cell.\nAdd 7.5 μL of PCR preamplification mixture to each single-cell sample. Vortex briefly and spin down quickly.\nPerform the PCR in a thermal cycler (lid temp. 105°C) by using the following program:\ntable:files/protocols_protocol_1194_17.csv\nQuantification the concentration of single-cell cDNA by the Qubit Fluorometer.\nNote: The total number of PCR cycles depends on the RNA content in different type of cells. 18 cycles indicated in this protocol are suitable for mouse embryonic stem cells. The number of cycles can be increased for cells which have limited mRNA (e.g., cumulus cells, 20 cycles) or decreased for cells which have abundant mRNA (e.g., oocytes, 16 cycles).\nPause point: PCR products can be stored at −20°C for several weeks.\ncDNA purification\nTiming: 1–1.5 h\nPool 6 μL of the PCR products from each single-cell sample which are labeled by one of twenty-four different barcodes.\nPurify once with Zymo DNA Clean & Concentrator-5 Kit according to the manufacturer’s protocol, elute in 50 μL elution buffer.\nQuantification the concentration of single-cell cDNA by the Qubit Fluorometer.\nAdd 40 μL of equilibrated AMPure XP beads to each single-cell sample and mix by vortex to make the solution homogeneous.\nIncubate the mixture for 10 min at 25°C to let the DNA bind to the beads.",
    "Place the tube on the magnetic rack for 5 min until the solution is clear and the beads have been collected at one corner of the well.\nCarefully remove and discard the liquid without disturbing the beads. Wash the beads twice with 200 μL 80% (vol/vol) ethanol solution.\nRemove any trace of ethanol and let the beads dry completely (usually 3–5 min).\nBefore removing tube from the magnetic rack, add 30 μL elution buffer. Mix by vortex, incubate the tube off the magnetic rack for 2 min.\nPlace the tube on the magnetic rack and leave it until the solution appears clear and beads have accumulated in a corner of the well.\nCollect the supernatant without disturbing the beads and transfer it to a fresh 1.5-mL DNA LoBind Tube.\nMeasure the concentration of cDNA by the Qubit Fluorometer.\nPause point: Single-cell cDNA can be stored at −20°C for several weeks.\nQuality check of the cDNA\nTiming: 1 h\nCheck the size distribution of the cDNA on a Fragment analyzer. A good cDNA sample should show a peak approximately at 1–2 kb, and the yield of the cDNA sample is approximately more than 50 ng.\nIndexing PCR amplification\nTiming: 1 h\nPrepare the indexing PCR (Table 2[href=https://www.wicell.org#tbl2]) mixture for pooled single-cell cDNA. Use ∼40 ng cDNA as template, add 29 μL of indexing PCR mixture to each single-cell sample to a total volume of 50 μL. Vortex briefly and spin down quickly.\nPerform the PCR in a thermal cycler (lid temp. 105°C) by using the following program:\ntable:files/protocols_protocol_1194_18.csv\nAdd 40 μL of equilibrated AMPure XP beads to PCR products, purify once and elute with 30 μL elution buffer (For detailed steps of purifying DNA with AMPure XP beads, please refer to “cDNA purification[href=https://www.wicell.org#sec3.6]” above).",
    "Quantification the cDNA concentration by the Qubit Fluorometer.\nPause point: PCR products can be stored at −20°C for several weeks.\ncDNA library construction\nTiming: 3 h\nFollowing the manufacturer’s protocol, fragmentation of cDNA sample by the CovarisTM to achieve peak distribution around 300–350 bp. The default programs and settings are pre-installed by the manufacturer, and could be easily selected to use.\nAfter sonication, purify once with Zymo DNA Clean & Concentrator-5 Kit according to the manufacturer’s protocol, elute in 50 μL elution buffer.\nPurify once with 50 μL of equilibrated AMPure XP beads, elute in 50 μL nuclease-free water (For detailed steps of purifying DNA with AMPure XP beads, please refer to “cDNA purification[href=https://www.wicell.org#sec3.6]” above).\nTake 10 μL of Dynabeads™ MyOne™ Streptavidin C1 beads into 1.5-mL tube, wash the beads once with 200 μL 2× B&W buffer on magnetic rack, re-suspend beads with 50 μL 2× B&W buffer by vortex.\nIncubate 50 μL of eluted cDNA sample with re-suspended beads at 25°C for 30 min.\nAfter incubation, put each tube on magnetic rack, then discard the supernatant.\nAdd 100 μL 1× B&W buffer to wash beads, then add 100 μL elution buffer to wash beads again. Re-suspend beads in 50 μL nuclease-free water and keep it on ice.\nFollowing the manufacturer’s protocol of the NEBNext Ultra II DNA Library Prep Kit, then perform “End repair” and “Adapter ligation” steps.\nAfter incubation with the USER enzyme for 15 min, spin down and put each tube on magnetic rack, discard the supernatant.\nAdd 100 μL elution buffer to wash beads, then discard the supernatant.\nRe-suspend beads in 11 μL nuclease-free water.\nPCR amplification\nTiming: 2 h\nAdd 11 μL of adaptor ligated cDNA fragments to 14 μL of NEB final PCR mixture.\nPerform PCR amplification (lid temp. 105°C) as follows:\ntable:files/protocols_protocol_1194_19.csv",
    "Purify the PCR mix twice by equilibrated AMPure XP beads and elute in 30 μL of elution buffer (For detailed steps of purifying DNA with AMPure XP beads, please refer to “cDNA purification[href=https://www.wicell.org#sec3.6]” above).\nMeasure the concentration of RNA library by the Qubit Fluorometer.\nQuality check of the final RNA library\nTiming: 1 h\nCheck the size distribution of the final RNA library on a Fragment analyzer. A good RNA library is approximately more than 100 ng, and usually ranges from 200 bp to 800 bp.\nPurification of genomic DNA\nTiming: 1 h\nPurify the gDNA with 47.5 μL of equilibrated AMPure XP beads (For detailed steps of purifying DNA with AMPure XP beads, please refer to “cDNA purification[href=https://www.wicell.org#sec3.6]” above). Elute gDNA with 10 μL of nuclease-free water, and transfer the gDNA to a new 0.25-mL PCR tube.\nBisulfite conversion of gDNA\nTiming: 3.5 h\nUse EZ-96 DNA Methylation-Direct MagPrep Kit following the manufacturer’s protocol to conduct CT conversion of gDNA from single cell. DNA was bisulfite converted as follows:\ntable:files/protocols_protocol_1194_20.csv\nAdd 10 ng of carrier RNA to each sample before purification and elute DNA with 10 μL of elution buffer.\nIncubate at 55°C for 4 min and transfer 9.25 μL to a new 0.25-mL PCR tube.\nDNA libraries construction by TAILS\nTiming: 5 h\nIncubate the 9.25 μL of bisulfite converted and purified gDNA at 65°C for 3 min; 4°C for pause to stretch the DNA strand.\nAdd 3.25 μL of 1st round priming mixture to each single-cell DNA sample.\nPerform the first random priming as follows:\ntable:files/protocols_protocol_1194_21.csv\nAdd 3 μL of Exo-SAP IT Express to each single-cell sample to remove the remaining primers as follows:\ntable:files/protocols_protocol_1194_22.csv\nAfter incubation, transfer immediately to ice. Add 5 μL of dC tailing mixture to single-cell sample.\nIncubate sing-cell sample as follows:\ntable:files/protocols_protocol_1194_23.csv",
    "After incubation, transfer immediately to ice. Add 5 μL of 2nd round priming mixture to single-cell sample.\nSynthesize the second DNA strands as follows:\ntable:files/protocols_protocol_1194_24.csv\nAfter incubation, transfer immediately to ice.\nPause point: After the second-round priming, samples can be stored at −20°C for 1 day.\nPurification and PCR amplification\nTiming: 1.5–2 h\nPurify the single-cell DNA samples once with equilibrated AMPure XP beads, elute with 12 μL of nuclease-free water and transfer 11 μL to a new 0.25-mL PCR tube (For detailed steps of purifying DNA with AMPure XP beads, please refer to “cDNA purification[href=https://www.wicell.org#sec3.6]” above).\nAdd 14 μL DNA final PCR mixture to the 11 μL of purified DNA sample, vortex and spin down briefly.\nPerform the PCR amplification (lid temp. 105°C) as follows:\ntable:files/protocols_protocol_1194_25.csv\nPooling and gel recovery\nTiming: 2–2.5 h\nPooling the PCR products together: 12.5 μL of each single-cell's DNA for 24 samples.\nPurify with Zymo DNA Clean & Concentrator-5 Kit according to the manufacturer’s protocol, elute in 20 μL of nuclease-free water.\nAfter 1.5% agarose electrophoresis, recover the DNA between 400-bp and 1,000-bp by using the Zymoclean Gel DNA Recovery Kit according to the manufacturer’s protocol.\nPurify the DNA with equilibrated AMPure XP beads, elute with 20 μL of elution buffer (For detailed steps of purifying DNA with AMPure XP beads, please refer to “cDNA purification[href=https://www.wicell.org#sec3.6]” above).\nQuality check of the final DNA library\nTiming: 1 h\nQuantify the libraries and check the size distribution with a Fragment Analyzer. The yield of the DNA library is approximately more than 30 ng, and the size distribution is between 400 bp and 1 kb."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Molecular Biology",
    "Gene Expression",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}