{
  "id": 4960,
  "origin_website": "Bio",
  "title": "Synaptoneurosome Preparation from C57BL/6 Striata",
  "procedures": [
    "Note: This technique has been used to evaluate biochemical changes after pharmacological treatments in synaptoneurosome preparations of the striatum (Biever et al., 2015). However, the same protocol can be applied to other brain regions or after the performance of behavioral paradigms. Kill the mouse by cervical dislocation or decapitation and rapidly immerse the head in liquid nitrogen for 4 sec to rapidly cool down the brain without allowing it to freeze (this step helps for the brain dissection and to better preserve protein phosphorylation). We recommend to euthanize the mouse with physical methods such as cervical dislocation rather than using anesthetics or carbon dioxide, but this step should be adapted to local ethical committee guidelines. Remove the brain, remove the meninges, and dissect the striatum of the 2 hemispheres (≈15-20 mg) on an ice-cooled glass dish as it is shown in Video 1.     <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Striatum extraction  Homogenize the striata in a glass dounce homogenizer (10 strokes of the loose pestle followed by 10 strokes of the tight pestle) with 1 ml of synaptoneurosome buffer kept on ice. The number of strokes might vary depending on the individual homogenizer/pestles and the size of the brain area. All the steps are performed at 4 °C (either on ice or in a 4 °C room). Representative pictures of the homogenates at each step are shown in Figure 1.Transfer the homogenate into an Eppendorf tube and aliquot 100 μl as an input.Prepare all the material required for the synaptoneurosome preparation procedure as indicated in Figure 2.Pre-wet 3 Nylon net filters (100 μm pore) in synaptoneurosome buffer on ice.Attach a 5 ml syringe without the plunger (syringe #1) to a swinnex filter holder (#1) containing the 3 pre-wetted Nylon net filters (100 μm), as illustrated in Figure 3.",
    "Then, attach this swinnex to another 5 ml syringe (syringe #2) without the plunger, which has been attached at the dispensing tip end to a swinnex filter holder containing 1 Mitex membrane filter (10 μm pore) (swinnex filter holder #2). Place on the other side of the swinnex #2 a 1.5 ml Eppendorf tube on ice to collect the sample.With a 1-ml pipette, load the sample into the end of the barrel of the syringe #1 attached to a swinnex filter holder #1, insert the plunger and push down on the plunger until all the air is gone from the syringe.Remove the 5 ml syringe #1 and replace it by a 60 ml syringe with the plunger being pulled back. Once attached to the swinnex filter holder #1 containing the 3 Nylon net filters (100 μm), push down on the plunger until all the air is gone from the syringe. This step helps to push down the sample to the barrel of syringe #2.Remove the swinnex filter holder #1 containing the 3 Nylon net filters (100 μm), place the plunger of the 5 ml syringe #2, which is connected to the swinnex filter holder #2 containing 1 Mitex membrane filter (10 μm), and push down until all the air is gone from the syringe. Remove the syringe #2 and replace it with a 60 ml syringe with the plunger being pulled back. Once attached to the swinnex filter holder #2, push down on the plunger until all the air is gone from the syringe. At this step, the homogenate should be in the 1.5 ml Eppendorf tube placed on ice.Centrifuge 1 min at 4,000 x g at 4 °C. Pipette the supernatant into a new Eppendorf tube and discard the pellet.",
    "A representative image of how the pellet looks is shown in Figure 1b.Centrifuge the supernatant for 4 min at 14,000 x g at 4 °C. Discard the supernatant and resuspend the pellet in 100 μl synaptoneurosome buffer. A representative image of how the pellet looks is shown in Figure 1c. (The volume to re-suspend the pellet might change depending on the protein concentration desired. From the striata of one mouse the synaptoneurosome preparation obtained has a protein concentration around 1-2 μg/μl). The pellet can be stored at -80 °C until used. Note: In this type of synaptoneurosome preparation we obtained samples containing enrichment of both presynaptic and postsynaptic markers, a substantial reduction of glial markers and absence of nuclear markers (Biever et al., 2015). Moreover, phospho-proteins can be detected as shown in Figure 4."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}