{
  "id": 10385,
  "origin_website": "Jove",
  "title": "Pancreatic Tissue-Derived Extracellular Matrix Bioink for Printing 3D Cell-Laden Pancreatic Tissue Constructs",
  "procedures": [
    "Porcine pancreatic tissues were collected from a local slaughterhouse. Animal experiments were approved by the Institutional Animal Care and Use Committee (IACUC) of Asan Medical Center, Seoul, Korea.\n1. Tissue decellularization\nPrepare the solutions for decellularization.\n\tNOTE: 1x phosphate-buffered saline (PBS) used in all solution preparations is diluted by adding distilled water to 10x PBS.\n\t\nFor the 1% Triton-X 100 solution, dissolve 100 mL of 100% Triton-X 100 solution in 900 mL of 1x PBS using a magnetic stir bar with the stirring at 150 rpm for 6 h. Make 400 mL of 1% Triton-X 100 solution with 40 mL of 10% Triton-X 100 solution and 360 mL of 1x PBS prepared just before use.\n\t\tNOTE: The 10% Triton-X 100 solution can be stored at room temperature until needed.\nFor the 0.1% peracetic acid solution, dilute 8.5 mL of 4.7% peracetic acid into 22.8 mL of 70% ethanol with 368.7 mL of distilled water just before use.\nRemove the peripheral tissues of the pancreas and slice the tissue before decellularization.\n\t\nWash the resected porcine pancreas with running tap water and remove the peripheral tissues using sterilized scissors.\nTransfer the pancreas into a plastic bag with forceps and freeze at -80 °C for 1 h to help cut the pancreas effectively for the next step.\nSlice the frozen pancreas into 1 mm thick pieces using a grater.\nTransfer 50 g of the sliced tissue into a 500 mL plastic container.\n\t\tNOTE: A plastic container with a lid is recommended here to protect tissues from contamination and prevent solution evaporation.\nTreatment with reagents.",
    "NOTE: The entire decellularization process should be carried out at 4 °C on a digital orbital shaker at 150 rpm. In all decellularization steps, physical detachment using forceps is required to prevent the slices of pancreas from sticking together. Washing the container with distilled water is necessary to remove the residual reagents completely in the container.\n\t\nBefore any reagent treatment, wash 50 g of sliced pancreas with 300 mL of distilled water using a shaker.\nStir the tissue continuously at 150 rpm until the cloudy water disappears (after approximately 12 h). Replace the distilled water every 2 h.\n\t\tNOTE: Changing the distilled water every hour is recommended for efficiency to remove the cloudy water more quickly.\nDiscard the water and treat the 50 g of tissues with 400 mL of 1% Triton-X 100 in 1x PBS solution for 84 h. Refresh the solution every 12 h.\n\t\tNOTE: At this point, the amount of tissue will decrease because the cellular components start being removed.\nTreat with 400 mL of isopropanol (IPA) for 2 h to remove the remaining fat from the pancreas.\n\t\tNOTE: It is normal for the tissue to become tough due to the removal of fat in this process.\nAfter 2 h, remove the IPA and wash the tissue with 400 mL of 1x PBS for 24 h. Refresh the 1x PBS every 12 h.\nTo sterilize the decellularized tissue, discard the previous solution and treat with 400 mL of 0.1% peracetic acid in 4% ethanol for 2 h.\nTo remove residual detergent, wash the tissue with 400 mL of 1x PBS for 6 h. Refresh the solution every 2 h.\nCollect the decellularized tissues in a 50 mL conical tube with forceps.",
    "Freeze the sample at -80 °C for 1 h. Cover the conical tube with a lint-free wipe instead of the lid and fix with a rubber band for efficient lyophilization.\nLyophilize the decellularized tissue at -50 °C for 4 d.\n\t\tNOTE: For step 1.3, 1 g of non-decellularized tissue should also be freeze-dried under the same conditions.\n2. Assessment of decellularized tissues\nNOTE: To evaluate the residual amount of dsDNA, glycosaminoglycans (GAGs), and collagen in the decellularized tissue compared to native tissue, at least 1 g of each of the non-decellularized tissue (native tissue) and decellularized tissue are required for one batch of assessment. The amount of dsDNA, GAGs, and collagen can be calculated based on the dry weight of the tissue.\nPrepare solutions for biochemical assays.\n\t\nPrepare papain solution for sample digestion.\n\t\tNOTE: The amount of buffer to be made can be adjusted according to the number of samples.\n\t\t\nDissolve 119 mg of 0.1 M sodium phosphate (monobasic), 18.6 mg of 0.5 mM Na2-EDTA, and 8.8 mg of 5 mM cysteine-HCl in 10 mL of autoclaved water.\nAdjust the pH of the solution to 6.5 by adding 10 M NaOH solution.\nAdd 125 µL of 10 mg/mL papain stock solution to the above solution and vortex, allowing each element to mix evenly.\nPrepare solutions for dimethyl-methylene blue (DMMB) assay.\n\t\t\nTo make DMMB dye, dissolve 8 mg of 1,9-dimethyl-methylene blue zinc chloride double salt, 1.52 g of glycine, and 1.185 g of NaCl in 500 mL of autoclaved water. Adjust the pH to 3 by adding 0.5 M HCl solution while measuring the change of pH using a bench-top pH meter. Then, filter this through a 500 mL bottle-top vacuum filter.\nMake 15 µL of 10 mg/mL chondroitin sulfate A solution for standard.\nPrepare solutions for hydroxyproline assay.",
    "For the chloramine working solution, dissolve 2.4 g of sodium acetate, 1 g of citric acid, and 0.68 g of sodium hydroxide in 24 mL of distilled water and add 240 µL of glacial acetic acid, 10 µL of toluene, and 6 mL of IPA.\n\t\t\tNOTE: Dissolve all powders in solution using a vortex mixer. Chloramine working solution can be stored at 4 °C for up to three months.\nFor chloramine T solution, dissolve 0.35 g of chloramine T in 20 mL of chloramine working solution and add 2.5 mL of IPA. Vortex to mix all components.\n\t\t\tNOTE: Prepare immediately before use.\nFor P-DAB solution, put 3.75 g of P-DAB into 6.5 mL of perchloric acid and 15 mL of IPA; wrap it in aluminum foil.\n\t\t\tNOTE: Prepare immediately before use.\nAdd 1 mL of papain solution to 10 mg of lyophilized tissue in a 1.5 mL microcentrifuge tube and vortex the tube to better digest the sample.\nPlace the 1.5 mL microcentrifuge tube in a rubber rack and digest the samples in a 500 mL beaker that contains 300 mL of water at 60 °C for 16 h.\nCentrifuge at 9,500 x g for 20 min, collect the supernatant, and transfer it into a new tube.\nQuantify the residual DNA and major proteins in the decellularized tissue.\n\t\nLoad 1 µL of digested sample into the spectrometer and measure the amount of dsDNA according to the manufacturer's instructions.\n\t\tNOTE: The experimenter should tie their hair back and wear a mask to avoid contaminating the sample.\nPerform a DMMB assay to quantify the amount of GAGs that remains in the decellularized tissue.",
    "Mix 1 µL of chondroitin sulfate A solution and 499 µL of 1x PBS to make standards. Dilute the chondroitin sulfate A solution with distilled water at concentrations of 0, 4, 8, 12, 16, and 20 µg/mL.\nLoad triplicates of 50 µL of each concentration of the standard and digested samples into a 96-well plate.\nAdd 200 µL of the DMMB dye to each well using a multi-channel pipette.\nImmediately read the absorbance at 525 nm on a microplate reader.\nPerform a hydroxyproline assay to quantify the amount of collagen.\n\t\nTo conduct a hydroxyproline assay, incubate 250 µL of digested sample with equal volumes of HCl at 120 °C for 16 h.\nDry the residues at room temperature for 3 h to cool the samples and then re-dissolve the samples in 1 mL of 1x PBS.\nCentrifuge at 2,400 x g for 10 min at 4 °C.\nPrepare 100 µg/mL hydroxyproline solution as standard.\nDilute hydroxyproline solution with distilled water at a concentration of 0, 1, 2, 3, 4, 5, 6, 8, 10, 15, 20, 30 µg/mL for a standard solution.\nLoad triplicates of 50 µL of samples and standard solution into a 96-well plate.\nAdd 50 µL of Chloramine T solution then incubate for 20 min at room temperature.\nAdd 50 µL of p-DAB solution and incubate for 30 min at 60 °C.\n\t\tNOTE: Aliquot in a dark room. After the addition, wrap the plate with aluminum foil.\nIncubate at room temperature for 30 min.\nAfter cooling, measure the absorbance at 540 nm on a microplate reader.\n3. Bioink preparation",
    "NOTE: pdECM powder can be stored stably at -80 °C for at least one year. Before pH adjustment, the digested pdECM solution can be stored at -20 °C for one month. Prior to use, thaw the sample of frozen pdECM solution at 4 °C overnight. The pH-adjusted pdECM solution can be stored at 4 °C for up to one week. The digested pdECM solution can be stored at 4 °C for at least a few days but should not exceed 1 week.\nDigest the freeze-dried pdECM with pepsin.\n\t\nFor effective digestion of bioink, pulverize the lyophilized pdECM with liquid nitrogen using a mortar and pestle.\nCollect 200 mg of the pdECM powder in the 50 mL conical tube and add 20 mg of the pepsin and 8.4 mL of the 0.5 M acetic acid (final concentration is 2 w/v%).\nPlace the magnetic stir bar in the 50 mL conical tube and stir at 300 rpm for 96 h.\nAdjust pH of digested pdECM solution.\n\tNOTE: In order to avoid gelation before pH adjustment, this process should be conducted on ice.\n\t\nFilter out the undigested particles in the pdECM solution using a 40 µm cell strainer using a positive displacement pipette on ice to obtain the optimal digestion of parts.\nAdd 1 mL of the 10x PBS and vortex before using NaOH.\nAdjust the pH to 7 with 10 M NaOH checking the pH with pH indicator strips.\n\t\tNOTE: Vortex each time NaOH is added so that the bioink is thoroughly mixed with the other reagents.\n4. Rheological analysis\nExperimental setup\n\t\nPrepare the 1.5% (w/v) of pdECM bioink to assess the rheological properties.\nEstablish a 20 mm cone plate geometry (cone diameter of 20 mm with a 2° angle) in rate-controlled mode of a rheometer.",
    "Create experimental sequences in the installed software (TRIOS) to measure the viscosity, gelation kinetics, and dynamic modulus of the pdECM bioink.\n\t\t\nViscosity: Place the pdECM bioink on the plate. Measure complex viscosity (Pa·s) of pdECM bioink under an increasing shear rate from 1 to 1,000 s-1 at a constant temperature of 15 °C.\nGelation kinetics: Place the pdECM bioink on the plate. Calculate the complex modulus (G*) by measuring the storage and loss modulus of pdECM bioink at 4-37 °C with an incremental increase rate of 5 °C/min (time-sweep mode).\nDynamic modulus: Place the pdECM bioink on the plate at 37 °C for 60 min prior to measurement. Measure the frequency-dependent storage modulus (G') and loss modulus (G'') of the pdECM bioink in the range of 0.1-100 rad/s at 2% strain.\n5. 3D cell printing of pancreatic tissue constructs using islet\nPreparation of isolated islets\n\t\nIsolate primary islets from a rat according to the protocols described in a previous work5.\nTo separate debris and dead cells from the isolated islet, pass the cell suspension through a 70 µm cell strainer. Islets with a diameter smaller than 70 µm are considered dead or abnormal.\nSuspend the isolated islets in RPMI-1640 medium and place them on the petri dish. Remove islets larger than 300 µm in diameter by using a P200 volume pipette under the microscope (4x objective lens) in the biosafety cabinet.\nIslet encapsulation into pdECM bioink\n\t\nPrepare pH adjusted pdECM bioink and isolated islet.\n\t\tNOTE: To avoid gelation before pH adjustment, this process should be performed on ice.\nGently mix the the pdECM bioink and the media suspended with islets (ratio 3:1) using a positive displacement pipette until uniformly mixed.",
    "NOTE: The final concentration of the pdECM bioink is 1.5% and the cell density in the pdECM bioink is 3,000 IEQ/mL.\n3D cell printing of pancreatic tissue constructs\n\t\nPrepare a sterilized syringe and 22 G nozzle.\n\t\tNOTE: This gauge was selected for printing islets with a diameter of 100-250 µm.\nLoad islet-laden pdECM bioink into the syringe.\nPrint the bioink with the optimized printing condition (feed rate: 150 mm/min; pneumatic pressure: 15 kPa) at 18 °C in the shape of a lattice.\nTo crosslink the bioink, place the printed construct in the incubator for 30 min.\nImmerse the printed construct into the islet culture media which is RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS), 100 U/mL penicillin and 100 U/mL streptomycin.\n6. 3D cell printing of pancreatic construct with patterned structure\nPreparation of two types of the bioink\n\t\nTo validate the printing versatility using multiple bioinks, prepare two sets of pdECM bioinks and stain them by adding 0.4% Trypan Blue and Rose Bengal solution into each pdECM bioink at a ratio of 1:20, respectively.\n\t\tNOTE: To avoid gelation before pH adjustment, this process should be conducted on ice.\nGently mix the the pdECM bioink and the media suspended with islets (ratio 3:1) using a positive displacement pipette until uniformly mixed.\n\t\tNOTE: The final concentration of the pdECM bioink is 1.5% and the cell density in the pdECM bioink is 3,000 IEQ/mL.\n3D cell printing of multimaterial-based pancreatic tissue constructs\n\t\nPrepare sterilized syringes and a 25 G nozzle.\nLoad each bioink (blue and red) into two different syringes, respectively.\nPrint the bioink with optimized printing condition (feed rate: 150 mm/min; pneumatic pressure: 15 kPa) at 18 °C in a shape of a lattice with alternating lines of blue and red.",
    "To crosslink the bioink, place the printed construct in the incubator for 30 min.\nImmerse the printed construct into islet culture media which is RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS), 100 U/mL penicillin and 100 U/mL streptomycin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}