{
  "id": 9329,
  "origin_website": "Jove",
  "title": "A Method to Make a Craniotomy on the Ventral Skull of Neonate Rodents",
  "procedures": [
    "The following protocol follows the animal care guidelines established by the Institutional Animal Care and Use Committee (IACUC) at The City College of New York.\n1. Animal Intubation (10-20 min)\nPrior to surgery, prepare mammalian Ringer solution. Assemble the surgical tools, heating pad, and small animal ventilator on the bench (Figure 2).\n\t\nFor measurements of blood brain barrier permeability make 10 ml of 1% bovine serum albumin (BSA) solution in Ringer and dissolve TRITC-dextran 155 kD at 8 mg/ml in 1% BSA solution, filter solution with 25 mm syringe filter (0.2 μm pore size) and store in a foil-covered syringe in the dark.\nAnesthetize the animal using isoflurane. Use 5.0% for induction and 1.5-3.0% for maintenance. Alternatively a mixture of ketamine (41.7 mg/kg) and xylazine (2.5 mg/kg body) can be used. Depth of anesthesia can be checked by toe pinch reflex of upper and lower extremities.\n\t\nSubsequent doses of ketamine (41.7 mg/kg body weight) and xylazine (2.3 mg/kg body weight) should be administered in increments of ⅓ of the maximum dose to avoid overdosing. Use of a rodent ventilator is recommended to counteract xylazine-induced respiratory depression.\nPlace the anesthetized pup lying on its dorsal side and secure its head with the plastic cone used to deliver the anesthetic (Figure 3a).\n\t\nSecure the animal with adhesive tape on the fore limbs and tail (Figure 3a).\nAn alternative to secure the pup’s head is to use a head plate attached to a metal bar.\nNote: Make sure the heating pad is set to 37 °C to avoid hypothermia (Figure 3a).\nUse scissors (Figure 2b) to make one longitudinal and four lateral incisions on the skin overlying the neck (Figure 3b). Using blunt technique, dissect the skin and place it aside using forceps (Figures 2c and 3c).",
    "Hold the skin down using adhesive tape. Stabilize the head in a horizontal position (Figure 3c).\nUsing spring scissors (Figure 2d) and blunt technique, push glands and fat layers aside to expose the trachea (Figure 3c). Identify the location of the carotid arteries.\n\t\nKeep the carotid arteries away from the trachea.\nNote: Puncturing the carotids can result in massive blood loss and death of the pup.\n Using spring scissors (Figure 2d) dissect the longitudinal muscles covering the trachea. Cut the longitudinal muscles located under the trachea (Figure 3d).\nNote: The tracheal rings should be clearly visible (Figure 3e).\n\t\nUsing forceps (Figure 2c), tie two pieces of suture around the trachea. One piece of suture will secure the ventilation tube and the second thread will be used to close the trachea rostral to the ventilation tube insertion point (Figure 4a).\nNote: Moisten exposed tissue regularly with Ringer solution to prevent dehydration.\nUsing spring scissors (Figure 2d) make an incision on one of the tracheal rings located between the two threads placed in step 1.6.1 (Figure 4c).\nNote: Make sure that no fluid enters the open trachea. Fluid in the trachea will cause asphyxiation.\nInsert the intubation tube (Figure 4b) into the trachea and tighten the lower thread to secure it. Using forceps (Figure 2c), tighten the upper thread to close the trachea posterior to the insertion point of the intubation tube.\n\t\nTighten and trim the ends of the two threads (Figure 4d-f).\nNote: Vapor inside the intubation tube is a good sign of airflow control.\nPromptly switch the isoflurane supply to the ventilator. Adjust the stroke volume and the ventilation rate according to the weight of the animal.\n\t\nSeal the exposed surrounding tissue with elastomer (Figure 5a). Keep the surface moistened and clean.",
    "2. Trachea and Muscle Removal to Expose the Cranium (5-10 min)\nUse spring scissors (Figure 2d) to cut the trachea adjacent to the ventilation tube. Perform two cuts along the muscle wall of the buccal cavity to expose the caudal end of the palate (Figure 5b).\nNote: If necessary, use a cauterizer to stop bleeding. Uncontrolled bleeding will cause death of the animal.\nClean the area using copious amounts of Ringer solution (Figure 5c). Identify the gap between the last vertebrae and the basi-occipital bone (Figure 5d).\nNote: The gap between the bones is a useful skull landmark to locate brainstem structures. The inferior olive is located under this gap. The auditory superior olivary complex is located under the basi-occipital bone in the rostral direction from this gap (see also Figure 1).\nClean the area using forceps (Figure 2c) and spring scissors (Figure 2d). Do not puncture blood vessels.\nNote: If necessary, cauterize to stop bleeding.\n\t\nAfter the exposed area is clean of fat and muscle tissue, the space separating the basi-occipital bone and the last vertebra should be visible (Figure 5d).\n3. Craniotomy (15-30 min)\nUse a microdrill or an ultrasonic cleanser. Locate the medial wall of the bulla.\n\t\nThin the skull by making an inverted D shape until the underlying arteries are visible (Figure 5e).\nNote: The basilar artery (bas) runs on top of the brainstem midline. The anterior inferior cerebellar artery (aica) branches bilaterally and can be used reliably as a landmark as it has a constant position in different animals.\nWhen the skull is thinned, gently break it using a dissecting chisel (Figure 2e). Remove the bone piece with forceps (Figure 2c). Alternatively, lift and break the skull using a bent needle.",
    "Note: Repeat this procedure until the size and shape of the craniotomy is appropriate for the planned experiment. The bas and aica should be visible through the dura membrane (Figure 5f).\nClean the area several times with fresh Ringer solution. Using absorbent pads dry the surface of the dura membrane.\n\t\nIf necessary, use a suture needle to remove the dura membrane without displacing or breaking the landmark arteries bas and aica.\nNote: Upon dura puncturing cerebrospinal fluid will flow out. Clean the area with Ringer solution and keep moistened throughout the experiment.\n4. Electrophysiology Experiment\nSelect the polytrode according to experiment design (Figure 7a). Use a fine paintbrush to coat the polytrode with DiI. Transfer the DiI solution into a 1 ml microcentrifuge tube, dip the paintbrush in the solution and gently strike the polytrode under visual guidance (i.e. using a stereoscope). Start at the tip of the probe and carefully continue until all electrodes are coated uniformly.\n\t\nPlace the ground electrode inside the oral cavity. Load the polytrode into the electrode holder (Figure 7b).\nTurn the amplifier on and check that all connections work well.\nPosition the electrode above bas at the branch point of aica (position zero). Move the electrode to the desired target point by using the appropriate rostral-lateral coordinate (Figure 7c).\n\t\nPlace the electrode on the brain surface and move it to the desired depth in steps of 5-10 μm.\nPerform recording according to experimental design. Save data for further analysis.\n5. Two-photon Imaging Experiment\nTurn on the microscope. Set the excitation wavelength and use an appropriate emission filter. Excitation at 800 nm and a 607 ± 45 nm band-pass emission filter work well for imaging TRITC-dextran.",
    "Identify the right or left carotid artery. Using blunt technique dissect the carotid artery from the adjacent connective tissues or nerves.\n\t\nPick and hold the carotid artery with a hemostat. Tie three pieces of suture around the carotid artery.\nTighten the thread closer to the heart side to stop the blood flow and leave the other two threads loose.\nUse fine scissors to make a small cut at a 45° angle on the carotid artery between the tied thread and the next loose thread.\nNote: Clean the blood with absorbent paper.\nCannulate the carotid artery. Insert the tubing filled up with TRITC-dextran solution into the cut on the carotid artery about 5 mm deep oriented towards the pup’s head.\n\t\nTighten the other two threads around the artery to hold the tubing and the artery together. Tighten the threads, trim and add elastomer to further stabilize.\nNote: The other side of the tubing is connected with the syringe containing TRITC-dextran solution (prepared in step 1.1).\nFix the syringe on the syringe pump.\n\t\nSet the speed at the carotid artery blood flow rate of the pup. Turn on the syringe pump for a few seconds and check manually that the dye solution can be injected into the carotid artery. Note: Assuming that blood flow rate in the carotid artery of adult rats (240-280 g) is about 3 ml/min14, the blood flow rate for a rat pup (e.g. P10 pup weighing 15-25 g) can be calculated to range from 0.16-0.3 ml/min.\nPlace the animal under the microscope objective. Inject the fluorescent dextran into the bloodstream.\n\t\nIdentify areas of interest on the ventral brainstem with a 5X air objective. Switch to a 20X or 40X objective  (water immersion, NA = 0.5 or 0.8, respectively) to focus the region of interest (ROI).",
    "Start imaging and adjust the image acquisition parameters (e.g. exposure time, laser power, detector gain) until the fluorescence intensity in the vasculature of the ROI is optimized (i.e. not too low but not to saturated).\nTurn on the syringe pump to inject the dye solution into the carotid artery and acquire a time series at a fixed focal plane.\n6. Animal Care Following Procedure\nThis is a terminal procedure. At the end of an experiment animals must be euthanized with an overdose of Pentobarbital (100 mg/kg, intraperitoneal injection) or any other method of euthanasia approved by American Veterinary Medical Association Euthanasia Guidelines. \nNote: Perfusion through the heart with Ringer solution followed with a fixative solution is recommended for further histological analysis."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}