{
  "id": 18784,
  "origin_website": "Jove",
  "title": "Ultrasound-guided Transthoracic Intramyocardial Injection in Mice",
  "procedures": [
    "All described steps were performed under protocols approved by the Institutional Animal Care and Use Committee of Boston Children’s Hospital.\n1. Preparation\nPerform baseline cardiac anatomical and functional assessment by echocardiography prior to beginning the injection protocol, as the optimal fixed transducer position for intramyocardial injection may not yield the optimal standard views for delineating anatomy and assessment of function.\nThe injection setup is shown in Figures 1A-1C. Place an empty syringe with a sheathed needle, bevel oriented upwards, in the syringe clamp (see Figure 1C) and secure the ultrasound transducer probe in the scan-head clamp (see Figure 1B). Loosen the scan-head clamp ball lock joint (Figure 1B) and manipulate the transducer orientation so that it is aligned parallel to the axis of the needle. Fix the scan-head position by tightening the scan-head clamp ball lock joint.\n\tNOTE: For injection in adult mice, a 30 G needle with a 1 in/2.5 cm length is optimal. A 1 ml syringe can be used for larger volumes, while a gastight syringe can be used for more precise control of smaller volumes (5-10 µl).\nApply ultrasound gel liberally to the transducer tip with a spatula to cover the head along its entirety. Carefully unsheathe the needle and use the needle mount controls to advance the needle directly under the transducer and within the ultrasound gel for visualization. Make minor adjustments using the needle mount control so that the needle is visualized clearly along its length on the ultrasound image. If the transducer was properly aligned parallel to the needle in step 1.4, then the needle should remain within the imaging plane as it is advanced and withdrawn with the injection control knob (Figure 1C).",
    "In subsequent steps, do not disturb the needle/transducer horizontal alignment by moving either in the horizontal axis. Rather, target specific areas of the heart for injection by changing the vertical (y-axis) position of the needle mount and by moving the animal platform.\nMove the transducer superiorly from the animal platform using the scan height control (Figure 1B) to allow subsequent placement of the anesthetized mouse onto the animal platform. This will not disrupt the x-axis alignment of the transducer to the long axis of the needle.\nRemove the syringe that was used for alignment from the syringe clamp and discard carefully. Load the new needle and syringe with the injectate to the final target volume, allowing for dead space in the syringe tip. Be careful to remove air bubbles. Place the syringe into the syringe clamp without adjusting its x-axis alignment. Fully retract the syringe using the injection control.\n\tNOTE: For initial training purposes, the use of Evan’s blue dye (1%), Trypan blue stain (0.4%) or a suspension of fluorescent microspheres as the injectate can assist the operator in confirming competency and success of targeted injection.\n2. Injection\nTurn on the integrated warmer of the heating platform and set it for 37 °C. Place the animal platform 180° from the usual imaging orientation, with the anesthesia hose clamp and head of the animal closest to the operator. This allows the heart (in the left side of the chest) to be ipsilateral to the syringe clamp and needle. Note: Additional minor clockwise rotational adjustments to the animal platform may be necessary to orient the heart correctly for the parasternal short axis imaging plane that will be used for injection (Figure 2A).",
    "Prepare mice for echocardiography as previously reported9. Anesthetize the mouse in an induction chamber with 2% isoflurane. Remove chest hair with hair removal cream and apply lubricating gel to both eyes to prevent drying of the sclera.\nRaise the transducer using the scan head height control (Figure 1B). Place the anesthetized mouse supine atop the heated animal platform with the snout within a nose cone delivering 1-3% isoflurane (Figures 2A-2B). Gently insert a rectal probe and tape the four paws to the ECG electrodes, applying electrode gel for electrical contact.\n\tNOTE: An appropriate level of anesthesia must be ensured for the humane treatment of the animal. There should be no change in heart rate and no response to placement of the needle through the chest wall. The animal platform’s integrated homeostatic temperature controls should be used to maintain normothermia (37 ± 0.5 °C), as hypothermia will result in relative bradycardia, ventricular dilatation, and possible discomfort.\nOnce the mouse is secure on the animal platform, lower the transducer onto the depilated chest using the scan head height control (Figure 1B). The optimal ultrasound setup for injection is for the heart to be visualized in the parasternal short axis orientation, as per standard echocardiographic technique. Rotate the animal platform 20-30° clockwise to obtain the optimal acoustic window for injection in the short axis imaging plane (Figures 2A-2B). Note: Alternatively, injection can be performed from a parasternal long axis orientation by counter-clockwise rotation of the animal platform (Figure 2C).",
    "Use the animal platform adjustment controls to adjust the field of view and to target any desired injection site in the left ventricular myocardium. Pan back-and-forth from the apex to the base of heart to target the desired injection location in the left ventricular myocardium (Figures 3A-3C). Note: The midpapillary parasternal short-axis view (Figure 3A) offers reproducible landmarks that permit followup imaging of the injection site. Note: Alternatively, the parasternal long axis view can be used to target a predefined injection site (Figure 3D).\nStarting with the syringe in the fully retracted syringe clamp, slowly advance the syringe towards the animal’s chest by turning the injection control clockwise (Figure 4A). To permit clear ultrasound visualization of both the heart and the needle tip as it approaches the chest, use plenty of ultrasound gel over the left side of the chest and optimize the acoustic window by setting a wide field of view on the echocardiography controls. Set the focal point/zone at the target site for injection. Minor adjustments to the needle mount controls can optimize the image of the needle along its length.\n\tNOTE: Some ultrasound machines have a needle guide software function to digitally extend a line along the long axis of the needle through to the target myocardium (Figure 4B). Such a software tool can be helpful but is not essential.\nWith the animal appropriately sedated (1-3% isoflurane mixed with 0.5-0.8 L/min 100% oxygen), advance the needle through the chest wall of the mouse and into the myocardium, carefully observing the position of the beveled needle tip at all times. Stop advancing when the needle tip is within the target myocardium (Figure 4C). The whole beveled tip should be securely within the myocardium, to avoid injectate leak into the pericardial space.",
    "When the tip is in the desired location, deliver the injectate by pushing on the syringe plunger. Deliver the injectate slowly, over 5-30 sec (depending on the volume being delivered). Up to 50 µl of injectate can be delivered without compromising ventricular function. A transient echobright appearance to the injected myocardial region may be evident after successful injection. A brief (seconds) period of relative bradycardia is occasionally noted with injection into the myocardium and quickly resolves.\nOnce the injectate has been administered, promptly withdraw the needle by counter-clockwise rotation of the injection control knob. The mouse should be kept under anesthesia for several minutes of echocardiographic observation to confirm preserved ventricular function and no postprocedural complications. If indicated, multiple regions of myocardium can be serially injected by repositioning of the needle’s angle of approach by adjustment of the animal platform. After intramyocardial injection, the mouse is placed in a cage on its own and allowed to recover from anesthesia under observation.\nDo not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency. Do not return an animal that has undergone intramyocardial injection to the company of other animals until fully recovered. The cage should be placed on a thermoregulated pad with ready provision of water and mouse diet. Postprocedural discomfort is not expected and failure to appropriately resume normal behavior shortly after intervention suggests a potential complication (see Discussion).\nCarefully discard the needle immediately after completion of intramyocardial injection to minimize the risk of sharps injury to the operator or bystanders. Reusing a needle can result in blunting of the tip making it more challenging to pierce the myocardium and resulting in a higher risk of complication.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}