{
  "id": 6722,
  "origin_website": "Bio",
  "title": "Automated Analysis of Cell Surface Ruffling: Ruffle Quantification Macro",
  "procedures": [
    "Cell cultureCreate a suspension of your cell line choice.Determine cell concentration using hemocytometer and dilute to a concentration 0.1 x 106 cells/ml in tissue culture medium (Recipe 1).Place one coverslip into each well of 24-well tissue plate.Add 500 μl of diluted cell suspension (0.5 x 105 cells) to each well.Note: Desired confluency the next day = 60%. Press coverslip into base of well using forceps to remove any air bubbles that have formed under the coverslip.Allow cells to adhere and spread out overnight (at least 16 h) prior to experiments.Note: For longer treatment or transient transfection, lowering the initial cell seeding density may be required (60% confluency on day of fixation is desirable). Perform stimulation/pharmacological inhibition experiment as required.Note: We routinely use 10-100 ng/μl lippopolysaccharide for 30 min to induce ruffle formation. Aspirate media and wash with ice cold PBS.Fix cells for at least 30 min with 4% Paraformaldehyde.Thrice wash cells with room temperature PBS.Staining coverslipsPlace a wet paper towel into the base of the staining chamber.Lay out parafilm on top of wet paper towel.Remove coverslips from 24-well plate and place cell-side up onto parafilm.Add a drop of PBS onto each coverslip.Note: Coverslips should be kept ‘wet’ at all times to ensure cell integrity and to prevent dehydration. Permeabilise cells by placing a drop of 0.1% Triton X-100 onto each coverslip for no more than 5 min.Wash coverslips with PBS three times by aspiration.Prepare AlexaFluor 488-Phalloidin and DAPI (2 mg/ml) labelling mix by diluting stock solutions 1:500, and 1:1,000 respectively into ice cold PBS.Place a 50 μl drop of labelling mix onto parafilm adjacent to each coverslip.Aspirate PBS from coverslip and invert the coverslip onto the drop of labelling mixture (cell side down).Incubate for at least 30 min at room temperature (RT, 25 °C), protected from the light.",
    "Invert coverslips and wash with PBS three times.Wash coverslips with dH2O once to prevent PBS crystals forming.Place a small drop of mounting medium (we use ProLong Diamond) onto microscope slides.Note: For best results microscope slides should be wiped with 70% EtOH prior to use to remove any dust and lint. Lift coverslip from parafilm using forceps and remove any excess water by gently placing the edge of the coverslip against a clean Kimwipe tissue.Place the coverslip cell side-down onto the drop of mounting medium.Gently press the forceps against the top of the coverslip and aspirate any excess mounting medium.Seal the coverslip to the microscope slide using clear nail polish.Imaging and Data AnalysisCapture 3D z-stacks using Nyquist sampling with a fluorescent microscope capable of serial optical sections, i.e., Apotome, Confocal or widefield system (Figures 1A-1C) to capture the full 3-dimensional image of the cells and ruffles.Acquire multiple fields of view for each condition (collecting at least 100 cells per treatment).Notes:Images here were captured using a Zeiss Axioscan fluorescence upright microscope using a 40x 1.3 NA Plan Neofluar objective with an Axiocam 506 CCD camera. Samples were illuminated with HXP 120W whitelight source and filtered with Zeiss DAPI 49/FITC 44 filter cubes. Z-stacks were captured at 0.2 μm intervals beyond both the visible top and bottom of the cells with 5 apotome phase shifts for optical sectioning to identify the midpoint of the nucleus and ruffles on the dorsal surface (Figures 1D-1F).Nuclei Mid-point Offset determination. In its native form the script determines the mid-point of the nucleus by finding the slice where the cross-sectional area is greatest (Figure 1G).",
    "In macrophages, this suitably allows for the selection and segmentation of dorsal ruffles which are only present above this mid-point, however for alternate use cases, or different cell lines it may be required to use a different selection cut-off point. Figure 1H shows where peripheral ruffles may not be originally selected by using the nuclei mid-point, instead by applying an offset (of a few slices) the additional peripheral ruffle is selected (Figure 1H inset, grey arrow). The nuclei mid-point offset value allows for greater flexibility and broadens the use of the script to further analysis applications.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200112/20200112093615_1638.jpgFigure 1. Processing steps of the Ruffle Quantification Macro. 3-Dimensional, 2 channel images are required for the macro captured here using a 40x 1.3 NA objective. Images A-C represent Z-projected (for graphical display purposes only) example images. A. Phalloidin stained RAW 264.7 Macrophages (channel 1). B. Nuclei labelled with DAPI (channel 2). C. Merged two channel image, solid arrow represents location of reslice. D-F. Reslices of C (arrow), showing X-Z axis (cut vertically along the arrow in panel C) of 3D images. D. Dotted line represents mid-point of the nucleus, as selected by the macro E-F. F-actin rich ruffles with merged DAPI highlighted by white arrows (F). Scale bar = 20 μm. G. Example cross-sectional images (X-Y axis) from three different Z-planes of the nuclei showing differences in the measured area, with the largest cross-sectional area determined to be the nuclei ‘mid-point.’ H.",
    "Example resliced (X-Z axis) of cell showing a solid line where the determined mid-point of the nucleus is, as well as where the offset line would be if used (example, -3 offset), small open arrows (grey) highlight additional ruffle that would be selected if offset is used, larger black arrows show ruffles selected by the existing mid-point slice with the differential between slices being the offset.Utilising FIJI, install the macro file: ‘Ruffle Analysis Macro’ and select Run.Note: To load the macro into FIJI either open the .ijm file, or copy the text from the Github website (see Software section above) and paste this into a new script window (File>New>Script). For continued use, the file Ruffle_Analysis_Macro_.ijm can be copied into the “scripts” folder of the FIJI application, where it will appear under the plugins menu from the next time you open FIJI. Read the Acknowledgement screen for assay description and instructions (Figure 2A).Navigate to the directory location for your files for processing (Figure 2B).Confirm the file extension in use (e.g., “.czi”) in the dialog box and enter a Nuclei Mid-Point Offset if required and select “OK” (Figure 2C).Note: The script will run through the entire directory only opening images that contain the file extension chosen.Upon completion of the script a dialog will appear.Confirm success running of the macro with the batch completion dialog box (Figure 2D).Navigate to the output directory location (within the chosen working directory location) and confirm thresholding selections are accurately selecting your regions of interest using the output threshold images.Note: Due to the streamlined nature of the macro, the time required to re-run the macro with new or modified parameters is minimal and it is encouraged that output data is checked and re-run if necessary.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200112/20200112093649_3817.jpgFigure 2. User-interactive macro windows.",
    "Dialog boxes requiring user-input during the running of the Ruffle Quantification Macro. A. Acknowledgement and splash screen describing the macro, contact details of the creator, input requirements, and output files. B. OS-dependent file navigator window to select the directory containing images for processing and analysis. C. File extension filter dialog window allows for the user to enter the extension for file filtering and mid-point offset value. D. Macro completion window to notify the user the successful completion of the macro.Overview of key steps for Ruffle Quantification MacroNuclei images are extracted (channel 2) and thresholded using the Otsu algorithm. The mid-point is determined by progressively measuring nuclei area within each slice. The slice with the greatest area of the nuclei is stored. The number of nuclei is also counted and stored for output (Figure 3A).Note: The Otsu thresholding method is used here to detect nuclei, the Otsu method finds the maximum point of inter-class variance between the foreground and the background and is suited where bi-modal distributions of intensity are expected. The F-actin (phalloidin) channel (channel 1) is extracted from the image stack into two separate images stacks, (1) the bottom half of the cell is taken (slice 1 to nuclei midpoint slice ( offset); Figure 3B) and (2) the top, ruffle area is taken (midpoint slice slice ( offset) to the top most slice; Figure 3E).The cell area is determined by maximum Z-projecting the image slices (from slice 0 to the determined nuclei midpoint slice (± offset) and thresholding using the Triangle algorithm (to select total cell peripheries). and measured for output (Figure 3C). The thresholded flattened bottom image is then reduced using a distance map to separate close and/or touching cells.",
    "The distance map is then thresholded using the IJ_IsoData threshold algorithm and the number of ‘objects’ (cells) is estimated and stored for output (Figure 3D).Note: The Triangle algorithm is used here to detect cells, the algorithm is best suited for finding objects that may only be slightly above background (e.g., the very edges of cells) and is therefore used to create accurate selections for measuring cell area. For cell counting, the distance mapped thresholded cells are subjected to a Moments IJ_IsoData threshold as it selects for high-value maximums (e.g., the very center or cells) and thus will not be influenced by touching cells, provided accurate cell number counts. The ruffles are determined by sum Z-projecting the top F-actin channel (midpoint ± offset to total/top number of slices) and measuring the intensity of the resultant 32-bit image (multiplied by the detected area). The flattened top/ruffle image is then thresholded using the Moments algorithm and the area of the thresholded ruffles is measured (Figure 3F) and used to determine regions of interest for directly measuring summed ruffle intensity.Note: The Moments algorithm is used here to threshold the ruffles, the algorithm works on a series of averaging steps, and selects regions above background but of varying intensity. This facilitates an accurate selection of all ruffles from the 32-bit sum projected image and not just the brightest objects. Calculations perform normalisations of ruffle area/cell area, and the intensity of the ruffles/cell area. These values are further normalized against the number of nuclei detected.Images at key points in the macro are saved into the output folder (nuclei detection, cell area (bottom) and ruffle area (top), and a merged (green/red) RGB image of the ruffle selection overlayed the cell area image) for verification purposes (Figures 3G-3H).",
    "All output values are written to the log window (Figure 3I), and the output .csv file into a subdirectory called Analysis_Results_ (Figure 3J).Quantified data from the analysis is stored as a .csv file with ratios and normalization to cell number already calculated (Figure 3K). (Values and calculations explained in detail below).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200112/20200112093724_5677.jpgFigure 3. Processing steps of the Ruffle Quantification Macro. A. Thresholded nuclei mask as counted by the macro. B-C. Flattened F-actin base of the cell (bottom) and corresponding threshold for measuring cell area. D. Thresholded distance map showing individual cell segmentation for counting number of cells/field of view. E-F. Sum Z-projected top surface (ruffles) including thresholded image for measuring ruffle area. G. Example output image showing merged bottom (red) and top/ruffles (green). H. Example output image showing merged thresholded bottom (red) and top/ruffles (green) I. Screenshot of the Log window reporting status, macro run date, file names and results. J. Screenshot of the results directory containing output images, log file and a Results.csv file. K. Screenshot of the .csv output results file with explanation of source information below referring to images above where applicable. Scale bar = 20 μm.Overview data processing stepsOutput data (.csv file) from the macro is opened using Microsoft Excel (or equivalent).Data where the nucleus mid-point is incorrect (e.g., slice 33/33) suggests incorrect thresholding and detection these samples are excluded from the analysis, this can be further confirmed from the corresponding threshold output images.Data are copied and sorted into relevant groups (based upon image fields of view and/or treatment conditions) into GraphPad Prism 8 for statistical analysis.Depending on the data-sets. statistical analysis may include T-test, One- or Two-way ANOVAs. Data are compared using the in-built graphing tools.Output and Results of the MacroThe following details the source of values generated within the output .",
    "csv file:Column A (Image ID) = Filename of source image for this row of dataColumn B (Est. Number of cells) = Count of objects detected in Figure 3DColumn C (Number of Nuclei) = Count of objects detected in Figure 3AColumn D (Middle Slice#) = Image slice number of mid-point of nucleiColumn E (Total Slice#) = Number of slices in the source Z-stackColumn F (Total Cell Area) = Calculated area from Figure 3CColumn G (Sum Intensity) = Sum intensity from Figure 3EColumn H (Top Area Ruffles) = Calculated area from Figure 3FColumn I (Ratio Top:Bottom) = Ratio Area from Figure 3F/ Area Figure 3CColumn J (Ratio Sum Intensity:Cell Area) = Ratio Sum intensity Figure 3E/ Area Figure 3CColumn K (Normalised Ratio) = Result of Column I (Figure 3F/3C) divided by Column C (Number of Nuclei Figure 3A)Column L (Normalised Sum) = Result of Column J (Figure 3E/3C) divided by Column C (Number of Nuclei Figure 3A)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}