{
  "id": 5627,
  "origin_website": "Bio",
  "title": "Microvesicle Isolation from Rat Brain Extract Treated Human Mesenchymal Stem Cells",
  "procedures": [
    "Procedures for permanent middle cerebral artery occlusion and brain extracts preparationPrepare two 8-week-old male Sprague-Dawley rats, one for normal and one for ischemic brain injury.Note: One rat brain is enough for 5-10 experiments of the present experimental scale. Ischemic brain injury (MCAO surgery)Anesthetize rats with 3% isoflurane (Hana Pharm, Seoul, Korea) in a mixture of 80% N2O and 20% O2. Place the rat in a face-up supine position, incise midline of neck skin and retract neck muscles gently.Carefully isolate the left common carotid artery and external carotid artery.Ligate left common carotid artery and external carotid artery with a 4-0 surgical suture temporarily. Incise left internal carotid artery slightly and insert 4-0 surgical suture into the left internal carotid artery and advance carefully to the Circle of Willis.Loose the knot that tied the external carotid artery and tie tightly left common carotid artery.Suture the neck skin.24 h after MCAO surgery, normal rats and ischemic brain injury rats are deeply anesthetized with an intraperitoneal injection of ketamine (40 mg/kg body weight) and xylazine (5 mg/kg body weight), and then are perfused with normal saline.After the rats are perfused, use surgical scissors to remove the head with a cut posterior from the ears. Quickly make a midline incision in the head skin, aseptically remove the skull and meninges by bone rongeur.Note: The methods for rat sacrifice and brain tissue extraction were performed as previously described by Spijker (2011).After placing whole brain on a brain matrix, make coronal dissection the region of the middle cerebral artery (bregma -1~+ 1 mm) on the ice from the ipsilateral hemisphere, collect the sliced brain tissue (Figure 1A).Homogenize tissue pieces using tissue grinders.Centrifuge tissue homogenates at 100,000 x g for 2 h at 4 °C, and then take supernatants.",
    "Centrifuge the supernatants at 100,000 x g for 1 h at 4 °C (Figure 1B).Filter the supernatants through a 0.2 μm filter. Protein content was measured using the Bradford assay (Figure 1C). (Typical total amount of protein is 120-220 mg.)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626221201_5018.jpgFigure 1. Preparation of brain extract. A. Rat brain was placed on a brain matrix, coronary dissected the region of the middle cerebral artery (bregma -1~+ 1 mm) from the ipsilateral hemisphere and the sliced brain tissue was collected. B. Brain homogenates were ultracentifuged to remove rat brain-derived microvesicles, filtered to remove residual aggregates and cellular debris. C. The supernatant was finally filtered through 0.2 μm syringe filter and aliquots were stored at -80 °C.Cell culture procedureRapidly thaw (less than 3 min) frozen human MSC (hMSC) vials in a 37 °C water bath. Pipet entire contents of the cryovials into a sterile 50 ml conical tube and carefully add 10 volume of prewarmed complete culture medium (DMEM containing 10% fetal bovine serum).After gentle swirling of tube determine the cell concentration by hemocytometer and adjust cell concentration at 3 x 105/ml with prewarmed complete culture medium.Inoculate 75 cm2 flasks at ~8 x 103 cells/cm2 and incubate at 37 °C in a 5% CO2 incubator.Exchange the medium with fresh prewarmed complete medium 24 h post thaw. Observe culture flasks routinely on an inverted microscope.When cells are nearly confluent (over 80% confluent), aspirate medium and floating debris from a confluent monolayer and discard.Wash cells with prewarmed PBS once and add 5 ml of 0.05% trypsin-EDTA to the culture flasks. Incubate at 37 °C until 50-70% detached (approximately 2-5 min).Add 5 ml of prewarmed complete medium and gently pipet up and down to detach adherent cells and disperse cells into single cell suspension.Transfer cell suspension into sterile 50 ml conical tubes.",
    "Wash flasks with additional 5 ml complete medium and combine into the conical tube.Centrifuge cell suspension at 300 x g for 5-10 min.Aspirate supernatant and resuspend the pellet in an appropriate volume of prewarmed complete medium.Inoculate total of 50 flasks (75 cm2) with 20 ml/flask of 1 x 105 viable cells/ml for microvesicle isolation and return to incubator.Note: Cell cultures should be re-fed every 3 days with fresh complete medium for optimal cell growth.When cells are nearly confluent (over 80% confluent), wash the cells extensively with PBS at ambient temperature or pre-warmed at 37 °C (5 times, 10 ml per wash).After final wash, culture medium was replaced with 20 ml serum- and antibiotics-free low-glucose DMEM medium with 300 μg of brain extract or the ischemic brain extracts (final concentration of 15 μg/ml). The culture supernatant was harvested 48 h later to isolate microvesicles (MVs) (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626221515_1715.jpgFigure 2. MSC culture. A. Microscopic image of hMSCs; B. Scale of hMSCs culture; C. Experimental schedule. The primary cultured MSCs (2 x 106 cells/flask) were seeded in 75 cm2 culture flasks (total of 50 flasks). C. After culturing in complete media, culture medium was replaced with serum-free antibiotic-free medium for 48 h, and the culture supernatant was harvested to isolate microvesicles.Note: MVs prepared from untreated MSCs have low protein yields (< 0.3 mg/3 x 108 cells/48 h) while the amount of MVs from MSC-conditioned medium was greatly increased by treatment with normal or ischemic brain extracts (2.2 mg/3 x 108 cells/48 h for MVs from normal brain extract-treated MSCs and 2.5 mg/3 x 108 cells/48 h for MVs from ischemic brain extract-treated MSC).Isolation of microvesicles (MVs)Collect the culture supernatant from MSC cultures (conditioned media amount about 1,000 ml).",
    "To remove cell and cellular debris, centrifuge the harvest culture supernatant media once at 500 x g for 10 min and then the supernatant are collected. Centrifuge the supernatant at 800 x g for 15 min, then take the supernatants (about 1,000 ml).Concentrate the supernatants to 30 ml (about 33 fold concentration) by ultrafiltration using the Minimate Tangential Flow Filtration (TFF) capsule system with a 100 kDa cut-off membrane at 4 °C (Figure 3).Remove the caps from the feed and retentate ports of the Minimate TFF capsule.Note: Do not discard caps. They are required for storage.Screw a male luer-to-hose-barb connector (included) into each of the feed/retentate ports.Cut a piece of tubing 3.2 mm (1/8”) i.e., long enough to reach from the feed reservoir, through the pump head to the capsule.Note: Keep tubing lengths as short as possible to reduce system hold-up volume.Connect the tubing to the hose-barb on one of the feed ports. Install the tubing in the pump head. Put the other end of the tubing into the reservoir.Notes:  If a pressure gauge or transducer is used, connect the tubing to the pressure device. Then connect the pressure device as close as possible to the feed port using suitable connectors.Feed and retentate ports are interchangeable. Depending on the orientation of the capsule, choose the port that is at the lowest elevation as the feed port. This allows for air to be easily expelled when liquid is pumped through the capsule. The recommended crossflow for the Minimate TFF capsule is 30-40 ml/min.Cut another piece of tubing, long enough to return from the retentate port to the sample reservoir.Attach the tubing to the retentate hose-barb and put the other end in the reservoir.",
    "(Again, if a pressure gauge or transducer is used, the tubing connects to the pressure device, which must then be connected to the retentate port.)Place the retentate screw clamp on the retentate tubing close to the retentate port (after the pressure gauge if installed). Secure in place but do not tighten to restrict the tubing.Remove one of the filtrate caps.Attach a female luer-to-hose-barb fitting to one of the filtrate/vent ports.Note: This concentration ratio was selected based on the capacity of the subsequent ultracentrifugation steps. Thus, the concentration ratio may vary depending on the ultracentrifuge (rotor and tubes), cell types and culture condition employed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626222335_0925.jpgFigure 3. Diafiltration of hMSC conditioned media. A. Schematic drawing of Tangential Flow Filtration (TFF) system; B. Photo image of diafiltration system using Minimate TFF capsule system with a 100 kDa cutoff membrane.To enrich the MVs, the concentrated supernatant is agglutinate using sucrose gradient centrifugation. Prepare 38 ml polyallomer tube and 0.8 and 2.7 M sucrose cushions (see Recipes 2 and 3). Carefully put 0.5 ml of 2.7 M sucrose into the bottom of a tube. Carefully add 0.8 M sucrose 1 ml just above the 2.7 M sucrose layer. Allow the sucrose solution to run down very slowly inside of tube wall.Add 33 ml sample on the sucrose cushion taking care not to break the sucrose layer (Figure 4A).Centrifuge the tube at 100,000 x g for 1 h at 4 °C [Rotor: 32Ti, Acceleration: max, Deceleration: slow (9)].After centrifugation, remove the supernatant (about 32 ml) carefully from sucrose fraction-enriched MVs layer. Note: MVs are about just above sucrose cushion (yellow line, Figure 4A) and should be handled with care because it is difficult to identify with the naked eyes (Figure 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626222609_0686.jpgFigure 4. Enrichment of microvesicles by sucrose gradient ultracentrifugation. A.",
    "A discontinuous sucrose density gradient was prepared by layering 1.5 ml of 0.8 M sucrose gradient upon 0.5 ml of 2.7 M sucrose density solution. Next, 33 ml of concentrated conditioned medium was added to the top lay carefully. B. After centrifugation, microvesicles are enriched in the interface between medium and sucrose layers.Prepare OptiPrepTM solution (see Recipe 4) and two 13.2 ml polyallomer tubes.For further purification of the MVs, mix the sucrose fraction−enriched MVs with OptiPrepTM (final concentration = 30%).Transfer about 2.5 ml of sucrose fraction−MVs into a 15 ml tube.Add 1.34 ml sucrose dilution buffer to 2.5 ml Sucrose fraction-enriched MVs then mix 5.76 ml of 50% OptiPrepTM to make 30% OptiPrepTM (total volume: 9.6 ml). Put 4.8 ml of 30% OptiPrepTM-sample in two 13.2 ml polyallomer tubes, each.Add 3 ml of 20% OptiPrepTM just above 30% OptiPrepTM layer, each.Add 2.5 ml of 5% OptiPrepTM on top of 20% OptiPrep layer, each (Figure 5A).Note: Caution! OptiPrepTM has a low viscosity, so be careful not to disturb or break the layer. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626222807_3556.jpgFigure 5. Isolation of microvesicles by OptiPrep density gradient. A. Discontinuous OptiPrepTM gradients were prepared in 12 ml tube with 3 layers of gradients consisting of 5% (2.5 ml) of the 2 additional layers of 20% (3 ml) and 30% (4.8 ml) of stock OptiPrepTM. The stock solutions were diluted with 20 mM HEPES/150 mM NaCl buffer (pH 7.2) and sample solution (microvesicle enriched fraction from sucrose gradient) was mixed with 30% gradient solution. B. After centrifugation, sample tubes were arbitrarily divided into 10 equal portions and 1 ml aliquots of each portion were collected to new tubes. The major microvesicle fraction was clearly shown in the interface between 5% and 20% OptiPrepTM (F3 layer).",
    "Centrifuge the sample tube at 200,000 x g for 3 h at 4 °C (Rotor: SW41Ti).After centrifugation, divide sample tubes into 10 equal portions and taken 1 ml each. The MVs are at the interface between 5% and 20% OptiPrepTM showing the white band (F3 layer) (Figure 5B).Collect 1 ml MVs (F3), dilute 10-fold with PBS (9 ml) and centrifuge at 100,000 x g for 1 h at 4 °C (Rotor: SW41Ti). After centrifugation, identify a pellet at the bottom of the tube. Remove the PBS and dissolve the pellets with 100 μl of PBS.The protein concentration of each fraction is determined using refractometer and the Bradford dye assay.Note: For therapeutic purposes, quantification of final products should be expressed as weight/ml (or unit/ml), if possible. Since protein is one of the main components of the microvesicles, protein quantification was employed. Alternatively, the quantification of MVs can be done by flow cytometry, nanoparticle tracking analysis (NTA) or resistive pulse sensing combined with Raman microspectroscopy."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}