{
  "id": 6826,
  "origin_website": "Bio",
  "title": "Evaluation of B Cell Proliferation <em>in vivo</em> by EdU Incorporation Assay",
  "procedures": [
    "Notes: Buffers should be prepared fresh on the day of the experiment: 1x Click-iT® EdU permeabilization and wash reagent is diluted with deionized water. Click-iT® EdU buffer additive aliquots should be kept in -20 °C and diluted only prior to the preparation of the reaction cocktail with deionized water. Mice used in this protocol were 8-10 weeks old with an average weight of ~25 g. All animal experiments should be performed with an adequate ethics approval. This protocol was used to measure B cell proliferation within Peyer’s patches but it is also suited for other lymph nodes and spleen. Inject 200 µl EdU (2 mg) intravenously via the retro-orbital sinus of C57BL/6 wild-type mice.2.5 h following EdU administration, sacrifice the mice by cervical dislocation.Open the abdominal cavity and remove the small intestine from the cecum to stomach.Flush the intestine with 40 ml PBS using a 30 ml syringe with an 18 G MonojectTM blunted cannula. Avoid contact of the tissue with the flushed out intestinal contents.Using curved scissors facing up, excise the Peyer’s patches and avoid excising adjacent intestinal tissue (about 6-10 Peyer’s patches are expected per mouse with an overall of 3-10 million cells from all Peyer’s patches).Place the PPs in a petri dish with a 70 µm cell strainer and 3 ml 1% BSA PBS.Using a pistol of a 3 ml syringe mash the PPs to create a single-cell suspension of PP-derived cells.Transfer the cell suspension into a FACS tube with a cell-strainer cap.Wash the petri dish with additional 1 ml of 1% BSA PBS buffer and collect the solution into the same FACS tube to maximize cell collection.Spin down the cells at 300 RCF for 7 min at 4 °C.Discard the supernatant and resuspend the cells with the residual buffer (approximately 100 µl).",
    "Add 1 µl Fc blocker antibody (TruStain FcXTM, CD16/32), vortex and place on ice.Incubate 5 min on ice.Add 100 µl staining mix prepared in 1% BSA PBS. If proliferation should be analyzed in the B cell compartments, as in the associated study, the following markers can be used: the germinal center (B220+ CD138- FAS+ CD38-); the subepithelial dome (B220+ CD138- IgA+ CD38+ CCR6+) and the plasma cell compartment (CD138+). As negative control, we assessed EdU incorporation in the Naïve B cell compartment (B220+ CD138- CD38+ FAS-). Since the residual volume in the tube following blocking is approximately 100 μl, the antibody mix is prepared as a 2x concentration to achieve final dilution as indicated in Table 1.Table 1. List of antibodies used for surface staining of GC and SED B cellsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200425/20200425102301_0069.pngVortex and incubate on ice for 30 min in the dark to allow surface marker staining.Wash the cells with 2 ml 1% BSA PBS and spin down the cells at 300 RCF for 7 min at 4 °C.Resuspend the cells with 100 µl Click-iTTM fixative (4% paraformaldehyde in PBS).Incubate for 15 min in the dark at room temperature.Add 3 ml 1% BSA PBS and spin down the cells at 300 RCF for 7 min at 4 °C.Discard the supernatant and resuspend the cells with 100 µl 1x Click-iT® EdU permeabilization and wash reagent.Mix well by pipetting, do not vortex.Incubate for 15 min in the dark at room temperature.Prepare the Click-iTTM Plus reaction cocktail according to the Table 2.Table 2. Click-iTTM Plus reaction cocktailimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200425/20200425102318_7760.pngImportant notes:Prepare the cocktail during Step 22.Add the reaction components in the order listed in the table.Use the cocktail within 15 min of its preparation.Keep the cocktail at room temperature until use.Extra volume calculation is not necessary.",
    "Add 500 µl of the Click-iTTM Plus reaction cocktail to each sample. The total volume is 600 µl.Incubate for 30 min in the dark at room temperature.Add 3 ml 1x Click-iT® EdU permeabilization and wash reagent and spin down the cells at 300 RCF for 7 min at 4 °C.Resuspend the cells with 500 µl 1x Click-iT® EdU permeabilization and wash reagent and analyze the cells using CytoFlex flow cytometer (Beckman Coulter)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}