{
  "id": 2003,
  "origin_website": "Cell",
  "title": "Analyzing cachectic phenotypes in the muscle and fat body of Drosophila larvae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHeat killing of Drosophila larvae\nTiming: 3 min per larva\nHere we describe a method for heat killing third instar larvae before muscle fillet dissection, which improves the quality of muscle fillets, preserves muscle integrity and reduces muscle detachment artifacts.\nNote: Heat killing using high temperatures prevents muscle contractions during death. Additionally, heat killed larvae will not move when one attempts to pin down the larvae, making the process easier. This procedure can be used for other muscle preparations, such as dissections followed by immunostaining.\nTransfer larvae from vial to a 6-place porcelain spotting plate with cold 1× PBS (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig1.jpg\nFigure 1. Diagram sequence for heat killing Drosophila larvae\n(A–G) Brief illustrated instructions for the heat killing procedure. Detailed instructions can be found in the main text.\nPour some 1× PBS into one of the wells of the 6-well culture plate\nAlternatives: Petri dishes can be used instead of the 6-well culture plate.\nHeat up water in a conical flask using a microwave until boiling or just before boiling (Figure 1[href=https://www.wicell.org#fig1]B).\nTransfer larvae from the 6-place porcelain spotting plate to a 40 μm cell strainer using a paint brush (Figure 1[href=https://www.wicell.org#fig1]C).\nMeasure the temperature of the water until it is around 70°C–75°C, then pour it into a well of the culture plate or petri dish (Figure 1[href=https://www.wicell.org#fig1]D). The water will cool very quickly once it is poured, so do not wait too long before the next step.\nCritical: If the water temperature is lower than 70°C, this process is not effective.\nDip the cell strainer containing the larvae into the water for 2–4 s (Figure 1[href=https://www.wicell.org#fig1]E), then remove from the water and dip into the PBS for 2–4 s to cool (Figure 1[href=https://www.wicell.org#fig1]F).",
    "Transfer larvae out of the cell strainer back to a 6-place porcelain spotting plate with cold 1× PBS (Figure 1[href=https://www.wicell.org#fig1]G).\nDissection of larval muscle fillets\nTiming: 3 min per larva\nHere we describe the dissection of a muscle fillet from third instar larvae.\nNote: The size of the pins can really make a difference when dissecting larval fillets. We recommend using pins with a diameter of 0.142 mm or thinner, as they allow for minimal disruption to the muscle, and more precise placement of the pins. Keep in mind that the thinner pins are more likely to bend at the tip, making them unusable and thus require more delicate use.\nUsing a small paintbrush, transfer a single larva from the 6-place porcelain spotting plate containing cold PBS (from step 7) to the dissecting pad (See the key resources table[href=https://www.wicell.org#key-resources-table] for more information).\nPipette 40–50 μL of fresh 1× cold PBS on top of the larva so that it is fully covered.\nUsing forceps and dissecting pins, pin down the posterior end of the larva first so that it is orientated as Figure 2[href=https://www.wicell.org#fig2]A, placing the pin on the dorsal side of the larva, between the two tracheal branches.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig2.jpg\nFigure 2. Diagram sequence for dissecting Drosophila larval muscle fillets\n(A–I) Brief illustrated instructions for the larval muscle fillet dissection procedure. Red dotted lines indicate active cutting lines. Red solid lines indicated previously cut lines. Detailed instructions can be found in the main text.\nHold the anterior end of the larva, and stretch it out to create light tension, then pin down the anterior end.\nUsing the dissection scissors, make an incision below the pin at the posterior end, cutting through half of the larva, as shown in Figure 2[href=https://www.wicell.org#fig2]B. Make a similar incision above the pin at the anterior end.",
    "Orientating the scissors perpendicular to the incisions made in step 12, cut through the cuticle of the larva at the midpoint of the width of the larva (between the trachea), all the way from the incision made at the anterior end to the posterior end (Figure 2[href=https://www.wicell.org#fig2]C).\nUse forceps to pick up and pull back the fillet, until it opens up like a book, and place a pin in the corner of the fillet (Figure 2[href=https://www.wicell.org#fig2]D). Do the same on the other side of the fillet (Figure 2[href=https://www.wicell.org#fig2]E).\nNote: Which of the four corner pins you pin first is not important, but you should fully pin down either the posterior or anterior side’s pins first (Figure 2[href=https://www.wicell.org#fig2]E), before doing the next two (Figure 2[href=https://www.wicell.org#fig2]F).\nCritical: Try to create light tension in the fillet so that it is fully stretched but be careful not to apply too much pressure or you may tear the fillet.\nRepeat step 14 for the opposite end of the fillet, until it is pinned out as shown (Figure 2[href=https://www.wicell.org#fig2]F).\nNote: The speed at which you dissect may determine how many larvae you do before starting the fixation process. Having a different timer for each larva can become cumbersome, so it is recommended to do multiple larvae and then fix them as a group, perhaps sorting them by genotype. Doing too many before fixing is also not recommended, as the first few larvae can begin to deteriorate, especially if they have been heat killed.\nCritical: For phalloidin stained muscle fillets, we recommend not leaving the first dissected larvae unfixed for more than 20 min.\nNote: To begin with we recommend only doing three larvae per group before fixation. However, it is possible to do up to eight or ten within the 20 min time window.",
    "Fixation of dissected larval muscle fillets\nTiming: 1 h per larva/group of larvae\nHere we will fix the muscle fillets that we have dissected above. Freshly prepared 4% formaldehyde is recommended.\nRemove the PBS from the larvae, and add 40–50 μL of 4% Formaldehyde. Fix for 20 min at room temperature (RT) (If using this protocol for antibody stains other than phalloidin, please refer to the manufacturer’s protocol for the best fixation conditions).\nNote: While fixing the first group of larvae, you may commence dissection of the next group of larvae to save time.\nRemove the 4% Formaldehyde, and wash in 40–50 μL of 0.3% PBST for 10 min at RT (repeat 2 times).\nDuring the second wash, remove the pins from either end of the larva, leaving only the 4 pinning down the fillet.\nUsing the dissecting scissors, remove the head and tail of the fillet, as shown in Figure 2[href=https://www.wicell.org#fig2]G.\nRemove the internal organs and tissues, including the gut, fat body, central nervous system, and discs (Figure 2[href=https://www.wicell.org#fig2]H).\nCritical: The removal of internal organs is important, as it allows full exposure of muscles to the phalloidin/PBST solution in step 19.\nTry to leave the trachea in this cleaning process, as trachea will help to guide the mounting of the fillet in step 25.\nNote: Do not worry about removing all the axons that were connected to the brain, as these will not affect the detachment score, and are too difficult to remove.\nCritical: Be careful not to touch the muscle with the forceps in this process. The fillet should look like Figure 2[href=https://www.wicell.org#fig2]I.\nDuring the final wash, remove the final four pins from the fillet, letting it float freely in the PBST.",
    "Transfer the fillet to a 6-place porcelain spotting plate containing 0.3% PBST by picking it up on one corner of the fillet, without touching the muscles.\nStaining of fixed larval muscle fillets\nTiming: Either 1.5 h, or overnight, as required\nTo visualize the muscle fibers attached to the cuticle, we will stain for F-actin using phalloidin diluted in PBST.\nRemove the PBST and replace with phalloidin diluted in 0.3% PBST.\nMake sure there is enough solution to fully cover all the fillets, we find 200 μL per well in the spotting plate is usually enough.\nUse any fluorescently-labeled phalloidin that you prefer, and follow the recommended concentrations provided by the manufacturer.\nWe use a concentration of 1:200 for our phalloidin staining.\nNote: We use 6-place porcelain spotting plates for the staining process as we have found it allows even staining of the muscle fillets without agitation.\nAlternatives: You can perform the phalloidin staining in a 1.5 ml microcentrifuge tube on a shaker, just be careful not to touch the muscles while transferring the fillets in and out of the microcentrifuge tubes.\nStain the fillets in the dark, for either 1 h at RT, or for up to 24 h at 4°C. The phalloidin stain is very robust, so either procedure works.\nOnce the staining is complete, remove the phalloidin solution, and wash in 0.3% PBST three times (10 min each time) at RT.\nRemove the PBST, and replace with 50% glycerol to fully cover the fillets.\nPause point: These fillets can be stored at 4°C in 50% glycerol for up to a week before mounting. If the fillets were stored at 4°C, store the 6-place porcelain spotting plate in a moist chamber to prevent drying out of the samples (a moist paper towel in a dark box works well).",
    "Mounting of stained larval muscle fillets\nTiming: 15 min\nHere we will mount the stained muscle fillets ready for imaging.\nNote: For quicker imaging, you can mount up to 6 fillets under 1 coverslip (18 mm × 18 mm).\nOnce ready to mount, prepare a glass slide by pipetting 40–50 μL of 80% glycerol onto the slide.\nTransfer your muscle fillet(s) onto the slide, make sure they are submerged in the glycerol.\nTo ensure they are orientated muscle side up (cuticle side down), find the trachea you have left on the fillet, they should face up. After orientating the fillets, you can then remove the trachea, as well as any residual organs that were left on the muscle fillets.\nNote: See “troubleshooting: problem 1[href=https://www.wicell.org#troubleshooting]”.\nLine up the fillets so that their anterior/posterior axis runs parallel to the length of the slide, this will help with imaging in the “imaging of larval muscle fillets[href=https://www.wicell.org#sec2.6]” section.\nAdjust the glycerol level on the slide as needed, adding more if the fillets need extra coverage, or removing some if there is too much and it will spill out the edge of the coverslip.\nCarefully lower a coverslip onto the slide, taking care to avoid creating air bubbles on the fillet. One tip is to make sure the glycerol has made contact at the side of the coverslip first, then lower it down gently over the fillets with a pair of forceps.\nNote: Trapped air bubbles can affect the detachment score, so if many air bubbles are trapped between the coverslip and the fillet, you should remount the fillet.\nSeal the edges of the coverslip using nail varnish.\nImaging of larval muscle fillets\nTiming: Varies based on confocal",
    "Here we describe the settings required for imaging the muscle fillets on an Olympus FV3000, however, any confocal microscope is sufficient. Please note that the process can slightly differ depending on the microscope used.\nNote: We use an Olympus FV3000 confocal microscope and a 10×/0.3 NA UPlanFL air objective. This low magnification allowed us to image the entire fillet with a low number of images for tiling at multiple positions which are then stitched to create a single image for analysis. The range of the Z-stack was set using a First/ Last mode and adjusted to encompass the full thickness of the fillet with five slices. While the bulk of muscle fluorescence is relatively flat due to the compression from the coverslip, acquiring a z-stack allows us to ensure muscle staining at different focal planes is captured for the most accurate muscle/cuticle analysis.\nSettings required for acquisition\nIn order to process acquired files with the macro, the following acquisition settings/parameters are used:\nSet the range of the Z-stack using a First/ Last mode. Five slices are used to create the Maximum Intensity Projection. First, focus the objective on the middle and brightest plane of the fillet, and then adjust the focus above and below this plane until saturation disappears almost entirely from the image in either direction.",
    "Set the gain so that it picks up all the pixels at the top and bottom of the acquisition stack. As there is a significant difference in the fluorescent intensity at the center of the stack compared to the upper and lower slices, it is likely that pixels in the center of the stack will be over saturated. As the images are used to create a mask and we are not making an intensity measurement, this does not influence the muscle area calculated by the macro.\nA 10× objective is recommended for acquisition as this provides a large field of view and reduces the number of tiles required to image the whole fillet, while providing sufficient resolution to capture the finer details of the muscle structure.\nThe use of a tiling program within the confocal software is recommended, as it is unlikely that the whole fillet will fit in a single field of view. Stitching the images is required before applying the macro. This can be done either within the confocal software (such as FV31S-SW on the Olympus FV3000) or a program such as FIJI (Plugins>Stitching>Grid/Collection stitching)(Preibisch et al., 2009[href=https://www.wicell.org#bib6]).\nAn image size of 512 × 512 pixels provides sufficient resolution for this analysis, while also allowing for relatively fast acquisition and small file size.\nKalman averaging is not required however, it is a potential option depending on the noise levels on the microscope of choice.\nAnalysis of imaged larval muscle fillets\nTiming: 2 min per fillet\nHere we describe a FIJI macro that analyzes the muscle detachment score of dissected muscle fillets stained with phalloidin.\nSeparate stitched images into folders according to the experimental conditions used, for example, genotype, drug treatment, etc.",
    "Within the respective folders, create an ‘Input’ and an ‘Output’ folder (Figure 3[href=https://www.wicell.org#fig3]A). Move the images into the ‘Input’ folder for each respective group.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig3.jpg\nFigure 3. Walkthrough of the muscle fillet macro\n(A–L) Brief illustrated instructions for the muscle detachment FIJI macro. Detailed instructions can be found in the main text.\nImport the “oir to tiff” macro into FIJI, and hit ‘Run’ (Figure 3[href=https://www.wicell.org#fig3]B). Macros can be imported by dragging and dropping the macro file into FIJI. The “oir to tiff” macro is included as an uploaded file associated with this protocol (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Mmc1.zip]).\nSelect the ‘Input’ folder for your first group (Figure 3[href=https://www.wicell.org#fig3]C), and the ‘Output’ folder for where the macro will deposit the converted files (Figure 3[href=https://www.wicell.org#fig3]D). It will run through the images in the ‘Input’ folder, and output them as converted tiff files in the ‘Output’ folder (Figure 3[href=https://www.wicell.org#fig3]E).\nOnce the command has finished, Import the “Fillet muscle detachment analysis” macro into FIJI, and hit ‘Run’ (Figure 3[href=https://www.wicell.org#fig3]F). The “Fillet muscle detachment analysis” macro is included as an uploaded file associated with this protocol (Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Mmc1.zip]).\nSelect the ‘Output’ folder from where you sent the converted files from step 34 (Figure 3[href=https://www.wicell.org#fig3]G).\nThe command will begin, and will show a number of images of the first fillet. Using the top-most image, follow the commands of the macro, starting with drawing a square around the fillet (Figure 3[href=https://www.wicell.org#fig3]H). You can create a perfect square by holding Shift on Windows or Mac. While this isn’t a necessary step, it does make for a more consistent image if you want to display the binary masks later on.\nNote: If you click ‘OK’ before drawing either the ‘square ROI’ or the ‘fillet ROI’, the macro will encounter an error and will need to be restarted.",
    "Draw an ROI around the fillet (Figure 3[href=https://www.wicell.org#fig3]I).\nCritical: The most important thing is to be consistent between fillets as to the degree of which you stick to the fluorescent boundary, some examples are given in Figures 4[href=https://www.wicell.org#fig4]A and 4B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig4.jpg\nFigure 4. Examples of outputs from the FIJI muscle fillet macro\n(A and B) Representations of different ROI boundaries.\n(C) Example of an intact fillet. Scale bar = 500 μm.\n(D) Example of a detached fillet. Scale bar = 500 μm.\n(E) Quantification of fillets from C & D. Error bars = ± SEM, ∗ = p < 0.05.\nThe macro will ask you to confirm the threshold (Figure 3[href=https://www.wicell.org#fig3]J), and the ROI (Figure 3[href=https://www.wicell.org#fig3]K). Check they are as expected, and click ‘OK’ in both instances to proceed.\nNote: See “troubleshooting: problem 2[href=https://www.wicell.org#troubleshooting]”\nProceed through each fillet in the given folder. Each fillet will give a .csv output that represents the percentage of area that the fluorescent pixels occupy per ‘fillet ROI’. An example of the outputs from one fillet is given in Figure 3[href=https://www.wicell.org#fig3]L. On average, a 5 days post fertilization (dpf) wildtype fillet, such as a w1118, will have a percentage muscle value of around 80%–90%, given that gaps between muscles naturally occur in the fillet. The macro calculates the percentage muscle value using the “Area” and “Area fraction” options in “Set Measurements”. Some examples are given in Figures 4[href=https://www.wicell.org#fig4]C and 4D.\nRepeat steps 33–39 for the other experimental groups.\nDissection and fixation of larval fat body\nTiming: 1 h 15 min\nCritical: In contrast to muscle, larval fat body can be incredibly delicate. Therefore, we recommend a longer fixation step (40 min) for fat body preparation, and any dissections of the fat body away from the cuticle should be carried out after the fixation step.",
    "Note: Due to the fragile nature of fat body, it is recommended that image acquisition occurs on the same day the fat body is mounted. For staining neutral lipids with LipidTOX™ (LipidTOX™ staining is used for lipid droplet analysis), imaging is recommended straight after mounting.\nNote: We recommend staining endogenous fluorescently tagged proteins along with DAPI and phalloidin, to help choose Z-stack slices later on for analysis. A list of some endogenous fluorescently tagged ECM proteins that work well in muscle and fat body has been provided in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_1485_1.csv\nTransfer larvae from the housing vial to a 6-place porcelain spotting plate with cold 1× PBS (this stops larvae from moving and makes dissections easier). You can have multiple larvae per well of the dish, we recommended between three to five larvae.\nUnder the microscope, change the cold PBS to 4% formaldehyde. Use around 200 μL, as this should be enough to fully submerge the larvae.\nUsing two pairs of forceps, grip the cuticle of one of the larvae as shown in Figure 5[href=https://www.wicell.org#fig5]A and pull the larva as shown in Figure 5[href=https://www.wicell.org#fig5]B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig5.jpg\nFigure 5. Diagrams of Drosophila fat body dissections and slide preparation for fat body mounting\n(A and B) Diagram of Drosophila fat body dissections. (A) Two pairs of forceps are used to grip the larva. (B) The larva is pulled in half, exposing the fat body.\n(C and D) Preparation of a microscope slide for fat body mounting. (C) A piece of tape is placed on the slide. (D) A scalpel is used to cut the tape as indicated, and the middle portion is removed.\nPull enough to expose the fat body as much as possible.\nRepeat steps 43 and 44 for the other larvae in the same well.",
    "Leave the larvae in the fixative for 40 min at RT, without agitation.\nNote: See “troubleshooting: problem 3[href=https://www.wicell.org#troubleshooting]”\nAfter fixation:\nFor endogenous fluorescently tagged proteins, replace the fix with 200 μL of 0.2% PBST and use this for subsequent washes and stains.\nWash twice in PBST, 10 min per wash.\nDuring this time, remove all non-fat body tissues from the wells.\nFor LipidTOX™ staining used in the lipid droplet analysis, add 200 μL of PBS (note: do not use PBST, as Triton affects the integrity of the lipid droplets), and use this for subsequent washes and stains.\nWash twice in PBS, 10 min per wash.\nDuring this time, remove all non-fat body tissues from the wells.\nCritical: Take care not to touch the fat body, as these tissues are delicate in nature.\nStaining of fixed larval fat body\nTiming: 1 h 30 min\nHere we describe the staining of fixed fat body with either DAPI and phalloidin or LipidTOX™.\nFor staining:\nFor endogenous fluorescently tagged proteins, remove the 0.2% PBST, and add DAPI/phalloidin diluted in 200 μL of 0.2% PBST per well of the spotting plate. We use a DAPI concentration of 1:100, and a phalloidin concentration of 1:200.\nFor LipidTOX™ staining, remove the PBS, and add LipidTOX™ diluted in 200 μL of PBS per well of the spotting plate. We use a concentration of 1:1,000 for LipidTOX™ staining.\nFor either staining, stain the fillets in the dark for one hour at RT without agitation.\nOnce the staining is complete;\nFor DAPI/phalloidin staining, replace the DAPI/phalloidin mixture with 200 μL 0.2% PBST, and wash three times (10 min each) at RT.\nFor LipidTOX™, replace the PBS/LipidTOX™ mixture with 200 μL PBS, and wash three times (10 min each) at RT.\nMounting of stained larval fat body\nTiming: 15 min",
    "Here we describe the mounting of stained fat body for imaging.\nOnce ready to mount;\nFor endogenous fluorescently tagged proteins stained with DAPI/phalloidin, remove the 0.2% PBST, and replace with 80% glycerol.\nNote: This will make the fat body very difficult to see, and it is recommended to do the next step under a microscope.\nFor LipidTOX™, we recommend mounting directly in PBS, as glycerol can change the morphology of the lipid droplets.\nCut off the tip of a P1000 pipette tip to increase the size of the opening. This allows the fat body to be transferred without it getting caught or squeezed by the tip entrance.\nTake a small piece of tape and place it on a glass slide as shown in Figure 5[href=https://www.wicell.org#fig5]C.\nUsing the scalpel/Stanley knife, cut an open strip through the center of the tape as shown in Figure 5[href=https://www.wicell.org#fig5]D, to create a spacer. This is where we will mount the fat body. The use of the tape prevents the coverslip from squashing the fat body and thus damaging its integrity.\nUsing the cut P1000 pipette tip and a P1000 pipette;\nFor endogenous fluorescently tagged proteins stained with DAPI/phalloidin, transfer the glycerol containing the fat body to the space created within the tape on the slide. Arrange the fat body, so that the pieces of fat body lie flat.\nFor LipidTOX™ samples, transfer the PBS containing the fat body to the space created within the tape on the slide. Arrange the fat body, so that the pieces of fat body lie flat.",
    "Critical: The LipidTOX™ stained fat body is suspended in PBS, and can sometimes stick to the walls of the pipette tip. Be gentle when transferring these fat bodies, and pipette plenty of PBS while you do so to avoid the fat body sticking to the walls.\nUsing a P200 pipette, remove excess glycerol/PBS from the slide.\nGently place a coverslip on top, and seal the edges of the coverslip with nail varnish.\nImaging of stained larval fat body\nTiming: Varies based on confocal\nHere we describe the settings required for imaging the fat body so that they can be analyzed in the sections below. We have not provided step-by-step methods for the imaging itself, as this differs depending on the microscope used.\nNote: Fat body staining and/or fluorescently tagged protein intensity can be quite variable between different individuals of the same experimental condition, and even between the different fat body tissues taken within one individual. To help reduce variability, we take the same piece of fat body for each individual; the long, continuous pieces of lateral fat body (most larvae have two). We also ensure to only use samples where the fat cells are not detached/detaching from one another. In addition, the use of DAPI helps to choose fat cells from the same layer within a sample, as well as can provide guidance of choosing layers of a similar depth into the tissue in other samples.\nNote: Fat bodies were imaged on an Olympus FV3000 confocal microscope using a 40×/0.95 NA UPLXAPO air objective.\nSettings required for acquisition\nThe following settings are utilized to acquire the images utilized for the FIJI analyses.",
    "Acquire a Z-stack to ensure the most representative selection of lipid droplets/ECM plaques in the fat body can be measured. As the aim is not to image the precise volume of the fat body, an interval of 1 or 2 μm was used to speed up Z-stack acquisition and reduce file size.\nAs the lipid droplets and ECM components can be very small, at least a 40× objective is recommended for acquisition as this will allow you to resolve smaller droplets, ECM plaques, and the cell walls.\nA higher image size of 1024 × 1024 pixels is recommended as resolution needs to be high to sufficiently resolve smaller droplets and ECM components.\nKalman averaging of 2 or higher is recommended to remove noise, increase signal to noise ratio, and help resolve smaller lipid droplets and ECM components.\nNote: See “troubleshooting: problem 4[href=https://www.wicell.org#troubleshooting]”\nQuantification of lipid droplets from imaged larval fat body\nTiming: 2 min per fat body\nHere we describe the procedure for analyzing lipid droplet size in larval fat body.\nNote: The macro has the potential to analyze fat body that has been stained with multiple channels.\nSeparate images into folders according to the experimental conditions used, for example, genotype, drug treatment, etc.\nWithin the respective folders, create an ‘Input’ and an ‘Output’ folder. Move the images into the ‘Input’ folder for each respective group. See Figures 3[href=https://www.wicell.org#fig3]A–3E for an example of the “oir to tiff” macro used in steps 61 and 62.\nImport the “oir to tiff” macro into FIJI (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Mmc1.zip]), and hit ‘Run’. Macros can be imported by dragging and dropping the macro file into FIJI.",
    "Select the ‘Input’ folder for your first group, and the ‘Output’ folder for where the macro will deposit the converted files. It will run through the images in the ‘Input’ folder, and output them as converted tiff files in the ‘Output’ folder.\nOnce the command has finished, Import the “Lipid droplet quantification analysis_singlechannel” or “Lipid droplet quantification analysis_multichannel” (either channel option depending on your needs) macro into FIJI, and hit ‘Run’ (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig6.jpg\nFigure 6. Walkthrough of the lipid droplet quantification macro\n(A–J) Brief illustrated instructions for the lipid droplet FIJI macro. Detailed instructions can be found in the main text.\nNote: The “Lipid droplet quantification analysis_singlechannel” and “Lipid droplet quantification analysis_multichannel” macros are included as uploaded files associated with this protocol (Data S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Mmc1.zip] and S4[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Mmc1.zip] respectively).\nSelect the ‘Output’ folder from where you sent the converted files from step 62 (Figure 6[href=https://www.wicell.org#fig6]B).\nThe command will begin, and will show an image of the first fat body.\nIf you are using the multi-channel macro, it will ask you to organize the channels to select the lipid droplet channel. Follow the instructions accordingly (Figures 6[href=https://www.wicell.org#fig6]C and 6D).\nIf you are using the single channel macro, it will skip to the next step.\nYou will be asked to select your representative slice (Figure 6[href=https://www.wicell.org#fig6]E). Scroll to find a slice that is around 4–5 slices from the top of the stack, one that is bright and shows the diameter of the lipid droplets, and make sure there is a defined separation between lipid droplets (See Figures 7[href=https://www.wicell.org#fig7]A and 7B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig7.jpg\nFigure 7. An example of the use of the FIJI lipid droplet macro\n(A and B) Representative slices from Z-stacks of fat body from two different genotypes. Scale bars are inserted by the FIJI macro, = 50 μm.",
    "(C and D) Examples of ROI outputs from (A and B). Scale bars are inserted by the FIJI macro, = 20 μm.\n(E) Quantification of the lipid droplets found in (C and D). Error bars = ± SEM, ∗∗∗∗ = p < 0.0001.\nClick ‘OK’. A pop-up box will ask for the slices you are looking to keep. Enter the number of the slice you have kept in both the ‘First Slice’ and ‘Last Slice’ boxes, and set the increment to ‘1’ (Figure 6[href=https://www.wicell.org#fig6]F).\nYou will then be asked to draw a rectangle or square and click ‘OK’ (Figure 6[href=https://www.wicell.org#fig6]G). Regardless of the size square you draw, it will automatically make a 200 μm × 200 μm square.\nNote: This does not need to be around the area you are looking for yet, it is simply to draw an ROI with the correct size, which will be used to select three ROIs you will place in the next steps. If you click ‘OK’ without setting a rectangle or square, it will generate one for you.\nMove the ROI to the first position you want to analyze and click ‘OK’ (Figure 6[href=https://www.wicell.org#fig6]H).\nNote: If you click ‘OK’ before moving the ROI to new position for the second or third ROIs, the macro will encounter an error and will need to be restarted.\nRepeat step 68 for the second and third ROIs (Figure 6[href=https://www.wicell.org#fig6]I).\nProceed through each fat body in the given folder. Each fat body will give a .csv output that contains the number of lipid droplets detected, and their size. See Figure 6[href=https://www.wicell.org#fig6]J for an example of the outputs from one fat body, and the .csv output of one ROI.",
    "Note: Pay attention to the output images that show what the macro has chosen as a lipid droplet. It will have assigned numerical values to each lipid droplet, so if it has incorrectly detected a lipid droplet you can select its value and remove it if need be.\nRepeat steps 61–70 for the other experimental groups.\nQuantification of ECM components from imaged larval fat body\nTiming: 3 min per fat body\nHere we describe the procedure for analyzing ECM components using FIJI.\nNote: It is recommended that you only use one channel for the ECM protein of interest. The experimental and control fat bodies should always be acquired in parallel, and the same confocal setting should be applied to both. Acquire the brightest sample first and apply this setting to the dimmer samples.\nCritical: It is very important to acquire these images as soon as possible after mounting.\nImport Z-stack of fat body with a fluorescently tagged ECM protein.\nIsolate the slice that is 4th or 5th from the top of the stack, which also has the brightest DAPI signal. Make sure to only measure the slice that contains the ECM signal, for example in Figures 8[href=https://www.wicell.org#fig8]A, 8B, and 8H.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1485-Fig8.jpg\nFigure 8. Examples of ECM protein quantifications in Drosophila fat body\n(A and B) Representative slices from Z-stacks of fat body from two different genotypes showing the ECM protein Nidogen assembling as plaques.\n(C and D) Examples of how to draw the ROI on the inner side of the outer fat body edge.\n(E and F) Particle analysis performed on (C and D).\n(G) Quantification of the ECM plaques found in (E and F). Error bars = ± SEM, ∗∗∗ = p < 0.001.",
    "(H) Representative slice from Z-stack of fat body showing the ECM protein Rhea aligning along the cell edge.\n(I) Example of line measurement for (H).\n(J) Quantification example of ECM line measurements from (I). Raw Integrated Density is divided by the area of the line measurement, and values are normalized to the average of the control values. Error bars = ± SEM, ∗∗∗∗ = p < 0.0001. All scale bars = 50 μm.\nUse the following instructions based on what formation the ECM component of interest follows:\nFor ECM components that assemble as ‘plaques’ (See Figures 8[href=https://www.wicell.org#fig8]A–8G), in order to measure the size of the plaques: apply the “Auto Threshold” feature (Image>Adjust>Auto Threshold),\nChoose “Try all” to first assess which setting is the most reflective of the image.\nThen apply the most precise thresholding algorithm under “Auto Threshold” to your image.\nCritical: It is important to use the same setting for all experimental conditions.\nNote: See “troubleshooting: problem 5[href=https://www.wicell.org#troubleshooting]”.\nUsually there is some signal around the outer edges of the fat body. You do not want this to be measured as part of the analysis, so you need to select only the internal regions of the fat body. Using the “Polygon Selections” tool, draw an ROI around the internal region of the fat body, excluding any outer edge signals. See Figures 8[href=https://www.wicell.org#fig8]C and 8D for examples.\nUtilize the “Analyze Particles” tool (Analyze>Analyze Particles) to count the number of ECM ‘plaques’.\nMake sure “Display Results”, “Add to Manager”, and “Exclude on edges” are ticked.\nSet the values in the “Size” box to “1.00-infinity”. This helps to ensure that background singular pixels are not measured.\nSet the values for the “Circularity” box to “0.00–1.00”.\nYou will also need “Integrated density” ticked in “Set Measurements” (Analyze>Set Measurements).",
    "It will output the results in a separate window.\nMeasure using “RawIntDen”.\nFor ECM components that assemble along the cell edge (See Figures 8[href=https://www.wicell.org#fig8]H–8J), draw a line of 10 μm width along the membrane (Figure 8[href=https://www.wicell.org#fig8]I), where to draw this line can be guided by the phalloidin staining that you have acquired (Double click on the “Line segment” tool to set line width). Collect around 10–20 line segments per image.\nIt is suggested to use the “ROI Manager” tool (Analyze>Tools>ROI Manager) to help keep track of which line segments have been measured. You will also need “Area” and “Integrated density” ticked in “Set Measurements” (Analyze>Set Measurements).\nOnce you have collected all the line segments for one image, select all the ROIs and click “Measure” in the ROI Manager.\nCalculate the fluorescent intensity by dividing “RawIntDen” by the area of the line measurement.\nNormalize each value to the average of the control values."
  ],
  "subjectAreas": [
    "Metabolism",
    "Model Organisms",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}