{
  "id": 2477,
  "origin_website": "Cell",
  "title": "Protocol to downregulate GABAergic-astrocyte signaling via astrocyte-selective ablation of GABAB receptor in adult mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSurgeries and viral injections\nTiming: 1 h per mouse\nIn order to generate transgenic mice with selective downregulation of GABAB receptor signaling in astrocytes from mPFC (GFAP/PFCΔGb mice), use 3–4 months old Gabbr1 (GABAB1)-floxed mice (Haller et al., 2004[href=https://www.wicell.org#bib5]) and inject them with adenoviral particles to express Cre recombinase in mPFC astrocytes (AVV2.5-GFAP-Cre-mCherry, viral titer 4.3 × 1012 viral genomes (vg) per mL). See Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1987-Fig1.jpg\nFigure 1. Generating GFAP/PFCΔGb conditional knockout mice\n(A) Schematic drawing showing the viral approach to downregulate gene expression using conditional mice. Gabbr1-floxed mice injected with a AAV2.5-GFAP-Cre-mCherry virus in mPFC such that the target gene becomes inactivated in vivo within the expression domain of Cre, generating a knockout mouse GFAP/PFCΔGb.\n(B) Left, general workflow of the genome editing in Gabbr1 gene floxed by loxP sites, where excision is done. Right, scheme of AAV2.5-GFAP-Cre-mCherry virus.\nNote: This study did not quantify the number of infected astrocytes based on the mouse age. Be aware of potential differences in transfection levels between juvenile and adult mice.\nWeigh mice prior to anesthesia (see Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1987-Fig2.jpg\nFigure 2. Step protocol of surgical procedure for introducing AAVs into mPFC of conditional knockout mice\n(1) Analgesics; (2) injection coordinates and injection volumes; (3) pipette withdrawn and make sure there in no reflux, this will ensure that virus is correctly injected into the brain; (4) wait for virus expression.\nInject 0.1 mg per kg of buprenorphine subcutaneously.\nAnesthetize mice with isoflurane (1.5–2% in O2).\nOnce anesthetized, place the animal in the stereotaxic frame.\nPut a heating pad below to maintain body temperature at approximately 36°C.\nKeep the mouse anesthetized with a gas anesthesia mask, which will also help you position the animal’s head.",
    "Fix the mouse’s head placing the ear bars of the stereotaxic frame in front of the ears. Make sure the skull is well fixed.\nCover the eyes with eye gel to avoid dryness.\nExpose the skull.\nShave the animal’s head with a razor blade.\nApply ethanol with a cotton bud and an antiseptic (Betadine or similar).\nMake an incision from back to front with the scissors.\nNote: Make sure Bregma is exposed along with the targeted area.\nRemove the tissue above the skull using cotton buds and forceps.\nTake stereotaxic coordinates.\nUsing the stereotaxic and surgical microscope, place the tip of the pipette at bregma and set this point at X=0, Y=0.\nRaise the pipette and place it on the X and Y coordinates of the targeted area. The coordinates used for the mPFC are: anterior-posterior (AP) or Y = +1.68 and + 1.8; lateral (L) or X = ±0.35; and ventral (V) or Z = −2.5 to −1.3 mm (Franklin and Paxinos, 2008[href=https://www.wicell.org#bib2]).\nNote: For this experiment, bilateral injections with two injections per hemisphere are made (a total of 4 injections).\nCritical: For calcium imaging experiments, a mix of both viral constructions (AAV2.5-gfaABC1D-cyto-GCaMP6f (viral titer range 2–6 × 1013 vg/ml) and AVV2.5-GFAP-Cre-mCherry (4.3 × 1012 vg/ml; 1:1 ratio) are injected.\nPlace the tip of the needle in the first position and make a mark scratching softly on the surface of the skull with forceps. Do this for the positions described.\nDrill the skull.\nMake a craniotomy at the marked positions with a drill.\nCarefully, apply pressure to the skull with the drill until you feel a drop-in resistance. At that point, the brain should be accessible.\nNote: If bleeding, use cotton buds and saline solution to stop it.\nRepeat the process with the 4 areas.\nViral injections.",
    "Place the tip of the needle at the top of the hole and move down in the Z axis until the surface of the brain is reached.\nAt that point, set the Z axis to 0 and take the Z coordinate in which you want to start the injection. For mPFC experiments, use Z = −2.5.\nSet the injection speed to 70 nl min−1 and start the injection.\n70 nl steps are made along the Z axis in the coordinates: −2.5, −2.3, −2.1, −1.9, −1.7, −1.5, −1.3 mm to cover the entire mPFC. Inject a total volume of 500 nl of viral particles.\nWait for 10 min before you remove the pipette to avoid reflux and slowly withdraw the pipette.\nRepeat these steps for the 4 injection sites.\nCritical: Before you insert the pipette into the brain, make sure it is not clogged by injecting and checking liquid is coming out of the tip under microscope.\nSuture\nMoisten the skin with a cotton bud and saline solution to help suture the skin.\nUse 6.0 suture or skin glue.\nApply antiseptic (betadine or similar), local anesthetics (lidocaine), and liquid glue to avoid the animal removing the stitches.\nRecovering\nTurn off anesthesia.\nRemove the ear bars and the gas anesthesia mask.\nCheck the animal’s breathing and consciousness while keeping it in the heating pad.\nPlace the animal in the cage with a heating pad below and monitor until it shows regular breathing and locomotion.\nBuprenorphine (0.05 mL, 0.1 mg/mL) is given once daily for 48 h post-surgery.\nCritical: Check the mouse’s breathing during the surgical process to adjust anesthesia levels. Breathing must be regular and without gasping.\nNote: For control experiments, viral injections are also made in GABAB flox−/− mice.\nGenetic characterization of astrocytic GABAB receptors ablation\nTiming: 3 days",
    "Critical: Timing for infection is constrained from 3 weeks, when expression of viral particles is enough to reach desire number of astrocytes being targeted, to 5 weeks to prevent possible sides effects. After AAV2.5-GFAP-Cre-mCherry expression, analyze the presence of the knockout allele following Cre-mediated deletion of exon 7 and exon 8 by quantification of Gabbr1 and Gabbr2 gene expression in astrocytes (see Figure 3[href=https://www.wicell.org#fig3]).\nAlternatives: Perform quantitative western blots to analyze the protein levels in the transfected astrocytes using fluorescence-activated cell sorting (FACS) from mPFC tissue (bulk collection).\nNote: Although FACS and quantitative western blots are commonly used, we have experienced inaccuracies in quantitation using immunodetection (cf. Walker, 2009[href=https://www.wicell.org#bib13]), making these approaches not reliable in our hands. If it is also your case, analyze the mRNA levels of Gabbr1 and Gabbr2 by RT-qPCR, and the protein levels by looking at the GABAB puncta located at the astrocytic membrane by immunohistochemical labeling (Figure 4[href=https://www.wicell.org#fig4], co-colocalization analysis).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1987-Fig3.jpg\nFigure 3. Workflow of collection and testing of GABAB receptors knockout in astrocytes from mPFC\n(1) Collect cells with a patch-clamp pipette ensuring the cell content is suctioned, under a fluorescence microscope to guide the selection of transfected astrocytes by selective expression of the mCherry reporter protein. (2) RNA extraction by magnetic bids from the astrocytic pull collected in the lysis buffer. (3) Library preparation of cDNA out of the extracted RNA. (4) Preparation of the reaction mix for PCR and running the qRT-PCR assay. Cycles for gene detection: Gabbr1 #21, Gabbr2 #22 for wildtype astrocytes; Gabbr1 #32, Gabbr2 #30 for GFAP/PFCΔGb astrocytes. (5) Acquisition of the amplification results.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1987-Fig4.jpg\nFigure 4. Characterization and validation of GABAB receptors downregulation in astrocytes",
    "(1) Histological characterization. Left, Scheme of serial coronal sections of the brain acquired using a vibratome. Cre-expression levels in neurons (determined by the NeuN marker), and in astrocytes (reported by the S100 antibody labeling). No labeling should be detected in neurons. Confocal fluorescence images of coronal brain sections with successful AAV injection. Right, Co-localization of puncta for Gababr1 and S100 in GFAP/PFCΔGb generated mice and control animals. (2) Ex-vivo functional characterization. Left, Examples of GCaMP6f successful expression in astrocytes: the calcium sensor is expressed throughout the mPFC in astrocytes as it co-localized with S100 (marker for astrocytes specific cell-type). Co-localizing astrocytes are shown in yellow. Scheme of local application of baclofen to the brain slices, specific agonist of GABABRs. Right, Time-lapse analysis of calcium transients recorded in GCaMP6f expressing astrocytes in response to different agonist applied. Representative calcium traces for control and GFAP/PFCΔGb astrocytes after baclofen stimulation. Note control astrocytes will show calcium events triggered by baclofen, sensitive to the specific blockage of GABABRs with CGP55845. However, GFAP/PFCΔGb astrocytes will not show specific increases induced by baclofen, supporting the downregulation of GABABR signaling; but they can respond to ATP, indicating the viability of these astrocytes to increase their intracellular calcium signals is not compromised. Statistical analysis of the response of control and GFAP/PFCΔGb astrocytes to the different agonist applications. (3) In-vivo functional characterization. Left, Scheme of the T-maze alternation behavioral task representing the different runs (sample and test). Right, a) Behavioral outcome with representative traces of behavioral responses from control and GFAP/PFCΔGb mice at day 4. b) Temporal profiles of the learning task for control (in black) and GFAP/PFCΔGb (in purple). Data are represented as mean ± SEM (shaded areas).",
    "c) Box and whisker plots showing the average performance values for control (in black) and GFAP/PFCΔGb (in purple) mice during training. Note the delayed learning in GFAP/PFCΔGb mice. All data shown in the BW plots of this figure represent the median (center line) and the 25th and 75th percentiles, respectively (top and bottom edges), and the whiskers extend to the maximum and minimum data points. One-way ANOVA, two-sided. ∗P < 0.05, ∗∗P < 0.01, ∗∗∗P < 0.001. Figure panels acquired from Mederos et al. (2021)[href=https://www.wicell.org#bib14].",
    "Collecting cells from cortical slices for Magnetic Bead Purification of RNA and RT-qPCR\nAnesthetize control mice (GABAB flox−/−) and GFAP/PFCΔGb animals with sodium pentobarbital 50 mg/kg, administered intraperitoneally.\nCheck for the absence of reflex and transcardially perfuse animals with NMDG-HEPES solution at 4°C using a 10 mL syringe.\nDecapitate the mouse using scissors or a guillotine.\nRemove the brain from the skull:\nCut the skin to expose the skull using fine scissors\nMake two horizontal cuts through the jaw bones\nCut the skull along the midline very carefully not to damage the brain\nMake a cut at the olfactory bulbs\nFrom the caudal midline, grab one half of the skull with forceps and open it to expose the brain. Then do it with the other half.\nExtract the brain with a spatula from the ventral zone of the olfactory bulbs.\nNote: During the entire process of brain extraction and slicing, NMDG-HEPES solution should be continuously bubbled with the gas mix.\nSlice the brain at 350 μm with NMDG-HEPES solution at 4°C. Use a vibratome (Leica Biosystems, VT1200 S or similar). Place the mPFC slices in a chamber with NMDG-HEPES at 37°C for 10 min, then place them into a chamber with aCSF at RT (21°C–23°C) for the rest of the experiment.\nNote: The slices are held in nylon nets placed on 250 ml of aCSF.\nAfter 45–60 min transfer the slices to the recording chamber of the microscope (Nikon Eclipse FN1) in aCSF. Use a 40X/60X objective and CCD camera (Hamamatsu C4742-95), illumination system (CoolLED), and appropriated software (NIS-Elements Software, Nikon) to identify mCherry-positive astrocytes based on fluorescence signal. Excitation wavelength 535 nm.",
    "Fill out the borosilicate glass pipette with 2–3 μL of Lysis buffer 1x. To prevent tip plugged, no negative pressure is applied to the pipette while approaching the cells. In contrast, be aware no to apply excessive positive pressure avoiding leak out of the lysis buffer.\nUsing the patch-clamp technique to collect the intracellular content (Figure 3[href=https://www.wicell.org#fig3], step 1):\nIdentify a mcherry-positive astrocyte.\nApproach with the borosilicate glass pipette filled with lysis buffer and place it touching the astrocyte membrane and apply negative pressure to follow a cell-attach configuration.\nTwo possible actions can be followed:\nFirst, in cell-attached configuration, move slowly up the tip of the pipette making sure that the cell follows the tip and it gets out of tissue. Once the tip and the cell are out the tissue, apply gentle negative pressure by mouth pipetting or using an external syringe to incorporate the intracellular content into the glass pipette. Then, carefully remove the pipette from the headstage and break the tip of the pipette into vials containing a 45 μL lysis buffer.\nNote: There is no need to accomplish a whole cell access.\nDirectly after collecting cell, close the vial containing lysis buffer and lysed cell, and keep in dry ice. Successively, repeat the process and collect 20–25 cells into the same vial. Once all cells have been collected perform a quick spin down and incubate for 15 min at 65°C in a water bath (Figure 3[href=https://www.wicell.org#fig3], step 2).\nNote: As cells will be pulled together in the same Eppendorf with lysis buffer, keep the vial in dry ice until all the astrocytes are collected.\nCritical: The total volume of cellular content into the lysis buffer vial may not exceed 5 μL (total volume 50 μL).",
    "Critical: Water bath right close to the collecting set up to avoid RNA degradation.\nAfter 65°C incubation, spin down the vial to recover possible drops formed.\nNote: At this point, store samples at −20°or −80°C until processing.\nIsolate RNA with magnetic beads using the DireCtQuant 100ST protocol (http://directquant.eu/wp-content/uploads/manuals/DireCtQuant%20100ST%20USER%20GUIDE%20171016.pdf[href=http://directquant.eu/wp-content/uploads/manuals/DireCtQuant%20100ST%20USER%20GUIDE%20171016.pdf]) (Figure 3[href=https://www.wicell.org#fig3], step 3).\nPerform a complementary DNA synthesis, library preparation and amplification following Pico Profiling workflow, which uses Whole Transcriptome Amplification (WTA) to generate sufficient cDNA for microarray expression analysis.\nAdd SYBR Green to the amplification reaction to monitor the efficiency in real-time.\nNote: Stop the amplification reaction once the SYBR Green signal reaches a plateau (Gonzalez-Roca et al., 2010[href=https://www.wicell.org#bib3]).\nPre-amplify cDNA obtained from the reverse transcription: prepare cDNA mix for PCR amplification and divide it in three equivalent parts in order to have technical replicates (Figure 3[href=https://www.wicell.org#fig3], step 4).\nNote: Include a sample without RNA as a control.\ntable:files/protocols_protocol_1987_6.csv\nPurify cDNA using a PureLink Quick PCR Purification kit (Invitrogen) and elute it in 40 μL of milliQ water.\nObtain cDNA concentration with a Nanodrop 1000 spectrophotometer.\nqPCR of Gabbr1 and Gabbr2:\nUse the following primer sets to analyze Gabbr1 and Gabbr2 expression: Gabbr1 (152 bp), forward (ACAGACCAAATCTACCGGGC), reverse (GTGCTGTCGTAGTAGCCGAT); Gabbr2 (106 bp), forward (AAGCTCAAGGGGAACGACG), reverse (ACTTGCTGCCAAACATGCTC).\nFill the wells of a hard-shell 384-well white well clear shell PCR plate (Bio-Rad, CN HSP-3805) with 5 μL of Sso Fast EvaGreen Supermix (Bio-Rad, CN 172-5204), 1 μL of primer mix (5 μM of each primer) and 5 ng of pre-amplified cDNA to reach a total volume of 10 μL per well.\nNote: Use housekeeping genes, i.e., ARBP (ribosomal protein 36B4 mRNA) and GAPDH (glyceraldehyde-3-phosphate dehydrogenase) for data normalization of RT-qPCR.",
    "Note: To prevent potential contamination of reagents and/or primer–dimer artifacts, a no-template control reaction must be carried out using all the reagents except the sample.\nNote: Perform technical triplicates to correct pipetting errors in plate loading.\nPerform qPCR in a CFX 384 real-time system (Bio-Rad).\nInclude a melting curve from 60°C to 95°C (0.5°C s−1) at the end of the program to verify the specificity of the PCR.\nUse the GenEx v.5.4.4 software (MultiD Analyses) for data processing using the 2−ΔCq method.\ntable:files/protocols_protocol_1987_7.csv\nNote: Gabbr1 and Gabbr2 are detected at 21 and 22 cycles, respectively, in wildtype astrocytes, and at 32 and 30 in GFAP/PFCΔGb astrocytes.\nHistological characterization of GABAB receptors in astrocytes\nTiming: 2 days for step 13\nTiming: 2 days for step 14\nSimilar to genetic identification, 3–5 weeks after AAV2.5-GFAP-Cre-mCherry injection into PFC of GABAB flox+/+, the so-called GFAP/PFCΔGb mice, characterize the absence of GABAB receptor expression in astrocytes by analyzing the puncta density immunofluorescence using confocal microscopy (Figure 4[href=https://www.wicell.org#fig4]).\nImmunohistochemistry\nAnesthetize the animal with sodium pentobarbital 50 mg/kg, administered intraperitoneally.\nTranscardially perfuse the animal with 10 mL of phosphate-buffered saline (PBS) followed by 40 mL PFA 4% using a perfusion pump.\nKeep the brain in PFA 4% overnight.\nNote: If brain is not analyzed right now, saturate the brain in sucrose gradient solutions (7%, 32%, shaking at 4°C), and keep it in cryoprotected solution (glycerol 3%) and ethylene glycol 3% in PBS.\nOnce ready, use a vibratome (Leica Biosystems, VT1000 S) to cut the brain in 50 μm coronal slices and collect them in PBS in a multiwell plate.\nWash the slices 3 times (20 min each) with PBS.\nWash the slices 3 times (20 min each) with 0.2% Triton/PBS.",
    "Block non-specific binding with PBS containing 1% goat serum and 0.3% Triton-X 100 for 1 h (blocking solution).\nIncubate the slices with primary antibodies in blocking solution overnight at 4°C. Primary antibodies used: guinea pig anti-GABABR1 (1:1,000), mouse anti-NeuN (1:500), rabbit anti-S100 (1:200) and mouse anti-GAD67 (1:500).\nWash the slices 3 times (20 min each) with blocking solution.\nIncubate the slices with secondary antibodies in blocking solution for 1 h at RT. The secondary antibodies are labeled with Pacific Blue, AlexaFluor-488 or AlexaFluor-647 and diluted 1:500 in blocking solution.\nWash the slices with 0.1% Triton/PBS 3 times (20 min each).\nWash the slices 3 times (20 min each) with PBS.\nMount the slices using Vectashield antifade mounting medium.\nConfocal imaging analysis Co-localization analysis of the encoded constructs by viral vectors (mCherry-Cre, Cyto-GCaMP6f) with astrocytic (S100) and neuronal (NeuN) markers.\nAcquire 1 μm single optical sections using a x63 objective (1.40 NA, oil-inmersion) at 2,048 × 2,048 resolution (physical size: 246.03 × 246.03 μm) with a confocal microscope.\nNote: For this article, Leica SP-5 confocal microscope (Leica Biosystems) is used, but particular settings will be adapted based on the user's confocal microscope.\nTake Z-stack images of 7 μm in thickness containing mCherry-Cre/Cyto-GCaMP6f positive astrocytes in PFC using LAS X (Leica Application Suite X) software.\nOpen the z-stack images with ImageJ to analyze colocalization of mCherry-Cre/Cyto-GCaMP6f with S100 and NeuN labeling (astrocytic and neuronal markers, respectively) in the Z-stack images to quantify the number of double-positive cells using the Fiji software.\nOpen the file which contains the desired image and select the Z stack maximum projection image generated previously.\nSelect the channel of the infection (mCherry-Cre or Cyto-GCaMP6f).\nUse the ROI manager tool in Fiji to select manually the fluorescent somatic regions (Analize → Tools → ROI manager).",
    "Once all the ROIs are selected, press More in the ROI manager window, and select OR (combine).\nCreate a mask that will be superimposed to the other channels to analyze co-localization by clicking on Edit → Selection → Create mask.\nClick on Edit → Selection → Create Selection and press Shift+E. To paste the mask selection in the other channels (S100 and NeuN), press Shift+E after having selected the channel window where we want to apply the mask (just by clicking in the window).\nWith the ROI manager still open, add 3 more ROIs drawn in these channels (3 for S100 and 3 for NeuN) to measure the background fluorescence intensity.\nWith the ROI manager of each channel completed, click on Measure in the ROI manager window to obtain the fluorescence intensity of each ROI.\nTo determine double-positive cells, the intensity of S100 or NeuN in the corresponding ROIs has to be higher than the value obtained, as per the following formula: mean value (background ROI intensity) + 4 times standard deviation (background ROI intensity).\nTag the positive ROIs with 1 and negative ROIs with 0 and calculate the percentage of positive ROIs for each channel.\nAnalyze GABABR1 puncta density using Fiji.\nFrom the Z-stacks obtained, demarcate astrocyte somata and projections in the S100 channel using the ROI manager tool only in mCherry-positive astrocytes.\nCreate a mask and paste it in the GABABR channel as in 14c (v-x) to measure the GABABR intensity in these ROIs.\nAnalyze the puncta density at ROIs: Binary images are obtained from these astrocytes (threshold of 25–255), and the number of puncta is acquired using Analyze Particles in ImageJ. The puncta density is calculated as the number of puncta versus ROI area.",
    "Note: Using this approach it is possible to establish a linear correlation between the total area of viral expression of GFAP-Cre-mCherry (mCherry fluorescence) in the mPFC and the behavioral performance in the T-maze test. Check also https://biop.github.io/ijp-imagetoatlas/registration_with_deepslice.html[href=https://biop.github.io/ijp-imagetoatlas/registration_with_deepslice.html], https://docs.brainglobe.info/brainreg-segment/user-guide/segmenting-3d-structures[href=https://docs.brainglobe.info/brainreg-segment/user-guide/segmenting-3d-structures], for correlation between labeling areas and alignment to brain atlas.\nFunctional characterization of the GABAB receptors ablation in astrocytes\nTiming: 1 day per mouse for step 15\nTiming: 3 h for step 16\nTiming: 9 days for step 16\nTo determine the functional impact of downregulating GABAB receptors signaling in mPFC astrocytes, two different strategies can be followed: calcium imaging to test the astrocytic calcium response to baclofen (GABABR agonist), and behavioral tests (T-maze alternation task) to monitor the impact of astrocytic GABABR downregulation.\nCalcium imaging. Figure 4[href=https://www.wicell.org#fig4]\nSacrifice control and GFAP/PFCΔGb mice 3–5 weeks after AAV2.5-GFAP-Cre-mCherry and AAV2.5-hGFAP-cyto-GCaMP6f injections to get the mPFC slices as previously described in point 12.\nAfter 1 h in aCSF at RT, transfer the slices to the chamber of the microscope (Nikon Eclipse FN1).\nIsolate calcium-driven GABAergic responses by using tetrodotoxin (TTX,1 μM) and a cocktail of antagonists, which include D-(-)-2-amino-5-phosphonopentanoic acid (D-AP5; 50 μM) and 6-cyano-7-nitroquinoxaline-2,3-dione disodium (CNQX; 10 μM), N-(piperidin-1-yl)-5-(4-iodophenyl)-1-(2,4-dichlorophenyl)-4-methyl-1H-pyrazole-3-carboxamide (AM251; 2 μM), 2-methyl-6-(phenylethynyl)pyridine hydrochloride (MPEP; 50 μM) and LY367385 (100 μM). Apply these drugs in the aCSF (see solutions and drug preparation[href=https://www.wicell.org#sec3.2]) (Araque et al., 2002[href=https://www.wicell.org#bib1]; Perea et al., 2014[href=https://www.wicell.org#bib8]).\nIdentify GCaMP6f-positive astrocytes using a 40X-water immersion objective using 488 nm as excitation wavelength.\nApply baclofen (2 mM) by a pressure micro-injector (Picospritzer; 1 bar) for 5 s using a glass micropipette placed into the slice close to the recorded astrocytes.\nUse NIS-Elements Software or similar to record 2–3 min video of calcium dynamics images.\nNote: Considering the kinetics of calcium responses, the acquisition rate would be at least 1 frame per second.",
    "Note: Control astrocytes show fluorescence increases after baclofen stimulation, while GFAP/PFCΔGb astrocytes do not show changes in their calcium levels.\nNote: Baclofen pipette placed in the field of view to ensure correct cell stimulation.\nUse ATP (1 mM) local air puff as positive control to test viability of the astrocytes for GFAP/PFCΔGb mice, when no baclofen response is observed. Robust fluorescence changes are obtained (Guthrie et al., 1999[href=https://www.wicell.org#bib4]).\nImaging data analysis Perform time-lapse image-series analysis using ImageJ of the Fiji software.\nOpen video with ImageJ in AVI format\nCorrect the x-y drift if needed with Turboreg plugin in ImageJ.\nDefine ROIs automatically by using MATLAB based software Caltracer3, although visual confirmation should be made (Mederos et al., 2019[href=https://www.wicell.org#bib7]; Poskanzer and Yuste, 2016[href=https://www.wicell.org#bib9]).\nExtract time traces of fluorescence intensity of each ROI and convert it to ΔF/F values, where ΔF/F0 = (F(t) − F0)/(F0), being F0 the baseline fluorescence defined as the average minimum fluorescence across pre-stimulus frames. This process can be made by custom-written software in MATLAB.\nConsider a calcium event when the fluorescence signal shows maximum values above three times the standard deviation of mean values of pre-stimulus frames.\nFor superimposed calcium events, consider more than one calcium event when maximum values are above two times the standard deviation of the previous steady signal.\nDiscard ROIs with no calcium signal changes during the entire recording (signals above five times the standard deviation of the baseline).\nDiscard events with duration fewer than two frames.\nAnalyze calcium event frequency, amplitude and area per ROI per min.\nBehavioral assay: T-maze alternation task. Figure 4[href=https://www.wicell.org#fig4]",
    "Keep the GFAP/PFCΔGb mice and control mice (GABAB flox−/−) under food restriction maintained above 80–85% of baseline body weights, which motivates mice to perform the behavioral task, and under water deprivation for 12 h before sessions (Toth and Gardiner, 2000[href=https://www.wicell.org#bib12]).\nKeep the temperature and humidity of the experimental rooms at 23 ± 2°C and 55 ± 5%, respectively.\nTransfer mice to the testing room at least 30 min before performing behavioral task to reduce stress.\nHabituate mice to the T-maze by placing them in the maze for 15 min for a 3-day period before the test.\nPerform behavioral trials, each trial consists of one sample run and one test run.\nSample run: block one side of the T arm with a wooden block and place a 0.1 mL reward (water or condensed milk) in the food well at the end of the opened arm. Place the animal in the start arm and let the animal enter into the opened arm with the reward.\nNote: To choose which arm to block, use a pseudorandom sequence with equal numbers of left and right turns per session and not more than two consecutive turns in the same direction.\nAfter the sample run, leave the mouse for 15 s at the beginning of the start arm, in a compartment separated by a door.\nTest run: remove the block and place the reward at the previously unvisited arm. Open the door for the mouse to start the test.\nTake note of the decision made by the animal (alternation or not alternation).\nNote: Consider an entry when the mouse has placed all four paws into the arm.\nRepeat the trial 10 times per day for 6 days (60 trials in total) with each animal with an inter-trial-interval of 5 min."
  ],
  "subjectAreas": [
    "Microscopy",
    "Behavior",
    "Neuroscience",
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}