{
  "id": 10402,
  "origin_website": "Jove",
  "title": "A Multilayer Microfluidic Platform for the Conduction of Prolonged Cell-Free Gene Expression",
  "procedures": [
    "1. Wafer preparation\nNOTE: Our protocols are specific for the 40 XT positive photoresist and SU8 3050 negative photoresist used during this research. Alternative photoresists can be used, however the specific spin speeds, baking temperatures, and baking times will vary. The microfluidic device design provided by Niederholtmeyer et al.36 is linked in the Table of Materials.\nPlace two clean silicon wafers (100 mm diameter, <1-0-0> oriented, 525 µm thickness) in a preheated oven set to 250 °C and leave the wafers to dehydrate overnight (~16 h).\n\tNOTE: It is also possible to prime the wafers using HMDS vapor deposition; however, this is not necessary if the wafers are sufficiently dehydrated.\nRemove one silicon wafer from the oven and let it cool to room temperature before proceeding with the spin coating. Apply 3-4 mL of the 40 XT photoresist to the center of the wafer.\nTo obtain a feature height of 25 μm apply the following spin protocol: spin for 20 s at 500 rpm (110 rpm/s), increase the spin speed to 3100 rpm (300 rpm/s) and hold here for 30 s, and decelerate the wafer to 0 rpm with a deceleration of 200 rpm/s. Using a microfiber tissue carefully remove any edge beading which may have occurred during the spin coating.\nSoft bake using two separate hot plates set to 70 °C and 120 °C in the following manner: allow the wafer to sit at 70 °C for 30 s. Then transfer the wafer to the 120 °C hotplate and allow it to rest here for 3.5 min before returning the wafer to the 70 °C hotplate for another 30 s. Remove the wafer from the hotplate and – avoiding sudden temperature shocks – allow it to cool to room temperature.",
    "Place the flow layer photomask (emulsion side down) onto the photoresist film and expose the wafer using a UV lamp until a total exposure of 200 mJ/cm2 is achieved.\nPost-exposure bake using two hot plates (70 °C and 105 °C) in the following manner: allow the wafer to sit at 70 °C for 20 s before transferring the wafer to the 105 °C hotplate and leaving it here for 40 s. Finally return the wafer to the 70 °C hotplate for a further 20 s to complete the post-exposure bake.\nAllow the wafer to cool to room temperature on a stack of microfiber tissues. Develop the wafer by transferring it to a Petri dish filled with 726 MIF photoresist developer to start the development process. Development is accelerated when performed on a benchtop shaker and the entire wafer is submerged in the developer.\nRinse the wafer with demineralized water and use a stereo microscope to check the wafer surface for any photoresist residue. If photoresist residue can be seen, then return the wafer to the developer.\nReflow the positive photoresist by placing the wafer on a hot plate set at 110 °C for 25 min. This process will result in rounded features as well as annealing any cracks that may have appeared during the fabrication process. Proceed to silanize the wafer as described in step 1.17.\nRemove the second silicon wafer from the oven, allowing it to cool to room temperature before proceeding with the spin coating. Apply 5 mL of SU8 3050 photoresist to the center of the wafer.",
    "To obtain a feature height of 30 μm apply the following spin protocol: spin for 20 s at 500 rpm (110 rpm/s), increase the spin speed to 4,000 rpm (330 rpm/s) and hold here for 42 s, and decelerate the wafer to 0 rpm with a deceleration of 200 rpm/s. Using a microfiber tissue carefully remove any edge beading which may have occurred during the spin coating.\nSoft bake using two separate hot plates (65 °C and 95 °C) in the following manner: allow the wafer to sit at 65 °C for 30 s. Then transfer the wafer to the 95 °C hotplate and allow it to rest here for 14 min before returning the wafer to the 65 °C hotplate for another 30 s. Remove the wafer from the hotplate and allow it to cool to room temperature.\nMeasure the intensity of the UV lamp before exposure and use this to determine the exposure duration required to achieve a total exposure dosage of 260 mJ/cm2. Place the photomask (emulsion side down) onto the photoresist film and place the wafer underneath the UV light source. Expose the wafer using a UV lamp until a total exposure of 260 mJ/cm2 is achieved.\nPost-exposure bake using two hot plates (65 °C and 95 °C) in the following manner: allow the wafer to sit at 65 °C for 60 s before transferring the wafer to the 95 °C hotplate and leaving it here for 4.5 min. Return the wafer to the 65 °C hotplate for a further 30 s to complete the post-exposure bake.",
    "Allow the wafer to cool to room temperature on a stack of microfiber tissues. Develop the wafer by transferring it to a Petri dish filled with mrDev-600 photodeveloper to start the development process. Development is accelerated when performed on a benchtop shaker and the entire wafer is submerged in the developer.\nRinse the wafer with isopropanol and use a stereo microscope to check the wafer surface for any photoresist residue. If photoresist residue can be seen, then return the wafer to the developer. Once fully developed, hard bake the photoresist by placing the wafer on a hot plate set at 150 °C for 1 h.\nSilanize both wafers to prevent the adhesion of PDMS during the soft-lithography processes. To perform the silanization, pipet 2-3 droplets (per wafer) of the silane into a small glass vial. Place this vial, along with the wafers into a desiccator and pull vacuum for 5-10 min. Seal the desiccator and leave the wafers under vacuum for a period of 12 – 16 h.\n\tCAUTION: The silane is toxic and should not be inhaled. Take care to work in a fume hood and to wear nitrile gloves when handling the silane. This includes placing the vacuum pump in the fume hood when pulling vacuum on the desiccator.\nRelease the vacuum from the desiccator and remove the silanized wafers. Rinse with water and use a steam of N2 to dry the wafers. At this point the wafers can be placed in storage until required.\n2. Microfluidic device fabrication\nNOTE: The soft-lithography process used to fabricate PDMS based multilayer microfluidic devices can be separated into three distinct steps: 1) The PDMS preparation of both the flow and control layers, 2) The alignment and bonding of the two PDMS layers, 3) The completion of the device.\nPDMS preparation",
    "Prepare two PDMS precursor solutions by combining the base and curing agents in a plastic beaker and using a mixing rod to stir the two components until fully mixed. The control layer requires 20 g of base agent and 1 g of curing agent (20:1 ratio). The flow layer requires 40 g of the base agent and 8 g of the curing agent (5:1 ratio). Degas the solutions in a desiccator.\nPlace the flow layer wafer in a Petri dish and pour the 5:1 ratio PDMS mixture over the wafer. Degas the PDMS for 30 min to remove air bubbles.\nSpin coat the control layer wafer (prepared using the negative SU8 3050photoresist) with 20:1 ratio PDMS. Pour 5-10 mL of the PDMS onto the center of the wafer and run the following spin protocol (retain the left over PDMS for later use): spin at 500 rpm for 15 s (100rpm/s), increase the spin speed to 1450 rpm (300 rpm/s) for 45 s, and then decelerate the wafer to 0 rpm (200 rpm/s).\nTo ensure a homogeneous PDMS film thickness, place the PDMS coated wafer on a level surface in a closed Petri dish (to avoid dust contamination). Let the wafer sit for 30 min.\nRemove the flow layer from the desiccator and place both the flow and control layers in an oven (80 °C). Cure both layers for 28-30 min and remove when the PDMS is malleable enough to manipulate, whilst remaining slightly sticky. Immediately proceed with the alignment process.\nAlignment and bonding\n\t\nUsing a scalpel, remove each of the four devices from the PDMS on the flow layer wafer. Upon removing the PDMS layer from the silicon wafer, immediately cover the feature side with scotch tape to avoid dust particle contamination.",
    "Roughly align the flow layer blocks on the control layer by eye, placing the feature side of the device into contact with the control layer PDMS. Subsequently, make fine adjustments to the position of each of the flow layer blocks to align the channels of the flow layer with the control layer channels, using a stereo microscope to aid in the visualization of the adjustments.\nApply pressure to remove air pockets between the two PDMS layers. Pour the remaining 20:1 ratio PDMS saved earlier around the aligned flow layer blocks. Place 100 g weights on each of the devices to ensure sufficient contact during the bonding process.\nReturn the aligned devices (including the weights) to the 80 °C oven and leave them to bond for at least 1.5 h and no longer than 6 h.\nFinishing the Device\n\t\nRemove the wafer from the oven and extract each of the individual devices from the control layer wafer, covering the feature side of each device with scotch tape.\nIteratively, punch a single hole for each of the 9 flow layer inlets, 24 control layer channel inlets, and the single flow layer outlet of each device. Punch the device with the feature side facing up, using a camera to ensure holes are punched within the feature boundaries.\nFor each device, clean a single microscope slide with isopropanol and acetone and dry the slides under a stream of N2. Subsequently, place the microscope slides on a hot plate set to 150 °C for 15 min.",
    "Use oxygen plasma ashing to bond the PDMS devices to the glass slides, applying an ashing power of 50 W for 45 s. Ensure that the feature side of the device is facing upwards when ashing. Once complete, place the device feature side down on the glass slide, applying pressure to remove trapped gas between the surfaces.\nPlace the bonded devices onto a hot plate set to 110 °C for 1 h. Weights can be placed on top of the devices to improve adhesion of the device.\n3. Hardware setup\nNOTE: To achieve control over the microfluidic chips, numerous pieces of hardware need to be installed and connected with one another. Three distinct groups of hardware are required: 1) Pneumatic control system for the control channels, 2) A pneumatic pressure regulator to control flow of the reaction reagents within the device, and 3) A cooling system to cool the IVTT reaction solution prior to injection into the microfluidic device. An overview of the hardware setup is provided in Figure 1. It should be noted that the protocols provided here attempt to be as general as possible, however certain specific pieces of equipment used throughout our research are referenced. All hardware can be replaced by alternatives able to perform the same function. In such cases, the protocols here can be used to outline the general steps needed to set up the system and the requirements of each of the components. Alternative hardware setups are presented by Brower et al.48 and White and Streets49.\nPneumatic control system (see Figure 2)\n\t\nUsing the manufacturers’ protocol, establish a TCP connection between the fieldbus controller and the user workstation. Use control software (provided as supplementary files) to compose MODBUS commands which are sent via the TCP connection to controller, and actuate the solenoid valves.",
    "Expand the fieldbus controller with eight 4-channel digital output modules, one for each solenoid valve being used. Each solenoid valve presides over a connecting pin. Connect the positive wire to one of the four positive outputs on one of the digital output modules whilst connecting the negative wire to one of the ground ports of the digital output modules.\n\t\tNOTE: To get the system to work correctly, the solenoids should be connected systematically, with the first solenoid being connected to the first output port, the second solenoid to the second output port and so on. In our system, two valve arrays are used with 8 and 22 solenoid valves respectively. Output ports 1-8 connect to the 8-valve array, and output ports 9-30 connect to the 22-valve array.\nConnect both valve arrays to a compressed air source using 1/4” tubing. Use pressure regulators to set the pressure of the 22-valve array to 3 bar, and the 8-valve array to 1 bar.\nFlow pressure regulation (see Figure 3)\n\tNOTE: To flow fluids through the flow layer of the microfluidic device, a commercially available 4-port pressure regulator is used. The output pressure of each port is regulated via software provided with the pressure controller. Connect the pressure regulator to a computer using the supplied USB-connector.\n\t\nConnect the pressure regulator to a compressed air source, ensuring that the supplied pressure does not exceed the maximum pressure permitted by the regulator.\nConnect a male Luer to 3/32” barb connector to each of the four female Luer lock output ports of the pressure regulator. Connect a length of soft tubing (OD: 3 mm, ID: 1 mm, L: 10 cm) to the barb.",
    "Connect a second male Luer to 3/32” barb connector to the open end of the soft tubing and attach this to the fluid reservoir connector ports.\nUse the provided software to set the desired pressure of each outlet of the flow regulator, pressurising the reagents stored within the reservoirs to result in the flow of the reagents into the microfluidic device. The connection of the reservoirs to the microfluidic device will be discussed in the section 4.2.\nOff-Chip cooling setup (see Figure 4)\n\t\nUse PVC tubing (OD: 10 mm, ID: 6 mm) to connect the water-cooling system to the cold-plate water block using compression fittings. Fill the fluid reservoir of the water-cooling system with a coolant and gently tilt the unit to displace any trapped air, continuously adding coolant to the reservoir to ensure it remains full. When all the gas is removed from the system, fill the reservoir to approximately 90-95% of its maximal volume.\nCoil PTFE tubing (OD: 0.042”, ID: 0.022”) onto the cold face of the Peltier element and secure this with tape. Ensure that one end of the PTFE tubing is connected to the reservoirs of the flow layer pressure control system (as described in section 4.3). The other end of the PTFE tubing should protrude no more than 1 cm from the Peltier surface. Insert a 5 – 10 cm length of PEEK tubing (OD: 0.794 mm, ID: 0.127 mm) into the protruding end of the PTFE tubing. The filling of the tubing and connection to the microfluidic device is further explained in section 4.3.",
    "Place the hot face of the Peltier element onto the cold-plate of the water block, applying sufficient thermal compound to the two faces. Ensure that the tubing, Peltier element, and cooling block are in direct contact with one another at all times.\nConnect the Peltier element to the temperature controller (via a serial bus connector), such that the voltage supplied to the Peltier can be regulated. Securely place a thermistor on the Peltier surface, connecting the output to the temperature controller. After turning on the water cooler, adapt the voltage supplied to the Peltier until the temperature is stable at 4 °C.\n\t\tNOTE: With this setup, the Peltier temperature is controlled manually by adapting the supplied voltage, while the thermistor serves only to monitor the temperature.\n4. Preparing an experiment\nNOTE: Prior to starting an experiment, the microfluidic device must be prepared, and the reaction reagents must be inserted into the correct tubing for injection into the device. This section will discuss: 1) The connection of control channel tubing to the device, 2) The connection of uncooled inflow reagents to the device, and 3) The connection of cooled inflow reagents to the device.\nConnecting the control channel tubing\n\t\nFor each of the control channels of the microfluidic device, cut a length of tubing (OD: 0.06”, ID: 0.02”). At one end, insert the pin of a 23 G, 1/2” Luer stub and at the other insert a stainless steel connecting pin (OD: 0.65 mm, ID: 0.35 mm, L: 8 mm).\nConnect the Luer stub to a male Luer to 3/32” barb nylon connector. Insert the barb of the connector into a length of polyurethane tubing (OD: 4 mm, ID: 2.5 mm). Insert this polyurethane tubing directly into one of the solenoid valves.",
    "Attach a 23 G, 1/2” Luer stub to a syringe and insert this into a short (3-4 cm) piece of tubing (OD: 0.06”, ID: 0.02”). Place the open end of this tubing into a reservoir of ultrapure water and fill the syringe with ultrapure water.\nNumber each control channel of the microfluidic device as shown in Figure 5. For each channel (excluding control channels 1 through 3, which are not filled with water), find the corresponding tubing (connected to the solenoid valves) and insert a metal pin into the open end of the tubing attached to the syringe. Inject water into the control channel tubing until half the length has been filled.\nDisconnect the tubing from the syringe and insert the stainless-steel connector pin into the corresponding hole of the microfluidic device. Repeat for all control channels.\nUse the control interface to open all the solenoid valves. This will pressurize the fluid within the control channel tubing, forcing it into the microfluidic device and closing all the membrane based valves within the device. An example of open and closed membranes within the device are given in Figure 6.\nConnecting uncooled reagents to the device\n\t\nFor each of the uncooled reagents, cut a length of tubing (OD: 0.06”, ID: 0.02”) to connect the reservoir outlet to the microfluidic device inlets.\nTake one end of the tubing and insert this into the reservoir, ensuring that the tubing reaches the base of the reservoir. The reservoir tubing outlet should be tightened such that an air tight seal is achieved. Insert a stainless-steel connection pin (OD: 0.65 mm, ID: 0.35 mm, L: 8 mm) into the open end of the tubing.",
    "Attach a 23 G, 1/2” Luer stub to the end of a small (1 mL) syringe. Add a short length of tubing (OD: 0.06”, ID: 0.02”) to the Luer stub. Placing the end of the tubing into the desired reagent solution, fill the syringe with the reagent.\nInsert the stainless-steel connector pin into the polyurethane tubing connected to the syringe and fill the tubing with the reagent. When using small reaction volumes, the reagent will not enter the reservoir, and the tubing itself will act as the reservoir. Disconnect the syringe and insert the connector pin into one of the flow layer inlet holes of the microfluidic device.\nApply pressure to each of the reservoirs using the pressure regulator software to force the reagents into the microfluidic device.\nConnecting cooled fluids to the microfluidic device\n\t\nEnsure that the water cooler and Peltier element have been turned on, with the surface temperature of the Peltier set to 4 °C. Mount the cooling setup as close to the microfluidic device as possible, minimising the uncooled volume between the Peltier and the device inlet.\nConnect the open end of the PTFE tubing to tubing connected to one of the fluid reservoirs (as described in section 4.2) using a stainless-steel connector pin (OD: 0.65 mm, ID: 0.35 mm, L: 8 mm).\nConnect a small syringe (1 mL) to a Luer stub (23 G, 1/2”) with a short length of tubing (OD: 0.06”, ID: 0.02”) attached to the end. Fill the syringe with the to-be-cooled reagent (here, the IVTT reaction solution).",
    "Connect the PEEK tubing to the syringe via the connective tubing and apply constant pressure to the syringe, forcing the reagent through the PEEK tubing and into the PTFE tubing. Disconnect the PEEK tubing from the syringe and insert it directly into one of the flow channel inlets of the microfluidic device. When pressure is applied via the pressure regulator software the cooled reagent will be forced into the microfluidic device.\n5. Experimentation\nNOTE: Prior to performing experiments all the hardware and tubing connections detailed in protocols sections 3 and 4 should be completed, and all the reagents should be connected to the device. The experimental procedure can then be divided into four distinct parts: 1) The loading of the microfluidic device, 2) Preparing the microscope, 3) The calibration of the device, and 4) Performing the experiment. The custom virtual control interface (see Figure 7) used throughout this research is provided as a supplementary resource via the Materials list)\nLoading the microfluidic device\n\t\nPlace the microfluidic device, with all control and flow layer tubing attached into the microscope stage and close any openings on the incubator. Set the ambient temperature of the incubator to 29 °C. Ensure that the cooling system has been turned on and is set to 4 °C prior to initiating the experiment.\nEnsure all the flow and control channels are pressurized. Set the pressure of control channels 1-3 at 1 bar, and pressurize control channels 9-29 at 3 bar. The reagents require a pressure of between 20 and 100 mbar to be applied to the fluid reservoirs using the pressure regulator software.",
    "Remove air from the microfluidic device using one of the reagents. Close the outlet of the device (pressurize control channel 29) and simultaneously depressurize control channels 1-3, and 15-28. Then selectively depressurize the control channels of the multiplexer to allow the selected reagent to flow into the device. Use the microscope to monitor the removal of air.\n\t\tNOTE: In the case that reagents are not loading into the device correctly, or that the air bubbles are not being removed, the pressure can be increased up to 350 mbar.\nEnsure that all reagents flow correctly, without introducing air - using the Flush function in the control software. Monitoring of the fluid flow can be simplified by first loading a fluorophore and monitoring its displacement by individual reagents.\nPreparing the microscope\n\t\nUsing the microscope, locate any points of interest (a single point within each reactor is sufficient) within the microfluidic device, and store the coordinates thereof. These points will be imaged during the calibration and experimental processes.\n\t\tNOTE: During the calibration and experimental procedures included within the control software, the microscope is instructed to periodically capture images at the previously stored coordinates. To achieve this, the control software communicates with the microscope software, informing it to record new images. This communication is unique to each microscope setup, and as such this functionality has been modified within the provided software interface. Provided is a dummy executable, which can be modified by the end-user for compatibility with their own microscope system.\nCalibrating the microfluidic device\n\t\nDetermine the fluid volume displaced from each reactor during a single inflow step (pump sequence provided by peristaltically actuating control channels 15-17, comprising 6 MODBUS commands executed sequentially), by executing the calibration protocol provided in the software package.",
    "Set the following data fields within the control software: Elution Buffer Channel, Fluorophore Channel, Number of Dilution Cycles (default is 10 dilutions), Number of Inflow Steps (default is 15 steps), Number of Mixing Cycles (default is 4 cycles), and Time between Mixing Cycles (default is 0 seconds). Initiate the calibration by pressing Perform Calibration Experiment.\n\t\tNOTE: During the calibration process, all reactors are filled with a fluorophore and images are recorded. Subsequently, a series of dilutions are performed where an eluent is metered into the reactors (based on the set number of inflow steps), thus displacing the fluorophore. After thoroughly mixing, new images are taken. This process repeats for the set Number of Dilution Cycles.\nUpon completion of the calibration, follow the steps presented by the control software, completing the analysis of the calibration experiment.\n\t\tNOTE: The analysis will provide users with the Refresh Ratio for each reactor based on the fluorescence decrease recorded during each Dilution Cycle. This value indicates the fraction of the reactor volume displaced by the set Number of Inflow Steps. In turn, this value will be used during experiments to determine how many inflow steps are required to displace a specific reactor volume.\nPerforming the Experiment\n\t\nSet the required values for the desired experiment within the virtual control interface. Critical is the Refresh Fraction [%] which determines the reactor volume displaced per experimental cycle and should be set between 15 and 40%.\n\t\tNOTE: The specific experimental protocol will determine which fields of the control interface should be set prior to the initiating the experiment. Some minor coding will be required to adapt the control interface for novel experiments.\nInitiate the experimental protocol by pressing the Perform Experiment button in the control interface.",
    "NOTE: Unaltered, the provided software initiates a simple protein expression. Reactors 1 and 8 are utilized as controls, while reactors 2-7 house identical experiments. Here, 75% of the reactor volume comprises IVTT solution, and 25% is either ultrapure water or a 2.5 nM linear DNA solution. Dilutions occur every 15 minutes, with 30% of the reactor volume being displaced per dilution. Images are recorded at the end of each dilution cycle.\n6. Data analysis\nNOTE: Scripts have been provided for the analysis of the images (see supplementary files or the Table of Materials), making use of the ‘bfopen’ analysis package, which is required for the reviewing of ‘.nd2’ files (provided by our microscope setup).\nRun the analysis script ‘calibrationScript.m’ and once prompted select the desired ‘.nd2’ file. A single reactor image will be shown with which the correct image intensity can be determined. Use the slider to optimize the image intensity such that the edges of the microfluidic channel are clearly visible.\nAn image of the reactor will be shown. Within this image, select an area inside the reactor channel of which the fluorescence intensity should be determined.\n\tNOTE: The fluorescence intensity of each reactor, for each recorded image will be determined with the results displayed in a simple plot, allowing the visualisation of the results."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}