{
  "id": 3835,
  "origin_website": "Cell",
  "title": "Application of high-throughput 5′P sequencing for the study of co-translational mRNA decay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nRNA extraction\nTiming: 2 h\nObtain total RNA from sample of interest\nHarvest 1.5 mL cells from mid-log grown yeast (OD600 density ~ 0.6–0.8) using a standard bench microcentrifuge at 30 s, 8000 rpm at room temperature.\nExtract total RNA using phenol-chloroform extraction method.\nSet up the following tubes:\nTube 1: 500 μL phenol:chloroform:IAA (125:24:1)\nTube 2: 500 μL chloroform:IAA (24:1)\nTube 3: 40 μL 3M NaOAc (made with nuclease-free H2O)\nAdd (approx. 200 μL) of glass beads and 150 μL LET in yeast cell pellet.\nAdd 150 μL phenol. Vortex at 20°C–25°C in vortex mixer for 2 min at top speed.\nAdd 250 μL nuclease-free H2O and 250 μL phenol:chloroform:IAA.\nVortex in vortex mixer for additional 2 min followed by centrifugation at 4°C for 2 min at 14,000 × g.\nRemove aqueous phase (approx. 450 μL) and add to Tube #1. Vortex 30 sec and spin 1 min at 14,000 × g.\nRemove aqueous phase and add to Tube #2. Vortex 30 sec and spin 1 min at 14,000 rpm.\nRemove aqueous phase (approx. 400 μL) and add to Tube #3 mix well. Add 1 mL 95% (vol/vol) ethanol, mix and place at −20°C/−80°C, 30 min.\nCollect RNA by centrifugation at 4°C for 20 min at 14,000 × g.\nWash pellet with 500 μL 70% (vol/vol) cold ethanol and re-centrifuged for 10 min.\nDrain supernatant and air-dry pellet for ~ 3 min.\nResuspend pellet in 10 μL nuclease-free water.\nCritical: Phenol and Chloroform are acute toxic. Be careful when handling phenol and chloroform, always wear gloves, lab coat and perform manipulations following local safety regulations in fume hood.\nCritical: To avoid RNA degradation, perform RNA extraction with phenol:chloroform as fast as possible.",
    "Check RNA quality by running a Bioanalyzer RNA gel or an agarose gel.\nNote: Any alternative approach producing high-quality RNA may be used instead.\nRemoval of DNA from RNA samples\nTiming: 45 min\nAny contaminant DNA is removed from the sample.\nStarting with 6 μg of total RNA, prepare the following mix and incubate the samples for 20 min at 37°C.\ntable:files/protocols_protocol_557_3.csv\nNote: It is possible to lower starting material to 500 ng in total. However, low input material usually decreases library complexity and increase the PCR duplicates.\nAdd 2 μL of TURBO DNAse inactivation reagent and incubate 5 min at 20°C–25°C (tapping once in a while).\nCentrifugate at 14,000 × g for 2 min at 20°C–25°C and transfer the supernatant to a clean precooled tube.\nNote: This pellet is normally quite loose, repeat the centrifugation if it is resuspended and avoid the carryover of any DNase inactivation reagent.\nEthanol precipitate the DNA-free RNA by adding 2.5 volumes (with respect to the sample volume) of 95% (vol/vol) ethanol, a 1/10 volume of 3 M sodium acetate, 1 μL of glycoblue. Mix sample by gently inverting and incubate it for minimum 30 min at −20°C/−80°C.\nPause Point: The ethanol precipitation can be left 16–18 h at −20°C/−80°C.\nCentrifugate at 14,000 × g for 30 min at 4°C to precipitate the RNA.\nWash the pellet with 500 μL of cold 70% (vol/vol).\nCentrifugate 14,000 × g for 10 min at 4°C.\nRemove the remaining ethanol, air-dry pellet for 3 min and resuspend it in 1.8 μL of RNAse-free water.\nNote: If the next step is the single-strand RNA ligation, RNA can be directly resuspended in ligation mix (step 11) and top up RNAse-free water to 10 μL .",
    "Critical: When handling with RNA samples, always keep them in RNase-free environment and place samples on ice.\nSingle-strand RNA ligation\nTiming: 2 h\n5′ phosphate molecules are ligated with RNA oligos including unique molecular identifiers (UMI).\nPrepare a 10 μL reaction mix with the components listed below:\ntable:files/protocols_protocol_557_4.csv\nCritical: Add PEG provided by T4 RNA ligase 1 in the end of the reaction mix, as it is sticky at high concentration.\nIncubate sample at 25°C for 2 h.\nIncrease the sample volume with RNase-free water to 40 μL.\nPurify the sample using 1.8× volumes of RNAClean XP beads, as described by the manufacturer’s instruction.\nAdd 72 μL of RNAClean XP beads and mix sample by several times pipetting up and down.\nIncubate at 20°C–25°C for 5 mins until RNA bind to beads.\nPlace the PCR tubes at the magnets stand and wait till the solution is clear (~2 mins)\nRemove the supernatant.\nWash beads twice with 200 μL of freshly made 70% (vol/vol) ethanol.\nRemove the ethanol and let the beads slightly dry for 1 min.\nElute samples in 12 μL RNase-free water.\nNote: avoid over drying the beads as that might result in sample loss.\nReverse transcription\nTiming: 1.5 h\ncDNA library is transcribed by the defined ratio of oligo-dT and random hexamer.\nPrepare a reaction mix as the components listed below:\ntable:files/protocols_protocol_557_5.csv\nCritical: This optimized ratio of oligo-dT and random hexamer increase coverage in the 3′ region of the gene. Altering the ratio of oligo-dT and random hexamer will lead to differences in the relative 5′/3′ coverage.\nDenature the sample at 65°C for 5 min. Then place on ice directly.\nTo each tube, add 6.2 μL of mixture containing the following components:\ntable:files/protocols_protocol_557_6.csv\nAdd 1 μL of SuperScript II reverse transcriptase to each tube.",
    "Incubate the sample at 25°C for 10 min, 42°C for 50 min and inactivate reaction at 70°C for 15 min.\nNote: Any commonly reverse transcriptase could be used instead of SuperScript II.\nPause Point: Samples can be stored at −20°C.\nRemove template RNA\nTiming: 0.5 h\nRemoving any excess of RNA, avoids that cDNA-RNA duplexes are degraded during duplex-specific nuclease (DSN) treatment.\nRemove the template RNA by adding 100 mM NaOH (8 μL) to the sample (from step 21), and incubate at 65°C for 20 min.\nNeutralized sample by adding 100 mM Tris-HCl, pH = 7.0 (8 μL).\nNote: It is also possible to remove excess RNA in cDNA-RNA duplex by using RNaseH.\nPurify the sample using 1.8× volumes of Ampure XP beads, as described by the manufacturer’s instruction.\nAdd 64.8 μL of Ampure XP beads and mix sample by several times pipetting up and down.\nIncubate at 20°C–25°C for 5 mins until samples bind to beads.\nPlace the PCR tubes at the magnets stand and wait till the solution is clear (~2 mins).\nRemove the supernatant.\nWash beads twice with 200 μL of freshly made 70% (vol/vol) ethanol.\nRemove the residual ethanol and allow the beads to slightly dry for 1 min. Elute in 8 μL of RNase-free water.\nNote: avoid over drying the beads as that might result in sample loss. If Ampure XP beads is not available, alternative beads such as MagSi magnetic beads (cat: MDKT00010075) can also be used.\nDuplex-specific nuclease (DSN) for rRNA depletion\nTiming: 0.5 h\nrRNA depletion is based on the designed DNA probes targeting ribosomal RNA (i.e., RDN18, RDN25, RDN5.8, RDN5).\nSet up the following 16 μL reaction:\ntable:files/protocols_protocol_557_7.csv",
    "Critical: The concentration of rRNA depletion probe mix is optimized for using 6 μg of total RNA as starting material. If the input RNA increases, the rRNA depletion probes should increase accordingly. The ratio between depletion probe mix and targeted molecules (cDNA) is around 2:1.\nDenature sample for 2 min at 98°C using thermocycler.\nIncubate the sample for 5 min at 68°C.\nAdd pre-warmed (2 min at 68°C) mix containing the following components:\ntable:files/protocols_protocol_557_8.csv\nCritical: To avoid unspecific binding of probes to cDNAs during the treatment and thus unspecific degradation, it is critical to keep the reaction temperature at 68°C when mixing samples (from step 27 ) with DSN enzyme mix (from step 30). Pre-warm the reaction mix, using a separate PCR block and keep samples in the thermocycler when adding the pre-warmed mix.\nMix sample by pipetting several times and incubate for 20 min at 68°C in a thermocycler.\nTo inactivate DSN enzyme, add 20 μL of DSN stop solution (2×), mix contents and spin the tube briefly in a micro-centrifuge.\nIncubate the sample for 10 min at 68°C temperature.\nPurify the sample using 1.8× volumes of Ampure XP beads, as described by the manufacturer’s instruction.\nAdd 72 μL of Ampure XP beads and mix sample by several times pipetting up and down.\nIncubate at 20°C–25°C for 5 mins until samples bind to beads.\nPlace the PCR tubes at the magnets stand and wait till the solution is clear (~2 min).\nRemove the supernatant.\nWash beads twice with 200 μL of freshly made 70% (vol/vol) ethanol.\nRemove the residual ethanol and allow the beads to slightly dry for 1 min. Elute in 9.6 μL of RNase-free water.\nNote: avoid over drying the beads as that might result in sample loss.\nLibrary PCR amplification\nTiming: 1.5 h",
    "PCR is used to generate an Illumina compatible sequencing library\nTo amplify the library by PCR, prepare the following mix:\ntable:files/protocols_protocol_557_9.csv\nCritical: To increase the sequencing complexity per sample and enable multiplexing, we use different oligos for each sample (PE2_MPX, Table 2[href=https://www.wicell.org#tbl2]). This also applies to dual index barcoding with PE1 compatible multiplexing oligos. To better multiplex samples and avoid base calling issues afterwards, please use different barcodes for sequencing base composition balance. For more detailed information related to base composition balance, please check on Illumina website.\ntable:files/protocols_protocol_557_10.csv\n∗refers to S-linkage between the two bases r refers to a RNA base. Barcodes are identified in bold black. Sequences are represented in 5′ to 3′orientation. # Oligonucleotide sequences © 2006–2021 Illumina, Inc. All rights reserved.\nNote: Any good quality used thermostable DNA polymerase used for sequencing library preparation could be used instead.\nRun the following PCR program:\ntable:files/protocols_protocol_557_11.csv\nBring the volume to 100 μL with nuclease-free water.\nAdd 0.7× Ampure XP beads to the sample to bind the long DNA molecules. For 100 μL of sample, add 70 μL of beads and mix by pipetting. Incubate at 20°C–25°C for 5 mins.\nPlace the PCR tube on the magnets stand and wait till the solution is clear. Transfer the supernatant to a new tube.\nCritical: At this moment, the molecules of interest are in the supernatant, not on the beads.\nAdd with 0.2× Vol. (respect to the original sample volume) of Ampure XP beads (20 μL respect to 100 μL) to the recovered supernatant from step 41. Mix the sample by pipetting up and down and incubate at 20°C–25°C for 5 mins.\nPlace the PCR tubes at the magnets stand and wait till the solution is clear (~2 mins).\nRemove the supernatant",
    "Wash beads twice with 200 μL of freshly made 70% (vol/vol) ethanol.\nRemove the residual ethanol and allow the beads to slightly dry for 1 min. Elute in 10 μL in water or EB buffer (10 mM Tris-HCl, pH 8.0).\nMeasure the final library concentration by Qubit using the dsDNA HS assay kit and check the size distribution by Bioanalyzer.\nSequence the libraries using pair-end 75 cycles Illumina NextSeq 500.\nNote: For pair-end 75 cycles sequencing in this case, using 60 bp for read1 and 15 bp for read2. Read2 will identify the molecule primed by either oligo-dT or random hexamer. In general, we recommend at least 6 million raw reads per yeast sample. Any alternative Illumina platform could be used instead of a NextSeq 500. Read sequencing length can be altered depending on the complexity of the genome of interest and the ability to uniquely map reads to the genome."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Gene Expression",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}