{
  "id": 13589,
  "origin_website": "Jove",
  "title": "The Power of Simplicity: Sea Urchin Embryos as in Vivo Developmental Models for Studying Complex Cell-to-cell Signaling Network Interactions",
  "procedures": [
    "1. High Throughput Morpholino Design Strategy\nIdentify a gene(s) of interest (e.g. candidate gene approach, cis-regulatory analysis, RNAseq and/or proteomic differential screens).\nUse genomic, transcriptomic, and gene expression data available on frequently updated websites (e.g. SpBase http://www.echinobase.org​20 and S. purpuratus Genome Search http:///urchin.nidcr.nih.gov/blast/index.html) to determine that the spatiotemporal expression profile overlaps with the developmental mechanism in question. If no expression data is available, then generate qPCR primers and/or an antisense in situ probe to assess the gene expression pattern.\nAfter determining the spatial and temporal expression pattern, obtain the DNA sequence from the genomic web sites.\n\t\nFor generating translation-blocking morpholino oligonucleotides, obtain sequence of the 5' un-translated region (5' UTR) directly upstream from the initiation codon from expressed sequence tag (EST) databases available on SpBase or S. purpuratus Genome Search websites. If this information is unavailable for the gene of interest, then perform 5' RACE.\nTo design a splice-blocking morpholino, search for the genomic sequence including the exons and introns using the scaffold blastn tool in SpBase or S. purpuratus Genome Search tool.\nUse the oligonucleotide designing website http://oligodesign.gene-tools.com in order to design the desired 25 base pair morpholino sequence.\n\t\nFor a translational-blocking morpholino, use the mRNA sequence from 5' to 3' as the source of translational target sequence. Include the 5' UTR sequence (approximately 70 nucleotides upstream of the transcription start site) plus 25 bases of coding region (downstream of the start site) with the start codon marked with parenthesis (ATG).\nFor a splice-blocking morpholino, select intron-exon or exon-intron boundary sequence and include 50 bases (25 bases of exon sequence and 25 bases of intron sequence) around the boundary regions. Scan the genome with the morpholino sequence to verify that the sequence is unique.\n2. Microinjection of Morpholino Oligonucleotides",
    "Prepare 3 mM stock solutions of the morpholino oligonucleotides by adding 100 µL of nuclease-free water into the 300 nmol morpholino vial.\n\tNOTE: Do not use DEPC treated water for the re-suspension because diethyl pyrocarbonate can damage the morpholino.\nFor the first reconstitution spin down the vial containing the stock oligonucleotide solution for 30 s at full speed (14,000 - 16,000 x g), briefly vortex, heat at 65 °C for 5 to 10 min, briefly vortex, and keep the morpholino stock at room temperature for at least 1 h. Morpholino stock solutions are stored from -20 °C to +4 °C.\nPrepare injection solution containing morpholino oligonucleotides at the desired concentration. This solution usually contains 20% glycerol or 125 mM KCl as a carrier and 15% FITC-Dextran (fluorescein isothiocyanate dextran 10,000 MW 2.5 mg/μL stock solution). FITC-Dextran and other fluorescent dextran conjugates are routinely used to identify injected embryos by epifluorescence microscopy. Store injection solutions at -20 °C.\nHeat the morpholino solution at 65 °C in a heat block or water bath for at least 2 - 5 min.\nBriefly spin the morpholino solution for 30 s at full speed (14,000 - 16,000 x g), vortex for 1 min and centrifuge at full speed (14,000 - 16,000 x g) for at least 10 min.\nLoad the injection needles with the morpholino solution. For a detailed microinjection protocol please see Stepicheva and Song, 201421 and Cheers and Ettensohn, 200422.\n3. Fixation and In Situ Protocol at 24 h Post-fertilization (hpf) in S. purpuratus Embryos\nNOTE: This protocol is modified from Arenas-Mena et al., 200023 and Sethi et al., 201424.\nFixation",
    "Add several drops of fixative (see below) to wells containing embryos, mix gently by pipetting, and allow them to settle. Remove the fixative solution, and then mix embryos with two additional 180 µL washes of fixative.\n\t\tNOTE: It is important to thoroughly mix the embryos during the washes by gentle pipetting up and down several times. Failure to do so can lower the signal to noise ratio.\nLeave the embryos to fix in the second fixative wash for 50 min to 1 h at room temperature (RT) in 4% electron microscopy grade paraformaldehyde consisting of 10 mM MOPS pH 7.0, 0.1% Tween-20, and artificial seawater (ASW). Make this solution fresh each time for best results. In addition, for ease and practicality embryos are fixed in 96-well plates.\n\t\t\nFor 20 mL fixative use 5 mL 16% paraformaldehyde, 15 mL ASW, 200 µL 1 M MOPS pH 7.0, and 20 µL Tween-20.\nWash 5 times at RT with 180 µL of MOPS wash buffer consisting of 0.1 M MOPS pH 7.0, 0.5 M NaCl and 0.1% Tween-20 for at least 5 min or until embryos drop to the bottom of the well. Again, It is important to thoroughly mix the embryos into the wash buffer by gently pipetting up and down several times. MOPS wash buffer can be used for 2 days if stored at 4 °C.\n\t\t\nFor 40 mL MOPS wash buffer use 4 mL 1 M MOPS pH 7.0, 4 mL 5 M NaCl, 32 mL dH2O, and 40 µL Tween-20.\nFixed embryos can be stored at 4 oC for 2 days.\n\t\t\tNOTE: If storing fixed embryos longer, then add 0.2% sodium azide in MOPS wash buffer to prevent bacterial growth.\nPre-hybridization",
    "Aspirate the MOPS wash buffer and add 180 μL of a 2:1 ratio of MOPS wash buffer to hybridization buffer, mix embryos into the solution by gentle pipetting several times, and incubate for at least 20 min at RT. Hybridization buffer consists of 70% formamide, 0.1 M MOPS pH 7.0, 0.5 M NaCl, 1 mg/mL BSA and 0.1% Tween-20.\n\t\t\nFor 40 mL hybridization buffer use 4 mL 1 M MOPS pH 7.0, 4 mL 5 M NaCl, 4 mL dH2O, 0.04 g BSA, and 40 µL Tween-20. Mix well by vortexing, add 28 mL formamide, and vortex again.\nRemove the 2:1 ratio of MOPS wash and hybridization buffers and add 180 µL of a 1:2 ratio of MOPS wash buffer to hybridization buffer, mix embryos into the solution, and incubate for at least 20 min at RT.\nBefore probe hybridization gently mix embryos into 100 - 150 µL of hybridization buffer. Incubate embryos at 50 °C for at least 1 h.\n\t\tNOTE: Incubating embryos overnight is acceptable. Before incubating, seal the wells with an adhesive sheet in order to prevent evaporation.\nHybridization\nIn a separate tube add 0.1 - 0.3 ng/µL of probe and 500 µg/mL yeast tRNA into hybridization buffer, then vortex gently to create probe solution. Yeast tRNA is added to the probe solution to decrease non-specific binding of the anti-sense probe. Preheat this solution to 50 °C, and aspirate hybridization buffer.\nMix pre-hybridized embryos into 100 µL of the probe solution, seal with an adhesive sheet, and hybridize at 50 °C for 2 to 7 days depending on the probe (the foxq2 probe can be incubated for 2-days).",
    "NOTE: Incubation times will vary based off the probe. Some genes expressed at low levels require up to a 7-day incubation. 96-well plates can be placed in a humidity box as insurance against evaporation if the adhesive sheet fails to seal properly.\nWash 5 times at 50 °C with 180 μL of freshly made MOPS wash buffer for a total of 3 h. Then, wash 3 times (15 min) with 180 µL of MOPS wash buffer at RT. Remember to mix embryos into the wash buffer each time by gently pipetting several times.\nAntibody Incubation\nAspirate the MOPS wash buffer and mix embryos in 180 µL of blocking buffer consisting of 10% Normal Sheep Serum and 5 mg/mL BSA in MOPS wash buffer and incubate for at least 45 min at RT or 4 °C overnight.\nRemove blocking buffer and then mix embryos into blocking buffer containing a 1:1,500 dilution of alkaline phosphatase-conjugated anti-digoxigenin antibody diluted in blocking buffer. Incubate overnight at RT in a sealed plate to avoid evaporation. NOTE: Do not leave antibody on longer than overnight.\nWash embryos 6 times (5 min or until embryos drop) in MOPS wash buffer at RT. Embryos can be stored overnight at 4 °C.\nIn situ development\nWash embryos 3 times (10 min) at RT with freshly made pH 9.5 buffer consisting of 0.1 M Tris pH 9.5, 100 mM NaCl, 50 mM MgCl2, 1 mM Levamisole, and 0.1% Tween-20.\n\t\t\nFor 20 mL pH 9.5 buffer use 2 mL 1 M Tris pH 9.5, 400 µL 5M NaCl, 1 mL 1 M MgCl2, 20 µL Tween-20, 16.6 mL dH2O, and 0.0048 g Levamisole.",
    "Incubate embryos at 37 °C in staining buffer protected from light. Staining buffer consists of 10% Dimethyl Formamide, 4.5 µL/mL 4-Nitro blue tetrazolium chloride (NBT), and 3.5 µL/mL 5-Bromo-4-chloro-3-indolyl-phosphate (BCIP) in freshly made pH 9.5 buffer.\n\t\t\nFor 1 mL of staining buffer use 100 µL Dimethyl Formamide, 4.5 µL NBT, and 3.5 µL BCIP.\nStop the alkaline phosphatase reaction by washing 3 to 5 times in MOPS wash buffer. The reaction with the foxq2 probe typically takes 30 min to 1 h. Some probes may need overnight incubation at either RT or 4 °C.\nMix embryos into a solution of 70% MOPS wash and 30% glycerol. The glycerol provides a refractive index necessary for microscopy. Embryos can be stored in this solution for several weeks. Seal the plates with plastic paraffin to prevent evaporation.\nSlide preparation and image capturing\nPrepare a slide by arranging three small strips of double-sided tape into a triangle with small gaps between strips onto a slide.\nTransfer the embryos in the 70% MOPS wash and 30% glycerol solution to the center of the triangle and cover with a coverslip.\nSeal the coverslip by applying a layer of nail polish around the edges of the coverslip.\nCapture images using a compound light microscope with a 20X objective and an attached camera.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}