{
  "id": 17033,
  "origin_website": "Jove",
  "title": "Three-Dimensional Reconstruction for the Whole Lung with Early Multiple Pulmonary Nodules",
  "procedures": [
    "For the present study, ethical clearance was obtained from The Ethics Committee of Dongzhimen Hospital, affiliated with Beijing University of Chinese Medicine (DZMEC-KY-2019.90). In this specific case, a methodical description of the research approach is provided, outlining a case involving a 65-year-old female patient with multiple pulmonary nodules. This patient provided informed consent for her diagnosis through digital modeling and authorized the use of her data for scientific research purposes. The model reconstruction function is derived from a commercially available software tool (see Table of Materials).\n1. Data preparation and isovoxel transformation\nDICOM (Digital Imaging and Communications in Medicine) data preparation and data properties\n\tNOTE: The variation in parameters remains relatively unaffected by the research methodology.\n\t\nCopy the patient's DICOM data to a defined working directory.\nUsing the file browser, examine each file directory to identify the image sequence with the highest number of scanning layers for analysis.\nEmploy the Dicominfo function within MATLAB by providing DICOM files as input parameters. This will enable you to extract essential parameters, such as slice thickness and pixel spacing, directly within the MATLAB environment.\n\t\tNOTE: These parameters hold significant importance in configuring the display rate for the 3D volume. In the case of the dataset utilized in this study, the slice thickness measured 1 mm, the pixel spacing equated to 0.7188 mm, and a total of 387 layers were scanned.\nCorrect sorting of scanned data\n\tNOTE: The sequence of every image should be sorted for volume construction.\n\t\nRetrieve the location data for each image using the Dicominfo function. Access the location information by referencing info.SliceLocation within the MATLAB workspace.\nSave the location data into a variable using the SliceLocation function and generate a plot for it (Figure 1).",
    "Enhance the plot by adding a data point to it using the Data Tips button situated in the upper-right corner of the GUI. This data point should mark the maximum location of the normal sequence, which corresponds to the topmost location in the patient's imaging (Figure 1).\nOrganize all the images by sorting them and then extract the images ranging from the first location to the maximum location. Achieve this by invoking the VolumeResort function.\nSafeguard the volume data, which consists of 512 pixels by 512 pixels by 340 layers, from the valid images along with their sorted index. This information will be valuable for future reference, particularly in the context of identifying important nodules.\nIsovoxel transformation\n\t​NOTE: 3D Isovoxel transformation allows subsequent processing to maintain the same display scale in all dimensions.\n\t\nExamine the three-dimensional scale of a 3D volume, which is 512 pixels x 512 pixels x 340 layers, using the size function in Matlab.\nTo view the 3D-volume (Figure 2) using the Slice_View command function, record the sequence scan range containing the lungs from 60 to 340. Then, simply use the command V1=V0(:,:,60:340) to obtain a 3D-volume containing all the data of the entire lung. The size of V1 is 512 pixels x 512 pixels x 281 layers.\nUtilize the MATLAB command function dicominfo to obtain the slice thickness of the image sequence, which is 1 mm, and the pixel spacing is 0.7188. Calculate the number of z-axes for the isovoxel transformation with the command: round (281 x 1/0.7188). The number of layers for the isovoxel transformation should be 391.\nUse the Matlab command function imresize3 to perform isovoxel transformation on V1. Execute the script using the command V2=imresize3(V1, [512, 512, 391]). Then use the 3D_Slice_View function to view the isovoxel transformed 3D-Volume (Figure 3).",
    "2. Removal of noise interference caused by Computed Tomography (CT) equipment\nNOTE: In Figure 2, the high-intensity signal representing the CT equipment's patient couch is visible, which can interfere with image segmentation. To eliminate this interference, a spatial filter design is required.\nUtilize the Data Tips button in Figure 2 to add continuous data points within the interactive interface. This will allow one to create a line connecting these points, effectively excluding the patient couch. Next, right-click on the Data Tips and select Export Cursor Data to Workspace to export the reference boundary for spatial filtering to the MATLAB workspace (Figure 3). The boundary scatter matrix in this case is named 'CI'.\nInvoke the Noise_Clean function to apply spatial filtering to V2, using the input parameter 'CI' from the workspace. This operation will yield a 3D volume that removes the interference signal from the CT equipment. Finally, use the Slice_View command function to visualize the resulting volume, as demonstrated in Figure 4.\n3. Extraction of lung contour\nBegin by selecting a slice to serve as a template within the GUI displayed in Figure 4. For instance, choose the 232nd image for the image segmentation design and assign it to a variable 'I' using the command I=V2(:,:,232). Then, open the MATLAB Image Segmenter GUI by executing the command imageSegmenter(I), as depicted in Figure 5.\nFigure 5 showcases an array of image segmentation tools. To start, select the Auto Cluster tool from the toolbar at the top and execute the command by clicking the left mouse button. The image will automatically be divided into two classes. Given the denoising process performed in step 2.2, image segmentation at this stage becomes relatively straightforward.",
    "Next, click on the Show Binary button in the upper right corner to display the image in black and white binary. At this point, the lung region will appear black. To make the lung region white, select the Invert Mask button from the top toolbar and execute the command by clicking the left mouse button.\nTo eliminate the white color outside the lung area, select the Clear Borders button on the top toolbar and execute it by clicking with the left mouse button. After this step, only the white-colored lung area will remain. However, any black shadows remaining within the lung area at this point need to be filled. To achieve this, select the Fill Holes button in the toolbar, and the result after clicking the button is shown in Figure 6.\nAll the steps involved in lung image segmentation are presented in the GUI of Figure 6 at the lower left corner. By clicking the Export button in the upper right corner, save these automated steps as a function for batch-processing lung region segmentation. In the pop-up Script Editor, click the Save button to save the function in the current working directory.\n4. 3D reconstruction for the whole lung with multiple pulmonary nodules\nNOTE: Taking the dot product of the lung segmentation image of each image with the original image is equivalent to performing 3D spatial filtering on the volume, effectively filtering out interference signals outside the lungs and obtaining the 3D structure of the lungs.\nInitiate the 3Dlung_Volume function within the MATLAB workspace.",
    "NOTE: This function conducts image segmentation on each image using the output from step 3.5. It then executes a dot product operation between the binary lung mask and the original image to generate a new 3D-volume exclusively containing lung tissue. In the GUI (Figure 7) that appears after the function completes, one can visualize and perform Maximum Intensity Projection (MIP) operations on the entire 3D lung volume.\nWithin the GUI, find the first drop-down menu in the top right corner. Select MIP Projection and then choose the jet colormap from the Built-in Colormaps options below. Next, in the drop-down menu located in the top right corner of the fourth view (3D Volume View), select Maximize. This action will yield a whole lung 3D volume (Figure 8) that can be observed from any angle, moved, and manipulated as needed.\n\tNOTE: In the human-computer interaction section illustrated in Figure 8, one can adjust the viewing angle freely by holding down the left mouse button and moving it. Scrolling the middle mouse button allows one to zoom in or out.\nFor advanced contrast and color enhancement operations, utilize the control panel on the right side of the GUI.\n5. Focus on the examination of dominant pulmonary nodules\nNOTE: In 3D space (Figure 8), the dominant lesion area among multiple pulmonary nodules becomes distinctly visible. The number, size, and concentration of these nodules are critical features of the dominant lesion, offering valuable insights into disease assessment.\nOnce more, invoke the Slice_View function, but this time input the entire lung's 3D volume obtained in step 4.2. Within the resulting GUI (Figure 9), use the bottom scroll bar to navigate to the region where the dominant lung nodules are situated, spanning scans 48 to 70.",
    "Proceed by calling the 3Dlung_Horizon function to conduct 3D reconstruction of the Region of Interest (ROI) encompassing sections 48 to 70 from the whole lung's 3D volume. This action will generate a GUI interface tailored for visualizing pulmonary nodules, as illustrated in Figure 10. Within this GUI, one can explore the lesion's detailed features from various angles.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}