{
  "id": 8291,
  "origin_website": "Bio",
  "title": "Purification of Human Monocytes and Lymphocyte Populations by Counter Current Elutriation – A Short Protocol",
  "procedures": [
    "Receive 450 ml peripheral blood from normal human donor drawn in CPD AS-1 Using an RC-3B Centrifuge, spin a 450 ml bag of blood upright with no brake, 25 °C, 1,665 x g, for 7 min. Takes approximately 30 min to come to a stop without the brake.    Assemble elutriator and chambers  See Beckman JE6B Elutriation System and Rotor Assembly Manual.    Sterilize and prepare elutriation chamber   Attach 1 ml pipet to elutriation pump tubing and transfer tubing (by submerging in each solution) to each of the following in sequence:   Wash #1 10% fresh bleach (in sterile milliQ H2O)    Wash #2 300-500 ml: sterile milliQ H2O    Wash #3 300-500 ml: 70% EtOH (sterile milliQ H2O)   Spin elutriator rotor by hand for 30 sec to remove air pockets.   Wash #4 300-500 ml: sterile milliQ H2O   Wash #5 300-500 ml: sterile PBS     Finally, equilibrate tubing and chamber with elutriation buffer (with 100-200 ml approximately 11-12 ml/min.flow rate).      Collect blood from centrifuge   Sit blood bag on extruder carefully and place onto the hooks on extruder.   Wipe tube of blood bag and scissors with alcohol wipes to sterilize. Wipe tubing end with alcohol, attach clamp, and insert into a 250 ml plasma tube (if collecting plasma for later use) or waste (if not collecting plasma).   With clamp shut on tubing, release press to squeeze bag gently.   Open clamp to control flow to a fast drip/slow stream. Stop plasma collection when plasma is approximately 1 inch from top of bag.   Transfer blood bag tube to T75 flask containing 50 ml PBS 0.02 mM EDTA, where you will collect approximately 25 ml plasma and 20 ml erythrocytes plus white cells) often called the buffy coat. Swirl flask gently. Total volume in flask should be approximately 90-100 ml.",
    "Tilt 50 ml tube containing 14-18 ml LSM and using a 10 ml pipette, layer approximately 30 ml buffy coat-PBS-EDTA carefully from flask onto LSM, repeat with second and third LSM tube.   Remainder of buffy coat-PBS-EDTA should be layered onto last LSM tube.   Balance LSM tubes, spin in RT6000 at 350 x g for 40 min, 22 °C with brake off.      Blood/cells   Remove diluted Plasma from top of tubes of LSM (approximately 25 ml).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131204/20131204232756_9890.jpg Figure 1. Adapted from http://www.genec.cl/stock/Mediatech.html[href=http://www.genex.cl/stock/Mediatech.html]    Remove peripheral blood mononuclear cells (PMBC) interfaces, add to 40 ml PBS/1 mM EDTA in 50 ml tubes and invert to mix.    Spin in RT6000 to remove platelets, 200 x g for 10 min. Pellet should be visible.   Pour off most of the supernatant.   Resuspend all pellets, pooling in a total of 8–10 ml elutriation buffer. Avoid air bubbles.   Count PBMCs: should be between 7 x 108 and 1.5 x 109 total cells depending on the donor.       Elutriation   Run some elutriation buffer through to equilibrate (100 ml).    Spin rotor manually for approximately 30 sec to remove air pockets.    Close lid and allow speed to get up to 1,450 x g (final speed) before checking flow rate: should be between 11.4 and 11.6 ml/min.    Transfer pipette attached to pump tubing into cells and pump full volume of cells (8-10 ml) before transferring pipette back to elutriation buffer. Avoid taking up any air by pinching tubing during transfer.    Collect the effluent. Collect the first two 50 ml tubes of effluent which will contain the lymphocyte population (with some contaminating platelets and red cells) and spin down at 100 x g to remove platelets.",
    "Lyse any remaining erythrocytes in ACK at room temperature (by resuspending the pellet in the ACK and gently inverting the tube 1-2 times), wash the lymphocytes once in HBSS by resuspending in 25 ml, count cell concentration, pellet cells again at 100 x g, and resuspend the lymphocytes in complete media containing 50 U/ml IL-2 at 2 million/ml in complete media in T75 flasks. Monocytes will remain in chamber, due to size and density and centrifugation conditions.    After 35 min run at 11.5 ml/min increase speed to 12.5 ml per min. Continue to run for 25 min (total runtime is 60 min).      End of run   Clamp output and input tubes before pump is turned off, then immediately stop centrifuge.   Open lid and unlock black lock, then remove input tube first, then lower outlet tube.   Remove elute chamber, with spout up.   In hood, using a P1000 remove the 6.3 ml of sample from the elutriation chamber and add to 50 ml tube.   Bring up volume up to 20 ml with 1x PBS. Count cells. Monocytes should be approximately 10-20% of original PBMC count. Wash cell pellet with sterile PBS. 200 x g for 10 min. Resuspend pellet to 100 x 106 cells/ml.   Plate monocytes in 10 cm petri dishes at 0.5 x 10 E6/ml (10 ml total/dish) in complete media containing 25 ng/ml M-CSF for derivation into macrophages.      Clean elutriator   Place elute chamber back into rotor and rotor back into centrifuge chamber attaching tubes to wash out/decontaminate rotor, tubing and chamber.   Undo clamps and run through 300 ml 10% bleach, 300 ml autoclaved H2O, 300 ml 70% EtOH, 300 ml water again. Disassemble rotor, set in 70% ethanol for 30% and let air dry overnight."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}