{
  "id": 5252,
  "origin_website": "Bio",
  "title": "Determination of Rate of [<sup>3</sup>H-methyl]-choline Incorporation  into Cellular Lipids and Non-lipid Metabolites",
  "procedures": [
    "Grow (adherent) cells until 80% confluent in 80 cm2 tissue culture flasks.Detach cells with a solution of 0.05% trypsin: EDTA (5 ml) and neutralise with same volume of medium containing 10% fetal bovine serum (FBS) and penicillin-streptomycin (10,000 U/100 ml). Add 1 ml of cell suspension containing 0.5 x 106 cells (this is for cells with doubling times of about 48 h – if the doubling time is slower or faster adjust seeding number accordingly so that the cells are 60-80% confluent on the day of measurement of [3H-methyl]-choline uptake) to each* 25 cm2 tissue culture flask required and make up to 5 ml with medium. *Note: Typically triplicates are used for each treatment and also for control (untreated) so if an experiment compares the effect of two treatments on lipid metabolism then 9 flasks need to be seeded with cells.Incubate flasks for 24 h at 37 °C in a CO2 with a humidified gas mix of 5% CO2:95% air incubator after which they can be treated with drugs if desired. After the desired drug incubation period remove medium and add 1 ml of medium containing [3H-methyl]-choline (37 KBq/ml) – see Recipe 1. Incubate for 15 min at 37 °C.Note: Residual media in the flasks will dilute the added radioactive medium so fully remove by suction.At the end of the incubation period with [3H-methyl]-choline rapidly add 5 ml of ice cold phosphate buffered saline (PBS) and discard by inverting the flask into a sink (designated for aqueous radioactive waste) and rinse 3 more times with ice-cold PBS (5 ml).The cells are then incubated for 1 h with fresh 1 ml of non-radioactive medium (chase). During this time the [3H-methyl]-choline moves through the phosphatidylcholine anabolic pathway and accumulates as phosphatidylcholine and its catabolites.",
    "At the end of the chase period the media is collected and the cells washed 2 x with 0.2 ml PBS and the washes pooled with the medium. Radioactivity is counted in the pooled media/washes by adding to a scintillation vial containing scintillation fluid (at a ratio of 1:10 solution:scintillation fluid) and measuring in the liquid scintillation counter. This is carried out so that the amount of activity that has been lost by efflux during the chase period can be determined if required. The cells are then detached by addition of 0.3 ml of a solution of 0.05% trypsin-EDTA (Gibco UK) and incubation to allow detachment to occur followed by neutralization of trypsin with 0.3 ml of medium containing 10% FBS. Using a P1000 pipette transfer the cell suspension to a reaction tube.Centrifuge the cells at 1,000 x g for 5 min at 4 °C then the media is removed and retained. During the trypsin treatment some of the cytosolic contents may leak out of the cells so if a measure of total activity in the cell is required the activity in the post-trypsinisation washes should be measured.The cells are then lysed by resuspension in 0.25 ml of methanol (MeOH):CHCl3 (2:1) and placing on ice for 1 h after briefly vortex mixing. The cell contents are fractionated into aqueous and lipid soluble phases by addition of 0.125 ml of CHCl3 and 0.125 ml of Tris buffer (10 mM) to the lysed cells and separating by centrifuging at 10,000 x g for 5 min at 4 °C. The aqueous (upper phase) is then collected into a separate tube (see Figure 1).",
    "Removal of the aqueous phases is aided by tilting the tube at about a 45° angle and drawing off the liquid into a 200 µl pipette tip (using a P200 Gilson pipette). The aqueous volumes are typically 0.5 ml so repeated fillings of the 200 µl pipette tip are required but the smaller tip is more controllable than using a 1 ml pipette tip. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161109/20161109234622_7155.jpgFigure 1. Appearance of the aqueous and lipid phases and precipitated protein interface after centrifugation. A. The aqueous (upper), protein interface and lipid (lower) phases after centrifugation and B. after removal of the aqueous phase. The lipid (lower phase), containing the fraction of [3H-methyl]-choline incorporated into lipid, is removed, leaving behind the protein precipitate, placed in a scintillation vial with scintillation fluid (at a 1:10 ratio of lipid phase to scintillation fluid) mixed and the activity counted in the liquid scintillation counter. Removal of the lower phase can be tricky as it consists mainly of chloroform which, being heavy, can leak out of the pipette tip but is achieved by gently drawing up the fluid into a 200 µl pipette tip using a P200 pipette and transferring rapidly to the scintillation vial (keeping close at hand). A 200 µl tip is preferable to a 1 ml tip as it’s easier to draw up the small fiddly volumes (typically 0.3 ml).The residual solvents in the tube now containing just the protein precipitate is left to dry at room temperature and then the pellet is dissolved overnight in 100 μl of NaOH (1 N). Note: Complete drying is important as the solvents may interfere with the protein assay. Drying can be speeded up by placing in an incubator at 37 °C.",
    "After addition of 100 µl of HCl (1 N) to neutralise the NaOH, the amount of protein in the sample is then determined using a protein assay kit (e.g., Bicinchoninic Acid Kit) and following the manufacturer’s instructions. Discrimination of phosphorylated and non-phosphorylated [3H-methyl]-choline in the aqueous phase from step 13 (adapted from Kletzien and Perdue, 1974) (This technique can also be used to discrimination of phosphorylated and non-phosphorylated in the cell washes from step 10 or the media from step 7): The total volume of the aqueous phase is determined by iteratively drawing the liquid into a pipette tip on a P1000 pipette and adjusting the volume until the pipette tip is fully loaded when all the liquid has been drawn up into the pipette tip.Two 100 µl samples of the liquid is placed in two microfuge tubes. To one of them is added 200 μl of water and after vortex mixing 100 µl is placed in a scintillation vial containing 1 ml of scintillation fluid (1:10 ratio of liquid to scintillation fluid) and the radioactivity counted. This is the total phosphorylated + non-phosphorylated [3H-methyl]-choline in 33.3 µl of the aqueous phase. To the other 100 µl sample is added, each of 100 µl of ZnSO4 (5%, w/v) and 100 μl of 0.3 M Ba(OH)2. After mixing on a vortex for 5 min the precipitated phosphates (including those containing [3H-methyl]-choline phosphates) are pelleted by centrifugation at 10,000 x g for 10 min and 100 µl of supernatant is removed to a scintillation vial containing 1 ml of scintillation fluid (1:10 ratio of liquid to scintillation fluid) to determine non-phosphorylated [3H-methyl]-choline by radioactivity counting in the scintillation counter.The amount of [3H-methyl]-choline in 33.",
    "3 µl of aqueous phase is determined by subtracting the non-phosphorylated [3H-methyl]-choline from the total [3H-methyl]-choline from step 18b."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}