{
  "id": 2594,
  "origin_website": "Cell",
  "title": "CRISPR-Cas9-induced gene knockout in zebrafish",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDesign single-guide RNA and target region primers\nTiming: Approximately 30 min (depending on the gene)\nDesign sgRNA using the web-based application Benchling (screenshot in Figure 1[href=https://www.wicell.org#fig1] below).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig1.jpg\nFigure 1. Screenshot of the Benchling web application used to design sgRNAs\nAccess Benchling at www.benchling.com[href=http://www.benchling.com] (create a free account).\nUsing the menu on the left, navigate to “Create CRISPR Guides”.\nSelect the target gene by entering the gene name or ID, and the zebrafish genome from the drop-down menu. GRCZ11 (Howe et al., 2013[href=https://www.wicell.org#bib5]) is the current latest genome release. Alternatively, it is possible to enter chromosomal co-ordinates, upload a sequence file, or paste the target sequence from a database.\nSet the CRISPR guide design parameters. The defaults settings are single guide, with a length of 20 bases, and a 3′ PAM site NGG.\nThe sequence is now displayed in the left window, with the guide design settings on the right.\nThe loaded sequence will be automatically annotated by the software to display the exons. In case the sequence was entered manually, the annotation will need to be done manually.\nSelect Exon 1, or the first exon common to all functional transcripts for the gene in the left window, and press the “+” icon in the right window to set the target genomic region and initiate gRNA design.",
    "From the list of sgRNAs displayed, select 3 guides with top scores. Two kinds of scores are displayed – on-target and off-target scores, with high scores being better. First, order them by off-target scores and find those with sufficiently high on-target scores as well - a rule of thumb to follow is to have both scores >75. Clicking on the off-target score of an sgRNA displays the list of its off-targets with the mismatches shown in Red, and a corresponding score. A score <=1 with >=3 mismatches is suitable, and others should be excluded. In case the off-target and on-target scores are too low (<60), proceed to Exon 2 and repeat the process.\nOnce the desired sgRNAs are found, select and export them to a spreadsheet file. Benchling also has the option to design a strategy for cloning the sgRNA-coding sequence (using an Assemble option instead of Export) into an expression vector to be chosen from a drop-down menu.\nDesign PCR primers for the sgRNA target region(s).\nSelecting the sgRNAs in the right window selects and shows the corresponding region in the genome sequence in the left.\nIn the menu on the right, click on Primers and proceed to create primers for the target regions. A Manual option or an automated Wizard option are available. From the primer sets listed, select a suitable one based on Tm, GC%, and amplicon size (350–700 bp) among other parameters. Benchling also displays a Penalty score, with lower being better.\nPurification of Cas9\nTiming: 4–5 days\nBacterial expression of Cas9.\nDay 1: Transform E. coli Rosetta DE3 cells with a plasmid expression WT SpCas9 (pSHS207; Addgene Plasmid # 101199) (Jinek et al., 2012[href=https://www.wicell.org#bib6]), plate on ampicillin-selective LB plates (100 μg/mL), and incubate overnight at 37°C.",
    "Day 2: Inoculate a single colony into 5 mL of LB broth with ampicillin (100 μg/mL), and allow to grow at 37°C in a shaking incubator overnight.\nDay 3: Sub-culture 2 mL of the above overnight culture into 100 mL LB broth with ampicillin ((100 μg/mL) and grow at 37°C in a shaking incubator. Once the OD reaches 0.6, reduce the temperature to 18°C and incubate for 30 min for the culture to cool down. Induce SpCas9 expression by adding 0.5 mM IPTG and continue incubation at 18°C in the shaking incubator overnight.\nDay 4: Assess Cas9 expression via SDS-PAGE of a 100 μL aliquot of the culture; centrifuge the aliquot at 5,000 g for 5 min, wash once with water, resuspend in 100 μL of 1× SDS-PAGE sample buffer and heat at 95°C for 5 min (it is useful to load different volumes, e.g., 10 μL, 20 μL, and 40 μL). Centrifuge the rest of the culture at 5,000 g for 10 min at 4°C to pellet the cells. Wash the cells three times with water or a suitable buffer. The cell pellet can be frozen at −20°C or −80°C at this stage.\nColumn Chromatography to purify Cas9 – step 3: Affinity Chromatography.\nDay 4 or 5: Perform the steps from this point forward in a cold room or a refrigerated cabinet.\nLyse the pellet from above by resuspension in 5 mL of lysis buffer and sonication on ice, using sonication settings of 25-s pulses with 10-s pauses, for 15–25 cycles.\nCentrifuge the lysate at 12,000 g for 15 min at 4°C. Transfer the supernatant to a fresh tube, and assess lysis via SDS-PAGE.",
    "Equilibrate a 1-mL bed volume of Ni-NTA resin with loading buffer by pouring the resin into a 10-mL empty column suitable for gravity-based manual chromatography, uncapping the outlet and allowing the buffer to drain while maintaining a head of at least 0.25 mL on the top of the resin. Cap the column after equilibration with at least 5 column volumes of the buffer.\nGradually pour the lysate onto the settled equilibrated resin in the column, with minimal turbulence to the resin. Uncap the column and collect the flow-through in a single Falcon tube.\nWash the column with at least 5 column volumes of wash buffer, collecting the wash in a single Falcon tube.\nElute the bound Cas9 protein with 2.5 column volumes of elution buffer, and collect the elutions in 1-mL aliquots. Assess the purification via SDS-PAGE of all the collected fractions (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig2.jpg\nFigure 2. sgRNA synthesis template and schematic\nTop Panel: Schematic of the oligonucleotides used to generate the template for sgRNA synthesis; Bottom Panel: Schematic of the annealed and extended sgRNA template, ready to be used for sgRNA synthesis via T7-driven in vitro transcription.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig3.jpg\nFigure 3. FemtoJet microinjection system (Eppendorf) with the microinjection settings shown\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig4.jpg\nFigure 4. Zebrafish embryo microinjection\nTop Panel: View of zebrafish embryos during microinjection. The Phenol Red dye used as an additive for visualization is seen; Bottom Panel: Close-up view of zebrafish embryos during microinjection.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig5.jpg\nFigure 5. Cas9 protein purification\nLeft Panel: Ni-Affinity chromatography of Cas9 protein. 1: Ladder. 2: Flow-through. 3: Wash. 4–9: Elutions. 10: Beads; Right Panel: Cation exchange chromatography of Cas9 protein following Ni-Affinity chromatography. 1: Ladder. 2: Flow-through. 3–10: Elutions.\nColumn Chromatography to purify Cas9 – step 4: Ion Exchange Chromatography.",
    "Day 4 or 5: Pool the elutions from the above Affinity Chromatography step, and dilute 3-fold with equilibration buffer to reduce salt concentration before loading onto a cation exchange resin as below.\nPour cation exchange resin into an empty column for a 5-mL bed volume. Wash with 25 mL equilibration buffer.\nGently pour the pooled protein sample onto the column and collect the flow through in a single Falcon tube.\nWash the column with 25 mL wash buffer and collect the wash into separate single tubes.\nElute the bound protein with 10 mL elution buffer and collect 1 mL fractions. Assess the purification via SDS-PAGE of all the collected fractions (Figure 5[href=https://www.wicell.org#fig5]B).\nDialyze the eluted protein into storage buffer, add glycerol to 30% and store at −20°C.\ntable:files/protocols_protocol_2094_9.csv\nIn vitro synthesis of single-guide RNA\nTiming: 3–4 days\nDesign oligonucleotides to generate a double-stranded DNA template encoding the sgRNA, and generate the template via overlap extension (Bowman et al., 2012[href=https://www.wicell.org#bib2]).\nDesign a 52-nt oligonucleotide (sgRNA Oligo) comprising a T7 promoter sequence followed by a 20-nt guide RNA-coding sequence and a 15-nt sequence complementary to the Tail Oligo (depicted in Figure 2[href=https://www.wicell.org#fig2]A below).\nDesign an 80-nt oligonucleotide (Tail Oligo) comprising a 15-nt sequence complementary to the sgRNA Oligo (depicted in Figure 2[href=https://www.wicell.org#fig2]A below) followed by a sequence needed for transcription termination.\nObtain the above two oligonucleotides from a commercial provider.\nPerform a PCR reaction as follows to generate the double-stranded DNA template (depicted in Figure 2[href=https://www.wicell.org#fig2]B below).\ntable:files/protocols_protocol_2094_10.csv\nPCR cycling conditions\ntable:files/protocols_protocol_2094_11.csv\nTo the 100-μL annealed and extended product (depicted above), add 10 μL of 3 M sodium acetate pH 5.3 and 500 μL of absolute ethanol and incubate for at least 2 h at −20°C. Overnight is preferable.",
    "Centrifuge at 12,000 g for 10 min at 4°C, wash pellet with 70% ethanol, air dry, and dissolve in 10 μL of water.\nUse the template generated above in an in vitro RNA transcription reaction to generate the sgRNA.\nPerform a T7 RNA polymerase-driven in vitro transcription reaction as follows (the amount of DNA template used is typically at least 1 μg).\ntable:files/protocols_protocol_2094_12.csv\nIncubate the above mix at 37°C for 4.5 h (we have found this duration to work well, but it can vary between 0.5–5 h depending on the reaction efficiency).\nAdd 0.5 μL of DNase (1 unit/ μL) and continue to incubate at 37°C for 40 min.\nPerform a phenol-chloroform extraction by making up the volume to 200 μL with water, adding 100 μL of acidic phenol and 100 μL of chloroform, mixing by inverting and centrifuging at 10,000 g at 4°C for 10 min. Collect the supernatant and extract with an equal volume of chloroform. Collect the supernatant and proceed to RNA precipitation.\nPrecipitate the RNA by adding 10 μL of 3 M sodium acetate pH 5.3 and 500 μL of absolute ethanol and incubating at least 2 h at −20°C (alternatively, 5–10 min at −80°C can be used).\nCentrifuge at 12,000 g for 10 min at 4°C, wash pellet with 70% ethanol, air dry, and dissolve in 10 μL of RNAse-free water.",
    "Quantify the RNA using a Nano drop UV spectrophotometer and verify integrity by resolving the RNA sample via 10% urea-PAGE (Summer et al., 2009[href=https://www.wicell.org#bib8]) as follows. Dissolve 4.2 g of urea in 2 mL of water with agitation and boiling. After cooling to room temperature, add 2 mL of 5× TBE, 3.3 mL of 30% Acrylamide / Bis-acrylamide Mix, 100 μL of 10% APS, 10 μL of TEMED and make up to 10 mL with water. Pour the gel and perform a pre-run for 20–30 min at 5 V/cm. Prepare the RNA sample as follows; take 0. 5 μL of RNA, add 4.5 μL of water and 5 μL of 2× formamide dye. Heat the 10 μL RNA sample at 95°C for 5 min and spin briefly. Flush the wells with 1× TBE to remove urea, load the RNA samples, run until the dye front migrates 3/4th distance of the gel and stain with ethidium bromide (0.5 μg/mL) for 10 min. Visualize RNA integrity using a gel imaging system.\ntable:files/protocols_protocol_2094_13.csv\ntable:files/protocols_protocol_2094_14.csv\nIn vitro catalytic activity assay for assessing guide RNA efficiency\nTiming: 1 day\nPerform an in vitro catalytic activity assay with purified Cas9, sgRNA, and the target region amplicon (Grainger et al., 2017[href=https://www.wicell.org#bib4]).\nAssemble a ribonucleoprotein complex by adding the following reagents and incubating the mix at 37°C for 10 min.\ntable:files/protocols_protocol_2094_15.csv\nAdd 2 μL of the target-region PCR amplicon to the above mix and incubate further at 37°C for 1 h. Add 1 μL RNase A and incubate at 37°C for 30 min, and then add 1 μL Proteinase K and further incubate at 37°C for 30 min.",
    "Resolve the sample on 10% Native PAGE and visualize by DNA staining. Cleavage of the target results in cut bands and thus a different band pattern compared to the control sample (target-region PCR amplicon alone) (Figure 6[href=https://www.wicell.org#fig6]).\nSelect one sgRNA (or a combination if multiple sgRNAs show desirable cleavage) based on a visual assessment of cleavage efficiency from the band patterns.\ntable:files/protocols_protocol_2094_16.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig6.jpg\nFigure 6. In vitro CRISPR catalytic activity assessment (Cas9-sgRNA RNP complex)\n1: Control. 2: sgRNA 1. 3: sgRNA 2. 4: sgRNA 1+2. 5: Control. 6: Ladder.\nGeneration of CRISPR-Cas9-induced PHLPP1-knockout zebrafish\nTiming: 10–12 months\nZebrafish breeding and embryo collection.\nOn the evening before the day of microinjections, place 3–4 pairs of selected adult male and female zebrafish in a breeding tank, with males and females separated by a divider, and a partition separating the top and bottom half of the tank – this prevents the adults from accessing the laid eggs.\nIn the morning, remove the divider at first natural light or switch on a light source and remove the divider, to induce breeding. The laid eggs will be visible at the bottom of the tank. Because genetic modifications should be done at the single-celled stage, fertilized eggs should be collected as soon as possible, and the microinjections done within 30 min of fertilization.\nRemove the partition and collect the eggs. Transfer fertilized eggs into a 95-mm Petri dish and wash several times in system water.and.\nMicroinjection of zebrafish embryos.\nDuring the breeding step above, prepare for microinjection. Set the injection parameters (injection pressure 550 hPa, Time of injection 0.1 s and back pressure 10 hPa). We used an Eppendorf Femtojet microinjection system (shown in Figure 3[href=https://www.wicell.org#fig3] below) with a Zeiss Stereo Discovery V8 microscope in this protocol. Form a Cas9-sgRNA complex by adding reagents as below.",
    "table:files/protocols_protocol_2094_17.csv\nIncubate the above mix at 37°C for 15 min. Add 0.05% phenol red to the mix to allow visualization during and after injection (as shown in the photograph below). Use of TE buffer in this step is optional, and we include it because it may help to stabilize the RNP complex. Load the mix into a microinjection needle from the back end using a micropipette fitted with a back-loader tip, and insert the back end of the needle into the injection tubing. Pre-pulled microinjection needles can either be bought or prepared from glass capillaries using a Needle Puller.\nPlace the embryos in a Petri dish with slotted agarose and line the embryos along the slots (as shown in Figures 4[href=https://www.wicell.org#fig4]A and 4B below). Position the above loaded needle appropriately and inject each embryo with approximately 10 nl of the loaded mix (if 10 nl results in toxicity and embryo death, decrease the volume to 5 nl or lower if possible). We typically inject a set of 80–100 embryos with the reagent mix, with buffer alone as control, and include 80–100 uninjected embryos as a control for embryo quality. Transfer the injected embryos to a dish with E3 medium and place the dish in a 28°C incubator.\nObserve the embryos a few times over the next 3 h, and remove dead embryos.\nGenotyping using Heteroduplex Mobility Analysis (HMA), selective breeding, and generating heterozygotes and homozygotes.",
    "On the following day, collect 8 injected embryos and 1 uninjected (control) embryo in individual tubes and prepare lysate for HMA analysis as follows. Remove excess water from the tube, add 45 μL 50 mM NaOH and heat at 95°C for 25 min (a minimum of 10 min is needed) Vortex the tube to disintegrate the embryos, add 5 μL 1 M Tris-HCl pH 8.0, mix briefly and spin to pellet any debris. Use 0.5 μL of this lysate as input for a 5 μL PCR reaction as below.\ntable:files/protocols_protocol_2094_18.csv\nPCR cycling conditions\ntable:files/protocols_protocol_2094_19.csv\n∗Annealing temperature may be determined for each primer pair using the NEB Tm Calculator.\nResolve the products using native PAGE, and visualize via DNA staining. Compared to control (un-injected embryos), additional bands will be visible if cleavage of the target region has occurred. Because of the presence of wild type DNA (target site cleavage may not have occurred in all embryos, and wild type alleles may be present in embryos with target site cleavage), heteroduplex formation will occur in the PCR products and these heteroduplexes will have different mobility patterns which can be visualized. The patterns above the main band may be of much lower intensity and smeared because the percentage of edited cells in the 24 hpf embryo may be low, and embryos with various types of edits (indels) are expected to be present (Figure 7[href=https://www.wicell.org#fig7]A).",
    "Based on the above visual evidence of cleavage, if at least 30% of the embryos show heteroduplex mobility differences (are HMA-positive), it can be considered likely that the injected population of embryos have edits, and the embryos can be raised to adulthood. However, whether these fish carry the edits in the germline cells (are F0 founders) is crucial, and this cannot be determined for certain at this stage. Two strategies are possible for genotyping and selecting fish for further breeding, as described below.\nIn one strategy, raise as many of the injected embryos as possible from step 11c to adulthood, breed them with wild type fish (backcross) using only F0 males or only F0 females in a given cross, and genotype a sample of the resultant embryos as described in step 11a above. These embryos represent the potential F1 or heterozygote generation. Because heterozygous embryos are expected to carry one wild type allele and one allele with target site disruption (and consequent NHEJ repair-mediated insertion or deletion), their HMA patterns (heteroduplexes with mobility differences) will be prominent (Figure 7[href=https://www.wicell.org#fig7]B). If the number of HMA-positive embryos and therefore the extent of germline transmission is at least 30%, raise these F1 embryos to adults (depending on available space), and genotype the adults as follows. Segregate a few of them by placing them in separate tanks, label the tanks to identify the fish, and genotype each one using tail clip DNA. This is done by clipping a small piece of the tail and performing the genotyping protocol as described in step 11a above. The HMA-positive adults are the F1 heterozygotes.",
    "In the second strategy, raise as many of the injected embryos as possible from step 11c to adulthood, and genotype them after segregation and tail clipping as described in step 11d above. HMA-positive fish are considered F0 founders. Breed these founders with wild type fish (backcross as in step 11d above), raise the resultant embryos to adulthood, and identify F1 adult heterozygotes using tail clip genotyping as in step 11d above.\nTo confirm the genotyping of the F1 heterozygotes identified using either of the strategies above, perform sequencing of the target region PCR products (in-house if available or using a commercial service provider), and analyze the sequence result using the ICE tool from Synthego. This tool predicts the likelihood of heterozygous status, and the presence of an indel (insertion or deletion) at the target site. Identify at least one pair of male and female F1 fish carrying an identical indel.\nBreed the above F1 fish pair (or pairs if multiple pairs can be identified) with each other, and genotype a set of embryos using HMA to verify Mendelian segregation as described but with one additional step (Foster et al., 2019[href=https://www.wicell.org#bib3]). Visualize one half of the PCR product for each reaction via native PAGE. 50% of the samples are expected to be heterozygotes and should be HMA-positive. To the remaining 50% showing a single band (Figure 8[href=https://www.wicell.org#fig8]A), add an equal volume of the control PCR product, and subject the mix to one round of denaturation and annealing as follows. In a thermal cycler, subject the samples to 85°C for 5 min and then to 25°C for 5 min. The samples can then be at 10°C until the next step.",
    "Resolve and visualize the above products on native PAGE. Those that now show the HMA pattern are considered the F2 generation (homozygotes), and those that still show only one band are wild type (Figure 8[href=https://www.wicell.org#fig8]B). Indels in both alleles will result in two bands in the presence of added wild type amplicon, but only one band otherwise. This is because no heteroduplex formation occurs when both alleles have the same indel (as is expected in homozygotes). To confirm, perform sequencing of the PCR products and compare with wild type sequence using ICE analysis as above or other sequence comparison methods. The disruption at the target site and the mutated sequence (insertion or deletion) should be evident from the analysis.\nRaise the F2 embryos to adulthood (depending on available space), and genotype a set of them using tail clipping to identify the F2 homozygotes. The F0 founders, the F1 heterozygotes, and the F2 homozygotes can be housed and maintained as needed for experimental studies.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig7.jpg\nFigure 7. HMA genotyping of F0 and F1 embryos\nLeft Panel: HMA of F0 embryos (CRISPR-injected embryos).1: Embryo 1 (HMA-Positive). 2: Ladder. 3: Embryo 2 (HMA-Positive). 4: Embryo 3 (HMA-Positive). 5: Embryo 4. 6: Embryo 5. 7: Embryo 6. 8: Embryo 7. 9: Embryo 8. 10: Control; Right Panel: HMA of F1 embryos (progeny of F0 adults and WT). 1: Control. 2: Embryo 1 (HMA-Positive). 3: Embryo 2 (HMA-Positive). 4: Embryo 3 (HMA-Positive). 5: Embryo 4. 6: Embryo 5 (HMA-Positive). 7: Embryo 6. 8: Embryo 7 (HMA-Positive). 9: Embryo 8 (HMA-Positive). 10: Ladder.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2094-Fig8.jpg\nFigure 8. HMA genotyping of F2 embryos",
    "Left Panel: HMA of F2 embryos (progeny of F1 adults) without denaturation and annealing. 1: Ladder. 2: Embryo 1 (WT Control). 3: Embryo 2. 4: Embryo 3. 5: Embryo 4. 6: Embryo 5. 7: Embryo 6. 8: Embryo 7. 9: Embryo 8; Right Panel: HMA of F2 embryos with denaturation and annealing. 1: Ladder. 2: Embryo 1 (WT Control). 3: Embryo 2. 4: Embryo 3 (HMA-Positive). 5: Embryo 4 (HMA-Positive). 6: Embryo 5. 7: Embryo 6. 8: Embryo 7. 9: Embryo 8 (HMA-Positive). The F2 HMA above shows that embryos 3, 4, and 8 are homozygous mutants. WT F2 samples (embryos 2, 5, 6, and 7) yield only a single band under both the above conditions. All the HMA data shown above is with embryos. Adult samples (tail or fin clips) is expected to yield similar results."
  ],
  "subjectAreas": [
    "Crispr",
    "Genetics",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}