{
  "id": 10345,
  "origin_website": "Jove",
  "title": "The Quantification of Injectability by Mechanical Testing",
  "procedures": [
    "1. Sample Preparation\nPrepare the sample and load it into the syringe.\n\t\nTo simulate a pre-loaded syringe, prepare the sample in advance, load it into the syringe, and attach the needle. Store as required, until testing. This may be suitable for hydrogels and materials that do not change with time.\n\t\tNOTE: For example, to prepare 2% alginate solutions, dissolve 2 g of alginic acid sodium salt in 100 mL of deionized water, by stirring at room temperature. Aspirate the solution into 5 mL syringes, and store for 24 h at room temperature.\nAlternatively, to simulate an injection formulated directly prior to the application, prepare the sample in the same way it would be made in the clinic, allowing for any setting times. Load into the syringe and attach the needle. This may be suitable for cements, and materials whose properties change with time.\n\t\tNOTE: For example, to prepare calcium sulfate cement, manually mix 4 g of calcium sulfate hemihydrate into 5 mL of deionized water with a spatula for 1 min. Remove the plunger from the syringe and load the cement into the syringe barrel with the spatula. Begin the mechanical testing after 4 min.\n\t\tCAUTION: Needles pose a safety risk, use blunt needles if possible. If the material contains cells or other biological materials, extra care should be taken to prevent sharps injuries.\n2. Set up the mechanical tester\nAttach flat platens (for compression testing) to the mechanical tester.\nManually equip the mechanical tester with a load cell with a maximum load of 200 N.\n\tNOTE: A larger load cell may be used, provided it has sufficient precision at the 1 – 200 N range. Samples that are more viscous and not intended to be injected by hand may require a larger load cell.",
    "Separate the plates, using the manual control buttons, to allow for sufficient space for the needle, syringe and plunger (around 30 cm will be sufficient).\nCreate a testing protocol.\n\t\nOpen the test wizard and set the test type to uniaxial compression.\nSet the pre-load. This is the measured force value at which testing will begin. 0.5 N is sufficient.\nSet the speed to pre-load to 5 mm/min. This is the speed the crosshead will move down until it encounters the pre-load.\nSet the loading to displacement control and select an appropriate test speed. 1 mm/s is an appropriate speed for a standard 5 mL syringe.\nSet an upper force limit at which to stop the test, e.g., 200 N. This is primarily for safety reasons. The test may also be stopped automatically at a given displacement, e.g., the length of the syringe.\n3. Set up the clamping system\nAttach two sets of clamps to two stands, with grips large enough to securely ensconce the chosen syringe.\nPlace the grips between the crosshead and baseplate, with enough space below the grips for the syringe and needle.\nLine up the centers of the two grips, and line these up with the center of the crosshead.\n\tNOTE: Alignment of the clamp grips with each other and the center of the crosshead may take some time and iteration to achieve, but is important to acquire high quality data.\nEnsure the clamps are secured firmly so that there is no movement in the clamps when a downward force is applied.\nPlace a dish onto the bottom plate to collect the extruded material.\n4. Run the injectability protocol\nInsert the syringe into the clamp grips and close them. The grips should hold the syringe in place, but allow it to move up and down without resistance.",
    "Ensure the syringe and plunger are perpendicular to the crosshead. This ensures that only uniaxial compression of the material will be measured.\n\tNOTE: An empty syringe should be used to check steps 4.1 and 4.2.\nLower the top plate to a position just above the plunger, using the manual movement buttons.\n\tNOTE: It may be possible to select a ‘Start position’ in the mechanical tester protocol, such that the original position above the plunger is reached automatically and is consistent throughout testing.\nZero the measured force by clicking ‘Zero Force’.\nRun the testing protocol by pressing ‘Run’.\n\tCAUTION: The experimenter should always be present to observe each trial, and ready to activate the emergency stop in case of a mishap.\nRaise the plates to a sufficient height, using the manual movement buttons, such that the syringe can be removed.\nRepeat step 4 for each sample.\n\tNOTE: At this point, the syringe and extruded sample can be discarded if no further analysis is required, but may be kept in order to examine filter pressing, self-healing, the effects on cells, etc.\n5. Data collection\nSave the data from each trial in a format from which a table of force and displacement values can be generated (.txt, .xls, .xlsx).\nPlot the results from each trial, with displacement on the x-axis and force on the y-axis.\nRead the maximum force (if it exists) and plateau force from the graphs."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}