{
  "id": 5790,
  "origin_website": "Bio",
  "title": "Protease Activity Assay in Fly Intestines",
  "procedures": [
    "Drosophila rearingCantonS flies are reared on standard medium for Drosophila melanogaster (see Recipes) at 25 °C.Only virgin five-days-old females are used in our experiments. To obtain synchronized five-day-old females, we empty bottles from adult flies, then we wait for the emergence of new flies from pupae. Among the emergent flies, males are rapidly discarded and females are transferred in new bottles for five days at 25 °C.Bacterial cultureIn the experiments presented below, we use three different bacterial strains (Btk, Ecc and Ec, see Materials and Reagents) and water as negative control (Ctrl). Spread bacteria from the stocks on LB agar Petri dishes and let grow overnight at the required temperature (30 °C for 4D22 and Ecc and 37 °C for Ec).Pick a single colony using a sterile tip and initiate a 10 ml starter culture of LB (see Recipes) in a 15 ml tube. Let grow for 8 h shaking (220 rpm) at 30 °C for 4D22 and Ecc and at 37 °C for Ec.Next, use the small starter culture to inoculate a second, larger culture: 50 µl of starter culture + 50 ml LB in a 100 ml flask and allow to grow overnight at the required temperature.IntoxicationOn the day of infection, measure the optic density (OD) of the culture at a dilution of 1/5 (200 µl culture + 800 µl LB). A reliable OD must be between 0.2 and 0.8.Depending on the cultured bacteria, the required ODs to intoxicate flies with 106 Colony Forming Unit (CFU) per Drosophila are presented in the Table 1:Table 1. Required bacterial concentrationsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170914/20170914225119_1283.jpgDilute the overnight bacterial culture with LB to obtain the required OD. For example: to obtain an OD 1.8 of 4D22 bacteria from an overnight culture at OD 9, you need to dilute the overnight culture by 5 (9/1.",
    "8 = 5). Use LB medium to make the dilution.Then mix at 1:1 the diluted culture with 10% sucrose (see Recipes). For practical reasons mix 1 ml of diluted culture with 1 ml of 10% sucrose. This mixture will constitute the intoxication solution.5-day-old virgin females are allowed to fast for 2 h at 25 °C: flies are placed in empty Drosophila bottles at 25 °C for 2 h. Starved flies are then transferred onto a Drosophila narrow vials containing fly medium covered with filter disks soaked with 50 µl of the intoxication solution (Figure 1).Note: Before to deposit your flies onto the soaked filter disk in the vials, wait for a few minutes until the filter disk becomes dry, otherwise the flies will be wet and will probably remain stuck on the filter disk.Flies are kept to feed on the contaminated media at 25 °C until dissection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170914/20170914225212_0280.jpgFigure1. Intoxication procedure. A. Annotate the Drosophila vials and place the filter disks inside on the top of the medium; B. Zoom up on a filter disk on the top of the medium; C. Add 50 µl of the intoxication solution in the vials; D. Sort by 10 the starved female flies using the Droso-sleeper; E. Deposit carefully 10 flies in each contaminated vial.DissectionForceps and dissecting watch glasses have to be washed with a 70% ethanol solution.The flies (10 virgin females per condition) are anesthetized using the Droso-sleeper.Place one fly in a watch glass pre-filled with 1 ml 1x PBS (see Recipes) (Figure 2A).Using forceps, hold the fly by the head and pull gently on the posterior part of the abdomen to carefully detach the abdomen from the thorax (Figure 2B).Then, the intestine is carefully stretched (Figure 2C).",
    "Cut the head and untie very gently the intestine first from its anterior part and then from its posterior part (Figures 2D-2F).Note: Here, we need only the midgut so we cut the foregut and the hindgut. We also removed Malpighian tubules that can still be attached at the midgut/hindgut boundary (Figures 2D-2F).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170914/20170914225322_2961.jpgFigure 2. Dissection procedure. A. Place one fly in a watch glass pre-filled with 1 ml 1x PBS under a stereomicroscope; B. Hold the fly by the head and pull gently on the posterior part of the abdomen to carefully detach the abdomen from the thorax; C. Carefully stretch the intestine; D. Cut the head and untie very gently the intestine first from its anterior part and then from its posterior part. The whole intestine (foregut/midgut/hindgut) must be separated from the rest of the abdomen. E. Remove the crop; F. Remove the proventriculus, the hindgut and the Malpighian tubules. See also http://www.bio-protocol.org/e2079 [href=http://www.bio-protocol.org/e2079](Chen et al., 2016)The dissected midguts are then immediately placed in 1x PBS on ice waiting for the dissection of the other intestines.Only 8 guts (over the 10) are transferred into 50 µl of 1x PBS in a 1.5 ml microtube for sample preparation.Sample preparationRecover gut content by pressing them with a microtube pestle fixed on a motor set to 1,000 rpm: put the motor on and perform 10 up and down movements with the microtube to allow the pestle to reach the bottom of the microtube (Video 1).Note: Keep the tubes on ice to avoid any protein degradation. The goal is to recover most of lumen contents, so do not strongly crush the guts and do not perform more than 10 up and down movements.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Crushing intestines. The video describes the procedure to gently crush intestines using a microtube pestle.",
    "Note at the end of the video that to avoid to waste gut content, we take off the pestle and press it against the edge of the microtube                                                       Centrifuge for 5 min at 10,000 x g and 4 °C.Dilute at 1:10 a part of the supernatant: take 20 µl of the supernatant and transfer it in a 1.5 ml microtube containing 180 µl of 1x PBS.Take another 20 µl of the supernatant in a 0.5 ml microtube and place it at 4 °C waiting for protein assay if one wants to normalize the results per mg of protein.AssayNote: For each sample, we assay 3 volumes to be sure to be in the fluorimeter’s measurement range and to have reproducible results. As negative control, we use the maximal sample volume (i.e., 20 µl) complemented with a cocktail of protease inhibitors (25x cOmplete). As positive control, we use trypsin. The Table 2 gives an example of a 96-well plate’s scheme according to these rules. This is a plane of an independent experiment with two technical replicates (one from columns 1 to 4 lanes B to E and one from columns 6 to 9 lanes B to E).Table 2. 96-well plate’s plane. Volume (µl) for: 10x PBS/Distilled water/Sample/Trypsin/25x cOmplete.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170914/20170914225743_1367.jpgaTo be sure to stay in the reading range of the spectrophotometer, carry out two assays with a dilution of trypsin to 1:1Prepare the trypsin solution (see Recipes) as described below.Annotate 1.5 ml microtubes with the letter and the number corresponding to their position in the 96-well plate.Add the indicated volume of distilled water in each tube.Add the 10x PBS. Finally add the indicated volume of sample or trypsin.When necessary add the protease inhibitors (25x cOmplete) (see Recipes).Note: From this point, it is important to work with the least of light as possible.",
    "Prepare the Casein-FITC (see Recipes) as described below.Add 20 µl Casein-FITC in each tube and vortex few seconds.Note: Be careful, do not vortex too strongly to avoid fluorescence background.Incubate for 1.5 h in a 37 °C solid-door incubator (samples have to be in the dark).Note: Samples can be incubated until 24 h to increase the signal. Beyond one day, Casein-FITC can be degraded leading to high fluorescence background.Add 300 µl 10% TCA (see Recipes) and vortex for a few seconds.Incubate for 0.5 h in a 37 °C solid-door incubator.Centrifuge for 10 min at 10,000 x g, 4 °C.Note: Whole proteins and big fragments, which underwent a few or no proteolytic cleavage, precipitate with the TCA and are centrifuged down in the pellet. Casein-FITC small fragments that underwent a lot of proteolytic cleavage are in the supernatant. That’s what will be measured.In a black 96-well plate, put 50 µl of supernatant according to the Table 2.Add 150 µl 0.5 M Tris/HCl (see Recipes) pH 8.5.Read the fluorescence on a spectrofluorimeter set on 485 nm excitation wavelength and 535 nm emission wavelength."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}