{
  "id": 4674,
  "origin_website": "Bio",
  "title": "Enrichment of Cells of Interest from Heterogeneous Murine Cells with BioMag Goat Anti-rat IgG",
  "procedures": [
    "CalculationFor optimal results, use the most diluted cellular suspension possible. Typically, total cells are prepared at 2 x 107 total cells/ ml medium. Since any given cell source will have unique purification requirements, it is recommended to determine the optimal condition by individual user.QIAGEN suggests using 10-50 magnetic particles per cell (total cell population). However it has been proved that as few as 2-3 magnetic particles per total thymocytes works very efficiently. 1 mg/ml BioMag suspension contains 1 x 108 magnetic particles per milligram, which is equivalent to 1 x 108 magnetic particles per milliliter. Therefore, the volume of BioMag suspension required is 2.0-3.0 ml per 108 total thymocytes.Prepare cell suspension Adjust the concentration at 2 x 107 total cells/ml sterile culture medium. Primary antibody binds to cell surface antigen Add the appropriate amount of primary antibody to the cells and incubate for 30 min at 4 °C or on ice. In order to maximize the binding between the antigens and antibodies, invert the tube contains the cells and primary antibodies several times every 5 min. For optimal results, individual researcher needs to optimize the amount of primary antibody. Wash BioMag particlesDuring the procedure of binding, wash required amount of BioMag particles 2-3 times in appropriate sterile culture medium or buffer. First, suspend Biomag particles in original buffer which contains sodium azide, and use a magnetic separator (>20 megaoersted) to pull the magnetic particles to the side of the tube. Suck the original buffer carefully to removes the sodium azide preservative. Separation should be performed for 2-3 min using a magnetic separator.Repeat the procedure with low protein (5% FCS) buffers are recommended to reduce nonspecific binding.Important: Do not centrifuge the BioMag suspension during wash steps. Centrifugation results in extensive aggregation and loss of binding activity.",
    "Remove unbound primary antibody from the cells Centrifuge at 200-300 x g for 5 min and suck the supernatant. Resuspend the cells in sterile medium and centrifuge at 200-300 x g for 5-10 min to wash the cells. Repeat wash step 1-2 times, using 1 ml sterile medium for each wash. BioMag particles bind to primary antibody Resuspend cells in appropriate volume of sterile medium and add the washed BioMag particles prepared in step 3. The final volume of sterile medium and BioMag particles should keep the cells at 2 x 107/ml. Incubate at 4 °C for 15 min. Swirl reaction vessel occasionally, or place eppendorf tubes on a rotating wheel during incubation. Notes: For optimal results, total volume should be ≥ 1ml (including BioMag suspension and cell volume). Where volumes <1 ml are used, additional medium or buffer should be added to a final volume of 1 ml.Longer incubation is not recommended as magnetic particles may detach from the target cells as a result of cell surface changes over time.Room temperature (15-25 °C) or 37 °C is optimal for some cell types and QIAGEN.Recommends that the optimal cell sorting conditions be individually determined.Separate target cells from other unwanted cells Apply vessel to a magnetic separator for 10 min at 4 °C. Once separation is complete, carefully remove the supernatant without disturbing the pellet to another tube, the supernatant contains target cells after negative selection. Notes: A clear supernatant indicates that the separation is complete.Separation must be performed with the vessel held vertically so that the pellet forms on the side of the flask or tube. This ensures unselected cells do not contaminate the magnetic pellet.For optimal results, repeats step 7 once.",
    "The author strongly suggests repeating step 7 once with at least 15 min of separation because any contaminated magnetic particle will interfere with the following experiment especially cell sorting.Count target cells Centrifuge the supernatant at 200-300 x g for 5 min to pellet the cells, and resuspend the cells in fresh medium. Count the number of target cells for following experiment and calculate the depletion efficiency."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}