{
  "id": 4748,
  "origin_website": "Bio",
  "title": "Large-scale Phenotypic Profiling of Gene Deletion Mutants in <EM>Candida glabrata</EM>",
  "procedures": [
    "Arraying and storage   For arraying deletion strains in the 96-well format see the Note section. Arrayed strains can be suspended in 15% glycerol and stored frozen at minus 70 °C in 96-well plates.    Frozen stocks can be either handled by manual replicating tools or by an automated system such as the RoToR HDA by Singer Instruments. The latter offers a higher reproducibility and reduces the risk of contamination when compared to manual systems. Therefore, this protocol for large-scale screening was optimized for the work with the Singer HDA RoToR replica-plating robot.      Initial large-scale screening (on solid YPD media)   For initial pilot screenings, prepare square plates containing the screening compounds and control plates lacking compounds as shown in Figure 1. The concentration of the compound for the solid screening plate is usually twice the concentration of the IC50. However, the exact concentration should be determined prior to the large-scale screening by plating control strains.   To exclude replica-plating errors, at least two plates should be prepared for each condition (stress-inducing compound, stress-inducing media, temperature, etc.).    Source plates can be either liquid media (96-well microtiter plates) or solid media (square plates).     Dry plates on a clean bench for 10 min, for light-sensitive compounds turn off lights.    Make sure that no droplets of condensed water are on the plates or lids before using them.   Label plates before spotting strains.  When using a Singer robot use the following settings in the ROTOR HDA software:   For solid source plates activate the “offset” function, to avoid pins taking cells from exactly the same spot.    If liquid source plates are used, enable the “wet mix” option in the software menu (diameter: 1 mm; speed: 3 mm/sec; cycles: 1; Travel: 2D). Alternatively, liquid source plates can be shaken on a MixMate for 15 sec at 750 rpm.",
    "If the so-called RePads are used for more than one target plate (“Recycle Mode”), the “Revisit Source” option should be enabled as well.     After plating, turn plates upside down as soon as spots have dried. In case of solid source plates, the target plates can be turned right away. Incubate plates for 72 h at 30 °C without shaking and inspect colony growth. Pictures should be taken of every plate at 24, 48 and 72 h. Visually compare the growth of each mutant strains and controls under stress and without stress with the growth of wild type strain(s). Important points that should be considered are shown in Figures 2 and 3.      Serial dilution spot assays (solid SC media)   For refined screening, prepare at least two SC media plates for each condition. Prior to their use, dry them on a clean bench. Grow overnight cultures of sensitive and wild type strains from the 96-well screening in SC medium at 30 °C with shaking at 200 rpm (200 rpm are used for growth in culture tubes; a total amount of 5 ml for each culture is sufficient). Dilute cultures into fresh SC medium resulting in an OD600 of ≈ 0.2 and regrow them to an OD600 of ≈ 1.0. Prepare 1:10 serial dilutions of deletions strains in sterile water in a 96-well plate, starting with an OD600 of 0.1.  Table 1. Serial dilution of cells table:",
    "﻿0,1,2\nOD600,Dilution,Cells/m\n0.1,1:1,3 x 106\n0.01,1:10,3 x 105\n0.001,1:100,3 x 104\n0.0001,\"1:1,000\",3 x 103",
    "Spotting uses a 48-well metal pin replicator, also referred to as “frogger” or “hopper”.    Sterilize the tool by submerging the pins in EtOH and brief flaming over a bunsen burner. Repeat this process three times and let the pins cool down.    Stir the serial dilution in the 96-well plate using the replicator and retract the pins from the wells without touching the wall of the wells.    A droplet of cell suspension will remain on each tip of the replicator.     Place the replicator on a fresh screening plate and apply gentle pressure. Lift the replicator straight up, avoid an angle and repeat the process for other plates.    Incubate the plates as described above at step B3 and takes pictures of every plate after 24, 48 and 72 h of incubation.      Alternatively, spotting can be performed using a multichannel or a single-channel pipette. When using a pipette, a grid should be placed under the plate to make sure the drops are placed in a straight line.    After the drops have dried, turn the plates upside down and incubate them at 30 °C for 72 h without shaking. Compare growth of the serial dilutions of each mutant and the wild type control under stress and without stress.     Microdilution of compounds (liquid media)   Grow overnight cultures of deletion and control wild type strains in YPD at 30 °C with shaking at 200 rpm (as described in step C1, 200 rpm are used for culture tubes; 5 ml of each culture are sufficient). Dilute strains in fresh YPD media resulting in an OD600 of ≈ 0.2 and regrow them until an OD600 of ≈ 1.0. Dilute cell suspensions in 2x YPD to a final concentration of 2.5 x 103 cells/ml.",
    "Prepare a series of ten two-fold dilutions of the compound to be tested in sterile water. Fill each well with 100 µl of compound dilution or water. Rows 11 and 12 should only contain sterile water and be used as growth and no-growth control.   Add 100 µl cell suspension in 2x YPD to the wells of the 96-well plate. Seal the plate using a clear breathable foil and incubate the plate at 30 °C without shaking for 48 h. Measure the OD600 on a plate reader after 24 and 48 h. Before reading the plate mix it at 1,000 rpm for 15 sec. Calculate compound concentrations required to obtain 50 % growth inhibition (IC50) for each strain.      Evaluation of results   Since the large-scale screening may result in false-positive hits, it needs independent unbiased inspection of primary results. Therefore, the screenings described in sections C-D should be independently analyzed by at least two persons.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150717/20150717041551_5714.png Figure 1. Screening process-from large scale to single strains. Putative hits (purple, blue, pink) are identified by comparing growth of strains on a control plate (YPD only) with a plate supplemented with screening compounds. In addition, deletion strains must be compared to the corresponding wild types (first two rows). These strains are then used for a refined screening in liquid assays through serial dilution on solid media to confirm primary phenotypes.    To validate the link between a genotype and a phenotype more experiments are necessary. These experiments include the complementation of deletion strains and the deletion of a single gene in different backgrounds."
  ],
  "subjectAreas": [
    "Microbiology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}