{
  "id": 2277,
  "origin_website": "Cell",
  "title": "Protocol for rapid obtention and fractionation of anaerobic bacterial conditioned media to study calcium signaling in enteroendocrine cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAkkermansia muciniphila cultivation in an anaerobiosis chamber\nTiming: 42 h\nThis step describes the Akkermansia muciniphila incubation period and its growth rate appropriate for media conditioning.\nAdd 100 μL of the first inoculum, where the bacteria were unfrozen and metabolically activated at 37°C, in 2 flasks of BHI medium and keep them in an anaerobiosis chamber at 37°C. From these flasks, Akkermansia muciniphila conditioned medium (BHI CM) will be collected.\nUnder the same conditions keep another 2 flasks containing only BHI that will be used later as negative controls for the experiments (BHI).\nKeep all bottles incubated for 36–40 h until bacterial growth reaches an OD600 = 0.6. This information can be obtained by using a spectrophotometer. BHI unconditioned media should be used as blank.\nCritical: Before moving on to the next step, mount a slide and coverslip containing 10 μL of the bacterial suspension or unconditioned media obtained in the previous item (steps 1 and 2) and observe under light microscopy to check for contamination in both flasks.\nOptional: Different supplementations can be used, such as adding mucin or other compounds to the bacterial culture medium. One should always remember to add them in equal proportion to the negative control flasks where the bacteria will not be inoculated.\nAkkermansia muciniphila conditioned media collection\nTiming: 30 min\nThis step describes how the planktonic bacterial cells should be separated from the supernatant and the conditioned medium collected.\nPrepare an ice bath.\nOrganize a biological safety cabinet to work in a sterile environment.\nAdjust the setting of the 50 mL Falcon tube centrifuge to 5,000 g at 4°C and wait until the temperature cools down.",
    "Individually transfer the bacterial suspension and the pure BHI medium into sterile 50 mL Falcon tubes. Identify them properly and immediately store them in an ice bath.\nThen position them alternately in the centrifuge and centrifuge at 5,000 g, 4°C for 10 min.\nWithin a biological safety cabinet, sterilely collect the supernatant and transfer it to a new sterile 50 mL Falcon tube. Also collect the pure BHI medium in the same way.\nDiscard the bacterial pellet.\nNote: If necessary, repeat centrifugation step 8 to completely decant the planktonic Akkermansia cells.\nPause point: At this step, the conditioned and unconditioned media can be stored at −80°C until the time of media fractionation and concentration.\nFractionation of Akkermansia muciniphila conditioned media\nTiming: 1 day\nThis step describes the process of concentrating of BHI CM and BHI. In the case of BHI CM, the > 3 KDa fraction is rich in proteins produced by Akkermansia while the < 3 KDa fraction is very reduced in proteins. This distinction can be elucidated using Nuclear Magnetic Resonance (NMR) approach (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1745-Fig1.jpg\nFigure 1. Akkermansia muciniphila conditioned medium characterization and experimental application\n(A) Protein side-chain HN NMR spectrum evaluated by 500 MHz 1H NMR spectra of > 3 kDa fraction of Akkermansia muciniphila conditioned BHI (black line) and BHI+0.4% mucin (red line) and < 3 kDa fraction (flow-through) of BHI CM (blue line).\n(B) Confocal microscopy imaging of STC-1 cells incubated with Fluo-4/AM (6 μM) and stimulated with 10% (v/v) >3 kDa and <3 kDa fraction of A. muciniphila conditioned medium (BHI CM) (scale bar: 10 μm) Images were pseudocolored for fluorescence intensity according to the scale shown on the right.\n(C) Representative time-course of total Ca2+ signal. Arrow indicates the moment when culture medium was applied.",
    "(D) Quantification of the peak fluorescence following stimulation with 10% (v/v) >3 kDa and <3 kDa fraction of A. muciniphila conditioned medium (BHI CM). Error bars indicate the media ± SD n= at least 25 cells for each group, ∗ p< 0.05 by unpaired Student’s t-test.\nInside a biological safety cabinet, sterilely and individually transfer the BHI CM or BHI to the centricon top.\nProperly identify the centricon cover and body.\nKeep the original tubes containing BHI CM and BHI in an ice bath during the entire procedure.\nPlace the centricons in the centrifuge so that the weight is balanced inside the centrifuge and centrifuge at 5,000 g, 4°C for 20 min.\nThen, using a micropipette, make repeated flush in the center of the centricon membrane to homogenize the fraction being concentrated. Be careful not to touch the membrane with the tip, to prevent tearing.\nRepeat steps 11–13 as many times as necessary until the BHI CM and BHI are concentrated in the top of the centricon to a 3 mL volume.\nNote: The <3 kDa fraction (retained in the lower portion of the centricon) will probably increase in volume rapidly in the centricon. Do not let it reach the membrane as this will hinder the concentration process. If that happens, transfer this volume to a new sterile 50 mL Falcon tube, properly identified. Keep it in on ice (4°C).\nCritical: Be careful to not mix >3 kDa and <3 kDa fractions, or BHI CM with BHI. Always dispose used micropipette tips. Always identify the cap and body of the tubes and centricon used.\nCritical: To avoid thawing cycles, it is recommended that this entire step of fractionation the BHI CM and BHI be done on the same day.",
    "Once fractionated, collect the BHI CM and BHI >3 kDa and <3 kDa fractions in properly identified sterile 15 mL tubes.\nThen, with the help of a syringe attached to a 0.22 μm filter, sterilize each of the fractions by transferring them to new sterile and identified containers.\nAliquot and immediately store them at −80°C until the moment of use.\nNote: The fractions can be stored in sterile microtubes of 3 mL (or less) or divided into smaller portions containing volumes suitable for use. This form of storage is interesting because it avoids thawing cycles of the samples.\nIntracellular calcium signaling imaging\nTiming: 4–5 h\nThis step describes the enteroendocrine cell line STC-1 cultivation, and how to stimulate them using the Akkermansia muciniphila conditioned medium fractions in an intracellular Ca2+ Signaling experiment (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nOnce the desired confluence is reached (70%–80% is ideal), dilute the desired Ca2+ indicator (in our example, Fluo-4/AM) according to the manufacturer’s specifications (see at Fluo-4/ AM calcium indicator) and keep it in an ice bath. Transfection of cells with Ca2+ indicator plasmids (e.g., GCaMP) can also be performed.\nTurn on the CO2 and heating of the confocal microscope stage by setting it to 37°C. Adjust the laser settings and parameters for live imaging.\nThe experiments in this protocol were performed on a Leica SP8 confocal microscope using a ×63 objective lens, 1.4 NA.\nExcitation at 488 nm and emission at 505–525 nm.\nFrame scanning module at a 15 f/s during 5 min of imaging is an ideal parameter.\nNote: Other parameters such as zoom or laser intensity, for example, may vary in microscopes at different locations, and therefore should be standardized in advance by the executors of this protocol.",
    "Add the fluorescent probe for cytosolic calcium detection Fluo-4/AM to one of the wells of the STC-1 plate, according to the concentration indicated by the probe manufacturer (see at Fluo-4/AM calcium indicator), and keep it at 37°C for 15–20 min.\nThen remove from the 6-well plate one of the glass coverslips on which the STC-1 cells have grown adhered and transfer it to an imaging chamber on a stage of a Leica SP8 Confocal System and continuously perfused with HEPES buffer solution.\nSelect an image field where the cells are spread out and the initial fluorescence emission is homogeneous.\nStart live-image recording of the cell in its basal state for approximately 100 s to acquire a baseline of fluorescence. Then add the desired stimulus, for example BHI CM (>3 kDa) 1 or 10% (v/v) and keep recording the response for approximately another 300 s.\nSave and properly name the obtained image file in a folder of the repository where your lab’s confocal microscopy data is located.\nRepeat steps 15–18 using another well of the STC-1 plate, and this time stimulate the cells with 10% (v/v) BHI (>3 kDa) as the experiment negative control.\nNote: For each variable (for example, <3 and >3 kDa BHI CM and BHI fractions at different concentrations of 1 and 10% (v/v)) an individual experiment should be performed at least 3 times. Around 25 cells per coverslip/chamber are analyzed.\nOptional: Other experimental approaches can be performed by adapting this protocol. By incubating the cells in Ca2+-free HEPES buffer, one can obtain information on whether or not the intracellular Ca2+ signaling observed is dependent on extracellular Ca2+ stocks.\nData are expressed as fluorescence/baseline fluorescence × 100% of the average values of samples from at least 3–6 biological replicates (≥25 cells/replicate).",
    "This type of experimental approach allows to obtain a representative figure (or video) of the cells in their basal and stimulated condition and a graph of the Ca2+ response profile to the stimulus.\nIt is also possible to quantify the maximum and mean fluorescence amplitude obtained upon stimulation, and they are related to the increased Ca2+ fluctuation in the cells.\nSee Figure 1[href=https://www.wicell.org#fig1]."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}