{
  "id": 13719,
  "origin_website": "Jove",
  "title": "Direct Induction of Hemogenic Endothelium and Blood by Overexpression of Transcription Factors in Human Pluripotent Stem Cells",
  "procedures": [
    "1. Virus Preparations and Transcription Factor Combinations\nPrepare solutions with pSIN-EF1α lentiviral expression plasmid containing protein-coding DNA for ETV2, GATA1, GATA2, TAL1 and LMO2 (Table 1).\nMeasure the concentration and purity of plasmid preparations used for lentiviral production by recording UV absorption with a spectrophotometer at 230 nm, 260 nm, and 280 nm. Note: DNA preparations demonstrating A260/280 and A260/230 values greater than 1.8 are generally considered good quality. Lower A260/280 values may indicate protein contamination, while lower A260/230 values indicate impurities with salts or some solvent such as phenol. Recommended plasmid concentration is 1-3 µg/µl.\nProduce lentiviruses for transductions as described in previously published protocols11. Induction of HE with pan-myeloid potential requires co-expression of ETV2 and GATA1, or ETV2 and GATA2. Induction of HE with erythro- and megakaryocytic potential requires GATA2 and TAL1. The addition of LMO2 significantly improves the yield of erythro-megakaryocytic cells from hPSCs in the presence of GATA2 and TAL110.\n2. hPSCs Culture Protocol\nGrow pluripotent stem cells in tight colonies with sharp edges to 70-80% confluency before subculturing. Mark and remove spontaneously differentiated colonies before passaging cells.\nDilute commercial extracellular matrix gel (see Table 2) according to the manufacturer’s instructions and coat 6-well plates overnight at 4 °C, or for at least one hour at 37 °C prior to use. Before passaging cells, aspirate the matrix, add 2 ml of fresh commercial complete culturemedium (see Table 2) and keep plates at 37 °C, 5% CO2 until the cells are ready for seeding.\nPassage hPSCs",
    "Aspirate medium from one confluent well of a 6-well plate with hPSCs and add 1.5 ml of pre-warmed Dispase II solution (2 mg/ml in DMEM/F12, sterilized by filtration through 0.22 µm filters). Incubate for 5-7 min at 37 °C, 5% CO2 until the edges of colonies begin to lift from the surface.\nAspirate Dispase II solution and carefully wash the colonies twice by adding and then aspirating 2 ml of fresh DMEM/F12 medium. Then, using a 5 ml serological glass pipette, dissociate hPSCs with 3 ml of fresh commercial complete culture medium (see Table 2) by pipetting cell suspension up and down several times.\nAdd 0.5 ml of cell suspension to each well of a 6-well plate containing 1.5 ml of commercial complete culture medium (see Table 2). Agitate plate back and forth and right to left several times to ensure a uniform cell distribution when situating the plate into the incubator. Keep cells at 37 °C, 5% CO2 for 18-24 hr.\nThe next day change medium to fresh commercial complete culture medium (see Table 2) and examine hPSCs morphology. Successful passaging results in small, well-attached colonies retaining hPSC morphology. hPSCs must be fed with 2.5-3 ml freshmedium per well on a daily basis and passaged every 4-5 days at no more than 70-80% confluence.\n\t\tNOTE: If hiPSCs were maintained on mouse embryonic fibroblasts (MEFs), they need to be transferred to feeder-free conditions and passaged 2-3 times before transduction to ensure efficient differentiation.\n3. Induction of Hematoendothelial Pprecursors from hPSCs (day 0, Transduction of hPSCs)",
    "To prepare reaction medium combine 1.3 ml of commercial complete serum-free medium (see Table 2), virus, polybrene, and Y27632 ROCK inhibitor (Table 1): add 1.3 µl of 10 mM ROCK inhibitor to 1.3 ml medium to a final concentration of 10 μM, and polybrene to a final concentration 6 µg/ml.\n\t\nAdd an appropriate amount of viral concentrate(s) at a final concentration of 0.5-1.0 MOI (multiplicity of infection) of each virus per cell. Keep reaction medium on ice or at 4 °C until the single cell suspension is ready.\n\t\tNOTE: The same amount of MOI for each virus in the GATA1/ETV2, GATA2/TAL1, and GATA2/TAL1/LMO2 reaction mixtures is optimal for induction of differentiation. However, in ETV2/GATA2 transduced cultures doubling MOI for GATA2, relative to ETV2, enhances differentiation. Therefore, for these cultures, ratio 1:2 for MOI of ETV2 and 1 MOI of GATA2 is recommended (e.g. if viral concentrate is estimated approximately 6.8 x 107 particles/ml, add 10 µl of ETV2 and 20 µl of GATA2 viral concentrates to 0.68 x 106 cells per one ETV2/GATA2 reaction in a 35 mm well of a 6-well plate).\nPrepare hPSCs in a single cell suspension.\n\t\nGrow hPSCs in feeder-free conditions as described in section 2. On day 4 following the last passage, observe cell density and morphology under an inverted microscope. hPSCs should grow in tight colonies with sharp edges with no spontaneous differentiation and reach ~60-70% confluency on the day of transduction.\nAspirate medium, add 1.5-2 ml of commercial cell dissociation reagent (Table 1) per well and incubate at 37 °C with 5% CO2 for 5-7 min.",
    "Collect cells into equal volumes of commercial complete medium (see Table 2) with 10 µM of ROCK inhibitor, count the cells and determine viability. Pellet cells by centrifugation at 200 x g for 5 min and then resuspend cells in commercial complete medium with 10 µM of ROCK inhibitor to a concentration of 3.4-5 x 106 cells per ml.\n\t\tNOTE: Cell viability is critical for successful viral transduction and subsequent differentiation. Typically, cell viability before transduction should exceed 90%.\nAdd 200 µl of the cell suspension, containing 0.68-1 x106 cells, into 1.3 ml of the reaction medium prepared in 3.1.\nAspirate the matrix solution from the overnight coated 6-well plate prepared in 2.2., transfer the reaction mixture to one well of a 6-well plate and distribute cells evenly. Incubate at 37 °C with 5% CO2 for 24 hr. After 24 hr at least 80% of the cells should be attached to the matrix.\n4. Induction of Hematoendothelial Precursors from hPSCs (Day 1-7)\n24 hr post-transduction, remove virus-containing medium and wash attached cells with commercial incomplete cell culture medium (see Table 1) and then add 3 ml per well of commercial incomplete cell culture medium containing hematopoietic cytokines: SCF 100 ng/ml, TPO 50 ng/ml, bFGF 20 ng/ml (hereafter referred to as 3F-medium).\nReplace total medium with fresh 3F-medium on days 2, 3 and day 4 to remove dead cells and debris. After day 4, when floating hematopoietic cells are emerging, replace half of the 3F-medium every other day while maintaining the total volume at 4 ml.\n\tNOTE: pSIN-EF1α lentiviral expression plasmids incorporate puromycin resistance gene thereby allowing for positive selection of transduced cells. The 1 μg/ml of puromycin can be added to medium during the first 1-2 days of differentiation to eliminate the any residual undifferentiated hPSCs.",
    "Observe cell morphology on day 4 under an inverted microscope: tight clusters of cells with typical endothelial morphology begin to appear (Figures 2A, 3A). Round blood cells appears from day 5 to day 7 of differentiation, while some areas may retain hPSCs morphology. Analyze HE and hematopoietic differentiation as described below.\n\tNOTE: Successful hematoendothelial differentiation results in the production of blood cells that appear as refractile round cells loosely attached to underlying flat endothelial cells. These cells actively proliferate forming small aggregates, and eventually detach and float (Figures 2A and 3A). Live blood cells can be visually distinguished from the dead and dying cells based on their ability to reflect the light and expand in culture conditions.\n5. Analysis of Hemogenic Endothelium (HE) Stage of Differentiation.\nDetect the formation of HE between days 3 and 4 of differentiation by microscopic observation of cells with endothelial morphology. There are no floating blood cells in the culture at this stage of differentiation. The presence of HE can be confirmed by immunofluorescent staining and flow cytometric analysis using VE-cadherin, CD73, CD226 and CD43 antibodies.\n\t\nTo assess HE formation by flow cytometric analysis use cells on day 3 and day 4 from one experiment. Collect cells by incubating of cultures with commercial cell dissociation reagent (see Table 1) for 5-10 min at 37 °C, 5% CO2 and then use up to 1 x 105 cells per staining reaction (flow cytometry staining procedure described in 12).\n\t\tNOTE: VE-cadherin+ HE cells acquire expression of early hematopoietic marker CD226, but lack the expression of CD73 and CD436. In contrast, non-HE cells express CD73 (Figures 2B, 3B).\nImmunofluorescence staining for hPSC-derived HE.\n\t\nWash the attached monolayer of cells with phosphate buffered saline (PBS) and then fix cells in 4% paraformaldehyde from 30 to 60 min at room temperature.",
    "Wash cells again with PBS and then permeabilize using 0.1% Triton X-100 in PBS for 20 min at room temperature.\nWash cells in PBS two to three times and then incubate in blocking buffer consisting of PBS with 10% fetal bovine serum (FBS), for 30 to 120 min.\nPrepare staining solution, containing both primary antibodies (1:1,000 dilution) mouse anti-human CD43 and rabbit anti-human VE-cadherin in PBS with 5% FBS, (Table 1).\nAspirate the blocking buffer from the cells and add 1 ml per well of staining buffer with the added primary antibodies; incubate 3 hr at room temperature, or overnight at 4 °C.\nWash the cells three times by adding 2 ml of PBS with 5% FBS.\nPrepare a second staining buffer, containing secondary antibodies at 1:500 dilution in PBS with 5% FBS: donkey anti-rabbit conjugated with green fluorescent dye, and anti-mouse conjugated with red fluorescent dye (Table 1). Add 1 ml per well of secondary staining buffer and incubate at room temperature for 1 hr.\nWash three times with PBS without serum. Stain cells with 300 nM DAPI working solution in dH2O for 10-15 min.\nWash cells with PBS twice and add 2-3 ml of PBS into well with stained cells. Observe fluorescence with green, red and blue microscope filters.\n6. Analysis of Induced Hematopoietic Precursors\nMaintain differentiation cultures until floating cells expand significantly, up to 10-14 days, changing half of the 3F-medium, as described in 3.1, every two days.\nDissociate and collect differentiating monolayers of cells by treating cells with a commercial cell dissociation reagent (see Table 1) for 5-10 min at 37 °C, 5% CO2.",
    "Perform flow cytometry using anti-VE-cadherin, CD43 and CD45 antibodies to evaluate hematopoiesis in cultures12. Note that a large fraction of cells, up to 40% of ETV2 and GATA2 transduced cells, co-expresses VE-cad and CD43. The following antibodies can be used to detect specific cell lineages following expansion or differentiation of induced blood progenitors: CD235a (erythroid cells), CD41a (megakaryocytic), CD32 (all types of myeloid cells), CD66b (neutrophils) and CD163 (macrophages).\nPerform CFC-assay using a commercial clonogenic medium (Table 1) according to the manufacturer’s instructions.\n\t\nTransfer 1-2 x 104 cells into 3 ml of commercial clonogenic medium (see Table 3) to assess the number of colony-forming cells and types of hematopoietic colonies. Optimal seeding density allows for the identification and isolation of single colonies that grow separately from each other and do not overlap. Seeding density may vary between experiments depending on differentiation efficiency, but should not exceed 1 x 104 cells per 1 ml of commercial clonogenic medium.\nMix cells in commercial clonogenic medium by gentle vortexing, and transfer 3 ml of suspension to two 35 mm ultra-low attachment dishes for CFC assay, 1.5 ml of suspension to each dish. Distribute medium evenly and incubate at 37 °C, 5% CO2 for 14 days. Avoid disturbing the dishes; observe colony formation on day 7 and day 10 of assay.\nIdentify and count hematopoietic colonies according to their morphologies on day 14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}