{
  "id": 2811,
  "origin_website": "Cell",
  "title": "Protocol for in vivo lineage tracing of the mouse-papillomavirus-type 1-infected cells in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Generating the plasmid for animal infection\nTiming: 2 days\nThis part describes the generation of the plasmid for animal infection by removing the ampicillin bacterial selection cassette from lox-Cre-lox and puC19-MmuPV1 plasmids using XhoI and XbaI. The two fragments (lox-cre-lox and MmuPV1) are then gel purified and ligated overnight (16–18 h) at 16°C (ligation was done using a ratio of 1:2.5, MmuPV1 to lox-cre-lox).\nXhoI and XbaI digestion of lox-cre-lox and puC19-MmuPV1 plasmids.\nSet up a large-scale double digestion in Takara buffer M with the XhoI and XbaI restriction enzymes as per manufacturer’s instructions: https://www.takarabio.com/us/products/molecular_biology_tools/restriction_enzymes/double_digestion_buffers[href=https://www.takarabio.com/us/products/molecular_biology_tools/restriction_enzymes/double_digestion_buffers].\nCheck that the digestion is completed by running a small amount on a 1% agarose gel.\nAfter the validation run a large agarose gel to separate the products and the cut bands as follows:\nMmuPV1: isolate the 6 kb band.\nlox-Cre-lox: isolate the 4 kb band.\nPurify DNA from the gel of these cut bands by using the NucleoSpin Gel and PCR Clean-up, Mini kit for gel extraction and PCR clean up and follow the manufacturer’s instructions: https://www.mn-net.com/media/pdf/02/1a/74/Instruction-NucleoSpin-Gel-and-PCR-Clean-up.pdf[href=https://www.mn-net.com/media/pdf/02/1a/74/Instruction-NucleoSpin-Gel-and-PCR-Clean-up.pdf].\nQuantify DNA concentration via Nanodrop and confirm the size by running a 1% agarose gel with 1 kb DNA ladder in which, the mass of DNA in each of the bands is provided (assuming a 0.5 μg load) for approximating the mass of DNA samples of similar size.\nLigation of the two plasmids.\nBring the digested DNA (30–50 μg total) up to a 5 mL volume with DEPC water and 1x T4-DNA ligase buffer (500 μL) in a 50 mL conical tube.\nAdd 8 μL of high concentration (2 m U/mL) T4-DNA ligase (NEB).\nIncubate the ligation mix at 16°C overnight (16–18 h).",
    "Precipitate the ligated DNA by adding 2.5 mL of 7.5 M ammonium acetate and 12.5 mL of 95% Ethanol (4°C) into ligation mix and vortex well.\nIncubate at 4°C overnight (16–18 h).\nIsolate the ligated DNA by centrifuging the mix at 4°C for 10 min at 10,000 rcf.\nDecant the supernatant carefully and wash the pellet with 1 mL of 70% Ethanol (transfer the genome in an Eppendorf tube) and centrifuge the sample in room temperature (20°C–22°C) for 10 min at 5,000 rcf.\nCarefully decant the supernatant and repeat the washing steps 2–3 times.\nDecant the final supernatant and let the pellet air-dry for 10 min. Dilute the ligated DNA in DEPC treated water.\nQuantify DNA concentration on nanodrop and confirm the size by running a 1% agarose gel with 1 kb DNA ladder with known mass.\nUse the online calculator at http://nebiocalculator.neb.com/#!/dsdnaamt[href=http://nebiocalculator.neb.com/] to calculate the generated DNA copy number from the known DNA length and DNA mass.\nCritical: After the calculations, prepare several aliquots with low volume to avoid freezing and thawing the plasmid repeatedly. Keep the aliquots in −80°C indefinitely, until the plasmid delivery day.\nPart 2: Plasmid delivery to the R26R-lox-STOP-lox-eYFP mice\nTiming: 4–6 h, depending on the number of mice",
    "This part describes the steps to shave the back skin of 6–9 weeks old female R26R-lox-STOP-lox-eYFP mice and apply a single dose of 1,000 mJ/cm2 UV-B irradiation for transient immunosuppression. Following the UV-B radiation, the mice are given at the same day with 2 × 109 DNA copies of the generated MmuPV1-lox-Cre-lox plasmid or the commercially available CAG-Cre plasmid (control plasmid) in a 10 μL of PBS solution applied at the base of the tail skin by a superficial dermabrasion with a pipette tip to expose the tail basal layer (Scheme 1[href=https://www.wicell.org#sch1]). Perform all the steps below in a BSL2 biological safety cabinet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2318-Sch1.jpg\nScheme 1. Dermabrasion and plasmid delivery\n(1) Place the mouse into a mouse restrainer and hold out the tail of the mouse. For dermabrasion, use a 20–200 μL pipette tip, rubbing it back and forth with the side of the pipette tip on the surface of the base of the tail skin approximately 20–30 times while keeping the tail stretched by hand. (2) Apply the plasmid by pipetting 10 μL of plasmid containing PBS solution on the top of the area of the dermabrasion (to the epidermis layer). (3) continue rubbing with the side of the pipette tip very slowly for another 10–20 times and wait until the solution is completely absorbed by the skin or dry out before continuing to the next mouse.\nShave the back skin of the mice.\nOne by one, hold the mouse by its tail and lift it up and use a common electric hair trimmer to shave most of the back skin of the mouse starting from the base of the tail.\nUV-B irradiation of the mice.",
    "After the mice are shaved, put them all into a glass container without a lid and place the container with the mice inside the UV machine.\nProgram the machine to apply UV-B irradiation in a dose dependent manner set to 1,000 mj/cm2. This generally takes 2–5 min per cage of mice.\nSuperficial dermabrasion of the tail skin and delivery of the plasmid, 5–7 min per mouse (Scheme 1[href=https://www.wicell.org#sch1]).\nOne by one, place the mouse into a mouse restrainer which exposes and gives easy access to handle the tail of the mouse.\nDermabrasion is performed by using a 20–200 μL pipette tip, rubbing it back and forth with the side of the pipette tip on the surface of the base of the tail skin approximately 20–30 times while keeping the tail stretched and strait by hand.\nThen, apply the plasmid by pipetting 2 × 109 DNA copies of MmuPV1-lox-Cre-lox or CAG-Cre plasmid in a 10 μL of PBS solution on the top of the area of the dermabrasion (to the epidermis layer).\nContinue rubbing with the side of the pipette tip very slowly for another 10–20 times.\nWait until the solution is completely absorbed by the skin or dry out before continuing to the next mouse. By this method, the plasmid should have access to the basal cell layer of the epidermis via the minor cracks established by the mild dermabrasion.\nOptional: One can also shave mice one day and perform the UV-B irradiation and infection the next day.\nNote: Tail skin was selected for plasmid delivery for practical reasons such as the ability to track area where plasmid was delivered and fewer hairs which place barriers on cell dissociation for flow cytometric analysis. If the instructions are followed precisely, all mice should harbor the delivered plasmid.",
    "Critical: Dermabrasion of the tail skin with a pipette tip should be done very gently as to only expose the tail skin basal layer, which does not require much force. Further, after applying the plasmid in PBS solution, wait 1–2 min until the solution is dried out. Also, perform the delivery of the control plasmid or mock infections first and then the delivery of the MmuPV1-lox-Cre-lox plasmid to avoid cross contamination between mice groups.\nPart 3: Tissue procurement and processing\nTiming: 1 day\nThis part describes the steps to sacrifice mice and extract tail skins, followed by the incubation of the tail samples in a 0.25% trypsin containing EDTA solution (Sigma-Aldrich) overnight (16–18 h) at 4°C. The next day, epidermis should be separated from dermis by using tweezers, the tissue should be cut into small pieces and mechanically dissociated using a handheld homogenizer (POLYTRON PT 1200 E). Perform all the steps below in a BSL2 biological safety cabinet.\nSacrifice mice at the desired time points (0, 5, 10, 30 days post-delivery).\nEuthanatize mice by using first a CO2 chamber and then cervical dislocation.\nExtract tail skin (Scheme 2[href=https://www.wicell.org#sch2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2318-Sch2.jpg\nScheme 2. Extracting mouse tail skin for further processing",
    "(1) Extract the mouse tail skin by cutting the tail from the body completely by the base with a scissor. (2) Make a small incision at the base end of the tail with a small surgical blade. (3) Grab the skin from here and strip the whole tail skin from the tail bone in one firm motion with using the tweezers. (4) Now, we have the tail skin completely peeled off from the tail bone. (5) Cut out the part of the tail skin where the plasmid was applied and discard the rest of the tail skin. (6) Continue with this skin sample for enzymatic digestion and separation of epidermis from dermis.\nExtract the tail skin by cutting the tail from the body completely by the base.\nMake a small incision at the base end of the tail and grab the skin from here and strip the whole tail skin from the tail bone in one firm motion with using the tweezers.\nCut out the part of the tail skin where the plasmid was applied in a rectangular shape that is 3–4 cm and discard the rest of the tail skin.\nSeparating dermis from epidermis.\nPlace the rectangular tail skin samples into a 6-well plates that contains 4 mL of 0.25% trypsin containing EDTA solution.\nIncubate overnight (16–18 h) at 4°C for enzymatic digestion.\nAfter the incubation (the next day), use tweezers to separate epidermis from dermis by grabbing the tail skin sample with the tweezers and gently press down. The epidermis should easily come off from the dermis due to the trypsinization.\nNext, cut the separated epidermis to even smaller pieces with surgical blades to make it easier to create single cell suspension from the epidermis.",
    "Put the small pieces in to a 15 mL Falcon tube with the 4 mL of trypsin containing medium from the well and mechanically dissociate the cells by using a handheld homogenizer such as POLYTRON PT 1200 E.\nOptional: One can also perform the trypsinization at step 8b for 2 h at 37°C instead of overnight at 4°C and continue with separating epidermis and preparing the single cell suspension for FACS staining.\nNote: One does not have to use a handheld homogenizer at step 8e to dissociate the cells. This can also be done by pushing the tissue pieces through a cell strainer by using the piston/plunger from a sterile 3 cc syringe. Use the flat end of the plunger to mince the sample by crushing the sample on the strainer in gentle circular motions.\nCritical: It’s very important to clean the homogenizer vigorously before every sample by dipping the tip of the homogenizer in to a 70% ethanol and turn it on and repeat this in clean PBS solution as well just before using it for the next skin sample. Also, process the skin of the control or mock infection group first and then the MmuPV1-lox-Cre-lox infected samples. This will further prevent cross contamination between samples.\nPart 4: Antibody staining and flow cytometry\nTiming: 4–6 h, depending on sample number and acquisition speed",
    "This part describes the steps to wash the resulting single cell suspensions from previous step with PBS and incubate the cells with the mentioned fluorescently conjugated antibodies for 30 min at 4°C. After surface marker staining, cells should be fixed and permeabilized for 10 min with 2 × BD lysing solution (BD Biosciences) + 0.1% Tween, washed, and then stained in PBS for intracellular Ki-67 staining. We then perform multiparametric flow cytometric analysis using a Bio-Rad S3e Cell Sorter flow cytometer and analyze the data using FlowJo software (FlowJo, LLC). The population of live cells is detected depending on their size and complexity (FSC-SSC gate) and later the doublets are excluded (FSC-Height/FSC-Area gate) before the analyses of the markers.\nWash and stain cells.\nTransfer the samples into 5 mL FACS tubes and fill up the tubes with PBS.\nCentrifuge samples for 5 min at 300 rcf and 4°C and decant supernatant.\nIn the meantime, prepare the solution for MHC-I staining as follows: For 10 samples, calculate for 12 for the volume of 100 μL for each sample. This is 1,188 μL of PBS and 12 μL of the BV421 – MHC-I (H2Kb) antibody in a 1:100 ratio.\nResuspend cells with 100 μL of the staining solution, vortex well and incubate cells 30 min on ice or at 4°C.\nFixation and permeabilization for Ki-67 staining.\nPrepare the fixation/permeabilization solution as follows: For 10 samples (calculate for 12) for the volume of 1 mL for each sample. This is 2.5 mL of BD Lysis Buffer (BD Biosciences), 10 mL of ddH2O and 12.5 μL of Tween 20 (Sigma-Aldrich).\nAdd 1 mL of fixation/permeabilization solution to each sample without washing and incubate 10 min at room temperature (20°C–22°C) in the dark.\nWash the cells as mentioned at steps 9a and 9b.",
    "In the meantime, prepare the solution for Ki-67 staining as follows: For 10 samples, calculate for 12 for the volume of 100 μL for each sample. This is 1,188 μL of PBS and 12 μL of PerCP/Cy5.5 – Ki67 antibody in a 1:100 ratio.\nResuspend cells with 100 μL of the staining solution, vortex well and incubate cells 30 min on ice or at 4°C.\nWash the cells as mentioned at steps 9a and 9b.\nResuspend the cells with 300–500 μL of PBS and add 5000 of CountBright™ Absolute Counting Beads (Invitrogen) to each sample to be able to calculate absolute numbers.\nAcquisition at Bio-Rad S3e Cell Sorter flow cytometer.\nOpen ProSort software and start the Bio-Rad S3e Cell Sorter.\nAfter 30 min of start-up which warms-up lasers, run QC with Proline™ Universal Calibration Beads.\nCreate a new worksheet and create plots resembling the basic gating strategy to be able to monitor cell populations while recording.\nPass the samples through a cell strainer cap to ensure single cell suspension. The volume of buffer can be adjusted to change the event rate.\nUse and record an unstained control with the same cells to adjust SSC and FSC gains for cell population to be on scale.\nDefine acquisition settings such as events to record, the speed of acquisition and stopping volume or timing. Adjust stopping criteria to high thresholds to make sure that the whole sample is acquired.\nAcquire samples and export fcs files to be analyzed on FlowJo.",
    "Optional: The counting beads enable the calculation of absolute numbers when we analyze the results. This step provides better comparison between samples but remains as an optional step. If there is spillover of fluorescence signal between channels while acquiring, perform single stained controls and acquire with the machine to calculate the compensation for fluorescence signals. One can also use a Live/Dead dye during the FACS staining to better distinguish the live cells from the dead ones during the flow cytometric analysis.\nNote: To dissolve the Tween-20 completely in the fixation/permeabilization solution, leave the pipette tip that was used for adding Tween-20 inside the tube of the solution and leave it on the shaker for 10–20 min while shaking gently.\nCritical: Keep everything on ice while working and use ice cold PBS. Also, for incubation steps and storage, samples and staining mixes should be placed in the dark, as the fluorophores are sensitive to light exposure.\nPause point: Samples can be acquired directly or stored at 4°C overnight (16–18 h) to be measured the next day."
  ],
  "subjectAreas": [
    "Flow Cytometry",
    "Cell Biology",
    "Microbiology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}