{
  "id": 1682,
  "origin_website": "Cell",
  "title": "Biochemical approach for isolation of polyadenylated RNAs with bound proteins from yeast",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell culture and UV irradiation\nTiming: 1.5 days\nIn this step, the cells are UV-irradiated to crosslink RNA-protein interactions in vivo, enabling the subsequent capture of both permanent and transient binding proteins. A sample with non-irradiated cells can be included to control the crosslinking. Other controls, such as the poly(A) competition used in this protocol are introduced in the next step of the protocol.\nPick 1 yeast colony from the YPD agar plate with a sterile loop and inoculate 20 mL YPD media placed in a sterile 100 mL Erlenmeyer flask. Place the flask in a shaker and grow cells overnight (12–14 h) at 30°C with constant shaking at 220 rounds per minute (r.p.m.).\nNote: To ensure good aeration of cells, we recommend using at least 1:5 ratio of culture volume to Erlenmeyer flask volume (i.e., 20 mL of culture in a 100 mL Erlenmeyer flask).\nRefresh culture in 500 mL YPD placed in a sterile 3 L Erlenmeyer flask, setting OD600 ∼0.1, and grow at 30°C at 220 r.p.m to OD600 ∼0.6. This takes about 3 h 30 min (doubling time of cells ∼90 min).\nSet the spectrophotometer at 600 nm wavelength.\nSet up a blank cuvette by placing 1 mL YPD in a disposable plastic cuvette.\nPlace the blank cuvette in the spectrophotometer and take the blank measurement (absorbance (A) = 0.00).\nMake a 1:10 dilution of the 20 mL pre-culture and measure the absorbance.\nCalculate the volume of pre-culture required to inoculate 500 mL YPD with a starting OD600 ∼0.1.\nRemove appropriate volume of pre-culture with a pipette and transfer cells to the 500 mL YPD in a sterile 3 L Erlenmeyer flask.",
    "Place the culture in a shaker and grow cells at 30°C at 220 r.p.m. Measure the OD600 every 2 h until the OD600 reaches ∼0.4. At this point, cells have passed the lag-phase and reach mid-log phase, so it is advisable to start the measures every 30 min.\nNote: Cells can also be subjected to stress treatments to eventually monitor changes in RNA-protein associations as compared to untreated cells. For instance, we treated yeast cells at mid-log phase (i.e. OD600 ∼0.6) with 0.5 mM hydrogen peroxide (H2O2) for 15 min to induce a mild oxidative stress response (Matia-González et al., 2021[href=https://www.wicell.org#bib8]). However, it is essential to confirm that an appropriate stress response has been induced, which can be assessed by monitoring the expression of stress-specific markers.\nIrradiate cells with UV light at 254 nm to crosslink RNA-protein interactions.\nHarvest cells in 500 mL centrifuge tubes at OD600 ∼0.6 by centrifugation at 3,000 × g in a swing-bucket rotor for 3 min at room temperature (22°C–25°C).\nWash cells three times at room temperature with 25 mL phosphate-buffered-saline (PBS). Collect cells in between by centrifugation as indicated in the previous step.\nResuspend cells in 15 mL 1× PBS.\nSpread the cell-suspension in a 15 cm petri dish.\nPlace the dish on ice in the UV-crosslinker. Expose cells to 3 × 400 mJ/cm2 of 254 nm UV-light with two 2-min breaks and gentle mixing between each exposure.\nHarvest cells by centrifugation at 3,000 × g for 3 min at 4°C.\nSnap freeze pellets in liquid nitrogen.\nPause point: Cell pellets can be stored at −80°C for up to two months.\nCritical: It is important that cells are evenly spread in the dish, making a thin layer of cells for exposure to UV-light.\nLysate preparation\nTiming: 1 h 30 min",
    "Cell lysates are prepared by mechanical disruption of cells with glass beads in a TissueLyser.\nResuspend cells in 4 mL lysis buffer by pipetting up and down on ice and split cells in 4 × 2 mL safe-lock microcentrifuge tubes.\nAdd 2/3 vol. glass beads to each tube.\nPlace the tubes balanced in a TissueLyser adapter and break cells at 30 Hz for 10 min at 4°C.\nNote: The TissueLyser is preferentially placed in the cold room to maintain samples at 4°C whilst lysis. Tubes must be balanced within the TissueLyser adapter set to avoid motor failures.\nClear lysate by three sequential centrifugations at 3,000 × g for 3 min, and 5,000 × g and 10,000 × g for 5 min each at 4°C. Carefully remove the supernatant with a filter tip and transfer to a fresh microcentrifuge tube after each centrifugation, avoiding any pellet contamination.\nNote: Repeated centrifugation at progressively higher-speed removes non-lysed whole cells (3,000 × g), cell debris (5,000 × g) and nuclei and cytoskeletons (10,000 × g).\nAfter the last centrifugation, combine all supernatants in a 15 mL Corning centrifuge tube.\nQuantify protein concentration of the final extract with a Bradford assay taking bovine serum albumin (BSA) as a reference standard following the manufacturer’s guidelines[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/4110065A.pdf].\nNote: Typically, we obtained a concentration of ∼3.5 mg/mL protein.\nConcentrate protein sample up to 10 mg/mL with an Amicon® Ultra-4 Centrifugal Filter Unit 10 kDa, following the manufacturer’s guidelines[href=https://www.merckmillipore.com/ES/es/product/Amicon-Ultra-4-Centrifugal-Filter-Unit,MM_NF-UFC801024?bd=1]. Ensure that the final volume does not go below 1.2 mL. Prepare 500 μL aliquots containing ∼5 mg of protein lysate (∼10 mg/mL) in Eppendorf Protein LoBind microcentrifuge tubes.",
    "Note: Make sure the membrane of the Centrifugal Unit is not getting damaged with the pipette tip. Quantify protein amount after concentration as explained in step 10 and ensure that proteins have not aberrantly leaked through a damaged membrane.\nKeep 75 μL of the extract as reference. 50 μL will be used to assess the RNA quality and the remaining can be used for protein analysis (see below).\nPause point: Lysates can be kept on ice and immediately used for later steps in the protocol, or snap frozen in liquid nitrogen and stored at −80°C for up to one month.\nControl step: Analysis of RNA integrity before proceeding with poly(A) RIC.\nRNA quality control.\nIsolate total RNA from 50 μL of extract (=input) with the ZR RNA MiniPrep kit, following manufacturer’s guidelines[href=https://www.bioscience.co.uk/userfiles/pdf/ZR%20RNA%20MiniPrep%E2%84%A2.pdf].\nQuantify RNA with a Nanodrop ND-2000 device.\nVisualize 1 μg RNA on a 1% agarose gel stained with peqGREEN RNA/DNA dye.\nNote: Typically, we obtained 30 μg of total RNA from 50 μL extract.\nCritical: We highly recommend checking RNA integrity after UV-irradiation by comparing the pattern with a non-crosslinked sample. Ribosomal RNA (rRNA) bands should be clearly visible before proceeding with the poly(A) RNA isolation (Figure 1[href=https://www.wicell.org#fig1]A, lanes 1 and 2). Troubleshooting problem 1[href=https://www.wicell.org#sec6.1].\nIn addition, when RNase ONE is included as negative control, RNA integrity after digestion must be analyzed to ensure that RNA is completely degraded and rRNA species cannot be distinguished and only a smear can be visualized (Figure 1[href=https://www.wicell.org#fig1]A, lane 3).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1142-Fig1.jpg\nFigure 1. RNA analysis after UV-irradiation of cells",
    "(A) Testing UV-irradiation and RNase control digest. One μg of total RNA was electrophoresed on a 1% agarose gel and stained with peqGREEN DNA/RNA dye. Lane 1: RNA from non-irradiated cells; Lane 2: RNA from UV-irradiated cells. Lane 3: RNA from UV-irradiated cells and RNase ONE treated extracts. M: molecular weight marker.\n(B) RNA degradation is prevented by UV-irradiation on ice. Lane 1: RNA after exposure of cells to 1,200 mJ without any breaks. Lane 2: one break on ice for 2 min after 600 mJ. Lane 3: 2 breaks on ice (after 400 mJ). M: molecular weight marker.\nNote: Total RNA can be stored at −80°C for further analysis.\nPoly(A) RNA interactome capture\nThis step describes the recovery of poly(A) RNA and interacting proteins with oligo[dT]25 magnetic beads from cell extracts. Isolation of poly(A) RNA will mainly recover mRNA binding proteins, allowing for analysis of the cellular mRBPome. Stringent washing conditions are used to avoid isolation of unspecific binders.\nNote: As negative control for this protocol, we recommend the addition of an excess of polyadenylic acids (poly(A)) to the sample as a competitor. As an alternative, RNA is digested in the extract with an RNase. Optionally, a non-crosslinked sample has been used in a related protocol (Beckmann et al., 2015[href=https://www.wicell.org#bib2]).\nTiming: 6–8 h\nEach experiment requires 500 μL of the yeast cell lysate/extract (10 mg/mL; ∼5 mg of protein lysate).\nControl sample with poly(A) competitor: Add 20 μL of poly(A) (10 mg/mL) to 500 μL extract, briefly vortex sample and place on ice.\nNote: Optionally, an RNase digested control sample is prepared. Therefore, add 100 U RNase ONE to 500 μL of extract (∼ 5 mg protein lysate), briefly vortex and incubate for 2 h at 37°C.",
    "Equilibrate one milligram of oligo[dT]25 Dynabeads in lysis buffer. Add 500 μL lysis buffer to the beads and vortex. Place tubes on the Dyna-Mag-2 magnet for at least 30 s and remove supernatant with a tip. Repeat three times and finally resuspend beads in 500 μL lysis buffer until use.\nRemove lysis buffer from the pre-equilibrated oligo[dT]25 Dynabeads by placing the tubes on the Dyna-Mag-2 magnet. Add 500 μL of the extract and incubate the tubes on a shaker/rotating wheel for 10 min at room temperature.\nNote: We recommend using Eppendorf Protein LoBind microcentrifuge tubes for the poly(A) RIC protocol.\nRetrieve the beads by placing the tubes in a Dyna-Mag-2 Magnet for at least 30 s and carefully remove the supernatant and transfer to a fresh low-bind tube.\nWash beads once with wash buffer A. Add 500 μL of pre-cooled wash buffer A on ice and gentle vortex for 10 s at room temperature.\nWash beads twice with wash buffer B. Add 500 μL of pre-cooled wash buffer B on ice and gentle vortex for 10 s at room temperature.\nNote: Repeated washing is required to remove unspecific binders from RNA, the beads and the tube wall. Wash buffer B also removes traces of Triton X-100, which may interfere with absorbance measurements and compromise elution efficiency (see step 25 below). Ensure complete removal of wash buffer at each step. We also recommend changing the tubes at least once during the procedure (e.g., between washes with buffer B).\nElute poly(A) RNA from beads. Add 60 μL of pre-heated elution buffer to the beads and incubate in a Thermoblock for 2 min at 80°C. Place tubes in a Dyna-Mag-2 Magnet and quickly transfer the eluate to a fresh tube.",
    "Note: Incubation at 80°C denatures the hybrid between poly(A) RNA and oligo[dT]25 beads, thereby releasing the poly(A) RNA into the solution (=eluate). Therefore, the eluate must be collected as quickly as possible to prevent re-association of eluted poly(A) RNA on beads. Elution from beads at 80°C follows the manufacturer’s suggestions. Other bead suppliers may use different temperatures.\nNote: An alternative for the elution is to release proteins via RNase digestion (see Beckmann et al., 2015[href=https://www.wicell.org#bib2]).\nRe-equilibrate the ‘eluted’ oligo[dT]25 Dynabeads in lysis buffer as in step 16.\nRepeat step 17–22 twice by reapplying the supernatant to the oligo[dT]25 beads.\nCombine the three sequential eluates (∼180 μL) and concentrate to ∼70 μL in a 0.5 mL Microcon-10 kD Centrifugal Filter Unit with Ultracel-10 membrane in a microfuge (14,000 × g, ∼30 min, 4°C).\nQuantify eluted poly(A) RNA with a Nanodrop ND-2000 device.\nNote: We usually obtained ∼55 ng/ μL of poly(A) RNA. The 260/280 nm ratio should be at least 1.8:1. Lower ratios and an absorbance peak at 230 nm may relate to residual contamination from Triton X-100 in the eluate (see troubleshooting problem 2[href=https://www.wicell.org#sec6.3]).\nControl step: Successful poly(A) RNA/ mRNA isolation can be assessed with RT-PCR.\nDetection of mRNAs in poly(A) eluates by reverse-transcription (RT) PCR (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1142-Fig2.jpg\nFigure 2. RNA and protein analysis of poly(A) RIC samples\n(A) RT-PCR on total RNA isolated from the extract (input) and RIC-eluates with ACT1 specific primers. Products were resolved on a 2% agarose gel and stained with peqGREEN DNA/RNA dye. Poly(A) designates the addition of excess competitor poly(A). A control reaction without RT was included to monitor potential DNA contamination. M: molecular weight marker.",
    "(B) Silver stained PAA gel. Lanes 1–2 correspond to 0.05% of input extract and poly(A) treated control samples; lanes 3–4, 10% of eluates from poly(A) mRNA isolation. A Marker (M) with molecular weights (MW) in kilodaltons (KDa) is indicated to the left.\n(C) Immunoblot analysis to monitor the indicated proteins in 0.1% of the inputs (lanes 1–2) and 40% of the RIC eluates (lanes 3–4). Pab1, poly(A) binding protein 1; Puf3:TAP, tandem affinity purification-tagged Pumilio family protein; Pgk1, 3-phosphoglycerate kinase (a non-conventional RBP); Act1, actin (non-RNA binding control protein). Poly(A) designates the addition of excess competitor poly(A). MW is indicated to the left.\n500 ng of input total RNA (Step 13.a) or 500 ng of eluted RNA (∼ 9.5 μL) are combined with a mixture of oligo[dT]18 and random hexamer primers for RT with the Transcriptor High Fidelity cDNA Synthesis Kit (Roche) following the manufacturer’s guidelines[href=http://www.protocol-online.org/forums/uploads/monthly_01_2011/post-14721-045604100%201294579818.ipb].\nPCR is conducted with 1 μL of complementary DNA (cDNA) with the following conditions:\ntable:files/protocols_protocol_1142_7.csv\nPCR products are visualized on a 1.5% agarose gel stained with peqGREEN RNA/DNA dye.\nNote: Poly(A) RNAs captured from negative control samples, either through poly(A) competition or RNase digestion should be included in the analysis to ensure that no mRNA is amplified in these samples (Figure 2[href=https://www.wicell.org#fig2]A).\nDetection of RNA-binding proteins: Silver stained gels and immunoblots\nIn this step, proteins bound to poly(A) RNAs are electrophoresed on SDS-polyacrylamide (PAA) gels and stained with silver (Figure 2[href=https://www.wicell.org#fig2]B); and specific proteins are detected by immunoblot analysis (Figure 2[href=https://www.wicell.org#fig2]C).",
    "Note: It is important to analyze proteins in the extract and RIC eluates. A silver stained PAA gel can ensure that the protein composition is different in the total extract, RIC eluates and negative control samples. Immunoblot analysis is used to monitor the presence of RBPs in the RIC eluates and not in the negative controls. These RBPs include the poly(A)-binding protein 1 (Pab1), which is known to be involved in regulating mRNAs fate and stability (Amrani et al., 1997[href=https://www.wicell.org#bib1]; Sachs et al., 1987[href=https://www.wicell.org#bib12]), and the PUmilio-homology domain Family 3 protein (Puf3), known to be abundantly associated with mRNAs to be involved in their localization and decay (Olivas and Parker, 2000[href=https://www.wicell.org#bib10]; Gerber et al., 2004[href=https://www.wicell.org#bib4]). A non-RBP can act as a negative control (e.g., actin1). These tests indicate whether mRBPome isolation has been successful.\nTiming: 2 days\nAnalyze the protein complexity with a silver-stained PAA gel (Figure 2[href=https://www.wicell.org#fig2]B).\nResolve 0.05% of the input (=extract/lysate) and at least 10% of the eluates on a 4–15% Mini-PROTEAN® TGX™ Precast SDS-PAA gel.\nRun the PAA-gel at 120 V for 90 min in the appropriated electrophoresis chamber. Regularly check the progress of the sample migration.\nStain gel with ProteoSilver™ Plus Silver Stain Kit, following the manufacturer’s guidelines[href=https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/156/682/protsil1bul.pdf].\nNote: One lane of the gel should contain a protein ladder as a molecular weight marker (e.g. Precision Plus Protein Dual Color Standards). We recommend loading up to 3 μL of a 1:10 dilution of the protein ladder to avoid an overstaining.\nIdentify specific proteins with immunoblots (Figure 2[href=https://www.wicell.org#fig2]C).\nResolve 0.1% of the input and at least 10% of the eluate on a 4%–15% Mini-PROTEAN® TGX™ Precast SDS-PAA Protein Gels.\nRun the gel for 90 min at 120 V.\nCut a gel-sized polyvinylidene difluoride (PVDF) membrane and activate it with 100% methanol for 2 min.",
    "Soak the gel, filter papers, and PVDF membranes in the appropriate transfer buffer for 2 min at room temperature.\nTransfer proteins from the PAA gel to PVDF membranes with a Trans-Blot® Turbo™ Transfer System (or equivalent).\nNote: Voltage and length of transfer may vary depending on the molecular weight of the protein of interest. Proteins with high molecular weight (>200 kDa) need longer transfer time.\nNote: We recommend checking for transfer of proteins by staining the membrane with Ponceau-S solution according to manufacturer’s instructions[href=https://isg.ku.edu.tr/sites/isg.ku.edu.tr/files/laboratuvar/scib20/Msds/PONCEAUStainingSOLUTION.pdf]. We also recommend loading a pre-stained protein marker (e.g. Precision Plus Protein Dual Color Standards).\nBlock membrane in 1× PBS-0.1% Tween-20 (PTST) containing 5% low fat milk for 1 h at room temperature.\nProbe membrane with respective primary antibodies (e.g., anti-Pab1 (1:5,000), anti-Pgk1 (1:5,000), anti-actin (1:2,500), PAP reagent (1:5,000)) diluted in PTST containing 2% low fat milk, for 1 h at room temperature with constant shaking.\nWash the membrane 3 times in PBST for 10 min each at room temperature with constant shaking.\nAdd the corresponding horseradish peroxidase (HRP)-coupled secondary antibodies (1:5,000) diluted in PTST containing 2% low fat milk for 1 h at room temperature with constant shaking.\nWash the membrane 3 times in PBST for 10 min each at room temperature with constant shaking.\nDevelop membrane with the Immobilon Western Chemiluminescent HRP Substrate, following the manufacturer’s guidelines[href=https://www.sigmaaldrich.com/GB/en/product/mm/wbkls].\nTake a picture of the chemiluminescent signals with standard gel imaging system.\nNote: Immunoblotting has been described in detail (Litovchick, 2020[href=https://www.wicell.org#bib6]; Burckhardt et al., 2021[href=https://www.wicell.org#bib3]). Of note, proteins (i.e. Pab1) may shift in the gel to a higher molecular weight due to crosslinks to RNA.\nNote: Use of fluorescently labeled antibodies and detection with a fluorescence scanner may be considered to obtain a more quantitative read-out."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Protein Biochemistry",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}