{
  "id": 4148,
  "origin_website": "Cell",
  "title": "Protocol to study starvation-induced autophagy in developing rat neurons",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFunction blocking proteins / nanobodies transfection (optional)\nTiming: [2 h]\nFull gene KO might cause cells to develop compensatory changes, as shown from experiments comparing full gene KO with knock-down (Rossi et al., 2015[href=https://www.wicell.org#bib12]). The acute over-expression of a function-blocking protein or synthetic antibody overcomes the potential compensatory changes that cells may develop over long periods of time. As an example of the efficacy of this approach here we present a protocol describing the over-expression of the VAMP7 Longin domain. This domain of the protein was shown to have an auto inhibitory function (Martinez-Arca et al., 2003[href=https://www.wicell.org#bib10]) and when over-expressed it prevents neurite growth (Martinez-Arca et al., 2000[href=https://www.wicell.org#bib8], 2001[href=https://www.wicell.org#bib9]) and inhibits VAMP7-dependent secretion (Gupton and Gertler, 2010[href=https://www.wicell.org#bib4]). We further used a synthetic single chain variable fragment (ScFv) nanobody directed against VAMP7 (F1.1) (Wojnacki et al., 2020[href=https://www.wicell.org#bib16]). Indeed, nanobodies directed against specific proteins are another powerful tool to inhibit a protein’s function acutely (Moutel et al., 2016[href=https://www.wicell.org#bib11]). Here we present a protocol based on a nanobody- or a function-blocking protein-transfection approach to inhibit VAMP7’s function in developing neurons.\nNote: Generation and characterization of a fully-functional nanobody is complex and time-consuming. We recommend to call on some companies able to provide VHH screens by phage-display or yeast two hybrid screens.\nCritical: Not all nanobodies are function-blocking. Some nanobodies may specifically recognize their target protein without blocking its function. This needs to be specifically assayed beforehand.\nMix 1 μg of plasmid DNA, encoding either a nanobody or a function-blocking expression protein, with 100 μL of MEM.\nMix 2.5 μL of Lipofectamine 2000 reagent with 100 μL of MEM.\nMix the 100 μL of DNA/MEM and 100 μL of Lipofectamine 2000/MEM and leave at 18°C–25°C for 20 min.",
    "Add the 200 μL solution to a ø35 mm petri dish with coverslips containing 2 days in vitro (DIV) hippocampal neurons and leave for 90 min in the CO2 incubator.\nChange culture media with starvation media (next step).\nAlternatives: The transfection could be performed as soon as neurons are plated following an identical protocol. Then the starvation could be started at 2DIV when neurons are already expressing the proteins of interest. This should be avoided if the proteins of interest are known to affect neuronal polarization. Another alternative is to transfect neurons at 2DIV in vitro as here described but changing to starvation media at 3DIV.\nCritical: Neuron transfection is in general a low-efficiency procedure. Usually between 3% and 5% of neurons are transfected. Highly pure plasmid increases the percentage of transfected neurons and diminishes the toxic effects of the procedure.\nPrimary neuron starvation\nTiming: [1 h–2 days]\nPrimary neurons are remarkably sensitive to culture conditions, including the culture media composition. Several culture media have been established and most of them are formulated to support long-term neuronal development. Starvation conditions imply the lack of one or more of the components that would be required for normal, long-term development of neurons in culture.\nHere we describe a procedure and culture media that induces autophagy in cultured neurons without inducing apoptosis or death whilst still allowing axonal extension for at least 24 h.\nPre-equilibrate the starvation media in the CO2 incubator for a couple of hours.\nRemove the N2 media with a vacuum pump and replace with the starvation media (Table 3[href=https://www.wicell.org#tbl3])\nIncubate in CO2 incubator for 24–48 h.\nOptional: Starvation media can also be applied to cortical neurons culture in an identical way to test autophagy induction by Western Blot.\nFixation and immunostaining\nTiming: [4–6 h]",
    "The most common way to describe morphological changes in neuronal cultures is to stain components of the cytoskeleton. These components allow to discriminate axons from minor processes or dendrites and at the same time allow for clear measurement of axonal length, ramifications and the number of axons present in each neuron.\nFixation.\nRemove and discard the starvation media.\nAdd pre-warmed (37°C) paraformaldehyde 4% in PBS to completely cover the coverslips.\nLeave for 20 min at 18°C–25°C.\nRemove the paraformaldehyde solution and replace with PBS\nNote: Dispose the PFA solution according to environmental / safety regulations.\nWash twice, 4 min each, with PBS.\nNote: Steps 9 b, c and d should be performed under a chemical hood.\nImmuno-staining.\nQuench 20 min at 18°C–25°C with 50 mM NH4Cl in PBS.\nWash twice, 4 min each, with PBS.\nPermeabilize 6 min with 0.1% Triton X-100 in PBS.\nWash twice, 4 min each, with PBS.\nTransfer coverslips onto a parafilm sheet in a humid chamber (cells upward).\nBlock for 30–60 min at 18°C–25°C with 1% BSA in PBS-0.01% Tween-20 (PBST).\nIncubate with the primary antibody for 90 min at 18°C–25°C diluted in 1% BSA/PBST.\nNote: This incubation protocol works well for the antibodies here described (Table 5[href=https://www.wicell.org#tbl5]) but adjustments may be necessary if different antibodies are used. Incubation of primary antibodies for 10–18 h at 4°C is a common alternative and in some cases it may increase specificity and reduce noise. Other blocking reagents may also be tried such as secondary antibody same-species serum or gelatin.\nWash three times, 4 min each, with PBS.\ntable:files/protocols_protocol_911_5.csv\nIncubate with the secondary antibody for 60 min at 18°C–25°C diluted in 1% BSA/PBS.\nWash three times, 4 min each, with PBS.\nRinse once in ddH2O.",
    "Lay out a drop of ProlongGold (5–9 μL) in a microscopic slide. Place the coverslips on top of the ProlongGold, neurons facing down.\nNote: Other mounting medium may be used if preferred. We have tried Mowiol mounting medium with similar results. Yet in our hands ProlongGold has a subjectively superior quality for maintaining fluorescence intensity.\nLet ProlonGold dry over-night.\nNote: DAPI staining is not directly used in our protocol for the quantification process itself but it could be useful to discriminate two adjacent neurons. DNA/nucleus staining is a very simple method to assess the number of cells present in the field. We routinely add DAPI (0.5 μg/mL) along with the secondary antibodies incubation. One common alternative is to use mounting medium with DAPI incorporated.\nCritical: Paraformaldehyde is a highly toxic and volatile chemical. Preparation and usage of it should be performed by experienced personnel, always under a chemical hood and using personal protective equipment. Disposal of this chemical follows safety regulations.\nOptional: Other molecular markers can be used to detect different neuronal regions. Common options to specifically detect the axon include Tiam1 (Kunda et al., 2001[href=https://www.wicell.org#bib6]), MAP1B (Gonzalez-Billault et al., 2001[href=https://www.wicell.org#bib3]) and Cdc42 (Chuang et al., 2005[href=https://www.wicell.org#bib2]).\nPause point: After the ProlongGold mounting media has dried, coverslips can be stored in the dark and between 4°C - 10°C for at least 10 days before imaging.\nDetermination of autophagy induction in cortical primary neurons (optional)\nTiming: [2 days]",
    "Detection of the cleaved and lipidated LC3B-II by western blot is one of the most common procedures to detect autophagy activation in several cell types. In our hands however, electrophoretic detection of LC3B-II was technically challenging in primary neurons, probably because of high autophagic flux in neurons as already noted (Ariosa and Klionsky, 2016[href=https://www.wicell.org#bib1]). We have thus relied on the detection of signaling intermediaries of the autophagy pathway: phospho ULK1 (pULK1) by western blot.\nAfter starvation lyse neurons with 500 μL of lysis buffer composed of Tris 50 mM; NaCl 150 mM; Triton X-100 1%; 3 mM EDTA and 1× complete protease inhibitor cocktail.\nCentrifuge samples at 12,000 g at 4°C for 20 min.\nRecover the supernatant and quantify protein concentration.\nDilute 5 times the Bio-Rad Bradford reagent with ddH2O and dispense 1 mL in as many spectrophotometer cuvettes as samples to be measured and 8 more for the reference curve.\nPrepare a reference protein concentration curve with bovine serum albumin (BSA). We usually prepare a curve with 0, 0.5, 1, 2, 4, 8, 16 and 20 μg/μL of BSA.\nDilute 2 μL of the sample in one cuvette and mix thoroughly.\nMeasure the optic density and 595 nm.\nMake a regression curve with the reference values and then determine the sample’s protein concentration.\nNote: With this preparation we usually obtain ∼100 μl of cell lysates of 1 μg/μl to 1.5 μg/μl of protein content.\nAdd Laemmli loading buffer to the samples and boil at 95°C for 5 min.\nLoad 20–30 μg of total protein extract into a 12% SDS-PAGE gels and run at 80 V for 30 min and then 110 V for another 90 min approximately until the front of migration reaches the lower edge of the gel.",
    "Transfer proteins to a 0.2 μm nitrocellulose membrane at 400 mA for 2–3 h.\nCritical: Protein transfer produces large amounts of heat. The transfer chamber should be loaded with chilled transfer buffer and kept in a cold room or in a bucket of ice to prevent over-heating.\nBlock membranes with a solution of 2.5% non-fat dry milk in a Tris-based saline solution containing 0.1% Tween-20 (TBST) for 30–60 min at 18°C–25°C.\nIncubate primary antibodies (Table 6[href=https://www.wicell.org#tbl6]) at 4°C for 10–18 h in TBST supplemented with 2.5% non-fat dry milk solution.\ntable:files/protocols_protocol_911_6.csv\nIncubate with secondary antibodies and develop the signal by ECL or fluorescence detection depending on the choice of secondary antibodies.\nNote: Anti ULK1 and pULK1 antibodies are both raised in the same species therefore we run 2 gels in order to incubate these antibodies in different membranes."
  ],
  "subjectAreas": [
    "Antibody",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}