{
  "id": 14065,
  "origin_website": "Jove",
  "title": "The 5-Choice Serial Reaction Time Task: A Task of Attention and Impulse Control for Rodents",
  "procedures": [
    "This procedure requires the use of animals; these procedures were approved by the Oberlin College Institutional Animal Care and Use committee and are in accordance with the Guide for the Care and Use of Laboratory Animals46.\n1. 5CSRTT Apparatus\nA schematic of the 5CSRTT apparatus is provided in Figure 1.\n\t\nThe 5CSRTT apparatus consists of an operant conditioning chamber (30.5 x 24.1 x 29.2 cm) with 2 Plexiglas sidewalls, and a stainless steel grid floor.\nThe aluminum front wall is rounded and contains five nose poke apertures (2.5 x 2.2 x 2.2 cm each); each aperture is equipped with a light emitting diode (LED) and an infrared sensor capable of detecting the insertion of the rats’ nose.\nThe aluminum back wall contains the food magazine; this is connected to a pellet dispenser and is equipped with an infrared sensor and a small incandescent light.\nAn incandescent house light, capable of illuminating the entire chamber is affixed near the top of the back wall.\nHouse the 5CSRTT apparatus within a ventilated, sound attenuated operant conditioning chamber.\nUse a PC computer to control the operant chamber and to collect data.\n2. Animal Housing and Preparation\nThe procedure requires use of experimental animals; obtain approval from the Institutional Animal Care and Use Committee (IACUC) prior to commencing any experiments.\nHouse rats in pairs.\n\t\nMaintain rats on a 14:10 light/dark cycle (lights on at 7:00 am) in a room with a constant temperature of 22 ± 1 °C.\nAllow rats free access to water while in their home cages, but food restrict them.",
    "Food restrict rats to 85-90% of their free feeding weight two to five days prior to the start of magazine training and throughout 5CSRTT training and testing. Feed rats after daily training sessions and weigh them daily to ensure that they are gaining weight (~5 g/week).\n3. 5CSRTT Procedure\nGeneral 5CSRTT Training Considerations\n\t\nTrain rats at a standard time of day a minimum of 5 days per week; training occurs over many stages (see Table 1) and takes several weeks.\nTrain and test rats in the same operant chamber (see sections 3.2-3.5 below); small deviations in the rats’ environment can affect their performance.\nAt the end of each session clean all surfaces of the chamber with water containing the disinfectant sodium hypochlorite (or another disinfectant after consultation with your veterinarian).\nMagazine Training\n\t\nIntroduce sugar pellets (45 mg) to rats in their home cage prior to the first session. This minimizes neophobia and ensures rats will retrieve sugar pellets from the food magazine.\nPlace rats in operant chamber (fans on) with aperture holes occluded. Allow rats to habituate to chamber for 5 min.\nDeliver sixty sugar pellets to magazine on either a fixed interval 20 sec (FI-20, day 1) schedule or a FI-30 schedule (day 2).\n\t\tNote: The houselight can remain illuminated for the duration of the session and the magazine light should be illuminated upon pellet delivery and can remain illuminated until the pellet is retrieved.\nAt the end of the session note whether sugar pellets are consumed; continue training for at least 2 days or until all of the pellets are consumed.\n5CSRTT Training\n\t\nFigure 2 provides a schematic of a single 5CSRTT trial.\nPlace each rat in an operant chamber with fans on. Allow rats to habituate to chamber for 5 min.",
    "At the end of the habituation period, illuminate the magazine light and deliver one sugar pellet. The first trial begins when this pellet is retrieved.\nBegin each trial with an inter trial interval (ITI) during which only the house light is illuminated. At the end of the ITI, pseudo randomly illuminate one of the aperture lights for the prescribed stimulus duration. Allow the rat time to respond to the stimulus presentation; the time the rat is allowed to respond is the limited hold (LH).\nNose poke responses into the illuminated aperture result in the delivery of a sugar pellet to the magazine and illumination of the magazine light; such responses are considered correct responses. Extinguish the magazine light and initiate the next trial upon pellet retrieval.\nNose poke responses into unlit apertures (incorrect responses) and failures to respond during the LH (omissions) result in a time out (TO). Extinguish the houselight during the TO. Signal the beginning of the next trial at the end of the TO by illuminating the houselight.\nScore nose poke responses during the ITI as premature responses; punish these responses with a TO period. Reinitiate the same trial after a TO caused by a premature response.\nEnd each session after 90 trials or 30 min, whichever comes first.\nFor the first stage of training set the stimulus duration to 30 sec, the LH to 30 sec, the ITI to 2 sec and the TO to 2 sec. Adjust these parameters across training such that the stimulus duration is 1 sec and the LH, ITI and TO are all 5 sec (see Table 1). Move rats to the next training stage once they have reached the suggested training criteria. Test rats after they exhibit stable performance on the final stage.",
    "Note: Sprague-Dawley rats typically reach criterion performance (~65 % accuracy, < 20% omissions) within 4-8 weeks if trained 5 days per week. Different strains of rats however, have different abilities to perform the task. For example, Lister Hooded rats can attain high levels of accuracy (> 80%) with fewer omissions (< 20%) using a short stimulus duration (0.5 sec) (e.g., Bari et al., 2008; Mizra and Bright, 2001). It is recommended that researchers adjust stimulus parameters and criterion performance to reflect strain of rat (or mouse) used.\n5CSRTT Testing\n\t\nCalculate baseline performance (% accuracy, % omissions, premature responses) by averaging performance on each measure across the last 3-5 sessions (see below). Use these data to divide rats into groups (if required) or as an individual rats’ baseline.\nUse test day challenges (Table 2) to further probe behavior.\nFor within subjects designs, intersperse training sessions with test day challenge sessions.\n\t\tNote: Test day challenges can be used to complement examination of behavior on the standard task. These manipulations can reveal subtle changes in behavior that are not apparent after extensive training on the standard task and/or be used to gain a better understanding of the nature of a performance deficit.\n5CSRTT Performance Measures\n\t\nUse a computer to calculate performance measures.\nAccuracy of responding (% accuracy): Divide the number of correct responses by the total of correct and incorrect responses. This is the primary measure of attention.\n\t\t[# correct responses/(# correct responses+ # incorrect response)] x 100\nOmissions: Divide the number of trials in which the rat did not respond by the total number of trials completed. % Omissions can reflect attention, but can also be influenced by sedation, motivation and motor ability, thus the interpretation of omissions depends on other performance measures.",
    "[# omissions/(# omissions + # correct responses + # incorrect responses)] x 100\nCorrect Responses: Divide the number of correct responses by the total number of trials completed.\n\t\t[# correct responses /(# omissions + # correct responses + # incorrect responses)] x 100\nIncorrect Responses: Divide the number of incorrect responses by the total number of trials completed.\n\t\t[# incorrect responses /(# omissions + # correct responses + # incorrect responses)] x 100\nPremature Responses: Determine the number of responses made during the ITI. This is the primary measure of impulsive behavior.\nPerseverative Responses: Determine the number of nose poke responses into any aperture after the rat has made a correct response but before retrieval of the sugar pellet. This is a measure of compulsive behavior.\nMagazine Entries: Determine the number of nose poke responses into the magazine. This is a measure of motivation.\nLatency to Correct Response: Calculate the average time from the onset of the stimulus to a correct response; a measure of processing speed or decision-making.\nLatency to Incorrect Response: Calculate the average time from the onset of the stimulus to an incorrect response; a measure of processing speed or decision-making.\nReward Retrieval Latency: Calculate the average time for a rat to retrieve the sugar pellet reward; can reflect motivation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}