{
  "id": 14076,
  "origin_website": "Jove",
  "title": "Transcranial Magnetic Stimulation for Investigating Causal Brain-behavioral Relationships and their Time Course",
  "procedures": [
    "This protocol was approved by the UCL Ethics Review Board (#249/001) for non-invasive brain stimulation of neurologically normal human volunteers.\n1. Create the TMS protocol\nAlmost all TMS experiments in cognitive neuroscience use bi-phasic stimulation in conjunction with a figure-of-eight shaped coil. This provides the ability to deliver rapid trains of pulses (> 1 Hz) and target a cortical site as precisely as possible. It is possible to use mono-phasic stimulation35 or a different coil shape36, but here the standard configuration was applied.\nChoose a frequency and duration of stimulation.\n\tNOTE: A common choice in cognitive neuroscience is to use 10 Hz stimulation for 500 msec from onset of the stimulus37-40.\nChoose a level of intensity based on extensive pilot testing. Hold it constant across participants.\n\tNOTE: For the equipment used here, commonly used intensities range between 50 - 70% of the maximum stimulator output11,41-44.\nChoose an inter-trial interval. For both practical and safety reasons, separate the stimulation trials by a minimum of 3 - 5 sec27,45.\n2. Perform Head Registration\nAcquire a high-resolution, T1-weighted anatomical magnetic resonance imaging (MRI) scan for each participant on a separate session prior to the TMS. Include the fiducial points in the image that will be used in step 2.3. \nLoad the scan into the frameless stereotaxy system before the TMS session to enable accurate targeting of stimulation sites in each participant. Mark the stimulation sites on the head at the beginning of the experiment or monitor continually throughout the experiment.\nMark four fiducial points on the participant’s image. Typically these include the tip of the nose, the bridge of the nose, and the notch above the tragus of each ear.\nProvide the participant information about TMS in order for them to give informed consent to participate in the experiment.",
    "Ask the participant to complete a TMS Safety Screen form that has been approved by the Institutional Review Board. \n\tNOTE: Permanent contradictions to TMS include a personal or family history of epilepsy, a clinical history of neurological or psychiatric problems, or implanted medical devices such as a cardiac pacemaker or cochlear implants. Not following TMS safety requirements can potentially induce syncope and seizure.\nPlace the subject tracker on the participant’s head; it will act as a reference when measuring fiducial points. Touch each fiducial point on the subject’s head with a pointer that comes with the stereotaxy system and save the corresponding co-ordinates on the computer. Calibrate subject’s head with the MRI image. Check the quality of registration and repeat the process if necessary.\nAsk the participant to wear earplugs during stimulation to attenuate the sound of the coil discharge and avoid damage to participants’ hearing46.\nSet up the TMS machine according to the choices made in Section 1. \nIntroduce the participant to stimulation before testing to ensure that the participant is familiarized with its sensation and tolerates well. First demonstrate stimulation on the researcher’s arm and then on the participant’s arm to acclimate the person with the sensation.\n\tNOTE: This is especially important for participants who are experiencing TMS for the first time.\nDemonstrate the stimulation protocol on each of the testing sites as the sensation may be different at different locations. Place the coil on the first site as identified by the frameless stereotaxy system such that the coil is tangential to the scalp and the line of maximum magnetic flux intersects the stimulated site. \n\tNOTE: Stimulation sometimes affects facial nerves or muscles and may lead to discomfort so it is important to test whether the participant tolerates it well.\n3. Perform Functional Localization",
    "Optimize the stimulation site by customizing it to each participant. Mark several potential stimulation sites within the brain region of interest on the participant’s structural image. Locate targets at least 10mm from each other given the spatial resolution of TMS47 using a grid or anatomical marking (Figure 1).\nChoose a localizer task that taps into the cognitive function of interest and has a measurable behavior (e.g., reaction times, accuracy, eye-movements). Repeat the task multiple times when testing the possible sites and create different versions of the task to avoid constant repetition of the stimuli.\nAllow the participant to practice the task without stimulation until they are comfortable with it. Then introduce a second practice session with TMS randomly (or pseudo-randomly) presented on 50% of the trials so that the participant gets used to performing the task without being distracted by stimulation.\nChoose a testing site and run one version of the localizer task. Immediately afterwards check the results to see whether stimulation affected performance. \n\tNOTE: In many cases, stimulating an “incorrect” site will actually facilitate responses relative to no stimulation due to inter-sensory facilitation2, in this case due to hearing the clicks and feeling the sensation of stimulation in the scalp. In addition, large effects of stimulation (i.e., over 100 msec) are often artifactual and require re-testing. If they replicate and are specific to a particularly testing site, then they may be genuine effects. Be sure to choose a robust measure of a TMS effect to be confident in localization.",
    "If no effect is observed, choose a new testing site and repeat, otherwise test the same site again to determine whether it replicates. Test multiple sites back-to-back in the same session to ensure that they do not all produce an effect as this would indicate a non-specific TMS effect. Counterbalance the order that sites are stimulated across participants.\n4. Main Task\nAfter localization and in the same session, run the main experiment using the target site that was functionally localized.\n\tNOTE: This will involve a different task to the one used in localization but one that shares the key process of interest. For example, a rhyme judgment task can be used for localizing an area sensitive to processing the sounds of words while a homophone judgment task might be used for the main experiment. In this example, both tasks require phonological processing of written words although the specific task demands and stimuli differ.\nInclude sufficient control conditions to rule out non-specific effects of TMS.\nTest the same site on a control task that does not include the process of interest to demonstrate functional specificity in processing.\nTest a different site on the main task to demonstrate anatomical specificity of the effect.\nInclude additional control conditions such as sham TMS, control stimuli, or multiple time windows.\nConduct a traditional “virtual lesion” experiment using the same TMS parameters used during localization (e.g., intensity, frequency, and duration of stimulation). For chronometric TMS experiment, use the same intensity but replace the train of pulses used during localization by either a single48 or double pulse49 delivered at different onset latencies."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}