{
  "id": 15236,
  "origin_website": "Jove",
  "title": "Rare Event Detection Using Error-corrected DNA and RNA Sequencing",
  "procedures": [
    "1. Targeted Error-corrected Sequencing for DNA\nPCR amplification of genomic fragments of interest.\nUse a high-fidelity DNA polymerase to amplify the amplicons (Materials Table, Item 1). Amplify the PCR reaction with the following conditions in a thermal cycler: 30 s at 98 °C; 18–40 cycles of 10 s at 98 °C, 30 s at 66 °C, and 30 s at 72 °C; 2 min at 72 °C; hold at 4 °C.\nPurify the PCR products with paramagnetic beads (Materials Table, Item 2). Add the PCR reaction to the beads in a 1: 1.8 ratio (PCR reaction volume: bead volume) according to the manufacturer’s protocol. Elute with 20 µL of ddH2O.\nQuantify concentration of DNA (Materials Table, Item 3) to determine final concentration of DNA.\nRun an aliquot of DNA on a 2% agarose gel (Materials Table, Item 4) to confirm the size of the amplicons.\n\t\tNOTE: Alternatively, researchers can opt to perform a Bioanalyzer analysis on the PCR products to determine the size of amplified genomic fragments as well as the concentration of the products.\nSequencing adapter annealing\nObtain i7 adapters (Materials Table, Item 5). Use them as they are provided for subsequent steps.\nPurchase 16N i5 adapters commercially with the following oligo sequence (Materials Table Item 6): AATGATACGGCGACCACCGAGATCTACAC(N1:25252525)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)(N1)ACACTCTTTCCCTACACGACGCTCTTCCGATCT\n\t\tNOTE: The 16N i5 adapters replace the standard i5 adapters and they are adapters with a string of 16 random-nucleotide to facilitate ECS.\nMake 16N i5 adapter working solution: 40 µL of 100 µM 16N i5 adapter stock, 10 µL of TE buffer, and 10 µL of 500 µM NaCl solution.\nAliquot 7.5 µL of the i5 working solution prepared in Step 1.2.3 into separate PCR wells.\nAdd 5 µL of sample-specific i7 adapter into corresponding wells.",
    "Incubate at 95 °C for 5 min then cool by 1 °C every 30 s to 4 °C in a thermal cycler.\nHold at 4 °C.\nEnd-repair & dA-tailing of libraries\n\tNOTE: In parallel with adapter annealing, one can perform end repair and dA-tailing on the PCR amplicons from Step 1.1. Following completion of these steps, ligation of annealed adapters from Step 1.2 onto the end repaired and dA-tailed PCR amplicons is performed. Following adapter ligation, the ECS library construction is complete.\n\t\nBegin with at most 1 µg of starting DNA (minimum ~200 ng)\nPerform end-repair and dA-tail on amplicons (Materials Table, Item 7).\n\t\t\nAdd 3.0 µL of End Prep Enzyme Mix and 6.5 µL of End Repair Buffer.\nIncubate the mix for 30 min at 20 °C, then for 30 min at 65 °C and hold at 4 °C.\nPerform ligation on the annealed adapters (Materials Table, Item 8).\n\t\t\nAdd 2.5 µL of the annealed adapters from Step 2, 15 µL of Blunt/TA Ligase Mastermix, and 1 µL of Ligation enhancer.\nIncubate the mix for 15 min at 20 °C, then for 15 min at 37 °C.\nClean up libraries with magnetic beads (Materials Table Item 2): Add the PCR reaction to beads in a modified 1: 0.75 ratio (PCR reaction volume: magnetic bead volume):\n\t\t\nPipette 62.6 µL of magnetic bead solution into the 83.5 µL of PCR products from Step 1.2.7.\nTransfer the mixture to a 1.5 mL low binding tube.\nMix thoroughly by pipetting up and down at least 10 times.\nLeave the mixture to stand at room temperature for 5 minutes.\nPlace the tube onto a magnetic holder. Incubate for 2 minutes at room temperature or until supernatant is clear.\nRemove supernatant.\nWash the beads with 200 µL of 70% ethanol.",
    "Incubate for 30 s. Remove ethanol.\nRepeat ethanol wash step once.\nAir-dry the beads.\nElute with 20 µL of ddH2O.\n\t\t\tNOTE: This modification in PCR reaction to magnetic bead ratio will preferentially remove DNA fragments that are smaller than 200 bp.\nQuantification by droplet digital PCR\n\tNOTE: Precise mutation quantification requires strict observance of the number of molecules of each library that are loaded onto the sequencer. To achieve this, quantifying the number of molecules for individual libraries per unit volume is performed using the QX200 droplet digital PCR (ddPCR) platform — quantitative PCR is an alternative option. Following ddPCR analysis, the readout will specify the number of molecules per µL per library.\n\t\nDilute ECS libraries 1:1,000 by incrementally diluting by a factor of 10 in PCR strip-tubes.\nPrepare the following mastermix for ddPCR in 1.5 mL tube: 10 µL of PCR Mix (Materials Table, Item 9), 0.2 µL of P5 Primer, 0.2 µL of P7 Primer, 5 µL of ECS cleaned-up product from Step 1.4.1., and 4.5 µL of ddH2O.\nAliquot 20 µL of the mastermix into each sample well making sure there are multiples of 8.\n\t\t\nAliquot 70 µL of droplet generation oil (Materials Table, Item 10) into each oil well. Cover the cassette with a rubber gasket.\nMake droplets using the droplet generator (Materials Table, Item 11).\nUsing a multichannel pipette, load the droplets generated in Step 1.4.4 into a PCR plate ensuring that the pipetting of the sample is done slowly over a span of 5 seconds to avoid shearing the DNA.",
    "Amplify the signal in the droplets for 40 cycles in a thermal cycler using the following conditions: 5 min at 95 °C; 40 cycles of 30 s at 95 °C, 1 min at 63 °C; 5 min at 4 °C, 5 min at 90 °C; and then hold at 4 °C.\nPrepare ddPCR template droplet reader machine (Materials Table, Item 11). Ensure specification for parameters for Absolute Quantification and using the QX200 ddPCR Eva Green Supermix.\nOnce ddPCR analysis is complete, make sure to set the same divisive threshold across all samples.\nUsing the concentration readout from the QX200 Droplet Reader, aliquot the appropriate volume to introduce the desired number of molecules into subsequent step.\nPCR amplification of the libraries for sequencing\nPrepare the following mastermix for the desired number of molecules from Step 1.4.9: 25 µL of Q5 Mastermix (Materials Table, Item 1), 2.5 µL of P5 Primer (10 µM), 2.5 µL of P7 Primer (10 µM), X µL of DNA, 20-X µL of ddH2O.\nAmplify the libraries from Step 1.5.1 in a thermal cycler using the following conditions: 30 s at 98 °C; 20 cycles of 10 s at 98 °C, 30 s at 63 °C, 30 s at 72 °C; 2 min at 72 °C; and then hold at 4 °C.\nClean up libraries with magnetic beads (Materials Table, Item 2): Add the PCR reaction to magnetic beads in a modified 1: 0.75 ratio (PCR reaction volume: magnetic bead volume).\nPipette 37.5 µL of magnetic bead solution into the 50 µL PCR products from Step 1.5.2.\nTransfer the mixture to a 1.5 mL low binding tube.\nMix thoroughly by pipetting up and down at least 10 times.\nLeave the mixture to stand at room temperature for 5 min.",
    "Place the tube onto a magnetic holder. Incubate for 2 minutes at room temperature or until supernatant is clear.\nRemove supernatant.\nWash the beads with 200 µL of 70% ethanol.\nIncubate for 30 s. Remove ethanol.\nRepeat ethanol wash step once.\nAir-dry the beads.\nElute with 20 µL of ddH2O.\nRun an aliquot of DNA on a 2% agarose gel to confirm the size of the amplicons.\nQuantify concentration of DNA (Materials Table, Item 3) to determine concentration of the separate ECS libraries.\nPool the libraries in equimolar amounts.\n\t\tNOTE: For example, researchers can pool eight libraries in an equimolar group4 with 4 million starting molecules for sequencing using a sequencing platform which outputs up to 400 million reads. Conservatively, it is recommended to use an average of ten raw reads for error-correction per molecules. This would take up 360 million reads (4 million molecules * 8 libraries * 10 reads for error correction). With 4 million unique molecules per library, researchers can expect to get a theoretical mean consensus read coverage of 7042x per amplicon (4 million/568 amplicons from the gene panel).\nQuantify concentration of DNA (Materials Table, Item 3) to determine concentration of pooled ECS library.\nSubmit the pooled ECS library at roughly 4 nM.\nProvide the following sequencing settings to Illumina sequencing platforms (MiSeq, HiSeq or NextSeq): 2x144 paired-end reads, 8 cycles Index 1 and 16 cycles Index 2.\n2. Gene Panels with Error-corrected Sequencing of DNA\nHybridization of oligos from gene panels\n\tNOTE: In this step, one will construct sequencing libraries using a modified Illumina TruSight or TruSeq protocol to incorporate the UMIs (Materials Table, Item 17).\n\t\nHybridize oligos onto genomic fragment following manufacturer’s protocol. Use 250 ng of DNA (or any desired amount of starting material).\nRemove unbound oligos following manufacturer’s protocol.",
    "Perform extension-ligation following manufacturer’s protocol.\n\t\tNOTE: Modifications to the manufacturer’s protocol begin below.\nIncorporation of i5 and i7 Adapters via PCR\nPrepare the PCR mastermix by pipetting the following reagents into a tube of appropriate volume size: 37.5 µL of Q5 Mastermix (Materials Table, Item 1), 6 µL of 10 µM 16N i5 adapters (detailed in Method 1, Step 1.2.2), 6 µL of i7 adapters (Use different i7 adapters for separate samples for multiplexing), and 22 µL of extension-ligation solution with beads from Step 2.1.3.\n\t\tNOTE: The Q5 Mastermix replaces the polymerase mastermix provided by Illumina. The Q5 polymerase amplifies the genomic fragment with higher fidelity and fewer introduced errors.\nRun PCR program on a thermal cycler using the following parameters: 30 s at 98 °C, 4–6 cycles of 10 s at 98 °C, 30 s at 66 °C, 30 s at 72 °C; 2 min at 72 °C, and then hold at 4 °C.\n\t\tNOTE: The number of cycles depends on the panel size. From our experience, a 4-cycle PCR is sufficient if the gene panel has about 1,500 different pairs of gene specific oligos, whereas a panel with 500–600 pairs of oligos requires 6 cycles of PCR.\nClean up PCR reactions with magnetic beads (Materials Table, Item 2): Add the PCR reaction to magnetic beads in a modified 1 PCR reaction: 0.75 magnetic bead ratio:\nPipette 56.25 µL of magnetic bead solution into the 75 µL of PCR products from Step 2.2.2.\nTransfer the mixture to a 1.5 mL low binding tube.\nMix thoroughly by pipetting up and down at least 10 times.\nLeave the mixture to stand at room temperature for 5 min.\nPlace the tube onto a magnetic holder. Incubate for 2 min at room temperature or until supernatant is clear.\nRemove supernatant.",
    "Wash the beads with 200 µL of 70% ethanol.\nIncubate for 30 s. Remove ethanol.\nRepeat ethanol wash step once.\nAir-dry the beads.\nElute with 20 µL of ddH2O.\nQuantify libraries using QX200 ddPCR platform. \nFollow Step 1.4 in Method 1.\n\t\tNOTE: 4 million molecules were normalized per sample library4 in the representative result (Figure 2) in order to obtain a theoretical mean of 7,042 uniquely indexed molecules (4 million divided by 568 gene-specific oligos).\nAmplify and normalize libraries for sequencing.\nAmplify the desired number of molecules using the following mastermix for the final PCR totaling 50 µL: 25 µL of Q5 Mastermix, 2 µL of P5 Primer (1 µM), 2 µL of P7 Primer (1 µM), and 21 µL of DNA molecules.\nRun PCR program on a thermal cycler using the following parameter: 30 s at 98 °C; 16 cycles of 10 s at 98 °C, 30 s at 66 °C, 30 s at 72 °C; 2 min at 72 °C; and then hold at 4 °C.\nClean up sequencing libraries using magnetic beads (Materials Table, Item 2): Add the PCR reaction to magnetic beads in a modified 1 PCR reaction: 0.75 magnetic bead ratio:\n\t\t\nPipette 37.5 µL of magnetic bead solution into the 50 µL PCR products from Step 2.4.2.\nTransfer the mixture to a 1.5 mL low binding tube.\nMix thoroughly by pipetting up and down at least 10 times.\nLeave the mixture to stand at room temperature for 5 min.\nPlace the tube onto a magnetic holder. Incubate for 2 min at room temperature or until supernatant is clear.\nRemove supernatant.\nWash the beads with 200 µL of 70% ethanol.\nIncubate for 30 s. Remove ethanol.\nRepeat ethanol wash step once.\nAir-dry the beads.\nElute with 20 µL of ddH2O.",
    "Run an aliquot of eluted DNA (~3 µL) on a 2% agarose gel to confirm the size of the amplicons.\nQuantify concentration of DNA (Materials Table, Item 3) to determine concentration of the separate ECS libraries.\nPool the libraries in equimolar amounts. Refer to Method 1 Step 1.5.6. and also Discussion for more details on pooling.\nSubmit the pooled ECS library at roughly 4 nM.\nProvide the following sequencing settings to Illumina sequencing platforms (MiSeq, HiSeq or NextSeq): 2x144 paired-end reads, 8 cycles Index 1 and 16 cycles Index 2.\nECS Bioinformatic Processing and Analysis\nObtain the sample-demultiplexed reads from the sequencer or perform demultiplexing of raw sequence reads into different samples using i7 adapter sequences bioinformatically with a custom script.\nTrim off the first 30 nucleotides of each demultiplexed read to remove oligo sequences from the gene panel.\nAlign reads that share the same UMIs to one another to form read families.\n\t\tNOTE: Researchers can use UMI-aware software such as MAGERI13 to extract read families. No hamming distance was allowed within the UMI sequence in this experiment to increase the specificity of the method.\nPerform de-duplication and error-correction using the following recommended parameters.\n\t\t\nUse ≥5 read pairs in the same read family. A minimum of three read pairs is recommended.\nCompare nucleotide at every position across all reads in the same read family, and generate a consensus nucleotide if there is at least 90% concordance among the reads for the particular nucleotide. Call an N if there is less than 90% agreement for the nucleotide position.\nDiscard consensus reads that have >10% of the total number of consensus nucleotides being called as N.\nAlign all retained consensus reads locally to either hg19 or hg38 human reference genome using researcher’s preferred aligner(s) such as Bowtie2 and BWA.",
    "Process aligned reads with Mpileup using parameters –BQ0 –d 10,000,000,000,000 to remove coverage thresholds to ensure a proper pileup output regardless of VAF.\nFilter out positions with less than 1000x consensus read coverage.\n\t\tNOTE: The researcher determines the minimum coverage for each nucleotide position arbitrarily, it is recommended to have at least 500x consensus read coverage for downstream analysis.\nUse binomial distribution to call single nucleotide variants (SNPs) in retained data from Step 2.5.7 with the following parameters. The binomial statistic will be based on a genomic position-specific error model. Each genomic position is modeled independently after summing out the error rates of all samples for that particular position. Following the example:\n\t\tProbability of nucleotide profile at a given genomic position, p\n\t\t∑ Variant RF2 ∑ Total RFs\n\t\t= 26/255505\n\t\t= 0.000101759\n\t\tBinomial probability of 24 variant RFs out of 35911 total RFs, P(X ≥ x) in sample K\n\t\t= 1 - binomial(24, 35911, 0.000101759)\n\t\t= 2.26485E-13\n\t\tNOTE: For each genomic position queried, there would be three possible mutational changes (i.e.,A>T, A>C, A>G), and each of which would be represented as background artifact. Somatic events that are significantly different from the background after Bonferroni correction are retained. In the example shown in Table 1, the number of tests performed was 11, hence a Bonferroni corrected p-value ≤0.00454545 (0.05/11) was required to call an event as statistically significant.\nSomatic events are required to be present in both replicates from the same specimen; otherwise, regard them as false positives.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57509/57509table1.jpg\nTable 1: Example demonstrating the way to construct a position-specific binomial error model.\n3. Error-corrected Sequencing of RNA",
    "In addition to assessing for mutations at the DNA level, integrate ECS with various targeted RNA sequencing panels to detect rare or low abundance transcript at the RNA level. By combining ECS with the off-the-shelf Qiagen RNA sequencing panels, we demonstrated digital quantification of gene expression for transcripts with as few as ten copies without a need for normalization against a housekeeping gene. The UMIs required for error-correction have been integrated into the panel.\nPerform total RNA extraction (Materials Table, Item 20).\nCarry out ECS-RNA library preparation according to manufacturer’s protocol (Materials Table, Item 19).\nPerform bioinformatics pipeline according to Step 2.5.1–2.5.6. of Method 2 outlined in the previous section. After Step 2.5.6, the number of aligned consensus reads per gene represents the expression level of the gene without the need for gene length normalization."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}