{
  "id": 9267,
  "origin_website": "Jove",
  "title": "Optogenetic Stimulation of the Auditory Nerve",
  "procedures": [
    "All experiments presented in this work were conducted with the ethical standards defined by the German law for the protection of experimental animals. The University of Goettingen board for animal welfare and the animal welfare office of the state of Lower Saxony approved the experiments.\n1. Preparation of µLED-stimulator\nFor µLEDs, first prepare the µLED-stimulator. Use blue LEDs with 200 by 200 μm active surface (µLED, see Materials Table).\nSolder wires to the µLED. Then, encapsulate the μLED and the connections using epoxy glue. Leave the device overnight to let the epoxy cure.\nFor mechanical stability and electrical insulation funnel the wires through a thin glass capillary, use 1 mm outer diameter borosilicate capillaries and seal the junction with epoxy (Figure 1D) such that the capillary can be mounted on a mechanical manipulator.\n\tNOTE: There is a trade-off of making the capsule thick enough to get a good electrical isolation (avoiding stimulation artifacts), but thin enough to let the LED move freely inside the bulla and to locate it onto the cochleostomy. It is a good practice to prepare more than one LED.\nTo confirm good electrical isolation, first prepare a Petri dish with 0.9% NaCl and dip 3 bare ended copper wires into the liquid. This serves to simulate an animal with ABR electrodes. Connect the wires to the ABR-amplifier and from there to an oscilloscope.\nThen, connect the LED to the stimulator and immerse it into the solution until it is totally covered. Drive the LED with pulses (see step 3.1.1) at the maximum allowed current for longer than 20 min and check for stimulation artifacts. If they appear, discard the LED and try a new one.\n2. Surgical Procedure",
    "Use 4-10 week-old transgenic mice expressing ChR2 under the Thy1.2 promoter (line 9 in Wang et al.13). To manipulate the animal and perform the surgery, always use clean and well identified surgical tools.\nAnesthetize animals with an i.p. injection of a mixture of urethane (1.32 mg/kg), xylazine (5 mg/kg), and buprenorphine 0.1 µg/g diluted in 0.9% sterile NaCl solution and place the mouse onto a heating plate for maintaining body temperature at 37 °C. With this dose, anesthesia typically lasts for the whole experimental protocol.\n\t\nBeginning 10 min after initial anesthesia induction check for signs of arousal by the paw withdrawal reflex. In case of movements, apply maintenance doses of urethane (.66 mg/kg) and buprenorphine (0.05 µg/g) diluted in 0.9% sterile NaCl solution (without Xylazine). Again check the paw withdrawal reflex and proceed only if the reflex is absent.\nCarefully shave the retroauricular area in preparation of the incision. Use a retroauricular approach to reach the bulla (air-containing middle ear cavity).\n\t\nWith a micro forceps carefully dissect and/or remove part of the neck muscles, e.g., platysma, sternocleidomastoid, and scalenes.\nFind and expose the bulla (Figure 1A). Identify the bulla as a bony structure with a characteristic spherical shape with a ring on the bulla surface that indicates the insertion of the tympanic membrane (Figure 1A). Make a hole with the tip of an insulin needle just below this ring. Start there, remove the bone that covers the bulla with a fine Rongeur (gnawer) or microforceps in such a way that the promontorium of the cochlea is exposed (Figure 1B).",
    "For the cochleostomy, gently shave off the bony capsule to open a small window (cochleostomy: ~500-800 μm), taking care to leave intact the membranous labyrinth (Figure 1B). Perform the cochleostomy on the second cochlear turn as it is far enough from the stapedial artery and from the apex. Opening the apex could produce rupture of the cochlea including a fracture of the modiolus.\nFor a round window insertion of an optical fiber or µLED-implant to scala tympani, carefully enlarge the round window niche by scratching the bony niche with the tip of a sharp scalpel (a blade number 11 is a good option). Always use a new blade or scalpel. Be very careful as the stapedial artery runs very close to the round window (Figure 1B).\n3. Optical Stimulation Using Two Approaches\nFor transcochlear stimulation, use µLEDs or a fiber coupled laser.\n\t\nMount the capillary carrying the µLED on a mechanical manipulator and carefully position the µLED onto the cochleostomy. Use oABR, elicited by 3-10 msec long stimulation from a current source (typically 5-40 mA at 2.7 V) at 1-5 Hz, as a means to optimize the position and orientation of the µLED.\nFor laser stimulation, use a 473 nm continuous wave laser and a 250 µm optical fiber (see Materials). Couple the optical fiber to a blue laser source that ideally offers fast analogue control of power (else use an acousto-optical device or a fast shutter to define the optical stimulus). Using a micromanipulator, locate the tip of the fiber directly onto the cochleostomy and fix it there using dental cement (transcochlear stimulation).",
    "For intracochlear stimulation, insert the fiber through the round window into the scala tympani. Then use 3-10 msec laser pulses of 10-30 mW (power of fiber output) at 1-5 Hz to elicit oABR. The large amplitude of oABR enables the experimenter to observe oABR evoked by single stimuli on the oscilloscope for optimizing the position and orientation of the emitter (µLED or fiber) using oABR amplitude as a read-out.\nOnce good oABR have been achieved, fix the fiber with cyanoacrylate glue or dental cement and wait until the glue is solid.\n\tNOTE: It is normal to observe some liquid coming out from the cochlea. However to avoid problems with the polymerization of the cement, it is advisable to dry up the region using fine cotton wicks.\n4. Recordings of oABR\nInsert needle electrodes underneath the pinna, on the vertex and on the back near the legs and connect them to the amplifier.\nAmplify the difference potential between vertex and mastoid subdermal needles. Sample at a rate of 50 kHz and filter (1-10,000 Hz). Visualize the difference potential on an oscilloscope ideally near the recording setup for optimizing the position of the optical stimulator. Use signal averaging (50-1,000x) and store the data on a computer for offline analysis.\n5. Recordings of Optically Evoked Local Field Potentials\nPlace the animal into a stereotactic frame. Using forceps centrally pull the skin overlying the cranium and perform a median incision with scissors roughly extending from between the eyes to the point where the neck muscles attach to the skull.\n\t\nReflect the skin laterally. Cut the periosteum lengthwise along the sagittal suture and remove it sideward by gently rubbing the exposed cranial bone with a cotton swab.",
    "Position a custom made metal plate onto the exposed skull leaving approximately 1 mm space between the caudal end of the plate and lambda. With a 0.7 mm diameter drill carefully drill a hole into the parietal bone.\nGently screw in a 0.85 mm diameter screw – to serve as reference for potentials recorded from the inferior colliculus (IC) – holding the screw with forceps as long as the screw is not securely fastened. Ensure good contact between screw and dura without penetrating the brain. Glue the screw and the metal plate onto the skull with cyanoacrylate glue.\nLoosen the neck muscles gently from the skull. Pull the neck muscles caudally for circa 1-2 mm. Identify the intersection of the superior sagittal sinus (SSS) and the transverse sinus (TS). If necessary, increase the transparency of the skull by moistening the bone with physiological NaCl solution.\n\t\nIdentify the IC in mice as lying directly caudal to the SSS and TS intersection. After identification of the location of the IC slowly and carefully perform a trepanation extending ca. 0.5 mm rostrally to 1.5 mm caudally to the TS and roughly 3 mm laterally.\nAvoid any injury to the SSS and TS as these would preclude a successful experiment. Here, test whether the trepanned bone has become loose by softly pushing it. Using forceps slowly lift off the bone.\nWith an appropriate adaptor attach a multichannel array and headstage onto a micromanipulator. To prevent destroying the multichannel recording array during insertion into the IC, carefully remove the dura with a bent tip of a small hypodermic needle starting close to a bone edge.",
    "Remove the animal from the stereotaxic frame. Fix the metal plate onto a bar to remain stereotaxic fixation. Position the recording probe over the IC and insert it under microscopic control such that the top most channel is just visible at the surface.\nAmplify the difference potential between the individual channels of the recording array and the reference screw in the parietal bone, sample at a rate of 32 kHz, low-pass filter (300 Hz) and store on a computer for offline analysis.\nAll animals should be humanely euthanized at the end of the procedure prior to anesthetic recovery in accordance with relevant euthanasia guidelines. Suitable methods of euthanasia may include cervical dislocation or CO2 inhalation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}