{
  "id": 13362,
  "origin_website": "Jove",
  "title": "Efficient and Scalable Directed Differentiation of Clinically Compatible Corneal Limbal Epithelial Stem Cells from Human Pluripotent Stem Cells",
  "procedures": [
    "University of Tampere has the approval of the National Authority for Medicolegal affairs Finland (Dnro 1426/32/300/05) to conduct research on human embryos. The institute also has supportive statements of the Ethical Committee of the Pirkanmaa Hospital District to derive, culture, and differentiate hESC lines (Skottman/R05116) and to use hiPSC lines in ophthalmic research (Skottman/R14023). No new cell lines were derived for this study.\nNOTE: The protocol described is based on specific, commercially available hPSC and corneal epithelium differentiation media. Please refer to the Table of Materials for manufacturer/supplier information and catalog numbers.\n1. Establishing Xeno- and Feeder-free hPSC Culture\nPreparations\n\t\nCoat 24-well plates with human recombinant laminin-521 (LN-521). For the first feeder-free (FF) passage, use LN-521 at a concentration of 1.09 µg/cm2, and at 0.55 µg/cm2 for the following passages. The suggested LN-521 concentrations serve as a starting point for successful FF culture but can be lowered.\n\t\t\nThaw LN-521 vial slowly at 4 °C as instructed by the manufacturer.\n\t\t\tNOTE: Appropriately handled LN-521 solution may be stored at 4 °C for up to 3 months after thawing.\nTo prepare the coating solution, dilute appropriate amount of LN-521 stock solution with 1x Dulbecco’s Phosphate-Buffered Saline (DPBS) containing Ca2+ and Mg2+ to a total volume of 300 µL per well.\nPipet the coating solution to the wells, seal the well plate with parafilm, and incubate overnight at 4 °C. Coated plates may be stored at 4 °C for up to 2 weeks.\n\t\t\t(Optional): Alternatively, for a rapid coating protocol, incubate well plates with coating solution for 2 h at 37 °C, 5% CO2.",
    "Prepare hPSC culture medium (specifically Essential 8 Flex) by supplementing basal medium with provided supplement, as instructed by the manufacturer. Add 50 U/mL penicillin-streptomycin. Note that the formulation is sensitive to light and high temperatures. Thaw the supplement and warm the media at room temperature (RT), protected from light. Use the supplemented hPSC medium within two weeks from the supplementation date.\nTransferring the hPSC to FF culture on LN-521\n\t\nPre-warm all the needed materials and reagents to RT in the laminar flow hood.\nPassage hPSCs from standard culture system on feeder layers (e.g. inactivated human foreskin (hFF) or mouse embryonic fibroblasts), or other FF culture systems using standard methodology. For example, hPSC colonies cultured on hFF feeder cells can be dissected to small pieces with a scalpel and the pieces then detached with a needle tip. Human PSCs cultured using FF culture systems can be transferred using cluster passaging method with or without prior enzyme treatment.\nRemove the LN-521 coating solution from the 24-wells and add 1 mL pre-warmed hPSC medium per well.\n\t\tNOTE: Do not allow the wells to dry as LN-521 will inactivate upon drying.\nTransfer the colony pieces/cell clusters to LN-521 coated 24-wells in hPSC medium with a pipette. Transfer 20–30 colony pieces per well, avoiding overcrowding the wells.\nReplace the medium with 1 mL of hPSC medium the day after transfer and every other day thereafter. The cultures are ready for passaging 3–4 days later as hPSCs have grown out to colonies with smooth, undifferentiated morphology. For reference, see Figure 1B (first image). For the first FF passage, the colonies should not be allowed to grow to a fully confluent monolayer, but the cultures should be passaged when colonies reach an approximate size of 1 mm.\nPassaging and maintenance of FF hPSC culture",
    "Pre-warm all the needed materials and reagents to RT in the laminar flow hood.\nFrom the second FF passage onwards, passage the FF hPSCs when the culture has reached 80-100% confluency. Passage FF hPSCs to new LN-521 coated 24-well plates using single cell passaging twice a week (on Mondays and Thursdays) to maintain high quality cultures with undifferentiated morphology and to achieve weekend-free feeding regimen. For details, please refer to18,24,25.\n\t\t\nRinse the FF hPSCs twice with 1 mL of 1x DPBS without Ca2+ and Mg2+.\nDetach FF hPSCs with xeno-free trypsin-EDTA (specifically TrypLE Select Enzyme) by incubating 500 µL per well at 37 °C, 5% CO2. For optimal incubation time, allow the cells to round up but not to detach. This usually takes 3 min at 37 °C, 5% CO2 (do not exceed 5 min).\nRemove xeno-free trypsin-EDTA and immediately add 500 µL per well of defined trypsin inhibitor.\nDetach FF hPSCs by careful, yet thorough pipetting to obtain a single cell suspension. Transfer the FF hPSC suspension through a 40 µm cell strainer into a 15 mL conical centrifuge tube containing pre-warmed hPSC medium.\nWash the wells with 1 mL of hPSC medium and add washing medium to the 15 mL conical centrifuge tube.\nCentrifuge the single cell suspension for 5 min at 300 x g, aspirate the cell pellet, and resuspend in 1 mL pre-warmed hPSC medium.\nCount the cells with hemocytometer or automated cell counter.\nRemove the LN-521 coating solution (0.55 µg/cm2) from the 24-wells and add hPSC medium as in 1.2.3.\nPlate FF hPSCs onto 0.55 µg/cm2 LN-521 coated 24-wells at a cell density of 40,000 – 50,000 cells/cm2.\nReplace medium with fresh hPSC medium the day after passaging, and every other day thereafter excluding Sundays.",
    "The cells are ready to be used for differentiation 3-4 days after passaging, when the culture has reached >85% confluency. For ensuring the high quality of the hPSCs, refer to characterization methods described in detail in previous works18,24,25. It is recommended to only culture hPSCs up to passage level 15 in the FF system using single cell passaging to avoid karyotypic changes. Only use high-quality, undifferentiated hPSCs as starting material for differentiations.\n2. Directed Differentiation and Cryopreservation of hPSC-derived LESCs\nPreparations\n\t\nPrepare xeno-free basal induction medium (basal induction medium): Supplement Dulbecco’s modified Eagle’s medium (specifically KnockOut DMEM) with 15% xeno-free serum replacement (spesifically CTS KnockOut SR XenoFree), 2 mM L-glutamine, 0.1 mM 2-mercaptoethanol, 1% non-essential amino acids, and 50 U/mL penicillin-streptomycin. Use the basal induction medium within two weeks.\nPrepare media for corneal induction in suspension culture.\n\t\t\nDay 1: Supplement basal induction medium with 5 μM blebbistatin.\nDay 2: Supplement basal induction medium with 10 µM SB-505124 and 50 ng/mL human basic fibroblast growth factor (bFGF).\nDay 3-4: Supplement basal induction medium with 25 ng/mL bone morphogenetic protein 4 (BMP-4).\nPrepare corneal epithelium differentiation medium (differentiation medium, specifically CnT-30) for adherent culture: Add supplements to basal medium according to the manufacturer’s instructions and add 50 U/mL penicillin-streptomycin.\n\t\tNOTE: Differentiation medium formulation is sensitive to light. Use the supplemented differentiation medium within 6 weeks of the supplementation date.\nCoat 100 mm tissue culture dishes for adherent differentiation (see step 2.3) with a mixture of 5 µg/cm2 human placental collagen type IV (col IV) and 0.5 µg/cm2 LN-521 diluted in 1x DPBS containing Ca2+ and Mg2+, in a total coating volume of 5 mL per dish. Prepare and store the coatings with col IV and LN-521 as described in 1.1.1.3.\nStep I: Corneal induction in suspension culture",
    "Pre-warm all the needed materials and reagents to RT in the laminar flow hood.\nDetach FF hPSCs to single cell suspension with xeno-free trypsin-EDTA as instructed in steps 1.3.2.1–1.3.2.6. Count the cells, and distribute 2-3x106 cells per low attachment 6-well plate well, in total volume of 3 mL of basal induction medium supplemented with 5 μM blebbistatin to induce EB formation overnight at 37 °C, 5% CO2 (Day 1).\nOn the following day (Day 2), remove the medium and replace with 3 mL of basal induction medium supplemented with 10 µM SB-505124 and 50 ng/mL bFGF.\nOn the following two days (Days 3–4), remove the medium and replace with 3 mL of basal induction medium supplemented with 25 ng/mL BMP-4.\nStep II: Corneal differentiation in adherent culture\n\t\nPre-warm all the needed materials and reagents to RT in the laminar flow hood.\nOn day 5, plate the EBs down onto 100 mm tissue culture dishes coated with 5 µg/cm2 col IV and 0.5 µg/cm2 LN-521.\n\t\t\nRemove the coating solution from 100 mm tissue culture dishes and add 10 mL of pre-warmed differentiation medium per dish.\n\t\t\tNOTE: Do not allow the dishes to dry as LN-521 will inactivate upon drying.\nTransfer the EBs from one 6-well plate well to two to three 100 mm tissue culture dishes (approximately 50 EBs per cm2) by pipetting. Distribute the EBs evenly by gentle shaking.\nMaintain the cells in adherent culture at 37 °C, 5% CO2, replacing the medium with 10 mL of fresh differentiation medium three times per week (on Monday, Wednesday and Friday) for the next 2.5–3 weeks. Check the cells regularly for the emergence of correct epithelial morphology using phase contrast microscope.\nStep III: Cryo-banking hPSC-derived LESCs",
    "Pre-warm all the needed materials and reagents to RT in the laminar flow hood, except for the cryopreservation medium that should be pre-chilled.\nDetach hPSC-derived LESCs with xeno-free trypsin-EDTA and count the cells, as instructed for FF hPSCs in steps 1.3.2.1–1.3.2.6, but using differentiation medium.\n\t\tNOTE: For hPSC-derived LESCs, optimal incubation time with xeno-free trypsin-EDTA is longer (about 5 min). Use 3 mL of xeno-free trypsin-EDTA and defined trypsin inhibitor per 100 mm dish.\nAfter counting the cells, repeat centrifugation for 5 min at 300 x g, aspirate medium and resuspend the cell pellet in pre-chilled, xeno-free hPSC cryopreservation medium. Pipet the single cell suspension into cryotubes so that each cryotube contains 0.5 to 1 x 106 cells in 1 mL cryopreservation medium.\nPlace the tubes in a freezing container and transfer immediately (within 5 min) to -80 °C overnight.\nOn the following day, transfer the tubes to liquid nitrogen for long-term storage.\nStep IV: Thawing the cryopreserved hPSC-LESCs\n\t\nPrior to thawing, coat the dishes/well plates with 5 µg/cm2 col IV and 0.5 µg/cm2 LN-521.\nPre-warm all the needed materials and reagents to RT in the laminar flow hood.\nRemove the coating solution from dishes/wells and add appropriate volume of pre-warmed differentiation medium.\n\t\tNOTE: Do not allow the dishes to dry as LN-521 will inactivate upon drying.\nThaw the cells quickly at RT and immediately transfer the cell suspension to a 15 mL conical centrifuge tube containing 5 mL of pre-warmed differentiation medium.\nCentrifuge the cell suspension for 5 min at 300 x g, aspirate, and resuspend the pellet in differentiation medium to remove any cryopreservation medium.",
    "Plate the cells onto dishes/wells coated with 5 µg/cm2 col IV and 0.5 µg/cm2 LN-521, in differentiation medium at a density of 40,000 – 50,000 cells/cm2. Maintain the cells at 37 °C, 5% CO2, replacing the differentiation medium three times a week.\n3. Phenotyping of hPSC-derived LESCs\nQualitative immunofluorescence analysis\n\t\nFor immunofluorescence, coat 24- or 12- well plate wells with 5 µg/cm2 col IV and 0.5 µg/cm2 LN-521 and plate/thaw hPSC-LESCs in differentiation medium at a density of 40 000–50 000 cells/cm2.\nWhen the cultures have reached confluency, fix the cells with 4% paraformaldehyde (PFA): Wash the wells twice with 1x DPBS without Ca2+ and Mg2+and incubate 15-20 min with 4% PFA at RT. Thereafter, wash twice with 1x DPBS to remove any PFA residues. Use 0.5-1 mL of solutions per well.\n\t\tNOTE: Fixed cells may be stored in 1x DPBS at 4 °C for up to one week prior to staining.\n\t\tCaution: PFA is toxic and corrosive. Handle PFA in a fume hood and wear protective clothing, eye protection, and gloves.\nAspirate 1x DPBS and permeabilize cell membranes by incubating for 10-15 min with 0.1% Triton X-100 in 1x DPBS.\nAspirate 0.1% Triton X-100 and block nonspecific antibody binding sites by incubating for 1 h with 3% bovine serum albumin (BSA) in 1x DPBS at RT. Prepare primary antibody dilutions in 0.5% BSA in 1x DPBS.\n\t\tNOTE: See Table 1 for recommended primary antibodies.\nAspirate 3% BSA and incubate with appropriately diluted primary antibody overnight at 4 °C.\nWash the wells 3x for 5 min with 1x DPBS. Prepare secondary antibody dilutions in 0.5% BSA in 1x DPBS.\n\t\tNOTE: See Table 1 for recommended secondary antibodies.\nAspirate 1x DPBS and incubate with suitable, appropriately diluted secondary antibody for 1 h at RT, protected from light.",
    "NOTE: From this step on, keep the samples protected from light in order to prevent fading of the fluorescent dyes.\nWash the wells 3x for 5 min with 1x DPBS and finally counterstain nuclei with 4',6-diamidino-2-phenylindole (DAPI) and mount with fluorescence mounting media. DAPI can be used separately according to manufacturer’s instructions or included in the mounting medium. Place round coverslips (diameter 19 mm and 13 mm for 12- and 24-well plates, respectively) in each well. Follow the manufacturer’s instructions regarding drying and storage of the mounted samples.\nImage the stained cells with a fluorescent microscope.\nQuantitative immunofluorescence analysis\n\t\nPrepare cytospin samples of hPSC-derived LESCs on object glasses.\n\t\t\nDetach hPSC-derived LESCs with xeno-free trypsin-EDTA and count the cells, as instructed in step 2.4.2.\nAfter counting, add pre-chilled 1x DPBS and centrifuge for 5 min at 300 x g. Adjust the sample volume and cell concentration according to the manufacturer’s instructions of the given cytocentrifuge, e.g. 50,000 – 100,000 cells in a sample volume of 150 µL.\nSpin cells down to object glasses with a cytocentrifuge e.g. 5 min at 28 x g and fix immediately for 15-20 min with 4% PFA in 1x DPBS at RT. For the recommended spinning time and speed, refer to the instruction manual of the given cytocentrifuge.\nProceed to staining the cytospin samples as described in steps 3.1.3–3.1.8 Use liquid blocker pen to surround the samples with a hydrophobic circle and conduct the staining in a droplet for economical practice. Washes may be performed in containers with slide holders, in order to ensure efficient removal of excess antibodies and minimal background staining. Counterstain nuclei with DAPI and mount the stained samples with fluorescence mounting media, covering with coverslips. Follow manufacturer’s instructions regarding drying and storage of the mounted samples.",
    "Capture 5–10 images per sample from randomly selected locations using e.g. 10X magnification of a fluorescence microscope.\nEstimate the percentage of positively stained cells in relation to total (DAPI positive) cells, e.g. with ImageJ Image Processing and Analysis software (https://imagej.nih.gov/ij/) tools. Preferably analyze >500 cells per sample.\n\t\t\nOpen the image to be analyzed in ImageJ software. Duplicate the image and filter with default Gaussian blur to remove noise.\nCreate a threshold. Adjust the threshold values to optimal selection of positively stained cell nuclei, and apply. The duplicated image is now converted to a binary view.\nProcess the binary image with binary processing tools “Fill holes” and “Watershed”, which will automatically separate merged areas representing single nuclei.\nUse the “Analyze particles” tool to automatically list regions of interests (ROIs) to the ROI manager window, which will open upon applying the command. Close the binary image.\nVisualize the ROIs in the original image by choosing “Show all” in the ROI Manager. Confirm correct selection of stained cell nuclei, and if needed, manually remove and add individual selections.\nFlow cytometry analysis\n\t\nTo confirm the p63α expression levels, stain the cells for flow cytometry.\n\t\t\nDetach hPSC-derived LESCs with xeno-free trypsin-EDTA and count the cells, as instructed in step 2.4.2.\nWash the cells twice with 1 mL pre-chilled 1x DPBS and centrifuge for 5 min at 300 x g. Fix and permeabilize with ready-to-use fixation/permeabilization solution for 20 min at 4 °C. Thereafter wash the cells twice with 1 mL pre-chilled 1x permeabilizing wash buffer.\n\t\t\tNOTE: From this step on, keep the cells at 4 °C or on ice, unless indicated otherwise.\nCAUTION: Fixation/permeabilization solution contains 4.2% formaldehyde. Handle the hazardous solution in a fume hood and wear protective clothing, eye protection, and gloves.",
    "Divide samples into 5 mL polypropylene tubes. Each sample should contain 100,000–200,000 cells and the sample volume should be adjusted to approximately 100 µL of 1x wash buffer.\nAdd 2 µL of fluorochrome conjugated p63-α FACS antibody (for recommended antibody, see Table of Equipment and Materials) into the sample tubes. Leave one sample unstained to serve as negative control. Vortex the samples and incubate for 1 h at RT, protected from light.\nWash the cells twice with 1 mL of pre-chilled 1x wash buffer and lastly, resuspend the pellets with 300 µL of buffer. Store the tubes on ice, protected from light.\nAnalyze the samples with a flow cytometer. Use the unstained negative control sample for gating of the correct cell population, and for excluding the fluorescent background signal. Analyze a minimum of 10,000 p63-α -stained cells. For detailed technical implementation, please refer to the user manual of the given flow cytometer.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}