{
  "id": 2812,
  "origin_website": "Cell",
  "title": "Protocol to detect antigen-specific nasal-resident T&nbsp;cells in humans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNasal sample collection\nTiming: 1 h\nNasal samples are obtained by a simple localized sampling using FLOQSwab.\nNasal swabbing of subject.\nInsert flocked swab into the inferior turbinate of the subject through the nostril at around 4 cm in.\nTwirl the swab 10–20 times.\nNote: Some minor irritation of the nasal cavity should occur resulting in tearing and mucus secretion.\nInsert the same swab to the other nostril at around 4 cm in.\nTwirl the swab 10–20 times again.\nNote: Some minor irritation of the nasal cavity should occur resulting in tearing and mucus secretion.\nPlace swab into 1 mL of nasal isolation media in a 1.8 mL Eppendorf tube and cut the excess length of the swab in order to close the cap of the Eppendorf tube.\nVortex tube vigorously for 10 s.\nIncubate tube at 37°C for 30 min.\nRemove the swab from the Eppendorf tube carefully and minimize the amount of nasal isolation media trapped by the swab by gently pressing the swab on the wall of the tube.\nSpin down the cells at 1,000 × g for 10 min.\nRemove the supernatant without disturbing the pellet.\nResuspend the pellet in 1 mL of culture media.\nRepeat steps 3 and 4 to wash the cells again.\nResuspend the cells in culture media to the desired volume (1 mL of culture media is recommended).\nQuantification of the nasal lymphocytes collected\nTiming: 10 min\nNasal samples are highly heterogenous, as it includes epithelial cell, ciliated cell and more. Thus, it is difficult to quantify using conventional cell counting method. We employed flow cytometry to quantify the number of lymphocytes retrieved from the nasal swabs.",
    "Aliquot 5% of the total volume of nasal sample obtained to a new Eppendorf tube and adjust the volume with PBS such that the total volume in the Eppendorf tube is 50 μL.\nDilute the cells 2× by adding 50 μL of PBS (total volume 100 μL).\nAcquire the sample using a flow cytometer.\nSet the volume to acquire to 50 μL.\nGate according to Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2319-Fig1.jpg\nFigure 1. Lymphocyte quantification by flow cytometry\n(A) Gating strategy for quantification of lymphocyte.\n(B) Number of lymphocytes gated (y) from the corresponding flow plots, to be used in the calculation for the number of lymphocytes isolated for further experiment.\nNote down the total number of events acquired in the lymphocyte gate (y).\nCalculate the number of cells isolated.\n   (   y × 2 × 2  5  )  × 95 =   Number of lymphocytes isolated for further experiment.\nNote: A 2 times dilution were done before acquisition at step 9 and half (50 μL out of 100 μL) of the 2 times diluted sample were acquired at step 10a, thus the number of lymphocytes gated should be multiplied by 2 twice. That will represent the total lymphocytes aliquoted at step 8 (5% of total lymphocytes obtained). Therefore, to derive the number of lymphocytes present in the remaining 95% of the sample, 4y were divided by 5 and then multiplied by 95.\nNote: The number of lymphocytes isolated from different donors are highly variable. It is not recommended to continue with other experiments (IFN-γ ELISpot assay and activation induced markers assay) if less than 15,000 lymphocytes were isolated. Up to 200,000 lymphocytes could be isolated from each donor.\nIFN-γ ELISpot assay\nTiming: 2 days",
    "Nasal cells will be stimulated overnight with different peptide pools specific for different SARS-CoV-2 proteins. Peptide pools designed based on other pathogens need to be re-validated for this assay. Antigen-specific T cells will produce IFN-γ and will be detected as spot forming units.\nEthanol (EtOH) activation of Millipore ELISpot plate.\nPrepare 35% EtOH diluted with sterile water.\nAliquot 25 μL of 35% EtOH into each well.\nEnsure that the membranes are completely coated by the 35% EtOH by tapping the plate gently.\nAllow the 35% EtOH to activate the membrane for 30 s.\nAdd 200 μL of sterile water into each well to stop the activation.\nWash the plate five times with 200 μL/well of sterile water.\nCoating Millipore ELISpot plate with IFN-γ coating antibody.\nDilute IFN-γ coating antibody in PBS according to concentration stated above.\nFlick the plate to remove sterile water and tap it dry.\nAliquot 100 μL/well of diluted IFN-γ coating antibody.\nIncubate at 4°C in the dark for at least 24 h.\nBlocking ELISpot plate.\nFlick the plate to remove coating antibody and tap it dry.\nWash the plate 6 times with 200 μL/well of PBS.\nAliquot 100 μL/well of blocking media.\nIncubate at room temperature (RT; approximately 25°C) for at least 30 min.\nDilute peptide pools to a working concentration of 6 μg/mL (per peptide) in culture media.\nDilute nasal cells to desired concentration to 100 μL/well (at least 5000 lymphocytes/well).\nRemove the blocking media by flicking the plate.\nAliquot 50 μL of peptides into each well (final concentration of 2 μg/mL (per peptide)) followed by 100 μL of nasal cells into each well (total volume: 150 μL).\nFor negative control, aliquot 50 μL of culture media without peptides into each well.",
    "For positive control, instead of peptides, aliquot 5 μL of α-CD3/28 dynabeads (2 × 105 beads/well) with 45 μL of culture media into each well.\nNote: Negative and positive controls need to be run for all individual samples to determine the validity of the result.\nIncubate at 37°C, 5% CO2 overnight.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2319-Fig2.jpg\nFigure 2. Results of IFN-γ ELISpot assay from donors with or without sufficient nasal T cells isolated\n(A) Results of IFN-γ ELISpot assay from a donor with sufficient nasal T cells isolated as demonstrated by the positive control (α-CD3/28 stimulated well) with more than 100 spots counted. Top right of each well reflects the number of spots counted by the Immunospot reader. The donor has Spike-specific T cells detected but not Membrane-specific T cell.\n(B) Results of IFN-γ ELISpot assay from a donor with insufficient nasal T cells isolated as demonstrated by the positive control (α-CD3/28 stimulated well) with less than 100 spots counted. Top right of each well reflects the number of spots counted by the Immunospot reader. The test for the donor should be excluded from the result.\nDevelop ELISpot plate.\nDilute anti-human IFN-γ biotin and streptavidin-ALP in ELISpot development media according to the concentrations stated above.\nFlick the plate to remove the cells.\nWash the plate 6 times with 200 μL/well of PBS and tap it dry.\nAliquot 100 μL/well of anti-human IFN-γ biotin.\nIncubate the plate for 2 h at RT in the dark.\nWash the plate 6 times with 200 μL/well of PBS and tap it dry.\nAliquot 100 μL/well of streptavidin-ALP.\nIncubate the plate for 1 h at RT in the dark.\nWash the plate 6 times with 200 μL/well of PBS and tap it dry.\nAliquot 50 μL/well of KPL BCIP/NBT phosphatase substrate.",
    "Incubate the plate for 10–20 min at RT in the dark and wash the plate under running tap water when spots are developed and before the negative control well turns purple.\nNote: After 5 min of incubation, ELISpot plate should be checked consistently every two minutes by looking at the negative and positive control wells.\nAllow the plate to dry completely.\nNote: The membrane will take around 30–60 min to completely dry and the membrane will change from translucent to completely opaque white when dry.\nCapture the image of each well with Immunospot reader.\nNote: Test should only be considered successful for each sample if positive control contains more than 100 spots (Figure 2[href=https://www.wicell.org#fig2]).\nActivation-induced markers assay\nTiming: 6 h\nNasal cells will be stimulated with peptide-pulsed autologous CD3-depleted PBMC for 3 h and the activation status will be analyzed with flow cytometry to better characterize the antigen-specific nasal T cells.\nCD3 depletion of autologous PBMC using EasySep Human CD3 Positive Selection Kits II.\nResuspend PBMC at 100 × 106 PBMC/mL with depletion buffer in a 5 mL round-bottom polystyrene tube.\nAliquot 100 μL/mL of human CD3 positive selection cocktail to the PBMC and mix well.\nIncubate at RT for 5 min.\nVortex RapidSpheres vigorously for 1 min.\nAliquot 60 μL/mL of RapidSpheres to the PBMC and mix well.\nIncubate at RT for 5 min.\nTop up sample to 2.5 mL with depletion buffer.\nPlace the tube (without the lid) into Easysep magnet.\nIncubate at RT for 5 min.\nAfter 5 min, pick up the magnet and in one continuous motion pour the supernatant into another 5 mL round-bottom polystyrene tube (Supernatant contains the CD3-depleted cells).\nRepeat steps h–j two more times.\nSpin down the cells at 400 × g for 5 min and remove supernatant.",
    "Resuspend CD3-depleted cells in 1 mL of culture media and count the number CD3-depleted cells isolated.\nNote: We recommend using trypan blue staining and counting in a hemocytometer to determine the viability and cell count.\nOptional: A simple flow cytometry staining including Live/Dead, CD3, CD4 and CD8 antibodies could be performed to check the purity of the CD3-depleted cells isolated. This will allow user to be sure that the antigen-specific response detected in the following steps are not contributed by circulatory cells.\nPause point: CD3-depleted cells could be isolated in bulk and frozen down for storage. For the same donor, CD3-depleted cells could then be thawed and used for the following steps in the future.\nPeptide pulsing with CD3-depleted PBMC.\nDilute peptide pool to 20 μg/mL (final concentration of 10 μg/mL (per peptide)) followed) in 50 μL of culture media.\nResuspend 1 × 106 CD3-depleted cells in 50 μL of culture media.\nAliquot 50 μL of diluted peptide pool and 50 μL of resuspended CD3-depleted cells into a 1.8 mL Eppendorf tube.\nIncubate at 37°C, 5% CO2 for 1 h.\nAfter 1 h, spin down the cells at 400 × g for 5 min.\nRemove supernatant and resuspend in 50 μL of culture media.\nStimulation of nasal cells with peptide-pulsed autologous CD3-depleted PBMC.\nAdd 2 μL of APC anti-CD107a antibody and 2 μL of FITC anti-CD40L antibody to the peptide pulsed CD3-depleted cells.\nFor negative control, un-pulsed CD3-depleted PBMC should be added, instead of peptide-pulsed autologous CD3-depleted PBMC.\nFor positive control, add 2 μL of APC anti-CD107a antibody and 2 μL of FITC anti-CD40L antibody to 5 μL of α-CD3/28 dynabeads with 41 μL of culture media.\nNote: Negative and positive controls need to be run for all individual samples to determine the validity of the result.",
    "Note: APC anti-CD107a and FITC anti-CD40L antibodies are added during stimulation of nasal cells with peptide-pulsed autologous CD3-depleted PBMC, instead of during the cell surface markers staining step later, to better capture the expression of CD107a and CD40L during activation.\nAdd 50 μL of nasal cells (containing at least 5,000–10,000 lymphocytes).\nIncubate at 37°C, 5% CO2 for 3 h.\nAfter 3 h, add 500 μL of PBS to the cells, spin it down at 400 × g for 5 min and remove supernatant carefully.\nCell surface markers staining.\nStain the cells in the same 1.8 mL Eppendorf tube with 100 μL/sample of NIR (1:1000 in PBS) in the dark at RT for 10 min.\nAfter 10 min, add 100 μL of staining buffer to the cells, spin it down at 400 × g for 5 min and remove supernatant carefully.\nPrepare antibody mix by diluting BV605 anti-CD3, BV650 anti-CD4, PE-Cy7 anti-CD8, AF700 anti-CD69 and FITC anti-CD103 antibodies in staining buffer to the concentrations stated above, final volume of antibody mix for each sample should be 50 μL.\nStain the cells with 50 μL/sample of antibody mix for 30 min in the dark on ice.\nAfter 30 min, wash the cells twice with 200 μL staining buffer each time.\nResuspend the cells in 100–200 μL of staining buffer for acquisition.\nAcquire samples with flow cytometer immediately.\nGating strategy is shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2319-Fig3.jpg\nFigure 3. Gating strategy for the activation induced marker assay performed with nasal cells stimulated by peptide-pulsed autologous antigen presenting cells"
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Cell-Based Assays",
    "Microbiology",
    "Clinical Protocol"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}