{
  "id": 19531,
  "origin_website": "Jove",
  "title": "Analysis of β-Amyloid-induced Abnormalities on Fibrin Clot Structure by Spectroscopy and Scanning Electron Microscopy",
  "procedures": [
    "1. Preparation of Aβ42 and Fibrinogen for Analysis\nPrepare monomeric Aβ42 from lyophilized powder\n\t\nWarm Aβ42 powder to room temperature and spin down at 1,500 x g for 30 s.\nAdd 100 µL of ice-cold hexafluoroisopropanol (HFIP) per 0.5 mg of Aβ42 powder and incubate for 30 min on ice.\n\t\tCAUTION: Use care when handling HFIP and perform all steps in a chemical hood.\nPrepare 20 µL aliquots and let the films air dry in a chemical hood for 2-3 h. Films can be stored at -20 °C.\nReconstitute monomeric Aβ42 film in 10 µL of fresh dimethyl sulfoxide (DMSO) by agitation in a bath sonicator for 10 min at room temperature.\nAdd 190 µL of 50 mM tris(hydroxymethyl)aminomethane (Tris) buffer (pH 7.4) and pipette up and down gently.\nRemove the protein aggregates by centrifugation at 20,817 x g at 4 °C for 20 min.\nIncubate the supernatant at 4 °C for overnight and next day centrifuge the solution at 20,817 x g at 4 °C for 20 min to discard any further protein aggregates.\nMeasure Aβ42 concentration by bicinchoninic acid (BCA) assay. Serial dilute purified bovine serum albumin (BSA) from 1 mg/mL to 0.0625 mg/mL to produce a protein standard, add 10 µL of each standard to the wells of a multi-well plate in triplicate. Dilute Aβ samples 1:4 and add 10 µL to the wells in triplicate. Mix BCA solutions A and B and add 200 µL to each well. Incubate for 30 min at 37 °C and read on a plate reader at 562 nm. Keep the remaining Aβ solution on ice and use this preparation for turbidity assay and SEM.\nPrepare Fibrinogen solution",
    "Measure 20 mg of lyophilized fibrinogen powder into a 15 mL tube and re-suspend with pre-warmed 2 mL of 20 mM hydroxyethylpiperazine ethane sulfonic acid (HEPES) buffer (pH 7.4).\nIncubate in a 37 °C water bath for 10 min.\nFilter solution through a 0.2 µm syringe filter and store at 4 °C for 30 min. Take out the solution from 4 °C and filter again through 0.1 µm syringe filter to remove fibrinogen aggregates or pre-existing fibrin.\nMeasure the fibrinogen concentration by BCA assay. Follow the instructions from Step 1.1.8. Keep the remaining fibrinogen solution at 4 °C and use this preparation for turbidity assay and SEM.\n2. Clot Turbidity Assay\nTo each experimental well of the 96-well plate, add 20 µL of 30 µM Aβ42 solution from Step 1.1.8 so that its final concentration is 3.0 µM in 200 µL of the buffer. Add the same volume of 5% DMSO in 50 mM Tris buffer (pH 7.4) to buffer control wells in the 96-well plate.\n\tNOTE: The exact volume of Aβ42 at this step is not important. For low concentration preparations, a higher volume can be used, and the volume of the clot formation buffer can be adjusted. The final volume should remain 200 µL.\nIf testing inhibitory compounds, dilute the compound to the working concentration as DMSO. Add compound or DMSO alone for a control to the wells with Aβ42 and mix well.\n\tNOTE: Aβ42 solution should form a discrete droplet at the bottom of the well, the compound or DMSO should be pipetted directly into the center of the droplet.",
    "Dilute the fibrinogen stock solution from Step 1.2.4 in clot formation buffer (20 mM HEPES buffer (pH 7.4), 5 mM CaCl2, and 137 mM NaCl) and add it to Aβ42 containing and control wells of the 96-well plate. Adjust the volume of the fibrinogen solution so that its final concentration becomes 1.5 µM in total 200 µL reaction volume. Pipette the solution slowly and avoid forming bubbles. Incubate the plate at room temperature for 30 min shaking on a rotating platform.\n\tNOTE: The volume of fibrinogen solution may vary depending on its stock concentration, but the total volume in each well should be 170 µL while incubation.\nPrepare thrombin solution by dissolving commercially purified thrombin powder in ddH2O to make a stock solution of 50 U/mL. Dilute to the 5 U/mL working solution in 20 mM HEPES buffer (pH 7.4) directly before use.\nAfter 30 min of incubation, simultaneously add 30 µL of thrombin solution (5 U/mL) into the fibrinogen solutions in the 96-well plate from Step 2.3 using multichannel pipette. Addition of thrombin will immediately initiate the clot formation. Therefore, add thrombin directly into the center of the fibrinogen solution with care to avoid forming bubbles.\n\tNOTE: The activity of thrombin can vary between experimental conditions, as well as thrombin lots. The correct concentration required to robustly produce clots may have to be determined empirically.\nRead the absorbance of in vitro clot on a plate reader immediately following the thrombin addition. Measure the absorbance at 350 nm over the course of 10 min, every 30-60 s. Perform the entire assay at room temperature.\n\tNOTE: Some inhibitor compounds may alter the solution absorbance at 350 nm, in which case the turbidity can be measured at 405 nm.\n3. Scanning Electron Microscopy\nPreparation of clot, fixation, and washing",
    "Place clean siliconized glass circle cover slides (12 mm) into a 12-well or 24-well plate using forceps.\nPrepare fibrinogen in clot formation buffer. See protocol step 1.2 for details.\nTo evaluate the effect of Aβ-fibrinogen interaction inhibitors on fibrin clot structure, follow the instructions for incubation as described for the turbidity assay (Step 2). Always include control wells which contain fibrinogen in the absence of both Aβ and inhibitors.\nPipette 80 µL of the fibrinogen mixture from Step 3.1.3 on the cover slides. Gently spread the solution so that it is evenly distributed on the cover slide.\nDilute thrombin stock (50 U/mL) into 20 mM HEPES buffered saline to a final concentration of 2.5 U/mL and add 20 µL directly to the center of to the fibrinogen solution without mixing.\n\t\tNOTE: If required, a higher thrombin working concentration (5 U/mL) can be used.\nCover the 12-well plate with a plastic lid and leave it at room temperature for 30-60 min.\nWhile clotting reaction is running, prepare dehydration and fixation solutions. Prepare sodium cacodylate buffer (0.1 M, pH 7.4). Dilute 10% glutaraldehyde stock solution in sodium cacodylate buffer (0.1 M, pH 7.4) to make a 2% working solution of glutaraldehyde. Keep all these solutions on ice. Freshly diluted glutaraldehyde (2%) should be used within 1 week, when properly stored in a refrigerator at 4 °C.\nDilute absolute ethanol (100%) in double distilled water (80%, 50%, and 20% ethanol). Keep these ethanol solutions and absolute ethanol (100%) on ice.\n\t\t​CAUTION: Use care when handling sodium cacodylate and glutaraldehyde, perform these steps in a chemical hood.",
    "After 30 min, gently wash the clots with ice-cold sodium cacodylate buffer (0.1 M) twice. Add 2 mL of the buffer to each well such that the clot is completely submerged. Cover the well plate with a lid and leave it for 2 min at room temperature. After 2 min, gently remove the buffer using a 1 mL pipette or narrow stem transfer pipette. Repeat once.\nFix the clots with ice-cold glutaraldehyde (2%). Keeping the well plate on ice, add around 2-3 mL of 2% glutaraldehyde to each well. Make sure the clots are completely submerged. Cover and leave the plate on ice for 30 min.\nAfter 30 min, gently remove the glutaraldehyde from each well and wash the clots using sodium cacodylate buffer (0.1 M) as described above (2 min, twice). Keep the well plate on ice.\nSerial dehydration of clot and critical point drying\n\t\nDehydrate the clots in a graded series of ice-cold ethanol washes prepared in Step 3.1.8 (20%, 50%, 80%, 100%, and again100%) for 5 min each. For each ethanol series, add 2-3 mL, making sure the clots are submerged. Cover and incubate on ice.\nAfter each ethanol step, remove the ethanol solution using a 1 mL pipette or disposable pipette dropper. Do not remove the ethanol completely. Make sure the clot surface is not exposed to air.\n\t\tNOTE: Dehydration in absolute ethanol (100%) should be performed twice.\nWhile keeping the sample submerged in the final 100% ethanol, transfer to a critical point dryer (CPD). Use a CPD sample holder or a cover slip holder with a washer for transferring the slides into the CPD chamber. Place at least one washer between each slide.\nTake out the cover slide from the CPD chamber and mount it on an SEM stub using carbon tape.",
    "Sputter coating and imaging\n\t\nTransfer all the samples with SEM stub to the sputter coating chamber.\nSputter coat less than 20 nm of gold/palladium or other conductive materials, such as carbon, using a vacuum sputter coater.\n\t\tNOTE: We have used 18 nm of gold/palladium coating. The sputter coating was performed for 45 s and the coating speed was 4 Å/ s. Sputter coated samples are stable when kept properly in a dry environment at room temperature for few weeks. SEM analysis can be performed anytime.\nAcquire images on a scanning electron microscope equipped with the SE2 detector at 4 kV.\nNOTE: The image pixel size in this image set range from 13 nm- 31 nm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}