{
  "id": 7761,
  "origin_website": "Bio",
  "title": "BONCAT-based Profiling of Nascent Small and Alternative Open Reading Frame-encoded Proteins",
  "procedures": [
    "AHA labelling of newly synthesized proteins  Seed 2.5 × 107  HEK 293T cells in a 15-cm cell culture dish, followed by culture in complete DMEM with 10% FBS and 1% Penicillin/Streptomycin in a 5% CO2  atmosphere at 37 °C overnight, to achieve 80%–90% confluency.Aspirate medium from the cells, wash once with 10 mL of room-temperature (RT) 1× PBS, then add 10 mL of pre-warmed DMEM-Met, and incubate in a 5% CO2  atmosphere at 37 °C for 30 min.Prepare 0.4 M AHA (100× stock, which is stable at -20 °C for at least 2 months) in 1× PBS. Gently remove DMEM  -Met  from the cells, then gently add 10 mL of pre-warmed DMEM-Met  with 4 mM AHA (1×) and 10% FBS. Incubate in a 5% CO2  atmosphere at 37 °C for 2 h, to label the newly synthesized proteins with AHA.Remove the medium, wash twice with 10 mL of 1× PBS, and harvest the cells by pipetting up and down (Note: other adherent cell types likely need to be harvested with gentle scraping). Transfer the cells into a 15 mL tube, centrifuge at 800  × g  and RT for 3 min, and gently aspirate the supernatant. Note: Samples can be flash frozen and stored for 1–2 months at -80 °C at this point.   Validation of AHA labelling and C8 column-based size-selection  Especially if performing BONCAT labeling for the first time, it is important to confirm AHA incorporation into the cellular proteome, prior to proceeding to proteomic analysis. To detect AHA-labeled proteins, we recommend that the cells from a single well of a 6-well cell culture plate, with protein concentration-normalized lysate from unlabeled or vehicle-treated cells as a negative control, be subjected to Click chemistry with commercially available biotin-alkyne, followed by streptavidin-HRP blotting, as shown in Figure 1.",
    "This step can be performed on a separate sample that has been prepared in parallel to the cells to be used for proteomic analysis.Add 200 µL of 1% w/v SDS in 1× PBS to the cell pellet, followed with boiling at 100 °C for 10 min. In parallel for all steps, process an unlabeled (non-AHA-treated) pellet of an equal number of the same cells as a negative control, to assess labeling efficiency over background.Add 1.8 mL of 1× PBS containing 0.2% Triton X-100 to the cell lysate.For 1 mL of total lysate, prepare a mixture by adding 2 µL of a 350 mM stock of CuSO4  in water, 1 µL of 200 mM TBTA stock in DMSO, and 3.5 µL of 0.5 M TCEP stock in water. Mix and incubate at RT for 10 min, to form the click chemistry catalyst in situ. Note: The remaining 1 mL of lysate can be reserved for 1–2 days at -20 °C, in case repeat analysis is required; if the remaining lysate is not required, it can be discarded.  Add 1 µL of 25 mM biotin-alkyne in DMSO to the mixture from  step B1c, then add this mixture to 1 mL of the cell lysate from  step B1b. Incubate with rotation at RT for 6 h, to derivatize AHA-labeled proteins with biotin via click chemistry.Transfer 100 µL of the click chemistry reaction to a new 1.5-mL tube, add 400 µL of methanol, and vortex for 5 s.Add 100 µL of chloroform and vortex for 5 s.Add 300 µL of ddH2O and vortex for 5 s, followed by centrifugation at 18,407  × g  at RT for 2 min.",
    "Remove and discard the top layer, add 400 µL of methanol to the remaining bottom layer, vortex for 5 s, and centrifuge at 18,407  × g  at RT for 2 min. You should observe the formation of a protein pellet.Remove the supernatant without disturbing the pellet, and dry it at RT for 5 min. To resuspend the pellet containing labeled cellular proteins, add 50 µL of 1× SDS loading buffer, then boil at 100 °C for 10 min.Load the resuspended labeled proteins onto a 12% SDS-PAGE gel, followed by transfer to nitrocellulose, and western blotting with streptavidin-HRP, as previously described (Cao et al., 2021). Perform Ponceau staining of the membrane after transfer, to confirm equal loading.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230105/20230105040656_3267.jpg Figure 1. AHA labeling validation with streptavidin-HRP blotting.  (A) Experimental scheme for AHA labeling validation.  (B)  Streptavidin-HRP blotting reflects AHA labeling, and Ponceau staining served as a loading control. Note: If AHA labeling is inefficient, AHA treatment time and concentration can be optimized.  If the AHA labeling is successful in the replicate sample, add 2 mL of lysis buffer (see Recipes) to an AHA labeled HEK 293T cell pellet from a 15-cm dish from  step A4  and vortex, followed by boiling at 100 °C for 10 min. Repeat vortexing and boiling three to four times, until the cell lysate becomes clear. We typically aliquot the lysate into four 1.5-mL Eppendorf tubes for the boiling step, to fit the wells of our heating block, then recombine the lysates for  step B3c  below, but this can be adapted to any appropriate tube size or boiling apparatus.Size select to enrich small proteins with two C8 columns, as follows (Ma et al., 2016):Add 500 µL of methanol to each of the two C8 columns, centrifuge at 200  × g  for 1 min, and discard the flow-through.",
    "Add 1 mL of 0.25 M TEAF pH 3.0 (see Recipes) to each of the two C8 columns, then centrifuge at 200  × g  for 1 min, and discard the flow-through.Load 1 mL of the cell lysate from step  B2  to each of the two C8 columns (e.g., combined lysates from two Eppendorf tubes for each C8 column), then centrifuge at 200  × g  for 2 min, and discard the flow-through.Add 1 mL of 0.25 M TEAF pH 3.0 to each of the two C8 columns, then centrifuge at 200  × g  for 2 min, and discard the flow-through.Add 0.5 mL of 3:1 ACN:0.25 M TEAF pH 3.0 to each of the two C8 columns, centrifuge at 200  × g  for 2 min, and retain the eluate. Repeat this step one more time, and combine all eluates from all columns.Speedvac the solution to dryness at RT. This step may take up to 3 h. Click capture on beads  Wash 50 µL of DBCO bead slurry with 1 mL of RIPA buffer (see Recipes), place the tube on a magnetic holder, remove and discard the RIPA buffer.Add 1.2 mL of RIPA buffer to the size selected cell lysate from  step B3f  , vortex for 10 s, then resuspend the washed DBCO beads in the cell lysate. Rotate at RT for 1 h, then place the tube on a magnetic holder, remove and discard the supernatant.Wash the DBCO beads as follows:Add 1 mL of RIPA buffer to the beads, rotate at RT for 3 min, then place the tube on a magnetic holder, and remove the supernatant.Add 1 mL of 1 M KCl in ddH2O to the beads, rotate at RT for 3 min, then place the tube on a magnetic holder, and remove the supernatant.Add 1 mL of 0.",
    "1 M Na2CO3  in ddH2O to the beads, rotate at RT for 1 min, then place the tube on a magnetic holder, and remove the supernatant.Add 1 mL of 2 M urea in ddH2O to the beads, rotate at RT for 1 min, then place the tube on a magnetic holder, and remove the supernatant.Add 1 mL of RIPA buffer to the beads, rotate at RT for 1 min, then place the tube on a magnetic holder, and remove the supernatant. Repeat this step one more time.Add 1 mL of 1× PBS to the beads, rotate at RT for 1 min, then place the tube on a magnetic holder, and remove the supernatant. Repeat this step five more times. On-bead digestion  Add 400 µL of 6 M urea in 1× PBS to the DBCO beads from  step C3f  , then add 20 µL of 0.2 M TCEP in ddH2O.Incubate the beads at 60 °C for 10 min, then cool down to RT.Add 20 µL of 0.4 M 2-iodoacetamide in ddH2O, then incubate with shaking at 37 °C for 15 min.Dilute the solution by adding 950 µL of 1× PBS, then place the tube on a magnetic holder, and remove the supernatant.Add 300 µL of a premixed solution of 2 M urea in 1× PBS, with 3 µL of 0.1 M CaCl2  in ddH2O, and 10 µL of 0.5 µg/µL trypsin; incubate in an incubator or water bath at 37 °C for 14–16 h.Place the tube on a magnetic holder, and transfer the supernatant to a new tube. Wash the beads with 50 µL of water twice to liberate any remaining bound peptides, and combine the washes with the supernatant.Add 15 µL of 88%–91% FA to stop the digestion.Speedvac the solution to dryness at RT.",
    "This step may take up to 3 h. Note: Samples can be stored for 1–2 months at -80 °C at this point.   Detergent removal with ethyl acetate  Add 100 µL of 100 mM NH4HCO3  in ddH2O to the digested peptides from  step D8  , and vortex for 10 s.Add 1 mL of water-saturated ethyl acetate (see Recipes) to the digested peptides solution, vortex for 10 s, followed by centrifugation at 18,407  × g  at RT for 30 s. Remove and discard the upper layer. Repeat this step one more time. The remaining bottom layer contains the digested peptides.Speedvac the solution to dryness at RT. This step may take 1 h. De-salt peptides with a C18 spin column  Add 100 µL of 5% ACN + 0.5% TFA in ddH2O to the digested peptides from  step E3, and vortex for 10 s.Add 200 µL of 50% methanol in ddH2O to a C18 spin column, then centrifuge at 200  × g  for 2 min, and discard the flow-through.Add 150 µL of 5% ACN + 0.5% TFA in ddH2O to the C18 spin column, then centrifuge at 200  × g  for 2 min, and discard the flow-through. Repeat this step one more time.Add the digested peptide solution to the C18 spin column, centrifuge at 200  × g  for 2 min, and discard the flow-through.Wash the C18 spin column with 150 µL 5% ACN + 0.5% TFA in ddH2O, centrifuge at 200  × g  for 2 min, and discard the flow-through. Repeat this step one more time.Elute the digested peptides with 45 µL of 70% ACN in ddH2O, centrifuge at 200  × g  for 2 min, and retain the eluate. Repeat this step one more time, and combine the two eluates.Speedvac the solution to dryness at RT. This step may take up to 2 h.",
    "Note: Samples can be stored for 1–2 months at -80 °C at this point.   Mass spectrometry analysis of nascent small proteins  Optional steps: ERLIC fractionation with a PolyWAX LP column using Agilent 1100 HPLC, as shown in Figure 2.Add 55 µL of 85% ACN/0.1% FA in ddH2O to the digested peptides from  step F7, vortex for 10 s, and load 50 µL of this onto a PolyWAX LP column (150× 1.0-mm; 5 µm 300 Å). Retain 10% of the total peptide suspension for prefractionation LC-MS/MS analysis, as a quality control step.Separate the peptides with a 80-min gradient, as follows (solvent A: 80% ACN 0.1% FA in ddH2O; solvent B: 30% ACN 0.1% FA in ddH2O): set the flow rate to 300 μL/min, start with 0% B for 5 min, then 0% B to 8% B over 17 min, 8% B to 45% B over 25 min, and 45% B to 100% B over 10 min. Maintain the isocratic flow at 100% B for 5 min, then gradient from 100% B to 0% B over 10 min, and maintain the isocratic flow at 0% B for 8 min.Collect fractions 1–10 at 1-min intervals, fractions 11–13 at 10-min intervals, and fractions 14–15 at 20-min intervals.Dry the fractions and the 10% unfractionated peptides in the Speedvac, and re-suspend each sample in 10 µL of 0.1% FA in ddH2O before LC-MS/MS analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4585/bioprotoc-13-01-4585-g002.jpg Figure 2. ERLIC fractionation of digested peptides  If ERLIC fractionation has not been performed, add 35 µL of 0.1% FA in ddH2O to the digested peptides from  step F7. Centrifuge at 18,407  × g  and 4°C for 30 min, and discard the pellet.",
    "If ERLIC fractionation has been performed, inject 5 µL of each fraction, as well as 5 µL of 10% unfractionated peptides, directly on a prepacked column attached to a nanoAcquity UPLC (Waters) in-line with a Thermo Scientific Q Exactive Plus Hybrid QuadrupoleOrbitrap mass spectrometer. If ERLIC has not been performed, 5 µL of the total digested peptides is injected.Separate the peptides with a 130-min gradient as follows (solvent A: 0.1% FA in ddH2O; solvent B: ACN with 0.1% FA in ddH2O): set the flow rate to 0.1 μL/min, start with 1% B for 40 min, then gradients 1% B to 6% B over 2 min, 6% B to 24% B over 48 min, 24% B to 48% B over 5 min, and 48% B to 80% B over 5 min. Maintain the isocratic flow at 80% B for 5 min, then gradient from 80% B to 1% B over 5 min, and maintain the isocratic flow at 1% B for 10 min.Set the mass range to 300–1,700 m/z with a resolution of 70,000, and the automatic gain control (AGC) target to 3 × 106. Collect the MS/MS data using a top 10 high-collisional energy dissociation (HCD) fragmentation method in data-dependent mode, with a normalized collision energy of 27.0 eV and a 1.6 m/z isolation window with a 17,500 MS/MS resolution, and a 90 s dynamic exclusion, according to the manufacturer’s instructions. Note: Mass spectrometry parameters may require optimization for the instrument available to the experimenter, for example in consultation with a mass spectrometry core facility."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}