{
  "id": 13147,
  "origin_website": "Jove",
  "title": "Dissection, Immunohistochemistry and Mounting of Larval and Adult Drosophila Brains for Optic Lobe Visualization",
  "procedures": [
    "1. Preparing larval brains for confocal imaging\nDissections\n\tNOTE: Before starting the dissection, prepare the fix (4% formaldehyde in phosphate buffered saline (PBS)) and PBT (0.1-0.3% Triton in PBS) solutions. The fix solution should be placed on ice during the dissection. Although paraformaldehyde (PFA) fixative is used in this protocol, alternative fixing strategies (using PLP20 or PEM21) have been described for specific epitopes. For larval dissections, two pairs of forceps (Dumont #5 or #55s) are needed. See the Table of Materials for more details.\n\t\nStart by filling each well of the dissecting dish with 400 µL of 1x PBS. Use a pair of forceps to gently pick wandering third-instar larvae crawling on the inside of the vial. Place larvae in the first well of the PBS-filled dish.\nTake one larva and transfer it to the middle well. Using the non-dominant hand, hold the body of the larva down at the base of the well.\nWith the dominant hand, gently grasp the larval mouth hook and pull away from the body. The larval brain should be attached to the mouth hook and other accessory tissue and will come off as the tissue is pulled away.\nRemove accessory imaginal discs and transfer the larval brain to the third well of the dissection dish. The imaginal discs are epithelial tissues surrounding the larval brain, which generate adult structures such as the antennae, eyes, legs and wings20. If left on the tissue, the imaginal discs may obstruct proper immunostaining of the larval brain.\n\t\t\nTo remove the imaginal discs, use a pair of forceps to firmly grip the brain via the ventral nerve cord. Using another pair of forceps, gently pluck away the discs.",
    "Remove the eye disc carefully, since it wraps over the surface of the brain lobes. To remove the eye disc, use a pair of forceps to hold the brain against the base of the dish. Instead of holding the brain via the ventral nerve cord, use the forceps to lightly grasp the brain lobe being careful to not squeeze the lobe. Using another pair of forceps, gently pull away the eye disc.\n\t\t\tNOTE: The eye imaginal disc will eventually give rise to photoreceptors of the retina. For those interested in studying neural connectivity between the retina and optic lobe, the eye disc can be left on the brain. However, for those solely interested in optic lobe structures, it is recommended to remove the eye disc as it may hinder image quality due to its location on the surface of the brain.\nRepeat steps 1.1.2‒1.1.4 until a sufficient number of brains have been collected (or 30 min of dissection time have elapsed). Dissections should not go longer than 30 min to ensure the integrity of the tissue is not compromised.\nOnce the dissection period is over, use a P200 pipette to carefully remove PBS from the third well. Ensure that a small volume of liquid remains in the well to keep the brains immersed.\n\t\tNOTE: It is crucial to keep the brains immersed in liquid at all points of the protocol. If the tissue dries out, the quality of the stain may be compromised by unwanted autofluorescence in the confocal image.\nAdd 500 µL of the cold fix solution into the third well. Use a pair of forceps to stir the liquid gently, allowing the brains to swirl in the dish. Cover the dish with a glass slide and place it on ice for 30 min to allow for tissue fixation.",
    "Remove the fixation solution and wash the brains with 400 µL PBT, 5 times.\n\t\tNOTE: Triton is a detergent in PBT that keeps the brains from sticking to each other or the dish, and prepares the tissue for optimal antibody penetration.\nImmunohistochemistry \n\tNOTE: There are several primary antibodies available from the Developmental Studies Hybridoma Bank (DSHB) that can be used to label specific optic lobe structures or cell types. DE-Cadherin labels the IPC and OPC neuroepithelia, Bruchpilot (Brp) marks the developing neuropil and Dachshund labels lamina and lobula neurons (as well as a small subset of medulla neurons). Additionally, Elav can be used to label neurons, Prospero to mark ganglion mother cells and Repo to identify glia.\n\t\nPrepare the primary antibody solution by adding antibodies to PBT upto a total volume of 100 µL. A blocking agent (10% normal goat serum) can be used to prevent non-specific binding between the primary antibody and tissue20,22,23. The antibodies used in this protocol specifically label brain tissue without the need for blocking agents.\nRemove the final post-fixation wash and add the primary antibody solution. Ensure that there is only a small amount of PBT in the well prior to adding the antibody solution. After adding the solution, gently stir the brains with forceps 5‒10 times. Cover with a glass slide, seal with laboratory film and incubate at 4 °C overnight.\n\t\t\nAlternatively, if a refrigerated orbital shaker is available, place the dish on the shaker to optimize the overnight incubation.\n\t\t\tNOTE: The primary antibody incubation and all subsequent steps can alternatively be performed in a 1.5 mL microcentrifuge tube. The volume of primary and secondary incubations can remain 100 µL, but the wash steps should be performed with 800 µL or more of PBT.",
    "After incubation, wash out the primary antibodies with PBT as in step 1.1.8 of the previous section.\n\t\tNOTE: The primary antibody solution should be saved and stored at 4 °C as it can be reused for subsequent experiments. Many primary antibodies can be reused up to four times.\nAdd 400 µL of PBT to the brains for a final wash. Cover the dish with a slide, seal with laboratory film and place it on an orbital shaker at low speed (100 rpm) and room temperature (RT) for ~4 h.\n\t\tNOTE: The protocol can be paused here. Brains can be left in wash for 2‒3 days at 4 °C.\nPrepare the secondary antibody solution in a total volume of 100 µL.\n\t\tNOTE: In this protocol, all secondary antibodies are used at a dilution of 1:500, without blocking agents.\nRemove the PBT wash from the well and add the secondary antibody solution. Mix the tissue in the solution using a pair of forceps. Cover the dish with a slide and laboratory film. Place the dish on an orbital shaker at RT for a minimum incubation period of 2 h. Since secondary antibodies contain light-sensitive fluorophores, cover the dish with aluminum foil.\n\t\tNOTE: The protocol can be paused here. Brains can be left in secondary antibody solution overnight at 4 °C.\nWash out the secondary antibodies as described in step 1.2.3. Add 400 µL of PBT to the brains for a final wash. Cover the dish with a slide, seal with laboratory film and foil. Place the brains on a shaker at RT for 4 h.\n\t\tNOTE: The protocol can be paused here. Brains can be left in wash for 2‒3 days at 4 °C.\nMounting",
    "Remove final PBT wash and replace with two drops of fluorescence-safe mounting media. Place a drop of the mounting media onto the center of a slide.\nTransfer brains from the well to the drop on the slide using forceps. To avoid damaging the optic lobes, the brains can be held by the ventral nerve cord while transferring to the slide.\nMount the brains as per the mounting strategies that follow (Figure 1A).\n\t\t\nAnterior side up\n\t\t\tNOTE: For those interested in visualizing the anterior medulla, lamina or lobula plug, this mounting orientation is ideal. The best way to distinguish the anterior versus posterior mounts is by examining the position of the ventral nerve cord relative to the brain lobes.\n\t\t\t\nUse the anterior orientation, to observe the ventral nerve cord projecting out over the lobes (Figure 1B).\nPosterior side up\n\t\t\tNOTE: This orientation is recommended for those interested in visualizing the posterior tips of the OPC (pOPC) or IPC 10,11.\n\t\t\t\nUse the posterior orientation, to view the ventral nerve cord projecting out from under the brain lobes (Figure 1C).\nLateral view\n\t\t\tNOTE: A lateral mounting orientation is used to visualize the crescent of lamina, medulla or lobula plug neurons in both the dorsal-ventral and anterior-posterior axes in a single plane (Figure 1G).\n\t\t\t\nFor a lateral mount, split the brain lobes from each other to fall flat on their side, with the lamina and lobula plug facing up.",
    "Using two pairs of sharp forceps, split the ventral nerve cord in half, starting from where the cord attaches to the lobes. Note that the two lobes are already separate from one another, with the ventral nerve cord holding them intact. Thus, split the ventral nerve cord down from the cleavage point between the lobes, to separate them. Then flip each brain lobe and attached ventral nerve cord on their sides with the lateral surfaces facing up.\n\t\t\t\tNOTE: For lateral view mount, it is recommended to use a tungsten needle with a fine tip to orient the brain lobe on its side. To clearly visualize the orientation of the lobes and the direction of the ventral nerve cord when mounting, the microscope lighting can be adjusted. If using a gooseneck LED light source, the goosenecks should be positioned parallel to the surface of the slide for clear visibility. Also, the lighting intensity can be increased or decreased to enhance contrast between the brain structures and provide clarity while mounting.\nPlace a small drop of PBS on either side of the mounting media containing the brains. Place one cover slip onto each drop, and a final coverslip over the brains. The right and left edges of the top coverslip should rest on the two other coverslips (Figure 1A).\n\t\tNOTE: Prior to placing a coverslip over the brains, a bridge must be built. Larval brains are approximately 200 µm thick, and thus, to keep the integrity of the tissue, a bridge is created that increases the distance between the cover slip and the surface of the slide.\nSeal the edges of the bridge with nail polish to secure the mounted brains.\nImage the brains using confocal microscopy.\n2. Preparing adult brains for confocal imaging\nDissections",
    "NOTE: Adult brain dissections are more challenging than larval brains and require careful handling. It is strongly recommended to use at least one pair of ultra-fine forceps (Dumont #55) for this part of the protocol.\n\t\nAnesthetize flies with CO2, using either a needle or flypad, and place them on a laboratory wipe or paper towel over ice (to keep them anesthetized).\nAdd 400 µL of PBS to all three wells of the glass dish. Use a pair of forceps to gently grab one adult fly by the wings and place it into the first well of the dish.\nUse a pair of forceps held in the non-dominant hand to hold the thorax of the fly against the base of the well. With the dominant hand, gently pull off the head from the rest of the body.\nTransfer the head into the second well. Often, the head will float in the PBS and can be difficult to handle. Use a pair of forceps to hold it down against the base of the well by the proboscis.\nPeel away a region of the cuticle between the eyes using both forceps. Since the brain sits right below the cuticle, be as gentle as possible to prevent damaging the underlying tissue. Continue to peel cuticle away one piece at a time, until the brain is exposed. Remove any accessory tissue (i.e., retina, trachea, air sacs) that may remain attached to the brain.",
    "NOTE: Removal of the retina has been described in previous protocols22,24, but the lamina can also be separated from the rest of the optic lobe. This is useful for those wanting to study the medulla or lobula complex, since the lamina sits at the surface and may obstruct visualization of these other optic lobe neuropils when imaging. To remove the lamina, use a pair of sharp forceps to gently pull at the indentation between the lamina and medulla neuropils. The lamina will slowly begin to peel away from the medulla. Repeat this motion until the entire lamina is removed. During this process it is important to maintain a firm grip of the brain. Use another pair of forceps to hold the brain against the base of the dish by positioning it so that the top and bottom of the central brain fit perfectly between the tips of the forceps. A firm grip around the central brain will prevent unwanted damage to the optic lobe.\nTransfer the clean brain to the third well. Repeat steps 2.1.2‒2.1.6 until a sufficient number of brains are obtained or a maximum dissection period of 30 min has elapsed.\nRemove the PBS in the third well and add 500 µL of fix solution. Ensure that the brains do not dry out here or during any wash steps as this will lead to background fluorescence in the confocal images. Cover the dish with a glass slide and allow the brains to incubate in fix for 20 min at RT.\nAfter fixation, wash the brains with 400 µL of PBT, 5 times.",
    "NOTE: The protocol can be paused here. Brains can be covered with a glass slide and laboratory film and left in wash for 2‒3 days at 4 °C. For researchers new to the system, it may be easier to leave accessory tissue on the brains before and during fixation. This will allow researchers to maximize the number of brain samples obtained in a given dissection period. After the tissue has been fixed and washed, the brains can be carefully cleaned before adding primary antibody solution. Adult brains with accessory tissue tend to float, and therefore risk drying out. As a result, it is recommended to use a pair of forceps to carefully pool all of the brains into the center of the dish upon adding fix solution, and to clean the brains immediately after fixation.\nImmunohistochemistry \nPerform immunohistochemistry as described for larval brains in section 1.2.\nUseful primary antibodies from the DSHB include those that are mentioned in the protocol of larval immunohistochemistry in section 1.2. See the Table of Materials for a complete list of antibodies and corresponding dilutions.\n\t\tNOTE: Extra care must be taken during the wash steps for adult brains, since they may float to the surface of the wash solution and risk drying out on the sides of the well when the solution is removed (which will lead to background fluorescence). A good practice is to hold the pipette in one hand to add or draw away liquid, and a pair of forceps in the other to keep the brains submerged.\nMounting \nPrior to the mounting step, perform a final wash with PBS (instead of PBT). PBS causes the brains to become slightly sticky, which allows them to remain in the desired orientation during mounting.",
    "Remove the final wash and replace with three drops of fluorescence-safe mounting media. Place a drop of the mounting media onto the center of a microscope slide.\nTransfer brains from the well to the drop on the slide using forceps. To avoid damaging the optic lobes and prevent the tissue from drying out, carefully retrieve a brain via capillary action. Slowly close a pair of forceps around a brain until a small volume of liquid containing the brain is drawn up between the tips.\n\t\tNOTE: When transferring the brain to the slide, be careful to not close the forceps as this will damage the brain. Alternatively, a P200 pipette can be used to transfer the brains. Cut off the end of the tip to widen the opening and pre-rinse with PBT to prevent the brains from sticking to the inside of the tip.\nMount the brains as per the following strategies (Figure 2A).\n\t\t\nAnterior side up\n\t\t\tNOTE: To visualize lamina and medulla neurons, orient the brain with the anterior side up (Figure 2B). This can be achieved by examining the anatomy and curvature of the central antennal lobes.\n\t\t\t\nWith a pair of forceps, gently turn the brain on its side to examine both the anterior and posterior sides. Observe that on the anterior side, the curvature of the brain is pronounced and the antennal lobes protrude slightly outward from the center.\nPosterior side up\n\t\t\t\nPosition the brains with the posterior (flat) side facing up and the antennal lobes down (Figure 2C).\n\t\t\t\tNOTE: This will bring the lobula and lobula plate closer to the imaging surface and is ideal for those interested in visualizing lobula complex neurons.\nHorizontal view",
    "NOTE: To visualize all optic lobe neuropils simultaneously, use a horizontal mounting strategy (Figure 2G). In this orientation, neuronal cell bodies, axonal trajectories and dendritic arborizations can be visualized in the same plane.\n\t\t\t\nInitially, orient the brain with the anterior side up. With a tungsten needle, gently tilt the brain 90° upwards so that it sits on its dorsal side with its antennal lobes facing outwards. Check that both the anterior and posterior sides of the brain are visible in this orientation.\nInstead of a cover slip bridge, use clay to elevate the cover slip from the slide. The use of clay allows for re-mounting of the brains after imaging (described in the discussion section).\n\t\t\nPlace a small piece of clay on each corner of a cover slip. Ensure that each piece of clay is relatively the same thickness. The pieces of clay should be between 0.5–1 mm in thickness. Gently place the coverslip over the brains and apply slight pressure to the corners. The coverslip should immediately catch the liquid and form a seal. The slide is now ready for imaging.\n\t\t\tNOTE: For long-term storage of the slide, it is recommended to seal the coverslip with nail polish and store at 4 °C away from light.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}