{
  "id": 8702,
  "origin_website": "Jove",
  "title": "2 in 1: One-step Affinity Purification for the Parallel Analysis of Protein-Protein and Protein-Metabolite Complexes",
  "procedures": [
    "Preparation of transgenic Arabidopsis cell culture lines, including cloning, transformation, selection, and growth conditions can be found in17. Note that EV control lines are recommended to correct for false positives. Prior to the experiment, confirm the overexpression of the bait protein by western blot analysis, e.g. using IgG antibodies against the G-protein part of the tandem affinity tag. It is important to separate the growth media from plant cell culture material.\n1. Preparing Plant Cell Material Prior to the Experiment\nGrow a PSB-L A. thaliana cell culture line overexpressing the protein of interest18.\n\t\nPrepare MSMO medium, which contains 4.43 g/L MSMO mixed with 30 g/L sucrose. Adjust the pH of the buffer to 5.7 with 1 M KOH and autoclave the solution. Prior to the experiment, supplement the medium with 0.5 mg/L α-naphthaleneacetic acid, 0.05 mg/L kinetin and 50 μg/mL kanamycin.\nCultivate transformed plant cell cultures in 50 mL of MSMO medium in a 100 mL flask on an orbital platform shaker with gentle agitation (130 rpm). Grow cells in a culture room at 20 °C and light intensity equal to 80 μmol m-2 s-1.\nSubculture cells into fresh media every 7 days, diluting them 1:10.\nCollect cells at the logarithmic growth phase using a glass funnel combined with a vacuum pump, using a nylon mesh as filter. Wrap the infiltrate in aluminum foil and freeze in liquid nitrogen.\n\tCaution: Remember that liquid nitrogen is extremely cold. Incorrect handling can cause burns. Wear appropriate personal protective equipment, including thermally insulated gloves, protective glasses, and a lab coat.\n2. TAP Protocol\nNote: The following step is adapted from Maeda et al. 201411 and Van Leene et al. 201117.",
    "Homogenize harvested and frozen plant cell culture material using a mixer mill (2 min at 20 Hz) or mortar and pestle to obtain fine powder. Aliquot 3 g of the ground material (corresponding to around 90 mg of total protein) per sample. Avoid thawing of the sample during this step by using liquid nitrogen pre-chilled equipment.\n\tNote: Store ground plant material in 50 mL tube at –80 °C to the beginning of an AP procedure.\nTriturate the sample in a liquid-nitrogen-precooled mortar with 3 mL of ice-cold lysis buffer (0.025 M Tris–HCl pH 7.5; 0.5 M NaCl; 1.5 mM MgCl2; 0.5 mM DTT; 1 mM NaF; 1 mM Na3VO4; 100x diluted commercial protease inhibitor cocktail; 1 mM PMSF) until the material thaws. Once the sample thaws, immediately proceed to the next step.\n\tNote: Prepare the lysis buffer fresh. Introduce blank samples at this step. Detergents are not recommended as they can cause problems in MS detection.\nTo remove cellular debris, divide the material into 2 mL microcentrifuge tubes and centrifuge at 20,817 x g for 10 min at 4 °C. Collect 3 mL of the clear lysate in a 15-mL conical centrifuge tube.\nDuring centrifugation step, equilibrate IgG-Sepharose beads. Aliquot 100 µL of the beads per sample and wash them with 1 mL of lysis buffer. Vortex to resuspend beads and flash-spin. Discard the lysis buffer and repeat the step twice. Resuspend beads in 400 µL of lysis buffer.\nAdd beads to the collected plant lysate and incubate the mixture on a rotating wheel for 1 h at 4 °C.",
    "Transfer the mixture into a syringe combined via Luer-lock cap with a spin column with filter pore size 35 µm. Apply pressure to pass the lysate through. Beads with attached complexes will remain on the filter, while the lysate will go through.\n\tNote: Optionally, use a vacuum manifold system. Make certain to apply gentle pressure so as not to harm the beads.\nWash beads at first with 10 mL of washing buffer (0.025 M Tris–HCl pH 7.5; 0.5 M NaCl), and then with 1 mL of elution buffer (10 mM Tris–HCl pH 7.5; 150 mM NaCl; 0.5 mM EDTA; 1000x diluted E64 and 1 mM PMSF). Perform the washing using a syringe attached to the column or vacuum manifold system.\n\tNote: When using a vacuum manifold system make certain to apply gentle pressure so as not to harm the beads.\nIncubate beads with the 400 µL of elution buffer containing 50 U of an improved version of the tobacco etch virus (AcTEV) protease. Use table shaker at 1,000 rpm for 30 min at 16 °C.\n\tNote: Remember to use a plug to close the column at the bottom adding the elution buffer.\nAdd an extra portion (50 U) of the enzyme into the column and incubate the mixture for the next 30 min under the same, described above, conditions.\nCollect the eluate in a 2 mL microcentrifuge tube either by centrifugation (1 min, 20,817 x g) or by vacuum manifold. To remove remaining complexes, introduce an additional elution step using 200 µL of elution buffer.\n\tNote: Store the sample at –20 °C or –80 °C, or immediately proceed with the protein and metabolite extraction step. Thaw frozen samples on ice.\n3. Western Blot Analysis",
    "To confirm the presence of the bait protein in the collected eluate use 10 µL of the protein–metabolite-containing eluate to perform SDS–PAGE and western blot analysis. To identify the protein of interest, use mouse primary antibodies against streptavidin-binding protein (1:200), a part of the TAP tag remaining after TEV protease cleavage, as described in Van Leene et al. 201117. Next, use secondary goat anti-mouse antibodies coupled with HRP.\n4. Metabolite and Protein Extraction\nNote: This protocol is adapted from Giavalisco et al. 201116.\nNote: From this step onwards use UPLC–MS–grade solutions.\nAdd 1 mL of methyl tert-butyl ether (MTBE)/methanol/water solvent (3:1:1) to the collected eluate and mix the sample by inversion. Make sure that the solvent is cooled to –20 °C prior to the extraction step.\n\tCAUTION: MTBE and methanol are harmful substances. Perform the extraction step under the fume hood and wear appropriate personal protection equipment, e.g., gloves.\nAdd 0.4 mL of methanol:water 1:3 solution to each sample and mix the content of the sample by inversion.\n\tNote: Supplementation of the mixture with methanol:water solution results in phase separation. The upper phase contains lipids, lower phase contains polar and semi-polar metabolites, and proteins can be found in the pellet.\nTo separate phases, centrifuge the sample at 20,817 x g for 2 min at room temperature, then collect the upper phase for lipid measurements (not done in this protocol) using a manual liquid handling pipette with 1 mL volume capacity.\nAdd 0.2 mL of methanol and mix by inversion.\nCentrifuge the sample at 20,817 x g for 2 min at RT, then collect the polar phase for metabolite measurements (polar and semi-polar compounds). To avoid disturbing the protein pellet, leave around 50 µL of the liquid phase at the bottom of the tube.",
    "Dry collected samples for metabolite measurements overnight in a centrifugal evaporator. Avoid over-drying the protein pellets by removing samples from the evaporator after 30–60 min.\n\tNote: Store samples at –20 °C or –80 °C, or immediately proceed with the preparation of proteins for LC–MS/MS analysis.\n5. Preparing Samples for Proteomic Analysis\nNote: This step is adapted from Olsen et al. 200419 and the technical manual of the Trypsin/Lys-C Mix (see Table of Materials).\nPerform enzymatic digestion of the sample.\n\tCaution: Solvents used during enzymatic digestion and desalting of the sample are harmful. Work under the fume hood and wear appropriate personal protection equipment, e.g., gloves.\n\t\nDissolve protein pellet in 30 µL of freshly prepared denaturation buffer (40 mM ammonium bicarbonate containing 2 M thiourea/6 M urea, pH 8). To achieve better protein solubility, perform a 15-min sonication step. Repeat the step until the pellet dissolves.\nCentrifuge the sample at 20,817 x g for 10 min at 4 °C, then transfer the supernatant to a new microcentrifuge tube.\nDetermine protein concentration using the Bradford protein assay.\nFor further analysis, aliquot a volume equivalent to 100 µg of protein and fill the sample up to 46 µL with denaturation buffer.\nAdd to the sample 2 µL of freshly prepared reduction buffer (50 mM DTT dissolved in H2O) and incubate for 30 min at room temperature.\nTreat the sample with 2 µL of freshly prepared alkylation buffer (150 mM iodoacetamide dissolved in 40 mM ammonium bicarbonate buffer) and incubate the mixture in the dark for 20 min at room temperature.\nDilute the sample with 30 µL of 40 mM ammonium bicarbonate buffer and add 20 µL of LysC/Trypsin Mix.\nAfter 4 h incubation at 37 °C, dilute the sample with 300 µL of 40 mM ammonium bicarbonate buffer.",
    "Continue with overnight incubation at 37 °C.\nAcidify the sample with approximately 20 µL of 10% trifluoroacetic acid (TFA) to obtain pH < 2. Check sample pH using a pH strip.\n\t\tNote: Store the sample at –20 °C or proceed to the next step.\nDesalt the digested proteins.\n\tNote: Preferably, use a vacuum manifold system. Avoid over-drying of the column.\n\t\nRinse the C18 SPE column (see Table of Materials) with 1 mL of 100% MeOH and then with 1 mL of 80% acetonitrile (ACN) containing 0.1% TFA diluted in water. Use, here and in further protein-desalting steps, a vacuum manifold system to speed up the process. Avoid over-drying of the column.\nEquilibrate the column by washing it twice with 1 mL of 0.1% TFA diluted in water.\nLoad the sample onto the column. Rinse tube with additional 200 µL of 0.1% TFA and transfer the solution on the column. Run the solutions through the column.\nWash the column twice with 1 mL of 0.1% TFA.\nElute desalted peptides from the column with 800 µL of 60% ACN, 0.1% TFA solution. Dry the collected fraction in a centrifugal evaporator, avoiding over-drying of the protein fraction by removing samples from the evaporator after 30–60 min.\n\tNote: Store samples at –20 °C or –80 °C or immediately proceed to the next step. In subsequent steps, keep samples on ice. \n6. Measurement Prepared Protein Samples Using UPLC–MS/MS.\nNote: Prior to proteomic and metabolomic measurements, filter (0.2 µm pore size) and degas all buffers using a vacuum pump for 1 h.",
    "Resuspend dried peptide pellet stored in 2 mL microcentrifuge tube in 50 µL of buffer C (3% v/v ACN, 0.1% v/v formic acid) using manual liquid handling pipette with 200 µL volume capacity. Sonicate samples for a 15 min in an ultrasonic bath with 35 kHz ultrasonic frequency.\n\tCaution: ACN and formic acid are harmful substances. Work under the fume hood and wear appropriate personal protection equipment, e.g., gloves.\nCentrifuge the sample at 20,817 x g for 10 min at 4 °C, then transfer 20 µL of the supernatant to a glass vial.\nSeparate digested peptides using a C18 reversed-phase column connected to a liquid chromatography and acquire mass spectra using a mass spectrometer.\n\t\nSeparate on the column 3 µL of the sample using a 300-nl/min flow rate. For a mobile phase, use buffer C and D (63% v/v ACN, 0.1% v/v formic acid), forming a gradient ramping from 3% ACN to 15% ACN over 20 min and then to 30% ACN over the next 10 min.\n\t\tNote: Store the rest of the sample at –20 °C or –80 °C up to few months. Prior to proteomic measurement, refreeze the sample on ice.\nWash contaminants out for 10 min using 60% ACN and equilibrate the column with 5 µL of buffer C before measurement of the next sample.",
    "Gain mass spectra using data-dependent MS/MS method with resolution set at 70,000, AGC target of 3e6 ions, maximum injection time of 100 ms, and an m/z ranging from 300 to 1600. Acquire maximum of 15 MS/MS scans at a resolution of 17,500, AGC target of 1e5, maximum injection time of 100 ms, underfill ratio of 20%, with an isolation window of 1.6 m/z and m/z ranging from 200 to 2000. Enable apex trigger (6–20 s), set dynamic exclusion to 15 s, and exclude charges of 1 and > 5.\n7. Processing of Proteomic Data\nDownload the newest Arabidopsis thaliana proteome database from http://www.uniprot.org/ and include contaminant database. Analyze raw data obtained from the LC–MS runs using MaxQuant with the integrated Andromeda peptide search engine using default setting with enabled LFQ normalization20,21,22. Find detailed information about parameters used in Table S1.\nOpen the “protein groups.txt” output file. For further analysis, filter for protein groups identified with at least two unique peptides. Remove protein groups defined by MaxQuant as potential contaminants and filter for A. thaliana proteins (ARATH in Fasta headers column) present in database.\nTo test the significance of protein enrichment between samples, use LFQ normalized intensities and perform unpaired, two-tailed Student's t-test followed by multiple comparison correction (e.g. Benjamini & Hochberg false discovery rate (FDR) correction or Bonferroni correction).\n\t\nCalculate p-value by comparing LFQ intensities obtained for EV control and NDPK1. Filter out all undetermined values. Sort p-values in ascending order and use R script or online calculator (e.g., https://www.sdmproject.com/utilities/?show=FDR) to compute FDR correction. Filter for FDR values below 0.1.\n\t\tNote: Consider the form of data analysis suitable for the research. For quantitative studies (analysis of protein enrichment between samples) use the “LFQ intensity” value, whereas for qualitative research (presence or absence of particular protein) choose the “Intensity” value.",
    "Filter for protein groups that are more abundant in NDPK1 comparing to EV control. Determine localization of potential protein partners using the SUBA database23 and correct for protein co-localized with NDPK1.\n8. Measurement of Samples Containing Polar Phase Using UPLC–MS.\nResuspend dried polar phase from step 4.5 in 200 µL of water and sonicate the sample for 5 min.\nCentrifuge the sample at 20,817 x g for 10 min at 4 °C, then transfer the supernatant to a glass vial.\n\tNote: Store the rest of the sample at –20 °C or –80 °C for up to several months. Prior to metabolomic measurement, refreeze the sample on ice.\nPerform a separation step using UPLC coupled to C18 reversed-phase column and acquire mass spectra with MS.\n\t\nLoad onto the column 2 µL of the sample per injection for each ionization mode (positive and negative) and separate the fraction using 400 µL/min flow rate. To create the required gradient for metabolite measurement, prepare mobile phase solution as follows: buffer A (0.1% formic acid in H2O) and buffer B (0.1% formic acid in ACN).\nSeparate metabolites at 400 µL/min and the following gradient: 1 min 99% of buffer A, 11-min linear gradient from 99% of buffer A to 60% of buffer A, 13-min linear gradient from 60% of buffer A to 30% of buffer A, 15-min linear gradient from 30% of buffer A to 1% of buffer A, hold 1% concentration until 16 min. Starting from 17 min, use linear gradient from 1% of buffer A to 99% of buffer A. Re-equilibrate the column for 3 min with 99% concentration of buffer A before measurement of the next sample.",
    "Acquire mass spectra covering mass range between 100 and 1500 m/z with resolution set to 25,000 and loading time restricted to 100 ms. Set AGC target to 1e6, capillary voltage to 3kV with a sheath gas flow and auxiliary gas value of 60 and 20, respectively. Set capillary temperature to 250 °C and skimmer voltage to 25V.\n9. Processing of Metabolomics Data\nProcess collected chromatograms acquired from both ionization modes. Use software to extract mass to charge ratio (m/z), retention time (RT) and intensity of associated peaks, e.g., commercial software (see Table of Materials) or alternative24.\n\t\nStart processing software by double-clicking the .exe file\nCreate new workflow, search for activity “Load from File” and move this activity by “drag and drop” into the blank workflow space. Press the activity with the right mouse button and open settings of the activity.\n\t\t\nIn the tab containing “General” settings, set a name of the experiment in “Name” field and next click “Select files and folders” and mark raw chromatograms.\nIn the tab containing “Advanced” settings, set “Profile Data Cutoff” to 0 intensity. Click “Apply” and “OK”.\nSearch for and add activity “Data Sweep”. Press the activity with the right mouse button and open settings of the activity.\n\t\t\nIn the tab containing “General” settings, mark “Centroid data” and “MS/MS Data”. Remove all MS/MS data by selecting “Everything” in the selection panel.\nSearch for and add the activity “Chromatogram Chemical Noise Subtraction”. Press the activity with the right mouse button and open settings of the activity.\n\t\t\nIn the tab containing “General” settings, mark “Chromatogram Smoothing” and set number of scans to “3” and “Estimator” to “Moving average”. Set “RT Window” to 51 scans, “Quantile” to 50%, Subtraction “Method” and 750 Intensity “Threshold”.",
    "In the tab containing “Advanced” settings, mark “RT Structure Removal” and set “Minimum RT Length” to 5 scans.\nIn the tab containing “Advanced” settings, mark “m/z Structure Removal” and set “Minimum m/z Length” to 3 points.\nSearch for and add the activity “Chromatogram RT Alignment”. Press the activity with the right mouse button and open settings of the activity.\n\t\t\nIn the tab containing “General” settings, set “Alignment Scheme” to “Pairwise Alignment Base Tree” and “RT Search Interval” to 0.5 min.\nIn the tab containing “Advanced” settings, use default parameters.\nSearch for and add the activity “Peak Detection” in “Chromatogram” group of activities. Press the activity with the right mouse button and open settings of the activity.\n\t\t\nIn the tab containing “General” settings, set “Summation Window” to 0.09 min, “Minimum Peak Size” to 0.03 min, “Maximum Merge Distance” to 5 points and “Merge Strategy” to “Centers”. In the “Peak RT Splitting” box set “Gap/Peak Ratio” to 50%.\nIn the tab containing “Advanced” settings, set “Smoothing Window” to 5 points, “Refinement Threshold” to 80% and “Consistency Threshold” to 1. Set “Center Computation” as “Intensity-weighted” with “Intensity Threshold” set at 70%.\nSearch for and add the activity “Isotope Clustering” in “Chromatogram” group of activities. Press the activity with the right mouse button and open settings of the activity.\n\t\t\nIn the tab containing “General” settings, set “RT tolerance” to 0.015 min and “m/z Tolerance” to 5 ppm.\nIn the tab containing “Envelope fitting” settings, set “Method” as “No Shape Restriction” and “Ionization” as “Protonation (for positive mode) and “Deprotonation” (for negative mode). Set “Minimum and Maximum charge” to 1 and 4, respectively.\nIn the tab containing “Advanced” settings, use default parameters.\nSearch for and add activity “Singleton Filter”.",
    "To export results of data processing, search for and add the activity “Analyst” in “Export” group of activities.\n\t\t\nIn the tab containing “General” settings, set “Type” as “Clusters” and “Observable” as “Summed Intensity”. Choose “Custom Destination” and specify directory of export file.\nIn the tab containing “Advanced” settings, use default parameters.\nAnnotate mass features using in-house reference-compound database.\n\t\nAnalyze one or multiple MS grade reference-compound using UPLC-MS. Use the same LC-MS method for analysis of reference-compounds and metabolites co-purified with protein of interest.\n\t\tNote: For this study, a set of almost 300 dipeptides was analyzed and used as reference-compound library.\nUse analysis (see Table of Materials) software to open raw chromatogram file and search for specific m/z and RT associated with measured reference-compound (see User Guide).\n\t\tNote: Secondary metabolites differ in types of ionization. Check for the presence of the common adducts by searching for ion mass equal to M-1.007276, M+1.007276, M+18.033823 and M+22.989218 for [M-H], [M+H], [M+NH4] and [M+Na], respectively.\nUse spreadsheet to open exported “Analyst” file obtained after processing of chromatograms and search for specific ion mass. Compare RT of the mass feature measured in the experiment and RT of the reference compound. Allow a deviation of 0.005 Da for m/z and 0.1 min for RT.\nTo test the significance of metabolite enrichment co-purified with particular protein between samples (line with overexpressed protein of interest vs EV control), compare peak values using two-tailed non-paired Student's t-test followed by multiple comparison correction (e.g. Benjamini & Hochberg false discovery rate correction or Bonferroni correction)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}