{
  "id": 10003,
  "origin_website": "Jove",
  "title": "3D Bioprinting Phototunable Hydrogels to Study Fibroblast Activation",
  "procedures": [
    "1. PEGαMA synthesis and characterization\nNOTE: Poly(ethylene glycol)-alpha methacrylate (PEGαMA) synthesis was adapted from Hewawasam et al. and performed under moisture-free conditions9.\nWeigh the reactants.\n\tNOTE: For example, weigh out 5 g 10 kg/mol 8-arm PEG-hydroxyl (PEG-OH) and 0.38 g sodium hydride (NaH) (see Table of Materials).\nAdd a stir bar to 250 mL Schlenk flask and purge with argon.\nDissolve the PEG-OH in the lowest volume of anhydrous tetrahydrofuran (THF) required for dissolution within the Schlenk flask.\n\tNOTE: Approximately 80 mL of THF will dissolve 5 g PEG-OH. Add the minimal amount of THF required to dissolve the PEG-OH.\nAdd 3 times molar excess NaH to the reaction mixture and stir at room temperature (RT) for 30 min.\nAdd 6 times molar excess Ethyl 2-(bromomethyl)acrylate (EBrMA, see Table of Materials) dropwise to the Schlenk flask and cover the reaction vessel with aluminum foil to protect it from light. Stir the reaction at room temperature for approximately 48 h.\n\tNOTE: For 5 g PEG-OH and 0.38 g NaH, use 3.68 mL EBrMA for this reaction.\nAdd a few drops of 1 N acetic acid to quench the reaction. Vacuum filter the solution through a filtration aid.\n\tNOTE: Adding acetic acid will produce gas bubbles. Stop adding acetic acid drops when bubbles stop forming as this indicates the mixture has been quenched successfully.\nConcentrate the filtrate on a rotary evaporator and precipitate in 4 °C diethyl ether. Leave precipitate protected from light at 4 °C for 12-18 h.\nAdd a Whatman filter paper to a Buchner funnel. Slowly pour the reaction mixture over the filter paper and use vacuum suction to separate the precipitate from diethyl ether. Collect the precipitate in a dry and clean filtration flask.",
    "Vacuum dry the product for at least 5 h or overnight at room temperature and dissolve in minimum volume of deionized water needed. Transfer the dissolved product into dialysis tubing (see Table of Materials) and dialyze against 3.5 L of deionized water for at least four days. Change the dialysis water every 12 h.\n\tNOTE: The product will appear as completely dry pure white solid powder after vacuum drying.\nFlash-freeze the product and lyophilize for approximately 72 h or until it is completely dry.\nDissolve the product in chloroform D (CDCl3). Run the sample using 1H NMR with a protocol that performs 248 scans with 2.5 s relaxation time.\nVerify the functionalization and purity of the product by calibrating CDCl3 solvent peak to 7.26 PPM. Integrate the peak for PEG backbone protons (d3.71) and calibrate the integration to 114.\nIntegrate the remaining peaks: PEGαMA 1H NMR (300 MHz, CDCl3): d (ppm) 1.36 (t, 3H, CH3-), 3.71 (s, 114H, PEG CH2-CH2), 4.29 (t, s, 4H, -CH2-C(O)-O-O, -O-CH2-C(=CH2)-), 5.93 (q, 1H, -C=CH2), 6.34 (q, 1H, -C=CH2) and compare the integration for the αMA alkene end group peaks to the expected value (1H) based on the PEG backbone calibration (Figure 1).\n\tNOTE: Average the two peaks labeled as \"a\" (Figure 1) and multiply by 100 to obtain the average PEGαMA functionalization percentage.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65639/65639fig01.jpg\nFigure 1: Proton NMR confirmed successful PEGαMA functionalization. NMR analysis was performed in chloroform-D (CDCl3) and showed the functionalization of 96.5%. PEGαMA 1H NMR (300 MHz, CDCl3): d (ppm) 1.36 (t, 3H, CH3-), 3.71 (s, 114H, PEG CH2-CH2), 4.29 (t, s, 4H, -CH2-C(O)-O-O, -O-CH2-C(=CH2)-), 5.93 (q, 1H, -C=CH2), 6.34 (q, 1H, -C=CH2). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65639/65639fig01large.jpg]\n2. Model design and 3D bioprinter setup",
    "NOTE: A commercially available 3D printer (see Table of Materials) was modified by replacing the thermoplastic extruder with a custom-built syringe pump extruder and adapted from Hinton et al.20. Open-source designs are available online: https://3d.nih.gov/users/awfeinberg.\nOpen Fusion 360 software (see Table of Materials) and make a 3D computer-aided hollow cylinder design.\n\tNOTE: A downloadable file that can be used for this step and mimics blood vessel geometry can be found in Supplementary File 1.\nSave the file and open it within the Slic3r software (see Table of Materials). Double check that all the parameters are as desired, and then push the export G-code button. Save the G-code to the computer.\nOpen the Pronterface software (see Table of Materials) and upload the G-code file.\n\tNOTE: The Pronterface software interfaces with the bioprinter and provides sufficient hardware input control. A usable G-code file can be found in Supplementary File 2.\nTransfer the bioprinter and all associated parts into a biosafety cabinet (BSC) using aseptic techniques.\nAssemble a 30 G 0.5\" length blunt needle tip (see Table of Materials) to the printing glass syringe and set aside.\nPlug the power cord of the bioprinter into an outlet. Press the red power button on the front of the bioprinter to turn it on. Connect the universal serial bus (USB) cord between the computer and bioprinter and ensure all wire connections are established and plugged in.\n3. Preparation of the support bath and reagents\nNOTE: Perform all steps in a biosafety cabinet using aseptic techniques.\nPrepare cell culture medium consisting of SmBM Basal Medium (CC-3181) and SmGM-2 SingleQuots supplements (CC-4149), excluding fetal bovine serum (FBS), according to the manufacturer's instructions. Store at 4 °C until use.",
    "Aliquot 50 mL of the cell culture medium and add 1% v/v of FBS (CC-4149) (see Table of Materials) to make a low-serum media. Store at 4 °C until use.\nResuspend the gelatin slurry powder according to the manufacturer's instructions using sterile cell culture media without FBS as the solvent (see Table of Materials). Immediately before use, adjust the final pH of the the gelatin slurry to pH 9 using 2 M potassium hydroxide (KOH) and/or 2 M hydrochloric acid (HCl) to adjust the solution pH as needed using a pH meter.\nFill the desired number of wells of a 24-well plate each approximately half full using 1 mL of gelatin slurry per well using a syringe without the needle.\n\tNOTE: Uniformly fill the center of the wells and confirm that no air pockets exist. Tap the plate to help evenly distribute the microparticle slurry. Adjust the height and volume of slurry per well as needed to accommodate each bioprint size and shape. Users can create a homemade syringe to transfer the gelatin slurry into each well. This can be done by adding a correctly sized syringe plunger into a 50 mL test tube already containing the compacted gelatin slurry at the bottom. While inserting the plunger, insert a small guide wire alongside the test tube to help air escape, and then remove it when the plunger is in contact with the gelatin slurry. Immediately before use, cut off the tip of the test tube with a razor blade to create a hole for the gelatin slurry to extrude out of and press down on the plunger. \nPlace the filled 24-well plate onto the center of the bioprinter stage and secure it to the stage.",
    "NOTE: Figure 2 shows a generic bioprinter setup. Place a rubber band around the print stage to secure a 24-well plate to the platform and prevent movement.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65639/65639fig02.jpg\nFigure 2: Basic 3D bioprinting setup. The bioprinter was set up within a sterile environment such as a biosafety cabinet, and the printhead was assembled so that the glass syringe and needle were vertically lowered into the support bath printing area below. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65639/65639fig02large.jpg]\n4. Cell culture\nNOTE: Perform all steps in a biosafety cabinet using aseptic techniques.\nThaw HPAAF cells (commercially obtained, see Table of Materials) and expand them out in T-75 tissue culture-treated plastic flasks containing SmBM Basal Medium (CC-3181) and all the SmGM-2 SingleQuots supplements (CC-4149) according to the manufacturer's instructions (see Table of Materials).\n\tNOTE: Standard cell culture protocols for adherent cells should be used, maintaining the cells at 37 °C and 5% CO2 and replenishing the media every few days.\nOnce the HPAAFs have reached ~80-90% confluency, aspirate the media and rinse the cells one time with phosphate-buffered saline (PBS).\nAdd approximately 4 mL of prewarmed 0.05% trypsin-EDTA to each T-75 flask. Tilt the flask to ensure that the entire cell culture surface is covered with 0.05% Trypsin-EDTA solution. Incubate the flasks for 3-5 min at 37 °C and check for cell detachment.\nOnce the cells are floating, add at least 6 mL of Dulbecco's Modified Eagle Medium (DMEM) to each flask and transfer the cells into a 50 mL conical tube.\nCentrifuge the cell suspension at 300 x g for 5 min at room temperature to pellet the cells. Aspirate the supernatant from the cell pellet and resuspend the cells in 1-3 mL media with FBS using a 1000 µL pipette, ensuring a single-cell suspension.",
    "Transfer 10 µL of the cell suspension to a microcentrifuge tube. Add 10 µL of Trypan Blue solution and mix well. Use 10 µL of this mixture to count cells within a hemocytometer using an inverted light microscope.\n\tNOTE: To achieve a 4 x 106 cells/mL final bioink concentration, 800,000 fibroblasts were set aside for each 200 µL of bioink.\n5. Preparation of hydrogel bioink\nNOTE: Bioink preparation was adapted from Davis-Hall et al.5. Steps 5.1-5.2 can be completed in parallel with steps 4.1-4.3 to minimize the time between cell collection and resuspension in the bioink. Perform steps in a biosafety cabinet using an aseptic technique.\nPrepare a 20 mM tris(2-carboxyethyl) phosphine (TCEP, see Table of Materials) pH 7 solution and sterile filter using a 0.2 µm syringe filter. Immediately before use, add 2 M KOH and/or 2 M HCl to adjust the solution pH as needed. Measure with pH meter and adjust accordingly.\n\tNOTE: TCEP reduces disulfide bonds.\nPrepare a 0.25 mg/mL stock solution of PEGαMA resuspended in sterile cell culture media without FBS, 250 mM stock solutions of 1,4-dithiothreitol (DTT), MMP2-degradable crosslinker, and CGRGDS (RGD) peptide (see Table of Materials), resuspending all in 20 mM sterile TCEP, and a 15 wt% stock solution of poly(ethylene oxide) (PEO) in distilled (DI) water using pipettes as needed.\nFollowing Table 1 as a guide, combine the respective amounts needed of PEGαMA, DTT, MMP2-degradable crosslinker, PEO, CGRGDS, and low-serum cell culture media together with the fibroblasts in a 50 mL conical tube.",
    "NOTE: It is recommended to check the pH with pH strips after adding all but the cell culture media as this combination should result in the pH being very close to 6.2. If further pH adjustments are required, keep track of how much additional volume is needed to adjust the pH of the precursor solution. Bring up the total volume to 200 µL by adding the remaining cell culture media volume minus any volume added during the final pH adjustment.\nMix the bioink together using a positive displacement pipette to ensure the cells are single cells and confirm the final precursor solution is pH 6.2 to prevent base-catalyzed polymerization during 3D bioprinting.\nLoad the bioink into the glass syringe by removing the plunger and using a separate syringe with a 15 gauge 1.5\" length blunt needle tip (see Table of Materials) attached to transfer the bioink from the centrifuge tube to the syringe, being careful to avoid forming air bubbles within the solution.\nPlace the glass syringe within the print head and attach print head components so that everything is firmly assembled and ready for printing.\n\tNOTE: At this point, the glass syringe within the print head should have a 30 gauge 0.5\" length blunt needle tip attached to it for printing.\n   \ntable:\n﻿0,1,2\nComponent,Stock Solution Concentration,Amount to Add\nPEGαMA,0.25 mg/ml,140 µL\nDTT,250 mM,12.24 µL\nMMP2 Degradable Crosslinker,250 mM,5.25 µL\nRGD,250 mM,1.6 µL\nPEO,15 wt%,33.33 µL\nActivation Media and/or pH Adjustment Reagents,-,7.58 µL\nFibroblasts,-,800000 cells\nTable 1: Example volumes required to prepare 200 µL of bioink (hydrogel precursor solution and fibroblast cells).\n6. 3D bioprinting\nNOTE: Perform all steps in a biosafety cabinet using aseptic techniques.",
    "Using the directional arrows within the Pronterface software, manually adjust the position of the extrusion needle into the center of a well and within the support bath slurry. Leave at least 1 mm support bath slurry below the tip of the needle.\n\tNOTE: The software has no ability to tell where the needle is within space. It is completely up to the user to move the needle by manually clicking the arrows within the software (e.g., clicking the up arrow will move the needle up or away from the printing platform, etc.). Maneuver the needle carefully to ensure it will not hit any boundaries of the well.\nOnce the needle tip is situated in the center of the slurry within the well, hit the start button within the Pronterface and wait for the print to complete to achieve constructs, as demonstrated in Figure 3A.\n\tNOTE: To bioprint one construct using the provided file (Supplementary File 1), it will take approximately 3 min. It takes approximately 5 min to orient and move the needle and then print one construct completely from start to finish.\nRepeat steps 6.1-6.2 until the number of desired bioprinted constructs is met.\n\tNOTE: It is recommended to make more constructs than needed to account for any unsuccessful prints. If failure occurs, move to the next well, reset everything, and repeat steps 6.1-6.2 again. \nLeave the well-plate at room temperature and cover it in the BSC for 1 h after the printing has finished to allow for base-catalyzed polymerization of the phototunable hydrogel.\nPlace the well plate containing 3D bioprinted constructs into a 37 °C sterile incubator and leave them for 12-18 h to melt away the support bath slurry.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65639/65639fig03.jpg",
    "Figure 3: Experimental schematic. This protocol was described in three major steps: (A) 3D bioprinting PEGαMA hollow tubes with embedded cells to mimic pulmonary vasculature. (B) Photoinitiation of homopolymerization reaction to stiffen the cellular microenvironment. (C) Assessment of cellular markers for proliferation and activation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65639/65639fig03large.jpg]\n7. 3D bioprinted construct culture and photostiffening\nNOTE: All steps should be performed in a biosafety cabinet using aseptic techniques.\nPrepare 2.2 mM lithium phenyl-2,4,6-trimethylbenzoylphosphinate (LAP) (see Table of Materials) stock solution in PBS and sterile filter using a 0.2 µm syringe filter. Keep the LAP solution protected from light.\nAfter 12-18 h, change the media surrounding the bioprinted constructs. Manually remove the media and melted gelatin support bath within the wells and be careful not to disturb the bioprinted constructs.\n\tNOTE: It is helpful to slowly remove the media while holding the plate at a 45° angle so that the constructs emerge within the well and can be seen. A clear hydrogel cylinder should be identifiable in each well with successful print (Figure 4A).\nAdd an appropriate volume of low-serum media to each well.\n\tNOTE: For a 24-well plate, 700 µL media per well should completely cover the bioprinted constructs. Adjust as needed.\nReturn the plate to the incubator and change the media on the samples every 3 days or in accordance with the experimental design.\nTwenty-four hours before the desired stiffening time point, remove media from the samples and replace them with low-serum media supplemented with 2.2 mM sterile LAP.",
    "NOTE: To fluorescently label the structure, swell 3D bioprinted constructs in PBS supplemented with 10 µM methacryloxyethyl thiocarbamoyl rhodamine B (see Table of Materials) overnight, then stiffen as described in step 7.6 to fluorescently label the structure. Transfer into PBS for 2 days at 4 °C to remove excess rhodamine and image using a TRITC filter (Figure 4B,C).\nAt the desired stiffening time point, remove half of the media from the wells to be stiffened and place the plate with the lid off under UV light. Turn on the UV light and stiffen these constructs by applying 10 mW/cm2 365 nm light for 5 min using Omnicure (see Table of Materials) and a 365 nm bandpass filter (Figure 3B).\n\tNOTE: Use the radiometer/photometer to confirm the light intensity is correct before exposing cells to UV light.\nRemove the remaining media from these wells and add fresh low-serum media to each well. Return the plate to the incubator.\nTake out the plate from the incubator and perform the fibroblast activation study at the desired time point following step 9.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65639/65639fig04.jpg",
    "Figure 4: 3D-bioprinted hydrogel structures supported cell viability over time. (A) Photograph of 3D-printed hydrogel structure in a 24-well plate. (B) Maximum intensity projection of fluorescently labeled PEGαMA 3D-printed hydrogel. Scale bar = 1 mm. Higher magnification microscopy showed pores within the hydrogel structure induced by gelatin microparticles in the FRESH bioprinting support bath. (C) 3D-printed PEGαMA tube with fluorescently labeled stiffened regions imaged on a confocal microscope (100 µm z-stack displayed as a maximum intensity projection) showed spatial control over stiffening in 3D. Scale bar = 500 µm. (D) HPAAF viability in 3D-bioprinted constructs measured by Live/Dead assays. Constructs with 300 µm thickness and 4 × 106 cells/mL outperformed all other conditions at every time point. Viability peaked on day 7. This condition and time point were selected for future experiments. Columns show mean ± SEM, n = 3. *, p < 0.05, ANOVA, Tukey HSD. (E) Representative confocal images of cells in 3D constructs stained with live/dead reagent at day 7, the time point with the greatest overall viability. Calcein AM marked live cells in green and propidium iodide marked dead cells in red. The right-most column shows that the best-performing condition had a uniform cell distribution and a high percentage of live cells. Scale bar = 500 µm. Reproduced with permission from Davis-Hall et al.5. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65639/65639fig04large.jpg]\n8. The assessment of fibroblast viability\nAt desired viability time points, stain using calcein AM and propidium iodide (see Table of Materials).",
    "NOTE: To summarize, media should be removed from each well and the constructs should be rinsed with sterile PBS. Incubate the constructs in a live/dead staining solution for 40 min at 37°C on a rocker. The staining solution should contain calcein AM (1:1000 dilution) and propidium iodide (1:1000 dilution) to identify live or dead cells upon imaging.\nTransfer the constructs into sterile PBS and immediately image on a confocal fluorescence microscope. Acquire three different 100 µm z-stack images per sample per time point and express viability as the average percentage of live cells (Figure 4D,E).\n9. The assessment of fibroblast activation\nPrepare 3% w/v bovine serum albumin (BSA) and 0.1% v/v Tween 20 in PBS. This solution will be referred to as the immunofluorescence (IF) solution.\nAt desired timepoints, remove media from the sample wells and rinse the constructs with PBS. Replace the PBS with 4% paraformaldehyde (PFA) and keep these samples at 37 °C for 30 min on a rocker. Then, replace the 4% PFA with 100 mM glycine in PBS and leave these samples on a rocker at room temperature (RT) for another 15 min.\nNext, transfer these samples into Tissue-Tek Cryomolds, cover the sample completely with optimal cutting temperature (OCT) solution (see Table of Materials), and allow the OCT to diffuse into the samples for 12-18 h at 4 °C.\nFlash-freeze the OCT-soaked samples in 2-methylbutane using liquid nitrogen. Fill a styrofoam box or other appropriate container with liquid nitrogen and then place a second container filled with 2-methylbutane within the liquid nitrogen so that it is at least halfway submerged. Use forceps to hold each cryomold containing an OCT-covered sample in liquid nitrogen cooled 2-methylbutane until visibly frozen. These samples can be stored at -80 °C until they are ready for cryosection.",
    "CAUTION: Personal protective equipment (PPE) such as cold protectant gloves, a cold protectant apron, and face shield provided in the Cryogenic Safety Kit (see Table of Materials) should be used while handling liquid nitrogen.\nCryosection the frozen OCT samples at -22 °C and attach 10 µm thick slices to positively charged glass microscope slides. Prepare three microscope slides with at least 3-5 cryosections per slide for each 3D hydrogel sample.\n\tNOTE: The microscope slides can be stored at this point at -80 °C if needed as a stopping point.\nFix the cryosections in ice-cold acetone for 15 min to help the cryosections adhere to the slides. Gently rinse the cryosections with RT water to remove any remaining OCT. Let these samples dry and outline the cryosections with a hydrophobic pen (see Table of Materials).\nPermeabilize the samples at room temperature with 0.2% v/v Triton X-100 in PBS for 10 min and then block the sections with 5% BSA w/v in PBS for 1 h at RT.\nAdd the primary mouse anti-human alpha smooth muscle actin (αSMA) antibody (1:250 dilution) (see Table of Materials) to the IF solution. Store these sectioned samples with the primary antibody on them overnight at 4 °C. Rinse the samples 3x with IF solution.\nIncubate the sections in IF solution containing the secondary goat anti-mouse Alexa Fluor 555 antibody (1:250 dilution) and two drops of ActinGreen 488 ReadyProbe (see Table of Materials) per milliliter of IF solution. Cover the samples for all subsequent steps with aluminum foil to protect them from light and let the secondary antibody solution stay on the samples for 1 h at RT.",
    "Rinse the sections 3x with IF solution. Incubate them in 300 nM 4',6-diamidino-2-phylindole (DAPI) in DI water for 15 min at RT. Conduct a final rinse of the sections 3x with DI water.\nUsing 10 µL of a commercially available antifade reagent (see Table of Materials), coverslip the sections using standard methods.\n\tNOTE: The mounted slides can be stored protected from light in a -80 °C freezer until needed for imaging.\nImage the cryosections using a fluorescence microscope (Figure 3C and Figure 5B). Image three random sections per slide using a 10x objective.\n\tNOTE: Images should be taken in the DAPI, FITC, and TRITC channels.\nUpload the images into ImageJ (NIH). Quantify the percentage of αSMA positive cells as a measurement of fibroblast activation (Figure 5A) by dividing the total number of αSMA-positive cells by the total number of cell nuclei for each field of view.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65639/65639fig05.jpg",
    "Figure 5: Fibroblast activation in 3D-bioprinted models of pulmonary arterial adventitia. (A) Fibrotic activation in soft and stiffened 3D hydrogels measured by αSMA expression. HPAAFs in stiffened constructs were significantly more positive for αSMA than cells in soft constructs. Columns represent mean ± SEM, n = 3. *, p < 0.05, Mann-Whitney U test. (B) Representative confocal images of immunostaining for αSMA, actin, and DAPI in soft and stiffened 3D hydrogels. HPAAFs in stiffened constructs showed more prevalent αSMA immunofluorescence than cells in soft constructs. Scale bar = 250 µm. (C) Fibroblast proliferation in soft and stiffened 3D bioprinted constructs measured by EdU positivity. HPAAFs in stiffened constructs were significantly more positive for EdU than cells in soft constructs. Columns represent mean ± SEM, n = 3. *, p < 0.05, Mann-Whitney U test. (D) Representative confocal images of immunostaining for EdU and Hoechst dye in soft and stiffened 3D hydrogels. HPAAFs in stiffened constructs showed more prevalent EdU immunofluorescence than cells in soft constructs. Scale bar = 300 µm. Reproduced with permission from Davis-Hall et al.5. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65639/65639fig05large.jpg]\n10. The assessment of fibroblast proliferation\nTwenty-four hours before a desired proliferation time point, remove cell culture media from each well and replace with low-serum media supplemented with 10 µM EdU solution from the commercially available cell proliferation kit (see Table of Materials). Return the samples to the incubator for overnight incubation.",
    "At the desired proliferation time point, fix the samples incubated with EdU using 4% PFA at 37 °C for 30 min on a rocker. Replace the 4% PFA solution with 100 mM glycine in PBS and incubate samples at 37 °C for at least 15 minutes. Add the Hoechst at an appropriate concentration for 30 min and then rinse the constructs 2x with PBS.\n\tNOTE: The samples can be stored protected from light at 4 °C until imaging.\nImage all fixed and stored EdU samples using a fluorescence microscope and suggested cell proliferation kit manufacturer settings and filters (Figure 3C and Figure 5D). Acquire three different 100 µm z-stack images per sample and create maximum projections from each of these z-stacks. Measure HPAAF proliferation by counting the number of EdU-positive cells and dividing by the total number of cells identified by Hoechst counterstain within the maximum projection images (Figure 5C).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}