{
  "id": 18240,
  "origin_website": "Jove",
  "title": "Minimally Invasive Muscle Embedding (MIME) - A Novel Experimental Technique to Facilitate Donor-Cell-Mediated Myogenesis",
  "procedures": [
    "All studies involving live animals are approved by the Institution Animal Care and Use Committee (IACUC) at Wayne State University, Detroit, Michigan, USA, and are in accordance with the Guide for the Care and Use of Laboratory Animals (8th Edition, 2011, published by National Academies Press, 500 Fifth Street, NW, Lockbox 285, Washington, DC 20055, USA). As per the approved IACUC protocols, procedures involving pain and/or distress were performed under general anesthesia, which is induced and maintained by isoflurane inhalation (1.5 - 5% to effect). Anesthesia was verified by lack of withdrawal to toe pinch, and lack of palpebral or vibrissae responses (the percentage of isoflurane was increased as needed to maintain effect). Due to the minimally invasive nature of the protocols, a \"sterile tips\" technique was followed. While animals were under anesthesia, petroleum jelly was applied to the eyes to prevent dryness. No special treatments were required; however, diet gel was provided to the animals for 24 h following procedures that involved general anesthesia. The investigator is approved by the IACUC to withhold analgesia following MIME, since the procedure does not involve surgically exposing the host muscle, because it is confined to one hindlimb and does not affect normal function, and because many common analgesic drugs are known to affect normal muscle regeneration.  \n1. Animal Models\nHost mice for MIME\nUse NSG-GFP mice (8 - 10 week, male) as hosts for the muscle grafts studies.\n\t\tNOTE: These mice are ideal hosts for allogeneic muscle grafts because they lack mature T and B lymphocytes and functional natural killer cells, are deficient in cytokine signaling, and have been used by others for allografting or xenografting non-muscle cells14. Ubiquitous GFP expression allows for easy identification of host (GFP+) and donor-cell-derived (GFP-) muscle fibers.\nDonor mice for MIME",
    "Use C57BL/6J mice (12 - 16 week) as donor mice.\n\t\tNOTE: These mice are suitable donor mice because they have a fully mapped genome, are not known to have any skeletal muscle pathology, are easily available and economical, and do not express GFP.\n2. Preparing Donor Muscle Tissue\nTying Guiding Sutures and Harvesting donor EDL muscles\nEuthanize the donor mice by cervical dislocation and thoracotomy performed under general anesthesia administered by a tabletop isoflurane vaporizer driven by medical oxygen (inhaled isoflurane; 2 - 5% to effect).\nTo access the EDL muscles, use a pair of surgical scissors to open the skin over the anterior surface of the leg. Locate the TA muscle in the anterior leg and remove it to visualize the EDL muscle that is situated behind the TA muscle. Slide the tip of a pair of forceps behind the EDL muscle and apply gentle traction to see if the toes extend (this confirms that the muscle is the EDL).                                                                                                                                                                                                      \n\t\tNOTE: Donor tissue area should be surgically, aseptically prepped prior to harvest.\nUse ~ 10 cm segments of 4-0 silk, braided, non-absorbable, sterile suture, and make two double knots to apply the guiding sutures to the proximal and distal tendons of the EDL muscle. (Figure 1A).\nCut the distal EDL tendon, reflect the EDL muscle and cut the proximal tendon.\nPlace the donor EDL muscles in a Petri dish filled with mouse Ringer solution.\n3. Preparing Host Mice for MIME\nAnesthesia\nPlace the host mouse under general anesthesia (inhaled isoflurane; 1.5 - 5% to effect) administered by a tabletop isoflurane vaporizer driven by medical oxygen.",
    "Induce anesthesia in an induction chamber and then transfer the mouse to a nose-cone to maintain the anesthesia while performing other procedures on the animal. Provide thermal support with an isothermal gel heating pad while the animal is under anesthesia.\nSkin preparation\nTo remove the animal's fur, apply a depilatory cream over the anterior aspect of the left hind leg. The right leg serves as a control leg for subsequent procedures.\nLeave the depilatory cream on for 2 min. Clean off the depilatory cream along with the detached fur with wipes soaked in phosphate buffered saline (PBS). After fur removal, scrub the skin with three alternating wipes of povidone-iodine scrubbing solution and 70 % ethanol.\nCreating a needle track in the host TA muscle\nPass an 18-gauge (1 in long) surgical needle through the center of the host TA muscle along the muscle's long axis (Figure 1B). Pass the needle in a cephalo-caudal direction, along the length of the TA muscle, and through the center of the muscle belly (Figure 1B).\n\t\tNOTE: The purpose of this step is to create a needle track, into which a piece of donor muscle may be embedded. Embedding the donor tissue in the center of the TA muscle would potentially allow the SCs from the donor tissue to migrate and facilitate myogenesis across the entire host TA muscle.\nEmbedding donor tissue in the needle track of host TA muscle\nOnce the surgical needle is within the host TA muscle, pass the guiding sutures at one end of the donor tissue through the lumen of surgical needle in a caudo-cephalic direction (Figure 1C).\nDraw the donor tissue through the needle track as the needle is withdrawn from the host TA muscle in a caudo-cephalic direction.",
    "Use the guiding sutures at the caudal and cephalic ends of the donor tissue to adjust the placement of the donor tissue. Ensure that the donor tissue is ensconced within the host TA muscle (Figure 1D).\nOnce the donor tissue placement is optimized, cut off the guiding sutures, make any final adjustments to the donor tissue placement with fine-tipped forceps.\nSeal cutaneous needle wounds (Figure 1E - F) by approximating the wound edge with forceps and applying veterinary tissue adhesive with the tip of a 27-gauge surgical needle.\n4. Intramuscular Myotoxin Injection to Induce Concerted Muscle Degeneration and Regeneration\nAfter MIME, inject 50 - 60 µL of 1.2% BaCl2 (myotoxin) into the host TA muscle to induce extensive muscle fiber damage in the host muscle and the donor tissue embedded within it15.\n\t\nInject BaCl2 at 3 sites along the length of the host TA muscle (proximal, middle and distal one-third of the muscle belly).\n\t\tNOTE: Injecting myotoxins like BaCl2, cardiotoxins and notexin into skeletal muscle induces concerted muscle fiber damage followed by regeneration16.\n5. Post-procedural Animal Care\nAfter MIME and BaCl2 injection, clean the host mouse's left hind leg with ethanol and apply a thin layer of petroleum jelly to protect the skin.\nAfter post-procedural skin care, remove the host mouse from the nose cone.\nPlace the mouse in a solitary recovery cage without bedding. Provide thermal support to the recovering animal through an isothermal gel heating pad placed under half of the recovery cage.\n\tNOTE: One half is not heated so that animal may move away from the heating pad if needed.",
    "After the host mouse has completely recovered from anesthesia, return the animal to its original cage. Place the animal back in the animal facility until follow-up experiments are performed. Monitor the host mouse daily until it is ready for follow-up – example: at 3 or 14 days post-MIME. Following MIME, animals are monitored by laboratory personnel as well by veterinary staff – this mainly involves assessing if animals are bright, alert and responsive; and also assessing if animals are showing overt signs of pain or are having difficulty moving, feeding, drinking and grooming.\n6. Tissue Collection\nHarvesting host muscle\nEuthanize the host mice by cervical dislocation and thoracotomy performed under general anesthesia administered by a tabletop isoflurane vaporizer driven by medical oxygen (inhaled isoflurane; 2 - 5% to effect). The investigator also has IACUC approval to harvest TA muscles under general anesthesia prior to euthanasia. \nTo access the host TA muscles, use a pair of surgical scissors to open the skin over the anterior surface of the leg. Locate the TA muscle in the anterior leg, cut the distal tendon, reflect the muscle and cut the proximal muscle attachments (see section 2.1).\nCollect both left (experimental) and right (control) TA muscles.\n Snap freezing harvested muscles\nWeigh the harvested muscles by placing on weigh paper and weighing scale.\nBriefly dip the muscles in mineral oil for cryoprotection. Blot off the excess oil.\nPlace muscles on aluminum foil, and snap freeze the muscles by rapidly immersing them in liquid nitrogen filled in a Dewar. Transfer the samples to labeled cryovials and store the samples in a -80 °C freezer for later studies.\n7. Histological Studies\nCryosectioning muscle tissue to collect serial cross sections",
    "Transfer the samples from the -80 °C freezer to a cryostat by placing them in a Dewar containing liquid nitrogen.\nIn the cryostat, handle one sample at a time. With a cold razor blade (blade stored in cryostat), cut the sample twice at the mid-belly of the TA muscle to produce a segment of muscle that is about 1 - 2 mm thick. Keep this segment for making the cryostat sections and return the remaining portions of muscle to its cryovial.\nWith the optimum cutting temperature (OCT) freezing compound, secure the thick segment of tissue onto a cryostat specimen disc. Place the specimen disc on the specimen holder.\nRough-face the sample by cutting 20 µm sections. Collect a few 20 µm sections on glass slides for the cryostat sections.\nIf the quality of the 20 µm sections is satisfactory, change the cutting thickness to 5 µm and collect a few sections to assess the quality. If the 5 µm sections are satisfactory in quality, collect serial sections. Collect 2 - 3 sections per slide and collect enough sections for 3 slides.\nCollect sections from both the experimental (left) and control (right) TA muscles of each animal.\nStudying GFP expression\n\tNOTE: Designate one set of the prepared slides (section 7.1) to study GFP expression in the muscle fibers.\n\t\nApply ~50 µL of anti-fade medium on the sections and apply a glass coverslip. Seal the coverslip edges with clear nail polish.\nUsing the light and fluorescent microscope (see Table of Materials), study the sections with a 10X objective and an appropriate filter for visualizing GFP.",
    "Collect digital images (~15) of overlapping visual fields to cover the entire cross section of the TA muscle. Collect the phase contrast images for each of the visual fields by switching from fluorescence to phase contrast mode on the microscope.\nOpen images with a suitable imaging software that can tile individual images to produce a single composite image; e.g., use the \"photomerge\" option under File Menu in the imaging software listed in the Table of Materials.\nOpen the GFP fluorescence images with a suitable image analysis software (e.g., ImageJ). Circle individual muscle fibers using the \"ROI tool\" and record the Mean Fluorescence Intensity for each fiber.\n\t\t\nCalculate the Maximum GFP (Fluorescence) Intensity by taking the average of the Mean Fluorescence Intensity of 10 fibers that show high GFP expression and have normal morphology. Calculate the % Maximum GFP Intensity for each fiber by dividing the Mean Florescence Intensity for each fiber by the Maximum GFP Intensity and multiplying by 100. Tabulate the results of the GFP analysis for each TA muscle as shown in Figure 3E.\nStudying muscle fiber integrity and myonuclear location by Immunofluorescent labeling of desmin and 4',6-diamidino-2-phenylindole (DAPI), respectively.\n\tNOTE: Designate one set of the slides prepared, as above, to study the desmin labeling in the muscle fibers.\n\t\nFix sections with 2% paraformaldehyde in PBS for 10 min. Wash the sections three times with PBS.\n\t\tCAUTION: Wear appropriate personal protective equipment (PPE) when handling when handling paraformaldehyde.\nBlock sections with 3% bovine serum albumin diluted in PBS containing 0.01% Triton-X100 for 30 min. This blocking solution is referred to hereafter as the primary diluent.\nDilute the rabbit anti-desmin immunoglobulin G (IgG) in the primary diluent (1:200).",
    "After the blocking is complete, apply the diluted primary antibodies on sections and incubate overnight in a refrigerator at ~4 °C. Wash the sections once (5 min) with PBS containing 0.1% Triton X-100. This solution is referred to hereafter as the first wash buffer.\nWash the sections 3 times (5 min per wash) with PBS.\nPrepare the secondary antibody by diluting goat anti rabbit IgG (conjugated to red fluorescent dye) in PBS containing 0.01% Triton X-100.\nApply the diluted secondary antibody on the sections and incubate at room temperature (~23 °C) for 60 min.\nWash the sections once (5 min) with the first wash buffer. Wash the sections 3 times (5 min per wash) with PBS.\nApply DAPI for 3 min. Wash the sections 3 times (1 min per wash) with PBS. Apply ~ 50 µL of the anti-fade medium on the sections and apply glass coverslip. Seal the coverslip edges with clear nail polish.\nUsing the light and fluorescent microscope (see Table of Materials), study the serial sections with a 10X objective and an appropriate filter for visualizing red fluorescent dye.\nCollect the digital images (~15) of the overlapping visual fields to cover the entire cross section of the TA muscle. Collect the fluorescence images of DAPI labeling for each of the visual fields by switching to the appropriate filter setting.\nOpen and analyze the images using a suitable imaging software as described in steps 7.2.3 - 7.2.4.\n\t\tNOTE: Study images to identify, which muscle fibers are damaged (desmin negative), which muscle fibers have central nucleation (desmin positive fibers that have DAPI-labeled nuclei located internally rather than peripherally), and, which areas of the section have inflammation and/or fibrosis (areas that have many DAPI-labeled nuclei clustered together, but are devoid of muscle fibers)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}