{
  "id": 9005,
  "origin_website": "Jove",
  "title": "Large-scale Reconstructions and Independent, Unbiased Clustering Based on Morphological Metrics to Classify Neurons in Selective Populations",
  "procedures": [
    "Note: The tissue examined in this study was prepared as a part of a separate study5. Therefore, all of the experimental methods involving the use of animals have been described in detail in the Experimental Methods section of Briggs et al. (2016). All procedures involving animals conducted as a part of the prior study were approved by the Institutional Animal Care and Use Committees. The steps for injection of virus into the dLGN and histological processing of brain tissue are described briefly below in sections 1 - 2.\n1. Stereotaxic Injection\nPerform all surgical procedures in a sterile environment using aseptic techniques. Steam-sterilize all metal surgical instruments, gauze and drape material in autoclave. Sterilize all materials that could be damaged by steam using chemical sterilization (e.g. ethylene oxide).\nInduce and maintain anesthesia according to animal- and protocol-specific requirements.\n\t\nFor virus injection in monkeys, induce anesthesia with ketamine (10 mg/kg) and maintain animals under full surgical anesthesia with isoflurane (1 - 3% inhaled in oxygen) monitoring expired CO2, EKG, respiration rate, and temperature continuously and periodically checking for jaw tone to ensure proper anesthetic depth.\nPlace animal in a stereotaxic frame to stabilize head position and to allow use of stereotaxic coordinates to locate the injection structure of interest (e.g. dLGN). If measuring visual responses, place eye drops (1% atropine eye drops if pupil dilation is desired, otherwise saline eye drops) and then contact lenses in both eyes to prevent dryness. If not measuring visual responses, place ophthalmic ointment in eyes.\nMake a midline scalp incision and retract the skin and muscles.\nAccording to stereotaxic coordinates for the structure of interest (dLGN) in one hemisphere, make a small craniotomy.",
    "Gradually lower a recording electrode (e.g. tungsten or platinum/iridium electrode (see Table of Specific Materials/Equipment, row 3) clamped to a micromanipulator that is manually positioned) through the craniotomy into the brain. Lower impedance (< 1 MΩ) and slightly thicker (~ 250 µm diameter) electrodes may be utilized to penetrate the dura, if desired.\nRecord the manipulator position at the cortical surface and at the point where visual responses are measured. Visual responses are audible, time-locked neuronal responses to light flashed in the eyes with an ophthalmoscope or small LED/flashlight.\nDetermine the location and thickness of the dLGN by noting manipulator positions at the start, middle, and end of visual responses and subtracting the cortical surface position from these values. Record the depths for each designed injection site within the dLGN.\n\tNOTE: Similar procedures can be used for locating non-visual structures by using appropriate sensory stimuli. Additionally, coupled recording/injection systems can also be used to target small brain structures.\nOnce optimum injection locations are noted, remove the recording electrode and place an injection pipette (glass pipette or injection syringe) at the same stereotaxic position and lower to the appropriate depth for each injection, starting with the deepest injection site and proceeding to the shallowest, waiting at least 1 min after injecting before changing electrode position. Glass pipettes with outer diameter of ~ 50 µm may reduce backflow of virus compared to syringe tips (~ 200 µm diameter).",
    "Using an injection system (see Table of Specific Materials/Equipment, row 4), picospritzer, or syringe pump, inject small volumes (1 - 5 μL; refer to manufacturer instructions for injection procedures) of modified rabies virus over multiple (3 - 10) depths at a rate of ~ 100 nL/min within the target structure (dLGN). Note: Separate injection penetrations can be made in larger target structures (e.g. monkey dLGN). Adjust total injection volume according to target structure size.\nPause at least 5 min before retracting the injection pipette. When the injection pipette is removed, fill the craniotomy with protective material (glue bone piece in place, apply bone wax or gelfoam), then suture the muscle and skin back together.\nAdminister analgesics (e.g. ketoprofen) and antibiotics prior to the end of surgery and monitor animal continuously until animal is ambulatory.\nFor at least 3 days and up to 10 days following surgery, monitor animal daily to ensure sutures are clean, dry, and intact and animal shows no signs of pain or discomfort. Administer daily analgesics and antibiotics as required. Begin social housing of post-surgical animal after animal has fully recovered from surgery. \n2. Tissue Harvesting, Sectioning, and Staining\nAllow 7 - 14 days for retrograde transport of virus, then euthanize the animal by overdose of euthanasia solution (e.g. Euthasol) and perfuse the animal transcardially with 0.1 M phosphate buffered saline, 4% paraformaldehyde, then 4% paraformaldehyde with 10% sucrose.\nRemove the brain (see12 for analogous steps in a rodent model) and place in 20 - 30% sucrose with 4% paraformaldehyde in 0.1 M phosphate buffer and refrigerate for 1 - 2 days.",
    "When the brain has sunk to the bottom of the container, remove it and cut the tissue into blocks containing the brain region with retrogradely labeled neurons (e.g. visual cortex) and the injection target structure (e.g. dLGN). Cut the same blocks of tissue from the non-injected hemisphere — these will serve as control sections. For best results, begin histological procedures immediately on freshly sectioned tissue.\nSection tissue coronally at a thickness of 50 μm per section using a freezing microtome (see Table of Specific Materials/Equipment, row 5).\nStain all sections for cytochrome oxidase activity (see Table of Specific Materials/Equipment, rows 5 - 8) to visualize cortical layers and subcortical structures13. Note: Sections can be stored overnight in a refrigerator in the final rinse following the cytochrome oxidase stain.\nLabel all sections with a primary antibody against GFP (1:1,000 dilution, ~ 12 h incubation; see Table of Specific Materials/Equipment, row 9) followed by a secondary antibody matching the primary host and tagged with biotin5 (1:500 dilution, 2 - 4 h incubation; see Table of Specific Materials/Equipment, row 10). It is recommended to incubate sections in the secondary antibody overnight.\nLabel sections with an avidin/biotin complex then react with DAB and peroxide to permanently stain all labeled neurons5.\nMount sections on subbed glass slides and let dry overnight.\nDefat sections using a series of alcohol and xylene rinses then cover slip14.\n3. Neuronal Reconstruction",
    "NOTE: All reconstructions for original experiments were made using a neuron reconstruction system made up of a microscope (see Table of Specific Materials/Equipment, row 14), attached camera (see Table of Specific Materials/Equipment, row 13), and reconstruction software package (see Table of Specific Materials/Equipment, rows 11 - 12). Software-assisted neuronal reconstruction enables visualization of tissue slides overlaid with computer-based drawings of neuronal processes. Importantly, the software digitizes morphological reconstruction data in three dimensions, enabling extraction of position-specific morphological information. The associated data extraction program (see Table of Specific Materials/Equipment, row 12) enables extraction of a rich set of morphological data from each saved reconstruction.\nPlace a slide in the microscope slide holder and focus on a single section of interest using a low-magnification objective (e.g. 2X or 10X). Make sure the camera image is visible in the software view by properly positioning the camera shutter.\nChoose labeled neurons within the brain structure of interest (e.g. TRN) that are reasonably isolated so as to unambiguously reconstruct as much of the dendritic arborization as possible. Preferentially choose neurons if the cell body is fully within a single section in order to capture the largest extent of each cell body and accurately estimate its area and roundness. Use 10X microscope objective to identify cell body in home section.\nOnce a well-stained, well-isolated neuron is identified, add the \"home\" section containing the cell body to the Section Manager by clicking the \"New Section\" button. Enter the number of sections to include (recommend 2 - 3 sections to begin). Assign a section thickness of 50 μm when prompted (see Step 2.3).\nTrace the contours of relevant brain structures in the home section containing the cell body. Use the 2X objective/magnification for contour tracing.",
    "First, select \"Contour\" from the drop-down menu on the top toolbar and then select the contour type from the drop-down menu (e.g. \"LGN\" or \"TRN\").\nTrace contours of the target structure (e.g. TRN) as well as adjacent structures, if desired, by clicking on points along the contour using the mouse as a draw tool.\nSelect \"Close Contour\" by right-clicking the mouse and selecting this option from the menu to complete and enclose each traced contour.\nPlace a marker at the center of the target structure by clicking on the desired marker symbol on the right toolbar and then clicking on the desired location in the reconstruction to place the marker at that location. Use the same type of marker to mark the center of the target structure in all reconstructions.\nOnce the contours are complete, trace the outline of the cell body using 40 - 60X objectives/magnification. To do so, first select \"Neuron\" from the drop-down menu on the top toolbar and then select the neuron structure to trace, in this case \"Cell Body\". Next trace the cell body as in 3.4.\nPlace a different style marker at the center of the cell body, following the steps outlined in 3.5.\nTrace all dendrites beginning at the cell body.\n\t\nFirst, select \"Dendrite\" from the drop-down menu. Then trace each dendrite starting at the cell body and using the mouse as a draw tool. Be sure to adjust the z-depth throughout the tracing to accurately capture the angle and direction of the dendrite.\nPlace a node at each branch point along the dendrite by right-clicking the mouse and selecting “Bifurcating Node” or “Trifurcating Node” from the drop-down menu. Use 40 - 60X objective/magnification for all dendrite reconstructions.",
    "At the end of each dendrite, right-click the mouse and select “Ending” from the drop-down menu.\nIdentify dendritic endings that are likely to continue into the adjacent section and bring these into focus at the appropriate z-depth in the microscope image. Include major landmarks nearby such as blood vessels or easily recognizable dendrite patterns or bundles in the microscope image.\n\t\nReduce magnification to 20X or 10X on the microscope (choose the magnification that allows greatest landmark visualization), and take a picture of the microscope image using a digital camera (e.g. cell phone, tablet) hand-held to the computer screen.\nMove to the adjacent section on the slide and line up the contours of the previously traced section with the boundaries of the dLGN and TRN in the new section.\nReturn the field of view to the general area of the cell body (based on contours and major landmarks) and bring the magnification back up to 10 - 20X.\nUse the photo of the dendrite endings from the previously traced section to aid in aligning the endings with the beginnings of the dendrites in the new section.\n\t\nTo rotate the tracing and move it to align dendrites, use the arrow tool to select the reconstruction, right-click and select \"Move\" from the drop-down menu.\nAlternatively, use the \"Match\" tool to match dendritic endings to beginnings. Select the Match tool from the top toolbar and when prompted, click on the ending in the reconstruction and the corresponding continuation point in the image. Repeat for 3 or more endings.",
    "Once the tracing from the previous section is lined up with the dendrites in the new section, make sure the corresponding new section is selected in the section manager by clicking on the current section. Or, add a new section to the Section Manager, as described above in 3.3, adjusting the z-depth and position of each new section relative to the home section accordingly and setting each section thickness to 50 mm (see Step 2.3).\nIncrease the magnification to 40 - 60X and trace the dendrite continuations by right-clicking the mouse on the end of the dendrite from the reconstruction and selecting \"Add to Ending\" from the drop-down menu, then tracing the dendrite using the mouse as a draw tool. Follow prompt to specify if continuation is in the new section.\nFollow dendrites through at least 3 adjacent sections (one on each side of the home section) following Steps 3.8 - 3.15. Add to the reconstruction until at least 3 total sections are traced for the neuron or until the dendrites can no longer be followed or found. Trace contours in neighboring sections following the steps above, if desired.\n4. Independent Clustering\nNote: Independent cluster analyses enable unbiased analyses of large, multi-dimensional datasets that might otherwise be difficult to visualize and, importantly, provide a quantitative assessment of morphological diversity. A matrix-based programming platform is quite useful for the analysis of multi-dimensional datasets and enables sophisticated data manipulations and statistical analyses. The functions listed in steps 4 - 6 are defined in the programming platform listed in the Table of Specific Materials/Equipment, row 15.\nExtract morphological data from each individual neuronal reconstruction using an extraction program associated with the neuron reconstruction system (see Table of Specific Materials/Equipment, rows 11 - 12).",
    "First, choose the morphological data desired for each reconstruction including: contour information, marker information, morphological data of cell body and dendritic arborization, etc.\nFrom the Edit drop-down menu in the top toolbar, select “Select all objects”. Then select “Branched Structure Analysis” from the Analysis drop-down menu in the top toolbar and click on each tab and select the desired analysis options in each tab.\nExtract all desired data by clicking the \"OK\" button in the Analysis window and save in a spreadsheet format by right-clicking on the output windows and selecting \"Export to Excel\".\nCompile a Master spreadsheet (see Table of Specific Materials/Equipment, row 16) in which each morphological variable/metric is represented by a single numerical observation per neuron. In this Master spreadsheet, keep a record of the row identifier for each neuron.\nVerify that all variables included in the cluster analysis (e.g. morphological metrics) are independent of one another. For example, the number of nodes will correlate with the number of branches in a dendritic or axonal arborization. Accordingly, only one of these two variables should be included in a cluster analysis.\nMake sure each measurement contains an observation for every variable, i.e. each neuron (measurement), must have a data-point (observation) corresponding to each morphological metric (variable). If observations for a particular variable (for example, axon length) are lacking for a subset of neurons, this variable (axon length) cannot be included in the cluster analysis.",
    "Organize the data on the Master Spreadsheet into a single matrix in which each row represents a neuron and each column contains numerical data for each morphological metric (Figure 1). For example, a dataset including 100 neurons for which there are observations for 5 independent variables would be represented by a 100 x 5 (row-by-column) matrix. It is not necessary to include any identification for each neuron within the matrix - the row index will serve as each neuron's unique identifier. There should also be no gaps or \"NaN\"s in the matrix. Save the matrix as a single variable (e.g. Data = [100 x 5 matrix]; see Supplemental Code File for sample code).\nChoose an algorithm to calculate distances between points representing individual neurons in an n-dimensional space where n is defined by the number of variables. The 'pdist' function enables flexibility in calculating between-neuron distances. The default distance calculation is Euclidean distance and has been used previously for similar analyses of neuronal morphological data5,6.\nWith the between-neuron distances output of the 'pdist' function, use the 'linkage' function to form clusters. Again, multiple clustering options are available. Ward's method and centroid distance have yielded similar results in analyses of morphological datasets5,6.\nIf desired, use the 'kmeans' function as an alternative clustering approach to 'pdist' and 'linkage' functions. 'kmeans' employs squared Euclidean distance to calculate between-neuron distances and then centroid distance to assign clusters.\nTo visualize a hierarchical cluster tree, use the 'dendrogram' function on the output of the 'linkage' operation. This function has a default setting that limits visualization to 30 measurements, but it can be overridden by specifying the number of measurements (e.g. neurons) displayed. The dendrogram illustrates the linkage distances on the y-axis for each of the neurons, identified by their row index on the x-axis.",
    "NOTE: The outputs of 'linkage' and 'dendrogram' do not define the optimal number of clusters. The output of 'kmeans' does assign measurements to clusters, but it does not test whether these clusters are optimal. Separate statistical comparisons and verification of optimal clustering can be performed (see below).\n5. Verification of Clustering\nNote: As stated above, the cluster analysis itself does not directly provide a statistical assessment of whether the clusters illustrated in the cluster dendrogram are unique and representative of the sample. Methods for verifying clusters from the dendrogram have been proposed15, however these do not provide statistical verification of optimal clustering. There are multiple methods for verifying optimal clustering.\nMethod 1: Evaluating clustering:\n\t\nUse the 'evalclusters' function specifying the method used for calculating clusters, such as 'kmeans' or 'linkage'. A Gaussian mixture model output can also be evaluated (see Step 5.2 below; see Supplemental Code File for sample code).\nSpecify the evaluation criterion from a number of options (e.g. 'CalinskiHarabasz' - for descriptions of criterion options, refer to the Help menu, searching for \"evalclusters\").\nSpecify a range of optimal cluster numbers to test (e.g. [1:6] to test whether 1, 2, 3, 4, 5, or 6 clusters are optimal).\n\t\tNote: The output of 'evalclusters' is an optimal number of clusters given the clustering algorithm and criterion specified.\nMethod 2: Gaussian mixture model clustering:\n\tNOTE: Gaussian mixture model clustering algorithms (GMMs) assume that observations for each variable come from a mixture of Gaussian distributions defining each putative cluster, each with their own mean and covariance. The GMM then uses an expectation maximization algorithm to assign posterior probabilities to each measurement, indicating the probability of belonging to a specific cluster16.",
    "Implement a GMM using the 'fitgmdist' function by inputting the putative number of clusters observable in the data. Alternatively, to avoid a priori assignment of the number of clusters, use principal components analysis (PCA) with a series of different optimal cluster numbers using the steps outlined here (see Supplemental Code File for sample code).\nUse the 'pca' function on the original data matrix and save the principal component scores as an output.\nIn a loop starting at 1 and going through some number of putative optimal clusters, use the 'fitgmdist' function on the principal component scores and generate GMMs for each number of putative optimal clusters.\nEvaluate each GMM by examining the negative log likelihood, Akaike information criterion, and Bayes information criterion. The GMM with the lowest criteria is optimal.\nIf desired, test whether the mean values for each cluster are significantly different when the number of clusters is optimal (means of each cluster are stored in the \"mu\" output of each GMM).\n6. Statistical Analyses of Clustered Data\nOnce the optimal number of clusters is determined using hierarchical clustering and evaluated, return to the original data, separate neurons into clusters, and determine which morphological metrics contribute to the clustering of neurons into unique classes.\nSort the original morphological metric data such that neurons are grouped according to cluster assignment.\nTo examine relationships between morphological data across neurons (for all neurons or for neurons separated into clusters), perform linear regression fits to 2- and 3-way comparisons of morphological metric observations. These fits can be estimated using the 'fit' function and evaluated using the 'fitlm' function in which goodness of fit outputs include R2 and p values for regression fits.",
    "To examine the statistical relationships between neurons in each cluster, use non-parametric two-sample (Wilcoxon rank-sum test) or multiple-sample comparisons tests (ANOVA), depending on the number of clusters. Importantly, the use of multiple-sample ANOVAs ensures that p values are corrected for multiple comparisons.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}