{
  "id": 2392,
  "origin_website": "Cell",
  "title": "High-content analysis of neuronal morphology in human iPSC-derived neurons",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell seeding and culturing on HCA plates\nTiming: 5 days\nIn this step, iPSC-derived neurons are seeded onto coated HCA plates and cultured for several days to allow for neurite outgrowth (Figure 1[href=https://www.wicell.org#fig1]).\nPreparation of HCA plates.\nCoat a black wall, clear flat-bottom 384-well plate suited for imaging using 50 μL geltrex coating solution (1:100 dilution in DMEM-F/12) per well, and incubate for 1 h at 37°C.\nNote: If HCA plates are not directly used after coating, they can be wrapped with parafilm and stored for up to two weeks at 2°C–8°C.\nAlternatives: Instead of geltrex, coating with matrigel is also possible. In our hands, the two coating materials give comparable results and provide good neuronal attachment and outgrowth. However, matrigel is not a defined formula, and thus it may lead to potential batch-to-batch variability. Other coating substances can also be employed, depending on the neural cell type of use.\nCritical: It is crucial to employ plates with a bottom suitable for high resolution imaging, for example glass or μClear® bottom.\nSeeding of iPSC-derived neurons (Figure 1[href=https://www.wicell.org#fig1]).\nFor 6-well plates, split iPSC-derived neurons by applying 0.5 mL accutase® (an enzyme mixture with proteolytic and collagenolytic activity) onto the cells for 3 min at room temperature (RT, 20°C–25°C).\nDilute accutase activity by adding 1 mL of culture media and wash off the cells. Collect the cells and transfer them into a 15 mL falcon tube with 7.5 mL PBS to further dilute accutase activity. Wash the well with 1 mL of culture media and transfer any of the remaining cells into the same 15 mL falcon tube.\nCentrifuge for 5 min at 100 × g, remove the supernatant, and re-suspend the cells in maturation media. Count the cells using a hemocytometer or a cell counter.",
    "Mix the cell suspension with maturation medium containing fresh DOX and 10 μM ROCK-inhibitor to a concentration of around 40,000 cells/mL. Pipette 50 μL of the cell suspension per well (384-well plate).\nIncubate the cells in a tissue culture incubator at 37°C and 5% CO2.\nNote: Optimal seeding density might need to be adapted depending on the specific neuronal type and iPSC line used for differentiation. Low density helps with downstream image analysis, while high density usually improves cell survival. In our hands 2,000–5,000 cells per well (40,000–100,000 cells/mL) yield the best results in this HCA pipeline.\nCulturing of iPSC-derived neurons.\nEvery second day, remove half of the culture medium and replace it with maturation medium containing fresh DOX.\nCritical: Always carefully add or aspirate medium to avoid cell detachment. In our hands, cells adhere less strongly in 384-well plates compared to wells with standard glass cover slips.\nNote: If there are many dead cells, you can remove the culture medium completely and wash the cells with PBS. However, this should only be done if the cells attach strongly to the bottom surface.\nNote: The optimal time point for fixation might need to be adapted depending on the specific neuronal type and iPSC line used. We recommend fixing the iPSC-derived neurons 4 days after seeding them to ensure sufficient level of neurite outgrowth for effective classification by the HCA software.\nFixation and staining of iPSC-derived neurons\nTiming: 2 days\nIn this step, iPSC-derived neurons are fixed and immunostained for axonal and dendritic markers.\nFixation of iPSC-derived neurons.\nAdd 50 μL of the 8% PFA solution directly to the culture medium for a final 4% PFA solution. Incubate for 15 min at RT under a fume hood.",
    "Aspirate the culture medium / PFA solution and carefully wash each well three times with 50 μL PBS. After the last washing step, leave 50 μL of 0.05% sodium azide in PBS in each well to improve conservation, or add the blocking solution for the subsequent staining steps.\nIf the cells will not be stained directly after fixation, seal the plate with parafilm and store it at 2°C–8°C.\nNote: The fixative is added directly into the medium to avoid detachment of the cells during aspiration of the culture medium. It is possible to add 4% PFA to the culture medium (for a final PFA concentration of 2%), but then the incubation time doubles. If cells adhere well, it is also possible to aspirate the culture medium and add 4% PFA directly to the well.\nPause point: The plate can be stored at 2°C–8°C for a few weeks before staining.\nStaining of iPSC-derived neurons.\nAspirate the PBS and add 50 μL of the blocking solution to each well. Incubate at RT for 1 h or overnight (12–24 h) at 2°C–8°C.\nPrepare the primary antibody solution in blocking buffer.\nDilute the SMI312 antibody 1:500 and the MAP2 antibody 1:1000.\nAfter the incubation time, aspirate the blocking solution and add 20 μL of the primary antibody solution per well. Seal the plate with parafilm and incubate overnight (12–24 h) at 2°C–8°C.\nThe next day, aspirate the primary antibody solution, and wash each well three times with 50 μL PBS.\nPrepare the secondary antibody solution in blocking buffer including Hoechst 3342.\nDilute both secondary antibodies 1:1000 and Hoechst 33342 1:2500.\nAdd 20 μL of the secondary antibody solution per well. Incubate in the dark at RT for at least 1 h.",
    "After the incubation time, aspirate the secondary antibody solution and wash each well three times with 50 μL PBS. After the last washing step, leave 80 μL of 0.05% sodium azide in PBS in each well.\nFor long-term storage of the plate, seal the plate with parafilm and keep at 2°C–8°C. Check regularly that there is sufficient PBS inside the wells of the plate to prevent the fixed cells from drying out.\nNote: The fluorescent dyes on secondary antibodies are light-sensitive and should not be exposed to incident light. After incubation with secondary antibodies, the plates should also always be protected from the light.\nNote: The exact antibody dilutions might need to be adapted.\nNote: Instead of Hoechst, other nuclear dyes can also be used (e.g., DAPI).\nHCA imaging\nTiming: 0.5–3 h (depending on number of wells and image acquisition settings)\nIn this step, using a HCA imaging platform, images of the wells are acquired in an automated fashion. The described settings are specific for the Operetta® CLS™ together with its software Harmony (Perkin Elmer). Comparable settings exist for other HCA imaging platforms as well.\nSet up the HCA platform and microscope settings.\nPlace the plate in the HCA imaging platform.\nSelect the plate format.\nCheck manufacturers’ comments on plate usage.\nSelect the 20× Air, NA 0.4 objective.\nChoose the non-confocal operational mode.\nChoose a binning of ‘1’.\nDefine the plate layout.\nSelect the wells and the fields within each well that should be imaged.\nNote: These are the setting we determined to work most effectively for us. However, each of the settings might need to be adapted to your specific neuronal cell type, iPSC line, or HCA platform.",
    "Note: It is possible to use confocal operation mode instead of non-confocal. Confocal imaging can provide higher resolution especially if cells adhere not as a monolayer but partially stack upon each other in multiple layers. However, confocal imaging requires higher exposure time and LED power, thus leading to prolonged acquisition time.\nNote: A higher binning is also possible, which increases signal-to-noise ratio, shortens exposure time and thus reduces acquisition time. However, this can lead to decreased spatial resolution.\nNote: Determine which and how many fields need to be imaged to represent the well. In our experience, neurons are likely to attach more closely to the border of the well than in the middle. Therefore, it is useful to include outer fields in the imaging set-up. It is important to point out that outer fields include the border of the well. Thus, individual field comparisons should be avoided, as it is difficult to compare fields with borders (i.e., outer fields) to fields without borders. We recommend to always perform statistical tests on all fields of each well combined.\nCreate a channel for each fluorophore you are using and determine the exposure time, LED power and height (z-off) for each channel.\nSelect one well and field of a well and click snapshot.\nOn the image control panel, use the histogram to verify the maximum value. We recommend decreasing exposure time or LED power to keep the maximum value below 60,000.\nTo determine the height, acquire a z-stack (click ‘Test’, not ‘Snapshot’) and identify the image with the sharpest focus. Enter the respective height for each channel.\nNote: You can set a different height for each channel. This can be helpful as neurites sometimes tend to be at a different focus plane than the nuclei.\nHCA Imaging.",
    "Go to ‘Run Experiment’, name it and click ‘Start’.\nAfter the run is finished, export the data as .tiff files.\nNote: When considering the settings, it is important to find a balance between high-quality images and the time needed to acquire them. As an example, image acquisition with 3 channels of one plate with 100 wells selected and 13 fields of view per well takes about 25 min. With the 20 × objective, it is possible to acquire up to 25 fields of view. We recommend to capture at least 12 fields of view per image to allow robust data collection. However, before starting the acquisition, we suggest imaging some wells with all 25 fields in order to examine whether the cells grow uniformly throughout the well.\nNote: If cells are not in focus, include additional Z-planes. This however increases the acquisition time.\nNote: If working with neurons derived from patients or exposed to treatments, always set up the image acquisition based on a well containing control/untreated neurons. But before starting the analysis, remember to also image the wells containing the diseased/treated neurons. This is important to avoid out-of-focus images and inadequate exposure times.\nHCA image analysis\nTiming: 3–10 h (depending on the computer capacity and number of images to be processed)\nThis step describes the HCA image analysis for the quantification of neurite outgrowth using the open-source software CellProfiler, which allows the processing of images from high-throughput experiments (Figures 2[href=https://www.wicell.org#fig2]A and 2B, and Methods video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1879-Fig2.jpg\nFigure 2. HCA pipeline for neurite quantification\n(A) Schematic representation of the individual steps of the HCA protocol with iPSC-derived neurons.\n(B) Stepwise exemplary images of the HCA protocol generated by CellProfiler analysis. Scale bar: 50 μm.\n(C) Merged color image obtained by HCA microscopy. Scale bar: 50 μm.",
    "(D) Image showing the CellProfiler mask superimposed over the merged grayscale image obtained by HCA microscopy. Scale bar: 50 μm.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. HCA pipeline for neurite quantification using CellProfiler, related to steps 8–10\nThe HCA pipeline, example images to test the pipeline and a video of all the steps can be downloaded here: https://github.com/StemCellMetab/neurite-outgrowth[href=https://github.com/StemCellMetab/neurite-outgrowth].\nSetting up the CellProfiler analysis pipeline.\nOpen the CellProfiler analysis pipeline.\nGo to Images.\nAdd images by dragging and dropping them into CellProfiler.\nGo to Metadata. Enter the extraction method and metadata source.\nTo set an expression to enable CellProfiler to interpret metadata from a file name or folder, click on the magnifying glass. The test text should reflect the name correctly. In case it does not, click ‘Guess’ to update the text or edit it manually.\nClick ‘Submit’.\nClick ‘Update’ to extract and display the metadata in the CellProfiler window.\nGo to NameAndTypes and adjust the settings according to your staining and the naming of your images.\nIn the default settings of our pipeline, channel 1 is set as Hoechst (staining of nuclei), channel 2 is set as MAP2 (dendritic staining), and channel 3 is set as SMI312 (axonal staining).\nSet the default input and output folders.\nSelect the ‘File’ dropdown menu and select ‘preferences’. Select ‘Browse’ next to the ‘Default Output Folder’ and ‘Default Input Folder’.\nEnter a filename for saving.\nGo to the ExportToSpreadsheet Module at the end of the pipeline.\nEnter a name at ‘filename prefix’.\nNote: If you have a very large dataset, CellProfiler might not be able to export to a spreadsheet. In that case, replace the ‘ExportToSpreadsheet’ module with the ‘ExportToDatabase’ module and adjust the settings to your needs.\nTesting and adjusting the pipeline.\nClick on ‘Start Test Mode’.",
    "A green check-mark will appear next to the modules that contain no errors. A red ‘x’ will appear next to the modules that do contain errors. The ‘ExportToSpreadsheet’ module always has a yellow triangle during the test mode. If you hover with the mouse over the red ‘x’, CellProfiler will spell out the exact error.\nUse the ‘step’ button to go through each module. A short description is given in Table 1[href=https://www.wicell.org#tbl1]. Visually check the images and adjust each module according to your cells and image intensity (see also Figure 2[href=https://www.wicell.org#fig2]B).\ntable:files/protocols_protocol_1879_4.csv\nTest the settings on multiple image sets. Select the ‘Test’ dropdown menu to select specific image sets to adjust the settings for images from controls as well as treated cells.\nStarting the analysis.\nExit the test mode (click ‘Exit Test Mode’), disable all windows and click the ‘Analyze Images’ button.\nCellProfiler will now analyze the image sets and export the results to a spreadsheet on the selected drive and folder. The pipeline will also save a spreadsheet containing the used settings (filename prefixExperiment).\nNote: MAP2 and SMI-312 staining distinguish between dendrites and axons, respectively (Figures 2[href=https://www.wicell.org#fig2]C and 2D). The HCA protocol can be adapted also to capture neurites in general, which can be visualized using an antibody against beta-III-tubulin (TUJ1). In this case, change ‘NamesAndTypes’ accordingly, and delete the modules that are duplicated.\nNote: Further statistical analysis of the data and graphical representations might be necessary, and can be carried out using different software (e.g., Microsoft Excel or GraphPad Prism)."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Microscopy",
    "Neuroscience",
    "Cell Differentiation",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}