{
  "id": 7431,
  "origin_website": "Bio",
  "title": "Split-luciferase Complementation Imaging Assay to Study Protein-protein Interactions in <em>Nicotiana benthamiana </em>",
  "procedures": [
    "Preparation of N. benthamiana plants (4 weeks)Sow N. benthamiana seeds in a 1:1 mix of potting soil and vermiculite, cover the pot with plastic film, and then plant them in a controlled growth chamber under long day conditions (16-h light/ 8-h dark) at 25°C with 70% humidity and a light intensity of 130 mE m-2s-1 (Figure 1).Transfer 10-day-old seedlings into individual pots (e.g., 10 × 10 cm), and let them grow until they are 4 weeks old (Figure 1).Note: Water plants and control pests as needed to keep plants healthy. Fertilizer can be added if necessary. Healthy plant material is essential for efficient transient expression of the POIs, and hence for the success of the experiment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4237/bioprotoc-11-23-4237-g001.jpgFigure 1. Cultivation of N. benthamiana plants for transient expression experiments.  Arrows indicate leaves suitable for infiltration. The age of the plants used is indicated.Vector constructionGateway-compatible binary vectors (pGWB-NLuc and pGWB-CLuc) were generated from the original pCAMBIA1300-NLuc/CLuc vectors (Chen et al., 2008) by integrating the Gateway cassette (Figure 2) (Wang, Y. et al., 2019;        Yu et al., 2020). To generate the constructs that encode the fusion POIs, these vectors can be used in combination with Gateway cloning (alternatively, the original vectors can be used in combination with traditional cloning). The Gateway cloning procedure is outlined below.Clone the genes encoding the POIs into a Gateway entry vector (e.g., pDONRTM 207, Thermo Scientific) through a BP reaction (Thermo Scientific, GatewayTM BP ClonaseTM Enzyme mix) following the manufacturer’s instructions (www.thermofisher.cn[href=http://www.thermofisher.cn]) and transform each reaction solution into E. coli competent cells. Perform colony PCR to select positive clones and confirm them by sequencing.Subclone the cloned genes into the destination vectors, pGWB-NLuc and pGWB-CLuc, through an LR reaction (Thermo Scientific, GatewayTM LR ClonaseTM Enzyme mix), following the manufacturer’s instructions (www.thermofisher.cn[href=http://www.thermofisher.cn]), and transform each reaction solution into E.",
    "coli competent cells. Perform colony PCR to select positive clones and confirm them by sequencing.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4237/bioprotoc-11-23-4237-g002.jpgFigure 2. Gateway-compatible vectors for Split-LUC imaging assay in plants. Schematic diagrams showing pGWB-NLuc (A) and pGWB-CLuc (B) vectors (visualized in Snapgene). The size of the plasmids in bp is indicated. Promoters, terminators, open reading frames, attR1, attR2, and T-DNA are shown in the maps. CaMV: Cauliflower mosaic virus; LB: left border; RB: right border; ccdB: Control of Cell Death B (gene); HygR: Hygromycin resistance (gene); KanR: Kanamycin resistance (gene); CmR: Chloramphenicol resistance (gene). (C) Schematic representation of the cassettes to express the fusion proteins. POI, protein of interest.Agrobacterium-mediated transient expression in N. benthamiana Prepare and autoclave LB medium (103 kPa/121°C/15 min). Cool down LB medium with agar until the bottle can be touched with bare hands (but is still in liquid form), add the appropriate antibiotics (50 μg/ml kanamycin, 50 μg/ml gentamicin, and 25 μg/ml rifampicin), and pour the medium into Petri dishes.Transform the plasmids generated in B (Vector construction), as well as appropriate controls, into A. tumefaciens cells by chemical transformation. Competent A. tumefaciens cells (GV3101) can be purchased (see Materials and Reagents above) or prepared using standard protocols (e.g., Kaman-Toth et al., 2018).Perform colony PCR with specific primers to detect the positive clones. Inoculate one positive single A. tumefaciens colony from each plate into 5 ml of LB liquid medium containing antibiotics (50 µg/ml of kanamycin, 25 µg/ml of rifampicin, and 50 µg/ml of gentamicin) in a 15 ml tube, with shaking at 220 × g at 28°C for 16-24 h until OD600 = 0.5-1.5.Note: The volume depends on the number of leaves to be inoculated. Usually, A. tumefaciens cells cultured from 5 ml LB medium should be enough for the later inoculation of at least three N. benthamiana leaves.",
    "Optional step: Make a glycerol stock for individual A. tumefaciens clones (to a final 30% glycerol concentration) in a tube (e.g., 1.5 ml microcentrifuge tube) and store at -80°C. Before using, streak out the A. tumefaciens clones carrying the desired plasmids on solid LB medium with the corresponding antibiotics (50 µg/ ml of kanamycin, 25 µg/ml of rifampicin, and 50 µg/ml of gentamicin), and incubate them at 28°C for 24-48 h. Grow a liquid culture of each A. tumefaciens clone at 28°C for 12-16 h to an OD600 = 0.5-1.5. If this step is not needed, proceed to step 5.Centrifuge the bacteria at 4,000 × g, room temperature, for 10 min and discard the supernatant.Note: The supernatant should be removed completely, so the use of a micropipette is advised. Resuspend the A. tumefaciens cells in the infiltration buffer (see Recipe 1) to a final concentration of OD600 = 0.1-0.5. Note: The ﬁnal OD600 is important for transient transformation. The optimal OD should be experimentally determined.  Mix equal volumes of A. tumefaciens clones carrying the desired plasmids to express protein A-NLuc or CLuc-protein B to prepare the infiltration solution (Figure 3A). Appropriate controls (both positive and negative) are required.Note: To rule out nonspecific interactions and artifactual signals, the protein used as negative interaction control should have the same subcellular localization as the POIs. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4237/bioprotoc-11-23-4237-g003.jpgFigure 3. Illustration of the infiltration process. Keep the infiltration solution at room temperature and in the dark for 2-6 h.Note: During the incubation, acetosyringone from the infiltration buffer induces the expression of the virulence genes of A. tumefaciens, thus facilitating the transfer and incorporation of the T-DNA region into the host plant genome. This step, therefore, is advisable for effective transformation. Select fully expanded leaves of 4-week-old N. benthamiana plants for infiltration (Figure 1, Figure 3B).",
    "Infiltrate the A. tumefaciens inoculum carefully into the selected leaves using a 1 ml needleless syringe. Infiltration is performed on the abaxial side (Figure 3B), and pressure is applied with the fingertip on the adaxial side (Figure 3C).Notes:  Infiltration of N. benthamiana works better in dry leaves without water droplets from condensation or contact with other leaves. On the abaxial side of the leaf, pricking softly with a needle (e.g., from a 1 ml syringe) helps ease infiltration. To avoid damaging plant leaves, apply the infiltration slowly without too much pressure. Choose healthy leaves of similar size. At least three independent leaves from different plants need to be used for biological replicates. Infiltrate the A. tumefaciens inoculum carrying POIs and negative control side-by-side in the same leaf (Figure 3D) to avoid leaf-to-leaf variation.Note: Use 75% ethanol to clean your gloves before moving to another inoculum during infiltration to avoid cross-contamination. Use a permanent marker pen to label the infiltrated area (Figure 3E). Gently wipe the wet surface of the leaf with tissue paper.Place the plants in the growth chamber for 36-48 h (e.g., 2 days) before measuring luciferase activity. Accumulation of the transiently expressed proteins can usually be detected at 36-60 h post inoculation (hpi).Measurement of luciferase activity with a CCD imaging systemInfiltrate 1 mM luciferin solution (in H2O) into the inoculated leaves 2 days after A. tumefaciens infiltration.Detach the whole leaves and keep them in the dark for 10 min before imaging to avoid interference by chlorophyll luminescence.Capture luminescence images using a CCD imaging apparatus (e.g., NightShade LB985) with an IndiGO software and measure the relative luciferase activity (luminescence intensity/cm2 leaf area) following the manufacturer’s instructions as shown in Figure 4.",
    "Notes:   Since the luminescence will be low, the camera must be cooled down to the default temperature, and luminescence images must be captured in the dark. Adjust the exposure time (Figure 4E) according to the signal intensity.  Since the detection of luminescence relies on the abundance of reconstituted luciferase protein, the accumulation of all tested proteins and controls must be assessed by western blotting with anti-luciferase antibodies (Rabbit polyclonal anti-Luciferase, Sigma, Cat# L0159), which recognize both NLuc and CLuc. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4237/bioprotoc-11-23-4237-g004.jpgFigure 4. Illustration of the measurement of the relative luciferase activity in Split-LUC imaging assays. The example shows the self-interaction of the viral protein V2, encoded by the geminivirus tomato yellow leaf curl virus (TYLCV, GenBank accession number: AJ489258). “1” indicates the area co-expressing V2-NLuc and CLuc-SlWRKY75 (negative control); “2” indicates the area co-expressing V2-NLuc and CLuc-V2 (experiment).Export the images (.png format) of the Split-LUC imaging assay from the IndiGO software by clicking “Export Image” (Figure 4I).Export the values of the relative luciferase activity in the defined regions of interest (ROI) for all samples and controls from the IndiGO software by clicking “RichText Report” (Figure 4I). Open the RichText Report (.rtf) file with a text processor (e.g., the Microsoft Word program) and copy the analysis details of the relative luciferase activity to a spreadsheet (e.g., Excel) (Table 1).Note: The average value of the relative luciferase activity in the ROI is equal to the total signal value of the ROI (Overall) divided by the number of pixels. Table 1. Example of the values of relative luciferase activity per ROI from the experiment depicted in Figure 4Htable:",
    "﻿0,1,2,3,4,5,6,7\nArea Details,Area Label,Area [mm2],Border [mm],Width [mm],Height [mm],Pixel,Background\nArea Details,ROI 1,208.89,51.29,15.68,16.96,9642,No\nArea Details,ROI 2,221.94,53,15.68,18.02,10213,No\nAnalysis Details,Area Label,Overall [cps],Average [cps],Min [cps],Max [cps],Variance [cps],Deviation [cps]\nAnalysis Details,ROI 1,48669,5.05,2,9,729.2,27\nAnalysis Details,ROI 2,1242420,121.65,1,377,5191470.29,2278.48\nCps: counts per second"
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}