{
  "id": 17667,
  "origin_website": "Jove",
  "title": "Assessment of Dependence in Activities of Daily Living Among Older Patients in an Acute Care Unit",
  "procedures": [
    "The protocol has been approved by the human research ethics committee of the University Hospital of Bordeaux.\nNOTE: The protocol described in this section involves evaluation of ADL dependence using the Katz ADL. The six activities assessed are described above18. The Katz ADL is administered at the Bordeaux University Hospital, on admission and discharge, to all patients over 75 years of age, i.e., all those in acute geriatric medicine wards. Inpatients in geriatric units present with numerous comorbidities and it is recommended that staff assess all such patients. In theory, the Katz ADL could be administered to all patients at risk of losing their independence due to an acute medical problem, which would include some younger patients. However, ADL dependence is infrequent in younger adults, as the prevalence of disabling diseases is low in that population. Nevertheless, the protocol could also be implemented in other departments, particularly internal medicine, cardiology, and neurology.\n1. Protocol for administering the Katz ADL before hospitalization\nEvaluate bathing activity.\n\t\nTo evaluate bathing, ask patients how they bathe and whether they need someone to help them with bathing. If so, ask them which part of the body they require help with. Then, note whether they are independent (1 point) or dependent (0 point) in bathing activities.\n\t\tNOTE: Independent patients bathe their entire body alone, with the exception of the back, genital area, or a disabled extremity. Dependent patients need help to bathe several parts of their body, or to get in and out of the shower or bathtub.\nEvaluate dressing.",
    "Ask patients whether they can dress and undress alone, and whether they can take their clothes out of the closet without help. Ask whether they need help with putting on socks or other items of clothing. Then, note whether they are independent (1 point) or dependent (0 point) in dressing activities.\n\t\tNOTE: An independent person gets their clothes out of the closet and puts them on, including fastening them where applicable. Shoe tying is not included among dressing activities. A dependent person needs some help with dressing or needs to be completely dressed by someone else.\nEvaluate toileting.\n\t\nAsk patients whether they go to the toilet unassisted at home. Ask whether they can sit down and stand up from the toilet, arrange their clothing as needed, and clean the genital area without help. Then, note whether they are independent (1 point) or dependent (0 point) in toileting.\n\t\tNOTE: An independent person goes to the toilet, sits and stands up from the toilet, arranges clothes, and cleans the genital area without help. A dependent person needs help transferring to the toilet and cleaning up, or uses a bedpan or commode.\nEvaluate transferring.\n\t\nAsk patients whether they can move from the bed to a chair, and from a chair to the bed, without human assistance. Then, note whether they are independent (1 point) or dependent (0 point) in transferring.\n\t\tNOTE: An Independent person moves into or out of a bed or chair unassisted or using a mechanical transferring aid. A dependent individual needs help from another person to move from a bed to a chair or requires a complete transfer.\nEvaluate continence.",
    "Ask patients whether they have complete self-control over urination and defecation. If not, ask whether they can use a urinary catheter or diaper without help. Then, note whether they are independent (1 point) or dependent (0 point) with respect to continence.\n\t\tNOTE: Independent patients exercise complete self-control over urination and defecation, or use a urinary catheter or diapers without help. The dependent person is partially or totally incontinent (bowel or bladder) and needs help to manage these functions.\nEvaluate feeding.\n\t\nAsk patients whether they eat without help; if so, ask whether they are able to cut meat or open the lid of a yogurt container. Then, note whether they are independent (1 point) or dependent (0 point) in feeding activities. An independent person can eat a prepared and delivered meal without assistance.\n\t\tNOTE: An independent person transfers food from the plate into the mouth without help. A dependent person needs partial or total help with feeding.\nCalculate the ADL score by summing the scores for all activities.\n2. Administration of ADL scale on hospital admission\nBathing\n\t\nDuring the first day of hospitalization, offer patients a shower. If they feel able to take one, accompany them to the bathroom and check whether they are able to wash by themselves. If patients do not feel able to do this, offer to wash them in bed or at the basin.\nObserve whether patients are able to do this on their own or whether they need guidance or help with certain parts of the body. Then, note whether they are independent or dependent in bathing (following the same definition of independent and dependent as in step 1.1).\nDressing",
    "During the first day of hospitalization, propose that patients get dressed. Ask them to choose clothes from the closet and put them on; if patients have difficulty, help them to get dressed.\nIn the evening, follow the same procedure, but as applied to undressing.\nNote whether the patient is independent or dependent in dressing (following the same definition of independent and dependent as in step 1.2).\nToileting\n\t\nDuring the first few days of hospitalization, check whether patients are able to go to the toilet alone, sit and stand up from the toilet, arrange their clothing, and clean the genital area.\nEvaluate whether a commode or bedpan is needed. Note whether patients are independent or dependent in toileting (following the same definition of independent and dependent as in step 1.3).\nTransferring\n\t\nOn the first day of hospitalization, ask patients to transfer from the bed to a chair and from the chair to the bed. If patients have any difficulty, first offer mechanical transferring aids, and if necessary, help them to make the transfer. Then, note whether patients are independent or dependent for transferring (following the same definition of independent and dependent as in step 1.4).\nFeeding\n\t\nDuring the first meal at the hospital, observe whether patients are able to eat alone, including cutting meat and opening the lid of a yogurt container. Help them if necessary. Then, note whether the patient is independent or dependent for eating (following the same definition of independent and dependent as in step 1.6).\nCalculate the ADL score by summing the scores for all activities.\n3. Compare functional independence scores before the acute medical problem and at the time of hospital admission",
    "Identify the activities in which patients have lost independence during the acute medical problem. Identify activities in which patients were dependent prior to the problem.\nEncourage patients to regain their lost independence through rehabilitative care.\nHelp to maintain any independence that was not lost during the acute medical problem.\n4. Recalculate ADL score throughout hospitalization (twice per week)\nPerform the same assessment steps described in Step 2.\nDiscuss the assessment results during a staff meeting where nurses, nurse assistants, physicians, and physiotherapists are present.\nCompare ADL scores to identify improvement or deterioration of functional independence.\nMaintain or modify rehabilitative care according to the evolution of functional independence; the goal is for patients to recover their former level of independence.\n5. Evaluate the ADL score at discharge and compare it to the score prior to hospitalization\nDetermine whether patients have lost functional independence as a result of the acute medical problem.\nAdapt the home help protocol as needed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}