{
  "id": 4147,
  "origin_website": "Cell",
  "title": "Fluorescent in situ mRNA detection in the adult mouse cochlea",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nExtraction of the otic capsule\nTiming: [60 min, followed by incubation for 12–16 h]\nEuthanize the four-week-old mice (postnatal day (P) 28). Male and female mice are used.\nNote: The workflow and timing information assumes that three mice (6 cochleae) are used.\nDecapitate the mouse and bisect the skull with two scissor cuts, the first from the base of the brainstem above the skull to the nose and the second from the base of the brainstem to the lower jaw.\nRemove the brain tissue to expose the otic capsules (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/910-Fig1.jpg\nFigure 1. Dissection of the cochlear apical turn\n(A) Bisected P28 mouse head. The otic capsule containing the cochlea and the vestibular system is outlined with a green dashed line.\n(B) Dissected mouse otic capsule. Green arrowhead denotes the apical turn crease that is targeted to create a window in the apex.\n(B′) Magnified image of the cochlea’s apex. The arrow points to the crease of the apical turn that is used as a toehold for creating a window in the apex.\n(B’’) Otic capsule with the apical bone removed. The pried-off bone piece is seen to the right of the otic capsule.\n(B’’’) A higher magnified view of the window made at the apex of the otic capsule.\n(C) Otic capsule after removal of bone to create window in the apex. The location of the round window is indicated by a blue dashed line and the oval window is outlined with a purple dashed line.\n(C′) Magnified image of the round window (blue dashed line) and oval window (purple dashed line).\n(C’’) Otic capsule after the removal of the bone covering the sensory epithelium.\n(C’’’) Magnified image of the exposed cochlear turns after bone removal.",
    "(D) Dissected apical turn after excess stria vascularis and spiral ganglion tissue was removed.\n(D′) Strong Myo15Cre-tdTomato expression is associated with P28 inner hair cells and lower levels are observed in outer hair cells in the shown apical turn. Some spiral ganglion cells also express tdTomato.\nExtract each otic capsule by applying pressure with a gloved thumbnail above the apex of the cochlea. Hold a bisected skull in the left hand and apply pressure to the tissue behind the otic capsule so that the capsule is pushed upwards, while simultaneously pushing down on the semicircular canal with the other thumb. This will lift the otic capsule so that it can be removed from the surrounding tissues using RNase-free forceps and placed directly into 4% PFA solution.\nCritical: Transfer the extracted otic capsules directly into 4% PFA solution at room temperature (18°C–24°C).\nCaution: PFA is a hazardous material, and the following steps need to be conducted using a dissection microscope inside a chemical hood.\nPerfuse 4% PFA solution into the round and oval windows of the isolated otic capsule.\nTransfer the isolated otic capsules into 4% PFA solution in a 35×10 mm dish, coated with black Sylgard for dissections (Montgomery and Cox, 2016[href=https://www.wicell.org#bib3]).\nUsing a curved pair of sharp forceps or an 18-gauge needle that has been curved on a sharpening/grinding block, place the curved sharp tip along the crease of the apical cochlear turn and apply gentle pressure to remove a fragment of the apical bone (Figures 1[href=https://www.wicell.org#fig1]B and 1B′). This movement generates a small window at the apex (Figures 1[href=https://www.wicell.org#fig1]B’ and 1B’’).",
    "Using a 30-gauge needle, slowly perfuse about 100 μL of 4% PFA solution into the round and oval windows (blue and purple dotted circles in Figure 1[href=https://www.wicell.org#fig1]C, respectively). Slowly push the solution through the cochlea using gentle pressure, at a flow of ≈50 μL per minute. The solution will flow out of the window made in the apex.\nNote: Remove the stapes with forceps to allow for easier perfusion.\nCritical: Thorough perfusion with 4% PFA solution is essential for completely fixing the tissue. Additionally, this process makes the sensory epithelium more rigid, mediating easier removal from the bone.\nPlace the perfused cochleae into a 2 mL Eppendorf tube containing 1.8 mL of 4% PFA solution.\nIncubate 12–16 h on a shaker set to gentle rocking at 4°C.\nNote: Separate the left and right cochleae into different Eppendorf tubes to help with subsequent orientation of the tissue.\nCritical: Limit the number of otic capsules that are placed in the 1.8 mL of fixative to six to ensure thorough fixation.\nDissection of all three cochlear turns from decalcified otic capsules\nTiming: [4 h 30 min]\nAfter overnight fixation, transfer the cochleae into RNase-free 0.5 M EDTA solution pH 8.0.\nIncubate for 3 h with slow agitation with an Eppendorf tube revolver rotator (Fisher Scientific Hematology/Chemistry Mixer 346) at room temperature.\nRinse the cochleae once in RNase-free PBS and then transfer the cochleae into RNase-free PBS at room temperature for dissection.",
    "Critical: The cochlear bone will not be fully decalcified after 3 h, however it will be softened enough to remove the cochlear turns. Additional decalcification will result in easier dissection, but prolonged EDTA treatment can reduce downstream mRNA detection efficacy (Belluoccio et al., 2013[href=https://www.wicell.org#bib1], Shao et al., 2006[href=https://www.wicell.org#bib5]). For immunostaining, we have not noticed adverse effects of extended decalcification times (for up-to 6 days).\nNote: Even with a short 3 h EDTA decalcification time, we have noted that Otof mRNA detection levels where affected when directly compared to non-decalcified tissue.\nNote: Protocols have suggested that co-incubation of EDTA with RNAlater solution (Invitrogen) improves RNA preservation and detection (Belluoccio et al., 2013[href=https://www.wicell.org#bib1]). We have not systematically investigated the effects of RNAlater on wholemount samples, but have noted no clear improvement of mRNA detection in experiments on cryosectioned cochlear tissue. Future optimization is warranted to see if this protective step can further improve mRNA detection in wholemount cochleae.\nNote: Decalcified otic capsule dissection was done according to (Montgomery and Cox, 2016[href=https://www.wicell.org#bib3]).\nAfter decalcification, insert one blade of Vannas Spring Scissors into the oval window (purple dotted line in Figures 1[href=https://www.wicell.org#fig1]C and 1C′) and cut along the turn towards the apex.\nTo separate the basal turn from the middle and apical turn, place one scissor blade into the region cut in step 9 with the other scissor blade on the back of the cochlea and cut.\nHold the apical/middle turn so that the apical end points down. Cut along the scala media.\nTo separate the middle and apical turns, place one scissor blade into the region that was cut in step 11 and place the other blade on the outside of the bony labyrinth and cut.",
    "To remove the basal turn, cut the spiral ganglion fibers that connect to the basal turn and cut along the lateral wall.\nUse the scissors to remove excess bone and spiral ganglion tissue.\nTo help with removal of surrounding tissue, as it is sometimes challenging to get the correct angle with the scissors, transfer turns to a 35×10 mm plastic Petri dish filled with RNase-free PBS and use a 0.1 mm thick scalpel blade mounted to a blade holder to remove excess tissue.\nDissection of the apical turn, without decalcification\nTiming: [45 min]\nWe describe in the following an alternative dissection that focuses on the apical turn. The benefit of this dissection is that it can be done without decalcification, which increases the sensitivity of subsequent mRNA detection. The following steps should be conducted after step 5 and instead of steps 6–15.\nFollowing the overnight fixation, transfer the cochleae into RNase-free PBS without Ca2+/Mg2+ for dissection.\nNote: The samples should be processed immediately for best signals and not stored at 4°C.\nUse the sharp tip of a curved 18-gauge needle to chip away the bone from the cochlear apical turn (Figures 1[href=https://www.wicell.org#fig1]B and 1B′).\nUse the curved tip to gently hook the bone and to chip it away from the apical window opening that was previously made (Figures 1[href=https://www.wicell.org#fig1]B’’ and 1B’’’) until all the bone surounding the sensory epithelium is removed. An example of a cochlea after the bone surrounding the sensory epithelium is removed is shown in (Figures 1C’’ and 1C’’’).\nCritical: Scrape the region between the stria vascularis and the bone with the sharp needle to gently separate the two compartments. This step decreases the chance of removing the sensory epithelium along with the chipped bone.",
    "Note: Carefully bend the tip of the 18-gauge needle to generate a sharp curved “hook”.\nUse Vannas Spring Scissors to dissect the apical turn.\nRemove excess stria vascularis tissue with the scissors.\nTo aid with removal of surrounding tissue, as it is sometimes challenging to get the correct angle with the micro scissors, transfer apical turns to a 35×10 mm plastic Petri dish filled with RNase-Free PBS, and use a 0.1 mm thick scalpel blade mounted to blade holder to remove excess tissue. After excess tissue is removed you will be left with an apical turn with hair cells visualization as presented in (Figures 1[href=https://www.wicell.org#fig1]D and 1D′).\nNote: A disposable scalpel may not be thin enough to aid in this dissection step. The thinner 0.1 mm breakable FST blades (Cat# 10050-00) are recommended.\nNote: It is possible to remove parts of the middle and basal turns from non-decalcified cochleae. However, these turns are difficult to reliably extract because the tissue tends to tear between the outer and inner hair cells resulting in removal of outer hair cells. For analyses of inner hair cells only and potentially also spiral ganglion cells, one can use such tissue for downstream RNA detection.\nCritical: Use a micro spoon to transfer fully immersed tissue.\nMounting of cochlear turns to slide\nTiming: [20 min]\nCut in half a sheet of Secure-Seal™ hybridization chamber system (hybridization chamber) for two stripes of four chambers each (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/910-Fig2.jpg\nFigure 2. Mounting Hybridization chambers and humidifying chamber\n(A) One stripe of four hybridization chambers placed onto a microscope slide.",
    "(B) A piece of Post-it paper is cut to the dimensions of a microscope slide and four ≈ 9 mm circles or dots are made that align with the circular hybridization chambers to create a visual guide. The sticky section of the Post-it aligns with the frosted end of the slide.\n(C) A Superfrost Plus microscope slide is placed on top of the visual guide and the sticky part of the Post-it paper is used to hold the visual guide in place.\n(D) Microcentrifuge storage box used as humidifying chamber. The slots are filled with pieces of paper towel and water.\n(E) A plastic inset of a pipette tip box is used as a slide holder.\nUse a marker to outline four 9 mm diameter circles on a piece of paper that align with the four hybridization chambers. (Figure 2[href=https://www.wicell.org#fig2]B). A Post-It note is useful for this because it can be temporarily attached to the back of a microscopy slide, preventing the visual guide from moving (Figure 2[href=https://www.wicell.org#fig2]C).\nPlace 10 μL of RNAse-free PBS without Ca2+/Mg2+ onto the front of the Superfrost Plus microscope slide corresponding to each marked region (Figure 2[href=https://www.wicell.org#fig2]C).\nTransfer the sensory epithelium turns into the 10 μL PBS drop using a micro spoon and orient the turns using a pair of forceps using a dissection microscope.\nNote: It is possible to place and orient up to five cochlear turns into each 10 μL drop as long as they do not overlap when mounted.\nCritical: Orient the tissue so that the hair cells are facing upwards with the bundles pointing toward the surface.\nAfter the tissue specimens are correctly oriented, carefully remove excess PBS with a pipette, and allow to air dry for about 5 min.",
    "Critical: Carefully monitor sample drying, allowing just enough time for the solution to evaporate and avoiding over-drying of the samples.\nAttach the hybridization chambers over the designated regions and fill the wells carefully with 50 μL RNase-free PBS.\nHybridization chain reaction (HCR) protocol modifications\nThe HCR v3.0 Protocol (Choi et al., 2018[href=https://www.wicell.org#bib2]) was used for mRNA detection in the presented examples. HCR has been commercialized and additional information is available at www.molecularinstruments.com[href=http://www.molecularinstruments.com].\nFor mRNA detection in cochlear whole mount tissues, we use a modified HCR protocol. The original protocol can be found in the supplemental section of the HCR publication (Choi et al., 2018[href=https://www.wicell.org#bib2]) and an updated version of the protocol can be found at https://files.molecularinstruments.com/MI-Protocol-HCRv3-frozentissue-Rev1.pdf[href=https://files.molecularinstruments.com/MI-Protocol-HCRv3-frozentissue-Rev1.pdf].\ntable:files/protocols_protocol_910_7.csv\nNote: a detailed composition of the reagents used including probe hybridization buffer, probe wash buffer, and amplification buffer are provided by Molecular Instruments and can be found in their protocol (Choi et al., 2018[href=https://www.wicell.org#bib2]). For convenience and reproducibility, we used the commercially available buffers from Molecular Instruments.\nNote: Detection step modifications:\nWe used 2× the probe concentration that is recommended in the original protocol.\nNote: Amplification step modifications:\nSnap-cool amplifier hair pins on ice for 5 min, instead of the suggested 30 min at room temperature.\nSample preparation\nTiming: [20 min]\nGently remove the PBS from each well in the hybridization chamber and add 50 μL of diluted Proteinase K solution to each chamber and incubate for 2.5 min at room temperature.\nNote: We dilute Proteinase K (800 units/mL) 1:400 in PBST and prepare the solution fresh for each use.\nCritical: Proteinase K concentration and duration may need to be optimized as each batch is slightly different. A final concentration of 2 units/mL is a good starting point.",
    "Gently remove the Proteinase K solution using a pipette and perform three 30 s washes with 50 μL PBST followed by 50 μL PBST for 5 min.\nCritical: Manually aspirate the solution with a P200 pipette and be careful not to dislodge the mounted tissue.\nDetection\nTiming: [30 min, followed by incubation for 12–16 h]\nTiming: [90 min] for step 34\nPre-warm a humidified plastic chamber to 37°C.\nNote: A plastic microcentrifuge tube storage box makes a good humidifying chamber when the individual compartments are filled with a piece of paper towel and water is added (Figure 2[href=https://www.wicell.org#fig2]D). A plastic inset from a P1000 pipette box is used as a slider holder and avoids excess condensation on the slide (Figure 2[href=https://www.wicell.org#fig2]E).\nReplace the PBS in each hybridization chamber with 50 μL of HCR probe hybridization buffer for pre-hybridization.\nNote: Pre-heat probe hybridization buffer to 37°C.\nCaution: Probe hybridization buffer contains formamide, a hazardous material.\nPre-hybridize for 10 min inside the humidified chamber at 37°C.\nDuring pre-hybridization, prepare probe hybridization solution by adding 2 μL of 1 μM probe stock to 250 μL of hybridization buffer.\nNote: if multiple probes are used, combine them all into the 250 μL hybridization buffer.\nRemove the pre-hybridization solution with a P200 pipette.\nImmediately add 50 μL of the probe hybridization solution into each of the hybridization chambers.\nPlace sealing tabs over the chamber port holes, press them tightly onto the holes, and incubate overnight (12–16 h) at 37°C in the humidified chamber.\nThe next day, remove the probe hybridization solution and replace with HCR probe wash buffer that has been pre-heated to 37°C.\nCritical: Be sure to use different pipette tips to avoid cross contamination of probe combinations if performing multiple HCR probe combinations.",
    "Critical: It is important to perform buffer exchange steps carefully using a pipette. Vacuum aspiration increases the likelihood of dislodging and aspirating the samples.\nCaution: Probe wash buffer contains formamide, a hazardous material.\nRemove excess probes by incubating sample hybridization chambers at 37°C in 50 μL of:\n75% of probe wash buffer / 25% 5× SSCT for 15 min\n50% of probe wash buffer / 50% 5× SSCT for 15 min\n25% of probe wash buffer / 75% 5× SSCT for 15 min\n100% 5× SSCT for 15 min\nNote: Pre-heat probe wash buffer and 5× SSCT solutions to 37°C.\nIncubate samples in 5× SSCT for 5 min at room temperature.\nAmplification\nTiming: [60 min, followed by incubation for 12–16 h]\nTiming: [75 min] for step 44\nAdd 50 μL of amplification buffer into each hybridization chamber and incubate in a humidified chamber (Figures 2[href=https://www.wicell.org#fig2]D and 2E) for 30 min at room temperature.\nNote: Equilibrate an aliquot of HCR amplification buffer to room temperature before use.\nNote: The final amount of hairpin solution needed depends on the number of experiments/hybridization chambers used; each hybridization chamber requires 50 μL to fill.\nFor each hybridization chamber, aliquot 1 μL of hairpin H1 (3 μM stock) of desired fluorophore into a fresh tube.\nFor each hybridization chamber, aliquot 1 μL of hairpin H2 (3 μM stock) of desired fluorophore into a fresh tube.\nNote: Use at least 4 μL of solution for each tube for heat shock treatment.\nNote: We have used up to 3 different hairpins-fluorophore combinations simultaneously.\nHeat the tubes containing hairpins at 95◦C for 90 s and then snap-cool on ice in the dark for 5 min.",
    "Prepare hairpin solution by adding snap-cooled H1 hairpins and snap-cooled H2 hairpins to amplification buffer at room temperature. Add 1 μL of each hairpin per 50 μL.\nRemove the amplification buffer from the hybridization chambers.\nAdd 50 μL of the hairpin solution in amplification buffer into each of the hybridization chambers.\nSeal the hybridization chambers with adhesive seal tabs that come with Secure-Seal™ hybridization chamber system and incubate overnight (12–16 h) in a dark humidified chamber at room temperature.\nRemove excess hairpins by incubating slide hybridization chamber in 5× SSCT at room temperature twice for 30 min, followed by a single wash for 15 min.\nNote: At this stage, if the goal is to perform immunostaining along with the HCR protocol, continue to the Immunostaining following HCR mRNA detection section (below). Otherwise, complete the HCR only protocol with mounting the samples for microscopy (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/910-Fig3.jpg\nFigure 3. Wholemount hybridization chain reaction in situ mRNA detection in cochlear hair cells\n(A) P28 mouse cochlear apical turn results after hybridization chain reaction protocol. Ocm-mRNA is shown in green and Otof-mRNA is shown in magenta.\nThe magnified panel (A′) shows expression of Ocm-mRNA in outer hair cells and Otof-mRNA in inner hair cells.\n(B) tdTomato fluorescence labels inner hair cells and outer hair cells.\n(B′) shows a magnified region.\n(C) Ocm-mRNA expression.\n(C′) shows a magnified region.\n(D) Otof-mRNA expression.\n(D′) shows a magnified region.\nSample mounting for microscopy\nTiming: [2 h]\nIncubate with DAPI at 1:1000 in PBST for 15 min at room temperature.\nWash with PBST for 15 min at room temperature.\nReplace PBST with 50 μL of 50% glycerol for each hybridization chamber.",
    "Critical: Do not allow the samples to dry after removal of the hybridization chambers. Brief equilibration in 50% glycerol lowers the chances of drying out the sample.\nRemove glycerol solution and then remove the adhesive Secure-Seal™ hybridization system.\nAdd a drop of FluorSave™ Reagent onto each sample.\nPlace cover slip and allow the mounting solution to dry in the dark at room temperature for 1 h.\nCritical: Gently lower coverslip to avoid bubble formation.\nCritical: Avoid excessive coverslip adjustments, as this will dislodge and possibly damage the sensory epithelium.\nAdd a small amount of clear nail polish along edge of the coverslip to permanently secure the coverslip.\nProceed with confocal microscopy image acquisition and analysis.\nNote: Completion of the HCR only protocol results in detection of mRNA expression within the wholemount cochlea apical turn (Figure 3[href=https://www.wicell.org#fig3]).\nImmunostaining following HCR mRNA detection\nDirectly after the removal of excess hairpins with 5× SSCT in step 44 of the amplification stage HCR protocol, continue with the following steps.\nPrimary antibody incubation\nTiming: [2 h, followed by incubation for 12–16 h]\nEquilibrate the sample for 5 min in antibody wash buffer.\nReplace the antibody wash buffer with blocking buffer and incubate at room temperature for 2 h.\nPrepare diluted primary antibody solution by diluting the primary antibody in antibody incubation buffer.\nNote: Briefly centrifuge the tube of primary antibody prior to taking aliquot to collect all solution at the bottom of the tube for easier pipetting.\nNote: Dilute primary antibody as needed. We used mouse anti-Ctbp2 (1:200) and rabbit anti-Myo7a (1:1000) for the presented examples. Amount of primary antibody used is dependent on the number of hybridization chambers used; each hybridization chamber requires 50 μL to fill.",
    "Add 50 μL of diluted primary antibody incubation solution to each hybridization chamber and incubate in a humidified box overnight (12–16 h) at 4°C.\nSecondary antibody incubation\nTiming: [2 h 30 min]\nRemove excess primary antibodies by washing three times with 50 μL of antibody wash buffer, each time for 15 min at room temperature.\nPrepare a diluted secondary antibody solution by diluting the secondary antibody in antibody incubation buffer.\nNote: Briefly centrifuge the tube of secondary antibody prior to taking aliquot to collect all solution at the bottom of the tube for easier pipetting.\nNote: Dilute secondary antibody as needed. We used Donkey anti-mouse Alexa-fluor 647 (1:200) or donkey anti-rabbit Alexa-fluor 647 (1:200) to correspond with species of the primary antibody used for the presented examples.\nAdd 50 μL of secondary antibody solution to each hybridization chamber and incubate at room temperature for 60 min.\nRemove excess secondary antibodies by washing the samples three times with 50 μL of antibody wash buffer, each time for 15 min at room temperature.\nAdd 50 μL of DAPI solution (1:1000 DAPI dilution in PBST) and incubate for 15 min at room temperature.\nReplace DAPI solution with 50 μL of PBST and incubate for 15 min.\nSample mounting for microscopy\nTiming: [90 min]\nRemove PBST and add 50 μL of 50% glycerol to each hybridization chamber.\nRemove glycerol solution and adhesive Secure-Seal™ hybridization system.\nAdd a drop of FluorSave™ Reagent onto each sample.\nCritical: Do not allow the samples to dry after removal of the hybridization chambers. Brief equilibration in 50% glycerol lowers the chances of drying out the sample.\nPlace cover slip and allow to dry in the dark for 1 h at room temperature.\nCritical: Avoid excessive coverslip adjustments, as this will dislodge and possibly damage the sensory epithelium.",
    "Add a small amount of clear nail polish along edge of the coverslip to permanently secure the coverslip.\nProceed with confocal microscopy image acquisition and analysis (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/910-Fig4.jpg\nFigure 4. Examples for hybridization chain reaction in situ mRNA detection coupled with immunohistochemistry\n(A) Immunolabeling and HCR in situ mRNA detection on whole mount P28 mouse cochlear apical turns without decalcification. Hair cells are labeled with antibodies against Myo7a (white). HCR detection of Efhd2-mRNA (red) and Otof-mRNA (green). A magnified image of the inner hair cells that demonstrate detection of Otof mRNA (green) and immunolabelling for antibodies against Myo7a (white).\n(B) Myo15Cre-tdTomato(red) transgenic mouse was used to label hair cells. Presynaptic ribbons in the inner and outer hair cells were stained with antibodies against Ctbp2 (white). Hybridization chain reaction provides individual cell mRNA resolution of the hair cell marker Otof-mRNA (green). A magnified image of the inner hair cells demonstrating mRNA expression of Otof mRNA (green) and immunolabelling for antibodies against Ctbp2 (white). Results are from an apical turn that was not decalcified."
  ],
  "subjectAreas": [
    "Antibody",
    "Microscopy",
    "Neuroscience",
    "In Situ Hybridization",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}