{
  "id": 7516,
  "origin_website": "Bio",
  "title": "Activity-based Crosslinking to Identify Substrates of Thioredoxin-domain Proteins in Malaria Parasites",
  "procedures": [
    "Trap Trx-domain substrates with DVSFIncubate cells with DVSFTransfer cultures of red blood cells (RBCs) infected with P. falciparum parasites and expressing an epitope-tagged Trx-domain protein, into sterile 15 mL conical tubes. As a starting point, use 10 mL of culture at 2% hematocrit, with 10-15% parasitemia.Pellet the infected RBCs by centrifuging at 800 × g for 3 min.Remove the supernatant.Use a serological pipette to resuspend the RBCs in an equal volume of either 3 mM DVSF prepared in PBS, or PBS alone as a control (e.g., pellet 10 mL of culture, and resuspend the cells in 10 mL of 3 mM DVSF or PBS).Incubate the cells at 37°C, for 30 min in a CO2 incubator.Pellet the cells by centrifuging at 800 × g for 3 min.Remove the supernatant.Dispose of the DVSF supernatant according to your institution’s chemical waste policies.Wash the cells three times with PBS, using an equivalent volume of PBS (e.g., use 10 mL of PBS if 10 mL of DVSF was used), and performing spins at 800 × g for 3 min.Extract protein from the cellsPrepare a solution of 0.04% (w/v) saponin in PBS and cool on ice, until the buffer is ice-cold.Isolate parasites by lysing RBCs in 0.04% saponin.Resuspend cells in 1 mL of ice-cold saponin per 4 mL of culture that was pelleted (e.g., resuspend cells pelleted from 10 mL of culture in 2.5 mL of saponin).Incubate on ice for 15 min.Pellet parasites by centrifuging at 2,000 × g for 5 min, at 4°C.Remove the supernatant and wash two times with ice-cold PBS, using the same volume of PBS as the volume of saponin used in Step A.2.a, performing spins at 2,000 × g for 5 min.Resuspend parasites in 50-100 μL of protein loading dye.Boil parasites at 95°C for 5 min.",
    "Pellet insoluble material, including parasite hemozoin, by centrifuging at full speed on a table-top centrifuge for 10 min, at room temperature.Transfer supernatant, which contains extracted proteins, to a clean tube.Demonstrate successful cross-linking by Western blot: compared to the PBS-only control sample, the DVSF-crosslinked sample should contain one or more bands at higher molecular weight, as the Trx-domain protein + substrate will migrate slower during SDS-PAGE than the Trx-domain protein alone (Figure 1).Load 30-50 μL of protein sample and a protein ladder into a polyacrylamide gel.Separate the proteins in the DVSF-crosslinked and PBS-only samples by SDS-PAGE, at 180 V for ~45 min, or until the bands of the protein ladder are sufficiently resolved.Transfer proteins from the gel to a nitrocellulose membrane, at 100 V for 1 h.Prepare the membrane by cutting it to the approximate size of the gel and pre-wetting in 1× transfer buffer before applying to the gel.Block the membrane for 1 h, at room temperature with gentle shaking, using 30 mL of 50% InterceptTM blocking buffer (v/v, prepared in 1× PBS).Remove the blocking buffer, and add 10 mL of primary antibody solution, prepared in 50% blocking buffer described above.Use primary antibodies directed against the Trx-domain protein of interest and a loading control.Incubate the membrane in the primary antibody solution at 4°C overnight, in a covered container, with gentle shaking.Remove the primary antibody solution and wash three times with 30 mL of 0.1% Tween-20 (v/v, prepared in 1× PBS), for 10 min, at room temperature with gentle shaking.Add 10 mL of secondary antibody solution prepared in 50% blocking buffer, as described in Step A.2.g.iv. above.Incubate for 1 h, at room temperature, in a covered container, with gentle rocking.Remove the secondary antibody solution and wash three times with 30 mL of 0.",
    "1% Tween-20 (v/v, prepared in 1× PBS), for 10 min, at room temperature with gentle shaking.Wash the membrane with 30 mL of 1× PBS for 5 min, at room temperature with gentle shaking.Image the membrane with the Odyssey® CLx Imaging System to visualize cross-linking of proteins to the Trx-domain protein of interest.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4322/bioprotoc-12-04-4322-g001.jpgFigure 1. DVSF crosslinking traps redox partners to P. falciparum Trx-domain proteins. Parasites were incubated with 3 mM DVSF for 30 min at 37°C, then proteins were extracted and analyzed via Western blot. The parasites expressed epitope-tagged A.) PfJ2 or B.) PfPDI8. Plasmepsin V (PfPMV) was used as a loading control, and as a non-Trx-domain protein, demonstrating the specificity of DVSF.Immunoprecipitate Trx-domain proteins with trapped substratesExtract protein from parasitesPerform DVSF crosslinking and isolate parasites using 0.04% saponin, as described above in section A; importantly, include the PBS-only control parasites. For immunoprecipitation for mass spectroscopy protein identification, we start with 1 × 109 parasites and scale up or down as necessary.Resuspend the parasite pellet in 300 μL of extraction buffer, then add 15 μL of 10% NP-40, and 3 μL of HALT protease inhibitor.Incubate on ice for 15 min.Lyse parasites by sonication.Sonicate parasites with an amplitude of 10%, for 5 s.Let the sample rest on ice for 30 s.Repeat Steps B.1.d.i and -ii two more times, for a total of three rounds of sonication.Centrifuge the lysate at full speed on a tabletop centrifuge set to 4°C, for 15 min.Transfer the supernatant, containing extracted proteins, to a new tube.Perform a second extraction on the pellet from Step B.1.e.Add 300 μL of extraction buffer and 3 μL of HALT protease inhibitor to the pellet (no NP-40 is used for the second extraction) and proceed immediately to the sonication step without incubating on ice for 15 min.",
    "Sonicate and centrifuge as described in Steps B.1.a-e.Combine the supernatant with the extracted proteins from Step B.1.f.Transfer 60 μL of the combined supernatants to a clean tube as the “Input” sample and store at -20°C.Immunoprecipitate HA-tagged proteinsPrepare Pierce anti-HA magnetic beads.Transfer 25 μL of the bead slurry to a clean 1.5 mL centrifuge tube.Add 175 μL of binding buffer to the beads, flick the tube to mix, and briefly centrifuge to collect all of the liquid at the bottom of the tube.Insert the tube into a magnetic rack and remove the buffer after the beads have collected to the side of the tube.Remove the tube and add 1 mL of binding buffer to the beads.Rotate the tube in your hand to mix beads and buffer, for 1 min.Use the magnetic rack to remove the buffer from the beads.Add the extracted proteins from Step B.1.h to the beads.Incubate with end-over-end rotation for 30 min at room temperature (or overnight at 4°C).Briefly centrifuge the tube to collect all of the liquid to the bottom, then use the magnetic rack to remove the unbound protein sample from the beads; save this sample in a tube labeled “Unbound”.Wash the beads three times with binding buffer, and save the buffer from each wash for downstream analysis if necessary.Resuspend the beads in 300 μL of binding buffer and use the magnetic rack to remove the buffer from the beads.Repeat Step B.2.e.i two more times, for a total of three washes.Elute proteins from the beads using the HA peptide.Resuspend the beads in 30 μL of 2 mg/mL HA peptide.Incubate at 37°C, shaking, for 5 min.Use the magnetic rack to separate the eluted proteins from the beads, and save the eluted proteins in a tube labeled “Elution”.",
    "Extract cross-linked proteins from acrylamide gels for protein identificationLoad 5 μL of protein ladder and the “Elution” samples of the immunoprecipitated proteins, collected in Step B.2.g above, into the wells of a polyacrylamide gel.Separate the proteins in the sample by SDS-PAGE, at 180 V, for approximately 45 min, or until the protein ladder has sufficiently resolved.Stain the proteins in the gel with SimplyBlue SafeStain, or another Coomassie stain (Figure 2).Rinse the gel three times with 100 mL of deionized water.Add approximately 20 mL of SimplyBlue SafeStain, or enough stain to completely cover the gel, and incubate at room temperature for 1 h, with gentle shaking.Remove the stain and wash the gel with 100 mL of deionized water for 1 h, at room temperature, with gentle rocking.After 1 h, add 20 mL of 20% NaCl (w/v, prepared in deionized water) and continue incubating for 2 h, or overnight, at room temperature with gentle shaking.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4322/bioprotoc-12-04-4322-g002.jpgFigure 2. Coomassie staining of DVSF-crosslinked proteins prior to extraction for mass spectroscopy protein identification. Parasites expressing epitope-tagged PfJ2 were incubated with 3 mM DVSF for 30 min at 37°C, then PfJ2 was immunoprecipitated from parasite lysates. The immunoprecipitated proteins were separated using SDS-PAGE and stained with SimplyBlue SafeStain. The black, dashed boxes indicate areas of the gel in the DVSF-treated lane extracted for protein identification. The red, dashed boxes indicate areas of the gel in the PBS-treated lane extracted as controls for the protein identification.Using a clean razor blade, extract the cross-linked protein bands from the gel (i.e., extract the bands that run higher in the gel than the non-crosslinked protein).Extract slices from equivalent areas of the gel in the PBS-only control sample (e.g.",
    ", extract a cross-linked protein band that runs at 100 kDa, and extract an equivalently sized piece of gel at 100 kDa in the PBS-only sample).Transfer the gel slices into 1.5 mL centrifuge tubes.Destain the proteins in the gel slices.Incubate with 30% ethanol (v/v, prepared in deionized water) for 15 min, or until the gel slice is no longer stained, at room temperature, gently rotating.Identify the proteins present in each gel slice, either in-house or through a mass-spectroscopy service.Identify the potential Trx-domain substrates, by eliminating the proteins identified in the PBS-only gel slices from those identified in the DVSF-crosslinked samples."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}