{
  "id": 8747,
  "origin_website": "Jove",
  "title": "Noninvasive EEG Recordings from Freely Moving Piglets",
  "procedures": [
    "All procedures were approved by the local ethics committee (#23177-07/G10-1-010/G 15-15-011) and followed the European and the German national regulations (European Communities Council Directive, 86/609/ECC; Tierschutzgesetz).\nAll animal procedures were performed in accordance with the Medical Center of the Johannes Gutenberg-University Mainz animal care committee's regulations.\n1. Setup\nPrior to the experiment, check for any line noise and find an adequate location for the set-up and the antenna. Line noise is visible as a 60 or 50 Hz sine wave.\n\tNOTE: The placement of the antenna and especially the distance between the transmitter and the receiver depends on the transmission strength of the system. The system used here is adjustable. It was adjusted to a relatively low power, with an approximately 3 m transmission range. Additionally, the metallic fences in the pigpen can dampen the signal and cause interferences. In this case, it is necessary to place the antenna inside the metal cage.\nUse a cable drum to supply the set-up with line power. Connect the laptop, the receiver unit, and the analog-to-digital converter (if necessary) for the specific telemetry system that is being used.\n\tNOTE: The telemetry system used here sent digital data to the receiver. This might be different for other systems.\nPlace the electrodes, the adhesives, the Q-tips, and the wipes, as well as the mixing blocks, on a separate table.",
    "Prepare the electrodes with short cables. To do so, cut the electrodes and solder them again with a length as short as possible, depending on the size of the animal. The cables must be long enough to connect the desired recording positions on the head with the telemetric EEG unit, transmitting the data. Cables that are too long must be recoiled and covered with skin adhesive silicone elastomer. Longer cables that must be recoiled make the silicone patch bigger and heavier.\n2. Piglet\nCatch a piglet by grabbing it at the leg or at the thorax. Hold it and be aware of any defecation or urination.\nIf necessary, mark the piglet with a number.\nWrap the piglet in a towel. The piglet will calm down. Be aware of overheating the piglet.\nHold the piglet with one hand at the body or forearm. Use the other hand to hold the snout. Be aware of overheating the piglet and make sure it is free to breathe properly.\n3. Electrodes\nHave a second person attach the electrodes.\nClean the skin from dirt with water or ethanol. If necessary, shave the head.\nRemove any dead skin cells with an abrasive EEG gel and a Q-tip. Remove the abrasive gel afterward. Alternatively, use sandpaper.\nFix the self-adhesive electrodes at the desired location. Place the ground electrode above the cerebellum (between the ears) and the reference electrode on the nose. Place the recording electrode at the desired location.\n\tNOTE: In this case, a unipolar recording was performed, because the reference was placed at a neutral position (nose). There is no standardized system available for piglets until now. Here, a parietal recording position was used (between the eye and the ear) on the right brain hemisphere.",
    "Connect the cables to the telemetry unit. Turn the unit on. Depending on the telemetry system used, this might be a magnetic switch or a radio frequency wake-up signal.\nCover the telemetry unit and all cables as well as all electrodes with two-component skin adhesive silicone rubber (see Table of Materials). By mixing equal amounts of both components, the curing time will be in the range of 1 min. Eyes and eyelashes should not be covered with the rubber.\nWait until the silicone rubber is completely cured.\nPlace the piglet back in the pigpen.\nObserve the piglet to see if it is showing signs of discomfort over a longer period of time (several minutes).\n4. Measurement\nWait until the piglet has recovered and starts to synchronize its behavior with that of its siblings (feeding, playing, sleeping), usually after 30 s (Figure 1).\nWait for sleep phases, if desired. The recording time depends on the specific scientific question. Here, 10 min recording sessions were used.\nIf the telemetry unit is covered by more than 2 other piglets, the signal might be too low for the receiver. Gently push the piglets away if they are sleeping on top. Be aware of the sow; it might react aggressively.\nStart the recording with the data acquisition software (see Table of Materials).\n5. Finish\nAfter the recording (usually several hours), catch the piglet again as has been described in step 2. Be aware of the sow; it might react aggressively.\nGently lift the silicone rubber at one edge. Then, remove the whole patch of silicone rubber containing the electrodes and the telemetry unit. Be careful with the piglet's eyes.\nPlace the piglet back in the pigpen.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}