{
  "id": 3863,
  "origin_website": "Cell",
  "title": "Detecting single cell interferon-beta production using a fluorescent reporter telomerase-immortalized human fibroblast cell line",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nVirus infection\nTiming: 36 h\nCells respond to microbe-associated molecular patterns by upregulating IFN and IFN-stimulated genes (ISGs). Particles of Sendai virus (SeV) and human cytomegalovirus (HCMV) trigger an IFN response in the absence of virus replication and have been used extensively to study innate antiviral defense pathways. To examine the proportion of infected cells that upregulate IFN-ß in response to virus particles, we infected IFN-GFP THF cells with live or non-replicating UV-inactivated SeV (SeV-UV) or HCMV (HCMV-UV) particles.\nSeed cells for immunofluorescence and flow cytometry\nUsing sterile forceps, transfer glass coverslips soaked in 70% ethanol to a 12-well plate and wash the coverslips with PBS before adding cell suspension\nAdd 1.5 × 106 THF IFN-GFP cells in 10 mL to 10 cm dishes and 1 × 105 THF IFN GFP cells in 1 mL per well to coverslips in 12-well plates and incubate 16–24 h\nNote: THF IFN-GFP cells should reach ∼90% confluency the next day\nRemember to seed an extra well and an extra plate for cell counting the next day\nNote: Coverslips may be included in count wells if the coverslip is thought to affect cell count\nNote: If cells do not adhere well to glass coverslips refer to troubleshooting 3 - Cells fail to adhere[href=https://www.wicell.org#sec7.5].\nInfect cells with live or inactivated SeV and HCMV\nDissociate and re-suspend cells in the count well with trypsin-EDTA and count cells using a glass hemocytometer\nDilute SeV to 2 plaque-forming units (pfu)/cell and HCMV to 0.3 pfu/cell in minimal volume of serum-free medium (0.3 mL/well for 12-well plates and 2 mL/dish for 10 cm dishes)\nAdd 0.5 mL of diluted virus per well to a 12-well plate and expose virus to a pre-optimized amount of UV-radiation in a stratolinker UV cross-linker",
    "Remove medium from cells and add live or UV-inactivated virus\nIncubate cells at 37°C for 1 h, rocking plates periodically (10–15 min) to prevent cells from drying out\nReplace medium containing inactivated virus with 1 mL/well and 10 mL/plate maintenance medium (2% FBS DMEM) and incubate for 16–24 h while GFP is expressed and accumulates in cells.\nNote: UV-inactivation should be pre-optimized to reduce infectious titer by >105 fold, or to where there is <1 plaque-forming unit per treatment condition. If you encounter difficulty with UV-inactivation refer to troubleshooting 4 - Ineffective UV-inactivation[href=https://www.wicell.org#sec7.7].\nNote: We have included a sample calculation for diluting SeV\n    M u l t i p l i c i t y  o f  i n f e c t i o n   ( p f u / c e l l )    S e V  t i t r e   ( p f u / m l )     ×  C e l l  c o u n t   (   c e l l s   w e l l   )  ×   D i l u t i o n  v o l u m e   ( m l )    I n f e c t i o n  v o l u m e   ( m l / w e l l )     \n    2  p f u / c e l l   1.2 ×   10 7   p f u / m l   ×  10 5  c e l l s / w e l l ×   1  m l   0.3  m l / w e l l    \nDetecting IFN production by flow cytometry\nTiming: 3 h",
    "Flow cytometry can be used to easily quantify the level and frequency of IFN producing cells in a population. To quantify upregulation of IFN and ISG15 in individual cells we used flow cytometry of fixed cells with intracellular staining.\nFix and permeabilize cells\nWash THF cells in 10 cm dishes with PBS and incubate with 2 mL of trypsin-EDTA at 37°C until thoroughly dissociated\nResuspend dissociated cells in sorting buffer and pellet at 500 × g and 4°C for 5 min\nResuspend cell pellet in 100 μL of Cytofix/Cytoperm solution, transfer to a round bottom 96-well plate and incubate at 4°C for 20 min to fix\nPellet cells at 500 × g and 4°C for 5 min and wash twice in 100 μL of Perm/Wash buffer\nNote: Make sure to dilute 10× Perm/Wash buffer to a 1× solution in distilled water\nStain cells for expression of ISG15\nPellet cells at 500 × g and 4°C for 5 min, resuspend in 50 μL of mouse anti-ISG15 diluted 1:10 in Perm/Wash buffer and incubate at 4°C for 30 min\nPellet cells at 500 × g and 4°C for 5 min and wash twice with 100 μL of Perm/Wash buffer\nPellet cells at 500 × g and 4°C for 5 min and resuspend in 50 μL of APC-conjugated anti-mouse diluted 1:100 in Perm/Wash buffer and incubate at 4°C for 30 min in the dark\nPellet cells at 500 × g and 4°C for 5 min, wash twice with 100 μL of Perm/Wash buffer and resuspend cells in 1 mL of sorting buffer\nNote: Antibody dilutions should be optimized by the user to minimize background staining\nMeasure single cell fluorescence using Beckman Coulter MoFlo XDP (or similar flow analyzer)",
    "Set FSC/SSC gate and the negative gate for ISG15 expression and GFP using mock treated cells\nRun cells stained with anti-ISG15 and APC-conjugated anti-mouse to quantify expression of ISG15 and GFP in fixed and permeabilized cells\nNote: If cell numbers are reduced prior to or during flow cytometry refer to troubleshooting 2 - Low cell count[href=https://www.wicell.org#sec7.3]. If GFP fluorescence is too low or background fluorescence too high to detect changes in fluorescence refer to troubleshooting 5 - Low GFP fluorescence[href=https://www.wicell.org#sec7.9] or troubleshooting 6 - High background fluorescence[href=https://www.wicell.org#sec7.11].\nCritical: Be careful to avoid exposing fixed cells to light as GFP and APC-conjugated antibody are light sensitive\nDetecting IFN production by fluorescence microscopy\nTiming: 5 h\nFluorescence microscopy is useful to visualize production of IFN and other molecules in an intact cell monolayer or for intracellular localization. To see whether IFN-producing cells cluster or are associated with higher levels of SeV infection, we used fluorescence microscopy of stained coverslips.\nFormalin fix and permeabilize cells\nWash cells with PBS, add 1 mL of 10% formalin per well and incubate for 10 min at 23°C away from direct light\nRemove formalin and wash off any excess formalin with PBS\nAdd 1 mL of 0.2% Tx-100 in PBS per well and incubate for 10 min at 23°C away from direct light\nWash cells with PBS, add 1 mL of IF blocking buffer per well and incubate 1 h at 4°C in the dark\nPause Point: Permeabilized coverslips can be left overnight in blocking buffer at 4°C in the dark\nStain cells with SeV- and ISG15-specific antibodies\nDilute mouse anti-SeV 1:2000 and mouse anti-ISG15 1:50 seperately in IF blocking buffer\nRemove IF blocking buffer and use forceps to center coverslips within the well",
    "Add just enough diluted antibody to cover the coverslip (∼30 μL, surface tension should keep it from running off) and incubate for 1 h in the dark\nDilute Alexa Fluor 594-conjugated anti-mouse IgG (Invitrogen) 1:500 and Alexa Fluor 488-conjugated anti-GFP (invitrogen) 1:1000 together in IF blocking buffer\nWash 3 times with PBS and once with IF blocking buffer\nThe IF blocking buffer wash is necessary to keep the secondary antibody on the coverslip\nCenter the coverslip, add just enough secondary antibody to cover the coverslip (∼30 ul) and incubate 1 h in the dark\nDilute Hoechst 33342 1:5000 in PBS\nWash with PBS, add 0.5 mL of Hoechst per well and incubate 10 min in the dark\nNote: Antibody dilutions should be optimized by the user to minimize background staining\nMount coverslips on slides\nDiscard Hoechst, wash 3 times with PBS and once with water to avoid salt crystalizing\nNote: Make sure to properly dispose of Hoechst and the first PBS wash\nAdd ∼3 μL of mounting medium to slides where the coverslips will be placed\nUsing forceps carefully lift the coverslips, blot excess liquid from the edges and lower the coverslips onto the mounting medium so as to avoid trapping air bubbles as much as possible\nPause Point: With proper anti-fade mounting media, coverslips can be kept at 4°C and should maintain fluorescence for at least a few days.\nVisualize cells with a fluorescence microscope\nNote: If GFP fluorescence is too low or background fluorescence too high to detect changes in fluorescence refer to troubleshooting 5 - Low GFP fluorescence[href=https://www.wicell.org#sec7.9] or troubleshooting 6 - High background fluorescence[href=https://www.wicell.org#sec7.11].\nCritical: Be careful to avoid exposing fixed cells to light during incubations as GFP and other fluorophores are light sensitive."
  ],
  "subjectAreas": [
    "Immunology",
    "Microscopy",
    "Flow Cytometry",
    "Cell Biology",
    "Cell-Based Assays",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}