{
  "id": 8381,
  "origin_website": "Jove",
  "title": "In vivo Calcium Imaging of Mouse Geniculate Ganglion Neuron Responses to Taste Stimuli",
  "procedures": [
    "Animal protocols were reviewed and approved by the Institutional Animal Care and Use Committees of the University of Texas San Antonio.\n1. Pre-operative setup\nNOTE: Please note that initial setup of equipment is not addressed here, as it will vary based on pump system, microscope, camera, and imaging software used. For setup instructions please refer to instructional materials provided by equipment vendor. For equipment used by the authors, please see the Table of Materials.\nEnsure liquid flows through all vehicle (water) and tastant lines. If line is blocked, disconnect and flush with water. If the line is kinked, massage until liquid flows. Ensure that liquid starts and stops on cue.\nOnce all lines are confirmed unblocked, run vehicle for 10 s then close all valves.\nEnsure imaging software is ready with all required variables (e.g., trial length, file names, frame rate, etc). Using µManager, an open-source image acquisition software package, input 200 ms into the field labeled Exposure Time for a frames per second of 5Hz, select x2 under binning, and press the button labeled Live. When the video starts, press the button on the left side labeled ROI. This will result in a 512x512 field of view.\n2. Anesthetizing and immobilizing the animal\nNOTE: The following protocol is a terminal procedure optimized for mice of either sex weighing 18-35 g. It is recommended for use with animals between 10 and 12 weeks of age. It may be used with transgenic animals expressing Genetically Encoded Calcium Indicators (GECIs) such as the Snap25-GCaMP6s, or animals stereotaxically injected with viral GECIs. Gloves, lab coat, and face mask should be worn for entirety of protocol.\nScruff animal and perform an intraperitoneal injection of Ketamine (100 mg/kg) and Xylazine (10 mg/kg). Assess the depth of anesthesia via toe pinch before continuing.",
    "Shave the top of the head amd the surgical area at the front of the neck.\nTurn on the heating pad and place the animal prone on the pad.\nApply ointment to the animal's eyes to avoid drying of the eyes.\nMake an incision (~1 cm) at the midline of the head to expose the animal's skull. Remove connective tissue using a sterile swab so that the bare bone is accessible. Use a cotton tipped applicator to ensure the skull is dry.\nApply vet bond to the skull. Be sure to cover the exposed skull. Wait for the glue to dry.\nIn a Petri dish lid, mix and apply a layer of dental cement to skull. The back end of the cotton tipped applicator used in step 2.5 will work well for this process. Place headpost on top of the dental cement and apply a second layer of dental cement to sandwich the headpost in place on the skull.\nLet it sit until the dental cement is dry and solid. Break the cotton tipped applicator in half and use the pointed ends to poke the dental cement to test. If the dental cement does not yield to being poked the animal may be turned to a supine position.\n3. Tracheotomy\nApply pre-surgical scrub to surgical area. Post-scrub, make a midline incision ~ 2 cm in the skin of the throat from the sternum to the chin.\nRetract the skin and sub-maxillary glands, being sure to fully expose the digastric muscles.\nFind the seam in the paratracheal musculature, separate it with blunt dissection, and retract open.",
    "Carefully cut an opening in the top of the trachea large enough to fit polyethylene tubing (I.D. 0.86 mm, O.D. 1.27 mm). Do not cut more than halfway through the diameter of the trachea. Insert tubing into the trachea towards the lungs.\nReposition retractors to release paratracheal musculature and retract the submaxillary glands.\nGlue paratracheal musculature together over tubing with a minimal amount of veterinary glue (see Figure 1A).\n4. Breaking open the tympanic bulla\nGently tease desired digastric muscle (left or right) up and pull apart the connective tissue. Cut at the anterior end of the muscle, avoiding blood vessels, and pull back posteriorly until clear of the tympanic bulla.\nTilt the head back slightly to lift the tympanic bulla. Locate the branch of the carotid artery anterior to the posterior insertion point of the digastric muscle. Feel just posterior to this blood vessel for the convex structure of the tympanic bulla.\nLook for a seam in the musculature at this location (see Figure 1B). Using two sets of fine forceps, blunt dissect at the seam until the bone of the tympanic bulla is visible. Use retractors to keep a clear view of the tympanic bulla.\nFind the seam running anterior to posterior on the bulla (see Figure 1C). Using a surgical probe, poke a hole in the bone at the center of this seam. Use a set of fine end scissors to cut a circular area in the bone, taking care not to cut blood vessels anterior, posterior, and deep beneath the bulla.\n5. Exposing the geniculate\nWithin this hole is a convex bit of bone, this is the cochlea. Anterior to the cochlea is a muscle, the tensor tympani (see Figure 1D). Using the spring scissors, cut the tensor tympani and remove it.",
    "Perform a toe pinch. If animal responds, give a ketamine/xylazine mixture ata 1/3 dose for redosing.\nPrepare irrigation fluid and a suction line. Using the surgical probe, poke a hole in the cochlear promontory. Immediately irrigate the liquid that flows out and remove it with suction. This liquid will flow more or less continuously from this point and will need to be addressed periodically.\nEnlarge the hole in the cochlea. Take care with the blood vessel encircling the cochlea to the posterior and lateral edge.\nTilt the mouse's head forward. Locate the hole in the temporal bone beneath what was the cochlea (see Figure 1E). Take note of the ridge anterior to this hole, this ridge sits directly over the seventh nerve.\nInsert a surgical probe into the hole and carefully lift the temporal bone to expose the seventh nerve (see Figure 1F). Take stock of how much of the seventh nerve is visible and if the geniculate is not fully exposed, tilt the animal's head back and attempt to pull up bone from anterior to the nerve.\nIf the ganglion is still not fully visible, pull up more bone from beneath. Be very careful not to place the probe deep beneath the bone as doing this may damage the geniculate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62172/62172fig1v2.jpg",
    "Figure 1: Surgical exposure of the geniculate ganglion. (A) Image of the mouse neck cavity post tracheotomy. Arrow is pointing to the digastric muscle lying over the surgical area explored in the rest of the figure. (B) Image of region under the previously indicated digastric muscle. Arrow indicates the seam in musculature for blunt dissection. (C) Image of the Tympanic Bulla. Arrow indicates seam in the bone to break with a surgical probe. (D) Image of surgical area after opening the bulla. Lower left arrow indicates the cochlea, upper arrow points to the tensor tympani. Boxed line indicates area in (E) and (F). (E) Image of surgical area after cochlea has been broken and the contents removed. White arrow indicates where to place surgical probe referenced in protocol step 5.6. (F) An image of the exposed geniculate ganglion. Arrow indicates body of the seventh nerve, dashed triangle surrounds the geniculate ganglion. Panels A-B, Scale = 5 mm. Panels C-F, Scale = 1 mm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62172/62172fig1v2large.jpg]\n6. Run tastant panel\nUse suction to remove liquid from over the geniculate. Optionally place an absorbent point to help mitigate seepage and aid in microscope navigation.\nPlace the animal on absorbent pad under the microscope. Locate the geniculate ganglion: useful landmarks include the hole left in the bulla, the hole in the temporal bone, and the seventh nerve. Using the FITC/GFP filter on the epifluorescence scope, check for individual GCaMP-expressing geniculate ganglion neurons. A 10x objective (workind distance 10mm) will provide sufficient resolution to track the activity of individual cells, but a 20x objective (working distance 12 mm) can also be used.\nPlace dispensing needle for tastant line firmly in animal's mouth. Place a Petri dish below the animal's mouth to catch fluid.",
    "Ensure that the camera is viewing the microscope's field of view. Synchronize start of the video recording with the start of tastant presentation.\nDuring recording, watch live feed for responses, drift, and seepage.\nIf seepage occurs, suction the liquid until the view of the geniculate is clear and repeat. If drift occurs, check that all parts of the head post are firmly tightened. If no responses occur check that liquid is flowing and that the microscope and camera are focused on the proper location without anything obscuring the field of view.\nRepeat until desired number of videos have been obtained. Gently ease retractors, then repeat steps 3-6 on the opposite side.\nAfter the desired videos have been obtained for all desired ganglia, euthanize the animal via cervical dislocation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}