{
  "id": 9603,
  "origin_website": "Jove",
  "title": "Transretinal ERG Recordings from Mouse Retina: Rod and Cone Photoresponses",
  "procedures": [
    "1. Making Electrodes\nPrepare glass electrodes. Weigh 120 mg agar and mix it in 10 mL distilled water (final agar concentration 1.2%). Melt the agar solution in hot water bath. Fill glass capillaries (we use Word Presision Instruments TW100-4 capillaries with the following dimensions: length = 100 mm, OD/ID = 1/0.75 mm, and internal volume = 44 μL) with the agar solution using plastic syringe. Solidify the agar at room temperature for 10 min. Thus, up to ~200 capillaries can be filled (the rest of the agar mixture can be stored at -4 °C and re-used several times).\nCut the capillaries into halves using a diamond knife.\nSoak the resulting glass electrodes in mouse electrode solution for at least 24 hours at 4 °C. Store the electrodes at 4 °C and use them over the period of 3-4 months.\n2. Setting up the Experiment\nDark-adapt a mouse overnight. Use wild type (for instance, C57Bl/6) mice for rod-driven transretinal recordings and Tα-/- mice lacking rod signaling8 for cone transretinal recordings.\nPrepare 1 L perfusion solution, 100 mL electrode solution, and 20 mL incubation solution (see below) and filter the perfusion solution trough a Millipore 0.45 μm or 0.22 μm filter (optional).\nCalibrate the light source (505-nm LED or halogen bulb optical stimulator) using a photometer placed at the plane of the retina. In the case of LED light source, use an optical diffuser to achieve light uniformity.",
    "Prepare the perfusion chamber for experiment (chamber constructions may vary). Our chamber is made of 3 mm Plexiglas, with a bottom made from the lid of a small plastic Petri dish, and has an active perfusion volume of ~400 μL (L = 25 mm, W = 8 mm, H ≈ 2 mm). Fill the lower electrode space of the chamber with electrode solution containing 2 mM L-glutamate and 10 mM BaCl2. Using plastic tubing and a glass capillary, make a connection between the solution in lower electrode space (made of plastic tubing connector attached to the chamber bottom) and the electrode holder. Make sure there are no bubbles in the electrode, the connecting tubing, or the electrode holder (purge the solution using plastic syringe if needed).\nMount the recording chamber on the stage of the microscope (optional: the microscope can be mounted on an anti-vibration table and shielded within a Faraday cage to minimize mechanical and electromagnetic noise). Connect the lower electrode holder to the positive headstage pole of the differential amplifier (e.g. Warner Instruments DP-311 amplifier). Center and align the chamber lower electrode opening with the stimulus light spot. Connect the perfusion line to the recording chamber and turn the perfusion on.\nBubble the perfusion solution with 95% O2/5% CO2 while incubating it in 40 °C water bath. CO2 adjusts the pH of the solution to 7.2. The solution flows from the bottle to the recording chamber by gravity passing through a ceramic resistor reheating it to 36-37 °C. To reduce heat loss, the heater should be located as close to the recording chamber as possible, ideally on the stage of the microscope.\nWith a flow regulator adjust the flow rate to about 1 mL/min.",
    "Connect the upper electrode to the second (negative) pole of the headstage using a second electrode holder. Bind the thermocouple probe to the upper electrode using an O-ring. Make sure that the electrode and thermocouple tips are close together so that the temperature reading is taken as close to the center of the retina as possible. Immerse the tip of the upper electrode in the perfusion solution and place it in the center of the chamber. Allow 10-15 min for baseline stabilization.\nAdjust the DC voltage for the heater so that the temperature of the solution is 36-37 °C.\n3. Isolating the Mouse Retina\nUnder dim red light, euthanize the dark-adapted mouse with CO2 and cervical dislocation. Optional: make a reference mark on each mouse eyeball by cauterizing the most dorsal point of the sclera with a cautery pen or heated dissecting pin. All subsequent procedures are performed under infrared light using infrared image converters fit to a dissecting microscope.\nDissect out the eyes with curved scissors by applying gentle pressure and stretching the skin on the sides of each eye. Hemisect both eyeballs under infrared illumination using microscissors or a razor blade.\nRemove the cornea and lens. Remove as much of the vitreous as possible.\nPeel the first retina from the pigment epithelium layer and, if necessary, thoroughly clean it with forceps to remove remaining granules of pigment epithelium. We are typically using whole retina for both rod and cone transretinal recordings. However, if you wish to specifically record from the dorsal part of mouse retina that has more M/L-cones9, before peeling the retina remove the ventral part of the eyecup with a razor blade or microscissors using the cautery mark as a reference.",
    "Place the second hemisected eyeball in a small Petri dish with incubation solution and incubate the preparation in a light-tight box saturated with pure oxygen until use. Typically, under these conditions the second mouse eyecup can be stored for several hours at room temperature and used for recordings.\nUsing a glass or plastic pipette transfer the isolated retina to a drop of perfusion solution (ca. 300 μl) on the lid of a Petri dish. Add 5-6 small drops of electrode solution containing BaCl2 to pre-incubate the retina with BaCl2. Place a square piece (ca. 5x5 mm) of back side corner-greased (we use Dow corning 111 valve lubricant and sealant) Millipore filter paper (0.45 μm HARG type) with pre-made hole in its center (2-2.5 mm in diameter) to the same solution drop. Using forceps position the retina on top of the filter paper (photoreceptor side up) and press its edges on the periphery to flat-mount it. The retina should be centered over the opening in the filter paper.\nUsing forceps transfer the filter paper with the retina to the perfusion chamber and place it above the stimulus spot-aligned lower electrode space. Slightly press the greased edges of the filter paper to bond it with the chamber.\nPlace the upper electrode over the retina center (slightly touch the photoreceptor layer). Centering the upper electrode on the retina increases the signal amplitude (up to ~20-40% as compared to placing it closer to the retina edge). Although such electrode location distorts slightly the effective light stimulus intensity reaching a small sector of the retina (~12-15% of its total area), it is still the optimal way of placing the electrode. The preparation is now ready for transretinal recordings.\n4. Transretinal Recordings",
    "Depending on your mouse line, record rod or M/L-cone-driven test flash responses from dim to bright intensity of calibrated 505 nm light provided from LED light source or optical stimulator. In the case of our LED light source, the flash intensity is controlled by a combination of computerized control of LED input voltage, switchable resistors, and a set of neutral density filters (we use E-Colour #211 0.9 ND film filters from Rosco Laboratories) placed between the LED and the retina. The duration of the LED test flash (20 ms) is controlled by a computer. If using a halogen bulb optical stimulator, test flash intensity and wavelength can be controlled by a set of neutral density filters and narrow band interference filters, respectively. Test flash duration can be controlled by computer-driven shutters.\nOptional: for maintaining efficient suppression of the glial component of photoresponse with BaCl2 throughout the day, change the lower electrode solution occasionally (e.g. prior to testing each retina) by purging it using a plastic syringe filled with fresh solution.\n5. Representative Results\nSolutions\nMouse retina perfusion solution: 112.5 mM NaCl, 3.6 mM KCl, 2.4 mM MgCl2, 1.2 mM CaCl2, 10 mM HEPES (pH 7.2), 20 mM NaHCO3, 3 mM Na succinate, 0.5 mM Na glutamate, 0.02 mM EDTA, and 10 mM glucose. In addition, the solution is supplemented with 2 mM L-glutamate and 10 μM DL-AP-4 to block higher order components of the photoresponse10,11, and with 0.1% MEM vitamins and MEM amino acids solutions (Sigma) to improve retina viability.",
    "Mouse electrode solution: 140 mM NaCl, 3.6 mM KCl, 2.4 mM MgCl2, 1.2 mM CaCl2, 3 mM HEPES (pH 7.4, NaOH). The solution in the lower electrode space also contains 2 mM L-glutamate to block the synaptic transmission10 and, in addition, 10 mM BaCl2 to suppress the glial component of the photoresponse3,12.\nRetina incubation solution: dissolve 272 mg L-15 medium (Sigma) and 20 mg BSA in 20 mL deionized water. Final L-15 and BSA concentrations are 13.6 mg/mL and 1 mg/mL, respectively. Adjust pH to 7.4 with 1 M HCl.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3424/3424fig1.jpg\nFigure 1.  Schematic diagram showing the isolation of mouse retina for transretinal ERG recordings.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3424/3424fig2.jpg\nFigure 2.  Photograph of the perfusion chamber and recording electrodes with their holders. Red arrows indicate the direction of perfusion flow.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3424/3424fig3.jpg\nFigure 3.  Schematic diagram of the experimental setup for transretinal ERG recordings. Red arrows indicate the direction of perfusion flow.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3424/3424fig4.jpg\nFigure 4.  Representative results: recorded family of mouse rod-driven transretinal responses. Photoresponses were low-pass filtered at 30 Hz (8-pole Bessel), digitized at 1 kHz and stored on a computer for further analysis. Shown traces represent averages of 5-6 responses at dim light intensities and 2-3 responses at saturating light intensities.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3424/3424fig5.jpg\nFigure 5.  Representative results: recorded family of mouse cone-driven transretinal responses. Photoresponses were low-pass filtered at 30 Hz (8-pole Bessel), digitized at 1 kHz and stored on a computer for further analysis. Shown traces are averages of 5-10 responses at dim light intensities and 3-5 responses at saturating light intensities.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}