{
  "id": 17515,
  "origin_website": "Jove",
  "title": "Measurement of Strial Blood Flow in Mouse Cochlea Utilizing an Open Vessel-Window and Intravital Fluorescence Microscopy",
  "procedures": [
    "NOTE: This is a non-survival surgery. All procedures involving the use of animals were reviewed and approved by the Institutional Animal Care and Use Committee at Oregon Health & Science University (IACUC approval number: TR01_IP00000968).\n1. Preparation of the fluorescent-labeled blood cells\nAnesthetize the donor mice (male C57BL/6J mice aged ~6 weeks) with an intraperitoneal (i.p.) injection of ketamine/xylazine anesthetic solution (5 mL/kg, see the Table of Materials).\n\t​NOTE: This anesthesia protocol is very reliable and maintains systemic blood pressure.\nLay the mouse on its back, open the skin and expose the chest cavity using tweezers and dissecting scissors. Cut open the diaphragm, grab at the base of the sternum using clamp scissors, cut through the ribcage and lift to expose the heart. Collect 1 mL of blood in heparin (15 IU/mL blood) by cardiac puncture, and centrifuge at 3,000 × g for 3 min at 4 °C. Euthanize the mouse by cervical dislocation after blood collection.\nRemove the plasma, wash the blood cell pellet with 1 mL of phosphate-buffered saline (PBS), and centrifuge 3x at 3000 × g for 3 min at 4 °C.\nLabel the blood cells with 1 mL of 20 mM DiO or Dil in PBS, and incubate in the dark for 30 min at room temperature23,24.\nCentrifuge and wash the labeled blood cells with 1 mL of PBS, centrifuge 3x at 3000 × g for 3 min at 4 °C, and resuspend the cell pellet in 30% hematocrit with ~0.9 mL of PBS (final volume ~1.3 mL) before injection.\n2. Surgery to create an open window 25",
    "Prepare the sterile surgical instruments and imaging platform, and place a heating pad beneath the drape (Figure 1A). Anesthetize the mice (male C57BL/6J mice aged ~6 weeks) as described in step 1.1, and check the depth of the anesthesia by monitoring the paw reflex and general muscle tone. Place the animal on the warm heating pad, and maintain the rectal temperature at 37 °C.\nPlace the animal tail in the CODATM monitor system for monitoring blood pressure and heartbeat (see the Table of Materials). Record the animal's systolic blood pressure, diastolic blood pressure, and mean blood pressure (MBP) in the anesthetized condition.\n\tNOTE: No difference is seen in animal MBP in the anesthetized and un-anesthetized state (107 ± 11 mmHg vs. 97 ± 7 mmHg). The animal heart rate is stable under anesthetization, though lower (still within normal range) than in the non-anesthetized condition (357 ± 12 bmp vs. 709 ± 3 bmp). A slightly increased heart beat should be expected in animals placed in restraint26.\nOpen the left tympanic bulla via a lateral and ventral approach under a stereo microscope (see the Table of Materials), leaving the tympanic membrane and ossicles intact21.\n\t\nMake an incision along the midline of the animal's neck with its head immobilized and positioned to minimize movement (Figure 1B). Remove the left submandibular gland and posterior belly of the digastric muscle and cauterize.\n\t\tNOTE: Subcutaneously inject buprenorphine at 0.05 mg/kg to reduce the pain during surgery.\nLocate and expose the bony bulla by identifying the sternocleidomastoid muscle and facial nerve extending anterior toward the bulla.",
    "Open the bony bulla with a 30 G needle, and carefully remove the surrounding bone with surgical tweezers to provide a clear view of the cochlea and stapedial artery, with its medial margin lying over the edge of the round window niche, and coursing anterior-superior towards the oval window (Figure 1C, D).\n\t\tNOTE: Tracheotomy is performed to keep the airway unobstructed and should only be done when the animal has a respiratory issue during surgery. In general, most of the animals under anesthesia have smooth breathing. However, if animals received a tracheotomy during surgery, the recorded blood flow should not be used for any comparison.\nUse a small knife blade (custom-milled #16 scalpel) to scrape the lateral wall bone at the apex-middle turn of the mouse cochlea, approximately 1.25 mm from the apex until a thin spot is cracked. Remove the bone chips with small wire hooks (Figure 1E).\nCover the vessel-window with a cut coverslip to preserve normal physiological conditions and provide an optical view for recording vessel images.\n\tNOTE: All procedures are to be performed with caution. In addition to monitoring body temperature, the animal's vital signs, including blood pressure and heartbeat, should also be monitored throughout the surgery.\n3. Imaging of CoBF under FIVM\nMake an ~1 cm incision along the right saphenous vein to expose the vessel (Figure 1F).\nInfuse 100 μL of the FITC-dextran solution (2000 kDa, 40 mg/mL in PBS) and 100 μL of a blood cell suspension (30% hematocrit) successively into the animal through the saphenous vein (Figure 1G) to enable visualization of the blood vessels and tracking of blood flow velocity.",
    "Observe the blood flow in real time directly on a video monitor 5 min after the injection. Image the blood vessels using a fluorescence microscope equipped with a long working distance (W.D.) objective (W.D. 30.5 mm, 10x, 0.26 numerical aperture) and a lamp-housing containing a multiple band excitation filter and compatible emission filter (Table of Materials). Record the video using a high-resolution digital black and white charge-coupled device camera (Table of Materials) at 2 frames/s). Acquire more than 350 images per video to ensure successful analysis of the flow velocity.\n\tNOTE: Blood vessels of both the spiral ligament and stria vascularis can be imaged by adjusting the optical focus (Supplemental Video 1).\n4. Video analysis\nMeasure the vessel diameter using appropriate software (Table of Materials), and determine the distance between two fixed points across the vessel in the acquired images.\nCalculate the blood flow velocity from captured video frames by tracing the movement of labeled blood cellsin the spatial distance between image locations27.\n\t\nOpen the video of blood flow in the software (Fiji [ImageJ] was used in this protocol), and set the scale of the images.\nTrack the selected DiO-stained blood cells using the tracking function. Use the distance the cells have moved and the interval of time between image frames in the video for auto-calculation of the flow velocity.\nCalculate the volumetric flow (F) per the following equation: F = V × A. (V: velocity; A: cross-sectional area of the vessel).\n5. Noise Exposure\nPlace the animals in wire mesh cages. Expose them to broadband noise at 120 dB sound pressure level in a sound exposure booth for 3 h and for an additional 3 h the next day.\n\tNOTE: This noise exposure regime, routinely used in this laboratory, produces permanent loss of cochlear sensitivity28.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}