{
  "id": 6290,
  "origin_website": "Bio",
  "title": "Murine Pharmacokinetic Studies",
  "procedures": [
    "MiceThe plasma pharmacokinetic study of single-dose of paclitaxel (PTX) pretreated with nilotinib or vehicle were performed on Oatp1b2 KO and wild-type DBA mice. These mice were provided by Richard B. Kim (Western University, London, Ontario, Canada) and Jeffrey L. Stock (Pfizer Inc., Groton, Connecticut, USA). Mice between 8 and 12 weeks of age, were housed in a temperature-controlled environment with a 12-h light/dark cycle. All mice received a standard diet and water ad libitum, accordance with the Institutional Animal Care and Use Committee of The Ohio State University and all studies were performed in accordance with national animal protection laws. PreparationDepends on the number of the mice and the PK time points involved in the PK study, the preparation of the work can be done the day before or on the same day of the PK study. We separated mice with two mice per cage to ensure the easy accessibility and smooth transaction to each team participants during the study. We weighed the mice, numbered the mice on the tail, calculated the drug volume based on the body weight. Label two sets of 0.5 ml sample collection tubes, for blood and serum samples respectively. The mice information, drug injection volume, drug injection and collection time points were summarized in the Table 1. On the day of the PK study, team member performed their assigned duty according to the instruction. Videos 1 and 5 show the layout of the blood collection and process platforms.  Table 1. Paclitaxel PK study dosing and sampling information sheetimgsrc:https://en-cdn.bio-protocol.org/attached/image/20181016/20181016181214_2293.jpg<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Blood collection platform  Drug preparationDrugs are prepared on the day of PK experiment at room temperature. Dissolve Nilotinib in 0.5% (w/v) HPMC (hydroxypropyl methylcellulose), sonicate to make working suspension at 10 mg/ml within 1 h of administration.",
    "Paclitaxel was formulated in Cremophor EL/ethanol (1:1) at 6 mg/ml and diluted in normal saline, vortexed to make 2 mg/ml working solution right before injection. Drug administrationPaclitaxel is given by intra-venous bolus in the tail vein at a dose of 10 mg/kg, 100 mg/kg nilotinib or an equivalent volume of vehicle control (0.5% HPMC) given by oral gavage 30 min before paclitaxel (Table 1).Administer Nilotinib by oral gavage. Expose the mouse a few minutes before the scheduled i.v. injection to the red lamp.Place the mouse in the tail vein injection platform.Inject the drug intra-venous bolus in the tail vein.Note: The precise dosing of the drug at the specific time point is critical. Blood collectionAs illustrated in Figure 1, we collect blood samples (30 μl each) from individual mice at selected time points: 5, 10, and 15 min from the submandibular vein using a lancet. At 30 and 60 min time points, we anesthetize the mouse using isoflurane, collect blood from the retro-orbital venous plexus using a heparinized capillary. At 120 min, collect blood by cardiac puncture using a syringe and needle. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181016/20181016181112_7943.jpgFigure 1. Time scheme of drug administration and blood collectionBlood collection by the cheek bleeding (Video 2)Proper restrain mice with one hand, which will apply adequate pressure to the maxillary vein. Note: This step is critical for the success of the cheek bleeding procedure, avoid holding too tight around the area of ears, which would cause unexpected bleeding from ears or nose and ultimately death of the animal. Visualize landmarks. FVB mice have a convenient landmark in the area of the maxillary vein as shown in Figure 2.",
    "Often viewed as a small bald spot or hair whorl (freckle), you can find this along the curvature of the mandible; the vein is just above this mark in the groove past the jawbone. Darker mice have the same spot but it may be more difficult to see.Note: You can also align a lancet caudal to the angle of the mandible, extending to the ear. Location of the puncture site is at the midway point of the lancet.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181016/20181016181125_9466.jpgFigure 2. Visualized landmark for mice cheek bleedingUsing the point of a lancet, apply firm pressure at the point, caudal to the eye and ventral to the ear, where the submandibular vein is located, then release until blood flows. Note: Avoid the jawbone, the puncture will induce bleeding where the retro-orbital and submandibular veins join the jugular vein. In case of puncture of ear canal due to improper technique, apply pressure with gauze until bleeding stops.  Collect the blood (30 μl per mouse and time point) with heparinized capillary and transfer into a pre-labeled 0.5 ml microcentrifuge tube using a pipet rubber bulb. Note: Depends on how many time points you will collect blood from one mice, the volume from each time point could vary, however, the total volume of blood collected has to be allowed by IACUC Guidelines.  Apply gentle pressure with gauze to stop the bleeding. The bleeding will stop in seconds.Release the mouse that will self-groom.Rotate the side of cheek bleeding for the next time point. For example, we performed the 5 min time point bleeding on the right cheek, the 10 min on the left cheek and the 15 min on the right cheek again.Note: If symptoms of distress were observed due to restraint or blood loss, release restraint, gently stimulate the mouse until it recovers.  <p>imgsrc:https://bio-protocol.",
    "org/javascript:;</p> Video 2. Cheek bleeding (This video was made at The Ohio State University according to guidelines from The Ohio State University on Animal Care and Use Committee of The Ohio State University, and approved by the Animal Research Ethics Board of The Ohio State University under protocol #2015A10000101.)  Blood collection by the retro-orbital venous plexus (Video 3)Anesthetize the mouse with 3% isoflurane carried in oxygen. Verify the absence of corneal blink and movement after noxious stimulus prior to the procedure.Place the mouse on lateral recumbency position and scruff it with thumb and forefinger.Insert a collection capillary in the medial canthus of the eye under the nictitating membrane, at 30-degree angle to the nose. Slightly rotate the capillary with a slight pressure to puncture the sinus tissue, and the blood will flow in the capillary.Withdraw the capillary and apply a clean pad on the eye will stop the bleeding.Check the eye 30 min after the procedure.Perform the blood collection on the right eye for 30 min time point and then rotate on the left eye for 60 min time point. Note: Retro-orbital bleeding is relatively safe and easy to perform in PK study, however, mice might be under stress after several serial cheek bleeding, especially within a short time window. In this case, sometimes it would be difficult to obtain blood from retro-orbital bleeding. We found that intraperitoneal injection of 1-2 ml of normal saline would help. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Retro Orbital bleeding (This video was made at The Ohio State University according to guidelines from The Ohio State University on Animal Care and Use Committee of The Ohio State University, and approved by the Animal Research Ethics Board of The Ohio State University under protocol #2015A10000101.",
    ") Blood collection by cardiac puncture (Video 4)The cardiac puncture is performed as a terminal procedure. Euthanize the mouse in a CO2 chamber.Note: Depends on IACUC approval, cardiac puncture could be performed while mice are under anesthesia. After absence of vital sign, immediately perform the posterior cardiac puncture procedure. Note: It would be very difficult to get blood from cardiac puncture if you wait too long after euthanizing the mice. Place the mouse on dorsal recumbency position, spray with 70% ethanol. Insert the needle through the chest wall, under the xiphoid, and puncture the diaphragm. Maintain the needle parallel to the spine, and insert it underneath the ribs.When the heart is punctured at the level of the elbow, apply back pressure on the syringe. If the needle is in the heart, the syringe will fill up with blood. If not, re-position the needle and try again to back pressure the needle. Add more backpressure once the syringe is filled with blood. Note: We typically obtain blood as much as we can to ensure the sufficient volume for analytical measurement of the drug. Typically, the drug concentration is the lowest one comparing with all the earlier time points; it is also a good practice to remove as much as blood from circulation to minimize the blood contamination in the tissue if you are also interested in collecting the tissues for further examination. Transfer blood into a 1.3 ml microtube with heparin, gently invert 2-3 times, allow the heparin released into the blood.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Cardiac puncture (This video was made at The Ohio State University according to guidelines from The Ohio State University on Animal Care and Use Committee of The Ohio State University, and approved by the Animal Research Ethics Board of The Ohio State University under protocol #2015A10000101).",
    "Blood sample process (Video 5)Centrifuge blood samples at 1,500 x g for 5 min. Carefully transfer the translucent yellowish supernatant (plasma) without any carryover of the blood cells into a pre-labeled corresponding time-point tube.Store plasma samples at -80 °C until analysis. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5. Blood process platform   Determination of drug levels Paclitaxel is quantified by a validated method based on reversed-phase liquid chromatography coupled to tandem mass-spectrometric detection (LC/MS/MS, Leblanc et al., 2018)."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}