{
  "id": 11283,
  "origin_website": "Jove",
  "title": "Using a Classroom-Based Deese Roediger McDermott Paradigm to Assess the Effects of Imagery on False Memories",
  "procedures": [
    "All methods described here have been approved by the Institutional Review Board of Georgia State University.\n1. Material Preparation\nUsing the word lists attached in the supplemental materials, create four separate presentations: Imagery A, Imagery B, Non-imagery A, and Non-imagery B. Ensure that all four presentations are void of templates or designs, with white backgrounds and black font. The two list orders, A and B, serve to balance any effects of list order or fatigue. The two imagery versions serve to assess the effects of imagery instructions on memory.\n\t\nBegin each presentation with a content slide titled, \"Instructions\". In the body of the instructions slide, include the relevant instructions listed below in 24+ point font according to whether the presentation is designated as imagery or non-imagery.",
    "Include these instructions for Imagery A and Imagery B presentations: \"I will present words from a list, one at a time, on the projector. As each word is presented, please create a mental image of that word in your mind. Please do not mark on the packet while the list is being presented. When each list is finished, the projector will indicate, \"RECALL\", and you will write down the words you remember from the list in the packet provided. Try to use the images you created to help you recall the words. After you have written down all the words that you can remember, please indicate overall how easy it was for you to create mental images for that list. You will be given 45 seconds to recall the list and rate the ease of creating images, and then we will move on to the next list. When we do so, please flip to the next page in the packet. It is important that you do not revisit any old lists once we have moved on. There will be 11 lists in total, the first being a practice list. After all the lists have been presented, you will be asked to complete a word search task.\"",
    "Include these instructions for Non-imagery A and Non-imagery B presentations: \"I will present words from a list, one at a time, on the projector. Pay attention to the words on the projector. Please do not mark on your packet as the words are being presented. When each list is finished, the projector will indicate \"RECALL\", and you will write down the words you remember from the list in the packet provided. You will be given 45 seconds to recall as many words from the list as you can, then we will move on to the next list. When we do so, please flip to the next page in the packet. It is important that you do not revisit any old lists once we have moved on. There will be 11 lists in total, the first being a practice list. After all the lists have been presented, you will be asked to complete a word search task.\"\nFollowing the instructional slide, create timed slides to present lists and prompt recall. All text is center-aligned. List words are 72 point font, and all instructional cues are 44 pt. font.\n\t\t\nCreate slide 2 and include the text \"Prepare for the practice list\" centered vertically and horizontally on the slide in 44 point font.\nOn slides 3-10, present the practice list words in order, one word per slide, centered horizontally and vertically, in lower case font. Designate a slide duration of 5 seconds by going under Transitions in the menu and selecting to advance the slide after 00:05.00.\nOn slide 11, indicate the end of the practice list and the beginning of recall. Include \"End of Practice List\" in black font with \"RECALL\" double-spaced below it in red font. Designate a slide duration of 45 seconds.",
    "After the practice list recall slide, create slides to present the test lists in the same manner.\n\t\t​NOTE: The procedure for each list is 10 slides long. The first slide indicates \"Prepare for List X\". The following 8 slides include the list words in order, each on a separate slide with 5 second durations. Following the list word slides, a recall slide with a designated duration of 45 seconds indicates \"End of List X\" in black font with \"RECALL\" double-spaced beneath it in red font. Adapt the \"X\" in the \"End of List X\" text to indicate the order of the lists in that particular presentation, not the order of the lists as they are listed in the appendix. For example, the 3rd list to occur in the presentation will read \"End of List 3\".\nEnsure that the order of the lists in the slides varies according to the particular presentation . According to the numbered designations in the word lists attached to the supplemental materials, Imagery A and Non-Imagery A presentations present lists in ascending order: practice, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10. Imagery B and Non-imagery B presentations present lists in descending order: practice, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1.\nAfter the recall slide for the last list, ensure that slide 112 includes the following text \"End of word lists. Turn to the next page in your packets and please take the next 7 minutes to work on the attached word searches.\" Designate a slide duration of 7 minutes.\nCreate slide 113 to include \"End of word searching. One last activity\". This slide has no designated duration. Create a final slide, 114, that includes a thank you.",
    "Create two different versions of recall packets, imagery and non-imagery, in a word processor. Page 1 of both versions prompts participants to write down their name, gender, age, major, or any other demographic variables of interest. Page 13 of both versions includes a word search with dimensions of 20 x 20 letters or larger. Ensure that no list or practice words occur in the word search.\n\t\nEnsure that pages 2-12 in the recall packets include repeated recall activity pages, which vary according to the version.\nEnsure that recall activity pages for the imagery version include the following instructions at the top of the page: \"Instructions: Create an image of each item in your head. Use the images you created to help you recall the words.\" Below that, the activity page includes \"Recall:\" with at least ⅓ of the page following it left blank. At the bottom of the page, include the following prompt: \"Overall, how easily did these images come to mind for this list? Circle one\". Below the ease of imagery prompt, include the following options for participants to circle: \"0 - Not easy, 1 - Somewhat easy, 2 - Very easy\".\nEnsure that recall activity pages for the non-imagery version include the following instructions at the top of the page: \"Instructions: Please recall and write down all the words you remember from the current list.\" Below that, the page indicates \"Recall:\" with no other prompts following.\nObtain the final recognition test from the supplementary materials and do not attach it to the recall packets. It is an individual page to be handed out separately. The final recognition test consists of 80 items total.",
    "Of the 80 items, use 30 from the lists presented on the presentation slides at the start of the study. The 30 presented items chosen for the recognition memory test are the 1st, 3rd and 7th words from each of the 10 lists presented (15 semantic items and 15 phonological items).\nInclude each of the 10 critical lures related to the 10 presented lists (5 semantic and 5 phonological) on the test.\nFor the additional 40 items, use the DRM lists not presented to participants, including the 1st, 3rd and 7th items from each of 10 non-presented lists (15 semantic and 15 phonological items), as well as the associated critical lure (5 semantic and 5 phonological) for each of the 10 non-presented lists. The non-presented lists are located along with the presented lists in supplementary materials.\nArrange the items on the recognition memory test such that one item from each of the 10 presented lists and 10 non-presented lists appears prior to any critical lures. List items are not thematically blocked on the memory test.\nEnsure that instructions on the recognition test prompt participants to indicate \"yes\" or \"no\" in writing as to whether each item appeared in any of the lists presented.\n2. Recruitment\nRecruit at least four face-to-face sections of the same, or very similar, undergraduate class. If possible, recruit non-psychology classes or introductory courses that have not learned about false memory paradigms.\n\t\nInclude all students who are enrolled in the recruited classes and have normal or corrected vision to participate.\nAssign each class section to 1 of the 4 presentation types, distributing the number of classes assigned to each presentation type as evenly as possible and prioritizing even distribution across imagery and non-imagery presentation types.\n3. Optional Modifications to Protocol",
    "If the effects of imagery instructions are not of interest, modify the protocol as follows to only include one set of instructions, one type of recall packet, and shorter slide durations.\n\t\nUsing the word lists attached in supplemental materials, create 2 separate presentations, versions A and B. Present the 10 study lists in ascending order following the practice list in the version A presentation (practice, 1, 2, 3, 4…), and present the lists in descending order following the practice list in the version B presentation (practice, 10, 9, 8, 7…).\nInclude the non-imagery instructions from protocol item 1.1.1.2 on the first slide of both presentation versions.\nModify the timed list presentation slides described in 1.1.2.2 to be 2 seconds long instead of 5 seconds. In other words, design the presentation so that each word is presented to participants for 2 seconds. Do not modify any other types of timed slides, like the recall slides (45 seconds) or word search side (7 minutes).\nCreate 1 version of the recall packet (i.e., non-imagery version) that includes the traditional non-imagery instructions from protocol item 1.2.3.\nAssign the recruited classes to the 2 presentation types as evenly as possible.\nIf the effects of list type (semantic vs. phonological) are not of interest, modify the protocol as follows to only include longer, traditional semantic DRM lists:\n\t\nDo not use the word lists included in our supplementary materials, with the exception of the practice list. Instead, select 20 of the unmodified DRM lists included in the original Roediger & McDermott study2. These word lists are 15-items long and all semantically related. Number the selected lists 1-20. Use lists 1-10 as study lists in the presentation and lists 11-20 as filler lists for the recognition test.",
    "Modify the presentations to accommodate 15-item lists instead of 8-item lists. Following the instruction slide and practice list, the procedure for each test list is 17 slides long. For each list, the first slide indicates \"Prepare for List X\", the following 15 slides present the list words one at a time, and the last slide for the list indicates the end of the list and the beginning of recall.\nModify the recognition test design described in 1.3 to include the 1st, 8th, and 10th words from the 10 study lists and 10 filler lists and their critical lures.\n4. Procedure\nAt the beginning of a regularly scheduled class session, ask the instructor to leave the room and pull up the presentation that was assigned to that class section.\nIntroduce yourself as the researcher and distribute informed consent forms to students. Allow students to read through the informed consent document on their own. Prompt them to complete the informed consent form and to ask any questions about the document or participation.\nDistribute the appropriate recall packets to participants. If using an imagery condition, ensure that classes who were assigned one of the two imagery presentations receive an imagery recall packet. Do not distribute the recognition test yet.\nInstruct participants to fill out the initial page of the recall packet with demographic information. Then read the instructions from the presentation aloud with the slide presented.\nInstruct participants to flip to the next page in their packet for the practice list, move to presentation slide 3 (i.e., \"Prepare for the practice list\"), and read the prompt aloud. After reading the prompt, move to slide 4 and allow the presentation to progress through the timed practice list slides.",
    "When the practice list recall slide expires and automatically moves to the next list prompt slide (i.e., \"Prepare for list 1\"), prompt participants to ask any questions they have about the procedure. Answer any questions and instruct participants to turn to the next page (pg. 3) in their packet for list 1.\nOnce all participants have turned to the next page in their booklet, read the list 1 prompt slide aloud (i.e., \"Prepare for list 1\") and progress to the timed list 1 word list and recall slides.\nContinue this procedure for the 9 remaining lists, prompting participants to flip to the next page in their booklet after each recall slide expires, reading the \"prepare for list X\" slide aloud, and subsequently prompting the timed list slides.\nAfter recall for list 10, supervise as the presentation prompts participants to turn to the next page in their packet and work on the word search for 7 minutes.\nWhen the presentation automatically progresses to the final slide (i.e., \"One last activity\"), collect the recall packets from participants and distribute the final recognition test.\nInstruct participants to complete the final recognition test at their own pace and to do their best not to leave any items blank. Once all participants have finished the test, collect the recognition tests and verbally debrief participants (see supplementary materials for debriefing statement).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}