{
  "id": 10839,
  "origin_website": "Jove",
  "title": "Pupillary Response as Assessment of Effective Seizure Induction by Electroconvulsive Therapy",
  "procedures": [
    "The study protocol was approved by the institutional clinical research ethics committee of Kyushu University, Fukuoka, Japan (IRB: Clinical Research number #28-77). Although the measurement of pupillary reaction is an essential and standard clinical procedure during anesthesia, informed consent was obtained for this research. Patients with cataract, glaucoma, intraocular lenses, or insulin-dependent diabetes mellitus were excluded because their pupillary responses may be abnormal.\n1. Preparation for Electroconvulsive Therapy\nClean the right and left forehead and area behind the ears with an alcohol cotton swab, and then attach electroencephalogram (EEG) monitors at four symmetrical points.\nClean bilateral temples with normal saline, and then attach adhesive electrical stimulation pads (about 4 cm x 5 cm) to the bilateral temples to prevent interference in the stimulation due to hair. The intensity of stimulation is changed each time, according to the previous degree of inducted convulsion.\nAttach electrocardiogram (ECG) monitors at two points on the chest (base of the heart and cardiac apex) and monitor heart rate.\nPrepare a tourniquet and belt it at the left thigh.\nNOTE: The tourniquet is belted until 200 mmHg after the patient is asleep. Convulsion induced by ECT can be observed in the lower leg even after systemic administration of muscular relaxant.\nAttach two electromyogram sensors to the left anterior tibial muscle, with a distance of 5 cm, to measure generalized seizure time in the lower leg.\n2. Preparation for anesthesia\nNOTE: All patients underwent ECT in the same room, at the same time of day.\nAfter the forehead is cleaned with an alcohol cotton swab, attach a bispectral index (BIS) measurement device to the patient’s forehead. BIS is used to monitor depth of anesthesia.\nNon-invasively measure blood pressure at the arm every 1 min during ECT therapy.",
    "Continuously monitor saturation of oxygen and pulse rate by a clip attached to the finger.\nHold a pupillometer (see the Table of Materials) over one of the patient’s eyes. After the patient opens their eyes, press a button (Figure 1A) on the pupillometer, and measurement starts automatically. Maximum (initial) resting pupil size (MAX) and minimum pupil size after light stimulation (MIN) are automatically measured, and the constriction pupil size ratio (%constriction = [MAX–MIN]/MAX expressed as a percentage) is automatically calculated.\nNOTE: The duration of light emission is 800 ms, and the required data can be obtained within 1 second. If the patient is unable to keep their eyes open, the examiner assists by holding the eyelid open. Although anesthetists typically measure the pupillary diameter or light reflex of patients before surgery in the operating room, cooperation with patients is needed before anesthesia induction.\n3. Anesthesia\nSupply oxygen (6 L/min) via a mask.\nAdminister propofol (sedative: 3 µg/mL, target controlled infusion) via intravenous line until loss of consciousness.\nTighten the tourniquet belted at the thigh to 200 mmHg.\nAdminister succinylcholine (muscle relaxant: 1 mg/kg) via the intravenous line.\nAfter spontaneous breathing of patients ceases, have the anesthesiologist perform controlled ventilation using a face mask with 100% oxygen without intubation. Perform ventilation from the point at which end-tidal carbon dioxide is 30 mmHg until electrical stimulation10.\nAfter BIS value begins to increase, the anesthesiologist stops ventilation and psychiatrists start the ECT procedure.\n4. Electroconvulsive Therapy Procedure\nConduct ECT via bitemporal electrode stimulation using an ECT instrument. Set the initial electrical stimulus dose (%) at half the value of each individual’s age.\nNOTE: Maximum stimulus dose is 100%. The electrical stimulation time is about 7-8 s.",
    "Immediately after electrical stimulation, hold thr automated infrared pupillometer over one of the patient’s eyes. At this time, if the patient closes their eyes, keep the patient’s eyelid open. Press the device button, as in step 2.4, and measure maximum (initial) resting pupil size (MAX) or minimum pupil size after stimulation (MIN).\nPerform controlled ventilation using a face mask with 100% oxygen until the patient begins breathing spontaneously.\nUsing EEG, measure ictal regularity, seizure time and greater postictal suppression (by the psychiatrist [Figure 2, Figure 3]).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}