{
  "id": 8531,
  "origin_website": "Jove",
  "title": "Isolation of Region-specific Microglia from One Adult Mouse Brain Hemisphere for Deep Single-cell RNA Sequencing",
  "procedures": [
    "All procedures involving rodents conformed to Stanford University guidelines, which comply with national and state laws and policies. All animal procedures were approved by Stanford University's Administrative Panel on Laboratory Animal Care.\nNOTE: All solution and buffer compositions are provided in Table of Materials.\n1. Preparation on the Day of Cell Isolation\nPrepare the following reagents and chill them on ice: medium A (50 mL), magnetic-activated cell sorting (MCS) buffer (30 mL), FACS buffer (25 mL), phosphate-buffered saline (PBS; 30 mL), DNase (320 µL), and RNase inhibitor (30 µL).\nNOTE: The volumes provided here are sufficient to isolate microglia from 4 brain regions (e.g., cortex, cerebellum, hippocampus and striatum) of a single mouse brain hemisphere. Scale up if more tissues are used.\nPlace four clean 2 mL Dounce homogenizers on ice and add 2 mL of medium A with 80 µL of DNase (12,500 units/mL) and 5 µL of RNase inhibitor into each Dounce homogenizer. Chill the pistons in 15 mL tubes.\nLabel four 6 cm Petri dishes with brain regions for tissue collection and add 200 µL of cold medium A into each dish on ice. Add about 5 mL of medium A into a 6 cm Petri dish for dissection.\nNOTE: Prior to use, make sure all reagents are sterile and suitable for RNA applications. Bench and dissection tools need to be clean and sprayed with RNase decontamination solution (Table of Materials).\n2. Brain Region Dissection\nNOTE: This step should take ~30 min.\nInject 400−500 µL of ketamine/xylazine (24 mg/mL ketamine and 2.4 mg/mL xylazine) into the peritoneum of a juvenile to adult stage mouse (>1 month old).\nNOTE: A male mouse is used here for illustration, but either gender is suitable.\nWait for 5 min and pinch a hind paw to ensure lack of retraction.",
    "Immediately use a 26 G x 3/8 needle to perform transcardial perfusion with 20−30 mL of ice-cold PBS until buffer runs out with no visible blood.\nDecapitate the mouse with a pair of surgical scissors. Use small scissors to cut open the skin to expose the underneath skull, and then cut through the sagittal suture, lambdoidal suture and coronal suture. Use forceps to pull off both sides of parietal bone and interparietal bone without damaging the tissue, and carefully move the brain into the dissection Petri dish with medium A.\nUse a pre-chilled blade to cut the brain through midline into two hemispheres.\nNOTE: The four brain regions described here from a single hemisphere yield sufficient numbers of microglia for single-cell or bulk RNA-seq applications. The other hemisphere can be used for immunohistochemistry or RNA in situ validation.\nSeparate the cerebellum from the cortical lobe and the brain stem with #55 forceps and transfer the tissue into a collection Petri dish.\nUse #55 forceps to carefully dissect out the hippocampus and the striatum from the cortex and transfer each tissue into a collection Petri dish.\n3. Mechanical Tissue Dissociation\nNOTE: Keep cells and reagents cool all the time except during staining steps. This step should take ~30 min.\nChop each brain tissue with a razor blade into <1 mm3 fine pieces.\nUse 1 mL pipette (with tips cut off) to transfer tissue pieces into the pre-chilled Dounce homogenizers, each containing 2 mL of medium A with DNase and RNase inhibitor.\nHomogenize the tissue by slowly twisting the piston in and out of the Dounce homogenizer for 6−10 full strokes, until no visible chunks are present.",
    "NOTE: Douncing kills neurons and most other glial cells but leave microglial cells rather intact. Both insufficient and over-douncing can lead to low yield of cells.\nTransfer dissociated tissues into 50 mL tubes through 70 µm strainers.\nRinse each Dounce homogenizer and piston with a total of 6 mL of cold medium A and filter the rinsing solution through the same strainer into the corresponding tube.\nTransfer the single cell suspensions (about 8 mL each) into 15 mL conical tubes and centrifuge at 400 x g for 5 min at 4 °C with brake = 5.\n4. Myelin Removal\nNOTE: This step should take ~60 min.\nPrepare 1 large depletion (LD) column (for cortex) and 3 large selection (LS) columns (for the other 3 regions) in a magnetic separator (Table of Materials). Rinse each column with 3 mL of MCS buffer.\nOnce centrifugation is finished, pipette out and discard the supernatant without disturbing the pellet. For the cortex and cerebellum tissues, resuspend cells in 850 µL of MCS buffer with 1.8 µL of RNase inhibitor. For hippocampus and striatum tissues, resuspend cells in 400 µL of MCS buffer with 0.9 µL of RNase inhibitor.\nNOTE: The columns (LD vs. LS) and the volume used for resuspension are optimized based on the amount of myelin present in the tissue. If other brain regions are assayed, these conditions may need to be adjusted depending on the size of the tissue and how much myelin may exist. Effectiveness of myelin removal can be estimated in step 4.9.\nAdd 100 µL of myelin removal beads each into cells from cortex and cerebellum and add 50 µL of myelin removal beads each into cells from hippocampus and striatum.\nGently mix the cells with beads and incubate the tubes on ice for 10 min.",
    "Bring the volume of the tube with cortical cells to 2 mL with MCS buffer, and all others to 1 mL (i.e., add 1 mL for cortical cells; 500 µL for hippocampal and striatal cells; no need to add buffer to cerebellar cells).\nOnce columns are empty of rinsing buffer, place a 15 mL tube below each column. Load cortical cells (2 mL) onto the LD column, and all others (1 mL each) onto the LS columns. Immediately use 1 mL of MCS buffer each to wash the original tubes and load the solution onto the corresponding columns.\nWash the LD column once with 1 mL of MCS buffer and wash each LS column twice with 1 mL of MCS buffer each wash. Continue to collect the flow-through solution during washing.\nFilter cells into round bottom FACS tubes through 35 µm strainer caps.\nNOTE: Each tube should collect about 4 mL of single cell suspension depleted of myelin.\nOptionally, take 10 µL of the cell suspension and mix it with 10 µL of 0.4% trypan blue solution. Examine the cells under a 10x bright field microscope to estimate the yield, survival rate and the level of residual myelin.\nNOTE: A successful preparation should generate over 90% live cells (round in shape and excluding the blue dye) with little to no myelin debris.\nPellet cells in the FACS tubes at 400 x g for 5 min at 4 °C, with brake = 5. Slowly pour out supernatant and dab the edge of the tube on tissue paper. Resuspend cells in each tube with 300 µL of FACS buffer.",
    "NOTE: If MCS sorting is preferred, CD11b beads can be used to select microglia and other myeloid cells following myelin removal. These cells can then be used for non-plate-based scRNA-seq as well as bulk RNA-seq. The caveat of this alternative approach is that CD11b beads do not separate microglia from other related immune cells which are also positive for this antigen.\n5. Staining for Fluorescence-activated Cell Sorting\nNOTE: This step should take ~40 min.\nAdd 5 µL of mouse Fc receptors block reagent (Table of Materials) into each tube. Incubate for 5 min on ice.\nAdd 1 µL of CD45-PE-Cy7 and 1 µL of CD11b-BV421 into each tube.\nNOTE: Antibodies with other conjugated fluorophores may be used. Antibodies against TMEM119, a specific marker for homeostatic microglia9, can also be included, but it is recommended to be used together with CD45 and CD11b, because certain microglia subpopulations may lose TMEM119 surface expression.\nIncubate the tubes on a shaker for 10 min at room temperature (RT).\nAdd 2 mL of FACS buffer to wash.\nPellet cells at 4 °C, 400 x g for 5 min. Slowly pour out supernatant and dab the edge of the tube on tissue paper. Resuspend cells in each tube using 400 µL of FACS buffer with 1 µL of RNase inhibitor and 0.5 µL of propidium iodide (PI, 1:1,000 dilution).\n6. Index FACS Sorting\nNOTE: This step should take ~1 h.\nFollowing standard FACS procedure, draw gates based on scatter (excluding debris), single cells, live cells (PI negative), microglia and myeloid cells (CD45+, CD11b+).",
    "NOTE: Typical microglial cells express CD45 at lower levels compared with other border-associated macrophages, such as perivascular and meningeal macrophages, and therefore gating on CD45 low CD11b+ should be sufficient if the focus of the research is gene expression profiles in these classical microglia1,2. However, certain subsets of microglia may have higher CD45 expression and this is particularly true during development or in disease conditions. To ensure unbiased analysis of microglial gene expression, CD45 high and CD45 low immunophenotypes can be recorded through index sorting setting and both populations collected for sequencing and downstream analysis. In addition, TMEM119 surface expression may be used to target the homeostatic microglial population (see step 5.2) and analyzed together with CD45 levels and the sequencing results.\nSort single microglia (with a 100 µm nozzle) into 96-well polymerase chain reaction (PCR) plates, containing 4 µL of lysis buffer each well (see the published protocol14 for details).\nNOTE: The External RNA Control Consortium (ERCC) RNA spike-in mix (Table of Materials) can be added at 1:2.4 x 107 in the lysis buffer for quality control and normalization purposes2.\nBriefly vortex the plates and spin down using a bench-top centrifuge.\nImmediately freeze the samples on dry ice. Store the plates at -80 °C until library preparation.\nNOTE: Alternatively, more cells can be collected into 1.5 mL tubes with RNA extraction buffer for bulk RNA-seq. According to authors' experience, 3,000 cells are sufficient to generate good quality libraries following the published protocol2,14.\n7. Single-cell RNA-sequencing Library Preparation\nNOTE: Here, the published protocol14 is followed to generate scRNA-seq libraries with the aid of liquid handling robotics and a few modifications. In this article, the procedure is only briefly described, and the differences are highlighted. Processing 4 plates simultaneously takes about 2.5 days.",
    "Thaw plates on ice and perform reverse transcription with Oligo-dT30VN primer (in the lysis buffer) to generate cDNA with thermal cyclers (Table 1): 42 °C 90 min; 70 °C 5 min; 4 °C hold. Then amplify cDNA with an additional exonuclease digestion step at the beginning (Table 2) using the PCR master mix and in situ PCR (ISPCR) primers (Table of Materials) and the following PCR condition: 37 °C 30 min; 95 °C 3 min; 23 cycles of 98 °C 20 s, 67 °C 15 s, 72 °C 4 min; 72 °C 5 min.\nPurify cDNA using 18 µL of magnetic beads per well (0.7:1 ratio). Incubate the plate on a magnetic stand for 5 min and wash samples twice with freshly made 80% ethanol, 80 µL per well each time. After drying the plate for 15-20 min, elute cDNA with 20 µL of elution buffer per well.\nNOTE: For quality control, use a fragment analyzer (high sensitivity next-generation sequencing [NGS] fragment analysis, 1−6,000 bp) to check size distributions and concentrations of cDNA, and only further process samples with a smear between 500−5,000 bp, and higher than 0.05 ng/µL.\nTo generate libraries, mix 0.4 µL of each cDNA sample with 1.2 µL of Tn5 tagmentation reagents from the library preparation kit (Table of Materials) in a 384-well plate with the aid of a nanoliter pipetting machine, at 55 °C 10 min.\nNOTE: Here, 1/12.5 of the suggested reaction volume (5 µL sample and 15 µL of tagmentation reagents) is added in order to reduce cost and meanwhile increase throughput. A nanoliter pipetting machine (Table of Materials) is used to transfer reagents (this and following steps) from and to 384-well plates.\nAdd 0.4 µL of neutralization buffer to stop the tagmentation reaction at RT for 5 min.",
    "Add 384 indexes (Table of Materials, 0.4 µL forward and 0.4 µL reverse), 1.2 µL of PCR mix to samples (2 µL each), and amplify the libraries using the following condition: 72 °C 3 min; 95 °C 30 s; 10 cycles of 95 °C 10 s, 55 °C 30 s, 72 °C 1 min; 72 °C 5 min.\nPool all individual libraries (take 1 µL each) from the same 384-well plate together, and use magnetic beads (Table of Materials, 0.7:1 ratio) to purify the final pooled libraries.\nUse a fluorometer (Table of Materials) to measure the concentrations and a bioanalyzer (Table of Materials) to examine the size distributions of pooled libraries before sequencing. Target the sequencing depth at 1 million raw reads per cell.\nFollow standard bioinformatic procedures to filter and trim sequencing reads and perform alignment2. Use the count table and meta data as inputs to do clustering analysis with the Seurat package15.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}