{
  "id": 9258,
  "origin_website": "Jove",
  "title": "The Olfactory System as a Model to Study Axonal Growth Patterns and Morphology In Vivo",
  "procedures": [
    "NOTE: Animal handling and experiments were performed as approved by the Göttingen University Committee for Ethics in Animal Experimentation.\n1. Preparation of Instruments and Pipette Fabrication\nEnsure that the electroporation setup consists of a stereomicroscope with large working distance and is equipped with fluorescent illumination and filter sets for the used dye.\nFor electroporation use either a dedicated single cell electroporator or a generic square pulse generator attached to an oscilloscope. Connect the electroporator outputs to a pipette holder and a bath electrode. Connect the positive terminal of the pulse generator to the micropipette holder and the negative terminal to the bath electrode. Ensure both the pipette holder and the bath electrode contain silver wires coated with a thin layer of silver chloride.\nMount the pipette holder on a micromanipulator to allow exact positioning.\nFabricate electroporation micropipettes from borosilicate glass capillaries with internal filament.\nUse a horizontal micropipette puller and apply a modified protocol for the fabrication of pipettes for patch clamp experiments as described by Bestman et al.13.\nAdapt parameters to produce a longer shank and a smaller tip opening resulting in a higher pipette resistance of around 15-20 MOhm for single cell electroporation. The pipette resistance should be lower, e.g., 3-4 MOhm, for labeling of groups of cells.\nMeasure the pipette resistance either directly with a dedicated single-cell electroporator or calculate it with Ohm’s Law after measuring current flow with an oscilloscope after application of a defined voltage pulse.\n2. Preparation of Electroporation Solution",
    "Dissolve fluorophore-coupled dextran in frog ringer (98 mM NaCl, 2 mM KCl, 1 mM CaCl2, 2 mM MgCl2, 5 mM glucose, 5 mM Na-pyruvate, 10 mM HEPES, adjusted to pH 7.8, osmolarity was 230 mOsmol/l) at a concentration of 3 mM. The cells may not be so brightly labeled if lower dye concentrations are used. Prepare a large volume stock solution and divide it into small aliquots. Freeze them for storage (stable for months).\n\tNOTE: Dextrans are available in different sizes and a variety of emission/excitation spectra (e.g., Alexa 488-dextran 10kD, Alexa 546-dextran 10kD, Alexa 568-dextran 10kD, Alexa 594-dextran 10kD, TMR-dextran 3kD).\nBackfill the micropipette with an elongated pipette tip with a small volume of dextran solution (1-5 µl). Carefully flick the micropipette with the finger to remove residual air bubbles from the pipette tip.\nMount the micropipette in the pipette holder. Make sure that the silver wire inside the pipette is in contact with the dye solution.\n3. Selection of Larval X. laevis\nUse albino larvae of X. laevis for the experiments. Wild type animals possess pigment-filled melanophores that show autofluorescence emission during confocal/multiphoton imaging and are therefore not suitable for the described experiments.\nStage premetamorphotic tadpoles after Nieuwkoop and Faber14. Select tadpoles of stages 45-53 for the experiments.\n4. Electroporation of Fluorophore-coupled Dextrans\nPlace a small piece of tissue in a petri dish and cover it with a small volume of water containing 0.02% tricaine (Ethyl 3-aminobenzoate methanesulfonate, adjusted to pH 7).\nAnesthetize the tadpoles in water containing 0.02% tricaine. After some minutes the animals cease moving. Confirm proper anesthesia by touching tadpoles. They should be non-responsive.\nCarefully transfer the tadpole from the anesthetic to the tissue covered petri dish.",
    "Make sure the bath electrode closes the electroporation circuit. Ensure that the electrode is in contact with the wet tissue; a direct contact to the tadpole is not necessary.\nPosition the micropipette tip close to the olfactory organ using the micromanipulator.\nPenetrate the skin covering the olfactory organ with the pipette tip and cautiously advance the tip into the centrally located sensory neuron layer of the main olfactory epithelium or vomeronasal epithelium.\nTrigger positive square voltage pulses to transfer dye into sensory neurons. Apply a single voltage pulse (e.g., 25 V, pulse length 25 msec) or trains of multiple pulses (e.g., 50 V, pulse length 300 µsec, 400 msec train duration at 200 Hz).\n\tNOTE: Determine optimal voltage pulse parameters for the desired extend of labeling. Reduce voltage pulse amplitude, duration and number of repetitions to lower the number of labeled cells. Apply higher voltage pulse amplitude, duration and number of pulses for a more widespread labeling.\nVisualize successful dye extrusion and electroporation by triggered pulses using fluorescent illumination of the stereomicroscope. The dye spreads quickly into cell body and dendrite after successful electroporation.\nRepeat steps 4.5-4.9 for the second olfactory organ of the tadpole.\nTransfer the tadpole into a beaker filled with fresh water for recovery. After ca. 5 min the tadpoles wake from anesthesia and start normal swimming movements.\nAfter 24 hr the electroporated dye spreads in the sensory neurons and eventually reaches the olfactory bulb via axonal transport.\n5. Mounting Animals for In Vivo Visualization of Cells and Axonal Processes\nAnesthetize the tadpoles in water containing 0.02% tricaine.\nCarefully transfer tadpoles into an imaging chamber, e.g., a small silicon rubber covered petri dish with a tadpole-sized recess.",
    "Cut a small rectangle into a stripe of Parafilm. Cover the tadpole with the Parafilm, leaving the anterior telencephalon exposed through the cut-out window. Fix the Parafilm with needles on the dish without injuring the tadpole.\nMake sure the tadpole is submerged in sufficient water containing 0.02% tricaine.\nMount the imaging chamber on the stage of an upright multiphoton microscope or confocal microscope.\nAcquire a three dimensional stack of images of the olfactory bulb. Ensure that the imaging procedure is as short as possible and does not exceed 10-15 min.\nReturn the tadpole into normal water in a separate tank and prevent exposure to light. After 5 min, the tadpole wakes from anesthesia.\nRepeat steps 5.1-5.7 after specified time intervals, e.g., every day.\n6. Mounting Animals for Ex Vivo Visualization of Cells and Axonal Processes\nAlternatively to section 5 of the protocol, use an excised brain preparation to visualize the labeled sensory neurons.\nAnesthetize and kill the tadpole by transection of the brain at the transition to the spinal cord. Excise a block of tissue containing the olfactory organs, the olfactory nerves and the anterior telencephalon.\nTransfer the tissue block to frog ringer solution and remove connective tissue with fine scissors to expose the ventral side of the brain.\nTransfer the tissue block to an imaging chamber and fix it with a platinum frame stringed with nylon threads.\nMount the imaging chamber on the stage of a confocal/multiphoton microscope.\nAcquire a three dimensional stack of images of the olfactory bulb.\n7. Image Processing and Data Evaluation\nOptimize and apply non-local means of filtering to improve image quality and visualization of neuronal structures as described by Coupé, P. et al. 15.\n\tNOTE: Data from imaging experiments in deeper tissue layers of live specimens are often noisy.",
    "Create maximum intensity projections of the image stacks for an overview.\nFor time-lapse imaging experiments screen data sets for single unambiguously identifiable axons of sensory neurons.\nReconstruct cellular morphology via software-assisted tracing of neuronal processes as described by Peng et al.16."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}