{
  "id": 5835,
  "origin_website": "Bio",
  "title": "Proximal Ligation Assay (PLA) on Lung Tissue and Cultured  Macrophages to Demonstrate Protein-protein Interaction",
  "procedures": [
    "Antibody selection   To identify protein-protein interactions, primary antibodies recognizing both proteins must be used. Since the specificity of the antibody is of paramount importance, it is recommended that the antibody is used for Western blot analysis using tissue lysate in both naïve and denaturing conditions. The goal is to obtain highest specificity in both conditions as the following steps might have a mix of target antigens in naïve and denatured condition within the cell.   Primary antibodies must differ in the source species (e.g., anti-MyD88 raised in rabbit and anti-TRAF6 raised in mouse).   Each oligonucleotide-conjugated secondary antibody must recognize one of the primary antibodies.      Sample preparation   Tissue slides   Tissue collected from in vivo sources should be immediately fixed in 10% NBF before embedding in paraffin.   Mount 5-8 µm sections from paraffin blocks to slides.   Deparaffinize slides by dipping them into xylene bath (3-4 dips and 15-20 sec holding time) and rehydrate slides with serial ethanol washes (100, 70, 50, 30 and 0% solutions with water).   Add permeabilization buffer (1x) sufficient to cover the section for 40 min at 4 °C in the dark.   Wash the slides once with PBS and incubate slides in a vegetable steamer for 1 h.   Note: In our example, we use lung tissue harvested from morphine-treated and/or pneumococcus-infected mice.   Cultured cell slides   Plate 40,000 to 50,000 cells/ml media, on a chamber slide and incubate overnight to allow cells to adhere to the slide to a concentration of 60-80% confluence.    Perform any necessary treatments to the cells within chambers.   Remove media and immediately fix cells by adding 10% NBF to each chamber and incubating for 20 min at room temperature.   Remove chamber walls.   Wash slides with PBS three times.   Permeabilize by incubating slides with 0.01% Tween 20 in PBS for 10 min at room temperature.",
    "Wash slides with PBS three times.   Note: In our example, we use J774 cells, a murine peritoneal macrophage cell line. We treated these cells with different concentrations of LPS for 1 h to induce myddosome ligation with TLR4.      PLA protocol   Tap slides to remove excess liquid then air-dry and outline tissue sections or wells with an oil marker.   Incubate slides with blocking solution in a humidity chamber for 30 min at 37 °C.   Remove blocking solution and add enough of both primary antibodies reconstituted in blocking solution (approximately 1 µg antibody/chamber or per section) to cover each section or chamber. Note: Approximately 40 µl of solution will be sufficient to cover a chamber.   Incubate in a humidity chamber overnight at 4 °C.   Place slides in a Coplin jar filled with wash buffer A (see Recipes) two times for five minutes each on a laboratory shaker.   Add oligonucleotide-linked secondary antibody solution, diluted 1:10 in wash buffer A (enough to cover the section/cells) to slides.   Incubate in a humidity chamber for 1 h at 37 °C.   Wash in wash buffer A two times for five minutes each on a shaker.   Add ligase solution to slide (enough to cover the section/cells) and incubate for 30 min in a humidity chamber at 37 °C. Note: Working concentration of ligase should be 1:40 from the original vial, diluted with molecular biology grade water.   Wash in wash buffer A two times for five minutes each on a shaker.   Add premixed polymerase and nucleotide solution to slide and incubate for 100 min at 37 °C. Note: After this point, limit exposure of slide to light. Working concentration of polymerase should be 1:80 of original solution, diluted with molecular biology grade water. Wash in wash buffer B (see Recipes) twice for 10 min each.",
    "Wash in 1x wash buffer B for one minute.   Allow slides to dry.   Mount coverslip in mounting medium with DAPI.   Seal edges of cover slip with nail polish.   Allow to dry."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}