{
  "id": 9016,
  "origin_website": "Jove",
  "title": "Immunostaining of Biocytin-filled and Processed Sections for Neurochemical Markers",
  "procedures": [
    "1. Biocytin Filling during Electrophysiology\nNOTE: The readers can refer to alternative sources for basic patch-clamp recording techniques and instrumentation19-22, which are not elaborated upon here. The steps detailed here assume that the equipment and procedures for patch-clamp recordings are already established, and the description will be restricted to details related to biocytin-filling and post-hoc immunostaining. All experiments outlined in this manuscript were performed on rats.\nUsing a vibratome, prepare live brain sections of the desired region at a thickness of 300 - 350 µm23.\nPrepare an internal solution containing 0.2% biocytin by adding 2 mg of biocytin to 1 mL of internal solution6. For best results, sonicate the internal solution for 10 - 15 min until the biocytin dissolves completely. Next, load the internal solution in a 1 mL syringe fitted with a 0.2 µm pore size polypropylene filter tip attached to a microloader. Keep this loading syringe on a cold pack to maintain the stability of the Mg-ATP and Na-GTP in the internal solution.\n\tNOTE: An internal solution containing potassium gluconate (126 mM K-gluconate, 4 mM KCl, 10 mM HEPES, 4 mM Mg-ATP, 0.3 mM Na-GTP, and 10 mM phosphocreatine) is optimal for the recovery of certain neurochemical markers, including parvalbumin, during immunolabeling. In our experience, using cesium- and chloride-based internal solutions reduces the ability to recover immunostaining for certain neurochemical markers. Neurobiotin or a cell-impermeant, fixable, polar tracer combining an Alexa Fluorophore with biocytin can be used as an alternative to biocytin.\nUnder infrared differential interference contrast, visualize the appropriate cell for recording. To minimize any disruption of the axon, approach the cell body by lowering the pipette along its axis using the \"approach\" function available in most micromanipulators. Establish whole-cell recordings under infrared differential interference contrast using patch-clamp physiology protocols19-22.",
    "NOTE: Avoid approaching the cell from the direction of the putative axon, as it will sever the axon, visualized as a bleb at the cut end (green arrow in Figure 1). Also, avoid applying high positive pressure to the recording pipette while approaching the cell to minimize the spill of biocytin, which will result in high background staining.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54880/54880fig1.jpg\nFigure 1. Suggested Plane for Approaching Cells for Biocytin Fills. The image illustrates a Granule Cell (GC) fill with biocytin during recording that has been processed to reveal biocytin (in red using 594-conjugated streptavidin). The GC has its dendrites oriented in the XY plane. Notice the severed granule cell axon (green arrow) due to pipette movement along the XY plane. Note that it is ideal to approach this neuron along the XZ plane. Scale bar: 50 µm.\nIn voltage clamp configuration, determine the whole-cell capacitance and series resistance in response to small (5 mV), brief (30 ms) voltage steps using the using the membrane test function in bath mode in an electrophysiology data acquisition and analysis software. This will ensure the establishment of whole-cell recording conditions to allow for biocytin-filling.\nConduct physiological recordings in either current- or voltage-clamp mode as needed. A minimum recording time of >10 min at 34 °C is ideal.\n\tNOTE: Longer recording times may be needed for studies performed at room temperature.\nUpon completion of the physiological recordings, re-establish the patch-clamp configuration by slowly moving the recording pipette in small steps, alternating upward (along the Z-axis) and outward (along the X-axis) in voltage-clamp mode.",
    "Simultaneously monitor the capacitance and input resistance using the \"membrane test\" function to visualize the loss of capacitive transients and the collapse of the current responses to a straight line, indicating the re-sealing of the cell and the establishment of an outside-out-patch at the pipette tip. Holding the cell at a depolarized potential (-40 mV) will facilitate the re-sealing process.\n\tNOTE: This procedure for the removal of a cell typically ensures the complete recovery of the soma and dendrites. Do not apply positive pressure to the recording pipette during this procedure or while detaching the cell from the pipette. Visualization of the soma of the recorded cell in the slice indicates successful disengagement. The presence of cellular debris or a membrane patch at the end of the detached tip typically indicates dislocation of the soma and will not yield complete cellular morphology.\nAfter detaching the pipette from the cell, retain the slice in the recording chamber for 3 - 5 min to ensure the transport of the dye to distal dendritic and axonal processes.\nTransfer the slices to a 24-well plate containing 4% PFA for fixation.\nCAUTION: PFA is carcinogenic, and appropriate personal protective equipment, including gloves and a face mask, must be used to avoid skin irritation and inhalation. PFA is flammable and must be kept out of reach of fire. PFA is never disposed of in the drain and must be collected as chemical waste. PFA fixation must be isolated from areas utilized for live slice preparation to avoid contamination of the physiology setup, including transfer pipettes.\n24 - 48 h after PFA fixation, transfer the slices to 0.1 M Phosphate-buffered Saline (PBS) for storage prior to immunostaining.",
    "NOTE: Ideally, biocytin recovery and immunostaining are best when performed soon after fixation, although staining performed within 7 d of fixation yields good results. Slices can be maintained in PBS with 0.02 - 0.05% sodium azide for staining performed up to and over 90 days after fixation. Although overnight fixation in PFA works well for most antibodies, it is possible that some antibodies work best when the duration of incubation in fixative is reduced. Fixation in PFA for over 48 h reduces the availability of antigens and diminishes the chances of successful secondary immunostaining for neurochemical markers.\nCAUTION: Sodium azide is extremely hazardous and an irritant upon contact with the skin or eyes or upon ingestion or inhalation. Severe over-exposure can result in death. The carcinogenicity and mutagenicity of the compound are not known. Use appropriate personal protective equipment including gloves, splash goggles, a lab coat, and a dust respirator. Sodium azide is never disposed of in the drain and must be collected as chemical waste.\n2. Staining of the First Primary Antibody and Biocytin\n(Day 1)\nNOTE: The following immunostaining procedure is for free-floating sections and requires continuous shaking at a low speed (2 revolutions/min, rpm) on a shaker for all incubation steps.\nWash the tissue 3x for 10 min each in 0.1 M PBS (pH = 7.4).\n\tNOTE: 0.1 M PBS can be commercially purchased or made in the laboratory as follows (makes 1 L): 8 g of NaCl, 0.2 g of KCl, 1.44 g of Na2HPO4, and 0.24 g of KH2PO4 in 1 L of dH20.\n\tNOTE: If the desired neurochemical marker is known, staining for a protein/peptide can be performed simultaneously with biocytin staining (steps 2.2 - 2.4). If staining for biocytin only, proceed to step 2.5.",
    "OPTIONAL: Block with 10% Blocking Serum (BS; normal goat serum (NGS) diluted in 0.3% Triton X-100 in PBS for 1 h at RT).\n\tNOTE: Each well should receive the same volume of the solution; the recommended volume is between 250 - 500 µL/well. The selection of the blocking serum is based on the species in which the secondary antibodies are raised (e.g., NGS is used for dye-conjugated goat anti-(respective primary antibody species)). If the need arises to use secondary antibodies raised in different species to immunostain sections, include 10% of each normal serum in blocking step (2) and 3% of each normal serum for the primary and secondary antibody incubation steps.\n(OPTIONAL) Incubate the sections in primary antibody, CB1R (polyclonal, guinea pig) with 0.3% Triton X-100, and 3% BS in 0.1 M PBS at RT O/N. CB1R is used to identify cannabinoid receptor type 1 expression.\n\tNOTE: This step is optional and not required to reveal the biocytin filling. Figure 2 illustrates a section labeled for biocytin and CB1R during the first staining process. O/N incubation at RT is sufficient for most of the primary antibodies; however, certain primary antibodies, including CB1R, require 3 - 5 d of incubation. If the incubation needs to be longer than 1 d, it is recommended to incubate at 4 °C because Triton X-100 can permeabilize slices and can lead to the disintegration of the tissue during prolonged incubation at room temperature. Include a negative control lacking primary antibody in at least one section for each series of experiments as a control for the specificity of the secondary antibody. For negative controls, the primary antibody is omitted, but the 0.3% Triton X-100 in 0.1 M PBS and BS are added.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54880/54880fig2.jpg",
    "Figure 2. Successful CCK Staining 1 Week Following the Recovery of Biocytin Staining and Cannabinoid Receptor Type 1 (CB1R)-labeling. (A - C) Confocal images at 60X showing the biocytin-filled neuron (A) and CB1R immunoreactivity (B), indicated by the arrowhead. The same section was processed for CCK immunostaining after 1 week (C). The overlay of images is shown in D. CCK immunoreactivity was revealed using far-red and was pseudo-colored in cyan. (E) Morphological reconstruction of the biocytin-filled cell in A. Note that the biocytin and CB1R staining are evident even after the second CCK immunostaining. Also note the expected distribution of CB1R and CCK immunostaining patterns. (F - H) Magnified image of the axon from the cell, as in A, show close co-localization of biocytin and CB1R in axons (arrow heads). Scale bar: 50 µm (A - D), 100 µm (E), and 10 µm (F - H). Images are reproduced from Yu et al. 20159. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54880/54880fig2large.jpg]\n(Day 2)\nWash the brain sections 3x for 10 min each in 0.1 M PBS (pH = 7.4).\nIncubate the sections in streptavidin red dye conjugate (concentration: 1:1,000; excitation: 594 nm with emission in the visible red spectrum) with 0.3% Triton X-100 and 3% BS in 0.1 M PBS at 4 °C O/N in the dark (wrapped in aluminum foil) to reveal the biocytin. OPTIONAL: Include a secondary antibody, goat anti-guinea pig (concentration: 1:500; excitation: 488 nm and emission in green), with the above incubation if following the optional primary incubation in step 2.3.",
    "NOTE: Secondary antibody will be needed only if the optional primary antibody staining (step 2.3) is performed. To visualize biocytin, a streptavidin-fluorophore conjugate with an emission spectrum in red is recommended, as it helps to visualize finer axons in detail and with better contrast (Figures 1 - 3). During double or triple immunostaining, in order to avoid cross-reactivity of secondary antibodies with each other, add secondary antibodies one after the other in a serial fashion (2 h interval between serial additions of the antibodies is sufficient). Figure 3A illustrates a biocytin-filled cell processed without the optional primary antibody staining and imaged prior to resectioning.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54880/54880fig3.jpg\nFigure 3. Successful Second Immunostaining following the Recovery of Biocytin Morphology and Resectioning. (A1) Confocal image of a 300 µm slice showing the recovery of the dendritic morphology of a biocytin-filled cell. (A2) Membrane voltage traces of the neuron in response to +500 and -100 pA current injections. (B) Recovery of the biocytin-filled soma in a 50 µm section obtained after resectioning the 300 µm section (in A1) after mounting and imaging. (B2) Subsequent immunostaining of the thin section revealed colocalization of the biocytin-filled soma (right panel) with CCK (middle panel). The merged image is illustrated in the right panel. Scale bar: 50 µm. Panel A2 is reproduced with permission from Yu et al., in press25. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54880/54880fig3large.jpg]\n(Day 3)\nWash brain sections 3x for 10 min each in 0.1 M PBS (pH = 7.4).\nTo protect the fluorescence and to facilitate re-staining in the future, mount the sections in an aqueous-based mounting medium and seal the edges of the coverslip with clear nail polish.",
    "NOTE: It is best to restain sections as early as possible to avoid difficulties in removing the nail polish from the slide, mold infestation, and dehydration of tissue due to leakage of the mounting medium from the glass slide. Microbial contamination can be prevented by using 0.02% sodium azide in PBS.\nCAUTION: Sodium azide is highly toxic and flammable when it is in contact with water. Please refer to standard operating procedures for the handling and disposal of hazardous chemicals.\n(Days 4 - 7)\nPerform confocal imaging with excitation at 594 and 488 nm and at a magnification of 20X or 40X to reveal biocytin-filled neurons in red and neurochemical markers (CB1R) in green. Assess colabeling (Figure 2).\nSet the camera exposure to less than 100 ms to avoid photobleaching and obtain confocal image stacks of the axonal and dendritic arbors of the entire neuron. Use confocal image stacks and neuron tracing software packages to reconstruct the neuronal morphology.\n3. Staining of the Second Primary Antibody\nNOTE: While the second immunostaining step can be performed 90 d after the first staining, optimal staining is achieved if the second primary antibody staining is performed within 7 - 10 d.\n(After 7 - 90 d)\nApply acetone to a cotton swab and strip the nail polish off of the glass slide.\nRemove the coverslip carefully using fine-tip forceps and put a few droplets of 0.1 M PBS on the sections.\nCarefully remove the sections from the slide using a fine paint brush and wash them in 0.1 M PBS for 24 - 48 h on a shaker covered in aluminum foil in low light at 4 oC.\n\tNOTE: It is crucial to cover sections with aluminum foil to avoid photobleaching.",
    "To ensure complete removal of the mounting medium, wash the sections 1 - 2x on the following day in 0.1 M PBS for 10 min each.\nProceed with incubation in the second primary antibody (e.g., cholecystokinin, a neuropeptide found in certain GABAergic interneurons (CCK; concentration: 1:1,000; mouse monoclonal antibody)) for 1 d (Figure 2).\n\tNOTE: This procedure is similar to step 2.3 but uses a different antibody. Additionally, the blocking step is omitted during re-staining.\nWash the brain sections three times for 10 min each in 0.1 M PBS (pH = 7.4).\nStain with the fluorophore-conjugated secondary antibody goat anti-mouse (concentration: 1:500; excitation wavelength: 647 nm), making sure that the excitation-emission spectra of the secondary antibody do not overlap with streptavidin (concentration: 1:1,000; excitation wavelength: 594 nm) and prior immunofluorescence stains.\nMount the sections in aqueous mounting medium and seal the edges of the cover slip with clear nail polish.\n\tNOTE: Store the sections at 4 °C in an opaque storage box to protect the fluorescence.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}