{
  "id": 13255,
  "origin_website": "Jove",
  "title": "Evaluation of a Smartphone-based Human Activity Recognition System in a Daily Living Environment",
  "procedures": [
    "This protocol was approved by the Ottawa Health Science Network Research Ethics Board.\n1. Preparation\nProvide participants with an outline of the research, answer any questions, and obtain informed consent. Record participant characteristics (e.g., age, gender, height, weight, waist girth, leg height from the anterior superior iliac spine to the medial malleolus), identification code, and date on a data sheet. Ensure that the second smartphone that is used to capture video is set to at least a 30 frames per second capture rate.\nSecurely attach a phone holster to the participant's front right belt or pant waist. Start the smartphone application that will be used to collect the sensor data (i.e., data logging or WMMS application) on the mobility measurement smartphone and ensure that the application is running appropriately. Place the smartphone in the holster, with back of the device (rear camera) facing outward.\nStart digital video recording on a second smartphone. For anonymity, record the comparison video without showing the person's face, but ensure to record all activity transitions. The phone can be handheld.\n2. Activity Circuit\nFollow the participant and video their actions, on the second smartphone, while they perform the following actions, spoken by the investigator:\n\t\nFrom a standing position, shake the smartphone to indicate the start of the trial.\nContinue standing for at least 10 sec. This standing phase can be used for phone orientation calibration 14.\nWalk to a nearby chair and sit down.\nStand up and walk 60 meters to an elevator.\nStand and wait for the elevator and then walk into the elevator.\nTake the elevator to the second floor.\nTurn and walk into the home environment.\nWalk into the bathroom and simulate brushing teeth.\nSimulate combing hair.\nSimulate washing hands.\nDry hands using a towel.\nWalk to the kitchen.",
    "Take dishes from a rack and place them on the counter.\nFill a kettle with water from the kitchen sink.\nPlace the kettle on the stove element.\nPlace bread in a toaster.\nWalk to the dining room.\nSit at a dining room table.\nSimulate eating a meal at the table.\nStand and walk back to the kitchen sink.\nRinse off the dishes and place them in a rack.\nWalk from the kitchen back to the elevator.\nStand and wait for the elevator and then walk into the elevator.\nTake the elevator to the first floor.\nWalk 50 meters to a stairwell.\nOpen the door and enter the stairwell.\nWalk up stairs (13 steps, around landing, 13 steps).\nOpen the stairwell door into the hallway.\nTurn right and walk down the hall for 15 meters.\nTurn around and walk 15 meters back to the stairwell.\nOpen the door and enter the stairwell.\nWalk down stairs (13 steps, around landing, 13 steps).\nExit the stairwell and walk into a room.\nLie on a bed.\nGet up and walk 10 meters to a ramp.\nWalk up the ramp, turn around, then down the ramp (20 meters).\nContinue walking into the hall and open the door to outside.\nWalk 100 meters on the paved pathway.\nTurn around and walk back to the room.\nWalk into the room and stand at the starting point.\nContinue standing, and then shake the smartphone to indicate the end of trial.\n3. Trial Completion\nStop the video recording smartphone and ask the participant to remove and return the smartphone and holster. Stop the data logging or WMMS application on the smartphone. Copy the acquired motion data files and the video file from both phones to a computer for post-processing.\n4. Post-processing",
    "Synchronize timing between the video and the raw sensor data by determining the time when the shake action started. This shaking movement corresponds to a distinct accelerometer signal and video frame. Check for synchronization error by subtracting the end shake time from the start shake time, for sensor and video data sources. Time differences should be similar between the two data sets.\nDetermine actual change-of-state times from the gold-standard video by recording the time difference from the start shake time to the video frame at the transition between activities. Use video editing software to obtain timing to within 0.033 sec (i.e., 30 frames per second video rate). Use WMMS software to generate comparable changes-of-state from the sensor data.\nGenerate two data sets, one with true activities and the second with predicted activities, by labeling the activity for each video frame (based on the change of state timing) and then calculating the predicted activity at each video frame time from the WMMS output. For WMMS performance evaluation, calculate true positives, false negatives, true negatives, false positives between the gold-standard activity and WMMS predicted activity. Use these parameters to calculate sensitivity, specificity, and F-score outcomes measures.\n\tNote: A tolerance setting of 3 data windows on either side of the window being analyzed can be used for determining change-of-state outcomes, and 2 data windows for classification outcomes. For example, since 1 second data windows were used for the WMMS in this study, 3 sec before and after the current window were examined so that consecutive changes within this tolerance are ignored. The consideration was that changes of state that happen in less than 3 sec can be ignored for gross human movement analysis since these states would be considered transitory.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}