{
  "id": 6929,
  "origin_website": "Bio",
  "title": "A Reproducible Protocol to Measure the Critical Swimming Speed of Adult Zebrafish",
  "procedures": [
    "Calibration of water velocityThis system consists of an outside tank and a double cylinder (Figure 1A). The outside tank contributes to maintain water temperature of the double cylinder, which is composed of an external cylinder and an inner swimming chamber (Figure 1B). A propeller in the swimming chamber generates water flow in the double cylinder by controlling the propeller rotation depending on an input voltage controlled by the AutoResp software. It is necessary to calibrate the input voltage and water velocity. This calibration can be done by flowing green fluorescent micro beads in the swimming chamber using high-speed camera controlling software uEye Cockpit and analyzing velocity of moving beads using DPTV.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200813/20200813094004_4555.jpgFigure 1. Structure of the swimmill. A. The schematic diagram of the Swim Tunnel Respirometer. C: high speed video camera; D: dissolved oxygen densitometer, T: thermometer. B. Size of the double cylinder. C. An enlarged view of the double cylinder. The propeller rotation generates a directional water flow in the double cylinder. Fluorescent beads flow in the double cylinder and glitter by receiving the excitation light from the green laser pointer. M: mesh; P: propeller. D. In the presence of water flow, zebrafish keep swimming by the same speed with water velocity to stay at the same position. Two plastic meshes were put in the swimming chamber to avoid the fatigued fish hit the propeller.Set up the Swim Tunnel Respirometer with 18 L of water in the outside tank and inside double cylinder along with a heater that maintain the outside water temperature at 26 ± 0.2 °C (Video 1). Fish is not necessary for the calibration of water velocity.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1.",
    "Set up the Swim Tunnel Respirometer Replace the dissolved oxygen densitometer, which is inserted into the inner swimming chamber, with fluorescent laser pointer for visualization of fluorescent beads (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Calibration of water velocity Suspend 1 mg of fluorescent beads in 2 ml of water and then apply it to the double cylinder through a water inlet at the top of the side cover of the double cylinder.Start the AutoResp software and set the input voltage at 0.5 V, initiating rotation of the propeller to generate water flow in the inner swimming chamber (Figure 1C) (https://loligosystems.com/FileCatalog/GetCatalogItemFileUpload?catalogItemId=82[href=https://loligosystems.com/FileCatalog/GetCatalogItemFileUpload?catalogItemId=82]).Start the uEye Cockpit software for video capturing and record the movement of fluorescent beads in the inner swimming chamber (https://en.ids-imaging.com/ueye-cockpit.html[href=https://en.ids-imaging.com/ueye-cockpit.html]).Repeat Steps A4 and A5 by changing input voltage from 0.5 to 4.5 V in a stepwise manner with a 0.25 V increment.Analyze the speed of ~10,000 fluorescent beads in movies using the DPTV software and calculate the water velocity at each input voltage. The user manual of the DPTV software is available here[href=https://www.loligosystems.com/FileCatalog/GetCatalogItemFileUpload?catalogItemId=83].Make a graph of input voltage and water velocity with a best-fit approximate line using Microsoft Excel (Figure 2).Input the graph parameters in the AutoResp software so as to automatically calibrate the input voltage and water velocity.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200813/20200813094209_2449.jpgFigure 2. Voltage-Water velocity plot. The approximate line becomes straight because water velocity is proportional to the input voltage.Calibration of dissolved oxygen concentrationThe probe of dissolved oxygen densitometer, which can be inserted into the inner swimming chamber during swimmill assay, records the dissolved oxygen (%) per saturated dissolvable oxygen (constant) at the water temperature. This calibration of dissolved oxygen densitometer can be carried out in the AutoResp software using oxygen-saturated water (100%) and sodium sulfite solution (0%).",
    "Place the probe about 5 cm depth in 40 ml of water in a 50 ml conical tubes and check the dissolved oxygen in the AutoResp software (Video 3).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Calibration of dissolved oxygen concentration Bubble ~5 L of oxygen from an oxygen can into water through a nozzle (inner diameter 1 mm) until the value of dissolved oxygen no longer increase.Calibrate the probe for 100% by setting “Lock Hi” in the AutoResp software.Dissolve 2 g of sodium sulfite, which is an oxygen scavenger agent, in 40 ml of water to make oxygen-free water.Clean the probe and place it in the oxygen-free water then calibrate the probe for 0% by setting “Lock Lo” in the AutoResp software.Measurement of swimming speedZebrafish (Danio rerio) are reared and maintained at 26-28 °C under a 14 h light and 10 h dark photoperiod and fed twice a day in the regular care. Zebrafish used for swimming assay are kept unfed for 20~24 h prior to the measurement, because swimming speed of zebrafish decreases after eating food. This measurement is done between AM 10:00 and PM 3:00.Put an adult zebrafish into a 10 ml measurement cylinder (Φ 11 mm) that contains 5 ml of water and measure the volume (increase of water height) and the mass of the fish by an electric balance (Figure 3). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200813/20200813094313_9858.jpgFigure 3. Measurement of the volume and mass of adult fish. The increment of the water height by putting a zebrafish in the measurement cylinder is the volume of the fish. The weight of the fish is simultaneously measurable using an electric balance.Transfer the zebrafish into a 50 ml plastic tube filled with water and put it in the outside tank for 10 min to acclimate the fish to the narrow cylinder and water temperature (26 ± 0.",
    "2 °C).Pre-mark 3 cm distance lines on the inner swimming chamber using an oil-based marker. This helps to measure total length and standard length of fish in the analysis of swimming movies (see Data analysis B).Add a single zebrafish in the inner swimming chamber of the double cylinder (Video 4).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Loading zebrafish into Swim Tunnel Respirometer Set the double cylinder in the Swim Tunnel Respirometer.Start the AutoResp and uEye Cockpit software to be ready for the control of input voltage and video-recording, respectively.Initiate propeller rotation at 10 cm/s water flow and video-recording simultaneously (Video 5).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5. A zebrafish could keep swimming in 10 cm/s water velocity After 1 min of warming-up at 10 cm/s water flow, the water velocity is set at 15 cm/s to start automatic step protocol in the AutoResp software (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200813/20200813094424_8910.jpgFigure 4. A protocol of the swimming time and water velocity. The water velocity is initially set at 10 cm/s for 1 min and eventually increased to 15 cm/s for 1 min. Thereafter step protocol increases the water velocity 1 cm/s every 1 min.After the fish get fatigued and failed to continue swimming (Video 6), stop the propeller rotation and video-recording.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 6. A zebrafish failed to keep swimming in 33 cm/s water velocity Record the water temperature and dissolved oxygen concentration as well as water velocity and time when the fish failed to keep swimming.Note: If you want to change the water temperature, you can increase the temperature by altering the setting of thermal heater or decrease it by putting an ice bag in the outside water tank."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}