{
  "id": 19356,
  "origin_website": "Jove",
  "title": "Sampling Cerebrospinal Fluid and Blood from Lateral Tail Vein in Rats During EEG Recordings",
  "procedures": [
    "All experimental procedures have been approved by the University of Ferrara Institutional Animal Care and Use Committee and by the Italian Ministry of Health (authorization: D.M. 603/2022-PR) in accordance with guidelines outlined in the European Communities Council Directive of 24 November 1986 (86/609/EEC) on the protection of animals used for experimental and other scientific purposes. This protocol is specifically adjusted for further quantitative polymerase chain reaction (qPCR) analyses of small non-coding ribonucleic acid (sncRNAs) in the rat CSF and plasma obtained under EEG control in epileptic animals. At its option, please see the related JoVE video for a better understanding and improvements of the surgery19,20,21.\n1. Preparation of animals for surgical implantation of electrodes or telemeters\nNOTE: The stereotaxic surgery technique varies according to the EEG system used. The following method section provides a description of steps that are in common for the two types of surgeries.\nUse Sprague-Dawley (SD) rats (males, 7-8 weeks old, weighing 250-290 g) maintained in accordance with local laws for the Care and Use of Laboratory Animals. House the animals under standard conditions with free access to food and drinking water.\nProceed with handling the rats for a few days before the surgery and the experimental protocol procedures.\nUse a stereotaxic apparatus for electrodes or telemeters implantation. Follow the contemporary standards for aseptic surgeries. Use sterile and good-working electrodes and transmitters.\nShave the animal's head with the electric razor. Induce anesthesia in the animal with the mixture of ketamine (45 mg/kg) and xylazine (7.5 mg/kg) administered intraperitoneal (i.p.), then add the isoflurane anesthesia (1.4% in air; 1.2 mL/min) delivered through a face mask and fix the animal's head into the stereotaxic apparatus.",
    "Ensure adequate depth of anesthesia by testing pedal withdrawal reflex after foot pad pinch on both animals' hind feet and maintain isoflurane anesthesia till the end of the surgery. Regularly check the anesthetic depth for the entire duration of the procedure.\nApply a sufficient amount of eye ointment on both animals' eyes to prevent corneal damage due to loss of blink reflex caused by anesthesia.\nThoroughly clean the animal's scalp with liquid disinfectant and make a longitudinal 2 cm long cut using a sterilized scalpel. Open the scalp and apply surgical clips on the skin flaps to keep it open.\nGently, detach the periosteum to expose the bregma and the area of the skull through which the recording electrode will be inserted.\n2. Surgical implantation of tethered electrodes\nNOTE: Before establishing the puncture CSF withdrawal procedure of this protocol (see step 9 for details), repeated CSF withdrawals via guide cannula in a few freely moving non-anesthetized rats were performed. Cannulated animals implanted with tethered electrodes were used in order to evaluate the impact of double-head implants on long-term EEG recording coupled with multiple CSF sampling. In these specific experiments, rats were implanted with a dummy guide cannula placed in the cisterna magna, the tip of which was inserted 7 mm into it stereotactically, according to previously published protocols22. Double implant surgery approaches were similar to those adopted by some workers in the past for microdialysis guide cannulas and tethered electrode implantation23,24.\nUse one arm of the stereotaxic frame, mount the electrode holder on it, and put the electrode upright into the holder. Move the electrode tip exactly above the bregma. Write down the anteroposterior and mediolateral coordinates of bregma and translate them to the desired coordinates.",
    "Lower the electrode until its tip almost touches the skull. Mark the drilling spot and drill the skull on the marked spot. Be careful not to damage the brain and meninges.\nMake four or more holes for anchoring screws and screw them into the skull. Pay attention to the size of the electrode when making the holes for anchoring screws. The electrode size should not interfere with the positioned anchoring screws.\nSlowly lower the stereotactic arm carrying the electrode on the dorsoventral axis, enter the brain tissue, and stop at the desired position. Fix the electrode ground wire around one of the screws screwed into the skull.\nPut the methacrylic cement onto the electrode and screws covering about half of the electrode pedestal height. Leave the upper half part of the electrode, which fits the tethering wire's ending, bare.\nRelease the electrode from the holder and raise the stereotactic arm. Release the animal from the stereotaxic apparatus and give it postoperative care.\nPlace the animal in a separate recovery cage and observe it every 10 minutes until awake and ambulatory. Return the animal to its standard housing cage and to another not anesthetized animals' company only after fully recovered.\n3. Surgical implantation of the telemeters\nNOTE: Use only sterile telemeters. If telemeters are reused, clean and sterilize them before the surgery according to their manufacturer instructions. In this protocol, a data science International (DSI) telemeters for EEG recording was used.\nTurn on the telemetry transmitter using a magnet and test the signal with an AM frequency radio. Check for a strong and clear signal before the surgery. If needed, discard the bad working telemeters.",
    "Prepare the telemeter leads by shortening these to optimal lengths for adult rats. Peel back the silicone coating on two (negative and positive) leads, exposing approximately 5 mm of the helical steel lead. Create a looped handle of about 2 mm in length and 1 mm in width at the tip of the leads.\nShave the animal's flank under and behind the left shoulder. Disinfect the area of surgery with disinfectant based on stabilized peroxides and quaternary ammonium activity. Let the disinfectant act for 15 min.\nMake about 2 cm lateral incision just behind the shoulder of the animal and make a subcutaneous pocket of about 5 cm3 space for the transmitter placement. Place the transmitter parallel to the long axis of the body, with the leads directed to the rostral direction.\nFix the transmitter to the inner wall of the subcutaneous pocket with a 3-0 cotton suture. Using blunt-ended scissors, create the subcutaneous tunnel (roughly 2.5 cm in length) through the flank and neck of the animal, thus connecting the transmitter pocket with the midline incision made on the animal's scalp at step 1.6.\nTake both telemeters leads with forceps and pull them up through the tunnel, so they are protruding from the scalp incision outlet. Hold the leads out of the scalp incision with wound clips.\nUse the stereotaxic frame to individuate the desired coordinates for positive (red) lead and drill the hole into the skull for the positive lead tip (similar to step 2.1.). Make one more hole for anchoring the screw upward to the rostrum and screw it into the skull.",
    "Insert the tip of positive lead under the skullcap and dura and lay it down on the brain surface. Hook up the looped tip of negative (white) lead on the screw. Put a small amount of methacrylic cement around the positive lead outlet and the negative lead to immobilize them on the skull.\nFix the leads to the inner wall of the skull skin with a 3-0 cotton suture. Make sure the fixed leads and fixing suture will not interfere with the site of CSF withdrawal (i.e., a depressible surface with the appearance of a rhombus between the occipital protuberance and the spine of the atlas).\nClose the scalp incision and flank incision using a 3-0 cotton suture. Apply disinfectants on the wounds. Only after these have dried, apply an antibiotic cream on the sutured wounds.\n4. Post-operative care\nMonitor the animals for about 1 h thereafter the surgery till upright and moving around the cage. Keep them on a warming pad to prevent hypothermia. Administer animals with a systemic antibiotic to prevent infection and a systemic analgesic to prevent post-surgical pain for 2-3 days.\nAllow rats to recover for at least 7 days after surgical procedures. Monitor the animals at least once daily for 3 days for signs of pain or distress.\n5. Status epilepticus induction in rats\nNOTE: For a detailed protocol of status epilepticus (SE) induction needed to reproduce the mesial temporal lobe epilepsy (mTLE) in rats, refer to Guarino et al.25.\nAfter a week of post-surgical recovery, assign the animals randomly to groups: (i) control animals receiving vehicle and (ii) epileptic animals which will receive pilocarpine. Use a proportionally higher number of animals for the epileptic group, since not all the pilocarpine-administered rats will survive or develop SE.",
    "The day before the SE induction, give animals a single dose of 127 mg/kg lithium chloride dissolved in 0.9% saline (3M) as a volume of 1 mL/kg by gastric gavage. Administer the animal's lithium, which increases the pilocarpine efficacy26, approximately 14 h before the induction of SE in order to decrease variability in time to SE onset.\nAbout 14 h after lithium administration, give the rats a single injection of methyl scopolamine (1 mg/kg, subcutaneously).\nExactly 30 min after methyl scopolamine administration, give the rats a single injection of pilocarpine (50 mg/kg, i.p.) to induce the SE. Give methyl scopolamine and vehicle (0.9% NaCl solution) to control rats.\n\t\nPilocarpine injection induces typical behavior in animals: early partial seizures (movements of vibrissae and head nods within 5 min after pilocarpine administration) evolving into recurrent generalized convulsions (SE) within 25-30 min. For rats that do not develop SE within 30 min, administer an additional dose of pilocarpine (25 mg/kg, i.p.), and if they still do not develop SE, exclude them from the study (SE non-responders).\nObserve and score the seizure behavior in rats every 5 min beginning immediately after the pilocarpine injection. Use the Racine scale for scoring27.\nInterrupt the SE 2h after the onset by i.p. administration of a cocktail of drugs: diazepam (10 mg/kg), phenobarbital (25 mg/kg), and scopolamine (1 mg/kg).\nGive the rats this cocktail again after 4 h. Finally, after another 4 h, give the rats i.p. the last mixture of drugs (diazepam 10 mg/kg plus scopolamine 1 mg/kg) in order to completely stop the seizure activity.\nInject i.p. the animals with saline (1 mL of 0.9% NaCl solution, pH adjusted to 7.0) and feed them with a 10% sucrose solution for 2-3 days after SE to favor recovery from the body weight loss which follows SE.",
    "Assign post-SE surviving animals randomly to different experimental groups according to the requirements of the specific experimental protocol. Use the following inclusion/exclusion criteria for further experiments in epileptic rats: development of convulsive SE within 1 h after pilocarpine administration, weight gain in the first week after SE, and the correct positioning of the electrode in the brain area of interest for EEG registrations25.\n6. Tethered video-EEG in epileptic rats and analyses of seizure activity\nNOTE: This section describes the experimental procedure to record EEG signals in single-housed, freely moving rats under standard conditions. The cage should not contain objects where the animal or the recording cable can get stuck. Depending on the scientific question to be addressed, several parameters can be analyzed. In the case of epilepsy research, the EEG traces are screened to recognize electrical and motor seizures. The most common parameters used to identify a seizure are the amplitude, frequency, and duration of paroxysmal electrical activity.\nPlace the animal in a clean cage in the recording room to allow habituation and reduce the stress induced by the new environment. Place the animal's cage into a Faraday cage to avoid contamination of the EGG signal with the environmental electromagnetic field.\nConnect one end of the recording cable to the recording device. Use a voltmeter to measure the electric potential and differentiate between ground and reference electrodes.\nConnect the other end of the recording cable to the electrode fixed on the head of the rat. For this aim, hold the cement cover on the animal's head when inserting the cable plug into the electrode connector and avoid applying any pressure on the rat's head.",
    "Counterbalance the weight of the recording cable to allow free movement of the animal while preventing the risk of twisting the cable. To do this, use a counterbalancing arm or commutators. Even if the recording cable is counterbalanced, put the food inside the cage instead of in a feeding holder, in which the animals have to rise to reach the food.\nBefore starting the registration, check all the settings used to acquire and process the data from the EEG.\n\tNOTE: This protocol does not provide an introduction to the apparatus required to perform the EEG recording, however, adequate filtering and sampling rates should be applied to avoid artifacts and noise in EEG signals.\n\t\nFor a routine experiment, set the sample rate at 500 Hz, and the amplification gain at 5000x. Filter the signal using a 0.005 Hz filter in addition to a notch filter to discard the surrounding electrical activity in the 50 Hz band (specific for European countries).\nStart both video and EEG recordings and ensure that the traces match an expected EEG signal by checking the power in specific frequency bands across the time. Record a baseline period before starting the interventions in the animals.\nCheck animals and EEG traces periodically. It is not rare that a recording cable detaches from the electrode connector in the rat head. If this happens, reconnect the electrode in the rat head to a recording cable again and check for a clear EEG signal.\nAnalyze the EEG signal manually or automatically using commercially available software. If analyzing manually, screen through EEG recording to identify seizure-like activities. If software is going to be used, configure key parameters of a seizure event, like amplitude, frequency, and duration of electrical activity.",
    "NOTE: Single seizure may be characterized by an electrical activity with an amplitude 3x higher than baseline, frequency equal to or higher than 5 Hz, and duration of at least 5 s22.\nRegardless of the method used, confirm the potential convulsive seizures by checking the synchronized video recording collected simultaneously with EEG.\n7. Telemetry video-EEG in epileptic rats and analysis of seizure activity\nNOTE: This section describes the experimental procedure to record radiotelemetry EEG signals in single-housed, freely moving rats under standard conditions. The protocol is based on a commercially available telemetry system. However, several telemetry systems differ slightly in their functional and technical specifications. The system should be chosen depending on lab requirements and research goals.\nPlace the animal home cage above the signal receiver. Connect the signal receiver to the data acquisition system and this to a computer with the acquisition software.\nTurn on the radiofrequency telemetry implant by placing a magnet in proximity to the telemeter inserted in the rat flank. Test the signal using a radio device. Use a universal radio device to test the telemeters and hear a clear beep indicates the telemeter is activated, whereas a sizzling sound indicates an inactivated telemeter.\n\tNOTE: The lifespan of the radiofrequency transmitter battery should be taken into account before defining the duration of the recordings.\nSet up the acquisition software and synchronize the telemetry signal and video system to simultaneously acquire EEG and video data. Assign one signal receiver to each implanted transmitter and set the calibration values of the transmitter. Set the sample rate at 1000 Hz, noise detection between -500 mV and +500 mV, and the integration interval at 100 ms. Do not use low and high pass filters.",
    "Start the telemetry and video recordings. Perform long-term baseline recording before acquiring the epileptic-like activity. Analyze the EEG signal as described in steps 6.8 and 6.9.\n8. Procedure of blood collection from the tail vein\nNOTE. The vacuum blood collection system consists of a butterfly needle (23 G x ¾ x 12 (0.8 mm x 19 mm x 305 mm). The blood collection technique can be easily performed by one operator and the procedure takes about 5 min.\nCoat the butterfly needle and its tubing with 1% K2EDTA in distilled water shortly before the withdrawals, i.e., draw in and expel the K2EDTA solution from the system using the 1 mL syringe. Cut the tubing just behind the needle in order to collect blood drop by drop, without aspiration (Figure 1A).\nPlace the rat in an induction chamber and anesthetize it with isoflurane (1.4% in air; 1.2 mL/min). Switch to the stereotaxic frame and maintain anesthesia through a face mask. Put the heating pad under the animal, keeping a part of its tail in direct contact with the pad.\nMove gently the animal's back to the side so that the lateral tail vein is kept at the top.\nDip the tail in warm water (42 °C) for 2 min to dilate the lateral vein. Wipe the tail with 70% ethanol to make the vein more visible. Put warm light onto the tail using a regular incandescent bulb.\nInsert the 21G butterfly needle into the lateral tail vein with a depth of 5 mm and an angle of 20°. Collect blood in a 500 µL vacuum collection tube that contains 5 mg K2EDTA as an anticoagulant (Figure 1B,C).\nRemove the needle and stop the flow of the blood by putting pressure on the puncture site. Return the rat to its home cage.",
    "Gently invert the tube 10x to mix anticoagulant in the blood. Make holes of about 1.5 cm depth into the ice to accommodate the collection tubes. Gently and vertically put the sample on ice.\nCentrifuge the blood sample in a refrigerated centrifuge (4 °C) at 1300 x g for 10 min to separate plasma. Perform this procedure within 1 h at most.\nTake about 200 µL of plasma, avoiding the red and white blood cell layer. Put the withdrawn plasma into the 0.2 mL sterile microtube. If needed, store at 4 °C for up to 1 h after centrifugation.\nPut aside 5 µL of the sample for quality control. Store the sample at -80 °C until analysis.\n\tNOTE: Do not use the vacuum even if recommended by some researchers28 or milk the tail during the procedures described in step 8.5 to obtain more blood, as it decreases the sample quality for the next sncRNA quantification analyses (please see the Representative Results for details). Keep in mind that in rat, the maximum amount of blood that can be withdrawn at one time is <10% of its total blood volume (i.e., about 1.6-1.9 mL in a 250-300 g rat) and <15% of the total blood volume (about 2.64 mL) in 1 month29. In this protocol, a maximal 500 µL of blood collection on a single occasion for up to five times in a single animal is used30,31.\n9. CSF collection procedure\nNOTE. The technique can be easily performed by a single operator, and the procedure requires around 2-4 min. The materials used for the collection of CSF are low-cost, single-use vacuum butterfly needles and extraction tubes. In this protocol, a butterfly-winged infusion set connected to a sterile syringe is used in order to create the vacuum (Figure 2A).",
    "Prepare the 23G butterfly needle, cutting its plastic sleeve protection so that the end of the bare needle is exposed by 7 mm to prevent it from penetrating more than 7 mm deep into the cisterna magna during withdrawal (Figure 2B).\nConnect the butterfly needle equipped with polymer tubing to a 1 mL syringe.\nPlace the rat in an induction chamber and anesthetize it with isoflurane (1.4% in the air; 1.2 mL/min). Switch the isoflurane flow to the stereotaxic frame and maintain anesthesia delivered through a face mask. Remove the fur on the rat's rear head and neck with a razor.\nFix the head of the rat with ear bars. Lower the animal's head down approximately 45° vertically, moving down the nose bar of the stereotaxic frame (Figure 2C). Inspect the animal's rear head and find a slightly depressed surface with the aspect of a rhombus, between the occipital protuberance and the atlas spine.\nRub this surface with 70% ethanol in order to make it more visible and disinfect it.\nInsert the butterfly needle vertically into the center of the rhombus-shaped depressed surface into the cisterna magna for CSF collection till the movement is blocked by cutting to size plastic sleeve protection of the needle (Figure 2D). Draw back gently the 1 mL syringe piston in order to let the CSF slowly flow through the needle.\nCollect about 100 µL of the CSF into polymer tubing (Figure 2D). Avoid entering blood or any other visible contamination. Pinch the polymer tubing very close to the butterfly needle and cut the tubing at this point.\nDraw the clear (uncontaminated) sample into the syringe. Discard the contaminated sample, if visible contamination enters the collecting tubing.\nExpel the sample into the sterile 0.2 mL microtube and store on ice for up to 1 h.",
    "Disinfect the site of CSF withdrawal on the animal's head. Remove the rat from stereotaxic frame and put it back into its cage.\nPut aside 2 µL of the sample for quality control. Store the rest of the sample at -80 °C for further analysis.\n\t​NOTE: In rats, if multiple CSF withdrawals are performed repeatedly, the recommended volume to be withdrawn at each collection is 100 µL32. In this protocol, a maximum of 100 µL of CSF on a single occasion with 5x maximal withdrawal in 15 days in a single animal was done.\n10. Spectrophotometry analysis of the sample's quality\nNOTE: After proper collection of CSF and plasma samples, the samples are ready for spectrophotometer analyses and do not require any specific handling. Measure the hemoglobin absorbance by UV spectrophotometry at 414 nm to evaluate the hemolysis risk in samples. Use a cut-off absorbance value of 0.25 in rat samples. The choice of this limit may depend on subsequent qPCR analysis and its specific requirements for sncRNAs quantification.\nSwitch on the UV spectrophotometer. Select the method for the absorbance measurement at a single wavelength of 414 nm for PLASMA or CSF. Click Next.\nRinse the 1 mm cuvette with purified water. Put 5 µL of 70% ethanol onto the cuvette measuring spot. Dry with a paper towel and rub with lint-free tissue paper. Check if it is perfectly transparent.\nPut 1.5 µL of purified water into the 1 mm cuvette and close it. Insert the cuvette into the measuring chamber of the spectrophotometer and measure the blank sample absorbance by clicking on Blank button. Check that the absorbance value at 414 nm is 0.000.\nDry the cuvette with a paper towel and clean it with lint-free tissue paper. Check if it is perfectly transparent.",
    "Put 1.5 µL of the sample into the 1 mm cuvette and close it. Insert the cuvette into the measuring chamber of the spectrophotometer. Measure the sample, clicking on the Sample button. Check the absorbance of the sample at 414 nm and annotate it.\nProceed quantifying hemoglobin absorbance in all available samples. Measure the blank sample ahead of any plasma or CSF sample, by clicking alternatively on the Blank and Sample buttons.\nPreserve the samples with A414 nm < 0.25 at -80 °C and discard the samples if A414 nm > 0.25.\nRinse the 1 mm cuvette with purified water and 70% ethanol, sequentially. Dry the cuvette.\nClose the empty cuvette into the measuring chamber to prevent its dusting. Switch off the spectrophotometer.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}