{
  "id": 17009,
  "origin_website": "Jove",
  "title": "Extraction of Diatom DNA from Water Samples and Tissues",
  "procedures": [
    "This study was approved by the Ethics Committee of Hainan Medical University. The tissue samples used in this study are not considered to be studies involving human subjects. These specimens were obtained for the purpose of forensic pathological diagnosis, and the rest were used for the extraction of diatom DNA in this experiment. Researchers cannot readily identify individuals to obtain informed consent from relevant stakeholders.\nNOTE: To ensure the general applicability of the research method reported in this experiment, this experiment basically followed the operating instructions of the kit used, and only some steps were modified. The water samples used in this experiment were randomly taken from ponds near the laboratory (Supplementary Figure 1A). In this experiment, the lung tissue of the drowned body was confirmed as the research tissue to demonstrate the extraction protocol (Supplementary Figure 1B). In forensic practice, it is also sometimes necessary to use other organs and tissues of drowned bodies (such as liver, spleen, kidney, bone marrow, etc.) to extract diatoms DNA, which requires minor corresponding improvements to this experimental method, which will be explained in the corresponding section of the experiment. The lung tissue samples used in this experiment came from corpses that were clearly drowned in forensic cases. Morphological tests have been conducted to prove that the lung tissue contains diatoms (Supplementary Figure 2).\n1. Pretreatment of samples\nPretreatment of water samples\n\t\nTake 10 mL of water sample into the centrifuge tube and centrifuge at 13,400 x g for 5 min. Carefully discard 9.8 mL of supernatant with a pipette gun, and transfer about 200 µL of enriched diatom water sample remaining at the bottom into a 2 mL centrifuge tube.",
    "NOTE: Pre-experiment can be carried out first, and the initial amount can be increased if a 10 mL water sample is not enough for enrichment.\nPretreatment of tissue samples\n\t\nTake 0.5 g of the lung margin tissue from the drowned body, fully chop or grind the lung tissue until it becomes muddy. Preventing contamination of exogenous diatoms is the core of this step. Cut the tissue into pieces repeatedly using scissors.\n2. DNA extraction\nNOTE: All centrifugation steps are completed at room temperature. Using a desktop centrifuge with a centrifugal force of 14,500 x g; a water bath (or metal bath) preheated to 70 °C needs to be prepared before the experiment starts. All steps must strictly follow the principles of aseptic operation.\nAssembly of water samples and tissues\n\tNOTE: Water sample and tissue diatom DNA extraction method are the same.\n\t\nAdd glass beads to a 2 mL centrifuge tube containing the pretreated water sample. Invert 10x-15x to mix well. The added glass beads are composed of large and small glass beads mixed in a mass ratio of 1:1. The diameter of large glass beads is 1.5-2.0 mm and of the small glass beads is 0.4-0.6 mm.\nTake 0.5 g of finely chopped tissue, add glass beads to a 2 mL centrifuge tube containing the tissue as described above. Invert 10x-15x to mix.\nAdd 40 µL of proteinase K (20 mg/mL) to the tubes. Place at room temperature for 15 min, during this period, invert, and mix 10x every 3 min.\n\tNOTE: If the tissue is not fully digested, the amount of proteinase K can be appropriately increased until the solution becomes clear.\nAdd 200 µL of binding buffer to the centrifuge tubes, immediately vortex, and mix for 4 min (oscillation mixing frequency: 3000 rpm).",
    "NOTE: In this step, the shaking intensity and time should be strictly controlled to ensure sufficient mixing intensity and time.\nPut the centrifuge tubes in a 70 °C water bath for 10 min, and the solution becomes clear.\nAdd 100 µL of isopropanol to the centrifuge tubes, vortex and mix for 15 s, flocculent precipitation may appear at this time.\n\tNOTE: It is very important to mix well with appropriate strength in the above operation steps, but vigorous shaking should be avoided to prevent DNA shearing.\nPut the solution obtained in the previous step together with the flocculent precipitate into the adsorption column (the adsorption column is placed in the collection tube). The adsorption column length is 3.0 cm, the diameter is 1.0 cm, and the adsorption matrix is silicon matrix membrane.\nCentrifuge at 8,000 x g for 30 s, discard the waste liquid in the collection tube and put the adsorption column back into the collection tube.\nAdd 500 µL of inhibitor removal buffer to the adsorption column. Centrifuge at 13,400 x g for 30 s and discard the waste liquid in the collection tube.\nAdd 700 µL of washing buffer to the adsorption column. Centrifuge at 13,400 x g for 30 s and discard the waste liquid in the collection tube.\n\tNOTE: Add the specified amount of absolute ethanol to the wash buffer bottle before first use.\nAdd 500 µL of wash buffer to the adsorption column. Centrifuge at 13,400 x g for 30 s and discard the waste liquid in the collection tube.\nPut the adsorption column back into the empty collection tube. Centrifuge at 14,500 x g for 2 min, and remove the washing buffer as much as possible, to avoid the residual ethanol in the washing buffer from inhibiting downstream reactions.",
    "Take out the adsorption column and put it into a clean centrifuge tube. Add 100 µL of elution buffer to the middle part of the adsorption membrane.\nPlace the adsorption column at room temperature for 3-5 min, and centrifuge at 13,400 x g for 1 min.\nAdd the solution obtained in the previous step to the centrifugal adsorption column again. Place the centrifugal adsorption column at room temperature for 2 min, and centrifuge at 13,400 x g for 1 min.\n\tNOTE: The elution buffer should be preheated in a 70 °C water bath for about 10 min. The elution volume should not be less than 50 µL; otherwise, the DNA yield will be reduced.\nStore the extracted diatom DNA at 2-8 °C for future use. If the DNA solution is to be stored for a long time, store it at -20 °C.\n3. PCR test\nNOTE: Since the content of diatoms in forensic samples is often low, the tissue sample extracts of the drowned bodies may also contain varying degrees of tissue and organs (such as the lungs in this experiment) with their own DNA. Therefore, direct detection of total DNA in DNA extracts does not reflect the situation of diatom DNA extraction. In this experiment, diatom-specific primers were selected, and PCR products were used to evaluate the diatom DNA extraction in the extract. The products can be observed and analyzed by agarose gel electrophoresis and can also be analyzed by real-time fluorescent quantitative PCR-melting curve, which has higher sensitivity.\nAdd 2 µL of the extracted DNA from water samples and tissues as the template. Choose one of the following two methods for inspection.\nConventional PCR test\n\t\nUse primers22 that can specifically amplify diatom 18S rDNA fragments. For details, see Table 1.",
    "Establish the PCR reaction system and amplification conditions according to the characteristics of the primers. For details, see Table 2.\nRun the products of PCR amplification on 2% agarose gel. Observe and analyze the imaging with a gel imager.\nFluorescent quantitative PCR test\n\t\nUse the above primers that can specifically amplify diatom 18S rDNA fragments to prepare a real-time fluorescent quantitative PCR reaction system. For details, see Table 3.\nPerform PCR amplification and analyze the obtained amplification curve and Ct values. At the same time, set a program, melt the double-strands of the amplified products into single-strands gradually through fluorescent quantitative PCR-melting curve technology, and then analyze the obtained melting curves.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}