{
  "id": 13800,
  "origin_website": "Jove",
  "title": "Capturing Tissue Repair in Zebrafish Larvae with Time-lapse Brightfield Stereomicroscopy",
  "procedures": [
    "Zebrafish (nacre strain) were bred and raised according to established protocols. All efforts were made to minimize suffering, using 0.4 mM Tricaine for anesthesia and 1 mM Tricaine for euthanasia. Zebrafish embryos and larvae were handled in strict accordance with good animal practice as approved by the appropriate committee (MDI Biological Laboratory animal core IACUC number 13-20). This study was approved by the National Human Genome Research Institute Animal Care and Use Committee, MDIBL Institutional Assurance # A-3562-01 under protocol # 14-09.\nNote: The imaging procedure that captures fin regeneration in larval zebrafish is summarized in the following steps:\n1. Raising of Zebrafish to Larval Stages\nCollect the eggs and place approximately 50 eggs into a 100 x 25 mm Petri dish containing 0.03% Instant Ocean salt in deionized water supplemented with 0.00004% methylene blue. Incubate O/N in a 28.5 °C incubator.\nThe next morning remove the dead embryos with a glass pipette and rinse the eggs in a strainer with 0.03% Instant Ocean salt in deionized water (termed embryo medium).\n\tNote: Medium such as Ringers 18, Hanks 18, E2 19, E3 20, and Danieau 21 may be preferred.\nsup>Add fresh embryo medium to the dish. If using pigmented strains, optionally add 0.2 mM 1-phenyl-2-thiourea (PTU), as PTU will prevent melanogenesis and thus pigmentation of the larvae. Let the embryos further develop in the incubator until 2 days post fertilization or any other desired larval stage.\n2. Preparation of the Imaging Chamber\nMethod 1: Imaging chambers made from PVC or Teflon tubing (Figure 1)\n\tNote: This method is similar to Concha and Adams (1998) 22.",
    "Acquire drinking-water grade plastic or Teflon tubing from a hardware store with a 25 mm outer and a 20 mm inner diameter. Cut the tubing to make rings of approximately 10 mm thickness with an even surface on each side. Use > 200 grit sandpaper to smoothen the edges.\nClean the rings with warm water and 70% ethanol and let them air dry.\nWith a pipette tip, apply silicon grease to one half of a ring and attach the ring to a 75 mm x 25 mm glass cover slip. Alternatively, use a 3 ml syringe filled with silicon grease instead of a pipette tip.\n\t\tNote: Because it is difficult to insert the silicon grease into the 3 ml syringe, add the silicon grease to a 30 ml syringe first and use this for filling the 3 ml syringe.\nMethod 2: Preparation of a Petri dish as an imaging chamber.\n\t\nAcquire 35 or 60 mm diameter Petri dishes with a glass coverslip attached to the lid (Figure 2A). Alternatively, as shown in Figure 3 of Distel & Koester (2007) 23, drill an opening small enough to hold a coverslip into the lid of a small Petri dish and apply silicon grease to the outside with a 3 ml syringe. Using a clean pipette tip, carefully attach a round or square coverslip of desired thickness to the outside (Figure 2B).",
    "To ensure that the agarose being used for mounting stays firmly attached during the imaging procedure, attach a fine plastic mesh inside the ring. First, cut the mesh made of window screen obtained from a hardware store, into the size of the inner ring diameter using fine scissors with an angle. Then cut a small rectangle > twice the size of the larva into the middle of the mesh (Figure 1, 2).\nApply four small dots of non-toxic silicon grease to the interface between the cover slip and the chamber ring (Figure 1A).\nUse forceps to attach the mesh firmly to the bottom of the glass coverslip.\n3. Mounting and Imaging of the Pre-injured Larva (this Step is Optional)\nNote: This step is suitable for comparisons between the amputated and regenerated fin length, as the amputation plane after fin regeneration is not recognizable in zebrafish larvae.\nPrepare a 0.5-1.2% low-melt agarose solution in embryo medium for immobilization of the specimen.\nHeat the agarose in a microwave and transfer the liquid agarose into 1.5 ml tubes that are pre-warmed to 42 °C in a heating block.\nLet the hot agarose cool down to 42 °C, which can be maintained over several weeks at this temperature. Try to avoid pipetting the larvae into agarose above 42 °C, as this will be detrimental to the animals.\nAnesthetize several larvae using 10 ml of 0.4 mM Tricaine (pH 7) in embryo medium in a 60 mm diameter Petri dish. Prepare the Tricaine according to the Zebrafish Book Recipes 18.\n\t\nAlternatively, use 10 ml of a 1:1000 dilution of 99% 2-Phenoxyethanol in a 60 mm diameter Petri dish. Poke the larvae with a capped microloader pipette tip to assess their touch response before proceeding. Use only non-responsive larvae.",
    "Transfer one larva into the 42 °C agarose solution using a glass Pasteur pipet. Do not transfer excessive liquid into the agarose, otherwise the agarose will be too diluted and not solidify.\nDiscard the remaining liquid from the pipet and transfer the larva with one drop of agarose into a small Petri dish (35 or 60 mm diameter). Position the larva on its side for imaging of the tail fin.\nAllow the agarose to solidify. Assess the agarose with a plastic pipette tip; the tip will immerse into the agarose if it is too liquid. Once the agarose has solidified, a small indentation will be visible upon touching with a pipette tip. Following solidification, add Tricaine solution and proceed to the stereomicroscope that will be used later for time-lapse imaging.\n\tNote: This step may also be performed by placing the anesthetized larva on a Petri dish coated with 1.5% agarose in embryo medium.\nUse a stereomicroscope with time-lapse software. Select an appropriate objective and magnification, which will be used later for time-lapse imaging. Here, use a 3.5 x, 16 mm working distance objective lens on a stereomicroscope. As desired, utilize alternative microscopes and objective lenses but choose a proper magnification to account for potential xy-drift and growth of the fin during the imaging procedure.\nSelect the camera detection mode on the microscope.\nIn the software, select the 'live' mode to view the larva on the screen.\nOpen the 'Properties' window to automatically detect the brightness.\nManually adjust the contrast at the microscope trans-illumination base.\nMove the larva out of the field of view and select the Shading Correction feature to minimize background noise.\nPosition the larva back into the field of view and take a snapshot. Save the image.",
    "Remove the agarose from the larva by first scraping the agarose off the head. This way the larva can be slipped out of the agarose by gently pulling the head away from the remaining agarose with a capped microloader pipet tip or an insect pin.\nWith a glass Pasteur pipet transfer the larva into fresh Tricaine solution.\n4. Amputation Assay\nPrepare a 1.5% agarose solution using embryo medium and pour a thin layer into a Petri dish. Let the agarose solidify.\nUnder a stereomicroscope, place the larva sideward onto the solidified agarose and amputate the tail fin with a 23 G syringe needle with slight pressure (Figure 3A).\n5. Mounting the Larva for Time-lapse Imaging\nProceed as described in steps 3.1 – 3.5 (Figure 3B).\nTransfer a drop of 0.5-1.2% liquid agarose at 42 °C containing the larva into the imaging chamber ring (step 2.1), orient the larva and let the agarose solidify. Fill the ring with Tricaine solution. Alternatively, if the Petri dish chamber (step 2.2) is utilized, mount the larva onto the lid coverslip and fill the lid with Tricaine solution.\nTo allow proper wound healing or tissue regeneration to occur, carefully scrape off the agarose surrounding the distal tail fin using a capped microloader pipette tip or an insect pin. Try not to injure the fin repeatedly (Figure 3C).\nDecant the Tricaine solution containing the removed agarose and fill the chamber ring with fresh Tricaine solution.\nApply silicon grease to the top of the chamber ring and attach a 75 mm x 25 mm glass slide. Try to avoid air pockets in the chamber, as they will interfere with brightfield imaging and desiccate the larva over time.",
    "If using a Petri dish as an imaging chamber, apply silicon grease to the top rim of the bottom chamber and fill the bottom chamber with Tricaine solution. Carefully decant the Tricaine solution in the lid and turn the lid over to immerse the larva into the Tricaine solution of the bottom chamber at a slight angle to avoid air pockets. The chamber will be sealed due to the silicon grease.\n6. Time-lapse Imaging\nAssemble a heated incubation chamber as described in 23,24 (Figure 4).Place the incubation chamber around the microscope and turn on the heat. Adjust the temperature to 28 °C for about 10 - 20 min or until the temperature has stabilized.\nOpen the front of the heated incubation chamber and place the imaging chamber onto the microscope stand with the coverslip facing upward toward the objective.\nPosition the larval fin in a way that 2/3 of the field of view remains unoccupied. This ensures the capture of the growth and regeneration of the fin over the course of the imaging procedure without having to reposition the larva.\n\t\nAdjust the mounted larva to 28 °C for ~ 30 min prior to starting the time-lapse recording to avoid changes in brightfield intensity or potential shifts of the agarose. Alternatively, utilize pre-warmed buffer to start imaging after shorter adjustment time.\nTo set up the time-lapse recording, open the 6D Multidimensional Acquisition window in the Axiovision software and select the z-stack and time-lapse option.\nOptional) In the z-stack tab and Slice Mode, select the slice thickness and then select the Start/Stop mode.\nDefine the upper and lower position of the stack.",
    "In the time-lapse tab, select the interval and the duration of the movie and then start the movie by pressing the start button. We found that 30 min intervals are sufficient and this interval does not generate excessive data; however shorter intervals may be used.\nCheck the position and z-stack dimensions during the first hour if the larva was not pre-adjusted. If necessary, reposition the larva again after a day, as the larva may have shifted.\nSave the file at the end of the time-lapse recording and proceed with the post-processing and quantifications using available image analysis software, such as Imaris 25 or the open source software packages Image J 26 and Fiji 27.\n7. Data Analysis\nDetermining the fin length.\n\t\nOpen the time-lapse movie in the imaging software and save the files in the proprietary file format to enhance software performance.\nSelect the orthogonal view to display individual sections as projected stacks. For drift correction, under the Fiji menu, select Plugins, then Registration, and 'Correct 3D drift'. This will open a Fiji window and perform the drift corrections. Correct rotational drift in the Imaris Spots function. Alternatively, install the StackReg and TurboReg plugins in Image J and import to Fiji. Choose the desired transformation algorithm in the StackReg plugin.\nTo measure distances (e.g., wound diameter or fin length), select the 'Add New Measurement Points' option in the upper left tool bar.\n\t\t\nUnder 'Configure list of visible Statistics Values' in the bottom left menu, select the statistics values to be displayed.\nIn the 'Line Mode' under the settings tab select 'Pairs (AB, CD ...)'.\nIn 'Labels Properties' select 'Name' and 'Distance', to display the distance between points A and B next to the measurement line.",
    "Switch to the 'Edit' mode and hold down the shift button to select the first point at the end of the notochord. Then use the same configuration to select the second point at the distal fin margin.\nUnder the 'Statistics' tab, select the disk button (Export All) at the lower right to display and export the distance in the image.\nRepeat the measurements at selected times by moving the slider below the image to the right. Instead of creating new Measurement Points, the previous ones can be repositioned by first selecting the point with the left mouse button, then simultaneously pressing the shift and the left mouse button at the new position.\nAlternatively to the Measurement Points option, utilize the slice viewer to measure distances. In the slice view mode, scroll to a desired position and click on the first and second position with the left mouse button. The distance will be displayed. This option however does not allow for data export.\nDetermining fin length and area in ImageJ.\n\t\nOpen the time-lapse movie in ImageJ using a plugin that recognizes the .zvi file format. Alternatively, load in a QuickTime file or tiff sequence.\n\t\tNote: If using an uncompressed tiff file format, the image dimensions do not need to be specified.\nIf opening a different file format without the file information, select 'Set Scale' under the 'Analyze' menu to first define the image distance and unit. In the 'Set Scale menu', type in the 'Distance in pixels', below type in the 'Known distance' for the pixel value (this can be obtained by measuring the number of pixels on a scale bar that was added to the image, then click Measure to obtain the result), and the 'Unit of length' (typically 'µm'). Then click OK.",
    "For fin area measurements select the 'Freehand Selection' tool in the tool bar and outline the fin area by holding the left mouse button down while drawing along the outline of the fin. For fin length measurements, select the 'Straight' line tool and draw a line between the desired points to be measured.\nClick the 'Measure' option under 'Analyze' to display the area and length of the fin. Repeat this step as often as necessary for multiple time points of the movie.\nUsing statistics software the data can be graphically displayed."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}