{
  "id": 10634,
  "origin_website": "Jove",
  "title": "Visual Detection of Multiple Nucleic Acids in a Capillary Array",
  "procedures": [
    "NOTE: This protocol assumes that the stainless steel mold bearing the shape for the desired micro-channels and the loading adaptor have already been made (3D files are provided as Supplemental Files 1 and 2). This protocol also assumes that plant DNA isolation has already been carried out.\n1. Fabrication of the Capillary Array-based Ready-to-use Cassette\nClean the stainless-steel mold.\nWash the stainless-steel mold by detergent, ethanol, and deionized water to remove the potential contaminants. Dry the mold by nitrogen.\nClean the capillaries\nWear safety goggles, lab uniform, and chemical protective gloves.\nPlace capillaries into a beaker. Clean the capillaries with 30 mL acetone for 5 min to remove organic matter, and then wash the capillaries with deionized water.\n\t\tCaution: Handle acetone in a fume hood.\nPour 10 mL of H2O2 into the beaker and then add 30 mL of H2SO4 into the H2O2 with slow shaking to prevent overheating. Make sure that the solution (piranha solution) completely covers the capillaries for at least 30 min.\n\t\tCaution: Be careful while handling piranha solution (H2SO4/H2O2 = 3: 1, v/v). If the piranha solution is spilled, wash away the solution quickly with a large amount of water and wipe the surface with paper towels.\n\t\tNOTE: Thorough cleaning of capillaries is one of the key points to ensure the success of the LAMP reaction. It is necessary to shake the acid cylinder during the cleaning process to remove the bubbles in capillaries, and the clean time can also be extended when required.\nWash away the piranha solution with a large amount of water.Wash capillaries with ethanol and deionized water for 5 min each. Dry the capillaries in a drying oven.\nPour polydimethylsiloxane (PDMS)",
    "Weight out PDMS base and curing reagents with a ratio of 1:1 in a 50 mL tube. Typically, mix 5 g of elastomer base to 5 g of elastomer curing agent.\nStir the mixture thoroughly for about 5 min with a glass rod. Place the tube with PDMS in a vacuum bell jar for 30 min for de-gassing.\nPour the PDMS slowly into the cylinder of the stainless-steel mold.Allow the PDMS to cure for 3 h in a drying oven at 60 °C\n\t\tNOTE: Be careful to avoid air bubbles when pouring PDMS. After pouring PDMS, allow it stand for 5 min for natural removal of bubbles out of PDMS.\nRemove the mold from PDMS\nAfter curing the PDMS, remove the mold by pulling out the mold with cylinder. Remove PDMS from the cylinder by cutting the margin of mold with a scalpel.\nWash PDMS three times with ethanol and deionized water. Dry the PDMS support with nitrogen.\nTreat the lower surface of the PDMS support to be hydrophobic. Soak the PDMS support in a super-hydrophobic coat for 1 s. Dry it for 10 min at room temperature.\nInsert the capillary into the PDMS support\nInsert the cleaned 4 mm capillaries into the holes of the PDMS support and leave 0.5 mm of the capillaries outside the top surface of the PDMS support. Make sure the ends of capillaries are on the same level.\nTreat the outer surface of the capillaries and the top surface of the PDMS support to be hydrophobic.\nAdd 15 µL super-hydrophobic coat onto the top surface of the PDMS support. Note that the coating immediately spreads all over the top surface (including the top surface of the PDMS support and the outer surfaces of the exposed part of the capillaries) by capillary force.",
    "Air dry the super-hydrophobic modified capillary array.\nFix primer into capillary array\nPrepare primer solution. Weight out 0.65 g chitosan (molecular formula: (C6H11NO4)n) and dissolve it into 50 mL deionized water by adjusting the pH to 4.5-5.5 with acetic acid to achieve a chitosan concentration of 1.3%. Prepare primer components mix as per Table 1. See Supplementary Table 1 for primers\nAdd 1.6 µL of the mixture of one set of primers to fill one corresponding capillary of the capillary array according to a pre-designed order.\n\t\tNOTE: The remaining two blank capillaries were set as negative controls.\nAnchor the array in a transparent well of a standard flat bottom 96-well plate and dry the array at 60 °C for at least 2 h.\ntable:\n﻿0,1\nLAMP primer fixing mix components (initial concentration),Volume (μL)\nddH2O,17.0\nChitosan (1.3%),1.0\nFIP/BIP primer (20 μM),2.0/2.0\nLoopF/LoopB primer (20 μM),1.0/1.0\nF3/B3 primer (20 μM),0.5/0.5\nTotal volume,25.0\nTable 1: The components of LAMP primer fixing reagents. The components of LAMP primer fixing mix are listed in the left column of the table, and the volume of each component is listed in the right column.\nAssemble the cassette as follows. Put a loading adaptor onto the top of anchored array. Make sure the dish of the adaptor just covers the exposed parts of all ten capillaries (See Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/56597/56597fig1.jpg",
    "Figure 1: The cassette fabrication and assembly. (a) Stainless mold and the PDMS support. The mold consists of 3 parts: cylinder, dam board, and pillar plate. (b) The schematic of PDMS support fabrication and assembly of the capillary cassette. The whole process contains 5 steps: 1. PDMS pouring, 2. Mold removing, 3. Capillary inserting and surface coating, 4. primer fixing and 5. cassette anchoring. 1. Pour PDMS into cylinder of the mold; 2. Push out the dam board to remove the mold from PDMS support; 3. Coat the down surface of PDMS support and then insert the capillaries into the PDMS support, lastly coat the upper surface of PDMS support and exposed capillaries. The thick blue line indicates super-hydrophobic coat; 4. Load primer set into individual capillaries; 5. Anchor the capillary array in a single 96-well plate and install a sample loading adaptor onto it. The details have been described in protocol steps 1.1 - 1.9. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56597/56597fig1large.jpg]\n2. Performance of LAMP Reaction in Capillary Array\nPrepare the reaction mix\nPrepare the LAMP reaction mix as per Table 2.\nAdd reagents to mixture according to the chosen order, as in Table 2, and vortex the reaction mixture for 5 s after adding calcein. Gently invert the tube 20 times after Bst polymerase is added.\ntable:\n﻿0,1\nLAMP components (initial concentration),Volume (μL)\nddH2O,11.6\nMgSO4 (100 mM),2.0\ndNTPs (25 mM),1.4\nBetaine (5 M),4.0\nBuffer (10x),2.5\nCalcein (1.25 mM),0.5\nMnCl2 (25 mM),0.5\nBst polymerase (8 U/μL),1.5\nplant DNA (10 ng/μL),1.0\nTotal volume,25.0\nTable 2: The reaction system of the capillary array-LAMP. The components of the reaction system of capillary array LAMP components are listed in left column, and the volume of each component is listed in the right column.",
    "Load the reagents and seal the cassette\nPipette 20 µL LAMP reaction mixture with a standard 100 µL tip. Insert the tip into the inlet of the loading adaptor to lock it. Gently inject the reaction mixture into the dish of adaptor; the reaction mixture will quickly fill the dish and then load the capillaries automatically through capillary force.\nRemove the adaptor with the locked tip and seal the well by a PCR-compatible transparent sealing film.\n\t\tNOTE: Only the capillaries touching the reaction mixture in the hydrophilic dish could be filled. So make sure the top side of all the capillaries are of the same height (See Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/56597/56597fig2.jpg\nFigure 2: Diagram of sample-loading using the loading adaptor. The picture shows the loading process employing blue solution as an example. Insert the tip into the inlet and inject the sample into the adaptor slowly, and then remove the adaptor with locked tip. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56597/56597fig2large.jpg]\nIncubate the capillary array in an incubator at 63 °C for 1 h.\n3. Results Readout and Data Analysis\nAcquire images of the fluorescence emission.\nFix a UV filter on the top surface of a small hand-held UV LED flashlight to filter the visible light.\nExcite the dissociated calcein to emit fluorescence with the UV flashlight. Capture images from the top of the capillary array by either a digital camera or a smartphone.\nWhen taking an image, ensure that the camera is zoomed in on the area of the capillaries as much as possible to get high quality, clear images.\nAnalyze the results\nOpen the image by image analysis software and then select \"Image>Mold>Grayscale>Yes\" and \"Image>Mold>16bit>Yes\". Select \"File>Save as>format>TIFF\" to convert the image to 16-bit TIFF format.\nExtract the value of fluorescence intensity",
    "Open the microarray analysis software. Drag the 16-bit TIFF format image into the interface of the software and then select the wavelength of \"532 nm\" and a color of \"green\" to display the image.\nCreate a new block to locate the fluorescence signal from the capillaries. Select \"Tools>New blocks\" and input the number of columns and rows as \"1;1\" and \"2;5\" in the 'blocks' and 'features' interfaces separately.\nRight click and select \"Features\" model and then adjust the location and diameter to fit the fluorescence area of capillaries. Select \"Analyze\" to extract the value of fluorescence intensity.\nSelect \"File>save settings as\" to save the blocks documents and select \"File>save results as\" to save the fluorescence intensity results. Calculate the SNR to define whether LAMP is successfully performed in the capillaries.\n\t\t\tNOTE: Signals of the capillaries were obtained by recording the gray values of the spots and signal to noise ratios (SNRs) were defined as ratios of mean values of foreground signals of the targets to average mean values of foreground signals of the two negative controls. The cutoff to determine positive signals was set as SNR >2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}