{
  "id": 7979,
  "origin_website": "Bio",
  "title": "Differentiation of Bone Marrow Monocytes into Alveolar Macrophages-like Cells through Co-culture with Lung Epithelial Cells and Group 2 Innate Lymphoid Cells",
  "procedures": [
    "In order to get enough lung ECs and ILC2s to perform the co-culture settings, purify lung ECs and ILC2s from five mice. This will allow you to obtain, after each enrichment, 12–15 wells of 5 × 103 lung ECs and 2.5 × 103 ILC2s.  Caution: The entire procedure must be performed under a laminar flow hood to maintain the culture sterile. Bone marrow MOs isolation Preparing bone marrow cell suspensionEuthanize the mice and spray the skin with 75% ethanol.Remove the skin from the lower part of the body.Remove tissues from legs with scissors.Separate the femur from the femoral capsule. Be careful not to break the bones; the best is to dislocate the bones rather than cutting them. Place femur and tibia of one leg into a 50 mL tube filled with 20 mL of DMEM on ice.Take the bones and cut off both ends with a scalpel in a Petri dish.Using a 10 mL syringe with a 25 G needle, flush the bone marrow cells into a 50 mL tube with wash buffer (see Recipes).Pipette to obtain a homogeneous cell suspension and filter it through a 70 μm cell strainer into a new 50 mL tube.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant.Resuspend in 1 mL of RBC lysis buffer. Incubate for 5 min at room temperature (RT) and add 9 mL of wash buffer. Count cells using the hemocytometer. Note: You should expect approximately 40 × 106–60 × 106 cells with ~94%–98% viability for bone marrow cell collection from both femurs and tibias of an uninfected 8-week-old female C57BL/6 mouse.  Negative selectionCentrifuge at 250× g for 5 min at 4 °C and discard the supernatant.",
    "Resuspend in MACS buffer (108 cells/mL) (see Recipes) containing anti-Ly6G and B220 antibodies coupled with APC fluorochrome (see Flow cytometry antibodies 1.a.i) and incubate for 20 min at 4 °C in the dark.Note: The B220 and Ly6G antibodies target B cells and neutrophils, respectively, that will be further depleted, thereby facilitating FACS sorting. Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in 1 mL of ice-cold MACS buffer containing purified anti-CD16/32 antibody (diluted 1:500) to block Fc receptors.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant.Resuspend the cells in MACS buffer (107 cells/100 μL) with the adapted volume of MojoSort APC Nanobeads (10 μL/107 cells) (according to MojoSort Mouse anti-APC Nanobeads protocol[href=https://www.biolegend.com/protocols/mojosort-mouse-anti-apc-nanobeads-protocol/4756/]). Incubate on ice for 15 min.Wash the cells by adding MACS buffer up to 4 mL. Centrifuge the cells at 250× g for 5 min at 4 °C. Discard the supernatant.Resuspend in MACS buffer (5 × 107 cells/500 μL).Filter cells through 70 μm cell strainer.Proceed with magnetic negative selection: apply cell suspension onto the prepared LD column (according to Miltenyi LD column protocol). Collect flowthrough containing unlabeled cells after washes with 2 × 1 mL of MACS buffer. The unlabeled cells contain MOs.MO staining for FACS sortingCentrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend the pellet in FACS buffer (107 cells/mL) (see Recipes) containing antibodies (anti-CD19, CD3, Ly6G, B220, CD11b, Ly6C) for 20 min at 4 °C in the dark. Centrifuge the cells at 250× g for 5 min at 4 °C. Discard the supernatant. Resuspend the pellet in 5 mL of PBS and repeat centrifugation.Discard supernatant and perform viability staining by adding SYTOX Blue to FACS buffer (1 μL/10 mL/5 × 107 cells).",
    "Incubate for 5 min at RT in the dark.Perform FACS sorting using FACS Aria IIIu. Bone marrow MOs are gated as Ly6G-MHCII-CD3-CD11b+Ly6C+ living cells (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4818/bioprotoc-13-18-4818-g001.jpgFigure 1. Gating strategy for FACS sorting of bone marrow monocytes (MOs), described as SSC-AlowLy6C+CD11b+ living cells after exclusion of neutrophils (Ly6G+CD11b+), B cells (MHCII+CD11b-), and T cells (CD3+CD11b-) after cell enrichment through MACS-negative selection  Count the cells using the hemocytometer.Centrifuge at 250× g for 5 min at 4 °C. Discard supernatant and resuspend the cells at 105 cells/100 μL of complete culture medium (see Recipes).Lung ECs isolation Preparing lung cell suspensionEuthanize the mice and spray the skin with 75% ethanol.Catheterize the trachea and add 1 mL of PBS with 10 U/mL of Dispase.Perfuse through the right ventricle with 5 mL of ice-cold PBS. Dissociate lobes of lung and place them into a 24-well plate with 2 mL of DMEM medium with 10 U/mL of Dispase for 10 min at RT.Transfer the lung lobes from one mouse into an individual GentleMACS tube containing the lung digestion solution (see Recipes) and process with a gentleMACS dissociator (lung program 01); finally, incubate for 30 min at 37 °C. After digestion, run the lung program 02 with the gentleMACS dissociator.Filter the cell suspension through a 70 μm cell strainer into a 50 mL tube and top up to 25 mL with wash buffer.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend the pellet in 1 mL of RBC lysis buffer. Incubate for 5 min at RT, add 9 mL of wash buffer, and pool all the samples into one 50 mL tube. Count cells using the hemocytometer. Note: You should expect approximately 6 × 106–12 × 106 cells per lung of a naïve 8-week-old female C57BL/6 mouse.",
    "Negative selectionCentrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in MACS buffer (107 cells/100 μL) with the adapted volume of MojoSort mouse CD45 nanobeads (10 μL/107 cells) according to the manufacturer protocol. Incubate for 15 min at 4 °C.Wash the cells by adding MACS buffer up to 4 mL. Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant.Resuspend in MACS buffer (5 × 107 cells/500 μL).Filter cells through 70 μm cell strainer.Proceed with magnetic negative selection: apply the cell suspension onto the prepared LD column (follow the Miltenyi LD column protocol). Collect flowthrough containing unlabeled cells after washes with 2 × 1 mL of MACS buffer.Note: The unlabeled cells contain the non-immune cells. ECs staining for FACS sortingCentrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in FACS buffer (107 cells/mL) with antibodies (anti-CD45, CD31, EpCAM) for 20 min at 4 °C in the dark.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend the pellet in 5 mL of PBS and repeat centrifugation.Discard supernatant and perform viability staining by adding SYTOX Blue in FACS buffer (1 μL/1 mL/5 × 107 cells). Incubate for 5 min at RT in the dark.Proceed to FACS sorting. Lung ECs are gated as CD45-CD31-Epcam+ living cells (Figure 2). Count the cells using the hemocytometer.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4818/bioprotoc-13-18-4818-g002.jpgFigure 2. Gating strategy for FACS sorting of lung epithelial cells (ECs), described as CD45-CD31-EpCAM+ living cells after cell enrichment though MACS-negative selection (CD45).  Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend the cells at 5 × 103 cells/50 μL in complete culture medium (see Recipes).",
    "Culture of MOs and lung ECs Note: The presence of lung ECs with bone marrow MOs will help to obtain MOs in the process of differentiation into AMs. Add 50 μL (5 × 104 cells) of bone marrow MOs and 50 μL (5 × 103 cells) of lung ECs into a well of a 96-well round-bottom plate.Add 100 μL of complete culture medium containing 20 ng/mL recombinant murine GM-CSF (for a final concentration of 10 ng/mL) into each well and gently resuspend. Caution: Provide control wells without GM-CSF as well as conditions without ECs.Incubate at 37 °C with 5% CO2 for three days.Lung ILC2s isolation Preparing lung cell suspensionEuthanize the mice and spray the skin with 75% ethanol.Perfuse through the right ventricle with 5 mL of ice-cold PBS. Transfer the lung lobes into a GentleMACS tube containing lung digestion solution (see Recipes) and process with a gentleMACS dissociator (lung program 01); finally, incubate for 30 min at 37 °C. After digestion, run the lung program 02 with the gentleMACS dissociator. Filter the cell suspension through a 70 μm cell strainer into a 50 mL Falcon tube and top up to 25 mL with wash buffer.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend the pellet in 1 mL of RBC lysis buffer. Incubate for 5 min at RT and add 9 mL of wash buffer and pool five samples at a time into one 50 mL Falcon tube. Count cells using the hemocytometer. Note: You should expect approximately 6 × 106–10 × 106 total cells per lung of a naïve 8-week-old female C57BL/6 mouse.  Negative selectionCentrifuge at 250× g for 5 min at 4 °C and discard the supernatant.",
    "Resuspend the pellet at 108 cells/mL of MACS buffer with lineage marker antibodies (anti-B220, CD11c, CD3, CD4, CD5, CD8α, F4/80, FcϵR1, CD49b, and Siglec-F) conjugated to APC fluorochrome, for 20 min at 4 °C in the dark.Note: ILC2s represent approximately 1% of the lung leukocytes population; the lineage will target other immune cells such as T cells, B cells, NK cells, and macrophages, and then will improve the FACS sorting. Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend the pellet in 5 mL of MACS buffer and repeat centrifugation.Discard the supernatant and resuspend in MACS buffer (107 cells/100 μL) with the adapted volume of MojoSort APC nanobeads (10 μL/107 cells) (follow manufacturer’s protocol). Incubate on ice for 15 min.Wash the cells by adding MACS buffer up to 4 mL. Centrifuge the cells at 250× g for 5 min at 4 °C. Discard the supernatant.Resuspend in MACS buffer (5 × 107 cells/500 μL).Filter cells through a 70 μm cell strainer.Proceed with magnetic negative selection: apply cell suspension onto the prepared LD column (follow the Miltenyi LD columns protocol). Collect flowthrough containing unlabeled cells after washes with 2 × 1 mL of MACS buffer.Caution: The unlabeled cells contain lung ILCs and non-immune cells.ILC2s staining for FACS sortingCentrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in FACS buffer (107 cells/mL) with antibodies (anti-B220, CD11c, CD3, CD4, CD5, CD8α, F4/80, FcϵR1, Ly6G, Siglec-F, CD45, CD90.2, ST2, and CD25) for 20 min at 4 °C in the dark. Centrifuge the cells at 250× g for 5 min at 4 °C. Discard the supernatant. Resuspend the pellet in 5 mL of PBS and repeat centrifugation.",
    "Discard supernatant and perform viability staining by adding SYTOX Blue to FACS buffer (1 μL/1 mL/5 × 107 cells). Incubate for 5 min at RT in the dark.Proceed to FACS sorting using FACS Aria IIIu following manufacturer’s protocol. Lung ILC2s are gated as CD45+Lin-CD90.2+ST2+CD25+ living cells (Figure 3). Count cells using the hemocytometer.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4818/bioprotoc-13-18-4818-g003.jpgFigure 3. Gating strategy for FACS sorting of lung group 2 lung innate lymphoid cells (ILC2s) after cell enrichment through MACS-negative selection against lineage markers (B220, CD11c, CD3, CD4, CD49b, CD5, CD8α, F4/80, FcϵR1, Gr1 and Siglec-F). ILC2s were identified as Lin-CD45+ST2+CD90.2+CD25+.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend cells at 2.5 × 103 cells/200 μL of ILC2 culture medium (see Recipes). Critical:  IL-2 is mandatory to maintain ILC2s in ex vivo culture.Co-culture of ILC2s with MOs and ECs This step allows to investigate the role of interactions between ILC2s and MOs differentiating into AMs and to study the potential importance of a targeted ligand–receptor interaction.Centrifuge the 96-well plate with the bone marrow MOs and lung ECs co-culture at 250× g for 5 min at 4 °C. Gently aspirate the supernatant without touching the pellet.Add 200 μL of ILC2s (2.5 × 103 cells) in the ILC2 culture medium. Gently mix the cells together. Incubate at 37 °C in 5% CO2 environment for three days.Caution: Provide control conditions without ILC2s.Harvest and staining for FACS analysisNote: A substantial fraction of bone marrow MOs differentiate into AM-like cells, as observed by the expression of CD11c. MO-derived AMs acquire the M2 marker Arg1 when co-cultured with ILC2s from a naïve mouse. After three days, centrifuge the plate at 250× g for 5 min at 4 °C.",
    "Perform viability staining by resuspending cell pellets in 100 μL/well in PBS with 1:1,500 Zombie AquaTM for 15 min at RT in the dark. Critical:  Use fixable viability kit if the assessment requires intracytoplasmic staining such as Arg1.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant.Resuspend cell pellets in 50 μL/well in FACS buffer with the following antibodies (anti-CD45, CD11c, Siglec-F, MHC-II, CD90, ST2) or any antibodies of targets of your interest, for 20 min at 4 °C in the dark.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in 100 μL/well of PFA 2% for at least 15 min at 4 °C in the dark (it may be extended overnight).Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in 100 μL/well of permeabilization buffer (see Recipes) and incubate at 37 °C for 15 min.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in 100 μL/well of intracellular staining buffer (see Recipes) with antibody against intracellular antigens. Incubate for 30 min at RT in the dark.Centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in 200 μL/well of FACS buffer and repeat the centrifugation.Discard the supernatant, resuspend in 200 μL/well of FACS buffer, and proceed to FACS analysis using a BD LSR Fortessa X-20 (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4818/bioprotoc-13-18-4818-g004.jpgFigure 4. Lung ILC2s regulate differentiation and prone a M2 phenotype of MOAMs in vitro. (A) Representative flow cytometry plots of bone marrow monocytes (MOs), bronchoalveolar lavage alveolar macrophage (AMs) and bone marrow MOs differentiated to MOAMs from co-culture with lung epithelial cells (ECs) and lung group 2 lung innate lymphoid cells (ILC2s). (B) Heatmap of differentially expressed genes (False Discovery Rate, FRD) < 0.",
    "05; change in expression of over two-fold) in MO-derived macrophages isolated from co-cultures of MOs and ECs with or without ILC2s. Three genes with higher expression in the condition with ILC2s are highlighted.Harvest for RNA sequencingNote: For a deeper analysis, transcriptomic analysis can be performed on the ex vivo differentiated MO-derived AMs. After step E1, centrifuge at 250× g for 5 min at 4 °C and discard the supernatant. Resuspend in 100 μL of FACS buffer with antibodies (anti-Ly6G, Ly6C, CD11c, CD45, CD90.2, ST2, and CD25) for 20 min at 4 °C in the dark. Centrifuge the cells at 250× g for 5 min at 4 °C. Discard the supernatant. Resuspend the pellet in 5 mL of PBS and repeat centrifugation.Discard supernatant and perform viability staining by adding SYTOX Blue in FACS buffer (1 μL/1 mL/5 × 107 cells/). Incubate for 5 min at RT in the dark.Proceed to FACS sorting using FACS Aria IIIu by following manufacturer’s protocol. MO-derived AMs are defined as Ly6G-, Ly6C-, autofluorescent, and CD11c+ living cells, and directly sorted in 1 mL of TRIzol before being snap frozen until future analysis (Figure 4)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}