{
  "id": 2891,
  "origin_website": "Cell",
  "title": "Click-chemistry-based protocol to quantitatively assess fatty acid uptake by Mycobacterium tuberculosis in axenic culture and inside mouse macrophages",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAssay of fatty acid uptake by Mtb in axenic cultures\nTiming: 10–14 days\nThis protocol was adapted from that previously reported for the uptake of radiolabeled FAs by Mtb grown in axenic culture.3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4] The variation presented below uses flow cytometry to assess quantitatively the uptake of alkyne-FAs at the single-bacterial level in vitro.\nGrow GFP-expressing Mtb strains for 5–7 days to an OD600 of 0.8–1 in standing culture flask at 37°C in 7H9-OADC-Tylox medium containing selection antibiotics.\nNote: gfp was expressed by our Mtb strains under the control of the pBlaF∗ promoter.1[href=https://www.wicell.org#bib1]\nNote: Antibiotics were used at the final concentrations of 40 μg/mL (kanamycin), 25 μg/mL (streptomycin), or 50 μg/mL (zeocin).\nSubculture Mtb for FA uptake assay.\nCentrifuge (3,000 × g for 5 min) 1 mL of bacterial culture.\nDiscard supernatant and wash the bacterial pellet once with 1 mL of 7H9 broth.\nResuspend the washed bacteria in 5 mL of FA-free 7H9-AD medium.\nGrow for 5–7 days at 37°C in standing culture flask until bacteria reach an OD600 of 0.6–0.8.\nCritical: When comparing FA uptake by different bacterial strains, making sure that bacterial cultures have similar OD600 is crucial since the expression of Mtb lipid transporters depends on the growth phase.13[href=https://www.wicell.org#bib13],14[href=https://www.wicell.org#bib14]\nAlkyne FA uptake:\nTo make a heat-killed negative control, incubate an aliquot of the culture for 15 min at 80°C.\nLet it cool down to 22°C–25°C before incubation with alkyne FAs.\nNote: An alternative is to kill bacteria by treatment with 4% PFA for 30 min at 22°C–25°C, before centrifugation (9,000 × g for 5 min) and resuspension in alkyne-FA-supplemented 7H9-AD.\nDilute 8.34 μL of pre-conjugated alkyne FA-BSA in 992 μL of 7H9-AD to have a final FA concentration of 5 μM.",
    "Note: For competition assays, add pre-conjugated natural FA-BSA at a final concentration of 5–50 μM.\nCentrifuge (3,000 × g) bacteria for 5 min at 22°C–25°C.\nResuspend bacteria to OD600 of 0.1 in FA-supplemented medium.\nIncubate for 1 h at 37°C.\nCentrifuge (3,000 × g) bacteria for 5 min at 4°C.\nWash bacterial pellets once in ice-cold 7H9-AD medium.\nWash bacterial pellets twice in ice-cold Wash Buffer.\nNote: These washing steps were optimized to minimize the amount of FAs that are bound to the mycobacterial envelope without being internalized, using heat-killed Mtb as a metabolically inert control.\nFix bacteria by incubation in 4% PFA for 1 h at 22°C–25°C.\nProceed to click chemistry staining and flow cytometry analysis.\nAssay of fatty acid uptake by Mtb inside BMDMs\nTiming: 1–3 days\nThis modified version of the protocol published by Nazarova and colleagues9[href=https://www.wicell.org#bib9] allows to test the capacity of intracellular Mtb to import alkyne-FAs by flow cytometry (in 100 mm cell culture dish, with 10 mL of culture medium) or confocal microscopy (on glass coverslip in 24-well plate, with 500 μL of culture medium).\nGrow Mtb in 7H9-OADC-Tylox medium until late log phase (OD600 = 0.6–0.8).\nDifferentiate bone marrow cells into a monolayer of BMDMs as described above, and incubate for 24 h in antibiotic-free BMDM culture medium before Mtb infection.\nPrepare Mtb for macrophage infection:\nCentrifuge (3,000 × g) 30 mL of a bacterial culture for 5 min.\nWash the pellet twice in 30 mL of 1× DPBS, and resuspend in 5 mL of sterile 1× DPBS.\nDissociate bacteria in M-tubes with the “RNA01.01” program of the gentleMACS™ dissociator as previously described.15[href=https://www.wicell.org#bib15]\nPass bacteria through a 25G (20 times) and a 27G needle (one time) with a syringe and let it stand for 10 min to exclude remaining clumps.",
    "Transfer the suspension into a new tube, and measure the OD600 of the suspension.\nDilute Mtb at OD600 = 0.01–0.02 in antibiotic-free BMDM culture medium to infect macrophages.\nNote: Since BMDMs are not replated after differentiation in this protocol, we use an approximative multiplicity of infection (MOI) of 2 bacilli per cell, assuming that an OD600 of 1 corresponds to 1.5 × 108 bacterial/mL and that the BMDM monolayer corresponds to 7 × 106 cells in 100 mm dish and 2 × 105 cells/well in 24-well plate.\nReplace the culture medium with 5 mL (100 mm dish) or 200 μL (24-well plate) of the diluted Mtb.\nIncubate for 3 h at 37°C and 5% CO2.\nWash infected cells 3 times with warm DMEM to remove extracellular bacteria, and add fresh BMDM culture medium.\nNote: DMEM should never be pipetted directly onto adherent cells, specifically at this washing step, as it could detach them.\nIncubate cells for 1 or 3 days at 37°C and 5% CO2.\nAlkyne FA pulse-chase:\nDilute pre-conjugated alkyne FA-BSA in BMDM culture medium at a final FA concentration of 5 μM, with the same dilution factor as above (step 3b).\nReplace cell supernatant with equivalent volume of alkyne FA-supplemented BMDM culture medium.\nNote: As a negative control for the click staining, you can prepare infected BMDMs that are incubated with BMDM culture medium without alkyne FA.\nIncubate for 1 h at 37°C and 5% CO2.\nReplace cell supernatant with an equivalent volume of DMEM GlutaMAX supplemented with 10% FBS.\nIncubate for 1 h at 37°C and 5% CO2.\nCritical: For confocal microscopy analysis, proceed to click chemistry staining as described in the next section. For flow cytometry analysis of FA uptake by Mtb, intracellular bacteria have to be isolated from infected BMDMs prior to staining.",
    "Isolate intracellular bacteria from infected cells in 100 mm cell culture dish:\nWash infected BMDMs twice with 5 mL of ice-cold Homogenization Buffer.\nAdd 5 mL of ice-cold Homogenization Buffer and incubate for 10–15 min at 4°C.\nScrape BMDMs with a cell scraper and transfer cells into a 15 mL conical tube.\nCentrifuge (500 × g) cells for 10 min at 4°C.\nResuspend the pellet in 1 mL of Homogenization Buffer.\nPass the cells at least 20–25 times through a 25G needle, plus once through a 27G needle using a 1 mL syringe. Keep the cells at 4°C throughout the isolation protocol.\nNote: Cell lysis can be verified by cell observation in a counting slide with a microscope.\nAdd 4 mL of Homogenization Buffer.\nCentrifuge (200 × g) for 10 min at 4°C.\nCarefully transfer the supernatant containing most cytoplasmic material from lysed cells to a new tube.\nAdd to the supernatant 50 μL of 10% Tween 80 (final concentration of 0.1%).\nPipet up and down vigorously until foam formation.\nCritical: Thorough mixing at this stage and subsequent washing are crucial to dissolve cellular FA-containing membranes associated with bacteria.\nIncubate for 15 min at 4°C.\nCentrifuge (1,500 × g) for 15 min at 4°C.\nResuspend well the bacterial pellet in 1 mL of ice-cold 1× DPBS with 0.05% Tyloxapol.\nCentrifuge (3,000 × g) for 5 min at 4°C.\nWash with 1 mL of cold 1× DPBS-0.05% Tyloxapol.\nCentrifuge (3,000 × g) for 5 min at 4°C.\nWash with 1 mL of cold Wash Buffer.\nCentrifuge (3,000 × g) for 5 min at 4°C.\nResuspend bacteria in 200 μL of 4% PFA.\nIncubate 16–20 h at 4°C before staining for flow cytometry analysis.\nClick chemistry staining for analysis by confocal microscopy\nTiming: 2 days",
    "This staining method allows quantification of alkyne-FAs in Mtb of infected BMDMs by confocal microscopy, using the Click-iTTM Plus Alexa Fluor™ 647 Picolyl Azide Toolkit.\nAfter the FA uptake assay described above, wash twice with ice-cold 1× DPBS the infected BMDMs cultured on coverslips in 24-well plates.\nAdd 300 μL of 4% PFA and incubate for 1 h at 22°C–25°C.\nWash the cells twice with 500 μL of 1× DPBS.\nAdd 300 μL of Permeabilization Buffer.\nIncubate for 10 min at 22°C–25°C.\nWash the cells twice with 500 μL of 3% BSA in 1× DPBS.\nAdd 300 μL of Click-iTTM Plus reaction cocktail.\nNote: The copper:protectant ratio (see materials and equipment[href=https://www.wicell.org#materials-and-equipment] section) in the cocktail was optimized for this staining to minimize the deleterious effects of copper on GFP fluorescence while conserving a maximal reaction efficiency (as indicated by the clicked FA signal in bacteria incubated with alkyne FAs), as per the manufacturer’s indications (https://www.thermofisher.com/order/catalog/product/C10643[href=https://www.thermofisher.com/order/catalog/product/C10643]).\nNote: Although we optimized this click reaction to be compatible with GFP-expressing Mtb, we noticed that copper has much less deleterious effects on the fluorescence of RFP-expressing Mtb. Therefore, the amount of copper may be adjusted when using strains expressing other fluorescent proteins.\nIncubate for 30 min at 22°C–25°C.\nWash the cells twice with 500 μL of 3% BSA in 1× DPBS.\nAdd 300 μL of DAPI (1 μg/mL) in 1× DPBS.\nIncubate for 5 min at 22°C–25°C.\nWash the cells 3 times with 500 μL of 1× DPBS, and add the same volume of 1× DPBS.\nUsing tweezers and a crooked, beveled needle, get coverslips from the wells, dab the coverslip edge on a Kim wipe and flip them over onto a drop of Prolong Diamond Antifade Mountant on a glass slide.",
    "Let it cure for 24 h at 22°C–25°C before sealing with nail polish, and storage at 4°C.\nImage cells using a 63×/1.4 oil objective on a LSM 700 inverted confocal microscope and Zen Imaging software, or equivalent.\nFor each acquisition, set up the z-scan spanning so that most intracellular bacteria are fully imaged.\nFor quantification of FA uptake, perform all acquisitions using the same settings.\nDefine Mtb and BMDM regions of interest (ROIs) by the GFP and clicked FA signal, respectively, using the HK-Means plugin16[href=https://www.wicell.org#bib16] of the Icy opensource platform12[href=https://www.wicell.org#bib12] (see Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2395-Fig1.jpg\nFigure 1. Defining Mtb and BMDM ROIs using HK-Means\nDistribution of alkyne-arachidonic acid (AA) in Mtb-infected BMDMs at 24 h post infection, as shown on a confocal image (green = GFP-expressing Mtb, red = clicked FA, blue = DAPI). For quantification of the FA signal, ROIs (shown in azure blue and yellow ochre for Mtb and BMDMs, respectively) were defined using the HK-Means plugin. Bar scale = 10 μm.\nMeasure the mean fluorescence intensity in defined ROIs.\nClick chemistry staining for analysis by flow cytometry\nTiming: 2–3 h\nThis protocol uses the Click-iTTM Plus Alexa Fluor™ 647 Picolyl Azide Toolkit to assess and quantify alkyne-FA import by Mtb from axenic culture or infected macrophages.\nCentrifuge (9,000 × g) fixed Mtb (from axenic culture or isolated from infected BMDMs) for 5 min at 22°C–25°C.\nNote: This speed is necessary to pellet fixed bacteria in a buffer devoid of detergent (otherwise, bacteria tend to stick to the walls of plastic tubes).\nAdd 700 μL of Permeabilization Buffer.\nIncubate for 15 min at 22°C–25°C.\nAdd 300 μL of 10% BSA.\nCentrifuge (5,000 × g) for 5 min at 22°C–25°C.\nResuspend bacteria in 300 μL of Click-iTTM Plus reaction cocktail.",
    "Note: See notes in the previous section related to the reaction cocktail.\nIncubate for 30 min at 22°C–25°C.\nAdd 700 μL of cold Wash Buffer.\nCentrifuge (5,000 × g) for 5 min at 4°C.\nWash bacteria twice with 1 mL of cold Wash Buffer.\nCentrifuge (5,000 × g) for 5 min at 4°C.\nResuspend in 7H9 plus 0.85 g/L NaCl and 0.05% Tyloxapol.\nRead samples on a flow cytometer with regular homogenization by pipetting and passage through a 35-μm cell strainer to avoid large clump formation.\nSelect events as indicated in the gating strategy (Figure 2[href=https://www.wicell.org#fig2]). Exclude small debris by selecting GFP-positive events in the FITC channel.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2395-Fig2.jpg\nFigure 2. Gating strategy for the flow cytometry analysis of FA uptake by Mtb\nA GFP-expressing strain of Mtb was isolated from infected BMDMs at 24 h post infection after a pulse-chase exposure to alkyne palmitic (PA), oleic (OA), linoleic (LA), arachidonic (AA) or docosahexaenoic acid (DHA). Imported alkyne FAs were stained by click chemistry of isolated Mtb and analyzed by flow cytometry based on GFP and clicked FA fluorescence. Data were extracted from Laval et al.1[href=https://www.wicell.org#bib1] with permission (https://creativecommons.org/licenses/by/4.0/[href=https://creativecommons.org/licenses/by/4.0/]).\nAnalyze the AF647 fluorescence signal in the APC channel, using GFP-expressing bacteria isolated from infected macrophages not treated with alkyne-FAs as negative control.\nNote: There is not requirement for compensation when using GFP and AF647, since they have negligible spectrum overlap.\nNote: Care should be taken to assess FA uptake by host macrophages during infection, as it determines FA bioavailability for intracellular Mtb.1[href=https://www.wicell.org#bib1] FA uptake by infected macrophages can easily be assessed in parallel by confocal microscopy as described above, or by staining unlysed cells (following the Click-ITTM toolkit manufacturer’s instruction (https://www.thermofisher.com/order/catalog/product/C10643[href=https://www.thermofisher.com/order/catalog/product/C10643]) and flow cytometry analysis.",
    "Note: For assays in axenic cultures, we do not completely eliminate bacterial clumps that may form throughout the protocol, but simply use the 35-μm cell strainer to avoid large clump formation. However, when a very heterogenous population is observed in flow cytometry analyses (indicative of large clumps), alkyne-FA signals are normalized by FSC values for each event using the “Derive Parameters” function in FlowJo."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Immunology",
    "Metabolism",
    "Microscopy",
    "Flow Cytometry",
    "Cell Culture",
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}