{
  "id": 7153,
  "origin_website": "Bio",
  "title": "A Spectrofluorophotometrical Method Based on Fura-2-AM Probe to Determine Cytosolic Ca<sup>2+</sup> Level in <em>Pseudomonas syringae</em> Complex Bacterial Cells",
  "procedures": [
    "Bacterial growth (Day 1: ~15 min followed by 16 h incubation)Note: Do not use any antibiotics in the growth medium, because it can interfere with the experiments. Do not use more than 10% of maximum tube volume to ensure growth of the bacterium. Conduct all steps under sterile conditions. Prepare a fresh culture of Psav DAPP-PG 722 or Pto DC3000 strain by inoculating bacterial cells, scraped with a inoculation loop from a 15% glycerol stock at -80 °C, on Petri dish containing LB agar medium and incubate for 16 h at 27 °C.Bacterial growth (Day 2: ~15 min followed by 16 h incubation)Note: Do not use any antibiotics in the growth medium, because it can interfere with the experiments. Do not use more than 10% of maximum tube volume to ensure growth of the bacterium. Conduct all steps under sterile conditions. Inoculate a loop of bacterial cells into a 50 ml tube containing 5 ml LB broth. Incubate the tubes in the shaking incubator for 16 h at 27 °C and 200 rpm (until the OD660 = 0.8).Cell preparation with Fura 2-AM (Day 3: ~3.5 h)Note: Do not centrifuge the bacterial suspension at >16,000 × g to avoid any cell damage. Wrap the tube containing the Fura 2-AM with aluminum foil or work in the dark to avoid photodegradation of the probe. Collect the bacterial cells from the 5 ml cell culture by centrifugation (15,585 × g, 3 min) at room temperature (RT).Discard the supernatant and resuspend the cells in 5 ml of sterile 0.12 mM Tris HCl (pH 8.0).Adjust the bacterial suspension to 1 × 108 CFU ml-1 by bringing the OD660 at 0.06.Collect again 10 ml of this bacterial suspension by centrifugation (15,585 × g, 3 min) at RT.",
    "Discard the supernatant and resuspend the cell pellet in 5 ml 0.12 mM Tris HCl (pH 8.0) (= 5 × 109 CFU), add 0.5 ml of a 2 mM EGTA solution (pH 8.0), and incubate at 25 °C for 5 min in an air incubator to render the bacteria receptive to the Ca2+ probe.Add 20 µl of 2 mM CaCl2 solution to quench the EGTA.Pellet the cells by centrifuging them at 15,585 × g for 3 min at RT.Discard the supernatant and resuspend the cells in 5 ml HBSS supplemented with 2 µl of 2 mM Fura 2-AM stock solution. Note, add the Fura 2-AM freshly to the HBSS prior to usage from a fresh stock solution.Incubate this cell suspension in HBSS + Fura2-AM in the incubator without shaking at 25 °C for 2 h.Pellet the cells by centrifuging them at 15,585 × g for 3 min at RT.Add 5 ml HBSS (without the dye), resuspend the cells and incubate for 1 min at RT.Measurement of the Ca2+ levels (Day 3: ~1.5 h)Note: Set the LS-50B luminescence spectrometer with FL WinLab Software using the User’s Guide. Pour 1 ml of the cell suspension in the NIR Quartz SUPRASIL 300 Rectangular Macro Cell containing the BRAND magnetic stirring bar which reduces the swirling and guarantees the correct reading of the samples.Place the Rectangular Macro Cell in the LS-50B luminescence spectrometer, wait until the Traffic Light bottom becomes green to initialize the spectrometer (Figure 3A) and click on it to start the measurement. Similar results could be obtained with analogous spectrometer.Wait about 50 s (a time useful for the signal stabilization) and add 30-240 µl of a 50 mM CaCl2 solution to reach a final concentration ranging from 0.5 to 4 mM (Figure 4).",
    "Add 1 ml of 1% Triton X-100 to disrupt the cells, record the time and wait until the signal stabilizes. Triton X-100 is added at the end of the measurement because it allows one to determine the maximum Ca2+ level in the system.Add 1 ml of 0.1 mM EDTA (pH 8.0) to chelate the Ca2+ ions in solution and record the exact time appearing in the display as it is important for the final Rmin determination, wait until the signal stabilizes and press the Traffic Light buttom (Figure 3A), make sure it becomes red to acquire the signals and save the value. By adding EDTA the Ca2+ ions are chelated allowing one to determine the minimum Ca2+ level in the system.Note: Triton X-100 and EGTA are added at the end of the determination so the measurement is performed with intact cells. If the cells were not intact, the minimum and maximum Ca2+ value could not be determined. To automatically determine the Ca2+ concentration according to the formula of Grynkiewicz et al. (1985) [see also Data analysis], set the calibration values Rmin and Rmax (Figure 3B) in the Calibration Tab layout of the FL WinLab Software, as reported in the User’s Guide.Note: Without this software it is necessary to determine the Rmin and Rmax for each sample as indicated in point 1 of Data analysis. Press the Convert to [ion] button (Figure 3B) to convert the raw dataset of the signals into Ca2+ ion concentration dataset using the calibration values set before and save the generated file. Without FL WinLab Software Ca2+ ion concentration has to be calculated using the formula of Grynkiewicz et al. (1985).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210320/20210320020006_2132.jpegFigure 3. FL WinLab Software. A. The Traffic light button allows to start and stop the analysis and describes the status of the instrument. B.",
    "The Calibration Tab layout permits to manage the raw data and the Convert to [ion] button to visualize the data (from the FL WinLab User’s Guide, PerkinElmer, Inc., UK).Calculate the difference between the Ca2+ ions present before and after CaCl2 addition (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210317/20210317034206_5020.jpgFigure 4. Example of a plot generated by FL WinLab Software used to calculate Δ[Ca2+]c before and after CaCl2 addition. The presence of the peaks in the trace is due to the change of the wavelength that LS-50B Luminescence Spectrometer shifts every two seconds. Therefore, the calculation of the Ca2+ concentration has to be performed considering the baseline (dotted line). After about 50 s, when the signal is stabilized, the CaCl2 is added (red arrow) and the Δ[Ca2+]c is calculated between the highest Ca2+ concentration value reached in the baseline (blue arrow) and the value when the CaCl2 is added (red arrow).Incubate the cells in HBSS buffer supplemented with Fura 2-AM (basal condition) or in HBSS buffer supplemented with 2 mM Fura 2-AM and different carbon sources (e.g., 5 mM glucose, fructose or sucrose), 50 μM ATP, or other conditions of interest. Of note, one should optimally add these compounds only after 50s from the start of the measurement (Figure 5)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}