{
  "id": 18108,
  "origin_website": "Jove",
  "title": "Measuring the Carotid to Femoral Pulse Wave Velocity (Cf-PWV) to Evaluate Arterial Stiffness",
  "procedures": [
    "This protocol was approved by the Ethics Committee of Shanghai Tenth People's Hospital.\n1. Recruitment of Participants\nInclude Adults with a moderate heart rate (40 < HR < 160).\nUse the following exclusion criteria.\n\t\nExclude those without internal arteriovenous fistula for renal dialysis or any other peripheral arteriovenous fistula like that.\nExclude those without peripheral arterial spasm, for example the Raynaud disease.\nExclude those without aortic valvular stenosis (transprosthetic pressure gradient > 60 mmHg).\nExclude those without second or third-degree atrioventricular (AV) block.\nExclude those without atrial fibrillation or atrial flutter.\nExclude those without unstable carotid atherosclerotic plaques that may rupture after kneading. 9) Without cognitive impairment or unable to cooperate.\nEnsure that the participants' bladder is empty.\nHave participants refrain from smoking, tobacco use or caffeine use for at least 3 hours before the measurement. Abstain from alcohol for at least 12 hours before the measurement. Fast for at least 3 hours before the measurement.\n2. Measurements of Vascular TOD\nNOTE: cf-PWV and PWA measurements, like conventional four-limb blood pressure measurements, are performed through a non-invasive evaluating method. A standard protocol is crucial to obtain an accurate value, especially when there are multiple operators. Make sure to practice the method before the actual operation. The participant's cooperation is key for the measurement of cf-PWV.\nExplain the procedure to the participant and obtain permission.\nMeasure the body height and weight before the start of the measurements.\nExplain that the process may take 5-10 min and involves letting the participant lie on the bed.\n\t\nKeep the patient's skin clean and dry when shifting supine positions. If the patient's skin is damp because of sweating, then wipe dry the skin.\nPerform the measurements in a quiet room with a stable room temperature.",
    "Put the participant's hands next to their body to make sure there is a smooth, undisturbed ECG signal. Connect up to 3-lead ECG monitors, positioning three electrodes (RA, LL, LA) according to the following diagram (Figure 2).\n\tNOTE: The use of disposable electrodes is recommended. The ECG leads and wires cannot be used in other ECG drawing equipment.\nHave the patient rest for at least 5 minutes in the supine position. Then measure the patient's blood pressure with a semiautomatic oscillometric device.\n\tNOTE: The blood pressure is measured according to the recommendations of the European Society of Hypertension17.\nHave the patient rest for at least 2 minutes.\n\tNOTE: The peripheral vascular dilatation caused by artery occlusion when measuring brachial artery blood pressure will change the brachial artery pulse transmission. Resting is essential to avoid excessive deviation.\nWhile the participant rests, enter the participant's detailed information, including the supine blood pressure, body height, body weight and operator's name, into the measurement device (Figure 3).\nAfter entering all the information, keep the participants in a supine position.\nManually measure the following parameters (mm) (Figure 3).\n\t\nMeasure the distance from the suprasternal notch (SSN) to the remote detection point (femoral artery).\nMeasure the distance from the sternal notch to the proximal (carotid artery) detection point.\nMeasure the distance from the remote detection point (femoral artery) to the proximal (carotid artery) detection point (cf-distance).\nChoose the PWA mode. Enter '0' as SSN-carotid distance, and enter 0.8*cf-distance as SSN-femoral distance. If the device doesn't accept '0', put another value as the SSN-carotid distance and add that value to the 80% cf distance as SSN-femoral distance5.\n\tNOTE: The operator should sit in a most comfortable position.",
    "Press the button to capture data. Put the tonometer on the radial artery fluctuation point (1-2 cm above the radial styloid process at a point where the fluctuation is strong and stable) to measure the central blood pressure.\n\t\nMaintain the position of the tonometer to obtain a steady waveform on the computer. Once the quality and reproducibility of the tonometry measurements reach the standard, the signal recording is finished automatically by the computer.\nKeep the tonometer at 90°.\nTo avoid parasite movement, immobilize the tonometer near the base with the fingers, firmly affix the tonometer to the skin.\n\t\tNOTE: The software automatically records the data as soon as the tonometer is placed in contact with the measurement site. The quality and reproducibility of the tonometry measurements are automatically tested. An operator index greater than 80% is considered as a reliable measurement. Pulse pressure amplification (PPA) is defined as the peripheral-to-central pulse pressure ratio and is calculated with the formula, PPA= (brachial SBP- brachial DBP)/ (central SBP- central DBP)-1. PWA can be observed on the device18 (Figure 4).\nChoose the PWV mode. Put the tonometer on the carotid artery fluctuation point. Maintain the position of the tonometer to obtain a steady waveform on the computer. After recording a stable waveform for 15-20 seconds. Once the quality and reproducibility of the tonometry measurements reach the standard, finish recording manually (Figure 5).",
    "Put the tonometer on the femoral artery fluctuation point (1-2 cm below the midpoint of the inguinal ligament at a point where the fluctuation is stable). Maintain the position of the tonometer to record a steady waveform. After recording a stable waveform for 15-20 seconds, finish recording manually once the quality and reproducibility of the tonometry measurements reach the standard. The PWV value can be observed on the device cf-PWV ≥ 10 m/s is considered as arterial stiffening (Figure 5)1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}