{
  "id": 10771,
  "origin_website": "Jove",
  "title": "Using the Race Model Inequality to Quantify Behavioral Multisensory Integration Effects",
  "procedures": [
    "All participants provided written informed consent to the experimental procedures, which were approved by the institutional review board of the Albert Einstein College of Medicine.\n1. Participant Recruitment, Inclusion Criteria, and Consent\nRecruit a relatively large cohort of English-speaking individuals who can ambulate independently and are free of significant sensory loss; active neurological or psychiatric disorders that interfere with experimental evaluations; and current/future medical procedures that affect mobility.\nEnsure that each participant can successfully complete a sensory screening exam, where visual, auditory, and somatosensory acuity are formally tested to confirm study appropriateness.\n\t\nUse the Snellen eye chart to ensure that bilateral visual acuity is better than or equal to 20/100.\nUse a tone-emitting otoscope to ensure that participants are at a minimum able to hear a 2,000 Hz tone at 25 dB30.\nDetermine whether participants maintain a diagnosis of clinical neuropathy and whether it interferes with the ability to feel the experimental somatosensory stimulation21,28,29.\nIf the participant is unable to meet these minimum sensory requirements, do not include them in the study.\nExclude older adults with dementia by implementing cut-scores from reliable screening instruments such as the AD8 Dementia Screening Interview cutoff score ≥2 31,32; and the Memory Impairment Screen MIS; cutoff score < 533.\nHave participants provide written informed consent to the experimental procedures (approved by a local institutional review board) if willing to participate.\n2. Experimental Design\nUse stimulus presentation software to program a simple reaction time experiment with three experimental conditions: visual (V) alone, somatosensory (S) alone, and simultaneous visual-somatosensory (VS). Inform participants to respond to each sensory stimulus, regardless of the condition, as quickly as possible. See supplementary files for an example of a VS simple RT task (Supplementary File 1).",
    "Use a stimulus generator with three control boxes (30.48 mm × 20.32 mm × 12.70 mm) and plastic housing for stimulators. The left and right control boxes contain bilateral blue light emitting diodes (LEDs; 15.88 cm diameter) that illuminate for visual stimulation and bilateral motors with 0.8 G vibration amplitude that vibrate for somatosensory stimulation (equivalent to a cell-phone vibration)22,23,28.\nEnsure that stimulus generators provide both unisensory (visual OR somatosensory alone), as well as multisensory (simultaneous visual AND somatosensory) stimulation. Place a center dummy control box equidistant (28 cm) from the left and right control boxes described in 2.1.1. and affix a visual target sticker (central circle of 0.4 cm diameter) to serve as the fixation point.\nConnect the stimulus generator to the experimental computer via the parallel port which allows the direct control for each stimulator.\nProgram the stimulus presentation software to send transistor-transistor-logic (TTL, 5 V) pulses to the trigger stimulus generators on and off directly via the parallel port. Set the stimulus presentation time to 100 ms in duration.\nIn the stimulus presentation software, program a minimum of 3 experimental blocks each consisting of 45 trials (15 trials of each stimulus condition presented in random order) for a total of 135 stimulus presentations for this simple reaction time experiment.\nVary the inter-stimulus-interval randomly between 1 and 3 s to prevent anticipatory effects. Alternatively, insert catch trials where the stimulus parameters are the same as above, but the TTL pulse is not sent, thus no visual or somatosensory stimulation occurs and, therefore, no response is expected.\nAllow participants up to 2,000 ms to respond to any given stimulus condition. If no response is detected within the 2,000 ms response period, ensure that the stimulus presentation software advances to the next trial automatically.",
    "NOTE: This response window cut-off is arbitrary but necessary to keep the total experimental time to a minimum; note that longer RTs will be set to infinity regardless.\nSeparate the three experimental blocks by programming 20-s breaks in the stimulus presentation software to reduce potential fatigue and increase concentration. Ensure each subsequent block starts immediately after the 20-s break concludes.\nProgram written instructions to appear on the visual display (monitor of the experimental computer). The exact instructions are provided in the supplemental material. Ask the participant to start the experiment by pushing the response pad with their right foot when ready to commence. Once the stimulus parameters are programmed, the stimulus presentation software creates a script that is to be run on each participant.\nProvide participant ID and session number in order to run the experimental script. Once the experiment is completed, a unique behavioral data log is produced for each participant (see Supplementary File 2 for a sample Eprime 2.0 output file).\n3. Apparatus & Task\nHave participants sit upright and comfortably rest hands upon the left and right control boxes.\n\t\nStrategically place index fingers over the vibratory motors mounted to the back of the control box, and thumbs on the front of the control box, under the LED to not block the light (see Figure 1).\nEnsure that the somatosensory stimuli are inaudible by providing participants with headphones over which continuous white noise is played at a comfortable level (typically 65-75 dBs).\nInstruct participants to respond to all stimuli as quickly as possible.\n\t\nAsk participants to use a foot-pedal located under the right foot as the response pad since fingers will be accepting somatosensory stimulation (see Figure 1).\nCalculate performance accuracy by stimulus condition.",
    "Instruct participants to respond to each of the experimental stimuli (45 per condition) as quickly as possible.\nDivide the number of accurately detected stimuli per condition over 45 (total number of trials per condition) to obtain measures of performance accuracy for visual, somatosensory, and VS conditions, respectively.\n4. Race Model Inequality Data Preparation (Individual Level)\nDetermine whether an individual’s behavioral performance is valid.\n\t\nExclude participants that are not able to attain an accuracy of 70% correct or greater on any one stimulus condition As the participant’s performance accuracy on a simple reaction time task decreases, so does the reliability of the individual’s data.\nConsider trials inaccurate (omitted) if a participant fails to respond to a stimulus within the set response time period and set corresponding RT to infinity rather than excluding the trial from the analysis25,28.\n\t\tNOTE: In previous studies, the group-averaged (n=289) stimulus detection was 96% across all conditions, and over 90 % of the population had detection rates above 90% for all conditions28.\nDo not employ data-trimming procedures that delete very slow RTs as this will bias the distribution of RT data.25 Ensure RTs that are clearly outliers are set to infinity. See supplementary file depicting alterations in CDFs based on data-trimming procedures and inclusion of slow RTs (Supplementary File 3).\nOrganize the RT Data.\n\t\nSort RT data in ascending order by the experimental condition. Place visual, somatosensory, and VS conditions in separate columns of sorted RT data. Ensure each row represents one trial and each cell represents the actual RT (or infinity in the case of omitted or slow trials).\nBin the RT Data.",
    "Identify the fastest RT (to whichever condition- orange ellipse) and the slowest RT (to whichever condition-red ellipse). Subtract the slowest RT from the fastest (e.g., 740 ms – 237 ms) in order to calculate the individual’s RT range (503ms; blue ellipse) across ALL test conditions. Table 1 demonstrates how to calculate an individual's RT Range and depicts the various color elipses.\nBin RT data from the 0% (fastest RT = 237 in this example) to the 100% (or slowest RT = 740 in this example) in 5% increments by taking the fastest RT and gradually adding 5% of the RT range identified in 4.3.1 until 100% of the RT data is accounted for (see Table 2). This will result in 21-time bins.\n\t\tNOTE: In Table 2 - 1%ile is only included in worksheet just for illustrative purposes.\nCalculate the Cumulative Distribution Frequency (CDF) for the experimental conditions.\n\t\nUsing spreadsheet software, use a “FREQUENCY” function where array1 equals the actual RTs for one of the experimental conditions and array2 equals the 21 quantized RTs bins calculated in Step 4.3, divided by the total number of trials (45) per condition. This is illustrated in Figure 2a.\nRepeat this function for the other two experimental conditions (Figure 2b-2c) so as to populate frequencies (or probability (P)) of an RT occurring within each of the 21 quantized time bins, for each of the three experimental conditions.\nNext, create the cumulative distribution frequency (CDF) by summing the running total of probabilities across the quantized bins (0%, 0+5%, 0+5+10%, 0+5+10+15%, etc.) for each of three experimental conditions. For example, in the cumulative probability column for the Soma condition (column AE), the cumulative probability for the 95%ile range (cell AE22) is the summation of the probability values in cells Z3:Z23 (see Figure 3).\nActual vs. Predicted CDFs.",
    "Ensure that the CDF of the multisensory condition represents the actual CDF (see Figure 4 column AF and plotted purple trace). To calculate the predicted CDF (column AG), sum the two unisensory CDFs (with an upper limit set to 1) across each of the 21 quantized time bins (see Figure 5). Start at the 0th percentile (bin 1) and continue all the way down to the 100th percentile (bin 21).\nConduct the Test of the Race Model Inequality (RMI).\n\t\nSubtract the predicted CDF (calculated in 4.5.2.) from the actual CDF for each of the 21 quantized time bins to obtain the difference values (column AH; see Figure 6).\nPlot these 21 values as a line graph, where the x-axis represents each one of the quantized time bins (column AC) and the y-axis represents the probability difference between the actual and predicted CDFs (column AH; Figure 7 (black trace).\nCheck for positive values at any latency (i.e., quantiles) which indicate the integration of the unisensory stimuli and reflect a violation of the RMI (see the green highlighted portion of difference wave from 0.00 – 0.10 in Figure 7).\n5. Quantification of the Multisensory Effect (Group Level).\nGroup-average the individual RMI data (differences between predicted CDF and the actual CDF for each of the 21-time bins; step 4.6.1- column AH) across all participants. Use a spreadsheet software to assign individuals to rows and time bins as columns. In a new spreadsheet, place the 21 values calculated in 4.6.1 in individual rows (1 row per participant), and average values within time bins to create one group-averaged difference waveform.\nPlot the group average 21 values as a line graph, where the x-axis represents each one of the quantized time bins and the y-axis represents the probability difference between CDFs.",
    "Visually inspect and document the violated portion of the group-averaged difference wave (i.e., positive values).\nRun Gondan’s RMI permutation test (R script available as a free download)26 to determine whether there is a statistically significant violation of the RMI over the positive values identified in step 5.3.\n\t\nOrganize the data in one text file where the first column is named “Obs” for Observer (e.g., participant ID), the second column is named “Cond” for stimulus condition (V, S, or VS) and the third column is named “RT” for actual RT or “Inf” if set to infinity.\nOpen the software, identify which time bins are to be tested (based on the positive time bins identified in 5.3), and enter the text file name created in 5.4.1.\nRun the test by calling up the script. The results will provide a tmax value, 95% criterion, and p-value which will be instrumental in determining whether a significant violation of the Race Model exists across the entire study sample.\nCalculate the area-under-the-curve (AUC) for each individual after establishing the significantly violated percentile bins in step 5.3. AUC will serve as the magnitude of multisensory integration (or the independent variable). To calculate AUC use participant 1’s data as an example, for percentile bins 0.00 - 0.15 depicted in Figure 8a-d).\n\t\nSum the CDF difference value at time bin 1 (1st time positive value) with the CDF difference value of time bin 2 (next positive value) and then divide by two (see Figure 8a). Repeat step 5.3.1. for each consecutive pair of time bins containing positive values (see Figure 8b-8c).\nSum the results obtained from steps 5.5.1 - 5.5.2. to generate the total AUC of the CDF difference wave during the violated percentile range (e.g., 0.00 – 0.15 in Figure 8d).",
    "NOTE: AUC is a continuous measure and one AUC value is present for each individual for the violated portion of the RMI (Figure 8d red ellipse = participant 1’s AUC = 0.13). AUC can be used as an independent variable representing ‘magnitude of VS integration’ which can later be tested to predict important clinical outcome measures (see also28,29).\nAssign multisensory integration classification groups based on the number of violated percentile bins (values greater than zero highlighted in gray in Table 3) during the significantly violated percentile range identified above in step 5.3. Looking at Table 3 (percentile bins 0.00 – 0.15): Participant 1 has positive values for 2 out of 4 bins; Participant 2 has positive values for 4 out of 4 bins; and Participant 3 has positive values for 0 out of 4 bins.\n\t\nOperationalize a classification system based on the number of violated percentile bins (values greater than zero for 0, 1, 2, or 3 bins) during the 0-10th percentile. \nFigure 9 depicts one potential classification definition which is adapted from recently published data presented by Mahoney and Verghese29.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}