{
  "id": 6242,
  "origin_website": "Bio",
  "title": "Sendai Virus Propagation Using Chicken Eggs",
  "procedures": [
    "Egg candling on Day 10Eliminate infertile and fertile dead eggs by egg candling, mark the position of embryo, and air cell with a pencil (Figure 1). You need a dark room and concentrated light source. The best evidence of a live embryo is well-developed blood vessels. Note: The capacity of the egg incubator is 41 eggs. If you have the egg incubator with larger capacity (e.g., 160 eggs), you can order 180 eggs, and handle 160 eggs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180910/20180910012850_0518.jpgFigure 1. Chicken egg with air cell. Air cell is visualized by candling (left). Draw a line along the edge of air cell (arrows in left panel) and mark X (right) in the position of the embryo with a pencil under a strong light in dark room. Note: This is an example of regular/unembryonated egg. You will see an embryo as a slightly dark spot and red vessels (right) by candling in the embryonated egg on Day 10. Allantoic inoculation on Day 10In a biosafety cabinet, dilute sterile Sendai virus stock to a concentration of 1 x 106 pfu/ml in sterile PBS with Ca2+ and Mg2+. The inoculum is 0.2 ml, containing 2 x 105 pfu. Keep tubes of virus on ice.Wipe top (air cell side) of egg with 70% ethanol.Wipe top of egg with iodine and let dry.Puncture hole with alcohol soaked push pin at the location opposite to the position of the embryo and 10 mm below the air cell edge (Figure 2). Note: Blood vessels usually do not reach to this area (10 mm below the air cell edge). Allantoic fluid does not leak from the punctured hole.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180910/20180910012905_9336.jpgFigure 2. Chicken egg with a puncture. Make a hole with a push pin at the location 10 mm below the air cell edge and opposite to embryo.",
    "Insert 25 G 5/8 needle to the hilt, deliver 0.2 ml inoculum. Do not inject any air.Seal hole with Duco cement, let dry.Return eggs to the incubator, turn on the turner.Note: The egg incubator contains the function of turning eggs every four hours to cause the yolk to be repositioned away from the shell, making it safe for developing embryos. Egg candling on Day 12Candle the eggs at the end of the day, mark and discard the dead ones. Place all live ones in a refrigerator/cold room. Do not stack them because they need to be cooled quickly for proper contraction of the blood vessels. Keep the eggs in the cold overnight, and process the next day.Harvest of allantoic fluid on Day 13From this step, all procedures need to be performed in a biosafety cabinet. Wearing a face mask is recommended because the virus can cause mild respiratory symptom in humans. Cut off shell that covers the air cell using scissors and forceps. Break the shell membrane, avoid rupturing yolk or blood vessels with an 18 G needle on a 50 ml syringe, and aspirate allantoic fluid (yellowish tinge) (Figure 3). From one large egg 10-15 ml usually can be collected. Watch for yolk (very yellow) and egg white (albumin: clear and very viscous) (Figure 4). The yolk and the egg white with viral inoculation do not show any difference from the ones of regular/unembryonated eggs from grocery store in appearance and smell. If an egg looks nasty (i.e., egg white looks very whitish or yellowish, and/or are stinky), this is a phenomenon of bacterial growth in the egg and the egg should be thrown away after immediate bleaching (disinfecting). Place the collected allantoic fluid in centrifuge tubes (250 ml) on ice immediately.",
    "Note: On Day 13, yolk is not easily visible. Blood vessels do not reach to the air cell, and will be shrunk after cooling the eggs in the cold room; Red blood cells and shell will spin out with clarification, and not be a problem. However, membrane pieces will co-purify with the virus. Therefore, avoid to remove membrane pieces.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180910/20180910012922_8181.jpgFigure 3. How to open up an egg. A. Making a hole on the shell over air cell. B. Cutting shell by scissors along but slightly inside of the line of air cell. C. Exposed air cell and intact shell membrane. D. Peeling and removal of shell membrane with forceps completely; E. Collecting allantoic fluid between shell membrane and an embryo (yolk in this picture) with an 18 G needle and 50 ml syringe. Note: This is an example of unembryonated egg. You will see an embryo instead of yellow yolk in the actual viral propagation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180910/20180910012938_9990.jpgFigure 4. Collected allantoic fluid. Allantoic fluid is transparent or slightly cloudy with yellowish tinge.Concentration of SeV by centrifugationCollect allantoic fluid into 250 ml centrifuge bottles (max volume 225 ml) on ice. Balance bottles.Spin the rotor at 2,600 x g for 25 min to remove the shell. Do not use brake.Decant fluid into fresh centrifuge bottles that contain 2 ml of 0.5 M EDTA. This will make the pellet easier to be re-suspended later.Spin the rotor at 27,000 x g for 90 min to obtain the 1st pellet. Decant fluid into a graduated cylinder for the volume measurement, and discard the fluid after immediate bleaching.Re-suspend the pellet in cold PBS (with Ca2+ and Mg2+) with 1 mM EDTA using a 2-3 ml disposable transfer pipette. Condense multiple bottles into one bottle. Extensive rinsing will be required to re-suspend the first pellet.",
    "Bring the volume up to about 200 ml with cold PBS (with Ca2+ and Mg2+) with 1 mM EDTA.Note: The purpose of Steps E5 and E6 is to combine multiple pellets to be one single pellet. If you do not have many bottles, you do not need these steps. Spin the rotor at 27,000 x g for 90 min to obtain the second pellet. Decant the fluid and discard after immediate bleaching.Re-suspend the pellet in about 2 ml of cold PBS (with Ca2+ and Mg2+) with 1 mM EDTA. Use another 8-10 ml to rinse the remainder, and pool into a tube.Sonicate (40 kHz frequency and 35 W ultrasonic power) final suspension for 2 min at room temperature in a sonic water bath to break apart viral chunk.Aliquot and freeze them at -80 °C. Make and freeze also two small aliquots for testing viral titer."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}