{
  "id": 15013,
  "origin_website": "Jove",
  "title": "CcCIPK14 Gene Function Analysis to Illuminate the Efficient Root Transgenic System",
  "procedures": [
    "NOTE: Pigeon pea is a diploid legume crop that belongs to the family Fabaceae. The pigeon pea seeds used in this experiment are from the Northeast Forestry University of China and are coded 87119. The primary steps of this protocol are illustrated in Figure 1A. The seedling incubation was performed in a high humidity environment at 25 °C under fluorescent lights at 50 µmol photons per m-2s-1 in a 16 h photoperiod. A. rhizogenes strains K599 (NCPPB2659) were preserved in the laboratory. They were stored in yeast mannitol medium (YEP) with 15% glycerol at -80 °C. The protocol described in this work was based on the protocol Meng et al.21.\nCAUTION: Deposit all the genetically modified bacteria and plants into the appropriate waste container. Use all hazardous chemicals in a fume hood and dispose of them in the hazardous waste container.\n1. Preparation of pigeon pea seedlings\nChoose plump and undamaged pigeon pea seeds (Figure 1A) that have been stored for less than 1 year.\nSoak the seeds in distilled water for 24 h (Figure 1B). Transfer the swollen seeds to a seed tray and place them in the greenhouse.\nSeeds start to germinate after 1-2 days. When the epicotyl reaches 1.5 cm, transplant the seedlings to 10 cm (diameter) x 9 cm (height) pots containing soil and sand in a volume ratio of 3:1.\n\tNOTE:The soil consists of a mixture of nutritious soil, vermiculite, and perlite at a 2:1:1 ratio.\nGrow the seedling in a greenhouse.\n2. Activation of A. rhizogenes\nNOTE: The strain used for A. rhizogenes transformation was the K599 preserved at -80 °C. The binary vector pROK2 (pBIN438;http://www.biovector.net/product/428388.html) contains green fluorescent protein (GFP) as an indicator gene and a kanamycin resistance gene as a selectable marker to transform A. rhizogenes.\nThaw A. rhizogenes on ice.",
    "Dip the bacteria and line them evenly onto yeast mannitol medium (YEP) supplemented with 8 g/L of agar powder, 25 mg/L of rifampicin, and 25 mg/L of kanamycin (YRK, pH 7.0).\nIncubate at 28 °C for 16 h.\nSelect monoclonal colonies. Culture them in a 50 mL tube containing 10 mL of YEB medium supplemented with 25 mg/L of rifampicin and 25 mg/L of kanamycin (YRK, pH 7.0). Place the centrifuge tube on a shaking incubator with a rotational radius of 10 cm, at 28 °C and 200 rpm for 16 h.\n3. Plant transformation using A. rhizogenes\nNOTE: Select healthy plants to infect A. rhizogenes using the following injection procedure. This procedure results in transformed hairy roots. To analyze the gene function of CcCIPK14,a control is needed. A. rhizogenes solutions with empty vector or CcCIPK14-pROK2 plasmids were injected into seedlings to induce hairy roots.\nInoculate A. rhizogenes\nChoose pigeon pea seedlings with the same growth status.\nEmpty the air from the 1 mL syringe and aspirate 0.3 mL of bacterial liquid. Slowly push the pushrod to fill the syringe needle with bacterial liquid21.\nFirst fix the stem of the pigeon pea seedling with tweezers, and then prick the syringe needle into the stem at 1 cm.\nWhen withdrawing the syringe, completely submerge the needle tip into the stem. Slowly push the pushrod to pump the bacterial liquid out of the penetrating wound.\n\t\t​NOTE: The attachment of residual bacterial liquid to the wound in bacteria droplets can improve infection and transformation efficiency.\nSeedling management\n\tNOTE: High temperature and humidity can improve the infection efficiency of A. rhizogenes.",
    "Place seedlings inoculated with A. rhizogenes in a tray (30 cm x 60 cm x 6 cm) with 1 L of water. Use a transparent plastic lid (30 cm x 60 cm x 30 cm) as a cover to maintain the temperature and humidity of the internal environment.\nPeriodically remove fallen leaves and flocculent hyphae attached to leaf tips and fallen leaves.\nAfter a week, the callus begins to appear in the wound. Subsequently, keep the the plastic lid half-open.\nAfter 4-5 weeks, most of the callus tissue differentiated into adventitious roots. Remove the plastic lid.\nAdd 1 L of water to the tray every 3 days to keep the soil moist.\n\t\t​NOTE: Pigeon pea is a drought-tolerant plant; too much water can inhibit plant growth.\n4. Identification of transformed hairy roots\nNOTE: Transformed hairy roots can be identified based on the morphology and gene level. This procedure primarily focuses on reporter gene (GFP) identification assay.\nCollect the root tips of the hairy root and mark the remaining part.\nEvaluate whether there is green fluorescence under a confocal laser scanning microscope.\nTriturate 0.1 g of hairy roots with strong fluorescence signal into fine powder in liquid nitrogen.\nAccording to the plant genomic DNA kit manufacturer's instructions, prepare the genomic DNA of pigeon pea independent transgenic lines by the modified cetyltrimethylammonium bromide (CTAB) method23.\nUse 500 ng of genomic DNA template and primers for PCR. The primers are shown in Table 1.\nPerform the following amplification cycle: pre-denaturation at 94 °C for 5 min, denaturation at 94 °C for 30 s, annealing of primers at 55 °C for 30 s, and primer extension at 72 °C for 30 s. After 36 cycles and a final extension of 10 min at 72 °C, analyze the amplified products on a 1% agarose gel.",
    "Stain the gels with nucleic acid staining and visualize them under UV light.\n5. Exogenous hormone treatment\nNOTE: The positive composite plants were treated with exogenous hormones to study the effect of CcCIPK14 on metabolic. The composited plants induced by A. rhizogenes were divided into three groups: JA treatment group, ABA treatment group, and control group (Figure 3A).\nReduce watering 3 days before exogenous hormone treatment.\nPrepare both JA and ABA solutions at a concentration of 5 mg/L.\n\tNOTE: The JA and ABA powder are first dissolved in ethyl alcohol, and then filled to the target volume with distilled water.\nUsing a spray bottle, spray JA and ABA solutions uniformly on the leaves of the plants. Treat the control group with water.\n\t​NOTE: An average of 10 mL of solution was sprayed on each seedling.\nCover with the plastic lid immediately after spraying treatment. Put it back in the artificial climate greenhouse.\n6. Sample collection and preservation\nNOTE: After 3 h of exogenous hormone treatment, plant materials from different treatment groups were collected.\nRemove tawny and contaminated hairy roots and select those with a white appearance. Collect these hairy roots and dry them out with absorbent paper.\nDivide the hairy roots collected from each seedling into two parts. Put one part into a numbered test tube and wrap it using marked tinfoil.\nLyophilize the tinfoil in liquid nitrogen, and then store all harvested tin foil at -80 °C for further investigation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}