{
  "id": 13281,
  "origin_website": "Jove",
  "title": "Pan-myeloid Differentiation of Human Cord Blood Derived CD34+ Hematopoietic Stem and Progenitor Cells",
  "procedures": [
    "Human umbilical cord blood for experimentation was donated by healthy individuals after informed consent to Maricopa Integrated Health Systems (MIHS), Phoenix. The deidentified units were obtained through a Material Transfer Agreement between MIHS and the University of Arizona.\n1. Reagents and Buffers\nNOTE: Prepare all reagents and buffers under sterile conditions in a biological safety cabinet.\nPrepare sterile PBS-BSA-EDTA (PBE) buffer by adding 7.2 mL of sterile 35% bovine serum albumin (BSA; use sterile tissue culture grade 35% BSA) and 5 mL of sterile 0.5 M ethylene diamine tetra acetic acid (EDTA) to 487.8 mL of sterile Dulbecco's phosphate buffered saline (DPBS). Filter sterilize and de-gas the buffer by leaving the filter attached to vacuum in a biological safety cabinet for at least 2 h. Aliquot the de-gassed buffer in smaller volumes (250 mL) and store at 4 °C.\nPrepare 1x Hanks balanced salt solution (1x HBSS). Dilute 100 mL of 10x HBSS stock in 900 mL of sterile distilled water to make 1 L of 1x HBSS and adjust pH to 7.2. Filter sterilize the 1x HBSS before use.\nPrepare 2% acetic acid solution by adding 2 mL of glacial acetic acid to 98 mL of distilled water.\nPrepare 20 ng/mL recombinant human fibronectin fragment solution in 1x PBS. Make 10 mL per 48-well plate.\nPrepare 2% BSA. To 100 mL 1x PBS, add 2 grams of BSA fraction V. Filter sterilize before use.\nMake complete Dulbecco’s Modified Eagle medium (DMEM) by adding the DMEM powder, 3.7 gm sodium bicarbonate, 100 mL fetal bovine serum (FBS) and 5 mL penicillin-streptomycin (PS) to 800 mL of sterile distilled water. Mix and make up the volume to 1 L, and filter sterilize before use.\nPrepare freezing medium by mixing 90 mL of FBS and 10 mL of sterile dimethyl sulfoxide (DMSO).",
    "Prepare stimulation medium. To serum free medium, add L-glutamine to 2 mM, and cytokines to a final concentration of 50 ng/mL for stem cell factor (SCF), thrombopoietin (TPO), and Fms-like tyrosine kinase 3 ligand (Flt3L), and 20 ng/mL for interleukin-3 (IL3) (see Table of Materials for preparation of cytokine stock solutions). Make 5 mL per 48-well plate.\nPrepare 1x myeloid differentiation medium. To complete DMEM, add cytokines to a final concentration of 5 ng/mL for SCF, Flt3L, and IL3, 50 ng/mL for TPO, and 4 units/mL for erythropoietin (EPO). Make 5 mL per 48-well plate.\nPrepare 2x myeloid differentiation medium. To complete DMEM, add cytokines to a final concentration 10 ng/mL for SCF, Flt3L, and IL3, 100 ng/mL for TPO, and 8 units/mL for EPO. Make 5 mL per 48-well plate.\nPrepare flow cytometry buffer. To 1 L of 1x PBS, add 10 g of BSA fraction V.\nPrepare 1% paraformaldehyde in 1x PBS (see Table of Materials for details).\nPrepare poly-L-lysine solution by adding 500 µL of 10 mg/mL poly-L-lysine to 49.5 mL of 1x PBS.\n2. Isolation of Mononuclear Cells from Umbilical Cord Blood\nNOTE: For the protocol described below, cord blood volumes of 90 to 100 mL were used. The isolation of CD34+ cells must be performed under sterile conditions in a biological safety cabinet.\nSpray the bag containing UCB with 70% ethanol to sterilize the outer surface before introducing it into the biological safety cabinet. Transfer the UCB into a sterile 250 mL plastic bottle and dilute it 1:1 by adding an equal volume of room temperature (RT) 1x HBSS.",
    "Dispense 15 mL of MNC fractionation medium (MFM; see Table of Materials) per tube into approximately six sterile 50 mL conical tubes. Tilt the tube with MFM, and gently pour 30 mL of diluted UCB onto the MFM layer without disturbing it.\nCentrifuge the tubes at 400 x g for 30 min at RT with slow acceleration and no brake.\nAfter centrifugation, aspirate between 15-20 mL of the plasma above the MNC layer. Gently collect the MNCs with a pipette and transfer to a new 50 mL conical tube.\nNOTE: MNCs deposit as a white buffy layer at the interface of plasma and MFM, and the red blood cells (RBCs) sediment at the bottom of the conical tube.\nPool MNCs collected from 2-3 tubes together. Make up the volume of each tube to 50 mL with cold PBE buffer.\nCentrifuge the tubes at 300 x g for 10 min at 4 °C, with the brake on low.\nAspirate the supernatant and tap the tube gently to loosen the cell pellet.\nRe-suspend the pelleted cells in 5 mL of ice cold PBE buffer. Use the same 5 mL of re-suspended cells to collect cells from other tubes. Combine cells from 3 to 4 tubes together in one 50 mL conical tube.\nTo collect any remaining cells, wash all the tubes with 5 mL of cold PBE buffer and add to the 50 mL conical tube.\nCount the MNCs by diluting 10 µL of cell suspension into 490 µL acetic acid solution.\nNOTE: Acetic acid lyses any contaminating RBCs to allow easier counting of MNCs.\nMake up the volume of the cell suspension to 50 mL with ice-cold PBE buffer. Centrifuge the cells at 300 x g for 10 min at 4 °C, with brake on low.",
    "NOTE: The MNC suspension may be processed immediately for isolation of CD34+ cells or frozen for later applications.\nTo freeze the MNCs, remove the supernatant and re-suspend at a density of 2 x 107 cells/mL in freezing medium at RT.\nFreeze the cells at -80 °C overnight in a cell freezing container and then transfer them to liquid nitrogen.\n3. Isolation of CD34+ Cells from Mononuclear Cells\nIf using freshly isolated MNCs proceed directly to step 3.3.\nIf using frozen MNCs, quickly thaw the frozen cells in a 37 °C water bath and transfer to a 50 mL conical tube. Collect any remaining cells in the vials with 1 mL of ice-cold PBE buffer and transfer to the 50 mL conical tube.\nMake up the volume of the MNC suspension to 50 mL with cold PBE buffer and centrifuge at 600 x g for 5 min at 4 °C.\nRemove the supernatant and tap the tube gently to loosen the cell pellet. Re-suspend the MNCs to 1 x 108 cells in 300 µL of ice-cold PBE buffer.\nAdd 100 µL of FcR blocking reagent from the magnetic-activated cell sorting (MACS) human CD34 microbead kit per 1 x 108 MNCs and mix gently.\nNOTE: This blocks nonspecific binding to the CD34 microbeads.\nAdd 100 µL of the CD34 microbeads per 1 x 108 cells. Mix gently and incubate at 4 °C for 30 min in a refrigerator. Do not incubate on ice.\nWhile the cells are incubating, place an LS column and pre-separation filter in the MACS separator magnetic field. Equilibrate the column with ice-cold PBE buffer by adding 2 mL directly into column and 1 mL in the pre-separation filter. Allow the column to empty into a 15 mL conical tube and discard the flow through.",
    "Remove the MNCs from 4 °C, add ice-cold PBE buffer to make up the volume to 15 mL, and centrifuge the cells at 300 x g for 10 min at 4 °C, with the brake on low.\nAspirate the supernatant and re-suspend the cells in 1 mL of ice-cold PBE buffer.\nAdd the cell suspension to the pre-separation filter placed on the LS column.\nNOTE: The pre-separation filter removes any large cell aggregates that may block the column.\nRinse the tube with 3 mL of ice-cold PBE buffer and add it to pre-separation filter placed on the LS column. After this, discard the pre-separation filter.\nWash the LS column four times by adding 3 mL of ice-cold PBE buffer, allowing the column to drain each time.\nNOTE: The CD34+ cells will remain bound to the column and the unlabeled cells will flow through the column.\nAfter the final wash, remove the column from the MACS separator magnetic field and place it in a new 15 mL conical tube, away from the magnet.\nAdd 5 mL ice-cold PBE buffer to the column and expel the bound CD34+ cells by firmly pushing in the plunger.\nOptionally, pass CD34+ cells isolated from the first column over another LS column with the pre-separation filter as described above (steps 3.10−3.13).\nCount the isolated CD34+ cells with trypan blue (10 µL of cells and 10 µL of trypan blue) to determine the total number of live cells.\nNOTE: At this stage, the isolated CD34+ cells may be frozen for later use or may be processed directly for analysis of HSPCs by flow cytometry (section 4) or for differentiation to myeloid lineage cells (section 5).\nCentrifuge the cell suspension at 600 x g for 5 min at RT, with brake on low.",
    "To freeze the CD34+ cells, aspirate the supernatant and re-suspend up to 5 x 106 cells in 1 mL of freezing medium and freeze as described above (step 2.13). Otherwise, proceed to section 4 or 5.\n4. Determination of Stem and Progenitor Populations by Flow Cytometry\nTo determine the fractions of stem and progenitor populations in the freshly isolated CD34+ HSPCs, centrifuge them at 600 x g for 5 min and re-suspend 1 x 106 cells in 50 µL of flow cytometry buffer.\nTo 1 x 106 CD34+ cells, add antibodies (see Table of Materials for dilutions) to lineage markers (CD3, CD7, CD10, CD11b, CD19 and CD235a — all FITC labelled), CD34 (APC-Cy7), CD38 (PE), CD45RA (PE-Cy7), CD123 (APC) and 7-aminoactinomycin D (7-AAD; as a live/dead stain) and make up the total volume to 100 µL. Incubate on ice in the dark for 20 min.\nNOTE: Fewer than 1 x 106 CD34+ cells may be employed for analysis. If staining fewer cells, the total volume and the volume of antibodies added should be reduced accordingly. For flow cytometry analysis, unstained and single stained MNCs should be used as controls for setting positive and negative gates for each fluorophore.\nAfter incubation, wash the cells with 1 mL of flow cytometry buffer and centrifuge at 600 x g for 5 min.\nOptionally, fix the stained cells in 0.5 mL of 1% paraformaldehyde solution for 10 min in the dark at RT.\nCentrifuge at 600 x g for 5 min and aspirate the supernatant.\nWash the fixed/stained cells with 1 mL of flow cytometry buffer and centrifuge at 600 x g for 5 min at 4 °C.\nAspirate the supernatant, re-suspend the cells in 500 µL of flow cytometry buffer, and analyze by a flow cytometer (Table of Materials).",
    "5. Myeloid Differentiation of the CD34+ Hematopoietic Stem and Progenitor Cells\nNOTE: To differentiate the CD34+ HSPCs to the myeloid lineage cells, they are first stimulated in recombinant human fibronectin fragment coated plates and then seeded on a layer of MS-5 stromal cells in myeloid differentiation medium. Differentiation may be monitored each week for 3 weeks based on expression of cell surface markers specific to the four myeloid lineages. During stimulation and differentiation, all incubations are performed at 37 °C and 5% CO2 in a humidified chamber. All steps should be performed in a biological safety cabinet.\nCoat the wells of a sterile uncoated 48-well plate by adding 200 µL/well of recombinant human fibronectin solution in 1x PBS for 2 h at RT.\nAfter 2 h, carefully remove the recombinant human fibronectin solution and discard.\nBlock the wells with 200 µL/well of 2% BSA for 30 min at RT.\nAspirate the BSA solution and wash the wells twice with 500 µL of sterile 1x PBS.\nNOTE: Fibronectin fragment coated plates may be stored at 4 °C for up to 2 weeks.\nTo stimulate the CD34+ HSPCs, re-suspend the freshly isolated cells (from step 3.17) at a density of 1 x 105 cells/200 µL or 5 x 105 cells/mL of warm 1x stimulation medium.\nIf using frozen CD34+ cells, quickly thaw and transfer the cells to a 15 mL conical tube containing warm complete DMEM. Centrifuge at 600 x g for 5 min and re-suspend the cells as described in step 5.5.\nPlate 200 µL of the CD34+ cell suspension per well of the fibronectin fragment coated 48-well plate and incubate for 48 h.",
    "On the next day, seed 15,000 MS-5 stromal cells in 200 µL of complete DMEM per well of a 48-well tissue culture treated plate and incubate at 37 °C for 24 h.\nAfter 48 h of stimulation, collect the CD34+ cells by gentle pipetting. Wash the wells with 500 µL of warm DMEM and pool with the cell suspension.\nCount the cells with trypan blue. Centrifuge the suspension at 600 x g for 5 min and re-suspend at a density of 5,000 cells/200 µL of 1x myeloid differentiation medium.\nFrom the 48-well tissue culture plate seeded with MS-5 stromal cells, gently aspirate the medium without disturbing the cells. Layer 200 µL (5,000 cells) of the CD34+ cell suspension per well of the plate and incubate at 37 °C.\nNOTE: Culture of MS-5 cells can be maintained in complete DMEM. On the day the CD34+ cells are seeded, the MS-5 cells must be in a uniform layer (80-90% confluence). It is recommended that the MS-5 cells are plated at least 24 hours prior to seeding of the CD34+ cells. If MS-5 cells are to be plated 48 h or 72 h prior to seeding the CD34+ cells, the cell density should be adjusted accordingly. It is also recommended that the peripheral wells of the 48-well plate be left blank or filled with 200 µL of sterile water to avoid edge effects.\nPerform half-medium change every 3−4 days by gently removing 100 µL of the medium from the top of each well and replacing it with 100 µL of 2x myeloid differentiation medium per well.\nOn day 21, harvest the cells for analysis of myeloid lineage marker expression by flow cytometry. Without disturbing the MS-5 layer, gently pipette the medium and transfer cells to a 5 mL tube.",
    "NOTE: For staining and flow cytometry analysis, cells from 1-2 wells are sufficient. Differentiation may also be monitored on days 1, 7, and 14. If performing immunophenotyping on multiple days, the numbers of wells needed for analysis should be calculated accordingly.\nStain 5 x 105 cells with antibodies to CD34 (APC-Cy7), CD66b (PE-Cy7), CD14 (PE), CD41 (PerCP-Cy5.5), and CD235a (APC) in a total volume of 50 µL. Incubate on ice in the dark for 20 min. Include unstained and single stained MNCs as controls for setting positive and negative gates for each fluorophore, and 7-AAD as a live/dead stain to eliminate dead cells from the analysis.\nWash and fix (optional) the stained cells as described above (steps 4.3-4.6).\nRe-suspend the cells in 500 µL of flow cytometry buffer and analyze by a flow cytometer.\n6. Assessment of Cellular Morphology\nClean microscope slides by spraying ethanol and wiping until squeaky.\nImmerse clean slides in poly-L-lysine solution for 5 min at RT and dry for 1 h at RT.\nResuspend the HSPCs from step 3.14 and differentiated cells from step 5.13 in 10 µL of flow cytometry buffer.\nTransfer the cell suspension to the coated slides and leave them to air-dry.\nNOTE: Slides from day 1 and day 21 can be stored at RT and stained simultaneously.\nPour 0.5 mL of the Wright-Giemsa stain on the slide and let stand for 3 min at RT.\nAdd equal volume of deionized water and let stand for additional 10 min at RT.\nWash the slide in deionized water.\nVisualize stained cells at a magnification of 60x or 100x by a microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}