{
  "id": 9621,
  "origin_website": "Jove",
  "title": "Brain Imaging Investigation of the Impairing Effect of Emotion on Cognition",
  "procedures": [
    "I. Task Design, Stimuli, and Experimental Protocol \nThe basic task of this protocol is a delayed-response WM task, where novel task-irrelevant emotional and neutral distracters are presented during the delay interval between the memoranda and probes (see Figure 1 for diagram illustrating the original task). Event-related fMRI data are recorded while participants perform this task. Scrambled versions of the actual distracters can also be used as perceptual controls, which have identical basic properties (e.g., spatial frequency and luminance). \nimgsrc://cloudfront.jove.com/files/ftp_upload/2434/2434fig1.jpg\nFigure 1. General Diagram of the Delayed-Response Working Memory Task with Distraction (from 6, with permission). Three faces are used in the memoranda in order to strongly engage the dorsal executive system, and pairs of novel distracters are used in order to increase the impact of emotional distraction on WM performance and brain activity. The impact of emotional distracters can also be increased by presenting the pictures in color (not shown), and by pairing distracters with similar emotional and semantic content. In this context, careful attention should be paid to also match emotional and neutral pictures in basic properties, such as brightness and spatial frequency 15, to avoid introducing possible confounds. Participants are instructed to maintain their focus on the WM task while still processing the distracters, and to make quick and accurate responses to the probes by pressing a response button (1 = Old, 2 = New). For stimulus presentation, we used CIGAL (http://www.nitrc.org/projects/cigal/[href=http://www.nitrc.org/projects/cigal/]). The memoranda and probes can be presented in color or black & white.",
    "It is advised that the sex of the faces in the memoranda has balanced proportions of males (50%) and females (50%). Similar balanced proportion is also advised for the Old (50%) and New (50%) probes. The difficulty of the WM task can be varied by changing these proportions and/or by varying other factors - e.g., the similarity of the facial features among faces from same memorandum and their similarity with the probes, and/or by manipulating the presence/absence of extra-facial features in the memoranda (see also the movie). In addition to faces, other stimuli can also be used as memoranda and probes 9. \n It is recommended that 30-40 trials per condition 6, 11 be used with this design, although given its stability as a \"slow-paced\" design robust fMRI signal can also be obtained with fewer trials (see Supplemental Materials from 6). This allows collection of fMRI data in ~1.5-2 hrs., which is feasible to use in both healthy and clinical participants. Despite its slight disadvantage due to the relatively lower number of trials that can be involved compared to \"fast-paced\" designs, this design has the advantages of obtaining more stable single-trial fMRI signal and better separation of the signal associated with individual trials and within trial stimuli/phases, which are also advantageous for functional connectivity analyses. \n Variation of the distracters type also contributes to the versatility of this design, by adapting it according to the goals of investigations and the targeted populations. Emotional and neutral distracters in the original design 6 were selected from the International Affective Picture System 16, but similar effects can be obtained with other novel stimuli that are effective as distracters 12, and/or with manipulations that increase the sensitivity of the WM task in detecting behavioral differences (e.g., by also assessing the participants' confidence in their responses) 11.",
    "For instance, in a recent study in post-war veterans with or without post-traumatic stress disorder (PTSD) 12, the emotional IAPS pictures inducing general negative emotions were replaced with combat-related pictures. These pictures were expected to induce emotions that are more specifically linked to combat-related traumas, and thus be more effective distracters in combat-exposed cohorts, particularly in the PTSD group. Moreover, stimuli that induce specific negative emotions (e.g., anxiety) or emotionally positive stimuli may also be used as distracters. For example, faces displaying fearful expressions could induce social anxiety, and thus be effective in investigating the impact of transient anxiety-inducing distraction on WM 11. Also, similar effects can be found with positive distracters 17. \n Finally, in conjunction with other measures (e.g., behavioral- and personality-related) this paradigm can also be used to investigate relationships between brain activity and individual differences in various aspects that affect cognitive performance in this task 8, 10, 11. \nII. Preparing the Subject for the Scan\nAll participants should provide written informed consent prior to running the experimental protocol, which should be approved by an Ethics Board.\nPrior to Entering the Scanning Room\n On the day of scanning, participant's current affective state is assessed, to control for the effect of mood on the WM task with distraction. In conjunction with post-scanning assessments, these initial evaluations can be also used to screen for changes in mood as a result of participating in the study 11. \n Prior to the scan, the participant is informed in detail of the scan procedures, and is given specific instructions for the behavioral task. The participant also completes a short practice session to familiarize with the task. \nEntering the Scanning Room",
    "The participant lies supine on the scanning bed, with additional cushioning for the head, to ensure comfort during the scan and minimize movement. To further minimize head movement, the non-adhesive side of a length of tape may be wrapped lightly around the subject's forehead. Subjects are given ear protection as well as isolation headphones to communicate with the experimenter during the MRI scan.\n The subject's right hand is positioned comfortably on the response box. Before starting data collection, it is critical to make sure that the response buttons work properly and that the subject can see the screen projection clearly for stimulus presentation. An emergency stop button is also placed nearby, so that the subject may indicate any urgent need to stop the scanner. \nFollowing the Scanning Session\n Additional tasks may be used for further behavioral assessments - e.g., to determine participants' sensitivity to the distracters, by rating the emotional valence/intensity of distracters and/or the subjectively perceived distractibility of the distracters. These ratings can be used to ensure that subjective perception of emotional stimuli used during scanning replicates previous effects shown in the literature, and individual differences in the ratings can be used to investigate their influence on the neural mechanisms mediating the detrimental effect of emotion on cognition 6, 8. \n Assessments of personality traits (e.g., trait anxiety, emotional reactivity) can also be made after the MRI scanning, if not performed prior to scanning 11. \nIII. Data Recording and Analysis\nScanning Parameters",
    "In the original study 6, we collected MRI data using a 4 Tesla General Electric scanner for MRI recordings, but for the more recent versions of the task we were also successful in collecting MRI data with a 1.5 T scanner 11. In the 4T scanner, series of 30 functional slices (voxel size = 4 x 4 x 4 mm) were acquired axially using an inverse-spiral pulse sequence (TR = 2000 ms; TE = 31 ms; field of view = 256 x 256mm), thus allowing for full-brain coverage. Similarly, in the 1.5 scanner, series of 28 functional slices (voxel size = 4 x 4 x 4 mm), were acquired axially using an echoplanar sequence (TR = 2000 ms; TE = 40 ms; field of view = 256 x 256 mm). High-resolution structural images were also acquired in axial orientation (in-plane resolution = 1 mm2; anatomical-functional ratio = 4:1).\nData Analysis",
    "We use Statistical Parametric Mapping (SPM: http://www.fil.ion.ucl.ac.uk/spm/[href=http://www.fil.ion.ucl.ac.uk/spm/]) in combination with in-house Matlab-based tools. Pre-processing involves typical steps: quality assurance*, TR alignment, motion correction, co-registration, normalization, and smoothing (using a 8 x 8 x 8 mm Kernel); *basic quality assurance involved visual inspection of the data, to detect gross movements of the participants and motion-related artefacts in the data, as well as identification of volumes with unusual spikes in the MR signal. Individual and group-level statistical analyses involve comparisons of brain activity according to distracter type (emotional vs. neutral distraction). Moreover, correlations of brain imaging data with subjective or objective measures of distractibility (e.g., emotional and distractibility ratings and working memory performance)6,8,11 and/or scores indexing personality measures (e.g., trait anxiety)11 can also be performed, to investigate how brain activity co-varies with individual differences in those measures. Analyses in all of our studies using this protocol have typically focused on activity observed during the delay interval, when the distracters are presented, but activity time-locked to other events (e.g., probes) can also be investigated.\nIV. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/2434/2434fig2.jpg",
    "Figure 2. Opposite Pattern of Activity in the Ventral vs. Dorsal Brain Systems in the Presence of Emotional Distraction (from 6, with permission). Emotional distracters produced enhanced activity in ventral affective brain regions (red blobs), such as the ventrolateral prefrontal cortex (vlPFC) and amygdala (not shown), while producing decreased activity in dorsal executive brain regions (blue blobs), such as dorsolateral prefrontal cortex (dlPFC) and lateral parietal cortex (LPC). The central image shows activation maps of the direct contrast between the most vs. the least distracting conditions (i.e., emotional vs. scrambled), superimposed on a high-resolution brain image displayed in a lateral view of the right hemisphere. The color horizontal bars at the bottom of the brain image indicate the gradient of t values of the activation maps. The line graphs show the time course of activity in representative dorsal and ventral brain regions (indicated by color-coded arrows). The grey rectangular boxes above the x-axes indicate the onset and duration of the memoranda, distracters, and probes, respectively. FFG = Fusiform Gyrus.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}