{
  "id": 19093,
  "origin_website": "Jove",
  "title": "An Orthotopic Bladder Tumor Model and the Evaluation of Intravesical saRNA Treatment",
  "procedures": [
    "Procedures involving animal subjects have been approved by the Institutional Animal Care and Use Committee (IACUC) at the University of California, San Francisco.\n1. Cell Preparation\n The human bladder cancer cell line KU-7-luc2-GFP (Caliper Life Sciences, Hopkinton, MA) is grown in RPMI-1640 media supplemented with 10% fetal bovine serum and 50 μg/ml gentamicin.    \n Cultures are maintained at 37 °C, 5% CO2 with media changes every two to three days. \n Cells were harvested by trypsin digestion and counted using a hemocytometer. A single cell suspension of 2 x 106 cells in 50 μl was prepared in phosphate buffered saline and kept on ice. \n2. Orthotopic Bladder Tumor Model\n Female nude (nu/nu) mice 8-10 weeks old (Simonsen Laboratory, Gilory, CA) were used.    \n Place a sterile drape over a heating pad to serve as a surgical platform. Sterile lubricating jelly, 24-guage catheters with stylet needles, silver nitrate solution, and sterile water are prepared. \n General anesthetic is induced in the mice with inhaled isoflurane (3% for induction, 1-2% for maintenance) and maintained via nosecone.  Sterile ophthalmic ointment is applied to the animal's eyes, and a heat pad is used to maintain body heat. \n Place the mouse in supine position.\n Gently grasp the animal's vulva with forceps for stabilization.",
    "Using a 24-guage intravenous catheter with the needle stylet removed, the mouse urethra is catheterized. Ample lubrication should be used. With the mouse supine, the urethra is located immediately posterior to the vulvar folds and anterior to the vagina. A 45-degree angle is initially taken in order to cannulate the urethra and pass beneath the pubic bone. A more shallow angle is then taken to pass through the urethra into the bladder. Gentle pelvic pressure to straighten the urethra can often help. Care must be taken to avoid pushing too hard against resistance, as this can lead to urethral or bladder perforation. Urine seen within the catheter confirms its location within the bladder lumen. \n Aspirate urine from the catheter and bladder lumen using the stylet needle. The stylet needle is used for all subsequent aspirations and injections, leaving the catheter in place. This allows for injection of accurate volumes by eliminating the dead-space within the catheter, and it makes repeated catheterizations unnecessary.\n To impair the glycosaminoglycan layer of the bladder urothelium, 10 μL of 0.5 M silver nitrate is injected and allowed to dwell for 10 seconds. This may form a white precipitate with remaining urine. \n Aspirate and discard the precipitate and bladder contents using a stylet needle. \n Wash the bladder by injecting 100 μL sterile water. Aspirate and discard the water.  Repeat wash with sterile water 3 times for a total of 4 washes.    \n Place a 4-0 silk tie around the urethral meatus to occlude the urethra in preparation for catheter removal. \n Inject previously prepared 2 x 106 KU-7-luc2-GFP cells in 50 μL using the stylet needle. \n Simultaneously remove the catheter and stylet needle, leaving the urethra occluded by the silk tie.",
    "The mouse will be maintained under general anesthetic for 2 hours before the silk tie is removed and the animal is awakened. \n3. Ultrasound \n General anesthetic is induced with vaporized isoflurane and maintained via nose cone.    \n A VisualSonics Vevo  770 In Vivo High-Resolution Micro-Imaging System (VisualSonics Inc, Toronto, Ontario, Canada) with the RMV-704 40 MHz probe was used.\n Place the mouse in supine position on the ultrasound platform. \n Secure the animal's hind legs with tape to avoid excess movement during manipulation of the ultrasound probe. \n Apply ultrasound gel to the mouse pelvis. \n Lower a RMV-704 (40 MHz) ultrasound probe onto the mouse pelvis to obtain transverse or longitudinal images. \n If tumor is found, images can be saved for measurement of tumor dimensions. \n4. Bioluminescent Imaging\n Perform intraperitoneal injection of 200 μL (150 mg/kg) luciferin substrate.    \n Induce general anesthetic with vaporized isoflurane and maintain via nose cone. \n Place mice in supine position within the bioluminescence imager. \n Five minutes after luciferin injection, measure the bioluminescence from the animal in photons per second. \n5. saRNA Preparation\n Synthesize RNA oligonucleotides at a scale of 50-100 μmol.    \n Anneal complementary single-stranded oligonucleotides into duplex saRNAs. \n Lipid-nanoparticle (LNP)-saRNA are prepared with the ionizable lipid 1,2-dilinoleyl-4-(2- dimethylaminoethyl)-[1,3]-dioxolane (DLinKC2-DMA), disteroylphosphatidyl choline, cholesterol, and PEG–DMG using a spontaneous vesicle formation formulation procedure as previously described.1 \n6. Intravesical Administration of Formulated saRNA\n After establishing the orthotopic bladder tumor model, mice are treated with intravesical small activating RNA (saRNA) formulated in lipid nanoparticles (LNPs) (Table 1).    \n General anesthetic is established and maintained with vaporized isoflurane, and sterile ophthalmic lubricant is applied.\n Place the animal in supine position. \n Perform urethral catheterization as previously described. \n Place a 4-0 silk tie around the urethra and catheter. \n Aspirate all urine from the catheter and bladder using an empty syringe and stylet needle.",
    "Inject LNP-saRNA intravesically for a total dose of 50 μL (3 mg/kg).  Simultaneously remove the catheter and stylet needle, leaving the urethra occluded by the silk tie.\n The mouse will remain anesthetized with the urethra occluded for 2 hours. \n Treatment with intravesical LNP-saRNA was begun on Day 4 after tumor implantation. Mice were treated serially, every 3 days, for a total of 14 treatments.\n7. Representative Results\nBladder tumors stemming from KU-7-luc2-GFP cells can be monitored by luciferase bioluminescent imaging (Figure 1A and C) and bladder ultrasound (Figure 1B and D).  Tumors are often detectable within 3-5 days after cell inoculation. We found successful bladder tumor implantation in over 90% of mice. As treatment with intravesical dsRNA ensues, the progression of tumor can be monitored with these modalities.  After the animal is sacrificed, tumor growth can also be confirmed using GFP fluorescence. In general, mean bioluminescence correlated with mean ultrasound dimensions for bladder tumors, as seen visually in Figures 1C and 1D. However, after animals were sacrificed and tumor was confirmed by GFP, we found that bioluminescence correlated more closely with the presence of viable tumor than did ultrasound measurements.  This was especially apparent among mice treated with saRNA (as opposed to controls) because residual scar tissue in treated mice was often visualized by ultrasound but could not be differentiated from live tumor. \nimgsrc://cloudfront.jove.com/files/ftp_upload/4207/4207fig1.jpg",
    "Figure 1.  Tumor growth kinetics of bladder tumors. (A) Bioluminescence imaging measures the luciferase activity within bladder tumors to confirm their location and growth. (B) In vivo bladder ultrasound using a 40MHz probe produces tumor images whose dimensions can be accurately measured. (C) Graphs illustrating the tumor's progressive increase in bioluminescence and ultrasound dimensions. Values represent mean (+/- standard deviation) measurements from 6 animals.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4207/4207fig1large.jpg].Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}