{
  "id": 17954,
  "origin_website": "Jove",
  "title": "Paper-Based Preconcentration and Isolation of Microvesicles and Exosomes",
  "procedures": [
    "1. Device fabrication\nDefine the region to be printed on paper using printer software (Table of Materials).\n\tNOTE: The design has 12 wax-patterned layers in which the diameters of the circular sample areas gradually narrow from 5 mm to 2 mm (Figure 1A).\nPrint hydrophobic wax on the designated regions on both sides of the cellulose paper (Table of Materials) using a commercial wax printer (Table of Materials) (Figure 1B).\nPlace the wax-printed paper in a laboratory oven for 80 s at 120 °C.\n\tNOTE: This step allows the wax to reach the inside of the paper by achieving a thermal reflow of the printed wax. With this incubation protocol, the resolution of the pattern is ~2 mm. Thus, be careful not to print patterns of less than 2 mm. Otherwise the patterns will be blocked by the wax.\nCut the wax-printed paper with a cutter to make individual devices (Figure 1C).\nDrop 5 μL and 2 μL of permselective membrane (e.g., Nafion; Table of Materials) onto the sample areas in the leftmost and rightmost layers, respectively (Figure 1D).\nPlace the layers coated with the permselective membrane on a hot plate at 70 °C for 30 min to evaporate the permselective membrane solvent.\nSeal the outermost surface of the coated layer facing the buffer solution with pressure-sensitive tape, leaving a small hole.\nFold the printed individual device (i.e., Exo-PAD) back and forth along the white lines.\n\tNOTE: By folding the device, all sample areas become convergently connected (Figure 1E). This convergent design focuses the electric field lines when the voltage is applied for ICP, achieving more intensive preconcentration of the microvesicles and exosomes.\n2. Enrichment and spatial focusing of microvesicles and exosomes by ion concentration polarization",
    "Load 15 μL of the microvesicle and exosome sample (~3 x 1011 particles/mL in 0.1x phosphate buffered saline [PBS] with 0.05% Tween 20) in the convergent sample areas by pipetting and wait a few seconds to ensure complete wetting of all sample areas (Figure 1F).\nPlace two acrylic chambers at both ends of the Exo-PAD and clamp the Exo-PAD securely with small binder clips to prevent unfolding (Figure 1G).\nFill the chambers with 110 μL of 0.1x PBS and insert two Ag/AgCl electrodes (Figure 1H).\nApply 30 V to the electrodes for 20 min using a current-voltage source measurement system (Table of Materials).\n\tNOTE: The applied voltage generates the ICP phenomenon and hence preconcentrates the microvesicles and exosomes on layers 8 and 9 of the Exo-PAD.\n3. Isolation of the enriched microvesicles and exosomes\nSeparate the folded Exo-PAD from the acrylic chambers and unfold the device to isolate the enriched microvesicles and exosomes from the other layers (Figure 1I).\nPunch out the sample areas in layers 8 and 9, where the microvesicles and exosomes are enriched, for downstream analysis (Figure 1J).\n4. Scanning electron microscopy analysis\nFix the enriched microvesicles and exosomes by immersing the punched areas in 2.5% glutaraldehyde in 0.1 M sodium cacodylate buffer for 1 h and in 1% osmium tetroxide in 0.1 M sodium cacodylate for 1 h.\n\tCAUTION: Osmium tetroxide is highly poisonous and hazardous chemical. Because osmium tetroxide can penetrate plastics, it must be stored in glass. Any handling of osmium tetroxide must be performed in a chemical fume hood with double nitrile gloves.\nDehydrate the fixed microvesicles and exosomes with ascending grades of 200 proof ethanol (i.e., 50%, 70%, 90%, and 100%) for 30 min each.\nChemically dry the sample by immersing it in hexamethyldisilazane in a desiccator for 30 min.",
    "CAUTION: Hexamethyldisilazane is a flammable and moisture-sensitive chemical. It must be stored in a dry and well-ventilated area away from ignition sources.\nCoat the completely dried microvesicles and exosomes with gold/palladium (~20 nm) via sputtering and capture scanning electron microscopy (SEM) images.\n5. Nanoparticle tracking analysis\nPunch out the sample areas in layers 6, 8, and 10 using a biopsy punch after 20 min of device operation.\nImmerse each punched-out area in buffer solution (0.1x PBS with 0.01% Tween 20).\nVortex for 10 min and centrifuge for 30 s at 6,000 rpm to resuspend the enriched microvesicles and exosomes.\nRemove the punched-out areas from the solution and measure the concentration of microvesicles and exosomes by a nanoparticle tracking analysis (NTA) instrument (Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}