{
  "id": 16054,
  "origin_website": "Jove",
  "title": "Deciphering Molecular Mechanism of Histone Assembly by DNA Curtain Technique",
  "procedures": [
    "1. Preparation of the flow cell\nPrepare a cleaned fused silica slide containing nano-trench patterns following previously published report25.\n\t\nDrill two holes with 1 mm diameter in a cleaned fused silica slide (Figure 1A) using a diamond-coated drill bit (see Table of Materials).\nDeposit 250 nm of thick aluminum (Al) on the slide using DC sputter32 (see Table of Materials) with 10 mTorr of argon gas.\nSpin-coat a 310 nm thick layer of 4% 950K poly(methyl methacrylate) (PMMA) (see Table of Materials) at 4,000 rpm for 1 min and bake on a hot plate at 180 °C for 3 min.\nDraw the nano-trench patterns on the PMMA layer between the two holes using electron beam (ebeam) lithography33 with 0.724 nA current at 80 kV.\n\t\tNOTE: The architecture and the dimensions of the nano-trench patterns are shown in Figure 1A.\nRemove the ebeam-exposed PMMA by soaking the slides in the developing solution (1:3 ratio of methyl isobutyl ketone and isopropanol, see Table of Materials) for 2 min.\nEtch Al layers with inductively coupled plasma-reactive ion etching (ICP-RIE) using chlorine (Cl2) and boron trichloride (BCl3) gases.\n\t\tNOTE: These two gases can remove the Al from ebeam-exposed areas.\nCarve nano-trenches on the slides using sulfur tetrafluoride (SF4), tetrafluoromethane (CF4), and oxygen (O2) gases (see Table of Materials).\nRemove the remaining Al layer by soaking the slides in Al etchant (AZ 300 MIF developer, see Table of Materials) for 10 min.\nAfter fabrication, rinse the slides with deionized water and sonicate in acetone for 30 min using a bath-type sonicator.\nClean the slides in 2% Hellmanex III solution (see Table of Materials) for at least 1 day with magnetic stirring.\nSonicate the slides in acetone for 30 min and 1 M NaOH for 30 min successively.",
    "Rinse the slides with deionized water and dry with a nitrogen (N2) gas.\nPut a clean paper (5 mm x 35 mm) on the center of double-sided tape. Attach the tape over the slide to cover the two holes and the nano-patterns with the paper.\nExcise the paper using a clean blade (Figure 1A).\nPut a glass coverslip on top of the double-sided tape and rub the coverslip using a pipette tip to form a microfluidic chamber (Figure 1A).\nPlace the assembled flow cell between two microscope slides and clip them.\nBake the flow cell in a 120 °C vacuum oven for 45 min.\nAttach the fluid connector (Nanoport) for the chip-based analyses (see Table of Materials) to each open hole using a hot glue gun and connect the two lines of Luer lock tubing.\nConnect a Luer lock syringe containing 3 mL of deionized water and wash the chamber.\nWash the chamber with 3 mL of lipid buffer (20 mM of Tris-HCl, pH 8.0, and 100 mM of NaCl) via the drop-by-drop connection.\n\tNOTE: Drop-by-drop connection links all syringes to the flow cell to avoid injecting air bubbles into the chamber.\nInject 1 mL of 0.04x biotinylated lipid in lipid buffer into the chamber in two shots with 5 min incubation per shot.\n\tNOTE: Preparation of 1x biotinylated lipid stock is described in a previously published report34.\nWash the chamber with 3 mL of lipid buffer and incubate for 20 min for the lipid bilayer to be matured on the slide surface.\nAdd 1 mL of BSA buffer (40 mM of Tris-HCl, pH 8.0, 50 mM of NaCl, 2 mM of MgCl2, and 0.2 mg/mL of BSA) and incubate for 5 min to passivate the slide surface.",
    "NOTE: This step can reduce the nonspecific binding of proteins to the slide surface.\nInject 0.025 mg/mL of streptavidin in 1 mL of BSA buffer with two shots and 10 min incubation per shot.\nWash out the residual streptavidin with 3 mL of BSA buffer.\nInject ~300 pM (30 µL) of biotinylated lambda phage DNA in 1 mL of BSA buffer into the chamber with two shots and 10 min incubation per shot.\n\t​NOTE: Preparation of biotinylated lambda DNA is described in a previously published report34.\n2. Connecting flow cell to the microfluidic system and loading it onto the microscope\nPrepare Abo1 imaging buffer (50 mM of Tris-HCl, pH 8.0, 100 mM of NaCl, 1 mM of DTT, 1 mM of ATP, 2 mM of MgCl2, 1.6% glucose, and 0.1x of gloxy, see Table of Materials).\n\tNOTE: Gloxy is an oxygen scavenging system that reduces the photobleaching of fluorescent dyes. Preparation of 100x gloxy stock with glucose oxidase and catalase is described in Reference35.\nConnect a syringe containing 10 mL of imaging buffer to a syringe pump and remove bubbles in all tubing lines in the microfluidic system.\nCouple the prepared flow cell with the microfluidic system via drop-to-drop connection to avoid bubble injection into the flow cell (Figure 1B).\nAssemble the flow cell and flow cell holders and mount the assembly on a custom-built TIRF microscope (Figure 1C).\n\tCAUTION: When the flow cell is put under the microscope, carefully set the height of the objective lens. The flow cell must not touch the objective lens. This can damage the lens.\nDrop index matching oil on the center of the flow cell and put a custom-made dove prism (see Table of Materials) on the oil drop.\n3. Histone assembly by Abo1 using DNA curtain",
    "Mix 5 nM of Abo1 and 12.5 nM of Cy5-labeled H3-H4 histone dimer (Cy5-H3-H4) (see Table of Materials) in 150 µL of imaging buffer. All proteins were prepared following previously published report17.\nIncubate the mixture on ice for 15 min.\n\tNOTE: To avoid photobleaching of Cy5, the incubation must be done in the dark.\nInject ~20 pM (2 µL) of YOYO-1 dye in imaging buffer through a 100 µL of sample loop to stain lambda DNA molecules.\nRun imaging software (see Table of Materials) and turn on the 488 nm laser to check whether DNA curtains are well-formed.\n\tNOTE: If DNA curtains are well-formed, the DNA molecules, which are stained with YOYO-1, are shown as aligned lines at a barrier in the presence of flow. The stretched lines recoil and diffuse away from the barrier when the flow is turned off.\nInject 2 mL of high salt buffer (200 mM of NaCl and 40 mM of MgCl2) to eliminate YOYO-1 dye from DNA.\nAfter YOYO-1 dye has been removed, inject the pre-incubated protein sample.\nWhen the proteins reach the DNA curtain, turn off the syringe pump, switch off the shut-off valve, and incubate 15 min for histone loading by Abo1.\nWash out the unbound Abo1 and histone proteins for 5 min.\nSwitch on the shut-off valve and resume the flow injection.\nTurn on the 637 nm laser and image the fluorescent proteins while the buffer flow is on.\nTransiently turn off the buffer flow to check if histone proteins are loaded onto DNA (Figure 2C).\nCollect DNA curtain images with an image acquisition program (see Table of Materials).\n\t​NOTE: When the buffer flow transiently stops, DNA recoils out of the evanescent field of total internal reflection, and fluorescently labeled proteins bound to DNA disappear.\n4. Data analysis",
    "Transform the images taken by the image acquisition program into TIFF format as image sequences.\n\tNOTE: All data were analyzed using Image J (NIH) as described in the Reference20.\nPick a single DNA molecule from the image sequences and draw a kymograph.\n\tNOTE: The kymograph can show the change in fluorescence intensity of each histone protein bound to a single DNA molecule as a function of time.\nCreate the fluorescence intensity profile from the kymograph and fit it with multiple Gaussian functions.\nCollect the center coordinates of peaks from the fluorescence intensity profile. In this step, the minimum intensity of histone fluorescence can be obtained.\nDivide all peak intensities collected from the profiles by minimum intensity. The number of H3-H4 dimers bound to DNA is estimated in this step.\nPerform steps 4.2-4.5 for other DNA molecules.\nCreate a histogram for the binding distribution of H3-H4 dimers with 1 kbp bin size. The number of analyzed molecules is at least 300.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}