{
  "id": 13038,
  "origin_website": "Jove",
  "title": "Targeted Microinjection and Electroporation of Primate Cerebral Organoids for Genetic Modification",
  "procedures": [
    "1. Culture of primate iPSCs\nNOTE: Due to its robustness, the method presented here can be applied to any primate iPSC line. In this article, we describe cerebral organoid production from human (iLonza2.2)29, chimpanzee (Sandra A)30, rhesus macaque (iRh33.1)29, and common marmoset (cj_160419_5)31 iPSC lines. The culture conditions are summarized in Table 1. See the Table of Materials for details related to all the materials, reagents, and equipment used in this protocol.\nFor culturing the respective iPSCs, follow the originally described culture conditions. In general, for the successful generation and electroporation of cerebral organoids, use iPSC lines that have not been cultured for more than 90 passages. Additionally, at the start of cerebral organoid generation, ensure that iPSCs exhibit features of pluripotency with no signs of differentiation.\n2. Generation of cerebral organoids from primate iPSCs\nNOTE: The protocol for cerebral organoid generation is based on a modified version28,30,32,33 of the original cerebral organoid protocol10,34 with some species-specific modifications (detailed below).\nSeeding of iPSCs to generate embryoid bodies (EBs)\n\t\nOnce the iPSCs have reached 80%-90% confluency, wash them with Dulbecco's phosphate-buffered saline (DPBS), and add 500 µL of recombinant trypsin substitute or 1 mL of proteolytic and collagenolytic mixture.\n\t\tNOTE: Typically, iPSCs are cultured in a 60 mm cell culture dish to obtain approximately 900,000 cells, which is enough to generate 96 cerebral organoids. The cell numbers can be adjusted depending on the number of organoids needed. Be aware that not all the generated cerebral organoids might be suitable for electroporation.\nIncubate the dish at 37 °C for 2 min to detach the cells.",
    "NOTE: Up to an additional 2 min of incubation at 37 °C might be needed depending on the iPSC line or enzyme used. It is advised to examine the dish under a microscope to ensure that the cells have started detaching.\nAdd 1.5 mL of prewarmed (37 °C) iPSC culture medium to stop the reaction, and pipette up and down 7x-10x (not more than 10x) to dissociate the cells from the cell culture dish and to obtain a single-cell suspension.\nTransfer the cell suspension to a 15 mL conical centrifuge tube, and centrifuge the cells at 200 × g for 5 min at room temperature.\nAspirate the supernatant, and resuspend the pellet in 2 mL of iPSC culture medium supplemented with either 50 µM Y27632 or 50 µM pro-survival compound.\nUse 10 µL of the cell suspension to count the cells using a Neubauer chamber.\nAdjust the cell suspension to a concentration of 9,000 cells per 150 µL (60,000 cells/mL) using iPSC culture medium supplemented with 50 µM Y27632 or 50 µM pro-survival compound.\nTo generate embryoid bodies (EBs), seed 150 µL of the cell suspension into each well of an ultra-low attachment 96-well plate. While pipetting, gently shake the tube containing the cell suspension to prevent the cells from sedimenting.\nCulture the EBs in a humified atmosphere of 5% CO2 and 95% air at 37 °C (0 days post seeding [dps]). Do not disturb the EBs within the first 24 h after seeding.\n\t\tNOTE: EBs generated from marmoset iPSCs need to be cultured in a humified atmosphere under hypoxic conditions (5% CO2, 5% O2, and 90% N2) at 37 °C.",
    "After ~48 h (2 dps), change the medium to iPSC culture medium without Y27632/pro-survival compound. Remove 100 µL of medium per well, and add 150 µL of prewarmed (37 °C) fresh medium without Y27632. Go row by row.\nPerform further medium changes every other day; remove 150 µL of medium from each well, and add 150 µL of prewarmed (37 °C) fresh medium without Y27632/pro-survival compound per well.\n\t\tNOTE: After 4-5 dps, the periphery of the EBs should become translucent.\nInduction of neuroectoderm\n\tNOTE: In general, good-quality EBs should have smooth contours and translucent borders at this stage. The time points of neural induction slightly differ between primate species and iPSC lines. In the case of the cell lines used here (see section 1 and Table of Materials), neural induction for marmoset EBs usually needs to be started at 4 dps, for rhesus macaque at 5 dps, and for human and chimpanzee EBs at 4-5 dps (Figure 1A), depending on the state of the EBs (see above).\n\t\nRemove 150 µL of medium from each well of the first row of the 96-well plate, and add 150 µL of prewarmed (37 °C) neural induction medium (see Table 2) per well in the same row.\nContinue changing the medium as described above row by row for the whole 96-well plate. Perform further neural induction medium (NIM) changes every other day by removing 150 µL of NIM from each well and adding 150 µL of prewarmed (37 °C) fresh NIM.\n\t\tNOTE: From this point on, the marmoset EBs should be cultured under the same conditions as the other primate EBs (humified atmosphere of 5% CO2 and 95% air at 37 °C).\nEmbedding in basement membrane matrix",
    "NOTE: Once the EBs have developed a pronounced, translucent, radially organized neuroepithelium on the surface, structural support needs to be provided for the development of ventricle-like structures. This is achieved by embedding the EBs into a basement membrane matrix. Due to differences in development rates, marmoset and rhesus macaque EBs are ready for embedding already at 7 dps, while human and chimpanzee EBs are usually embedded at 8-9 dps. For simplicity, basement membrane matrix refers only to Matrigel in this protocol. However, Geltrex can be used as a replacement.\n\t\nIn preparation for embedding, UV-sterilize scissors, forceps, a small rack for 0.2 mL tubes, and three to six squares of parafilm treated with 70% (vol/vol) ethanol under the laminar flow hood for 15 min. Let the basement membrane matrix thaw on ice for several hours (~1.5 mL of basement membrane matrix is usually enough for 96 EBs).\n\t\tNOTE: Always keep the basement membrane matrix on ice.\nCreate a 4 x 4 dimple grid on the parafilm. Place the parafilm grid on the 0.2 mL tube rack so that the paper-enveloped side is facing up, and gently press a gloved finger against each hole of the rack.\nRemove the paper, and cut the dimple grid out of the parafilm square using scissors to adjust its size to fit into a 60 mm cell culture dish. Place the dimpled parafilm back on the 0.2 mL tube rack to provide a basis for the basement membrane matrix droplet generation.\nUsing a pipette with a cut 200 µL pipette tip, carefully transfer the EBs one after another from the well of the culture dish to the parafilm dimples.\nAfter moving 16 EBs to the grid, take a new 200 µL pipette tip, and remove the remaining medium from the dimples.",
    "Pipette one drop (~15 µL) of basement membrane matrix onto each dimple containing one EB.\nTake a 10 µL pipette tip and quickly move the EBs into the center of each droplet without disturbing the droplet borders.\nPlace the dimpled parafilm with the basement membrane matrix drops in a 60 mm cell culture dish, and incubate for 15-30 min at 37 °C to allow the matrix to polymerize.\nTo detach the matrix-embedded EBs from the parafilm, add 5 mL of differentiation medium (DM) without vitamin A (see Table 2) to the dish, and turn the parafilm square upside-down using forceps so that the side with the EBs is facing the bottom of the dish.\nCarefully shake the dish to make the basement membrane matrix drops containing the EBs detach from the parafilm. If some of them are still attached, take an edge of the parafilm square using forceps, and rapidly roll it up toward the center of the dish multiple times.\nCulture the cerebral organoids on an orbital shaker at 55 rpm in a humified atmosphere of 5% CO2 and 95% air at 37 °C. Keep them in DM without vitamin A with medium changes every other day. To induce the production of neurons, switch to DM with vitamin A (retinoic acid, RA) after 13 dps for marmoset and rhesus macaque cerebral organoids or 14-15 dps for human and chimpanzee cerebral organoids (Figure 1A). From this point on, change the medium every 3-4 days.\n\t\tNOTE: To support neuronal survival, DM with vitamin A can be supplemented with 20 µg/mL human neurotrophin 3 (NT3), 20 µg/mL brain-derived neurotrophic factor (BDNF), and 1 µL/mL basement membrane matrix from 40 dps on.\n3. Electroporation of primate cerebral organoids",
    "NOTE: From a technical point of view, the electroporation of cerebral organoids can be conducted as soon as the ventricle-like structures are pronounced enough to be targeted by microinjection. The optimal electroporation time window depends on the biological question and on the cell population(s) of interest. For example, if apical progenitors (APs) are the main target, then cerebral organoids at around 30 dps are already suitable. If basal progenitors (BPs) or neurons are the main targets, older cerebral organoids of more than 50 dps should be used (see, for example, Fischer et al.28).\nPreparation of the electroporation setup\n\tNOTE: The electroporation efficiency is strongly affected by the size and the concentration of the electroporated plasmid(s) (see the discussion section for details).\n\t\nPrepare a sufficient amount of electroporation mix for the control and gene of interest (GOI), for example, 10 µL of electroporation mix for each control and GOI to electroporate approximately 30 cerebral organoids per condition.\n\t\tNOTE: For the composition of the electroporation mixes, see Table 3.\nPrewarm (non-sterile) Dulbecco's modified Eagle medium/nutrient mixture F-12 (DMEM/F12) and DM with vitamin A to 37 °C. Prepare a small spatula and fine and normal scissors, and spray the instruments with 70% (vol/vol) ethanol.\n\t\tNOTE: The following steps can be performed either under sterile or non-sterile conditions as the DM contains antibiotics (see Table 2). In our experience, the absence of sterility has never caused any contamination.\nPrepare 35 mm cell culture dishes, and connect the Petri dish electrode chamber to the electroporator.\n\t\tNOTE: Petri dish electrode chambers are commercially available. However, they can be easily produced in a cost-efficient way (see Supplemental File 1).",
    "Using microloader tips, fill microinjection needles with 8 µL of each electroporation mix. Cut the tips of the needles using fine scissors before the first use to achieve a stable flow. However, remove only a small part of the tip, as a blunt and wide tip can severely damage the organoids.\n\t\tNOTE: Microinjection needles are either commercially available as pre-pulled microinjection needles or can be pulled in the lab if a needle puller is available. Follow the needle puller manufacturer's instructions to generate microinjection needles with a long taper and a 10 µm tip diameter.\nMicroinjection and electroporation\n\t\nUnder a microscope, choose five cerebral organoids with smooth borders and clearly visible ventricle-like structures. Move them to a 35 mm cell culture dish containing prewarmed (37 °C) DMEM/F12 using a cut 1,000 µL pipette tip.\n\t\tNOTE: Choose cerebral organoids with pronounced and accessible ventricle-like structures (see Figure 1B).\nTo inject a ventricle-like structure, carefully insert the needle through its wall, and infuse it with the electroporation mix until visibly filled. Do not apply excessive pressure on ventricle-like structures to avoid them bursting. Proceed with six to eight ventricle-like structures of each cerebral organoid in this manner.\n\t\tNOTE: If the needle becomes clogged during the microinjection process, the tip needs to be slightly trimmed.\nTransfer one microinjected cerebral organoid to the Petri dish electrode chamber with a small amount of DMEM/F12. Arrange the organoid in a way that the surfaces of the microinjected ventricle-like structures face toward the electrode connected to the positive pole of the electroporator.\n\t\tNOTE: Orienting the structures in this way ensures that the cells are transfected on the side of the ventricle-like structure that is not affected by an adjacent structure.",
    "Electroporate the cerebral organoids one by one using the following settings: 5 pulses of 80 V, a pulse duration of 50 ms, and an interval of 1 s. Move the electroporated organoids to a new 35 mm cell culture dish filled with prewarmed (37 °C) DMEM/F12.\n\t\tNOTE: The electroporation settings might depend on the available square wave electroporator. These settings are optimized for the referenced electroporation system. Increasing the voltage can lead to the displacement of the cells.\nProceed in the same manner with the next five cerebral organoids using the second electroporation mix (for example, GOI).\n\t\tNOTE: Repeat steps 3.2.1-3.2.5 until the desired number of electroporated cerebral organoids is reached.\nIf the microinjection and electroporation were conducted under non-sterile conditions, transfer the electroporated organoids to a sterile 35 mm cell culture dish under a laminar flow hood while moving as little DMEM/F12 as possible to the new cell culture dish.\nFurther culture and fixation of cerebral organoids\n\t\nCulture the electroporated organoids in DM with vitamin A on an orbital shaker at 55 rpm in a humified atmosphere of 5% CO2 and 95% air at 37 °C.\nOn the next day after electroporation, check the cerebral organoids for successful electroporation under a conventional inverted fluorescence microscope.\n\t\tNOTE: Depending on the length of the further culture after electroporation, different cell populations within the cerebral organoid are affected (see also the representative results section).\nProceed with downstream applications after culturing the electroporated cerebral organoids for an amount of time suitable for the biological question of interest.\n\t\tNOTE: Electroporated cerebral organoids can be processed for different downstream applications (e.g., fixation for immunofluorescence staining or snap-frozen for RNA isolation and qRT-PCR). Here, we describe the fixation of electroporated cerebral organoids.",
    "Transfer the electroporated organoids to a 15 mL conical centrifuge tube using a cut 1,000 µl pipette tip, and remove excess medium.\nAdd a sufficient amount of 4% paraformaldehyde (PFA) in DPBS (pH 7.5), and incubate for 30 min at room temperature.\n\t\tCAUTION: PFA is classified as a human carcinogen and may cause irreparable health damage. Additional precaution measures including nitrile gloves and goggles are strongly recommended.\nAspirate the PFA, add 5 mL of DPBS, shake a little, and aspirate the DPBS. Repeat this 2x. Store the organoids in DPBS at 4 °C until further use.\n\t\tNOTE: The protocol can be paused here, as PFA-fixed cerebral organoids can be stored at 4 °C for several months. PFA-fixed electroporated organoids can be analyzed by cryosectioning and immunofluorescence staining10,28 or by whole-mount staining and clearing35,36. For example images, see the representative results section (see Table 4 for antibody details).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}