{
  "id": 6631,
  "origin_website": "Bio",
  "title": "Intracerebral Injection of Streptozotocin to Model Alzheimer Disease in Rats ",
  "procedures": [
    "Surgery setupSterilize all the surgical tools.Prepare the citrate buffer as described in “Recipes”.In a dedicated surgery room, place all the materials and equipment to be used in the surgery.Measure and take note of the body mass of each rat.In microcentrifuge tubes, individually weigh the amount of STZ needed for each rat based on its body mass. For example, for a 350 g rat, weigh 1.05 mg of STZ which later will be diluted in 6 µl of citrate buffer. Although only a total of 4 µl of this solution will be injected (2 µl per lateral ventricle), which will correspond to a dose of 2 mg/kg, we recommended preparing a larger volume of solution.Note: STZ is health hazard and personal protective equipment is required. The STZ solution has a very short half-life (15-30 min) and is unstable. Solutions should be prepared fresh before use. Cover the microcentrifuge tubes with aluminum foil to protect STZ from light.Number each microcentrifuge tube with STZ with the corresponding rat’s identification number.Keep the microcentrifuge tube with STZ at -20 °C. Prepare the microinjection system. For this, cut the 24 G intravenous catheter using a drill to make a 15 mm longer STZ-injection needle. Connect the STZ-injection needle to the end of the PE-10 tubing (40 cm longer). Fill the PE-10 tubing with water for injection and connect the other end to a 10 µl Microsyringe coupled to an infusion pump.Note: Always make sure the microinjection system is not clogged. Set the infusion pump to run at 1 µl/min rate. Icv injection of STZ (see Figures 2 and 3)Note: Surgery should be performed under sterile conditions. We recommend lubricating the eyes of the rat with saline or eye drops during surgery.",
    "Anesthetize the rat with an association of ketamine (90 mg/kg) and xylazine (10 mg/kg), both administered intraperitoneally using 25 G needles and 1 ml syringe. Note: It is important to assure that the rat is completely anesthetized and not responsive to a possible painful stimulus. You can check the responsiveness of the rat by pressing the tip of its tail or the sole of its posterior paws. If the rat presents any reaction after 5 min of the injection, the ketamine has to be reinforced up to 50% of the initial dose.  Place the rat in the stereotaxic apparatus over the heating pad and maintain rectal temperature around 37 °C. Administer the pentabiotic (48,000 UI, intramuscular) and the ketoprofen (5 mg/kg, subcutaneous), using the 22 G and 25 G needles, respectively, and 1 ml syringe.Shear the dorsal region of the head and clean the area designated for the procedure with the povidone-iodine alcoholic solution.Note: Be very careful not to shave the vibrissae. Using the tissue forceps and the scissors, incise the scalp over the sagittal suture (approximately 2 cm long) and excise the periosteum to expose the skull. Use the Molt elevator to help in this process.Note: Optionally, local anesthetic consisting of 2% lidocaine and epinephrine (1: 200,000) can be injected subcutaneously approximately 1 min before the incision to reduce bleeding. Stereotaxic icv-injections are made with bregma and lambda on the same horizontal plane. For this, check the dorsoventral axis of lambda and bregma. A difference in the lambda and bregma dorsoventral axis under 0.2 mm indicates a correct position of the rat’s head.",
    "Drill two small holes in the skull, just large enough to allow the STZ-injection needle to cross through it and penetrate the brain surface, following the coordinates measured from the bregma, to reach the lateral ventricles: -0.8 mm in the anteroposterior axis, ±1.4 mm in the mediolateral axis and -3.6 mm in the dorsoventral axis (Paxinos et al., 2005).Using a micropipette, add the citrate buffer to the STZ previously weighted in a microcentrifuge tube and homogenize it drawing the solution in and dispensing it in the microcentrifuge tube a couple of times. Note: It is expected that the STZ solution presents a slightly yellow color and few bubbles can be observed due to NO release. STZ solutions should be prepared fresh before use.  Aspirate 1 µl of air and then aspirate the STZ solution using the STZ-injection needle previously placed in the arm of the stereotaxic device, which is connected to an automated microinjection system. The 1 µl of air is to create a bubble between the STZ solution and the water that is filling the PE-10 tubing.Lower slowly the STZ-injection needle inside the rat brain, passing through one of the skull holes, following the lateral ventricle coordinates.Initiate the icv-STZ injection by activating the infusion pump at a rate of 1 µl/min for 2 min. Thus, 2 µl of STZ solution should be injected in each lateral ventricle.Note: Monitor the flow of the injection through the bubble path along the PE-10 tube. At the end of injection, wait 2 min to withdraw the STZ-injection needle from the lateral ventricle of the brain in order to prevent the reflux of the STZ solution. Repeat the same procedure to the other lateral ventricle of the brain.At the end of STZ injection in both lateral ventricles of the brain, suture the skin.",
    "For control rats, inject 2 µl of citrate buffer, instead of the STZ, in each lateral ventricle of the brain, exactly as described in Steps B9-B14. Note: For citrate buffer injection, use a different injection needle and PE-10 tubing from that used for STZ injection. Administer 3 ml of saline subcutaneously to rehydrate the rat.Allow the rat to recovery in an individual cage for at least 3 days. Note: The rat should be under constant observation until its recovery from anesthesia (approximately one hour) and for the following first-week post-surgery. Physiological parameters should be evaluated daily, such as body mass, food, and water intake, as well as behaviors associated with pain and discomfort. If necessary, supplementary feeding, and additional analgesic, anti-inflammatory, and antibiotic medication can be administered under the recommendation of the veterinarian in charge. Rats suffering irreversible conditions of pain and weight loss should be euthanized. Icv-STZ injected rats may have more difficult to recover from the surgery compared to control rats. Return the rat to the colony.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015191336_4347.jpgFigure 2. Setup for the injection procedure. A. Main equipment and tools used for the STZ-injection surgery. B. Microinjection system: infusion pump with a microsyringe connected to one end of a PE-10 tubing. C. Stereotaxic apparatus (lateral view) with the STZ-injection needle connected to another end of the PE-10 tubing, as indicated by arrows. D. Surgical tools and dental drill.Evaluation of the cognitive performance of the rats Note: As AD is characterized in human mainly for their multiple cognitive deficits, to guarantee that the AD animal model mimics most of the aspects of the disease, cognitive testing is essential to detect memory deficits of the animals.",
    "For the STZ-model described here, we recommend that behavioral tests be carried out only after surgery full recovery, when animals reach similar body weight values compared to the day before the surgery and present a completely healthy state (approximately one week after surgery).Depending on the cognitive tests used, early deficits can be observed but most of the studies generally perform the behavioral and histopathological analysis one month after surgery, when most of the mimicked aspects of AD can be observed, such as the accumulation of phosphorylated tau protein and ventricle enlargement (Knezovic et al., 2015; Moreira-Silva et al., 2018). In this AD model, several types of memory deficits can be evaluated by using the following tasks: the Barnes’ maze, object displacement and the Morris’ water maze for spatial memory; radial and Y-maze for working memory; inhibitory avoidance, escape latency in the elevated plus maze and fear conditioning for emotional memory and new object recognition for recognition memory. The full description of some behavioral tasks can be found in previous studies published by our group (Moreira-Silva et al., 2018, for new object recognition, fear conditioning and escape latency in the elevated plus maze and Motzko-Soares et al., 2018, for Barnes’ and Y-maze). Also, histopathological and molecular analyses of the presence of AD biomarkers induced by icv-STZ injection were described previously by our research group (Moreira-Silva et al., 2018, Motzko-Soares et al., 2018). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015191323_9805.jpgFigure 3. Schematics of the setup for the injection procedure (A) and top view of the rats’ head in the stereotaxic apparatus (B). In B, the reddish indicates the sheared area in the rats’ head. The two brown points posterior to the bregma indicates the approximate position of the holes drilled for the insertion of the icv injection needle."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}