{
  "id": 10728,
  "origin_website": "Jove",
  "title": "Rapid Mix Preparation of Bioinspired Nanoscale Hydroxyapatite for Biomedical Applications",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/55343/55343fig1.jpg\nFigure 1. Schematic diagram of rapid mix preparation of bioinspired nanoscale hydroxyapatite. The phosphoric acid solution was poured into the calcium hydroxide suspension. After the suspension settled overnight, the nHA was washed with deionized water before being dried at 60 to 80°C. The nHA was then ground in an agate mortar and pestle and sintered to investigate the thermal stability of the nHA product. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55343/55343fig1large.jpg]\n1. Rapid Mix Production of Nanoscale Hydroxyapatite\nPreparation of calcium and phosphorus solutions to prepare 5 g of nanoscale hydroxyapatite using a calcium to phosphorus molar ratio of 1.67.\n\t\nAdd 3.705 g of calcium hydroxide to 500 mL deionized water and stir on a magnetic stirrer plate for 1 h at 400 rpm.\nIn a separate beaker, dissolve 3.459 g of phosphoric acid (85%) in 250 mL deionized water.\nPour the phosphorus solution into the stirring calcium hydroxide suspension at a rate of approximately 100 mL/s. Cover beaker with Parafilm (Bemis, USA).\nLeave the suspension to stir for 1 h at 400 rpm.\nTake the beaker off the stirrer plate and leave to settle overnight.\nWash the suspension by pouring off the supernatant and adding 500 mL deionized water and stirring for 1 min at 400 rpm. Repeat this step three times in total, with 2 h between each wash.\nLeave nHA suspension to settle overnight.\nPour off the clear supernatant and place the settled nHA suspension in a drying oven set at 60 to 80 °C.\nWhen dry, place the dried nHA into an agate mortar and pestle and grind until fine.",
    "Place 2.5 g of produced nHA powder in an alumina crucible and sinter powder at 1,000 °C for 2 h using a ramp rate of 10 °C/min. After the heat treatment, leave the nHA to cool in the furnace.\nStore powders in a vacuum desiccator.\n2. Characterization of Nanoscale Hydroxyapatite\nX-ray diffraction (XRD) using transmission mode diffractometers\nPlace a small amount (i.e. less than 200 µL) of poly(vinyl alcohol) (PVA) glue on acetate film and mix with a small amount (i.e. less than 100 mg) of nHA powder.\nTreat with a hot air gun until dry.\nMount the sample into a sample holder and load onto a transmission mode X-ray diffractometer with Cu Kα radiation.\nUse diffractometer settings of 40 kV and 35 mA, with a 2θ range of 10-70°.\nAnalyze the resultant XRD patterns.\nUse the following XRD cards for phase identification: Hydroxyapatite: 9-432. β-tricalcium phosphate: 04-014-2292.\nTransmission electron microscopy (TEM)\nPlace a small amount of powder (i.e. less than 10 mg) in a bijou and add approximately 3 mL ethanol.\nUltra-sonicate sample for 15 - 30 minutes until a homogenous suspension is observed.\nPipette a small amount of solution (i.e. less than 1 mL) onto a 400 mesh copper grid with carbon film, and allow to dry.\nImage samples at an accelerating voltage of 80 kV.\nX-ray fluorescence (XRF) service by the Materials and Engineering Research Institute (MERI) at Sheffield Hallam University\nCombine 0.8 g nHA powder with 8 g of lithium tetraborate.\nMelt mixture in a platinum-gold alloy crucible using a furnace set to 1,200 °C.\nAnalyze resultant samples in an XRF spectrometer to determine the elemental composition of the samples.\nFourier-transform infrared spectroscopy in attenuated total reflectance mode (FTIR-ATR)\nPerform 64 background scans from 4,000 - 500 cm-1 with a resolution of 4 cm-1.",
    "Place a small amount (i.e. less than 100 mg) of nHA powder on top of the diamond in the attenuated total reflectance mode adapter and compress onto the surface of the diamond using the screw top.\nPerform 32 scans from 4,000 - 500 cm-1 with a resolution of 4 cm-1 with the background scans subtracted from the sample scans."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}