{
  "id": 7206,
  "origin_website": "Bio",
  "title": "Isolation of GFP-expressing Malarial Hypnozoites by Flow Cytometry Cell Sorting",
  "procedures": [
    "The different steps of the protocol are depicted in Figure 1 and described in detail below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4006/bioprotoc-11-09-4006-g001.jpgFigure 1. Overview of the procedure. Briefly, primary macaque hepatocytes are plated into collagen-coated 96-well plates, and after 2-3 days are inoculated with GFP-expressing P. cynomolgi sporozoites isolated from A. stephensi mosquitoes. At 6 days post-inoculation the culture is imaged using an Operetta high content imager to assess the presence of hypnozoites and schizonts. The cells are then detached by trypsinization and this pooled material is used for flow cytometry cell sorting of hypnozoites and schizonts.Infection and culture of macaque primary hepatocytes with transgenic P. cynomolgi parasitesPlate 65 × 103 macaque primary hepatocytes per well (96-well plates; see Note 2) and maintain the culture at 5% CO2 and 37°C in William’s B medium (100 µl per well; see Recipe 1) supplemented with 2% DMSO. Hepatocytes can be freshly isolated or used from a cryopreserved stock. After 2-3 days, inoculate the cultures with 50 × 103 fluorescent transgenic P. cynomolgi sporozoites per well (Voorberg-van der          Wel et al., 2013        ) as described in https://bio-protocol.org/e3722[href=https://bio-protocol.org/e3722].Maintain the culture in William’s B medium without DMSO (this affects parasite development) at 5% CO2 and 37°C; refresh the medium three times per week by removing as much culture medium as possible, followed by gently adding fresh William’s B medium (100 µl per well). Routinely, the culture is maintained for 6 days because at that time, hypnozoites and developing liver stages can be distinguished based on their size.Culture alongside uninfected wells with macaque primary hepatocytes as the control (≥6 wells of a 96-well plate).Harvesting cellsOn the day of harvest, check the quality of infection (for reference) by live imaging on a fluorescence microscope/High Content Imager (Voorberg-van der          Wel et al., 2013        ). Please see the image in the flowchart for an example.",
    "Further insights into liver-stage parasite development can be gained from Voorberg-van der         Wel et al. (2020)        .Remove the supernatant from the 96-well plates and wash with 1× in PBS (100 µl/well).Remove the supernatant and add 30-50 µl pre-warmed (at 37°C) 0.25% trypsin/EDTA per well; incubate for 3 min at 37°C until the cells have detached (check with an inverted microscope).Add 100 µl William’s B medium per well to stop trypsinization.Mix by gently pipetting up and down (using a multichannel pipette) and pool the contents of the wells (containing the detached cells and fluids) into a reagent reservoir.Transfer the material into a 50-ml tube and spin (2 min 200 × g, RT, brake medium).Wash twice in 20% William’s B medium (each time spin 2 min 200 × g, RT, brake medium).Pass the sample, while gently pipetting up and down, through a cell strainer snap cap (on top of 5-ml round-bottomed polystyrene test tubes) to exclude clumps.Keep cells on ice until sorting.Fluorescence-activated cell sortingPre-cool the sample loader at 4°C and rotate at 300 rpm during cell sorting.Set up the FACSAria according to the manufacturer’s procedures, e.g., run Cytometer Setup and Tracking beads (CS&T).Install a 100-µm nozzle and set the sheath pressure to 20 psi (default setting).Record 100,000 events of the uninfected hepatocyte culture as well as the transgenic liver-stage parasite culture to check the gating settings.Insert 1.5-ml collection tubes filled with 300 µl TRIzol if the material is to be used for transcriptomicsNB: TRIzol is toxic: fill the tubes in the fume hood and dispose of the waste separately. Sort (sort precision: 4-way purity mode) the fractions of interest (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4006/bioprotoc-11-09-4006-g002.jpgFigure 2. Gating strategy for sorting hypnozoites and schizonts on day 6. Parasite populations are gated based on FITC expression.",
    "The GFPlow gate contains hypnozoites and the GFPhigh gate contains developing forms (schizonts). The GFPdim gate contains a mixture of parasites.When approximately half of the sample has been sorted, sort a small amount of sample into 100 µl 20% William’s B (collect about 100 GFPlow and GFPhigh events each; also take a sample of the other fractions at the same time) and transfer to a 96-well plate for a quality check of the Operetta system (Voorberg-van der          Wel et al., 2013        ).When the sort has finished, vortex the TRIzol tubes for 30 s and transfer to the -80°C freezer."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}