{
  "id": 5774,
  "origin_website": "Bio",
  "title": "Construction of a Single Transcriptional Unit for Expression of  Cas9 and Single-guide RNAs for Genome Editing in Plants",
  "procedures": [
    "Design sgRNAs to target the genes of interest   Select appropriate sgRNA targets for the genes of interest using the online sgRNA design tools such as CRIPSR-P v2.0 (http://cbi.hzau.edu.cn/CRISPR2/[href=http://cbi.hzau.edu.cn/CRISPR2/]); CRISPR RGEN tools (http://www.rgenome.net/cas-offinder/[href=http://www.rgenome.net/cas-offinder/]); E-CRISP (http://www.e-crisp.org/E-CRISP/designcrispr.html[href=http://www.e-crisp.org/E-CRISP/designcrispr.html]). These are several web-based tools available for sgRNA design. They have mainly the same functions in sgRNA design and Off-target prediction. The main difference is the algorithm of the scoring system. Notes: sgRNA targets containing a restriction enzyme site at the Cas9 cleavage site would contribute to identify mutant using polymerase chain reaction-restriction endonuclease digestion assay.    Design and order forward and reverse oligonucleotides for cloning sgRNA into the STU CRISPR-Cas9 expression vector. (1) the forward sgRNA oligonucleotide contains a ‘CGGA’ sequence at the 5’ end followed by 20 bases of sgRNA targets without PAM sites (N20); (2) the reverse sgRNA oligonucleotide contains an ‘AAAC’ at the 5’ end followed by the reverse complement of N20. For example, if the target site is GTTGGTCTTTGCTCCTGCAGAGG (AGG is PAM), the forward and reverse oligonucleotides should be: Forward oligonucleotide:5’-CGGAGTTGGTCTTTGCTCCTGCAG-3’ Reverse oligonucleotide:5’-AAACCTGCAGGAGCAAAGACCAAC-3’      Annealing of sgRNA oligos   Mix 10 µl of the forward and reverse oligos (100 µM) of each sgRNA in separate microtubes.   Incubate the microtubes at 95 °C for 5 min in a heating block or thermal cycler.   Allow the microtubes to slowly cool down to room temperature.   Make a 1:200 dilution of the annealed mixture with deionized water.      Vector cloning Two methods could be used to clone sgRNAs into the STU CRISPR-Cas9 expression vector: Cut and ligation or Golden Gate method (Figure 2). These two methods are the same in procedure including BsaI digestion and T4 DNA ligase ligation. The Golden Gate reaction is much easier because the digestion and ligation will process in one PCR tube, and it may save some time.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830201548_6348.jpg Figure 2.",
    "Schematic illustration of the cloning procedure described in the protocol    Cut and ligation   Linearize the STU CRISPR-Cas9 plasmid pTX171 or pTX172 with BsaI. Incubate at 37 °C for 2-4 h. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830204735_0822.jpg    Load digestion products onto a 1% agarose gel for electrophoresis. Purify the digested vector using the AxyPrepTM DNA Gel Extraction Kit, and quantify DNA concentration using NanoDrop.   Ligate the diluted annealed oligos into linearized STU CRISPR-Cas9 expression vector, incubate at 16 °C overnight or room temperature for 1-2 h. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830204813_9428.jpg    Transform 5 μl of the reaction into 50 μl competent DH5ɑ cells, spread the transformed cells on LB plates supplemented with 50 mg/L kanamycin, and then incubate overnight at 37 °C.    Verify the positive clones by colony PCR and Sanger sequencing.     Golden Gate method (Make sure annealed sgRNA oligos don’t contain BsaI site)   Set up a Golden Gate reaction for cloning sgRNAs into the STU Cas9 expression vector. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830204900_2220.jpg    Incubate Golden Gate reactions in a thermal cycler using the following program: 10 cycles of 5 min at 37 °C and 10 min at 16 °C, then heat to 37 °C for another 5 min and 80 °C for 10 min.   Transform 5 μl of the reaction into 50 μl competent DH5α cells, spread the transformed cells on LB plates supplemented with 50 mg/L kanamycin, and then incubate overnight at 37 °C.   Verify the positive clones by colony PCR and Sanger sequencing. Colony PCR can be performed with the forward sgRNA oligonucleotide (e.g., see step A2) and ZY065-RB: (5’-ttctaataaacgctcttttctct-3’). The expected product size is approximately 230 bp. ZY065-RB can be used for sequencing.        Two sgRNAs can be cloned into the STU CRISPR-Cas9 expression vector to target two sites simultaneously (Figure 2).",
    "Design two primers as follows: BsaI-sgRNA01-F: 5’-CAGGTCTCACGGA-N20-gttttagagctagaaatagcaagttaa-3’ BsaI-sgRNA02-R: 5’-TCGGTCTCCAAAC-N20-tccggtgacaaaagcaccga-3’ GGTCTC is the BsaI recognition sequence; ‘N20’ is same as the sgRNA01 target-specific sequence; ‘N20’ is the reverse complement of the sgRNA02 target-specific sequence; The lowercase letters are complementary with the STU CRISPR-Cas9 expression vector. Note: PAGE purified oligos are highly recommended, desalted is also OK.   Set up a 50 μl PCR reaction to amplify DNA for STU CRISPR-Cas9 expression vector construction. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830204937_9241.jpg    Run PCR in a thermal cycler with the following program: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205011_5352.jpg    Load PCR products onto a 1% agarose gel for electrophoresis. Purify the PCR products using the AxyPrepTM DNA Gel Extraction Kit, and quantify DNA concentration using NanoDrop.   Set up a Golden Gate reaction for cloning two sgRNAs into the STU CRISPR-Cas9 expression vector. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205036_2231.jpg    Incubate Golden Gate reactions in a thermal cycler using the following program: 10 cycles of 5 min at 37 °C and 10 min at 16 °C, then heat to 37 °C for other 5 min and 80 °C for 10 min.   Transform 5 μl of the reaction products into 50 μl competent DH5α cells, spread the transformed cells on LB plates supplemented with 50 mg/L kanamycin, and then incubate overnight at 37 °C.   Verify the positive clones by colony PCR and Sanger sequencing.      Our STU CRISPR-Cas9 system has the potential for multiplex sites genome editing. For more than two sites within one STU CRISPR-Cas9 vector, two-round PCR could be performed to clone different sgRNAs into the expression vector (Figure 2).   Design primers as follows: BsaI-sgRNA01-F: 5’-CAGGTCTCACGGA-N20-3’ sgRNA01-F: 5’-N20-gttttagagctagaaatagcaagttaa-3’ sgRNA02-F: 5’-N20-gttttagagctagaaatagcaagttaa-3’ sgRNA02-R: 5’-N20-tccggtgacaaaagcaccga-3’ … sgRNA(n-1)-F: 5’-N20-gttttagagctagaaatagcaagttaa-3’ sgRNA(n-1)-R: 5’-N20-tccggtgacaaaagcaccga-3’ sgRNA(n)-R: 5’-N20-tccggtgacaaaagcaccga-3’ BsaI-sgRNA(n)-R: 5’-TCGGTCTCCAAAC-N20-3’ GGTCTC is the BsaI recognition sequence; ‘N20’ is same as the target-specific sequence; ‘N20’ is the reverse complement of the target-specific sequence; The different colors represent different target-specific sequences (e.g.",
    ", N20, N20, N20, N20). The lowercase letters are complementary with the STU CRISPR-Cas9 expression vector.   Set up 1st round PCR reactions to amplify sgRNAs fragments with ribozyme cleavage site flanked using primer pairs (sgRNA01-F/sgRNA02-R, sgRNA02-F/sgRNA03-R…sgRNA(n-1)-F/sgRNA(n)-R). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205102_5224.jpg    Run PCR in a thermal cycler with the following program: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205121_2959.jpg    Load PCR products onto a 1% agarose gel for electrophoresis. Purify the PCR products using the AxyPrepTM DNA Gel Extraction Kit, and quantify DNA concentration using NanoDrop.   Set up 2nd round PCR reaction to link the different sgRNAs with ribozyme cleavage site into one fragment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205148_5467.jpg    Run PCR in a thermal cycler with the following program: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205223_6333.jpg    Load PCR products onto a 1% agarose gel for electrophoresis. Purify the PCR products using the AxyPrepTM DNA Gel Extraction Kit, and quantify DNA concentration using NanoDrop.   Set up a Golden Gate reaction for cloning multiplex sgRNA Fragment into the STU CRISPR-Cas9 expression vector. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170830/20170830205317_4113.jpg    Incubate Golden Gate reactions in a thermal cycler using the following program: 10 cycles of 5 min at 37 °C and 10 min at 16 °C, then heat to 37 °C for other 5 min and 80 °C for 10 min.   Transform 5 μl of the reaction products into 50 μl competent DH5α cells, spread the transformed cells on LB plates supplemented with 50 mg/L kanamycin, and then incubate overnight at 37 °C.   Verify the positive clones by colony PCR and Sanger sequencing."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}