{
  "id": 4679,
  "origin_website": "Bio",
  "title": "Chlorophyll Fluorescence Measurements in <em>Arabidopsis</em> Plants Using a Pulse-amplitude-modulated (PAM) Fluorometer",
  "procedures": [
    "Protocol for using the MINI-PAM as referenced from the official instruction manual (TEACHING-PAM has a similar protocol and as such is not included here). Basically the most relevant fluorescence parameters of MINI-PAM are automatically obtained by a single key operation within a second and up to 4,000 data sets are stored for future analysis:(For reference, information regarding the MINI-PAM-II can be downloaded from the following URL: http://www.walz.com/downloads/manuals/mini-pam-II/MINI-PAM-II_Broschure.pdf.[href=http://www.walz.com/downloads/manuals/mini-pam-II/MINI-PAM-II_Broschure.pdf])Plants grown normally for 3 weeks are dark-adapted for 20 min before chlorophyll fluorescence measurements. *In our case, dark-adapted means the plants are kept either in a dark drawer (for plated plants) or covered with a large box (for potted plants), in both cases in rooms with dark curtains and no artificial light sources.Setup the MINI-PAM components. Additional peripheral components were connected to the four sockets at the side of the MINI-PAM Main Control Unit. PIN-assignments of “LEAF CLIP”, “RS 232”, “OUTPUT” and “CHARGE” indicate a Leaf Clip holder 2030-B, Computer control, Chart recorder and Battery Charger, respectively. The MINI-PAM was conceived as a typical stand-alone instrument for field experiments. Thus the actual measurement of the most relevant YIELD-parameter (quantum yield of photochemical energy conversion) just connected the fiberoprtics and leaf clip holder without conjunction with a PC and the WinControl software. So this protocol introduces the basic operation of the MINI-PAM without using computer control.Activate the MINI-PAM by pressing the “ON” button. Under standard conditions, the measuring light is on automatically. The AUTO-ZERO function (MODE-menu point 2) should be applied to determine the signal in absence of sample (background signal). To move to MODE-menu point 2, press “MODE” button (possible to omit) and “∧” button one times to select 2 of 51 points of the MODE-menu.",
    "Then push “SET” button to set the F value to zero (not stable, blinking) on measuring light (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429192257_3352.jpgFigure 2. F value blinks “0” after pressing the “SET” buttonPlace a dark-adapted leaf sample on the measuring head of the Leaf Clip holder. The distance between sample and fiberoptics should be about 10-15 mm (Figure 3).We dark-adapt the plants by either putting them in drawers (for dished plants) or covering them with boxes (for potted plants) – in both cases dark curtains are used and all artificial lights are turned off. Temperature when measuring should be the same as the growth environment.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429192625_3459.jpgFigure 3. A photo of the leaf clip holder and fiberopticsJust press the “START” button. Measuring the fluorescence parameters is proceeding automatically within seconds (see below). the minimum fluorescence in dark-adapted state (Fo) is sampled (displayed as ...F).a saturation pulse is applied.a saturation pulse induced maximum fluorescence in dark-adapted state (Fm) is sampled (displayed as …M).YIELD=(Fm-Fo)/Fm=Fv/Fm is calculated and shown on the display as …Y.When you use the Leaf Clip holder, the photosynthetically active radiation (PAR) and temperature at the same spot of a leaf where fluorescence is measured is also sampled (displayed as …L and …C, respectively).The apparent rate of electron transport (ETR) =YIELD x PAR x 0.5 x ETR-factor (0.84) is calculated (displayed as …E).The parameter indicated by the above is shown to a screen after measurement (Figure 4). The obtained data are stored in the MEMORY.Arabidopsis plants under normal growth condition shows an Fv/Fm value between 0.75 to 0.85. (If Fm/Fv is not between 0.75 and 0.85, it is highly likely that the sample Arabidopsis plants are in poor health or not properly grown.)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429192644_0660.jpgFigure 4. A photo of the machine display after measurementIf you want to know only the Fv/Fm value, following analysis is not needed.",
    "On the other hand, when leaf is illuminated, its fluorescence yield can change between Fo and Fm, which can be assessed after well dark-adaptation. Lower Fm value under light conditions may be caused either by photochemical quenching or by non-photochemical quenching (NPQ). The quenching coefficients are defined as follows:qP=(Fm’-F)/(Fm’-Fo)qN=(Fm-Fm’)/(Fm-Fo)NPQ=(Fm-Fm’)/Fm’A saturation pulse induced maximum fluorescence during light adaptation (Fm’) is sampled (displayed as …M).These quenching coefficients need to sample four values (Fo, Fm, F and Fm’). Others are calculated values by using these four parameters. The value of Fo and Fm were previously measured by using a dark-adapted leaf sample. Thus, these values need to store in the MINI-PAM system.The MODE-menu point 25 (Fo and Fm) should be applied to store the values of Fo and Fm (Figure 5). This function to sample Fo and Fm of a dark-adapted leaf by use of the SET-key. The stored Fo and Fm values are used for determination of qP, qN and NPQ.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429192700_9140.jpgFigure 5. A photo of the display when setting Fo and Fm (“Mode” menu 25)Then light adapted leaf samples are prepared. A same as a dark-adapted leaf sample, press the “START” button on procedure 6. Measuring the fluorescence parameters under light condition is proceeding automatically within seconds and calculated qP, qN and NPQ as well as YIELD (Fv’/Fm’), ETR and PAR. The obtained data are stored in the MEMORY.Recall on display via MEM-key. Push “MEM” button and select measured sample by using “∧” and “∨” button.In the top line it can be seen the data set number and recording day time (Figure 6A). The bottom line shows YIELD (Y), ETR (E) and PAR (L).More information of data set can be displayed by pushing “SET” button.",
    "After the first SET, the top line shows the fluorescence yield measured briefly before the saturating light pulse (F), the maximum fluorescence (M) and temperature (C) (Figure 6B).After the second SET, the top line shows the quenching coefficients qP (P), qN (N) and NPQ (Q) (Figure 6C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429192716_6232.jpgFigure 6. A photo showing the display for “Mode” menu 25. A. The first display line shows data set number and recording day/time. The second line shows YIELD (Y), ETR (E) and PAR (L).  B. The first display line shows the fluorescence yield measured briefly before saturating light pulse (F), the maximum fluorescence (M) and temperature (C). C. The first display line shows the quenching coefficients qP (P), qN (N) and NPQ (Q).Repeat the same measurement at least four times and average results."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}