{
  "id": 8070,
  "origin_website": "Bio",
  "title": "Culture of Rat Olfactory Ensheathing Cells Using EasySep® Magnetic Nanoparticle Separation",
  "procedures": [
    "Coating tissue culture flask with poly-L-Lysine (PLL, MW ~100,000)Make up 4 mg/ml of pLL in ddH2O (e.g. dilute 25 mg in 6.25 ml), filter sterilise using 0.22 μm filter and store at -20 °C. For use dilute 1:300 in dH2O (final concentration 13.3 μg/ml). Follow the protocol provided with the EasySep® \"Do-It-Yourself\" Selection Kit to make up the positive selection antibody cocktail. Briefly, add 15 μg (15 μl) of mouse IgG1 P75NTR to a 1.5 ml microcentrifuge tube. Add 100 μl of component A (supplied in the kit) to the vial and mix well. Add 100 μl of component B (supplied in the kit) to the vial and mix well. Tightly cap the vial and place it into a humidified 37 °C incubator in 7% CO2 overnight. The following day bring the vial to a final volume of 1.0 ml by adding 985 ml PBS. The positive selection antibody cocktail is now ready for use.Dissect out the olfactory bulbs from postnatal rat pups by first decapitating the pups under Home Office License. Pin the head dorsal-side up onto a dissecting board and spray with 70% ethanol. Using sterile instruments remove the skin from the head using curved scissors and make a large circular cut to remove the skull to reveal the brain and the two olfactory bulbs at the nose tip. Using curved forceps gently remove the olfactory bulbs. Enzymatically digest the bulbs in 1.33% collagenase (MP Biomedicals UK, 195109 Type I) in 500 μl of L15 media containing 50 μg/ml gentamicin in a 7 ml plastic bijou bottle. The tissue mix is placed in a humidified 37 °C incubator in 7% CO2 for 15 min to aid dissociation. After dissociation DNase (500 μl) of stock containing 0.04 mg/ml bovine pancreas DNAse and 3.",
    "0 mg/ml bovine serum albumin fraction v diluted in L15 is added to prevent cell clumping and the tissue is dissociated by passing gently and slowly through syringes carrying a 21 gauge needle first followed by a 23 G needle. The cell suspension is transferred to a 15 ml Nunc sterile centrifuge tube and spin at 1,200 rpm (~480 x g) for 5 min and plate cells in OEC media in a 25 cm2 flask, and replace half the medium twice a week. After 1 week in culture remove cells off the flask using trypsin. First wash the monolayer with 2.0 ml of PBS, remove and then add 1 ml of PBS containing 100 μl of trypsin (10x) and allow the cells to detach for 1-2 min in the incubator. Add 1 ml of 2% FBS to neutralise the trypsin, spin down cells to generate an unpurified mixed of olfactory bulb cells (Higginson and Barnett, 2011).Using 5 ml 2% FBS, wash detached cells through a 40 μm cell strainer and centrifuge at 1,200 rpm for 5 min. Resuspend cell pellet in 100 μl 2% FBS and transfer them to a 5 ml FACS tube.Add 10 μl of the positive selection cocktail that has been assembled in step 1 to the cell suspension. Mix well and incubate at room temperature for 15 min.Mix EasySep® Magnetic Nanoparticles to ensure that they are in a uniform suspension by pipetting up and down at least 5 times. Vortexing is not recommended. Add 5 μl of the magnetic nanoparticles and mix well. Incubate at room temperature for 10 min.Bring cell suspension to a total volume of 2.5 ml by adding 2% FBS. Mix the cells in the tube by gently pipetting up and down 2-3 times. Place the tube (without cap) into the EasySep® magnet.",
    "Set aside for 5 min.Pick up the magnet and in one continuous motion, invert the magnet and tube, pouring off the supernatant fraction. The magnetically labelled cells will remain inside the tube, held by the magnetic field. Leave the magnet and tube inverted for 2-3 sec then return to upright position. Do not shake or blot off any drops that may remain hanging from the mouth of the tube.Remove the tube from the magnet and add 2.5 ml of 2% FBS. Mix the cell suspension by gently pipetting up and down 2-3 times. Place the tube back in the magnet and set aside for a further 5 min.Repeat steps 7 to 9 once more, for a total of four 5 min separations in the magnet. Remove tube from magnet and resuspend cells in 3 ml OEC medium.Centrifuge the FACS tube containing the cells for 1,200 rpm (~480 x g) for 5 min to pellet the now purified OECs.Resuspend pellet in 50 μl of fresh OEC media and plate in a strip in a PLL coated T25 cm2 tissue culture flask. Allow cells to attach for 15 min at 37 °C. Cells are plated in a small strip to allow cells to attach to the flask in a high density which promotes viability.Flood flask with 3 ml OEC media and incubate at 37 °C, 7% CO2. We use 7% CO2 as this was a general protocol for all glial cells when the original purification of OECs was carried out in Prof Mark Noble’s lab (Barnett et al., 1993).After 7 days the strip of cells will be confluent and OECs can be harvested by standard trypsination and bulked up for further use.",
    "Using this system OECs will be at least 98-99% pure of any contaminating fibroblasts or other cells (see below image, Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130411/20130411001915_3153.jpgFigure 1. Image of P75NTR (green) positive OECs (blue DAPI to visualise nuclei)."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}