{
  "id": 7084,
  "origin_website": "Bio",
  "title": "CENP-C Phosphorylation by CDK1 <em>in vitro</em>",
  "procedures": [
    "Preparation of MBP-CENP-C (aa 601-864)Note: Although we describe the protocol for MBP-CENP-C (aa 601-864) phosphorylation using CDK1, the protocol can be applied for other kinases and their substrates for your interests. Purify recombinant MBP-CENP-C (aa 601-864) as described in Watanabe et al. (2019).Note: Briefly, the MBP-CENP-C (aa601-864) was expressed in bacteria, and purified with Amylose resin and Hi-Trap SP column with Superdex 200 pg. The purified protein was dissolved with buffer containing 20 mM HEPES-NaOH (pH 7.5), 500 mM NaCl, 5% Glycerol, 1 mM EDTA-NaOH (pH 8.0), and 1 mM DTT. The purified protein was snap-frozen in liquid nitrogen and stored at -80 °C. The frozen protein should be thawed on ice just before using. Prepare 1,000 ml of ice-cold 1x kinase buffer (listed in Recipes).Inject MBP-CENP-C (aa 601-864) into Xpress Micro Dialyzer up to 100 µl following the product instruction manuals and dialyze the protein in 1,000 ml of 1x kinase buffer for overnight at 4 °C.Note: Dialysis is important for removal of EDTA from your protein samples, and for adjustment of salt concentration for the next steps. Because high concentration of salt and EDTA inhibits kinase reaction and interferes phospho-protein running on Phos-tag SDS-PAGE. Collect the dialyzed MBP-CENP-C (aa 601-864) into a Protein Lobind Tube on ice.Analyze protein concentration using molecular absorptivity and molecular weight with NanoDrop 2000c Spectrometer (Desjardins et al., 2009).Note: Because in the next step the substrate is added for kinase reaction at 2 mg/ml (final concentration), if concentration of the protein is less than 2 mg/ml, concentrate protein using Amicon Ultra. Optimization of kinase reactionNote: To get optimum phosphorylation in the kinase reaction, several conditions can be optimized: substrate concentration, kinase amount, reaction buffer, and reaction time and temperature. Here, we demonstrate an example of optimization for reaction time in the kinase assay.",
    "Mix the dialyzed MBP-CENP-C (aa 601-864) in kinase buffer with 100 mM ATP, 25x cOmpleteTM EDTA-free proteinase inhibitor (listed in Recipes), active cyclin B-CDK1 (relative H1 kinase activity: 1.4 pmol P/min µl), and add 2x kinase buffer (listed in Recipes) and H2O to adjust concentration of each component to final concentration in 1x kinase buffer as described in Table 1 showing our representative 10 µl-scale reaction mixture.Notes: You can change the volume of the kinase reaction according to your experimental design. It is recommended to make small aliquots and store 100 mM ATP at -20 °C to avoid multiple freeze-thaw cycles. Purification of active cyclin B-CDK1 was described in Okumura et al. (1996). Table 1. Representative kinase reaction miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20201229/20201229215008_8655.jpg Incubate the 10 µl reaction mixture at 25 °C. Gently mix the sample with tapping every 15 min.Note: In this protocol, to examine optimum reaction time, several 10 µl-scale reactions are incubated for the indicated time periods in Figure 1 (0, 30, 60 and 90 min). To stop the reaction, add 10 µl of 2x Laemmli sample buffer (listed in Recipes) to the reaction mixture. Then, add further 20 µl of 1x Laemmli sample buffer to adjust protein concentration for SDS-PAGE in the next step (listed in Recipes), and heat samples for 5 min at 96 °C.Note: If you use the phosphorylated proteins for other in vitro assays such as a pull-down assay, stop the kinase reaction by adding 1 M EDTA-NaOH (pH 8.0) to the reaction mixture in a final concentration of 5 mM. Detection of phosphorylated substrates using Phos-tag SDS-PAGEPrepare a Phos-tag 5(w/v)%-Acrylamide/Bis (29:1) gel (25 µM Phos-tag, listed in Recipes).Note: To obtain optimum separation of phosphorylated proteins in the Phos-tag SDS-PAGE, Phos-tag and acrylamide concentrations should be optimized. Assemble the gel into an electrophoresis chamber (listed in Equipment).",
    "Add SDS-PAGE running buffer to electrophoresis chamber (listed in Recipes).Load 0.5 µg of phosphorylated protein each lane in 1x Laemmli sample buffer, and also 5 µl of molecular weight marker on the gel.Note: If your molecular weight marker includes salts and/or EDTA, which interfere sample running in the next lanes on Phos-tag SDS-PAGE. To avoid this problem, an empty lane should be inserted between the molecular weight marker and the next sample. Run gels using 35 mA constant current for 55 min.After electrophoresis, wash gels with water for 5 min using Invitroshaker (speed 60).Remove water and fill gel with 50 ml of CBB Stain One. Warm the gel with CBB stain One by a 700 W microwave oven for 1 min (approximately 70 °C).Shake the gel for 10 min at room temperature using Invitroshaker (speed 60).Remove CBB stain One and wash gel with water for 1 min twice using Invitroshaker (speed 60).Fill gel with 50 ml of new water. Warm the gel with water by a 700 W microwave oven for 1 min (approximately 70 °C).Shake the gel with warmed water over 60 min at room temperature using Invitroshaker (speed 60).Remove water and wash gel with water twice and acquire images of the stained gel using an image scanner.Detection of phosphorylated substrates using regular SDS-PAGENote: To examine protein levels and qualities of substrates, use a conventional SDS-PAGE, because it is difficult to compare protein levels precisely and detect small amount of protein fragments on the Phos-tag SDS-PAGE. This procedure is optional, but we highly recommend it, because some proteins may be degraded during the kinase reaction. Prepare Super SepTM Ace, 5-20%, 17-well SDS precast gel.Assemble the gel into an electrophoresis chamber (listed in Equipment).Add SDS-PAGE running buffer to electrophoresis chamber (listed in Recipes).Load 0.",
    "5 µg of phosphorylated protein each lane in 1x Laemmli sample buffer, and also 5 µl of molecular weight marker on the gel.Run gels using 35 mA constant current for 55 min.After electrophoresis, wash gels with water for 5 min.Remove water and fill gel with 50 ml of CBB Stain One. Warm the gel with CBB stain One by a 700 W microwave oven for 1 min (approximately 70 °C).Shake the gel for 10 min at room temperature using Invitroshaker (speed 60).Remove CBB stain One and wash gel with water for 1 min twice using Invitroshaker (speed 60).Fill gel with 50 ml of new water. Warm the gel with water by a 700 W microwave oven for 1 min (approximately 70 °C).Shake the gel with warmed water over 60 min at room temperature using Invitroshaker (speed 60).Remove water and wash gel with water twice and acquire images of the stained gel using an image scanner."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}