{
  "id": 18604,
  "origin_website": "Jove",
  "title": "Robotic Ablation of Atrial Fibrillation",
  "procedures": [
    "The protocol presented here is the standard approach of robotic catheter ablation RCS at the department of cardiology, Charité – Universitätsmedizin Berlin, Campus Virchow. The protocol and analysis of procedures and patient outcomes was approved by the local ethics committee of the Charité - Universitätsmedizin Berlin.\n1. The Remote Catheter System (RCS)\nAttach the robotic arm to the operating table, as described before7 (Figure 1).\n\tNOTE: The RCS consists of a remote catheter manipulator, which is a robotic arm that can be moved by remote control.\nPlace the ablation catheter in the docking station of the RCS. Manipulate the catheter with the use of a remote controller, while the operating physician stays out of the radiation field7. Advance, withdraw, rotate and deflect the catheter with the use of the RCS.\n2. Pre-ablation Preparation\nPosition the patient on the operating table and induce deep sedation with Midazolam (0.03 mg/kg bolus) and Propofol (continuous infusion 4 mg/kg/hr).\nPlace a temperature probe in the esophagus to measure esophageal temperature and prevent esophageal injury.\nAttach 12-lead ECG and surface electrodes of the 3D-Mapping system to the body of the patient.\nBefore starting the procedure ensure that the following material are ready.\n\t\nA transseptal needle (71 cm) and an 8.5 F SL0 sheath with guidewire. A 6 F and 7 F 25 cm sheath. A decapolar and a circular streerable diagnostic catheter. An open-irrigated ablation catheter and an ablation generator.\nAdditionally, ensure that a contrast syringe and a pericardiocentesis tray are available for acute treatment of complications.\nPosition the robotic arm of the system in a sterile drape and ready to use. Attach the handheld remote controller to the robotic arm (Figure 1).",
    "Obtain venous access via bilateral venous puncture with a 6 F, 7 F and 8.5 F sheath and place a decapolar diagnostic catheter in the coronary sinus (CS).\nPerform transseptal puncture under fluoroscopic guidance using a 8.5 F long SLO sheath and a 71 cm transseptal needle.\nAfter trans-septal puncture, remove the needle and introduce a guide wire via the trans-septal sheath in the left superior pulmonary vein. Then draw back the sheath in the inferior vena cava.\nPlace a 8.5 F long SRO sheath with a wire in the left atrium (LA), using the wire as guide to the fossa ovalis and the LA (“one-puncture, double-access”-technique). Advance an open-irrigated ablation catheter with a 3.5 mm tip with contact force measurement via the SR0 sheath to the LA.\nAdminister Heparin with a rate of 15 UI/kg/h following a bolus of 140 IU/kg to maintain an activated clotting time (ACT) between 300 and 350 sec throughout the procedure.\nOnce the ablation catheter has entered the LA, introduce the sheath into the LA as well. Remove the guide wire and dilator of the SLO sheath and place the ablation catheter in the left ventricle. Perform LA angiography over the sheath, while using the ablation catheter for high rate ventricular pacing to enhance contrast opacification (LA angiography is shown in Figure 2A).\nAdvance a circular mapping catheter via the long sheath into the LA (circular mapping catheter shown in Figure 2B).",
    "Perform a 3-D anatomical reconstruction of the LA with the use of a mapping system and the circular mapping catheter. Create a 3-D-anatomical reconstruction of the LA by moving the circular catheter on the inner surface of the LA, all of the four PVs and the left atrial appendage, while using a computerized mapping system for registration of the movement in relation to a reference electrode (complete 3-D-map is shown in Figure 2C and D).\nPlace the circular mapping catheter in the right superior PV to record PV potentials and confirm conduction block after PVI. Draw back the ablation catheter from the left ventricle to the left atrium (target position of both catheters shown in Figure 2B).\nDrape the RCS with a sterile cover. Position the handle of the ablation catheter in the robotic arm of the amigo system.\n3. Ablation Procedure\nPerform catheter ablation as wide antral circumferential ablation (WACA) using a maximal temperature of 43 °C and maximum power of 35 W (septal) or 25 W (posterior wall) respectively ad a flow rate of 17 ml/min. Manipulate the ablation catheter via the robotic arm with the use of a remote control from outside the radiation field.\nPerform ablation by creating point-by-point lesions around the left and right PV ostia. Measure contact force during ablation. Use the local electrogram amplitude reduction recorded on the tip of the ablation catheter, elimination or dissociation of the PV electrograms on the circular catheter and entry/exit block as ablation endpoints.\nMark each ablation point on the 3-D reconstruction.\nConfirm conduction block for every single PV by recording potentials on the circular mapping catheter inside the PV (entry block) and by pacing from inside the PV without capture of the atrium (exit block).\n4. Post-ablation Procedure and Patient Recovery",
    "Stop Propofol infusion and remove all catheters.\nMeasure activated clotting time (ACT) and administer 3,000 IE protamine if ACT >300 sec before removal of sheaths. Remove the sheaths and perform manual compression on the puncture site for 10 min and until the bleedings stops. Place a pressure dressing in the groin and advise the patient to lay still for 8 hr.\nTransfer patient to a step down unit and monitor for 4 hr and until fully responsive.\nAdminister low molecular weight heparin as anticoagulant until discharge. Begin oral anticoagulation (Warfarin or a direct oral anticoagulant) on the day after the procedure.\nPerform transthoracic echocardiography on the day after the procedure as described before17. Rule out pericardial effusion and determine valvular function and left ventricular ejection fraction17."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}